{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14189",
  "eid" : "12ba0f80-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778540664,
  "textBody" : "Haryana, carved out of the former state of East Punjab on 1November 1966 on linguistic basis, is one of the 29 states in India. Situated in North India with less than 1.4% (44212 km2) of India's land area, it is ranked 21st in terms of area. Chandigarh is the capital, Faridabad in National Capital Region is the most populous city of the state and the Gurugram is the financial hub of NCR with major Fortune 500 companies located in it. Haryana has 6 administrative divisions, 22 districts, 72 sub-divisions, 93 revenue tehsils, 50 sub-tehsils, 140 community development blocks, 154 cities and towns, 6,841 villages and 6212 villages panchayats.\n\nAs the largest recipient of investment per capita since 2000 in India, and among one of the wealthiest and most economically developed regions in South Asia, Haryana has the India's third highest per capita income at  against the national average of  in year 2016–17. Haryana's 2017-18 estimated state GSDP of US$95 billion (52% services, 30% industries and 18% agriculture) is growing at 12.96% 2012-17 CAGR and placed on the 14th position behind only much bigger states, is also boosted by 30 SEZs (mainly along DMIC, ADKIC and DWPE in NCR), 7% national agricultural exports, 60% of national Basmati rice export, 67% cars, 60% motorbikes, 50% tractors and 50% refrigerators produced in India. Faridabad has been described as eighth fastest growing city in the world and third most in India by City Mayors Foundation survey.http://www.citymayors.com/statistics/urban_growth1.html In services, Gurugram ranks number 1 in India in IT growth rate and existing technology infrastructure, and number 2 in startup ecosystem, innovation and livability (Nov 2016).\n\nAmong the world's oldest and largest ancient civilizations, the Indus Valley Civilization sites at Rakhigarhi village in Hisar district and Bhirrana in Fatehabad district are 9,000 years old. Rich in history, monuments, heritage, flora and fauna, human resources and tourism with well developed economy, national highways and state roads, it is bordered by Himachal Pradesh to the north-east, by river Yamuna along its eastern border with Uttar Pradesh, by Rajasthan to the west and south, and Ghaggar-Hakra River flows along its northern border with Punjab. Since Haryana surrounds the country's capital Delhi on three sides (north, west and south), consequently a large area of Haryana is included in the economically-important National Capital Region for the purposes of planning and development.\n\nEtymology\n\nThe name Haryana is found in the works of the 12th-century AD Apabhramsha writer Vibudh Shridhar (VS 1189–1230).An Early Attestation of the Toponym Ḍhillī, by Richard J. Cohen, Journal of the American Oriental Society,  1989, pp. 513–519\n: हरियाणए देसे असंखगाम, गामियण जणि अणवरथ काम|\n: परचक्क विहट्टणु सिरिसंघट्टणु, जो सुरव इणा परिगणियं|\n: रिउ रुहिरावट्टणु बिउलु पवट्टणु, ढिल्ली नामेण जि भणियं|\n: \n: Translation: there are countless villages in Haryana country. The villagers there work hard. They don't accept domination of others, and are experts in making the blood of their enemies flow. Indra himself praises this country. The capital of this country is Dhilli.\n\nThe name Haryana has been derived from the Sanskrit words Hari (the Hindu god Vishnu) and ayana (home), meaning \"the Abode of God\".[http://www.britannica.com/EBchecked/topic/256424/Haryana Haryana] Britannica Online Encyclopedia However, scholars such as Muni Lal, Murli Chand Sharma, HA Phadke and Sukhdev Singh Chib believe that the name comes from a compound of the words Hari (Sanskrit Harit, \"green\") and Aranya (forest).  However, it is unlikely that both forest and green which allude to each other, would be used as two different words in a single name.\n\nHistory\n\nPre-history \n\nThe Vedic state of Brahmavarta is claimed to be located in south Haryana, where the initial Vedic scriptures were composed after the great floods some 10,000 years ago. Manusmriti, a flood time document composed by Manu and Bhrigu is now dated at 10,000 years old. Rakhigarhi village in Hisar district and Bhirrana in Fatehabad district are home to the largest and one of the world's oldest ancient Indus Valley Civilization sites, dated at over 9,000 years old. Evidence of paved roads, a drainage system, a large-scale rainwater collection storage system, terracotta brick and statue production, and skilled metal working (in both bronze and precious metals) have been uncovered. According to archaeologists, Rakhigarhi may be the origin of Harappan civilisation, which arose in the Ghaggar basin in Haryana and gradually and slowly moved to the Indus valley.[https://swarajyamag.com/culture/did-climate-change-kill-the-indus-civilisation Did Climate Change Kill The Indus Civilisation?], Swarajya magazine, 31 May 2016.\n\nMedieval\n\nAncient bronze and stone idols of Jain Tirthankara were found in archaeological expeditions in Badli, Bhiwani (Ranila, Charkhi Dadri, Badhara village), Dadri, Gurgaon (Ferozpur Jhirka), Hansi, Hisar (Agroha), Kasan, Nahad, Narnaul, Pehowa, Rewari, Rohad, Rohtak (Asthal-Abohar) and Sonepat in Haryana.\n\nAfter the sack of Bhatner fort during the Timurid conquests of India in 1398, Timur attacked and sacked the cities of Sirsa, Fatehabad, Sunam, Kaithal and Panipat. When he reached the town of Sarsuti, the residents, who were mostly non-Muslims, fled and were chased by a detachment of Timur's troops, with thousands of them being killed and looted by the troops. From there he travelled to Fatehabad, whose residents fled and a large number of those remaining in the town were massacred. The Ahirs resisted him at Ahruni but were defeated, with thousands being killed and many being taken prisoners while the town was burnt to ashes. From there he travelled to Tohana, whose Jat inhabitants were stated to be robbers according to Sharaf ad-Din Ali Yazdi. They tried to resist but were defeated and fled. Timur's army pursued and killed 200 Jats, while taking many more as prisoners. He then sent a detachment to chase the fleeing Jats and killed 2,000 of them while their wives and children were enslaved and their property plundered. From there he proceeded to Kaithal whose residents were massacred and plundered, destroying all villages along the way. On the next day, he came to Assandh whose residents were \"fire-worshippers\" according to Yazdi, and had fled to Delhi. Next he travelled to and subdued Tughlaqpur fort and Salwan before reaching Panipat whose residents had already fled. He then marched on to Loni fort.\n\nThe area that is now Haryana has been ruled by some of the major empires of India. Panipat is known for three seminal battles in the history of India. In the First Battle of Panipat (1526), Babur defeated the Lodis. In the Second Battle of Panipat (1556), Akbar defeated the local Haryanvi Hindu Emperor of Delhi, who belonged to Rewari. Hem Chandra Vikramaditya had earlier won 22 battles across India from Punjab to Bengal, defeating Mughals and Afghans. Hemu had defeated Akbar's forces twice at Agra and the Battle of Delhi in 1556 to become the last Hindu Emperor of India with a formal coronation at Purana Quila in Delhi on 7 October 1556. In the Third Battle of Panipat (1761), the Afghan king Ahmad Shah Abdali defeated the Marathas.\n\nFormation\n\nHaryana as a state came into existence on 1November 1966 the Punjab Reorganisation Act (1966). The Indian government set up the Shah Commission under the chairmanship of Justice JC Shah on 23 April 1966 to divide the existing state of Punjab and determine the boundaries of the new state of Haryana after consideration of the languages spoken by the people. The commission delivered its report on 31May 1966 whereby the then-districts of Hisar, Mahendragarh, Gurgaon, Rohtak and Karnal were to be a part of the new state of Haryana. Further, the tehsils of Jind and Narwana in the Sangrur district — along with Naraingarh, Ambala and Jagadhri — were to be included.\n\nThe commission recommended that the tehsil of Kharad, which includes Chandigarh, the state capital of Punjab, should be a part of Haryana. However, only a small portion of Kharad was given to Haryana. The city of Chandigarh was made a union territory, serving as the capital of both Punjab and Haryana.\n\nBhagwat Dayal Sharma became the first Chief Minister of Haryana.\n\nPeople\n\nDemographics and religion\n\nAccording to the 2011 census, of total 25,350,000 population of Haryana, Hindus (87.46%) constitute the majority of the state's population with Sikhs (4.91%), Muslims (7.03%) (mainly Meos) being the largest minorities.\n\nAmong Hindus, Jats (25% to 28%) are the single largest and socio-economically dominant caste, followed by the OBC (24%, including Ahir, Sain, Yadava, etc., excluding Jats), SC (21% , dalits, Balmiki, Chamar, Dhanak, Khatik, etc.) and other non-dalit non-SC castes (11% to 14%, such as Brahmins, Baniya, Ror )and(16% to 17%,Khatris ).\n\nMuslims are mainly found in the Mewat and Nuh districts. Haryana has the second largest Sikh population in India after Punjab, and they mostly live in the districts adjoining Punjab, such as Hisar, Sirsa, Jind, Fatehabad, Kaithal, Kurukshetra, Ambala, Narnaul and Panchkula karnal.\n\nLanguages\n\nHindi was the sole official language of Haryana till 2010 and it is spoken by the majority of the population (87.31%). Haryana has 70% rural population who primarily speak Haryanvi dialect of Hindi, as well as other related dialects, such as Bagri and Mewati.\n\nTamil was once given nominal official status in Haryana, purportedly as a rebuff to Punjab, though there was no attested Tamil-speaking population in the state, and was later replaced by Punjabi, in 2010.\n\nCulture\n\nHaryana has its own unique traditional folk music, folk dances, saang (folk theater),Sachchidananda Encyclopaedic Profile of Indian Tribes Volume 1 - 1996 817141298X p416. cinema, belief system such as Jathera (ancestral worship),A Glossary of the tribes & castes of Punjab by H. A Rose and arts such as Phulkari and Shisha embroidery.\n\nFolk theater and dances\n\nFolk music and dances of Haryana are based on satisfying cultural needs of primarily agrarian and martial natures of Haryanavi tribes.\n\nHaryanvi musical folk theater main types are Saang, Rasa lila and Ragini. The Saang and Ragini form of theater was popularised by Lakhmi Chand.Manorma Sharma, 2007, [https://books.google.com.sg/books?isbn\n8131300463 Musical Heritage of India], Page 65.\n\nHaryanvi folk dances and music have fast energetic movements. Three popular categories of dance are: festive-seasonal, devotional, and ceremonial-recreational. The festive-seasonal dances and songs are Gogaji/Gugga, Holi, Phaag, Sawan, Teej. The devotional dances and songs are Chaupaiya, Holi, Manjira, Ras Leela, Raginis). The ceremonial-recreational dances and songs are of following types: legendary bravery (Kissa and Ragini of male warriors and female Satis), love and romance (Been and its variant Nāginī dance, and Ragini), ceremonial (Dhamal Dance, Ghoomar, Jhoomar (male), Khoria, Loor, and Ragini).\n\nFolk music and songs \n\nHaryanvi folk music are based on day to day themes and injecting earthy humor enlivens the feel of the songs. Haryanvi music takes two main forms: \"Classical folk music\" and \"Desi Folk music\" (Country Music of Haryana), and sung in the form of ballads and love, valor and bravery, harvest, happiness and pangs of parting of lovers.S. C. Bhatt and Gopal K. Bhargava, 2006, [https://books.google.com.sg/books?isbn8178353652 Land and People of Indian States and Union Territories: 21 Arts and Crafts of Haryana].[S. Gajrani, 2004, [https://books.google.com.sg/books?isbn=818205060X History, Religion and Culture of India], Volume 1, Page 96.\n\nClassical Haryanvi folk music\n\nClassical Haryanvi folk music is based on Indian classical music. Hindustani classical ragas, learnt in gharana parampara of guru–shishya tradition, are used to sing songs of heroic bravery (such as Alha-Khand (1663-1202 CE) about bravery of Alha and Udal, Jaimal Fatta of Maharana Udai Singh II), Brahmas worship and festive seasonal songs (such as Teej, Holi and Phaag songs of Phalgun month near Holi). Kissa legendary folklores of bravery and love such as Nihalde Sultan, Sati Manorama, Jai Singh ki Mrityu, Saran de, etc. are some of the most popular folklores. Bravery songs are sung in high pitch.\n\nDesi Haryanvi folk music\n\nDesi Haryanvi folk music (Haryanvi country folk music) The country-side or desi (native) form of Haryanvi music is based on Raag Bhairvi, Raag Bhairav, Raag Kafi, Raag Jaijaivanti, Raag Jhinjhoti and Raag Pahadi and used for celebrating community bonhomie to sing seasonal songs, ballads, ceremonial songs (wedding, etc.) and related religious legendary tales such as Puran Bhagat. Relationship and songs celebrating love and life are sung in medium pitch. Ceremonial and religious songs are sung in low pitch. Young girls and women usually sing entertaining and fast seasonal, love, relationship and friendship related songs such as Phagan (song for eponymous season/month), Katak (songs for the eponymous season/month), Samman (songs for the eponymous season/month), bande-bandi (male-female duet songs), sathne (songs of sharing heartfelt feelings among female friends). Older women usually sing devotional Mangal Geet (auspicious songs) and ceremonial songs such as Bhajan, Bhat (wedding gift to the mother of bride or groom by her brother), Sagai, Ban (Hindu wedding ritual where pre-wedding festivities starts), Kuan-Poojan (a custom that is performed to welcome the birth of male child by worshiping the well or source of drinking water), Sanjhi and Holi festival.\n\nSocially normative-cohesive impact \n\nMusic and dance for Haryanvi people is a great way of demolishing societal differences as folk singers are highly esteemed and they are sought after and invited for the events, ceremonies and special occasions regardless of their caste or status. These inter-caste songs are fluid in nature, and never personalized for any specific caste, and they are sung collectively by women from different strata, castes, dialects. These songs do transform fluidly in dialect, style, words, etc. This adoptive style can be seen from the adoption of tunes of Bollywood movie songs into Haryanvi songs. Despite this continuous fluid transforming nature, Haryanvi songs have a distinct style of their own as explained above.\n\nCuisine\n\n81% people of Haryana are vegetarian,[http://indianexpress.com/article/opinion/columns/india-diet-indian-palate-non-vegetarian-vegetarianism-3099363/ From plate to plough: A clear trend towards non-vegetarianism in India], Indian Express, 23 October 2016. and cuisine of Haryana is based on fresh, earthy and wholesome ethos of its agrarian culture, where staples are roti, saag, vegetarian sabzi and abundance of milk products such as homemade nooni or tindi ghee, ghee (clarified butter), milk, lassi, kheer.[http://www.haryanatourism.gov.in/showpage.aspx?contentid=5491 Cuisine of Haryana], Haryana Tourism.\n\nGeography\n\nHaryana is a landlocked state in northern India. It is between 27°39' to 30°35' N latitude and between 74°28' and 77°36' E longitude. The total geographical area of the state is 4.42 m ha, which is 1.4% of the geographical area of the country. The altitude of Haryana varies between 700 and 3600 ft (200 metres to 1200 metres) above sea level. Haryana has only 4% (compared to national 21.85%) area under forests.\n\nPlains and mountains\n\nHaryana has four main geographical features.\n* The Yamuna-Ghaggar plain forming the largest part of the state is also called Delhi doab consisting of Sutlej-Ghaggar doab (between Sutlej in north in Punjab and Ghaggar river flowing through northern Haryana), Ghaggar-Hakra doab (between Ghaggar river and Hakra or Drishadvati river which is the paleo channel of the holy Sarasvati River) and Hakra-Yamuna doab (between Hakra river and Yamuna). See also: Doab.\n* The Lower Shivalik Hills to the northeast in foothills of Himalaya\n* The Bagar tract semi-desert dry sandy plain to the south-west. See also: Bangar and Khadir.\n* The Aravali Range's northern most low rise isolated non-continuous outcrops in the south\n\nHydrography\n\nThe Yamuna, tributary of Ganges, flows along the state's eastern boundary.\n\nNorthern Haryana has several north-east to south-west flowing rivers originating from the Sivalik Hills of Himalayas, such as Ghaggar-Hakra (palaeochannel of vedic Sarasvati river), Chautang (paleochannel of vedic Drishadvati river, tributary of Ghagghar), Tangri river (tributary of Ghagghar), Kaushalya river (tributary of Ghagghar), Markanda River (tributary of Ghagghar), Sarsuti, Dangri, Somb river. Haryana's main seasonal river, the Ghaggar-Hakra, known as Ghaggar before the Ottu barrage and as the Hakra downstream of the barrage, rises in the outer Himalayas, between the Yamuna and the Satluj and enters the state near Pinjore in the Panchkula district, passes through Ambala and Sirsa, it reaches Bikaner in Rajasthan and runs for 460 km before disappearing into the deserts of Rajasthan. The seasonal Markanda River, known as the Aruna in ancient times, originates from the lower Shivalik Hills and enters Haryana west of Ambala, and swells into a raging torrent during monsoon is notorious for its devastating power, carries its surplus water on to the Sanisa Lake where the Markanda joins the Sarasuti and later the Ghaggar.\n\nSouthern Haryana has several south-east to north-west flowing seasonal rivulets originating from the Aravalli Range in and around the hills in Mewat region, including Sahibi River[https://books.google.com/books?isbn\n0391023586 Cultural Contours of India: Dr. Satya Prakash Felicitation Volume, Vijai Shankar Śrivastava, 1981]. [https://books.google.com/books?isbn\n812460049X Minerals and Metals in Ancient India: Archaeological evidence], Arun Kumar Biswas, Sulekha Biswas, University of Michigan. 1996. . (called Najafgarh drain in Delhi),[http://cities.expressindia.com/fullstory.php?newsid118627 Environment Minister raises a stink over Najafgarh jheel], 22 February 2005, The Indian Express[http://www.indianexpress.com/news/najafgarh-basin-delhis-most-polluted-area/558870/ Najafgarh basin Delhi’s most polluted area], 25 December 2009, The Indian Express[http://articles.timesofindia.indiatimes.com/2009-12-25/pollution/28101026_1_industrial-clusters-industrial-hubs-najafgarh-drain Najafgarh drain 11th among highly polluted industrial clusters], 25 Dec 2009, The Times of India[http://cities.expressindia.com/fullstory.php?newsid\n191225Najafgarh drain causes less pollution in Yamuna now], 4 July 2006, The Indian Express Dohan river (tributary of Sahibi, originates at Mandoli village near Neem Ka Thana in Jhunjhunu district of Rajasthan and then disappears in Mahendragarh district), Krishnavati river (former tributary of Sahibi river, originates near Dariba and disappears in Mahendragarh district much before reaching Sahibi river) and Indori river (longest tributary of Sahibi River, originates in Sikar district of Rajasthan and flows to Rewari district of Haryana), these once were tributaries of the Drishadwati/Saraswati river.Sudhir Bhargava,\"Location of Brahmavarta and Drishadwati River is important to find earliest alignment of Saraswati River\", International Conference, 20–22 Nov. 2009, \"Saraswati-a perspective\" pages 114–117, Kurukshetra University, Kurukshetra, Organised by: Saraswati Nadi Shodh Sansthan, Haryana.\n\nMajor canals are Western Yamuna Canal,\n[http://india.gov.in/sectors/water_resources/sutlej_link.php]  Sutlej Yamuna link canal (from Sutlej river tributary of Indus),\n and Indira Gandhi Canal.Ramtanu Maitra: The Indira Gandhi Canal: greening the desert in India EIR Volume 14, Number 7, February 13, 1987\n\nMajor dams are Kaushalya Dam in Panchkula district, Hathnikund Barrage and Tajewala Barrage on Yamuna in Yamunanagar district, Pathrala barrage on Somb river in Yamunanagar district, ancient Anagpur Dam near Surajkund in Faridabad district,  and Ottu barrage on Ghaggar-Hakra River in Sirsa district.\n\nMajor lakes are Dighal Wetland, Basai Wetland, Badkhal Lake in Faridabad,\n holy Brahma Sarovar and Sannihit Sarovar in Kurukshetra, Blue Bird Lake in Hisar, Damdama Lake at Sohna in Gurgram district,[http://www.damdamalake.com Damdama lake], official website.Rajiv Tiwari, [https://books.google.com.sg/books?id\nFBRYCgAAQBAJ&pgPT117&dq\ndamdama+lake&hlen&sa\nX&ved0ahUKEwj15LH7rLvXAhXLPI8KHbHzCK4Q6AEIJDAA#v\nonepage&qdamdama%20lake&f\nfalse \"Delhi A Travel Guide\"], isbn 9798128819703. Hathni Kund in Yamunanagar district, Karna Lake at Karnal,Page 153, Tourism: Theory, Planning, and Practice, By K.K. Karma, Krishnan K. Kamra, Published 1997, Indus Publishing,  ancient Surajkund in Faridabad, and Tilyar Lake in Rohtak.Page 149, India: A Travel Guide, By B.R. Kishore, published 2001, Diamond Pocket Books (P) Limited, \n\nThe Haryana State Waterbody Management Board is responsible for rejuvenation of 14,000 Johads of Haryana and up to 60 lakes in National Capital Region falling within the Haryana state.[http://indianexpress.com/article/chandigarh/haryana-to-develop-50-60-small-lakes-water-bodies-in-ncr-manohar-lal-khattar-4918316/ \"Haryana to develop 50-60 small lakes, water bodies in NCR: Manohar Lal Khattar\"], Indian Express, 1 November 2017.[http://www.business-standard.com/article/pti-stories/haryana-to-constitute-pond-management-authority-117110101271_1.html \"Haryana to constitute pond management authority \"], Business Standard, 1 November 2017.\n\nOnly hot spring of Haryana is the Sohna Sulphur Hot Spring at Sohna in Gurugram district.[http://www.tribuneindia.com/2000/20000218/haryana.htm#2 \"Sohna Hot Spring.\"], The Tribune. Tosham Hill range has several sacred sulphur pond of religious significance that are revered for the healing impact of sulfur, such as Pandu Teerth Kund, Surya Kund, Kukkar Kund, Gyarasia Kund or Vyas Kund.2004, [https://books.google.com.sg/books?id\nMvAdAQAAMAAJ&qsulphur+tosham&dq\nsulphur+tosham&hlen&sa\nX&ved=0ahUKEwjCq8WxoLvXAhVMuo8KHTtYDAQQ6AEIKzAB \"Records, Volume 135, Part 1.\"], Geological Survey of India, Page 144.\n\nSeasonal waterfalls include Tikkar Taal twin lakes at Morni hiills, Dhosi Hill in Mahendragarh district and Pali village on outskirts of Faridabad.\n\nClimate\n\nHaryana is extremely hot in summer at around 45 C and mild in winter. The hottest months are May and June and the coldest December and January. The climate is arid to semi-arid with average rainfall of 354.5 mm. Around 29% of rainfall is received during the months from July to September, and the remaining rainfall is received during the period from December to February.\n\nFlora and fauna\n\nForests\n\nForest Cover in the state in 2013 was 3.59% (1586 km2) and the Tree Cover in the state was 2.90% (1282 km2), giving a total forest and tree Cover of 6.49%. In 2016-17, 18,412 hectares were brought under tree cover by planting 14.1 million seedlings. Thorny, dry, deciduous forest and thorny shrubs can be found all over the state. During the monsoon, a carpet of grass covers the hills. Mulberry, eucalyptus, pine, kikar, shisham and babul are some of the trees found here. The species of fauna found in the state of Haryana include black buck, nilgai, panther, fox, mongoose, jackal and wild dog. More than 450 species of birds are found here.\n\nWildlife\n\nHaryana has two national parks, eight wildlife sanctuaries, two wildlife conservation areas, four animal and bird breeding centers, one deer park and three zoos, all of which are managed by the Haryana Forest Department of the Government of Haryana.\n\nEnvironmental and ecological issues\n\n \nHaryana Environment Protection Council is the advisory committee and |Department of Environment, Haryana is the department responsible for administration of environment. Areas of Haryana surrounding Delhi NCR are most polluted. During smog of November 2017, Air quality index of Gurugram and Faridabad showed that the density of Fine particulates (2.5 PM diameter) was an average of 400 PM and monthly average of Haryana was 60 PM. Other sources of pollution are exhaust gases from old vehicles, stone crushers and brick kiln. Haryana has 75 lakh (7,500,000) old vehicles, of which 40% are old more polluting vehicles, besides 500,000 new vehicles are added every year. Other majorly polluted cities are Bhiwani, Bahadurgarh, Dharuhera, Hisar and Yamunanagar.[https://translate.google.com/translate?hl\nen&slhi&tl\nen&u=http%3A%2F%2Fwww.jagran.com%2Fnews%2Fnational-air-pollution-effect-from-punjab-to-patna-17024258.html \"From Punjab to Patna pollution spreads.\"], Dainik Jagran, 12 November 2017.\n\nAdministration\n\nDivisions\n\nThe state is divided into divided into 6 revenue divisions, 5 Police Ranges and 3 Police Commissionerates (c. January 2017).[http://www.dailypioneer.com/state-editions/haryana-re-organises-administrative-units.html Reorganisation of Haryana divisions], Daily Pioneer, 3 January 2017.[http://www.uniindia.com/haryana-approves-to-create-two-new-revenue-divisions/states/news/768930.html Haryana approves to create two new revenue divisions], 2 Feb 2017.[https://timesofindia.indiatimes.com/city/chandigarh/authority-set-up-to-rejig-administrative-units-across-haryana/articleshow/56302722.cms Authority set up to rejig administrative units across Haryana], Times of India, 3 Jan 2017.[https://news.webindia123.com/news/articles/india/20170202/3048081.html Haryana approves to create two new revenue divisions], Web India, 2 Feb 2017. Six revenue divisions are: Ambala, Rohtak, Gurgaon, Hisar, Karnal and Faridabad. Haryana has 10 municipal corporations (Gurigram, Faridabad, Ambala, Panchkula, Yamunanagar, Rohtak, Hisar, Panipat, Karnal and Sonepat),  18 municipal councils and 52 municipalities (c. Jan 2018).[https://translate.google.com/translate?hlen&sl\nauto&tlen&u\nhttps%3A%2F%2Fwww.jagran.com%2Fharyana%2Fgurgaon-municipal-tax-increase-17339518.html Municipal taxes will be sanctioned to the weak bodies of the state], [https://www.jagran.com/haryana/gurgaon-municipal-tax-increase-17339518.html Dainik Jagran news], 11 Jan 2018.\n\nWithin these there are 22 districts, 72 sub-divisions, 93 tehsils, 50 sub-tehsils, 140 blocks, 154 cities and towns, 6,841 villages, 6212 villages panchayats and numerous smaller dhanis.\n\nDistricts\n\nLaw and order\n\nHaryana Police force is the law enforcement agency of Haryana. Five Police Ranges are Ambala, Hissar, Karnal, Rewari and Rohtak.[http://www.business-standard.com/article/news-ians/haryana-establishes-five-police-ranges-117011601376_1.html Haryana establishes five police ranges], business Standard, 16 January 2017. Three Police Commissionerates are Faridabad, Gurgaon and Panchkula. Cybercrime investigation cell is based in Gurgaon's Sector 51.\n\nThe highest judicial authority in the state is the Punjab and Haryana High Court, with next higher right of appeal to Supreme Court of India. Haryana uses e-filing facility.\n\nGovernance and e-governance\n\nThe Common Service Centres (CSCs) have been upgraded in all districts to offer hundreds of e-services to citizens, including application of new water connection, sewer connection, electricity bill collection, ration card member registration, result of HBSE, admit cards for board examinations, online admission form for government colleges, long route booking of buses, admission forms for Kurukshetra University and HUDA plots status inquiry. Haryana has become the first state to implement Aadhaar-enabled birth registration in all the districts. Thousands of all traditional offline state and central government services are also available 24/7 online through single unified UMANG app and portal as part of Digital India initiative.[https://economictimes.indiatimes.com/news/economy/finance/government-unveils-umang-app-for-citizen-services/articleshow/61769676.cms \"Government unveils Umang app for citizen services.\"], Economic Times, 23 Nov 2017.[http://www.business-standard.com/article/economy-policy/govt-s-umang-app-finally-sees-the-light-of-the-day-all-you-need-to-know-117112300381_1.html \"Govt's Umang app finally sees the light of the day: All you need to know.\"], Business Standard, 23 Nov 2017.\n\nEconomy\n\nHaryana's 14th placed 12.96% 2012-17 CAGR[https://www.ibef.org/states/haryana-presentation Industrial Development & Economic Growth in Haryana], India Brand Equity Foundation, Nov 2017. estimated 2017-18 GSDP of US$95 billion is split in to 52% services, 30% industries and 18% agriculture.\n\nServices sector is split across 45% in real estate and financial & professional services, 26% trade and hospitality, 15% state and central govt employees, and 14% transport and logistics & warehousing. In IT services, Gurugram ranks number 1 in India in growth rate and existing technology infrastructure, and number 2 in startup ecosystem, innovation and livability (Nov 2016).[http://ceoworld.biz/2016/12/02/indias-top-12-tech-cities-digital-indian-cities-survey-2016/ India’s Top 12 Tech Cities: Digital Indian Cities Survey, 2016], CEOWORLD magazine, Nov 2016.\n\nIndustries sector is split across 69% manufacturing, 28% construction, 2% utilities and 1% mining. In industrial manufacturing, Haryana produces India's 67% of passenger cars, 60% of motorcycles, 50% of tractors and 50% of the refrigerators.\n\nServices and industrial sectors are boosted by 7 operational SEZs and additional 23 formally approved SEZs (20 already notified and 3 in-principal approval) that are mostly spread along the Delhi–Mumbai Industrial Corridor, Amritsar Delhi Kolkata Industrial Corridor and Delhi Western Peripheral Expressway in NCR).\n\nAgriculture sector is split across 93% crops and livestock, 4% commercial forestry and logging, and 2% fisheries. Agriculture sector of Haryana, with only less than 1.4% area of India, contributes 15% food grains to the central food security public distribution system, and 7% of total national agricultural exports including 60% of total national Basmati rice export.\n\nAgriculture \n\nCrops\n\nHaryana is traditionally an agrarian society of zamindars (owner-cultivator farmers). The Green Revolution in Haryana of 1960s combined with completion of Bhakra Dam in 1963 and Western Yamuna Command Network canal system in 1970s resulted in the significantly increased food grain production.\n\nIn 2015-2016, Haryana produced the following principal crops: 13,352,000 tonne wheat, 4,145,000 tonne rice,  7,169,000 tonne sugarcane, 993,000 tonne cotton and 855,000 tonne oilseeds (mustard seed, sunflower, etc.).\n\nFruits, vegetables and spices \n\nVegetable production was: Potato 853,806 tonnes, Onion 705,795 tonnes, Tomato 675,384 tonnes, Cauliflower 578,953 tonnes, Leafy Vegetables 370,646 tonnes, Brinjal 331,169 tonnes, guard 307,793 tonnes, Peas 111,081 tonnes and others 269,993 tonnes.\n\nFruits production was: Citrus 301,764 tonnes, Guava 152,184 tonnes, Mango 89,965 tonnes, Chikoo 16,022 tonnes, Aonla 12,056 tonnes and other fruits 25,848 tonnes.\n\nSpices production was: Garlic 40,497 tonnes, Fenugreek 9,348 tonnes, Ginger 4,304 tonnes and others 840 tonnes.\n\nFlowers and medicinal plants\n\nCut flowers production was: Marigold 61,830 tonnes, Gladiolus 24,486,200 lakh, Rose 18,611,600 lakh and other 6,913,000 lakh.\n\nMedicinal plants production was: Aloe vera 1403 tonnes and Stevia 13 tonnes.\n\nLivestock\n\nHaryana is well known for its high-yield Murrah buffalo. Other breeds of cattle native to Haryana are Haryanvi, Mewati, Sahiwal and Nili-Ravi.\n\nResearch \n\nTo support its agrarian economy, both central government (Central Institute for Research on Buffaloes, Central Sheep Breeding Farm, National Research Centre on Equines, Central Institute of Fisheries, National Dairy Research Institute, Indian Institute of Wheat and Barley Research and National Bureau of Animal Genetic Resources) and state government (CCS HAU, LUVAS, Government Livestock Farm, Regional Fodder Station and Northern Region Farm Machinery Training and Testing Institute) have opened several institutes for research and education.M Gupta, 2011, [http://nopr.niscair.res.in/bitstream/123456789/11559/3/ALIS%2058%281%29%2063-70.pdf Ranking of Indian institutions in agriculture & allied sciences].Jagvir Singh Yadav, 1992, [https://books.google.com.sg/books?isbn8170223865 Evaluation of Agricultural Extension: A Study of Haryana], Page 44.Salim Ahmed Lalli, 2007, [https://books.google.com.sg/books?isbn=8189131192 Infrastructure and agricultural development in Haryana: policy implications].\n\nIndustrial sector\n\nManufacturing\n\n* Faridabad is one of the biggest industrial city of Haryana as well as North India. \n* Hissar, a NCR Counter Magnet city known as steel and cotton spinning hub as well as upcoming integrated industrial aerocity and aero MRO hub at Hisar Airport,[http://www.hindustantimes.com/punjab/chandigarh/hisar-aerodrome-being-considered-for-international-airport-says-mla/article1-1292554.aspx Hisar aerodrome being considered for international airport, says MLA] , HT Correspondent, Hindustan Times, Retrieved on 2 December 2014.[http://www.travelbizmonitor.com/Ministry/haryana-govt-to-develop-international-airport-at-hisar-30068 Haryana to develop international airport at Hisar], [http://www.travelbizmonitor.com TravelBizMonitor], Retrieved in March 2016.[http://www.tribuneindia.com/news/haryana/state-shelves-hisar-airport-project/87044.html State shelves Hisar airport cargo project], The Tribune, 29 May 2015. is a fast developing city and the hometown of Navin Jindal and Subhash Chandra of Zee TV fame. Savitri Jindal, Navin Jindal's mother, has been listed by Forbes as the third richest woman in world.\n* Panipat has heavy industry, including a refinery operated by the Indian Oil Corporation, a urea manufacturing plant operated by National Fertilizers Limited and a National Thermal Power Corporation power plant. It is known for its woven modhas or round stools.\n* Sonepat: IMT Kundli, Nathupur, Rai and Bari are industrial areas with several Small and medium-sized enterprises, including come large ones such as Atlas cycles, E.C.E., Birla factory, OSRAM\n* Gurugram: IMT Minesar, Dundahera and Sohna are industrial and logistics hub, that also has National Security Guards, Indian Institute of Corporate Affairs, National Brain Research Centre and National Bomb Data Centre.\n\nUtilities\n\nHaryana State has always given high priority to the expansion of electricity infrastructure, as it is one of the most important inputs for the development of the state. Haryana was the first state in the country to achieve 100% rural electrification in 1970 as well as the first in the country to link all villages with all-weather roads and provide safe drinking water facilities throughout the state.\n\nPower in the state are:\n* Renewable and non-polluting sources\n** Hydroelectricity \n*** Bhakra-Nangal Dam Hydroelectric Power Plant\n***WYC Hydro Electric Station, 62.4 MW, Yamunanagar\n** Solar power stations\n*** Faridabad Solar Power Plant: being setup by HPGCL Faridabad (c.2016).\n* Nuclear power stations\n** Gorakhpur Nuclear Power Plant, 2800MW, Fatehabad, Phase-I 1400MW by 2021[http://www.downtoearth.org.in/news/gorakhpur-nuclear-power-plant-makes-headway-39141 Gorakhpur nuclear power plant makes headway]. Down To Earth. 20 September 2012. Retrieved 2 April 2016.\n* Coal-fired thermal power stations \n** Deenbandhu Chhotu Ram Thermal Power Station, 600MW, Yamunanagar,[http://hpgcl.gov.in/powerplants_rpp.hp HPGCL power plant capacity] \n** Indira Gandhi Super Thermal Power Project, 1500MW, Jhajjar\n** Jhajjar Power Station, 1500MW \n** Panipat Thermal Power Station I, 440MW\n** Panipat Thermal Power Station II, 920MW\n** Rajiv Gandhi Thermal Power Station, 1200MW, Hisar\n\nServices sector\n\nTransport\n\nRoads and Highways\n\nHaryana has a total road length of , including  29 national highways,  state highways,  Major District Roads (MDR) and  Other District Roads (ODR) (c. December 2017).[http://www.tribuneindia.com/news/haryana/single-agency-to-handle-road-repair-work-from-january-1/520344.html Single agency to handle road repair work from January 1], Tribune, 29 Dec 2017. A fleet of 3,864 Haryana Roadways buses covers a distance of 1.15 million km per day, and it was the first state in the country to introduce luxury video coaches.[http://haryanaindustries.nic.in/WhyHaryana/Pages/NewEconomicInfrastructure.aspx Why Haryana? - Economic Infrastructure] \n\nAncient Delhi Multan Road and Grand Trunk Road, South Asia's oldest and longest major roads, pass through Haryana. GT Road passes through the districts of Sonipat, Panipat, Karnal, Kurukshetra and Ambala in north Haryana where it enters Delhi and subsequently the industrial town of Faridabad on its way. The  Kundli-Manesar-Palwal Expressway(KMP) will provide a high-speed link to northern Haryana with its southern districts such as Sonepat, Gurgaon, Jhajjar and Faridabad.\n\nThe Delhi-Agra Expressway (NH-2) that passes through Faridabad is being widened to six lanes from current four lanes. It will further boost Faridabad's connectivity with Delhi.\n\nRailway \n\nRail network in Haryana is covered by 5 rail divisions under 3 rail zones. Diamond Quadrilateral High-speed rail network, Eastern Dedicated Freight Corridor (72 km) and Western Dedicated Freight Corridor (177 km) pass through Haryana.\n\nBikaner railway division of North Western Railway zone manages rail network in western and southern Haryana covering Bhatinda-Dabwali-Hanumangarh line, Rewari-Bhiwani-Hisar-Bathinda line, Hisar-Sadulpur line and Rewari-Loharu-Sadulpur line.[http://www.nwr.indianrailways.gov.in/uploads/files/1450093153283-BKN.pdf Bikaner Division map and history] Jaipur railway division of North Western Railway zone manages rail network in south-west Haryana covering Rewari-Reengas-Jaipur line, Delhi-Alwar-Jaipur line and Loharu-Sikar line.[http://www.nwr.indianrailways.gov.in/uploads/files/1450093177866-JP.pdf Jaipur division network map]\n\nDelhi railway division of Northern Railway zone manages rail network in north and east and central Haryana covering Delhi-Ambala line, Delhi-Rohtak-Tohana line, Rewari–Rohtak line, Jind-Sonepat line and Delhi-Rewari line.[http://www.nr.indianrailways.gov.in/view_section.jsp?lang\n0&id0,1,263,314,315 Delhi division map and history] Agra railway division of North Central Railway zone manages another very small part of network in south-east Haryana covering Palwal-Mathura line only.[http://www.ncr.indianrailways.gov.in/view_section.jsp?lang0&id\n0,1,262 NCR Zone map]\n\nAmbala railway division of Northern Railway zone manages small part of rail network in north-east Haryana covering Ambala-Yamunanagar line, Ambala-Kurukshetra line and UNESCO World Heritage Kalka–Shimla Railway.[http://www.nr.indianrailways.gov.in/view_section.jsp?lang\n0&id=0,1,263,314,319 Ambala Division map and history].\n\nMetro\n\nDelhi Metro connects the national capital Delhi with parts of Haryana state within NCR, including Bahadurgarh, Faridabad and with Rapid MetroRail Gurgaon. Faridabad has the longest metro network in the NCR Region consisting of 9 stations and track length being 14 km.\n\nSky Way\n\nThe Haryana and Delhi governments have constructed the  international standard Delhi Faridabad Skyway, the first of its kind in North India, to connect Delhi and Faridabad.\n\nCommunication and media\n\nHaryana has a statewide network of telecommunication facilities. Haryana Government has its own statewide area network by which all government offices of 22 districts and 126 blocks across the state are connected with each other thus making it the first SWAN of the country.[http://www.egovonline.net/articles/article-details.asp?TitleTulip-IT-in-Haryana&ArticalID\n1716&Type=INDUSTRY%20PERSPECTIVE Egovonline.net]   [http://www.punjabnewsline.com/content/view/7526/93/ Punjabnewsline.com]    Bharat Sanchar Nigam Limited and most of the leading private sector players (such as Reliance Infocom, Tata Teleservices, Bharti Telecom, Idea Vodafone Essar, Aircel, Uninor and Videocon) have operations in the state. Important areas around Delhi are an integral part of the local Delhi Mobile Telecommunication System. This network system would easily cover major towns like Faridabad and Gurgaon.\n\nElectronic media channels include, MTV, 9XM, Star Group, SET Max, News Time, NDTV 24x7 and Zee Group. The radio stations include All India Radio and other FM stations.\n\nThe major newspapers of Haryana include Dainik Bhaskar, Punjab Kesari, Jag Bani, Dainik Jagran, The Tribune, Amar Ujala, Hindustan Times, Dainik Tribune, The Times of India and Hari-Bhumi.\n\nHealthcare\n\nThe Total Fertility Rate of Haryana is 2.3. The Infant Mortality Rate is 41 (SRS 2013) and Maternal Mortality Ratio is 146 (SRS 2010–2012).\n\nEducation\n\nLiteracy\n\nLiteracy rate in Haryana has seen an upward trend and is 76.64 percent as per 2011 population census. Male literacy stands at 85.38 percent, while female literacy is at 66.67 percent. In 2001, the literacy rate in Haryana stood at 67.91 percent of which male and female were 78.49 percent and 55.73 percent literate respectively. , Gurgaon city had the highest literacy rate in Haryana at 86.30%  followed by Panchkula at 81.9 per cent and Ambala at 81.7 percent. In terms of districts,  Rewari had the highest literacy rate in Haryana at 74%, higher than the national average of 59.5%: male literacy was 79%, and female 67%.\n\nSchools\n\nHaryana Board of School Education, established in September 1969 and shifted to Bhiwani in 1981, conducts public examinations at middle, matriculation, and senior secondary levels twice a year. Over seven lakh candidates attend annual examinations in February and March; 150,000 attend supplementary examinations each November. The Board also conducts examinations for Haryana Open School at senior and senior secondary levels twice a year. The Haryana government provides free education to women up to the bachelor's degree level.\n\nIn 2015-2016, there were nearly 20,000 schools, including 10,100 state government schools (36 Aarohi Schools, 11 Kasturba Gandhi Balika Vidyalayas, 21 Model Sanskriti Schools, 8744 government primary school, 3386 government middle school, 1284 government high school and 1967 government senior secondary schools), 7,635 private schools (200 aided,[http://www.schooleducationharyana.gov.in/downloads_pdf/stat/AidedSchool_AsOn09072014.pdf Haryana Education stats: aided private schools, 2015-2016] 6612 recognized unaided, and 821 unrecognied unaided private schools.)and several hundred other central government and private schools such as Kendriya Vidyalaya, Indian Army Public Schools, Jawahar Navodaya Vidyalaya and DAV schools affiliated to central government's CBSE and ICSE school boards.\n\nUniversities and higher education\n\nHaryana has 29 universities and 299 colleges, including 115 government colleges, 88 govt-aided colleges and 96 self-finance colleges (c. Jan 2018).[https://translate.google.com/translate?hl\nen&slhi&tl\nen&uhttps%3A%2F%2Fwww.jagran.com%2Fharyana%2Fmahendragarh-haryana-is-growing-rapidly-in-higher-education-colleges-in-small-states-17374290.html Haryana is growing rapidly in higher education, 299 colleges in small state], [https://www.jagran.com/haryana/mahendragarh-haryana-is-growing-rapidly-in-higher-education-colleges-in-small-states-17374290.html Jagram], 17 Jan 2018. Hisar has three universities: Chaudhary Charan Singh Haryana Agricultural University - Asia's largest agricultural university, Guru Jambheshwar University of Science and Technology, Lala Lajpat Rai University of Veterinary & Animal Sciences); several national agricultural and veterinary research centres (National Research Centre on Equines), Central Sheep Breeding Farm, National Institute on Pig Breeding and Research, Northern Region Farm Machinery Training and Testing Institute and Central Institute for Research on Buffaloes (CIRB); and more than 20 colleges including Maharaja Agrasen Medical College, Agroha.\n\nUnion Minister Ravi Shankar Prasad announced on 27 February 2016 that National Institute of Electronics and Information Technology (NIELIT) would be set up in Kurukshetra to provide computer training to youth and a Software Technology Park of India (STPI) would be set up in Panchkula’s existing HSIIDC IT Park in Sector 23. Hindi and English are compulsory languages in schools whereas Punjabi, Sanskrit and Urdu are chosen as optional languages.\n\nSports\n\nIn the 2010 Commonwealth Games at Delhi, 22 out of 38 gold medals that India won came from Haryana.[http://mizoramexpress.com/index.php/2010/10/32-medal-winner-from-haryana-to-get-maruti-cars Mizoramexpress.com]    During the 33rd National Games held in Assam in 2007, Haryana stood first in the nation[http://www.33rdnationalgames.nic.in/medal_tally.htm Official site for the 33rd National Games 2007, Guwahati]  with a medal tally of 80, including 30 gold, 22 silver and 28 bronze medals.\n\nThe 1983 World-Cup-winning captain Kapil Dev is from Haryana. Nahar Singh Stadium was built in Faridabad in the year 1981 for international cricket. This ground has the capacity to hold around 25,000 people as spectators. Tejli Sports Complex is an Ultra-Modern sports complex in Yamuna Nagar. Tau Devi Lal Stadium in Gurgaon is a multi-sport complex.\n\nChief Minister of Haryana Manohar Lal Khattar announced the \"Haryana Sports and Physical Fitness Policy\", a policy to support 26 Olympic sports, on 12 January 2015 with the words \"We will develop Haryana as the sports hub of the country.\"\n\nHaryana is home to Haryana Gold, one of India's eight professional basketball teams which compete in the country's UBA Pro Basketball League.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Haryana" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14189" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Haryana, carved out of the former state of East Punjab on 1November 1966 on linguistic basis, is one of the 29 states in India. Situated in North India with less than 1.4% (44212 km2) of India's land area, it is ranked 21st in terms of area. Chandigarh is the capital, Faridabad in National Capital Region is the most populous city of the state and the Gurugram is the financial hub of NCR with major Fortune 500 companies located in it. Haryana has 6 administrative divisions, 22 districts, 72 sub-divisions, 93 revenue tehsils, 50 sub-tehsils, 140 community development blocks, 154 cities and towns, 6,841 villages and 6212 villages panchayats.\n\nAs the largest recipient of investment per capita since 2000 in India, and among one of the wealthiest and most economically developed regions in South Asia, Haryana has the India's third highest per capita income at  against the national average of  in year 2016–17. Haryana's 2017-18 estimated state GSDP of US$95 billion (52% services, 30% industries and 18% agriculture) is growing at 12.96% 2012-17 CAGR and placed on the 14th position behind only much bigger states, is also boosted by 30 SEZs (mainly along DMIC, ADKIC and DWPE in NCR), 7% national agricultural exports, 60% of national Basmati rice export, 67% cars, 60% motorbikes, 50% tractors and 50% refrigerators produced in India. Faridabad has been described as eighth fastest growing city in the world and third most in India by City Mayors Foundation survey.http://www.citymayors.com/statistics/urban_growth1.html In services, Gurugram ranks number 1 in India in IT growth rate and existing technology infrastructure, and number 2 in startup ecosystem, innovation and livability (Nov 2016).\n\nAmong the world's oldest and largest ancient civilizations, the Indus Valley Civilization sites at Rakhigarhi village in Hisar district and Bhirrana in Fatehabad district are 9,000 years old. Rich in history, monuments, heritage, flora and fauna, human resources and tourism with well developed economy, national highways and state roads, it is bordered by Himachal Pradesh to the north-east, by river Yamuna along its eastern border with Uttar Pradesh, by Rajasthan to the west and south, and Ghaggar-Hakra River flows along its northern border with Punjab. Since Haryana surrounds the country's capital Delhi on three sides (north, west and south), consequently a large area of Haryana is included in the economically-important National Capital Region for the purposes of planning and development.\n\nEtymology\n\nThe name Haryana is found in the works of the 12th-century AD Apabhramsha writer Vibudh Shridhar (VS 1189–1230).An Early Attestation of the Toponym Ḍhillī, by Richard J. Cohen, Journal of the American Oriental Society,  1989, pp. 513–519\n: हरियाणए देसे असंखगाम, गामियण जणि अणवरथ काम|\n: परचक्क विहट्टणु सिरिसंघट्टणु, जो सुरव इणा परिगणियं|\n: रिउ रुहिरावट्टणु बिउलु पवट्टणु, ढिल्ली नामेण जि भणियं|\n: \n: Translation: there are countless villages in Haryana country. The villagers there work hard. They don't accept domination of others, and are experts in making the blood of their enemies flow. Indra himself praises this country. The capital of this country is Dhilli.\n\nThe name Haryana has been derived from the Sanskrit words Hari (the Hindu god Vishnu) and ayana (home), meaning \"the Abode of God\".[http://www.britannica.com/EBchecked/topic/256424/Haryana Haryana] Britannica Online Encyclopedia However, scholars such as Muni Lal, Murli Chand Sharma, HA Phadke and Sukhdev Singh Chib believe that the name comes from a compound of the words Hari (Sanskrit Harit, \"green\") and Aranya (forest).  However, it is unlikely that both forest and green which allude to each other, would be used as two different words in a single name.\n\nHistory\n\nPre-history \n\nThe Vedic state of Brahmavarta is claimed to be located in south Haryana, where the initial Vedic scriptures were composed after the great floods some 10,000 years ago. Manusmriti, a flood time document composed by Manu and Bhrigu is now dated at 10,000 years old. Rakhigarhi village in Hisar district and Bhirrana in Fatehabad district are home to the largest and one of the world's oldest ancient Indus Valley Civilization sites, dated at over 9,000 years old. Evidence of paved roads, a drainage system, a large-scale rainwater collection storage system, terracotta brick and statue production, and skilled metal working (in both bronze and precious metals) have been uncovered. According to archaeologists, Rakhigarhi may be the origin of Harappan civilisation, which arose in the Ghaggar basin in Haryana and gradually and slowly moved to the Indus valley.[https://swarajyamag.com/culture/did-climate-change-kill-the-indus-civilisation Did Climate Change Kill The Indus Civilisation?], Swarajya magazine, 31 May 2016.\n\nMedieval\n\nAncient bronze and stone idols of Jain Tirthankara were found in archaeological expeditions in Badli, Bhiwani (Ranila, Charkhi Dadri, Badhara village), Dadri, Gurgaon (Ferozpur Jhirka), Hansi, Hisar (Agroha), Kasan, Nahad, Narnaul, Pehowa, Rewari, Rohad, Rohtak (Asthal-Abohar) and Sonepat in Haryana.\n\nAfter the sack of Bhatner fort during the Timurid conquests of India in 1398, Timur attacked and sacked the cities of Sirsa, Fatehabad, Sunam, Kaithal and Panipat. When he reached the town of Sarsuti, the residents, who were mostly non-Muslims, fled and were chased by a detachment of Timur's troops, with thousands of them being killed and looted by the troops. From there he travelled to Fatehabad, whose residents fled and a large number of those remaining in the town were massacred. The Ahirs resisted him at Ahruni but were defeated, with thousands being killed and many being taken prisoners while the town was burnt to ashes. From there he travelled to Tohana, whose Jat inhabitants were stated to be robbers according to Sharaf ad-Din Ali Yazdi. They tried to resist but were defeated and fled. Timur's army pursued and killed 200 Jats, while taking many more as prisoners. He then sent a detachment to chase the fleeing Jats and killed 2,000 of them while their wives and children were enslaved and their property plundered. From there he proceeded to Kaithal whose residents were massacred and plundered, destroying all villages along the way. On the next day, he came to Assandh whose residents were \"fire-worshippers\" according to Yazdi, and had fled to Delhi. Next he travelled to and subdued Tughlaqpur fort and Salwan before reaching Panipat whose residents had already fled. He then marched on to Loni fort.\n\nThe area that is now Haryana has been ruled by some of the major empires of India. Panipat is known for three seminal battles in the history of India. In the First Battle of Panipat (1526), Babur defeated the Lodis. In the Second Battle of Panipat (1556), Akbar defeated the local Haryanvi Hindu Emperor of Delhi, who belonged to Rewari. Hem Chandra Vikramaditya had earlier won 22 battles across India from Punjab to Bengal, defeating Mughals and Afghans. Hemu had defeated Akbar's forces twice at Agra and the Battle of Delhi in 1556 to become the last Hindu Emperor of India with a formal coronation at Purana Quila in Delhi on 7 October 1556. In the Third Battle of Panipat (1761), the Afghan king Ahmad Shah Abdali defeated the Marathas.\n\nFormation\n\nHaryana as a state came into existence on 1November 1966 the Punjab Reorganisation Act (1966). The Indian government set up the Shah Commission under the chairmanship of Justice JC Shah on 23 April 1966 to divide the existing state of Punjab and determine the boundaries of the new state of Haryana after consideration of the languages spoken by the people. The commission delivered its report on 31May 1966 whereby the then-districts of Hisar, Mahendragarh, Gurgaon, Rohtak and Karnal were to be a part of the new state of Haryana. Further, the tehsils of Jind and Narwana in the Sangrur district — along with Naraingarh, Ambala and Jagadhri — were to be included.\n\nThe commission recommended that the tehsil of Kharad, which includes Chandigarh, the state capital of Punjab, should be a part of Haryana. However, only a small portion of Kharad was given to Haryana. The city of Chandigarh was made a union territory, serving as the capital of both Punjab and Haryana.\n\nBhagwat Dayal Sharma became the first Chief Minister of Haryana.\n\nPeople\n\nDemographics and religion\n\nAccording to the 2011 census, of total 25,350,000 population of Haryana, Hindus (87.46%) constitute the majority of the state's population with Sikhs (4.91%), Muslims (7.03%) (mainly Meos) being the largest minorities.\n\nAmong Hindus, Jats (25% to 28%) are the single largest and socio-economically dominant caste, followed by the OBC (24%, including Ahir, Sain, Yadava, etc., excluding Jats), SC (21% , dalits, Balmiki, Chamar, Dhanak, Khatik, etc.) and other non-dalit non-SC castes (11% to 14%, such as Brahmins, Baniya, Ror )and(16% to 17%,Khatris ).\n\nMuslims are mainly found in the Mewat and Nuh districts. Haryana has the second largest Sikh population in India after Punjab, and they mostly live in the districts adjoining Punjab, such as Hisar, Sirsa, Jind, Fatehabad, Kaithal, Kurukshetra, Ambala, Narnaul and Panchkula karnal.\n\nLanguages\n\nHindi was the sole official language of Haryana till 2010 and it is spoken by the majority of the population (87.31%). Haryana has 70% rural population who primarily speak Haryanvi dialect of Hindi, as well as other related dialects, such as Bagri and Mewati.\n\nTamil was once given nominal official status in Haryana, purportedly as a rebuff to Punjab, though there was no attested Tamil-speaking population in the state, and was later replaced by Punjabi, in 2010.\n\nCulture\n\nHaryana has its own unique traditional folk music, folk dances, saang (folk theater),Sachchidananda Encyclopaedic Profile of Indian Tribes Volume 1 - 1996 817141298X p416. cinema, belief system such as Jathera (ancestral worship),A Glossary of the tribes & castes of Punjab by H. A Rose and arts such as Phulkari and Shisha embroidery.\n\nFolk theater and dances\n\nFolk music and dances of Haryana are based on satisfying cultural needs of primarily agrarian and martial natures of Haryanavi tribes.\n\nHaryanvi musical folk theater main types are Saang, Rasa lila and Ragini. The Saang and Ragini form of theater was popularised by Lakhmi Chand.Manorma Sharma, 2007, [https://books.google.com.sg/books?isbn\n8131300463 Musical Heritage of India], Page 65.\n\nHaryanvi folk dances and music have fast energetic movements. Three popular categories of dance are: festive-seasonal, devotional, and ceremonial-recreational. The festive-seasonal dances and songs are Gogaji/Gugga, Holi, Phaag, Sawan, Teej. The devotional dances and songs are Chaupaiya, Holi, Manjira, Ras Leela, Raginis). The ceremonial-recreational dances and songs are of following types: legendary bravery (Kissa and Ragini of male warriors and female Satis), love and romance (Been and its variant Nāginī dance, and Ragini), ceremonial (Dhamal Dance, Ghoomar, Jhoomar (male), Khoria, Loor, and Ragini).\n\nFolk music and songs \n\nHaryanvi folk music are based on day to day themes and injecting earthy humor enlivens the feel of the songs. Haryanvi music takes two main forms: \"Classical folk music\" and \"Desi Folk music\" (Country Music of Haryana), and sung in the form of ballads and love, valor and bravery, harvest, happiness and pangs of parting of lovers.S. C. Bhatt and Gopal K. Bhargava, 2006, [https://books.google.com.sg/books?isbn8178353652 Land and People of Indian States and Union Territories: 21 Arts and Crafts of Haryana].[S. Gajrani, 2004, [https://books.google.com.sg/books?isbn=818205060X History, Religion and Culture of India], Volume 1, Page 96.\n\nClassical Haryanvi folk music\n\nClassical Haryanvi folk music is based on Indian classical music. Hindustani classical ragas, learnt in gharana parampara of guru–shishya tradition, are used to sing songs of heroic bravery (such as Alha-Khand (1663-1202 CE) about bravery of Alha and Udal, Jaimal Fatta of Maharana Udai Singh II), Brahmas worship and festive seasonal songs (such as Teej, Holi and Phaag songs of Phalgun month near Holi). Kissa legendary folklores of bravery and love such as Nihalde Sultan, Sati Manorama, Jai Singh ki Mrityu, Saran de, etc. are some of the most popular folklores. Bravery songs are sung in high pitch.\n\nDesi Haryanvi folk music\n\nDesi Haryanvi folk music (Haryanvi country folk music) The country-side or desi (native) form of Haryanvi music is based on Raag Bhairvi, Raag Bhairav, Raag Kafi, Raag Jaijaivanti, Raag Jhinjhoti and Raag Pahadi and used for celebrating community bonhomie to sing seasonal songs, ballads, ceremonial songs (wedding, etc.) and related religious legendary tales such as Puran Bhagat. Relationship and songs celebrating love and life are sung in medium pitch. Ceremonial and religious songs are sung in low pitch. Young girls and women usually sing entertaining and fast seasonal, love, relationship and friendship related songs such as Phagan (song for eponymous season/month), Katak (songs for the eponymous season/month), Samman (songs for the eponymous season/month), bande-bandi (male-female duet songs), sathne (songs of sharing heartfelt feelings among female friends). Older women usually sing devotional Mangal Geet (auspicious songs) and ceremonial songs such as Bhajan, Bhat (wedding gift to the mother of bride or groom by her brother), Sagai, Ban (Hindu wedding ritual where pre-wedding festivities starts), Kuan-Poojan (a custom that is performed to welcome the birth of male child by worshiping the well or source of drinking water), Sanjhi and Holi festival.\n\nSocially normative-cohesive impact \n\nMusic and dance for Haryanvi people is a great way of demolishing societal differences as folk singers are highly esteemed and they are sought after and invited for the events, ceremonies and special occasions regardless of their caste or status. These inter-caste songs are fluid in nature, and never personalized for any specific caste, and they are sung collectively by women from different strata, castes, dialects. These songs do transform fluidly in dialect, style, words, etc. This adoptive style can be seen from the adoption of tunes of Bollywood movie songs into Haryanvi songs. Despite this continuous fluid transforming nature, Haryanvi songs have a distinct style of their own as explained above.\n\nCuisine\n\n81% people of Haryana are vegetarian,[http://indianexpress.com/article/opinion/columns/india-diet-indian-palate-non-vegetarian-vegetarianism-3099363/ From plate to plough: A clear trend towards non-vegetarianism in India], Indian Express, 23 October 2016. and cuisine of Haryana is based on fresh, earthy and wholesome ethos of its agrarian culture, where staples are roti, saag, vegetarian sabzi and abundance of milk products such as homemade nooni or tindi ghee, ghee (clarified butter), milk, lassi, kheer.[http://www.haryanatourism.gov.in/showpage.aspx?contentid=5491 Cuisine of Haryana], Haryana Tourism.\n\nGeography\n\nHaryana is a landlocked state in northern India. It is between 27°39' to 30°35' N latitude and between 74°28' and 77°36' E longitude. The total geographical area of the state is 4.42 m ha, which is 1.4% of the geographical area of the country. The altitude of Haryana varies between 700 and 3600 ft (200 metres to 1200 metres) above sea level. Haryana has only 4% (compared to national 21.85%) area under forests.\n\nPlains and mountains\n\nHaryana has four main geographical features.\n* The Yamuna-Ghaggar plain forming the largest part of the state is also called Delhi doab consisting of Sutlej-Ghaggar doab (between Sutlej in north in Punjab and Ghaggar river flowing through northern Haryana), Ghaggar-Hakra doab (between Ghaggar river and Hakra or Drishadvati river which is the paleo channel of the holy Sarasvati River) and Hakra-Yamuna doab (between Hakra river and Yamuna). See also: Doab.\n* The Lower Shivalik Hills to the northeast in foothills of Himalaya\n* The Bagar tract semi-desert dry sandy plain to the south-west. See also: Bangar and Khadir.\n* The Aravali Range's northern most low rise isolated non-continuous outcrops in the south\n\nHydrography\n\nThe Yamuna, tributary of Ganges, flows along the state's eastern boundary.\n\nNorthern Haryana has several north-east to south-west flowing rivers originating from the Sivalik Hills of Himalayas, such as Ghaggar-Hakra (palaeochannel of vedic Sarasvati river), Chautang (paleochannel of vedic Drishadvati river, tributary of Ghagghar), Tangri river (tributary of Ghagghar), Kaushalya river (tributary of Ghagghar), Markanda River (tributary of Ghagghar), Sarsuti, Dangri, Somb river. Haryana's main seasonal river, the Ghaggar-Hakra, known as Ghaggar before the Ottu barrage and as the Hakra downstream of the barrage, rises in the outer Himalayas, between the Yamuna and the Satluj and enters the state near Pinjore in the Panchkula district, passes through Ambala and Sirsa, it reaches Bikaner in Rajasthan and runs for 460 km before disappearing into the deserts of Rajasthan. The seasonal Markanda River, known as the Aruna in ancient times, originates from the lower Shivalik Hills and enters Haryana west of Ambala, and swells into a raging torrent during monsoon is notorious for its devastating power, carries its surplus water on to the Sanisa Lake where the Markanda joins the Sarasuti and later the Ghaggar.\n\nSouthern Haryana has several south-east to north-west flowing seasonal rivulets originating from the Aravalli Range in and around the hills in Mewat region, including Sahibi River[https://books.google.com/books?isbn\n0391023586 Cultural Contours of India: Dr. Satya Prakash Felicitation Volume, Vijai Shankar Śrivastava, 1981]. [https://books.google.com/books?isbn\n812460049X Minerals and Metals in Ancient India: Archaeological evidence], Arun Kumar Biswas, Sulekha Biswas, University of Michigan. 1996. . (called Najafgarh drain in Delhi),[http://cities.expressindia.com/fullstory.php?newsid118627 Environment Minister raises a stink over Najafgarh jheel], 22 February 2005, The Indian Express[http://www.indianexpress.com/news/najafgarh-basin-delhis-most-polluted-area/558870/ Najafgarh basin Delhi’s most polluted area], 25 December 2009, The Indian Express[http://articles.timesofindia.indiatimes.com/2009-12-25/pollution/28101026_1_industrial-clusters-industrial-hubs-najafgarh-drain Najafgarh drain 11th among highly polluted industrial clusters], 25 Dec 2009, The Times of India[http://cities.expressindia.com/fullstory.php?newsid\n191225Najafgarh drain causes less pollution in Yamuna now], 4 July 2006, The Indian Express Dohan river (tributary of Sahibi, originates at Mandoli village near Neem Ka Thana in Jhunjhunu district of Rajasthan and then disappears in Mahendragarh district), Krishnavati river (former tributary of Sahibi river, originates near Dariba and disappears in Mahendragarh district much before reaching Sahibi river) and Indori river (longest tributary of Sahibi River, originates in Sikar district of Rajasthan and flows to Rewari district of Haryana), these once were tributaries of the Drishadwati/Saraswati river.Sudhir Bhargava,\"Location of Brahmavarta and Drishadwati River is important to find earliest alignment of Saraswati River\", International Conference, 20–22 Nov. 2009, \"Saraswati-a perspective\" pages 114–117, Kurukshetra University, Kurukshetra, Organised by: Saraswati Nadi Shodh Sansthan, Haryana.\n\nMajor canals are Western Yamuna Canal,\n[http://india.gov.in/sectors/water_resources/sutlej_link.php]  Sutlej Yamuna link canal (from Sutlej river tributary of Indus),\n and Indira Gandhi Canal.Ramtanu Maitra: The Indira Gandhi Canal: greening the desert in India EIR Volume 14, Number 7, February 13, 1987\n\nMajor dams are Kaushalya Dam in Panchkula district, Hathnikund Barrage and Tajewala Barrage on Yamuna in Yamunanagar district, Pathrala barrage on Somb river in Yamunanagar district, ancient Anagpur Dam near Surajkund in Faridabad district,  and Ottu barrage on Ghaggar-Hakra River in Sirsa district.\n\nMajor lakes are Dighal Wetland, Basai Wetland, Badkhal Lake in Faridabad,\n holy Brahma Sarovar and Sannihit Sarovar in Kurukshetra, Blue Bird Lake in Hisar, Damdama Lake at Sohna in Gurgram district,[http://www.damdamalake.com Damdama lake], official website.Rajiv Tiwari, [https://books.google.com.sg/books?id\nFBRYCgAAQBAJ&pgPT117&dq\ndamdama+lake&hlen&sa\nX&ved0ahUKEwj15LH7rLvXAhXLPI8KHbHzCK4Q6AEIJDAA#v\nonepage&qdamdama%20lake&f\nfalse \"Delhi A Travel Guide\"], isbn 9798128819703. Hathni Kund in Yamunanagar district, Karna Lake at Karnal,Page 153, Tourism: Theory, Planning, and Practice, By K.K. Karma, Krishnan K. Kamra, Published 1997, Indus Publishing,  ancient Surajkund in Faridabad, and Tilyar Lake in Rohtak.Page 149, India: A Travel Guide, By B.R. Kishore, published 2001, Diamond Pocket Books (P) Limited, \n\nThe Haryana State Waterbody Management Board is responsible for rejuvenation of 14,000 Johads of Haryana and up to 60 lakes in National Capital Region falling within the Haryana state.[http://indianexpress.com/article/chandigarh/haryana-to-develop-50-60-small-lakes-water-bodies-in-ncr-manohar-lal-khattar-4918316/ \"Haryana to develop 50-60 small lakes, water bodies in NCR: Manohar Lal Khattar\"], Indian Express, 1 November 2017.[http://www.business-standard.com/article/pti-stories/haryana-to-constitute-pond-management-authority-117110101271_1.html \"Haryana to constitute pond management authority \"], Business Standard, 1 November 2017.\n\nOnly hot spring of Haryana is the Sohna Sulphur Hot Spring at Sohna in Gurugram district.[http://www.tribuneindia.com/2000/20000218/haryana.htm#2 \"Sohna Hot Spring.\"], The Tribune. Tosham Hill range has several sacred sulphur pond of religious significance that are revered for the healing impact of sulfur, such as Pandu Teerth Kund, Surya Kund, Kukkar Kund, Gyarasia Kund or Vyas Kund.2004, [https://books.google.com.sg/books?id\nMvAdAQAAMAAJ&qsulphur+tosham&dq\nsulphur+tosham&hlen&sa\nX&ved=0ahUKEwjCq8WxoLvXAhVMuo8KHTtYDAQQ6AEIKzAB \"Records, Volume 135, Part 1.\"], Geological Survey of India, Page 144.\n\nSeasonal waterfalls include Tikkar Taal twin lakes at Morni hiills, Dhosi Hill in Mahendragarh district and Pali village on outskirts of Faridabad.\n\nClimate\n\nHaryana is extremely hot in summer at around 45 C and mild in winter. The hottest months are May and June and the coldest December and January. The climate is arid to semi-arid with average rainfall of 354.5 mm. Around 29% of rainfall is received during the months from July to September, and the remaining rainfall is received during the period from December to February.\n\nFlora and fauna\n\nForests\n\nForest Cover in the state in 2013 was 3.59% (1586 km2) and the Tree Cover in the state was 2.90% (1282 km2), giving a total forest and tree Cover of 6.49%. In 2016-17, 18,412 hectares were brought under tree cover by planting 14.1 million seedlings. Thorny, dry, deciduous forest and thorny shrubs can be found all over the state. During the monsoon, a carpet of grass covers the hills. Mulberry, eucalyptus, pine, kikar, shisham and babul are some of the trees found here. The species of fauna found in the state of Haryana include black buck, nilgai, panther, fox, mongoose, jackal and wild dog. More than 450 species of birds are found here.\n\nWildlife\n\nHaryana has two national parks, eight wildlife sanctuaries, two wildlife conservation areas, four animal and bird breeding centers, one deer park and three zoos, all of which are managed by the Haryana Forest Department of the Government of Haryana.\n\nEnvironmental and ecological issues\n\n \nHaryana Environment Protection Council is the advisory committee and |Department of Environment, Haryana is the department responsible for administration of environment. Areas of Haryana surrounding Delhi NCR are most polluted. During smog of November 2017, Air quality index of Gurugram and Faridabad showed that the density of Fine particulates (2.5 PM diameter) was an average of 400 PM and monthly average of Haryana was 60 PM. Other sources of pollution are exhaust gases from old vehicles, stone crushers and brick kiln. Haryana has 75 lakh (7,500,000) old vehicles, of which 40% are old more polluting vehicles, besides 500,000 new vehicles are added every year. Other majorly polluted cities are Bhiwani, Bahadurgarh, Dharuhera, Hisar and Yamunanagar.[https://translate.google.com/translate?hl\nen&slhi&tl\nen&u=http%3A%2F%2Fwww.jagran.com%2Fnews%2Fnational-air-pollution-effect-from-punjab-to-patna-17024258.html \"From Punjab to Patna pollution spreads.\"], Dainik Jagran, 12 November 2017.\n\nAdministration\n\nDivisions\n\nThe state is divided into divided into 6 revenue divisions, 5 Police Ranges and 3 Police Commissionerates (c. January 2017).[http://www.dailypioneer.com/state-editions/haryana-re-organises-administrative-units.html Reorganisation of Haryana divisions], Daily Pioneer, 3 January 2017.[http://www.uniindia.com/haryana-approves-to-create-two-new-revenue-divisions/states/news/768930.html Haryana approves to create two new revenue divisions], 2 Feb 2017.[https://timesofindia.indiatimes.com/city/chandigarh/authority-set-up-to-rejig-administrative-units-across-haryana/articleshow/56302722.cms Authority set up to rejig administrative units across Haryana], Times of India, 3 Jan 2017.[https://news.webindia123.com/news/articles/india/20170202/3048081.html Haryana approves to create two new revenue divisions], Web India, 2 Feb 2017. Six revenue divisions are: Ambala, Rohtak, Gurgaon, Hisar, Karnal and Faridabad. Haryana has 10 municipal corporations (Gurigram, Faridabad, Ambala, Panchkula, Yamunanagar, Rohtak, Hisar, Panipat, Karnal and Sonepat),  18 municipal councils and 52 municipalities (c. Jan 2018).[https://translate.google.com/translate?hlen&sl\nauto&tlen&u\nhttps%3A%2F%2Fwww.jagran.com%2Fharyana%2Fgurgaon-municipal-tax-increase-17339518.html Municipal taxes will be sanctioned to the weak bodies of the state], [https://www.jagran.com/haryana/gurgaon-municipal-tax-increase-17339518.html Dainik Jagran news], 11 Jan 2018.\n\nWithin these there are 22 districts, 72 sub-divisions, 93 tehsils, 50 sub-tehsils, 140 blocks, 154 cities and towns, 6,841 villages, 6212 villages panchayats and numerous smaller dhanis.\n\nDistricts\n\nLaw and order\n\nHaryana Police force is the law enforcement agency of Haryana. Five Police Ranges are Ambala, Hissar, Karnal, Rewari and Rohtak.[http://www.business-standard.com/article/news-ians/haryana-establishes-five-police-ranges-117011601376_1.html Haryana establishes five police ranges], business Standard, 16 January 2017. Three Police Commissionerates are Faridabad, Gurgaon and Panchkula. Cybercrime investigation cell is based in Gurgaon's Sector 51.\n\nThe highest judicial authority in the state is the Punjab and Haryana High Court, with next higher right of appeal to Supreme Court of India. Haryana uses e-filing facility.\n\nGovernance and e-governance\n\nThe Common Service Centres (CSCs) have been upgraded in all districts to offer hundreds of e-services to citizens, including application of new water connection, sewer connection, electricity bill collection, ration card member registration, result of HBSE, admit cards for board examinations, online admission form for government colleges, long route booking of buses, admission forms for Kurukshetra University and HUDA plots status inquiry. Haryana has become the first state to implement Aadhaar-enabled birth registration in all the districts. Thousands of all traditional offline state and central government services are also available 24/7 online through single unified UMANG app and portal as part of Digital India initiative.[https://economictimes.indiatimes.com/news/economy/finance/government-unveils-umang-app-for-citizen-services/articleshow/61769676.cms \"Government unveils Umang app for citizen services.\"], Economic Times, 23 Nov 2017.[http://www.business-standard.com/article/economy-policy/govt-s-umang-app-finally-sees-the-light-of-the-day-all-you-need-to-know-117112300381_1.html \"Govt's Umang app finally sees the light of the day: All you need to know.\"], Business Standard, 23 Nov 2017.\n\nEconomy\n\nHaryana's 14th placed 12.96% 2012-17 CAGR[https://www.ibef.org/states/haryana-presentation Industrial Development & Economic Growth in Haryana], India Brand Equity Foundation, Nov 2017. estimated 2017-18 GSDP of US$95 billion is split in to 52% services, 30% industries and 18% agriculture.\n\nServices sector is split across 45% in real estate and financial & professional services, 26% trade and hospitality, 15% state and central govt employees, and 14% transport and logistics & warehousing. In IT services, Gurugram ranks number 1 in India in growth rate and existing technology infrastructure, and number 2 in startup ecosystem, innovation and livability (Nov 2016).[http://ceoworld.biz/2016/12/02/indias-top-12-tech-cities-digital-indian-cities-survey-2016/ India’s Top 12 Tech Cities: Digital Indian Cities Survey, 2016], CEOWORLD magazine, Nov 2016.\n\nIndustries sector is split across 69% manufacturing, 28% construction, 2% utilities and 1% mining. In industrial manufacturing, Haryana produces India's 67% of passenger cars, 60% of motorcycles, 50% of tractors and 50% of the refrigerators.\n\nServices and industrial sectors are boosted by 7 operational SEZs and additional 23 formally approved SEZs (20 already notified and 3 in-principal approval) that are mostly spread along the Delhi–Mumbai Industrial Corridor, Amritsar Delhi Kolkata Industrial Corridor and Delhi Western Peripheral Expressway in NCR).\n\nAgriculture sector is split across 93% crops and livestock, 4% commercial forestry and logging, and 2% fisheries. Agriculture sector of Haryana, with only less than 1.4% area of India, contributes 15% food grains to the central food security public distribution system, and 7% of total national agricultural exports including 60% of total national Basmati rice export.\n\nAgriculture \n\nCrops\n\nHaryana is traditionally an agrarian society of zamindars (owner-cultivator farmers). The Green Revolution in Haryana of 1960s combined with completion of Bhakra Dam in 1963 and Western Yamuna Command Network canal system in 1970s resulted in the significantly increased food grain production.\n\nIn 2015-2016, Haryana produced the following principal crops: 13,352,000 tonne wheat, 4,145,000 tonne rice,  7,169,000 tonne sugarcane, 993,000 tonne cotton and 855,000 tonne oilseeds (mustard seed, sunflower, etc.).\n\nFruits, vegetables and spices \n\nVegetable production was: Potato 853,806 tonnes, Onion 705,795 tonnes, Tomato 675,384 tonnes, Cauliflower 578,953 tonnes, Leafy Vegetables 370,646 tonnes, Brinjal 331,169 tonnes, guard 307,793 tonnes, Peas 111,081 tonnes and others 269,993 tonnes.\n\nFruits production was: Citrus 301,764 tonnes, Guava 152,184 tonnes, Mango 89,965 tonnes, Chikoo 16,022 tonnes, Aonla 12,056 tonnes and other fruits 25,848 tonnes.\n\nSpices production was: Garlic 40,497 tonnes, Fenugreek 9,348 tonnes, Ginger 4,304 tonnes and others 840 tonnes.\n\nFlowers and medicinal plants\n\nCut flowers production was: Marigold 61,830 tonnes, Gladiolus 24,486,200 lakh, Rose 18,611,600 lakh and other 6,913,000 lakh.\n\nMedicinal plants production was: Aloe vera 1403 tonnes and Stevia 13 tonnes.\n\nLivestock\n\nHaryana is well known for its high-yield Murrah buffalo. Other breeds of cattle native to Haryana are Haryanvi, Mewati, Sahiwal and Nili-Ravi.\n\nResearch \n\nTo support its agrarian economy, both central government (Central Institute for Research on Buffaloes, Central Sheep Breeding Farm, National Research Centre on Equines, Central Institute of Fisheries, National Dairy Research Institute, Indian Institute of Wheat and Barley Research and National Bureau of Animal Genetic Resources) and state government (CCS HAU, LUVAS, Government Livestock Farm, Regional Fodder Station and Northern Region Farm Machinery Training and Testing Institute) have opened several institutes for research and education.M Gupta, 2011, [http://nopr.niscair.res.in/bitstream/123456789/11559/3/ALIS%2058%281%29%2063-70.pdf Ranking of Indian institutions in agriculture & allied sciences].Jagvir Singh Yadav, 1992, [https://books.google.com.sg/books?isbn8170223865 Evaluation of Agricultural Extension: A Study of Haryana], Page 44.Salim Ahmed Lalli, 2007, [https://books.google.com.sg/books?isbn=8189131192 Infrastructure and agricultural development in Haryana: policy implications].\n\nIndustrial sector\n\nManufacturing\n\n* Faridabad is one of the biggest industrial city of Haryana as well as North India. \n* Hissar, a NCR Counter Magnet city known as steel and cotton spinning hub as well as upcoming integrated industrial aerocity and aero MRO hub at Hisar Airport,[http://www.hindustantimes.com/punjab/chandigarh/hisar-aerodrome-being-considered-for-international-airport-says-mla/article1-1292554.aspx Hisar aerodrome being considered for international airport, says MLA] , HT Correspondent, Hindustan Times, Retrieved on 2 December 2014.[http://www.travelbizmonitor.com/Ministry/haryana-govt-to-develop-international-airport-at-hisar-30068 Haryana to develop international airport at Hisar], [http://www.travelbizmonitor.com TravelBizMonitor], Retrieved in March 2016.[http://www.tribuneindia.com/news/haryana/state-shelves-hisar-airport-project/87044.html State shelves Hisar airport cargo project], The Tribune, 29 May 2015. is a fast developing city and the hometown of Navin Jindal and Subhash Chandra of Zee TV fame. Savitri Jindal, Navin Jindal's mother, has been listed by Forbes as the third richest woman in world.\n* Panipat has heavy industry, including a refinery operated by the Indian Oil Corporation, a urea manufacturing plant operated by National Fertilizers Limited and a National Thermal Power Corporation power plant. It is known for its woven modhas or round stools.\n* Sonepat: IMT Kundli, Nathupur, Rai and Bari are industrial areas with several Small and medium-sized enterprises, including come large ones such as Atlas cycles, E.C.E., Birla factory, OSRAM\n* Gurugram: IMT Minesar, Dundahera and Sohna are industrial and logistics hub, that also has National Security Guards, Indian Institute of Corporate Affairs, National Brain Research Centre and National Bomb Data Centre.\n\nUtilities\n\nHaryana State has always given high priority to the expansion of electricity infrastructure, as it is one of the most important inputs for the development of the state. Haryana was the first state in the country to achieve 100% rural electrification in 1970 as well as the first in the country to link all villages with all-weather roads and provide safe drinking water facilities throughout the state.\n\nPower in the state are:\n* Renewable and non-polluting sources\n** Hydroelectricity \n*** Bhakra-Nangal Dam Hydroelectric Power Plant\n***WYC Hydro Electric Station, 62.4 MW, Yamunanagar\n** Solar power stations\n*** Faridabad Solar Power Plant: being setup by HPGCL Faridabad (c.2016).\n* Nuclear power stations\n** Gorakhpur Nuclear Power Plant, 2800MW, Fatehabad, Phase-I 1400MW by 2021[http://www.downtoearth.org.in/news/gorakhpur-nuclear-power-plant-makes-headway-39141 Gorakhpur nuclear power plant makes headway]. Down To Earth. 20 September 2012. Retrieved 2 April 2016.\n* Coal-fired thermal power stations \n** Deenbandhu Chhotu Ram Thermal Power Station, 600MW, Yamunanagar,[http://hpgcl.gov.in/powerplants_rpp.hp HPGCL power plant capacity] \n** Indira Gandhi Super Thermal Power Project, 1500MW, Jhajjar\n** Jhajjar Power Station, 1500MW \n** Panipat Thermal Power Station I, 440MW\n** Panipat Thermal Power Station II, 920MW\n** Rajiv Gandhi Thermal Power Station, 1200MW, Hisar\n\nServices sector\n\nTransport\n\nRoads and Highways\n\nHaryana has a total road length of , including  29 national highways,  state highways,  Major District Roads (MDR) and  Other District Roads (ODR) (c. December 2017).[http://www.tribuneindia.com/news/haryana/single-agency-to-handle-road-repair-work-from-january-1/520344.html Single agency to handle road repair work from January 1], Tribune, 29 Dec 2017. A fleet of 3,864 Haryana Roadways buses covers a distance of 1.15 million km per day, and it was the first state in the country to introduce luxury video coaches.[http://haryanaindustries.nic.in/WhyHaryana/Pages/NewEconomicInfrastructure.aspx Why Haryana? - Economic Infrastructure] \n\nAncient Delhi Multan Road and Grand Trunk Road, South Asia's oldest and longest major roads, pass through Haryana. GT Road passes through the districts of Sonipat, Panipat, Karnal, Kurukshetra and Ambala in north Haryana where it enters Delhi and subsequently the industrial town of Faridabad on its way. The  Kundli-Manesar-Palwal Expressway(KMP) will provide a high-speed link to northern Haryana with its southern districts such as Sonepat, Gurgaon, Jhajjar and Faridabad.\n\nThe Delhi-Agra Expressway (NH-2) that passes through Faridabad is being widened to six lanes from current four lanes. It will further boost Faridabad's connectivity with Delhi.\n\nRailway \n\nRail network in Haryana is covered by 5 rail divisions under 3 rail zones. Diamond Quadrilateral High-speed rail network, Eastern Dedicated Freight Corridor (72 km) and Western Dedicated Freight Corridor (177 km) pass through Haryana.\n\nBikaner railway division of North Western Railway zone manages rail network in western and southern Haryana covering Bhatinda-Dabwali-Hanumangarh line, Rewari-Bhiwani-Hisar-Bathinda line, Hisar-Sadulpur line and Rewari-Loharu-Sadulpur line.[http://www.nwr.indianrailways.gov.in/uploads/files/1450093153283-BKN.pdf Bikaner Division map and history] Jaipur railway division of North Western Railway zone manages rail network in south-west Haryana covering Rewari-Reengas-Jaipur line, Delhi-Alwar-Jaipur line and Loharu-Sikar line.[http://www.nwr.indianrailways.gov.in/uploads/files/1450093177866-JP.pdf Jaipur division network map]\n\nDelhi railway division of Northern Railway zone manages rail network in north and east and central Haryana covering Delhi-Ambala line, Delhi-Rohtak-Tohana line, Rewari–Rohtak line, Jind-Sonepat line and Delhi-Rewari line.[http://www.nr.indianrailways.gov.in/view_section.jsp?lang\n0&id0,1,263,314,315 Delhi division map and history] Agra railway division of North Central Railway zone manages another very small part of network in south-east Haryana covering Palwal-Mathura line only.[http://www.ncr.indianrailways.gov.in/view_section.jsp?lang0&id\n0,1,262 NCR Zone map]\n\nAmbala railway division of Northern Railway zone manages small part of rail network in north-east Haryana covering Ambala-Yamunanagar line, Ambala-Kurukshetra line and UNESCO World Heritage Kalka–Shimla Railway.[http://www.nr.indianrailways.gov.in/view_section.jsp?lang\n0&id=0,1,263,314,319 Ambala Division map and history].\n\nMetro\n\nDelhi Metro connects the national capital Delhi with parts of Haryana state within NCR, including Bahadurgarh, Faridabad and with Rapid MetroRail Gurgaon. Faridabad has the longest metro network in the NCR Region consisting of 9 stations and track length being 14 km.\n\nSky Way\n\nThe Haryana and Delhi governments have constructed the  international standard Delhi Faridabad Skyway, the first of its kind in North India, to connect Delhi and Faridabad.\n\nCommunication and media\n\nHaryana has a statewide network of telecommunication facilities. Haryana Government has its own statewide area network by which all government offices of 22 districts and 126 blocks across the state are connected with each other thus making it the first SWAN of the country.[http://www.egovonline.net/articles/article-details.asp?TitleTulip-IT-in-Haryana&ArticalID\n1716&Type=INDUSTRY%20PERSPECTIVE Egovonline.net]   [http://www.punjabnewsline.com/content/view/7526/93/ Punjabnewsline.com]    Bharat Sanchar Nigam Limited and most of the leading private sector players (such as Reliance Infocom, Tata Teleservices, Bharti Telecom, Idea Vodafone Essar, Aircel, Uninor and Videocon) have operations in the state. Important areas around Delhi are an integral part of the local Delhi Mobile Telecommunication System. This network system would easily cover major towns like Faridabad and Gurgaon.\n\nElectronic media channels include, MTV, 9XM, Star Group, SET Max, News Time, NDTV 24x7 and Zee Group. The radio stations include All India Radio and other FM stations.\n\nThe major newspapers of Haryana include Dainik Bhaskar, Punjab Kesari, Jag Bani, Dainik Jagran, The Tribune, Amar Ujala, Hindustan Times, Dainik Tribune, The Times of India and Hari-Bhumi.\n\nHealthcare\n\nThe Total Fertility Rate of Haryana is 2.3. The Infant Mortality Rate is 41 (SRS 2013) and Maternal Mortality Ratio is 146 (SRS 2010–2012).\n\nEducation\n\nLiteracy\n\nLiteracy rate in Haryana has seen an upward trend and is 76.64 percent as per 2011 population census. Male literacy stands at 85.38 percent, while female literacy is at 66.67 percent. In 2001, the literacy rate in Haryana stood at 67.91 percent of which male and female were 78.49 percent and 55.73 percent literate respectively. , Gurgaon city had the highest literacy rate in Haryana at 86.30%  followed by Panchkula at 81.9 per cent and Ambala at 81.7 percent. In terms of districts,  Rewari had the highest literacy rate in Haryana at 74%, higher than the national average of 59.5%: male literacy was 79%, and female 67%.\n\nSchools\n\nHaryana Board of School Education, established in September 1969 and shifted to Bhiwani in 1981, conducts public examinations at middle, matriculation, and senior secondary levels twice a year. Over seven lakh candidates attend annual examinations in February and March; 150,000 attend supplementary examinations each November. The Board also conducts examinations for Haryana Open School at senior and senior secondary levels twice a year. The Haryana government provides free education to women up to the bachelor's degree level.\n\nIn 2015-2016, there were nearly 20,000 schools, including 10,100 state government schools (36 Aarohi Schools, 11 Kasturba Gandhi Balika Vidyalayas, 21 Model Sanskriti Schools, 8744 government primary school, 3386 government middle school, 1284 government high school and 1967 government senior secondary schools), 7,635 private schools (200 aided,[http://www.schooleducationharyana.gov.in/downloads_pdf/stat/AidedSchool_AsOn09072014.pdf Haryana Education stats: aided private schools, 2015-2016] 6612 recognized unaided, and 821 unrecognied unaided private schools.)and several hundred other central government and private schools such as Kendriya Vidyalaya, Indian Army Public Schools, Jawahar Navodaya Vidyalaya and DAV schools affiliated to central government's CBSE and ICSE school boards.\n\nUniversities and higher education\n\nHaryana has 29 universities and 299 colleges, including 115 government colleges, 88 govt-aided colleges and 96 self-finance colleges (c. Jan 2018).[https://translate.google.com/translate?hl\nen&slhi&tl\nen&uhttps%3A%2F%2Fwww.jagran.com%2Fharyana%2Fmahendragarh-haryana-is-growing-rapidly-in-higher-education-colleges-in-small-states-17374290.html Haryana is growing rapidly in higher education, 299 colleges in small state], [https://www.jagran.com/haryana/mahendragarh-haryana-is-growing-rapidly-in-higher-education-colleges-in-small-states-17374290.html Jagram], 17 Jan 2018. Hisar has three universities: Chaudhary Charan Singh Haryana Agricultural University - Asia's largest agricultural university, Guru Jambheshwar University of Science and Technology, Lala Lajpat Rai University of Veterinary & Animal Sciences); several national agricultural and veterinary research centres (National Research Centre on Equines), Central Sheep Breeding Farm, National Institute on Pig Breeding and Research, Northern Region Farm Machinery Training and Testing Institute and Central Institute for Research on Buffaloes (CIRB); and more than 20 colleges including Maharaja Agrasen Medical College, Agroha.\n\nUnion Minister Ravi Shankar Prasad announced on 27 February 2016 that National Institute of Electronics and Information Technology (NIELIT) would be set up in Kurukshetra to provide computer training to youth and a Software Technology Park of India (STPI) would be set up in Panchkula’s existing HSIIDC IT Park in Sector 23. Hindi and English are compulsory languages in schools whereas Punjabi, Sanskrit and Urdu are chosen as optional languages.\n\nSports\n\nIn the 2010 Commonwealth Games at Delhi, 22 out of 38 gold medals that India won came from Haryana.[http://mizoramexpress.com/index.php/2010/10/32-medal-winner-from-haryana-to-get-maruti-cars Mizoramexpress.com]    During the 33rd National Games held in Assam in 2007, Haryana stood first in the nation[http://www.33rdnationalgames.nic.in/medal_tally.htm Official site for the 33rd National Games 2007, Guwahati]  with a medal tally of 80, including 30 gold, 22 silver and 28 bronze medals.\n\nThe 1983 World-Cup-winning captain Kapil Dev is from Haryana. Nahar Singh Stadium was built in Faridabad in the year 1981 for international cricket. This ground has the capacity to hold around 25,000 people as spectators. Tejli Sports Complex is an Ultra-Modern sports complex in Yamuna Nagar. Tau Devi Lal Stadium in Gurgaon is a multi-sport complex.\n\nChief Minister of Haryana Manohar Lal Khattar announced the \"Haryana Sports and Physical Fitness Policy\", a policy to support 26 Olympic sports, on 12 January 2015 with the words \"We will develop Haryana as the sports hub of the country.\"\n\nHaryana is home to Haryana Gold, one of India's eight professional basketball teams which compete in the country's UBA Pro Basketball League. Haryana. http://en.wikipedia.org/?curid=14189."
  }
}
