{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7301",
  "eid" : "e0ee9020-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778457122,
  "textBody" : "Casablanca (; ; local informal name: Kaẓa), located in the central-western part of Morocco bordering the Atlantic Ocean, is the largest city in Morocco. It is also the largest city in the Maghreb, as well as one of the largest and most important cities in Africa, both economically and demographically.\n\nCasablanca is Morocco's chief port and one of the largest financial centers on the continent. According to the 2014 population estimate, the city has a population of about 3.35 million in the urban area and over 6.8 million in the Casablanca-Settat region. Casablanca is considered the economic and business center of Morocco, although the national political capital is Rabat.\n\nThe leading Moroccan companies and international corporations doing business in the country have their headquarters and main industrial facilities in Casablanca. Recent industrial statistics show Casablanca retains its historical position as the main industrial zone of the country. The Port of Casablanca is one of the largest artificial ports in the world, and the second largest port of North Africa, after Tanger-Med 40 km east of Tangier. Casablanca also hosts the primary naval base for the Royal Moroccan Navy.\n\nEtymology \n\nThe original name of Casablanca was Anfa, in Berber language, by at least the seventh century BC. After the Portuguese took control of the city in the 15th century AD, they rebuilt it, changing the name to Casa Branca. It derives from the Portuguese word combination meaning \"White House\" (' \"white\", ' \"house\"). The present name, which is the Spanish version, came when the Portuguese kingdom was integrated in personal union to the Spanish kingdom. During the French protectorate in Morocco, the name remained Casablanca. In 1755 an earthquake destroyed most of the town. It was rebuilt by the Sultan who changed the name into the local Arabic which is Ad-dar Al Baidaa, although Arabic also has its own version of Casablanca (كازابلانكا, Kāzāblānkā). The city is still nicknamed Casa by many locals and outsiders to the city. In many other cities with a different dialect, it is called Ad-dar Al-Bida, instead.\n\nA famous boulevard inside Casablanca City is called \"Anfa Boulevard\". Anfa is generally considered the early \"old original city\" of Casablanca; it is legally a prefecture (district) with half a million city inhabitants.\n\nHistory \n\nEarly history \n\nThe area which is today Casablanca was founded and settled by Berbers by at least the seventh century BC. It was used as a port by the Phoenicians and later the Romans. In his book Description of Africa, Leo Africanus refers to ancient Casablanca as \"Anfa\", a great city founded in the Berber kingdom of Barghawata in 744 AD. He believed Anfa was the most \"prosperous city on the Atlantic Coast because of its fertile land.\" Barghawata rose as an independent state around this time, and continued until it was conquered by the Almoravids in 1068. Following the defeat of the Barghawata in the 12th century, Arab tribes of Hilal and Sulaym descent settled in the region, mixing with the local Berbers, which led to widespread Arabization.S. Lévy, Pour une histoire linguistique du Maroc, in Peuplement et arabisation au Maghreb occidental: dialectologie et histoire, 1998, pp.11-26 () During the 14th century, under the Merinids, Anfa rose in importance as a port. The last of the Merinids were ousted by a popular revolt in 1465.\n\nPortuguese conquest and Spanish influence \n\nIn the early 15th century, the town became an independent state once again, and emerged as a safe harbour for pirates and privateers, leading to it being targeted by the Portuguese, who bombarded the town which led to its destruction in 1468. The Portuguese used the ruins of Anfa to build a military fortress in 1515. The town that grew up around it was called Casa Branca, meaning \"white house\" in Portuguese.\n\nBetween 1580 and 1640, the Crown of Portugal was integrated to the Crown of Spain, so Casablanca and all other areas occupied by the Portuguese were under Spanish control, though maintaining an autonomous Portuguese administration. As Portugal broke ties with Spain in 1640, Casablanca came under fully Portuguese control once again. The Europeans eventually abandoned the area completely in 1755 following an earthquake which destroyed most of the town.\n\nThe town was finally reconstructed by Sultan Mohammed ben Abdallah (1756–1790), the grandson of Moulay Ismail and an ally of George Washington, with the help of Spaniards from the nearby emporium. The town was called الدار البيضاء ad-Dār al-Bayḍāʼ, the Arabic translation of the Spanish Casa Blanca.\n\nFrench conquest \n\nIn the 19th century, the area's population began to grow as it became a major supplier of wool to the booming textile industry in Britain and shipping traffic increased (the British, in return, began importing gunpowder tea, used in Morocco's national drink, mint tea). By the 1860s, around 5,000 residents were there, and the population grew to around 10,000 by the late 1880s.Pennel, CR: Morocco from Empire to Independence, Oneworld, Oxford, 2003, p 121 Casablanca remained a modestly sized port, with a population reaching around 12,000 within a few years of the French conquest and arrival of French colonialists in the town, at first administrators within a sovereign sultanate, in 1906. By 1921, this rose to 110,000,Pennel, CR: Morocco from Empire to Independence, Oneworld, Oxford, 2003, p 149. largely through the development of shanty towns.\n\nFrench rule and influence \n\nIn June 1907, the French attempted to build a light railway near the port and passing through a graveyard. As an act of resistance and protestation, the locals attacked the French, riots ensued, causing a few soldiers to be wounded and one general to be killed. In response, the French attacked by ship, bombarding the city from the coast, and landing troops inside the town, which caused severe damage to the town and 15,000 dead and wounded bodies. The French claimed that it was to restore order there. This effectively began the process of colonization, although French control of Casablanca was not formalised until 1910. Under the French rule, Muslim anti-Jewish riots occurred in 1908.\n\nThe famous 1942 film Casablanca (starring Humphrey Bogart) underlined the city's colonial status at the time—depicting it as the scene of a power struggle between competing European powers. The film has a cosmopolitan cast of characters (American, French, German, Spaniard, Czech, Norwegian, Austrian, Bulgarian, Russian, and some other nationalities).\n\nEuropeans formed almost half the population.Albert Habib Hourani, Malise Ruthven (2002). \"[https://books.google.com/books?id\negbOb0mewz4C&pgPA323&dq&hl\nen#vonepage&q\n&f=false A history of the Arab peoples]\". Harvard University Press. p.323.  During the 1940s and 1950s, Casablanca was a major centre of anti-French rioting. A bomb attack on 25 December 1953 (Christmas Day) caused 16 deaths.\n\nWorld War II \n\nOperation Torch (initially called Operation Gymnast) was the British-American invasion of French North Africa during the North African campaign of World War II, which started on 8 November 1942.\n\nThe Americans attacked at three different locations in French North Africa, one of the three being the landings at Casablanca because of its important port and the major administrative centres.\n\nCasablanca was an important strategic port during World War II and hosted the Casablanca Conference in 1943, in which Churchill and Roosevelt discussed the progress of the war. Casablanca was the site of a large American air base, which was the staging area for all American aircraft for the European Theater of Operations during World War II.\n\nSince independence \n\nIn October 1930, Casablanca hosted a Grand Prix, held at the new Anfa Racecourse. In 1958, the race was held at Ain-Diab circuit (see Moroccan Grand Prix). Morocco gained independence from France on 2 March 1956. In 1983, Casablanca hosted the Mediterranean Games. The city is now developing a tourism industry. Casablanca has become the economic and business capital of Morocco, while Rabat is the political capital.\n\nIn March 2000, more than 60 women's groups organized demonstrations in Casablanca proposing reforms to the legal status of women in the country. About 40,000 women attended, calling for a ban on polygamy and the introduction of divorce law (divorce being a purely religious procedure at that time). Although the counter-demonstration attracted half a million participants, the movement for change started in 2000 was influential on King Mohammed VI, and he enacted a new mudawana, or family law, in early 2004, meeting some of the demands of women's rights activists.\n\nOn 16 May 2003, 33 civilians were killed and more than 100 people were injured when Casablanca was hit by a multiple suicide bomb attack carried out by Moroccans and claimed by some to have been linked to al-Qaeda. Twelve suicide bombers struck five locations in the city.\n\nA string of suicide bombings struck the city in early 2007. A suspected militant blew himself up at a Casablanca internet café on 11 March 2007. On 10 April, three suicide bombers blew themselves up during a police raid of their safe house. Two days later, police set up barricades around the city and detained two more men who had escaped the raid. On 14 April, two brothers blew themselves up in downtown Casablanca, one near the American Consulate, and one a few blocks away near the American Language Center. Only one person was injured aside from the bombers, but the Consulate was closed for more than a month.\n\nAs calls for reform spread through the Arab world in 2011, Moroccans joined in, but concessions by the ruler led to acceptance. However, in December, thousands of people demonstrated in several parts of the city, especially the city center near la Fontaine, desiring more significant political reforms.\n\nGeography \n\nCasablanca is located in the Chawiya Plain which has historically been the breadbasket of Morocco. Apart from the Atlantic coast, the Bouskoura forest is the only natural attraction in the city. The forest was planted in the 20th century and consists mostly of eucalyptus, palm, and pine trees. It is located halfway to the city's international airport.\n\nThe only watercourse in Casablanca is oued Bouskoura, a small seasonal creek that until 1912 reached the Atlantic Ocean near the actual port. Most of oued Bouskoura's bed has been covered due to urbanization and only the part south of El Jadida road can now be seen. The closest permanent river to Casablanca is Oum Rabia, 70 km to the south-east.\n\nClimate\n\nCasablanca has a warm summer Mediterranean climate (Köppen climate classification Csa). The cool Canary Current off the Atlantic coast moderates temperature variation, which results in a climate remarkably similar to that of coastal Los Angeles, with similar temperature ranges. The city has an annual average of 72 days with significant precipitation, which amounts to 412 mm per year. The highest and lowest temperatures ever recorded in the city are  and , respectively. The highest amount of rainfall recorded in a single day is 178 mm on 30 November 2010.\n\nEconomy \n\nThe Grand Casablanca region is considered the locomotive of the development of the Moroccan economy. It attracts 32% of the country's production units and 56% of industrial labor. The region uses 30% of the national electricity production. With MAD 93 billion, the region contributes to 44% of the industrial production of the kingdom. About 33% of national industrial exportations, MAD 27 billion, comes from the Grand Casablanca; 30% of the Moroccan banking network is concentrated in Casablanca.\n\nOne of the most important Casablancan exports is phosphate. Other industries include fishing, fish canning, sawmills, furniture production, building materials, glass, textiles, electronics, leather work, processed food, spirits, soft drinks, and cigarettes.\n\nThe Casablanca and Mohammedia seaports activity represent 50% of the international commercial flows of Morocco. Almost the entire Casablanca waterfront is under development, mainly the construction of huge entertainment centres between the port and Hassan II Mosque, the Anfa Resort project near the business, entertainment and living centre of Megarama, the shopping and entertainment complex of Morocco Mall, as well as a complete renovation of the coastal walkway. The Sindbad park is planned to be totally renewed with rides, games and entertainment services.\n\nRoyal Air Maroc has its head office at the Casablanca-Anfa Airport. In 2004, it announced that it was moving its head office from Casablanca to a location in Province of Nouaceur, close to Mohammed V International Airport.\"[http://www.accessmylibrary.com/coms2/summary_0286-22062524_ITM Royal Air Maroc.(Africa/Middle East)(Brief Article)].\" Air Transport World. 1 July 2004. Retrieved on 19 October 2009.  The agreement to build the head office in Nouaceur was signed in 2009.\"[http://www.leconomiste.com/article.html?a=53387 Casablanca: Nouaceur abritera le futur siège de la RAM].\" L'Économiste.  18 August 2009. Retrieved on 19 October 2009.\n\nThe biggest CBD of Casablanca and Maghreb is in the North of the town in Sidi Maarouf near the mosque of Hassan II and the biggest project of skycrapers of Maghreb and Africa Casablanca Marina.\n\nAdministrative divisions \n\nCasablanca is a commune, part of the region of Casablanca-Settat. The commune is divided into eight districts or prefectures, which are themselves divided into 16 subdivisions or arrondissements and one municipality. The districts and their subdivisions are:\n\n# Aïn Chock (عين الشق) – Aïn Chock (عين الشق)\n# Aïn Sebaâ - Hay Mohammadi (عين السبع الحي المحمدي) – Aïn Sebaâ (عين السبع), Hay Mohammadi (الحي المحمدي), Roches Noires (روش نوار).\n# Anfa (أنفا) – Anfa (أنفا), Maârif (المعاريف), Sidi Belyout (سيدي بليوط).\n# Ben M'Sick (بن مسيك) – Ben M'Sick (بن مسيك), Sbata (سباته).\n# Sidi Bernoussi (سيدي برنوصي) – Sidi Bernoussi (سيدي برنوصي), Sidi Moumen (سيدي مومن).\n# Al Fida - Mers Sultan (الفداء – مرس السلطان) – Al Fida (الفداء); Mechouar (المشور) (municipality), Mers Sultan (مرس السلطان).\n# Hay Hassani (الحي الحسني) – Hay Hassani (الحي الحسني).\n# Moulay Rachid (مولاي رشيد) – Moulay Rachid (مولاي رشيد), Sidi Othmane (سيدي عثمان).\n\nNeighborhoods \n\nThe list of neighborhoods is indicative and not complete:\n\n* 2 Mars\n* Ain Chock\n* Ain Diab\n* Ain Sebaa\n* Belvédère\n* Beausejour\n* Bouchentouf\n* Bourgogne\n* Californie\n* Centre Ville (downtown)\n* C.I.L.\n* Derb Ghalaf\n* Derb Sultan Al Fida\n* Derb TaZI\n* Al Hank\n* Hay Al Mohammadi\n* Ghandi\n* Gauthier\n* Habous\n* Hay Dakhla (\"Derb Lihoudi\")\n* Hay Farah\n* Hay El Hana\n* Hay Moulay Rachid\n* La Colline\n* Bouskoura\n* Laimoun (Hay Hassani)\n* Lissasfa\n* Maârif\n* Palmiers\n* Old Madina (Mdina Qdima)\n* Mers Sultan\n* Nassim\n* Oasis\n* Walfa\n* Polo\n* Racine\n* Riviera\n* Roches Noires\n* Salmia II\n* Sbata\n* Sidi Bernoussi\n* Sidi Maarouf\n* Sidi Moumen\n* Sidi Othman\n\nDemographics \n\nThe commune of Casablanca recorded a population of 3,359,818 in the 2014 Moroccan census. About 98% live in urban areas. Around 25% of them are under 15 and 9% are over 60 years old. The population of the city is about 11% of the total population of Morocco. Grand Casablanca is also the largest urban area in the Maghreb. 99.9% of the population of Morocco are Arab and Berber Muslims.\nDuring the French protectorate in Morocco, European Christians formed almost half the population. Later after the independence in 1956, the European population has decreased substantially.\n\nJudaism in Casablanca \n\nA Sephardic Jewish community was in Anfa up to the destruction of the city, by the Portuguese in 1468. Jews were slow to return to the town, but by 1750, the Rabbi Elijah Synagogue was built as the first Jewish synagogue in Casablanca. It was destroyed along with much of the town in the 1755 Lisbon earthquake. Today, the Jewish cemetery of Casablanca is one of the major cemeteries of the city.\nThe Moroccan Jewish Museum is a museum established in the city in 1997. It is the only museum devoted to Judaism in the Arab world (see also History of the Jews in Morocco).\n\nMain sites \n\nThe French period Ville Nouvelle (New Town) of Casablanca was designed by the French architect Henri Prost, and was a model of a new town at that time. The main streets radiate south and east from Place des Nations Unies, previously the main market of Anfa. Former administrative buildings and modern hotels populate the area. Their style is a combination of Hispano-Moorish and Art Deco.\n\nCasablanca is home to the Hassan II Mosque, designed by the French architect Michel Pinseau. It is situated on a promontory on the Atlantic Ocean. The mosque has room for 25,000 worshippers inside, and a further 80,000 can be accommodated in the mosque's courtyard. Its minaret is the world's tallest at 210 m. The mosque is also the largest in North Africa, and the third-largest in the world.\n\nWork on the mosque started in 1980, and was intended to be completed for the 60th birthday of the former Moroccan king, Hassan II, in 1989. However, the building was not inaugurated until 1993. Authorities spent an estimated $800 million in the construction of the building.\n\nThe Parc de la Ligue Arabe (formally called Lyautey) is the city's largest public park. On its edge is the Casablanca Cathedral (Cathédrale Sacré-Coeur). It is no longer in use for religious purposes, but it is open to visitors and a splendid example of Mauresque architecture. The Old Medina (the part of town antedating the French protectorate) attracts fewer tourists than the medinas of cities such as Fes and Marrakech. However, it has undergone some restoration in recent years. Included in this project have been the western walls of the medina, its skala, or bastion, and its colonial-period clock tower.\n\nA popular site among locals is the small island Marabout de Sidi Abderrahmane. It is possible to walk across to the rocky island at low tide. This outcrop contains the tomb of Sidi Abderrhamane Thaalibi, a Sufi from Baghdad and the founder of Algiers. He is considered a saint in Morocco. Because of this, many Moroccans make informal pilgrimages to this site \"to reflect on life and to seek religious enlightenment\". Some believe that the saint possessed magical powers, so his tomb still possesses these powers. People come and seek this magic to be cured. Non-Muslims may not enter the shrine.\n\nEducation\n\nColleges and universities\n\nPublic: University of Hassan II Casablanca\n\nPrivate:\n*Université Mundiapolis\n*Université Internationale de Casablanca\n\nPrimary and secondary schools\n\nInternational schools:\n* Belgium: École Belge de Casablanca\n* French:\n**Collège Anatole France\n**Lycée Lyautey\n**Groupe Scolaire Louis Massignon\n**Lycée La Résidence\n**Lycée Maïmonide (FR)\n**Lycée Léon l'Africain\n**École Normale Hébraïque\n* Italian: Scuola \"Enrico Mattei\"\n* Spanish: Instituto Español Juan Ramón Jiménez\n* American:\n** Casablanca American School\n** American Academy Casablanca\n** George Washington Academy\n\nSports \n\nHosting\n\nCasablanca staged the 1961 Pan Arab Games, the 1983 Mediterranean Games, and games during the 1988 Africa Cup of Nations. Morocco was scheduled to host the 2015 African Nations Cup, but decided to decline due to Ebola fears. Morocco was expelled and the tournament was held in Equatorial Guinea.\n\nVenues \n\n* Stade Larbi Zaouli\n* Stade Mohamed V\n* Stade Sidi Bernoussi\n* Complexe Al Amal de Casablanca\n\nThe Grand Stade de Casablanca is the proposed title of the planned football stadium to be built in the city. Once completed in 2014, it will be used mostly for football matches and will serve as the home of Raja Casablanca, Wydad Casablanca, and the Morocco national football team. The stadium was designed with a capacity of 80,000 spectators, making it one of the highest-capacity stadiums in Africa. Once completed, it will replace the Stade Mohamed V. The initial idea of the stadium was for the 2010 FIFA World Cup, for which Morocco lost their bid to South Africa. Nevertheless, the Moroccan government supported the decision to go ahead with the plans. It will be completed in 2014, ready for the 2015 Africa Cup of Nations.\n\nAssociation football \n\nCasablanca is home to two popular football clubs, Wydad Casablanca and Raja Casablanca. Raja's symbol is an eagle and Wydad's symbol is a goose. These two popular clubs have produced some of Morocco's best players, such as: Salaheddine Bassir, Abdelmajid Dolmy, Baddou Zaki, Aziz Bouderbala, and Noureddine Naybet. Other football teams on top of these two major teams  based in the city of Casablanca include Rachad Bernoussi, TAS de Casablanca, Majd Al Madina, and Racing Casablanca.\n\nTennis \n\nCasablanca hosts The Grand Prix Hassan II, a professional men's tennis tournament of the ATP tour. It first began in 1986, and is played on clay courts type at Complexe Al Amal.\n\nNotable winners of the Hassan II Grand-Prix are Thomas Muster in 1990, Hicham Arazi in 1997, Younes El Aynaoui in 2002, and Stanislas Wawrinka in 2010.\n\nTransport \n\nTram \n\nThe Casablanca tramway is the rapid transit tram system in Casablanca. The route is 31 km long, with 49 stops, and Y-shaped; further lines are planned.\n\nAir \n\nCasablanca's main airport is Mohammed V International Airport, Morocco's busiest airport. Regular domestic flights serve Marrakech, Rabat, Agadir, Oujda, Tangier, Al Hoceima, and Laayoune, as well as other cities.\n\nCasablanca is well-served by international flights to Europe, especially French and Spanish airports, and has regular connections to North American, Middle Eastern and sub-Saharan African destinations. New York City, Montreal, Paris, London and Dubai are important primary destinations.\n\nThe older, smaller Casablanca-Anfa Airport to the west of the city, served certain destinations including Damascus, and Tunis, and was largely closed to international civilian traffic in 2006. It has been closed and destroyed to build the \"Casablanca Finance City\", the new heart of the city of Casablanca. Casablanca Tit Mellil Airport is located in the nearby community of Tit Mellil.\n\nCoaches \n\nCTM coaches (intercity buses) and various private lines run services to most notable Moroccan towns, as well as a number of European cities. These run from the Gare Routière on Rue Léon l'Africain in downtown Casablanca.\n\nMetro \n\nSee also: Casablanca RER or Casablanca metro\n\nSince the 1970s, Casablanca had planned to build a metro system to offer some relief to the problems of traffic congestion and poor air quality. However, the city council voted to abandon the metro project in 2014 due to high costs, and decided to continue expanding the already operating tram system instead.\n\nTaxis \n\nRegistered taxis in Casablanca are coloured red and known as petit taxis (small taxis), or coloured white and known as grands taxis (big taxis). As is standard Moroccan practice, petits taxis, typically small-four door Dacia Logan, Peugeot 207, or similar cars, provide metered cab service in the central metropolitan areas. Grands taxis, generally older Mercedes-Benz sedans, provide shared mini-bus like service within the city on predefined routes, or shared intercity service. Grands taxis may also be hired for private service by the hour or day.\n\nTrains \n\nCasablanca is served by three principal railway stations run by the national rail service, the ONCF.\n\n is the main intercity station, from which trains run south to Marrakech or El Jadida and north to Mohammedia and Rabat, and then on either to Tangier or Meknes, Fes, Taza and Oujda/Nador. A dedicated airport shuttle service to Mohammed V International Airport also has its primary in-city stop at this station, for connections on to further destinations.\n\n serves primarily commuter trains such as the Train Navette Rapide (TNR or Aouita) operating on the Casablanca – Kenitra rail corridor, with some connecting trains running on to Gare de Casa-Voyageurs. The station provides a direct interchange between train and shipping services, and is located near several port-area hotels. It is the nearest station to the old town of Casablanca, and to the modern city centre, around the landmark Casablanca Twin Center. Casa-Port station is being rebuilt in a modern and enlarged configuration. During the construction, the station is still operational. From 2013, it will provide a close connection from the rail network to the city's new tram network.\n\nCasa-Oasis was originally a suburban commuter station which was fully redesigned and rebuilt in the early 21st century, and officially reopened in 2005 as a primary city rail station. Owing to its new status, all southern intercity train services to and from Casa-Voyageurs now call at Casa-Oasis. ONCF stated in 2005 that the refurbishment and upgrading of Casa-Oasis to intercity standards was intended to relieve passenger congestion at Casa-Voyageurs station.\n\nNotable people \n\n* Salaheddine Bassir – Moroccan footballer\n* Larbi Benbarek – Moroccan footballer\n* Frida Boccara – French singer, Winner of the Eurovision Song Contest 1969\n* Soufiane Choubani – Founder of the Moroccan National Debate Team\n* French Montana - Moroccan-American rapper\n* La Fouine - Moroccan-French rapper\n* El Haqed - Moroccan rapper\n* Dizzy DROS - Moroccan rapper\n* Jean-Paul Bertrand-Demanes – French footballer\n* Jean-Charles de Castelbajac – French fashion designer\n* Merieme Chadid – Moroccan astronomer\n* Serge Haroche –  French physicist who was awarded the 2012 Nobel Prize for Physics\n* Shatha Hassoun – Moroccan/Iraqi singer\n* Lydia Hatuel-Czuckermann - Israeli Olympic fencer\n* Hicham Mesbahi – Moroccan boxer\n* Nawal El Moutawakel – Olympic champion\n* Noureddine Naybet – Moroccan footballer\n* Mostafa Nissaboury – Moroccan poet\n* Hakim Noury – Moroccan film director\n* Maurice Ohana – French composer\n* Jean Reno – French Hollywood actor\n* Daniel Sivan – professor\n* Alain Souchon – French songwriter\n* Frank Stephenson – award-winning automobile designer.\n* Hassan Saada - Moroccan boxer arrested for alleged rape before Olympic match\n* Sidney Taurel – Naturalized American CEO of Eli Lilly and Company from 1998 to 2008\n* Richard Virenque – French cyclist\n* Abdallah Zrika – Moroccan poet\n\nIn popular culture \n\n* Casablanca is the setting of the 1942 film of the same name starring Humphrey Bogart and Ingrid Bergman. The film has achieved worldwide popularity since then. Nominated for eight Academy Awards, it won three, including Best Picture.\n* A Night in Casablanca (1946) was the 12th Marx Brothers' movie. The film stars Groucho Marx, Chico Marx, and Harpo Marx. It was directed by Archie Mayo and written by Joseph Fields and Roland Kibbee. The film contains the song \"Who's Sorry Now?\", with music by Ted Snyder and lyrics by Bert Kalmar and Harry Ruby. It is sung in French by Lisette Verea playing the part of Beatrice Rheiner, and then later sung in English. Liszt's \"Hungarian Rhapsody No. 2\" is played twice, once by Chico on piano as an introduction to the \"Beer Barrel Polka\", and again by Harpo on the harp.\n* The city is featured in The Mysterious Caravan (1975), volume 54 in the original Hardy Boys series.\n* Casablanca is the setting for several chapters in Doubleshot, a 2000 James Bond novel by Raymond Benson. In the novel, one of the characters mentions that the 1942 film was shot in Hollywood and not on location.\n* Casablanca is one of the key locations in the 2006 video game Dreamfall, as it is where the primary protagonist of the game, Zoë Castillo, lives. Although the city is imagined in the year 2219, much of the present-day architecture is used for inspiration.\n* Casablanca is the setting for the first act of the 2016 World War II romantic thriller film Allied starring Brad Pitt and Marion Cotillard.\n\nInternational relations \n\nSee also List of twin towns and sister cities in Morocco\n\nTwin towns – sister cities \n\nCasablanca is twinned with:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Casablanca" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7301" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Casablanca (; ; local informal name: Kaẓa), located in the central-western part of Morocco bordering the Atlantic Ocean, is the largest city in Morocco. It is also the largest city in the Maghreb, as well as one of the largest and most important cities in Africa, both economically and demographically.\n\nCasablanca is Morocco's chief port and one of the largest financial centers on the continent. According to the 2014 population estimate, the city has a population of about 3.35 million in the urban area and over 6.8 million in the Casablanca-Settat region. Casablanca is considered the economic and business center of Morocco, although the national political capital is Rabat.\n\nThe leading Moroccan companies and international corporations doing business in the country have their headquarters and main industrial facilities in Casablanca. Recent industrial statistics show Casablanca retains its historical position as the main industrial zone of the country. The Port of Casablanca is one of the largest artificial ports in the world, and the second largest port of North Africa, after Tanger-Med 40 km east of Tangier. Casablanca also hosts the primary naval base for the Royal Moroccan Navy.\n\nEtymology \n\nThe original name of Casablanca was Anfa, in Berber language, by at least the seventh century BC. After the Portuguese took control of the city in the 15th century AD, they rebuilt it, changing the name to Casa Branca. It derives from the Portuguese word combination meaning \"White House\" (' \"white\", ' \"house\"). The present name, which is the Spanish version, came when the Portuguese kingdom was integrated in personal union to the Spanish kingdom. During the French protectorate in Morocco, the name remained Casablanca. In 1755 an earthquake destroyed most of the town. It was rebuilt by the Sultan who changed the name into the local Arabic which is Ad-dar Al Baidaa, although Arabic also has its own version of Casablanca (كازابلانكا, Kāzāblānkā). The city is still nicknamed Casa by many locals and outsiders to the city. In many other cities with a different dialect, it is called Ad-dar Al-Bida, instead.\n\nA famous boulevard inside Casablanca City is called \"Anfa Boulevard\". Anfa is generally considered the early \"old original city\" of Casablanca; it is legally a prefecture (district) with half a million city inhabitants.\n\nHistory \n\nEarly history \n\nThe area which is today Casablanca was founded and settled by Berbers by at least the seventh century BC. It was used as a port by the Phoenicians and later the Romans. In his book Description of Africa, Leo Africanus refers to ancient Casablanca as \"Anfa\", a great city founded in the Berber kingdom of Barghawata in 744 AD. He believed Anfa was the most \"prosperous city on the Atlantic Coast because of its fertile land.\" Barghawata rose as an independent state around this time, and continued until it was conquered by the Almoravids in 1068. Following the defeat of the Barghawata in the 12th century, Arab tribes of Hilal and Sulaym descent settled in the region, mixing with the local Berbers, which led to widespread Arabization.S. Lévy, Pour une histoire linguistique du Maroc, in Peuplement et arabisation au Maghreb occidental: dialectologie et histoire, 1998, pp.11-26 () During the 14th century, under the Merinids, Anfa rose in importance as a port. The last of the Merinids were ousted by a popular revolt in 1465.\n\nPortuguese conquest and Spanish influence \n\nIn the early 15th century, the town became an independent state once again, and emerged as a safe harbour for pirates and privateers, leading to it being targeted by the Portuguese, who bombarded the town which led to its destruction in 1468. The Portuguese used the ruins of Anfa to build a military fortress in 1515. The town that grew up around it was called Casa Branca, meaning \"white house\" in Portuguese.\n\nBetween 1580 and 1640, the Crown of Portugal was integrated to the Crown of Spain, so Casablanca and all other areas occupied by the Portuguese were under Spanish control, though maintaining an autonomous Portuguese administration. As Portugal broke ties with Spain in 1640, Casablanca came under fully Portuguese control once again. The Europeans eventually abandoned the area completely in 1755 following an earthquake which destroyed most of the town.\n\nThe town was finally reconstructed by Sultan Mohammed ben Abdallah (1756–1790), the grandson of Moulay Ismail and an ally of George Washington, with the help of Spaniards from the nearby emporium. The town was called الدار البيضاء ad-Dār al-Bayḍāʼ, the Arabic translation of the Spanish Casa Blanca.\n\nFrench conquest \n\nIn the 19th century, the area's population began to grow as it became a major supplier of wool to the booming textile industry in Britain and shipping traffic increased (the British, in return, began importing gunpowder tea, used in Morocco's national drink, mint tea). By the 1860s, around 5,000 residents were there, and the population grew to around 10,000 by the late 1880s.Pennel, CR: Morocco from Empire to Independence, Oneworld, Oxford, 2003, p 121 Casablanca remained a modestly sized port, with a population reaching around 12,000 within a few years of the French conquest and arrival of French colonialists in the town, at first administrators within a sovereign sultanate, in 1906. By 1921, this rose to 110,000,Pennel, CR: Morocco from Empire to Independence, Oneworld, Oxford, 2003, p 149. largely through the development of shanty towns.\n\nFrench rule and influence \n\nIn June 1907, the French attempted to build a light railway near the port and passing through a graveyard. As an act of resistance and protestation, the locals attacked the French, riots ensued, causing a few soldiers to be wounded and one general to be killed. In response, the French attacked by ship, bombarding the city from the coast, and landing troops inside the town, which caused severe damage to the town and 15,000 dead and wounded bodies. The French claimed that it was to restore order there. This effectively began the process of colonization, although French control of Casablanca was not formalised until 1910. Under the French rule, Muslim anti-Jewish riots occurred in 1908.\n\nThe famous 1942 film Casablanca (starring Humphrey Bogart) underlined the city's colonial status at the time—depicting it as the scene of a power struggle between competing European powers. The film has a cosmopolitan cast of characters (American, French, German, Spaniard, Czech, Norwegian, Austrian, Bulgarian, Russian, and some other nationalities).\n\nEuropeans formed almost half the population.Albert Habib Hourani, Malise Ruthven (2002). \"[https://books.google.com/books?id\negbOb0mewz4C&pgPA323&dq&hl\nen#vonepage&q\n&f=false A history of the Arab peoples]\". Harvard University Press. p.323.  During the 1940s and 1950s, Casablanca was a major centre of anti-French rioting. A bomb attack on 25 December 1953 (Christmas Day) caused 16 deaths.\n\nWorld War II \n\nOperation Torch (initially called Operation Gymnast) was the British-American invasion of French North Africa during the North African campaign of World War II, which started on 8 November 1942.\n\nThe Americans attacked at three different locations in French North Africa, one of the three being the landings at Casablanca because of its important port and the major administrative centres.\n\nCasablanca was an important strategic port during World War II and hosted the Casablanca Conference in 1943, in which Churchill and Roosevelt discussed the progress of the war. Casablanca was the site of a large American air base, which was the staging area for all American aircraft for the European Theater of Operations during World War II.\n\nSince independence \n\nIn October 1930, Casablanca hosted a Grand Prix, held at the new Anfa Racecourse. In 1958, the race was held at Ain-Diab circuit (see Moroccan Grand Prix). Morocco gained independence from France on 2 March 1956. In 1983, Casablanca hosted the Mediterranean Games. The city is now developing a tourism industry. Casablanca has become the economic and business capital of Morocco, while Rabat is the political capital.\n\nIn March 2000, more than 60 women's groups organized demonstrations in Casablanca proposing reforms to the legal status of women in the country. About 40,000 women attended, calling for a ban on polygamy and the introduction of divorce law (divorce being a purely religious procedure at that time). Although the counter-demonstration attracted half a million participants, the movement for change started in 2000 was influential on King Mohammed VI, and he enacted a new mudawana, or family law, in early 2004, meeting some of the demands of women's rights activists.\n\nOn 16 May 2003, 33 civilians were killed and more than 100 people were injured when Casablanca was hit by a multiple suicide bomb attack carried out by Moroccans and claimed by some to have been linked to al-Qaeda. Twelve suicide bombers struck five locations in the city.\n\nA string of suicide bombings struck the city in early 2007. A suspected militant blew himself up at a Casablanca internet café on 11 March 2007. On 10 April, three suicide bombers blew themselves up during a police raid of their safe house. Two days later, police set up barricades around the city and detained two more men who had escaped the raid. On 14 April, two brothers blew themselves up in downtown Casablanca, one near the American Consulate, and one a few blocks away near the American Language Center. Only one person was injured aside from the bombers, but the Consulate was closed for more than a month.\n\nAs calls for reform spread through the Arab world in 2011, Moroccans joined in, but concessions by the ruler led to acceptance. However, in December, thousands of people demonstrated in several parts of the city, especially the city center near la Fontaine, desiring more significant political reforms.\n\nGeography \n\nCasablanca is located in the Chawiya Plain which has historically been the breadbasket of Morocco. Apart from the Atlantic coast, the Bouskoura forest is the only natural attraction in the city. The forest was planted in the 20th century and consists mostly of eucalyptus, palm, and pine trees. It is located halfway to the city's international airport.\n\nThe only watercourse in Casablanca is oued Bouskoura, a small seasonal creek that until 1912 reached the Atlantic Ocean near the actual port. Most of oued Bouskoura's bed has been covered due to urbanization and only the part south of El Jadida road can now be seen. The closest permanent river to Casablanca is Oum Rabia, 70 km to the south-east.\n\nClimate\n\nCasablanca has a warm summer Mediterranean climate (Köppen climate classification Csa). The cool Canary Current off the Atlantic coast moderates temperature variation, which results in a climate remarkably similar to that of coastal Los Angeles, with similar temperature ranges. The city has an annual average of 72 days with significant precipitation, which amounts to 412 mm per year. The highest and lowest temperatures ever recorded in the city are  and , respectively. The highest amount of rainfall recorded in a single day is 178 mm on 30 November 2010.\n\nEconomy \n\nThe Grand Casablanca region is considered the locomotive of the development of the Moroccan economy. It attracts 32% of the country's production units and 56% of industrial labor. The region uses 30% of the national electricity production. With MAD 93 billion, the region contributes to 44% of the industrial production of the kingdom. About 33% of national industrial exportations, MAD 27 billion, comes from the Grand Casablanca; 30% of the Moroccan banking network is concentrated in Casablanca.\n\nOne of the most important Casablancan exports is phosphate. Other industries include fishing, fish canning, sawmills, furniture production, building materials, glass, textiles, electronics, leather work, processed food, spirits, soft drinks, and cigarettes.\n\nThe Casablanca and Mohammedia seaports activity represent 50% of the international commercial flows of Morocco. Almost the entire Casablanca waterfront is under development, mainly the construction of huge entertainment centres between the port and Hassan II Mosque, the Anfa Resort project near the business, entertainment and living centre of Megarama, the shopping and entertainment complex of Morocco Mall, as well as a complete renovation of the coastal walkway. The Sindbad park is planned to be totally renewed with rides, games and entertainment services.\n\nRoyal Air Maroc has its head office at the Casablanca-Anfa Airport. In 2004, it announced that it was moving its head office from Casablanca to a location in Province of Nouaceur, close to Mohammed V International Airport.\"[http://www.accessmylibrary.com/coms2/summary_0286-22062524_ITM Royal Air Maroc.(Africa/Middle East)(Brief Article)].\" Air Transport World. 1 July 2004. Retrieved on 19 October 2009.  The agreement to build the head office in Nouaceur was signed in 2009.\"[http://www.leconomiste.com/article.html?a=53387 Casablanca: Nouaceur abritera le futur siège de la RAM].\" L'Économiste.  18 August 2009. Retrieved on 19 October 2009.\n\nThe biggest CBD of Casablanca and Maghreb is in the North of the town in Sidi Maarouf near the mosque of Hassan II and the biggest project of skycrapers of Maghreb and Africa Casablanca Marina.\n\nAdministrative divisions \n\nCasablanca is a commune, part of the region of Casablanca-Settat. The commune is divided into eight districts or prefectures, which are themselves divided into 16 subdivisions or arrondissements and one municipality. The districts and their subdivisions are:\n\n# Aïn Chock (عين الشق) – Aïn Chock (عين الشق)\n# Aïn Sebaâ - Hay Mohammadi (عين السبع الحي المحمدي) – Aïn Sebaâ (عين السبع), Hay Mohammadi (الحي المحمدي), Roches Noires (روش نوار).\n# Anfa (أنفا) – Anfa (أنفا), Maârif (المعاريف), Sidi Belyout (سيدي بليوط).\n# Ben M'Sick (بن مسيك) – Ben M'Sick (بن مسيك), Sbata (سباته).\n# Sidi Bernoussi (سيدي برنوصي) – Sidi Bernoussi (سيدي برنوصي), Sidi Moumen (سيدي مومن).\n# Al Fida - Mers Sultan (الفداء – مرس السلطان) – Al Fida (الفداء); Mechouar (المشور) (municipality), Mers Sultan (مرس السلطان).\n# Hay Hassani (الحي الحسني) – Hay Hassani (الحي الحسني).\n# Moulay Rachid (مولاي رشيد) – Moulay Rachid (مولاي رشيد), Sidi Othmane (سيدي عثمان).\n\nNeighborhoods \n\nThe list of neighborhoods is indicative and not complete:\n\n* 2 Mars\n* Ain Chock\n* Ain Diab\n* Ain Sebaa\n* Belvédère\n* Beausejour\n* Bouchentouf\n* Bourgogne\n* Californie\n* Centre Ville (downtown)\n* C.I.L.\n* Derb Ghalaf\n* Derb Sultan Al Fida\n* Derb TaZI\n* Al Hank\n* Hay Al Mohammadi\n* Ghandi\n* Gauthier\n* Habous\n* Hay Dakhla (\"Derb Lihoudi\")\n* Hay Farah\n* Hay El Hana\n* Hay Moulay Rachid\n* La Colline\n* Bouskoura\n* Laimoun (Hay Hassani)\n* Lissasfa\n* Maârif\n* Palmiers\n* Old Madina (Mdina Qdima)\n* Mers Sultan\n* Nassim\n* Oasis\n* Walfa\n* Polo\n* Racine\n* Riviera\n* Roches Noires\n* Salmia II\n* Sbata\n* Sidi Bernoussi\n* Sidi Maarouf\n* Sidi Moumen\n* Sidi Othman\n\nDemographics \n\nThe commune of Casablanca recorded a population of 3,359,818 in the 2014 Moroccan census. About 98% live in urban areas. Around 25% of them are under 15 and 9% are over 60 years old. The population of the city is about 11% of the total population of Morocco. Grand Casablanca is also the largest urban area in the Maghreb. 99.9% of the population of Morocco are Arab and Berber Muslims.\nDuring the French protectorate in Morocco, European Christians formed almost half the population. Later after the independence in 1956, the European population has decreased substantially.\n\nJudaism in Casablanca \n\nA Sephardic Jewish community was in Anfa up to the destruction of the city, by the Portuguese in 1468. Jews were slow to return to the town, but by 1750, the Rabbi Elijah Synagogue was built as the first Jewish synagogue in Casablanca. It was destroyed along with much of the town in the 1755 Lisbon earthquake. Today, the Jewish cemetery of Casablanca is one of the major cemeteries of the city.\nThe Moroccan Jewish Museum is a museum established in the city in 1997. It is the only museum devoted to Judaism in the Arab world (see also History of the Jews in Morocco).\n\nMain sites \n\nThe French period Ville Nouvelle (New Town) of Casablanca was designed by the French architect Henri Prost, and was a model of a new town at that time. The main streets radiate south and east from Place des Nations Unies, previously the main market of Anfa. Former administrative buildings and modern hotels populate the area. Their style is a combination of Hispano-Moorish and Art Deco.\n\nCasablanca is home to the Hassan II Mosque, designed by the French architect Michel Pinseau. It is situated on a promontory on the Atlantic Ocean. The mosque has room for 25,000 worshippers inside, and a further 80,000 can be accommodated in the mosque's courtyard. Its minaret is the world's tallest at 210 m. The mosque is also the largest in North Africa, and the third-largest in the world.\n\nWork on the mosque started in 1980, and was intended to be completed for the 60th birthday of the former Moroccan king, Hassan II, in 1989. However, the building was not inaugurated until 1993. Authorities spent an estimated $800 million in the construction of the building.\n\nThe Parc de la Ligue Arabe (formally called Lyautey) is the city's largest public park. On its edge is the Casablanca Cathedral (Cathédrale Sacré-Coeur). It is no longer in use for religious purposes, but it is open to visitors and a splendid example of Mauresque architecture. The Old Medina (the part of town antedating the French protectorate) attracts fewer tourists than the medinas of cities such as Fes and Marrakech. However, it has undergone some restoration in recent years. Included in this project have been the western walls of the medina, its skala, or bastion, and its colonial-period clock tower.\n\nA popular site among locals is the small island Marabout de Sidi Abderrahmane. It is possible to walk across to the rocky island at low tide. This outcrop contains the tomb of Sidi Abderrhamane Thaalibi, a Sufi from Baghdad and the founder of Algiers. He is considered a saint in Morocco. Because of this, many Moroccans make informal pilgrimages to this site \"to reflect on life and to seek religious enlightenment\". Some believe that the saint possessed magical powers, so his tomb still possesses these powers. People come and seek this magic to be cured. Non-Muslims may not enter the shrine.\n\nEducation\n\nColleges and universities\n\nPublic: University of Hassan II Casablanca\n\nPrivate:\n*Université Mundiapolis\n*Université Internationale de Casablanca\n\nPrimary and secondary schools\n\nInternational schools:\n* Belgium: École Belge de Casablanca\n* French:\n**Collège Anatole France\n**Lycée Lyautey\n**Groupe Scolaire Louis Massignon\n**Lycée La Résidence\n**Lycée Maïmonide (FR)\n**Lycée Léon l'Africain\n**École Normale Hébraïque\n* Italian: Scuola \"Enrico Mattei\"\n* Spanish: Instituto Español Juan Ramón Jiménez\n* American:\n** Casablanca American School\n** American Academy Casablanca\n** George Washington Academy\n\nSports \n\nHosting\n\nCasablanca staged the 1961 Pan Arab Games, the 1983 Mediterranean Games, and games during the 1988 Africa Cup of Nations. Morocco was scheduled to host the 2015 African Nations Cup, but decided to decline due to Ebola fears. Morocco was expelled and the tournament was held in Equatorial Guinea.\n\nVenues \n\n* Stade Larbi Zaouli\n* Stade Mohamed V\n* Stade Sidi Bernoussi\n* Complexe Al Amal de Casablanca\n\nThe Grand Stade de Casablanca is the proposed title of the planned football stadium to be built in the city. Once completed in 2014, it will be used mostly for football matches and will serve as the home of Raja Casablanca, Wydad Casablanca, and the Morocco national football team. The stadium was designed with a capacity of 80,000 spectators, making it one of the highest-capacity stadiums in Africa. Once completed, it will replace the Stade Mohamed V. The initial idea of the stadium was for the 2010 FIFA World Cup, for which Morocco lost their bid to South Africa. Nevertheless, the Moroccan government supported the decision to go ahead with the plans. It will be completed in 2014, ready for the 2015 Africa Cup of Nations.\n\nAssociation football \n\nCasablanca is home to two popular football clubs, Wydad Casablanca and Raja Casablanca. Raja's symbol is an eagle and Wydad's symbol is a goose. These two popular clubs have produced some of Morocco's best players, such as: Salaheddine Bassir, Abdelmajid Dolmy, Baddou Zaki, Aziz Bouderbala, and Noureddine Naybet. Other football teams on top of these two major teams  based in the city of Casablanca include Rachad Bernoussi, TAS de Casablanca, Majd Al Madina, and Racing Casablanca.\n\nTennis \n\nCasablanca hosts The Grand Prix Hassan II, a professional men's tennis tournament of the ATP tour. It first began in 1986, and is played on clay courts type at Complexe Al Amal.\n\nNotable winners of the Hassan II Grand-Prix are Thomas Muster in 1990, Hicham Arazi in 1997, Younes El Aynaoui in 2002, and Stanislas Wawrinka in 2010.\n\nTransport \n\nTram \n\nThe Casablanca tramway is the rapid transit tram system in Casablanca. The route is 31 km long, with 49 stops, and Y-shaped; further lines are planned.\n\nAir \n\nCasablanca's main airport is Mohammed V International Airport, Morocco's busiest airport. Regular domestic flights serve Marrakech, Rabat, Agadir, Oujda, Tangier, Al Hoceima, and Laayoune, as well as other cities.\n\nCasablanca is well-served by international flights to Europe, especially French and Spanish airports, and has regular connections to North American, Middle Eastern and sub-Saharan African destinations. New York City, Montreal, Paris, London and Dubai are important primary destinations.\n\nThe older, smaller Casablanca-Anfa Airport to the west of the city, served certain destinations including Damascus, and Tunis, and was largely closed to international civilian traffic in 2006. It has been closed and destroyed to build the \"Casablanca Finance City\", the new heart of the city of Casablanca. Casablanca Tit Mellil Airport is located in the nearby community of Tit Mellil.\n\nCoaches \n\nCTM coaches (intercity buses) and various private lines run services to most notable Moroccan towns, as well as a number of European cities. These run from the Gare Routière on Rue Léon l'Africain in downtown Casablanca.\n\nMetro \n\nSee also: Casablanca RER or Casablanca metro\n\nSince the 1970s, Casablanca had planned to build a metro system to offer some relief to the problems of traffic congestion and poor air quality. However, the city council voted to abandon the metro project in 2014 due to high costs, and decided to continue expanding the already operating tram system instead.\n\nTaxis \n\nRegistered taxis in Casablanca are coloured red and known as petit taxis (small taxis), or coloured white and known as grands taxis (big taxis). As is standard Moroccan practice, petits taxis, typically small-four door Dacia Logan, Peugeot 207, or similar cars, provide metered cab service in the central metropolitan areas. Grands taxis, generally older Mercedes-Benz sedans, provide shared mini-bus like service within the city on predefined routes, or shared intercity service. Grands taxis may also be hired for private service by the hour or day.\n\nTrains \n\nCasablanca is served by three principal railway stations run by the national rail service, the ONCF.\n\n is the main intercity station, from which trains run south to Marrakech or El Jadida and north to Mohammedia and Rabat, and then on either to Tangier or Meknes, Fes, Taza and Oujda/Nador. A dedicated airport shuttle service to Mohammed V International Airport also has its primary in-city stop at this station, for connections on to further destinations.\n\n serves primarily commuter trains such as the Train Navette Rapide (TNR or Aouita) operating on the Casablanca – Kenitra rail corridor, with some connecting trains running on to Gare de Casa-Voyageurs. The station provides a direct interchange between train and shipping services, and is located near several port-area hotels. It is the nearest station to the old town of Casablanca, and to the modern city centre, around the landmark Casablanca Twin Center. Casa-Port station is being rebuilt in a modern and enlarged configuration. During the construction, the station is still operational. From 2013, it will provide a close connection from the rail network to the city's new tram network.\n\nCasa-Oasis was originally a suburban commuter station which was fully redesigned and rebuilt in the early 21st century, and officially reopened in 2005 as a primary city rail station. Owing to its new status, all southern intercity train services to and from Casa-Voyageurs now call at Casa-Oasis. ONCF stated in 2005 that the refurbishment and upgrading of Casa-Oasis to intercity standards was intended to relieve passenger congestion at Casa-Voyageurs station.\n\nNotable people \n\n* Salaheddine Bassir – Moroccan footballer\n* Larbi Benbarek – Moroccan footballer\n* Frida Boccara – French singer, Winner of the Eurovision Song Contest 1969\n* Soufiane Choubani – Founder of the Moroccan National Debate Team\n* French Montana - Moroccan-American rapper\n* La Fouine - Moroccan-French rapper\n* El Haqed - Moroccan rapper\n* Dizzy DROS - Moroccan rapper\n* Jean-Paul Bertrand-Demanes – French footballer\n* Jean-Charles de Castelbajac – French fashion designer\n* Merieme Chadid – Moroccan astronomer\n* Serge Haroche –  French physicist who was awarded the 2012 Nobel Prize for Physics\n* Shatha Hassoun – Moroccan/Iraqi singer\n* Lydia Hatuel-Czuckermann - Israeli Olympic fencer\n* Hicham Mesbahi – Moroccan boxer\n* Nawal El Moutawakel – Olympic champion\n* Noureddine Naybet – Moroccan footballer\n* Mostafa Nissaboury – Moroccan poet\n* Hakim Noury – Moroccan film director\n* Maurice Ohana – French composer\n* Jean Reno – French Hollywood actor\n* Daniel Sivan – professor\n* Alain Souchon – French songwriter\n* Frank Stephenson – award-winning automobile designer.\n* Hassan Saada - Moroccan boxer arrested for alleged rape before Olympic match\n* Sidney Taurel – Naturalized American CEO of Eli Lilly and Company from 1998 to 2008\n* Richard Virenque – French cyclist\n* Abdallah Zrika – Moroccan poet\n\nIn popular culture \n\n* Casablanca is the setting of the 1942 film of the same name starring Humphrey Bogart and Ingrid Bergman. The film has achieved worldwide popularity since then. Nominated for eight Academy Awards, it won three, including Best Picture.\n* A Night in Casablanca (1946) was the 12th Marx Brothers' movie. The film stars Groucho Marx, Chico Marx, and Harpo Marx. It was directed by Archie Mayo and written by Joseph Fields and Roland Kibbee. The film contains the song \"Who's Sorry Now?\", with music by Ted Snyder and lyrics by Bert Kalmar and Harry Ruby. It is sung in French by Lisette Verea playing the part of Beatrice Rheiner, and then later sung in English. Liszt's \"Hungarian Rhapsody No. 2\" is played twice, once by Chico on piano as an introduction to the \"Beer Barrel Polka\", and again by Harpo on the harp.\n* The city is featured in The Mysterious Caravan (1975), volume 54 in the original Hardy Boys series.\n* Casablanca is the setting for several chapters in Doubleshot, a 2000 James Bond novel by Raymond Benson. In the novel, one of the characters mentions that the 1942 film was shot in Hollywood and not on location.\n* Casablanca is one of the key locations in the 2006 video game Dreamfall, as it is where the primary protagonist of the game, Zoë Castillo, lives. Although the city is imagined in the year 2219, much of the present-day architecture is used for inspiration.\n* Casablanca is the setting for the first act of the 2016 World War II romantic thriller film Allied starring Brad Pitt and Marion Cotillard.\n\nInternational relations \n\nSee also List of twin towns and sister cities in Morocco\n\nTwin towns – sister cities \n\nCasablanca is twinned with:. Casablanca. http://en.wikipedia.org/?curid=7301."
  }
}
