{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11479",
  "eid" : "fbf33830-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778502451,
  "textBody" : "Frederik Willem de Klerk DMS (; born 18 March 1936) is a South African politician who served as State President of South Africa from 1989 to 1994 and as Deputy President from 1994 to 1996. South Africa's last head of state from the era of white-minority rule, his government focused on dismantling the apartheid system and introducing universal suffrage. Ideologically a conservative and an economic liberal, he led the National Party from 1989 to 1997.\n\nBorn in Johannesburg, British South Africa, to an influential Afrikaner family, de Klerk joined the Broederbond while at university. Joining the National Party, to which he had family ties, he became a politician and sat in the white-only government of P. W. Botha, holding a succession of ministerial posts and enforcing apartheid, a system of racial segregation that privileged whites. After Botha succumbed to ill health, in 1989 de Klerk replaced him, first as leader of the National Party and then as State President. Although observers expected him to continue Botha's defence of apartheid, de Klerk decided to end the policy. He was aware that growing ethnic animosity and violence was leading South Africa into a racial civil war. Amid this violence, his security forces committed widespread human rights abuses and encouraged violence between Xhosa and Zulu, although de Klerk denied knowledge of such actions. He permitted anti-apartheid marches to take place, legalised a range of previously banned anti-apartheid political parties, and freed imprisoned anti-apartheid activists, including Nelson Mandela. He also dismantled South Africa's nuclear weapons program.\n\nDe Klerk negotiated with Mandela to fully dismantle apartheid and establish a transition to universal suffrage. In 1993, he publicly apologised for apartheid's harmful effects, although not for apartheid itself. He oversaw the 1994 multi-racial election in which Mandela led the African National Congress (ANC) to victory; the National Party took second place with 20% of the total vote. After the election, de Klerk became a Deputy President in Mandela's ANC-led coalition government. In this position, he supported the government's liberal economic policies. De Klerk had desired a total amnesty for political crimes committed under apartheid and opposed the Truth and Reconciliation Commission set up to investigate past human rights abuses by both pro and anti-apartheid groups. His working relationship with Mandela was strained, although he later spoke fondly of him. In May 1996, after the National Party objected to the new constitution, de Klerk withdrew it from the coalition government; the party disbanded the following year and reformed as the New National Party. In 1997, he retired from active politics and since has lectured internationally.\n\nDe Klerk is a controversial figure. His role in dismantling apartheid and introducing universal suffrage to South Africa brought him international recognition and praise, including the Félix Houphouët-Boigny Peace Prize in 1991, the Prince of Asturias Award in 1992 and the Nobel Peace Prize in 1993. Conversely, it resulted in many on the white far-right accusing him of being a race traitor. Anti-apartheid figures criticised him for offering only a qualified apology for apartheid and for ignoring the human rights abuses carried out by his security forces.\n\nEarly life and education\n\nThe name \"De Klerk\" is derived from Le Clerc, Le Clercq and De Clercq, and is of French Huguenot origin (meaning \"clergyman\" or \"literate\" in old French). De Klerk noted that he is also of Dutch descent, with an Indian ancestor from the late 1600s or early 1700s. He is also said to be descended from the Khoi interpreter known as Krotoa or Eva.\n\nDe Klerk was born in Johannesburg, in the then Transvaal Province of South Africa, to Johannes \"Jan\" de Klerk and Hendrina Cornelia Coetzer – \"her forefather was a Kutzer who stems from Austria\".[http://www.sahistory.org.za/people/johannes-jan-de-klerk Johannes (Jan) de Klerk | South African History Online] A. Kamsteeg, E. Van Dijk, F.W. de Klerk, man of the moment. 1990 De Klerk graduated from Monument High School in Krugersdorp. De Klerk graduated in 1958 from the Potchefstroom University with BA and LL.B degrees (the latter cum laude). Following graduation, de Klerk practised law in Vereeniging in the Transvaal. In 1959 he married Marike Willemse, with whom he had two sons and a daughter.Abrams, Irwin, Nobelstiftelsen. Peace 1991–1995, 1999. Page 71.\n\nHe was brought up in the Gereformeerde Kerk, the smallest and most socially conservative of South Africa's three Dutch Reformed Churches.\nDe Klerk's family had longstanding affiliations with South Africa's National Party. His uncle, J. G. Strijdom, was a former Prime Minister.\nHe came from a family environment in which the conservatism of traditional white South African politics was deeply ingrained. His paternal great-grandfather was Senator Johannes Cornelis \"Jan\" van Rooy.J. Ball, F.W. de Klerk: the man in his time. 1991 In 1948, the year when the NP swept to power in whites-only elections on an apartheid platform, F. W. de Klerk's father, Johannes \"Jan\" de Klerk, became secretary of the NP in the Transvaal province and later rose to the positions of cabinet minister and President of the Senate, becoming interim State President in 1975.Johnson, Anthony. \"Frederik Willem de Klerk: a conservative revolutionary.\" UNESCO Courier (November 1995): 22(2). Expanded Academic ASAP. Thomson Gale. Brandeis University. 12 March 2007. Thomson Gale Document Number:A17963676 His brother, Willem, was a political analyst who later was a founder of the Democratic Party.\n\nDe Klerk went to study law at Potchefstroom University, graduating with honors.\nAt university, he was initiated into the Broederbond, a secret society for the Afrikaner social elite.\n\n\"F. W.\", pronounced \"eff-veer\", as he became popularly known, was first elected to the House of Assembly in 1969 as the member for Vereeniging, and entered the cabinet in 1978. De Klerk had been offered a professorship of administrative law at Potchefstroom in 1972 but he declined the post because he was serving in Parliament. In 1978, he was appointed Minister of Posts and Telecommunications and Social Welfare and Pensions by Prime Minister Vorster.\n\nUnder Prime Minister and later State President P. W. Botha, he held a succession of ministerial posts, including:\n* Posts and Telecommunications and Sports and Recreation (1978–1979)\n* Mines, Energy and Environmental Planning (1979–1980)\n* Mineral and Energy Affairs (1980–1982)\n* Internal Affairs (1982–1985)\n* National Education and Planning (1984–1989)\n\nIn 1972, his alma mater offered him a chair in its law faculty. In 1976, he was in the United States where he observed what he saw as the pervasive racism of US society, later noting that he \"saw more racial incidents in one month there than in South Africa in a year\".\n\nHe became Transvaal provincial National Party leader in 1982 and chairman of the Minister's Council in the House of Assembly in 1985. As education minister between 1984 and 1989 he upheld the apartheid system in South Africa's schools.\n\nFor most of his career, de Klerk had a very conservative reputation.  The NP's Transvaal branch was historically the most staunchly conservative wing of the party, and he supported continued segregation of universities while Minister of National Education. It thus came as a surprise when in 1989 he placed himself at the head of verligte (\"enlightened\") forces within the governing party which had come to believe that apartheid could not be maintained forever.  This wing favoured beginning negotiations while there was still time to get reasonable terms.\n\nState President\n\nP. W. Botha resigned as leader of the National Party after an apparent stroke, and de Klerk defeated Botha's preferred successor, finance minister Barend du Plessis, in the race to succeed him. On 2 February 1989, he was elected leader of the National Party. Soon after, he called for the introduction of a new South African constitution, hinting that it would need to provide greater concession to non-white racial groups. After becoming party leader, de Klerk extended his foreign contacts. He travelled to London, where he met with British Prime Minister Margaret Thatcher. Although she opposed the anti-apartheid movement's calls for economic sanctions against South Africa, at the meeting she urged de Klerk to release the imprisoned anti-apartheid activist Nelson Mandela. He also expressed a desire to meet with representatives of the U.S. government in Washington D.C., although the politician James Baker informed him that the U.S. government considered it inopportune to have de Klerk meet with President George H. W. Bush.\n\nBecoming State President\n\nBotha resigned on 14 August, and De Klerk was named acting state president until 20 September, when he was elected to a full five-year term as state president.  After he became acting president, ANC leaders spoke out against him, believing that he would be no different from his predecessors. The prominent anti-apartheid activist Desmond Tutu shared this assessment, stating: \"I don't think we've got to even begin to pretend that there is any reason for thinking that we are entering a new phase. It's just musical chairs\". Tutu and Allan Boesak had been planning a protest march in Cape Town, which the security chiefs wanted to prevent. De Klerk nevertheless turned down their proposal to ban it, agreeing to let the march proceed and stating that \"the door to a new South Africa is open, it is not necessary to batter it down\". The march took place and was attended by approximately 30,000 people. Further protest marches followed in Grahamstown, Johannesburg, Pretoria, and Durban. De Klerk later noted that his security forces could not have prevented the marchers from gathering: \"The choice, therefore, was between breaking up an illegal march with all of the attendant risks of violence and negative publicity, or of allowing the march to continue, subject to conditions that could help to avoid violence and ensure good public order.\" This decision marked a clear departure from the approach of the Botha era.\n\nAs President, he authorised the continuation of secret talks in Geneva between his National Intelligence Service and two exiled ANC leaders, Thabo Mbeki and Jacob Zuma. In October, he personally agreed to meet with Tutu, Boesak, and Frank Chikane in a private meeting in Pretoria. That month, he also released a number of elderly anti-apartheid activists then imprisoned, including Walter Sisulu. He also ordered the closure of the National Security Management System.\nIn December he visited Mandela in prison, speaking with him for three hours about the idea of transitioning away from white-minority rule.\n\nOn 2 February 1990 he gave an address to the country's parliament in which he announced plans for sweeping reforms of the political system. He announced that a number of banned political parties, including the ANC and Communist Party of South Africa, would be legalised. He also announced that the Separate Amenities Act of 1953, which governed the segregation of public facilities, would be lifted. He declared that Mandela would be released from prison unconditionally; the latter was released a week later. he later related that \"that speech was mainly aimed at breaking our stalemate in Africa and the West. Internationally we were teetering on the edge of the abyss.\" Throughout South Africa and across the world, there was astonishment at de Klerk's move. Tutu said that \"It's incredible... Give him credit. Give him credit, I do.\"\n\nFurther reforms followed; membership of the National Party was opened up to non-whites. In June, parliament approved new legislation that repealed the Natives Land Act, 1913 and Native Trust and Land Act, 1936. The Population Registration Act, which established the racial classificatory guidelines for South Africa, was rescinded.\n\nIn legislative terms, he enabled the gradual end of apartheid. De Klerk also opened the way for the negotiations of the government with the anti-apartheid-opposition about a new constitution for the country. Nevertheless, he was accused by Anthony Sampson of complicity in the violence among the ANC, the Inkatha Freedom Party and elements of the security forces. In Mandela: The Authorised Biography, Sampson accuses de Klerk of permitting his ministers to build their own criminal empires.\n\nHis presidency was dominated by the negotiation process, mainly between his NP government and the ANC, which led to the democratization of South Africa. In 1992, de Klerk held a whites-only referendum on ending apartheid, with the result being an overwhelming \"yes\" vote to continue negotiations to end apartheid. Nelson Mandela was distrustful of the role played by de Klerk in the negotiations, particularly as he believed that de Klerk was knowledgeable about 'third force' attempts to foment violence in the country and destabilize the negotiations.\n\nIn 1990, de Klerk gave orders to end South Africa's nuclear weapons programme; the process of nuclear disarmament was essentially completed in 1991. The existence of the programme was not officially acknowledged before 1993.Von Wielligh, N. & von Wielligh-Steyn, L. (2015). The Bomb – South Africa’s Nuclear Weapons Programme. Pretoria: Litera.\n\nIn 1993, De Klerk and Mandela were jointly awarded the Nobel Peace Prize for their work in ending apartheid. The awarding of the prize to de Klerk was controversial, especially in the light of de Klerk's reported admission that he ordered a massacre of supposed Azanian Peoples' Liberation Army fighters, including teenagers, shortly before going to Oslo in 1993. It appears that this massacre may form part of the basis for criminal charges that the Anti-Racism Action Forum laid against de Klerk in early 2016. Further, de Klerk's role in the destabilization of the country during the negotiation process through the operation of a 'third force' came to the attention of the Truth and Reconciliation Commission, and was never ultimately clarified.\n\nAfter the first universal elections in 1994, de Klerk became deputy president in the government of national unity under Nelson Mandela, a post he kept until 1996. In 1997 he resigned the leadership of the National Party and retired from politics.\n\nIn 1993, de Klerk issued an apology for the actions of the apartheid government, stating that: \"It was not our intention to deprive people of their rights and to cause misery, but eventually apartheid led to just that. Insofar as that occurred we deeply regret it... Yes we are sorry\". Tutu urged for people to accept the apology, stating that \"saying sorry is not an easy thing to do... We should be magnanimous and accept it as a magnanimous act\", although was privately frustrated that de Klerk's apology had been qualified and had not gone so far as to call apartheid an intrinsically evil policy.\n\nVice Presidency\n\nDe Klerk had been unhappy that changes had been made to the inauguration ceremony, rendering it multi-religious rather than reflecting the newly elected leader's particular denomination. When he was being sworn in, and the chief justice said \"So help me God\", de Klerk did not repeat this, instead stating, in Afrikaans: \"So help me the triune God, Father, Son, and Holy Spirit\".\n\nMandela reappointed de Klerk's finance minister, Derek Keys, and retained Chris Stals, a former member of the Broederbond, as the head of the Central Bank.\nDe Klerk supported the coalition's economic policies, stating that it \"accepted a broad framework of responsible economic policies\".\n\nDe Klerk's working relationship with Mandela was often strained, with the former finding it difficult adjusting to the fact that he was no longer president. De Klerk also felt that Mandela deliberately humiliated him, while Mandela found de Klerk to be needlessly provocative in cabinet. One dispute occurred in September 1995, after Mandela gave a Johannesburg speech criticising the National Party. Angered, de Klerk avoided Mandela until the latter requested they meet; when they ran into each other, they publicly argued in the street. Mandela later expressed regret for their disagreement but did not apologise for his original comments.\nDe Klerk was also having problems from within his own party, some of whose members claimed that he was neglecting the party while in the government.\n\nMany in the National Party—including many members of its executive committee—were unhappy with the other parties agreed upon a new constitution in May 1996. The party had wanted the constitution to guarantee that it would be represented in the government until 2004, although it did not do this.\nOn 9 May, de Klerk announced that the National Party would withdraw from the coalition government. The decision shocked several of his six fellow Afrikaner cabinet colleagues; Pik Botha, for example, was left without a job as a result. Roelf Meyer reported feeling betrayed by de Klerk's act, while Leon Wessels thought that de Klerk had not tried hard enough to make the coalition work. De Klerk announced that he would lead the National Party in vigorous opposition to Mandela's government, stating that he wanted to ensure \"a proper multi-party democracy, without which there may be a danger of South Africa lapsing into the African pattern of one-party states\".\n\nTruth and Reconciliation Commission\n\nIn de Klerk's view, his greatest defeat in the negotiations with Mandela had been his inability to secure a blanket amnesty for all those working for the government or state during the apartheid period. \nDe Klerk was unhappy with the formation of the Truth and Reconciliation Commission (TRC). He had hoped that the TRC would be made up of an equal number of individuals from both the old and new governments, as there had been in the Chilean human rights commission. Instead, the TRC was designed to broadly reflect the wider diversity of South African society, and contained only two members who had explicitly supported apartheid, one a member of a right-wing group that had opposed de Klerk's National Party. De Klerk did not object to Tutu being selected as the TRC's chair for he regarded him as politically independent of Mandela's government, but he was upset that Alex Boraine had been selected as its deputy chair, later saying of Boraine: \"beneath an urbane and deceptively affable exterior beat the heart of a zealot and an inquisitor.\"\n\nDe Klerk appeared before the TRC hearing to testify for Vlakplaas commanders who were accused of having committed human rights abuses during the apartheid era. He acknowledged that security forces had resorted to \"unconventional strategies\" in dealing with anti-apartheid revolutionaries, but that \"within my knowledge and experience, they never included the authorisation of assassination, murder, torture, rape, assault or the like\". After further evidence of said abuses was produced by the commission, de Klerk stated that he found the revelations to be \"as shocking and as abhorrent as anybody else\" but insisted that he and other senior party members were not willing to accept responsibility for the \"criminal actions of a handful of operatives\", stating that their behaviour was \"not authorised [and] not intended\" by his government. Given the widespread and systemic nature of the abuses that had taken place, as well as statements by security officers that their actions had been sanctioned by higher ranking figures, Tutu questioned how de Klerk and other government figures could not have been aware of them. Tutu had hoped that de Klerk or another senior white political figure from the apartheid era would openly accept responsibility for the human rights abuses, thereby allowing South Africa to move on; this was something that de Klerk would not do.\n\nThe TRC found de Klerk guilty of being an accessory to gross violations of human rights on the basis that as State President he had been told that P. W. Botha had authorised the bombing of Khotso House but had not revealed this information to the Committee. De Klerk challenged the TRC on this point, and it backed down. When the final TRC report was released 2002, it made a more limited accusation: that de Klerk had failed to give full disclosure about events that took place during his Presidency and that in view of his knowledge about the Khotso House bombing, his statement that none of his colleagues had authorised gross human rights abuses was \"indefensible\".\nIn his later autobiography, de Klerk acknowledged that the TRC did significant damage to his public image.\n\nLater life\n\nIn 1996, de Klerk was offered the Harper Fellowship at Yale Law School. He declined, citing protests at the university.Gold, Emily. (28 March 1997). [http://www.yaleherald.com/archive/xxiii/3.28.97/news/ethical.html Ethical controversy forces de Klerk to decline honor] . Yale Herald, 23. Retrieved 29 May 2012. De Klerk did, however, speak at Central Connecticut State University the day before his fellowship would have begun.\n \n\nIn 1998, de Klerk and his wife of 38 years, Marike de Klerk, were divorced following the discovery of his affair with Elita Georgiades, then the wife of Tony Georgiades, a Greek shipping tycoon who had allegedly given de Klerk and the NP financial support. Soon after his divorce, de Klerk and Georgiades were married. His divorce and remarriage scandalised conservative South African opinion, especially among the Calvinist Afrikaners. In 1999, his autobiography, The Last Trek – A New Beginning, was published. In 2001, following the murder of his former wife, the manuscript of her own autobiography, A Place Where the Sun Shines Again, was submitted to de Klerk, who urged the publishers to suppress a chapter dealing with his infidelity.\n\nIn 1999, de Klerk established the pro-peace FW de Klerk Foundation of which he is the chairman. De Klerk is also chairman of the Global Leadership Foundation, headquartered in London, which he set up in 2004, an organisation which works to support democratic leadership, prevent and resolve conflict through mediation and promote good governance in the form of democratic institutions, open markets, human rights and the rule of law. It does so by making available, discreetly and in confidence, the experience of former leaders to today's national leaders. It is a not-for-profit organisation composed of former heads of government and senior governmental and international organisation officials who work closely with heads of government on governance-related issues of concern to them.\n\nOn 3 December 2001, Marike de Klerk was found stabbed and strangled to death in her Cape Town flat. De Klerk, who was on a brief visit to Stockholm, Sweden, to celebrate the 100-year anniversary of the Nobel Prize foundation, announced he would immediately return to mourn his dead ex-wife. The atrocity was reportedly condemned strongly by South African president Thabo Mbeki and Winnie Mandela, among others, who openly spoke in favour of Marike de Klerk. On 6 December 21-year-old security guard Luyanda Mboniswa was arrested for the murder. On 15 May 2003, he received two life sentences for murder, as well as three years for breaking into Marike de Klerk's apartment.\n\nIn 2004, de Klerk announced that he was quitting the New National Party and seeking a new political home after it was announced that the NNP would merge with the ruling ANC. That same year, while giving an interview to US journalist Richard Stengel, de Klerk was asked whether South Africa had turned out the way he envisioned it back in 1990. His response was:\n\nThere are a number of imperfections in the new South Africa where I would have hoped that things would be better, but on balance I think we have basically achieved what we set out to achieve. And if I were to draw balance sheets on where South Africa stands now, I would say that the positive outweighs the negative by far. There is a tendency by commentators across the world to focus on the few negatives which are quite negative, like how are we handling AIDS, like our role vis-à-vis Zimbabwe. But the positives – the stability in South Africa, the adherence to well-balanced economic policies, fighting inflation, doing all the right things in order to lay the basis and the foundation for sustained economic growth – are in place.\n\nIn 2008, he repeated in a speech that \"despite all the negatives facing South Africa, he is very positive about the country\".\n\nIn 2006, he underwent surgery for a malignant tumour in his colon, discovered after an examination on 3 June. His condition deteriorated sharply, and he underwent a second operation after developing respiratory problems. On 13 June, it was announced that he was to undergo a tracheotomy. He recovered and on 11 September 2006 gave a speech at Kent State University Stark Campus.[http://www.cnn.com/2006/WORLD/africa/12/21/btsc.koinange.deklerk/index.html de Klerk] , CNN World Africa, 21 December 2006.\n\nIn January 2007, de Klerk was a speaker promoting peace and democracy in the world at the \"Towards a Global Forum on New Democracies\" event in Taipei, Taiwan, along with other dignitaries including Poland's Lech Wałęsa and Taiwan's then president Chen Shui-Bian.\n\nDe Klerk is an Honorary Patron of the University Philosophical Society of Trinity College, Dublin, and Honorary Chairman of the Prague Society for International Cooperation. He has also received the Gold Medal for Outstanding Contribution to Public Discourse from the College Historical Society of Trinity College, Dublin, for his contribution to ending apartheid.\n\nDe Klerk is also a Member of the Advisory Board of the Global Panel Foundation based in Berlin, Copenhagen, New York, Prague, Sydney and Toronto – founded by the Dutch entrepreneur Bas Spuybroek in 1988, with the support of Dutch billionaire Frans Lurvink and former Dutch Foreign Minister Hans van den Broek. The Global Panel Foundation is known for its behind-the-scenes work in public policy and the annual presentation of the Hanno R. Ellenbogen Citizenship Award with the Prague Society for International Cooperation.\n\nAfter the inauguration of Jacob Zuma as South Africa's president in May 2009, de Klerk said he is optimistic that Zuma and his government can \"confound the prophets of doom\".\n\nIn a BBC interview broadcast in April 2012, he said he lived in an all-white neighbourhood. He had five servants, three coloured and two black: \"We are one great big family together; we have the best of relationships.\" About Nelson Mandela, he said, \"When Mandela goes it will be a moment when all South Africans put away their political differences, will take hands, and will together honour maybe the biggest known South African that has ever lived.\"Interview by Stephen Sackur on Hardtalk, broadcast on BBC World Service 18 & 19 April 2012.\n\nUpon hearing of the death of Mandela, de Klerk said: \"He was a great unifier and a very, very special man in this regard beyond everything else he did. This emphasis on reconciliation was his biggest legacy.\"\n\nIn 2015, de Klerk wrote to The Times newspaper in the UK criticising moves to remove a statue to Cecil Rhodes at Oriel College, Oxford. He was subsequently criticized by some activists who described it as \"ironic\" that the last apartheid President should be defending a statue of a man labelled by critics as the \"architect of apartheid\". The Economic Freedom Fighters called for him to be stripped of his Nobel Peace Prize.\n\nPersonality and personal life\n\nGlad and Blanton stated that de Klerk's \"political choices were undergirded by self-confidence and commitment to the common good.\" His brother Willem stated that de Klerk's demeanour was marked by \"soberness, humility and calm\".\nHis former wife Marike described de Klerk as being \"extremely sensitive to beautiful things\", exhibiting something akin to an artistic temperament.\n\nReception and legacy\n\nGlad and Blanton stated that de Klerk, along with Mandela, \"accomplished the rare feat of bringing about systemic revolution through peaceful means.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "F. W. de Klerk" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11479" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Frederik Willem de Klerk DMS (; born 18 March 1936) is a South African politician who served as State President of South Africa from 1989 to 1994 and as Deputy President from 1994 to 1996. South Africa's last head of state from the era of white-minority rule, his government focused on dismantling the apartheid system and introducing universal suffrage. Ideologically a conservative and an economic liberal, he led the National Party from 1989 to 1997.\n\nBorn in Johannesburg, British South Africa, to an influential Afrikaner family, de Klerk joined the Broederbond while at university. Joining the National Party, to which he had family ties, he became a politician and sat in the white-only government of P. W. Botha, holding a succession of ministerial posts and enforcing apartheid, a system of racial segregation that privileged whites. After Botha succumbed to ill health, in 1989 de Klerk replaced him, first as leader of the National Party and then as State President. Although observers expected him to continue Botha's defence of apartheid, de Klerk decided to end the policy. He was aware that growing ethnic animosity and violence was leading South Africa into a racial civil war. Amid this violence, his security forces committed widespread human rights abuses and encouraged violence between Xhosa and Zulu, although de Klerk denied knowledge of such actions. He permitted anti-apartheid marches to take place, legalised a range of previously banned anti-apartheid political parties, and freed imprisoned anti-apartheid activists, including Nelson Mandela. He also dismantled South Africa's nuclear weapons program.\n\nDe Klerk negotiated with Mandela to fully dismantle apartheid and establish a transition to universal suffrage. In 1993, he publicly apologised for apartheid's harmful effects, although not for apartheid itself. He oversaw the 1994 multi-racial election in which Mandela led the African National Congress (ANC) to victory; the National Party took second place with 20% of the total vote. After the election, de Klerk became a Deputy President in Mandela's ANC-led coalition government. In this position, he supported the government's liberal economic policies. De Klerk had desired a total amnesty for political crimes committed under apartheid and opposed the Truth and Reconciliation Commission set up to investigate past human rights abuses by both pro and anti-apartheid groups. His working relationship with Mandela was strained, although he later spoke fondly of him. In May 1996, after the National Party objected to the new constitution, de Klerk withdrew it from the coalition government; the party disbanded the following year and reformed as the New National Party. In 1997, he retired from active politics and since has lectured internationally.\n\nDe Klerk is a controversial figure. His role in dismantling apartheid and introducing universal suffrage to South Africa brought him international recognition and praise, including the Félix Houphouët-Boigny Peace Prize in 1991, the Prince of Asturias Award in 1992 and the Nobel Peace Prize in 1993. Conversely, it resulted in many on the white far-right accusing him of being a race traitor. Anti-apartheid figures criticised him for offering only a qualified apology for apartheid and for ignoring the human rights abuses carried out by his security forces.\n\nEarly life and education\n\nThe name \"De Klerk\" is derived from Le Clerc, Le Clercq and De Clercq, and is of French Huguenot origin (meaning \"clergyman\" or \"literate\" in old French). De Klerk noted that he is also of Dutch descent, with an Indian ancestor from the late 1600s or early 1700s. He is also said to be descended from the Khoi interpreter known as Krotoa or Eva.\n\nDe Klerk was born in Johannesburg, in the then Transvaal Province of South Africa, to Johannes \"Jan\" de Klerk and Hendrina Cornelia Coetzer – \"her forefather was a Kutzer who stems from Austria\".[http://www.sahistory.org.za/people/johannes-jan-de-klerk Johannes (Jan) de Klerk | South African History Online] A. Kamsteeg, E. Van Dijk, F.W. de Klerk, man of the moment. 1990 De Klerk graduated from Monument High School in Krugersdorp. De Klerk graduated in 1958 from the Potchefstroom University with BA and LL.B degrees (the latter cum laude). Following graduation, de Klerk practised law in Vereeniging in the Transvaal. In 1959 he married Marike Willemse, with whom he had two sons and a daughter.Abrams, Irwin, Nobelstiftelsen. Peace 1991–1995, 1999. Page 71.\n\nHe was brought up in the Gereformeerde Kerk, the smallest and most socially conservative of South Africa's three Dutch Reformed Churches.\nDe Klerk's family had longstanding affiliations with South Africa's National Party. His uncle, J. G. Strijdom, was a former Prime Minister.\nHe came from a family environment in which the conservatism of traditional white South African politics was deeply ingrained. His paternal great-grandfather was Senator Johannes Cornelis \"Jan\" van Rooy.J. Ball, F.W. de Klerk: the man in his time. 1991 In 1948, the year when the NP swept to power in whites-only elections on an apartheid platform, F. W. de Klerk's father, Johannes \"Jan\" de Klerk, became secretary of the NP in the Transvaal province and later rose to the positions of cabinet minister and President of the Senate, becoming interim State President in 1975.Johnson, Anthony. \"Frederik Willem de Klerk: a conservative revolutionary.\" UNESCO Courier (November 1995): 22(2). Expanded Academic ASAP. Thomson Gale. Brandeis University. 12 March 2007. Thomson Gale Document Number:A17963676 His brother, Willem, was a political analyst who later was a founder of the Democratic Party.\n\nDe Klerk went to study law at Potchefstroom University, graduating with honors.\nAt university, he was initiated into the Broederbond, a secret society for the Afrikaner social elite.\n\n\"F. W.\", pronounced \"eff-veer\", as he became popularly known, was first elected to the House of Assembly in 1969 as the member for Vereeniging, and entered the cabinet in 1978. De Klerk had been offered a professorship of administrative law at Potchefstroom in 1972 but he declined the post because he was serving in Parliament. In 1978, he was appointed Minister of Posts and Telecommunications and Social Welfare and Pensions by Prime Minister Vorster.\n\nUnder Prime Minister and later State President P. W. Botha, he held a succession of ministerial posts, including:\n* Posts and Telecommunications and Sports and Recreation (1978–1979)\n* Mines, Energy and Environmental Planning (1979–1980)\n* Mineral and Energy Affairs (1980–1982)\n* Internal Affairs (1982–1985)\n* National Education and Planning (1984–1989)\n\nIn 1972, his alma mater offered him a chair in its law faculty. In 1976, he was in the United States where he observed what he saw as the pervasive racism of US society, later noting that he \"saw more racial incidents in one month there than in South Africa in a year\".\n\nHe became Transvaal provincial National Party leader in 1982 and chairman of the Minister's Council in the House of Assembly in 1985. As education minister between 1984 and 1989 he upheld the apartheid system in South Africa's schools.\n\nFor most of his career, de Klerk had a very conservative reputation.  The NP's Transvaal branch was historically the most staunchly conservative wing of the party, and he supported continued segregation of universities while Minister of National Education. It thus came as a surprise when in 1989 he placed himself at the head of verligte (\"enlightened\") forces within the governing party which had come to believe that apartheid could not be maintained forever.  This wing favoured beginning negotiations while there was still time to get reasonable terms.\n\nState President\n\nP. W. Botha resigned as leader of the National Party after an apparent stroke, and de Klerk defeated Botha's preferred successor, finance minister Barend du Plessis, in the race to succeed him. On 2 February 1989, he was elected leader of the National Party. Soon after, he called for the introduction of a new South African constitution, hinting that it would need to provide greater concession to non-white racial groups. After becoming party leader, de Klerk extended his foreign contacts. He travelled to London, where he met with British Prime Minister Margaret Thatcher. Although she opposed the anti-apartheid movement's calls for economic sanctions against South Africa, at the meeting she urged de Klerk to release the imprisoned anti-apartheid activist Nelson Mandela. He also expressed a desire to meet with representatives of the U.S. government in Washington D.C., although the politician James Baker informed him that the U.S. government considered it inopportune to have de Klerk meet with President George H. W. Bush.\n\nBecoming State President\n\nBotha resigned on 14 August, and De Klerk was named acting state president until 20 September, when he was elected to a full five-year term as state president.  After he became acting president, ANC leaders spoke out against him, believing that he would be no different from his predecessors. The prominent anti-apartheid activist Desmond Tutu shared this assessment, stating: \"I don't think we've got to even begin to pretend that there is any reason for thinking that we are entering a new phase. It's just musical chairs\". Tutu and Allan Boesak had been planning a protest march in Cape Town, which the security chiefs wanted to prevent. De Klerk nevertheless turned down their proposal to ban it, agreeing to let the march proceed and stating that \"the door to a new South Africa is open, it is not necessary to batter it down\". The march took place and was attended by approximately 30,000 people. Further protest marches followed in Grahamstown, Johannesburg, Pretoria, and Durban. De Klerk later noted that his security forces could not have prevented the marchers from gathering: \"The choice, therefore, was between breaking up an illegal march with all of the attendant risks of violence and negative publicity, or of allowing the march to continue, subject to conditions that could help to avoid violence and ensure good public order.\" This decision marked a clear departure from the approach of the Botha era.\n\nAs President, he authorised the continuation of secret talks in Geneva between his National Intelligence Service and two exiled ANC leaders, Thabo Mbeki and Jacob Zuma. In October, he personally agreed to meet with Tutu, Boesak, and Frank Chikane in a private meeting in Pretoria. That month, he also released a number of elderly anti-apartheid activists then imprisoned, including Walter Sisulu. He also ordered the closure of the National Security Management System.\nIn December he visited Mandela in prison, speaking with him for three hours about the idea of transitioning away from white-minority rule.\n\nOn 2 February 1990 he gave an address to the country's parliament in which he announced plans for sweeping reforms of the political system. He announced that a number of banned political parties, including the ANC and Communist Party of South Africa, would be legalised. He also announced that the Separate Amenities Act of 1953, which governed the segregation of public facilities, would be lifted. He declared that Mandela would be released from prison unconditionally; the latter was released a week later. he later related that \"that speech was mainly aimed at breaking our stalemate in Africa and the West. Internationally we were teetering on the edge of the abyss.\" Throughout South Africa and across the world, there was astonishment at de Klerk's move. Tutu said that \"It's incredible... Give him credit. Give him credit, I do.\"\n\nFurther reforms followed; membership of the National Party was opened up to non-whites. In June, parliament approved new legislation that repealed the Natives Land Act, 1913 and Native Trust and Land Act, 1936. The Population Registration Act, which established the racial classificatory guidelines for South Africa, was rescinded.\n\nIn legislative terms, he enabled the gradual end of apartheid. De Klerk also opened the way for the negotiations of the government with the anti-apartheid-opposition about a new constitution for the country. Nevertheless, he was accused by Anthony Sampson of complicity in the violence among the ANC, the Inkatha Freedom Party and elements of the security forces. In Mandela: The Authorised Biography, Sampson accuses de Klerk of permitting his ministers to build their own criminal empires.\n\nHis presidency was dominated by the negotiation process, mainly between his NP government and the ANC, which led to the democratization of South Africa. In 1992, de Klerk held a whites-only referendum on ending apartheid, with the result being an overwhelming \"yes\" vote to continue negotiations to end apartheid. Nelson Mandela was distrustful of the role played by de Klerk in the negotiations, particularly as he believed that de Klerk was knowledgeable about 'third force' attempts to foment violence in the country and destabilize the negotiations.\n\nIn 1990, de Klerk gave orders to end South Africa's nuclear weapons programme; the process of nuclear disarmament was essentially completed in 1991. The existence of the programme was not officially acknowledged before 1993.Von Wielligh, N. & von Wielligh-Steyn, L. (2015). The Bomb – South Africa’s Nuclear Weapons Programme. Pretoria: Litera.\n\nIn 1993, De Klerk and Mandela were jointly awarded the Nobel Peace Prize for their work in ending apartheid. The awarding of the prize to de Klerk was controversial, especially in the light of de Klerk's reported admission that he ordered a massacre of supposed Azanian Peoples' Liberation Army fighters, including teenagers, shortly before going to Oslo in 1993. It appears that this massacre may form part of the basis for criminal charges that the Anti-Racism Action Forum laid against de Klerk in early 2016. Further, de Klerk's role in the destabilization of the country during the negotiation process through the operation of a 'third force' came to the attention of the Truth and Reconciliation Commission, and was never ultimately clarified.\n\nAfter the first universal elections in 1994, de Klerk became deputy president in the government of national unity under Nelson Mandela, a post he kept until 1996. In 1997 he resigned the leadership of the National Party and retired from politics.\n\nIn 1993, de Klerk issued an apology for the actions of the apartheid government, stating that: \"It was not our intention to deprive people of their rights and to cause misery, but eventually apartheid led to just that. Insofar as that occurred we deeply regret it... Yes we are sorry\". Tutu urged for people to accept the apology, stating that \"saying sorry is not an easy thing to do... We should be magnanimous and accept it as a magnanimous act\", although was privately frustrated that de Klerk's apology had been qualified and had not gone so far as to call apartheid an intrinsically evil policy.\n\nVice Presidency\n\nDe Klerk had been unhappy that changes had been made to the inauguration ceremony, rendering it multi-religious rather than reflecting the newly elected leader's particular denomination. When he was being sworn in, and the chief justice said \"So help me God\", de Klerk did not repeat this, instead stating, in Afrikaans: \"So help me the triune God, Father, Son, and Holy Spirit\".\n\nMandela reappointed de Klerk's finance minister, Derek Keys, and retained Chris Stals, a former member of the Broederbond, as the head of the Central Bank.\nDe Klerk supported the coalition's economic policies, stating that it \"accepted a broad framework of responsible economic policies\".\n\nDe Klerk's working relationship with Mandela was often strained, with the former finding it difficult adjusting to the fact that he was no longer president. De Klerk also felt that Mandela deliberately humiliated him, while Mandela found de Klerk to be needlessly provocative in cabinet. One dispute occurred in September 1995, after Mandela gave a Johannesburg speech criticising the National Party. Angered, de Klerk avoided Mandela until the latter requested they meet; when they ran into each other, they publicly argued in the street. Mandela later expressed regret for their disagreement but did not apologise for his original comments.\nDe Klerk was also having problems from within his own party, some of whose members claimed that he was neglecting the party while in the government.\n\nMany in the National Party—including many members of its executive committee—were unhappy with the other parties agreed upon a new constitution in May 1996. The party had wanted the constitution to guarantee that it would be represented in the government until 2004, although it did not do this.\nOn 9 May, de Klerk announced that the National Party would withdraw from the coalition government. The decision shocked several of his six fellow Afrikaner cabinet colleagues; Pik Botha, for example, was left without a job as a result. Roelf Meyer reported feeling betrayed by de Klerk's act, while Leon Wessels thought that de Klerk had not tried hard enough to make the coalition work. De Klerk announced that he would lead the National Party in vigorous opposition to Mandela's government, stating that he wanted to ensure \"a proper multi-party democracy, without which there may be a danger of South Africa lapsing into the African pattern of one-party states\".\n\nTruth and Reconciliation Commission\n\nIn de Klerk's view, his greatest defeat in the negotiations with Mandela had been his inability to secure a blanket amnesty for all those working for the government or state during the apartheid period. \nDe Klerk was unhappy with the formation of the Truth and Reconciliation Commission (TRC). He had hoped that the TRC would be made up of an equal number of individuals from both the old and new governments, as there had been in the Chilean human rights commission. Instead, the TRC was designed to broadly reflect the wider diversity of South African society, and contained only two members who had explicitly supported apartheid, one a member of a right-wing group that had opposed de Klerk's National Party. De Klerk did not object to Tutu being selected as the TRC's chair for he regarded him as politically independent of Mandela's government, but he was upset that Alex Boraine had been selected as its deputy chair, later saying of Boraine: \"beneath an urbane and deceptively affable exterior beat the heart of a zealot and an inquisitor.\"\n\nDe Klerk appeared before the TRC hearing to testify for Vlakplaas commanders who were accused of having committed human rights abuses during the apartheid era. He acknowledged that security forces had resorted to \"unconventional strategies\" in dealing with anti-apartheid revolutionaries, but that \"within my knowledge and experience, they never included the authorisation of assassination, murder, torture, rape, assault or the like\". After further evidence of said abuses was produced by the commission, de Klerk stated that he found the revelations to be \"as shocking and as abhorrent as anybody else\" but insisted that he and other senior party members were not willing to accept responsibility for the \"criminal actions of a handful of operatives\", stating that their behaviour was \"not authorised [and] not intended\" by his government. Given the widespread and systemic nature of the abuses that had taken place, as well as statements by security officers that their actions had been sanctioned by higher ranking figures, Tutu questioned how de Klerk and other government figures could not have been aware of them. Tutu had hoped that de Klerk or another senior white political figure from the apartheid era would openly accept responsibility for the human rights abuses, thereby allowing South Africa to move on; this was something that de Klerk would not do.\n\nThe TRC found de Klerk guilty of being an accessory to gross violations of human rights on the basis that as State President he had been told that P. W. Botha had authorised the bombing of Khotso House but had not revealed this information to the Committee. De Klerk challenged the TRC on this point, and it backed down. When the final TRC report was released 2002, it made a more limited accusation: that de Klerk had failed to give full disclosure about events that took place during his Presidency and that in view of his knowledge about the Khotso House bombing, his statement that none of his colleagues had authorised gross human rights abuses was \"indefensible\".\nIn his later autobiography, de Klerk acknowledged that the TRC did significant damage to his public image.\n\nLater life\n\nIn 1996, de Klerk was offered the Harper Fellowship at Yale Law School. He declined, citing protests at the university.Gold, Emily. (28 March 1997). [http://www.yaleherald.com/archive/xxiii/3.28.97/news/ethical.html Ethical controversy forces de Klerk to decline honor] . Yale Herald, 23. Retrieved 29 May 2012. De Klerk did, however, speak at Central Connecticut State University the day before his fellowship would have begun.\n \n\nIn 1998, de Klerk and his wife of 38 years, Marike de Klerk, were divorced following the discovery of his affair with Elita Georgiades, then the wife of Tony Georgiades, a Greek shipping tycoon who had allegedly given de Klerk and the NP financial support. Soon after his divorce, de Klerk and Georgiades were married. His divorce and remarriage scandalised conservative South African opinion, especially among the Calvinist Afrikaners. In 1999, his autobiography, The Last Trek – A New Beginning, was published. In 2001, following the murder of his former wife, the manuscript of her own autobiography, A Place Where the Sun Shines Again, was submitted to de Klerk, who urged the publishers to suppress a chapter dealing with his infidelity.\n\nIn 1999, de Klerk established the pro-peace FW de Klerk Foundation of which he is the chairman. De Klerk is also chairman of the Global Leadership Foundation, headquartered in London, which he set up in 2004, an organisation which works to support democratic leadership, prevent and resolve conflict through mediation and promote good governance in the form of democratic institutions, open markets, human rights and the rule of law. It does so by making available, discreetly and in confidence, the experience of former leaders to today's national leaders. It is a not-for-profit organisation composed of former heads of government and senior governmental and international organisation officials who work closely with heads of government on governance-related issues of concern to them.\n\nOn 3 December 2001, Marike de Klerk was found stabbed and strangled to death in her Cape Town flat. De Klerk, who was on a brief visit to Stockholm, Sweden, to celebrate the 100-year anniversary of the Nobel Prize foundation, announced he would immediately return to mourn his dead ex-wife. The atrocity was reportedly condemned strongly by South African president Thabo Mbeki and Winnie Mandela, among others, who openly spoke in favour of Marike de Klerk. On 6 December 21-year-old security guard Luyanda Mboniswa was arrested for the murder. On 15 May 2003, he received two life sentences for murder, as well as three years for breaking into Marike de Klerk's apartment.\n\nIn 2004, de Klerk announced that he was quitting the New National Party and seeking a new political home after it was announced that the NNP would merge with the ruling ANC. That same year, while giving an interview to US journalist Richard Stengel, de Klerk was asked whether South Africa had turned out the way he envisioned it back in 1990. His response was:\n\nThere are a number of imperfections in the new South Africa where I would have hoped that things would be better, but on balance I think we have basically achieved what we set out to achieve. And if I were to draw balance sheets on where South Africa stands now, I would say that the positive outweighs the negative by far. There is a tendency by commentators across the world to focus on the few negatives which are quite negative, like how are we handling AIDS, like our role vis-à-vis Zimbabwe. But the positives – the stability in South Africa, the adherence to well-balanced economic policies, fighting inflation, doing all the right things in order to lay the basis and the foundation for sustained economic growth – are in place.\n\nIn 2008, he repeated in a speech that \"despite all the negatives facing South Africa, he is very positive about the country\".\n\nIn 2006, he underwent surgery for a malignant tumour in his colon, discovered after an examination on 3 June. His condition deteriorated sharply, and he underwent a second operation after developing respiratory problems. On 13 June, it was announced that he was to undergo a tracheotomy. He recovered and on 11 September 2006 gave a speech at Kent State University Stark Campus.[http://www.cnn.com/2006/WORLD/africa/12/21/btsc.koinange.deklerk/index.html de Klerk] , CNN World Africa, 21 December 2006.\n\nIn January 2007, de Klerk was a speaker promoting peace and democracy in the world at the \"Towards a Global Forum on New Democracies\" event in Taipei, Taiwan, along with other dignitaries including Poland's Lech Wałęsa and Taiwan's then president Chen Shui-Bian.\n\nDe Klerk is an Honorary Patron of the University Philosophical Society of Trinity College, Dublin, and Honorary Chairman of the Prague Society for International Cooperation. He has also received the Gold Medal for Outstanding Contribution to Public Discourse from the College Historical Society of Trinity College, Dublin, for his contribution to ending apartheid.\n\nDe Klerk is also a Member of the Advisory Board of the Global Panel Foundation based in Berlin, Copenhagen, New York, Prague, Sydney and Toronto – founded by the Dutch entrepreneur Bas Spuybroek in 1988, with the support of Dutch billionaire Frans Lurvink and former Dutch Foreign Minister Hans van den Broek. The Global Panel Foundation is known for its behind-the-scenes work in public policy and the annual presentation of the Hanno R. Ellenbogen Citizenship Award with the Prague Society for International Cooperation.\n\nAfter the inauguration of Jacob Zuma as South Africa's president in May 2009, de Klerk said he is optimistic that Zuma and his government can \"confound the prophets of doom\".\n\nIn a BBC interview broadcast in April 2012, he said he lived in an all-white neighbourhood. He had five servants, three coloured and two black: \"We are one great big family together; we have the best of relationships.\" About Nelson Mandela, he said, \"When Mandela goes it will be a moment when all South Africans put away their political differences, will take hands, and will together honour maybe the biggest known South African that has ever lived.\"Interview by Stephen Sackur on Hardtalk, broadcast on BBC World Service 18 & 19 April 2012.\n\nUpon hearing of the death of Mandela, de Klerk said: \"He was a great unifier and a very, very special man in this regard beyond everything else he did. This emphasis on reconciliation was his biggest legacy.\"\n\nIn 2015, de Klerk wrote to The Times newspaper in the UK criticising moves to remove a statue to Cecil Rhodes at Oriel College, Oxford. He was subsequently criticized by some activists who described it as \"ironic\" that the last apartheid President should be defending a statue of a man labelled by critics as the \"architect of apartheid\". The Economic Freedom Fighters called for him to be stripped of his Nobel Peace Prize.\n\nPersonality and personal life\n\nGlad and Blanton stated that de Klerk's \"political choices were undergirded by self-confidence and commitment to the common good.\" His brother Willem stated that de Klerk's demeanour was marked by \"soberness, humility and calm\".\nHis former wife Marike described de Klerk as being \"extremely sensitive to beautiful things\", exhibiting something akin to an artistic temperament.\n\nReception and legacy\n\nGlad and Blanton stated that de Klerk, along with Mandela, \"accomplished the rare feat of bringing about systemic revolution through peaceful means.\". F. W. de Klerk. http://en.wikipedia.org/?curid=11479."
  }
}
