{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1154",
  "eid" : "aa036b80-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778364984,
  "textBody" : "Events\n\n*338 BC – A Macedonian army led by Philip II defeated the combined forces of Athens and Thebes in the Battle of Chaeronea, securing Macedonian hegemony in Greece and the Aegean.\n*216 BC – The Carthaginian army led by Hannibal defeats a numerically superior Roman army at the Battle of Cannae.\n*AD 70  – The armies of Titus destroy the Second Temple as the final blow of the Siege of Jerusalem. \n* 461 – Majorian is arrested near Tortona (northern Italy) and deposed by the Suebian general Ricimer as puppet emperor.\n*1274 – Edward I of England returns from the Ninth Crusade and is crowned King seventeen days later.\n*1343 – After the execution of her husband, Jeanne de Clisson sells her estates and raises a force of men with which to attack French shipping and ports.\n*1377 – Russian troops are defeated by forces of the Blue Horde Khan Arapsha in the Battle on Pyana River.\n*1415 – Thomas Grey, conspirator against King Henry V, beheaded.\n*1610 – During Henry Hudson's search for the Northwest Passage, he sails into what is now known as Hudson Bay.\n*1776 – The signing of the United States Declaration of Independence took place.\n*1790 – The first United States Census is conducted.\n*1798 – French Revolutionary Wars: The Battle of the Nile concludes in a British victory.\n*1830 – Charles X of France abdicates the throne in favor of his grandson Henri.\n*1869 – Japan's Edo society class system is abolished as part of the Meiji Restoration reforms.\n*1870 – Tower Subway, the world's first underground tube railway, opens in London, England, United Kingdom.\n*1873 – The Clay Street Hill Railroad begins operating the first cable car in San Francisco's famous cable car system.\n*1897 – Anglo-Afghan War: The Siege of Malakand ends when a relief column is able to reach the British garrison in the Malakand states.\n*1903 – The Ilinden–Preobrazhenie Uprising against the Ottoman Empire begins.\n*1914 – The German occupation of Luxembourg during World War I begins.\n*1916 – World War I: Austrian sabotage causes the sinking of the Italian battleship Leonardo da Vinci in Taranto.\n*1918 – The first general strike in Canadian history takes place in Vancouver.\n*1922 – A typhoon hits Shantou, Republic of China killing more than 50,000 people.\n*1923 – Vice President Calvin Coolidge becomes U.S. President upon the death of President Warren G. Harding.\n*1932 – The positron (antiparticle of the electron) is discovered by Carl D. Anderson.\n*1934 – Gleichschaltung: Adolf Hitler becomes Führer of Germany following the death of President Paul von Hindenburg.\n*1937 – The Marihuana Tax Act of 1937 is passed in America, the effect of which is to render marijuana and all its by-products illegal.\n*1939 – Albert Einstein and Leo Szilard write a letter to Franklin D. Roosevelt, urging him to begin the Manhattan Project to develop a nuclear weapon.\n*1943 – Jewish prisoners stage a revolt at Treblinka, one of the deadliest of Nazi death camps where approximately 900,000 persons were murdered in less than 18 months.\n*  1943   – World War II: The Motor Torpedo Boat PT-109 is rammed by the Japanese destroyer Amagiri and sinks. Lt. John F. Kennedy, future U.S. President, saves all but two of his crew.\n*1944 – ASNOM: Birth of the Socialist Republic of Macedonia, celebrated as Day of the Republic in the Republic of Macedonia.\n*  1944   – World War II: The largest trade convoy of the world wars arrives safely in the Western Approaches.\n*1945 – World War II: End of the Potsdam Conference. \n*1947 – A British South American Airways Avro Lancastrian airliner crashes into a mountain during a flight from Buenos Aires, Argentina to Santiago, Chile. The wreckage would not be found until 1998.\n*1968 – An earthquake hits Casiguran, Aurora, Philippines killing more than 270 people and wounding 261.\n*1973 – A flash fire kills 51 people at the Summerland amusement centre at Douglas, Isle of Man.\n*1980 – A bomb explodes at the railway station in Bologna, Italy, killing 85 people and wounding more than 200.\n*1985 – Delta Air Lines Flight 191, a Lockheed L-1011 TriStar, crashes at Dallas/Fort Worth International Airport killing 137.\n*1989 – Pakistan is re-admitted to the Commonwealth of Nations after having restored democracy for the first time since 1972.\n*  1989   – A massacre is carried out by an Indian Peace Keeping Force in Sri Lanka killing 64 ethnic Tamil civilians.\n*1990 – Iraq invades Kuwait, eventually leading to the Gulf War.\n*1999 – The Gaisal train disaster claims 285 lives in Assam, India.\n*2005 – Air France Flight 358 lands at Toronto Pearson International Airport and runs off the runway, causing the plane to burst into flames leaving 12 injuries and no fatalities.\n*2014 – At least 146 people were killed and more than 114 injured in a factory explosion in Kunshan, Jiangsu, China.\n\nBirths\n\n*1260 – Kyawswa of Pagan, last ruler of the Pagan Kingdom (d. 1299)\n*1455 – John Cicero, Elector of Brandenburg (d. 1499)\n*1533 – Theodor Zwinger, Swiss physician and scholar (d. 1588)\n*1549 – Mikołaj Krzysztof \"the Orphan\" Radziwiłł, Polish nobleman (d. 1616)\n*1612 – Saskia van Uylenburgh, Dutch model and wife of Rembrandt van Rijn (d. 1642)\n*1627 – Samuel Dirksz van Hoogstraten, Dutch painter (d. 1678)\n*1630 – Estephan El Douaihy, Maronite patriarch (d. 1704)\n*1646 – Jean-Baptiste du Casse, French admiral and buccaneer (d. 1715)\n*1672 – Johann Jakob Scheuchzer, Swiss paleontologist and scholar (d. 1733)\n*1674 – Philippe II, Duke of Orléans (d. 1723)\n*1696 – Mahmud I, Ottoman sultan (d. 1754)\n*1702 – Dietrich of Anhalt-Dessau (d. 1769)\n*1703 – Lorenzo Ricci, Italian religious leader, 18th Superior General of the Society of Jesus (d. 1775)\n*1740 – Jean Baptiste Camille Canclaux, French general (d. 1817)\n*1754 – Pierre Charles L'Enfant, French-American architect and engineer, designed Washington, D.C. (d. 1825)\n*1788 – Leopold Gmelin, German chemist and academic (d. 1853)\n*1815 – Adolf Friedrich von Schack, German poet and historian (d. 1894)\n*1820 – John Tyndall, Irish-English physicist and mountaineer (d. 1893)\n*1828 – Manuel Pavía y Rodríguez de Alburquerque, Spanish general (d. 1895)\n*1834 – Frédéric Auguste Bartholdi, French sculptor, designed the Statue of Liberty (d. 1904)\n*1835 – Elisha Gray, American businessman, co-founded Western Electric (d. 1901)\n*1861 – Prafulla Chandra Ray Indian chemist and academic (d. 1944)\n*1865 – Irving Babbitt, American academic and critic (d. 1933)\n*  1865   – John Radecki, Australian stained glass artist (d. 1955)\n*1867 – Ernest Dowson, English poet, novelist, and short story writer (d. 1900)\n*1868 – Constantine I of Greece (d. 1923)\n*1870 – Marianne Weber, German sociologist and suffragist (d. 1954)\n*1871 – John French Sloan, American painter and illustrator (d. 1951)\n*1872 – George E. Stewart, Australian-American colonel, Medal of Honor recipient (d. 1946)\n*1876 – Pingali Venkayya, Indian geologist, designed the Flag of India (d. 1963)\n*1877 – Ravishankar Shukla, Indian lawyer and politician, 1st Chief Minister of Madhya Pradesh (d. 1956)\n*1878 – Aino Kallas, Finnish-Estonian author (d. 1956)\n*1880 – Arthur Dove, American painter and educator (d. 1946)\n*1882 – Red Ames, American baseball player and manager (d. 1936)\n*  1882   – Albert Bloch, American painter and academic (d. 1961)\n*1884 – Rómulo Gallegos, Venezuelan author and politician, 46th President of Venezuela (d. 1969)\n*1886 – John Alexander Douglas McCurdy Canadian pilot and politician, 20th Lieutenant Governor of Nova Scotia (d. 1961)\n*1887 – Oskar Anderson, Bulgarian-German mathematician and statistician (d. 1960)\n*1891 – Arthur Bliss, English composer and conductor (d. 1975)\n*  1891   – Viktor Zhirmunsky, Russian linguist and historian (d. 1971)\n*1892 – Jack L. Warner, Canadian-born American production manager and producer, co-founded Warner Bros. (d. 1978)\n*1894 – Bertha Lutz, Brazilian feminist and scientist\n*1895 – Matt Henderson, New Zealand cricketer (d. 1970)\n*1897 – Karl-Otto Koch, German SS officer (d. 1945)\n*  1897   – Max Weber, Swiss lawyer and politician (d. 1974)\n*1898 – Ernő Nagy, Hungarian fencer (d. 1977)\n*1899 – Charles Bennett, English director and screenwriter (d. 1995)\n*1900 – Holling C. Holling, American author and illustrator (d. 1973)\n*  1900   – Helen Morgan, American actress and singer (d. 1941)\n*1902 – Pope Cyril VI of Alexandria (d. 1971)\n*1905 – Karl Amadeus Hartmann, German composer (d. 1963)\n*  1905   – Myrna Loy, American actress (d. 1993)\n*1907 – Mary Hamman, American journalist and author (d. 1984)\n*1910 – Roger MacDougall, Scottish director, playwright, and screenwriter (d. 1993)\n*1911 – Ann Dvorak, American actress (d. 1979)\n*1912 – Palle Huld, Danish actor (d. 2010)\n*  1912   – Håkon Stenstadvold, Norwegian painter, illustrator, and critic (d. 1977)\n*  1912   – Vladimir Žerjavić, Croatian economist and author (d. 2001)\n*1913 – Xavier Thaninayagam, Sri Lankan scholar and academic (d. 1980)\n*1914 – Félix Leclerc, Canadian singer-songwriter, actor, and poet (d. 1988)\n*  1914   – Big Walter Price, American singer-songwriter and pianist (d. 2012)\n*  1914   – Beatrice Straight, American actress (d. 2001)\n*1915 – Gary Merrill, American actor (d. 1990)\n*1916 – Alfonso A. Ossorio, Filipino-American painter and sculptor (d. 1990)\n*1919 – Nehemiah Persoff, Israeli-American actor \n*1920 – Louis Pauwels, French journalist and author (d. 1997)\n*  1920   – Augustus Rowe, Canadian physician and politician (d. 2013)\n*1921 – Alan Whicker, Egyptian-English journalist (d. 2013)\n*1922 – Betsy Bloomingdale, American philanthropist and socialite (d. 2016)\n*  1922   – Geoffrey Dutton, Australian historian and author (d. 1998)\n*1923 – Shimon Peres, Polish-Israeli lawyer and politician, 9th President of Israel (d. 2016)\n*  1923   – Ike Williams, American boxer (d. 1994)\n*1924 – James Baldwin, American novelist, poet, and critic (d. 1987)\n*  1924   – Joe Harnell, American pianist and composer (d. 2005)\n*  1924   – Carroll O'Connor, American actor, director, producer, and screenwriter (d. 2001)\n*1925 – K. Arulanandan, Ceylon-American engineer and academic (d. 2004)\n*  1925   – John Dexter, English director and producer (d. 1990)\n*  1925   – John McCormack, Canadian ice hockey player (d. 2017)\n*  1925   – Jorge Rafael Videla, Argentinian general and politician, 43rd President of Argentina (d. 2013)\n*1927 – Peter Swinnerton-Dyer, English mathematician and academic\n*1928 – Malcolm Hilton, English cricketer (d. 1990)\n*1929 – Roy Crimmins, English trombonist and composer (d. 2014)\n*  1929   – John Gale, English director and producer\n*  1929   – Vidya Charan Shukla, Indian politician, Indian Minister of External Affairs (d. 2013)\n*  1929   – David Waddington, Baron Waddington, English lawyer and politician, Governor of Bermuda (d. 2017)\n*1930 – Vali Myers, Australian painter and dancer (d. 2003)\n*1931 – Pierre DuMaine, American bishop and academic\n*  1931   – Eddie Fuller, South African cricketer (d. 2008)\n*  1931   – Karl Miller, English journalist and critic (d. 2014)\n*  1931   – Viliam Schrojf, Czech footballer (d. 2007)\n*1932 – Lamar Hunt, American businessman, co-founded the American Football League and World Championship Tennis (d. 2006)\n*  1932   – Peter O'Toole, British-Irish actor and producer (d. 2013)\n*1933 – Ioannis Varvitsiotis, Greek politician, Greek Minister of Defence\n*1934 – Valery Bykovsky, Russian general and astronaut\n*1935 – Hank Cochran, American singer-songwriter and guitarist (d. 2010)\n*1936 – Anthony Payne, English composer and author\n*1937 – Ron Brierley, New Zealand businessman\n*  1937   – Billy Cannon, American football player and dentist\n*  1937   – Garth Hudson, Canadian keyboard player, songwriter, and producer \n*1938 – Dave Balon, Canadian ice hockey player and coach (d. 2007)\n*  1938   – Pierre de Bané, Israeli-Canadian lawyer and politician\n*  1938   – Terry Peck, Falkland Islander soldier (d. 2006)\n*1939 – Benjamin Barber, American theorist, author, and academic\n*  1939   – Wes Craven, American director, producer, and screenwriter (d. 2015)\n*  1939   – John W. Snow, American businessman and politician, 73rd United States Secretary of the Treasury\n*1940 – Angel Lagdameo, Filipino archbishop\n*  1940   – Beko Ransome-Kuti, Nigerian physician and activist (d. 2006)\n*  1940   – Will Tura, Belgian singer-songwriter and guitarist\n*1941 – Doris Coley, American singer (d. 2000)\n*  1941   – Jules A. Hoffmann, Luxembourgian-French biologist and academic, Nobel Prize laureate\n*  1941   – François Weyergans, Belgian director and screenwriter\n*1942 – Isabel Allende, Chilean-American novelist, essayist, essayist\n*  1942   – Leo Beenhakker, Dutch football manager \n*  1942   – Juan Formell, Cuban singer-songwriter and bass player (d. 2014)\n*  1942   – Nell Irvin Painter, American author and historian\n*1943 – Herbert M. Allison, American lieutenant and businessman (d. 2013)\n*  1943   – Tom Burgmeier, American baseball player and coach\n*  1943   – Jon R. Cavaiani, English-American sergeant, Medal of Honor recipient (d. 2014)\n*  1943   – Rose Tremain, English novelist and short story writer\n*1944 – Jim Capaldi, English drummer and singer-songwriter (d. 2005)\n*  1944   – Naná Vasconcelos, Brazilian singer and berimbau player (d. 2016)\n*1945 – Joanna Cassidy, American actress\n*  1945   – Alex Jesaulenko, Austrian-Australian footballer and coach\n*  1945   – Bunker Roy, Indian educator and activist\n*  1945   – Eric Simms, Australian rugby league player and coach\n*1946 – James Howe, American journalist and author\n*1947 – Ruth Bakke, Norwegian organist and composer\n*  1947   – Lawrence Wright, American journalist, author, and screenwriter\n*1948 – Andy Fairweather Low, Welsh singer-songwriter, guitarist, and producer \n*  1948   – Dennis Prager, American radio host and author\n*  1948   – James Street, American football and baseball player (d. 2013)\n*  1948   – Snoo Wilson, English playwright and screenwriter (d. 2013)\n*1949 – James Fallows, American journalist and author\n*  1949   – Bertalan Farkas, Hungarian general and astronaut\n*1950 – Jussi Adler-Olsen, Danish author and publisher\n*  1950   – Ted Turner, British guitarist (Wishbone Ash)\n*1951 – Andrew Gold, American singer-songwriter and producer (d. 2011)\n*  1951   – Steve Hillage, English singer-songwriter and guitarist\n*  1951   – Joe Lynn Turner, American singer-songwriter and guitarist \n*  1951   – Per Westerberg, Swedish businessman and politician, Speaker of the Parliament of Sweden\n*1952 – Alain Giresse, French footballer and manager\n*1953 – Donnie Munro, Scottish singer and guitarist \n*  1953   – Anthony Seldon, English historian and author\n*1954 – Sammy McIlroy, Northern Irish footballer and manager\n*1955 – Caleb Carr, American historian and author\n*  1955   – Tony Godden, English footballer and manager\n*  1955   – Butch Vig, American drummer, songwriter, and record producer \n*1956 – Fulvio Melia, Italian-American physicist, astrophysicist, and author\n*1959 – Victoria Jackson, American actress and singer\n*  1959   – Johnny Kemp, Bahamian singer-songwriter and producer (d. 2015)\n*  1959   – Apollonia Kotero, American singer and actress \n*1960 – Linda Fratianne, American figure skater\n*  1960   – Neal Morse, American singer and keyboard player \n*  1960   – David Yow, American singer-songwriter \n*1961 – Pete de Freitas, Spanish drummer and producer  (d. 1989)\n*1962 – Lee Mavers, English singer, songwriter and guitarist \n*1963 – Laura Bennett, American architect and fashion designer\n*  1963   – Uğur Tütüneker, Turkish footballer and manager\n*1964 – Frank Biela, German race car driver\n*  1964   – Mary-Louise Parker, American actress\n*1965 – Joe Hockey, Australian lawyer and politician, 38th Treasurer of Australia\n*  1965   – Hisanobu Watanabe, Japanese baseball player and coach\n*1966 – Takashi Iizuka, Japanese wrestler\n*  1966   – Grainne Leahy, Irish cricketer\n*  1966   – Tim Wakefield, American baseball player and sportscaster\n*1967 – Aaron Krickstein, American tennis player\n*  1967   – Aline Brosh McKenna, American screenwriter and producer\n*1968 – Stefan Effenberg, German footballer and sportscaster\n*  1968   – John Stanier, American drummer \n*1969 – Jan Axel Blomberg, Norwegian drummer and songwriter \n*  1969   – Cedric Ceballos, American basketball player\n*  1969   – Fernando Couto, Portuguese footballer and manager\n*1970 – Tony Amonte, American ice hockey player and coach\n*  1970   – Kevin Smith, American actor, director, producer, and screenwriter\n*  1970   – Philo Wallace, Barbadian cricketer\n*1971 – Jason Bell, Australian rugby league player\n*  1971   – Michael Hughes, Irish footballer and manager\n*1972 – Mohamed Al-Deayea, Saudi Arabian footballer\n*  1972   – Jacinda Barrett, Australian model and actress\n*1973 – Hiroyuki Goto, Japanese game designer, created Kotoba no Puzzle: Mojipittan\n*  1973   – Danie Keulder, Namibian cricketer\n*  1973   – Miguel Mendonca, Zimbabwean journalist and author\n*  1973   – Susie O'Neill, Australian swimmer\n*1974 – Phil Williams, English journalist and radio host\n*1975 – Mineiro, Brazilian footballer\n*  1975   – Xu Huaiwen, Chinese-German badminton player and coach\n*  1975   – Tamás Molnár, Hungarian water polo player\n*1976 – Reyes Estévez, Spanish runner\n*  1976   – Jay Heaps, American soccer player and coach \n*  1976   – Michael Weiss, American figure skater\n*  1976   – Sam Worthington, English-Australian actor and producer\n*  1976   – Mohammad Zahid, Pakistani cricketer\n*1977 – Edward Furlong, American actor \n*  1977   – Mark Velasquez, American photographer\n*1978 – Goran Gavrančić, Serbian footballer\n*  1978   – Matt Guerrier, American baseball player\n*  1978   – Deividas Šemberas, Lithuanian footballer\n*  1978   – Dragan Vukmir, Serbian footballer\n*1979 – Marco Bonura, Italian footballer\n*  1979   – Reuben Kosgei, Kenyan runner\n*1980 – Ivica Banović, Croatian footballer\n*  1980   – Dingdong Dantes, Filipino actor, singer, director, and producer\n*1981 – Alexander Emelianenko, Russian mixed martial artist and boxer\n*  1981   – Tim Murtagh, English cricketer\n*1982 – Hélder Postiga, Portuguese footballer\n*  1982   – Kerry Rhodes, American football player\n*  1982   – Grady Sizemore, American baseball player\n*1983 – Michel Bastos, Brazilian footballer\n*  1983   – Kim Jung-ah, South Korean singer, dancer, and actress \n*1984 – Giampaolo Pazzini, Italian footballer\n*1985 – Stephen Ferris, Irish rugby player\n*  1985   – David Hart Smith, Canadian wrestler\n*  1985   – Britt Nicole (Brittany Nicole Waddell), American Christian pop artist\n*1986 – Mathieu Razanakolona, Canadian skier\n*1988 – Rob Kwiet, Canadian ice hockey player\n*  1988   – Alice Moran, Canadian actress and screenwriter\n*1989 – Nacer Chadli, Belgian footballer\n*1990 – Ima Bohush, Belarusian tennis player\n*1992 – Hallie Eisenberg, American actress\n*  1992   – Charli XCX, English singer and songwriter\n*1994 – Laura Pigossi, Brazilian tennis player\n*  1994   – Laremy Tunsil, American football player\n*1995 – Kristaps Porziņģis, Latvian basketball player\n\nDeaths\n\n*216  – Gnaeus Servilius Geminus, Roman consul\n*  216    – Lucius Aemilius Paullus, Roman consul and general\n*  216    – Marcus Minucius Rufus, Roman consul\n* 257 – Pope Stephen I\n* 640 – Pope Severinus\n* 686 – Pope John V (b. 635)\n* 855 – Ahmad ibn Hanbal, Arab theologian and jurist (b. 780)\n* 924 – Ælfweard of Wessex (b. 904)\n*1075 – Patriarch John VIII of Constantinople\n*1100 – William II of England (b. 1056)\n*1222 – Raymond VI, Count of Toulouse (b. 1156)\n*1277 – Mu'in al-Din Sulaiman Pervane, Chancellor and Regent of the Sultanate of Rum\n*1316 – Louis of Burgundy (b. 1297)\n*1332 – King Christopher II of Denmark (b. 1276)\n*1415 – Thomas Grey, English conspirator (b. 1384)\n*1445 – Oswald von Wolkenstein, Austrian poet and composer (b. 1376)\n*1451 – Elizabeth of Görlitz (b. 1390)\n*1511 – Andrew Barton, Scottish admiral (b. 1466)\n*1512 – Alessandro Achillini, Italian physician and philosopher (b. 1463)\n*1546 – Peter Faber, French priest and theologian, co-founded the Society of Jesus (b. 1506)\n*1589 – Henry III of France (b. 1551)\n*1605 – Richard Leveson, English admiral (b. c. 1570)\n*1611 – Katō Kiyomasa, Japanese daimyo (b. 1562)\n*1667 – Francesco Borromini, Swiss architect, designed San Carlo alle Quattro Fontane and Sant'Agnese in Agone (b. 1599)\n*1696 – Robert Campbell of Glenlyon (b. 1630)\n*1769 – Daniel Finch, 8th Earl of Winchilsea, English politician, Lord President of the Council (b. 1689)\n*1788 – Thomas Gainsborough, English painter (b. 1727) \n*1799 – Jacques-Étienne Montgolfier, French inventor, co-invented the hot air balloon (b. 1745)\n*1815 – Guillaume Brune, French general and politician (b. 1763)\n*1823 – Lazare Carnot, French mathematician, general, and politician, President of the National Convention (b. 1753)\n*1834 – Harriet Arbuthnot, English diarist (b. 1793)\n*1849 – Muhammad Ali of Egypt, Ottoman Albanian commander (b. 1769)\n*1854 – Heinrich Clauren, German author (b. 1771)\n*1859 – Horace Mann, American educator and politician (b. 1796)\n*1876 – \"Wild Bill\" Hickok, American sheriff (b. 1837)\n*1889 – Eduardo Gutiérrez, Argentinian author (b. 1851)\n*1890 – Louise-Victorine Ackermann, French poet and author (b. 1813)\n*1903 – Eduard Magnus Jakobson, Estonian missionary and engraver (b. 1847)\n*  1903   – Edmond Nocard, French veterinarian and microbiologist (b. 1850)\n*1913 – Ferenc Pfaff, Hungarian architect and academic, designed Zagreb Central Station (b. 1851)\n*1915 – John Downer, Australian politician, 16th Premier of South Australia (b. 1843)\n*1917 – Jaan Mahlapuu, Estonian military pilot (b. 1894)\n*1921 – Enrico Caruso, Italian tenor and actor (b. 1873)\n*1922 – Alexander Graham Bell, Scottish-Canadian engineer, invented the telephone (b. 1847)\n*1923 – Warren G. Harding, American journalist and politician, 29th President of the United States (b. 1865)\n*1934 – Paul von Hindenburg, German field marshal and politician, 2nd President of Germany (b. 1847)\n*1937 – Artur Sirk, Estonian soldier, lawyer, and politician (b. 1900)\n*1939 – Harvey Spencer Lewis, American mystic and author (b. 1883)\n*1945 – Pietro Mascagni, Italian composer and educator (b. 1863)\n*1955 – Alfred Lépine, Canadian ice hockey player and coach (b. 1901)\n*  1955   – Wallace Stevens, American poet and educator (b. 1879)\n*1963 – Oliver La Farge, American anthropologist and author (b. 1901)\n*1967 – Walter Terence Stace, English-American epistemologist, philosopher, and academic (b. 1886)\n*1970 – Angus MacFarlane-Grieve, English academic, mathematician, rower, and soldier (b. 1891)\n*1972 – Brian Cole, American bass player (b. 1942)\n*  1972   – Paul Goodman, American psychotherapist and author (b. 1911)\n*  1972   – Helen Hoyt, American poet and author (b. 1887)\n*1973 – Jean-Pierre Melville, French actor, director, producer, and screenwriter (b. 1917)\n*1974 – Douglas Hawkes, English race car driver and businessman (b. 1893)\n*1976 – László Kalmár, Hungarian mathematician and academic (b. 1905)\n*  1976   – Fritz Lang, Austrian-American director, producer, and screenwriter (b. 1890)\n*1978 – Carlos Chávez, Mexican composer and conductor (b. 1899)\n*  1978   – Antony Noghès, French businessman, founded the Monaco Grand Prix (b. 1890)\n*1979 – Thurman Munson, American baseball player (b. 1947)\n*1981 – Stefanie Clausen, Danish diver (b. 1900)\n*1986 – Roy Cohn, American lawyer and politician (b. 1927)\n*1988 – Joe Carcione, American activist and author (b. 1914)\n*  1988   – Raymond Carver, American short story writer and poet (b. 1938)\n*1990 – Norman Maclean, American short story writer and essayist (b. 1902)\n*  1990   – Edwin Richfield, English actor and screenwriter (b. 1921)\n*1992 – Michel Berger, French singer-songwriter and producer (b. 1947)\n*1996 – Michel Debré, French lawyer and politician, 150th Prime Minister of France (b. 1912)\n*  1996   – Obdulio Varela, Uruguayan footballer and manager (b. 1917)\n*1997 – William S. Burroughs, American novelist, short story writer, and essayist (b. 1914)\n*  1997   – Fela Kuti, Nigerian singer-songwriter and activist (b. 1938)\n*1998 – Shari Lewis, American television host and puppeteer (b. 1933)\n*1999 – Willie Morris, American writer (b. 1934)\n*2003 – Peter Safar, Austrian-American physician and academic (b. 1924)\n*2004 – Ferenc Berényi, Hungarian painter and academic (b. 1929)\n*  2004   – François Craenhals, Belgian illustrator (b. 1926)\n*  2004   – Heinrich Mark, Estonian lawyer and politician, 5th Prime Minister of Estonia in exile (b. 1911)\n*2005 – Steven Vincent, American journalist and author (b. 1955)\n*2007 – Chauncey Bailey, American journalist (b. 1950)\n*2008 – Fujio Akatsuka, Japanese illustrator (b. 1935)\n*2011 – José Sanchis Grau, Spanish author and illustrator (b. 1932)\n*2012 – Gabriel Horn, English biologist and academic (b. 1927)\n*  2012   – Magnus Isacsson, Canadian director and producer (b. 1948)\n*  2012   – Jimmy Jones, American singer-songwriter (b. 1930)\n*  2012   – John Keegan, English historian and journalist (b. 1934)\n*  2012   – Bernd Meier, German footballer (b. 1972)\n*  2012   – Marguerite Piazza, American soprano (b. 1920)\n*2013 – Julius L. Chambers, American lawyer and activist (b. 1936)\n*  2013   – Richard E. Dauch, American businessman, co-founded American Axle (b. 1942)\n*  2013   – Alla Kushnir, Russian–Israeli chess player (b. 1941)\n*2014 – Ed Joyce, American journalist (b. 1932)\n*  2014   – Billie Letts, American author and educator (b. 1938)\n*  2014   – Barbara Prammer, Austrian social worker and politician (b. 1954)\n*  2014   – James Thompson, American-Finnish author (b. 1964)\n*2015 – Forrest Bird, American pilot and engineer (b. 1921)\n*  2015   – Giovanni Conso, Italian jurist and politician, Italian Minister of Justice (b. 1922)\n*  2015   – Piet Fransen, Dutch footballer (b. 1936)\n*  2015   – Jack Spring, American baseball player (b. 1933)\n*2016 – Terence Bayler, New Zealand actor (b. 1930)\n*  2016   – David Huddleston, American actor (b. 1930)\n*  2016   – Franciszek Macharski, Polish cardinal (b. 1927)\n*  2016   – Ahmed Zewail, Egyptian-American chemist and academic, Nobel Prize laureate (b. 1946)\n\nHolidays and observances\n\n*Christian feast day:\n**Basil Fool for Christ (Russian Orthodox Church)\n**Blessed Justin Russolillo\n**Eusebius of Vercelli\n**Peter Faber\n**Peter Julian Eymard\n**Pope Stephen I\n**Our Lady of the Angels of the Portiuncula (Franciscan Order)\n**Samuel David Ferguson (Episcopal Church) \n**August 2 (Eastern Orthodox liturgics)\n*Day of Azerbaijani cinema (Azerbaijan)\n*Our Lady of the Angels Day (Costa Rica)\n*Paratroopers Day (Russia)\n*Republic Day (Republic of Macedonia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 2" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1154" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*338 BC – A Macedonian army led by Philip II defeated the combined forces of Athens and Thebes in the Battle of Chaeronea, securing Macedonian hegemony in Greece and the Aegean.\n*216 BC – The Carthaginian army led by Hannibal defeats a numerically superior Roman army at the Battle of Cannae.\n*AD 70  – The armies of Titus destroy the Second Temple as the final blow of the Siege of Jerusalem. \n* 461 – Majorian is arrested near Tortona (northern Italy) and deposed by the Suebian general Ricimer as puppet emperor.\n*1274 – Edward I of England returns from the Ninth Crusade and is crowned King seventeen days later.\n*1343 – After the execution of her husband, Jeanne de Clisson sells her estates and raises a force of men with which to attack French shipping and ports.\n*1377 – Russian troops are defeated by forces of the Blue Horde Khan Arapsha in the Battle on Pyana River.\n*1415 – Thomas Grey, conspirator against King Henry V, beheaded.\n*1610 – During Henry Hudson's search for the Northwest Passage, he sails into what is now known as Hudson Bay.\n*1776 – The signing of the United States Declaration of Independence took place.\n*1790 – The first United States Census is conducted.\n*1798 – French Revolutionary Wars: The Battle of the Nile concludes in a British victory.\n*1830 – Charles X of France abdicates the throne in favor of his grandson Henri.\n*1869 – Japan's Edo society class system is abolished as part of the Meiji Restoration reforms.\n*1870 – Tower Subway, the world's first underground tube railway, opens in London, England, United Kingdom.\n*1873 – The Clay Street Hill Railroad begins operating the first cable car in San Francisco's famous cable car system.\n*1897 – Anglo-Afghan War: The Siege of Malakand ends when a relief column is able to reach the British garrison in the Malakand states.\n*1903 – The Ilinden–Preobrazhenie Uprising against the Ottoman Empire begins.\n*1914 – The German occupation of Luxembourg during World War I begins.\n*1916 – World War I: Austrian sabotage causes the sinking of the Italian battleship Leonardo da Vinci in Taranto.\n*1918 – The first general strike in Canadian history takes place in Vancouver.\n*1922 – A typhoon hits Shantou, Republic of China killing more than 50,000 people.\n*1923 – Vice President Calvin Coolidge becomes U.S. President upon the death of President Warren G. Harding.\n*1932 – The positron (antiparticle of the electron) is discovered by Carl D. Anderson.\n*1934 – Gleichschaltung: Adolf Hitler becomes Führer of Germany following the death of President Paul von Hindenburg.\n*1937 – The Marihuana Tax Act of 1937 is passed in America, the effect of which is to render marijuana and all its by-products illegal.\n*1939 – Albert Einstein and Leo Szilard write a letter to Franklin D. Roosevelt, urging him to begin the Manhattan Project to develop a nuclear weapon.\n*1943 – Jewish prisoners stage a revolt at Treblinka, one of the deadliest of Nazi death camps where approximately 900,000 persons were murdered in less than 18 months.\n*  1943   – World War II: The Motor Torpedo Boat PT-109 is rammed by the Japanese destroyer Amagiri and sinks. Lt. John F. Kennedy, future U.S. President, saves all but two of his crew.\n*1944 – ASNOM: Birth of the Socialist Republic of Macedonia, celebrated as Day of the Republic in the Republic of Macedonia.\n*  1944   – World War II: The largest trade convoy of the world wars arrives safely in the Western Approaches.\n*1945 – World War II: End of the Potsdam Conference. \n*1947 – A British South American Airways Avro Lancastrian airliner crashes into a mountain during a flight from Buenos Aires, Argentina to Santiago, Chile. The wreckage would not be found until 1998.\n*1968 – An earthquake hits Casiguran, Aurora, Philippines killing more than 270 people and wounding 261.\n*1973 – A flash fire kills 51 people at the Summerland amusement centre at Douglas, Isle of Man.\n*1980 – A bomb explodes at the railway station in Bologna, Italy, killing 85 people and wounding more than 200.\n*1985 – Delta Air Lines Flight 191, a Lockheed L-1011 TriStar, crashes at Dallas/Fort Worth International Airport killing 137.\n*1989 – Pakistan is re-admitted to the Commonwealth of Nations after having restored democracy for the first time since 1972.\n*  1989   – A massacre is carried out by an Indian Peace Keeping Force in Sri Lanka killing 64 ethnic Tamil civilians.\n*1990 – Iraq invades Kuwait, eventually leading to the Gulf War.\n*1999 – The Gaisal train disaster claims 285 lives in Assam, India.\n*2005 – Air France Flight 358 lands at Toronto Pearson International Airport and runs off the runway, causing the plane to burst into flames leaving 12 injuries and no fatalities.\n*2014 – At least 146 people were killed and more than 114 injured in a factory explosion in Kunshan, Jiangsu, China.\n\nBirths\n\n*1260 – Kyawswa of Pagan, last ruler of the Pagan Kingdom (d. 1299)\n*1455 – John Cicero, Elector of Brandenburg (d. 1499)\n*1533 – Theodor Zwinger, Swiss physician and scholar (d. 1588)\n*1549 – Mikołaj Krzysztof \"the Orphan\" Radziwiłł, Polish nobleman (d. 1616)\n*1612 – Saskia van Uylenburgh, Dutch model and wife of Rembrandt van Rijn (d. 1642)\n*1627 – Samuel Dirksz van Hoogstraten, Dutch painter (d. 1678)\n*1630 – Estephan El Douaihy, Maronite patriarch (d. 1704)\n*1646 – Jean-Baptiste du Casse, French admiral and buccaneer (d. 1715)\n*1672 – Johann Jakob Scheuchzer, Swiss paleontologist and scholar (d. 1733)\n*1674 – Philippe II, Duke of Orléans (d. 1723)\n*1696 – Mahmud I, Ottoman sultan (d. 1754)\n*1702 – Dietrich of Anhalt-Dessau (d. 1769)\n*1703 – Lorenzo Ricci, Italian religious leader, 18th Superior General of the Society of Jesus (d. 1775)\n*1740 – Jean Baptiste Camille Canclaux, French general (d. 1817)\n*1754 – Pierre Charles L'Enfant, French-American architect and engineer, designed Washington, D.C. (d. 1825)\n*1788 – Leopold Gmelin, German chemist and academic (d. 1853)\n*1815 – Adolf Friedrich von Schack, German poet and historian (d. 1894)\n*1820 – John Tyndall, Irish-English physicist and mountaineer (d. 1893)\n*1828 – Manuel Pavía y Rodríguez de Alburquerque, Spanish general (d. 1895)\n*1834 – Frédéric Auguste Bartholdi, French sculptor, designed the Statue of Liberty (d. 1904)\n*1835 – Elisha Gray, American businessman, co-founded Western Electric (d. 1901)\n*1861 – Prafulla Chandra Ray Indian chemist and academic (d. 1944)\n*1865 – Irving Babbitt, American academic and critic (d. 1933)\n*  1865   – John Radecki, Australian stained glass artist (d. 1955)\n*1867 – Ernest Dowson, English poet, novelist, and short story writer (d. 1900)\n*1868 – Constantine I of Greece (d. 1923)\n*1870 – Marianne Weber, German sociologist and suffragist (d. 1954)\n*1871 – John French Sloan, American painter and illustrator (d. 1951)\n*1872 – George E. Stewart, Australian-American colonel, Medal of Honor recipient (d. 1946)\n*1876 – Pingali Venkayya, Indian geologist, designed the Flag of India (d. 1963)\n*1877 – Ravishankar Shukla, Indian lawyer and politician, 1st Chief Minister of Madhya Pradesh (d. 1956)\n*1878 – Aino Kallas, Finnish-Estonian author (d. 1956)\n*1880 – Arthur Dove, American painter and educator (d. 1946)\n*1882 – Red Ames, American baseball player and manager (d. 1936)\n*  1882   – Albert Bloch, American painter and academic (d. 1961)\n*1884 – Rómulo Gallegos, Venezuelan author and politician, 46th President of Venezuela (d. 1969)\n*1886 – John Alexander Douglas McCurdy Canadian pilot and politician, 20th Lieutenant Governor of Nova Scotia (d. 1961)\n*1887 – Oskar Anderson, Bulgarian-German mathematician and statistician (d. 1960)\n*1891 – Arthur Bliss, English composer and conductor (d. 1975)\n*  1891   – Viktor Zhirmunsky, Russian linguist and historian (d. 1971)\n*1892 – Jack L. Warner, Canadian-born American production manager and producer, co-founded Warner Bros. (d. 1978)\n*1894 – Bertha Lutz, Brazilian feminist and scientist\n*1895 – Matt Henderson, New Zealand cricketer (d. 1970)\n*1897 – Karl-Otto Koch, German SS officer (d. 1945)\n*  1897   – Max Weber, Swiss lawyer and politician (d. 1974)\n*1898 – Ernő Nagy, Hungarian fencer (d. 1977)\n*1899 – Charles Bennett, English director and screenwriter (d. 1995)\n*1900 – Holling C. Holling, American author and illustrator (d. 1973)\n*  1900   – Helen Morgan, American actress and singer (d. 1941)\n*1902 – Pope Cyril VI of Alexandria (d. 1971)\n*1905 – Karl Amadeus Hartmann, German composer (d. 1963)\n*  1905   – Myrna Loy, American actress (d. 1993)\n*1907 – Mary Hamman, American journalist and author (d. 1984)\n*1910 – Roger MacDougall, Scottish director, playwright, and screenwriter (d. 1993)\n*1911 – Ann Dvorak, American actress (d. 1979)\n*1912 – Palle Huld, Danish actor (d. 2010)\n*  1912   – Håkon Stenstadvold, Norwegian painter, illustrator, and critic (d. 1977)\n*  1912   – Vladimir Žerjavić, Croatian economist and author (d. 2001)\n*1913 – Xavier Thaninayagam, Sri Lankan scholar and academic (d. 1980)\n*1914 – Félix Leclerc, Canadian singer-songwriter, actor, and poet (d. 1988)\n*  1914   – Big Walter Price, American singer-songwriter and pianist (d. 2012)\n*  1914   – Beatrice Straight, American actress (d. 2001)\n*1915 – Gary Merrill, American actor (d. 1990)\n*1916 – Alfonso A. Ossorio, Filipino-American painter and sculptor (d. 1990)\n*1919 – Nehemiah Persoff, Israeli-American actor \n*1920 – Louis Pauwels, French journalist and author (d. 1997)\n*  1920   – Augustus Rowe, Canadian physician and politician (d. 2013)\n*1921 – Alan Whicker, Egyptian-English journalist (d. 2013)\n*1922 – Betsy Bloomingdale, American philanthropist and socialite (d. 2016)\n*  1922   – Geoffrey Dutton, Australian historian and author (d. 1998)\n*1923 – Shimon Peres, Polish-Israeli lawyer and politician, 9th President of Israel (d. 2016)\n*  1923   – Ike Williams, American boxer (d. 1994)\n*1924 – James Baldwin, American novelist, poet, and critic (d. 1987)\n*  1924   – Joe Harnell, American pianist and composer (d. 2005)\n*  1924   – Carroll O'Connor, American actor, director, producer, and screenwriter (d. 2001)\n*1925 – K. Arulanandan, Ceylon-American engineer and academic (d. 2004)\n*  1925   – John Dexter, English director and producer (d. 1990)\n*  1925   – John McCormack, Canadian ice hockey player (d. 2017)\n*  1925   – Jorge Rafael Videla, Argentinian general and politician, 43rd President of Argentina (d. 2013)\n*1927 – Peter Swinnerton-Dyer, English mathematician and academic\n*1928 – Malcolm Hilton, English cricketer (d. 1990)\n*1929 – Roy Crimmins, English trombonist and composer (d. 2014)\n*  1929   – John Gale, English director and producer\n*  1929   – Vidya Charan Shukla, Indian politician, Indian Minister of External Affairs (d. 2013)\n*  1929   – David Waddington, Baron Waddington, English lawyer and politician, Governor of Bermuda (d. 2017)\n*1930 – Vali Myers, Australian painter and dancer (d. 2003)\n*1931 – Pierre DuMaine, American bishop and academic\n*  1931   – Eddie Fuller, South African cricketer (d. 2008)\n*  1931   – Karl Miller, English journalist and critic (d. 2014)\n*  1931   – Viliam Schrojf, Czech footballer (d. 2007)\n*1932 – Lamar Hunt, American businessman, co-founded the American Football League and World Championship Tennis (d. 2006)\n*  1932   – Peter O'Toole, British-Irish actor and producer (d. 2013)\n*1933 – Ioannis Varvitsiotis, Greek politician, Greek Minister of Defence\n*1934 – Valery Bykovsky, Russian general and astronaut\n*1935 – Hank Cochran, American singer-songwriter and guitarist (d. 2010)\n*1936 – Anthony Payne, English composer and author\n*1937 – Ron Brierley, New Zealand businessman\n*  1937   – Billy Cannon, American football player and dentist\n*  1937   – Garth Hudson, Canadian keyboard player, songwriter, and producer \n*1938 – Dave Balon, Canadian ice hockey player and coach (d. 2007)\n*  1938   – Pierre de Bané, Israeli-Canadian lawyer and politician\n*  1938   – Terry Peck, Falkland Islander soldier (d. 2006)\n*1939 – Benjamin Barber, American theorist, author, and academic\n*  1939   – Wes Craven, American director, producer, and screenwriter (d. 2015)\n*  1939   – John W. Snow, American businessman and politician, 73rd United States Secretary of the Treasury\n*1940 – Angel Lagdameo, Filipino archbishop\n*  1940   – Beko Ransome-Kuti, Nigerian physician and activist (d. 2006)\n*  1940   – Will Tura, Belgian singer-songwriter and guitarist\n*1941 – Doris Coley, American singer (d. 2000)\n*  1941   – Jules A. Hoffmann, Luxembourgian-French biologist and academic, Nobel Prize laureate\n*  1941   – François Weyergans, Belgian director and screenwriter\n*1942 – Isabel Allende, Chilean-American novelist, essayist, essayist\n*  1942   – Leo Beenhakker, Dutch football manager \n*  1942   – Juan Formell, Cuban singer-songwriter and bass player (d. 2014)\n*  1942   – Nell Irvin Painter, American author and historian\n*1943 – Herbert M. Allison, American lieutenant and businessman (d. 2013)\n*  1943   – Tom Burgmeier, American baseball player and coach\n*  1943   – Jon R. Cavaiani, English-American sergeant, Medal of Honor recipient (d. 2014)\n*  1943   – Rose Tremain, English novelist and short story writer\n*1944 – Jim Capaldi, English drummer and singer-songwriter (d. 2005)\n*  1944   – Naná Vasconcelos, Brazilian singer and berimbau player (d. 2016)\n*1945 – Joanna Cassidy, American actress\n*  1945   – Alex Jesaulenko, Austrian-Australian footballer and coach\n*  1945   – Bunker Roy, Indian educator and activist\n*  1945   – Eric Simms, Australian rugby league player and coach\n*1946 – James Howe, American journalist and author\n*1947 – Ruth Bakke, Norwegian organist and composer\n*  1947   – Lawrence Wright, American journalist, author, and screenwriter\n*1948 – Andy Fairweather Low, Welsh singer-songwriter, guitarist, and producer \n*  1948   – Dennis Prager, American radio host and author\n*  1948   – James Street, American football and baseball player (d. 2013)\n*  1948   – Snoo Wilson, English playwright and screenwriter (d. 2013)\n*1949 – James Fallows, American journalist and author\n*  1949   – Bertalan Farkas, Hungarian general and astronaut\n*1950 – Jussi Adler-Olsen, Danish author and publisher\n*  1950   – Ted Turner, British guitarist (Wishbone Ash)\n*1951 – Andrew Gold, American singer-songwriter and producer (d. 2011)\n*  1951   – Steve Hillage, English singer-songwriter and guitarist\n*  1951   – Joe Lynn Turner, American singer-songwriter and guitarist \n*  1951   – Per Westerberg, Swedish businessman and politician, Speaker of the Parliament of Sweden\n*1952 – Alain Giresse, French footballer and manager\n*1953 – Donnie Munro, Scottish singer and guitarist \n*  1953   – Anthony Seldon, English historian and author\n*1954 – Sammy McIlroy, Northern Irish footballer and manager\n*1955 – Caleb Carr, American historian and author\n*  1955   – Tony Godden, English footballer and manager\n*  1955   – Butch Vig, American drummer, songwriter, and record producer \n*1956 – Fulvio Melia, Italian-American physicist, astrophysicist, and author\n*1959 – Victoria Jackson, American actress and singer\n*  1959   – Johnny Kemp, Bahamian singer-songwriter and producer (d. 2015)\n*  1959   – Apollonia Kotero, American singer and actress \n*1960 – Linda Fratianne, American figure skater\n*  1960   – Neal Morse, American singer and keyboard player \n*  1960   – David Yow, American singer-songwriter \n*1961 – Pete de Freitas, Spanish drummer and producer  (d. 1989)\n*1962 – Lee Mavers, English singer, songwriter and guitarist \n*1963 – Laura Bennett, American architect and fashion designer\n*  1963   – Uğur Tütüneker, Turkish footballer and manager\n*1964 – Frank Biela, German race car driver\n*  1964   – Mary-Louise Parker, American actress\n*1965 – Joe Hockey, Australian lawyer and politician, 38th Treasurer of Australia\n*  1965   – Hisanobu Watanabe, Japanese baseball player and coach\n*1966 – Takashi Iizuka, Japanese wrestler\n*  1966   – Grainne Leahy, Irish cricketer\n*  1966   – Tim Wakefield, American baseball player and sportscaster\n*1967 – Aaron Krickstein, American tennis player\n*  1967   – Aline Brosh McKenna, American screenwriter and producer\n*1968 – Stefan Effenberg, German footballer and sportscaster\n*  1968   – John Stanier, American drummer \n*1969 – Jan Axel Blomberg, Norwegian drummer and songwriter \n*  1969   – Cedric Ceballos, American basketball player\n*  1969   – Fernando Couto, Portuguese footballer and manager\n*1970 – Tony Amonte, American ice hockey player and coach\n*  1970   – Kevin Smith, American actor, director, producer, and screenwriter\n*  1970   – Philo Wallace, Barbadian cricketer\n*1971 – Jason Bell, Australian rugby league player\n*  1971   – Michael Hughes, Irish footballer and manager\n*1972 – Mohamed Al-Deayea, Saudi Arabian footballer\n*  1972   – Jacinda Barrett, Australian model and actress\n*1973 – Hiroyuki Goto, Japanese game designer, created Kotoba no Puzzle: Mojipittan\n*  1973   – Danie Keulder, Namibian cricketer\n*  1973   – Miguel Mendonca, Zimbabwean journalist and author\n*  1973   – Susie O'Neill, Australian swimmer\n*1974 – Phil Williams, English journalist and radio host\n*1975 – Mineiro, Brazilian footballer\n*  1975   – Xu Huaiwen, Chinese-German badminton player and coach\n*  1975   – Tamás Molnár, Hungarian water polo player\n*1976 – Reyes Estévez, Spanish runner\n*  1976   – Jay Heaps, American soccer player and coach \n*  1976   – Michael Weiss, American figure skater\n*  1976   – Sam Worthington, English-Australian actor and producer\n*  1976   – Mohammad Zahid, Pakistani cricketer\n*1977 – Edward Furlong, American actor \n*  1977   – Mark Velasquez, American photographer\n*1978 – Goran Gavrančić, Serbian footballer\n*  1978   – Matt Guerrier, American baseball player\n*  1978   – Deividas Šemberas, Lithuanian footballer\n*  1978   – Dragan Vukmir, Serbian footballer\n*1979 – Marco Bonura, Italian footballer\n*  1979   – Reuben Kosgei, Kenyan runner\n*1980 – Ivica Banović, Croatian footballer\n*  1980   – Dingdong Dantes, Filipino actor, singer, director, and producer\n*1981 – Alexander Emelianenko, Russian mixed martial artist and boxer\n*  1981   – Tim Murtagh, English cricketer\n*1982 – Hélder Postiga, Portuguese footballer\n*  1982   – Kerry Rhodes, American football player\n*  1982   – Grady Sizemore, American baseball player\n*1983 – Michel Bastos, Brazilian footballer\n*  1983   – Kim Jung-ah, South Korean singer, dancer, and actress \n*1984 – Giampaolo Pazzini, Italian footballer\n*1985 – Stephen Ferris, Irish rugby player\n*  1985   – David Hart Smith, Canadian wrestler\n*  1985   – Britt Nicole (Brittany Nicole Waddell), American Christian pop artist\n*1986 – Mathieu Razanakolona, Canadian skier\n*1988 – Rob Kwiet, Canadian ice hockey player\n*  1988   – Alice Moran, Canadian actress and screenwriter\n*1989 – Nacer Chadli, Belgian footballer\n*1990 – Ima Bohush, Belarusian tennis player\n*1992 – Hallie Eisenberg, American actress\n*  1992   – Charli XCX, English singer and songwriter\n*1994 – Laura Pigossi, Brazilian tennis player\n*  1994   – Laremy Tunsil, American football player\n*1995 – Kristaps Porziņģis, Latvian basketball player\n\nDeaths\n\n*216  – Gnaeus Servilius Geminus, Roman consul\n*  216    – Lucius Aemilius Paullus, Roman consul and general\n*  216    – Marcus Minucius Rufus, Roman consul\n* 257 – Pope Stephen I\n* 640 – Pope Severinus\n* 686 – Pope John V (b. 635)\n* 855 – Ahmad ibn Hanbal, Arab theologian and jurist (b. 780)\n* 924 – Ælfweard of Wessex (b. 904)\n*1075 – Patriarch John VIII of Constantinople\n*1100 – William II of England (b. 1056)\n*1222 – Raymond VI, Count of Toulouse (b. 1156)\n*1277 – Mu'in al-Din Sulaiman Pervane, Chancellor and Regent of the Sultanate of Rum\n*1316 – Louis of Burgundy (b. 1297)\n*1332 – King Christopher II of Denmark (b. 1276)\n*1415 – Thomas Grey, English conspirator (b. 1384)\n*1445 – Oswald von Wolkenstein, Austrian poet and composer (b. 1376)\n*1451 – Elizabeth of Görlitz (b. 1390)\n*1511 – Andrew Barton, Scottish admiral (b. 1466)\n*1512 – Alessandro Achillini, Italian physician and philosopher (b. 1463)\n*1546 – Peter Faber, French priest and theologian, co-founded the Society of Jesus (b. 1506)\n*1589 – Henry III of France (b. 1551)\n*1605 – Richard Leveson, English admiral (b. c. 1570)\n*1611 – Katō Kiyomasa, Japanese daimyo (b. 1562)\n*1667 – Francesco Borromini, Swiss architect, designed San Carlo alle Quattro Fontane and Sant'Agnese in Agone (b. 1599)\n*1696 – Robert Campbell of Glenlyon (b. 1630)\n*1769 – Daniel Finch, 8th Earl of Winchilsea, English politician, Lord President of the Council (b. 1689)\n*1788 – Thomas Gainsborough, English painter (b. 1727) \n*1799 – Jacques-Étienne Montgolfier, French inventor, co-invented the hot air balloon (b. 1745)\n*1815 – Guillaume Brune, French general and politician (b. 1763)\n*1823 – Lazare Carnot, French mathematician, general, and politician, President of the National Convention (b. 1753)\n*1834 – Harriet Arbuthnot, English diarist (b. 1793)\n*1849 – Muhammad Ali of Egypt, Ottoman Albanian commander (b. 1769)\n*1854 – Heinrich Clauren, German author (b. 1771)\n*1859 – Horace Mann, American educator and politician (b. 1796)\n*1876 – \"Wild Bill\" Hickok, American sheriff (b. 1837)\n*1889 – Eduardo Gutiérrez, Argentinian author (b. 1851)\n*1890 – Louise-Victorine Ackermann, French poet and author (b. 1813)\n*1903 – Eduard Magnus Jakobson, Estonian missionary and engraver (b. 1847)\n*  1903   – Edmond Nocard, French veterinarian and microbiologist (b. 1850)\n*1913 – Ferenc Pfaff, Hungarian architect and academic, designed Zagreb Central Station (b. 1851)\n*1915 – John Downer, Australian politician, 16th Premier of South Australia (b. 1843)\n*1917 – Jaan Mahlapuu, Estonian military pilot (b. 1894)\n*1921 – Enrico Caruso, Italian tenor and actor (b. 1873)\n*1922 – Alexander Graham Bell, Scottish-Canadian engineer, invented the telephone (b. 1847)\n*1923 – Warren G. Harding, American journalist and politician, 29th President of the United States (b. 1865)\n*1934 – Paul von Hindenburg, German field marshal and politician, 2nd President of Germany (b. 1847)\n*1937 – Artur Sirk, Estonian soldier, lawyer, and politician (b. 1900)\n*1939 – Harvey Spencer Lewis, American mystic and author (b. 1883)\n*1945 – Pietro Mascagni, Italian composer and educator (b. 1863)\n*1955 – Alfred Lépine, Canadian ice hockey player and coach (b. 1901)\n*  1955   – Wallace Stevens, American poet and educator (b. 1879)\n*1963 – Oliver La Farge, American anthropologist and author (b. 1901)\n*1967 – Walter Terence Stace, English-American epistemologist, philosopher, and academic (b. 1886)\n*1970 – Angus MacFarlane-Grieve, English academic, mathematician, rower, and soldier (b. 1891)\n*1972 – Brian Cole, American bass player (b. 1942)\n*  1972   – Paul Goodman, American psychotherapist and author (b. 1911)\n*  1972   – Helen Hoyt, American poet and author (b. 1887)\n*1973 – Jean-Pierre Melville, French actor, director, producer, and screenwriter (b. 1917)\n*1974 – Douglas Hawkes, English race car driver and businessman (b. 1893)\n*1976 – László Kalmár, Hungarian mathematician and academic (b. 1905)\n*  1976   – Fritz Lang, Austrian-American director, producer, and screenwriter (b. 1890)\n*1978 – Carlos Chávez, Mexican composer and conductor (b. 1899)\n*  1978   – Antony Noghès, French businessman, founded the Monaco Grand Prix (b. 1890)\n*1979 – Thurman Munson, American baseball player (b. 1947)\n*1981 – Stefanie Clausen, Danish diver (b. 1900)\n*1986 – Roy Cohn, American lawyer and politician (b. 1927)\n*1988 – Joe Carcione, American activist and author (b. 1914)\n*  1988   – Raymond Carver, American short story writer and poet (b. 1938)\n*1990 – Norman Maclean, American short story writer and essayist (b. 1902)\n*  1990   – Edwin Richfield, English actor and screenwriter (b. 1921)\n*1992 – Michel Berger, French singer-songwriter and producer (b. 1947)\n*1996 – Michel Debré, French lawyer and politician, 150th Prime Minister of France (b. 1912)\n*  1996   – Obdulio Varela, Uruguayan footballer and manager (b. 1917)\n*1997 – William S. Burroughs, American novelist, short story writer, and essayist (b. 1914)\n*  1997   – Fela Kuti, Nigerian singer-songwriter and activist (b. 1938)\n*1998 – Shari Lewis, American television host and puppeteer (b. 1933)\n*1999 – Willie Morris, American writer (b. 1934)\n*2003 – Peter Safar, Austrian-American physician and academic (b. 1924)\n*2004 – Ferenc Berényi, Hungarian painter and academic (b. 1929)\n*  2004   – François Craenhals, Belgian illustrator (b. 1926)\n*  2004   – Heinrich Mark, Estonian lawyer and politician, 5th Prime Minister of Estonia in exile (b. 1911)\n*2005 – Steven Vincent, American journalist and author (b. 1955)\n*2007 – Chauncey Bailey, American journalist (b. 1950)\n*2008 – Fujio Akatsuka, Japanese illustrator (b. 1935)\n*2011 – José Sanchis Grau, Spanish author and illustrator (b. 1932)\n*2012 – Gabriel Horn, English biologist and academic (b. 1927)\n*  2012   – Magnus Isacsson, Canadian director and producer (b. 1948)\n*  2012   – Jimmy Jones, American singer-songwriter (b. 1930)\n*  2012   – John Keegan, English historian and journalist (b. 1934)\n*  2012   – Bernd Meier, German footballer (b. 1972)\n*  2012   – Marguerite Piazza, American soprano (b. 1920)\n*2013 – Julius L. Chambers, American lawyer and activist (b. 1936)\n*  2013   – Richard E. Dauch, American businessman, co-founded American Axle (b. 1942)\n*  2013   – Alla Kushnir, Russian–Israeli chess player (b. 1941)\n*2014 – Ed Joyce, American journalist (b. 1932)\n*  2014   – Billie Letts, American author and educator (b. 1938)\n*  2014   – Barbara Prammer, Austrian social worker and politician (b. 1954)\n*  2014   – James Thompson, American-Finnish author (b. 1964)\n*2015 – Forrest Bird, American pilot and engineer (b. 1921)\n*  2015   – Giovanni Conso, Italian jurist and politician, Italian Minister of Justice (b. 1922)\n*  2015   – Piet Fransen, Dutch footballer (b. 1936)\n*  2015   – Jack Spring, American baseball player (b. 1933)\n*2016 – Terence Bayler, New Zealand actor (b. 1930)\n*  2016   – David Huddleston, American actor (b. 1930)\n*  2016   – Franciszek Macharski, Polish cardinal (b. 1927)\n*  2016   – Ahmed Zewail, Egyptian-American chemist and academic, Nobel Prize laureate (b. 1946)\n\nHolidays and observances\n\n*Christian feast day:\n**Basil Fool for Christ (Russian Orthodox Church)\n**Blessed Justin Russolillo\n**Eusebius of Vercelli\n**Peter Faber\n**Peter Julian Eymard\n**Pope Stephen I\n**Our Lady of the Angels of the Portiuncula (Franciscan Order)\n**Samuel David Ferguson (Episcopal Church) \n**August 2 (Eastern Orthodox liturgics)\n*Day of Azerbaijani cinema (Azerbaijan)\n*Our Lady of the Angels Day (Costa Rica)\n*Paratroopers Day (Russia)\n*Republic Day (Republic of Macedonia). August 2. http://en.wikipedia.org/?curid=1154."
  }
}
