{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3035",
  "eid" : "c3cea930-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778408259,
  "textBody" : "The Alaska Native Claims Settlement Act (ANCSA) was signed into law by President Richard Nixon on December 18, 1971, constituting at the time the largest land claims settlement in United States history. ANCSA was intended to resolve long-standing issues surrounding aboriginal land claims in Alaska, as well as to stimulate economic development throughout Alaska.\"Recognition of aboriginal land rights in Alaska was a sharp departure from American Indian policy in other parts of the US. Observers believe this was more a result of slow economic development within Alaska than rejection of Indian policy,\" citing Cooley, R.A. 1983. \"Evolution of Alaska land policy.\" in Morehouse, T. A. (editor). Alaskan Resources Development: Issues of the 1980s. Boulder: Westview Press, pp. 13-49. \n\nThe settlement established Alaska Native claims to the land by transferring titles to twelve Alaska Native regional corporations and over 200 local village corporations. A thirteenth regional corporation was later created for Alaska Natives who no longer resided in Alaska. The act is codified as 43 U.S.C. 1601 et seq.\n\nBackground\n\nWhen Alaska became a state in 1959, section 4 of the Alaska Statehood Act provided that any existing Alaska Native land claims would be unaffected by statehood and held in status quo. Yet while section 4 of the act preserved Native land claims until later settlement, section 6 allowed for the state government to claim lands deemed vacant. Section 6 granted the state of Alaska the right to select lands then in the hands of the federal government, with the exception of Native territory. As a result, nearly  from the public domain would eventually be transferred to the state. The state government also attempted to acquire lands under section 6 of the Statehood Act that were subject to Native claims under section 4, and that were currently occupied and used by Alaska Natives. The federal Bureau of Land Management began to process the Alaska government's selections without taking into account the Native claims and without informing the affected Native groups.\n\nIt was against this backdrop that the original language for a land claims settlement was developed. \n\nA 9.2-magnitude earthquake struck the state in 1964. Recovery efforts drew the attention of the federal government, which found that Alaska Natives had the poorest living conditions in the country. The Federal Field Committee for Development Planning in Alaska decided that Natives should receive $100 million and 10% of revenue as a royalty. Nothing was done with this proposal, however, and a freeze on land transfers remained in effect. \n\nIn 1968, Governor Walter Hickel summoned a group of Native leaders to work out a settlement that would be satisfactory to Natives. The group met for ten days and asked for $20 million in exchange for requested lands. They also asked for 10% of federal mineral lease revenue.\n\nIn 1969, President Nixon appointed Hickel as Secretary of the Interior. The Alaska Federation of Natives (AFN) protested against Hickel’s nomination, but he was eventually confirmed.\n\nHickel worked with the AFN, negotiating with Native leaders and state government over the disputed lands. Offers went back and forth, with each rejecting the other’s proposals. The AFN wanted rights to land, while then-Governor Keith Miller believed Natives did not have legitimate claims to state land in light of the provisions of the Alaska Statehood Act. \n\nBut a succeeding Alaska state administration under Governor William A. Egan would stake out positions upon which the AFN and other stakeholders could largely agree. Native leaders, in addition to Alaska's congressional delegation and the state's newly elected Governor William A. Egan, eventually reached the basis for presenting an agreement to Congress. The proposed settlement terms faced challenges in both houses but found a strong ally in Senator Henry M. Jackson from Washington state. The most controversial issues that continued to hold up approval were methods for determining land selection by Alaska Natives and financial distribution.\n\nIn 1968, the Atlantic-Richfield Company discovered oil at Prudhoe Bay on the Arctic coast, catapulting the issue of land ownership into headlines. In order to lessen the difficulty of drilling at such a remote location and transporting the oil to the lower 48 states, the oil companies proposed building a pipeline to carry the oil across Alaska to the port of Valdez At Valdez, the oil would be loaded onto tankers and shipped to the contiguous states. The plan had been approved, but a permit to construct the pipeline, which would cross lands involved in the land claims dispute, could not be granted until the Native claims were settled.\n\nWith major petroleum dollars on the line, pressure mounted to achieve a definitive legislative resolution at the federal level. In 1971, the Alaska Native Claims Settlement Act was signed into law by President Nixon. It abrogated Native claims to aboriginal lands except those that are the subject of the law. In return, Natives received up to 44 e6acre of land and were paid $963 million. The land and money were to be divided among regional, urban, and village tribal corporations established under the law, often recognizing existing leadership.\n\nEffect of land conveyances\n\nIn 1971, barely one million acres of land in Alaska was in private hands. ANCSA, together with section 6 of Alaska Statehood Act, which the new act allowed to come to fruition, affected ownership to about  of land in Alaska once wholly controlled by the federal government. That is larger by 6 e6acre than the combined areas of Maine, Vermont, New Hampshire, Massachusetts, Rhode Island, Connecticut, New York, New Jersey, Pennsylvania, Delaware, Maryland and Virginia.\n\nWhen the bill passed in 1971, it included provisions that had never before been attempted in previous United States settlements with Native Americans. The newly passed Alaska Native Claims Settlement Act created twelve Native regional economic development corporations. Each corporation was associated with a specific region of Alaska and the Natives who had traditionally lived there. This innovative approach to native settlements engaged the tribes in corporate capitalism. \n\nThe idea originated with the AFN, who believed that the Natives would have to become a part of the capitalist system in order to survive. As stockholders in these corporations, the Natives could earn some income and stay in their traditional villages.  If the corporations were managed properly, they could make profits that would enable individuals to stay, rather than having to leave Native villages to find better work. This was intended to help preserve Native culture.\n\nNative and state land selection\n\nAlaska Natives had three years from passage of ANCSA to make land selections of the 44 e6acre granted under the act. In some cases Native corporations received outside aid in surveying the land. For instance, Doyon, Limited (one of the 13 regional corporations) was helped by the Geophysical Institute of the University of Alaska. The Institute determined which land contained resources such as minerals and coal. NASA similarly provided satellite imagery to aid in Native corporations finding areas most suited for vegetation and their traditional subsistence culture. The imagery showed locations of caribou and moose, as well as forests with marketable timber. In total about 7 e6acre were analyzed for Doyon. Natives were able to choose tens of thousands of acres of land rich with timber while Doyon used mineral analysis to attract businesses.\n\nThe state of Alaska to date has been granted approximately 85% or 90 e6acre  of the land claims it has made under ANCSA. The state is entitled to a total of  under the terms of the Statehood Act. Originally the state had 25 years after passage of the Alaska Statehood Act to file claims under section 6 of the act with the Bureau of Land Management (BLM). Amendments to ANCSA extended that deadline until 1994, with the expectation that BLM would complete processing of land transfers subject to overlapping Native claims by 2009. Nonetheless, some Native and state selections under ANCSA remained unresolved as late as December 2014.\n\nCriticism of ANCSA\n\nThere was largely positive reaction to ANCSA, although not entirely. The act was supported by Natives as well as non-Natives, and likewise enjoyed bipartisan support. Natives were heavily involved in the legislative process, and the final draft of the act used many AFN ideas. \n\nSome Natives have argued that ANCSA has hastened cultural genocide of Alaska Natives. Some Natives critiqued ANCSA as an illegitimate treaty since only tribal leaders were involved and the provisions of the act were not voted on by indigenous populations. One native described it as a social and political experiment. Critics have also argued that Natives so feared massacre or incarceration that they offered no resistance to the act. \n\nOthers have argued that the settlement was arguably the most generous afforded by the United States to a Native group. They note that some of the largest and most profitable corporations in the state are the twelve created by ANCSA. Other critics attacked the act as \"Native welfare\" and such complaints continue to be expressed. \n\nThe corporation system has been critiqued, as in some cases stockholders have sold land to outside corporations that have leveled forests and extracted minerals. But supporters of the system argue that it has provided economic benefits for indigenous peoples that outweigh these problems.\n\nSelected provisions of ANCSA\n\n* Native claims in Alaska were extinguished by means of section 4 of ANCSA.\n* In exchange for abrogating Native claims, approximately one-ninth of the state's land plus $962.5 million were distributed to more than 200 local Alaska Native \"village corporations\" established under section 8, in addition to 12 land-owning for-profit Alaska Native \"regional corporations\" and a non-land-owning thirteenth corporation for Alaska Natives who had left the state established under section 6.\n* Of the compensation monies, $462.5 million was to come from the federal treasury and the rest from oil revenue-sharing.\n* Settlement benefits would accrue to those with at least one-fourth Native ancestry under sections 3(b) and 5(a).\n* Of the approximately 80,000 Natives enrolled under ANCSA, those living in villages (approximately two-thirds of the total) would receive 100 shares in both a village and a regional corporation.\n* The remaining one-third would be \"at large\" shareholders with 100 shares in a regional corporation with additional rights to revenue from regional mineral and timber resources.\n* The Alaska Native Allotment Act was revoked but with the proviso that pending claims under that act would continue to be processed under section 18. Successful applicants would be excluded under ANCSA by section 14(h)(5) from land to be used for a primary residence.\n* The twelve regional corporations within the state would administer the settlement.\n* A thirteenth corporation composed of Natives who had left the state would receive compensation but not land.\n* Surface rights to 44 e6acre were patented to the Native village and regional corporations under sections 12(c), as well as 14(h)(1) and (8).\n* The surface rights to the patented land were granted to the village corporations and the subsurface right to the land were granted to the regional corporation, creating a split estate pursuant to section 14(f).\n\nAlaska Native regional corporations\n\nThe following thirteen regional corporations were created under ANCSA:\n* Ahtna, Incorporated\n* The Aleut Corporation \n* Arctic Slope Regional Corporation \n* Bering Straits Native Corporation \n* Bristol Bay Native Corporation \n* Calista Corporation\n* Chugach Alaska Corporation\n* Cook Inlet Region, Inc. \n* Doyon, Limited\n* Koniag, Incorporated\n* NANA Regional Corporation \n* Sealaska Corporation\n* The 13th Regional Corporation\n\nAdditionally, most regions and some villages have created their own nonprofits providing social services and health care through grant funding and federal compacts. The objectives of these nonprofits are varied, but focus generally on cultural and educational activities. These include scholarships for Native students, sponsorship of cultural and artistic events, preservation efforts for Native languages, and protection of sites with historic or religious importance.\n\nAlaska Native village and urban corporations\n\nANCSA created about 224 village and urban corporations. Below is a representative list of village and urban corporations created under ANCSA:\n* Ukpeaġvik Iñupiat Corporation, village corporation for Utqiaġvik\n* [http://www.bnc-alaska.com Bethel Native Corporation], village corporation for Bethel\n* [http://www.capefoxcorp.com Cape Fox Corporation], village corporation for Saxman\n* [http://www.deloycheet.com/ Deloycheet, Inc.], village corporation for Holy Cross\n* Huna Totem Corporation, village corporation for Hoonah\n* [http://www.haidacorporation.com Haida Corporation], village corporation for Hydaburg\n* [http://www.goldbelt.com/ Goldbelt, Inc.], urban corporation for Juneau\n* [http://www.pvil.com Paug-Vik, Inc. Ltd.], village corporation for Naknek\n* [http://www.chenega.com Chenega Corporation], village corporation for Chenega\n* [http://www.afognak.com/ Afognak Native Corporation], village corporation for Afognak and Port Lions\n* [http://www.kavilco.com/ Kavilco Incorporated], village corporation for Kasaan\n* [http://www.adn.com/article/20120810/klukwan-files-bankruptcy Klukwan, Inc.], village corporation for Klukwan\n* [http://www.kuskokwim.com/ The Kuskokwim Corporation], village corporation for Aniak, Crooked Creek, Georgetown, Kalskag, Lower Kalskag, Napaimute, Red Devil, Russian Mission, Sleetmute and Stony River\n* [http://www.nativesofkodiak.com/ Natives of Kodiak, Inc.], urban corporation for Kodiak\n* Ounalashka Corporation, village corporation for Unalaska\n* [http://www.ouzinkienativecorporation.com/ Ouzinkie Native Corporation], village corporation for Ouzinkie\n* [http://www.sheeatika.com/ Shee Atika, Incorporated], urban corporation for Sitka",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Alaska Native Claims Settlement Act" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3035" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Alaska Native Claims Settlement Act (ANCSA) was signed into law by President Richard Nixon on December 18, 1971, constituting at the time the largest land claims settlement in United States history. ANCSA was intended to resolve long-standing issues surrounding aboriginal land claims in Alaska, as well as to stimulate economic development throughout Alaska.\"Recognition of aboriginal land rights in Alaska was a sharp departure from American Indian policy in other parts of the US. Observers believe this was more a result of slow economic development within Alaska than rejection of Indian policy,\" citing Cooley, R.A. 1983. \"Evolution of Alaska land policy.\" in Morehouse, T. A. (editor). Alaskan Resources Development: Issues of the 1980s. Boulder: Westview Press, pp. 13-49. \n\nThe settlement established Alaska Native claims to the land by transferring titles to twelve Alaska Native regional corporations and over 200 local village corporations. A thirteenth regional corporation was later created for Alaska Natives who no longer resided in Alaska. The act is codified as 43 U.S.C. 1601 et seq.\n\nBackground\n\nWhen Alaska became a state in 1959, section 4 of the Alaska Statehood Act provided that any existing Alaska Native land claims would be unaffected by statehood and held in status quo. Yet while section 4 of the act preserved Native land claims until later settlement, section 6 allowed for the state government to claim lands deemed vacant. Section 6 granted the state of Alaska the right to select lands then in the hands of the federal government, with the exception of Native territory. As a result, nearly  from the public domain would eventually be transferred to the state. The state government also attempted to acquire lands under section 6 of the Statehood Act that were subject to Native claims under section 4, and that were currently occupied and used by Alaska Natives. The federal Bureau of Land Management began to process the Alaska government's selections without taking into account the Native claims and without informing the affected Native groups.\n\nIt was against this backdrop that the original language for a land claims settlement was developed. \n\nA 9.2-magnitude earthquake struck the state in 1964. Recovery efforts drew the attention of the federal government, which found that Alaska Natives had the poorest living conditions in the country. The Federal Field Committee for Development Planning in Alaska decided that Natives should receive $100 million and 10% of revenue as a royalty. Nothing was done with this proposal, however, and a freeze on land transfers remained in effect. \n\nIn 1968, Governor Walter Hickel summoned a group of Native leaders to work out a settlement that would be satisfactory to Natives. The group met for ten days and asked for $20 million in exchange for requested lands. They also asked for 10% of federal mineral lease revenue.\n\nIn 1969, President Nixon appointed Hickel as Secretary of the Interior. The Alaska Federation of Natives (AFN) protested against Hickel’s nomination, but he was eventually confirmed.\n\nHickel worked with the AFN, negotiating with Native leaders and state government over the disputed lands. Offers went back and forth, with each rejecting the other’s proposals. The AFN wanted rights to land, while then-Governor Keith Miller believed Natives did not have legitimate claims to state land in light of the provisions of the Alaska Statehood Act. \n\nBut a succeeding Alaska state administration under Governor William A. Egan would stake out positions upon which the AFN and other stakeholders could largely agree. Native leaders, in addition to Alaska's congressional delegation and the state's newly elected Governor William A. Egan, eventually reached the basis for presenting an agreement to Congress. The proposed settlement terms faced challenges in both houses but found a strong ally in Senator Henry M. Jackson from Washington state. The most controversial issues that continued to hold up approval were methods for determining land selection by Alaska Natives and financial distribution.\n\nIn 1968, the Atlantic-Richfield Company discovered oil at Prudhoe Bay on the Arctic coast, catapulting the issue of land ownership into headlines. In order to lessen the difficulty of drilling at such a remote location and transporting the oil to the lower 48 states, the oil companies proposed building a pipeline to carry the oil across Alaska to the port of Valdez At Valdez, the oil would be loaded onto tankers and shipped to the contiguous states. The plan had been approved, but a permit to construct the pipeline, which would cross lands involved in the land claims dispute, could not be granted until the Native claims were settled.\n\nWith major petroleum dollars on the line, pressure mounted to achieve a definitive legislative resolution at the federal level. In 1971, the Alaska Native Claims Settlement Act was signed into law by President Nixon. It abrogated Native claims to aboriginal lands except those that are the subject of the law. In return, Natives received up to 44 e6acre of land and were paid $963 million. The land and money were to be divided among regional, urban, and village tribal corporations established under the law, often recognizing existing leadership.\n\nEffect of land conveyances\n\nIn 1971, barely one million acres of land in Alaska was in private hands. ANCSA, together with section 6 of Alaska Statehood Act, which the new act allowed to come to fruition, affected ownership to about  of land in Alaska once wholly controlled by the federal government. That is larger by 6 e6acre than the combined areas of Maine, Vermont, New Hampshire, Massachusetts, Rhode Island, Connecticut, New York, New Jersey, Pennsylvania, Delaware, Maryland and Virginia.\n\nWhen the bill passed in 1971, it included provisions that had never before been attempted in previous United States settlements with Native Americans. The newly passed Alaska Native Claims Settlement Act created twelve Native regional economic development corporations. Each corporation was associated with a specific region of Alaska and the Natives who had traditionally lived there. This innovative approach to native settlements engaged the tribes in corporate capitalism. \n\nThe idea originated with the AFN, who believed that the Natives would have to become a part of the capitalist system in order to survive. As stockholders in these corporations, the Natives could earn some income and stay in their traditional villages.  If the corporations were managed properly, they could make profits that would enable individuals to stay, rather than having to leave Native villages to find better work. This was intended to help preserve Native culture.\n\nNative and state land selection\n\nAlaska Natives had three years from passage of ANCSA to make land selections of the 44 e6acre granted under the act. In some cases Native corporations received outside aid in surveying the land. For instance, Doyon, Limited (one of the 13 regional corporations) was helped by the Geophysical Institute of the University of Alaska. The Institute determined which land contained resources such as minerals and coal. NASA similarly provided satellite imagery to aid in Native corporations finding areas most suited for vegetation and their traditional subsistence culture. The imagery showed locations of caribou and moose, as well as forests with marketable timber. In total about 7 e6acre were analyzed for Doyon. Natives were able to choose tens of thousands of acres of land rich with timber while Doyon used mineral analysis to attract businesses.\n\nThe state of Alaska to date has been granted approximately 85% or 90 e6acre  of the land claims it has made under ANCSA. The state is entitled to a total of  under the terms of the Statehood Act. Originally the state had 25 years after passage of the Alaska Statehood Act to file claims under section 6 of the act with the Bureau of Land Management (BLM). Amendments to ANCSA extended that deadline until 1994, with the expectation that BLM would complete processing of land transfers subject to overlapping Native claims by 2009. Nonetheless, some Native and state selections under ANCSA remained unresolved as late as December 2014.\n\nCriticism of ANCSA\n\nThere was largely positive reaction to ANCSA, although not entirely. The act was supported by Natives as well as non-Natives, and likewise enjoyed bipartisan support. Natives were heavily involved in the legislative process, and the final draft of the act used many AFN ideas. \n\nSome Natives have argued that ANCSA has hastened cultural genocide of Alaska Natives. Some Natives critiqued ANCSA as an illegitimate treaty since only tribal leaders were involved and the provisions of the act were not voted on by indigenous populations. One native described it as a social and political experiment. Critics have also argued that Natives so feared massacre or incarceration that they offered no resistance to the act. \n\nOthers have argued that the settlement was arguably the most generous afforded by the United States to a Native group. They note that some of the largest and most profitable corporations in the state are the twelve created by ANCSA. Other critics attacked the act as \"Native welfare\" and such complaints continue to be expressed. \n\nThe corporation system has been critiqued, as in some cases stockholders have sold land to outside corporations that have leveled forests and extracted minerals. But supporters of the system argue that it has provided economic benefits for indigenous peoples that outweigh these problems.\n\nSelected provisions of ANCSA\n\n* Native claims in Alaska were extinguished by means of section 4 of ANCSA.\n* In exchange for abrogating Native claims, approximately one-ninth of the state's land plus $962.5 million were distributed to more than 200 local Alaska Native \"village corporations\" established under section 8, in addition to 12 land-owning for-profit Alaska Native \"regional corporations\" and a non-land-owning thirteenth corporation for Alaska Natives who had left the state established under section 6.\n* Of the compensation monies, $462.5 million was to come from the federal treasury and the rest from oil revenue-sharing.\n* Settlement benefits would accrue to those with at least one-fourth Native ancestry under sections 3(b) and 5(a).\n* Of the approximately 80,000 Natives enrolled under ANCSA, those living in villages (approximately two-thirds of the total) would receive 100 shares in both a village and a regional corporation.\n* The remaining one-third would be \"at large\" shareholders with 100 shares in a regional corporation with additional rights to revenue from regional mineral and timber resources.\n* The Alaska Native Allotment Act was revoked but with the proviso that pending claims under that act would continue to be processed under section 18. Successful applicants would be excluded under ANCSA by section 14(h)(5) from land to be used for a primary residence.\n* The twelve regional corporations within the state would administer the settlement.\n* A thirteenth corporation composed of Natives who had left the state would receive compensation but not land.\n* Surface rights to 44 e6acre were patented to the Native village and regional corporations under sections 12(c), as well as 14(h)(1) and (8).\n* The surface rights to the patented land were granted to the village corporations and the subsurface right to the land were granted to the regional corporation, creating a split estate pursuant to section 14(f).\n\nAlaska Native regional corporations\n\nThe following thirteen regional corporations were created under ANCSA:\n* Ahtna, Incorporated\n* The Aleut Corporation \n* Arctic Slope Regional Corporation \n* Bering Straits Native Corporation \n* Bristol Bay Native Corporation \n* Calista Corporation\n* Chugach Alaska Corporation\n* Cook Inlet Region, Inc. \n* Doyon, Limited\n* Koniag, Incorporated\n* NANA Regional Corporation \n* Sealaska Corporation\n* The 13th Regional Corporation\n\nAdditionally, most regions and some villages have created their own nonprofits providing social services and health care through grant funding and federal compacts. The objectives of these nonprofits are varied, but focus generally on cultural and educational activities. These include scholarships for Native students, sponsorship of cultural and artistic events, preservation efforts for Native languages, and protection of sites with historic or religious importance.\n\nAlaska Native village and urban corporations\n\nANCSA created about 224 village and urban corporations. Below is a representative list of village and urban corporations created under ANCSA:\n* Ukpeaġvik Iñupiat Corporation, village corporation for Utqiaġvik\n* [http://www.bnc-alaska.com Bethel Native Corporation], village corporation for Bethel\n* [http://www.capefoxcorp.com Cape Fox Corporation], village corporation for Saxman\n* [http://www.deloycheet.com/ Deloycheet, Inc.], village corporation for Holy Cross\n* Huna Totem Corporation, village corporation for Hoonah\n* [http://www.haidacorporation.com Haida Corporation], village corporation for Hydaburg\n* [http://www.goldbelt.com/ Goldbelt, Inc.], urban corporation for Juneau\n* [http://www.pvil.com Paug-Vik, Inc. Ltd.], village corporation for Naknek\n* [http://www.chenega.com Chenega Corporation], village corporation for Chenega\n* [http://www.afognak.com/ Afognak Native Corporation], village corporation for Afognak and Port Lions\n* [http://www.kavilco.com/ Kavilco Incorporated], village corporation for Kasaan\n* [http://www.adn.com/article/20120810/klukwan-files-bankruptcy Klukwan, Inc.], village corporation for Klukwan\n* [http://www.kuskokwim.com/ The Kuskokwim Corporation], village corporation for Aniak, Crooked Creek, Georgetown, Kalskag, Lower Kalskag, Napaimute, Red Devil, Russian Mission, Sleetmute and Stony River\n* [http://www.nativesofkodiak.com/ Natives of Kodiak, Inc.], urban corporation for Kodiak\n* Ounalashka Corporation, village corporation for Unalaska\n* [http://www.ouzinkienativecorporation.com/ Ouzinkie Native Corporation], village corporation for Ouzinkie\n* [http://www.sheeatika.com/ Shee Atika, Incorporated], urban corporation for Sitka. Alaska Native Claims Settlement Act. http://en.wikipedia.org/?curid=3035."
  }
}
