{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15916",
  "eid" : "21974c20-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778565602,
  "textBody" : "Jean-Michel Basquiat (; December 22, 1960 – August 12, 1988) was an American artist. Basquiat first achieved fame as part of SAMO, an informal graffiti duo who wrote enigmatic epigrams in the cultural hotbed of the Lower East Side of Manhattan during the late 1970s where the hip hop, punk, and street art movements had coalesced. By the 1980s, he was exhibiting his neo-expressionist paintings in galleries and museums internationally. The Whitney Museum of American Art held a retrospective of his art in 1992.\n\nBasquiat's art focused on \"suggestive dichotomies\", such as wealth versus poverty, integration versus segregation, and inner versus outer experience.Hoffman, Fred. (2005) The Defining Years: Notes on Five Key Works from the book Basquiat. Mayer, Marc (ed.). Merrell Publishers in association with the Brooklyn Museum, , pp. 129–139. He appropriated poetry, drawing, and painting, and married text and image, abstraction, figuration, and historical information mixed with contemporary critique.Sirmans, Franklin. (2005) In the Cipher: Basquiat and Hip Hop Culture from the book Basquiat. Mayer, Marc (ed.). Merrell Publishers in association with the Brooklyn Museum, , pp. 91–105.\n\nBasquiat used social commentary in his paintings as a \"springboard to deeper truths about the individual\", as well as attacks on power structures and systems of racism, while his poetics were acutely political and direct in their criticism of colonialism and support for class struggle. He died of a heroin overdose at his art studio at age 27.\n\nOn May 18, 2017, at a Sotheby's auction, Basquiat's 1982 painting, also Untitled, created with oil stick and spray paint and depicting a skull, set a new record high for any U.S. artist at auction, selling for $110,500,000.\n\nEarly life\n\nJean-Michel Basquiat was born in Brooklyn, New York, on December 22, 1960, shortly after the death of his elder brother, Max. He was the second of four children of Matilde Andrades (July 28, 1934 – November 17, 2008)[http://www.hst1066.com/comm/2008_09/185/Matilde.pdf \"In Loving Memory: Matilde Basquiat\"], Lodge Communications 185, Harry S Truman Lodge No.1066, F.&A.M., December 4, 2008. New York, NY. Sad Tidings for Brother John Andrades. and Gérard Basquiat (1930 – July 7, 2013).[http://www.dnainfo.com/new-york/20130905/boerum-hill/jean-michel-basquiats-dad-leaves-behind-sons-art-tax-problem \"Jean-Michel Basquiat's Dad Leaves Behind Son's Art, and Tax Problem\"]  by James Fanelli, September 5, 2013, 6:27am.[https://www.nytimes.com/books/98/08/09/reviews/980809.09boswort.html Hyped to Death] by The New York Times (August 9, 1998). He had two younger sisters: Lisane, born in 1964, and Jeanine, born in 1967.\n\nHis father, Gérard Basquiat, was born in Port-au-Prince, Haiti, and his mother, Matilde Basquiat, who was of Puerto Rican descent, was born in Brooklyn, New York. Matilde instilled a love for art in her young son by taking him to art museums in Manhattan and enrolling him as a junior member of the Brooklyn Museum of Art. Basquiat was a precocious child who learned how to read and write by age four and was a gifted artist. His teachers, such as artist Jose Machado, noticed his artistic abilities, and his mother encouraged her son's artistic talent. By the age of 11, Basquiat was fully fluent in French, Spanish and English. In 1967, Basquiat started attending Saint Ann's, an arts-oriented exclusive private school.Phoebe Hoban, [https://www.nytimes.com/1996/08/18/movies/one-artist-imitating-another.html?pagewanted\nall \"One Artist Imitating Another,\"] The New York TimesArthur C. Danto, [https://www.thenation.com/article/flyboy-buttermilk/ \"Flyboy in the Buttermilk,\"] \"The Nation\"Lisa J. Curtis, [http://www.brooklynpaper.com/stories/28/16/28_16basquiat.html \"Homecoming: Fort Greene's poet-painter Basquiat is fondly remembered,\"] \"Brooklyn Paper\" He drew with Marc Prozzo, a friend from St. Ann's; they together created a children's book, written by Basquiat and illustrated by Prozzo. Basquiat became an avid reader of Spanish, French, and English texts and a more than competent athlete, competing in track events.\n\nIn September 1968, at the age of seven, Basquiat was hit by a car while playing in the street. His arm was broken and he suffered several internal injuries, and he eventually underwent a splenectomy. While he was recuperating from his injuries, his mother brought him the Gray's Anatomy book to keep him occupied. This book would prove to be influential in his future artistic outlook. His parents separated that year and he and his sisters were raised by their father.[http://lindsaypollock.com/news/basquiat-estate-sells-at-sothebys/ Basquiat's Estate Sells at Sotheby's]  by Lindsay Pollock (March 31, 2010). The family resided in Boerum Hill, Brooklyn, for five years, then moved to San Juan, Puerto Rico in 1974. After two years, they returned to New York City.\n\nWhen he was 13, his mother was committed to a mental institution and thereafter spent time in and out of institutions.Fretz, Eric. [http://www.basquiatbiography.com/jean-michel-basquiat-a-biography Jean-Michel Basquiat: A Biography] . Greenwood Press, 2010. . Cf. [https://books.google.com/books?ei3L1nT5fMKem70AGR6ZiACQ&id\nXDsYOhjGVDIC&dqJean-Michel+Basquiat%3A+A+Biography.&q\nmental+institutions#vsnippet&q\nmental%20institutions&ffalse p. xv] At 15, Basquiat ran away from home. He slept on park benches in Tompkins Square Park, and was arrested and returned to the care of his father within a week.\n\nBasquiat dropped out of Edward R. Murrow High School in the tenth grade and then attended City-As-School, an alternative high school in Manhattan home to many artistic students who failed at conventional schooling. His father banished him from the household for dropping out of high school and Basquiat stayed with friends in Brooklyn. He supported himself by selling T-shirts and homemade post cards.\n\nCareer\n\nBasquiat went from being homeless and unemployed to selling a single painting for up to $25,000 in a matter of several years.\n\nIn 1976, Basquiat and friend Al Diaz began spray painting graffiti on buildings in Lower Manhattan, working under the pseudonym SAMO. The designs featured inscribed messages such as \"Plush safe he think.. SAMO\" and \"SAMO as an escape clause\". In 1978, Basquiat worked for the Unique Clothing Warehouse in their art department at 718 Broadway in NoHo and at night he began \"SAMO\" painting his original graffitiHarvey Russack, founder, owner, and CEO of Unique Clothing Warehouse 1971–1992.  art on neighborhood buildings. Unique's founder Harvey Russack discovered Basquiat painting a building one night, they became friends, and he offered him a day job. On December 11, 1978, The Village Voice published an article about the graffiti.Faflick, Philip. \"The SAMO Graffiti… Boosh-Wah or CIA?\" Village Voice, December 11, 1978: p. 41. When Basquiat and Diaz ended their friendship, The SAMO project ended with the epitaph \"SAMO IS DEAD\", inscribed on the walls of SoHo buildings in 1979.Cf. Fretz, pp. 46–47.\n\nIn 1979, Basquiat appeared on the live public-access television show TV Party hosted by Glenn O'Brien, and the two started a friendship. Basquiat made regular appearances on the show over the next few years. That same year, Basquiat formed the noise rock band Test Pattern – which was later renamed Gray – which played at Arleen Schloss's open space, \"Wednesdays at A's\", where in October 1979 Basquiat showed, among others, his SAMO color Xerox work.\n\nGray also consisted of Shannon Dawson, Michael Holman, Nick Taylor, Wayne Clifford and Vincent Gallo, and the band performed at nightclubs such as Max's Kansas City, CBGB, Hurrah and the Mudd Club. In 1980, Basquiat starred in O'Brien's independent film Downtown 81, originally titled New York Beat. That same year, Basquiat met Andy Warhol at a restaurant. Basquiat presented to Warhol samples of his work, and Warhol was stunned by Basquiat's genius and allure. The two artists later collaborated. Downtown 81 featured some of Gray's recordings on its soundtrack.[ Andy Kellman. Downtown 81 Original Soundtrack]. Retrieved January 16, 2008. Basquiat also appeared in the 1981 Blondie music video \"Rapture,\" in a role originally intended for Grandmaster Flash,[http://www.vh1.com/shows/dyn/pop_up_video/50274/episode_about.jhtml \"Rock Meets Rap\"] on Pop-Up Video. as a nightclub disc jockey.\n\nThe early 1980s were Basquiat's breakthrough as a solo artist. In June 1980, Basquiat participated in The Times Square Show, a multi-artist exhibition sponsored by Collaborative Projects Incorporated (Colab) and Fashion Moda. In September of the same year, Basquiat joined the Annina Nosei gallery and worked in a basement below the gallery toward his first one-man show, which took place in March 1981 with great success. In December 1981, René Ricard published \"The Radiant Child\" in Artforum magazine,[http://www.smartwentcrazy.com/basquiat/text/jmb_radiantchild.htm Rene Ricard. \"The Radiant Child\", Artforum, Volume XX No. 4, December 1981. pp. 35–43]  which brought Basquiat to the attention of the art world.\n\nIn March 1982 he worked in Modena, Italy, and from November, Basquiat worked from the ground-floor display and studio space Larry Gagosian had built below his Venice, California, home and commenced a series of paintings for a 1983 show, his second at Gagosian Gallery, then in West Hollywood.Fred Hoffman (March 13, 2005), [http://articles.latimes.com/2005/mar/13/entertainment/ca-basquiat13 Basquiat's L.A. – How an '80s interlude became a catalyst for an artist's evolution] Los Angeles Times. He brought along his girlfriend, then unknown aspiring singer Madonna. Gagosian recalls, “Everything was going along fine. Jean-Michel was making paintings, I was selling them, and we were having a lot of fun. But then one day Jean-Michel said, ‘My girlfriend is coming to stay with me.’ I was a little concerned-one too many eggs can spoil an omelet, you know? So I said, ‘Well, what’s she like?’ And he said, He said, ‘Her name is Madonna and she’s going to be huge.’ I’ll never forget that he said that. So Madonna came out and stayed for a few months and we all got along like one big, happy family.” During this time he took considerable interest in the work that Robert Rauschenberg was producing at Gemini G.E.L. in West Hollywood, visiting him on several occasions and finding inspiration in the accomplishments of the painter. In 1982, Basquiat worked briefly with musician and artist David Bowie.\n\nIn 1983, Basquiat produced a 12\" rap single featuring hip-hop artists Rammellzee and K-Rob. Billed as Rammellzee vs. K-Rob, the single contained two versions of the same track: \"Beat Bop\" on side one with vocals and \"Beat Bop\" on side two as an instrumental. The single was pressed in limited quantities on the one-off Tartown Record Company label. The single's cover featured Basquiat's artwork, making the pressing highly desirable among both record and art collectors.\n\nAt the suggestion of Swiss dealer Bruno Bischofberger, Warhol and Basquiat worked on a series of collaborative paintings between 1983 and 1985. In the case of Olympic Rings (1985), Warhol made several variations of the Olympic five-ring symbol, rendered in the original primary colors. Basquiat responded to the abstract, stylized logos with his oppositional graffiti style.[http://www.gagosian.com/exhibitions/april-21-2012--jean-michel-basquiat Jean-Michel Basquiat and Andy Warhol: Olympic Rings, June 19 – August 11, 2012] Gagosian Gallery, London.\n\nBasquiat often painted in expensive Armani suits and would even appear in public in the same paint-splattered clothes.[https://books.google.com/books?idW7yF6cGfghoC&printsec\nfrontcover&dqcreole+traditions&ei\no6gLSrejFYPMzATGib3TAw Randy P. Conner, David Hatfield Sparks, Queering Creole Spiritual Traditions], Haworth Press, 2004, p. 299. \n\nArtistic styles\n\nFred Hoffman hypothesizes that underlying Basquiat's sense of himself as an artist was his \"innate capacity to function as something like an oracle, distilling his perceptions of the outside world down to their essence and, in turn, projecting them outward through his creative acts.\" Additionally, continuing his activities as a graffiti artist, Basquiat often incorporated words into his paintings. Before his career as a painter began, he produced punk-inspired postcards for sale on the street, and became known for the political–poetical graffiti under the name of SAMO. On one occasion Basquiat painted his girlfriend's dress with the words \"Little Shit Brown\". He would often draw on random objects and surfaces, including other people's property. The conjunction of various media is an integral element of Basquiat's art. His paintings are typically covered with text and codes of all kinds: words, letters, numerals, pictograms, logos, map symbols, diagrams and more.\n\nA middle period from late 1982 to 1985 featured multi-panel paintings and individual canvases with exposed stretcher bars, the surface dense with writing, collage and imagery. The years 1984–85 were also the main period of the Basquiat–Warhol collaborations, even if, in general, they were not very well received by the critics.\n\nA major reference source used by Basquiat throughout his career was the book Gray's Anatomy, which his mother had given him while he was in the hospital at age seven. It remained influential in his depictions of internal human anatomy, and in its mixture of image and text. Other major sources were Henry Dreyfuss' Symbol Sourcebook, Leonardo da Vinci's notebooks, and Brentjes' African Rock Art.\n\nBasquiat doodled often and some of his later pieces exhibited this; they were often colored pencil on paper with a loose, spontaneous, and dirty style much like his paintings. His work across all mediums displays a childlike fascination with the process of creating.\n\nHeads\n\nHeads are seen as a major focal point of some of Basquiat's most seminal works. Two pieces, \"Untitled (Head)\" 1981 and \"Untitled (Head)\" 1982, held by by the Broad Foundation and Maezawa Foundation respectively can be seen as primary examples. In reference to the potent image depicted in both pieces, Fred Hoffman writes that Basquiat was likely, \"caught off guard, possibly even frightened, by the power and energy emanating from this unexpected image.” Hoffman, Fred. “The Defining Years: Notes on Five Key Works,” in Ibid., p. 13) Further investigation by Fred Hoffman of pieces like \"Masonic Lodge\" 1983 and Untitled (1983) in his book \"The Art of Jean-Michel Basquiat\" reveals a deeper interest in the artist's fascination with heads that proves an evolution in the artist's oeuvre from one of raw power to one of more refined cognizance. Hoffman, Fred. \"The Art of Jean-Michel Basquiat\", Gallerie Enrico Navarra / 2017\n\nHeritage depicted in art\n\nAccording to Andrea Frohne, Basquiat's 1983 painting Untitled (History of the Black People) \"reclaims Egyptians as African and subverts the concept of ancient Egypt as the cradle of Western Civilization\". At the center of the painting, Basquiat depicts an Egyptian boat being guided down the Nile River by Osiris, the Egyptian god of the earth and vegetation.\n\nOn the right panel of the painting appear the words \"Esclave, Slave, Esclave\". Two letters of the word \"Nile\" are crossed out and Frohne suggests that, \"The letters that are wiped out and scribbled over perhaps reflect the acts of historians who have conveniently forgotten that Egyptians were black and blacks were enslaved.\" On the left panel of the painting Basquiat has illustrated two Nubian-style masks. The Nubians historically were darker in skin color, and were considered to be slaves by the Egyptian people.\n\nThroughout the rest of the painting, images of the Atlantic slave trade are juxtaposed with images of the Egyptian slave trade centuries before. The sickle in the center panel is a direct reference to the slave trade in the United States, and slave labor under the plantation system. The word \"salt\" that appears on the right panel of the work refers to the Atlantic slave trade, as salt was another important commodity traded at that time.\n\nAnother of Basquiat's pieces, Irony of Negro Policeman (1981), is intended to illustrate how he believes African-Americans have been controlled by a predominantly Caucasian society. Basquiat sought to portray that African-Americans have become complicit with the \"institutionalized forms of whiteness and corrupt white regimes of power\" years after the Jim Crow era had ended. Basquiat found the concept of a \"Negro policeman\" utterly ironic. According to him the policeman should sympathize with his black friends, family, and ancestors, yet instead he was there to enforce the rules designed by \"white society.\" The Negro policeman had \"black skin but wore a white mask\". In the painting, Basquiat depicted the policeman as large in order to suggest an \"excessive and totalizing power\", but made the policeman's body fragmented and broken.\n\nThe hat that frames the head of the Negro policeman resembles a cage, and represents what Basquiat believes are the constrained independent perceptions of African-Americans at the time, and how constrained the policeman's own perceptions were within white society. Basquiat drew upon his Haitian heritage by painting a hat that resembles the top hat associated with the ' family of ', who embody the powers of death in Vodou.\n\nHowever, Kellie Jones, in her essay Lost in Translation: Jean-Michel in the (Re)Mix, posits that Basquiat's \"mischievous, complex, and neologistic side, with regard to the fashioning of modernity and the influence and effluence of black culture\" are often elided by critics and viewers, and thus \"lost in translation.\"Lost in Translation: Jean-Michel in the (Re)Mix, by Kellie Jones, from the book Basquiat, edited by Marc Mayer, 2005, Merrell Publishers in association with the Brooklyn Museum, , pp. 163–179.\n\nThe art historian Olivier Berggruen situates in Basquiat's anatomical screen prints, titled Anatomy, an assertion of vulnerability, one which \"creates an aesthetic of the body as damaged, scarred, fragmented, incomplete, or torn apart, once the organic whole has disappeared. Paradoxically, it is the very act of creating these representations that conjures a positive corporeal valence between the artist and his sense of self or identity.\"\n\nExhibitions\n\nBasquiat's first public exhibition was in the group effort The Times Square Show (with David Hammons, Jenny Holzer, Lee Quiñones, Kenny Scharf and Kiki Smith among others), held in a vacant building at 41st Street and Seventh Avenue, New York. In late 1981, Basquiat joined the Annina Nosei gallery in SoHo; his first one-person exhibition was in 1982 at that gallery.[http://www.moma.org/collection/artist.php?artist_id=370 Jean-Michel Basquiat] MoMA Collection, New York. By then, he was showing regularly alongside other Neo-expressionist artists including Julian Schnabel, David Salle, Francesco Clemente and Enzo Cucchi. He was represented in Los Angeles by the Gagosian gallery and throughout Europe by Bruno Bischofberger.\n\nMajor exhibitions of Basquiat's work have included Jean-Michel Basquiat: Paintings 1981–1984 at the Fruitmarket Gallery, Edinburgh (1984), which traveled to the Institute of Contemporary Arts, London, and Museum Boijmans Van Beuningen, Rotterdam, in 1985); the Kestnergesellschaft, Hannover (1987, 1989). The first retrospective to be held of his work was the Jean-Michel Basquiat exhibition at the Whitney Museum of American Art from October 1992 to February 1993. It subsequently traveled to the Menil Collection, Houston; the Des Moines Art Center, Iowa; and the Montgomery Museum of Fine Arts, Alabama, from 1993 to 1994. The catalog for this exhibition,Marshall, Richard. Jean-Michel Basquiat, Abrams / Whitney Museum of American Art, 1992 (out of print). edited by Richard Marshall and including several essays of differing styles, was a groundbreaking piece of scholarship into Basquiat's work and still is a major source. Another exhibition, Basquiat, was mounted by the Brooklyn Museum, New York, in 2005, and traveled to the Museum of Contemporary Art, Los Angeles, and the Museum of Fine Arts, Houston.Mayer, Marc, Hoffman Fred, et al. Basquiat, Merrell Publishers / Brooklyn Museum, 2005. From October 2006 to January 2007, the first Basquiat exhibition in Puerto Rico took place at the Museo de Arte de Puerto Rico (MAPR), produced by ARTPREMIUM, Corinne Timsit and Eric Bonici. Brooklyn Museum exhibited Basquiat: The Unknown Notebooks in April–August 2015. In 2017, the Barbican Centre in London exhibited [https://www.barbican.org.uk/whats-on/2017/event/basquiat-boom-for-real Basquiat: Boom for Real].\nReviews\n\nIn a review for The Telegraph, critic Hilton Kramer starts his first paragraph by stating that Basquiat had no idea what the word “quality” meant. The praises to follow are in the lines of “talentless hustler” and “street-smart but otherwise invincibly ignorant” arguing that art dealers of the time were “as ignorant about art as Basquiat himself.” Saying that Jean-Michel’s work never rose above that “lowly artistic station” of graffiti even when his paintings were selling for giant prices only proves of his childish appreciation of art. Thinking there was some type of cult Kramer states: “As a result of the campaign waged by these art-world entrepreneurs on Basquiat's behalf - and their own, of course - there was never any doubt that the museums, the collectors and the media would fall into line“ when talking about the marketization of Basquiat’s name.\n\nArt critic Bonnie Rosenberg compares Basquiat's work to the emergence of American Hip Hop during the same era. She also mentions how Basquiat experienced a good taste of fame in his last years when he was a “critically embraced and popularly celebrated artistic phenomenon.” Rosenberg remarked that some people focused on the “superficial exoticism of his work” missing the fact that it “held important connections to expressive precursors.”\n\nShortly after his death, the New York Times indicated that Basquiat was “the most famous of only a small number of young black artists who have achieved national recognition.”\n\nFinal years and death\n\nBy 1986, Basquiat had left the Annina Nosei gallery and was showing at the Mary Boone gallery in SoHo. On February 10, 1985, he appeared on the cover of The New York Times Magazine in a feature titled \"New Art, New Money: The Marketing of an American Artist\".Cathleen McGuigan, \"New Art, New Money\" The New York Times Magazine, February 2005. He was a successful artist in this period, but his growing heroin addiction began to interfere with his personal relationships.\n\nDespite an attempt at sobriety during a trip to Maui, Hawaii, he died on August 12, 1988, of a heroin overdose at his art studio on Great Jones Street in Manhattan's NoHo neighborhood. He was 27 years old.\n\nBasquiat was interred in Brooklyn's Green-Wood Cemetery, where Jeffrey Deitch made a speech at the graveside. Among those speaking at Basquiat's memorial held at Saint Peter's Church on November 3, 1988, were Ingrid Sischy who, as the editor of Artforum in the 1980s, got to know the artist well and commissioned a number of articles that introduced his work to the wider world. Suzanne Mallouk recited sections of A. R. Penck's \"Poem for Basquiat\" and Fab 5 Freddy read a poem by Langston Hughes.[https://www.nytimes.com/books/first/h/hoban-basquiat.html Phoebe Hoban: Basquiat – A Quick Killing in Art] The New York Times Books. The 300 guests included musicians John Lurie and Arto Lindsay; artist Keith Haring; poet David Shapiro; Glenn O'Brien, a writer; Fab 5 Freddy; and members of the band Gray, which Basquiat led in the late 1970s.[https://www.nytimes.com/1988/11/03/arts/basquiat-memorial.html \"Basquiat Memorial\", The New York Times, November 3, 1988] In memory of the late artist, Keith Haring created Pile of Crowns for Jean-Michel Basquiat (1988).\n\nLegacy\n\nIn literature \n\nIn 1991, poet Kevin Young produced a book, To Repel Ghosts, a compendium of 117 poems relating to Basquiat's life, individual paintings, and social themes found in the artist's work. He published a \"remix\" of the book in 2005.Kevin Young, To Repel Ghosts (1st edition), Zoland Books, 2001.\n\nIn 1995, writer, Jennifer Clement, wrote the book Widow Basquiat, based on the stories told to her by Suzanne Mallouk.\n\nIn 2005, poet M. K. Asante published the poem \"SAMO\", dedicated to Basquiat, in his book Beautiful. And Ugly Too.\n\nIn film \n\nBasquiat starred in Downtown 81, a vérité movie written by Glenn O'Brien and shot by Edo Bertoglio in 1981, but not released until 1998.[http://www.gagosian.com/exhibitions/jean-michel-basquiat--february-07-2013 Jean-Michel Basquiat, February 7 – April 6, 2013] Gagosian Gallery, New York. In 1996, eight years after the artist's death, a biographical film titled Basquiat was released, directed by Julian Schnabel, with actor Jeffrey Wright playing Basquiat. David Bowie played the part of Andy Warhol. Schnabel was interviewed during the film's script development as a personal acquaintance of Basquiat. Schnabel then purchased the rights to the project, believing that he could make a better film.\"Meet the Artist: Julan Schnabel\", lecture given at Hirshhorn Museum, Washington, DC, May 13, 2011.\n\nIn 2006 the Equality Forum featured Jean-Michel Basquiat during LGBT history month.\n\nA 2009 documentary film, Jean-Michel Basquiat: The Radiant Child, directed by Tamra Davis, was first screened as part of the 2010 Sundance Film Festival and was shown on the PBS series Independent Lens in 2011. Tamra Davis discussed her friendship with Basquiat in a Sotheby's video, [http://www.sothebys.com/en/news-video/videos/2017/basquiat--through-the-eyes-of-a-friend.html Basquiat: Through the Eyes of a Friend].\n\nIn music \n\nShortly after Basquiat's death, Vernon Reid of New York heavy metal band Living Colour wrote a song called \"Desperate People\", released on their album Vivid. The song primarily addresses the drug scene of New York at that time. Vernon states that Basquiat's death inspired him to write the song after receiving a phone call from Greg Tate informing Vernon of Basquiat's death.\n\nBasquiat is referenced in Jay Z and Frank Ocean's song \"Oceans\": \"I hope my black skin don't dirt this white tuxedo before the Basquiat show\" in the 2013 album Magna Carta Holy Grail. Both Jay-Z and Kanye West made reference to Basquiat on their 2011 collaborative album Watch the Throne. In \"Illest Motherfucker Alive\", Jay Z raps \"Basquiats, Warhols serving as my muses\" and in \"That's My Bitch\", Jay Z Raps \"Basquiat, we learning a new word its yacht\". Jay Z also mentions him on his 2013 album Magna Carta Holy Grail when he says \"Yellow Basquiat in my kitchen corner go 'head, lean on that shit Blue, you own it\". In his verse on Lil Wayne's song \"John\", Rick Ross raps \"Red on the wall, Basquiat when I paint\".\n\nIn the song \"Ten Thousand Hours\", Macklemore raps: \"I observed Escher, I love Basquiat\", and on his song \"Victory Lap\" raps: \"unorthodox, like Basquiat with a pencil\". In his song \"Die Like a Rockstar\", about overdosing, Danny Brown raps \"Basquiat freestyle\" to hype himself up. Canadian artist The Weeknd has stated in interviews that his trademark haircut was inspired by Basquiat. ASAP Rocky mentions Basquiat in his song \"Phoenix\", rapping \"Painting vivid pictures/call me Basquiat, Picasso\". Rapper Robb Bank$ has a song titled \"Look Like Basquiat\". Korean rapper Jazzy Ivy released the single/album \"Jean & Andy\" inspired by Jean-Michel Basquiat and Andy Warhol. \"Rich Niggaz\" on J. Cole's second album Born Sinner he raps: \"It's like Sony signed Basquiat\". Referencing his parent label, Sony, he compares Basquiat to himself in the change in their works after signing to a major label. On his song \"Untitled\", Killer Mike compares himself to Basquiat and 2Pac, saying \"This is Basquiat with a passion like Pac\". On the track Moments by Kidz in the Hall from their Semester Abroad mixtape Naledge says \"look inside myself I think I see a masterpiece, a little Basquiat mix a little Master P\".\n\nKorean rapper T.O.P references Basquiat in his 2013 single \"DOOM DADA\", when he says \"MIC-reul jwin shindeullin, rap Basquiat\", which translates as: \"A god-given rap Basquiat with a mic.\" On his mixtape Black Hystori Project, Cyhi the Prynce features a song called \"Basquiat\". Nicki Minaj mentioned Basquiat on her single \"Lookin Ass\", featured on the Young Money collaborative album Rise Of An Empire. In Riff Raff's \"Gucci Jacuzzi\", Lil' Flip says \"You know I'm makin' guap, and my painting in my kitchen was made by Basquiat\". Madonna references Basquiat in the song \"Graffiti Heart\" from the super deluxe edition of her album Rebel Heart. The band Fall Out Boy used the Basquiat crown as a part of their logo in 2013. It is still being used. Robb Bank$ compares himself thoroughly to Basquiat in his song \"Look like Basquiat\". Basquiat was referenced in the Gym Class Heroes' song, \"To Bob Ross with Love\". Hip-hop artist Yasiin Bey released a song dedicated to Basquiat, titled \"Basquiat Ghostwriter\". Bey says he was inspired by the paintings and writings of the artist.\n\nIn the world of jazz, clarinetist Don Byron composed and performed the tune \"Basquiat\" on his 2000 album A Fine Line: Arias and Lieder.\n\nBasquiat's work has been used by clothing companies such as SPRZ NY of Uniqlo, Urban Outfitters, and Redbubble.\n\nCollections\n\nNotable private collectors of Basquiat's work include David Bowie, Mera and Donald Rubell, Lars Ulrich, Steven A. Cohen, Laurence Graff, John McEnroe, Madonna, Debbie Harry, Leonardo DiCaprio, Swizz Beatz, Jay-Z and Johnny Depp.France, Lisa Respers (June 10, 2016). [http://www.cnn.com/2016/06/10/entertainment/johnny-depp-basquiat-auction/index.html \"Johnny Depp auctioning off multimillion-dollar art collection\"]. CNN.com. Retrieved June 11, 2016.\n\nArt market\n\nBasquiat sold his first painting in 1981, and by 1982, spurred by the Neo-Expressionist art boom, his work was in great demand. In 1985, he was featured on the cover of The New York Times Magazine in connection with an article on the newly exuberant international art market; this was unprecedented for an African-American artist, and for an artist so young. Since Basquiat's death in 1988, his market has developed steadily – in line with overall art market trends – with a dramatic peak in 2007 when, at the height of the art market boom, the global auction volume for his work was over $115 million. Brett Gorvy, deputy chairman of Christie's, is quoted describing Basquiat's market as \"two-tiered. [...] The most coveted material is rare, generally dating from the best period, 1981–83.\"Georgina Adam and Gareth Harris (June 17, 2010), [http://theartnewspaper.com/articles/Basquiat-comes-of-age/21078 Basquiat comes of age] The Art Newspaper. \n\nIn 2001 New York artist and con-artist Alfredo Martinez was charged by the Federal Bureau of Investigation with attempting to deceive two art dealers by selling them $185,000 worth of fake drawings put forth as being the work of Basquiat. The charges against Martinez, which landed him in Manhattan's Metropolitan Correction Center  on June 19, 2002, involved an alleged scheme to sell fake Basquiat drawings, accompanied by forged certificates of authenticity.\n\nUntil 2002, the highest amount paid for an original work of Basquiat's was US$3,302,500, set on November 12, 1998, at Christie's. In 2002, Basquiat's Profit I (1982), a large piece measuring , was set for auction again at Christie's by drummer Lars Ulrich of the heavy metal band Metallica. It sold for US$5,509,500. The proceedings of the auction are documented in the film Some Kind of Monster.\n\nIn 2008, at another auction at Christie's, Ulrich sold a 1982 Basquiat piece, Untitled (Boxer), for US $13,522,500 to an anonymous telephone bidder. Another record price for a Basquiat painting was made in 2007, when an untitled Basquiat work from 1981 sold at Sotheby's in New York for US$14.6 million. In 2012, for the second year running, Basquiat was the most coveted contemporary (i.e. born after 1945) artist at auction, with €80 million in overall sales.Charlotte Burns and Julia Michalska (October 11, 2012), Artprice survey reveals the twin peaks of power, The Art Newspaper. That year, his Untitled (1981), a painting of a haloed, black-headed man with a bright red skeletal body, depicted amid the artist's signature scrawls, was sold by Robert Lehrman for $16.3 million, well above its $12 million high estimate.Carol Vogel (May 10, 2012), [https://www.nytimes.com/2012/05/11/nyregion/basquiat-painting-brings-16-3-million-at-phillips-sale.html Basquiat Painting Brings $16.3 Million at Phillips Sale] The New York Times. A similar untitled piece, also undertaken in 1981 and formerly owned by the Israel Museum, sold for £12.92 million at Christie's London, setting a world auction record for Basquiat's work.Souren Melikian (June 29, 2012), [https://www.nytimes.com/2012/06/30/arts/30iht-melikian30.html Wary Buyers Still Pour Money Into Contemporary Art] International Herald Tribune. In 2013, Basquiat's piece Dustheads sold for $48.8 million at Christie's. In 2016 an untitled piece sold at Christie's for $57.3 million to a Japanese businessman and collector, Yusaku Maezawa.Robin Pogrebin, The New York Times May 15, 2016\n\nIn 2017, Yusaku purchased Basquiat's Untitled (1982), a powerful depiction of a skull, at auction for a record-setting US$110,487,500--the most ever paid for an American artwork and the sixth most expensive artwork sold at an auction, surpassing Andy Warhol's \"Silver Car Crash (Double Disaster)\" which sold in 2013 for $105 million.\n\nAuthentication Committee\n\nThe Authentication Committee of the Estate of Jean-Michel Basquiat was formed by the gallery that was assigned to handle the artist's estate.Daniel Grant (September 29, 1996), [http://articles.baltimoresun.com/1996-09-29/news/1996273100_1_specific-artists-contemporary-artists-artist-widow/2 The tricky art of authentication] Baltimore Sun. Between 1994 and 2012, it reviewed over 2,000 works of art; the cost of the committee's opinion was $100. The committee was headed by Gérard Basquiat. Members and advisers varied depending on who was available when a piece was being authenticated, but they have included the curators and gallerists Diego Cortez, Jeffrey Deitch, John Cheim, Richard Marshall, Fred Hoffman and Annina Nosei (the artist's first art dealer).Liza Ghorbani (September 18, 2011), [http://nymag.com/arts/art/features/jean-michel-basquiat-2011-9/ The Devil on the Door] New York Magazine.\n\nIn 2008 the authentication committee was sued by collector Gerard De Geer, who claimed the committee breached its contract by refusing to offer an opinion on the authenticity of the painting Fuego Flores (1983);Kate Taylor (May 1, 2008), [http://www.nysun.com/arts/lawsuits-challenge-basquiat-boetti-authentication/75664/ Lawsuits Challenge Basquiat, Boetti Authentication Committees] New York Sun. after the lawsuit was dismissed, the committee ruled the work genuine.Georgina Adam and Riah Pryor (December 11, 2008), [http://www.theartnewspaper.com/articles/The-law-vs-scholarship/25155 The law vs scholarship] The Art Newspaper.  In early 2012, the committee announced that it would dissolve in September of that year and no longer consider applications.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jean-Michel Basquiat" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15916" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jean-Michel Basquiat (; December 22, 1960 – August 12, 1988) was an American artist. Basquiat first achieved fame as part of SAMO, an informal graffiti duo who wrote enigmatic epigrams in the cultural hotbed of the Lower East Side of Manhattan during the late 1970s where the hip hop, punk, and street art movements had coalesced. By the 1980s, he was exhibiting his neo-expressionist paintings in galleries and museums internationally. The Whitney Museum of American Art held a retrospective of his art in 1992.\n\nBasquiat's art focused on \"suggestive dichotomies\", such as wealth versus poverty, integration versus segregation, and inner versus outer experience.Hoffman, Fred. (2005) The Defining Years: Notes on Five Key Works from the book Basquiat. Mayer, Marc (ed.). Merrell Publishers in association with the Brooklyn Museum, , pp. 129–139. He appropriated poetry, drawing, and painting, and married text and image, abstraction, figuration, and historical information mixed with contemporary critique.Sirmans, Franklin. (2005) In the Cipher: Basquiat and Hip Hop Culture from the book Basquiat. Mayer, Marc (ed.). Merrell Publishers in association with the Brooklyn Museum, , pp. 91–105.\n\nBasquiat used social commentary in his paintings as a \"springboard to deeper truths about the individual\", as well as attacks on power structures and systems of racism, while his poetics were acutely political and direct in their criticism of colonialism and support for class struggle. He died of a heroin overdose at his art studio at age 27.\n\nOn May 18, 2017, at a Sotheby's auction, Basquiat's 1982 painting, also Untitled, created with oil stick and spray paint and depicting a skull, set a new record high for any U.S. artist at auction, selling for $110,500,000.\n\nEarly life\n\nJean-Michel Basquiat was born in Brooklyn, New York, on December 22, 1960, shortly after the death of his elder brother, Max. He was the second of four children of Matilde Andrades (July 28, 1934 – November 17, 2008)[http://www.hst1066.com/comm/2008_09/185/Matilde.pdf \"In Loving Memory: Matilde Basquiat\"], Lodge Communications 185, Harry S Truman Lodge No.1066, F.&A.M., December 4, 2008. New York, NY. Sad Tidings for Brother John Andrades. and Gérard Basquiat (1930 – July 7, 2013).[http://www.dnainfo.com/new-york/20130905/boerum-hill/jean-michel-basquiats-dad-leaves-behind-sons-art-tax-problem \"Jean-Michel Basquiat's Dad Leaves Behind Son's Art, and Tax Problem\"]  by James Fanelli, September 5, 2013, 6:27am.[https://www.nytimes.com/books/98/08/09/reviews/980809.09boswort.html Hyped to Death] by The New York Times (August 9, 1998). He had two younger sisters: Lisane, born in 1964, and Jeanine, born in 1967.\n\nHis father, Gérard Basquiat, was born in Port-au-Prince, Haiti, and his mother, Matilde Basquiat, who was of Puerto Rican descent, was born in Brooklyn, New York. Matilde instilled a love for art in her young son by taking him to art museums in Manhattan and enrolling him as a junior member of the Brooklyn Museum of Art. Basquiat was a precocious child who learned how to read and write by age four and was a gifted artist. His teachers, such as artist Jose Machado, noticed his artistic abilities, and his mother encouraged her son's artistic talent. By the age of 11, Basquiat was fully fluent in French, Spanish and English. In 1967, Basquiat started attending Saint Ann's, an arts-oriented exclusive private school.Phoebe Hoban, [https://www.nytimes.com/1996/08/18/movies/one-artist-imitating-another.html?pagewanted\nall \"One Artist Imitating Another,\"] The New York TimesArthur C. Danto, [https://www.thenation.com/article/flyboy-buttermilk/ \"Flyboy in the Buttermilk,\"] \"The Nation\"Lisa J. Curtis, [http://www.brooklynpaper.com/stories/28/16/28_16basquiat.html \"Homecoming: Fort Greene's poet-painter Basquiat is fondly remembered,\"] \"Brooklyn Paper\" He drew with Marc Prozzo, a friend from St. Ann's; they together created a children's book, written by Basquiat and illustrated by Prozzo. Basquiat became an avid reader of Spanish, French, and English texts and a more than competent athlete, competing in track events.\n\nIn September 1968, at the age of seven, Basquiat was hit by a car while playing in the street. His arm was broken and he suffered several internal injuries, and he eventually underwent a splenectomy. While he was recuperating from his injuries, his mother brought him the Gray's Anatomy book to keep him occupied. This book would prove to be influential in his future artistic outlook. His parents separated that year and he and his sisters were raised by their father.[http://lindsaypollock.com/news/basquiat-estate-sells-at-sothebys/ Basquiat's Estate Sells at Sotheby's]  by Lindsay Pollock (March 31, 2010). The family resided in Boerum Hill, Brooklyn, for five years, then moved to San Juan, Puerto Rico in 1974. After two years, they returned to New York City.\n\nWhen he was 13, his mother was committed to a mental institution and thereafter spent time in and out of institutions.Fretz, Eric. [http://www.basquiatbiography.com/jean-michel-basquiat-a-biography Jean-Michel Basquiat: A Biography] . Greenwood Press, 2010. . Cf. [https://books.google.com/books?ei3L1nT5fMKem70AGR6ZiACQ&id\nXDsYOhjGVDIC&dqJean-Michel+Basquiat%3A+A+Biography.&q\nmental+institutions#vsnippet&q\nmental%20institutions&ffalse p. xv] At 15, Basquiat ran away from home. He slept on park benches in Tompkins Square Park, and was arrested and returned to the care of his father within a week.\n\nBasquiat dropped out of Edward R. Murrow High School in the tenth grade and then attended City-As-School, an alternative high school in Manhattan home to many artistic students who failed at conventional schooling. His father banished him from the household for dropping out of high school and Basquiat stayed with friends in Brooklyn. He supported himself by selling T-shirts and homemade post cards.\n\nCareer\n\nBasquiat went from being homeless and unemployed to selling a single painting for up to $25,000 in a matter of several years.\n\nIn 1976, Basquiat and friend Al Diaz began spray painting graffiti on buildings in Lower Manhattan, working under the pseudonym SAMO. The designs featured inscribed messages such as \"Plush safe he think.. SAMO\" and \"SAMO as an escape clause\". In 1978, Basquiat worked for the Unique Clothing Warehouse in their art department at 718 Broadway in NoHo and at night he began \"SAMO\" painting his original graffitiHarvey Russack, founder, owner, and CEO of Unique Clothing Warehouse 1971–1992.  art on neighborhood buildings. Unique's founder Harvey Russack discovered Basquiat painting a building one night, they became friends, and he offered him a day job. On December 11, 1978, The Village Voice published an article about the graffiti.Faflick, Philip. \"The SAMO Graffiti… Boosh-Wah or CIA?\" Village Voice, December 11, 1978: p. 41. When Basquiat and Diaz ended their friendship, The SAMO project ended with the epitaph \"SAMO IS DEAD\", inscribed on the walls of SoHo buildings in 1979.Cf. Fretz, pp. 46–47.\n\nIn 1979, Basquiat appeared on the live public-access television show TV Party hosted by Glenn O'Brien, and the two started a friendship. Basquiat made regular appearances on the show over the next few years. That same year, Basquiat formed the noise rock band Test Pattern – which was later renamed Gray – which played at Arleen Schloss's open space, \"Wednesdays at A's\", where in October 1979 Basquiat showed, among others, his SAMO color Xerox work.\n\nGray also consisted of Shannon Dawson, Michael Holman, Nick Taylor, Wayne Clifford and Vincent Gallo, and the band performed at nightclubs such as Max's Kansas City, CBGB, Hurrah and the Mudd Club. In 1980, Basquiat starred in O'Brien's independent film Downtown 81, originally titled New York Beat. That same year, Basquiat met Andy Warhol at a restaurant. Basquiat presented to Warhol samples of his work, and Warhol was stunned by Basquiat's genius and allure. The two artists later collaborated. Downtown 81 featured some of Gray's recordings on its soundtrack.[ Andy Kellman. Downtown 81 Original Soundtrack]. Retrieved January 16, 2008. Basquiat also appeared in the 1981 Blondie music video \"Rapture,\" in a role originally intended for Grandmaster Flash,[http://www.vh1.com/shows/dyn/pop_up_video/50274/episode_about.jhtml \"Rock Meets Rap\"] on Pop-Up Video. as a nightclub disc jockey.\n\nThe early 1980s were Basquiat's breakthrough as a solo artist. In June 1980, Basquiat participated in The Times Square Show, a multi-artist exhibition sponsored by Collaborative Projects Incorporated (Colab) and Fashion Moda. In September of the same year, Basquiat joined the Annina Nosei gallery and worked in a basement below the gallery toward his first one-man show, which took place in March 1981 with great success. In December 1981, René Ricard published \"The Radiant Child\" in Artforum magazine,[http://www.smartwentcrazy.com/basquiat/text/jmb_radiantchild.htm Rene Ricard. \"The Radiant Child\", Artforum, Volume XX No. 4, December 1981. pp. 35–43]  which brought Basquiat to the attention of the art world.\n\nIn March 1982 he worked in Modena, Italy, and from November, Basquiat worked from the ground-floor display and studio space Larry Gagosian had built below his Venice, California, home and commenced a series of paintings for a 1983 show, his second at Gagosian Gallery, then in West Hollywood.Fred Hoffman (March 13, 2005), [http://articles.latimes.com/2005/mar/13/entertainment/ca-basquiat13 Basquiat's L.A. – How an '80s interlude became a catalyst for an artist's evolution] Los Angeles Times. He brought along his girlfriend, then unknown aspiring singer Madonna. Gagosian recalls, “Everything was going along fine. Jean-Michel was making paintings, I was selling them, and we were having a lot of fun. But then one day Jean-Michel said, ‘My girlfriend is coming to stay with me.’ I was a little concerned-one too many eggs can spoil an omelet, you know? So I said, ‘Well, what’s she like?’ And he said, He said, ‘Her name is Madonna and she’s going to be huge.’ I’ll never forget that he said that. So Madonna came out and stayed for a few months and we all got along like one big, happy family.” During this time he took considerable interest in the work that Robert Rauschenberg was producing at Gemini G.E.L. in West Hollywood, visiting him on several occasions and finding inspiration in the accomplishments of the painter. In 1982, Basquiat worked briefly with musician and artist David Bowie.\n\nIn 1983, Basquiat produced a 12\" rap single featuring hip-hop artists Rammellzee and K-Rob. Billed as Rammellzee vs. K-Rob, the single contained two versions of the same track: \"Beat Bop\" on side one with vocals and \"Beat Bop\" on side two as an instrumental. The single was pressed in limited quantities on the one-off Tartown Record Company label. The single's cover featured Basquiat's artwork, making the pressing highly desirable among both record and art collectors.\n\nAt the suggestion of Swiss dealer Bruno Bischofberger, Warhol and Basquiat worked on a series of collaborative paintings between 1983 and 1985. In the case of Olympic Rings (1985), Warhol made several variations of the Olympic five-ring symbol, rendered in the original primary colors. Basquiat responded to the abstract, stylized logos with his oppositional graffiti style.[http://www.gagosian.com/exhibitions/april-21-2012--jean-michel-basquiat Jean-Michel Basquiat and Andy Warhol: Olympic Rings, June 19 – August 11, 2012] Gagosian Gallery, London.\n\nBasquiat often painted in expensive Armani suits and would even appear in public in the same paint-splattered clothes.[https://books.google.com/books?idW7yF6cGfghoC&printsec\nfrontcover&dqcreole+traditions&ei\no6gLSrejFYPMzATGib3TAw Randy P. Conner, David Hatfield Sparks, Queering Creole Spiritual Traditions], Haworth Press, 2004, p. 299. \n\nArtistic styles\n\nFred Hoffman hypothesizes that underlying Basquiat's sense of himself as an artist was his \"innate capacity to function as something like an oracle, distilling his perceptions of the outside world down to their essence and, in turn, projecting them outward through his creative acts.\" Additionally, continuing his activities as a graffiti artist, Basquiat often incorporated words into his paintings. Before his career as a painter began, he produced punk-inspired postcards for sale on the street, and became known for the political–poetical graffiti under the name of SAMO. On one occasion Basquiat painted his girlfriend's dress with the words \"Little Shit Brown\". He would often draw on random objects and surfaces, including other people's property. The conjunction of various media is an integral element of Basquiat's art. His paintings are typically covered with text and codes of all kinds: words, letters, numerals, pictograms, logos, map symbols, diagrams and more.\n\nA middle period from late 1982 to 1985 featured multi-panel paintings and individual canvases with exposed stretcher bars, the surface dense with writing, collage and imagery. The years 1984–85 were also the main period of the Basquiat–Warhol collaborations, even if, in general, they were not very well received by the critics.\n\nA major reference source used by Basquiat throughout his career was the book Gray's Anatomy, which his mother had given him while he was in the hospital at age seven. It remained influential in his depictions of internal human anatomy, and in its mixture of image and text. Other major sources were Henry Dreyfuss' Symbol Sourcebook, Leonardo da Vinci's notebooks, and Brentjes' African Rock Art.\n\nBasquiat doodled often and some of his later pieces exhibited this; they were often colored pencil on paper with a loose, spontaneous, and dirty style much like his paintings. His work across all mediums displays a childlike fascination with the process of creating.\n\nHeads\n\nHeads are seen as a major focal point of some of Basquiat's most seminal works. Two pieces, \"Untitled (Head)\" 1981 and \"Untitled (Head)\" 1982, held by by the Broad Foundation and Maezawa Foundation respectively can be seen as primary examples. In reference to the potent image depicted in both pieces, Fred Hoffman writes that Basquiat was likely, \"caught off guard, possibly even frightened, by the power and energy emanating from this unexpected image.” Hoffman, Fred. “The Defining Years: Notes on Five Key Works,” in Ibid., p. 13) Further investigation by Fred Hoffman of pieces like \"Masonic Lodge\" 1983 and Untitled (1983) in his book \"The Art of Jean-Michel Basquiat\" reveals a deeper interest in the artist's fascination with heads that proves an evolution in the artist's oeuvre from one of raw power to one of more refined cognizance. Hoffman, Fred. \"The Art of Jean-Michel Basquiat\", Gallerie Enrico Navarra / 2017\n\nHeritage depicted in art\n\nAccording to Andrea Frohne, Basquiat's 1983 painting Untitled (History of the Black People) \"reclaims Egyptians as African and subverts the concept of ancient Egypt as the cradle of Western Civilization\". At the center of the painting, Basquiat depicts an Egyptian boat being guided down the Nile River by Osiris, the Egyptian god of the earth and vegetation.\n\nOn the right panel of the painting appear the words \"Esclave, Slave, Esclave\". Two letters of the word \"Nile\" are crossed out and Frohne suggests that, \"The letters that are wiped out and scribbled over perhaps reflect the acts of historians who have conveniently forgotten that Egyptians were black and blacks were enslaved.\" On the left panel of the painting Basquiat has illustrated two Nubian-style masks. The Nubians historically were darker in skin color, and were considered to be slaves by the Egyptian people.\n\nThroughout the rest of the painting, images of the Atlantic slave trade are juxtaposed with images of the Egyptian slave trade centuries before. The sickle in the center panel is a direct reference to the slave trade in the United States, and slave labor under the plantation system. The word \"salt\" that appears on the right panel of the work refers to the Atlantic slave trade, as salt was another important commodity traded at that time.\n\nAnother of Basquiat's pieces, Irony of Negro Policeman (1981), is intended to illustrate how he believes African-Americans have been controlled by a predominantly Caucasian society. Basquiat sought to portray that African-Americans have become complicit with the \"institutionalized forms of whiteness and corrupt white regimes of power\" years after the Jim Crow era had ended. Basquiat found the concept of a \"Negro policeman\" utterly ironic. According to him the policeman should sympathize with his black friends, family, and ancestors, yet instead he was there to enforce the rules designed by \"white society.\" The Negro policeman had \"black skin but wore a white mask\". In the painting, Basquiat depicted the policeman as large in order to suggest an \"excessive and totalizing power\", but made the policeman's body fragmented and broken.\n\nThe hat that frames the head of the Negro policeman resembles a cage, and represents what Basquiat believes are the constrained independent perceptions of African-Americans at the time, and how constrained the policeman's own perceptions were within white society. Basquiat drew upon his Haitian heritage by painting a hat that resembles the top hat associated with the ' family of ', who embody the powers of death in Vodou.\n\nHowever, Kellie Jones, in her essay Lost in Translation: Jean-Michel in the (Re)Mix, posits that Basquiat's \"mischievous, complex, and neologistic side, with regard to the fashioning of modernity and the influence and effluence of black culture\" are often elided by critics and viewers, and thus \"lost in translation.\"Lost in Translation: Jean-Michel in the (Re)Mix, by Kellie Jones, from the book Basquiat, edited by Marc Mayer, 2005, Merrell Publishers in association with the Brooklyn Museum, , pp. 163–179.\n\nThe art historian Olivier Berggruen situates in Basquiat's anatomical screen prints, titled Anatomy, an assertion of vulnerability, one which \"creates an aesthetic of the body as damaged, scarred, fragmented, incomplete, or torn apart, once the organic whole has disappeared. Paradoxically, it is the very act of creating these representations that conjures a positive corporeal valence between the artist and his sense of self or identity.\"\n\nExhibitions\n\nBasquiat's first public exhibition was in the group effort The Times Square Show (with David Hammons, Jenny Holzer, Lee Quiñones, Kenny Scharf and Kiki Smith among others), held in a vacant building at 41st Street and Seventh Avenue, New York. In late 1981, Basquiat joined the Annina Nosei gallery in SoHo; his first one-person exhibition was in 1982 at that gallery.[http://www.moma.org/collection/artist.php?artist_id=370 Jean-Michel Basquiat] MoMA Collection, New York. By then, he was showing regularly alongside other Neo-expressionist artists including Julian Schnabel, David Salle, Francesco Clemente and Enzo Cucchi. He was represented in Los Angeles by the Gagosian gallery and throughout Europe by Bruno Bischofberger.\n\nMajor exhibitions of Basquiat's work have included Jean-Michel Basquiat: Paintings 1981–1984 at the Fruitmarket Gallery, Edinburgh (1984), which traveled to the Institute of Contemporary Arts, London, and Museum Boijmans Van Beuningen, Rotterdam, in 1985); the Kestnergesellschaft, Hannover (1987, 1989). The first retrospective to be held of his work was the Jean-Michel Basquiat exhibition at the Whitney Museum of American Art from October 1992 to February 1993. It subsequently traveled to the Menil Collection, Houston; the Des Moines Art Center, Iowa; and the Montgomery Museum of Fine Arts, Alabama, from 1993 to 1994. The catalog for this exhibition,Marshall, Richard. Jean-Michel Basquiat, Abrams / Whitney Museum of American Art, 1992 (out of print). edited by Richard Marshall and including several essays of differing styles, was a groundbreaking piece of scholarship into Basquiat's work and still is a major source. Another exhibition, Basquiat, was mounted by the Brooklyn Museum, New York, in 2005, and traveled to the Museum of Contemporary Art, Los Angeles, and the Museum of Fine Arts, Houston.Mayer, Marc, Hoffman Fred, et al. Basquiat, Merrell Publishers / Brooklyn Museum, 2005. From October 2006 to January 2007, the first Basquiat exhibition in Puerto Rico took place at the Museo de Arte de Puerto Rico (MAPR), produced by ARTPREMIUM, Corinne Timsit and Eric Bonici. Brooklyn Museum exhibited Basquiat: The Unknown Notebooks in April–August 2015. In 2017, the Barbican Centre in London exhibited [https://www.barbican.org.uk/whats-on/2017/event/basquiat-boom-for-real Basquiat: Boom for Real].\nReviews\n\nIn a review for The Telegraph, critic Hilton Kramer starts his first paragraph by stating that Basquiat had no idea what the word “quality” meant. The praises to follow are in the lines of “talentless hustler” and “street-smart but otherwise invincibly ignorant” arguing that art dealers of the time were “as ignorant about art as Basquiat himself.” Saying that Jean-Michel’s work never rose above that “lowly artistic station” of graffiti even when his paintings were selling for giant prices only proves of his childish appreciation of art. Thinking there was some type of cult Kramer states: “As a result of the campaign waged by these art-world entrepreneurs on Basquiat's behalf - and their own, of course - there was never any doubt that the museums, the collectors and the media would fall into line“ when talking about the marketization of Basquiat’s name.\n\nArt critic Bonnie Rosenberg compares Basquiat's work to the emergence of American Hip Hop during the same era. She also mentions how Basquiat experienced a good taste of fame in his last years when he was a “critically embraced and popularly celebrated artistic phenomenon.” Rosenberg remarked that some people focused on the “superficial exoticism of his work” missing the fact that it “held important connections to expressive precursors.”\n\nShortly after his death, the New York Times indicated that Basquiat was “the most famous of only a small number of young black artists who have achieved national recognition.”\n\nFinal years and death\n\nBy 1986, Basquiat had left the Annina Nosei gallery and was showing at the Mary Boone gallery in SoHo. On February 10, 1985, he appeared on the cover of The New York Times Magazine in a feature titled \"New Art, New Money: The Marketing of an American Artist\".Cathleen McGuigan, \"New Art, New Money\" The New York Times Magazine, February 2005. He was a successful artist in this period, but his growing heroin addiction began to interfere with his personal relationships.\n\nDespite an attempt at sobriety during a trip to Maui, Hawaii, he died on August 12, 1988, of a heroin overdose at his art studio on Great Jones Street in Manhattan's NoHo neighborhood. He was 27 years old.\n\nBasquiat was interred in Brooklyn's Green-Wood Cemetery, where Jeffrey Deitch made a speech at the graveside. Among those speaking at Basquiat's memorial held at Saint Peter's Church on November 3, 1988, were Ingrid Sischy who, as the editor of Artforum in the 1980s, got to know the artist well and commissioned a number of articles that introduced his work to the wider world. Suzanne Mallouk recited sections of A. R. Penck's \"Poem for Basquiat\" and Fab 5 Freddy read a poem by Langston Hughes.[https://www.nytimes.com/books/first/h/hoban-basquiat.html Phoebe Hoban: Basquiat – A Quick Killing in Art] The New York Times Books. The 300 guests included musicians John Lurie and Arto Lindsay; artist Keith Haring; poet David Shapiro; Glenn O'Brien, a writer; Fab 5 Freddy; and members of the band Gray, which Basquiat led in the late 1970s.[https://www.nytimes.com/1988/11/03/arts/basquiat-memorial.html \"Basquiat Memorial\", The New York Times, November 3, 1988] In memory of the late artist, Keith Haring created Pile of Crowns for Jean-Michel Basquiat (1988).\n\nLegacy\n\nIn literature \n\nIn 1991, poet Kevin Young produced a book, To Repel Ghosts, a compendium of 117 poems relating to Basquiat's life, individual paintings, and social themes found in the artist's work. He published a \"remix\" of the book in 2005.Kevin Young, To Repel Ghosts (1st edition), Zoland Books, 2001.\n\nIn 1995, writer, Jennifer Clement, wrote the book Widow Basquiat, based on the stories told to her by Suzanne Mallouk.\n\nIn 2005, poet M. K. Asante published the poem \"SAMO\", dedicated to Basquiat, in his book Beautiful. And Ugly Too.\n\nIn film \n\nBasquiat starred in Downtown 81, a vérité movie written by Glenn O'Brien and shot by Edo Bertoglio in 1981, but not released until 1998.[http://www.gagosian.com/exhibitions/jean-michel-basquiat--february-07-2013 Jean-Michel Basquiat, February 7 – April 6, 2013] Gagosian Gallery, New York. In 1996, eight years after the artist's death, a biographical film titled Basquiat was released, directed by Julian Schnabel, with actor Jeffrey Wright playing Basquiat. David Bowie played the part of Andy Warhol. Schnabel was interviewed during the film's script development as a personal acquaintance of Basquiat. Schnabel then purchased the rights to the project, believing that he could make a better film.\"Meet the Artist: Julan Schnabel\", lecture given at Hirshhorn Museum, Washington, DC, May 13, 2011.\n\nIn 2006 the Equality Forum featured Jean-Michel Basquiat during LGBT history month.\n\nA 2009 documentary film, Jean-Michel Basquiat: The Radiant Child, directed by Tamra Davis, was first screened as part of the 2010 Sundance Film Festival and was shown on the PBS series Independent Lens in 2011. Tamra Davis discussed her friendship with Basquiat in a Sotheby's video, [http://www.sothebys.com/en/news-video/videos/2017/basquiat--through-the-eyes-of-a-friend.html Basquiat: Through the Eyes of a Friend].\n\nIn music \n\nShortly after Basquiat's death, Vernon Reid of New York heavy metal band Living Colour wrote a song called \"Desperate People\", released on their album Vivid. The song primarily addresses the drug scene of New York at that time. Vernon states that Basquiat's death inspired him to write the song after receiving a phone call from Greg Tate informing Vernon of Basquiat's death.\n\nBasquiat is referenced in Jay Z and Frank Ocean's song \"Oceans\": \"I hope my black skin don't dirt this white tuxedo before the Basquiat show\" in the 2013 album Magna Carta Holy Grail. Both Jay-Z and Kanye West made reference to Basquiat on their 2011 collaborative album Watch the Throne. In \"Illest Motherfucker Alive\", Jay Z raps \"Basquiats, Warhols serving as my muses\" and in \"That's My Bitch\", Jay Z Raps \"Basquiat, we learning a new word its yacht\". Jay Z also mentions him on his 2013 album Magna Carta Holy Grail when he says \"Yellow Basquiat in my kitchen corner go 'head, lean on that shit Blue, you own it\". In his verse on Lil Wayne's song \"John\", Rick Ross raps \"Red on the wall, Basquiat when I paint\".\n\nIn the song \"Ten Thousand Hours\", Macklemore raps: \"I observed Escher, I love Basquiat\", and on his song \"Victory Lap\" raps: \"unorthodox, like Basquiat with a pencil\". In his song \"Die Like a Rockstar\", about overdosing, Danny Brown raps \"Basquiat freestyle\" to hype himself up. Canadian artist The Weeknd has stated in interviews that his trademark haircut was inspired by Basquiat. ASAP Rocky mentions Basquiat in his song \"Phoenix\", rapping \"Painting vivid pictures/call me Basquiat, Picasso\". Rapper Robb Bank$ has a song titled \"Look Like Basquiat\". Korean rapper Jazzy Ivy released the single/album \"Jean & Andy\" inspired by Jean-Michel Basquiat and Andy Warhol. \"Rich Niggaz\" on J. Cole's second album Born Sinner he raps: \"It's like Sony signed Basquiat\". Referencing his parent label, Sony, he compares Basquiat to himself in the change in their works after signing to a major label. On his song \"Untitled\", Killer Mike compares himself to Basquiat and 2Pac, saying \"This is Basquiat with a passion like Pac\". On the track Moments by Kidz in the Hall from their Semester Abroad mixtape Naledge says \"look inside myself I think I see a masterpiece, a little Basquiat mix a little Master P\".\n\nKorean rapper T.O.P references Basquiat in his 2013 single \"DOOM DADA\", when he says \"MIC-reul jwin shindeullin, rap Basquiat\", which translates as: \"A god-given rap Basquiat with a mic.\" On his mixtape Black Hystori Project, Cyhi the Prynce features a song called \"Basquiat\". Nicki Minaj mentioned Basquiat on her single \"Lookin Ass\", featured on the Young Money collaborative album Rise Of An Empire. In Riff Raff's \"Gucci Jacuzzi\", Lil' Flip says \"You know I'm makin' guap, and my painting in my kitchen was made by Basquiat\". Madonna references Basquiat in the song \"Graffiti Heart\" from the super deluxe edition of her album Rebel Heart. The band Fall Out Boy used the Basquiat crown as a part of their logo in 2013. It is still being used. Robb Bank$ compares himself thoroughly to Basquiat in his song \"Look like Basquiat\". Basquiat was referenced in the Gym Class Heroes' song, \"To Bob Ross with Love\". Hip-hop artist Yasiin Bey released a song dedicated to Basquiat, titled \"Basquiat Ghostwriter\". Bey says he was inspired by the paintings and writings of the artist.\n\nIn the world of jazz, clarinetist Don Byron composed and performed the tune \"Basquiat\" on his 2000 album A Fine Line: Arias and Lieder.\n\nBasquiat's work has been used by clothing companies such as SPRZ NY of Uniqlo, Urban Outfitters, and Redbubble.\n\nCollections\n\nNotable private collectors of Basquiat's work include David Bowie, Mera and Donald Rubell, Lars Ulrich, Steven A. Cohen, Laurence Graff, John McEnroe, Madonna, Debbie Harry, Leonardo DiCaprio, Swizz Beatz, Jay-Z and Johnny Depp.France, Lisa Respers (June 10, 2016). [http://www.cnn.com/2016/06/10/entertainment/johnny-depp-basquiat-auction/index.html \"Johnny Depp auctioning off multimillion-dollar art collection\"]. CNN.com. Retrieved June 11, 2016.\n\nArt market\n\nBasquiat sold his first painting in 1981, and by 1982, spurred by the Neo-Expressionist art boom, his work was in great demand. In 1985, he was featured on the cover of The New York Times Magazine in connection with an article on the newly exuberant international art market; this was unprecedented for an African-American artist, and for an artist so young. Since Basquiat's death in 1988, his market has developed steadily – in line with overall art market trends – with a dramatic peak in 2007 when, at the height of the art market boom, the global auction volume for his work was over $115 million. Brett Gorvy, deputy chairman of Christie's, is quoted describing Basquiat's market as \"two-tiered. [...] The most coveted material is rare, generally dating from the best period, 1981–83.\"Georgina Adam and Gareth Harris (June 17, 2010), [http://theartnewspaper.com/articles/Basquiat-comes-of-age/21078 Basquiat comes of age] The Art Newspaper. \n\nIn 2001 New York artist and con-artist Alfredo Martinez was charged by the Federal Bureau of Investigation with attempting to deceive two art dealers by selling them $185,000 worth of fake drawings put forth as being the work of Basquiat. The charges against Martinez, which landed him in Manhattan's Metropolitan Correction Center  on June 19, 2002, involved an alleged scheme to sell fake Basquiat drawings, accompanied by forged certificates of authenticity.\n\nUntil 2002, the highest amount paid for an original work of Basquiat's was US$3,302,500, set on November 12, 1998, at Christie's. In 2002, Basquiat's Profit I (1982), a large piece measuring , was set for auction again at Christie's by drummer Lars Ulrich of the heavy metal band Metallica. It sold for US$5,509,500. The proceedings of the auction are documented in the film Some Kind of Monster.\n\nIn 2008, at another auction at Christie's, Ulrich sold a 1982 Basquiat piece, Untitled (Boxer), for US $13,522,500 to an anonymous telephone bidder. Another record price for a Basquiat painting was made in 2007, when an untitled Basquiat work from 1981 sold at Sotheby's in New York for US$14.6 million. In 2012, for the second year running, Basquiat was the most coveted contemporary (i.e. born after 1945) artist at auction, with €80 million in overall sales.Charlotte Burns and Julia Michalska (October 11, 2012), Artprice survey reveals the twin peaks of power, The Art Newspaper. That year, his Untitled (1981), a painting of a haloed, black-headed man with a bright red skeletal body, depicted amid the artist's signature scrawls, was sold by Robert Lehrman for $16.3 million, well above its $12 million high estimate.Carol Vogel (May 10, 2012), [https://www.nytimes.com/2012/05/11/nyregion/basquiat-painting-brings-16-3-million-at-phillips-sale.html Basquiat Painting Brings $16.3 Million at Phillips Sale] The New York Times. A similar untitled piece, also undertaken in 1981 and formerly owned by the Israel Museum, sold for £12.92 million at Christie's London, setting a world auction record for Basquiat's work.Souren Melikian (June 29, 2012), [https://www.nytimes.com/2012/06/30/arts/30iht-melikian30.html Wary Buyers Still Pour Money Into Contemporary Art] International Herald Tribune. In 2013, Basquiat's piece Dustheads sold for $48.8 million at Christie's. In 2016 an untitled piece sold at Christie's for $57.3 million to a Japanese businessman and collector, Yusaku Maezawa.Robin Pogrebin, The New York Times May 15, 2016\n\nIn 2017, Yusaku purchased Basquiat's Untitled (1982), a powerful depiction of a skull, at auction for a record-setting US$110,487,500--the most ever paid for an American artwork and the sixth most expensive artwork sold at an auction, surpassing Andy Warhol's \"Silver Car Crash (Double Disaster)\" which sold in 2013 for $105 million.\n\nAuthentication Committee\n\nThe Authentication Committee of the Estate of Jean-Michel Basquiat was formed by the gallery that was assigned to handle the artist's estate.Daniel Grant (September 29, 1996), [http://articles.baltimoresun.com/1996-09-29/news/1996273100_1_specific-artists-contemporary-artists-artist-widow/2 The tricky art of authentication] Baltimore Sun. Between 1994 and 2012, it reviewed over 2,000 works of art; the cost of the committee's opinion was $100. The committee was headed by Gérard Basquiat. Members and advisers varied depending on who was available when a piece was being authenticated, but they have included the curators and gallerists Diego Cortez, Jeffrey Deitch, John Cheim, Richard Marshall, Fred Hoffman and Annina Nosei (the artist's first art dealer).Liza Ghorbani (September 18, 2011), [http://nymag.com/arts/art/features/jean-michel-basquiat-2011-9/ The Devil on the Door] New York Magazine.\n\nIn 2008 the authentication committee was sued by collector Gerard De Geer, who claimed the committee breached its contract by refusing to offer an opinion on the authenticity of the painting Fuego Flores (1983);Kate Taylor (May 1, 2008), [http://www.nysun.com/arts/lawsuits-challenge-basquiat-boetti-authentication/75664/ Lawsuits Challenge Basquiat, Boetti Authentication Committees] New York Sun. after the lawsuit was dismissed, the committee ruled the work genuine.Georgina Adam and Riah Pryor (December 11, 2008), [http://www.theartnewspaper.com/articles/The-law-vs-scholarship/25155 The law vs scholarship] The Art Newspaper.  In early 2012, the committee announced that it would dissolve in September of that year and no longer consider applications. Jean-Michel Basquiat. http://en.wikipedia.org/?curid=15916."
  }
}
