{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1930",
  "eid" : "bc988000-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778396160,
  "textBody" : "Arkansas ( ) is a state in the southeastern region of the United States, home to over 3 million people as of 2017.Jones, Daniel (1997) English Pronouncing Dictionary, 15th ed. Cambridge University Press. . Its name is of Siouan derivation from the language of the Osage denoting their related kin, the Quapaw Indians. The state's diverse geography ranges from the mountainous regions of the Ozark and the Ouachita Mountains, which make up the U.S. Interior Highlands, to the densely forested land in the south known as the Arkansas Timberlands, to the eastern lowlands along the Mississippi River and the Arkansas Delta.\n\nArkansas is the 29th largest by area and the 33rd most populous of the 50 United States. The capital and most populous city is Little Rock, located in the central portion of the state, a hub for transportation, business, culture, and government. The northwestern corner of the state, such as the Fayetteville–Springdale–Rogers Metropolitan Area and Fort Smith metropolitan area, is a population, education, and economic center. The largest city in the state's eastern part is Jonesboro. The largest city in the state's southeastern part is Pine Bluff.\n\nThe Territory of Arkansas was admitted to the Union as the 25th state on June 15, 1836. In 1861 Arkansas withdrew from the United States and joined the Confederate States of America during the Civil War. On returning to the Union in 1868, the state continued to suffer due to its earlier reliance on slavery and the plantation economy, causing the state to fall behind economically and socially. White rural interests continued to dominate the state's politics until the Civil Rights Movement. Arkansas began to diversify its economy following World War II and relies on its service industry, aircraft, poultry, steel, tourism, cotton, and rice.\n\nThe culture of Arkansas is observable in museums, theaters, novels, television shows, restaurants, and athletic venues across the state. Arkansas's enduring image has earned the state \"a special place in the American consciousness\". People such as politician and educational advocate William Fulbright; former President Bill Clinton who served as the 40th and 42nd Governor of Arkansas; his wife, former Secretary of State Hillary Rodham Clinton; former NATO Supreme Allied Commander General Wesley Clark, Walmart magnate Sam Walton; singer-songwriters Johnny Cash and Glen Campbell; the poet C.D. Wright; and physicist William L. McMillan, who was a pioneer in superconductor research; have all lived in Arkansas.\n\nEtymology\n\nThe name Arkansas derives from the same root as the name for the state of Kansas. The Kansa tribe of Native Americans are closely associated with the Sioux tribes of the Great Plains. The word \"Arkansas\" itself is a French pronunciation (\"Arcansas\") of a Quapaw (a related \"Kaw\" tribe) word, akakaze, meaning \"land of downriver people\" or the Sioux word akakaze meaning \"people of the south wind\".\n\nIn 1881, the pronunciation of Arkansas with the final \"s\" being silent was made official by an act of the state legislature after a dispute arose between Arkansas's two U.S. senators as one favored the pronunciation as  while the other favored .\n\nIn 2007, the state legislature passed a non-binding resolution declaring that the possessive form of the state's name is Arkansas's, which has been followed increasingly by the state government.\n\nGeography\n\nBoundaries\n\nArkansas borders Louisiana to the south, Texas to the southwest, Oklahoma to the west, Missouri to the north, as well as Tennessee and Mississippi on the east. The United States Census Bureau classifies Arkansas as a southern state, sub-categorized among the West South Central States. The Mississippi River forms most of Arkansas's eastern border, except in Clay and Greene, counties where the St. Francis River forms the western boundary of the Missouri Bootheel, and in many places where the channel of the Mississippi has meandered (or been straightened by man) from its original 1836 course.\n\nTerrain\n\nArkansas can generally be split into two halves, the highlands in the northwest half and the lowlands of the southeastern half.Smith 1989, p. 15. The highlands are part of the Southern Interior Highlands, including The Ozarks and the Ouachita Mountains. The southern lowlands include the Gulf Coastal Plain and the Arkansas Delta.Smith 1989, pp. 15–17. This dual split can yield to general regions named northwest, southwest, northeast, southeast, or central Arkansas. These directionally named regions are broad and not defined along county lines. Arkansas has seven distinct natural regions: the Ozark Mountains, Ouachita Mountains, Arkansas River Valley, Gulf Coastal Plain, Crowley's Ridge, and the Arkansas Delta, with Central Arkansas sometimes included as a blend of multiple regions.\n\nThe southeastern part of Arkansas along the Mississippi Alluvial Plain is sometimes called the Arkansas Delta. This region is a flat landscape of rich alluvial soils formed by repeated flooding of the adjacent Mississippi. Farther away from the river, in the southeast portion of the state, the Grand Prairie consists of a more undulating landscape. Both are fertile agricultural areas. The Delta region is bisected by a geological formation known as Crowley's Ridge. A narrow band of rolling hills, Crowley's Ridge rises from 250 to above the surrounding alluvial plain and underlies many of the major towns of eastern Arkansas.Smith 1989, p. 19.\n\nNorthwest Arkansas is part of the Ozark Plateau including the Ozark Mountains, to the south are the Ouachita Mountains, and these regions are divided by the Arkansas River; the southern and eastern parts of Arkansas are called the Lowlands.Federal Writers' Project 1987, p. 6. These mountain ranges are part of the U.S. Interior Highlands region, the only major mountainous region between the Rocky Mountains and the Appalachian Mountains. The highest point in the state is Mount Magazine in the Ouachita Mountains, which rises to 2753 ft above sea level.\n\nHydrology\n\nArkansas has many rivers, lakes, and reservoirs within or along its borders. Major tributaries of the Mississippi River include the Arkansas River, the White River, and the St. Francis River.Federal Writers' Project 1987, p. 8. The Arkansas is fed by the Mulberry River and the Fourche LaFave River in the Arkansas River Valley, which is also home to Lake Dardanelle. The Buffalo River, Little Red River, Black River and Cache River all serve as tributaries to the White River, which also empties into the Mississippi. The Saline River, Little Missouri River, Bayou Bartholomew, and the Caddo River all serve as tributaries to the Ouachita River in south Arkansas, which eventually empties into the Mississippi in Louisiana. The Red River briefly serves as the state's boundary with Texas.Smith 1989, p. 24. Arkansas has few natural lakes and many reservoirs,  such as Bull Shoals Lake, Lake Ouachita, Greers Ferry Lake, Millwood Lake, Beaver Lake, Norfork Lake, DeGray Lake, and Lake Conway.Smith 1989, p. 25.\n\nArkansas is home to many caves, such as Blanchard Springs Caverns. More than 43,000 Native American living, hunting and tool making sites, many of them Pre-Columbian burial mounds and rock shelters, have been cataloged by the State Archeologist. Crater of Diamonds State Park near Murfreesboro is the world's only diamond-bearing site accessible to the public for digging. Arkansas is home to a dozen Wilderness Areas totaling 158444 acre. These areas are set aside for outdoor recreation and are open to hunting, fishing, hiking, and primitive camping. No mechanized vehicles nor developed campgrounds are allowed in these areas.\n\nFlora and fauna\n\nArkansas is divided into three broad ecoregions, the Ozark, Ouachita-Appalachian Forests, Mississippi Alluvial and Southeast USA Coastal Plains, and the Southeastern USA Plainsand two biomes, the subtropical coniferous forest and the temperate deciduous forest. The state is further divided into seven subregions: the Arkansas Valley, Boston Mountains, Mississippi Alluvial Plain, Mississippi Valley Loess Plain, Ozark Highlands, Ouachita Mountains, and the South Central Plains. A 2010 United States Forest Service survey determined 18720000 acre of Arkansas's land is forestland, or 56% of the state's total area. Dominant species in Arkansas's forests include Quercus (oak), Carya (hickory), Pinus echinata (shortleaf pine) and Pinus taeda (loblolly pine).\n\nArkansas's plant life varies with its climate and elevation. The pine belt stretching from the Arkansas delta to Texas consists of dense oak-hickory-pine growth. Lumbering and paper milling activity is active throughout the region.Federal Writers' Project 1987, p. 13. In eastern Arkansas, one can find Taxodium  (cypress), Quercus nigra (water oaks), and hickories with their roots submerged in the Mississippi Valley bayous indicative of the deep south.Federal Writers' Project 1987, p. 12. Nearby Crowley's Ridge is only home of the tulip tree in the state, and generally hosts more northeastern plant life such as the beech tree.Federal Writers' Project 1987, pp. 12–13. The northwestern highlands are covered in an oak-hickory mixture, with Ozark white cedars, cornus (dogwoods), and Cercis canadensis (redbuds) also present. The higher peaks in the Arkansas River Valley play host to scores of ferns, including the Woodsia scopulina and Adiantum (maidenhair fern) on Mount Magazine.Federal Writers' Project 1987, pp. 13–14.\n\nClimate\n\nArkansas generally has a humid subtropical climate. While not bordering the Gulf of Mexico, Arkansas is still close enough to this warm, large body of water for it to influence the weather in the state. Generally, Arkansas has hot, humid summers and slightly drier, mild to cool winters. In Little Rock, the daily high temperatures average around 93 °F with lows around 73 °F in July. In January highs average around 51 °F and lows around 32 °F. In Siloam Springs in the northwest part of the state, the average high and low temperatures in July are 89 and and in January the average high and lows are 44 and. Annual precipitation throughout the state averages between about 40 and; somewhat wetter in the south and drier in the northern part of the state. Snowfall is infrequent but most common in the northern half of the state. The half of the state south of Little Rock is more apt to see ice storms. Arkansas's all-time record high is 120 F at Ozark on August 10, 1936; the all-time record low is  at Gravette, on February 13, 1905.\n\nArkansas is known for extreme weather and frequent storms. A typical year brings thunderstorms, tornadoes, hail, snow and ice storms. Between both the Great Plains and the Gulf States, Arkansas receives around 60 days of thunderstorms. Arkansas is located in Tornado Alley, and as a result, a few of the most destructive tornadoes in U.S. history have struck the state. While sufficiently far from the coast to avoid a direct hit from a hurricane, Arkansas can often get the remnants of a tropical system, which dumps tremendous amounts of rain in a short time and often spawns smaller tornadoes.\n\nHistory\n\nEarly Arkansas\n\nBefore European settlement of North America, Arkansas was inhabited by indigenous peoples for thousands of years. The Caddo, Osage, and Quapaw peoples encountered European explorers. The first of these Europeans was Spanish explorer Hernando de Soto in 1541, who crossed the Mississippi and marched across central Arkansas and the Ozark Mountains. After finding nothing he considered of value and encountering native resistance the entire way, he and his men returned to the Mississippi River where de Soto fell ill. From his deathbed he ordered his men to massacre all of the men of the nearby village of Anilco, who he feared had been plotting with a powerful polity down the Mississippi River, Quigualtam. His men obeyed and did not stop with the men, but were said to have massacred women and children as well. He died the following day in what is believed to be the vicinity of modern day McArthur, Arkansas in May 1542. His body was weighted down with sand and he was consigned to a watery grave in the Mississippi River under cover of darkness by his men. De Soto had attempted to deceive the native population into thinking he was an immortal deity, sun of the sun, in order to forestall attack by outraged Native Americans on his by then weakened and bedraggled army. In order to keep the ruse up, his men informed the locals that de Soto had ascended into the sky. His will at the time of his death listed: \"four Indian slaves, three horses and 700 hogs.\" which were auctioned off to his men. His starving men, who had been living off maize stolen from Native Americans and who had not been allowed to eat the enormous herd of hogs but had had to care for them, immediately started to butcher them. Later on his remaining men, now commanded by his aide de camp Moscoso, attempted an overland return to Mexico. They made it as far as Texas before running into territory too dry for maize farming and too thinly populated to sustain themselves by stealing food from the locals. The expedition promptly backtracked to Arkansas. After building a small fleet of boats they then headed down the Mississippi River and eventually on to Mexico by water.Davidson, James West. After the Fact: The Art of Historical Detection Volume 1. Mc Graw Hill, New York 2010, Chapter 1, p. 2,3 \n\nLater explorers included the French Jacques Marquette and Louis Jolliet in 1673, and Frenchmen Robert La Salle and Henri de Tonti in 1681.Fletcher 1989, p. 26. Tonti established Arkansas Post at a Quapaw village in 1686, making it the first European settlement in the territory.Arnold 1992, p. 75. The early Spanish or French explorers of the state gave it its name, which is probably a phonetic spelling of the Illinois tribe's name for the Quapaw people, who lived downriver from them. The name Arkansas has been pronounced and spelled in a variety of fashions. The region was organized as the Territory of Arkansaw on July 4, 1819, with the territory admitted to the United States as the state of Arkansas on June 15, 1836. The name was historically,, and several other variants. Historically and modernly, the people of Arkansas call themselves either \"Arkansans\" or \"Arkansawyers\". In 1881, the Arkansas General Assembly passed Arkansas Code 1-4-105 ([https://web.archive.org/web/20110924223556/http://www.arkleg.state.ar.us/assembly/ArkansasCode/0/1-4-105.htm official text]):\nWhereas, confusion of practice has arisen in the pronunciation of the name of our state and it is deemed important that the true pronunciation should be determined for use in oral official proceedings.\nAnd, whereas, the matter has been thoroughly investigated by the State Historical Society and the Eclectic Society of Little Rock, which have agreed upon the correct pronunciation as derived from history, and the early usage of the American immigrants.\nBe it therefore resolved by both houses of the General Assembly, that the only true pronunciation of the name of the state, in the opinion of this body, is that received by the French from the native Indians and committed to writing in the French word representing the sound. It should be pronounced in three (3) syllables, with the final \"s\" silent, the \"a\" in each syllable with the Italian sound, and the accent on the first and last syllables. The pronunciation with the accent on the second syllable with the sound of \"a\" in \"man\" and the sounding of the terminal \"s\" is an innovation to be discouraged.\nCitizens of the state of Kansas often pronounce the Arkansas River as, in a manner similar to the common pronunciation of the name of their state.\n\nSettlers, such as fur trappers, moved to Arkansas in the early 18th century. These people used Arkansas Post as a home base and entrepôt. During the colonial period, Arkansas changed hands between France and Spain following the Seven Years' War, although neither showed interest in the remote settlement of Arkansas Post.Arnold et al. 2002, p. 82. In April 1783, Arkansas saw its only battle of the American Revolutionary War, a brief siege of the post by British Captain James Colbert with the assistance of the Choctaw and Chickasaw.\n\nPurchased by the United States \n\nNapoleon Bonaparte sold French Louisiana to the United States in 1803, including all of Arkansas, in a transaction known today as the Louisiana Purchase. French soldiers remained as a garrison at Arkansas Post. Following the purchase, the balanced give-and-take relationship between settlers and Native Americans began to change all along the frontier, including in Arkansas.Arnold et al. 2002, p. 79. Following a controversy over allowing slavery in the territory, the Territory of Arkansas was organized on July 4, 1819. Gradual emancipation in Arkansas was struck down by one vote, the Speaker of the House Henry Clay, allowing Arkansas to organize as a slave territory.Johnson 1965, p. 58.\n\nSlavery became a wedge issue in Arkansas, forming a geographic divide that remained for decades. Owners and operators of the cotton plantation economy in southeast Arkansas firmly supported slavery, as they perceived slave labor as the best or \"only\" economically viable method of harvesting their commodity crops. The \"hill country\" of northwest Arkansas was unable to grow cotton and relied on a cash-scarce, subsistence farming economy.Scroggs 1961, pp. 231–232.\n\nAs European Americans settled throughout the East Coast and into the Midwest, in the 1830s the United States government forced the removal of many Native American tribes to Arkansas and Indian Territory west of the Mississippi River.\n\nAdditional Native American removals began in earnest during the territorial period, with final Quapaw removal complete by 1833 as they were pushed into Indian Territory.White 1962, p. 197. The capital was relocated from Arkansas Post to Little Rock in 1821, during the territorial period.\n\nStatehood\n\nWhen Arkansas applied for statehood, the slavery issue was again raised in Washington, D.C.. Congress eventually approved the Arkansas Constitution after a 25-hour session, admitting Arkansas on June 15, 1836 as the 25th state and the 13th slave state, having a population of about 60,000.Scroggs 1961, p. 243. Arkansas struggled with taxation to support its new state government, a problem made worse by a state banking scandal and worse yet by the Panic of 1837.\n\nCivil War and Reconstruction \n\nIn early antebellum Arkansas, the southeast Arkansas slave based economy developed rapidly. On the eve of the Civil War in 1860, enslaved African Americans numbered 111,115 people, just over 25% of the state's population.[http://fisher.lib.virginia.edu/collections/stats/histcensus/php/state.php Historical Census Browser, 1860 US Census, University of Virginia] . Retrieved March 21, 2008. Plantation agriculture set the state and region behind the nation for decades.Arnold et al. 2002, p. 135. The wealth developed among planters of southeast Arkansas caused a political rift to form between the northwest and southeast.Bolton 1999, p. 22.\n\nMany politicians were elected to office from the Family, the Southern rights political force in antebellum Arkansas. Residents generally wanted to avoid a civil war. When the Gulf states seceded in early 1861, Arkansas voted to remain in the Union. Arkansas did not secede until Abraham Lincoln demanded Arkansas troops be sent to Fort Sumter to quell the rebellion there. On May 6, a state convention voted to terminate Arkansas's membership in the Union and join the Confederate States of America.\n\nArkansas held a very important position for the Rebels, maintaining control of the Mississippi River and surrounding Southern states. The bloody Battle of Wilson's Creek just across the border in Missouri shocked many Arkansans who thought the war would be a quick and decisive Southern victory. Battles early in the war took place in northwest Arkansas, including the Battle of Cane Hill, Battle of Pea Ridge, and Battle of Prairie Grove. Union General Samuel Curtis swept across the state to Helena in the Delta in 1862. Little Rock was captured the following year. The government shifted the state Confederate capital to Hot Springs, and then again to Washington from 1863–1865, for the remainder of the war. Throughout the state, guerrilla warfare ravaged the countryside and destroyed cities.Arnold et al. 2002, p. 200. Passion for the Confederate cause waned after implementation of programs such as the draft, high taxes, and martial law.\n\nUnder the Military Reconstruction Act, Congress declared Arkansas restored to the Union in June 1868, after the Legislature accepted the 14th Amendment. The Republican-controlled reconstruction legislature established universal male suffrage (though temporarily disfranchising former Confederate Army officers, who were all Democrats), a public education system for blacks and whites, and passed general issues to improve the state and help more of the population. The State soon came under control of the Radical Republicans and Unionists, and led by Governor Powell Clayton, they presided over a time of great upheaval as Confederate sympathizers and the Ku Klux Klan fought the new developments, particularly voting rights for African Americans.\n\nEnd of the Reconstruction \n\nIn 1874, the Brooks-Baxter War, a political struggle between factions of the Republican Party shook Little Rock and the state governorship. It was settled only when President Ulysses S. Grant ordered Joseph Brooks to disperse his militant supporters.\n\nFollowing the Brooks-Baxter War, a new state constitution was ratified, re-enfranchising former Confederates.\n\nIn 1881, the Arkansas state legislature enacted a bill that adopted an official pronunciation of the state's name, to combat a controversy then simmering. (See Law and Government below.)\n\nAfter Reconstruction, the state began to receive more immigrants and migrants. Chinese, Italian, and Syrian men were recruited for farm labor in the developing Delta region. None of these nationalities stayed long at farm labor; the Chinese especially quickly became small merchants in towns around the Delta. Many Chinese became such successful merchants in small towns that they were able to educate their children at college.William D. Baker, [http://www.arkansaspreservation.org/pdf/publications/Minority_Settlement.pdf Minority Settlement in the Mississippi River Counties of the Arkansas Delta, 1870–1930] , Arkansas Preservation Commission. Retrieved May 14, 2008\n\nSome early 20th-century immigration included people from eastern Europe. Together, these immigrants made the Delta more diverse than the rest of the state. In the same years, some black migrants moved into the area because of opportunities to develop the bottomlands and own their own property.\n\nConstruction of railroads enabled more farmers to get their products to market. It also brought new development into different parts of the state, including the Ozarks, where some areas were developed as resorts. In a few years at the end of the 19th century, for instance, Eureka Springs in Carroll County grew to 10,000 people, rapidly becoming a tourist destination and the fourth-largest city of the state. It featured newly constructed, elegant resort hotels and spas planned around its natural springs, considered to have healthful properties. The town's attractions included horse racing and other entertainment. It appealed to a wide variety of classes, becoming almost as popular as Hot Springs.\n\nRise of the Jim Crow Laws \n\nIn the late 1880s, the worsening agricultural depression catalyzed Populist and third party movements, leading to interracial coalitions. Struggling to stay in power, in the 1890s the Democrats in Arkansas followed other Southern states in passing legislation and constitutional amendments that disfranchised blacks and poor whites. Democrats wanted to prevent their alliance. In 1891 state legislators passed a requirement for a literacy test, knowing that it would exclude many blacks and whites. At the time when more than 25% of the population could neither read nor write. In 1892, they amended the state constitution to require a poll tax and more complex residency requirements, both of which adversely affected poor people and sharecroppers, forcing most blacks and many poor whites from voter rolls.\n\nBy 1900 the Democratic Party expanded use of the white primary in county and state elections, further denying blacks a part in the political process. Only in the primary was there any competition among candidates, as Democrats held all the power. The state was a Democratic one-party state for decades, until after passage of the federal Civil Rights Act of 1964 and Voting Rights Act of 1965 to enforce constitutional rights.[http://www.oldstatehouse.com/educational_programs/classroom/arkansas_news/detail.asp?id800&issue_id\n36&page=3 \"White Primary\" System Bars Blacks from Politics – 1900\", The Arkansas News, Old State House, Spring 1987, p.3. Retrieved March 22, 2008.] \n\nBetween 1905 and 1911, Arkansas began to receive a small immigration of German, Slovak, and Scots-Irish from Europe. The German and Slovak peoples settled in the eastern part of the state known as the Prairie, and the Irish founded small communities in the southeast part of the state. The Germans were mostly Lutheran and the Slovaks were primarily Catholic. The Irish were mostly Protestant from Ulster, of Scots and Northern Borders descent.\n\nBased on the order of President Franklin D. Roosevelt given shortly after Imperial Japan's attack on Pearl Harbor, nearly 16,000 Japanese Americans were forcibly removed from the West Coast of the United States and incarcerated in two internment camp located in the Arkansas Delta. The Rohwer Camp in Desha County operated from September 1942 to November 1945 and at its peak interned 8,475 prisoners. The Jerome War Relocation Center in Drew County operated from October 1942 to June 1944 and held c. 8,000 prisoners.\n\nFall of Segregation \n\nAfter the Supreme Court's decision in Brown v. Board of Education of Topeka, Kansas in 1954 that segregation in public schools was unconstitutional, some students worked to integrate schools in the state. The Little Rock Nine brought Arkansas to national attention in 1957 when the Federal government had to intervene to protect African-American students trying to integrate a high school in the Arkansas capital. Governor Orval Faubus had ordered the Arkansas National Guard to aid segregationists in preventing nine African-American students from enrolling at Little Rock's Central High School. After attempting three times to contact Faubus, President Dwight D. Eisenhower sent 1000 troops from the active-duty 101st Airborne Division to escort and protect the African-American students as they entered school on September 25, 1957. In defiance of federal court orders to integrate, the governor and city of Little Rock decided to close the high schools for the remainder of the school year. By the fall of 1959, the Little Rock high schools were completely integrated.\n\nProminent American Figures from Arkansas \n\nBill Clinton, the 42nd President of the United States, was born in Hope. Before his presidency, Clinton served as the 40th and 42nd Governor of Arkansas, a total of nearly 12 years.\n\nCities and towns\n\nLittle Rock has been Arkansas's capital city since 1821 when it replaced Arkansas Post as the capital of the Territory of Arkansas. The state capitol was moved to Hot Springs and later Washington during the Civil War when the Union armies threatened the city in 1862, and state government did not return to Little Rock until after the war ended. Today, the Little Rock–North Little Rock–Conway metropolitan area is the largest in the state, with a population of 724,385 in 2013.\n\nThe Fayetteville–Springdale–Rogers Metropolitan Area is the second-largest metropolitan area in Arkansas, growing at the fastest rate due to the influx of businesses and the growth of the University of Arkansas and Walmart.\n\nThe state has eight cities with populations above 50,000 (based on 2010 census). In descending order of size, they are: Little Rock, Fort Smith, Fayetteville, Springdale, Jonesboro, North Little Rock, Conway, and Rogers. Of these, only Fort Smith and Jonesboro are outside the two largest metropolitan areas. Other cities are located in Arkansas such as Pine Bluff, Crossett, Bryant, Lake Village, Hot Springs, Bentonville, Texarkana, Sherwood, Jacksonville, Russellville, Bella Vista, West Memphis, Paragould, Cabot, Searcy, Van Buren, El Dorado, Blytheville, Harrison, Dumas, Rison, Warren, and Mountain Home.\n\nDemographics\n\nPopulation\n\nThe United States Census Bureau estimates that the population of Arkansas was 2,978,204 on July 1, 2015, a 2.14% increase since the 2010 United States Census.\n\nAs of 2015, Arkansas has an estimated population of 2,978,204. From fewer than 15,000 in 1820, Arkansas's population grew to 52,240 during a special census in 1835, far exceeding the 40,000 required to apply for statehood.Arnold et al. 2002, p. 106. Following statehood in 1836, the population doubled each decade until the 1870 Census conducted following the Civil War. The state recorded growth in each successive decade, although it gradually slowed in the 20th century.\n\nIt recorded population losses in the 1950 and 1960 Censuses. This outmigration was a result of multiple factors, including farm mechanization, decreasing labor demand, and young educated people leaving the state due to a lack of non-farming industry in the state. Arkansas again began to grow, recording positive growth rates ever since and exceeding the 2 million mark during the 1980 Census. Arkansas's rate of change, age distributions, and gender distributions mirror national averages. Minority group data also approximates national averages. There are fewer people in Arkansas of Hispanic or Latino origin than the national average. The center of population of Arkansas for 2000 was located in Perry County, near Nogal.\n\nAncestry\n\nIn terms of race and ethnicity, the state was 80.1% white (74.2% non-Hispanic white), 15.6% black or African American, 0.9% American Indian and Alaska Native, 1.3% Asian, and 1.8% from two or more races. Hispanics or Latinos of any race made up 6.6% of the population.\n\nAs of 2011, 39.0% of Arkansas's population younger than age 1 were minorities.\n\nEuropean Americans have a strong presence in the northwestern Ozarks and the central part of the state. African Americans live mainly in the southern and eastern parts of the state. Arkansans of Irish, English and German ancestry are mostly found in the far northwestern Ozarks near the Missouri border. Ancestors of the Irish in the Ozarks were chiefly Scots-Irish, Protestants from Northern Ireland, the Scottish lowlands and northern England part of the largest group of immigrants from Great Britain and Ireland before the American Revolution. English and Scots-Irish immigrants settled throughout the backcountry of the South and in the more mountainous areas. Americans of English stock are found throughout the state.David Hackett Fischer, Albion's Seed: Four British Folkways in America, New York: Oxford University Press, 1989, pp.633–639\n\nA 2010 survey of the principal ancestries of Arkansas's residents revealed the following:\n* 15.5% African American\n* 12.3% Irish\n* 11.5% German\n* 11.0% American\n* 10.1% English\n* 4.7% Mexican\n* 2.1% French\n* 1.7% Scottish\n* 1.7% Dutch\n* 1.6% Italian\n* 1.4% Scots-Irish\n\nMost of the people identifying as American are of English descent and/or Scots-Irish descent. Their families have been in the state so long, in many cases since before statehood, that they choose to identify simply as having American ancestry or do not in fact know their own ancestry. Their ancestry primarily goes back to the original 13 colonies and for this reason many of them today simply claim American ancestry. Many people who identify themselves as Irish descent are in fact of Scots-Irish descent.[https://books.google.com/books?idSVoAXh-dNuYC&pg\nPA57&dqSharing+the+dream:+white+males+in+multicultural+America++english+ancestry&cd\n1#vonepage&q\n&f=false Sharing the Dream: White Males in a Multicultural America] By Dominic J. Pulera.Reynolds Farley, 'The New Census Question about Ancestry: What Did It Tell Us?', Demography, Vol. 28, No. 3 (August 1991), pp. 414, 421.Stanley Lieberson and Lawrence Santi, 'The Use of Nativity Data to Estimate Ethnic Characteristics and Patterns', Social Science Research, Vol. 14, No. 1 (1985), pp. 44–6.Stanley Lieberson and Mary C. Waters, 'Ethnic Groups in Flux: The Changing Ethnic Responses of American Whites', Annals of the American Academy of Political and Social Science, Vol. 487, No. 79 (September 1986), pp. 82–86.\n\nAccording to the 2006–2008 American Community Survey, 93.8% of Arkansas's population (over the age of five) spoke only English at home. About 4.5% of the state's population spoke Spanish at home. About 0.7% of the state's population spoke any other Indo-European languages. About 0.8% of the state's population spoke an Asian language, and 0.2% spoke other languages.\n\nReligion\n\nArkansas, like most other Southern states, is part of the Bible Belt and is predominantly Protestant. The largest denominations by number of adherents in 2010 were the Southern Baptist Convention with 661,382; the United Methodist Church with 158,574; non-denominational Evangelical Protestants with 129,638; and the Catholic Church with 122,662. There are some residents of the state who live by other religions such as Islam, Judaism, Wicca, Paganism, Hinduism, Buddhism or who claim no religious affiliation.\n\nEconomy\n\nOnce a state with a cashless society in the uplands and plantation agriculture in the lowlands, Arkansas's economy has evolved and diversified. The state's gross domestic product (GDP) was $119 billion in 2015. Six Fortune 500 companies are based in Arkansas, including the world's #1 retailer, Walmart; Tyson Foods, J.B. Hunt, Dillard's, Murphy USA, and Windstream are also headquartered in the state. The per capita personal income in 2015 was $39,107, ranking forty-fifth in the nation. The median household income from 2011–15 was $41,371, ranking forty-ninth in the nation. The state's agriculture outputs are poultry and eggs, soybeans, sorghum, cattle, cotton, rice, hogs, and milk. Its industrial outputs are food processing, electric equipment, fabricated metal products, machinery, and paper products. Mines in Arkansas produce natural gas, oil, crushed stone, bromine, and vanadium. According to CNBC, Arkansas ranks as the 20th best state for business, with the 2nd-lowest cost of doing business, 5th-lowest cost of living, 11th best workforce, 20th-best economic climate, 28th-best educated workforce, 31st-best infrastructure and the 32nd-friendliest regulatory environment.  Arkansas gained twelve spots in the best state for business rankings since 2011. As of 2014, Arkansas was the most affordable U.S. state to live in.\n\nAs of November 2016 the state's unemployment rate is 4.0%\n\nIndustry and commerce\n\nArkansas's earliest industries were fur trading and agriculture, with development of cotton plantations in the areas near the Mississippi River. They were dependent on slave labor through the American Civil War.\n\nToday only approximately 3% of the population is employed in the agricultural sector, it remains a major part of the state's economy, ranking 13th in the nation in the value of products sold. The state is the U.S.'s largest producer of rice, broilers, and turkeys,U.S. Department of Agriculture, National Agricultural Statistics Service, Poultry – Production and Value, 2010 Summary, data indicates Arkansas led the nation in 2008, 2009, and 2010, in both broilers and turkeys. and ranks in the top three for cotton, pullets, and aquaculture (catfish). Forestry remains strong in the Arkansas Timberlands, and the state ranks fourth nationally and first in the South in softwood lumber production. Automobile parts manufacturers have opened factories in eastern Arkansas to support auto plants in other states. Bauxite was formerly a large part of the state's economy, mined mostly around Saline County.\n\nTourism is also very important to the Arkansas economy; the official state nickname \"The Natural State\" was created for state tourism advertising in the 1970s, and is still used to this day. The state maintains 52 state parks and the National Park Service maintains seven properties in Arkansas. The completion of the William Jefferson Clinton Presidential Library in Little Rock has drawn many visitors to the city and revitalized the nearby River Market District. Many cities also hold festivals, which draw touristss to Arkansas culture, such as The Bradley County Pink Tomato Festival in Warren, King Biscuit Blues Festival, Ozark Folk Festival, Toad Suck Daze, and Tontitown Grape Festival.\n\nMedia\n\nAs of 2010 many Arkansas local newspapers are owned by WEHCO Media, Alabama-based Lancaster Management, Kentucky-based Paxton Media Group, Missouri-based Rust Communications, Nevada-based Stephens Media, and New York-based GateHouse Media.\n\nCulture\n\nThe culture of Arkansas is available to all in various forms, whether it be architecture, literature, or fine and performing arts. The state's culture also includes distinct cuisine, dialect, and traditional festivals. Sports are also very important to the culture of Arkansas, ranging from football, baseball, and basketball to hunting and fishing. Perhaps the best-known piece of Arkansas's culture is the stereotype of its citizens as shiftless hillbillies.Arnold et al. 2002, p. 115. The reputation began when the state was characterized by early explorers as a savage wilderness full of outlaws and thieves.Blevins 2009, p. 15. The most enduring icon of Arkansas's hillbilly reputation is The Arkansas Traveller, a painted depiction of a folk tale from the 1840s.Blevins 2009, p. 30. Although intended to represent the divide between rich southeastern plantation Arkansas planters and the poor northwestern hill country, the meaning was twisted to represent a Northerner lost in the Ozarks on a white horse asking a backwoods Arkansan for directions.Sutherlin 1996, p. 20. The state also suffers from the racial stigma common to former Confederate states, with historical events such as the Little Rock Nine adding to Arkansas's enduring image.Sutherlin 1996, p. 17.\n\nArt and history museums display pieces of cultural value for Arkansans and tourists to enjoy. Crystal Bridges Museum of American Art in Bentonville was visited by 604,000 people in 2012, its first year. The museum includes walking trails and educational opportunities in addition to displaying over 450 works covering five centuries of American art. Several historic town sites have been restored as Arkansas state parks, including Historic Washington State Park, Powhatan Historic State Park, and Davidsonville Historic State Park.\n\nArkansas features a variety of native music across the state, ranging from the blues heritage of West Memphis, Pine Bluff, Helena-West Helena to rockabilly, bluegrass, and folk music from the Ozarks. Festivals such as the King Biscuit Blues Festival and Bikes, Blues, and BBQ pay homage to the history of blues in the state. The Ozark Folk Festival in Mountain View is a celebration of Ozark culture and often features folk and bluegrass musicians. Literature set in Arkansas such as I Know Why the Caged Bird Sings by Maya Angelou and A Painted House by John Grisham describe the culture at various time periods.\n\nSports and recreation\n\nSports have become an integral part of the culture of Arkansas, and her residents enjoy participating in and spectating various events throughout the year.\n\nTeam sports and especially collegiate football have been important to Arkansans. College football in Arkansas began from humble beginnings. The University of Arkansas first fielded a team in 1894 when football was a very dangerous game. Recent studies of the damage to team members from the concussions common in football make it clear that the danger persists.\n\n\"Calling the Hogs\" is a cheer that shows support for the Razorbacks, one of the two NCAA Division I Football Bowl Subdivision (FBS) teams in the state. High school football also began to grow in Arkansas in the early 20th century. Over the years, many Arkansans have looked to the Razorbacks football team as the public image of the state. Following the Little Rock Nine integration crisis at Little Rock Central High School, Arkansans looked to the successful Razorback teams in the following years to repair the state's reputation. Although the University of Arkansas is based in Fayetteville, the Razorbacks have always played at least one game per season at War Memorial Stadium in Little Rock in an effort to keep fan support in central and south Arkansas.\n\nArkansas State University joined the University of Arkansas in FBS (then known as Division I-A) in 1992 after playing in lower divisions for nearly two decades. The two schools have never played each other, due to the University of Arkansas's policy of not playing intrastate games. Two other campuses of the University of Arkansas System are Division I members. The University of Arkansas at Pine Bluff is a member of the Southwestern Athletic Conference, a league whose members all play football in the second-level Football Championship Subdivision (FCS). The University of Arkansas at Little Rock is a member of the FBS Sun Belt Conference, but is one of two conference schools that has no football program. The state's other Division I member is the University of Central Arkansas, which is a full member (including football) of the FCS Southland Conference.\n\nSeven of Arkansas's smaller colleges play in NCAA Division II, with six in the Great American Conference and one in the Heartland Conference. Two other small Arkansas colleges compete in NCAA Division III, in which athletic scholarships are prohibited.\n\nBaseball runs deep in Arkansas and has been popular before the state hosted Major League Baseball (MLB) spring training in Hot Springs from 1886-1920s. Two minor league teams are based in the state. The Arkansas Travelers play at Dickey-Stephens Park in North Little Rock, and the Northwest Arkansas Naturals play in Arvest Ballpark in Springdale. Both teams compete in the Texas League.\n\nRelated to the state's frontier past, hunting continues in the state. The state created the Arkansas Game and Fish Commission in 1915 to regulate hunting and enforce those regulations. Today a significant portion of Arkansas's population participates in hunting duck in the Mississippi flyway and deer across the state.Sutherlin 1996, p. 164. Millions of acres of public land are available for both bow and modern gun hunters.\n\nFishing has always been popular in Arkansas, and the sport and the state have benefited from the creation of reservoirs across the state. Following the completion of Norfork Dam, the Norfork Tailwater and the White River have become a destination for trout fishers. Several smaller retirement communities such as Bull Shoals, Hot Springs Village, and Fairfield Bay have flourished due to their position on a fishing lake. The Buffalo National River has been preserved in its natural state by the National Park Service and is frequented by fly fishers annually.\n\nHealth\n\nArkansas, as with many Southern states, have a high incidence of premature death, infant mortality, cardiovascular deaths, and occupational fatalities compared to the rest of the United States. The state is tied for 43rd with New York in percentage of adults who regularly exercise. Arkansas is usually ranked as one of the least healthy states due to high obesity, smoking, and sedentary lifestyle rates. In contrast though a Gallup poll demonstrates that Arkansas made the most immediate progress in reducing its number of uninsured residents following the passage of the Affordable Care Act. The percentage of uninsured in Arkansas dropped from 22.5 percent in 2013 to 12.4 percent in August 2014.\n\nThe Arkansas Clean Indoor Air Act went into effect in 2006, a statewide smoking ban excluding bars and some restaurants.\n\nHealthcare in Arkansas is provided by a network of hospitals as members of the Arkansas Hospital Association. Major institutions with multiple branches include Baptist Health, Community Health Systems, and HealthSouth. The University of Arkansas for Medical Sciences (UAMS) in Little Rock operates the UAMS Medical Center, a teaching hospital ranked as high performing nationally in cancer and nephrology. The pediatric division of UAMS Medical Center is known as Arkansas Children's Hospital, nationally ranked in pediatric cardiology and heart surgery. Together, these two institutions are the state's only Level I trauma centers.\n\nEducation\n\nArkansas has 1,064 state-funded kindergartens, elementary, junior- and senior high schools.\n\nThe state supports a network of public universities and colleges, including two major university systems: Arkansas State University System and University of Arkansas System. The University of Arkansas, flagship campus of the University of Arkansas System in Fayetteville was ranked #63 among public schools in the nation by U.S. News & World Report. Other public institutions include University of Arkansas at Pine Bluff, Arkansas Tech University, Henderson State University, Southern Arkansas University, and University of Central Arkansas across the state. It is also home to 11 private colleges and universities including Hendrix College, one of the nation's top 100 liberal arts colleges, according to U.S. News & World Report.\n\nIn the 1920s the state required all children to attend public schools. The school year was set at 131 days, although some areas were unable to meet that requirement.\n\nAlthough unusual in the West, school corporal punishment is not uncommon in Arkansas, with 20,083 public school studentsPlease note this figure refers to only the number of students paddled, regardless of whether a student was spanked multiple times in a year, and does not refer to the number of instances of corporal punishment, which would be substantially higher. paddled at least one time, according to government data for the 2011–2012 school year. The rate of corporal punishment in public schools is higher only in Mississippi.\n\nEducational attainment\n\nArkansas is one of the most under-educated states in the Union. It ranks near the bottom in terms of percentage of the population with either a high school or college degree. The state's educational system has a history of under-funding, low teachers' salaries and political meddling in the curriculum.\n\nEducational statistics during these early days are fragmentary and unreliable. Many counties did not submit full reports to the Secretary of State who did double-duty as Commissioner of Common Schools. However, the percentage of Whites over twenty years of age who were illiterate was given as:\n* 1840   21%\n* 1850   25%\n* 1860   17%\n\nIn 2010 Arkansas students earned an average score of 20.3 on the ACT exam, just below the national average of 21. These results were expected due to the large increase in the number of students taking the exam since the establishment of the Academic Challenge Scholarship. Top high schools receiving recognition from the U.S. News & World Report are spread across the state, including Haas Hall Academy in Fayetteville, KIPP Delta Collegiate in Helena-West Helena, Bentonville, Rogers, Rogers Heritage, Valley Springs, Searcy, and McCrory. A total of 81 Arkansas high schools were ranked by the U.S. News & World Report in 2012.\n\nArkansas ranks as the 32nd smartest state on the Morgan Quitno Smartest State Award, 44th in percentage of residents with at least a high school diploma, and 48th in percentage of bachelor's degree attainment. Arkansas has been making strides in education reform. Education Week has praised the state, ranking Arkansas in the top 10 of their Quality Counts Education Rankings every year since 2009 while scoring it in the top 5 during 2012 and 2013.http://www.edweek.org/media/qualitycounts2012_release.pdfhttp://www.edweek.org/media/QualityCounts2013_Release.pdf Arkansas specifically received an A in Transition and Policy Making for progress in this area consisting of early-childhood education, college readiness, and career readiness. Governor Mike Beebe has made improving education a major issue through his attempts to spend more on education. Through reforms, the state is a leader in requiring curricula designed to prepare students for postsecondary education, rewarding teachers for student achievement, and providing incentives for principals who work in lower-tier schools.\n\nFunding\n\nAs an organized territory, and later in the early days of statehood, education was funded by the sales of Federally-controlled public lands. This system was inadequate and prone to local graft. In an 1854 message to the Legislature, Governor Elias N. Conway said, \"We have a common-school law intended as a system to establish common schools in all part of the state; but for the want of adequate means there are very few in operation under this law.\" At this time, only about a quarter of children were enrolled in school.\n By the beginning of the American Civil War, the state had only twenty-five publicly-funded common schools.\n\nIn 1867, the state legislature was still controlled by ex-Confederates. It passed a Common Schools Law that allowed public funded but limited schools to White children.\n\nThe 1868 legislature banned former Confederates and passed a more wide-ranging law detailing funding and administrative issues and allowing Black children to attend school. In furtherance of this, the postwar 1868 state constitution was the first to permit a personal-property tax to fund the lands and buildings for public schools. With the 1868 elections, the first county school commissioners took office.\n\nIn 2014, the state spent $9,616 per student, compared with a national average of about $11,000 putting Arkansas in nineteenth place.\n\nTimeline\n\n1829 Territorial legislature permits townships to establish schools. \n\n1868 State law required racial segregation of schools.\n\n1871 University of Arkansas established.\n\n1873 University of Arkansas at Pine Bluff established as a school to train Black teachers.\n\n1877 Philander Smith College established as a school for Black students.\n\n1890 Henderson State University established as a private school. The state assumed responsibility for it in 1929 as Henderson State Teachers College.\n\n1885 Arkansas School for the Deaf and Arkansas School for the Blind established.\n\n1909 Arkansas Tech University, Southern Arkansas University, University of Arkansas at Monticello and Arkansas State University established as schools offering high school diplomas and vocational training.\n\nc. 1920 Schooling made compulsory.\n\n1925 University of Central Arkansas established as  Arkansas State Normal School established.\n\n1948 University of Arkansas School of Law admits a Black student\n\n1957 Governor Orval Faubus used National Guard troops to oppose racial integration of Little Rock Central High School.\n\n1958 In Cooper v. Aaron the United States Supreme Court ruled the state was bound to integrate school despite the opposition of the governor and legislature.\n\n1983 The Arkansas State Supreme Court ruled the state's funding of education was Constitutionally deficient.\n\nTransportation\n\nTransportation in Arkansas is overseen by the Arkansas Department of Transportation (ArDOT), headquartered in Little Rock. Several main corridors pass through Little Rock, including Interstate 30 (I-30) and I-40 (the nation's 3rd-busiest trucking corridor). In northeast Arkansas, I-55 travels north from Memphis to Missouri, with a new spur to Jonesboro (I-555). Northwest Arkansas is served by I-540 from Fort Smith to Bella Vista, which is a segment of future I-49. The state also has the 13th largest state highway system in the nation.\n\nArkansas is served by 2750 mi of railroad track divided among twenty-six railroad companies including three Class I railroads. Freight railroads are concentrated in southeast Arkansas to serve the industries in the region. The Texas Eagle, an Amtrak passenger train, serves five stations in the state Walnut Ridge, Little Rock, Malvern, Arkadelphia, and Texarkana.\n\nArkansas also benefits from the use of its rivers for commerce. The Mississippi River and Arkansas River are both major rivers. The United States Army Corps of Engineers maintains the McClellan-Kerr Arkansas River Navigation System, allowing barge traffic up the Arkansas River to the Port of Catoosa in Tulsa, Oklahoma.\n\nThere are four airports with commercial service: Clinton National Airport, Northwest Arkansas Regional Airport, Fort Smith Regional Airport, and Texarkana Regional Airport, with dozens of smaller airports in the state.\n\nPublic transit and community transport services for the elderly or those with developmental disabilities are provided by agencies such as the Central Arkansas Transit Authority and the Ozark Regional Transit, organizations that are part of the Arkansas Transit Association.\n\nLaw and government\n\nAs with the federal government of the United States, political power in Arkansas is divided into three branches: executive, legislative, and judicial. Each officer's term is four years long. Office holders are term-limited to two full terms plus any partial terms before the first full term.\n\nExecutive\n\nThe Governor of Arkansas is Asa Hutchinson, a Republican, who was inaugurated on January 13, 2015. The six other elected executive positions in Arkansas are lieutenant governor, secretary of state, attorney general, treasurer, auditor, and land commissioner.Arkansas Code 7 May 806. The governor also appoints qualified individuals to lead various state boards, committees, and departments. Arkansas governors served two-year terms until a referendum lengthened the term to four years, effective with the 1986 general election.\n\nIn Arkansas, the lieutenant governor is elected separately from the governor and thus can be from a different political party.\n\nLegislative\n\nThe Arkansas General Assembly is the state's bicameral bodies of legislators, composed of the Senate and House of Representatives. The Senate contains 35 members from districts of approximately equal population. These districts are redrawn decennially with each US census, and in election years ending in \"2\", the entire body is put up for reelection. Following the election, half of the seats are designated as two-year seats and are up for reelection again in two years, these \"half-terms\" do not count against a legislator's term limits. The remaining half serve a full four-year term. This staggers elections such that half the body is up for re-election every two years and allows for complete body turnover following redistricting. Arkansas voters selected a 21–14 Republican majority in the Senate in 2012. Arkansas House members can serve a maximum of three two-year terms. House districts are redistricted by the Arkansas Board of Apportionment. Following the 2012 elections, Republicans gained a 51–49 majority in the House of Representatives.\n\nThe Republican Party majority status in the Arkansas State House of Representatives following the 2012 elections is the party's first since 1874. Arkansas was the last state of the old Confederacy to never have Republicans control either chamber of its house since the Civil War.\n\nFollowing the term limits changes, studies have shown that lobbyists have become less influential in state politics. Legislative staff, not subject to term limits, have acquired additional power and influence due to the high rate of elected official turnover.\n\nJudicial\n\nArkansas's judicial branch has five court systems: Arkansas Supreme Court, Arkansas Court of Appeals, Circuit Courts, District Courts and City Courts.\n\nMost cases begin in district court, which is subdivided into state district court and local district court. State district courts exercise district-wide jurisdiction over the districts created by the General Assembly, and local district courts are presided over by part-time judges who may privately practice law. 25 state district court judges preside over 15 districts, with more districts created in 2013 and 2017. There are 28 judicial circuits of Circuit Court, with each contains five subdivisions: criminal, civil, probate, domestic relations, and juvenile court. The jurisdiction of the Arkansas Court of Appeals is determined by the Arkansas Supreme Court, and there is no right of appeal from the Court of Appeals to the high court. The Arkansas Supreme Court can review Court of Appeals cases upon application by either a party to the litigation, upon request by the Court of Appeals, or if the Arkansas Supreme Court feels the case should have been initially assigned to it. The twelve judges of the Arkansas Court of Appeals are elected from judicial districts to renewable six-year terms.\n\nThe Arkansas Supreme Court is the court of last resort in the state, composed of seven justices elected to eight-year terms. Established by the Arkansas Constitution in 1836, the court's decisions can be appealed to only the Supreme Court of the United States.\n\nFederal\n\nBoth of Arkansas's U.S. Senators, John Boozman and Tom Cotton, are Republicans. The state has four seats in U.S. House of Representatives. All four seats are held by Republicans: Rick Crawford (1st district), French Hill (2nd district), Steve Womack (3rd district), and Bruce Westerman (4th district).\n\nPolitics\n\nArkansas Governor Bill Clinton brought national attention to the state with a long speech at the 1988 Democratic National Convention endorsing Michael Dukakis. Some journalists suggested the speech was a threat to his ambitions; Clinton defined it \"a comedy of error, just one of those fluky things\". Clinton won the Democratic nomination for President the following cycle. Presenting himself as a \"New Democrat\" and using incumbent George H. W. Bush's broken promise against him, Clinton won the 1992 presidential election (43.0% of the vote) against Republican Bush (37.4% of the vote) and billionaire populist Ross Perot, who ran as an independent (18.9% of the vote).\n\nMost Republican strength traditionally lay mainly in the northwestern part of the state, particularly Fort Smith and Bentonville, as well as North Central Arkansas around the Mountain Home area. In the latter area, Republicans have been known to get 90 percent or more of the vote, while the rest of the state was more Democratic. After 2010, Republican strength expanded further to the Northeast and Southwest and into the Little Rock suburbs. The Democrats are mostly concentrated to central Little Rock, the Mississippi Delta, the Pine Bluff area, and the areas around the southern border with Louisiana.\n\nArkansas has only elected three Republicans to the U.S. Senate since Reconstruction: Tim Hutchinson, who was defeated after one term by Mark Pryor; John Boozman, who defeated incumbent Blanche Lincoln; and Tom Cotton, who defeated Mark Pryor in the 2014 elections. Before 2013, the General Assembly had not been controlled by the Republican Party since Reconstruction, with the GOP holding a 51-seat majority in the state House and a 21-seat (of 35) in the state Senate following victories in 2012. Arkansas was one of just three states among the states of the former Confederacy that sent two Democrats to the U.S. Senate (the others being Florida and Virginia) for any period during the first decade of the 21st century.\n\nIn 2010, Republicans captured three of the state's four seats in the U.S. House of Representatives. In 2012, Republicans won election for all four House seats. Arkansas held the distinction of having a U.S. House delegation composed entirely of military veterans (Rick Crawford – Army; Tim Griffin – Army Reserve; Steve Womack – Army National Guard, Tom Cotton- Army). In 2014, the last Democrat in Arkansas's Congressional Delegation, Mark Pryor, was defeated in campaign to win a third term in the U.S. Senate, leaving the entire congressional delegation in GOP hands for the first time since Reconstruction.\n\nReflecting the state's large evangelical population, the state has a strong social conservative bent. Under the Arkansas Constitution Arkansas is a right to work state, its voters passed a ban on same-sex marriage with 75% voting yes, and the state is one of a handful with legislation on its books banning abortion in the event Roe v. Wade is ever overturned.\n\nAttractions\n\nArkansas is home to many areas protected by the National Park System. These include:\n* Arkansas Post National Memorial at Gillett\n* Blanchard Springs Caverns\n* Buffalo National River\n* Fort Smith National Historic Site\n* Hot Springs National Park\n* Little Rock Central High School National Historic Site\n* Pea Ridge National Military Park\n* President William Jefferson Clinton Birthplace Home National Historic Site\n* Arkansas State Capitol Building\n* List of Arkansas state parks",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Arkansas" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1930" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Arkansas ( ) is a state in the southeastern region of the United States, home to over 3 million people as of 2017.Jones, Daniel (1997) English Pronouncing Dictionary, 15th ed. Cambridge University Press. . Its name is of Siouan derivation from the language of the Osage denoting their related kin, the Quapaw Indians. The state's diverse geography ranges from the mountainous regions of the Ozark and the Ouachita Mountains, which make up the U.S. Interior Highlands, to the densely forested land in the south known as the Arkansas Timberlands, to the eastern lowlands along the Mississippi River and the Arkansas Delta.\n\nArkansas is the 29th largest by area and the 33rd most populous of the 50 United States. The capital and most populous city is Little Rock, located in the central portion of the state, a hub for transportation, business, culture, and government. The northwestern corner of the state, such as the Fayetteville–Springdale–Rogers Metropolitan Area and Fort Smith metropolitan area, is a population, education, and economic center. The largest city in the state's eastern part is Jonesboro. The largest city in the state's southeastern part is Pine Bluff.\n\nThe Territory of Arkansas was admitted to the Union as the 25th state on June 15, 1836. In 1861 Arkansas withdrew from the United States and joined the Confederate States of America during the Civil War. On returning to the Union in 1868, the state continued to suffer due to its earlier reliance on slavery and the plantation economy, causing the state to fall behind economically and socially. White rural interests continued to dominate the state's politics until the Civil Rights Movement. Arkansas began to diversify its economy following World War II and relies on its service industry, aircraft, poultry, steel, tourism, cotton, and rice.\n\nThe culture of Arkansas is observable in museums, theaters, novels, television shows, restaurants, and athletic venues across the state. Arkansas's enduring image has earned the state \"a special place in the American consciousness\". People such as politician and educational advocate William Fulbright; former President Bill Clinton who served as the 40th and 42nd Governor of Arkansas; his wife, former Secretary of State Hillary Rodham Clinton; former NATO Supreme Allied Commander General Wesley Clark, Walmart magnate Sam Walton; singer-songwriters Johnny Cash and Glen Campbell; the poet C.D. Wright; and physicist William L. McMillan, who was a pioneer in superconductor research; have all lived in Arkansas.\n\nEtymology\n\nThe name Arkansas derives from the same root as the name for the state of Kansas. The Kansa tribe of Native Americans are closely associated with the Sioux tribes of the Great Plains. The word \"Arkansas\" itself is a French pronunciation (\"Arcansas\") of a Quapaw (a related \"Kaw\" tribe) word, akakaze, meaning \"land of downriver people\" or the Sioux word akakaze meaning \"people of the south wind\".\n\nIn 1881, the pronunciation of Arkansas with the final \"s\" being silent was made official by an act of the state legislature after a dispute arose between Arkansas's two U.S. senators as one favored the pronunciation as  while the other favored .\n\nIn 2007, the state legislature passed a non-binding resolution declaring that the possessive form of the state's name is Arkansas's, which has been followed increasingly by the state government.\n\nGeography\n\nBoundaries\n\nArkansas borders Louisiana to the south, Texas to the southwest, Oklahoma to the west, Missouri to the north, as well as Tennessee and Mississippi on the east. The United States Census Bureau classifies Arkansas as a southern state, sub-categorized among the West South Central States. The Mississippi River forms most of Arkansas's eastern border, except in Clay and Greene, counties where the St. Francis River forms the western boundary of the Missouri Bootheel, and in many places where the channel of the Mississippi has meandered (or been straightened by man) from its original 1836 course.\n\nTerrain\n\nArkansas can generally be split into two halves, the highlands in the northwest half and the lowlands of the southeastern half.Smith 1989, p. 15. The highlands are part of the Southern Interior Highlands, including The Ozarks and the Ouachita Mountains. The southern lowlands include the Gulf Coastal Plain and the Arkansas Delta.Smith 1989, pp. 15–17. This dual split can yield to general regions named northwest, southwest, northeast, southeast, or central Arkansas. These directionally named regions are broad and not defined along county lines. Arkansas has seven distinct natural regions: the Ozark Mountains, Ouachita Mountains, Arkansas River Valley, Gulf Coastal Plain, Crowley's Ridge, and the Arkansas Delta, with Central Arkansas sometimes included as a blend of multiple regions.\n\nThe southeastern part of Arkansas along the Mississippi Alluvial Plain is sometimes called the Arkansas Delta. This region is a flat landscape of rich alluvial soils formed by repeated flooding of the adjacent Mississippi. Farther away from the river, in the southeast portion of the state, the Grand Prairie consists of a more undulating landscape. Both are fertile agricultural areas. The Delta region is bisected by a geological formation known as Crowley's Ridge. A narrow band of rolling hills, Crowley's Ridge rises from 250 to above the surrounding alluvial plain and underlies many of the major towns of eastern Arkansas.Smith 1989, p. 19.\n\nNorthwest Arkansas is part of the Ozark Plateau including the Ozark Mountains, to the south are the Ouachita Mountains, and these regions are divided by the Arkansas River; the southern and eastern parts of Arkansas are called the Lowlands.Federal Writers' Project 1987, p. 6. These mountain ranges are part of the U.S. Interior Highlands region, the only major mountainous region between the Rocky Mountains and the Appalachian Mountains. The highest point in the state is Mount Magazine in the Ouachita Mountains, which rises to 2753 ft above sea level.\n\nHydrology\n\nArkansas has many rivers, lakes, and reservoirs within or along its borders. Major tributaries of the Mississippi River include the Arkansas River, the White River, and the St. Francis River.Federal Writers' Project 1987, p. 8. The Arkansas is fed by the Mulberry River and the Fourche LaFave River in the Arkansas River Valley, which is also home to Lake Dardanelle. The Buffalo River, Little Red River, Black River and Cache River all serve as tributaries to the White River, which also empties into the Mississippi. The Saline River, Little Missouri River, Bayou Bartholomew, and the Caddo River all serve as tributaries to the Ouachita River in south Arkansas, which eventually empties into the Mississippi in Louisiana. The Red River briefly serves as the state's boundary with Texas.Smith 1989, p. 24. Arkansas has few natural lakes and many reservoirs,  such as Bull Shoals Lake, Lake Ouachita, Greers Ferry Lake, Millwood Lake, Beaver Lake, Norfork Lake, DeGray Lake, and Lake Conway.Smith 1989, p. 25.\n\nArkansas is home to many caves, such as Blanchard Springs Caverns. More than 43,000 Native American living, hunting and tool making sites, many of them Pre-Columbian burial mounds and rock shelters, have been cataloged by the State Archeologist. Crater of Diamonds State Park near Murfreesboro is the world's only diamond-bearing site accessible to the public for digging. Arkansas is home to a dozen Wilderness Areas totaling 158444 acre. These areas are set aside for outdoor recreation and are open to hunting, fishing, hiking, and primitive camping. No mechanized vehicles nor developed campgrounds are allowed in these areas.\n\nFlora and fauna\n\nArkansas is divided into three broad ecoregions, the Ozark, Ouachita-Appalachian Forests, Mississippi Alluvial and Southeast USA Coastal Plains, and the Southeastern USA Plainsand two biomes, the subtropical coniferous forest and the temperate deciduous forest. The state is further divided into seven subregions: the Arkansas Valley, Boston Mountains, Mississippi Alluvial Plain, Mississippi Valley Loess Plain, Ozark Highlands, Ouachita Mountains, and the South Central Plains. A 2010 United States Forest Service survey determined 18720000 acre of Arkansas's land is forestland, or 56% of the state's total area. Dominant species in Arkansas's forests include Quercus (oak), Carya (hickory), Pinus echinata (shortleaf pine) and Pinus taeda (loblolly pine).\n\nArkansas's plant life varies with its climate and elevation. The pine belt stretching from the Arkansas delta to Texas consists of dense oak-hickory-pine growth. Lumbering and paper milling activity is active throughout the region.Federal Writers' Project 1987, p. 13. In eastern Arkansas, one can find Taxodium  (cypress), Quercus nigra (water oaks), and hickories with their roots submerged in the Mississippi Valley bayous indicative of the deep south.Federal Writers' Project 1987, p. 12. Nearby Crowley's Ridge is only home of the tulip tree in the state, and generally hosts more northeastern plant life such as the beech tree.Federal Writers' Project 1987, pp. 12–13. The northwestern highlands are covered in an oak-hickory mixture, with Ozark white cedars, cornus (dogwoods), and Cercis canadensis (redbuds) also present. The higher peaks in the Arkansas River Valley play host to scores of ferns, including the Woodsia scopulina and Adiantum (maidenhair fern) on Mount Magazine.Federal Writers' Project 1987, pp. 13–14.\n\nClimate\n\nArkansas generally has a humid subtropical climate. While not bordering the Gulf of Mexico, Arkansas is still close enough to this warm, large body of water for it to influence the weather in the state. Generally, Arkansas has hot, humid summers and slightly drier, mild to cool winters. In Little Rock, the daily high temperatures average around 93 °F with lows around 73 °F in July. In January highs average around 51 °F and lows around 32 °F. In Siloam Springs in the northwest part of the state, the average high and low temperatures in July are 89 and and in January the average high and lows are 44 and. Annual precipitation throughout the state averages between about 40 and; somewhat wetter in the south and drier in the northern part of the state. Snowfall is infrequent but most common in the northern half of the state. The half of the state south of Little Rock is more apt to see ice storms. Arkansas's all-time record high is 120 F at Ozark on August 10, 1936; the all-time record low is  at Gravette, on February 13, 1905.\n\nArkansas is known for extreme weather and frequent storms. A typical year brings thunderstorms, tornadoes, hail, snow and ice storms. Between both the Great Plains and the Gulf States, Arkansas receives around 60 days of thunderstorms. Arkansas is located in Tornado Alley, and as a result, a few of the most destructive tornadoes in U.S. history have struck the state. While sufficiently far from the coast to avoid a direct hit from a hurricane, Arkansas can often get the remnants of a tropical system, which dumps tremendous amounts of rain in a short time and often spawns smaller tornadoes.\n\nHistory\n\nEarly Arkansas\n\nBefore European settlement of North America, Arkansas was inhabited by indigenous peoples for thousands of years. The Caddo, Osage, and Quapaw peoples encountered European explorers. The first of these Europeans was Spanish explorer Hernando de Soto in 1541, who crossed the Mississippi and marched across central Arkansas and the Ozark Mountains. After finding nothing he considered of value and encountering native resistance the entire way, he and his men returned to the Mississippi River where de Soto fell ill. From his deathbed he ordered his men to massacre all of the men of the nearby village of Anilco, who he feared had been plotting with a powerful polity down the Mississippi River, Quigualtam. His men obeyed and did not stop with the men, but were said to have massacred women and children as well. He died the following day in what is believed to be the vicinity of modern day McArthur, Arkansas in May 1542. His body was weighted down with sand and he was consigned to a watery grave in the Mississippi River under cover of darkness by his men. De Soto had attempted to deceive the native population into thinking he was an immortal deity, sun of the sun, in order to forestall attack by outraged Native Americans on his by then weakened and bedraggled army. In order to keep the ruse up, his men informed the locals that de Soto had ascended into the sky. His will at the time of his death listed: \"four Indian slaves, three horses and 700 hogs.\" which were auctioned off to his men. His starving men, who had been living off maize stolen from Native Americans and who had not been allowed to eat the enormous herd of hogs but had had to care for them, immediately started to butcher them. Later on his remaining men, now commanded by his aide de camp Moscoso, attempted an overland return to Mexico. They made it as far as Texas before running into territory too dry for maize farming and too thinly populated to sustain themselves by stealing food from the locals. The expedition promptly backtracked to Arkansas. After building a small fleet of boats they then headed down the Mississippi River and eventually on to Mexico by water.Davidson, James West. After the Fact: The Art of Historical Detection Volume 1. Mc Graw Hill, New York 2010, Chapter 1, p. 2,3 \n\nLater explorers included the French Jacques Marquette and Louis Jolliet in 1673, and Frenchmen Robert La Salle and Henri de Tonti in 1681.Fletcher 1989, p. 26. Tonti established Arkansas Post at a Quapaw village in 1686, making it the first European settlement in the territory.Arnold 1992, p. 75. The early Spanish or French explorers of the state gave it its name, which is probably a phonetic spelling of the Illinois tribe's name for the Quapaw people, who lived downriver from them. The name Arkansas has been pronounced and spelled in a variety of fashions. The region was organized as the Territory of Arkansaw on July 4, 1819, with the territory admitted to the United States as the state of Arkansas on June 15, 1836. The name was historically,, and several other variants. Historically and modernly, the people of Arkansas call themselves either \"Arkansans\" or \"Arkansawyers\". In 1881, the Arkansas General Assembly passed Arkansas Code 1-4-105 ([https://web.archive.org/web/20110924223556/http://www.arkleg.state.ar.us/assembly/ArkansasCode/0/1-4-105.htm official text]):\nWhereas, confusion of practice has arisen in the pronunciation of the name of our state and it is deemed important that the true pronunciation should be determined for use in oral official proceedings.\nAnd, whereas, the matter has been thoroughly investigated by the State Historical Society and the Eclectic Society of Little Rock, which have agreed upon the correct pronunciation as derived from history, and the early usage of the American immigrants.\nBe it therefore resolved by both houses of the General Assembly, that the only true pronunciation of the name of the state, in the opinion of this body, is that received by the French from the native Indians and committed to writing in the French word representing the sound. It should be pronounced in three (3) syllables, with the final \"s\" silent, the \"a\" in each syllable with the Italian sound, and the accent on the first and last syllables. The pronunciation with the accent on the second syllable with the sound of \"a\" in \"man\" and the sounding of the terminal \"s\" is an innovation to be discouraged.\nCitizens of the state of Kansas often pronounce the Arkansas River as, in a manner similar to the common pronunciation of the name of their state.\n\nSettlers, such as fur trappers, moved to Arkansas in the early 18th century. These people used Arkansas Post as a home base and entrepôt. During the colonial period, Arkansas changed hands between France and Spain following the Seven Years' War, although neither showed interest in the remote settlement of Arkansas Post.Arnold et al. 2002, p. 82. In April 1783, Arkansas saw its only battle of the American Revolutionary War, a brief siege of the post by British Captain James Colbert with the assistance of the Choctaw and Chickasaw.\n\nPurchased by the United States \n\nNapoleon Bonaparte sold French Louisiana to the United States in 1803, including all of Arkansas, in a transaction known today as the Louisiana Purchase. French soldiers remained as a garrison at Arkansas Post. Following the purchase, the balanced give-and-take relationship between settlers and Native Americans began to change all along the frontier, including in Arkansas.Arnold et al. 2002, p. 79. Following a controversy over allowing slavery in the territory, the Territory of Arkansas was organized on July 4, 1819. Gradual emancipation in Arkansas was struck down by one vote, the Speaker of the House Henry Clay, allowing Arkansas to organize as a slave territory.Johnson 1965, p. 58.\n\nSlavery became a wedge issue in Arkansas, forming a geographic divide that remained for decades. Owners and operators of the cotton plantation economy in southeast Arkansas firmly supported slavery, as they perceived slave labor as the best or \"only\" economically viable method of harvesting their commodity crops. The \"hill country\" of northwest Arkansas was unable to grow cotton and relied on a cash-scarce, subsistence farming economy.Scroggs 1961, pp. 231–232.\n\nAs European Americans settled throughout the East Coast and into the Midwest, in the 1830s the United States government forced the removal of many Native American tribes to Arkansas and Indian Territory west of the Mississippi River.\n\nAdditional Native American removals began in earnest during the territorial period, with final Quapaw removal complete by 1833 as they were pushed into Indian Territory.White 1962, p. 197. The capital was relocated from Arkansas Post to Little Rock in 1821, during the territorial period.\n\nStatehood\n\nWhen Arkansas applied for statehood, the slavery issue was again raised in Washington, D.C.. Congress eventually approved the Arkansas Constitution after a 25-hour session, admitting Arkansas on June 15, 1836 as the 25th state and the 13th slave state, having a population of about 60,000.Scroggs 1961, p. 243. Arkansas struggled with taxation to support its new state government, a problem made worse by a state banking scandal and worse yet by the Panic of 1837.\n\nCivil War and Reconstruction \n\nIn early antebellum Arkansas, the southeast Arkansas slave based economy developed rapidly. On the eve of the Civil War in 1860, enslaved African Americans numbered 111,115 people, just over 25% of the state's population.[http://fisher.lib.virginia.edu/collections/stats/histcensus/php/state.php Historical Census Browser, 1860 US Census, University of Virginia] . Retrieved March 21, 2008. Plantation agriculture set the state and region behind the nation for decades.Arnold et al. 2002, p. 135. The wealth developed among planters of southeast Arkansas caused a political rift to form between the northwest and southeast.Bolton 1999, p. 22.\n\nMany politicians were elected to office from the Family, the Southern rights political force in antebellum Arkansas. Residents generally wanted to avoid a civil war. When the Gulf states seceded in early 1861, Arkansas voted to remain in the Union. Arkansas did not secede until Abraham Lincoln demanded Arkansas troops be sent to Fort Sumter to quell the rebellion there. On May 6, a state convention voted to terminate Arkansas's membership in the Union and join the Confederate States of America.\n\nArkansas held a very important position for the Rebels, maintaining control of the Mississippi River and surrounding Southern states. The bloody Battle of Wilson's Creek just across the border in Missouri shocked many Arkansans who thought the war would be a quick and decisive Southern victory. Battles early in the war took place in northwest Arkansas, including the Battle of Cane Hill, Battle of Pea Ridge, and Battle of Prairie Grove. Union General Samuel Curtis swept across the state to Helena in the Delta in 1862. Little Rock was captured the following year. The government shifted the state Confederate capital to Hot Springs, and then again to Washington from 1863–1865, for the remainder of the war. Throughout the state, guerrilla warfare ravaged the countryside and destroyed cities.Arnold et al. 2002, p. 200. Passion for the Confederate cause waned after implementation of programs such as the draft, high taxes, and martial law.\n\nUnder the Military Reconstruction Act, Congress declared Arkansas restored to the Union in June 1868, after the Legislature accepted the 14th Amendment. The Republican-controlled reconstruction legislature established universal male suffrage (though temporarily disfranchising former Confederate Army officers, who were all Democrats), a public education system for blacks and whites, and passed general issues to improve the state and help more of the population. The State soon came under control of the Radical Republicans and Unionists, and led by Governor Powell Clayton, they presided over a time of great upheaval as Confederate sympathizers and the Ku Klux Klan fought the new developments, particularly voting rights for African Americans.\n\nEnd of the Reconstruction \n\nIn 1874, the Brooks-Baxter War, a political struggle between factions of the Republican Party shook Little Rock and the state governorship. It was settled only when President Ulysses S. Grant ordered Joseph Brooks to disperse his militant supporters.\n\nFollowing the Brooks-Baxter War, a new state constitution was ratified, re-enfranchising former Confederates.\n\nIn 1881, the Arkansas state legislature enacted a bill that adopted an official pronunciation of the state's name, to combat a controversy then simmering. (See Law and Government below.)\n\nAfter Reconstruction, the state began to receive more immigrants and migrants. Chinese, Italian, and Syrian men were recruited for farm labor in the developing Delta region. None of these nationalities stayed long at farm labor; the Chinese especially quickly became small merchants in towns around the Delta. Many Chinese became such successful merchants in small towns that they were able to educate their children at college.William D. Baker, [http://www.arkansaspreservation.org/pdf/publications/Minority_Settlement.pdf Minority Settlement in the Mississippi River Counties of the Arkansas Delta, 1870–1930] , Arkansas Preservation Commission. Retrieved May 14, 2008\n\nSome early 20th-century immigration included people from eastern Europe. Together, these immigrants made the Delta more diverse than the rest of the state. In the same years, some black migrants moved into the area because of opportunities to develop the bottomlands and own their own property.\n\nConstruction of railroads enabled more farmers to get their products to market. It also brought new development into different parts of the state, including the Ozarks, where some areas were developed as resorts. In a few years at the end of the 19th century, for instance, Eureka Springs in Carroll County grew to 10,000 people, rapidly becoming a tourist destination and the fourth-largest city of the state. It featured newly constructed, elegant resort hotels and spas planned around its natural springs, considered to have healthful properties. The town's attractions included horse racing and other entertainment. It appealed to a wide variety of classes, becoming almost as popular as Hot Springs.\n\nRise of the Jim Crow Laws \n\nIn the late 1880s, the worsening agricultural depression catalyzed Populist and third party movements, leading to interracial coalitions. Struggling to stay in power, in the 1890s the Democrats in Arkansas followed other Southern states in passing legislation and constitutional amendments that disfranchised blacks and poor whites. Democrats wanted to prevent their alliance. In 1891 state legislators passed a requirement for a literacy test, knowing that it would exclude many blacks and whites. At the time when more than 25% of the population could neither read nor write. In 1892, they amended the state constitution to require a poll tax and more complex residency requirements, both of which adversely affected poor people and sharecroppers, forcing most blacks and many poor whites from voter rolls.\n\nBy 1900 the Democratic Party expanded use of the white primary in county and state elections, further denying blacks a part in the political process. Only in the primary was there any competition among candidates, as Democrats held all the power. The state was a Democratic one-party state for decades, until after passage of the federal Civil Rights Act of 1964 and Voting Rights Act of 1965 to enforce constitutional rights.[http://www.oldstatehouse.com/educational_programs/classroom/arkansas_news/detail.asp?id800&issue_id\n36&page=3 \"White Primary\" System Bars Blacks from Politics – 1900\", The Arkansas News, Old State House, Spring 1987, p.3. Retrieved March 22, 2008.] \n\nBetween 1905 and 1911, Arkansas began to receive a small immigration of German, Slovak, and Scots-Irish from Europe. The German and Slovak peoples settled in the eastern part of the state known as the Prairie, and the Irish founded small communities in the southeast part of the state. The Germans were mostly Lutheran and the Slovaks were primarily Catholic. The Irish were mostly Protestant from Ulster, of Scots and Northern Borders descent.\n\nBased on the order of President Franklin D. Roosevelt given shortly after Imperial Japan's attack on Pearl Harbor, nearly 16,000 Japanese Americans were forcibly removed from the West Coast of the United States and incarcerated in two internment camp located in the Arkansas Delta. The Rohwer Camp in Desha County operated from September 1942 to November 1945 and at its peak interned 8,475 prisoners. The Jerome War Relocation Center in Drew County operated from October 1942 to June 1944 and held c. 8,000 prisoners.\n\nFall of Segregation \n\nAfter the Supreme Court's decision in Brown v. Board of Education of Topeka, Kansas in 1954 that segregation in public schools was unconstitutional, some students worked to integrate schools in the state. The Little Rock Nine brought Arkansas to national attention in 1957 when the Federal government had to intervene to protect African-American students trying to integrate a high school in the Arkansas capital. Governor Orval Faubus had ordered the Arkansas National Guard to aid segregationists in preventing nine African-American students from enrolling at Little Rock's Central High School. After attempting three times to contact Faubus, President Dwight D. Eisenhower sent 1000 troops from the active-duty 101st Airborne Division to escort and protect the African-American students as they entered school on September 25, 1957. In defiance of federal court orders to integrate, the governor and city of Little Rock decided to close the high schools for the remainder of the school year. By the fall of 1959, the Little Rock high schools were completely integrated.\n\nProminent American Figures from Arkansas \n\nBill Clinton, the 42nd President of the United States, was born in Hope. Before his presidency, Clinton served as the 40th and 42nd Governor of Arkansas, a total of nearly 12 years.\n\nCities and towns\n\nLittle Rock has been Arkansas's capital city since 1821 when it replaced Arkansas Post as the capital of the Territory of Arkansas. The state capitol was moved to Hot Springs and later Washington during the Civil War when the Union armies threatened the city in 1862, and state government did not return to Little Rock until after the war ended. Today, the Little Rock–North Little Rock–Conway metropolitan area is the largest in the state, with a population of 724,385 in 2013.\n\nThe Fayetteville–Springdale–Rogers Metropolitan Area is the second-largest metropolitan area in Arkansas, growing at the fastest rate due to the influx of businesses and the growth of the University of Arkansas and Walmart.\n\nThe state has eight cities with populations above 50,000 (based on 2010 census). In descending order of size, they are: Little Rock, Fort Smith, Fayetteville, Springdale, Jonesboro, North Little Rock, Conway, and Rogers. Of these, only Fort Smith and Jonesboro are outside the two largest metropolitan areas. Other cities are located in Arkansas such as Pine Bluff, Crossett, Bryant, Lake Village, Hot Springs, Bentonville, Texarkana, Sherwood, Jacksonville, Russellville, Bella Vista, West Memphis, Paragould, Cabot, Searcy, Van Buren, El Dorado, Blytheville, Harrison, Dumas, Rison, Warren, and Mountain Home.\n\nDemographics\n\nPopulation\n\nThe United States Census Bureau estimates that the population of Arkansas was 2,978,204 on July 1, 2015, a 2.14% increase since the 2010 United States Census.\n\nAs of 2015, Arkansas has an estimated population of 2,978,204. From fewer than 15,000 in 1820, Arkansas's population grew to 52,240 during a special census in 1835, far exceeding the 40,000 required to apply for statehood.Arnold et al. 2002, p. 106. Following statehood in 1836, the population doubled each decade until the 1870 Census conducted following the Civil War. The state recorded growth in each successive decade, although it gradually slowed in the 20th century.\n\nIt recorded population losses in the 1950 and 1960 Censuses. This outmigration was a result of multiple factors, including farm mechanization, decreasing labor demand, and young educated people leaving the state due to a lack of non-farming industry in the state. Arkansas again began to grow, recording positive growth rates ever since and exceeding the 2 million mark during the 1980 Census. Arkansas's rate of change, age distributions, and gender distributions mirror national averages. Minority group data also approximates national averages. There are fewer people in Arkansas of Hispanic or Latino origin than the national average. The center of population of Arkansas for 2000 was located in Perry County, near Nogal.\n\nAncestry\n\nIn terms of race and ethnicity, the state was 80.1% white (74.2% non-Hispanic white), 15.6% black or African American, 0.9% American Indian and Alaska Native, 1.3% Asian, and 1.8% from two or more races. Hispanics or Latinos of any race made up 6.6% of the population.\n\nAs of 2011, 39.0% of Arkansas's population younger than age 1 were minorities.\n\nEuropean Americans have a strong presence in the northwestern Ozarks and the central part of the state. African Americans live mainly in the southern and eastern parts of the state. Arkansans of Irish, English and German ancestry are mostly found in the far northwestern Ozarks near the Missouri border. Ancestors of the Irish in the Ozarks were chiefly Scots-Irish, Protestants from Northern Ireland, the Scottish lowlands and northern England part of the largest group of immigrants from Great Britain and Ireland before the American Revolution. English and Scots-Irish immigrants settled throughout the backcountry of the South and in the more mountainous areas. Americans of English stock are found throughout the state.David Hackett Fischer, Albion's Seed: Four British Folkways in America, New York: Oxford University Press, 1989, pp.633–639\n\nA 2010 survey of the principal ancestries of Arkansas's residents revealed the following:\n* 15.5% African American\n* 12.3% Irish\n* 11.5% German\n* 11.0% American\n* 10.1% English\n* 4.7% Mexican\n* 2.1% French\n* 1.7% Scottish\n* 1.7% Dutch\n* 1.6% Italian\n* 1.4% Scots-Irish\n\nMost of the people identifying as American are of English descent and/or Scots-Irish descent. Their families have been in the state so long, in many cases since before statehood, that they choose to identify simply as having American ancestry or do not in fact know their own ancestry. Their ancestry primarily goes back to the original 13 colonies and for this reason many of them today simply claim American ancestry. Many people who identify themselves as Irish descent are in fact of Scots-Irish descent.[https://books.google.com/books?idSVoAXh-dNuYC&pg\nPA57&dqSharing+the+dream:+white+males+in+multicultural+America++english+ancestry&cd\n1#vonepage&q\n&f=false Sharing the Dream: White Males in a Multicultural America] By Dominic J. Pulera.Reynolds Farley, 'The New Census Question about Ancestry: What Did It Tell Us?', Demography, Vol. 28, No. 3 (August 1991), pp. 414, 421.Stanley Lieberson and Lawrence Santi, 'The Use of Nativity Data to Estimate Ethnic Characteristics and Patterns', Social Science Research, Vol. 14, No. 1 (1985), pp. 44–6.Stanley Lieberson and Mary C. Waters, 'Ethnic Groups in Flux: The Changing Ethnic Responses of American Whites', Annals of the American Academy of Political and Social Science, Vol. 487, No. 79 (September 1986), pp. 82–86.\n\nAccording to the 2006–2008 American Community Survey, 93.8% of Arkansas's population (over the age of five) spoke only English at home. About 4.5% of the state's population spoke Spanish at home. About 0.7% of the state's population spoke any other Indo-European languages. About 0.8% of the state's population spoke an Asian language, and 0.2% spoke other languages.\n\nReligion\n\nArkansas, like most other Southern states, is part of the Bible Belt and is predominantly Protestant. The largest denominations by number of adherents in 2010 were the Southern Baptist Convention with 661,382; the United Methodist Church with 158,574; non-denominational Evangelical Protestants with 129,638; and the Catholic Church with 122,662. There are some residents of the state who live by other religions such as Islam, Judaism, Wicca, Paganism, Hinduism, Buddhism or who claim no religious affiliation.\n\nEconomy\n\nOnce a state with a cashless society in the uplands and plantation agriculture in the lowlands, Arkansas's economy has evolved and diversified. The state's gross domestic product (GDP) was $119 billion in 2015. Six Fortune 500 companies are based in Arkansas, including the world's #1 retailer, Walmart; Tyson Foods, J.B. Hunt, Dillard's, Murphy USA, and Windstream are also headquartered in the state. The per capita personal income in 2015 was $39,107, ranking forty-fifth in the nation. The median household income from 2011–15 was $41,371, ranking forty-ninth in the nation. The state's agriculture outputs are poultry and eggs, soybeans, sorghum, cattle, cotton, rice, hogs, and milk. Its industrial outputs are food processing, electric equipment, fabricated metal products, machinery, and paper products. Mines in Arkansas produce natural gas, oil, crushed stone, bromine, and vanadium. According to CNBC, Arkansas ranks as the 20th best state for business, with the 2nd-lowest cost of doing business, 5th-lowest cost of living, 11th best workforce, 20th-best economic climate, 28th-best educated workforce, 31st-best infrastructure and the 32nd-friendliest regulatory environment.  Arkansas gained twelve spots in the best state for business rankings since 2011. As of 2014, Arkansas was the most affordable U.S. state to live in.\n\nAs of November 2016 the state's unemployment rate is 4.0%\n\nIndustry and commerce\n\nArkansas's earliest industries were fur trading and agriculture, with development of cotton plantations in the areas near the Mississippi River. They were dependent on slave labor through the American Civil War.\n\nToday only approximately 3% of the population is employed in the agricultural sector, it remains a major part of the state's economy, ranking 13th in the nation in the value of products sold. The state is the U.S.'s largest producer of rice, broilers, and turkeys,U.S. Department of Agriculture, National Agricultural Statistics Service, Poultry – Production and Value, 2010 Summary, data indicates Arkansas led the nation in 2008, 2009, and 2010, in both broilers and turkeys. and ranks in the top three for cotton, pullets, and aquaculture (catfish). Forestry remains strong in the Arkansas Timberlands, and the state ranks fourth nationally and first in the South in softwood lumber production. Automobile parts manufacturers have opened factories in eastern Arkansas to support auto plants in other states. Bauxite was formerly a large part of the state's economy, mined mostly around Saline County.\n\nTourism is also very important to the Arkansas economy; the official state nickname \"The Natural State\" was created for state tourism advertising in the 1970s, and is still used to this day. The state maintains 52 state parks and the National Park Service maintains seven properties in Arkansas. The completion of the William Jefferson Clinton Presidential Library in Little Rock has drawn many visitors to the city and revitalized the nearby River Market District. Many cities also hold festivals, which draw touristss to Arkansas culture, such as The Bradley County Pink Tomato Festival in Warren, King Biscuit Blues Festival, Ozark Folk Festival, Toad Suck Daze, and Tontitown Grape Festival.\n\nMedia\n\nAs of 2010 many Arkansas local newspapers are owned by WEHCO Media, Alabama-based Lancaster Management, Kentucky-based Paxton Media Group, Missouri-based Rust Communications, Nevada-based Stephens Media, and New York-based GateHouse Media.\n\nCulture\n\nThe culture of Arkansas is available to all in various forms, whether it be architecture, literature, or fine and performing arts. The state's culture also includes distinct cuisine, dialect, and traditional festivals. Sports are also very important to the culture of Arkansas, ranging from football, baseball, and basketball to hunting and fishing. Perhaps the best-known piece of Arkansas's culture is the stereotype of its citizens as shiftless hillbillies.Arnold et al. 2002, p. 115. The reputation began when the state was characterized by early explorers as a savage wilderness full of outlaws and thieves.Blevins 2009, p. 15. The most enduring icon of Arkansas's hillbilly reputation is The Arkansas Traveller, a painted depiction of a folk tale from the 1840s.Blevins 2009, p. 30. Although intended to represent the divide between rich southeastern plantation Arkansas planters and the poor northwestern hill country, the meaning was twisted to represent a Northerner lost in the Ozarks on a white horse asking a backwoods Arkansan for directions.Sutherlin 1996, p. 20. The state also suffers from the racial stigma common to former Confederate states, with historical events such as the Little Rock Nine adding to Arkansas's enduring image.Sutherlin 1996, p. 17.\n\nArt and history museums display pieces of cultural value for Arkansans and tourists to enjoy. Crystal Bridges Museum of American Art in Bentonville was visited by 604,000 people in 2012, its first year. The museum includes walking trails and educational opportunities in addition to displaying over 450 works covering five centuries of American art. Several historic town sites have been restored as Arkansas state parks, including Historic Washington State Park, Powhatan Historic State Park, and Davidsonville Historic State Park.\n\nArkansas features a variety of native music across the state, ranging from the blues heritage of West Memphis, Pine Bluff, Helena-West Helena to rockabilly, bluegrass, and folk music from the Ozarks. Festivals such as the King Biscuit Blues Festival and Bikes, Blues, and BBQ pay homage to the history of blues in the state. The Ozark Folk Festival in Mountain View is a celebration of Ozark culture and often features folk and bluegrass musicians. Literature set in Arkansas such as I Know Why the Caged Bird Sings by Maya Angelou and A Painted House by John Grisham describe the culture at various time periods.\n\nSports and recreation\n\nSports have become an integral part of the culture of Arkansas, and her residents enjoy participating in and spectating various events throughout the year.\n\nTeam sports and especially collegiate football have been important to Arkansans. College football in Arkansas began from humble beginnings. The University of Arkansas first fielded a team in 1894 when football was a very dangerous game. Recent studies of the damage to team members from the concussions common in football make it clear that the danger persists.\n\n\"Calling the Hogs\" is a cheer that shows support for the Razorbacks, one of the two NCAA Division I Football Bowl Subdivision (FBS) teams in the state. High school football also began to grow in Arkansas in the early 20th century. Over the years, many Arkansans have looked to the Razorbacks football team as the public image of the state. Following the Little Rock Nine integration crisis at Little Rock Central High School, Arkansans looked to the successful Razorback teams in the following years to repair the state's reputation. Although the University of Arkansas is based in Fayetteville, the Razorbacks have always played at least one game per season at War Memorial Stadium in Little Rock in an effort to keep fan support in central and south Arkansas.\n\nArkansas State University joined the University of Arkansas in FBS (then known as Division I-A) in 1992 after playing in lower divisions for nearly two decades. The two schools have never played each other, due to the University of Arkansas's policy of not playing intrastate games. Two other campuses of the University of Arkansas System are Division I members. The University of Arkansas at Pine Bluff is a member of the Southwestern Athletic Conference, a league whose members all play football in the second-level Football Championship Subdivision (FCS). The University of Arkansas at Little Rock is a member of the FBS Sun Belt Conference, but is one of two conference schools that has no football program. The state's other Division I member is the University of Central Arkansas, which is a full member (including football) of the FCS Southland Conference.\n\nSeven of Arkansas's smaller colleges play in NCAA Division II, with six in the Great American Conference and one in the Heartland Conference. Two other small Arkansas colleges compete in NCAA Division III, in which athletic scholarships are prohibited.\n\nBaseball runs deep in Arkansas and has been popular before the state hosted Major League Baseball (MLB) spring training in Hot Springs from 1886-1920s. Two minor league teams are based in the state. The Arkansas Travelers play at Dickey-Stephens Park in North Little Rock, and the Northwest Arkansas Naturals play in Arvest Ballpark in Springdale. Both teams compete in the Texas League.\n\nRelated to the state's frontier past, hunting continues in the state. The state created the Arkansas Game and Fish Commission in 1915 to regulate hunting and enforce those regulations. Today a significant portion of Arkansas's population participates in hunting duck in the Mississippi flyway and deer across the state.Sutherlin 1996, p. 164. Millions of acres of public land are available for both bow and modern gun hunters.\n\nFishing has always been popular in Arkansas, and the sport and the state have benefited from the creation of reservoirs across the state. Following the completion of Norfork Dam, the Norfork Tailwater and the White River have become a destination for trout fishers. Several smaller retirement communities such as Bull Shoals, Hot Springs Village, and Fairfield Bay have flourished due to their position on a fishing lake. The Buffalo National River has been preserved in its natural state by the National Park Service and is frequented by fly fishers annually.\n\nHealth\n\nArkansas, as with many Southern states, have a high incidence of premature death, infant mortality, cardiovascular deaths, and occupational fatalities compared to the rest of the United States. The state is tied for 43rd with New York in percentage of adults who regularly exercise. Arkansas is usually ranked as one of the least healthy states due to high obesity, smoking, and sedentary lifestyle rates. In contrast though a Gallup poll demonstrates that Arkansas made the most immediate progress in reducing its number of uninsured residents following the passage of the Affordable Care Act. The percentage of uninsured in Arkansas dropped from 22.5 percent in 2013 to 12.4 percent in August 2014.\n\nThe Arkansas Clean Indoor Air Act went into effect in 2006, a statewide smoking ban excluding bars and some restaurants.\n\nHealthcare in Arkansas is provided by a network of hospitals as members of the Arkansas Hospital Association. Major institutions with multiple branches include Baptist Health, Community Health Systems, and HealthSouth. The University of Arkansas for Medical Sciences (UAMS) in Little Rock operates the UAMS Medical Center, a teaching hospital ranked as high performing nationally in cancer and nephrology. The pediatric division of UAMS Medical Center is known as Arkansas Children's Hospital, nationally ranked in pediatric cardiology and heart surgery. Together, these two institutions are the state's only Level I trauma centers.\n\nEducation\n\nArkansas has 1,064 state-funded kindergartens, elementary, junior- and senior high schools.\n\nThe state supports a network of public universities and colleges, including two major university systems: Arkansas State University System and University of Arkansas System. The University of Arkansas, flagship campus of the University of Arkansas System in Fayetteville was ranked #63 among public schools in the nation by U.S. News & World Report. Other public institutions include University of Arkansas at Pine Bluff, Arkansas Tech University, Henderson State University, Southern Arkansas University, and University of Central Arkansas across the state. It is also home to 11 private colleges and universities including Hendrix College, one of the nation's top 100 liberal arts colleges, according to U.S. News & World Report.\n\nIn the 1920s the state required all children to attend public schools. The school year was set at 131 days, although some areas were unable to meet that requirement.\n\nAlthough unusual in the West, school corporal punishment is not uncommon in Arkansas, with 20,083 public school studentsPlease note this figure refers to only the number of students paddled, regardless of whether a student was spanked multiple times in a year, and does not refer to the number of instances of corporal punishment, which would be substantially higher. paddled at least one time, according to government data for the 2011–2012 school year. The rate of corporal punishment in public schools is higher only in Mississippi.\n\nEducational attainment\n\nArkansas is one of the most under-educated states in the Union. It ranks near the bottom in terms of percentage of the population with either a high school or college degree. The state's educational system has a history of under-funding, low teachers' salaries and political meddling in the curriculum.\n\nEducational statistics during these early days are fragmentary and unreliable. Many counties did not submit full reports to the Secretary of State who did double-duty as Commissioner of Common Schools. However, the percentage of Whites over twenty years of age who were illiterate was given as:\n* 1840   21%\n* 1850   25%\n* 1860   17%\n\nIn 2010 Arkansas students earned an average score of 20.3 on the ACT exam, just below the national average of 21. These results were expected due to the large increase in the number of students taking the exam since the establishment of the Academic Challenge Scholarship. Top high schools receiving recognition from the U.S. News & World Report are spread across the state, including Haas Hall Academy in Fayetteville, KIPP Delta Collegiate in Helena-West Helena, Bentonville, Rogers, Rogers Heritage, Valley Springs, Searcy, and McCrory. A total of 81 Arkansas high schools were ranked by the U.S. News & World Report in 2012.\n\nArkansas ranks as the 32nd smartest state on the Morgan Quitno Smartest State Award, 44th in percentage of residents with at least a high school diploma, and 48th in percentage of bachelor's degree attainment. Arkansas has been making strides in education reform. Education Week has praised the state, ranking Arkansas in the top 10 of their Quality Counts Education Rankings every year since 2009 while scoring it in the top 5 during 2012 and 2013.http://www.edweek.org/media/qualitycounts2012_release.pdfhttp://www.edweek.org/media/QualityCounts2013_Release.pdf Arkansas specifically received an A in Transition and Policy Making for progress in this area consisting of early-childhood education, college readiness, and career readiness. Governor Mike Beebe has made improving education a major issue through his attempts to spend more on education. Through reforms, the state is a leader in requiring curricula designed to prepare students for postsecondary education, rewarding teachers for student achievement, and providing incentives for principals who work in lower-tier schools.\n\nFunding\n\nAs an organized territory, and later in the early days of statehood, education was funded by the sales of Federally-controlled public lands. This system was inadequate and prone to local graft. In an 1854 message to the Legislature, Governor Elias N. Conway said, \"We have a common-school law intended as a system to establish common schools in all part of the state; but for the want of adequate means there are very few in operation under this law.\" At this time, only about a quarter of children were enrolled in school.\n By the beginning of the American Civil War, the state had only twenty-five publicly-funded common schools.\n\nIn 1867, the state legislature was still controlled by ex-Confederates. It passed a Common Schools Law that allowed public funded but limited schools to White children.\n\nThe 1868 legislature banned former Confederates and passed a more wide-ranging law detailing funding and administrative issues and allowing Black children to attend school. In furtherance of this, the postwar 1868 state constitution was the first to permit a personal-property tax to fund the lands and buildings for public schools. With the 1868 elections, the first county school commissioners took office.\n\nIn 2014, the state spent $9,616 per student, compared with a national average of about $11,000 putting Arkansas in nineteenth place.\n\nTimeline\n\n1829 Territorial legislature permits townships to establish schools. \n\n1868 State law required racial segregation of schools.\n\n1871 University of Arkansas established.\n\n1873 University of Arkansas at Pine Bluff established as a school to train Black teachers.\n\n1877 Philander Smith College established as a school for Black students.\n\n1890 Henderson State University established as a private school. The state assumed responsibility for it in 1929 as Henderson State Teachers College.\n\n1885 Arkansas School for the Deaf and Arkansas School for the Blind established.\n\n1909 Arkansas Tech University, Southern Arkansas University, University of Arkansas at Monticello and Arkansas State University established as schools offering high school diplomas and vocational training.\n\nc. 1920 Schooling made compulsory.\n\n1925 University of Central Arkansas established as  Arkansas State Normal School established.\n\n1948 University of Arkansas School of Law admits a Black student\n\n1957 Governor Orval Faubus used National Guard troops to oppose racial integration of Little Rock Central High School.\n\n1958 In Cooper v. Aaron the United States Supreme Court ruled the state was bound to integrate school despite the opposition of the governor and legislature.\n\n1983 The Arkansas State Supreme Court ruled the state's funding of education was Constitutionally deficient.\n\nTransportation\n\nTransportation in Arkansas is overseen by the Arkansas Department of Transportation (ArDOT), headquartered in Little Rock. Several main corridors pass through Little Rock, including Interstate 30 (I-30) and I-40 (the nation's 3rd-busiest trucking corridor). In northeast Arkansas, I-55 travels north from Memphis to Missouri, with a new spur to Jonesboro (I-555). Northwest Arkansas is served by I-540 from Fort Smith to Bella Vista, which is a segment of future I-49. The state also has the 13th largest state highway system in the nation.\n\nArkansas is served by 2750 mi of railroad track divided among twenty-six railroad companies including three Class I railroads. Freight railroads are concentrated in southeast Arkansas to serve the industries in the region. The Texas Eagle, an Amtrak passenger train, serves five stations in the state Walnut Ridge, Little Rock, Malvern, Arkadelphia, and Texarkana.\n\nArkansas also benefits from the use of its rivers for commerce. The Mississippi River and Arkansas River are both major rivers. The United States Army Corps of Engineers maintains the McClellan-Kerr Arkansas River Navigation System, allowing barge traffic up the Arkansas River to the Port of Catoosa in Tulsa, Oklahoma.\n\nThere are four airports with commercial service: Clinton National Airport, Northwest Arkansas Regional Airport, Fort Smith Regional Airport, and Texarkana Regional Airport, with dozens of smaller airports in the state.\n\nPublic transit and community transport services for the elderly or those with developmental disabilities are provided by agencies such as the Central Arkansas Transit Authority and the Ozark Regional Transit, organizations that are part of the Arkansas Transit Association.\n\nLaw and government\n\nAs with the federal government of the United States, political power in Arkansas is divided into three branches: executive, legislative, and judicial. Each officer's term is four years long. Office holders are term-limited to two full terms plus any partial terms before the first full term.\n\nExecutive\n\nThe Governor of Arkansas is Asa Hutchinson, a Republican, who was inaugurated on January 13, 2015. The six other elected executive positions in Arkansas are lieutenant governor, secretary of state, attorney general, treasurer, auditor, and land commissioner.Arkansas Code 7 May 806. The governor also appoints qualified individuals to lead various state boards, committees, and departments. Arkansas governors served two-year terms until a referendum lengthened the term to four years, effective with the 1986 general election.\n\nIn Arkansas, the lieutenant governor is elected separately from the governor and thus can be from a different political party.\n\nLegislative\n\nThe Arkansas General Assembly is the state's bicameral bodies of legislators, composed of the Senate and House of Representatives. The Senate contains 35 members from districts of approximately equal population. These districts are redrawn decennially with each US census, and in election years ending in \"2\", the entire body is put up for reelection. Following the election, half of the seats are designated as two-year seats and are up for reelection again in two years, these \"half-terms\" do not count against a legislator's term limits. The remaining half serve a full four-year term. This staggers elections such that half the body is up for re-election every two years and allows for complete body turnover following redistricting. Arkansas voters selected a 21–14 Republican majority in the Senate in 2012. Arkansas House members can serve a maximum of three two-year terms. House districts are redistricted by the Arkansas Board of Apportionment. Following the 2012 elections, Republicans gained a 51–49 majority in the House of Representatives.\n\nThe Republican Party majority status in the Arkansas State House of Representatives following the 2012 elections is the party's first since 1874. Arkansas was the last state of the old Confederacy to never have Republicans control either chamber of its house since the Civil War.\n\nFollowing the term limits changes, studies have shown that lobbyists have become less influential in state politics. Legislative staff, not subject to term limits, have acquired additional power and influence due to the high rate of elected official turnover.\n\nJudicial\n\nArkansas's judicial branch has five court systems: Arkansas Supreme Court, Arkansas Court of Appeals, Circuit Courts, District Courts and City Courts.\n\nMost cases begin in district court, which is subdivided into state district court and local district court. State district courts exercise district-wide jurisdiction over the districts created by the General Assembly, and local district courts are presided over by part-time judges who may privately practice law. 25 state district court judges preside over 15 districts, with more districts created in 2013 and 2017. There are 28 judicial circuits of Circuit Court, with each contains five subdivisions: criminal, civil, probate, domestic relations, and juvenile court. The jurisdiction of the Arkansas Court of Appeals is determined by the Arkansas Supreme Court, and there is no right of appeal from the Court of Appeals to the high court. The Arkansas Supreme Court can review Court of Appeals cases upon application by either a party to the litigation, upon request by the Court of Appeals, or if the Arkansas Supreme Court feels the case should have been initially assigned to it. The twelve judges of the Arkansas Court of Appeals are elected from judicial districts to renewable six-year terms.\n\nThe Arkansas Supreme Court is the court of last resort in the state, composed of seven justices elected to eight-year terms. Established by the Arkansas Constitution in 1836, the court's decisions can be appealed to only the Supreme Court of the United States.\n\nFederal\n\nBoth of Arkansas's U.S. Senators, John Boozman and Tom Cotton, are Republicans. The state has four seats in U.S. House of Representatives. All four seats are held by Republicans: Rick Crawford (1st district), French Hill (2nd district), Steve Womack (3rd district), and Bruce Westerman (4th district).\n\nPolitics\n\nArkansas Governor Bill Clinton brought national attention to the state with a long speech at the 1988 Democratic National Convention endorsing Michael Dukakis. Some journalists suggested the speech was a threat to his ambitions; Clinton defined it \"a comedy of error, just one of those fluky things\". Clinton won the Democratic nomination for President the following cycle. Presenting himself as a \"New Democrat\" and using incumbent George H. W. Bush's broken promise against him, Clinton won the 1992 presidential election (43.0% of the vote) against Republican Bush (37.4% of the vote) and billionaire populist Ross Perot, who ran as an independent (18.9% of the vote).\n\nMost Republican strength traditionally lay mainly in the northwestern part of the state, particularly Fort Smith and Bentonville, as well as North Central Arkansas around the Mountain Home area. In the latter area, Republicans have been known to get 90 percent or more of the vote, while the rest of the state was more Democratic. After 2010, Republican strength expanded further to the Northeast and Southwest and into the Little Rock suburbs. The Democrats are mostly concentrated to central Little Rock, the Mississippi Delta, the Pine Bluff area, and the areas around the southern border with Louisiana.\n\nArkansas has only elected three Republicans to the U.S. Senate since Reconstruction: Tim Hutchinson, who was defeated after one term by Mark Pryor; John Boozman, who defeated incumbent Blanche Lincoln; and Tom Cotton, who defeated Mark Pryor in the 2014 elections. Before 2013, the General Assembly had not been controlled by the Republican Party since Reconstruction, with the GOP holding a 51-seat majority in the state House and a 21-seat (of 35) in the state Senate following victories in 2012. Arkansas was one of just three states among the states of the former Confederacy that sent two Democrats to the U.S. Senate (the others being Florida and Virginia) for any period during the first decade of the 21st century.\n\nIn 2010, Republicans captured three of the state's four seats in the U.S. House of Representatives. In 2012, Republicans won election for all four House seats. Arkansas held the distinction of having a U.S. House delegation composed entirely of military veterans (Rick Crawford – Army; Tim Griffin – Army Reserve; Steve Womack – Army National Guard, Tom Cotton- Army). In 2014, the last Democrat in Arkansas's Congressional Delegation, Mark Pryor, was defeated in campaign to win a third term in the U.S. Senate, leaving the entire congressional delegation in GOP hands for the first time since Reconstruction.\n\nReflecting the state's large evangelical population, the state has a strong social conservative bent. Under the Arkansas Constitution Arkansas is a right to work state, its voters passed a ban on same-sex marriage with 75% voting yes, and the state is one of a handful with legislation on its books banning abortion in the event Roe v. Wade is ever overturned.\n\nAttractions\n\nArkansas is home to many areas protected by the National Park System. These include:\n* Arkansas Post National Memorial at Gillett\n* Blanchard Springs Caverns\n* Buffalo National River\n* Fort Smith National Historic Site\n* Hot Springs National Park\n* Little Rock Central High School National Historic Site\n* Pea Ridge National Military Park\n* President William Jefferson Clinton Birthplace Home National Historic Site\n* Arkansas State Capitol Building\n* List of Arkansas state parks. Arkansas. http://en.wikipedia.org/?curid=1930."
  }
}
