{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12531",
  "eid" : "03298870-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514551,
  "textBody" : "George Peppard Jr. (; October 1, 1928 – May 8, 1994) was an American film and television actor.\n\nPeppard secured a major role when he starred alongside Audrey Hepburn in Breakfast at Tiffany's (1961), and later portrayed a character based on Howard Hughes in The Carpetbaggers (1964). On television, he played the title role of millionaire insurance investigator and sleuth Thomas Banacek in the early-1970s mystery series Banacek. He played Col. John \"Hannibal\" Smith, the cigar-smoking leader of a renegade commando squad, in the hit 1980s action show The A-Team.\n\nEarly life\n\nGeorge Peppard, Jr. was born in Detroit, Michigan, the son of building contractor George Peppard, Sr. and opera singer Vernelle Rohrer.  He graduated from Dearborn High School in Dearborn, Michigan.\n\nPeppard enlisted in the United States Marine Corps July 8, 1946, and rose to the rank of corporal in the 10th Marines, leaving the Corps at the end of his period of enlistment in January 1948.\n\nDuring 1948 and 1949, he studied Civil Engineering at Purdue University where he was a member of the Purdue Playmakers theatre troupe and Beta Theta Pi fraternity. He then transferred to Carnegie Institute of Technology (now Carnegie Mellon University) in Pittsburgh, Pennsylvania, where he earned his bachelor's degree in 1955. He also trained at the Pittsburgh Playhouse.\n\nIn addition to acting, Peppard was a pilot. He spent a portion of his 1966 honeymoon training to fly his Learjet in Wichita, Kansas.\n\nActing\n\nPeppard made his stage debut in 1949 at the Pittsburgh Playhouse. After moving to New York City, Peppard enrolled in the Actors Studio, where he studied the Method with Lee Strasberg. He did a variety of jobs to pay his way during this time, such as working as a disc jockey, being a radio station engineer, teaching fencing, driving a taxi and being a mechanic in a motorcycle repair shop.\n\nHe worked in summer stock in New England and appeared at the open air Shakespeare Festival in Ashland, Oregon.\n\nHis first work on Broadway led to his first television appearance, with Paul Newman, in The United States Steel Hour (1956), as the singing, guitar-playing baseball player Piney Woods in Bang the Drum Slowly.\n\nHe made his film debut in The Strange One (1957).\n\nMGM\n\nPeppard had signed to play a role on Broadway in The Pleasure of His Company (1958) when he auditioned successfully for MGM's Home from the Hill (1960). He ended up appearing in Pleasure of His Company for six months before making Home from the Hill. Part of the arrangement of the latter involved signing with MGM for a long term contract.\n\nHome from the Hill was a prestigious film directed by Vincente Minnelli and starring Robert Mitchum, who played Peppard's father. It was a success at the box office, although the film's high cost meant that it was not profitable.\n\nPeppard's next film for MGM was The Subterraneans, an adaptation of the novel by Jack Keruoac. It flopped and Peppard said \"I couldn't get arrested\" afterwards.\n\nStardom\n\nHis good looks, elegant manner and superior acting skills landed Peppard his most famous film role as Paul Varjak in Breakfast at Tiffany's with Audrey Hepburn, based on a story by Truman Capote. This 1961 role boosted him briefly to a major film star.\n\nThat year a newspaper article dubbed him \"the next big thing\". Peppard said he had turned down two TV series and was focused on being a film star. His contract with MGM was for two pictures a year, allowing for one outside film and six TV appearances a year, plus the right to star in a play every second year.\n\nHe was meant to appear in Unarmed in Paradise which was not made. Instead MGM cast him in the lead of their epic western How the West Was Won in 1962 (his character spanned two sections of the episodic Cinerama extravaganza). It was a massive hit.\n\nHe followed this with a war story for Carl Foreman, The Victors in 1963, then, most notably, The Carpetbaggers, a 150-minute saga of a ruthless, Hughes-like aviation and film mogul based on a best-selling novel by Harold Robbins. It turned out to be one of the biggest box-office hits of 1964.\n\n\"My performances bore me\", said Peppard in a 1964 interview, adding that his ambition was to deliver \"one great performance. And I must say I feel a little presumptuous to shoot for that. But that's the goal, like a hockey goal. I figure I've got a choice ... not of the outcome but of the objective. And my objective is that one performance.\"\n\nFor MGM he appeared in Operation Crossbow. He was meant to follow this with an adaptation of the play Merrily We Roll Along but it was never made.\n\nPeppard started choosing tough-guy roles in big, ambitious pictures where he was somewhat overshadowed by ensemble casts; for example, his role as German pilot Bruno Stachel, an obsessively competitive officer from humble beginnings who challenges the Prussian aristocracy during World War I in The Blue Max (1966). For this role, Peppard earned a private pilot's license and did much of his own stunt flying, although stunt pilot Derek Piggott was at the controls for the famous under-the-bridge scene.\n\n\"I'm an actor not a star,\" he said around this time, adding that he looked for \"three things\" in a film, \"a good director, a good part and a good script. If I get two out of three of those I'm satisfied.\"By, K. H. (1966, Feb 01). 'I'm an actor, not a star'. The Christian Science Monitor (1908-Current File) Retrieved from https://search-proquest-com.ezproxy.sl.nsw.gov.au/docview/510788886?accountid=13902\nHe was cast as the lead in Sands of the Kalahari (1965) but walked off the set after only a few days of filming.\n\nFilm critic David Shipman writes of this stage in his career:\nWith his cool, blond baby-face looks and a touch of menace, of meanness, he had established a screen persona as strong as any of the time. He might have been the Alan Ladd or the Richard Widmark of the Sixties: but the Sixties didn't want a new Alan Ladd. Peppard began appearing in a series of action movies, predictably as a tough guy, but there were much tougher guys around - like Cagney, Bogart and Robinson, whose films had now become television staples.\n\nDecline\n\nA string of Peppard films that followed made little or no impact, including Tobruk, P.J., The Executioner, House of Cards and One More Train to Rob, as well as a romantic comedy called What's So Bad About Feeling Good?, co-starring Mary Tyler Moore.\n\nIn 1968 he announced he had co written a script Watch Them Die which he planned to direct, but not star in. It was never made.\n  \nAmong other disappointments during this period were a pair of westerns, 1970's Cannon for Cordoba, in which Peppard played the steely Captain Rod Douglas, who has been put in charge of gathering a group of soldiers on a dangerous mission into Mexico, and 1967's Rough Night in Jericho in which he was billed over Dean Martin and Jean Simmons, a reflection of his status at that point in his career.\n\nTelevision\n\nPeppard then decided to turn to television. After developing projects for two years, including making a number of pilots, he had a notable success with Banacek (1972–74), part of the NBC Mystery Movie series, starring in 90-minute whodunits as a wealthy Boston playboy who solves thefts for insurance companies for a finder's fee. Sixteen regular episodes were produced over two seasons. Both have been released on DVD in individual Series I and II sets, along with the hard-to-find pilot. He also delivered one of his most critically acclaimed, though rarely seen, performances in the TV movie Guilty or Innocent: The Sam Sheppard Murder Case (1975), as Sam Sheppard.\n\nPeppard appeared in the short-lived (half a season) Doctors' Hospital (1975) and several other television films. He starred in the 1977 science-fiction film Damnation Alley, which has gone on to attain a substantial cult following. Peppard's role in the film was reportedly turned down by Steve McQueen because of salary issues. With fewer interesting roles coming his way, he acted in, directed and produced the drama Five Days from Home in 1979.\n\nLow point\n\nPeppard later said the low point of his career came over a three-year period around the time of Five Days from Home. \"It was a bad time\", he said. \"I was heavily in debt. My career seemed to be going nowhere. Not much work over a three year period. Every morning I'd wake up and realise I was getting deeper and deeper into debt\".\n\nHe had to sell his car and take out a second mortgage on his home to finance Five Days from Home. Eventually he got his money back and was able to concentrate on his career.\n\nIn a rare game show appearance, Peppard did a week of shows on Password Plus in 1979. Out of five shows, one was never broadcast on NBC (but aired much later on GSN) because of comments made by Peppard regarding personal dissatisfaction he felt related to his treatment by NBC.\n\nDynasty\n\nIn 1980, Peppard was offered, and accepted, the role of Blake Carrington in the TV series Dynasty. During the filming of the pilot episode, which also featured Linda Evans and Bo Hopkins, Peppard repeatedly clashed with the show's producers, Richard and Esther Shapiro; among other things, he felt that his role was too similar to that of J. R. Ewing in the series Dallas. Three weeks later, before filming was to begin on additional episodes, Peppard was fired and the part was offered to John Forsythe; the scenes with Peppard were re-shot and Forsythe became the permanent star of the show.\n\n\"It was a big blow\", said Peppard, later adding that Forsythe did \"a better job than I could have done.\"\n\nThe A-Team\n\nIn 1982, Peppard auditioned for and won the role of Colonel John \"Hannibal\" Smith in the TV action adventure series The A-Team, acting alongside Mr. T, Dirk Benedict and Dwight Schultz. In the series, the A-Team was a team of renegade commandos on the run from the military for \"a crime they did not commit\" while serving in the Vietnam war. The A-Team members made their collective living as soldiers of fortune, but they helped only people who came to them with justified grievances.\n\nAs Colonel John \"Hannibal\" Smith, Peppard played the leader of the A-Team, distinguished by his cigar smoking, confident smirk, black leather gloves, disguises, and distinctive catch phrase, \"I love it when a plan comes together.\" The show ran five seasons on NBC from 1983 to 1987. It made Peppard known to a new generation and is arguably his best-known role. It has been reported that the role was originally written with James Coburn in mind, but Coburn declined and thus it went to Peppard. Peppard was reportedly annoyed by Mr. T upstaging him in his public image, and at one point in their relationship refused to speak directly to Mr. T.  Instead, he sent messages through intermediaries (including at times fellow cast members, particularly Dirk Benedict) and for this Peppard was occasionally portrayed by the press as not a team player.\n\nLater career\n\nIn his later years he appeared in several stage productions.  In 1988, he portrayed Ernest Hemingway in the play PAPA, which played a number of cities including Boise, Idaho; Atlanta, Georgia; and San Francisco.  Peppard financed it, and played in it.  In 1992 he toured in The Lion in Winter, in which he played Henry II to Susan Clark's Eleanor of Aquitaine.\n\nMan Against the Mob\n\nPeppard's last series was an intended occasional series of television movie features entitled Man Against the Mob set in the 1940s. In these TV detective films, Peppard played Los Angeles Police Detective Sgt. Frank Doakey. The second film Man Against the Mob: The Chinatown Murders was broadcast in December 1989. A third film in this series was planned, but Peppard died before it was filmed.\n\nPersonal life\n\nPeppard was married five times, and was the father of three children.\n*Helen Davies (1954–1964): two children, Bradford and Julie\n*Elizabeth Ashley (1966–1972), his co-star in The Carpetbaggers: one son, Christian. At their 1972 divorce Peppard had to pay Ashley $2,000 a month in alimony for four years, and up to $400 a month for psychiatric care, plus $350 a month in child support.\n*Sherry Boucher-Lytle (1975–1979), originally from Springhill in northern Webster Parish, Louisiana\n*Alexis Adams (1984–1986)\n*Laura Taylor (1992–till his death in 1994), a licensed mental health counselor in Lake Worth, Florida\n\nLater years and death\n\nPeppard overcame a serious alcohol problem in 1978, and subsequently became deeply involved in helping other alcoholics. He had smoked three packs of cigarettes a day for most of his life until he quit after being diagnosed with lung cancer in 1992, having part of one lung removed in an operation shortly after the formal diagnosis.Bang Out of Order  ch. 14\n\nDespite health problems in his later years, he continued acting. In 1994, shortly before his death, Peppard completed a pilot with Tracy Nelson for a new series called The P.I. It aired as an episode of Matlock and was to be spun off into a new television series, with Peppard playing an aging detective and Nelson his daughter/sidekick.\n\nWhile battling lung cancer, Peppard died on May 8, 1994, in Los Angeles from pneumonia. He was buried in Northview Cemetery, Dearborn, Michigan.\n\nCritical appraisal\n\nDavid Shipman published this appraisal of Peppard in 1972:\nGeorge Peppard's screen presence has some agreeable anomalies. He is tough, assured and insolent – in a way that recalls late Dick Powell rather than early Bogart; but his bright blue eyes and blond hair, his boyish face suggest the all-American athlete, perhaps going to seed. The sophistication is surface deep: you can imagine him in Times Square on a Saturday night, sulky, defiant, out of his depth, not quite certain how he wants to spend the evening.\n\nAwards\n\n*1960 NBR Award (National Board of Review of Motion Pictures) for Home from the Hill as Best Supporting Actor\n*1961 BAFTA Award Nomination (British Academy Award) for Home From The Hill\n*1961 Promising newcomer to leading film roles\n*Star on the Hollywood Walk of Fame (Category Motion Pictures, 6675 Hollywood Blvd., Los Angeles)\n\nFilmography\n\nSelect theatre credits\n\n*Girls of Summer (1956–1957)\n*The Pleasure of His Company (1958–1959)\n*Papa\n*The Lion in Winter",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "George Peppard" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12531" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "George Peppard Jr. (; October 1, 1928 – May 8, 1994) was an American film and television actor.\n\nPeppard secured a major role when he starred alongside Audrey Hepburn in Breakfast at Tiffany's (1961), and later portrayed a character based on Howard Hughes in The Carpetbaggers (1964). On television, he played the title role of millionaire insurance investigator and sleuth Thomas Banacek in the early-1970s mystery series Banacek. He played Col. John \"Hannibal\" Smith, the cigar-smoking leader of a renegade commando squad, in the hit 1980s action show The A-Team.\n\nEarly life\n\nGeorge Peppard, Jr. was born in Detroit, Michigan, the son of building contractor George Peppard, Sr. and opera singer Vernelle Rohrer.  He graduated from Dearborn High School in Dearborn, Michigan.\n\nPeppard enlisted in the United States Marine Corps July 8, 1946, and rose to the rank of corporal in the 10th Marines, leaving the Corps at the end of his period of enlistment in January 1948.\n\nDuring 1948 and 1949, he studied Civil Engineering at Purdue University where he was a member of the Purdue Playmakers theatre troupe and Beta Theta Pi fraternity. He then transferred to Carnegie Institute of Technology (now Carnegie Mellon University) in Pittsburgh, Pennsylvania, where he earned his bachelor's degree in 1955. He also trained at the Pittsburgh Playhouse.\n\nIn addition to acting, Peppard was a pilot. He spent a portion of his 1966 honeymoon training to fly his Learjet in Wichita, Kansas.\n\nActing\n\nPeppard made his stage debut in 1949 at the Pittsburgh Playhouse. After moving to New York City, Peppard enrolled in the Actors Studio, where he studied the Method with Lee Strasberg. He did a variety of jobs to pay his way during this time, such as working as a disc jockey, being a radio station engineer, teaching fencing, driving a taxi and being a mechanic in a motorcycle repair shop.\n\nHe worked in summer stock in New England and appeared at the open air Shakespeare Festival in Ashland, Oregon.\n\nHis first work on Broadway led to his first television appearance, with Paul Newman, in The United States Steel Hour (1956), as the singing, guitar-playing baseball player Piney Woods in Bang the Drum Slowly.\n\nHe made his film debut in The Strange One (1957).\n\nMGM\n\nPeppard had signed to play a role on Broadway in The Pleasure of His Company (1958) when he auditioned successfully for MGM's Home from the Hill (1960). He ended up appearing in Pleasure of His Company for six months before making Home from the Hill. Part of the arrangement of the latter involved signing with MGM for a long term contract.\n\nHome from the Hill was a prestigious film directed by Vincente Minnelli and starring Robert Mitchum, who played Peppard's father. It was a success at the box office, although the film's high cost meant that it was not profitable.\n\nPeppard's next film for MGM was The Subterraneans, an adaptation of the novel by Jack Keruoac. It flopped and Peppard said \"I couldn't get arrested\" afterwards.\n\nStardom\n\nHis good looks, elegant manner and superior acting skills landed Peppard his most famous film role as Paul Varjak in Breakfast at Tiffany's with Audrey Hepburn, based on a story by Truman Capote. This 1961 role boosted him briefly to a major film star.\n\nThat year a newspaper article dubbed him \"the next big thing\". Peppard said he had turned down two TV series and was focused on being a film star. His contract with MGM was for two pictures a year, allowing for one outside film and six TV appearances a year, plus the right to star in a play every second year.\n\nHe was meant to appear in Unarmed in Paradise which was not made. Instead MGM cast him in the lead of their epic western How the West Was Won in 1962 (his character spanned two sections of the episodic Cinerama extravaganza). It was a massive hit.\n\nHe followed this with a war story for Carl Foreman, The Victors in 1963, then, most notably, The Carpetbaggers, a 150-minute saga of a ruthless, Hughes-like aviation and film mogul based on a best-selling novel by Harold Robbins. It turned out to be one of the biggest box-office hits of 1964.\n\n\"My performances bore me\", said Peppard in a 1964 interview, adding that his ambition was to deliver \"one great performance. And I must say I feel a little presumptuous to shoot for that. But that's the goal, like a hockey goal. I figure I've got a choice ... not of the outcome but of the objective. And my objective is that one performance.\"\n\nFor MGM he appeared in Operation Crossbow. He was meant to follow this with an adaptation of the play Merrily We Roll Along but it was never made.\n\nPeppard started choosing tough-guy roles in big, ambitious pictures where he was somewhat overshadowed by ensemble casts; for example, his role as German pilot Bruno Stachel, an obsessively competitive officer from humble beginnings who challenges the Prussian aristocracy during World War I in The Blue Max (1966). For this role, Peppard earned a private pilot's license and did much of his own stunt flying, although stunt pilot Derek Piggott was at the controls for the famous under-the-bridge scene.\n\n\"I'm an actor not a star,\" he said around this time, adding that he looked for \"three things\" in a film, \"a good director, a good part and a good script. If I get two out of three of those I'm satisfied.\"By, K. H. (1966, Feb 01). 'I'm an actor, not a star'. The Christian Science Monitor (1908-Current File) Retrieved from https://search-proquest-com.ezproxy.sl.nsw.gov.au/docview/510788886?accountid=13902\nHe was cast as the lead in Sands of the Kalahari (1965) but walked off the set after only a few days of filming.\n\nFilm critic David Shipman writes of this stage in his career:\nWith his cool, blond baby-face looks and a touch of menace, of meanness, he had established a screen persona as strong as any of the time. He might have been the Alan Ladd or the Richard Widmark of the Sixties: but the Sixties didn't want a new Alan Ladd. Peppard began appearing in a series of action movies, predictably as a tough guy, but there were much tougher guys around - like Cagney, Bogart and Robinson, whose films had now become television staples.\n\nDecline\n\nA string of Peppard films that followed made little or no impact, including Tobruk, P.J., The Executioner, House of Cards and One More Train to Rob, as well as a romantic comedy called What's So Bad About Feeling Good?, co-starring Mary Tyler Moore.\n\nIn 1968 he announced he had co written a script Watch Them Die which he planned to direct, but not star in. It was never made.\n  \nAmong other disappointments during this period were a pair of westerns, 1970's Cannon for Cordoba, in which Peppard played the steely Captain Rod Douglas, who has been put in charge of gathering a group of soldiers on a dangerous mission into Mexico, and 1967's Rough Night in Jericho in which he was billed over Dean Martin and Jean Simmons, a reflection of his status at that point in his career.\n\nTelevision\n\nPeppard then decided to turn to television. After developing projects for two years, including making a number of pilots, he had a notable success with Banacek (1972–74), part of the NBC Mystery Movie series, starring in 90-minute whodunits as a wealthy Boston playboy who solves thefts for insurance companies for a finder's fee. Sixteen regular episodes were produced over two seasons. Both have been released on DVD in individual Series I and II sets, along with the hard-to-find pilot. He also delivered one of his most critically acclaimed, though rarely seen, performances in the TV movie Guilty or Innocent: The Sam Sheppard Murder Case (1975), as Sam Sheppard.\n\nPeppard appeared in the short-lived (half a season) Doctors' Hospital (1975) and several other television films. He starred in the 1977 science-fiction film Damnation Alley, which has gone on to attain a substantial cult following. Peppard's role in the film was reportedly turned down by Steve McQueen because of salary issues. With fewer interesting roles coming his way, he acted in, directed and produced the drama Five Days from Home in 1979.\n\nLow point\n\nPeppard later said the low point of his career came over a three-year period around the time of Five Days from Home. \"It was a bad time\", he said. \"I was heavily in debt. My career seemed to be going nowhere. Not much work over a three year period. Every morning I'd wake up and realise I was getting deeper and deeper into debt\".\n\nHe had to sell his car and take out a second mortgage on his home to finance Five Days from Home. Eventually he got his money back and was able to concentrate on his career.\n\nIn a rare game show appearance, Peppard did a week of shows on Password Plus in 1979. Out of five shows, one was never broadcast on NBC (but aired much later on GSN) because of comments made by Peppard regarding personal dissatisfaction he felt related to his treatment by NBC.\n\nDynasty\n\nIn 1980, Peppard was offered, and accepted, the role of Blake Carrington in the TV series Dynasty. During the filming of the pilot episode, which also featured Linda Evans and Bo Hopkins, Peppard repeatedly clashed with the show's producers, Richard and Esther Shapiro; among other things, he felt that his role was too similar to that of J. R. Ewing in the series Dallas. Three weeks later, before filming was to begin on additional episodes, Peppard was fired and the part was offered to John Forsythe; the scenes with Peppard were re-shot and Forsythe became the permanent star of the show.\n\n\"It was a big blow\", said Peppard, later adding that Forsythe did \"a better job than I could have done.\"\n\nThe A-Team\n\nIn 1982, Peppard auditioned for and won the role of Colonel John \"Hannibal\" Smith in the TV action adventure series The A-Team, acting alongside Mr. T, Dirk Benedict and Dwight Schultz. In the series, the A-Team was a team of renegade commandos on the run from the military for \"a crime they did not commit\" while serving in the Vietnam war. The A-Team members made their collective living as soldiers of fortune, but they helped only people who came to them with justified grievances.\n\nAs Colonel John \"Hannibal\" Smith, Peppard played the leader of the A-Team, distinguished by his cigar smoking, confident smirk, black leather gloves, disguises, and distinctive catch phrase, \"I love it when a plan comes together.\" The show ran five seasons on NBC from 1983 to 1987. It made Peppard known to a new generation and is arguably his best-known role. It has been reported that the role was originally written with James Coburn in mind, but Coburn declined and thus it went to Peppard. Peppard was reportedly annoyed by Mr. T upstaging him in his public image, and at one point in their relationship refused to speak directly to Mr. T.  Instead, he sent messages through intermediaries (including at times fellow cast members, particularly Dirk Benedict) and for this Peppard was occasionally portrayed by the press as not a team player.\n\nLater career\n\nIn his later years he appeared in several stage productions.  In 1988, he portrayed Ernest Hemingway in the play PAPA, which played a number of cities including Boise, Idaho; Atlanta, Georgia; and San Francisco.  Peppard financed it, and played in it.  In 1992 he toured in The Lion in Winter, in which he played Henry II to Susan Clark's Eleanor of Aquitaine.\n\nMan Against the Mob\n\nPeppard's last series was an intended occasional series of television movie features entitled Man Against the Mob set in the 1940s. In these TV detective films, Peppard played Los Angeles Police Detective Sgt. Frank Doakey. The second film Man Against the Mob: The Chinatown Murders was broadcast in December 1989. A third film in this series was planned, but Peppard died before it was filmed.\n\nPersonal life\n\nPeppard was married five times, and was the father of three children.\n*Helen Davies (1954–1964): two children, Bradford and Julie\n*Elizabeth Ashley (1966–1972), his co-star in The Carpetbaggers: one son, Christian. At their 1972 divorce Peppard had to pay Ashley $2,000 a month in alimony for four years, and up to $400 a month for psychiatric care, plus $350 a month in child support.\n*Sherry Boucher-Lytle (1975–1979), originally from Springhill in northern Webster Parish, Louisiana\n*Alexis Adams (1984–1986)\n*Laura Taylor (1992–till his death in 1994), a licensed mental health counselor in Lake Worth, Florida\n\nLater years and death\n\nPeppard overcame a serious alcohol problem in 1978, and subsequently became deeply involved in helping other alcoholics. He had smoked three packs of cigarettes a day for most of his life until he quit after being diagnosed with lung cancer in 1992, having part of one lung removed in an operation shortly after the formal diagnosis.Bang Out of Order  ch. 14\n\nDespite health problems in his later years, he continued acting. In 1994, shortly before his death, Peppard completed a pilot with Tracy Nelson for a new series called The P.I. It aired as an episode of Matlock and was to be spun off into a new television series, with Peppard playing an aging detective and Nelson his daughter/sidekick.\n\nWhile battling lung cancer, Peppard died on May 8, 1994, in Los Angeles from pneumonia. He was buried in Northview Cemetery, Dearborn, Michigan.\n\nCritical appraisal\n\nDavid Shipman published this appraisal of Peppard in 1972:\nGeorge Peppard's screen presence has some agreeable anomalies. He is tough, assured and insolent – in a way that recalls late Dick Powell rather than early Bogart; but his bright blue eyes and blond hair, his boyish face suggest the all-American athlete, perhaps going to seed. The sophistication is surface deep: you can imagine him in Times Square on a Saturday night, sulky, defiant, out of his depth, not quite certain how he wants to spend the evening.\n\nAwards\n\n*1960 NBR Award (National Board of Review of Motion Pictures) for Home from the Hill as Best Supporting Actor\n*1961 BAFTA Award Nomination (British Academy Award) for Home From The Hill\n*1961 Promising newcomer to leading film roles\n*Star on the Hollywood Walk of Fame (Category Motion Pictures, 6675 Hollywood Blvd., Los Angeles)\n\nFilmography\n\nSelect theatre credits\n\n*Girls of Summer (1956–1957)\n*The Pleasure of His Company (1958–1959)\n*Papa\n*The Lion in Winter. George Peppard. http://en.wikipedia.org/?curid=12531."
  }
}
