{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9406",
  "eid" : "eedb2b30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778480483,
  "textBody" : "Many historians trace modern Ethiopia's foreign policy to the reign of Emperor Tewodros II, whose primary concerns were the security of Ethiopia's traditional borders, obtaining technology from Europe (or modernization), and to a lesser degree Ethiopian rights to the monastery of Dar-es-Sultan in the city of Jerusalem.The political history of the Ethiopian community, and their struggle for ownership of this small monastery, is retold in Chris Proutky, Empress Taytu and Menelik II (Trenton: The Red Sea Press, 1986), pp. 247-256 Tewodros' diplomatic efforts, however, ended disastrously with the British expedition of 1868 which concluded with his death. Despite the efforts of his successor Emperor Yohannes IV to establish a relationship with the United Kingdom, Ethiopia was ignored by the world powers until the opening of the Suez Canal, and more important, the Mahdist War, drew outside attention to her once more.Although Bahru Zewde, A History of Modern Ethiopia, second edition (Oxford: James Currey, 2001), believes that the Suez Canal brought strategic value to the Red Sea region (p. 73), Sven Rubenson, The Survival of Ethiopian Independence (Hollywood: Tsehai,1991) argues that only with the Mahdi War did the United Kingdom  interest themselves once again in Ethiopia (pp. 283ff).\n\nThe same major interests that Tewodros had—the security of Ethiopia's traditional borders and modernization—were once again foremost, as demonstrated by the outcome of the First Italo–Ethiopian War, Ethiopia's admission to the League of Nations (28 September 1923), and the 1935 Second Italo-Abyssinian War. Following the decisive Ethiopian victory at Adwa, Menelik II rapidly negotiated a series of treaties fixing Ethiopia's boundaries—with French Somaliland in March 1897, British Somaliland a few months later in June 1897, with Italian Eritrea in 1900, Anglo-Egyptian Sudan in 1902, British East Africa in 1907, and Italian Somaliland in 1908—which simplified this problem on one level. Although Emperor Haile Selassie agreed to an agreement with the British government to help him restore order to Ethiopia, which benefited him in crushing the Woyane Rebellion, he worked to its eventual termination.\n\nFollowing World War II, Ethiopia played an active role in regional and global politics. Ethiopia was a charter member of the United Nations and took part in UN operations in Korea in 1951 and the Congo in 1960. Former Emperor Haile Selassie I was also among the founders of the Organization of African Unity (OAU), and served as one of a series of rotating OAU chairmen. Although nominally a member of the Non-Aligned Movement, after the 1974 revolution, Ethiopia also moved into a close relationship with the Soviet Union and its allies and supported their international policies and positions until a change of government in 1991.\n\nToday, Ethiopia is a major economic partner of Djibouti and Sudan, although border demarcation negotiations are still ongoing with the Omar Al-Bashir administration. Relations with Somalia have also gradually improved, particularly since the establishment of a new government in Mogadishu. Ethiopia's dealings with Eritrea are extremely tense due to an ongoing border dispute between the two countries.\n\nThe Ethiopian government's relations with the U.S. and the West in general have been centered on military and economic cooperation. In addition, Ethiopia maintains diplomatic links with China, Israel, Mexico and India, among other countries. Addis Ababa also serves as the headquarters of the United Nations Economic Commission for Africa (UNECA) and the African Union, as well as numerous other continental and international organizations.\n\nAfrica\n\nDiplomatic relations between Ethiopia and Djibouti were established in 1984.[http://mfa.gov.et/Foreign_Policy_And_Relation/Bilateral.php \"Ethiopia - Djibouti relations\"] , Ministry of Foreign Affairs website (Retrieved 9 October 2009) The border between the two countries is based on the Franco-Ethiopian convention of 20 March 1897, which was later finalized in a protocol dated 16 January 1954 and rendered effective on 28 February of that year.[http://www.law.fsu.edu/library/collection/LimitsinSeas/IBS154.pdf \"Djibouti – Ethiopia Boundary\"] , U.S. Department of State, International Boundary Study No. 154 – 20 February 1976 In October 1991, the Ethiopian and Djiboutian governments signed a Treaty of Friendship and Cooperation further solidifying relations. Since 1991, the two countries have signed over 39 protocol agreements.\n\nDjibouti remains a major economic partner of Ethiopia. On 13 April 2002, the two countries signed an agreement concerning the use of the Port of Djibouti and the transit of cargo, which was later ratified by the Ethiopian Federal Parliamentary Assembly on 4 June of the same year.[http://www.ethiopar.net/type/English/hopre/bills/2004_2005/Proc%20No.%20284-%202002%20Ethio-Djibouti%20Utilization%20of%20Port%20of%20Dj.pdf \"Ethio-Djibouti Utilization of Port of Djibouti and Services to Cargo in Transit Agreement Ratification Proclamation No. 284/2002\"] (Retrieved 13 July 2010)  About 70% of the Port of Djibouti's activity consists of imports to and exports from neighboring Ethiopia, which depends on the harbour as its main maritime outlet. The port also serves as an international refueling center and transshipment hub. Additionally, both countries share ownership of the Addis Ababa-Djibouti Railroad.\n\nAs two of the oldest independent states in Africa, both countries have an ancient relationship in many forms. The Ethiopian Orthodox Tewahedo Church was under the administration of the Coptic Orthodox Church from ancient times until 1959. Ethiopian and Egyptian armies clashed in the early 19th century over control of territory in what is modern Sudan, and Ethiopia's access to the Red Sea. Both countries established formal diplomatic ties in 1927. More recently, because both countries share a special relationship over the Nile basin, both are members of the Nile Basin Initiative.\n\n* The boundary between these two countries is based on three treaties between Ethiopia and Italy, in 1900, 1902, and 1908. However no part of the shared boundary was afterwards demarcated.[https://www.un.org/NewLinks/eebcarbitration/ Findings of the UN Eritea-Ethiopia Boundary Commission] \n* From 1950 until 1993, Eritrea was federated as part of Ethiopia. During much of this period, a number of Eritreans fought for independence from Ethiopia. The federation was ended with an April 1993 plebiscite which approved Eritrea's full independence.\n* Disputes over Eritrea's border alignment led to the Eritrean-Ethiopian War (1998–2000), which was resolved by an independent boundary commission's delimitation decision in 2002. However, demarcation has been delayed, despite intense international intervention, by Ethiopian insistence that the decision ignored \"human geography,\" made technical errors in the delimitation, and determined that certain disputed areas, specifically Badme, fall to Eritrea. Eritrea meanwhile insists on not deviating from the commission's decision. The peacekeepers monitoring the disputed boundary were forced to withdraw in July 2008 having considered their remaining options after experiencing serious difficulties in supporting its troops.\n\nRelations between Kenya and Ethiopia date back to the 1954, when the Ethiopian authorities under Haile Selassie I established an Honorary Consulate General in the British Kenya Colony. In 1961, prior to Kenya's independence, Ethiopia appointed its first Ambassador to Kenya and six years later Kenya opened an Embassy in Addis Ababa.[http://mfa.gov.et/Foreign_Policy_And_Relation/Bilateral.php \"Ethiopia - Kenya relations\"] , Ministry of Foreign Affairs website (accessed 9 October 2009)\n\nThe border between the two countries is based on a treaty signed by Ethiopia and Kenya on 9 June 1970, which determines the present-day boundary, abrogating all previous boundary treaties. This border has been subjected to demarcation.[http://www.law.fsu.edu/library/collection/limitsinseas/IBS152.pdf \"Ethiopia – Kenya Boundary\"] , U.S. State Department International Boundary Study, No. 152 – 15 October 1975\n\nEthiopia–Namibia relations refers to the current and historical relationship between Ethiopia and Namibia. Namibia maintains an embassy in Addis Ababa.\n\nDuring the South African occupation of Namibia, Ethiopia was one of the country's leading proponents abroad; Ethiopia and Liberia were the first two states to bring the question of independence for then South West Africa to the United Nations. Namibia gained independence in 1990 In 2007, the two governments signed an agreement which expanded air travel between the two states.[http://www.kilil5.com/news/12989_ethiopia-namibia-sign-air-transp Ethiopia, Namibia sign air transport agreement]  In December 2009, Namibia's Foreign Minister, Marko Hausiku met with Ethiopian Foreign Affairs Minister Seyoum Mesfin and noted the economic, science, technical and cultural agreements in place between the two countries and expressed a desire to improve the trade relations.[http://www.mfa.gov.et/Press_Section/publication.php?Main_Page_Number=4796 Ethiopia, Namibia working out to step up cooperation areas] \n\nRelations between the peoples of Somalia and Ethiopia stretch back to antiquity, to a common origin. The Ethiopian region is one of the proposed homelands of the Horn of Africa's various Afro-Asiatic communities.\n\nDuring the Middle Ages, Somali Imam Ahmad ibn Ibrihim al-Ghazi (Ahmad Gurey or Gragn) led a Conquest of Abyssinia (Futuh al-Habash), which brought three-quarters of the Christian Ethiopian Empire under the power of the Muslim Adal Sultanate.Saheed A. Adejumobi, The History of Ethiopia, (Greenwood Press: 2006), p.178Encyclopædia Britannica, inc, Encyclopædia Britannica, Volume 1, (Encyclopædia Britannica: 2005), p.163 With an army mainly composed of Somalis,John L. Esposito, editor, The Oxford History of Islam, (Oxford University Press: 2000), p. 501 Many historians trace the origins of tensions between Somalia and Ethiopia to this war.David D. Laitin and Said S. Samatar, Somalia: Nation in Search of a State (Boulder: Westview Press, 1987).\n\nIn the 1960s and 1970s, a territorial dispute over the Ogaden region led to various armed confrontations between the Somalian and Ethiopian militaries. The tensions culminated in the Ogaden War, which saw the Somali army capture most of the disputed territory by September 1977, before finally being expelled by a coalition of communist forces.\n\nWith changes in leadership in the early 1990s brought on by the start of the Somali Civil War and Ethiopian Civil War, respectively, relations between the Somali and Ethiopian authorities entered a new phase of military cooperation against the Islamic Courts Union (ICU) rebel group and its more radical successor Al-Shabaab. In October 2011, a coordinated multinational operation began against Al-Shabaab in southern Somalia; the Ethiopian military eventually joined the Transitional Federal Government-led mission the following month.\n\nThe Federal Government of Somalia was later established on 20 August 2012, representing the first permanent central government in the country since the start of the civil war. The following month, Hassan Sheikh Mohamud was elected as the new Somali government's first President, with the Ethiopian authorities welcoming his selection and newly appointed Prime Minister of Ethiopia Hailemariam Desalegn attending Mohamud's inauguration ceremony.\n\nAlodia and the Kingdom of Makuria had some relations with Ethiopia in Medieval times.\n\nThe Ethiopian Empire fought against Mahdist Sudan in the Mahdist War.\n\nEthiopia and Sudan first established formal relations in 1956.[http://mfa.gov.et/Foreign_Policy_And_Relation/Bilateral.php \"Ethiopia - Sudan relations\"] , Ministry of Foreign Affairs website (Retrieved 9 October 2009) Relations between Ethiopia and Sudan were very good following the end of the Ethiopian Civil War, due to the support that the Sudanese government had given to the Ethiopian People's Revolutionary Democratic Front. However, relations were strained for a time following the 26 June 1995 assassination attempt against Egyptian president Hosni Mubarak as he was leaving the OAU summit meeting in Addis Ababa. The subsequent investigation revealed that Sudan was involved in this act, forcing the Ethiopian government to take a series of steps against Sudan that September, which included closing the Sudanese consulate in Gambela, reducing the number of Sudanese embassy staff, and terminating all Sudan Airways and Ethiopian Airlines flights between the two countries. However the start of the Eritrean-Ethiopian War led to Sudan and Ethiopia put this conflict between them and normalizing their relations by November 1999 when president Omar Hassan al-Bashir made a formal visit to Addis Ababa.David H. Shinn, [http://www.csis.org/media/csis/pubs/anotes_0202.pdf \"Ethiopia: Coping with Islamic Fundamentalism before and after September 11\"] (last accessed 10 December 2008)\n\nA protocol concerning Ethiopian access to Port Sudan was signed between the two countries 5 March 2000 in Khartoum, and this protocol and its subsequent amendment were ratified by the Ethiopian Federal Parliamentary Assembly on 3 July 2003.[http://www.ethiopar.net/type/English/hopre/bills/2004_2005/Proc%20No.%20352-2003%20protocol%20Agreement%20on%20Port%20Sudan%20Utilizat.pdf \"protocol Agreement on Port Sudan Utilization Ratification Proclamation No. 352/2003\"] , [http://www.ethiopar.net/type/English/hopre/bills/2004_2005/Proc%20No.%20353-2003%20The%20Amendment%20to%20the%20protocol%20Agreement%20o.pdf \"Amendment to the Protocol Agreement, on Port Sudan Utilization, Ratification Proclamation No. 35312003\"] (Retrieved 13 July 2010) \n\nEfforts to demarcate the porous boundary with Sudan were delayed by the Second Sudanese Civil War. In May 2008, residents along the western Ethiopian border reportedly discovered that the government had agreed to demarcate this boundary when Sudanese soldiers forced them out of their homes. It was reported that as many as 2,000 people were displaced in the Gambela Region, and the Sudanese army reportedly set fire to two dozen Ethiopian farms and imprisoned 34 people in the Amhara Region. However, Prime Minister Meles Zenawi publicly denied that any Ethiopians had been displaced by this agreement.Alisha Ryu, [http://www.voanews.com/english/archive/2008-06/2008-06-05-voa43.cfm?CFID156867109&CFTOKEN\n60445804&jsessionid8830a70f00653c50c7a814604b23643f33fe \"Border Demarcation with Sudan Causes Anger in Ethiopia\"], Voice of America website, 5 June 2008 (Retrieved 3 April 2009) Negotiations over this boundary continues, with the twelfth meeting of the Boundary Commission announced 28 December 2009 at Mek'ele, with Ethiopian representatives from the Tigray, Benishangul-Gumuz, Amhara and Gambela Regions, and from the Sudanese side representatives of the Upper Nile, Blue Nile, Sennar and Al Qadarif Administrations.[http://www.mfa.gov.et/Press_Section/publication.php?Main_Page_Number\n4838 \"Ethio-Sudanese Border Commission Meeting To Open Monday (December 28, 2009)\"] , Ministry of Foreign Affairs website (Retrieved 28 December 2009)\n\nDespite these border tensions, Sudan remains a major economic partner of Ethiopia. According to the Ethiopian Petroleum Supplier Enterprise (EPSE), Ethiopia in April 2013 imported around $1.12 billion worth of oil from Sudan over the previous six months. In total, about 85% of Ethiopia's yearly oil consumption comes from Sudan via the Port of Djibouti. Ethiopia and Sudan are also in the process of linking their power grids.\n\nEurope\n\nAsia\n\nAmericas",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Ethiopia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9406" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Many historians trace modern Ethiopia's foreign policy to the reign of Emperor Tewodros II, whose primary concerns were the security of Ethiopia's traditional borders, obtaining technology from Europe (or modernization), and to a lesser degree Ethiopian rights to the monastery of Dar-es-Sultan in the city of Jerusalem.The political history of the Ethiopian community, and their struggle for ownership of this small monastery, is retold in Chris Proutky, Empress Taytu and Menelik II (Trenton: The Red Sea Press, 1986), pp. 247-256 Tewodros' diplomatic efforts, however, ended disastrously with the British expedition of 1868 which concluded with his death. Despite the efforts of his successor Emperor Yohannes IV to establish a relationship with the United Kingdom, Ethiopia was ignored by the world powers until the opening of the Suez Canal, and more important, the Mahdist War, drew outside attention to her once more.Although Bahru Zewde, A History of Modern Ethiopia, second edition (Oxford: James Currey, 2001), believes that the Suez Canal brought strategic value to the Red Sea region (p. 73), Sven Rubenson, The Survival of Ethiopian Independence (Hollywood: Tsehai,1991) argues that only with the Mahdi War did the United Kingdom  interest themselves once again in Ethiopia (pp. 283ff).\n\nThe same major interests that Tewodros had—the security of Ethiopia's traditional borders and modernization—were once again foremost, as demonstrated by the outcome of the First Italo–Ethiopian War, Ethiopia's admission to the League of Nations (28 September 1923), and the 1935 Second Italo-Abyssinian War. Following the decisive Ethiopian victory at Adwa, Menelik II rapidly negotiated a series of treaties fixing Ethiopia's boundaries—with French Somaliland in March 1897, British Somaliland a few months later in June 1897, with Italian Eritrea in 1900, Anglo-Egyptian Sudan in 1902, British East Africa in 1907, and Italian Somaliland in 1908—which simplified this problem on one level. Although Emperor Haile Selassie agreed to an agreement with the British government to help him restore order to Ethiopia, which benefited him in crushing the Woyane Rebellion, he worked to its eventual termination.\n\nFollowing World War II, Ethiopia played an active role in regional and global politics. Ethiopia was a charter member of the United Nations and took part in UN operations in Korea in 1951 and the Congo in 1960. Former Emperor Haile Selassie I was also among the founders of the Organization of African Unity (OAU), and served as one of a series of rotating OAU chairmen. Although nominally a member of the Non-Aligned Movement, after the 1974 revolution, Ethiopia also moved into a close relationship with the Soviet Union and its allies and supported their international policies and positions until a change of government in 1991.\n\nToday, Ethiopia is a major economic partner of Djibouti and Sudan, although border demarcation negotiations are still ongoing with the Omar Al-Bashir administration. Relations with Somalia have also gradually improved, particularly since the establishment of a new government in Mogadishu. Ethiopia's dealings with Eritrea are extremely tense due to an ongoing border dispute between the two countries.\n\nThe Ethiopian government's relations with the U.S. and the West in general have been centered on military and economic cooperation. In addition, Ethiopia maintains diplomatic links with China, Israel, Mexico and India, among other countries. Addis Ababa also serves as the headquarters of the United Nations Economic Commission for Africa (UNECA) and the African Union, as well as numerous other continental and international organizations.\n\nAfrica\n\nDiplomatic relations between Ethiopia and Djibouti were established in 1984.[http://mfa.gov.et/Foreign_Policy_And_Relation/Bilateral.php \"Ethiopia - Djibouti relations\"] , Ministry of Foreign Affairs website (Retrieved 9 October 2009) The border between the two countries is based on the Franco-Ethiopian convention of 20 March 1897, which was later finalized in a protocol dated 16 January 1954 and rendered effective on 28 February of that year.[http://www.law.fsu.edu/library/collection/LimitsinSeas/IBS154.pdf \"Djibouti – Ethiopia Boundary\"] , U.S. Department of State, International Boundary Study No. 154 – 20 February 1976 In October 1991, the Ethiopian and Djiboutian governments signed a Treaty of Friendship and Cooperation further solidifying relations. Since 1991, the two countries have signed over 39 protocol agreements.\n\nDjibouti remains a major economic partner of Ethiopia. On 13 April 2002, the two countries signed an agreement concerning the use of the Port of Djibouti and the transit of cargo, which was later ratified by the Ethiopian Federal Parliamentary Assembly on 4 June of the same year.[http://www.ethiopar.net/type/English/hopre/bills/2004_2005/Proc%20No.%20284-%202002%20Ethio-Djibouti%20Utilization%20of%20Port%20of%20Dj.pdf \"Ethio-Djibouti Utilization of Port of Djibouti and Services to Cargo in Transit Agreement Ratification Proclamation No. 284/2002\"] (Retrieved 13 July 2010)  About 70% of the Port of Djibouti's activity consists of imports to and exports from neighboring Ethiopia, which depends on the harbour as its main maritime outlet. The port also serves as an international refueling center and transshipment hub. Additionally, both countries share ownership of the Addis Ababa-Djibouti Railroad.\n\nAs two of the oldest independent states in Africa, both countries have an ancient relationship in many forms. The Ethiopian Orthodox Tewahedo Church was under the administration of the Coptic Orthodox Church from ancient times until 1959. Ethiopian and Egyptian armies clashed in the early 19th century over control of territory in what is modern Sudan, and Ethiopia's access to the Red Sea. Both countries established formal diplomatic ties in 1927. More recently, because both countries share a special relationship over the Nile basin, both are members of the Nile Basin Initiative.\n\n* The boundary between these two countries is based on three treaties between Ethiopia and Italy, in 1900, 1902, and 1908. However no part of the shared boundary was afterwards demarcated.[https://www.un.org/NewLinks/eebcarbitration/ Findings of the UN Eritea-Ethiopia Boundary Commission] \n* From 1950 until 1993, Eritrea was federated as part of Ethiopia. During much of this period, a number of Eritreans fought for independence from Ethiopia. The federation was ended with an April 1993 plebiscite which approved Eritrea's full independence.\n* Disputes over Eritrea's border alignment led to the Eritrean-Ethiopian War (1998–2000), which was resolved by an independent boundary commission's delimitation decision in 2002. However, demarcation has been delayed, despite intense international intervention, by Ethiopian insistence that the decision ignored \"human geography,\" made technical errors in the delimitation, and determined that certain disputed areas, specifically Badme, fall to Eritrea. Eritrea meanwhile insists on not deviating from the commission's decision. The peacekeepers monitoring the disputed boundary were forced to withdraw in July 2008 having considered their remaining options after experiencing serious difficulties in supporting its troops.\n\nRelations between Kenya and Ethiopia date back to the 1954, when the Ethiopian authorities under Haile Selassie I established an Honorary Consulate General in the British Kenya Colony. In 1961, prior to Kenya's independence, Ethiopia appointed its first Ambassador to Kenya and six years later Kenya opened an Embassy in Addis Ababa.[http://mfa.gov.et/Foreign_Policy_And_Relation/Bilateral.php \"Ethiopia - Kenya relations\"] , Ministry of Foreign Affairs website (accessed 9 October 2009)\n\nThe border between the two countries is based on a treaty signed by Ethiopia and Kenya on 9 June 1970, which determines the present-day boundary, abrogating all previous boundary treaties. This border has been subjected to demarcation.[http://www.law.fsu.edu/library/collection/limitsinseas/IBS152.pdf \"Ethiopia – Kenya Boundary\"] , U.S. State Department International Boundary Study, No. 152 – 15 October 1975\n\nEthiopia–Namibia relations refers to the current and historical relationship between Ethiopia and Namibia. Namibia maintains an embassy in Addis Ababa.\n\nDuring the South African occupation of Namibia, Ethiopia was one of the country's leading proponents abroad; Ethiopia and Liberia were the first two states to bring the question of independence for then South West Africa to the United Nations. Namibia gained independence in 1990 In 2007, the two governments signed an agreement which expanded air travel between the two states.[http://www.kilil5.com/news/12989_ethiopia-namibia-sign-air-transp Ethiopia, Namibia sign air transport agreement]  In December 2009, Namibia's Foreign Minister, Marko Hausiku met with Ethiopian Foreign Affairs Minister Seyoum Mesfin and noted the economic, science, technical and cultural agreements in place between the two countries and expressed a desire to improve the trade relations.[http://www.mfa.gov.et/Press_Section/publication.php?Main_Page_Number=4796 Ethiopia, Namibia working out to step up cooperation areas] \n\nRelations between the peoples of Somalia and Ethiopia stretch back to antiquity, to a common origin. The Ethiopian region is one of the proposed homelands of the Horn of Africa's various Afro-Asiatic communities.\n\nDuring the Middle Ages, Somali Imam Ahmad ibn Ibrihim al-Ghazi (Ahmad Gurey or Gragn) led a Conquest of Abyssinia (Futuh al-Habash), which brought three-quarters of the Christian Ethiopian Empire under the power of the Muslim Adal Sultanate.Saheed A. Adejumobi, The History of Ethiopia, (Greenwood Press: 2006), p.178Encyclopædia Britannica, inc, Encyclopædia Britannica, Volume 1, (Encyclopædia Britannica: 2005), p.163 With an army mainly composed of Somalis,John L. Esposito, editor, The Oxford History of Islam, (Oxford University Press: 2000), p. 501 Many historians trace the origins of tensions between Somalia and Ethiopia to this war.David D. Laitin and Said S. Samatar, Somalia: Nation in Search of a State (Boulder: Westview Press, 1987).\n\nIn the 1960s and 1970s, a territorial dispute over the Ogaden region led to various armed confrontations between the Somalian and Ethiopian militaries. The tensions culminated in the Ogaden War, which saw the Somali army capture most of the disputed territory by September 1977, before finally being expelled by a coalition of communist forces.\n\nWith changes in leadership in the early 1990s brought on by the start of the Somali Civil War and Ethiopian Civil War, respectively, relations between the Somali and Ethiopian authorities entered a new phase of military cooperation against the Islamic Courts Union (ICU) rebel group and its more radical successor Al-Shabaab. In October 2011, a coordinated multinational operation began against Al-Shabaab in southern Somalia; the Ethiopian military eventually joined the Transitional Federal Government-led mission the following month.\n\nThe Federal Government of Somalia was later established on 20 August 2012, representing the first permanent central government in the country since the start of the civil war. The following month, Hassan Sheikh Mohamud was elected as the new Somali government's first President, with the Ethiopian authorities welcoming his selection and newly appointed Prime Minister of Ethiopia Hailemariam Desalegn attending Mohamud's inauguration ceremony.\n\nAlodia and the Kingdom of Makuria had some relations with Ethiopia in Medieval times.\n\nThe Ethiopian Empire fought against Mahdist Sudan in the Mahdist War.\n\nEthiopia and Sudan first established formal relations in 1956.[http://mfa.gov.et/Foreign_Policy_And_Relation/Bilateral.php \"Ethiopia - Sudan relations\"] , Ministry of Foreign Affairs website (Retrieved 9 October 2009) Relations between Ethiopia and Sudan were very good following the end of the Ethiopian Civil War, due to the support that the Sudanese government had given to the Ethiopian People's Revolutionary Democratic Front. However, relations were strained for a time following the 26 June 1995 assassination attempt against Egyptian president Hosni Mubarak as he was leaving the OAU summit meeting in Addis Ababa. The subsequent investigation revealed that Sudan was involved in this act, forcing the Ethiopian government to take a series of steps against Sudan that September, which included closing the Sudanese consulate in Gambela, reducing the number of Sudanese embassy staff, and terminating all Sudan Airways and Ethiopian Airlines flights between the two countries. However the start of the Eritrean-Ethiopian War led to Sudan and Ethiopia put this conflict between them and normalizing their relations by November 1999 when president Omar Hassan al-Bashir made a formal visit to Addis Ababa.David H. Shinn, [http://www.csis.org/media/csis/pubs/anotes_0202.pdf \"Ethiopia: Coping with Islamic Fundamentalism before and after September 11\"] (last accessed 10 December 2008)\n\nA protocol concerning Ethiopian access to Port Sudan was signed between the two countries 5 March 2000 in Khartoum, and this protocol and its subsequent amendment were ratified by the Ethiopian Federal Parliamentary Assembly on 3 July 2003.[http://www.ethiopar.net/type/English/hopre/bills/2004_2005/Proc%20No.%20352-2003%20protocol%20Agreement%20on%20Port%20Sudan%20Utilizat.pdf \"protocol Agreement on Port Sudan Utilization Ratification Proclamation No. 352/2003\"] , [http://www.ethiopar.net/type/English/hopre/bills/2004_2005/Proc%20No.%20353-2003%20The%20Amendment%20to%20the%20protocol%20Agreement%20o.pdf \"Amendment to the Protocol Agreement, on Port Sudan Utilization, Ratification Proclamation No. 35312003\"] (Retrieved 13 July 2010) \n\nEfforts to demarcate the porous boundary with Sudan were delayed by the Second Sudanese Civil War. In May 2008, residents along the western Ethiopian border reportedly discovered that the government had agreed to demarcate this boundary when Sudanese soldiers forced them out of their homes. It was reported that as many as 2,000 people were displaced in the Gambela Region, and the Sudanese army reportedly set fire to two dozen Ethiopian farms and imprisoned 34 people in the Amhara Region. However, Prime Minister Meles Zenawi publicly denied that any Ethiopians had been displaced by this agreement.Alisha Ryu, [http://www.voanews.com/english/archive/2008-06/2008-06-05-voa43.cfm?CFID156867109&CFTOKEN\n60445804&jsessionid8830a70f00653c50c7a814604b23643f33fe \"Border Demarcation with Sudan Causes Anger in Ethiopia\"], Voice of America website, 5 June 2008 (Retrieved 3 April 2009) Negotiations over this boundary continues, with the twelfth meeting of the Boundary Commission announced 28 December 2009 at Mek'ele, with Ethiopian representatives from the Tigray, Benishangul-Gumuz, Amhara and Gambela Regions, and from the Sudanese side representatives of the Upper Nile, Blue Nile, Sennar and Al Qadarif Administrations.[http://www.mfa.gov.et/Press_Section/publication.php?Main_Page_Number\n4838 \"Ethio-Sudanese Border Commission Meeting To Open Monday (December 28, 2009)\"] , Ministry of Foreign Affairs website (Retrieved 28 December 2009)\n\nDespite these border tensions, Sudan remains a major economic partner of Ethiopia. According to the Ethiopian Petroleum Supplier Enterprise (EPSE), Ethiopia in April 2013 imported around $1.12 billion worth of oil from Sudan over the previous six months. In total, about 85% of Ethiopia's yearly oil consumption comes from Sudan via the Port of Djibouti. Ethiopia and Sudan are also in the process of linking their power grids.\n\nEurope\n\nAsia\n\nAmericas. Foreign relations of Ethiopia. http://en.wikipedia.org/?curid=9406."
  }
}
