{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7163",
  "eid" : "e01b1380-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778455736,
  "textBody" : "In physics and geometry, a catenary (,) is the curve that an idealized hanging chain or cable assumes under its own weight when supported only at its ends.\n\nThe catenary curve has a U-like shape, superficially similar in appearance to a parabolic arch, but it is not a parabola.\n\nThe curve appears in the design of certain types of arches and  as a cross section of the catenoid—the shape assumed by a soap film bounded by two parallel circular rings.\n\nThe catenary is also called the alysoid, chainette,MathWorld or, particularly in the materials sciences, funicular.e.g.:  \n\nMathematically, the catenary curve is the graph of the hyperbolic cosine function. The surface of revolution of the catenary curve, the catenoid, is a minimal surface, specifically a minimal surface of revolution. The mathematical properties of the catenary curve were first studied by Robert Hooke in the 1670s, and its equation was derived by Leibniz, Huygens and Johann Bernoulli in 1691.\n\nCatenaries and related curves are used in architecture and engineering, in the design of bridges and arches, so that forces do not result in bending moments. In the offshore oil and gas industry, \"catenary\" refers to a steel catenary riser, a pipeline suspended between a production platform and the seabed that adopts an approximate catenary shape.\n\nHistory\n\nThe word \"catenary\" is derived from the Latin word catēna, which means \"chain\". The English word \"catenary\" is usually attributed to Thomas Jefferson,\nwho wrote in a letter to Thomas Paine on the construction of an arch for a bridge:\n\nIt is often said that Galileo thought the curve of a hanging chain was parabolic. In his Two New Sciences (1638), Galileo says that a hanging cord is an approximate parabola, and he correctly observes that this approximation improves as the curvature gets smaller and is almost exact when the elevation is less than 45°. That the curve followed by a chain is not a parabola was proven by Joachim Jungius (1587–1657); this result was published posthumously in 1669.Lockwood p. 124\n\nThe application of the catenary to the construction of arches is attributed to Robert Hooke, whose \"true mathematical and mechanical form\" in the context of the rebuilding of St Paul's Cathedral  alluded to a catenary. Some much older arches approximate catenaries, an example of which is the Arch of Taq-i Kisra in Ctesiphon.\n\nIn 1671, Hooke announced to the Royal Society that he had solved the problem of the optimal shape of an arch, and in 1675 published an encrypted solution as a Latin anagramcf. the anagram for Hooke's law, which appeared in the next paragraph. in an appendix to his Description of Helioscopes, where he wrote that he had found \"a true mathematical and mechanical form of all manner of Arches for Building.\" He did not publish the solution to this anagramThe original anagram was abcccddeeeeefggiiiiiiiillmmmmnnnnnooprrsssttttttuuuuuuuux: the letters of the Latin phrase, alphabetized. in his lifetime, but in 1705 his executor provided it as ut pendet continuum flexile, sic stabit contiguum rigidum inversum, meaning \"As hangs a flexible cable so, inverted, stand the touching pieces of an arch.\"\n\nIn 1691, Gottfried Leibniz, Christiaan Huygens, and Johann Bernoulli derived the equation in response to a challenge by Jakob Bernoulli; their solutions were published in the Acta Eruditorum for June 1691. David Gregory wrote a treatise on the catenary in 1697 in which he provided an incorrect derivation of the correct differential equation.\n\nEuler proved in 1744 that the catenary is the curve which, when rotated about the -axis, gives the surface of minimum surface area (the catenoid) for the given bounding circles. Nicolas Fuss gave equations describing the equilibrium of a chain under any force in 1796.Routh Art. 455, footnote\n\nInverted catenary arch\n\nCatenary arches are often used in the construction of kilns. To create the desired curve, the shape of a hanging chain of the desired dimensions is transferred to a form which is then used as a guide for the placement of bricks or other building material.\n\nThe Gateway Arch in St. Louis, Missouri, United States is sometimes said to be an (inverted) catenary, but this is incorrect. It is close to a more general curve called a flattened catenary, with equation , which is a catenary if . While a catenary is the ideal shape for a freestanding arch of constant thickness, the Gateway Arch is narrower near the top. According to the U.S. National Historic Landmark nomination for the arch, it is a \"weighted catenary\" instead. Its shape corresponds to the shape that a weighted chain, having lighter links in the middle, would form. and  \n\nCatenary bridges\n\nIn free-hanging chains, the force exerted is uniform with respect to length of the chain, and so the chain follows the catenary curve. The same is true of a simple suspension bridge or \"catenary bridge,\" where the roadway follows the cable.\n\nA stressed ribbon bridge is a more sophisticated structure with the same catenary shape.\n\nHowever, in a suspension bridge with a suspended roadway, the chains or cables support the weight of the bridge, and so do not hang freely. In most cases the roadway is flat, so when the weight of the cable is negligible compared with the weight being supported, the force exerted is uniform with respect to horizontal distance, and the result is a parabola, as discussed below (although the term \"catenary\" is often still used, in an informal sense). If the cable is heavy then the resulting curve is between a catenary and a parabola.Lockwood p. 122\n\nAnchoring of marine objects\n\nThe catenary produced by gravity provides an advantage to heavy anchor rodes. An anchor rode (or anchor line) usually consists of chain or cable or both. Anchor rodes are used by ships, oilrigs, docks, floating wind turbines, and other marine equipment which must be anchored to the seabed.\n\nWhen the rode is slack, the catenary curve presents a lower angle of pull on the anchor or mooring device than would be the case if it were nearly straight. This enhances the performance of the anchor and raises the level of force it will resist before dragging. To maintain the catenary shape in the presence of wind, a heavy chain is needed, so that only larger ships in deeper water can rely on this effect. Smaller boats also rely on catenary to maintain maximum holding power.\n\nMathematical description\n\nEquation\n\nThe equation of a catenary in Cartesian coordinates has the form\n\ny a \\cosh \\left(\\frac{x}{a}\\right) \n \\frac{a\\left(e^\\frac{x}{a} + e^{-\\frac{x}{a}}\\right)}{2}\n\nwhere  is the hyperbolic cosine function. All catenary curves are similar to each other; changing the parameter  is equivalent to a uniform scaling of the curve.\n\nThe Whewell equation for the catenary is\n\n\\tan \\varphi = \\frac{s}{a}\\,.\n\nDifferentiating gives\n\n\\frac{d\\varphi}{ds} = \\frac{\\cos^2\\varphi}{a}\n\nand eliminating  gives the Cesàro equationMathWorld, eq. 7\n\n\\kappa=\\frac{a}{s^2+a^2}\\,.\n\nThe radius of curvature is then\n\n\\rho = a \\sec^2 \\varphi\n\nwhich is the length of the line normal to the curve between it and the -axis.Routh Art. 444\n\nRelation to other curves\n\nWhen a parabola is rolled along a straight line, the roulette curve traced by its focus is a catenary. The envelope of the directrix of the parabola is also a catenary.Yates p. 80 The involute from the vertex, that is the roulette formed traced by a point starting at the vertex when a line is rolled on a catenary, is the tractrix.\n\nAnother roulette, formed by rolling a line on a catenary, is another line. This implies that square wheels can roll perfectly smoothly on a road made of a series of bumps in the shape of an inverted catenary curve. The wheels can be any regular polygon except a triangle, but the catenary must have parameters corresponding to the shape and dimensions of the wheels.\n\nGeometrical properties\n\nOver any horizontal interval, the ratio of the area under the catenary to its length equals , independent of the interval selected. The catenary is the only plane curve other than a horizontal line with this property. Also, the geometric centroid of the area under a stretch of catenary is the midpoint of the perpendicular segment connecting the centroid of the curve itself and the -axis.\n\nScience\n\nA moving charge in a uniform electric field travels along a catenary (which tends to a parabola if the charge velocity is much less than the speed of light ).\n\nThe surface of revolution with fixed radii at either end that has minimum surface area is a catenary revolved about the -axis.\n\nAnalysis\n\nModel of chains and arches\n\nIn the mathematical model the chain (or cord, cable, rope, string, etc.) is idealized by assuming that it is so thin that it can be regarded as a curve and that it is so flexible any force of tension exerted by the chain is parallel to the chain.Routh Art. 442, p. 316 The analysis of the curve for an optimal arch is similar except that the forces of tension become forces of compression and everything is inverted.\nAn underlying principle is that the chain may be considered a rigid body once it has attained equilibrium.Whewell p. 65 Equations which define the shape of the curve and the tension of the chain at each point may be derived by a careful inspection of the various forces acting on a segment using the fact that these forces must be in balance if the chain is in static equilibrium.\n\nLet the path followed by the chain be given parametrically by  where  represents arc length and  is the position vector. This is the natural parameterization and has the property that\n\n\\frac{d\\mathbf{r}}{ds}=\\mathbf{u}\n\nwhere  is a unit tangent vector.\n\nA differential equation for the curve may be derived as follows.Following Routh Art. 443 p. 316 Let  be the lowest point on the chain, called the vertex of the catenary.Routh Art. 443 p. 317 The slope   of the curve is zero at C since it is a minimum point. Assume  is to the right of  since the other case is implied by symmetry. The forces acting on the section of the chain from c to r are the tension of the chain at , the tension of the chain at r, and the weight of the chain. The tension at  is tangent to the curve at  and is therefore horizontal without any vertical component and it pulls the section to the left so it may be written  where  is the magnitude of the force. The tension at  is parallel to the curve at  and pulls the section to the right. The tension at  can be split into two components so it may be written , where  is the magnitude of the force and  is the angle between the curve at  and the -axis (see tangential angle). Finally, the weight of the chain is represented by  where  is the mass per unit length,  is the acceleration of gravity and  is the length of the segment of chain between  and .\n\nThe chain is in equilibrium so the sum of three forces is , therefore\n\nT \\cos \\varphi = T_0\nand\nT \\sin \\varphi = \\lambda gs\\,,\n\nand dividing these gives\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{\\lambda gs}{T_0}\\,.\n\nIt is convenient to write\n\na = \\frac{T_0}{\\lambda g}\n\nwhich is the length of chain whose weight is equal in magnitude to the tension at .Whewell p. 67 Then\n\n\\frac{dy}{dx}=\\frac{s}{a}\n\nis an equation defining the curve.\n\nThe horizontal component of the tension,  is constant and the vertical component of the tension,  is proportional to the length of chain between the  and the vertex.\n\nDerivation of equations for the curve\n\nThe differential equation given above can be solved to produce equations for the curve.Following Routh Art. 443 p/ 317\n\nFrom\n\n\\frac{dy}{dx} = \\frac{s}{a}\\,,\n\nthe formula for arc length gives\n\\frac{ds}{dx} \\sqrt{1+\\left(\\dfrac{dy}{dx}\\right)^2} \n \\frac{\\sqrt{a^2+s^2}}{a}\\,.\n\nThen\n\n\\frac{dx}{ds} \\frac{1}{\\frac{ds}{dx}} \n \\frac{a}{\\sqrt{a^2+s^2}}\n\nand\n\n\\frac{dy}{ds} \\frac{\\frac{dy}{dx}}{\\frac{ds}{dx}} \n \\frac{s}{\\sqrt{a^2+s^2}}\\,.\n\nThe second of these equations can be integrated to give\n\ny = \\sqrt{a^2+s^2} + \\beta\n\nand by shifting the position of the -axis,  can be taken to be 0. Then\n\ny \\sqrt{a^2+s^2}\\,,\\quad y^2\na^2+s^2\\,.\n\nThe -axis thus chosen is called the directrix of the catenary.\n\nIt follows that the magnitude of the tension at a point  is , which is proportional to the distance between the point and the directrix.Routh Art. 443 p. 318\n\nThe integral of the expression for  can be found using standard techniques, givingUse of hyperbolic functions follows Maurer p. 107\n\nx = a\\operatorname{arsinh}\\left(\\frac{s}{a}\\right) + \\alpha\\,.\n\nand, again, by shifting the position of the -axis,  can be taken to be 0. Then\n\nx a\\operatorname{arsinh}\\left(\\frac{s}{a}\\right)\\,,\\quad s\na \\sinh\\left(\\frac{x}{a}\\right)\\,.\n\nThe -axis thus chosen passes through the vertex and is called the axis of the catenary.\n\nThese results can be used to eliminate  giving\n\ny = a \\cosh\\left(\\frac{x}{a}\\right)\\,.\n\nAlternative derivation\n\nThe differential equation can be solved using a different approach.Following Lamb p. 342 From\n\ns = a \\tan \\varphi\n\nit follows that\n\n\\frac{dx}{d\\varphi} \\frac{dx}{ds}\\frac{ds}{d\\varphi}\n\\cos \\varphi \\cdot a \\sec^2 \\varphi= a \\sec \\varphi\nand\n\\frac{dy}{d\\varphi} \\frac{dy}{ds}\\frac{ds}{d\\varphi}\n\\sin \\varphi \\cdot a \\sec^2 \\varphi= a \\tan \\varphi \\sec \\varphi\\,.\n\nIntegrating gives,\n\nx = a \\ln(\\sec \\varphi + \\tan \\varphi) + \\alpha\nand\ny = a \\sec \\varphi + \\beta\\,.\n\nAs before, the  and -axes can be shifted so  and  can be taken to be 0. Then\n\n\\sec \\varphi + \\tan \\varphi = e^\\frac{x}{a}\\,,\nand taking the reciprocal of both sides\n\\sec \\varphi - \\tan \\varphi = e^{-\\frac{x}{a}}\\,.\n\nAdding and subtracting the last two equations then gives the solution\ny a \\sec \\varphi \n a \\cosh\\left(\\frac{x}{a}\\right)\\,,\nand\ns a \\tan \\varphi \n a \\sinh\\left(\\frac{x}{a}\\right)\\,.\n\nDetermining parameters\n\nIn general the parameter  is the position of the axis. The equation can be determined in this case as follows:Following Todhunter Art. 186\nRelabel if necessary so that  is to the left of  and let  be the horizontal and  be the vertical distance from  to . Translate the axes so that the vertex of the catenary lies on the -axis and its height  is adjusted so the catenary satisfies the standard equation of the curve\n \ny = a \\cosh\\left(\\frac{x}{a}\\right)\n\nand let the coordinates of  and  be  and  respectively. The curve passes through these points, so the difference of height is\n\nv = a \\cosh\\left(\\frac{x_2}{a}\\right) - a \\cosh\\left(\\frac{x_1}{a}\\right)\\,.\n\nand the length of the curve from  to  is\n\ns = a \\sinh\\left(\\frac{x_2}{a}\\right) - a \\sinh\\left(\\frac{x_1}{a}\\right)\\,.\n\nWhen  is expanded using these expressions the result is\n\ns^2-v^22a^2\\left(\\cosh\\left(\\frac{x_2-x_1}{a}\\right)-1\\right)\n4a^2\\sinh^2\\left(\\frac{h}{2a}\\right)\\,,\nso\n\\sqrt{s^2-v^2}=2a\\sinh\\left(\\frac{h}{2a}\\right)\\,.\n\nThis is a transcendental equation in  and must be solved numerically. It can be shown with the methods of calculusSee Routh art. 447 that there is at most one solution with  and so there is at most one position of equilibrium.\n\nGeneralizations with vertical force\n\nNonuniform chains\n\nIf the density of the chain is variable then the analysis above can be adapted to produce equations for the curve given the density, or given the curve to find the density.Following Routh Art. 450\n\nLet  denote the weight per unit length of the chain, then the weight of the chain has magnitude\n\n\\int_\\mathbf{c}^\\mathbf{r} w\\, ds\\,,\n\nwhere the limits of integration are  and . Balancing forces as in the uniform chain produces\n\nT \\cos \\varphi = T_0\nand\nT \\sin \\varphi = \\int_\\mathbf{c}^\\mathbf{r} w\\, ds\\,,\nand therefore\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{1}{T_0} \\int_\\mathbf{c}^\\mathbf{r} w\\, ds\\,.\n\nDifferentiation then gives\n\nwT_0 \\frac{d}{ds}\\frac{dy}{dx} \n \\frac{T_0 \\dfrac{d^2y}{dx^2}}{\\sqrt{1+\\left(\\dfrac{dy}{dx}\\right)^2}}\\,.\n\nIn terms of  and the radius of curvature  this becomes\n\nw= \\frac{T_0}{\\rho \\cos^2 \\varphi}\\,.\n\nSuspension bridge curve\n\nA similar analysis can be done to find the curve followed by the cable supporting a suspension bridge with a horizontal roadway.Following Routh Art. 452 If the weight of the roadway per unit length is  and the weight of the cable and the wire supporting the bridge is negligible in comparison, then the weight on the cable from  to  is  where  is the horizontal distance between  and . Proceeding as before gives the differential equation\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{w}{T_0}x\\,. \n\nThis is solved by simple integration to get\n\ny=\\frac{w}{2T_0}x^2 + \\beta\n\nand so the cable follows a parabola. If the weight of the cable and supporting wires are not negligible then the analysis is more complex.Ira Freeman investigated the case where only the cable and roadway are significant, see the External links section. Routh gives the case where only the supporting wires have significant weight as an exercise.\n\nCatenary of equal strength\n\nIn a catenary of equal strength, cable is strengthened according to the magnitude of the tension at each point, so its resistance to breaking is constant along its length. Assuming that the strength of the cable is proportional to its density per unit length, the weight, , per unit length of the chain can be written , where  is constant, and the analysis for nonuniform chains can be applied.Following Routh Art. 453\n\nIn this case the equations for tension are\n\nT \\cos \\varphi = T_0\\,,\nT \\sin \\varphi = \\frac{1}{c}\\int T\\, ds\\,.\n\nCombining gives\n\nc \\tan \\varphi = \\int \\sec \\varphi\\, ds\n\nand by differentiation\n\nc = \\rho \\cos \\varphi\n\nwhere  is the radius of curvature.\n\nThe solution to this is\n\ny = c \\ln\\left(\\sec\\left(\\frac{x}{c}\\right)\\right)\\,.\n\nIn this case, the curve has vertical asymptotes and this limits the span to . Other relations are\n\nx c\\varphi\\,,\\quad s \n \\ln\\left(\\tan\\left(\\frac{\\pi+2\\varphi}{4}\\right)\\right)\\,.\n\nThe curve was studied 1826 by Davies Gilbert and, apparently independently, by Gaspard-Gustave Coriolis in 1836.\n\nRecently, it was shown that this type of catenary could act as a building block of electromagnetic metasurface and was known as \"catenary of equal phase gradient\".\n\nElastic catenary\n\nIn an elastic catenary, the chain is replaced by a spring which can stretch in response to tension. The spring is assumed to stretch in accordance with Hooke's Law. Specifically, if  is the natural length of a section of spring, then the length of the spring with tension  applied has length\n\ns=\\left(1+\\frac{T}{E}\\right)p\\,,\n\nwhere  is a constant equal to , where  is the stiffness of the spring.Routh Art. 489 In the catenary the value of  is variable, but ratio remains valid at a local level, soRouth Art. 494\n\\frac{ds}{dp}=1+\\frac{T}{E}\\,.\nThe curve followed by an elastic spring can now be derived following a similar method as for the inelastic spring.Following Routh Art. 500\n\nThe equations for tension of the spring are\n\nT \\cos \\varphi = T_0\\,,\nand\nT \\sin \\varphi = \\lambda_0 gp\\,,\n\nfrom which\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{\\lambda_0 gp}{T_0}\\,,\\quad T=\\sqrt{T_0^2+\\lambda_0^2 g^2p^2}\\,,\n\nwhere  is the natural length of the segment from  to  and  is the mass per unit length of the spring with no tension and  is the acceleration of gravity. Write\n\na = \\frac{T_0}{\\lambda_0 g}\n\nso\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{p}{a}\\,,\\quad T=\\frac{T_0}{a}\\sqrt{a^2+p^2}\\,.\n\nThen \n\\frac{dx}{ds} \\cos \\varphi \n \\frac{T_0}{T}\nand \n\\frac{dy}{ds} \\sin \\varphi \n \\frac{\\lambda_0 gp}{T}\\,,\nfrom which\n\\frac{dx}{dp} \\frac{T_0}{T}\\frac{ds}{dp} \n T_0\\left(\\frac{1}{T}+\\frac{1}{E}\\right)=\\frac{a}{\\sqrt{a^2+p^2}}+\\frac{T_0}{E}\nand \n\\frac{dy}{dp} \\frac{\\lambda_0 gp}{T}\\frac{ds}{dp} \n \\frac{T_0p}{a}\\left(\\frac{1}{T}+\\frac{1}{E}\\right)=\\frac{p}{\\sqrt{a^2+p^2}}+\\frac{T_0p}{Ea}\\,.\n\nIntegrating gives the parametric equations\n\nx=a\\operatorname{arcsinh}\\left(\\frac{p}{a}\\right)+\\frac{T_0}{E}p + \\alpha\\,,\ny=\\sqrt{a^2+p^2}+\\frac{T_0}{2Ea}p^2+\\beta\\,.\n\nAgain, the  and -axes can be shifted so  and  can be taken to be 0. So\n\nx=a\\operatorname{arcsinh}\\left(\\frac{p}{a}\\right)+\\frac{T_0}{E}p\\,,\ny=\\sqrt{a^2+p^2}+\\frac{T_0}{2Ea}p^2\n\nare parametric equations for the curve. At the rigid limit where  is large, the shape of the curve reduces to that of a non-elastic chain.\n\nOther generalizations\n\nChain under a general force\n\nWith no assumptions have been made regarding the force  acting on the chain, the following analysis can be made.Follows Routh Art. 455\n\nFirst, let  be the force of tension as a function of . The chain is flexible so it can only exert a force parallel to itself. Since tension is defined as the force that the chain exerts on itself,  must be parallel to the chain. In other words,\n\n\\mathbf{T} = T \\mathbf{u}\\,,\n\nwhere  is the magnitude of  and  is the unit tangent vector.\n\nSecond, let  be the external force per unit length acting on a small segment of a chain as a function of . The forces acting on the segment of the chain between  and  are the force of tension  at one end of the segment, the nearly opposite force  at the other end, and the external force acting on the segment which is approximately . These forces must balance so\n\n\\mathbf{T}(s+\\Delta s)-\\mathbf{T}(s)+\\mathbf{G}\\Delta s \\approx \\mathbf{0}\\,.\n\nDivide by  and take the limit as  to obtain\n\n\\frac{d\\mathbf{T}}{ds} + \\mathbf{G} = \\mathbf{0}\\,.\n\nThese equations can be used as the starting point in the analysis of a flexible chain acting under any external force. In the case of the standard catenary,  where the chain has mass  per unit length and  is the acceleration of gravity.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Catenary" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7163" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In physics and geometry, a catenary (,) is the curve that an idealized hanging chain or cable assumes under its own weight when supported only at its ends.\n\nThe catenary curve has a U-like shape, superficially similar in appearance to a parabolic arch, but it is not a parabola.\n\nThe curve appears in the design of certain types of arches and  as a cross section of the catenoid—the shape assumed by a soap film bounded by two parallel circular rings.\n\nThe catenary is also called the alysoid, chainette,MathWorld or, particularly in the materials sciences, funicular.e.g.:  \n\nMathematically, the catenary curve is the graph of the hyperbolic cosine function. The surface of revolution of the catenary curve, the catenoid, is a minimal surface, specifically a minimal surface of revolution. The mathematical properties of the catenary curve were first studied by Robert Hooke in the 1670s, and its equation was derived by Leibniz, Huygens and Johann Bernoulli in 1691.\n\nCatenaries and related curves are used in architecture and engineering, in the design of bridges and arches, so that forces do not result in bending moments. In the offshore oil and gas industry, \"catenary\" refers to a steel catenary riser, a pipeline suspended between a production platform and the seabed that adopts an approximate catenary shape.\n\nHistory\n\nThe word \"catenary\" is derived from the Latin word catēna, which means \"chain\". The English word \"catenary\" is usually attributed to Thomas Jefferson,\nwho wrote in a letter to Thomas Paine on the construction of an arch for a bridge:\n\nIt is often said that Galileo thought the curve of a hanging chain was parabolic. In his Two New Sciences (1638), Galileo says that a hanging cord is an approximate parabola, and he correctly observes that this approximation improves as the curvature gets smaller and is almost exact when the elevation is less than 45°. That the curve followed by a chain is not a parabola was proven by Joachim Jungius (1587–1657); this result was published posthumously in 1669.Lockwood p. 124\n\nThe application of the catenary to the construction of arches is attributed to Robert Hooke, whose \"true mathematical and mechanical form\" in the context of the rebuilding of St Paul's Cathedral  alluded to a catenary. Some much older arches approximate catenaries, an example of which is the Arch of Taq-i Kisra in Ctesiphon.\n\nIn 1671, Hooke announced to the Royal Society that he had solved the problem of the optimal shape of an arch, and in 1675 published an encrypted solution as a Latin anagramcf. the anagram for Hooke's law, which appeared in the next paragraph. in an appendix to his Description of Helioscopes, where he wrote that he had found \"a true mathematical and mechanical form of all manner of Arches for Building.\" He did not publish the solution to this anagramThe original anagram was abcccddeeeeefggiiiiiiiillmmmmnnnnnooprrsssttttttuuuuuuuux: the letters of the Latin phrase, alphabetized. in his lifetime, but in 1705 his executor provided it as ut pendet continuum flexile, sic stabit contiguum rigidum inversum, meaning \"As hangs a flexible cable so, inverted, stand the touching pieces of an arch.\"\n\nIn 1691, Gottfried Leibniz, Christiaan Huygens, and Johann Bernoulli derived the equation in response to a challenge by Jakob Bernoulli; their solutions were published in the Acta Eruditorum for June 1691. David Gregory wrote a treatise on the catenary in 1697 in which he provided an incorrect derivation of the correct differential equation.\n\nEuler proved in 1744 that the catenary is the curve which, when rotated about the -axis, gives the surface of minimum surface area (the catenoid) for the given bounding circles. Nicolas Fuss gave equations describing the equilibrium of a chain under any force in 1796.Routh Art. 455, footnote\n\nInverted catenary arch\n\nCatenary arches are often used in the construction of kilns. To create the desired curve, the shape of a hanging chain of the desired dimensions is transferred to a form which is then used as a guide for the placement of bricks or other building material.\n\nThe Gateway Arch in St. Louis, Missouri, United States is sometimes said to be an (inverted) catenary, but this is incorrect. It is close to a more general curve called a flattened catenary, with equation , which is a catenary if . While a catenary is the ideal shape for a freestanding arch of constant thickness, the Gateway Arch is narrower near the top. According to the U.S. National Historic Landmark nomination for the arch, it is a \"weighted catenary\" instead. Its shape corresponds to the shape that a weighted chain, having lighter links in the middle, would form. and  \n\nCatenary bridges\n\nIn free-hanging chains, the force exerted is uniform with respect to length of the chain, and so the chain follows the catenary curve. The same is true of a simple suspension bridge or \"catenary bridge,\" where the roadway follows the cable.\n\nA stressed ribbon bridge is a more sophisticated structure with the same catenary shape.\n\nHowever, in a suspension bridge with a suspended roadway, the chains or cables support the weight of the bridge, and so do not hang freely. In most cases the roadway is flat, so when the weight of the cable is negligible compared with the weight being supported, the force exerted is uniform with respect to horizontal distance, and the result is a parabola, as discussed below (although the term \"catenary\" is often still used, in an informal sense). If the cable is heavy then the resulting curve is between a catenary and a parabola.Lockwood p. 122\n\nAnchoring of marine objects\n\nThe catenary produced by gravity provides an advantage to heavy anchor rodes. An anchor rode (or anchor line) usually consists of chain or cable or both. Anchor rodes are used by ships, oilrigs, docks, floating wind turbines, and other marine equipment which must be anchored to the seabed.\n\nWhen the rode is slack, the catenary curve presents a lower angle of pull on the anchor or mooring device than would be the case if it were nearly straight. This enhances the performance of the anchor and raises the level of force it will resist before dragging. To maintain the catenary shape in the presence of wind, a heavy chain is needed, so that only larger ships in deeper water can rely on this effect. Smaller boats also rely on catenary to maintain maximum holding power.\n\nMathematical description\n\nEquation\n\nThe equation of a catenary in Cartesian coordinates has the form\n\ny a \\cosh \\left(\\frac{x}{a}\\right) \n \\frac{a\\left(e^\\frac{x}{a} + e^{-\\frac{x}{a}}\\right)}{2}\n\nwhere  is the hyperbolic cosine function. All catenary curves are similar to each other; changing the parameter  is equivalent to a uniform scaling of the curve.\n\nThe Whewell equation for the catenary is\n\n\\tan \\varphi = \\frac{s}{a}\\,.\n\nDifferentiating gives\n\n\\frac{d\\varphi}{ds} = \\frac{\\cos^2\\varphi}{a}\n\nand eliminating  gives the Cesàro equationMathWorld, eq. 7\n\n\\kappa=\\frac{a}{s^2+a^2}\\,.\n\nThe radius of curvature is then\n\n\\rho = a \\sec^2 \\varphi\n\nwhich is the length of the line normal to the curve between it and the -axis.Routh Art. 444\n\nRelation to other curves\n\nWhen a parabola is rolled along a straight line, the roulette curve traced by its focus is a catenary. The envelope of the directrix of the parabola is also a catenary.Yates p. 80 The involute from the vertex, that is the roulette formed traced by a point starting at the vertex when a line is rolled on a catenary, is the tractrix.\n\nAnother roulette, formed by rolling a line on a catenary, is another line. This implies that square wheels can roll perfectly smoothly on a road made of a series of bumps in the shape of an inverted catenary curve. The wheels can be any regular polygon except a triangle, but the catenary must have parameters corresponding to the shape and dimensions of the wheels.\n\nGeometrical properties\n\nOver any horizontal interval, the ratio of the area under the catenary to its length equals , independent of the interval selected. The catenary is the only plane curve other than a horizontal line with this property. Also, the geometric centroid of the area under a stretch of catenary is the midpoint of the perpendicular segment connecting the centroid of the curve itself and the -axis.\n\nScience\n\nA moving charge in a uniform electric field travels along a catenary (which tends to a parabola if the charge velocity is much less than the speed of light ).\n\nThe surface of revolution with fixed radii at either end that has minimum surface area is a catenary revolved about the -axis.\n\nAnalysis\n\nModel of chains and arches\n\nIn the mathematical model the chain (or cord, cable, rope, string, etc.) is idealized by assuming that it is so thin that it can be regarded as a curve and that it is so flexible any force of tension exerted by the chain is parallel to the chain.Routh Art. 442, p. 316 The analysis of the curve for an optimal arch is similar except that the forces of tension become forces of compression and everything is inverted.\nAn underlying principle is that the chain may be considered a rigid body once it has attained equilibrium.Whewell p. 65 Equations which define the shape of the curve and the tension of the chain at each point may be derived by a careful inspection of the various forces acting on a segment using the fact that these forces must be in balance if the chain is in static equilibrium.\n\nLet the path followed by the chain be given parametrically by  where  represents arc length and  is the position vector. This is the natural parameterization and has the property that\n\n\\frac{d\\mathbf{r}}{ds}=\\mathbf{u}\n\nwhere  is a unit tangent vector.\n\nA differential equation for the curve may be derived as follows.Following Routh Art. 443 p. 316 Let  be the lowest point on the chain, called the vertex of the catenary.Routh Art. 443 p. 317 The slope   of the curve is zero at C since it is a minimum point. Assume  is to the right of  since the other case is implied by symmetry. The forces acting on the section of the chain from c to r are the tension of the chain at , the tension of the chain at r, and the weight of the chain. The tension at  is tangent to the curve at  and is therefore horizontal without any vertical component and it pulls the section to the left so it may be written  where  is the magnitude of the force. The tension at  is parallel to the curve at  and pulls the section to the right. The tension at  can be split into two components so it may be written , where  is the magnitude of the force and  is the angle between the curve at  and the -axis (see tangential angle). Finally, the weight of the chain is represented by  where  is the mass per unit length,  is the acceleration of gravity and  is the length of the segment of chain between  and .\n\nThe chain is in equilibrium so the sum of three forces is , therefore\n\nT \\cos \\varphi = T_0\nand\nT \\sin \\varphi = \\lambda gs\\,,\n\nand dividing these gives\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{\\lambda gs}{T_0}\\,.\n\nIt is convenient to write\n\na = \\frac{T_0}{\\lambda g}\n\nwhich is the length of chain whose weight is equal in magnitude to the tension at .Whewell p. 67 Then\n\n\\frac{dy}{dx}=\\frac{s}{a}\n\nis an equation defining the curve.\n\nThe horizontal component of the tension,  is constant and the vertical component of the tension,  is proportional to the length of chain between the  and the vertex.\n\nDerivation of equations for the curve\n\nThe differential equation given above can be solved to produce equations for the curve.Following Routh Art. 443 p/ 317\n\nFrom\n\n\\frac{dy}{dx} = \\frac{s}{a}\\,,\n\nthe formula for arc length gives\n\\frac{ds}{dx} \\sqrt{1+\\left(\\dfrac{dy}{dx}\\right)^2} \n \\frac{\\sqrt{a^2+s^2}}{a}\\,.\n\nThen\n\n\\frac{dx}{ds} \\frac{1}{\\frac{ds}{dx}} \n \\frac{a}{\\sqrt{a^2+s^2}}\n\nand\n\n\\frac{dy}{ds} \\frac{\\frac{dy}{dx}}{\\frac{ds}{dx}} \n \\frac{s}{\\sqrt{a^2+s^2}}\\,.\n\nThe second of these equations can be integrated to give\n\ny = \\sqrt{a^2+s^2} + \\beta\n\nand by shifting the position of the -axis,  can be taken to be 0. Then\n\ny \\sqrt{a^2+s^2}\\,,\\quad y^2\na^2+s^2\\,.\n\nThe -axis thus chosen is called the directrix of the catenary.\n\nIt follows that the magnitude of the tension at a point  is , which is proportional to the distance between the point and the directrix.Routh Art. 443 p. 318\n\nThe integral of the expression for  can be found using standard techniques, givingUse of hyperbolic functions follows Maurer p. 107\n\nx = a\\operatorname{arsinh}\\left(\\frac{s}{a}\\right) + \\alpha\\,.\n\nand, again, by shifting the position of the -axis,  can be taken to be 0. Then\n\nx a\\operatorname{arsinh}\\left(\\frac{s}{a}\\right)\\,,\\quad s\na \\sinh\\left(\\frac{x}{a}\\right)\\,.\n\nThe -axis thus chosen passes through the vertex and is called the axis of the catenary.\n\nThese results can be used to eliminate  giving\n\ny = a \\cosh\\left(\\frac{x}{a}\\right)\\,.\n\nAlternative derivation\n\nThe differential equation can be solved using a different approach.Following Lamb p. 342 From\n\ns = a \\tan \\varphi\n\nit follows that\n\n\\frac{dx}{d\\varphi} \\frac{dx}{ds}\\frac{ds}{d\\varphi}\n\\cos \\varphi \\cdot a \\sec^2 \\varphi= a \\sec \\varphi\nand\n\\frac{dy}{d\\varphi} \\frac{dy}{ds}\\frac{ds}{d\\varphi}\n\\sin \\varphi \\cdot a \\sec^2 \\varphi= a \\tan \\varphi \\sec \\varphi\\,.\n\nIntegrating gives,\n\nx = a \\ln(\\sec \\varphi + \\tan \\varphi) + \\alpha\nand\ny = a \\sec \\varphi + \\beta\\,.\n\nAs before, the  and -axes can be shifted so  and  can be taken to be 0. Then\n\n\\sec \\varphi + \\tan \\varphi = e^\\frac{x}{a}\\,,\nand taking the reciprocal of both sides\n\\sec \\varphi - \\tan \\varphi = e^{-\\frac{x}{a}}\\,.\n\nAdding and subtracting the last two equations then gives the solution\ny a \\sec \\varphi \n a \\cosh\\left(\\frac{x}{a}\\right)\\,,\nand\ns a \\tan \\varphi \n a \\sinh\\left(\\frac{x}{a}\\right)\\,.\n\nDetermining parameters\n\nIn general the parameter  is the position of the axis. The equation can be determined in this case as follows:Following Todhunter Art. 186\nRelabel if necessary so that  is to the left of  and let  be the horizontal and  be the vertical distance from  to . Translate the axes so that the vertex of the catenary lies on the -axis and its height  is adjusted so the catenary satisfies the standard equation of the curve\n \ny = a \\cosh\\left(\\frac{x}{a}\\right)\n\nand let the coordinates of  and  be  and  respectively. The curve passes through these points, so the difference of height is\n\nv = a \\cosh\\left(\\frac{x_2}{a}\\right) - a \\cosh\\left(\\frac{x_1}{a}\\right)\\,.\n\nand the length of the curve from  to  is\n\ns = a \\sinh\\left(\\frac{x_2}{a}\\right) - a \\sinh\\left(\\frac{x_1}{a}\\right)\\,.\n\nWhen  is expanded using these expressions the result is\n\ns^2-v^22a^2\\left(\\cosh\\left(\\frac{x_2-x_1}{a}\\right)-1\\right)\n4a^2\\sinh^2\\left(\\frac{h}{2a}\\right)\\,,\nso\n\\sqrt{s^2-v^2}=2a\\sinh\\left(\\frac{h}{2a}\\right)\\,.\n\nThis is a transcendental equation in  and must be solved numerically. It can be shown with the methods of calculusSee Routh art. 447 that there is at most one solution with  and so there is at most one position of equilibrium.\n\nGeneralizations with vertical force\n\nNonuniform chains\n\nIf the density of the chain is variable then the analysis above can be adapted to produce equations for the curve given the density, or given the curve to find the density.Following Routh Art. 450\n\nLet  denote the weight per unit length of the chain, then the weight of the chain has magnitude\n\n\\int_\\mathbf{c}^\\mathbf{r} w\\, ds\\,,\n\nwhere the limits of integration are  and . Balancing forces as in the uniform chain produces\n\nT \\cos \\varphi = T_0\nand\nT \\sin \\varphi = \\int_\\mathbf{c}^\\mathbf{r} w\\, ds\\,,\nand therefore\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{1}{T_0} \\int_\\mathbf{c}^\\mathbf{r} w\\, ds\\,.\n\nDifferentiation then gives\n\nwT_0 \\frac{d}{ds}\\frac{dy}{dx} \n \\frac{T_0 \\dfrac{d^2y}{dx^2}}{\\sqrt{1+\\left(\\dfrac{dy}{dx}\\right)^2}}\\,.\n\nIn terms of  and the radius of curvature  this becomes\n\nw= \\frac{T_0}{\\rho \\cos^2 \\varphi}\\,.\n\nSuspension bridge curve\n\nA similar analysis can be done to find the curve followed by the cable supporting a suspension bridge with a horizontal roadway.Following Routh Art. 452 If the weight of the roadway per unit length is  and the weight of the cable and the wire supporting the bridge is negligible in comparison, then the weight on the cable from  to  is  where  is the horizontal distance between  and . Proceeding as before gives the differential equation\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{w}{T_0}x\\,. \n\nThis is solved by simple integration to get\n\ny=\\frac{w}{2T_0}x^2 + \\beta\n\nand so the cable follows a parabola. If the weight of the cable and supporting wires are not negligible then the analysis is more complex.Ira Freeman investigated the case where only the cable and roadway are significant, see the External links section. Routh gives the case where only the supporting wires have significant weight as an exercise.\n\nCatenary of equal strength\n\nIn a catenary of equal strength, cable is strengthened according to the magnitude of the tension at each point, so its resistance to breaking is constant along its length. Assuming that the strength of the cable is proportional to its density per unit length, the weight, , per unit length of the chain can be written , where  is constant, and the analysis for nonuniform chains can be applied.Following Routh Art. 453\n\nIn this case the equations for tension are\n\nT \\cos \\varphi = T_0\\,,\nT \\sin \\varphi = \\frac{1}{c}\\int T\\, ds\\,.\n\nCombining gives\n\nc \\tan \\varphi = \\int \\sec \\varphi\\, ds\n\nand by differentiation\n\nc = \\rho \\cos \\varphi\n\nwhere  is the radius of curvature.\n\nThe solution to this is\n\ny = c \\ln\\left(\\sec\\left(\\frac{x}{c}\\right)\\right)\\,.\n\nIn this case, the curve has vertical asymptotes and this limits the span to . Other relations are\n\nx c\\varphi\\,,\\quad s \n \\ln\\left(\\tan\\left(\\frac{\\pi+2\\varphi}{4}\\right)\\right)\\,.\n\nThe curve was studied 1826 by Davies Gilbert and, apparently independently, by Gaspard-Gustave Coriolis in 1836.\n\nRecently, it was shown that this type of catenary could act as a building block of electromagnetic metasurface and was known as \"catenary of equal phase gradient\".\n\nElastic catenary\n\nIn an elastic catenary, the chain is replaced by a spring which can stretch in response to tension. The spring is assumed to stretch in accordance with Hooke's Law. Specifically, if  is the natural length of a section of spring, then the length of the spring with tension  applied has length\n\ns=\\left(1+\\frac{T}{E}\\right)p\\,,\n\nwhere  is a constant equal to , where  is the stiffness of the spring.Routh Art. 489 In the catenary the value of  is variable, but ratio remains valid at a local level, soRouth Art. 494\n\\frac{ds}{dp}=1+\\frac{T}{E}\\,.\nThe curve followed by an elastic spring can now be derived following a similar method as for the inelastic spring.Following Routh Art. 500\n\nThe equations for tension of the spring are\n\nT \\cos \\varphi = T_0\\,,\nand\nT \\sin \\varphi = \\lambda_0 gp\\,,\n\nfrom which\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{\\lambda_0 gp}{T_0}\\,,\\quad T=\\sqrt{T_0^2+\\lambda_0^2 g^2p^2}\\,,\n\nwhere  is the natural length of the segment from  to  and  is the mass per unit length of the spring with no tension and  is the acceleration of gravity. Write\n\na = \\frac{T_0}{\\lambda_0 g}\n\nso\n\n\\frac{dy}{dx}\\tan \\varphi \n \\frac{p}{a}\\,,\\quad T=\\frac{T_0}{a}\\sqrt{a^2+p^2}\\,.\n\nThen \n\\frac{dx}{ds} \\cos \\varphi \n \\frac{T_0}{T}\nand \n\\frac{dy}{ds} \\sin \\varphi \n \\frac{\\lambda_0 gp}{T}\\,,\nfrom which\n\\frac{dx}{dp} \\frac{T_0}{T}\\frac{ds}{dp} \n T_0\\left(\\frac{1}{T}+\\frac{1}{E}\\right)=\\frac{a}{\\sqrt{a^2+p^2}}+\\frac{T_0}{E}\nand \n\\frac{dy}{dp} \\frac{\\lambda_0 gp}{T}\\frac{ds}{dp} \n \\frac{T_0p}{a}\\left(\\frac{1}{T}+\\frac{1}{E}\\right)=\\frac{p}{\\sqrt{a^2+p^2}}+\\frac{T_0p}{Ea}\\,.\n\nIntegrating gives the parametric equations\n\nx=a\\operatorname{arcsinh}\\left(\\frac{p}{a}\\right)+\\frac{T_0}{E}p + \\alpha\\,,\ny=\\sqrt{a^2+p^2}+\\frac{T_0}{2Ea}p^2+\\beta\\,.\n\nAgain, the  and -axes can be shifted so  and  can be taken to be 0. So\n\nx=a\\operatorname{arcsinh}\\left(\\frac{p}{a}\\right)+\\frac{T_0}{E}p\\,,\ny=\\sqrt{a^2+p^2}+\\frac{T_0}{2Ea}p^2\n\nare parametric equations for the curve. At the rigid limit where  is large, the shape of the curve reduces to that of a non-elastic chain.\n\nOther generalizations\n\nChain under a general force\n\nWith no assumptions have been made regarding the force  acting on the chain, the following analysis can be made.Follows Routh Art. 455\n\nFirst, let  be the force of tension as a function of . The chain is flexible so it can only exert a force parallel to itself. Since tension is defined as the force that the chain exerts on itself,  must be parallel to the chain. In other words,\n\n\\mathbf{T} = T \\mathbf{u}\\,,\n\nwhere  is the magnitude of  and  is the unit tangent vector.\n\nSecond, let  be the external force per unit length acting on a small segment of a chain as a function of . The forces acting on the segment of the chain between  and  are the force of tension  at one end of the segment, the nearly opposite force  at the other end, and the external force acting on the segment which is approximately . These forces must balance so\n\n\\mathbf{T}(s+\\Delta s)-\\mathbf{T}(s)+\\mathbf{G}\\Delta s \\approx \\mathbf{0}\\,.\n\nDivide by  and take the limit as  to obtain\n\n\\frac{d\\mathbf{T}}{ds} + \\mathbf{G} = \\mathbf{0}\\,.\n\nThese equations can be used as the starting point in the analysis of a flexible chain acting under any external force. In the case of the standard catenary,  where the chain has mass  per unit length and  is the acceleration of gravity. Catenary. http://en.wikipedia.org/?curid=7163."
  }
}
