{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11036",
  "eid" : "f94bbee0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497998,
  "textBody" : "A fin is a thin component or appendage attached to a larger body or structure. Fins typically function as foils that produce lift or thrust, or provide the ability to steer or stabilize motion while traveling in water, air, or other fluid media. Fins are also used to increase surface areas for heat transfer purposes, or simply as ornamentation.[http://oxforddictionaries.com/definition/american_english/fin Fin] Oxford dictionary. Retrieved 24 November 2012.[http://www.merriam-webster.com/dictionary/fin Fin] Merriam-Webster dictionary. Retrieved 24 November 2012.\n\nFins first evolved on fish as a means of locomotion. Fish fins are used to generate thrust and control the subsequent motion. Fish, and other aquatic animals such as cetaceans, actively propel and steer themselves with pectoral and tail fins. As they swim, they use other fins, such as dorsal and anal fins, to achieve stability and refine their maneuvering.Helfman G, Collette BB, Facey DE and Bowen BW (2009) [http://limnology.wisc.edu/courses/zoo510/2009/helfman_ch8.pdf \"Functional morphology of locomotion and feeding\"]  Chapter 8, pp. 101–116. In:The Diversity of Fishes: Biology, John Wiley & Sons. .\n\nGenerating thrust\n\nFoil shaped fins generate thrust when moved, the lift of the fin sets water or air in motion and pushes the fin in the opposite direction. Aquatic animals get significant thrust by moving fins back and forth in water. Often the tail fin is used, but some aquatic animals generate thrust from pectoral fins. Fins can also generate thrust if they are rotated in air or water. Turbines and propellers (and sometimes fans and pumps) use a number of rotating fins, also called foils, wings, arms or blades.  Propellers use the fins to translate torquing force to lateral thrust, thus propelling an aircraft or ship.Carlton, John (2007) [https://books.google.com/books?id\nQrLNCxzynU4C Marine Propellers and Propulsion] Pages 1–28, Butterworth-Heinemann. . Turbines work in reverse, using the lift of the blades to generate torque and power from moving gases or water.Soares, Claire (2008) [https://books.google.com/books?id=rTPZp1YCQBkC Gas Turbines: A Handbook of Air, Land, and Sea Applications] Pages 1–23, Butterworth-Heinemann. .\n\nCavitation can be a problem with high power applications, resulting in damage to propellers or turbines, as well as noise and loss of power.Franc, Jean-Pierre and Michel, Jean-Marie (2004) [https://books.google.com/books?id\nQJOQYa_oo24C&printsecfrontcover&dq\nCavitation&hlen&sa\nX&ei_p6sUNbrHpHimAWjr4CwBg&ved\n0CDYQ6AEwAg#vonepage&q\nCavitation&ffalse Fundamentals of Cavitation] Springer. . Cavitation occurs when negative pressure causes bubbles (cavities) to form in a liquid, which then promptly and violently collapse. It can cause significant damage and wear. Cavitation damage can also occur to the tail fins of powerful swimming marine animals, such as dolphins and tuna. Cavitation is more likely to occur near the surface of the ocean, where the ambient water pressure is relatively low. Even if they have the power to swim faster, dolphins may have to restrict their speed because collapsing cavitation bubbles on their tail are too painful. Cavitation also slows tuna, but for a different reason. Unlike dolphins, these fish do not feel the bubbles, because they have bony fins without nerve endings. Nevertheless, they cannot swim faster because the cavitation bubbles create a vapor film around their fins that limits their speed. Lesions have been found on tuna that are consistent with cavitation damage.\n\nScombrid fishes (tuna, mackerel and bonito) are particularly high-performance swimmers. Along the margin at the rear of their bodies is a line of small rayless, non-retractable fins, known as finlets. There has been much speculation about the function  of these finlets. Research done in 2000 and 2001 by Nauen and Lauder indicated that \"the finlets have a hydrodynamic effect on local flow during steady swimming\" and that \"the most posterior finlet is oriented to redirect flow into the developing tail vortex, which may increase thrust produced by the tail of swimming mackerel\".\n\nFish use multiple fins, so it is possible that a given fin can have a hydrodynamic interaction with another fin. In particular, the fins immediately upstream of the caudal (tail) fin may be proximate fins that can directly affect the flow dynamics at the caudal fin. In 2011, researchers using volumetric imaging techniques were able to generate \"the first instantaneous three-dimensional views of wake structures as they are produced by freely swimming fishes\". They found that \"continuous tail beats resulted in the formation of a linked chain of vortex rings\" and that \"the dorsal and anal fin wakes are rapidly entrained by the caudal fin wake, approximately within the timeframe of a subsequent tail beat\".\n\nControlling motion\n\nOnce motion has been established, the motion itself can be controlled with the use of other fins. Boats control direction (yaw) with fin-like rudders, and roll with stabilizer fins and keel fins.Perez, Tristan (2005) [https://books.google.com/books?idlxlO3d2srAIC&printsec\nfrontcover&dqfin&hl\nen&saX&ei\nAw-mUOGTPNGUiQeG4oCoDw&ved0CLQCEOgBMFI4ZA#v\nonepage&qfin&f\nfalse Ship Motion Control: Course Keeping and Roll Stabilisation Using Rudder and Fins] Springer. . Airplanes achieve similar results with small specialised fins that change the shape of their wings and tail fins.McClamroch, N Harris (2011) [https://books.google.com/books?id\nDKK7m8o7_ZkC&pgPA58&dq\nyaw+roll+pitch+airplane&hlen&sa\nX&eiJcitUJWoHe3ImAWEzYHoAw&ved\n0CIsBEOgBMB4#vonepage&q\nyaw%20roll%20pitch&f=false Steady Aircraft Flight and Performance]  Page 2–3, Princeton University Press. .\n\nStabilising fins are used as fletching on arrows and some darts,Vujic, Dragan (2007) [https://books.google.com/books?idYsiPb2nmYdEC&pg\nPA17&dqarrow+fletch+vane&hl\nen&saX&ei\nzs2tUK_QHIHsmAXl94DwCw&ved0CEwQ6AEwCQ#v\nonepage&qarrow%20fletch%20vane&f\nfalse Bow Hunting Whitetails] Page 17, iUniverse. . and at the rear of some bombs, missiles, rockets, and self-propelled torpedoes.Hobbs, Marvin (2010) [https://books.google.com/books?ida0TxaTq2rQIC&pg\nSA1-PA24&dqstabilising|stabilizing|stabilize|stabilise+fin+rocket&hl\nen&saX&ei\nH9atUOK4DpHPmAXyzoCgAg&ved0CDoQ6AEwAQ#v\nonepage&qstabilising|stabilizing|stabilize|stabilise%20fin%20rocket&f\nfalse Basics of Missile Guidance and Space Techniques]  Page 24, Wildside Press LLC. .Compon-Hall, Richard (2004) [https://books.google.com/books?idEEJ6YaMGkV4C&pg\nPA50&dq%22stabilising+fin%22|%22stabilizing+fin%22+torpedo&hl\nen&saX&ei\nsNitUOXXLoSfmQXUxIDQAQ&ved0CDYQ6AEwAA#v\nonepage&q%22stabilising%20fin%22|%22stabilizing%20fin%22%20torpedo&f\nfalseSubmarines at War 1939-1945]  Page 50, Periscope Publishing. .  These are typically planar and shaped like small wings, although grid fins are sometimes used.Khalid M, Sun Y and Xu H (1998) [ftp://ftp.rta.nato.int/Pubfulltext/RTO/MP/.../RTO-MP-005/$MP-005-12.pdf \"Computation of Flows Past Grid Fin Missiles\"] AVT Symposium on Missile Aerodynamics, Sorrento, Italy. Static fins have also been used for one satellite, GOCE.\n\nRegulating temperature\n\nEngineering fins are also used as heat transfer fins to regulate temperature in heat sinks or fin radiators.Siegel R and Howell JR (2002) [https://books.google.com/books?idO389yQ0-fecC&pg\nPA1&dqThermal+Radiation+Heat+Transfer&hl\nen&saX&ei\nDeGtUPi0MqzJmQWpkYDACQ&ved=0CDAQ6AEwAA Thermal Radiation Heat Transfer] Chapter 9: Radiation combined with conduction and convection at boundaries, pp.335–370. Taylor & Francis. .[http://www.britannica.com/EBchecked/topic/207095/fin Fin: Function in aircraft engines] Encyclopædia Britannica. Retrieved 22 November 2012.\n\nOrnamentation and other uses\n\nIn biology, fins can have an adaptive significance as sexual ornaments. During courtship, the female cichlid, Pelvicachromis taeniatus, displays a large and visually arresting purple pelvic fin. \"The researchers found that males clearly preferred females with a larger pelvic fin and that pelvic fins grew in a more disproportionate way than other fins on female fish.\"[http://www.sciencedaily.com/releases/2010/10/101007210540.htm Female fish flaunt fins to attract a mate] ScienceDaily. 8 October 2010.Baldauf SA, TCM Bakker, F Herder, H Kullmann and T Thünken (2010) [http://www.biomedcentral.com/1471-2148/10/301/ \"Male mate choice scales female ornament allometry in a cichlid fish\"] BMC Evolutionary Biologr//, 10 :301. \n\nReshaping human feet with swim fins, rather like the tail fin of a fish, add thrust and efficiency to the kicks of a swimmer or underwater diver Surfboard fins provide surfers with means to maneuver and control their boards. Contemporary surfboards often have a centre fin and two cambered side fins.Brandner PA and Walker GJ (2004) [http://eprints.utas.edu.au/6613/1/AFMC_Brandnerand_Walker_2004_F1.pdf Hydrodynamic Performance of a Surfboard Fin] 15th Australasian Fluid Mechanics Conference, Sydney.\n\nThe bodies of reef fishes are often shaped differently from open water fishes. Open water fishes are usually built for speed, streamlined like torpedoes to minimise friction as they move through the water. Reef fish operate in the relatively confined spaces and complex underwater landscapes of coral reefs. For this manoeuvrability is more important than straight line speed, so coral reef fish have developed bodies which optimize their ability to dart and change direction. They outwit predators by dodging into fissures in the reef or playing hide and seek around coral heads.Alevizon WS (1994) [https://www.amazon.com/dp/1559920777 \"Pisces Guide to Caribbean Reef Ecology\"]  Gulf Publishing Company  The pectoral and pelvic fins of many reef fish, such as butterflyfish, damselfish and angelfish, have evolved so they can act as brakes and allow complex maneuvers.[http://www.flmnh.ufl.edu/fish/education/HowSwim/HowSwim.html Ichthyology] Florida Museum of Natural History. Retrieved 22 November 2012. Many reef fish, such as butterflyfish, damselfish and angelfish, have evolved bodies which are deep and laterally compressed like a pancake, and will fit into fissures in rocks. Their pelvic and pectoral fins are designed differently, so they act together with the flattened body to optimise maneuverability. Some fishes, such as puffer fish, filefish and trunkfish, rely on pectoral fins for swimming and hardly use tail fins at all.\n\nEvolution of fins\n\nThere is an old theory, which has been often disregarded in science textbooks, \"that fins and (later) limbs evolved from the gills of an extinct vertebrate\". Gaps in the fossil record had not allowed a definitive conclusion. In 2009, researchers from the University of Chicago found evidence that the \"genetic architecture of gills, fins and limbs is the same\", and that \"the skeleton of any appendage off the body of an animal is probably patterned by the developmental genetic program that we have traced back to formation of gills in sharks\".[http://www.sciencedaily.com/releases/2009/03/090323212021.htm Evolution Of Fins And Limbs Linked With That Of Gills] ScienceDaily. 25 March 2009.[http://www.uctv.tv/shows/Wings-Legs-and-Fins-How-Do-New-Organs-Arise-in-Evolution-16421 Wings, legs, and fins: How do new organs arise in evolution?] Neil Shubin, University of Chicago.\n\nFish are the ancestors of all mammals, reptiles, birds and amphibians.[http://www.sciencedaily.com/releases/2008/09/080922090843.htm \"Primordial Fish Had Rudimentary Fingers\"] ScienceDaily, 23 September 2008. In particular, terrestrial tetrapods (four-legged animals) evolved from fish and made their first forays onto land 400 million years ago. They used paired pectoral and pelvic fins for locomotion. The pectoral fins developed into forelegs (arms in the case of humans) and the pelvic fins developed into hind legs.Hall, Brian K (2007) [https://books.google.com/books?idZ0YWn5F9sWkC&printsec\nfrontcover&dqFins+into+Limbs&hl\nen&saX&ei\nNUmxUMOENYmOmQXGuYDgCw&ved0CDAQ6AEwAA Fins into Limbs: Evolution, Development, and Transformation] University of Chicago Press. . Much of the genetic machinery that builds a walking limb in a tetrapod is already present in the swimming fin of a fish.Shubin, Neil (2009) [https://books.google.com/books?id\nc008kdNwR1cC&dq%22Your+Inner+Fish%22&hl\nen&saX&ei\n1qOyUJCqOorsmAX5xYCwDg&ved0CDAQ6AEwAA Your inner fish: A journey into the 3.5 billion year history of the human body] Vintage Books. . [http://www.uctv.tv/search-details.aspx?showID\n16412 UCTV interview]Clack, Jennifer A (2012) [https://books.google.com/books?id6Ztrhm8uLQ0C&printsec\nfrontcover&dq%22Gaining+Ground:+the+Origin+and+Early+Evolution+of+Tetrapods%22&hl\nen&saX&ei\nyjK4UNjVDo7KmQWU3IC4Bw&ved0CDAQ6AEwAA#v\nonepage&q%22Gaining%20Ground%3A%20the%20Origin%20and%20Early%20Evolution%20of%20Tetrapods%22&f\nfalse \"From fins to feet\"] Chapter 6, pages 187–260, in: Gaining Ground, Second Edition: The Origin and Evolution of Tetrapods, Indiana University Press. .\n\nIn 2011, researchers at Monash University in Australia used primitive but still living lungfish \"to trace the evolution of pelvic fin muscles to find out how the load-bearing hind limbs of the tetrapods evolved.\"[http://www.sciencedaily.com/releases/2011/10/111004180106.htm Lungfish Provides Insight to Life On Land: 'Humans Are Just Modified Fish'] ScienceDaily, 7 October 2011.Cole NJ, Hall TE, Don EK, Berger S, Boisvert CA, et al. (2011) [http://www.plosbiology.org/article/info%3Adoi%2F10.1371%2Fjournal.pbio.1001168 \"Development and Evolution of the Muscles of the Pelvic Fin\"] PLoS Biology, 9 (10): e1001168. doi:10.1371/journal.pbio.1001168  Further research at the University of Chicago found bottom-walking lungfishes had already evolved characteristics of the walking gaits of terrestrial tetrapods.[http://www.sciencedaily.com/releases/2011/12/111212153117.htm A small step for lungfish, a big step for the evolution of walking\"] ScienceDaily, 13 December 2011.\n\nIn a classic example of convergent evolution, the pectoral limbs of pterosaurs, birds and bats further evolved along independent paths into flying wings. Even with flying wings there are many similarities with walking legs, and core aspects of the genetic blueprint of the pectoral fin have been retained.[http://www.ucmp.berkeley.edu/vertebrates/flight/converge.html Vertebrate flight: The three solutions] University of California. Updated 29 September 2005.\n\nAbout 200 million years ago the first mammals appeared. A group of these mammals started returning to the sea about 52 million years ago, thus completing a circle. These are the cetaceans (whales, dolphins and porpoises). Recent DNA analysis suggests that cetaceans evolved from within the even-toed ungulates, and that they share  a common ancestor with the hippopotamus.  About 23 million years ago another group of bearlike land mammals started returning to the sea. These were the seals. What had become walking limbs in  cetaceans and seals evolved further, independently in a reverse form of convergent evolution, back to new forms of swimming fins. The forelimbs became flippers and the hind limbs became a tail terminating in two fins, called a fluke in the case of cetaceans.Felts WJL [https://books.google.com/books?hlen&lr\n&idKyxELyTDlsQC&oi\nfnd&pgPA255&dq\nwhale+evolution+flipper+fluke&ots8fRempAy-l&sig\n0Iy5y8y6E_1xzfjm9Cx_NNva560#vonepage&q\nwhale%20evolution%20flipper%20fluke&f=false \"Some functional and structural characteristics of cetacean flippers and flukes\"] Pages 255–275 in: Norris KS (ed.) Whales, Dolphins, and Porpoises, University of California Press. Fish tails are usually vertical and move from side to side. Cetacean flukes are horizontal and move up and down, because cetacean spines bend the same way as in other mammals.[http://evolution.berkeley.edu/evolibrary/article/evograms_03 The evolution of whales] University of California Museum. Retrieved 27 November 2012.\n\nIchthyosaurs are ancient reptiles that resembled dolphins. They first appeared about 245 million years ago and disappeared about 90 million years ago.\n\n\"This sea-going reptile with terrestrial ancestors converged so strongly on fishes that it actually evolved a dorsal fin and tail in just the right place and with just the right hydrological design. These structures are all the more remarkable because they evolved from nothing — the ancestral terrestrial reptile had no hump on its back or blade on its tail to serve as a precursor.\"Martill D.M. (1993). \"Soupy Substrates: A Medium for the Exceptional Preservation of Ichthyosaurs of the Posidonia Shale (Lower Jurassic) of Germany\". Kaupia - Darmstädter Beiträge zur Naturgeschichte, 2 : 77-97.\nThe biologist Stephen Jay Gould said the ichthyosaur was his favorite example of convergent evolution.Gould, Stephen Jay (1993 [https://books.google.com/books?id_kOoVw0SIhUC&dq\n&redir_esc=y \"Bent Out of Shape\"] in Eight Little Piggies: Reflections in Natural History. Norton, 179–94. .\n\nRobotic fins\n\nThe use of fins for the propulsion of aquatic animals can be remarkably effective. It has been calculated that some fish can achieve a propulsive efficiency greater than 90%. Fish can accelerate and maneuver much more effectively than boats or submarine, and produce less water disturbance and noise. This has led to biomimetic studies of underwater robots which attempt to emulate the locomotion of aquatic animals. An example is the Robot Tuna built by the [http://fibo.kmutt.ac.th/ Institute of Field Robotics], to analyze and mathematically model thunniform motion. In 2005, the Sea Life London Aquarium displayed three robotic fish created by the computer science department at the University of Essex. The fish were designed to be autonomous, swimming around and avoiding obstacles like real fish. Their creator claimed that he was trying to combine \"the speed of tuna, acceleration of a pike, and the navigating skills of an eel.\"\n\nThe AquaPenguin, developed by Festo of Germany, copies the streamlined shape and propulsion by front flippers of penguins.[http://www.controlengeurope.com/article/24663/For-Festo--Nature-Shows-the-Way.aspx For Festo, Nature Shows the Way] Control Engineering, 18 May 2009.[http://www.gizmag.com/bionic-penguins-fly-through-water--and-air/11545/ Bionic penguins fly through water... and air] Gizmag, 27 April 2009. Festo also developed AquaRay,[http://www.technovelgy.com/ct/science-fiction-news.asp?newsnum=2249 Festo AquaRay Robot] Technovelgy, 20 April 2009. AquaJelly[http://www.engineeringtv.com/video/The-AquaJelly-Robotic-Jellyfish The AquaJelly Robotic Jellyfish from Festo] Engineering TV, 12 July 2012. and AiraCuda,[http://www.theengineer.co.uk/in-depth/analysis/lightweight-robots-festos-flying-circus/1009421.article Lightweight robots: Festo's flying circus] The Engineer, 18 July 2011. respectively emulating the locomotion of manta rays, jellyfish and barracuda.\n\nIn 2004, Hugh Herr at MIT prototyped a biomechatronic robotic fish with a living actuator by surgically transplanting muscles from frog legs to the robot and then making the robot swim by pulsing the muscle fibers with electricity.[http://science.howstuffworks.com/biomechatronics4.htm How Biomechatronics Works] HowStuffWorks/ Retrieved 22 November 2012.\n\nRobotic fish offer some research advantages, such as the ability to examine an individual part of a fish design in isolation from the rest of the fish. However, this risks oversimplifying the biology so key aspects of the animal design are overlooked. Robotic fish also allow researchers to vary a single parameter, such as flexibility or  a specific motion control. Researchers can directly measure forces, which is not easy to do in live fish. \"Robotic devices also facilitate three-dimensional kinematic studies and correlated hydrodynamic analyses, as the location of the locomotor surface can be known accurately. And, individual components of a natural motion (such as outstroke vs. instroke of a flapping appendage) can be programmed separately, which is certainly difficult to achieve when working with a live animal.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11036" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A fin is a thin component or appendage attached to a larger body or structure. Fins typically function as foils that produce lift or thrust, or provide the ability to steer or stabilize motion while traveling in water, air, or other fluid media. Fins are also used to increase surface areas for heat transfer purposes, or simply as ornamentation.[http://oxforddictionaries.com/definition/american_english/fin Fin] Oxford dictionary. Retrieved 24 November 2012.[http://www.merriam-webster.com/dictionary/fin Fin] Merriam-Webster dictionary. Retrieved 24 November 2012.\n\nFins first evolved on fish as a means of locomotion. Fish fins are used to generate thrust and control the subsequent motion. Fish, and other aquatic animals such as cetaceans, actively propel and steer themselves with pectoral and tail fins. As they swim, they use other fins, such as dorsal and anal fins, to achieve stability and refine their maneuvering.Helfman G, Collette BB, Facey DE and Bowen BW (2009) [http://limnology.wisc.edu/courses/zoo510/2009/helfman_ch8.pdf \"Functional morphology of locomotion and feeding\"]  Chapter 8, pp. 101–116. In:The Diversity of Fishes: Biology, John Wiley & Sons. .\n\nGenerating thrust\n\nFoil shaped fins generate thrust when moved, the lift of the fin sets water or air in motion and pushes the fin in the opposite direction. Aquatic animals get significant thrust by moving fins back and forth in water. Often the tail fin is used, but some aquatic animals generate thrust from pectoral fins. Fins can also generate thrust if they are rotated in air or water. Turbines and propellers (and sometimes fans and pumps) use a number of rotating fins, also called foils, wings, arms or blades.  Propellers use the fins to translate torquing force to lateral thrust, thus propelling an aircraft or ship.Carlton, John (2007) [https://books.google.com/books?id\nQrLNCxzynU4C Marine Propellers and Propulsion] Pages 1–28, Butterworth-Heinemann. . Turbines work in reverse, using the lift of the blades to generate torque and power from moving gases or water.Soares, Claire (2008) [https://books.google.com/books?id=rTPZp1YCQBkC Gas Turbines: A Handbook of Air, Land, and Sea Applications] Pages 1–23, Butterworth-Heinemann. .\n\nCavitation can be a problem with high power applications, resulting in damage to propellers or turbines, as well as noise and loss of power.Franc, Jean-Pierre and Michel, Jean-Marie (2004) [https://books.google.com/books?id\nQJOQYa_oo24C&printsecfrontcover&dq\nCavitation&hlen&sa\nX&ei_p6sUNbrHpHimAWjr4CwBg&ved\n0CDYQ6AEwAg#vonepage&q\nCavitation&ffalse Fundamentals of Cavitation] Springer. . Cavitation occurs when negative pressure causes bubbles (cavities) to form in a liquid, which then promptly and violently collapse. It can cause significant damage and wear. Cavitation damage can also occur to the tail fins of powerful swimming marine animals, such as dolphins and tuna. Cavitation is more likely to occur near the surface of the ocean, where the ambient water pressure is relatively low. Even if they have the power to swim faster, dolphins may have to restrict their speed because collapsing cavitation bubbles on their tail are too painful. Cavitation also slows tuna, but for a different reason. Unlike dolphins, these fish do not feel the bubbles, because they have bony fins without nerve endings. Nevertheless, they cannot swim faster because the cavitation bubbles create a vapor film around their fins that limits their speed. Lesions have been found on tuna that are consistent with cavitation damage.\n\nScombrid fishes (tuna, mackerel and bonito) are particularly high-performance swimmers. Along the margin at the rear of their bodies is a line of small rayless, non-retractable fins, known as finlets. There has been much speculation about the function  of these finlets. Research done in 2000 and 2001 by Nauen and Lauder indicated that \"the finlets have a hydrodynamic effect on local flow during steady swimming\" and that \"the most posterior finlet is oriented to redirect flow into the developing tail vortex, which may increase thrust produced by the tail of swimming mackerel\".\n\nFish use multiple fins, so it is possible that a given fin can have a hydrodynamic interaction with another fin. In particular, the fins immediately upstream of the caudal (tail) fin may be proximate fins that can directly affect the flow dynamics at the caudal fin. In 2011, researchers using volumetric imaging techniques were able to generate \"the first instantaneous three-dimensional views of wake structures as they are produced by freely swimming fishes\". They found that \"continuous tail beats resulted in the formation of a linked chain of vortex rings\" and that \"the dorsal and anal fin wakes are rapidly entrained by the caudal fin wake, approximately within the timeframe of a subsequent tail beat\".\n\nControlling motion\n\nOnce motion has been established, the motion itself can be controlled with the use of other fins. Boats control direction (yaw) with fin-like rudders, and roll with stabilizer fins and keel fins.Perez, Tristan (2005) [https://books.google.com/books?idlxlO3d2srAIC&printsec\nfrontcover&dqfin&hl\nen&saX&ei\nAw-mUOGTPNGUiQeG4oCoDw&ved0CLQCEOgBMFI4ZA#v\nonepage&qfin&f\nfalse Ship Motion Control: Course Keeping and Roll Stabilisation Using Rudder and Fins] Springer. . Airplanes achieve similar results with small specialised fins that change the shape of their wings and tail fins.McClamroch, N Harris (2011) [https://books.google.com/books?id\nDKK7m8o7_ZkC&pgPA58&dq\nyaw+roll+pitch+airplane&hlen&sa\nX&eiJcitUJWoHe3ImAWEzYHoAw&ved\n0CIsBEOgBMB4#vonepage&q\nyaw%20roll%20pitch&f=false Steady Aircraft Flight and Performance]  Page 2–3, Princeton University Press. .\n\nStabilising fins are used as fletching on arrows and some darts,Vujic, Dragan (2007) [https://books.google.com/books?idYsiPb2nmYdEC&pg\nPA17&dqarrow+fletch+vane&hl\nen&saX&ei\nzs2tUK_QHIHsmAXl94DwCw&ved0CEwQ6AEwCQ#v\nonepage&qarrow%20fletch%20vane&f\nfalse Bow Hunting Whitetails] Page 17, iUniverse. . and at the rear of some bombs, missiles, rockets, and self-propelled torpedoes.Hobbs, Marvin (2010) [https://books.google.com/books?ida0TxaTq2rQIC&pg\nSA1-PA24&dqstabilising|stabilizing|stabilize|stabilise+fin+rocket&hl\nen&saX&ei\nH9atUOK4DpHPmAXyzoCgAg&ved0CDoQ6AEwAQ#v\nonepage&qstabilising|stabilizing|stabilize|stabilise%20fin%20rocket&f\nfalse Basics of Missile Guidance and Space Techniques]  Page 24, Wildside Press LLC. .Compon-Hall, Richard (2004) [https://books.google.com/books?idEEJ6YaMGkV4C&pg\nPA50&dq%22stabilising+fin%22|%22stabilizing+fin%22+torpedo&hl\nen&saX&ei\nsNitUOXXLoSfmQXUxIDQAQ&ved0CDYQ6AEwAA#v\nonepage&q%22stabilising%20fin%22|%22stabilizing%20fin%22%20torpedo&f\nfalseSubmarines at War 1939-1945]  Page 50, Periscope Publishing. .  These are typically planar and shaped like small wings, although grid fins are sometimes used.Khalid M, Sun Y and Xu H (1998) [ftp://ftp.rta.nato.int/Pubfulltext/RTO/MP/.../RTO-MP-005/$MP-005-12.pdf \"Computation of Flows Past Grid Fin Missiles\"] AVT Symposium on Missile Aerodynamics, Sorrento, Italy. Static fins have also been used for one satellite, GOCE.\n\nRegulating temperature\n\nEngineering fins are also used as heat transfer fins to regulate temperature in heat sinks or fin radiators.Siegel R and Howell JR (2002) [https://books.google.com/books?idO389yQ0-fecC&pg\nPA1&dqThermal+Radiation+Heat+Transfer&hl\nen&saX&ei\nDeGtUPi0MqzJmQWpkYDACQ&ved=0CDAQ6AEwAA Thermal Radiation Heat Transfer] Chapter 9: Radiation combined with conduction and convection at boundaries, pp.335–370. Taylor & Francis. .[http://www.britannica.com/EBchecked/topic/207095/fin Fin: Function in aircraft engines] Encyclopædia Britannica. Retrieved 22 November 2012.\n\nOrnamentation and other uses\n\nIn biology, fins can have an adaptive significance as sexual ornaments. During courtship, the female cichlid, Pelvicachromis taeniatus, displays a large and visually arresting purple pelvic fin. \"The researchers found that males clearly preferred females with a larger pelvic fin and that pelvic fins grew in a more disproportionate way than other fins on female fish.\"[http://www.sciencedaily.com/releases/2010/10/101007210540.htm Female fish flaunt fins to attract a mate] ScienceDaily. 8 October 2010.Baldauf SA, TCM Bakker, F Herder, H Kullmann and T Thünken (2010) [http://www.biomedcentral.com/1471-2148/10/301/ \"Male mate choice scales female ornament allometry in a cichlid fish\"] BMC Evolutionary Biologr//, 10 :301. \n\nReshaping human feet with swim fins, rather like the tail fin of a fish, add thrust and efficiency to the kicks of a swimmer or underwater diver Surfboard fins provide surfers with means to maneuver and control their boards. Contemporary surfboards often have a centre fin and two cambered side fins.Brandner PA and Walker GJ (2004) [http://eprints.utas.edu.au/6613/1/AFMC_Brandnerand_Walker_2004_F1.pdf Hydrodynamic Performance of a Surfboard Fin] 15th Australasian Fluid Mechanics Conference, Sydney.\n\nThe bodies of reef fishes are often shaped differently from open water fishes. Open water fishes are usually built for speed, streamlined like torpedoes to minimise friction as they move through the water. Reef fish operate in the relatively confined spaces and complex underwater landscapes of coral reefs. For this manoeuvrability is more important than straight line speed, so coral reef fish have developed bodies which optimize their ability to dart and change direction. They outwit predators by dodging into fissures in the reef or playing hide and seek around coral heads.Alevizon WS (1994) [https://www.amazon.com/dp/1559920777 \"Pisces Guide to Caribbean Reef Ecology\"]  Gulf Publishing Company  The pectoral and pelvic fins of many reef fish, such as butterflyfish, damselfish and angelfish, have evolved so they can act as brakes and allow complex maneuvers.[http://www.flmnh.ufl.edu/fish/education/HowSwim/HowSwim.html Ichthyology] Florida Museum of Natural History. Retrieved 22 November 2012. Many reef fish, such as butterflyfish, damselfish and angelfish, have evolved bodies which are deep and laterally compressed like a pancake, and will fit into fissures in rocks. Their pelvic and pectoral fins are designed differently, so they act together with the flattened body to optimise maneuverability. Some fishes, such as puffer fish, filefish and trunkfish, rely on pectoral fins for swimming and hardly use tail fins at all.\n\nEvolution of fins\n\nThere is an old theory, which has been often disregarded in science textbooks, \"that fins and (later) limbs evolved from the gills of an extinct vertebrate\". Gaps in the fossil record had not allowed a definitive conclusion. In 2009, researchers from the University of Chicago found evidence that the \"genetic architecture of gills, fins and limbs is the same\", and that \"the skeleton of any appendage off the body of an animal is probably patterned by the developmental genetic program that we have traced back to formation of gills in sharks\".[http://www.sciencedaily.com/releases/2009/03/090323212021.htm Evolution Of Fins And Limbs Linked With That Of Gills] ScienceDaily. 25 March 2009.[http://www.uctv.tv/shows/Wings-Legs-and-Fins-How-Do-New-Organs-Arise-in-Evolution-16421 Wings, legs, and fins: How do new organs arise in evolution?] Neil Shubin, University of Chicago.\n\nFish are the ancestors of all mammals, reptiles, birds and amphibians.[http://www.sciencedaily.com/releases/2008/09/080922090843.htm \"Primordial Fish Had Rudimentary Fingers\"] ScienceDaily, 23 September 2008. In particular, terrestrial tetrapods (four-legged animals) evolved from fish and made their first forays onto land 400 million years ago. They used paired pectoral and pelvic fins for locomotion. The pectoral fins developed into forelegs (arms in the case of humans) and the pelvic fins developed into hind legs.Hall, Brian K (2007) [https://books.google.com/books?idZ0YWn5F9sWkC&printsec\nfrontcover&dqFins+into+Limbs&hl\nen&saX&ei\nNUmxUMOENYmOmQXGuYDgCw&ved0CDAQ6AEwAA Fins into Limbs: Evolution, Development, and Transformation] University of Chicago Press. . Much of the genetic machinery that builds a walking limb in a tetrapod is already present in the swimming fin of a fish.Shubin, Neil (2009) [https://books.google.com/books?id\nc008kdNwR1cC&dq%22Your+Inner+Fish%22&hl\nen&saX&ei\n1qOyUJCqOorsmAX5xYCwDg&ved0CDAQ6AEwAA Your inner fish: A journey into the 3.5 billion year history of the human body] Vintage Books. . [http://www.uctv.tv/search-details.aspx?showID\n16412 UCTV interview]Clack, Jennifer A (2012) [https://books.google.com/books?id6Ztrhm8uLQ0C&printsec\nfrontcover&dq%22Gaining+Ground:+the+Origin+and+Early+Evolution+of+Tetrapods%22&hl\nen&saX&ei\nyjK4UNjVDo7KmQWU3IC4Bw&ved0CDAQ6AEwAA#v\nonepage&q%22Gaining%20Ground%3A%20the%20Origin%20and%20Early%20Evolution%20of%20Tetrapods%22&f\nfalse \"From fins to feet\"] Chapter 6, pages 187–260, in: Gaining Ground, Second Edition: The Origin and Evolution of Tetrapods, Indiana University Press. .\n\nIn 2011, researchers at Monash University in Australia used primitive but still living lungfish \"to trace the evolution of pelvic fin muscles to find out how the load-bearing hind limbs of the tetrapods evolved.\"[http://www.sciencedaily.com/releases/2011/10/111004180106.htm Lungfish Provides Insight to Life On Land: 'Humans Are Just Modified Fish'] ScienceDaily, 7 October 2011.Cole NJ, Hall TE, Don EK, Berger S, Boisvert CA, et al. (2011) [http://www.plosbiology.org/article/info%3Adoi%2F10.1371%2Fjournal.pbio.1001168 \"Development and Evolution of the Muscles of the Pelvic Fin\"] PLoS Biology, 9 (10): e1001168. doi:10.1371/journal.pbio.1001168  Further research at the University of Chicago found bottom-walking lungfishes had already evolved characteristics of the walking gaits of terrestrial tetrapods.[http://www.sciencedaily.com/releases/2011/12/111212153117.htm A small step for lungfish, a big step for the evolution of walking\"] ScienceDaily, 13 December 2011.\n\nIn a classic example of convergent evolution, the pectoral limbs of pterosaurs, birds and bats further evolved along independent paths into flying wings. Even with flying wings there are many similarities with walking legs, and core aspects of the genetic blueprint of the pectoral fin have been retained.[http://www.ucmp.berkeley.edu/vertebrates/flight/converge.html Vertebrate flight: The three solutions] University of California. Updated 29 September 2005.\n\nAbout 200 million years ago the first mammals appeared. A group of these mammals started returning to the sea about 52 million years ago, thus completing a circle. These are the cetaceans (whales, dolphins and porpoises). Recent DNA analysis suggests that cetaceans evolved from within the even-toed ungulates, and that they share  a common ancestor with the hippopotamus.  About 23 million years ago another group of bearlike land mammals started returning to the sea. These were the seals. What had become walking limbs in  cetaceans and seals evolved further, independently in a reverse form of convergent evolution, back to new forms of swimming fins. The forelimbs became flippers and the hind limbs became a tail terminating in two fins, called a fluke in the case of cetaceans.Felts WJL [https://books.google.com/books?hlen&lr\n&idKyxELyTDlsQC&oi\nfnd&pgPA255&dq\nwhale+evolution+flipper+fluke&ots8fRempAy-l&sig\n0Iy5y8y6E_1xzfjm9Cx_NNva560#vonepage&q\nwhale%20evolution%20flipper%20fluke&f=false \"Some functional and structural characteristics of cetacean flippers and flukes\"] Pages 255–275 in: Norris KS (ed.) Whales, Dolphins, and Porpoises, University of California Press. Fish tails are usually vertical and move from side to side. Cetacean flukes are horizontal and move up and down, because cetacean spines bend the same way as in other mammals.[http://evolution.berkeley.edu/evolibrary/article/evograms_03 The evolution of whales] University of California Museum. Retrieved 27 November 2012.\n\nIchthyosaurs are ancient reptiles that resembled dolphins. They first appeared about 245 million years ago and disappeared about 90 million years ago.\n\n\"This sea-going reptile with terrestrial ancestors converged so strongly on fishes that it actually evolved a dorsal fin and tail in just the right place and with just the right hydrological design. These structures are all the more remarkable because they evolved from nothing — the ancestral terrestrial reptile had no hump on its back or blade on its tail to serve as a precursor.\"Martill D.M. (1993). \"Soupy Substrates: A Medium for the Exceptional Preservation of Ichthyosaurs of the Posidonia Shale (Lower Jurassic) of Germany\". Kaupia - Darmstädter Beiträge zur Naturgeschichte, 2 : 77-97.\nThe biologist Stephen Jay Gould said the ichthyosaur was his favorite example of convergent evolution.Gould, Stephen Jay (1993 [https://books.google.com/books?id_kOoVw0SIhUC&dq\n&redir_esc=y \"Bent Out of Shape\"] in Eight Little Piggies: Reflections in Natural History. Norton, 179–94. .\n\nRobotic fins\n\nThe use of fins for the propulsion of aquatic animals can be remarkably effective. It has been calculated that some fish can achieve a propulsive efficiency greater than 90%. Fish can accelerate and maneuver much more effectively than boats or submarine, and produce less water disturbance and noise. This has led to biomimetic studies of underwater robots which attempt to emulate the locomotion of aquatic animals. An example is the Robot Tuna built by the [http://fibo.kmutt.ac.th/ Institute of Field Robotics], to analyze and mathematically model thunniform motion. In 2005, the Sea Life London Aquarium displayed three robotic fish created by the computer science department at the University of Essex. The fish were designed to be autonomous, swimming around and avoiding obstacles like real fish. Their creator claimed that he was trying to combine \"the speed of tuna, acceleration of a pike, and the navigating skills of an eel.\"\n\nThe AquaPenguin, developed by Festo of Germany, copies the streamlined shape and propulsion by front flippers of penguins.[http://www.controlengeurope.com/article/24663/For-Festo--Nature-Shows-the-Way.aspx For Festo, Nature Shows the Way] Control Engineering, 18 May 2009.[http://www.gizmag.com/bionic-penguins-fly-through-water--and-air/11545/ Bionic penguins fly through water... and air] Gizmag, 27 April 2009. Festo also developed AquaRay,[http://www.technovelgy.com/ct/science-fiction-news.asp?newsnum=2249 Festo AquaRay Robot] Technovelgy, 20 April 2009. AquaJelly[http://www.engineeringtv.com/video/The-AquaJelly-Robotic-Jellyfish The AquaJelly Robotic Jellyfish from Festo] Engineering TV, 12 July 2012. and AiraCuda,[http://www.theengineer.co.uk/in-depth/analysis/lightweight-robots-festos-flying-circus/1009421.article Lightweight robots: Festo's flying circus] The Engineer, 18 July 2011. respectively emulating the locomotion of manta rays, jellyfish and barracuda.\n\nIn 2004, Hugh Herr at MIT prototyped a biomechatronic robotic fish with a living actuator by surgically transplanting muscles from frog legs to the robot and then making the robot swim by pulsing the muscle fibers with electricity.[http://science.howstuffworks.com/biomechatronics4.htm How Biomechatronics Works] HowStuffWorks/ Retrieved 22 November 2012.\n\nRobotic fish offer some research advantages, such as the ability to examine an individual part of a fish design in isolation from the rest of the fish. However, this risks oversimplifying the biology so key aspects of the animal design are overlooked. Robotic fish also allow researchers to vary a single parameter, such as flexibility or  a specific motion control. Researchers can directly measure forces, which is not easy to do in live fish. \"Robotic devices also facilitate three-dimensional kinematic studies and correlated hydrodynamic analyses, as the location of the locomotor surface can be known accurately. And, individual components of a natural motion (such as outstroke vs. instroke of a flapping appendage) can be programmed separately, which is certainly difficult to achieve when working with a live animal.\". Fin. http://en.wikipedia.org/?curid=11036."
  }
}
