{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14892",
  "eid" : "18805500-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778550352,
  "textBody" : "An intelligence quotient (IQ) is a total score derived from several standardized tests designed to assess human intelligence. The abbreviation \"IQ\" was coined by the psychologist William Stern for the German term Intelligenzquotient, his term for a scoring method for intelligence tests at University of Breslau he advocated in a 1912 book. Historically, IQ is a score obtained by dividing a person’s mental age score, obtained by administering an intelligence test, by the person’s chronological age, both expressed in terms of years and months. The resulting fraction is multiplied by 100 to obtain the IQ score. When current IQ tests were developed, the median raw score of the norming sample is defined as IQ 100 and scores each standard deviation (SD) up or down are defined as 15 IQ points greater or less, although this was not always so historically. By this definition, approximately two-thirds of the population scores are between IQ 85 and IQ 115. About 2.5 percent of the population scores above 130, and 2.5 percent below 70.\n\nScores from intelligence tests are estimates of intelligence.  Unlike, for example, distance and mass, a concrete measure of intelligence cannot be achieved given the abstract nature of the concept of \"intelligence\". IQ scores have been shown to be associated with such factors as morbidity and mortality, parental social status, and, to a substantial degree, biological parental IQ. While the heritability of IQ has been investigated for nearly a century, there is still debate about the significance of heritability estimates and the mechanisms of inheritance.\n\nIQ scores are used for educational placement, assessment of intellectual disability, and evaluating job applicants. Even when students improve their scores on standardized tests, they do not always improve their cognitive abilities, such as memory, attention and speed. In research contexts they have been studied as predictors of job performance, and income. They are also used to study distributions of psychometric intelligence in populations and the correlations between it and other variables. Raw scores on IQ tests for many populations have been rising at an average rate that scales to three IQ points per decade since the early 20th century, a phenomenon called the Flynn effect. Investigation of different patterns of increases in subtest scores can also inform current research on human intelligence.\n\nHistory\n\nPrecursors to IQ testing\n\nHistorically, even before IQ tests were devised,  there were attempts to classify people into intelligence categories by observing their behavior in daily life. Those other forms of behavioral observation are still important for validating classifications based primarily on IQ test scores. Both intelligence classification by observation of behavior outside the testing room and classification by IQ testing depend on the definition of \"intelligence\" used in a particular case and on the reliability and error of estimation in the classification procedure.\n\nThe English statistician Francis Galton made the first attempt at creating a standardized test for rating a person's intelligence. A pioneer of psychometrics and the application of statistical methods to the study of human diversity and the study of inheritance of human traits, he believed that intelligence was largely a product of heredity (by which he did not mean genes, although he did develop several pre-Mendelian theories of particulate inheritance). He hypothesized that there should exist a correlation between intelligence and other observable traits such as reflexes, muscle grip, and head size. He set up the first mental testing centre in the world in 1882 and he published \"Inquiries into Human Faculty and Its Development\" in 1883, in which he set out his theories. After gathering data on a variety of physical variables, he was unable to show any such correlation, and he eventually abandoned this research.\n\nFrench psychologist Alfred Binet, together with Victor Henri and Théodore Simon had more success in 1905, when they published the Binet-Simon test, which focused on verbal abilities. It was intended to identify mental retardation in school children, but in specific contradistinction to claims made by psychiatrists that these children were \"sick\" (not \"slow\") and should therefore be removed from school and cared for in asylums. (This is an open access article, made freely available by Elsevier.) The score on the Binet-Simon scale would reveal the child's mental age. For example, a six-year-old child who passed all the tasks usually passed by six-year-olds—but nothing beyond—would have a mental age that matched his chronological age, 6.0. (Fancher, 1985). Binet thought that intelligence was multifaceted, but came under the control of practical judgment.\n\nIn Binet's view, there were limitations with the scale and he stressed what he saw as the remarkable diversity of intelligence and the subsequent need to study it using qualitative, as opposed to quantitative, measures (White, 2000). American psychologist Henry H. Goddard published a translation of it in 1910. American psychologist Lewis Terman at Stanford University revised the Binet-Simon scale, which resulted in the Stanford-Binet Intelligence Scales (1916). It became the most popular test in the United States for decades.\n\nGeneral factor (g)\n\nThe many different kinds of IQ tests include a wide variety of item content. Some test items are visual, while many are verbal. Test items vary from being based on abstract-reasoning problems to concentrating on arithmetic, vocabulary, or general knowledge.\n\nThe British psychologist Charles Spearman in 1904 made the first formal factor analysis of correlations between the tests. He observed that children's school grades across seemingly unrelated school subjects were positively correlated, and reasoned that these correlations reflected the influence of an underlying general mental ability that entered into performance on all kinds of mental tests. He suggested that all mental performance could be conceptualized in terms of a single general ability factor and a large number of narrow task-specific ability factors. Spearman named it g for \"general factor\" and labeled the specific factors or abilities for specific tasks s. In any collection of test items that make up an IQ test, the score that best measures g is the composite score that has the highest correlations with all the item scores. Typically, the \"g-loaded\" composite score of an IQ test battery appears to involve a common strength in abstract reasoning across the test's item content. Therefore, Spearman and others have regarded g as closely related to the essence of human intelligence.\n\nSpearman's argument proposing a general factor of human intelligence is still accepted in principle by many psychometricians. Today's factor models of intelligence typically represent cognitive abilities as a three-level hierarchy, where there are a large number of narrow factors at the bottom of the hierarchy, a handful of broad, more general factors at the intermediate level, and at the apex a single factor, referred to as the g factor, which represents the variance common to all cognitive tasks. However, this view is not universally accepted; other factor analyses of the data, with different results, are possible. Some psychometricians regard g as a statistical artifact.\n\nUnited States military selection in World War I\n\nDuring World War I, a way was needed to evaluate and assign Army recruits to appropriate tasks. This led to the development of several mental tests by Robert Yerkes, who worked with major hereditarians of American psychometrics—including Terman, Goddard—to write the test. The testing generated controversy and much public debate in the United States. Nonverbal or \"performance\" tests were developed for those who could not speak English or were suspected of malingering. Based on Goddard’s translation of the Binet-Simon test, the tests had an impact in screening men for officer training:\n\n“...the tests did have a strong impact in some areas, particularly in screening men for officer training. At the start of the war, the army and national guard maintained nine thousand officers. By the end, two hundred thousand officers presided, and two- thirds of them had started their careers in training camps where the tests were applied. In some camps, no man scoring below C could be considered for officer training.“\n\n1.75 million men were tested in total, making the results the first mass produced written tests of intelligence, though considered dubious and non-usable, for reasons including high variability of test implementation throughout different camps and questions testing for familiarity with American culture rather than intelligence. After the war, positive publicity promoted by army psychologists helped to make psychology a respected field. Subsequently, there was an increase in jobs and funding in psychology in the United States. Group intelligence tests were developed and became widely used in schools and industry.\n\nThe results of these tests, which at the time reaffirmed contemporary racism and nationalism, are considered controversial and dubious, having rested on certain contested assumptions: that intelligence was heritable, innate, and could be relegated to a single number, the tests were enacted systematically, and test questions actually tested for innate intelligence rather than subsuming environmental factors. The tests also allowed for the bolstering of jingoist narratives in the context of increased immigration, which may have influenced the passing of the Immigration Restriction Act of 1924.\n\nL.L. Thurstone argued for a model of intelligence that included seven unrelated factors (verbal comprehension, word fluency, number facility, spatial visualization, associative memory, perceptual speed, reasoning, and induction). While not widely used, Thurstone's model influenced later theories.\n\nDavid Wechsler produced the first version of his test in 1939. It gradually became more popular and overtook the Stanford-Binet in the 1960s. It has been revised several times, as is common for IQ tests, to incorporate new research.  One explanation is that psychologists and educators wanted more information than the single score from the Binet. Wechsler's ten or more subtests provided this. Another is that the Stanford-Binet test reflected mostly verbal abilities, while the Wechsler test also reflected nonverbal abilities. The Stanford-Binet has also been revised several times and is now similar to the Wechsler in several aspects, but the Wechsler continues to be the most popular test in the United States.\n\nIQ testing and the Eugenics movement in the United States \n\nEugenics refers to the principles of heredity used to improve the human race. Francis Galton first used the term in the late 1800’s. The eugenics movement was popular in the US in the 1920s and 1930s. \n\nGoddard was a eugenicist. In 1908, he published his own version, “The Binet and Simon Test of Intellectual Capacity”, and cordially promoted the test. He quickly extended the use of the scale to the public schools (1913), to immigration (Ellis Island, 1914) and to a court of law (1914).\n\nDifferent from Galton, who promoted eugenics through selective breeding for positive traits, Goddard went with the US eugenics movement to eliminate ’undesirable’ traits. Goddard coined the word “feeblemindedness”  to refer to people who did not perform well in the test thus were intellectually inferior. He argued that “feeblemindedness” is caused by heredity, thus feebleminded people should be avoided to give birth, either by institutional isolation or sterilization surgeries.  At first, the sterilization targets the disabled and was extended to the poor people. Goddard’s intelligence test was endorsed by the eugenicists to push for laws for forced sterilization. Different states adopted the sterilization laws at different pace. These laws forced over 64,000 people to go through sterilization in the United States.\n\nNoteworthily, California’s sterilization program was so effective that the Nazi turned to the government for advice to eliminate the birth of the “unfit”. The US eugenics movement lost its momentum in 1940s and was halted by the horrors of the Nazi Germany.\n\nCattell–Horn–Carroll theory\n\nRaymond Cattell (1941) proposed two types of cognitive abilities in a revision of Spearman's concept of general intelligence. Fluid intelligence (Gf) was hypothesized as the ability to solve novel problems by using reasoning, and crystallized intelligence (Gc) was hypothesized as a knowledge-based ability that was very dependent on education and experience. In addition, fluid intelligence was hypothesized to decline with age, while crystallized intelligence was largely resistant to the effects of aging. The theory was almost forgotten, but was revived by his student John L. Horn (1966) who later argued Gf and Gc were only two among several factors, and who eventually identified nine or ten broad abilities. The theory continued to be called Gf-Gc theory.\n\nJohn B. Carroll (1993), after a comprehensive reanalysis of earlier data, proposed the three stratum theory, which is a hierarchical model with three levels. The bottom stratum consists of narrow abilities that are highly specialized (e.g., induction, spelling ability). The second stratum consists of broad abilities. Carroll identified eight second-stratum abilities. Carroll accepted Spearman's concept of general intelligence, for the most part, as a representation of the uppermost, third stratum.\n\nIn 1999, a merging of the Gf-Gc theory of Cattell and Horn with Carroll's Three-Stratum theory has led to the Cattell–Horn–Carroll theory (CHC Theory). It has greatly influenced many of the current broad IQ tests.\n\nIn CHC theory, a hierarchy of factors is used; g is at the top. Under it are ten broad abilities that in turn are subdivided into seventy narrow abilities. The broad abilities are:\n* Fluid intelligence (Gf) includes the broad ability to reason, form concepts, and solve problems using unfamiliar information or novel procedures.\n* Crystallized intelligence (Gc) includes the breadth and depth of a person's acquired knowledge, the ability to communicate one's knowledge, and the ability to reason using previously learned experiences or procedures.\n* Quantitative reasoning (Gq) is the ability to comprehend quantitative concepts and relationships and to manipulate numerical symbols.\n* Reading and writing ability (Grw) includes basic reading and writing skills.\n* Short-term memory (Gsm) is the ability to apprehend and hold information in immediate awareness, and then use it within a few seconds.\n* Long-term storage and retrieval (Glr) is the ability to store information and fluently retrieve it later in the process of thinking.\n* Visual processing (Gv) is the ability to perceive, analyze, synthesize, and think with visual patterns, including the ability to store and recall visual representations.\n* Auditory processing (Ga) is the ability to analyze, synthesize, and discriminate auditory stimuli, including the ability to process and discriminate speech sounds that may be presented under distorted conditions.\n* Processing speed (Gs) is the ability to perform automatic cognitive tasks, particularly when measured under pressure to maintain focused attention.\n* Decision/reaction time/speed (Gt) reflects the immediacy with which an individual can react to stimuli or a task (typically measured in seconds or fractions of seconds; it is not to be confused with Gs, which typically is measured in intervals of 2–3 minutes). See Mental chronometry.\nModern tests do not necessarily measure all of these broad abilities. For example, Gq and Grw may be seen as measures of school achievement and not IQ. Gt may be difficult to measure without special equipment. g was earlier often subdivided into only Gf and Gc, which were thought to correspond to the nonverbal or performance subtests and verbal subtests in earlier versions of the popular Wechsler IQ test. More recent research has shown the situation to be more complex. Modern comprehensive IQ tests do not stop at reporting a single IQ score. Although they still give an overall score, they now also give scores for many of these more restricted abilities, identifying particular strengths and weaknesses of an individual.\n\nOther theories\n\nJ.P. Guilford's Structure of Intellect (1967) model used three dimensions which when combined yielded a total of 120 types of intelligence. It was popular in the 1970s and early 1980s, but faded owing to both practical problems and theoretical criticisms.\n\nAlexander Luria's earlier work on neuropsychological processes led to the PASS theory (1997). It argued that only looking at one general factor was inadequate for researchers and clinicians who worked with learning disabilities, attention disorders, intellectual disability, and interventions for such disabilities. The PASS model covers four kinds of processes (planning process, attention/arousal process, simultaneous processing, and successive processing). The planning processes involve decision making, problem solving, and performing activities and requires goal setting and self-monitoring.\n\nThe attention/arousal process involves selectively attending to a particular stimulus, ignoring distractions, and maintaining vigilance. Simultaneous processing involves the integration of stimuli into a group and requires the observation of relationships. Successive processing involves the integration of stimuli into serial order. The planning and attention/arousal components comes from structures located in the frontal lobe, and the simultaneous and successive processes come from structures located in the posterior region of the cortex. It has influenced some recent IQ tests, and been seen as a complement to the Cattell-Horn-Carroll theory described above.\n\nCurrent tests\n\nThere are a variety of individually administered IQ tests in use in the English-speaking world. The most commonly used individual IQ test series is the Wechsler Adult Intelligence Scale for adults and the Wechsler Intelligence Scale for Children for school-age test-takers. Other commonly used individual IQ tests (some of which do not label their standard scores as \"IQ\" scores) include the current versions of the Stanford-Binet, Woodcock-Johnson Tests of Cognitive Abilities, the Kaufman Assessment Battery for Children, the Cognitive Assessment System, and the Differential Ability Scales.\n\nIQ tests that measure intelligence also include:\n# Stanford–Binet Intelligence Scales\n# Woodcock–Johnson Tests of Cognitive Abilities\n# Raven's Progressive Matrices\n# Wechsler Adult Intelligence Scale\n# Cattell Culture Fair III\n# Reynolds Intellectual Assessment Scales\n# Thurstone's Primary Mental Abilities \n# Differential Ability Scales\n# Kaufman Brief Intelligence Test\n# Multidimensional Aptitude Battery II\n# Das–Naglieri cognitive assessment system\n\nIQ scales are ordinally scaled. While one standard deviation is 15 points, and two SDs are 30 points, and so on, this does not imply that mental ability is linearly related to IQ, such that IQ 50 means half the cognitive ability of IQ 100. In particular, IQ points are not percentage points.\n\nOn a related note, this fixed standard deviation means that the proportion of the population who have IQs in a particular range is theoretically fixed, and current Wechsler tests only give Full Scale IQs between 40 and 160. This should be borne in mind when considering reports of people with much higher IQs.\n\nTest bias or differential item functioning \n\nDifferential item functioning (DIF), sometimes referred to as measurement bias, is a phenomenon when participants from different groups (ex gender, race, disability) with the same latent abilities give different answers to specific questions on the same IQ test.Embretson, S. E., Reise, S. P. (2000).Item Response Theory for Psychologists. New Jersey: Lawrence Erlbaum. DIF analysis measures such specific items on a test alongside measuring participants latent abilities on other similar questions. A consistent different group response to a specific question among similar type of questions can indicate an effect of DIF. It does not count as differential item functioning if both groups have equally valid chance of giving different responses to the same questions. Such bias can be a result of culture, educational level and other factors that are independent of group traits. DIF is only considered if test-takers from different groups with the same underlying latent ability level have a different chance of giving specific responses. Such questions are usually removed in order to make the test equally fair for both groups. Common techniques for analyzing DIF are item response theory (IRT) based methods, Mantel-Haenszel, and logistic regression.\n\nReliability and validity\n\nPsychometricians generally regard IQ tests as having high statistical reliability. A high reliability implies that – although test-takers may have varying scores when taking the same test on differing occasions, and although they may have varying scores when taking different IQ tests at the same age – the scores generally agree with one another and across time. Like all statistical quantities, any particular estimate of IQ has an associated standard error that measures uncertainty about the estimate. For modern tests, the standard error of measurement is about three points. Clinical psychologists generally regard IQ scores as having sufficient statistical validity for many clinical purposes. In a survey of 661 randomly sampled psychologists and educational researchers, published in 1988, Mark Snyderman and Stanley Rothman reported a general consensus supporting the validity of IQ testing. \"On the whole, scholars with any expertise in the area of intelligence and intelligence testing (defined very broadly) share a common view of the most important components of intelligence, and are convinced that it can be measured with some degree of accuracy.\" Almost all respondents picked out abstract reasoning, ability to solve problems and ability to acquire knowledge as the most important elements.\n\nFlynn effect\n\nSince the early 20th century, raw scores on IQ tests have increased in most parts of the world. When a new version of an IQ test is normed, the standard scoring is set so performance at the population median results in a score of IQ 100. The phenomenon of rising raw score performance means if test-takers are scored by a constant standard scoring rule, IQ test scores have been rising at an average rate of around three IQ points per decade. This phenomenon was named the Flynn effect in the book The Bell Curve after James R. Flynn, the author who did the most to bring this phenomenon to the attention of psychologists.\n\nResearchers have been exploring the issue of whether the Flynn effect is equally strong on performance of all kinds of IQ test items, whether the effect may have ended in some developed nations, whether there are social subgroup differences in the effect, and what possible causes of the effect might be. A 2011 textbook, IQ and Human Intelligence, by N. J. Mackintosh, noted the Flynn effect demolishes the fears that IQ would be decreased. He also asks whether it represents a real increase in intelligence beyond IQ scores.Mackintosh, N. (2011). IQ and human intelligence. Oxford University Press. p.25-27 A 2011 psychology textbook, lead authored by Harvard Psychologist Professor Daniel Schacter, noted that humans' inherited intelligence could be going down while acquired intelligence goes up.\n\nAge\n\nIQ can change to some degree over the course of childhood. However, in one longitudinal study, the mean IQ scores of tests at ages 17 and 18 were correlated at r0.86 with the mean scores of tests at ages five, six, and seven and at r\n0.96 with the mean scores of tests at ages 11, 12, and 13.\n\nFor decades, practitioners' handbooks and textbooks on IQ testing have reported IQ declines with age after the beginning of adulthood. However, later researchers pointed out this phenomenon is related to the Flynn effect and is in part a cohort effect rather than a true aging effect. A variety of studies of IQ and aging have been conducted since the norming of the first Wechsler Intelligence Scale drew attention to IQ differences in different age groups of adults. Current consensus is that fluid intelligence generally declines with age after early adulthood, while crystallized intelligence remains intact. Both cohort effects (the birth year of the test-takers) and practice effects (test-takers taking the same form of IQ test more than once) must be controlled to gain accurate data. It is unclear whether any lifestyle intervention can preserve fluid intelligence into older ages.\n\nThe exact peak age of fluid intelligence or crystallized intelligence remains elusive. Cross-sectional studies usually show that especially fluid intelligence peaks at a relatively young age (often in the early adulthood) while longitudinal data mostly show that intelligence is stable until the mid adulthood or later. Subsequently, intelligence seems to decline slowly.\n\nGenetics and environment\n\nEnvironmental and genetic factors play a role in determining IQ. Their relative importance has been the subject of much research and debate.\n\nHeritability\n\nHeritability is defined as the proportion of variance in a trait which is attributable to genotype within a defined population in a specific environment. A number of points must be considered when interpreting heritability.International Journal of Epidemiology, Volume 35, Issue 3, June 2006. See reprint of Leowontin's 1974 article \"The analysis of variance and the analysis of causes\" and 2006 commentaries: http://ije.oxfordjournals.org/content/35/3.toc  Heritability, as a term, applies to populations, and in populations there are variations in traits between individuals.  Heritability measures how much of that variation is caused by genetics.  The value of heritability can change if the impact of environment (or of genes) in the population is substantially altered. A high heritability of a trait does not mean environmental effects, such as learning, are not involved. Since heritability increases during childhood and adolescence, one should be cautious drawing conclusions regarding the role of genetics and environment from studies where the participants are not followed until they are adults.\n\nThe general figure for the heritability of IQ, according to an authoritative American Psychological Association report, is 0.45 for children, and rises to around 0.75 for late adolescents and adults.  Heritability measures in infancy are as low as 0.2, around 0.4 in middle childhood, and as high as 0.9 in adulthood. One proposed explanation is that people with different genes tend to reinforce the effects of those genes, for example by seeking out different environments.\n\nShared family environment\n\nFamily members have aspects of environments in common (for example, characteristics of the home). This shared family environment accounts for 0.25–0.35 of the variation in IQ in childhood. By late adolescence, it is quite low (zero in some studies). The effect for several other psychological traits is similar. These studies have not looked at the effects of extreme environments, such as in abusive families.\n\nNon-shared family environment and environment outside the family\n\nAlthough parents treat their children differently, such differential treatment explains only a small amount of nonshared environmental influence. One suggestion is that children react differently to the same environment because of different genes. More likely influences may be the impact of peers and other experiences outside the family.\n\nIndividual genes\n\nA very large proportion of the over 17,000 human genes are thought to have an effect on the development and functionality of the brain. While a number of individual genes have been reported to be associated with IQ, none have a strong effect. Deary and colleagues (2009) reported that no finding of a strong single gene effect on IQ has been replicated. Recent findings of gene associations with normally varying intelligence differences in adults continue to show weak effects for any one gene; likewise in children., but see Weiss, Volkmar: Das IQ-Gen - verleugnet seit 2015: Eine bahnbrechende Entdeckung und ihre Feinde. Ares Verlag, Graz 2017, .\n\nGene-environment interaction\n\nDavid Rowe reported an interaction of genetic effects with socioeconomic status, such that the heritability was high in high-SES families, but much lower in low-SES families. In the US, this has been replicated in infants, children, adolescents, and adults. Outside the US, studies show no link between heritability and SES. Some effects may even reverse sign outside the US.\n\nDickens and Flynn (2001) have argued that genes for high IQ initiate an environment-shaping feedback cycle, with genetic effects causing bright children to seek out more stimulating environments that then further increase their IQ. In Dickens' model, environment effects are modeled as decaying over time. In this model, the Flynn effect can be explained by an increase in environmental stimulation independent of it being sought out by individuals. The authors suggest that programs aiming to increase IQ would be most likely to produce long-term IQ gains if they enduringly raised children's drive to seek out cognitively demanding experiences.\n\nInterventions\n\nIn general, educational interventions, as those described below, have shown short-term effects on IQ, but long-term follow-up is often missing. For example, in the US very large intervention programs such as the Head Start Program have not produced lasting gains in IQ scores. More intensive, but much smaller projects such as the Abecedarian Project have reported lasting effects, often on socioeconomic status variables, rather than IQ.\n\nRecent studies have shown that training in using one's working memory may increase IQ. A study on young adults published in April 2008 by a team from the Universities of Michigan and Bern supports the possibility of the transfer of fluid intelligence from specifically designed working memory training. Further research will be needed to determine nature, extent and duration of the proposed transfer. Among other questions, it remains to be seen whether the results extend to other kinds of fluid intelligence tests than the matrix test used in the study, and if so, whether, after training, fluid intelligence measures retain their correlation with educational and occupational achievement or if the value of fluid intelligence for predicting performance on other tasks changes. It is also unclear whether the training is durable of extended periods of time.\n\nMusic\n\nMusical training in childhood has been found to correlate with higher than average IQ. It is popularly thought that listening to classical music raises IQ. However, multiple attempted replications (e.g.) have shown that this is at best a short-term effect (lasting no longer than 10 to 15 minutes), and is not related to IQ-increase.\n\nBrain anatomy\n\nSeveral neurophysiological factors have been correlated with intelligence in humans, including the ratio of brain weight to body weight and the size, shape, and activity level of different parts of the brain. Specific features that may affect IQ include the size and shape of the frontal lobes, the amount of blood and chemical activity in the frontal lobes, the total amount of gray matter in the brain, the overall thickness of the cortex, and the glucose metabolic rate.\n\nHealth\n\nHealth is important in understanding differences in IQ test scores and other measures of cognitive ability. Several factors can lead to significant cognitive impairment, particularly if they occur during pregnancy and childhood when the brain is growing and the blood–brain barrier is less effective. Such impairment may sometimes be permanent, sometimes be partially or wholly compensated for by later growth. \n\nSince about 2010, researchers such as Eppig, Hassel, and MacKenzie have found a very close and consistent link between IQ scores and infectious diseases, especially in the infant and preschool populations and the mothers of these children.Eppig. Christopher. Scientific American.\"Why is average IQ higher in some places?\" 2011. They have postulated that fighting infectious diseases strains the child's metabolism and prevents full brain development. Hassel postulated that it is by far the most important factor in determining population IQ. However, they also found that subsequent factors such as good nutrition and regular quality schooling can offset early negative effects to some extent.\n\nDeveloped nations have implemented several health policies regarding nutrients and toxins known to influence cognitive function. These include laws requiring fortification of certain food products and laws establishing safe levels of pollutants (e.g. lead, mercury, and organochlorides).  Improvements in nutrition, and in public policy in general, have been implicated in worldwide IQ increases. \n\nCognitive epidemiology is a field of research that examines the associations between intelligence test scores and health. Researchers in the field argue that intelligence measured at an early age is an important predictor of later health and mortality differences.\n\nSocial correlations\n\nSchool performance\n\nThe American Psychological Association's report \"Intelligence: Knowns and Unknowns\" states that wherever it has been studied, children with high scores on tests of intelligence tend to learn more of what is taught in school than their lower-scoring peers. The correlation between IQ scores and grades is about .50. This means that the explained variance is 25%. Achieving good grades depends on many factors other than IQ, such as \"persistence, interest in school, and willingness to study\" (p. 81).\n\nIt has been found that the correlation of IQ scores with school performance depends on the IQ measurement used. For undergraduate students, the Verbal IQ as measured by WAIS-R has been found to correlate significantly (0.53) with the grade point average (GPA) of the last 60 hours. In contrast, Performance IQ correlation with the same GPA was only 0.22 in the same study.\n\nSome measures of educational aptitude correlate highly with IQ tests for instance, Frey and Detterman (2004) reported a correlation of 0.82 between g (general intelligence factor) and SAT scores; another research found a correlation of 0.81 between g and GCSE scores, with the explained variance ranging \"from 58.6% in Mathematics and 48% in English to 18.1% in Art and Design\".\n\nJob performance\n\nAccording to Schmidt and Hunter, \"for hiring employees without previous experience in the job the most valid predictor of future performance is general mental ability.\" The validity of IQ as a predictor of job performance is above zero for all work studied to date, but varies with the type of job and across different studies, ranging from 0.2 to 0.6. The correlations were higher when the unreliability of measurement methods was controlled for. While IQ is more strongly correlated with reasoning and less so with motor function, IQ-test scores predict performance ratings in all occupations. That said, for highly qualified activities (research, management) low IQ scores are more likely to be a barrier to adequate performance, whereas for minimally-skilled activities, athletic strength (manual strength, speed, stamina, and coordination) are more likely to influence performance. The prevailing view among academics is that it is largely through the quicker acquisition of job-relevant knowledge that higher IQ mediates job performance. This view has been challenged by Byington & Felps (2010), who argued that \"the current applications of IQ-reflective tests allow individuals with high IQ scores to receive greater access to developmental resources, enabling them to acquire additional capabilities over time, and ultimately perform their jobs better.\"\n\nIn establishing a causal direction to the link between IQ and work performance, longitudinal studies by Watkins and others suggest that IQ exerts a causal influence on future academic achievement, whereas academic achievement does not substantially influence future IQ scores. Treena Eileen Rohde and Lee Anne Thompson write that general cognitive ability, but not specific ability scores, predict academic achievement, with the exception that processing speed and spatial ability predict performance on the SAT math beyond the effect of general cognitive ability.\n\nThe US military has minimum enlistment standards at about the IQ 85 level. There have been two experiments with lowering this to 80 but in both cases these men could not master soldiering well enough to justify their costs.Gottfredson, L. S. (2006). Social consequences of group differences in cognitive ability (Consequencias sociais das diferencas de grupo em habilidade cognitiva). In C. E. Flores-Mendoza & R. Colom (Eds.), Introducau a psicologia das diferencas individuais (pp. 433-456). Porto Allegre, Brazil: ArtMed Publishers.\n\nIncome\n\nWhile it has been suggested that \"in economic terms it appears that the IQ score measures something with decreasing marginal value. It is important to have enough of it, but having lots and lots does not buy you that much\",\nDetterman and Daniel, 1989.\n large-scale longitudinal studies indicate an increase in IQ translates into an increase in performance at all levels of IQ: i.e. ability and job performance are monotonically linked at all IQ levels. Charles Murray, coauthor of The Bell Curve, found that IQ has a substantial effect on income independent of family background.\n\nThe link from IQ to wealth is much less strong than that from IQ to job performance. Some studies indicate that IQ is unrelated to net worth.\n\nThe American Psychological Association's 1995 report Intelligence: Knowns and Unknowns stated that IQ scores accounted for (explained variance) about a quarter of the social status variance and one-sixth of the income variance. Statistical controls for parental SES eliminate about a quarter of this predictive power. Psychometric intelligence appears as only one of a great many factors that influence social outcomes.\n\nIn a meta-analysis, Strenze (2006) reviewed much of the literature and estimated the correlation between IQ and income to be about 0.23.\n\nSome studies claim that IQ only accounts for (explains) a sixth of the variation in income because many studies are based on young adults, many of whom have not yet reached their peak earning capacity, or even their education.  On pg 568 of The g Factor, Arthur Jensen claims that although the correlation between IQ and income averages a moderate 0.4 (one sixth or 16% of the variance), the relationship increases with age, and peaks at middle age when people have reached their maximum career potential. In the book, A Question of Intelligence, Daniel Seligman cites an IQ income correlation of 0.5 (25% of the variance).\n\nA 2002 study further examined the impact of non-IQ factors on income and concluded that an individual's location, inherited wealth, race, and schooling are more important as factors in determining income than IQ.\n\nCrime\n\nThe American Psychological Association's 1995 report Intelligence: Knowns and Unknowns stated that the correlation between IQ and crime was −0.2. It was −0.19 between IQ scores and number of juvenile offenses in a large Danish sample; with social class controlled, the correlation dropped to −0.17. A correlation of 0.20 means that the explained variance is 4%. The causal links between psychometric ability and social outcomes may be indirect. Children with poor scholastic performance may feel alienated. Consequently, they may be more likely to engage in delinquent behavior, compared to other children who do well.\n\nIn his book The g Factor (1998), Arthur Jensen cited data which showed that, regardless of race, people with IQs between 70 and 90 have higher crime rates than people with IQs below or above this range, with the peak range being between 80 and 90.\n\nThe 2009 Handbook of Crime Correlates stated that reviews have found that around eight IQ points, or 0.5 SD, separate criminals from the general population, especially for persistent serious offenders. It has been suggested that this simply reflects that \"only dumb ones get caught\" but there is similarly a negative relation between IQ and self-reported offending. That children with conduct disorder have lower IQ than their peers \"strongly argues\" for the theory.Handbook of Crime Correlates; Lee Ellis, Kevin M. Beaver, John Wright; 2009; Academic Press\n\nA study of the relationship between US county-level IQ and US county-level crime rates found that higher average IQs were associated with lower levels of property crime, burglary, larceny rate, motor vehicle theft, violent crime, robbery, and aggravated assault. These results were not \"confounded by a measure of concentrated disadvantage that captures the effects of race, poverty, and other social disadvantages of the county.\"\n\nThe American Psychological Association's 1995 report Intelligence: Knowns and Unknowns stated that the correlations for most \"negative outcome\" variables are typically smaller than 0.20, which means that the explained variance is less than 4%.\n\nTambs et al. found that occupational status, educational attainment, and IQ are individually heritable; and further found that \"genetic variance influencing educational attainment ... contributed approximately one-fourth of the genetic variance for occupational status and nearly half the genetic variance for IQ.\" In a sample of U.S. siblings, Rowe et al.Rowe, D. C., W. J. Vesterdal, and J. L. Rodgers, \"The Bell Curve Revisited: How Genes and Shared Environment Mediate IQ-SES Associations,\" University of Arizona, 1997 report that the inequality in education and income was predominantly due to genes, with shared environmental factors playing a subordinate role.\n\nHealth and mortality\n\nMultiple studies conducted in Scotland have found that higher IQs in early life are associated with lower mortality and morbidity rates later in life.\n\nOther accomplishments\n\nThere is considerable variation within and overlap among these categories. People with high IQs are found at all levels of education and occupational categories. The biggest difference occurs for low IQs with only an occasional college graduate or professional scoring below 90.\n\nGroup-IQ or the collective intelligence factor c \n\nWith operationalization and methodology derived from the general intelligence factor g, a new scientific understanding of collective intelligence, defined as a group’s general ability to perform a wide range of tasks, aims to explain intelligent behavior of groups. Goal is to detect and explain a general intelligence factor c for groups, parallel to the g factor for individuals. As g is highly interrelated with the concept of IQ, this measurement of collective intelligence can be interpreted as intelligence quotient for groups (Group-IQ) even though the score is not a quotient per se. Current evidence suggests that this Group-IQ is only moderately correlated with group members' IQs but with other correlates such as group members' Theory of Mind.\n\nGroup differences\n\nAmong the most controversial issues related to the study of intelligence is the observation that intelligence measures such as IQ scores vary between ethnic and racial groups and sexes. While there is little scholarly debate about the existence of some of these differences, their causes remain highly controversial both within academia and in the public sphere.\n\nSex\n\nMost IQ tests are constructed so that there are no overall score differences between females and males. Popular IQ batteries such as the WAIS and the WISC-R are also constructed in order to eliminate sex differences.Jensen, A. (1998) The g Factor: The Science of Mental Ability (p. 531) In a paper presented at the International Society for Intelligence Research in 2002, it was pointed out that because test constructors and the United States' Educational Testing Service (which developed the US SAT test) often eliminate items showing marked sex differences in order to reduce the perception of bias, the \"true sex\" difference is masked. Items like the Mental Rotations Test and reaction time tests, which show a male advantage in IQ, are often removed.Jackson, D. N. (2002, December 5–7). Evaluating g in the SAT: Implications for the sex differences and interpretations of verbal and quantitative aptitude. Paper presented at the International Society for Intelligence Research, Nashville, TN.\" Meta-analysis focusing on gender differences in math performance found nearly identical performance for boys and girls, and the subject of mathematical intelligence and gender has been controversial.\n\nRace and intelligence\n\nRace and intelligence in United States of America\n\nThe 1996 Task Force investigation on Intelligence sponsored by the American Psychological Association concluded that there are significant variations in IQ across races. The problem of determining the causes underlying this variation relates to the question of the contributions of \"nature and nurture\" to IQ. Psychologists such as Alan S. Kaufman and Nathan Brody and statisticians such as Bernie Devlin argue that there are insufficient data to conclude that this is because of genetic influences. A review article published in 2012 by leading scholars on human intelligence concluded, after reviewing the prior research literature, that group differences in IQ are best understood as environmental in origin.\n\nIn considering disparities between test results of different ethnic groups, one might investigate the effects of stereotype threat (a situational predicament in which a person feels at risk of confirming negative stereotypes about the group(s) he identifies with), as well as culture and acculturation.  This phenomenon has been criticized as a fiction of publication bias.Flore, Paulette C.; Wicherts, Jelte M. (2014). \"Does stereotype threat influence performance of girls in stereotyped domains? A meta-analysis\". Journal of School Psychology. 53 (1): 25–44. doi:10.1016/j.jsp.2014.10.002. ISSN 0022-4405. .\n\nPublic policy\n\nIn the United States, certain public policies and laws regarding military service, education, public benefits, capital punishment, and employment incorporate an individual's IQ into their decisions. However, in the case of Griggs v. Duke Power Co. in 1971, for the purpose of minimizing employment practices that disparately impacted racial minorities, the U.S. Supreme Court banned the use of IQ tests in employment, except when linked to job performance via a job analysis. Internationally, certain public policies, such as improving nutrition and prohibiting neurotoxins, have as one of their goals raising, or preventing a decline in, intelligence.\n\nA diagnosis of intellectual disability is in part based on the results of IQ testing. Borderline intellectual functioning is a categorization where a person has below average cognitive ability (an IQ of 71–85), but the deficit is not as severe as intellectual disability (70 or below).\n\nIn the United Kingdom, the eleven plus exam which incorporated an intelligence test has been used from 1945 to decide, at eleven years of age, which type of school a child should go to. They have been much less used since the widespread introduction of comprehensive schools.\n\nCriticism and views\n\nRelationship to intelligence\n\nIQ is the most thoroughly researched means of measuring intelligence, and by far the most widely used in practical settings. However, while IQ strives to measure some concepts of intelligence, it may fail to serve as an accurate measure of broader definitions of intelligence. IQ tests examine some areas of intelligence, while neglecting to account for other areas, such as creativity and social intelligence.\n\nCritics such as Keith Stanovich do not dispute the reliability of IQ test scores or their capacity to predict some kinds of achievement, but argue that basing a concept of intelligence on IQ test scores alone neglects other important aspects of mental ability.Brooks, David (September 14, 2007). [https://select.nytimes.com/2007/09/14/opinion/14brooks.html \"The Waning of I.Q.\"]. The New York Times.\n\nCriticism of IQ\n\nSome scientists dispute IQ entirely. In The Mismeasure of Man (1996), paleontologist Stephen Jay Gould criticized IQ tests and argued that they were used for scientific racism. He argued that g was a mathematical artifact and criticized:\n\nArthur Jensen responded:\n\nJensen also argued that even if g were replaced by a model with several intelligences this would change the situation less than expected. He argues that all tests of cognitive ability would continue to be highly correlated with one another and there would still be a black-white gap on cognitive tests. Hans Eysenck responded to Gould by stating that no psychologist had said that intelligence was an area located in the brain.Eysenck, Hans Intelligence: A New Look Transaction Publishers page 74 Eysenck also argued IQ tests were not racist, pointing out that Northeast Asians and Jews both scored higher than non-Jewish Europeans on IQ tests, and this would not please European racists.Eysenck, Hans Intelligence: A New Look Transaction Publishers page 10\n\nPsychologist Peter Schönemann persistently criticized IQ, calling it \"the IQ myth\". He argued that g is a flawed theory and that the high heritability estimates of IQ are based on false assumptions.Psychometrics of Intelligence.  K. Kemp-Leonard (ed.)  Encyclopedia of Social Measurement, 3, 193-201: [http://www2.psych.purdue.edu/~phs/pdf/89.pdf] Robert Sternberg, another significant critic of g as the main measure of human cognitive abilities, argued that reducing the concept of intelligence to the measure of g does not fully account for the different skills and knowledge types that produce success in human society.Sternberg, Robert J., and Richard K. Wagner. \"The g-ocentric view of intelligence and job performance is wrong.\" Current directions in psychological science (1993): 1-5.\n\nTest bias\n\nThe American Psychological Association's report Intelligence: Knowns and Unknowns stated that in the United States IQ tests as predictors of social achievement are not biased against African Americans since they predict future performance, such as school achievement, similarly to the way they predict future performance for Caucasians. While agreeing that IQ tests predict performance equally well for all racial groups, Nicholas Mackintosh also points out that there may still be a bias inherent in IQ testing if the education system is also systematically biased against African Americans, in which case educational performance may in fact also be an underestimation of African American children's cognitive abilities. Earl Hunt points out that while this may be the case that would not be a bias of the test, but of society.\n\nHowever, IQ tests may well be biased when used in other situations. A 2005 study stated that \"differential validity in prediction suggests that the WAIS-R test may contain cultural influences that reduce the validity of the WAIS-R as a measure of cognitive ability for Mexican American students,\" indicating a weaker positive correlation relative to sampled white students.  Other recent studies have questioned the culture-fairness of IQ tests when used in South Africa. Standard intelligence tests, such as the Stanford-Binet, are often inappropriate for autistic children; the alternative of using developmental or adaptive skills measures are relatively poor measures of intelligence in autistic children, and may have resulted in incorrect claims that a majority of autistic children are mentally retarded.\n\nOutdated methodology\n\nAccording to a 2006 article by the National Center for Biotechnology Information, contemporary psychological research often did not reflect substantial recent developments in psychometrics and \"bears an uncanny resemblance to the psychometric state of the art as it existed in the 1950s.\"\n\n\"Intelligence: Knowns and Unknowns\"\n\nIn response to the controversy surrounding The Bell Curve, the American Psychological Association's Board of Scientific Affairs established a task force in 1995 to write a report on the state of intelligence research which could be used by all sides as a basis for discussion, \"Intelligence: Knowns and Unknowns\". The full text of the report is available through several websites.\n\nIn this paper, the representatives of the association regret that IQ-related works are frequently written with a view to their political consequences:  \"research findings were often assessed not so much on their merits or their scientific standing as on their supposed political implications\".\n\nThe task force concluded that IQ scores do have high predictive validity for individual differences in school achievement. They confirm the predictive validity of IQ for adult occupational status, even when variables such as education and family background have been statistically controlled. They stated that individual differences in intelligence are substantially influenced by both genetics and environment.\n\nThe report stated that a number of biological factors, including malnutrition, exposure to toxic substances, and various prenatal and perinatal stressors, result in lowered psychometric intelligence under at least some conditions. The task force agrees that large differences do exist between the average IQ scores of blacks and whites, saying:\n\nThe APA journal that published the statement, American Psychologist, subsequently published eleven critical responses in January 1997, several of them arguing that the report failed to examine adequately the evidence for partly genetic explanations.\n\nDynamic assessment\n\nAn alternative to standard IQ tests originated in the writings of psychologist Lev Vygotsky (1896-1934) from his last two years of work. The notion of the zone of proximal development that he introduced in 1933, roughly a year before his death, served as the banner for his proposal to diagnose development as the level of actual development that can be measured by the child's independent problem solving and, at the same time, the level of proximal, or potential development that is measured in the situation of moderately assisted problem solving by the child.Vygotsky, L.S. (19332-34/1997). [http://www.marxists.org/archive/vygotsky/works/1934/problem-age.htm The Problem of Age]. in The Collected Works of L. S. Vygotsky, Volume 5, 1998, pp. 187-205 The maximum level of complexity and difficulty of the problem that the child is capable to solve under some guidance indicates the level of potential development. Then, the difference between the higher level of potential and the lower level of actual development indicates the zone of proximal development. Combination of the two indexesthe level of actual and the zone of the proximal developmentaccording to Vygotsky, provides a significantly more informative indicator of psychological development than the assessment of the level of actual development alone.Chaiklin, S. (2003). \"The Zone of Proximal Development in Vygotsky's analysis of learning and instruction.\" In Kozulin, A., Gindis, B., Ageyev, V. & Miller, S. (Eds.) Vygotsky's educational theory and practice in cultural context. 39-64. Cambridge: Cambridge UniversityZaretskii, V.K. (2009). The Zone of Proximal Development What Vygotsky Did Not Have Time to Write. Journal of Russian and East European Psychology, vol. 47, no. 6, November–December 2009, pp. 70–93\n\nThe ideas on the zone of development were later developed in a number of psychological and educational theories and practices. Most notably, they were developed under the banner of dynamic assessment that focuses on the testing of learning and developmental potentialSternberg, R.J. & Grigorenko, E.L. (2002). Dynamic testing: The nature and measurement of learning potential. Cambridge (UK): University of CambridgeHaywood, C.H. & Lidz, C.S. (2007). Dynamic assessment in practice: Clinical and educational applications. New York: Cambridge University Press (for instance, in the work of Reuven Feuerstein and his associates,Feuerstein, R., Feuerstein, S., Falik, L & Rand, Y. (1979; 2002). Dynamic assessments of cognitive modifiability. ICELP Press, Jerusalem: Israel who has criticized standard IQ testing for its putative assumption or acceptance of \"fixed and immutable\" characteristics of intelligence or cognitive functioning). Grounded in developmental theories of Vygotsky and Feuerstein, who maintained that human beings are not static entities but are always in states of transition and transactional relationships with the world, dynamic assessment received also considerable support in the recent revisions of cognitive developmental theory by Joseph Campione, Ann Brown, and John D. Bransford and in theories of multiple intelligences by Howard Gardner and Robert Sternberg.Dodge, Kenneth A. Foreword, xiii-xv. In Haywood, H. Carl & Lidz, Carol Schneider. Dynamic Assessment in Practice: Clinical And Educational Applications. Cambridge University Press, 2006, p.xiii-xiv Still, dynamic assessment has not been implemented in education on a large scale as is up to now, by admission of one of its notable proponents, \"in search of its identity\".Kozulin, A. (2014). Dynamic assessment in search of its identity. In Yasnitsky, A., van der Veer, R., & Ferrari, M. (Eds.). (2014). The Cambridge Handbook of Cultural-Historical Psychology. Cambridge University Press (pp. 126-147)\n\nClassification\n\nIQ classification is the practice by IQ test publishers of designating IQ score ranges as various categories with labels such as \"superior\" or \"average.\" IQ classification was preceded historically by attempts to classify human beings by general ability based on other forms of behavioral observation. Those other forms of behavioral observation are still important for validating classifications based on IQ tests.\n\nHigh IQ societies\n\nThere are social organizations, some international, which limit membership to people who have scores as high as or higher than the 98th percentile (2 standard deviations above the mean) on some IQ test or equivalent. Mensa International is perhaps the best known of these. The largest 99.9th percentile (3 standard deviations above the mean) society is the Triple Nine Society.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Intelligence quotient" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14892" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An intelligence quotient (IQ) is a total score derived from several standardized tests designed to assess human intelligence. The abbreviation \"IQ\" was coined by the psychologist William Stern for the German term Intelligenzquotient, his term for a scoring method for intelligence tests at University of Breslau he advocated in a 1912 book. Historically, IQ is a score obtained by dividing a person’s mental age score, obtained by administering an intelligence test, by the person’s chronological age, both expressed in terms of years and months. The resulting fraction is multiplied by 100 to obtain the IQ score. When current IQ tests were developed, the median raw score of the norming sample is defined as IQ 100 and scores each standard deviation (SD) up or down are defined as 15 IQ points greater or less, although this was not always so historically. By this definition, approximately two-thirds of the population scores are between IQ 85 and IQ 115. About 2.5 percent of the population scores above 130, and 2.5 percent below 70.\n\nScores from intelligence tests are estimates of intelligence.  Unlike, for example, distance and mass, a concrete measure of intelligence cannot be achieved given the abstract nature of the concept of \"intelligence\". IQ scores have been shown to be associated with such factors as morbidity and mortality, parental social status, and, to a substantial degree, biological parental IQ. While the heritability of IQ has been investigated for nearly a century, there is still debate about the significance of heritability estimates and the mechanisms of inheritance.\n\nIQ scores are used for educational placement, assessment of intellectual disability, and evaluating job applicants. Even when students improve their scores on standardized tests, they do not always improve their cognitive abilities, such as memory, attention and speed. In research contexts they have been studied as predictors of job performance, and income. They are also used to study distributions of psychometric intelligence in populations and the correlations between it and other variables. Raw scores on IQ tests for many populations have been rising at an average rate that scales to three IQ points per decade since the early 20th century, a phenomenon called the Flynn effect. Investigation of different patterns of increases in subtest scores can also inform current research on human intelligence.\n\nHistory\n\nPrecursors to IQ testing\n\nHistorically, even before IQ tests were devised,  there were attempts to classify people into intelligence categories by observing their behavior in daily life. Those other forms of behavioral observation are still important for validating classifications based primarily on IQ test scores. Both intelligence classification by observation of behavior outside the testing room and classification by IQ testing depend on the definition of \"intelligence\" used in a particular case and on the reliability and error of estimation in the classification procedure.\n\nThe English statistician Francis Galton made the first attempt at creating a standardized test for rating a person's intelligence. A pioneer of psychometrics and the application of statistical methods to the study of human diversity and the study of inheritance of human traits, he believed that intelligence was largely a product of heredity (by which he did not mean genes, although he did develop several pre-Mendelian theories of particulate inheritance). He hypothesized that there should exist a correlation between intelligence and other observable traits such as reflexes, muscle grip, and head size. He set up the first mental testing centre in the world in 1882 and he published \"Inquiries into Human Faculty and Its Development\" in 1883, in which he set out his theories. After gathering data on a variety of physical variables, he was unable to show any such correlation, and he eventually abandoned this research.\n\nFrench psychologist Alfred Binet, together with Victor Henri and Théodore Simon had more success in 1905, when they published the Binet-Simon test, which focused on verbal abilities. It was intended to identify mental retardation in school children, but in specific contradistinction to claims made by psychiatrists that these children were \"sick\" (not \"slow\") and should therefore be removed from school and cared for in asylums. (This is an open access article, made freely available by Elsevier.) The score on the Binet-Simon scale would reveal the child's mental age. For example, a six-year-old child who passed all the tasks usually passed by six-year-olds—but nothing beyond—would have a mental age that matched his chronological age, 6.0. (Fancher, 1985). Binet thought that intelligence was multifaceted, but came under the control of practical judgment.\n\nIn Binet's view, there were limitations with the scale and he stressed what he saw as the remarkable diversity of intelligence and the subsequent need to study it using qualitative, as opposed to quantitative, measures (White, 2000). American psychologist Henry H. Goddard published a translation of it in 1910. American psychologist Lewis Terman at Stanford University revised the Binet-Simon scale, which resulted in the Stanford-Binet Intelligence Scales (1916). It became the most popular test in the United States for decades.\n\nGeneral factor (g)\n\nThe many different kinds of IQ tests include a wide variety of item content. Some test items are visual, while many are verbal. Test items vary from being based on abstract-reasoning problems to concentrating on arithmetic, vocabulary, or general knowledge.\n\nThe British psychologist Charles Spearman in 1904 made the first formal factor analysis of correlations between the tests. He observed that children's school grades across seemingly unrelated school subjects were positively correlated, and reasoned that these correlations reflected the influence of an underlying general mental ability that entered into performance on all kinds of mental tests. He suggested that all mental performance could be conceptualized in terms of a single general ability factor and a large number of narrow task-specific ability factors. Spearman named it g for \"general factor\" and labeled the specific factors or abilities for specific tasks s. In any collection of test items that make up an IQ test, the score that best measures g is the composite score that has the highest correlations with all the item scores. Typically, the \"g-loaded\" composite score of an IQ test battery appears to involve a common strength in abstract reasoning across the test's item content. Therefore, Spearman and others have regarded g as closely related to the essence of human intelligence.\n\nSpearman's argument proposing a general factor of human intelligence is still accepted in principle by many psychometricians. Today's factor models of intelligence typically represent cognitive abilities as a three-level hierarchy, where there are a large number of narrow factors at the bottom of the hierarchy, a handful of broad, more general factors at the intermediate level, and at the apex a single factor, referred to as the g factor, which represents the variance common to all cognitive tasks. However, this view is not universally accepted; other factor analyses of the data, with different results, are possible. Some psychometricians regard g as a statistical artifact.\n\nUnited States military selection in World War I\n\nDuring World War I, a way was needed to evaluate and assign Army recruits to appropriate tasks. This led to the development of several mental tests by Robert Yerkes, who worked with major hereditarians of American psychometrics—including Terman, Goddard—to write the test. The testing generated controversy and much public debate in the United States. Nonverbal or \"performance\" tests were developed for those who could not speak English or were suspected of malingering. Based on Goddard’s translation of the Binet-Simon test, the tests had an impact in screening men for officer training:\n\n“...the tests did have a strong impact in some areas, particularly in screening men for officer training. At the start of the war, the army and national guard maintained nine thousand officers. By the end, two hundred thousand officers presided, and two- thirds of them had started their careers in training camps where the tests were applied. In some camps, no man scoring below C could be considered for officer training.“\n\n1.75 million men were tested in total, making the results the first mass produced written tests of intelligence, though considered dubious and non-usable, for reasons including high variability of test implementation throughout different camps and questions testing for familiarity with American culture rather than intelligence. After the war, positive publicity promoted by army psychologists helped to make psychology a respected field. Subsequently, there was an increase in jobs and funding in psychology in the United States. Group intelligence tests were developed and became widely used in schools and industry.\n\nThe results of these tests, which at the time reaffirmed contemporary racism and nationalism, are considered controversial and dubious, having rested on certain contested assumptions: that intelligence was heritable, innate, and could be relegated to a single number, the tests were enacted systematically, and test questions actually tested for innate intelligence rather than subsuming environmental factors. The tests also allowed for the bolstering of jingoist narratives in the context of increased immigration, which may have influenced the passing of the Immigration Restriction Act of 1924.\n\nL.L. Thurstone argued for a model of intelligence that included seven unrelated factors (verbal comprehension, word fluency, number facility, spatial visualization, associative memory, perceptual speed, reasoning, and induction). While not widely used, Thurstone's model influenced later theories.\n\nDavid Wechsler produced the first version of his test in 1939. It gradually became more popular and overtook the Stanford-Binet in the 1960s. It has been revised several times, as is common for IQ tests, to incorporate new research.  One explanation is that psychologists and educators wanted more information than the single score from the Binet. Wechsler's ten or more subtests provided this. Another is that the Stanford-Binet test reflected mostly verbal abilities, while the Wechsler test also reflected nonverbal abilities. The Stanford-Binet has also been revised several times and is now similar to the Wechsler in several aspects, but the Wechsler continues to be the most popular test in the United States.\n\nIQ testing and the Eugenics movement in the United States \n\nEugenics refers to the principles of heredity used to improve the human race. Francis Galton first used the term in the late 1800’s. The eugenics movement was popular in the US in the 1920s and 1930s. \n\nGoddard was a eugenicist. In 1908, he published his own version, “The Binet and Simon Test of Intellectual Capacity”, and cordially promoted the test. He quickly extended the use of the scale to the public schools (1913), to immigration (Ellis Island, 1914) and to a court of law (1914).\n\nDifferent from Galton, who promoted eugenics through selective breeding for positive traits, Goddard went with the US eugenics movement to eliminate ’undesirable’ traits. Goddard coined the word “feeblemindedness”  to refer to people who did not perform well in the test thus were intellectually inferior. He argued that “feeblemindedness” is caused by heredity, thus feebleminded people should be avoided to give birth, either by institutional isolation or sterilization surgeries.  At first, the sterilization targets the disabled and was extended to the poor people. Goddard’s intelligence test was endorsed by the eugenicists to push for laws for forced sterilization. Different states adopted the sterilization laws at different pace. These laws forced over 64,000 people to go through sterilization in the United States.\n\nNoteworthily, California’s sterilization program was so effective that the Nazi turned to the government for advice to eliminate the birth of the “unfit”. The US eugenics movement lost its momentum in 1940s and was halted by the horrors of the Nazi Germany.\n\nCattell–Horn–Carroll theory\n\nRaymond Cattell (1941) proposed two types of cognitive abilities in a revision of Spearman's concept of general intelligence. Fluid intelligence (Gf) was hypothesized as the ability to solve novel problems by using reasoning, and crystallized intelligence (Gc) was hypothesized as a knowledge-based ability that was very dependent on education and experience. In addition, fluid intelligence was hypothesized to decline with age, while crystallized intelligence was largely resistant to the effects of aging. The theory was almost forgotten, but was revived by his student John L. Horn (1966) who later argued Gf and Gc were only two among several factors, and who eventually identified nine or ten broad abilities. The theory continued to be called Gf-Gc theory.\n\nJohn B. Carroll (1993), after a comprehensive reanalysis of earlier data, proposed the three stratum theory, which is a hierarchical model with three levels. The bottom stratum consists of narrow abilities that are highly specialized (e.g., induction, spelling ability). The second stratum consists of broad abilities. Carroll identified eight second-stratum abilities. Carroll accepted Spearman's concept of general intelligence, for the most part, as a representation of the uppermost, third stratum.\n\nIn 1999, a merging of the Gf-Gc theory of Cattell and Horn with Carroll's Three-Stratum theory has led to the Cattell–Horn–Carroll theory (CHC Theory). It has greatly influenced many of the current broad IQ tests.\n\nIn CHC theory, a hierarchy of factors is used; g is at the top. Under it are ten broad abilities that in turn are subdivided into seventy narrow abilities. The broad abilities are:\n* Fluid intelligence (Gf) includes the broad ability to reason, form concepts, and solve problems using unfamiliar information or novel procedures.\n* Crystallized intelligence (Gc) includes the breadth and depth of a person's acquired knowledge, the ability to communicate one's knowledge, and the ability to reason using previously learned experiences or procedures.\n* Quantitative reasoning (Gq) is the ability to comprehend quantitative concepts and relationships and to manipulate numerical symbols.\n* Reading and writing ability (Grw) includes basic reading and writing skills.\n* Short-term memory (Gsm) is the ability to apprehend and hold information in immediate awareness, and then use it within a few seconds.\n* Long-term storage and retrieval (Glr) is the ability to store information and fluently retrieve it later in the process of thinking.\n* Visual processing (Gv) is the ability to perceive, analyze, synthesize, and think with visual patterns, including the ability to store and recall visual representations.\n* Auditory processing (Ga) is the ability to analyze, synthesize, and discriminate auditory stimuli, including the ability to process and discriminate speech sounds that may be presented under distorted conditions.\n* Processing speed (Gs) is the ability to perform automatic cognitive tasks, particularly when measured under pressure to maintain focused attention.\n* Decision/reaction time/speed (Gt) reflects the immediacy with which an individual can react to stimuli or a task (typically measured in seconds or fractions of seconds; it is not to be confused with Gs, which typically is measured in intervals of 2–3 minutes). See Mental chronometry.\nModern tests do not necessarily measure all of these broad abilities. For example, Gq and Grw may be seen as measures of school achievement and not IQ. Gt may be difficult to measure without special equipment. g was earlier often subdivided into only Gf and Gc, which were thought to correspond to the nonverbal or performance subtests and verbal subtests in earlier versions of the popular Wechsler IQ test. More recent research has shown the situation to be more complex. Modern comprehensive IQ tests do not stop at reporting a single IQ score. Although they still give an overall score, they now also give scores for many of these more restricted abilities, identifying particular strengths and weaknesses of an individual.\n\nOther theories\n\nJ.P. Guilford's Structure of Intellect (1967) model used three dimensions which when combined yielded a total of 120 types of intelligence. It was popular in the 1970s and early 1980s, but faded owing to both practical problems and theoretical criticisms.\n\nAlexander Luria's earlier work on neuropsychological processes led to the PASS theory (1997). It argued that only looking at one general factor was inadequate for researchers and clinicians who worked with learning disabilities, attention disorders, intellectual disability, and interventions for such disabilities. The PASS model covers four kinds of processes (planning process, attention/arousal process, simultaneous processing, and successive processing). The planning processes involve decision making, problem solving, and performing activities and requires goal setting and self-monitoring.\n\nThe attention/arousal process involves selectively attending to a particular stimulus, ignoring distractions, and maintaining vigilance. Simultaneous processing involves the integration of stimuli into a group and requires the observation of relationships. Successive processing involves the integration of stimuli into serial order. The planning and attention/arousal components comes from structures located in the frontal lobe, and the simultaneous and successive processes come from structures located in the posterior region of the cortex. It has influenced some recent IQ tests, and been seen as a complement to the Cattell-Horn-Carroll theory described above.\n\nCurrent tests\n\nThere are a variety of individually administered IQ tests in use in the English-speaking world. The most commonly used individual IQ test series is the Wechsler Adult Intelligence Scale for adults and the Wechsler Intelligence Scale for Children for school-age test-takers. Other commonly used individual IQ tests (some of which do not label their standard scores as \"IQ\" scores) include the current versions of the Stanford-Binet, Woodcock-Johnson Tests of Cognitive Abilities, the Kaufman Assessment Battery for Children, the Cognitive Assessment System, and the Differential Ability Scales.\n\nIQ tests that measure intelligence also include:\n# Stanford–Binet Intelligence Scales\n# Woodcock–Johnson Tests of Cognitive Abilities\n# Raven's Progressive Matrices\n# Wechsler Adult Intelligence Scale\n# Cattell Culture Fair III\n# Reynolds Intellectual Assessment Scales\n# Thurstone's Primary Mental Abilities \n# Differential Ability Scales\n# Kaufman Brief Intelligence Test\n# Multidimensional Aptitude Battery II\n# Das–Naglieri cognitive assessment system\n\nIQ scales are ordinally scaled. While one standard deviation is 15 points, and two SDs are 30 points, and so on, this does not imply that mental ability is linearly related to IQ, such that IQ 50 means half the cognitive ability of IQ 100. In particular, IQ points are not percentage points.\n\nOn a related note, this fixed standard deviation means that the proportion of the population who have IQs in a particular range is theoretically fixed, and current Wechsler tests only give Full Scale IQs between 40 and 160. This should be borne in mind when considering reports of people with much higher IQs.\n\nTest bias or differential item functioning \n\nDifferential item functioning (DIF), sometimes referred to as measurement bias, is a phenomenon when participants from different groups (ex gender, race, disability) with the same latent abilities give different answers to specific questions on the same IQ test.Embretson, S. E., Reise, S. P. (2000).Item Response Theory for Psychologists. New Jersey: Lawrence Erlbaum. DIF analysis measures such specific items on a test alongside measuring participants latent abilities on other similar questions. A consistent different group response to a specific question among similar type of questions can indicate an effect of DIF. It does not count as differential item functioning if both groups have equally valid chance of giving different responses to the same questions. Such bias can be a result of culture, educational level and other factors that are independent of group traits. DIF is only considered if test-takers from different groups with the same underlying latent ability level have a different chance of giving specific responses. Such questions are usually removed in order to make the test equally fair for both groups. Common techniques for analyzing DIF are item response theory (IRT) based methods, Mantel-Haenszel, and logistic regression.\n\nReliability and validity\n\nPsychometricians generally regard IQ tests as having high statistical reliability. A high reliability implies that – although test-takers may have varying scores when taking the same test on differing occasions, and although they may have varying scores when taking different IQ tests at the same age – the scores generally agree with one another and across time. Like all statistical quantities, any particular estimate of IQ has an associated standard error that measures uncertainty about the estimate. For modern tests, the standard error of measurement is about three points. Clinical psychologists generally regard IQ scores as having sufficient statistical validity for many clinical purposes. In a survey of 661 randomly sampled psychologists and educational researchers, published in 1988, Mark Snyderman and Stanley Rothman reported a general consensus supporting the validity of IQ testing. \"On the whole, scholars with any expertise in the area of intelligence and intelligence testing (defined very broadly) share a common view of the most important components of intelligence, and are convinced that it can be measured with some degree of accuracy.\" Almost all respondents picked out abstract reasoning, ability to solve problems and ability to acquire knowledge as the most important elements.\n\nFlynn effect\n\nSince the early 20th century, raw scores on IQ tests have increased in most parts of the world. When a new version of an IQ test is normed, the standard scoring is set so performance at the population median results in a score of IQ 100. The phenomenon of rising raw score performance means if test-takers are scored by a constant standard scoring rule, IQ test scores have been rising at an average rate of around three IQ points per decade. This phenomenon was named the Flynn effect in the book The Bell Curve after James R. Flynn, the author who did the most to bring this phenomenon to the attention of psychologists.\n\nResearchers have been exploring the issue of whether the Flynn effect is equally strong on performance of all kinds of IQ test items, whether the effect may have ended in some developed nations, whether there are social subgroup differences in the effect, and what possible causes of the effect might be. A 2011 textbook, IQ and Human Intelligence, by N. J. Mackintosh, noted the Flynn effect demolishes the fears that IQ would be decreased. He also asks whether it represents a real increase in intelligence beyond IQ scores.Mackintosh, N. (2011). IQ and human intelligence. Oxford University Press. p.25-27 A 2011 psychology textbook, lead authored by Harvard Psychologist Professor Daniel Schacter, noted that humans' inherited intelligence could be going down while acquired intelligence goes up.\n\nAge\n\nIQ can change to some degree over the course of childhood. However, in one longitudinal study, the mean IQ scores of tests at ages 17 and 18 were correlated at r0.86 with the mean scores of tests at ages five, six, and seven and at r\n0.96 with the mean scores of tests at ages 11, 12, and 13.\n\nFor decades, practitioners' handbooks and textbooks on IQ testing have reported IQ declines with age after the beginning of adulthood. However, later researchers pointed out this phenomenon is related to the Flynn effect and is in part a cohort effect rather than a true aging effect. A variety of studies of IQ and aging have been conducted since the norming of the first Wechsler Intelligence Scale drew attention to IQ differences in different age groups of adults. Current consensus is that fluid intelligence generally declines with age after early adulthood, while crystallized intelligence remains intact. Both cohort effects (the birth year of the test-takers) and practice effects (test-takers taking the same form of IQ test more than once) must be controlled to gain accurate data. It is unclear whether any lifestyle intervention can preserve fluid intelligence into older ages.\n\nThe exact peak age of fluid intelligence or crystallized intelligence remains elusive. Cross-sectional studies usually show that especially fluid intelligence peaks at a relatively young age (often in the early adulthood) while longitudinal data mostly show that intelligence is stable until the mid adulthood or later. Subsequently, intelligence seems to decline slowly.\n\nGenetics and environment\n\nEnvironmental and genetic factors play a role in determining IQ. Their relative importance has been the subject of much research and debate.\n\nHeritability\n\nHeritability is defined as the proportion of variance in a trait which is attributable to genotype within a defined population in a specific environment. A number of points must be considered when interpreting heritability.International Journal of Epidemiology, Volume 35, Issue 3, June 2006. See reprint of Leowontin's 1974 article \"The analysis of variance and the analysis of causes\" and 2006 commentaries: http://ije.oxfordjournals.org/content/35/3.toc  Heritability, as a term, applies to populations, and in populations there are variations in traits between individuals.  Heritability measures how much of that variation is caused by genetics.  The value of heritability can change if the impact of environment (or of genes) in the population is substantially altered. A high heritability of a trait does not mean environmental effects, such as learning, are not involved. Since heritability increases during childhood and adolescence, one should be cautious drawing conclusions regarding the role of genetics and environment from studies where the participants are not followed until they are adults.\n\nThe general figure for the heritability of IQ, according to an authoritative American Psychological Association report, is 0.45 for children, and rises to around 0.75 for late adolescents and adults.  Heritability measures in infancy are as low as 0.2, around 0.4 in middle childhood, and as high as 0.9 in adulthood. One proposed explanation is that people with different genes tend to reinforce the effects of those genes, for example by seeking out different environments.\n\nShared family environment\n\nFamily members have aspects of environments in common (for example, characteristics of the home). This shared family environment accounts for 0.25–0.35 of the variation in IQ in childhood. By late adolescence, it is quite low (zero in some studies). The effect for several other psychological traits is similar. These studies have not looked at the effects of extreme environments, such as in abusive families.\n\nNon-shared family environment and environment outside the family\n\nAlthough parents treat their children differently, such differential treatment explains only a small amount of nonshared environmental influence. One suggestion is that children react differently to the same environment because of different genes. More likely influences may be the impact of peers and other experiences outside the family.\n\nIndividual genes\n\nA very large proportion of the over 17,000 human genes are thought to have an effect on the development and functionality of the brain. While a number of individual genes have been reported to be associated with IQ, none have a strong effect. Deary and colleagues (2009) reported that no finding of a strong single gene effect on IQ has been replicated. Recent findings of gene associations with normally varying intelligence differences in adults continue to show weak effects for any one gene; likewise in children., but see Weiss, Volkmar: Das IQ-Gen - verleugnet seit 2015: Eine bahnbrechende Entdeckung und ihre Feinde. Ares Verlag, Graz 2017, .\n\nGene-environment interaction\n\nDavid Rowe reported an interaction of genetic effects with socioeconomic status, such that the heritability was high in high-SES families, but much lower in low-SES families. In the US, this has been replicated in infants, children, adolescents, and adults. Outside the US, studies show no link between heritability and SES. Some effects may even reverse sign outside the US.\n\nDickens and Flynn (2001) have argued that genes for high IQ initiate an environment-shaping feedback cycle, with genetic effects causing bright children to seek out more stimulating environments that then further increase their IQ. In Dickens' model, environment effects are modeled as decaying over time. In this model, the Flynn effect can be explained by an increase in environmental stimulation independent of it being sought out by individuals. The authors suggest that programs aiming to increase IQ would be most likely to produce long-term IQ gains if they enduringly raised children's drive to seek out cognitively demanding experiences.\n\nInterventions\n\nIn general, educational interventions, as those described below, have shown short-term effects on IQ, but long-term follow-up is often missing. For example, in the US very large intervention programs such as the Head Start Program have not produced lasting gains in IQ scores. More intensive, but much smaller projects such as the Abecedarian Project have reported lasting effects, often on socioeconomic status variables, rather than IQ.\n\nRecent studies have shown that training in using one's working memory may increase IQ. A study on young adults published in April 2008 by a team from the Universities of Michigan and Bern supports the possibility of the transfer of fluid intelligence from specifically designed working memory training. Further research will be needed to determine nature, extent and duration of the proposed transfer. Among other questions, it remains to be seen whether the results extend to other kinds of fluid intelligence tests than the matrix test used in the study, and if so, whether, after training, fluid intelligence measures retain their correlation with educational and occupational achievement or if the value of fluid intelligence for predicting performance on other tasks changes. It is also unclear whether the training is durable of extended periods of time.\n\nMusic\n\nMusical training in childhood has been found to correlate with higher than average IQ. It is popularly thought that listening to classical music raises IQ. However, multiple attempted replications (e.g.) have shown that this is at best a short-term effect (lasting no longer than 10 to 15 minutes), and is not related to IQ-increase.\n\nBrain anatomy\n\nSeveral neurophysiological factors have been correlated with intelligence in humans, including the ratio of brain weight to body weight and the size, shape, and activity level of different parts of the brain. Specific features that may affect IQ include the size and shape of the frontal lobes, the amount of blood and chemical activity in the frontal lobes, the total amount of gray matter in the brain, the overall thickness of the cortex, and the glucose metabolic rate.\n\nHealth\n\nHealth is important in understanding differences in IQ test scores and other measures of cognitive ability. Several factors can lead to significant cognitive impairment, particularly if they occur during pregnancy and childhood when the brain is growing and the blood–brain barrier is less effective. Such impairment may sometimes be permanent, sometimes be partially or wholly compensated for by later growth. \n\nSince about 2010, researchers such as Eppig, Hassel, and MacKenzie have found a very close and consistent link between IQ scores and infectious diseases, especially in the infant and preschool populations and the mothers of these children.Eppig. Christopher. Scientific American.\"Why is average IQ higher in some places?\" 2011. They have postulated that fighting infectious diseases strains the child's metabolism and prevents full brain development. Hassel postulated that it is by far the most important factor in determining population IQ. However, they also found that subsequent factors such as good nutrition and regular quality schooling can offset early negative effects to some extent.\n\nDeveloped nations have implemented several health policies regarding nutrients and toxins known to influence cognitive function. These include laws requiring fortification of certain food products and laws establishing safe levels of pollutants (e.g. lead, mercury, and organochlorides).  Improvements in nutrition, and in public policy in general, have been implicated in worldwide IQ increases. \n\nCognitive epidemiology is a field of research that examines the associations between intelligence test scores and health. Researchers in the field argue that intelligence measured at an early age is an important predictor of later health and mortality differences.\n\nSocial correlations\n\nSchool performance\n\nThe American Psychological Association's report \"Intelligence: Knowns and Unknowns\" states that wherever it has been studied, children with high scores on tests of intelligence tend to learn more of what is taught in school than their lower-scoring peers. The correlation between IQ scores and grades is about .50. This means that the explained variance is 25%. Achieving good grades depends on many factors other than IQ, such as \"persistence, interest in school, and willingness to study\" (p. 81).\n\nIt has been found that the correlation of IQ scores with school performance depends on the IQ measurement used. For undergraduate students, the Verbal IQ as measured by WAIS-R has been found to correlate significantly (0.53) with the grade point average (GPA) of the last 60 hours. In contrast, Performance IQ correlation with the same GPA was only 0.22 in the same study.\n\nSome measures of educational aptitude correlate highly with IQ tests for instance, Frey and Detterman (2004) reported a correlation of 0.82 between g (general intelligence factor) and SAT scores; another research found a correlation of 0.81 between g and GCSE scores, with the explained variance ranging \"from 58.6% in Mathematics and 48% in English to 18.1% in Art and Design\".\n\nJob performance\n\nAccording to Schmidt and Hunter, \"for hiring employees without previous experience in the job the most valid predictor of future performance is general mental ability.\" The validity of IQ as a predictor of job performance is above zero for all work studied to date, but varies with the type of job and across different studies, ranging from 0.2 to 0.6. The correlations were higher when the unreliability of measurement methods was controlled for. While IQ is more strongly correlated with reasoning and less so with motor function, IQ-test scores predict performance ratings in all occupations. That said, for highly qualified activities (research, management) low IQ scores are more likely to be a barrier to adequate performance, whereas for minimally-skilled activities, athletic strength (manual strength, speed, stamina, and coordination) are more likely to influence performance. The prevailing view among academics is that it is largely through the quicker acquisition of job-relevant knowledge that higher IQ mediates job performance. This view has been challenged by Byington & Felps (2010), who argued that \"the current applications of IQ-reflective tests allow individuals with high IQ scores to receive greater access to developmental resources, enabling them to acquire additional capabilities over time, and ultimately perform their jobs better.\"\n\nIn establishing a causal direction to the link between IQ and work performance, longitudinal studies by Watkins and others suggest that IQ exerts a causal influence on future academic achievement, whereas academic achievement does not substantially influence future IQ scores. Treena Eileen Rohde and Lee Anne Thompson write that general cognitive ability, but not specific ability scores, predict academic achievement, with the exception that processing speed and spatial ability predict performance on the SAT math beyond the effect of general cognitive ability.\n\nThe US military has minimum enlistment standards at about the IQ 85 level. There have been two experiments with lowering this to 80 but in both cases these men could not master soldiering well enough to justify their costs.Gottfredson, L. S. (2006). Social consequences of group differences in cognitive ability (Consequencias sociais das diferencas de grupo em habilidade cognitiva). In C. E. Flores-Mendoza & R. Colom (Eds.), Introducau a psicologia das diferencas individuais (pp. 433-456). Porto Allegre, Brazil: ArtMed Publishers.\n\nIncome\n\nWhile it has been suggested that \"in economic terms it appears that the IQ score measures something with decreasing marginal value. It is important to have enough of it, but having lots and lots does not buy you that much\",\nDetterman and Daniel, 1989.\n large-scale longitudinal studies indicate an increase in IQ translates into an increase in performance at all levels of IQ: i.e. ability and job performance are monotonically linked at all IQ levels. Charles Murray, coauthor of The Bell Curve, found that IQ has a substantial effect on income independent of family background.\n\nThe link from IQ to wealth is much less strong than that from IQ to job performance. Some studies indicate that IQ is unrelated to net worth.\n\nThe American Psychological Association's 1995 report Intelligence: Knowns and Unknowns stated that IQ scores accounted for (explained variance) about a quarter of the social status variance and one-sixth of the income variance. Statistical controls for parental SES eliminate about a quarter of this predictive power. Psychometric intelligence appears as only one of a great many factors that influence social outcomes.\n\nIn a meta-analysis, Strenze (2006) reviewed much of the literature and estimated the correlation between IQ and income to be about 0.23.\n\nSome studies claim that IQ only accounts for (explains) a sixth of the variation in income because many studies are based on young adults, many of whom have not yet reached their peak earning capacity, or even their education.  On pg 568 of The g Factor, Arthur Jensen claims that although the correlation between IQ and income averages a moderate 0.4 (one sixth or 16% of the variance), the relationship increases with age, and peaks at middle age when people have reached their maximum career potential. In the book, A Question of Intelligence, Daniel Seligman cites an IQ income correlation of 0.5 (25% of the variance).\n\nA 2002 study further examined the impact of non-IQ factors on income and concluded that an individual's location, inherited wealth, race, and schooling are more important as factors in determining income than IQ.\n\nCrime\n\nThe American Psychological Association's 1995 report Intelligence: Knowns and Unknowns stated that the correlation between IQ and crime was −0.2. It was −0.19 between IQ scores and number of juvenile offenses in a large Danish sample; with social class controlled, the correlation dropped to −0.17. A correlation of 0.20 means that the explained variance is 4%. The causal links between psychometric ability and social outcomes may be indirect. Children with poor scholastic performance may feel alienated. Consequently, they may be more likely to engage in delinquent behavior, compared to other children who do well.\n\nIn his book The g Factor (1998), Arthur Jensen cited data which showed that, regardless of race, people with IQs between 70 and 90 have higher crime rates than people with IQs below or above this range, with the peak range being between 80 and 90.\n\nThe 2009 Handbook of Crime Correlates stated that reviews have found that around eight IQ points, or 0.5 SD, separate criminals from the general population, especially for persistent serious offenders. It has been suggested that this simply reflects that \"only dumb ones get caught\" but there is similarly a negative relation between IQ and self-reported offending. That children with conduct disorder have lower IQ than their peers \"strongly argues\" for the theory.Handbook of Crime Correlates; Lee Ellis, Kevin M. Beaver, John Wright; 2009; Academic Press\n\nA study of the relationship between US county-level IQ and US county-level crime rates found that higher average IQs were associated with lower levels of property crime, burglary, larceny rate, motor vehicle theft, violent crime, robbery, and aggravated assault. These results were not \"confounded by a measure of concentrated disadvantage that captures the effects of race, poverty, and other social disadvantages of the county.\"\n\nThe American Psychological Association's 1995 report Intelligence: Knowns and Unknowns stated that the correlations for most \"negative outcome\" variables are typically smaller than 0.20, which means that the explained variance is less than 4%.\n\nTambs et al. found that occupational status, educational attainment, and IQ are individually heritable; and further found that \"genetic variance influencing educational attainment ... contributed approximately one-fourth of the genetic variance for occupational status and nearly half the genetic variance for IQ.\" In a sample of U.S. siblings, Rowe et al.Rowe, D. C., W. J. Vesterdal, and J. L. Rodgers, \"The Bell Curve Revisited: How Genes and Shared Environment Mediate IQ-SES Associations,\" University of Arizona, 1997 report that the inequality in education and income was predominantly due to genes, with shared environmental factors playing a subordinate role.\n\nHealth and mortality\n\nMultiple studies conducted in Scotland have found that higher IQs in early life are associated with lower mortality and morbidity rates later in life.\n\nOther accomplishments\n\nThere is considerable variation within and overlap among these categories. People with high IQs are found at all levels of education and occupational categories. The biggest difference occurs for low IQs with only an occasional college graduate or professional scoring below 90.\n\nGroup-IQ or the collective intelligence factor c \n\nWith operationalization and methodology derived from the general intelligence factor g, a new scientific understanding of collective intelligence, defined as a group’s general ability to perform a wide range of tasks, aims to explain intelligent behavior of groups. Goal is to detect and explain a general intelligence factor c for groups, parallel to the g factor for individuals. As g is highly interrelated with the concept of IQ, this measurement of collective intelligence can be interpreted as intelligence quotient for groups (Group-IQ) even though the score is not a quotient per se. Current evidence suggests that this Group-IQ is only moderately correlated with group members' IQs but with other correlates such as group members' Theory of Mind.\n\nGroup differences\n\nAmong the most controversial issues related to the study of intelligence is the observation that intelligence measures such as IQ scores vary between ethnic and racial groups and sexes. While there is little scholarly debate about the existence of some of these differences, their causes remain highly controversial both within academia and in the public sphere.\n\nSex\n\nMost IQ tests are constructed so that there are no overall score differences between females and males. Popular IQ batteries such as the WAIS and the WISC-R are also constructed in order to eliminate sex differences.Jensen, A. (1998) The g Factor: The Science of Mental Ability (p. 531) In a paper presented at the International Society for Intelligence Research in 2002, it was pointed out that because test constructors and the United States' Educational Testing Service (which developed the US SAT test) often eliminate items showing marked sex differences in order to reduce the perception of bias, the \"true sex\" difference is masked. Items like the Mental Rotations Test and reaction time tests, which show a male advantage in IQ, are often removed.Jackson, D. N. (2002, December 5–7). Evaluating g in the SAT: Implications for the sex differences and interpretations of verbal and quantitative aptitude. Paper presented at the International Society for Intelligence Research, Nashville, TN.\" Meta-analysis focusing on gender differences in math performance found nearly identical performance for boys and girls, and the subject of mathematical intelligence and gender has been controversial.\n\nRace and intelligence\n\nRace and intelligence in United States of America\n\nThe 1996 Task Force investigation on Intelligence sponsored by the American Psychological Association concluded that there are significant variations in IQ across races. The problem of determining the causes underlying this variation relates to the question of the contributions of \"nature and nurture\" to IQ. Psychologists such as Alan S. Kaufman and Nathan Brody and statisticians such as Bernie Devlin argue that there are insufficient data to conclude that this is because of genetic influences. A review article published in 2012 by leading scholars on human intelligence concluded, after reviewing the prior research literature, that group differences in IQ are best understood as environmental in origin.\n\nIn considering disparities between test results of different ethnic groups, one might investigate the effects of stereotype threat (a situational predicament in which a person feels at risk of confirming negative stereotypes about the group(s) he identifies with), as well as culture and acculturation.  This phenomenon has been criticized as a fiction of publication bias.Flore, Paulette C.; Wicherts, Jelte M. (2014). \"Does stereotype threat influence performance of girls in stereotyped domains? A meta-analysis\". Journal of School Psychology. 53 (1): 25–44. doi:10.1016/j.jsp.2014.10.002. ISSN 0022-4405. .\n\nPublic policy\n\nIn the United States, certain public policies and laws regarding military service, education, public benefits, capital punishment, and employment incorporate an individual's IQ into their decisions. However, in the case of Griggs v. Duke Power Co. in 1971, for the purpose of minimizing employment practices that disparately impacted racial minorities, the U.S. Supreme Court banned the use of IQ tests in employment, except when linked to job performance via a job analysis. Internationally, certain public policies, such as improving nutrition and prohibiting neurotoxins, have as one of their goals raising, or preventing a decline in, intelligence.\n\nA diagnosis of intellectual disability is in part based on the results of IQ testing. Borderline intellectual functioning is a categorization where a person has below average cognitive ability (an IQ of 71–85), but the deficit is not as severe as intellectual disability (70 or below).\n\nIn the United Kingdom, the eleven plus exam which incorporated an intelligence test has been used from 1945 to decide, at eleven years of age, which type of school a child should go to. They have been much less used since the widespread introduction of comprehensive schools.\n\nCriticism and views\n\nRelationship to intelligence\n\nIQ is the most thoroughly researched means of measuring intelligence, and by far the most widely used in practical settings. However, while IQ strives to measure some concepts of intelligence, it may fail to serve as an accurate measure of broader definitions of intelligence. IQ tests examine some areas of intelligence, while neglecting to account for other areas, such as creativity and social intelligence.\n\nCritics such as Keith Stanovich do not dispute the reliability of IQ test scores or their capacity to predict some kinds of achievement, but argue that basing a concept of intelligence on IQ test scores alone neglects other important aspects of mental ability.Brooks, David (September 14, 2007). [https://select.nytimes.com/2007/09/14/opinion/14brooks.html \"The Waning of I.Q.\"]. The New York Times.\n\nCriticism of IQ\n\nSome scientists dispute IQ entirely. In The Mismeasure of Man (1996), paleontologist Stephen Jay Gould criticized IQ tests and argued that they were used for scientific racism. He argued that g was a mathematical artifact and criticized:\n\nArthur Jensen responded:\n\nJensen also argued that even if g were replaced by a model with several intelligences this would change the situation less than expected. He argues that all tests of cognitive ability would continue to be highly correlated with one another and there would still be a black-white gap on cognitive tests. Hans Eysenck responded to Gould by stating that no psychologist had said that intelligence was an area located in the brain.Eysenck, Hans Intelligence: A New Look Transaction Publishers page 74 Eysenck also argued IQ tests were not racist, pointing out that Northeast Asians and Jews both scored higher than non-Jewish Europeans on IQ tests, and this would not please European racists.Eysenck, Hans Intelligence: A New Look Transaction Publishers page 10\n\nPsychologist Peter Schönemann persistently criticized IQ, calling it \"the IQ myth\". He argued that g is a flawed theory and that the high heritability estimates of IQ are based on false assumptions.Psychometrics of Intelligence.  K. Kemp-Leonard (ed.)  Encyclopedia of Social Measurement, 3, 193-201: [http://www2.psych.purdue.edu/~phs/pdf/89.pdf] Robert Sternberg, another significant critic of g as the main measure of human cognitive abilities, argued that reducing the concept of intelligence to the measure of g does not fully account for the different skills and knowledge types that produce success in human society.Sternberg, Robert J., and Richard K. Wagner. \"The g-ocentric view of intelligence and job performance is wrong.\" Current directions in psychological science (1993): 1-5.\n\nTest bias\n\nThe American Psychological Association's report Intelligence: Knowns and Unknowns stated that in the United States IQ tests as predictors of social achievement are not biased against African Americans since they predict future performance, such as school achievement, similarly to the way they predict future performance for Caucasians. While agreeing that IQ tests predict performance equally well for all racial groups, Nicholas Mackintosh also points out that there may still be a bias inherent in IQ testing if the education system is also systematically biased against African Americans, in which case educational performance may in fact also be an underestimation of African American children's cognitive abilities. Earl Hunt points out that while this may be the case that would not be a bias of the test, but of society.\n\nHowever, IQ tests may well be biased when used in other situations. A 2005 study stated that \"differential validity in prediction suggests that the WAIS-R test may contain cultural influences that reduce the validity of the WAIS-R as a measure of cognitive ability for Mexican American students,\" indicating a weaker positive correlation relative to sampled white students.  Other recent studies have questioned the culture-fairness of IQ tests when used in South Africa. Standard intelligence tests, such as the Stanford-Binet, are often inappropriate for autistic children; the alternative of using developmental or adaptive skills measures are relatively poor measures of intelligence in autistic children, and may have resulted in incorrect claims that a majority of autistic children are mentally retarded.\n\nOutdated methodology\n\nAccording to a 2006 article by the National Center for Biotechnology Information, contemporary psychological research often did not reflect substantial recent developments in psychometrics and \"bears an uncanny resemblance to the psychometric state of the art as it existed in the 1950s.\"\n\n\"Intelligence: Knowns and Unknowns\"\n\nIn response to the controversy surrounding The Bell Curve, the American Psychological Association's Board of Scientific Affairs established a task force in 1995 to write a report on the state of intelligence research which could be used by all sides as a basis for discussion, \"Intelligence: Knowns and Unknowns\". The full text of the report is available through several websites.\n\nIn this paper, the representatives of the association regret that IQ-related works are frequently written with a view to their political consequences:  \"research findings were often assessed not so much on their merits or their scientific standing as on their supposed political implications\".\n\nThe task force concluded that IQ scores do have high predictive validity for individual differences in school achievement. They confirm the predictive validity of IQ for adult occupational status, even when variables such as education and family background have been statistically controlled. They stated that individual differences in intelligence are substantially influenced by both genetics and environment.\n\nThe report stated that a number of biological factors, including malnutrition, exposure to toxic substances, and various prenatal and perinatal stressors, result in lowered psychometric intelligence under at least some conditions. The task force agrees that large differences do exist between the average IQ scores of blacks and whites, saying:\n\nThe APA journal that published the statement, American Psychologist, subsequently published eleven critical responses in January 1997, several of them arguing that the report failed to examine adequately the evidence for partly genetic explanations.\n\nDynamic assessment\n\nAn alternative to standard IQ tests originated in the writings of psychologist Lev Vygotsky (1896-1934) from his last two years of work. The notion of the zone of proximal development that he introduced in 1933, roughly a year before his death, served as the banner for his proposal to diagnose development as the level of actual development that can be measured by the child's independent problem solving and, at the same time, the level of proximal, or potential development that is measured in the situation of moderately assisted problem solving by the child.Vygotsky, L.S. (19332-34/1997). [http://www.marxists.org/archive/vygotsky/works/1934/problem-age.htm The Problem of Age]. in The Collected Works of L. S. Vygotsky, Volume 5, 1998, pp. 187-205 The maximum level of complexity and difficulty of the problem that the child is capable to solve under some guidance indicates the level of potential development. Then, the difference between the higher level of potential and the lower level of actual development indicates the zone of proximal development. Combination of the two indexesthe level of actual and the zone of the proximal developmentaccording to Vygotsky, provides a significantly more informative indicator of psychological development than the assessment of the level of actual development alone.Chaiklin, S. (2003). \"The Zone of Proximal Development in Vygotsky's analysis of learning and instruction.\" In Kozulin, A., Gindis, B., Ageyev, V. & Miller, S. (Eds.) Vygotsky's educational theory and practice in cultural context. 39-64. Cambridge: Cambridge UniversityZaretskii, V.K. (2009). The Zone of Proximal Development What Vygotsky Did Not Have Time to Write. Journal of Russian and East European Psychology, vol. 47, no. 6, November–December 2009, pp. 70–93\n\nThe ideas on the zone of development were later developed in a number of psychological and educational theories and practices. Most notably, they were developed under the banner of dynamic assessment that focuses on the testing of learning and developmental potentialSternberg, R.J. & Grigorenko, E.L. (2002). Dynamic testing: The nature and measurement of learning potential. Cambridge (UK): University of CambridgeHaywood, C.H. & Lidz, C.S. (2007). Dynamic assessment in practice: Clinical and educational applications. New York: Cambridge University Press (for instance, in the work of Reuven Feuerstein and his associates,Feuerstein, R., Feuerstein, S., Falik, L & Rand, Y. (1979; 2002). Dynamic assessments of cognitive modifiability. ICELP Press, Jerusalem: Israel who has criticized standard IQ testing for its putative assumption or acceptance of \"fixed and immutable\" characteristics of intelligence or cognitive functioning). Grounded in developmental theories of Vygotsky and Feuerstein, who maintained that human beings are not static entities but are always in states of transition and transactional relationships with the world, dynamic assessment received also considerable support in the recent revisions of cognitive developmental theory by Joseph Campione, Ann Brown, and John D. Bransford and in theories of multiple intelligences by Howard Gardner and Robert Sternberg.Dodge, Kenneth A. Foreword, xiii-xv. In Haywood, H. Carl & Lidz, Carol Schneider. Dynamic Assessment in Practice: Clinical And Educational Applications. Cambridge University Press, 2006, p.xiii-xiv Still, dynamic assessment has not been implemented in education on a large scale as is up to now, by admission of one of its notable proponents, \"in search of its identity\".Kozulin, A. (2014). Dynamic assessment in search of its identity. In Yasnitsky, A., van der Veer, R., & Ferrari, M. (Eds.). (2014). The Cambridge Handbook of Cultural-Historical Psychology. Cambridge University Press (pp. 126-147)\n\nClassification\n\nIQ classification is the practice by IQ test publishers of designating IQ score ranges as various categories with labels such as \"superior\" or \"average.\" IQ classification was preceded historically by attempts to classify human beings by general ability based on other forms of behavioral observation. Those other forms of behavioral observation are still important for validating classifications based on IQ tests.\n\nHigh IQ societies\n\nThere are social organizations, some international, which limit membership to people who have scores as high as or higher than the 98th percentile (2 standard deviations above the mean) on some IQ test or equivalent. Mensa International is perhaps the best known of these. The largest 99.9th percentile (3 standard deviations above the mean) society is the Triple Nine Society. Intelligence quotient. http://en.wikipedia.org/?curid=14892."
  }
}
