{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17130",
  "eid" : "2aabd240-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580836,
  "textBody" : "Allen Kelsey Grammer (born February 21, 1955) is an American actor, voice actor, comedian, producer, director, writer, singer, and activist.\n\nGrammer is known for his two-decade-long portrayal of psychiatrist Dr. Frasier Crane on the NBC sitcoms Cheers and Frasier. He has won five Primetime Emmy Awards, three Golden Globe Awards, and one Tony Award, and has also worked as a television producer, director, writer, and as a voice actor on The Simpsons as Sideshow Bob (for which he received his fifth Primetime Emmy). He also recently won a Daytime Emmy Award for “Outstanding Performer in an Animated Program” for his voice work in Guillermo Del Toro’s award-winning series, Trollhunters.http://www.imdb.com/title/tt1734135/awards?modedesktop&ref_\nm_tt_awd\n\nGrammer has been married four times and has seven children.\n\nEarly life\n\nGrammer was born February 21, 1955, in Charlotte Amalie, Saint Thomas, U.S. Virgin Islands, the son of Sally (née Cranmer; 1928–2008), a singer and actress, and Frank Allen Grammer, Jr. (d, 1968), a musician and owner of a coffee shop and a bar and grill called Greer's Place. He had one younger sister. Grammer was two years old when his parents divorced.\n\nGrammer and his sister Karen were subsequently raised by their mother and grandparents in New Jersey.Kelsey Grammer, Desert Island Discs, BBC Radio 4 (Dec 2017) The family relocated to Florida, and shortly afterwards his grandfather died when Kelsey was twelve. Two years later, in 1968, Frank Allen Grammer, his father, was murdered.\n\nGrammer attended Pine Crest School, a private preparatory school in Fort Lauderdale, Florida. It was there that he first began to sing and perform on stage. From the age of 16, with his mother's approval, he began to smoke a pipe.\n\nGrammer won a scholarship to the prestigious Juilliard School. He was a member of Group 6, 1973–1975. He failed to attend classes and was eventually expelled.\n\nCareer \n\nStage \n\nAfter leaving Juilliard, Grammer had a three-year internship with the Old Globe Theatre in San Diego in the late 1970s before a stint in 1980 at the Guthrie Theater in Minneapolis, Minnesota. He made his Broadway debut in 1981 as \"Lennox\" in Macbeth, taking the lead role when Philip Anglim withdrew after receiving negative reviews. Grammer then played Michael Cassio in a Broadway revival of Othello, with James Earl Jones and Christopher Plummer. In 1983 he performed on the demo of the Stephen Sondheim–James Lapine production Sunday in the Park with George, starring Mandy Patinkin. In 2000, Grammer again played Macbeth on Broadway, in a production that closed after only 10 days.\n\nOn April 18, 2010, Grammer made his Broadway musical debut playing the role of Georges in a revival of the Jerry Herman/Harvey Fierstein musical La Cage aux Folles, for which he was nominated for a Tony Award for Best Performance by a Leading Actor in a Musical. Grammer originated the roles of Charles Frohman and Captain Hook in the Broadway premiere of the musical Finding Neverland in March 2015, continuing with the roles through June 28, 2015. He returned to the stage from January 19 to April 3, 2016.\n\nTelevision \n\nGrammer's television career began in the early 1980s when he portrayed Stephen Smith in the NBC miniseries Kennedy.\n\nCheers, Frasier and Wings\n\nGrammer came to broader public attention as Dr. Frasier Crane in the NBC sitcom Cheers. Grammer's former Juilliard classmate and Broadway co-star Patinkin suggested Grammer to the New York casting director, and he got what was supposed to be a six-episode job, but ended up as a regular cast member.\n\nThe character became the center of the spin-off Frasier, one of the most successful spin-offs in TV history. In addition to starring, he also directed more than 30 episodes, especially during the second half of the series, and sang the closing theme \"Tossed Salads and Scrambled Eggs.\" Frasier was nominated for and won many awards during its 11-year run.\n\nIn 2001, he negotiated a US $700,000-per-episode salary for Frasier. His 20-year run playing Dr. Frasier Crane ties a length set by James Arness in playing Marshal Matt Dillon on Gunsmoke from 1955 to 1975 but was surpassed by Richard Belzer in playing Det. John Munch on Homicide: Life on the Street and Law & Order: Special Victims Unit since 1993.\n\nFrasier Crane also had a crossover appearance in 1993 Wings episode \"Planes, Trains, & Visiting Cranes\".\n\nPost-Frasier\n\nIn 2005, Grammer returned to television. He produced and appeared in an American adaptation of the British show The Sketch Show, which aired on Fox. The main cast consisted of Malcolm Barrett, Kaitlin Olson, Mary Lynn Rajskub and Paul F. Tompkins, as well as Lee Mack from the British version of the show. Grammer appeared in only short opening and closing segments in each episode. Many of the sketches from the British version were re-created, such as the \"California Dreamin'\", \"English Course\", and \"Sign Language\" sketches. Only six episodes of the show were made, and it was canceled after only four of them had aired.\n\nIn 2007, Grammer starred with Patricia Heaton in the American sitcom Back to You. It was canceled by Fox after its first season.\n\nHis next attempt, ABC's Hank, fared even worse. It was canceled after only five episodes had aired. Grammer later commented, \"Honestly, it just wasn't very funny.\"\n\nIn 2011 and 2012, Grammer starred in the Starz drama series Boss as a fictional mayor of Chicago in the mold of Richard J. Daley which premiered in October 2011. It was his first dramatic TV series. At the 2012 Golden Globe Awards Kelsey Grammer won the award for Best Actor in a Television Series Drama for his role on Boss. The show ran for 18 episodes over two seasons.\n\nGrammer played a villain in the Paramount's Transformers movies' fourth installment, Transformers: Age of Extinction, starring Mark Wahlberg. Grammer paired up with comedian/actor Martin Lawrence to star in the comedy Partners for Lionsgate TV. The Lionsgate-produced show would be written and executive produced by Robert L. Boyett and Robert Horn, known for writing hit shows like Family Matters, Living Single, Full House, Designing Women, and Perfect Strangers.\n\nOther appearances\n\nIn addition to being producer, he guest-starred as the Angel of Death on Medium, and Captain Morgan Bateson in the Star Trek: The Next Generation episode \"Cause and Effect\". Grammer was also the featured guest on long running BBC Radio 4 programme, Desert Island Discs, in December 2017.\n\nVoice work \n\nGrammer's well-known voice and mid-Atlantic accent make him popular for voiceover work. He has provided the voice of Sideshow Bob on The Simpsons, winning an Emmy Award for his work in the episode \"The Italian Bob\", his fifth Emmy win. He has appeared in eighteen episodes from the show's inception in 1989 through 2015's \"Treehouse of Horror XXVI\", in which his character finally succeeded in killing Bart Simpson in one segment (\"Wanted: Dead, then Alive\"). Grammer supplied the voices for \"Stinky Pete the Prospector\" in 1999 Disney/Pixar film Toy Story 2, Vladimir in the Fox animated movie Anastasia, Rothbart in Barbie of Swan Lake, Zozi the Bear in the subsequently produced sequel Bartok the Magnificent, the title character in the short-lived animated series Gary the Rat, and the villain, Dr. Ivan Krank, on  Disney's Teacher's Pet. He provided the opening speech and piano in The Vandals' song \"Phone Machine\" from the album Fear of a Punk Planet, and sang a rewritten version of the \"grinch\" on an episode of Just Shoot Me!. He was the voice of the mad scientist monkey, Dr. Frankenollie, in the Mickey Mouse short Runaway Brain. He was also the narrator of Mickey Mouse – Once Upon a Christmas.\n\nGrammer's voice has been featured in many commercials. One of the earliest was a 1998 commercial for Honey Nut Cheerios, where he played the voice of the wolf in Little Red Riding Hood. Since 2006, Grammer has provided the voice for television commercials advertising Hyundai. In 2008, Grammer reprised his role of Dr. Frasier Crane in a commercial for Dr Pepper (Frasier and Cheers co-star Bebe Neuwirth also reprised her role as Lilith Sternin in the same commercial, albeit in voice only).\nIn 2013, Grammer voiced the Tin Woodman in Legends of Oz: Dorothy's Return. In 2016, Grammer narrated the opening video package for WrestleMania 32 and he voiced the role of Hunter in Storks.\n\nProduction work \n\nHis production company, Grammnet Productions, produces the CW sitcoms Girlfriends and The Game (now on BET), the NBC drama Medium, and many other projects.\n\nOther work \n\nIn 1996, he starred in the feature comedy Down Periscope. Also, in the 1990s, he did several commercials for Snapper Mowers. Additionally, his film work includes the role of Dr. Hank McCoy (also known as the Beast) in X-Men: The Last Stand and he was the voice of Snowball in the live-action film adaptation of the George Orwell book Animal Farm. Grammer co-starred in the movie Swing Vote, playing the Republican incumbent. He played General George S. Patton in An American Carol. In 2010, he starred in The Kelsey Grammer Bill Zucker Comedy Hour.\n\nPersonal life \n\nFamily \n\nGrammer has been married four times and has seven children and one grandchild . His first marriage, to dance instructor Doreen Alderman, lasted from 1982 to 1990, although they were separated for the last six years of that period. They have one daughter, Spencer Grammer (born October 9, 1983), an actress on the CBS Daytime soap opera As the World Turns, the ABC Family show Greek, and the Adult Swim animated comedy Rick and Morty. Through Spencer, Grammer has one grandson, Spencer's son Emmett Emmanual Hesketh (born October 10, 2011).\n\nAfter his divorce from Alderman, Grammer had a daughter, Kandace Greer Grammer (\"Greer Grammer\"; born February 15, 1992), with hair and makeup stylist Barrie Buckner. Greer was a cast member on MTV's show Awkward.\n\nHis second marriage, to former exotic dancer Leigh-Anne Csuhany in September 1992, lasted one year. Grammer filed for an annulment when Csuhany was three months pregnant and evicted her from their home. The pregnancy ended in a miscarriage. Grammer claimed she was abusive and fired a gun at him.\n\nIn 1994, he met 28-year-old Tammi Baliszewski, also known as Tammi Alexander, at a bar in Manhattan Beach, California. In December 1994, they appeared together on the cover of People magazine, announcing their engagement and Grammer's substance abuse problems.\n\nIn August 1997, Grammer married his third wife, former Playboy model Camille Donatacci. They had met on a blind date in 1996. They have a daughter, born October 2001, and a son, born August 2004, both born to a surrogate mother. During their marriage, several of Grammer and Donatacci's homes were featured in magazines, including ones in Malibu, California (February 2001, InStyle), Maui (May 2004, InStyle), Long Island, New York (April 2008, InStyle), Bachelor Gulch, Colorado (Architectural Digest), and Bel Air, Los Angeles (Architectural Digest). It was announced on July 1, 2010, that Donatacci had filed for divorce, citing irreconcilable differences. Grammer and Donatacci's divorce was finalized on February 10, 2011.\n\nOn August 12, 2010, Grammer announced that he was going to be a father for the fifth time with girlfriend Kayte Walsh, a British flight attendant 25 years his junior. However, in October, Grammer announced that Walsh had miscarried six weeks earlier. The couple announced their engagement in December 2010, and married at The Plaza Hotel in New York City on February 25, 2011, two weeks after the finalization of Grammer's third divorce. Grammer and Walsh have a daughter, born July 2012, and two sons, born July 2014 and  November 2016.\n\nMurder of Karen Grammer\n\nOn July 1, 1975, Grammer's younger sister, 18-year-old Karen Grammer, was abducted, raped, and murdered by Freddie Glenn, Michael Corbett and one other man. Grammer, then 20, identified her body. He and his sister had been close, and he was devastated by her death; his later bouts of alcoholism and drug addiction were fueled in part by guilt and depression. \n\nIn an interview with Oprah Winfrey, Grammer stated he could consider forgiving the men involved if they would at least take responsibility for the crime, but that they all continued to say they were innocent. In the same interview, Grammer expressed his loss of faith for a few years after Karen's death. He subsequently forgave Glenn, but refused to support his release, saying it would \"be a betrayal of my sister’s life.”\n\nHe named his daughter Spencer Karen Grammer in part for his sister.\n\nLawsuits \n\nIn 1995, Grammer was sued by ex-girlfriend Cerlette Lamme for defamation of character and invasion of privacy over content he included in his autobiography So Far. The same year, he was accused of statutory rape by the parents of his child's 17-year-old babysitter, but authorities cleared him when no evidence was found. In September 1996, he crashed his Dodge Viper while intoxicated, and subsequently checked into the Betty Ford Center (an alcohol rehabilitation clinic) for 30 days.\nIn 1998, Grammer filed a lawsuit against Internet Entertainment Group (IEG), which Grammer claimed had stolen from his home a videotape of him having sex with a woman. IEG countersued Grammer, denying it was in possession of such a tape, and Grammer's suit was eventually dropped. IEG President Seth Warshavsky later said, \"We have been presented with another Kelsey Grammer tape. But we have no plans to air it. We are still evaluating it at this time.\" Grammer later reflected,\nWhether or not you're a celebrity—even if you're just an old slob with a video camera—you don't realize you shouldn't do it. So you throw the tape in the back of a dark closet until your old girlfriend remembers it's there because you're famous now and she's not. But if you're not prepared to do the time, don't do the crime.\"\n\nIn August 2008, Bradley Blakeman, a former aide to George W. Bush, filed a copyright lawsuit in federal court on Long Island over Grammer's movie Swing Vote, claiming that parts of its plot and marketing had been stolen from him. The lawsuit claimed that Blakeman had given a copyrighted screenplay called Go November to Grammer in 2006, and that Grammer agreed to develop the project and star as a Republican president but instead ended up playing a similar role in Swing Vote, which was released on August 1, 2008. Grammer's spokesman dismissed the claims as \"frivolous\" and a \"waste of time\". The lawsuit was settled in 2010 for $10. \n\nSubstance abuse issues \n\nGrammer has a history as a frequent abuser of alcohol.  In 1988, Grammer was arrested for drunk driving and cocaine possession and sentenced to 30 days in jail. In August 1990, Grammer was arrested again for cocaine possession and was sentenced to three years' probation, fined $500, and required to perform 300 hours of community service. In January 1991, Grammer was given an additional two years' probation for violating his original probation through additional cocaine use. The cast and producers of both Frasier and Cheers held interventions to attempt to help him. Grammer's personal problems affected his work; co-star Bebe Neuwirth and writer Ken Levine cited delays with rehearsals and filming due to his erratic behavior. Writer Dan O'Shannon recalled, however, that\n\nGrammer credits his religion for helping him through with his struggles with alcohol and drug abuse, as well as his personal tragedies.\n\nHealth problems \n\nOn May 31, 2008, while paddleboarding with his then-wife Camille in Hawaii, Grammer experienced symptoms of a heart attack. After being hospitalized, it was confirmed that he had experienced a heart attack. He was discharged on June 4, 2008, and was said to be \"resting comfortably\" at his Hawaiian residence.[http://www.eonline.com/uberblog/b141124_kelsey_grammer_of_hospital.html Kelsey Grammer Out of the Hospital] from E! Online   Seven weeks after the attack, Grammer told Entertainment Tonight that, although at the time his spokesman described the attack as mild, it was in fact more severe, almost leading to his death, as his heart had stopped. Grammer thought Fox's decision to cancel his TV sitcom Back to You contributed to his health problems, stating that \"It was a very stressful time for me, and a surprise that it was cancelled. But you know, everything that doesn't kill us—which it almost did—makes us stronger!\"\n\nOn June 28, 2008, Grammer checked into an undisclosed Manhattan hospital after complaints of feeling faint. Other reports said Grammer was hospitalized for an irregular heartbeat. His publicist said that it may have been due to a reaction to medication.\n\nPolitical views \n\nGrammer is a member of the Republican Party and has expressed an interest in someday running for United States Congress. He has also expressed an interest in running for Mayor of New York, and for the U.S. Presidency. Grammer was a guest at President George W. Bush's first inauguration. Grammer endorsed Rudy Giuliani in the 2008 presidential primary and later campaigned for John McCain in the general election. Grammer promoted RightNetwork, a conservative start-up American television network. He endorsed Michele Bachmann for the Republican nomination for president in 2012. After Mitt Romney won the nomination, Grammer endorsed him. He supported Ben Carson's candidacy for the Republican Presidential nomination in 2016, although he endorsed Donald Trump when the latter was selected.\n\nGrammer supported the Tea Party movement on economic issues such as small government and lower taxes, but not on social issues such as same-sex marriage, stating \"I think marriage is up to two people who love each other\".\n\nWhile a New York magazine profile published in 2010 described him as pro-choice, Grammer in 2015 posted an Instagram photo of himself with his wife Kayte wearing a T-shirt by the pro-life group Abort73. City A.M. described Grammer as \"one of Hollywood's best-known Republicans, a rare spark of red in a blue sea of Democrats\".\n\nAwards \n\nGrammer won a number of Emmys, Screen Actors Guild Award, and Golden Globes for his work on Frasier. He was the first American actor ever to be nominated for multiple Emmy awards for portraying the same character on three different television shows (Cheers, Frasier, and Wings).\n\nGrammer has received at least 45 nominations for major awards and has won on 18 occasions. He has received 14 individual Emmy Award nominations for four different television shows (plus an additional two as part of the Frasier ensemble) and has won five times. At the Golden Globes, he has received nine nominations and three times been victorious. He has received two People's Choice Awards, and in 1999 his directorial skills were recognized with a nomination for a Directors Guild of America award for directing an episode of Frasier. He received a Saturn Award nomination for Best Supporting Actor for his role in X-Men: The Last Stand. On May 22, 2001, he was presented with a star on the Hollywood Walk of Fame for television. On April 20, 2009, Grammer was presented the inaugural Television chairman's Award at the annual NAB Show in Las Vegas. In 2010, Grammer enjoyed his first Tony Award nomination for La Cage Aux Folles as Best Leading Actor in a Musical. In 2016, he received his second Tony Award nomination for The Color Purple as Best Revival of a Musical and won the award.\n\nThe following table gives a selection of the awards he has won.\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nTheme park attractions\n\nAs executive producer\n\nMusical theatre",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kelsey Grammer" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17130" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Allen Kelsey Grammer (born February 21, 1955) is an American actor, voice actor, comedian, producer, director, writer, singer, and activist.\n\nGrammer is known for his two-decade-long portrayal of psychiatrist Dr. Frasier Crane on the NBC sitcoms Cheers and Frasier. He has won five Primetime Emmy Awards, three Golden Globe Awards, and one Tony Award, and has also worked as a television producer, director, writer, and as a voice actor on The Simpsons as Sideshow Bob (for which he received his fifth Primetime Emmy). He also recently won a Daytime Emmy Award for “Outstanding Performer in an Animated Program” for his voice work in Guillermo Del Toro’s award-winning series, Trollhunters.http://www.imdb.com/title/tt1734135/awards?modedesktop&ref_\nm_tt_awd\n\nGrammer has been married four times and has seven children.\n\nEarly life\n\nGrammer was born February 21, 1955, in Charlotte Amalie, Saint Thomas, U.S. Virgin Islands, the son of Sally (née Cranmer; 1928–2008), a singer and actress, and Frank Allen Grammer, Jr. (d, 1968), a musician and owner of a coffee shop and a bar and grill called Greer's Place. He had one younger sister. Grammer was two years old when his parents divorced.\n\nGrammer and his sister Karen were subsequently raised by their mother and grandparents in New Jersey.Kelsey Grammer, Desert Island Discs, BBC Radio 4 (Dec 2017) The family relocated to Florida, and shortly afterwards his grandfather died when Kelsey was twelve. Two years later, in 1968, Frank Allen Grammer, his father, was murdered.\n\nGrammer attended Pine Crest School, a private preparatory school in Fort Lauderdale, Florida. It was there that he first began to sing and perform on stage. From the age of 16, with his mother's approval, he began to smoke a pipe.\n\nGrammer won a scholarship to the prestigious Juilliard School. He was a member of Group 6, 1973–1975. He failed to attend classes and was eventually expelled.\n\nCareer \n\nStage \n\nAfter leaving Juilliard, Grammer had a three-year internship with the Old Globe Theatre in San Diego in the late 1970s before a stint in 1980 at the Guthrie Theater in Minneapolis, Minnesota. He made his Broadway debut in 1981 as \"Lennox\" in Macbeth, taking the lead role when Philip Anglim withdrew after receiving negative reviews. Grammer then played Michael Cassio in a Broadway revival of Othello, with James Earl Jones and Christopher Plummer. In 1983 he performed on the demo of the Stephen Sondheim–James Lapine production Sunday in the Park with George, starring Mandy Patinkin. In 2000, Grammer again played Macbeth on Broadway, in a production that closed after only 10 days.\n\nOn April 18, 2010, Grammer made his Broadway musical debut playing the role of Georges in a revival of the Jerry Herman/Harvey Fierstein musical La Cage aux Folles, for which he was nominated for a Tony Award for Best Performance by a Leading Actor in a Musical. Grammer originated the roles of Charles Frohman and Captain Hook in the Broadway premiere of the musical Finding Neverland in March 2015, continuing with the roles through June 28, 2015. He returned to the stage from January 19 to April 3, 2016.\n\nTelevision \n\nGrammer's television career began in the early 1980s when he portrayed Stephen Smith in the NBC miniseries Kennedy.\n\nCheers, Frasier and Wings\n\nGrammer came to broader public attention as Dr. Frasier Crane in the NBC sitcom Cheers. Grammer's former Juilliard classmate and Broadway co-star Patinkin suggested Grammer to the New York casting director, and he got what was supposed to be a six-episode job, but ended up as a regular cast member.\n\nThe character became the center of the spin-off Frasier, one of the most successful spin-offs in TV history. In addition to starring, he also directed more than 30 episodes, especially during the second half of the series, and sang the closing theme \"Tossed Salads and Scrambled Eggs.\" Frasier was nominated for and won many awards during its 11-year run.\n\nIn 2001, he negotiated a US $700,000-per-episode salary for Frasier. His 20-year run playing Dr. Frasier Crane ties a length set by James Arness in playing Marshal Matt Dillon on Gunsmoke from 1955 to 1975 but was surpassed by Richard Belzer in playing Det. John Munch on Homicide: Life on the Street and Law & Order: Special Victims Unit since 1993.\n\nFrasier Crane also had a crossover appearance in 1993 Wings episode \"Planes, Trains, & Visiting Cranes\".\n\nPost-Frasier\n\nIn 2005, Grammer returned to television. He produced and appeared in an American adaptation of the British show The Sketch Show, which aired on Fox. The main cast consisted of Malcolm Barrett, Kaitlin Olson, Mary Lynn Rajskub and Paul F. Tompkins, as well as Lee Mack from the British version of the show. Grammer appeared in only short opening and closing segments in each episode. Many of the sketches from the British version were re-created, such as the \"California Dreamin'\", \"English Course\", and \"Sign Language\" sketches. Only six episodes of the show were made, and it was canceled after only four of them had aired.\n\nIn 2007, Grammer starred with Patricia Heaton in the American sitcom Back to You. It was canceled by Fox after its first season.\n\nHis next attempt, ABC's Hank, fared even worse. It was canceled after only five episodes had aired. Grammer later commented, \"Honestly, it just wasn't very funny.\"\n\nIn 2011 and 2012, Grammer starred in the Starz drama series Boss as a fictional mayor of Chicago in the mold of Richard J. Daley which premiered in October 2011. It was his first dramatic TV series. At the 2012 Golden Globe Awards Kelsey Grammer won the award for Best Actor in a Television Series Drama for his role on Boss. The show ran for 18 episodes over two seasons.\n\nGrammer played a villain in the Paramount's Transformers movies' fourth installment, Transformers: Age of Extinction, starring Mark Wahlberg. Grammer paired up with comedian/actor Martin Lawrence to star in the comedy Partners for Lionsgate TV. The Lionsgate-produced show would be written and executive produced by Robert L. Boyett and Robert Horn, known for writing hit shows like Family Matters, Living Single, Full House, Designing Women, and Perfect Strangers.\n\nOther appearances\n\nIn addition to being producer, he guest-starred as the Angel of Death on Medium, and Captain Morgan Bateson in the Star Trek: The Next Generation episode \"Cause and Effect\". Grammer was also the featured guest on long running BBC Radio 4 programme, Desert Island Discs, in December 2017.\n\nVoice work \n\nGrammer's well-known voice and mid-Atlantic accent make him popular for voiceover work. He has provided the voice of Sideshow Bob on The Simpsons, winning an Emmy Award for his work in the episode \"The Italian Bob\", his fifth Emmy win. He has appeared in eighteen episodes from the show's inception in 1989 through 2015's \"Treehouse of Horror XXVI\", in which his character finally succeeded in killing Bart Simpson in one segment (\"Wanted: Dead, then Alive\"). Grammer supplied the voices for \"Stinky Pete the Prospector\" in 1999 Disney/Pixar film Toy Story 2, Vladimir in the Fox animated movie Anastasia, Rothbart in Barbie of Swan Lake, Zozi the Bear in the subsequently produced sequel Bartok the Magnificent, the title character in the short-lived animated series Gary the Rat, and the villain, Dr. Ivan Krank, on  Disney's Teacher's Pet. He provided the opening speech and piano in The Vandals' song \"Phone Machine\" from the album Fear of a Punk Planet, and sang a rewritten version of the \"grinch\" on an episode of Just Shoot Me!. He was the voice of the mad scientist monkey, Dr. Frankenollie, in the Mickey Mouse short Runaway Brain. He was also the narrator of Mickey Mouse – Once Upon a Christmas.\n\nGrammer's voice has been featured in many commercials. One of the earliest was a 1998 commercial for Honey Nut Cheerios, where he played the voice of the wolf in Little Red Riding Hood. Since 2006, Grammer has provided the voice for television commercials advertising Hyundai. In 2008, Grammer reprised his role of Dr. Frasier Crane in a commercial for Dr Pepper (Frasier and Cheers co-star Bebe Neuwirth also reprised her role as Lilith Sternin in the same commercial, albeit in voice only).\nIn 2013, Grammer voiced the Tin Woodman in Legends of Oz: Dorothy's Return. In 2016, Grammer narrated the opening video package for WrestleMania 32 and he voiced the role of Hunter in Storks.\n\nProduction work \n\nHis production company, Grammnet Productions, produces the CW sitcoms Girlfriends and The Game (now on BET), the NBC drama Medium, and many other projects.\n\nOther work \n\nIn 1996, he starred in the feature comedy Down Periscope. Also, in the 1990s, he did several commercials for Snapper Mowers. Additionally, his film work includes the role of Dr. Hank McCoy (also known as the Beast) in X-Men: The Last Stand and he was the voice of Snowball in the live-action film adaptation of the George Orwell book Animal Farm. Grammer co-starred in the movie Swing Vote, playing the Republican incumbent. He played General George S. Patton in An American Carol. In 2010, he starred in The Kelsey Grammer Bill Zucker Comedy Hour.\n\nPersonal life \n\nFamily \n\nGrammer has been married four times and has seven children and one grandchild . His first marriage, to dance instructor Doreen Alderman, lasted from 1982 to 1990, although they were separated for the last six years of that period. They have one daughter, Spencer Grammer (born October 9, 1983), an actress on the CBS Daytime soap opera As the World Turns, the ABC Family show Greek, and the Adult Swim animated comedy Rick and Morty. Through Spencer, Grammer has one grandson, Spencer's son Emmett Emmanual Hesketh (born October 10, 2011).\n\nAfter his divorce from Alderman, Grammer had a daughter, Kandace Greer Grammer (\"Greer Grammer\"; born February 15, 1992), with hair and makeup stylist Barrie Buckner. Greer was a cast member on MTV's show Awkward.\n\nHis second marriage, to former exotic dancer Leigh-Anne Csuhany in September 1992, lasted one year. Grammer filed for an annulment when Csuhany was three months pregnant and evicted her from their home. The pregnancy ended in a miscarriage. Grammer claimed she was abusive and fired a gun at him.\n\nIn 1994, he met 28-year-old Tammi Baliszewski, also known as Tammi Alexander, at a bar in Manhattan Beach, California. In December 1994, they appeared together on the cover of People magazine, announcing their engagement and Grammer's substance abuse problems.\n\nIn August 1997, Grammer married his third wife, former Playboy model Camille Donatacci. They had met on a blind date in 1996. They have a daughter, born October 2001, and a son, born August 2004, both born to a surrogate mother. During their marriage, several of Grammer and Donatacci's homes were featured in magazines, including ones in Malibu, California (February 2001, InStyle), Maui (May 2004, InStyle), Long Island, New York (April 2008, InStyle), Bachelor Gulch, Colorado (Architectural Digest), and Bel Air, Los Angeles (Architectural Digest). It was announced on July 1, 2010, that Donatacci had filed for divorce, citing irreconcilable differences. Grammer and Donatacci's divorce was finalized on February 10, 2011.\n\nOn August 12, 2010, Grammer announced that he was going to be a father for the fifth time with girlfriend Kayte Walsh, a British flight attendant 25 years his junior. However, in October, Grammer announced that Walsh had miscarried six weeks earlier. The couple announced their engagement in December 2010, and married at The Plaza Hotel in New York City on February 25, 2011, two weeks after the finalization of Grammer's third divorce. Grammer and Walsh have a daughter, born July 2012, and two sons, born July 2014 and  November 2016.\n\nMurder of Karen Grammer\n\nOn July 1, 1975, Grammer's younger sister, 18-year-old Karen Grammer, was abducted, raped, and murdered by Freddie Glenn, Michael Corbett and one other man. Grammer, then 20, identified her body. He and his sister had been close, and he was devastated by her death; his later bouts of alcoholism and drug addiction were fueled in part by guilt and depression. \n\nIn an interview with Oprah Winfrey, Grammer stated he could consider forgiving the men involved if they would at least take responsibility for the crime, but that they all continued to say they were innocent. In the same interview, Grammer expressed his loss of faith for a few years after Karen's death. He subsequently forgave Glenn, but refused to support his release, saying it would \"be a betrayal of my sister’s life.”\n\nHe named his daughter Spencer Karen Grammer in part for his sister.\n\nLawsuits \n\nIn 1995, Grammer was sued by ex-girlfriend Cerlette Lamme for defamation of character and invasion of privacy over content he included in his autobiography So Far. The same year, he was accused of statutory rape by the parents of his child's 17-year-old babysitter, but authorities cleared him when no evidence was found. In September 1996, he crashed his Dodge Viper while intoxicated, and subsequently checked into the Betty Ford Center (an alcohol rehabilitation clinic) for 30 days.\nIn 1998, Grammer filed a lawsuit against Internet Entertainment Group (IEG), which Grammer claimed had stolen from his home a videotape of him having sex with a woman. IEG countersued Grammer, denying it was in possession of such a tape, and Grammer's suit was eventually dropped. IEG President Seth Warshavsky later said, \"We have been presented with another Kelsey Grammer tape. But we have no plans to air it. We are still evaluating it at this time.\" Grammer later reflected,\nWhether or not you're a celebrity—even if you're just an old slob with a video camera—you don't realize you shouldn't do it. So you throw the tape in the back of a dark closet until your old girlfriend remembers it's there because you're famous now and she's not. But if you're not prepared to do the time, don't do the crime.\"\n\nIn August 2008, Bradley Blakeman, a former aide to George W. Bush, filed a copyright lawsuit in federal court on Long Island over Grammer's movie Swing Vote, claiming that parts of its plot and marketing had been stolen from him. The lawsuit claimed that Blakeman had given a copyrighted screenplay called Go November to Grammer in 2006, and that Grammer agreed to develop the project and star as a Republican president but instead ended up playing a similar role in Swing Vote, which was released on August 1, 2008. Grammer's spokesman dismissed the claims as \"frivolous\" and a \"waste of time\". The lawsuit was settled in 2010 for $10. \n\nSubstance abuse issues \n\nGrammer has a history as a frequent abuser of alcohol.  In 1988, Grammer was arrested for drunk driving and cocaine possession and sentenced to 30 days in jail. In August 1990, Grammer was arrested again for cocaine possession and was sentenced to three years' probation, fined $500, and required to perform 300 hours of community service. In January 1991, Grammer was given an additional two years' probation for violating his original probation through additional cocaine use. The cast and producers of both Frasier and Cheers held interventions to attempt to help him. Grammer's personal problems affected his work; co-star Bebe Neuwirth and writer Ken Levine cited delays with rehearsals and filming due to his erratic behavior. Writer Dan O'Shannon recalled, however, that\n\nGrammer credits his religion for helping him through with his struggles with alcohol and drug abuse, as well as his personal tragedies.\n\nHealth problems \n\nOn May 31, 2008, while paddleboarding with his then-wife Camille in Hawaii, Grammer experienced symptoms of a heart attack. After being hospitalized, it was confirmed that he had experienced a heart attack. He was discharged on June 4, 2008, and was said to be \"resting comfortably\" at his Hawaiian residence.[http://www.eonline.com/uberblog/b141124_kelsey_grammer_of_hospital.html Kelsey Grammer Out of the Hospital] from E! Online   Seven weeks after the attack, Grammer told Entertainment Tonight that, although at the time his spokesman described the attack as mild, it was in fact more severe, almost leading to his death, as his heart had stopped. Grammer thought Fox's decision to cancel his TV sitcom Back to You contributed to his health problems, stating that \"It was a very stressful time for me, and a surprise that it was cancelled. But you know, everything that doesn't kill us—which it almost did—makes us stronger!\"\n\nOn June 28, 2008, Grammer checked into an undisclosed Manhattan hospital after complaints of feeling faint. Other reports said Grammer was hospitalized for an irregular heartbeat. His publicist said that it may have been due to a reaction to medication.\n\nPolitical views \n\nGrammer is a member of the Republican Party and has expressed an interest in someday running for United States Congress. He has also expressed an interest in running for Mayor of New York, and for the U.S. Presidency. Grammer was a guest at President George W. Bush's first inauguration. Grammer endorsed Rudy Giuliani in the 2008 presidential primary and later campaigned for John McCain in the general election. Grammer promoted RightNetwork, a conservative start-up American television network. He endorsed Michele Bachmann for the Republican nomination for president in 2012. After Mitt Romney won the nomination, Grammer endorsed him. He supported Ben Carson's candidacy for the Republican Presidential nomination in 2016, although he endorsed Donald Trump when the latter was selected.\n\nGrammer supported the Tea Party movement on economic issues such as small government and lower taxes, but not on social issues such as same-sex marriage, stating \"I think marriage is up to two people who love each other\".\n\nWhile a New York magazine profile published in 2010 described him as pro-choice, Grammer in 2015 posted an Instagram photo of himself with his wife Kayte wearing a T-shirt by the pro-life group Abort73. City A.M. described Grammer as \"one of Hollywood's best-known Republicans, a rare spark of red in a blue sea of Democrats\".\n\nAwards \n\nGrammer won a number of Emmys, Screen Actors Guild Award, and Golden Globes for his work on Frasier. He was the first American actor ever to be nominated for multiple Emmy awards for portraying the same character on three different television shows (Cheers, Frasier, and Wings).\n\nGrammer has received at least 45 nominations for major awards and has won on 18 occasions. He has received 14 individual Emmy Award nominations for four different television shows (plus an additional two as part of the Frasier ensemble) and has won five times. At the Golden Globes, he has received nine nominations and three times been victorious. He has received two People's Choice Awards, and in 1999 his directorial skills were recognized with a nomination for a Directors Guild of America award for directing an episode of Frasier. He received a Saturn Award nomination for Best Supporting Actor for his role in X-Men: The Last Stand. On May 22, 2001, he was presented with a star on the Hollywood Walk of Fame for television. On April 20, 2009, Grammer was presented the inaugural Television chairman's Award at the annual NAB Show in Las Vegas. In 2010, Grammer enjoyed his first Tony Award nomination for La Cage Aux Folles as Best Leading Actor in a Musical. In 2016, he received his second Tony Award nomination for The Color Purple as Best Revival of a Musical and won the award.\n\nThe following table gives a selection of the awards he has won.\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nTheme park attractions\n\nAs executive producer\n\nMusical theatre. Kelsey Grammer. http://en.wikipedia.org/?curid=17130."
  }
}
