{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13152",
  "eid" : "06e57f00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778520816,
  "textBody" : "Gluten (from Latin gluten, \"glue\") is a composite of storage proteins termed prolamins and glutelins and stored together with starch in the endosperm (which nourishes the embryonic plant during germination) of various cereal (grass) grains. It is found in wheat, barley, rye, oats, related species and hybrids (such as spelt, khorasan, emmer, einkorn, triticale, kamut, etc.) and products of these (such as malt). Glutens, and most especially the Triticeae glutens, are appreciated for their viscoelastic properties. It gives elasticity to dough, helping it rise and keep its shape and often gives the final product a chewy texture.\n\nWheat prolamins are called gliadins, barley prolamins are hordeins, rye prolamins are secalins and oats prolamins are avenins, which are collectively named gluten. Wheat glutelins are called glutenin. In a small part of the general population, gluten can trigger coeliac disease, non-coeliac gluten sensitivity, gluten ataxia and dermatitis herpetiformis. The occurrence of oat avenin toxicity in people with gluten-related disorders depends on the oat cultivar consumed, because the immunoreactivities of toxic prolamins are different among oat varieties. Also, many oat products are cross-contaminated with other gluten-containing cereals.\n\nTrue gluten is limited to the grains listed above. The stored proteins of maize and rice are sometimes called glutens, but their proteins differ from true gluten.\n\nPreparation \n\nGluten is a protein complex that accounts for 75 to 85% of the total protein in bread wheat. Gluten is prepared from flour by kneading the flour under water, agglomerating the gluten into an elastic network, a dough, and then washing out the starch. Starch granules disperse in cold/low-temperature water, and the dispersed starch is sedimented and dried. If a saline solution is used instead of water, a purer protein is obtained, with certain harmless impurities departing to the solution with the starch. Where starch is the prime product, cold water is the favored solvent because the impurities depart from the gluten.\n\nIn home or restaurant cooking, a ball of wheat flour dough is kneaded under water until the starch disperses out. In industrial production, a slurry of wheat flour is kneaded vigorously by machinery until the gluten agglomerates into a mass. This mass is collected by centrifugation, then transported through several stages integrated in a continuous process. About 65% of the water in the wet gluten is removed by means of a screw press; the remainder is sprayed through an atomizer nozzle into a drying chamber, where it remains at an elevated temperature a short time to evaporate the water without denaturing the gluten. The process yields a flour-like powder with a 7% moisture content, which is air cooled and pneumatically transported to a receiving vessel. In the final step, the processed gluten is sifted and milled to produce a uniform product.\n\nUses \n\nBread products\n\nGluten forms when glutenin molecules cross-link to form a submicroscopic network attached to gliadin, which contributes viscosity (thickness) and extensibility to the mix.\n \n If this dough is leavened with yeast, fermentation produces carbon dioxide bubbles, which, trapped by the gluten network, cause the dough to rise. Baking coagulates the gluten, which, along with starch, stabilizes the shape of the final product. Gluten content has been implicated as a factor in the staling of bread, possibly because it binds water through hydration.\nSahlstrom, S. & Brathen, E. (1997). \"Effects of enzyme preparations for baking, mixing time and resting time on bread quality and bread staling\". Food Chemistry, 58, 1, 75-80. Effects of wheat variety and processing conditions in experimental bread-baking studied by univariate and multivariate analysis.\n\nThe formation of gluten affects the texture of the baked goods. Gluten's attainable elasticity is proportional to its content of glutenins with low molecular weights as this portion contains the preponderance of the sulfur atoms responsible for the cross-linking in the network.\nMore refining (of the gluten) leads to chewier products such as pizza and bagels, while less refining yields tender baked goods such as pastry products.\n\nGenerally, bread flours are high in gluten (hard wheat); pastry flours have a lower gluten content. Kneading promotes the formation of gluten strands and cross-links, creating baked products that are chewier (in contrast to crumbly). The \"chewiness\" increases as the dough is kneaded for longer times. An increased moisture content in the dough enhances gluten development, and very wet doughs left to rise for a long time require no kneading (see no-knead bread). Shortening inhibits formation of cross-links and is used, along with diminished water and less kneading, when a tender and flaky product, such as a pie crust, is desired.\n\nThe strength and elasticity of gluten in flour is measured in the baking industry using a farinograph. This gives the baker a measurement of quality for different varieties of flours in developing recipes for various baked goods.\n\nAdded gluten \n\nAccording to Understanding Baking, gluten, when dried, milled and added to ordinary flour dough, could help improve the dough's ability to increase in volume. The resulted mixture also increases the bread's structural stability and chewiness.   Gluten-added dough must be worked vigorously to induce it to rise to its full capacity; an automatic bread machine or food processor may be required for high-gluten kneading. Generally, higher gluten levels are associated with higher amounts of overall protein. \n\nImitation meats\n\nGluten, especially wheat gluten, is often the basis for imitation meats resembling beef, chicken, duck (see mock duck), fish, and pork. When cooked in broth, gluten absorbs some of the surrounding liquid (including the flavor) and becomes firm to the bite.Bates, Dorothy, R.; Wingate, Colby. 1993. \"Cooking with Gluten and Seitan.\" Summertown, Tennessee: The Book Publishing Co. 128 p\n\nOther consumer products\n\nGluten is often present in beer and soy sauce, and can be used as a stabilizing agent in more unexpected food products, such as ice cream and ketchup. Foods of this kind may raise a problem for a small number of consumers because the hidden gluten constitutes a hazard for people with celiac disease.\n\nGluten is also used in cosmetics, hair products, and other dermatological preparations.\n\nAnimal feed\n\nThe protein content of some pet foods may also be enhanced by adding gluten.\n\nAdverse reactions \n\nGluten-related disorders is the umbrella term for all diseases triggered by gluten, which include celiac disease (CD), non-celiac gluten sensitivity (NCGS), wheat allergy, gluten ataxia, and dermatitis herpetiformis (DH). Currently, their incidence is increasing in most geographic areas of the world.  It can be explained possibly by the growing westernization of diet, increasing use of wheat-based foods included in the Mediterranean diet, the progressive replacement of rice by wheat in many countries in Asia, the Middle East, and North Africa, the development in recent years of new types of wheat with a higher amount of cytotoxic gluten peptides, and the higher content of gluten in bread and bakery products, due to the reduction of dough fermentation time.\n\nCeliac disease \n\nCeliac disease (CD) is an autoimmune disorder primarily affecting the small intestine caused by the ingestion of wheat, barley, rye, and derivatives, that appears in genetically predisposed people of all ages. CD is not only a gastrointestinal disease, because it may involve several organs and cause an extensive variety of non-gastrointestinal symptoms, and most importantly, it may often be completely asymptomatic. Added difficulties for diagnosis are the fact that serological markers (anti-tissue transglutaminase [TG2]) are not always present and many people may have minor mucosal lesions, without atrophy of the intestinal villi.\n\nCD affects approximately 1–2% of the general population, but most cases remain unrecognized, undiagnosed and untreated, and at risk for serious long-term health complications. People may suffer severe disease symptoms and be subjected to extensive investigations for many years, before a proper diagnosis is achieved. Untreated CD may cause malabsorption, reduced quality of life, iron deficiency, osteoporosis, an increased risk of intestinal lymphomas, and greater mortality. CD is associated with some other autoimmune diseases, such as diabetes mellitus type 1, thyroiditis, gluten ataxia, psoriasis, vitiligo, autoimmune hepatitis, dermatitis herpetiformis, primary sclerosing cholangitis, and more.\n\nCD with \"classic symptoms\", which include gastrointestinal manifestations such as chronic diarrhea and abdominal distention, malabsorption, loss of appetite, and impaired growth, is currently the least common presentation form of the disease and affects predominantly small children generally younger than two years of age.\n\nCD with \"non-classic symptoms\" is the most common clinical type and occurs in older children (over 2 years old), adolescents, and adults. It is characterized by milder or even absent gastrointestinal symptoms and a wide spectrum of non-intestinal manifestations that can involve any organ of the body, and very frequently may be completely asymptomatic both in children (at least in 43% of the cases) and adults.\n\nNon-celiac gluten sensitivity \n\nNon-celiac gluten sensitivity (NCGS) is described as a condition of multiple symptoms that improves when switching to a gluten-free diet, after celiac disease and wheat allergy are excluded. Recognized since 2010, it is included among gluten-related disorders, but its pathogenesis is not yet well understood. NCGS is the most common syndrome of gluten intolerance, with a prevalence estimated to be 6-10%. People with NCGS remain habitually in a \"no man's land\", without being recognized by the specialists and lacking the adequate medical care and treatment. Most of these people have a long history of health complaints and unsuccessful consultations with numerous physicians, and this is the reason why the majority of them end up resorting to a gluten-free diet and a self-diagnosis of gluten sensitivity.\n\nPeople with NCGS may develop gastrointestinal symptoms, which resemble those of irritable bowel syndrome or wheat allergy, or a wide variety of non-gastrointestinal symptoms, such as headache, chronic fatigue, fibromyalgia, atopic diseases, allergies, neurological diseases, or psychiatric disorders, among others.\n\nBesides gluten, additional components present in wheat, rye, barley, and their derivatives, including other proteins and short-chain carbohydrates called FODMAPs, may cause NCGS symptoms. The effects of FODMAPs are only limited to gastrointestinal discomfort.\n\nWheat allergy \n\nPeople can also experience adverse effects of wheat as result of a wheat allergy. As with most allergies, a wheat allergy causes the immune system to abnormally respond to a component of wheat that it treats as a threatening foreign body. This immune response is often time-limited and does not cause lasting harm to body tissues. Wheat allergy and celiac disease are different disorders. Gastrointestinal symptoms of wheat allergy are similar to those of celiac disease and non-celiac gluten sensitivity, but there is a different interval between exposure to wheat and onset of symptoms. An allergic reaction to wheat has a fast onset (from minutes to hours) after the consumption of food containing wheat and could include anaphylaxis.\n\nGluten ataxia \n\nGluten ataxia is an autoimmune disease triggered by the ingestion of gluten. With gluten ataxia, damage takes place in the cerebellum, the balance center of the brain that controls coordination and complex movements like walking, speaking and swallowing, with loss of Purkinje cells. People with gluten ataxia usually present gait abnormality or incoordination and tremor of the upper limbs. Gaze-evoked nystagmus and other ocular signs of cerebellar dysfunction are common. Myoclonus, palatal tremor, and opsoclonus-myoclonus may also appear.\n\nEarly diagnosis and treatment with a gluten-free diet can improve ataxia and prevent its progression. The effectiveness of the treatment depends on the elapsed time from the onset of the ataxia until diagnosis, because the death of neurons in the cerebellum as a result of gluten exposure is irreversible. \n\nGluten ataxia accounts for 40% of ataxias of unknown origin and 15% of all ataxias.  Less than 10% of people with gluten ataxia present any gastrointestinal symptom, yet about 40% have intestinal damage.\n\nLabelling\n\nInternational standards\n\nThe Codex Alimentarius international standards for food labelling has a standard relating to the labelling of products as \"gluten-free\". It only applies to foods that would normally contain gluten.\n\nBrazil\n\nBy law in Brazil, all food products must display labels clearly indicating whether or not they contain gluten.\n\nCanada\n\nThe Canadian Celiac Association estimates that one in 133 Canadians experiences adverse symptoms from gluten in celiac disease. Labels for all food products sold in Canada must clearly identify the presence of gluten if it is present at a level greater than 20 parts per million.\n\nEuropean Union\n\nIn the European Union, all prepackaged foods and non-prepacked foods from a restaurant, take-out food wrapped just before sale, or unpackaged food served in institutions must be identified if gluten-free. \"Gluten-free\" is defined as 20 parts per million of gluten or less and \"very low gluten\" is 100 parts per million of gluten or less; only foods with cereal ingredients processed to remove gluten can claim \"very low gluten\" on labels.\n\nAll foods containing gluten as an ingredient must be labelled accordingly as gluten is defined as one of the 14 recognised EU allergens.\n\nUnited States\n\nIn the United States, gluten is not listed on labels unless added as a stand-alone ingredient. Wheat or other allergens are listed after the ingredient line. The US Food and Drug Administration (FDA) has historically classified gluten as \"generally recognized as safe\" (GRAS). In August 2013, FDA issued a final rule, effective August 2014, that defined the term \"gluten-free\" for voluntary use in the labeling of foods as meaning that the amount of gluten contained in the food is below 20 parts per million.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gluten" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13152" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gluten (from Latin gluten, \"glue\") is a composite of storage proteins termed prolamins and glutelins and stored together with starch in the endosperm (which nourishes the embryonic plant during germination) of various cereal (grass) grains. It is found in wheat, barley, rye, oats, related species and hybrids (such as spelt, khorasan, emmer, einkorn, triticale, kamut, etc.) and products of these (such as malt). Glutens, and most especially the Triticeae glutens, are appreciated for their viscoelastic properties. It gives elasticity to dough, helping it rise and keep its shape and often gives the final product a chewy texture.\n\nWheat prolamins are called gliadins, barley prolamins are hordeins, rye prolamins are secalins and oats prolamins are avenins, which are collectively named gluten. Wheat glutelins are called glutenin. In a small part of the general population, gluten can trigger coeliac disease, non-coeliac gluten sensitivity, gluten ataxia and dermatitis herpetiformis. The occurrence of oat avenin toxicity in people with gluten-related disorders depends on the oat cultivar consumed, because the immunoreactivities of toxic prolamins are different among oat varieties. Also, many oat products are cross-contaminated with other gluten-containing cereals.\n\nTrue gluten is limited to the grains listed above. The stored proteins of maize and rice are sometimes called glutens, but their proteins differ from true gluten.\n\nPreparation \n\nGluten is a protein complex that accounts for 75 to 85% of the total protein in bread wheat. Gluten is prepared from flour by kneading the flour under water, agglomerating the gluten into an elastic network, a dough, and then washing out the starch. Starch granules disperse in cold/low-temperature water, and the dispersed starch is sedimented and dried. If a saline solution is used instead of water, a purer protein is obtained, with certain harmless impurities departing to the solution with the starch. Where starch is the prime product, cold water is the favored solvent because the impurities depart from the gluten.\n\nIn home or restaurant cooking, a ball of wheat flour dough is kneaded under water until the starch disperses out. In industrial production, a slurry of wheat flour is kneaded vigorously by machinery until the gluten agglomerates into a mass. This mass is collected by centrifugation, then transported through several stages integrated in a continuous process. About 65% of the water in the wet gluten is removed by means of a screw press; the remainder is sprayed through an atomizer nozzle into a drying chamber, where it remains at an elevated temperature a short time to evaporate the water without denaturing the gluten. The process yields a flour-like powder with a 7% moisture content, which is air cooled and pneumatically transported to a receiving vessel. In the final step, the processed gluten is sifted and milled to produce a uniform product.\n\nUses \n\nBread products\n\nGluten forms when glutenin molecules cross-link to form a submicroscopic network attached to gliadin, which contributes viscosity (thickness) and extensibility to the mix.\n \n If this dough is leavened with yeast, fermentation produces carbon dioxide bubbles, which, trapped by the gluten network, cause the dough to rise. Baking coagulates the gluten, which, along with starch, stabilizes the shape of the final product. Gluten content has been implicated as a factor in the staling of bread, possibly because it binds water through hydration.\nSahlstrom, S. & Brathen, E. (1997). \"Effects of enzyme preparations for baking, mixing time and resting time on bread quality and bread staling\". Food Chemistry, 58, 1, 75-80. Effects of wheat variety and processing conditions in experimental bread-baking studied by univariate and multivariate analysis.\n\nThe formation of gluten affects the texture of the baked goods. Gluten's attainable elasticity is proportional to its content of glutenins with low molecular weights as this portion contains the preponderance of the sulfur atoms responsible for the cross-linking in the network.\nMore refining (of the gluten) leads to chewier products such as pizza and bagels, while less refining yields tender baked goods such as pastry products.\n\nGenerally, bread flours are high in gluten (hard wheat); pastry flours have a lower gluten content. Kneading promotes the formation of gluten strands and cross-links, creating baked products that are chewier (in contrast to crumbly). The \"chewiness\" increases as the dough is kneaded for longer times. An increased moisture content in the dough enhances gluten development, and very wet doughs left to rise for a long time require no kneading (see no-knead bread). Shortening inhibits formation of cross-links and is used, along with diminished water and less kneading, when a tender and flaky product, such as a pie crust, is desired.\n\nThe strength and elasticity of gluten in flour is measured in the baking industry using a farinograph. This gives the baker a measurement of quality for different varieties of flours in developing recipes for various baked goods.\n\nAdded gluten \n\nAccording to Understanding Baking, gluten, when dried, milled and added to ordinary flour dough, could help improve the dough's ability to increase in volume. The resulted mixture also increases the bread's structural stability and chewiness.   Gluten-added dough must be worked vigorously to induce it to rise to its full capacity; an automatic bread machine or food processor may be required for high-gluten kneading. Generally, higher gluten levels are associated with higher amounts of overall protein. \n\nImitation meats\n\nGluten, especially wheat gluten, is often the basis for imitation meats resembling beef, chicken, duck (see mock duck), fish, and pork. When cooked in broth, gluten absorbs some of the surrounding liquid (including the flavor) and becomes firm to the bite.Bates, Dorothy, R.; Wingate, Colby. 1993. \"Cooking with Gluten and Seitan.\" Summertown, Tennessee: The Book Publishing Co. 128 p\n\nOther consumer products\n\nGluten is often present in beer and soy sauce, and can be used as a stabilizing agent in more unexpected food products, such as ice cream and ketchup. Foods of this kind may raise a problem for a small number of consumers because the hidden gluten constitutes a hazard for people with celiac disease.\n\nGluten is also used in cosmetics, hair products, and other dermatological preparations.\n\nAnimal feed\n\nThe protein content of some pet foods may also be enhanced by adding gluten.\n\nAdverse reactions \n\nGluten-related disorders is the umbrella term for all diseases triggered by gluten, which include celiac disease (CD), non-celiac gluten sensitivity (NCGS), wheat allergy, gluten ataxia, and dermatitis herpetiformis (DH). Currently, their incidence is increasing in most geographic areas of the world.  It can be explained possibly by the growing westernization of diet, increasing use of wheat-based foods included in the Mediterranean diet, the progressive replacement of rice by wheat in many countries in Asia, the Middle East, and North Africa, the development in recent years of new types of wheat with a higher amount of cytotoxic gluten peptides, and the higher content of gluten in bread and bakery products, due to the reduction of dough fermentation time.\n\nCeliac disease \n\nCeliac disease (CD) is an autoimmune disorder primarily affecting the small intestine caused by the ingestion of wheat, barley, rye, and derivatives, that appears in genetically predisposed people of all ages. CD is not only a gastrointestinal disease, because it may involve several organs and cause an extensive variety of non-gastrointestinal symptoms, and most importantly, it may often be completely asymptomatic. Added difficulties for diagnosis are the fact that serological markers (anti-tissue transglutaminase [TG2]) are not always present and many people may have minor mucosal lesions, without atrophy of the intestinal villi.\n\nCD affects approximately 1–2% of the general population, but most cases remain unrecognized, undiagnosed and untreated, and at risk for serious long-term health complications. People may suffer severe disease symptoms and be subjected to extensive investigations for many years, before a proper diagnosis is achieved. Untreated CD may cause malabsorption, reduced quality of life, iron deficiency, osteoporosis, an increased risk of intestinal lymphomas, and greater mortality. CD is associated with some other autoimmune diseases, such as diabetes mellitus type 1, thyroiditis, gluten ataxia, psoriasis, vitiligo, autoimmune hepatitis, dermatitis herpetiformis, primary sclerosing cholangitis, and more.\n\nCD with \"classic symptoms\", which include gastrointestinal manifestations such as chronic diarrhea and abdominal distention, malabsorption, loss of appetite, and impaired growth, is currently the least common presentation form of the disease and affects predominantly small children generally younger than two years of age.\n\nCD with \"non-classic symptoms\" is the most common clinical type and occurs in older children (over 2 years old), adolescents, and adults. It is characterized by milder or even absent gastrointestinal symptoms and a wide spectrum of non-intestinal manifestations that can involve any organ of the body, and very frequently may be completely asymptomatic both in children (at least in 43% of the cases) and adults.\n\nNon-celiac gluten sensitivity \n\nNon-celiac gluten sensitivity (NCGS) is described as a condition of multiple symptoms that improves when switching to a gluten-free diet, after celiac disease and wheat allergy are excluded. Recognized since 2010, it is included among gluten-related disorders, but its pathogenesis is not yet well understood. NCGS is the most common syndrome of gluten intolerance, with a prevalence estimated to be 6-10%. People with NCGS remain habitually in a \"no man's land\", without being recognized by the specialists and lacking the adequate medical care and treatment. Most of these people have a long history of health complaints and unsuccessful consultations with numerous physicians, and this is the reason why the majority of them end up resorting to a gluten-free diet and a self-diagnosis of gluten sensitivity.\n\nPeople with NCGS may develop gastrointestinal symptoms, which resemble those of irritable bowel syndrome or wheat allergy, or a wide variety of non-gastrointestinal symptoms, such as headache, chronic fatigue, fibromyalgia, atopic diseases, allergies, neurological diseases, or psychiatric disorders, among others.\n\nBesides gluten, additional components present in wheat, rye, barley, and their derivatives, including other proteins and short-chain carbohydrates called FODMAPs, may cause NCGS symptoms. The effects of FODMAPs are only limited to gastrointestinal discomfort.\n\nWheat allergy \n\nPeople can also experience adverse effects of wheat as result of a wheat allergy. As with most allergies, a wheat allergy causes the immune system to abnormally respond to a component of wheat that it treats as a threatening foreign body. This immune response is often time-limited and does not cause lasting harm to body tissues. Wheat allergy and celiac disease are different disorders. Gastrointestinal symptoms of wheat allergy are similar to those of celiac disease and non-celiac gluten sensitivity, but there is a different interval between exposure to wheat and onset of symptoms. An allergic reaction to wheat has a fast onset (from minutes to hours) after the consumption of food containing wheat and could include anaphylaxis.\n\nGluten ataxia \n\nGluten ataxia is an autoimmune disease triggered by the ingestion of gluten. With gluten ataxia, damage takes place in the cerebellum, the balance center of the brain that controls coordination and complex movements like walking, speaking and swallowing, with loss of Purkinje cells. People with gluten ataxia usually present gait abnormality or incoordination and tremor of the upper limbs. Gaze-evoked nystagmus and other ocular signs of cerebellar dysfunction are common. Myoclonus, palatal tremor, and opsoclonus-myoclonus may also appear.\n\nEarly diagnosis and treatment with a gluten-free diet can improve ataxia and prevent its progression. The effectiveness of the treatment depends on the elapsed time from the onset of the ataxia until diagnosis, because the death of neurons in the cerebellum as a result of gluten exposure is irreversible. \n\nGluten ataxia accounts for 40% of ataxias of unknown origin and 15% of all ataxias.  Less than 10% of people with gluten ataxia present any gastrointestinal symptom, yet about 40% have intestinal damage.\n\nLabelling\n\nInternational standards\n\nThe Codex Alimentarius international standards for food labelling has a standard relating to the labelling of products as \"gluten-free\". It only applies to foods that would normally contain gluten.\n\nBrazil\n\nBy law in Brazil, all food products must display labels clearly indicating whether or not they contain gluten.\n\nCanada\n\nThe Canadian Celiac Association estimates that one in 133 Canadians experiences adverse symptoms from gluten in celiac disease. Labels for all food products sold in Canada must clearly identify the presence of gluten if it is present at a level greater than 20 parts per million.\n\nEuropean Union\n\nIn the European Union, all prepackaged foods and non-prepacked foods from a restaurant, take-out food wrapped just before sale, or unpackaged food served in institutions must be identified if gluten-free. \"Gluten-free\" is defined as 20 parts per million of gluten or less and \"very low gluten\" is 100 parts per million of gluten or less; only foods with cereal ingredients processed to remove gluten can claim \"very low gluten\" on labels.\n\nAll foods containing gluten as an ingredient must be labelled accordingly as gluten is defined as one of the 14 recognised EU allergens.\n\nUnited States\n\nIn the United States, gluten is not listed on labels unless added as a stand-alone ingredient. Wheat or other allergens are listed after the ingredient line. The US Food and Drug Administration (FDA) has historically classified gluten as \"generally recognized as safe\" (GRAS). In August 2013, FDA issued a final rule, effective August 2014, that defined the term \"gluten-free\" for voluntary use in the labeling of foods as meaning that the amount of gluten contained in the food is below 20 parts per million. Gluten. http://en.wikipedia.org/?curid=13152."
  }
}
