{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10687",
  "eid" : "f71a5ff0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778494319,
  "textBody" : "A frisbee (also called a flying disc or simply a disc) is a gliding toy or sporting item that is generally plastic and roughly 20 to in diameter with a lip,The word \"disc\" is commonly spelled with either a \"c\" (\"disc\") or a \"k\" (\"disk\"). used recreationally and competitively for throwing and catching, for example, in flying disc games. The shape of the disc, an airfoil in cross-section, allows it to fly by generating lift as it moves through the air while spinning.\n\nFlying discs are thrown and caught for free-form (freestyle) recreation and as part of many flying disc games. A wide range of flying disc variants are available commercially. Disc golf discs are usually smaller but denser and tailored for particular flight profiles to increase/decrease stability and distance. The longest recorded disc throw is by David Wiggins, Jr. with a distance of 338.0 meters. Disc dog sports use relatively slow flying discs made of more pliable material to better resist a dog's bite and prevent injury to the dog. Flying rings are also available; they typically travel significantly farther than any traditional flying disc. There are also illuminated discs meant for nighttime play—they are made of a phosphorescent plastic or contain battery-powered light-emitting diodes or chemiluminescent glowing sticks. Others whistle when they reach a certain velocity in flight.\n\nLift is generated in the same way as a traditional airfoil. The rotating frisbee has a nearly vertical angular momentum vector, stabilizing its angle of attack via gyroscopic action. If the disc were not spinning, it would crash to the ground. When the disc is spinning, however, aerodynamic torque instead leads to precess about the spin axis, causing its trajectory to curve to the left or the right. Most discs are designed to be aerodynamically stable so that this roll is accurate for a fairly broad range of velocities and rates of spin. Many disc golf discs, however, are intentionally designed to be unstable. Higher rates of spin lead to more stability, and, for a given rate of spin, there is generally a range of velocities that are stable. Even a slight deformation in a disc (called a \"taco,\" which in extreme cases looks like a taco shell) can cause negative effects when throwing long range. A disk can be checked for these deformations by holding it horizontally at eye level and looking at the rim while slowly turning it.\n\nThe term frisbee, often used to generically describe all flying discs, is a registered trademark of the Wham-O toy company. Though such use is not encouraged by the company, the common use of the name as a generic term has put the trademark in jeopardy; accordingly, many \"Frisbee\" games are now known as \"disc\" games, like ultimate or disc golf.[http://cyber.law.harvard.edu/metaschool/fisher/domain/tm.htm#6 Overview of Trademark Law: Can trademark rights be lost?][http://www.finnegan.com/resources/articles/articlesdetail.aspx?news=f2bab1ee-ca17-465b-afd5-0281d2b712f3 Losing Grip on the Frisbee]\n\nHistory\n\nHumans have been tossing disc-shaped objects since time immemorial. Fred Morrison discovered a market for the modern-day flying disc in 1938 when he and future wife, Lucile, were offered 25 cents for a cake pan that they were tossing back and forth on a beach near Los Angeles, CA. \"That got the wheels turning, because you could buy a cake pan for five cents, and if people on the beach were willing to pay a quarter for it, well—there was a business,\" Morrison told The Virginian-Pilot newspaper in 2007.\n\nThe Morrisons continued their business until World War ll, when Morrison served in the Army Air Force, flying P-47s, and then was a prisoner of war. Mustered out, Morrison sketched a design for an aerodynamically improved flying disc that he called the Whirlo-Way. By 1948, after design modifications and experimentation with several prototypes, Morrison and business partner Warren Franscioni began producing the first plastic discs, renaming them the Flyin-Saucer in the wake of reported unidentified flying object-sightings.\n\n\"We worked fairs, demonstrating it,\" Morrison told the Virginian-Pilot. The two of them once overheard someone saying the pair were using wires to make the discs hover, so they developed a sales pitch: \"The Flyin-Saucer is free, but the invisible wire is $1.\" \"That's where we learned we could sell these things,\" he said, because people were enthusiastic about them.\n\nMorrison and Franscioni ended their partnership in early 1950, and in 1954 Morrison formed his own company, called American Trends, to buy and sell Flyin Saucers, which were by then being made of a flexible polypropylene plastic by Southern California Plastics, the original molder. After learning that he could produce his own disc more cheaply, in 1955 Morrison designed a new model, the Pluto Platter, the archetype of all modern flying discs. He sold the rights to Wham-O on January 23, 1957, and in 1958 Morrison was awarded U.S. Design Patent D183,626 for his product.\n\nIn June 1957, Wham-O co-founders Richard Knerr and Arthur \"Spud\" Melin decided to stimulate sales by giving the discs the additional brand name Frisbee (pronounced \"friz'-bee\"), after learning that Northeastern college students were calling the Pluto Platter by that name, the term \"Frisbee\" coming from the name of the Connecticut-based pie manufacturer, Frisbie Pie Company, which supplied pies to Yale University, where students started the campus craze by tossing empty pie tins stamped with the company's logo. \"I thought the name was a horror. Terrible,\" Morrison told The Press-Enterprise of Riverside in 2007. In 1982, Morrison told Forbes magazine that he had received about US$2 million in royalty payments and said: \"I wouldn't change the name of it for the world.\"\n\nThe man behind the Frisbee's phenomenal success, however, was Edward \"Steady Ed\" Headrick (Pasadena, Cal., June 28, 1924 – La Selva Beach, Cal., August 12, 2002), hired in 1964 as Wham-O's new general manager and vice president in charge of marketing. Headrick soon redesigned the Pluto Platter by reworking the mold, mainly to remove the names of the planets, but in the process, fortuitously increasing the rim thickness and mass, creating a more controllable disc that could be thrown more accurately. Fred Morrison: \"Headrick had an eye for product design.... The \"NEW LOOK\" contributed mightily to its phenomenal success.... I've never known what financial arrangements Headrick had with Wham-O. It would have been interesting to know, but knowing wouldn't have changed anything. It was enough to know that under Headrick's guidance our increasing bank account was due to what he was doing.\"\n\nSales skyrocketed for the toy, which was marketed as a new sport. In 1964, the first professional model went on sale. Headrick patented the new design, highlighting the new raised ridges (the \"Rings of Headrick\") that claimed to stabilized flight and marketed and pushed the Professional Model Frisbee and \"Frisbee\" as a sport. (U.S. Patent 3,359,678).[http://inventors.about.com/library/weekly/aa980218.htm The First Flight of the Frisbee: The History of the Frisbee]\n\nHeadrick, who became known as the father of Frisbee sports, later founded the International Frisbee Association and appointed Dan \"Stork\" Roddick as head of it. Stork began establishing North American Series (NAS) tournament standards for various Frisbee sports, such as Freestyle, Guts, Double Disc Court and Over-all events. Headrick later helped to develop the sport of disc golf by inventing standardized targets called \"pole holes\", that was first played with Frisbees and later with more aerodynamic beveled rim discs. Upon his death, Headrick was cremated, and, as requested by him, his ashes were molded into memorial discs and given to family and close friends[http://www.findagrave.com/cgi-bin/fg.cgi?pagegr&GRid\n6684592 \"Edward 'Steady Ed' Headrick\"] Find A Grave. and sold to benefit The Ed Headrick Memorial Museum.[http://www.discgolf.com/disc-golf-discs/steady-ed-memorial-discs/ Steady Ed Memorial Discs] Disc Golf Association\n\nEnthusiasts founded the International Frisbee Association in 1967, and the next year, the Frisbee Golf Tournament began in Kalamazoo. Also in 1967, some New Jersey teenagers invented Ultimate Frisbee, a game that is still played enthusiastically today. All this attention for Frisbees certainly made it a hot commodity with sales reaching 100 million Frisbees by 1994 and later in 1998 the Frisbee was inducted into the National Toy Hall of Fame. Today they are very popular toys.[http://wham-o.com/brands/frisbee_disc.html \"Wham-O Frisbee Disc\"]\n\nDisc sports\n\nGuts\n\nThe game of guts was invented by the Healy Brothers in the 1950s and developed at the International Frisbee Tournament (IFT) in Eagle Harbor, Michigan. Two teams of one to five team members stand in parallel lines facing each other across a court and throw flying discs at members of the opposing team.\n\nDouble disc court\n\nDouble disc court was invented and introduced in the early 1970s by Jim Palmeri, a sport played with two flying discs and two teams of two players. Each team defends its court and tries to land a flying disc in the opposing court.\n\nDisc golf\n\nThis is a precision and accuracy sport in which individual players throw a flying disc at a target pole hole. In 1926, In Bladworth, Saskatchewan, Canada, Ronald Gibson and a group of his Bladworth Elementary school chums played a game using metal lids, they called “Tin Lid Golf.” In 1976, the game of disc golf was standardized with targets called \"pole holes\" invented and developed by Wham-O's Ed Headrick.\n\nFreestyle competition\n\nIn 1974, freestyle competition was created and introduced by Ken Westerfield and Discrafts Jim Kenner. Teams of two or three players are judged as they perform a routine that consists of a series of creative throwing and catching techniques set to music.\n\nUltimate\n\nThe most widely played disc game began in the late 1960s with Joel Silver and Jared Kass. In the 1970s it developed as an organized sport with the creation of the Ultimate Players Association by Dan Roddick, Tom Kennedy and Irv Kalb. The object of the game is to advance the disc and score points by eventually passing the disc to a team member in the opposing team’s end zone. Players may not run while holding the disc.\n\nGoaltimate\n\nA half-court disc game derived from Ultimate, similar to hot box. The object is to advance the disc on the field of play by passing, and score points by throwing the flying disc to a teammate in a small scoring area.\n\nDisc dog\n\nDogs and their human flying disc throwers compete in events such as distance catching and somewhat choreographed freestyle catching.\n\nKanJam\n\nA patented game scoring points by throwing and deflecting the flying disc and hitting or entering the goal. The game ends when a team scores exactly 21 points or \"chogs\" the disc for an instant win.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Frisbee" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10687" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A frisbee (also called a flying disc or simply a disc) is a gliding toy or sporting item that is generally plastic and roughly 20 to in diameter with a lip,The word \"disc\" is commonly spelled with either a \"c\" (\"disc\") or a \"k\" (\"disk\"). used recreationally and competitively for throwing and catching, for example, in flying disc games. The shape of the disc, an airfoil in cross-section, allows it to fly by generating lift as it moves through the air while spinning.\n\nFlying discs are thrown and caught for free-form (freestyle) recreation and as part of many flying disc games. A wide range of flying disc variants are available commercially. Disc golf discs are usually smaller but denser and tailored for particular flight profiles to increase/decrease stability and distance. The longest recorded disc throw is by David Wiggins, Jr. with a distance of 338.0 meters. Disc dog sports use relatively slow flying discs made of more pliable material to better resist a dog's bite and prevent injury to the dog. Flying rings are also available; they typically travel significantly farther than any traditional flying disc. There are also illuminated discs meant for nighttime play—they are made of a phosphorescent plastic or contain battery-powered light-emitting diodes or chemiluminescent glowing sticks. Others whistle when they reach a certain velocity in flight.\n\nLift is generated in the same way as a traditional airfoil. The rotating frisbee has a nearly vertical angular momentum vector, stabilizing its angle of attack via gyroscopic action. If the disc were not spinning, it would crash to the ground. When the disc is spinning, however, aerodynamic torque instead leads to precess about the spin axis, causing its trajectory to curve to the left or the right. Most discs are designed to be aerodynamically stable so that this roll is accurate for a fairly broad range of velocities and rates of spin. Many disc golf discs, however, are intentionally designed to be unstable. Higher rates of spin lead to more stability, and, for a given rate of spin, there is generally a range of velocities that are stable. Even a slight deformation in a disc (called a \"taco,\" which in extreme cases looks like a taco shell) can cause negative effects when throwing long range. A disk can be checked for these deformations by holding it horizontally at eye level and looking at the rim while slowly turning it.\n\nThe term frisbee, often used to generically describe all flying discs, is a registered trademark of the Wham-O toy company. Though such use is not encouraged by the company, the common use of the name as a generic term has put the trademark in jeopardy; accordingly, many \"Frisbee\" games are now known as \"disc\" games, like ultimate or disc golf.[http://cyber.law.harvard.edu/metaschool/fisher/domain/tm.htm#6 Overview of Trademark Law: Can trademark rights be lost?][http://www.finnegan.com/resources/articles/articlesdetail.aspx?news=f2bab1ee-ca17-465b-afd5-0281d2b712f3 Losing Grip on the Frisbee]\n\nHistory\n\nHumans have been tossing disc-shaped objects since time immemorial. Fred Morrison discovered a market for the modern-day flying disc in 1938 when he and future wife, Lucile, were offered 25 cents for a cake pan that they were tossing back and forth on a beach near Los Angeles, CA. \"That got the wheels turning, because you could buy a cake pan for five cents, and if people on the beach were willing to pay a quarter for it, well—there was a business,\" Morrison told The Virginian-Pilot newspaper in 2007.\n\nThe Morrisons continued their business until World War ll, when Morrison served in the Army Air Force, flying P-47s, and then was a prisoner of war. Mustered out, Morrison sketched a design for an aerodynamically improved flying disc that he called the Whirlo-Way. By 1948, after design modifications and experimentation with several prototypes, Morrison and business partner Warren Franscioni began producing the first plastic discs, renaming them the Flyin-Saucer in the wake of reported unidentified flying object-sightings.\n\n\"We worked fairs, demonstrating it,\" Morrison told the Virginian-Pilot. The two of them once overheard someone saying the pair were using wires to make the discs hover, so they developed a sales pitch: \"The Flyin-Saucer is free, but the invisible wire is $1.\" \"That's where we learned we could sell these things,\" he said, because people were enthusiastic about them.\n\nMorrison and Franscioni ended their partnership in early 1950, and in 1954 Morrison formed his own company, called American Trends, to buy and sell Flyin Saucers, which were by then being made of a flexible polypropylene plastic by Southern California Plastics, the original molder. After learning that he could produce his own disc more cheaply, in 1955 Morrison designed a new model, the Pluto Platter, the archetype of all modern flying discs. He sold the rights to Wham-O on January 23, 1957, and in 1958 Morrison was awarded U.S. Design Patent D183,626 for his product.\n\nIn June 1957, Wham-O co-founders Richard Knerr and Arthur \"Spud\" Melin decided to stimulate sales by giving the discs the additional brand name Frisbee (pronounced \"friz'-bee\"), after learning that Northeastern college students were calling the Pluto Platter by that name, the term \"Frisbee\" coming from the name of the Connecticut-based pie manufacturer, Frisbie Pie Company, which supplied pies to Yale University, where students started the campus craze by tossing empty pie tins stamped with the company's logo. \"I thought the name was a horror. Terrible,\" Morrison told The Press-Enterprise of Riverside in 2007. In 1982, Morrison told Forbes magazine that he had received about US$2 million in royalty payments and said: \"I wouldn't change the name of it for the world.\"\n\nThe man behind the Frisbee's phenomenal success, however, was Edward \"Steady Ed\" Headrick (Pasadena, Cal., June 28, 1924 – La Selva Beach, Cal., August 12, 2002), hired in 1964 as Wham-O's new general manager and vice president in charge of marketing. Headrick soon redesigned the Pluto Platter by reworking the mold, mainly to remove the names of the planets, but in the process, fortuitously increasing the rim thickness and mass, creating a more controllable disc that could be thrown more accurately. Fred Morrison: \"Headrick had an eye for product design.... The \"NEW LOOK\" contributed mightily to its phenomenal success.... I've never known what financial arrangements Headrick had with Wham-O. It would have been interesting to know, but knowing wouldn't have changed anything. It was enough to know that under Headrick's guidance our increasing bank account was due to what he was doing.\"\n\nSales skyrocketed for the toy, which was marketed as a new sport. In 1964, the first professional model went on sale. Headrick patented the new design, highlighting the new raised ridges (the \"Rings of Headrick\") that claimed to stabilized flight and marketed and pushed the Professional Model Frisbee and \"Frisbee\" as a sport. (U.S. Patent 3,359,678).[http://inventors.about.com/library/weekly/aa980218.htm The First Flight of the Frisbee: The History of the Frisbee]\n\nHeadrick, who became known as the father of Frisbee sports, later founded the International Frisbee Association and appointed Dan \"Stork\" Roddick as head of it. Stork began establishing North American Series (NAS) tournament standards for various Frisbee sports, such as Freestyle, Guts, Double Disc Court and Over-all events. Headrick later helped to develop the sport of disc golf by inventing standardized targets called \"pole holes\", that was first played with Frisbees and later with more aerodynamic beveled rim discs. Upon his death, Headrick was cremated, and, as requested by him, his ashes were molded into memorial discs and given to family and close friends[http://www.findagrave.com/cgi-bin/fg.cgi?pagegr&GRid\n6684592 \"Edward 'Steady Ed' Headrick\"] Find A Grave. and sold to benefit The Ed Headrick Memorial Museum.[http://www.discgolf.com/disc-golf-discs/steady-ed-memorial-discs/ Steady Ed Memorial Discs] Disc Golf Association\n\nEnthusiasts founded the International Frisbee Association in 1967, and the next year, the Frisbee Golf Tournament began in Kalamazoo. Also in 1967, some New Jersey teenagers invented Ultimate Frisbee, a game that is still played enthusiastically today. All this attention for Frisbees certainly made it a hot commodity with sales reaching 100 million Frisbees by 1994 and later in 1998 the Frisbee was inducted into the National Toy Hall of Fame. Today they are very popular toys.[http://wham-o.com/brands/frisbee_disc.html \"Wham-O Frisbee Disc\"]\n\nDisc sports\n\nGuts\n\nThe game of guts was invented by the Healy Brothers in the 1950s and developed at the International Frisbee Tournament (IFT) in Eagle Harbor, Michigan. Two teams of one to five team members stand in parallel lines facing each other across a court and throw flying discs at members of the opposing team.\n\nDouble disc court\n\nDouble disc court was invented and introduced in the early 1970s by Jim Palmeri, a sport played with two flying discs and two teams of two players. Each team defends its court and tries to land a flying disc in the opposing court.\n\nDisc golf\n\nThis is a precision and accuracy sport in which individual players throw a flying disc at a target pole hole. In 1926, In Bladworth, Saskatchewan, Canada, Ronald Gibson and a group of his Bladworth Elementary school chums played a game using metal lids, they called “Tin Lid Golf.” In 1976, the game of disc golf was standardized with targets called \"pole holes\" invented and developed by Wham-O's Ed Headrick.\n\nFreestyle competition\n\nIn 1974, freestyle competition was created and introduced by Ken Westerfield and Discrafts Jim Kenner. Teams of two or three players are judged as they perform a routine that consists of a series of creative throwing and catching techniques set to music.\n\nUltimate\n\nThe most widely played disc game began in the late 1960s with Joel Silver and Jared Kass. In the 1970s it developed as an organized sport with the creation of the Ultimate Players Association by Dan Roddick, Tom Kennedy and Irv Kalb. The object of the game is to advance the disc and score points by eventually passing the disc to a team member in the opposing team’s end zone. Players may not run while holding the disc.\n\nGoaltimate\n\nA half-court disc game derived from Ultimate, similar to hot box. The object is to advance the disc on the field of play by passing, and score points by throwing the flying disc to a teammate in a small scoring area.\n\nDisc dog\n\nDogs and their human flying disc throwers compete in events such as distance catching and somewhat choreographed freestyle catching.\n\nKanJam\n\nA patented game scoring points by throwing and deflecting the flying disc and hitting or entering the goal. The game ends when a team scores exactly 21 points or \"chogs\" the disc for an instant win. Frisbee. http://en.wikipedia.org/?curid=10687."
  }
}
