{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19735",
  "eid" : "3d87b3c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778612476,
  "textBody" : "Macquarie University is a public research university based in Sydney, Australia, in the suburb of Macquarie Park. Founded in 1964 by the New South Wales Government, it was the third university to be established in the metropolitan area of Sydney.\n\nEstablished as a verdant university, Macquarie has five faculties, as well as the Macquarie University Hospital and the Macquarie Graduate School of Management, which are located on the university's main campus in suburban Sydney.\n\nThe university is the first in Australia to fully align its degree system with the Bologna Accord.\n\nHistory\n\n20th century\n\nThe idea of founding a third university in Sydney was flagged in the early 1960s when the New South Wales Government formed a committee of enquiry into higher education to deal with a perceived emergency in university enrollments in New South Wales. During this enquiry, the Senate of the University of Sydney put in a submission which highlighted 'the immediate need to establish a third university in the metropolitan area'.Liberality of Opportunity, Mansfield and Hutchinson, p. 19 After much debate a future campus location was selected in what was then a semi-rural part of North Ryde, and it was decided that the future university be named after Lachlan Macquarie, an important early governor of the colony of New South Wales.\n\nMacquarie University was formally established in 1964 with the passage of the Macquarie University Act 1964 by the New South Wales parliament.\n\nThe initial concept of the campus was to create a new high technology corridor, similar to the area surrounding Stanford University in Palo Alto, California, the goal being to provide for interaction between industry and the new university.The Book of Sydney Suburbs, Compiled by Frances Pollon, Angus & Robertson Publishers, 1990, Published in Australia , page 189 The academic core was designed in the Brutalist style and developed by the renowned town planner Walter Abraham who also oversaw the next 20 years of planning and development for the university. A committee appointed to advise the state government on the establishment of the new university at North Ryde nominated Abraham as the architect-planner. The fledgling Macquarie University Council decided that planning for the campus would be done within the university, rather than by consultants, and this led to the establishment of the architect-planners office.\n\nThe first Vice-Chancellor of Macquarie University, Alexander George Mitchell, was selected by the University Council which met for the first time on 17 June 1964. Members of the first university council included: Colonel Sir Edward Ford OBE, David Paver Mellor, Rae Else-Mitchell QC and Sir Walter Scott.\n\nThe university first opened to students on 6 March 1967 with more students than anticipated. The Australian Universities Commission had allowed for 510 effective full-time students (EFTS) but Macquarie had 956 enrolments and 622 EFTS.Liberality of Opportunity, Mansfield and Hutchinson, p. 24 Between 1968 and 1969, enrolment at Macquarie increased dramatically with an extra 1200 EFTS, with 100 new academic staff employed. 1969 also saw the establishment of the Macquarie Graduate School of Management (MGSM).\n\nMacquarie grew during the seventies and eighties with rapid expansion in courses offered, student numbers and development of the site. In 1972, the university established the Macquarie Law School, the third law school in Sydney. In their book Liberality of Opportunity, Bruce Mansfield and Mark Hutchinson describe the founding of Macquarie University as 'an act of faith and a great experiment'.Liberality of Opportunity, Mansfield and Hutchinson, p. 317 An additional topic considered in this book is the science reform movement of the late 1970s that resulted in the introduction of a named science degree, thus facilitating the subsequent inclusion of other named degrees in addition to the traditional BA.Liberality of Opportunity, Mansfield and Hutchinson, pp. 268–271. An alternative \nview on this topic is given by theoretical physicist John Ward.J. C. Ward, Memoirs of a Theoretical Physicist (Optics Journal, Rochester, 2004).\n\nAfter over a decade of service, the first Vice Chancellor Professor Mitchell was succeeded by Professor Edwin Webb in December 1975. Professor Webb was required to steer the university through one of its most difficult periods as the value of universities were debated and the governments introduced significant funding cuts.\n\nProfessor Webb left the university in 1986 and was succeeded by Di Yerbury, the first female Vice-Chancellor in Australia. Professor Yerbury would go on to hold the position of Vice-Chancellor for nearly 20 years.\n\nIn 1990 the university absorbed the Institute of Early Childhood Studies of the Sydney College of Advanced Education, under the terms of the Higher Education (Amalgamation) Act 1989.l\n\n21st century\n\nProfessor Steven Schwartz replaced Di Yerbury at the beginning of 2006. Yerbury's departure was attended with much controversy, including a \"bitter dispute\" with Schwartz, disputed ownership of university artworks worth $13 million and Yerbury's salary package. In August 2006, Professor Schwartz expressed concern about the actions of Yerbury in a letter to university auditors. Yerbury strongly denied any wrongdoing and claimed the artworks were hers.\n\nDuring 2007, Macquarie University restructured its student organisation after an audit raised questions about management of hundreds of thousands of dollars in funds by student organisations At the centre of the investigation was Victor Ma, president of the Macquarie University Students' Council, who was previously involved in a high-profile case of student election fixing at the University of Sydney.\nThe university Council resolved to immediately remove Ma from his position. Vice-Chancellor Schwartz cited an urgent need to reform Macquarie's main student bodies.\nHowever, Ma strongly denied any wrongdoing and labelled the controversy a case of 'character assassination'.\nThe Federal Court ordered on 23 May 2007 that Macquarie University Union Ltd be wound up.\n\nFollowing the dissolution of Macquarie University Union Ltd, the outgoing student organisation was replaced with a new wholly owned subsidiary company of the university, known as U@MQ Ltd. The new student organisation originally lacked a true student representative union; however, following a complete review and authorisation from the university Council, a new student union known as Macquarie University Students Association (MUSRA) was established in 2009.\n\nWithin the first few hundred days of Schwartz's instatement as Vice-Chancellor, the 'Macquarie@50' strategic plan was launched, which positioned the university to enhance research, teaching, infrastructure and academic rankings by the university's 50th anniversary in 2014.  Included in the university's plans for the future was the establishment of a sustainability office in order to more effectively manage environmental and social development at Macquarie. As part of this campaign, in 2009 Macquarie became the first Fair Trade accredited university in Australia. The beginning of 2009 also saw the introduction of a new logo for the university which retained the Sirius Star, present on both the old logo and the university crest, but now 'embedded in a stylised lotus flower'. In accordance with the university by-law, the crest continues to be used for formal purposes and is displayed on university testamurs. The by-law also prescribes the university's motto, taken from Chaucer: 'And gladly teche'.\n\nIn 2013, the university became the first in Australia to fully align its degree system with the Bologna Accord.\n\nSymbols\n\nCoat of arms \n\nMacquarie’s arms was assumed through a 1967 amendment of the Macquarie University Act 1964 (Confirmed by Letters Patent of the College of Arms, 16 August 1969). The escutcheon displays the Macquarie Lighthouse tower, the first major public building in the colony, as well as the Sirius star, the name of the flagship of the First Fleet. The university’s founders originally wanted to base the university’s arms on Lachlan Macquarie’s family crest, however they decided to go for a more radical approach that represented Lachlan Macquarie as a builder and administrator. The motto chosen for the university was And Glady Teche. This is taken from the general Prologue of The Canterbury Tales, Geoffrey Chaucer c.1400 and symbolises the university's commitment to both learning and teaching. The coat of arms and the motto are used in a very limited number of formal communications.\n\nLogo \n\nMacquarie has had a number of logos in its history. In 2014, the university launched a new logo as part of its Shared Identity Project. The logo reintroduced the Macquarie Lighthouse, a popular symbol of the University within the University community and maintained the Sirus Star.\n\nCampus\n\nMacquarie University's main campus is located about 16 km north-west of the Sydney CBD and is set on 126 hectares of rolling lawns and natural bushland. Located within the high-technology corridor of Sydney's north-west and in close proximity to Macquarie Park and its surrounding industries, Macquarie's location has been crucial in its development as a relatively research intensive university.\n\nPrior to the development of the campus, most of the site was cultivated with peach orchards, market gardens and poultry farms. The university's first architect-planner was Walter Abraham, one of the first six administrators appointed to Macquarie University. As the site adapted from its former rural use to a busy collegiate environment, he implemented carefully designed planting programs across the campus.  Abraham established a grid design comprising lots of 300 sqft running north-south, with the aim of creating a compact academic core. The measure of 300 ft was seen as one minute's walk, and grid design reflected the aim of having a maximum walk of 10 minutes between any two parts of the university. The main east-west walkway that runs from the Macquarie University Research Park through to the arts faculty buildings, was named Wally's Walk in recognition of Walter Abraham's contribution to the development of the university.\n\nApart from its centres of learning, the campus features the Macquarie University Research Park, museums, art galleries, a sculpture park, an observatory, a sport and aquatic centre and also the private Macquarie University Hospital. The campus has its own postcode, 2109.\n\nMacquarie University Hospital \n\nMacquarie became the first university in Australia to own and operate a private medical facility in 2010 when it opened a $300 million hospital on its campus. The hospital is the first and only private not-for-profit teaching hospital on an Australian university campus. The Macquarie University Hospital is located to the north of the main campus area towards the university sports grounds. It comprises 183 beds, 12 operating theatres, 2 cardiac and vascular angiography suites. The hospital is co-located with the university's Australian School of Advanced Medicine.\n\nCommercial use \n\nThe university hosts a number of high technology companies on its campus. Primarily designed to encourage interaction between the university and industry, commercialisation of its campus has also given the institution an additional revenue stream. Tenants are selected based off their potential to collaborate with the universities researches or their ability to provide opportunities for its students and graduates. Cochlear Limited, has its headquarters in close proximity to the Australian Hearing Hub on the southern edge of campus. Other companies that have office space at the campus include Dow Corning, Goodman Fielder, Nortel Networks, OPSM and Siemens.\n\nThe Macquarie University Observatory was originally constructed in 1978 as a research facility but, since 1997, has been accessible to the public through its Public Observing Program.[http://www.astronomy.mq.edu.au/observatory/ The Macquarie University Observatory] \n\nLibrary\n\nThe library houses over 1.8 million items and uses the Library of Congress Classification System. The library features several collections including a Rare Book Collection, a Palaeontology Collection and the Brunner Collection of Egyptological materials. Macquarie University operated two libraries during the transition. The old library in building C7A closed at the end of July 2011 (which has since been repurposed as a student support and study space), and the new library in building C3C became fully operational on 1 August 2011. The new library was the first university library in Australia to possess an Automated Storage and Retrieval System (ASRS). The ASRS consists of an environmentally controlled vault with metal bins storing the items; robotic cranes retrieve an item on request and deliver it to the service desk for collection.\n\nMacquarie University Incubator\n\nThe Macquarie University Incubator is a space to research and develop ideas that can be commercialised.\n\nResidential colleges \n\nMacquarie University has two residential colleges on its campus, Dunmore Lang College and Robert Menzies College, both founded in 1972. The colleges offer academic support and a wide range of social and sporting activities in a communal environment.\n\nSeparate to the colleges is the Macquarie University Village. The village has over 900 rooms in mostly town house style buildings to the north of the campus. The village encourages its students to interact in its communal spaces and has a number of social events throughout the year.\n\nMuseums and collections \n\nThe museums and collections of Macquarie University are extensive and include nine museums and galleries. Each collection focuses on various historical, scientific or artistic interests. The most visible collection on campus is the sculpture park which is exhibited across the entire campus. At close to 100 sculptures on display, it is the largest park of its kind in the Southern Hemisphere. All museums and galleries are open to the public and offer educational programs for students at primary, secondary and tertiary levels.\n\nSports facilities \n\nLocated on the western side of the campus is the Macquarie University Sport and Aquatic Centre. Previously a sports hall facility, the complex was renovated and reopened in 2007 with the addition of the new gym and aquatic centre. It houses a 50-metre FINA-compliant outdoor pool and a 25-metre indoor pool. The complex also contains a gymnasium and squash, badminton, basketball, volleyball and netball courts.\n\nMacquarie also has seven hectares of high quality playing fields for football, cricket and tennis.  Situated to the north of the campus, the playing fields are used by the university as well as a number of elite sporting teams such as Sydney FC and the Westfield Matildas.\n\nTransport\n\nMacquarie University is served by the Macquarie University railway station, which opened in 2009. Macquarie is the only university in Australia with a railway station on campus. The underground station is served by eight trains per hour for most of the day and is on the Sydney Trains network. In 2018, Macquarie University station will close for six months for conversion to a Sydney Metro station on the Sydney Metro Northwest line.\n\nThere is also a major bus interchange within the campus that provides close to 800 bus services daily. The M2 Motorway runs parallel to the northern boundary of the campus and is accessible to traffic from the university.\n\nGallery \n\nImage:E4A at Entrance to MQ.JPG|E4A Building at Entrance to University\nImage:E4A Courtyard mq.JPG|E4A courtyard\nImage:Central Courtyard MQ.JPG|Central Courtyard\nImage:Graduation_Hall_MQ1.JPG|The Frederick Chong (E7B) Courtyard\nImage:MQ Science Faculty Dusk.JPG|E7A Mitchell building\nImage:E6b Building, Macquarie University.JPG|E6B building\nImage:Lane Cove Rd Building MQ.JPG|Lane Cove Rd building\nImage:Macqurie observatory 2014 05 16.JPG|Macquarie University Observatory\nImage:Building E11A MQ.JPG|Macquarie University Art Gallery\n\nOrganisation and governance\n\nStructure\n\nThe university currently comprises 35 departments within five faculties:\n* Faculty of Arts\n* Faculty of Business and Economics\n* Faculty of Human Sciences\n* Faculty of Medicine and Health Sciences\n* Faculty of Science and Engineering\n\nResearch centres, schools and institutes that are affiliated with the university:\n* The Macquarie Graduate School of Management\n* The Australian Research Institute for Environment and Sustainability\n* The Macquarie University Hospital\n* The Australian Hearing Hub\n\nMacquarie University's Australian Hearing Hub is partnered with Cochlear. Cochlear Headquarters are on campus. The Australian Hearing Hub includes the head office of Australian Hearing.\n\nThe Australian Research Institute for Environment and Sustainability is a research centre that promotes change for environmental sustainability, is affiliated with the University and is located on its campus.\n\nAccess Macquarie Limited was established in 1989 as the commercial arm of the university. It facilitates and supports the commercial needs of industry, business and government organisations seeking to utilise the academic expertise of the broader University community.\n\nGovernance\n\nThe university is governed by a 17-member Council.\n\nThe University Council is the governing authority of the university under the Macquarie University Act 1989. The Council takes primary responsibility for the control and management of the affairs of the University, and is empowered to make by-laws and rules relating to how the University is managed. Members of the Council include the University Vice-Chancellor, Academic and non-academic staff, the Vice President of the Academic Senate and a student representative. The Council is chaired by The Chancellor of the University.\n\nThe Academic Senate is the primary academic body of the university. It has certain powers delegated to it by Council, such as the approving of examination results and the completion of requirements for the award of degrees. At the same time, it makes recommendations to the Council concerning all changes to degree rules, and all proposals for new awards.  While the Academic Senate is an independent body, it is required to make recommendations to the university Council in relation to matters outside its delegated authority.\n\nMacquarie's current Vice-Chancellor, Bruce Dowton, took over from Schwartz in September 2012. Prior to his appointment Dowton served as a senior medical executive having held a range of positions in university, healthcare and consulting organisations. He also served as a pediatrician at the Massachusetts General Hospital for Children, and as Clinical Professor of Pediatrics at Harvard Medical School. There have been five Vice-Chancellors in the university's history.\n\nAcademic profile\n\nInternational Admissions\n\nThe Macquarie University International College offers Foundation Studies (Pre-University) and University-level Diplomas. Upon successful completion of a MUIC Diploma, students enter the appropriate bachelor's degree as a second year student.\n\nThe Centre for Macquarie English is the English-language centre that offers a range of specialised, direct entry English programmes that are approved by Macquarie University.[http://www.cme.mq.edu.au/ The Centre for Macquarie English (CME)] \n\nResearch\n\nThe university positions itself as being research intensive. In 2012, 85% of Macquarie's broad fields of research was rated 'at or above world standard' in the Excellence in Research for Australia 2012 National report. The university is within the top 3 universities in Australia for the number of peer reviewed publications produced per academic staff member.\n\nResearchers at Macquarie University, David Skellern and Neil Weste, and the Commonwealth Scientific and Industrial Research Organisation helped develop Wi-Fi. David Skellern has been a major donor to the University through the Skellern Family Trust. Macquarie physicists Frank Duarte and Jim Piper pioneered the laser designsF. J. Duarte and J. A. Piper, Narrow linewidth high prf copper laser-pumped dye-laser oscillators, Appl. Opt. 23, 1391-1394 (1984). adopted by researchers worldwide, in various major national programs, for atomic vapor laser isotope separation.\n\nMacquarie University's linguistics department developed the Macquarie Dictionary. The dictionary is regarded as the standard reference on Australian English.\n\nMacquarie University has a research partnership with the University of Hamburg in Germany and Fudan University in China. They offer dual and joint degree programs and engage in joint research.\n\nUniversity rankings\n\nMacquarie University (MQ) world rankings includes it being number 240 on the QS rankings, number 251+ on Times (THE), number 151+ on ARWU, and  number 267with US News. This contributes to Macquarie being the number 8 ranked Australian university overall in the world ranking systems. Macquarie University rankings within Australia include being placed at number 8 on the ERA scale (2012) and being a 4 1/2 Star AEN rated university. Macquarie also has a student survey satisfaction rating of 77.4% for business, 90.3% for health, 91.4% for arts, and 93.8% for science. Macquarie is ranked in the top 40 universities in the Asia-Pacific region and within Australia's top 12 universities according to the Academic Ranking of World Universities, the U.S. News & World Report Rankings and the QS World University Rankings. Macquarie was the highest ranked university in Australia under the age of 50 and was ranked 18th in the world (prior to its golden jubilee in 2014), according to the QS World University Rankings.\n\nInternationally, Macquarie was ranked 239th in the world (9th in Australia) in the Academic Ranking of World Universities of 2014. Macquarie University was ranked among the top 50 universities in the world for linguistics (43rd), psychology (48th) and earth and marine sciences (48th), and was ranked in the top 5 nationally for philosophy and earth and marine sciences, according to the 2014 QS World University Rankings.\n\nMacquarie ranked 67th in the world for Arts and Humanities (equal 5th in Australia), according to the 2015 Times Higher Education rankings by subject and 54th in the world for arts and humanities, according to the 2017 USNWR rankings by subject. Arts and Humanities is Macquarie's best discipline area in rankings. Macquarie was one of four non-Group of Eight universities ranked in the top 100 universities in the world in particular discipline areas.\n\nThe Macquarie Graduate School of Management is one of the oldest business schools in Australia. In 2014, The Economist ranked MGSM 5th in the Asia-Pacific, 3rd in Australia, 1st in Sydney/New South Wales and 49th in the world. It was the highest ranked business school in Australia and was ranked 68th in the world in the 2015 Financial Times MBA ranking.\n\nStudent life\n\nMacquarie is the fourth largest university in Sydney (38,753 students in 2013). The university has the largest student exchange programme in Australia.\n\nIn 2012, 9,802 students from Asia were enrolled at Macquarie University (Sydney campuses and offshore programs in China, Hong Kong, Korea and Singapore).\n\nCampus Life manages the university's non-academic services: food and retail, sport and recreation, student groups, child care, and entertainment. From late 2017 onward its Campus Hub facility has been closed for reconstruction; a 'pop-up'-style replacement, the Campus Common, has been opened for the duration.\n\nThe Global Leadership Program (GLP) is a student organisation and program that is undertaken by a large proportion of Macquarie Students. All students at the university are encouraged to undertake the program to enhance leadership skills, cross cultural understanding and international awareness. Upon completion of the GLP, students receive a formal notation on their academic transcript.\n\nMacquarie University has its own community radio station on campus, 2SER FM. The station is jointly owned by Macquarie University and University of Technology, Sydney.\n\nMacquarie University students celebrate Conception Day each year since 1969 to – according to legend – commemorate the date of conception of Lachlan Macquarie, as his birthday fell at the wrong time of year for a celebration. Conception Day is traditionally held on the last day of classes before the September mid-semester break.\n\nNotable alumni and staff\n\nAlumni include Rhodes and John Monash Scholars and several Fulbright Scholars.\n\nNotable alumni include: Australian politician and former Lord Mayor of Brisbane, Jim Soorley; Australian politician, Tanya Plibersek, Australian basketball player, Lauren Jackson; Australian swimmer, Ian Thorpe; Australian water polo player, Holly Lincoln-Smith; three founding members of the Australian children's musical group The Wiggles (Murray Cook, Anthony Field, Greg Page); New Zealand conservationist, Pete Bethune.\n\nNotable alumni in science include: Australian scientist Barry Brook,SA sets out Agenda for nuclear industry inquiry; expert mix appointed, The Australian Financial Review, 17 April 2015. American physicist Frank Duarte,G. Overton, N-slit interferometer extends secure free-space communications, Laser Focus World, 1 March 2011. and Australian physicist Cathy Foley.A. Coote, Leading Australian scientist Dr. Cathy Foley takes home woman of the year, The Daily Telegraph, 7 March 2013. Alumni notable in the business world include: Australian hedge fund manager Greg Coffey,The $665 million man, The Sydney Morning Herald, 19 October 2012. Australian businesswoman Catherine Livingstone,J. Ireland, Top companies with women on boards perform better, research finds, The Sydney Morning Herald, 23 April 2015 founder of Freelancer.com Matt Barrie, businessman Napoleon Perdis and Australian venture capitalist Larry R. Marshall.B. Smith, Entrepreneur Larry Marshall to head CSIRO, The Sydney Morning Herald, 9 October 2014.\n\nNotable faculty members include: Australian writer and four time Miles Franklin Award winner, Thea Astley; Hungarian Australian mathematician, Esther Szekeres; Australian mathematician, Neil Trudinger; Australian environmentalist and activist, Tim Flannery; British physicist and author, Paul Davies; British-Australian physicist, John Clive Ward; Israeli-Australian mathematician, José Enrique Moyal; Australian linguist, Geoffrey Hull; Australian geologist, Fellow of the Australian Academy of Science, John Veevers; Australian climatologist, Ann Henderson-Sellers; Australian sociologist, Raewyn Connell.\n\nFour Macquarie University academics were included in The World's Most Influential Minds 2014 report by Thomson Reuters, which identified the most highly cited researchers of the last 11 years.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Macquarie University" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19735" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Macquarie University is a public research university based in Sydney, Australia, in the suburb of Macquarie Park. Founded in 1964 by the New South Wales Government, it was the third university to be established in the metropolitan area of Sydney.\n\nEstablished as a verdant university, Macquarie has five faculties, as well as the Macquarie University Hospital and the Macquarie Graduate School of Management, which are located on the university's main campus in suburban Sydney.\n\nThe university is the first in Australia to fully align its degree system with the Bologna Accord.\n\nHistory\n\n20th century\n\nThe idea of founding a third university in Sydney was flagged in the early 1960s when the New South Wales Government formed a committee of enquiry into higher education to deal with a perceived emergency in university enrollments in New South Wales. During this enquiry, the Senate of the University of Sydney put in a submission which highlighted 'the immediate need to establish a third university in the metropolitan area'.Liberality of Opportunity, Mansfield and Hutchinson, p. 19 After much debate a future campus location was selected in what was then a semi-rural part of North Ryde, and it was decided that the future university be named after Lachlan Macquarie, an important early governor of the colony of New South Wales.\n\nMacquarie University was formally established in 1964 with the passage of the Macquarie University Act 1964 by the New South Wales parliament.\n\nThe initial concept of the campus was to create a new high technology corridor, similar to the area surrounding Stanford University in Palo Alto, California, the goal being to provide for interaction between industry and the new university.The Book of Sydney Suburbs, Compiled by Frances Pollon, Angus & Robertson Publishers, 1990, Published in Australia , page 189 The academic core was designed in the Brutalist style and developed by the renowned town planner Walter Abraham who also oversaw the next 20 years of planning and development for the university. A committee appointed to advise the state government on the establishment of the new university at North Ryde nominated Abraham as the architect-planner. The fledgling Macquarie University Council decided that planning for the campus would be done within the university, rather than by consultants, and this led to the establishment of the architect-planners office.\n\nThe first Vice-Chancellor of Macquarie University, Alexander George Mitchell, was selected by the University Council which met for the first time on 17 June 1964. Members of the first university council included: Colonel Sir Edward Ford OBE, David Paver Mellor, Rae Else-Mitchell QC and Sir Walter Scott.\n\nThe university first opened to students on 6 March 1967 with more students than anticipated. The Australian Universities Commission had allowed for 510 effective full-time students (EFTS) but Macquarie had 956 enrolments and 622 EFTS.Liberality of Opportunity, Mansfield and Hutchinson, p. 24 Between 1968 and 1969, enrolment at Macquarie increased dramatically with an extra 1200 EFTS, with 100 new academic staff employed. 1969 also saw the establishment of the Macquarie Graduate School of Management (MGSM).\n\nMacquarie grew during the seventies and eighties with rapid expansion in courses offered, student numbers and development of the site. In 1972, the university established the Macquarie Law School, the third law school in Sydney. In their book Liberality of Opportunity, Bruce Mansfield and Mark Hutchinson describe the founding of Macquarie University as 'an act of faith and a great experiment'.Liberality of Opportunity, Mansfield and Hutchinson, p. 317 An additional topic considered in this book is the science reform movement of the late 1970s that resulted in the introduction of a named science degree, thus facilitating the subsequent inclusion of other named degrees in addition to the traditional BA.Liberality of Opportunity, Mansfield and Hutchinson, pp. 268–271. An alternative \nview on this topic is given by theoretical physicist John Ward.J. C. Ward, Memoirs of a Theoretical Physicist (Optics Journal, Rochester, 2004).\n\nAfter over a decade of service, the first Vice Chancellor Professor Mitchell was succeeded by Professor Edwin Webb in December 1975. Professor Webb was required to steer the university through one of its most difficult periods as the value of universities were debated and the governments introduced significant funding cuts.\n\nProfessor Webb left the university in 1986 and was succeeded by Di Yerbury, the first female Vice-Chancellor in Australia. Professor Yerbury would go on to hold the position of Vice-Chancellor for nearly 20 years.\n\nIn 1990 the university absorbed the Institute of Early Childhood Studies of the Sydney College of Advanced Education, under the terms of the Higher Education (Amalgamation) Act 1989.l\n\n21st century\n\nProfessor Steven Schwartz replaced Di Yerbury at the beginning of 2006. Yerbury's departure was attended with much controversy, including a \"bitter dispute\" with Schwartz, disputed ownership of university artworks worth $13 million and Yerbury's salary package. In August 2006, Professor Schwartz expressed concern about the actions of Yerbury in a letter to university auditors. Yerbury strongly denied any wrongdoing and claimed the artworks were hers.\n\nDuring 2007, Macquarie University restructured its student organisation after an audit raised questions about management of hundreds of thousands of dollars in funds by student organisations At the centre of the investigation was Victor Ma, president of the Macquarie University Students' Council, who was previously involved in a high-profile case of student election fixing at the University of Sydney.\nThe university Council resolved to immediately remove Ma from his position. Vice-Chancellor Schwartz cited an urgent need to reform Macquarie's main student bodies.\nHowever, Ma strongly denied any wrongdoing and labelled the controversy a case of 'character assassination'.\nThe Federal Court ordered on 23 May 2007 that Macquarie University Union Ltd be wound up.\n\nFollowing the dissolution of Macquarie University Union Ltd, the outgoing student organisation was replaced with a new wholly owned subsidiary company of the university, known as U@MQ Ltd. The new student organisation originally lacked a true student representative union; however, following a complete review and authorisation from the university Council, a new student union known as Macquarie University Students Association (MUSRA) was established in 2009.\n\nWithin the first few hundred days of Schwartz's instatement as Vice-Chancellor, the 'Macquarie@50' strategic plan was launched, which positioned the university to enhance research, teaching, infrastructure and academic rankings by the university's 50th anniversary in 2014.  Included in the university's plans for the future was the establishment of a sustainability office in order to more effectively manage environmental and social development at Macquarie. As part of this campaign, in 2009 Macquarie became the first Fair Trade accredited university in Australia. The beginning of 2009 also saw the introduction of a new logo for the university which retained the Sirius Star, present on both the old logo and the university crest, but now 'embedded in a stylised lotus flower'. In accordance with the university by-law, the crest continues to be used for formal purposes and is displayed on university testamurs. The by-law also prescribes the university's motto, taken from Chaucer: 'And gladly teche'.\n\nIn 2013, the university became the first in Australia to fully align its degree system with the Bologna Accord.\n\nSymbols\n\nCoat of arms \n\nMacquarie’s arms was assumed through a 1967 amendment of the Macquarie University Act 1964 (Confirmed by Letters Patent of the College of Arms, 16 August 1969). The escutcheon displays the Macquarie Lighthouse tower, the first major public building in the colony, as well as the Sirius star, the name of the flagship of the First Fleet. The university’s founders originally wanted to base the university’s arms on Lachlan Macquarie’s family crest, however they decided to go for a more radical approach that represented Lachlan Macquarie as a builder and administrator. The motto chosen for the university was And Glady Teche. This is taken from the general Prologue of The Canterbury Tales, Geoffrey Chaucer c.1400 and symbolises the university's commitment to both learning and teaching. The coat of arms and the motto are used in a very limited number of formal communications.\n\nLogo \n\nMacquarie has had a number of logos in its history. In 2014, the university launched a new logo as part of its Shared Identity Project. The logo reintroduced the Macquarie Lighthouse, a popular symbol of the University within the University community and maintained the Sirus Star.\n\nCampus\n\nMacquarie University's main campus is located about 16 km north-west of the Sydney CBD and is set on 126 hectares of rolling lawns and natural bushland. Located within the high-technology corridor of Sydney's north-west and in close proximity to Macquarie Park and its surrounding industries, Macquarie's location has been crucial in its development as a relatively research intensive university.\n\nPrior to the development of the campus, most of the site was cultivated with peach orchards, market gardens and poultry farms. The university's first architect-planner was Walter Abraham, one of the first six administrators appointed to Macquarie University. As the site adapted from its former rural use to a busy collegiate environment, he implemented carefully designed planting programs across the campus.  Abraham established a grid design comprising lots of 300 sqft running north-south, with the aim of creating a compact academic core. The measure of 300 ft was seen as one minute's walk, and grid design reflected the aim of having a maximum walk of 10 minutes between any two parts of the university. The main east-west walkway that runs from the Macquarie University Research Park through to the arts faculty buildings, was named Wally's Walk in recognition of Walter Abraham's contribution to the development of the university.\n\nApart from its centres of learning, the campus features the Macquarie University Research Park, museums, art galleries, a sculpture park, an observatory, a sport and aquatic centre and also the private Macquarie University Hospital. The campus has its own postcode, 2109.\n\nMacquarie University Hospital \n\nMacquarie became the first university in Australia to own and operate a private medical facility in 2010 when it opened a $300 million hospital on its campus. The hospital is the first and only private not-for-profit teaching hospital on an Australian university campus. The Macquarie University Hospital is located to the north of the main campus area towards the university sports grounds. It comprises 183 beds, 12 operating theatres, 2 cardiac and vascular angiography suites. The hospital is co-located with the university's Australian School of Advanced Medicine.\n\nCommercial use \n\nThe university hosts a number of high technology companies on its campus. Primarily designed to encourage interaction between the university and industry, commercialisation of its campus has also given the institution an additional revenue stream. Tenants are selected based off their potential to collaborate with the universities researches or their ability to provide opportunities for its students and graduates. Cochlear Limited, has its headquarters in close proximity to the Australian Hearing Hub on the southern edge of campus. Other companies that have office space at the campus include Dow Corning, Goodman Fielder, Nortel Networks, OPSM and Siemens.\n\nThe Macquarie University Observatory was originally constructed in 1978 as a research facility but, since 1997, has been accessible to the public through its Public Observing Program.[http://www.astronomy.mq.edu.au/observatory/ The Macquarie University Observatory] \n\nLibrary\n\nThe library houses over 1.8 million items and uses the Library of Congress Classification System. The library features several collections including a Rare Book Collection, a Palaeontology Collection and the Brunner Collection of Egyptological materials. Macquarie University operated two libraries during the transition. The old library in building C7A closed at the end of July 2011 (which has since been repurposed as a student support and study space), and the new library in building C3C became fully operational on 1 August 2011. The new library was the first university library in Australia to possess an Automated Storage and Retrieval System (ASRS). The ASRS consists of an environmentally controlled vault with metal bins storing the items; robotic cranes retrieve an item on request and deliver it to the service desk for collection.\n\nMacquarie University Incubator\n\nThe Macquarie University Incubator is a space to research and develop ideas that can be commercialised.\n\nResidential colleges \n\nMacquarie University has two residential colleges on its campus, Dunmore Lang College and Robert Menzies College, both founded in 1972. The colleges offer academic support and a wide range of social and sporting activities in a communal environment.\n\nSeparate to the colleges is the Macquarie University Village. The village has over 900 rooms in mostly town house style buildings to the north of the campus. The village encourages its students to interact in its communal spaces and has a number of social events throughout the year.\n\nMuseums and collections \n\nThe museums and collections of Macquarie University are extensive and include nine museums and galleries. Each collection focuses on various historical, scientific or artistic interests. The most visible collection on campus is the sculpture park which is exhibited across the entire campus. At close to 100 sculptures on display, it is the largest park of its kind in the Southern Hemisphere. All museums and galleries are open to the public and offer educational programs for students at primary, secondary and tertiary levels.\n\nSports facilities \n\nLocated on the western side of the campus is the Macquarie University Sport and Aquatic Centre. Previously a sports hall facility, the complex was renovated and reopened in 2007 with the addition of the new gym and aquatic centre. It houses a 50-metre FINA-compliant outdoor pool and a 25-metre indoor pool. The complex also contains a gymnasium and squash, badminton, basketball, volleyball and netball courts.\n\nMacquarie also has seven hectares of high quality playing fields for football, cricket and tennis.  Situated to the north of the campus, the playing fields are used by the university as well as a number of elite sporting teams such as Sydney FC and the Westfield Matildas.\n\nTransport\n\nMacquarie University is served by the Macquarie University railway station, which opened in 2009. Macquarie is the only university in Australia with a railway station on campus. The underground station is served by eight trains per hour for most of the day and is on the Sydney Trains network. In 2018, Macquarie University station will close for six months for conversion to a Sydney Metro station on the Sydney Metro Northwest line.\n\nThere is also a major bus interchange within the campus that provides close to 800 bus services daily. The M2 Motorway runs parallel to the northern boundary of the campus and is accessible to traffic from the university.\n\nGallery \n\nImage:E4A at Entrance to MQ.JPG|E4A Building at Entrance to University\nImage:E4A Courtyard mq.JPG|E4A courtyard\nImage:Central Courtyard MQ.JPG|Central Courtyard\nImage:Graduation_Hall_MQ1.JPG|The Frederick Chong (E7B) Courtyard\nImage:MQ Science Faculty Dusk.JPG|E7A Mitchell building\nImage:E6b Building, Macquarie University.JPG|E6B building\nImage:Lane Cove Rd Building MQ.JPG|Lane Cove Rd building\nImage:Macqurie observatory 2014 05 16.JPG|Macquarie University Observatory\nImage:Building E11A MQ.JPG|Macquarie University Art Gallery\n\nOrganisation and governance\n\nStructure\n\nThe university currently comprises 35 departments within five faculties:\n* Faculty of Arts\n* Faculty of Business and Economics\n* Faculty of Human Sciences\n* Faculty of Medicine and Health Sciences\n* Faculty of Science and Engineering\n\nResearch centres, schools and institutes that are affiliated with the university:\n* The Macquarie Graduate School of Management\n* The Australian Research Institute for Environment and Sustainability\n* The Macquarie University Hospital\n* The Australian Hearing Hub\n\nMacquarie University's Australian Hearing Hub is partnered with Cochlear. Cochlear Headquarters are on campus. The Australian Hearing Hub includes the head office of Australian Hearing.\n\nThe Australian Research Institute for Environment and Sustainability is a research centre that promotes change for environmental sustainability, is affiliated with the University and is located on its campus.\n\nAccess Macquarie Limited was established in 1989 as the commercial arm of the university. It facilitates and supports the commercial needs of industry, business and government organisations seeking to utilise the academic expertise of the broader University community.\n\nGovernance\n\nThe university is governed by a 17-member Council.\n\nThe University Council is the governing authority of the university under the Macquarie University Act 1989. The Council takes primary responsibility for the control and management of the affairs of the University, and is empowered to make by-laws and rules relating to how the University is managed. Members of the Council include the University Vice-Chancellor, Academic and non-academic staff, the Vice President of the Academic Senate and a student representative. The Council is chaired by The Chancellor of the University.\n\nThe Academic Senate is the primary academic body of the university. It has certain powers delegated to it by Council, such as the approving of examination results and the completion of requirements for the award of degrees. At the same time, it makes recommendations to the Council concerning all changes to degree rules, and all proposals for new awards.  While the Academic Senate is an independent body, it is required to make recommendations to the university Council in relation to matters outside its delegated authority.\n\nMacquarie's current Vice-Chancellor, Bruce Dowton, took over from Schwartz in September 2012. Prior to his appointment Dowton served as a senior medical executive having held a range of positions in university, healthcare and consulting organisations. He also served as a pediatrician at the Massachusetts General Hospital for Children, and as Clinical Professor of Pediatrics at Harvard Medical School. There have been five Vice-Chancellors in the university's history.\n\nAcademic profile\n\nInternational Admissions\n\nThe Macquarie University International College offers Foundation Studies (Pre-University) and University-level Diplomas. Upon successful completion of a MUIC Diploma, students enter the appropriate bachelor's degree as a second year student.\n\nThe Centre for Macquarie English is the English-language centre that offers a range of specialised, direct entry English programmes that are approved by Macquarie University.[http://www.cme.mq.edu.au/ The Centre for Macquarie English (CME)] \n\nResearch\n\nThe university positions itself as being research intensive. In 2012, 85% of Macquarie's broad fields of research was rated 'at or above world standard' in the Excellence in Research for Australia 2012 National report. The university is within the top 3 universities in Australia for the number of peer reviewed publications produced per academic staff member.\n\nResearchers at Macquarie University, David Skellern and Neil Weste, and the Commonwealth Scientific and Industrial Research Organisation helped develop Wi-Fi. David Skellern has been a major donor to the University through the Skellern Family Trust. Macquarie physicists Frank Duarte and Jim Piper pioneered the laser designsF. J. Duarte and J. A. Piper, Narrow linewidth high prf copper laser-pumped dye-laser oscillators, Appl. Opt. 23, 1391-1394 (1984). adopted by researchers worldwide, in various major national programs, for atomic vapor laser isotope separation.\n\nMacquarie University's linguistics department developed the Macquarie Dictionary. The dictionary is regarded as the standard reference on Australian English.\n\nMacquarie University has a research partnership with the University of Hamburg in Germany and Fudan University in China. They offer dual and joint degree programs and engage in joint research.\n\nUniversity rankings\n\nMacquarie University (MQ) world rankings includes it being number 240 on the QS rankings, number 251+ on Times (THE), number 151+ on ARWU, and  number 267with US News. This contributes to Macquarie being the number 8 ranked Australian university overall in the world ranking systems. Macquarie University rankings within Australia include being placed at number 8 on the ERA scale (2012) and being a 4 1/2 Star AEN rated university. Macquarie also has a student survey satisfaction rating of 77.4% for business, 90.3% for health, 91.4% for arts, and 93.8% for science. Macquarie is ranked in the top 40 universities in the Asia-Pacific region and within Australia's top 12 universities according to the Academic Ranking of World Universities, the U.S. News & World Report Rankings and the QS World University Rankings. Macquarie was the highest ranked university in Australia under the age of 50 and was ranked 18th in the world (prior to its golden jubilee in 2014), according to the QS World University Rankings.\n\nInternationally, Macquarie was ranked 239th in the world (9th in Australia) in the Academic Ranking of World Universities of 2014. Macquarie University was ranked among the top 50 universities in the world for linguistics (43rd), psychology (48th) and earth and marine sciences (48th), and was ranked in the top 5 nationally for philosophy and earth and marine sciences, according to the 2014 QS World University Rankings.\n\nMacquarie ranked 67th in the world for Arts and Humanities (equal 5th in Australia), according to the 2015 Times Higher Education rankings by subject and 54th in the world for arts and humanities, according to the 2017 USNWR rankings by subject. Arts and Humanities is Macquarie's best discipline area in rankings. Macquarie was one of four non-Group of Eight universities ranked in the top 100 universities in the world in particular discipline areas.\n\nThe Macquarie Graduate School of Management is one of the oldest business schools in Australia. In 2014, The Economist ranked MGSM 5th in the Asia-Pacific, 3rd in Australia, 1st in Sydney/New South Wales and 49th in the world. It was the highest ranked business school in Australia and was ranked 68th in the world in the 2015 Financial Times MBA ranking.\n\nStudent life\n\nMacquarie is the fourth largest university in Sydney (38,753 students in 2013). The university has the largest student exchange programme in Australia.\n\nIn 2012, 9,802 students from Asia were enrolled at Macquarie University (Sydney campuses and offshore programs in China, Hong Kong, Korea and Singapore).\n\nCampus Life manages the university's non-academic services: food and retail, sport and recreation, student groups, child care, and entertainment. From late 2017 onward its Campus Hub facility has been closed for reconstruction; a 'pop-up'-style replacement, the Campus Common, has been opened for the duration.\n\nThe Global Leadership Program (GLP) is a student organisation and program that is undertaken by a large proportion of Macquarie Students. All students at the university are encouraged to undertake the program to enhance leadership skills, cross cultural understanding and international awareness. Upon completion of the GLP, students receive a formal notation on their academic transcript.\n\nMacquarie University has its own community radio station on campus, 2SER FM. The station is jointly owned by Macquarie University and University of Technology, Sydney.\n\nMacquarie University students celebrate Conception Day each year since 1969 to – according to legend – commemorate the date of conception of Lachlan Macquarie, as his birthday fell at the wrong time of year for a celebration. Conception Day is traditionally held on the last day of classes before the September mid-semester break.\n\nNotable alumni and staff\n\nAlumni include Rhodes and John Monash Scholars and several Fulbright Scholars.\n\nNotable alumni include: Australian politician and former Lord Mayor of Brisbane, Jim Soorley; Australian politician, Tanya Plibersek, Australian basketball player, Lauren Jackson; Australian swimmer, Ian Thorpe; Australian water polo player, Holly Lincoln-Smith; three founding members of the Australian children's musical group The Wiggles (Murray Cook, Anthony Field, Greg Page); New Zealand conservationist, Pete Bethune.\n\nNotable alumni in science include: Australian scientist Barry Brook,SA sets out Agenda for nuclear industry inquiry; expert mix appointed, The Australian Financial Review, 17 April 2015. American physicist Frank Duarte,G. Overton, N-slit interferometer extends secure free-space communications, Laser Focus World, 1 March 2011. and Australian physicist Cathy Foley.A. Coote, Leading Australian scientist Dr. Cathy Foley takes home woman of the year, The Daily Telegraph, 7 March 2013. Alumni notable in the business world include: Australian hedge fund manager Greg Coffey,The $665 million man, The Sydney Morning Herald, 19 October 2012. Australian businesswoman Catherine Livingstone,J. Ireland, Top companies with women on boards perform better, research finds, The Sydney Morning Herald, 23 April 2015 founder of Freelancer.com Matt Barrie, businessman Napoleon Perdis and Australian venture capitalist Larry R. Marshall.B. Smith, Entrepreneur Larry Marshall to head CSIRO, The Sydney Morning Herald, 9 October 2014.\n\nNotable faculty members include: Australian writer and four time Miles Franklin Award winner, Thea Astley; Hungarian Australian mathematician, Esther Szekeres; Australian mathematician, Neil Trudinger; Australian environmentalist and activist, Tim Flannery; British physicist and author, Paul Davies; British-Australian physicist, John Clive Ward; Israeli-Australian mathematician, José Enrique Moyal; Australian linguist, Geoffrey Hull; Australian geologist, Fellow of the Australian Academy of Science, John Veevers; Australian climatologist, Ann Henderson-Sellers; Australian sociologist, Raewyn Connell.\n\nFour Macquarie University academics were included in The World's Most Influential Minds 2014 report by Thomson Reuters, which identified the most highly cited researchers of the last 11 years. Macquarie University. http://en.wikipedia.org/?curid=19735."
  }
}
