{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17073",
  "eid" : "2a790270-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580503,
  "textBody" : "Kangchenjunga (, Kañcanajaṅghā), also spelled Kanchenjunga, is the third highest mountain in the world, and lies partly in Nepal and partly in Sikkim, India. It rises with an elevation of 8586 m in a section of the Himalayas called Kangchenjunga Himal that is limited in the west by the Tamur River, in the north by the Lhonak Chu and Jongsang La, and in the east by the Teesta River.\n\nMount Kangchenjunga lies about 125 km east-south-east of Mount Everest. It is the second highest mountain of the Himalayas. Three of the five peaks – Main, Central and South – are on the border between North Sikkim and Nepal. Two peaks are in Nepal's Taplejung District.Bhuju, U. R., Shakya, P. R., Basnet, T. B., Shrestha, S. (2007). [http://books.icimod.org/demo/uploads/ftp/Nepal%20Biodiversity%20Resource%20Book.pdf Nepal Biodiversity Resource Book. Protected Areas, Ramsar Sites, and World Heritage Sites.]  International Centre for Integrated Mountain Development, Ministry of Environment, Science and Technology, in cooperation with United Nations Environment Programme, Regional Office for Asia and the Pacific. Kathmandu, Nepal. \n\nKangchenjunga Main is the highest mountain in India, and the easternmost of the mountains higher than 8000 m. It is called Five Treasures of Snow after its five high peaks, and has always been worshipped by the people of Darjeeling and Sikkim.\n\nUntil 1852, Kangchenjunga was assumed to be the highest mountain in the world, but calculations based on various readings and measurements made by the Great Trigonometrical Survey of India in 1849 came to the conclusion that Mount Everest, known as Peak XV at the time, was the highest. Allowing for further verification of all calculations, it was officially announced in 1856 that Kangchenjunga is the third highest mountain in the world.\n\nKangchenjunga was first climbed on 25 May 1955 by Joe Brown and George Band, who were part of a British expedition. They stopped short of the summit in accordance with the promise given to the Chogyal that the top of the mountain would remain inviolate. Every climber or climbing group that has reached the summit has followed this tradition. Other members of this expedition included John Angelo Jackson and Tom Mackinon.\n\nNames\n\nKangchenjunga is the official spelling adopted by Douglas Freshfield, Alexander Mitchell Kellas, and the Royal Geographical Society that gives the best indication of the Tibetan pronunciation. Freshfield referred to the spelling used by the Indian Government since the late 19th century.\nThere are a number of alternative spellings including Kangchendzönga, Khangchendzonga, and Kanchenjunga.Denjongpa, A. B. (2002). Kangchendzönga: Secular and Buddhist perceptions of the mountain deity of Sikkim among the Lhopos. Bulletin of Tibetology 38 (2002): 11.Nirash, N. (1982). The Lepchas of Sikkim. Bulletin of Tibetology 18 (2): 18–23.Herrligkoffer, K. M. (1983). Sieg am Kanchenjunga: die deutsche Erstbesteigung. Droemer Knaur, München.\nNepali people spell it Kanchanjanga.\n\nThe brothers Hermann, Adolf and Robert Schlagintweit explained the local name Kanchinjínga (, Sikkimese IPA:) meaning \"The five treasures of the high snow\" as originating from the Tibetan word (following IPA given in Sikkimese) gangs meaning \"snow, ice\"; chen meaning \"great\"; mdzod meaning \"treasure\"; lnga meaning \"five\". It means \"The Five repositories or ledges of great snow\" and is physically descriptive of its five peaks.\nLocal Lhopo people believe that the treasures are hidden but reveal to the devout when the world is in peril; the treasures comprise salt, gold, turquoise and precious stones, sacred scriptures, invincible armor or ammunition, grain and medicine.Scheid, C. S. (2014). Hidden land and changing landscape: Narratives about Mount Khangchendzonga among the Lepcha and the Lhopo. Journal of the Irish Society for the Academic Study of Religions 1(1): 66–89.\n\nKangchenjunga's name in the Limbu language is Senjelungma or Seseylungma, and is believed to be an abode of the omnipotent goddess Yuma Sammang.Subba, J. R. (2009). Mythology of the People of Sikkim. Gyan Publishing House, New Delhi.\n\nProtected areas\n\nThe Kangchenjunga landscape is a complex of three distinct ecoregions: the eastern Himalayan broad-leaved and coniferous forests, the Eastern Himalayan alpine shrub and meadows and the Terai-Duar savanna and grasslands.\nThe Kangchenjunga transboundary landscape is shared by Bhutan, China, India and Nepal, and comprises 14 protected areas with a total of 6032 km2:Chettri, N., Bajracharya, B., Thapa, R. (2008). Feasibility Assessment for Developing Conservation Corridors in the Kangchenjunga Landscape. Pages 21–30 in: Chettri, N., Shakya, B., Sharma, E. (eds.) [http://lib.icimod.org/record/7890/files/attachment_520.pdf Biodiversity Conservation in the Kangchenjunga Landscape]. International Centre for Integrated Mountain Development, Kathmandu.\n* Nepal: Kanchenjunga Conservation Area.\n* Sikkim, India: Khangchendzonga National Park, Barsey Rhododendron Sanctuary, Fambong Lho Wildlife Sanctuary, Kyongnosla Alpine Sanctuary, Maenam Wildlife Sanctuary, Shingba Rhododendron Sanctuary, Pangolakha Wildlife Sanctuary\n* Darjeeling, India: Jore Pokhri Wildlife Sanctuary, Singalila National Park, Senchal Wildlife Sanctuary, Mahananda Wildlife Sanctuary, Neora Valley National Park.\n* Bhutan: Torsa Strict Nature Reserve\nThese protected areas are habitats for many globally significant plant species such as rhododendrons and orchids and many endangered flagship species such as snow leopard, Asian black bear, red panda, white-bellied musk deer, blood pheasant and chestnut-breasted partridge.\n\nGeography\n\nThe Kangchenjunga Himal section of the Himalayas lies both in Nepal and India, and encompasses 16 peaks over 7000 m. In the north, it is limited by the Lhonak Chu, Goma Chu and Jongsang La, and in the east by the Teesta River. The western limit runs from the Jongsang La down the Gingsang and Kangchenjunga glaciers and the rivers of Ghunsa and Tamur. Kanchenjunga rises about 20 km south of the general alignment of the Great Himalayan range about 125 km east-south-east of Mount Everest as the crow flies. South of the southern face of Kanchenjunga runs the 3000 - high Singalila Ridge that separates Sikkim from Nepal and northern West Bengal.Dhar, O. N. and S. Nandargi (2000). [http://onlinelibrary.wiley.com/doi/10.1002/j.1477-8696.2000.tb04065.x/pdf An appraisal of precipitation distribution around the Everest and Kanchenjunga peaks in the Himalayas] Weather 55 (7): 223–234.\n\nKangchenjunga and its satellite peaks form a huge mountain massif.Smythe, F. S. (1930). [https://archive.org/stream/KanchenjungaAdventure/kanchenjunga#page/n13/mode/2up The Kangchenjunga adventure]. Victor Gollancz Ltd., London The massif's five highest peaks are listed in the following table.\n\nThe main ridge of the massif runs from north-north-east to south-south-west and forms a watershed to several rivers. Together with ridges running roughly from east to west they form a giant cross. These ridges contain a host of peaks between 6000 and. The northern section includes Yalung Kang, Kangchenjunga Central and South, Kangbachen, Kirat Chuli and Gimmigela Chuli, and runs up to the Jongsang La. The eastern ridge in Sikkim includes Siniolchu. The southern section runs along the Nepal-Sikkim border and includes Kabru I to III. This ridge extends southwards to the Singalila Ridge.Mason, K. (1932). The Recent Assaults on Kangchenjunga: Review. The Geographical Journal 80 (5): 439–445. The western ridge culminates in the Kumbhakarna, also known as Jannu.\n\nFour main glaciers radiate from the peak, pointing roughly to the north-east, south-east, north-west and south-west. The Zemu glacier in the north-east and the Talung glacier in the south-east drain to the Teesta River; the Yalung glacier in the south-west and the Kangchen glacier in the north-west drain to the Arun and Kosi rivers.Freshfield, D. W. (1902). [https://archive.org/stream/geographicaljou17britgoog#page/n492/mode/2up The Glaciers of Kangchenjunga]. The Geographical Journal 19: 453–475.\nThe glaciers spread over the area above approximately 5000 m, and the glacialized area covers about 314 km2 in total.Asahi, K. (1999). Data on inventoried glaciers and its distribution in eastern part of Nepal Himalaya. Data Report 2, Basic studies for assessing the impacts of the global warming on the Himalayan cryosphere, 1994–1998. Institute for Hydrospheric-Atmospheric Sciences, Nagoya University and Department of Hydrology and Meteorology, HMG/Nepal. There are 120 glaciers in the Kanchenjunga Himal, of which 17 are debris-covered. Between 1958 and 1992, more than half of 57 examined glaciers had retreated, possibly due to rising of air temperature.Ashahi, K., Watanabe, T. (2000). Past and recent glacier ﬂuctuations in Kanchenjunga Himal, Nepal. Journal of Nepal Geological Society (22): 481–490.\n\nKangchenjunga Main is the highest elevation of the Brahmaputra River basin, which forms part of the southeast Asian monsoon regime and is among the globally largest river basins.Bajracharya, S. R., Palash, W., Shrestha, M. S., Khadgi, V. R., Duo, C., Das, P. J., & Dorji, C. (2015). Systematic Evaluation of Satellite-Based Rainfall Products over the Brahmaputra Basin for Hydrological Applications. Advances in Meteorology: 398687.\nKangchenjunga is one of six peaks above 8000 m located in the basin of the Koshi river, which is among the largest tributaries of the Ganges.Shijin, W., & Tao, Z. (2014). Spatial change detection of glacial lakes in the Koshi River Basin, the Central Himalayas. Environmental Earth Sciences 72(11): 4381–4391.\nThe Kangchenjunga massif forms also part of the Ganges Basin.\n\nAlthough it is the third highest peak in the world, Kangchenjunga is only ranked 29th by topographic prominence, a measure of a mountain's independent stature. The key col for Kangchenjunga lies at a height of 4664 m, along the watershed boundary between Arun and Brahmaputra rivers in Tibet. It is however, the 4th most prominent peak in the Himalaya, after Everest, and the western and eastern anchors of the Himalaya, Nanga Parbat and Namcha Barwa, respectively.\n\nClimbing routes \n\nThere are four climbing routes to reach the summit of Kangchenjunga, three of which are in Nepal from the southwest, northwest and northeast, and one from northeastern Sikkim in India. To date, the northeastern route from Sikkim has been successfully used only three times. The Indian government has banned expeditions to Kanchenjunga, and therefore this route has been closed since 2000.\n\nClimbing history\n\nEarly reconnaissances and attempts\n\n* Between April 1848 and February 1849, Joseph Dalton Hooker explored parts of northern Sikkim and eastern Nepal, mainly to collect plants and study the distribution of Himalayan flora. He was based in Darjeeling, and made repeated excursions in the river valleys and into the foothills of Kangchenjunga up to an altitude of 15620 ft.\n* In spring 1855, the German explorer Hermann Schlagintweit travelled to Darjeeling but was not allowed to proceed further north due to the Nepalese-Tibetan War. In May, he explored the Singalila Ridge up to the peak of Tonglo for a meteorological survey.\n* In 1879, Sarat Chandra Das and Lama Ugyen-gyatso crossed into Tibet west of \"Kanchanjinga\" via eastern Nepal and the Tashilhunpo Monastery en route to Lhasa. They returned along the same route in 1881.Das, S. C. (1902). [https://archive.org/stream/journeytolhasace00dass#page/n9/mode/2up A Journey to Lhasa and central Tibet]. E. P. Dutton & Company, New York, John Murray, London.\n* In 1883, a party of William Woodman Graham together with two Swiss mountaineers climbed in the area of Kangchenjunga. They were the first who ascended Kabru within 30 - below the summit. They crossed the Kang La pass, and climbed a peak of nearly 19000 ft from which they examined Jannu. They concluded it was too late in the year for an attempt and returned once again to Darjeeling.Blaser, W. and G. Hughes (2009). [http://www.himalaya-info.org/Kabru%20Alpine%20Journal%202010.pdf Kabru 1883. A Reassessment]. The Alpine Journal 114: 219–228.\n* Between October 1885 and January 1886, Rinzin Namgyal surveyed the unexplored north and west sides of Kangchenjunga. He was the first native surveyor to map the circuit of Kangchenjunga and provided sketches of each side of the peak and the adjoining valleys. He also defined the frontiers of Nepal, Tibet and Sikkim in this area.Ward, M. (2001). [http://www.alpinejournal.org.uk/Contents/Contents_2001_files/AJ%202001%20191-196%20Ward%20Kangchenjunga.pdf Early Exploration of Kangchenjunga and South Tibet by the pundits Rinzin Namgyal, Sarat Chandra Das and Lama Ugyen Gyatso]. The Alpine Journal 106: 191–196.\n* In 1899, British mountaineer Douglas Freshfield set out with his party comprising the Italian photographer Vittorio Sella. They were the first mountaineers to examine the lower and upper ramparts, and the great western face of Kangchenjunga, rising from the Kangchenjunga Glacier.\n* In 1905, a party headed by Aleister Crowley was the first attempt at climbing the mountain. Aleister Crowley had been part of the team attempting the 1902 ascent of K2. The team reached an estimated altitude of 6500 m on the southwest side of the mountain before turning back. The exact height reached is somewhat unclear; Crowley stated that on 31 August, \"We were certainly over 21000 ft and possibly over 22000 ft\", when the team was forced to retreat to Camp 5 by the risk of avalanche. On 1 September, they evidently went further; some members of the team, Reymond, Pache and Salama, \"got over the bad patch\" that had forced them to return to Camp 5 the day before, and progressed \"out of sight and hearing\" before returning to Crowley and the men with packs, who could not cross the dangerous section unassisted with their burdens. It is not clear how far Reymond, Pache and Salama had ascended – but in summarizing, Crowley ventured \"We had reached a height of approximately 25000 ft.\" Attempting a \"mutinous\" late-in-the-day descent from Camp 5 to Camp 4, climber Alexis Pache (who earlier that day had been one of three to ascend possibly higher than any before), and three local porters, were killed in an avalanche. Despite the insistence of one of the men that \"The demon of Kangchenjunga was propitiated with the sacrifice\", Crowley decided enough was enough and that it was inappropriate to continue.Crowley, A.; Symonds, J.; Grant, K. (1989). The confessions of Aleister Crowley: an autobiography [http://hermetic.com/crowley/confessions/chapter52.html Chapter 52] Arkana, London\n* In 1907, two Norwegians set about climbing Jongri via the Kabru glacier to the south, an approach apparently rejected by Graham's party. Progress was very slow, partly because of problems with supplies and porters, and presumably also lack of fitness and acclimatisation. However, from a high camp at about 22600 ft they were eventually able to reach a point 50 or below the summit before they were turned back by strong winds.\n* In 1929, the German Paul Bauer led an expedition team that reached 7400 m on the northeast spur before being turned back by a five-day storm.Bauer, P. (1955). Kangchenjunga Challenge. William Kimber, London.\n* In May 1929, the American E. F. Farmer left Darjeeling with native porters, crossed the Kang La into Nepal and climbed up towards the Talung Saddle. When his porters refused to go any further, he climbed alone further upwards through drifting mists but did not return.\n* In 1930, Günter Dyhrenfurth led an international expedition comprising the German Uli Wieland, Austrian Erwin Schneider and Englishman Frank Smythe who attempted to climb Kangchenjunga. They failed due to poor weather and snow conditions.\n* In 1931, Paul Bauer led a second German expedition team who attempted the northeast spur before being turned back by bad weather, illnesses, and deaths. The team retreated after climbing only a little higher than the 1929 attempt.\n* In 1954, John Kempe led a party comprising J. W. Tucker, S. R. Jackson, G. C. Lewis, T. H. Braham and medical officer Dr. D. S. Mathews. They explored the upper Yalung glacier with the intention to discover a practicable route to the great ice-shelf that runs across the south-west face of Kangchenjunga.Braham, T. H. (1955–56). [http://www.himalayanclub.org/journal/kangchenjunga-reconnaissance-1954/ Kangchenjunga Reconnaissance, 1954]. The Himalayan Journal Volume 19. This reconnaissance led to the route used by the successful 1955 expedition.Braham, T. H. (1996). [http://www.alpinejournal.org.uk/Contents/Contents_1996_files/AJ%201996%2033-35%20Braham%20Kangchenjunga.pdf Kangchenjunga: The 1954 Reconnaissance]. The Alpine Journal 101: 33–35.\n\nFirst ascent\n\nIn 1955, Joe Brown and George Band made the first ascent on 25 May, followed by Norman Hardie and Tony Streather on 26 May. The full team also included John Clegg (team doctor), Charles Evans (team leader), John Angelo Jackson, Neil Mather, and Tom Mackinnon.\n\nThe ascent proved that Aleister Crowley's 1905 route (also investigated by the 1954 reconnaissance) was viable. The route starts on the Yalung Glacier to the southwest of the peak, and climbs the Yalung Face, which is 3000 m high. The main feature of this face is the \"Great Shelf\", a large sloping plateau at around 7500 m, covered by a hanging glacier. The route is almost entirely on snow, glacier, and one icefall; the summit ridge itself can involve a small amount of travel on rock. The first ascent expedition made six camps above their base camp, two below the Shelf, two on it, and two above it. They started on 18 April, and everyone was back to base camp by 28 May.\n\nOther notable ascents\n\n* 1973 Yutaka Ageta and Takeo Matsuda of the Japanese expedition summitted Kangchenjunga West (Yalung Kang) by climbing the SW Ridge.\n* 1977 The second ascent of Kangchenjunga, by an Indian Army team led by Colonel Narendra Kumar. They completed the northeast spur, the difficult ridge that defeated German expeditions in 1929 and 1931.\n* 1978 Polish teams made the first successful ascents of the summits Kangchenjunga South (Wojciech Wróż and Eugeniusz Chrobak, 19 May) and Kangchenjunga Central (Wojciech Brański, Zygmunt Andrzej Heinrich, Kazimierz Olech, 22 May).Wojciech Wróż: Święta góra Sikkimu. Warszawa: \"Sport i Turystyka\", 1982. . \n* 1979 The third ascent, on 16 May, and the first without oxygen, by Doug Scott, Peter Boardman and Joe Tasker establishing a new route on the North Ridge\n* 1982 The 6th of May sees Ang Dorje, Friedel Mutschlechner, and Reinhold Messner (suffering from amoebic liver abscess) reach the top by a variation on the North Face route without supplemental oxygen.\n* 1983 Pierre Beghin made the first solo ascent. It was accomplished without the use of supplemental oxygen.\n* 1986 On 11 January, Krzysztof Wielicki and Jerzy Kukuczka, Polish climbers, made the first winter ascent. Otto Guilherme Gerstenberger Junior (Brazilian) and Johann Krigeer (South African) reach the peak without using supplemental oxygen.\n* 1988 First successful American Expedition; led by Carlos Buhler, from the North Face. Summiting were Buhler, Peter Habeler (Austrian) and Martin Zabaleta (Spanish)\n* 1989 A Soviet expedition successfully traversed all four summits of Kangchenjunga that are higher than 8,000m. Two separate teams traversed the summits in opposite directions.\n* 1989 American Expedition led by Lou Whittaker, with six people summiting on the Northwall: George Dunn, Craig van Hoy, Ed Viesturs, Phil Ershler, Larry Nielson, Greg Wilson.\n* 1991 Slovenian Marija Frantar and Joze Rozman attempted the first ascent by a woman. Their bodies were later found below the summit headwall.\n* 1991 Slovenian Andrej Štremfelj and Marko Prezelj completed an alpine-style climb up the south ridge of Kangchenjunga to the south summit (8,494 m).\n* 1992 Carlos Carsolio made the only summit that year. It was in a solo climb without supplementary oxygen.\n* 1992 Wanda Rutkiewicz, the first woman in the world to ascend and descend K2 and a world-renowned Polish climber, died after she insisted on waiting for an incoming storm to pass, which she did not survive.\n* 1995 Benoît Chamoux, Pierre Royer and their Sherpa guide disappeared on 6 October near the summit.\n* 1998 Ginette Harrison was the first woman who climbed Kangchenjunga North face.\n* 2005 Alan Hinkes, a British climber, was the only person to summit in the 50th anniversary of the first ascent year.\n* 2006 Gerlinde Kaltenbrunner, an Austrian mountaineer, was the second woman to reach the summit.\n* 2009 Jon Gangdal and Mattias Karlsson reached the summit, becoming, respectively, the first Norwegian and the first Swedish mountaineer to summit this mountain.\n* 2009 Edurne Pasaban, a Spanish mountaineer, reached the summit becoming the first woman to summit twelve eight-thousanders.\n* In May 2009, Kinga Baranowska was the first Polish woman to reach the summit of Kangchenjunga.Mysza (2009). [http://wspinanie.pl/serwis/200905/18kinga-baranowska-kangchenjunga.php Kinga Baranowska zdobyła Kangchenjungę]. wspinanie.pl, 18 May 2009.\n* 2011 Tunc Findik became the first Turkish man to reach the peak of Kangchenjunga, his seventh eight thousander, with Swiss partner Guntis Brandts via the British 1955 SW Face route.\n* 2011 Indian mountaineers Basanta Singha Roy and Debasish Biswas of Mountaineers' Association of Krishnanagar (MAK), West Bengal, India, successfully scaled Kangchenjunga Main on 20 May 2011.\n* In May 2013, five climbers including Hungarian Zsolt Erőss and Péter Kiss reached the summit, but disappeared during the descent.\n* In May 2014, Bulgarian Boyan Petrov reached the peak without the use of supplemental oxygen. Petrov is a diabetic.[http://www.monitor.bg/article?id=431481 Тайнствен глас водил Боян Петров към върха] , Монитор\n\nDespite improved climbing gear the fatality rate of climbers attempting to summit Kanchenjunga is high. Since the 1990s, more than 20% of people died while climbing Kanchenjunga's main peak.\n\nTourism\n\nSome of the most famous views of Kangchenjunga are from the hill station of Darjeeling and Antu Dada of Ilam, Nepal. The Darjeeling War Memorial is among the most visited places from which Kangchenjunga is observed. On a clear day it presents an image not so much of a mountain but of a white wall hanging from the sky. The people of Sikkim revere Kangchenjunga as a sacred mountain. Permission to climb the mountain from the Indian side is rarely given.\n\nDue to its remote location in Nepal and the difficulty involved in accessing it from India, the Kangchenjunga region is not much explored by trekkers. It has, therefore, retained much of its pristine beauty. In Sikkim too, trekking into the Kangchenjunga region has just recently been permitted. The Goecha La trek is gaining popularity amongst tourists. It goes to the Goecha La Pass, located right in front of the huge southeast face of Kangchenjunga. Another trek to Green Lake Basin has recently been opened for trekking. This trek goes to the Northeast side of Kangchenjunga along the famous Zemu Glacier. The film Singalila in the Himalaya is journey around Kangchenjunga.\n\nIn myth\n\nThe area around Kangchenjunga is said to be home to a mountain deity, called Dzö-ngaAnna Belikci Denjongpa, [http://himalaya.socanth.cam.ac.uk/collections/journals/bot/pdf/bot_2002_02_01.pdf Kangchendzönga: Secular and Buddhist perceptions of the mountain deity of Sikkim among the Lhopos] or \"Kangchenjunga Demon\", a type of yeti or rakshasa. A British geological expedition in 1925 spotted a bipedal creature which they asked the locals about, who referred to it as the \"Kangchenjunga Demon\".\n\nFor generations, there have been legends recounted by the inhabitants of the areas surrounding Mount Kanchenjunga, both in Sikkim and in Nepal, that there is a valley of immortality hidden on its slopes. These stories are well known to both the original inhabitants of the area, the Lepcha people, and those of the Tibetan Buddhist cultural tradition. In Tibetan, this valley is known as Beyul Demoshong. In 1962 a Tibetan Lama by the name of Tulshuk Lingpa led over 300 followers into the high snow slopes of Kanchenjunga to ‘open the way’ to Beyul Demoshong. The story of this expedition is recounted in the 2011 book A Step Away from Paradise.\n\nIn literature\n\n* In the Swallows and Amazons series of books by Arthur Ransome, a high mountain (unnamed in the books, but clearly based on the Old Man of Coniston in the English Lake District) is given the name \"Kanchenjunga\" by the children when they climb it in 1931.\n* In The Epic of Mount Everest, first published in 1926, Sir Francis Younghusband: \" For natural beauty Darjiling (Darjeeling) is surely unsurpassed in the world. From all countries travellers come there to see the famous view of Kangchenjunga, 28150 ft in height, and only 40 mi distant. Darjiling (Darjeeling) itself is 7000 ft above sea-level and is set in a forest of oaks, magnolia, rhododendrons, laurels and sycamores. And through these forests the observer looks down the steep mountain-sides to the Rangeet River only 1000 ft above sea-level, and then up and up through tier after tier of forest-clad ranges, each bathed in a haze of deeper and deeper purple, till the line of snow is reached; and then still up to the summit of Kangchenjunga, now so pure and ethereal we can scarcely believe it is part of the solid earth on which we stand; and so high it seems part of the very sky itself.\"\n* In 1999, official James Bond author Raymond Benson published High Time to Kill. In this story, a microdot containing a secret formula for aviation technology is stolen by a society called the Union. During their escape, their plane crashes on the slopes of Kangchenjunga and James Bond becomes part of a climbing expedition in order to retrieve the formula.\n* The Inheritance of Loss by Kiran Desai, which won the 2006 Man Booker Prize, is set partly in Kalimpong, a hill station situated near Kangchenjunga.\n*In Legend of the Galactic Heroes by Yoshiki Tanaka, which won the Seiun Award for \"Best Novel of the Year\" in 1988 and was adapted into an anime series by Kitty Films, the capital and holiest temple of the Terraist Cult is on Earth beneath the rubble of Kangchenjunga.\n*Michelle Paver's 2016 ghost story Thin Air concerns a fictional expedition to climb Kangchenjunga in 1935, and an earlier (also fictional) expedition in 1906.\n* The book Round Kangchenjunga – A Narrative of Mountain Travel and Exploration by Douglas Freshfield gives a complete account of his travel around Kangchenjunga.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kangchenjunga" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17073" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kangchenjunga (, Kañcanajaṅghā), also spelled Kanchenjunga, is the third highest mountain in the world, and lies partly in Nepal and partly in Sikkim, India. It rises with an elevation of 8586 m in a section of the Himalayas called Kangchenjunga Himal that is limited in the west by the Tamur River, in the north by the Lhonak Chu and Jongsang La, and in the east by the Teesta River.\n\nMount Kangchenjunga lies about 125 km east-south-east of Mount Everest. It is the second highest mountain of the Himalayas. Three of the five peaks – Main, Central and South – are on the border between North Sikkim and Nepal. Two peaks are in Nepal's Taplejung District.Bhuju, U. R., Shakya, P. R., Basnet, T. B., Shrestha, S. (2007). [http://books.icimod.org/demo/uploads/ftp/Nepal%20Biodiversity%20Resource%20Book.pdf Nepal Biodiversity Resource Book. Protected Areas, Ramsar Sites, and World Heritage Sites.]  International Centre for Integrated Mountain Development, Ministry of Environment, Science and Technology, in cooperation with United Nations Environment Programme, Regional Office for Asia and the Pacific. Kathmandu, Nepal. \n\nKangchenjunga Main is the highest mountain in India, and the easternmost of the mountains higher than 8000 m. It is called Five Treasures of Snow after its five high peaks, and has always been worshipped by the people of Darjeeling and Sikkim.\n\nUntil 1852, Kangchenjunga was assumed to be the highest mountain in the world, but calculations based on various readings and measurements made by the Great Trigonometrical Survey of India in 1849 came to the conclusion that Mount Everest, known as Peak XV at the time, was the highest. Allowing for further verification of all calculations, it was officially announced in 1856 that Kangchenjunga is the third highest mountain in the world.\n\nKangchenjunga was first climbed on 25 May 1955 by Joe Brown and George Band, who were part of a British expedition. They stopped short of the summit in accordance with the promise given to the Chogyal that the top of the mountain would remain inviolate. Every climber or climbing group that has reached the summit has followed this tradition. Other members of this expedition included John Angelo Jackson and Tom Mackinon.\n\nNames\n\nKangchenjunga is the official spelling adopted by Douglas Freshfield, Alexander Mitchell Kellas, and the Royal Geographical Society that gives the best indication of the Tibetan pronunciation. Freshfield referred to the spelling used by the Indian Government since the late 19th century.\nThere are a number of alternative spellings including Kangchendzönga, Khangchendzonga, and Kanchenjunga.Denjongpa, A. B. (2002). Kangchendzönga: Secular and Buddhist perceptions of the mountain deity of Sikkim among the Lhopos. Bulletin of Tibetology 38 (2002): 11.Nirash, N. (1982). The Lepchas of Sikkim. Bulletin of Tibetology 18 (2): 18–23.Herrligkoffer, K. M. (1983). Sieg am Kanchenjunga: die deutsche Erstbesteigung. Droemer Knaur, München.\nNepali people spell it Kanchanjanga.\n\nThe brothers Hermann, Adolf and Robert Schlagintweit explained the local name Kanchinjínga (, Sikkimese IPA:) meaning \"The five treasures of the high snow\" as originating from the Tibetan word (following IPA given in Sikkimese) gangs meaning \"snow, ice\"; chen meaning \"great\"; mdzod meaning \"treasure\"; lnga meaning \"five\". It means \"The Five repositories or ledges of great snow\" and is physically descriptive of its five peaks.\nLocal Lhopo people believe that the treasures are hidden but reveal to the devout when the world is in peril; the treasures comprise salt, gold, turquoise and precious stones, sacred scriptures, invincible armor or ammunition, grain and medicine.Scheid, C. S. (2014). Hidden land and changing landscape: Narratives about Mount Khangchendzonga among the Lepcha and the Lhopo. Journal of the Irish Society for the Academic Study of Religions 1(1): 66–89.\n\nKangchenjunga's name in the Limbu language is Senjelungma or Seseylungma, and is believed to be an abode of the omnipotent goddess Yuma Sammang.Subba, J. R. (2009). Mythology of the People of Sikkim. Gyan Publishing House, New Delhi.\n\nProtected areas\n\nThe Kangchenjunga landscape is a complex of three distinct ecoregions: the eastern Himalayan broad-leaved and coniferous forests, the Eastern Himalayan alpine shrub and meadows and the Terai-Duar savanna and grasslands.\nThe Kangchenjunga transboundary landscape is shared by Bhutan, China, India and Nepal, and comprises 14 protected areas with a total of 6032 km2:Chettri, N., Bajracharya, B., Thapa, R. (2008). Feasibility Assessment for Developing Conservation Corridors in the Kangchenjunga Landscape. Pages 21–30 in: Chettri, N., Shakya, B., Sharma, E. (eds.) [http://lib.icimod.org/record/7890/files/attachment_520.pdf Biodiversity Conservation in the Kangchenjunga Landscape]. International Centre for Integrated Mountain Development, Kathmandu.\n* Nepal: Kanchenjunga Conservation Area.\n* Sikkim, India: Khangchendzonga National Park, Barsey Rhododendron Sanctuary, Fambong Lho Wildlife Sanctuary, Kyongnosla Alpine Sanctuary, Maenam Wildlife Sanctuary, Shingba Rhododendron Sanctuary, Pangolakha Wildlife Sanctuary\n* Darjeeling, India: Jore Pokhri Wildlife Sanctuary, Singalila National Park, Senchal Wildlife Sanctuary, Mahananda Wildlife Sanctuary, Neora Valley National Park.\n* Bhutan: Torsa Strict Nature Reserve\nThese protected areas are habitats for many globally significant plant species such as rhododendrons and orchids and many endangered flagship species such as snow leopard, Asian black bear, red panda, white-bellied musk deer, blood pheasant and chestnut-breasted partridge.\n\nGeography\n\nThe Kangchenjunga Himal section of the Himalayas lies both in Nepal and India, and encompasses 16 peaks over 7000 m. In the north, it is limited by the Lhonak Chu, Goma Chu and Jongsang La, and in the east by the Teesta River. The western limit runs from the Jongsang La down the Gingsang and Kangchenjunga glaciers and the rivers of Ghunsa and Tamur. Kanchenjunga rises about 20 km south of the general alignment of the Great Himalayan range about 125 km east-south-east of Mount Everest as the crow flies. South of the southern face of Kanchenjunga runs the 3000 - high Singalila Ridge that separates Sikkim from Nepal and northern West Bengal.Dhar, O. N. and S. Nandargi (2000). [http://onlinelibrary.wiley.com/doi/10.1002/j.1477-8696.2000.tb04065.x/pdf An appraisal of precipitation distribution around the Everest and Kanchenjunga peaks in the Himalayas] Weather 55 (7): 223–234.\n\nKangchenjunga and its satellite peaks form a huge mountain massif.Smythe, F. S. (1930). [https://archive.org/stream/KanchenjungaAdventure/kanchenjunga#page/n13/mode/2up The Kangchenjunga adventure]. Victor Gollancz Ltd., London The massif's five highest peaks are listed in the following table.\n\nThe main ridge of the massif runs from north-north-east to south-south-west and forms a watershed to several rivers. Together with ridges running roughly from east to west they form a giant cross. These ridges contain a host of peaks between 6000 and. The northern section includes Yalung Kang, Kangchenjunga Central and South, Kangbachen, Kirat Chuli and Gimmigela Chuli, and runs up to the Jongsang La. The eastern ridge in Sikkim includes Siniolchu. The southern section runs along the Nepal-Sikkim border and includes Kabru I to III. This ridge extends southwards to the Singalila Ridge.Mason, K. (1932). The Recent Assaults on Kangchenjunga: Review. The Geographical Journal 80 (5): 439–445. The western ridge culminates in the Kumbhakarna, also known as Jannu.\n\nFour main glaciers radiate from the peak, pointing roughly to the north-east, south-east, north-west and south-west. The Zemu glacier in the north-east and the Talung glacier in the south-east drain to the Teesta River; the Yalung glacier in the south-west and the Kangchen glacier in the north-west drain to the Arun and Kosi rivers.Freshfield, D. W. (1902). [https://archive.org/stream/geographicaljou17britgoog#page/n492/mode/2up The Glaciers of Kangchenjunga]. The Geographical Journal 19: 453–475.\nThe glaciers spread over the area above approximately 5000 m, and the glacialized area covers about 314 km2 in total.Asahi, K. (1999). Data on inventoried glaciers and its distribution in eastern part of Nepal Himalaya. Data Report 2, Basic studies for assessing the impacts of the global warming on the Himalayan cryosphere, 1994–1998. Institute for Hydrospheric-Atmospheric Sciences, Nagoya University and Department of Hydrology and Meteorology, HMG/Nepal. There are 120 glaciers in the Kanchenjunga Himal, of which 17 are debris-covered. Between 1958 and 1992, more than half of 57 examined glaciers had retreated, possibly due to rising of air temperature.Ashahi, K., Watanabe, T. (2000). Past and recent glacier ﬂuctuations in Kanchenjunga Himal, Nepal. Journal of Nepal Geological Society (22): 481–490.\n\nKangchenjunga Main is the highest elevation of the Brahmaputra River basin, which forms part of the southeast Asian monsoon regime and is among the globally largest river basins.Bajracharya, S. R., Palash, W., Shrestha, M. S., Khadgi, V. R., Duo, C., Das, P. J., & Dorji, C. (2015). Systematic Evaluation of Satellite-Based Rainfall Products over the Brahmaputra Basin for Hydrological Applications. Advances in Meteorology: 398687.\nKangchenjunga is one of six peaks above 8000 m located in the basin of the Koshi river, which is among the largest tributaries of the Ganges.Shijin, W., & Tao, Z. (2014). Spatial change detection of glacial lakes in the Koshi River Basin, the Central Himalayas. Environmental Earth Sciences 72(11): 4381–4391.\nThe Kangchenjunga massif forms also part of the Ganges Basin.\n\nAlthough it is the third highest peak in the world, Kangchenjunga is only ranked 29th by topographic prominence, a measure of a mountain's independent stature. The key col for Kangchenjunga lies at a height of 4664 m, along the watershed boundary between Arun and Brahmaputra rivers in Tibet. It is however, the 4th most prominent peak in the Himalaya, after Everest, and the western and eastern anchors of the Himalaya, Nanga Parbat and Namcha Barwa, respectively.\n\nClimbing routes \n\nThere are four climbing routes to reach the summit of Kangchenjunga, three of which are in Nepal from the southwest, northwest and northeast, and one from northeastern Sikkim in India. To date, the northeastern route from Sikkim has been successfully used only three times. The Indian government has banned expeditions to Kanchenjunga, and therefore this route has been closed since 2000.\n\nClimbing history\n\nEarly reconnaissances and attempts\n\n* Between April 1848 and February 1849, Joseph Dalton Hooker explored parts of northern Sikkim and eastern Nepal, mainly to collect plants and study the distribution of Himalayan flora. He was based in Darjeeling, and made repeated excursions in the river valleys and into the foothills of Kangchenjunga up to an altitude of 15620 ft.\n* In spring 1855, the German explorer Hermann Schlagintweit travelled to Darjeeling but was not allowed to proceed further north due to the Nepalese-Tibetan War. In May, he explored the Singalila Ridge up to the peak of Tonglo for a meteorological survey.\n* In 1879, Sarat Chandra Das and Lama Ugyen-gyatso crossed into Tibet west of \"Kanchanjinga\" via eastern Nepal and the Tashilhunpo Monastery en route to Lhasa. They returned along the same route in 1881.Das, S. C. (1902). [https://archive.org/stream/journeytolhasace00dass#page/n9/mode/2up A Journey to Lhasa and central Tibet]. E. P. Dutton & Company, New York, John Murray, London.\n* In 1883, a party of William Woodman Graham together with two Swiss mountaineers climbed in the area of Kangchenjunga. They were the first who ascended Kabru within 30 - below the summit. They crossed the Kang La pass, and climbed a peak of nearly 19000 ft from which they examined Jannu. They concluded it was too late in the year for an attempt and returned once again to Darjeeling.Blaser, W. and G. Hughes (2009). [http://www.himalaya-info.org/Kabru%20Alpine%20Journal%202010.pdf Kabru 1883. A Reassessment]. The Alpine Journal 114: 219–228.\n* Between October 1885 and January 1886, Rinzin Namgyal surveyed the unexplored north and west sides of Kangchenjunga. He was the first native surveyor to map the circuit of Kangchenjunga and provided sketches of each side of the peak and the adjoining valleys. He also defined the frontiers of Nepal, Tibet and Sikkim in this area.Ward, M. (2001). [http://www.alpinejournal.org.uk/Contents/Contents_2001_files/AJ%202001%20191-196%20Ward%20Kangchenjunga.pdf Early Exploration of Kangchenjunga and South Tibet by the pundits Rinzin Namgyal, Sarat Chandra Das and Lama Ugyen Gyatso]. The Alpine Journal 106: 191–196.\n* In 1899, British mountaineer Douglas Freshfield set out with his party comprising the Italian photographer Vittorio Sella. They were the first mountaineers to examine the lower and upper ramparts, and the great western face of Kangchenjunga, rising from the Kangchenjunga Glacier.\n* In 1905, a party headed by Aleister Crowley was the first attempt at climbing the mountain. Aleister Crowley had been part of the team attempting the 1902 ascent of K2. The team reached an estimated altitude of 6500 m on the southwest side of the mountain before turning back. The exact height reached is somewhat unclear; Crowley stated that on 31 August, \"We were certainly over 21000 ft and possibly over 22000 ft\", when the team was forced to retreat to Camp 5 by the risk of avalanche. On 1 September, they evidently went further; some members of the team, Reymond, Pache and Salama, \"got over the bad patch\" that had forced them to return to Camp 5 the day before, and progressed \"out of sight and hearing\" before returning to Crowley and the men with packs, who could not cross the dangerous section unassisted with their burdens. It is not clear how far Reymond, Pache and Salama had ascended – but in summarizing, Crowley ventured \"We had reached a height of approximately 25000 ft.\" Attempting a \"mutinous\" late-in-the-day descent from Camp 5 to Camp 4, climber Alexis Pache (who earlier that day had been one of three to ascend possibly higher than any before), and three local porters, were killed in an avalanche. Despite the insistence of one of the men that \"The demon of Kangchenjunga was propitiated with the sacrifice\", Crowley decided enough was enough and that it was inappropriate to continue.Crowley, A.; Symonds, J.; Grant, K. (1989). The confessions of Aleister Crowley: an autobiography [http://hermetic.com/crowley/confessions/chapter52.html Chapter 52] Arkana, London\n* In 1907, two Norwegians set about climbing Jongri via the Kabru glacier to the south, an approach apparently rejected by Graham's party. Progress was very slow, partly because of problems with supplies and porters, and presumably also lack of fitness and acclimatisation. However, from a high camp at about 22600 ft they were eventually able to reach a point 50 or below the summit before they were turned back by strong winds.\n* In 1929, the German Paul Bauer led an expedition team that reached 7400 m on the northeast spur before being turned back by a five-day storm.Bauer, P. (1955). Kangchenjunga Challenge. William Kimber, London.\n* In May 1929, the American E. F. Farmer left Darjeeling with native porters, crossed the Kang La into Nepal and climbed up towards the Talung Saddle. When his porters refused to go any further, he climbed alone further upwards through drifting mists but did not return.\n* In 1930, Günter Dyhrenfurth led an international expedition comprising the German Uli Wieland, Austrian Erwin Schneider and Englishman Frank Smythe who attempted to climb Kangchenjunga. They failed due to poor weather and snow conditions.\n* In 1931, Paul Bauer led a second German expedition team who attempted the northeast spur before being turned back by bad weather, illnesses, and deaths. The team retreated after climbing only a little higher than the 1929 attempt.\n* In 1954, John Kempe led a party comprising J. W. Tucker, S. R. Jackson, G. C. Lewis, T. H. Braham and medical officer Dr. D. S. Mathews. They explored the upper Yalung glacier with the intention to discover a practicable route to the great ice-shelf that runs across the south-west face of Kangchenjunga.Braham, T. H. (1955–56). [http://www.himalayanclub.org/journal/kangchenjunga-reconnaissance-1954/ Kangchenjunga Reconnaissance, 1954]. The Himalayan Journal Volume 19. This reconnaissance led to the route used by the successful 1955 expedition.Braham, T. H. (1996). [http://www.alpinejournal.org.uk/Contents/Contents_1996_files/AJ%201996%2033-35%20Braham%20Kangchenjunga.pdf Kangchenjunga: The 1954 Reconnaissance]. The Alpine Journal 101: 33–35.\n\nFirst ascent\n\nIn 1955, Joe Brown and George Band made the first ascent on 25 May, followed by Norman Hardie and Tony Streather on 26 May. The full team also included John Clegg (team doctor), Charles Evans (team leader), John Angelo Jackson, Neil Mather, and Tom Mackinnon.\n\nThe ascent proved that Aleister Crowley's 1905 route (also investigated by the 1954 reconnaissance) was viable. The route starts on the Yalung Glacier to the southwest of the peak, and climbs the Yalung Face, which is 3000 m high. The main feature of this face is the \"Great Shelf\", a large sloping plateau at around 7500 m, covered by a hanging glacier. The route is almost entirely on snow, glacier, and one icefall; the summit ridge itself can involve a small amount of travel on rock. The first ascent expedition made six camps above their base camp, two below the Shelf, two on it, and two above it. They started on 18 April, and everyone was back to base camp by 28 May.\n\nOther notable ascents\n\n* 1973 Yutaka Ageta and Takeo Matsuda of the Japanese expedition summitted Kangchenjunga West (Yalung Kang) by climbing the SW Ridge.\n* 1977 The second ascent of Kangchenjunga, by an Indian Army team led by Colonel Narendra Kumar. They completed the northeast spur, the difficult ridge that defeated German expeditions in 1929 and 1931.\n* 1978 Polish teams made the first successful ascents of the summits Kangchenjunga South (Wojciech Wróż and Eugeniusz Chrobak, 19 May) and Kangchenjunga Central (Wojciech Brański, Zygmunt Andrzej Heinrich, Kazimierz Olech, 22 May).Wojciech Wróż: Święta góra Sikkimu. Warszawa: \"Sport i Turystyka\", 1982. . \n* 1979 The third ascent, on 16 May, and the first without oxygen, by Doug Scott, Peter Boardman and Joe Tasker establishing a new route on the North Ridge\n* 1982 The 6th of May sees Ang Dorje, Friedel Mutschlechner, and Reinhold Messner (suffering from amoebic liver abscess) reach the top by a variation on the North Face route without supplemental oxygen.\n* 1983 Pierre Beghin made the first solo ascent. It was accomplished without the use of supplemental oxygen.\n* 1986 On 11 January, Krzysztof Wielicki and Jerzy Kukuczka, Polish climbers, made the first winter ascent. Otto Guilherme Gerstenberger Junior (Brazilian) and Johann Krigeer (South African) reach the peak without using supplemental oxygen.\n* 1988 First successful American Expedition; led by Carlos Buhler, from the North Face. Summiting were Buhler, Peter Habeler (Austrian) and Martin Zabaleta (Spanish)\n* 1989 A Soviet expedition successfully traversed all four summits of Kangchenjunga that are higher than 8,000m. Two separate teams traversed the summits in opposite directions.\n* 1989 American Expedition led by Lou Whittaker, with six people summiting on the Northwall: George Dunn, Craig van Hoy, Ed Viesturs, Phil Ershler, Larry Nielson, Greg Wilson.\n* 1991 Slovenian Marija Frantar and Joze Rozman attempted the first ascent by a woman. Their bodies were later found below the summit headwall.\n* 1991 Slovenian Andrej Štremfelj and Marko Prezelj completed an alpine-style climb up the south ridge of Kangchenjunga to the south summit (8,494 m).\n* 1992 Carlos Carsolio made the only summit that year. It was in a solo climb without supplementary oxygen.\n* 1992 Wanda Rutkiewicz, the first woman in the world to ascend and descend K2 and a world-renowned Polish climber, died after she insisted on waiting for an incoming storm to pass, which she did not survive.\n* 1995 Benoît Chamoux, Pierre Royer and their Sherpa guide disappeared on 6 October near the summit.\n* 1998 Ginette Harrison was the first woman who climbed Kangchenjunga North face.\n* 2005 Alan Hinkes, a British climber, was the only person to summit in the 50th anniversary of the first ascent year.\n* 2006 Gerlinde Kaltenbrunner, an Austrian mountaineer, was the second woman to reach the summit.\n* 2009 Jon Gangdal and Mattias Karlsson reached the summit, becoming, respectively, the first Norwegian and the first Swedish mountaineer to summit this mountain.\n* 2009 Edurne Pasaban, a Spanish mountaineer, reached the summit becoming the first woman to summit twelve eight-thousanders.\n* In May 2009, Kinga Baranowska was the first Polish woman to reach the summit of Kangchenjunga.Mysza (2009). [http://wspinanie.pl/serwis/200905/18kinga-baranowska-kangchenjunga.php Kinga Baranowska zdobyła Kangchenjungę]. wspinanie.pl, 18 May 2009.\n* 2011 Tunc Findik became the first Turkish man to reach the peak of Kangchenjunga, his seventh eight thousander, with Swiss partner Guntis Brandts via the British 1955 SW Face route.\n* 2011 Indian mountaineers Basanta Singha Roy and Debasish Biswas of Mountaineers' Association of Krishnanagar (MAK), West Bengal, India, successfully scaled Kangchenjunga Main on 20 May 2011.\n* In May 2013, five climbers including Hungarian Zsolt Erőss and Péter Kiss reached the summit, but disappeared during the descent.\n* In May 2014, Bulgarian Boyan Petrov reached the peak without the use of supplemental oxygen. Petrov is a diabetic.[http://www.monitor.bg/article?id=431481 Тайнствен глас водил Боян Петров към върха] , Монитор\n\nDespite improved climbing gear the fatality rate of climbers attempting to summit Kanchenjunga is high. Since the 1990s, more than 20% of people died while climbing Kanchenjunga's main peak.\n\nTourism\n\nSome of the most famous views of Kangchenjunga are from the hill station of Darjeeling and Antu Dada of Ilam, Nepal. The Darjeeling War Memorial is among the most visited places from which Kangchenjunga is observed. On a clear day it presents an image not so much of a mountain but of a white wall hanging from the sky. The people of Sikkim revere Kangchenjunga as a sacred mountain. Permission to climb the mountain from the Indian side is rarely given.\n\nDue to its remote location in Nepal and the difficulty involved in accessing it from India, the Kangchenjunga region is not much explored by trekkers. It has, therefore, retained much of its pristine beauty. In Sikkim too, trekking into the Kangchenjunga region has just recently been permitted. The Goecha La trek is gaining popularity amongst tourists. It goes to the Goecha La Pass, located right in front of the huge southeast face of Kangchenjunga. Another trek to Green Lake Basin has recently been opened for trekking. This trek goes to the Northeast side of Kangchenjunga along the famous Zemu Glacier. The film Singalila in the Himalaya is journey around Kangchenjunga.\n\nIn myth\n\nThe area around Kangchenjunga is said to be home to a mountain deity, called Dzö-ngaAnna Belikci Denjongpa, [http://himalaya.socanth.cam.ac.uk/collections/journals/bot/pdf/bot_2002_02_01.pdf Kangchendzönga: Secular and Buddhist perceptions of the mountain deity of Sikkim among the Lhopos] or \"Kangchenjunga Demon\", a type of yeti or rakshasa. A British geological expedition in 1925 spotted a bipedal creature which they asked the locals about, who referred to it as the \"Kangchenjunga Demon\".\n\nFor generations, there have been legends recounted by the inhabitants of the areas surrounding Mount Kanchenjunga, both in Sikkim and in Nepal, that there is a valley of immortality hidden on its slopes. These stories are well known to both the original inhabitants of the area, the Lepcha people, and those of the Tibetan Buddhist cultural tradition. In Tibetan, this valley is known as Beyul Demoshong. In 1962 a Tibetan Lama by the name of Tulshuk Lingpa led over 300 followers into the high snow slopes of Kanchenjunga to ‘open the way’ to Beyul Demoshong. The story of this expedition is recounted in the 2011 book A Step Away from Paradise.\n\nIn literature\n\n* In the Swallows and Amazons series of books by Arthur Ransome, a high mountain (unnamed in the books, but clearly based on the Old Man of Coniston in the English Lake District) is given the name \"Kanchenjunga\" by the children when they climb it in 1931.\n* In The Epic of Mount Everest, first published in 1926, Sir Francis Younghusband: \" For natural beauty Darjiling (Darjeeling) is surely unsurpassed in the world. From all countries travellers come there to see the famous view of Kangchenjunga, 28150 ft in height, and only 40 mi distant. Darjiling (Darjeeling) itself is 7000 ft above sea-level and is set in a forest of oaks, magnolia, rhododendrons, laurels and sycamores. And through these forests the observer looks down the steep mountain-sides to the Rangeet River only 1000 ft above sea-level, and then up and up through tier after tier of forest-clad ranges, each bathed in a haze of deeper and deeper purple, till the line of snow is reached; and then still up to the summit of Kangchenjunga, now so pure and ethereal we can scarcely believe it is part of the solid earth on which we stand; and so high it seems part of the very sky itself.\"\n* In 1999, official James Bond author Raymond Benson published High Time to Kill. In this story, a microdot containing a secret formula for aviation technology is stolen by a society called the Union. During their escape, their plane crashes on the slopes of Kangchenjunga and James Bond becomes part of a climbing expedition in order to retrieve the formula.\n* The Inheritance of Loss by Kiran Desai, which won the 2006 Man Booker Prize, is set partly in Kalimpong, a hill station situated near Kangchenjunga.\n*In Legend of the Galactic Heroes by Yoshiki Tanaka, which won the Seiun Award for \"Best Novel of the Year\" in 1988 and was adapted into an anime series by Kitty Films, the capital and holiest temple of the Terraist Cult is on Earth beneath the rubble of Kangchenjunga.\n*Michelle Paver's 2016 ghost story Thin Air concerns a fictional expedition to climb Kangchenjunga in 1935, and an earlier (also fictional) expedition in 1906.\n* The book Round Kangchenjunga – A Narrative of Mountain Travel and Exploration by Douglas Freshfield gives a complete account of his travel around Kangchenjunga. Kangchenjunga. http://en.wikipedia.org/?curid=17073."
  }
}
