{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20311",
  "eid" : "414ef4f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778618815,
  "textBody" : "A military academy or service academy (in the United States) is an educational institution which prepares candidates for service in the officer corps. It normally provides education in a military environment, the exact definition depending on the country concerned.\n\nThree types of academy exist: pre-school-level institutions awarding academic qualifications, university-level institutions awarding bachelor's degree level qualification, and those preparing officer cadets for commissioning into the armed services of the state.\n\nHistory\n\nThe first military academies were established in the 18th century to provide future officers for technically specialized corps, such as engineers and artillery, with scientific training.\n\nThe Royal Danish Naval Academy was set up in 1701, making it the oldest military academy in existence.  The Royal Military Academy, Woolwich was set up in 1720 as the earliest military academy in Britain. Its original purpose was to train cadets entering the Royal Artillery and Royal Engineers. In France, the École Royale du Génie at Mézières was founded in 1748, followed by a non-technical academy in 1751, the École Royale Militaire offering a general military education to the nobility. French military academies were widely copied in Prussia, Austria, Russia and even minor powers, including Turin and the Kingdom of Savoy, in the late 18th century.\n\nBy the turn of the century, under the impetus of the Napoleonic Wars and the strain that the armies of Europe subsequently came under, military academies for the training of commissioned officers of the army were set up in most of the combatant nations. These military schools had two functions; to provide instruction for serving officers in the functions of the efficient staff-officer, and to school youngsters before they gained an officer's commission. The Kriegsakademie in Prussia was founded in 1801 and the École spéciale militaire de Saint-Cyr was created by order of Napoleon Bonaparte in 1802 as a replacement for the École Royale Militaire of the Ancien Régime (the institution that Napoleon himself had graduated from).\n\nThe Royal Military College, Sandhurst, in England was the brainchild of John Le Marchant in 1801,[https://da.mod.uk/colleges/jscsc/jscsc-library/artwork/major-general-john-gaspard-le-marchant-1766-1812 Major-General John Gaspard Le Marchant (1766-1812)]  Defence Academy who established schools for the military instruction of officers at High Wycombe and Great Marlow, with a grant of £30,000 from Parliament. The two original departments were later combined and moved to Sandhurst. In the United States, the military academy at West Point was founded in 1802 and became popular in the 1860s.\n\nTypes\n\nPre-collegiate institutions\n\nA military school teaches children (primarily boys) of various ages (elementary school, middle school or high school) in a military environment which includes training in military aspects, such as drill. Many military schools are also boarding schools, and others are simply magnet schools in a larger school system. Many are privately run institutions, though some are public and are run either by a public school system (such as the Chicago Public Schools) or by a state.\n\nA common misconception results because some states have chosen to house their juvenile criminal populations in higher-security boarding schools that are run in a manner similar to military boarding schools. These are also called reform schools, and are functionally a combination of school and prison. They attempt to emulate the environment of military boarding schools in the belief that a strict structured environment can reform these children. This may or may not be true. However, their environment and target population are different from those of military schools.Linton Hall Cadet, Linton Hall Military School Memories: One cadet's memoir, Arlington, Virginia.: Scrounge Press, 2014  describes a military school for boys ages 6-16.\n\nPopular culture sometimes shows parents sending or threatening to send unruly children off to military school (or boarding school) to teach them good behavior (e.g., in the \"Army of One\" episode of The Sopranos, Tony and Carmela Soprano consider sending their son, AJ, to the Hudson Military Institute). A similar situation appears in Bill & Ted's Excellent Adventure, while other fictional depictions don't show military academies as punishment (threats) (ex. Damien: Omen II and The Presidio.\n\nAdult institutions\n\nA college-level military academy is an institute of higher learning of things military. It is part of a larger system of military education and training institutions. The primary educational goal at military academies is to provide a high quality education that includes significant coursework and training in the fields of military tactics and military strategy. The amount of non-military coursework varies by both the institution and the country, and the amount of practical military experience gained varies as well.\n\nMilitary academies may or may not grant university degrees.  In the U.S., graduates have a major field of study, earning a Bachelor's degree in that subject just as at other universities.  However, in British academies, the graduate does not achieve a university degree, since the whole of the one-year course (nowadays undertaken mainly but not exclusively by university graduates) is dedicated to military training.\n\nThere are two types of military academies: national (government-run) and state/private-run.\n*Graduates from national academies are typically commissioned as officers in the country's military. The new officers usually have an obligation to serve for a certain number of years. In some countries (e.g. Britain) all military officers train at the appropriate academy, whereas in others (e.g. the United States) only a percentage do and the service academies are seen as institutions which supply service-specific officers within the forces (about 15 percent of US military officers).\n*State or private-run academy graduates have no requirement to join the military after graduation, although some schools have a high rate of graduate military service. Today, most of these schools have ventured away from their military roots and now enroll both military and civilian students. The only exception in the United States is the Virginia Military Institute which remains all-military.\n\nList of military academies by countries\n\nAfghanistan\n\n*Afghanistan National Army Officer Academy\n*National Military Academy of Afghanistan\n*Officer Candidate School, Kabul (OCS)\n\nAlbania\n\n*Skanderbeg Military University\n\nAngola\n\n* Army Military Academy\n* National Air Force Academy\n* Naval Academy\n\nArgentina\n\nArgentine Army\n*Colegio Militar de la Nación (National Military College), located in El Palomar, Buenos Aires\nArgentine Navy\n*Escuela Naval Militar (Naval Military School), located in Río Santiago, Buenos Aires\nArgentine Air Force\n*Escuela de Aviación Militar (Military Aviation School), located in the city of Córdoba\n\nArmenia \n\n* Monte Melkonian Military Academy\n* National Institute for Strategic Studies \n* Vazgen Sargsyan Military Institute\n\nAustralia\n\n*Australian Defence Force Academy\n*Royal Military College, Duntroon\n*Officers' Training School RAAF\n*Royal Australian Naval College\n\nAustria\n\n*Theresian Military Academy\n*Landesverteidigungsakademie\n\nAzerbaijan \n\n* Academy of the Ministry of National Security\n* Azerbaijan Higher Naval School \n* Azerbaijan Higher Military School\n* Police Academy of the Ministry of Internal Affairs\n\nBangladesh\n\n*Bangladesh Military Academy\n*Bangladesh Naval Academy\n*Bangladesh Air Force Academy\n*University Of Professionalshttp://www.bup.edu.bd/ Bangladesh (BUP), Mirpur, Dhaka\n*Bangladesh National Cadet Corps (BNCC)\n*Military Institute of Science and Technology, Mirpur, Dhaka\n*Armed Forces Medical College  (AFMC), Airport Road, Dhaka\n*School of Infantry and Tactics\n*Defence Services Command and Staff College\n*National Defence College\n*Armoured Corps Center & School\n*Engineer Centre and School of Military Engineering\n*Signal Training Centre and School\n*Ordnance Corps Centre & School\n*Bangladesh Institute of Peace Support Operation Training (BIPSOT)\n*Electrical and Mechanical Engineering Centre and School\n*Corps of Military Police Centre and School\n*Army School of Education and Administration\n*Army School of Physical Training and Sports\n*Army School of Music\n*Artillery Center and School\n*School of Military Intelligence\n*Army Computer Training School\n*Non Commissioned Officers Academy\n*Trust Technical Training Institute, Gazipur\n\nCadet Colleges in Bangladesh\n\nThere are 12 Cadet Colleges in Bangladesh. Among these, nine for boys and three for girls. Four Cadet Colleges were established before 1971. Other cadet colleges were built after the Liberation War of Bangladesh.\n\nBelarus \n\n* Military Academy of Belarus\n* Minsk Suvorov Military School\n\nBelgium\n\n*Royal Military Academy (Belgium)\n\nBolivia\n\n*Military College of Bolivia (Colegio Militar del Ejército de Bolivia)\n*Bolivian Military Naval Academy\n* Bolivian Air Force Academy\n\nBrazil\n\nHas several military academies:\n* Army – The biggest Academy is Academia Militar de Agulhas Negras (AMAN) in the municipality of Resende, in state of Rio de Janeiro, in the southeast of that country. For high school level, The Sistema Colégio Militar do Brasil (SCMB) is composed for 13 military schools in Belo Horizonte, Belém, Brasília, Campo Grande, Curitiba, Fortaleza, Juiz de Fora (MG), Manaus, Porto Alegre, Recife, Rio de Janeiro, Salvador and Santa Maria (RS).\n* Navy – [Escola Naval] was founded in 1823 and is located on Villegagnon island, near downtown Rio de Janeiro. The location of the school has historical significance during the French invasions of the then Portuguese Colony in 1555. The Brazilian Navy also prepares students at the High School level at Colégio Naval in preparation for the Naval Academy (Escola Naval). Colégio Naval was founded in 1876 and is located at Enseada Almirante Batista das Neves em Angra dos Reis.\n* Air Force – Academia da Força Aérea (AFA). (Air Force Academy) and Escola Preparatória de Cadetes do Ar(EPCAr).\n\nBulgaria\n\n* Vasil Levski National Military University founded in 1878 as a military school in Plovdiv\n**Air force Faculty located in Dolna Mitropoliya\n**Artillery, Air Defence and CIS Faculty located in Shumen\n**All-Force Faculty faculty located in Veliko Tarnovo\n* Nikola Vaptsarov Naval Academy located in Varna and founded in 1881 as Naval Machinery School in Rousse\n* Rakovski Defence and Staff College located in Sofia. It was founded with an Act of the 15th National Assembly of 1 March 1912 in Sofia\n\nCanada\n\nCanada currently has one military-theme private boarding school open for students at the pre-university level, Robert Land Academy (RLA), which is located in West Lincoln, Ontario. Founded in 1978, it is an all-boys' institute whose funding arises solely from tuition fees. The Academy is an institute fully accredited by the province of Ontario, which accepts students from Grade 6 to Grade 12 (the Ontario Academic Credit level).\n\nCanada formerly had three university level service academies, the Canadian Military Colleges.  These included the Royal Military College of Canada (RMC) in Kingston, Ontario, Royal Roads Military College (RRMC) in Victoria, British Columbia and the Collège militaire royal de Saint-Jean (CMR) in Saint-Jean-sur-Richelieu, Québec.  RMC was founded in 1876, RRMC in 1941 and CMR in 1954.H16511 Dr. Richard Arthur Preston \"To Serve Canada: A History of the Royal Military College of Canada\" 1997 Toronto, University of Toronto Press, 1969. By the 1960s all three institutions were providing military education to officer cadets of all three elements in the Canadian Forces; the navy, army and air force; and RMC received the authority to grant academic degrees in Arts, Science and Engineering.4237 Dr. Adrian Preston & Peter Dennis (Edited) \"Swords and Covenants\" Rowman And Littlefield, London. Croom Helm. 1976.\n\nGraduates of the Colleges are widely acknowledged to have had a disproportionate impact in the Canadian services and society, thanks to the solid foundations provided by their military education.H16511 Dr. Richard Preston \"R.M.C. and Kingston: The effect of imperial and military influences on a Canadian community\" 1968 Military discipline and training, as well as a focus on physical fitness and fluency in both of Canada's two official languages, English and French, provided cadets with ample challenges and a very fulfilling experience.H1877 R. Guy C. Smith (editor) \"As You Were! Ex-Cadets Remember\". In 2 Volumes. Volume I: 1876-1918. Volume II: 1919-1984. Royal Military College. [Kingston]. The R.M.C. Club of Canada. 1984 In 1995 the Department of National Defence was forced to close Royal Roads Military College and Collège militaire royal de Saint-Jean due to budget considerations, but Royal Military College of Canada continues to operate.\"To Serve Canada: A History of the Royal Military College since the Second World War\", Ottawa, University of Ottawa Press, 1991.\nRoyal Roads reopened as a civilian university in the fall of 1995, and is maintained by the Government of British Columbia. In 2007, the Department of National Defence reopened Collège militaire royal de Saint-Jean as a preparatory and first year college.\n\nChina, People's Republic of\n\n*PLA National Defense University\n\nChina (Taiwan), Republic of\n\n*R.O.C. Military Academy\n*R.O.C. Naval Academy\n*R.O.C. Air Force Academy\n*R.O.C. Air Force Institute of Technology\n*Army Academy R.O.C.\n*National Defense University\n** War College\n** Army Command and Staff College\n** Naval Command and Staff College\n** Air Force Command and Staff College\n** Institute of Technology\n** Management College\n** Political Warfare College\n*National Defense Medical Center\n*Chung-cheng Armed Forces Preparatory School\n\nColombia\n\nNational Army of Colombia:\n*José María Córdova Military School, located in Bogotá.\n*Colombian Army NCO School\nColombian Air Force:\n*Marco Fidel Suarez Military Aviation School, located in Cali.\nColombian Naval Infantry and Colombian Navy:\n*Admiral Padilla Naval Academy, located in Cartagena de Indias.\nNational Police of Colombia:\n*General Santander National Police Academy, located in Bogotá.\n\nCzech Republic\n\n*Univerzita Obrany (University of Defence)\n* http://www.unob.cz/en/\n*Vojenská akademie a velitelství výcviku (Military academy and training command)\n* http://www.vavyskov.cz/\n\nDenmark\n\n*Royal Danish Defence College\n*Royal Danish Military Academy\n*Royal Danish Naval Academy\n*Royal Danish Air Force Officers School\n\nEgypt\n\n*Egyptian Air Defense Academy\n*Egyptian Military Technical College\n*Egyptian Military medical college\n*Egyptian Air Academy\n*Egyptian Military Academy\n*Egyptian Naval Academy\n\nEl Salvador\n\n*Escuela Militar Capitan General Gerardo Barrios\n\nEstonia\n\n*Estonian National Defence College\n*Baltic Defence College, both in Tartu\n\nFinland\n\n \n*Finnish National Defence University (Maanpuolustuskorkeakoulu), located on Santahamina island, Helsinki\n*Maanpuolustusopisto (defunct)\n\nFrance\n\nHigh schools\n\n*Lycée militaire de Saint-Cyr\n*Lycée militaire d'Autun\n*Prytanée National Militaire\n*Lycée militaire d'Aix-en-Provence\n*Lycée naval de Brest\n*École des Pupilles de l'Air\n\nOfficer academies\n\n*École spéciale militaire de Saint-Cyr (ESM, literally the \"Special Military School of St Cyr\") is the French Military Academy. It is often referred to as \"Saint-Cyr\". Founded by Napoleon in 1802, and initially located in Fontainebleau, it was moved first to Saint-Cyr-l'École in 1808, and then to Coëtquidan (Brittany) in 1945.\n*École militaire interarmes (EMIA)\n*École des commissaires des armées (ECA), founded in 2013\n*École de l'air: the French Air Force Academy\n*École Navale: the French Naval Academy\n* École des officiers de la gendarmerie nationale (EOGN): gendarmerie commissioned officers academy\n*École Polytechnique (X): a French engineering grande école of military status. Though all of its French engineering students are enlisted and trained as officers, 5% of its graduates remain in the military after graduation.\n* ÉNSTA Bretagne: a French engineering grande école of military status. Only 1/4 of its students are actual officers-in-training.\n* Ecole de Santé des Armées: medical school of French army\n* National Military Infrastructure Engineers Academy: trains military engineers of the Armed Forces, opened 2013 (also one of the newest)\n\nPostgraduate academies\n\n* École d'état-major (Staff school): first step of higher military studies, for officer of OF-2 rank.\n* École de Guerre (War School): second step of higher military studies, mainly for ranks OF-2 and OF-3 who want to continue the command track (e.g. to command battalion or regiment).\n* Collège d'enseignement supérieur de l'armée de terre (Army Higher Education College): second step of military education, but for officers whishing to achieve a high-level specialization.\n** Cours supérieur d'état-major (Advanced Staff Course)\n** Enseignement militaire supérieur scientifique et technique (Higher Technical and Scientific Education).\n* Centre des hautes études militaire (Center for Advanced Military Studies): final step of military education, for very few selected OF-5. Its students also attend the civilian institut des hautes études de défense nationale.\n\nGeorgia\n\nNational Defense Academy (NDA) of Georgia is a descendant of the first Georgian \"Junker School\" which was established in 1919 right after the declaration of independence. Establishment of the military school was very important for the identity of a new democratic nation-state. The school was abolished after Soviet occupation of Georgia in 1921.\n\n\"Davit Aghmashenebeli National Defense Academy of Georgia\" was founded on May 28, 1993. The length of studies at the Academy had been defined for 4 years. In 2005, due to the need of the growth of the personnel strength of the Georgian Armed Forces (GAF), the system of the Academy has been transformed to retain only the 18-month-long officer training courses. A bachelor's degree has been defined as a prerequisite for the admission of the cadets.\n\nIn 2010, the NDA has undergone a new wave of the reforms to include entire officer education system. As a result, in 2011, Cadet Bachelor School, Junior Officer Basic School, Aviation and Air Defense Officer Basic School, Medical Officer School, Captain Career School, Command and General Staff School, School of Advance Defense Studies and Language Training School were included within the NDA.\n\nUpon entry into NDA, cadets sign a contract with the MoD for 10 years of military service, of which 4 years are dedicated to studies and 6 years – to consequent military service. Cadets receive the rank of Lieutenant upon graduation.\n\nNDA is established by the MoD with the status of the Legal Entity of Public Law. At the same time, NDA maintains very strong link with The Ministry of Education and Science according to the process of Bologna.\n\nGermany\n\nGermany has a unique system for civil and military education. The only true military academy is the Führungsakademie der Bundeswehr where mainly future staff officers and general staff officers are further trained.\n\nThe standard education in military leadership is the task of the Offizierschulen (officers' schools) run by the three branches. The contents differ from branch to branch. In the army all officers are at least trained to lead a platoon. There they also have to pass an officer exam to become commissioned later on.\n\nMoreover, there exist so called Waffenschulen (school of weapons) like infantry school or artillery school. There the officers learn to deal with the typical tasks of their respective corps.\nA specialty of the German concept of officer formation is the academic education. Germany runs two own Universities of the German Federal Armed Forces where almost every future officer has to pass non-military studies and achieve a bachelor's or master's degree. During their studies (after at least three years of service) the candidates become commissioned Leutnant (second-lieutenant).\n\nThe three officer's schools are:\n* The German Navy supervises:\n** Naval Academy at Mürwik, located in Flensburg-Mürwik\n* The German Army supervises:\n** Offizierschule des Heeres, located in Dresden\n* The German Air Force supervises:\n** Offizierschule der Luftwaffe, located in Fürstenfeldbruck\n\nAcademic and staff education:\n* Universities of the German Federal Armed Forces\n** Helmut Schmidt University, located in Hamburg\n** Bundeswehr University Munich, located in Munich\n* Führungsakademie der Bundeswehr, located in Hamburg\n\nGreece\n\nThe Hellenic Armed Forces have military academies supervised by each branch of the Armed Forces individually:\n\n*The Hellenic Army supervises:\n**The Evelpidon Military Academy, located in Athens.\n**The Corps Officers Military Academy, located in Thessaloniki.\n*The Hellenic Air Force supervises:\n** The Icarus Air Force Academy, located in Tatoi (Athens).\n*The Hellenic Navy supervises:\n** The Hellenic Naval Cadets Academy, located in Piraeus.\n\nHungary\n\n* National University of Public Service (Successor of Royal Hungarian Ludovica Military Academy, which founded in 1808)\n** Faculty of Military Sciences and Officer Training\n\nIndia\n\n*National Defence Academy (NDA)\n*Indian Military Academy (IMA)\n*Officers Training Academy (OTA)\n*Indian Naval Academy (INA)\n*Air Force Academy, Dundigul\n*Air Force Technical College, Bangalore\nMilitary Schools\n1. 5 Rashtriya Military Schools across India in Belgaum Belgaum Military School, BangaloreBangalore Military School, ChailChail Military School, DholpurDholpur Military School and AjmerAjmer Military School \n*Classes 6 to 12, run by the Integrated Headquarters of Ministry Of Defence (Army) of the Indian government\n*Educational institute to train for defence services, no combat training\n\nIndonesia\n\nThe Indonesian Military Academy http://www.akmil.ac.id/ was founded in Yogyakarta, October 13, 1945 by the order of General Staff Chief of Indonesia Army Lieutenant General Urip Sumohardjo  as the Militaire Academie (MA) Yogyakarta. \n\nCurrently, the Tentara Nasional Indonesia or the \"TNI\" (Indonesian National Armed Forces), under the supervision of the Commanding General of the Indonesian National Armed Forces Academy System (a three-star officer in billet) in the HQ of the Indonesian National Armed Forces, has divided the academies into the three respective services:\n\n* Indonesian Military Academy – \"AKMIL\" (Akademi Militer abbreviated Akmil), located in Magelang, Central Java, is under the supervision of the Indonesian Army Chief of Staff, operated since 1946.\n* Indonesian Naval Academy – \"A.A.L.\" (Akademi Angkatan Laut abbreviated AAL), located in Surabaya, East Java, is under the supervision of the Indonesian Navy Chief of Staff. The Indonesian Naval Academy also educates and forms officers to serve in the Indonesian Marine Corps. In existence since 1951. \n* Indonesian Air Force Academy – \"A.A.U.\" (Akademi Angkatan Udara abbreviated AAU), located in Yogyakarta, is under the supervision of the Indonesian Air Force Chief of Staff. The academy has three majorings which are: electronics, engineering, and administration. Following graduation, students who are selected as Pilot and Navigator conduct further training in the Pilot and Navigator Flight School prior bearing the Pilot/Navigator designation. Active since 1945, but also inherits the traditions of former Dutch military aviation schools.\n\nEach service academy is headed by a two-star general, and his/her deputy is a one-star officer. All the students (cadets/midshipman) are recruited from senior high school graduates from all over Indonesia. Shortly after graduation, they are commissioned as Letnan Dua (Second Lieutenant) in their respective services and get the Diploma IV (Associate degree, 4th Grade) comparable to civil academies or universities. The length term is now 4 years and is divided into 5 grades of cadet's rank, starting from the lowest:\n\n* Prajurit Taruna/Kadet/Karbol (Cadet Private), 1st year (4 months)\n* Kopral Taruna/Kadet/Karbol (Cadet Corporal), 1st year (8 months)\n* Sersan Taruna/Kadet/Karbol (Cadet Sergeant), 2nd year\n* Sersan Mayor Dua Taruna/Kadet/Karbol (Cadet Second Sergeant Major), 3rd year\n* Sersan Mayor Satu Taruna/Kadet/Karbol (Cadet First Sergeant Major), 4th year\n\nTaruna refers to cadets in the Military Academy, Kadet refers to cadets in the Naval Academy, and Karbol refers to cadets in the Air Force Academy, respectively.\n\nUntil 1999, before the Indonesian National Police officially separated from the armed forces, the Indonesian Police Academy (\"AKPOL\") also stood under the National Armed Forces Academy but now has separated from the Military and is under the auspices of the President of Indonesia controlled by the National Police Headquarters (Mabes Polri), where in the other hand the Armed Forces (Army, Naval, and Air Force) Academies of Indonesia is under the auspices of the Ministry of Defense controlled by the Armed Forces General Headquarters (Mabes TNI). Presently, the Police Academy is located in Semarang (Central Java), and is supervised under the supervision of the Chief of Indonesian National Police (Kapolri).\n\nAll 3 academies and the Police Academy have a joint 4th class cadet training program since 2008, after completing it the cadets go to their respective academies to continue with the 3 remaining years of study before commissioning.\n\nAs of January 2018, Rear Admiral Siwi Sukma Adji, S.E.,M.M is the Commanding General, INAF Academies System, with Major General Dody Usodo Hargo, S.Ip.,M.M as the assistant commander. The Academies System was founded on 16 December 1965.\n\nIran \n\nImam Ali Officers' University (Persian: دانشگاه افسری امام علی; acronym: دا اف, DĀʿAF),  formerly known as Officers' School (Persian: دانشکده افسری) is the military academy of Ground Forces of Islamic Republic of Iran Army, located in Tehran, Iran. Cadets of the academy achieve the second Lieutenant rank upon graduation and join one of Islamic Republic of Iran Army branches.\n\nItaly\n\nHigh School level institutions (only for Classical and Scientific Liceum, starting from grade 10):\n*Scuola Militare Nunziatella, founded during the Bourbon Period in 1787, in Italian Army, Naples\n*Scuola Militare Teulié, founded during the Napoleonic period in 1802, Italian Army, Milan\n*Scuola Militare Navale Morosini, Italian Navy, Venice\n*Scuola Militare Aeronautica Douhet, Italian Air Force, Florence\nThe 2009–2010 school year has been the first one with girls attending those schools.\n\nUniversity level institutions:\n*Military Academy of Modena\n*Scuola di Applicazione, Torino\n*Accademia Navale, Livorno\n*Accademia Aeronautica, Pozzuoli\n*Scuola Ufficiali Carabinieri, Rome\n*Accademia della Guardia di Finanza, Bergamo\n\nJapan\n\n*National Defense Academy of Japan (University level)\n*National Defense Medical College (Medical, university level)\n*Officer Candidate Training Schools (for each of Ground, Maritime and Air Self-defense forces)\n\nKazakhstan \n\n* Talgat Bigeldinov Military Institute of Air Defence Forces \n* National Defense University \n* Military institute of Land Forces\n* Military institute of Armed Forces\n\nKorea, North\n\n* Kim Il-sung Military University\n\nKorea, South\n\nThe three main military academies:\n* Korea Military Academy (Army)\n* Korea Naval Academy\n* Korea Air Force Academy\n\nOther military academies:\n* Korea Army Acaemy at Yeongcheon, formerly Korea Third Military Academy\n* Armed Forces Nursing Academy\n\nKyrgyzstan \n\n* Military Institute of the Armed Forces of the Kyrgyz Republic\n\nMalaysia\n\nSecondary level institutions:\n* Royal Military College (Malaysia) (Maktab Tentera Diraja)\n\nUniversity level:\n* National Defence University of Malaysia (University Pertahanan Nasional Malaysia) (foundation, bachelor's degree, master's degree, PhD and specialist courses)\n* Armed Forces Defence Collegehttp://maf.mod.gov.my/eng/training_institute/institute02.htm (Maktab Pertahanan Angkatan Tentera)\n\nSpecialist training & staff institutions:\n* Officers Cadet School in Port Dickson (OCS)\n* Malaysian Armed Forces Staff Collegehttp://www.mafsc.edu.my/ (Maktab Turus Angkatan Tentera)\n* Armed Forces Health Training Institute (Institut Latihan Kesihatan Angkatan Tentera)\n* Malaysian Peacekeeping Training Centre (Pusat Latihan Pengaman Malaysia)\n\nReserve Officer Training Units ( or ) or ROTU exists only in public universities in Malaysia. This is a tertiary institution based officer commissioning program to equip students as officer cadets with military knowledge and understanding for service as Commissioned Officers in the reserve components of the various branches of the Malaysian Armed Forces.\n\nMexico\n\n* Heroica Escuela Naval Militar\n* Heroico Colegio Militar\n* Colegio del Aire\n\nMoldova\n\n* Military Academy of Moldova\n\nMongolia \n\n* Mongolian Defense University\n\nMyanmar\n\n* Defence Services Academy\n* Defence Services Technological Academy\n* Defence Services Medical Academy\n* Officer Training School (Myanmar) (OTS)\n* National Defence College (Myanmar) (NDC)\n* Defence Services Institute of Nursing and Paramedical Science\n\nNamibia\n\n*Namibian Military School\n\nNetherlands\n\n*Koninklijke Militaire Academie\n*Royal Naval College (Netherlands)\n\nNew Zealand\n\nTier One – Initial Officer Training\n* New Zealand Commissioning Course, Waiouru (NZ Army)\n* Initial Officer Training, Woodbourne, (RNZAF)\n* Officer Training School, Devonport Naval Base\n\nTier Two – Junior Officer Education\n* NZDF Junior Staff Course, New Zealand Defence College\n\nTier Three – Senior Officer Education\n* NZDF Staff Course, New Zealand Defence College\n\nNigeria\n\nHigh school training\n\n* Nigerian Military School, Zaria – Nigerian Army military school for boys;\n* Air Force Military School, Jos, Nigeria, located in Jos – Nigerian Air Force military school for boys;\n* Air Force Girls Military School, Jos – Nigerian Air Force military school for girls.\n* Nigerian Navy Secondary School, Calabar. http://www.nnsscal.com/ \nUndergraduate officer training\n\n* Nigerian Defence Academy, Kaduna  – Nigerian Armed Forces university school;\nPostgraduate officer training\n\n* Armed Forces Command and Staff College, Jaji, at Jaji, Kaduna – joint Nigerian Armed Forces higher studies institute for both indigenous and international students.\n* Nigerian Army College of Logistics, Lagos – school for training middle career Nigerian Army officers on military logistics;\n* National Defence College, Abuja, – school for training senior officers of the Nigerian Armed Forces and also some members of the civil service.\n\nNorway\n\nUndergraduate officer training\n\n* Norwegian Military Academy, Linderud/Oslo (Norwegian Army)\n* Norwegian Naval Academy, Laksevåg/Bergen (Royal Norwegian Navy)\n* Norwegian Air Force Academy, Trondheim (Royal Norwegian Air Force)\n\nPostgraduate training\n\n* Norwegian Defence Staff College, Oslo (Joint)\n* Norwegian National Defence College, Oslo (Civil Service/Very senior officers)\n\nPakistan\n\n* Pakistan Military Academy, Kakul\n* Pakistan Air Force Academy, Risalpur\n* Pakistan Naval Academy, Karachi\n* Command and Staff College, Quetta\n* National Defence University, Islamabad\n* Pakistan Navy War College, Lahore\n* PAF Air War College, Karachi\n* Army Burn Hall College, for boys, Abbottabad\n* Army Public College of Management Sciences (public sector)\n* Military College Jhelum, Jhelum District\n* Military College Murree, Rawalpindi District\n* Military College Sui, Dera Bugti District\n\nPanama\n\nEscuela de Policia National Dr. Justo Arosemena \nhttp://www.policia.gob.pa/direcciones/dnrrhh/ces.html\n\nParaguay\n\nThe Francisco López Military Academy is located in Capiatá, Paraguay.\n\nPeru\n\nUndergraduate officer training\n* Chorrillos Military School (Peruvian Army)\n* Peruvian Naval School (Peruvian Navy)\n* Peruvian Air Force Officers' School (Peruvian Air Force)\n* Officers' School of the National Police of Peru (National Police of Peru)\n\nPhilippines\n\nThe Philippines patterned all its military academies after the United States Military Academy (WEST POINT) and the United States Merchant Marine Academy.\n\nThese colleges are operated by the Philippine Government which serves 4 years of different baccalaureate degrees:\n\n*Philippine Military Academy, City of Baguio – It is a primary training school for regular commissioning as officers of the Philippine Army, Philippine Navy, Philippine Marine Corps and the Philippine Air Force, and it is under the control of the Department of National Defense. It was formerly named as the Philippine Constabulary School but was renamed before the 30's. during the American era, U.S. Army Cavalry Officers established the school for the professionalization of the defunct Philippine Constabulary enlisted personnel. In 1992, PMA stopped producing constabulary cadets after the creation of the Republic Act 6975 which as a result the Philippine Constabulary and the Integrated National Police were officially merged and renamed as The Philippine National Police. Beginning in 1993 this has become a co-educational military academy.\n*Philippine Merchant Marine Academy, Zambales – It is a school for midshipmen who shall serve in different private shipping companies, foreign or local. Its midshipmen may serve in the Philippine Coast Guard and the Philippine Navy as an ensign after graduation depending upon their choice. All PMMA midshipmen are also automatically appointed by the president of the Philippines as ensigns or 2nd lieutenants in the Philippine Navy Reserve. This is the oldest of the Philippine service academies having been established in 1820 during the long period of Spanish rule in the country, and was first situated in Manila for so many years.\n*Philippine National Police Academy, Cavite – during the 1980s, it served as a school for selected enlisted personnel and civilians to join as a Police/Fire Lieutenants in the defunct Integrated National Police. After the merging of the Philippine Constabulary and INP in January 1, 1991 it became the primary officers school for the new Philippine National Police, the Bureau of Fire Protection and the Bureau of Jail Management and Penology, all under the Department of the Interior and Local Government. The Philippine National Police Academy graduates are automatically appointed as Inspectors/Lieutenants in the Philippine National Police, Bureau of Fire Protection, and the Bureau of Jail Management and Penology according to their choice of public safety curriculum during their cadetship. This is under the supervision of the DILG and the Philippine Public Safety College.\n\nAside from the PMA and the PMMA, all three branches of the AFP have their own Officer Candidate Course Programs for both men and women, patterned after their US counterparts.\n\nThe nation's higher military colleges are:\n* Armed Forces of the Philippines Command and General Staff College, Quezon City – educates officers of the AFP not exceeding the ranks of Colonel or Navy Captain\n* National Defense College of the Philippines, Quezon City – is a school for senior AFP officers for military/naval planning and to ready them in holding the ranks of Brigadier General/Commodore. Notable civilians may enroll and be given the honorary rank of Lieutenant Colonel/Commander in the AFP Reserve upon graduation.\n\nPoland\n\n*National Defence University in Warsaw\n*Jarosław Dąbrowski Military University of Technology in Warsaw\n*Tadeusz Kościuszko Land Forces Military Academy in Wrocław\n*Polish Air Force Academy in Dęblin\n*Heroes of Westerplatte Naval Academy in Gdynia\n*Faculty of Military Medicine of the Medical University in Łódź\n\nDefunct\n\n*Dzerzhinsky Political-Military Academy in Warsaw\n* Polish Air Defense Forces Academy\n\nPortugal\n\nPre-University level institution\n\n* Colégio Militar, Lisbon – military basic and high school;\n* Instituto dos Pupilos do Exército, Lisbon – vocational education military school.\n\nUndergraduate officer training\n\n* Academia Militar, Lisbon and Amadora – Portuguese Army and Republican National Guard university school;\n* Escola Naval, Almada – Portuguese Navy university school;\n* Academia da Força Aérea, Sintra – Portuguese Air Force university school;\n\nPostgraduate and staff training\n\n* Instituto de Estudos Superiores Militares, Lisbon – Joint command and staff college.\n\nNo longer operational\n\n* Instituto Superior Militar, Águeda – Undergraduate school for training NCOs to become officers;\n* Escola Superior Politécnica do Exército, Amadora – Undergraduate school for training NCOs to become officers.\n* Escola do Serviço de Saúde Militar, Lisbon – Portuguese Armed Forces nurse and paramedic undergraduate school.\n* Instituto de Odivelas, Odivelas – Pre-university level military school for girls;\n* Instituto de Altos Estudos Militares, Lisbon – Army graduate and staff college;\n* Instituto Superior Naval de Guerra, Lisbon – Navy graduate and staff college;\n* Instituto de Altos Estudos da Força Aérea, Sintra – Air Force graduate and staff college.\n\nRomania\n\n* Carol I National Defence University (Universitatea Națională de Apărare Carol I), Bucharest\n*Technical Military Academy (Academia Tehnică Militară), Bucharest\n* Land Forces:\n**Nicolae Bălcescu Land Forces Academy, Sibiu\n* Air Forces:\n**Academia Forțelor Aeriene (Air Forces Academy), Braṣov\n* Naval Forces:\n**Mircea cel Bătrân Naval Academy, Constanṭa\n\nRussia\n\nSee also: Cadet Corps (Russia), Military academies in Russia\n\nFirst stage of training\n\n* The Cadet Corps is an admissions-based military middle school for young boys that was founded in the Russian Empire in the year 1732, soon becoming widespread throughout the country.\n*Omsk Cadet Corps\n*Karelia Cadet Corps\n*Krasnoyarsk Cadet Corps\n*Magnitogorsk Cadet Corps\n*Georgy Zhukov Moscow Cadet Corps\n* Moscow Cossacks Cadet Corps\n* Moscow Cadet Corps of Military Music\n* Moscow Cadet Corps of the Ministry of Emergency Situations of Russia\n* Moscow Diplomatic Cadet Corps\n* Moscow Cadet Corps \"Heroes of the Battle of Stalingrad\"\n*St.Petersburg Space Forces Cadet Corps\n*St.Petersburg Strategic Rocket Forces Cadet Corps\n*St.Petersburg Artillery Cadet Corps\n*The 1st St.Petersburg Border guard Cadet Corps of the FSB\n*Tambov Cadet Corps\n*Toliatti Cadet Corps\n*Ufa Cadet Corps\n* The Sea Cadet Corps\n* Kronstadt S.C.C.\n* Moscow Representative Sea Cadet Corps of the Navigation and Mathematics School\n* Moscow Sea Cadet Corps Heroes of Sevastopol\n\nSecondary education\n\n* Suvorov Military School are a type of boarding school in modern Russia for boys of 14-18. Education in such these schools focuses on military related subjects.\n* Kazan S.M.S.\n* Moscow S.M.S.\n* North Caucasus S.M.S.\n* Orenburg S.M.S.\n* Perm S.M.S. \n* St.Petersburg Space Forces S.M.S.\n* Tula S.M.S. (reopening 2016 after 56 years of closure)\n* Tver S.M.S.\n* Ulyanovsk S.M.S.\n* Ussuriysk S.M.S.\n* Yekaterinburg S.M.S.\n* Nakhimov Naval School is a form of higher military education for teenagers introduced in modern Russia.\n* St. Petersburg N.N.S.\n\nPost-secondary education\n\n* Combined Arms Academy of the Armed Forces\n* Gagarin Air Force Academy (now the Gagarin-Zhukovsky Combined Air Force Academy)\n* Military Engineering-Technical University\n* Saint Petersburg Mining Institute\n* Fleet Admiral Nikolai Kuznetsov Naval Academy\n* Alexander Popov Naval Radio-electronic Academy\n* Military Materiel Security Academy \n* Pacific Naval Institute\n* Moscow Peter the Great Strategic Rocket Forces Academy\n* Baltic Naval Institute\n* Sevastopol Black Sea Higher Naval Institute\n* Military University of the Ministry of Defense of Russia\n* Yekaterinburg Force Command School of Artillery\n* Air General Staff Center of Missile and Air Defense Excellence\n* Khabarovsk Military Commanders Training Academy\n* Civil Defense Academy of the Ministry of Emergency Situations\n* Sergey Kirov Military Communications Academy\n* Military Medical Academy\n* St. Petersburg Academy of Physical Culture, Fitness and Sports\n* Marshal Aleksander Vasilevsky Military Academy of the Armed Forces Air Defense Branch\n* Moscow Border Guards Superior College\n* Military University of the Ministry of Internal Affairs\n\nStaff college\n\n* General Staff Academy\n\nSerbia\n\n* Military Academy Belgrade\n* Military Medical Academy (Serbia)\n\nSingapore\n\n*Officer Cadet School\n*Singapore Command and Staff College\n\nSouth Africa \n\n* South African Military Academy provides officers in the SANDF with an opportunity to earn a 3yr BMil degree.\n\nSpain\n\n*Academia General Militar, Zaragoza\n*Academia General del Aire, San Javier\n*Escuela Naval Militar de Oficiales, Marín\n\nSri Lanka\n\nThe General Sir John Kotelawala Defense University, was established in 1980 and is named after Gen. Sri John Kotelawala the 2nd Prime Minister of Sri Lanka. Taking cadets from all three armed services, 3 non-university level Military Academies, one for each armed service providing basic training for officer and a Command and Staff College for senior officers of the three armed services.\n\nUniversity\n\n*General Sir John Kotelawala Defence University, Colombo\nOfficer training\n\n*Sri Lanka Military Academy, Diyatalawa\n*Naval and Maritime Academy, Trincomalee\n*Air Force Academy, SLAF China Bay, Trincomalee\nStaff training\n\n*Defence Services Command and Staff College\n\nSweden\n\n*Military Academy Karlberg\n\nTanzania\n\n*Tanzania Military Academy\n\nThailand\n\n*Armed Forces Academies Preparatory School (Secondary level)\n*Chulachomklao Royal Military Academy (University level)\n*Phramongkutklao College of Medicine (Medicine, University level)\n*Royal Thai Navy Academy (university level)\n*Royal Thai Air Force Academy (university level)\n\nTurkey\n\n* National Defence University\n* Turkish Military Academy\n* Turkish Naval Academy\n* Turkish Air Academy\n\nTurkmenistan \n\n* Turkmanbashi Military Institute of the Ministry Of Defense of Turkmenistan\n* Turkmenistan State Border Service InService\n\nUganda\n\nUganda maintains the followings military training institutions, as of December 2010:[http://newvision.co.ug/D/8/13/670922 List of Uganda Military Schools] \n\n* Bihanga Military Training School – Located at Bihanga, in Ibanda District, Western Uganda.\n* Kalama Warfare Training School – Located at Kabamba, Mubende District[http://newvision.co.ug/D/8/19/427401 Kalama Warfare Training School Located at Kabamba] \n* National Leadership Institute (NALI) – Located at Kyankwanzi, Kyankwanzi District\n* Oliver Tambo School of Leadership – Located at Kaweweta, Nakaseke District[http://newvision.co.ug/D/8/13/714298/Oliver%20Tambo Oliver Tambo Leadership School Located at Kaweweta, Nakaseke District] [http://sundayvision.co.ug/detail.php?mainNewsCategoryId7&newsCategoryId\n123&newsId=744584 South Africa Donates Equipment to Oliver Tambo School] \n* Uganda Air Defence and Artillery School – Located at Nakasongola in Nakasongola District\n* Uganda Military Airforce Academy – Located at Nakasongola in Nakasongola District\n* University of Military Science and Technology – Located at Lugazi, Buikwe District[http://www.sundayvision.co.ug/detail.php?mainNewsCategoryId7&newsCategoryId\n128&newsId=745820 The NUST Located at Lugazi] \n* Uganda Junior Staff College – Located at Qaddafi Barracks, Jinja\n* Uganda Military Academy – Located at Kabamba, Mubende District\n* Uganda Senior Command and Staff College – Located at Kimaka, Jinja\n* Uganda Urban Warfare Training School – Located at Singo, Kiboga District[http://newvision.co.ug/D/8/12/741915 About Uganda Urban Warfare Training School] \n\nUkraine\n\nA number of universities have specialized military institutes, such as the Faculty of Military Legal Studies at Kharkiv's National Yaroslav Mudryi Law Academy of Ukraine, however, the primary Ukrainian military academies are the following:\n* Hetman Petro Sahaydachnyi Military Academy, Lviv\n* Admiral Pavel Nakhimov Naval Academy, Odessa\n* Ivan Kozhedub Air Force University, Kharkiv\n\nStaff colleges\n\n* National Defence University of Ukraine \"Ivan Chernyakhovsky\", Kyiv [http://www.nuou.org.ua Official website of National Defense University of Ukraine]\n\nUnited Kingdom\n\nPre-University level institution\n\n*Welbeck Defence Sixth Form College – Sixth form college for 16- to 18-year-olds providing A-Level education in preparation for entry into the British Armed Forces or Ministry of Defence Civil Service as Technical Officers, following undergraduate education sponsored under the Defence Technical Undergraduate Scheme (DTUS).\n*Duke of York's Royal Military School – Military based secondary school in Dover, Kent; students are influenced to join the forces after education, but have no commitment to do so.\n\nThere are also numerous Cadet forces that operate for all branches of the armed forces for children aged 10–20.  These are not designed to recruit people into the armed forces but rather are simply Ministry of Defence sponsored youth organisations.\n\nUndergraduate Service\n\nAlthough an undergraduate degree is not a pre-requisite for Officer training, the majority of potential Officers will have attended University before joining the Armed Forces.  At some universities there may be the option for people to join either a University Royal Naval Unit, a University Officer Training Corps (UOTC) or a University Air Squadron; which are designed to introduce students to life in the Forces and show them the careers that are available.  People sponsored under the Defence Technical Undergraduate Scheme will join one of the four Support Units attached to universities participating in DTUS. There is a requirement for bursars of DTUS to join the military for 3 years after completion of their degree, there no requirement for students of any other organisation to join the military after they finish their degree programs; and the great majority have no further contact with the armed forces.  Although service with these organisations may give some initial benefit to cadets attending the military colleges/academies, the next stage of the officer training programs assumes no prior military experience/knowledge, and those that did not partake in military activities at university are not disadvantaged.\n\nOfficer training\n\nThere are now four military academies in the United Kingdom.  Although the curriculum at each varies due to the differing nature of the service a man or woman is joining, it is a combination of military and academic study that is designed to turn young civilians into comprehensibly trained military officers.\n\n*Britannia Royal Naval College, HMS Dartmouth\n*Commando Training Centre Royal Marines\n*Royal Military Academy Sandhurst\n*Royal Air Force College Cranwell\n\nOfficer Training for the Reserve Forces (e.g. Army Reserve, Royal Naval Reserve, RAF Reserves & Royal Marine Reserves) also takes place at the relevant military academies, but under a different curriculum and the courses tend to be concentrated into a much shorter period.\n\nPostgraduate and staff training\n\n*Defence Academy of the United Kingdom\n*Royal College of Defence Studies (mainly for officers of Colonel/Brigadier or equivalent rank selected as future senior leaders; highly selective)\n*Joint Services Command and Staff College (courses for officers from Major to Brigadier or equivalent rank)\n*Defence College of Management and Technology\n*Armed Forces Chaplaincy Centre\n*Advanced Research and Assessment Group\n*Conflict Studies Research Centre\n\nNo longer operational\n\n*Royal Naval College, Greenwich\n*Royal Naval Engineering College, HMS Thunderer\n*Staff College, Camberley\n*RAF Staff College, Andover\n*RAF Staff College, Bracknell\n*Royal Military Academy, Woolwich\n*Joint Service Defence College\n\nUnited States\n\nIntroduction\n\nIn the United States, the term \"military academy\" does not necessarily mean a government-owned institution run by the armed forces to train its own officers.  It may also mean a middle school, high school, or college, whether public or private, which instructs its students in military-style education, discipline and tradition.  Students at such civilian institutions can earn a commission in the U.S. military through the successful completion of a Senior Reserve Officers' Training Corps program along with their college or university's academic coursework.\n\n*The term military school primarily refers to pre-collegiate secondary-school-level military institutions, which were more common before the 1970s and 1980s.\n*The term military academy commonly refers to a pre-collegiate, collegiate, and post-collegiate institution, especially the U.S. military-run academies.\n* The term US military staff colleges refers to separate graduate schools catering to officers on active duty .\n\nMost state-level military academies maintain both a civilian student body and a traditional corps of cadets.  The only exception is the Virginia Military Institute, which remains all-military.\n\nFederal Service Academies\n\nThe colleges operated by the U.S. Federal Government are referred to as Federal Service Academies and are:\n\n*United States Military Academy, West Point, New York\n*United States Naval Academy, Annapolis, Maryland\n*United States Air Force Academy, Colorado Springs, Colorado\n*United States Coast Guard Academy, New London, Connecticut\n*United States Merchant Marine Academy, Kings Point, New York\n\nPost-graduate School\n\n*Uniformed Services University of the Health Sciences, Bethesda, Maryland\n\nSenior and junior military colleges\n\nThere is one all-military state-sponsored military academy:\n\n*The Virginia Military Institute (VMI), Lexington, Virginia\n\nIn addition, these five institutions that were military colleges at the time of their founding now maintain both a corps of cadets and a civilian student body.  Many of these institutions also offer on-line degree programs:\n\n*University of North Georgia, Dahlonega, Georgia — Formed by a 2013 merger with Gainesville State College, its main predecessor institution, last known as North Georgia College & State University, was chartered as a military college. However, when NGCSU was founded in 1873 as North Georgia Agricultural College, it had both a corps and a civilian student body, and was also the state's first coeducational college.\n*Norwich University Corps of Cadets. Norwich University, Northfield, Vermont is a private university located in Northfield, Vermont. It is the oldest private military college in the United States. The university was founded in 1819 at Norwich, Vermont, as the American Literary, Scientific and Military Academy. It is the oldest of six senior military colleges, and is recognized by the United States Department of Defense as the \"Birthplace of ROTC\"\n*Texas A&M Corps of Cadets, Texas A&M University, College Station, Texas\n*The Citadel, The Military College of South Carolina, Charleston, South Carolina\n*Virginia Tech Corps of Cadets, Virginia Polytechnic Institute and State University, Blacksburg, Virginia\n\nAlong with VMI, these institutions are known as the Senior Military Colleges of the US.\n\nToday four institutions are considered Military Junior Colleges (MJC). These four military schools participate in the Army's two-year Early Commissioning Program, an Army ROTC program where qualified students can earn a commission as a Second Lieutenant after only two years of college. The four Military Junior Colleges are as follows:\n\n*Georgia Military College, Milledgeville, Georgia\n*Marion Military Institute, Marion, Alabama\n*New Mexico Military Institute, Roswell, New Mexico\n*Valley Forge Military Academy and College, Wayne, Pennsylvania\n\nMerchant Marine Academies that have military academy style operations\n\nThere are six (6) state-operated Merchant Marine academies:\n* Massachusetts Maritime Academy\n* Maine Maritime Academy\n* State University of New York Maritime College (part of the State University of New York (SUNY) system)\n* Texas A&M Maritime Academy (part of the Texas A&M University System)\n* Great Lakes Maritime Academy (a division of Northwestern Michigan College)\n* California State University Maritime Academy (part of the California State University system)\nThese merchant marine academies operate on a military college system. Part of the training that the cadets receive is naval and military in nature. Cadets may apply for Naval Reserve commissions upon obtaining their Merchant Marine Officer's licenses. Most if not all also offer some form of military commissioning program into the active duty US Navy, US Marine Corps, or US Coast Guard.\n\nStaff Colleges\n\nThe United States staff colleges, mandated to serve the needs of officers for post-graduate studies and other such graduate institutions as mandated by the Department of Defense are:\n\nUnited States Air Force Air University attached staff colleges\n\n* The Air University in Maxwell AFB, Alabama, includes the\n** Squadron Officer College and Squadron Officer School\n** Air Command and Staff College\n** Air War College\n\nStaff Colleges of the United States Army\n\n* United States Army Command and General Staff College\n* United States Army School of Advanced Military Studies\n* United States Army War College\n\nStaff Colleges of the United States Navy and the United States Marine Corps\n\n* Naval War College\n* Naval Postgraduate School\n* Marine Corps University\n\nJoint Service staff colleges\n\n* National Defense University in Washington, D.C. which includes the\n** Joint Forces Staff College (Norfolk, Virginia)\n** National War College\n** Dwight D. Eisenhower School for National Security and Resource Strategy\n* Defense Acquisition University\n\nOther post-graduate colleges operated by the DoD\n\n* National Intelligence University (Military intelligence)\n* The Judge Advocate General's Legal Center and School (Legal services training)\n* Air Force Judge Advocate General's School (Legal services training)\n* Naval Justice School (Legal services training)\n\nUzbekistan \n\n* Higher MIlitary Customs Institute\n\nVietnam\n\n*National Defense Academy of Vietnam in Hanoi, Vietnam\n*Lê Quý Đôn Technical University in Hanoi, Vietnam\n*Vietnam Naval Academy in Nha Trang, Khánh Hòa Province, Vietnam",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Military academy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20311" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A military academy or service academy (in the United States) is an educational institution which prepares candidates for service in the officer corps. It normally provides education in a military environment, the exact definition depending on the country concerned.\n\nThree types of academy exist: pre-school-level institutions awarding academic qualifications, university-level institutions awarding bachelor's degree level qualification, and those preparing officer cadets for commissioning into the armed services of the state.\n\nHistory\n\nThe first military academies were established in the 18th century to provide future officers for technically specialized corps, such as engineers and artillery, with scientific training.\n\nThe Royal Danish Naval Academy was set up in 1701, making it the oldest military academy in existence.  The Royal Military Academy, Woolwich was set up in 1720 as the earliest military academy in Britain. Its original purpose was to train cadets entering the Royal Artillery and Royal Engineers. In France, the École Royale du Génie at Mézières was founded in 1748, followed by a non-technical academy in 1751, the École Royale Militaire offering a general military education to the nobility. French military academies were widely copied in Prussia, Austria, Russia and even minor powers, including Turin and the Kingdom of Savoy, in the late 18th century.\n\nBy the turn of the century, under the impetus of the Napoleonic Wars and the strain that the armies of Europe subsequently came under, military academies for the training of commissioned officers of the army were set up in most of the combatant nations. These military schools had two functions; to provide instruction for serving officers in the functions of the efficient staff-officer, and to school youngsters before they gained an officer's commission. The Kriegsakademie in Prussia was founded in 1801 and the École spéciale militaire de Saint-Cyr was created by order of Napoleon Bonaparte in 1802 as a replacement for the École Royale Militaire of the Ancien Régime (the institution that Napoleon himself had graduated from).\n\nThe Royal Military College, Sandhurst, in England was the brainchild of John Le Marchant in 1801,[https://da.mod.uk/colleges/jscsc/jscsc-library/artwork/major-general-john-gaspard-le-marchant-1766-1812 Major-General John Gaspard Le Marchant (1766-1812)]  Defence Academy who established schools for the military instruction of officers at High Wycombe and Great Marlow, with a grant of £30,000 from Parliament. The two original departments were later combined and moved to Sandhurst. In the United States, the military academy at West Point was founded in 1802 and became popular in the 1860s.\n\nTypes\n\nPre-collegiate institutions\n\nA military school teaches children (primarily boys) of various ages (elementary school, middle school or high school) in a military environment which includes training in military aspects, such as drill. Many military schools are also boarding schools, and others are simply magnet schools in a larger school system. Many are privately run institutions, though some are public and are run either by a public school system (such as the Chicago Public Schools) or by a state.\n\nA common misconception results because some states have chosen to house their juvenile criminal populations in higher-security boarding schools that are run in a manner similar to military boarding schools. These are also called reform schools, and are functionally a combination of school and prison. They attempt to emulate the environment of military boarding schools in the belief that a strict structured environment can reform these children. This may or may not be true. However, their environment and target population are different from those of military schools.Linton Hall Cadet, Linton Hall Military School Memories: One cadet's memoir, Arlington, Virginia.: Scrounge Press, 2014  describes a military school for boys ages 6-16.\n\nPopular culture sometimes shows parents sending or threatening to send unruly children off to military school (or boarding school) to teach them good behavior (e.g., in the \"Army of One\" episode of The Sopranos, Tony and Carmela Soprano consider sending their son, AJ, to the Hudson Military Institute). A similar situation appears in Bill & Ted's Excellent Adventure, while other fictional depictions don't show military academies as punishment (threats) (ex. Damien: Omen II and The Presidio.\n\nAdult institutions\n\nA college-level military academy is an institute of higher learning of things military. It is part of a larger system of military education and training institutions. The primary educational goal at military academies is to provide a high quality education that includes significant coursework and training in the fields of military tactics and military strategy. The amount of non-military coursework varies by both the institution and the country, and the amount of practical military experience gained varies as well.\n\nMilitary academies may or may not grant university degrees.  In the U.S., graduates have a major field of study, earning a Bachelor's degree in that subject just as at other universities.  However, in British academies, the graduate does not achieve a university degree, since the whole of the one-year course (nowadays undertaken mainly but not exclusively by university graduates) is dedicated to military training.\n\nThere are two types of military academies: national (government-run) and state/private-run.\n*Graduates from national academies are typically commissioned as officers in the country's military. The new officers usually have an obligation to serve for a certain number of years. In some countries (e.g. Britain) all military officers train at the appropriate academy, whereas in others (e.g. the United States) only a percentage do and the service academies are seen as institutions which supply service-specific officers within the forces (about 15 percent of US military officers).\n*State or private-run academy graduates have no requirement to join the military after graduation, although some schools have a high rate of graduate military service. Today, most of these schools have ventured away from their military roots and now enroll both military and civilian students. The only exception in the United States is the Virginia Military Institute which remains all-military.\n\nList of military academies by countries\n\nAfghanistan\n\n*Afghanistan National Army Officer Academy\n*National Military Academy of Afghanistan\n*Officer Candidate School, Kabul (OCS)\n\nAlbania\n\n*Skanderbeg Military University\n\nAngola\n\n* Army Military Academy\n* National Air Force Academy\n* Naval Academy\n\nArgentina\n\nArgentine Army\n*Colegio Militar de la Nación (National Military College), located in El Palomar, Buenos Aires\nArgentine Navy\n*Escuela Naval Militar (Naval Military School), located in Río Santiago, Buenos Aires\nArgentine Air Force\n*Escuela de Aviación Militar (Military Aviation School), located in the city of Córdoba\n\nArmenia \n\n* Monte Melkonian Military Academy\n* National Institute for Strategic Studies \n* Vazgen Sargsyan Military Institute\n\nAustralia\n\n*Australian Defence Force Academy\n*Royal Military College, Duntroon\n*Officers' Training School RAAF\n*Royal Australian Naval College\n\nAustria\n\n*Theresian Military Academy\n*Landesverteidigungsakademie\n\nAzerbaijan \n\n* Academy of the Ministry of National Security\n* Azerbaijan Higher Naval School \n* Azerbaijan Higher Military School\n* Police Academy of the Ministry of Internal Affairs\n\nBangladesh\n\n*Bangladesh Military Academy\n*Bangladesh Naval Academy\n*Bangladesh Air Force Academy\n*University Of Professionalshttp://www.bup.edu.bd/ Bangladesh (BUP), Mirpur, Dhaka\n*Bangladesh National Cadet Corps (BNCC)\n*Military Institute of Science and Technology, Mirpur, Dhaka\n*Armed Forces Medical College  (AFMC), Airport Road, Dhaka\n*School of Infantry and Tactics\n*Defence Services Command and Staff College\n*National Defence College\n*Armoured Corps Center & School\n*Engineer Centre and School of Military Engineering\n*Signal Training Centre and School\n*Ordnance Corps Centre & School\n*Bangladesh Institute of Peace Support Operation Training (BIPSOT)\n*Electrical and Mechanical Engineering Centre and School\n*Corps of Military Police Centre and School\n*Army School of Education and Administration\n*Army School of Physical Training and Sports\n*Army School of Music\n*Artillery Center and School\n*School of Military Intelligence\n*Army Computer Training School\n*Non Commissioned Officers Academy\n*Trust Technical Training Institute, Gazipur\n\nCadet Colleges in Bangladesh\n\nThere are 12 Cadet Colleges in Bangladesh. Among these, nine for boys and three for girls. Four Cadet Colleges were established before 1971. Other cadet colleges were built after the Liberation War of Bangladesh.\n\nBelarus \n\n* Military Academy of Belarus\n* Minsk Suvorov Military School\n\nBelgium\n\n*Royal Military Academy (Belgium)\n\nBolivia\n\n*Military College of Bolivia (Colegio Militar del Ejército de Bolivia)\n*Bolivian Military Naval Academy\n* Bolivian Air Force Academy\n\nBrazil\n\nHas several military academies:\n* Army – The biggest Academy is Academia Militar de Agulhas Negras (AMAN) in the municipality of Resende, in state of Rio de Janeiro, in the southeast of that country. For high school level, The Sistema Colégio Militar do Brasil (SCMB) is composed for 13 military schools in Belo Horizonte, Belém, Brasília, Campo Grande, Curitiba, Fortaleza, Juiz de Fora (MG), Manaus, Porto Alegre, Recife, Rio de Janeiro, Salvador and Santa Maria (RS).\n* Navy – [Escola Naval] was founded in 1823 and is located on Villegagnon island, near downtown Rio de Janeiro. The location of the school has historical significance during the French invasions of the then Portuguese Colony in 1555. The Brazilian Navy also prepares students at the High School level at Colégio Naval in preparation for the Naval Academy (Escola Naval). Colégio Naval was founded in 1876 and is located at Enseada Almirante Batista das Neves em Angra dos Reis.\n* Air Force – Academia da Força Aérea (AFA). (Air Force Academy) and Escola Preparatória de Cadetes do Ar(EPCAr).\n\nBulgaria\n\n* Vasil Levski National Military University founded in 1878 as a military school in Plovdiv\n**Air force Faculty located in Dolna Mitropoliya\n**Artillery, Air Defence and CIS Faculty located in Shumen\n**All-Force Faculty faculty located in Veliko Tarnovo\n* Nikola Vaptsarov Naval Academy located in Varna and founded in 1881 as Naval Machinery School in Rousse\n* Rakovski Defence and Staff College located in Sofia. It was founded with an Act of the 15th National Assembly of 1 March 1912 in Sofia\n\nCanada\n\nCanada currently has one military-theme private boarding school open for students at the pre-university level, Robert Land Academy (RLA), which is located in West Lincoln, Ontario. Founded in 1978, it is an all-boys' institute whose funding arises solely from tuition fees. The Academy is an institute fully accredited by the province of Ontario, which accepts students from Grade 6 to Grade 12 (the Ontario Academic Credit level).\n\nCanada formerly had three university level service academies, the Canadian Military Colleges.  These included the Royal Military College of Canada (RMC) in Kingston, Ontario, Royal Roads Military College (RRMC) in Victoria, British Columbia and the Collège militaire royal de Saint-Jean (CMR) in Saint-Jean-sur-Richelieu, Québec.  RMC was founded in 1876, RRMC in 1941 and CMR in 1954.H16511 Dr. Richard Arthur Preston \"To Serve Canada: A History of the Royal Military College of Canada\" 1997 Toronto, University of Toronto Press, 1969. By the 1960s all three institutions were providing military education to officer cadets of all three elements in the Canadian Forces; the navy, army and air force; and RMC received the authority to grant academic degrees in Arts, Science and Engineering.4237 Dr. Adrian Preston & Peter Dennis (Edited) \"Swords and Covenants\" Rowman And Littlefield, London. Croom Helm. 1976.\n\nGraduates of the Colleges are widely acknowledged to have had a disproportionate impact in the Canadian services and society, thanks to the solid foundations provided by their military education.H16511 Dr. Richard Preston \"R.M.C. and Kingston: The effect of imperial and military influences on a Canadian community\" 1968 Military discipline and training, as well as a focus on physical fitness and fluency in both of Canada's two official languages, English and French, provided cadets with ample challenges and a very fulfilling experience.H1877 R. Guy C. Smith (editor) \"As You Were! Ex-Cadets Remember\". In 2 Volumes. Volume I: 1876-1918. Volume II: 1919-1984. Royal Military College. [Kingston]. The R.M.C. Club of Canada. 1984 In 1995 the Department of National Defence was forced to close Royal Roads Military College and Collège militaire royal de Saint-Jean due to budget considerations, but Royal Military College of Canada continues to operate.\"To Serve Canada: A History of the Royal Military College since the Second World War\", Ottawa, University of Ottawa Press, 1991.\nRoyal Roads reopened as a civilian university in the fall of 1995, and is maintained by the Government of British Columbia. In 2007, the Department of National Defence reopened Collège militaire royal de Saint-Jean as a preparatory and first year college.\n\nChina, People's Republic of\n\n*PLA National Defense University\n\nChina (Taiwan), Republic of\n\n*R.O.C. Military Academy\n*R.O.C. Naval Academy\n*R.O.C. Air Force Academy\n*R.O.C. Air Force Institute of Technology\n*Army Academy R.O.C.\n*National Defense University\n** War College\n** Army Command and Staff College\n** Naval Command and Staff College\n** Air Force Command and Staff College\n** Institute of Technology\n** Management College\n** Political Warfare College\n*National Defense Medical Center\n*Chung-cheng Armed Forces Preparatory School\n\nColombia\n\nNational Army of Colombia:\n*José María Córdova Military School, located in Bogotá.\n*Colombian Army NCO School\nColombian Air Force:\n*Marco Fidel Suarez Military Aviation School, located in Cali.\nColombian Naval Infantry and Colombian Navy:\n*Admiral Padilla Naval Academy, located in Cartagena de Indias.\nNational Police of Colombia:\n*General Santander National Police Academy, located in Bogotá.\n\nCzech Republic\n\n*Univerzita Obrany (University of Defence)\n* http://www.unob.cz/en/\n*Vojenská akademie a velitelství výcviku (Military academy and training command)\n* http://www.vavyskov.cz/\n\nDenmark\n\n*Royal Danish Defence College\n*Royal Danish Military Academy\n*Royal Danish Naval Academy\n*Royal Danish Air Force Officers School\n\nEgypt\n\n*Egyptian Air Defense Academy\n*Egyptian Military Technical College\n*Egyptian Military medical college\n*Egyptian Air Academy\n*Egyptian Military Academy\n*Egyptian Naval Academy\n\nEl Salvador\n\n*Escuela Militar Capitan General Gerardo Barrios\n\nEstonia\n\n*Estonian National Defence College\n*Baltic Defence College, both in Tartu\n\nFinland\n\n \n*Finnish National Defence University (Maanpuolustuskorkeakoulu), located on Santahamina island, Helsinki\n*Maanpuolustusopisto (defunct)\n\nFrance\n\nHigh schools\n\n*Lycée militaire de Saint-Cyr\n*Lycée militaire d'Autun\n*Prytanée National Militaire\n*Lycée militaire d'Aix-en-Provence\n*Lycée naval de Brest\n*École des Pupilles de l'Air\n\nOfficer academies\n\n*École spéciale militaire de Saint-Cyr (ESM, literally the \"Special Military School of St Cyr\") is the French Military Academy. It is often referred to as \"Saint-Cyr\". Founded by Napoleon in 1802, and initially located in Fontainebleau, it was moved first to Saint-Cyr-l'École in 1808, and then to Coëtquidan (Brittany) in 1945.\n*École militaire interarmes (EMIA)\n*École des commissaires des armées (ECA), founded in 2013\n*École de l'air: the French Air Force Academy\n*École Navale: the French Naval Academy\n* École des officiers de la gendarmerie nationale (EOGN): gendarmerie commissioned officers academy\n*École Polytechnique (X): a French engineering grande école of military status. Though all of its French engineering students are enlisted and trained as officers, 5% of its graduates remain in the military after graduation.\n* ÉNSTA Bretagne: a French engineering grande école of military status. Only 1/4 of its students are actual officers-in-training.\n* Ecole de Santé des Armées: medical school of French army\n* National Military Infrastructure Engineers Academy: trains military engineers of the Armed Forces, opened 2013 (also one of the newest)\n\nPostgraduate academies\n\n* École d'état-major (Staff school): first step of higher military studies, for officer of OF-2 rank.\n* École de Guerre (War School): second step of higher military studies, mainly for ranks OF-2 and OF-3 who want to continue the command track (e.g. to command battalion or regiment).\n* Collège d'enseignement supérieur de l'armée de terre (Army Higher Education College): second step of military education, but for officers whishing to achieve a high-level specialization.\n** Cours supérieur d'état-major (Advanced Staff Course)\n** Enseignement militaire supérieur scientifique et technique (Higher Technical and Scientific Education).\n* Centre des hautes études militaire (Center for Advanced Military Studies): final step of military education, for very few selected OF-5. Its students also attend the civilian institut des hautes études de défense nationale.\n\nGeorgia\n\nNational Defense Academy (NDA) of Georgia is a descendant of the first Georgian \"Junker School\" which was established in 1919 right after the declaration of independence. Establishment of the military school was very important for the identity of a new democratic nation-state. The school was abolished after Soviet occupation of Georgia in 1921.\n\n\"Davit Aghmashenebeli National Defense Academy of Georgia\" was founded on May 28, 1993. The length of studies at the Academy had been defined for 4 years. In 2005, due to the need of the growth of the personnel strength of the Georgian Armed Forces (GAF), the system of the Academy has been transformed to retain only the 18-month-long officer training courses. A bachelor's degree has been defined as a prerequisite for the admission of the cadets.\n\nIn 2010, the NDA has undergone a new wave of the reforms to include entire officer education system. As a result, in 2011, Cadet Bachelor School, Junior Officer Basic School, Aviation and Air Defense Officer Basic School, Medical Officer School, Captain Career School, Command and General Staff School, School of Advance Defense Studies and Language Training School were included within the NDA.\n\nUpon entry into NDA, cadets sign a contract with the MoD for 10 years of military service, of which 4 years are dedicated to studies and 6 years – to consequent military service. Cadets receive the rank of Lieutenant upon graduation.\n\nNDA is established by the MoD with the status of the Legal Entity of Public Law. At the same time, NDA maintains very strong link with The Ministry of Education and Science according to the process of Bologna.\n\nGermany\n\nGermany has a unique system for civil and military education. The only true military academy is the Führungsakademie der Bundeswehr where mainly future staff officers and general staff officers are further trained.\n\nThe standard education in military leadership is the task of the Offizierschulen (officers' schools) run by the three branches. The contents differ from branch to branch. In the army all officers are at least trained to lead a platoon. There they also have to pass an officer exam to become commissioned later on.\n\nMoreover, there exist so called Waffenschulen (school of weapons) like infantry school or artillery school. There the officers learn to deal with the typical tasks of their respective corps.\nA specialty of the German concept of officer formation is the academic education. Germany runs two own Universities of the German Federal Armed Forces where almost every future officer has to pass non-military studies and achieve a bachelor's or master's degree. During their studies (after at least three years of service) the candidates become commissioned Leutnant (second-lieutenant).\n\nThe three officer's schools are:\n* The German Navy supervises:\n** Naval Academy at Mürwik, located in Flensburg-Mürwik\n* The German Army supervises:\n** Offizierschule des Heeres, located in Dresden\n* The German Air Force supervises:\n** Offizierschule der Luftwaffe, located in Fürstenfeldbruck\n\nAcademic and staff education:\n* Universities of the German Federal Armed Forces\n** Helmut Schmidt University, located in Hamburg\n** Bundeswehr University Munich, located in Munich\n* Führungsakademie der Bundeswehr, located in Hamburg\n\nGreece\n\nThe Hellenic Armed Forces have military academies supervised by each branch of the Armed Forces individually:\n\n*The Hellenic Army supervises:\n**The Evelpidon Military Academy, located in Athens.\n**The Corps Officers Military Academy, located in Thessaloniki.\n*The Hellenic Air Force supervises:\n** The Icarus Air Force Academy, located in Tatoi (Athens).\n*The Hellenic Navy supervises:\n** The Hellenic Naval Cadets Academy, located in Piraeus.\n\nHungary\n\n* National University of Public Service (Successor of Royal Hungarian Ludovica Military Academy, which founded in 1808)\n** Faculty of Military Sciences and Officer Training\n\nIndia\n\n*National Defence Academy (NDA)\n*Indian Military Academy (IMA)\n*Officers Training Academy (OTA)\n*Indian Naval Academy (INA)\n*Air Force Academy, Dundigul\n*Air Force Technical College, Bangalore\nMilitary Schools\n1. 5 Rashtriya Military Schools across India in Belgaum Belgaum Military School, BangaloreBangalore Military School, ChailChail Military School, DholpurDholpur Military School and AjmerAjmer Military School \n*Classes 6 to 12, run by the Integrated Headquarters of Ministry Of Defence (Army) of the Indian government\n*Educational institute to train for defence services, no combat training\n\nIndonesia\n\nThe Indonesian Military Academy http://www.akmil.ac.id/ was founded in Yogyakarta, October 13, 1945 by the order of General Staff Chief of Indonesia Army Lieutenant General Urip Sumohardjo  as the Militaire Academie (MA) Yogyakarta. \n\nCurrently, the Tentara Nasional Indonesia or the \"TNI\" (Indonesian National Armed Forces), under the supervision of the Commanding General of the Indonesian National Armed Forces Academy System (a three-star officer in billet) in the HQ of the Indonesian National Armed Forces, has divided the academies into the three respective services:\n\n* Indonesian Military Academy – \"AKMIL\" (Akademi Militer abbreviated Akmil), located in Magelang, Central Java, is under the supervision of the Indonesian Army Chief of Staff, operated since 1946.\n* Indonesian Naval Academy – \"A.A.L.\" (Akademi Angkatan Laut abbreviated AAL), located in Surabaya, East Java, is under the supervision of the Indonesian Navy Chief of Staff. The Indonesian Naval Academy also educates and forms officers to serve in the Indonesian Marine Corps. In existence since 1951. \n* Indonesian Air Force Academy – \"A.A.U.\" (Akademi Angkatan Udara abbreviated AAU), located in Yogyakarta, is under the supervision of the Indonesian Air Force Chief of Staff. The academy has three majorings which are: electronics, engineering, and administration. Following graduation, students who are selected as Pilot and Navigator conduct further training in the Pilot and Navigator Flight School prior bearing the Pilot/Navigator designation. Active since 1945, but also inherits the traditions of former Dutch military aviation schools.\n\nEach service academy is headed by a two-star general, and his/her deputy is a one-star officer. All the students (cadets/midshipman) are recruited from senior high school graduates from all over Indonesia. Shortly after graduation, they are commissioned as Letnan Dua (Second Lieutenant) in their respective services and get the Diploma IV (Associate degree, 4th Grade) comparable to civil academies or universities. The length term is now 4 years and is divided into 5 grades of cadet's rank, starting from the lowest:\n\n* Prajurit Taruna/Kadet/Karbol (Cadet Private), 1st year (4 months)\n* Kopral Taruna/Kadet/Karbol (Cadet Corporal), 1st year (8 months)\n* Sersan Taruna/Kadet/Karbol (Cadet Sergeant), 2nd year\n* Sersan Mayor Dua Taruna/Kadet/Karbol (Cadet Second Sergeant Major), 3rd year\n* Sersan Mayor Satu Taruna/Kadet/Karbol (Cadet First Sergeant Major), 4th year\n\nTaruna refers to cadets in the Military Academy, Kadet refers to cadets in the Naval Academy, and Karbol refers to cadets in the Air Force Academy, respectively.\n\nUntil 1999, before the Indonesian National Police officially separated from the armed forces, the Indonesian Police Academy (\"AKPOL\") also stood under the National Armed Forces Academy but now has separated from the Military and is under the auspices of the President of Indonesia controlled by the National Police Headquarters (Mabes Polri), where in the other hand the Armed Forces (Army, Naval, and Air Force) Academies of Indonesia is under the auspices of the Ministry of Defense controlled by the Armed Forces General Headquarters (Mabes TNI). Presently, the Police Academy is located in Semarang (Central Java), and is supervised under the supervision of the Chief of Indonesian National Police (Kapolri).\n\nAll 3 academies and the Police Academy have a joint 4th class cadet training program since 2008, after completing it the cadets go to their respective academies to continue with the 3 remaining years of study before commissioning.\n\nAs of January 2018, Rear Admiral Siwi Sukma Adji, S.E.,M.M is the Commanding General, INAF Academies System, with Major General Dody Usodo Hargo, S.Ip.,M.M as the assistant commander. The Academies System was founded on 16 December 1965.\n\nIran \n\nImam Ali Officers' University (Persian: دانشگاه افسری امام علی; acronym: دا اف, DĀʿAF),  formerly known as Officers' School (Persian: دانشکده افسری) is the military academy of Ground Forces of Islamic Republic of Iran Army, located in Tehran, Iran. Cadets of the academy achieve the second Lieutenant rank upon graduation and join one of Islamic Republic of Iran Army branches.\n\nItaly\n\nHigh School level institutions (only for Classical and Scientific Liceum, starting from grade 10):\n*Scuola Militare Nunziatella, founded during the Bourbon Period in 1787, in Italian Army, Naples\n*Scuola Militare Teulié, founded during the Napoleonic period in 1802, Italian Army, Milan\n*Scuola Militare Navale Morosini, Italian Navy, Venice\n*Scuola Militare Aeronautica Douhet, Italian Air Force, Florence\nThe 2009–2010 school year has been the first one with girls attending those schools.\n\nUniversity level institutions:\n*Military Academy of Modena\n*Scuola di Applicazione, Torino\n*Accademia Navale, Livorno\n*Accademia Aeronautica, Pozzuoli\n*Scuola Ufficiali Carabinieri, Rome\n*Accademia della Guardia di Finanza, Bergamo\n\nJapan\n\n*National Defense Academy of Japan (University level)\n*National Defense Medical College (Medical, university level)\n*Officer Candidate Training Schools (for each of Ground, Maritime and Air Self-defense forces)\n\nKazakhstan \n\n* Talgat Bigeldinov Military Institute of Air Defence Forces \n* National Defense University \n* Military institute of Land Forces\n* Military institute of Armed Forces\n\nKorea, North\n\n* Kim Il-sung Military University\n\nKorea, South\n\nThe three main military academies:\n* Korea Military Academy (Army)\n* Korea Naval Academy\n* Korea Air Force Academy\n\nOther military academies:\n* Korea Army Acaemy at Yeongcheon, formerly Korea Third Military Academy\n* Armed Forces Nursing Academy\n\nKyrgyzstan \n\n* Military Institute of the Armed Forces of the Kyrgyz Republic\n\nMalaysia\n\nSecondary level institutions:\n* Royal Military College (Malaysia) (Maktab Tentera Diraja)\n\nUniversity level:\n* National Defence University of Malaysia (University Pertahanan Nasional Malaysia) (foundation, bachelor's degree, master's degree, PhD and specialist courses)\n* Armed Forces Defence Collegehttp://maf.mod.gov.my/eng/training_institute/institute02.htm (Maktab Pertahanan Angkatan Tentera)\n\nSpecialist training & staff institutions:\n* Officers Cadet School in Port Dickson (OCS)\n* Malaysian Armed Forces Staff Collegehttp://www.mafsc.edu.my/ (Maktab Turus Angkatan Tentera)\n* Armed Forces Health Training Institute (Institut Latihan Kesihatan Angkatan Tentera)\n* Malaysian Peacekeeping Training Centre (Pusat Latihan Pengaman Malaysia)\n\nReserve Officer Training Units ( or ) or ROTU exists only in public universities in Malaysia. This is a tertiary institution based officer commissioning program to equip students as officer cadets with military knowledge and understanding for service as Commissioned Officers in the reserve components of the various branches of the Malaysian Armed Forces.\n\nMexico\n\n* Heroica Escuela Naval Militar\n* Heroico Colegio Militar\n* Colegio del Aire\n\nMoldova\n\n* Military Academy of Moldova\n\nMongolia \n\n* Mongolian Defense University\n\nMyanmar\n\n* Defence Services Academy\n* Defence Services Technological Academy\n* Defence Services Medical Academy\n* Officer Training School (Myanmar) (OTS)\n* National Defence College (Myanmar) (NDC)\n* Defence Services Institute of Nursing and Paramedical Science\n\nNamibia\n\n*Namibian Military School\n\nNetherlands\n\n*Koninklijke Militaire Academie\n*Royal Naval College (Netherlands)\n\nNew Zealand\n\nTier One – Initial Officer Training\n* New Zealand Commissioning Course, Waiouru (NZ Army)\n* Initial Officer Training, Woodbourne, (RNZAF)\n* Officer Training School, Devonport Naval Base\n\nTier Two – Junior Officer Education\n* NZDF Junior Staff Course, New Zealand Defence College\n\nTier Three – Senior Officer Education\n* NZDF Staff Course, New Zealand Defence College\n\nNigeria\n\nHigh school training\n\n* Nigerian Military School, Zaria – Nigerian Army military school for boys;\n* Air Force Military School, Jos, Nigeria, located in Jos – Nigerian Air Force military school for boys;\n* Air Force Girls Military School, Jos – Nigerian Air Force military school for girls.\n* Nigerian Navy Secondary School, Calabar. http://www.nnsscal.com/ \nUndergraduate officer training\n\n* Nigerian Defence Academy, Kaduna  – Nigerian Armed Forces university school;\nPostgraduate officer training\n\n* Armed Forces Command and Staff College, Jaji, at Jaji, Kaduna – joint Nigerian Armed Forces higher studies institute for both indigenous and international students.\n* Nigerian Army College of Logistics, Lagos – school for training middle career Nigerian Army officers on military logistics;\n* National Defence College, Abuja, – school for training senior officers of the Nigerian Armed Forces and also some members of the civil service.\n\nNorway\n\nUndergraduate officer training\n\n* Norwegian Military Academy, Linderud/Oslo (Norwegian Army)\n* Norwegian Naval Academy, Laksevåg/Bergen (Royal Norwegian Navy)\n* Norwegian Air Force Academy, Trondheim (Royal Norwegian Air Force)\n\nPostgraduate training\n\n* Norwegian Defence Staff College, Oslo (Joint)\n* Norwegian National Defence College, Oslo (Civil Service/Very senior officers)\n\nPakistan\n\n* Pakistan Military Academy, Kakul\n* Pakistan Air Force Academy, Risalpur\n* Pakistan Naval Academy, Karachi\n* Command and Staff College, Quetta\n* National Defence University, Islamabad\n* Pakistan Navy War College, Lahore\n* PAF Air War College, Karachi\n* Army Burn Hall College, for boys, Abbottabad\n* Army Public College of Management Sciences (public sector)\n* Military College Jhelum, Jhelum District\n* Military College Murree, Rawalpindi District\n* Military College Sui, Dera Bugti District\n\nPanama\n\nEscuela de Policia National Dr. Justo Arosemena \nhttp://www.policia.gob.pa/direcciones/dnrrhh/ces.html\n\nParaguay\n\nThe Francisco López Military Academy is located in Capiatá, Paraguay.\n\nPeru\n\nUndergraduate officer training\n* Chorrillos Military School (Peruvian Army)\n* Peruvian Naval School (Peruvian Navy)\n* Peruvian Air Force Officers' School (Peruvian Air Force)\n* Officers' School of the National Police of Peru (National Police of Peru)\n\nPhilippines\n\nThe Philippines patterned all its military academies after the United States Military Academy (WEST POINT) and the United States Merchant Marine Academy.\n\nThese colleges are operated by the Philippine Government which serves 4 years of different baccalaureate degrees:\n\n*Philippine Military Academy, City of Baguio – It is a primary training school for regular commissioning as officers of the Philippine Army, Philippine Navy, Philippine Marine Corps and the Philippine Air Force, and it is under the control of the Department of National Defense. It was formerly named as the Philippine Constabulary School but was renamed before the 30's. during the American era, U.S. Army Cavalry Officers established the school for the professionalization of the defunct Philippine Constabulary enlisted personnel. In 1992, PMA stopped producing constabulary cadets after the creation of the Republic Act 6975 which as a result the Philippine Constabulary and the Integrated National Police were officially merged and renamed as The Philippine National Police. Beginning in 1993 this has become a co-educational military academy.\n*Philippine Merchant Marine Academy, Zambales – It is a school for midshipmen who shall serve in different private shipping companies, foreign or local. Its midshipmen may serve in the Philippine Coast Guard and the Philippine Navy as an ensign after graduation depending upon their choice. All PMMA midshipmen are also automatically appointed by the president of the Philippines as ensigns or 2nd lieutenants in the Philippine Navy Reserve. This is the oldest of the Philippine service academies having been established in 1820 during the long period of Spanish rule in the country, and was first situated in Manila for so many years.\n*Philippine National Police Academy, Cavite – during the 1980s, it served as a school for selected enlisted personnel and civilians to join as a Police/Fire Lieutenants in the defunct Integrated National Police. After the merging of the Philippine Constabulary and INP in January 1, 1991 it became the primary officers school for the new Philippine National Police, the Bureau of Fire Protection and the Bureau of Jail Management and Penology, all under the Department of the Interior and Local Government. The Philippine National Police Academy graduates are automatically appointed as Inspectors/Lieutenants in the Philippine National Police, Bureau of Fire Protection, and the Bureau of Jail Management and Penology according to their choice of public safety curriculum during their cadetship. This is under the supervision of the DILG and the Philippine Public Safety College.\n\nAside from the PMA and the PMMA, all three branches of the AFP have their own Officer Candidate Course Programs for both men and women, patterned after their US counterparts.\n\nThe nation's higher military colleges are:\n* Armed Forces of the Philippines Command and General Staff College, Quezon City – educates officers of the AFP not exceeding the ranks of Colonel or Navy Captain\n* National Defense College of the Philippines, Quezon City – is a school for senior AFP officers for military/naval planning and to ready them in holding the ranks of Brigadier General/Commodore. Notable civilians may enroll and be given the honorary rank of Lieutenant Colonel/Commander in the AFP Reserve upon graduation.\n\nPoland\n\n*National Defence University in Warsaw\n*Jarosław Dąbrowski Military University of Technology in Warsaw\n*Tadeusz Kościuszko Land Forces Military Academy in Wrocław\n*Polish Air Force Academy in Dęblin\n*Heroes of Westerplatte Naval Academy in Gdynia\n*Faculty of Military Medicine of the Medical University in Łódź\n\nDefunct\n\n*Dzerzhinsky Political-Military Academy in Warsaw\n* Polish Air Defense Forces Academy\n\nPortugal\n\nPre-University level institution\n\n* Colégio Militar, Lisbon – military basic and high school;\n* Instituto dos Pupilos do Exército, Lisbon – vocational education military school.\n\nUndergraduate officer training\n\n* Academia Militar, Lisbon and Amadora – Portuguese Army and Republican National Guard university school;\n* Escola Naval, Almada – Portuguese Navy university school;\n* Academia da Força Aérea, Sintra – Portuguese Air Force university school;\n\nPostgraduate and staff training\n\n* Instituto de Estudos Superiores Militares, Lisbon – Joint command and staff college.\n\nNo longer operational\n\n* Instituto Superior Militar, Águeda – Undergraduate school for training NCOs to become officers;\n* Escola Superior Politécnica do Exército, Amadora – Undergraduate school for training NCOs to become officers.\n* Escola do Serviço de Saúde Militar, Lisbon – Portuguese Armed Forces nurse and paramedic undergraduate school.\n* Instituto de Odivelas, Odivelas – Pre-university level military school for girls;\n* Instituto de Altos Estudos Militares, Lisbon – Army graduate and staff college;\n* Instituto Superior Naval de Guerra, Lisbon – Navy graduate and staff college;\n* Instituto de Altos Estudos da Força Aérea, Sintra – Air Force graduate and staff college.\n\nRomania\n\n* Carol I National Defence University (Universitatea Națională de Apărare Carol I), Bucharest\n*Technical Military Academy (Academia Tehnică Militară), Bucharest\n* Land Forces:\n**Nicolae Bălcescu Land Forces Academy, Sibiu\n* Air Forces:\n**Academia Forțelor Aeriene (Air Forces Academy), Braṣov\n* Naval Forces:\n**Mircea cel Bătrân Naval Academy, Constanṭa\n\nRussia\n\nSee also: Cadet Corps (Russia), Military academies in Russia\n\nFirst stage of training\n\n* The Cadet Corps is an admissions-based military middle school for young boys that was founded in the Russian Empire in the year 1732, soon becoming widespread throughout the country.\n*Omsk Cadet Corps\n*Karelia Cadet Corps\n*Krasnoyarsk Cadet Corps\n*Magnitogorsk Cadet Corps\n*Georgy Zhukov Moscow Cadet Corps\n* Moscow Cossacks Cadet Corps\n* Moscow Cadet Corps of Military Music\n* Moscow Cadet Corps of the Ministry of Emergency Situations of Russia\n* Moscow Diplomatic Cadet Corps\n* Moscow Cadet Corps \"Heroes of the Battle of Stalingrad\"\n*St.Petersburg Space Forces Cadet Corps\n*St.Petersburg Strategic Rocket Forces Cadet Corps\n*St.Petersburg Artillery Cadet Corps\n*The 1st St.Petersburg Border guard Cadet Corps of the FSB\n*Tambov Cadet Corps\n*Toliatti Cadet Corps\n*Ufa Cadet Corps\n* The Sea Cadet Corps\n* Kronstadt S.C.C.\n* Moscow Representative Sea Cadet Corps of the Navigation and Mathematics School\n* Moscow Sea Cadet Corps Heroes of Sevastopol\n\nSecondary education\n\n* Suvorov Military School are a type of boarding school in modern Russia for boys of 14-18. Education in such these schools focuses on military related subjects.\n* Kazan S.M.S.\n* Moscow S.M.S.\n* North Caucasus S.M.S.\n* Orenburg S.M.S.\n* Perm S.M.S. \n* St.Petersburg Space Forces S.M.S.\n* Tula S.M.S. (reopening 2016 after 56 years of closure)\n* Tver S.M.S.\n* Ulyanovsk S.M.S.\n* Ussuriysk S.M.S.\n* Yekaterinburg S.M.S.\n* Nakhimov Naval School is a form of higher military education for teenagers introduced in modern Russia.\n* St. Petersburg N.N.S.\n\nPost-secondary education\n\n* Combined Arms Academy of the Armed Forces\n* Gagarin Air Force Academy (now the Gagarin-Zhukovsky Combined Air Force Academy)\n* Military Engineering-Technical University\n* Saint Petersburg Mining Institute\n* Fleet Admiral Nikolai Kuznetsov Naval Academy\n* Alexander Popov Naval Radio-electronic Academy\n* Military Materiel Security Academy \n* Pacific Naval Institute\n* Moscow Peter the Great Strategic Rocket Forces Academy\n* Baltic Naval Institute\n* Sevastopol Black Sea Higher Naval Institute\n* Military University of the Ministry of Defense of Russia\n* Yekaterinburg Force Command School of Artillery\n* Air General Staff Center of Missile and Air Defense Excellence\n* Khabarovsk Military Commanders Training Academy\n* Civil Defense Academy of the Ministry of Emergency Situations\n* Sergey Kirov Military Communications Academy\n* Military Medical Academy\n* St. Petersburg Academy of Physical Culture, Fitness and Sports\n* Marshal Aleksander Vasilevsky Military Academy of the Armed Forces Air Defense Branch\n* Moscow Border Guards Superior College\n* Military University of the Ministry of Internal Affairs\n\nStaff college\n\n* General Staff Academy\n\nSerbia\n\n* Military Academy Belgrade\n* Military Medical Academy (Serbia)\n\nSingapore\n\n*Officer Cadet School\n*Singapore Command and Staff College\n\nSouth Africa \n\n* South African Military Academy provides officers in the SANDF with an opportunity to earn a 3yr BMil degree.\n\nSpain\n\n*Academia General Militar, Zaragoza\n*Academia General del Aire, San Javier\n*Escuela Naval Militar de Oficiales, Marín\n\nSri Lanka\n\nThe General Sir John Kotelawala Defense University, was established in 1980 and is named after Gen. Sri John Kotelawala the 2nd Prime Minister of Sri Lanka. Taking cadets from all three armed services, 3 non-university level Military Academies, one for each armed service providing basic training for officer and a Command and Staff College for senior officers of the three armed services.\n\nUniversity\n\n*General Sir John Kotelawala Defence University, Colombo\nOfficer training\n\n*Sri Lanka Military Academy, Diyatalawa\n*Naval and Maritime Academy, Trincomalee\n*Air Force Academy, SLAF China Bay, Trincomalee\nStaff training\n\n*Defence Services Command and Staff College\n\nSweden\n\n*Military Academy Karlberg\n\nTanzania\n\n*Tanzania Military Academy\n\nThailand\n\n*Armed Forces Academies Preparatory School (Secondary level)\n*Chulachomklao Royal Military Academy (University level)\n*Phramongkutklao College of Medicine (Medicine, University level)\n*Royal Thai Navy Academy (university level)\n*Royal Thai Air Force Academy (university level)\n\nTurkey\n\n* National Defence University\n* Turkish Military Academy\n* Turkish Naval Academy\n* Turkish Air Academy\n\nTurkmenistan \n\n* Turkmanbashi Military Institute of the Ministry Of Defense of Turkmenistan\n* Turkmenistan State Border Service InService\n\nUganda\n\nUganda maintains the followings military training institutions, as of December 2010:[http://newvision.co.ug/D/8/13/670922 List of Uganda Military Schools] \n\n* Bihanga Military Training School – Located at Bihanga, in Ibanda District, Western Uganda.\n* Kalama Warfare Training School – Located at Kabamba, Mubende District[http://newvision.co.ug/D/8/19/427401 Kalama Warfare Training School Located at Kabamba] \n* National Leadership Institute (NALI) – Located at Kyankwanzi, Kyankwanzi District\n* Oliver Tambo School of Leadership – Located at Kaweweta, Nakaseke District[http://newvision.co.ug/D/8/13/714298/Oliver%20Tambo Oliver Tambo Leadership School Located at Kaweweta, Nakaseke District] [http://sundayvision.co.ug/detail.php?mainNewsCategoryId7&newsCategoryId\n123&newsId=744584 South Africa Donates Equipment to Oliver Tambo School] \n* Uganda Air Defence and Artillery School – Located at Nakasongola in Nakasongola District\n* Uganda Military Airforce Academy – Located at Nakasongola in Nakasongola District\n* University of Military Science and Technology – Located at Lugazi, Buikwe District[http://www.sundayvision.co.ug/detail.php?mainNewsCategoryId7&newsCategoryId\n128&newsId=745820 The NUST Located at Lugazi] \n* Uganda Junior Staff College – Located at Qaddafi Barracks, Jinja\n* Uganda Military Academy – Located at Kabamba, Mubende District\n* Uganda Senior Command and Staff College – Located at Kimaka, Jinja\n* Uganda Urban Warfare Training School – Located at Singo, Kiboga District[http://newvision.co.ug/D/8/12/741915 About Uganda Urban Warfare Training School] \n\nUkraine\n\nA number of universities have specialized military institutes, such as the Faculty of Military Legal Studies at Kharkiv's National Yaroslav Mudryi Law Academy of Ukraine, however, the primary Ukrainian military academies are the following:\n* Hetman Petro Sahaydachnyi Military Academy, Lviv\n* Admiral Pavel Nakhimov Naval Academy, Odessa\n* Ivan Kozhedub Air Force University, Kharkiv\n\nStaff colleges\n\n* National Defence University of Ukraine \"Ivan Chernyakhovsky\", Kyiv [http://www.nuou.org.ua Official website of National Defense University of Ukraine]\n\nUnited Kingdom\n\nPre-University level institution\n\n*Welbeck Defence Sixth Form College – Sixth form college for 16- to 18-year-olds providing A-Level education in preparation for entry into the British Armed Forces or Ministry of Defence Civil Service as Technical Officers, following undergraduate education sponsored under the Defence Technical Undergraduate Scheme (DTUS).\n*Duke of York's Royal Military School – Military based secondary school in Dover, Kent; students are influenced to join the forces after education, but have no commitment to do so.\n\nThere are also numerous Cadet forces that operate for all branches of the armed forces for children aged 10–20.  These are not designed to recruit people into the armed forces but rather are simply Ministry of Defence sponsored youth organisations.\n\nUndergraduate Service\n\nAlthough an undergraduate degree is not a pre-requisite for Officer training, the majority of potential Officers will have attended University before joining the Armed Forces.  At some universities there may be the option for people to join either a University Royal Naval Unit, a University Officer Training Corps (UOTC) or a University Air Squadron; which are designed to introduce students to life in the Forces and show them the careers that are available.  People sponsored under the Defence Technical Undergraduate Scheme will join one of the four Support Units attached to universities participating in DTUS. There is a requirement for bursars of DTUS to join the military for 3 years after completion of their degree, there no requirement for students of any other organisation to join the military after they finish their degree programs; and the great majority have no further contact with the armed forces.  Although service with these organisations may give some initial benefit to cadets attending the military colleges/academies, the next stage of the officer training programs assumes no prior military experience/knowledge, and those that did not partake in military activities at university are not disadvantaged.\n\nOfficer training\n\nThere are now four military academies in the United Kingdom.  Although the curriculum at each varies due to the differing nature of the service a man or woman is joining, it is a combination of military and academic study that is designed to turn young civilians into comprehensibly trained military officers.\n\n*Britannia Royal Naval College, HMS Dartmouth\n*Commando Training Centre Royal Marines\n*Royal Military Academy Sandhurst\n*Royal Air Force College Cranwell\n\nOfficer Training for the Reserve Forces (e.g. Army Reserve, Royal Naval Reserve, RAF Reserves & Royal Marine Reserves) also takes place at the relevant military academies, but under a different curriculum and the courses tend to be concentrated into a much shorter period.\n\nPostgraduate and staff training\n\n*Defence Academy of the United Kingdom\n*Royal College of Defence Studies (mainly for officers of Colonel/Brigadier or equivalent rank selected as future senior leaders; highly selective)\n*Joint Services Command and Staff College (courses for officers from Major to Brigadier or equivalent rank)\n*Defence College of Management and Technology\n*Armed Forces Chaplaincy Centre\n*Advanced Research and Assessment Group\n*Conflict Studies Research Centre\n\nNo longer operational\n\n*Royal Naval College, Greenwich\n*Royal Naval Engineering College, HMS Thunderer\n*Staff College, Camberley\n*RAF Staff College, Andover\n*RAF Staff College, Bracknell\n*Royal Military Academy, Woolwich\n*Joint Service Defence College\n\nUnited States\n\nIntroduction\n\nIn the United States, the term \"military academy\" does not necessarily mean a government-owned institution run by the armed forces to train its own officers.  It may also mean a middle school, high school, or college, whether public or private, which instructs its students in military-style education, discipline and tradition.  Students at such civilian institutions can earn a commission in the U.S. military through the successful completion of a Senior Reserve Officers' Training Corps program along with their college or university's academic coursework.\n\n*The term military school primarily refers to pre-collegiate secondary-school-level military institutions, which were more common before the 1970s and 1980s.\n*The term military academy commonly refers to a pre-collegiate, collegiate, and post-collegiate institution, especially the U.S. military-run academies.\n* The term US military staff colleges refers to separate graduate schools catering to officers on active duty .\n\nMost state-level military academies maintain both a civilian student body and a traditional corps of cadets.  The only exception is the Virginia Military Institute, which remains all-military.\n\nFederal Service Academies\n\nThe colleges operated by the U.S. Federal Government are referred to as Federal Service Academies and are:\n\n*United States Military Academy, West Point, New York\n*United States Naval Academy, Annapolis, Maryland\n*United States Air Force Academy, Colorado Springs, Colorado\n*United States Coast Guard Academy, New London, Connecticut\n*United States Merchant Marine Academy, Kings Point, New York\n\nPost-graduate School\n\n*Uniformed Services University of the Health Sciences, Bethesda, Maryland\n\nSenior and junior military colleges\n\nThere is one all-military state-sponsored military academy:\n\n*The Virginia Military Institute (VMI), Lexington, Virginia\n\nIn addition, these five institutions that were military colleges at the time of their founding now maintain both a corps of cadets and a civilian student body.  Many of these institutions also offer on-line degree programs:\n\n*University of North Georgia, Dahlonega, Georgia — Formed by a 2013 merger with Gainesville State College, its main predecessor institution, last known as North Georgia College & State University, was chartered as a military college. However, when NGCSU was founded in 1873 as North Georgia Agricultural College, it had both a corps and a civilian student body, and was also the state's first coeducational college.\n*Norwich University Corps of Cadets. Norwich University, Northfield, Vermont is a private university located in Northfield, Vermont. It is the oldest private military college in the United States. The university was founded in 1819 at Norwich, Vermont, as the American Literary, Scientific and Military Academy. It is the oldest of six senior military colleges, and is recognized by the United States Department of Defense as the \"Birthplace of ROTC\"\n*Texas A&M Corps of Cadets, Texas A&M University, College Station, Texas\n*The Citadel, The Military College of South Carolina, Charleston, South Carolina\n*Virginia Tech Corps of Cadets, Virginia Polytechnic Institute and State University, Blacksburg, Virginia\n\nAlong with VMI, these institutions are known as the Senior Military Colleges of the US.\n\nToday four institutions are considered Military Junior Colleges (MJC). These four military schools participate in the Army's two-year Early Commissioning Program, an Army ROTC program where qualified students can earn a commission as a Second Lieutenant after only two years of college. The four Military Junior Colleges are as follows:\n\n*Georgia Military College, Milledgeville, Georgia\n*Marion Military Institute, Marion, Alabama\n*New Mexico Military Institute, Roswell, New Mexico\n*Valley Forge Military Academy and College, Wayne, Pennsylvania\n\nMerchant Marine Academies that have military academy style operations\n\nThere are six (6) state-operated Merchant Marine academies:\n* Massachusetts Maritime Academy\n* Maine Maritime Academy\n* State University of New York Maritime College (part of the State University of New York (SUNY) system)\n* Texas A&M Maritime Academy (part of the Texas A&M University System)\n* Great Lakes Maritime Academy (a division of Northwestern Michigan College)\n* California State University Maritime Academy (part of the California State University system)\nThese merchant marine academies operate on a military college system. Part of the training that the cadets receive is naval and military in nature. Cadets may apply for Naval Reserve commissions upon obtaining their Merchant Marine Officer's licenses. Most if not all also offer some form of military commissioning program into the active duty US Navy, US Marine Corps, or US Coast Guard.\n\nStaff Colleges\n\nThe United States staff colleges, mandated to serve the needs of officers for post-graduate studies and other such graduate institutions as mandated by the Department of Defense are:\n\nUnited States Air Force Air University attached staff colleges\n\n* The Air University in Maxwell AFB, Alabama, includes the\n** Squadron Officer College and Squadron Officer School\n** Air Command and Staff College\n** Air War College\n\nStaff Colleges of the United States Army\n\n* United States Army Command and General Staff College\n* United States Army School of Advanced Military Studies\n* United States Army War College\n\nStaff Colleges of the United States Navy and the United States Marine Corps\n\n* Naval War College\n* Naval Postgraduate School\n* Marine Corps University\n\nJoint Service staff colleges\n\n* National Defense University in Washington, D.C. which includes the\n** Joint Forces Staff College (Norfolk, Virginia)\n** National War College\n** Dwight D. Eisenhower School for National Security and Resource Strategy\n* Defense Acquisition University\n\nOther post-graduate colleges operated by the DoD\n\n* National Intelligence University (Military intelligence)\n* The Judge Advocate General's Legal Center and School (Legal services training)\n* Air Force Judge Advocate General's School (Legal services training)\n* Naval Justice School (Legal services training)\n\nUzbekistan \n\n* Higher MIlitary Customs Institute\n\nVietnam\n\n*National Defense Academy of Vietnam in Hanoi, Vietnam\n*Lê Quý Đôn Technical University in Hanoi, Vietnam\n*Vietnam Naval Academy in Nha Trang, Khánh Hòa Province, Vietnam. Military academy. http://en.wikipedia.org/?curid=20311."
  }
}
