{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13846",
  "eid" : "0e4a3240-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778533220,
  "textBody" : "Modern Hebrew is phonetically simpler than Biblical Hebrew and has fewer phonemes, but it is phonologically more complex. It has 25 to 27 consonants and 8 to 10 vowels, depending on the speaker and the analysis.\n\nHebrew has been used primarily for liturgical, literary, and scholarly purposes for most of the past two millennia. As a consequence, its pronunciation was strongly influenced by the vernacular of individual Jewish communities. With the revival of Hebrew as a native language, and especially with the establishment of Israel, the pronunciation of the modern language rapidly coalesced.\n\nThe two main accents of modern Hebrew are Oriental and Non-Oriental. Oriental Hebrew was chosen as the preferred accent for Israel by the Academy of the Hebrew Language, but has since declined in popularity. The description in this article follows the language as it is pronounced by native Israeli speakers of the younger generations.\n\nOriental and non-Oriental accents\n\nAccording to the Academy of the Hebrew Language, in the 1880s (the time of the beginning of the Zionist movement and the Hebrew revival) there were three groups of Hebrew regional accents: Ashkenazi (Eastern European), Sephardi (Southern European), and Mizrahi (Middle Eastern, Iranian, and North African). Over time  features of these systems of pronunciation merged, and nowadays we find two main pronunciations of colloquial – not liturgical – Hebrew: Oriental and Non-Oriental. Oriental Hebrew displays traits of an Arabic substrate.Ora (Rodrigue) Schwarzwald. \"Modern Hebrew\", in Khan, Geoffrey, Michael P. Streck, and Janet CE Watson (eds.). The Semitic languages: an international handbook. Edited by Stefan Weninger. Vol. 36. Walter de Gruyter, 2011. p. 524-25\nOriental speakers tend to use an alveolar trill rather than a uvular trill or a velar fricative, preserve the pharyngeal consonants and (less commonly), preserve gemination, and pronounce in some places where non-Oriental speakers do not have a vowel (the shva na). Some Oriental speakers maintain a few of the emphatic consonants also found in Arabic, such as for Biblical.\n\nPronunciation of\n\nNon-Oriental (and General Israeli) pronunciation lost the emphatic and pharyngeal sounds of Biblical Hebrew under the influence of Indo-European languages (Germanic and Slavic for Ashkenazim and Romance for Sephardim). The pharyngeals and are preserved by older Oriental speakers.\nDialectically, Georgian Jews pronounce as, while Western European Sephardim and Dutch Ashkenazim traditionally pronounce it, a pronunciation that can also be found in the Italian tradition and, historically, in south-west Germany. However, according to Sephardic and Ashkenazic authorities, such as the Mishneh Berurah and the Shulchan Aruch and Mishneh Torah, is the proper pronunciation. Thus, it is still pronounced as such by some Sephardim and Ashkenazim.\n\nPronunciation of\n\nThe classical pronunciation associated with the consonant ר rêš was a flap, and was grammatically ungeminable. In most dialects of Hebrew among the Jewish diaspora, it remained a flap or a trill. However, in some Ashkenazi dialects of northern Europe it was a uvular rhotic, either a trill or a fricative. This was because most native dialects of Yiddish were spoken that way, and the liturgical Hebrew of these speakers carried the Yiddish pronunciation. Some Iraqi Jews also pronounce rêš as a guttural, reflecting Baghdad Jewish Arabic. An apparently unrelated uvular rhotic is believed to have appeared in the Tiberian vocalization of Hebrew, where it is believed to have coexisted with additional non-guttural articulations of depending on circumstances.https://www.tititudorancea.net/z/guttural_r.htm In Modern Israeli Hebrew, the dominant pronunciation is a velar fricative,, which sounds similar to.\n\nThough an Ashkenazi Jew in the Russian Empire, the Zionist Eliezer Ben-Yehuda based his Standard Hebrew on Sephardi Hebrew originally spoken in Spain and therefore recommended an alveolar.  The first waves of Jews to resettle in the Holy Land were northern Ashkenazi, and Standard Hebrew would come to be spoken with their preferred uvular articulation as found in Yiddish or modern standard German. Nearly all Jews of Israel now speak Hebrew with a uvular or velar because of its modern prestige and historical elite status.\n\nMany Jewish immigrants to Israel spoke a variety of Arabic in their countries of origin, and pronounced the Hebrew rhotic consonant /r/ as an alveolar trill, identical to Arabic  ', and which followed the conventions of old Hebrew.Based on Rabbi Saadia Gaon's Judeo-Arabic commentary on “Sefer Yetzirah” (chapter 4, paragraph 3), wherein he describes the phonetic sounds of the 22 characters of the Hebrew alphabet and classifies them in groups based on their individual sounds: “Aleph (א), hé (ה), ḥet (ח), ‘ayin (ע) are [guttural sounds] produced from the depth of the tongue with the opening of the throat, but bet (ב), waw (ו), mim (מ), pé (פ) are [labial sounds] made by the release of the lips and the end of the tongue; whereas gimel (ג), yōd (י), kaf (כ), quf (ק) are [palatals] separated by the width of the tongue [against the palate] with the [emission of] sound. However, daleth (ד), ṭet (ט), lamed (ל), nūn (נ), tau (ת) are [linguals] separated by the mid-section of the tongue with the [emission of] sound; whereas zayin (ז), samekh (ס), ṣadi (צ), resh (ר), shin (ש) are [dental sounds] produced between the teeth by a tongue that is at rest.” Under pressure to assimilate, many of them began pronouncing their Hebrew rhotic as a voiced uvular or velar fricative, often identical to Arabic  '. However, in modern Ashkenazi, Sephardi, and Mizrahi poetry and folk music, as well as in the standard (or \"standardised\") Hebrew used in the Israeli media, an alveolar rhotic is sometimes used.\n\nConsonants\n\nThe Hebrew word for consonants is ' (). The following table lists the consonant phonemes of Israeli Hebrew in IPA transcription:\n\n1 In modern Hebrew for ח has been absorbed by that was traditionally only for fricative כ, though some older Mizrahi speakers still separate these.\n2 The glottal consonants are mostly elided in unstressed syllables, and sometimes also in stressed syllables as well, but are pronounced in careful or formal speech. In modern Hebrew for ע has been absorbed by that was traditionally only for א, though some older Mizrahi speakers still separate these.\n3 Commonly transcribed. This is usually pronounced as a velar fricative, sometimes as a uvular fricative or approximant, and sometimes as a uvular or alveolar trill, depending on the background of the speaker.\n4 The phonemes were introduced through borrowings.\n\nObstruents assimilate in voicing. Voiceless obstruents (stops/affricates and fricatives) become voiced when they appear immediately before voiced obstruents, and vice versa. For example:\n\n*  > ('to close'), >\n*  > ('a right'), >\n*  > ('a bill'), >\n*  > ('a printer'), >\n*  > ('security'), >\n\n is pronounced before velar consonants.\n\nIllustrative words\n\nHistorical sound changes\n\nStandard Israeli Hebrew (SIH) phonology has undergone a number of splits and mergers in its development from Biblical Hebrew (BH).Robert Hetzron. (1987). Hebrew. In The World's Major Languages, ed. Bernard Comrie, 686–704. Oxford: Oxford University Press. .\n* BH and merged into SIH.\n* BH and merged into SIH.\n* BH and generally merge into SIH, but the distinction is maintained in the educated speech of many Sephardim and some Ashkenazim.\n* BH had two allophones, and, which split into separate phonemes and in SIH.\n* BH had two allophones, and. The allophone merged with into SIH. A new phoneme was introduced in loanwords (see Hebrew vav as consonant), so SIH has phonemic.\n* BH had two allophones, and. The allophone merged with into SIH, while the allophone merged with into SIH, though a distinction between and is maintained in the educated speech of many Sephardim and some Ashkenazim.\n\nSpirantization\n\nThe consonant pairs~,~, and~ were historically allophonic, as a consequence of a phenomenon of spirantisation known as begadkefat. In Modern Hebrew, the six sounds are phonemic. Similar allophonic alternation of BH~,~ and~ was lost, with the allophones merging into simple, though has reappeared from BH in the accent of the majority of the population.\n\nThese phonemic changes were partly due to the mergers noted above, to the loss of consonant gemination, which had distinguished stops from their fricative allophones in intervocalic position, and the introduction of syllable-initial and non-syllable-initial and in loan words. Spirantization still occurs in verbal and nominal derivation, but now the alternations~,~, and~ are phonemic rather than allophonic.\n\nVowels\n\nThe Hebrew word for vowels is ' (, lit. movements). Hebrew has nine vowel phonemes, five short and four long:\n\nLong vowels occur where two identical vowels were historically separated by a pharyngeal or glottal consonant, and the first was stressed. (Where the second was stressed, the result is a sequence of two short vowels.) They also often occur when morphology brings two identical vowels together, but they are not predictable in that environment.\n\nAny of the five short vowels may be realized as a schwa when far from lexical stress.\n\nThere are two diphthongs, and.\n\nVowel length\n\nIn Biblical Hebrew, each vowel had three forms: short, long and interrupted ('). However, there is no audible distinction between the three in Modern Hebrew, except that is often pronounced as in Ashkenazi Hebrew.\n\nVowel length in Modern Hebrew is environmentally determined and not phonemic, it tends to be affected by the degree of stress, and pretonic lengthening may also occur, mostly in open syllables. When a glottal is lost, a two-vowel sequence arises, and they may be merged into a single long vowel:[http://www.brill.com/downloads/COM-00000450_Vowel%20Length%20Biblical%20Hebrew_981-985.pdf Vowel length in Biblical Hebrew-Modern Hebrew]\n\n*  ('you will work') >\n*  ('watches') > becomes\n\nShva\n\nModern pronunciation does not follow traditional use of the niqqud (diacritic) \"shva\". In Modern Hebrew, words written with a shva may be pronounced with either or without any vowel (or sometimes as an actual schwa), and this does not correspond well to how the word was pronounced historically. For example, the first shva in the word  'you (fem.) crumpled' is pronounced though historically it was silent, whereas the shva in  ('time'), which was pronounced historically, is usually silent. Orthographic shva is generally pronounced in prefixes such as ve- ('and') and be- ('in'), or when following another shva in grammatical patterns, as in ('you [f. sg.] will learn'). An epenthetic appears when necessary to avoid violating a phonological constraint, such as between two consonants that are identical or differ only in voicing (e.g. 'I learned', not) or when an impermissible initial cluster would result (e.g. or, where C stands for any consonant).\n\nAspiration \n\nAspiration is used in the final ה of feminine words to denote genitive case in third-person, being designated by putting a dot (dagesh) in the ה. Normally, it is written with a kamatz in the letter before the ה, for example in the word ּמִטּוּבָה (\"from its goodness\"). When the letter before is a guttural (ר,ח,ה,א), the kamatz is moved under the ה and turns into a patach. This feature is found in many dialects, but in spoken Hebrew it has all but disappeared.\n\nStress\n\nStress is phonemic in Modern Hebrew. There are two frequent patterns of lexical stress, on the last syllable (' מִלְּרַע) and on the penultimate syllable (' מִלְּעֵיל). Final stress has traditionally been more frequent, but in the colloquial language many words are shifting to penultimate stress. Contrary to the prescribed standard, some words exhibit stress on the antepenultimate syllable or even further back. This often occurs in loanwords, e.g.  ('politics'), and sometimes in native colloquial compounds, e.g.  ('somehow').Yaakov Choueka, Rav-Milim: A comprehensive dictionary of Modern Hebrew 1997, CET Colloquial stress has often shifted from the last syllable to the penultimate, e.g.  'hat', normative, colloquial;  ('dovecote'), normative, colloquial. This shift is common in the colloquial pronunciation of many personal names, for example  ('David'), normative, colloquial.Netser, Nisan, Niqqud halakha le-maase, 1976, p. 11.\n\nHistorically, stress was predictable, depending on syllable weight (that is, vowel length and whether a syllable ended with a consonant). Because spoken Israeli Hebrew has lost gemination (a common source of syllable-final consonants) as well as the original distinction between long and short vowels, but the position of the stress often remained where it had been, stress has become phonemic, as the following table illustrates. Phonetically, the following word pairs differ only in the location of the stress; orthographically they differ also in the written representation of vowel length of the vowels (assuming the vowels are even written):\n\nMorphophonology\n\nWhen a vowel falls beyond two syllables from the main stress of a word or phrase, it may be reduced or elided in colloquial Hebrew. For example:\n\n: > ('that is to say')\n\n: > ('what are you called?')\n\nWhen follows an unstressed vowel, it is elided, sometimes with the surrounding vowels:\n\n: > ('your father')\n\n: > ('he will give you')\n\nSyllables drop before except at the end of a prosodic unit:\n\n: > ('usually')\nbut:  ('he is on his way') at the end of a prosodic unit.\n\nSequences of dental stops reduce to a single consonant, again except at the end of a prosodic unit:\n\n: > ('I once studied')\nbut:  ('that I studied')\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Modern Hebrew phonology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13846" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Modern Hebrew is phonetically simpler than Biblical Hebrew and has fewer phonemes, but it is phonologically more complex. It has 25 to 27 consonants and 8 to 10 vowels, depending on the speaker and the analysis.\n\nHebrew has been used primarily for liturgical, literary, and scholarly purposes for most of the past two millennia. As a consequence, its pronunciation was strongly influenced by the vernacular of individual Jewish communities. With the revival of Hebrew as a native language, and especially with the establishment of Israel, the pronunciation of the modern language rapidly coalesced.\n\nThe two main accents of modern Hebrew are Oriental and Non-Oriental. Oriental Hebrew was chosen as the preferred accent for Israel by the Academy of the Hebrew Language, but has since declined in popularity. The description in this article follows the language as it is pronounced by native Israeli speakers of the younger generations.\n\nOriental and non-Oriental accents\n\nAccording to the Academy of the Hebrew Language, in the 1880s (the time of the beginning of the Zionist movement and the Hebrew revival) there were three groups of Hebrew regional accents: Ashkenazi (Eastern European), Sephardi (Southern European), and Mizrahi (Middle Eastern, Iranian, and North African). Over time  features of these systems of pronunciation merged, and nowadays we find two main pronunciations of colloquial – not liturgical – Hebrew: Oriental and Non-Oriental. Oriental Hebrew displays traits of an Arabic substrate.Ora (Rodrigue) Schwarzwald. \"Modern Hebrew\", in Khan, Geoffrey, Michael P. Streck, and Janet CE Watson (eds.). The Semitic languages: an international handbook. Edited by Stefan Weninger. Vol. 36. Walter de Gruyter, 2011. p. 524-25\nOriental speakers tend to use an alveolar trill rather than a uvular trill or a velar fricative, preserve the pharyngeal consonants and (less commonly), preserve gemination, and pronounce in some places where non-Oriental speakers do not have a vowel (the shva na). Some Oriental speakers maintain a few of the emphatic consonants also found in Arabic, such as for Biblical.\n\nPronunciation of\n\nNon-Oriental (and General Israeli) pronunciation lost the emphatic and pharyngeal sounds of Biblical Hebrew under the influence of Indo-European languages (Germanic and Slavic for Ashkenazim and Romance for Sephardim). The pharyngeals and are preserved by older Oriental speakers.\nDialectically, Georgian Jews pronounce as, while Western European Sephardim and Dutch Ashkenazim traditionally pronounce it, a pronunciation that can also be found in the Italian tradition and, historically, in south-west Germany. However, according to Sephardic and Ashkenazic authorities, such as the Mishneh Berurah and the Shulchan Aruch and Mishneh Torah, is the proper pronunciation. Thus, it is still pronounced as such by some Sephardim and Ashkenazim.\n\nPronunciation of\n\nThe classical pronunciation associated with the consonant ר rêš was a flap, and was grammatically ungeminable. In most dialects of Hebrew among the Jewish diaspora, it remained a flap or a trill. However, in some Ashkenazi dialects of northern Europe it was a uvular rhotic, either a trill or a fricative. This was because most native dialects of Yiddish were spoken that way, and the liturgical Hebrew of these speakers carried the Yiddish pronunciation. Some Iraqi Jews also pronounce rêš as a guttural, reflecting Baghdad Jewish Arabic. An apparently unrelated uvular rhotic is believed to have appeared in the Tiberian vocalization of Hebrew, where it is believed to have coexisted with additional non-guttural articulations of depending on circumstances.https://www.tititudorancea.net/z/guttural_r.htm In Modern Israeli Hebrew, the dominant pronunciation is a velar fricative,, which sounds similar to.\n\nThough an Ashkenazi Jew in the Russian Empire, the Zionist Eliezer Ben-Yehuda based his Standard Hebrew on Sephardi Hebrew originally spoken in Spain and therefore recommended an alveolar.  The first waves of Jews to resettle in the Holy Land were northern Ashkenazi, and Standard Hebrew would come to be spoken with their preferred uvular articulation as found in Yiddish or modern standard German. Nearly all Jews of Israel now speak Hebrew with a uvular or velar because of its modern prestige and historical elite status.\n\nMany Jewish immigrants to Israel spoke a variety of Arabic in their countries of origin, and pronounced the Hebrew rhotic consonant /r/ as an alveolar trill, identical to Arabic  ', and which followed the conventions of old Hebrew.Based on Rabbi Saadia Gaon's Judeo-Arabic commentary on “Sefer Yetzirah” (chapter 4, paragraph 3), wherein he describes the phonetic sounds of the 22 characters of the Hebrew alphabet and classifies them in groups based on their individual sounds: “Aleph (א), hé (ה), ḥet (ח), ‘ayin (ע) are [guttural sounds] produced from the depth of the tongue with the opening of the throat, but bet (ב), waw (ו), mim (מ), pé (פ) are [labial sounds] made by the release of the lips and the end of the tongue; whereas gimel (ג), yōd (י), kaf (כ), quf (ק) are [palatals] separated by the width of the tongue [against the palate] with the [emission of] sound. However, daleth (ד), ṭet (ט), lamed (ל), nūn (נ), tau (ת) are [linguals] separated by the mid-section of the tongue with the [emission of] sound; whereas zayin (ז), samekh (ס), ṣadi (צ), resh (ר), shin (ש) are [dental sounds] produced between the teeth by a tongue that is at rest.” Under pressure to assimilate, many of them began pronouncing their Hebrew rhotic as a voiced uvular or velar fricative, often identical to Arabic  '. However, in modern Ashkenazi, Sephardi, and Mizrahi poetry and folk music, as well as in the standard (or \"standardised\") Hebrew used in the Israeli media, an alveolar rhotic is sometimes used.\n\nConsonants\n\nThe Hebrew word for consonants is ' (). The following table lists the consonant phonemes of Israeli Hebrew in IPA transcription:\n\n1 In modern Hebrew for ח has been absorbed by that was traditionally only for fricative כ, though some older Mizrahi speakers still separate these.\n2 The glottal consonants are mostly elided in unstressed syllables, and sometimes also in stressed syllables as well, but are pronounced in careful or formal speech. In modern Hebrew for ע has been absorbed by that was traditionally only for א, though some older Mizrahi speakers still separate these.\n3 Commonly transcribed. This is usually pronounced as a velar fricative, sometimes as a uvular fricative or approximant, and sometimes as a uvular or alveolar trill, depending on the background of the speaker.\n4 The phonemes were introduced through borrowings.\n\nObstruents assimilate in voicing. Voiceless obstruents (stops/affricates and fricatives) become voiced when they appear immediately before voiced obstruents, and vice versa. For example:\n\n*  > ('to close'), >\n*  > ('a right'), >\n*  > ('a bill'), >\n*  > ('a printer'), >\n*  > ('security'), >\n\n is pronounced before velar consonants.\n\nIllustrative words\n\nHistorical sound changes\n\nStandard Israeli Hebrew (SIH) phonology has undergone a number of splits and mergers in its development from Biblical Hebrew (BH).Robert Hetzron. (1987). Hebrew. In The World's Major Languages, ed. Bernard Comrie, 686–704. Oxford: Oxford University Press. .\n* BH and merged into SIH.\n* BH and merged into SIH.\n* BH and generally merge into SIH, but the distinction is maintained in the educated speech of many Sephardim and some Ashkenazim.\n* BH had two allophones, and, which split into separate phonemes and in SIH.\n* BH had two allophones, and. The allophone merged with into SIH. A new phoneme was introduced in loanwords (see Hebrew vav as consonant), so SIH has phonemic.\n* BH had two allophones, and. The allophone merged with into SIH, while the allophone merged with into SIH, though a distinction between and is maintained in the educated speech of many Sephardim and some Ashkenazim.\n\nSpirantization\n\nThe consonant pairs~,~, and~ were historically allophonic, as a consequence of a phenomenon of spirantisation known as begadkefat. In Modern Hebrew, the six sounds are phonemic. Similar allophonic alternation of BH~,~ and~ was lost, with the allophones merging into simple, though has reappeared from BH in the accent of the majority of the population.\n\nThese phonemic changes were partly due to the mergers noted above, to the loss of consonant gemination, which had distinguished stops from their fricative allophones in intervocalic position, and the introduction of syllable-initial and non-syllable-initial and in loan words. Spirantization still occurs in verbal and nominal derivation, but now the alternations~,~, and~ are phonemic rather than allophonic.\n\nVowels\n\nThe Hebrew word for vowels is ' (, lit. movements). Hebrew has nine vowel phonemes, five short and four long:\n\nLong vowels occur where two identical vowels were historically separated by a pharyngeal or glottal consonant, and the first was stressed. (Where the second was stressed, the result is a sequence of two short vowels.) They also often occur when morphology brings two identical vowels together, but they are not predictable in that environment.\n\nAny of the five short vowels may be realized as a schwa when far from lexical stress.\n\nThere are two diphthongs, and.\n\nVowel length\n\nIn Biblical Hebrew, each vowel had three forms: short, long and interrupted ('). However, there is no audible distinction between the three in Modern Hebrew, except that is often pronounced as in Ashkenazi Hebrew.\n\nVowel length in Modern Hebrew is environmentally determined and not phonemic, it tends to be affected by the degree of stress, and pretonic lengthening may also occur, mostly in open syllables. When a glottal is lost, a two-vowel sequence arises, and they may be merged into a single long vowel:[http://www.brill.com/downloads/COM-00000450_Vowel%20Length%20Biblical%20Hebrew_981-985.pdf Vowel length in Biblical Hebrew-Modern Hebrew]\n\n*  ('you will work') >\n*  ('watches') > becomes\n\nShva\n\nModern pronunciation does not follow traditional use of the niqqud (diacritic) \"shva\". In Modern Hebrew, words written with a shva may be pronounced with either or without any vowel (or sometimes as an actual schwa), and this does not correspond well to how the word was pronounced historically. For example, the first shva in the word  'you (fem.) crumpled' is pronounced though historically it was silent, whereas the shva in  ('time'), which was pronounced historically, is usually silent. Orthographic shva is generally pronounced in prefixes such as ve- ('and') and be- ('in'), or when following another shva in grammatical patterns, as in ('you [f. sg.] will learn'). An epenthetic appears when necessary to avoid violating a phonological constraint, such as between two consonants that are identical or differ only in voicing (e.g. 'I learned', not) or when an impermissible initial cluster would result (e.g. or, where C stands for any consonant).\n\nAspiration \n\nAspiration is used in the final ה of feminine words to denote genitive case in third-person, being designated by putting a dot (dagesh) in the ה. Normally, it is written with a kamatz in the letter before the ה, for example in the word ּמִטּוּבָה (\"from its goodness\"). When the letter before is a guttural (ר,ח,ה,א), the kamatz is moved under the ה and turns into a patach. This feature is found in many dialects, but in spoken Hebrew it has all but disappeared.\n\nStress\n\nStress is phonemic in Modern Hebrew. There are two frequent patterns of lexical stress, on the last syllable (' מִלְּרַע) and on the penultimate syllable (' מִלְּעֵיל). Final stress has traditionally been more frequent, but in the colloquial language many words are shifting to penultimate stress. Contrary to the prescribed standard, some words exhibit stress on the antepenultimate syllable or even further back. This often occurs in loanwords, e.g.  ('politics'), and sometimes in native colloquial compounds, e.g.  ('somehow').Yaakov Choueka, Rav-Milim: A comprehensive dictionary of Modern Hebrew 1997, CET Colloquial stress has often shifted from the last syllable to the penultimate, e.g.  'hat', normative, colloquial;  ('dovecote'), normative, colloquial. This shift is common in the colloquial pronunciation of many personal names, for example  ('David'), normative, colloquial.Netser, Nisan, Niqqud halakha le-maase, 1976, p. 11.\n\nHistorically, stress was predictable, depending on syllable weight (that is, vowel length and whether a syllable ended with a consonant). Because spoken Israeli Hebrew has lost gemination (a common source of syllable-final consonants) as well as the original distinction between long and short vowels, but the position of the stress often remained where it had been, stress has become phonemic, as the following table illustrates. Phonetically, the following word pairs differ only in the location of the stress; orthographically they differ also in the written representation of vowel length of the vowels (assuming the vowels are even written):\n\nMorphophonology\n\nWhen a vowel falls beyond two syllables from the main stress of a word or phrase, it may be reduced or elided in colloquial Hebrew. For example:\n\n: > ('that is to say')\n\n: > ('what are you called?')\n\nWhen follows an unstressed vowel, it is elided, sometimes with the surrounding vowels:\n\n: > ('your father')\n\n: > ('he will give you')\n\nSyllables drop before except at the end of a prosodic unit:\n\n: > ('usually')\nbut:  ('he is on his way') at the end of a prosodic unit.\n\nSequences of dental stops reduce to a single consonant, again except at the end of a prosodic unit:\n\n: > ('I once studied')\nbut:  ('that I studied')\n\nNotes. Modern Hebrew phonology. http://en.wikipedia.org/?curid=13846."
  }
}
