{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17637",
  "eid" : "2d077580-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778584792,
  "textBody" : "In logic, the law of excluded middle (or the principle of excluded middle) states that for any proposition, either that proposition is true or its negation is true. It is the third of the three classic laws of thought.\n\nThe law is also known as the law (or principle) of the excluded third, in Latin principium tertii exclusi. Another Latin designation for this law is tertium non datur: \"no third [possibility] is given\".\n\nThe earliest known formulation is in Aristotle's discussion of the principle of non-contradiction, first proposed in On Interpretation,Geach p. 74 where he says that of two contradictory propositions (i.e. where one proposition is the negation of the other) one must be true, and the other false.On Interpretation, c. 9  He also states it as a principle in the Metaphysics book 3, saying that it is necessary in every case to affirm or deny,Metaphysics 2, 996b 26–30 and that it is impossible that there should be anything between the two parts of a contradiction.Metaphysics 7, 1011b 26–27 The principle was stated as a theorem of propositional logic by Russell and Whitehead in  Principia Mathematica as:\n\n\\mathbf{*2\\cdot11}. \\ \\  \\vdash . \\ p \\ \\vee \\thicksim p.\n\nThe principle should not be confused with the semantical principle of bivalence, which states that every proposition is either true or false.\n\nClassic laws of thought \n\nThe principle of excluded middle, along with its complement, the law of contradiction (the second of the three classic laws of thought), are correlates of the law of identity (the first of these laws).\n\nAnalogous laws \n\nSome systems of logic have different but analogous laws. For some finite n-valued logics, there is an analogous law called the law of excluded n+1th. If negation is cyclic and \"∨\" is a \"max operator\", then the law can be expressed in the object language by (P ∨ ~P ∨ ~~P ∨ ... ∨ ~...~P), where \"~...~\" represents n−1 negation signs and \"∨ ... ∨\" n−1 disjunction signs. It is easy to check that the sentence must receive at least one of the n truth values (and not a value that is not one of the n).\n\nOther systems reject the law entirely.\n\nExamples \n\nFor example, if P is the proposition:\n\nSocrates is mortal.\n\nthen the law of excluded middle holds that the logical disjunction:\n\nEither Socrates is mortal, or it is not the case that Socrates is mortal.\n\nis true by virtue of its form alone. That is, the \"middle\" position, that Socrates is neither mortal nor not-mortal, is excluded by logic, and therefore either the first possibility (Socrates is mortal) or its negation (it is not the case that Socrates is mortal) must be true.\n\nAn example of an argument that depends on the law of excluded middle follows.This well-known example of a non-constructive proof depending on  the law of excluded middle can be found in many places, for example:  and Davis 2000:220, footnote 2. We seek to prove that there exist two irrational numbers a and b such that\n\na^b is rational.\n\nIt is known that \\sqrt{2} is irrational (see proof). Consider the number\n\n\\sqrt{2}^{\\sqrt{2}}.\n\nClearly (excluded middle) this number is either rational or irrational. If it is rational, the proof is complete, and\na\\sqrt{2} and b\n\\sqrt{2}.\n\nBut if \\sqrt{2}^{\\sqrt{2}} is irrational, then let\n\na\\sqrt{2}^{\\sqrt{2}} and b\n\\sqrt{2}.\n\nThen\n\na^b \\left(\\sqrt{2}^{\\sqrt{2}}\\right)^{\\sqrt{2}} \n \\sqrt{2}^{\\left(\\sqrt{2}\\cdot\\sqrt{2}\\right)} \\sqrt{2}^2 \n 2,\n\nand 2 is certainly rational. This concludes the proof.\n\nIn the above argument, the assertion \"this number is either rational or irrational\" invokes the law of excluded middle. An intuitionist, for example, would not accept this argument without further support for that statement. This might come in the form of a proof that the number in question is in fact irrational (or rational, as the case may be); or a finite algorithm that could determine whether the number is rational.\n\nThe Law in non-constructive proofs over the infinite \n\nThe above proof is an example of a non-constructive proof disallowed by intuitionists:\n is irrational but there is no known easy proof of that fact.) (Davis 2000:220)}} (Constructive proofs of the specific example above are not hard to produce; for example a\\sqrt{2} and b\n\\log_2 9 are both easily shown to be irrational, and a^b=3; a proof allowed by intuitionists).\n\nBy non-constructive Davis means that \"a proof that there actually are mathematic entities satisfying certain conditions would have to provide a method to exhibit explicitly the entities in question.\" (p. 85). Such proofs presume the existence of a totality that is complete, a notion disallowed by intuitionists when extended to the infinite—for them the infinite can never be completed:\n\nIndeed, David Hilbert and Luitzen E. J. Brouwer both give examples of the law of excluded middle extended to the infinite. Hilbert's example: \"the assertion that either there are only finitely many prime numbers or there are infinitely many\" (quoted in Davis 2000:97); and Brouwer's: \"Every mathematical species is either finite or infinite.\" (Brouwer 1923 in van Heijenoort 1967:336).\n\nIn general, intuitionists allow the use of the law of excluded middle when it is confined to discourse over finite collections (sets), but not when it is used in discourse over infinite sets (e.g. the natural numbers). Thus intuitionists absolutely disallow the blanket assertion: \"For all propositions P concerning infinite sets D: P or ~P\" (Kleene 1952:48).\n\nFor more about the conflict between the intuitionists (e.g. Brouwer) and the formalists (Hilbert) see Foundations of mathematics and Intuitionism.\n\nPutative counterexamples to the law of excluded middle include the liar paradox or Quine's Paradox. Certain resolutions of these paradoxes, particularly Graham Priest's dialetheism as formalised in LP, have the law of excluded middle as a theorem, but resolve out the Liar as both true and false. In this way, the law of excluded middle is true, but because truth itself, and therefore disjunction, is not exclusive, it says next to nothing if one of the disjuncts is paradoxical, or both true and false.\n\nHistory \n\nAristotle \n\nAristotle wrote that ambiguity can arise from the use of ambiguous names, but cannot exist in the facts themselves:\n\nAristotle's assertion that \"...it will not be possible to be and not to be the same thing\", which would be written in propositional logic as ¬(P ∧ ¬P), is a statement modern logicians could call the law of excluded middle (P ∨ ¬P), as distribution of the negation of Aristotle's assertion makes them equivalent, regardless that the former claims that no statement is both true and false, while the latter requires that any statement is either true or false.\n\nHowever, Aristotle also writes, \"since it is impossible that contradictories should be at the same time true of the same thing, obviously contraries also cannot belong at the same time to the same thing\" (Book IV, CH 6, p. 531). He then proposes that \"there cannot be an intermediate between contradictories, but of one subject we must either affirm or deny any one predicate\" (Book IV, CH 7, p. 531). In the context of Aristotle's traditional logic, this is a remarkably precise statement of the law of excluded middle, P ∨ ¬P.\n\nLeibniz \n\nBertrand Russell and Principia Mathematica \n\nBertrand Russell asserts a distinction between the \"law of excluded middle\" and the \"law of noncontradiction\". In The Problems of Philosophy, he cites three \"Laws of Thought\" as more or less \"self-evident\"  or \"a priori\" in the sense of Aristotle:\n\n:1. Law of identity: \"Whatever is, is.\"\n:2. Law of noncontradiction: \"Nothing can both be and not be.\"\n:3. Law of excluded middle: \"Everything must either be or not be.\"\n\n:These three laws are samples of self-evident logical principles... (p. 72)\n\nIt is correct, at least for bivalent logic—i.e. it can be seen with a Karnaugh map—that Russell's Law (2) removes \"the middle\" of the inclusive-or used in his law (3). And this is the point of Reichenbach's demonstration that some believe the exclusive-or should take the place of the inclusive-or.\n\nAbout this issue (in admittedly very technical terms) Reichenbach observes:\n\n:The tertium non datur\n:29. (x)[f(x) ∨ ~f(x)]\n:is not exhaustive in its major terms and is therefore an inflated formula. This fact may perhaps explain why some people consider it unreasonable to write (29) with the inclusive-'or', and want to have it written with the sign of the exclusive-'or'\n\n:30. (x)[f(x) ⊕ ~f(x)],  where the symbol \"⊕\" signifies exclusive-orThe original symbol as used by Reichenbach is an upside down V, nowadays used for AND. The AND for Reichenbach is the same as that used in Principia Mathematica -- a \"dot\" cf p. 27 where he shows a truth table where he defines \"a.b\". Reichenbach defines the exclusive-or on p. 35 as \"the negation of the equivalence\". One sign used nowadays is a circle with a + in it, i.e. ⊕ (because in binary, a ⊕ b yields modulo-2 addition -- addition without carry). Other signs are ≢ (not identical to), or ≠ (not equal to).\n:in which form it would be fully exhaustive and therefore nomological in the narrower sense. (Reichenbach, p. 376)\n\nIn line (30) the \"(x)\" means \"for all\" or \"for every\", a form used by Russell and Reichenbach; today the symbolism is usually \\forall x. Thus an example of the expression would look like this:\n\n* (pig): (Flies(pig) ⊕ ~Flies(pig))\n* (For all instances of \"pig\" seen and unseen): (\"Pig does fly\" or \"Pig does not fly\" but not both simultaneously)\n\nA formal definition from Principia Mathematica \n\nPrincipia Mathematica (PM) defines the law of excluded middle formally:\n\nSo just what is \"truth\" and \"falsehood\"? At the opening PM quickly announces some definitions:\n\nThis is not much help. But later, in a much deeper discussion, (\"Definition and systematic ambiguity of Truth and Falsehood\" Chapter II part III, p. 41 ff ) PM defines truth and falsehood in terms of a relationship between the \"a\" and the \"b\" and the \"percipient\". For example \"This 'a' is 'b'\" (e.g. \"This 'object a' is 'red'\") really means \"'object a' is a sense-datum\" and \"'red' is a sense-datum\", and they \"stand in relation\" to one another and in relation to \"I\". Thus what we really mean is: \"I perceive that 'This object a is red'\" and this is an undeniable-by-3rd-party \"truth\".\n\nPM further defines a distinction between a \"sense-datum\" and a \"sensation\":\n\nRussell reiterated his distinction between \"sense-datum\" and \"sensation\" in his book The Problems of Philosophy (1912) published at the same time as PM (1910–1913):\n\nRussell further described his reasoning behind his definitions of \"truth\" and \"falsehood\" in the same book (Chapter XII Truth and Falsehood).\n\nConsequences of the law of excluded middle in Principia Mathematica \n\nFrom the law of excluded middle, formula ✸2.1 in Principia Mathematica, Whitehead and Russell derive some of the most powerful tools in the logician's argumentation toolkit. (In Principia Mathematica, formulas and propositions are identified by a leading asterisk and two numbers, such as \"✸2.1\".)\n\n✸2.1 ~p ∨ p \"This is the Law of excluded middle\" (PM, p. 101).\n\nThe proof of ✸2.1 is roughly as follows: \"primitive idea\" 1.08 defines p → q ~p ∨ q. Substituting p for q in this rule yields p → p \n ~p ∨ p. Since p → p is true (this is Theorem 2.08, which is proved separately), then ~p ∨ p must be true.\n\n✸2.11 p ∨ ~p (Permutation of the assertions is allowed by axiom 1.4)\n✸2.12 p → ~(~p) (Principle of double negation, part 1: if \"this rose is red\" is true then it's not true that \"'this rose is not-red' is true\".)\n✸2.13 p ∨ ~{~(~p)} (Lemma together with 2.12 used to derive 2.14)\n✸2.14 ~(~p) → p (Principle of double negation, part 2)\n✸2.15 (~p → q) → (~q → p) (One of the four \"Principles of transposition\". Similar to 1.03, 1.16 and 1.17. A very long demonstration was required here.)\n✸2.16 (p → q) → (~q → ~p) (If it's true that \"If this rose is red then this pig flies\" then it's true that \"If this pig doesn't fly then this rose isn't red.\")\n✸2.17 ( ~p → ~q ) → (q → p) (Another of the \"Principles of transposition\".)\n✸2.18 (~p → p) → p (Called \"The complement of reductio ad absurdum. It states that a proposition which follows from the hypothesis of its own falsehood is true\" (PM, pp. 103–104).)\n\nMost of these theorems—in particular ✸2.1, ✸2.11, and ✸2.14—are rejected by intuitionism. These tools are recast into another form that Kolmogorov cites as \"Hilbert's four axioms of implication\" and \"Hilbert's two axioms of negation\" (Kolmogorov in van Heijenoort, p. 335).\n\nPropositions ✸2.12 and ✸2.14, \"double negation\":\nThe intuitionist writings of L. E. J. Brouwer refer to what he calls \"the principle of the reciprocity of the multiple species, that is, the principle that for every system the correctness of a property follows from the impossibility of the impossibility of this property\" (Brouwer, ibid, p. 335).\n\nThis principle is commonly called \"the principle of double negation\" (PM, pp. 101–102). From the law of excluded middle (✸2.1 and ✸2.11), PM derives principle ✸2.12 immediately. We substitute ~p for p in 2.11 to yield ~p ∨ ~(~p), and by the definition of implication (i.e. 1.01 p → q ~p ∨ q) then ~p ∨ ~(~p)\n p → ~(~p). QED (The derivation of 2.14 is a bit more involved.)\n\nCriticisms \n\nMany modern logic systems replace the law of excluded middle with the concept of negation as failure. Instead of a proposition either being true or false, a proposition is either true or not able to be proven true. These two dichotomies only differ in logical systems that are not complete. The principle of negation as failure is used as a foundation for autoepistemic logic, and is widely used in logic programming. In these systems, the programmer is free to assert the law of excluded middle as a true fact, but it is not built-in a priori into these systems.\n\nMathematicians such as L. E. J. Brouwer and Arend Heyting have also contested the usefulness of the law of excluded middle in the context of modern mathematics.\n[https://books.google.com/books?iduUC30fqhdlAC&pg\nPA138 \"Proof and Knowledge in Mathematics\" by Michael Detlefsen]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Law of excluded middle" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17637" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In logic, the law of excluded middle (or the principle of excluded middle) states that for any proposition, either that proposition is true or its negation is true. It is the third of the three classic laws of thought.\n\nThe law is also known as the law (or principle) of the excluded third, in Latin principium tertii exclusi. Another Latin designation for this law is tertium non datur: \"no third [possibility] is given\".\n\nThe earliest known formulation is in Aristotle's discussion of the principle of non-contradiction, first proposed in On Interpretation,Geach p. 74 where he says that of two contradictory propositions (i.e. where one proposition is the negation of the other) one must be true, and the other false.On Interpretation, c. 9  He also states it as a principle in the Metaphysics book 3, saying that it is necessary in every case to affirm or deny,Metaphysics 2, 996b 26–30 and that it is impossible that there should be anything between the two parts of a contradiction.Metaphysics 7, 1011b 26–27 The principle was stated as a theorem of propositional logic by Russell and Whitehead in  Principia Mathematica as:\n\n\\mathbf{*2\\cdot11}. \\ \\  \\vdash . \\ p \\ \\vee \\thicksim p.\n\nThe principle should not be confused with the semantical principle of bivalence, which states that every proposition is either true or false.\n\nClassic laws of thought \n\nThe principle of excluded middle, along with its complement, the law of contradiction (the second of the three classic laws of thought), are correlates of the law of identity (the first of these laws).\n\nAnalogous laws \n\nSome systems of logic have different but analogous laws. For some finite n-valued logics, there is an analogous law called the law of excluded n+1th. If negation is cyclic and \"∨\" is a \"max operator\", then the law can be expressed in the object language by (P ∨ ~P ∨ ~~P ∨ ... ∨ ~...~P), where \"~...~\" represents n−1 negation signs and \"∨ ... ∨\" n−1 disjunction signs. It is easy to check that the sentence must receive at least one of the n truth values (and not a value that is not one of the n).\n\nOther systems reject the law entirely.\n\nExamples \n\nFor example, if P is the proposition:\n\nSocrates is mortal.\n\nthen the law of excluded middle holds that the logical disjunction:\n\nEither Socrates is mortal, or it is not the case that Socrates is mortal.\n\nis true by virtue of its form alone. That is, the \"middle\" position, that Socrates is neither mortal nor not-mortal, is excluded by logic, and therefore either the first possibility (Socrates is mortal) or its negation (it is not the case that Socrates is mortal) must be true.\n\nAn example of an argument that depends on the law of excluded middle follows.This well-known example of a non-constructive proof depending on  the law of excluded middle can be found in many places, for example:  and Davis 2000:220, footnote 2. We seek to prove that there exist two irrational numbers a and b such that\n\na^b is rational.\n\nIt is known that \\sqrt{2} is irrational (see proof). Consider the number\n\n\\sqrt{2}^{\\sqrt{2}}.\n\nClearly (excluded middle) this number is either rational or irrational. If it is rational, the proof is complete, and\na\\sqrt{2} and b\n\\sqrt{2}.\n\nBut if \\sqrt{2}^{\\sqrt{2}} is irrational, then let\n\na\\sqrt{2}^{\\sqrt{2}} and b\n\\sqrt{2}.\n\nThen\n\na^b \\left(\\sqrt{2}^{\\sqrt{2}}\\right)^{\\sqrt{2}} \n \\sqrt{2}^{\\left(\\sqrt{2}\\cdot\\sqrt{2}\\right)} \\sqrt{2}^2 \n 2,\n\nand 2 is certainly rational. This concludes the proof.\n\nIn the above argument, the assertion \"this number is either rational or irrational\" invokes the law of excluded middle. An intuitionist, for example, would not accept this argument without further support for that statement. This might come in the form of a proof that the number in question is in fact irrational (or rational, as the case may be); or a finite algorithm that could determine whether the number is rational.\n\nThe Law in non-constructive proofs over the infinite \n\nThe above proof is an example of a non-constructive proof disallowed by intuitionists:\n is irrational but there is no known easy proof of that fact.) (Davis 2000:220)}} (Constructive proofs of the specific example above are not hard to produce; for example a\\sqrt{2} and b\n\\log_2 9 are both easily shown to be irrational, and a^b=3; a proof allowed by intuitionists).\n\nBy non-constructive Davis means that \"a proof that there actually are mathematic entities satisfying certain conditions would have to provide a method to exhibit explicitly the entities in question.\" (p. 85). Such proofs presume the existence of a totality that is complete, a notion disallowed by intuitionists when extended to the infinite—for them the infinite can never be completed:\n\nIndeed, David Hilbert and Luitzen E. J. Brouwer both give examples of the law of excluded middle extended to the infinite. Hilbert's example: \"the assertion that either there are only finitely many prime numbers or there are infinitely many\" (quoted in Davis 2000:97); and Brouwer's: \"Every mathematical species is either finite or infinite.\" (Brouwer 1923 in van Heijenoort 1967:336).\n\nIn general, intuitionists allow the use of the law of excluded middle when it is confined to discourse over finite collections (sets), but not when it is used in discourse over infinite sets (e.g. the natural numbers). Thus intuitionists absolutely disallow the blanket assertion: \"For all propositions P concerning infinite sets D: P or ~P\" (Kleene 1952:48).\n\nFor more about the conflict between the intuitionists (e.g. Brouwer) and the formalists (Hilbert) see Foundations of mathematics and Intuitionism.\n\nPutative counterexamples to the law of excluded middle include the liar paradox or Quine's Paradox. Certain resolutions of these paradoxes, particularly Graham Priest's dialetheism as formalised in LP, have the law of excluded middle as a theorem, but resolve out the Liar as both true and false. In this way, the law of excluded middle is true, but because truth itself, and therefore disjunction, is not exclusive, it says next to nothing if one of the disjuncts is paradoxical, or both true and false.\n\nHistory \n\nAristotle \n\nAristotle wrote that ambiguity can arise from the use of ambiguous names, but cannot exist in the facts themselves:\n\nAristotle's assertion that \"...it will not be possible to be and not to be the same thing\", which would be written in propositional logic as ¬(P ∧ ¬P), is a statement modern logicians could call the law of excluded middle (P ∨ ¬P), as distribution of the negation of Aristotle's assertion makes them equivalent, regardless that the former claims that no statement is both true and false, while the latter requires that any statement is either true or false.\n\nHowever, Aristotle also writes, \"since it is impossible that contradictories should be at the same time true of the same thing, obviously contraries also cannot belong at the same time to the same thing\" (Book IV, CH 6, p. 531). He then proposes that \"there cannot be an intermediate between contradictories, but of one subject we must either affirm or deny any one predicate\" (Book IV, CH 7, p. 531). In the context of Aristotle's traditional logic, this is a remarkably precise statement of the law of excluded middle, P ∨ ¬P.\n\nLeibniz \n\nBertrand Russell and Principia Mathematica \n\nBertrand Russell asserts a distinction between the \"law of excluded middle\" and the \"law of noncontradiction\". In The Problems of Philosophy, he cites three \"Laws of Thought\" as more or less \"self-evident\"  or \"a priori\" in the sense of Aristotle:\n\n:1. Law of identity: \"Whatever is, is.\"\n:2. Law of noncontradiction: \"Nothing can both be and not be.\"\n:3. Law of excluded middle: \"Everything must either be or not be.\"\n\n:These three laws are samples of self-evident logical principles... (p. 72)\n\nIt is correct, at least for bivalent logic—i.e. it can be seen with a Karnaugh map—that Russell's Law (2) removes \"the middle\" of the inclusive-or used in his law (3). And this is the point of Reichenbach's demonstration that some believe the exclusive-or should take the place of the inclusive-or.\n\nAbout this issue (in admittedly very technical terms) Reichenbach observes:\n\n:The tertium non datur\n:29. (x)[f(x) ∨ ~f(x)]\n:is not exhaustive in its major terms and is therefore an inflated formula. This fact may perhaps explain why some people consider it unreasonable to write (29) with the inclusive-'or', and want to have it written with the sign of the exclusive-'or'\n\n:30. (x)[f(x) ⊕ ~f(x)],  where the symbol \"⊕\" signifies exclusive-orThe original symbol as used by Reichenbach is an upside down V, nowadays used for AND. The AND for Reichenbach is the same as that used in Principia Mathematica -- a \"dot\" cf p. 27 where he shows a truth table where he defines \"a.b\". Reichenbach defines the exclusive-or on p. 35 as \"the negation of the equivalence\". One sign used nowadays is a circle with a + in it, i.e. ⊕ (because in binary, a ⊕ b yields modulo-2 addition -- addition without carry). Other signs are ≢ (not identical to), or ≠ (not equal to).\n:in which form it would be fully exhaustive and therefore nomological in the narrower sense. (Reichenbach, p. 376)\n\nIn line (30) the \"(x)\" means \"for all\" or \"for every\", a form used by Russell and Reichenbach; today the symbolism is usually \\forall x. Thus an example of the expression would look like this:\n\n* (pig): (Flies(pig) ⊕ ~Flies(pig))\n* (For all instances of \"pig\" seen and unseen): (\"Pig does fly\" or \"Pig does not fly\" but not both simultaneously)\n\nA formal definition from Principia Mathematica \n\nPrincipia Mathematica (PM) defines the law of excluded middle formally:\n\nSo just what is \"truth\" and \"falsehood\"? At the opening PM quickly announces some definitions:\n\nThis is not much help. But later, in a much deeper discussion, (\"Definition and systematic ambiguity of Truth and Falsehood\" Chapter II part III, p. 41 ff ) PM defines truth and falsehood in terms of a relationship between the \"a\" and the \"b\" and the \"percipient\". For example \"This 'a' is 'b'\" (e.g. \"This 'object a' is 'red'\") really means \"'object a' is a sense-datum\" and \"'red' is a sense-datum\", and they \"stand in relation\" to one another and in relation to \"I\". Thus what we really mean is: \"I perceive that 'This object a is red'\" and this is an undeniable-by-3rd-party \"truth\".\n\nPM further defines a distinction between a \"sense-datum\" and a \"sensation\":\n\nRussell reiterated his distinction between \"sense-datum\" and \"sensation\" in his book The Problems of Philosophy (1912) published at the same time as PM (1910–1913):\n\nRussell further described his reasoning behind his definitions of \"truth\" and \"falsehood\" in the same book (Chapter XII Truth and Falsehood).\n\nConsequences of the law of excluded middle in Principia Mathematica \n\nFrom the law of excluded middle, formula ✸2.1 in Principia Mathematica, Whitehead and Russell derive some of the most powerful tools in the logician's argumentation toolkit. (In Principia Mathematica, formulas and propositions are identified by a leading asterisk and two numbers, such as \"✸2.1\".)\n\n✸2.1 ~p ∨ p \"This is the Law of excluded middle\" (PM, p. 101).\n\nThe proof of ✸2.1 is roughly as follows: \"primitive idea\" 1.08 defines p → q ~p ∨ q. Substituting p for q in this rule yields p → p \n ~p ∨ p. Since p → p is true (this is Theorem 2.08, which is proved separately), then ~p ∨ p must be true.\n\n✸2.11 p ∨ ~p (Permutation of the assertions is allowed by axiom 1.4)\n✸2.12 p → ~(~p) (Principle of double negation, part 1: if \"this rose is red\" is true then it's not true that \"'this rose is not-red' is true\".)\n✸2.13 p ∨ ~{~(~p)} (Lemma together with 2.12 used to derive 2.14)\n✸2.14 ~(~p) → p (Principle of double negation, part 2)\n✸2.15 (~p → q) → (~q → p) (One of the four \"Principles of transposition\". Similar to 1.03, 1.16 and 1.17. A very long demonstration was required here.)\n✸2.16 (p → q) → (~q → ~p) (If it's true that \"If this rose is red then this pig flies\" then it's true that \"If this pig doesn't fly then this rose isn't red.\")\n✸2.17 ( ~p → ~q ) → (q → p) (Another of the \"Principles of transposition\".)\n✸2.18 (~p → p) → p (Called \"The complement of reductio ad absurdum. It states that a proposition which follows from the hypothesis of its own falsehood is true\" (PM, pp. 103–104).)\n\nMost of these theorems—in particular ✸2.1, ✸2.11, and ✸2.14—are rejected by intuitionism. These tools are recast into another form that Kolmogorov cites as \"Hilbert's four axioms of implication\" and \"Hilbert's two axioms of negation\" (Kolmogorov in van Heijenoort, p. 335).\n\nPropositions ✸2.12 and ✸2.14, \"double negation\":\nThe intuitionist writings of L. E. J. Brouwer refer to what he calls \"the principle of the reciprocity of the multiple species, that is, the principle that for every system the correctness of a property follows from the impossibility of the impossibility of this property\" (Brouwer, ibid, p. 335).\n\nThis principle is commonly called \"the principle of double negation\" (PM, pp. 101–102). From the law of excluded middle (✸2.1 and ✸2.11), PM derives principle ✸2.12 immediately. We substitute ~p for p in 2.11 to yield ~p ∨ ~(~p), and by the definition of implication (i.e. 1.01 p → q ~p ∨ q) then ~p ∨ ~(~p)\n p → ~(~p). QED (The derivation of 2.14 is a bit more involved.)\n\nCriticisms \n\nMany modern logic systems replace the law of excluded middle with the concept of negation as failure. Instead of a proposition either being true or false, a proposition is either true or not able to be proven true. These two dichotomies only differ in logical systems that are not complete. The principle of negation as failure is used as a foundation for autoepistemic logic, and is widely used in logic programming. In these systems, the programmer is free to assert the law of excluded middle as a true fact, but it is not built-in a priori into these systems.\n\nMathematicians such as L. E. J. Brouwer and Arend Heyting have also contested the usefulness of the law of excluded middle in the context of modern mathematics.\n[https://books.google.com/books?iduUC30fqhdlAC&pg\nPA138 \"Proof and Knowledge in Mathematics\" by Michael Detlefsen]. Law of excluded middle. http://en.wikipedia.org/?curid=17637."
  }
}
