{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17479",
  "eid" : "2c3e5920-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778583474,
  "textBody" : "A lynx (; plural lynx or lynxes) is any of the four species within the Lynx genus of medium-sized wild cats, which includes the bobcat. The name \"lynx\" originated in Middle English via Latin from the Greek word λύγξ, derived from the Indo-European root leuk- (\"light, brightness\") in reference to the luminescence of its reflective eyes.\n\nThe genus Lynx includes neither the caracal nor the jungle cat, sometimes called the desert lynx and the jungle lynx respectively.\n\nAppearance \n\nLynx have a short tail, characteristic tufts of black hair on the tips of their ears, large, padded paws for walking on snow and long whiskers on the face. Under their neck, they have a ruff which has black bars resembling a bow tie although this is often not visible.\n\nBody colour varies from medium brown to goldish to beige-white, and is occasionally marked with dark brown spots, especially on the limbs. All species of lynx have white fur on their chests, bellies and on the insides of their legs, fur which is an extension of the chest and belly fur. The lynx's colouring, fur length and paw size vary according to the climate in their range.  In the Southwestern United States, they are short-haired, dark in colour and their paws are smaller and less padded. As climates get colder and more northerly, lynx have progressively thicker fur, lighter colour, and their paws are larger and more padded to adapt to the snow. Their paws may be larger than a human hand or foot.\n\nThe smallest species are the bobcat and the Canada lynx, while the largest is the Eurasian lynx, with considerable variations within species.\n\nSpecies \n\nThe four living species of the Lynx genus are believed to have evolved from the \"Issoire lynx\", which lived in Europe and Africa during the late Pliocene to early Pleistocene. The Pliocene felid Felis rexroadensis from North America has been proposed as an even earlier ancestor; however, this was larger than any living species, and is not currently classified as a true lynx.\n\nEurasian lynx \n\nOf the four lynx species, the Eurasian lynx (Lynx lynx) is the largest in size. It is native to European, Central Asian, and Siberian forests. While its conservation status has been classified as \"least concern\", populations of Eurasian lynx have been reduced or extirpated from Europe, where it is now being reintroduced.\n\nThe Eurasian lynx is the third largest predator in Europe after the brown bear and the grey wolf. It is a strict carnivore, consuming about one or two kilograms of meat every day.  The Eurasian lynx is one of the widest-ranging.\n\nDuring the summer, the Eurasian lynx has a relatively short, reddish or brown coat which is replaced by a much thicker silver-grey to greyish-brown coat during winter. The lynx hunts by stalking and jumping its prey, helped by the rugged, forested country in which it resides. A favorite prey for the lynx in its woodland habitat is roe deer. It will feed however on whatever animal appears easiest, as it is an opportunistic predator much like its cousins.\n\nCanada lynx \n\nThe Canada lynx (Lynx canadensis), or Canadian lynx, is a North American felid that ranges in forest and tundra regions across Canada and into Alaska, as well as some parts of the northern United States.  Historically, the Canadian lynx ranged from Alaska across Canada and into many of the northern U.S. states.  In the eastern states, it resided in the transition zone in which boreal coniferous forests yielded to deciduous forests. By 2010, after an 11-year effort, it had been successfully reintroduced into Colorado, where it had become extirpated in the 1970s.• •  In 2000, the U.S. Fish and Wildlife Service designated the Canada lynx a threatened species in the lower 48 states.\n\nThe Canada lynx is a good climber and swimmer; it constructs rough shelters under fallen trees or rock ledges. It has a thick coat and broad paws, and is twice as effective as the bobcat at supporting its weight on the snow. The Canada lynx feeds almost exclusively on snowshoe hares; its population is highly dependent on the population of this prey animal. It will also hunt medium-sized mammals and birds if hare numbers fall.\n\nIberian lynx \n\nThe Iberian lynx (Lynx pardinus) is a endangered species native to the Iberian Peninsula in Southern Europe. It was the most endangered cat species in the world, but conservation efforts have changed its status from critical to endangered. According to the Portuguese conservation group SOS Lynx, if this species dies out, it will be the first feline extinction since the Smilodon 10,000 years ago. The species used to be classified as a subspecies of the Eurasian lynx, but is now considered a separate species. Both species occurred together in central Europe in the Pleistocene epoch, being separated by habitat choice. The Iberian lynx is believed to have evolved from Lynx issiodorensis.\n\nConservation efforts \n\nIn 2004, a Spanish government survey showed just two isolated breeding populations of Iberian lynx in southern Spain, totaling about 100 lynx (including only 25 breeding females).[http://wwf.panda.org/wwf_news/?19458/First-captive-bred-birth-of-Iberian-lynx First captive-bred birth of Iberian lynx], World Wide Fund for Nature (March 30, 2005). An agreement signed in 2003 by the Spanish Environment Ministry and the Andalusian Environment Council seeks to breed the Iberian lynx in captivity. Three Iberian lynx cubs were born as part of the Spanish program in 2005, at the Centro El Acebuche facility in Doñana National Park.\n\nAs a result of the Spanish government program and efforts by others (such as the WWF and the EU's Life projects), the Iberian lynx \"has recovered from the brink of extinction\";[http://wwf.panda.org/about_our_earth/species/profiles/mammals/iberian_lynx/ Species Profiles: Mammals: Iberian lynx] World Wide Fund for Nature (accessed March 21, 2015). from 2000 to 2015, the population of Iberian lynx more than tripled.[https://www.reuters.com/article/us-spain-lynx-idUSKBN0NK1ZT20150429 Two Iberian lynx cubs born in Spanish reintroduction program], Reuters (Apr 29, 2015).  The IUCN reassessed the species from \"critically endangered\" to \"endangered\" in 2015. A 2014 census of the species showed 327 animals in Andalucia in the \"reintroduction areas\" of Sierra Morena and Montes de Toledo (Castilla-La Mancha, Spain), the Matachel Valley (Extremadura, Spain), and the Guadiana Valley (Portugal).\n\nBobcat \n\nThe bobcat (Lynx rufus) is a North American wild cat. With 12 recognized subspecies, the bobcat is common throughout southern Canada, the continental United States, and northern Mexico. The bobcat is an adaptable predator that inhabits deciduous, coniferous, or mixed woodlands, but unlike other Lynx, does not depend exclusively on the deep forest, and ranges from swamps and desert lands to mountainous and agricultural areas, its spotted coat serving as camouflage. The population of the bobcat depends primarily on the population of its prey. Nonetheless, the bobcat is often killed by larger predators such as coyotes.Fedriani, J. M., T. K. Fuller, R. M. Sauvajot and E. C. York. 2000. Competition and intraguild predation among three sympatric carnivores. Oecologia, 125:258–270.\n\nThe bobcat resembles other species of the Lynx genus, but is on average the smallest of the four. Its coat is variable, though generally tan to grayish brown, with black streaks on the body and dark bars on the forelegs and tail. The ears are black-tipped and pointed, with short, black tufts. There is generally an off-white color on the lips, chin, and underparts. Bobcats in the desert regions of the southwest have the lightest-colored coats, while those in the northern, forested regions have the darkest.\n\nBehavior and diet \n\nThe lynx is usually solitary, although a small group of lynx may travel and hunt together occasionally. Mating takes place in the late winter and once a year the female gives birth to between one and four kittens. The gestation time of the lynx is about 70 days. The young stay with the mother for one more winter, a total of around nine months, before moving out to live on their own as young adults. The lynx creates its den in crevices or under ledges. It feeds on a wide range of animals from white-tailed deer, reindeer, roe deer, small red deer, and chamois, to smaller, more usual prey: snowshoe hares, fish, foxes, sheep, squirrels, mice, turkeys and other birds, and goats. It also eats ptarmigans, voles, and grouse.\n\nDistribution and habitat \n\nThe lynx inhabits high altitude forests with dense cover of shrubs, reeds, and tall grass. Although this cat hunts on the ground, it can climb trees and can swim swiftly, catching fish.\n\nEurope and Asia \n\nThe Eurasian lynx ranges from central and northern Europe across Asia up to Northern Pakistan and India. In Iran, they live in Mount Damavand area.\"Iran Environmental and Wild life Watch\" http://www.iew.ir/1392/10/21/20008 Since the beginning of the 20th century, the Eurasian lynx was considered extinct in the wild in Slovenia and Croatia. A resettlement project, begun in 1973, has successfully reintroduced lynx to the Slovenian Alps and the Croatian regions of Gorski Kotar and Velebit, including Croatia's Plitvice Lakes National Park and Risnjak National Park. In both countries, the lynx is listed as an endangered species and protected by law. It became extinct due to human activities during Jōmon period in Japan.Hasegawa Y.. Kaneko H.. Tachibana M.. Tanaka G.. 2011. A study of the extinct Japanese Lynx from the Late Pleistocene to the Early Holocene.. Bulletin of Gunma Museum of Natural History 15. pp.43-80. . Gunma Museum of Natural History\n\nSeveral lynx resettlement projects begun in the 1970s have been successful in various regions of Switzerland. Since the 1990s, there have been numerous efforts to resettle the Eurasian lynx in Germany, and since  2000, a small population can now be found in the Harz mountains near Bad Lauterberg.\n\nThe lynx is found in the Białowieża Forest in northeastern Poland, in Estonia and in the northern and western parts of China, particularly the Tibetan Plateau. In Romania, the numbers exceed 2,000, the largest population in Europe outside of Russia, although most experts consider the official population numbers to be overestimated.\n\nThe lynx is more common in northern Europe, especially in Norway, Sweden, Estonia, Finland, and the northern parts of Russia. The Swedish population is estimated to be 1200–1500 individuals, spread all over the country, but more common in middle Sweden and in the mountain range. The lynx population in Finland was 1900–2100 individuals in 2008, and the numbers have been increasing every year since 1992. The lynx population in Finland is estimated currently to be larger than ever before. Lynx in Britain were wiped out in the 17th century, but there have been calls to reintroduce them to curb the numbers of deer.\n\nThe critically endangered Iberian lynx lives in southern Spain and formerly in eastern Portugal. There is an Iberian lynx reproduction center outside Silves in the Algarve in southern Portugal.\n\nNorth America \n\nThe two Lynx species in North America, Canada lynx and bobcats, are both found in the temperate zone. While the bobcat is common throughout southern Canada, the continental United States and northern Mexico, the Canada lynx is present mainly in boreal forests of Canada and Alaska.\n\nNational animal \n\nThe lynx is considered a national animal in the Republic of Macedonia and is displayed on the reverse of the 5 denar coin.\nIt is also the national animal of Romania.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lynx" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17479" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A lynx (; plural lynx or lynxes) is any of the four species within the Lynx genus of medium-sized wild cats, which includes the bobcat. The name \"lynx\" originated in Middle English via Latin from the Greek word λύγξ, derived from the Indo-European root leuk- (\"light, brightness\") in reference to the luminescence of its reflective eyes.\n\nThe genus Lynx includes neither the caracal nor the jungle cat, sometimes called the desert lynx and the jungle lynx respectively.\n\nAppearance \n\nLynx have a short tail, characteristic tufts of black hair on the tips of their ears, large, padded paws for walking on snow and long whiskers on the face. Under their neck, they have a ruff which has black bars resembling a bow tie although this is often not visible.\n\nBody colour varies from medium brown to goldish to beige-white, and is occasionally marked with dark brown spots, especially on the limbs. All species of lynx have white fur on their chests, bellies and on the insides of their legs, fur which is an extension of the chest and belly fur. The lynx's colouring, fur length and paw size vary according to the climate in their range.  In the Southwestern United States, they are short-haired, dark in colour and their paws are smaller and less padded. As climates get colder and more northerly, lynx have progressively thicker fur, lighter colour, and their paws are larger and more padded to adapt to the snow. Their paws may be larger than a human hand or foot.\n\nThe smallest species are the bobcat and the Canada lynx, while the largest is the Eurasian lynx, with considerable variations within species.\n\nSpecies \n\nThe four living species of the Lynx genus are believed to have evolved from the \"Issoire lynx\", which lived in Europe and Africa during the late Pliocene to early Pleistocene. The Pliocene felid Felis rexroadensis from North America has been proposed as an even earlier ancestor; however, this was larger than any living species, and is not currently classified as a true lynx.\n\nEurasian lynx \n\nOf the four lynx species, the Eurasian lynx (Lynx lynx) is the largest in size. It is native to European, Central Asian, and Siberian forests. While its conservation status has been classified as \"least concern\", populations of Eurasian lynx have been reduced or extirpated from Europe, where it is now being reintroduced.\n\nThe Eurasian lynx is the third largest predator in Europe after the brown bear and the grey wolf. It is a strict carnivore, consuming about one or two kilograms of meat every day.  The Eurasian lynx is one of the widest-ranging.\n\nDuring the summer, the Eurasian lynx has a relatively short, reddish or brown coat which is replaced by a much thicker silver-grey to greyish-brown coat during winter. The lynx hunts by stalking and jumping its prey, helped by the rugged, forested country in which it resides. A favorite prey for the lynx in its woodland habitat is roe deer. It will feed however on whatever animal appears easiest, as it is an opportunistic predator much like its cousins.\n\nCanada lynx \n\nThe Canada lynx (Lynx canadensis), or Canadian lynx, is a North American felid that ranges in forest and tundra regions across Canada and into Alaska, as well as some parts of the northern United States.  Historically, the Canadian lynx ranged from Alaska across Canada and into many of the northern U.S. states.  In the eastern states, it resided in the transition zone in which boreal coniferous forests yielded to deciduous forests. By 2010, after an 11-year effort, it had been successfully reintroduced into Colorado, where it had become extirpated in the 1970s.• •  In 2000, the U.S. Fish and Wildlife Service designated the Canada lynx a threatened species in the lower 48 states.\n\nThe Canada lynx is a good climber and swimmer; it constructs rough shelters under fallen trees or rock ledges. It has a thick coat and broad paws, and is twice as effective as the bobcat at supporting its weight on the snow. The Canada lynx feeds almost exclusively on snowshoe hares; its population is highly dependent on the population of this prey animal. It will also hunt medium-sized mammals and birds if hare numbers fall.\n\nIberian lynx \n\nThe Iberian lynx (Lynx pardinus) is a endangered species native to the Iberian Peninsula in Southern Europe. It was the most endangered cat species in the world, but conservation efforts have changed its status from critical to endangered. According to the Portuguese conservation group SOS Lynx, if this species dies out, it will be the first feline extinction since the Smilodon 10,000 years ago. The species used to be classified as a subspecies of the Eurasian lynx, but is now considered a separate species. Both species occurred together in central Europe in the Pleistocene epoch, being separated by habitat choice. The Iberian lynx is believed to have evolved from Lynx issiodorensis.\n\nConservation efforts \n\nIn 2004, a Spanish government survey showed just two isolated breeding populations of Iberian lynx in southern Spain, totaling about 100 lynx (including only 25 breeding females).[http://wwf.panda.org/wwf_news/?19458/First-captive-bred-birth-of-Iberian-lynx First captive-bred birth of Iberian lynx], World Wide Fund for Nature (March 30, 2005). An agreement signed in 2003 by the Spanish Environment Ministry and the Andalusian Environment Council seeks to breed the Iberian lynx in captivity. Three Iberian lynx cubs were born as part of the Spanish program in 2005, at the Centro El Acebuche facility in Doñana National Park.\n\nAs a result of the Spanish government program and efforts by others (such as the WWF and the EU's Life projects), the Iberian lynx \"has recovered from the brink of extinction\";[http://wwf.panda.org/about_our_earth/species/profiles/mammals/iberian_lynx/ Species Profiles: Mammals: Iberian lynx] World Wide Fund for Nature (accessed March 21, 2015). from 2000 to 2015, the population of Iberian lynx more than tripled.[https://www.reuters.com/article/us-spain-lynx-idUSKBN0NK1ZT20150429 Two Iberian lynx cubs born in Spanish reintroduction program], Reuters (Apr 29, 2015).  The IUCN reassessed the species from \"critically endangered\" to \"endangered\" in 2015. A 2014 census of the species showed 327 animals in Andalucia in the \"reintroduction areas\" of Sierra Morena and Montes de Toledo (Castilla-La Mancha, Spain), the Matachel Valley (Extremadura, Spain), and the Guadiana Valley (Portugal).\n\nBobcat \n\nThe bobcat (Lynx rufus) is a North American wild cat. With 12 recognized subspecies, the bobcat is common throughout southern Canada, the continental United States, and northern Mexico. The bobcat is an adaptable predator that inhabits deciduous, coniferous, or mixed woodlands, but unlike other Lynx, does not depend exclusively on the deep forest, and ranges from swamps and desert lands to mountainous and agricultural areas, its spotted coat serving as camouflage. The population of the bobcat depends primarily on the population of its prey. Nonetheless, the bobcat is often killed by larger predators such as coyotes.Fedriani, J. M., T. K. Fuller, R. M. Sauvajot and E. C. York. 2000. Competition and intraguild predation among three sympatric carnivores. Oecologia, 125:258–270.\n\nThe bobcat resembles other species of the Lynx genus, but is on average the smallest of the four. Its coat is variable, though generally tan to grayish brown, with black streaks on the body and dark bars on the forelegs and tail. The ears are black-tipped and pointed, with short, black tufts. There is generally an off-white color on the lips, chin, and underparts. Bobcats in the desert regions of the southwest have the lightest-colored coats, while those in the northern, forested regions have the darkest.\n\nBehavior and diet \n\nThe lynx is usually solitary, although a small group of lynx may travel and hunt together occasionally. Mating takes place in the late winter and once a year the female gives birth to between one and four kittens. The gestation time of the lynx is about 70 days. The young stay with the mother for one more winter, a total of around nine months, before moving out to live on their own as young adults. The lynx creates its den in crevices or under ledges. It feeds on a wide range of animals from white-tailed deer, reindeer, roe deer, small red deer, and chamois, to smaller, more usual prey: snowshoe hares, fish, foxes, sheep, squirrels, mice, turkeys and other birds, and goats. It also eats ptarmigans, voles, and grouse.\n\nDistribution and habitat \n\nThe lynx inhabits high altitude forests with dense cover of shrubs, reeds, and tall grass. Although this cat hunts on the ground, it can climb trees and can swim swiftly, catching fish.\n\nEurope and Asia \n\nThe Eurasian lynx ranges from central and northern Europe across Asia up to Northern Pakistan and India. In Iran, they live in Mount Damavand area.\"Iran Environmental and Wild life Watch\" http://www.iew.ir/1392/10/21/20008 Since the beginning of the 20th century, the Eurasian lynx was considered extinct in the wild in Slovenia and Croatia. A resettlement project, begun in 1973, has successfully reintroduced lynx to the Slovenian Alps and the Croatian regions of Gorski Kotar and Velebit, including Croatia's Plitvice Lakes National Park and Risnjak National Park. In both countries, the lynx is listed as an endangered species and protected by law. It became extinct due to human activities during Jōmon period in Japan.Hasegawa Y.. Kaneko H.. Tachibana M.. Tanaka G.. 2011. A study of the extinct Japanese Lynx from the Late Pleistocene to the Early Holocene.. Bulletin of Gunma Museum of Natural History 15. pp.43-80. . Gunma Museum of Natural History\n\nSeveral lynx resettlement projects begun in the 1970s have been successful in various regions of Switzerland. Since the 1990s, there have been numerous efforts to resettle the Eurasian lynx in Germany, and since  2000, a small population can now be found in the Harz mountains near Bad Lauterberg.\n\nThe lynx is found in the Białowieża Forest in northeastern Poland, in Estonia and in the northern and western parts of China, particularly the Tibetan Plateau. In Romania, the numbers exceed 2,000, the largest population in Europe outside of Russia, although most experts consider the official population numbers to be overestimated.\n\nThe lynx is more common in northern Europe, especially in Norway, Sweden, Estonia, Finland, and the northern parts of Russia. The Swedish population is estimated to be 1200–1500 individuals, spread all over the country, but more common in middle Sweden and in the mountain range. The lynx population in Finland was 1900–2100 individuals in 2008, and the numbers have been increasing every year since 1992. The lynx population in Finland is estimated currently to be larger than ever before. Lynx in Britain were wiped out in the 17th century, but there have been calls to reintroduce them to curb the numbers of deer.\n\nThe critically endangered Iberian lynx lives in southern Spain and formerly in eastern Portugal. There is an Iberian lynx reproduction center outside Silves in the Algarve in southern Portugal.\n\nNorth America \n\nThe two Lynx species in North America, Canada lynx and bobcats, are both found in the temperate zone. While the bobcat is common throughout southern Canada, the continental United States and northern Mexico, the Canada lynx is present mainly in boreal forests of Canada and Alaska.\n\nNational animal \n\nThe lynx is considered a national animal in the Republic of Macedonia and is displayed on the reverse of the 5 denar coin.\nIt is also the national animal of Romania. Lynx. http://en.wikipedia.org/?curid=17479."
  }
}
