{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13225",
  "eid" : "075b4b40-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778521588,
  "textBody" : "Hades (;  Háidēs) was the ancient Greek chthonic god of the underworld, which eventually took his name..\n\nIn Greek mythology, Hades was regarded as the oldest son of Cronus and Rhea, although the last son regurgitated by his father.Reckoning by this reverse order is preferred by Poseidon in his speech at Homer, Iliad [http://data.perseus.org/citations/urn:cts:greekLit:tlg0012.tlg001.perseus-eng1:15.184-15.219 15.187]. He and his brothers Zeus and Poseidon defeated their father's generation of gods, the Titans, and claimed rulership over the cosmos. Hades received the underworld, Zeus the sky, and Poseidon the sea, with the solid earth—long the province of Gaia—available to all three concurrently. Hades was often portrayed with his three-headed guard dog Cerberus.\n\nThe Etruscan god Aita and Roman gods Dis Pater and Orcus were eventually taken as equivalent to the Greek Hades and merged as Pluto, a Latinization of his euphemistic Greek name Plouton.\n\nName\n\nThe origin of Hades' name is uncertain, but has generally been seen as meaning \"The Unseen One\" since antiquity. An extensive section of Plato's dialogue Cratylus is devoted to the etymology of the god's name, in which Socrates is arguing for a folk etymology not from \"unseen\" but from \"his knowledge (eidenai) of all noble things\". Modern linguists have proposed the Proto-Greek form *Awides (\"unseen\").According to Dixon-Kennedy, [https://archive.org/stream/MikeDixonKennedy.......encyclopediaOfGrecoRomanMythologybyHouseOfBooks/MikeDixonKennedy.......encyclopediaOfGreco-romanMythologybyHouseOfBooks#page/n159/mode/2up p. 143] (following Kerényi 1951, p. 230) says \"...his name means 'the unseen', a direct contrast to his brother Zeus, who was originally seen to represent the brightness of day\". Ivanov, p. 284, citing Beekes 1998, pp. 17–19, notes that derivation of Hades from a proposed *som wid- is semantically untenable; see also Beekes 2009, p. 34. The earliest attested form is Aḯdēs (), which lacks the proposed digamma. West argues instead for an original meaning of \"the one who presides over meeting up\" from the universality of death.West, [https://books.google.com/books?idZXrJA_5LKlYC&pg\nPA394  p. 394].\n\nIn Homeric and Ionic Greek, he was known as Áïdēs.Bailly, s.v. Ἅιδης. Other poetic variations of the name include Aïdōneús () and the inflected forms Áïdos (, gen.), Áïdi (, dat.), and Áïda (, acc.), whose reconstructed nominative case *Áïs () is, however, not attested.Bailly, s.v. *Ἄϊς. The name as it came to be known in classical times was Háidēs (). Later the iota became silent, then a subscript marking (), and finally omitted entirely ().See Ancient Greek phonology and modern Greek.  \n\nPerhaps from fear of pronouncing his name, around the 5th century BC, the Greeks started referring to Hades as Pluto (, Ploútōn), with a root meaning \"wealthy\", considering that from the abode below (i.e., the soil) come riches (e.g., fertile crops, metals and so on).Bailly, s.v. Πλούτων. Plouton became the Roman god who both rules the underworld and distributed riches from below. This deity was a mixture of the Greek god Hades and the Eleusinian icon Ploutos, and from this he also received a priestess, which was not previously practiced in Greece. More elaborate names of the same genre were Ploutodótēs () or Ploutodotḗr () meaning \"giver of wealth\".Aeschylus, Prometheus Bound, 806, note. [http://www.theoi.com/Text/AeschylusPrometheus.html Translated by Smyth, Herbert Weir (1922)] in Loeb Classical Library, Volume 145. Epithets of Hades include Agesander () and Agesilaos (), both from ágō (, \"lead\", \"carry\" or \"fetch\") and anḗr (, \"man\") or laos (, \"men\" or \"people\"), describing Hades as the god who carries away all.Callimachus, Hymn. in Pallad. 130, with Friedrich Spanheim's noteHesychius of Alexandria s.v.Aeschyl. ap. Athen. iii. p. 99  Nicander uses the form Hegesilaus ().Nicander, ap. Athen. xv. p. 684 He was also referred to as Zeus Katachthonios (Ζευς καταχθονιος), meaning \"the Zeus of the Underworld\", by those avoiding his actual name, as he had complete control over the Underworld.\n\nGreek god of the underworld\n\nIn Greek mythology, Hades, the god of the underworld, was a son of the Titans Cronus and Rhea. He had three sisters, Demeter, Hestia, and Hera, as well as two brothers, Zeus, the youngest of the three, and Poseidon.\nUpon reaching adulthood, Zeus managed to force his father to disgorge his siblings. After their release, the six younger gods, along with allies they managed to gather, challenged the elder gods for power in the Titanomachy, a divine war. The war lasted for ten years and ended with the victory of the younger gods. Following their victory, according to a single famous passage in the Iliad (xv.187–93), Hades and his two brothers, Poseidon and Zeus, drew lotsWalter Burkert, in The Orientalizing Revolution: Near Eastern Influence on Greek Culture in the Early Archaic Age, 1992, (pp 90ff) compares this single reference with the Mesopotamian Atra-Hasis: \"the basic structure of both texts is astonishingly similar.\" The drawing of lots is not the usual account; Hesiod (Theogony, 883) declares that Zeus overthrew his father and was acclaimed king by the other gods. \"There is hardly another passage in Homer which comes so close to being a translation of an Akkadian epic,\" Burkert concludes (p. 91). for realms to rule. Zeus received the sky, Poseidon received the seas, and Hades received the underworld,Poseidon speaks: \"For when we threw the lots I received the grey sea as my abode, Hades drew the murky darkness, Zeus, however, drew the wide sky of brightness and clouds; the earth is common to all, and spacious Olympus.\" Iliad 15.187 the unseen realm to which the souls of the dead go upon leaving the world as well as any and all things beneath the earth. Some myths suggest that Hades was dissatisfied with his turnout, but had no choice and moved to his new realm.\n\nHades obtained his wife and queen, Persephone, through abduction at the behest of Zeus. This myth is the most important one Hades takes part in;Grant and Hazel, [https://books.google.com/books?idIKRDEAeout8C&pg\nPA236 p. 236]. it also connected the Eleusinian Mysteries with the Olympian pantheon, particularly as represented in the Homeric Hymn to Demeter, which is the oldest story of the abduction, most likely dating back to the beginning of the 6th Century BC. Helios told the grieving Demeter that Hades was not unworthy as a consort for Persephone:\n\nDespite modern connotations of death as evil, Hades was actually more altruistically inclined in mythology. Hades was often portrayed as passive rather than evil; his role was often maintaining relative balance. That said, he was also depicted as cold and stern, and he held all of his subjects equally accountable to his laws.Grant and Hazel, [https://books.google.com/books?idIKRDEAeout8C&pg\nPA235 p. 235]. Any other individual aspects of his personality are not given, as Greeks refrained from giving him much thought to avoid attracting his attention.Tripp, p. 257. \n\nHades ruled the dead, assisted by others over whom he had complete authority. The House of Hades was described as full of \"guests,\" though he rarely left the Underworld.Gayley, [https://archive.org/stream/classicmythsinen1911gayl#page/46/mode/2up p. 47]. He cared little about what happened in the Upperworld, as his primary attention was ensuring none of his subjects ever left.  He strictly forbade his subjects to leave his domain and would become quite enraged when anyone tried to leave, or if someone tried to steal the souls from his realm. His wrath was equally terrible for anyone who tried to cheat death or otherwise crossed him, as Sisyphus and Pirithous found out to their sorrow. While usually indifferent to his subjects, Hades was very focused on the punishment of these two people; particularly Pirithous, as he entered the underworld in an attempt to steal Persephone for himself, and consequently was forced onto the \"Chair of Forgetfulness\". Another myth is about the Roman god Asclepius who was originally a demigod, fathered by Apollo and birthed by Coronis, a Thessalian princess. During his lifetime, he became a famous and talented physician, who eventually was able to bring the dead back to life. Feeling cheated, Plouton persuaded Zeus to kill him with a thunderbolt. After his death, he was brought to Olympus where he became a god.Gayley, [https://archive.org/stream/classicmythsinen1911gayl#page/104/mode/2up p. 104]. Hades was only depicted outside of the Underworld once in myth, and even that is believed to have been an instance where he had just left the gates of the Underworld, which was when Heracles shot him with an arrow as Hades was  attempting to defend the city of Plyus.Tripp, p. 256. After he was shot, however, he traveled to Olympus to heal. Besides Heracles, the only other living people who ventured to the Underworld were also heroes: Odysseus, Aeneas (accompanied by the Sibyl), Orpheus, who Hades showed uncharacteristic mercy towards at Persephone's persuasion, who was moved by Orpheus' music,Gayley,  [https://archive.org/stream/classicmythsinen1911gayl#page/164/mode/2up pp. 165–166]. Theseus with Pirithous, and, in a late romance, Psyche. None of them were pleased with what they witnessed in the realm of the dead. In particular, the Greek war hero Achilles, whom Odysseus conjured with a blood libation, said:\n\nCult \n\nHades, as the god of the dead, was a fearsome figure to those still living; in no hurry to meet him, they were reluctant to swear oaths in his name, and averted their faces when sacrificing to him. Since to many, simply to say the word \"Hades\" was frightening, euphemisms were pressed into use. Since precious minerals come from under the earth (i.e., the \"underworld\" ruled by Hades), he was considered to have control of these as well, and was referred to as Πλούτων (Plouton, related to the word for \"wealth\"), Latinized as Pluto. Sophocles explained the notion of referring to Hades as \"the rich one\" with these words: \"the gloomy Hades enriches himself with our sighs and our tears.\" In addition, he was called Clymenus (\"notorious\"), Polydegmon (\"who receives many\"), and perhaps Eubuleus (\"good counsel\" or \"well-intentioned\"),The name Eubouleos is more often seen as an epithet for Dionysus or Zeus. all of them euphemisms for a name that was unsafe to pronounce, which evolved into epithets.\n\nHe spent most of the time in his dark realm.  Formidable in battle, he proved his ferocity in the famous Titanomachy, the battle of the Olympians versus the Titans, which established the rule of Zeus.\n\nFeared and loathed, Hades embodied the inexorable finality of death: \"Why do we loathe Hades more than any god, if not because he is so adamantine and unyielding?\" The rhetorical question is Agamemnon's.Iliad, ix He was not, however, an evil god, for although he was stern, cruel, and unpitying, he was still just. Hades ruled the Underworld and was therefore most often associated with death and feared by men, but he was not Death itself — the actual embodiment of Death was Thanatos, although Euripides' play \"Alkestis\" states fairly clearly that Thanatos and Hades were one and the same deity, and gives an interesting description of him as dark-cloaked and winged;  moreover, Hades was also referred to as \"Hesperos Theos\" (\"God of Death and Darkness\").\n\nWhen the Greeks propitiated Hades, they banged their hands on the ground to be sure he would hear them.\"Hades never knows what is happening in the world above, or in Olympus, except for fragmentary information which comes to him when mortals strike their hands upon the earth and invoke him with oaths and curses\" (Robert Graves, The Greek Myths 1960: §31.e). Black animals, such as sheep, were sacrificed to him, and the very vehemence of the rejection of human sacrifice expressed in myth suggests an unspoken memory of some distant past. The blood from all chthonic sacrifices including those to propitiate Hades dripped into a pit or cleft in the ground. The person who offered the sacrifice had to avert his face.Kerényi 1951, p. 231.\n\nOne ancient source says that he possessed the Cap of invisibility. His chariot, drawn by four black horses, made for a fearsome and impressive sight.  His other ordinary attributes were the narcissus and cypress plants, the Key of Hades and Cerberus, the three-headed dog. In certain portraits, snakes also appeared to be attributed to Hades as he was occasionally portrayed to be either holding them or accompanied by them. This is believed to hold significance as in certain classical sources Hades ravished Kore in the guise of a snake, who went on to give birth to Zagreus-Dionysus. While bearing the name 'Zeus', Zeus Olympios, the great king of the gods, noticeably differs from the Zeus Meilichios, a decidedly Chthonian character, often portrayed as a snake, and as seen beforehand, they cannot be different manifestations of the same god, in fact whenever 'another Zeus' is mentioned, this always refers to Hades. Zeus Meilichios and Zeus Eubouleus are often referred to being alternate names for Hades.\n\nThe philosopher Heraclitus, unifying opposites, declared that Hades and Dionysus, the very essence of indestructible life (zoë), are the same god.Heraclitus, encountering the festival of the Phallophoria, in which phalli were paraded about, remarked in a surviving fragment: \"If they did not order the procession in honor of the god and address the phallus song to him, this would be the most shameless behavior. But Hades is the same as Dionysos, for whom they rave and act like bacchantes\", Kerényi 1976, [https://books.google.com/books?idcXL-QIIhn5gC&pg\nPA239 pp. 239–240]. Among other evidence Kerényi notes that the grieving goddess Demeter refused to drink wine, which is the gift of Dionysus, after Persephone's abduction, because of this association, and suggests that Hades may in fact have been a \"cover name\" for the underworld Dionysus.Kerényi 1967, [https://books.google.com/books?idds1Wg01wzeYC&pg\nPA40 p. 40]. He suggests that this dual identity may have been familiar to those who came into contact with the Mysteries.Kerényi 1976, p. 240. One of the epithets of Dionysus was \"Chthonios\", meaning \"the subterranean\".Kerényi 1976, pp. [https://books.google.com/books?idcXL-QIIhn5gC&pg\nPA83 83], [https://books.google.com/books?idcXL-QIIhn5gC&pg\nPA199 199]. The role of unifying Hades, Zeus and Dionysus as a single tripartite god was used to represent the birth, death and resurrection of a deity and to unify the 'shining' realm of Zeus and the dark underworld realm of Hades.\n\nArtistic representations\n\n Hades was depicted so infrequently in artwork, as well as mythology, because the Greeks were so afraid of him. His artistic representations, which are generally found in Archaic pottery, are not even concretely thought of as the deity; however at this point in time it is heavily believed that the figures illustrated are indeed Hades. He was later presented in the classical arts in the depictions of the Rape of Persephone.[http://www.theoi.com/Gallery/K14.6.html The Rape of Persephone] Museo Archeologico Nazionale di Napoli, Naples, Italy  Within these illustrations, Hades was often young, yet he was also shown as varying ages in other works. Due to this lack of depictions, there weren't very strict guidelines when representing the deity. On pottery, he has a dark beard and is presented as a stately figure on an \"ebony throne.\" His attributes in art include a scepter, cornucopia, rooster,Hansen and Hansen, [https://books.google.com/books?id\na-NmaO-kM2UC&pgPA183 p. 183]. and a key, which both represented his control over the underworld and acted as a reminder that the gates of the Underworld were always locked so that souls could not leave.Tripp, p. 257; Grant and Hazel, [https://books.google.com/books?id\nIKRDEAeout8C&pgPA235 p. 235] Even if the doors were open, Cerberus, the three-headed guard dog of the Underworld, ensured that while all souls were allowed to enter into The Underworld freely, none could ever escape.Tripp, p. 258. The dog is often portrayed next to the god as a means of easy identification, since no other deity relates to it so directly. Sometimes, artists painted Hades as looking away from the other gods, as he was disliked by them as well as humans.\n\nAs Plouton, he was regarded in a more positive light. He holds a cornucopia, representing the gifts he bestows upon people as well as fertility, which he becomes connected to.\n\nPersephone\n\nThe consort of Hades was Persephone, represented by the Greeks as the beautiful daughter of Demeter.Guirand, p. 190.\n\nPersephone did not submit to Hades willingly, but was abducted by him while picking flowers in the fields of Nysa. In protest of his act, Demeter cast a curse on the land and there was a great famine; though, one by one, the gods came to request she lift it, lest mankind perish, she asserted that the earth would remain barren until she saw her daughter again. Finally, Zeus intervened; via Hermes, he requested that Hades return Persephone.   Hades complied,\n\nDemeter questioned Persephone on her return to light and air:\n\nThis bound her to Hades and the Underworld, much to the dismay of Demeter. It is not clear whether Persephone was accomplice to the ploy. Zeus proposed a compromise, to which all parties agreed: of the year, Persephone would spend one third with her husband.Guirand, p. 175.\n\nIt is during this time that winter casts on the earth \"an aspect of sadness and mourning.\"Guirand, p. 176.\n\nTheseus and Pirithous\n\nTheseus and Pirithous pledged to kidnap and marry daughters of Zeus. Theseus chose Helen and together they kidnapped her and decided to hold onto her until she was old enough to marry. Pirithous chose Persephone. They left Helen with Theseus' mother, Aethra, and traveled to the Underworld. Hades knew of their plan to capture his wife, so he pretended to offer them hospitality and set a feast; as soon as the pair sat down, snakes coiled around their feet and held them there. Theseus was eventually rescued by Heracles but Pirithous remained trapped as punishment for daring to seek the wife of a god for his own.\n\nHeracles\n\nHeracles' final labour was to capture Cerberus. First, Heracles went to Eleusis to be initiated into the Eleusinian Mysteries. He did this to absolve himself of guilt for killing the centaurs and to learn how to enter and exit the underworld alive. He found the entrance to the underworld at Taenarum. Athena and Hermes helped him through and back from Hades. Heracles asked Hades for permission to take Cerberus. Hades agreed as long as Heracles didn't harm Cerberus. When Heracles dragged the dog out of Hades, he passed through the cavern Acherusia.\n\nMinthe\n\nThe nymph Minthe, associated with the river Cocytus, loved by Hades, was turned into the mint plant, by a jealous Persephone.Strabo, [http://www.perseus.tufts.edu/hopper/text?doc=Strab.+8.3.14 8.3.14]; Ovid, Metamorphoses [http://data.perseus.org/citations/urn:cts:latinLit:phi0959.phi006.perseus-eng1:10.652 10.728–730].\n\nRealm of Hades\n\nIn older Greek myths, the realm of Hades is the misty and gloomyHomeric Hymn to Demeter abode of the dead (also called Erebus) where all mortals go when they die. Very few mortals could leave Hades once they entered. The exceptions, Heracles and Theseus, are heroic. Even Odysseus in his Nekyia (Odyssey, xi) calls up the spirits of the departed, rather than descend to them. Later Greek philosophy introduced the idea that all mortals are judged after death and are either rewarded or cursed.\n\nThere were several sections of the realm of Hades, including Elysium, the Asphodel Meadows, and Tartarus. Greek mythographers were not perfectly consistent about the geography of the afterlife. A contrasting myth of the afterlife concerns the Garden of the Hesperides, often identified with the Isles of the Blessed, where the blessed heroes may dwell.\n\nIn Roman mythology, the entrance to the Underworld located at Avernus, a crater near Cumae, was the route Aeneas used to descend to the realm of the dead.Aeneid, book 6. By synecdoche, \"Avernus\" could be substituted for the underworld as a whole. The di inferi were a collective of underworld divinities.\n\nFor Hellenes, the deceased entered the underworld by crossing the Styx, ferried across by Charon  kair'-on), who charged an obolus, a small coin for passage placed in the mouth of the deceased by pious relatives. Paupers and the friendless gathered for a hundred years on the near shore according to Book VI of Vergil's Aeneid. Greeks offered propitiatory libations to prevent the deceased from returning to the upper world to \"haunt\" those who had not given them a proper burial. The far side of the river was guarded by Cerberus, the three-headed dog defeated by Heracles (Roman Hercules). Passing beyond Cerberus, the shades of the departed entered the land of the dead to be judged.\n\nThe five rivers of the realm of Hades, and their symbolic meanings, are Acheron (the river of sorrow, or woe), Cocytus (lamentation), Phlegethon (fire), Lethe (oblivion), and Styx (hate), the river upon which even the gods swore and in which Achilles was dipped to render him invincible. The Styx forms the boundary between the upper and lower worlds. See also Eridanos.\n\nThe first region of Hades comprises the Fields of Asphodel, described in Odyssey xi, where the shades of heroes wander despondently among lesser spirits, who twitter around them like bats. Only libations of blood offered to them in the world of the living can reawaken in them for a time the sensations of humanity.\n\nBeyond lay Erebus, which could be taken for a euphonym of Hades, whose own name was dread. There were two pools, that of Lethe, where the common souls flocked to erase all memory, and the pool of Mnemosyne (\"memory\"), where the initiates of the Mysteries drank instead. In the forecourt of the palace of Hades and Persephone sit the three judges of the Underworld: Minos, Rhadamanthus, and Aeacus. There at the trivium sacred to Hecate, where three roads meet, souls are judged, returned to the Fields of Asphodel if they are neither virtuous nor evil, sent by the road to Tartarus if they are impious or evil, or sent to Elysium (Islands of the Blessed) with the \"blameless\" heroes.\n\nIn the Sibylline oracles, a curious hodgepodge of Greco-Roman and Judaeo-Christian elements, Hades again appears as the abode of the dead, and by way of folk etymology, it even derives Hades from the name Adam (the first man), saying it is because he was the first to enter there.Sibylline Oracles I, 101–3 Owing to its appearance in the New Testament of the Bible, Hades also has a distinct meaning in Christianity.\n\nGenealogy\n\nIn popular culture",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hades" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13225" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hades (;  Háidēs) was the ancient Greek chthonic god of the underworld, which eventually took his name..\n\nIn Greek mythology, Hades was regarded as the oldest son of Cronus and Rhea, although the last son regurgitated by his father.Reckoning by this reverse order is preferred by Poseidon in his speech at Homer, Iliad [http://data.perseus.org/citations/urn:cts:greekLit:tlg0012.tlg001.perseus-eng1:15.184-15.219 15.187]. He and his brothers Zeus and Poseidon defeated their father's generation of gods, the Titans, and claimed rulership over the cosmos. Hades received the underworld, Zeus the sky, and Poseidon the sea, with the solid earth—long the province of Gaia—available to all three concurrently. Hades was often portrayed with his three-headed guard dog Cerberus.\n\nThe Etruscan god Aita and Roman gods Dis Pater and Orcus were eventually taken as equivalent to the Greek Hades and merged as Pluto, a Latinization of his euphemistic Greek name Plouton.\n\nName\n\nThe origin of Hades' name is uncertain, but has generally been seen as meaning \"The Unseen One\" since antiquity. An extensive section of Plato's dialogue Cratylus is devoted to the etymology of the god's name, in which Socrates is arguing for a folk etymology not from \"unseen\" but from \"his knowledge (eidenai) of all noble things\". Modern linguists have proposed the Proto-Greek form *Awides (\"unseen\").According to Dixon-Kennedy, [https://archive.org/stream/MikeDixonKennedy.......encyclopediaOfGrecoRomanMythologybyHouseOfBooks/MikeDixonKennedy.......encyclopediaOfGreco-romanMythologybyHouseOfBooks#page/n159/mode/2up p. 143] (following Kerényi 1951, p. 230) says \"...his name means 'the unseen', a direct contrast to his brother Zeus, who was originally seen to represent the brightness of day\". Ivanov, p. 284, citing Beekes 1998, pp. 17–19, notes that derivation of Hades from a proposed *som wid- is semantically untenable; see also Beekes 2009, p. 34. The earliest attested form is Aḯdēs (), which lacks the proposed digamma. West argues instead for an original meaning of \"the one who presides over meeting up\" from the universality of death.West, [https://books.google.com/books?idZXrJA_5LKlYC&pg\nPA394  p. 394].\n\nIn Homeric and Ionic Greek, he was known as Áïdēs.Bailly, s.v. Ἅιδης. Other poetic variations of the name include Aïdōneús () and the inflected forms Áïdos (, gen.), Áïdi (, dat.), and Áïda (, acc.), whose reconstructed nominative case *Áïs () is, however, not attested.Bailly, s.v. *Ἄϊς. The name as it came to be known in classical times was Háidēs (). Later the iota became silent, then a subscript marking (), and finally omitted entirely ().See Ancient Greek phonology and modern Greek.  \n\nPerhaps from fear of pronouncing his name, around the 5th century BC, the Greeks started referring to Hades as Pluto (, Ploútōn), with a root meaning \"wealthy\", considering that from the abode below (i.e., the soil) come riches (e.g., fertile crops, metals and so on).Bailly, s.v. Πλούτων. Plouton became the Roman god who both rules the underworld and distributed riches from below. This deity was a mixture of the Greek god Hades and the Eleusinian icon Ploutos, and from this he also received a priestess, which was not previously practiced in Greece. More elaborate names of the same genre were Ploutodótēs () or Ploutodotḗr () meaning \"giver of wealth\".Aeschylus, Prometheus Bound, 806, note. [http://www.theoi.com/Text/AeschylusPrometheus.html Translated by Smyth, Herbert Weir (1922)] in Loeb Classical Library, Volume 145. Epithets of Hades include Agesander () and Agesilaos (), both from ágō (, \"lead\", \"carry\" or \"fetch\") and anḗr (, \"man\") or laos (, \"men\" or \"people\"), describing Hades as the god who carries away all.Callimachus, Hymn. in Pallad. 130, with Friedrich Spanheim's noteHesychius of Alexandria s.v.Aeschyl. ap. Athen. iii. p. 99  Nicander uses the form Hegesilaus ().Nicander, ap. Athen. xv. p. 684 He was also referred to as Zeus Katachthonios (Ζευς καταχθονιος), meaning \"the Zeus of the Underworld\", by those avoiding his actual name, as he had complete control over the Underworld.\n\nGreek god of the underworld\n\nIn Greek mythology, Hades, the god of the underworld, was a son of the Titans Cronus and Rhea. He had three sisters, Demeter, Hestia, and Hera, as well as two brothers, Zeus, the youngest of the three, and Poseidon.\nUpon reaching adulthood, Zeus managed to force his father to disgorge his siblings. After their release, the six younger gods, along with allies they managed to gather, challenged the elder gods for power in the Titanomachy, a divine war. The war lasted for ten years and ended with the victory of the younger gods. Following their victory, according to a single famous passage in the Iliad (xv.187–93), Hades and his two brothers, Poseidon and Zeus, drew lotsWalter Burkert, in The Orientalizing Revolution: Near Eastern Influence on Greek Culture in the Early Archaic Age, 1992, (pp 90ff) compares this single reference with the Mesopotamian Atra-Hasis: \"the basic structure of both texts is astonishingly similar.\" The drawing of lots is not the usual account; Hesiod (Theogony, 883) declares that Zeus overthrew his father and was acclaimed king by the other gods. \"There is hardly another passage in Homer which comes so close to being a translation of an Akkadian epic,\" Burkert concludes (p. 91). for realms to rule. Zeus received the sky, Poseidon received the seas, and Hades received the underworld,Poseidon speaks: \"For when we threw the lots I received the grey sea as my abode, Hades drew the murky darkness, Zeus, however, drew the wide sky of brightness and clouds; the earth is common to all, and spacious Olympus.\" Iliad 15.187 the unseen realm to which the souls of the dead go upon leaving the world as well as any and all things beneath the earth. Some myths suggest that Hades was dissatisfied with his turnout, but had no choice and moved to his new realm.\n\nHades obtained his wife and queen, Persephone, through abduction at the behest of Zeus. This myth is the most important one Hades takes part in;Grant and Hazel, [https://books.google.com/books?idIKRDEAeout8C&pg\nPA236 p. 236]. it also connected the Eleusinian Mysteries with the Olympian pantheon, particularly as represented in the Homeric Hymn to Demeter, which is the oldest story of the abduction, most likely dating back to the beginning of the 6th Century BC. Helios told the grieving Demeter that Hades was not unworthy as a consort for Persephone:\n\nDespite modern connotations of death as evil, Hades was actually more altruistically inclined in mythology. Hades was often portrayed as passive rather than evil; his role was often maintaining relative balance. That said, he was also depicted as cold and stern, and he held all of his subjects equally accountable to his laws.Grant and Hazel, [https://books.google.com/books?idIKRDEAeout8C&pg\nPA235 p. 235]. Any other individual aspects of his personality are not given, as Greeks refrained from giving him much thought to avoid attracting his attention.Tripp, p. 257. \n\nHades ruled the dead, assisted by others over whom he had complete authority. The House of Hades was described as full of \"guests,\" though he rarely left the Underworld.Gayley, [https://archive.org/stream/classicmythsinen1911gayl#page/46/mode/2up p. 47]. He cared little about what happened in the Upperworld, as his primary attention was ensuring none of his subjects ever left.  He strictly forbade his subjects to leave his domain and would become quite enraged when anyone tried to leave, or if someone tried to steal the souls from his realm. His wrath was equally terrible for anyone who tried to cheat death or otherwise crossed him, as Sisyphus and Pirithous found out to their sorrow. While usually indifferent to his subjects, Hades was very focused on the punishment of these two people; particularly Pirithous, as he entered the underworld in an attempt to steal Persephone for himself, and consequently was forced onto the \"Chair of Forgetfulness\". Another myth is about the Roman god Asclepius who was originally a demigod, fathered by Apollo and birthed by Coronis, a Thessalian princess. During his lifetime, he became a famous and talented physician, who eventually was able to bring the dead back to life. Feeling cheated, Plouton persuaded Zeus to kill him with a thunderbolt. After his death, he was brought to Olympus where he became a god.Gayley, [https://archive.org/stream/classicmythsinen1911gayl#page/104/mode/2up p. 104]. Hades was only depicted outside of the Underworld once in myth, and even that is believed to have been an instance where he had just left the gates of the Underworld, which was when Heracles shot him with an arrow as Hades was  attempting to defend the city of Plyus.Tripp, p. 256. After he was shot, however, he traveled to Olympus to heal. Besides Heracles, the only other living people who ventured to the Underworld were also heroes: Odysseus, Aeneas (accompanied by the Sibyl), Orpheus, who Hades showed uncharacteristic mercy towards at Persephone's persuasion, who was moved by Orpheus' music,Gayley,  [https://archive.org/stream/classicmythsinen1911gayl#page/164/mode/2up pp. 165–166]. Theseus with Pirithous, and, in a late romance, Psyche. None of them were pleased with what they witnessed in the realm of the dead. In particular, the Greek war hero Achilles, whom Odysseus conjured with a blood libation, said:\n\nCult \n\nHades, as the god of the dead, was a fearsome figure to those still living; in no hurry to meet him, they were reluctant to swear oaths in his name, and averted their faces when sacrificing to him. Since to many, simply to say the word \"Hades\" was frightening, euphemisms were pressed into use. Since precious minerals come from under the earth (i.e., the \"underworld\" ruled by Hades), he was considered to have control of these as well, and was referred to as Πλούτων (Plouton, related to the word for \"wealth\"), Latinized as Pluto. Sophocles explained the notion of referring to Hades as \"the rich one\" with these words: \"the gloomy Hades enriches himself with our sighs and our tears.\" In addition, he was called Clymenus (\"notorious\"), Polydegmon (\"who receives many\"), and perhaps Eubuleus (\"good counsel\" or \"well-intentioned\"),The name Eubouleos is more often seen as an epithet for Dionysus or Zeus. all of them euphemisms for a name that was unsafe to pronounce, which evolved into epithets.\n\nHe spent most of the time in his dark realm.  Formidable in battle, he proved his ferocity in the famous Titanomachy, the battle of the Olympians versus the Titans, which established the rule of Zeus.\n\nFeared and loathed, Hades embodied the inexorable finality of death: \"Why do we loathe Hades more than any god, if not because he is so adamantine and unyielding?\" The rhetorical question is Agamemnon's.Iliad, ix He was not, however, an evil god, for although he was stern, cruel, and unpitying, he was still just. Hades ruled the Underworld and was therefore most often associated with death and feared by men, but he was not Death itself — the actual embodiment of Death was Thanatos, although Euripides' play \"Alkestis\" states fairly clearly that Thanatos and Hades were one and the same deity, and gives an interesting description of him as dark-cloaked and winged;  moreover, Hades was also referred to as \"Hesperos Theos\" (\"God of Death and Darkness\").\n\nWhen the Greeks propitiated Hades, they banged their hands on the ground to be sure he would hear them.\"Hades never knows what is happening in the world above, or in Olympus, except for fragmentary information which comes to him when mortals strike their hands upon the earth and invoke him with oaths and curses\" (Robert Graves, The Greek Myths 1960: §31.e). Black animals, such as sheep, were sacrificed to him, and the very vehemence of the rejection of human sacrifice expressed in myth suggests an unspoken memory of some distant past. The blood from all chthonic sacrifices including those to propitiate Hades dripped into a pit or cleft in the ground. The person who offered the sacrifice had to avert his face.Kerényi 1951, p. 231.\n\nOne ancient source says that he possessed the Cap of invisibility. His chariot, drawn by four black horses, made for a fearsome and impressive sight.  His other ordinary attributes were the narcissus and cypress plants, the Key of Hades and Cerberus, the three-headed dog. In certain portraits, snakes also appeared to be attributed to Hades as he was occasionally portrayed to be either holding them or accompanied by them. This is believed to hold significance as in certain classical sources Hades ravished Kore in the guise of a snake, who went on to give birth to Zagreus-Dionysus. While bearing the name 'Zeus', Zeus Olympios, the great king of the gods, noticeably differs from the Zeus Meilichios, a decidedly Chthonian character, often portrayed as a snake, and as seen beforehand, they cannot be different manifestations of the same god, in fact whenever 'another Zeus' is mentioned, this always refers to Hades. Zeus Meilichios and Zeus Eubouleus are often referred to being alternate names for Hades.\n\nThe philosopher Heraclitus, unifying opposites, declared that Hades and Dionysus, the very essence of indestructible life (zoë), are the same god.Heraclitus, encountering the festival of the Phallophoria, in which phalli were paraded about, remarked in a surviving fragment: \"If they did not order the procession in honor of the god and address the phallus song to him, this would be the most shameless behavior. But Hades is the same as Dionysos, for whom they rave and act like bacchantes\", Kerényi 1976, [https://books.google.com/books?idcXL-QIIhn5gC&pg\nPA239 pp. 239–240]. Among other evidence Kerényi notes that the grieving goddess Demeter refused to drink wine, which is the gift of Dionysus, after Persephone's abduction, because of this association, and suggests that Hades may in fact have been a \"cover name\" for the underworld Dionysus.Kerényi 1967, [https://books.google.com/books?idds1Wg01wzeYC&pg\nPA40 p. 40]. He suggests that this dual identity may have been familiar to those who came into contact with the Mysteries.Kerényi 1976, p. 240. One of the epithets of Dionysus was \"Chthonios\", meaning \"the subterranean\".Kerényi 1976, pp. [https://books.google.com/books?idcXL-QIIhn5gC&pg\nPA83 83], [https://books.google.com/books?idcXL-QIIhn5gC&pg\nPA199 199]. The role of unifying Hades, Zeus and Dionysus as a single tripartite god was used to represent the birth, death and resurrection of a deity and to unify the 'shining' realm of Zeus and the dark underworld realm of Hades.\n\nArtistic representations\n\n Hades was depicted so infrequently in artwork, as well as mythology, because the Greeks were so afraid of him. His artistic representations, which are generally found in Archaic pottery, are not even concretely thought of as the deity; however at this point in time it is heavily believed that the figures illustrated are indeed Hades. He was later presented in the classical arts in the depictions of the Rape of Persephone.[http://www.theoi.com/Gallery/K14.6.html The Rape of Persephone] Museo Archeologico Nazionale di Napoli, Naples, Italy  Within these illustrations, Hades was often young, yet he was also shown as varying ages in other works. Due to this lack of depictions, there weren't very strict guidelines when representing the deity. On pottery, he has a dark beard and is presented as a stately figure on an \"ebony throne.\" His attributes in art include a scepter, cornucopia, rooster,Hansen and Hansen, [https://books.google.com/books?id\na-NmaO-kM2UC&pgPA183 p. 183]. and a key, which both represented his control over the underworld and acted as a reminder that the gates of the Underworld were always locked so that souls could not leave.Tripp, p. 257; Grant and Hazel, [https://books.google.com/books?id\nIKRDEAeout8C&pgPA235 p. 235] Even if the doors were open, Cerberus, the three-headed guard dog of the Underworld, ensured that while all souls were allowed to enter into The Underworld freely, none could ever escape.Tripp, p. 258. The dog is often portrayed next to the god as a means of easy identification, since no other deity relates to it so directly. Sometimes, artists painted Hades as looking away from the other gods, as he was disliked by them as well as humans.\n\nAs Plouton, he was regarded in a more positive light. He holds a cornucopia, representing the gifts he bestows upon people as well as fertility, which he becomes connected to.\n\nPersephone\n\nThe consort of Hades was Persephone, represented by the Greeks as the beautiful daughter of Demeter.Guirand, p. 190.\n\nPersephone did not submit to Hades willingly, but was abducted by him while picking flowers in the fields of Nysa. In protest of his act, Demeter cast a curse on the land and there was a great famine; though, one by one, the gods came to request she lift it, lest mankind perish, she asserted that the earth would remain barren until she saw her daughter again. Finally, Zeus intervened; via Hermes, he requested that Hades return Persephone.   Hades complied,\n\nDemeter questioned Persephone on her return to light and air:\n\nThis bound her to Hades and the Underworld, much to the dismay of Demeter. It is not clear whether Persephone was accomplice to the ploy. Zeus proposed a compromise, to which all parties agreed: of the year, Persephone would spend one third with her husband.Guirand, p. 175.\n\nIt is during this time that winter casts on the earth \"an aspect of sadness and mourning.\"Guirand, p. 176.\n\nTheseus and Pirithous\n\nTheseus and Pirithous pledged to kidnap and marry daughters of Zeus. Theseus chose Helen and together they kidnapped her and decided to hold onto her until she was old enough to marry. Pirithous chose Persephone. They left Helen with Theseus' mother, Aethra, and traveled to the Underworld. Hades knew of their plan to capture his wife, so he pretended to offer them hospitality and set a feast; as soon as the pair sat down, snakes coiled around their feet and held them there. Theseus was eventually rescued by Heracles but Pirithous remained trapped as punishment for daring to seek the wife of a god for his own.\n\nHeracles\n\nHeracles' final labour was to capture Cerberus. First, Heracles went to Eleusis to be initiated into the Eleusinian Mysteries. He did this to absolve himself of guilt for killing the centaurs and to learn how to enter and exit the underworld alive. He found the entrance to the underworld at Taenarum. Athena and Hermes helped him through and back from Hades. Heracles asked Hades for permission to take Cerberus. Hades agreed as long as Heracles didn't harm Cerberus. When Heracles dragged the dog out of Hades, he passed through the cavern Acherusia.\n\nMinthe\n\nThe nymph Minthe, associated with the river Cocytus, loved by Hades, was turned into the mint plant, by a jealous Persephone.Strabo, [http://www.perseus.tufts.edu/hopper/text?doc=Strab.+8.3.14 8.3.14]; Ovid, Metamorphoses [http://data.perseus.org/citations/urn:cts:latinLit:phi0959.phi006.perseus-eng1:10.652 10.728–730].\n\nRealm of Hades\n\nIn older Greek myths, the realm of Hades is the misty and gloomyHomeric Hymn to Demeter abode of the dead (also called Erebus) where all mortals go when they die. Very few mortals could leave Hades once they entered. The exceptions, Heracles and Theseus, are heroic. Even Odysseus in his Nekyia (Odyssey, xi) calls up the spirits of the departed, rather than descend to them. Later Greek philosophy introduced the idea that all mortals are judged after death and are either rewarded or cursed.\n\nThere were several sections of the realm of Hades, including Elysium, the Asphodel Meadows, and Tartarus. Greek mythographers were not perfectly consistent about the geography of the afterlife. A contrasting myth of the afterlife concerns the Garden of the Hesperides, often identified with the Isles of the Blessed, where the blessed heroes may dwell.\n\nIn Roman mythology, the entrance to the Underworld located at Avernus, a crater near Cumae, was the route Aeneas used to descend to the realm of the dead.Aeneid, book 6. By synecdoche, \"Avernus\" could be substituted for the underworld as a whole. The di inferi were a collective of underworld divinities.\n\nFor Hellenes, the deceased entered the underworld by crossing the Styx, ferried across by Charon  kair'-on), who charged an obolus, a small coin for passage placed in the mouth of the deceased by pious relatives. Paupers and the friendless gathered for a hundred years on the near shore according to Book VI of Vergil's Aeneid. Greeks offered propitiatory libations to prevent the deceased from returning to the upper world to \"haunt\" those who had not given them a proper burial. The far side of the river was guarded by Cerberus, the three-headed dog defeated by Heracles (Roman Hercules). Passing beyond Cerberus, the shades of the departed entered the land of the dead to be judged.\n\nThe five rivers of the realm of Hades, and their symbolic meanings, are Acheron (the river of sorrow, or woe), Cocytus (lamentation), Phlegethon (fire), Lethe (oblivion), and Styx (hate), the river upon which even the gods swore and in which Achilles was dipped to render him invincible. The Styx forms the boundary between the upper and lower worlds. See also Eridanos.\n\nThe first region of Hades comprises the Fields of Asphodel, described in Odyssey xi, where the shades of heroes wander despondently among lesser spirits, who twitter around them like bats. Only libations of blood offered to them in the world of the living can reawaken in them for a time the sensations of humanity.\n\nBeyond lay Erebus, which could be taken for a euphonym of Hades, whose own name was dread. There were two pools, that of Lethe, where the common souls flocked to erase all memory, and the pool of Mnemosyne (\"memory\"), where the initiates of the Mysteries drank instead. In the forecourt of the palace of Hades and Persephone sit the three judges of the Underworld: Minos, Rhadamanthus, and Aeacus. There at the trivium sacred to Hecate, where three roads meet, souls are judged, returned to the Fields of Asphodel if they are neither virtuous nor evil, sent by the road to Tartarus if they are impious or evil, or sent to Elysium (Islands of the Blessed) with the \"blameless\" heroes.\n\nIn the Sibylline oracles, a curious hodgepodge of Greco-Roman and Judaeo-Christian elements, Hades again appears as the abode of the dead, and by way of folk etymology, it even derives Hades from the name Adam (the first man), saying it is because he was the first to enter there.Sibylline Oracles I, 101–3 Owing to its appearance in the New Testament of the Bible, Hades also has a distinct meaning in Christianity.\n\nGenealogy\n\nIn popular culture. Hades. http://en.wikipedia.org/?curid=13225."
  }
}
