{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18494",
  "eid" : "3335cba0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778595162,
  "textBody" : "The Lord's Prayer (also called the Our Father or Pater Noster, among other names) is a venerated Christian prayer that, according to the New Testament, Jesus taught as the way to pray.\"Pray then in this way\" (Matthew 6:9 NRSV); \"When you pray, say\" (Luke 11:2 NRSV) Two versions of this prayer are recorded: the long form in the Gospel of Matthew in the middle of the Sermon on the Mount, and the short form in the Gospel of Luke when \"one of his disciples said to him, 'Lord, teach us to pray, as John taught his disciples.'\"Luke 11:1 NRSV\n\nThe first three of the seven petitions in Matthew address God; the other four are related to human needs and concerns. The Matthew account alone includes the \"Your will be done\" and the \"Rescue us from the evil one\" (or \"Deliver us from evil\") petitions. Both original Greek texts contain the adjective epiousios, which does not appear in any other classical or Koine Greek literature; while controversial, \"daily\" has been the most common English-language translation of this word. Some Christians, particularly Protestants, conclude the prayer with a doxology, a later addendum appearing in some manuscripts of Matthew.\n\n[https://www.biblegateway.com/passage/?searchmat+6%3A9-13&version\nNRSV Matthew 6:9-13] (NRSV)\nOur Father in heaven, hallowed be your name. Your kingdom come. Your will be done, on earth as it is in heaven. Give us this day our daily bread. And forgive us our debts, as we also have forgiven our debtors. And do not bring us to the time of trial, but rescue us from the evil one.\n\n[https://www.biblegateway.com/passage/?searchLuke+11%3A2-4&version\nNRSV Luke 11:2-4] (NRSV)\nFather, hallowed be your name. Your kingdom come. Give us each day our daily bread. And forgive us our sins, for we ourselves forgive everyone indebted to us. And do not bring us to the time of trial.\n\nInitial words on the topic from the Catechism of the Catholic Church teach that it \"is truly the summary of the whole gospel.\" The prayer is used by most Christian churches in their worship; with few exceptions, the liturgical form is the Matthean. Although theological differences and various modes of worship divide Christians, according to Fuller Seminary professor Clayton Schmit, \"there is a sense of solidarity in knowing that Christians around the globe are praying together ... and these words always unite us.\"Kang, K. Connie. \"Across the globe, Christians are united by Lord's Prayer.\" Los Angeles Times, in Houston Chronicle, p. A13, April 8, 2007 \n\nIn biblical criticism, the prayer's absence in the Gospel of Mark together with its occurrence in Matthew and Luke has caused scholars who accept the two-source hypothesis (against other document hypotheses) to conclude that it is probably a logion original to Q.Farmer, William R., [https://books.google.com/books?idKkO4qzxHrsEC&pg\nPA49 The Gospel of Jesus: The Pastoral Relevance of the Synoptic Problem], Westminster John Knox Press (1994), p. 49, \n\nText\n\nOriginal Greek text and Vulgate Latin translation\n\nStandard edition of Greek textThe [http://www.nestle-aland.com/en/read-na28-online/text/bibeltext/lesen/stelle/50/60001/69999/ text] given here is that of the latest edition of Greek New Testament of the United Bible Societies and in the Nestle-Aland Novum Testamentum Graece. Most modern translations use a text similar to this one. Most older translations are based on a Byzantine-type text with ἐπὶ τῆς γῆς in line 5 (verse 10) instead of ἐπὶ γῆς, and ἀφίεμεν in line 8 (verse 12) instead of ἀφήκαμεν, and adding at the end (verse 13) the doxology ὅτι σοῦ ἐστιν ἡ βασιλεία καὶ ἡ δύναμις καὶ ἡ δόξα εἰς τοὺς αἰῶνας. ἀμήν.\n\nVulgate Latin translation[http://www.sacredbible.org/articles/Matthew-Latin3.htm Three editions of the Vulgate]: the Clementine edition of the Vulgate, which varies from the [http://www.vatican.va/archive/bible/nova_vulgata/documents/nova-vulgata_nt_evang-matthaeum_lt.html Nova Vulgata] only in punctuation and in having \"ne nos inducas\" in place of \"ne inducas nos\", and another edition of the Vulgate, which has \"qui in caelis es\" in place of \"qui es in caelis\"; \"veniat\" in place of \"adveniat\"; \"dimisimus\" in place of \"dimittimus\"; \"temptationem\" in place of \"tentationem\".\n\nPater noster, qui es in caelis,\nsanctificetur nomen tuum,\nadveniat regnum tuum,\nfiat voluntas tua,\nsicut in caelo, et in terra.\nPanem nostrum supersubstantialem da nobis hodie;\net dimitte nobis debita nostra,\nsicut et nos dimittimus debitoribus nostris;\net ne inducas nos in tentationem;\nsed libera nos a Malo.In the Nova Vulgata, the official Latin Bible of the Catholic Church, the last word is capitalized, indicating that it is a reference to Malus (the Evil One), not to malum (evil).The doxology associated with the Lord's Prayer in Byzantine Greek texts is found in four Vetus Latina manuscripts, only two of which give it in its entirety. The other surviving manuscripts of the Vetus Latina Gospels do not have the doxology. The Vulgate translation also does not include it, thus agreeing with critical editions of the Greek text.\n\nLiturgical Greek and Latin texts \n\nPatriarchal Edition 1904\nThe Greek Orthodox Church uses a slightly different Greek version. which can be found in the Divine Liturgy of St. John Chrysostom ([http://www.goarch.org/chapel/liturgical_texts/liturgy-el] Greek Orthodox Liturgy of St. John Chrysostom]), as presented in the [http://www.goarch.org/chapel/biblegreek] 1904 text of the Ecumenical Patriarchate of Constantinople] and various Greek prayer books and liturgies. This is the Greek version of the Lord's Prayer most widely used for prayer and liturgy today, and is similar to other texts of the Byzantine text-type used in older English Bible translations, with ἐπὶ τῆς γῆς instead of ἐπὶ γῆς on line 5 and ἀφίεμεν instead of ἀφήκαμεν (present rather than aorist tense) in line 8. The last part, ὅτι σοῦ ἐστιν ἡ βασιλεία καὶ ἡ δύναμις καὶ ἡ δόξα εἰς τοὺς αἰῶνας· ἀμήν, is said by the priest after the prayer.\n\nRoman Missal[https://www.scribd.com/doc/20881056/Missale-Romanum-2002 2002 edition]; [http://media.musicasacra.com/pdf/missale62.pdf 1962 edition, pp. 312−313]The version of the Lord's Prayer most familiar to Christians until the Protestant Reformation, and beyond for Catholics, is that in the Roman Missal, which has had cultural and historical importance for most regions where English is spoken. The text is used in the Roman Rite liturgy (Mass, Liturgy of the Hours, etc.). It differs from the Vulgate in having cotidianum in place of supersubstantialem. It does not add the Byzantine doxology: this is never joined immediately to the Lord's Prayer in the Latin liturgy or the Latin Bible, but it appears, in the form quia tuum est regnum, et potestas, et gloria, in saecula, in the Mass of the Roman Rite, as revised in 1969, separated from the Lord's Prayer by the prayer, Libera nos, quaesumus... (the embolism), which elaborates on the final petition, libera nos a malo (deliver us from evil). Others have translated the Byzantine doxology into Latin as quia tuum est regnum; et potentia et gloria; per omnia saecula or in saecula saeculorum.\nPater noster, qui es in caelis:\nsanctificetur nomen tuum;\nadveniat regnum tuum;\nfiat voluntas tua, sicut in caelo, et in terra.\nPanem nostrum cotidianumIn editions of the Roman Missal prior to that of 1962 (the edition of Pope John XXIII) the word cotidianum was spelled quotidianum. da nobis hodie;\net dimitte nobis debita nostra,\nsicut et nos dimittimus debitoribus nostris;\net ne nos inducas in tentationem;\nsed libera nos a malo.\n\nEnglish versions\n\nThere are several different English translations of the Lord's Prayer from Greek or Latin, beginning around AD 650 with the Northumbrian translation. Of those in current liturgical use, the three best-known are:\n* The translation in the 1662 Anglican Book of Common Prayer (BCP) of the Church of England\n* The slightly modernized form used in the 1928 version of the Prayer Book of the Episcopal Church in the United States of America (along with the doxology) and in the English vernacular translation of the Catholic Mass\n* The 1988 translation of the ecumenical English Language Liturgical Consultation (ELLC)\nThe square brackets in three of the texts below indicate the doxology often added at the end of the prayer by Protestants and, in a slightly different form, by the Byzantine Rite (\"For thine is the kingdom and the power and the glory: of the Father, and of the Son, and of the Holy Spirit, now and ever, and unto ages of ages. Amen.\"In Greek: ), among whom the prayer proper is usually recited by the cantors and congregation in unison, and the doxology by the priest as the conclusion of the prayer. The Anglican Book of Common Prayer adds it in some services but not in all. Older English translations of the Bible, based on late Byzantine Greek manuscripts, included it, but it is excluded in critical editions of the New Testament, such as that of the United Bible Societies. It is absent in the oldest manuscripts and is not considered to be part of the original text of Matthew 6:9–13. The Catholic Church has never attached it to the Lord's Prayer, but has included it in the Roman Rite Mass as revised in 1969, not as part of the Our Father but separated from it by a prayer called the embolism spoken or sung by the priest (in the official ICEL English translation: \"Deliver us, Lord, we pray, from every evil, graciously grant peace in our days, that, by the help of your mercy, we may be always free from sin and safe from all distress, as we await the blessed hope and the coming of our Saviour, Jesus Christ.\") that elaborates on the final petition, \"Deliver us from evil.\" For more information on this doxology, see Doxology, below. When Reformers set out to translate the King James Bible, they assumed that a Greek manuscript they possessed was ancient and therefore adopted the phrase \"For thine is the kingdom, the power, and the glory forever\" into the Lord’s Prayer. Later scholarship demonstrated that the manuscript was actually a late addition based on Eastern liturgical tradition.\n\n1928 Episcopal BCP (with doxology); Catholic version (without doxology)[http://www.vatican.va/archive/ccc_css/archive/catechism/p4s2.htm#SECTION%20TWO%20THE%20LORDS%20PRAYER%20OUR%20FATHER!» Catechism of the Catholic Church]\n\nOur Father who art in heaven,\nHallowed be thy name.\nThy kingdom come.\nThy will be done\non earth as it is in heaven.\nGive us this day our daily bread,\nand forgive us our trespasses,\nas we forgive those who trespass against us,\nand lead us not into temptation,\nbut deliver us from evil.\n\n[The 1928 BCP adds:\nFor thine is the kingdom,\nand the power, and the glory,\nfor ever and ever\nAmen.]\n\n1662 Anglican BCP\n\nOur Father, which art in heaven,\nHallowed be thy Name;\nThy kingdom come;\nThy will be done\nin earth, as it is in heaven:\nGive us this day our daily  bread;\nAnd forgive us our trespasses,\nas we forgive them that trespass against us;\nAnd lead us not into temptation,\nBut deliver us from evil:\nWhen before the Collect the priest alone recites the prayer, the people here respond: Amen.\nWhen after all have communicated the people repeat each petition after the priest, the prayer ends:\nFor thine is the kingdom,\nthe power, and the glory,\nFor ever and ever.\nAmen.\n\n1988 ELLC[https://web.archive.org/web/20131029201315/http://www.englishtexts.org/praying.pdf Praying Together]\n\nOur Father in heaven,\n:hallowed be your name,\n:your kingdom come,\n:your will be done,\n::on earth as in heaven.\nGive us today our daily bread.\nForgive us our sins\n:as we forgive those who sin against us.\nSave us from the time of trial\n:and deliver us from evil.\nFor the kingdom, the power, and the glory are yours\n:now and for ever. Amen.\n\nOther English translations are also used.\n\nThough Matthew 6:12 uses the term debts, the older English versions of the Lord's Prayer uses the term trespasses, while ecumenical versions often use the term sins. The latter choice may be due to , which uses the word sins, while the former may be due to  (immediately after the text of the prayer), where Jesus speaks of trespasses. As early as the third century, Origen of Alexandria used the word trespasses () in the prayer. Although the Latin form that was traditionally used in Western Europe has debita (debts), most English-speaking Christians (except Scottish Presbyterians and some others of the Reformed tradition) use trespasses. The Presbyterian Church (U.S.A.), the Established Presbyterian Church of Scotland as well as the Congregational denomination follow the version found in Matthew 6 in the Authorized Version (known also as the King James Version), which in the prayer uses the words \"debts\" and \"debtors\".\n\nAll these versions are based on the text in Matthew, rather than Luke, of the prayer given by Jesus:\n\n (ESV)\n\n\"Pray then like this: 'Our Father in heaven, hallowed be your name. Your kingdom come, your will be done, on earth as it is in heaven. Give us this day our daily bread, and forgive us our debts, as we also have forgiven our debtors. And lead us not into temptation, but deliver us from evil.'\"\n\n (ESV)\n\nAnd he said to them, \"When you pray, say: 'Father, hallowed be your name. Your kingdom come. Give us each day our daily bread, and forgive us our sins, for we ourselves forgive everyone who is indebted to us. And lead us not into temptation.'\"\n\nAnalysis\n\nSubheadings use 1662 Book of Common Prayer (BCP) (see above)\n\nIntroduction\n\n\"Our Father, which art in heaven\"\n\nThis explains that God, the Father, rests in Heaven, and the plural word \"Our\" indicates that there are a group of God's children who call him Father.\n\nAugustine interpreted \"heaven\" (coelum, sky) in this context as meaning \"in the hearts of the righteous, as it were in His holy temple\".[http://www.newadvent.org/fathers/16012.htm Augustine, On the Sermon on the Mount, Book II, Chapter 5, 17–18]; [http://www.augustinus.it/latino/montagna/index2.htm original text]\n\nFirst Petition\n\n\"Hallowed be thy Name;\"\n\nFormer Archbishop of Canterbury Rowan Williams explains this phrase as a petition that people may look upon God's name as holy, as something that inspires awe and reverence, and that they may not trivialize it by making God a tool for their purposes, to \"put other people down, or as a sort of magic to make themselves feel safe\". He sums up the meaning of the phrase by saying: \"Understand what you're talking about when you're talking about God, this is serious, this is the most wonderful and frightening reality that we could imagine, more wonderful and frightening than we can imagine.\"[http://www.bbc.co.uk/religion/religions/christianity/prayer/lordsprayer_1.shtml Rowan Williams, The Lord's Prayer]\n\nSecond Petition\n\n\"Thy kingdom come;\"\n\n\"This petition has its parallel in the Jewish prayer, 'May he establish his Kingdom during your life and during your days.'G. Dalman, The Words of Jesus (1909), 99. As cited in G. E. Ladd, The Presence of the Future (Grand Rapids: Eerdmans 1974), 137 In the gospels Jesus speaks frequently of God's kingdom, but never defines the concept: \"He assumed this was a concept so familiar that it did not require definition.\"George Eldon Ladd, The Presence of the Future: The Eschatology of Biblical Realism, Eerdmans (Grand Rapids: 1974), 45. Concerning how Jesus' audience in the gospels would have understood him, G. E. Ladd turns to the concept's Hebrew Biblical background: \"The Hebrew word malkuth [...] refers first to a reign, dominion, or rule and only secondarily to the realm over which a reign is exercised. [...] When malkuth is used of God, it almost always refers to his authority or to his rule as the heavenly King.\"George Eldon Ladd, The Presence of the Future: The Eschatology of Biblical Realism, Eerdmans (Grand Rapids: 1974), 46–47.  This petition looks to the perfect establishment of God's rule in the world in the future, an act of God resulting in the eschatological order of the new age.G. E. Ladd, The Presence of the Future (Grand Rapids: Eerdmans 1974), 136–137\n\nThe request for God's kingdom to come is commonly interpreted at the most literal level: as a reference to the belief, common at the time, that a Messiah figure would bring about a kingdom of God. Traditionally, the coming of God's kingdom is seen as a divine gift to be prayed for, not a human achievement. This idea is frequently challenged by groups who believe that the Kingdom will come by the hands of those faithful who work for a better world. These believe that Jesus' commands to feed the hungry and clothe the needy are the kingdom to which he was referring.\n\nHilda C. Graef notes that the operative Greek word, basileia, means both kingdom and kingship (i.e., reign, dominion, governing, etc.), but that the English word kingdom loses this double meaning.Hilda C. Graef, St. Gregory of Nyssa: The Lord's Prayer and the Beatitudes (Ancient Christin Writers, No. 18), Paulist Press (New York: 1954), n.68, p. 187. Kingship adds a psychological meaning to the petition: one is also praying for the condition of soul where one follows God's will.\n\nThird Petition\n\n\"Thy will be done in earth, as it is in heaven:\"\n\nJohn Ortberg interprets this phrase as follows: “Many people think our job is to get my afterlife destination taken care of, then tread water till we all get ejected and God comes back and torches this place. But Jesus never told anybody—neither his disciples nor us—to pray, 'Get me out of here so I can go up there.' His prayer was, 'Make up there come down here.' Make things down here run the way they do up there.”Ortberg, John Ortberg. “God is Closer Than You Think”. Zondervan,2005, p.176. The request that “thy will be done” is God’s invitation to “join him in making things down here the way they are up there.”\n\nFourth Petition\n\n\"Give us this day our daily (epiousios) bread;\"\n\nAs mentioned earlier in this article, the original word  (epiousios), commonly characterized as daily, is unique to the Lord's Prayer in all of ancient Greek literature. The word is almost a hapax legomenon, occurring only in Luke and Matthew's versions of the Lord's Prayer, and nowhere else in any other extant Greek texts. While epiousios is often substituted by the word \"daily,\" all other New Testament translations from the Greek into \"daily\" otherwise reference hemeran (ἡμέραν, \"the day\"), which does not appear in this usage.The New Greek-English Interlinear New Testament, 1993, The United Bible Societies, (basis:  UBS4 Greek text), page x of Introduction\n\nVia linguistic parsing, Jerome translated \"ἐπιούσιον\" (epiousios) as \"supersubstantialem\" in the Gospel of Matthew, but chose \"cotidianum\" (\"daily\") in the Gospel of Luke. This wide-ranging difference with respect to meaning of epiousios is discussed in detail in the current Catechism of the Catholic Church by way of an inclusive approach toward tradition as well as a literal one for meaning:  \"Taken in a temporal sense, this word is a pedagogical repetition of \"this day,\" to confirm us in trust \"without reservation.\"  Taken in the qualitative sense, it signifies what is necessary for life, and more broadly every good thing sufficient for subsistence. Taken literally (epi-ousios: \"super-essential\"), it refers directly to the Bread of Life, the Body of Christ, the \"medicine of immortality,\" without which we have no life within us.\"\n\nEpiousios is translated as supersubstantialem in the Vulgate () and accordingly as supersubstantial in the Douay-Rheims Bible ().\n\nBarclay M. Newman's A Concise Greek-English Dictionary of the New Testament, published in a revised edition in 2010 by the United Bible Societies has the following entry:\nἐπι|ούσιος, ον (εἰμί) of doubtful meaning, for today; for the coming day; necessary for existenceCf. [https://www.biblesociety.org.uk/uploads/content/shop/files/9783438060198-Greek-Eng-Lex-Concise-Dict.pdf] Barclay M. Newman, A Concise Greek-English Dictionary of the New Testament, Deutsche Bibelgesellschaft, United Bible Societies 2010 . Partial preview]  It thus derives the word from the preposition ἐπί (epi) and the verb εἰμί (eimi), from the latter of which are derived words such as οὐσία (ousia), the range of whose meanings is indicated in A Greek-English Lexicon.[http://www.perseus.tufts.edu/hopper/text?docPerseus:text:1999.04.0057:entry\nou)si/a Henry George Liddell, Robert Scott, A Greek-English Lexicon: οὐσία]\n\nFifth Petition\n\n\"And forgive us our trespasses, as we forgive them that trespass against us;\"\n\nThe Presbyterian and other Reformed churches tend to use the rendering \"forgive us our debts, as we forgive our debtors\". Roman Catholics, Anglicans and Methodists are more likely to say \"trespasses ... those who trespass against us\".Chaignot, Mary Jane. Questions and Answers.  Accessed:11 Feb 2013 The \"debts\" form appears in the first English translation of the Bible, by John Wycliffe in 1395 (Wycliffe spelling \"dettis\"). The \"trespasses\" version appears in the 1526 translation by William Tyndale (Tyndale spelling \"treaspases\"). In 1549 the first Book of Common Prayer in English used a version of the prayer with \"trespasses\". This became the \"official\" version used in Anglican congregations.\n\nAfter the request for bread, Matthew and Luke diverge slightly. Matthew continues with a request for debts to be forgiven in the same manner as people have forgiven those who have debts against them. Luke, on the other hand, makes a similar request about sins being forgiven in the manner of debts being forgiven between people. The word \"debts\" () does not necessarily mean financial obligations, as shown by the use of the verbal form of the same word () in passages such as . The Aramaic word ḥôbâ can mean \"debt\" or \"sin\".[https://books.google.com/books?idfB7YUtXPARUC&pg\nPA2&dqAramaic+debt+sin&hl\nen&saX&ei\nFSRVU-SAG47g7Qb7w4HYCg&redir_escy#v\nonepage&qAramaic%20debt%20sin&f\nfalse] Nathan Eubank, Wages of Cross-Bearing and Debt of Sin (Walter de Gruyter 2013 ), p. 2[https://books.google.com/books?idL8Q9pYmQdVsC&pg\nPA58&dqAramaic+debt+sin&hl\nen&saX&ei\nFSRVU-SAG47g7Qb7w4HYCg&redir_escy#v\nonepage&qAramaic%20debt%20sin&f\nfalse] John S. Kloppenborg, Q, the Earliest Gospel (Westminster John Knox Press 2008 ), p. 58] This difference between Luke's and Matthew's wording could be explained by the original form of the prayer having been in Aramaic. The generally accepted interpretation is thus that the request is for forgiveness of sin, not of supposed loans granted by God.See: Theological Dictionary of the New Testament, edited by Kittel and Friedrich, Abridged in One Volume by Goeoffrey W. Bromiley; William B. Eeerdmans Publishing Company, Grand Rapids, Mich; 1985; Pages 746–750: Gives use of ὸφείλω opheilo (to owe, be under obligation), ὸφειλή opheile (debt, obligation) and two other word forms as used in the New Testament and outside the New Testament, including use in Judaism. Asking for forgiveness from God was a staple of Jewish prayers. It was also considered proper for individuals to be forgiving of others, so the sentiment expressed in the prayer would have been a common one of the time.\n\nAnthony C. Deane, Canon of Worcester Cathedral, suggests that the choice of the word \"ὀφειλήματα\" (debts), rather than \"ἁμαρτίας\" (sins), indicates a reference to failures to use opportunities of doing good. He links this with the parable of the sheep and the goats (also in Matthew's Gospel), in which the grounds for condemnation are not wrongdoing in the ordinary sense but failure to do right, missing opportunities for showing love to others.\n\n\"As we forgive...\". Divergence between Matthew's \"debts\" and Luke's \"sins\" is relatively trivial compared to the impact of the second half of this statement. The verses immediately following the Lord's Prayer, show Jesus teaching that the forgiveness of our sin/debt (by God) is contingent on how we forgive others. Later, Matthew elaborates with Jesus' parable of the unforgiving servant. In this parable, forgiveness from the king (God) is conditional on the servant's forgiveness of a small debt owed to him.\n\nSixth Petition\n\n\"And lead us not into temptation,\"\n\nInterpretations of the penultimate petition of the prayer—not to be led by God into peirasmos—vary considerably. The range of meanings of the Greek word \"πειρασμός\" (peirasmos) is illustrated in New Testament Greek lexicons. In different contexts it can mean temptation, testing, trial, experiment. Although the traditional English translation uses the word \"temptation\" and Carl Jung saw God as actually leading people astray,Jung, Carl, \"Answer to Job\" Christians generally interpret the petition as not contradicting : \"Let no one say when he is tempted, 'I am being tempted by God', for God cannot be tempted with evil, and he himself tempts no one. But each person is tempted when he is lured and enticed by his own desire.\" Some see the petition as an eschatological appeal against unfavourable Last Judgment, a theory supported by the use of the word \"peirasmos\" in this sense in . Others see it as a plea against hard tests described elsewhere in scripture, such as those of Job. and  are respectful challenges for a test to prove the writer's innocence and integrity. It is also read as: \"Do not let us be led (by ourselves, by others, by Satan) into temptations\". Since it follows shortly after a plea for daily bread (i.e., material sustenance), it is also seen as referring to not being caught up in the material pleasures given. A similar phrase appears in  and  in connection with the prayer of Jesus in Gethsemane.Clontz, T.E. and J., \"The Comprehensive New Testament\", Cornerstone Publications (2008), pp. 451–452,  Joseph Smith, the founder of The Church of Jesus Christ of Latter-day Saints, in a translation of the Holy Bible that wasn't completed before his death, used this wording:  \"And suffer us not to be led into temptation\".JST Matthew 6:14\n \nIn 2017, Pope Francis, speaking on the Italian TV channel TV2000, proposed that the wording be changed to \"do not let us fall into temptation\", explaining that \"it is I who fall, it is not God who throws me into temptation\".\n\nSeventh Petition\n\n\"But deliver us from evil:\"\n\nTranslations and scholars are divided over whether the final word here refers to \"evil\" in general or \"the evil one\" (the devil) in particular. In the original Greek, as well as in the Latin translation, the word could be either of neuter (evil in general) or masculine (the evil one) gender. Matthew's version of the prayer appears in the Sermon on the Mount, in earlier parts of which the term is used to refer to general evil. Later parts of Matthew refer to the devil when discussing similar issues. However, the devil is never referred to as the evil one in any known Aramaic sources. While John Calvin accepted the vagueness of the term's meaning, he considered that there is little real difference between the two interpretations, and that therefore the question is of no real consequence. Similar phrases are found in  and .Clontz, p. 452\n\nDoxology\n\n\"For thine is the kingdom, the power, and the glory, For ever and ever. Amen.\"\n\nThe doxology of the prayer is not contained in Luke's version, nor is it present in the earliest manuscripts of Matthew,Nicholas Ayo, The Lord's Prayer: A Survey Theological and Literary, University of Notre Dame Press (1993), p. 7,  representative of the Alexandrian text, although it is present in the manuscripts representative of the later Byzantine text.Clontz, p. 8 Most scholars do not consider it part of the original text of Matthew.David E. Aune, [https://books.google.com/books?idygcgn8h-jo4C&pg\nPA299&dqMatthew+6:13+doxology&hl\nen&eig858TOe9IYf-OYrJkYME&sa\nX&oibook_result&ct\nresult&resnum3&ved\n0CDQQ6AEwAjgK#vonepage&q\nMatthew%206%3A13%20doxology&ffalse The Blackwell Companion to the New Testament] (Blackwell 2010 ), p. 299.Kurt Aland and Barbara Aland, [https://books.google.com/books?id\n2pYDsAhUOxAC&pgPA306&lpg\nPA306&dqMatthew+6:13+doxology&source\nbl&otsbe-w5dMsBq&sig\nLlEe0u8PhSfxqUfeeeKkt757CbQ&hlen&ei\nbTN9TMWSAZH_4AbXzNyWBg&saX&oi\nbook_result&ctresult&resnum\n10&ved0CC8Q6AEwCTge#v\nonepage&qMatthew%206%3A13%20doxology&f\nfalse The Text of the New Testament] (Eerdmans 1998 ), p. 306. New translations generally omit it.The doxology is not included in the following modern translations: [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nASV American Standard Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nCEV Contemporary English Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nESV English Standard Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nGW GOD'S WORD Translation] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nGNT Good News Translation] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNIRV New International Reader's Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNIV New International Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNLT New Living Translation] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nTNIV Today's New International Version.] It is enclosed in square brackets in [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nHCSB Holman Christian Standard Bible] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNASB New American Standard Bible] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNCV New Century Version.] Two publications that are updates of the Authorized King James Version rather than new translations keep it: [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nKJ21 21st Century King James Version] and [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNKJV New King James Version;] but the second of these adds a note: \" \"NU-Text omits For Yours through Amen.\"\n\nThe first known use of the doxology, in a less lengthy form (\"for yours is the power and the glory forever\"), as a conclusion for the Lord's Prayer (in a version slightly different from that of Matthew) is in the Didache, 8:2. It has similarities with —\"Yours, O LORD, is the greatness and the power and the glory and the victory and the majesty, for all that is in the heavens and in the earth is yours. Yours is the kingdom, O LORD, and you are exalted as head above all.\" In the Byzantine Rite, a similar doxology is sung within the context of the Divine Liturgy. Following the last line of the prayer, the priest sings \"For thine is the kingdom and the power and the glory, of the Father, and of the Son, and of the Holy Spirit, now and ever and unto ages of ages.\"\n\nLatin Church Roman Catholics do not use the doxology when reciting the Lord's Prayer, because it is not part of their received liturgical tradition and is not found in the Latin Vulgate of St. Jerome. Since 1970 it is included in the Roman Rite Mass as an independent item, not as part of the Lord's Prayer. The Anglican Book of Common Prayer sometimes gives the Lord's Prayer with the doxology, sometimes without.For instance, in [http://www.churchofengland.org/prayer-worship/worship/texts/principal-services/word/mornevebcp/morningbcp.aspx Morning Prayer] the doxology is included in the Lord's Prayer in the Introduction, but not in the Prayers after the Apostles' Creed. Most Protestants append it to the Lord's Prayer.\n\nUse as a language comparison tool\n\nIn the course of Christianization, one of the first texts to be translated between many languages has historically been the Lord's Prayer, long before the full Bible would be translated into the respective languages.\nSince the 16th century, collections of translations of the prayer have often been used for a quick comparison of languages.\n\nThe first such collection, with 22 versions, was Mithridates de differentis linguis by Conrad Gessner (1555; the title refers to Mithridates VI of Pontus who according to Pliny the Elder was an exceptional polyglot).\n\nGessner's idea of collecting translations of the prayer was taken up by authors of the 17th century, including Hieronymus Megiserus (1603) and Georg Pistorius (1621).\nThomas Lüdeken in 1680 published an enlarged collection of 83 versions of the prayer, of which three were in fictional philosophical languages.\nLüdeken quotes as a Barnum Hagius as his source for the exotic scripts used, while their true (anonymous) author was Andreas Müller.\nIn 1700, Lübeck's collection was re-edited by B. Mottus as Oratio dominica plus centum linguis versionibus aut characteribus reddita et expressa.\nThis edition was comparatively inferior, but a second, revised edition was published in 1715 by John Chamberlain.\nThis 1715 edition was used by Gottfried Hensel in his Synopsis Universae Philologiae (1741) to compile \"geographico-polyglot maps\" where the beginning of the prayer was shown in the geographical area where the respective languages were spoken.\nJohann Ulrich Kraus also published a collection with more than 100 entries.Augustin Backer, Alois Backer, Bibliothèque des écrivains de la compagnie de Jésus ou notices bibliographiques, vol. 5, 1839, [https://books.google.com/books?idhElDAAAAcAAJ&pg\nPA304 304f.]\n\nThese collections continued to be improved and expanded well into the 19th century; Johann Christoph Adelung and Johann Severin Vater in 1806–1817 published the prayer in \"well-nigh five hundred languages and dialects\".Mithridates oder allgemeine Sprachenkunde mit dem Vater Unser als Sprachprobe in bey nahe fünf hundert Sprachen und Mundarten, 1806–1817, Berlin, Vossische Buchlandlung, 4 volumes. Facsimile edition, Hildesheim-Nueva York, Georg Olms Verlag, 1970.\n\nSamples of scripture, including the Lord's Prayer, were published in 52 oriental languages, most of them not previously found in such collections, translated by the brethren of the Serampore Mission and printed at the mission press there in 1818.\n\nRelation to Jewish prayer\n\nThere are similarities between the Lord's Prayer and both biblical and post-biblical material in Jewish prayer especially Kiddushin 81a (Babylonian).Clontz, p. 451 \"Hallowed be thy name\" is reflected in the Kaddish. \"Lead us not into sin\" is echoed in the \"morning blessings\" of Jewish prayer. A blessing said by some Jewish communities after the evening Shema includes a phrase quite similar to the opening of the Lord's Prayer: \"Our God in heaven, hallow thy name, and establish thy kingdom forever, and rule over us for ever and ever. Amen.\" There are parallels also in .Clontz, pp. 8, 451\n\nRabbi Aron Mendes Chumaceiro has said\"Verdediging is geen aanval\" pp. 121–122 that nearly all the elements of the prayer have counterparts in the Jewish Bible and Deuterocanonical books: the first part in  (\"Look down from heaven and see, from your holy and beautiful habitation ... For you are our Father ...\") and  (\"I will vindicate the holiness of my great name ...\") and  (\"I will show my greatness and my holiness and make myself known in the eyes of many nations ...\"), the second part in  (\"Saviours shall go up to Mount Zion to rule Mount Esau, and the kingdom shall be the LORD's\") and  (\"... It is the LORD. Let him do what seems good to him\"), the third part in  (\"... feed me with my apportioned bread\"), the fourth part in  (\"Forgive your neighbour the wrong he has done, and then your sins will be pardoned when you pray\"). \"Deliver us from evil\" can be compared with  (\"... let no iniquity get dominion over me.\"). Chumaceiro says that, because the idea of God leading a human into temptation contradicts the righteousness and love of God, \"Lead us not into temptation\" has no counterpart in the Jewish Bible/Christian Old Testament.\n\nThe word \"πειρασμός\", which is translated as \"temptation\", could also be translated as \"test\" or \"trial\", making evident the attitude of someone's heart. Well-known examples in the Old Testament are God's test of Abraham (), his \"moving\" (the Hebrew word means basically \"to prick, as by weeds, thorns\") David to do (numbering Israel) what David later acknowledged as sin (; see also ), and the Book of Job.\n\nMusical settings \n\nIn modern times, various composers have incorporated The Lord's Prayer into a musical setting for utilization during liturgical services for a variety of religious traditions as well as interfaith ceremonies.  Included among them are:\n\n* Chris M. Allport — The Lord's Prayer (2016) Music and additional text by Chris M. Allport\n* Albert Hay Malotte — The Lord's Prayer \n* Sergei Rachmaninoff — Otche Nash (Отче наш; Liturgy of St. John Chrysostom, op. 31, 1910)\n* Nikolai Rimsky-Korsakov — Otche Nash (1883)\n* John Serry Sr. — The Lord's Prayer (for Organ & Chorus, 1992)Library of Congress Copyright Office.The Lord's Prayer, Composer: John Serry Sr., September 2, 1992, #PAU 1-665-838  \n* Igor Stravinsky — Otche Nash (1926), arr. Pater Noster (Latin, some time later) \n* Pyotr Ilyich Tchaikovsky — Otche Nash (Отче наш; Liturgy of St. John Chrysostom, op. 41, 1878)\n* Christopher Tin — Baba Yetu (2005)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lord's Prayer" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18494" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Lord's Prayer (also called the Our Father or Pater Noster, among other names) is a venerated Christian prayer that, according to the New Testament, Jesus taught as the way to pray.\"Pray then in this way\" (Matthew 6:9 NRSV); \"When you pray, say\" (Luke 11:2 NRSV) Two versions of this prayer are recorded: the long form in the Gospel of Matthew in the middle of the Sermon on the Mount, and the short form in the Gospel of Luke when \"one of his disciples said to him, 'Lord, teach us to pray, as John taught his disciples.'\"Luke 11:1 NRSV\n\nThe first three of the seven petitions in Matthew address God; the other four are related to human needs and concerns. The Matthew account alone includes the \"Your will be done\" and the \"Rescue us from the evil one\" (or \"Deliver us from evil\") petitions. Both original Greek texts contain the adjective epiousios, which does not appear in any other classical or Koine Greek literature; while controversial, \"daily\" has been the most common English-language translation of this word. Some Christians, particularly Protestants, conclude the prayer with a doxology, a later addendum appearing in some manuscripts of Matthew.\n\n[https://www.biblegateway.com/passage/?searchmat+6%3A9-13&version\nNRSV Matthew 6:9-13] (NRSV)\nOur Father in heaven, hallowed be your name. Your kingdom come. Your will be done, on earth as it is in heaven. Give us this day our daily bread. And forgive us our debts, as we also have forgiven our debtors. And do not bring us to the time of trial, but rescue us from the evil one.\n\n[https://www.biblegateway.com/passage/?searchLuke+11%3A2-4&version\nNRSV Luke 11:2-4] (NRSV)\nFather, hallowed be your name. Your kingdom come. Give us each day our daily bread. And forgive us our sins, for we ourselves forgive everyone indebted to us. And do not bring us to the time of trial.\n\nInitial words on the topic from the Catechism of the Catholic Church teach that it \"is truly the summary of the whole gospel.\" The prayer is used by most Christian churches in their worship; with few exceptions, the liturgical form is the Matthean. Although theological differences and various modes of worship divide Christians, according to Fuller Seminary professor Clayton Schmit, \"there is a sense of solidarity in knowing that Christians around the globe are praying together ... and these words always unite us.\"Kang, K. Connie. \"Across the globe, Christians are united by Lord's Prayer.\" Los Angeles Times, in Houston Chronicle, p. A13, April 8, 2007 \n\nIn biblical criticism, the prayer's absence in the Gospel of Mark together with its occurrence in Matthew and Luke has caused scholars who accept the two-source hypothesis (against other document hypotheses) to conclude that it is probably a logion original to Q.Farmer, William R., [https://books.google.com/books?idKkO4qzxHrsEC&pg\nPA49 The Gospel of Jesus: The Pastoral Relevance of the Synoptic Problem], Westminster John Knox Press (1994), p. 49, \n\nText\n\nOriginal Greek text and Vulgate Latin translation\n\nStandard edition of Greek textThe [http://www.nestle-aland.com/en/read-na28-online/text/bibeltext/lesen/stelle/50/60001/69999/ text] given here is that of the latest edition of Greek New Testament of the United Bible Societies and in the Nestle-Aland Novum Testamentum Graece. Most modern translations use a text similar to this one. Most older translations are based on a Byzantine-type text with ἐπὶ τῆς γῆς in line 5 (verse 10) instead of ἐπὶ γῆς, and ἀφίεμεν in line 8 (verse 12) instead of ἀφήκαμεν, and adding at the end (verse 13) the doxology ὅτι σοῦ ἐστιν ἡ βασιλεία καὶ ἡ δύναμις καὶ ἡ δόξα εἰς τοὺς αἰῶνας. ἀμήν.\n\nVulgate Latin translation[http://www.sacredbible.org/articles/Matthew-Latin3.htm Three editions of the Vulgate]: the Clementine edition of the Vulgate, which varies from the [http://www.vatican.va/archive/bible/nova_vulgata/documents/nova-vulgata_nt_evang-matthaeum_lt.html Nova Vulgata] only in punctuation and in having \"ne nos inducas\" in place of \"ne inducas nos\", and another edition of the Vulgate, which has \"qui in caelis es\" in place of \"qui es in caelis\"; \"veniat\" in place of \"adveniat\"; \"dimisimus\" in place of \"dimittimus\"; \"temptationem\" in place of \"tentationem\".\n\nPater noster, qui es in caelis,\nsanctificetur nomen tuum,\nadveniat regnum tuum,\nfiat voluntas tua,\nsicut in caelo, et in terra.\nPanem nostrum supersubstantialem da nobis hodie;\net dimitte nobis debita nostra,\nsicut et nos dimittimus debitoribus nostris;\net ne inducas nos in tentationem;\nsed libera nos a Malo.In the Nova Vulgata, the official Latin Bible of the Catholic Church, the last word is capitalized, indicating that it is a reference to Malus (the Evil One), not to malum (evil).The doxology associated with the Lord's Prayer in Byzantine Greek texts is found in four Vetus Latina manuscripts, only two of which give it in its entirety. The other surviving manuscripts of the Vetus Latina Gospels do not have the doxology. The Vulgate translation also does not include it, thus agreeing with critical editions of the Greek text.\n\nLiturgical Greek and Latin texts \n\nPatriarchal Edition 1904\nThe Greek Orthodox Church uses a slightly different Greek version. which can be found in the Divine Liturgy of St. John Chrysostom ([http://www.goarch.org/chapel/liturgical_texts/liturgy-el] Greek Orthodox Liturgy of St. John Chrysostom]), as presented in the [http://www.goarch.org/chapel/biblegreek] 1904 text of the Ecumenical Patriarchate of Constantinople] and various Greek prayer books and liturgies. This is the Greek version of the Lord's Prayer most widely used for prayer and liturgy today, and is similar to other texts of the Byzantine text-type used in older English Bible translations, with ἐπὶ τῆς γῆς instead of ἐπὶ γῆς on line 5 and ἀφίεμεν instead of ἀφήκαμεν (present rather than aorist tense) in line 8. The last part, ὅτι σοῦ ἐστιν ἡ βασιλεία καὶ ἡ δύναμις καὶ ἡ δόξα εἰς τοὺς αἰῶνας· ἀμήν, is said by the priest after the prayer.\n\nRoman Missal[https://www.scribd.com/doc/20881056/Missale-Romanum-2002 2002 edition]; [http://media.musicasacra.com/pdf/missale62.pdf 1962 edition, pp. 312−313]The version of the Lord's Prayer most familiar to Christians until the Protestant Reformation, and beyond for Catholics, is that in the Roman Missal, which has had cultural and historical importance for most regions where English is spoken. The text is used in the Roman Rite liturgy (Mass, Liturgy of the Hours, etc.). It differs from the Vulgate in having cotidianum in place of supersubstantialem. It does not add the Byzantine doxology: this is never joined immediately to the Lord's Prayer in the Latin liturgy or the Latin Bible, but it appears, in the form quia tuum est regnum, et potestas, et gloria, in saecula, in the Mass of the Roman Rite, as revised in 1969, separated from the Lord's Prayer by the prayer, Libera nos, quaesumus... (the embolism), which elaborates on the final petition, libera nos a malo (deliver us from evil). Others have translated the Byzantine doxology into Latin as quia tuum est regnum; et potentia et gloria; per omnia saecula or in saecula saeculorum.\nPater noster, qui es in caelis:\nsanctificetur nomen tuum;\nadveniat regnum tuum;\nfiat voluntas tua, sicut in caelo, et in terra.\nPanem nostrum cotidianumIn editions of the Roman Missal prior to that of 1962 (the edition of Pope John XXIII) the word cotidianum was spelled quotidianum. da nobis hodie;\net dimitte nobis debita nostra,\nsicut et nos dimittimus debitoribus nostris;\net ne nos inducas in tentationem;\nsed libera nos a malo.\n\nEnglish versions\n\nThere are several different English translations of the Lord's Prayer from Greek or Latin, beginning around AD 650 with the Northumbrian translation. Of those in current liturgical use, the three best-known are:\n* The translation in the 1662 Anglican Book of Common Prayer (BCP) of the Church of England\n* The slightly modernized form used in the 1928 version of the Prayer Book of the Episcopal Church in the United States of America (along with the doxology) and in the English vernacular translation of the Catholic Mass\n* The 1988 translation of the ecumenical English Language Liturgical Consultation (ELLC)\nThe square brackets in three of the texts below indicate the doxology often added at the end of the prayer by Protestants and, in a slightly different form, by the Byzantine Rite (\"For thine is the kingdom and the power and the glory: of the Father, and of the Son, and of the Holy Spirit, now and ever, and unto ages of ages. Amen.\"In Greek: ), among whom the prayer proper is usually recited by the cantors and congregation in unison, and the doxology by the priest as the conclusion of the prayer. The Anglican Book of Common Prayer adds it in some services but not in all. Older English translations of the Bible, based on late Byzantine Greek manuscripts, included it, but it is excluded in critical editions of the New Testament, such as that of the United Bible Societies. It is absent in the oldest manuscripts and is not considered to be part of the original text of Matthew 6:9–13. The Catholic Church has never attached it to the Lord's Prayer, but has included it in the Roman Rite Mass as revised in 1969, not as part of the Our Father but separated from it by a prayer called the embolism spoken or sung by the priest (in the official ICEL English translation: \"Deliver us, Lord, we pray, from every evil, graciously grant peace in our days, that, by the help of your mercy, we may be always free from sin and safe from all distress, as we await the blessed hope and the coming of our Saviour, Jesus Christ.\") that elaborates on the final petition, \"Deliver us from evil.\" For more information on this doxology, see Doxology, below. When Reformers set out to translate the King James Bible, they assumed that a Greek manuscript they possessed was ancient and therefore adopted the phrase \"For thine is the kingdom, the power, and the glory forever\" into the Lord’s Prayer. Later scholarship demonstrated that the manuscript was actually a late addition based on Eastern liturgical tradition.\n\n1928 Episcopal BCP (with doxology); Catholic version (without doxology)[http://www.vatican.va/archive/ccc_css/archive/catechism/p4s2.htm#SECTION%20TWO%20THE%20LORDS%20PRAYER%20OUR%20FATHER!» Catechism of the Catholic Church]\n\nOur Father who art in heaven,\nHallowed be thy name.\nThy kingdom come.\nThy will be done\non earth as it is in heaven.\nGive us this day our daily bread,\nand forgive us our trespasses,\nas we forgive those who trespass against us,\nand lead us not into temptation,\nbut deliver us from evil.\n\n[The 1928 BCP adds:\nFor thine is the kingdom,\nand the power, and the glory,\nfor ever and ever\nAmen.]\n\n1662 Anglican BCP\n\nOur Father, which art in heaven,\nHallowed be thy Name;\nThy kingdom come;\nThy will be done\nin earth, as it is in heaven:\nGive us this day our daily  bread;\nAnd forgive us our trespasses,\nas we forgive them that trespass against us;\nAnd lead us not into temptation,\nBut deliver us from evil:\nWhen before the Collect the priest alone recites the prayer, the people here respond: Amen.\nWhen after all have communicated the people repeat each petition after the priest, the prayer ends:\nFor thine is the kingdom,\nthe power, and the glory,\nFor ever and ever.\nAmen.\n\n1988 ELLC[https://web.archive.org/web/20131029201315/http://www.englishtexts.org/praying.pdf Praying Together]\n\nOur Father in heaven,\n:hallowed be your name,\n:your kingdom come,\n:your will be done,\n::on earth as in heaven.\nGive us today our daily bread.\nForgive us our sins\n:as we forgive those who sin against us.\nSave us from the time of trial\n:and deliver us from evil.\nFor the kingdom, the power, and the glory are yours\n:now and for ever. Amen.\n\nOther English translations are also used.\n\nThough Matthew 6:12 uses the term debts, the older English versions of the Lord's Prayer uses the term trespasses, while ecumenical versions often use the term sins. The latter choice may be due to , which uses the word sins, while the former may be due to  (immediately after the text of the prayer), where Jesus speaks of trespasses. As early as the third century, Origen of Alexandria used the word trespasses () in the prayer. Although the Latin form that was traditionally used in Western Europe has debita (debts), most English-speaking Christians (except Scottish Presbyterians and some others of the Reformed tradition) use trespasses. The Presbyterian Church (U.S.A.), the Established Presbyterian Church of Scotland as well as the Congregational denomination follow the version found in Matthew 6 in the Authorized Version (known also as the King James Version), which in the prayer uses the words \"debts\" and \"debtors\".\n\nAll these versions are based on the text in Matthew, rather than Luke, of the prayer given by Jesus:\n\n (ESV)\n\n\"Pray then like this: 'Our Father in heaven, hallowed be your name. Your kingdom come, your will be done, on earth as it is in heaven. Give us this day our daily bread, and forgive us our debts, as we also have forgiven our debtors. And lead us not into temptation, but deliver us from evil.'\"\n\n (ESV)\n\nAnd he said to them, \"When you pray, say: 'Father, hallowed be your name. Your kingdom come. Give us each day our daily bread, and forgive us our sins, for we ourselves forgive everyone who is indebted to us. And lead us not into temptation.'\"\n\nAnalysis\n\nSubheadings use 1662 Book of Common Prayer (BCP) (see above)\n\nIntroduction\n\n\"Our Father, which art in heaven\"\n\nThis explains that God, the Father, rests in Heaven, and the plural word \"Our\" indicates that there are a group of God's children who call him Father.\n\nAugustine interpreted \"heaven\" (coelum, sky) in this context as meaning \"in the hearts of the righteous, as it were in His holy temple\".[http://www.newadvent.org/fathers/16012.htm Augustine, On the Sermon on the Mount, Book II, Chapter 5, 17–18]; [http://www.augustinus.it/latino/montagna/index2.htm original text]\n\nFirst Petition\n\n\"Hallowed be thy Name;\"\n\nFormer Archbishop of Canterbury Rowan Williams explains this phrase as a petition that people may look upon God's name as holy, as something that inspires awe and reverence, and that they may not trivialize it by making God a tool for their purposes, to \"put other people down, or as a sort of magic to make themselves feel safe\". He sums up the meaning of the phrase by saying: \"Understand what you're talking about when you're talking about God, this is serious, this is the most wonderful and frightening reality that we could imagine, more wonderful and frightening than we can imagine.\"[http://www.bbc.co.uk/religion/religions/christianity/prayer/lordsprayer_1.shtml Rowan Williams, The Lord's Prayer]\n\nSecond Petition\n\n\"Thy kingdom come;\"\n\n\"This petition has its parallel in the Jewish prayer, 'May he establish his Kingdom during your life and during your days.'G. Dalman, The Words of Jesus (1909), 99. As cited in G. E. Ladd, The Presence of the Future (Grand Rapids: Eerdmans 1974), 137 In the gospels Jesus speaks frequently of God's kingdom, but never defines the concept: \"He assumed this was a concept so familiar that it did not require definition.\"George Eldon Ladd, The Presence of the Future: The Eschatology of Biblical Realism, Eerdmans (Grand Rapids: 1974), 45. Concerning how Jesus' audience in the gospels would have understood him, G. E. Ladd turns to the concept's Hebrew Biblical background: \"The Hebrew word malkuth [...] refers first to a reign, dominion, or rule and only secondarily to the realm over which a reign is exercised. [...] When malkuth is used of God, it almost always refers to his authority or to his rule as the heavenly King.\"George Eldon Ladd, The Presence of the Future: The Eschatology of Biblical Realism, Eerdmans (Grand Rapids: 1974), 46–47.  This petition looks to the perfect establishment of God's rule in the world in the future, an act of God resulting in the eschatological order of the new age.G. E. Ladd, The Presence of the Future (Grand Rapids: Eerdmans 1974), 136–137\n\nThe request for God's kingdom to come is commonly interpreted at the most literal level: as a reference to the belief, common at the time, that a Messiah figure would bring about a kingdom of God. Traditionally, the coming of God's kingdom is seen as a divine gift to be prayed for, not a human achievement. This idea is frequently challenged by groups who believe that the Kingdom will come by the hands of those faithful who work for a better world. These believe that Jesus' commands to feed the hungry and clothe the needy are the kingdom to which he was referring.\n\nHilda C. Graef notes that the operative Greek word, basileia, means both kingdom and kingship (i.e., reign, dominion, governing, etc.), but that the English word kingdom loses this double meaning.Hilda C. Graef, St. Gregory of Nyssa: The Lord's Prayer and the Beatitudes (Ancient Christin Writers, No. 18), Paulist Press (New York: 1954), n.68, p. 187. Kingship adds a psychological meaning to the petition: one is also praying for the condition of soul where one follows God's will.\n\nThird Petition\n\n\"Thy will be done in earth, as it is in heaven:\"\n\nJohn Ortberg interprets this phrase as follows: “Many people think our job is to get my afterlife destination taken care of, then tread water till we all get ejected and God comes back and torches this place. But Jesus never told anybody—neither his disciples nor us—to pray, 'Get me out of here so I can go up there.' His prayer was, 'Make up there come down here.' Make things down here run the way they do up there.”Ortberg, John Ortberg. “God is Closer Than You Think”. Zondervan,2005, p.176. The request that “thy will be done” is God’s invitation to “join him in making things down here the way they are up there.”\n\nFourth Petition\n\n\"Give us this day our daily (epiousios) bread;\"\n\nAs mentioned earlier in this article, the original word  (epiousios), commonly characterized as daily, is unique to the Lord's Prayer in all of ancient Greek literature. The word is almost a hapax legomenon, occurring only in Luke and Matthew's versions of the Lord's Prayer, and nowhere else in any other extant Greek texts. While epiousios is often substituted by the word \"daily,\" all other New Testament translations from the Greek into \"daily\" otherwise reference hemeran (ἡμέραν, \"the day\"), which does not appear in this usage.The New Greek-English Interlinear New Testament, 1993, The United Bible Societies, (basis:  UBS4 Greek text), page x of Introduction\n\nVia linguistic parsing, Jerome translated \"ἐπιούσιον\" (epiousios) as \"supersubstantialem\" in the Gospel of Matthew, but chose \"cotidianum\" (\"daily\") in the Gospel of Luke. This wide-ranging difference with respect to meaning of epiousios is discussed in detail in the current Catechism of the Catholic Church by way of an inclusive approach toward tradition as well as a literal one for meaning:  \"Taken in a temporal sense, this word is a pedagogical repetition of \"this day,\" to confirm us in trust \"without reservation.\"  Taken in the qualitative sense, it signifies what is necessary for life, and more broadly every good thing sufficient for subsistence. Taken literally (epi-ousios: \"super-essential\"), it refers directly to the Bread of Life, the Body of Christ, the \"medicine of immortality,\" without which we have no life within us.\"\n\nEpiousios is translated as supersubstantialem in the Vulgate () and accordingly as supersubstantial in the Douay-Rheims Bible ().\n\nBarclay M. Newman's A Concise Greek-English Dictionary of the New Testament, published in a revised edition in 2010 by the United Bible Societies has the following entry:\nἐπι|ούσιος, ον (εἰμί) of doubtful meaning, for today; for the coming day; necessary for existenceCf. [https://www.biblesociety.org.uk/uploads/content/shop/files/9783438060198-Greek-Eng-Lex-Concise-Dict.pdf] Barclay M. Newman, A Concise Greek-English Dictionary of the New Testament, Deutsche Bibelgesellschaft, United Bible Societies 2010 . Partial preview]  It thus derives the word from the preposition ἐπί (epi) and the verb εἰμί (eimi), from the latter of which are derived words such as οὐσία (ousia), the range of whose meanings is indicated in A Greek-English Lexicon.[http://www.perseus.tufts.edu/hopper/text?docPerseus:text:1999.04.0057:entry\nou)si/a Henry George Liddell, Robert Scott, A Greek-English Lexicon: οὐσία]\n\nFifth Petition\n\n\"And forgive us our trespasses, as we forgive them that trespass against us;\"\n\nThe Presbyterian and other Reformed churches tend to use the rendering \"forgive us our debts, as we forgive our debtors\". Roman Catholics, Anglicans and Methodists are more likely to say \"trespasses ... those who trespass against us\".Chaignot, Mary Jane. Questions and Answers.  Accessed:11 Feb 2013 The \"debts\" form appears in the first English translation of the Bible, by John Wycliffe in 1395 (Wycliffe spelling \"dettis\"). The \"trespasses\" version appears in the 1526 translation by William Tyndale (Tyndale spelling \"treaspases\"). In 1549 the first Book of Common Prayer in English used a version of the prayer with \"trespasses\". This became the \"official\" version used in Anglican congregations.\n\nAfter the request for bread, Matthew and Luke diverge slightly. Matthew continues with a request for debts to be forgiven in the same manner as people have forgiven those who have debts against them. Luke, on the other hand, makes a similar request about sins being forgiven in the manner of debts being forgiven between people. The word \"debts\" () does not necessarily mean financial obligations, as shown by the use of the verbal form of the same word () in passages such as . The Aramaic word ḥôbâ can mean \"debt\" or \"sin\".[https://books.google.com/books?idfB7YUtXPARUC&pg\nPA2&dqAramaic+debt+sin&hl\nen&saX&ei\nFSRVU-SAG47g7Qb7w4HYCg&redir_escy#v\nonepage&qAramaic%20debt%20sin&f\nfalse] Nathan Eubank, Wages of Cross-Bearing and Debt of Sin (Walter de Gruyter 2013 ), p. 2[https://books.google.com/books?idL8Q9pYmQdVsC&pg\nPA58&dqAramaic+debt+sin&hl\nen&saX&ei\nFSRVU-SAG47g7Qb7w4HYCg&redir_escy#v\nonepage&qAramaic%20debt%20sin&f\nfalse] John S. Kloppenborg, Q, the Earliest Gospel (Westminster John Knox Press 2008 ), p. 58] This difference between Luke's and Matthew's wording could be explained by the original form of the prayer having been in Aramaic. The generally accepted interpretation is thus that the request is for forgiveness of sin, not of supposed loans granted by God.See: Theological Dictionary of the New Testament, edited by Kittel and Friedrich, Abridged in One Volume by Goeoffrey W. Bromiley; William B. Eeerdmans Publishing Company, Grand Rapids, Mich; 1985; Pages 746–750: Gives use of ὸφείλω opheilo (to owe, be under obligation), ὸφειλή opheile (debt, obligation) and two other word forms as used in the New Testament and outside the New Testament, including use in Judaism. Asking for forgiveness from God was a staple of Jewish prayers. It was also considered proper for individuals to be forgiving of others, so the sentiment expressed in the prayer would have been a common one of the time.\n\nAnthony C. Deane, Canon of Worcester Cathedral, suggests that the choice of the word \"ὀφειλήματα\" (debts), rather than \"ἁμαρτίας\" (sins), indicates a reference to failures to use opportunities of doing good. He links this with the parable of the sheep and the goats (also in Matthew's Gospel), in which the grounds for condemnation are not wrongdoing in the ordinary sense but failure to do right, missing opportunities for showing love to others.\n\n\"As we forgive...\". Divergence between Matthew's \"debts\" and Luke's \"sins\" is relatively trivial compared to the impact of the second half of this statement. The verses immediately following the Lord's Prayer, show Jesus teaching that the forgiveness of our sin/debt (by God) is contingent on how we forgive others. Later, Matthew elaborates with Jesus' parable of the unforgiving servant. In this parable, forgiveness from the king (God) is conditional on the servant's forgiveness of a small debt owed to him.\n\nSixth Petition\n\n\"And lead us not into temptation,\"\n\nInterpretations of the penultimate petition of the prayer—not to be led by God into peirasmos—vary considerably. The range of meanings of the Greek word \"πειρασμός\" (peirasmos) is illustrated in New Testament Greek lexicons. In different contexts it can mean temptation, testing, trial, experiment. Although the traditional English translation uses the word \"temptation\" and Carl Jung saw God as actually leading people astray,Jung, Carl, \"Answer to Job\" Christians generally interpret the petition as not contradicting : \"Let no one say when he is tempted, 'I am being tempted by God', for God cannot be tempted with evil, and he himself tempts no one. But each person is tempted when he is lured and enticed by his own desire.\" Some see the petition as an eschatological appeal against unfavourable Last Judgment, a theory supported by the use of the word \"peirasmos\" in this sense in . Others see it as a plea against hard tests described elsewhere in scripture, such as those of Job. and  are respectful challenges for a test to prove the writer's innocence and integrity. It is also read as: \"Do not let us be led (by ourselves, by others, by Satan) into temptations\". Since it follows shortly after a plea for daily bread (i.e., material sustenance), it is also seen as referring to not being caught up in the material pleasures given. A similar phrase appears in  and  in connection with the prayer of Jesus in Gethsemane.Clontz, T.E. and J., \"The Comprehensive New Testament\", Cornerstone Publications (2008), pp. 451–452,  Joseph Smith, the founder of The Church of Jesus Christ of Latter-day Saints, in a translation of the Holy Bible that wasn't completed before his death, used this wording:  \"And suffer us not to be led into temptation\".JST Matthew 6:14\n \nIn 2017, Pope Francis, speaking on the Italian TV channel TV2000, proposed that the wording be changed to \"do not let us fall into temptation\", explaining that \"it is I who fall, it is not God who throws me into temptation\".\n\nSeventh Petition\n\n\"But deliver us from evil:\"\n\nTranslations and scholars are divided over whether the final word here refers to \"evil\" in general or \"the evil one\" (the devil) in particular. In the original Greek, as well as in the Latin translation, the word could be either of neuter (evil in general) or masculine (the evil one) gender. Matthew's version of the prayer appears in the Sermon on the Mount, in earlier parts of which the term is used to refer to general evil. Later parts of Matthew refer to the devil when discussing similar issues. However, the devil is never referred to as the evil one in any known Aramaic sources. While John Calvin accepted the vagueness of the term's meaning, he considered that there is little real difference between the two interpretations, and that therefore the question is of no real consequence. Similar phrases are found in  and .Clontz, p. 452\n\nDoxology\n\n\"For thine is the kingdom, the power, and the glory, For ever and ever. Amen.\"\n\nThe doxology of the prayer is not contained in Luke's version, nor is it present in the earliest manuscripts of Matthew,Nicholas Ayo, The Lord's Prayer: A Survey Theological and Literary, University of Notre Dame Press (1993), p. 7,  representative of the Alexandrian text, although it is present in the manuscripts representative of the later Byzantine text.Clontz, p. 8 Most scholars do not consider it part of the original text of Matthew.David E. Aune, [https://books.google.com/books?idygcgn8h-jo4C&pg\nPA299&dqMatthew+6:13+doxology&hl\nen&eig858TOe9IYf-OYrJkYME&sa\nX&oibook_result&ct\nresult&resnum3&ved\n0CDQQ6AEwAjgK#vonepage&q\nMatthew%206%3A13%20doxology&ffalse The Blackwell Companion to the New Testament] (Blackwell 2010 ), p. 299.Kurt Aland and Barbara Aland, [https://books.google.com/books?id\n2pYDsAhUOxAC&pgPA306&lpg\nPA306&dqMatthew+6:13+doxology&source\nbl&otsbe-w5dMsBq&sig\nLlEe0u8PhSfxqUfeeeKkt757CbQ&hlen&ei\nbTN9TMWSAZH_4AbXzNyWBg&saX&oi\nbook_result&ctresult&resnum\n10&ved0CC8Q6AEwCTge#v\nonepage&qMatthew%206%3A13%20doxology&f\nfalse The Text of the New Testament] (Eerdmans 1998 ), p. 306. New translations generally omit it.The doxology is not included in the following modern translations: [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nASV American Standard Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nCEV Contemporary English Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nESV English Standard Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nGW GOD'S WORD Translation] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nGNT Good News Translation] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNIRV New International Reader's Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNIV New International Version] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNLT New Living Translation] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nTNIV Today's New International Version.] It is enclosed in square brackets in [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nHCSB Holman Christian Standard Bible] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNASB New American Standard Bible] [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNCV New Century Version.] Two publications that are updates of the Authorized King James Version rather than new translations keep it: [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nKJ21 21st Century King James Version] and [http://www.biblegateway.com/passage/?searchmatthew%206:13-6:13&version\nNKJV New King James Version;] but the second of these adds a note: \" \"NU-Text omits For Yours through Amen.\"\n\nThe first known use of the doxology, in a less lengthy form (\"for yours is the power and the glory forever\"), as a conclusion for the Lord's Prayer (in a version slightly different from that of Matthew) is in the Didache, 8:2. It has similarities with —\"Yours, O LORD, is the greatness and the power and the glory and the victory and the majesty, for all that is in the heavens and in the earth is yours. Yours is the kingdom, O LORD, and you are exalted as head above all.\" In the Byzantine Rite, a similar doxology is sung within the context of the Divine Liturgy. Following the last line of the prayer, the priest sings \"For thine is the kingdom and the power and the glory, of the Father, and of the Son, and of the Holy Spirit, now and ever and unto ages of ages.\"\n\nLatin Church Roman Catholics do not use the doxology when reciting the Lord's Prayer, because it is not part of their received liturgical tradition and is not found in the Latin Vulgate of St. Jerome. Since 1970 it is included in the Roman Rite Mass as an independent item, not as part of the Lord's Prayer. The Anglican Book of Common Prayer sometimes gives the Lord's Prayer with the doxology, sometimes without.For instance, in [http://www.churchofengland.org/prayer-worship/worship/texts/principal-services/word/mornevebcp/morningbcp.aspx Morning Prayer] the doxology is included in the Lord's Prayer in the Introduction, but not in the Prayers after the Apostles' Creed. Most Protestants append it to the Lord's Prayer.\n\nUse as a language comparison tool\n\nIn the course of Christianization, one of the first texts to be translated between many languages has historically been the Lord's Prayer, long before the full Bible would be translated into the respective languages.\nSince the 16th century, collections of translations of the prayer have often been used for a quick comparison of languages.\n\nThe first such collection, with 22 versions, was Mithridates de differentis linguis by Conrad Gessner (1555; the title refers to Mithridates VI of Pontus who according to Pliny the Elder was an exceptional polyglot).\n\nGessner's idea of collecting translations of the prayer was taken up by authors of the 17th century, including Hieronymus Megiserus (1603) and Georg Pistorius (1621).\nThomas Lüdeken in 1680 published an enlarged collection of 83 versions of the prayer, of which three were in fictional philosophical languages.\nLüdeken quotes as a Barnum Hagius as his source for the exotic scripts used, while their true (anonymous) author was Andreas Müller.\nIn 1700, Lübeck's collection was re-edited by B. Mottus as Oratio dominica plus centum linguis versionibus aut characteribus reddita et expressa.\nThis edition was comparatively inferior, but a second, revised edition was published in 1715 by John Chamberlain.\nThis 1715 edition was used by Gottfried Hensel in his Synopsis Universae Philologiae (1741) to compile \"geographico-polyglot maps\" where the beginning of the prayer was shown in the geographical area where the respective languages were spoken.\nJohann Ulrich Kraus also published a collection with more than 100 entries.Augustin Backer, Alois Backer, Bibliothèque des écrivains de la compagnie de Jésus ou notices bibliographiques, vol. 5, 1839, [https://books.google.com/books?idhElDAAAAcAAJ&pg\nPA304 304f.]\n\nThese collections continued to be improved and expanded well into the 19th century; Johann Christoph Adelung and Johann Severin Vater in 1806–1817 published the prayer in \"well-nigh five hundred languages and dialects\".Mithridates oder allgemeine Sprachenkunde mit dem Vater Unser als Sprachprobe in bey nahe fünf hundert Sprachen und Mundarten, 1806–1817, Berlin, Vossische Buchlandlung, 4 volumes. Facsimile edition, Hildesheim-Nueva York, Georg Olms Verlag, 1970.\n\nSamples of scripture, including the Lord's Prayer, were published in 52 oriental languages, most of them not previously found in such collections, translated by the brethren of the Serampore Mission and printed at the mission press there in 1818.\n\nRelation to Jewish prayer\n\nThere are similarities between the Lord's Prayer and both biblical and post-biblical material in Jewish prayer especially Kiddushin 81a (Babylonian).Clontz, p. 451 \"Hallowed be thy name\" is reflected in the Kaddish. \"Lead us not into sin\" is echoed in the \"morning blessings\" of Jewish prayer. A blessing said by some Jewish communities after the evening Shema includes a phrase quite similar to the opening of the Lord's Prayer: \"Our God in heaven, hallow thy name, and establish thy kingdom forever, and rule over us for ever and ever. Amen.\" There are parallels also in .Clontz, pp. 8, 451\n\nRabbi Aron Mendes Chumaceiro has said\"Verdediging is geen aanval\" pp. 121–122 that nearly all the elements of the prayer have counterparts in the Jewish Bible and Deuterocanonical books: the first part in  (\"Look down from heaven and see, from your holy and beautiful habitation ... For you are our Father ...\") and  (\"I will vindicate the holiness of my great name ...\") and  (\"I will show my greatness and my holiness and make myself known in the eyes of many nations ...\"), the second part in  (\"Saviours shall go up to Mount Zion to rule Mount Esau, and the kingdom shall be the LORD's\") and  (\"... It is the LORD. Let him do what seems good to him\"), the third part in  (\"... feed me with my apportioned bread\"), the fourth part in  (\"Forgive your neighbour the wrong he has done, and then your sins will be pardoned when you pray\"). \"Deliver us from evil\" can be compared with  (\"... let no iniquity get dominion over me.\"). Chumaceiro says that, because the idea of God leading a human into temptation contradicts the righteousness and love of God, \"Lead us not into temptation\" has no counterpart in the Jewish Bible/Christian Old Testament.\n\nThe word \"πειρασμός\", which is translated as \"temptation\", could also be translated as \"test\" or \"trial\", making evident the attitude of someone's heart. Well-known examples in the Old Testament are God's test of Abraham (), his \"moving\" (the Hebrew word means basically \"to prick, as by weeds, thorns\") David to do (numbering Israel) what David later acknowledged as sin (; see also ), and the Book of Job.\n\nMusical settings \n\nIn modern times, various composers have incorporated The Lord's Prayer into a musical setting for utilization during liturgical services for a variety of religious traditions as well as interfaith ceremonies.  Included among them are:\n\n* Chris M. Allport — The Lord's Prayer (2016) Music and additional text by Chris M. Allport\n* Albert Hay Malotte — The Lord's Prayer \n* Sergei Rachmaninoff — Otche Nash (Отче наш; Liturgy of St. John Chrysostom, op. 31, 1910)\n* Nikolai Rimsky-Korsakov — Otche Nash (1883)\n* John Serry Sr. — The Lord's Prayer (for Organ & Chorus, 1992)Library of Congress Copyright Office.The Lord's Prayer, Composer: John Serry Sr., September 2, 1992, #PAU 1-665-838  \n* Igor Stravinsky — Otche Nash (1926), arr. Pater Noster (Latin, some time later) \n* Pyotr Ilyich Tchaikovsky — Otche Nash (Отче наш; Liturgy of St. John Chrysostom, op. 41, 1878)\n* Christopher Tin — Baba Yetu (2005). Lord's Prayer. http://en.wikipedia.org/?curid=18494."
  }
}
