{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2422",
  "eid" : "c0399b90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778402249,
  "textBody" : "Ann Noreen Widdecombe,  (born 4 October 1947) is a British former politician. She was a Privy Councillor and was the Conservative Party Member of Parliament for Maidstone from 1987-1997 and for Maidstone and The Weald from 1997-2010. She was a social conservative, a member of the Conservative Christian Fellowship and retired from politics at the 2010 general election. Since 2002, she has also made numerous television and radio appearances, including as a television presenter. She is a convert from Anglicanism to Roman Catholicism.\n\nAs an MP, Widdecombe was known for opposing the legality of abortion, her opposition to various issues of LGBT rights such as an equal age of consent and the repeal of Section 28, her support for the re-introduction of the death penalty, the retention of blasphemy laws and her opposition to fox hunting.\n\nEarly life\n\nBorn in Bath, Somerset, Widdecombe is the daughter of Rita Noreen (née Plummer; 1911-2007) and Ministry of Defence civil servant James Murray Widdecombe. Widdecombe's maternal grandfather, James Henry Plummer, was born to an Irish Catholic family of English descent in Crosshaven, County Cork in 1874. She attended the Royal Naval School in Singapore,[http://news.bbc.co.uk/1/hi/uk/7032992.stm Ann Widdecombe set to stand down]; BBC News, 7 October 2007 and La Sainte Union Convent School in Bath. She then read Latin at the University of Birmingham and later attended Lady Margaret Hall, Oxford, to read Philosophy, Politics and Economics (PPE). She worked for Unilever (1973–75) and then as an administrator at the University of London (1975–87) before entering Parliament.\n\nCouncillor\n\nFrom 1976 to 1978, Widdecombe was a  councillor on Runnymede District Council in Surrey. She contested the seat of Burnley in Lancashire in the 1979 general election and then,  against David Owen, the Plymouth Devonport seat in the 1983 general election.\n\nMember of Parliament\n\nShe was first elected to the House of Commons in the 1987 general election as member for the constituency of Maidstone (which became Maidstone and The Weald in 1997).[http://ukpollingreport.co.uk/guide/seat-profiles/maidstoneandtheweald Maidstone and The Weald], UKPollingReport\n\nPolitical views\n\nAs an MP, Widdecombe expressed conservative views, including opposition to abortion; it was understood during her time in frontline politics that she would not become Health Secretary as long as this involved responsibility for abortions. Although a committed Christian, she has characterised the issue as one of life and death on which her view had been the same when she was agnostic. Along with John Gummer MP, she converted from the Church of England to the Catholic Church following the decision of the Church of England on the Ordination of women as priests. In her speech at the 2000 Conservative conference, she called for a zero tolerance policy of prosecution,  with the punishment of £100 fines for users of cannabis. This was well received by rank-and-file Conservative delegates.\n\nAlthough she supported the UK's partial decriminalisation of homosexuality in 1967, Widdecombe has consistently opposed LGBT rights while in Parliament, saying in 1999 that \"I do not think that [homosexuality] can be promoted as an equally valid lifestyle to [heterosexual] marriage, but I would say the same about irregular heterosexual arrangements.\" On the issue of an equal age of consent, she said in 2000: \"I do not believe that issues of equality should override the imperatives of protecting the young.\" In 2003, Widdecombe proposed an amendment opposing repeal of Section 28 of the Local Government Act, which banned the promotion of homosexuality by local governments. Out of the 17 parliamentary votes considered by the Public Whip website to concern equal rights for homosexuals, Widdecombe took the opposing position in 15 cases, not being present at the other two votes.[http://www.publicwhip.org.uk/mp.php?mpid\n1701&dmp=826 \"Ann Widdecombe compared to 'Homosexuality – Equal rights'\"], Public Whip. Retrieved on 24 June 2009. \n\nWiddecombe has also expressed her opposition to same-sex marriage, introduced by David Cameron's government in 2014, claiming that \"the state must have a preferred model\" and \"a union that is generally open to procreation\". In 2012, Widdecombe voiced support in the Daily Express for the discredited and psychologically damaging practise of conversion therapy, which claims to change the orientation of gay men and women.\n\nShe is a committed animal lover and one of the few Conservative MPs to have consistently voted for the ban on fox hunting.[http://www.publicwhip.org.uk/mp.php?mpid1701&dmp\n1050 \"Ann Widdecombe compared to 'Fox hunting – Ban'\"], Public Whip. Retrieved on 21 March 2009. Widdecombe was among more than 20 high-profile people who signed a letter to Members of Parliament in 2015 to oppose David Cameron's plan to amend the Hunting Act 2004.\n\nShe has expressed a variety of views on scientific issues such as climate change but has been opposed to legislation reducing emissions. Her views on the subject appear to have hardened over time. In 2007, she wrote that she did not want to belittle the issue but was sceptical of the claims that specific actions would prevent catastrophe, then in 2008 that her doubts had been \"crystalised\" by Nigel Lawson's book An Appeal to Reason, before stating in 2009 that \"There is no climate change, hasn’t anybody looked out of their window recently?\"  She was one of the five MPs who voted against the Climate Change Act 2008. In 2011 she expressed the view that \"climate change money should go to armed services\". The previous year, she voted to support a parliamentary motion supporting homeopathy, criticising the Science and Technology Committee's Report on the subject.\n\nOver the years, Widdecombe has expressed her support for a reintroduction of the death penalty, which was abolished in the UK in 1965. She notably spoke of her support for its reintroduction for the worst cases of murder in the aftermath of the murder of two 10-year-old girls from Soham, Cambridgeshire, in August 2002, in the Soham murders. She supported the argument that the death penalty would have deterrent value, as within five years of its abolition the national murder rate had more than doubled.\n\nIn government\n\nWiddecombe joined John Major's government as Parliamentary Under-Secretary of State for Social Security in 1990. In 1993, she was moved to the Department of Employment, and she was promoted to Minister of State the following year. In 1995, she joined the Home Office as Minister of State for Prisons and visited every prison in the UK.\n\nShadow Cabinet\n\nAfter the Conservative landslide defeat at the 1997 general election, she served as Shadow Health Secretary between 1998-1999 and later as Shadow Home Secretary between 1999-2001 under the leadership of William Hague.\n\nLeadership contest and backbenches\n\nDuring the 2001 Conservative leadership election, she could not find sufficient support amongst Conservative MPs for her leadership candidacy. She first supported Michael Ancram, who was eliminated in the first round, and then Kenneth Clarke, who lost in the final round. She afterwards declined to serve in Iain Duncan Smith's Shadow Cabinet (although she indicated on the television programme When Louis Met..., prior to the leadership contest, that she wished to retire to the backbenches anyway).\n\nIn the 2005 leadership election, she initially supported Kenneth Clarke again. Once he was eliminated, she turned support towards Liam Fox. Following Fox's subsequent elimination, she took time to reflect before finally declaring for David Davis. She expressed reservations over the eventual winner David Cameron, feeling that he did not, like the other candidates, have a proven track record, and she was later a leading figure in parliamentary opposition to his A-List policy, which she has said is \"an insult to women\". At the October 2006 Conservative Conference, she was Chief Dragon in a political version of the television programme Dragons' Den, in which A-list candidates were invited to put forward a policy proposal, which was then torn apart by her team of Rachel Elnaugh, Oliver Letwin and Michael Brown.\n\nIn an interview with Metro in September 2006 she stated that if Parliament were of a normal length, it was likely she would retire at the next general election. She confirmed her intention to stand down to The Observers Pendennis diary in September 2007, and again in October 2007 after Prime Minister Gordon Brown quashed speculation of an autumn 2007 general election.\n\nIn November 2006, she moved into the house of an Islington Labour Councillor to experience life on a council estate, her response to her experience being \"Five years ago I made a speech in the House of Commons about the forgotten decents. I have spent the last week on estates in the Islington area finding out that they are still forgotten.\"\n\nWiddecombe was one of the 98 MPs who voted to keep their expense details secret. When the expenses claims were leaked, however, Widdecombe was described by The Daily Telegraph as one of the \"saints\" amongst all MPs.\n\nIn May 2009, following the resignation of Michael Martin as Speaker of the House of Commons, it was reported that Widdecombe was gathering support for election as interim Speaker until the next general election. On 11 June 2009, she confirmed her bid to be the Speaker. She made it through to the second ballot but came last and was eliminated.\n\nWiddecombe retired from politics at the 2010 general election. It was rumoured that she would be a Conservative candidate for Police and Crime Commissioner in 2012, but she refused. She has since spoken about her opposition to the Coalition Government and her surprise at not being given a peerage by David Cameron.\n\nIn 2016, she backed Britain's withdrawal from the European Union during the 2016 EU referendum and, following the resignation of David Cameron, endorsed Andrea Leadsom in her candidacy for election for the leadership of the governing Conservative Party.\n\nPersonal life and family\n\nUntil her retirement at the 2010 general election, Widdecombe divided her time between her two homes – one in London and one in the village of Sutton Valence, Kent, in her constituency. She sold both of these properties, however, upon deciding to retire at the next general election. She shared her home in London with her widowed mother, Rita Widdecombe, until Rita's death, on 25 April 2007, aged 95.Conservative MP's mother dies, aged 95. Retrieved from http://www.kentnews.co.uk/kent-news/Conservative-MP_s-mother-dies,-aged-95-newsinkent3663.aspx. In March 2008, she purchased a house in Haytor Vale, on Dartmoor in Devon, to where she has now retired. Her brother, Malcolm (1937–2010), who was an Anglican Canon in Bristol, retired in May 2009 and died of metastatic oesophageal cancer on 12 October 2010. Her nephew, Roger Widdecombe, is an Anglican priest.\n\nShe has never married nor had any children. In November 2007 on BBC Radio 4 she described how a journalist once produced a profile on her with the assumption that she had had at least \"one sexual relationship\", to which Widdecombe replied: \"Be careful, that's the way you get sued\". When interviewer Jenni Murray asked if she had ever had a sexual relationship, Widdecombe laughed \"it's nobody else's business\".\n\nIn a 2001 report in The Guardian it was claimed that she had had a three-year romance while at the University of Oxford. Widdecombe herself confirmed the liaison when she appeared, in January 2018, on the UK reality show Big Brother, explaining that she had ended the romance in order to prioritise her career.\n\nWiddecombe has a fondness for cats and has a section of her website devoted to all the pet cats with which she has shared her life. Widdecombe adopted two goats at the Buttercups Goat Sanctuary in Boughton Monchelsea near Maidstone, although one later died. In an interview, Widdecombe talked about her appreciation of music despite describing herself as \"pretty well tone-deaf\".\n\nHer non-political accomplishments include being a popular novelist. Widdecombe also currently writes a weekly column for the Daily Express.\n\nIn January 2011 Widdecombe was President of the North of England Education Conference in Blackpool, and gave a speech there supporting selective education and opposing the ban on new grammar schools being built. She has also become a patron of The Grace Charity for M.E.\n\nWiddecombe revealed, in an April 2012 interview with Matt Chorley of The Independent, that she was writing her autobiography, which she described as \"rude about all and sundry, but an amount of truth is always necessary\".\n\nWiddecombe is a Patron of the charity Safe Haven for Donkeys in the Holy Land (SHADH) and in 2014 visited the SHADH Donkey Sanctuary in Palestine.\n\nReligious views\n\nWiddecombe became an Anglican in her 30s, after a period of being an agnostic following her departure from religious schooling. Widdecombe is now a practising Roman Catholic; she converted in 1993 after leaving the Church of England. Her reasons for leaving the latter were many, as she explained to reporters from the New Statesman:\n\nI left the Church of England because there was a huge bundle of straw. The ordination of women was the last straw, but it was only one of many. For years I had been disillusioned by the Church of England's compromising on everything. The Catholic Church doesn't care if something is unpopular.\n\nIn October 2006, she pledged to boycott British Airways for suspending a worker who refused to hide her cross. The matter was resolved when the company reversed the suspension.\n\nIn 2010, Widdecombe turned down an offer to be Britain's next ambassador to the Holy See, being prevented from accepting by suffering a detached retina. She was made a Dame of the Order of St. Gregory the Great by Pope Benedict XVI for services to politics and public life on 31 January 2013.\n\nControversies\n\nIn 1990, following the assassination of the Conservative politician Ian Gow by the Provisional Irish Republican Army (IRA), the Eastbourne by-election for his seat in the House of Commons was won by the Liberal Democrat David Bellotti. Upon the announcement, Widdecombe told the voters that the IRA would be \"toasting their success\".\n\nIn 1996, Widdecombe, as prisons minister, defended the Government's policy to shackle pregnant prisoners with handcuffs and chains when in hospital receiving ante-natal care. Widdecombe told the Commons the restrictions were needed to prevent prisoners from escaping. \"Some MPs may like to think that a pregnant woman would not or could not escape. Unfortunately this is not true. The fact is that hospitals are not secure places in which to keep prisoners, and since 1990, 20 women have escaped from hospitals\". Jack Straw, Labour's Home Affairs spokesman at the time, said it was \"degrading and unnecessary\" for a woman to be shackled at any stage.\n\nIn 1997, during the Conservative leadership election of William Hague, Widdecombe spoke out against Michael Howard, under whom she had served when he was Home Secretary. She remarked in the House of Commons that there is \"something of the night\" about him.  The remark was considered to be antisemitic by some and was damaging to Howard, who came last in the first round, an opinion both former ministers share.  Extract from Crick's book In search of Michael Howard. Howard still became party leader in 2003, and Widdecombe then stated, \"I explained fully what my objections were in 1997 and I do not retract anything I said then. But ... we have to look to the future and not the past.\"\n\nIn 2001, when Michael Portillo was running for leader of the Conservative Party, Widdecombe described him and his allies as \"backbiters\" due to his alleged destabilising influence under Hague. She went on to say that, should he be appointed leader, she would never give him her allegiance. This was amidst a homophobic campaign led by socially conservative critics of Portillo, who argued that Portillo was only concerned about \"the 3  — weed [referring to his support for cannabis legalisation], women and woofters [a derogatory epithet for gay men]\".\n\nMedia work and appearances\n\nIn 2002, she took part in the ITV programme Celebrity Fit Club. Also in 2002 she took part in a Louis Theroux television documentary, depicting her life, both in and out of politics. In March 2004 she briefly became The Guardian newspaper's agony aunt, introduced with an Emma Brockes interview. In 2005 BBC Two showed six episodes of The Widdecombe Project, an agony aunt television programme. In 2005, she appeared in a new series of Celebrity Fit Club, but this time as a panel member dispensing wisdom and advice to the celebrities taking part. Also in 2005, she presented the show Ann Widdecombe to the Rescue in which she acted as an agony aunt, dispensing no-nonsense advice to disputing families, couples, and others across the UK. In 2005, she also appeared in a discussion programme on Five to discuss who had been England's greatest monarch since the Norman Conquest; her choice of monarch was Charles II.\n\nShe was the guest host of news quiz Have I Got News for You twice, in 2006 and 2007. Following her second appearance, Widdecombe vowed she would never appear on the show again because of comments made by panellist Jimmy Carr. She wrote, \"His idea of wit is a barrage of filth and the sort of humour most men grow out of in their teens.... [T]here's no amount of money for which I would go through those two recording hours again. At one stage I nearly walked out.\"Ann Widdecombe in the Daily Express, as quoted by  She did, however, stand by her appraisal of regular panellists Ian Hislop and Paul Merton, whom she has called \"the fastest wits in showbusiness\".\n\nIn 2007 she awarded the University Challenge trophy to the winners. In the same year, she was cast as herself in \"The Sound of Drums\", the 12th episode of the third series of the science-fiction drama Doctor Who supporting Mr Saxon, the alias of the Master. Since 2007 Widdecombe has fronted a television series called Ann Widdecombe Versus, on ITV1, in which she speaks to various people about things related to her as an MP, with an emphasis on confronting those responsible for problems she wished to tackle. On 15 August 2007 she talked about prostitution, the next week about benefits and the week after that about truancy. A fourth episode was screened on 18 September 2008 in which she travelled around London and Birmingham talking to girl gangs.\n\nIn 2009, Widdecombe appeared with Archbishop John Onaiyekan in an \"Intelligence Squared\" debate in which they defended the motion that the Catholic Church was a force for good. Arguing against the motion were Stephen Fry and Christopher Hitchens, who won the debate overall.\n\nIn October 2010, she appeared on BBC One's Strictly Come Dancing, partnered by Anton du Beke, winning the support of some viewers despite low marks from the judges. After nine weeks of routines strongly flavoured by comedy the couple had received enough support in the public vote to stay in the contest. Widdecombe was eliminated from the competition on Sunday 5 December after the  public vote had been combined with the judges' score; she was with Scott Maslen of EastEnders in the bottom two.\n\nIn 2012, Widdecombe hosted a new quiz show with herself as question-master, for the Sky Atlantic channel, called Cleverdicks. The show ran for one series with 30 one-hour episodes. It featured four contestants, usually high quality members of the UK national quiz circuit and ended with a money round for the winner of each show. In April 2012 Widdecombe presented an hour-long documentary for BBC Radio 5 Live, Drunk Again: Ann Widdecombe Investigates, looking at how the British attitude to alcohol consumption has changed over the last few years. It was revealed in October 2012, that the year's Children in Need's appeal night would feature a Strictly Come Dancing special with former show favourites Russell Grant and Widdecombe. On 4 November 2012, Widdecombe guest-hosted one episode of BBC's Songs of Praise programme about singleness.\n\nIn October 2014, she appeared in the BBC series Celebrity Antiques Road Trip, partnered with expert Mark Stacey, where the pair beat the rival team of Craig Revel Horwood and Catherine Southon.\n\nWiddecombe took part in a television series 24 Hours in the Past, along with Colin Jackson, Alistair McGowan, Miquita Oliver, Tyger Drew-Honey and Zoe Lucker. The four-part series was aired from 28 April–19 May 2015 on BBC One. She took part in an episode of Tipping Point: Lucky Stars in 2016. In 2017, Widdecombe took part in ITV's Sugar Free Farm. \n\nIn January 2018, Widdecombe was the first to enter the Celebrity Big Brother house to participate as a housemate in its twenty-first series. A controversial figure in the house, she was criticised over her comments regarding the Harvey Weinstein controversy as well as homophobic, transphobic and misogynistic comments to her fellow housemates, most notably drag queen Shane Jenek (Courtney Act). She finished the competition in second place as runner-up to Jenek, who became popular with viewers for challenging Widdecombe's views.\n\nStage acting career\n\nFollowing her retirement, Widdecombe made her stage debut, on 9 December 2011, at the Orchard Theatre, Dartford in the Christmas pantomime Snow White and the Seven Dwarfs, alongside Strictly Come Dancing judge Craig Revel Horwood. In April 2012, she had a ten-minute non-singing cameo part in Gaetano Donizetti's comic opera La Fille Du Regiment, playing the Duchesse de Crackentorp. Widdecombe reprised her pantomime performance, again with Revel Horwood, at the Swan Theatre, High Wycombe in December 2012. \n\nWiddecombe stepped in at short notice to play the Evil Queen in the pantomime Snow White and the Seven Dwarfs at Bridlington Spa in December 2016.  She replaced Lorraine Chase; who had been injured in an accident two weeks before rehearsals were due to commence.  This was Widdecombe's first appearance as a pantomime 'baddie'; a role she told the press she had always hoped for.  \n\nIn December 2017 Widdecombe played the Empress of China in the pantomime Aladdin at the Marina Theatre in Lowestoft. The production was the theatre's most successful pantomime to date.\n\nHonours\n\n*Widdecombe was appointed an Honorary Fellow of Canterbury Christ Church University at a ceremony held at Canterbury Cathedral on 30 January 2009.\n*: Dame of the Order of St Gregory the Great (DSG) (2013)\n\nSelected publications\n\nFiction\n\n* 2000: The Clematis Tree. London: Weidenfeld & Nicolson \n* 2002: An Act of Treachery. London: Weidenfeld & Nicolson \n* 2005: Father Figure. London: Weidenfeld & Nicolson \n* 2005: An Act of Peace. London: Weidenfeld & Nicolson \n\nNon-fiction\n\n* 1999: Inspired and Outspoken: the collected speeches of Ann Widdecombe; edited by John Simmons, with a biographical preface by Nick Kochan. London: Politico's Publishing \n*2004: The Mass is a Mess, with Martin Kochanski. London: Catholic Writers' Guild",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ann Widdecombe" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2422" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ann Noreen Widdecombe,  (born 4 October 1947) is a British former politician. She was a Privy Councillor and was the Conservative Party Member of Parliament for Maidstone from 1987-1997 and for Maidstone and The Weald from 1997-2010. She was a social conservative, a member of the Conservative Christian Fellowship and retired from politics at the 2010 general election. Since 2002, she has also made numerous television and radio appearances, including as a television presenter. She is a convert from Anglicanism to Roman Catholicism.\n\nAs an MP, Widdecombe was known for opposing the legality of abortion, her opposition to various issues of LGBT rights such as an equal age of consent and the repeal of Section 28, her support for the re-introduction of the death penalty, the retention of blasphemy laws and her opposition to fox hunting.\n\nEarly life\n\nBorn in Bath, Somerset, Widdecombe is the daughter of Rita Noreen (née Plummer; 1911-2007) and Ministry of Defence civil servant James Murray Widdecombe. Widdecombe's maternal grandfather, James Henry Plummer, was born to an Irish Catholic family of English descent in Crosshaven, County Cork in 1874. She attended the Royal Naval School in Singapore,[http://news.bbc.co.uk/1/hi/uk/7032992.stm Ann Widdecombe set to stand down]; BBC News, 7 October 2007 and La Sainte Union Convent School in Bath. She then read Latin at the University of Birmingham and later attended Lady Margaret Hall, Oxford, to read Philosophy, Politics and Economics (PPE). She worked for Unilever (1973–75) and then as an administrator at the University of London (1975–87) before entering Parliament.\n\nCouncillor\n\nFrom 1976 to 1978, Widdecombe was a  councillor on Runnymede District Council in Surrey. She contested the seat of Burnley in Lancashire in the 1979 general election and then,  against David Owen, the Plymouth Devonport seat in the 1983 general election.\n\nMember of Parliament\n\nShe was first elected to the House of Commons in the 1987 general election as member for the constituency of Maidstone (which became Maidstone and The Weald in 1997).[http://ukpollingreport.co.uk/guide/seat-profiles/maidstoneandtheweald Maidstone and The Weald], UKPollingReport\n\nPolitical views\n\nAs an MP, Widdecombe expressed conservative views, including opposition to abortion; it was understood during her time in frontline politics that she would not become Health Secretary as long as this involved responsibility for abortions. Although a committed Christian, she has characterised the issue as one of life and death on which her view had been the same when she was agnostic. Along with John Gummer MP, she converted from the Church of England to the Catholic Church following the decision of the Church of England on the Ordination of women as priests. In her speech at the 2000 Conservative conference, she called for a zero tolerance policy of prosecution,  with the punishment of £100 fines for users of cannabis. This was well received by rank-and-file Conservative delegates.\n\nAlthough she supported the UK's partial decriminalisation of homosexuality in 1967, Widdecombe has consistently opposed LGBT rights while in Parliament, saying in 1999 that \"I do not think that [homosexuality] can be promoted as an equally valid lifestyle to [heterosexual] marriage, but I would say the same about irregular heterosexual arrangements.\" On the issue of an equal age of consent, she said in 2000: \"I do not believe that issues of equality should override the imperatives of protecting the young.\" In 2003, Widdecombe proposed an amendment opposing repeal of Section 28 of the Local Government Act, which banned the promotion of homosexuality by local governments. Out of the 17 parliamentary votes considered by the Public Whip website to concern equal rights for homosexuals, Widdecombe took the opposing position in 15 cases, not being present at the other two votes.[http://www.publicwhip.org.uk/mp.php?mpid\n1701&dmp=826 \"Ann Widdecombe compared to 'Homosexuality – Equal rights'\"], Public Whip. Retrieved on 24 June 2009. \n\nWiddecombe has also expressed her opposition to same-sex marriage, introduced by David Cameron's government in 2014, claiming that \"the state must have a preferred model\" and \"a union that is generally open to procreation\". In 2012, Widdecombe voiced support in the Daily Express for the discredited and psychologically damaging practise of conversion therapy, which claims to change the orientation of gay men and women.\n\nShe is a committed animal lover and one of the few Conservative MPs to have consistently voted for the ban on fox hunting.[http://www.publicwhip.org.uk/mp.php?mpid1701&dmp\n1050 \"Ann Widdecombe compared to 'Fox hunting – Ban'\"], Public Whip. Retrieved on 21 March 2009. Widdecombe was among more than 20 high-profile people who signed a letter to Members of Parliament in 2015 to oppose David Cameron's plan to amend the Hunting Act 2004.\n\nShe has expressed a variety of views on scientific issues such as climate change but has been opposed to legislation reducing emissions. Her views on the subject appear to have hardened over time. In 2007, she wrote that she did not want to belittle the issue but was sceptical of the claims that specific actions would prevent catastrophe, then in 2008 that her doubts had been \"crystalised\" by Nigel Lawson's book An Appeal to Reason, before stating in 2009 that \"There is no climate change, hasn’t anybody looked out of their window recently?\"  She was one of the five MPs who voted against the Climate Change Act 2008. In 2011 she expressed the view that \"climate change money should go to armed services\". The previous year, she voted to support a parliamentary motion supporting homeopathy, criticising the Science and Technology Committee's Report on the subject.\n\nOver the years, Widdecombe has expressed her support for a reintroduction of the death penalty, which was abolished in the UK in 1965. She notably spoke of her support for its reintroduction for the worst cases of murder in the aftermath of the murder of two 10-year-old girls from Soham, Cambridgeshire, in August 2002, in the Soham murders. She supported the argument that the death penalty would have deterrent value, as within five years of its abolition the national murder rate had more than doubled.\n\nIn government\n\nWiddecombe joined John Major's government as Parliamentary Under-Secretary of State for Social Security in 1990. In 1993, she was moved to the Department of Employment, and she was promoted to Minister of State the following year. In 1995, she joined the Home Office as Minister of State for Prisons and visited every prison in the UK.\n\nShadow Cabinet\n\nAfter the Conservative landslide defeat at the 1997 general election, she served as Shadow Health Secretary between 1998-1999 and later as Shadow Home Secretary between 1999-2001 under the leadership of William Hague.\n\nLeadership contest and backbenches\n\nDuring the 2001 Conservative leadership election, she could not find sufficient support amongst Conservative MPs for her leadership candidacy. She first supported Michael Ancram, who was eliminated in the first round, and then Kenneth Clarke, who lost in the final round. She afterwards declined to serve in Iain Duncan Smith's Shadow Cabinet (although she indicated on the television programme When Louis Met..., prior to the leadership contest, that she wished to retire to the backbenches anyway).\n\nIn the 2005 leadership election, she initially supported Kenneth Clarke again. Once he was eliminated, she turned support towards Liam Fox. Following Fox's subsequent elimination, she took time to reflect before finally declaring for David Davis. She expressed reservations over the eventual winner David Cameron, feeling that he did not, like the other candidates, have a proven track record, and she was later a leading figure in parliamentary opposition to his A-List policy, which she has said is \"an insult to women\". At the October 2006 Conservative Conference, she was Chief Dragon in a political version of the television programme Dragons' Den, in which A-list candidates were invited to put forward a policy proposal, which was then torn apart by her team of Rachel Elnaugh, Oliver Letwin and Michael Brown.\n\nIn an interview with Metro in September 2006 she stated that if Parliament were of a normal length, it was likely she would retire at the next general election. She confirmed her intention to stand down to The Observers Pendennis diary in September 2007, and again in October 2007 after Prime Minister Gordon Brown quashed speculation of an autumn 2007 general election.\n\nIn November 2006, she moved into the house of an Islington Labour Councillor to experience life on a council estate, her response to her experience being \"Five years ago I made a speech in the House of Commons about the forgotten decents. I have spent the last week on estates in the Islington area finding out that they are still forgotten.\"\n\nWiddecombe was one of the 98 MPs who voted to keep their expense details secret. When the expenses claims were leaked, however, Widdecombe was described by The Daily Telegraph as one of the \"saints\" amongst all MPs.\n\nIn May 2009, following the resignation of Michael Martin as Speaker of the House of Commons, it was reported that Widdecombe was gathering support for election as interim Speaker until the next general election. On 11 June 2009, she confirmed her bid to be the Speaker. She made it through to the second ballot but came last and was eliminated.\n\nWiddecombe retired from politics at the 2010 general election. It was rumoured that she would be a Conservative candidate for Police and Crime Commissioner in 2012, but she refused. She has since spoken about her opposition to the Coalition Government and her surprise at not being given a peerage by David Cameron.\n\nIn 2016, she backed Britain's withdrawal from the European Union during the 2016 EU referendum and, following the resignation of David Cameron, endorsed Andrea Leadsom in her candidacy for election for the leadership of the governing Conservative Party.\n\nPersonal life and family\n\nUntil her retirement at the 2010 general election, Widdecombe divided her time between her two homes – one in London and one in the village of Sutton Valence, Kent, in her constituency. She sold both of these properties, however, upon deciding to retire at the next general election. She shared her home in London with her widowed mother, Rita Widdecombe, until Rita's death, on 25 April 2007, aged 95.Conservative MP's mother dies, aged 95. Retrieved from http://www.kentnews.co.uk/kent-news/Conservative-MP_s-mother-dies,-aged-95-newsinkent3663.aspx. In March 2008, she purchased a house in Haytor Vale, on Dartmoor in Devon, to where she has now retired. Her brother, Malcolm (1937–2010), who was an Anglican Canon in Bristol, retired in May 2009 and died of metastatic oesophageal cancer on 12 October 2010. Her nephew, Roger Widdecombe, is an Anglican priest.\n\nShe has never married nor had any children. In November 2007 on BBC Radio 4 she described how a journalist once produced a profile on her with the assumption that she had had at least \"one sexual relationship\", to which Widdecombe replied: \"Be careful, that's the way you get sued\". When interviewer Jenni Murray asked if she had ever had a sexual relationship, Widdecombe laughed \"it's nobody else's business\".\n\nIn a 2001 report in The Guardian it was claimed that she had had a three-year romance while at the University of Oxford. Widdecombe herself confirmed the liaison when she appeared, in January 2018, on the UK reality show Big Brother, explaining that she had ended the romance in order to prioritise her career.\n\nWiddecombe has a fondness for cats and has a section of her website devoted to all the pet cats with which she has shared her life. Widdecombe adopted two goats at the Buttercups Goat Sanctuary in Boughton Monchelsea near Maidstone, although one later died. In an interview, Widdecombe talked about her appreciation of music despite describing herself as \"pretty well tone-deaf\".\n\nHer non-political accomplishments include being a popular novelist. Widdecombe also currently writes a weekly column for the Daily Express.\n\nIn January 2011 Widdecombe was President of the North of England Education Conference in Blackpool, and gave a speech there supporting selective education and opposing the ban on new grammar schools being built. She has also become a patron of The Grace Charity for M.E.\n\nWiddecombe revealed, in an April 2012 interview with Matt Chorley of The Independent, that she was writing her autobiography, which she described as \"rude about all and sundry, but an amount of truth is always necessary\".\n\nWiddecombe is a Patron of the charity Safe Haven for Donkeys in the Holy Land (SHADH) and in 2014 visited the SHADH Donkey Sanctuary in Palestine.\n\nReligious views\n\nWiddecombe became an Anglican in her 30s, after a period of being an agnostic following her departure from religious schooling. Widdecombe is now a practising Roman Catholic; she converted in 1993 after leaving the Church of England. Her reasons for leaving the latter were many, as she explained to reporters from the New Statesman:\n\nI left the Church of England because there was a huge bundle of straw. The ordination of women was the last straw, but it was only one of many. For years I had been disillusioned by the Church of England's compromising on everything. The Catholic Church doesn't care if something is unpopular.\n\nIn October 2006, she pledged to boycott British Airways for suspending a worker who refused to hide her cross. The matter was resolved when the company reversed the suspension.\n\nIn 2010, Widdecombe turned down an offer to be Britain's next ambassador to the Holy See, being prevented from accepting by suffering a detached retina. She was made a Dame of the Order of St. Gregory the Great by Pope Benedict XVI for services to politics and public life on 31 January 2013.\n\nControversies\n\nIn 1990, following the assassination of the Conservative politician Ian Gow by the Provisional Irish Republican Army (IRA), the Eastbourne by-election for his seat in the House of Commons was won by the Liberal Democrat David Bellotti. Upon the announcement, Widdecombe told the voters that the IRA would be \"toasting their success\".\n\nIn 1996, Widdecombe, as prisons minister, defended the Government's policy to shackle pregnant prisoners with handcuffs and chains when in hospital receiving ante-natal care. Widdecombe told the Commons the restrictions were needed to prevent prisoners from escaping. \"Some MPs may like to think that a pregnant woman would not or could not escape. Unfortunately this is not true. The fact is that hospitals are not secure places in which to keep prisoners, and since 1990, 20 women have escaped from hospitals\". Jack Straw, Labour's Home Affairs spokesman at the time, said it was \"degrading and unnecessary\" for a woman to be shackled at any stage.\n\nIn 1997, during the Conservative leadership election of William Hague, Widdecombe spoke out against Michael Howard, under whom she had served when he was Home Secretary. She remarked in the House of Commons that there is \"something of the night\" about him.  The remark was considered to be antisemitic by some and was damaging to Howard, who came last in the first round, an opinion both former ministers share.  Extract from Crick's book In search of Michael Howard. Howard still became party leader in 2003, and Widdecombe then stated, \"I explained fully what my objections were in 1997 and I do not retract anything I said then. But ... we have to look to the future and not the past.\"\n\nIn 2001, when Michael Portillo was running for leader of the Conservative Party, Widdecombe described him and his allies as \"backbiters\" due to his alleged destabilising influence under Hague. She went on to say that, should he be appointed leader, she would never give him her allegiance. This was amidst a homophobic campaign led by socially conservative critics of Portillo, who argued that Portillo was only concerned about \"the 3  — weed [referring to his support for cannabis legalisation], women and woofters [a derogatory epithet for gay men]\".\n\nMedia work and appearances\n\nIn 2002, she took part in the ITV programme Celebrity Fit Club. Also in 2002 she took part in a Louis Theroux television documentary, depicting her life, both in and out of politics. In March 2004 she briefly became The Guardian newspaper's agony aunt, introduced with an Emma Brockes interview. In 2005 BBC Two showed six episodes of The Widdecombe Project, an agony aunt television programme. In 2005, she appeared in a new series of Celebrity Fit Club, but this time as a panel member dispensing wisdom and advice to the celebrities taking part. Also in 2005, she presented the show Ann Widdecombe to the Rescue in which she acted as an agony aunt, dispensing no-nonsense advice to disputing families, couples, and others across the UK. In 2005, she also appeared in a discussion programme on Five to discuss who had been England's greatest monarch since the Norman Conquest; her choice of monarch was Charles II.\n\nShe was the guest host of news quiz Have I Got News for You twice, in 2006 and 2007. Following her second appearance, Widdecombe vowed she would never appear on the show again because of comments made by panellist Jimmy Carr. She wrote, \"His idea of wit is a barrage of filth and the sort of humour most men grow out of in their teens.... [T]here's no amount of money for which I would go through those two recording hours again. At one stage I nearly walked out.\"Ann Widdecombe in the Daily Express, as quoted by  She did, however, stand by her appraisal of regular panellists Ian Hislop and Paul Merton, whom she has called \"the fastest wits in showbusiness\".\n\nIn 2007 she awarded the University Challenge trophy to the winners. In the same year, she was cast as herself in \"The Sound of Drums\", the 12th episode of the third series of the science-fiction drama Doctor Who supporting Mr Saxon, the alias of the Master. Since 2007 Widdecombe has fronted a television series called Ann Widdecombe Versus, on ITV1, in which she speaks to various people about things related to her as an MP, with an emphasis on confronting those responsible for problems she wished to tackle. On 15 August 2007 she talked about prostitution, the next week about benefits and the week after that about truancy. A fourth episode was screened on 18 September 2008 in which she travelled around London and Birmingham talking to girl gangs.\n\nIn 2009, Widdecombe appeared with Archbishop John Onaiyekan in an \"Intelligence Squared\" debate in which they defended the motion that the Catholic Church was a force for good. Arguing against the motion were Stephen Fry and Christopher Hitchens, who won the debate overall.\n\nIn October 2010, she appeared on BBC One's Strictly Come Dancing, partnered by Anton du Beke, winning the support of some viewers despite low marks from the judges. After nine weeks of routines strongly flavoured by comedy the couple had received enough support in the public vote to stay in the contest. Widdecombe was eliminated from the competition on Sunday 5 December after the  public vote had been combined with the judges' score; she was with Scott Maslen of EastEnders in the bottom two.\n\nIn 2012, Widdecombe hosted a new quiz show with herself as question-master, for the Sky Atlantic channel, called Cleverdicks. The show ran for one series with 30 one-hour episodes. It featured four contestants, usually high quality members of the UK national quiz circuit and ended with a money round for the winner of each show. In April 2012 Widdecombe presented an hour-long documentary for BBC Radio 5 Live, Drunk Again: Ann Widdecombe Investigates, looking at how the British attitude to alcohol consumption has changed over the last few years. It was revealed in October 2012, that the year's Children in Need's appeal night would feature a Strictly Come Dancing special with former show favourites Russell Grant and Widdecombe. On 4 November 2012, Widdecombe guest-hosted one episode of BBC's Songs of Praise programme about singleness.\n\nIn October 2014, she appeared in the BBC series Celebrity Antiques Road Trip, partnered with expert Mark Stacey, where the pair beat the rival team of Craig Revel Horwood and Catherine Southon.\n\nWiddecombe took part in a television series 24 Hours in the Past, along with Colin Jackson, Alistair McGowan, Miquita Oliver, Tyger Drew-Honey and Zoe Lucker. The four-part series was aired from 28 April–19 May 2015 on BBC One. She took part in an episode of Tipping Point: Lucky Stars in 2016. In 2017, Widdecombe took part in ITV's Sugar Free Farm. \n\nIn January 2018, Widdecombe was the first to enter the Celebrity Big Brother house to participate as a housemate in its twenty-first series. A controversial figure in the house, she was criticised over her comments regarding the Harvey Weinstein controversy as well as homophobic, transphobic and misogynistic comments to her fellow housemates, most notably drag queen Shane Jenek (Courtney Act). She finished the competition in second place as runner-up to Jenek, who became popular with viewers for challenging Widdecombe's views.\n\nStage acting career\n\nFollowing her retirement, Widdecombe made her stage debut, on 9 December 2011, at the Orchard Theatre, Dartford in the Christmas pantomime Snow White and the Seven Dwarfs, alongside Strictly Come Dancing judge Craig Revel Horwood. In April 2012, she had a ten-minute non-singing cameo part in Gaetano Donizetti's comic opera La Fille Du Regiment, playing the Duchesse de Crackentorp. Widdecombe reprised her pantomime performance, again with Revel Horwood, at the Swan Theatre, High Wycombe in December 2012. \n\nWiddecombe stepped in at short notice to play the Evil Queen in the pantomime Snow White and the Seven Dwarfs at Bridlington Spa in December 2016.  She replaced Lorraine Chase; who had been injured in an accident two weeks before rehearsals were due to commence.  This was Widdecombe's first appearance as a pantomime 'baddie'; a role she told the press she had always hoped for.  \n\nIn December 2017 Widdecombe played the Empress of China in the pantomime Aladdin at the Marina Theatre in Lowestoft. The production was the theatre's most successful pantomime to date.\n\nHonours\n\n*Widdecombe was appointed an Honorary Fellow of Canterbury Christ Church University at a ceremony held at Canterbury Cathedral on 30 January 2009.\n*: Dame of the Order of St Gregory the Great (DSG) (2013)\n\nSelected publications\n\nFiction\n\n* 2000: The Clematis Tree. London: Weidenfeld & Nicolson \n* 2002: An Act of Treachery. London: Weidenfeld & Nicolson \n* 2005: Father Figure. London: Weidenfeld & Nicolson \n* 2005: An Act of Peace. London: Weidenfeld & Nicolson \n\nNon-fiction\n\n* 1999: Inspired and Outspoken: the collected speeches of Ann Widdecombe; edited by John Simmons, with a biographical preface by Nick Kochan. London: Politico's Publishing \n*2004: The Mass is a Mess, with Martin Kochanski. London: Catholic Writers' Guild. Ann Widdecombe. http://en.wikipedia.org/?curid=2422."
  }
}
