{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=709",
  "eid" : "91481730-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778323491,
  "textBody" : "The Angolan Armed Forces (Portuguese: Forças Armadas Angolanas) or FAA are the military of Angola.\n\nThe FAA include the General Staff of the Armed Forces and three components: the Army (Exército), the Navy (Marinha de Guerra) and the National Air Force (National Air Force). Reported total manpower in 2013 was about 107,000.International Institute for Strategic Studies, The Military Balance 2013, 493.\n\nThe FAA is headed by Chief of the General Staff Geraldo Sachipengo Nunda since 2010, who reports to the Minister of National Defense, currently Salviano de Jesus Sequeira.\n\nHistory\n\nThe FAA succeeded to the previous People's Armed Forces for the Liberation of Angola (FAPLA) following the abortive Bicesse Accord with the Armed Forces of the Liberation of Angola (FALA), armed wing of the National Union for the Total Independence of Angola (UNITA). As part of the peace agreement, troops from both armies were to be demilitarized and then integrated. Integration was never completed as UNITA and FALA went back to war in 1992. Later, consequences for FALA personnel in Luanda were harsh with FAPLA veterans persecuting their erstwhile opponents in certain areas and reports of vigilantism.\n\nArmy \n\nGeneral description\n\nThe Army (Exército) is the land component of the FAA. It is organized in six military regions (Cabinda, Luanda, North, Center, East and South), with an infantry division being based in each one. Distributed by the six military regions / infantry divisions, there are 25 motorized infantry brigades, one tank brigade and one engineering brigade. The Army also includes an artillery regiment, the Military Artillery School, the Army Military Academy, an anti-aircraft defense group, a composite land artillery group, a military police regiment, a logistical transportation regiment and a field artillery brigade. The Army further includes the Special Forces Brigade (including Commandos and Special Operations units), but this unit is under the direct command of the General Staff of the FAA.\n\nHistory\n\nOn August 1, 1974 a few months after a military coup d'état had overthrown the Lisbon regime and proclaimed its intention of granting independence to Angola, the MPLA announced the formation of FAPLA, which replaced the EPLA. By 1976 FAPLA had been transformed from lightly armed guerrilla units into a national army capable of sustained field operations.Library of Congress Country Studies\n\nIn 1990-91, the Army had ten military regions and an estimated 73+ 'brigades', each with a mean strength of 1,000 and comprising inf, tank, APC, artillery, and AA units as required.IISS Military Balance 1990 or 1991 The Library of Congress said in 1990 that '[t]he regular army's 91,500 troops were organized into more than seventy brigades ranging from 750 to 1,200 men each and deployed throughout the ten military regions. Most regions were commanded by lieutenant colonels, with majors as deputy commanders, but some regions were commanded by majors. Each region consisted of one to four provinces, with one or more infantry brigades assigned to it. The brigades were generally dispersed in battalion or smaller unit formations to protect strategic terrain, urban centers, settlements, and critical infrastructure such as bridges and factories. Counterintelligence agents were assigned to all field units to thwart UNITA infiltration. The army's diverse combat capabilities were indicated by its many regular and motorised infantry brigades with organic or attached armor, artillery, and air defense units; two militia infantry brigades; four antiaircraft artillery brigades; ten tank battalions; and six artillery battalions. These forces were concentrated most heavily in places of strategic importance and recurring conflict: the oil-producing Cabinda Province, the area around the capital, and the southern provinces where UNITA and South African forces operated.'\n\nIt was reported in 2011 that the army was by far the largest of the services with about 120,000 men and women.[http://www.globaldefence.net/streitkraefte-der-welt/afrika/346-angola.html Global Defence.net: Angolan Armed Forces]  retrieved August 21, 2011 (de) The Angolan Army has around 29,000 \"ghost workers\" who remain enrolled in the ranks of the FAA and therefore receive a salary.[http://www.radioecclesia.org/index.php?optioncom_content&view\narticle&id1686:18-anos-das-for-armadas-angolanas&catid\n130:sociedade&Itemid=483, Rádio Ecclesia: 18 anos das Forças Armadas Angolanas] retrieved August 22, 2011 (pt)\n\nIn 2013, the International Institute for Strategic Studies reported that the FAA had six divisions, the 1st, 5th, and 6th with two or three infantry brigades, and the 2nd, 3rd, and 4th with five to six infantry brigades. The 4th Division included a tank regiment. A separate tank brigade and special forces brigade were also reported.IISS 2013, 493.\n\nAs of 2011, the IISS reported the ground forces had 42 armoured/infantry regiments ('detachments/groups - strength varies') and 16 infantry 'brigades'.IISS Military Balance 2011, 410. These probably comprised infantry, tanks, APC, artillery, and AA units as required. Major equipment included over 140 main battle tanks, 600 reconnaissance vehicles, over 920 AFVs, infantry fighting vehicles, 298 howitzers.Defenceweb.co.za, [http://www.defenceweb.co.za/index.php?option\ncom_content&viewarticle&id\n29331:angola&catid119:african-militaries&Itemid\n255 Angola], February 2013.\n\nIt was reported on May 3, 2007, that the Special Forces Brigade of the Angolan Armed Forces (FAA) located at Cabo Ledo region, northern Bengo Province, would host a 29th anniversary celebration for the entire armed forces. The brigade was reportedly formed on 5 May 1978 and under the command at the time of Colonel Paulo Falcao.[http://www.portalangop.co.ao/angola/en_us/noticias/politica/2007/4/18/Army-Special-Forces-Brigade-Celebrate-Years,38c72dcf-fced-44c2-a0c8-cdc9689f0ecd.html Army Special Forces Celebrate Years], May 3, 2007.\n\nEquipment\n\nThe Army operates a large amount of Russian, Soviet and ex-Warsaw pact hardware. A large amount of its equipment was acquired in the 1980s and 1990s most likely because of hostilities with neighbouring countries and its civil war which lasted from November 1975 until 2002. There is an interest from the Angolan Army for the Brazilian ASTROS II multiple rocket launcher.\n\nInfantry Weapons\n\nMany of Angola's weapons are of Portuguese colonial and Warsaw Pact origin. Jane's Information Group lists the following as in service:\n* Rifles in service with Army include the AK-47, AKM, FN FAL, G3 Assault Rifle, SKS and IMI Tavor.\n* Pistols include the Makarov pistol, Stechkin automatic pistol and the Tokarev TT pistol.\n* Submachine guns include the Škorpion vz. 61, Star Z-45, Uzi and the FBP submachine gun.\n* Machine guns include the RP-46, RPD machine gun, Vz. 52 machine gun and the DShK Heavy machine gun.\n* Grenade launchers include the AGS-17 automatic grenade launcher.  \n* Mortars include the 120-PM-43 mortar (500 in service) and the 82-PM-41 (250 in service). \n* Anti-Tank weapons include the RPG-7, 9K111 Fagot (650 ordered in 1987), 9K11 Malyutka, B-10 recoilless rifle and the B-11 recoilless rifle.Jones, Richard D. Jane's Infantry Weapons 2009/2010. Jane's Information Group; 35 edition (January 27, 2009). .\n\nMain Battle Tanks\n\n* Between 116 and 267 T-55AM-2 Medium tanks. 281 T-55's were ordered between 1975 and 1999.  267 T-55AM-2's were delivered from Bulgaria and Slovakia in 1999.\n* 50 T-72M1 main battle tanks. Delivered from Belarus in 1999. \n* 50 T-62 Main battle tanks. 364 were ordered in the 1980s and 1990s.\n* 12 PT-76 Amphibious Light tanks. 68 ordered in 1975 from the Soviet Union.\n\nArmoured Vehicles\n\n* 150 BMP-1 infantry fighting vehicles.\n* 100 BMP-2 infantry fighting vehicles.\n* 10 BMD-3 infantry fighting vehicles.\n* 195 BRDM-2 and 120 BRDM-1 Amphibious Armoured Scout Cars.\n* 62 BTR-60 and 50 OT-62 TOPAS armored personnel carriers\n* 45  Casspir NG 2000B Infantry mobility vehicles\n* 24 EE-11 Urutu armored personnel carriers\n\nArtillery\n\n* 12 2S1 Gvozdika 122 mm Self-propelled guns (Acquired in 2000 from the Czech Republic).\n* 4 2S3 Akatsiya 152 mm Self-propelled guns (Acquired in 1999 from the Bulgaria).\n* 12 2S7 Pion 203 mm Self-propelled guns (Acquired in 2000 from the Czech Republic).\n* Unknown amounts of M1942 ZiS-3 Anti-tank field guns\n* ~280 D-30 122 mm Howitzers (28 from Kazakhstan in 1998, 12 from Belarus, 240 from the Soviet Union in the 1980s)\n* 4 D-20 Howitzers.\n* Unknown amounts of 85 mm divisional gun D-44 Field Guns.\n* 48 M-46 130 mm field guns\n* 75 BM-21 Grad multiple rocket launchers\n* 40 RM-70 multiple rocket launchers\n\nAnti-Aircraft weaponry\n\n* 20 ZSU-23-4 Shilka Self-propelled anti-aircraft guns.\n* 40 ZSU-57-2 Self-propelled anti-aircraft guns\n* Unknown amounts of ZU-23-2, 57 mm AZP S-60, M-1939, ZPU-4 and M-55 anti-aircraft guns.\n* 40 SA-2 Guideline high-altitude air defense systems.\n* 12 SA-3 Goa\n* 25 SA-6\n* Unknown amounts of SA-7 Grail\n* 15 SA-8\n* 20 SA-9 Gaskin\n* 10 SA-13\n* Unknown amounts of SA-14 Gremlin and SA-16 Gimlet.\n\nOther Vehicles\n\n* Ural-4320 trucks\n* Star 266\n* KrAZ-6322\n\nAir Force \n\nThe National Air Force of Angola (FANA, Força Aérea Nacional de Angola) is the air component of the FAA. It is organized in six aviation regiments, each including several squadrons. To each of the regiments correspond an air base. Besides the aviation regiments, there is also a Pilot Training School.\n\nThe Air Force's personnel total about 8,000; its equipment includes transport aircraft and six Russian-manufactured Sukhoi Su-27 fighter aircraft.IISS Military Balance 2013, 494 In 2002 one was lost during the civil war with UNITA forces.[http://www.globaldefence.net/streitkraefte-der-welt/afrika/346-angola.html globaldefence.net: Angolan Armed Forces]  retrieved August 22, 2011 (de)\n\nIn 1991, the Air Force/Air Defense Forces had 8,000 personnel and 90 combat-capable aircraft, including 22 fighters, 59 fighter ground attack aircraft and 16 attack helicopters.\n\nNavy \n\nThe Angola Navy (MGA, Marinha de Guerra de Angola) is the naval component of the FAA. It is organized in two naval zones (North and South), with naval bases in Luanda, Lobito and Namibe. It includes a Marines Brigade and a Marines School, based in Ambriz. The Navy numbers about 1,000 personnel and operates only a handful of small patrol craft and barges.\n\nThe Navy has been neglected and ignored as a military arm mainly due to the guerrilla struggle against the Portuguese and the nature of the civil war. From the early 1990s to the present the Angolan Navy has shrunk from around 4,200 personnel to around 1,000, resulting in the loss of skills and expertise needed to maintain equipment. In order to protect Angola’s 1 600 km long coastline, the Angolan Navy is undergoing modernisation but is still lacking in many ways. Portugal has been providing training through its Technical Military Cooperation (CTM) programme. The Navy is requesting procurement of a frigate, three corvettes, three offshore patrol vessel and additional fast patrol boats.\n\nMost of the vessels in the navy's inventory dates back from the 1980s or earlier, and many of its ships are inoperable due to age and lack of maintenance. However the navy acquired new boats from Spain and France in the 1990s. Germany has delivered several Fast Attack Craft for border protection in 2011.\n\nIn September 2014 it was reported that the Angolan Navy would acquire seven Macaé-class patrol vessels from Brazil as part of a Technical Memorandum of Understanding (MoU) covering the production of the vessels as part of Angola’s Naval Power Development Programme (Pronaval). The military of Angola aims to modernize its naval capability, presumably due to a rise in maritime piracy within the Gulf of Guinea which may have an adverse effect on the country's economy.\n\nThe navy's current known inventory includes the following:\n\n* Fast attack craft\n** 4 Mandume class craft (Bazan Cormoran type, refurbished in 2009)\n* Patrol Boats\n** 3 18.3m long Patrulheiro patrol boats (refurbished in 2002)\n** 5 ARESA PVC-170\n** 2 Namacurra-class harbour patrol boats\n* Fisheries Patrol Boats\n** Ngola Kiluange and Nzinga Mbandi (delivered in September and October 2012 from Damen Shipyards)(Operated by Navy personnel under the Ministry of Agriculture, Rural Development and Fisheries)\n** 28 metre FRV 2810 (Pensador) (Operated by Navy personnel under the Ministry of Agriculture, Rural Development and Fisheries)\n* Landing craft\n** LDM-400 - 1 or 3 (reportedly has serviceability issues)\n* Coastal defense equipment (CRTOC)\n** SS-C1 Sepal radar system\n\nThe navy also has several aircraft for maritime patrol:\n\nSpecial forces \n\nThe FAA include several types of special forces, namely the Commandos, the Special Operations and the Marines. The Angolan special forces follow the general model of the analogous Portuguese special forces, receiving a similar training.\n\nThe Commandos and the Special forces are part of the Special Forces Brigade (BRIFE, Brigada de Forças Especiais), based at Cabo Ledo, in the Bengo Province. The BRIFE includes two battalions of commandos, a battalion of special operations and sub-units of combat support and service support. The BRIFE also included the Special Actions Group (GAE, Grupo de Ações Especiais), which is presently inactive and that was dedicated to long range reconnaissance, covert and sabotage operations. In the Cabo Ledo base is also installed the Special Forces Training School (EFFE, Escola de Formação de Forças Especiais). Both the BRIFE and the EFFE are directly under the Directorate of Special Forces of the General Staff of the Armed Forces.\n\nThe marines (fuzileiros navais) constitute the Marines Brigade of the Angolan Navy. The Marines Brigade is not permanently dependent of the Directorate of Special Forces, but can detach their units and elements to be put under the command of that body for the conduction of exercises or real operations.\n\nSince the disbandment of the Angolan Parachute Battalion in 2004, the FAA do not have a specialized paratrooper unit. However, elements of the commandos, special operations and marines are parachute qualified.\n\nForeign deployments \n\nThe FAPLA's main counterinsurgency effort was directed against UNITA in the southeast, and its conventional capabilities were demonstrated principally in the undeclared South African Border War. The FAPLA first performed its external assistance mission with the dispatch of 1,000 to 1,500 troops to São Tomé and Príncipe in 1977 to bolster the socialist regime of President Manuel Pinto da Costa. During the next several years, Angolan forces conducted joint exercises with their counterparts and exchanged technical operational visits. The Angolan expeditionary force was reduced to about 500 in early 1985.\n\nThe Angolan Armed Forces were controversially involved in training the armed forces of fellow Lusophone states Cape Verde and Guinea-Bissau. In the case of the latter, the 2012 Guinea-Bissau coup d'état was cited by the coup leaders as due to Angola's involvement in trying to \"reform\" the military in connivance with the civilian leadership.\n\nA small number of FAA personnel are stationed in the Democratic Republic of the Congo (Kinshasa) and the Republic of the Congo (Brazzaville). A presence during the unrest in Ivory Coast, 2010–2011, were not officially confirmed. However, the Frankfurter Allgemeine Zeitung, citing Jeune Afrique, said that among President Gbagbo's guards were 92 personnel of President Dos Santos's Presidential Guard Unit.[http://www.faz.net/aktuell/politik/ausland/elfenbeinkueste-gbagbos-letzte-trumpfkarte-als-maertyrer-sterben-1628414.html Gbagbos letzte Trumpfkarte: als Märtyrer sterben], 7 April 2011 Angola is basically interested in the participation of the FAA operations of the African Union and has formed special units for this purpose.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Angolan Armed Forces" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=709" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Angolan Armed Forces (Portuguese: Forças Armadas Angolanas) or FAA are the military of Angola.\n\nThe FAA include the General Staff of the Armed Forces and three components: the Army (Exército), the Navy (Marinha de Guerra) and the National Air Force (National Air Force). Reported total manpower in 2013 was about 107,000.International Institute for Strategic Studies, The Military Balance 2013, 493.\n\nThe FAA is headed by Chief of the General Staff Geraldo Sachipengo Nunda since 2010, who reports to the Minister of National Defense, currently Salviano de Jesus Sequeira.\n\nHistory\n\nThe FAA succeeded to the previous People's Armed Forces for the Liberation of Angola (FAPLA) following the abortive Bicesse Accord with the Armed Forces of the Liberation of Angola (FALA), armed wing of the National Union for the Total Independence of Angola (UNITA). As part of the peace agreement, troops from both armies were to be demilitarized and then integrated. Integration was never completed as UNITA and FALA went back to war in 1992. Later, consequences for FALA personnel in Luanda were harsh with FAPLA veterans persecuting their erstwhile opponents in certain areas and reports of vigilantism.\n\nArmy \n\nGeneral description\n\nThe Army (Exército) is the land component of the FAA. It is organized in six military regions (Cabinda, Luanda, North, Center, East and South), with an infantry division being based in each one. Distributed by the six military regions / infantry divisions, there are 25 motorized infantry brigades, one tank brigade and one engineering brigade. The Army also includes an artillery regiment, the Military Artillery School, the Army Military Academy, an anti-aircraft defense group, a composite land artillery group, a military police regiment, a logistical transportation regiment and a field artillery brigade. The Army further includes the Special Forces Brigade (including Commandos and Special Operations units), but this unit is under the direct command of the General Staff of the FAA.\n\nHistory\n\nOn August 1, 1974 a few months after a military coup d'état had overthrown the Lisbon regime and proclaimed its intention of granting independence to Angola, the MPLA announced the formation of FAPLA, which replaced the EPLA. By 1976 FAPLA had been transformed from lightly armed guerrilla units into a national army capable of sustained field operations.Library of Congress Country Studies\n\nIn 1990-91, the Army had ten military regions and an estimated 73+ 'brigades', each with a mean strength of 1,000 and comprising inf, tank, APC, artillery, and AA units as required.IISS Military Balance 1990 or 1991 The Library of Congress said in 1990 that '[t]he regular army's 91,500 troops were organized into more than seventy brigades ranging from 750 to 1,200 men each and deployed throughout the ten military regions. Most regions were commanded by lieutenant colonels, with majors as deputy commanders, but some regions were commanded by majors. Each region consisted of one to four provinces, with one or more infantry brigades assigned to it. The brigades were generally dispersed in battalion or smaller unit formations to protect strategic terrain, urban centers, settlements, and critical infrastructure such as bridges and factories. Counterintelligence agents were assigned to all field units to thwart UNITA infiltration. The army's diverse combat capabilities were indicated by its many regular and motorised infantry brigades with organic or attached armor, artillery, and air defense units; two militia infantry brigades; four antiaircraft artillery brigades; ten tank battalions; and six artillery battalions. These forces were concentrated most heavily in places of strategic importance and recurring conflict: the oil-producing Cabinda Province, the area around the capital, and the southern provinces where UNITA and South African forces operated.'\n\nIt was reported in 2011 that the army was by far the largest of the services with about 120,000 men and women.[http://www.globaldefence.net/streitkraefte-der-welt/afrika/346-angola.html Global Defence.net: Angolan Armed Forces]  retrieved August 21, 2011 (de) The Angolan Army has around 29,000 \"ghost workers\" who remain enrolled in the ranks of the FAA and therefore receive a salary.[http://www.radioecclesia.org/index.php?optioncom_content&view\narticle&id1686:18-anos-das-for-armadas-angolanas&catid\n130:sociedade&Itemid=483, Rádio Ecclesia: 18 anos das Forças Armadas Angolanas] retrieved August 22, 2011 (pt)\n\nIn 2013, the International Institute for Strategic Studies reported that the FAA had six divisions, the 1st, 5th, and 6th with two or three infantry brigades, and the 2nd, 3rd, and 4th with five to six infantry brigades. The 4th Division included a tank regiment. A separate tank brigade and special forces brigade were also reported.IISS 2013, 493.\n\nAs of 2011, the IISS reported the ground forces had 42 armoured/infantry regiments ('detachments/groups - strength varies') and 16 infantry 'brigades'.IISS Military Balance 2011, 410. These probably comprised infantry, tanks, APC, artillery, and AA units as required. Major equipment included over 140 main battle tanks, 600 reconnaissance vehicles, over 920 AFVs, infantry fighting vehicles, 298 howitzers.Defenceweb.co.za, [http://www.defenceweb.co.za/index.php?option\ncom_content&viewarticle&id\n29331:angola&catid119:african-militaries&Itemid\n255 Angola], February 2013.\n\nIt was reported on May 3, 2007, that the Special Forces Brigade of the Angolan Armed Forces (FAA) located at Cabo Ledo region, northern Bengo Province, would host a 29th anniversary celebration for the entire armed forces. The brigade was reportedly formed on 5 May 1978 and under the command at the time of Colonel Paulo Falcao.[http://www.portalangop.co.ao/angola/en_us/noticias/politica/2007/4/18/Army-Special-Forces-Brigade-Celebrate-Years,38c72dcf-fced-44c2-a0c8-cdc9689f0ecd.html Army Special Forces Celebrate Years], May 3, 2007.\n\nEquipment\n\nThe Army operates a large amount of Russian, Soviet and ex-Warsaw pact hardware. A large amount of its equipment was acquired in the 1980s and 1990s most likely because of hostilities with neighbouring countries and its civil war which lasted from November 1975 until 2002. There is an interest from the Angolan Army for the Brazilian ASTROS II multiple rocket launcher.\n\nInfantry Weapons\n\nMany of Angola's weapons are of Portuguese colonial and Warsaw Pact origin. Jane's Information Group lists the following as in service:\n* Rifles in service with Army include the AK-47, AKM, FN FAL, G3 Assault Rifle, SKS and IMI Tavor.\n* Pistols include the Makarov pistol, Stechkin automatic pistol and the Tokarev TT pistol.\n* Submachine guns include the Škorpion vz. 61, Star Z-45, Uzi and the FBP submachine gun.\n* Machine guns include the RP-46, RPD machine gun, Vz. 52 machine gun and the DShK Heavy machine gun.\n* Grenade launchers include the AGS-17 automatic grenade launcher.  \n* Mortars include the 120-PM-43 mortar (500 in service) and the 82-PM-41 (250 in service). \n* Anti-Tank weapons include the RPG-7, 9K111 Fagot (650 ordered in 1987), 9K11 Malyutka, B-10 recoilless rifle and the B-11 recoilless rifle.Jones, Richard D. Jane's Infantry Weapons 2009/2010. Jane's Information Group; 35 edition (January 27, 2009). .\n\nMain Battle Tanks\n\n* Between 116 and 267 T-55AM-2 Medium tanks. 281 T-55's were ordered between 1975 and 1999.  267 T-55AM-2's were delivered from Bulgaria and Slovakia in 1999.\n* 50 T-72M1 main battle tanks. Delivered from Belarus in 1999. \n* 50 T-62 Main battle tanks. 364 were ordered in the 1980s and 1990s.\n* 12 PT-76 Amphibious Light tanks. 68 ordered in 1975 from the Soviet Union.\n\nArmoured Vehicles\n\n* 150 BMP-1 infantry fighting vehicles.\n* 100 BMP-2 infantry fighting vehicles.\n* 10 BMD-3 infantry fighting vehicles.\n* 195 BRDM-2 and 120 BRDM-1 Amphibious Armoured Scout Cars.\n* 62 BTR-60 and 50 OT-62 TOPAS armored personnel carriers\n* 45  Casspir NG 2000B Infantry mobility vehicles\n* 24 EE-11 Urutu armored personnel carriers\n\nArtillery\n\n* 12 2S1 Gvozdika 122 mm Self-propelled guns (Acquired in 2000 from the Czech Republic).\n* 4 2S3 Akatsiya 152 mm Self-propelled guns (Acquired in 1999 from the Bulgaria).\n* 12 2S7 Pion 203 mm Self-propelled guns (Acquired in 2000 from the Czech Republic).\n* Unknown amounts of M1942 ZiS-3 Anti-tank field guns\n* ~280 D-30 122 mm Howitzers (28 from Kazakhstan in 1998, 12 from Belarus, 240 from the Soviet Union in the 1980s)\n* 4 D-20 Howitzers.\n* Unknown amounts of 85 mm divisional gun D-44 Field Guns.\n* 48 M-46 130 mm field guns\n* 75 BM-21 Grad multiple rocket launchers\n* 40 RM-70 multiple rocket launchers\n\nAnti-Aircraft weaponry\n\n* 20 ZSU-23-4 Shilka Self-propelled anti-aircraft guns.\n* 40 ZSU-57-2 Self-propelled anti-aircraft guns\n* Unknown amounts of ZU-23-2, 57 mm AZP S-60, M-1939, ZPU-4 and M-55 anti-aircraft guns.\n* 40 SA-2 Guideline high-altitude air defense systems.\n* 12 SA-3 Goa\n* 25 SA-6\n* Unknown amounts of SA-7 Grail\n* 15 SA-8\n* 20 SA-9 Gaskin\n* 10 SA-13\n* Unknown amounts of SA-14 Gremlin and SA-16 Gimlet.\n\nOther Vehicles\n\n* Ural-4320 trucks\n* Star 266\n* KrAZ-6322\n\nAir Force \n\nThe National Air Force of Angola (FANA, Força Aérea Nacional de Angola) is the air component of the FAA. It is organized in six aviation regiments, each including several squadrons. To each of the regiments correspond an air base. Besides the aviation regiments, there is also a Pilot Training School.\n\nThe Air Force's personnel total about 8,000; its equipment includes transport aircraft and six Russian-manufactured Sukhoi Su-27 fighter aircraft.IISS Military Balance 2013, 494 In 2002 one was lost during the civil war with UNITA forces.[http://www.globaldefence.net/streitkraefte-der-welt/afrika/346-angola.html globaldefence.net: Angolan Armed Forces]  retrieved August 22, 2011 (de)\n\nIn 1991, the Air Force/Air Defense Forces had 8,000 personnel and 90 combat-capable aircraft, including 22 fighters, 59 fighter ground attack aircraft and 16 attack helicopters.\n\nNavy \n\nThe Angola Navy (MGA, Marinha de Guerra de Angola) is the naval component of the FAA. It is organized in two naval zones (North and South), with naval bases in Luanda, Lobito and Namibe. It includes a Marines Brigade and a Marines School, based in Ambriz. The Navy numbers about 1,000 personnel and operates only a handful of small patrol craft and barges.\n\nThe Navy has been neglected and ignored as a military arm mainly due to the guerrilla struggle against the Portuguese and the nature of the civil war. From the early 1990s to the present the Angolan Navy has shrunk from around 4,200 personnel to around 1,000, resulting in the loss of skills and expertise needed to maintain equipment. In order to protect Angola’s 1 600 km long coastline, the Angolan Navy is undergoing modernisation but is still lacking in many ways. Portugal has been providing training through its Technical Military Cooperation (CTM) programme. The Navy is requesting procurement of a frigate, three corvettes, three offshore patrol vessel and additional fast patrol boats.\n\nMost of the vessels in the navy's inventory dates back from the 1980s or earlier, and many of its ships are inoperable due to age and lack of maintenance. However the navy acquired new boats from Spain and France in the 1990s. Germany has delivered several Fast Attack Craft for border protection in 2011.\n\nIn September 2014 it was reported that the Angolan Navy would acquire seven Macaé-class patrol vessels from Brazil as part of a Technical Memorandum of Understanding (MoU) covering the production of the vessels as part of Angola’s Naval Power Development Programme (Pronaval). The military of Angola aims to modernize its naval capability, presumably due to a rise in maritime piracy within the Gulf of Guinea which may have an adverse effect on the country's economy.\n\nThe navy's current known inventory includes the following:\n\n* Fast attack craft\n** 4 Mandume class craft (Bazan Cormoran type, refurbished in 2009)\n* Patrol Boats\n** 3 18.3m long Patrulheiro patrol boats (refurbished in 2002)\n** 5 ARESA PVC-170\n** 2 Namacurra-class harbour patrol boats\n* Fisheries Patrol Boats\n** Ngola Kiluange and Nzinga Mbandi (delivered in September and October 2012 from Damen Shipyards)(Operated by Navy personnel under the Ministry of Agriculture, Rural Development and Fisheries)\n** 28 metre FRV 2810 (Pensador) (Operated by Navy personnel under the Ministry of Agriculture, Rural Development and Fisheries)\n* Landing craft\n** LDM-400 - 1 or 3 (reportedly has serviceability issues)\n* Coastal defense equipment (CRTOC)\n** SS-C1 Sepal radar system\n\nThe navy also has several aircraft for maritime patrol:\n\nSpecial forces \n\nThe FAA include several types of special forces, namely the Commandos, the Special Operations and the Marines. The Angolan special forces follow the general model of the analogous Portuguese special forces, receiving a similar training.\n\nThe Commandos and the Special forces are part of the Special Forces Brigade (BRIFE, Brigada de Forças Especiais), based at Cabo Ledo, in the Bengo Province. The BRIFE includes two battalions of commandos, a battalion of special operations and sub-units of combat support and service support. The BRIFE also included the Special Actions Group (GAE, Grupo de Ações Especiais), which is presently inactive and that was dedicated to long range reconnaissance, covert and sabotage operations. In the Cabo Ledo base is also installed the Special Forces Training School (EFFE, Escola de Formação de Forças Especiais). Both the BRIFE and the EFFE are directly under the Directorate of Special Forces of the General Staff of the Armed Forces.\n\nThe marines (fuzileiros navais) constitute the Marines Brigade of the Angolan Navy. The Marines Brigade is not permanently dependent of the Directorate of Special Forces, but can detach their units and elements to be put under the command of that body for the conduction of exercises or real operations.\n\nSince the disbandment of the Angolan Parachute Battalion in 2004, the FAA do not have a specialized paratrooper unit. However, elements of the commandos, special operations and marines are parachute qualified.\n\nForeign deployments \n\nThe FAPLA's main counterinsurgency effort was directed against UNITA in the southeast, and its conventional capabilities were demonstrated principally in the undeclared South African Border War. The FAPLA first performed its external assistance mission with the dispatch of 1,000 to 1,500 troops to São Tomé and Príncipe in 1977 to bolster the socialist regime of President Manuel Pinto da Costa. During the next several years, Angolan forces conducted joint exercises with their counterparts and exchanged technical operational visits. The Angolan expeditionary force was reduced to about 500 in early 1985.\n\nThe Angolan Armed Forces were controversially involved in training the armed forces of fellow Lusophone states Cape Verde and Guinea-Bissau. In the case of the latter, the 2012 Guinea-Bissau coup d'état was cited by the coup leaders as due to Angola's involvement in trying to \"reform\" the military in connivance with the civilian leadership.\n\nA small number of FAA personnel are stationed in the Democratic Republic of the Congo (Kinshasa) and the Republic of the Congo (Brazzaville). A presence during the unrest in Ivory Coast, 2010–2011, were not officially confirmed. However, the Frankfurter Allgemeine Zeitung, citing Jeune Afrique, said that among President Gbagbo's guards were 92 personnel of President Dos Santos's Presidential Guard Unit.[http://www.faz.net/aktuell/politik/ausland/elfenbeinkueste-gbagbos-letzte-trumpfkarte-als-maertyrer-sterben-1628414.html Gbagbos letzte Trumpfkarte: als Märtyrer sterben], 7 April 2011 Angola is basically interested in the participation of the FAA operations of the African Union and has formed special units for this purpose. Angolan Armed Forces. http://en.wikipedia.org/?curid=709."
  }
}
