{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4561",
  "eid" : "cee89c40-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778426884,
  "textBody" : "Brian Wilson Aldiss, OBE (; 18 August 1925 – 19 August 2017) was an English writer and anthologies editor, best known for science fiction novels and short stories. His byline reads either Brian W. Aldiss or simply Brian Aldiss, except for occasional pseudonyms during the mid-1960s.\n\nGreatly influenced by science fiction pioneer H. G. Wells, Aldiss was a vice-president of the international H. G. Wells Society. He was (with Harry Harrison) co-president of the Birmingham Science Fiction Group. Aldiss was named a Grand Master by the Science Fiction Writers of America in 2000 and inducted by the Science Fiction Hall of Fame in 2004. He received two Hugo Awards, one Nebula Award, and one John W. Campbell Memorial Award. He wrote the short story \"Super-Toys Last All Summer Long\" (1969), the basis for the Stanley Kubrick-developed Steven Spielberg film A.I. Artificial Intelligence (2001). Aldiss was associated with the British New Wave of science fiction.\n\nLife and career \n\nEarly life, education, and military service\n\nAldiss was born on 18 August 1925, above his paternal grandfather's draper's shop in Dereham, Norfolk. When Aldiss's grandfather died, his father, Bill (the younger of two sons), sold his share in the shop and the family left Dereham. Aldiss's mother, Dot, was the daughter of a builder. He had an older sister who was stillborn, and a younger sister.  As a 3-year-old, Aldiss started to write stories which his mother would bind and put on a shelf. At the age of 6, he went to Framlingham College but moved to Devon and was sent to board at West Buckland School in Devon in 1939 after the outbreak of the war. As a child he discovered the pulp magazine Astounding Science Fiction, and read all the novels by H. G. Wells and Robert Heinlein, and later Philip K. Dick.[https://www.nytimes.com/2017/08/24/books/brian-aldiss-author-of-science-fiction-and-much-more-dies-at-92.html Brian Aldiss, Author of Science Fiction and Much More, Dies at 92] In 1943, during the Second World War, he joined the Royal Signals and saw action in Burma.\n\nWriting and publishing\n\nHis Army experience inspired the Horatio Stubbs second and third books, A Soldier Erect and A Rude Awakening, respectively.\n\nAfter the war, he worked as a bookseller in Oxford. He also wrote a number of short pieces for a booksellers' trade journal about life in a fictitious bookshop, which attracted the attention of Charles Monteith, an editor at the publisher Faber and Faber. As a result, Faber and Faber published Aldiss' first book, The Brightfount Diaries (1955), a 200-page novel in diary form about the life of a sales assistant in a bookshop.\n\nAbout this time he also began to write science fiction for various magazines. According to ISFDB, his first speculative fiction in print was the short story Criminal Record, published by John Carnell in the July 1954 issue of Science Fantasy. Several of his stories appeared in 1955, including three in monthly issues of New Worlds, a more important magazine also edited by Carnell.\n\nIn 1954, The Observer newspaper ran a competition for a short story set in the year 2500. Aldiss' story Not For An Age was ranked third following a reader vote.\n\nThe Brightfount Diaries had been a minor success, and Faber asked Aldiss if he had any more writing they could look at with a view to publishing. Aldiss confessed to being a science fiction author, to the delight of the publishers, who had a number of science fiction fans in high places, and so his first science fiction book was published, a collection of short stories entitled Space, Time and Nathaniel (Faber, 1957). By this time, his earnings from writing matched his wages in the bookshop, and he made the decision to become a full-time writer.\n\nAldiss led the voting for Most Promising New Author of 1958 at the next year's Worldcon, but finished behind \"no award\". He was elected president of the British Science Fiction Association in 1960. He was the literary editor of the Oxford Mail newspaper from 1958 to 1969. Around 1964, he and long-time collaborator Harry Harrison started the first ever journal of science fiction criticism, Science Fiction Horizons, which during its brief span of two issues published articles and reviews by such authors as James Blish, and featured a discussion among Aldiss, C. S. Lewis, and Kingsley Amis in the first issue and an interview with William S. Burroughs in the second. In 1967 Algis Budrys listed Aldiss, J. G. Ballard, Roger Zelazny, and Samuel R. Delany as \"an earthshaking new kind of\" writers, and leaders of the New Wave.\n\nBesides his own writings, he had great success as an anthologist. For Faber he edited Introducing SF, a collection of stories typifying various themes of science fiction, and Best Fantasy Stories. In 1961, he edited an anthology of reprinted short science fiction for the British paperback publisher Penguin Books under the title Penguin Science Fiction. This was remarkably successful, went into numerous reprints, and was followed up by two further anthologies: More Penguin Science Fiction (1963) and Yet More Penguin Science Fiction (1964). The later anthologies enjoyed the same success as the first, and all three were eventually published together as The Penguin Science Fiction Omnibus (1973), which also went into a number of reprints. In the 1970s, he produced several large collections of classic grand-scale science fiction, under the titles Space Opera (1974), Space Odysseys (1975), Galactic Empires (1976), Evil Earths (1976), and Perilous Planets (1978) which were quite successful. Around this time, he edited a large-format volume Science Fiction Art (1975), with selections of artwork from the magazines and pulps.\n\nIn response to the results from the planetary probes of the 1960s and 1970s, which showed that Venus was completely unlike the hot, tropical jungle usually depicted in science fiction, Aldiss and Harrison edited an anthology Farewell, Fantastic Venus!, reprinting stories based on the pre-probe ideas of Venus. He also edited, with Harrison, a series of anthologies The Year's Best Science Fiction (Nos. 1–9, 1968–1976).\n\nAldiss invented a form of extremely short story called the mini-saga. The Daily Telegraph hosted a competition for the best mini-saga for several years, and Aldiss was the judge. He has edited several anthologies of the best mini-sagas.\n\nAldiss travelled to Yugoslavia, where he met fans in Ljubljana, Slovenia and published a travel book about Yugoslavia entitled Cities and Stones (1966), his only work in the genre. He published an alternative-history fantasy story, \"The Day of the Doomed King\" (1968), about Serbian kings in the Middle Ages, and wrote a novel called The Malacia Tapestry, about an alternative Dalmatia.\n\nArt\n\nIn addition to a highly successful career as a writer, Aldiss was an accomplished artist. His first solo exhibition, The Other Hemisphere, was held in Oxford, August–September 2010, and the exhibition's centrepiece Metropolis (see figure) has since been released as a limited edition fine art print.(The exhibition title denotes the writer/artist's notion, \"words streaming from one side of his brain inspiring images in what he calls 'the other hemisphere'.\")\n\nPersonal life\n\nIn 1948, Aldiss married Olive Fortescue, secretary to the owner of Sanders' bookseller's in Oxford, where he had worked since 1947. He had two children from his first marriage: Clive in 1955 and Caroline Wendy in 1957, but the marriage \"finally collapsed\" in 1959 and dissolved in 1965.\n\nIn 1965, he married his second wife, Margaret Christie Manson (daughter of John Alexander Christie Manson, an aeronautical engineer)Science Fiction and Fantasy Literature, vol. 2, R. Reginald, 1979, pg 793 , a Scottish woman and secretary to the editor of the Oxford Mail; Aldiss was 40, and she 31. They lived in Oxford and had two children together, Tim and Charlotte. She died in 1997.\n\nDeath\n\nAldiss died on 19 August 2017, the day after his 92nd birthday.\n\nAwards and honours\n\nHe was elected a Fellow of the Royal Society of Literature in 1990.\n\nAldiss was the \"Permanent Special Guest\" at the annual International Conference on the Fantastic in the Arts (ICFA) from 1989 through 2008. He was also the Guest of Honor at the conventions in 1986 and 1999.\n\nThe Science Fiction Writers of America made him its 18th SFWA Grand Master in 2000 and the Science Fiction and Fantasy Hall of Fame inducted him in 2004.\n\nHe was awarded the title of Officer of the Order of the British Empire (OBE) for services to literature in the 2005 Birthday Honours list.\n\nIn January 2007 he appeared on Desert Island Discs. His choice of record to 'save' was \"Old Rivers\" sung by Walter Brennan, his choice of book was John Heilpern's biography of John Osborne, and his luxury a banjo. The full selection of eight favourite records is on the BBC website.\n\nOn 1 July 2008 he was awarded an honorary doctorate by the University of Liverpool in recognition of his contribution to literature. The Brian W Aldiss Archive at the University holds manuscripts from the period 1943–1995.\n\nIn 2013, Aldiss was recipient of the World Fantasy Convention Award at the World Fantasy Convention in Brighton, England.\n\nAldiss sat on the Council of the Society of Authors.\n\nHe won two Hugo awards: in 1962 for the Hothouse series; and in 1987 for Trillion Year Spree.  Aldiss also won a Nebula award in 1965 for The Saliva Tree: And Other Strange Growths.\n\nBooks \n\nAldiss was the author of over 80 books and 300 short stories. he also wrote several volumes of poetry.\nFiction \n\n* The Rain Will Stop The Pretentious Press (2000), written in 1942 \n* The Brightfount Diaries Faber (1955)\n* Space, Time and Nathaniel Faber (1957), Four Square 1496 (1966), Panther (1979), collected short fiction — all of his science fiction published to date, including \"T\", his first published story, and \"Not For an Age\" (thirteen stories) plus one story hurriedly written to fill out the volume\n* Non-Stop Faber (1958), Digit (1959), Pan (1976), Millennium (2000), US title Starship Signet S1779 (1960), Avon V2321 (1969) — A member of a culturally primordial tribe investigates the dark, jungle filled corridors that surround him to ultimately uncover the true nature of the universe he inhabits.\n* Equator ( serialized 1958), Digit R533  (US title Vanguard from Alpha Ace (1959)\n* The Canopy of Time Faber (1959), Four Square 821 (1963), collected short fiction. (The US title Galaxies Like Grains of Sand Signet S1815 (1960), Panther (1979), was a different version, which Aldiss preferred)\n* No Time Like Tomorrow Signet S1683 (1959), collected short fiction (contents: T, Not for an Age, Poor Little Warrior!, The Failed Men, Carrion Country, Judas Danced, Psyclops, Outside, Gesture of Farewell, The New Father Christmas, Our Kind of Knowledge)\n* The Interpreter Digit R506 (1960), Four Square 1970 (1967); US title Bow down to Nul Ace D-443 — A short novel about the huge, old galactic empire of Nuls, a giant, three-limbed, civilised alien race. Earth is just a lesser-than-third-class colony ruled by a Nul tyrant whose deceiving devices together with good willing but ineffective attempts of a Nul signatory to clarify the abuses and with the disorganised earthling resistance reflect the complex relationship existing between imperialists and subject races which Aldiss himself had the chance of seeing at first hand when serving in India and Indonesia in the forties.\n* The Male Response Beacon 45 (1959), Four Square 1623 (1961)\n* The Primal Urge Ballantine F555 (1961), Sphere (1967), Panther (1976)\n* Hothouse Faber (1962), Four Square 1147 (1965), Panther 1979) published in abridged form in the American market as The Long Afternoon of Earth Signet D2018 (1962)— Set in a far future Earth, where the earth has stopped rotating, the Sun has increased output, and plants are engaged in a constant frenzy of growth and decay, like a tropical forest enhanced a thousandfold; a few small groups of elvish humans still live on the edge of extinction, beneath the giant banyan tree that covers the day side of the earth. This assemblage of stories won the Hugo Award for short fiction in 1962.\n* The Airs of Earth Faber (1963), Four Square 1325 (195) US title Starswarm Signet D2411 (1964), collected short fiction\n* The Dark Light Years Signet D2497 (1964), Faber (1964), Four Square 1437 (1966), Panther (1979) — The encounter of humans with the utods, gentle aliens whose physical and mental health requires wallowing in mud and filth, who are not even recognised as intelligent by the humans.\n* Greybeard Harcourt, Brace & World (1964), Faber (1964), Signet P2689 (1965), Panther (1968) — Set decades after the Earth's population has been sterilised as a result of nuclear bomb tests conducted in Earth's orbit, the book shows an emptying world, occupied by an aging, childless population.\n* Best SF stories of Brian Aldiss Faber (1965); US title Who Can Replace a Man? Harcourt, Brace & World (1965), Signet P3311 (1967)\n* Earthworks Faber (1965), Four Square (1967), Signet P3116 (1967), Panther (1979), Avon (1980)\n* The Impossible Smile (1965), previously a Science Fantasy magazine serial under the pseudonym \"Jael Cracken\"\n*  The Saliva Tree and Other Strange Growths Faber (1966), Sphere (1968), collected short fiction — Title story \"The Saliva Tree\" was  written to mark the centenary of H. G. Wells's birth, and shared the Nebula Award for the best novella of 1964.  While set in a Wellsian milieu, it contains two plot elements also found in the stories of H.P.Lovecraft: an object from space which causes crops and livestock to grow prolifically, but be unpalatable (The Colour out of Space); and a monster which is visible only when sprayed with an opaque powder (The Dunwich Horror).\n* An Age Faber (1967), Sphere (1969), Panther (1979), US title Cryptozoic! Avon (1969), Panther (1978), a dystopic time-travel novel\n* Report on Probability A (serialized 1967), Faber (1968), Sphere (1969). Doubleday (1969), Lancer (1970), Avon (1980)\n* Intangibles, Inc. Faber (1969), Corgi (1971). Collection\n* Barefoot in the Head Faber (1969), Doubleday (1970), Ace (1972), Corgi (1974), AVON (1981), Gollancz VGSF Classics (1990)/ Perhaps Aldiss's most experimental work, this first appeared in several parts as the 'Acid Head War' series in New Worlds. Set in a Europe some years after a flare-up in the Middle East led to Europe being attacked with bombs releasing huge quantities of long-lived hallucinogenic drugs. Into an England with a population barely maintaining a grip on reality comes a young Serb, who himself starts coming under the influence of the ambient aerosols, and finds himself leading a messianic crusade. The narration and dialogue reflects the shattering of language under the influence of the drugs, in mutating phrases and puns and allusions, in a deliberate echo of Finnegans Wake.\n* The Moment of Eclipse Faber (1970), Doubleday (1972), Panther (1973), collected short fiction — British Science Fiction Association (BSFA) Award. British Science Fiction Association. Archived 2011-05-19. Retrieved 2013-04-25.\n* Neanderthal Planet Avon (1970), collected short fiction\n* Horatio Stubbs (omnibus edition, The Horatio Stubbs Saga Panther (1985)) \n** The Hand-Reared Boy Weidenfeld & Nicolson (1970), Signet T4575 (1971), Corgi (1971)\n** A Soldier Erect Weidenfeld & Nicolson (1971), Corgi (1972)\n** A Rude Awakening Weidenfeld & Nicolson (1978), Corgi (1979)\n* The Book of Brian Aldiss DAW 29 (1972), UK title The Comic Inferno New English Library (1973), collected short fiction\n* Frankenstein Unbound Jonathan Cape (1973), Random House (1974), Fawcett Crest (1975), Pan (1975)— A 21st century politician is transported to 19th century Switzerland where he encounters both Frankenstein and Mary Shelley. It was the basis for the 1990 film of the same title, directed by Roger Corman.\n* The Eighty Minute Hour Jonathan Cape (1974), Doubleday (1974), Leisure (1975), Pan (1975) — A weird and ambitious \"space opera\" whose characters actually sing. The world is in chaos after nuclear war causes time slips and even those that believe they rule the world have trouble knowing where and when they are.\n* The Malacia Tapestry Jonathan Cape (1976), Harper & Row (1977), Panther (1978), Ace (1978), Berkley (1985) - A picaresque novel with fantasy elements, set in a city not unlike Venice. However, it is a Venice without Christianity or monotheism, existing within an alternate version of Renaissance or Early Baroque Italy.\n* Brothers of the Head Pierrot (1977), Panther (1979) — A large-format book, illustrated by Ian Pollock, tells the strange story of the rock stars Tom and Barry Howe, Siamese twins with a third, dormant head that eventually starts to awaken. Adapted into a 2006 film by Keith Fulton and Lou Pepe.\n* Last Orders and Other Stories Jonathan Cape (1977), Panther (1979). Collection\n* Enemies of the System Jonathan Cape (1978), Harper & Row (1978), Panther (1980), Avon (1981)\n* Pile (1979) Poem\n*New Arrivals, Old Encounters Jonathan Cape (1979), Harper & Row (1980), Avon (1981). Collection\n* Moreau's Other Island Jonathan Cape (1980), Panther (1982), as An Island Called Moreau Simon & Schuster (1981), Timescape (1981)\n* Squire Quartet\n**  Life In The West Weidenfeld & Nicolson (1980), Corgi (1982)\n**  Forgotten Life Gollancz (1988), Atheneum / Macmillan (1989), Mandarin (1989)\n**  Remembrance Day HarperCollins (UK) (1993), St. Martin's Press (1993), Flamingo (1994)\n**  Somewhere East Of Life Carroll & Graf (1994), Flamingo (1994) \n* Helliconia trilogy \n** Helliconia Spring Atheneum (1982), Jonathan Cape (1982),  Berkley (1983), Granada (1983)— BSFA Award; Campbell Memorial Award; Nebula Award finalist\n** Helliconia Summer  Atheneum (1983), Jonathan Cape (1983),  Berkley (1984), Granada (1985) — BSFA finalist; Locus Award, fourth place\n** Helliconia Winter  Atheneum (1985), Jonathan Cape (1985),  Berkley (1986), Granada (1986) — BSFA; Nebula finalist; Locus, fifth place\n** Helliconia (omnibus) Gollancz SF Masterworks (2010)\n* Seasons in Flight Jonathan Cape (1984), Atheneum (1986), Grafton (1986), Ace (1988)\n* Courageous New Planet (c. 1984)\n* The Year before Yesterday (1987) Franklin Watts (1987), Kerosina (1987), St. Martin's (1988), New English Library (1989). Fix-up of Equator (1958) and The Impossible Smile (1965)\n* Ruins (1987)\n* Man in His Time Atheneum (1989),  ,  Collier (1990)\n* A Romance of the Equator: The Best Fantasy Stories Gollancz (1989) Atheneum / Macmillan (1990) \n* Dracula Unbound HarperCollins (1990), Graftton (1991)\n* A Tupolev too Far  HarperCollins (UK) (1993), St. Martin's (1994)\n* The Secret of This Book HarperCollins (UK) (1995), US title Common Clay: 20-Odd Stories St. Martin's (1996)\n* White Mars or, the Mind Set Free Little, Brown UK (1999), St. Martin's (2000), by Aldiss and Roger Penrose. \n* Super-Toys Last All Summer Long and Other Stories of Future Time Orbit (2001), St. Martin's (2001), collected short fiction — Title story \"Super-Toys Last All Summer Long\" was the basis for the Steven Spielberg film A.I.: Artificial Intelligence\n* Super-State Orbit (2002)\n* The Cretan Teat (2002)\n* Affairs at Hampden Ferrers (2004)\n* Cultural Breaks (2005), collected short fiction. Tachyon Publications.\n* Jocasta Rose Press (2005). A re-telling of Sophocles's Theban tragedies concerning Oedipus and Antigone. In Aldiss's novel, myth and magic are vibrantly real, experienced through an evolving human consciousness. Amidst various competing interpretations of reality, including the appearance of a time-travelling Sophocles, Aldiss provides an engaging alternative explanation of the Sphinx's riddle.\n* Sanity and the Lady PS Publishing (2005)\n* HARM del Rey (2007), Duckworth (2007) — Campbell Award nominee The Award recognises second and third-place runners-up. Recent lists of finalists are long, 14 in 2008.\n* Walcot Goldmark (2009) — Family saga spanning the 20th century\n* Finches of Mars (2012)http://www.harpercollins.co.uk/Titles/75944/finches-of-mars-brian-aldiss-9780007478927  \n* Comfort Zone (2013)\n\nPoetry \n\n* Home Life With Cats (1992)\n* At The Caligula Hotel (1995)\n* Songs From The Steppes Of Central Asia (1995)\n* A Plutonian Monologue on His Wife's Death (The Frogmore Papers, 2000)\n* At A Bigger House (2002)\n* The Dark Sun Rises (2002)\n* A Prehistory of Mind (Mayapple Press, 2008)\n* Mortal Morning (2011)\n\nNonfiction \n\n* Cities and Stones: A Traveller's Yugoslavia (1966)\n* The Shape of Further Things: Speculations on Change (1970)\n* Item Eighty Three (1972), by Brian and Margaret Aldiss — A bibliography of Aldiss's published works, this book being number 83\n* Billion Year Spree: The History of Science Fiction (1973) — BSFA special award \n* Hell's Cartographers (1975), co-edited with Harry Harrison — A collection of short autobiographical pieces by a number of science fiction writers, including Aldiss. The title is a reference to Kingsley Amis's survey of science fiction, New Maps of Hell.\n* This World and Nearer Ones: Essays Exploring the Familiar (1979).\n* Trillion Year Spree: The History of Science Fiction (1986), by Aldiss and David Wingrove — A revised and expanded version of Billion Year Spree and winner of the 1987 Hugo Award for the year's best nonfiction. At the 'Conspiracy 87' ceremony, Aldiss began his acceptance speech by holding the Hugo aloft and proclaiming, to general approbation, \"It's been a long time since you've given me one of these, you bastards!\"David Langford, The Sex Column and Other Misprints, Cosmos Books, 2005, p. 82. The quotation may not be reported exactly.\n* The Pale Shadow Of Science (1985), collected essays\n* ... And the Lurid Glare of the Comet (1986), articles and autobiography\n* Bury My Heart at W.H. Smith's: A Writing Life (1990), autobiography\n* The Detached Retina: Aspects of SF and Fantasy (1995).\n* The Twinkling of an Eye, or My Life as an Englishman (1998)\n* When the Feast is Finished (1999), by Brian and Margaret Aldiss\n* Art After Apogee: The Relationships Between an Idea, a Story, a Painting (2000), by Aldiss and Rosemary Phipps\n* An Exile on Planet Earth: Articles and Reflections (2012), articles and autobiography\n\nAnthologies edited \n\n* Penguin Science Fiction (1961)\n* More Penguin Science Fiction (1963)\n* Yet More Penguin Science Fiction (1964)\n* Nebula Award Stories Two (with Harry Harrison)  (1967)\n* The Year's Best Science Fiction No. 1 (with Harry Harrison)  (1968)\n* The Year's Best Science Fiction No. 2 (with Harry Harrison)  (1969)\n* The Year's Best Science Fiction No. 3 (with Harry Harrison)  (1970)\n* The Year's Best Science Fiction No. 4 (with Harry Harrison)  (1971)\n* The Year's Best Science Fiction No. 5 (with Harry Harrison)  (1972)\n* The Year's Best Science Fiction No. 6 (with Harry Harrison)  (1973)\n* The Penguin Science Fiction Omnibus (1973)\n* Space Opera (1974)\n* Space Odysseys (1974)\n* Decade: the 1940's (with Harry Harrison)  (1975)\n* Decade: the 1950's (with Harry Harrison)  (1976)\n* Decade: the 1960's (with Harry Harrison)  (1979)\n* Evil Earths (1976)\n* Galactic Empires, Volume 1 (1976)\n* Galactic Empires, Volume 2 (1976)\n* Mini Sagas from the Daily Telegraph Competition (1998) \n* Mini Sagas From the Daily Telegraph Competition 2001 (2001) \n* A Science Fiction Omnibus (2007) \n* The Folio Science Fiction Anthology (2016)\n\nOther \n\n* \"Umwelts for Hire\", Doctor Who Brilliant Book 2011 (BBC Books, 2010, ), a Doctor Who short story\n* \"The Small Stones of Tu Fu\", Asimov's Choice: Comets & Computers (Dale Books, 1978, )",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Brian Aldiss" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4561" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Brian Wilson Aldiss, OBE (; 18 August 1925 – 19 August 2017) was an English writer and anthologies editor, best known for science fiction novels and short stories. His byline reads either Brian W. Aldiss or simply Brian Aldiss, except for occasional pseudonyms during the mid-1960s.\n\nGreatly influenced by science fiction pioneer H. G. Wells, Aldiss was a vice-president of the international H. G. Wells Society. He was (with Harry Harrison) co-president of the Birmingham Science Fiction Group. Aldiss was named a Grand Master by the Science Fiction Writers of America in 2000 and inducted by the Science Fiction Hall of Fame in 2004. He received two Hugo Awards, one Nebula Award, and one John W. Campbell Memorial Award. He wrote the short story \"Super-Toys Last All Summer Long\" (1969), the basis for the Stanley Kubrick-developed Steven Spielberg film A.I. Artificial Intelligence (2001). Aldiss was associated with the British New Wave of science fiction.\n\nLife and career \n\nEarly life, education, and military service\n\nAldiss was born on 18 August 1925, above his paternal grandfather's draper's shop in Dereham, Norfolk. When Aldiss's grandfather died, his father, Bill (the younger of two sons), sold his share in the shop and the family left Dereham. Aldiss's mother, Dot, was the daughter of a builder. He had an older sister who was stillborn, and a younger sister.  As a 3-year-old, Aldiss started to write stories which his mother would bind and put on a shelf. At the age of 6, he went to Framlingham College but moved to Devon and was sent to board at West Buckland School in Devon in 1939 after the outbreak of the war. As a child he discovered the pulp magazine Astounding Science Fiction, and read all the novels by H. G. Wells and Robert Heinlein, and later Philip K. Dick.[https://www.nytimes.com/2017/08/24/books/brian-aldiss-author-of-science-fiction-and-much-more-dies-at-92.html Brian Aldiss, Author of Science Fiction and Much More, Dies at 92] In 1943, during the Second World War, he joined the Royal Signals and saw action in Burma.\n\nWriting and publishing\n\nHis Army experience inspired the Horatio Stubbs second and third books, A Soldier Erect and A Rude Awakening, respectively.\n\nAfter the war, he worked as a bookseller in Oxford. He also wrote a number of short pieces for a booksellers' trade journal about life in a fictitious bookshop, which attracted the attention of Charles Monteith, an editor at the publisher Faber and Faber. As a result, Faber and Faber published Aldiss' first book, The Brightfount Diaries (1955), a 200-page novel in diary form about the life of a sales assistant in a bookshop.\n\nAbout this time he also began to write science fiction for various magazines. According to ISFDB, his first speculative fiction in print was the short story Criminal Record, published by John Carnell in the July 1954 issue of Science Fantasy. Several of his stories appeared in 1955, including three in monthly issues of New Worlds, a more important magazine also edited by Carnell.\n\nIn 1954, The Observer newspaper ran a competition for a short story set in the year 2500. Aldiss' story Not For An Age was ranked third following a reader vote.\n\nThe Brightfount Diaries had been a minor success, and Faber asked Aldiss if he had any more writing they could look at with a view to publishing. Aldiss confessed to being a science fiction author, to the delight of the publishers, who had a number of science fiction fans in high places, and so his first science fiction book was published, a collection of short stories entitled Space, Time and Nathaniel (Faber, 1957). By this time, his earnings from writing matched his wages in the bookshop, and he made the decision to become a full-time writer.\n\nAldiss led the voting for Most Promising New Author of 1958 at the next year's Worldcon, but finished behind \"no award\". He was elected president of the British Science Fiction Association in 1960. He was the literary editor of the Oxford Mail newspaper from 1958 to 1969. Around 1964, he and long-time collaborator Harry Harrison started the first ever journal of science fiction criticism, Science Fiction Horizons, which during its brief span of two issues published articles and reviews by such authors as James Blish, and featured a discussion among Aldiss, C. S. Lewis, and Kingsley Amis in the first issue and an interview with William S. Burroughs in the second. In 1967 Algis Budrys listed Aldiss, J. G. Ballard, Roger Zelazny, and Samuel R. Delany as \"an earthshaking new kind of\" writers, and leaders of the New Wave.\n\nBesides his own writings, he had great success as an anthologist. For Faber he edited Introducing SF, a collection of stories typifying various themes of science fiction, and Best Fantasy Stories. In 1961, he edited an anthology of reprinted short science fiction for the British paperback publisher Penguin Books under the title Penguin Science Fiction. This was remarkably successful, went into numerous reprints, and was followed up by two further anthologies: More Penguin Science Fiction (1963) and Yet More Penguin Science Fiction (1964). The later anthologies enjoyed the same success as the first, and all three were eventually published together as The Penguin Science Fiction Omnibus (1973), which also went into a number of reprints. In the 1970s, he produced several large collections of classic grand-scale science fiction, under the titles Space Opera (1974), Space Odysseys (1975), Galactic Empires (1976), Evil Earths (1976), and Perilous Planets (1978) which were quite successful. Around this time, he edited a large-format volume Science Fiction Art (1975), with selections of artwork from the magazines and pulps.\n\nIn response to the results from the planetary probes of the 1960s and 1970s, which showed that Venus was completely unlike the hot, tropical jungle usually depicted in science fiction, Aldiss and Harrison edited an anthology Farewell, Fantastic Venus!, reprinting stories based on the pre-probe ideas of Venus. He also edited, with Harrison, a series of anthologies The Year's Best Science Fiction (Nos. 1–9, 1968–1976).\n\nAldiss invented a form of extremely short story called the mini-saga. The Daily Telegraph hosted a competition for the best mini-saga for several years, and Aldiss was the judge. He has edited several anthologies of the best mini-sagas.\n\nAldiss travelled to Yugoslavia, where he met fans in Ljubljana, Slovenia and published a travel book about Yugoslavia entitled Cities and Stones (1966), his only work in the genre. He published an alternative-history fantasy story, \"The Day of the Doomed King\" (1968), about Serbian kings in the Middle Ages, and wrote a novel called The Malacia Tapestry, about an alternative Dalmatia.\n\nArt\n\nIn addition to a highly successful career as a writer, Aldiss was an accomplished artist. His first solo exhibition, The Other Hemisphere, was held in Oxford, August–September 2010, and the exhibition's centrepiece Metropolis (see figure) has since been released as a limited edition fine art print.(The exhibition title denotes the writer/artist's notion, \"words streaming from one side of his brain inspiring images in what he calls 'the other hemisphere'.\")\n\nPersonal life\n\nIn 1948, Aldiss married Olive Fortescue, secretary to the owner of Sanders' bookseller's in Oxford, where he had worked since 1947. He had two children from his first marriage: Clive in 1955 and Caroline Wendy in 1957, but the marriage \"finally collapsed\" in 1959 and dissolved in 1965.\n\nIn 1965, he married his second wife, Margaret Christie Manson (daughter of John Alexander Christie Manson, an aeronautical engineer)Science Fiction and Fantasy Literature, vol. 2, R. Reginald, 1979, pg 793 , a Scottish woman and secretary to the editor of the Oxford Mail; Aldiss was 40, and she 31. They lived in Oxford and had two children together, Tim and Charlotte. She died in 1997.\n\nDeath\n\nAldiss died on 19 August 2017, the day after his 92nd birthday.\n\nAwards and honours\n\nHe was elected a Fellow of the Royal Society of Literature in 1990.\n\nAldiss was the \"Permanent Special Guest\" at the annual International Conference on the Fantastic in the Arts (ICFA) from 1989 through 2008. He was also the Guest of Honor at the conventions in 1986 and 1999.\n\nThe Science Fiction Writers of America made him its 18th SFWA Grand Master in 2000 and the Science Fiction and Fantasy Hall of Fame inducted him in 2004.\n\nHe was awarded the title of Officer of the Order of the British Empire (OBE) for services to literature in the 2005 Birthday Honours list.\n\nIn January 2007 he appeared on Desert Island Discs. His choice of record to 'save' was \"Old Rivers\" sung by Walter Brennan, his choice of book was John Heilpern's biography of John Osborne, and his luxury a banjo. The full selection of eight favourite records is on the BBC website.\n\nOn 1 July 2008 he was awarded an honorary doctorate by the University of Liverpool in recognition of his contribution to literature. The Brian W Aldiss Archive at the University holds manuscripts from the period 1943–1995.\n\nIn 2013, Aldiss was recipient of the World Fantasy Convention Award at the World Fantasy Convention in Brighton, England.\n\nAldiss sat on the Council of the Society of Authors.\n\nHe won two Hugo awards: in 1962 for the Hothouse series; and in 1987 for Trillion Year Spree.  Aldiss also won a Nebula award in 1965 for The Saliva Tree: And Other Strange Growths.\n\nBooks \n\nAldiss was the author of over 80 books and 300 short stories. he also wrote several volumes of poetry.\nFiction \n\n* The Rain Will Stop The Pretentious Press (2000), written in 1942 \n* The Brightfount Diaries Faber (1955)\n* Space, Time and Nathaniel Faber (1957), Four Square 1496 (1966), Panther (1979), collected short fiction — all of his science fiction published to date, including \"T\", his first published story, and \"Not For an Age\" (thirteen stories) plus one story hurriedly written to fill out the volume\n* Non-Stop Faber (1958), Digit (1959), Pan (1976), Millennium (2000), US title Starship Signet S1779 (1960), Avon V2321 (1969) — A member of a culturally primordial tribe investigates the dark, jungle filled corridors that surround him to ultimately uncover the true nature of the universe he inhabits.\n* Equator ( serialized 1958), Digit R533  (US title Vanguard from Alpha Ace (1959)\n* The Canopy of Time Faber (1959), Four Square 821 (1963), collected short fiction. (The US title Galaxies Like Grains of Sand Signet S1815 (1960), Panther (1979), was a different version, which Aldiss preferred)\n* No Time Like Tomorrow Signet S1683 (1959), collected short fiction (contents: T, Not for an Age, Poor Little Warrior!, The Failed Men, Carrion Country, Judas Danced, Psyclops, Outside, Gesture of Farewell, The New Father Christmas, Our Kind of Knowledge)\n* The Interpreter Digit R506 (1960), Four Square 1970 (1967); US title Bow down to Nul Ace D-443 — A short novel about the huge, old galactic empire of Nuls, a giant, three-limbed, civilised alien race. Earth is just a lesser-than-third-class colony ruled by a Nul tyrant whose deceiving devices together with good willing but ineffective attempts of a Nul signatory to clarify the abuses and with the disorganised earthling resistance reflect the complex relationship existing between imperialists and subject races which Aldiss himself had the chance of seeing at first hand when serving in India and Indonesia in the forties.\n* The Male Response Beacon 45 (1959), Four Square 1623 (1961)\n* The Primal Urge Ballantine F555 (1961), Sphere (1967), Panther (1976)\n* Hothouse Faber (1962), Four Square 1147 (1965), Panther 1979) published in abridged form in the American market as The Long Afternoon of Earth Signet D2018 (1962)— Set in a far future Earth, where the earth has stopped rotating, the Sun has increased output, and plants are engaged in a constant frenzy of growth and decay, like a tropical forest enhanced a thousandfold; a few small groups of elvish humans still live on the edge of extinction, beneath the giant banyan tree that covers the day side of the earth. This assemblage of stories won the Hugo Award for short fiction in 1962.\n* The Airs of Earth Faber (1963), Four Square 1325 (195) US title Starswarm Signet D2411 (1964), collected short fiction\n* The Dark Light Years Signet D2497 (1964), Faber (1964), Four Square 1437 (1966), Panther (1979) — The encounter of humans with the utods, gentle aliens whose physical and mental health requires wallowing in mud and filth, who are not even recognised as intelligent by the humans.\n* Greybeard Harcourt, Brace & World (1964), Faber (1964), Signet P2689 (1965), Panther (1968) — Set decades after the Earth's population has been sterilised as a result of nuclear bomb tests conducted in Earth's orbit, the book shows an emptying world, occupied by an aging, childless population.\n* Best SF stories of Brian Aldiss Faber (1965); US title Who Can Replace a Man? Harcourt, Brace & World (1965), Signet P3311 (1967)\n* Earthworks Faber (1965), Four Square (1967), Signet P3116 (1967), Panther (1979), Avon (1980)\n* The Impossible Smile (1965), previously a Science Fantasy magazine serial under the pseudonym \"Jael Cracken\"\n*  The Saliva Tree and Other Strange Growths Faber (1966), Sphere (1968), collected short fiction — Title story \"The Saliva Tree\" was  written to mark the centenary of H. G. Wells's birth, and shared the Nebula Award for the best novella of 1964.  While set in a Wellsian milieu, it contains two plot elements also found in the stories of H.P.Lovecraft: an object from space which causes crops and livestock to grow prolifically, but be unpalatable (The Colour out of Space); and a monster which is visible only when sprayed with an opaque powder (The Dunwich Horror).\n* An Age Faber (1967), Sphere (1969), Panther (1979), US title Cryptozoic! Avon (1969), Panther (1978), a dystopic time-travel novel\n* Report on Probability A (serialized 1967), Faber (1968), Sphere (1969). Doubleday (1969), Lancer (1970), Avon (1980)\n* Intangibles, Inc. Faber (1969), Corgi (1971). Collection\n* Barefoot in the Head Faber (1969), Doubleday (1970), Ace (1972), Corgi (1974), AVON (1981), Gollancz VGSF Classics (1990)/ Perhaps Aldiss's most experimental work, this first appeared in several parts as the 'Acid Head War' series in New Worlds. Set in a Europe some years after a flare-up in the Middle East led to Europe being attacked with bombs releasing huge quantities of long-lived hallucinogenic drugs. Into an England with a population barely maintaining a grip on reality comes a young Serb, who himself starts coming under the influence of the ambient aerosols, and finds himself leading a messianic crusade. The narration and dialogue reflects the shattering of language under the influence of the drugs, in mutating phrases and puns and allusions, in a deliberate echo of Finnegans Wake.\n* The Moment of Eclipse Faber (1970), Doubleday (1972), Panther (1973), collected short fiction — British Science Fiction Association (BSFA) Award. British Science Fiction Association. Archived 2011-05-19. Retrieved 2013-04-25.\n* Neanderthal Planet Avon (1970), collected short fiction\n* Horatio Stubbs (omnibus edition, The Horatio Stubbs Saga Panther (1985)) \n** The Hand-Reared Boy Weidenfeld & Nicolson (1970), Signet T4575 (1971), Corgi (1971)\n** A Soldier Erect Weidenfeld & Nicolson (1971), Corgi (1972)\n** A Rude Awakening Weidenfeld & Nicolson (1978), Corgi (1979)\n* The Book of Brian Aldiss DAW 29 (1972), UK title The Comic Inferno New English Library (1973), collected short fiction\n* Frankenstein Unbound Jonathan Cape (1973), Random House (1974), Fawcett Crest (1975), Pan (1975)— A 21st century politician is transported to 19th century Switzerland where he encounters both Frankenstein and Mary Shelley. It was the basis for the 1990 film of the same title, directed by Roger Corman.\n* The Eighty Minute Hour Jonathan Cape (1974), Doubleday (1974), Leisure (1975), Pan (1975) — A weird and ambitious \"space opera\" whose characters actually sing. The world is in chaos after nuclear war causes time slips and even those that believe they rule the world have trouble knowing where and when they are.\n* The Malacia Tapestry Jonathan Cape (1976), Harper & Row (1977), Panther (1978), Ace (1978), Berkley (1985) - A picaresque novel with fantasy elements, set in a city not unlike Venice. However, it is a Venice without Christianity or monotheism, existing within an alternate version of Renaissance or Early Baroque Italy.\n* Brothers of the Head Pierrot (1977), Panther (1979) — A large-format book, illustrated by Ian Pollock, tells the strange story of the rock stars Tom and Barry Howe, Siamese twins with a third, dormant head that eventually starts to awaken. Adapted into a 2006 film by Keith Fulton and Lou Pepe.\n* Last Orders and Other Stories Jonathan Cape (1977), Panther (1979). Collection\n* Enemies of the System Jonathan Cape (1978), Harper & Row (1978), Panther (1980), Avon (1981)\n* Pile (1979) Poem\n*New Arrivals, Old Encounters Jonathan Cape (1979), Harper & Row (1980), Avon (1981). Collection\n* Moreau's Other Island Jonathan Cape (1980), Panther (1982), as An Island Called Moreau Simon & Schuster (1981), Timescape (1981)\n* Squire Quartet\n**  Life In The West Weidenfeld & Nicolson (1980), Corgi (1982)\n**  Forgotten Life Gollancz (1988), Atheneum / Macmillan (1989), Mandarin (1989)\n**  Remembrance Day HarperCollins (UK) (1993), St. Martin's Press (1993), Flamingo (1994)\n**  Somewhere East Of Life Carroll & Graf (1994), Flamingo (1994) \n* Helliconia trilogy \n** Helliconia Spring Atheneum (1982), Jonathan Cape (1982),  Berkley (1983), Granada (1983)— BSFA Award; Campbell Memorial Award; Nebula Award finalist\n** Helliconia Summer  Atheneum (1983), Jonathan Cape (1983),  Berkley (1984), Granada (1985) — BSFA finalist; Locus Award, fourth place\n** Helliconia Winter  Atheneum (1985), Jonathan Cape (1985),  Berkley (1986), Granada (1986) — BSFA; Nebula finalist; Locus, fifth place\n** Helliconia (omnibus) Gollancz SF Masterworks (2010)\n* Seasons in Flight Jonathan Cape (1984), Atheneum (1986), Grafton (1986), Ace (1988)\n* Courageous New Planet (c. 1984)\n* The Year before Yesterday (1987) Franklin Watts (1987), Kerosina (1987), St. Martin's (1988), New English Library (1989). Fix-up of Equator (1958) and The Impossible Smile (1965)\n* Ruins (1987)\n* Man in His Time Atheneum (1989),  ,  Collier (1990)\n* A Romance of the Equator: The Best Fantasy Stories Gollancz (1989) Atheneum / Macmillan (1990) \n* Dracula Unbound HarperCollins (1990), Graftton (1991)\n* A Tupolev too Far  HarperCollins (UK) (1993), St. Martin's (1994)\n* The Secret of This Book HarperCollins (UK) (1995), US title Common Clay: 20-Odd Stories St. Martin's (1996)\n* White Mars or, the Mind Set Free Little, Brown UK (1999), St. Martin's (2000), by Aldiss and Roger Penrose. \n* Super-Toys Last All Summer Long and Other Stories of Future Time Orbit (2001), St. Martin's (2001), collected short fiction — Title story \"Super-Toys Last All Summer Long\" was the basis for the Steven Spielberg film A.I.: Artificial Intelligence\n* Super-State Orbit (2002)\n* The Cretan Teat (2002)\n* Affairs at Hampden Ferrers (2004)\n* Cultural Breaks (2005), collected short fiction. Tachyon Publications.\n* Jocasta Rose Press (2005). A re-telling of Sophocles's Theban tragedies concerning Oedipus and Antigone. In Aldiss's novel, myth and magic are vibrantly real, experienced through an evolving human consciousness. Amidst various competing interpretations of reality, including the appearance of a time-travelling Sophocles, Aldiss provides an engaging alternative explanation of the Sphinx's riddle.\n* Sanity and the Lady PS Publishing (2005)\n* HARM del Rey (2007), Duckworth (2007) — Campbell Award nominee The Award recognises second and third-place runners-up. Recent lists of finalists are long, 14 in 2008.\n* Walcot Goldmark (2009) — Family saga spanning the 20th century\n* Finches of Mars (2012)http://www.harpercollins.co.uk/Titles/75944/finches-of-mars-brian-aldiss-9780007478927  \n* Comfort Zone (2013)\n\nPoetry \n\n* Home Life With Cats (1992)\n* At The Caligula Hotel (1995)\n* Songs From The Steppes Of Central Asia (1995)\n* A Plutonian Monologue on His Wife's Death (The Frogmore Papers, 2000)\n* At A Bigger House (2002)\n* The Dark Sun Rises (2002)\n* A Prehistory of Mind (Mayapple Press, 2008)\n* Mortal Morning (2011)\n\nNonfiction \n\n* Cities and Stones: A Traveller's Yugoslavia (1966)\n* The Shape of Further Things: Speculations on Change (1970)\n* Item Eighty Three (1972), by Brian and Margaret Aldiss — A bibliography of Aldiss's published works, this book being number 83\n* Billion Year Spree: The History of Science Fiction (1973) — BSFA special award \n* Hell's Cartographers (1975), co-edited with Harry Harrison — A collection of short autobiographical pieces by a number of science fiction writers, including Aldiss. The title is a reference to Kingsley Amis's survey of science fiction, New Maps of Hell.\n* This World and Nearer Ones: Essays Exploring the Familiar (1979).\n* Trillion Year Spree: The History of Science Fiction (1986), by Aldiss and David Wingrove — A revised and expanded version of Billion Year Spree and winner of the 1987 Hugo Award for the year's best nonfiction. At the 'Conspiracy 87' ceremony, Aldiss began his acceptance speech by holding the Hugo aloft and proclaiming, to general approbation, \"It's been a long time since you've given me one of these, you bastards!\"David Langford, The Sex Column and Other Misprints, Cosmos Books, 2005, p. 82. The quotation may not be reported exactly.\n* The Pale Shadow Of Science (1985), collected essays\n* ... And the Lurid Glare of the Comet (1986), articles and autobiography\n* Bury My Heart at W.H. Smith's: A Writing Life (1990), autobiography\n* The Detached Retina: Aspects of SF and Fantasy (1995).\n* The Twinkling of an Eye, or My Life as an Englishman (1998)\n* When the Feast is Finished (1999), by Brian and Margaret Aldiss\n* Art After Apogee: The Relationships Between an Idea, a Story, a Painting (2000), by Aldiss and Rosemary Phipps\n* An Exile on Planet Earth: Articles and Reflections (2012), articles and autobiography\n\nAnthologies edited \n\n* Penguin Science Fiction (1961)\n* More Penguin Science Fiction (1963)\n* Yet More Penguin Science Fiction (1964)\n* Nebula Award Stories Two (with Harry Harrison)  (1967)\n* The Year's Best Science Fiction No. 1 (with Harry Harrison)  (1968)\n* The Year's Best Science Fiction No. 2 (with Harry Harrison)  (1969)\n* The Year's Best Science Fiction No. 3 (with Harry Harrison)  (1970)\n* The Year's Best Science Fiction No. 4 (with Harry Harrison)  (1971)\n* The Year's Best Science Fiction No. 5 (with Harry Harrison)  (1972)\n* The Year's Best Science Fiction No. 6 (with Harry Harrison)  (1973)\n* The Penguin Science Fiction Omnibus (1973)\n* Space Opera (1974)\n* Space Odysseys (1974)\n* Decade: the 1940's (with Harry Harrison)  (1975)\n* Decade: the 1950's (with Harry Harrison)  (1976)\n* Decade: the 1960's (with Harry Harrison)  (1979)\n* Evil Earths (1976)\n* Galactic Empires, Volume 1 (1976)\n* Galactic Empires, Volume 2 (1976)\n* Mini Sagas from the Daily Telegraph Competition (1998) \n* Mini Sagas From the Daily Telegraph Competition 2001 (2001) \n* A Science Fiction Omnibus (2007) \n* The Folio Science Fiction Anthology (2016)\n\nOther \n\n* \"Umwelts for Hire\", Doctor Who Brilliant Book 2011 (BBC Books, 2010, ), a Doctor Who short story\n* \"The Small Stones of Tu Fu\", Asimov's Choice: Comets & Computers (Dale Books, 1978, ). Brian Aldiss. http://en.wikipedia.org/?curid=4561."
  }
}
