{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11974",
  "eid" : "ff43e9d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778508013,
  "textBody" : "Guam  (; Chamorro: ') is an unincorporated and organized territory of the United States in Micronesia in the western Pacific Ocean. Office of Insular Affairs. Retrieved October 31, 2008. The capital city of Guam is Hagåtña and the most populous city is Dededo. The inhabitants of Guam are called Guamanians, and they are American citizens by birth. Indigenous Guamanians are the Chamorros, who are related to other Austronesian natives to the west in the Philippines and Taiwan.\n\nIn 2016, 162,742 people resided on Guam. Guam has an area of 210 mi2 and a population density of 775 /mi2. In Oceania, it is the largest and southernmost of the Mariana Islands and the largest island in Micronesia. Among its municipalities, Mongmong-Toto-Maite has the highest population density at , whereas Inarajan and Umatac have the lowest density at  119 /mi2. The highest point is Mount Lamlam at 1332 ft above sea level. Since the 1960s, the economy has been supported by two industries: tourism and the United States Armed Forces.\n\nThe indigenous Chamorros settled the island approximately 4,000 years ago. Portuguese explorer Ferdinand Magellan, while in the service of Spain, was the first European to visit the island on March 6, 1521. Guam was colonized by Spain in 1668 with settlers, including Diego Luis de San Vitores, a Catholic Jesuit missionary. Between the 16th century and the 18th century, Guam was an important stopover for the Spanish Manila Galleons. During the Spanish–American War, the United States captured Guam on June 21, 1898. Under the Treaty of Paris, Spain ceded Guam to the United States on December 10, 1898. Guam is among the seventeen non-self-governing territories listed by the United Nations.[https://www.un.org/en/decolonization/nonselfgovterritories.shtml Non-Self-Governing Territories – Official U.N. Website] \n\nBefore World War II, there were five American jurisdictions in the Pacific Ocean: Guam and Wake Island in Micronesia, American Samoa and Hawaii in Polynesia, and the Philippines in the Malay Archipelago of Southeast Asia.\n\nOn December 7, 1941, hours after the attack on Pearl Harbor, Guam was captured by the Japanese, who occupied the island for two and a half years. During the occupation, Guamanians were subjected to beheadings, forced labor, rape, and torture.[http://catalogue.nla.gov.au/Record/197751 War Restitution Act : hearing before the Subcommittee on Insular and International Affairs of the Co... |National Library of Australia] . Catalogue.nla.gov.au (September 20, 1994). Retrieved June 13, 2012.\"[http://www.doi.gov/oia/press/2004/72104guam_war_claims.cfm Statement of David B. Cohen Deputy Assistant Secretary of the Interior for Insular Affairs Before the House Committee on Resources Regarding the Report of the Guam War Claims Review Commission |July 21, 2004] .\"  Office of Insular Affairs. Retrieved September 19, 2012. American forces recaptured the island on July 21, 1944; Liberation Day commemorates the victory.\n\nAn unofficial but frequently used territorial motto is \"Where America's Day Begins\", which refers to the island's close proximity to the international date line.\n\nHistory\n\nThe original inhabitants of Guam and the Northern Mariana Islands were the Chamorro people, who are believed to be descendants of Austronesian people originating from Southeast Asia as early as 2000 BC.\n\nThe ancient Chamorro society had four classes: chamorri (chiefs), matua (upper class), achaot (middle class), and mana'chang (lower class). The matua were located in the coastal villages, which meant they had the best access to fishing grounds, whereas the mana'chang were located in the interior of the island. Matua and mana'chang rarely communicated with each other, and matua often used achaot as intermediaries. There were also \"makåhna\" (similar to shamans), skilled in healing and medicine. Belief in spirits of ancient Chamorros called \"Taotao mo'na\" still persists as a remnant of pre-European culture. Their society was organized along matrilineal clans.\n\nLatte stones are stone pillars that are found only in the Mariana Islands; they are a recent development in Pre-Contact Chamorro society. The latte-stone was used as a foundation on which thatched huts were built. Latte stones consist of a base shaped from limestone called the haligi and with a capstone, or tåsa, made either from a large brain coral or limestone, placed on top. A possible source for these stones, the Rota Latte Stone Quarry, was discovered in 1925 on Rota.\n\nMagellan's travel to Guam\n\nThe first European to travel to Guam was Portuguese navigator Ferdinand Magellan, sailing for the King of Spain, when he sighted the island on March 6, 1521, during his fleet's circumnavigation of the globe. When Magellan arrived on Guam, he was greeted by hundreds of small outrigger canoes that appeared to be flying over the water, due to their considerable speed. These outrigger canoes were called Proas, and resulted in Magellan naming Guam Islas de las Velas Latinas (\"Islands of the Lateen sails\"). Antonio Pigafetta (one of Magellan's original 18) said that the name was \"Island of Sails\", but he also writes that the inhabitants \"entered the ships and stole whatever they could lay their hands on\", including \"the small boat that was fastened to the poop of the flagship.\" \"Those people are poor, but ingenious and very thievish, on account of which we called those three islands Islas de los Ladrones (\"Islands of thieves\").\"\n\nSpanish colonization and the Manila galleons\n\nDespite Magellan's visit, Guam was not officially claimed by Spain until January 26, 1565, by General Miguel López de Legazpi. From 1565 to 1815, Guam and the Northern Mariana Islands, the only Spanish outposts in the Pacific Ocean east of the Philippines, were an important resting stop for the Manila galleons, a fleet that covered the Pacific trade route between Acapulco and Manila. To protect these Pacific fleets, Spain built several defensive structures that still stand today, such as Fort Nuestra Señora de la Soledad in Umatac. Guam is the biggest single segment of Micronesia, the largest islands between the island of Kyushu (Japan), New Guinea, the Philippines, and the Hawaiian Islands.\n\nSpanish colonization commenced on June 15, 1668, with the arrival of Diego Luis de San Vitores and Pedro Calungsod, who established the first Catholic church. The islands were part of the Spanish East Indies governed from the Philippines, which were in turn part of the Viceroyalty of New Spain based in Mexico City. Other reminders of colonial times include the old Governor's Palace in Plaza de España and the Spanish Bridge, both in Hagatña. Guam's Cathedral Dulce Nombre de Maria was formally opened on February 2, 1669, as was the Royal College of San Juan de Letran. Guam, along with the rest of the Mariana and Caroline Islands, were treated as part of Spain's colony in the Philippines. While the island's Chamorro culture has indigenous roots, the cultures of both Guam and the Northern Marianas have many similarities with Spanish culture due to three centuries of Spanish rule.\n\nInternal conflicts\n\nIntermittent warfare lasting from July 23, 1670, until July 1695, plus the typhoons of 1671 and 1693, and in particular the smallpox epidemic of 1688, reduced the Chamorro population from 50,000 to 10,000, finally to less than 5,000. Precipitated by the death of Quipuha, and the murder of Father San Vitores and Pedro Calungsod by local rebel chief Matapang, tensions led to a number of conflicts. Captain Juan de Santiago started a campaign to conquer the island, which was continued by the successive commanders of the Spanish forces.\n\nAfter his arrival in 1674, Captain Damian de Esplana ordered the arrest of rebels who attacked the population of certain towns. Hostilities eventually led to the destruction of villages such as Chochogo, Pepura, Tumon, Sidia-Aty, Sagua, Nagan and Ninca. Starting in June 1676, the first Spanish Governor of Guam, Capt. Francisco de Irrisarri y Vinar, controlled internal affairs more strictly than his predecessors in order to curb tensions. He also ordered the construction of schools, roads and other infrastructure. Later, Capt. Jose de Quiroga arrived in 1680 and continued some of the development projects started by his predecessors. He also continued the search for the rebels who had assassinated Father San Vitores, resulting in campaigns against the rebels which were hiding out in some islands, eventually leading to the death of Matapang, Hurao and Aguarin. Quiroga brought some natives from the northern islands to Guam, ordering the population to live in a few large villages. These included Jinapsan, Umatac, Pago, Agat and Inarajan, where he built a number of churches. By July 1695, Quiroga had completed the conquest of Guam, Rota, Tinian and Aguigan.\n\nExpulsion of the Jesuits\n\nOn February 26, 1767, Charles III of Spain issued a decree confiscating the property of the Jesuits and banishing them from Spain and her possessions. As a consequence, the Jesuit fathers on Guam departed on November 2, 1769, on the schooner Nuestra Señora de Guadalupe, abandoning their churches, rectories and ranches.\n\nThe arrival of Governor Don Mariano Tobias, on September 15, 1771, brought agricultural reforms, including making land available to the islanders for cultivation, encouraged the development of cattle raising, imported deer and water buffalo from Manila, donkeys and mules from Acapulco, established cotton mills and salt pans, free public schools, and the first Guam militia. Later, he was transferred to Manila in June 1774.\n\nPost-Napoleonic era\n\nFollowing the Napoleonic Wars, many Spanish colonies in the Western Hemisphere had become independent, shifting the economic dependence of Guam from Mexico to the Philippines. Don Francisco Ramon de Villalobos, who became governor in 1831, improved economic conditions including the promotion of rice cultivation and the establishment of a leper hospital.\n\nOtto von Kotzebue visited the island in November 1817, and Louis de Freycinet in March 1819. Jules Dumont d'Urville made two visits, the first in May 1828. The island became a rest stop for whalers starting in 1823.\n\nA devastating typhoon struck the island on August 10, 1848, followed by a severe earthquake on January 25, 1849, which resulted in many refugees from the Caroline Islands, victims of the resultant tsunami. After a smallpox epidemic killed 3,644 Guamanians in 1856, Carolinians and Japanese were permitted to settle in the Marianas. Guam received nineteen Filipino prisoners after their failed 1872 Cavite mutiny.\n\nSpanish–American War and World War II\n\nAfter almost four centuries as part of the Kingdom of Spain, the United States occupied the island following Spain's defeat in the 1898 Spanish–American War, as part of the Treaty of Paris of 1898. Guam was transferred to the United States Navy control on December 23, 1898, by Executive Order 108-A from 25th President William McKinley. Guam came to serve as a station for American merchant and warships traveling to and from the Philippines (another American acquisition from Spain) while the Northern Mariana Islands were sold by Spain to Germany for part of its rapidly expanding German Empire, then following the German defeat in World War I (1914-1918) became a League of Nations Mandate in 1919 with the nearby Empire of Japan as the mandatory (\"trustee\") as a member nation of the victorious Allies in the \"Great War\".  A U.S. Navy yard was established at Piti in 1899, and a United States Marine Corps barracks at Sumay in 1901.Rottman, G. (2004) Guam 1941 & 1944: Loss and Reconquest. Oxford: Osprey Publishing,  Following the Philippine–American War (also known as the Philippine Insurrection, 1899-1902), rebel nationalist leaders Emilio Aguinaldo and Apolinario Mabini were exiled on Guam in 1901 after their capture.Mabini, A., 1969, The Philippine Revolution, Republic of the Philippines, Dept. of Education, National Historical Commission\n\nA marine seaplane unit was stationed in Guam from 1921 to 1930, the first in the Pacific. Pan American World Airways established a seaplane base on the island for its trans-Pacific San Francisco-Manila-Hong Kong route, and the Commercial Pacific Cable Company had earlier built a telegraph/telephone station in 1903 for its trans-oceanic communication line. During World War II (1939-1945), Guam was attacked and invaded by Japan on Monday, December 8, 1941, shortly after the attack on Pearl Harbor's American Pacific fleet and naval/air bases in Hawaii, hours before. In addition, Japan made major military moves into Southeast Asia and the East Indies islands of the South Pacific Ocean against the British and Dutch colonies, opening a new wider Pacific phase in the Second World War. The Japanese renamed Guam Ōmiya-jima (ja.: 大宮島) or Great Shrine Island.\n\nThe Northern Mariana Islands had become a League of Nations mandate assigned to Japan in 1919, pursuant to the Treaty of Versailles of 1919.   Chamorros indigenous island people from the Northern Marianas were brought to Guam to serve as interpreters and in other capacities for the occupying Japanese force. The Guamanian Chamorros were treated as an occupied enemy by the Japanese military. After the war, this would cause resentment between the Guamanian Chamorros and the Chamorros of the Northern Marianas. Guam's Chamorros believed their northern brethren should have been compassionate towards them, whereas having been administered by Japan for over 30 years, the Northern Mariana Chamorros were loyal to the Japanese government.\n\nThe Japanese occupation of Guam lasted for approximately thirty-one months. During this period, the indigenous people of Guam were subjected to forced labor, family separation, incarceration, execution, concentration camps and forced prostitution. Approximately one thousand people died during the occupation, according to later Congressional committee testimony in 2004. Some historians estimate that war violence killed 10% of Guam's then 20,000 population.Werner Gruhl, [https://books.google.com/books?idow5Wlmu9MPQC&pg\nPA102&dq&hlen#v\nonepage&q&f\nfalse Imperial Japan's World War Two, 1931–1945] , Transaction Publishers, 2007 \n\nThe United States returned and fought the Battle of Guam from July 21 to August 10, 1944, to recapture the island from Japanese military occupation. More than 18,000 Japanese were killed as only 485 surrendered. Sergeant Shoichi Yokoi, who surrendered in January 1972, appears to have been the last confirmed Japanese holdout for 28 years in the forested back country on Guam. The United States also captured and occupied the nearby Northern Marianas Islands.\n\nNorth Field  was established in 1944, and was renamed for Brigadier General James Roy Andersen (1904–1945) of the old U.S. Army Air Forces as Andersen Air Force Base.\n\nPost-war\n\nAfter World War II, the Guam Organic Act of 1950 established Guam as an unincorporated organized territory of the United States, provided for the structure of the island's civilian government, and granted the people U.S. citizenship. The Governor of Guam was federally appointed until 1968, when the Guam Elective Governor Act provided for the office's popular election.  Since Guam is not a U.S. state, U.S. citizens residing on Guam are not allowed to vote for president and their congressional representative is a non-voting member.  They do, however, get to vote for party delegates in presidential primaries.\n\nVietnam War and later\n\nAndersen Air Force Base played a major role in the Vietnam War. The host unit was later designated the 36th Wing (36 WG), assigned to the Pacific Air Forces (PACAF) Thirteenth Air Force (13AF).  In September 2012, 13 AF was inactivated and its functions merged into PACAF. The multinational Cope North military exercise is an annual event.[https://www.postguam.com/news/local/us-japan-australia-to-hold-cope-north/article_97099f96-edd5-11e6-9b56-ef2a341c3941.html US, Japan, Australia to hold Cope North 2017 February 9, 2017] Guam Post Retrieved March 27, 2017.\n \nOn August 6, 1997, Guam was the site of the Korean Air Flight 801 aircraft accident. The Boeing 747–300 jetliner was preparing to land when it crashed into a hill, killing 228 of the 254 people on board. Since 1974, about 124 historic sites in Guam have been recognized under the U.S. National Register of Historic Places. Guam temporarily hosted 100,000 Vietnamese refugees in 1975, and 6,600 Kurdish refugees in 1996.\n\nIn August 2017, North Korea warned that it might launch mid-range ballistic missiles into waters within 18 to of Guam, following an exchange of threats between the governments of North Korea and the United States.\n\nGeography\n\nGuam lies between 13.2°N and 13.7°N and between 144.6°E and 145.0°E, and has an area of 212 sqmi, making it the 32nd largest island of the United States. It is the southernmost and largest island in the Mariana island chain and is also the largest island in Micronesia. This island chain was created by the colliding Pacific and Philippine Sea tectonic plates. Guam is the closest land mass to the Mariana Trench, a deep subduction zone, that lies beside the island chain to the east. Challenger Deep, the deepest surveyed point in the Oceans, is southwest of Guam at 35797 ft deep. The highest point in Guam is Mount Lamlam at an elevation of 1334 ft.\"Geography of Guam\". Official site of Guam, April 19, 2014. Retrieved April 19, 2014, from .\n\nThe island of Guam is 30 mi long and 4 to wide, three-fourths the size of Singapore. The island experiences occasional earthquakes due to its location on the western edge of the Pacific Plate and near the Philippine Sea Plate. In recent years, earthquakes with epicenters near Guam have had magnitudes ranging from 5.0 to 8.7. Unlike the Anatahan volcano in the Northern Mariana Islands, Guam is not volcanically active. However, due to its proximity to Anatahan, vog (i.e. volcanic smog) does occasionally affect Guam.\"Home page of the Anahatan volcano\". USGS-CNMI, November 8, 2007. Retrieved November 8, 2007 from .\n\nA coral table reef surrounds most of Guam, and the limestone plateau provides the source for most of the island's fresh water. Steep coastal cliffs dominate the north, while the southern end of the island is mountainous, with lower hills in between.\n\nClimate\n\nGuam experiences a tropical rainforest climate (Köppen Af) – though its driest month of March almost averages dry enough to qualify as a tropical monsoon climate – moderated by seasonal easterly trade winds. However, due to its proximity to the equator, high sea surface temperature and warm ocean current that transports moisture from the east, the weather is generally very warm and humid throughout the year with little seasonal temperature variation. Hence, Guam is known to have equable temperatures year round. The mean high temperature is 86 °F and mean low is 76 °F. Temperatures rarely exceed 90 °F or fall below 70 °F. The relative humidity commonly exceeds 84 percent at night throughout the year, but the average monthly humidity hovers near 66 percent. The dry season runs from December to June. The remaining months (July to November) constitute the wet season with an average annual rainfall between 1981 and 2010 of around 98 in. The months of January and February are considered the coolest months of the year with overnight low temperatures of 70 to and generally less oppressive humidity levels. The highest temperature ever recorded in Guam was 96 F on April 18, 1971, and April 1, 1990, and the lowest temperature ever recorded was 65 F on February 8, 1973.\n\nGuam is located in Typhoon Alley and it is common for the island to be threatened by tropical storms and possible typhoons during the wet season. The highest risk of typhoons is during August through October.  They can, however, occur year-round. The most intense typhoon to pass over Guam recently was Super Typhoon Pongsona, with sustained winds of 144 mph, gusts to 173 mph, which slammed Guam on December 8, 2002, leaving massive destruction. The wettest month on record at Guam Airport has been August 1997 with  and the driest February 2015 with . The wettest calendar year has been 1976 with  and the driest 1998 with . The most rainfall in a single day occurred on 15 October 1953 when  fell.\n\nSince Super Typhoon Pamela in 1976, wooden structures have been largely replaced by concrete structures. During the 1980s wooden utility poles began to be replaced by typhoon-resistant concrete and steel poles. After the local Government enforced stricter construction codes, many home and business owners built their structures out of reinforced concrete with installed typhoon shutters.\n\nDemographics\n\nEthnic groups\n\nBased on a 2010 estimate, the largest ethnic group are the native Chamorros, accounting for 37.3% of the total population. Other significant ethnic groups include those of Filipino (26.3%), White (7.1%), and Chuukese (7%) ethnicities. The rest are from other Pacific Islands or of Asian ancestry.\n\nLanguage\n\nThe official languages of the island are English and Chamorro.\nReligion\n\n \nAccording to the Pew Research Center, 2010:[http://www.globalreligiousfutures.org/countries/guam#/?affiliations_religion_id\n0&affiliations_year=2010 Guam]\n\n*Roman Catholic 75%\n*Protestants 17.7%\n*Unaffiliated 1.7%\n*Other religions 1.6%\n*Folk religions 1.5%\n*Other Christians 1.4%\n*Buddhists 1.1%\n*Eastern Orthodox \n\nThe national team plays at the Guam National Football Stadium, which has a capacity of 1,000. The men's national football team are known as the \"matao\" team. Matao is the definition of highest level or \"noble\" class; the matao team have done exceptionally well under the head coach Gary White. As of 2016, the Matao is led by Darren Sawatzky, the current head coach.  \n\nThe top football division in Guam is the Guam Men's Soccer League. Rovers FC and Guam Shipyard are the league's most competitive and successful clubs, both have won nine championships in the past years.\n\nBasketball\n\nThe Guam national basketball team is traditionally one of the top teams in the Oceania region behind Australia and New Zealand.\n\nAs of 2015, it is the reigning champion of the Pacific Games Basketball Tournament.\n\nGuam is home to various basketball organizations, including the GBA.https://www.guamsportsnetwork.com/2017/gba-bombers-hold-off-mvp-season-3-title/\n\nSwimming\n\nIn the 2012 Summer Olympics in London, Pilar Shimizu competed for Guam and placed 42nd in the breaststroke competition.\n\nRugby union\n\nGuam is represented in rugby union by the Guam national rugby union team. The team has never qualified for a Rugby World Cup. Guam played their first match in 2005, an 8–8 draw with India. Guam's biggest win was a 74–0 defeat of Brunei in June 2008.\n\nMixed martial arts\n\nUFC fighter Jon Tuck, who boasts a professional record of 10 wins and 4 losses, three of those wins while with the UFC, fights out of Guam.\n\nEconomy\n\nGuam's economy depends primarily on tourism, Department of Defense installations and locally owned businesses. Despite paying no income or excise tax, it receives large transfer payments from the general revenues of the U.S. federal treasury. Under the provisions of a special law by Congress, it is Guam's treasury rather than the U.S. treasury that receives the federal income taxes paid by local taxpayers (including military and civilian federal employees assigned to Guam).\n\nLying in the western Pacific, Guam is a popular destination for Japanese tourists. Its tourist hub, Tumon, features over 20 large hotels, a Duty Free Shoppers Galleria, Pleasure Island district, indoor aquarium, Sandcastle Las Vegas–styled shows and other shopping and entertainment venues. It is a relatively short flight from Asia or Australia compared to Hawaii, with hotels and seven public golf courses accommodating over a million tourists per year. Although 75% of the tourists are Japanese, Guam receives a sizable number of tourists from South Korea, the U.S., the Philippines, and Taiwan.. visitguam.org Significant sources of revenue include duty-free designer shopping outlets, and the American-style malls: Micronesia Mall, Guam Premier Outlets, the Agana Shopping Center, and the world's largest Kmart.\n\nThe economy had been stable since 2000 due to increased tourism. It is expected to stabilize with the transfer of U.S. Marine Corps' 3rd Marine Expeditionary Force, currently in Okinawa, Japan, (approximately 8,000 Marines, along with their 10,000 dependents), to Guam between 2010 and 2015.  In 2003, Guam had a 14% unemployment rate, and the government suffered a $314 million shortfall.\n\nThe Compacts of Free Association between the United States, the Federated States of Micronesia, the Republic of the Marshall Islands and the Republic of Palau accorded the former entities of the Trust Territory of the Pacific Islands a political status of \"free association\" with the United States. The Compacts give citizens of these island nations generally no restrictions to reside in the United States (also its territories), and many were attracted to Guam due to its proximity, environmental, and cultural familiarity. Over the years, it was claimed by some in Guam that the territory has had to bear the brunt of this agreement in the form of public assistance programs and public education for those from the regions involved, and the federal government should compensate the states and territories affected by this type of migration. Over the years, Congress had appropriated \"Compact Impact\" aids to Guam, the Northern Mariana Islands and Hawaii, and eventually this appropriation was written into each renewed Compact. Some, however, continue to claim the compensation is not enough or that the distribution of actual compensation received is significantly disproportionate.\n\n Guam's largest single private sector employer, with about 1,400 jobs, was Continental Micronesia, a subsidiary of Continental Airlines;Kerrigan, Kevin. . Pacific News Center (May 5, 2010). Retrieved October 5, 2010. \"Continental Micronesia is Guam's single largest employer. About 1400 jobs here on dependent on the airline.\" it is now a part of United Airlines, a subsidiary of Chicago-based United Continental Holdings, Inc.\"[http://ir.unitedcontinentalholdings.com/phoenix.zhtml?c83680&p\nirol-homeProfile Company Information].\" ([https://www.webcitation.org/6CXmddfol?urlhttp://ir.unitedcontinentalholdings.com/phoenix.zhtml?c%3D83680%26p%3Dirol-homeProfile Archive]) United Continental Holdings. Retrieved November 16, 2012.  the Continental Micronesia annual payroll in Guam was $90 million.\n\nGovernment and politics\n\nGuam is governed by a popularly elected governor and a unicameral 15-member legislature, whose members are known as senators. Its judiciary is overseen by the Supreme Court of Guam.\n\nThe District Court of Guam is the court of United States federal jurisdiction in the territory. Guam elects one delegate to the United States House of Representatives, currently Democrat Madeleine Z. Bordallo. The delegate does not have a vote on the final passage of legislation, but is accorded a vote in committee, and the privilege to speak to the House. U.S. citizens in Guam vote in a straw poll for their choice in the U.S. Presidential general election, but since Guam has no votes in the Electoral College, the poll has no real effect. However, in sending delegates to the Republican and Democratic national conventions, Guam does have influence in the national presidential race.  These delegates are elected by local party conventions.\n\nPolitical status\n\nIn the 1980s and early 1990s, there was a significant movement in favor of this U.S. territory becoming a commonwealth, which would give it a level of self-government similar to Puerto Rico and the Northern Mariana Islands. However, the federal government rejected the version of a commonwealth that the government of Guam proposed, because its clauses were incompatible with the Territorial Clause (Art. IV, Sec. 3, cl. 2) of the U.S. Constitution. Other movements advocate U.S. statehood for Guam, union with the state of Hawaii, or union with the Northern Mariana Islands as a single territory, or independence.\n\nIn a 1982 plebiscite, voters indicated interest in seeking commonwealth status. The island has been considering another non-binding plebiscite on decolonization since 1998. Governor Eddie Baza Calvo intended to include one during the island's November 2016 elections but it was delayed again.\n\nA Commission on Decolonization was established in 1997 to educate the people of Guam about the various political status options in its relationship with the U.S.: statehood, free association and independence. The group was dormant for some years. In 2013, the Commission began seeking funding to start a public education campaign. There were few subsequent developments until late 2016. In early December 2016, the Commission scheduled a series of education sessions in various villages about the current status of Guam's relationship with the U.S. and the self-determination options that might be considered. The Commission's current Executive Director is Edward Alvarez and there are ten members. The group is also expected to release position papers on independence and statehood but the contents have not yet been completed.\n\nThe United Nations is in favor of greater self-determination for Guam and other such territories. The UN's Special Committee on Decolonization has agreed to endorse the Governor's education plan. The commission's May 2016 report states: \"With academics from the University of Guam, [the Commission] was working to create and approve educational materials. The Office of the Governor was collaborating closely with the Commission\" in developing educational materials for the public.\n\nThe United States Department of the Interior had approved a $300,000 grant for decolonization education, Edward Alvarez told the United Nations Pacific Regional Seminar in May 2016. \"We are hopeful that this might indicate a shift in [United States] policy to its Non-Self-Governing Territories such as Guam, where they will be more willing to engage in discussions about our future and offer true support to help push us towards true self-governances and self-determination.\"\n\nVillages\n\nGuam is divided into nineteen municipalities called villages:\n \n*Agana Heights \n*Agat\n*Asan‑Maina\n*Barrigada\n*Chalan‑Pago‑Ordot\n*Dededo\n*Hagåtña (capital)\n*Inarajan\n*Mangilao\n*Merizo\n*Mongmong‑Toto‑Maite\n*Piti\n*Santa Rita\n*Sinajana\n*Talofofo\n*Tamuning\n*Umatac\n*Yigo\n*Yona\n\nMilitary bases\n\nNote: Naval Air Station Agana has been deactivated. [http://www.globalsecurity.org/military/facility/agana.htm Military: Naval Air Station, Agana (Tiyan)] . GlobalSecurity.org. Retrieved 2010-02-19.See also List of United States Navy installations#Guam.\n\nThe U.S. military maintains jurisdiction over its bases, which cover approximately 39000 acre, or 29% of the island's total land area:\n\n*U.S. Naval Base Guam, U.S. Navy – Sumay\n*U.S. Coast Guard Sector Guam, – Sumay\n*Andersen Air Force Base, U.S. Air Force – Yigo\n*Apra Harbor – Orote peninsula\n*Ordnance Annex, U.S. Navy – South Central Highlands (formerly known as Naval Magazine)\n*Naval Computer and Telecommunications Station, U.S. Navy – Barrigada and Finegayan\n*Joint Force Headquarters-Guam, Guam National Guard – Radio Barrigada and Fort Juan Muna\n\nIn addition to on-shore military installations, Guam, along with the rest of the Mariana Islands, is being prepared to be the westernmost military training range for the U.S.  Guam is currently viewed as a key military hub that will further allow U.S. military power to be projected via sea and sky.\n\nThe U.S. military has proposed building a new aircraft carrier berth on Guam and moving 8,600 Marines, and 9,000 of their dependents, to Guam from Okinawa, Japan. Including the required construction workers, this buildup would increase Guam's population by 45%. In a February 2010 letter, the United States Environmental Protection Agency sharply criticized these plans because of a water shortfall, sewage problems and the impact on coral reefs. By 2012, these plans had been cut to have only a maximum of 4,800 Marines stationed on the island, two thirds of whom would be there on a rotational basis without their dependents.Parrish, Karen (July 20, 2012). [http://www.defense.gov//news/newsarticle.aspx?id=117196 \"Carter: Guam Central to Asia-Pacific Strategy.\"]  American Forces Press Service.\n\nWith the proposed increased military presence stemming from the upcoming preparation efforts and relocation efforts of U.S. Marines from Okinawa, Japan to Guam slated to begin in 2010 and last for the next several years thereafter, the amount of total land that the military will control or tenant may grow to or surpass 40% of the entire landmass of Guam.\n\nIn January 2011, the Ike Skelton National Defense Authorization Act for FY2011 indicated that recent significant events will delay the deadline for realigning U.S. Marine Corps service members and their families from Okinawa to Guam. The transfer may be as late as 2020. In addition, the Defense Authorization Act cut approximately $320 million from the 2011 budget request.\n\nVillagers and the military community are interconnected in many ways.  Many villagers serve in the military or are retired.  Many active duty personnel and Defense Department civilians also live in the villages outside of the military installation areas.  The military and village communities have \"adoption\" programs where Guam's population and military personnel stationed on Guam perform community service projects.\n\nTransportation and communications\n\nMost of the island has state-of-the-art mobile phone services and high-speed internet widely available through either cable or DSL. Guam was added to the North American Numbering Plan (NANP) in 1997 (country code 671 became NANP area code 671), removing the barrier of high-cost international long-distance calls to the U.S. mainland.\n\nGuam is also a major hub for submarine cables between the Western U.S., Hawaii, Australia and Asia. Guam currently serves twelve submarine cables, with most continuing to China.\n\nIn 1899, the local postage stamps were overprinted \"Guam\" as was done for the other former Spanish colonies, but this was discontinued shortly thereafter and regular U.S. postage stamps have been used ever since. Because Guam is also part of the U.S. Postal System (postal abbreviation: GU, ZIP code range: 96910–96932), mail to Guam from the U.S. mainland is considered domestic and no additional charges are required. Private shipping companies, such as FedEx, UPS, and DHL, however, have no obligation to do so, and do not regard Guam as domestic.\n\nThe speed of mail traveling between Guam and the states varies depending on size and time of year. Light, first-class items generally take less than a week to or from the mainland, but larger first-class or Priority items can take a week or two. Fourth-class mail, such as magazines, are transported by sea after reaching Hawaii. Most residents use post office boxes or private mail boxes, although residential delivery is becoming increasingly available. Incoming mail not from the Americas should be addressed to \"Guam\" instead of \"USA\" to avoid being routed the long way through the U.S. mainland and possibly charged a higher rate (especially from Asia).\n\nThe Commercial Port of Guam is the island's lifeline because most products must be shipped into Guam for consumers.  It receives the weekly calls of the Hawaii-based shipping line Matson, Inc. whose container ships connect Guam with Honolulu, Hawaii, Los Angeles, California, Oakland, California and Seattle, Washington. The port is also the regional transhipment hub for over 500,000 customers throughout the Micronesian region.  The port is the shipping and receiving point for containers designated for the island's U.S. Department of Defense installations, Andersen Air Force Base and Commander, Naval Forces Marianas and eventually the Third Marine Expeditionary Force.\n\nGuam is served by the Antonio B. Won Pat International Airport, which is a hub for United Airlines.  The island is outside the United States customs zone so Guam is responsible for establishing and operating its own customs and quarantine agency and jurisdiction. Therefore, the U.S. Customs and Border Protection only carries immigration (but not customs) functions. Since Guam is under federal immigration jurisdiction, passengers arriving directly from the United States skip immigration and proceed directly to Guam Customs and Quarantine.\n\nHowever, due to the Guam and CNMI visa waiver program for certain countries, an eligibility pre-clearance check is carried on Guam for flights to the States. For travel from the Northern Mariana Islands to Guam, a pre-flight passport and visa check is performed before boarding the flight to Guam. On flights from Guam to the Northern Mariana Islands, no immigration check is performed. Traveling between Guam and the States through a foreign point, however, does require a passport.\n\nMost residents travel within Guam using personally owned vehicles. The local government currently outsources the only public bus system (Guam Regional Transit Authority), and some commercial companies operate buses between tourist-frequented locations.\n\nEcology\n\nBrown tree snake\n\nBelieved to be a stowaway on a U.S. military transport near the end of World War II, the brown tree snake (Boiga irregularis) was accidentally introduced to Guam, which previously had no native species of snake. It nearly eliminated the native bird population. The problem was exacerbated because the snake has no natural predators on the island. The brown tree snake, known locally as the kulebla, is native to northern and eastern coasts of Australia, Papua New Guinea, and the Solomon Islands. It is slightly venomous, but relatively harmless to human beings; it is nocturnal. Although some studies have suggested a high density of these serpents on Guam, residents rarely see them. The United States Department of Agriculture has trained detector dogs to keep the snakes out of the island's cargo flow. The United States Geological Survey also has dogs that can detect snakes in forested environments around the region's islands.\n\nBefore the introduction of the brown tree snake, Guam was home to several endemic bird species. Among them were the Guam rail (or ko'ko bird in Chamorro) and the Guam flycatcher, both common throughout the island. Today the flycatcher is entirely extinct and the Guam rail is extinct in the wild but bred in captivity by the Division of Aquatic and Wildlife Resources. The devastation caused by the snake has been significant over the past several decades. As many as twelve bird species are believed to have been driven to extinction. According to many elders, ko'ko' birds were common in Guam before World War II.\n\nOther bird species threatened by the brown tree snake include the Mariana crow, the Mariana swiftlet, and the Micronesian starling, though populations are present on other islands, including Rota.\n\nGuam is said to have many more insects and 40 times more spiders than neighboring islands, because their natural predators birds are severely diminished, and the forests are almost completely silent due to lack of birdsong.\n\n*[http://news.rice.edu/wp-content/uploads/2012/09/0914_SPIDER-b2-big.jpg] [http://news.rice.edu/wp-content/uploads/2012/09/0914_SPIDER4-webs-big.jpg] Forest on Guam swathed in spider webs.\n\nCoconut rhinoceros beetle\n\nAn infestation of the coconut rhinoceros beetle (CRB), Oryctes rhinoceros, was detected on Guam on September 12, 2007. CRB is not known to occur in the United States except in American Samoa. Delimiting surveys performed September 13–25, 2007, indicated that the infestation was limited to Tumon Bay and Faifai Beach, an area of approximately 900 acre. Guam Department of Agriculture (GDA) placed quarantine on all properties within the Tumon area on October 5 and later expanded the quarantine to about 2500 acre on October 25; approximately  radius in all directions from all known locations of CRB infestation. CRB is native to Southern Asia and distributed throughout Asia and the Western Pacific including Sri Lanka, Upolu, Samoa, American Samoa, Palau, New Britain, West Irian, New Ireland, Pak Island and Manus Island (New Guinea), Fiji, Cocos (Keeling) Islands, Mauritius, and Reunion.\n\nOther invasive animal species\n\nFrom the seventeenth through nineteenth centuries, the Spanish introduced pigs, dogs, chickens, the Philippine deer (Rusa mariannus), black francolins, and carabao (a subspecies of water buffalo), which have cultural significance.  Herds of carabao obstruct military base operations and harm native ecosystems.  After birth control and adoption efforts were ineffective, the U.S. military began culling the herds in 2002 leading to organized protests from island residents.\n\nOther introduced species include cane toads imported in 1937, the giant African snail (an agricultural pest introduced during World War II by Japanese occupation troops) and more recently frog species which could threaten crops in addition to providing additional food for the brown tree snake population. Reports of loud chirping frogs native to Puerto Rico and known as coquí, that may have arrived from Hawaii, have led to fears that the noise could threaten Guam's tourism.\n\nGuam has no native amphibian species, but now a total of eight amphibian species has been established in Guam. Litoria fallax (native to the eastern coast of Australia) has been present in Guam since 1968, and Rhinella marina (the cane toad) was brought to the island in 1937. The other 6 amphibian species, namely Hylarana guentheri (native to mainland Asia), Microhyla pulchra (native to mainland Asia), Polypedates braueri (endemic to Taiwan), Eleutherodactylus planirostris (native to the Caribbean), Fejervarya cancrivora (the Guam variety being most closely related to F. cancrivora found in Taiwan), and Fejervarya limnocharis (native to Southeast Asia), have been in Guam since 2003.Wostl, Elijah, Eric N. Smith, and Robert N. Reed. 2016. Origin and Identity of Fejervarya (Anura: Dicroglossidae) on Guam. Pacific Science 70(2):233–241. https://doi.org/10.2984/70.2.9 Many species were likely inadvertently introduced via shipping cargo, especially from Taiwan, mainland China, and Southeast Asia.\n\nIntroduced feral pigs and deer, over-hunting, and habitat loss from human development are also major factors in the decline and loss of Guam's native plants and animals.\n\nThreats to indigenous plants\n\nInvading animal species are not the only threat to Guam's native flora. Tinangaja, a virus affecting coconut palms, was first observed on the island in 1917 when copra production was still a major part of Guam's economy. Though coconut plantations no longer exist on the island, the dead and infected trees that have resulted from the epidemic are seen throughout the forests of Guam.\n\nDuring the past century, the dense forests of northern Guam have been largely replaced by thick tangan-tangan brush (Leucaena leucocephala). Much of Guam's foliage was lost during World War II.  In 1947, the U.S. military is thought to have planted tangan-tangan by seeding the island from the air to prevent erosion. Tangan-tangan was present on the island before 1905.Stafford, William Edwin (1905) Useful Plants of Guam\n\nIn southern Guam, non-native grass species dominate much of the landscape. Although the colorful and impressive flame tree (Delonix regia) is found throughout the Marianas, the tree on Guam has been largely decimated.\n\nWildfires\n\nWildfires plague the forested areas of Guam every dry season despite the island's humid climate.  Most fires are caused by humans with 80% resulting from arson., pp. 6–7, guamforestry.org Poachers often start fires to attract deer to the new growth. Invasive grass species that rely on fire as part of their natural life cycle grow in many regularly burned areas. Grasslands and \"barrens\" have replaced previously forested areas leading to greater soil erosion. During the rainy season, sediment is carried by the heavy rains into the Fena Lake Reservoir and Ugum River, leading to water quality problems for southern Guam. Eroded silt also destroys the marine life in reefs around the island. Soil stabilization efforts by volunteers and forestry workers (planting trees) have had little success in preserving natural habitats.\n\nAquatic preserves\n\nEfforts have been made to protect Guam's coral reef habitats from pollution, eroded silt and overfishing, problems that have led to decreased fish populations.  (Since Guam is a significant vacation spot for scuba divers, this is important.) In recent years, the Department of Agriculture, Division of Aquatic and Wildlife Resources has established several new marine preserves where fish populations are monitored by biologists. Before adopting U.S. Environmental Protection Agency standards, portions of Tumon Bay were dredged by the hotel chains to provide a better experience for hotel guests. Tumon Bay has since been made into a preserve.  A federal Guam National Wildlife Refuge in northern Guam protects the decimated sea turtle population in addition to a small colony of Mariana fruit bats.\n\nHarvest of sea turtle eggs was a common occurrence on Guam before World War II. The green sea turtle (Chelonia mydas) was harvested legally on Guam before August 1978, when it was listed as threatened under the Endangered Species Act. The hawksbill sea turtle (Eretmochelys imbricata) has been on the endangered list since 1970. In an effort to ensure protection of sea turtles on Guam, routine sightings are counted during aerial surveys and nest sites are recorded and monitored for hatchlings.\n\nEducation\n\nColleges and universities\n\nThe University of Guam (UOG) and Guam Community College, both fully accredited by the Western Association of Schools and Colleges, offer courses in higher education. UOG is a member of the exclusive group of only 76 land-grant institutions in the entire United States. Pacific Islands University is a small Christian liberal arts institution nationally accredited by the Transnational Association of Christian Colleges and Schools. They offer courses at both the undergraduate and graduate levels.\n\nPrimary and secondary schools\n\nThe Guam Department of Education serves the entire island of Guam. In 2000, 32,000 students attended Guam's public schools.  Guam Public Schools have struggled with problems such as high dropout rates and poor test scores. Guam's educational system has always faced unique challenges as a small community located 6000 mi from the U.S. mainland with a very diverse student body including many students who come from backgrounds without traditional American education. An economic downturn in Guam since the mid-1990s has compounded the problems in schools.\n\nBefore September 1997, the U.S. Department of Defense partnered with Guam Board of Education.\"[http://www.newspaperarchive.com/LandingPage.aspx?typeglp&search\n%22rats%2c%20other%20problems%20face%20guam%20schools%22&img\\\\na0041\\6800243\\56035875_clean.html Rats, other problems face Guam schools].\" Pacific Stars and Stripes. October 3, 1993. In September 1997, the DoDEA opened its own schools for children of military personnel.[http://www.spaceref.com/news/viewpr.html?pid\n12381 Guam School to Be Renamed in Honor of NASA Astronaut William McCool |SpaceRef – Your Space Reference]. SpaceRef (August 21, 2003). Retrieved June 13, 2012. DoDEA schools, which also serve children of some federal civilian employees, had an attendance of 2,500 in 2000. DoDEA Guam operates three elementary/middle schools and one high school.\n\nPublic libraries\n\nGuam Public Library System operates the Nieves M. Flores Memorial Library in Hagåtña and five branch libraries.. gpls.guam.gov\n\nHealth care\n\nThe Government of Guam maintains the island's main health care facility, Guam Memorial Hospital, in Tamuning.[http://www.gmha.org/ Welcome to the official Guam Memorial Hospital Authority Website! – Tonyt] . Gmha.org. Retrieved June 13, 2012. U.S. board certified doctors and dentists practice in all specialties. In addition, the U.S. Naval Hospital in Agana Heights serves active-duty members and dependents of the military community.[http://www.med.navy.mil/sites/usnhguam/Pages/default.aspx U.S Naval Hospital Guam] . United States Navy There is one subscriber-based air ambulance located on the island, CareJet, which provides emergency patient transportation across Guam and surrounding islands. A private hospital, the Guam Regional Medical City opened its doors in early 2016.\n\nFilm-making\n\nOver the years, a number of films have been shot on Guam, including Shiro's Head (directed by the Muna brothers) and the government-funded Max Havoc: Curse of the Dragon (2004). Although set on Guam, No Man Is an Island (1962) was not shot there, but in the Republic of the Philippines.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guam" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11974" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Guam  (; Chamorro: ') is an unincorporated and organized territory of the United States in Micronesia in the western Pacific Ocean. Office of Insular Affairs. Retrieved October 31, 2008. The capital city of Guam is Hagåtña and the most populous city is Dededo. The inhabitants of Guam are called Guamanians, and they are American citizens by birth. Indigenous Guamanians are the Chamorros, who are related to other Austronesian natives to the west in the Philippines and Taiwan.\n\nIn 2016, 162,742 people resided on Guam. Guam has an area of 210 mi2 and a population density of 775 /mi2. In Oceania, it is the largest and southernmost of the Mariana Islands and the largest island in Micronesia. Among its municipalities, Mongmong-Toto-Maite has the highest population density at , whereas Inarajan and Umatac have the lowest density at  119 /mi2. The highest point is Mount Lamlam at 1332 ft above sea level. Since the 1960s, the economy has been supported by two industries: tourism and the United States Armed Forces.\n\nThe indigenous Chamorros settled the island approximately 4,000 years ago. Portuguese explorer Ferdinand Magellan, while in the service of Spain, was the first European to visit the island on March 6, 1521. Guam was colonized by Spain in 1668 with settlers, including Diego Luis de San Vitores, a Catholic Jesuit missionary. Between the 16th century and the 18th century, Guam was an important stopover for the Spanish Manila Galleons. During the Spanish–American War, the United States captured Guam on June 21, 1898. Under the Treaty of Paris, Spain ceded Guam to the United States on December 10, 1898. Guam is among the seventeen non-self-governing territories listed by the United Nations.[https://www.un.org/en/decolonization/nonselfgovterritories.shtml Non-Self-Governing Territories – Official U.N. Website] \n\nBefore World War II, there were five American jurisdictions in the Pacific Ocean: Guam and Wake Island in Micronesia, American Samoa and Hawaii in Polynesia, and the Philippines in the Malay Archipelago of Southeast Asia.\n\nOn December 7, 1941, hours after the attack on Pearl Harbor, Guam was captured by the Japanese, who occupied the island for two and a half years. During the occupation, Guamanians were subjected to beheadings, forced labor, rape, and torture.[http://catalogue.nla.gov.au/Record/197751 War Restitution Act : hearing before the Subcommittee on Insular and International Affairs of the Co... |National Library of Australia] . Catalogue.nla.gov.au (September 20, 1994). Retrieved June 13, 2012.\"[http://www.doi.gov/oia/press/2004/72104guam_war_claims.cfm Statement of David B. Cohen Deputy Assistant Secretary of the Interior for Insular Affairs Before the House Committee on Resources Regarding the Report of the Guam War Claims Review Commission |July 21, 2004] .\"  Office of Insular Affairs. Retrieved September 19, 2012. American forces recaptured the island on July 21, 1944; Liberation Day commemorates the victory.\n\nAn unofficial but frequently used territorial motto is \"Where America's Day Begins\", which refers to the island's close proximity to the international date line.\n\nHistory\n\nThe original inhabitants of Guam and the Northern Mariana Islands were the Chamorro people, who are believed to be descendants of Austronesian people originating from Southeast Asia as early as 2000 BC.\n\nThe ancient Chamorro society had four classes: chamorri (chiefs), matua (upper class), achaot (middle class), and mana'chang (lower class). The matua were located in the coastal villages, which meant they had the best access to fishing grounds, whereas the mana'chang were located in the interior of the island. Matua and mana'chang rarely communicated with each other, and matua often used achaot as intermediaries. There were also \"makåhna\" (similar to shamans), skilled in healing and medicine. Belief in spirits of ancient Chamorros called \"Taotao mo'na\" still persists as a remnant of pre-European culture. Their society was organized along matrilineal clans.\n\nLatte stones are stone pillars that are found only in the Mariana Islands; they are a recent development in Pre-Contact Chamorro society. The latte-stone was used as a foundation on which thatched huts were built. Latte stones consist of a base shaped from limestone called the haligi and with a capstone, or tåsa, made either from a large brain coral or limestone, placed on top. A possible source for these stones, the Rota Latte Stone Quarry, was discovered in 1925 on Rota.\n\nMagellan's travel to Guam\n\nThe first European to travel to Guam was Portuguese navigator Ferdinand Magellan, sailing for the King of Spain, when he sighted the island on March 6, 1521, during his fleet's circumnavigation of the globe. When Magellan arrived on Guam, he was greeted by hundreds of small outrigger canoes that appeared to be flying over the water, due to their considerable speed. These outrigger canoes were called Proas, and resulted in Magellan naming Guam Islas de las Velas Latinas (\"Islands of the Lateen sails\"). Antonio Pigafetta (one of Magellan's original 18) said that the name was \"Island of Sails\", but he also writes that the inhabitants \"entered the ships and stole whatever they could lay their hands on\", including \"the small boat that was fastened to the poop of the flagship.\" \"Those people are poor, but ingenious and very thievish, on account of which we called those three islands Islas de los Ladrones (\"Islands of thieves\").\"\n\nSpanish colonization and the Manila galleons\n\nDespite Magellan's visit, Guam was not officially claimed by Spain until January 26, 1565, by General Miguel López de Legazpi. From 1565 to 1815, Guam and the Northern Mariana Islands, the only Spanish outposts in the Pacific Ocean east of the Philippines, were an important resting stop for the Manila galleons, a fleet that covered the Pacific trade route between Acapulco and Manila. To protect these Pacific fleets, Spain built several defensive structures that still stand today, such as Fort Nuestra Señora de la Soledad in Umatac. Guam is the biggest single segment of Micronesia, the largest islands between the island of Kyushu (Japan), New Guinea, the Philippines, and the Hawaiian Islands.\n\nSpanish colonization commenced on June 15, 1668, with the arrival of Diego Luis de San Vitores and Pedro Calungsod, who established the first Catholic church. The islands were part of the Spanish East Indies governed from the Philippines, which were in turn part of the Viceroyalty of New Spain based in Mexico City. Other reminders of colonial times include the old Governor's Palace in Plaza de España and the Spanish Bridge, both in Hagatña. Guam's Cathedral Dulce Nombre de Maria was formally opened on February 2, 1669, as was the Royal College of San Juan de Letran. Guam, along with the rest of the Mariana and Caroline Islands, were treated as part of Spain's colony in the Philippines. While the island's Chamorro culture has indigenous roots, the cultures of both Guam and the Northern Marianas have many similarities with Spanish culture due to three centuries of Spanish rule.\n\nInternal conflicts\n\nIntermittent warfare lasting from July 23, 1670, until July 1695, plus the typhoons of 1671 and 1693, and in particular the smallpox epidemic of 1688, reduced the Chamorro population from 50,000 to 10,000, finally to less than 5,000. Precipitated by the death of Quipuha, and the murder of Father San Vitores and Pedro Calungsod by local rebel chief Matapang, tensions led to a number of conflicts. Captain Juan de Santiago started a campaign to conquer the island, which was continued by the successive commanders of the Spanish forces.\n\nAfter his arrival in 1674, Captain Damian de Esplana ordered the arrest of rebels who attacked the population of certain towns. Hostilities eventually led to the destruction of villages such as Chochogo, Pepura, Tumon, Sidia-Aty, Sagua, Nagan and Ninca. Starting in June 1676, the first Spanish Governor of Guam, Capt. Francisco de Irrisarri y Vinar, controlled internal affairs more strictly than his predecessors in order to curb tensions. He also ordered the construction of schools, roads and other infrastructure. Later, Capt. Jose de Quiroga arrived in 1680 and continued some of the development projects started by his predecessors. He also continued the search for the rebels who had assassinated Father San Vitores, resulting in campaigns against the rebels which were hiding out in some islands, eventually leading to the death of Matapang, Hurao and Aguarin. Quiroga brought some natives from the northern islands to Guam, ordering the population to live in a few large villages. These included Jinapsan, Umatac, Pago, Agat and Inarajan, where he built a number of churches. By July 1695, Quiroga had completed the conquest of Guam, Rota, Tinian and Aguigan.\n\nExpulsion of the Jesuits\n\nOn February 26, 1767, Charles III of Spain issued a decree confiscating the property of the Jesuits and banishing them from Spain and her possessions. As a consequence, the Jesuit fathers on Guam departed on November 2, 1769, on the schooner Nuestra Señora de Guadalupe, abandoning their churches, rectories and ranches.\n\nThe arrival of Governor Don Mariano Tobias, on September 15, 1771, brought agricultural reforms, including making land available to the islanders for cultivation, encouraged the development of cattle raising, imported deer and water buffalo from Manila, donkeys and mules from Acapulco, established cotton mills and salt pans, free public schools, and the first Guam militia. Later, he was transferred to Manila in June 1774.\n\nPost-Napoleonic era\n\nFollowing the Napoleonic Wars, many Spanish colonies in the Western Hemisphere had become independent, shifting the economic dependence of Guam from Mexico to the Philippines. Don Francisco Ramon de Villalobos, who became governor in 1831, improved economic conditions including the promotion of rice cultivation and the establishment of a leper hospital.\n\nOtto von Kotzebue visited the island in November 1817, and Louis de Freycinet in March 1819. Jules Dumont d'Urville made two visits, the first in May 1828. The island became a rest stop for whalers starting in 1823.\n\nA devastating typhoon struck the island on August 10, 1848, followed by a severe earthquake on January 25, 1849, which resulted in many refugees from the Caroline Islands, victims of the resultant tsunami. After a smallpox epidemic killed 3,644 Guamanians in 1856, Carolinians and Japanese were permitted to settle in the Marianas. Guam received nineteen Filipino prisoners after their failed 1872 Cavite mutiny.\n\nSpanish–American War and World War II\n\nAfter almost four centuries as part of the Kingdom of Spain, the United States occupied the island following Spain's defeat in the 1898 Spanish–American War, as part of the Treaty of Paris of 1898. Guam was transferred to the United States Navy control on December 23, 1898, by Executive Order 108-A from 25th President William McKinley. Guam came to serve as a station for American merchant and warships traveling to and from the Philippines (another American acquisition from Spain) while the Northern Mariana Islands were sold by Spain to Germany for part of its rapidly expanding German Empire, then following the German defeat in World War I (1914-1918) became a League of Nations Mandate in 1919 with the nearby Empire of Japan as the mandatory (\"trustee\") as a member nation of the victorious Allies in the \"Great War\".  A U.S. Navy yard was established at Piti in 1899, and a United States Marine Corps barracks at Sumay in 1901.Rottman, G. (2004) Guam 1941 & 1944: Loss and Reconquest. Oxford: Osprey Publishing,  Following the Philippine–American War (also known as the Philippine Insurrection, 1899-1902), rebel nationalist leaders Emilio Aguinaldo and Apolinario Mabini were exiled on Guam in 1901 after their capture.Mabini, A., 1969, The Philippine Revolution, Republic of the Philippines, Dept. of Education, National Historical Commission\n\nA marine seaplane unit was stationed in Guam from 1921 to 1930, the first in the Pacific. Pan American World Airways established a seaplane base on the island for its trans-Pacific San Francisco-Manila-Hong Kong route, and the Commercial Pacific Cable Company had earlier built a telegraph/telephone station in 1903 for its trans-oceanic communication line. During World War II (1939-1945), Guam was attacked and invaded by Japan on Monday, December 8, 1941, shortly after the attack on Pearl Harbor's American Pacific fleet and naval/air bases in Hawaii, hours before. In addition, Japan made major military moves into Southeast Asia and the East Indies islands of the South Pacific Ocean against the British and Dutch colonies, opening a new wider Pacific phase in the Second World War. The Japanese renamed Guam Ōmiya-jima (ja.: 大宮島) or Great Shrine Island.\n\nThe Northern Mariana Islands had become a League of Nations mandate assigned to Japan in 1919, pursuant to the Treaty of Versailles of 1919.   Chamorros indigenous island people from the Northern Marianas were brought to Guam to serve as interpreters and in other capacities for the occupying Japanese force. The Guamanian Chamorros were treated as an occupied enemy by the Japanese military. After the war, this would cause resentment between the Guamanian Chamorros and the Chamorros of the Northern Marianas. Guam's Chamorros believed their northern brethren should have been compassionate towards them, whereas having been administered by Japan for over 30 years, the Northern Mariana Chamorros were loyal to the Japanese government.\n\nThe Japanese occupation of Guam lasted for approximately thirty-one months. During this period, the indigenous people of Guam were subjected to forced labor, family separation, incarceration, execution, concentration camps and forced prostitution. Approximately one thousand people died during the occupation, according to later Congressional committee testimony in 2004. Some historians estimate that war violence killed 10% of Guam's then 20,000 population.Werner Gruhl, [https://books.google.com/books?idow5Wlmu9MPQC&pg\nPA102&dq&hlen#v\nonepage&q&f\nfalse Imperial Japan's World War Two, 1931–1945] , Transaction Publishers, 2007 \n\nThe United States returned and fought the Battle of Guam from July 21 to August 10, 1944, to recapture the island from Japanese military occupation. More than 18,000 Japanese were killed as only 485 surrendered. Sergeant Shoichi Yokoi, who surrendered in January 1972, appears to have been the last confirmed Japanese holdout for 28 years in the forested back country on Guam. The United States also captured and occupied the nearby Northern Marianas Islands.\n\nNorth Field  was established in 1944, and was renamed for Brigadier General James Roy Andersen (1904–1945) of the old U.S. Army Air Forces as Andersen Air Force Base.\n\nPost-war\n\nAfter World War II, the Guam Organic Act of 1950 established Guam as an unincorporated organized territory of the United States, provided for the structure of the island's civilian government, and granted the people U.S. citizenship. The Governor of Guam was federally appointed until 1968, when the Guam Elective Governor Act provided for the office's popular election.  Since Guam is not a U.S. state, U.S. citizens residing on Guam are not allowed to vote for president and their congressional representative is a non-voting member.  They do, however, get to vote for party delegates in presidential primaries.\n\nVietnam War and later\n\nAndersen Air Force Base played a major role in the Vietnam War. The host unit was later designated the 36th Wing (36 WG), assigned to the Pacific Air Forces (PACAF) Thirteenth Air Force (13AF).  In September 2012, 13 AF was inactivated and its functions merged into PACAF. The multinational Cope North military exercise is an annual event.[https://www.postguam.com/news/local/us-japan-australia-to-hold-cope-north/article_97099f96-edd5-11e6-9b56-ef2a341c3941.html US, Japan, Australia to hold Cope North 2017 February 9, 2017] Guam Post Retrieved March 27, 2017.\n \nOn August 6, 1997, Guam was the site of the Korean Air Flight 801 aircraft accident. The Boeing 747–300 jetliner was preparing to land when it crashed into a hill, killing 228 of the 254 people on board. Since 1974, about 124 historic sites in Guam have been recognized under the U.S. National Register of Historic Places. Guam temporarily hosted 100,000 Vietnamese refugees in 1975, and 6,600 Kurdish refugees in 1996.\n\nIn August 2017, North Korea warned that it might launch mid-range ballistic missiles into waters within 18 to of Guam, following an exchange of threats between the governments of North Korea and the United States.\n\nGeography\n\nGuam lies between 13.2°N and 13.7°N and between 144.6°E and 145.0°E, and has an area of 212 sqmi, making it the 32nd largest island of the United States. It is the southernmost and largest island in the Mariana island chain and is also the largest island in Micronesia. This island chain was created by the colliding Pacific and Philippine Sea tectonic plates. Guam is the closest land mass to the Mariana Trench, a deep subduction zone, that lies beside the island chain to the east. Challenger Deep, the deepest surveyed point in the Oceans, is southwest of Guam at 35797 ft deep. The highest point in Guam is Mount Lamlam at an elevation of 1334 ft.\"Geography of Guam\". Official site of Guam, April 19, 2014. Retrieved April 19, 2014, from .\n\nThe island of Guam is 30 mi long and 4 to wide, three-fourths the size of Singapore. The island experiences occasional earthquakes due to its location on the western edge of the Pacific Plate and near the Philippine Sea Plate. In recent years, earthquakes with epicenters near Guam have had magnitudes ranging from 5.0 to 8.7. Unlike the Anatahan volcano in the Northern Mariana Islands, Guam is not volcanically active. However, due to its proximity to Anatahan, vog (i.e. volcanic smog) does occasionally affect Guam.\"Home page of the Anahatan volcano\". USGS-CNMI, November 8, 2007. Retrieved November 8, 2007 from .\n\nA coral table reef surrounds most of Guam, and the limestone plateau provides the source for most of the island's fresh water. Steep coastal cliffs dominate the north, while the southern end of the island is mountainous, with lower hills in between.\n\nClimate\n\nGuam experiences a tropical rainforest climate (Köppen Af) – though its driest month of March almost averages dry enough to qualify as a tropical monsoon climate – moderated by seasonal easterly trade winds. However, due to its proximity to the equator, high sea surface temperature and warm ocean current that transports moisture from the east, the weather is generally very warm and humid throughout the year with little seasonal temperature variation. Hence, Guam is known to have equable temperatures year round. The mean high temperature is 86 °F and mean low is 76 °F. Temperatures rarely exceed 90 °F or fall below 70 °F. The relative humidity commonly exceeds 84 percent at night throughout the year, but the average monthly humidity hovers near 66 percent. The dry season runs from December to June. The remaining months (July to November) constitute the wet season with an average annual rainfall between 1981 and 2010 of around 98 in. The months of January and February are considered the coolest months of the year with overnight low temperatures of 70 to and generally less oppressive humidity levels. The highest temperature ever recorded in Guam was 96 F on April 18, 1971, and April 1, 1990, and the lowest temperature ever recorded was 65 F on February 8, 1973.\n\nGuam is located in Typhoon Alley and it is common for the island to be threatened by tropical storms and possible typhoons during the wet season. The highest risk of typhoons is during August through October.  They can, however, occur year-round. The most intense typhoon to pass over Guam recently was Super Typhoon Pongsona, with sustained winds of 144 mph, gusts to 173 mph, which slammed Guam on December 8, 2002, leaving massive destruction. The wettest month on record at Guam Airport has been August 1997 with  and the driest February 2015 with . The wettest calendar year has been 1976 with  and the driest 1998 with . The most rainfall in a single day occurred on 15 October 1953 when  fell.\n\nSince Super Typhoon Pamela in 1976, wooden structures have been largely replaced by concrete structures. During the 1980s wooden utility poles began to be replaced by typhoon-resistant concrete and steel poles. After the local Government enforced stricter construction codes, many home and business owners built their structures out of reinforced concrete with installed typhoon shutters.\n\nDemographics\n\nEthnic groups\n\nBased on a 2010 estimate, the largest ethnic group are the native Chamorros, accounting for 37.3% of the total population. Other significant ethnic groups include those of Filipino (26.3%), White (7.1%), and Chuukese (7%) ethnicities. The rest are from other Pacific Islands or of Asian ancestry.\n\nLanguage\n\nThe official languages of the island are English and Chamorro.\nReligion\n\n \nAccording to the Pew Research Center, 2010:[http://www.globalreligiousfutures.org/countries/guam#/?affiliations_religion_id\n0&affiliations_year=2010 Guam]\n\n*Roman Catholic 75%\n*Protestants 17.7%\n*Unaffiliated 1.7%\n*Other religions 1.6%\n*Folk religions 1.5%\n*Other Christians 1.4%\n*Buddhists 1.1%\n*Eastern Orthodox \n\nThe national team plays at the Guam National Football Stadium, which has a capacity of 1,000. The men's national football team are known as the \"matao\" team. Matao is the definition of highest level or \"noble\" class; the matao team have done exceptionally well under the head coach Gary White. As of 2016, the Matao is led by Darren Sawatzky, the current head coach.  \n\nThe top football division in Guam is the Guam Men's Soccer League. Rovers FC and Guam Shipyard are the league's most competitive and successful clubs, both have won nine championships in the past years.\n\nBasketball\n\nThe Guam national basketball team is traditionally one of the top teams in the Oceania region behind Australia and New Zealand.\n\nAs of 2015, it is the reigning champion of the Pacific Games Basketball Tournament.\n\nGuam is home to various basketball organizations, including the GBA.https://www.guamsportsnetwork.com/2017/gba-bombers-hold-off-mvp-season-3-title/\n\nSwimming\n\nIn the 2012 Summer Olympics in London, Pilar Shimizu competed for Guam and placed 42nd in the breaststroke competition.\n\nRugby union\n\nGuam is represented in rugby union by the Guam national rugby union team. The team has never qualified for a Rugby World Cup. Guam played their first match in 2005, an 8–8 draw with India. Guam's biggest win was a 74–0 defeat of Brunei in June 2008.\n\nMixed martial arts\n\nUFC fighter Jon Tuck, who boasts a professional record of 10 wins and 4 losses, three of those wins while with the UFC, fights out of Guam.\n\nEconomy\n\nGuam's economy depends primarily on tourism, Department of Defense installations and locally owned businesses. Despite paying no income or excise tax, it receives large transfer payments from the general revenues of the U.S. federal treasury. Under the provisions of a special law by Congress, it is Guam's treasury rather than the U.S. treasury that receives the federal income taxes paid by local taxpayers (including military and civilian federal employees assigned to Guam).\n\nLying in the western Pacific, Guam is a popular destination for Japanese tourists. Its tourist hub, Tumon, features over 20 large hotels, a Duty Free Shoppers Galleria, Pleasure Island district, indoor aquarium, Sandcastle Las Vegas–styled shows and other shopping and entertainment venues. It is a relatively short flight from Asia or Australia compared to Hawaii, with hotels and seven public golf courses accommodating over a million tourists per year. Although 75% of the tourists are Japanese, Guam receives a sizable number of tourists from South Korea, the U.S., the Philippines, and Taiwan.. visitguam.org Significant sources of revenue include duty-free designer shopping outlets, and the American-style malls: Micronesia Mall, Guam Premier Outlets, the Agana Shopping Center, and the world's largest Kmart.\n\nThe economy had been stable since 2000 due to increased tourism. It is expected to stabilize with the transfer of U.S. Marine Corps' 3rd Marine Expeditionary Force, currently in Okinawa, Japan, (approximately 8,000 Marines, along with their 10,000 dependents), to Guam between 2010 and 2015.  In 2003, Guam had a 14% unemployment rate, and the government suffered a $314 million shortfall.\n\nThe Compacts of Free Association between the United States, the Federated States of Micronesia, the Republic of the Marshall Islands and the Republic of Palau accorded the former entities of the Trust Territory of the Pacific Islands a political status of \"free association\" with the United States. The Compacts give citizens of these island nations generally no restrictions to reside in the United States (also its territories), and many were attracted to Guam due to its proximity, environmental, and cultural familiarity. Over the years, it was claimed by some in Guam that the territory has had to bear the brunt of this agreement in the form of public assistance programs and public education for those from the regions involved, and the federal government should compensate the states and territories affected by this type of migration. Over the years, Congress had appropriated \"Compact Impact\" aids to Guam, the Northern Mariana Islands and Hawaii, and eventually this appropriation was written into each renewed Compact. Some, however, continue to claim the compensation is not enough or that the distribution of actual compensation received is significantly disproportionate.\n\n Guam's largest single private sector employer, with about 1,400 jobs, was Continental Micronesia, a subsidiary of Continental Airlines;Kerrigan, Kevin. . Pacific News Center (May 5, 2010). Retrieved October 5, 2010. \"Continental Micronesia is Guam's single largest employer. About 1400 jobs here on dependent on the airline.\" it is now a part of United Airlines, a subsidiary of Chicago-based United Continental Holdings, Inc.\"[http://ir.unitedcontinentalholdings.com/phoenix.zhtml?c83680&p\nirol-homeProfile Company Information].\" ([https://www.webcitation.org/6CXmddfol?urlhttp://ir.unitedcontinentalholdings.com/phoenix.zhtml?c%3D83680%26p%3Dirol-homeProfile Archive]) United Continental Holdings. Retrieved November 16, 2012.  the Continental Micronesia annual payroll in Guam was $90 million.\n\nGovernment and politics\n\nGuam is governed by a popularly elected governor and a unicameral 15-member legislature, whose members are known as senators. Its judiciary is overseen by the Supreme Court of Guam.\n\nThe District Court of Guam is the court of United States federal jurisdiction in the territory. Guam elects one delegate to the United States House of Representatives, currently Democrat Madeleine Z. Bordallo. The delegate does not have a vote on the final passage of legislation, but is accorded a vote in committee, and the privilege to speak to the House. U.S. citizens in Guam vote in a straw poll for their choice in the U.S. Presidential general election, but since Guam has no votes in the Electoral College, the poll has no real effect. However, in sending delegates to the Republican and Democratic national conventions, Guam does have influence in the national presidential race.  These delegates are elected by local party conventions.\n\nPolitical status\n\nIn the 1980s and early 1990s, there was a significant movement in favor of this U.S. territory becoming a commonwealth, which would give it a level of self-government similar to Puerto Rico and the Northern Mariana Islands. However, the federal government rejected the version of a commonwealth that the government of Guam proposed, because its clauses were incompatible with the Territorial Clause (Art. IV, Sec. 3, cl. 2) of the U.S. Constitution. Other movements advocate U.S. statehood for Guam, union with the state of Hawaii, or union with the Northern Mariana Islands as a single territory, or independence.\n\nIn a 1982 plebiscite, voters indicated interest in seeking commonwealth status. The island has been considering another non-binding plebiscite on decolonization since 1998. Governor Eddie Baza Calvo intended to include one during the island's November 2016 elections but it was delayed again.\n\nA Commission on Decolonization was established in 1997 to educate the people of Guam about the various political status options in its relationship with the U.S.: statehood, free association and independence. The group was dormant for some years. In 2013, the Commission began seeking funding to start a public education campaign. There were few subsequent developments until late 2016. In early December 2016, the Commission scheduled a series of education sessions in various villages about the current status of Guam's relationship with the U.S. and the self-determination options that might be considered. The Commission's current Executive Director is Edward Alvarez and there are ten members. The group is also expected to release position papers on independence and statehood but the contents have not yet been completed.\n\nThe United Nations is in favor of greater self-determination for Guam and other such territories. The UN's Special Committee on Decolonization has agreed to endorse the Governor's education plan. The commission's May 2016 report states: \"With academics from the University of Guam, [the Commission] was working to create and approve educational materials. The Office of the Governor was collaborating closely with the Commission\" in developing educational materials for the public.\n\nThe United States Department of the Interior had approved a $300,000 grant for decolonization education, Edward Alvarez told the United Nations Pacific Regional Seminar in May 2016. \"We are hopeful that this might indicate a shift in [United States] policy to its Non-Self-Governing Territories such as Guam, where they will be more willing to engage in discussions about our future and offer true support to help push us towards true self-governances and self-determination.\"\n\nVillages\n\nGuam is divided into nineteen municipalities called villages:\n \n*Agana Heights \n*Agat\n*Asan‑Maina\n*Barrigada\n*Chalan‑Pago‑Ordot\n*Dededo\n*Hagåtña (capital)\n*Inarajan\n*Mangilao\n*Merizo\n*Mongmong‑Toto‑Maite\n*Piti\n*Santa Rita\n*Sinajana\n*Talofofo\n*Tamuning\n*Umatac\n*Yigo\n*Yona\n\nMilitary bases\n\nNote: Naval Air Station Agana has been deactivated. [http://www.globalsecurity.org/military/facility/agana.htm Military: Naval Air Station, Agana (Tiyan)] . GlobalSecurity.org. Retrieved 2010-02-19.See also List of United States Navy installations#Guam.\n\nThe U.S. military maintains jurisdiction over its bases, which cover approximately 39000 acre, or 29% of the island's total land area:\n\n*U.S. Naval Base Guam, U.S. Navy – Sumay\n*U.S. Coast Guard Sector Guam, – Sumay\n*Andersen Air Force Base, U.S. Air Force – Yigo\n*Apra Harbor – Orote peninsula\n*Ordnance Annex, U.S. Navy – South Central Highlands (formerly known as Naval Magazine)\n*Naval Computer and Telecommunications Station, U.S. Navy – Barrigada and Finegayan\n*Joint Force Headquarters-Guam, Guam National Guard – Radio Barrigada and Fort Juan Muna\n\nIn addition to on-shore military installations, Guam, along with the rest of the Mariana Islands, is being prepared to be the westernmost military training range for the U.S.  Guam is currently viewed as a key military hub that will further allow U.S. military power to be projected via sea and sky.\n\nThe U.S. military has proposed building a new aircraft carrier berth on Guam and moving 8,600 Marines, and 9,000 of their dependents, to Guam from Okinawa, Japan. Including the required construction workers, this buildup would increase Guam's population by 45%. In a February 2010 letter, the United States Environmental Protection Agency sharply criticized these plans because of a water shortfall, sewage problems and the impact on coral reefs. By 2012, these plans had been cut to have only a maximum of 4,800 Marines stationed on the island, two thirds of whom would be there on a rotational basis without their dependents.Parrish, Karen (July 20, 2012). [http://www.defense.gov//news/newsarticle.aspx?id=117196 \"Carter: Guam Central to Asia-Pacific Strategy.\"]  American Forces Press Service.\n\nWith the proposed increased military presence stemming from the upcoming preparation efforts and relocation efforts of U.S. Marines from Okinawa, Japan to Guam slated to begin in 2010 and last for the next several years thereafter, the amount of total land that the military will control or tenant may grow to or surpass 40% of the entire landmass of Guam.\n\nIn January 2011, the Ike Skelton National Defense Authorization Act for FY2011 indicated that recent significant events will delay the deadline for realigning U.S. Marine Corps service members and their families from Okinawa to Guam. The transfer may be as late as 2020. In addition, the Defense Authorization Act cut approximately $320 million from the 2011 budget request.\n\nVillagers and the military community are interconnected in many ways.  Many villagers serve in the military or are retired.  Many active duty personnel and Defense Department civilians also live in the villages outside of the military installation areas.  The military and village communities have \"adoption\" programs where Guam's population and military personnel stationed on Guam perform community service projects.\n\nTransportation and communications\n\nMost of the island has state-of-the-art mobile phone services and high-speed internet widely available through either cable or DSL. Guam was added to the North American Numbering Plan (NANP) in 1997 (country code 671 became NANP area code 671), removing the barrier of high-cost international long-distance calls to the U.S. mainland.\n\nGuam is also a major hub for submarine cables between the Western U.S., Hawaii, Australia and Asia. Guam currently serves twelve submarine cables, with most continuing to China.\n\nIn 1899, the local postage stamps were overprinted \"Guam\" as was done for the other former Spanish colonies, but this was discontinued shortly thereafter and regular U.S. postage stamps have been used ever since. Because Guam is also part of the U.S. Postal System (postal abbreviation: GU, ZIP code range: 96910–96932), mail to Guam from the U.S. mainland is considered domestic and no additional charges are required. Private shipping companies, such as FedEx, UPS, and DHL, however, have no obligation to do so, and do not regard Guam as domestic.\n\nThe speed of mail traveling between Guam and the states varies depending on size and time of year. Light, first-class items generally take less than a week to or from the mainland, but larger first-class or Priority items can take a week or two. Fourth-class mail, such as magazines, are transported by sea after reaching Hawaii. Most residents use post office boxes or private mail boxes, although residential delivery is becoming increasingly available. Incoming mail not from the Americas should be addressed to \"Guam\" instead of \"USA\" to avoid being routed the long way through the U.S. mainland and possibly charged a higher rate (especially from Asia).\n\nThe Commercial Port of Guam is the island's lifeline because most products must be shipped into Guam for consumers.  It receives the weekly calls of the Hawaii-based shipping line Matson, Inc. whose container ships connect Guam with Honolulu, Hawaii, Los Angeles, California, Oakland, California and Seattle, Washington. The port is also the regional transhipment hub for over 500,000 customers throughout the Micronesian region.  The port is the shipping and receiving point for containers designated for the island's U.S. Department of Defense installations, Andersen Air Force Base and Commander, Naval Forces Marianas and eventually the Third Marine Expeditionary Force.\n\nGuam is served by the Antonio B. Won Pat International Airport, which is a hub for United Airlines.  The island is outside the United States customs zone so Guam is responsible for establishing and operating its own customs and quarantine agency and jurisdiction. Therefore, the U.S. Customs and Border Protection only carries immigration (but not customs) functions. Since Guam is under federal immigration jurisdiction, passengers arriving directly from the United States skip immigration and proceed directly to Guam Customs and Quarantine.\n\nHowever, due to the Guam and CNMI visa waiver program for certain countries, an eligibility pre-clearance check is carried on Guam for flights to the States. For travel from the Northern Mariana Islands to Guam, a pre-flight passport and visa check is performed before boarding the flight to Guam. On flights from Guam to the Northern Mariana Islands, no immigration check is performed. Traveling between Guam and the States through a foreign point, however, does require a passport.\n\nMost residents travel within Guam using personally owned vehicles. The local government currently outsources the only public bus system (Guam Regional Transit Authority), and some commercial companies operate buses between tourist-frequented locations.\n\nEcology\n\nBrown tree snake\n\nBelieved to be a stowaway on a U.S. military transport near the end of World War II, the brown tree snake (Boiga irregularis) was accidentally introduced to Guam, which previously had no native species of snake. It nearly eliminated the native bird population. The problem was exacerbated because the snake has no natural predators on the island. The brown tree snake, known locally as the kulebla, is native to northern and eastern coasts of Australia, Papua New Guinea, and the Solomon Islands. It is slightly venomous, but relatively harmless to human beings; it is nocturnal. Although some studies have suggested a high density of these serpents on Guam, residents rarely see them. The United States Department of Agriculture has trained detector dogs to keep the snakes out of the island's cargo flow. The United States Geological Survey also has dogs that can detect snakes in forested environments around the region's islands.\n\nBefore the introduction of the brown tree snake, Guam was home to several endemic bird species. Among them were the Guam rail (or ko'ko bird in Chamorro) and the Guam flycatcher, both common throughout the island. Today the flycatcher is entirely extinct and the Guam rail is extinct in the wild but bred in captivity by the Division of Aquatic and Wildlife Resources. The devastation caused by the snake has been significant over the past several decades. As many as twelve bird species are believed to have been driven to extinction. According to many elders, ko'ko' birds were common in Guam before World War II.\n\nOther bird species threatened by the brown tree snake include the Mariana crow, the Mariana swiftlet, and the Micronesian starling, though populations are present on other islands, including Rota.\n\nGuam is said to have many more insects and 40 times more spiders than neighboring islands, because their natural predators birds are severely diminished, and the forests are almost completely silent due to lack of birdsong.\n\n*[http://news.rice.edu/wp-content/uploads/2012/09/0914_SPIDER-b2-big.jpg] [http://news.rice.edu/wp-content/uploads/2012/09/0914_SPIDER4-webs-big.jpg] Forest on Guam swathed in spider webs.\n\nCoconut rhinoceros beetle\n\nAn infestation of the coconut rhinoceros beetle (CRB), Oryctes rhinoceros, was detected on Guam on September 12, 2007. CRB is not known to occur in the United States except in American Samoa. Delimiting surveys performed September 13–25, 2007, indicated that the infestation was limited to Tumon Bay and Faifai Beach, an area of approximately 900 acre. Guam Department of Agriculture (GDA) placed quarantine on all properties within the Tumon area on October 5 and later expanded the quarantine to about 2500 acre on October 25; approximately  radius in all directions from all known locations of CRB infestation. CRB is native to Southern Asia and distributed throughout Asia and the Western Pacific including Sri Lanka, Upolu, Samoa, American Samoa, Palau, New Britain, West Irian, New Ireland, Pak Island and Manus Island (New Guinea), Fiji, Cocos (Keeling) Islands, Mauritius, and Reunion.\n\nOther invasive animal species\n\nFrom the seventeenth through nineteenth centuries, the Spanish introduced pigs, dogs, chickens, the Philippine deer (Rusa mariannus), black francolins, and carabao (a subspecies of water buffalo), which have cultural significance.  Herds of carabao obstruct military base operations and harm native ecosystems.  After birth control and adoption efforts were ineffective, the U.S. military began culling the herds in 2002 leading to organized protests from island residents.\n\nOther introduced species include cane toads imported in 1937, the giant African snail (an agricultural pest introduced during World War II by Japanese occupation troops) and more recently frog species which could threaten crops in addition to providing additional food for the brown tree snake population. Reports of loud chirping frogs native to Puerto Rico and known as coquí, that may have arrived from Hawaii, have led to fears that the noise could threaten Guam's tourism.\n\nGuam has no native amphibian species, but now a total of eight amphibian species has been established in Guam. Litoria fallax (native to the eastern coast of Australia) has been present in Guam since 1968, and Rhinella marina (the cane toad) was brought to the island in 1937. The other 6 amphibian species, namely Hylarana guentheri (native to mainland Asia), Microhyla pulchra (native to mainland Asia), Polypedates braueri (endemic to Taiwan), Eleutherodactylus planirostris (native to the Caribbean), Fejervarya cancrivora (the Guam variety being most closely related to F. cancrivora found in Taiwan), and Fejervarya limnocharis (native to Southeast Asia), have been in Guam since 2003.Wostl, Elijah, Eric N. Smith, and Robert N. Reed. 2016. Origin and Identity of Fejervarya (Anura: Dicroglossidae) on Guam. Pacific Science 70(2):233–241. https://doi.org/10.2984/70.2.9 Many species were likely inadvertently introduced via shipping cargo, especially from Taiwan, mainland China, and Southeast Asia.\n\nIntroduced feral pigs and deer, over-hunting, and habitat loss from human development are also major factors in the decline and loss of Guam's native plants and animals.\n\nThreats to indigenous plants\n\nInvading animal species are not the only threat to Guam's native flora. Tinangaja, a virus affecting coconut palms, was first observed on the island in 1917 when copra production was still a major part of Guam's economy. Though coconut plantations no longer exist on the island, the dead and infected trees that have resulted from the epidemic are seen throughout the forests of Guam.\n\nDuring the past century, the dense forests of northern Guam have been largely replaced by thick tangan-tangan brush (Leucaena leucocephala). Much of Guam's foliage was lost during World War II.  In 1947, the U.S. military is thought to have planted tangan-tangan by seeding the island from the air to prevent erosion. Tangan-tangan was present on the island before 1905.Stafford, William Edwin (1905) Useful Plants of Guam\n\nIn southern Guam, non-native grass species dominate much of the landscape. Although the colorful and impressive flame tree (Delonix regia) is found throughout the Marianas, the tree on Guam has been largely decimated.\n\nWildfires\n\nWildfires plague the forested areas of Guam every dry season despite the island's humid climate.  Most fires are caused by humans with 80% resulting from arson., pp. 6–7, guamforestry.org Poachers often start fires to attract deer to the new growth. Invasive grass species that rely on fire as part of their natural life cycle grow in many regularly burned areas. Grasslands and \"barrens\" have replaced previously forested areas leading to greater soil erosion. During the rainy season, sediment is carried by the heavy rains into the Fena Lake Reservoir and Ugum River, leading to water quality problems for southern Guam. Eroded silt also destroys the marine life in reefs around the island. Soil stabilization efforts by volunteers and forestry workers (planting trees) have had little success in preserving natural habitats.\n\nAquatic preserves\n\nEfforts have been made to protect Guam's coral reef habitats from pollution, eroded silt and overfishing, problems that have led to decreased fish populations.  (Since Guam is a significant vacation spot for scuba divers, this is important.) In recent years, the Department of Agriculture, Division of Aquatic and Wildlife Resources has established several new marine preserves where fish populations are monitored by biologists. Before adopting U.S. Environmental Protection Agency standards, portions of Tumon Bay were dredged by the hotel chains to provide a better experience for hotel guests. Tumon Bay has since been made into a preserve.  A federal Guam National Wildlife Refuge in northern Guam protects the decimated sea turtle population in addition to a small colony of Mariana fruit bats.\n\nHarvest of sea turtle eggs was a common occurrence on Guam before World War II. The green sea turtle (Chelonia mydas) was harvested legally on Guam before August 1978, when it was listed as threatened under the Endangered Species Act. The hawksbill sea turtle (Eretmochelys imbricata) has been on the endangered list since 1970. In an effort to ensure protection of sea turtles on Guam, routine sightings are counted during aerial surveys and nest sites are recorded and monitored for hatchlings.\n\nEducation\n\nColleges and universities\n\nThe University of Guam (UOG) and Guam Community College, both fully accredited by the Western Association of Schools and Colleges, offer courses in higher education. UOG is a member of the exclusive group of only 76 land-grant institutions in the entire United States. Pacific Islands University is a small Christian liberal arts institution nationally accredited by the Transnational Association of Christian Colleges and Schools. They offer courses at both the undergraduate and graduate levels.\n\nPrimary and secondary schools\n\nThe Guam Department of Education serves the entire island of Guam. In 2000, 32,000 students attended Guam's public schools.  Guam Public Schools have struggled with problems such as high dropout rates and poor test scores. Guam's educational system has always faced unique challenges as a small community located 6000 mi from the U.S. mainland with a very diverse student body including many students who come from backgrounds without traditional American education. An economic downturn in Guam since the mid-1990s has compounded the problems in schools.\n\nBefore September 1997, the U.S. Department of Defense partnered with Guam Board of Education.\"[http://www.newspaperarchive.com/LandingPage.aspx?typeglp&search\n%22rats%2c%20other%20problems%20face%20guam%20schools%22&img\\\\na0041\\6800243\\56035875_clean.html Rats, other problems face Guam schools].\" Pacific Stars and Stripes. October 3, 1993. In September 1997, the DoDEA opened its own schools for children of military personnel.[http://www.spaceref.com/news/viewpr.html?pid\n12381 Guam School to Be Renamed in Honor of NASA Astronaut William McCool |SpaceRef – Your Space Reference]. SpaceRef (August 21, 2003). Retrieved June 13, 2012. DoDEA schools, which also serve children of some federal civilian employees, had an attendance of 2,500 in 2000. DoDEA Guam operates three elementary/middle schools and one high school.\n\nPublic libraries\n\nGuam Public Library System operates the Nieves M. Flores Memorial Library in Hagåtña and five branch libraries.. gpls.guam.gov\n\nHealth care\n\nThe Government of Guam maintains the island's main health care facility, Guam Memorial Hospital, in Tamuning.[http://www.gmha.org/ Welcome to the official Guam Memorial Hospital Authority Website! – Tonyt] . Gmha.org. Retrieved June 13, 2012. U.S. board certified doctors and dentists practice in all specialties. In addition, the U.S. Naval Hospital in Agana Heights serves active-duty members and dependents of the military community.[http://www.med.navy.mil/sites/usnhguam/Pages/default.aspx U.S Naval Hospital Guam] . United States Navy There is one subscriber-based air ambulance located on the island, CareJet, which provides emergency patient transportation across Guam and surrounding islands. A private hospital, the Guam Regional Medical City opened its doors in early 2016.\n\nFilm-making\n\nOver the years, a number of films have been shot on Guam, including Shiro's Head (directed by the Muna brothers) and the government-funded Max Havoc: Curse of the Dragon (2004). Although set on Guam, No Man Is an Island (1962) was not shot there, but in the Republic of the Philippines. Guam. http://en.wikipedia.org/?curid=11974."
  }
}
