{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16211",
  "eid" : "249d8740-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778570676,
  "textBody" : "John Martyn, OBE (11 September 1948 – 29 January 2009), born as  Iain David McGeachy, was a British singer-songwriter and guitarist. Over a 40-year career, he released 21 studio albums, and received frequent critical acclaim. Martyn began his career at age 17 as a key member of the British folk music scene, drawing inspiration from American blues and English traditional music, and signed with Island Records. By the 1970s he had begun incorporating jazz and rock into his sound on albums such as Solid Air (1973) and One World (1977), as well as experimenting with guitar effects and tape delay machines such as Echoplex. He struggled with substance abuse and domestic problems throughout the 1970s and 1980s, though continued to release albums while collaborating with figures such as Phil Collins and Lee \"Scratch\" Perry. He remained active until his death in 2009. He was described by The Times as \"an electrifying guitarist and singer whose music blurred the boundaries between folk, jazz, rock and blues\".[http://www.timesonline.co.uk/tol/comment/obituaries/article5613933.ece Obituary: \"John Martyn: guitarist and singer\"], The Times, 30 January 2009, pg. 75.\n\nEarly life\n\nMartyn was born in Beechcroft Avenue, New Malden,  London, England to an English mother and a Scottish father.John Neil Munro, Some People Are Crazy — the John Martyn Story; , Polygon, 2007 p.125 His parents, both opera singers, divorced when he was five and he spent his childhood alternating between Scotland and England. Much of this was spent in the care of his grandmother, as well as on his mother's houseboat. He attended Shawlands Academy in Glasgow. At school, he was a keen rugby player. On leaving school he attended Art College in Glasgow, but left to pursue his musical aspirations.\n\nLate 1960s and collaborations with Beverley Martyn\n\nMentored by Hamish Imlach, Martyn began his professional musical career when he was 17, playing a fusion of blues and folk resulting in a distinctive style which made him a key figure in the British folk scene during the mid-1960s. He signed to Chris Blackwell's Island Records in 1967 and released his first album, London Conversation, the following year. \n\nThis first album was soon followed by The Tumbler, which was moving towards jazz. By 1970 Martyn had developed a wholly original and idiosyncratic sound: acoustic guitar run through a fuzzbox, phase shifter and Echoplex. This sound was first apparent on Stormbringer! in 1970, which was written and performed by Martyn and his then-wife Beverley, who had previously recorded solo as Beverley Kutner. Her second album with Martyn was The Road to Ruin, also released in 1970. Island Records felt that it would be more successful to market Martyn as a solo act and this was how subsequent albums were produced, although Beverley continued to make appearances as a background singer as well as continuing as a solo artist herself.\n\n1970s\n\nIn 1973, Martyn released one of the defining British albums of the 1970s, Solid Air, the title song a tribute to the singer-songwriter Nick Drake, a close friend and label-mate who died in 1974 from an overdose of antidepressants. In 2009, a double CD Deluxe edition of Solid Air was released featuring unreleased songs and out-takes, and sleeve notes by Record Collector's Daryl Easlea. On Solid Air, as with the one that preceded it, Bless the Weather, Martyn collaborated with jazz bassist Danny Thompson, with whom he proceeded to have a musical partnership which continued until his death. He developed a new, slurred vocal style, the timbre of which resembled a tenor saxophone.\n\nFollowing the commercial success of Solid Air, Martyn quickly recorded and released the experimental Inside Out, an album with emphasis placed on feel and improvisation rather than song structure. In 1975, he followed this with Sunday's Child, a more song-based collection \"My Baby Girl\", \"Spencer the Rover\", with several references to his young family. Martyn subsequently described this period as 'very happy'. In September 1975 he released a live album, Live at Leeds — Martyn had been unable to convince Island to release the record, and resorted to selling individually signed copies by mail from home. Live at Leeds features Danny Thompson and drummer John Stevens. In 2010 a 2CD Deluxe version of Live at Leeds was released, and it was discovered that not all of the songs on the original album were from the Leeds concert. After releasing Live at Leeds, Martyn took a sabbatical, including a visit to Jamaica, spending time with famous reggae producer Lee \"Scratch\" Perry.\n\nIn 1977, he released One World, which led some commentators to describe Martyn as the \"Father of Trip-Hop\".His obituary in The Times states that \"The record's dubby, echoing soundscapes have been claimed as the forerunner of the 'trip-hop' style that emerged in the 1990s.\" It included tracks such as \"Small Hours\" and \"Big Muff\", a collaboration with Lee \"Scratch\" Perry. Small Hours was recorded outside; the microphones picked up ambient sounds, such as geese from a nearby lake. In 1978 he played guitar on the album Harmony of the Spheres by Neil Ardley.\n\n1980s and marriage breakup\n\nMartyn's marriage broke down at the end of the 1970s and \"John hit the self destruct button\" (although other biographers, including The Times obituary writer, attribute the break-up of his marriage to his already being addicted to drink and drugs). In her autobiography, Beverley also alleges protracted domestic violence.Beverley Martyn, Jacki Dacosta, Sweet Honesty - The Beverley Martyn Story; , Grosvenor, 2011  Out of this period, described by Martyn as \"a very dark period in my life\", came the album Grace and Danger. Released in October 1980, the album had been held up for a year by Chris Blackwell. He was a close friend of John and Beverley, and found the album too openly disturbing to release. Only after intense and sustained pressure from Martyn did Blackwell agree to release the album. Commenting on that period, Martyn said, \"I was in a dreadful emotional state over that record. I was hardly in control of my own actions. The reason they finally released it was because I freaked: Please get it out! I don't give a damn about how sad it makes you feel—it's what I'm about: the direct communication of emotion. Grace and Danger was very cathartic, and it really hurt.\"\n\nIn the late 1980s Martyn cited Grace and Danger as his favourite album, and said that it was \"probably the most specific piece of autobiography I've written. Some people keep diaries, I make records.\" The album has since become one of his highest-regarded, prompting a deluxe double-disc issue in 2007, containing the original album remastered.\n\nPhil Collins played drums and sang backing vocals on Grace and Danger and subsequently played drums on and produced Martyn's next album, Glorious Fool, in 1981. Martyn left Island records in 1981, and recorded Glorious Fool and Well Kept Secret for WEA achieving his first Top 30 album. Martyn released a live album, Philentropy, in 1983. Returning to Island records, he recorded Sapphire (1984), Piece by Piece (1986) and the live Foundations (1987) before leaving the label in 1988.\n\n1990s and 2000s\n\nMartyn released The Apprentice in 1990 and Cooltide in 1991 for Permanent Records, and reunited with Phil Collins for No Little Boy (1993) which featured rerecorded versions of some of his classic tracks. The similar 1992 release Couldn't Love You More was unauthorised by and disowned by Martyn. Material from these recordings and his two Permanent albums has been recycled on many releases. Permanent Records also released a live 2-CD set called \"Live\" in 1994. And (1996) came out on Go!Discs and saw Martyn draw heavily on trip-hop textures, a direction which saw more complete expression on 2000s Glasgow Walker; The Church with One Bell (1998) is a covers album which draws on songs by Portishead and Ben Harper. In 2001, Martyn appeared on the track Deliver Me by Faithless keyboard player and DJ Sister Bliss. \n\nIn July 2006 the documentary Johnny Too Bad was screened by the BBC. The programme documented the period surrounding the operation to amputate Martyn's right leg below the knee (the result of a burst cyst) and the writing and recording of On the Cobbles (2004), an album described by Peter Marsh on the BBC Music website as \"the strongest, most consistent set he's come up with in years.\" Much of Cobbles was a revisiting of his acoustic-based sound.\nMartyn's last concerts were in November 2008 reprising Grace and Danger. \n\nIn collaboration with his keyboard player Spenser Cozens, Martyn wrote and performed the score for Strangebrew (Robert Wallace 2007) winning the Fortean Times Award at the London Short Film Festival in the same year. The film concept being a strong influence of the album design of Martyn's Heaven and Earth (2011). On 4 February 2008, Martyn received the lifetime achievement award at the BBC Radio 2 Folk Awards. The award was presented by his friend Phil Collins. The BBC website says of Martyn, \"his heartfelt performances have either suggested or fully demonstrated an idiosyncratic genius.\" Eric Clapton was quoted as saying that Martyn was, \"so far ahead of everything, it's almost inconceivable.\"\n\nTo mark Martyn's 60th birthday, Island released a 4CD boxed set, Ain't No Saint on 1 September 2008. The set includes unreleased studio material and rare live recordings.\n\nMartyn was appointed OBE in the 2009 New Year Honours.\n\nDeath\n\nMartyn abused drugs and alcohol throughout his life. On the brink of major success he was derailed by his passion for musical exploration and by an appetite for excess that bordered on self-destruction. Martyn slid into alcoholism, his live performances punctuated by moments of incoherent drunkenness.\n\nMartyn died on 29 January 2009, in hospital in Thomastown, County Kilkenny, Ireland, due to acute respiratory distress syndrome. He was survived by his partner, Teresa Walsh, and his children, Mhairi and Spencer McGeachy.\n\nFollowing Martyn's death, Rolling Stone lauded his \"progressive-folk invention and improvising sorcery. Phil Collins paid tribute to him. BBC Radio 2's folk presenter Mike Harding said:\"John Martyn was a true original, one of the giants of the folk scene. He could write and sing classics like 'May You Never' and 'Fairy Tale Lullaby' like nobody else, and he could sing traditional songs like 'Spencer The Rover' in a way that made them seem new minted.\"\n\nHarding introduced an hour-long tribute to Martyn in his Radio 2 programme on 25 February 2009. A tribute album, Johnny Boy Would Love This, was released on 15 August 2011, comprising cover versions of his songs by various artists.\n\nDiscography\n\nStudio albums\n\n*London Conversation (October 1967)\n*The Tumbler (December 1968)\n*Stormbringer! (February 1970) (with Beverley Martyn)\n*The Road to Ruin (November 1970) (with Beverley Martyn)\n*Bless the Weather (November 1971)\n*Solid Air (February 1973)\n*Inside Out (October 1973)\n*Sunday's Child (January 1975)\n*One World (November 1977)\n*Grace and Danger (October 1980)\n*Glorious Fool (September 1981)\n*Well Kept Secret (August 1982)\n*Sapphire (November 1984)\n*Piece by Piece (February 1986)\n*The Apprentice (March 1990)\n*Cooltide (November 1991)\n*No Little Boy (October 1992)\n*And (August 1996)\n*The Church with One Bell (covers album) (March 1998)\n*Glasgow Walker (May 2000)\n*On the Cobbles (April 2004)\n*Heaven and Earth (May 2011)\n\nOther\n\n*Live at Leeds (September 1975)\n*So Far So Good (March 1977)\n*The Electric John Martyn (October 1982)\n*Philentropy (November 1983) (live)\n*Foundations (October 1987)\n*BBC Radio 1 Live in Concert (May 1992)\n*Couldn't Love You More (October 1992)\n*No Little Boy (July 1993)\n*Sweet Little Mysteries: The Island Anthology (June 1994)\n*Live (July 1995)\n*Serendipity — An Introduction To John Martyn (1998)\n*Another World; Collectors Series Vol 1 (1998)\n*Germany 1986 (July 2001; with Danny Thompson)\n*The Brewery Arts Centre, Kendal 1986 (August 2001) (with Danny Thompson)\n*Live at the Town & Country Club, 1986; Collectors Series 2 (August 2001)\n*Sweet Certain Surprise (live in New York, 1977) (October 2001)\n*Live at the Bottom Line, New York, 1983; Collectors Series 3 (November 2001)\n*Live in Milan, 1979; Collectors Series 4 (May 2002)\n*Solid Air — Classics Re-visited (2002) (compilation of previously released tracks)\n*Live in Concert at the Cambridge Folk Festival BBC 1985 (2003)\n*And Live (recorded 1996) (2003)\n*Late Night John (2004)\n*In Session (live) (2006) (BBC sessions, recorded for John Peel and Bob Harris, between 1973 and 1978)\n*BBC Live in Concert (2007)\n*The Battle of Medway: 17 July 1973 (live) (2007)\n*Anthology (2007)\n*The Simmer Dim (2008)\n*The July Wakes (2008)\n*Ain't No Saint (2008) 40-year anthology\n*May You Never — The Very Best Of (2009)\n*The Island Years (September 2013) 18-disc box set\n\nSingles\n\n* \"John The Baptist\" / \"The Ocean\" (Island WIP 6076, January 1970)\n* \"Anni Part 1\" / \"Anni Part 2\" (with John Stevens' Away) (Vertigo 6059 140, 1976)\n* \"Over The Hill\" / \"Head And Heart\" (Island WIP 6385, February 1977)\n* \"Dancing\" / \"Dealer\" (version) (Island WIP 6414, January 1978)\n* \"In Search of Anna\" / \"Certain Surprise\" (Island K7450, 1979)\n* \"Johnny Too Bad\" / \"Johnny Too Bad\" (version) Island WIP 6547, October 1980)\n* \"Johnny Too Bad\" (extended dub version) / \"Big Muff\" (extended remix) (Island IPR 2047, March 1981)\n* \"Sweet Little Mystery\" / \"Johnny Too Bad\" (Island WIP 6718, June 1981)\n* \"Please Fall in Love With Me\" / \"Don't You Go\" (WEA K 79243, August 1981)\n* \"Hiss on the Tape\" / \"Livin' Alone\" (WEA K 79336, October 1982)\n* \"Gun Money\" (U.S. remix) / \"Hiss on the Tape\" (live) (WEA 259987-7, November 1982)\n* \"Over The Rainbow\" / \"Rope Soul'd\" (Island IS 209, October 1984)\n* \"Angeline\" / \"Tight Connection to My Heart\" (Island IS 265, February 1986)Angeline was the world's first ever CD single, released in 1986\n* \"Classic John Martyn\" (Island CID 265, February 1986)\n* \"Angeline\" / \"Tight Connection to My Heart\" / \"May You Never\" / \"Certain Surprise\" / \"One Day Without You\" (Island 12 IS 265, February 1986)\n* \"Lonely Love\" / \"Sweet Little Mystery\" (live) (Island IS 272, October 1986)\n* \"Send Me One Line\" / \"Patterns in the Rain\" (Hypertension HYS 100 102, May 1990)\n* \"Deny This Love\" (remix) / \"The Apprentice\" (live) (Permanent S12, August 1990, 7-inch vinyl)\n* \"Deny This Love\" (remix) / \"The Apprentice\" (live) / \"Deny This Love\" (album version) (Permanent CD Perm 1, August 1990)\n* \"Jack The Lad\" / \"Annie Sez\" / \"The Cure\" / \"Jack Sez\" (Permanent CD Perm 3, April 1992)\n* \"Sweet Little Mystery\" / \"Head and Heart\" (Permanent, Perm 6, September 1982)\n* \"Lonely Love\" / \"May You Never\" (Permanent, Perm 8, December 1992)\n* \"Somewhere Over The Rainbow\" (Voiceprint, JMCD001, 1998)\n* \"Excuse Me Mister\" / \"God Song\" (live) / \"Rock, Salt & Nails\" (live) / \"John Wayne\" (live) (Independiente, ISOM14MS CD, May 1998)\n* \"Deliver Me\" (with Sister Bliss) (Multiply Records, CDMULTY72, March 2001)\n\nDVD\n\n* Live in Concert  (John Martyn & Band at Camden Palace Theatre, London, 23 November 1984) (2001) re-issued Live at the Camden Palace Theatre London 1984 (2004) & Live from the Camden Palace (2012)\n* Live in Dublin  (with Danny Thompson at Gaiety Theatre, Dublin, for RTE TV, Ireland, June 1986) (2005)\n* John Martyn at the BBC  (various 1973 - 1982) (2006)\n* The Apprentice in Concert  (John Martyn & Band with Dave Gilmour at Shaw Theatre, London, 31 March 1990) (2006)\n* Empty Ceiling  (John Martyn & Band recorded for Ohne Filter, German TV, April 1986) (2007)\n* The Man Upstairs  (John Martyn (solo) recorded for Rockpalast, German TV, 17 March 1978) (2008)\n* Solid Air Live at the Roundhouse  (John Martyn & Band in London, 3 February 2007) (2007)\n* One World One John  (John Martyn & Band recorded mostly at Vicar Street, Dublin in 1999, 2000 & 2003) (2012)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John Martyn" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16211" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Martyn, OBE (11 September 1948 – 29 January 2009), born as  Iain David McGeachy, was a British singer-songwriter and guitarist. Over a 40-year career, he released 21 studio albums, and received frequent critical acclaim. Martyn began his career at age 17 as a key member of the British folk music scene, drawing inspiration from American blues and English traditional music, and signed with Island Records. By the 1970s he had begun incorporating jazz and rock into his sound on albums such as Solid Air (1973) and One World (1977), as well as experimenting with guitar effects and tape delay machines such as Echoplex. He struggled with substance abuse and domestic problems throughout the 1970s and 1980s, though continued to release albums while collaborating with figures such as Phil Collins and Lee \"Scratch\" Perry. He remained active until his death in 2009. He was described by The Times as \"an electrifying guitarist and singer whose music blurred the boundaries between folk, jazz, rock and blues\".[http://www.timesonline.co.uk/tol/comment/obituaries/article5613933.ece Obituary: \"John Martyn: guitarist and singer\"], The Times, 30 January 2009, pg. 75.\n\nEarly life\n\nMartyn was born in Beechcroft Avenue, New Malden,  London, England to an English mother and a Scottish father.John Neil Munro, Some People Are Crazy — the John Martyn Story; , Polygon, 2007 p.125 His parents, both opera singers, divorced when he was five and he spent his childhood alternating between Scotland and England. Much of this was spent in the care of his grandmother, as well as on his mother's houseboat. He attended Shawlands Academy in Glasgow. At school, he was a keen rugby player. On leaving school he attended Art College in Glasgow, but left to pursue his musical aspirations.\n\nLate 1960s and collaborations with Beverley Martyn\n\nMentored by Hamish Imlach, Martyn began his professional musical career when he was 17, playing a fusion of blues and folk resulting in a distinctive style which made him a key figure in the British folk scene during the mid-1960s. He signed to Chris Blackwell's Island Records in 1967 and released his first album, London Conversation, the following year. \n\nThis first album was soon followed by The Tumbler, which was moving towards jazz. By 1970 Martyn had developed a wholly original and idiosyncratic sound: acoustic guitar run through a fuzzbox, phase shifter and Echoplex. This sound was first apparent on Stormbringer! in 1970, which was written and performed by Martyn and his then-wife Beverley, who had previously recorded solo as Beverley Kutner. Her second album with Martyn was The Road to Ruin, also released in 1970. Island Records felt that it would be more successful to market Martyn as a solo act and this was how subsequent albums were produced, although Beverley continued to make appearances as a background singer as well as continuing as a solo artist herself.\n\n1970s\n\nIn 1973, Martyn released one of the defining British albums of the 1970s, Solid Air, the title song a tribute to the singer-songwriter Nick Drake, a close friend and label-mate who died in 1974 from an overdose of antidepressants. In 2009, a double CD Deluxe edition of Solid Air was released featuring unreleased songs and out-takes, and sleeve notes by Record Collector's Daryl Easlea. On Solid Air, as with the one that preceded it, Bless the Weather, Martyn collaborated with jazz bassist Danny Thompson, with whom he proceeded to have a musical partnership which continued until his death. He developed a new, slurred vocal style, the timbre of which resembled a tenor saxophone.\n\nFollowing the commercial success of Solid Air, Martyn quickly recorded and released the experimental Inside Out, an album with emphasis placed on feel and improvisation rather than song structure. In 1975, he followed this with Sunday's Child, a more song-based collection \"My Baby Girl\", \"Spencer the Rover\", with several references to his young family. Martyn subsequently described this period as 'very happy'. In September 1975 he released a live album, Live at Leeds — Martyn had been unable to convince Island to release the record, and resorted to selling individually signed copies by mail from home. Live at Leeds features Danny Thompson and drummer John Stevens. In 2010 a 2CD Deluxe version of Live at Leeds was released, and it was discovered that not all of the songs on the original album were from the Leeds concert. After releasing Live at Leeds, Martyn took a sabbatical, including a visit to Jamaica, spending time with famous reggae producer Lee \"Scratch\" Perry.\n\nIn 1977, he released One World, which led some commentators to describe Martyn as the \"Father of Trip-Hop\".His obituary in The Times states that \"The record's dubby, echoing soundscapes have been claimed as the forerunner of the 'trip-hop' style that emerged in the 1990s.\" It included tracks such as \"Small Hours\" and \"Big Muff\", a collaboration with Lee \"Scratch\" Perry. Small Hours was recorded outside; the microphones picked up ambient sounds, such as geese from a nearby lake. In 1978 he played guitar on the album Harmony of the Spheres by Neil Ardley.\n\n1980s and marriage breakup\n\nMartyn's marriage broke down at the end of the 1970s and \"John hit the self destruct button\" (although other biographers, including The Times obituary writer, attribute the break-up of his marriage to his already being addicted to drink and drugs). In her autobiography, Beverley also alleges protracted domestic violence.Beverley Martyn, Jacki Dacosta, Sweet Honesty - The Beverley Martyn Story; , Grosvenor, 2011  Out of this period, described by Martyn as \"a very dark period in my life\", came the album Grace and Danger. Released in October 1980, the album had been held up for a year by Chris Blackwell. He was a close friend of John and Beverley, and found the album too openly disturbing to release. Only after intense and sustained pressure from Martyn did Blackwell agree to release the album. Commenting on that period, Martyn said, \"I was in a dreadful emotional state over that record. I was hardly in control of my own actions. The reason they finally released it was because I freaked: Please get it out! I don't give a damn about how sad it makes you feel—it's what I'm about: the direct communication of emotion. Grace and Danger was very cathartic, and it really hurt.\"\n\nIn the late 1980s Martyn cited Grace and Danger as his favourite album, and said that it was \"probably the most specific piece of autobiography I've written. Some people keep diaries, I make records.\" The album has since become one of his highest-regarded, prompting a deluxe double-disc issue in 2007, containing the original album remastered.\n\nPhil Collins played drums and sang backing vocals on Grace and Danger and subsequently played drums on and produced Martyn's next album, Glorious Fool, in 1981. Martyn left Island records in 1981, and recorded Glorious Fool and Well Kept Secret for WEA achieving his first Top 30 album. Martyn released a live album, Philentropy, in 1983. Returning to Island records, he recorded Sapphire (1984), Piece by Piece (1986) and the live Foundations (1987) before leaving the label in 1988.\n\n1990s and 2000s\n\nMartyn released The Apprentice in 1990 and Cooltide in 1991 for Permanent Records, and reunited with Phil Collins for No Little Boy (1993) which featured rerecorded versions of some of his classic tracks. The similar 1992 release Couldn't Love You More was unauthorised by and disowned by Martyn. Material from these recordings and his two Permanent albums has been recycled on many releases. Permanent Records also released a live 2-CD set called \"Live\" in 1994. And (1996) came out on Go!Discs and saw Martyn draw heavily on trip-hop textures, a direction which saw more complete expression on 2000s Glasgow Walker; The Church with One Bell (1998) is a covers album which draws on songs by Portishead and Ben Harper. In 2001, Martyn appeared on the track Deliver Me by Faithless keyboard player and DJ Sister Bliss. \n\nIn July 2006 the documentary Johnny Too Bad was screened by the BBC. The programme documented the period surrounding the operation to amputate Martyn's right leg below the knee (the result of a burst cyst) and the writing and recording of On the Cobbles (2004), an album described by Peter Marsh on the BBC Music website as \"the strongest, most consistent set he's come up with in years.\" Much of Cobbles was a revisiting of his acoustic-based sound.\nMartyn's last concerts were in November 2008 reprising Grace and Danger. \n\nIn collaboration with his keyboard player Spenser Cozens, Martyn wrote and performed the score for Strangebrew (Robert Wallace 2007) winning the Fortean Times Award at the London Short Film Festival in the same year. The film concept being a strong influence of the album design of Martyn's Heaven and Earth (2011). On 4 February 2008, Martyn received the lifetime achievement award at the BBC Radio 2 Folk Awards. The award was presented by his friend Phil Collins. The BBC website says of Martyn, \"his heartfelt performances have either suggested or fully demonstrated an idiosyncratic genius.\" Eric Clapton was quoted as saying that Martyn was, \"so far ahead of everything, it's almost inconceivable.\"\n\nTo mark Martyn's 60th birthday, Island released a 4CD boxed set, Ain't No Saint on 1 September 2008. The set includes unreleased studio material and rare live recordings.\n\nMartyn was appointed OBE in the 2009 New Year Honours.\n\nDeath\n\nMartyn abused drugs and alcohol throughout his life. On the brink of major success he was derailed by his passion for musical exploration and by an appetite for excess that bordered on self-destruction. Martyn slid into alcoholism, his live performances punctuated by moments of incoherent drunkenness.\n\nMartyn died on 29 January 2009, in hospital in Thomastown, County Kilkenny, Ireland, due to acute respiratory distress syndrome. He was survived by his partner, Teresa Walsh, and his children, Mhairi and Spencer McGeachy.\n\nFollowing Martyn's death, Rolling Stone lauded his \"progressive-folk invention and improvising sorcery. Phil Collins paid tribute to him. BBC Radio 2's folk presenter Mike Harding said:\"John Martyn was a true original, one of the giants of the folk scene. He could write and sing classics like 'May You Never' and 'Fairy Tale Lullaby' like nobody else, and he could sing traditional songs like 'Spencer The Rover' in a way that made them seem new minted.\"\n\nHarding introduced an hour-long tribute to Martyn in his Radio 2 programme on 25 February 2009. A tribute album, Johnny Boy Would Love This, was released on 15 August 2011, comprising cover versions of his songs by various artists.\n\nDiscography\n\nStudio albums\n\n*London Conversation (October 1967)\n*The Tumbler (December 1968)\n*Stormbringer! (February 1970) (with Beverley Martyn)\n*The Road to Ruin (November 1970) (with Beverley Martyn)\n*Bless the Weather (November 1971)\n*Solid Air (February 1973)\n*Inside Out (October 1973)\n*Sunday's Child (January 1975)\n*One World (November 1977)\n*Grace and Danger (October 1980)\n*Glorious Fool (September 1981)\n*Well Kept Secret (August 1982)\n*Sapphire (November 1984)\n*Piece by Piece (February 1986)\n*The Apprentice (March 1990)\n*Cooltide (November 1991)\n*No Little Boy (October 1992)\n*And (August 1996)\n*The Church with One Bell (covers album) (March 1998)\n*Glasgow Walker (May 2000)\n*On the Cobbles (April 2004)\n*Heaven and Earth (May 2011)\n\nOther\n\n*Live at Leeds (September 1975)\n*So Far So Good (March 1977)\n*The Electric John Martyn (October 1982)\n*Philentropy (November 1983) (live)\n*Foundations (October 1987)\n*BBC Radio 1 Live in Concert (May 1992)\n*Couldn't Love You More (October 1992)\n*No Little Boy (July 1993)\n*Sweet Little Mysteries: The Island Anthology (June 1994)\n*Live (July 1995)\n*Serendipity — An Introduction To John Martyn (1998)\n*Another World; Collectors Series Vol 1 (1998)\n*Germany 1986 (July 2001; with Danny Thompson)\n*The Brewery Arts Centre, Kendal 1986 (August 2001) (with Danny Thompson)\n*Live at the Town & Country Club, 1986; Collectors Series 2 (August 2001)\n*Sweet Certain Surprise (live in New York, 1977) (October 2001)\n*Live at the Bottom Line, New York, 1983; Collectors Series 3 (November 2001)\n*Live in Milan, 1979; Collectors Series 4 (May 2002)\n*Solid Air — Classics Re-visited (2002) (compilation of previously released tracks)\n*Live in Concert at the Cambridge Folk Festival BBC 1985 (2003)\n*And Live (recorded 1996) (2003)\n*Late Night John (2004)\n*In Session (live) (2006) (BBC sessions, recorded for John Peel and Bob Harris, between 1973 and 1978)\n*BBC Live in Concert (2007)\n*The Battle of Medway: 17 July 1973 (live) (2007)\n*Anthology (2007)\n*The Simmer Dim (2008)\n*The July Wakes (2008)\n*Ain't No Saint (2008) 40-year anthology\n*May You Never — The Very Best Of (2009)\n*The Island Years (September 2013) 18-disc box set\n\nSingles\n\n* \"John The Baptist\" / \"The Ocean\" (Island WIP 6076, January 1970)\n* \"Anni Part 1\" / \"Anni Part 2\" (with John Stevens' Away) (Vertigo 6059 140, 1976)\n* \"Over The Hill\" / \"Head And Heart\" (Island WIP 6385, February 1977)\n* \"Dancing\" / \"Dealer\" (version) (Island WIP 6414, January 1978)\n* \"In Search of Anna\" / \"Certain Surprise\" (Island K7450, 1979)\n* \"Johnny Too Bad\" / \"Johnny Too Bad\" (version) Island WIP 6547, October 1980)\n* \"Johnny Too Bad\" (extended dub version) / \"Big Muff\" (extended remix) (Island IPR 2047, March 1981)\n* \"Sweet Little Mystery\" / \"Johnny Too Bad\" (Island WIP 6718, June 1981)\n* \"Please Fall in Love With Me\" / \"Don't You Go\" (WEA K 79243, August 1981)\n* \"Hiss on the Tape\" / \"Livin' Alone\" (WEA K 79336, October 1982)\n* \"Gun Money\" (U.S. remix) / \"Hiss on the Tape\" (live) (WEA 259987-7, November 1982)\n* \"Over The Rainbow\" / \"Rope Soul'd\" (Island IS 209, October 1984)\n* \"Angeline\" / \"Tight Connection to My Heart\" (Island IS 265, February 1986)Angeline was the world's first ever CD single, released in 1986\n* \"Classic John Martyn\" (Island CID 265, February 1986)\n* \"Angeline\" / \"Tight Connection to My Heart\" / \"May You Never\" / \"Certain Surprise\" / \"One Day Without You\" (Island 12 IS 265, February 1986)\n* \"Lonely Love\" / \"Sweet Little Mystery\" (live) (Island IS 272, October 1986)\n* \"Send Me One Line\" / \"Patterns in the Rain\" (Hypertension HYS 100 102, May 1990)\n* \"Deny This Love\" (remix) / \"The Apprentice\" (live) (Permanent S12, August 1990, 7-inch vinyl)\n* \"Deny This Love\" (remix) / \"The Apprentice\" (live) / \"Deny This Love\" (album version) (Permanent CD Perm 1, August 1990)\n* \"Jack The Lad\" / \"Annie Sez\" / \"The Cure\" / \"Jack Sez\" (Permanent CD Perm 3, April 1992)\n* \"Sweet Little Mystery\" / \"Head and Heart\" (Permanent, Perm 6, September 1982)\n* \"Lonely Love\" / \"May You Never\" (Permanent, Perm 8, December 1992)\n* \"Somewhere Over The Rainbow\" (Voiceprint, JMCD001, 1998)\n* \"Excuse Me Mister\" / \"God Song\" (live) / \"Rock, Salt & Nails\" (live) / \"John Wayne\" (live) (Independiente, ISOM14MS CD, May 1998)\n* \"Deliver Me\" (with Sister Bliss) (Multiply Records, CDMULTY72, March 2001)\n\nDVD\n\n* Live in Concert  (John Martyn & Band at Camden Palace Theatre, London, 23 November 1984) (2001) re-issued Live at the Camden Palace Theatre London 1984 (2004) & Live from the Camden Palace (2012)\n* Live in Dublin  (with Danny Thompson at Gaiety Theatre, Dublin, for RTE TV, Ireland, June 1986) (2005)\n* John Martyn at the BBC  (various 1973 - 1982) (2006)\n* The Apprentice in Concert  (John Martyn & Band with Dave Gilmour at Shaw Theatre, London, 31 March 1990) (2006)\n* Empty Ceiling  (John Martyn & Band recorded for Ohne Filter, German TV, April 1986) (2007)\n* The Man Upstairs  (John Martyn (solo) recorded for Rockpalast, German TV, 17 March 1978) (2008)\n* Solid Air Live at the Roundhouse  (John Martyn & Band in London, 3 February 2007) (2007)\n* One World One John  (John Martyn & Band recorded mostly at Vicar Street, Dublin in 1999, 2000 & 2003) (2012). John Martyn. http://en.wikipedia.org/?curid=16211."
  }
}
