{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10151",
  "eid" : "f40b9950-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778489189,
  "textBody" : "Ernst Theodor Amadeus Hoffmann (commonly abbreviated as E. T. A. Hoffmann; born Ernst Theodor Wilhelm Hoffmann; 24 January 177625 June 1822) was a Prussian Romantic author of fantasy and Gothic horror, a jurist, composer, music critic, draftsman and caricaturist.Penrith Goff, \"E.T.A. Hoffmann\" in E. F. Bleiler, Supernatural Fiction Writers: Fantasy and Horror. New York: Scribner's, 1985. pp. 111–120. Mike Ashley, \"Hoffmann, E(rnst) T(heodor) A(madeus) \", in St. James Guide to Horror, Ghost, and Gothic Writers, ed. David Pringle. Detroit: St. James Press/Gale, 1998.  (pp. 668-69).\"Ludwig Tieck, Heinrich von Kleist, and E. T. A. Hoffmann also profoundly influenced the development of European Gothic horror in the nineteenth century....\" Heide Crawford, The Origins of the Literary Vampire. Lanham : Rowman & Littlefield, 2016.  (p. xiii). His stories form the basis of Jacques Offenbach's famous opera The Tales of Hoffmann, in which Hoffmann appears (heavily fictionalized) as the hero. He is also the author of the novella The Nutcracker and the Mouse King, on which Pyotr Ilyich Tchaikovsky's ballet The Nutcracker is based. The ballet Coppélia is based on two other stories that Hoffmann wrote, while Schumann's Kreisleriana is based on Hoffmann's character Johannes Kreisler.\n\nHoffmann's stories highly influenced 19th-century literature, and he is one of the major authors of the Romantic movement.\n\nLife\n\nYouth\n\nHoffmann's ancestors, both maternal and paternal, were jurists. His father, Christoph Ludwig Hoffmann (1736–97), was a barrister in Königsberg, Prussia (now Kaliningrad, Russia), as well as a poet and amateur musician who played the viola da gamba. In 1767 he married his cousin, Lovisa Albertina Doerffer (1748–96). Ernst Theodor Wilhelm, born on 24 January 1776, was the youngest of three children, of whom the second died in infancy.\n\nWhen his parents separated in 1778, the father went to Insterburg (now Chernyakhovsk) with his elder son, Johann Ludwig Hoffmann (1768–after 1822), while Ernst's mother stayed in Königsberg with her relatives: two aunts, Johanna Sophie Doerffer (1745–1803) and Charlotte Wilhelmine Doerffer (c. 1754–79) and their brother, Otto Wilhelm Doerffer (1741–1811), who were all unmarried. This trio raised the youngster.\n\nThe household, dominated by the uncle (whom Ernst nicknamed O Weh—\"Oh dear!\"—in a play on his initials), was pietistic and uncongenial. Hoffmann was to regret his estrangement from his father. Nevertheless, he remembered his aunts with great affection, especially the younger, Charlotte, whom he nicknamed Tante Füßchen (\"Aunt Littlefeet\"). Although she died when he was only three years old, he treasured her memory (e.g. see Kater Murr) and embroidered stories about her to such an extent that later biographers sometimes assumed her to be imaginary, until proof of her existence was found after World War II.Friedrich Schnapp. \"Hoffmanns Verwandte aus der Familie Doerffer in Königsberger Kirchenbüchern der Jahre 1740–1811.\" Mitteilungen der E. T. A. Hoffmann-Gesellschaft. 23 (1977), 1–11.\n\nBetween 1781 and 1792 he attended the Lutheran school or Burgschule, where he made good progress in classics. He was taught drawing by one Saemann, and counterpoint by a Polish organist named Podbileski, who was to be the prototype of Abraham Liscot in Kater Murr. Ernst showed great talent for piano-playing, and busied himself with writing and drawing. The provincial setting was not, however, conducive to technical progress, and despite his many-sided talents he remained rather ignorant of both classical forms and of the new artistic ideas that were developing in Germany. He had, however, read Schiller, Goethe, Swift, Sterne, Rousseau and Jean Paul, and wrote part of a novel titled Der Geheimnisvolle.\n\nAround 1787 he became friends with Theodor Gottlieb von Hippel the Younger (1775–1843), the son of a pastor, and nephew of Theodor Gottlieb von Hippel the Elder, the well-known writer friend of Immanuel Kant. During 1792, both attended some of Kant's lectures at the University of Königsberg. Their friendship, although often tested by an increasing social difference, was to be lifelong.\n\nIn 1794, Hoffmann became enamored of Dora Hatt, a married woman to whom he had given music lessons. She was ten years older, and gave birth to her sixth child in 1795. In February 1796, her family protested against his attentions and, with his hesitant consent, asked another of his uncles to arrange employment for him in Glogau (Głogów), Prussian Silesia.Rüdiger Safranski. E. T. A. Hoffmann: Das Leben eines skeptischen Phantasten. Carl Hanser, Munich, 1984. Gerhard R. Kaiser. E. T. A. Hoffmann. J. B. Metzlersche, Stuttgart, 1988. \n\nThe provinces\n\nFrom 1796 Hoffmann obtained employment as a clerk for his uncle, Johann Ludwig Doerffer, who lived in Glogau with his daughter Minna. After passing further examinations he visited Dresden, where he was amazed by the paintings in the gallery, particularly those of Correggio and Raphael. During the summer of 1798, his uncle was promoted to a court in Berlin, and the three of them moved there in August—Hoffmann's first residence in a large city. It was there that Hoffmann first attempted to promote himself as a composer, writing an operetta called Die Maske and sending a copy to Queen Luise of Prussia. The official reply advised to him to write to the director of the Royal Theatre, a man named Iffland. By the time the latter responded, Hoffmann had passed his third round of examinations and had already left for Posen (Poznań) in South Prussia in the company of his old friend Hippel, with a brief stop in Dresden to show him the gallery.\n\nFrom June 1800 to 1803 he worked in Prussian provinces in the area of Greater Poland and Masovia. This was the first time he had lived without supervision by members of his family, and he started to become \"what school principals, parsons, uncles, and aunts call dissolute.\"\n\nHis first job, at Posen, was endangered after Carnival on Shrove Tuesday 1802, when caricatures of military officers were distributed at a ball. It was immediately deduced who had drawn them, and complaints were made to authorities in Berlin, who were reluctant to punish the promising young official. The problem was solved by \"promoting\" Hoffmann to Płock in New East Prussia, the former capital of Poland (1079–1138), where administrative offices were relocated from Thorn (Toruń). He visited the place to arrange lodging, before returning to Posen where he married \"Mischa\" (Maria, or Marianna Tekla Michalina Rorer, whose Polish surname was Trzcińska). They moved to Płock in August 1802.\n\nHoffmann despaired because of his exile, and drew caricatures of himself drowning in mud alongside ragged villagers. He did make use, however, of his isolation, by writing and composing. He started a diary on 1 October 1803. An essay on the theatre was published in Kotzebue's periodical, Die Freimüthige, and he entered a competition in the same magazine to write a play. Hoffmann's was called Der Preis (\"The Prize\"), and was itself about a competition to write a play. There were fourteen entries, but none was judged worthy of the award: 100 Friedrichs d'or. Nevertheless, his entry was singled out for praise.Die Freimüthige, 11 February 1804. Volume II, no. 6, pages xxi–xxiv. This was one of the few good times of a sad period of his life, which saw the deaths of his uncle J. L. Hoffmann in Berlin, his Aunt Sophie, and Cora Hatt in Königsberg.\n\nAt the beginning of 1804 he obtained a post at Warsaw. On his way there, he passed through his hometown and met one of Cora Hatt's daughters. He was never to return to Königsberg.\n\nWarsaw\n\nHoffmann assimilated well with Polish society; the years spent in Prussian Poland he recognized as the happiest of his life. In Warsaw he found the same atmosphere he had enjoyed in Berlin, renewing his friendship with Zacharias Werner, and meeting his future biographer, a neighbour and fellow jurist called Julius Eduard Itzig (who changed his name to Hitzig after his baptism). Itzig had been a member of the Berlin literary group called the Nordstern, and he gave Hoffmann the works of Novalis, Ludwig Tieck, Achim von Arnim, Clemens Brentano, Gotthilf Heinrich von Schubert, Carlo Gozzi, and Calderon. These relatively late introductions marked his work profoundly.\n\nHe moved in the circles of August Wilhelm Schlegel, Adelbert von Chamisso, Friedrich de la Motte Fouqué, Rahel Levin, and David Ferdinand Koreff.\n\nHis fortunate position was not to last: on 28 November 1806, during the War of the Fourth Coalition, Napoleon Bonaparte's troops captured Warsaw, and the Prussian bureaucrats lost their jobs. They divided the contents of the treasury between them and fled. In January 1807 his wife and two-year-old daughter Cäcilia returned to Posen, while he pondered whether to move to Vienna or go back to Berlin. A delay of six months was caused by severe illness. Eventually the French authorities demanded that all former officials swear allegiance or leave the country. As they refused to grant him a passport to Vienna, he was forced to return to Berlin.\nHe visited his family in Posen before arriving in Berlin on 18 June 1807, hoping to further his career there as an artist and writer.\n\nBerlin and Bamberg\n\nThe next fifteen months were some of the worst in Hoffmann's life.\nThe city of Berlin was also occupied by Napoleon's troops. Obtaining only meagre allowances, he had frequent recourse to his friends, constantly borrowing money and still going hungry for days at a time; he learned that his daughter had died. Nevertheless, he managed to compose his Six Canticles for a cappella choir: one of his best compositions, which he would later attribute to Kreisler in Lebensansichten des Katers Murr.\n\nOn 1 September 1808 he arrived with his wife in Bamberg, where he began a job as theatre manager. The director, Count Soden, left almost immediately for Würzburg, leaving a man named Heinrich Cuno in charge. Hoffmann was unable to improve standards of performance, and his efforts caused intrigues against him which resulted in him losing his job to Cuno. He began work as music critic for the Allgemeine musikalische Zeitung, a newspaper in Leipzig, and his articles on Beethoven were especially well received, and highly regarded by the composer himself. It was in its pages that the \"Kapellmeister Johannes Kreisler\" character made his first appearance.\n\nHoffmann's breakthrough came in 1809, with the publication of Ritter Gluck, a story about a man who meets, or believes he has met, the composer Christoph Willibald Gluck (1714–87) more than twenty years after the latter's death. The theme alludes to the work of Jean Paul, who invented the term Doppelgänger the previous decade, and continued to exact a powerful influence over Hoffmann, becoming one of his earliest admirers. With this publication, Hoffmann began to use the pseudonym E. T. A. Hoffmann, telling people that the \"A\" stood for Amadeus, in homage to the composer Wolfgang Amadeus Mozart (1756–91). However, he continued to use Wilhelm in official documents throughout his life, and the initials E. T. W. also appear on his gravestone.\n\nThe next year, he was employed at the Bamberg Theatre as stagehand, decorator, and playwright, while also giving private music lessons.\nHe became so enamored of a young singing student, Julia Marc, that his feelings were obvious whenever they were together, and Julia's mother quickly found her a more suitable match. When Joseph Seconda offered Hoffmann a position as musical director for his opera company (then performing in Dresden), he accepted, leaving on 21 April 1813.\n\nDresden and Leipzig\n\nPrussia had declared war against France on 16 March during the War of the Sixth Coalition, and their journey was fraught with difficulties. They arrived on the 25th, only to find that Seconda was in Leipzig; on the 26th, they sent a letter pleading for temporary funds. That same day Hoffmann was surprised to meet Hippel, whom he had not seen for nine years.\n\nThe situation deteriorated, and in early May Hoffmann tried in vain to find transport to Leipzig. On 8 May, the bridges were destroyed, and his family were marooned in the city. During the day, Hoffmann would roam, watching the fighting with curiosity. Finally, on 20 May, they left for Leipzig, only to be involved in an accident which killed one of the passengers in their coach and injured his wife.\n\nThey arrived on 23 May, and Hoffmann started work with Seconda's orchestra, which he found to be of the best quality. On 4 June an armistice began, which allowed the company to return to Dresden. But on 22 August, after the end of the armistice, the family was forced to relocate from their pleasant house in the suburbs into the town, and during the next few days the Battle of Dresden raged. The city was bombarded; many people were killed by bombs directly in front of him. After the main battle was over, he visited the gory battlefield. His account can be found in Vision auf dem Schlachtfeld bei Dresden. After a long period of continued disturbance, the town surrendered on 11 November, and on 9 December the company travelled to Leipzig.\n\nOn 25 February Hoffmann quarrelled with Seconda, and the next day he was given notice of twelve weeks. When asked to accompany them on their journey to Dresden in April, he refused, and they left without him. But during July his friend Hippel visited, and soon he found himself being guided back into his old career as a jurist.\n\nBerlin\n\nAt the end of September 1814, in the wake of Napoleon's defeat, Hoffmann returned to Berlin and succeeded in regaining a job at the Kammergericht, the chamber court. His opera Undine was performed by the Berlin Theatre. Its successful run came to an end only after a fire on the night of the 25th performance. Magazines clamoured for his contributions, and after a while his standards started to decline. Nevertheless, many masterpieces date from this time.\n\nDuring the period from 1819 Hoffmann was involved with legal disputes, while fighting ill health. Alcohol abuse and syphilis eventually caused weakening of his limbs during 1821, and paralysis from the beginning of 1822. His last works were dictated to his wife or to a secretary.\n\nPrince Metternich's anti-liberal programs began to put Hoffmann in situations that tested his conscience. Thousands of people were accused of treason for having certain political opinions,\nand university professors were monitored during their lectures.\n\nKing Frederick William III of Prussia appointed an Immediate Commission for the investigation of political dissidence; when he found its observance of the rule of law too frustrating, he established a Ministerial Commission to interfere with its processes. The latter was greatly influenced by Commissioner Kamptz. During the trial of \"Turnvater\" Jahn, the founder of the gymnastics association movement, Hoffmann found himself annoying Kamptz, and became a political target. When Hoffmann caricatured Kamptz in a story (Meister Floh), Kamptz began legal proceedings. These ended when Hoffmann's illness was found to be life-threatening. The King asked for a reprimand only, but no action was ever taken. Eventually Meister Floh was published with the offending passages removed.\n\nHoffmann died of syphilis in Berlin on 25 June 1822 at the age of 46. His grave is preserved in the Protestant Friedhof III der Jerusalems- und Neuen Kirchengemeinde (Cemetery No. III of the congregations of Jerusalem Church and New Church) in Berlin-Kreuzberg, south of Hallesches Tor at the underground station Mehringdamm.\n\nWorks\n\nLiterary\n\n*Fantasiestücke in Callots Manier (collection of previously published stories, 1814)\"Fantasy pieces in the manner of Jacques Callot\"\n**\"Ritter Gluck\", \"Kreisleriana\", \"Don Juan\", \"Nachricht von den neuesten Schicksalen des Hundes Berganza\"\n**\"Der Magnetiseur\", \"Der goldne Topf\" (revised in 1819), \"Die Abenteuer der Silvesternacht\"\n*Die Elixiere des Teufels (1815)\n*Nachtstücke (1817)\n**\"Der Sandmann\", \"Das Gelübde\", \"Ignaz Denner\", \"Die Jesuiterkirche in G.\"\n**\"Das Majorat\", \"Das öde Haus\", \"Das Sanctus\", \"Das steinerne Herz\"\n*Seltsame Leiden eines Theater-Direktors (1819)\n*Klein Zaches, genannt Zinnober (1819)\n*Die Serapionsbrüder (1819)\n**\"Der Einsiedler Serapion\", \"Rat Krespel\", \"Die Fermate\", \"Der Dichter und der Komponist\"\n**\"Ein Fragment aus dem Leben dreier Freunde\", \"Der Artushof\", \"Die Bergwerke zu Falun\", \"Nußknacker und Mausekönig\" (1816)\n**\"[https://books.google.com/books?id=nYqdUy9SKd8C Der Kampf der Sänger]\", \"Eine Spukgeschichte\", \"Die Automate\", \"Doge und Dogaresse\"\n**\"Alte und neue Kirchenmusik\", \"Meister Martin der Küfner und seine Gesellen\", \"Das fremde Kind\"\n**\"Nachricht aus dem Leben eines bekannten Mannes\", \"Die Brautwahl\", \"Der unheimliche Gast\"\n**\"Das Fräulein von Scuderi\", \"Spielerglück\" (1819), \"Der Baron von B.\"\n**\"Signor Formica\", \"Zacharias Werner\", \"Erscheinungen\"\n**\"Der Zusammenhang der Dinge\", \"Vampirismus\", \"Die ästhetische Teegesellschaft\", \"Die Königsbraut\"\n*Prinzessin Brambilla (1820)\n*Lebensansichten des Katers Murr (1820)\n*\"Die Irrungen\" (1820)\n*\"Die Geheimnisse\" (1821)\n*\"Die Doppeltgänger\" (1821)\n*Meister Floh (1822)\n*\"Des Vetters Eckfenster\" (1822)\n*Letzte Erzählungen (1825)\n\nMusical\n\nVocal music\n\n*Messa d-moll (1805)\n*Trois Canzonettes à 2 et à 3 voix (1807)\n*6 Canzoni per 4 voci alla capella (1808)\n*Miserere b-moll (1809)\n*In des Irtisch weiße Fluten (Kotzebue), Lied (1811)\n*Recitativo ed Aria „Prendi l’acciar ti rendo\" (1812)\n*Tre Canzonette italiane (1812); 6 Duettini italiani (1812)\n*Nachtgesang, Türkische Musik, Jägerlied, Katzburschenlied für Männerchor (1819–21)\n\nWorks for stage\n\n*Die Maske (Libretto: E. T. A. Hoffmann), Singspiel (1799)\n*Die lustigen Musikanten (Libretto: Clemens Brentano), Singspiel (1804)\n*Bühnenmusik zu Zacharias Werners Trauerspiel „Das Kreuz an der Ostsee\" (1805)\n*Liebe und Eifersucht (Calderón and August Wilhelm Schlegel) (1807)\n*Arlequin, Ballettmusik (1808)\n*Der Trank der Unsterblichkeit (Libretto: Julius von Soden), romantische Oper (1808)\n*Wiedersehn! (Libretto: E. T. A. Hoffmann), Prolog (1809)\n*Dirna (Libretto: Julius von Soden), Melodram (1809)\n*Bühnenmusik zu Julius von Sodens Drama „Julius Sabinus\" (1810)\n*Saul, König von Israel (Libretto: Joseph von Seyfried), Melodram (1811)\n*Aurora (Libretto: Franz von Holbein) heroische Oper (1812)\n*Undine (Libretto: Friedrich de la Motte Fouqué), Zauberoper (1816)\n*Der Liebhaber nach dem Tode (beginning only)\n\nInstrumental\n\n*Rondo für Klavier (1794/95)\n*Ouvertura. Musica per la chiesa d-moll (1801)\n*Klaviersonaten: A-Dur, f-moll, F-Dur, f-moll, cis-moll (1805–1808)\n*Große Fantasie für Klavier (1806)\n*Sinfonie Es-Dur (1806)\n*Harfenquintett c-moll (1807)\n*Grand Trio E-Dur (1809)\n*Walzer zum Karolinentag (1812)\n*Teutschlands Triumph in der Schlacht bei Leipzig, (by \"Arnulph Vollweiler\", 1814; lost)\n*Serapions-Walzer (1818–1821)\n\nAssessment\n\nHoffmann is one of the best-known representatives of German Romanticism, and a pioneer of the fantasy genre, with a taste for the macabre combined with realism that influenced such authors as Edgar Allan Poe (1809–1849), Nikolai GogolKrys Svitlana, “[http://booksandjournals.brillonline.com/content/journals/10.1163/221023912x642709 Intertextual Parallels Between Gogol' and Hoffmann: A Case Study of Vij and The Devil’s Elixirs.]” Canadian-American Slavic Studies (CASS) 47.1 (2013): 1-20. (20 pages)Krys Svitlana, “Allusions to Hoffmann in Gogol’s Ukrainian Horror Stories from the Dikan'ka Collection.” Canadian Slavonic Papers: Special Issue, devoted to the 200th anniversary of Nikolai Gogol'’s birth (1809–1852) 51.2-3 (June–September 2009): 243-266. (23 pages)(1809–1852), Charles Dickens (1812–1870), Charles Baudelaire (1821–1867), George MacDonald (1824–1905),Greville MacDonald, George MacDonald and His Wife London: Allen and Unwin, 1924 (p. 297-8). Fyodor Dostoevsky (1821–1881), Vernon Lee (1856-1935),\"Another major influence for Lee is unmistakably E.T.A. Hoffmann's Der Sandmann...\"  Christa Zorn, Vernon Lee : aesthetics, history, and the Victorian female intellectual. Athens : Ohio University Press, 2003.  (p. 142). Franz Kafka (1883–1924) and Alfred Hitchcock  (1899–1980). Hoffmann's story Das Fräulein von Scuderi is sometimes cited as the first detective story and a direct influence on Poe's \"The Murders in the Rue Morgue\".The Seven Basic Plots, Christopher Booker, Continuum, 2004, page 507\n\nThe twentieth-century Russian literary theorist Mikhail Bakhtin characterised Hoffmann's works as Menippea, essentially satirical and self-parodying in form, thus including him in a tradition that includes Cervantes, Diderot and Voltaire.\n\nRobert Schumann's piano suite Kreisleriana (1838) has its title from one of Hoffmann's books (and according to Charles Rosen's The Romantic Generation, is possibly also inspired by \"The Life and Opinions of Tomcat Murr\", in which Kreisler appears). Jacques Offenbach's masterwork, the opera Les contes d'Hoffmann (\"The Tales of Hoffmann\", 1881), is based on the stories, principally Der Sandmann (\"The Sandman\", 1816), Rat Krespel (\"Councillor Krespel\", 1818), and Das verlorene Spiegelbild (\"The Lost Reflection\") from Die Abenteuer der Silvester-Nacht (\"The Adventures of New Year's Eve\", 1814). Klein Zaches genannt Zinnober (\"Little Zaches called Cinnabar\", 1819) inspired an aria, also the operetta (\"Le Roi Carotte\" , 1872). Pyotr Ilyich Tchaikovsky's ballet The Nutcracker (1892) is based on \"Nutcracker and Mouse King\", and the ballet Coppélia, with music by Delibes, is based on two eerie Hoffmann stories.\n\nHoffmann also influenced 19th-century musical opinion directly through his music criticism. His reviews of Beethoven's Symphony No. 5 in C minor, Op. 67 (1808) and other important works set new literary standards for writing about music, and encouraged later writers to consider music as \"the most Romantic of all the arts.\"See also Fausto Cercignani, E. T. A. Hoffmann, Italien und die romantische Auffassung der Musik, in S. M. Moraldo (ed.), Das Land der Sehnsucht. E. T. A. Hoffmann und Italien, Heidelberg, Winter, 2002, S. 191–201. Hoffmann's reviews were first collected for modern readers by Friedrich Schnapp, ed., in E.T.A. Hoffmann: Schriften zur Musik; Nachlese (1963)  and have been made available in an English translation in E.T.A. Hoffmann's Writings on Music, Collected in a Single Volume (2004).\n\nHoffmann strove for artistic polymathy. He created far more in his works than mere political commentary achieved through satire. His masterpiece novel Lebensansichten des Katers Murr (\"The Life and Opinions of Tomcat Murr\", 1819–1821) deals with such issues as the aesthetic status of true artistry and the modes of self-transcendence that accompany any genuine endeavour to create. Hoffmann's portrayal of the character Kreisler (a genius musician) is wittily counterpointed with the character of the tomcat Murr – a virtuoso illustration of artistic pretentiousness that many of Hoffmann's contemporaries found offensive and subversive of Romantic ideals.\n\nHoffmann's literature indicates the failings of many so-called artists to differentiate between the superficial and the authentic aspects of such Romantic ideals. The self-conscious effort to impress must, according to Hoffmann, be divorced from the self-aware effort to create. This essential duality in Kater Murr is conveyed structurally through a discursive 'splicing together' of two biographical narratives.\n\nScience fiction\n\nWhile disagreeing with E. F. Bleiler's claim that Hoffman was \"one of the two or three greatest writers of fantasy\", Algis Budrys of Galaxy Science Fiction said that he \"did lay down the groundwork for some of our most enduring themes\". Historian Martin Willis argues that Hoffmann's impact on science fiction has been overlooked, saying \"his work reveals a writer dynamically involved in the important scientific debates of the late eighteenth and early nineteenth centuries.\" Willis points out that Hoffmann's work is contemporary with Frankenstein (1818) and with \"the heated debates and the relationship between the new empirical science and the older forms of natural philosophy that held sway throughout the eighteenth century.\" His \"interest in the machine culture of his time is well represented in his short stories, of which the critically renowned The Sandman (1816) and Automata (1814) are the best examples. ...Hoffmann's work makes a considerable contribution to our understanding of the emergence of scientific knowledge in the early years of the nineteenth century and to the conflict between science and magic, centred mainly on the 'truths' available to the advocates of either practice. ...Hoffmann's balancing of mesmerism, mechanics, and magic reflects the difficulty in categorizing scientific knowledge in the early nineteenth century.\"\n\nIn popular culture\n\n*Robertson Davies invokes Hoffmann as a character (with the pet name of 'ETAH') trapped in Limbo, within his novel The Lyre of Orpheus (1988).\n*Angela Carter – The Infernal Desire Machines of Doctor Hoffman (1972)\n*Alexandre Dumas, père translated The Nutcracker into French, which aided in making the tale popular and widespread.\n*The exotic and supernatural elements in the storyline of Ingmar Bergman's 1982 film Fanny and Alexander derive largely from the stories of Hoffmann.\n*Andrei Tarkovsky wrote a script titled Hoffmaniana in which the writer himself is the main protagonist. Due to Tarkovsky's premature death, the film was never made. \n* Freud gives an extensive psychoanalytic analysis of Hoffmann's Sandman in his 1919 essay Das Unheimliche.\n* Coppelius is a German classical metal band, the name taken from Hoffmann's Sandman. The band's 2010 album, Zinnober, includes a track called \"Klein Zaches\".Review of Zinnober, http://www.ice-vajal.com/c/CD/coppelius.htm\n* The Russian show Kukly was closed by government officials after the episode where Vladimir Putin was portrayed as Hoffmann's Klein Zaches.\"New Cartoon Show Puts Putin Among Men\" http://www.ekaterinburg.com/news/print/news_id-316222.html\n* Malifaux, a tabletop skimish game appropriated both Hoffman and Coppelius from Der Sandman as characters that reference each other as having an \"Unexplained Connection\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "E. T. A. Hoffmann" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10151" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ernst Theodor Amadeus Hoffmann (commonly abbreviated as E. T. A. Hoffmann; born Ernst Theodor Wilhelm Hoffmann; 24 January 177625 June 1822) was a Prussian Romantic author of fantasy and Gothic horror, a jurist, composer, music critic, draftsman and caricaturist.Penrith Goff, \"E.T.A. Hoffmann\" in E. F. Bleiler, Supernatural Fiction Writers: Fantasy and Horror. New York: Scribner's, 1985. pp. 111–120. Mike Ashley, \"Hoffmann, E(rnst) T(heodor) A(madeus) \", in St. James Guide to Horror, Ghost, and Gothic Writers, ed. David Pringle. Detroit: St. James Press/Gale, 1998.  (pp. 668-69).\"Ludwig Tieck, Heinrich von Kleist, and E. T. A. Hoffmann also profoundly influenced the development of European Gothic horror in the nineteenth century....\" Heide Crawford, The Origins of the Literary Vampire. Lanham : Rowman & Littlefield, 2016.  (p. xiii). His stories form the basis of Jacques Offenbach's famous opera The Tales of Hoffmann, in which Hoffmann appears (heavily fictionalized) as the hero. He is also the author of the novella The Nutcracker and the Mouse King, on which Pyotr Ilyich Tchaikovsky's ballet The Nutcracker is based. The ballet Coppélia is based on two other stories that Hoffmann wrote, while Schumann's Kreisleriana is based on Hoffmann's character Johannes Kreisler.\n\nHoffmann's stories highly influenced 19th-century literature, and he is one of the major authors of the Romantic movement.\n\nLife\n\nYouth\n\nHoffmann's ancestors, both maternal and paternal, were jurists. His father, Christoph Ludwig Hoffmann (1736–97), was a barrister in Königsberg, Prussia (now Kaliningrad, Russia), as well as a poet and amateur musician who played the viola da gamba. In 1767 he married his cousin, Lovisa Albertina Doerffer (1748–96). Ernst Theodor Wilhelm, born on 24 January 1776, was the youngest of three children, of whom the second died in infancy.\n\nWhen his parents separated in 1778, the father went to Insterburg (now Chernyakhovsk) with his elder son, Johann Ludwig Hoffmann (1768–after 1822), while Ernst's mother stayed in Königsberg with her relatives: two aunts, Johanna Sophie Doerffer (1745–1803) and Charlotte Wilhelmine Doerffer (c. 1754–79) and their brother, Otto Wilhelm Doerffer (1741–1811), who were all unmarried. This trio raised the youngster.\n\nThe household, dominated by the uncle (whom Ernst nicknamed O Weh—\"Oh dear!\"—in a play on his initials), was pietistic and uncongenial. Hoffmann was to regret his estrangement from his father. Nevertheless, he remembered his aunts with great affection, especially the younger, Charlotte, whom he nicknamed Tante Füßchen (\"Aunt Littlefeet\"). Although she died when he was only three years old, he treasured her memory (e.g. see Kater Murr) and embroidered stories about her to such an extent that later biographers sometimes assumed her to be imaginary, until proof of her existence was found after World War II.Friedrich Schnapp. \"Hoffmanns Verwandte aus der Familie Doerffer in Königsberger Kirchenbüchern der Jahre 1740–1811.\" Mitteilungen der E. T. A. Hoffmann-Gesellschaft. 23 (1977), 1–11.\n\nBetween 1781 and 1792 he attended the Lutheran school or Burgschule, where he made good progress in classics. He was taught drawing by one Saemann, and counterpoint by a Polish organist named Podbileski, who was to be the prototype of Abraham Liscot in Kater Murr. Ernst showed great talent for piano-playing, and busied himself with writing and drawing. The provincial setting was not, however, conducive to technical progress, and despite his many-sided talents he remained rather ignorant of both classical forms and of the new artistic ideas that were developing in Germany. He had, however, read Schiller, Goethe, Swift, Sterne, Rousseau and Jean Paul, and wrote part of a novel titled Der Geheimnisvolle.\n\nAround 1787 he became friends with Theodor Gottlieb von Hippel the Younger (1775–1843), the son of a pastor, and nephew of Theodor Gottlieb von Hippel the Elder, the well-known writer friend of Immanuel Kant. During 1792, both attended some of Kant's lectures at the University of Königsberg. Their friendship, although often tested by an increasing social difference, was to be lifelong.\n\nIn 1794, Hoffmann became enamored of Dora Hatt, a married woman to whom he had given music lessons. She was ten years older, and gave birth to her sixth child in 1795. In February 1796, her family protested against his attentions and, with his hesitant consent, asked another of his uncles to arrange employment for him in Glogau (Głogów), Prussian Silesia.Rüdiger Safranski. E. T. A. Hoffmann: Das Leben eines skeptischen Phantasten. Carl Hanser, Munich, 1984. Gerhard R. Kaiser. E. T. A. Hoffmann. J. B. Metzlersche, Stuttgart, 1988. \n\nThe provinces\n\nFrom 1796 Hoffmann obtained employment as a clerk for his uncle, Johann Ludwig Doerffer, who lived in Glogau with his daughter Minna. After passing further examinations he visited Dresden, where he was amazed by the paintings in the gallery, particularly those of Correggio and Raphael. During the summer of 1798, his uncle was promoted to a court in Berlin, and the three of them moved there in August—Hoffmann's first residence in a large city. It was there that Hoffmann first attempted to promote himself as a composer, writing an operetta called Die Maske and sending a copy to Queen Luise of Prussia. The official reply advised to him to write to the director of the Royal Theatre, a man named Iffland. By the time the latter responded, Hoffmann had passed his third round of examinations and had already left for Posen (Poznań) in South Prussia in the company of his old friend Hippel, with a brief stop in Dresden to show him the gallery.\n\nFrom June 1800 to 1803 he worked in Prussian provinces in the area of Greater Poland and Masovia. This was the first time he had lived without supervision by members of his family, and he started to become \"what school principals, parsons, uncles, and aunts call dissolute.\"\n\nHis first job, at Posen, was endangered after Carnival on Shrove Tuesday 1802, when caricatures of military officers were distributed at a ball. It was immediately deduced who had drawn them, and complaints were made to authorities in Berlin, who were reluctant to punish the promising young official. The problem was solved by \"promoting\" Hoffmann to Płock in New East Prussia, the former capital of Poland (1079–1138), where administrative offices were relocated from Thorn (Toruń). He visited the place to arrange lodging, before returning to Posen where he married \"Mischa\" (Maria, or Marianna Tekla Michalina Rorer, whose Polish surname was Trzcińska). They moved to Płock in August 1802.\n\nHoffmann despaired because of his exile, and drew caricatures of himself drowning in mud alongside ragged villagers. He did make use, however, of his isolation, by writing and composing. He started a diary on 1 October 1803. An essay on the theatre was published in Kotzebue's periodical, Die Freimüthige, and he entered a competition in the same magazine to write a play. Hoffmann's was called Der Preis (\"The Prize\"), and was itself about a competition to write a play. There were fourteen entries, but none was judged worthy of the award: 100 Friedrichs d'or. Nevertheless, his entry was singled out for praise.Die Freimüthige, 11 February 1804. Volume II, no. 6, pages xxi–xxiv. This was one of the few good times of a sad period of his life, which saw the deaths of his uncle J. L. Hoffmann in Berlin, his Aunt Sophie, and Cora Hatt in Königsberg.\n\nAt the beginning of 1804 he obtained a post at Warsaw. On his way there, he passed through his hometown and met one of Cora Hatt's daughters. He was never to return to Königsberg.\n\nWarsaw\n\nHoffmann assimilated well with Polish society; the years spent in Prussian Poland he recognized as the happiest of his life. In Warsaw he found the same atmosphere he had enjoyed in Berlin, renewing his friendship with Zacharias Werner, and meeting his future biographer, a neighbour and fellow jurist called Julius Eduard Itzig (who changed his name to Hitzig after his baptism). Itzig had been a member of the Berlin literary group called the Nordstern, and he gave Hoffmann the works of Novalis, Ludwig Tieck, Achim von Arnim, Clemens Brentano, Gotthilf Heinrich von Schubert, Carlo Gozzi, and Calderon. These relatively late introductions marked his work profoundly.\n\nHe moved in the circles of August Wilhelm Schlegel, Adelbert von Chamisso, Friedrich de la Motte Fouqué, Rahel Levin, and David Ferdinand Koreff.\n\nHis fortunate position was not to last: on 28 November 1806, during the War of the Fourth Coalition, Napoleon Bonaparte's troops captured Warsaw, and the Prussian bureaucrats lost their jobs. They divided the contents of the treasury between them and fled. In January 1807 his wife and two-year-old daughter Cäcilia returned to Posen, while he pondered whether to move to Vienna or go back to Berlin. A delay of six months was caused by severe illness. Eventually the French authorities demanded that all former officials swear allegiance or leave the country. As they refused to grant him a passport to Vienna, he was forced to return to Berlin.\nHe visited his family in Posen before arriving in Berlin on 18 June 1807, hoping to further his career there as an artist and writer.\n\nBerlin and Bamberg\n\nThe next fifteen months were some of the worst in Hoffmann's life.\nThe city of Berlin was also occupied by Napoleon's troops. Obtaining only meagre allowances, he had frequent recourse to his friends, constantly borrowing money and still going hungry for days at a time; he learned that his daughter had died. Nevertheless, he managed to compose his Six Canticles for a cappella choir: one of his best compositions, which he would later attribute to Kreisler in Lebensansichten des Katers Murr.\n\nOn 1 September 1808 he arrived with his wife in Bamberg, where he began a job as theatre manager. The director, Count Soden, left almost immediately for Würzburg, leaving a man named Heinrich Cuno in charge. Hoffmann was unable to improve standards of performance, and his efforts caused intrigues against him which resulted in him losing his job to Cuno. He began work as music critic for the Allgemeine musikalische Zeitung, a newspaper in Leipzig, and his articles on Beethoven were especially well received, and highly regarded by the composer himself. It was in its pages that the \"Kapellmeister Johannes Kreisler\" character made his first appearance.\n\nHoffmann's breakthrough came in 1809, with the publication of Ritter Gluck, a story about a man who meets, or believes he has met, the composer Christoph Willibald Gluck (1714–87) more than twenty years after the latter's death. The theme alludes to the work of Jean Paul, who invented the term Doppelgänger the previous decade, and continued to exact a powerful influence over Hoffmann, becoming one of his earliest admirers. With this publication, Hoffmann began to use the pseudonym E. T. A. Hoffmann, telling people that the \"A\" stood for Amadeus, in homage to the composer Wolfgang Amadeus Mozart (1756–91). However, he continued to use Wilhelm in official documents throughout his life, and the initials E. T. W. also appear on his gravestone.\n\nThe next year, he was employed at the Bamberg Theatre as stagehand, decorator, and playwright, while also giving private music lessons.\nHe became so enamored of a young singing student, Julia Marc, that his feelings were obvious whenever they were together, and Julia's mother quickly found her a more suitable match. When Joseph Seconda offered Hoffmann a position as musical director for his opera company (then performing in Dresden), he accepted, leaving on 21 April 1813.\n\nDresden and Leipzig\n\nPrussia had declared war against France on 16 March during the War of the Sixth Coalition, and their journey was fraught with difficulties. They arrived on the 25th, only to find that Seconda was in Leipzig; on the 26th, they sent a letter pleading for temporary funds. That same day Hoffmann was surprised to meet Hippel, whom he had not seen for nine years.\n\nThe situation deteriorated, and in early May Hoffmann tried in vain to find transport to Leipzig. On 8 May, the bridges were destroyed, and his family were marooned in the city. During the day, Hoffmann would roam, watching the fighting with curiosity. Finally, on 20 May, they left for Leipzig, only to be involved in an accident which killed one of the passengers in their coach and injured his wife.\n\nThey arrived on 23 May, and Hoffmann started work with Seconda's orchestra, which he found to be of the best quality. On 4 June an armistice began, which allowed the company to return to Dresden. But on 22 August, after the end of the armistice, the family was forced to relocate from their pleasant house in the suburbs into the town, and during the next few days the Battle of Dresden raged. The city was bombarded; many people were killed by bombs directly in front of him. After the main battle was over, he visited the gory battlefield. His account can be found in Vision auf dem Schlachtfeld bei Dresden. After a long period of continued disturbance, the town surrendered on 11 November, and on 9 December the company travelled to Leipzig.\n\nOn 25 February Hoffmann quarrelled with Seconda, and the next day he was given notice of twelve weeks. When asked to accompany them on their journey to Dresden in April, he refused, and they left without him. But during July his friend Hippel visited, and soon he found himself being guided back into his old career as a jurist.\n\nBerlin\n\nAt the end of September 1814, in the wake of Napoleon's defeat, Hoffmann returned to Berlin and succeeded in regaining a job at the Kammergericht, the chamber court. His opera Undine was performed by the Berlin Theatre. Its successful run came to an end only after a fire on the night of the 25th performance. Magazines clamoured for his contributions, and after a while his standards started to decline. Nevertheless, many masterpieces date from this time.\n\nDuring the period from 1819 Hoffmann was involved with legal disputes, while fighting ill health. Alcohol abuse and syphilis eventually caused weakening of his limbs during 1821, and paralysis from the beginning of 1822. His last works were dictated to his wife or to a secretary.\n\nPrince Metternich's anti-liberal programs began to put Hoffmann in situations that tested his conscience. Thousands of people were accused of treason for having certain political opinions,\nand university professors were monitored during their lectures.\n\nKing Frederick William III of Prussia appointed an Immediate Commission for the investigation of political dissidence; when he found its observance of the rule of law too frustrating, he established a Ministerial Commission to interfere with its processes. The latter was greatly influenced by Commissioner Kamptz. During the trial of \"Turnvater\" Jahn, the founder of the gymnastics association movement, Hoffmann found himself annoying Kamptz, and became a political target. When Hoffmann caricatured Kamptz in a story (Meister Floh), Kamptz began legal proceedings. These ended when Hoffmann's illness was found to be life-threatening. The King asked for a reprimand only, but no action was ever taken. Eventually Meister Floh was published with the offending passages removed.\n\nHoffmann died of syphilis in Berlin on 25 June 1822 at the age of 46. His grave is preserved in the Protestant Friedhof III der Jerusalems- und Neuen Kirchengemeinde (Cemetery No. III of the congregations of Jerusalem Church and New Church) in Berlin-Kreuzberg, south of Hallesches Tor at the underground station Mehringdamm.\n\nWorks\n\nLiterary\n\n*Fantasiestücke in Callots Manier (collection of previously published stories, 1814)\"Fantasy pieces in the manner of Jacques Callot\"\n**\"Ritter Gluck\", \"Kreisleriana\", \"Don Juan\", \"Nachricht von den neuesten Schicksalen des Hundes Berganza\"\n**\"Der Magnetiseur\", \"Der goldne Topf\" (revised in 1819), \"Die Abenteuer der Silvesternacht\"\n*Die Elixiere des Teufels (1815)\n*Nachtstücke (1817)\n**\"Der Sandmann\", \"Das Gelübde\", \"Ignaz Denner\", \"Die Jesuiterkirche in G.\"\n**\"Das Majorat\", \"Das öde Haus\", \"Das Sanctus\", \"Das steinerne Herz\"\n*Seltsame Leiden eines Theater-Direktors (1819)\n*Klein Zaches, genannt Zinnober (1819)\n*Die Serapionsbrüder (1819)\n**\"Der Einsiedler Serapion\", \"Rat Krespel\", \"Die Fermate\", \"Der Dichter und der Komponist\"\n**\"Ein Fragment aus dem Leben dreier Freunde\", \"Der Artushof\", \"Die Bergwerke zu Falun\", \"Nußknacker und Mausekönig\" (1816)\n**\"[https://books.google.com/books?id=nYqdUy9SKd8C Der Kampf der Sänger]\", \"Eine Spukgeschichte\", \"Die Automate\", \"Doge und Dogaresse\"\n**\"Alte und neue Kirchenmusik\", \"Meister Martin der Küfner und seine Gesellen\", \"Das fremde Kind\"\n**\"Nachricht aus dem Leben eines bekannten Mannes\", \"Die Brautwahl\", \"Der unheimliche Gast\"\n**\"Das Fräulein von Scuderi\", \"Spielerglück\" (1819), \"Der Baron von B.\"\n**\"Signor Formica\", \"Zacharias Werner\", \"Erscheinungen\"\n**\"Der Zusammenhang der Dinge\", \"Vampirismus\", \"Die ästhetische Teegesellschaft\", \"Die Königsbraut\"\n*Prinzessin Brambilla (1820)\n*Lebensansichten des Katers Murr (1820)\n*\"Die Irrungen\" (1820)\n*\"Die Geheimnisse\" (1821)\n*\"Die Doppeltgänger\" (1821)\n*Meister Floh (1822)\n*\"Des Vetters Eckfenster\" (1822)\n*Letzte Erzählungen (1825)\n\nMusical\n\nVocal music\n\n*Messa d-moll (1805)\n*Trois Canzonettes à 2 et à 3 voix (1807)\n*6 Canzoni per 4 voci alla capella (1808)\n*Miserere b-moll (1809)\n*In des Irtisch weiße Fluten (Kotzebue), Lied (1811)\n*Recitativo ed Aria „Prendi l’acciar ti rendo\" (1812)\n*Tre Canzonette italiane (1812); 6 Duettini italiani (1812)\n*Nachtgesang, Türkische Musik, Jägerlied, Katzburschenlied für Männerchor (1819–21)\n\nWorks for stage\n\n*Die Maske (Libretto: E. T. A. Hoffmann), Singspiel (1799)\n*Die lustigen Musikanten (Libretto: Clemens Brentano), Singspiel (1804)\n*Bühnenmusik zu Zacharias Werners Trauerspiel „Das Kreuz an der Ostsee\" (1805)\n*Liebe und Eifersucht (Calderón and August Wilhelm Schlegel) (1807)\n*Arlequin, Ballettmusik (1808)\n*Der Trank der Unsterblichkeit (Libretto: Julius von Soden), romantische Oper (1808)\n*Wiedersehn! (Libretto: E. T. A. Hoffmann), Prolog (1809)\n*Dirna (Libretto: Julius von Soden), Melodram (1809)\n*Bühnenmusik zu Julius von Sodens Drama „Julius Sabinus\" (1810)\n*Saul, König von Israel (Libretto: Joseph von Seyfried), Melodram (1811)\n*Aurora (Libretto: Franz von Holbein) heroische Oper (1812)\n*Undine (Libretto: Friedrich de la Motte Fouqué), Zauberoper (1816)\n*Der Liebhaber nach dem Tode (beginning only)\n\nInstrumental\n\n*Rondo für Klavier (1794/95)\n*Ouvertura. Musica per la chiesa d-moll (1801)\n*Klaviersonaten: A-Dur, f-moll, F-Dur, f-moll, cis-moll (1805–1808)\n*Große Fantasie für Klavier (1806)\n*Sinfonie Es-Dur (1806)\n*Harfenquintett c-moll (1807)\n*Grand Trio E-Dur (1809)\n*Walzer zum Karolinentag (1812)\n*Teutschlands Triumph in der Schlacht bei Leipzig, (by \"Arnulph Vollweiler\", 1814; lost)\n*Serapions-Walzer (1818–1821)\n\nAssessment\n\nHoffmann is one of the best-known representatives of German Romanticism, and a pioneer of the fantasy genre, with a taste for the macabre combined with realism that influenced such authors as Edgar Allan Poe (1809–1849), Nikolai GogolKrys Svitlana, “[http://booksandjournals.brillonline.com/content/journals/10.1163/221023912x642709 Intertextual Parallels Between Gogol' and Hoffmann: A Case Study of Vij and The Devil’s Elixirs.]” Canadian-American Slavic Studies (CASS) 47.1 (2013): 1-20. (20 pages)Krys Svitlana, “Allusions to Hoffmann in Gogol’s Ukrainian Horror Stories from the Dikan'ka Collection.” Canadian Slavonic Papers: Special Issue, devoted to the 200th anniversary of Nikolai Gogol'’s birth (1809–1852) 51.2-3 (June–September 2009): 243-266. (23 pages)(1809–1852), Charles Dickens (1812–1870), Charles Baudelaire (1821–1867), George MacDonald (1824–1905),Greville MacDonald, George MacDonald and His Wife London: Allen and Unwin, 1924 (p. 297-8). Fyodor Dostoevsky (1821–1881), Vernon Lee (1856-1935),\"Another major influence for Lee is unmistakably E.T.A. Hoffmann's Der Sandmann...\"  Christa Zorn, Vernon Lee : aesthetics, history, and the Victorian female intellectual. Athens : Ohio University Press, 2003.  (p. 142). Franz Kafka (1883–1924) and Alfred Hitchcock  (1899–1980). Hoffmann's story Das Fräulein von Scuderi is sometimes cited as the first detective story and a direct influence on Poe's \"The Murders in the Rue Morgue\".The Seven Basic Plots, Christopher Booker, Continuum, 2004, page 507\n\nThe twentieth-century Russian literary theorist Mikhail Bakhtin characterised Hoffmann's works as Menippea, essentially satirical and self-parodying in form, thus including him in a tradition that includes Cervantes, Diderot and Voltaire.\n\nRobert Schumann's piano suite Kreisleriana (1838) has its title from one of Hoffmann's books (and according to Charles Rosen's The Romantic Generation, is possibly also inspired by \"The Life and Opinions of Tomcat Murr\", in which Kreisler appears). Jacques Offenbach's masterwork, the opera Les contes d'Hoffmann (\"The Tales of Hoffmann\", 1881), is based on the stories, principally Der Sandmann (\"The Sandman\", 1816), Rat Krespel (\"Councillor Krespel\", 1818), and Das verlorene Spiegelbild (\"The Lost Reflection\") from Die Abenteuer der Silvester-Nacht (\"The Adventures of New Year's Eve\", 1814). Klein Zaches genannt Zinnober (\"Little Zaches called Cinnabar\", 1819) inspired an aria, also the operetta (\"Le Roi Carotte\" , 1872). Pyotr Ilyich Tchaikovsky's ballet The Nutcracker (1892) is based on \"Nutcracker and Mouse King\", and the ballet Coppélia, with music by Delibes, is based on two eerie Hoffmann stories.\n\nHoffmann also influenced 19th-century musical opinion directly through his music criticism. His reviews of Beethoven's Symphony No. 5 in C minor, Op. 67 (1808) and other important works set new literary standards for writing about music, and encouraged later writers to consider music as \"the most Romantic of all the arts.\"See also Fausto Cercignani, E. T. A. Hoffmann, Italien und die romantische Auffassung der Musik, in S. M. Moraldo (ed.), Das Land der Sehnsucht. E. T. A. Hoffmann und Italien, Heidelberg, Winter, 2002, S. 191–201. Hoffmann's reviews were first collected for modern readers by Friedrich Schnapp, ed., in E.T.A. Hoffmann: Schriften zur Musik; Nachlese (1963)  and have been made available in an English translation in E.T.A. Hoffmann's Writings on Music, Collected in a Single Volume (2004).\n\nHoffmann strove for artistic polymathy. He created far more in his works than mere political commentary achieved through satire. His masterpiece novel Lebensansichten des Katers Murr (\"The Life and Opinions of Tomcat Murr\", 1819–1821) deals with such issues as the aesthetic status of true artistry and the modes of self-transcendence that accompany any genuine endeavour to create. Hoffmann's portrayal of the character Kreisler (a genius musician) is wittily counterpointed with the character of the tomcat Murr – a virtuoso illustration of artistic pretentiousness that many of Hoffmann's contemporaries found offensive and subversive of Romantic ideals.\n\nHoffmann's literature indicates the failings of many so-called artists to differentiate between the superficial and the authentic aspects of such Romantic ideals. The self-conscious effort to impress must, according to Hoffmann, be divorced from the self-aware effort to create. This essential duality in Kater Murr is conveyed structurally through a discursive 'splicing together' of two biographical narratives.\n\nScience fiction\n\nWhile disagreeing with E. F. Bleiler's claim that Hoffman was \"one of the two or three greatest writers of fantasy\", Algis Budrys of Galaxy Science Fiction said that he \"did lay down the groundwork for some of our most enduring themes\". Historian Martin Willis argues that Hoffmann's impact on science fiction has been overlooked, saying \"his work reveals a writer dynamically involved in the important scientific debates of the late eighteenth and early nineteenth centuries.\" Willis points out that Hoffmann's work is contemporary with Frankenstein (1818) and with \"the heated debates and the relationship between the new empirical science and the older forms of natural philosophy that held sway throughout the eighteenth century.\" His \"interest in the machine culture of his time is well represented in his short stories, of which the critically renowned The Sandman (1816) and Automata (1814) are the best examples. ...Hoffmann's work makes a considerable contribution to our understanding of the emergence of scientific knowledge in the early years of the nineteenth century and to the conflict between science and magic, centred mainly on the 'truths' available to the advocates of either practice. ...Hoffmann's balancing of mesmerism, mechanics, and magic reflects the difficulty in categorizing scientific knowledge in the early nineteenth century.\"\n\nIn popular culture\n\n*Robertson Davies invokes Hoffmann as a character (with the pet name of 'ETAH') trapped in Limbo, within his novel The Lyre of Orpheus (1988).\n*Angela Carter – The Infernal Desire Machines of Doctor Hoffman (1972)\n*Alexandre Dumas, père translated The Nutcracker into French, which aided in making the tale popular and widespread.\n*The exotic and supernatural elements in the storyline of Ingmar Bergman's 1982 film Fanny and Alexander derive largely from the stories of Hoffmann.\n*Andrei Tarkovsky wrote a script titled Hoffmaniana in which the writer himself is the main protagonist. Due to Tarkovsky's premature death, the film was never made. \n* Freud gives an extensive psychoanalytic analysis of Hoffmann's Sandman in his 1919 essay Das Unheimliche.\n* Coppelius is a German classical metal band, the name taken from Hoffmann's Sandman. The band's 2010 album, Zinnober, includes a track called \"Klein Zaches\".Review of Zinnober, http://www.ice-vajal.com/c/CD/coppelius.htm\n* The Russian show Kukly was closed by government officials after the episode where Vladimir Putin was portrayed as Hoffmann's Klein Zaches.\"New Cartoon Show Puts Putin Among Men\" http://www.ekaterinburg.com/news/print/news_id-316222.html\n* Malifaux, a tabletop skimish game appropriated both Hoffman and Coppelius from Der Sandman as characters that reference each other as having an \"Unexplained Connection\". E. T. A. Hoffmann. http://en.wikipedia.org/?curid=10151."
  }
}
