{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1332",
  "eid" : "b962d070-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778390775,
  "textBody" : "This day marks the approximate midpoint of summer in the Northern Hemisphere and of winter in the Southern Hemisphere (starting the season at the June solstice).\n\nEvents\n\n*322 BC – Battle of Crannon between Athens and Macedonia.\n* 461 – Roman Emperor Majorian is beheaded near the river Iria in north-west Italy following his arrest and deposition by the magister militum Ricimer.\n* 626 – The Avar and Slav armies leave the siege of Constantinople.\n* 768 - Stephen III begins his reign as Catholic Pope.\n* 936 – Coronation of King Otto I of Germany.\n*1420 – Construction of the dome of Santa Maria del Fiore begins in Florence.\n*1427 – The Visconti of Milan's fleet is destroyed by the Venetians on the Po River.\n*1461 – The Ming dynasty Chinese military general Cao Qin stages a coup against the Tianshun Emperor.\n* 1479 - Battle of Guinegate, French troops of King Louis XI were defeated by the Burgundians led by Archduke Maximilian of Habsburg. \n*1679 – The brigantine Le Griffon, commissioned by René-Robert Cavelier, Sieur de La Salle, is towed to the south-eastern end of the Niagara River, to become the first ship to sail the upper Great Lakes of North America.\n*1714 – The Battle of Gangut: The first important victory of the Russian Navy.\n*1782 – George Washington orders the creation of the Badge of Military Merit to honor soldiers wounded in battle. It is later renamed to the more poetic Purple Heart.\n*1789 – The United States Department of War is established.\n*1791 – American troops destroy the Miami town of Kenapacomaqua near the site of present-day Logansport, Indiana in the Northwest Indian War.\n*1794 – U.S. President George Washington invokes the Militia Acts of 1792 to suppress the Whiskey Rebellion in western Pennsylvania.\n*1819 – Simón Bolívar triumphs over Spain in the Battle of Boyacá.\n*1858 – The first Australian rules football match is played between Melbourne Grammar and Scotch College. \n*1879 – The opening of the Poor Man's Palace in Manchester, England.\n*1890 – Anna Månsdotter becomes the last woman in Sweden to be executed, for the 1889 Yngsjö murder.\n*1909 – Alice Huyler Ramsey and three friends become the first women to complete a transcontinental auto trip, taking 59 days to travel from New York, New York to San Francisco, California.\n*1927 – The Peace Bridge opens between Fort Erie, Ontario and Buffalo, New York.\n*1930 – The last confirmed lynching of blacks in the Northern United States occurs in Marion, Indiana; two men, Thomas Shipp and Abram Smith, are killed.\n*1933 – The Simele massacre: The Iraqi government slaughters over 3,000 Assyrians in the village of Simele. \n*1938 – The building of Mauthausen concentration camp begins.\n*1940 – World War II: Alsace-Lorraine is annexed by the Third Reich.\n*1942 – World War II: The Battle of Guadalcanal begins as the United States Marines initiate the first American offensive of the war with landings on Guadalcanal and Tulagi in the Solomon Islands.\n*1944 – IBM dedicates the first program-controlled calculator, the Automatic Sequence Controlled Calculator (known best as the Harvard Mark I).\n*1946 – The government of the Soviet Union presented a note to its Turkish counterparts which refuted the latter's sovereignty over the Turkish Straits, thus beginning the Turkish Straits crisis.\n*1947 – Thor Heyerdahl's balsa wood raft the Kon-Tiki, smashes into the reef at Raroia in the Tuamotu Islands after a 101-day,  journey across the Pacific Ocean in an attempt to prove that pre-historic peoples could have traveled from South America.\n*  1947   – The Bombay Municipal Corporation formally takes over the Bombay Electric Supply and Transport (BEST).\n*1955 – Tokyo Telecommunications Engineering, the precursor to Sony, sells its first transistor radios in Japan.\n*1959 – The Lincoln Memorial design on the U.S. penny goes into circulation. It replaces the \"sheaves of wheat\" design, and was minted until 2008.\n*  1959   – Explorer program: Explorer 6 launches from the Atlantic Missile Range in Cape Canaveral, Florida.\n*1960 – Ivory Coast becomes independent from France.\n*1962 – Canadian-born American pharmacologist Frances Oldham Kelsey awarded the U.S. President's Award for Distinguished Federal Civilian Service for her refusal to authorize thalidomide.\n*1964 – Vietnam War: The U.S. Congress passes the Gulf of Tonkin Resolution giving U.S. President Lyndon B. Johnson broad war powers to deal with North Vietnamese attacks on American forces.\n*1970 – California judge Harold Haley is taken hostage in his courtroom and killed during an effort to free George Jackson from police custody.\n*1974 – Philippe Petit performs a high wire act between the twin towers of the World Trade Center  in the air.\n*1976 – Viking program: Viking 2 enters orbit around Mars.\n*1978 – U.S. President Jimmy Carter declares a federal emergency at Love Canal due to toxic waste that had been disposed of negligently.\n*1981 – The Washington Star ceases all operations after 128 years of publication.\n*1985 – Takao Doi, Mamoru Mohri and Chiaki Mukai are chosen to be Japan's first astronauts.\n*1987 – Lynne Cox becomes first person to swim from the United States to the Soviet Union, crossing the Bering Strait from Little Diomede Island in Alaska to Big Diomede in the Soviet Union\n*1989 – U.S. Congressman Mickey Leland (D-TX) and 15 others die in a plane crash in Ethiopia.\n*1990 – First American soldiers arrive in Saudi Arabia as part of the Gulf War.\n*1998 – Bombings at  United States embassies in Dar es Salaam, Tanzania and Nairobi, Kenya kill approximately 212 people.\n*1999 – The Chechnya-based Islamic International Brigade invades neighboring Dagestan.\n*2008 – The start of the Russo-Georgian War over the territory of South Ossetia.\n\nBirths\n\n* 317 – Constantius II, Roman emperor (d. 361)\n*1282 – Elizabeth of Rhuddlan (d. 1316)\n*1533 – Alonso de Ercilla, Spanish soldier and poet (d. 1595)\n*1560 – Elizabeth Báthory, Hungarian aristocrat and serial killer (d. 1614)\n*1571 – Thomas Lupo, English viol player and composer (d. 1627)\n*1574 – Robert Dudley, English explorer and cartographer (d. 1649)\n*1598 – Georg Stiernhielm, Swedish poet and linguist (d. 1672)\n*1613 – William Frederick, Prince of Nassau-Dietz, Dutch stadtholder (d. 1664)\n*1702 – Muhammad Shah, Mughal emperor of India (d. 1748)\n*1726 – James Bowdoin, American banker and politician, 2nd Governor of Massachusetts (d. 1790)\n*1742 – Nathanael Greene, American general (d. 1786)\n*1751 – Wilhelmina of Prussia, Princess of Orange (d. 1820)\n*1779 – Louis de Freycinet, French navigator and explorer (d. 1842)\n*  1779   – Carl Ritter, German geographer and academic (d. 1859)\n*1844 – Auguste Michel-Lévy, French geologist and author (d. 1911)\n*1860 – Alan Leo, English astrologer and author (d. 1917)\n*1862 – Victoria of Baden (d. 1931)\n*1867 – Emil Nolde, Danish-German painter and illustrator (d. 1956)\n*1868 – Ladislaus Bortkiewicz, Russian-German economist and statistician (d. 1931)\n*1876 – Mata Hari, Dutch dancer and spy (d. 1917)\n*1879 – Johannes Kotze, South African cricketer (d. 1931)\n*1884 – Billie Burke, American actress and singer (d. 1970)\n*  1884   – Nikolai Triik, Estonian painter and illustrator (d. 1940) \n*1887 – Anna Elisabet Weirauch, German author and playwright (d. 1970)\n*1890 – Elizabeth Gurley Flynn, American author and activist (d. 1964)\n*1901 – Ann Harding, American actress and singer (d. 1981)\n*1903 – Louis Leakey, Kenyan-English palaeontologist and archaeologist (d. 1972)\n*1904 – Ralph Bunche, American political scientist, academic, and diplomat, Nobel Prize laureate (d. 1971)\n*1907 – Albert Kotin, Belarusian-American soldier and painter (d. 1980)\n*1910 – Freddie Slack, American pianist and bandleader (d. 1965)\n*1911 – István Bibó, Hungarian lawyer and politician (d. 1979)\n*  1911   – Nicholas Ray, American director and screenwriter (d. 1979)\n*1913 – George Van Eps, American guitarist (d. 1998)\n*1916 – Kermit Love,  American actor, puppeteer, and costume designer (d. 2008)\n*1918 – C. Buddingh', Dutch poet and translator (d. 1985)\n*  1918   – Gordon Zahn, American sociologist and author (d. 2007)\n*1921 – Manitas de Plata, French guitarist (d. 2014)\n*  1921   – Karel Husa, Czech-American composer and conductor (d. 2016)\n*1924 – Kenneth Kendall, Indian-English journalist and actor (d. 2012)\n*1925 – Felice Bryant, American songwriter (d. 2003)\n*1926 – Stan Freberg, American puppeteer, voice actor, and singer (d. 2015)\n*1927 – Rocky Bridges, American baseball player and coach (d. 2015)\n*  1927   – Edwin Edwards, American soldier, lawyer, and politician, 50th Governor of Louisiana\n*  1927   – Art Houtteman, American baseball player and journalist (d. 2003)\n*1928 – Betsy Byars, American author and academic\n*  1928   – Owen Luder, English architect, designed Tricorn Centre and Trinity Square\n*  1928   – James Randi, Canadian-American magician and author\n*1929 – Don Larsen, American baseball player\n*1930 – Togrul Narimanbekov, Azerbaijani-French painter and academic (d. 2013)\n*  1930   – Veljo Tormis, Estonian composer and educator\n*1931 – Jack Good, British television producer\n*  1931   – Charles E. Rice, American scholar and author (d. 2015)\n*1932 – Abebe Bikila, Ethiopian runner (d. 1973)\n*  1932   – Edward Hardwicke, English actor (d. 2011)\n*  1932   – Rien Poortvliet, Dutch painter and illustrator (d. 1995)\n*  1932   – Maurice Rabb, Jr., American ophthalmologist and academic (d. 2005)\n*1933 – Eddie Firmani, South African footballer and manager\n*  1933   – Elinor Ostrom, American economist and academic, Nobel Prize laureate (d. 2012)\n*  1933   – Jerry Pournelle, American journalist and author\n*1934 – Sándor Simó, Hungarian director, producer, and screenwriter (d. 2001)\n*1935 – Rahsaan Roland Kirk, American saxophonist and composer (d. 1977)\n*1937 – Zoltán Berczik, Hungarian table tennis player and coach (d. 2011)\n*  1937   – Don Wilson, English cricketer and coach (d. 2012)\n*1940 – Jean-Luc Dehaene, French-Belgian lawyer and politician, 63rd Prime Minister of Belgium (d. 2014)\n*1941 – Matthew Evans, Baron Evans of Temple Guiting, English publisher and politician\n*1942 – Garrison Keillor, American humorist, novelist, short story writer, and radio host\n*  1942   – Carlos Monzon, Argentinian boxer and actor (d. 1995)\n*  1942   – Richard Sykes, English biochemist and academic\n*  1942   – B. J. Thomas, American singer \n*1943 – Mohammed Badie, Egyptian religious leader\n*  1943   – Lana Cantrell, Australian singer-songwriter and lawyer\n*  1943   – Alain Corneau, French director and screenwriter (d. 2010)\n*1944 – John Glover, American actor \n*  1944   – Robert Mueller, American soldier and lawyer, 6th Director of the Federal Bureau of Investigation\n*1945 – Kenny Ireland, Scottish actor and director (d. 2014)\n*  1945   – Alan Page, American football player and jurist\n*1947 – Franciscus Henri, Dutch-Australian singer-songwriter\n*  1947   – Sofia Rotaru, Ukrainian singer-songwriter, producer, and actress\n*1948 – Marty Appel, American businessman and author\n*  1948   – Greg Chappell, Australian cricketer and coach\n*1949 – Walid Jumblatt, Lebanese journalist and politician\n*  1949   – Matthew Parris, South African-English journalist and politician\n*1950 – Rodney Crowell, American singer-songwriter and guitarist \n*  1950   – Alan Keyes, American politician and diplomat, 16th Assistant Secretary of State for International Organization Affairs\n*  1950   – S. Thandayuthapani, Sri Lankan educator and politician\n*1952 – Caroline Aaron, American actress and producer\n*  1952   – Eamonn Darcy, Irish golfer\n*  1952   – Kees Kist, Dutch footballer\n*  1952   – Alexei Sayle, English comedian, actor, and author\n*1953 – Anne Fadiman, American journalist and author\n*1954 – Valery Gazzaev, Russian footballer, manager and politician\n*  1954   – Jonathan Pollard, Israeli spy\n*  1954   – Alan Reid, Scottish politician\n*1955 – Wayne Knight, American actor, comedian and voice actor\n*  1955   – Greg Nickels, American lawyer and politician, 51st Mayor of Seattle\n*  1955   – Vladimir Sorokin, Russian author and playwright\n*1957 – Daire Brehan, Irish journalist, lawyer, and actress (d. 2012)\n*  1957   – Alexander Dityatin, Russian gymnast and colonel\n*1958 – Russell Baze, Canadian-American jockey\n*  1958   – Bruce Dickinson, English singer-songwriter and guitarist\n*  1958   – Alberto Salazar, Cuban-American runner and coach\n*1959 – Koenraad Elst, Belgian orientalist and author\n*  1959   – Ali Shah, Zimbabwean cricketer and coach\n*1960 – David Duchovny, American actor, director, producer, and screenwriter\n*1961 – Brian Conley, English actor and singer\n*  1961   – Yelena Davydova, Russian gymnast\n*  1961   – Walter Swinburn, English jockey and trainer\n*1962 – Alison Brown, American banjo player, songwriter, and producer \n*1963 – Paul Dunn, Australian rugby league player\n*  1963   – Nick Gillespie, American journalist and author\n*  1963   – Marcus Roberts, American pianist and educator\n*1964 – John Birmingham, English-Australian journalist and author\n*  1964   – Ian Dench, English guitarist and songwriter (EMF)\n*  1964   – Peter Niven, Scottish jockey\n*1965 – Raul Malo, American singer-songwriter, guitarist, and producer \n*  1965   – Elizabeth Manley, Canadian figure skater\n*1966 – David Cairns, Scottish laicised priest and politician, Minister of State for Scotland (d. 2011)\n*  1966   &ndahs; Shobna Gulati, British actress\n*  1966   – Kristin Hersh, American singer-songwriter and guitarist \n*  1966   – Jimmy Wales, American businessman, co-founder of Wikipedia\n*1967 – Jason Grimsley, American baseball player\n*1968 – Francesca Gregorini, Italian-American director and screenwriter\n*  1968   – Trevor Hendy, Australian surfer and coach\n*  1968   – Sophie Lee, Australian actress and author\n*1969 – Paul Lambert, Scottish footballer and manager\n*1970 – Eric Namesnik, American swimmer (d. 2006)\n*1971 – Dominic Cork, England cricketer and sportscaster\n*  1971   – Rachel York, American actress and singer\n*1972 – Gerry Peñalosa, Filipino boxer and promoter\n*1973 – Mikhail Gorsheniov, Russian singer-songwriter (d. 2013)\n*  1973   – Danny Graves, Vietnamese-American baseball player\n*  1973   – Kevin Muscat, English-Australian footballer, coach, and manager\n*1974 – Chico Benymon, American actor\n*  1974   – Michael Shannon, American actor\n*1975 – Koray Candemir, Turkish singer-songwriter\n*  1975   – Gerard Denton, Australian cricketer\n*  1975   – Megan Gale, Australian model and actress\n*  1975   – Ray Hill, American football player (d. 2015)\n*  1975   – Rebecca Kleefisch, American journalist and politician, 44th Lieutenant Governor of Wisconsin\n*  1975   – Édgar Rentería, Colombian baseball player\n*  1975   – Charlize Theron, South African-American actress and producer\n*1976 – Dimitrios Eleftheropoulos, Greek footballer and manager\n*  1976   – Shane Lechler, American football player\n*1977 – Charlotte Ronson, English fashion designer\n*  1977   – Samantha Ronson, English singer-songwriter and DJ\n*1977 – Justin Brooker, Rugby League Player\n*1978 – Alexandre Aja, French director, producer, and screenwriter\n*  1978   – Jamey Jasta, American singer-songwriter \n*  1978   – Mark McCammon, English-Barbadian footballer\n*  1978   – Cirroc Lofton, American actor\n*1979 – Eric Johnson, American actor, director, and screenwriter\n*  1979   – Miguel Llera, Spanish footballer\n*  1979   – Birgit Zotz, Austrian anthropologist and author\n*1980 – Carsten Busch, German footballer\n*  1980   – Aurélie Claudel, French model and actress\n*  1980   – Tácio Caetano Cruz Queiroz, Brazilian footballer\n*  1980   – Seiichiro Maki, Japanese footballer\n*1981 – David Testo, American soccer player\n*  1981   – Randy Wayne, American actor and producer\n*1982 – Ángeles Balbiani, Argentine actress and singer\n*  1982   – Abbie Cornish, Australian actress\n*  1982   – Juan Martín Hernández, Argentine rugby player\n*  1982   – Marquise Hill, American football player (d. 2007)\n*  1982   – Vassilis Spanoulis, Greek basketball player\n*  1982   – Martin Vučić, Macedonian singer and drummer\n*1983 – Christian Chávez, Mexican singer-songwriter and actor \n*  1983   – Murat Dalkılıç, Turkish singer-songwriter\n*  1983   – Danny, Portuguese footballer\n*  1983   – Andriy Hrivko, Ukrainian cyclist\n*  1983   – Mark Pettini, English cricketer and journalist\n*1984 – Stratos Perperoglou, Greek basketball player\n*  1984   – Tooba Siddiqui, Pakistani model and actress\n*  1984   – Yun Hyon-seok, South Korean poet and author (d. 2003) \n*1986 – Paul Biedermann, German swimmer\n*  1986   – Valter Birsa, Slovenian footballer\n*  1986   – Altaír Jarabo, Mexican model and actress\n*  1986   – Juan de la Rosa, Mexican boxer\n*1987 – Sidney Crosby, Canadian ice hockey player\n*  1987   – Mustapha Dumbuya, Sierra Leonean footballer\n*  1987   – Ryan Lavarnway, American baseball player\n*  1987   – Rouven Sattelmaier, German footballer\n*1988 – Jonathan Bernier, Canadian ice hockey player\n*  1988   – Mohamed Coulibaly, Senegalese footballer\n*  1988   – Anisa Mohammed, West Indian cricketer\n*  1988   – Melody Oliveria, American blogger\n*  1988   – Erik Pieters, Dutch footballer\n*  1988   – Beanie Wells, American football player\n*1989 – DeMar DeRozan, American basketball player\n*1990 – Helen Flanagan, English actress\n*  1990   – Josh Franceschi, English singer-songwriter\n*1991 – Luis Salom, Spanish motorcycle racer (d. 2016)\n*  1991   – Mitchell te Vrede, Dutch footballer\n*  1991   – Mike Trout, American baseball player\n*1992 – Adam Yates, English cyclist\n*  1992   – Simon Yates, English cyclist\n*  1992   – E. J. Tackett, American bowler\n*1993 – Martti Nõmme, Estonian ski jumper\n*  1993   – Zaur Sizo, Russian footballer\n*  1993   – Karol Zalewski, Polish sprinter\n\nDeaths\n\n* 461 – Majorian, Roman emperor (b. 420)\n* 707 – Li Chongjun, crown prince of the Tang Dynasty\n*1106 – Henry IV, Holy Roman Emperor (b. 1050)\n*1234 – Hugh Foliot, bishop of Hereford (b.c. 1155)\n*1272 – Richard Middleton, Lord Chancellor of England\n*1296 – Heinrich II von Rotteneck, prince-bishop of Regensburg\n*1385 – Joan of Kent, mother of King Richard II of England (b. 1328)\n*1485 – Alexander Stewart, Duke of Albany (b. 1454)\n*1547 – Saint Cajetan, Italian priest and saint (b. 1480)\n*1613 – Thomas Fleming, English judge and politician, Lord Chief Justice of England (b. 1544)\n*1616 – Vincenzo Scamozzi, Italian architect, designed Teatro Olimpico (b. 1548)\n*1632 – Robert de Vere, 19th Earl of Oxford, English soldier (b. 1575)\n*1635 – Friedrich Spee, German poet and academic (b. 1591)\n*1639 – Martin van den Hove, Dutch astronomer and mathematician (b. 1605)\n*1661 – Jin Shengtan, Chinese journalist and critic (b. 1608)\n*1787 – Francis Blackburne, English Anglican churchman and activist (b. 1705)\n*1817 – Pierre Samuel du Pont de Nemours, French economist and politician (b. 1739)\n*1834 – Joseph Marie Jacquard, French weaver and inventor, invented the Jacquard loom (b. 1752)\n*1848 – Jöns Jacob Berzelius, Swedish chemist and academic (b. 1779)\n*1855 – Mariano Arista, Mexican general and politician, 19th President of Mexico (b. 1802)\n*1864 – Li Xiucheng, Chinese field marshal (b. 1823)\n*1893 – Alfredo Catalani, Italian composer and academic (b. 1854)\n*1899 – Jacob Maris, Dutch painter and educator (b. 1837)\n*1900 – Wilhelm Liebknecht, German lawyer and politician (b. 1826)\n*1912 – François-Alphonse Forel, Swiss limnologist and academic (b. 1841)\n*1917 – Edwin Harris Dunning, South African-English commander and pilot (b. 1891)\n*1938 – Konstantin Stanislavski, Russian actor and director (b. 1863)\n*1941 – Rabindranath Tagore, Indian author, poet, and playwright, Nobel Prize laureate (b. 1861)\n*1948 – Charles Bryant, English-American actor and director (b. 1879)\n*1953 – Abner Powell, American baseball player and manager (b. 1860)\n*1957 – Oliver Hardy, American actor, singer, and director (b. 1892)\n*1958 – Elizabeth Foreman Lewis, American author and educator (b. 1892)\n*1960 – Luis Ángel Firpo, Argentine boxer (b. 1894)\n*1968 – Giovanni Bracco, Italian race car driver (b. 1908)\n*1969 – Jean Bastien, French professional footballer (b. 1915)\n*  1969   – Joseph Kosma, Hungarian-French composer (b. 1905)\n*1970 – Harold Haley, American lawyer and judge (b. 1904)\n*  1970   – Jonathan P. Jackson, American bodyguard (b. 1953)\n*1972 – Joi Lansing, American model, actress, and singer (b. 1929)\n*1973 – Jack Gregory, Australian cricketer (b. 1895)\n*1974 – Rosario Castellanos, Mexican poet and author (b. 1925)\n*  1974   – Sylvio Mantha, Canadian ice hockey player and coach (b. 1902)\n*1981 – Gunnar Uusi, Estonian chess player (b. 1931)\n*1985 – Grayson Hall, American actress (b. 1922)\n*1987 – Camille Chamoun, Lebanese lawyer and politician, 7th President of Lebanon (b. 1900)\n*1989 – Mickey Leland, American lawyer and politician (b. 1944)\n*1994 – Larry Martyn, English actor (b. 1934)\n*1995 – Brigid Brophy, English author and critic (b. 1929)\n*2001 – Algirdas Lauritėnas, Lithuanian basketball player (b. 1932)\n*2003 – K. D. Arulpragasam, Sri Lankan zoologist and academic (b. 1931)\n*  2003   – Mickey McDermott, American baseball player and coach (b. 1929)\n*2004 – Red Adair, American firefighter (b. 1915)\n*  2004   – Colin Bibby, English ornithologist and academic (b. 1948)\n*2005 – Peter Jennings, Canadian-American journalist and author (b. 1938)\n*2006 – Mary Anderson Bain, American lawyer and politician (b. 1911)\n*2007 – Ernesto Alonso, Mexican actor, director, and producer (b. 1917)\n*  2007   – Angus Tait, New Zealand businessman, founded Tait Communications (b. 1919)\n*2008 – Bernie Brillstein, American talent agent and producer (b. 1931)\n*  2008   – Andrea Pininfarina, Italian engineer and businessman (b. 1957)\n*2009 – Louis E. Saavedra, American educator and politician, 48th Mayor of Albuquerque (b. 1933)\n*  2009   – Mike Seeger, American singer-songwriter (b. 1933)\n*2010 – John Nelder, English mathematician and statistician (b. 1924)\n*2011 – Mark Hatfield, American soldier, academic, and politician, 29th Governor of Oregon (b. 1922)\n*  2011   – Nancy Wake, New Zealand-English captain and spy (b. 1912)\n*2012 – Murtuz Alasgarov, Azerbaijani academic and politician, Speaker of the National Assembly of Azerbaijan (b. 1928)\n*  2012   – Judith Crist, American critic and academic (b. 1922)\n*  2012   – Vladimir Kobzev, Russian footballer and coach (b. 1959)\n*  2012   – Anna Piaggi, Italian journalist and author (b. 1931)\n*  2012   – Mayer Zald, American sociologist and academic (b. 1931)\n*  2012   – Dušan Zbavitel, Czech indologist and author (b. 1925)\n*2013 – Samuel G. Armistead, American linguist, historian, and academic (b. 1927)\n*  2013   – Almir Kayumov, Russian footballer (b. 1964)\n*  2013   – Anthony Pawson, English-Canadian biologist, chemist, and academic (b. 1952)\n*  2013   – Margaret Pellegrini, American actress and dancer (b. 1923)\n*  2013   – Meeli Truu, Estonian architect (d. 1946)  \n*  2013   – Alexander Yagubkin, Russian boxer (b. 1961)\n*2014 – Víctor Fayad, Argentine lawyer and politician (b. 1955)\n*  2014   – Perry Moss, American football player and coach (b. 1926)\n*  2014   – Henry Stone, American record producer (b. 1921)\n*2015 – Manuel Contreras, Chilean general (b. 1929)\n*  2015   – Frances Oldham Kelsey, Canadian pharmacologist and physician (b. 1914)\n*  2015   – Louise Suggs, American golfer, co-founded LPGA (b. 1923)\n*2016 – Bryan Clauson, American racing driver (b. 1989)\n*2017 – Don Baylor, American baseball player (b. 1949)\n\nHolidays and observances\n\n* Assyrian Martyrs Day (Assyrian community)\n* Battle of Boyacá Day (Colombia)\n* Christian feast day:\n** Albert of Trapani\n** Cajetan of Thienna\n** Carpophorus and companions\n** Dometius of Persia\n** Donatus of Arezzo\n** Donatus of Besançon\n** Donatus of Muenstereifel\n** John Mason Neale and Catherine Winkworth (Episcopal Church (USA))\n** Nantovinus\n** Pope Sixtus II\n** August 7 (Eastern Orthodox liturgics)\n* Emancipation Day (Saint Kitts and Nevis)\n* Republic Day (Ivory Coast)\n* Youth Day (Kiribati)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 7" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1332" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "This day marks the approximate midpoint of summer in the Northern Hemisphere and of winter in the Southern Hemisphere (starting the season at the June solstice).\n\nEvents\n\n*322 BC – Battle of Crannon between Athens and Macedonia.\n* 461 – Roman Emperor Majorian is beheaded near the river Iria in north-west Italy following his arrest and deposition by the magister militum Ricimer.\n* 626 – The Avar and Slav armies leave the siege of Constantinople.\n* 768 - Stephen III begins his reign as Catholic Pope.\n* 936 – Coronation of King Otto I of Germany.\n*1420 – Construction of the dome of Santa Maria del Fiore begins in Florence.\n*1427 – The Visconti of Milan's fleet is destroyed by the Venetians on the Po River.\n*1461 – The Ming dynasty Chinese military general Cao Qin stages a coup against the Tianshun Emperor.\n* 1479 - Battle of Guinegate, French troops of King Louis XI were defeated by the Burgundians led by Archduke Maximilian of Habsburg. \n*1679 – The brigantine Le Griffon, commissioned by René-Robert Cavelier, Sieur de La Salle, is towed to the south-eastern end of the Niagara River, to become the first ship to sail the upper Great Lakes of North America.\n*1714 – The Battle of Gangut: The first important victory of the Russian Navy.\n*1782 – George Washington orders the creation of the Badge of Military Merit to honor soldiers wounded in battle. It is later renamed to the more poetic Purple Heart.\n*1789 – The United States Department of War is established.\n*1791 – American troops destroy the Miami town of Kenapacomaqua near the site of present-day Logansport, Indiana in the Northwest Indian War.\n*1794 – U.S. President George Washington invokes the Militia Acts of 1792 to suppress the Whiskey Rebellion in western Pennsylvania.\n*1819 – Simón Bolívar triumphs over Spain in the Battle of Boyacá.\n*1858 – The first Australian rules football match is played between Melbourne Grammar and Scotch College. \n*1879 – The opening of the Poor Man's Palace in Manchester, England.\n*1890 – Anna Månsdotter becomes the last woman in Sweden to be executed, for the 1889 Yngsjö murder.\n*1909 – Alice Huyler Ramsey and three friends become the first women to complete a transcontinental auto trip, taking 59 days to travel from New York, New York to San Francisco, California.\n*1927 – The Peace Bridge opens between Fort Erie, Ontario and Buffalo, New York.\n*1930 – The last confirmed lynching of blacks in the Northern United States occurs in Marion, Indiana; two men, Thomas Shipp and Abram Smith, are killed.\n*1933 – The Simele massacre: The Iraqi government slaughters over 3,000 Assyrians in the village of Simele. \n*1938 – The building of Mauthausen concentration camp begins.\n*1940 – World War II: Alsace-Lorraine is annexed by the Third Reich.\n*1942 – World War II: The Battle of Guadalcanal begins as the United States Marines initiate the first American offensive of the war with landings on Guadalcanal and Tulagi in the Solomon Islands.\n*1944 – IBM dedicates the first program-controlled calculator, the Automatic Sequence Controlled Calculator (known best as the Harvard Mark I).\n*1946 – The government of the Soviet Union presented a note to its Turkish counterparts which refuted the latter's sovereignty over the Turkish Straits, thus beginning the Turkish Straits crisis.\n*1947 – Thor Heyerdahl's balsa wood raft the Kon-Tiki, smashes into the reef at Raroia in the Tuamotu Islands after a 101-day,  journey across the Pacific Ocean in an attempt to prove that pre-historic peoples could have traveled from South America.\n*  1947   – The Bombay Municipal Corporation formally takes over the Bombay Electric Supply and Transport (BEST).\n*1955 – Tokyo Telecommunications Engineering, the precursor to Sony, sells its first transistor radios in Japan.\n*1959 – The Lincoln Memorial design on the U.S. penny goes into circulation. It replaces the \"sheaves of wheat\" design, and was minted until 2008.\n*  1959   – Explorer program: Explorer 6 launches from the Atlantic Missile Range in Cape Canaveral, Florida.\n*1960 – Ivory Coast becomes independent from France.\n*1962 – Canadian-born American pharmacologist Frances Oldham Kelsey awarded the U.S. President's Award for Distinguished Federal Civilian Service for her refusal to authorize thalidomide.\n*1964 – Vietnam War: The U.S. Congress passes the Gulf of Tonkin Resolution giving U.S. President Lyndon B. Johnson broad war powers to deal with North Vietnamese attacks on American forces.\n*1970 – California judge Harold Haley is taken hostage in his courtroom and killed during an effort to free George Jackson from police custody.\n*1974 – Philippe Petit performs a high wire act between the twin towers of the World Trade Center  in the air.\n*1976 – Viking program: Viking 2 enters orbit around Mars.\n*1978 – U.S. President Jimmy Carter declares a federal emergency at Love Canal due to toxic waste that had been disposed of negligently.\n*1981 – The Washington Star ceases all operations after 128 years of publication.\n*1985 – Takao Doi, Mamoru Mohri and Chiaki Mukai are chosen to be Japan's first astronauts.\n*1987 – Lynne Cox becomes first person to swim from the United States to the Soviet Union, crossing the Bering Strait from Little Diomede Island in Alaska to Big Diomede in the Soviet Union\n*1989 – U.S. Congressman Mickey Leland (D-TX) and 15 others die in a plane crash in Ethiopia.\n*1990 – First American soldiers arrive in Saudi Arabia as part of the Gulf War.\n*1998 – Bombings at  United States embassies in Dar es Salaam, Tanzania and Nairobi, Kenya kill approximately 212 people.\n*1999 – The Chechnya-based Islamic International Brigade invades neighboring Dagestan.\n*2008 – The start of the Russo-Georgian War over the territory of South Ossetia.\n\nBirths\n\n* 317 – Constantius II, Roman emperor (d. 361)\n*1282 – Elizabeth of Rhuddlan (d. 1316)\n*1533 – Alonso de Ercilla, Spanish soldier and poet (d. 1595)\n*1560 – Elizabeth Báthory, Hungarian aristocrat and serial killer (d. 1614)\n*1571 – Thomas Lupo, English viol player and composer (d. 1627)\n*1574 – Robert Dudley, English explorer and cartographer (d. 1649)\n*1598 – Georg Stiernhielm, Swedish poet and linguist (d. 1672)\n*1613 – William Frederick, Prince of Nassau-Dietz, Dutch stadtholder (d. 1664)\n*1702 – Muhammad Shah, Mughal emperor of India (d. 1748)\n*1726 – James Bowdoin, American banker and politician, 2nd Governor of Massachusetts (d. 1790)\n*1742 – Nathanael Greene, American general (d. 1786)\n*1751 – Wilhelmina of Prussia, Princess of Orange (d. 1820)\n*1779 – Louis de Freycinet, French navigator and explorer (d. 1842)\n*  1779   – Carl Ritter, German geographer and academic (d. 1859)\n*1844 – Auguste Michel-Lévy, French geologist and author (d. 1911)\n*1860 – Alan Leo, English astrologer and author (d. 1917)\n*1862 – Victoria of Baden (d. 1931)\n*1867 – Emil Nolde, Danish-German painter and illustrator (d. 1956)\n*1868 – Ladislaus Bortkiewicz, Russian-German economist and statistician (d. 1931)\n*1876 – Mata Hari, Dutch dancer and spy (d. 1917)\n*1879 – Johannes Kotze, South African cricketer (d. 1931)\n*1884 – Billie Burke, American actress and singer (d. 1970)\n*  1884   – Nikolai Triik, Estonian painter and illustrator (d. 1940) \n*1887 – Anna Elisabet Weirauch, German author and playwright (d. 1970)\n*1890 – Elizabeth Gurley Flynn, American author and activist (d. 1964)\n*1901 – Ann Harding, American actress and singer (d. 1981)\n*1903 – Louis Leakey, Kenyan-English palaeontologist and archaeologist (d. 1972)\n*1904 – Ralph Bunche, American political scientist, academic, and diplomat, Nobel Prize laureate (d. 1971)\n*1907 – Albert Kotin, Belarusian-American soldier and painter (d. 1980)\n*1910 – Freddie Slack, American pianist and bandleader (d. 1965)\n*1911 – István Bibó, Hungarian lawyer and politician (d. 1979)\n*  1911   – Nicholas Ray, American director and screenwriter (d. 1979)\n*1913 – George Van Eps, American guitarist (d. 1998)\n*1916 – Kermit Love,  American actor, puppeteer, and costume designer (d. 2008)\n*1918 – C. Buddingh', Dutch poet and translator (d. 1985)\n*  1918   – Gordon Zahn, American sociologist and author (d. 2007)\n*1921 – Manitas de Plata, French guitarist (d. 2014)\n*  1921   – Karel Husa, Czech-American composer and conductor (d. 2016)\n*1924 – Kenneth Kendall, Indian-English journalist and actor (d. 2012)\n*1925 – Felice Bryant, American songwriter (d. 2003)\n*1926 – Stan Freberg, American puppeteer, voice actor, and singer (d. 2015)\n*1927 – Rocky Bridges, American baseball player and coach (d. 2015)\n*  1927   – Edwin Edwards, American soldier, lawyer, and politician, 50th Governor of Louisiana\n*  1927   – Art Houtteman, American baseball player and journalist (d. 2003)\n*1928 – Betsy Byars, American author and academic\n*  1928   – Owen Luder, English architect, designed Tricorn Centre and Trinity Square\n*  1928   – James Randi, Canadian-American magician and author\n*1929 – Don Larsen, American baseball player\n*1930 – Togrul Narimanbekov, Azerbaijani-French painter and academic (d. 2013)\n*  1930   – Veljo Tormis, Estonian composer and educator\n*1931 – Jack Good, British television producer\n*  1931   – Charles E. Rice, American scholar and author (d. 2015)\n*1932 – Abebe Bikila, Ethiopian runner (d. 1973)\n*  1932   – Edward Hardwicke, English actor (d. 2011)\n*  1932   – Rien Poortvliet, Dutch painter and illustrator (d. 1995)\n*  1932   – Maurice Rabb, Jr., American ophthalmologist and academic (d. 2005)\n*1933 – Eddie Firmani, South African footballer and manager\n*  1933   – Elinor Ostrom, American economist and academic, Nobel Prize laureate (d. 2012)\n*  1933   – Jerry Pournelle, American journalist and author\n*1934 – Sándor Simó, Hungarian director, producer, and screenwriter (d. 2001)\n*1935 – Rahsaan Roland Kirk, American saxophonist and composer (d. 1977)\n*1937 – Zoltán Berczik, Hungarian table tennis player and coach (d. 2011)\n*  1937   – Don Wilson, English cricketer and coach (d. 2012)\n*1940 – Jean-Luc Dehaene, French-Belgian lawyer and politician, 63rd Prime Minister of Belgium (d. 2014)\n*1941 – Matthew Evans, Baron Evans of Temple Guiting, English publisher and politician\n*1942 – Garrison Keillor, American humorist, novelist, short story writer, and radio host\n*  1942   – Carlos Monzon, Argentinian boxer and actor (d. 1995)\n*  1942   – Richard Sykes, English biochemist and academic\n*  1942   – B. J. Thomas, American singer \n*1943 – Mohammed Badie, Egyptian religious leader\n*  1943   – Lana Cantrell, Australian singer-songwriter and lawyer\n*  1943   – Alain Corneau, French director and screenwriter (d. 2010)\n*1944 – John Glover, American actor \n*  1944   – Robert Mueller, American soldier and lawyer, 6th Director of the Federal Bureau of Investigation\n*1945 – Kenny Ireland, Scottish actor and director (d. 2014)\n*  1945   – Alan Page, American football player and jurist\n*1947 – Franciscus Henri, Dutch-Australian singer-songwriter\n*  1947   – Sofia Rotaru, Ukrainian singer-songwriter, producer, and actress\n*1948 – Marty Appel, American businessman and author\n*  1948   – Greg Chappell, Australian cricketer and coach\n*1949 – Walid Jumblatt, Lebanese journalist and politician\n*  1949   – Matthew Parris, South African-English journalist and politician\n*1950 – Rodney Crowell, American singer-songwriter and guitarist \n*  1950   – Alan Keyes, American politician and diplomat, 16th Assistant Secretary of State for International Organization Affairs\n*  1950   – S. Thandayuthapani, Sri Lankan educator and politician\n*1952 – Caroline Aaron, American actress and producer\n*  1952   – Eamonn Darcy, Irish golfer\n*  1952   – Kees Kist, Dutch footballer\n*  1952   – Alexei Sayle, English comedian, actor, and author\n*1953 – Anne Fadiman, American journalist and author\n*1954 – Valery Gazzaev, Russian footballer, manager and politician\n*  1954   – Jonathan Pollard, Israeli spy\n*  1954   – Alan Reid, Scottish politician\n*1955 – Wayne Knight, American actor, comedian and voice actor\n*  1955   – Greg Nickels, American lawyer and politician, 51st Mayor of Seattle\n*  1955   – Vladimir Sorokin, Russian author and playwright\n*1957 – Daire Brehan, Irish journalist, lawyer, and actress (d. 2012)\n*  1957   – Alexander Dityatin, Russian gymnast and colonel\n*1958 – Russell Baze, Canadian-American jockey\n*  1958   – Bruce Dickinson, English singer-songwriter and guitarist\n*  1958   – Alberto Salazar, Cuban-American runner and coach\n*1959 – Koenraad Elst, Belgian orientalist and author\n*  1959   – Ali Shah, Zimbabwean cricketer and coach\n*1960 – David Duchovny, American actor, director, producer, and screenwriter\n*1961 – Brian Conley, English actor and singer\n*  1961   – Yelena Davydova, Russian gymnast\n*  1961   – Walter Swinburn, English jockey and trainer\n*1962 – Alison Brown, American banjo player, songwriter, and producer \n*1963 – Paul Dunn, Australian rugby league player\n*  1963   – Nick Gillespie, American journalist and author\n*  1963   – Marcus Roberts, American pianist and educator\n*1964 – John Birmingham, English-Australian journalist and author\n*  1964   – Ian Dench, English guitarist and songwriter (EMF)\n*  1964   – Peter Niven, Scottish jockey\n*1965 – Raul Malo, American singer-songwriter, guitarist, and producer \n*  1965   – Elizabeth Manley, Canadian figure skater\n*1966 – David Cairns, Scottish laicised priest and politician, Minister of State for Scotland (d. 2011)\n*  1966   &ndahs; Shobna Gulati, British actress\n*  1966   – Kristin Hersh, American singer-songwriter and guitarist \n*  1966   – Jimmy Wales, American businessman, co-founder of Wikipedia\n*1967 – Jason Grimsley, American baseball player\n*1968 – Francesca Gregorini, Italian-American director and screenwriter\n*  1968   – Trevor Hendy, Australian surfer and coach\n*  1968   – Sophie Lee, Australian actress and author\n*1969 – Paul Lambert, Scottish footballer and manager\n*1970 – Eric Namesnik, American swimmer (d. 2006)\n*1971 – Dominic Cork, England cricketer and sportscaster\n*  1971   – Rachel York, American actress and singer\n*1972 – Gerry Peñalosa, Filipino boxer and promoter\n*1973 – Mikhail Gorsheniov, Russian singer-songwriter (d. 2013)\n*  1973   – Danny Graves, Vietnamese-American baseball player\n*  1973   – Kevin Muscat, English-Australian footballer, coach, and manager\n*1974 – Chico Benymon, American actor\n*  1974   – Michael Shannon, American actor\n*1975 – Koray Candemir, Turkish singer-songwriter\n*  1975   – Gerard Denton, Australian cricketer\n*  1975   – Megan Gale, Australian model and actress\n*  1975   – Ray Hill, American football player (d. 2015)\n*  1975   – Rebecca Kleefisch, American journalist and politician, 44th Lieutenant Governor of Wisconsin\n*  1975   – Édgar Rentería, Colombian baseball player\n*  1975   – Charlize Theron, South African-American actress and producer\n*1976 – Dimitrios Eleftheropoulos, Greek footballer and manager\n*  1976   – Shane Lechler, American football player\n*1977 – Charlotte Ronson, English fashion designer\n*  1977   – Samantha Ronson, English singer-songwriter and DJ\n*1977 – Justin Brooker, Rugby League Player\n*1978 – Alexandre Aja, French director, producer, and screenwriter\n*  1978   – Jamey Jasta, American singer-songwriter \n*  1978   – Mark McCammon, English-Barbadian footballer\n*  1978   – Cirroc Lofton, American actor\n*1979 – Eric Johnson, American actor, director, and screenwriter\n*  1979   – Miguel Llera, Spanish footballer\n*  1979   – Birgit Zotz, Austrian anthropologist and author\n*1980 – Carsten Busch, German footballer\n*  1980   – Aurélie Claudel, French model and actress\n*  1980   – Tácio Caetano Cruz Queiroz, Brazilian footballer\n*  1980   – Seiichiro Maki, Japanese footballer\n*1981 – David Testo, American soccer player\n*  1981   – Randy Wayne, American actor and producer\n*1982 – Ángeles Balbiani, Argentine actress and singer\n*  1982   – Abbie Cornish, Australian actress\n*  1982   – Juan Martín Hernández, Argentine rugby player\n*  1982   – Marquise Hill, American football player (d. 2007)\n*  1982   – Vassilis Spanoulis, Greek basketball player\n*  1982   – Martin Vučić, Macedonian singer and drummer\n*1983 – Christian Chávez, Mexican singer-songwriter and actor \n*  1983   – Murat Dalkılıç, Turkish singer-songwriter\n*  1983   – Danny, Portuguese footballer\n*  1983   – Andriy Hrivko, Ukrainian cyclist\n*  1983   – Mark Pettini, English cricketer and journalist\n*1984 – Stratos Perperoglou, Greek basketball player\n*  1984   – Tooba Siddiqui, Pakistani model and actress\n*  1984   – Yun Hyon-seok, South Korean poet and author (d. 2003) \n*1986 – Paul Biedermann, German swimmer\n*  1986   – Valter Birsa, Slovenian footballer\n*  1986   – Altaír Jarabo, Mexican model and actress\n*  1986   – Juan de la Rosa, Mexican boxer\n*1987 – Sidney Crosby, Canadian ice hockey player\n*  1987   – Mustapha Dumbuya, Sierra Leonean footballer\n*  1987   – Ryan Lavarnway, American baseball player\n*  1987   – Rouven Sattelmaier, German footballer\n*1988 – Jonathan Bernier, Canadian ice hockey player\n*  1988   – Mohamed Coulibaly, Senegalese footballer\n*  1988   – Anisa Mohammed, West Indian cricketer\n*  1988   – Melody Oliveria, American blogger\n*  1988   – Erik Pieters, Dutch footballer\n*  1988   – Beanie Wells, American football player\n*1989 – DeMar DeRozan, American basketball player\n*1990 – Helen Flanagan, English actress\n*  1990   – Josh Franceschi, English singer-songwriter\n*1991 – Luis Salom, Spanish motorcycle racer (d. 2016)\n*  1991   – Mitchell te Vrede, Dutch footballer\n*  1991   – Mike Trout, American baseball player\n*1992 – Adam Yates, English cyclist\n*  1992   – Simon Yates, English cyclist\n*  1992   – E. J. Tackett, American bowler\n*1993 – Martti Nõmme, Estonian ski jumper\n*  1993   – Zaur Sizo, Russian footballer\n*  1993   – Karol Zalewski, Polish sprinter\n\nDeaths\n\n* 461 – Majorian, Roman emperor (b. 420)\n* 707 – Li Chongjun, crown prince of the Tang Dynasty\n*1106 – Henry IV, Holy Roman Emperor (b. 1050)\n*1234 – Hugh Foliot, bishop of Hereford (b.c. 1155)\n*1272 – Richard Middleton, Lord Chancellor of England\n*1296 – Heinrich II von Rotteneck, prince-bishop of Regensburg\n*1385 – Joan of Kent, mother of King Richard II of England (b. 1328)\n*1485 – Alexander Stewart, Duke of Albany (b. 1454)\n*1547 – Saint Cajetan, Italian priest and saint (b. 1480)\n*1613 – Thomas Fleming, English judge and politician, Lord Chief Justice of England (b. 1544)\n*1616 – Vincenzo Scamozzi, Italian architect, designed Teatro Olimpico (b. 1548)\n*1632 – Robert de Vere, 19th Earl of Oxford, English soldier (b. 1575)\n*1635 – Friedrich Spee, German poet and academic (b. 1591)\n*1639 – Martin van den Hove, Dutch astronomer and mathematician (b. 1605)\n*1661 – Jin Shengtan, Chinese journalist and critic (b. 1608)\n*1787 – Francis Blackburne, English Anglican churchman and activist (b. 1705)\n*1817 – Pierre Samuel du Pont de Nemours, French economist and politician (b. 1739)\n*1834 – Joseph Marie Jacquard, French weaver and inventor, invented the Jacquard loom (b. 1752)\n*1848 – Jöns Jacob Berzelius, Swedish chemist and academic (b. 1779)\n*1855 – Mariano Arista, Mexican general and politician, 19th President of Mexico (b. 1802)\n*1864 – Li Xiucheng, Chinese field marshal (b. 1823)\n*1893 – Alfredo Catalani, Italian composer and academic (b. 1854)\n*1899 – Jacob Maris, Dutch painter and educator (b. 1837)\n*1900 – Wilhelm Liebknecht, German lawyer and politician (b. 1826)\n*1912 – François-Alphonse Forel, Swiss limnologist and academic (b. 1841)\n*1917 – Edwin Harris Dunning, South African-English commander and pilot (b. 1891)\n*1938 – Konstantin Stanislavski, Russian actor and director (b. 1863)\n*1941 – Rabindranath Tagore, Indian author, poet, and playwright, Nobel Prize laureate (b. 1861)\n*1948 – Charles Bryant, English-American actor and director (b. 1879)\n*1953 – Abner Powell, American baseball player and manager (b. 1860)\n*1957 – Oliver Hardy, American actor, singer, and director (b. 1892)\n*1958 – Elizabeth Foreman Lewis, American author and educator (b. 1892)\n*1960 – Luis Ángel Firpo, Argentine boxer (b. 1894)\n*1968 – Giovanni Bracco, Italian race car driver (b. 1908)\n*1969 – Jean Bastien, French professional footballer (b. 1915)\n*  1969   – Joseph Kosma, Hungarian-French composer (b. 1905)\n*1970 – Harold Haley, American lawyer and judge (b. 1904)\n*  1970   – Jonathan P. Jackson, American bodyguard (b. 1953)\n*1972 – Joi Lansing, American model, actress, and singer (b. 1929)\n*1973 – Jack Gregory, Australian cricketer (b. 1895)\n*1974 – Rosario Castellanos, Mexican poet and author (b. 1925)\n*  1974   – Sylvio Mantha, Canadian ice hockey player and coach (b. 1902)\n*1981 – Gunnar Uusi, Estonian chess player (b. 1931)\n*1985 – Grayson Hall, American actress (b. 1922)\n*1987 – Camille Chamoun, Lebanese lawyer and politician, 7th President of Lebanon (b. 1900)\n*1989 – Mickey Leland, American lawyer and politician (b. 1944)\n*1994 – Larry Martyn, English actor (b. 1934)\n*1995 – Brigid Brophy, English author and critic (b. 1929)\n*2001 – Algirdas Lauritėnas, Lithuanian basketball player (b. 1932)\n*2003 – K. D. Arulpragasam, Sri Lankan zoologist and academic (b. 1931)\n*  2003   – Mickey McDermott, American baseball player and coach (b. 1929)\n*2004 – Red Adair, American firefighter (b. 1915)\n*  2004   – Colin Bibby, English ornithologist and academic (b. 1948)\n*2005 – Peter Jennings, Canadian-American journalist and author (b. 1938)\n*2006 – Mary Anderson Bain, American lawyer and politician (b. 1911)\n*2007 – Ernesto Alonso, Mexican actor, director, and producer (b. 1917)\n*  2007   – Angus Tait, New Zealand businessman, founded Tait Communications (b. 1919)\n*2008 – Bernie Brillstein, American talent agent and producer (b. 1931)\n*  2008   – Andrea Pininfarina, Italian engineer and businessman (b. 1957)\n*2009 – Louis E. Saavedra, American educator and politician, 48th Mayor of Albuquerque (b. 1933)\n*  2009   – Mike Seeger, American singer-songwriter (b. 1933)\n*2010 – John Nelder, English mathematician and statistician (b. 1924)\n*2011 – Mark Hatfield, American soldier, academic, and politician, 29th Governor of Oregon (b. 1922)\n*  2011   – Nancy Wake, New Zealand-English captain and spy (b. 1912)\n*2012 – Murtuz Alasgarov, Azerbaijani academic and politician, Speaker of the National Assembly of Azerbaijan (b. 1928)\n*  2012   – Judith Crist, American critic and academic (b. 1922)\n*  2012   – Vladimir Kobzev, Russian footballer and coach (b. 1959)\n*  2012   – Anna Piaggi, Italian journalist and author (b. 1931)\n*  2012   – Mayer Zald, American sociologist and academic (b. 1931)\n*  2012   – Dušan Zbavitel, Czech indologist and author (b. 1925)\n*2013 – Samuel G. Armistead, American linguist, historian, and academic (b. 1927)\n*  2013   – Almir Kayumov, Russian footballer (b. 1964)\n*  2013   – Anthony Pawson, English-Canadian biologist, chemist, and academic (b. 1952)\n*  2013   – Margaret Pellegrini, American actress and dancer (b. 1923)\n*  2013   – Meeli Truu, Estonian architect (d. 1946)  \n*  2013   – Alexander Yagubkin, Russian boxer (b. 1961)\n*2014 – Víctor Fayad, Argentine lawyer and politician (b. 1955)\n*  2014   – Perry Moss, American football player and coach (b. 1926)\n*  2014   – Henry Stone, American record producer (b. 1921)\n*2015 – Manuel Contreras, Chilean general (b. 1929)\n*  2015   – Frances Oldham Kelsey, Canadian pharmacologist and physician (b. 1914)\n*  2015   – Louise Suggs, American golfer, co-founded LPGA (b. 1923)\n*2016 – Bryan Clauson, American racing driver (b. 1989)\n*2017 – Don Baylor, American baseball player (b. 1949)\n\nHolidays and observances\n\n* Assyrian Martyrs Day (Assyrian community)\n* Battle of Boyacá Day (Colombia)\n* Christian feast day:\n** Albert of Trapani\n** Cajetan of Thienna\n** Carpophorus and companions\n** Dometius of Persia\n** Donatus of Arezzo\n** Donatus of Besançon\n** Donatus of Muenstereifel\n** John Mason Neale and Catherine Winkworth (Episcopal Church (USA))\n** Nantovinus\n** Pope Sixtus II\n** August 7 (Eastern Orthodox liturgics)\n* Emancipation Day (Saint Kitts and Nevis)\n* Republic Day (Ivory Coast)\n* Youth Day (Kiribati). August 7. http://en.wikipedia.org/?curid=1332."
  }
}
