{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2369",
  "eid" : "bfb6aff0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778401391,
  "textBody" : "Aston Martin Lagonda Limited is a British manufacturer of luxury sports cars and grand tourers. It was founded in 1913 by Lionel Martin and Robert Bamford. Steered from 1947 by David Brown, it became associated with expensive grand touring cars in the 1950s and 1960s, and with the fictional character James Bond following his use of a DB5 model in the 1964 film Goldfinger. Their sports cars are regarded as a British cultural icon. Aston Martin has held a Royal Warrant as purveyor of motorcars to HRH the Prince of Wales since 1982. It has over 150 car dealerships in over 50 countries on 6 continents making them a global automobile brand.\n\nTheir headquarters and the main production site are in Gaydon, Warwickshire, England, alongside one of Jaguar Land Rover's development centres on the site of a former RAF V Bomber airbase. One of Aston Martin's recent cars was named after the 1950s Vulcan Bomber. Aston Martin has diversified to speed boats, submarines, bicycles, clothing and real estate development.\n\nHistory \n\nAston Martin had a troubled history after the third quarter of the 20th century but has also enjoyed long periods of success and stability. “In the first century we went bankrupt seven times”, incoming CEO Andy Palmer told Automotive News Europe. “The second century is about making sure that is not the case.” On the back of strong demand for Aston Martin’s DB11, its first all-new model in a decade, the company swung back to a profit in the first quarter of 2017.\n\nFounding\n\nAston Martin was founded in 1913 by Lionel Martin and Robert Bamford. The two had joined forces as Bamford & Martin the previous year to sell cars made by Singer from premises in Callow Street, London where they also serviced GWK and Calthorpe vehicles. Martin raced specials at Aston Hill near Aston Clinton, and the pair decided to make their own vehicles. The first car to be named Aston Martin was created by Martin by fitting a four-cylinder Coventry-Simplex engine to the chassis of a 1908 Isotta Fraschini.\n\nThey acquired premises at Henniker Mews in Kensington and produced their first car in March 1915. Production could not start because of the outbreak of World War I, and Martin joined the Admiralty and Bamford the Royal Army Service Corps. All machinery was sold to the Sopwith Aviation Company.\n\nInter war years \n\nAfter the war they found new premises at Abingdon Road, Kensington and designed a new car. Bamford left in 1920 and Aston Martin was revitalised with funding from Count Louis Zborowski. In 1922, Bamford & Martin produced cars to compete in the French Grand Prix, which went on to set world speed and endurance records at Brooklands. Three works Team Cars with 16-valve twin cam engines were built for racing and record breaking: chassis number 1914, later developed as the Green Pea; chassis number 1915, the Razor Blade record car; and chassis number 1916, later developed as the Halford Special.\n\nApproximately 55 cars were built for sale in two configurations; long chassis and short chassis. Aston Martin went bankrupt in 1924 and was bought by Dorothea, Lady Charnwood who put her son John Benson on the board. Aston Martin failed again in 1925 and the factory closed in 1926, with Lionel Martin leaving.\n\nLater that year, Bill Renwick, Augustus (Bert) Bertelli and investors including Lady Charnwood took control of the business. They renamed it Aston Martin Motors and moved it to the former Whitehead Aircraft Limited Hanworth works in Feltham. Renwick and Bertelli had been in partnership some years and had developed an overhead-cam four-cylinder engine using Renwick's patented combustion chamber design, which they had tested in an Enfield-Allday chassis. The only \"Renwick and Bertelli\" motor car made, it was known as \"Buzzbox\" and still survives.\n\nThe pair had planned to sell their engine to motor manufacturers, but having heard that Aston Martin was no longer in production realised they could capitalise on its reputation to jump start the production of a completely new car.\n\nBetween 1926 and 1937 Bertelli was both technical director and designer of all new Aston Martins, since known as \"Bertelli cars\". They included the 1½-litre \"T-type\", \"International\", \"Le Mans\", \"MKII\" and its racing derivative, the \"Ulster\", and the 2-litre 15/98 and its racing derivative, the \"Speed Model\". Most were open two-seater sports cars bodied by Bert Bertelli's brother Enrico (Harry), with a small number of long-chassis four-seater tourers, dropheads and saloons also produced.\n\nBertelli was a competent driver keen to race his cars, one of few owner/manufacturer/drivers. The \"LM\" team cars were very successful in national and international motor racing including at Le Mans and the Mille Miglia.\n\nFinancial problems reappeared in 1932. Aston Martin was rescued for a year by Lance Prideaux Brune before passing it on to Sir Arthur Sutherland. In 1936, Aston Martin decided to concentrate on road cars, producing just 700 until World War II halted work. Production shifted to aircraft components during the war.\n\nDB — David Brown \n\nIn 1947, old-established (1860) privately owned Huddersfield gear and machine tools manufacturer David Brown Limited bought Aston Martin putting it under control of its Tractor Group. David Brown became Aston Martin's latest saviour.The David Brown Corporation Limited (Incorporated under the Companies Act. 1948.) The Times, Monday, 12 March 1951; pg. 9; Issue 51947. He also acquired without its factory Lagonda's businessThe New Lagonda Car. The Times, Saturday, 20 September 1947; pg. 3; Issue 50871 for its 2.6-litre W. O. Bentley-designed engine. Lagonda moved operations to Newport Pagnell and shared engines, resources and workshops. Aston Martin began to build the classic \"DB\" series of cars.\n\nIn April 1950, they announced planned production of their Le Mans prototype to  be called the DB2,The 2½-Litre Aston-Martin. The Times, Tuesday, 25 April 1950; pg. 3; Issue 51674. followed by the DB2/4 in 1953, the DB2/4 MkII in 1955, the DB Mark III in 1957 and the Italian-styled 3.7 L DB4 in 1958.\n\nWhile these models helped Aston Martin establish a good racing pedigree, the DB4 stood out and yielded the famous DB5 in 1963. Aston stayed true to its grand touring style with the DB6 (1965–70), and DBS (1967–1972).\n\nThe six-cylinder engines of these cars from 1954 up to 1965 were designed by Tadek Marek.\n\nWillson \n\nAston Martin was often financially troubled. In 1972 David Brown paid off all its debts, said to be £5 million or more, and handed it for £101 to Company Developments, a Birmingham-based investment bank consortium chaired by accountant William Willson. More detail on this period may be read at Willson's biography. The worldwide recession, lack of working capital and the difficulties of developing without proper resources an engine to meet California's exhaust emission requirements — it stopped Aston's US sales — again pulled Aston Martin into receivership at the end of 1974. There were 460 workers when the plant closed.Receiver is called in at Jensen Motors. The Times, Tuesday, 16 September 1975; pg. 17; Issue 59502\n\nSprague and Curtis \n\nThe receiver sold the business in April 1975 for £1.05 million to North American businessmen Peter Sprague of National Semiconductor and Toronto hotelier, George Minden, and Jeremy Turner, a London businessman,Aston Martin bid final, consortium says. The Times, Friday, 4 April 1975; pg. 19; Issue 59361 who insisted to reporters Aston Martin remained a British controlled business. Sprague later claimed he had fallen in love with the factory, not the cars, the workforce's craftsmanship dedication and intelligence. At this point, he and Minden had brought in investor, Alan Curtis, a British office property developer together with George Flather, a retired Sheffield steel magnate.Lagonda sets out on a new course. The Times, Monday, 24 April 1978; pg. 18; Issue 60284\n\nSix months later in September 1975 the factory — shut-down the previous December — re-opened under its new owner Aston Martin Lagonda (1975) Limited with 100 employees and plans to lift staff to 250 by the end of 1975. In January 1976 AML revealed it now held orders for 150 cars for USA, 100 for other markets and another 80 from a Japanese importing agency.Aston Martin Revival. The Times, Saturday, 10 January 1976; pg. 17; Issue 59598 At the Geneva Motor Show Fred Hartley, managing director and sales director for 13 years before that, announced he had resigned over \"differences in marketing policy\".On the Move. The Times, Wednesday, 16 March 1977; pg. 21; Issue 59953 Alan Curtis made himself managing director.\n\nThe new owners pushed Aston Martin into modernising its line, producing the V8 Vantage in 1977, the convertible Volante in 1978, and the one-off William Towns-styled Bulldog in 1980. Towns also styled the futuristic new Lagonda saloon, based on the V8 model.\n\nCurtis, who had a 42% stake in Aston Martin,Consortium puts in its bid for MG. The Times, Friday, 25 January 1980; pg. 17; Issue 60533 also brought about a change in direction from the usual customers who were Aston Martin fanatics (fans) to successful young married businessmen. Prices had been increased by 25%. There was speculation that AML was about to buy Lamborghini.August car sales may hit peak. The Times, Friday, 18 August 1978; pg. 16; Issue 60383 At the end of the 1970s there was widespread debate about running MG into the Aston Martin consortium. 85 Tory MPs formed themselves into a pressure group to get British Leyland to release their grip and hand it over.Sell MG to Aston Martin, MPs say. The Times, Tuesday, 27 November 1979; pg. 16; Issue 60485 CH Industrials plc (car components) bought a 10% share in AML. But in July 1980 blaming a recession AML cut back their workforce of 450 by more than 20% making those people redundantThe Times, Tuesday, 1 July 1980; pg. 17; Issue 60665 and the following day British Leyland announced it had abandoned hope of an MG rescue by Aston Martin.\n\nGauntlett \n\nin January 1981 there having been no satisfactory revival partners Alan Curtis and Peter Sprague announced they had never intended to maintain a long term financial stake in Aston Martin Lagonda and it was to be sold to Pace Petroleum's Victor Gauntlett. Sprague and Curtis pointed out that under their ownership AML finances had improved to where an offer for MG might have been feasible.Petrol chief takes over Aston Martin. The Times, Monday, 5 January 1981; pg. 15; Issue 60817. Worldwide sales had shrunk to three cars per week, prompting chairman Alan Curtis, Sprague, and Minden to consider shutting down production to concentrate on service and restoration. At this point Curtis attended the 1980 Pace sponsored Stirling Moss benefit day at Brands Hatch, and met fellow Farnham resident Victor Gauntlett.\n\nGauntlett bought a 12.5% stake in Aston Martin for £500,000 via Pace Petroleum in 1980, with Tim Hearley of CH Industrials taking a similar share. Pace and CHI took over as joint 50/50 owners at the beginning of 1981, with Gauntlett as executive chairman. Gauntlett also led the sales team, and after some development and publicity when it became the world's fastest 4-seater production car, was able to sell the Aston Martin Lagonda in Oman, Kuwait, and Qatar.\n\nIn 1982, Aston Martin was granted a Royal Warrant of Appointment by the Prince of Wales. Aston Martin holds the warrant to this day.\n\nUnderstanding that it would take some time to develop new Aston Martin products, they created an engineering service subsidiary to develop automotive products for other companies. It was decided to use, a trade name of Salmons & Son their in-house coachbuilder, Tickford which Aston Martin had bought in 1955. Tickford's name had been long associated with expensive high quality carriages and cars and their folding roofs. New products included a Tickford Austin Metro, a Tickford Ford Capri and even Tickford train interiors, particularly on the Jaguar XJS. Pace continued sponsoring racing events, and now sponsored all Aston Martin Owners Club events, taking a Tickford-engined Nimrod Group C car owned by AMOC President Viscount Downe, which came third in the Manufacturers Championship in both 1982 and 1983. It also finished seventh in the 1982 24 Hours of Le Mans race. However, sales of production cars were now at an all-time low of 30 cars produced in 1982.\n\nAs trading became tighter in the petroleum market, and Aston Martin was requiring more time and money, Gauntlett agreed to sell Hays/Pace to the Kuwait Investment Office in September 1983. As Aston Martin required greater investment, he also agreed to sell his share holding to American importer and Greek shipping tycoon Peter Livanos, who invested via his joint venture with Nick and John Papanicolaou, ALL Inc. Gauntlett remained chairman of AML 55% owned by ALL, with Tickford a 50/50 venture between ALL and CHI. The uneasy relationship was ended when ALL exercised options to buy a larger share in AML; CHI's residual shares were exchanged for CHI's complete ownership of Tickford, which retained development of existing Aston Martin projects. In 1984  Papanicolaou's Titan shipping business was in trouble so Livanos's father George bought out the Papanicolaou's shares in ALL, while Gauntlett again became a shareholder with a 25% holding in AML. The deal valued Aston Martin/AML at £2 million, the year it built its 10,000th car.\n\nAlthough as a result Aston Martin had to make 60 members of the workforce redundant, Gauntlett bought a stake in Italian styling house Zagato, and resurrected its collaboration with Aston Martin.\n\nIn 1986, Gauntlett negotiated the return of fictional British secret agent James Bond to Aston Martin. Cubby Broccoli had chosen to recast the character using actor Timothy Dalton, in an attempt to re-root the Bond-brand back to a more Sean Connery-like feel. Gauntlett supplied his personal pre-production Vantage for use in the filming of The Living Daylights, and sold a Volante to Broccoli for use at his home in America. Gauntlett turned down the role of a KGB colonel in the film, however: \"I would have loved to have done it but really could not afford the time.\"\n\nAston Martin needed funds to survive in the long term. In May 1987, Gauntlett and Prince Michael of Kent were staying at the home of Contessa Maggi, the wife of the founder of the original Mille Miglia, while watching the revival event. Another house guest was Walter Hayes, vice-president of Ford of Europe. Despite problems over the previous acquisition of AC Cars, Hayes saw the potential of the brand and the discussion resulted in Ford taking a share holding in September 1987. In 1988, having produced some 5,000 cars in 20 years, a revived economy and successful sales of limited edition Vantage, and 52 Volante Zagato coupes at £86,000 each; Aston Martin finally retired the ancient V8 and introduced the Virage range—the first new Aston launched in 20 years.\n\nAlthough Gauntlett was contractually to stay as chairman for two years, his racing interests took Aston back into sports car racing in 1989 with limited European success. However, with engine rule changes for the 1990 season and the launch of the new Aston Martin Volante model, Ford provided the limited supply of Cosworth engines to the Jaguar cars racing team. As the \"small Aston\" DB7 would require a large engineering input, Ford agreed to take full control of Aston Martin, and Gauntlett handed over Aston Martin's chairmanship to Hayes in 1991. In 1992, the Vantage version was announced, and the following year Aston Martin renewed the DB range by announcing the DB7.\n\nFord Motor Company \n\nFord placed Aston in the Premier Automotive Group, invested in new manufacturing and ramped up production. In 1994, Ford opened a new factory at Banbury Road in Bloxham. In 1995 Aston Martin produced a record 700 vehicles. Until the Ford era, cars had been produced by hand coachbuilding craft methods, such as the English wheel. In 1998 the 2,000th DB7 was built, and in 2002 the 6,000th, exceeding production of all previous DB models. The DB7 range was boosted by the addition of V12 Vantage models in 1999, and in 2001 Aston Martin introduced the V12-engined Aston Martin Vanquish.\n\nAt the North American International Auto Show in Detroit, Michigan in 2003, Aston Martin introduced the AMV8 Vantage concept car. Expected to have few changes before its introduction in 2005, the Vantage brought back the classic V8 engine to allow Aston Martin to compete in a larger market. 2003 also saw the opening of the Gaydon factory, the first purpose-built factory in Aston Martin's history. Also introduced in 2003 was the DB9 coupé, which replaced the ten-year-old DB7. A convertible version of the DB9, the DB9 Volante, was introduced at the 2004 Detroit Auto Show.\n\nIn October 2004, Aston Martin set up the dedicated 12500 m2 AMEP engine production plant within the Ford Germany Niehl, Cologne plant. With capacity to produce up to 5,000 engines a year by 100 specially trained personnel, like traditional Aston Martin engine production from Newport Pagnell, assembly of each unit is entrusted to a single technician from a pool of 30, with V8 and V12 variants assembled in under 20 hours. By bringing engine production back to within Aston Martin, the promise was that Aston Martin would be able to produce small runs of higher performance variants engines. This expanded engine capacity allowed in 2006, the V8 Vantage sports car to enter production at the Gaydon factory, joining the DB9 and DB9 Volante.\n\nIn December 2003 Aston Martin announced it would return to motor racing in 2005. A new division was created, called Aston Martin Racing, which became responsible, together with Prodrive, for the design, development, and management of the DBR9 program. The DBR9 competes in the GT class in sports car races, including the world-famous 24 Hours of Le Mans.\n\nIn 2006, an internal audit led Ford to consider divesting itself of parts of its Premier Automotive Group. After suggestions of selling Jaguar Cars, Land Rover, or Volvo Cars were weighed, Ford announced in August 2006 it had engaged UBS AG to sell all or part of Aston Martin at auction.\n\n2007—the Richards era \n\nOn 12 March 2007, a consortium led by Prodrive chairman David Richards purchased Aston Martin for £475m (US$848m). The group included American investment banker John Singers and two Kuwaiti companies, Investment Dar and Adeem Investment; Prodrive had no financial involvement in the deal.\nFord kept a stake in Aston Martin valued at £40m (US$70m).\n\nTo demonstrate the V8 Vantage's durability across hazardous terrain and promote the car in China, the first east-west crossing of the Asian Highway was undertaken between June and August 2007. A pair of Britons drove 12089 km from Tokyo to Istanbul before joining the European motorway network for another 3259 km to London. The promotion was so successful Aston Martin opened dealerships in Shanghai and Beijing within three months.\n\nOn 19 July 2007, the Newport Pagnell plant rolled out the last of nearly 13,000 cars made there since 1955, a Vanquish S. The Tickford Street facility was converted to Aston Martin's service and restoration department. UK production is now concentrated at Gaydon on the former RAF V-bomber airfield.[http://www.astonmartins.com/factory/gaydon.htm Aston Martin Gaydon] at Tim Cottingham's Aston Martins (non-official) site  In March 2008 Aston Martin announced a partnership with Magna Steyr to outsource manufacture of over 2,000 cars annually to Graz, Austria, reassuringly stating: \"The continuing growth and success of Aston Martin is based upon Gaydon as the focal point and heart of the business, with the design and engineering of all Aston Martin products continuing to be carried out there.\"[http://www.astonmartin.com/thecompany/news?a=203a26c4-47e1-4667-9a0c-3ddb9415aa1f Statement by Aston Martin's CEO, Dr Ulrich Bez] Official site, 4 March 2008 \n\nMore dealers in Europe and the new pair in China brought the total to 120 in 28 countries.\n\nOn 1 September 2008, Aston Martin announced the revival of the Lagonda marque, proposing a concept to be shown in 2009 to coincide with the brand's 100th anniversary. The first production cars are slated for 2012.\n\nIn December 2008, Aston Martin announced it would cut its workforce from 1,850 to 1,250.\n\nThe first four-door Aston Martin Rapide sports cars rolled out of the Magna Steyr factory in Graz, Austria in 2010.[http://www.astonmartin.com/thecompany/news?a=62fae734-e1d7-434f-af22-259a8848fbb4 Media announcement] on official website, 7 May 2010  The contract manufacturer provides dedicated facilities to ensure compliance with the exacting standards of Aston Martin and other marques, including Mercedes-Benz. Ulrich Bez has publicly speculated about outsourcing all of Aston Martin's operations with the exception of marketing. In September 2011 it was announced Rapide production would be returned to Gaydon in the second half of 2012, restoring all manufacture there.\n\n2012—Investindustrial stakeholding and new chief executive officer \n\nItalian private equity fund Investindustrial signed a deal on 6 December 2012 to buy 37.5% of Aston Martin, investing £150 million as a capital increase. [http://www.ilmessaggero.it/economia/aston_martin_italiana_investindustrial_bonomi/notizie/236499.shtml Aston Martin diventa italiana. Investindustrial rileva il 37,5%] [https://archive.is/20130126010244/http://www.motori24.ilsole24ore.com/Industria-Protagonisti/2012/12/aston--martin-passa-mani-italiane.phpAston Martin in mani italiane. Il fondo Investindustrial dei Bonomi socio di riferimento con il 37,5%.] This was confirmed by Aston Martin in a press release on 7 December 2012. In April 2013 it was reported that Dr Ulrich Bez would be leaving his role as chief executive officer to take up a more ambassadorial position widely seen as the first move by the new shareholders in reviewing the leadership and strategy of Aston Martin. On 2 September 2014, Aston Martin announced it had appointed the Nissan executive Andy Palmer as CEO with Ulrich Bez retaining a position as non-executive chairman. As sales had been declining, from 2015 Aston Martin sought new customers (particularly wealthy female buyers) with cars like Lagonda and DBX while releasing concept cars like the Vulcan. According to Palmer, the troubles started when sales of the DB9 failed to generate sufficient fund to develop next-generation models which led to a downward spiral of declining sales and profitability.\n\nIn 2014, Aston Martin suffered a pre-tax loss of £72 million, almost triple that of 2013 selling 3,500 cars during the year, well below 7,300 sold in 2007 and 4,200 sold in 2013. In March 2014 Aston Martin issued “payment in kind” notes of US$165 million, at 10.25% interest, in addition to the £304 million of senior secured notes at 9.25% issued in 2011. Aston Martin also had to secure an additional investment of £200 million from its shareholders to fund development of new models.\nIt is reported that Aston Martin's pre-tax losses for 2016 increased by 27% to £162.8 million, the sixth year it continued to suffer a loss.\n\nRelationship with Mercedes-AMG \n\nIn 2013, Aston Martin signed a deal with Daimler AG to supply the next generation Aston Martin cars with new Mercedes-AMG engines. Daimler AG now owns 5% of Aston Martin. Mercedes-AMG will also supply Aston Martin with electrical systems. This technical partnership will support Aston Martin’s launch of a new generation of models that will incorporate new technology and V8s. The first model to sport Mercedes technology is the DB11, announced at the 2016 Geneva Motor, sporting Mercedes electronics for the entertainment, navigation and other systems. The 2019 V8 Vantage, unveiled in late 2017, also uses the Mercedes twin-turbo V8 and infotainment systems.\n\nNotable events \n\nIn August 2017, a 1956 Aston Martin DBR1/1 sold at a Sotheby's auction at the Pebble Beach, California Concours d'Elegance for $22,550,000, which made it the  most-expensive British car ever sold at auction, according to Sotheby's. The car was driven before by racing legends like Carroll Shelby and Stirling Moss.\n\nModels \n\nPre-war cars \n\n* 1921–1925 Aston Martin Standard Sports\n* 1927–1932 Aston Martin First Series\n* 1929–1932 Aston Martin International\n* 1932–1932 Aston Martin International Le Mans\n* 1932–1934 Aston Martin Le Mans\n* 1933–1934 Aston Martin 12/50 Standard\n* 1934–1936 Aston Martin Mk II\n* 1934–1936 Aston Martin Ulster\n* 1936–1940 Aston Martin 2-litre Speed Models (23 built) The last 8 were fitted with C-type bodywork\n* 1937–1939 Aston Martin 15/98\n\nPost-war sports and GT cars the David Brown era \n\n* 1948–1950 Aston Martin 2-Litre Sports (DB1)\n* 1950–1953 Aston Martin DB2\n* 1953–1957 Aston Martin DB2/4\n* 1957–1959 Aston Martin DB Mark III\n* 1958–1963 Aston Martin DB4\n* 1961–1963 Aston Martin DB4 GT Zagato\n* 1963–1965 Aston Martin DB5\n* 1965–1966 Aston Martin Short Chassis Volante\n* 1965–1969 Aston Martin DB6\n* 1967–1972 Aston Martin DBS\n* 1969–1989 Aston Martin V8\n* 1977–1989 Aston Martin V8 Vantage\n* 1986–1990 Aston Martin V8 Zagato\n* 1989–1996 Aston Martin Virage/Virage Volante\n* 1989–2000 Aston Martin Virage\n* 1993–2000 Aston Martin Vantage\n* 1996–2000 Aston Martin V8 Coupe/V8 Volante\n* 1993–2003 Aston Martin DB7/DB7 Vantage\n* 2001–2007 Aston Martin V12 Vanquish/Vanquish S\n* 2002–2003 Aston Martin DB7 Zagato\n* 2002–2004 Aston Martin DB AR1\n* 2004–2016 Aston Martin DB9\n* 2005–2018 Aston Martin V8 and V12 Vantage\n* 2007–2012 Aston Martin DBS V12\n* 2009–2012 Aston Martin One-77[https://web.archive.org/web/20100308044400/http://www.one-77.com/Testing1.html Images of One-77] an Aston Martin Lagonda Group site\n* 2010– Aston Martin Rapide/Rapide S\n* 2011–2012 Aston Martin Virage/Virage Volante\n* 2011–2013 Aston Martin Cygnet, based on the Toyota iQ\n* 2012–2013 Aston Martin V12 Zagato\n* 2012– Aston Martin Vanquish/Vanquish Volante\n* 2016– Aston Martin DB11\n\nOther\n\n* 1944 Aston Martin Atom (concept)\n* 1961–1964 Lagonda Rapide\n* 1976–1989 Aston Martin Lagonda\n* 1980 Aston Martin Bulldog (concept)\n* 1993 Lagonda Vignale (concept)\n* 2007 Aston Martin V12 Vantage RS (concept)\n* 2007–2008 Aston Martin V8 Vantage N400\n* 2009 Aston Martin Lagonda SUV (concept)\n* 2010 Aston Martin V12 Vantage Carbon Black Edition\n* 2010 Aston Martin DBS Carbon Black Edition\n* 2013 Aston Martin Rapide Bertone Jet 2+2 (concept)\n* 2013 Aston Martin CC100 Speedster (concept)\n* 2015 Aston Martin DB10 (concept)\n\nCurrent models\n\n* Aston Martin DB11\n* Aston Martin Rapide S\n* Aston Martin Vanquish & Vanquish Volante\n* Aston Martin V8 & V12 Vantage\n* Aston Martin Vulcan\n\nUpcoming models\n\n* Aston Martin Valkyrie\n* 2019 Aston Martin V8 Vantage\n\nFile:1933 Aston Martin Le Mans.JPG|1932–1934 Aston Martin Le Mans short chassis\nFile:Aston_Martin_2_Litre_1950.JPG|1948–1950 Aston Martin DB1\nFile:Aston Martin DB2-4 Mark I.jpg|1950–1957 DB2 and later DB2/4\nFile:Aston Martin DB Mark III.jpg|1957–1959 Aston Martin DB Mark III\nFile:Aston-Martin DB4.JPG|1958–1963 Aston Martin DB4/GT\nFile:DB4GT Zagato at Goodwood.jpg|1961–1963 Aston Martin DB4 GT Zagato\nFile:AMDB5No1.jpg|1963–1965 Aston Martin DB5\nFile:Aston Martin DB6 r.jpg|1965–1971 Aston Martin DB6\nFile:Aston_Martin_DBS_V8_and_Series_II.jpg|1967–1989 DBS and later V8s\nFile:Zagato.jpg|1986–1990 Aston Martin V8 Zagato\nFile:Virage Volante.jpg|1989–2000 Virage/V8/Vantage\nFile:2001DB7.jpg|1993–2003 Aston Martin DB7/Vantage\nFile:Amvanquish.jpg|2001–2007 Aston Martin V12 Vanquish/S\nFile:Zagato_Paris.JPG|2002–2003 DB7 Zagato coupé/roadster\nFile:Aston Martin DB AR1.jpg|2002–2004 Aston Martin DB AR1 roadster\nFile:Aston Martin DB9 - Flickr - Alexandre Prévot (16) (cropped).jpg|2003– Aston Martin DB9 coupé/Volante\nFile:Aston Martin V8 Vantage - Flickr - Alexandre Prévot (15) (cropped).jpg|2005– Aston Martin V8/V12 Vantage\nFile:Aston Martin DBS - Flickr - Alexandre Prévot (11) (cropped).jpg|2007–2012 Aston Martin DBS V12\nFile:Aston Martin One-77 (8701486190) (cropped).jpg|2009–2012 Aston Martin One-77\nFile:Aston Martin Rapide - Flickr - Alexandre Prévot (12) (cropped).jpg|2010– Aston Martin Rapide\nFile:2012 Aston Martin Virage coupé.jpg|2011–2012 Aston Martin Virage\nFile:Aston_Martin_Cygnet_(82).JPG|2011–2013 Aston Martin Cygnet\nFile:Red_Aston_Martin_V12_Zagato_fr_IAA_2011.jpg|2012–2013 Aston Martin V12 Zagato\nFile:White Aston Martin Vanquish in France (cropped).jpg|2012– Aston Martin Vanquish\nFile:Aston_Martin_DB11_Geneva_Motor_Show.jpg|2016– Aston Martin DB11\n\nBrand Expansion \n\nAston Martin has diversified into other market areas in the modern day. In September 2016, a 37-foot long Aston Martin speedboat was unveiled called the Aston Martin AM37 powerboat. The cabin of the boat has mood lighting and air conditioning complete with a microwave oven, refrigerator and a table that converts into a bed meaning that the AM37 is a complete day and night cruiser. Two versions of the boat are available with a AM37S version reaching speeds of 50 knots.\n\nA year later in September 2017, Aston Martin announced that they had partnered with submarine building company Triton Submarines LLC to build an Aston Martin Submarine called project neptune.\n\nAston Martin has also diversed in to the fashion industry collaborating with luxury clothing company Hackett London to deliver luxury items of clothing that match the luxury feel of Aston Martin vehicles.\n\nIn November 2017, Aston Martin unveiled a special limited edition bicycle after collaborating with renowned bicycle manufacturer Storck. Only 107 models of the exclusive Fascenario.3 Aston Martin Edition will be produced. The frame and forks are the result of the latest advances in carbon fibre and aerodynamics, while the componentry is of the highest quality, meaning that the Aston Martin Edition sits at the very pinnacle of current road bicycles as of 2017.\n\nAston Martin and  global property developer G&G Business Developments are currently building a 66-story luxury condominium tower called Aston Martin Residences at 300 Biscayne Boulevard Way in Miami, Florida which is set for completion in 2021 thus confirming Aston Martin's presence in the real estate market.\n\nMotorsport\n\nWhole race cars (post-war)\n\n* Aston Martin DB3 (1950–1953)\n* Aston Martin DB3S (1953–1956)\n* Aston Martin DBR1 (1956–1959)\n* Aston Martin DBR2 (1957–1958)\n* Aston Martin DBR3 (1958)\n* Aston Martin DBR4 (1959)\n* Aston Martin DBR5 (1960)\n* Aston Martin DP212 (1962)\n* Aston Martin DP214 (1963)\n* Aston Martin DP215 (1963)\n* Aston Martin RHAM/1 (1976–1979)\n* Aston Martin AMR1 (1989)\n* Aston Martin AMR2 (never raced)\n* Aston Martin DBR9 (2005–)\n* Aston Martin DBRS9 (2005–)\n* Aston Martin V8 Vantage N24 (2006–)\n* Aston Martin V8 Vantage Rally GT (2006–)\n* Aston Martin V8 Vantage GT2 (2008–)\n* Aston Martin V8 Vantage GT4 (2008–)\n* Aston Martin DBR1-2 (2009–)\n* Aston Martin AMR-One (2011)\n\nEngine supply only\n\n* Cooper-Aston Martin (1963)\n* Lola T70-Aston Martin (1967)\n* Aston Martin DPLM (1980–1982)\n* Nimrod NRA/C2-Aston Martin (1982–1984)\n* Aston Martin EMKA C83/1 and C84/1 (1983–1985)\n* Cheetah G604-Aston Martin\n* Lola B08/60-Aston Martin (2008–)\n\nFormula One World Championship results\n\n(key)\n\n24 Hours of Le Mans finishes\n\nSponsorships\n\nAston Martin sponsors 2. Bundesliga club 1860 Munich.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Aston Martin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2369" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Aston Martin Lagonda Limited is a British manufacturer of luxury sports cars and grand tourers. It was founded in 1913 by Lionel Martin and Robert Bamford. Steered from 1947 by David Brown, it became associated with expensive grand touring cars in the 1950s and 1960s, and with the fictional character James Bond following his use of a DB5 model in the 1964 film Goldfinger. Their sports cars are regarded as a British cultural icon. Aston Martin has held a Royal Warrant as purveyor of motorcars to HRH the Prince of Wales since 1982. It has over 150 car dealerships in over 50 countries on 6 continents making them a global automobile brand.\n\nTheir headquarters and the main production site are in Gaydon, Warwickshire, England, alongside one of Jaguar Land Rover's development centres on the site of a former RAF V Bomber airbase. One of Aston Martin's recent cars was named after the 1950s Vulcan Bomber. Aston Martin has diversified to speed boats, submarines, bicycles, clothing and real estate development.\n\nHistory \n\nAston Martin had a troubled history after the third quarter of the 20th century but has also enjoyed long periods of success and stability. “In the first century we went bankrupt seven times”, incoming CEO Andy Palmer told Automotive News Europe. “The second century is about making sure that is not the case.” On the back of strong demand for Aston Martin’s DB11, its first all-new model in a decade, the company swung back to a profit in the first quarter of 2017.\n\nFounding\n\nAston Martin was founded in 1913 by Lionel Martin and Robert Bamford. The two had joined forces as Bamford & Martin the previous year to sell cars made by Singer from premises in Callow Street, London where they also serviced GWK and Calthorpe vehicles. Martin raced specials at Aston Hill near Aston Clinton, and the pair decided to make their own vehicles. The first car to be named Aston Martin was created by Martin by fitting a four-cylinder Coventry-Simplex engine to the chassis of a 1908 Isotta Fraschini.\n\nThey acquired premises at Henniker Mews in Kensington and produced their first car in March 1915. Production could not start because of the outbreak of World War I, and Martin joined the Admiralty and Bamford the Royal Army Service Corps. All machinery was sold to the Sopwith Aviation Company.\n\nInter war years \n\nAfter the war they found new premises at Abingdon Road, Kensington and designed a new car. Bamford left in 1920 and Aston Martin was revitalised with funding from Count Louis Zborowski. In 1922, Bamford & Martin produced cars to compete in the French Grand Prix, which went on to set world speed and endurance records at Brooklands. Three works Team Cars with 16-valve twin cam engines were built for racing and record breaking: chassis number 1914, later developed as the Green Pea; chassis number 1915, the Razor Blade record car; and chassis number 1916, later developed as the Halford Special.\n\nApproximately 55 cars were built for sale in two configurations; long chassis and short chassis. Aston Martin went bankrupt in 1924 and was bought by Dorothea, Lady Charnwood who put her son John Benson on the board. Aston Martin failed again in 1925 and the factory closed in 1926, with Lionel Martin leaving.\n\nLater that year, Bill Renwick, Augustus (Bert) Bertelli and investors including Lady Charnwood took control of the business. They renamed it Aston Martin Motors and moved it to the former Whitehead Aircraft Limited Hanworth works in Feltham. Renwick and Bertelli had been in partnership some years and had developed an overhead-cam four-cylinder engine using Renwick's patented combustion chamber design, which they had tested in an Enfield-Allday chassis. The only \"Renwick and Bertelli\" motor car made, it was known as \"Buzzbox\" and still survives.\n\nThe pair had planned to sell their engine to motor manufacturers, but having heard that Aston Martin was no longer in production realised they could capitalise on its reputation to jump start the production of a completely new car.\n\nBetween 1926 and 1937 Bertelli was both technical director and designer of all new Aston Martins, since known as \"Bertelli cars\". They included the 1½-litre \"T-type\", \"International\", \"Le Mans\", \"MKII\" and its racing derivative, the \"Ulster\", and the 2-litre 15/98 and its racing derivative, the \"Speed Model\". Most were open two-seater sports cars bodied by Bert Bertelli's brother Enrico (Harry), with a small number of long-chassis four-seater tourers, dropheads and saloons also produced.\n\nBertelli was a competent driver keen to race his cars, one of few owner/manufacturer/drivers. The \"LM\" team cars were very successful in national and international motor racing including at Le Mans and the Mille Miglia.\n\nFinancial problems reappeared in 1932. Aston Martin was rescued for a year by Lance Prideaux Brune before passing it on to Sir Arthur Sutherland. In 1936, Aston Martin decided to concentrate on road cars, producing just 700 until World War II halted work. Production shifted to aircraft components during the war.\n\nDB — David Brown \n\nIn 1947, old-established (1860) privately owned Huddersfield gear and machine tools manufacturer David Brown Limited bought Aston Martin putting it under control of its Tractor Group. David Brown became Aston Martin's latest saviour.The David Brown Corporation Limited (Incorporated under the Companies Act. 1948.) The Times, Monday, 12 March 1951; pg. 9; Issue 51947. He also acquired without its factory Lagonda's businessThe New Lagonda Car. The Times, Saturday, 20 September 1947; pg. 3; Issue 50871 for its 2.6-litre W. O. Bentley-designed engine. Lagonda moved operations to Newport Pagnell and shared engines, resources and workshops. Aston Martin began to build the classic \"DB\" series of cars.\n\nIn April 1950, they announced planned production of their Le Mans prototype to  be called the DB2,The 2½-Litre Aston-Martin. The Times, Tuesday, 25 April 1950; pg. 3; Issue 51674. followed by the DB2/4 in 1953, the DB2/4 MkII in 1955, the DB Mark III in 1957 and the Italian-styled 3.7 L DB4 in 1958.\n\nWhile these models helped Aston Martin establish a good racing pedigree, the DB4 stood out and yielded the famous DB5 in 1963. Aston stayed true to its grand touring style with the DB6 (1965–70), and DBS (1967–1972).\n\nThe six-cylinder engines of these cars from 1954 up to 1965 were designed by Tadek Marek.\n\nWillson \n\nAston Martin was often financially troubled. In 1972 David Brown paid off all its debts, said to be £5 million or more, and handed it for £101 to Company Developments, a Birmingham-based investment bank consortium chaired by accountant William Willson. More detail on this period may be read at Willson's biography. The worldwide recession, lack of working capital and the difficulties of developing without proper resources an engine to meet California's exhaust emission requirements — it stopped Aston's US sales — again pulled Aston Martin into receivership at the end of 1974. There were 460 workers when the plant closed.Receiver is called in at Jensen Motors. The Times, Tuesday, 16 September 1975; pg. 17; Issue 59502\n\nSprague and Curtis \n\nThe receiver sold the business in April 1975 for £1.05 million to North American businessmen Peter Sprague of National Semiconductor and Toronto hotelier, George Minden, and Jeremy Turner, a London businessman,Aston Martin bid final, consortium says. The Times, Friday, 4 April 1975; pg. 19; Issue 59361 who insisted to reporters Aston Martin remained a British controlled business. Sprague later claimed he had fallen in love with the factory, not the cars, the workforce's craftsmanship dedication and intelligence. At this point, he and Minden had brought in investor, Alan Curtis, a British office property developer together with George Flather, a retired Sheffield steel magnate.Lagonda sets out on a new course. The Times, Monday, 24 April 1978; pg. 18; Issue 60284\n\nSix months later in September 1975 the factory — shut-down the previous December — re-opened under its new owner Aston Martin Lagonda (1975) Limited with 100 employees and plans to lift staff to 250 by the end of 1975. In January 1976 AML revealed it now held orders for 150 cars for USA, 100 for other markets and another 80 from a Japanese importing agency.Aston Martin Revival. The Times, Saturday, 10 January 1976; pg. 17; Issue 59598 At the Geneva Motor Show Fred Hartley, managing director and sales director for 13 years before that, announced he had resigned over \"differences in marketing policy\".On the Move. The Times, Wednesday, 16 March 1977; pg. 21; Issue 59953 Alan Curtis made himself managing director.\n\nThe new owners pushed Aston Martin into modernising its line, producing the V8 Vantage in 1977, the convertible Volante in 1978, and the one-off William Towns-styled Bulldog in 1980. Towns also styled the futuristic new Lagonda saloon, based on the V8 model.\n\nCurtis, who had a 42% stake in Aston Martin,Consortium puts in its bid for MG. The Times, Friday, 25 January 1980; pg. 17; Issue 60533 also brought about a change in direction from the usual customers who were Aston Martin fanatics (fans) to successful young married businessmen. Prices had been increased by 25%. There was speculation that AML was about to buy Lamborghini.August car sales may hit peak. The Times, Friday, 18 August 1978; pg. 16; Issue 60383 At the end of the 1970s there was widespread debate about running MG into the Aston Martin consortium. 85 Tory MPs formed themselves into a pressure group to get British Leyland to release their grip and hand it over.Sell MG to Aston Martin, MPs say. The Times, Tuesday, 27 November 1979; pg. 16; Issue 60485 CH Industrials plc (car components) bought a 10% share in AML. But in July 1980 blaming a recession AML cut back their workforce of 450 by more than 20% making those people redundantThe Times, Tuesday, 1 July 1980; pg. 17; Issue 60665 and the following day British Leyland announced it had abandoned hope of an MG rescue by Aston Martin.\n\nGauntlett \n\nin January 1981 there having been no satisfactory revival partners Alan Curtis and Peter Sprague announced they had never intended to maintain a long term financial stake in Aston Martin Lagonda and it was to be sold to Pace Petroleum's Victor Gauntlett. Sprague and Curtis pointed out that under their ownership AML finances had improved to where an offer for MG might have been feasible.Petrol chief takes over Aston Martin. The Times, Monday, 5 January 1981; pg. 15; Issue 60817. Worldwide sales had shrunk to three cars per week, prompting chairman Alan Curtis, Sprague, and Minden to consider shutting down production to concentrate on service and restoration. At this point Curtis attended the 1980 Pace sponsored Stirling Moss benefit day at Brands Hatch, and met fellow Farnham resident Victor Gauntlett.\n\nGauntlett bought a 12.5% stake in Aston Martin for £500,000 via Pace Petroleum in 1980, with Tim Hearley of CH Industrials taking a similar share. Pace and CHI took over as joint 50/50 owners at the beginning of 1981, with Gauntlett as executive chairman. Gauntlett also led the sales team, and after some development and publicity when it became the world's fastest 4-seater production car, was able to sell the Aston Martin Lagonda in Oman, Kuwait, and Qatar.\n\nIn 1982, Aston Martin was granted a Royal Warrant of Appointment by the Prince of Wales. Aston Martin holds the warrant to this day.\n\nUnderstanding that it would take some time to develop new Aston Martin products, they created an engineering service subsidiary to develop automotive products for other companies. It was decided to use, a trade name of Salmons & Son their in-house coachbuilder, Tickford which Aston Martin had bought in 1955. Tickford's name had been long associated with expensive high quality carriages and cars and their folding roofs. New products included a Tickford Austin Metro, a Tickford Ford Capri and even Tickford train interiors, particularly on the Jaguar XJS. Pace continued sponsoring racing events, and now sponsored all Aston Martin Owners Club events, taking a Tickford-engined Nimrod Group C car owned by AMOC President Viscount Downe, which came third in the Manufacturers Championship in both 1982 and 1983. It also finished seventh in the 1982 24 Hours of Le Mans race. However, sales of production cars were now at an all-time low of 30 cars produced in 1982.\n\nAs trading became tighter in the petroleum market, and Aston Martin was requiring more time and money, Gauntlett agreed to sell Hays/Pace to the Kuwait Investment Office in September 1983. As Aston Martin required greater investment, he also agreed to sell his share holding to American importer and Greek shipping tycoon Peter Livanos, who invested via his joint venture with Nick and John Papanicolaou, ALL Inc. Gauntlett remained chairman of AML 55% owned by ALL, with Tickford a 50/50 venture between ALL and CHI. The uneasy relationship was ended when ALL exercised options to buy a larger share in AML; CHI's residual shares were exchanged for CHI's complete ownership of Tickford, which retained development of existing Aston Martin projects. In 1984  Papanicolaou's Titan shipping business was in trouble so Livanos's father George bought out the Papanicolaou's shares in ALL, while Gauntlett again became a shareholder with a 25% holding in AML. The deal valued Aston Martin/AML at £2 million, the year it built its 10,000th car.\n\nAlthough as a result Aston Martin had to make 60 members of the workforce redundant, Gauntlett bought a stake in Italian styling house Zagato, and resurrected its collaboration with Aston Martin.\n\nIn 1986, Gauntlett negotiated the return of fictional British secret agent James Bond to Aston Martin. Cubby Broccoli had chosen to recast the character using actor Timothy Dalton, in an attempt to re-root the Bond-brand back to a more Sean Connery-like feel. Gauntlett supplied his personal pre-production Vantage for use in the filming of The Living Daylights, and sold a Volante to Broccoli for use at his home in America. Gauntlett turned down the role of a KGB colonel in the film, however: \"I would have loved to have done it but really could not afford the time.\"\n\nAston Martin needed funds to survive in the long term. In May 1987, Gauntlett and Prince Michael of Kent were staying at the home of Contessa Maggi, the wife of the founder of the original Mille Miglia, while watching the revival event. Another house guest was Walter Hayes, vice-president of Ford of Europe. Despite problems over the previous acquisition of AC Cars, Hayes saw the potential of the brand and the discussion resulted in Ford taking a share holding in September 1987. In 1988, having produced some 5,000 cars in 20 years, a revived economy and successful sales of limited edition Vantage, and 52 Volante Zagato coupes at £86,000 each; Aston Martin finally retired the ancient V8 and introduced the Virage range—the first new Aston launched in 20 years.\n\nAlthough Gauntlett was contractually to stay as chairman for two years, his racing interests took Aston back into sports car racing in 1989 with limited European success. However, with engine rule changes for the 1990 season and the launch of the new Aston Martin Volante model, Ford provided the limited supply of Cosworth engines to the Jaguar cars racing team. As the \"small Aston\" DB7 would require a large engineering input, Ford agreed to take full control of Aston Martin, and Gauntlett handed over Aston Martin's chairmanship to Hayes in 1991. In 1992, the Vantage version was announced, and the following year Aston Martin renewed the DB range by announcing the DB7.\n\nFord Motor Company \n\nFord placed Aston in the Premier Automotive Group, invested in new manufacturing and ramped up production. In 1994, Ford opened a new factory at Banbury Road in Bloxham. In 1995 Aston Martin produced a record 700 vehicles. Until the Ford era, cars had been produced by hand coachbuilding craft methods, such as the English wheel. In 1998 the 2,000th DB7 was built, and in 2002 the 6,000th, exceeding production of all previous DB models. The DB7 range was boosted by the addition of V12 Vantage models in 1999, and in 2001 Aston Martin introduced the V12-engined Aston Martin Vanquish.\n\nAt the North American International Auto Show in Detroit, Michigan in 2003, Aston Martin introduced the AMV8 Vantage concept car. Expected to have few changes before its introduction in 2005, the Vantage brought back the classic V8 engine to allow Aston Martin to compete in a larger market. 2003 also saw the opening of the Gaydon factory, the first purpose-built factory in Aston Martin's history. Also introduced in 2003 was the DB9 coupé, which replaced the ten-year-old DB7. A convertible version of the DB9, the DB9 Volante, was introduced at the 2004 Detroit Auto Show.\n\nIn October 2004, Aston Martin set up the dedicated 12500 m2 AMEP engine production plant within the Ford Germany Niehl, Cologne plant. With capacity to produce up to 5,000 engines a year by 100 specially trained personnel, like traditional Aston Martin engine production from Newport Pagnell, assembly of each unit is entrusted to a single technician from a pool of 30, with V8 and V12 variants assembled in under 20 hours. By bringing engine production back to within Aston Martin, the promise was that Aston Martin would be able to produce small runs of higher performance variants engines. This expanded engine capacity allowed in 2006, the V8 Vantage sports car to enter production at the Gaydon factory, joining the DB9 and DB9 Volante.\n\nIn December 2003 Aston Martin announced it would return to motor racing in 2005. A new division was created, called Aston Martin Racing, which became responsible, together with Prodrive, for the design, development, and management of the DBR9 program. The DBR9 competes in the GT class in sports car races, including the world-famous 24 Hours of Le Mans.\n\nIn 2006, an internal audit led Ford to consider divesting itself of parts of its Premier Automotive Group. After suggestions of selling Jaguar Cars, Land Rover, or Volvo Cars were weighed, Ford announced in August 2006 it had engaged UBS AG to sell all or part of Aston Martin at auction.\n\n2007—the Richards era \n\nOn 12 March 2007, a consortium led by Prodrive chairman David Richards purchased Aston Martin for £475m (US$848m). The group included American investment banker John Singers and two Kuwaiti companies, Investment Dar and Adeem Investment; Prodrive had no financial involvement in the deal.\nFord kept a stake in Aston Martin valued at £40m (US$70m).\n\nTo demonstrate the V8 Vantage's durability across hazardous terrain and promote the car in China, the first east-west crossing of the Asian Highway was undertaken between June and August 2007. A pair of Britons drove 12089 km from Tokyo to Istanbul before joining the European motorway network for another 3259 km to London. The promotion was so successful Aston Martin opened dealerships in Shanghai and Beijing within three months.\n\nOn 19 July 2007, the Newport Pagnell plant rolled out the last of nearly 13,000 cars made there since 1955, a Vanquish S. The Tickford Street facility was converted to Aston Martin's service and restoration department. UK production is now concentrated at Gaydon on the former RAF V-bomber airfield.[http://www.astonmartins.com/factory/gaydon.htm Aston Martin Gaydon] at Tim Cottingham's Aston Martins (non-official) site  In March 2008 Aston Martin announced a partnership with Magna Steyr to outsource manufacture of over 2,000 cars annually to Graz, Austria, reassuringly stating: \"The continuing growth and success of Aston Martin is based upon Gaydon as the focal point and heart of the business, with the design and engineering of all Aston Martin products continuing to be carried out there.\"[http://www.astonmartin.com/thecompany/news?a=203a26c4-47e1-4667-9a0c-3ddb9415aa1f Statement by Aston Martin's CEO, Dr Ulrich Bez] Official site, 4 March 2008 \n\nMore dealers in Europe and the new pair in China brought the total to 120 in 28 countries.\n\nOn 1 September 2008, Aston Martin announced the revival of the Lagonda marque, proposing a concept to be shown in 2009 to coincide with the brand's 100th anniversary. The first production cars are slated for 2012.\n\nIn December 2008, Aston Martin announced it would cut its workforce from 1,850 to 1,250.\n\nThe first four-door Aston Martin Rapide sports cars rolled out of the Magna Steyr factory in Graz, Austria in 2010.[http://www.astonmartin.com/thecompany/news?a=62fae734-e1d7-434f-af22-259a8848fbb4 Media announcement] on official website, 7 May 2010  The contract manufacturer provides dedicated facilities to ensure compliance with the exacting standards of Aston Martin and other marques, including Mercedes-Benz. Ulrich Bez has publicly speculated about outsourcing all of Aston Martin's operations with the exception of marketing. In September 2011 it was announced Rapide production would be returned to Gaydon in the second half of 2012, restoring all manufacture there.\n\n2012—Investindustrial stakeholding and new chief executive officer \n\nItalian private equity fund Investindustrial signed a deal on 6 December 2012 to buy 37.5% of Aston Martin, investing £150 million as a capital increase. [http://www.ilmessaggero.it/economia/aston_martin_italiana_investindustrial_bonomi/notizie/236499.shtml Aston Martin diventa italiana. Investindustrial rileva il 37,5%] [https://archive.is/20130126010244/http://www.motori24.ilsole24ore.com/Industria-Protagonisti/2012/12/aston--martin-passa-mani-italiane.phpAston Martin in mani italiane. Il fondo Investindustrial dei Bonomi socio di riferimento con il 37,5%.] This was confirmed by Aston Martin in a press release on 7 December 2012. In April 2013 it was reported that Dr Ulrich Bez would be leaving his role as chief executive officer to take up a more ambassadorial position widely seen as the first move by the new shareholders in reviewing the leadership and strategy of Aston Martin. On 2 September 2014, Aston Martin announced it had appointed the Nissan executive Andy Palmer as CEO with Ulrich Bez retaining a position as non-executive chairman. As sales had been declining, from 2015 Aston Martin sought new customers (particularly wealthy female buyers) with cars like Lagonda and DBX while releasing concept cars like the Vulcan. According to Palmer, the troubles started when sales of the DB9 failed to generate sufficient fund to develop next-generation models which led to a downward spiral of declining sales and profitability.\n\nIn 2014, Aston Martin suffered a pre-tax loss of £72 million, almost triple that of 2013 selling 3,500 cars during the year, well below 7,300 sold in 2007 and 4,200 sold in 2013. In March 2014 Aston Martin issued “payment in kind” notes of US$165 million, at 10.25% interest, in addition to the £304 million of senior secured notes at 9.25% issued in 2011. Aston Martin also had to secure an additional investment of £200 million from its shareholders to fund development of new models.\nIt is reported that Aston Martin's pre-tax losses for 2016 increased by 27% to £162.8 million, the sixth year it continued to suffer a loss.\n\nRelationship with Mercedes-AMG \n\nIn 2013, Aston Martin signed a deal with Daimler AG to supply the next generation Aston Martin cars with new Mercedes-AMG engines. Daimler AG now owns 5% of Aston Martin. Mercedes-AMG will also supply Aston Martin with electrical systems. This technical partnership will support Aston Martin’s launch of a new generation of models that will incorporate new technology and V8s. The first model to sport Mercedes technology is the DB11, announced at the 2016 Geneva Motor, sporting Mercedes electronics for the entertainment, navigation and other systems. The 2019 V8 Vantage, unveiled in late 2017, also uses the Mercedes twin-turbo V8 and infotainment systems.\n\nNotable events \n\nIn August 2017, a 1956 Aston Martin DBR1/1 sold at a Sotheby's auction at the Pebble Beach, California Concours d'Elegance for $22,550,000, which made it the  most-expensive British car ever sold at auction, according to Sotheby's. The car was driven before by racing legends like Carroll Shelby and Stirling Moss.\n\nModels \n\nPre-war cars \n\n* 1921–1925 Aston Martin Standard Sports\n* 1927–1932 Aston Martin First Series\n* 1929–1932 Aston Martin International\n* 1932–1932 Aston Martin International Le Mans\n* 1932–1934 Aston Martin Le Mans\n* 1933–1934 Aston Martin 12/50 Standard\n* 1934–1936 Aston Martin Mk II\n* 1934–1936 Aston Martin Ulster\n* 1936–1940 Aston Martin 2-litre Speed Models (23 built) The last 8 were fitted with C-type bodywork\n* 1937–1939 Aston Martin 15/98\n\nPost-war sports and GT cars the David Brown era \n\n* 1948–1950 Aston Martin 2-Litre Sports (DB1)\n* 1950–1953 Aston Martin DB2\n* 1953–1957 Aston Martin DB2/4\n* 1957–1959 Aston Martin DB Mark III\n* 1958–1963 Aston Martin DB4\n* 1961–1963 Aston Martin DB4 GT Zagato\n* 1963–1965 Aston Martin DB5\n* 1965–1966 Aston Martin Short Chassis Volante\n* 1965–1969 Aston Martin DB6\n* 1967–1972 Aston Martin DBS\n* 1969–1989 Aston Martin V8\n* 1977–1989 Aston Martin V8 Vantage\n* 1986–1990 Aston Martin V8 Zagato\n* 1989–1996 Aston Martin Virage/Virage Volante\n* 1989–2000 Aston Martin Virage\n* 1993–2000 Aston Martin Vantage\n* 1996–2000 Aston Martin V8 Coupe/V8 Volante\n* 1993–2003 Aston Martin DB7/DB7 Vantage\n* 2001–2007 Aston Martin V12 Vanquish/Vanquish S\n* 2002–2003 Aston Martin DB7 Zagato\n* 2002–2004 Aston Martin DB AR1\n* 2004–2016 Aston Martin DB9\n* 2005–2018 Aston Martin V8 and V12 Vantage\n* 2007–2012 Aston Martin DBS V12\n* 2009–2012 Aston Martin One-77[https://web.archive.org/web/20100308044400/http://www.one-77.com/Testing1.html Images of One-77] an Aston Martin Lagonda Group site\n* 2010– Aston Martin Rapide/Rapide S\n* 2011–2012 Aston Martin Virage/Virage Volante\n* 2011–2013 Aston Martin Cygnet, based on the Toyota iQ\n* 2012–2013 Aston Martin V12 Zagato\n* 2012– Aston Martin Vanquish/Vanquish Volante\n* 2016– Aston Martin DB11\n\nOther\n\n* 1944 Aston Martin Atom (concept)\n* 1961–1964 Lagonda Rapide\n* 1976–1989 Aston Martin Lagonda\n* 1980 Aston Martin Bulldog (concept)\n* 1993 Lagonda Vignale (concept)\n* 2007 Aston Martin V12 Vantage RS (concept)\n* 2007–2008 Aston Martin V8 Vantage N400\n* 2009 Aston Martin Lagonda SUV (concept)\n* 2010 Aston Martin V12 Vantage Carbon Black Edition\n* 2010 Aston Martin DBS Carbon Black Edition\n* 2013 Aston Martin Rapide Bertone Jet 2+2 (concept)\n* 2013 Aston Martin CC100 Speedster (concept)\n* 2015 Aston Martin DB10 (concept)\n\nCurrent models\n\n* Aston Martin DB11\n* Aston Martin Rapide S\n* Aston Martin Vanquish & Vanquish Volante\n* Aston Martin V8 & V12 Vantage\n* Aston Martin Vulcan\n\nUpcoming models\n\n* Aston Martin Valkyrie\n* 2019 Aston Martin V8 Vantage\n\nFile:1933 Aston Martin Le Mans.JPG|1932–1934 Aston Martin Le Mans short chassis\nFile:Aston_Martin_2_Litre_1950.JPG|1948–1950 Aston Martin DB1\nFile:Aston Martin DB2-4 Mark I.jpg|1950–1957 DB2 and later DB2/4\nFile:Aston Martin DB Mark III.jpg|1957–1959 Aston Martin DB Mark III\nFile:Aston-Martin DB4.JPG|1958–1963 Aston Martin DB4/GT\nFile:DB4GT Zagato at Goodwood.jpg|1961–1963 Aston Martin DB4 GT Zagato\nFile:AMDB5No1.jpg|1963–1965 Aston Martin DB5\nFile:Aston Martin DB6 r.jpg|1965–1971 Aston Martin DB6\nFile:Aston_Martin_DBS_V8_and_Series_II.jpg|1967–1989 DBS and later V8s\nFile:Zagato.jpg|1986–1990 Aston Martin V8 Zagato\nFile:Virage Volante.jpg|1989–2000 Virage/V8/Vantage\nFile:2001DB7.jpg|1993–2003 Aston Martin DB7/Vantage\nFile:Amvanquish.jpg|2001–2007 Aston Martin V12 Vanquish/S\nFile:Zagato_Paris.JPG|2002–2003 DB7 Zagato coupé/roadster\nFile:Aston Martin DB AR1.jpg|2002–2004 Aston Martin DB AR1 roadster\nFile:Aston Martin DB9 - Flickr - Alexandre Prévot (16) (cropped).jpg|2003– Aston Martin DB9 coupé/Volante\nFile:Aston Martin V8 Vantage - Flickr - Alexandre Prévot (15) (cropped).jpg|2005– Aston Martin V8/V12 Vantage\nFile:Aston Martin DBS - Flickr - Alexandre Prévot (11) (cropped).jpg|2007–2012 Aston Martin DBS V12\nFile:Aston Martin One-77 (8701486190) (cropped).jpg|2009–2012 Aston Martin One-77\nFile:Aston Martin Rapide - Flickr - Alexandre Prévot (12) (cropped).jpg|2010– Aston Martin Rapide\nFile:2012 Aston Martin Virage coupé.jpg|2011–2012 Aston Martin Virage\nFile:Aston_Martin_Cygnet_(82).JPG|2011–2013 Aston Martin Cygnet\nFile:Red_Aston_Martin_V12_Zagato_fr_IAA_2011.jpg|2012–2013 Aston Martin V12 Zagato\nFile:White Aston Martin Vanquish in France (cropped).jpg|2012– Aston Martin Vanquish\nFile:Aston_Martin_DB11_Geneva_Motor_Show.jpg|2016– Aston Martin DB11\n\nBrand Expansion \n\nAston Martin has diversified into other market areas in the modern day. In September 2016, a 37-foot long Aston Martin speedboat was unveiled called the Aston Martin AM37 powerboat. The cabin of the boat has mood lighting and air conditioning complete with a microwave oven, refrigerator and a table that converts into a bed meaning that the AM37 is a complete day and night cruiser. Two versions of the boat are available with a AM37S version reaching speeds of 50 knots.\n\nA year later in September 2017, Aston Martin announced that they had partnered with submarine building company Triton Submarines LLC to build an Aston Martin Submarine called project neptune.\n\nAston Martin has also diversed in to the fashion industry collaborating with luxury clothing company Hackett London to deliver luxury items of clothing that match the luxury feel of Aston Martin vehicles.\n\nIn November 2017, Aston Martin unveiled a special limited edition bicycle after collaborating with renowned bicycle manufacturer Storck. Only 107 models of the exclusive Fascenario.3 Aston Martin Edition will be produced. The frame and forks are the result of the latest advances in carbon fibre and aerodynamics, while the componentry is of the highest quality, meaning that the Aston Martin Edition sits at the very pinnacle of current road bicycles as of 2017.\n\nAston Martin and  global property developer G&G Business Developments are currently building a 66-story luxury condominium tower called Aston Martin Residences at 300 Biscayne Boulevard Way in Miami, Florida which is set for completion in 2021 thus confirming Aston Martin's presence in the real estate market.\n\nMotorsport\n\nWhole race cars (post-war)\n\n* Aston Martin DB3 (1950–1953)\n* Aston Martin DB3S (1953–1956)\n* Aston Martin DBR1 (1956–1959)\n* Aston Martin DBR2 (1957–1958)\n* Aston Martin DBR3 (1958)\n* Aston Martin DBR4 (1959)\n* Aston Martin DBR5 (1960)\n* Aston Martin DP212 (1962)\n* Aston Martin DP214 (1963)\n* Aston Martin DP215 (1963)\n* Aston Martin RHAM/1 (1976–1979)\n* Aston Martin AMR1 (1989)\n* Aston Martin AMR2 (never raced)\n* Aston Martin DBR9 (2005–)\n* Aston Martin DBRS9 (2005–)\n* Aston Martin V8 Vantage N24 (2006–)\n* Aston Martin V8 Vantage Rally GT (2006–)\n* Aston Martin V8 Vantage GT2 (2008–)\n* Aston Martin V8 Vantage GT4 (2008–)\n* Aston Martin DBR1-2 (2009–)\n* Aston Martin AMR-One (2011)\n\nEngine supply only\n\n* Cooper-Aston Martin (1963)\n* Lola T70-Aston Martin (1967)\n* Aston Martin DPLM (1980–1982)\n* Nimrod NRA/C2-Aston Martin (1982–1984)\n* Aston Martin EMKA C83/1 and C84/1 (1983–1985)\n* Cheetah G604-Aston Martin\n* Lola B08/60-Aston Martin (2008–)\n\nFormula One World Championship results\n\n(key)\n\n24 Hours of Le Mans finishes\n\nSponsorships\n\nAston Martin sponsors 2. Bundesliga club 1860 Munich. Aston Martin. http://en.wikipedia.org/?curid=2369."
  }
}
