{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13145",
  "eid" : "06d70010-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778520721,
  "textBody" : "Gerolamo (or Girolamo, or Geronimo) Cardano (; ; ; 24 September 1501 – 21 September 1576) was an Italian polymath, whose interests and proficiencies ranged from being a mathematician, physician, biologist, physicist, chemist, astrologer, astronomer, philosopher, writer, and gambler. He was one of the most influential mathematicians of the Renaissance, and was one of the key figures in the foundation of probability and the earliest introducer of the binomial coefficients and the binomial theorem in the western world. He wrote more than 200 works on science.\n\nCardano partially invented and described several mechanical devices including the combination lock, the gimbal consisting of three concentric rings allowing a supported compass or gyroscope to rotate freely, and the Cardan shaft with universal joints, which allows the transmission of rotary motion at various angles and is used in vehicles to this day. He made significant contributions to hypocycloids, published in De proportionibus, in 1570. The generating circles of these hypocycloids were later named Cardano circles or cardanic circles and were used for the construction of the first high-speed printing presses.\n\nToday, he is well known for his achievements in algebra. He made the first systematic use of negative numbers in Europe, published with attribution the solutions of other mathematicians for the cubic and quartic equations, and acknowledged the existence of imaginary numbers.\n\nEarly life and education \n\nHe was born in Pavia, Lombardy, the illegitimate child of Fazio Cardano, a mathematically gifted jurist, lawyer, a close personal friend of Leonardo da Vinci. In his autobiography, Cardano wrote that his mother, Chiara Micheri, had taken \"various abortive medicines\" to terminate the pregnancy; he was \"taken by violent means from my mother; I was almost dead.\" She was in labour for three days. Shortly before his birth, his mother had to move from Milan to Pavia to escape the Plague; her three other children died from the disease.\n\nAfter a depressing childhood, with frequent illnesses, including impotence, and the rough upbringing by his overbearing father, in 1520, Cardano entered the University of Pavia against his father's wish, who wanted his son to undertake studies of law, but Girolamo felt more attracted to philosophy and science. During the Italian War of 1521-6, however, the authorities in Pavia were forced to close the university in 1524. Cardano resumed his studies at the University of Padua, where he graduated with a doctorate in medicine in 1525. His eccentric and confrontational style did not earn him many friends and he had a difficult time finding work after his studies had ended. In 1525, Cardano repeatedly applied to the College of Physicians in Milan, but was not admitted owing to his combative reputation and illegitimate birth.\n\nEarly career as a physician \n\nCardano wanted to practice medicine in a large, rich city like Milan, but he was denied a license to practice, so he settled for the town of Saccolongo, where he practiced without a license. There, he married Lucia Banderini in 1531. Before her death in 1546, they had three children, Giovanni Battista (1534), Chiara (1537) and Aldo (1543). Cardano later wrote that those were the happiest days of his life.\n\nWith the help of a few noblemen, Cardano obtained a teaching position in mathematics in Milan. Having finally received his medical license, he practiced mathematics and medicine simultaneously, treating a few influential patients in the process. Because of this, he became one of the most sought-after doctors in Milan. In fact, by 1536, he was able to quit his teaching position, although he was still interested in mathematics. His notability in the medical field was such that the aristocracy tried to lure him out of Milan. Cardano later wrote that he turned down offers from the kings of Denmark and France, and the Queen of Scotland.\n\nMathematics \n\nCardano was the first mathematician to make systematic use of numbers less than zero.Isaac Asimov, Asimov on Numbers, published by Pocket Books, a division of Simon & Schuster, 1966, 1977, page 119. He published with attribution the solution of Scipione del Ferro to the cubic equation and the solution of his student Lodovico Ferrari to the quartic equation in his 1545 book Ars Magna. The solution to one particular case of the cubic equation ax^3+bx+c0 (in modern notation), had been communicated to him in 1539 by Niccolò Fontana Tartaglia (who later claimed that Cardano had sworn not to reveal it, and engaged Cardano in a decade-long dispute) in the form of a poem,Katz, Victor J. A History of Mathematics: An Introduction. 3rd ed. Boston: Pearson Education, 2009. Print. but Ferro's solution predated Fontana's. In his exposition, he acknowledged the existence of what are now called imaginary numbers, although he did not understand their properties, described for the first time by his Italian contemporary Rafael Bombelli. In Opus novum de proportionibus he introduced the binomial coefficients and the binomial theorem.\n\nCardano was notoriously short of money and kept himself solvent by being an accomplished gambler and chess player. His book about games of chance, Liber de ludo aleae (\"Book on Games of Chance\"), written around 1564,In Chapter 20 of Liber de Ludo Aleae he describes a personal experience from 1526 and then adds that \"thirty-eight years have passed\" [elapsis iam annis triginta octo]. This sentence is written by Cardano around 1564, age 63. but not published until 1663, contains the first systematic treatment of probability,Katz, ibid., p. 488 as well as a section on effective cheating methods. He used the game of throwing dice to understand the basic concepts of probability. He demonstrated the efficacy of defining odds as the ratio of favourable to unfavourable outcomes (which implies that the probability of an event is given by the ratio of favourable outcomes to the total number of possible outcomes[http://www.columbia.edu/~pg2113/index_files/Gorroochurn-Some%20Laws.pdf Some laws and problems in classical probability and how Cardano anticipated them Gorrochum, P. Chancemagazine 2012]). He was also aware of the multiplication rule for independent events but was not certain about what values should be multiplied.Katz, ibid., p. 488\n\nOther contributions\n\nCardano's work with hypocycloids led him to the Cardan joint or gear mechanism, in which a pair of gears with the smaller being one-half the size of the larger gear is used converting rotational motion to linear motion with greater efficiency and precision than a Scotch yoke, for example. He is also credited with the invention of the Cardan suspension or gimbal.\n\nCardano made several contributions to hydrodynamics and held that perpetual motion is impossible, except in celestial bodies. He published two encyclopedias of natural science which contain a wide variety of inventions, facts, and occult superstitions. He also introduced the Cardan grille, a cryptographic writing tool, in 1550.\n\nSomeone also assigned to Cardano the credit for the invention of the so-called Cardano's Rings, also called Chinese Rings, but it is very probable that they predate Cardano.\n\nSignificantly, in the history of education of the deaf, he said that deaf people were capable of using their minds, argued for the importance of teaching them, and was one of the first to state that deaf people could learn to read and write without learning how to speak first. He was familiar with a report by Rudolph Agricola about a deaf mute who had learned to write.\n\nDe Subtilitate (1550) \n\nAs quoted from Charles Lyell's Principles of Geology:\n\nThe title of a work of Cardano's, published in 1552, De Subtilitate (corresponding to what would now be called transcendental philosophy), would lead us to expect, in the chapter on minerals, many far fetched theories characteristic of that age; but when treating of petrified shells, he decided that they clearly indicated the former sojourn of the sea upon the mountains.Charles Lyell, [https://books.google.com/books?id=mmIOAAAAQAAJ& Principles of Geology], 1832, p.29\n\nLater years and death \n\nTwo of Cardano's children—Giovanni and Aldo Battista—came to ignoble ends. Giovanni Battista, Cardano's eldest and favorite son, was tried and beheaded in 1560 for poisoning his wife, after he discovered that their three children were not his. Aldo Battista was a gambler, who stole money from his father, and so Gerolamo disinherited Aldo in 1569.\n\nCardano moved from Pavia to Bologna, in part because he believed that the decision to execute Giovanni was influenced by Gerolamo's battles with the academic establishment in Pavia, and his colleagues' jealousy at his scientific achievements and also because he was beset with allegations of sexual impropriety with his students. Cardano was arrested by the Inquisition in 1570 for unknown reasons, and forced to spend several months in prison and abjure his professorship. He moved to Rome, and received a lifetime annuity from Pope Gregory XIII (after first having been rejected by Pope Pius V) and finished his autobiography. He was accepted in the Royal College of Physicians, and as well as practising medicine he continued his philosophical studies until his death in 1576. Cardano is reported to have correctly predicted the exact date of his own death but it has been claimed that he achieved this by committing suicide.\n\nReferences in literature \n\nThe seventeenth century English physician and philosopher Sir Thomas Browne once possessed the ten volumes of the Leyden 1663 edition of the complete works of Cardan in his library.A Facsimile of the 1711 Sales Auction Catalogue of Sir Thomas Browne and his son Edward's Libraries. Introduction, notes and index by J.S. Finch (E.J. Brill: Leiden, 1986)\n\nBrowne critically viewed Cardan as:\n\n\"that famous Physician of Milan, a great Enquirer of Truth, but too greedy a Receiver of it. He hath left many excellent Discourses, Medical, Natural, and Astrological; the most suspicious are those two he wrote by admonition in a dream, that is De Subtilitate & Varietate Rerum. Assuredly this learned man hath taken many things upon trust, and although examined some, hath let slip many others. He is of singular use unto a prudent Reader; but unto him that only desireth , or to replenish his head with varieties; like many others before related, either in the Original or confirmation, he may become no small occasion of Error.\"Pseudodoxia Epidemica Bk 1: chapter 8 no. 13\n\nRichard Hinckley Allen tells of an amusing reference made by Samuel Butler in his book Hudibras:\n\nCardan believ'd great states depend\nUpon the tip o'th' Bear's tail's end;\nThat, as she wisk'd it t'wards the Sun,\nStrew'd mighty empires up and down;\nWhich others say must needs be false,\nBecause your true bears have no tails.\n\nAlessandro Manzoni's novel I Promessi Sposi portrays a pedantic scholar of the obsolete, Don Ferrante, as a great admirer of Cardano. Significantly, he values him only for his superstitious and astrological writings; his scientific writings are dismissed because they contradict Aristotle, but excused on the ground that the author of the astrological works deserves to be listened to even when he is wrong.\n\nEnglish novelist E. M. Forster's Abinger Harvest, a 1936 volume of essays, authorial reviews and a play, provides a sympathetic treatment of Cardano in the section titled 'The Past'. Forster believes Cardano was so absorbed in \"self-analysis that he often forgot to repent of his bad temper, his stupidity, his licentiousness, and love of revenge\" (212).\n\nWorks \n\n* De malo recentiorum medicorum usu libellus, Venice, 1536 (on medicine).\n* Practica arithmetice et mensurandi singularis, Milan, 1577 (on mathematics).\n* Artis magnae, sive de regulis algebraicis (also known as Ars magna), Nuremberg, 1545 (on algebra).[http://www.filosofia.unimi.it/cardano/testi/operaomnia/vol_4_s_4.pdf] An electronic copy of his book Ars Magna (in Latin)\n* De immortalitate animorum, 1545.\n* [http://archimedes.mpiwg-berlin.mpg.de/cgi-bin/toc/toc.cgi?dircarda_propo_015_la_1570;step\nthumb Opus novum de proportionibus] (on mechanics) (Archimedes Project).\n* Contradicentium medicorum (on medicine).\n* De subtilitate rerum, Nuremberg, Johann Petreius, 1550 (on natural phenomena).\n* De libris propriis, Leiden, 1557 (commentaries).\n* Metoposcopia libris tredecim, et octingentis faciei humanae eiconibus complexa, 1558 (publ. post. 1658, Paris)\n* De varietate rerum, Basle, Heinrich Petri, 1559 (on natural phenomena).\n* Neronis encomium, Basle, 1562.\n* De Methodo medendi, 1565\n* Opus novum de proportionibus numerorum, motuum, ponderum, sonorum, aliarumque rerum mensurandarum. Item de aliza regula, Basel, 1570.\n* De vita propria, 1576 (autobiography); a later edition, [https://books.google.com/books?idblA9AAAAcAAJ&source\ngbs_navlinks_s De Propria Vita Liber, Amsterdam, (1654)]\n* Liber de ludo aleae, (\"On Casting the Die\"),p. 963, Jan Gullberg, Mathematics from the birth of numbers, W. W. Norton & Company;   posthumously published in 1663 (on probability).\n* De Musica, ca 1546 (on music theory), posthumously published in Hieronymi Cardani Mediolensis opera omnia, Sponius, Lyons, 1663\n* De Consolatione, Venice, 1542\n* HIERONY-||MI CARDANI ME=||DIOLANENSIS MEDICI,|| DE RERVM VARIETATE, LI-||BRI XVII. Iam denuò ab in numeris || mendis summa cura ac studio repur-||gati, & pristino nito-||ri restituti.|| ADIECTVS EST CAPITVM, RE-||rum & sententiarum … || INDEX utilissimus.||, Basel, 1581 [http://nbn-resolving.de/urn:nbn:de:hbz:061:2-30760 Digital edition] by the University and State Library Düsseldorf\n* Synesiorum somniorum omnis generis insomnia explicantes (Book of Dreams)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gerolamo Cardano" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13145" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gerolamo (or Girolamo, or Geronimo) Cardano (; ; ; 24 September 1501 – 21 September 1576) was an Italian polymath, whose interests and proficiencies ranged from being a mathematician, physician, biologist, physicist, chemist, astrologer, astronomer, philosopher, writer, and gambler. He was one of the most influential mathematicians of the Renaissance, and was one of the key figures in the foundation of probability and the earliest introducer of the binomial coefficients and the binomial theorem in the western world. He wrote more than 200 works on science.\n\nCardano partially invented and described several mechanical devices including the combination lock, the gimbal consisting of three concentric rings allowing a supported compass or gyroscope to rotate freely, and the Cardan shaft with universal joints, which allows the transmission of rotary motion at various angles and is used in vehicles to this day. He made significant contributions to hypocycloids, published in De proportionibus, in 1570. The generating circles of these hypocycloids were later named Cardano circles or cardanic circles and were used for the construction of the first high-speed printing presses.\n\nToday, he is well known for his achievements in algebra. He made the first systematic use of negative numbers in Europe, published with attribution the solutions of other mathematicians for the cubic and quartic equations, and acknowledged the existence of imaginary numbers.\n\nEarly life and education \n\nHe was born in Pavia, Lombardy, the illegitimate child of Fazio Cardano, a mathematically gifted jurist, lawyer, a close personal friend of Leonardo da Vinci. In his autobiography, Cardano wrote that his mother, Chiara Micheri, had taken \"various abortive medicines\" to terminate the pregnancy; he was \"taken by violent means from my mother; I was almost dead.\" She was in labour for three days. Shortly before his birth, his mother had to move from Milan to Pavia to escape the Plague; her three other children died from the disease.\n\nAfter a depressing childhood, with frequent illnesses, including impotence, and the rough upbringing by his overbearing father, in 1520, Cardano entered the University of Pavia against his father's wish, who wanted his son to undertake studies of law, but Girolamo felt more attracted to philosophy and science. During the Italian War of 1521-6, however, the authorities in Pavia were forced to close the university in 1524. Cardano resumed his studies at the University of Padua, where he graduated with a doctorate in medicine in 1525. His eccentric and confrontational style did not earn him many friends and he had a difficult time finding work after his studies had ended. In 1525, Cardano repeatedly applied to the College of Physicians in Milan, but was not admitted owing to his combative reputation and illegitimate birth.\n\nEarly career as a physician \n\nCardano wanted to practice medicine in a large, rich city like Milan, but he was denied a license to practice, so he settled for the town of Saccolongo, where he practiced without a license. There, he married Lucia Banderini in 1531. Before her death in 1546, they had three children, Giovanni Battista (1534), Chiara (1537) and Aldo (1543). Cardano later wrote that those were the happiest days of his life.\n\nWith the help of a few noblemen, Cardano obtained a teaching position in mathematics in Milan. Having finally received his medical license, he practiced mathematics and medicine simultaneously, treating a few influential patients in the process. Because of this, he became one of the most sought-after doctors in Milan. In fact, by 1536, he was able to quit his teaching position, although he was still interested in mathematics. His notability in the medical field was such that the aristocracy tried to lure him out of Milan. Cardano later wrote that he turned down offers from the kings of Denmark and France, and the Queen of Scotland.\n\nMathematics \n\nCardano was the first mathematician to make systematic use of numbers less than zero.Isaac Asimov, Asimov on Numbers, published by Pocket Books, a division of Simon & Schuster, 1966, 1977, page 119. He published with attribution the solution of Scipione del Ferro to the cubic equation and the solution of his student Lodovico Ferrari to the quartic equation in his 1545 book Ars Magna. The solution to one particular case of the cubic equation ax^3+bx+c0 (in modern notation), had been communicated to him in 1539 by Niccolò Fontana Tartaglia (who later claimed that Cardano had sworn not to reveal it, and engaged Cardano in a decade-long dispute) in the form of a poem,Katz, Victor J. A History of Mathematics: An Introduction. 3rd ed. Boston: Pearson Education, 2009. Print. but Ferro's solution predated Fontana's. In his exposition, he acknowledged the existence of what are now called imaginary numbers, although he did not understand their properties, described for the first time by his Italian contemporary Rafael Bombelli. In Opus novum de proportionibus he introduced the binomial coefficients and the binomial theorem.\n\nCardano was notoriously short of money and kept himself solvent by being an accomplished gambler and chess player. His book about games of chance, Liber de ludo aleae (\"Book on Games of Chance\"), written around 1564,In Chapter 20 of Liber de Ludo Aleae he describes a personal experience from 1526 and then adds that \"thirty-eight years have passed\" [elapsis iam annis triginta octo]. This sentence is written by Cardano around 1564, age 63. but not published until 1663, contains the first systematic treatment of probability,Katz, ibid., p. 488 as well as a section on effective cheating methods. He used the game of throwing dice to understand the basic concepts of probability. He demonstrated the efficacy of defining odds as the ratio of favourable to unfavourable outcomes (which implies that the probability of an event is given by the ratio of favourable outcomes to the total number of possible outcomes[http://www.columbia.edu/~pg2113/index_files/Gorroochurn-Some%20Laws.pdf Some laws and problems in classical probability and how Cardano anticipated them Gorrochum, P. Chancemagazine 2012]). He was also aware of the multiplication rule for independent events but was not certain about what values should be multiplied.Katz, ibid., p. 488\n\nOther contributions\n\nCardano's work with hypocycloids led him to the Cardan joint or gear mechanism, in which a pair of gears with the smaller being one-half the size of the larger gear is used converting rotational motion to linear motion with greater efficiency and precision than a Scotch yoke, for example. He is also credited with the invention of the Cardan suspension or gimbal.\n\nCardano made several contributions to hydrodynamics and held that perpetual motion is impossible, except in celestial bodies. He published two encyclopedias of natural science which contain a wide variety of inventions, facts, and occult superstitions. He also introduced the Cardan grille, a cryptographic writing tool, in 1550.\n\nSomeone also assigned to Cardano the credit for the invention of the so-called Cardano's Rings, also called Chinese Rings, but it is very probable that they predate Cardano.\n\nSignificantly, in the history of education of the deaf, he said that deaf people were capable of using their minds, argued for the importance of teaching them, and was one of the first to state that deaf people could learn to read and write without learning how to speak first. He was familiar with a report by Rudolph Agricola about a deaf mute who had learned to write.\n\nDe Subtilitate (1550) \n\nAs quoted from Charles Lyell's Principles of Geology:\n\nThe title of a work of Cardano's, published in 1552, De Subtilitate (corresponding to what would now be called transcendental philosophy), would lead us to expect, in the chapter on minerals, many far fetched theories characteristic of that age; but when treating of petrified shells, he decided that they clearly indicated the former sojourn of the sea upon the mountains.Charles Lyell, [https://books.google.com/books?id=mmIOAAAAQAAJ& Principles of Geology], 1832, p.29\n\nLater years and death \n\nTwo of Cardano's children—Giovanni and Aldo Battista—came to ignoble ends. Giovanni Battista, Cardano's eldest and favorite son, was tried and beheaded in 1560 for poisoning his wife, after he discovered that their three children were not his. Aldo Battista was a gambler, who stole money from his father, and so Gerolamo disinherited Aldo in 1569.\n\nCardano moved from Pavia to Bologna, in part because he believed that the decision to execute Giovanni was influenced by Gerolamo's battles with the academic establishment in Pavia, and his colleagues' jealousy at his scientific achievements and also because he was beset with allegations of sexual impropriety with his students. Cardano was arrested by the Inquisition in 1570 for unknown reasons, and forced to spend several months in prison and abjure his professorship. He moved to Rome, and received a lifetime annuity from Pope Gregory XIII (after first having been rejected by Pope Pius V) and finished his autobiography. He was accepted in the Royal College of Physicians, and as well as practising medicine he continued his philosophical studies until his death in 1576. Cardano is reported to have correctly predicted the exact date of his own death but it has been claimed that he achieved this by committing suicide.\n\nReferences in literature \n\nThe seventeenth century English physician and philosopher Sir Thomas Browne once possessed the ten volumes of the Leyden 1663 edition of the complete works of Cardan in his library.A Facsimile of the 1711 Sales Auction Catalogue of Sir Thomas Browne and his son Edward's Libraries. Introduction, notes and index by J.S. Finch (E.J. Brill: Leiden, 1986)\n\nBrowne critically viewed Cardan as:\n\n\"that famous Physician of Milan, a great Enquirer of Truth, but too greedy a Receiver of it. He hath left many excellent Discourses, Medical, Natural, and Astrological; the most suspicious are those two he wrote by admonition in a dream, that is De Subtilitate & Varietate Rerum. Assuredly this learned man hath taken many things upon trust, and although examined some, hath let slip many others. He is of singular use unto a prudent Reader; but unto him that only desireth , or to replenish his head with varieties; like many others before related, either in the Original or confirmation, he may become no small occasion of Error.\"Pseudodoxia Epidemica Bk 1: chapter 8 no. 13\n\nRichard Hinckley Allen tells of an amusing reference made by Samuel Butler in his book Hudibras:\n\nCardan believ'd great states depend\nUpon the tip o'th' Bear's tail's end;\nThat, as she wisk'd it t'wards the Sun,\nStrew'd mighty empires up and down;\nWhich others say must needs be false,\nBecause your true bears have no tails.\n\nAlessandro Manzoni's novel I Promessi Sposi portrays a pedantic scholar of the obsolete, Don Ferrante, as a great admirer of Cardano. Significantly, he values him only for his superstitious and astrological writings; his scientific writings are dismissed because they contradict Aristotle, but excused on the ground that the author of the astrological works deserves to be listened to even when he is wrong.\n\nEnglish novelist E. M. Forster's Abinger Harvest, a 1936 volume of essays, authorial reviews and a play, provides a sympathetic treatment of Cardano in the section titled 'The Past'. Forster believes Cardano was so absorbed in \"self-analysis that he often forgot to repent of his bad temper, his stupidity, his licentiousness, and love of revenge\" (212).\n\nWorks \n\n* De malo recentiorum medicorum usu libellus, Venice, 1536 (on medicine).\n* Practica arithmetice et mensurandi singularis, Milan, 1577 (on mathematics).\n* Artis magnae, sive de regulis algebraicis (also known as Ars magna), Nuremberg, 1545 (on algebra).[http://www.filosofia.unimi.it/cardano/testi/operaomnia/vol_4_s_4.pdf] An electronic copy of his book Ars Magna (in Latin)\n* De immortalitate animorum, 1545.\n* [http://archimedes.mpiwg-berlin.mpg.de/cgi-bin/toc/toc.cgi?dircarda_propo_015_la_1570;step\nthumb Opus novum de proportionibus] (on mechanics) (Archimedes Project).\n* Contradicentium medicorum (on medicine).\n* De subtilitate rerum, Nuremberg, Johann Petreius, 1550 (on natural phenomena).\n* De libris propriis, Leiden, 1557 (commentaries).\n* Metoposcopia libris tredecim, et octingentis faciei humanae eiconibus complexa, 1558 (publ. post. 1658, Paris)\n* De varietate rerum, Basle, Heinrich Petri, 1559 (on natural phenomena).\n* Neronis encomium, Basle, 1562.\n* De Methodo medendi, 1565\n* Opus novum de proportionibus numerorum, motuum, ponderum, sonorum, aliarumque rerum mensurandarum. Item de aliza regula, Basel, 1570.\n* De vita propria, 1576 (autobiography); a later edition, [https://books.google.com/books?idblA9AAAAcAAJ&source\ngbs_navlinks_s De Propria Vita Liber, Amsterdam, (1654)]\n* Liber de ludo aleae, (\"On Casting the Die\"),p. 963, Jan Gullberg, Mathematics from the birth of numbers, W. W. Norton & Company;   posthumously published in 1663 (on probability).\n* De Musica, ca 1546 (on music theory), posthumously published in Hieronymi Cardani Mediolensis opera omnia, Sponius, Lyons, 1663\n* De Consolatione, Venice, 1542\n* HIERONY-||MI CARDANI ME=||DIOLANENSIS MEDICI,|| DE RERVM VARIETATE, LI-||BRI XVII. Iam denuò ab in numeris || mendis summa cura ac studio repur-||gati, & pristino nito-||ri restituti.|| ADIECTVS EST CAPITVM, RE-||rum & sententiarum … || INDEX utilissimus.||, Basel, 1581 [http://nbn-resolving.de/urn:nbn:de:hbz:061:2-30760 Digital edition] by the University and State Library Düsseldorf\n* Synesiorum somniorum omnis generis insomnia explicantes (Book of Dreams). Gerolamo Cardano. http://en.wikipedia.org/?curid=13145."
  }
}
