{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3135",
  "eid" : "c4569de0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778409150,
  "textBody" : "Arteriovenous malformation (AVM) is an abnormal connection between arteries and veins, bypassing the capillary system. This vascular anomaly is widely known because of its occurrence in the central nervous system (usually cerebral AVM), but can appear in any location. Although many AVMs are asymptomatic, they can cause intense pain or bleeding or lead to other serious medical problems.\n\nAVMs are usually congenital and belong to the RASopathies.\nThe genetic transmission patterns of AVM, if any, are unknown. AVM is not generally thought to be an inherited disorder, unless in the context of a specific hereditary syndrome.\n\nSigns and symptoms \n\nSymptoms of AVM vary according to the location of the malformation. Roughly 88%[http://www.ninds.nih.gov/disorders/avms/detail_avms.htm#102083052 National Institute of Neurological Disorders and Stroke] of people with an AVM are asymptomatic; often the malformation is discovered as part of an autopsy or during treatment of an unrelated disorder (called in medicine an \"incidental finding\"); in rare cases, its expansion or a micro-bleed from an AVM in the brain can cause epilepsy, neurological deficit, or pain.\n\nThe most general symptoms of a cerebral AVM include headaches and epileptic seizures, with more specific symptoms occurring that normally depend on the location of the malformation and the individual. Such possible symptoms include:\n\n* Difficulties with movement coordination, including muscle weakness and even paralysis;\n* Vertigo (dizziness);\n* Difficulties of speech (dysarthria) and communication, such as aphasia;\n* Difficulties with everyday activities, such as apraxia;\n* Abnormal sensations (numbness, tingling, or spontaneous pain);\n* Memory and thought-related problems, such as confusion, dementia or hallucinations.\n\nCerebral AVMs may present themselves in a number of different ways:\n\n*Bleeding (45% of cases)\n*Acute onset of severe headache. May be described as the worst headache of the patient's life. Depending on the location of bleeding, may be associated with new fixed neurologic deficit. In unruptured brain AVMs, the risk of spontaneous bleeding may be as low as 1% per year. After a first rupture, the annual bleeding risk may increase to more than 5%.\n*Seizure or brain seizure (46%) Depending on the place of the AVM, it can cause loss of vision in one place.\n*Headache (34%)\n*Progressive neurologic deficit (21%)\n**May be caused by mass effect or venous dilatations. Presence and nature of the deficit depend on location of lesion and the draining veins.\n*Pediatric patients\n**Heart failure\n**Macrocephaly\n**Prominent scalp veins\n\nPulmonary arteriovenous malformations \n\nIn the lungs, pulmonary arteriovenous malformations have no symptoms in up to 29% of all cases.\n\nGenetics \n\nCan occur due to autosomal dominant diseases, such as hereditary hemorrhagic telangiectasia.\n\nPathophysiology\n\nArteries and veins are part of the human cardiovascular system. Arteries carry blood away from the heart to the lungs or the rest of the body, where the blood passes through capillaries, and veins return the blood to the heart. An AVM interferes with this process by forming a direct connection of the arteries and veins. AVMs can cause intense pain and lead to serious medical problems. Although AVMs are often associated with the brain and spinal cord, they can develop in any part of the body.\n\nNormally, the arteries in the vascular system carry oxygen-rich blood, except in the case of the pulmonary artery. Structurally, arteries divide and sub-divide repeatedly, eventually forming a sponge-like capillary bed. Blood moves through the capillaries, giving up oxygen and taking up waste products, including , from the surrounding cells. Capillaries in turn successively join together to form veins that carry blood away. The heart acts to pump blood through arteries and uptake the venous blood.\n\nAn AVM lacks the dampening effect of capillaries on the blood flow, which means that the AVM can get progressively larger over time as the amount of blood flowing through it increases, forcing the heart to work harder to keep up with the extra blood flow. It also causes the surrounding area to be deprived of the functions of the capillaries—removal of  and delivery of nutrients to the cells. The resulting tangle of blood vessels, often called a nidus (Latin for \"nest\"), has no capillaries. It can be extremely fragile and prone to bleeding because of the abnormally direct connections between high-pressure arteries and low-pressure veins. The resultant sign, audible via stethoscope, is a rhythmic, whooshing sound caused by excessively rapid blood flow through the arteries and veins. It has been given the term \"bruit\", French for noise. On some occasions, a patient with a brain AVM may become aware of the noise, which can compromise hearing and interfere with sleep in addition to causing psychological distress.\n\nDiagnosis\n\nAVMs are diagnosed primarily by the following methods:\n* Computerized tomography (CT) scan is a noninvasive X-ray to view the anatomical structures within the brain to detect blood in or around the brain. A newer technology called CT angiography involves the injection of contrast into the blood stream to view the arteries of the brain. This type of test provides the best pictures of blood vessels through angiography and soft tissues through CT.\n* Magnetic resonance imaging (MRI) scan is a noninvasive test, which uses a magnetic field and radio-frequency waves to give a detailed view of the soft tissues of the brain. \n* Magnetic resonance angiography (MRA) – scans created using magnetic resonance imaging to specifically image the blood vessels and structures of the brain. A magnetic resonance angiogram can be an invasive procedure, involving the introduction of contrast dyes (e.g., gadolinium MR contrast agents) into the vasculature of a patient using a catheter inserted into an artery and passed through the blood vessels to the brain. Once the catheter is in place, the contrast dye is injected into the bloodstream and the MR images are taken.  Additionally or alternatively, flow-dependent or other contrast-free magnetic resonance imaging techniques can be used to determine the location and other properties of the vasculature.\n\nAVMs can occur in various parts of the body:\n* brain (cerebral AV malformation)  \n* spleen\n* lung\n* kidney\n* spinal cord\n* liver\n* intercostal space\n* iris\n* spermatic cord\n*extremities – arm, shoulder, etc.\n\nAVMs may occur in isolation or as a part of another disease (for example, Von Hippel-Lindau disease or hereditary hemorrhagic telangiectasia).\n\nAVMs have been shown to be associated with aortic stenosis.\n\nBleeding from an AVM can be relatively mild or devastating. It can cause severe and less often fatal strokes. If a cerebral AVM is detected before a stroke occurs, usually the arteries feeding blood into the nidus can be closed off to avert the danger. However, interventional therapy may also be relatively risky. \n\nTreatment \n\nTreatment for brain AVMs can be symptomatic, and patients should be followed by a neurologist for any seizures, headaches, or focal neurologic deficits. AVM-specific treatment may also involve endovascular embolization, neurosurgery or radiosurgery.\nEmbolization, that is, cutting off the blood supply to the AVM with coils, particles, acrylates, or polymers introduced by a radiographically guided catheter, may be used in addition to neurosurgery or radiosurgery, but is rarely successful in isolation except in smaller AVMs. Gamma knife may also be used.http://www.muh.org.au/ServicesSpecialties/GammaKnife/ForPatients/ConditionsWeTreat.aspx\n\nEpidemiology \n\nThe estimated detection rate of AVM in the US general population is 1.4/100,000 per year. This is approximately one fifth to one seventh the incidence of intracranial aneurysms. An estimated 300,000 Americans have AVMs, of whom 12% (approximately 36,000) will exhibit symptoms of greatly varying severity.\n\nHistory\n\nEmmanuel, Luschka, and Virchow first described arteriovenous malformations in the mid-1800s. Olivecrona performed the first surgical excision of an intracranial AVM in 1932.\n\nSociety and culture \n\nNotable cases \n\n*Phoenix Suns point guard AJ Price nearly died from AVM in 2004 while a student at the University of Connecticut.\n*On December 13, 2006, Senator Tim Johnson of South Dakota was diagnosed with AVM and treated at George Washington University Hospital.\n*On August 3, 2011, Mike Patterson of the Philadelphia Eagles collapsed on the field and suffered a seizure during a practice. After he collapsed, Patterson was rushed to the hospital where he was diagnosed with AVM.[https://www.sbnation.com/2011/8/4/2343821/mike-patterson-collapse-eagles-practice \"Mike Patterson's Collapse Reportedly Related To Brain AVM\"]\n*Actor Ricardo Montalbán was born with spinal AVM.[https://www.youtube.com/watch?v=x39-hR5rGlc \"Ricardo Montalban tribute\"] YouTube, acceptance speech video of Easter Seals Lifetime Achievement Award During the filming of the 1951 film Across the Wide Missouri, Montalbán was thrown from his horse, knocked unconscious, and trampled by another horse which aggravated his AVM and resulted in a painful back injury that never healed. The pain increased as he aged, and in 1993, Montalbán underwent 9½ hours of spinal surgery which left him paralyzed below the waist and using a wheelchair.[http://www.mahalo.com/Ricardo_Montalban Mahalo Answers: Ricardo Montalban]\n*Actor/comedian T. J. Miller was diagnosed with AVM after filming Yogi Bear in New Zealand in 2010; Miller described his experience with the disease on the Pete Holmes podcast You Made It Weird on October 28, 2011, shedding his comedian side for a moment and becoming more philosophical, narrating his behaviors and inability to sleep during that time. He suffered a seizure upon return to Los Angeles and successfully underwent surgery that had a mortality rate of ten percent.\n*Jazz guitarist Pat Martino experienced an AVM and subsequently developed amnesia and manic depression. He eventually re-learned to play the guitar by listening to his own recordings from before the aneurysm. He still records and performs to this day.Vida, Vendela. Confidence, or the Appearance of Confidence: The Best of the Believer Music Interviews. No ed. San Francisco, Calif.: Believer, a Tiny Division of McSweeney's Which Is Also Tiny, 2014. Print.\n*YouTube vlogger Nikki Lilly (Nikki Christou), winner of the 2016 season of Junior Bake Off was born with AVM, which has resulted in some facial disfigurement.\n*Composer and lyricist William Finn was diagnosed with AVM and underwent Gamma Knife surgery in September 1992, soon after he won the 1992 Tony Award for best musical, awarded to \"Falsettos\". https://www.nytimes.com/1998/06/14/magazine/the-long-running-musical-of-william-finn-s-life.html?ref=williamfinn\n\nMedia\n\n* In the ninth season of Dynasty, Krystle Carrington suffered from AVM and went into a coma after unsuccessful surgery.\n*Six Feet Under, an American television series that ran on HBO from 2001–2005, featured a protagonist, Nate Fisher, who suffered from AVM, a recurring feature in the storyline of this character.\n*In the episode \"DNR\" of the TV series House M.D., the patient was finally diagnosed with an AVM.\n*In the episode \"Save Me\" of season 1 of the TV series Grey's Anatomy, a psychic was diagnosed with an AVM in his left temporal lobe.\n\nResearch\n\nDespite many years of research, the central question of whether to treat AVMs has not been answered. All treatments, whether involving surgery, radiation, or drugs, have risks and side-effects. Therefore, it might be better in some cases to avoid treatment altogether and simply accept a small risk of coming to harm from the AVM itself. This question is currently being addressed in clinical trials.[http://www.cliniclog.com/arterio-venous_malformations.php Research trials in arterio-venous malformations; Rustam Al-Shahi Salman]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Arteriovenous malformation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3135" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Arteriovenous malformation (AVM) is an abnormal connection between arteries and veins, bypassing the capillary system. This vascular anomaly is widely known because of its occurrence in the central nervous system (usually cerebral AVM), but can appear in any location. Although many AVMs are asymptomatic, they can cause intense pain or bleeding or lead to other serious medical problems.\n\nAVMs are usually congenital and belong to the RASopathies.\nThe genetic transmission patterns of AVM, if any, are unknown. AVM is not generally thought to be an inherited disorder, unless in the context of a specific hereditary syndrome.\n\nSigns and symptoms \n\nSymptoms of AVM vary according to the location of the malformation. Roughly 88%[http://www.ninds.nih.gov/disorders/avms/detail_avms.htm#102083052 National Institute of Neurological Disorders and Stroke] of people with an AVM are asymptomatic; often the malformation is discovered as part of an autopsy or during treatment of an unrelated disorder (called in medicine an \"incidental finding\"); in rare cases, its expansion or a micro-bleed from an AVM in the brain can cause epilepsy, neurological deficit, or pain.\n\nThe most general symptoms of a cerebral AVM include headaches and epileptic seizures, with more specific symptoms occurring that normally depend on the location of the malformation and the individual. Such possible symptoms include:\n\n* Difficulties with movement coordination, including muscle weakness and even paralysis;\n* Vertigo (dizziness);\n* Difficulties of speech (dysarthria) and communication, such as aphasia;\n* Difficulties with everyday activities, such as apraxia;\n* Abnormal sensations (numbness, tingling, or spontaneous pain);\n* Memory and thought-related problems, such as confusion, dementia or hallucinations.\n\nCerebral AVMs may present themselves in a number of different ways:\n\n*Bleeding (45% of cases)\n*Acute onset of severe headache. May be described as the worst headache of the patient's life. Depending on the location of bleeding, may be associated with new fixed neurologic deficit. In unruptured brain AVMs, the risk of spontaneous bleeding may be as low as 1% per year. After a first rupture, the annual bleeding risk may increase to more than 5%.\n*Seizure or brain seizure (46%) Depending on the place of the AVM, it can cause loss of vision in one place.\n*Headache (34%)\n*Progressive neurologic deficit (21%)\n**May be caused by mass effect or venous dilatations. Presence and nature of the deficit depend on location of lesion and the draining veins.\n*Pediatric patients\n**Heart failure\n**Macrocephaly\n**Prominent scalp veins\n\nPulmonary arteriovenous malformations \n\nIn the lungs, pulmonary arteriovenous malformations have no symptoms in up to 29% of all cases.\n\nGenetics \n\nCan occur due to autosomal dominant diseases, such as hereditary hemorrhagic telangiectasia.\n\nPathophysiology\n\nArteries and veins are part of the human cardiovascular system. Arteries carry blood away from the heart to the lungs or the rest of the body, where the blood passes through capillaries, and veins return the blood to the heart. An AVM interferes with this process by forming a direct connection of the arteries and veins. AVMs can cause intense pain and lead to serious medical problems. Although AVMs are often associated with the brain and spinal cord, they can develop in any part of the body.\n\nNormally, the arteries in the vascular system carry oxygen-rich blood, except in the case of the pulmonary artery. Structurally, arteries divide and sub-divide repeatedly, eventually forming a sponge-like capillary bed. Blood moves through the capillaries, giving up oxygen and taking up waste products, including , from the surrounding cells. Capillaries in turn successively join together to form veins that carry blood away. The heart acts to pump blood through arteries and uptake the venous blood.\n\nAn AVM lacks the dampening effect of capillaries on the blood flow, which means that the AVM can get progressively larger over time as the amount of blood flowing through it increases, forcing the heart to work harder to keep up with the extra blood flow. It also causes the surrounding area to be deprived of the functions of the capillaries—removal of  and delivery of nutrients to the cells. The resulting tangle of blood vessels, often called a nidus (Latin for \"nest\"), has no capillaries. It can be extremely fragile and prone to bleeding because of the abnormally direct connections between high-pressure arteries and low-pressure veins. The resultant sign, audible via stethoscope, is a rhythmic, whooshing sound caused by excessively rapid blood flow through the arteries and veins. It has been given the term \"bruit\", French for noise. On some occasions, a patient with a brain AVM may become aware of the noise, which can compromise hearing and interfere with sleep in addition to causing psychological distress.\n\nDiagnosis\n\nAVMs are diagnosed primarily by the following methods:\n* Computerized tomography (CT) scan is a noninvasive X-ray to view the anatomical structures within the brain to detect blood in or around the brain. A newer technology called CT angiography involves the injection of contrast into the blood stream to view the arteries of the brain. This type of test provides the best pictures of blood vessels through angiography and soft tissues through CT.\n* Magnetic resonance imaging (MRI) scan is a noninvasive test, which uses a magnetic field and radio-frequency waves to give a detailed view of the soft tissues of the brain. \n* Magnetic resonance angiography (MRA) – scans created using magnetic resonance imaging to specifically image the blood vessels and structures of the brain. A magnetic resonance angiogram can be an invasive procedure, involving the introduction of contrast dyes (e.g., gadolinium MR contrast agents) into the vasculature of a patient using a catheter inserted into an artery and passed through the blood vessels to the brain. Once the catheter is in place, the contrast dye is injected into the bloodstream and the MR images are taken.  Additionally or alternatively, flow-dependent or other contrast-free magnetic resonance imaging techniques can be used to determine the location and other properties of the vasculature.\n\nAVMs can occur in various parts of the body:\n* brain (cerebral AV malformation)  \n* spleen\n* lung\n* kidney\n* spinal cord\n* liver\n* intercostal space\n* iris\n* spermatic cord\n*extremities – arm, shoulder, etc.\n\nAVMs may occur in isolation or as a part of another disease (for example, Von Hippel-Lindau disease or hereditary hemorrhagic telangiectasia).\n\nAVMs have been shown to be associated with aortic stenosis.\n\nBleeding from an AVM can be relatively mild or devastating. It can cause severe and less often fatal strokes. If a cerebral AVM is detected before a stroke occurs, usually the arteries feeding blood into the nidus can be closed off to avert the danger. However, interventional therapy may also be relatively risky. \n\nTreatment \n\nTreatment for brain AVMs can be symptomatic, and patients should be followed by a neurologist for any seizures, headaches, or focal neurologic deficits. AVM-specific treatment may also involve endovascular embolization, neurosurgery or radiosurgery.\nEmbolization, that is, cutting off the blood supply to the AVM with coils, particles, acrylates, or polymers introduced by a radiographically guided catheter, may be used in addition to neurosurgery or radiosurgery, but is rarely successful in isolation except in smaller AVMs. Gamma knife may also be used.http://www.muh.org.au/ServicesSpecialties/GammaKnife/ForPatients/ConditionsWeTreat.aspx\n\nEpidemiology \n\nThe estimated detection rate of AVM in the US general population is 1.4/100,000 per year. This is approximately one fifth to one seventh the incidence of intracranial aneurysms. An estimated 300,000 Americans have AVMs, of whom 12% (approximately 36,000) will exhibit symptoms of greatly varying severity.\n\nHistory\n\nEmmanuel, Luschka, and Virchow first described arteriovenous malformations in the mid-1800s. Olivecrona performed the first surgical excision of an intracranial AVM in 1932.\n\nSociety and culture \n\nNotable cases \n\n*Phoenix Suns point guard AJ Price nearly died from AVM in 2004 while a student at the University of Connecticut.\n*On December 13, 2006, Senator Tim Johnson of South Dakota was diagnosed with AVM and treated at George Washington University Hospital.\n*On August 3, 2011, Mike Patterson of the Philadelphia Eagles collapsed on the field and suffered a seizure during a practice. After he collapsed, Patterson was rushed to the hospital where he was diagnosed with AVM.[https://www.sbnation.com/2011/8/4/2343821/mike-patterson-collapse-eagles-practice \"Mike Patterson's Collapse Reportedly Related To Brain AVM\"]\n*Actor Ricardo Montalbán was born with spinal AVM.[https://www.youtube.com/watch?v=x39-hR5rGlc \"Ricardo Montalban tribute\"] YouTube, acceptance speech video of Easter Seals Lifetime Achievement Award During the filming of the 1951 film Across the Wide Missouri, Montalbán was thrown from his horse, knocked unconscious, and trampled by another horse which aggravated his AVM and resulted in a painful back injury that never healed. The pain increased as he aged, and in 1993, Montalbán underwent 9½ hours of spinal surgery which left him paralyzed below the waist and using a wheelchair.[http://www.mahalo.com/Ricardo_Montalban Mahalo Answers: Ricardo Montalban]\n*Actor/comedian T. J. Miller was diagnosed with AVM after filming Yogi Bear in New Zealand in 2010; Miller described his experience with the disease on the Pete Holmes podcast You Made It Weird on October 28, 2011, shedding his comedian side for a moment and becoming more philosophical, narrating his behaviors and inability to sleep during that time. He suffered a seizure upon return to Los Angeles and successfully underwent surgery that had a mortality rate of ten percent.\n*Jazz guitarist Pat Martino experienced an AVM and subsequently developed amnesia and manic depression. He eventually re-learned to play the guitar by listening to his own recordings from before the aneurysm. He still records and performs to this day.Vida, Vendela. Confidence, or the Appearance of Confidence: The Best of the Believer Music Interviews. No ed. San Francisco, Calif.: Believer, a Tiny Division of McSweeney's Which Is Also Tiny, 2014. Print.\n*YouTube vlogger Nikki Lilly (Nikki Christou), winner of the 2016 season of Junior Bake Off was born with AVM, which has resulted in some facial disfigurement.\n*Composer and lyricist William Finn was diagnosed with AVM and underwent Gamma Knife surgery in September 1992, soon after he won the 1992 Tony Award for best musical, awarded to \"Falsettos\". https://www.nytimes.com/1998/06/14/magazine/the-long-running-musical-of-william-finn-s-life.html?ref=williamfinn\n\nMedia\n\n* In the ninth season of Dynasty, Krystle Carrington suffered from AVM and went into a coma after unsuccessful surgery.\n*Six Feet Under, an American television series that ran on HBO from 2001–2005, featured a protagonist, Nate Fisher, who suffered from AVM, a recurring feature in the storyline of this character.\n*In the episode \"DNR\" of the TV series House M.D., the patient was finally diagnosed with an AVM.\n*In the episode \"Save Me\" of season 1 of the TV series Grey's Anatomy, a psychic was diagnosed with an AVM in his left temporal lobe.\n\nResearch\n\nDespite many years of research, the central question of whether to treat AVMs has not been answered. All treatments, whether involving surgery, radiation, or drugs, have risks and side-effects. Therefore, it might be better in some cases to avoid treatment altogether and simply accept a small risk of coming to harm from the AVM itself. This question is currently being addressed in clinical trials.[http://www.cliniclog.com/arterio-venous_malformations.php Research trials in arterio-venous malformations; Rustam Al-Shahi Salman]. Arteriovenous malformation. http://en.wikipedia.org/?curid=3135."
  }
}
