{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7162",
  "eid" : "e01742f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778455711,
  "textBody" : "Tramlink is a light rail tram system serving Croydon and surrounding areas in South London, England. It began operation in 2000,  the first tram system in London since 1952. It is owned by London Trams, an arm of Transport for London (TfL), and operated by FirstGroup.\n\nThe network consists of 39 stops along 28 km of track, on a mixture of street track shared with other traffic, dedicated track in public roads, and off-street track consisting of new rights-of-way, former railway lines, and one right-of-way where the Tramlink track parallels a third rail-electrified Network Rail line.\n\nThe network has four lines that coincide in central Croydon, with eastbound termini at Beckenham Junction, Elmers End and New Addington, and a westbound terminus at Wimbledon, where there is an interchange for London Underground. The Tramlink is the fourth-busiest light rail network in the UK behind Manchester Metrolink, Tyne and Wear Metro and the Docklands Light Railway.\n\nHistory\n\nConstruction\n\nIn 1990 Croydon Council with London Regional Transport (LRT) put the project to Parliament and the Croydon Tramlink Act 1994 resulted, which gave LRT the power to build and run Tramlink.\n\nIn 1996 Tramtrack Croydon Limited (TCL) won a 99-year Private Finance Initiative (PFI) contract to design, build, operate and maintain Tramlink. TCL was a partnership comprising FirstGroup, Bombardier Transportation (the builders of the system's trams), Sir Robert McAlpine and Amey (who built the system), and Royal Bank of Scotland and 3i (who arranged the finances). TCL kept the revenue generated by Tramlink and LRT had to pay compensation to TCL for any changes to the fares and ticketing policy introduced later.\n\nTCL subcontracted operations to CentreWest Buses.\n\nOne of the factors leading to its creation was that the London Borough of Croydon has no London Underground service.\n\nFormer lines reused\n\nThere are four routes: Route 1 – Elmers End to Croydon; Route 2 – Beckenham Junction to Croydon; Route 3 – New Addington to Wimbledon; and Route 4 – Elmers End to Wimbledon.\nRoute 2 runs parallel to the Crystal Palace to Beckenham Junction line of the Southern network between Birkbeck and Beckenham Junction – the National Rail track had been singled some years earlier.\n\nFrom Elmers End to Woodside, route 1 and route 4 (and route 2 from Arena) follow the former British Rail branch line to Addiscombe, then diverge to reach Addiscombe tram stop, 500 m east of the demolished Addiscombe railway station. At Woodside the old station buildings stand disused, and the original platforms have been replaced by accessible low platforms.\n\nFrom Woodside to near Sandilands (routes 1, 2 and 4) and from near Sandilands almost to Lloyd Park (route 3), Tramlink follows the former Woodside and South Croydon Railway, including the Park Hill (or Sandilands) tunnels.\n\nThe section of Route 3 between Wimbledon and West Croydon mostly follows the single-track British Rail route, closed on 31 May 1997 so that it could be converted for Tramlink. Within this section, from near Phipps Bridge to near Reeves Corner, route 3 follows the Surrey Iron Railway, giving Tramlink a claim to one of the world's oldest railway alignments –  beside Mitcham tram stop had its name long before Tramlink. A partial obstruction near this point (reinforcement to a retaining wall below a car park) has necessitated the use of interlaced track.\n\nA Victorian footbridge beside Waddon New Road was dismantled to make way for the flyover over the West Croydon to Sutton railway line. The footbridge has been re-erected at Corfe Castle station on the Swanage Railway (although some evidence suggests that this was a similar footbridge removed from the site of Merton Park Railway Station).\n\nBuyout by Transport for London\n\nIn March 2008, TfL announced that it had reached agreement to buy TCL for £98m. The purchase was finalised on 28 June 2008.[https://www.tfl.gov.uk/cdn/static/cms/documents/annual-report-and-statement-of-accounts-2008-09.pdf AnnualAccounts for year ended 31 March 2008] Transport for London page 158 The background to this purchase relates to the requirement that TfL (who took over from London Regional Transport in 2000) compensates TCL for the consequences of any changes to the fares and ticketing policy introduced since 1996. In 2007 that payment was £4m, with an annual increase in rate.\n\nIn October 2008 TfL introduced a new livery, using the blue, white and green of the routes on TfL maps, to distinguish the trams from buses operating in the area. The colour of the cars was changed to green, and the brand name was changed from Croydon Tramlink to simply Tramlink. These refurbishments were completed in early 2009.\n\nCurrent system\n\nStops\n\nThe tram stops have low platforms, 35 cm above rail level. They are unstaffed and have automated ticket machines. In general, access between the platforms involves crossing the tracks by pedestrian level crossing.\nThere are 39 stops, most being  long. They are virtually level with the doors and are all wider than 2 m. This allows wheelchairs, prams, pushchairs and the elderly to board the tram easily with no steps. In street sections, the stop is integrated with the pavement.\n\nTramlink uses some former main-line stations on the Wimbledon–West Croydon and Elmers End–Coombe Lane stretches of line. The railway platforms have been demolished and rebuilt to Tramlink specifications, except at Elmers End and Wimbledon where the track level was raised to meet the higher main-line platforms to enable cross-platform interchange.\n\nThirty-eight stops opened in the phased introduction of tram services in May 2000. Centrale tram stop in Tamworth Road opened on 10 December 2005, increasing journey times slightly. As turnround times were already quite tight this raised the issue of buying an extra tram to maintain punctuality. Partly for this reason but also to take into account the planned restructuring of services (subsequently introduced in July 2006), TfL issued tenders for a new tram. However, nothing resulted from this.\n\nAll stops have disabled access, raised paving, CCTV, a Passenger Help Point, a Passenger Information Display (PID), litter bins, a ticket machine, a noticeboard and lamp-posts, and most also have seats and a shelter.\n\nThe PIDs display the destinations and expected arrival times of the next two trams. They can also display any message the controllers want to display, such as information on delays or even instructions to vandals to stop placing objects on the track.\n\nRoutes\n\nSince 1 June 2016 Tramlink has been shown on the principal tube map, having previously appeared only on the \"London Connections\" map. The original routes were Line 1 Wimbledon to Elmers End, Line 2 Croydon to Beckenham Junction, and Line 3 Croydon to New Addington.Tramlink: Your top 10 questions answered… Poster, 1995. On 23 July 2006 the network was restructured, with route 1 from Elmers End to Croydon, route 2 from Beckenham Junction to Croydon and route 3 from New Addington to Wimbledon. In June 2012 route 4 from Therapia Lane to Elmers End was introduced. On Monday 4 April 2016, route 4 was extended from Therapia Lane to Wimbledon.\n\nFuture changes\n\nIn 2017, plans to change the tram routes and timetables for more reliable and even services were consulted on with the aim of introducing these changes in early 2018.http://www.croydonguardian.co.uk/news/15688614.Changes_coming_to_tram_timetable__Here_s_what_you_need_to_know/ These would result in three routes:\n* New Addington to West Croydon, returning to New Addington every 6/7 minutes.\n* Wimbledon to Beckenham Junction every 10 minutes\n* Wimbledon to Elmers End every 10 minutes\n\nAdditionally, the first two trams from New Addington will run to Wimbledon. Overall, this would result in a decrease in 2tph leaving Elmers End, resulting in a 25% decrease in capacity here, and 14% in the Addiscombe area.https://insidecroydon.com/2017/10/14/even-westfield-now-agree-theres-no-need-for-28m-tram-loop/ However, this would also regulate waiting times in this area and on the Wimbledon branch to every 5 minutes, from every 2-7 minutes.http://www.croydonguardian.co.uk/news/15688614.Changes_coming_to_tram_timetable__Here_s_what_you_need_to_know/\n\nChange in route colours\n\nWhen TfL took over a new network map was designed, combining Routes 1 and 2 as one service, coloured \"Trams Green\" (lime). (Originally, Line 1 was yellow, Line 2 red, and Line 3 a darker (District line) green.) Trams from Elmers End on Route 1 used to change their numbers in central Croydon to Route 2 (Beckenham Junction) and the reverse in the other direction, but this has changed in light of the introduction of Route 4.\n\nFares and ticketing\n\nTfL Bus Passes are valid on Tramlink, as are Travelcards that include any of zones 3, 4, 5 and 6.\n\nCash fares and pay-as-you-go Oyster Card fares are the same as on London Buses, although special fares may apply when using Tramlink feeder buses.\n\nWhen using Oyster Cards, passengers must touch in on the platform before boarding the tram. Special arrangements apply at Wimbledon station, where the Tramlink stop is within the National Rail and London Underground station, where Tramlink passenger must touch in at the station entry barriers then again at the Tramlink platform to inform the system that no tube journey has been made.\n\nFeeder buses\n\nBus routes T31, T32 and T33 used to connect with Tramlink at the New Addington, Fieldway and Addington Village stops. T31 and T32 no longer run, and T33 has been renamed 433.\n\nRolling stock\n\nTramlink is operated with 34 passenger vehicles. The original fleet comprised 24 articulated low floor Flexity Swift CR4000 trams built by Bombardier Transportation in Vienna numbered beginning at 2530, continuing from the highest-numbered tram 2529 on London's former tram network, which closed in 1952. In 2006, the CR4000 fleet was refurbished, with the bus-like destination blinds being replaced by an electronic dot system. In 2009 the fleet was repainted into a new green livery.\n\nIn January 2011, Tramtrack Croydon opened a tender for the supply of ten new or second-hand trams from the end of summer 2011. The trams will be used between Therapia Lane and Elmers End.Rail Magazine page 16, 'News in Brief – New Trams for Croydon' Issue 663, 9th – 22 February 2011 On 18 August 2011, TfL announced that Stadler Rail had won a $19.75 million contract to supply six Variobahn trams similar to those used by Bybanen in Bergen, Norway. They entered service in 2012.[http://www.railwaygazette.com/news/urban/single-view/view/london-tramlink-orders-more-stadler-trams.html London Tramlink orders more Stadlet trams] Railway Gazette 21 August 2013 In August 2013, TfL ordered an additional four Variotrams for delivery in 2015, for use on the Wimbledon to Croydon link, an order which was later increased to six. This brought the total Variotram fleet up to ten in 2015, and twelve in 2016 when the final two trams were delivered.\n\nTram 2535 (the first to travel on the Croydon network under its own power) carries a nameplate in honour of Stephen Parascandolo, the founder of the unofficial Croydon Tramlink website, who was tragically killed in a road accident at the age of 26.\n\nEngineering vehicles\n\nEngineers' vehicles used in Tramlink construction were hired for that purpose. In November 2006 Croydon Tramlink purchased five second-hand engineering vehicles from Deutsche Bahn. These were two DB class Klv 53 engineers' trams (numbered 058 and 059 in Tramline service), and three 4-wheel wagons (numbered 060, 061, and 062). Service tram 058 and trailer 061 were both sold to the National Tramway Museum in 2010.\n\nFuture developments\n\nTrams 2030\n\nIn November 2014, a 15-year plan for upgrades to the tram system to greatly increase capacity on the network in line with an expected increase in ridership to 60 million passengers by 2031.http://content.tfl.gov.uk/rup-20141113-part-1-item09-trams-update.pdf The plans would relieve overcrowding and improve reliability on all lines, support housing growth, (as laid out in the London Plan) https://www.london.gov.uk/sites/default/files/the_london_plan_2016_jan_2017_fix.pdf and support programmes for regeneration in the Croydon metropolitan centre (such as Croydon Vision 2020, the Croydon Opportunity Area, and Westfield Croydon); furthermore, the upgrades seek to future-proof for Crossrail 2, potential Bakerloo line extension to the east of the network, and extensions to the tram network itself. The plans involve dual-tracking across the network and introducing diverting loops on either side of Croydon, allowing for a higher frequency of trams on all four branches of the network without increasing congestion in Croydon metropolitan centre; the £737m investement programme is to be funded partially by the Croydon Growth Zone, TfL Business Plan, housing levies, and the respective boroughs, as well as partially by the affected developers.http://content.tfl.gov.uk/trams-for-growth-presentation.pdf The plans are outlined in three phases consisting of six outputs:\n\nPhase A\n\nTo support developments in Croydon, construction of a diverting loop in East Croydon has been proposed at Dingwall Road. This loop would run up Dingwall Road alongside the Ruskin Square development, call at a new stop on Lansdowne Road, and return to the Croydon loop before the Wellesley Road stop (refurbished to accommodate for higher ridership); services originating from New Addington would alternate between using the main Croydon loop and this loop before returning to New Addington, although the services around the Croydon loop may be phased out.https://consultations.tfl.gov.uk/tramlink/dingwall-road-loop-extension/user_uploads/dingwall-2015-consultation-report.pdf The aim of this is to increase the number services both around the Croydon loop and to Wimbledon originating from Elmers End to meet demand; to accommodate this increase in services, dual-tracking of line after Arena and the construction of a second platform at Elmers End is required. This is fully committed, partially funded by TfL and partially by the Croydon Partnership of Westfield and Hammerson, with construction to begin in 2017 and to be completed by 2020.\n\nPhase B\n\nAn increase in capacity westwards from Croydon centre could support housing growth at industrial and commercial areas in the Wandle Valley area; this could help fund the schemes through a housing levy, although this would require changes in planning allocation from both Croydon and Sutton councils. To achieve this, dual-tracking between Beddington Lane and Mitcham Junction and a second platform at Wimbledon was completed in November 2015, allowing for an initial 50% increase in capacity when Route 4 was extended to Wimbledon.https://tfl.gov.uk/info-for/media/press-releases/2015/november/wimbledon-tram-stop-reopens-with-new-platform To further increase capacity by ~150%, a series of bottlenecks are proposed to be either resolved or avoided: as well as dual-tracking of line at Phipps Bridge and on the Wandle Flyover (between Reeves Corner and Wandle Park), a new route has been proposed between a spur in South Wimbledon or Colliers Wood and a reversing loop in Old Town, Croydon to avoid constraints at Wimbledon station and in Croydon. This line could provide connections to the South Wimbledon/Colliers Wood Area for Intensification and the Northern Line, as well as supporting connections to the proposed South London Metro at Mitcham Junction and West Croydon. The new service could initially run between Morden Road and Croydon before being extended to the new spur.http://content.tfl.gov.uk/rup-20141113-part-1-item09-trams-update.pdf New stops would be built in South Wimbledon/Colliers Wood and in Old Town (initially proposed as Frith Road), as well as an additional platform at Reeves Corner for westward services. This plan may be in service by 2023.https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/595947/london-south-coast-rail-corridor.pdf\n\nPhase C\n\nA 25% increase in capacity could be achieved by the introduction of another passing loop on the Beckenham Junction branch; the extra services could either be fed through Croydon centre or around the Dingwall Loop; this could be in place by 2027. Furthermore, if extra capacity is required, tram stops could be lengthened to serve either longer trams or two trams coupled together on services between Wimbledon and Beckenham Junction or Elmers End; however, the expense required as well as issues from lengthening stops in the Croydon centre may prevent this.\nThis would be in place by 2029.\n\nOther developments\n\nThese developments could see an increase in fleet from 30 to up to 80 trams (depending on whether longer trams or coupled trams are used). As such, an increase in depot and stabling capacity across the whole 15-year plan is also required; an enlargement of the current Therapia Lane site as well as sites near the Elmers End and Harington Road tram stops have been shortlisted. Furthermore, plans for increases in capacity at Wimbledon are supported long-term with the redesign of the station as part of plans of Crossrail 2 and at East Croydon as part of plans for an upgrade of the Brighton Main Line.\nThe plan also is designed to accommodate the long-term aim of extending services to Crystal Palace\n\nProjected extensions\n\nThe Mayor's Transport Strategy for London states that extensions to the network could be developed at relatively modest cost where there is potential demand from existing and new development to support concentrated passenger movements, and where Tramlink technology might be cost effective. Proposal 4D7 says that \"The Mayor will explore the potential for extending the Tramlink network where doing so could help meet the objectives of the Transport Strategy cost effectively\"[http://www.london.gov.uk/mayor/strategies/transport/pdf/final_ch04d.pdf London Dockland and Croydon Tramlink Extensions]   and sought initial views on the viability of a number of extensions by summer 2002.\n\n*from Harrington Road and Birkbeck\n**Crystal Palace\n*from Church Street and Wellesey Road\n**South Croydon\n**Purley\n*from Reeves Corner and West Croydon\n**Thornton Heath Pond\n**Norbury\n**Streatham (connection with Thameslink)\n**Streatham Hill (connection with Southern)\n**Brixton (connection with Victoria line)\n*from Wimbledon (follows Thameslink to Sutton)\n**Wimbledon Chase\n**South Merton\n**Morden South\n**St Helier\n**Sutton Common\n**West Sutton\n**Sutton\n**Mitcham (intersection at current stop)\n**Tooting (connection with Thameslink)\n**Tooting Broadway  (connection with Northern line and future Crossrail 2)\n\nOther extension proposals include Lewisham, Bromley town centre, Biggin Hill Airport/Village and a local spur/loop to penetrate further into Purley Way retail/industrial park.\n\nStarting in the west, there are two corridors into Sutton town centre. The first, principally between Wimbledon and Sutton, was in view even before Tramlink opened: the trams were delivered with this as \"line 4\" on their destination blinds.\n\nExtension D / Route 5\n\nTramlink route 5 is the only extension being formally developed, linking Harrington Road with Crystal Palace, and Crystal Palace with Beckenham Junction, both terminating at Crystal Palace Parade. There were three options on how to get to the Parade: on-street, off-street and a mixture of the two.[http://www.tfl.gov.uk/trams/pdf/Crystal-Palace-2006-10-19.pdf Crystal Palace extension options to reach the Parade] PDF Following recent consultation the off-street option is favoured, with trams running along existing railway as far as Crystal Palace Station, and then round the western edge of Crystal Palace Park (within the park's perimeter) to the bus terminus near the parade. TfL has stated that due to lack of funding the plans for this extension will not be taken forward,[http://www.tfl.gov.uk/corporate/projectsandschemes/2055.aspx Tramlink extension to Crystal Palace]  but also says that it is committed to including new proposals for extensions to the tram as part of a future bid to Government.\n\nExtension A\n\nThe Sutton to Wimbledon proposal utilises the existing line between Wimbledon and Morden Road, but the cramped terminus inside Wimbledon station is barely adequate for its present function. If another service is to serve Wimbledon a new terminus will be needed. Diverging from the present route, the Sutton line might adopt a segregated alignment within the highway along Morden Road, serving Morden station interchange. It would probably use Aberconway Road to reach Morden Hall Road before using the spacious St Helier Avenue as the direct route to St Helier, Rose Hill. St Helier Hospital is an important local traffic objective, despite the need to deviate from the direct route into Sutton via Angel Hill. A number of variants in Sutton Town centre are to be examined to see how the shopping centre, station and office complex can be accessed.\nThe alignment is served by busy bus routes and would give Tramlink direct with the Northern line at Morden. A south-to-east curve may also be considered at Morden Road to permit direct links from St Helier to Mitcham and Croydon.[http://www.alwaystouchout.com/project/19 Proposals to extend the Tramlink system]  Always Touch Out\n\nIn July 2013, Mayor Boris Johnson affirmed that there is a reasonable business case for Tramlink to cover the Wimbledon - Sutton corridor. A map has been released showing the planned route. It would leave the existing route just to the east of Morden Road and head along the A24 and A297 to Rosehill Roundabout, then the B2230 through Sutton town centre, ending at the station. A loop via St Helier Hospital and a possible extension to Royal Marsden Hospital also are shown. Stops would be at Morden Hall, Ivy Lodge, Boxley Road, Langdon Road, Middleton Road, Rosehill Roundabout, St Helier Hospital (on loop), Rosehill Park, Sutton Tennis Centre, Angel Hill, Sutton Green, High Street North, Crown Road (northbound only), St Nicholas Road (northbound only), Throwley Way (southbound only) and Sutton Station[http://www.yourlocalguardian.co.uk/news/10557415.Boris_tells_City_Hall_there_is__reasonable_business_case__for_extending_tram_route_to_Sutton/ Your Local Guardian: London Mayor Boris Johnson tells City Hall there is 'reasonable business case' for extending tram route to Sutton]\n\nExtension B\n\nThe other Sutton proposal, to Tooting, is more ambitious and contains many more challenges than Sutton/Wimbledon link. Apart from workshop/depot facilities and a curve required to link the line into the existing system, this extension would share no infrastructure with it. If \"line 4\" is realised ahead of this proposal, the Tooting line would have the St Helier to Sutton section in common. North of St Helier, the alignment is likely to fit across parkland and open space to take in the Willow Lane Industrial Estate before serving Mitcham town centre. There would be some commonality here with the short separate proposal for a spur from Mitcham Junction to Mitcham town centre. From here, the extension would seek to use the pedestrianised town centre before sharing the carriageway with all traffic in London Road south of Figge’s Marsh, with room for segregation beyond the junction with Streatham Road. The most difficult leg arises immediately the Merton/Wandsworth boundary is crossed and the most effective way of reaching Tooting Broadway from this point will stir much debate.\n\nNorth and south from Croydon\n\nTo the north and south of Croydon are some busy bus corridors, which derive from earlier tram routes. These include the Purley – Croydon – Streatham corridor, which is proposed for conversion to tram operation.\n\nTo the south of Croydon, the proposal is for the new route to diverge from the central Croydon loop and use a highway alignment, probably South End and Brighton Road, to Purley. Beyond Purley, an extension to Coulsdon will be investigated. As this would be close to the M23 motorway, a possibility would be the construction of a park and ride site. Finding a good alignment will be more difficult south of Purley, where Brighton Road is the A23 trunk road.\n\nTo the north of Croydon, it is proposed to use a highway alignment based on London Road. To the south of Thornton Heath Pond, the use of a shared carriageway is a possibility. North of this point the road becomes the A23 again, but there are likely to be some opportunities for trambaan type segregation to Norbury and between Norbury and Streatham, although Norbury is a pinch point. The proposal is to terminate the line at Streatham railway station, providing an interchange to the extended East London Line.\n\nOther extensions\n\nWork currently commissioned will investigate proposals to extend to Biggin Hill, Bromley town centre, Lewisham, and Purley Way. If initial examination shows promise, further work could follow to firm up more detailed routings.\n\nAccidents and incidents\n\nOn 7 September 2008, a bus on route 468 travelled through a red traffic signal and collided with tram 2534 in George Street, Croydon causing a fatality. The driver of the bus was convicted of causing death by dangerous driving a year later in December 2009 and was sentenced to 4 years in prison.\n\nOn 13 September 2008, tram 2530 collided with a cyclist at Morden Hall Park footpath crossing between the Morden Road and Phipps Bridge tram stops.  The cyclist sustained injuries and later died.\n\nOn 5 April 2011, a woman tripped over and was dragged under a moving tram. She was taken to hospital in a serious condition. She is believed to have been running to catch the tram outside East Croydon Station when she tripped and fell.\n\nNovember 2016 derailment\n\nOn 9 November 2016, tram 2551 derailed on a sharp curved junction 180 m east from the Sandilands tram stop, killing seven people and injuring at least 50 more. The British Transport Police arrested the driver on suspicion of manslaughter. The cause was under investigation, but was widely reported as excessive speed.\n\nOnboard announcements\n\nThe onboard announcements are by BBC News reader (and tram enthusiast) Nicholas Owen.\n\n The announcement pattern is as follows: e.g. This tram is for Wimbledon, The next stop will be Merton Park.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Tramlink" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7162" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Tramlink is a light rail tram system serving Croydon and surrounding areas in South London, England. It began operation in 2000,  the first tram system in London since 1952. It is owned by London Trams, an arm of Transport for London (TfL), and operated by FirstGroup.\n\nThe network consists of 39 stops along 28 km of track, on a mixture of street track shared with other traffic, dedicated track in public roads, and off-street track consisting of new rights-of-way, former railway lines, and one right-of-way where the Tramlink track parallels a third rail-electrified Network Rail line.\n\nThe network has four lines that coincide in central Croydon, with eastbound termini at Beckenham Junction, Elmers End and New Addington, and a westbound terminus at Wimbledon, where there is an interchange for London Underground. The Tramlink is the fourth-busiest light rail network in the UK behind Manchester Metrolink, Tyne and Wear Metro and the Docklands Light Railway.\n\nHistory\n\nConstruction\n\nIn 1990 Croydon Council with London Regional Transport (LRT) put the project to Parliament and the Croydon Tramlink Act 1994 resulted, which gave LRT the power to build and run Tramlink.\n\nIn 1996 Tramtrack Croydon Limited (TCL) won a 99-year Private Finance Initiative (PFI) contract to design, build, operate and maintain Tramlink. TCL was a partnership comprising FirstGroup, Bombardier Transportation (the builders of the system's trams), Sir Robert McAlpine and Amey (who built the system), and Royal Bank of Scotland and 3i (who arranged the finances). TCL kept the revenue generated by Tramlink and LRT had to pay compensation to TCL for any changes to the fares and ticketing policy introduced later.\n\nTCL subcontracted operations to CentreWest Buses.\n\nOne of the factors leading to its creation was that the London Borough of Croydon has no London Underground service.\n\nFormer lines reused\n\nThere are four routes: Route 1 – Elmers End to Croydon; Route 2 – Beckenham Junction to Croydon; Route 3 – New Addington to Wimbledon; and Route 4 – Elmers End to Wimbledon.\nRoute 2 runs parallel to the Crystal Palace to Beckenham Junction line of the Southern network between Birkbeck and Beckenham Junction – the National Rail track had been singled some years earlier.\n\nFrom Elmers End to Woodside, route 1 and route 4 (and route 2 from Arena) follow the former British Rail branch line to Addiscombe, then diverge to reach Addiscombe tram stop, 500 m east of the demolished Addiscombe railway station. At Woodside the old station buildings stand disused, and the original platforms have been replaced by accessible low platforms.\n\nFrom Woodside to near Sandilands (routes 1, 2 and 4) and from near Sandilands almost to Lloyd Park (route 3), Tramlink follows the former Woodside and South Croydon Railway, including the Park Hill (or Sandilands) tunnels.\n\nThe section of Route 3 between Wimbledon and West Croydon mostly follows the single-track British Rail route, closed on 31 May 1997 so that it could be converted for Tramlink. Within this section, from near Phipps Bridge to near Reeves Corner, route 3 follows the Surrey Iron Railway, giving Tramlink a claim to one of the world's oldest railway alignments –  beside Mitcham tram stop had its name long before Tramlink. A partial obstruction near this point (reinforcement to a retaining wall below a car park) has necessitated the use of interlaced track.\n\nA Victorian footbridge beside Waddon New Road was dismantled to make way for the flyover over the West Croydon to Sutton railway line. The footbridge has been re-erected at Corfe Castle station on the Swanage Railway (although some evidence suggests that this was a similar footbridge removed from the site of Merton Park Railway Station).\n\nBuyout by Transport for London\n\nIn March 2008, TfL announced that it had reached agreement to buy TCL for £98m. The purchase was finalised on 28 June 2008.[https://www.tfl.gov.uk/cdn/static/cms/documents/annual-report-and-statement-of-accounts-2008-09.pdf AnnualAccounts for year ended 31 March 2008] Transport for London page 158 The background to this purchase relates to the requirement that TfL (who took over from London Regional Transport in 2000) compensates TCL for the consequences of any changes to the fares and ticketing policy introduced since 1996. In 2007 that payment was £4m, with an annual increase in rate.\n\nIn October 2008 TfL introduced a new livery, using the blue, white and green of the routes on TfL maps, to distinguish the trams from buses operating in the area. The colour of the cars was changed to green, and the brand name was changed from Croydon Tramlink to simply Tramlink. These refurbishments were completed in early 2009.\n\nCurrent system\n\nStops\n\nThe tram stops have low platforms, 35 cm above rail level. They are unstaffed and have automated ticket machines. In general, access between the platforms involves crossing the tracks by pedestrian level crossing.\nThere are 39 stops, most being  long. They are virtually level with the doors and are all wider than 2 m. This allows wheelchairs, prams, pushchairs and the elderly to board the tram easily with no steps. In street sections, the stop is integrated with the pavement.\n\nTramlink uses some former main-line stations on the Wimbledon–West Croydon and Elmers End–Coombe Lane stretches of line. The railway platforms have been demolished and rebuilt to Tramlink specifications, except at Elmers End and Wimbledon where the track level was raised to meet the higher main-line platforms to enable cross-platform interchange.\n\nThirty-eight stops opened in the phased introduction of tram services in May 2000. Centrale tram stop in Tamworth Road opened on 10 December 2005, increasing journey times slightly. As turnround times were already quite tight this raised the issue of buying an extra tram to maintain punctuality. Partly for this reason but also to take into account the planned restructuring of services (subsequently introduced in July 2006), TfL issued tenders for a new tram. However, nothing resulted from this.\n\nAll stops have disabled access, raised paving, CCTV, a Passenger Help Point, a Passenger Information Display (PID), litter bins, a ticket machine, a noticeboard and lamp-posts, and most also have seats and a shelter.\n\nThe PIDs display the destinations and expected arrival times of the next two trams. They can also display any message the controllers want to display, such as information on delays or even instructions to vandals to stop placing objects on the track.\n\nRoutes\n\nSince 1 June 2016 Tramlink has been shown on the principal tube map, having previously appeared only on the \"London Connections\" map. The original routes were Line 1 Wimbledon to Elmers End, Line 2 Croydon to Beckenham Junction, and Line 3 Croydon to New Addington.Tramlink: Your top 10 questions answered… Poster, 1995. On 23 July 2006 the network was restructured, with route 1 from Elmers End to Croydon, route 2 from Beckenham Junction to Croydon and route 3 from New Addington to Wimbledon. In June 2012 route 4 from Therapia Lane to Elmers End was introduced. On Monday 4 April 2016, route 4 was extended from Therapia Lane to Wimbledon.\n\nFuture changes\n\nIn 2017, plans to change the tram routes and timetables for more reliable and even services were consulted on with the aim of introducing these changes in early 2018.http://www.croydonguardian.co.uk/news/15688614.Changes_coming_to_tram_timetable__Here_s_what_you_need_to_know/ These would result in three routes:\n* New Addington to West Croydon, returning to New Addington every 6/7 minutes.\n* Wimbledon to Beckenham Junction every 10 minutes\n* Wimbledon to Elmers End every 10 minutes\n\nAdditionally, the first two trams from New Addington will run to Wimbledon. Overall, this would result in a decrease in 2tph leaving Elmers End, resulting in a 25% decrease in capacity here, and 14% in the Addiscombe area.https://insidecroydon.com/2017/10/14/even-westfield-now-agree-theres-no-need-for-28m-tram-loop/ However, this would also regulate waiting times in this area and on the Wimbledon branch to every 5 minutes, from every 2-7 minutes.http://www.croydonguardian.co.uk/news/15688614.Changes_coming_to_tram_timetable__Here_s_what_you_need_to_know/\n\nChange in route colours\n\nWhen TfL took over a new network map was designed, combining Routes 1 and 2 as one service, coloured \"Trams Green\" (lime). (Originally, Line 1 was yellow, Line 2 red, and Line 3 a darker (District line) green.) Trams from Elmers End on Route 1 used to change their numbers in central Croydon to Route 2 (Beckenham Junction) and the reverse in the other direction, but this has changed in light of the introduction of Route 4.\n\nFares and ticketing\n\nTfL Bus Passes are valid on Tramlink, as are Travelcards that include any of zones 3, 4, 5 and 6.\n\nCash fares and pay-as-you-go Oyster Card fares are the same as on London Buses, although special fares may apply when using Tramlink feeder buses.\n\nWhen using Oyster Cards, passengers must touch in on the platform before boarding the tram. Special arrangements apply at Wimbledon station, where the Tramlink stop is within the National Rail and London Underground station, where Tramlink passenger must touch in at the station entry barriers then again at the Tramlink platform to inform the system that no tube journey has been made.\n\nFeeder buses\n\nBus routes T31, T32 and T33 used to connect with Tramlink at the New Addington, Fieldway and Addington Village stops. T31 and T32 no longer run, and T33 has been renamed 433.\n\nRolling stock\n\nTramlink is operated with 34 passenger vehicles. The original fleet comprised 24 articulated low floor Flexity Swift CR4000 trams built by Bombardier Transportation in Vienna numbered beginning at 2530, continuing from the highest-numbered tram 2529 on London's former tram network, which closed in 1952. In 2006, the CR4000 fleet was refurbished, with the bus-like destination blinds being replaced by an electronic dot system. In 2009 the fleet was repainted into a new green livery.\n\nIn January 2011, Tramtrack Croydon opened a tender for the supply of ten new or second-hand trams from the end of summer 2011. The trams will be used between Therapia Lane and Elmers End.Rail Magazine page 16, 'News in Brief – New Trams for Croydon' Issue 663, 9th – 22 February 2011 On 18 August 2011, TfL announced that Stadler Rail had won a $19.75 million contract to supply six Variobahn trams similar to those used by Bybanen in Bergen, Norway. They entered service in 2012.[http://www.railwaygazette.com/news/urban/single-view/view/london-tramlink-orders-more-stadler-trams.html London Tramlink orders more Stadlet trams] Railway Gazette 21 August 2013 In August 2013, TfL ordered an additional four Variotrams for delivery in 2015, for use on the Wimbledon to Croydon link, an order which was later increased to six. This brought the total Variotram fleet up to ten in 2015, and twelve in 2016 when the final two trams were delivered.\n\nTram 2535 (the first to travel on the Croydon network under its own power) carries a nameplate in honour of Stephen Parascandolo, the founder of the unofficial Croydon Tramlink website, who was tragically killed in a road accident at the age of 26.\n\nEngineering vehicles\n\nEngineers' vehicles used in Tramlink construction were hired for that purpose. In November 2006 Croydon Tramlink purchased five second-hand engineering vehicles from Deutsche Bahn. These were two DB class Klv 53 engineers' trams (numbered 058 and 059 in Tramline service), and three 4-wheel wagons (numbered 060, 061, and 062). Service tram 058 and trailer 061 were both sold to the National Tramway Museum in 2010.\n\nFuture developments\n\nTrams 2030\n\nIn November 2014, a 15-year plan for upgrades to the tram system to greatly increase capacity on the network in line with an expected increase in ridership to 60 million passengers by 2031.http://content.tfl.gov.uk/rup-20141113-part-1-item09-trams-update.pdf The plans would relieve overcrowding and improve reliability on all lines, support housing growth, (as laid out in the London Plan) https://www.london.gov.uk/sites/default/files/the_london_plan_2016_jan_2017_fix.pdf and support programmes for regeneration in the Croydon metropolitan centre (such as Croydon Vision 2020, the Croydon Opportunity Area, and Westfield Croydon); furthermore, the upgrades seek to future-proof for Crossrail 2, potential Bakerloo line extension to the east of the network, and extensions to the tram network itself. The plans involve dual-tracking across the network and introducing diverting loops on either side of Croydon, allowing for a higher frequency of trams on all four branches of the network without increasing congestion in Croydon metropolitan centre; the £737m investement programme is to be funded partially by the Croydon Growth Zone, TfL Business Plan, housing levies, and the respective boroughs, as well as partially by the affected developers.http://content.tfl.gov.uk/trams-for-growth-presentation.pdf The plans are outlined in three phases consisting of six outputs:\n\nPhase A\n\nTo support developments in Croydon, construction of a diverting loop in East Croydon has been proposed at Dingwall Road. This loop would run up Dingwall Road alongside the Ruskin Square development, call at a new stop on Lansdowne Road, and return to the Croydon loop before the Wellesley Road stop (refurbished to accommodate for higher ridership); services originating from New Addington would alternate between using the main Croydon loop and this loop before returning to New Addington, although the services around the Croydon loop may be phased out.https://consultations.tfl.gov.uk/tramlink/dingwall-road-loop-extension/user_uploads/dingwall-2015-consultation-report.pdf The aim of this is to increase the number services both around the Croydon loop and to Wimbledon originating from Elmers End to meet demand; to accommodate this increase in services, dual-tracking of line after Arena and the construction of a second platform at Elmers End is required. This is fully committed, partially funded by TfL and partially by the Croydon Partnership of Westfield and Hammerson, with construction to begin in 2017 and to be completed by 2020.\n\nPhase B\n\nAn increase in capacity westwards from Croydon centre could support housing growth at industrial and commercial areas in the Wandle Valley area; this could help fund the schemes through a housing levy, although this would require changes in planning allocation from both Croydon and Sutton councils. To achieve this, dual-tracking between Beddington Lane and Mitcham Junction and a second platform at Wimbledon was completed in November 2015, allowing for an initial 50% increase in capacity when Route 4 was extended to Wimbledon.https://tfl.gov.uk/info-for/media/press-releases/2015/november/wimbledon-tram-stop-reopens-with-new-platform To further increase capacity by ~150%, a series of bottlenecks are proposed to be either resolved or avoided: as well as dual-tracking of line at Phipps Bridge and on the Wandle Flyover (between Reeves Corner and Wandle Park), a new route has been proposed between a spur in South Wimbledon or Colliers Wood and a reversing loop in Old Town, Croydon to avoid constraints at Wimbledon station and in Croydon. This line could provide connections to the South Wimbledon/Colliers Wood Area for Intensification and the Northern Line, as well as supporting connections to the proposed South London Metro at Mitcham Junction and West Croydon. The new service could initially run between Morden Road and Croydon before being extended to the new spur.http://content.tfl.gov.uk/rup-20141113-part-1-item09-trams-update.pdf New stops would be built in South Wimbledon/Colliers Wood and in Old Town (initially proposed as Frith Road), as well as an additional platform at Reeves Corner for westward services. This plan may be in service by 2023.https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/595947/london-south-coast-rail-corridor.pdf\n\nPhase C\n\nA 25% increase in capacity could be achieved by the introduction of another passing loop on the Beckenham Junction branch; the extra services could either be fed through Croydon centre or around the Dingwall Loop; this could be in place by 2027. Furthermore, if extra capacity is required, tram stops could be lengthened to serve either longer trams or two trams coupled together on services between Wimbledon and Beckenham Junction or Elmers End; however, the expense required as well as issues from lengthening stops in the Croydon centre may prevent this.\nThis would be in place by 2029.\n\nOther developments\n\nThese developments could see an increase in fleet from 30 to up to 80 trams (depending on whether longer trams or coupled trams are used). As such, an increase in depot and stabling capacity across the whole 15-year plan is also required; an enlargement of the current Therapia Lane site as well as sites near the Elmers End and Harington Road tram stops have been shortlisted. Furthermore, plans for increases in capacity at Wimbledon are supported long-term with the redesign of the station as part of plans of Crossrail 2 and at East Croydon as part of plans for an upgrade of the Brighton Main Line.\nThe plan also is designed to accommodate the long-term aim of extending services to Crystal Palace\n\nProjected extensions\n\nThe Mayor's Transport Strategy for London states that extensions to the network could be developed at relatively modest cost where there is potential demand from existing and new development to support concentrated passenger movements, and where Tramlink technology might be cost effective. Proposal 4D7 says that \"The Mayor will explore the potential for extending the Tramlink network where doing so could help meet the objectives of the Transport Strategy cost effectively\"[http://www.london.gov.uk/mayor/strategies/transport/pdf/final_ch04d.pdf London Dockland and Croydon Tramlink Extensions]   and sought initial views on the viability of a number of extensions by summer 2002.\n\n*from Harrington Road and Birkbeck\n**Crystal Palace\n*from Church Street and Wellesey Road\n**South Croydon\n**Purley\n*from Reeves Corner and West Croydon\n**Thornton Heath Pond\n**Norbury\n**Streatham (connection with Thameslink)\n**Streatham Hill (connection with Southern)\n**Brixton (connection with Victoria line)\n*from Wimbledon (follows Thameslink to Sutton)\n**Wimbledon Chase\n**South Merton\n**Morden South\n**St Helier\n**Sutton Common\n**West Sutton\n**Sutton\n**Mitcham (intersection at current stop)\n**Tooting (connection with Thameslink)\n**Tooting Broadway  (connection with Northern line and future Crossrail 2)\n\nOther extension proposals include Lewisham, Bromley town centre, Biggin Hill Airport/Village and a local spur/loop to penetrate further into Purley Way retail/industrial park.\n\nStarting in the west, there are two corridors into Sutton town centre. The first, principally between Wimbledon and Sutton, was in view even before Tramlink opened: the trams were delivered with this as \"line 4\" on their destination blinds.\n\nExtension D / Route 5\n\nTramlink route 5 is the only extension being formally developed, linking Harrington Road with Crystal Palace, and Crystal Palace with Beckenham Junction, both terminating at Crystal Palace Parade. There were three options on how to get to the Parade: on-street, off-street and a mixture of the two.[http://www.tfl.gov.uk/trams/pdf/Crystal-Palace-2006-10-19.pdf Crystal Palace extension options to reach the Parade] PDF Following recent consultation the off-street option is favoured, with trams running along existing railway as far as Crystal Palace Station, and then round the western edge of Crystal Palace Park (within the park's perimeter) to the bus terminus near the parade. TfL has stated that due to lack of funding the plans for this extension will not be taken forward,[http://www.tfl.gov.uk/corporate/projectsandschemes/2055.aspx Tramlink extension to Crystal Palace]  but also says that it is committed to including new proposals for extensions to the tram as part of a future bid to Government.\n\nExtension A\n\nThe Sutton to Wimbledon proposal utilises the existing line between Wimbledon and Morden Road, but the cramped terminus inside Wimbledon station is barely adequate for its present function. If another service is to serve Wimbledon a new terminus will be needed. Diverging from the present route, the Sutton line might adopt a segregated alignment within the highway along Morden Road, serving Morden station interchange. It would probably use Aberconway Road to reach Morden Hall Road before using the spacious St Helier Avenue as the direct route to St Helier, Rose Hill. St Helier Hospital is an important local traffic objective, despite the need to deviate from the direct route into Sutton via Angel Hill. A number of variants in Sutton Town centre are to be examined to see how the shopping centre, station and office complex can be accessed.\nThe alignment is served by busy bus routes and would give Tramlink direct with the Northern line at Morden. A south-to-east curve may also be considered at Morden Road to permit direct links from St Helier to Mitcham and Croydon.[http://www.alwaystouchout.com/project/19 Proposals to extend the Tramlink system]  Always Touch Out\n\nIn July 2013, Mayor Boris Johnson affirmed that there is a reasonable business case for Tramlink to cover the Wimbledon - Sutton corridor. A map has been released showing the planned route. It would leave the existing route just to the east of Morden Road and head along the A24 and A297 to Rosehill Roundabout, then the B2230 through Sutton town centre, ending at the station. A loop via St Helier Hospital and a possible extension to Royal Marsden Hospital also are shown. Stops would be at Morden Hall, Ivy Lodge, Boxley Road, Langdon Road, Middleton Road, Rosehill Roundabout, St Helier Hospital (on loop), Rosehill Park, Sutton Tennis Centre, Angel Hill, Sutton Green, High Street North, Crown Road (northbound only), St Nicholas Road (northbound only), Throwley Way (southbound only) and Sutton Station[http://www.yourlocalguardian.co.uk/news/10557415.Boris_tells_City_Hall_there_is__reasonable_business_case__for_extending_tram_route_to_Sutton/ Your Local Guardian: London Mayor Boris Johnson tells City Hall there is 'reasonable business case' for extending tram route to Sutton]\n\nExtension B\n\nThe other Sutton proposal, to Tooting, is more ambitious and contains many more challenges than Sutton/Wimbledon link. Apart from workshop/depot facilities and a curve required to link the line into the existing system, this extension would share no infrastructure with it. If \"line 4\" is realised ahead of this proposal, the Tooting line would have the St Helier to Sutton section in common. North of St Helier, the alignment is likely to fit across parkland and open space to take in the Willow Lane Industrial Estate before serving Mitcham town centre. There would be some commonality here with the short separate proposal for a spur from Mitcham Junction to Mitcham town centre. From here, the extension would seek to use the pedestrianised town centre before sharing the carriageway with all traffic in London Road south of Figge’s Marsh, with room for segregation beyond the junction with Streatham Road. The most difficult leg arises immediately the Merton/Wandsworth boundary is crossed and the most effective way of reaching Tooting Broadway from this point will stir much debate.\n\nNorth and south from Croydon\n\nTo the north and south of Croydon are some busy bus corridors, which derive from earlier tram routes. These include the Purley – Croydon – Streatham corridor, which is proposed for conversion to tram operation.\n\nTo the south of Croydon, the proposal is for the new route to diverge from the central Croydon loop and use a highway alignment, probably South End and Brighton Road, to Purley. Beyond Purley, an extension to Coulsdon will be investigated. As this would be close to the M23 motorway, a possibility would be the construction of a park and ride site. Finding a good alignment will be more difficult south of Purley, where Brighton Road is the A23 trunk road.\n\nTo the north of Croydon, it is proposed to use a highway alignment based on London Road. To the south of Thornton Heath Pond, the use of a shared carriageway is a possibility. North of this point the road becomes the A23 again, but there are likely to be some opportunities for trambaan type segregation to Norbury and between Norbury and Streatham, although Norbury is a pinch point. The proposal is to terminate the line at Streatham railway station, providing an interchange to the extended East London Line.\n\nOther extensions\n\nWork currently commissioned will investigate proposals to extend to Biggin Hill, Bromley town centre, Lewisham, and Purley Way. If initial examination shows promise, further work could follow to firm up more detailed routings.\n\nAccidents and incidents\n\nOn 7 September 2008, a bus on route 468 travelled through a red traffic signal and collided with tram 2534 in George Street, Croydon causing a fatality. The driver of the bus was convicted of causing death by dangerous driving a year later in December 2009 and was sentenced to 4 years in prison.\n\nOn 13 September 2008, tram 2530 collided with a cyclist at Morden Hall Park footpath crossing between the Morden Road and Phipps Bridge tram stops.  The cyclist sustained injuries and later died.\n\nOn 5 April 2011, a woman tripped over and was dragged under a moving tram. She was taken to hospital in a serious condition. She is believed to have been running to catch the tram outside East Croydon Station when she tripped and fell.\n\nNovember 2016 derailment\n\nOn 9 November 2016, tram 2551 derailed on a sharp curved junction 180 m east from the Sandilands tram stop, killing seven people and injuring at least 50 more. The British Transport Police arrested the driver on suspicion of manslaughter. The cause was under investigation, but was widely reported as excessive speed.\n\nOnboard announcements\n\nThe onboard announcements are by BBC News reader (and tram enthusiast) Nicholas Owen.\n\n The announcement pattern is as follows: e.g. This tram is for Wimbledon, The next stop will be Merton Park. Tramlink. http://en.wikipedia.org/?curid=7162."
  }
}
