{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14017",
  "eid" : "10ee7740-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778537652,
  "textBody" : "House of Cards is a 1990 British political thriller television serial in four episodes, set after the end of Margaret Thatcher's tenure as Prime Minister of the United Kingdom. It was televised by the BBC from 18 November to 9 December 1990, to critical and popular acclaim.\n\nAndrew Davies adapted the story from a novel written by Michael Dobbs, a former Chief of Staff at Conservative Party headquarters. Neville Teller also dramatised Dobbs's novel for BBC World Service in 1996, and it had two television sequels (To Play the King and The Final Cut). The opening and closing theme music for those TV series is entitled \"Francis Urquhart's March.\"\n\nHouse of Cards was ranked 84th in the British Film Institute list of the 100 Greatest British Television Programmes in 2000. In 2013, the serial and the Dobbs novel were the basis for a US adaptation set in Washington, D.C., commissioned and released by Netflix.\n\nOverview\n\nThe antihero of House of Cards is Francis Urquhart, a fictional Chief Whip of the Conservative Party, played by Ian Richardson. The plot follows his amoral and manipulative scheme to become leader of the governing party and, thus, Prime Minister of the United Kingdom.\n\nMichael Dobbs did not envision writing the second and third books, as Urquhart dies at the end of the first novel. The screenplay of the BBC's dramatisation of House of Cards differs from the book, and hence allows future series. Dobbs wrote two following books, To Play the King and The Final Cut, which were televised in 1993 and 1995, respectively.\n\nHouse of Cards was said to draw from Shakespeare's plays Macbeth and Richard III, both of which feature main characters who are corrupted by power and ambition. Richardson has a Shakespearean background and said he based his characterisation of Urquhart on Shakespeare's portrayal of Richard III.\n\nUrquhart frequently talks through the camera to the audience, breaking the fourth wall using the aside.\n\nPlot\n\nAfter Margaret Thatcher's resignation, the ruling Conservative Party is about to elect a new leader.  Francis Urquhart (Ian Richardson), an MP and the Government Chief Whip in the House of Commons, introduces viewers to the contestants, from which Henry \"Hal\" Collingridge (David Lyon) emerges victorious. Urquhart is secretly contemptuous of the well-meaning but weak Collingridge, but expects a promotion to a senior position in the Cabinet. After the general election, which the party wins by a reduced majority, Urquhart submits his suggestions for a reshuffle that includes his desired promotion. However, Collingridge – citing Harold Macmillan's political demise after the 1962 Night of the Long Knives – effects no changes at all. Urquhart resolves to oust Collingridge, with encouragement from his wife, Elizabeth (Diane Fletcher).\n\nAt the same time, with Elizabeth's blessing, Urquhart begins an affair with Mattie Storin (Susannah Harker), a junior political reporter at a Conservative-leaning tabloid newspaper called The Chronicle. The affair allows Urquhart to manipulate Mattie and indirectly skew her coverage of the Conservative leadership contest in his favour. Mattie has an apparent Electra complex; she finds appeal in Urquhart's much older age and later refers to him as \"Daddy.\" Another unwitting pawn is Roger O'Neill (Miles Anderson), the party's cocaine-addicted public relations consultant.\n\nUrquhart blackmails O'Neill into leaking information on budget cuts that humiliates Collingridge during the Prime Minister's Questions. Later, he blames party chairman Lord \"Teddy\" Billsborough (Nicholas Selby) for leaking an internal poll showing a drop in Tory numbers, leading Collingridge to sack him. As Collingridge's image suffers, Urquhart encourages ultraconservative Foreign Secretary Patrick Woolton (Malcolm Tierney) and Chronicle owner Benjamin Landless to support his removal. Urquhart also poses as Collingridge's alcoholic brother, Charles, to trade shares in a chemical company about to benefit from advance information confidential to the government. Consequently, Collingridge becomes falsely accused of insider trading and is forced to resign.\n\nIn the ensuing leadership race, Urquhart initially feigns unwillingness to stand before announcing his candidacy. With the help of his underling, Tim Stamper (Colin Jeavons), Urquhart goes about making sure his competitors drop out of the race: Health Secretary Peter MacKenzie (Christopher Owen) accidentally runs his car over a disabled protester at a demonstration staged by Urquhart and is forced by the public outcry to withdraw, while Education Secretary Harold Earle (Kenneth Gilbert) is blackmailed into withdrawing when Urquhart anonymously sends pictures of him in the company of a rent boy whom Earle had paid for sex.\n\nThe first ballot leaves Urquhart to face Woolton and Michael Samuels, the moderate Environment Secretary supported by Billsborough. Urquhart eliminates Woolton by a prolonged scheme: at the party conference, he pressures O'Neill into persuading his personal assistant and lover, Penny Guy (Alphonsia Emmanuel), to have a one-night stand with Woolton in his suite, which Urquhart records via a bugged ministerial red box. When the tape is sent to Woolton, he is led to assume that Samuels is behind the scheme and backs Urquhart in the contest. Urquhart also receives support from Collingridge, who is unaware of Urquhart's role in his own downfall. Samuels is forced out of the running when the tabloids reveal that he backed leftist causes as a student at University of Cambridge.\n\nStumbling across contradictions in the allegations against Collingridge and his brother, Mattie begins to dig deeper. On Urquhart's orders, O'Neill arranges for her car and flat to be vandalised in a show of intimidation. However, O'Neill becomes increasingly uneasy with what he is being asked to do, and his cocaine addiction adds to his instability. Urquhart mixes O'Neill's cocaine with rat poison, causing him to kill himself when taking the cocaine in a motorway lavatory. Though initially blind to the truth of matters thanks to her relations with Urquhart, Mattie eventually deduces that Urquhart is responsible for O'Neill's death and is behind the unfortunate downfalls of Collingridge and all of Urquhart's rivals.\n\nMattie looks for Urquhart at the point when it seems his victory is certain.  She eventually finds him on the roof garden of the Houses of Parliament, where she confronts him. He admits to O'Neill's murder and everything else he has done. He then asks whether he can trust Mattie, and, though she answers in the affirmative, he does not believe her and throws her off the roof onto a van parked below. An unseen person picks up Mattie's tape recorder, which she had been using to secretly record her conversations with Urquhart. The series ends with Urquhart defeating Samuels in the second leadership ballot and being driven to Buckingham Palace to be invited to form a government by Elizabeth II.\n\nDeviations from the novel in the series\n\nIn the first novel, but not in the television series:\n* Urquhart never speaks directly to the reader; the character is written solely in a third-person perspective.\n* When alone, Urquhart is much less self-assured and decisive. \n* Mattie Storin worked for The Daily Telegraph. (In the television series she was a journalist with the fictional Chronicle newspaper.)\n* Mattie Storin does not have a relationship with Urquhart; she does not even talk with him frequently. She does, however, have a sexual relationship with John Krajewski.\n* Urquhart's wife is called Miranda and is an extremely minor character, not sharing in his schemes. (In the later novels, To Play the King and The Final Cut, however, she is called \"Elizabeth\" and plays a larger role, as in the television series.)\n* The Conservative party conference was held in Bournemouth. (In the television series it was in Brighton.)\n* Tim Stamper was introduced for the on-screen adaptation (although Dobbs introduced him in the novel To Play the King).\n* Earle's rent boy appears in person at an important speech of Earle's, distracting him; subsequently, Earle is harassed by reporters who have been told of his indiscretion.\n* Most importantly, in the final confrontation scene Urquhart throws himself from the roof terrace and Mattie survives.\n\nWhen the series was reissued in 2013, to coincide with the release of the US version of House of Cards, Dobbs rewrote portions of the novel to bring the series in line with the television mini-series and restore continuity among the three novels. In the 2013 version:\n\n*Urquhart murders Mattie Storin per the TV series, throwing her off the roof after she confronts Urquhart about his actions. \n*Mattie Storin does not scream \"Daddy\" as she falls. \n*Urquhart covers up his murder of Mattie Storin by claiming she was an obsessed stalker who was mentally ill and vows to make mental health amongst the young a priority policy-wise.   \n*Mattie Storin works for newspaper The Chronicle, per the TV series.\n*The revised version of the novel changes Miranda to Mortima as the name of Urquhart's wife.\n*Tim Stamper, though present in the TV mini-series, does not appear in the revised version of the novel.\n*Urquhart's asides to the audience appear in the form of epigraphs at the beginning of each chapter (the original novel has no chapters).\n\nReception\n\nThe first installment of the TV series coincidentally aired two days before the Conservative Party leadership election. Author Dobbs said that John Major's leadership headquarters \"came to a halt\" to view the show. During a time of \"disillusionment with politics\", the series \"caught the nation's mood\".\n\nIan Richardson won a Best Actor BAFTA in 1991 for his role as Urquhart, and Andrew Davies won an Emmy for outstanding writing in a miniseries.\n\nThe series ranked 84th in the British Film Institute list of the 100 Greatest British Television Programmes.\n\nAmerican adaptation\n\nThe Urquhart trilogy has been adapted in the United States as House of Cards. The show stars Kevin Spacey as Francis \"Frank\" Underwood, the Majority Whip of the Democratic Party, who schemes and murders his way to becoming President of the United States. It is produced by David Fincher and Spacey's Trigger Street Productions, with the initial episodes directed by Fincher.\n\nThe series, produced and financed by independent studio Media Rights Capital, is one of Netflix's first forays into original programming. Season one was made available online on 1 February 2013. The series is filmed in Baltimore, Maryland.  The first season was critically acclaimed and earned four Golden Globe Nominations, including Best Drama, actor, actress and supporting actor, with Robin Wright winning best actress.  It also earned nine Primetime Emmy Award nominations, winning three, and was the first show to earn nominations that was broadcast solely via an internet streaming service.\n\nIn popular culture\n\nThe drama introduced and popularised the phrase: \"You might very well think that; I couldn't possibly comment\". It was a non-confirmation confirmative statement, used by Urquhart whenever he could not be seen to agree with a leading statement, with the emphasis on either the \"I\" or the \"possibly\", depending on the situation. The phrase was even used in the House of Commons following the series.\n\nA variation on the phrase was written into the TV adaptation of Terry Pratchett's Hogfather for the character Death, as an in-joke on the fact that he was voiced by Richardson.\n\nDuring the first Gulf War, a British reporter speaking from Baghdad, conscious of the possibility of censorship, used the code phrase \"You might very well think that; I couldn't possibly comment\" to answer a BBC presenter's question.\n\nA further variation was used by Nicola Murray, a fictional government minister, in the third series finale of The Thick of It.\n\nIn the U.S. adaptation, the phrase is used by Frank Underwood in the first episode during his initial meeting with Zoe Barnes, the US counterpart of Mattie Storin.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "House of Cards (UK TV series)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14017" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "House of Cards is a 1990 British political thriller television serial in four episodes, set after the end of Margaret Thatcher's tenure as Prime Minister of the United Kingdom. It was televised by the BBC from 18 November to 9 December 1990, to critical and popular acclaim.\n\nAndrew Davies adapted the story from a novel written by Michael Dobbs, a former Chief of Staff at Conservative Party headquarters. Neville Teller also dramatised Dobbs's novel for BBC World Service in 1996, and it had two television sequels (To Play the King and The Final Cut). The opening and closing theme music for those TV series is entitled \"Francis Urquhart's March.\"\n\nHouse of Cards was ranked 84th in the British Film Institute list of the 100 Greatest British Television Programmes in 2000. In 2013, the serial and the Dobbs novel were the basis for a US adaptation set in Washington, D.C., commissioned and released by Netflix.\n\nOverview\n\nThe antihero of House of Cards is Francis Urquhart, a fictional Chief Whip of the Conservative Party, played by Ian Richardson. The plot follows his amoral and manipulative scheme to become leader of the governing party and, thus, Prime Minister of the United Kingdom.\n\nMichael Dobbs did not envision writing the second and third books, as Urquhart dies at the end of the first novel. The screenplay of the BBC's dramatisation of House of Cards differs from the book, and hence allows future series. Dobbs wrote two following books, To Play the King and The Final Cut, which were televised in 1993 and 1995, respectively.\n\nHouse of Cards was said to draw from Shakespeare's plays Macbeth and Richard III, both of which feature main characters who are corrupted by power and ambition. Richardson has a Shakespearean background and said he based his characterisation of Urquhart on Shakespeare's portrayal of Richard III.\n\nUrquhart frequently talks through the camera to the audience, breaking the fourth wall using the aside.\n\nPlot\n\nAfter Margaret Thatcher's resignation, the ruling Conservative Party is about to elect a new leader.  Francis Urquhart (Ian Richardson), an MP and the Government Chief Whip in the House of Commons, introduces viewers to the contestants, from which Henry \"Hal\" Collingridge (David Lyon) emerges victorious. Urquhart is secretly contemptuous of the well-meaning but weak Collingridge, but expects a promotion to a senior position in the Cabinet. After the general election, which the party wins by a reduced majority, Urquhart submits his suggestions for a reshuffle that includes his desired promotion. However, Collingridge – citing Harold Macmillan's political demise after the 1962 Night of the Long Knives – effects no changes at all. Urquhart resolves to oust Collingridge, with encouragement from his wife, Elizabeth (Diane Fletcher).\n\nAt the same time, with Elizabeth's blessing, Urquhart begins an affair with Mattie Storin (Susannah Harker), a junior political reporter at a Conservative-leaning tabloid newspaper called The Chronicle. The affair allows Urquhart to manipulate Mattie and indirectly skew her coverage of the Conservative leadership contest in his favour. Mattie has an apparent Electra complex; she finds appeal in Urquhart's much older age and later refers to him as \"Daddy.\" Another unwitting pawn is Roger O'Neill (Miles Anderson), the party's cocaine-addicted public relations consultant.\n\nUrquhart blackmails O'Neill into leaking information on budget cuts that humiliates Collingridge during the Prime Minister's Questions. Later, he blames party chairman Lord \"Teddy\" Billsborough (Nicholas Selby) for leaking an internal poll showing a drop in Tory numbers, leading Collingridge to sack him. As Collingridge's image suffers, Urquhart encourages ultraconservative Foreign Secretary Patrick Woolton (Malcolm Tierney) and Chronicle owner Benjamin Landless to support his removal. Urquhart also poses as Collingridge's alcoholic brother, Charles, to trade shares in a chemical company about to benefit from advance information confidential to the government. Consequently, Collingridge becomes falsely accused of insider trading and is forced to resign.\n\nIn the ensuing leadership race, Urquhart initially feigns unwillingness to stand before announcing his candidacy. With the help of his underling, Tim Stamper (Colin Jeavons), Urquhart goes about making sure his competitors drop out of the race: Health Secretary Peter MacKenzie (Christopher Owen) accidentally runs his car over a disabled protester at a demonstration staged by Urquhart and is forced by the public outcry to withdraw, while Education Secretary Harold Earle (Kenneth Gilbert) is blackmailed into withdrawing when Urquhart anonymously sends pictures of him in the company of a rent boy whom Earle had paid for sex.\n\nThe first ballot leaves Urquhart to face Woolton and Michael Samuels, the moderate Environment Secretary supported by Billsborough. Urquhart eliminates Woolton by a prolonged scheme: at the party conference, he pressures O'Neill into persuading his personal assistant and lover, Penny Guy (Alphonsia Emmanuel), to have a one-night stand with Woolton in his suite, which Urquhart records via a bugged ministerial red box. When the tape is sent to Woolton, he is led to assume that Samuels is behind the scheme and backs Urquhart in the contest. Urquhart also receives support from Collingridge, who is unaware of Urquhart's role in his own downfall. Samuels is forced out of the running when the tabloids reveal that he backed leftist causes as a student at University of Cambridge.\n\nStumbling across contradictions in the allegations against Collingridge and his brother, Mattie begins to dig deeper. On Urquhart's orders, O'Neill arranges for her car and flat to be vandalised in a show of intimidation. However, O'Neill becomes increasingly uneasy with what he is being asked to do, and his cocaine addiction adds to his instability. Urquhart mixes O'Neill's cocaine with rat poison, causing him to kill himself when taking the cocaine in a motorway lavatory. Though initially blind to the truth of matters thanks to her relations with Urquhart, Mattie eventually deduces that Urquhart is responsible for O'Neill's death and is behind the unfortunate downfalls of Collingridge and all of Urquhart's rivals.\n\nMattie looks for Urquhart at the point when it seems his victory is certain.  She eventually finds him on the roof garden of the Houses of Parliament, where she confronts him. He admits to O'Neill's murder and everything else he has done. He then asks whether he can trust Mattie, and, though she answers in the affirmative, he does not believe her and throws her off the roof onto a van parked below. An unseen person picks up Mattie's tape recorder, which she had been using to secretly record her conversations with Urquhart. The series ends with Urquhart defeating Samuels in the second leadership ballot and being driven to Buckingham Palace to be invited to form a government by Elizabeth II.\n\nDeviations from the novel in the series\n\nIn the first novel, but not in the television series:\n* Urquhart never speaks directly to the reader; the character is written solely in a third-person perspective.\n* When alone, Urquhart is much less self-assured and decisive. \n* Mattie Storin worked for The Daily Telegraph. (In the television series she was a journalist with the fictional Chronicle newspaper.)\n* Mattie Storin does not have a relationship with Urquhart; she does not even talk with him frequently. She does, however, have a sexual relationship with John Krajewski.\n* Urquhart's wife is called Miranda and is an extremely minor character, not sharing in his schemes. (In the later novels, To Play the King and The Final Cut, however, she is called \"Elizabeth\" and plays a larger role, as in the television series.)\n* The Conservative party conference was held in Bournemouth. (In the television series it was in Brighton.)\n* Tim Stamper was introduced for the on-screen adaptation (although Dobbs introduced him in the novel To Play the King).\n* Earle's rent boy appears in person at an important speech of Earle's, distracting him; subsequently, Earle is harassed by reporters who have been told of his indiscretion.\n* Most importantly, in the final confrontation scene Urquhart throws himself from the roof terrace and Mattie survives.\n\nWhen the series was reissued in 2013, to coincide with the release of the US version of House of Cards, Dobbs rewrote portions of the novel to bring the series in line with the television mini-series and restore continuity among the three novels. In the 2013 version:\n\n*Urquhart murders Mattie Storin per the TV series, throwing her off the roof after she confronts Urquhart about his actions. \n*Mattie Storin does not scream \"Daddy\" as she falls. \n*Urquhart covers up his murder of Mattie Storin by claiming she was an obsessed stalker who was mentally ill and vows to make mental health amongst the young a priority policy-wise.   \n*Mattie Storin works for newspaper The Chronicle, per the TV series.\n*The revised version of the novel changes Miranda to Mortima as the name of Urquhart's wife.\n*Tim Stamper, though present in the TV mini-series, does not appear in the revised version of the novel.\n*Urquhart's asides to the audience appear in the form of epigraphs at the beginning of each chapter (the original novel has no chapters).\n\nReception\n\nThe first installment of the TV series coincidentally aired two days before the Conservative Party leadership election. Author Dobbs said that John Major's leadership headquarters \"came to a halt\" to view the show. During a time of \"disillusionment with politics\", the series \"caught the nation's mood\".\n\nIan Richardson won a Best Actor BAFTA in 1991 for his role as Urquhart, and Andrew Davies won an Emmy for outstanding writing in a miniseries.\n\nThe series ranked 84th in the British Film Institute list of the 100 Greatest British Television Programmes.\n\nAmerican adaptation\n\nThe Urquhart trilogy has been adapted in the United States as House of Cards. The show stars Kevin Spacey as Francis \"Frank\" Underwood, the Majority Whip of the Democratic Party, who schemes and murders his way to becoming President of the United States. It is produced by David Fincher and Spacey's Trigger Street Productions, with the initial episodes directed by Fincher.\n\nThe series, produced and financed by independent studio Media Rights Capital, is one of Netflix's first forays into original programming. Season one was made available online on 1 February 2013. The series is filmed in Baltimore, Maryland.  The first season was critically acclaimed and earned four Golden Globe Nominations, including Best Drama, actor, actress and supporting actor, with Robin Wright winning best actress.  It also earned nine Primetime Emmy Award nominations, winning three, and was the first show to earn nominations that was broadcast solely via an internet streaming service.\n\nIn popular culture\n\nThe drama introduced and popularised the phrase: \"You might very well think that; I couldn't possibly comment\". It was a non-confirmation confirmative statement, used by Urquhart whenever he could not be seen to agree with a leading statement, with the emphasis on either the \"I\" or the \"possibly\", depending on the situation. The phrase was even used in the House of Commons following the series.\n\nA variation on the phrase was written into the TV adaptation of Terry Pratchett's Hogfather for the character Death, as an in-joke on the fact that he was voiced by Richardson.\n\nDuring the first Gulf War, a British reporter speaking from Baghdad, conscious of the possibility of censorship, used the code phrase \"You might very well think that; I couldn't possibly comment\" to answer a BBC presenter's question.\n\nA further variation was used by Nicola Murray, a fictional government minister, in the third series finale of The Thick of It.\n\nIn the U.S. adaptation, the phrase is used by Frank Underwood in the first episode during his initial meeting with Zoe Barnes, the US counterpart of Mattie Storin. House of Cards (UK TV series). http://en.wikipedia.org/?curid=14017."
  }
}
