{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11184",
  "eid" : "fa3cae90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778499577,
  "textBody" : "Events\n\n*660 BC – Traditional date for the foundation of Japan by Emperor Jimmu.\n* AD 55 – Tiberius Claudius Caesar Britannicus, heir to the Roman emperorship, dies under mysterious circumstances in Rome. This clears the way for Nero to become Emperor.\n* 244 – Emperor Gordian III is murdered by mutinous soldiers in Zaitha (Mesopotamia). A mound is raised at Carchemish in his memory.\n*1177 – John de Courcy's army defeats the native Dunleavey Clan in Ulster. The English establish themselves in Ulster.\n*1534 – Henry VIII of England is recognized as supreme head of the Church of England.\n*1626 – Emperor Susenyos I of Ethiopia and Patriarch Afonso Mendes declare the primacy of the Roman See over the Ethiopian Church, and Catholicism to be the state religion of Ethiopia.\n*1659 – The assault on Copenhagen by Swedish forces is beaten back with heavy losses.\n*1790 – The Religious Society of Friends, also known as Quakers, petitions U.S. Congress for the abolition of slavery.\n*1794 – First session of United States Senate opens to the public.\n*1808 – Jesse Fell burns anthracite on an open grate as an experiment in heating homes with coal.\n*1812 – Massachusetts governor Elbridge Gerry is accused of \"gerrymandering\" for the first time.\n*1823 – Carnival tragedy of 1823: About 110 boys are killed during a stampede at the Convent of the Minori Osservanti in Valletta, Malta.\n*1826 – University College London is founded as University of London.\n*1840 – Gaetano Donizetti's opera La fille du régiment receives its first performance in Paris, France.\n*1843 – Giuseppe Verdi's opera I Lombardi alla prima crociata receives its first performance in Milan, Italy.\n*1855 – Kassa Hailu is crowned Tewodros II, Emperor of Ethiopia, by Abuna Salama III in a ceremony at the church of Derasge Maryam\n*1856 – The Kingdom of Awadh is annexed by the British East India Company and Wajid Ali Shah, the king of Awadh, is imprisoned and later exiled to Calcutta.\n*1858 – Bernadette Soubirous's first vision of the Blessed Virgin Mary in Lourdes, France.\n*1861 – American Civil War: The United States House of Representatives unanimously passes a resolution guaranteeing noninterference with slavery in any state.\n*1873 – King Amadeo I of Spain abdicates.\n*1889 – Meiji Constitution of Japan is adopted; the first National Diet convenes in 1890.\n*1903 – Anton Bruckner's 9th Symphony receives its first performance in Vienna, Austria.\n*1906 – Pope Pius X publishes the encyclical Vehementer Nos.\n*1919 – Friedrich Ebert (SPD), is elected President of Germany.\n*1929 – Kingdom of Italy and the Vatican sign the Lateran Treaty.\n*1937 – The Flint sit-down strike ends when General Motors recognizes the United Auto Workers trade union.\n*1938 – BBC Television produces the world's first ever science fiction television program, an adaptation of a section of the Karel Čapek play R.U.R., that coined the term \"robot\".\n*1939 – A Lockheed P-38 Lightning flies from California to New York in seven hours two minutes.\n*1942 – World War II: The Battle of Bukit Timah is fought in Singapore.\n*1943 – World War II: General Dwight D. Eisenhower is selected to command the allied armies in Europe.\n*1953 – Cold War: U.S. President Dwight D. Eisenhower denies all appeals for clemency for Julius and Ethel Rosenberg.\n*  1953   – The Soviet Union breaks off diplomatic relations with Israel.\n*1959 – The Federation of Arab Emirates of the South, which will later become South Yemen, is created as a protectorate of the United Kingdom.\n*1964 – Greeks and Turks begin fighting in Limassol, Cyprus.\n*1971 – Cold War: Eighty-seven countries, including the United States, United Kingdom, and Soviet Union, sign the Seabed Arms Control Treaty outlawing nuclear weapons on the ocean floor in international waters.\n*1973 – Vietnam War: First release of American prisoners of war from Vietnam takes place.\n*1978 – Censorship: China lifts a ban on works by Aristotle, William Shakespeare and Charles Dickens.\n*1979 – The Iranian Revolution establishes an Islamic theocracy under the leadership of Ayatollah Ruhollah Khomeini.\n*1981 – Around 100000 USgal of radioactive coolant leak into the containment building of TVA Sequoyah 1 nuclear plant in Tennessee, contaminating eight workers.\n*1990 – Nelson Mandela is released from Victor Verster Prison outside Cape Town, South Africa after 27 years as a political prisoner.\n*  1990   – Buster Douglas, a 42:1 underdog, knocks out Mike Tyson in ten rounds at Tokyo to win boxing's world Heavyweight title.\n*1997 – Space Shuttle Discovery is launched on a mission to service the Hubble Space Telescope.\n*1999 – Pluto crosses Neptune's orbit, ending a nearly 20-year period (since 1979) when it was closer to the Sun than the gas giant; Pluto is not expected to interact with Neptune's orbit for another 228 years.\n*2001 – A Dutch programmer launched the Anna Kournikova virus infecting millions of emails via a trick photo of the tennis star.\n*2006 – U.S. Vice President Dick Cheney shot Harry Whittington, a 78-year-old Texas attorney, while participating in a quail hunt on a ranch in Riviera, Texas.\n*2008 – Rebel East Timorese soldiers seriously wound President José Ramos-Horta. Rebel leader Alfredo Reinado is killed in the attack.\n*2011 – Arab Spring: The first wave of the Egyptian revolution culminates in the resignation of Hosni Mubarak and the transfer of power to the Supreme Military Council after 18 days of protests.\n*2013 – The Vatican confirmed that Pope Benedict XVI would resign the papacy on 28 February 2013, as a result of his advanced age.\n*2014 – A military transport plane crashes in a mountainous area of Oum El Bouaghi Province in eastern Algeria, killing 77 people.\n*2015 – A university student was murdered as she resisted an attempted rape in Turkey, sparking nationwide protests and public outcry against harassment and violence against women.\n*2016 – A man shoots six people dead at an education center in Jizan Province, Saudi Arabia.\n*2017 – North Korea test fires a ballistic missile across the Sea of Japan.\n*2018 – Saratov Airlines Flight 703 crashes near Moscow, Russia. All 71 people on board die.\n\nBirths\n\n*1261 – Otto III, Duke of Bavaria (d. 1312)\n*1380 – Poggio Bracciolini, Italian scholar and translator (d. 1459)\n*1466 – Elizabeth of York (d. 1503)\n*1507 – Philip II, Metropolitan of Moscow (d. 1569)\n*1535 – Pope Gregory XIV (d. 1591)\n*1568 – Honoré d'Urfé, French author and playwright (d. 1625)\n*1649 – William Carstares, Scottish minister and academic (d. 1715)\n*1657 – Bernard Le Bovier de Fontenelle, French poet and playwright (d. 1757)\n*1708 – Egidio Duni, Italian composer (d. 1775)\n*1755 – Albert Christoph Dies, German composer and painter (d. 1822)\n*1764 – Joseph Chénier, French poet and playwright (d. 1811)\n*1776 – Ioannis Kapodistrias, Greek politician, 1st Governor of Greece (d. 1831)\n*1796 – Giovanni Pacini, Italian composer and educator (d. 1867)\n*1799 – Basil Moreau, French priest, founded the Congregation of Holy Cross (d. 1873)\n*1800 – Henry Fox Talbot, English photographer and politician, invented the calotype (d. 1877)\n*1802 – Lydia Maria Child, American journalist, author, and activist (d. 1880)\n*1805 – Jean Baptiste Charbonneau, American explorer (d. 1866)\n*1812 – Alexander H. Stephens, American lawyer and politician, Vice President of the Confederate States of America (d. 1883)\n*1813 – Otto Ludwig, German author, playwright, and critic (d. 1865)\n*1821 – Auguste Mariette, French archaeologist and scholar (d. 1881)\n*1830 – Hans Bronsart von Schellendorff, Prussian pianist and composer (d. 1913)\n*1833 – Melville Fuller, American lawyer and jurist, 8th Chief Justice of the United States (d. 1910)\n*1839 – Josiah Willard Gibbs, American physicist, mathematician, and academic (d. 1903)\n*1845 – Ahmet Tevfik Pasha, Ottoman soldier and politician, 272nd Grand Vizier of the Ottoman Empire (d. 1936)\n*1847 – Thomas Edison, American engineer and businessman, developed the light bulb and phonograph (d. 1931)\n*1855 – Ellen Day Hale, American painter and author (d. 1940)\n*1860 – Rachilde, French author and playwright (d. 1953)\n*1863 – John F. Fitzgerald, American politician; Mayor of Boston (d. 1950)\n*1864 – Louis Bouveault, French chemist (d. 1909)\n*1869 – Helene Kröller-Müller, German-Dutch art collector and philanthropist, founded the Kröller-Müller Museum (d. 1939)\n*  1869   – Else Lasker-Schüler, German poet and author (d. 1945)\n*1874 – Elsa Beskow, Swedish author and illustrator (d. 1953)\n*1881 – Carlo Carrà, Italian painter (d. 1966)\n*1891 – J. W. Hearne English cricketer (d. 1965)\n*1897 – Emil Leon Post, Polish-American mathematician and logician (d.1954)\n*1898 – Leo Szilard, Hungarian-American physicist and academic (d. 1964)\n*1900 – Ellen Broe, Danish nurse, pioneer in nursing education (d. 1994) \n*  1900 – Hans-Georg Gadamer, German philosopher and scholar (d. 2002)\n*  1900 – Jōsei Toda, Japanese educator and activist (d. 1958)\n*1902 – Arne Jacobsen, Danish architect, designed Aarhus City Hall and Radisson Blu Royal Hotel (d. 1971)\n*1904 – Keith Holyoake, New Zealand farmer and politician, 26th Prime Minister of New Zealand (d. 1983)\n*1908 – Philip Dunne, American director, producer, and screenwriter (d. 1992)\n*  1908   – Vivian Fuchs, English geologist and explorer (d. 1999)\n*1909 – Max Baer, American boxer and actor (d. 1959)\n*  1909   – Joseph L. Mankiewicz, American director, producer, and screenwriter (d. 1993)\n*1912 – Rudolf Firkušný, Czech-American pianist and educator (d. 1994)\n*1914 – Matt Dennis, American singer-songwriter and pianist (d. 2002)\n*  1914   – Josh White, American blues singer-songwriter, guitarist, actor, and activist (d. 1969)\n*1915 – Patrick Leigh Fermor, English soldier, author, and scholar (d. 2011)\n*  1915   – Richard Hamming, American mathematician and academic (d. 1998)\n*1917 – Sidney Sheldon, American author and screenwriter (d. 2007)\n*1919 – Eva Gabor, Hungarian-American actress, socialite and businesswoman (d. 1995)\n*1920 – Farouk of Egypt (d. 1965)\n*  1920   – Daniel F. Galouye, American author (d. 1976)\n*  1920   – Billy Halop, American actor (d. 1976)\n*  1920   – Dorothea Krook-Gilead, Latvian-South African author and translator (d. 1989)\n*  1920   – Daniel James, Jr., American general and pilot (d. 1978)\n*1921 – Lloyd Bentsen, American colonel and politician, 69th United States Secretary of the Treasury (d. 2006)\n*  1921   – Ottavio Missoni, Italian hurdler and fashion designer, founded Missoni (d. 2013)\n*  1921   – Edward Seidensticker, American scholar and translator (d. 2007)\n*1923 – Antony Flew, English philosopher and academic (d. 2010)\n*1924 – Budge Patty, American tennis player\n*1925 – Virginia E. Johnson, American psychologist and academic (d. 2013)\n*  1925   – Kim Stanley, American actress (d. 2001)\n*1926 – Paul Bocuse, French chef (d. 2018)\n*  1926   – Leslie Nielsen, Canadian-American actor and producer (d. 2010)\n*1927 – Sinclair Stevens, Canadian businessman, lawyer, and politician (d. 2016)\n*1928 – Ivan Hutchinson, Australian film critic and author (d. 1995)\n*1930 – Roy De Forest, American painter and academic (d. 2007)\n*1932 – Dennis Skinner, English miner and politician\n*1934 – Mel Carnahan, American lieutenant, lawyer, and politician, 51st Governor of Missouri (d. 2000)\n*  1934   – Tina Louise, American actress and singer\n*  1934   – Manuel Noriega, Panamanian general and politician, Military Leader of Panama (d. 2017)\n*  1934   – Mary Quant, British fashion designer\n*  1934   – John Surtees, English motorcycle racer and race car driver (d. 2017)\n*  1934   – David Taylor, English veterinarian and television host (d. 2013)\n*1935 – Gene Vincent, American singer and guitarist (d. 1971)\n*1936 – Burt Reynolds, American actor and director\n*1937 – Bill Lawry, Australian cricketer and sportscaster\n*  1937   – Eddie Shack, Canadian ice hockey player\n*  1937   – Phillip Walker, American singer and guitarist (d. 2010)\n*1938 – Bevan Congdon, New Zealand cricketer (d. 2018)\n*1939 – Gerry Goffin, American songwriter (d. 2014)\n*1940 – Mick Staton, American soldier and politician (d. 2014)\n*1941 – Sérgio Mendes, Brazilian pianist and composer\n*1942 – Otis Clay, American singer-songwriter (d. 2016)\n*1943 – Joselito, Spanish singer and actor\n*  1943   – Serge Lama, French singer-songwriter\n*  1943   – Alan Rubin, American trumpet player (d. 2011)\n*  1943   – Stan Szelest, American keyboard player (d. 1991)\n*1944 – Mike Oxley, American lawyer and politician (d. 2016)\n*  1944   – Joy Williams, American novelist, short story writer, and essayist\n*1945 – Burhan Ghalioun, Syrian academic and politician\n*1946 – Pierre Curzi, Canadian actor, screenwriter, and politician\n*  1946   – Ian Porterfield, Scottish-English footballer and manager (d. 2007)\n*1947 – Yukio Hatoyama, Japanese engineer and politician, 60th Prime Minister of Japan\n*  1947   – Johnny Manahan, Filipino actor, director, and screenwriter\n*  1947   – Derek Shulman, Scottish singer-songwriter and producer \n*1948 – Al Johnson, American singer-songwriter and producer (d. 2013)\n*  1948   – Yoshihito, Prince Katsura of Japan (d. 2014)\n*1951 – Mike Leavitt, American politician, 14th Governor of Utah\n*1953 – Philip Anglim, American actor\n*  1953   – Jeb Bush, American banker and politician, 43rd Governor of Florida\n*  1953   – Tom Veryzer, American baseball player (d. 2014)\n*1954 – Wesley Strick, American director and screenwriter\n*1955 – Warren Boland, Australian rugby league player and sportscaster\n*1956 – Catherine Hickland, American actress \n*  1956   – Didier Lockwood, French violinist (Magma)\n*  1956   – H.R., American punk rock singer-songwriter (Bad Brains) \n*1957 – Tina Ambani, Indian actress\n*  1957   – Peter Klashorst, Dutch painter, sculptor, and photographer\n*  1957   – Mitchell Symons, English author and journalist\n*1958 – Pepu Hernández, Spanish professional basketball coach\n*1959 – Deborah Meaden, English businesswoman\n*  1959   – Roberto Moreno, Brazilian race car driver\n*  1959   – Marzieh Vahid-Dastjerdi, Iranian educator and politician, Iranian Minister of Health\n*1960 – Momus, Scottish-Japanese author, journalist, and songwriter\n*  1960   – Richard Mastracchio, American engineer and astronaut\n*1961 – Carey Lowell, American model and actress\n*1962 – Tammy Baldwin, American lawyer and politician\n*  1962   – Sheryl Crow, American singer-songwriter, guitarist, and actress\n*  1962   – Bestia Salvaje, Mexican wrestler (d. 2008)\n*1963 – José Mari Bakero, Spanish footballer and manager\n*1964 – Adrian Hasler, Liechtensteiner police officer and politician, 13th Prime Minister of Liechtenstein\n*  1964   – Sarah Palin, American journalist and politician, 9th Governor of Alaska\n*  1964   – Ken Shamrock, American martial artist and wrestler\n*1965 – Vicki Wilson, Australian netball player and coach\n*1966 – Dieudonné M'bala M'bala, French comedian, actor, and activist\n*1967 – Hank Gathers, American basketball player (d. 1990)\n*  1967   – Paul McLoone, Irish singer, former radio producer, radio presenter, and voice actor \n*  1967   – Ty Treadway, American actor and talk show host\n*1968 – Mo Willems, American author and illustrator\n*1969 – Jennifer Aniston, American actress and producer\n*  1969   – Andreas Hilfiker, Swiss footballer\n*  1969   – John Salako, Nigerian-English footballer, manager, and sportscaster\n*1970 – Fredrik Thordendal, Swedish guitarist and songwriter \n*1971 – Damian Lewis, English actor \n*1972 – Steve McManaman, English footballer\n*  1972   – Bernd Meier, German footballer and coach (d. 2012)\n*1973 – Hernandez, American wrestler and promoter\n*  1973   – Varg Vikernes, Norwegian guitarist and songwriter \n*1974 – D'Angelo, American singer-songwriter, guitarist, and producer\n*  1974   – Nick Barmby, English footballer and manager\n*  1974   – Isaiah Mustafa, American football player and actor\n*  1974   – Jaroslav Špaček, Czech ice hockey player and coach\n*  1974   – Zain Verjee, Kenyan-Canadian journalist\n*1975 – Andy Lally, American racing driver\n*  1975   – Callum Thorp, Australian cricketer\n*  1975   – Jacque Vaughn, American basketball player and coach\n*1976 – Tony Battie, American basketball player and sportscaster\n*  1976   – Peter Hayes, American singer and guitarist \n*1977 – Ioannis Okkas, Cypriot footballer and manager\n*  1977   – Mike Shinoda, American singer-songwriter, guitarist, and producer \n*1979 – Brandy Norwood, American singer-songwriter, producer, and actress\n*1981 – Kelly Rowland, American singer-songwriter, dancer, and actress \n*1982 – Christian Maggio, Italian footballer\n*  1982   – Natalie Dormer, English actress\n*  1982   – Ľubomíra Kalinová, Slovak biathlete\n*  1982   – Neil Robertson, Australian snooker player\n*1983 – Rafael van der Vaart, Dutch footballer\n*1984 – Maarten Heisen, Dutch sprinter\n*  1984   – Marco Marcato, Italian cyclist\n*  1984   – Aubrey O'Day, American singer-songwriter, dancer, and actress \n*  1984   – Maxime Talbot, Canadian ice hockey player\n*1985 – William Beckett, American singer-songwriter and guitarist (The Academy Is...)\n*  1985   – Mike Richards, Canadian ice hockey player\n*  1985   – Šárka Strachová, Czech skier\n*1986 – Abu Omar al-Shishani, Georgian commander (d. 2016)\n*  1986   – Robin Hawkins, Welsh singer and bass player \n*  1986   – Kees Luyckx, Dutch footballer\n*1987 – Luca Antonelli, Italian footballer\n*  1987   – José Callejón, Spanish footballer\n*  1987   – Juanmi Callejón, Spanish footballer\n*  1987   – Ebba Busch Thor, Swedish politician\n*  1987   – Brian Matusz, American baseball player\n*  1987   – Jan Smeekens, Dutch speed skater\n*  1987   – Ellen van Dijk, Dutch cyclist\n*1988 – Vlad Moldoveanu, Romanian basketball player\n*1989 – Alexander Büttner, Dutch footballer\n*1990 – Javier Aquino, Mexican footballer\n*  1990   – Hwang Chan-sung, South Korean singer, rapper, and actor (2PM)\n*  1990   – Q'orianka Kilcher, American actress\n*1991 – Georgia May Foote, English actress\n*  1991   – Nikola Mirotic, Spanish basketball player\n*1992 – Lasse Norman Hansen, Danish track and road cyclist\n*  1992   – Taylor Lautner, American actor, model and martial artist\n*1993 – Ben McLemore, American basketball player\n*  1993   – Saana Saarteinen, Finnish tennis player\n*1995 – Yang Zhaoxuan, Chinese tennis player\n*1996 – Jonathan Tah, German footballer\n\nDeaths\n\n* AD 55 – Britannicus, Roman son of Claudius (b. 41)\n* 244 – Gordian III, Roman emperor (b. 225)\n* 641 – Heraclius, Byzantine emperor (b. 575)\n* 731 – Pope Gregory II (b. 669)\n* 806 – Emperor Shunzong of Tang (b. 761)\n* 824 – Pope Paschal I\n*1127 – William IX, Duke of Aquitaine (b. 1071)\n*1141 – Hugh of Saint Victor, German philosopher and theologian (b. 1096)\n*1160 – Minamoto no Yoshitomo, Japanese general (b. 1123)\n*1324 – Karl von Trier, Grand Master of the Teutonic Order\n*1358 – Ala-ud-Din Bahman Shah, first Bahmani Sultan of Deccan\n*1503 – Elizabeth of York (b. 1466)\n*1626 – Pietro Cataldi, Italian mathematician and astronomer (b. 1552)\n*1650 – René Descartes, French mathematician and philosopher (b. 1596)\n*1755 – Francesco Scipione, marchese di Maffei, Italian archaeologist, playwright, and critic (b. 1675)\n*1763 – William Shenstone, English poet and gardener (b. 1714)\n*1795 – Carl Michael Bellman, Swedish poet and composer (b. 1740)\n*1829 – Alexander Griboyedov, Russian poet, playwright, and composer (b. 1795)\n*1862 – Elizabeth Siddal, English poet and model (b. 1829)\n*1868 – Léon Foucault, French physicist and academic (b. 1819)\n*1901 – Milan I of Serbia (b. 1855)\n*1917 – Oswaldo Cruz, Brazilian physician and epidemiologist (b. 1872)\n*1918 – Alexey Kaledin, Russian general (b. 1861)\n*1923 – Wilhelm Killing, German mathematician and academic (b. 1847)\n*1931 – Charles Algernon Parsons, English-Irish engineer, invented the steam turbine (b. 1854)\n*1935 – Germanos Karavangelis, Greek-Austrian metropolitan (b. 1866)\n*1940 – John Buchan, Scottish-Canadian historian and politician, 15th Governor General of Canada (b. 1875)\n*  1940   – Ellen Day Hale, American painter and author (b. 1855)\n*1942 – Jamnalal Bajaj, Indian businessman and philanthropist, founded Bajaj Group (b. 1884)\n*  1942   – Ugo Pasquale Mifsud, Maltese politician, 3rd Prime Minister of Malta (b. 1889)\n*1947 – Martin Klein, Estonian wrestler and coach (b. 1884)\n*1948 – Sergei Eisenstein, Russian director and screenwriter (b. 1898)\n*1958 – Ernest Jones, Welsh neurologist and psychoanalyst (b. 1879)\n*1959 – Marshall Teague, American race car driver (b. 1922)\n*1963 – John Olof Dahlgren, Swedish-American soldier, Medal of Honor recipient (b. 1872)\n*  1963   – Sylvia Plath, American poet, novelist, and short story writer (b. 1932)\n*1967 – Trần Tử Bình, Vietnamese general and diplomat (b. 1907)\n*  1967   – A. J. Muste, Dutch-American minister and activist (b. 1885)\n*1968 – Howard Lindsay, American actor, director, producer, and playwright (b. 1888)\n*  1968   – Deendayal Upadhyaya, Indian journalist, economist, and politician (b. 1916)\n*1969 – Kosaburo Eto, Japanese nationalist and social activist (b. 1946)\n*1973 – J. Hans D. Jensen, German physicist and academic, Nobel Prize laureate (b. 1907)\n*1975 – Richard Ratsimandrava, Malagasy colonel and politician, President of Madagascar (b. 1931)\n*1976 – Lee J. Cobb, American actor (b. 1911)\n*  1976   – Alexander Lippisch, German pilot and engineer (b. 1894)\n*1977 – Fakhruddin Ali Ahmed, Indian lawyer and politician, 5th President of India (b. 1905)\n*  1977   – Louis Beel, Dutch academic and politician, Prime Minister of the Netherlands (b. 1902)\n*1978 – James Bryant Conant, American chemist, academic, and diplomat, 1st United States Ambassador to West Germany (b. 1893)\n*  1978   – Harry Martinson, Swedish novelist, essayist, and poet, Nobel Prize laureate (b. 1904)\n*1982 – Eleanor Powell, American actress and dancer (b. 1912)\n*1985 – Henry Hathaway, American actor, director, and producer (b. 1898)\n*  1985   – C. Suntharalingam, Sri Lankan academic, lawyer, and politician (b. 1895)\n*1986 – Frank Herbert, American journalist and author (b. 1920)\n*  1986   – Evelio Javier, Filipino lawyer and politician (b. 1942)\n*1989 – George O'Hanlon, American actor and voice artist (b. 1912)\n*1993 – Kamal Amrohi, Indian director and screenwriter (b. 1918)\n*  1993   – Robert W. Holley, American biochemist and academic, Nobel Prize laureate (b. 1922)\n*1994 – Neil Bonnett, American race car driver and sportscaster (b. 1946)\n*  1994   – Sorrell Booke, American lieutenant, actor, and director (b. 1930)\n*  1994   – William Conrad, American actor, director, and producer (b. 1920)\n*  1994   – Paul Feyerabend, Austrian-Swiss philosopher and academic (b. 1924)\n*  1994   – Nicole Germain, Canadian actress and journalist (b. 1917)\n*1996 – Kebby Musokotwane, Zambian politician, 5th Prime Minister of Zambia (b. 1946)\n*  1996   – Amelia Rosselli, Italian poet and author (b. 1930)\n*2000 – Lord Kitchner, Trinidadian singer (b. 1922)\n*  2000   – Roger Vadim, French director, producer, and screenwriter (b. 1928)\n*2002 – Frankie Crosetti, American baseball player and coach (b. 1910)\n*  2002   – Barry Foster, English actor (b. 1931)\n*2004 – Shirley Strickland, Australian runner and coach (b. 1925)\n*2005 – Jack L. Chalker, American author (b. 1944)\n*2006 – Peter Benchley, American author and screenwriter (b. 1940)\n*  2006   – Ken Fletcher, Australian tennis player (b. 1940)\n*  2006   – Jackie Pallo, English wrestler and actor (b. 1926)\n*2008 – Tom Lantos, American lawyer and politician (b. 1928)\n*  2008   – Frank Piasecki, American engineer (b. 1919)\n*2009 – Estelle Bennett, American singer (b. 1941)\n*  2009   – Willem Johan Kolff, Dutch-American physician and academic (b. 1911)\n*2010 – Heward Grafftey, Canadian businessman and politician (b. 1928)\n*  2010   – Alexander McQueen, English fashion designer, founder of his eponymous brand (b. 1969)\n*2011 – Chuck Tanner, American baseball player and manager (b. 1928)\n*2012 – Siri Bjerke, Norwegian politician, Norwegian Minister of the Environment (b. 1958)\n*  2012   – Aharon Davidi, Israeli general (b. 1927)\n*  2012   – Whitney Houston, American singer-songwriter, producer, and actress (b. 1963)\n*2013 – Jim Boatwright, American basketball player and coach (b. 1952)\n*  2013   – Rick Huxley, English bass player (b. 1940)\n*  2013   – D. Vinayachandran, Indian poet and educator (b. 1946)\n*2014 – Alice Babs, Swedish singer and actress (b. 1924)\n*  2014   – Tito Canepa, Dominican-American painter (b. 1916)\n*  2014   – Fernando González Pacheco, Spanish-Colombian journalist and actor (b. 1932)\n*2015 – Anne Cuneo, Swiss journalist and author (b. 1936)\n*  2015   – Roger Hanin, Algeria-born French actor, director, and screenwriter (b. 1925)\n*  2015   – Bob Simon, American journalist (b. 1941)\n*  2015   – Jerry Tarkanian, American basketball player and coach (b. 1930)\n*2016 – Kevin Randleman, American mixed martial artist and wrestler (b. 1971)\n*  2016   – Zeng Xuelin, Thai-Chinese footballer and manager (b. 1929)\n*2017 – Fab Melo, Brazilian basketball player (b. 1990)\n*  2017   – Jaap Rijks, Dutch Olympic medalist (b. 1919)\n*2018 – Vic Damone, American singer, songwriter and actor (b. 1928)[https://www.nytimes.com/2018/02/12/obituaries/vic-damone-singer-dies.html Vic Damone, Who Crooned to Postwar Popularity, Dies at 89] The New York Times, February 12, 2018\n*  2018   – Asma Jahangir, Pakistani human-rights lawyer and social activist (b. 1952)\n\n*  2018   – Jan Maxwell, American stage and television actress (b. 1956)McPhee, Ryan. [http://www.playbill.com/article/jan-maxwell-a-five-time-tony-award-nominee-dies-at-61# \"Jan Maxwell, a Five-Time Tony Award Nominee, Dies at 61\"]  Playbill, February 11, 2018\n*  2018   – Qazi Wajid, Pakistani drama actor, writer & artist. (b. 1930)\n\nHolidays and observances\n\n* Christian feast day:\n** Blaise Eastern Orthodox liturgics\n** Cædmon, first recorded Christian poet in England, circa 680 CE (Anglicanism)\n** Fanny Crosby (Episcopal Church (USA))\n** Gobnait\n** Gregory II\n** February 11 (s)\n* 112 day (European Union)\n* Armed Forces Day (Liberia)\n* Day of Revenue Service (Azerbaijan)\n* Evelio Javier Day (Panay Island, the Philippines)\n* Feast day of Our Lady of Lourdes (Catholic Church), and its related observance:\n** World Day of the Sick (Roman Catholic Church)\n* Inventors' Day (United States)\n* National Foundation Day (Japan)\n* Youth Day (Cameroon)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 11" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11184" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*660 BC – Traditional date for the foundation of Japan by Emperor Jimmu.\n* AD 55 – Tiberius Claudius Caesar Britannicus, heir to the Roman emperorship, dies under mysterious circumstances in Rome. This clears the way for Nero to become Emperor.\n* 244 – Emperor Gordian III is murdered by mutinous soldiers in Zaitha (Mesopotamia). A mound is raised at Carchemish in his memory.\n*1177 – John de Courcy's army defeats the native Dunleavey Clan in Ulster. The English establish themselves in Ulster.\n*1534 – Henry VIII of England is recognized as supreme head of the Church of England.\n*1626 – Emperor Susenyos I of Ethiopia and Patriarch Afonso Mendes declare the primacy of the Roman See over the Ethiopian Church, and Catholicism to be the state religion of Ethiopia.\n*1659 – The assault on Copenhagen by Swedish forces is beaten back with heavy losses.\n*1790 – The Religious Society of Friends, also known as Quakers, petitions U.S. Congress for the abolition of slavery.\n*1794 – First session of United States Senate opens to the public.\n*1808 – Jesse Fell burns anthracite on an open grate as an experiment in heating homes with coal.\n*1812 – Massachusetts governor Elbridge Gerry is accused of \"gerrymandering\" for the first time.\n*1823 – Carnival tragedy of 1823: About 110 boys are killed during a stampede at the Convent of the Minori Osservanti in Valletta, Malta.\n*1826 – University College London is founded as University of London.\n*1840 – Gaetano Donizetti's opera La fille du régiment receives its first performance in Paris, France.\n*1843 – Giuseppe Verdi's opera I Lombardi alla prima crociata receives its first performance in Milan, Italy.\n*1855 – Kassa Hailu is crowned Tewodros II, Emperor of Ethiopia, by Abuna Salama III in a ceremony at the church of Derasge Maryam\n*1856 – The Kingdom of Awadh is annexed by the British East India Company and Wajid Ali Shah, the king of Awadh, is imprisoned and later exiled to Calcutta.\n*1858 – Bernadette Soubirous's first vision of the Blessed Virgin Mary in Lourdes, France.\n*1861 – American Civil War: The United States House of Representatives unanimously passes a resolution guaranteeing noninterference with slavery in any state.\n*1873 – King Amadeo I of Spain abdicates.\n*1889 – Meiji Constitution of Japan is adopted; the first National Diet convenes in 1890.\n*1903 – Anton Bruckner's 9th Symphony receives its first performance in Vienna, Austria.\n*1906 – Pope Pius X publishes the encyclical Vehementer Nos.\n*1919 – Friedrich Ebert (SPD), is elected President of Germany.\n*1929 – Kingdom of Italy and the Vatican sign the Lateran Treaty.\n*1937 – The Flint sit-down strike ends when General Motors recognizes the United Auto Workers trade union.\n*1938 – BBC Television produces the world's first ever science fiction television program, an adaptation of a section of the Karel Čapek play R.U.R., that coined the term \"robot\".\n*1939 – A Lockheed P-38 Lightning flies from California to New York in seven hours two minutes.\n*1942 – World War II: The Battle of Bukit Timah is fought in Singapore.\n*1943 – World War II: General Dwight D. Eisenhower is selected to command the allied armies in Europe.\n*1953 – Cold War: U.S. President Dwight D. Eisenhower denies all appeals for clemency for Julius and Ethel Rosenberg.\n*  1953   – The Soviet Union breaks off diplomatic relations with Israel.\n*1959 – The Federation of Arab Emirates of the South, which will later become South Yemen, is created as a protectorate of the United Kingdom.\n*1964 – Greeks and Turks begin fighting in Limassol, Cyprus.\n*1971 – Cold War: Eighty-seven countries, including the United States, United Kingdom, and Soviet Union, sign the Seabed Arms Control Treaty outlawing nuclear weapons on the ocean floor in international waters.\n*1973 – Vietnam War: First release of American prisoners of war from Vietnam takes place.\n*1978 – Censorship: China lifts a ban on works by Aristotle, William Shakespeare and Charles Dickens.\n*1979 – The Iranian Revolution establishes an Islamic theocracy under the leadership of Ayatollah Ruhollah Khomeini.\n*1981 – Around 100000 USgal of radioactive coolant leak into the containment building of TVA Sequoyah 1 nuclear plant in Tennessee, contaminating eight workers.\n*1990 – Nelson Mandela is released from Victor Verster Prison outside Cape Town, South Africa after 27 years as a political prisoner.\n*  1990   – Buster Douglas, a 42:1 underdog, knocks out Mike Tyson in ten rounds at Tokyo to win boxing's world Heavyweight title.\n*1997 – Space Shuttle Discovery is launched on a mission to service the Hubble Space Telescope.\n*1999 – Pluto crosses Neptune's orbit, ending a nearly 20-year period (since 1979) when it was closer to the Sun than the gas giant; Pluto is not expected to interact with Neptune's orbit for another 228 years.\n*2001 – A Dutch programmer launched the Anna Kournikova virus infecting millions of emails via a trick photo of the tennis star.\n*2006 – U.S. Vice President Dick Cheney shot Harry Whittington, a 78-year-old Texas attorney, while participating in a quail hunt on a ranch in Riviera, Texas.\n*2008 – Rebel East Timorese soldiers seriously wound President José Ramos-Horta. Rebel leader Alfredo Reinado is killed in the attack.\n*2011 – Arab Spring: The first wave of the Egyptian revolution culminates in the resignation of Hosni Mubarak and the transfer of power to the Supreme Military Council after 18 days of protests.\n*2013 – The Vatican confirmed that Pope Benedict XVI would resign the papacy on 28 February 2013, as a result of his advanced age.\n*2014 – A military transport plane crashes in a mountainous area of Oum El Bouaghi Province in eastern Algeria, killing 77 people.\n*2015 – A university student was murdered as she resisted an attempted rape in Turkey, sparking nationwide protests and public outcry against harassment and violence against women.\n*2016 – A man shoots six people dead at an education center in Jizan Province, Saudi Arabia.\n*2017 – North Korea test fires a ballistic missile across the Sea of Japan.\n*2018 – Saratov Airlines Flight 703 crashes near Moscow, Russia. All 71 people on board die.\n\nBirths\n\n*1261 – Otto III, Duke of Bavaria (d. 1312)\n*1380 – Poggio Bracciolini, Italian scholar and translator (d. 1459)\n*1466 – Elizabeth of York (d. 1503)\n*1507 – Philip II, Metropolitan of Moscow (d. 1569)\n*1535 – Pope Gregory XIV (d. 1591)\n*1568 – Honoré d'Urfé, French author and playwright (d. 1625)\n*1649 – William Carstares, Scottish minister and academic (d. 1715)\n*1657 – Bernard Le Bovier de Fontenelle, French poet and playwright (d. 1757)\n*1708 – Egidio Duni, Italian composer (d. 1775)\n*1755 – Albert Christoph Dies, German composer and painter (d. 1822)\n*1764 – Joseph Chénier, French poet and playwright (d. 1811)\n*1776 – Ioannis Kapodistrias, Greek politician, 1st Governor of Greece (d. 1831)\n*1796 – Giovanni Pacini, Italian composer and educator (d. 1867)\n*1799 – Basil Moreau, French priest, founded the Congregation of Holy Cross (d. 1873)\n*1800 – Henry Fox Talbot, English photographer and politician, invented the calotype (d. 1877)\n*1802 – Lydia Maria Child, American journalist, author, and activist (d. 1880)\n*1805 – Jean Baptiste Charbonneau, American explorer (d. 1866)\n*1812 – Alexander H. Stephens, American lawyer and politician, Vice President of the Confederate States of America (d. 1883)\n*1813 – Otto Ludwig, German author, playwright, and critic (d. 1865)\n*1821 – Auguste Mariette, French archaeologist and scholar (d. 1881)\n*1830 – Hans Bronsart von Schellendorff, Prussian pianist and composer (d. 1913)\n*1833 – Melville Fuller, American lawyer and jurist, 8th Chief Justice of the United States (d. 1910)\n*1839 – Josiah Willard Gibbs, American physicist, mathematician, and academic (d. 1903)\n*1845 – Ahmet Tevfik Pasha, Ottoman soldier and politician, 272nd Grand Vizier of the Ottoman Empire (d. 1936)\n*1847 – Thomas Edison, American engineer and businessman, developed the light bulb and phonograph (d. 1931)\n*1855 – Ellen Day Hale, American painter and author (d. 1940)\n*1860 – Rachilde, French author and playwright (d. 1953)\n*1863 – John F. Fitzgerald, American politician; Mayor of Boston (d. 1950)\n*1864 – Louis Bouveault, French chemist (d. 1909)\n*1869 – Helene Kröller-Müller, German-Dutch art collector and philanthropist, founded the Kröller-Müller Museum (d. 1939)\n*  1869   – Else Lasker-Schüler, German poet and author (d. 1945)\n*1874 – Elsa Beskow, Swedish author and illustrator (d. 1953)\n*1881 – Carlo Carrà, Italian painter (d. 1966)\n*1891 – J. W. Hearne English cricketer (d. 1965)\n*1897 – Emil Leon Post, Polish-American mathematician and logician (d.1954)\n*1898 – Leo Szilard, Hungarian-American physicist and academic (d. 1964)\n*1900 – Ellen Broe, Danish nurse, pioneer in nursing education (d. 1994) \n*  1900 – Hans-Georg Gadamer, German philosopher and scholar (d. 2002)\n*  1900 – Jōsei Toda, Japanese educator and activist (d. 1958)\n*1902 – Arne Jacobsen, Danish architect, designed Aarhus City Hall and Radisson Blu Royal Hotel (d. 1971)\n*1904 – Keith Holyoake, New Zealand farmer and politician, 26th Prime Minister of New Zealand (d. 1983)\n*1908 – Philip Dunne, American director, producer, and screenwriter (d. 1992)\n*  1908   – Vivian Fuchs, English geologist and explorer (d. 1999)\n*1909 – Max Baer, American boxer and actor (d. 1959)\n*  1909   – Joseph L. Mankiewicz, American director, producer, and screenwriter (d. 1993)\n*1912 – Rudolf Firkušný, Czech-American pianist and educator (d. 1994)\n*1914 – Matt Dennis, American singer-songwriter and pianist (d. 2002)\n*  1914   – Josh White, American blues singer-songwriter, guitarist, actor, and activist (d. 1969)\n*1915 – Patrick Leigh Fermor, English soldier, author, and scholar (d. 2011)\n*  1915   – Richard Hamming, American mathematician and academic (d. 1998)\n*1917 – Sidney Sheldon, American author and screenwriter (d. 2007)\n*1919 – Eva Gabor, Hungarian-American actress, socialite and businesswoman (d. 1995)\n*1920 – Farouk of Egypt (d. 1965)\n*  1920   – Daniel F. Galouye, American author (d. 1976)\n*  1920   – Billy Halop, American actor (d. 1976)\n*  1920   – Dorothea Krook-Gilead, Latvian-South African author and translator (d. 1989)\n*  1920   – Daniel James, Jr., American general and pilot (d. 1978)\n*1921 – Lloyd Bentsen, American colonel and politician, 69th United States Secretary of the Treasury (d. 2006)\n*  1921   – Ottavio Missoni, Italian hurdler and fashion designer, founded Missoni (d. 2013)\n*  1921   – Edward Seidensticker, American scholar and translator (d. 2007)\n*1923 – Antony Flew, English philosopher and academic (d. 2010)\n*1924 – Budge Patty, American tennis player\n*1925 – Virginia E. Johnson, American psychologist and academic (d. 2013)\n*  1925   – Kim Stanley, American actress (d. 2001)\n*1926 – Paul Bocuse, French chef (d. 2018)\n*  1926   – Leslie Nielsen, Canadian-American actor and producer (d. 2010)\n*1927 – Sinclair Stevens, Canadian businessman, lawyer, and politician (d. 2016)\n*1928 – Ivan Hutchinson, Australian film critic and author (d. 1995)\n*1930 – Roy De Forest, American painter and academic (d. 2007)\n*1932 – Dennis Skinner, English miner and politician\n*1934 – Mel Carnahan, American lieutenant, lawyer, and politician, 51st Governor of Missouri (d. 2000)\n*  1934   – Tina Louise, American actress and singer\n*  1934   – Manuel Noriega, Panamanian general and politician, Military Leader of Panama (d. 2017)\n*  1934   – Mary Quant, British fashion designer\n*  1934   – John Surtees, English motorcycle racer and race car driver (d. 2017)\n*  1934   – David Taylor, English veterinarian and television host (d. 2013)\n*1935 – Gene Vincent, American singer and guitarist (d. 1971)\n*1936 – Burt Reynolds, American actor and director\n*1937 – Bill Lawry, Australian cricketer and sportscaster\n*  1937   – Eddie Shack, Canadian ice hockey player\n*  1937   – Phillip Walker, American singer and guitarist (d. 2010)\n*1938 – Bevan Congdon, New Zealand cricketer (d. 2018)\n*1939 – Gerry Goffin, American songwriter (d. 2014)\n*1940 – Mick Staton, American soldier and politician (d. 2014)\n*1941 – Sérgio Mendes, Brazilian pianist and composer\n*1942 – Otis Clay, American singer-songwriter (d. 2016)\n*1943 – Joselito, Spanish singer and actor\n*  1943   – Serge Lama, French singer-songwriter\n*  1943   – Alan Rubin, American trumpet player (d. 2011)\n*  1943   – Stan Szelest, American keyboard player (d. 1991)\n*1944 – Mike Oxley, American lawyer and politician (d. 2016)\n*  1944   – Joy Williams, American novelist, short story writer, and essayist\n*1945 – Burhan Ghalioun, Syrian academic and politician\n*1946 – Pierre Curzi, Canadian actor, screenwriter, and politician\n*  1946   – Ian Porterfield, Scottish-English footballer and manager (d. 2007)\n*1947 – Yukio Hatoyama, Japanese engineer and politician, 60th Prime Minister of Japan\n*  1947   – Johnny Manahan, Filipino actor, director, and screenwriter\n*  1947   – Derek Shulman, Scottish singer-songwriter and producer \n*1948 – Al Johnson, American singer-songwriter and producer (d. 2013)\n*  1948   – Yoshihito, Prince Katsura of Japan (d. 2014)\n*1951 – Mike Leavitt, American politician, 14th Governor of Utah\n*1953 – Philip Anglim, American actor\n*  1953   – Jeb Bush, American banker and politician, 43rd Governor of Florida\n*  1953   – Tom Veryzer, American baseball player (d. 2014)\n*1954 – Wesley Strick, American director and screenwriter\n*1955 – Warren Boland, Australian rugby league player and sportscaster\n*1956 – Catherine Hickland, American actress \n*  1956   – Didier Lockwood, French violinist (Magma)\n*  1956   – H.R., American punk rock singer-songwriter (Bad Brains) \n*1957 – Tina Ambani, Indian actress\n*  1957   – Peter Klashorst, Dutch painter, sculptor, and photographer\n*  1957   – Mitchell Symons, English author and journalist\n*1958 – Pepu Hernández, Spanish professional basketball coach\n*1959 – Deborah Meaden, English businesswoman\n*  1959   – Roberto Moreno, Brazilian race car driver\n*  1959   – Marzieh Vahid-Dastjerdi, Iranian educator and politician, Iranian Minister of Health\n*1960 – Momus, Scottish-Japanese author, journalist, and songwriter\n*  1960   – Richard Mastracchio, American engineer and astronaut\n*1961 – Carey Lowell, American model and actress\n*1962 – Tammy Baldwin, American lawyer and politician\n*  1962   – Sheryl Crow, American singer-songwriter, guitarist, and actress\n*  1962   – Bestia Salvaje, Mexican wrestler (d. 2008)\n*1963 – José Mari Bakero, Spanish footballer and manager\n*1964 – Adrian Hasler, Liechtensteiner police officer and politician, 13th Prime Minister of Liechtenstein\n*  1964   – Sarah Palin, American journalist and politician, 9th Governor of Alaska\n*  1964   – Ken Shamrock, American martial artist and wrestler\n*1965 – Vicki Wilson, Australian netball player and coach\n*1966 – Dieudonné M'bala M'bala, French comedian, actor, and activist\n*1967 – Hank Gathers, American basketball player (d. 1990)\n*  1967   – Paul McLoone, Irish singer, former radio producer, radio presenter, and voice actor \n*  1967   – Ty Treadway, American actor and talk show host\n*1968 – Mo Willems, American author and illustrator\n*1969 – Jennifer Aniston, American actress and producer\n*  1969   – Andreas Hilfiker, Swiss footballer\n*  1969   – John Salako, Nigerian-English footballer, manager, and sportscaster\n*1970 – Fredrik Thordendal, Swedish guitarist and songwriter \n*1971 – Damian Lewis, English actor \n*1972 – Steve McManaman, English footballer\n*  1972   – Bernd Meier, German footballer and coach (d. 2012)\n*1973 – Hernandez, American wrestler and promoter\n*  1973   – Varg Vikernes, Norwegian guitarist and songwriter \n*1974 – D'Angelo, American singer-songwriter, guitarist, and producer\n*  1974   – Nick Barmby, English footballer and manager\n*  1974   – Isaiah Mustafa, American football player and actor\n*  1974   – Jaroslav Špaček, Czech ice hockey player and coach\n*  1974   – Zain Verjee, Kenyan-Canadian journalist\n*1975 – Andy Lally, American racing driver\n*  1975   – Callum Thorp, Australian cricketer\n*  1975   – Jacque Vaughn, American basketball player and coach\n*1976 – Tony Battie, American basketball player and sportscaster\n*  1976   – Peter Hayes, American singer and guitarist \n*1977 – Ioannis Okkas, Cypriot footballer and manager\n*  1977   – Mike Shinoda, American singer-songwriter, guitarist, and producer \n*1979 – Brandy Norwood, American singer-songwriter, producer, and actress\n*1981 – Kelly Rowland, American singer-songwriter, dancer, and actress \n*1982 – Christian Maggio, Italian footballer\n*  1982   – Natalie Dormer, English actress\n*  1982   – Ľubomíra Kalinová, Slovak biathlete\n*  1982   – Neil Robertson, Australian snooker player\n*1983 – Rafael van der Vaart, Dutch footballer\n*1984 – Maarten Heisen, Dutch sprinter\n*  1984   – Marco Marcato, Italian cyclist\n*  1984   – Aubrey O'Day, American singer-songwriter, dancer, and actress \n*  1984   – Maxime Talbot, Canadian ice hockey player\n*1985 – William Beckett, American singer-songwriter and guitarist (The Academy Is...)\n*  1985   – Mike Richards, Canadian ice hockey player\n*  1985   – Šárka Strachová, Czech skier\n*1986 – Abu Omar al-Shishani, Georgian commander (d. 2016)\n*  1986   – Robin Hawkins, Welsh singer and bass player \n*  1986   – Kees Luyckx, Dutch footballer\n*1987 – Luca Antonelli, Italian footballer\n*  1987   – José Callejón, Spanish footballer\n*  1987   – Juanmi Callejón, Spanish footballer\n*  1987   – Ebba Busch Thor, Swedish politician\n*  1987   – Brian Matusz, American baseball player\n*  1987   – Jan Smeekens, Dutch speed skater\n*  1987   – Ellen van Dijk, Dutch cyclist\n*1988 – Vlad Moldoveanu, Romanian basketball player\n*1989 – Alexander Büttner, Dutch footballer\n*1990 – Javier Aquino, Mexican footballer\n*  1990   – Hwang Chan-sung, South Korean singer, rapper, and actor (2PM)\n*  1990   – Q'orianka Kilcher, American actress\n*1991 – Georgia May Foote, English actress\n*  1991   – Nikola Mirotic, Spanish basketball player\n*1992 – Lasse Norman Hansen, Danish track and road cyclist\n*  1992   – Taylor Lautner, American actor, model and martial artist\n*1993 – Ben McLemore, American basketball player\n*  1993   – Saana Saarteinen, Finnish tennis player\n*1995 – Yang Zhaoxuan, Chinese tennis player\n*1996 – Jonathan Tah, German footballer\n\nDeaths\n\n* AD 55 – Britannicus, Roman son of Claudius (b. 41)\n* 244 – Gordian III, Roman emperor (b. 225)\n* 641 – Heraclius, Byzantine emperor (b. 575)\n* 731 – Pope Gregory II (b. 669)\n* 806 – Emperor Shunzong of Tang (b. 761)\n* 824 – Pope Paschal I\n*1127 – William IX, Duke of Aquitaine (b. 1071)\n*1141 – Hugh of Saint Victor, German philosopher and theologian (b. 1096)\n*1160 – Minamoto no Yoshitomo, Japanese general (b. 1123)\n*1324 – Karl von Trier, Grand Master of the Teutonic Order\n*1358 – Ala-ud-Din Bahman Shah, first Bahmani Sultan of Deccan\n*1503 – Elizabeth of York (b. 1466)\n*1626 – Pietro Cataldi, Italian mathematician and astronomer (b. 1552)\n*1650 – René Descartes, French mathematician and philosopher (b. 1596)\n*1755 – Francesco Scipione, marchese di Maffei, Italian archaeologist, playwright, and critic (b. 1675)\n*1763 – William Shenstone, English poet and gardener (b. 1714)\n*1795 – Carl Michael Bellman, Swedish poet and composer (b. 1740)\n*1829 – Alexander Griboyedov, Russian poet, playwright, and composer (b. 1795)\n*1862 – Elizabeth Siddal, English poet and model (b. 1829)\n*1868 – Léon Foucault, French physicist and academic (b. 1819)\n*1901 – Milan I of Serbia (b. 1855)\n*1917 – Oswaldo Cruz, Brazilian physician and epidemiologist (b. 1872)\n*1918 – Alexey Kaledin, Russian general (b. 1861)\n*1923 – Wilhelm Killing, German mathematician and academic (b. 1847)\n*1931 – Charles Algernon Parsons, English-Irish engineer, invented the steam turbine (b. 1854)\n*1935 – Germanos Karavangelis, Greek-Austrian metropolitan (b. 1866)\n*1940 – John Buchan, Scottish-Canadian historian and politician, 15th Governor General of Canada (b. 1875)\n*  1940   – Ellen Day Hale, American painter and author (b. 1855)\n*1942 – Jamnalal Bajaj, Indian businessman and philanthropist, founded Bajaj Group (b. 1884)\n*  1942   – Ugo Pasquale Mifsud, Maltese politician, 3rd Prime Minister of Malta (b. 1889)\n*1947 – Martin Klein, Estonian wrestler and coach (b. 1884)\n*1948 – Sergei Eisenstein, Russian director and screenwriter (b. 1898)\n*1958 – Ernest Jones, Welsh neurologist and psychoanalyst (b. 1879)\n*1959 – Marshall Teague, American race car driver (b. 1922)\n*1963 – John Olof Dahlgren, Swedish-American soldier, Medal of Honor recipient (b. 1872)\n*  1963   – Sylvia Plath, American poet, novelist, and short story writer (b. 1932)\n*1967 – Trần Tử Bình, Vietnamese general and diplomat (b. 1907)\n*  1967   – A. J. Muste, Dutch-American minister and activist (b. 1885)\n*1968 – Howard Lindsay, American actor, director, producer, and playwright (b. 1888)\n*  1968   – Deendayal Upadhyaya, Indian journalist, economist, and politician (b. 1916)\n*1969 – Kosaburo Eto, Japanese nationalist and social activist (b. 1946)\n*1973 – J. Hans D. Jensen, German physicist and academic, Nobel Prize laureate (b. 1907)\n*1975 – Richard Ratsimandrava, Malagasy colonel and politician, President of Madagascar (b. 1931)\n*1976 – Lee J. Cobb, American actor (b. 1911)\n*  1976   – Alexander Lippisch, German pilot and engineer (b. 1894)\n*1977 – Fakhruddin Ali Ahmed, Indian lawyer and politician, 5th President of India (b. 1905)\n*  1977   – Louis Beel, Dutch academic and politician, Prime Minister of the Netherlands (b. 1902)\n*1978 – James Bryant Conant, American chemist, academic, and diplomat, 1st United States Ambassador to West Germany (b. 1893)\n*  1978   – Harry Martinson, Swedish novelist, essayist, and poet, Nobel Prize laureate (b. 1904)\n*1982 – Eleanor Powell, American actress and dancer (b. 1912)\n*1985 – Henry Hathaway, American actor, director, and producer (b. 1898)\n*  1985   – C. Suntharalingam, Sri Lankan academic, lawyer, and politician (b. 1895)\n*1986 – Frank Herbert, American journalist and author (b. 1920)\n*  1986   – Evelio Javier, Filipino lawyer and politician (b. 1942)\n*1989 – George O'Hanlon, American actor and voice artist (b. 1912)\n*1993 – Kamal Amrohi, Indian director and screenwriter (b. 1918)\n*  1993   – Robert W. Holley, American biochemist and academic, Nobel Prize laureate (b. 1922)\n*1994 – Neil Bonnett, American race car driver and sportscaster (b. 1946)\n*  1994   – Sorrell Booke, American lieutenant, actor, and director (b. 1930)\n*  1994   – William Conrad, American actor, director, and producer (b. 1920)\n*  1994   – Paul Feyerabend, Austrian-Swiss philosopher and academic (b. 1924)\n*  1994   – Nicole Germain, Canadian actress and journalist (b. 1917)\n*1996 – Kebby Musokotwane, Zambian politician, 5th Prime Minister of Zambia (b. 1946)\n*  1996   – Amelia Rosselli, Italian poet and author (b. 1930)\n*2000 – Lord Kitchner, Trinidadian singer (b. 1922)\n*  2000   – Roger Vadim, French director, producer, and screenwriter (b. 1928)\n*2002 – Frankie Crosetti, American baseball player and coach (b. 1910)\n*  2002   – Barry Foster, English actor (b. 1931)\n*2004 – Shirley Strickland, Australian runner and coach (b. 1925)\n*2005 – Jack L. Chalker, American author (b. 1944)\n*2006 – Peter Benchley, American author and screenwriter (b. 1940)\n*  2006   – Ken Fletcher, Australian tennis player (b. 1940)\n*  2006   – Jackie Pallo, English wrestler and actor (b. 1926)\n*2008 – Tom Lantos, American lawyer and politician (b. 1928)\n*  2008   – Frank Piasecki, American engineer (b. 1919)\n*2009 – Estelle Bennett, American singer (b. 1941)\n*  2009   – Willem Johan Kolff, Dutch-American physician and academic (b. 1911)\n*2010 – Heward Grafftey, Canadian businessman and politician (b. 1928)\n*  2010   – Alexander McQueen, English fashion designer, founder of his eponymous brand (b. 1969)\n*2011 – Chuck Tanner, American baseball player and manager (b. 1928)\n*2012 – Siri Bjerke, Norwegian politician, Norwegian Minister of the Environment (b. 1958)\n*  2012   – Aharon Davidi, Israeli general (b. 1927)\n*  2012   – Whitney Houston, American singer-songwriter, producer, and actress (b. 1963)\n*2013 – Jim Boatwright, American basketball player and coach (b. 1952)\n*  2013   – Rick Huxley, English bass player (b. 1940)\n*  2013   – D. Vinayachandran, Indian poet and educator (b. 1946)\n*2014 – Alice Babs, Swedish singer and actress (b. 1924)\n*  2014   – Tito Canepa, Dominican-American painter (b. 1916)\n*  2014   – Fernando González Pacheco, Spanish-Colombian journalist and actor (b. 1932)\n*2015 – Anne Cuneo, Swiss journalist and author (b. 1936)\n*  2015   – Roger Hanin, Algeria-born French actor, director, and screenwriter (b. 1925)\n*  2015   – Bob Simon, American journalist (b. 1941)\n*  2015   – Jerry Tarkanian, American basketball player and coach (b. 1930)\n*2016 – Kevin Randleman, American mixed martial artist and wrestler (b. 1971)\n*  2016   – Zeng Xuelin, Thai-Chinese footballer and manager (b. 1929)\n*2017 – Fab Melo, Brazilian basketball player (b. 1990)\n*  2017   – Jaap Rijks, Dutch Olympic medalist (b. 1919)\n*2018 – Vic Damone, American singer, songwriter and actor (b. 1928)[https://www.nytimes.com/2018/02/12/obituaries/vic-damone-singer-dies.html Vic Damone, Who Crooned to Postwar Popularity, Dies at 89] The New York Times, February 12, 2018\n*  2018   – Asma Jahangir, Pakistani human-rights lawyer and social activist (b. 1952)\n\n*  2018   – Jan Maxwell, American stage and television actress (b. 1956)McPhee, Ryan. [http://www.playbill.com/article/jan-maxwell-a-five-time-tony-award-nominee-dies-at-61# \"Jan Maxwell, a Five-Time Tony Award Nominee, Dies at 61\"]  Playbill, February 11, 2018\n*  2018   – Qazi Wajid, Pakistani drama actor, writer & artist. (b. 1930)\n\nHolidays and observances\n\n* Christian feast day:\n** Blaise Eastern Orthodox liturgics\n** Cædmon, first recorded Christian poet in England, circa 680 CE (Anglicanism)\n** Fanny Crosby (Episcopal Church (USA))\n** Gobnait\n** Gregory II\n** February 11 (s)\n* 112 day (European Union)\n* Armed Forces Day (Liberia)\n* Day of Revenue Service (Azerbaijan)\n* Evelio Javier Day (Panay Island, the Philippines)\n* Feast day of Our Lady of Lourdes (Catholic Church), and its related observance:\n** World Day of the Sick (Roman Catholic Church)\n* Inventors' Day (United States)\n* National Foundation Day (Japan)\n* Youth Day (Cameroon). February 11. http://en.wikipedia.org/?curid=11184."
  }
}
