{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18616",
  "eid" : "33f8f490-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596441,
  "textBody" : "Lollardy (Lollardism, Lollard movement) was a pre-Protestant Christian religious movement that existed from the mid-14th century to the English Reformation. It was initially led by John Wycliffe,. a Roman Catholic theologian who was dismissed from the University of Oxford in 1381 for criticism of the Roman Catholic Church. The Lollards' demands were primarily for reform of Western Christianity.\n\nEtymology\n\nLollard, Lollardi or Loller was the popular derogatory nickname given to those without an academic background, educated (if at all) only in English, who were reputed to follow the teachings of John Wycliffe in particular, and were certainly considerably energized by the translation of the Bible into the English language. By the mid-15th century, \"lollard\" had come to mean a heretic in general.\nThe alternative, \"Wycliffite\", is generally accepted to be a more neutral term covering those of similar opinions, but having an academic background.\n\nThe term is said to have been coined by the Anglo-Irish cleric Henry Crumpe, but its origin is uncertain. According to the Oxford English Dictionary, it most likely derives from  Middle Dutch  (\"mumbler, mutterer\"), from a verb lollen (\"to mutter, mumble\"). It appears to be a derisive expression applied to various people perceived as heretics—first the Franciscans and later the followers of Wycliffe. \nOriginally the Dutch word was a colloquial name for a group of the harmless buriers of the dead during the Black Death, in the 14th century, known as Alexians, Alexian Brothers or Cellites. These were known colloquially as  (Middle Dutch for \"mumbling brothers\"), or ', from  (\"to sing softly\"), from their chants for the dead.cf. English, and the modern Dutch and German lallen \"to babble, to talk drunkenly\".[http://www.dwds.de/?qu=lallen Digitales Wörterbuch der deutschen Sprache, entry for \"lallen\"] Middle English (akin to the verb loll,  lull, the English cognate of Dutch lollen \"to mutter, mumble\")  is recorded as an alternative spelling of Lollard, while its generic meaning \"a lazy vagabond, an idler, a fraudulent beggar\" is not recorded before 1582.\n\nTwo other possibilities for the derivation of Lollard are mentioned by the Oxford English Dictionary,.\n# the Latin, the weedy vetch (tares), supposedly a reference to the biblical Parable of the Tares (Matthew 13:24-30);\n# after a Franciscan named Lolhard who converted to the Waldensian way, becoming eminent as a preacher in Guyenne, then under English domination, influencing lay English piety. He was burned at Cologne in the 1370s; coincidentally, a Waldensian teacher named Lolhard was tried for heresy in Austria in 1315.TJ van Bright. The Bloody Theater or Martyrs Mirror of the Defenseless Christians (1660). Third English Edition. 1886. Translated by Joseph F. Sohm. Herald Press, Scottsdale, Pennsylvania.\n\nBeliefs\n\n \nLollardy was a religion of vernacular scripture. Lollards opposed many practices of the Catholic church. Anne Hudson has written that a form of sola scriptura underpinned Wycliffite beliefs, but distinguished it from the more radical ideology that anything not permitted by scripture is forbidden. Instead, Hudson notes that \"Wycliffite beliefs [stressed] the bible and [insisted] that it formed the only valid source of doctrine and the only pertinent measure of legitimacy.\"\n\nWith regard to the Eucharist, later Lollards such as John Wycliffe, William Thorpe, and John Oldcastle, taught a view of the real presence of Christ in Holy Communion known as \"consubstantiation\" and did not accept the doctrine of transubstantiation, taught by the Roman Catholic Church in 1215. What is meant by consubstantiation is that, contrary to the doctrine of the Catholic Church, Lollards believed \"that material bread still existed there\". Wycliffe believed that the bread and wine themselves were \"materially unchanged by the consecration\", but he also believed that the consecration added \"the spiritual being of Christ\" to the bread and wine.\n\nThey did not believe the church practices of baptism and confession were necessary for salvation. They considered praying to saints and honoring of their images to be a form of idolatry. Oaths, fasting, and prayers for the dead were thought to have no scriptural basis. They had a poor opinion of the trappings of the Catholic church, including holy bread, holy water, bells, organs, and church buildings. They rejected the value of papal pardons. Special vows were considered to be in conflict with the divine order established by Christ and were regarded as anathema. 16th century martyrologist John Foxe described four main beliefs of Lollardy: opposition to pilgrimages and saint worship, denial of the doctrine of transubstantiation, and a demand for English translation of the Scriptures.\n\nOne group of Lollards petitioned Parliament with The Twelve Conclusions of the Lollards by posting them on the doors of Westminster Hall in February 1395. While by no means a central authority of the Lollards, the Twelve Conclusions reveal certain basic Lollard ideas. The first Conclusion rejects the acquisition of temporal wealth by Church leaders as accumulating wealth leads them away from religious concerns and toward greed. The fourth Conclusion deals with the Lollard view that the Sacrament of Eucharist is a contradictory topic that is not clearly defined in the Bible. Whether the bread remains bread or becomes the literal body of Christ is not specified uniformly in the gospels. The sixth Conclusion states that officials of the Church should not concern themselves with secular matters when they hold a position of power within the Church because this constitutes a conflict of interest between matters of the spirit and matters of the State. The eighth Conclusion points out the ludicrousness, in the minds of Lollards, of the reverence that is directed toward images of Christ's suffering. \"If the cross of Christ, the nails, spear, and crown of thorns are to be honoured, then why not honour Judas's lips, if only they could be found?\"\n\nThe Lollards stated that the Catholic Church had been corrupted by temporal matters and that its claim to be the true church was not justified by its heredity. Part of this corruption involved prayers for the dead and chantries. These were seen as corrupt since they distracted priests from other work and that all should be prayed for equally. Lollards also had a tendency toward iconoclasm. Expensive church artwork was seen as an excess; they believed effort should be placed on helping the needy and preaching rather than working on expensive decorations. Icons were also seen as dangerous since many seemed to be worshiping the icons more than God.\n\nBelieving in a universal priesthood, the Lollards challenged the Church's authority to invest or deny the divine authority to make a man a priest. Denying any special status to the priesthood, Lollards thought confession to a priest was unnecessary since according to them priests did not have the ability to forgive sins. Lollards challenged the practice of clerical celibacy and believed priests should not hold government positions as such temporal matters would likely interfere with their spiritual mission.\n\nHistory\n\nAlthough Lollardy is denounced as a heresy (by the Roman Catholic Church and the early pre-reformation Church of England), initially Wycliffe and the Lollards were sheltered by John of Gaunt and other anti-clerical nobility, who may have wanted to use Lollard-advocated clerical reform to acquire new sources of revenue from England’s monasteries. The University of Oxford also protected Wycliffe and similar academics on the grounds of academic freedom and, initially, allowed such persons to retain their positions despite their controversial views. Lollards first faced serious persecution after the Peasants' Revolt in 1381. While Wycliffe and other Lollards opposed the revolt, one of the peasants’ leaders, John Ball, preached Lollardy. The royalty and nobility then found Lollardy to be a threat not only to the Church, but to English society in general. The Lollards' small measure of protection evaporated. This change in status was also affected by the 1386 departure of John of Gaunt who left England to pursue the Crown of Castile.\n\nA group of gentry active during the reign of Richard II (1377–99) were known as \"Lollard Knights\" either during or after their lives due to their acceptance of Wycliffe's claims. Henry Knighton, in his Chronicle, identifies the principal Lollard Knights as Thomas Latimer, John Trussell, Lewis Clifford, John Peachey, Richard Storey, and Reginald Hilton. Thomas Walsingham's Chronicle adds William Nevil and John Clanvowe to the list, and other potential members of this circle have been identified by their wills, which contain Lollard-inspired language about how their bodies are to be plainly buried and permitted to return to the soil whence they came. There is little indication that the Lollard Knights were specifically known as such during their lifetimes; they were men of discretion, and unlike Sir John Oldcastle years later, rarely gave any hint of open rebellion. However, they displayed a remarkable ability to retain important positions without falling victim to the various prosecutions of Wycliffe's followers occurring during their lifetimes.\n\nReligious and secular authorities strongly opposed Lollardy. A primary opponent was Thomas Arundel, Archbishop of Canterbury, assisted by bishops like Henry le Despenser of Norwich, whom the chronicler Thomas Walsingham praised for his zeal.. King Henry IV (despite being John of Gaunt's son) passed the De heretico comburendo in 1401, which did not specifically ban the Lollards, but prohibited translating or owning heretical versions of the Bible and authorised death by burning for heretics.\n\nBy the early 15th century, stern measures were undertaken by Church and state which drove Lollardy underground. One such measure was the 1410 burning at the stake of John Badby, a layman and craftsman who refused to renounce his Lollardy. He was the first layman to suffer capital punishment in England for the crime of heresy.\n\nJohn Oldcastle, a close friend of Henry V of England and the basis for Falstaff in the Shakespearean history Henry IV, Part 1, was brought to trial in 1413 after evidence of his Lollard beliefs was uncovered. Oldcastle escaped from the Tower of London and organized an insurrection, which included an attempted kidnapping of the king. The rebellion failed, and Oldcastle was executed. Oldcastle's revolt made Lollardy seem even more threatening to the state, and persecution of Lollards became more severe. A variety of other martyrs for the Lollard cause were executed during the next century, including the Amersham Martyrs in the early 1500s and Thomas Harding in 1532, one of the last Lollards to be made victim. A gruesome reminder of this persecution is the 'Lollards Pit' in Thorpe Wood, now Thorpe Hamlet, Norwich, Norfolk, where men are customablie burnt..\n\nLollards were effectively absorbed into Protestantism during the English Reformation, in which Lollardy played a role. Since Lollards had been underground for more than a hundred years, the extent of Lollardy and its ideas at the time of the Reformation is uncertain and a point of debate. Ancestors of Blanche Parry (the closest person to Elizabeth I of England for 56 years) and of Blanche Milborne (who raised Edward VI and Elizabeth I) had Lollard connections. However, many critics of the Reformation, including Thomas More, associated Protestants with Lollards. Leaders of the English Reformation, including Archbishop Thomas Cranmer, referred to Lollardy as well, and Bishop Cuthbert of London called Lutheranism the \"foster-child\" of the Wycliffite heresy.. Scholars debate whether Protestants actually drew influence from Lollardy or whether they referred to it to create a sense of tradition.\n\nDespite the debate about the extent of Lollard influence there are ample records of the persecution of Lollards from this period. In the Diocese of London there are records of about 310 Lollards being prosecuted or forced to abjure between 1510 and 1532. In Lincoln 45 cases against Lollardy were heard in 1506–07 and in 1521 there were 50 abjurations and 5 burnings of Lollards. In 1511 Archbishop Warham presided over the abjuration of 41 Lollards from Kent and the burning of 5..\n\nThe extent of Lollardy in the general populace at this time is unknown, but the prevalence of Protestant iconoclasm in England suggests Lollard ideas may still have had some popular influence if Huldrych Zwingli was not the source, as Lutheranism did not advocate iconoclasm. Lollards were persecuted again between 1554 and 1559 during the Revival of the Heresy Acts, under the Catholic Mary I of England, which specifically suppressed heresy and Lollardy.\n\nThe similarity between Lollards and later English Protestant groups such as the Baptists, Puritans, and Quakers, also suggests some continuation of Lollard ideas through the Reformation.\n\nRepresentations in art and literature\n\nThe Church used art as an anti-Lollard weapon. Lollards were represented as foxes dressed as monks or priests preaching to a flock of geese on misericords., p. 83 These representations alluded to the story of the preaching fox found in popular medieval literature such as The History of Reynard the Fox and The Shifts of Raynardine. The fox lured the geese closer and closer with its words until it was able to snatch a victim to devour. The moral of this story was that foolish people are seduced by false doctrines.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lollardy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18616" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Lollardy (Lollardism, Lollard movement) was a pre-Protestant Christian religious movement that existed from the mid-14th century to the English Reformation. It was initially led by John Wycliffe,. a Roman Catholic theologian who was dismissed from the University of Oxford in 1381 for criticism of the Roman Catholic Church. The Lollards' demands were primarily for reform of Western Christianity.\n\nEtymology\n\nLollard, Lollardi or Loller was the popular derogatory nickname given to those without an academic background, educated (if at all) only in English, who were reputed to follow the teachings of John Wycliffe in particular, and were certainly considerably energized by the translation of the Bible into the English language. By the mid-15th century, \"lollard\" had come to mean a heretic in general.\nThe alternative, \"Wycliffite\", is generally accepted to be a more neutral term covering those of similar opinions, but having an academic background.\n\nThe term is said to have been coined by the Anglo-Irish cleric Henry Crumpe, but its origin is uncertain. According to the Oxford English Dictionary, it most likely derives from  Middle Dutch  (\"mumbler, mutterer\"), from a verb lollen (\"to mutter, mumble\"). It appears to be a derisive expression applied to various people perceived as heretics—first the Franciscans and later the followers of Wycliffe. \nOriginally the Dutch word was a colloquial name for a group of the harmless buriers of the dead during the Black Death, in the 14th century, known as Alexians, Alexian Brothers or Cellites. These were known colloquially as  (Middle Dutch for \"mumbling brothers\"), or ', from  (\"to sing softly\"), from their chants for the dead.cf. English, and the modern Dutch and German lallen \"to babble, to talk drunkenly\".[http://www.dwds.de/?qu=lallen Digitales Wörterbuch der deutschen Sprache, entry for \"lallen\"] Middle English (akin to the verb loll,  lull, the English cognate of Dutch lollen \"to mutter, mumble\")  is recorded as an alternative spelling of Lollard, while its generic meaning \"a lazy vagabond, an idler, a fraudulent beggar\" is not recorded before 1582.\n\nTwo other possibilities for the derivation of Lollard are mentioned by the Oxford English Dictionary,.\n# the Latin, the weedy vetch (tares), supposedly a reference to the biblical Parable of the Tares (Matthew 13:24-30);\n# after a Franciscan named Lolhard who converted to the Waldensian way, becoming eminent as a preacher in Guyenne, then under English domination, influencing lay English piety. He was burned at Cologne in the 1370s; coincidentally, a Waldensian teacher named Lolhard was tried for heresy in Austria in 1315.TJ van Bright. The Bloody Theater or Martyrs Mirror of the Defenseless Christians (1660). Third English Edition. 1886. Translated by Joseph F. Sohm. Herald Press, Scottsdale, Pennsylvania.\n\nBeliefs\n\n \nLollardy was a religion of vernacular scripture. Lollards opposed many practices of the Catholic church. Anne Hudson has written that a form of sola scriptura underpinned Wycliffite beliefs, but distinguished it from the more radical ideology that anything not permitted by scripture is forbidden. Instead, Hudson notes that \"Wycliffite beliefs [stressed] the bible and [insisted] that it formed the only valid source of doctrine and the only pertinent measure of legitimacy.\"\n\nWith regard to the Eucharist, later Lollards such as John Wycliffe, William Thorpe, and John Oldcastle, taught a view of the real presence of Christ in Holy Communion known as \"consubstantiation\" and did not accept the doctrine of transubstantiation, taught by the Roman Catholic Church in 1215. What is meant by consubstantiation is that, contrary to the doctrine of the Catholic Church, Lollards believed \"that material bread still existed there\". Wycliffe believed that the bread and wine themselves were \"materially unchanged by the consecration\", but he also believed that the consecration added \"the spiritual being of Christ\" to the bread and wine.\n\nThey did not believe the church practices of baptism and confession were necessary for salvation. They considered praying to saints and honoring of their images to be a form of idolatry. Oaths, fasting, and prayers for the dead were thought to have no scriptural basis. They had a poor opinion of the trappings of the Catholic church, including holy bread, holy water, bells, organs, and church buildings. They rejected the value of papal pardons. Special vows were considered to be in conflict with the divine order established by Christ and were regarded as anathema. 16th century martyrologist John Foxe described four main beliefs of Lollardy: opposition to pilgrimages and saint worship, denial of the doctrine of transubstantiation, and a demand for English translation of the Scriptures.\n\nOne group of Lollards petitioned Parliament with The Twelve Conclusions of the Lollards by posting them on the doors of Westminster Hall in February 1395. While by no means a central authority of the Lollards, the Twelve Conclusions reveal certain basic Lollard ideas. The first Conclusion rejects the acquisition of temporal wealth by Church leaders as accumulating wealth leads them away from religious concerns and toward greed. The fourth Conclusion deals with the Lollard view that the Sacrament of Eucharist is a contradictory topic that is not clearly defined in the Bible. Whether the bread remains bread or becomes the literal body of Christ is not specified uniformly in the gospels. The sixth Conclusion states that officials of the Church should not concern themselves with secular matters when they hold a position of power within the Church because this constitutes a conflict of interest between matters of the spirit and matters of the State. The eighth Conclusion points out the ludicrousness, in the minds of Lollards, of the reverence that is directed toward images of Christ's suffering. \"If the cross of Christ, the nails, spear, and crown of thorns are to be honoured, then why not honour Judas's lips, if only they could be found?\"\n\nThe Lollards stated that the Catholic Church had been corrupted by temporal matters and that its claim to be the true church was not justified by its heredity. Part of this corruption involved prayers for the dead and chantries. These were seen as corrupt since they distracted priests from other work and that all should be prayed for equally. Lollards also had a tendency toward iconoclasm. Expensive church artwork was seen as an excess; they believed effort should be placed on helping the needy and preaching rather than working on expensive decorations. Icons were also seen as dangerous since many seemed to be worshiping the icons more than God.\n\nBelieving in a universal priesthood, the Lollards challenged the Church's authority to invest or deny the divine authority to make a man a priest. Denying any special status to the priesthood, Lollards thought confession to a priest was unnecessary since according to them priests did not have the ability to forgive sins. Lollards challenged the practice of clerical celibacy and believed priests should not hold government positions as such temporal matters would likely interfere with their spiritual mission.\n\nHistory\n\nAlthough Lollardy is denounced as a heresy (by the Roman Catholic Church and the early pre-reformation Church of England), initially Wycliffe and the Lollards were sheltered by John of Gaunt and other anti-clerical nobility, who may have wanted to use Lollard-advocated clerical reform to acquire new sources of revenue from England’s monasteries. The University of Oxford also protected Wycliffe and similar academics on the grounds of academic freedom and, initially, allowed such persons to retain their positions despite their controversial views. Lollards first faced serious persecution after the Peasants' Revolt in 1381. While Wycliffe and other Lollards opposed the revolt, one of the peasants’ leaders, John Ball, preached Lollardy. The royalty and nobility then found Lollardy to be a threat not only to the Church, but to English society in general. The Lollards' small measure of protection evaporated. This change in status was also affected by the 1386 departure of John of Gaunt who left England to pursue the Crown of Castile.\n\nA group of gentry active during the reign of Richard II (1377–99) were known as \"Lollard Knights\" either during or after their lives due to their acceptance of Wycliffe's claims. Henry Knighton, in his Chronicle, identifies the principal Lollard Knights as Thomas Latimer, John Trussell, Lewis Clifford, John Peachey, Richard Storey, and Reginald Hilton. Thomas Walsingham's Chronicle adds William Nevil and John Clanvowe to the list, and other potential members of this circle have been identified by their wills, which contain Lollard-inspired language about how their bodies are to be plainly buried and permitted to return to the soil whence they came. There is little indication that the Lollard Knights were specifically known as such during their lifetimes; they were men of discretion, and unlike Sir John Oldcastle years later, rarely gave any hint of open rebellion. However, they displayed a remarkable ability to retain important positions without falling victim to the various prosecutions of Wycliffe's followers occurring during their lifetimes.\n\nReligious and secular authorities strongly opposed Lollardy. A primary opponent was Thomas Arundel, Archbishop of Canterbury, assisted by bishops like Henry le Despenser of Norwich, whom the chronicler Thomas Walsingham praised for his zeal.. King Henry IV (despite being John of Gaunt's son) passed the De heretico comburendo in 1401, which did not specifically ban the Lollards, but prohibited translating or owning heretical versions of the Bible and authorised death by burning for heretics.\n\nBy the early 15th century, stern measures were undertaken by Church and state which drove Lollardy underground. One such measure was the 1410 burning at the stake of John Badby, a layman and craftsman who refused to renounce his Lollardy. He was the first layman to suffer capital punishment in England for the crime of heresy.\n\nJohn Oldcastle, a close friend of Henry V of England and the basis for Falstaff in the Shakespearean history Henry IV, Part 1, was brought to trial in 1413 after evidence of his Lollard beliefs was uncovered. Oldcastle escaped from the Tower of London and organized an insurrection, which included an attempted kidnapping of the king. The rebellion failed, and Oldcastle was executed. Oldcastle's revolt made Lollardy seem even more threatening to the state, and persecution of Lollards became more severe. A variety of other martyrs for the Lollard cause were executed during the next century, including the Amersham Martyrs in the early 1500s and Thomas Harding in 1532, one of the last Lollards to be made victim. A gruesome reminder of this persecution is the 'Lollards Pit' in Thorpe Wood, now Thorpe Hamlet, Norwich, Norfolk, where men are customablie burnt..\n\nLollards were effectively absorbed into Protestantism during the English Reformation, in which Lollardy played a role. Since Lollards had been underground for more than a hundred years, the extent of Lollardy and its ideas at the time of the Reformation is uncertain and a point of debate. Ancestors of Blanche Parry (the closest person to Elizabeth I of England for 56 years) and of Blanche Milborne (who raised Edward VI and Elizabeth I) had Lollard connections. However, many critics of the Reformation, including Thomas More, associated Protestants with Lollards. Leaders of the English Reformation, including Archbishop Thomas Cranmer, referred to Lollardy as well, and Bishop Cuthbert of London called Lutheranism the \"foster-child\" of the Wycliffite heresy.. Scholars debate whether Protestants actually drew influence from Lollardy or whether they referred to it to create a sense of tradition.\n\nDespite the debate about the extent of Lollard influence there are ample records of the persecution of Lollards from this period. In the Diocese of London there are records of about 310 Lollards being prosecuted or forced to abjure between 1510 and 1532. In Lincoln 45 cases against Lollardy were heard in 1506–07 and in 1521 there were 50 abjurations and 5 burnings of Lollards. In 1511 Archbishop Warham presided over the abjuration of 41 Lollards from Kent and the burning of 5..\n\nThe extent of Lollardy in the general populace at this time is unknown, but the prevalence of Protestant iconoclasm in England suggests Lollard ideas may still have had some popular influence if Huldrych Zwingli was not the source, as Lutheranism did not advocate iconoclasm. Lollards were persecuted again between 1554 and 1559 during the Revival of the Heresy Acts, under the Catholic Mary I of England, which specifically suppressed heresy and Lollardy.\n\nThe similarity between Lollards and later English Protestant groups such as the Baptists, Puritans, and Quakers, also suggests some continuation of Lollard ideas through the Reformation.\n\nRepresentations in art and literature\n\nThe Church used art as an anti-Lollard weapon. Lollards were represented as foxes dressed as monks or priests preaching to a flock of geese on misericords., p. 83 These representations alluded to the story of the preaching fox found in popular medieval literature such as The History of Reynard the Fox and The Shifts of Raynardine. The fox lured the geese closer and closer with its words until it was able to snatch a victim to devour. The moral of this story was that foolish people are seduced by false doctrines. Lollardy. http://en.wikipedia.org/?curid=18616."
  }
}
