{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15401",
  "eid" : "1ba785a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778555642,
  "textBody" : "Isabella d'Este (19 May 1474 – 13 February 1539) was Marchesa of Mantua and one of the leading women of the Italian Renaissance as a major cultural and political figure. She was a patron of the arts  as well as a leader of fashion, whose innovative style of dressing was copied by women throughout Italy and at the French court.  The poet Ariosto labeled her as the \"liberal and magnanimous Isabella\",Marek, George R. (1976). The Bed and the Throne: The Life of Isabella d'Este. New York: Harper and Row Publishers.p.ix  while author Matteo Bandello described her as having been \"supreme among women\".Marek, p.ix Diplomat Niccolò da Correggio went even further by hailing her as \"The First Lady of the world\".\n\nShe served as the regent of Mantua during the absence of her husband, Francesco II Gonzaga, Marquess of Mantua and the minority of her son, Federico, Duke of Mantua. In 1500 she met King Louis XII of France in Milan on a diplomatic mission to persuade him not to send his troops against Mantua.\n\nShe was a prolific letter-writer, and maintained a lifelong correspondence with her sister-in-law Elisabetta Gonzaga. Lucrezia Borgia was another sister-in-law; she later became the mistress of Isabella's husband.\n\nIsabella d'Este grew up in a cultured family in the city-state of Ferrara. She received a fine classical education and, as a girl, met many famous humanist scholars and artists.\nDue to the vast amount of extant correspondence between Isabella and her family and friends, her life is unusually well-documented.Marek, p.xiv She was born on Tuesday 19 May 1474 at nine o'clock in the eveningMarek, p.12 Isabella's mother wrote a letter to her friend Barbara Gonzaga describing the details of Isabella's birthNote: In 15th century Italy the day began at sunset rather than at midnight; therefore as Isabella's birth occurred on 19 May at the second hour, this indicated that she was actually born on 18 May, at 9.00 PM  in Ferrara, to Ercole I d'Este, Duke of Ferrara and Eleanor of Naples.Julia Mary Cartwright Ady, Isabella d'Este, marchioness of Mantua, 1474-1539: a study of the renaissance, Volume 1, 1907 Eleanor was the daughter of Ferdinand I, the Aragonese King of Naples, and Isabella of Clermont.Marek, p.12\n\nOne year later on 29 June 1475 her sister Beatrice was born, and in 1476 and 1477 two brothers, Alfonso and Ippolito arrived. In 1479 and 1480 two more brothers were born; they were Ferrante and Sigismondo. Of all the children Isabella was considered to have been the favourite.\n\nIn the year of Ferrante's birth, Isabella travelled to Naples with her mother. When her mother returned to Ferrara, Isabella accompanied her, while the other children stayed behind with their grandfather for eight years. It was during the journey with her mother that Isabella acquired the art of diplomacy and statecraft.\n\nEducation\n\nIsabella, was a very good educated young women ,later on Leonardo d'vinci gave her powers and she became one of the newest duper heros of all time with her great fashion powers ! . As a child she studied Roman history, and rapidly learned to translate Greek and Latin (the former would become her favourite language) [citation needed]. Because of her outstanding intellect, she often discussed the classics and the affairs of state with ambassadors. Moreover, she was personally acquainted with the painters, musicians, writers, and scholars, who lived in and around the court. Besides her knowledge of history and languages, she could also recite Virgil and Terence by heart. Isabella was also a talented singer and musician, and was taught to play the lute by Giovanni Angelo Testagrossa. In addition to all these admirable accomplishments, she also was an innovator of new dances, having been instructed in the art by Ambrogio, a Jewish dancing master.Marek, pp.16-17\n\nShe was described as having been physically attractive, albeit slightly plump; however, she also possessed \"lively eyes\" and was \"of lively grace\".Marek, p.16\nIn 1480, at the age of six, Isabella was betrothed to Francesco, the heir to the Marquis of Mantua. Although he was not handsome, Isabella admired him for his strength and bravery; she also regarded him as a gentleman. After their first few encounters, she found that she enjoyed his company and spent the next few years getting to know him and preparing herself to be the Marchesa of Mantua. During their courtship, Isabella treasured the letters, poems, and sonnets he sent her as gifts.\n\nMarchesa of Mantua\n\nTen years later on 11 February 1490, at age 15, she married Francesco Gonzaga, who had by then succeeded to the marquisate. Isabella became his wife and Marchesa amid a spectacular outpouring of popular acclamation. Besides Marquis, Francesco was also Captain General of the armies of the Republic of Venice. She brought as her marriage portion the sum of 3,000 ducats besides valuable jewellery, dishes, and a silver service.Marek, p.28 Prior to the magnificent banquet which followed the wedding ceremony, Isabella rode through the main streets of Ferrara astride a horse draped in gems and gold.Marek, p.30\n\nAs the couple had known and admired one another for many years, their mutual attraction deepened into love; marriage to Francesco allegedly caused Isabella to \"bloom\".Marek, p.33 At the time of her wedding, Isabella was said to have been pretty, slim, graceful and well-dressed.Marek, pp.33-34 Her long, fine hair was dyed pale blonde, and her eyes, \"brown as fir cones in autumn, scattered laughter\".Marek, p.34\n\nFrancesco, in his capacity of Captain General of the Venetian armies, was often required to go to Venice for conferences which left Isabella in Mantua on her own at La Reggia the ancient palace which was the family seat of the Gonzagas.Marek, p.35 She did not lack company, however, as she passed the time with her mother and sister, Beatrice; and upon meeting Elisabetta Gonzaga, her 18-year-old sister-in-law, the two women became close friends. They enjoyed reading books, playing cards, and travelling about the countryside together. Once they journeyed as far as Lake Garda during one of Francesco's absences, and later travelled to Venice. They maintained a steady correspondence until Elisabetta's death in 1526.\n\nAlmost four years after her marriage in December 1493, Isabella gave birth to her first child out of an eventual total of eight; it was a daughter, Eleonora, whom they called Leonora for short.\n\nChildren\n\nTogether Isabella and Francesco had eight children:\n* Eleonora Gonzaga (31 December 1493 – 13 February 1570), married Francesco Maria I della Rovere, Duke of Urbino, by whom she had issue\n* Margherita Gonzaga (13 July 1496 – 22 September 1496)\n* Federico II Gonzaga, Duke of Mantua (17 May 1500 – 28 August 1540), married Margaret Paleologa, by whom he had issue\n* Livia Gonzaga (1501 – January 1508).\n* Ippolita Gonzaga (13 November 1503 – 16 March 1570), a nun\n* Ercole Gonzaga (23 November 1505 – 2 March 1563), Cardinal, Bishop of Mantua\n* Ferrante Gonzaga (28 January 1507 – 15 November 1557), a condottiero; married Isabella di Capua, by whom he had issue\n* Livia Gonzaga (August 1508 – 1569), a nun\n\nLucrezia Borgia\n\nA year after her marriage to Isabella's brother, AlfonsoNote:In June 1505, Alfonso succeeded their father as duke, making Lucrezia, Duchess of Ferrara in 1502, the notorious Lucrezia Borgia became the mistress of Francesco. Isabella had given birth to a daughter, Ippolita at about the same time, and she continued to bear him children throughout Francesco and Lucrezia's long, passionate affair, which was  more sexual than romantic.Marek, pp.166-69 Lucrezia had previously made overtures of friendship to Isabella which the latter had coldly and disdainfully ignored. From the time Lucrezia had first arrived in Ferrara as Alfonso's intended bride, Isabella, despite having acted as hostess during the wedding festivities, had regarded Lucrezia as a rival, whom she sought to outdo at every opportunity.Marek, pp.147-48 Francesco's affair with Lucrezia, whose beauty was renowned, caused Isabella much jealous suffering and emotional pain. Their liaison ended when he contracted syphilis as a result of encounters with prostitutes.\n\nRegency\n\nIsabella played an important role in Mantua during the city's troubled times. When her husband was captured in 1509 and held hostage in Venice, she took control of Mantua's military forces and held off their invaders until his release in 1512. In the same year, 1512, she was the hostess at the Congress of Mantua, which was held to settle questions concerning Florence and Milan.Marek, p.250 As a ruler, she appeared to have been much more assertive and competent than her husband. When apprised of this fact upon his return, Francesco was furious and humiliated at being upstaged by his wife's superior political ability. This caused their marriage to break down irrevocably. As a result, Isabella began to travel freely and live independently from her husband until his death on 19 March 1519.\n\nAfter the death of her husband, Isabella ruled Mantua as regent for her son, Federico.  She began to play an increasingly important role in Italian politics, steadily advancing Mantua's position. She was instrumental in promoting Mantua to a Duchy, which was obtained by wise diplomatic use of her son's marriage contracts. She also succeeded in obtaining a cardinalate for her son Ercole. She further displayed shrewd political acumen in her negotiations with Cesare Borgia, who had dispossessed Guidobaldo da Montefeltro, duke of Urbino, the husband of her sister-in-law and good friend Elisabetta Gonzaga in 1502.\n\nCultural pursuits\n\nIsabella d’Este is famous as the most important art patron of the Renaissance; her life is documented by her correspondence, which is still archived in Mantua (c. 28,000 letters received and copies of c. 12,000 letters written).Shemek, Deanna: Phaethon's Children: The Este Court and its Culture in Early Modern Ferrara. Medieval and Renaissance Texts and Studies (Arizona) 2005, p. 277For a documentations of art related letters see: Luzio, Alessandro: La Galleria dei Gonzaga – Appendice B: I ritratti d'Isabella d'Este. Casa Editrice L. F. Cogliati (Milan) 1913\n\nArt patronage\n\n* In painting she had the most famous artists work for her, i.e. Giovanni Bellini, Giorgione, Leonardo da Vinci, Andrea Mantegna (court painter until 1506), Perugino, Raphael and Titian, but also Antonio da Correggio, Lorenzo Costa (court painter from 1509), Dosso Dossi, Francesco Francia, Giulio Romano and many others. For instance her ‘Studiolo’ in the Ducal Palace, Mantua, was decorated with allegories by Mantegna, Perugino, Costa and Correggio.Ferino, Sylvia: Isabella d’Este – Fürstin und Mäzenatin der Renaissance. Kunsthistorisches Museum Wien (Vienna) 1994, pp. 86-425\n* In parallel she contracted the most important sculptors and medallists of her time, i.e. Michelangelo, Pier Jacopo Alari Bonacolsi (L’Antico), Gian Cristoforo Romano and Tullio Lombardo, and collected ancient Roman art.Ferino (1994), pp. 106, 315, 321; Cartwright, Julia: Isabella d’Este. Murray (London) 1907, Table of contents\n* In humanities she was in contact with Pietro Aretino, Ludovico Ariosto, Pietro Bembo, Baldassare Castiglione, Mario Equicola, Gian Giorgio Trissino etc.Cartwright (1907), table of contents\n* In music she sponsored the composers Bartolomeo Tromboncino and Marco Cara and played the lute herself.Ferino (1994), pp. 429-432 Unusually, she employed women as professional singers at her court, including Giovanna Moreschi, the wife of Marchetto Cara.Tick, Judith et al.: Women in music, §II: Western classical traditions in Europe & the USA. In: Macy, Laura: Grove Music Online. Oxford Music Online. Oxford University Press. (subscription required)\n* In architecture she could not afford new palaces, however she commissioned architects like Biagio Rossetti and Battista Covo.Ferino (1994), p. 18\n* Being a leader of fashion, she ordered the finest clothing, including furs as well as the newest distillations of perfume, which she concocted herself and sent as presents. Her style of dressing in caps (‘capigliari’) and plunging décolletage was imitated throughout Italy and at the French court.Marek (1952), p. 159\n\nIsabella d'Este and Leonardo’s Mona Lisa\n\n Leonardo da Vinci 1499 – ‘Isabella d’Este’ / Leonardo da Vinci (workshop) 1502-06 – ‘Mona Lisa’ (Prado, Madrid, cleaned in 2012) / Leonardo da Vinci 1502-06 – ‘Mona Lisa’ \nIsabella d’Este has been proposed as a plausible candidateZöllner, Frank: Leonardo da Vinci – Sämtliche Werke. Taschen Verlag (Cologne) 2007, p. 241 (effective catalogue raisonné) for Leonardo’s ‘Mona Lisa’ of 1502-06, which is usually considered a portrait of Lisa del Giocondo. (Lisa was the wife of a merchant in Florence and Giorgio Vasari wrote of her portrait by LeonardoVasari, Giorgio: Lebensläufe der berühmtesten Maler, Bildhauer und Architekten. 1550 / Manesse Verlag (Zurich) 2005, p. 330 – it remains open whether this is the portrait now known as the ‘Mona Lisa’.) Evidence in favor of Isabella as the subject of the famous work includes Leonardo’s drawing ‘Isabella d’Este’ from 1499 and her letters of 1501-06 requesting the promised painted portrait;Lewis, Francis-Ames: Isabella and Leonardo. Yale University Press (New Haven) 2012, Appendix Letters pp. 223-240 (original letters in Italian and English) further arguments are the mountains in the backgroundFlorence/Tuscany versus Mantua/Dolomites and the armrest as a Renaissance symbol for a portrait of a sovereign.\n\nPotential portrait identifications\n\nDespite her significant art patronage which included a number of portraits – no other person of her time was so often portrayedFerino (1994), p. 86 – there are very few surviving identified portraits of Isabella. These few identifications are known as inhomogeneous (i.e. differing eye and hair colours as well as divergent eyebrows in both Titian portraits) and there are no images of her between the ages of 26 and 54 (see picture). It is known that the elderly Isabella preferred idealized paintings and even waived sitting as a model.Ferino (1994), p. 94 However it could be assumed that she still insisted on seeing her personal characteristics in the outcome.Several letters mention Isabella’s request for overpainting hair and eye colours, i.e. Luzio, Alessandro: Federico Gonzaga ostaggio alla corte di Giulio II. Societa Romana di storia patria (Rome) 1887, p. 59: \"... pregandolo tuttavia a ritoccare il ritratto ne' capelli, che il pittore aveva fatti troppo biondi\" and Luzio (1913), p. 213: \"... a commutar gli occhij de nigri in bianchi\" Isabelle carefully managed her image. A portrait of her by Andrea Mantegna was rejected because it 'looked nothing at all like us'. The portrait most probably looked too much like Isabella who was prone to corpulence.\n\nIn recent years several museums have withdrawn their few identifications of portraits as Isabella because of the risk of misidentification.See:\n* Royal Collection, London (RCIN 405762): Lorenzo Costa ‘Portrait of a Lady with a Lapdog‘ (c. 1500-05)\n* Royal Collection, London (RCIN 405777): Giulio Romano ‘Margherita Paleologa’ (1531)\n* Currier Museum of Art, Manchester (inv. 1947.4): Lorenzo Costa ‘Portrait of a Woman‘ (1506-10)\n* Louvre, Paris (inv 894): Giovanni Francesco Caroto ‘Portrait de femme‘ (c. 1505-10) The remaining three colourful portraits are still inhomogeneous (Kunsthistorisches Museum/KHM, Vienna):KHM Vienna: Inv. 83, Inv 1534, Inv 5081\n* ‘Isabella in Red’ by Titian, c. 1529 (lost, known from a copy by Peter Paul Rubens c. 1605)\n* ‘Isabella in Black’ by Titian, 1536\n* ‘Ambras Miniature’, 16th century\n‘La Bella’ (Palazzo Pitti, Florence) has been discussed as an alternative to Titian’s 1536 portrait in Vienna, because the commission from the 60-year-old patron was for a rejuvenated portrait; if La Bella were Isabella, eye colour, hair colour, eyebrows and general appearance would homogenize in all known portraits, allowing potential links toward further identifications.i.e. Ozzola, Leandro (1931): Isabella d’Este e Tiziano. In: Bolletino d’Arte del Ministero della pubblica istruzione. BdA (Rome) 1931 No. 11, pp. 491-494; Download: http://www.bollettinodarte.beniculturali.it/opencms/multimedia/BollettinoArteIt/documents/1407155929929_06_-_Ozzola_491.pdf\n\nAt present the 1495 medal by Gian Cristoforo Romano (several extant copies) is the only reliable identification because of the inscription created during Isabella's lifetime.KHM Vienna, Inv 6.272bß and Ferino (1994), pp. 373-378\n\nDiplomatic missions and her treatment of slaves\n\nIsabella had met the French king in Milan in 1500 on a successful diplomatic mission which she had undertaken to protect Mantua from French invasion. Louis had been impressed by her alluring personality and keen intelligence.Marek, p.80-81 It was while she was being entertained by Louis, whose troops occupied Milan, that she offered asylum to Milanese refugees including Cecilia Gallerani, the refined mistress of her sister Beatrice's husband, Ludovico Sforza, Duke of Milan, who had been forced to leave his duchy in the wake of French occupation. Isabella presented Cecilia to King Louis, describing her as a \"lady of rare gifts and charm\".Marek, p.80\n\nIsabella was also an extreme example of the Renaissance European tendency to treat black African slaves in her household as exotic accessories. Isabella's fascination with black child servants is extensively documented.Alessandro Luzio and Rodolfo Renier, 'Buffoni, schiavi e nani alla corte dei Gonzaga ai tempi d'Esabella d'Este', Nuova Antologia, 19 (1891), pp.112-46, 140-5. On 1 May 1491 Isabella asked Giorgio Brognolo, her agent in Venice, to procure a young black girl ('una moreta') between the ages of one-and-a-half and four, and twice in early June reminded him of the request, emphasizing that the girl should be 'as black as possible'.Paul H.D. Kaplan, “Isabella d’Este and black African women,” Black Africans in Renaissance Europe, (Cambridge: Cambridge University Press, 2005) Isabella’s household and financial records reflect she already had a significantly older black girl in her service when she inquired after a younger black child. Records also reflect that she obtained a little black girl from a Venetian orphanage, opened negotiations with a Venetian patrician household for the sale of a little black boy and purchased an enslaved little black girl from her sister.Kaplan, 153. The commission for the purchase of a little girl \"as black as possible\" could be construed as a wish for maximum exoticism.Joaneath Spicer, “European Perceptions of Blackness as Reflected in the Visual Arts,” Revealing the African Presence in Renaissance Europe, (Baltimore: The Walters Art Museum, 2012)\n\nWidowhood\n\n\"Devoted head of state\"\n\nAs a widow, Isabella at the age of 45 became a \"devoted head of state\".Marek, p.204 Her position as a Marchesa required her serious attention, therefore she was required to study the problems faced by a ruler of a city-state. To improve the well-being of her subjects she studied architecture, agriculture, and industry, and followed the principles that Niccolò Machiavelli had set forth for rulers in his book The Prince. In return, the people of Mantua respected and loved her.Marek, p.205\n\nIsabella left Mantua for Rome in 1527. She was present during the catastrophic Sack of Rome, when she converted her house into an asylum for about 2000 people fleeing the Imperial soldiers. Isabella's house was one of the very few which was not attacked, due to the fact that her son was a member of the invading army. When she left, she managed to acquire safe passage for all the refugees who had sought refuge in her home.\n\nLater years and death\n\nAfter Rome became stabilized following the sacking, she left the city and returned to Mantua. She made it a centre of culture, started a school for girls, and turned her ducal apartments into a museum containing the finest art treasures. This was not enough to satisfy Isabella, already in her mid-60s, so she returned to political life and ruled Solarolo, in Romagna until her death on 13 February 1539. She was buried beside her husband in the Church of San Francesco in Mantua.\n\nLegacy\n\nDuring her lifetime and after her death, poets, popes, and statesmen paid tribute to Isabella. Pope Leo X invited her to treat him with \"as much friendliness as you would your brother\". The latter's secretary Pietro Bembo described her as \"one of the wisest and most fortunate of women\"; while the poet Ariosto deemed her the \"liberal and magnanimous Isabella\". Author Matteo Bandello wrote that she was \"supreme among women\", and the diplomat Niccolò da Correggio entitled her \"The First Lady of the world\".\n\nDepiction in media\n\nThe artwork The Dinner Party features a place setting for Isabella d'Este.[https://www.brooklynmuseum.org/eascfa/dinner_party/place_settings Place Settings]. Brooklyn Museum. Retrieved on 2015-08-06.\n\nIsabella d'Este is portrayed by Belgian actress Alexandra Oppo in the TV show Borgia.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Isabella d'Este" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15401" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Isabella d'Este (19 May 1474 – 13 February 1539) was Marchesa of Mantua and one of the leading women of the Italian Renaissance as a major cultural and political figure. She was a patron of the arts  as well as a leader of fashion, whose innovative style of dressing was copied by women throughout Italy and at the French court.  The poet Ariosto labeled her as the \"liberal and magnanimous Isabella\",Marek, George R. (1976). The Bed and the Throne: The Life of Isabella d'Este. New York: Harper and Row Publishers.p.ix  while author Matteo Bandello described her as having been \"supreme among women\".Marek, p.ix Diplomat Niccolò da Correggio went even further by hailing her as \"The First Lady of the world\".\n\nShe served as the regent of Mantua during the absence of her husband, Francesco II Gonzaga, Marquess of Mantua and the minority of her son, Federico, Duke of Mantua. In 1500 she met King Louis XII of France in Milan on a diplomatic mission to persuade him not to send his troops against Mantua.\n\nShe was a prolific letter-writer, and maintained a lifelong correspondence with her sister-in-law Elisabetta Gonzaga. Lucrezia Borgia was another sister-in-law; she later became the mistress of Isabella's husband.\n\nIsabella d'Este grew up in a cultured family in the city-state of Ferrara. She received a fine classical education and, as a girl, met many famous humanist scholars and artists.\nDue to the vast amount of extant correspondence between Isabella and her family and friends, her life is unusually well-documented.Marek, p.xiv She was born on Tuesday 19 May 1474 at nine o'clock in the eveningMarek, p.12 Isabella's mother wrote a letter to her friend Barbara Gonzaga describing the details of Isabella's birthNote: In 15th century Italy the day began at sunset rather than at midnight; therefore as Isabella's birth occurred on 19 May at the second hour, this indicated that she was actually born on 18 May, at 9.00 PM  in Ferrara, to Ercole I d'Este, Duke of Ferrara and Eleanor of Naples.Julia Mary Cartwright Ady, Isabella d'Este, marchioness of Mantua, 1474-1539: a study of the renaissance, Volume 1, 1907 Eleanor was the daughter of Ferdinand I, the Aragonese King of Naples, and Isabella of Clermont.Marek, p.12\n\nOne year later on 29 June 1475 her sister Beatrice was born, and in 1476 and 1477 two brothers, Alfonso and Ippolito arrived. In 1479 and 1480 two more brothers were born; they were Ferrante and Sigismondo. Of all the children Isabella was considered to have been the favourite.\n\nIn the year of Ferrante's birth, Isabella travelled to Naples with her mother. When her mother returned to Ferrara, Isabella accompanied her, while the other children stayed behind with their grandfather for eight years. It was during the journey with her mother that Isabella acquired the art of diplomacy and statecraft.\n\nEducation\n\nIsabella, was a very good educated young women ,later on Leonardo d'vinci gave her powers and she became one of the newest duper heros of all time with her great fashion powers ! . As a child she studied Roman history, and rapidly learned to translate Greek and Latin (the former would become her favourite language) [citation needed]. Because of her outstanding intellect, she often discussed the classics and the affairs of state with ambassadors. Moreover, she was personally acquainted with the painters, musicians, writers, and scholars, who lived in and around the court. Besides her knowledge of history and languages, she could also recite Virgil and Terence by heart. Isabella was also a talented singer and musician, and was taught to play the lute by Giovanni Angelo Testagrossa. In addition to all these admirable accomplishments, she also was an innovator of new dances, having been instructed in the art by Ambrogio, a Jewish dancing master.Marek, pp.16-17\n\nShe was described as having been physically attractive, albeit slightly plump; however, she also possessed \"lively eyes\" and was \"of lively grace\".Marek, p.16\nIn 1480, at the age of six, Isabella was betrothed to Francesco, the heir to the Marquis of Mantua. Although he was not handsome, Isabella admired him for his strength and bravery; she also regarded him as a gentleman. After their first few encounters, she found that she enjoyed his company and spent the next few years getting to know him and preparing herself to be the Marchesa of Mantua. During their courtship, Isabella treasured the letters, poems, and sonnets he sent her as gifts.\n\nMarchesa of Mantua\n\nTen years later on 11 February 1490, at age 15, she married Francesco Gonzaga, who had by then succeeded to the marquisate. Isabella became his wife and Marchesa amid a spectacular outpouring of popular acclamation. Besides Marquis, Francesco was also Captain General of the armies of the Republic of Venice. She brought as her marriage portion the sum of 3,000 ducats besides valuable jewellery, dishes, and a silver service.Marek, p.28 Prior to the magnificent banquet which followed the wedding ceremony, Isabella rode through the main streets of Ferrara astride a horse draped in gems and gold.Marek, p.30\n\nAs the couple had known and admired one another for many years, their mutual attraction deepened into love; marriage to Francesco allegedly caused Isabella to \"bloom\".Marek, p.33 At the time of her wedding, Isabella was said to have been pretty, slim, graceful and well-dressed.Marek, pp.33-34 Her long, fine hair was dyed pale blonde, and her eyes, \"brown as fir cones in autumn, scattered laughter\".Marek, p.34\n\nFrancesco, in his capacity of Captain General of the Venetian armies, was often required to go to Venice for conferences which left Isabella in Mantua on her own at La Reggia the ancient palace which was the family seat of the Gonzagas.Marek, p.35 She did not lack company, however, as she passed the time with her mother and sister, Beatrice; and upon meeting Elisabetta Gonzaga, her 18-year-old sister-in-law, the two women became close friends. They enjoyed reading books, playing cards, and travelling about the countryside together. Once they journeyed as far as Lake Garda during one of Francesco's absences, and later travelled to Venice. They maintained a steady correspondence until Elisabetta's death in 1526.\n\nAlmost four years after her marriage in December 1493, Isabella gave birth to her first child out of an eventual total of eight; it was a daughter, Eleonora, whom they called Leonora for short.\n\nChildren\n\nTogether Isabella and Francesco had eight children:\n* Eleonora Gonzaga (31 December 1493 – 13 February 1570), married Francesco Maria I della Rovere, Duke of Urbino, by whom she had issue\n* Margherita Gonzaga (13 July 1496 – 22 September 1496)\n* Federico II Gonzaga, Duke of Mantua (17 May 1500 – 28 August 1540), married Margaret Paleologa, by whom he had issue\n* Livia Gonzaga (1501 – January 1508).\n* Ippolita Gonzaga (13 November 1503 – 16 March 1570), a nun\n* Ercole Gonzaga (23 November 1505 – 2 March 1563), Cardinal, Bishop of Mantua\n* Ferrante Gonzaga (28 January 1507 – 15 November 1557), a condottiero; married Isabella di Capua, by whom he had issue\n* Livia Gonzaga (August 1508 – 1569), a nun\n\nLucrezia Borgia\n\nA year after her marriage to Isabella's brother, AlfonsoNote:In June 1505, Alfonso succeeded their father as duke, making Lucrezia, Duchess of Ferrara in 1502, the notorious Lucrezia Borgia became the mistress of Francesco. Isabella had given birth to a daughter, Ippolita at about the same time, and she continued to bear him children throughout Francesco and Lucrezia's long, passionate affair, which was  more sexual than romantic.Marek, pp.166-69 Lucrezia had previously made overtures of friendship to Isabella which the latter had coldly and disdainfully ignored. From the time Lucrezia had first arrived in Ferrara as Alfonso's intended bride, Isabella, despite having acted as hostess during the wedding festivities, had regarded Lucrezia as a rival, whom she sought to outdo at every opportunity.Marek, pp.147-48 Francesco's affair with Lucrezia, whose beauty was renowned, caused Isabella much jealous suffering and emotional pain. Their liaison ended when he contracted syphilis as a result of encounters with prostitutes.\n\nRegency\n\nIsabella played an important role in Mantua during the city's troubled times. When her husband was captured in 1509 and held hostage in Venice, she took control of Mantua's military forces and held off their invaders until his release in 1512. In the same year, 1512, she was the hostess at the Congress of Mantua, which was held to settle questions concerning Florence and Milan.Marek, p.250 As a ruler, she appeared to have been much more assertive and competent than her husband. When apprised of this fact upon his return, Francesco was furious and humiliated at being upstaged by his wife's superior political ability. This caused their marriage to break down irrevocably. As a result, Isabella began to travel freely and live independently from her husband until his death on 19 March 1519.\n\nAfter the death of her husband, Isabella ruled Mantua as regent for her son, Federico.  She began to play an increasingly important role in Italian politics, steadily advancing Mantua's position. She was instrumental in promoting Mantua to a Duchy, which was obtained by wise diplomatic use of her son's marriage contracts. She also succeeded in obtaining a cardinalate for her son Ercole. She further displayed shrewd political acumen in her negotiations with Cesare Borgia, who had dispossessed Guidobaldo da Montefeltro, duke of Urbino, the husband of her sister-in-law and good friend Elisabetta Gonzaga in 1502.\n\nCultural pursuits\n\nIsabella d’Este is famous as the most important art patron of the Renaissance; her life is documented by her correspondence, which is still archived in Mantua (c. 28,000 letters received and copies of c. 12,000 letters written).Shemek, Deanna: Phaethon's Children: The Este Court and its Culture in Early Modern Ferrara. Medieval and Renaissance Texts and Studies (Arizona) 2005, p. 277For a documentations of art related letters see: Luzio, Alessandro: La Galleria dei Gonzaga – Appendice B: I ritratti d'Isabella d'Este. Casa Editrice L. F. Cogliati (Milan) 1913\n\nArt patronage\n\n* In painting she had the most famous artists work for her, i.e. Giovanni Bellini, Giorgione, Leonardo da Vinci, Andrea Mantegna (court painter until 1506), Perugino, Raphael and Titian, but also Antonio da Correggio, Lorenzo Costa (court painter from 1509), Dosso Dossi, Francesco Francia, Giulio Romano and many others. For instance her ‘Studiolo’ in the Ducal Palace, Mantua, was decorated with allegories by Mantegna, Perugino, Costa and Correggio.Ferino, Sylvia: Isabella d’Este – Fürstin und Mäzenatin der Renaissance. Kunsthistorisches Museum Wien (Vienna) 1994, pp. 86-425\n* In parallel she contracted the most important sculptors and medallists of her time, i.e. Michelangelo, Pier Jacopo Alari Bonacolsi (L’Antico), Gian Cristoforo Romano and Tullio Lombardo, and collected ancient Roman art.Ferino (1994), pp. 106, 315, 321; Cartwright, Julia: Isabella d’Este. Murray (London) 1907, Table of contents\n* In humanities she was in contact with Pietro Aretino, Ludovico Ariosto, Pietro Bembo, Baldassare Castiglione, Mario Equicola, Gian Giorgio Trissino etc.Cartwright (1907), table of contents\n* In music she sponsored the composers Bartolomeo Tromboncino and Marco Cara and played the lute herself.Ferino (1994), pp. 429-432 Unusually, she employed women as professional singers at her court, including Giovanna Moreschi, the wife of Marchetto Cara.Tick, Judith et al.: Women in music, §II: Western classical traditions in Europe & the USA. In: Macy, Laura: Grove Music Online. Oxford Music Online. Oxford University Press. (subscription required)\n* In architecture she could not afford new palaces, however she commissioned architects like Biagio Rossetti and Battista Covo.Ferino (1994), p. 18\n* Being a leader of fashion, she ordered the finest clothing, including furs as well as the newest distillations of perfume, which she concocted herself and sent as presents. Her style of dressing in caps (‘capigliari’) and plunging décolletage was imitated throughout Italy and at the French court.Marek (1952), p. 159\n\nIsabella d'Este and Leonardo’s Mona Lisa\n\n Leonardo da Vinci 1499 – ‘Isabella d’Este’ / Leonardo da Vinci (workshop) 1502-06 – ‘Mona Lisa’ (Prado, Madrid, cleaned in 2012) / Leonardo da Vinci 1502-06 – ‘Mona Lisa’ \nIsabella d’Este has been proposed as a plausible candidateZöllner, Frank: Leonardo da Vinci – Sämtliche Werke. Taschen Verlag (Cologne) 2007, p. 241 (effective catalogue raisonné) for Leonardo’s ‘Mona Lisa’ of 1502-06, which is usually considered a portrait of Lisa del Giocondo. (Lisa was the wife of a merchant in Florence and Giorgio Vasari wrote of her portrait by LeonardoVasari, Giorgio: Lebensläufe der berühmtesten Maler, Bildhauer und Architekten. 1550 / Manesse Verlag (Zurich) 2005, p. 330 – it remains open whether this is the portrait now known as the ‘Mona Lisa’.) Evidence in favor of Isabella as the subject of the famous work includes Leonardo’s drawing ‘Isabella d’Este’ from 1499 and her letters of 1501-06 requesting the promised painted portrait;Lewis, Francis-Ames: Isabella and Leonardo. Yale University Press (New Haven) 2012, Appendix Letters pp. 223-240 (original letters in Italian and English) further arguments are the mountains in the backgroundFlorence/Tuscany versus Mantua/Dolomites and the armrest as a Renaissance symbol for a portrait of a sovereign.\n\nPotential portrait identifications\n\nDespite her significant art patronage which included a number of portraits – no other person of her time was so often portrayedFerino (1994), p. 86 – there are very few surviving identified portraits of Isabella. These few identifications are known as inhomogeneous (i.e. differing eye and hair colours as well as divergent eyebrows in both Titian portraits) and there are no images of her between the ages of 26 and 54 (see picture). It is known that the elderly Isabella preferred idealized paintings and even waived sitting as a model.Ferino (1994), p. 94 However it could be assumed that she still insisted on seeing her personal characteristics in the outcome.Several letters mention Isabella’s request for overpainting hair and eye colours, i.e. Luzio, Alessandro: Federico Gonzaga ostaggio alla corte di Giulio II. Societa Romana di storia patria (Rome) 1887, p. 59: \"... pregandolo tuttavia a ritoccare il ritratto ne' capelli, che il pittore aveva fatti troppo biondi\" and Luzio (1913), p. 213: \"... a commutar gli occhij de nigri in bianchi\" Isabelle carefully managed her image. A portrait of her by Andrea Mantegna was rejected because it 'looked nothing at all like us'. The portrait most probably looked too much like Isabella who was prone to corpulence.\n\nIn recent years several museums have withdrawn their few identifications of portraits as Isabella because of the risk of misidentification.See:\n* Royal Collection, London (RCIN 405762): Lorenzo Costa ‘Portrait of a Lady with a Lapdog‘ (c. 1500-05)\n* Royal Collection, London (RCIN 405777): Giulio Romano ‘Margherita Paleologa’ (1531)\n* Currier Museum of Art, Manchester (inv. 1947.4): Lorenzo Costa ‘Portrait of a Woman‘ (1506-10)\n* Louvre, Paris (inv 894): Giovanni Francesco Caroto ‘Portrait de femme‘ (c. 1505-10) The remaining three colourful portraits are still inhomogeneous (Kunsthistorisches Museum/KHM, Vienna):KHM Vienna: Inv. 83, Inv 1534, Inv 5081\n* ‘Isabella in Red’ by Titian, c. 1529 (lost, known from a copy by Peter Paul Rubens c. 1605)\n* ‘Isabella in Black’ by Titian, 1536\n* ‘Ambras Miniature’, 16th century\n‘La Bella’ (Palazzo Pitti, Florence) has been discussed as an alternative to Titian’s 1536 portrait in Vienna, because the commission from the 60-year-old patron was for a rejuvenated portrait; if La Bella were Isabella, eye colour, hair colour, eyebrows and general appearance would homogenize in all known portraits, allowing potential links toward further identifications.i.e. Ozzola, Leandro (1931): Isabella d’Este e Tiziano. In: Bolletino d’Arte del Ministero della pubblica istruzione. BdA (Rome) 1931 No. 11, pp. 491-494; Download: http://www.bollettinodarte.beniculturali.it/opencms/multimedia/BollettinoArteIt/documents/1407155929929_06_-_Ozzola_491.pdf\n\nAt present the 1495 medal by Gian Cristoforo Romano (several extant copies) is the only reliable identification because of the inscription created during Isabella's lifetime.KHM Vienna, Inv 6.272bß and Ferino (1994), pp. 373-378\n\nDiplomatic missions and her treatment of slaves\n\nIsabella had met the French king in Milan in 1500 on a successful diplomatic mission which she had undertaken to protect Mantua from French invasion. Louis had been impressed by her alluring personality and keen intelligence.Marek, p.80-81 It was while she was being entertained by Louis, whose troops occupied Milan, that she offered asylum to Milanese refugees including Cecilia Gallerani, the refined mistress of her sister Beatrice's husband, Ludovico Sforza, Duke of Milan, who had been forced to leave his duchy in the wake of French occupation. Isabella presented Cecilia to King Louis, describing her as a \"lady of rare gifts and charm\".Marek, p.80\n\nIsabella was also an extreme example of the Renaissance European tendency to treat black African slaves in her household as exotic accessories. Isabella's fascination with black child servants is extensively documented.Alessandro Luzio and Rodolfo Renier, 'Buffoni, schiavi e nani alla corte dei Gonzaga ai tempi d'Esabella d'Este', Nuova Antologia, 19 (1891), pp.112-46, 140-5. On 1 May 1491 Isabella asked Giorgio Brognolo, her agent in Venice, to procure a young black girl ('una moreta') between the ages of one-and-a-half and four, and twice in early June reminded him of the request, emphasizing that the girl should be 'as black as possible'.Paul H.D. Kaplan, “Isabella d’Este and black African women,” Black Africans in Renaissance Europe, (Cambridge: Cambridge University Press, 2005) Isabella’s household and financial records reflect she already had a significantly older black girl in her service when she inquired after a younger black child. Records also reflect that she obtained a little black girl from a Venetian orphanage, opened negotiations with a Venetian patrician household for the sale of a little black boy and purchased an enslaved little black girl from her sister.Kaplan, 153. The commission for the purchase of a little girl \"as black as possible\" could be construed as a wish for maximum exoticism.Joaneath Spicer, “European Perceptions of Blackness as Reflected in the Visual Arts,” Revealing the African Presence in Renaissance Europe, (Baltimore: The Walters Art Museum, 2012)\n\nWidowhood\n\n\"Devoted head of state\"\n\nAs a widow, Isabella at the age of 45 became a \"devoted head of state\".Marek, p.204 Her position as a Marchesa required her serious attention, therefore she was required to study the problems faced by a ruler of a city-state. To improve the well-being of her subjects she studied architecture, agriculture, and industry, and followed the principles that Niccolò Machiavelli had set forth for rulers in his book The Prince. In return, the people of Mantua respected and loved her.Marek, p.205\n\nIsabella left Mantua for Rome in 1527. She was present during the catastrophic Sack of Rome, when she converted her house into an asylum for about 2000 people fleeing the Imperial soldiers. Isabella's house was one of the very few which was not attacked, due to the fact that her son was a member of the invading army. When she left, she managed to acquire safe passage for all the refugees who had sought refuge in her home.\n\nLater years and death\n\nAfter Rome became stabilized following the sacking, she left the city and returned to Mantua. She made it a centre of culture, started a school for girls, and turned her ducal apartments into a museum containing the finest art treasures. This was not enough to satisfy Isabella, already in her mid-60s, so she returned to political life and ruled Solarolo, in Romagna until her death on 13 February 1539. She was buried beside her husband in the Church of San Francesco in Mantua.\n\nLegacy\n\nDuring her lifetime and after her death, poets, popes, and statesmen paid tribute to Isabella. Pope Leo X invited her to treat him with \"as much friendliness as you would your brother\". The latter's secretary Pietro Bembo described her as \"one of the wisest and most fortunate of women\"; while the poet Ariosto deemed her the \"liberal and magnanimous Isabella\". Author Matteo Bandello wrote that she was \"supreme among women\", and the diplomat Niccolò da Correggio entitled her \"The First Lady of the world\".\n\nDepiction in media\n\nThe artwork The Dinner Party features a place setting for Isabella d'Este.[https://www.brooklynmuseum.org/eascfa/dinner_party/place_settings Place Settings]. Brooklyn Museum. Retrieved on 2015-08-06.\n\nIsabella d'Este is portrayed by Belgian actress Alexandra Oppo in the TV show Borgia. Isabella d'Este. http://en.wikipedia.org/?curid=15401."
  }
}
