{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10975",
  "eid" : "f8c4b490-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497113,
  "textBody" : "In chemistry, particularly in biochemistry, a fatty acid is a carboxylic acid with a long aliphatic chain, which is either saturated or unsaturated. Most naturally occurring fatty acids have an unbranched chain of an even number of carbon atoms, from 4 to 28. Fatty acids are usually derived from triglycerides or phospholipids. Fatty acids are important dietary sources of fuel for animals because, when metabolized, they yield large quantities of ATP. Many cell types can use either glucose or fatty acids for this purpose. Long-chain fatty acids cannot cross the blood–brain barrier (BBB) and so cannot be used as fuel by the cells of the central nervous system; however, free short-chain fatty acids and medium-chain fatty acids can cross the BBB, in addition to glucose and ketone bodies.\n\nThe concept of fatty acid (acide gras) was introduced by Michel Eugène Chevreul,Chevreul, M. E. (1813). Sur plusieurs corps gras, et particulièrement sur leurs combinaisons avec les alcalis. Annales de Chimie, t. 88, p. 225-261. [http://gallica.bnf.fr/ark:/12148/bpt6k65741176/f225.item link (Gallica)], [https://books.google.com/books?id8-sYI8xfBGMC link (Google)].Chevreul, M. E. Recherches sur les corps gras d'origine animale. Levrault, Paris, 1823. [https://books.google.com/books?id\nr46rnl27h70C link].Leray, C. Chronological history of lipid center. Cyberlipid Center. Last updated on 11 November 2017. [http://www.cyberlipid.org/cyberlip/home0001.htm link]. though he used initially some variant terms, graisse acide and acide huileux (\"acid fat\" and \"oily acid\").Menten, P. Dictionnaire de chimie: Une approche étymologique et historique. De Boeck, Bruxelles. [https://books.google.com/books?id=NKTKDgAAQBAJ link].\n\nTypes of fatty acids\n\nFatty acids that have carbon–carbon double bonds are known as unsaturated. Fatty acids without double bonds are known as saturated. They differ in length as well.\n\nLength of free fatty acid chains\n\nFatty acid chains differ by length, often categorized as short to very long. \n*Short-chain fatty acids (SCFA) are fatty acids with aliphatic tails of five or fewer carbons (e.g. butyric acid).\n*Medium-chain fatty acids (MCFA) are fatty acids with aliphatic tails of 6 to 12 carbons, which can form medium-chain triglycerides.\n*Long-chain fatty acids (LCFA) are fatty acids with aliphatic tails of 13 to 21 carbons.\n*Very long chain fatty acids (VLCFA) are fatty acids with aliphatic tails of 22 or more carbons.\n\nUnsaturated fatty acids\n\nUnsaturated fatty acids have one or more double bonds between carbon atoms. (Pairs of carbon atoms connected by double bonds can be saturated by adding hydrogen atoms to them, converting the double bonds to single bonds. Therefore, the double bonds are called unsaturated.)\n\nThe two carbon atoms in the chain that are bound next to either side of the double bond can occur in a cis or trans  configuration.\n\n; cis : A cis configuration means that the two hydrogen atoms adjacent to the double bond stick out on the same side of the chain. The rigidity of the double bond freezes its conformation and, in the case of the cis isomer, causes the chain to bend and restricts the conformational freedom of the fatty acid. The more double bonds the chain has in the cis configuration, the less flexibility it has. When a chain has many cis bonds, it becomes quite curved in its most accessible conformations. For example, oleic acid, with one double bond, has a \"kink\" in it, whereas linoleic acid, with two double bonds, has a more pronounced bend. α-Linolenic acid, with three double bonds, favors a hooked shape. The effect of this is that, in restricted environments, such as when fatty acids are part of a phospholipid in a lipid bilayer, or triglycerides in lipid droplets, cis bonds limit the ability of fatty acids to be closely packed, and therefore can affect the melting temperature of the membrane or of the fat.\n; trans : A trans configuration, by contrast, means that the adjacent two hydrogen atoms lie on opposite sides of the chain. As a result, they do not cause the chain to bend much, and their shape is similar to straight saturated fatty acids.\n\nIn most naturally occurring unsaturated fatty acids, each double bond has three n carbon atoms after it, for some n, and all are cis bonds. Most fatty acids in the trans configuration (trans fats) are not found in nature and are the result of human processing (e.g., hydrogenation).\n\nThe differences in geometry between the various types of unsaturated fatty acids, as well as between saturated and unsaturated fatty acids, play an important role in biological processes, and in the construction of biological structures (such as cell membranes).\n\nEssential fatty acids\n\nFatty acids that are required by the human body but cannot be made in sufficient quantity from other substrates, and therefore must be obtained from food, are called essential fatty acids. There are two series of essential fatty acids: one has a double bond three carbon atoms away from the methyl end; the other has a double bond six carbon atoms away  from the methyl end. Humans lack the ability to introduce double bonds in fatty acids beyond carbons 9 and 10, as counted from the carboxylic acid side. Two essential fatty acids are linoleic acid (LA) and alpha-linolenic acid (ALA). These fatty acids are widely distributed in plant oils. The human body has a limited ability to convert ALA into the longer-chain omega-3 fatty acids — eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), which can also be obtained from fish. Omega-3 and omega-6 fatty acids are biosynthetic precursors to endocannabinoids with antinociceptive, anxiolytic, and neurogenic properties.\n\nSaturated fatty acids\n\nSaturated fatty acids have no double bonds. Thus, saturated fatty acids are saturated with hydrogen (since double bonds reduce the number of hydrogens on each carbon). Because saturated fatty acids have only single bonds, each carbon atom within the chain has 2 hydrogen atoms (except for the omega carbon at the end that has 3 hydrogens).\n\nNomenclature\n\nNumbering of the carbon atoms in a fatty acid\n\nThe position of the carbon atoms in a fatty acid can be indicated from the COOH- (or carboxy) end, or from the –CH3 (or methyl) end. If indicated from the -COOH end, then the C-1, C-2, C-3, ….(etc.) notation is used (blue numerals in the diagram on the right, where C-1 is the –COOH carbon). If the position is counted from the other, –CH3, end then the position is indicated by the ω-n notation (numerals in red, where ω-1 refers to the methyl carbon).\n\nThe positions of the double bonds in a fatty acid chain can, therefore, be indicated in two ways, using the C-n or the ω-n notation. Thus, in an 18 carbon fatty acid, a double bond between C-12 (or ω-7) and C-13 (or ω-6) is reported either as Δ12 if counted from the –COOH end (indicating only the “beginning” of the double bond), or as ω-6 (or omega-6) if counting from the –CH3 end. The “Δ” is the Greek letter “delta”, which translates into “D” ( for Double bond) in the Roman alphabet. Omega (ω) is the last letter in the Greek alphabet, and is therefore used to indicate the “last” carbon atom in the fatty acid chain. Since the ω-n notation is used almost exclusively to indicate the positions of the double bonds close to the –CH3 end in essential fatty acids, there is no necessity for an equivalent “Δ”-like notation - the use of the “ω-n” notation always refers to the position of a double bond.\n\nFatty acids with an odd number of carbon atoms are called odd-chain fatty acids, whereas the rest are even-chain fatty acids. The difference is relevant to gluconeogenesis.\n\nNaming of fatty acids\n\nThe following table describes the most common systems of naming fatty acids.\n\n Esterified, free, unsaturated, conjugated\n\nWhen fatty acids circulating in the plasma (plasma fatty acids) are not in their glycerol ester form (glycerides), they are known as non-esterified fatty acids (NEFAs) or free fatty acids (FFAs). The latter term can be viewed as a misnomer because they are transported complexed with a transport protein, such as albumin, as opposed to being unattached to any other molecule. But the term conveys the idea that they are circulating and available for metabolism.\n\nFatty acids can exist in various states of saturation. Unsaturated fatty acids include monounsaturated fatty acids (MUFAs) and polyunsaturated fatty acids (PUFAs). Conjugated fatty acids are a subset of PUFAs.\n\nProduction\n\nIndustrial\n\nFatty acids are usually produced industrially by the hydrolysis of triglycerides, with the removal of glycerol (see oleochemicals).  Phospholipids represent another source. Some fatty acids are produced synthetically by hydrocarboxylation of alkenes.\n\nBy animals\n\nIn animals, fatty acids are formed from carbohydrates predominantly in the liver, adipose tissue, and the  mammary glands during lactation.\n\nCarbohydrates are converted into pyruvate by glycolysis as the first important step in the conversion of carbohydrates into fatty acids. Pyruvate is then dehydrogenated to form acetyl-CoA in the mitochondrion. However, this acetyl CoA  needs to be transported into cytosol where the synthesis of fatty acids occurs. This cannot occur directly. To obtain cytosolic acetyl-CoA, citrate (produced by the condensation of acetyl-CoA with oxaloacetate) is removed from the citric acid cycle and carried across the inner mitochondrial membrane into the cytosol. There it is cleaved by ATP citrate lyase into acetyl-CoA and oxaloacetate. The oxaloacetate is returned to the mitochondrion as malate. The cytosolic acetyl-CoA is carboxylated by acetyl CoA carboxylase into malonyl-CoA, the first committed step  in the  synthesis of fatty acids.\n\nMalonyl-CoA is then involved in a repeating series of reactions that lengthens the growing fatty acid chain by two carbons at a time. Almost all natural fatty acids, therefore, have even numbers of carbon atoms. When synthesis is  complete the free fatty acids are nearly always combined with glycerol (three fatty acids to one glycerol molecule) to form triglycerides, the main storage form of fatty acids, and thus of energy in animals. However, fatty acids are also important components of the phospholipids that form the phospholipid bilayers out of which all the membranes of the cell are constructed (the cell wall, and the membranes that enclose all the organelles within the cells, such as the nucleus, the mitochondria, endoplasmic reticulum, and the Golgi apparatus).\n\nThe \"uncombined fatty acids\" or \"free fatty acids\" found in the circulation of animals come from the breakdown (or lipolysis) of stored triglycerides.  Because they are insoluble in water, these fatty acids are transported bound to plasma albumin. The levels of \"free fatty acids\" in the blood are limited by the availability of albumin binding sites. They can be taken up from the blood by all cells that have mitochondria (with the exception of the cells of the central nervous system). Fatty acids can only be broken down in mitochondria, by means of beta-oxidation followed by further combustion in the citric acid cycle to CO2 and water. Cells in the central nervous system, which, although they possess mitochondria, cannot take free fatty acids up from the blood, as the blood-brain barrier is impervious to most free fatty acids, excluding short-chain fatty acids and  medium-chain fatty acids. These cells have to manufacture their own fatty acids from carbohydrates, as described above, in order to produce and maintain the phospholipids of their cell membranes, and those of their organelles.\n\nFatty acids in dietary fats \n\nThe following table gives the fatty acid, vitamin E and cholesterol composition of some common dietary fats.\n\nReactions of fatty acids\n\nFatty acids exhibit reactions like other carboxylic acids, i.e. they undergo esterification and acid-base reactions.\n\nAcidity\n\nFatty acids do not show a great variation in their acidities, as indicated by their respective pKa.  Nonanoic acid, for example, has a pKa of 4.96, being only slightly weaker than acetic acid (4.76).  As the chain length increases, the solubility of the fatty acids in water decreases very rapidly, so that the longer-chain fatty acids have minimal effect on the pH of an aqueous solution.  Even those fatty acids that are insoluble in water will dissolve in warm ethanol, and can be titrated with sodium hydroxide solution using phenolphthalein as an indicator.  This analysis is used to determine the free fatty acid content of fats; i.e., the proportion of the triglycerides that have been hydrolyzed.\n\nHydrogenation and hardening\n\nHydrogenation of unsaturated fatty acids is widely practiced, typical conditions involving 2.0–3.0 MPa of H2 pressure, 150 ºC, and nickel supported on silica.  This treatment affords saturated fatty acids, as reflected in their iodine number.  Hydrogenated fatty acids are less prone toward rancidification.  Since the saturated fatty acids are higher melting than the unsaturated precursors, the process is called hardening. Related technology is used to convert vegetable oils into margarine. The hydrogenation of triglycerides is advantageous because the carboxylic acids degrade the nickel catalysts, affording nickel soaps. During partial hydrogenation, unsaturated fatty acids can be isomerized from cis to trans configuration.\n\nMore forcing hydrogenation, i.e. using higher pressures of H2 and higher temperatures, converts fatty acids into fatty alcohols.  Fatty alcohols are, however, more easily produced from fatty acid esters.\n\nIn the Varrentrapp reaction certain unsaturated fatty acids are cleaved in molten alkali, a reaction at one time of relevance to structure elucidation.\n\nAuto-oxidation and rancidity\n\nUnsaturated fatty acids undergo a chemical change known as auto-oxidation. The process requires oxygen (air) and is accelerated by the presence of trace metals. Vegetable oils resist this process to a small degree because they contain antioxidants, such as tocopherol.  Fats and oils often are treated with chelating agents such as citric acid to remove the metal catalysts.\n\nOzonolysis\n\nUnsaturated fatty acids are susceptible to degradation by ozone.  This reaction is practiced in the production of azelaic acid ((CH2)7(CO2H)2) from oleic acid.\n\nAnalysis\n\nIn chemical analysis, fatty acids are separated by gas chromatography of methyl esters; additionally, a separation of unsaturated isomers is possible by argentation thin-layer chromatography.\n\nCirculation\n\nDigestion and intake\n\nShort- and medium-chain fatty acids are absorbed directly into the blood via intestine capillaries and travel through the portal vein just as other absorbed nutrients do. However, long-chain fatty acids are not directly released into the intestinal capillaries. Instead they are absorbed into the fatty walls of the intestine villi and reassembled again into triglycerides. The triglycerides are coated with cholesterol and protein (protein coat) into a compound called a chylomicron.\n\nFrom within the cell, the chylomicron is released into a lymphatic capillary called a lacteal, which merges into larger lymphatic vessels. It is transported via the lymphatic system and the thoracic duct up to a location near the heart (where the arteries and veins are larger). The thoracic duct empties the chylomicrons into the bloodstream via the left subclavian vein. At this point the chylomicrons can transport the triglycerides to tissues where they are stored or metabolized for energy.\n\nMetabolism\n\nFatty acids (provided either by ingestion  or by drawing on triglycerides stored in fatty tissues) are distributed to cells to serve as a fuel for muscular contraction and general metabolism. They are broken down to CO2 and water by the intra-cellular mitochondria, releasing large amounts of energy, captured in the form of ATP through beta oxidation and the citric acid cycle.\n\nDistribution\n\nBlood fatty acids are in different forms in different stages in the blood circulation. They are taken in through the intestine in chylomicrons, but also exist in very low density lipoproteins (VLDL) and low density lipoproteins (LDL) after processing in the liver. In addition, when released from adipocytes, fatty acids exist in the blood as free fatty acids.\n\nIt is proposed that the blend of fatty acids exuded by mammalian skin, together with lactic acid and pyruvic acid, is distinctive and enables animals with a keen sense of smell to differentiate individuals.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fatty acid" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10975" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In chemistry, particularly in biochemistry, a fatty acid is a carboxylic acid with a long aliphatic chain, which is either saturated or unsaturated. Most naturally occurring fatty acids have an unbranched chain of an even number of carbon atoms, from 4 to 28. Fatty acids are usually derived from triglycerides or phospholipids. Fatty acids are important dietary sources of fuel for animals because, when metabolized, they yield large quantities of ATP. Many cell types can use either glucose or fatty acids for this purpose. Long-chain fatty acids cannot cross the blood–brain barrier (BBB) and so cannot be used as fuel by the cells of the central nervous system; however, free short-chain fatty acids and medium-chain fatty acids can cross the BBB, in addition to glucose and ketone bodies.\n\nThe concept of fatty acid (acide gras) was introduced by Michel Eugène Chevreul,Chevreul, M. E. (1813). Sur plusieurs corps gras, et particulièrement sur leurs combinaisons avec les alcalis. Annales de Chimie, t. 88, p. 225-261. [http://gallica.bnf.fr/ark:/12148/bpt6k65741176/f225.item link (Gallica)], [https://books.google.com/books?id8-sYI8xfBGMC link (Google)].Chevreul, M. E. Recherches sur les corps gras d'origine animale. Levrault, Paris, 1823. [https://books.google.com/books?id\nr46rnl27h70C link].Leray, C. Chronological history of lipid center. Cyberlipid Center. Last updated on 11 November 2017. [http://www.cyberlipid.org/cyberlip/home0001.htm link]. though he used initially some variant terms, graisse acide and acide huileux (\"acid fat\" and \"oily acid\").Menten, P. Dictionnaire de chimie: Une approche étymologique et historique. De Boeck, Bruxelles. [https://books.google.com/books?id=NKTKDgAAQBAJ link].\n\nTypes of fatty acids\n\nFatty acids that have carbon–carbon double bonds are known as unsaturated. Fatty acids without double bonds are known as saturated. They differ in length as well.\n\nLength of free fatty acid chains\n\nFatty acid chains differ by length, often categorized as short to very long. \n*Short-chain fatty acids (SCFA) are fatty acids with aliphatic tails of five or fewer carbons (e.g. butyric acid).\n*Medium-chain fatty acids (MCFA) are fatty acids with aliphatic tails of 6 to 12 carbons, which can form medium-chain triglycerides.\n*Long-chain fatty acids (LCFA) are fatty acids with aliphatic tails of 13 to 21 carbons.\n*Very long chain fatty acids (VLCFA) are fatty acids with aliphatic tails of 22 or more carbons.\n\nUnsaturated fatty acids\n\nUnsaturated fatty acids have one or more double bonds between carbon atoms. (Pairs of carbon atoms connected by double bonds can be saturated by adding hydrogen atoms to them, converting the double bonds to single bonds. Therefore, the double bonds are called unsaturated.)\n\nThe two carbon atoms in the chain that are bound next to either side of the double bond can occur in a cis or trans  configuration.\n\n; cis : A cis configuration means that the two hydrogen atoms adjacent to the double bond stick out on the same side of the chain. The rigidity of the double bond freezes its conformation and, in the case of the cis isomer, causes the chain to bend and restricts the conformational freedom of the fatty acid. The more double bonds the chain has in the cis configuration, the less flexibility it has. When a chain has many cis bonds, it becomes quite curved in its most accessible conformations. For example, oleic acid, with one double bond, has a \"kink\" in it, whereas linoleic acid, with two double bonds, has a more pronounced bend. α-Linolenic acid, with three double bonds, favors a hooked shape. The effect of this is that, in restricted environments, such as when fatty acids are part of a phospholipid in a lipid bilayer, or triglycerides in lipid droplets, cis bonds limit the ability of fatty acids to be closely packed, and therefore can affect the melting temperature of the membrane or of the fat.\n; trans : A trans configuration, by contrast, means that the adjacent two hydrogen atoms lie on opposite sides of the chain. As a result, they do not cause the chain to bend much, and their shape is similar to straight saturated fatty acids.\n\nIn most naturally occurring unsaturated fatty acids, each double bond has three n carbon atoms after it, for some n, and all are cis bonds. Most fatty acids in the trans configuration (trans fats) are not found in nature and are the result of human processing (e.g., hydrogenation).\n\nThe differences in geometry between the various types of unsaturated fatty acids, as well as between saturated and unsaturated fatty acids, play an important role in biological processes, and in the construction of biological structures (such as cell membranes).\n\nEssential fatty acids\n\nFatty acids that are required by the human body but cannot be made in sufficient quantity from other substrates, and therefore must be obtained from food, are called essential fatty acids. There are two series of essential fatty acids: one has a double bond three carbon atoms away from the methyl end; the other has a double bond six carbon atoms away  from the methyl end. Humans lack the ability to introduce double bonds in fatty acids beyond carbons 9 and 10, as counted from the carboxylic acid side. Two essential fatty acids are linoleic acid (LA) and alpha-linolenic acid (ALA). These fatty acids are widely distributed in plant oils. The human body has a limited ability to convert ALA into the longer-chain omega-3 fatty acids — eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), which can also be obtained from fish. Omega-3 and omega-6 fatty acids are biosynthetic precursors to endocannabinoids with antinociceptive, anxiolytic, and neurogenic properties.\n\nSaturated fatty acids\n\nSaturated fatty acids have no double bonds. Thus, saturated fatty acids are saturated with hydrogen (since double bonds reduce the number of hydrogens on each carbon). Because saturated fatty acids have only single bonds, each carbon atom within the chain has 2 hydrogen atoms (except for the omega carbon at the end that has 3 hydrogens).\n\nNomenclature\n\nNumbering of the carbon atoms in a fatty acid\n\nThe position of the carbon atoms in a fatty acid can be indicated from the COOH- (or carboxy) end, or from the –CH3 (or methyl) end. If indicated from the -COOH end, then the C-1, C-2, C-3, ….(etc.) notation is used (blue numerals in the diagram on the right, where C-1 is the –COOH carbon). If the position is counted from the other, –CH3, end then the position is indicated by the ω-n notation (numerals in red, where ω-1 refers to the methyl carbon).\n\nThe positions of the double bonds in a fatty acid chain can, therefore, be indicated in two ways, using the C-n or the ω-n notation. Thus, in an 18 carbon fatty acid, a double bond between C-12 (or ω-7) and C-13 (or ω-6) is reported either as Δ12 if counted from the –COOH end (indicating only the “beginning” of the double bond), or as ω-6 (or omega-6) if counting from the –CH3 end. The “Δ” is the Greek letter “delta”, which translates into “D” ( for Double bond) in the Roman alphabet. Omega (ω) is the last letter in the Greek alphabet, and is therefore used to indicate the “last” carbon atom in the fatty acid chain. Since the ω-n notation is used almost exclusively to indicate the positions of the double bonds close to the –CH3 end in essential fatty acids, there is no necessity for an equivalent “Δ”-like notation - the use of the “ω-n” notation always refers to the position of a double bond.\n\nFatty acids with an odd number of carbon atoms are called odd-chain fatty acids, whereas the rest are even-chain fatty acids. The difference is relevant to gluconeogenesis.\n\nNaming of fatty acids\n\nThe following table describes the most common systems of naming fatty acids.\n\n Esterified, free, unsaturated, conjugated\n\nWhen fatty acids circulating in the plasma (plasma fatty acids) are not in their glycerol ester form (glycerides), they are known as non-esterified fatty acids (NEFAs) or free fatty acids (FFAs). The latter term can be viewed as a misnomer because they are transported complexed with a transport protein, such as albumin, as opposed to being unattached to any other molecule. But the term conveys the idea that they are circulating and available for metabolism.\n\nFatty acids can exist in various states of saturation. Unsaturated fatty acids include monounsaturated fatty acids (MUFAs) and polyunsaturated fatty acids (PUFAs). Conjugated fatty acids are a subset of PUFAs.\n\nProduction\n\nIndustrial\n\nFatty acids are usually produced industrially by the hydrolysis of triglycerides, with the removal of glycerol (see oleochemicals).  Phospholipids represent another source. Some fatty acids are produced synthetically by hydrocarboxylation of alkenes.\n\nBy animals\n\nIn animals, fatty acids are formed from carbohydrates predominantly in the liver, adipose tissue, and the  mammary glands during lactation.\n\nCarbohydrates are converted into pyruvate by glycolysis as the first important step in the conversion of carbohydrates into fatty acids. Pyruvate is then dehydrogenated to form acetyl-CoA in the mitochondrion. However, this acetyl CoA  needs to be transported into cytosol where the synthesis of fatty acids occurs. This cannot occur directly. To obtain cytosolic acetyl-CoA, citrate (produced by the condensation of acetyl-CoA with oxaloacetate) is removed from the citric acid cycle and carried across the inner mitochondrial membrane into the cytosol. There it is cleaved by ATP citrate lyase into acetyl-CoA and oxaloacetate. The oxaloacetate is returned to the mitochondrion as malate. The cytosolic acetyl-CoA is carboxylated by acetyl CoA carboxylase into malonyl-CoA, the first committed step  in the  synthesis of fatty acids.\n\nMalonyl-CoA is then involved in a repeating series of reactions that lengthens the growing fatty acid chain by two carbons at a time. Almost all natural fatty acids, therefore, have even numbers of carbon atoms. When synthesis is  complete the free fatty acids are nearly always combined with glycerol (three fatty acids to one glycerol molecule) to form triglycerides, the main storage form of fatty acids, and thus of energy in animals. However, fatty acids are also important components of the phospholipids that form the phospholipid bilayers out of which all the membranes of the cell are constructed (the cell wall, and the membranes that enclose all the organelles within the cells, such as the nucleus, the mitochondria, endoplasmic reticulum, and the Golgi apparatus).\n\nThe \"uncombined fatty acids\" or \"free fatty acids\" found in the circulation of animals come from the breakdown (or lipolysis) of stored triglycerides.  Because they are insoluble in water, these fatty acids are transported bound to plasma albumin. The levels of \"free fatty acids\" in the blood are limited by the availability of albumin binding sites. They can be taken up from the blood by all cells that have mitochondria (with the exception of the cells of the central nervous system). Fatty acids can only be broken down in mitochondria, by means of beta-oxidation followed by further combustion in the citric acid cycle to CO2 and water. Cells in the central nervous system, which, although they possess mitochondria, cannot take free fatty acids up from the blood, as the blood-brain barrier is impervious to most free fatty acids, excluding short-chain fatty acids and  medium-chain fatty acids. These cells have to manufacture their own fatty acids from carbohydrates, as described above, in order to produce and maintain the phospholipids of their cell membranes, and those of their organelles.\n\nFatty acids in dietary fats \n\nThe following table gives the fatty acid, vitamin E and cholesterol composition of some common dietary fats.\n\nReactions of fatty acids\n\nFatty acids exhibit reactions like other carboxylic acids, i.e. they undergo esterification and acid-base reactions.\n\nAcidity\n\nFatty acids do not show a great variation in their acidities, as indicated by their respective pKa.  Nonanoic acid, for example, has a pKa of 4.96, being only slightly weaker than acetic acid (4.76).  As the chain length increases, the solubility of the fatty acids in water decreases very rapidly, so that the longer-chain fatty acids have minimal effect on the pH of an aqueous solution.  Even those fatty acids that are insoluble in water will dissolve in warm ethanol, and can be titrated with sodium hydroxide solution using phenolphthalein as an indicator.  This analysis is used to determine the free fatty acid content of fats; i.e., the proportion of the triglycerides that have been hydrolyzed.\n\nHydrogenation and hardening\n\nHydrogenation of unsaturated fatty acids is widely practiced, typical conditions involving 2.0–3.0 MPa of H2 pressure, 150 ºC, and nickel supported on silica.  This treatment affords saturated fatty acids, as reflected in their iodine number.  Hydrogenated fatty acids are less prone toward rancidification.  Since the saturated fatty acids are higher melting than the unsaturated precursors, the process is called hardening. Related technology is used to convert vegetable oils into margarine. The hydrogenation of triglycerides is advantageous because the carboxylic acids degrade the nickel catalysts, affording nickel soaps. During partial hydrogenation, unsaturated fatty acids can be isomerized from cis to trans configuration.\n\nMore forcing hydrogenation, i.e. using higher pressures of H2 and higher temperatures, converts fatty acids into fatty alcohols.  Fatty alcohols are, however, more easily produced from fatty acid esters.\n\nIn the Varrentrapp reaction certain unsaturated fatty acids are cleaved in molten alkali, a reaction at one time of relevance to structure elucidation.\n\nAuto-oxidation and rancidity\n\nUnsaturated fatty acids undergo a chemical change known as auto-oxidation. The process requires oxygen (air) and is accelerated by the presence of trace metals. Vegetable oils resist this process to a small degree because they contain antioxidants, such as tocopherol.  Fats and oils often are treated with chelating agents such as citric acid to remove the metal catalysts.\n\nOzonolysis\n\nUnsaturated fatty acids are susceptible to degradation by ozone.  This reaction is practiced in the production of azelaic acid ((CH2)7(CO2H)2) from oleic acid.\n\nAnalysis\n\nIn chemical analysis, fatty acids are separated by gas chromatography of methyl esters; additionally, a separation of unsaturated isomers is possible by argentation thin-layer chromatography.\n\nCirculation\n\nDigestion and intake\n\nShort- and medium-chain fatty acids are absorbed directly into the blood via intestine capillaries and travel through the portal vein just as other absorbed nutrients do. However, long-chain fatty acids are not directly released into the intestinal capillaries. Instead they are absorbed into the fatty walls of the intestine villi and reassembled again into triglycerides. The triglycerides are coated with cholesterol and protein (protein coat) into a compound called a chylomicron.\n\nFrom within the cell, the chylomicron is released into a lymphatic capillary called a lacteal, which merges into larger lymphatic vessels. It is transported via the lymphatic system and the thoracic duct up to a location near the heart (where the arteries and veins are larger). The thoracic duct empties the chylomicrons into the bloodstream via the left subclavian vein. At this point the chylomicrons can transport the triglycerides to tissues where they are stored or metabolized for energy.\n\nMetabolism\n\nFatty acids (provided either by ingestion  or by drawing on triglycerides stored in fatty tissues) are distributed to cells to serve as a fuel for muscular contraction and general metabolism. They are broken down to CO2 and water by the intra-cellular mitochondria, releasing large amounts of energy, captured in the form of ATP through beta oxidation and the citric acid cycle.\n\nDistribution\n\nBlood fatty acids are in different forms in different stages in the blood circulation. They are taken in through the intestine in chylomicrons, but also exist in very low density lipoproteins (VLDL) and low density lipoproteins (LDL) after processing in the liver. In addition, when released from adipocytes, fatty acids exist in the blood as free fatty acids.\n\nIt is proposed that the blend of fatty acids exuded by mammalian skin, together with lactic acid and pyruvic acid, is distinctive and enables animals with a keen sense of smell to differentiate individuals. Fatty acid. http://en.wikipedia.org/?curid=10975."
  }
}
