{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15378",
  "eid" : "1b90c950-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778555493,
  "textBody" : "Intrauterine device (IUD) with copper also known as intrauterine coil, is a type of intrauterine device which contains copper. It is used for birth control and emergency contraception within five days of unprotected sex. It is one of the most effective forms of birth control with a one-year failure rate around 0.7%. The device is placed in the uterus and lasts three to ten years. It may be used by women of all ages regardless of whether or not they have had children. Following removal, fertility quickly returns.\n\nSide effects include heavy menstrual periods, painful periods, or the device may come out. It is less recommended in people at high risk of sexually transmitted infections as it may increase the risk of pelvic inflammatory disease in the first three weeks after insertion. If a woman becomes pregnant with an IUD in place removal is recommended. Rarely uterine perforation can occur during insertion. The copper IUD is a type of long-acting reversible birth control. It primarily works by killing the sperm.\n\nThe copper IUD came into medical use in the 1970s. It is on the World Health Organization's List of Essential Medicines, the most effective and safe medicines needed in a health system. The wholesale cost in the developing world is about 0.37 to 3.00 USD per IUD. In the United Kingdom they cost the NHS about 10 pounds. In the United States they cost around 750 USD. They are used by more than 170 million women globally.\n\nMedical uses \n\nCopper IUDs are a form of long-acting reversible contraception and are one of the most effective forms of birth control available. The type of frame and amount of copper can affect the effectiveness of different copper IUD models. The failure rates for different models vary between 0.1 and 2.2% after 1 year of use. The T-shaped models with a surface area of 380 mm² of copper have the lowest failure rates. The TCu 380A (ParaGard) has a one-year failure rate of 0.8% and a cumulative 12-year failure rate of 2.2%. Over 12 years of use, the models with less surface area of copper have higher failure rates. The TCu 220A has a 12-year failure rate of 5.8%. The frameless GyneFix also has a failure rate of less than 1% per year. Worldwide, older IUD models with lower effectiveness rates are no longer produced.\n\nUnlike other forms of reversible contraception, the typical use failure rate and the perfect use failure rate for the copper IUDs are the same because the IUD does not depend on user action. A 2008 review of the available T-shaped copper IUDs recommended that the TCu 380A and the TCu 280S be used as the first choice for copper IUDs because those two models have the lowest failure rates and the longest lifespans. The effectiveness of the copper IUD is comparable to tubal sterilization, which has a first year failure rate of 0.5%. However, the effects of the copper IUD are reversible, which can be viewed as either an advantage or a disadvantage, depending on a person's goals for contraception.\n\nEmergency contraception \n\nIt was first discovered in 1976 that the copper IUD could be used as a form of emergency contraception (EC).\nThe copper IUD is the most effective form of emergency contraception. It is more effective than the hormonal EC pills currently available.\nThe pregnancy rate among those using the copper IUD for EC is 0.09%. It can be used for EC up to 5 days after the act of unprotected sex and does not decrease in effectiveness during the 5 days.\nAn additional advantage of using the copper IUD for emergency contraception is that it can be used as a form of birth control for 10–12 years after insertion.\n\nRemoval and return to fertility \n\nRemoval of the copper IUD should also be performed by a qualified medical practitioner. Fertility has been shown to return to previous levels quickly after removal of the device. One study found that the median amount of time from removal to planned pregnancy was three months for those women using the TCu 380Ag.\n\nSide effects \n\nExpulsion: Sometimes the copper IUD can be spontaneously expelled from the uterus. Expulsion rates can range from 2.2% to 11.4% of users from the first year to the 10th year. The TCu380A may have lower rates of expulsion than other models. Unusual vaginal discharge, cramping or pain, spotting between periods, postcoital (after sex) spotting, dyspareunia, or the absence or lengthening of the strings can be signs of a possible expulsion. If expulsion occurs, the woman is not protected against pregnancy. If an IUD with copper is inserted after an expulsion has occurred, the risk of re-expulsion has been estimated in one study to be approximately one third of cases after one year. Magnetic resonance imaging may cause dislocation of a copper IUD, and it is therefore recommended to check the location of the IUD both before and after MRI.\n\nPerforation: Very rarely, the IUD can move through the wall of the uterus. Risk of perforation is mostly determined by the skill of the practitioner performing the insertion. For experienced medical practitioners, the risk of perforation is 1 per 1,000 insertions or less. If perforation does occur it can damage the internal organs, and in some cases surgery is needed to remove the IUD.\n\nInfection: The insertion of a copper IUD poses a transient risk of pelvic inflammatory disease (PID) in the first 21 days after insertion. However, it is a small risk and is attributable to preexisting gonorrhea or chlamydia infection at the time of insertion, and not to the IUD itself.[http://www.maqweb.org/iudtoolkit/service_delivery/infectionprevention.shtml maqweb.org > Infection Prevention Practices for IUD Insertion and Removal]  By the United States Agency for International Development (USAID). Retrieved on Feb 14, 2010 Proper infection prevention procedures have little or no effect on the course of gonorrhea or chlamydia infections, but is important in helping protect both clients and providers from infection in general. Such infection prevention practices include washing hands and then putting on gloves, cleaning the cervix and vagina, making minimal contact with non-sterile surfaces (using a \"no touch insertion technique\") and, after the procedure, washing hands again and then processing instruments. The device itself carries no increased risk of PID beyond the time of insertion.\n\nCramping: Many women feel cramping or pain during the IUD insertion process and immediately after as a result of cervix dilation during insertion. Taking NSAIDS before the procedure can reduce discomfort, as can the use of a local anaesthetic. Misoprostol 6 to 12 hrs before insertion can help with cervical dilation. Some women may have cramps for 1 to 2 weeks following insertion. The copper IUD can also increase cramps during a woman’s period. This symptom will clear up for some women in 3 to 6 months, but may not for others.\n\nHeavier periods: The copper IUD increases the amount of blood flow during a woman’s menstrual periods. On average, menstrual blood loss increases by 20–50% after insertion of a copper-T IUD; increased menstrual discomfort is the most common medical reason for IUD removal. This symptom may clear up for some women after 3 to 6 months, but may not for others.\n\nIrregular bleeding and spotting: For the first 3 to 6 months after insertion, the copper IUD can cause irregular periods and spotting between periods.\n\nString problems: A small portion of men report that they can feel the strings during intercourse. In this case, strings can be trimmed. However, very short strings can prevent the woman from checking the strings for expulsion. Medical ultrasonography may be required in such cases to check the location of the IUD.\n\nPregnancy: Although rare, if pregnancy does occur with the copper IUD in place there can be serious side effects. The risk of ectopic pregnancy to a woman using an IUD is lower than the risk of ectopic pregnancy to a woman using no form of birth control. However, of pregnancies that do occur during IUD use, a higher than expected percentage (3–4%) are ectopic. If a pregnancy occurs with the IUD in place there is a higher risk of miscarriage or early delivery. If this occurs and the IUD strings are visible, the IUD should be removed immediately by a clinician. Although the Dalkon Shield IUD was associated with septic abortions (infections associated with miscarriage), other brands of IUD are not. IUDs are also not associated with birth defects.\n\nSome barrier contraceptives protect against STIs. Hormonal contraceptives reduce the risk of developing pelvic inflammatory disease (PID), a serious complication of certain STIs. IUDs, by contrast, do not protect against STIs or PID.\n\nContraindications \n\nA category 3 condition indicates conditions where the theoretical or proven risks usually outweigh the advantages of inserting a copper IUD. A category 4 condition indicates conditions that represent an unacceptable health risk if a copper IUD is inserted.\n\nWomen should not use a copper IUD if they:\n\n(Category 4)\n*Are pregnant or think they may be pregnant\n*Septic pregnancy or abortion\n*Have unexplained abnormal vaginal bleeding\n*Have untreated cervical cancer\n*Have malignant gestational trophoblastic disease\n*Have uterine cancer\n*Have certain uterine abnormalities\n*Have or may have had a pelvic infection within the past three months\n*Have or may have an STI\n*Have pelvic tuberculosis\n\n(Category 3)\n*Are postpartum between 48 hours and 4 weeks (increased IUD expulsion rate with delayed postpartum insertion). The CDC and WHO criteria differ in their recommendation for women postpartum between 48 hours and 4 weeks. The CDC does not list this as a contraindication.\n*Have benign gestational trophoblastic disease\n*Have ovarian cancer\n*Have AIDS (unless clinically well on anti-retroviral therapy)\n*Have very high individual likelihood of exposure to gonorrhea or chlamydial STIs\n\nA full list of contraindications can be found in the WHO Medical Eligibility Criteria for Contraceptive Use and the CDC United States Medical Eligibility Criteria for Contraceptive Use.\n\nWhile nulliparous women (women who have never given birth) are somewhat more likely to have side effects, this is not a contraindication for IUD use. Overall, IUDs are safe and acceptable also in young nulliparous women. The same is likely the case for virgin women, unless there is a microperforate hymen that obstructs any insertion of the IUD.\n\nDevice description \n\nThere are a number of models of the copper IUD available around the world. Most copper devices consist of a plastic core that is wrapped in a copper wire.\nMany of the devices have a T-shape similar to the hormonal IUD. However, there are \"frameless\" copper IUDs available around the world as well. ParaGard is the only model currently available in the United States. At least three copper IUD models are available in Canada, two of which are a slimmer T-shape version used for women who have not had children. Early copper IUDs had copper around only the vertical stem, but more recent models have copper sleeves wrapped around the horizontal arms as well, increasing effectiveness.\nSome newer models also contain a silver core instead of a plastic core to delay copper fragmentation as well as increase the lifespan of the device. The lifespan of the devices range from 3 years to 10 years; however, some studies have demonstrated that the TCu 380A may be effective through 12 years.\n\nIts ATC code is .\n\nInsertion \n\nThe copper IUD must be inserted by a qualified medical practitioner. A copper IUD can be inserted at any phase of the menstrual cycle, but the optimal time is right after the menstrual period, when the cervix is softest and the woman is least likely to be pregnant. The insertion process generally takes five minutes or less. The procedure can cause cramping or be painful for some women.\nBefore placement of an IUD, a medical history and physical examination by a medical professional is useful to check for any contraindications or concerns.[http://www.emedicinehealth.com/birth_control_intrauterine_devices_iuds/article_em.htm Birth Control Intrauterine Devices (IUDs)]  Author: Omnia M Samra. Last Editorial Review: 5/18/2006 It is also recommended by some clinicians that patients be tested for gonorrhea and chlamydia, as these two infections increase the risk of contracting pelvic inflammatory disease shortly after insertion.\nImmediately prior to insertion, the clinician will perform a pelvic exam to determine the position of the uterus. p.150:Mechanism of action Although the precise mechanism of action is not known, currently available IUCs work primarily by preventing sperm from fertilizing ova.26 IUCs are not abortifacients: they do not interrupt an implanted pregnancy.27 Pregnancy is prevented by a combination of the \"foreign body effect\" of the plastic or metal frame and the specific action of the medication (copper or levonorgestrel) that is released. Exposure to a foreign body causes a sterile inflammatory reaction in the intrauterine environment that is toxic to sperm and ova and impairs implantation.28,29 The production of cytotoxic peptides and activation of enzymes lead to inhibition of sperm motility, reduced sperm capacitation and survival, and increased phagocytosis of sperm.30,31 The TCu380A causes an increase in copper ions, enzymes, prostaglandins, and white blood cells (macrophages) in uterine and tubal fluids; these impair sperm function and prevent fertilization.p. 162:Table 7-1. Myths and misconceptions about IUCsMyth: IUCs are abortifacients. Fact: IUCs prevent fertilization and are true contraceptives.\nAfter the pelvic exam, the vagina is held open with a speculum. A tenaculum is used to steady the cervix and uterus. Uterine sounding may be used to measure the length and direction of the cervical canal and uterus in order to decrease the risk of uterine perforation.[http://contraception.about.com/od/iud/ss/iudinsertion_4.htm about.com > What To Expect During an IUD Insertion]  By Dawn Stacey M.Ed. Updated April 30, 2010 The IUD is placed using a narrow tube, which is inserted through the cervix into the uterus. Short monofilament plastic/nylon strings hang down from the uterus into the vagina. The clinician will trim the threads so that they only protrude 3 to 4 cm out of the cervix and remain in the upper vagina. The strings allow the patient or clinician to periodically check to ensure the IUD is still in place and to enable easy removal of the device.\n\nThe copper IUD can be inserted at any time in a woman's menstrual cycle as long as the woman is not pregnant. An IUD can also be inserted immediately postpartum and post-abortion as long as no infection has occurred. Breastfeeding is not a contraindication for the use of the copper IUD. The IUD can be inserted in women with HIV or AIDS as it does not increase the risk of transmission.\nAlthough previously not recommended for nulliparous women (women who have not had children), the IUD is now recommended for most women who are past menarche (their first period), including adolescents.\n\nAfter the insertion is finished, normal activities such as sex, exercise, and swimming can be performed as soon as it feels comfortable. Strenuous physical activity does not affect the position of the IUD.\n\nTypes \n\nMany different types of copper IUDs are currently manufactured worldwide, but availability varies by country. In the United States, only one type of copper IUD is approved for use, while in the United Kingdom, over ten varieties are available. One company, Mona Lisa N.V. offers generic versions of many existing IUDs.[http://www.monalisa-iud.com/parser.php?topica2&lang\nen Mona Lisa N.V.] , a manufacturer of generic IUDs\n\nFrameless IUDs \n\nThe frameless IUD eliminates the use of the frame that gives conventional IUDs their signature T-shape. This change in design was made to reduce discomfort and expulsion associated with prior IUDs; without a solid frame, the frameless IUD should mold to the shape of the uterus. It may reduce expulsion and discontinuation rates compared to framed copper IUDs.\n\nGynefix is the only frameless IUD brand currently available.  It consists of hollow copper tubes on a polypropylene thread.  It is inserted through the cervix with a special applicator that sutures the thread to the fundus (top) of the uterus; the thread is then cut with a tail hanging outside of the cervix, similar to frame IUDs.  When this tail is pulled, the suture comes undone and the device can be removed.  This requires more force than removing a T-shaped IUD, but results in comparable discomfort during removal. Gynefix is not approved for use in the United States.\n\nMechanism of action \n\nThe copper IUD's primary mechanism of action is to prevent fertilization. p. S28:ConclusionsActive substances released from the IUD or IUS, together with products derived from the inflammatory reaction present in the luminal fluids of the genital tract, are toxic for spermatozoa and oocytes, preventing the encounter of healthy gametes and the formation of viable embryos. The current data do not indicate that embryos are formed in IUD users at a rate comparable to that of nonusers. The common belief that the usual mechanism of action of IUDs in women is destruction of embryos in the uterus is not supported by empirical evidence. The bulk of the data indicate that interference with the reproductive process after fertilization has taken place is exceptional in the presence of a T-Cu or LNG-IUD and that the usual mechanism by which they prevent pregnancy in women is by preventing fertilization. p. 246:Mechanism of actionThe contraceptive action of all IUDs is mainly in the intrauterine cavity. Ovulation is not affected, and the IUD is not an abortifacient.58–60 It is currently believed that the mechanism of action for IUDs is the production of an intrauterine environment that is spermicidal.Nonmedicated IUDs depend for contraception on the general reaction of the uterus to a foreign body. It is believed that this reaction, a sterile inflammatory response, produces tissue injury of a minor degree but sufficient enough to be spermicidal. Very few, if any, sperm reach the ovum in the fallopian tube… In women using copper IUDs, sensitive assays for human chorionic gonadotropin do not find evidence of fertilization.62,63 This is consistent with the fact that the copper IUD protects against both intrauterine and ectopic pregnancies.The copper IUD releases free copper and copper salts that have both a biochemical and morphological impact on the endometrium and also produce alterations in cervical mucus and endometrial secretions... An additional spermicidal effect probably takes place in the cervical mucus. p. 259:Intrauterine devicesMechanisms of actionThe common belief that the usual mechanism of action of IUDs in women is destruction of embryos in the uterus is not supported by empirical evidence... Because concern over mechanism of action represents a barrier to acceptance of this important and highly effective method for some women and some clinicians, it is important to point out that there is no evidence to suggest that the mechanism of action of IUDs is abortifacient... the principal mechanism of action of the copper T 380A IUD is to interfere with sperm action, preventing fertilization of the ovum. Copper acts as a spermicide within the uterus. The presence of copper increases the levels of copper ions, prostaglandins, and white blood cells within the uterine and tubal fluids.\n\nAlthough not a primary mechanism of action, some experts in human reproduction believe there is sufficient evidence to suggest that IUDs with copper can disrupt implantation, p. 199:Mechanisms of actionThus, both clinical and experimental evidence suggests that IUDs can prevent and disrupt implantation. It is unlikely, however, that this is the main IUD mode of action, … The best evidence indicates that in IUD users it is unusual for embryos to reach the uterus.In conclusion, IUDs may exert their contraceptive action at different levels. Potentially, they interfere with sperm function and transport within the uterus and tubes. It is difficult to determine whether fertilization of the oocyte is impaired by these compromised sperm. There is sufficient evidence to suggest that IUDs can prevent and disrupt implantation. The extent to which this interference contributes to its contraceptive action is unknown. The data are scanty and the political consequences of resolving this issue interfere with comprehensive research.p. 205:SummaryIUDs that release copper or levonorgestrel are extremely effective contraceptives... Both copper IUDs and levonorgestrel releasing IUSs may interfere with implantation, although this may not be the primary mechanism of action. The devices also create barriers to sperm transport and fertilization, and sensitive assays detect hCG in less than 1% of cycles, indicating that significant prevention must occur before the stage of implantation. especially when used for emergency contraception.  p. 157:Emergency postcoital contraceptionOther methodsAnother method of emergency contraception is the insertion of a copper IUD, anytime during the preovulatory phase of the menstrual cycle and up to 5 days after ovulation. The failure rate (in a small number of studies) is very low, 0.1%.34,35 This method definitely prevents implantation, but it is not suitable for women who are not candidates for intrauterine contraception, e.g., multiple sexual partners or a rape victim. The use of a copper IUD for emergency contraception is expensive, but not if it is retained as an ongoing method of contraception. p. 121:Mechanism of actionCopper-releasing IUCsWhen used as a regular or emergency method of contraception, copper-releasing IUCs act primarily to prevent fertilization. Emergency insertion of a copper IUC is significantly more effective than the use of ECPs, reducing the risk of pregnancy following unprotected intercourse by more than 99%.2,3 This very high level of effectiveness implies that emergency insertion of a copper IUC must prevent some pregnancies after fertilization.Pregnancy begins with implantation according to medical authorities such as the US FDA, the National Institutes of Health79 and the American College of Obstetricians and Gynecologists (ACOG).80 Despite this, there has been no definitive evidence that IUD users have higher rates of embryonic loss than women not using contraception. Therefore, the copper IUD is considered to be a true contraceptive and not an abortifacient.\n\nUsage \n\nGlobally, the IUD is the most widely used method of reversible birth control. The most recent data indicates that there are 169 million IUD users around the world. This includes both the nonhormonal and hormonal IUDs. IUDs are most popular in Asia, where the prevalence is almost 30%. In Africa and Europe the prevalence is around 20%. As of 2009, levels of IUD use in the United States are estimated to be 5.5%. Data in the United States does not distinguish between hormonal and nonhormonal IUDs. In Europe, copper IUD prevalence ranges from under 5% in the United Kingdom to over 10% in Denmark in 2006.\n\nHistory \n\nAccording to popular legend, Arab traders inserted small stones into the uteruses of their camels to prevent pregnancy during long desert treks. The story was originally a tall tale to entertain delegates at a scientific conference on family planning; although it was later repeated as truth, it has no known historical basis., which cites:\n* \n* \n\nPrecursors to IUDs were first marketed in 1902. Developed from stem pessaries (where the stem held the pessary in place over the cervix), the 'stem' on these devices actually extended into the uterus itself. Because they occupied both the vagina and the uterus, this type of stem pessary was also known as an interuterine device.  Use of interuterine devices was associated with high rates of infection; for this reason, they were condemned by the medical community.\n\nThe first intrauterine device (contained entirely in the uterus) was described in a German publication in 1909, although the author appears to have never marketed his product.\n\nIn 1929, Ernst Gräfenberg of Germany published a report on an IUD made of silk suture. He had found a 3% pregnancy rate among 1,100 women using his ring. In 1930, Gräfenberg reported a lower pregnancy rate of 1.6% among 600 women using an improved ring wrapped in silver wire. Unbeknownst to Gräfenberg, the silver wire was contaminated with 26% copper. Copper's role in increasing IUD efficacy would not be recognized until nearly 40 years later.\n\nIn 1934, Japanese physician Tenrei Ota developed a variation of the Gräfenberg ring that contained a supportive structure in the center. The addition of this central disc lowered the IUD's expulsion rate. These devices still had high rates of infection, and their use and development was further stifled by World War II politics: contraception was forbidden in both Nazi Germany and Axis-allied Japan. The Allies did not learn of the work by Gräfenberg and Ota until well after the war ended.\n\nThe first plastic IUD, the Margulies Coil or Margulies Spiral, was introduced in 1958. This device was somewhat large, causing discomfort to a large proportion of women users, and had a hard plastic tail, causing discomfort to their male partners.  The modern colloquialism \"coil\" is based on the coil-shaped design of early IUDs.\n\nThe Lippes Loop, a slightly smaller device with a monofilament tail, was introduced in 1962 and gained in popularity over the Margulies device.\n\nThe stainless steel single-ring IUD was developed in the 1970s (Has pictures of various IUD designs.) and widely used in China because of low manufacturing costs. The Chinese government banned production of steel IUDs in 1993 due to high failure rates (up to 10% per year).\n\nHoward Tatum, in the USA, conceived the plastic T-shaped IUD in 1968. Shortly thereafter Jaime Zipper, in Chile, introduced the idea of adding copper to the devices to improve their contraceptive effectiveness. (Has pictures of many IUD designs, both historic and modern.) It was found that copper-containing devices could be made in smaller sizes without compromising effectiveness, resulting in fewer side effects such as pain and bleeding. T-shaped devices had lower rates of expulsion due to their greater similarity to the shape of the uterus.\n\nThe poorly designed Dalkon Shield plastic IUD (which had a multifilament tail) was manufactured by the A. H. Robins Company and sold by Robins in the United States for three and a half years from January 1971 through June 1974, before sales were suspended by Robins on June 28, 1974 at the request of the FDA because of safety concerns following reports of 110 septic spontaneous abortions in women with the Dalkon Shield in place, seven of whom had died.\nRobins stopped international sales of the Dalkon Shield in April 1975.\n\nTatum developed many different models of the copper IUD. He created the TCu220 C, which had copper collars as opposed to copper filament, which prevented metal loss and increased the lifespan of the device.  Second-generation copper-T IUDs were also introduced in the 1970s. These devices had higher surface areas of copper, and for the first time consistently achieved effectiveness rates of greater than 99%. The last model Tatum developed was the TCu380A, the model that is most recommended today. In addition to T-shaped IUDs, there are also U-shaped IUDs (such as the Multiload) and 7-shaped Gravigard Copper 7 (with a mini version for nulliparous women introduced in the 1980s). More recently, a frameless IUD called Gynefix was introduced.\n\nBrands \n\nThe ParaGard T-380A is an IUD with copper, manufactured and marketed in the United States by Duramed Pharmaceuticals. It is the only copper-containing intrauterine device approved for use in the U.S. (three hormonal uterine devices, Mirena, Skyla and Liletta are also approved). The ParaGard consists of a T-shaped polyethylene frame wound with copper wire, along with two monofilament threads to aid in removal of the IUD.\n\nThe ParaGard T 380A was developed in the 1970s by the Population Council and Finishing Enterprises Inc. (FEI). The Population Council's ParaGard new drug application (NDA) was approved by the U.S. Food and Drug Administration (FDA) and FEI began manufacturing it for distribution outside the United States in 1984. GynoPharma (originally GynoMed) began marketing it in the U.S. in May 1988. On August 2, 1995, Ortho-McNeil acquired GynoPharma and began marketing ParaGard in the U.S. On January 1, 2004, FEI Women's Health acquired the patent from the Population Council and U.S. marketing rights from Ortho-McNeil. On November 10, 2005, Duramed Pharmaceuticals, a subsidiary of Barr Pharmaceuticals, acquired FEI Women's Health and ParaGard.  On July 18, 2008, it was announced that Teva Pharmaceutical Industries Ltd. would acquire Barr Pharmaceuticals.\n\nThe original FDA approval of ParaGard in 1984 was for 4 years continuous use, this was later extended to 6 years in 1989, then 8 years in 1991, then 10 years in 1994.  (ATC code )",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Copper IUDs" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15378" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Intrauterine device (IUD) with copper also known as intrauterine coil, is a type of intrauterine device which contains copper. It is used for birth control and emergency contraception within five days of unprotected sex. It is one of the most effective forms of birth control with a one-year failure rate around 0.7%. The device is placed in the uterus and lasts three to ten years. It may be used by women of all ages regardless of whether or not they have had children. Following removal, fertility quickly returns.\n\nSide effects include heavy menstrual periods, painful periods, or the device may come out. It is less recommended in people at high risk of sexually transmitted infections as it may increase the risk of pelvic inflammatory disease in the first three weeks after insertion. If a woman becomes pregnant with an IUD in place removal is recommended. Rarely uterine perforation can occur during insertion. The copper IUD is a type of long-acting reversible birth control. It primarily works by killing the sperm.\n\nThe copper IUD came into medical use in the 1970s. It is on the World Health Organization's List of Essential Medicines, the most effective and safe medicines needed in a health system. The wholesale cost in the developing world is about 0.37 to 3.00 USD per IUD. In the United Kingdom they cost the NHS about 10 pounds. In the United States they cost around 750 USD. They are used by more than 170 million women globally.\n\nMedical uses \n\nCopper IUDs are a form of long-acting reversible contraception and are one of the most effective forms of birth control available. The type of frame and amount of copper can affect the effectiveness of different copper IUD models. The failure rates for different models vary between 0.1 and 2.2% after 1 year of use. The T-shaped models with a surface area of 380 mm² of copper have the lowest failure rates. The TCu 380A (ParaGard) has a one-year failure rate of 0.8% and a cumulative 12-year failure rate of 2.2%. Over 12 years of use, the models with less surface area of copper have higher failure rates. The TCu 220A has a 12-year failure rate of 5.8%. The frameless GyneFix also has a failure rate of less than 1% per year. Worldwide, older IUD models with lower effectiveness rates are no longer produced.\n\nUnlike other forms of reversible contraception, the typical use failure rate and the perfect use failure rate for the copper IUDs are the same because the IUD does not depend on user action. A 2008 review of the available T-shaped copper IUDs recommended that the TCu 380A and the TCu 280S be used as the first choice for copper IUDs because those two models have the lowest failure rates and the longest lifespans. The effectiveness of the copper IUD is comparable to tubal sterilization, which has a first year failure rate of 0.5%. However, the effects of the copper IUD are reversible, which can be viewed as either an advantage or a disadvantage, depending on a person's goals for contraception.\n\nEmergency contraception \n\nIt was first discovered in 1976 that the copper IUD could be used as a form of emergency contraception (EC).\nThe copper IUD is the most effective form of emergency contraception. It is more effective than the hormonal EC pills currently available.\nThe pregnancy rate among those using the copper IUD for EC is 0.09%. It can be used for EC up to 5 days after the act of unprotected sex and does not decrease in effectiveness during the 5 days.\nAn additional advantage of using the copper IUD for emergency contraception is that it can be used as a form of birth control for 10–12 years after insertion.\n\nRemoval and return to fertility \n\nRemoval of the copper IUD should also be performed by a qualified medical practitioner. Fertility has been shown to return to previous levels quickly after removal of the device. One study found that the median amount of time from removal to planned pregnancy was three months for those women using the TCu 380Ag.\n\nSide effects \n\nExpulsion: Sometimes the copper IUD can be spontaneously expelled from the uterus. Expulsion rates can range from 2.2% to 11.4% of users from the first year to the 10th year. The TCu380A may have lower rates of expulsion than other models. Unusual vaginal discharge, cramping or pain, spotting between periods, postcoital (after sex) spotting, dyspareunia, or the absence or lengthening of the strings can be signs of a possible expulsion. If expulsion occurs, the woman is not protected against pregnancy. If an IUD with copper is inserted after an expulsion has occurred, the risk of re-expulsion has been estimated in one study to be approximately one third of cases after one year. Magnetic resonance imaging may cause dislocation of a copper IUD, and it is therefore recommended to check the location of the IUD both before and after MRI.\n\nPerforation: Very rarely, the IUD can move through the wall of the uterus. Risk of perforation is mostly determined by the skill of the practitioner performing the insertion. For experienced medical practitioners, the risk of perforation is 1 per 1,000 insertions or less. If perforation does occur it can damage the internal organs, and in some cases surgery is needed to remove the IUD.\n\nInfection: The insertion of a copper IUD poses a transient risk of pelvic inflammatory disease (PID) in the first 21 days after insertion. However, it is a small risk and is attributable to preexisting gonorrhea or chlamydia infection at the time of insertion, and not to the IUD itself.[http://www.maqweb.org/iudtoolkit/service_delivery/infectionprevention.shtml maqweb.org > Infection Prevention Practices for IUD Insertion and Removal]  By the United States Agency for International Development (USAID). Retrieved on Feb 14, 2010 Proper infection prevention procedures have little or no effect on the course of gonorrhea or chlamydia infections, but is important in helping protect both clients and providers from infection in general. Such infection prevention practices include washing hands and then putting on gloves, cleaning the cervix and vagina, making minimal contact with non-sterile surfaces (using a \"no touch insertion technique\") and, after the procedure, washing hands again and then processing instruments. The device itself carries no increased risk of PID beyond the time of insertion.\n\nCramping: Many women feel cramping or pain during the IUD insertion process and immediately after as a result of cervix dilation during insertion. Taking NSAIDS before the procedure can reduce discomfort, as can the use of a local anaesthetic. Misoprostol 6 to 12 hrs before insertion can help with cervical dilation. Some women may have cramps for 1 to 2 weeks following insertion. The copper IUD can also increase cramps during a woman’s period. This symptom will clear up for some women in 3 to 6 months, but may not for others.\n\nHeavier periods: The copper IUD increases the amount of blood flow during a woman’s menstrual periods. On average, menstrual blood loss increases by 20–50% after insertion of a copper-T IUD; increased menstrual discomfort is the most common medical reason for IUD removal. This symptom may clear up for some women after 3 to 6 months, but may not for others.\n\nIrregular bleeding and spotting: For the first 3 to 6 months after insertion, the copper IUD can cause irregular periods and spotting between periods.\n\nString problems: A small portion of men report that they can feel the strings during intercourse. In this case, strings can be trimmed. However, very short strings can prevent the woman from checking the strings for expulsion. Medical ultrasonography may be required in such cases to check the location of the IUD.\n\nPregnancy: Although rare, if pregnancy does occur with the copper IUD in place there can be serious side effects. The risk of ectopic pregnancy to a woman using an IUD is lower than the risk of ectopic pregnancy to a woman using no form of birth control. However, of pregnancies that do occur during IUD use, a higher than expected percentage (3–4%) are ectopic. If a pregnancy occurs with the IUD in place there is a higher risk of miscarriage or early delivery. If this occurs and the IUD strings are visible, the IUD should be removed immediately by a clinician. Although the Dalkon Shield IUD was associated with septic abortions (infections associated with miscarriage), other brands of IUD are not. IUDs are also not associated with birth defects.\n\nSome barrier contraceptives protect against STIs. Hormonal contraceptives reduce the risk of developing pelvic inflammatory disease (PID), a serious complication of certain STIs. IUDs, by contrast, do not protect against STIs or PID.\n\nContraindications \n\nA category 3 condition indicates conditions where the theoretical or proven risks usually outweigh the advantages of inserting a copper IUD. A category 4 condition indicates conditions that represent an unacceptable health risk if a copper IUD is inserted.\n\nWomen should not use a copper IUD if they:\n\n(Category 4)\n*Are pregnant or think they may be pregnant\n*Septic pregnancy or abortion\n*Have unexplained abnormal vaginal bleeding\n*Have untreated cervical cancer\n*Have malignant gestational trophoblastic disease\n*Have uterine cancer\n*Have certain uterine abnormalities\n*Have or may have had a pelvic infection within the past three months\n*Have or may have an STI\n*Have pelvic tuberculosis\n\n(Category 3)\n*Are postpartum between 48 hours and 4 weeks (increased IUD expulsion rate with delayed postpartum insertion). The CDC and WHO criteria differ in their recommendation for women postpartum between 48 hours and 4 weeks. The CDC does not list this as a contraindication.\n*Have benign gestational trophoblastic disease\n*Have ovarian cancer\n*Have AIDS (unless clinically well on anti-retroviral therapy)\n*Have very high individual likelihood of exposure to gonorrhea or chlamydial STIs\n\nA full list of contraindications can be found in the WHO Medical Eligibility Criteria for Contraceptive Use and the CDC United States Medical Eligibility Criteria for Contraceptive Use.\n\nWhile nulliparous women (women who have never given birth) are somewhat more likely to have side effects, this is not a contraindication for IUD use. Overall, IUDs are safe and acceptable also in young nulliparous women. The same is likely the case for virgin women, unless there is a microperforate hymen that obstructs any insertion of the IUD.\n\nDevice description \n\nThere are a number of models of the copper IUD available around the world. Most copper devices consist of a plastic core that is wrapped in a copper wire.\nMany of the devices have a T-shape similar to the hormonal IUD. However, there are \"frameless\" copper IUDs available around the world as well. ParaGard is the only model currently available in the United States. At least three copper IUD models are available in Canada, two of which are a slimmer T-shape version used for women who have not had children. Early copper IUDs had copper around only the vertical stem, but more recent models have copper sleeves wrapped around the horizontal arms as well, increasing effectiveness.\nSome newer models also contain a silver core instead of a plastic core to delay copper fragmentation as well as increase the lifespan of the device. The lifespan of the devices range from 3 years to 10 years; however, some studies have demonstrated that the TCu 380A may be effective through 12 years.\n\nIts ATC code is .\n\nInsertion \n\nThe copper IUD must be inserted by a qualified medical practitioner. A copper IUD can be inserted at any phase of the menstrual cycle, but the optimal time is right after the menstrual period, when the cervix is softest and the woman is least likely to be pregnant. The insertion process generally takes five minutes or less. The procedure can cause cramping or be painful for some women.\nBefore placement of an IUD, a medical history and physical examination by a medical professional is useful to check for any contraindications or concerns.[http://www.emedicinehealth.com/birth_control_intrauterine_devices_iuds/article_em.htm Birth Control Intrauterine Devices (IUDs)]  Author: Omnia M Samra. Last Editorial Review: 5/18/2006 It is also recommended by some clinicians that patients be tested for gonorrhea and chlamydia, as these two infections increase the risk of contracting pelvic inflammatory disease shortly after insertion.\nImmediately prior to insertion, the clinician will perform a pelvic exam to determine the position of the uterus. p.150:Mechanism of action Although the precise mechanism of action is not known, currently available IUCs work primarily by preventing sperm from fertilizing ova.26 IUCs are not abortifacients: they do not interrupt an implanted pregnancy.27 Pregnancy is prevented by a combination of the \"foreign body effect\" of the plastic or metal frame and the specific action of the medication (copper or levonorgestrel) that is released. Exposure to a foreign body causes a sterile inflammatory reaction in the intrauterine environment that is toxic to sperm and ova and impairs implantation.28,29 The production of cytotoxic peptides and activation of enzymes lead to inhibition of sperm motility, reduced sperm capacitation and survival, and increased phagocytosis of sperm.30,31 The TCu380A causes an increase in copper ions, enzymes, prostaglandins, and white blood cells (macrophages) in uterine and tubal fluids; these impair sperm function and prevent fertilization.p. 162:Table 7-1. Myths and misconceptions about IUCsMyth: IUCs are abortifacients. Fact: IUCs prevent fertilization and are true contraceptives.\nAfter the pelvic exam, the vagina is held open with a speculum. A tenaculum is used to steady the cervix and uterus. Uterine sounding may be used to measure the length and direction of the cervical canal and uterus in order to decrease the risk of uterine perforation.[http://contraception.about.com/od/iud/ss/iudinsertion_4.htm about.com > What To Expect During an IUD Insertion]  By Dawn Stacey M.Ed. Updated April 30, 2010 The IUD is placed using a narrow tube, which is inserted through the cervix into the uterus. Short monofilament plastic/nylon strings hang down from the uterus into the vagina. The clinician will trim the threads so that they only protrude 3 to 4 cm out of the cervix and remain in the upper vagina. The strings allow the patient or clinician to periodically check to ensure the IUD is still in place and to enable easy removal of the device.\n\nThe copper IUD can be inserted at any time in a woman's menstrual cycle as long as the woman is not pregnant. An IUD can also be inserted immediately postpartum and post-abortion as long as no infection has occurred. Breastfeeding is not a contraindication for the use of the copper IUD. The IUD can be inserted in women with HIV or AIDS as it does not increase the risk of transmission.\nAlthough previously not recommended for nulliparous women (women who have not had children), the IUD is now recommended for most women who are past menarche (their first period), including adolescents.\n\nAfter the insertion is finished, normal activities such as sex, exercise, and swimming can be performed as soon as it feels comfortable. Strenuous physical activity does not affect the position of the IUD.\n\nTypes \n\nMany different types of copper IUDs are currently manufactured worldwide, but availability varies by country. In the United States, only one type of copper IUD is approved for use, while in the United Kingdom, over ten varieties are available. One company, Mona Lisa N.V. offers generic versions of many existing IUDs.[http://www.monalisa-iud.com/parser.php?topica2&lang\nen Mona Lisa N.V.] , a manufacturer of generic IUDs\n\nFrameless IUDs \n\nThe frameless IUD eliminates the use of the frame that gives conventional IUDs their signature T-shape. This change in design was made to reduce discomfort and expulsion associated with prior IUDs; without a solid frame, the frameless IUD should mold to the shape of the uterus. It may reduce expulsion and discontinuation rates compared to framed copper IUDs.\n\nGynefix is the only frameless IUD brand currently available.  It consists of hollow copper tubes on a polypropylene thread.  It is inserted through the cervix with a special applicator that sutures the thread to the fundus (top) of the uterus; the thread is then cut with a tail hanging outside of the cervix, similar to frame IUDs.  When this tail is pulled, the suture comes undone and the device can be removed.  This requires more force than removing a T-shaped IUD, but results in comparable discomfort during removal. Gynefix is not approved for use in the United States.\n\nMechanism of action \n\nThe copper IUD's primary mechanism of action is to prevent fertilization. p. S28:ConclusionsActive substances released from the IUD or IUS, together with products derived from the inflammatory reaction present in the luminal fluids of the genital tract, are toxic for spermatozoa and oocytes, preventing the encounter of healthy gametes and the formation of viable embryos. The current data do not indicate that embryos are formed in IUD users at a rate comparable to that of nonusers. The common belief that the usual mechanism of action of IUDs in women is destruction of embryos in the uterus is not supported by empirical evidence. The bulk of the data indicate that interference with the reproductive process after fertilization has taken place is exceptional in the presence of a T-Cu or LNG-IUD and that the usual mechanism by which they prevent pregnancy in women is by preventing fertilization. p. 246:Mechanism of actionThe contraceptive action of all IUDs is mainly in the intrauterine cavity. Ovulation is not affected, and the IUD is not an abortifacient.58–60 It is currently believed that the mechanism of action for IUDs is the production of an intrauterine environment that is spermicidal.Nonmedicated IUDs depend for contraception on the general reaction of the uterus to a foreign body. It is believed that this reaction, a sterile inflammatory response, produces tissue injury of a minor degree but sufficient enough to be spermicidal. Very few, if any, sperm reach the ovum in the fallopian tube… In women using copper IUDs, sensitive assays for human chorionic gonadotropin do not find evidence of fertilization.62,63 This is consistent with the fact that the copper IUD protects against both intrauterine and ectopic pregnancies.The copper IUD releases free copper and copper salts that have both a biochemical and morphological impact on the endometrium and also produce alterations in cervical mucus and endometrial secretions... An additional spermicidal effect probably takes place in the cervical mucus. p. 259:Intrauterine devicesMechanisms of actionThe common belief that the usual mechanism of action of IUDs in women is destruction of embryos in the uterus is not supported by empirical evidence... Because concern over mechanism of action represents a barrier to acceptance of this important and highly effective method for some women and some clinicians, it is important to point out that there is no evidence to suggest that the mechanism of action of IUDs is abortifacient... the principal mechanism of action of the copper T 380A IUD is to interfere with sperm action, preventing fertilization of the ovum. Copper acts as a spermicide within the uterus. The presence of copper increases the levels of copper ions, prostaglandins, and white blood cells within the uterine and tubal fluids.\n\nAlthough not a primary mechanism of action, some experts in human reproduction believe there is sufficient evidence to suggest that IUDs with copper can disrupt implantation, p. 199:Mechanisms of actionThus, both clinical and experimental evidence suggests that IUDs can prevent and disrupt implantation. It is unlikely, however, that this is the main IUD mode of action, … The best evidence indicates that in IUD users it is unusual for embryos to reach the uterus.In conclusion, IUDs may exert their contraceptive action at different levels. Potentially, they interfere with sperm function and transport within the uterus and tubes. It is difficult to determine whether fertilization of the oocyte is impaired by these compromised sperm. There is sufficient evidence to suggest that IUDs can prevent and disrupt implantation. The extent to which this interference contributes to its contraceptive action is unknown. The data are scanty and the political consequences of resolving this issue interfere with comprehensive research.p. 205:SummaryIUDs that release copper or levonorgestrel are extremely effective contraceptives... Both copper IUDs and levonorgestrel releasing IUSs may interfere with implantation, although this may not be the primary mechanism of action. The devices also create barriers to sperm transport and fertilization, and sensitive assays detect hCG in less than 1% of cycles, indicating that significant prevention must occur before the stage of implantation. especially when used for emergency contraception.  p. 157:Emergency postcoital contraceptionOther methodsAnother method of emergency contraception is the insertion of a copper IUD, anytime during the preovulatory phase of the menstrual cycle and up to 5 days after ovulation. The failure rate (in a small number of studies) is very low, 0.1%.34,35 This method definitely prevents implantation, but it is not suitable for women who are not candidates for intrauterine contraception, e.g., multiple sexual partners or a rape victim. The use of a copper IUD for emergency contraception is expensive, but not if it is retained as an ongoing method of contraception. p. 121:Mechanism of actionCopper-releasing IUCsWhen used as a regular or emergency method of contraception, copper-releasing IUCs act primarily to prevent fertilization. Emergency insertion of a copper IUC is significantly more effective than the use of ECPs, reducing the risk of pregnancy following unprotected intercourse by more than 99%.2,3 This very high level of effectiveness implies that emergency insertion of a copper IUC must prevent some pregnancies after fertilization.Pregnancy begins with implantation according to medical authorities such as the US FDA, the National Institutes of Health79 and the American College of Obstetricians and Gynecologists (ACOG).80 Despite this, there has been no definitive evidence that IUD users have higher rates of embryonic loss than women not using contraception. Therefore, the copper IUD is considered to be a true contraceptive and not an abortifacient.\n\nUsage \n\nGlobally, the IUD is the most widely used method of reversible birth control. The most recent data indicates that there are 169 million IUD users around the world. This includes both the nonhormonal and hormonal IUDs. IUDs are most popular in Asia, where the prevalence is almost 30%. In Africa and Europe the prevalence is around 20%. As of 2009, levels of IUD use in the United States are estimated to be 5.5%. Data in the United States does not distinguish between hormonal and nonhormonal IUDs. In Europe, copper IUD prevalence ranges from under 5% in the United Kingdom to over 10% in Denmark in 2006.\n\nHistory \n\nAccording to popular legend, Arab traders inserted small stones into the uteruses of their camels to prevent pregnancy during long desert treks. The story was originally a tall tale to entertain delegates at a scientific conference on family planning; although it was later repeated as truth, it has no known historical basis., which cites:\n* \n* \n\nPrecursors to IUDs were first marketed in 1902. Developed from stem pessaries (where the stem held the pessary in place over the cervix), the 'stem' on these devices actually extended into the uterus itself. Because they occupied both the vagina and the uterus, this type of stem pessary was also known as an interuterine device.  Use of interuterine devices was associated with high rates of infection; for this reason, they were condemned by the medical community.\n\nThe first intrauterine device (contained entirely in the uterus) was described in a German publication in 1909, although the author appears to have never marketed his product.\n\nIn 1929, Ernst Gräfenberg of Germany published a report on an IUD made of silk suture. He had found a 3% pregnancy rate among 1,100 women using his ring. In 1930, Gräfenberg reported a lower pregnancy rate of 1.6% among 600 women using an improved ring wrapped in silver wire. Unbeknownst to Gräfenberg, the silver wire was contaminated with 26% copper. Copper's role in increasing IUD efficacy would not be recognized until nearly 40 years later.\n\nIn 1934, Japanese physician Tenrei Ota developed a variation of the Gräfenberg ring that contained a supportive structure in the center. The addition of this central disc lowered the IUD's expulsion rate. These devices still had high rates of infection, and their use and development was further stifled by World War II politics: contraception was forbidden in both Nazi Germany and Axis-allied Japan. The Allies did not learn of the work by Gräfenberg and Ota until well after the war ended.\n\nThe first plastic IUD, the Margulies Coil or Margulies Spiral, was introduced in 1958. This device was somewhat large, causing discomfort to a large proportion of women users, and had a hard plastic tail, causing discomfort to their male partners.  The modern colloquialism \"coil\" is based on the coil-shaped design of early IUDs.\n\nThe Lippes Loop, a slightly smaller device with a monofilament tail, was introduced in 1962 and gained in popularity over the Margulies device.\n\nThe stainless steel single-ring IUD was developed in the 1970s (Has pictures of various IUD designs.) and widely used in China because of low manufacturing costs. The Chinese government banned production of steel IUDs in 1993 due to high failure rates (up to 10% per year).\n\nHoward Tatum, in the USA, conceived the plastic T-shaped IUD in 1968. Shortly thereafter Jaime Zipper, in Chile, introduced the idea of adding copper to the devices to improve their contraceptive effectiveness. (Has pictures of many IUD designs, both historic and modern.) It was found that copper-containing devices could be made in smaller sizes without compromising effectiveness, resulting in fewer side effects such as pain and bleeding. T-shaped devices had lower rates of expulsion due to their greater similarity to the shape of the uterus.\n\nThe poorly designed Dalkon Shield plastic IUD (which had a multifilament tail) was manufactured by the A. H. Robins Company and sold by Robins in the United States for three and a half years from January 1971 through June 1974, before sales were suspended by Robins on June 28, 1974 at the request of the FDA because of safety concerns following reports of 110 septic spontaneous abortions in women with the Dalkon Shield in place, seven of whom had died.\nRobins stopped international sales of the Dalkon Shield in April 1975.\n\nTatum developed many different models of the copper IUD. He created the TCu220 C, which had copper collars as opposed to copper filament, which prevented metal loss and increased the lifespan of the device.  Second-generation copper-T IUDs were also introduced in the 1970s. These devices had higher surface areas of copper, and for the first time consistently achieved effectiveness rates of greater than 99%. The last model Tatum developed was the TCu380A, the model that is most recommended today. In addition to T-shaped IUDs, there are also U-shaped IUDs (such as the Multiload) and 7-shaped Gravigard Copper 7 (with a mini version for nulliparous women introduced in the 1980s). More recently, a frameless IUD called Gynefix was introduced.\n\nBrands \n\nThe ParaGard T-380A is an IUD with copper, manufactured and marketed in the United States by Duramed Pharmaceuticals. It is the only copper-containing intrauterine device approved for use in the U.S. (three hormonal uterine devices, Mirena, Skyla and Liletta are also approved). The ParaGard consists of a T-shaped polyethylene frame wound with copper wire, along with two monofilament threads to aid in removal of the IUD.\n\nThe ParaGard T 380A was developed in the 1970s by the Population Council and Finishing Enterprises Inc. (FEI). The Population Council's ParaGard new drug application (NDA) was approved by the U.S. Food and Drug Administration (FDA) and FEI began manufacturing it for distribution outside the United States in 1984. GynoPharma (originally GynoMed) began marketing it in the U.S. in May 1988. On August 2, 1995, Ortho-McNeil acquired GynoPharma and began marketing ParaGard in the U.S. On January 1, 2004, FEI Women's Health acquired the patent from the Population Council and U.S. marketing rights from Ortho-McNeil. On November 10, 2005, Duramed Pharmaceuticals, a subsidiary of Barr Pharmaceuticals, acquired FEI Women's Health and ParaGard.  On July 18, 2008, it was announced that Teva Pharmaceutical Industries Ltd. would acquire Barr Pharmaceuticals.\n\nThe original FDA approval of ParaGard in 1984 was for 4 years continuous use, this was later extended to 6 years in 1989, then 8 years in 1991, then 10 years in 1994.  (ATC code ). Copper IUDs. http://en.wikipedia.org/?curid=15378."
  }
}
