{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17776",
  "eid" : "2e1e8ad0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778586621,
  "textBody" : "The economy of Lebanon is a developing economy, with a private sector that contributes to 75% of aggregate demand and a large banking sector that supports this demand. The IMF forecast a growth of 7% for Lebanon's real GDP in 2010 and 2011 following 9% growth in 2009 and 8.5% in 2008. It has the 54th richest GDP per capita in the world, and it was forecasted that Lebanon's GDP per capita would reach $20,000 by 2015, making it one of the strongest economies in the region. However, the Lebanese economy was badly affected by the Syrian civil war. The institute of international finance forecasted GDP growth of only 0.7% for 2013. Lebanon also suffers from a very high degree of public debt, the third-highest in the world in terms of the ratio of debt-to-GDP. As a consequence, interest payments consumed 48% of government revenues in 2016, thus limiting the government’s ability to make needed investments in infrastructure and other public goods.\n\nThe major industrial sectors include metal products, banking, agriculture, chemicals, and transport equipment. Lebanon has a competitive and free market regime and a strong laissez-faire commercial tradition. The Lebanese economy is service-oriented; main growth sectors include banking and tourism. There are no restrictions on foreign exchange or capital movement.\n\nMacro-economic trend\n\nThis is a chart of trend of gross domestic product of Lebanon at market prices estimated by the International Monetary Fund with figures in millions of Lebanese Pounds. \n\nFor purchasing power parity comparisons, the US Dollar is exchanged at 1,403.29 Lebanese Pounds only. Mean wages were $8.95 per man-hour in 2009.\n\nHistory \n\nThe 1975-90 Lebanese civil war seriously damaged Lebanon's economic infrastructure, cut national output by half, and had major consequences for Lebanon's position as a Middle Eastern entrepot and banking hub. After the war, the central government regained its ability to collect taxes and control over key port and government facilities. As a result, GDP per capita expanded 353% in the 1990s. \nEconomic recovery has been helped by a financially sound banking system and resilient small- and medium-scale manufacturers, with family remittances, banking services, manufactured and farm exports, and international aid as the main sources of foreign exchange. Lebanon's economy has made impressive gains since the launch of \"Horizon 2000,\" the government's $20 billion reconstruction program in 1993. Real GDP grew 8% in 1994 and 7% in 1995 before Israel's Operation Grapes of Wrath in April 1996 stunted economic activity. Real GDP grew at an average annual rate of less than 3% per year for 1997 and 1998 and only 1% in 1999. During 1992-98, annual inflation fell from more than 100% to 5%, and foreign exchange reserves jumped to more than $6 billion from $1.4 billion. Burgeoning capital inflows have generated foreign payments surpluses, and the Lebanese pound has remained relatively stable. Progress also has been made in rebuilding Lebanon's war-torn physical and financial infrastructure. Solidere, a $2-billion firm, is managing the reconstruction of Beirut's central business district; the stock market reopened in January 1996, and international banks and insurance companies are returning. The government nonetheless faces serious challenges in the economic arena. It has had to fund reconstruction by tapping foreign exchange reserves and boosting borrowing. Reducing the government budget deficit is a major goal of the current government. The gap between rich and poor grew in the 1990s, resulting in popular dissatisfaction over the skewed distribution of the reconstruction's benefits and leading the government to shift its focus from rebuilding infrastructure to improving living conditions.\n\nAfter the end of the civil war, Lebanon enjoyed considerable stability, Beirut's reconstruction was almost complete, and increasing numbers of tourists poured into the nation's resorts. The economy witnessed growth, with bank assets reaching over 75 billion US dollars, Market capitalization was also at an all-time high, estimated at $10.9 billion at the end of the second quarter of 2006. The month-long 2006 war severely damaged Lebanon's economy, especially the tourism sector.\nOver the course of 2008 Lebanon rebuilt its infrastructure mainly in the real estate and tourism sectors, resulting in a comparatively robust post war economy. Major contributors to the reconstruction of Lebanon include Saudi Arabia (with US$1.5 billion pledged), the European Union (with about $1 billion) and a few other Persian Gulf countries with contributions of up to $800 million.\n\nGiven the frequent security turmoil it has faced, the Lebanese banking system has adopted a conservative approach, with strict regulations imposed by the central bank to protect the economy from political instability. These regulations have generally left Lebanese banks unscathed by the Financial crisis of 2007–2010. Lebanese banks remain, under the current circumstances, high on liquidity and reputed for their security. In late 2008, Moody's shifted Lebanon's sovereign rankings from stable to positive, acknowledging its financial security. Moreover, with an increase of 51% in the Beirut stock market, the index provider MSCI ranked Lebanon the world's best performer in 2008. Lebanon is one of the only seven countries in the world in which the value of the stock market increased in 2008. The Lebanese economy experienced continued resilience, growing 8.5 percent in 2008, 7 percent in 2009 and 8.8% in 2010. However, Lebanon's debt to GDP ratio remained one of the highest in the world.\n\nThe International Monetary Fund issued a second report on Lebanon in October 2015, where its expectations of the economic growth rate were lowered to 2%, compared to the 2.5% growth rate of the first report, released in April 2015.\n\nExternal trade\n\nLebanon has a competitive and free market regime and a strong laissez-faire commercial tradition. The Lebanese economy is service-oriented; main growth sectors include banking and tourism. There are no restrictions on foreign exchange or capital movement, and bank secrecy is strictly enforced. Lebanon has recently adopted a law to combat money laundering. There are practically no restrictions on foreign investment. There are no country-specific U.S. trade sanctions against Lebanon.\n\nRemittances\n\nLebanon benefits from its large, cohesive, and entrepreneurial diaspora.Global Investment House.[https://web.archive.org/web/20080611182611/http://www.iom.int/jahia/Jahia/pid/426 Lebanon Economic and Strategic Outlook (Nov 2008)] Retrieved 28 June 2009. Over the course of time, emigration has yielded Lebanese \"commercial networks\" throughout the world.Background Note: Lebanon [https://web.archive.org/web/20051016135629/http://www.washingtoninstitute.org/documents/41e1aa0d7d676.pdf \"www.washingtoninstitute.org\"]. Retrieved 3 December 2006. As a result, remittances from Lebanese abroad to family members within the country total $8.2 billionInternational Organization for Migration.[https://web.archive.org/web/20080611182611/http://www.iom.int/jahia/Jahia/pid/426 \"Lebanon - Facts and Figures\"] Retrieved 13 June 2009. and account for one fifth of the country's economy.Reuters.[https://www.reuters.com/article/2009/06/08/us-lebanon-election-economy-sb-idUSTRE5570SJ20090608 \"FACTBOX: Facts on Lebanon's economy\"] Retrieved 13 June 2009. Nassib Ghobril, the head of research and analysis for Byblos Bank, calculates that Lebanese abroad supply Lebanon with about $1,400 per capita every year.\n\nInvestment\n\nThe stock market capitalisation of listed companies in Lebanon was valued at $10.858 billion in 2007 by the World Bank.\n\nLebanon was unable to attract significant foreign aid to help it rebuild from both the long civil war (1975–89) and the Israeli occupation of the south (1978–2000). In addition, the delicate social balance and the near- dissolution of central government institutions during the civil war handicapped the state as it sought to capture revenues to fund the recovery effort. Thus it accumulated significant debt, which by 2001 had reached $28 billion, or nearly 150% of GDP. Unfortunately, economic performance was sluggish in 2000 and 2001 (zero growth in 2000, and estimates between 1.0-1.4% in 2001, largely attributed to slight increases in tourism, banking, industry, and construction). Unemployment is estimated at 14% for 2000 and 29% among the 15-24 year age group, with preliminary estimates of further increases in 2001. However, fortunately, many Lebanese expatriates have been able to return to the country due to the negative financial situations they are facing abroad, due to the global economic crisis. Also, more job opportunities are attracting more Lebanese youths for a chance to return and work in Lebanon, and also a benefit for the Lebanese living in the country, graduating from universities.\n\nReforms\n\nLebanon's current program of reforms focuses on three main pillars:\n\n* Economic revival and sustainable growth, with the private sector as the engine of growth;\n* Fiscal consolidation and structural improvement in public sector finances; and\n* Monetary, financial, and price stability.\n\nThe government also has maintained a firm commitment to the Lebanese pound, which has been pegged to the dollar since September 1999. In late 2000, the government substantially reduced customs duties, adopted export promotion schemes for agriculture, decreased social security fees and restrictions on investment in real estate by foreigners, and adopted an open-skies policy, with positive effects on trade in 1991. Nonetheless, the relative appreciation of the Lebanese currency has undermined competitiveness, with merchandise exports falling from 23% of GDP in 1989 to 4% in 2000.\n\nIn 2001, the government turned its focus to fiscal measures, Increasing gasoline taxes, reducing expenditures, and approving a value-added-tax that became effective in February 2002. Slow money growth and dollarization of deposits have hampered the ability of commercial banks to finance the government, leaving more of the burden to the central bank. This monetization of the fiscal deficit has put enormous pressure on central bank reserves, mitigated only slightly with the issuance of new Eurobonds over the past 2 years. The central bank has maintained a stable currency by intervening directly in the market, as well as low inflation, and succeeded in maintaining investors' confidence in debt. It has done so at a cost, however, as international reserves declined by $2.4 billion in 2000 and by $1.6 billion in the first half of 2001.\n\nFor 2002, the government has put primary emphasis on privatization, initially in the telecom sector and electricity, with continued planning for sales of the state airline, Beirut port, and water utilities. The government has pledged to apply the proceeds of sales to reducing the public debt and the budget deficit. In addition, it projects that privatization will bring new savings as government payrolls are pared, interest rates decline, and private sector growth and foreign investment are stimulated. The government also is tackling the daunting task of administrative reform, aiming to bring in qualified technocrats to address ambitious economic programs, and reviewing further savings that can be realized through reforms of the income tax system. The Lebanese Government faces major challenges in order to meet the requirements of a fiscal adjustment program focusing on tax reforms and modernization, expenditure rationalization, privatization, and improved debt management.\n\nThe U.S. enjoys a strong exporter position with Lebanon, generally ranking as Lebanon's fourth-largest source of imported goods. More than 160 offices representing U.S. businesses currently operate in Lebanon. Since the lifting of the passport restriction in 1997 (see below), a number of large U.S. companies have opened branches or regional offices, including Microsoft, American Airlines, Coca-Cola, FedEx, UPS, General Electric, Parsons Brinckerhoff, Cisco Systems, Eli Lilly, Computer Associates and Pepsi Cola. Mexico has also many enterprises run by ethnic Lebanese, such as Carlos Slim's Telmex.\n\nSolidere shares are the most actively traded in the Beirut Stock Exchange. Its share price in the Beirut Stock Exchange has risen sharply in the last year from around US$5.00 in early 2004 to close at US$17.50 on Friday, 23 December 2005.\n\nSalaries of Lebanon\n\nOn 15 October 2011, after various unions, including the teachers union, the general workers union, and others threatened to strike, the minimum wage was raised by 40% (200,000 LBP - $133) to 700,000 LBP ($466). Most unions went ahead with the strike except the general workers union. \n*Wages between minimal wage and 1,200,000 LBP ($800) were increased by 200,000 ($133) to become 700,000 LBP (minimal wage) and 1,400,000 LBP ($933) respectively.\n*Wages more than 1,200,000 LBP up to 1,700,000 LBP ($1133) were increased by 300,000L.P ($200) to become 1,500,000 LBP ($1000) and 2,000,000 LBP ($1333).\n*Wages above 1,800,000 LBP ($1200) were not increased.\nThe increase in wages was welcomed by most Lebanese but it also sparked criticism by many some workers unions, saying that the increases were not up to expectations especially that employees earning more that $1200 were not entitled to raises. Others criticized the raises altogether citing that it would burden small business that might end up closing altogether, those critics were mainly opposition politicians.\n\nAs of 2013 World Bank analysis of Quality Life Index, it was estimated that: \n* 15% of the Lebanese people lives below poverty line ($2,500)\n* 54% of the Lebanese people lives in the moderate middle class ($9,000) annually.  12% from 1998\n* 32% of the Lebanese people lives in the upper middle class ($15,000 - $27,000) annually.  19% from 1998\n* 7%  of the Lebanese people lives in the highest upper class rich ($30,000 and above) annually  1% from 1998",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Economy of Lebanon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17776" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The economy of Lebanon is a developing economy, with a private sector that contributes to 75% of aggregate demand and a large banking sector that supports this demand. The IMF forecast a growth of 7% for Lebanon's real GDP in 2010 and 2011 following 9% growth in 2009 and 8.5% in 2008. It has the 54th richest GDP per capita in the world, and it was forecasted that Lebanon's GDP per capita would reach $20,000 by 2015, making it one of the strongest economies in the region. However, the Lebanese economy was badly affected by the Syrian civil war. The institute of international finance forecasted GDP growth of only 0.7% for 2013. Lebanon also suffers from a very high degree of public debt, the third-highest in the world in terms of the ratio of debt-to-GDP. As a consequence, interest payments consumed 48% of government revenues in 2016, thus limiting the government’s ability to make needed investments in infrastructure and other public goods.\n\nThe major industrial sectors include metal products, banking, agriculture, chemicals, and transport equipment. Lebanon has a competitive and free market regime and a strong laissez-faire commercial tradition. The Lebanese economy is service-oriented; main growth sectors include banking and tourism. There are no restrictions on foreign exchange or capital movement.\n\nMacro-economic trend\n\nThis is a chart of trend of gross domestic product of Lebanon at market prices estimated by the International Monetary Fund with figures in millions of Lebanese Pounds. \n\nFor purchasing power parity comparisons, the US Dollar is exchanged at 1,403.29 Lebanese Pounds only. Mean wages were $8.95 per man-hour in 2009.\n\nHistory \n\nThe 1975-90 Lebanese civil war seriously damaged Lebanon's economic infrastructure, cut national output by half, and had major consequences for Lebanon's position as a Middle Eastern entrepot and banking hub. After the war, the central government regained its ability to collect taxes and control over key port and government facilities. As a result, GDP per capita expanded 353% in the 1990s. \nEconomic recovery has been helped by a financially sound banking system and resilient small- and medium-scale manufacturers, with family remittances, banking services, manufactured and farm exports, and international aid as the main sources of foreign exchange. Lebanon's economy has made impressive gains since the launch of \"Horizon 2000,\" the government's $20 billion reconstruction program in 1993. Real GDP grew 8% in 1994 and 7% in 1995 before Israel's Operation Grapes of Wrath in April 1996 stunted economic activity. Real GDP grew at an average annual rate of less than 3% per year for 1997 and 1998 and only 1% in 1999. During 1992-98, annual inflation fell from more than 100% to 5%, and foreign exchange reserves jumped to more than $6 billion from $1.4 billion. Burgeoning capital inflows have generated foreign payments surpluses, and the Lebanese pound has remained relatively stable. Progress also has been made in rebuilding Lebanon's war-torn physical and financial infrastructure. Solidere, a $2-billion firm, is managing the reconstruction of Beirut's central business district; the stock market reopened in January 1996, and international banks and insurance companies are returning. The government nonetheless faces serious challenges in the economic arena. It has had to fund reconstruction by tapping foreign exchange reserves and boosting borrowing. Reducing the government budget deficit is a major goal of the current government. The gap between rich and poor grew in the 1990s, resulting in popular dissatisfaction over the skewed distribution of the reconstruction's benefits and leading the government to shift its focus from rebuilding infrastructure to improving living conditions.\n\nAfter the end of the civil war, Lebanon enjoyed considerable stability, Beirut's reconstruction was almost complete, and increasing numbers of tourists poured into the nation's resorts. The economy witnessed growth, with bank assets reaching over 75 billion US dollars, Market capitalization was also at an all-time high, estimated at $10.9 billion at the end of the second quarter of 2006. The month-long 2006 war severely damaged Lebanon's economy, especially the tourism sector.\nOver the course of 2008 Lebanon rebuilt its infrastructure mainly in the real estate and tourism sectors, resulting in a comparatively robust post war economy. Major contributors to the reconstruction of Lebanon include Saudi Arabia (with US$1.5 billion pledged), the European Union (with about $1 billion) and a few other Persian Gulf countries with contributions of up to $800 million.\n\nGiven the frequent security turmoil it has faced, the Lebanese banking system has adopted a conservative approach, with strict regulations imposed by the central bank to protect the economy from political instability. These regulations have generally left Lebanese banks unscathed by the Financial crisis of 2007–2010. Lebanese banks remain, under the current circumstances, high on liquidity and reputed for their security. In late 2008, Moody's shifted Lebanon's sovereign rankings from stable to positive, acknowledging its financial security. Moreover, with an increase of 51% in the Beirut stock market, the index provider MSCI ranked Lebanon the world's best performer in 2008. Lebanon is one of the only seven countries in the world in which the value of the stock market increased in 2008. The Lebanese economy experienced continued resilience, growing 8.5 percent in 2008, 7 percent in 2009 and 8.8% in 2010. However, Lebanon's debt to GDP ratio remained one of the highest in the world.\n\nThe International Monetary Fund issued a second report on Lebanon in October 2015, where its expectations of the economic growth rate were lowered to 2%, compared to the 2.5% growth rate of the first report, released in April 2015.\n\nExternal trade\n\nLebanon has a competitive and free market regime and a strong laissez-faire commercial tradition. The Lebanese economy is service-oriented; main growth sectors include banking and tourism. There are no restrictions on foreign exchange or capital movement, and bank secrecy is strictly enforced. Lebanon has recently adopted a law to combat money laundering. There are practically no restrictions on foreign investment. There are no country-specific U.S. trade sanctions against Lebanon.\n\nRemittances\n\nLebanon benefits from its large, cohesive, and entrepreneurial diaspora.Global Investment House.[https://web.archive.org/web/20080611182611/http://www.iom.int/jahia/Jahia/pid/426 Lebanon Economic and Strategic Outlook (Nov 2008)] Retrieved 28 June 2009. Over the course of time, emigration has yielded Lebanese \"commercial networks\" throughout the world.Background Note: Lebanon [https://web.archive.org/web/20051016135629/http://www.washingtoninstitute.org/documents/41e1aa0d7d676.pdf \"www.washingtoninstitute.org\"]. Retrieved 3 December 2006. As a result, remittances from Lebanese abroad to family members within the country total $8.2 billionInternational Organization for Migration.[https://web.archive.org/web/20080611182611/http://www.iom.int/jahia/Jahia/pid/426 \"Lebanon - Facts and Figures\"] Retrieved 13 June 2009. and account for one fifth of the country's economy.Reuters.[https://www.reuters.com/article/2009/06/08/us-lebanon-election-economy-sb-idUSTRE5570SJ20090608 \"FACTBOX: Facts on Lebanon's economy\"] Retrieved 13 June 2009. Nassib Ghobril, the head of research and analysis for Byblos Bank, calculates that Lebanese abroad supply Lebanon with about $1,400 per capita every year.\n\nInvestment\n\nThe stock market capitalisation of listed companies in Lebanon was valued at $10.858 billion in 2007 by the World Bank.\n\nLebanon was unable to attract significant foreign aid to help it rebuild from both the long civil war (1975–89) and the Israeli occupation of the south (1978–2000). In addition, the delicate social balance and the near- dissolution of central government institutions during the civil war handicapped the state as it sought to capture revenues to fund the recovery effort. Thus it accumulated significant debt, which by 2001 had reached $28 billion, or nearly 150% of GDP. Unfortunately, economic performance was sluggish in 2000 and 2001 (zero growth in 2000, and estimates between 1.0-1.4% in 2001, largely attributed to slight increases in tourism, banking, industry, and construction). Unemployment is estimated at 14% for 2000 and 29% among the 15-24 year age group, with preliminary estimates of further increases in 2001. However, fortunately, many Lebanese expatriates have been able to return to the country due to the negative financial situations they are facing abroad, due to the global economic crisis. Also, more job opportunities are attracting more Lebanese youths for a chance to return and work in Lebanon, and also a benefit for the Lebanese living in the country, graduating from universities.\n\nReforms\n\nLebanon's current program of reforms focuses on three main pillars:\n\n* Economic revival and sustainable growth, with the private sector as the engine of growth;\n* Fiscal consolidation and structural improvement in public sector finances; and\n* Monetary, financial, and price stability.\n\nThe government also has maintained a firm commitment to the Lebanese pound, which has been pegged to the dollar since September 1999. In late 2000, the government substantially reduced customs duties, adopted export promotion schemes for agriculture, decreased social security fees and restrictions on investment in real estate by foreigners, and adopted an open-skies policy, with positive effects on trade in 1991. Nonetheless, the relative appreciation of the Lebanese currency has undermined competitiveness, with merchandise exports falling from 23% of GDP in 1989 to 4% in 2000.\n\nIn 2001, the government turned its focus to fiscal measures, Increasing gasoline taxes, reducing expenditures, and approving a value-added-tax that became effective in February 2002. Slow money growth and dollarization of deposits have hampered the ability of commercial banks to finance the government, leaving more of the burden to the central bank. This monetization of the fiscal deficit has put enormous pressure on central bank reserves, mitigated only slightly with the issuance of new Eurobonds over the past 2 years. The central bank has maintained a stable currency by intervening directly in the market, as well as low inflation, and succeeded in maintaining investors' confidence in debt. It has done so at a cost, however, as international reserves declined by $2.4 billion in 2000 and by $1.6 billion in the first half of 2001.\n\nFor 2002, the government has put primary emphasis on privatization, initially in the telecom sector and electricity, with continued planning for sales of the state airline, Beirut port, and water utilities. The government has pledged to apply the proceeds of sales to reducing the public debt and the budget deficit. In addition, it projects that privatization will bring new savings as government payrolls are pared, interest rates decline, and private sector growth and foreign investment are stimulated. The government also is tackling the daunting task of administrative reform, aiming to bring in qualified technocrats to address ambitious economic programs, and reviewing further savings that can be realized through reforms of the income tax system. The Lebanese Government faces major challenges in order to meet the requirements of a fiscal adjustment program focusing on tax reforms and modernization, expenditure rationalization, privatization, and improved debt management.\n\nThe U.S. enjoys a strong exporter position with Lebanon, generally ranking as Lebanon's fourth-largest source of imported goods. More than 160 offices representing U.S. businesses currently operate in Lebanon. Since the lifting of the passport restriction in 1997 (see below), a number of large U.S. companies have opened branches or regional offices, including Microsoft, American Airlines, Coca-Cola, FedEx, UPS, General Electric, Parsons Brinckerhoff, Cisco Systems, Eli Lilly, Computer Associates and Pepsi Cola. Mexico has also many enterprises run by ethnic Lebanese, such as Carlos Slim's Telmex.\n\nSolidere shares are the most actively traded in the Beirut Stock Exchange. Its share price in the Beirut Stock Exchange has risen sharply in the last year from around US$5.00 in early 2004 to close at US$17.50 on Friday, 23 December 2005.\n\nSalaries of Lebanon\n\nOn 15 October 2011, after various unions, including the teachers union, the general workers union, and others threatened to strike, the minimum wage was raised by 40% (200,000 LBP - $133) to 700,000 LBP ($466). Most unions went ahead with the strike except the general workers union. \n*Wages between minimal wage and 1,200,000 LBP ($800) were increased by 200,000 ($133) to become 700,000 LBP (minimal wage) and 1,400,000 LBP ($933) respectively.\n*Wages more than 1,200,000 LBP up to 1,700,000 LBP ($1133) were increased by 300,000L.P ($200) to become 1,500,000 LBP ($1000) and 2,000,000 LBP ($1333).\n*Wages above 1,800,000 LBP ($1200) were not increased.\nThe increase in wages was welcomed by most Lebanese but it also sparked criticism by many some workers unions, saying that the increases were not up to expectations especially that employees earning more that $1200 were not entitled to raises. Others criticized the raises altogether citing that it would burden small business that might end up closing altogether, those critics were mainly opposition politicians.\n\nAs of 2013 World Bank analysis of Quality Life Index, it was estimated that: \n* 15% of the Lebanese people lives below poverty line ($2,500)\n* 54% of the Lebanese people lives in the moderate middle class ($9,000) annually.  12% from 1998\n* 32% of the Lebanese people lives in the upper middle class ($15,000 - $27,000) annually.  19% from 1998\n* 7%  of the Lebanese people lives in the highest upper class rich ($30,000 and above) annually  1% from 1998. Economy of Lebanon. http://en.wikipedia.org/?curid=17776."
  }
}
