{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13519",
  "eid" : "0a54b520-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778526578,
  "textBody" : "The Huns were a nomadic people who lived in Eastern Europe, the Caucasus, and Central Asia between the 4th century AD and the 6th century AD. According to European tradition, they were first reported living east of the Volga River, in an area that was part of Scythia at the time; the Huns' arrival is associated with the migration westward of a Scythian people, the Alans. By 370 AD, the Huns had arrived on the Volga, and by 430 the Huns had established a vast, if short-lived, dominion in Europe.\n\nIn the 18th century, the French scholar Joseph de Guignes became the first to propose a link between the Huns and the Xiongnu people, who were northern neighbours of China in the 3rd century BC. Since Guignes' time, considerable scholarly effort has been devoted to investigating such a connection. However, there is no scholarly consensus on a direct connection between the dominant element of the Xiongnu and that of the Huns. Priscus, a 5th-century Roman diplomat and Greek historian, mentions that the Huns had a language of their own; little of it has survived and its relationships have mainly been considered the Turkic or Mongolic languages. Numerous other ethnic groups were included under Attila the Hun's rule, including very many speakers of Gothic, which some modern scholars describe as a lingua franca of the Empire. Their main military technique was mounted archery.\n\nThe Huns may have stimulated the Great Migration, a contributing factor in the collapse of the Western Roman Empire.\"However, the seed and origin of all the ruin and various disasters that the wrath of Mars aroused ... we have found to be (the invasions of the Huns)\". Ammianus 1922, XXXI, ch. 2 They formed a unified empire under Attila the Hun, who died in 453; after a defeat at the Battle of Nedao their empire would quickly disintegrate over the next 15 years. Their descendants, or successors with similar names, are recorded by neighbouring populations to the south, east and west as having occupied parts of Eastern Europe and Central Asia approximately from the 4th century to the 6th century. Variants of the Hun name are recorded in the Caucasus until the early 8th century.\n\nOrigin \n\nThe Huns were \"a confederation of warrior bands\", ready to integrate other groups to increase their military power, in the Eurasian Steppe in the 4th to . Most aspects of their ethnogenesis (including their language and their links to other peoples of the steppes) are uncertain. Walter Pohl explicitly states: \"All we can say safely is that the name Huns, in late antiquity, described prestigious ruling groups of steppe warriors.\"\n\nThe Roman historian Ammianus Marcellinus, who completed his work of the history of the Roman Empire in the early 390s, recorded that the \"people of the  dwell beyond the Sea of Azov near the frozen ocean\".Ammianus Marcellinus: The Later Roman Empire (31.2.), p. 411. Jerome associated them with the Scythians  in a letter, written four years after the Huns invaded the empire's eastern provinces in 395. The equation of the Huns with the Scythians, together with a general fear of the coming of the Antichrist in the late , gave rise to their identification with Gog and Magog (whom Alexander the Great had shut off behind inaccessible mountains, according to a popular legend). This demonization of the Huns is also reflected in Jordanes's Getica, written in the , which portrayed them as a people descending from \"unclean spirits\"The Gothic History of Jordanes (24:121), p. 85. and expelled Gothic witches.\n\nThe 6th-century Roman historian Procopius of Caesarea (Book I. ch. 3), related the Huns of Europe with the Hephthalites or \"White Huns\" who subjugated the Sassanids and invaded northwestern India, stating that they were of the same stock, \"in fact as well as in name\", although he contrasted the Huns with the Hephthalites, in that the Hephthalites were sedentary, white-skinned, and possessed \"not ugly\" features:Procopius of Caesarea: Tyranny, History, and Philosophy at the End of Antiquity, Anthony Kaldellis, University of Pennsylvania Press, 2012, [https://books.google.com/books?idAg0mUQiLb7kC&pg\nPA70 p.70]Staying Roman: Conquest and Identity in Africa and the Mediterranean, 439–700, Jonathan Conant\nCambridge University Press, 2012 [https://books.google.com/books?idwJEgAwAAQBAJ&pg\nPA259 p.259]\n\nSince Joseph de Guignes in the , modern historians have associated the Huns who appeared on the borders of Europe in the  with the Xiongnu (\"howling slaves\") who had invaded China from the territory of present-day Mongolia between the  and the . Due to the devastating defeat by the Chinese Han dynasty, the northern branch of the Xiongnu had retreated north-westward; their descendants may have migrated through Eurasia and consequently they may have some degree of cultural and genetic continuity with the Huns. Otto J. Maenchen-Helfen was the first to challenge the traditional approach, based primarily on the study of written sources, and to emphasize the importance of archaeological research. Thereafter the identification of the Xiongnu as the Huns' ancestors became controversial among some.\n\nThe similarity of their ethnonyms is one of the most important links between the two peoples. The Buddhist monk Dharmarakṣa, who was an important translator of Indian religious texts in the , applied the word Xiongnu when translating the references to the Huna people into Chinese. According to Zhengzhang Shangfang, Xiongnu was pronounced [hoŋ.naː] in Late Old Chinese, corresponding well to Huna. A Sogdian merchant described the invasion of northern China by the \"Xwn\" people in a letter, written in . Étienne de la Vaissière asserts both documents prove that Huna or Xwn were the \"exact transcriptions\" of the Chinese \"Xiongnu\" name. Christopher P. Atwood rejects that interpretation because of the \"very poor phonological match\" between the three words. For instance, Xiongnu begins with a voiceless velar fricative, Huna with a voiceless glottal fricative; Xiongnu is a two-syllable word, but Xwn only has one syllable. However, Atwood agrees with the overall idenfitication between the two, showing instead that Xwn comes via Chinese transcription of Wēnnàshāh into Bactrian Onnashāh and from there into Sogdian while Sanskrit Huna came via Chinese Huní and Greek Khōnai. He argues it was ultimately transmitted by Baktrian Greek merchants to the Pontic where it became Ounni and Hunni in Roman Greek and Latin. The Chinese Book of Wei contain references to \"the remains of the descendants of the Xiongnu\" who lived in the region of the Altai Mountains in the early . According to De la Vaissière, the Chinese source proves that nomadic groups preserved their Xiongnu identity for centuries after the fall of their empire.\n\nBoth the Xiongnu and Huns used bronze cauldrons, similarly to all peoples of the steppes. Based on the study and categorization of cauldrons from archaeological sites of the Eurasian Steppes, archaeologist Toshio Hayashi concludes that the spread of the cauldrons \"may indicate the route of migration of the Hunnic tribes\" from Mongolia to the northern region of Central Asia in the 2nd or , and from Central Asia towards Europe in the second half of the , which also implies the Huns' association with the Xiongnu. The Huns practised artificial cranial deformation, but there is no evidence of such practice among the Xiongnu. This custom had already been practised in the Eurasian Steppes in the Bronze Age and in the early Iron Age, but it disappeared around . It again started to spread among the local inhabitants of the region of the Talas River and in the Pamir Mountains in the . In addition to the Huns, the custom is also evidenced among the Yuezhi and Alans. The lengthy pony-tail, which was a characteristic of the Xiongnu, was not documented among the Huns.\n\nWhen writing of the relationship between the Xiongnu and Huns, historian Hyun Jin Kim concludes: \"Thus to refer to Hun-Xiongnu links in terms of old racial theories or even ethnic affiliations simply makes a mockery of the actual historical reality of these extensive, multiethnic, polyglot steppe empires\". He also emphasizes that \"the ancestors of the Hunnic core  were part of the Xiongnu Empire and possessed a strong Xiongnu element, and the ruling elite of the  claimed to belong to the political tradition of this imperial entity.\" Taking into account the historical gap between the Chinese reports of the Xiongnu and the European records of the Huns, Peter Heather states: \"Even if we do make some connection between fourth-century Huns and first-century [Xiongnu], therefore, an awful lot of water had passed under an awful lot of bridges during 300 years worth of lost history.\"\n\nHistory\n\nBefore Attila \n\nThe 2nd-century geographer Ptolemy mentioned a people called Chuni (Χοῦνοι or Χουνοί) when listing the peoples of the western region of the Eurasian Steppes. The Chuni lived \"between the Bastarnae and the Roxolani\", according to Ptolemy. Edward Arthur Thompson said, the similarity between the two ethnonyms (Chuni and Huns) is only a coincidence: Western Roman authors often wrote Chunni or Chuni in reference to the Huns; East Romans never used the guttural Voiceless velar fricative|\"[x]\" at the beginning of their name. Maenchen-Helfen and Denis Sinor also dispute the association of the Chuni with Attila's Huns. However, Maenchen-Helfen proposes that Ammianus Marcellinus referred to Ptolemy's report of the Chuni when stating that the Huns \"are mentioned only cursorily in ancient writers\". He does not exclude either that the Urugundi who invaded the Roman Empire from the steppes to the north of the Lower Danube in , according to Zosimus, were identical with the Vurugundi, whom Agathias listed among the Hunnic tribes.\n\nThe Romans became aware of the Huns when the Hunnic invasion of the Pontic steppes forced thousands of Goths to move to the Lower Danube to seek refuge in the Roman Empire in 376, according to the contemporaneous Ammianus Marcellinus. Their sudden appearance in the written sources suggests that the Huns crossed the Volga River from the east not much earlier. They invaded the land of the Alans, which was located to the east of the Don River, slaughtering many of them and forcing the survivors to submit themselves to them or to flee across the Don. The reasons for the Huns' sudden attack on the neighboring peoples are unknown. After rejecting several possible reasons (including a climate change in the steppes and the neighboring peoples' pressure), Peter Heather concludes that the Hunnic Empire developed from \"warbands on the make\", launching profitable plundering raids, which enabled them to increase their military power and to impose their authority on the neighboring peoples.\n\nAfter they subjugated the Alans, the Huns and their Alan auxiliaries started plundering the wealthy settlements of the Greuthungi, or eastern Goths, to the west of the Don. The Greuthungic king, Ermanaric, resisted for a while, but finally \"he found release from his fears by taking his own life\",Ammianus Marcellinus: The Later Roman Empire (31.3.), p. 415. according to Ammianus Marcellinus. Marcellinus's report refers either to Ermanaric's suicide or to his ritual sacrifice. His great-nephew, Vithimiris, succeeded him. He hired Huns to fight against the Alans who invaded the Greuthungi's land, but he was killed in a battle.\n\nAfter Vithimiris's death, most Greuthungi submitted themselves to the Huns. Those who decided to resist marched to the Dniester River which was the border between the lands of the Greuthungi and the Thervingi, or western Goths. They were under the command of Alatheus and Saphrax, because Vithimiris's son, Viderichus, was a child. Athanaric, the leader of the Thervingi, met the refugees along the Dniester at the head of his troops. However, a Hunnic army bypassed the Goths and attacked them from the rear, forcing Athanaric to retreat towards the Carpathian Mountains. Athanaric wanted to fortify the borders, but Hunnic raids into the land west of the Dniester continued. Most Thervingi realized that they could not resist the Huns. They went to the Lower Danube, requesting asylum in the Roman Empire. The Greuthingi under the leadership of Alatheus and Saphrax also marched to the river. Most Roman troops had been transferred from the Balkan Peninsula to fight against the Sassanid Empire in Armenia. Emperor Valens permitted the Thervingi to cross the Lower Danube and to settle in the Roman Empire in the autumn of 376. The Thervingi were followed by the Greuthingi, and also by the Taifali and \"other tribes that formerly dwelt with the Goths and Taifali\" to the north of the Lower Danube, according to Zosimus. Food shortage and abuse stirred the Goths to revolt in early 377. The ensuing war between the Goths and the Romans lasted for more than five years.\n\nSupport for the Gothic chieftains diminished as refugees headed into Thrace and towards the safety of the Roman garrisons.\n\nAfter these invasions, the Huns begin to be noted as Foederati and mercenaries. As early as 380, a group of Huns was given Foederati status and allowed to settle in Pannonia. Hunnish mercenaries were also seen on several occasions in the succession struggles of the Eastern and Western Roman Empire during the late 4th century. However, it is most likely that these were individual mercenary bands, not a Hunnish kingdom.\n\nIn 395 the Huns began their first large-scale attack on the Eastern Roman Empire.Thompson, E. A. 1948. A History of Attila and the Huns. Oxford University Press. Huns attacked in Thrace, overran Armenia, and pillaged Cappadocia. They entered parts of Syria, threatened Antioch, and swarmed through the province of Euphratesia. The forces of Emperor Theodosius were fully committed in the west so the Huns moved unopposed until the end of 398 when the eunuch Eutropius gathered together a force composed of Romans and Goths and succeeded in restoring peace. It is uncertain though, whether or not Eutropius' forces defeated the Huns or whether the Huns left on their own. There is no record of a notable victory by Eutropius and there is evidence that the Hunnish forces were already leaving the area by the time he gathered his forces.\n\nWhether put to flight by Eutropius, or leaving on their own, the Huns had left the Eastern Roman Empire by 398. After this, the Huns invaded the Sassanid Empire. This invasion was initially successful, coming close to the capital of the empire at Ctesiphon; however, they were defeated badly during the Persian counterattack and retreated toward the Caucasus Mountains via the Derbend Pass.\n\nDuring their brief diversion from the Eastern Roman Empire, the Huns appear to have threatened tribes further west, as evidenced by Radagaisus' entering Italy at the end of 405 and the crossing of the Rhine into Gaul by Vandals, Sueves, and Alans in 406. The Huns do not then appear to have been a single force with a single ruler. Many Huns were employed as mercenaries by both East and West Romans and by the Goths. Uldin, the first Hun known by name, headed a group of Huns and Alans fighting against Radagaisus in defense of Italy. Uldin was also known for defeating Gothic rebels giving trouble to the East Romans around the Danube and beheading the Goth Gainas around 400–401. Gainas' head was given to the East Romans for display in Constantinople in an apparent exchange of gifts.\n\nThe East Romans began to feel the pressure from Uldin's Huns again in 408. Uldin crossed the Danube and captured a fortress in Moesia named Castra Martis, which was betrayed from within. Uldin then proceeded to ransack Thrace. The East Romans tried to buy Uldin off, but his sum was too high so they instead bought off Uldin's subordinates. This resulted in many desertions from Uldin's group of Huns.\n\nAlaric's brother-in-law, Athaulf, appears to have had Hun mercenaries in his employ south of the Julian Alps in 409. These were countered by another small band of Huns hired by Honorius' minister Olympius. Later in 409, the West Romans stationed ten thousand Huns in Italy and Dalmatia to fend off Alaric, who then abandoned plans to march on Rome.\n\nUnder Attila and Bleda \n\nFrom 434 the brothers Attila and Bleda ruled the Huns together. Attila and Bleda were as ambitious as their uncle Rugila. In 435 they forced the Eastern Roman Empire to sign the Treaty of Margus, giving the Huns trade rights and an annual tribute from the Romans. The Romans also agreed to give up Hunnic refugees (individuals who could have threatened the brothers' grip on power) for execution. With their southern border protected by the terms of this treaty, the Huns could turn their full attention to the further subjugation of tribes to the west.\n\nWhen the Romans breached the treaty in 440, Attila and Bleda attacked Castra Constantias, a Roman fortress and marketplace on the banks of the Danube. The Eastern Romans stopped delivery of the agreed tribute, and they broke other conditions of the Treaty of Margus. The Hunnic kings turned their attention back to the Eastern Romans. Reports that the Bishop of Margus had crossed into Hun lands and desecrated royal graves further angered the Hun kings. War broke out between the two empires, and the Huns overcame a weak Roman army to raze the cities of Margus, Singidunum and Viminacium. Although a truce was signed in 441, two years later Constantinople again failed to deliver the tribute and war resumed. In the following campaign, Hun armies came alarmingly close to Constantinople, sacking Sardica, Arcadiopolis and Philippopolis along the way. Suffering a complete defeat at the Battle of Chersonesus, the Eastern Roman Emperor Theodosius II gave in to Hun demands and in autumn 443 signed the Peace of Anatolius with the two Hun kings. The Huns returned to their lands with a vast train full of plunder.\n\nUnified Empire under Attila \n\nBleda died in 445, with some historians speculating that his death was at the hands of Attila. With his brother gone, Attila was able to establish undisputed control over his subjects. In 447, Attila turned the Huns back toward the Eastern Roman Empire once more. His invasion of the Balkans and Thrace was devastating. The Eastern Roman Empire was already beset by internal problems, such as famine and plague, as well as riots and a series of earthquakes in Constantinople itself. A last-minute rebuilding of its walls preserved Constantinople unscathed. Victory over a Roman army left the Huns virtually unchallenged in Eastern Roman lands and they raided as far south as Thermopylae. Only disease forced them to retreat, and the war came to an end in 449 with an agreement in which the Romans agreed to pay Attila an annual tribute of 2100 pounds of gold. Our only first-hand account of conditions among the Huns and of Attila himself is by Priscus, an official in the peace embassy to Attila.\n\nThroughout their raids on the Eastern Roman Empire, the Huns had maintained good relations with the Western Empire, and in particular with Flavius Aetius, a powerful Roman general (sometimes even referred to as the de facto ruler of the Western Empire) who in his youth had spent time as a hostage with the Huns. However, this all changed in 450 when Honoria, sister of the Western Roman Emperor Valentinian III, sent Attila a ring and requested his help to escape her betrothal to a senator. Attila claimed her as his bride and half the Western Roman Empire as dowry. Additionally, a dispute arose between Attila and Aetius about the rightful heir to a king of the Salian Franks. Finally, Attila's ability to distribute treasure to favoured followers was an important support to his power, and the repeated extortion from the Eastern Roman Empire had left it with little to plunder.\n\nIn 451, Attila's forces entered Gaul, accumulating contingents from the Franks, Goths and Burgundian tribes en route. Once in Gaul, the Huns first attacked Metz, then his armies continued westwards, passing both Paris and Troyes to lay siege to Orléans.\n\nAetius was given the duty of relieving Orléans by Emperor Valentinian III. Bolstered by Frankish and Visigothic troops (under King Theodoric), Aetius' own Roman army met the Huns at the Battle of the Catalaunian Plains. Although a tactical defeat for Attila, thwarting his invasion of Gaul and forcing his retreat back to non-Roman lands, the macrohistorical significance of the allied and Roman victory is a matter of debate.Creasy, Edward Shepherd: The Fifteen Decisive Battles of the World.Norwich, Byzantium: the Early Centuries. 1997, p. 158.Bury, The Later Roman Empire, pp. 294f.\n\nThe following year, Attila renewed his claims to Honoria and territory in the Western Roman Empire. Leading his horde across the Alps and into Northern Italy, he sacked and razed the cities of Aquileia, Vicetia, Verona, Brixia, Bergamum and Milan. Hoping to avoid the sack of Rome, Emperor Valentinian III sent three envoys, the high civilian officers Gennadius Avienus and Trigetius, as well as Pope Leo I, who met Attila at Mincio in the vicinity of Mantua, and obtained from him the promise that he would withdraw from Italy and negotiate peace with the emperor. Prosper of Aquitaine describes the historic meeting, giving all the credit of the successful negotiation to Leo. Priscus reports that superstitious fear of the fate of Alaric—who died shortly after sacking Rome in 410—gave him pause. More practically, Italy had suffered from a terrible famine in 451 and her crops were faring little better in 452; Attila's invasion of the plains of Northern Italy this year did not improve the harvest. To advance on Rome would have required supplies which were not available in Italy, and taking the city would not have improved Attila's supply situation. Secondly, an East Roman force had crossed the Danube and defeated the Huns who had been left behind by Attila to safeguard their home territories. Attila, hence, faced heavy human and natural pressures to retire from Italy before moving south of the Po. Attila retreated without Honoria or her dowry.\n\nThe new Eastern Roman Emperor Marcian then halted tribute payments. From the Pannonian Basin, Attila planned to attack Constantinople. However, in 453 he married a girl with the Germanic name Ildico, and died of a haemorrhage on his wedding night.\n\nAfter Attila \n\nAfter Attila's death in 453, the Hunnic Empire faced an internal power struggle between its vassalized Germanic peoples and the Hunnic ruling body. Led by Ellak, Attila's favored son and ruler of the Akatziri, the Huns engaged the Gepid king Ardaric at the Battle of Nedao, who led a coalition of Germanic Peoples to overthrow Hunnic imperial authority. The Amali Goths would revolt the same year under Valamir, allegedly defeating the Huns in a separate engagement. However, this did not result in the complete collapse of Hunnic power in the Carpathian region, but did result in the loss of many of their Germanic vassals. At the same time, the Huns were also dealing with the arrival of more Oghur Turkic-speaking peoples from the East, including the Oghurs, Saragurs, Onogurs, and the Sabirs. In 463, the Saragurs defeated the Akatziri, or Akatir Huns, and asserted dominance in the Pontic region.\n\nIn 458 some Huns served under Tudila in Majorian's army, probably belonging to a group settled under Emnetzur and Ultzindur in Dacia Ripensis. The western Huns under Dengzich were experiencing difficulties in 461, when they were defeated by Valamir in a war against the Sadages, a people allied with the Huns. His campaigning was also met with dissatisfaction from Ernak, ruler of the Akatziri Huns, who wanted to focus on the incoming Oghur speaking peoples. In 465–466, Ernak and Dengzich sent ambassadors to Constantinople requesting a peace treaty, and asking to establish a market for the exchange of needed provisions. However these requests were rejected, and Dengzich attacked the Romans in 467, without the assistance of Ernak. He was surrounded by the Romans and besieged, and came to an agreement that they would surrender if they were given land and his starving forces given food. During the negotiations, a Hun in service of the Romans named Chelchel persuaded the enemy Goths to attack their Hun overlords. The Romans, under their General Aspar and with the help of his bucellarii, then attacked the quarreling Goths and Huns, defeating them.\n\nIn 469, Anagastes, the son of Arnegisclus who was slain by Attila, brought Dengzich's head and paraded it through the streets before mounting it on a stake in the Hippodrome. Some Historians, like John Man, accept this date as the end of the Hunnic Empire. However others, such as Kim, argue it continued under Ernak who absorbed the incoming Oghur speakers. These people were similar to the Huns and Attila's empire continued as the Kutrigur and Utigur Hunno-Bulgars. This conclusion is still subject to some controversy.\n\nSociety and culture \n\nAppearance \n\nAs the Huns were illiterate and thus kept no records, all surviving accounts were written by enemies of the Huns, and none describe the Huns as attractive either morally or in appearance. Jordanes, a Goth writing in Italy in 551, a century after the collapse of the Hunnic Empire, describes the Huns as a \"savage race, which dwelt at first in the swamps, a stunted, foul and puny tribe, scarcely human and having no language save one which bore but slight resemblance to human speech.\" Jordanes goes on to write:They made their foes flee in horror because their swarthy aspect was fearful, and they had, if I may call it so, a sort of shapeless lump, not a head, with pin-holes rather than eyes. Their hardihood is evident in their wild appearance, and they are beings who are cruel to their children on the very day they are born. For they cut the cheeks of the males with a sword, so that before they receive the nourishment of milk they must learn to endure wounds. Hence they grow old beardless and their young men are without comeliness, because a face furrowed by the sword spoils by its scars the natural beauty of a beard. They are short in stature, quick in bodily movement, alert horsemen, broad shouldered, ready in the use of bow and arrow, and have firm-set necks which are ever erect in pride. Though they live in the form of men, they have the cruelty of wild beasts.Jordanes also recounted how Priscus had described Attila the Hun, the Emperor of the Huns from 434–453, as: \"Short of stature, with a broad chest and a large head; his eyes were small, his beard thin and sprinkled with grey; and he had a flat nose and tanned skin, showing evidence of his origin.\"\n\nIn forming their view of Attila's people, the Romans tapped into attitudes inherited from the Greeks. These were the vilest creatures imaginable. They came from the North and everyone knew that the colder the climate was, the more barbaric the people were.Attila The Hun, by John Man, Bantam Books, 2005, p.79 They knew nothing of metal, had no religion and lived like savages, without fire, eating their food raw, living off roots, and meat tenderized by placing it under their horses' saddles. They had no buildings, not so much as a reed hut, indeed, they feared the very idea of venturing under a roof.\n\nThe description of Huns given by the Romans has prompted some historians to believe they were of East Asian origin. Denis Sinor, noting the paucity of anthropological evidence, wrote that \"there is no reason to question the basic accuracy of the western descriptions, and the absence of massive supporting evidence by physical anthropology cannot weaken the point they so tellingly make. It is the unusual that most attracts attention.\" However, Austrian traveler Maenchen-Helfen wrote in the 20th century: Ammianus' description begins with a strange misunderstanding ... This was repeated by Claudian and Sidonius and reinterpreted by Cassiodorus. Ammianus' explanation of the thin beards is wrong. Like so many other people, the Huns inflicted wounds on their live flesh as a sign of grief when their kinsmen were dying.\n\nArtificial cranial deformation \n\nArtificial cranial deformation was practiced by the Huns and sometimes by tribes under their influence.Bachrach, Bernard S., A history of the Alans in the West: from their first appearance in the sources of classical antiquity through the early Middle Ages, U of Minnesota Press (1973), pp. 67–69 Artificial cranial deformation of the circular type can be used to trace the route that the Huns took from north China to the Central Asian steppes and subsequently to the southern Russian steppes. The people who practiced annular type artificial cranial deformation in Central Asia were Yuezhi/Kushans.\"The Kushan civilization\", Buddha Rashmi Mani, page 5: \"A particular intra-cranial investigation relates to an annular artificial head deformation (macrocephalic), evident on the skulls of diverse racial groups being a characteristic feature traceable on several figures of Kushan kings on coins.\", https://books.google.bg/books?id\nJ_YtAAAAMAAJ&qkushan+deformation&dq\nkushan+deformation&hlen&sa\nX&redir_esc=y\n\nSome artificially deformed crania from the 5th–6th Century AD have been found in Northeastern Hungary and elsewhere in Western Europe. None of them have any Mongoloid features and all the skulls appear Europoid; these skulls may have belonged to Germanic or other subject groups whose parents wished to elevate their status by following a custom introduced by the Huns.\n\nGovernment \n\nHunnic governmental structure has long been debated. In the past many scholars argued that the Huns did not have a central organization until after they entered Europe. Peter Heather argued the Huns were a disorganized confederation in which leaders acted completely independently and that eventually established a ranking hierarchy, much like Germanic societies.Heather, Peter, “Huns and the End of the Roman Empire in Western Europe” in English Historical Review (1995): 11;  However this has been challenged in recent years. According to Kim, it is now believed that the Huns continued the Xiongnu organization, in which their polity was divided into Left, Right, South, and North, in that order of priority.Kim, The Huns, Rome, and the Birth of Europe, 23, 207 It is also thought that the Huns continued the council of \"six horns/nobles\" that the Xiongnu had under their emperor.Kim, The Huns, Rome, and the Birth of Europe, 58–59, 208 It is unknown what the Hun emperor was called, but the terms Chanyu, Aniliki, Shah, and Yabgu are possible or interchangeable titles for the same position, as they were in use by other contemporary peoples during that period.Atwood, Huns and Xiongnu – New Thoughts on an Old Problem, 33; Kim, The Huns, Rome, and the Birth Of Europe, 31, 59, 206 Likewise, it is suggested that that the Huns continued to use the decimal military organization of the Xiongnu as well.Kim, The Huns, Rome, and the Birth of Europe, 59\n\nLanguage \n\nA variety of languages were spoken within the Hun Empire.Blockley, RC 1983. The Fragmentary Classicising Historians of the Later Roman Empire. Liverpool: Francis Cairns; citing Priscus It has been supposed that by the 440s, the \"Huns\" were more Germanic-speaking subject than speakers of Hunnic, and as such Gothic may have been a lingua franca of the Empire. Kim however points out that there is no evidence for the idea that Gothic was a lingua franca. Subjects of the Huns also included Iranian-speaking Alans and Sarmatians. Based on some etymological interpretation of the words strava, medos, and kamos and subsequent historical appearance, the other languages have been taken to include a form of Proto-Slavic language.Walter Pohl. 1999. Huns. Late Antiquity: a guide to the postclassical world, ed. Glen Warren Bowersock, Peter Robert Lamont Brown, Oleg Grabar. Harvard University Press. pp. 501–502Schenker, Alexander. 1995. The Dawn of Slavic: an introduction to Slavic philology. Yale University Press.\n\nPriscus noted that the Hunnic language differed from other languages spoken at Attila's court. He recounts how Zerco made Attila's guests laugh also by the \"promiscuous jumble of words, Latin mixed with Hunnish and Gothic\". Priscus said that Attila's \"Scythian\" subjects spoke \"besides their own barbarian tongues, either Hunnish, or Gothic, or, as many have dealings with the Western Romans, Latin; but not one of them easily speaks Greek, except captives from the Thracian or Illyrian frontier regions\".\n\nThe ancient sources are thus clear that there was a Hunnic language. The literary sources preserve many names, and three Indo-European words (medos, kamos, strava), which have been studied for more than a century and a half. Otto Maenchen-Helfen noted that the thesis suggesting the Huns spoke a Turkic language has a long history behind it. Maenchen-Helfen held that by Turkic origin of Hunnic tribal and proper names, the Huns spoke a Turkic language. Denis Sinor argued that \"at least part of the Hun leadership was Turkic-speaking\".\n\nTraditionally notable studies of proper names chronologically include that of Gyula Németh, Gerhard Doerfer, Maenchen-Helfen, and Omeljan Pritsak. In Pritsak's 1982 study The Hunnic Language of the Attila Clan, he analyzes the 33 survived personal names and concludes: It was not a Turkic language, but one between Turkic and Mongolian, probably closer to the former than the latter. The language had strong ties to Bulgar language and to modern Chuvash, but also had some important connections, especially lexical and morphological, to Ottoman Turkish and Yakut.On the basis of the existing name records, a number of scholars suggest that the Huns spoke a Turkic language of the Oghur branch, which also includes the Bulgar, Khazar and Chuvash languages.Johanson, Lars; Éva Agnes Csató (ed.). 1998. The Turkic languages. Routledge.\"It is assumed that the Huns also were speakers of an l- and r- type Turkic language and that their migration was responsible for the appearance of this language in the West.\" Johanson (1998); cf. Johanson (2000, 2007) and the articles pertaining to the subject in Johanson & Csató (ed., 1998).Victor H. Mair, Contact And Exchange in the Ancient World, 2006, University of Hawaii Press, p.136 Peter Heather called the Huns \"the first group of Turkic, as opposed to Iranian, nomads to have intruded into Europe\".Heather, Peter. 1995. The Huns and the End of the Roman Empire in Western Europe. English Historical Review, 90: 4-41. Many recent scholars agree that Hunnic was related to Turkic and Mongolian languages.\n\nIn 2013, Hyun Jin Kim suggested that \"from the names that we do know, most of which seem to be Turkic... the Hunnic elite was predominantly Turkic-speaking.\" He also suggests that the Xiongnu, who had originally spoken Yeniseian, flipped to Oghur Turkic when they absorbed the Dingling and crossed into Central Asia, like the later Golden Horde and Chagatai Khanate. He noted that, beside Hunnic, people in Attila's court also spoke Gothic and Latin, and that in the western part of the Empire, where subjected Goths lived, people described as Huns probably spoke both the Hunnic and Gothic languages. An example would be the Germanic or Germanized names of noted Huns like Laudaricus.\n\nNevertheless, some scholars still conclude that the Hunnic language cannot presently be classified, and attempts to classify it as Turkic or Mongolic are speculative. Doerfer, Gerhard. Zur Sprache der Hunnen. Central Asiatic Journal, 17(1): 1-50.Sinor, Denis. 1977. The Outlines of Hungarian Prehistory. Journal of World History, 4(3):513–540.Poppe, Nicholas. 1965. Introduction to Altaic linguistics. Wiesbaden: O. Harrassowitz. Ural-altaische Bibliothek; 14.\n\nWarfare \n\nStrategy and tactics \n\nHun warfare as a whole is not well studied, and many scholars as of recent have discounted Ammianus' description of the Huns. This was first pointed out by E.A. Thompson, who stated that the Huns could never have conquered Europe without iron armor and weapons. The only accurate information on Hun warfare comes from the 6th-century Strategikon, which describes the warfare of \"Dealing with the Scythians, that is, Avars, Turks, and others whose way of life resembles that of the Hunnish peoples.\" The Strategikon describes the Avars and Huns as devious and very experienced in military matters. They are described as preferring to defeat their enemies by deceit, surprise attacks, and cutting off supplies. The Huns brought large numbers of horses to use as replacements and to give the impression of a larger army on campaign. The Hunnish peoples did not set up an entrenched camp, but spread out across the grazing fields according to clan, and guard their necessary horses until they began forming the battle line under the cover of early morning. The Strategikon states the Huns also stationed sentries at significant distances and in constant contact with each other in order to prevent surprise attacks.\n\nAccording to the Strategikon, the Huns did not form a battle line in the method that the Romans and Persians used, but in irregularly sized divisions in a single line, and keep a separate force nearby for ambushes and as a reserve. The Strategikon also states the Huns used deep formations with a dense and even front. Otto Maenchen-Helfen states that the Huns likely formed up in divisions according to tribal clans and families which Ammianus calls Cunei, the leader of which was called a Cur and inherited the title as it was passed down through the clan. The Strategikon states that the Huns kept their spare horses and baggage train to either side of the line about a mile away, with a moderate sized guard, and would sometimes tie their spare horses together behind the main battle line. The Huns preferred to fight at long range, utilizing ambush, encirclement, and the feigned retreat. The Strategikon also makes note of the wedge shaped formations mentioned by Ammianus, and corroborated as familial regiments by Maenchen-Helfen.Ammianus Marcellinus, Res Gestae, 31.2.8 The Strategikon states the Huns preferred to pursue their enemies relentlessly after a victory and then wear them out by a long siege after defeat.\n\nMilitary equipment \n\nThe Strategikon states the Huns typically used maille, swords, bows, and lances, and that most Hunnic warriors were armed with both the bow and lance and used them interchangeably as needed. It also states the Huns used quilted linen, wool, or sometimes iron barding for their horses and also wore quilted coifs and kaftans. This assessment is largely corroborated by archaeological finds of Hun military equipment, such as the Volnikovka and Brut Burials.\n\nA late Roman ridge helmet of the Berkasovo-Type was found with a Hun burial at Concesti. A Hunnic helmet of the Segmentehelm type was found at Chudjasky, and another of the Bandhelm type at Turaevo. Fragments of lamellar helmets dating to the Hunnic period and within the Hunnic sphere have been found at Iatrus, Illichevka, and Kalkhni. Hun lamellar armour has not been found in Europe, although two fragments of likely Hun origin have been found on the Upper Ob and in West Kazakhstan dating to the 3rd–4th centuries. An unpublished find at a military warehouse near Toprachioi, Romania is known but it is uncertain if it can be attributed to Hun origin. It is known that the Eurasian Avars introduced Lamellar armor to the Roman Army and Migration Era Germanics in the Middle 6th Century, but this later type does not appear before then.\n\nIt is also widely accepted that the Huns introduced the langseax, a 60 cm cutting blade that became popular among the migration era Germanics and in the Late Roman Army, into Europe. It is believed these blades originated in China and that the Sarmatians and Huns served as a transmission vector, using shorter seaxes in Central Asia that developed into the narrow langseax in Eastern Europe during the late 4th and first half of the 5th century. These earlier blades date as far back as the 1st century AD, with the first of the newer type appearing in Eastern Europe being the Wien-Simmerming example, dated to the late 4th century AD. Other notable Hun examples include the Langseax from the more recent find at Volnikovka in Russia.\n\nThe Huns used a type of spatha in the Iranic or Sassanid style, with a long, straight approximately 83cm blade, usually with a diamond shaped iron guard plate. Swords of this style have been found at sites such as Altlussheim, Szirmabesenyo, Volnikovka, Novo-Ivanovka, and Tsibilium 61. They typically had gold foil hilts, gold sheet scabbards, and scabbard fittings decorated in the polychrome style. The sword was carried in the \"Iranian style\" attached to a swordbelt, rather than on a baldric.\n\nThe most famous weapon of the Huns is the Qum Darya-type composite recurve bow, often called the \"Hunnish Bow\". This bow was invented some time in the 3rd or 2nd centuries BC with the earliest finds near Lake Baikal, but spread across Eurasia long before the Hunnic migration. These bows were typified by being asymmetric in cross-section between 145-155cm in length, having between 4–9 lathes on the grip and in the siyahs. Although whole bows rarely survive in European climatic conditions, finds of bone Siyahs are quite common and characteristic of steppe burials. Complete specimens have been found at sites in the Tarim Basin and Gobi Desert such as Niya, Qum Darya, and Shombuuziin-Belchir. Eurasian nomads such as the Huns typically used trilobate diamond shaped iron arrowheads, attached using birch tar and a tang, with typically 75cm shafts and fletching attached with tar and sinew whipping. Such trilobate arrowheads are believed to be more accurate and have better penetrating power or capacity to injure than flat arrowheads.\n\nLegacy \n\nLegends \n\nChroniclers writing centuries later often mentioned or alluded to Huns or their purported descendants. These include:\n* Theophylact Simocatta\n* Annales Fuldenses\n* Annales Alamannici\n* Annals of Salzburg\n* Liutprand of Cremona's Antapodosis\n* Regino of Prüm's chronicle\n* Widukind of Corvey's Saxon Chronicle\n* Nestor the Chronicler's Primary Chronicle\n* Legends of Saints Cyril and Methodius\n* Aventinus's Chronicon Bavaria\n* Constantine VII's De Administrando Imperio\n* Leo VI the Wise's Tactica\n\nMedieval Hungarians continued this tradition (see Gesta Hunnorum et Hungarorum, Chronicon Pictum, Gesta Hungarorum).\n\nMemory of the Hunnic conquest was transmitted orally among Germanic peoples and is an important component in the Old Norse Völsunga saga and Hervarar saga and in the Middle High German Nibelungenlied. These stories all portray Migration Period events from a millennium earlier.\n\nIn the Hervarar saga, the Goths make first contact with the bow-wielding Huns and meet them in an epic battle on the plains of the Danube.\n\nIn the Nibelungenlied, Kriemhild marries Attila (Etzel in German) after her first husband Siegfried was murdered by Hagen with the complicity of her brother, King Gunther. She then uses her power as Etzel's wife to take a bloody revenge in which not only Hagen and Gunther but all Burgundian knights find their death at festivities to which she and Etzel had invited them.\n\nIn the Völsunga saga, Attila (Atli in Norse) defeats the Frankish king Sigebert I (Sigurðr or Siegfried) and the Burgundian King Guntram (Gunnar or Gunther), but is later assassinated by Queen Fredegund (Gudrun or Kriemhild), the sister of the latter and wife of the former.\n\nIn the German \"Saga of Tidreck of Bern\", its written versions beginning from the 13th century, the Huns are called Frisians. Frisia was often called Hunaland in the Middle Ages.Veselovsky. Russians and veltinas in the Saga of Tidreck of Bern (Verona). Saint-Petersburg, Russia, 1906 in Russian Веселовский \"Русские и вильтины в саге о Тидреке Бернском (Веронском)\" (СПб., 1906)\n\nWidsith, possibly one of the oldest pieces of English literature to survive to the present day, lists a number of ancient kings of tribes sorted according to their popularity and impact; Attila, King of the Huns, comes first, followed immediately by Eormanric of the Ostrogoths. Widsith may be by far the oldest extant work that tells of the Battle of the Goths and Huns, also recounted in later Scandinavian works such as the Hervarar saga;  in Widsith, however, the battle's details are presented as \"sober historical facts\" rather than as the \"heroic stories\" of later works. The name Attila, rendered in Old English as Ætla, was a given name in use in Anglo-Saxon England (ex. Bishop Ætla of Dorchester) and its use in England at the time may have been connected to the heroic kings legend represented in works like Widsith, though historian Otto J. Maenchen-Helfen doubts the use of the name by the Anglo-Saxons had anything to do with the Huns, and argues it was more likely to be based directly on the name's Germanic origin meaning \"little father\".\n\nClaims of Hunnic heritage \n\nThe Hungarians (Magyars) in particular lay claim to Hunnic heritage. Although Magyar tribes only began to settle in the geographical area of present-day Hungary in the very end of the 9th century, over 400 years after the breakup of Attila's Hunnic Empire, Hungarian prehistory includes Magyar origin myths. There is also a medieval legend of a lineage that makes Attila the sixth-generation ancestor of Árpád conqueror of the modern Pannonian basin, through Attila's son Csaba, his son Ed, his son Ügyek, his son Előd, his son Álmos. Álmos was ruler of the Magyars and the father of Arpad. The national anthem of Hungary describes the Hungarians as \"blood of Bendegúz'\" (the medieval and modern Hungarian version of Mundzuk, Attila's father). Attila's brother, Bleda, is called Buda in modern Hungarian and some medieval chronicles and literary works attribute the name of the city of Buda to him.\n\nThere is a legend among the Székely people that claims that after the death of Attila, in a battle called the Battle of Krimhilda, 3000 Hun warriors managed to escape and settle in a place called \"Csigle-mező\" (today Transylvania) and they changed their name from Huns to Szekler (Székely). According to the Hungarian scholar Egyed, the Székelys speak the Hungarian language \"without any trace of a Turkic substratum\", indicating that they did not have a language shift during their history, and proposes that the Székelys were descended from privileged Hungarian groups. They therefore could not have been related to the Huns, who most likely spoke an Oghur Turkic dialect.\n\nIn Book V, Chapter 9 of his Ecclesiastical History of the English People, which was written in Latin, the Anglo-Saxon historian Bede gave a list of peoples that included the Huns. James Campbell notes regarding this passage that though this list of peoples has generally been regarded by historians as being a list of peoples living in Germany at the time Bede wrote this passage in the 8th century, \"the sense of the Latin is that these are the peoples from whom the Anglo-Saxons living in Britain were derived.\" Regarding the inclusion of the Huns among these peoples, he writes that the list of peoples fits the 5th century better, when the Anglo-Saxons began migrating to Britain, than the 8th century, and notes that \"Huns sound odd; it is equally odd that Priscus heard of a boast by Attila that he had authority over the islands in the ocean.\" Leonard Neidorf, however, interprets the passage as being about the ancestors of the Anglo-Saxons, the Angles, Saxons, and Jutes, sharing a common Germanic heritage with the Huns and the other groups Bede listed.\n\n20th-century use in reference to Germans \n\nOn 27 July 1900, during the Boxer Rebellion in China, Kaiser Wilhelm II of Germany gave the order to act ruthlessly towards the rebels: \"Mercy will not be shown, prisoners will not be taken. Just as a thousand years ago, the Huns under Attila won a reputation of might that lives on in legends, so may the name of Germany in China, such that no Chinese will even again dare so much as to look askance at a German.\"Weser-Zeitung, 28 July 1900, second morning edition, p. 1: 'Wie vor tausend Jahren die Hunnen unter ihrem König Etzel sich einen Namen gemacht, der sie noch jetzt in der Überlieferung gewaltig erscheinen läßt, so möge der Name Deutschland in China in einer solchen Weise bekannt werden, daß niemals wieder ein Chinese es wagt, etwa einen Deutschen auch nur schiel anzusehen'.\n\nThe term \"Hun\" from this speech was later used for the Germans by British propaganda during World War I. The comparison was helped by the spiked Pickelhaube helmet worn by German forces until 1916, which would be reminiscent of images depicting ancient Hun helmets. This usage, emphasising the idea that the Germans were barbarians, was reinforced by Allied propaganda throughout the war. The French songwriter Theodore Botrel described the Kaiser as \"an Attila, without remorse\", launching \"cannibal hordes\".\"Quand un Attila, sans remords, / Lance ses hordes cannibales, / Tout est bon qui meurtrit et mord: / Les chansons, aussi, sont des balles!\", from Theodore Botrel, by Edgar Preston T.P.'s Journal of Great Deeds of the Great War, February 27, 1915\n\nThe usage of the term \"Hun\" to describe Germans resurfaced during World War II. For example, Winston Churchill 1941 said in a broadcast speech: \"There are less than 70,000,000 malignant Huns, some of whom are curable and others killable, most of whom are already engaged in holding down Austrians, Czechs, Poles and the many other ancient races they now bully and pillage.\"\nLater that year Churchill referred to the invasion of the Soviet Union as \"the dull, drilled, docile brutish masses of the Hun soldiery, plodding on like a swarm of crawling locusts.\"Churchill, Winston S. 1941. [http://www.ibiblio.org/pha/timeline/410622dwp.html \"WINSTON CHURCHILL'S BROADCAST ON THE SOVIET-GERMAN WAR\", London, June 22, 1941] During this time American President Franklin D. Roosevelt also referred to the German people in this way, saying that an Allied invasion into Southern France would surely \"be successful and of great assistance to Eisenhower in driving the Huns from France.\"Winston Churchill. 1953. \"Triumph and Tragedy\" (volume 6 of The Second World War). Boston: Houghton-Mifflin. Ch. 4, p. 70\n\nSectarian slur in Northern Ireland and Scotland \n\n\"Hun\" is also used as an sectarian slur against Protestants in Scotland and Northern Ireland. In Scotland, the term has been used by fans of Celtic FC in Old Firm derbies against Rangers FC supporters, while Orange Halls in Ulster have been daubed with graffiti reading KAH (\"Kill all Huns\").\n\nA pamphlet issued to PSNI officers in 2008 listed \"Huns\" – along with the terms \"black\", \"prods\" or \"jaffas\" (referring to the Orange Order) for Protestants and \"fenians\", \"taigs\", \"chucks\" or \"spongers\" for Irish Catholics – as terms not to use to avoid causing offence.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Huns" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13519" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Huns were a nomadic people who lived in Eastern Europe, the Caucasus, and Central Asia between the 4th century AD and the 6th century AD. According to European tradition, they were first reported living east of the Volga River, in an area that was part of Scythia at the time; the Huns' arrival is associated with the migration westward of a Scythian people, the Alans. By 370 AD, the Huns had arrived on the Volga, and by 430 the Huns had established a vast, if short-lived, dominion in Europe.\n\nIn the 18th century, the French scholar Joseph de Guignes became the first to propose a link between the Huns and the Xiongnu people, who were northern neighbours of China in the 3rd century BC. Since Guignes' time, considerable scholarly effort has been devoted to investigating such a connection. However, there is no scholarly consensus on a direct connection between the dominant element of the Xiongnu and that of the Huns. Priscus, a 5th-century Roman diplomat and Greek historian, mentions that the Huns had a language of their own; little of it has survived and its relationships have mainly been considered the Turkic or Mongolic languages. Numerous other ethnic groups were included under Attila the Hun's rule, including very many speakers of Gothic, which some modern scholars describe as a lingua franca of the Empire. Their main military technique was mounted archery.\n\nThe Huns may have stimulated the Great Migration, a contributing factor in the collapse of the Western Roman Empire.\"However, the seed and origin of all the ruin and various disasters that the wrath of Mars aroused ... we have found to be (the invasions of the Huns)\". Ammianus 1922, XXXI, ch. 2 They formed a unified empire under Attila the Hun, who died in 453; after a defeat at the Battle of Nedao their empire would quickly disintegrate over the next 15 years. Their descendants, or successors with similar names, are recorded by neighbouring populations to the south, east and west as having occupied parts of Eastern Europe and Central Asia approximately from the 4th century to the 6th century. Variants of the Hun name are recorded in the Caucasus until the early 8th century.\n\nOrigin \n\nThe Huns were \"a confederation of warrior bands\", ready to integrate other groups to increase their military power, in the Eurasian Steppe in the 4th to . Most aspects of their ethnogenesis (including their language and their links to other peoples of the steppes) are uncertain. Walter Pohl explicitly states: \"All we can say safely is that the name Huns, in late antiquity, described prestigious ruling groups of steppe warriors.\"\n\nThe Roman historian Ammianus Marcellinus, who completed his work of the history of the Roman Empire in the early 390s, recorded that the \"people of the  dwell beyond the Sea of Azov near the frozen ocean\".Ammianus Marcellinus: The Later Roman Empire (31.2.), p. 411. Jerome associated them with the Scythians  in a letter, written four years after the Huns invaded the empire's eastern provinces in 395. The equation of the Huns with the Scythians, together with a general fear of the coming of the Antichrist in the late , gave rise to their identification with Gog and Magog (whom Alexander the Great had shut off behind inaccessible mountains, according to a popular legend). This demonization of the Huns is also reflected in Jordanes's Getica, written in the , which portrayed them as a people descending from \"unclean spirits\"The Gothic History of Jordanes (24:121), p. 85. and expelled Gothic witches.\n\nThe 6th-century Roman historian Procopius of Caesarea (Book I. ch. 3), related the Huns of Europe with the Hephthalites or \"White Huns\" who subjugated the Sassanids and invaded northwestern India, stating that they were of the same stock, \"in fact as well as in name\", although he contrasted the Huns with the Hephthalites, in that the Hephthalites were sedentary, white-skinned, and possessed \"not ugly\" features:Procopius of Caesarea: Tyranny, History, and Philosophy at the End of Antiquity, Anthony Kaldellis, University of Pennsylvania Press, 2012, [https://books.google.com/books?idAg0mUQiLb7kC&pg\nPA70 p.70]Staying Roman: Conquest and Identity in Africa and the Mediterranean, 439–700, Jonathan Conant\nCambridge University Press, 2012 [https://books.google.com/books?idwJEgAwAAQBAJ&pg\nPA259 p.259]\n\nSince Joseph de Guignes in the , modern historians have associated the Huns who appeared on the borders of Europe in the  with the Xiongnu (\"howling slaves\") who had invaded China from the territory of present-day Mongolia between the  and the . Due to the devastating defeat by the Chinese Han dynasty, the northern branch of the Xiongnu had retreated north-westward; their descendants may have migrated through Eurasia and consequently they may have some degree of cultural and genetic continuity with the Huns. Otto J. Maenchen-Helfen was the first to challenge the traditional approach, based primarily on the study of written sources, and to emphasize the importance of archaeological research. Thereafter the identification of the Xiongnu as the Huns' ancestors became controversial among some.\n\nThe similarity of their ethnonyms is one of the most important links between the two peoples. The Buddhist monk Dharmarakṣa, who was an important translator of Indian religious texts in the , applied the word Xiongnu when translating the references to the Huna people into Chinese. According to Zhengzhang Shangfang, Xiongnu was pronounced [hoŋ.naː] in Late Old Chinese, corresponding well to Huna. A Sogdian merchant described the invasion of northern China by the \"Xwn\" people in a letter, written in . Étienne de la Vaissière asserts both documents prove that Huna or Xwn were the \"exact transcriptions\" of the Chinese \"Xiongnu\" name. Christopher P. Atwood rejects that interpretation because of the \"very poor phonological match\" between the three words. For instance, Xiongnu begins with a voiceless velar fricative, Huna with a voiceless glottal fricative; Xiongnu is a two-syllable word, but Xwn only has one syllable. However, Atwood agrees with the overall idenfitication between the two, showing instead that Xwn comes via Chinese transcription of Wēnnàshāh into Bactrian Onnashāh and from there into Sogdian while Sanskrit Huna came via Chinese Huní and Greek Khōnai. He argues it was ultimately transmitted by Baktrian Greek merchants to the Pontic where it became Ounni and Hunni in Roman Greek and Latin. The Chinese Book of Wei contain references to \"the remains of the descendants of the Xiongnu\" who lived in the region of the Altai Mountains in the early . According to De la Vaissière, the Chinese source proves that nomadic groups preserved their Xiongnu identity for centuries after the fall of their empire.\n\nBoth the Xiongnu and Huns used bronze cauldrons, similarly to all peoples of the steppes. Based on the study and categorization of cauldrons from archaeological sites of the Eurasian Steppes, archaeologist Toshio Hayashi concludes that the spread of the cauldrons \"may indicate the route of migration of the Hunnic tribes\" from Mongolia to the northern region of Central Asia in the 2nd or , and from Central Asia towards Europe in the second half of the , which also implies the Huns' association with the Xiongnu. The Huns practised artificial cranial deformation, but there is no evidence of such practice among the Xiongnu. This custom had already been practised in the Eurasian Steppes in the Bronze Age and in the early Iron Age, but it disappeared around . It again started to spread among the local inhabitants of the region of the Talas River and in the Pamir Mountains in the . In addition to the Huns, the custom is also evidenced among the Yuezhi and Alans. The lengthy pony-tail, which was a characteristic of the Xiongnu, was not documented among the Huns.\n\nWhen writing of the relationship between the Xiongnu and Huns, historian Hyun Jin Kim concludes: \"Thus to refer to Hun-Xiongnu links in terms of old racial theories or even ethnic affiliations simply makes a mockery of the actual historical reality of these extensive, multiethnic, polyglot steppe empires\". He also emphasizes that \"the ancestors of the Hunnic core  were part of the Xiongnu Empire and possessed a strong Xiongnu element, and the ruling elite of the  claimed to belong to the political tradition of this imperial entity.\" Taking into account the historical gap between the Chinese reports of the Xiongnu and the European records of the Huns, Peter Heather states: \"Even if we do make some connection between fourth-century Huns and first-century [Xiongnu], therefore, an awful lot of water had passed under an awful lot of bridges during 300 years worth of lost history.\"\n\nHistory\n\nBefore Attila \n\nThe 2nd-century geographer Ptolemy mentioned a people called Chuni (Χοῦνοι or Χουνοί) when listing the peoples of the western region of the Eurasian Steppes. The Chuni lived \"between the Bastarnae and the Roxolani\", according to Ptolemy. Edward Arthur Thompson said, the similarity between the two ethnonyms (Chuni and Huns) is only a coincidence: Western Roman authors often wrote Chunni or Chuni in reference to the Huns; East Romans never used the guttural Voiceless velar fricative|\"[x]\" at the beginning of their name. Maenchen-Helfen and Denis Sinor also dispute the association of the Chuni with Attila's Huns. However, Maenchen-Helfen proposes that Ammianus Marcellinus referred to Ptolemy's report of the Chuni when stating that the Huns \"are mentioned only cursorily in ancient writers\". He does not exclude either that the Urugundi who invaded the Roman Empire from the steppes to the north of the Lower Danube in , according to Zosimus, were identical with the Vurugundi, whom Agathias listed among the Hunnic tribes.\n\nThe Romans became aware of the Huns when the Hunnic invasion of the Pontic steppes forced thousands of Goths to move to the Lower Danube to seek refuge in the Roman Empire in 376, according to the contemporaneous Ammianus Marcellinus. Their sudden appearance in the written sources suggests that the Huns crossed the Volga River from the east not much earlier. They invaded the land of the Alans, which was located to the east of the Don River, slaughtering many of them and forcing the survivors to submit themselves to them or to flee across the Don. The reasons for the Huns' sudden attack on the neighboring peoples are unknown. After rejecting several possible reasons (including a climate change in the steppes and the neighboring peoples' pressure), Peter Heather concludes that the Hunnic Empire developed from \"warbands on the make\", launching profitable plundering raids, which enabled them to increase their military power and to impose their authority on the neighboring peoples.\n\nAfter they subjugated the Alans, the Huns and their Alan auxiliaries started plundering the wealthy settlements of the Greuthungi, or eastern Goths, to the west of the Don. The Greuthungic king, Ermanaric, resisted for a while, but finally \"he found release from his fears by taking his own life\",Ammianus Marcellinus: The Later Roman Empire (31.3.), p. 415. according to Ammianus Marcellinus. Marcellinus's report refers either to Ermanaric's suicide or to his ritual sacrifice. His great-nephew, Vithimiris, succeeded him. He hired Huns to fight against the Alans who invaded the Greuthungi's land, but he was killed in a battle.\n\nAfter Vithimiris's death, most Greuthungi submitted themselves to the Huns. Those who decided to resist marched to the Dniester River which was the border between the lands of the Greuthungi and the Thervingi, or western Goths. They were under the command of Alatheus and Saphrax, because Vithimiris's son, Viderichus, was a child. Athanaric, the leader of the Thervingi, met the refugees along the Dniester at the head of his troops. However, a Hunnic army bypassed the Goths and attacked them from the rear, forcing Athanaric to retreat towards the Carpathian Mountains. Athanaric wanted to fortify the borders, but Hunnic raids into the land west of the Dniester continued. Most Thervingi realized that they could not resist the Huns. They went to the Lower Danube, requesting asylum in the Roman Empire. The Greuthingi under the leadership of Alatheus and Saphrax also marched to the river. Most Roman troops had been transferred from the Balkan Peninsula to fight against the Sassanid Empire in Armenia. Emperor Valens permitted the Thervingi to cross the Lower Danube and to settle in the Roman Empire in the autumn of 376. The Thervingi were followed by the Greuthingi, and also by the Taifali and \"other tribes that formerly dwelt with the Goths and Taifali\" to the north of the Lower Danube, according to Zosimus. Food shortage and abuse stirred the Goths to revolt in early 377. The ensuing war between the Goths and the Romans lasted for more than five years.\n\nSupport for the Gothic chieftains diminished as refugees headed into Thrace and towards the safety of the Roman garrisons.\n\nAfter these invasions, the Huns begin to be noted as Foederati and mercenaries. As early as 380, a group of Huns was given Foederati status and allowed to settle in Pannonia. Hunnish mercenaries were also seen on several occasions in the succession struggles of the Eastern and Western Roman Empire during the late 4th century. However, it is most likely that these were individual mercenary bands, not a Hunnish kingdom.\n\nIn 395 the Huns began their first large-scale attack on the Eastern Roman Empire.Thompson, E. A. 1948. A History of Attila and the Huns. Oxford University Press. Huns attacked in Thrace, overran Armenia, and pillaged Cappadocia. They entered parts of Syria, threatened Antioch, and swarmed through the province of Euphratesia. The forces of Emperor Theodosius were fully committed in the west so the Huns moved unopposed until the end of 398 when the eunuch Eutropius gathered together a force composed of Romans and Goths and succeeded in restoring peace. It is uncertain though, whether or not Eutropius' forces defeated the Huns or whether the Huns left on their own. There is no record of a notable victory by Eutropius and there is evidence that the Hunnish forces were already leaving the area by the time he gathered his forces.\n\nWhether put to flight by Eutropius, or leaving on their own, the Huns had left the Eastern Roman Empire by 398. After this, the Huns invaded the Sassanid Empire. This invasion was initially successful, coming close to the capital of the empire at Ctesiphon; however, they were defeated badly during the Persian counterattack and retreated toward the Caucasus Mountains via the Derbend Pass.\n\nDuring their brief diversion from the Eastern Roman Empire, the Huns appear to have threatened tribes further west, as evidenced by Radagaisus' entering Italy at the end of 405 and the crossing of the Rhine into Gaul by Vandals, Sueves, and Alans in 406. The Huns do not then appear to have been a single force with a single ruler. Many Huns were employed as mercenaries by both East and West Romans and by the Goths. Uldin, the first Hun known by name, headed a group of Huns and Alans fighting against Radagaisus in defense of Italy. Uldin was also known for defeating Gothic rebels giving trouble to the East Romans around the Danube and beheading the Goth Gainas around 400–401. Gainas' head was given to the East Romans for display in Constantinople in an apparent exchange of gifts.\n\nThe East Romans began to feel the pressure from Uldin's Huns again in 408. Uldin crossed the Danube and captured a fortress in Moesia named Castra Martis, which was betrayed from within. Uldin then proceeded to ransack Thrace. The East Romans tried to buy Uldin off, but his sum was too high so they instead bought off Uldin's subordinates. This resulted in many desertions from Uldin's group of Huns.\n\nAlaric's brother-in-law, Athaulf, appears to have had Hun mercenaries in his employ south of the Julian Alps in 409. These were countered by another small band of Huns hired by Honorius' minister Olympius. Later in 409, the West Romans stationed ten thousand Huns in Italy and Dalmatia to fend off Alaric, who then abandoned plans to march on Rome.\n\nUnder Attila and Bleda \n\nFrom 434 the brothers Attila and Bleda ruled the Huns together. Attila and Bleda were as ambitious as their uncle Rugila. In 435 they forced the Eastern Roman Empire to sign the Treaty of Margus, giving the Huns trade rights and an annual tribute from the Romans. The Romans also agreed to give up Hunnic refugees (individuals who could have threatened the brothers' grip on power) for execution. With their southern border protected by the terms of this treaty, the Huns could turn their full attention to the further subjugation of tribes to the west.\n\nWhen the Romans breached the treaty in 440, Attila and Bleda attacked Castra Constantias, a Roman fortress and marketplace on the banks of the Danube. The Eastern Romans stopped delivery of the agreed tribute, and they broke other conditions of the Treaty of Margus. The Hunnic kings turned their attention back to the Eastern Romans. Reports that the Bishop of Margus had crossed into Hun lands and desecrated royal graves further angered the Hun kings. War broke out between the two empires, and the Huns overcame a weak Roman army to raze the cities of Margus, Singidunum and Viminacium. Although a truce was signed in 441, two years later Constantinople again failed to deliver the tribute and war resumed. In the following campaign, Hun armies came alarmingly close to Constantinople, sacking Sardica, Arcadiopolis and Philippopolis along the way. Suffering a complete defeat at the Battle of Chersonesus, the Eastern Roman Emperor Theodosius II gave in to Hun demands and in autumn 443 signed the Peace of Anatolius with the two Hun kings. The Huns returned to their lands with a vast train full of plunder.\n\nUnified Empire under Attila \n\nBleda died in 445, with some historians speculating that his death was at the hands of Attila. With his brother gone, Attila was able to establish undisputed control over his subjects. In 447, Attila turned the Huns back toward the Eastern Roman Empire once more. His invasion of the Balkans and Thrace was devastating. The Eastern Roman Empire was already beset by internal problems, such as famine and plague, as well as riots and a series of earthquakes in Constantinople itself. A last-minute rebuilding of its walls preserved Constantinople unscathed. Victory over a Roman army left the Huns virtually unchallenged in Eastern Roman lands and they raided as far south as Thermopylae. Only disease forced them to retreat, and the war came to an end in 449 with an agreement in which the Romans agreed to pay Attila an annual tribute of 2100 pounds of gold. Our only first-hand account of conditions among the Huns and of Attila himself is by Priscus, an official in the peace embassy to Attila.\n\nThroughout their raids on the Eastern Roman Empire, the Huns had maintained good relations with the Western Empire, and in particular with Flavius Aetius, a powerful Roman general (sometimes even referred to as the de facto ruler of the Western Empire) who in his youth had spent time as a hostage with the Huns. However, this all changed in 450 when Honoria, sister of the Western Roman Emperor Valentinian III, sent Attila a ring and requested his help to escape her betrothal to a senator. Attila claimed her as his bride and half the Western Roman Empire as dowry. Additionally, a dispute arose between Attila and Aetius about the rightful heir to a king of the Salian Franks. Finally, Attila's ability to distribute treasure to favoured followers was an important support to his power, and the repeated extortion from the Eastern Roman Empire had left it with little to plunder.\n\nIn 451, Attila's forces entered Gaul, accumulating contingents from the Franks, Goths and Burgundian tribes en route. Once in Gaul, the Huns first attacked Metz, then his armies continued westwards, passing both Paris and Troyes to lay siege to Orléans.\n\nAetius was given the duty of relieving Orléans by Emperor Valentinian III. Bolstered by Frankish and Visigothic troops (under King Theodoric), Aetius' own Roman army met the Huns at the Battle of the Catalaunian Plains. Although a tactical defeat for Attila, thwarting his invasion of Gaul and forcing his retreat back to non-Roman lands, the macrohistorical significance of the allied and Roman victory is a matter of debate.Creasy, Edward Shepherd: The Fifteen Decisive Battles of the World.Norwich, Byzantium: the Early Centuries. 1997, p. 158.Bury, The Later Roman Empire, pp. 294f.\n\nThe following year, Attila renewed his claims to Honoria and territory in the Western Roman Empire. Leading his horde across the Alps and into Northern Italy, he sacked and razed the cities of Aquileia, Vicetia, Verona, Brixia, Bergamum and Milan. Hoping to avoid the sack of Rome, Emperor Valentinian III sent three envoys, the high civilian officers Gennadius Avienus and Trigetius, as well as Pope Leo I, who met Attila at Mincio in the vicinity of Mantua, and obtained from him the promise that he would withdraw from Italy and negotiate peace with the emperor. Prosper of Aquitaine describes the historic meeting, giving all the credit of the successful negotiation to Leo. Priscus reports that superstitious fear of the fate of Alaric—who died shortly after sacking Rome in 410—gave him pause. More practically, Italy had suffered from a terrible famine in 451 and her crops were faring little better in 452; Attila's invasion of the plains of Northern Italy this year did not improve the harvest. To advance on Rome would have required supplies which were not available in Italy, and taking the city would not have improved Attila's supply situation. Secondly, an East Roman force had crossed the Danube and defeated the Huns who had been left behind by Attila to safeguard their home territories. Attila, hence, faced heavy human and natural pressures to retire from Italy before moving south of the Po. Attila retreated without Honoria or her dowry.\n\nThe new Eastern Roman Emperor Marcian then halted tribute payments. From the Pannonian Basin, Attila planned to attack Constantinople. However, in 453 he married a girl with the Germanic name Ildico, and died of a haemorrhage on his wedding night.\n\nAfter Attila \n\nAfter Attila's death in 453, the Hunnic Empire faced an internal power struggle between its vassalized Germanic peoples and the Hunnic ruling body. Led by Ellak, Attila's favored son and ruler of the Akatziri, the Huns engaged the Gepid king Ardaric at the Battle of Nedao, who led a coalition of Germanic Peoples to overthrow Hunnic imperial authority. The Amali Goths would revolt the same year under Valamir, allegedly defeating the Huns in a separate engagement. However, this did not result in the complete collapse of Hunnic power in the Carpathian region, but did result in the loss of many of their Germanic vassals. At the same time, the Huns were also dealing with the arrival of more Oghur Turkic-speaking peoples from the East, including the Oghurs, Saragurs, Onogurs, and the Sabirs. In 463, the Saragurs defeated the Akatziri, or Akatir Huns, and asserted dominance in the Pontic region.\n\nIn 458 some Huns served under Tudila in Majorian's army, probably belonging to a group settled under Emnetzur and Ultzindur in Dacia Ripensis. The western Huns under Dengzich were experiencing difficulties in 461, when they were defeated by Valamir in a war against the Sadages, a people allied with the Huns. His campaigning was also met with dissatisfaction from Ernak, ruler of the Akatziri Huns, who wanted to focus on the incoming Oghur speaking peoples. In 465–466, Ernak and Dengzich sent ambassadors to Constantinople requesting a peace treaty, and asking to establish a market for the exchange of needed provisions. However these requests were rejected, and Dengzich attacked the Romans in 467, without the assistance of Ernak. He was surrounded by the Romans and besieged, and came to an agreement that they would surrender if they were given land and his starving forces given food. During the negotiations, a Hun in service of the Romans named Chelchel persuaded the enemy Goths to attack their Hun overlords. The Romans, under their General Aspar and with the help of his bucellarii, then attacked the quarreling Goths and Huns, defeating them.\n\nIn 469, Anagastes, the son of Arnegisclus who was slain by Attila, brought Dengzich's head and paraded it through the streets before mounting it on a stake in the Hippodrome. Some Historians, like John Man, accept this date as the end of the Hunnic Empire. However others, such as Kim, argue it continued under Ernak who absorbed the incoming Oghur speakers. These people were similar to the Huns and Attila's empire continued as the Kutrigur and Utigur Hunno-Bulgars. This conclusion is still subject to some controversy.\n\nSociety and culture \n\nAppearance \n\nAs the Huns were illiterate and thus kept no records, all surviving accounts were written by enemies of the Huns, and none describe the Huns as attractive either morally or in appearance. Jordanes, a Goth writing in Italy in 551, a century after the collapse of the Hunnic Empire, describes the Huns as a \"savage race, which dwelt at first in the swamps, a stunted, foul and puny tribe, scarcely human and having no language save one which bore but slight resemblance to human speech.\" Jordanes goes on to write:They made their foes flee in horror because their swarthy aspect was fearful, and they had, if I may call it so, a sort of shapeless lump, not a head, with pin-holes rather than eyes. Their hardihood is evident in their wild appearance, and they are beings who are cruel to their children on the very day they are born. For they cut the cheeks of the males with a sword, so that before they receive the nourishment of milk they must learn to endure wounds. Hence they grow old beardless and their young men are without comeliness, because a face furrowed by the sword spoils by its scars the natural beauty of a beard. They are short in stature, quick in bodily movement, alert horsemen, broad shouldered, ready in the use of bow and arrow, and have firm-set necks which are ever erect in pride. Though they live in the form of men, they have the cruelty of wild beasts.Jordanes also recounted how Priscus had described Attila the Hun, the Emperor of the Huns from 434–453, as: \"Short of stature, with a broad chest and a large head; his eyes were small, his beard thin and sprinkled with grey; and he had a flat nose and tanned skin, showing evidence of his origin.\"\n\nIn forming their view of Attila's people, the Romans tapped into attitudes inherited from the Greeks. These were the vilest creatures imaginable. They came from the North and everyone knew that the colder the climate was, the more barbaric the people were.Attila The Hun, by John Man, Bantam Books, 2005, p.79 They knew nothing of metal, had no religion and lived like savages, without fire, eating their food raw, living off roots, and meat tenderized by placing it under their horses' saddles. They had no buildings, not so much as a reed hut, indeed, they feared the very idea of venturing under a roof.\n\nThe description of Huns given by the Romans has prompted some historians to believe they were of East Asian origin. Denis Sinor, noting the paucity of anthropological evidence, wrote that \"there is no reason to question the basic accuracy of the western descriptions, and the absence of massive supporting evidence by physical anthropology cannot weaken the point they so tellingly make. It is the unusual that most attracts attention.\" However, Austrian traveler Maenchen-Helfen wrote in the 20th century: Ammianus' description begins with a strange misunderstanding ... This was repeated by Claudian and Sidonius and reinterpreted by Cassiodorus. Ammianus' explanation of the thin beards is wrong. Like so many other people, the Huns inflicted wounds on their live flesh as a sign of grief when their kinsmen were dying.\n\nArtificial cranial deformation \n\nArtificial cranial deformation was practiced by the Huns and sometimes by tribes under their influence.Bachrach, Bernard S., A history of the Alans in the West: from their first appearance in the sources of classical antiquity through the early Middle Ages, U of Minnesota Press (1973), pp. 67–69 Artificial cranial deformation of the circular type can be used to trace the route that the Huns took from north China to the Central Asian steppes and subsequently to the southern Russian steppes. The people who practiced annular type artificial cranial deformation in Central Asia were Yuezhi/Kushans.\"The Kushan civilization\", Buddha Rashmi Mani, page 5: \"A particular intra-cranial investigation relates to an annular artificial head deformation (macrocephalic), evident on the skulls of diverse racial groups being a characteristic feature traceable on several figures of Kushan kings on coins.\", https://books.google.bg/books?id\nJ_YtAAAAMAAJ&qkushan+deformation&dq\nkushan+deformation&hlen&sa\nX&redir_esc=y\n\nSome artificially deformed crania from the 5th–6th Century AD have been found in Northeastern Hungary and elsewhere in Western Europe. None of them have any Mongoloid features and all the skulls appear Europoid; these skulls may have belonged to Germanic or other subject groups whose parents wished to elevate their status by following a custom introduced by the Huns.\n\nGovernment \n\nHunnic governmental structure has long been debated. In the past many scholars argued that the Huns did not have a central organization until after they entered Europe. Peter Heather argued the Huns were a disorganized confederation in which leaders acted completely independently and that eventually established a ranking hierarchy, much like Germanic societies.Heather, Peter, “Huns and the End of the Roman Empire in Western Europe” in English Historical Review (1995): 11;  However this has been challenged in recent years. According to Kim, it is now believed that the Huns continued the Xiongnu organization, in which their polity was divided into Left, Right, South, and North, in that order of priority.Kim, The Huns, Rome, and the Birth of Europe, 23, 207 It is also thought that the Huns continued the council of \"six horns/nobles\" that the Xiongnu had under their emperor.Kim, The Huns, Rome, and the Birth of Europe, 58–59, 208 It is unknown what the Hun emperor was called, but the terms Chanyu, Aniliki, Shah, and Yabgu are possible or interchangeable titles for the same position, as they were in use by other contemporary peoples during that period.Atwood, Huns and Xiongnu – New Thoughts on an Old Problem, 33; Kim, The Huns, Rome, and the Birth Of Europe, 31, 59, 206 Likewise, it is suggested that that the Huns continued to use the decimal military organization of the Xiongnu as well.Kim, The Huns, Rome, and the Birth of Europe, 59\n\nLanguage \n\nA variety of languages were spoken within the Hun Empire.Blockley, RC 1983. The Fragmentary Classicising Historians of the Later Roman Empire. Liverpool: Francis Cairns; citing Priscus It has been supposed that by the 440s, the \"Huns\" were more Germanic-speaking subject than speakers of Hunnic, and as such Gothic may have been a lingua franca of the Empire. Kim however points out that there is no evidence for the idea that Gothic was a lingua franca. Subjects of the Huns also included Iranian-speaking Alans and Sarmatians. Based on some etymological interpretation of the words strava, medos, and kamos and subsequent historical appearance, the other languages have been taken to include a form of Proto-Slavic language.Walter Pohl. 1999. Huns. Late Antiquity: a guide to the postclassical world, ed. Glen Warren Bowersock, Peter Robert Lamont Brown, Oleg Grabar. Harvard University Press. pp. 501–502Schenker, Alexander. 1995. The Dawn of Slavic: an introduction to Slavic philology. Yale University Press.\n\nPriscus noted that the Hunnic language differed from other languages spoken at Attila's court. He recounts how Zerco made Attila's guests laugh also by the \"promiscuous jumble of words, Latin mixed with Hunnish and Gothic\". Priscus said that Attila's \"Scythian\" subjects spoke \"besides their own barbarian tongues, either Hunnish, or Gothic, or, as many have dealings with the Western Romans, Latin; but not one of them easily speaks Greek, except captives from the Thracian or Illyrian frontier regions\".\n\nThe ancient sources are thus clear that there was a Hunnic language. The literary sources preserve many names, and three Indo-European words (medos, kamos, strava), which have been studied for more than a century and a half. Otto Maenchen-Helfen noted that the thesis suggesting the Huns spoke a Turkic language has a long history behind it. Maenchen-Helfen held that by Turkic origin of Hunnic tribal and proper names, the Huns spoke a Turkic language. Denis Sinor argued that \"at least part of the Hun leadership was Turkic-speaking\".\n\nTraditionally notable studies of proper names chronologically include that of Gyula Németh, Gerhard Doerfer, Maenchen-Helfen, and Omeljan Pritsak. In Pritsak's 1982 study The Hunnic Language of the Attila Clan, he analyzes the 33 survived personal names and concludes: It was not a Turkic language, but one between Turkic and Mongolian, probably closer to the former than the latter. The language had strong ties to Bulgar language and to modern Chuvash, but also had some important connections, especially lexical and morphological, to Ottoman Turkish and Yakut.On the basis of the existing name records, a number of scholars suggest that the Huns spoke a Turkic language of the Oghur branch, which also includes the Bulgar, Khazar and Chuvash languages.Johanson, Lars; Éva Agnes Csató (ed.). 1998. The Turkic languages. Routledge.\"It is assumed that the Huns also were speakers of an l- and r- type Turkic language and that their migration was responsible for the appearance of this language in the West.\" Johanson (1998); cf. Johanson (2000, 2007) and the articles pertaining to the subject in Johanson & Csató (ed., 1998).Victor H. Mair, Contact And Exchange in the Ancient World, 2006, University of Hawaii Press, p.136 Peter Heather called the Huns \"the first group of Turkic, as opposed to Iranian, nomads to have intruded into Europe\".Heather, Peter. 1995. The Huns and the End of the Roman Empire in Western Europe. English Historical Review, 90: 4-41. Many recent scholars agree that Hunnic was related to Turkic and Mongolian languages.\n\nIn 2013, Hyun Jin Kim suggested that \"from the names that we do know, most of which seem to be Turkic... the Hunnic elite was predominantly Turkic-speaking.\" He also suggests that the Xiongnu, who had originally spoken Yeniseian, flipped to Oghur Turkic when they absorbed the Dingling and crossed into Central Asia, like the later Golden Horde and Chagatai Khanate. He noted that, beside Hunnic, people in Attila's court also spoke Gothic and Latin, and that in the western part of the Empire, where subjected Goths lived, people described as Huns probably spoke both the Hunnic and Gothic languages. An example would be the Germanic or Germanized names of noted Huns like Laudaricus.\n\nNevertheless, some scholars still conclude that the Hunnic language cannot presently be classified, and attempts to classify it as Turkic or Mongolic are speculative. Doerfer, Gerhard. Zur Sprache der Hunnen. Central Asiatic Journal, 17(1): 1-50.Sinor, Denis. 1977. The Outlines of Hungarian Prehistory. Journal of World History, 4(3):513–540.Poppe, Nicholas. 1965. Introduction to Altaic linguistics. Wiesbaden: O. Harrassowitz. Ural-altaische Bibliothek; 14.\n\nWarfare \n\nStrategy and tactics \n\nHun warfare as a whole is not well studied, and many scholars as of recent have discounted Ammianus' description of the Huns. This was first pointed out by E.A. Thompson, who stated that the Huns could never have conquered Europe without iron armor and weapons. The only accurate information on Hun warfare comes from the 6th-century Strategikon, which describes the warfare of \"Dealing with the Scythians, that is, Avars, Turks, and others whose way of life resembles that of the Hunnish peoples.\" The Strategikon describes the Avars and Huns as devious and very experienced in military matters. They are described as preferring to defeat their enemies by deceit, surprise attacks, and cutting off supplies. The Huns brought large numbers of horses to use as replacements and to give the impression of a larger army on campaign. The Hunnish peoples did not set up an entrenched camp, but spread out across the grazing fields according to clan, and guard their necessary horses until they began forming the battle line under the cover of early morning. The Strategikon states the Huns also stationed sentries at significant distances and in constant contact with each other in order to prevent surprise attacks.\n\nAccording to the Strategikon, the Huns did not form a battle line in the method that the Romans and Persians used, but in irregularly sized divisions in a single line, and keep a separate force nearby for ambushes and as a reserve. The Strategikon also states the Huns used deep formations with a dense and even front. Otto Maenchen-Helfen states that the Huns likely formed up in divisions according to tribal clans and families which Ammianus calls Cunei, the leader of which was called a Cur and inherited the title as it was passed down through the clan. The Strategikon states that the Huns kept their spare horses and baggage train to either side of the line about a mile away, with a moderate sized guard, and would sometimes tie their spare horses together behind the main battle line. The Huns preferred to fight at long range, utilizing ambush, encirclement, and the feigned retreat. The Strategikon also makes note of the wedge shaped formations mentioned by Ammianus, and corroborated as familial regiments by Maenchen-Helfen.Ammianus Marcellinus, Res Gestae, 31.2.8 The Strategikon states the Huns preferred to pursue their enemies relentlessly after a victory and then wear them out by a long siege after defeat.\n\nMilitary equipment \n\nThe Strategikon states the Huns typically used maille, swords, bows, and lances, and that most Hunnic warriors were armed with both the bow and lance and used them interchangeably as needed. It also states the Huns used quilted linen, wool, or sometimes iron barding for their horses and also wore quilted coifs and kaftans. This assessment is largely corroborated by archaeological finds of Hun military equipment, such as the Volnikovka and Brut Burials.\n\nA late Roman ridge helmet of the Berkasovo-Type was found with a Hun burial at Concesti. A Hunnic helmet of the Segmentehelm type was found at Chudjasky, and another of the Bandhelm type at Turaevo. Fragments of lamellar helmets dating to the Hunnic period and within the Hunnic sphere have been found at Iatrus, Illichevka, and Kalkhni. Hun lamellar armour has not been found in Europe, although two fragments of likely Hun origin have been found on the Upper Ob and in West Kazakhstan dating to the 3rd–4th centuries. An unpublished find at a military warehouse near Toprachioi, Romania is known but it is uncertain if it can be attributed to Hun origin. It is known that the Eurasian Avars introduced Lamellar armor to the Roman Army and Migration Era Germanics in the Middle 6th Century, but this later type does not appear before then.\n\nIt is also widely accepted that the Huns introduced the langseax, a 60 cm cutting blade that became popular among the migration era Germanics and in the Late Roman Army, into Europe. It is believed these blades originated in China and that the Sarmatians and Huns served as a transmission vector, using shorter seaxes in Central Asia that developed into the narrow langseax in Eastern Europe during the late 4th and first half of the 5th century. These earlier blades date as far back as the 1st century AD, with the first of the newer type appearing in Eastern Europe being the Wien-Simmerming example, dated to the late 4th century AD. Other notable Hun examples include the Langseax from the more recent find at Volnikovka in Russia.\n\nThe Huns used a type of spatha in the Iranic or Sassanid style, with a long, straight approximately 83cm blade, usually with a diamond shaped iron guard plate. Swords of this style have been found at sites such as Altlussheim, Szirmabesenyo, Volnikovka, Novo-Ivanovka, and Tsibilium 61. They typically had gold foil hilts, gold sheet scabbards, and scabbard fittings decorated in the polychrome style. The sword was carried in the \"Iranian style\" attached to a swordbelt, rather than on a baldric.\n\nThe most famous weapon of the Huns is the Qum Darya-type composite recurve bow, often called the \"Hunnish Bow\". This bow was invented some time in the 3rd or 2nd centuries BC with the earliest finds near Lake Baikal, but spread across Eurasia long before the Hunnic migration. These bows were typified by being asymmetric in cross-section between 145-155cm in length, having between 4–9 lathes on the grip and in the siyahs. Although whole bows rarely survive in European climatic conditions, finds of bone Siyahs are quite common and characteristic of steppe burials. Complete specimens have been found at sites in the Tarim Basin and Gobi Desert such as Niya, Qum Darya, and Shombuuziin-Belchir. Eurasian nomads such as the Huns typically used trilobate diamond shaped iron arrowheads, attached using birch tar and a tang, with typically 75cm shafts and fletching attached with tar and sinew whipping. Such trilobate arrowheads are believed to be more accurate and have better penetrating power or capacity to injure than flat arrowheads.\n\nLegacy \n\nLegends \n\nChroniclers writing centuries later often mentioned or alluded to Huns or their purported descendants. These include:\n* Theophylact Simocatta\n* Annales Fuldenses\n* Annales Alamannici\n* Annals of Salzburg\n* Liutprand of Cremona's Antapodosis\n* Regino of Prüm's chronicle\n* Widukind of Corvey's Saxon Chronicle\n* Nestor the Chronicler's Primary Chronicle\n* Legends of Saints Cyril and Methodius\n* Aventinus's Chronicon Bavaria\n* Constantine VII's De Administrando Imperio\n* Leo VI the Wise's Tactica\n\nMedieval Hungarians continued this tradition (see Gesta Hunnorum et Hungarorum, Chronicon Pictum, Gesta Hungarorum).\n\nMemory of the Hunnic conquest was transmitted orally among Germanic peoples and is an important component in the Old Norse Völsunga saga and Hervarar saga and in the Middle High German Nibelungenlied. These stories all portray Migration Period events from a millennium earlier.\n\nIn the Hervarar saga, the Goths make first contact with the bow-wielding Huns and meet them in an epic battle on the plains of the Danube.\n\nIn the Nibelungenlied, Kriemhild marries Attila (Etzel in German) after her first husband Siegfried was murdered by Hagen with the complicity of her brother, King Gunther. She then uses her power as Etzel's wife to take a bloody revenge in which not only Hagen and Gunther but all Burgundian knights find their death at festivities to which she and Etzel had invited them.\n\nIn the Völsunga saga, Attila (Atli in Norse) defeats the Frankish king Sigebert I (Sigurðr or Siegfried) and the Burgundian King Guntram (Gunnar or Gunther), but is later assassinated by Queen Fredegund (Gudrun or Kriemhild), the sister of the latter and wife of the former.\n\nIn the German \"Saga of Tidreck of Bern\", its written versions beginning from the 13th century, the Huns are called Frisians. Frisia was often called Hunaland in the Middle Ages.Veselovsky. Russians and veltinas in the Saga of Tidreck of Bern (Verona). Saint-Petersburg, Russia, 1906 in Russian Веселовский \"Русские и вильтины в саге о Тидреке Бернском (Веронском)\" (СПб., 1906)\n\nWidsith, possibly one of the oldest pieces of English literature to survive to the present day, lists a number of ancient kings of tribes sorted according to their popularity and impact; Attila, King of the Huns, comes first, followed immediately by Eormanric of the Ostrogoths. Widsith may be by far the oldest extant work that tells of the Battle of the Goths and Huns, also recounted in later Scandinavian works such as the Hervarar saga;  in Widsith, however, the battle's details are presented as \"sober historical facts\" rather than as the \"heroic stories\" of later works. The name Attila, rendered in Old English as Ætla, was a given name in use in Anglo-Saxon England (ex. Bishop Ætla of Dorchester) and its use in England at the time may have been connected to the heroic kings legend represented in works like Widsith, though historian Otto J. Maenchen-Helfen doubts the use of the name by the Anglo-Saxons had anything to do with the Huns, and argues it was more likely to be based directly on the name's Germanic origin meaning \"little father\".\n\nClaims of Hunnic heritage \n\nThe Hungarians (Magyars) in particular lay claim to Hunnic heritage. Although Magyar tribes only began to settle in the geographical area of present-day Hungary in the very end of the 9th century, over 400 years after the breakup of Attila's Hunnic Empire, Hungarian prehistory includes Magyar origin myths. There is also a medieval legend of a lineage that makes Attila the sixth-generation ancestor of Árpád conqueror of the modern Pannonian basin, through Attila's son Csaba, his son Ed, his son Ügyek, his son Előd, his son Álmos. Álmos was ruler of the Magyars and the father of Arpad. The national anthem of Hungary describes the Hungarians as \"blood of Bendegúz'\" (the medieval and modern Hungarian version of Mundzuk, Attila's father). Attila's brother, Bleda, is called Buda in modern Hungarian and some medieval chronicles and literary works attribute the name of the city of Buda to him.\n\nThere is a legend among the Székely people that claims that after the death of Attila, in a battle called the Battle of Krimhilda, 3000 Hun warriors managed to escape and settle in a place called \"Csigle-mező\" (today Transylvania) and they changed their name from Huns to Szekler (Székely). According to the Hungarian scholar Egyed, the Székelys speak the Hungarian language \"without any trace of a Turkic substratum\", indicating that they did not have a language shift during their history, and proposes that the Székelys were descended from privileged Hungarian groups. They therefore could not have been related to the Huns, who most likely spoke an Oghur Turkic dialect.\n\nIn Book V, Chapter 9 of his Ecclesiastical History of the English People, which was written in Latin, the Anglo-Saxon historian Bede gave a list of peoples that included the Huns. James Campbell notes regarding this passage that though this list of peoples has generally been regarded by historians as being a list of peoples living in Germany at the time Bede wrote this passage in the 8th century, \"the sense of the Latin is that these are the peoples from whom the Anglo-Saxons living in Britain were derived.\" Regarding the inclusion of the Huns among these peoples, he writes that the list of peoples fits the 5th century better, when the Anglo-Saxons began migrating to Britain, than the 8th century, and notes that \"Huns sound odd; it is equally odd that Priscus heard of a boast by Attila that he had authority over the islands in the ocean.\" Leonard Neidorf, however, interprets the passage as being about the ancestors of the Anglo-Saxons, the Angles, Saxons, and Jutes, sharing a common Germanic heritage with the Huns and the other groups Bede listed.\n\n20th-century use in reference to Germans \n\nOn 27 July 1900, during the Boxer Rebellion in China, Kaiser Wilhelm II of Germany gave the order to act ruthlessly towards the rebels: \"Mercy will not be shown, prisoners will not be taken. Just as a thousand years ago, the Huns under Attila won a reputation of might that lives on in legends, so may the name of Germany in China, such that no Chinese will even again dare so much as to look askance at a German.\"Weser-Zeitung, 28 July 1900, second morning edition, p. 1: 'Wie vor tausend Jahren die Hunnen unter ihrem König Etzel sich einen Namen gemacht, der sie noch jetzt in der Überlieferung gewaltig erscheinen läßt, so möge der Name Deutschland in China in einer solchen Weise bekannt werden, daß niemals wieder ein Chinese es wagt, etwa einen Deutschen auch nur schiel anzusehen'.\n\nThe term \"Hun\" from this speech was later used for the Germans by British propaganda during World War I. The comparison was helped by the spiked Pickelhaube helmet worn by German forces until 1916, which would be reminiscent of images depicting ancient Hun helmets. This usage, emphasising the idea that the Germans were barbarians, was reinforced by Allied propaganda throughout the war. The French songwriter Theodore Botrel described the Kaiser as \"an Attila, without remorse\", launching \"cannibal hordes\".\"Quand un Attila, sans remords, / Lance ses hordes cannibales, / Tout est bon qui meurtrit et mord: / Les chansons, aussi, sont des balles!\", from Theodore Botrel, by Edgar Preston T.P.'s Journal of Great Deeds of the Great War, February 27, 1915\n\nThe usage of the term \"Hun\" to describe Germans resurfaced during World War II. For example, Winston Churchill 1941 said in a broadcast speech: \"There are less than 70,000,000 malignant Huns, some of whom are curable and others killable, most of whom are already engaged in holding down Austrians, Czechs, Poles and the many other ancient races they now bully and pillage.\"\nLater that year Churchill referred to the invasion of the Soviet Union as \"the dull, drilled, docile brutish masses of the Hun soldiery, plodding on like a swarm of crawling locusts.\"Churchill, Winston S. 1941. [http://www.ibiblio.org/pha/timeline/410622dwp.html \"WINSTON CHURCHILL'S BROADCAST ON THE SOVIET-GERMAN WAR\", London, June 22, 1941] During this time American President Franklin D. Roosevelt also referred to the German people in this way, saying that an Allied invasion into Southern France would surely \"be successful and of great assistance to Eisenhower in driving the Huns from France.\"Winston Churchill. 1953. \"Triumph and Tragedy\" (volume 6 of The Second World War). Boston: Houghton-Mifflin. Ch. 4, p. 70\n\nSectarian slur in Northern Ireland and Scotland \n\n\"Hun\" is also used as an sectarian slur against Protestants in Scotland and Northern Ireland. In Scotland, the term has been used by fans of Celtic FC in Old Firm derbies against Rangers FC supporters, while Orange Halls in Ulster have been daubed with graffiti reading KAH (\"Kill all Huns\").\n\nA pamphlet issued to PSNI officers in 2008 listed \"Huns\" – along with the terms \"black\", \"prods\" or \"jaffas\" (referring to the Orange Order) for Protestants and \"fenians\", \"taigs\", \"chucks\" or \"spongers\" for Irish Catholics – as terms not to use to avoid causing offence. Huns. http://en.wikipedia.org/?curid=13519."
  }
}
