{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13297",
  "eid" : "081b66f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778522847,
  "textBody" : "The Hudson's Bay Company (HBC; ), is a Canadian retail business group. A fur trading business for much of its existence, HBC now owns and operates retail stores in Canada, the United States, and parts of Europe, including Belgium, The Netherlands, and Germany. The company's namesake business division is Hudson's Bay, commonly referred to as The Bay (La Baie in French). Other divisions include Galeria Kaufhof, Gilt, Home Outfitters, Lord & Taylor, and Saks Fifth Avenue. HBC's head office was in the Simpson Tower in Toronto, but it relocated northwest of Toronto to Brampton, Ontario. The company is listed on the Toronto Stock Exchange under the symbol \"HBC\".\n\nThe company was incorporated by English royal charter in 1670 as The Governor and Company of Adventurers of England trading into Hudson's Bay. It functioned as the de facto government in parts of North America before European states and later the United States laid claim to some of those territories. It was once the world's largest landowner, controlling the area of the Hudson Bay watershed, known as Rupert's Land, which has 15% of North American acreage. From its long-time headquarters at York Factory on Hudson Bay, the company controlled the fur trade throughout much of the English and later British-controlled North America for several centuries. Undertaking early exploration, its traders and trappers forged relationships with many groups of aboriginal peoples. Its network of trading posts formed the nucleus for later official authority in many areas of Western Canada and the United States. In the late 19th century, with its signing of the Deed of Surrender, its vast territory became the largest portion of the newly formed Dominion of Canada, in which the company was the largest private landowner.\n\nBy the mid-19th century, the company evolved into a mercantile business selling everything from furs to fine homeware. They \"quickly introduced a new type of client to the HBC – one that shopped for pleasure and not with skins\"; the retail era had begun as the HBC began establishing stores across the country. \nIn July 2008, HBC was acquired by NRDC Equity Partners, which also owns the upmarket American department store Lord & Taylor. From 2008 to 2012, the HBC was run through a holding company of NRDC, Hudson's Bay Trading Company, which was dissolved on 23 January 2012. Since 2012, the HBC directly oversees its Canadian subsidiaries Hudson's Bay (formerly The Bay) and Home Outfitters, in addition to the operations of Lord & Taylor in the United States.\n\nOn 29 July 2013, the HBC announced its takeover of Saks, Inc., operator of the US Saks Fifth Avenue brand. The merger was completed on 3 November 2013. In September 2015, HBC acquired the German department store chain Galeria Kaufhof and its Belgian subsidiary from Metro Group for US$3.2 billion. In late July 2017, German trade credit insurance Euler Hermes announced that it has drastically reduced its coverage for Kaufhof; which in general means that the rating and credit worthiness of a company is severely questioned.[http://www.wiwo.de/unternehmen/handel/euler-hermes-laesst-kaufhof-fallen-was-diese-krise-so-gefaehrlich-macht/20112978.html Was diese Krise so gefährlich macht], WIWO, 27 July 2017\n\nIn May 2016, HBC announced it would expand to the Netherlands by taking over up to 20 former Vroom & Dreesmann sites by 2017. V&D was a historic Dutch department store chain that went bankrupt and shut down in early 2016. HBC said the expansion would cost CA$340 million and create 2,500 jobs in the stores and another 2,500 temporary construction jobs. The Dutch stores would operate under the \"Hudson's Bay\" and \"Saks Off Fifth\" brands.\n\nIn January 2016, HBC announced it would also expand deeper into digital space with its acquisition of online flash sales site, the Gilt Groupe, for US$250 million.\n\nHistory\n\n17th century\n\nIn the 17th century the French had a de facto monopoly on the Canadian fur trade with their colony of New France. Two French traders, Pierre-Esprit Radisson and Médard des Groseilliers (Médard de Chouart, Sieur des Groseilliers), Radisson's brother-in-law, learned from the Cree that the best fur country lay north and west of Lake Superior, and that there was a \"frozen sea\" still further north. Assuming this was Hudson Bay, they sought French backing for a plan to set up a trading post on the Bay, to reduce the cost of moving furs overland. According to Peter C. Newman, \"concerned that exploration of the Hudson Bay route might shift the focus of the fur trade away from the St. Lawrence River, the French governor\", Marquis d'Argenson (in office 1658–61), \"refused to grant the coureurs de bois permission to scout the distant territory\". Despite this refusal, in 1659 Radisson and Groseilliers set out for the upper Great Lakes basin. A year later they returned with premium furs, evidence of the potential of the Hudson Bay region. Subsequently, they were arrested for trading without a licence and fined, and their furs were confiscated by the government.\n\nDetermined to establish trade in the Hudson Bay, Radisson and Groseilliers approached a group of English colonial businessmen in Boston, Massachusetts to help finance their explorations. The Bostonians agreed on the plan's merits but their speculative voyage in 1663 failed when their ship ran into pack ice in Hudson Strait. Boston-based English commissioner Colonel George Cartwright learned of the expedition and brought the two to England to raise financing. Radisson and Groseilliers arrived in London in 1665 at the height of the Great Plague. Eventually, the two met and gained the sponsorship of Prince Rupert. Prince Rupert also introduced the two to his cousin, King Charles II. In 1668 the English expedition acquired two ships, the Nonsuch and the Eaglet, to explore possible trade into Hudson Bay. Groseilliers sailed on the Nonsuch, commanded by Captain Zachariah Gillam, while the Eaglet was commanded by Captain William Stannard and accompanied by Radisson. On 5 June 1668, both ships left port at Deptford, England, but the Eaglet was forced to turn back off the coast of Ireland.\n\nThe Nonsuch continued to James Bay, the southern portion of Hudson Bay, where its explorers founded, in 1668, the first fort on Hudson Bay, Charles Fort at the mouth of the Rupert River. (It was later known as Rupert House, and developed as the community of present-day Waskaganish, Quebec.) Both the fort and the river were named after the sponsor of the expedition, Prince Rupert of the Rhine, one of the major investors and soon to be the new company's first governor. After a successful trading expedition over the winter of 1668–69, Nonsuch returned to England on 9 October 1669 with the first cargo of fur resulting from trade in Hudson Bay. The bulk of the fur – worth £1,233 – was sold to Thomas Glover, one of London's most prominent furriers. This and subsequent purchases by Glover made it clear the fur trade in Hudson Bay was viable.\n\nThe Governor and Company of Adventurers of England Trading into Hudson's Bay was incorporated on 2 May 1670, with a royal charter from King Charles II. The charter granted the company a monopoly over the region drained by all rivers and streams flowing into Hudson Bay in northern Canada. The area was named  \"Rupert's Land\" after Prince Rupert, the first governor of the company appointed by the King. This drainage basin of Hudson Bay constitutes , comprising over one-third of the area of modern-day Canada and stretches into the present-day north-central United States. The specific boundaries were unknown at the time. Rupert's Land would eventually become Canada's largest land \"purchase\" in the 19th century.\n\nThe HBC established six posts between 1668 and 1717.  Rupert House(1668, southeast), Moose Factory (1673, south) and Fort Albany, Ontario (1679, west) were erected on James Bay; three other posts were established on the western shore of Hudson Bay proper: Fort Severn (1689), York Factory (1684) and Fort Churchill (1717).  Inland posts were not built until 1774. After 1774, York Factory became the main post because of its convenient access to the vast interior waterway systems of the Saskatchewan and Red rivers. Called \"factories\" (because the \"factor,\" i.e., a person acting as a mercantile agent did business from there), these posts operated in the manner of the Dutch fur trading operations in New Netherlands. By  adoption of the Standard of Trade in the 18th century, the HBC ensured consistent pricing throughout Rupert's Land. A means of exchange arose based on the \"Made Beaver\" (MB); a prime pelt, worn for a year and ready for processing: \"the prices of all trade goods were set in values of Made Beaver (MB) with other animal pelts, such as squirrel, otter and moose quoted in their MB (made beaver) equivalents.  For example, two otter pelts might equal 1 MB\".\n\nDuring the fall and winter, First Nations men and European trappers accomplished the vast majority of the animal trapping and pelt preparation. They travelled by canoe and on foot to the forts to sell their pelts. In exchange they typically received popular trade goods such as knives, kettles, beads, needles, and the Hudson's Bay point blanket. The arrival of the First Nations trappers was one of the high points of the year, met with pomp and circumstance. The highlight was very formal, an almost ritualized \"Trading Ceremony\" between the Chief Trader and the Captain of the aboriginal contingent who traded on their behalf. During the initial years of the fur trade, prices for items varied from post to post.\n\nThe early coastal factory model of the English contrasted with the system of the French. They established an extensive system of inland posts at native villages, and sent traders to live among the tribes of the region, learning their languages and often forming alliances through marriages with indigenous women. In March 1686, the French sent a raiding party under the Chevalier des Troyes more than  to capture the HBC posts along James Bay. The French appointed Pierre Le Moyne d'Iberville, who had shown great heroism during the raids, as commander of the company's captured posts. In 1687 an English attempt to resettle Fort Albany failed due to strategic deceptions by d'Iberville. After 1688 England and France were officially at war, and the conflict played out in North America as well. D'Iberville raided Fort Severn in 1690 but did not attempt to raid the well-defended local headquarters at York Factory. In 1693 the HBC recovered Fort Albany; d'Iberville captured York Factory in 1694, but the company recovered it the next year.\n\nIn 1697, d'Iberville again commanded a French naval raid on York Factory. On the way to the fort, he defeated three ships of the Royal Navy in the Battle of Hudson's Bay (5 September 1697), the largest naval battle in the history of the North American Arctic. D'Iberville's depleted French force captured York Factory by laying siege to the fort and pretending to be a much larger army. The French retained all of the outposts except Fort Albany until 1713. (A small French and Indian force attacked Fort Albany again in 1709 during Queen Anne's War but was unsuccessful. The economic consequences of the French possession of these posts for the company were significant; HBC did not pay any dividends for more than 20 years. See Anglo-French conflicts on Hudson Bay.\n\n18th century\n\nWith the ending of the Nine Years' War in 1697, and the War of the Spanish Succession in 1713 with the signing of the Treaty of Utrecht, France had gotten the short end of the stick. Among the treaty's many provisions, it required France to relinquish all claims to Great Britain on the Hudson Bay, which again became a British possession. (The Kingdom of Great Britain had been established following the union of Scotland and England in 1707). After the treaty, the HBC built Prince of Wales Fort, a stone star fort at the mouth of the nearby Churchill River.  In 1782, during the American Revolutionary War, a French squadron under Jean-François de Galaup, comte de Lapérouse captured and demolished York Factory and Prince of Wales Fort in support of the American rebels.\n\nIn its trade with native peoples, Hudson's Bay Company exchanged wool blankets, called Hudson's Bay point blankets, for the beaver pelts trapped by aboriginal hunters. By 1700, point blankets accounted for more than  60% of the trade. The number of indigo stripes (a.k.a. points) woven into the blankets identified its finished size. A long-held misconception is that the number of stripes was related to its value in beaver pelts.\n\nA parallel may be drawn between the HBC's control over Rupert's Land with the trade monopoly and government functions enjoyed by the Honourable East India Company over India during roughly the same period. The HBC invested £10,000 in the East India Company in 1732, which it viewed as a major competitor.\n\nHudson's Bay Company's first inland trading post was established by Samuel Hearne in 1774 with Cumberland House, Saskatchewan.\n\nIn 1779, other traders founded the North West Company (NWC) in Montreal as a seasonal partnership to provide more capital and to continue competing with the HBC. It became operative for the outfit of 1780 and was the first joint-stock company in Canada and possibly North America. The agreement lasted one year. A second agreement established in 1780 had a three-year term. The company became a permanent entity in 1783. By 1784, the NWC had begun to make serious inroads into the HBC's profits.\n\n19th century\n\nIn 1821, the North West Company of Montreal and Hudson's Bay Company were forcibly merged by intervention of the British government to put an end to often-violent competition. 175 posts, 68 of them the HBC's, were reduced to 52 for efficiency and because many were redundant as a result of the rivalry and were inherently unprofitable. Their combined territory was extended by a licence to the North-Western Territory, which reached to the Arctic Ocean in the north and, with the creation of the Columbia Department in the Pacific Northwest, to the Pacific Ocean in the west. The NWC's regional headquarters at Fort George (Fort Astoria) was relocated to Fort Vancouver on the north bank of the Columbia River; it became the HBC base of operations on the Pacific Slope.\n\nBefore the merger, the employees of the HBC, unlike those of the North West Company, did not participate in its profits. After the merger, with all operations under the management of Sir George Simpson (1826–60), the company had a corps of commissioned officers: 25 chief factors and 28 chief traders, who shared in the company's profits during the monopoly years. Its trade covered , and it had 1,500 contract employees.\n\nThe career progression for officers, together referred to as the Commissioned Gentlemen, was to enter the company as a fur trader. Typically, they were men who had the capital to invest in starting up their trading. They sought to be promoted to the rank of Chief Trader. A Chief Trader would be in charge of an individual post and was entitled to one share of the company's profits. Chief Factors sat in council with the Governors and were the heads of districts. They were entitled to two shares of the company's profits or losses. The average income of a Chief Trader was £360 and that of a Chief Factor was £720.\n\nAlthough the HBC maintained a monopoly on the fur trade during the early to mid-19th century, there was competition from James Sinclair and Andrew McDermot (Dermott), independent traders in the Red River Colony. They shipped furs by the Red River Trails to Norman Kittson a buyer in the United States. In addition, Americans controlled the Maritime fur trade on the Northwest Coast until the 1830s.\n\nThroughout the 1820s and 1830s, the HBC controlled nearly all trading operations in the Pacific Northwest, based at the company headquarters at Fort Vancouver on the Columbia River.  Although claims to the region were by agreement in abeyance, commercial operating rights were nominally shared by the United States and Britain through the Anglo-American Convention of 1818, but company policy, enforced via Chief Factor John McLoughlin of the company's Columbia District, was to discourage U.S. settlement of the territory. The company's effective monopoly on trade virtually forbade any settlement in the region. It established Fort Boise in 1834 (in present-day southwestern Idaho) to compete with the American Fort Hall, 483 km to the east. In 1837, it purchased Fort Hall, also along the route of the Oregon Trail. The outpost director displayed the abandoned wagons of discouraged settlers to those seeking to move west along the trail.\n\nThe company's stranglehold on the region was broken by the first successful large wagon train to reach Oregon in 1843, led by Marcus Whitman. In the years that followed, thousands of emigrants poured into the Willamette Valley of Oregon. In 1846, the United States acquired full authority south of the 49th parallel; the most settled areas of the Oregon Country were south of the Columbia River in what is now Oregon.  McLoughlin, who had once turned away would-be settlers as company director, then welcomed them from his general store at Oregon City. He was later proclaimed the \"Father of Oregon\". The company retains no presence today in what is now the United States portion of the Pacific Northwest.\n\nDuring the 1820s and 1830s, HBC trappers were deeply involved in the early exploration and development of Northern California.  Company trapping brigades were sent south from Fort Vancouver, along what became known as the Siskiyou Trail, into Northern California as far south as the San Francisco Bay Area, where the company operated a trading post at Yerba Buena (San Francisco). These trapping brigades in Northern California faced serious risks, and were often the first to explore relatively uncharted territory. They included the lesser known Peter Skene Ogden and Samuel Black.\n\nBetween 1820 and 1870, the HBC issued its own paper money. The notes, denominated in pounds sterling, were printed in London and issued at the York Factory, Fort Garry and the Red River Colony.  For forty or so years beginning in 1870, the company employed paddle wheel steamships on the rivers of the prairies.\n\nThe Guillaume Sayer Trial in 1849 contributed to the end of the HBC monopoly. Sayer, a Métis trapper and trader, was accused of illegal trading in furs. The Court of Assiniboia brought Sayer to trial, before a jury of HBC officials and supporters. During the trial, a crowd of armed Métis men led by Louis Riel, Sr. gathered outside the courtroom. Although Sayer was found guilty of illegal trade, having evaded the HBC monopoly, Judge Adam Thom did not levy a fine or punishment. Some accounts attributed that to the intimidating armed crowd gathered outside the courthouse. With the cry, Le commerce est libre! Le commerce est libre! (\"Trade is free! Trade is free!\"), the Métis loosened the HBC's previous control of the courts, which had enforced their monopoly on the settlers of Red River.\n\nAnother factor was the findings of the Palliser Expedition of 1857 to 1860, led by Captain John Palliser. He surveyed the area of the prairies and wilderness from Lake Superior to the southern passes of the Rocky Mountains. Although he recommended against settlement of the region, the report sparked a debate. It ended the myth publicized by Hudson's Bay Company: that the Canadian West was unfit for agricultural settlement. In 1863, the International Financial Society became the majority shareholders of the HBC.\n\nIn 1869, after rejecting the American government offer of , the company approved the return of Rupert’s Land to Britain. The government gave it to Canada and loaned the new country the £300,000 required to compensate HBC for its losses. The deal, known as The Deed of Surrender, came into force the following year. The resulting territory, now known as the Northwest Territories, was brought under Canadian jurisdiction under the terms of the Rupert's Land Act 1868, enacted by the Parliament of the United Kingdom. The Deed enabled the admission of the fifth province, Manitoba, to the Confederation on 15 July 1870, the same day that the deed itself came into force.\n\nDuring the 19th century the Hudson Bay's Company went through great changes in response to such factors as growth of population and new settlements in part of its territory, and ongoing pressure from Britain. it seemed unlikely that it would continue to control the future of the West.\n\n20th century\n\nDepartment stores and diversification\n\nThe iconic department store today evolved from trading posts at the start of the 19th century, when they began to see demand for general merchandise grow rapidly. HBC soon expanded into the interior and set-up posts along river settlements that later developed into the modern cities of Winnipeg, Calgary and Edmonton. In 1857, the first sales shop was established in Fort Langley. This was followed by other sales shops in Fort Victoria (1859), Winnipeg (1881), Calgary (1884), Vancouver (1887), Vernon (1887), Edmonton (1890), Yorkton (1898), and Nelson (1902). The first of the grand \"original six\" department stores was built in Calgary in 1913. The other department stores that followed were in Edmonton, Vancouver, Victoria, Saskatoon, and Winnipeg.\n\nThe First World War interrupted a major remodelling and restoration of retail trade shops planned in 1912. Following the war, the company revitalized its fur-trade and real-estate activities, and diversified its operations by venturing into the oil business.\nToday, the department store business is the only remaining part of the company's operations, in the form of department stores under the Hudson's Bay brand.\n\nOil and gas operations\n\nThe company co-founded Hudson's Bay Oil and Gas Company (HBOG) in 1926 with Marland Oil Company (which merged with Conoco in 1929). HBOG expanded during the 1940s and 1950s, and in 1960 began shipping Canadian crude through a new link to the Glacier pipeline and on to the refinery in Billings, Montana. The company became the sixth-largest Canadian oil producer in 1967. In 1973, HBOG acquired a 35% stake in Siebens Oil and Gas, and, in 1979, it divested that interest. In 1980, it bought a controlling interest in Roxy Petroleum. In the 1980s, sales and oil prices slipped, while debt from acquisitions piled up which led to Hudson's Bay Company selling its 52.9% stake in HBOG to Dome Petroleum in 1981.\n\nRetail expansion\n\nIn 1960, the company acquired Morgan's allowing it to expand into Montreal, Toronto, Hamilton, and Ottawa. In 1965, HBC rebranded its department stores as The Bay. The Morgan's logo was changed to match the new visual identity. By 1972 the last of the former Morgan’s stores had been rebranded to Bay stores.\n\nIn 1970, on the company's 300th anniversary, as a result of punishing new British tax laws, the company relocated to Canada, and was rechartered as a Canadian business corporation under Canadian law, Head Office functions were transferred from London to Winnipeg. By 1974, as the company expanded into eastern Canada, head office functions were moved to Toronto.\n\nIn 1972, the company acquired the four-store Shop-Rite chain of catalogue stores. The chain was quickly expanded to 65 stores in Ontario, but closed in 1982 due to declining sales. In these stores, little merchandise was displayed; customers made their selections from catalogues, and staff would retrieve the merchandise from storerooms. The HBC also acquired Freimans department stores in Ottawa and converted them to The Bay.\n\nIn 1978, the Zellers discount store chain made a bid to acquire the HBC, but the HBC turned the tables and acquired Zellers. Also in 1978, Simpson's department stores were acquired by Hudson's Bay Company, and were converted to Bay stores in 1991. (The related chain Simpsons-Sears was not acquired by the Bay, but became Sears Canada in 1978.) In 1991, Simpsons disappeared, when the last Simpsons store was converted to the Bay banner.\n\nIn 1979, Canadian billionaire Kenneth Thomson won control of the company in a battle with George Weston Limited, and acquired a 75% stake for $400 million. Thomson sold the company's oil and gas business, financial services, distillery, and other interests for approximately $550 million, transforming the company into a leaner, more focused operation. In 1997, the Thomson family sold the last of its remaining shares.\n\nHudson's Bay Company reversed a formidable debt problem in 1987, by shedding non-strategic assets such as its wholesale division and getting completely out of the oil and gas business. HBC also sold its Canadian fur-auction business to Hudson's Bay Fur Sales Canada (now North American Fur Auctions). The Northern Stores Division was sold that same year to a group of investors and employees, which adopted The North West Company name three years later.\n\nThe HBC acquired Towers Department Stores in 1990, combining them with the Zellers chain, and Woodward's stores in 1993, converting them into Bay or Zellers stores. Kmart Canada was acquired in 1998 and merged with Zellers.\n\nIn 1991, the Bay agreed to stop retailing fur in response to complaints from people opposed to killing animals for this purpose. In 1997, the Bay reopened its fur salons to meet the demand of consumers.\n\n21st century\n\nIn December 2003, Maple Leaf Heritage Investments, a Nova Scotia-based company created to acquire shares of Hudson's Bay Company, announced that it was considering making an offer to acquire all or some of the common shares of Hudson's Bay Company. Maple Leaf Heritage Investments is a subsidiary of B-Bay Inc. Its CEO and chairman is American businesswoman Anita Zucker, widow of Jerry Zucker. Zucker had previously been the head of the Polymer Group, which acquired another Canadian institution, Dominion Textile.\n\nOn 26 January 2006, the HBC's board unanimously agreed to a bid of $15.25 CAD/share from Jerry Zucker, whose original bid was $14.75 CAD/share, ending a prolonged fight between the HBC and Zucker. The South Carolina billionaire financier was a longtime HBC minority shareholder. In a 9 March 2006 press release, the HBC announced that Zucker would replace Yves Fortier as governor and George Heller as CEO, becoming the first US citizen to lead the company. After Jerry Zucker's death the board named his widow, Anita Zucker, as HBC Governor and HBC Deputy-Governor Rob Johnston as CEO.\n\nOn 16 July 2008, the company was sold to NRDC Equity Partners, a private equity firm based in Purchase, New York, which already owned Lord & Taylor, the oldest luxury department store chain in the United States. The Canadian and U.S. holdings were transferred to NRDC Equity Partners' holding company, Hudson's Bay Trading Company, as of fall 2008.\n\nIn September 2011, the HBC began downsizing the Zellers chain with the announcement that it would sell the majority of the leases for its locations to the U.S.-based retailer Target Corporation and close all of their remaining locations by early 2013. Target used the acquisition of this real estate as a means to enable its entry in the Canadian market. HBC used the proceeds to allow it to pay down debt and to invest in growing its Hudson's Bay and Lord & Taylor banners. In January 2013, it was confirmed that only three of the remaining Zellers locations would remain open.\n\nOn 24 January 2012, the Financial Post reported that Richard Baker (owner of NDRC and governor of Hudson's Bay Company) had dissolved Hudson's Bay Trading Company and that the HBC would now also operate the Lord & Taylor chain. At the time, the company was run by President Bonnie Brooks. Baker remained governor and CEO of the business and Donald Watros stayed on as chief operating officer.\n\nIn October 2012, the HBC announced a $1.6 billion initial public offering (IPO); Baker planned to use the IPO to allow Canadian ownership to return to the company, and to help pay off debts with other partners. Additionally, the company also announced that it would re-brand The Bay department store chain as \"Hudson's Bay\".\n\nFrom 2004 to 2008, the HBC owned and operated a small chain of off-price stores called Designer Depot. Similar to the Winners and HomeSense retail format, Designer Depot did not meet sales expectations, and its nine stores were sold. Another HBC chain, Fields, was sold to a private firm in 2012. Established in 1950, Fields was acquired by Zellers in 1976. When Zellers was acquired by HBC in 1978, Fields became part of the HBC portfolio. Zellers is still owned by HBC but has been reduced to a chain of two liquidation stores following the sale of its lease portfolio to Target Canada in 2011. The Target Canada chain folded in 2015; these leases have since been returned to landlords or re-sold to other retailers.\n\nThe new Hudson's Bay brand was launched in March 2013, incorporating a new logo with an updated rendition of the classic Hudson's Bay Company coat of arms, designed to be modern and better reflect the company's heritage. Following the IPO, HBC had also introduced a new corporate logo of its own (reviving a wordmark from the original HBC flag), but the new logo was not intended to be a consumer-facing brand.\n\nOn 29 July 2013, Hudson's Bay Company announced that it would buy Saks Incorporated for US$2.9 billion, or $16 per share. The company also stated that as a result of the purchase, Canadian consumers would see Saks stores arriving in their country soon. After the purchase was finalized, HBC had a net loss of $124.2 million in the 2013 3Q due to the cost of the purchase and promotions.\n\nIn early 2017, the Hudson's Bay Company made an overture to Macy's for a potential takeover of the struggling department store. More recently it considered a purchase of the struggling Neiman Marcus Group Inc. It did not proceed with either deal. \n\nThe company also has retail operations in Europe, including 20 Hudson’s Bay stores in the Netherlands and five Saks Off Fifth stores in Germany as well as the 135 stores of the Galeria Kaufhof department store chain in Germany. The latter was acquired in 2015 in a deal that  included the Belgian Galeria Inno retail chain (that was operated by Kaufhof) and some other properties. On November 1, 2017, HBC received an unsolicited offer from Austrian firm SIGNA Holding for Kaufhof and other real estate. An unnamed source told CNBC that the value of the offer was approximately 3 billion euros. This information on the offer was also reiterated in a press release by activist shareholder Land & Buildings Investment Management who urged HBC to accept the offer; the company replied that the offer was incomplete and did not provide indication of financing for the deal.\n\nAt the time, HBC had recently sold the building that houses its Lord & Taylor store on Fifth Avenue in Manhattan to WeWork Property Advisors after pressure from Land & Buildings Investment Management. The deal also includes the use of  floors of certain HBC owned department stores in New York, Toronto, Vancouver and Germany as WeWork’s shared office workspaces. In late October, HBC was also considering the sale the building that houses its flagship Vancouver store. \n\nBy that time, CEO Gerald Storch was scheduled to leave HBC on November 1, with Richard Baker taking over as interim CEO; both CFO Paul Beesley (who was replaced by Edward Record) and Don Watros, president of HBC International, had departed earlier. All left the company during a time of intense pressure on the executive and directors from Land & Buildings Investment Management, an entity that owns less than 5% of HBC shares.\n\nOperations\n\nThe HBC is diversified into joint ventures and other types of business products. The HBC has credit card, mortgage, and personal insurance branches. These other products and services are joint partnerships with other corporations. The HBC also has other HBC Rewards corporate partners such as: Imperial Oil/Esso, M&M Meat Shops, Chapters/Indigo Books, Kelsey's/Montana's Restaurants, Thrifty Car Rental, Cineplex Entertainment Theatres, etc. HBC Rewards points can be redeemed in house or into corporate partners' gift cards and certificates. Points can also be converted to Air Miles.\n\nThe HBC is involved in community and charity activities. The HBC Rewards Community Program raises funds for community causes. The HBC Foundation is a charity agency involved in social issues and service. The HBC used to sponsor the annual HBC Run for Canada, a series of public-participation runs and walks held across the country on Canada Day to raise funds for Canadian athletes. The company discontinued this event in 2009.\n\nIn May 2016, Hudson's Bay Company announced that they are expanding their operations to the Netherlands and plan to open 20 new stores as part of their European expansion.\n\nOlympic outfitter\n\nThe HBC was the official outfitter of clothing for members of the Canadian Olympic team in 1936, 1960, 1964, 1968, 2006, 2008, 2010, 2012, 2014 and 2016. The sponsorship has been renewed through 2020. Since the late 2000s, HBC has used its status as the official Canadian Olympics team outfitter to gain global exposure, as part of a turnaround plan that included shedding under-performing brands and luring new high-end brands.\n\nOn 2 March 2005, the company was announced as the new clothing outfitter for the Canadian Olympic team, in a $100 million deal, providing apparel for the 2006, 2008, 2010, and 2012 Games, having outbid the existing Canadian Olympic wear-supplier, Roots Canada, which had supplied Canada's Olympic teams from 1998 to 2004. The Canadian Olympic collection is sold through The Bay (and Zellers until 2013 when the Zellers leases were sold to Target Canada).\n\nHBC's 2006 Winter Olympics and 2008 Summer Olympics uniforms and toques received a mixed reception for their multicoloured stripes (green, red, yellow, blue) which seemed to be not-so-subtle advertising for HBC rather than representing the Canadian Olympic team's traditional colours of red and white (with black as a secondary), in contrast to well-received Root's 1998 collection with its trendy red letter jackets and Poor Boy caps. HBC produced 80% to 90% of their Olympic clothes in China which was criticized, as Roots ensured that the Olympic clothes were made in Canada using Canadian material.\n\nHBC's apparel for the 2010 Winter Olympics held in Vancouver proved to be extremely successful, in part because Canada was the host country and their athletes had a record medal haul. The \"Red Mittens\" (red-and-white mittens featuring a large maple leaf) that were sold for $10 CAD, with one-third of the proceeds going to the Canadian Olympic Committee, proved very popular, as were the \"Canada\" hoodies.\n\nThe HBC's 2010 Winter Olympics apparel was also controversial due to a knitted, machine-made sweater that looked like a Cowichan sweater. After a meeting between HBC representatives and Cowichan Tribes, a compromise was made between the parties; knitters would have an opportunity to sell their sweaters at the downtown Vancouver HBC store, alongside the HBC imitations.\n\nLord Sebastian Coe, chairman of the 2012 London Olympic Games Organizing Committee, who attended the Vancouver Olympics, noted that the Canadians were passionate in embracing the Games with 'their \"Canada\" hoodies and their red mittens (of which 2.6 million pairs sold that year). HBC has continued to produce these red mittens for subsequent Olympic Games.\n\nArchives\n\nThe legacy of the HBC has been maintained in part by the detailed record-keeping and archiving of material by the company. Before 1974, the records of the HBC were kept in the London office headquarters. The HBC opened an archives department to researchers in 1931. In 1974, Hudson's Bay Company Archives (HBCA) were transferred from London and placed on deposit with the Manitoba archives in Winnipeg. The company granted public access to the collection the following year.\n\nOn 27 January 1994, the company’s archives were formally donated to the Archives of Manitoba.\n\nAt the time of the donation, the appraised value of the records was nearly $60 million. A foundation, Hudson's Bay Company History Foundation funded through the tax savings resulting from the donation, was established to support the operations of the HBC Archive as a division of the Archives of Manitoba, along with other activities and programs., More than two kilometers of filed documents and hundreds of microfilm reels are now stored in a special climate-controlled vault in the Manitoba Archives Building.\n\nIn 2007, Hudson's Bay Company Archives became part of the United Nations \"Memory of the World Programme\" project, under UNESCO. The records covered the HBC history from the founding of the company in 1670. The records contained business transactions, medical records, personal journals of officials, inventories, company reports, etc.\n\nCorporate governance\n\n, the members of the board of directors of Hudson's Bay Company are:\n\n* Richard A. Baker\n* Robert C. Baker\n* Eric Gross\n* Steven Langman\n* David G. Leith\n* William L. Mack\n* Lee S. Neibart\n* Denise Pickett\n* Wayne Pommen\n* Earl Rotman\n* Matthew Rubel\n* Andrea Wong\n\nCorporate hierarchy\n\nIn the 18th and 19th Centuries, Hudson's Bay Company operated with a very rigid hierarchy when it came to its employees. This hierarchy essentially broke down into two levels; the officers and the servants.  Comprising the officers were the factors, masters and chief traders, clerks and surgeons. The servants were the tradesmen, boatmen, and labourers. The officers essentially ran the fur trading posts.  They had many duties which included supervising the workers in their trade posts, valuing the furs, and keeping trade and post records.  In 1821, when Hudson's Bay Company and the North West Company merged, the hierarchy became even stricter and the lines between officers and servants became virtually impossible to cross. Officers in charge of individual trading posts had much responsibility because they were directly in charge of enforcing the policies made by the governor and committee (the board) of the company. One of these policies was the price of particular furs and trade goods.  These prices were called the Official and Comparative Standards. Made-Beaver, the quality measurement of the pelt, was the means of exchange used by Hudson's Bay Company to define the Official and Comparative Standards. Because the governor was stationed in London, England, they needed to have reliable officers managing the trade posts halfway around the world. Because the fur trade was a very dynamic market, HBC needed to have some form of flexibility when dealing with prices and traders. Price fluctuation was deferred to the officers in charge of the trade posts, and the head office recorded any difference between the company's standard and that set by the individual officers. Overplus, or any excess revenue gained by officers was strictly documented to insure that it wasn't being pocketed and taken from the company. This strict yet flexible hierarchy exemplifies how Hudson's Bay Company was able to be so successful while still having its central management and trade posts located so far apart.\n\n;Hierarchichal order pre-1821\n\n;Hierarchical order 1821–1871\n\nGovernors\n\nChronological list of Governors of the Hudson's Bay Company:\n\n# 1670–82  Prince Rupert of the Rhine\n# 1683–85  James Stuart, Duke of York – resigned as governor to become James II, King of England.\n# 1685–92  John Churchill, Earl of Marlborough\n# 1692–96  Sir Stephen Evance\n# 1696–1700  Sir William Trumbull\n# 1700–12  Sir Stephen Evance\n# 1712–43  Sir Bibye Lake\n# 1744–46  Benjamin Pitt\n# 1746–50  Thomas Knapp\n# 1750–60  Sir Atwell Lake\n# 1760–70  Sir William Baker\n# 1770–82  Sir Bibye Lake, Jr.\n# 1782–99  Samuel Wegg\n# 1799–1807  Sir James Winter Lake\n# 1807–12  William Mainwaring\n# 1812–22  Joseph Berens\n# 1822–52  Sir John Henry Pelly in 1826, Simpson becomes governor of the Canadian region.\n# 1852–56  Andrew Wedderburn Colvile\n# 1856–58  John Shepherd\n# 1858–63  Henry Hulse Berens\n# 1863–68  Sir Edmund Walker Head\n# 1868–69  John Wodehouse, 1st Earl of Kimberley\n# 1869–74  Sir Stafford Henry Northcote\n# 1874–80  George Joachim Goschen\n# 1880–89  Eden Colvile\n# 1889–1914  Donald Alexander Smith\n# 1914–15  Sir Thomas Skinner\n# 1916–25  Sir Robert Molesworth Kindersley\n# 1925–31  Charles Vincent Sale\n# 1931–52  Sir Patrick Ashley Cooper – first governor to visit HBC operations in Canada.\n# 1952–65  William Keswick\n# 1965–70  Derick Heathcoat-Amory\n# 1970–82  George T. Richardson\n# 1982–94  Donald S. McGiverin\n# 1994–97  David E. Mitchell\n# 1997–2006  L. Yves Fortier\n# 2006–08  Jerry Zucker\n# 2008  Anita Zucker – first female governor.\n# 2008–present  Richard Baker\n\nMiscellany\n\nRent obligation under charter\n\nUnder the charter establishing Hudson's Bay Company, the company was required to give two elk skins and two black beaver pelts to the English king, then Charles II, or his heirs, whenever the monarch visited Rupert's Land. The exact text from the 1670 Charter reads:\n\nThe ceremony was first conducted with the Prince of Wales (the future Edward VIII) in 1927, then with King George VI in 1939, and last with his daughter, Queen Elizabeth II in 1959 and 1970. On the last such visit, the pelts were given in the form of two live beavers, which the Queen donated to the Winnipeg Zoo in Assiniboine Park. However, when the company permanently moved its headquarters to Canada, the Charter was amended to remove the rent obligation. Each of the four \"rent ceremonies\" took place in or around Winnipeg.\n\nNotable HBC explorers, builders, and associates\n\n* James Knight (c. 1640 – c. 1721) was a director of Hudson's Bay Company and an explorer who died in an expedition to the Northwest Passage.\n* Henry Kelsey (c. 1667 – 1 November 1724), a.k.a. the Boy Kelsey, was an English fur trader, explorer, and sailor who played an important role in establishing Hudson's Bay Company in Canada. In 1690, Henry Kelsey embarked on a 2-year exploration journey that made him the first white man to see buffalo.\n* Thanadelthur (c. 1697—5 February 1717) was a woman of the Chipewyan nation who served as a guide and interpreter for Hudson's Bay Company.\n* Samuel Hearne (1745–1792) was an English explorer, fur-trader, author, and naturalist. In 1774, Hearne built Cumberland House for the Hudson’s Bay Company, its first interior trading post and the first permanent settlement in present Saskatchewan.\n* David Thompson (30 April 1770 – 10 February 1857) was a British-Canadian fur trader that worked for both the Hudson’s Bay Company and the North West Trading Company. He is best known for his extensive explorations and map-making activities. He mapped almost half of North America between the 46th and 60th parallels, from the St.Lawrence and Great Lakes all the way to the Pacific.\n* Thomas Douglas, Lord Selkirk (20 June 1771 – 8 April 1820) was a Scottish peer. He was a Scottish philanthropist who, as HBC’s majority shareholder, arranged to purchase land at Red River to establish a colony for dispossessed Scottish immigrants.\n* Isobel Gunn or Isabella Gunn (c. 1780? – 7 November 1861), also known as John Fubbister or Mary Fubbister, was a Scottish labourer employed by Hudson's Bay Company (HBC), noted for having passed herself as a man, thereby becoming, not just a pioneer of feminism, but the first European woman to travel to Rupert's Land, now part of Western Canada.\n* George Simpson (1787 – 7 September 1860) was the Canadian governor of Hudson's Bay Company during the period of its greatest power, a period which began in 1821 following the company’s merger with the North West Trading Company.\n* Donald Smith, 1st Baron Strathcona and Mount Royal, at various times Chief Factor of the Labrador district, Commissioner of the Montreal district, and President of the Council of the Northern Department, who pacified Louis Riel during the Red River Rebellion of 1870, thus enabling the transfer of Rupert's Land from the HBC to the fledgling government of Canada. Later, he became Governor of the HBC.\n* Dr. John Rae (Inuktitut Aglooka ᐊᒡᓘᑲ English: \"long strider\") (30 September 1813 – 22 July 1893) was a Scottish doctor who explored Northern Canada, surveyed parts of the Northwest Passage and reported the fate of the Franklin Expedition.\n* William Keswick and grandson Sir William Johnstone Keswick served at HBC; the former as a director and later as governor from 1952 to 1965. The Keswick family are the Scottish business dynasty that controls Hong Kong-based Jardine Matheson, one of the original British trading houses or Hongs in British Hong Kong.\n\nHBC sternwheelers and steamships\n\n* Beaver (1835–74)\n* Otter (1852–95)\n* Anson Northup (1859–60)\n* Caledonia (1891–98) – She ran aground on rocks at Port Simpson during a storm and her hull was destroyed. Her engines were put into the Caledonia 2\n* Caledonia (2) (1898–1909) – Her machinery was from the Caledonia 1\n* Mount Royal (1902–07)\n* Princess Louise (1878–83)\n* Strathcona (1900)\n* Port Simpson (1907–12)\n* Hazelton (1907–12)\n* Distributor (1920–48)\n\nRivals\n\nThe HBC is the only European trading company to have survived and outlived all its rivals.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hudson's Bay Company" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13297" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Hudson's Bay Company (HBC; ), is a Canadian retail business group. A fur trading business for much of its existence, HBC now owns and operates retail stores in Canada, the United States, and parts of Europe, including Belgium, The Netherlands, and Germany. The company's namesake business division is Hudson's Bay, commonly referred to as The Bay (La Baie in French). Other divisions include Galeria Kaufhof, Gilt, Home Outfitters, Lord & Taylor, and Saks Fifth Avenue. HBC's head office was in the Simpson Tower in Toronto, but it relocated northwest of Toronto to Brampton, Ontario. The company is listed on the Toronto Stock Exchange under the symbol \"HBC\".\n\nThe company was incorporated by English royal charter in 1670 as The Governor and Company of Adventurers of England trading into Hudson's Bay. It functioned as the de facto government in parts of North America before European states and later the United States laid claim to some of those territories. It was once the world's largest landowner, controlling the area of the Hudson Bay watershed, known as Rupert's Land, which has 15% of North American acreage. From its long-time headquarters at York Factory on Hudson Bay, the company controlled the fur trade throughout much of the English and later British-controlled North America for several centuries. Undertaking early exploration, its traders and trappers forged relationships with many groups of aboriginal peoples. Its network of trading posts formed the nucleus for later official authority in many areas of Western Canada and the United States. In the late 19th century, with its signing of the Deed of Surrender, its vast territory became the largest portion of the newly formed Dominion of Canada, in which the company was the largest private landowner.\n\nBy the mid-19th century, the company evolved into a mercantile business selling everything from furs to fine homeware. They \"quickly introduced a new type of client to the HBC – one that shopped for pleasure and not with skins\"; the retail era had begun as the HBC began establishing stores across the country. \nIn July 2008, HBC was acquired by NRDC Equity Partners, which also owns the upmarket American department store Lord & Taylor. From 2008 to 2012, the HBC was run through a holding company of NRDC, Hudson's Bay Trading Company, which was dissolved on 23 January 2012. Since 2012, the HBC directly oversees its Canadian subsidiaries Hudson's Bay (formerly The Bay) and Home Outfitters, in addition to the operations of Lord & Taylor in the United States.\n\nOn 29 July 2013, the HBC announced its takeover of Saks, Inc., operator of the US Saks Fifth Avenue brand. The merger was completed on 3 November 2013. In September 2015, HBC acquired the German department store chain Galeria Kaufhof and its Belgian subsidiary from Metro Group for US$3.2 billion. In late July 2017, German trade credit insurance Euler Hermes announced that it has drastically reduced its coverage for Kaufhof; which in general means that the rating and credit worthiness of a company is severely questioned.[http://www.wiwo.de/unternehmen/handel/euler-hermes-laesst-kaufhof-fallen-was-diese-krise-so-gefaehrlich-macht/20112978.html Was diese Krise so gefährlich macht], WIWO, 27 July 2017\n\nIn May 2016, HBC announced it would expand to the Netherlands by taking over up to 20 former Vroom & Dreesmann sites by 2017. V&D was a historic Dutch department store chain that went bankrupt and shut down in early 2016. HBC said the expansion would cost CA$340 million and create 2,500 jobs in the stores and another 2,500 temporary construction jobs. The Dutch stores would operate under the \"Hudson's Bay\" and \"Saks Off Fifth\" brands.\n\nIn January 2016, HBC announced it would also expand deeper into digital space with its acquisition of online flash sales site, the Gilt Groupe, for US$250 million.\n\nHistory\n\n17th century\n\nIn the 17th century the French had a de facto monopoly on the Canadian fur trade with their colony of New France. Two French traders, Pierre-Esprit Radisson and Médard des Groseilliers (Médard de Chouart, Sieur des Groseilliers), Radisson's brother-in-law, learned from the Cree that the best fur country lay north and west of Lake Superior, and that there was a \"frozen sea\" still further north. Assuming this was Hudson Bay, they sought French backing for a plan to set up a trading post on the Bay, to reduce the cost of moving furs overland. According to Peter C. Newman, \"concerned that exploration of the Hudson Bay route might shift the focus of the fur trade away from the St. Lawrence River, the French governor\", Marquis d'Argenson (in office 1658–61), \"refused to grant the coureurs de bois permission to scout the distant territory\". Despite this refusal, in 1659 Radisson and Groseilliers set out for the upper Great Lakes basin. A year later they returned with premium furs, evidence of the potential of the Hudson Bay region. Subsequently, they were arrested for trading without a licence and fined, and their furs were confiscated by the government.\n\nDetermined to establish trade in the Hudson Bay, Radisson and Groseilliers approached a group of English colonial businessmen in Boston, Massachusetts to help finance their explorations. The Bostonians agreed on the plan's merits but their speculative voyage in 1663 failed when their ship ran into pack ice in Hudson Strait. Boston-based English commissioner Colonel George Cartwright learned of the expedition and brought the two to England to raise financing. Radisson and Groseilliers arrived in London in 1665 at the height of the Great Plague. Eventually, the two met and gained the sponsorship of Prince Rupert. Prince Rupert also introduced the two to his cousin, King Charles II. In 1668 the English expedition acquired two ships, the Nonsuch and the Eaglet, to explore possible trade into Hudson Bay. Groseilliers sailed on the Nonsuch, commanded by Captain Zachariah Gillam, while the Eaglet was commanded by Captain William Stannard and accompanied by Radisson. On 5 June 1668, both ships left port at Deptford, England, but the Eaglet was forced to turn back off the coast of Ireland.\n\nThe Nonsuch continued to James Bay, the southern portion of Hudson Bay, where its explorers founded, in 1668, the first fort on Hudson Bay, Charles Fort at the mouth of the Rupert River. (It was later known as Rupert House, and developed as the community of present-day Waskaganish, Quebec.) Both the fort and the river were named after the sponsor of the expedition, Prince Rupert of the Rhine, one of the major investors and soon to be the new company's first governor. After a successful trading expedition over the winter of 1668–69, Nonsuch returned to England on 9 October 1669 with the first cargo of fur resulting from trade in Hudson Bay. The bulk of the fur – worth £1,233 – was sold to Thomas Glover, one of London's most prominent furriers. This and subsequent purchases by Glover made it clear the fur trade in Hudson Bay was viable.\n\nThe Governor and Company of Adventurers of England Trading into Hudson's Bay was incorporated on 2 May 1670, with a royal charter from King Charles II. The charter granted the company a monopoly over the region drained by all rivers and streams flowing into Hudson Bay in northern Canada. The area was named  \"Rupert's Land\" after Prince Rupert, the first governor of the company appointed by the King. This drainage basin of Hudson Bay constitutes , comprising over one-third of the area of modern-day Canada and stretches into the present-day north-central United States. The specific boundaries were unknown at the time. Rupert's Land would eventually become Canada's largest land \"purchase\" in the 19th century.\n\nThe HBC established six posts between 1668 and 1717.  Rupert House(1668, southeast), Moose Factory (1673, south) and Fort Albany, Ontario (1679, west) were erected on James Bay; three other posts were established on the western shore of Hudson Bay proper: Fort Severn (1689), York Factory (1684) and Fort Churchill (1717).  Inland posts were not built until 1774. After 1774, York Factory became the main post because of its convenient access to the vast interior waterway systems of the Saskatchewan and Red rivers. Called \"factories\" (because the \"factor,\" i.e., a person acting as a mercantile agent did business from there), these posts operated in the manner of the Dutch fur trading operations in New Netherlands. By  adoption of the Standard of Trade in the 18th century, the HBC ensured consistent pricing throughout Rupert's Land. A means of exchange arose based on the \"Made Beaver\" (MB); a prime pelt, worn for a year and ready for processing: \"the prices of all trade goods were set in values of Made Beaver (MB) with other animal pelts, such as squirrel, otter and moose quoted in their MB (made beaver) equivalents.  For example, two otter pelts might equal 1 MB\".\n\nDuring the fall and winter, First Nations men and European trappers accomplished the vast majority of the animal trapping and pelt preparation. They travelled by canoe and on foot to the forts to sell their pelts. In exchange they typically received popular trade goods such as knives, kettles, beads, needles, and the Hudson's Bay point blanket. The arrival of the First Nations trappers was one of the high points of the year, met with pomp and circumstance. The highlight was very formal, an almost ritualized \"Trading Ceremony\" between the Chief Trader and the Captain of the aboriginal contingent who traded on their behalf. During the initial years of the fur trade, prices for items varied from post to post.\n\nThe early coastal factory model of the English contrasted with the system of the French. They established an extensive system of inland posts at native villages, and sent traders to live among the tribes of the region, learning their languages and often forming alliances through marriages with indigenous women. In March 1686, the French sent a raiding party under the Chevalier des Troyes more than  to capture the HBC posts along James Bay. The French appointed Pierre Le Moyne d'Iberville, who had shown great heroism during the raids, as commander of the company's captured posts. In 1687 an English attempt to resettle Fort Albany failed due to strategic deceptions by d'Iberville. After 1688 England and France were officially at war, and the conflict played out in North America as well. D'Iberville raided Fort Severn in 1690 but did not attempt to raid the well-defended local headquarters at York Factory. In 1693 the HBC recovered Fort Albany; d'Iberville captured York Factory in 1694, but the company recovered it the next year.\n\nIn 1697, d'Iberville again commanded a French naval raid on York Factory. On the way to the fort, he defeated three ships of the Royal Navy in the Battle of Hudson's Bay (5 September 1697), the largest naval battle in the history of the North American Arctic. D'Iberville's depleted French force captured York Factory by laying siege to the fort and pretending to be a much larger army. The French retained all of the outposts except Fort Albany until 1713. (A small French and Indian force attacked Fort Albany again in 1709 during Queen Anne's War but was unsuccessful. The economic consequences of the French possession of these posts for the company were significant; HBC did not pay any dividends for more than 20 years. See Anglo-French conflicts on Hudson Bay.\n\n18th century\n\nWith the ending of the Nine Years' War in 1697, and the War of the Spanish Succession in 1713 with the signing of the Treaty of Utrecht, France had gotten the short end of the stick. Among the treaty's many provisions, it required France to relinquish all claims to Great Britain on the Hudson Bay, which again became a British possession. (The Kingdom of Great Britain had been established following the union of Scotland and England in 1707). After the treaty, the HBC built Prince of Wales Fort, a stone star fort at the mouth of the nearby Churchill River.  In 1782, during the American Revolutionary War, a French squadron under Jean-François de Galaup, comte de Lapérouse captured and demolished York Factory and Prince of Wales Fort in support of the American rebels.\n\nIn its trade with native peoples, Hudson's Bay Company exchanged wool blankets, called Hudson's Bay point blankets, for the beaver pelts trapped by aboriginal hunters. By 1700, point blankets accounted for more than  60% of the trade. The number of indigo stripes (a.k.a. points) woven into the blankets identified its finished size. A long-held misconception is that the number of stripes was related to its value in beaver pelts.\n\nA parallel may be drawn between the HBC's control over Rupert's Land with the trade monopoly and government functions enjoyed by the Honourable East India Company over India during roughly the same period. The HBC invested £10,000 in the East India Company in 1732, which it viewed as a major competitor.\n\nHudson's Bay Company's first inland trading post was established by Samuel Hearne in 1774 with Cumberland House, Saskatchewan.\n\nIn 1779, other traders founded the North West Company (NWC) in Montreal as a seasonal partnership to provide more capital and to continue competing with the HBC. It became operative for the outfit of 1780 and was the first joint-stock company in Canada and possibly North America. The agreement lasted one year. A second agreement established in 1780 had a three-year term. The company became a permanent entity in 1783. By 1784, the NWC had begun to make serious inroads into the HBC's profits.\n\n19th century\n\nIn 1821, the North West Company of Montreal and Hudson's Bay Company were forcibly merged by intervention of the British government to put an end to often-violent competition. 175 posts, 68 of them the HBC's, were reduced to 52 for efficiency and because many were redundant as a result of the rivalry and were inherently unprofitable. Their combined territory was extended by a licence to the North-Western Territory, which reached to the Arctic Ocean in the north and, with the creation of the Columbia Department in the Pacific Northwest, to the Pacific Ocean in the west. The NWC's regional headquarters at Fort George (Fort Astoria) was relocated to Fort Vancouver on the north bank of the Columbia River; it became the HBC base of operations on the Pacific Slope.\n\nBefore the merger, the employees of the HBC, unlike those of the North West Company, did not participate in its profits. After the merger, with all operations under the management of Sir George Simpson (1826–60), the company had a corps of commissioned officers: 25 chief factors and 28 chief traders, who shared in the company's profits during the monopoly years. Its trade covered , and it had 1,500 contract employees.\n\nThe career progression for officers, together referred to as the Commissioned Gentlemen, was to enter the company as a fur trader. Typically, they were men who had the capital to invest in starting up their trading. They sought to be promoted to the rank of Chief Trader. A Chief Trader would be in charge of an individual post and was entitled to one share of the company's profits. Chief Factors sat in council with the Governors and were the heads of districts. They were entitled to two shares of the company's profits or losses. The average income of a Chief Trader was £360 and that of a Chief Factor was £720.\n\nAlthough the HBC maintained a monopoly on the fur trade during the early to mid-19th century, there was competition from James Sinclair and Andrew McDermot (Dermott), independent traders in the Red River Colony. They shipped furs by the Red River Trails to Norman Kittson a buyer in the United States. In addition, Americans controlled the Maritime fur trade on the Northwest Coast until the 1830s.\n\nThroughout the 1820s and 1830s, the HBC controlled nearly all trading operations in the Pacific Northwest, based at the company headquarters at Fort Vancouver on the Columbia River.  Although claims to the region were by agreement in abeyance, commercial operating rights were nominally shared by the United States and Britain through the Anglo-American Convention of 1818, but company policy, enforced via Chief Factor John McLoughlin of the company's Columbia District, was to discourage U.S. settlement of the territory. The company's effective monopoly on trade virtually forbade any settlement in the region. It established Fort Boise in 1834 (in present-day southwestern Idaho) to compete with the American Fort Hall, 483 km to the east. In 1837, it purchased Fort Hall, also along the route of the Oregon Trail. The outpost director displayed the abandoned wagons of discouraged settlers to those seeking to move west along the trail.\n\nThe company's stranglehold on the region was broken by the first successful large wagon train to reach Oregon in 1843, led by Marcus Whitman. In the years that followed, thousands of emigrants poured into the Willamette Valley of Oregon. In 1846, the United States acquired full authority south of the 49th parallel; the most settled areas of the Oregon Country were south of the Columbia River in what is now Oregon.  McLoughlin, who had once turned away would-be settlers as company director, then welcomed them from his general store at Oregon City. He was later proclaimed the \"Father of Oregon\". The company retains no presence today in what is now the United States portion of the Pacific Northwest.\n\nDuring the 1820s and 1830s, HBC trappers were deeply involved in the early exploration and development of Northern California.  Company trapping brigades were sent south from Fort Vancouver, along what became known as the Siskiyou Trail, into Northern California as far south as the San Francisco Bay Area, where the company operated a trading post at Yerba Buena (San Francisco). These trapping brigades in Northern California faced serious risks, and were often the first to explore relatively uncharted territory. They included the lesser known Peter Skene Ogden and Samuel Black.\n\nBetween 1820 and 1870, the HBC issued its own paper money. The notes, denominated in pounds sterling, were printed in London and issued at the York Factory, Fort Garry and the Red River Colony.  For forty or so years beginning in 1870, the company employed paddle wheel steamships on the rivers of the prairies.\n\nThe Guillaume Sayer Trial in 1849 contributed to the end of the HBC monopoly. Sayer, a Métis trapper and trader, was accused of illegal trading in furs. The Court of Assiniboia brought Sayer to trial, before a jury of HBC officials and supporters. During the trial, a crowd of armed Métis men led by Louis Riel, Sr. gathered outside the courtroom. Although Sayer was found guilty of illegal trade, having evaded the HBC monopoly, Judge Adam Thom did not levy a fine or punishment. Some accounts attributed that to the intimidating armed crowd gathered outside the courthouse. With the cry, Le commerce est libre! Le commerce est libre! (\"Trade is free! Trade is free!\"), the Métis loosened the HBC's previous control of the courts, which had enforced their monopoly on the settlers of Red River.\n\nAnother factor was the findings of the Palliser Expedition of 1857 to 1860, led by Captain John Palliser. He surveyed the area of the prairies and wilderness from Lake Superior to the southern passes of the Rocky Mountains. Although he recommended against settlement of the region, the report sparked a debate. It ended the myth publicized by Hudson's Bay Company: that the Canadian West was unfit for agricultural settlement. In 1863, the International Financial Society became the majority shareholders of the HBC.\n\nIn 1869, after rejecting the American government offer of , the company approved the return of Rupert’s Land to Britain. The government gave it to Canada and loaned the new country the £300,000 required to compensate HBC for its losses. The deal, known as The Deed of Surrender, came into force the following year. The resulting territory, now known as the Northwest Territories, was brought under Canadian jurisdiction under the terms of the Rupert's Land Act 1868, enacted by the Parliament of the United Kingdom. The Deed enabled the admission of the fifth province, Manitoba, to the Confederation on 15 July 1870, the same day that the deed itself came into force.\n\nDuring the 19th century the Hudson Bay's Company went through great changes in response to such factors as growth of population and new settlements in part of its territory, and ongoing pressure from Britain. it seemed unlikely that it would continue to control the future of the West.\n\n20th century\n\nDepartment stores and diversification\n\nThe iconic department store today evolved from trading posts at the start of the 19th century, when they began to see demand for general merchandise grow rapidly. HBC soon expanded into the interior and set-up posts along river settlements that later developed into the modern cities of Winnipeg, Calgary and Edmonton. In 1857, the first sales shop was established in Fort Langley. This was followed by other sales shops in Fort Victoria (1859), Winnipeg (1881), Calgary (1884), Vancouver (1887), Vernon (1887), Edmonton (1890), Yorkton (1898), and Nelson (1902). The first of the grand \"original six\" department stores was built in Calgary in 1913. The other department stores that followed were in Edmonton, Vancouver, Victoria, Saskatoon, and Winnipeg.\n\nThe First World War interrupted a major remodelling and restoration of retail trade shops planned in 1912. Following the war, the company revitalized its fur-trade and real-estate activities, and diversified its operations by venturing into the oil business.\nToday, the department store business is the only remaining part of the company's operations, in the form of department stores under the Hudson's Bay brand.\n\nOil and gas operations\n\nThe company co-founded Hudson's Bay Oil and Gas Company (HBOG) in 1926 with Marland Oil Company (which merged with Conoco in 1929). HBOG expanded during the 1940s and 1950s, and in 1960 began shipping Canadian crude through a new link to the Glacier pipeline and on to the refinery in Billings, Montana. The company became the sixth-largest Canadian oil producer in 1967. In 1973, HBOG acquired a 35% stake in Siebens Oil and Gas, and, in 1979, it divested that interest. In 1980, it bought a controlling interest in Roxy Petroleum. In the 1980s, sales and oil prices slipped, while debt from acquisitions piled up which led to Hudson's Bay Company selling its 52.9% stake in HBOG to Dome Petroleum in 1981.\n\nRetail expansion\n\nIn 1960, the company acquired Morgan's allowing it to expand into Montreal, Toronto, Hamilton, and Ottawa. In 1965, HBC rebranded its department stores as The Bay. The Morgan's logo was changed to match the new visual identity. By 1972 the last of the former Morgan’s stores had been rebranded to Bay stores.\n\nIn 1970, on the company's 300th anniversary, as a result of punishing new British tax laws, the company relocated to Canada, and was rechartered as a Canadian business corporation under Canadian law, Head Office functions were transferred from London to Winnipeg. By 1974, as the company expanded into eastern Canada, head office functions were moved to Toronto.\n\nIn 1972, the company acquired the four-store Shop-Rite chain of catalogue stores. The chain was quickly expanded to 65 stores in Ontario, but closed in 1982 due to declining sales. In these stores, little merchandise was displayed; customers made their selections from catalogues, and staff would retrieve the merchandise from storerooms. The HBC also acquired Freimans department stores in Ottawa and converted them to The Bay.\n\nIn 1978, the Zellers discount store chain made a bid to acquire the HBC, but the HBC turned the tables and acquired Zellers. Also in 1978, Simpson's department stores were acquired by Hudson's Bay Company, and were converted to Bay stores in 1991. (The related chain Simpsons-Sears was not acquired by the Bay, but became Sears Canada in 1978.) In 1991, Simpsons disappeared, when the last Simpsons store was converted to the Bay banner.\n\nIn 1979, Canadian billionaire Kenneth Thomson won control of the company in a battle with George Weston Limited, and acquired a 75% stake for $400 million. Thomson sold the company's oil and gas business, financial services, distillery, and other interests for approximately $550 million, transforming the company into a leaner, more focused operation. In 1997, the Thomson family sold the last of its remaining shares.\n\nHudson's Bay Company reversed a formidable debt problem in 1987, by shedding non-strategic assets such as its wholesale division and getting completely out of the oil and gas business. HBC also sold its Canadian fur-auction business to Hudson's Bay Fur Sales Canada (now North American Fur Auctions). The Northern Stores Division was sold that same year to a group of investors and employees, which adopted The North West Company name three years later.\n\nThe HBC acquired Towers Department Stores in 1990, combining them with the Zellers chain, and Woodward's stores in 1993, converting them into Bay or Zellers stores. Kmart Canada was acquired in 1998 and merged with Zellers.\n\nIn 1991, the Bay agreed to stop retailing fur in response to complaints from people opposed to killing animals for this purpose. In 1997, the Bay reopened its fur salons to meet the demand of consumers.\n\n21st century\n\nIn December 2003, Maple Leaf Heritage Investments, a Nova Scotia-based company created to acquire shares of Hudson's Bay Company, announced that it was considering making an offer to acquire all or some of the common shares of Hudson's Bay Company. Maple Leaf Heritage Investments is a subsidiary of B-Bay Inc. Its CEO and chairman is American businesswoman Anita Zucker, widow of Jerry Zucker. Zucker had previously been the head of the Polymer Group, which acquired another Canadian institution, Dominion Textile.\n\nOn 26 January 2006, the HBC's board unanimously agreed to a bid of $15.25 CAD/share from Jerry Zucker, whose original bid was $14.75 CAD/share, ending a prolonged fight between the HBC and Zucker. The South Carolina billionaire financier was a longtime HBC minority shareholder. In a 9 March 2006 press release, the HBC announced that Zucker would replace Yves Fortier as governor and George Heller as CEO, becoming the first US citizen to lead the company. After Jerry Zucker's death the board named his widow, Anita Zucker, as HBC Governor and HBC Deputy-Governor Rob Johnston as CEO.\n\nOn 16 July 2008, the company was sold to NRDC Equity Partners, a private equity firm based in Purchase, New York, which already owned Lord & Taylor, the oldest luxury department store chain in the United States. The Canadian and U.S. holdings were transferred to NRDC Equity Partners' holding company, Hudson's Bay Trading Company, as of fall 2008.\n\nIn September 2011, the HBC began downsizing the Zellers chain with the announcement that it would sell the majority of the leases for its locations to the U.S.-based retailer Target Corporation and close all of their remaining locations by early 2013. Target used the acquisition of this real estate as a means to enable its entry in the Canadian market. HBC used the proceeds to allow it to pay down debt and to invest in growing its Hudson's Bay and Lord & Taylor banners. In January 2013, it was confirmed that only three of the remaining Zellers locations would remain open.\n\nOn 24 January 2012, the Financial Post reported that Richard Baker (owner of NDRC and governor of Hudson's Bay Company) had dissolved Hudson's Bay Trading Company and that the HBC would now also operate the Lord & Taylor chain. At the time, the company was run by President Bonnie Brooks. Baker remained governor and CEO of the business and Donald Watros stayed on as chief operating officer.\n\nIn October 2012, the HBC announced a $1.6 billion initial public offering (IPO); Baker planned to use the IPO to allow Canadian ownership to return to the company, and to help pay off debts with other partners. Additionally, the company also announced that it would re-brand The Bay department store chain as \"Hudson's Bay\".\n\nFrom 2004 to 2008, the HBC owned and operated a small chain of off-price stores called Designer Depot. Similar to the Winners and HomeSense retail format, Designer Depot did not meet sales expectations, and its nine stores were sold. Another HBC chain, Fields, was sold to a private firm in 2012. Established in 1950, Fields was acquired by Zellers in 1976. When Zellers was acquired by HBC in 1978, Fields became part of the HBC portfolio. Zellers is still owned by HBC but has been reduced to a chain of two liquidation stores following the sale of its lease portfolio to Target Canada in 2011. The Target Canada chain folded in 2015; these leases have since been returned to landlords or re-sold to other retailers.\n\nThe new Hudson's Bay brand was launched in March 2013, incorporating a new logo with an updated rendition of the classic Hudson's Bay Company coat of arms, designed to be modern and better reflect the company's heritage. Following the IPO, HBC had also introduced a new corporate logo of its own (reviving a wordmark from the original HBC flag), but the new logo was not intended to be a consumer-facing brand.\n\nOn 29 July 2013, Hudson's Bay Company announced that it would buy Saks Incorporated for US$2.9 billion, or $16 per share. The company also stated that as a result of the purchase, Canadian consumers would see Saks stores arriving in their country soon. After the purchase was finalized, HBC had a net loss of $124.2 million in the 2013 3Q due to the cost of the purchase and promotions.\n\nIn early 2017, the Hudson's Bay Company made an overture to Macy's for a potential takeover of the struggling department store. More recently it considered a purchase of the struggling Neiman Marcus Group Inc. It did not proceed with either deal. \n\nThe company also has retail operations in Europe, including 20 Hudson’s Bay stores in the Netherlands and five Saks Off Fifth stores in Germany as well as the 135 stores of the Galeria Kaufhof department store chain in Germany. The latter was acquired in 2015 in a deal that  included the Belgian Galeria Inno retail chain (that was operated by Kaufhof) and some other properties. On November 1, 2017, HBC received an unsolicited offer from Austrian firm SIGNA Holding for Kaufhof and other real estate. An unnamed source told CNBC that the value of the offer was approximately 3 billion euros. This information on the offer was also reiterated in a press release by activist shareholder Land & Buildings Investment Management who urged HBC to accept the offer; the company replied that the offer was incomplete and did not provide indication of financing for the deal.\n\nAt the time, HBC had recently sold the building that houses its Lord & Taylor store on Fifth Avenue in Manhattan to WeWork Property Advisors after pressure from Land & Buildings Investment Management. The deal also includes the use of  floors of certain HBC owned department stores in New York, Toronto, Vancouver and Germany as WeWork’s shared office workspaces. In late October, HBC was also considering the sale the building that houses its flagship Vancouver store. \n\nBy that time, CEO Gerald Storch was scheduled to leave HBC on November 1, with Richard Baker taking over as interim CEO; both CFO Paul Beesley (who was replaced by Edward Record) and Don Watros, president of HBC International, had departed earlier. All left the company during a time of intense pressure on the executive and directors from Land & Buildings Investment Management, an entity that owns less than 5% of HBC shares.\n\nOperations\n\nThe HBC is diversified into joint ventures and other types of business products. The HBC has credit card, mortgage, and personal insurance branches. These other products and services are joint partnerships with other corporations. The HBC also has other HBC Rewards corporate partners such as: Imperial Oil/Esso, M&M Meat Shops, Chapters/Indigo Books, Kelsey's/Montana's Restaurants, Thrifty Car Rental, Cineplex Entertainment Theatres, etc. HBC Rewards points can be redeemed in house or into corporate partners' gift cards and certificates. Points can also be converted to Air Miles.\n\nThe HBC is involved in community and charity activities. The HBC Rewards Community Program raises funds for community causes. The HBC Foundation is a charity agency involved in social issues and service. The HBC used to sponsor the annual HBC Run for Canada, a series of public-participation runs and walks held across the country on Canada Day to raise funds for Canadian athletes. The company discontinued this event in 2009.\n\nIn May 2016, Hudson's Bay Company announced that they are expanding their operations to the Netherlands and plan to open 20 new stores as part of their European expansion.\n\nOlympic outfitter\n\nThe HBC was the official outfitter of clothing for members of the Canadian Olympic team in 1936, 1960, 1964, 1968, 2006, 2008, 2010, 2012, 2014 and 2016. The sponsorship has been renewed through 2020. Since the late 2000s, HBC has used its status as the official Canadian Olympics team outfitter to gain global exposure, as part of a turnaround plan that included shedding under-performing brands and luring new high-end brands.\n\nOn 2 March 2005, the company was announced as the new clothing outfitter for the Canadian Olympic team, in a $100 million deal, providing apparel for the 2006, 2008, 2010, and 2012 Games, having outbid the existing Canadian Olympic wear-supplier, Roots Canada, which had supplied Canada's Olympic teams from 1998 to 2004. The Canadian Olympic collection is sold through The Bay (and Zellers until 2013 when the Zellers leases were sold to Target Canada).\n\nHBC's 2006 Winter Olympics and 2008 Summer Olympics uniforms and toques received a mixed reception for their multicoloured stripes (green, red, yellow, blue) which seemed to be not-so-subtle advertising for HBC rather than representing the Canadian Olympic team's traditional colours of red and white (with black as a secondary), in contrast to well-received Root's 1998 collection with its trendy red letter jackets and Poor Boy caps. HBC produced 80% to 90% of their Olympic clothes in China which was criticized, as Roots ensured that the Olympic clothes were made in Canada using Canadian material.\n\nHBC's apparel for the 2010 Winter Olympics held in Vancouver proved to be extremely successful, in part because Canada was the host country and their athletes had a record medal haul. The \"Red Mittens\" (red-and-white mittens featuring a large maple leaf) that were sold for $10 CAD, with one-third of the proceeds going to the Canadian Olympic Committee, proved very popular, as were the \"Canada\" hoodies.\n\nThe HBC's 2010 Winter Olympics apparel was also controversial due to a knitted, machine-made sweater that looked like a Cowichan sweater. After a meeting between HBC representatives and Cowichan Tribes, a compromise was made between the parties; knitters would have an opportunity to sell their sweaters at the downtown Vancouver HBC store, alongside the HBC imitations.\n\nLord Sebastian Coe, chairman of the 2012 London Olympic Games Organizing Committee, who attended the Vancouver Olympics, noted that the Canadians were passionate in embracing the Games with 'their \"Canada\" hoodies and their red mittens (of which 2.6 million pairs sold that year). HBC has continued to produce these red mittens for subsequent Olympic Games.\n\nArchives\n\nThe legacy of the HBC has been maintained in part by the detailed record-keeping and archiving of material by the company. Before 1974, the records of the HBC were kept in the London office headquarters. The HBC opened an archives department to researchers in 1931. In 1974, Hudson's Bay Company Archives (HBCA) were transferred from London and placed on deposit with the Manitoba archives in Winnipeg. The company granted public access to the collection the following year.\n\nOn 27 January 1994, the company’s archives were formally donated to the Archives of Manitoba.\n\nAt the time of the donation, the appraised value of the records was nearly $60 million. A foundation, Hudson's Bay Company History Foundation funded through the tax savings resulting from the donation, was established to support the operations of the HBC Archive as a division of the Archives of Manitoba, along with other activities and programs., More than two kilometers of filed documents and hundreds of microfilm reels are now stored in a special climate-controlled vault in the Manitoba Archives Building.\n\nIn 2007, Hudson's Bay Company Archives became part of the United Nations \"Memory of the World Programme\" project, under UNESCO. The records covered the HBC history from the founding of the company in 1670. The records contained business transactions, medical records, personal journals of officials, inventories, company reports, etc.\n\nCorporate governance\n\n, the members of the board of directors of Hudson's Bay Company are:\n\n* Richard A. Baker\n* Robert C. Baker\n* Eric Gross\n* Steven Langman\n* David G. Leith\n* William L. Mack\n* Lee S. Neibart\n* Denise Pickett\n* Wayne Pommen\n* Earl Rotman\n* Matthew Rubel\n* Andrea Wong\n\nCorporate hierarchy\n\nIn the 18th and 19th Centuries, Hudson's Bay Company operated with a very rigid hierarchy when it came to its employees. This hierarchy essentially broke down into two levels; the officers and the servants.  Comprising the officers were the factors, masters and chief traders, clerks and surgeons. The servants were the tradesmen, boatmen, and labourers. The officers essentially ran the fur trading posts.  They had many duties which included supervising the workers in their trade posts, valuing the furs, and keeping trade and post records.  In 1821, when Hudson's Bay Company and the North West Company merged, the hierarchy became even stricter and the lines between officers and servants became virtually impossible to cross. Officers in charge of individual trading posts had much responsibility because they were directly in charge of enforcing the policies made by the governor and committee (the board) of the company. One of these policies was the price of particular furs and trade goods.  These prices were called the Official and Comparative Standards. Made-Beaver, the quality measurement of the pelt, was the means of exchange used by Hudson's Bay Company to define the Official and Comparative Standards. Because the governor was stationed in London, England, they needed to have reliable officers managing the trade posts halfway around the world. Because the fur trade was a very dynamic market, HBC needed to have some form of flexibility when dealing with prices and traders. Price fluctuation was deferred to the officers in charge of the trade posts, and the head office recorded any difference between the company's standard and that set by the individual officers. Overplus, or any excess revenue gained by officers was strictly documented to insure that it wasn't being pocketed and taken from the company. This strict yet flexible hierarchy exemplifies how Hudson's Bay Company was able to be so successful while still having its central management and trade posts located so far apart.\n\n;Hierarchichal order pre-1821\n\n;Hierarchical order 1821–1871\n\nGovernors\n\nChronological list of Governors of the Hudson's Bay Company:\n\n# 1670–82  Prince Rupert of the Rhine\n# 1683–85  James Stuart, Duke of York – resigned as governor to become James II, King of England.\n# 1685–92  John Churchill, Earl of Marlborough\n# 1692–96  Sir Stephen Evance\n# 1696–1700  Sir William Trumbull\n# 1700–12  Sir Stephen Evance\n# 1712–43  Sir Bibye Lake\n# 1744–46  Benjamin Pitt\n# 1746–50  Thomas Knapp\n# 1750–60  Sir Atwell Lake\n# 1760–70  Sir William Baker\n# 1770–82  Sir Bibye Lake, Jr.\n# 1782–99  Samuel Wegg\n# 1799–1807  Sir James Winter Lake\n# 1807–12  William Mainwaring\n# 1812–22  Joseph Berens\n# 1822–52  Sir John Henry Pelly in 1826, Simpson becomes governor of the Canadian region.\n# 1852–56  Andrew Wedderburn Colvile\n# 1856–58  John Shepherd\n# 1858–63  Henry Hulse Berens\n# 1863–68  Sir Edmund Walker Head\n# 1868–69  John Wodehouse, 1st Earl of Kimberley\n# 1869–74  Sir Stafford Henry Northcote\n# 1874–80  George Joachim Goschen\n# 1880–89  Eden Colvile\n# 1889–1914  Donald Alexander Smith\n# 1914–15  Sir Thomas Skinner\n# 1916–25  Sir Robert Molesworth Kindersley\n# 1925–31  Charles Vincent Sale\n# 1931–52  Sir Patrick Ashley Cooper – first governor to visit HBC operations in Canada.\n# 1952–65  William Keswick\n# 1965–70  Derick Heathcoat-Amory\n# 1970–82  George T. Richardson\n# 1982–94  Donald S. McGiverin\n# 1994–97  David E. Mitchell\n# 1997–2006  L. Yves Fortier\n# 2006–08  Jerry Zucker\n# 2008  Anita Zucker – first female governor.\n# 2008–present  Richard Baker\n\nMiscellany\n\nRent obligation under charter\n\nUnder the charter establishing Hudson's Bay Company, the company was required to give two elk skins and two black beaver pelts to the English king, then Charles II, or his heirs, whenever the monarch visited Rupert's Land. The exact text from the 1670 Charter reads:\n\nThe ceremony was first conducted with the Prince of Wales (the future Edward VIII) in 1927, then with King George VI in 1939, and last with his daughter, Queen Elizabeth II in 1959 and 1970. On the last such visit, the pelts were given in the form of two live beavers, which the Queen donated to the Winnipeg Zoo in Assiniboine Park. However, when the company permanently moved its headquarters to Canada, the Charter was amended to remove the rent obligation. Each of the four \"rent ceremonies\" took place in or around Winnipeg.\n\nNotable HBC explorers, builders, and associates\n\n* James Knight (c. 1640 – c. 1721) was a director of Hudson's Bay Company and an explorer who died in an expedition to the Northwest Passage.\n* Henry Kelsey (c. 1667 – 1 November 1724), a.k.a. the Boy Kelsey, was an English fur trader, explorer, and sailor who played an important role in establishing Hudson's Bay Company in Canada. In 1690, Henry Kelsey embarked on a 2-year exploration journey that made him the first white man to see buffalo.\n* Thanadelthur (c. 1697—5 February 1717) was a woman of the Chipewyan nation who served as a guide and interpreter for Hudson's Bay Company.\n* Samuel Hearne (1745–1792) was an English explorer, fur-trader, author, and naturalist. In 1774, Hearne built Cumberland House for the Hudson’s Bay Company, its first interior trading post and the first permanent settlement in present Saskatchewan.\n* David Thompson (30 April 1770 – 10 February 1857) was a British-Canadian fur trader that worked for both the Hudson’s Bay Company and the North West Trading Company. He is best known for his extensive explorations and map-making activities. He mapped almost half of North America between the 46th and 60th parallels, from the St.Lawrence and Great Lakes all the way to the Pacific.\n* Thomas Douglas, Lord Selkirk (20 June 1771 – 8 April 1820) was a Scottish peer. He was a Scottish philanthropist who, as HBC’s majority shareholder, arranged to purchase land at Red River to establish a colony for dispossessed Scottish immigrants.\n* Isobel Gunn or Isabella Gunn (c. 1780? – 7 November 1861), also known as John Fubbister or Mary Fubbister, was a Scottish labourer employed by Hudson's Bay Company (HBC), noted for having passed herself as a man, thereby becoming, not just a pioneer of feminism, but the first European woman to travel to Rupert's Land, now part of Western Canada.\n* George Simpson (1787 – 7 September 1860) was the Canadian governor of Hudson's Bay Company during the period of its greatest power, a period which began in 1821 following the company’s merger with the North West Trading Company.\n* Donald Smith, 1st Baron Strathcona and Mount Royal, at various times Chief Factor of the Labrador district, Commissioner of the Montreal district, and President of the Council of the Northern Department, who pacified Louis Riel during the Red River Rebellion of 1870, thus enabling the transfer of Rupert's Land from the HBC to the fledgling government of Canada. Later, he became Governor of the HBC.\n* Dr. John Rae (Inuktitut Aglooka ᐊᒡᓘᑲ English: \"long strider\") (30 September 1813 – 22 July 1893) was a Scottish doctor who explored Northern Canada, surveyed parts of the Northwest Passage and reported the fate of the Franklin Expedition.\n* William Keswick and grandson Sir William Johnstone Keswick served at HBC; the former as a director and later as governor from 1952 to 1965. The Keswick family are the Scottish business dynasty that controls Hong Kong-based Jardine Matheson, one of the original British trading houses or Hongs in British Hong Kong.\n\nHBC sternwheelers and steamships\n\n* Beaver (1835–74)\n* Otter (1852–95)\n* Anson Northup (1859–60)\n* Caledonia (1891–98) – She ran aground on rocks at Port Simpson during a storm and her hull was destroyed. Her engines were put into the Caledonia 2\n* Caledonia (2) (1898–1909) – Her machinery was from the Caledonia 1\n* Mount Royal (1902–07)\n* Princess Louise (1878–83)\n* Strathcona (1900)\n* Port Simpson (1907–12)\n* Hazelton (1907–12)\n* Distributor (1920–48)\n\nRivals\n\nThe HBC is the only European trading company to have survived and outlived all its rivals. Hudson's Bay Company. http://en.wikipedia.org/?curid=13297."
  }
}
