{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8574",
  "eid" : "e8de9370-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778470439,
  "textBody" : "The Tao Te Ching,. also known by its pinyin romanizations Daodejing and Dao De Jing, is a Chinese classic text traditionally credited to the 6th-century BCE sage Laozi. The text's authorship, date of composition and date of compilation are debated.Eliade (1984), p.26 The oldest excavated portion dates back to the late 4th century BCE, but modern scholarship dates other parts of the text as having been written—or at least compiled—later than the earliest portions of the Zhuangzi.Creel 1970, What is Taoism? 75\n\nThe Tao Te Ching, along with the Zhuangzi, is a fundamental text for both philosophical and religious Taoism. It also strongly influenced other schools of Chinese philosophy and religion, including Legalism, Confucianism, and Buddhism, which was largely interpreted through the use of Taoist words and concepts when it was originally introduced to China. Many Chinese artists, including poets, painters, calligraphers, and gardeners, have used the Tao Te Ching as a source of inspiration. Its influence has spread widely outside East Asia and it is among the most translated works in world literature..\n\nTitle\n\nTao Te Ching is the Wade-Giles romanization of the same name as the pinyin Daodejing and should be pronounced in the same way. That is, its s should be pronounced closer to English s. The Chinese characters in the title are:\n\nDào/tao literally means \"way\", or one of its synonyms, but was extended to mean \"the Way\". This term, which was variously used by other Chinese philosophers (including Confucius, Mencius, Mozi, and Hanfeizi), has special meaning within the context of Taoism, where it implies the essential, unnamable process of the universe.\n\nDé/te means \"virtue\", \"personal character\", \"inner strength\" (virtuosity), or \"integrity\". The semantics of this Chinese word resemble English virtue\", which developed from the Italian virtù, an archaic sense of \"inner potency\" or \"divine power\" (as in \"healing virtue of a drug\") to the modern meaning of \"moral excellence\" or \"goodness\". Compare the compound word taote (; literally: \"ethics\", \"ethical principles\", \"morals\" or \"morality\").\n\nJīng/ching as it is used here means \"canon\", \"great book\", or \"classic\".\n\nThe first character can be considered to modify the second or can be understood as standing alongside it in modifying the third. Thus, Tao Te Ching can be translated as \"The Classic of the Way's Virtue(s)\", the \"Book of the Tao and Its Virtue\", or \"The Book of the Way and of Virtue, It has also been translated as The Tao and its Characteristics, The Canon of Reason and Virtue, The Classic Book of Integrity and the Way, and A Treatise on the Principle and Its Action.\n\nAncient Chinese books were commonly referenced by the name of their real or supposed author, in this case the \"Old Master\", Laozi or Lao-tze. As such, the Tao Te Ching is also sometimes referred to as The Lao-tze, especially in Chinese sources.\n\nOther titles of the work include the honorific \"Sutra\" or \"Truthful Classic of the Way and Its Power\" (Daode Zhenjing) and the descriptive 5,000-character Classic (Wuqian Wen).\n\nText\n\nThe Tao Te Ching has a long and complex textual history. Known versions and commentaries date back two millennia, including ancient bamboo, silk, and paper manuscripts discovered in the twentieth century.\n\nInternal structure\n\nThe Tao Te Ching is a short text of around 5,000 Chinese characters in 81 brief chapters or sections (). There is some evidence that the chapter divisions were later additions—for commentary, or as aids to rote memorization—and that the original text was more fluidly organized. It has two parts, the Tao Ching (道經; chapters 1–37) and the Te Ching (德經; chapters 38–81), which may have been edited together into the received text, possibly reversed from an original Te Tao Ching. The written style is laconic, has few grammatical particles, and encourages varied, contradictory interpretations. The ideas are singular; the style poetic. The rhetorical style combines two major strategies: short, declarative statements and intentional contradictions. The first of these strategies creates memorable phrases, while the second forces to create reconciliations of the supposed contradictions.Austin, Michael (2010). \"Reading the World: Ideas that Matter\", p. 158. W. W. Norton & Company, New York. .\n\nThe Chinese characters in the original versions were probably written in zhuànshū ( seal script), while later versions were written in lìshū ( clerical script) and kǎishū ( regular script) styles.\n\nHistorical authenticity of the author\n\nThe Tao Te Ching is ascribed to Lao Tzu, whose historical existence has been a matter of scholastic debate. His name, which means \"Old Master\", has only fueled controversy on this issue.Feng Cao. \"Daoism in Early China: Huang-Lao Thought in Light of Excavated Texts\"; Palgrave Macmillan, 2017\n\nThe first reliable reference to Laozi is his \"biography\" in Shiji (63, tr. Chan 1963:35–37), by Chinese historian Sima Qian (ca. 145–86 BCE), which combines three stories. First, Lao Tzu was a contemporary of Confucius (551–479 BCE). His surname was Li ( \"plum\"), and his personal name was Er ( \"ear\") or Dan ( \"long ear\"). He was an official in the imperial archives, and wrote a book in two parts before departing to the West. Second, Laozi was Lao Laizi ( \"Old Come Master\"), also a contemporary of Confucius, who wrote a book in 15 parts. Third, Laozi was the grand historian and astrologer Lao Dan ( \"Old Long-ears\"), who lived during the reign (384–362 BCE) of Duke Xian (獻公) of Qin).\n\nGenerations of scholars have debated the historicity of Laozi and the dating of the Tao Te Ching. Linguistic studies of the text's vocabulary and rhyme scheme point to a date of composition after the Shi Jing yet before the Zhuangzi. Legends claim variously that Laozi was \"born old\"; that he lived for 996 years, with twelve previous incarnations starting around the time of the Three Sovereigns before the thirteenth as Laozi. Some Western scholars have expressed doubts over Lao Tzu's historical existence, claiming that the Tao Te Ching is actually a collection of the work of various authors.\n\nMany Taoists venerate Lao Tzu as Daotsu the founder of the school of Dao, the Daode Tianjun in the Three Pure Ones, one of the eight elders transformed from Taiji in the Chinese creation myth.\n\nPrincipal versions\n\nAmong the many transmitted editions of the Tao Te Ching text, the three primary ones are named after early commentaries. The \"Yan Zun Version\", which is only extant for the Te Ching, derives from a commentary attributed to Han Dynasty scholar Yan Zun (巖尊, fl. 80 BCE-10 CE). The \"Heshang Gong Version\" is named after the legendary Heshang Gong ( \"Riverside Sage\") who supposedly lived during the reign (180–157 BCE) of Emperor Wen of Han. This commentary has a preface written by Ge Xuan (, 164–244 CE), granduncle of Ge Hong, and scholarship dates this version to around the 3rd century CE. The \"Wang Bi Version\" has more verifiable origins than either of the above. Wang Bi (, 226–249 CE) was a famous Three Kingdoms period philosopher and commentator on the Tao Te Ching and the I Ching.\n\nTao Te Ching scholarship has advanced from archeological discoveries of manuscripts, some of which are older than any of the received texts. Beginning in the 1920s and 1930s, Marc Aurel Stein and others found thousands of scrolls in the Mogao Caves near Dunhuang. They included more than 50 partial and complete \"Tao Te Ching\" manuscripts. One written by the scribe So/Su Dan (素統) is dated 270 CE and corresponds closely with the Heshang Gong version. Another partial manuscript has the Xiang'er (想爾) commentary, which had previously been lost.\n\nMawangdui and Guodian texts\n\nIn 1973, archeologists discovered copies of early Chinese books, known as the Mawangdui Silk Texts, in a tomb dating from 168 BCE.  They included two nearly complete copies of the text, referred to as Text A () and Text B (), both of which reverse the traditional ordering and put the Te Ching section before the Tao Ching, which is why the Henricks translation of them is named \"Te-Tao Ching\". Based on calligraphic styles and imperial naming taboo avoidances, scholars believe that Text A can be dated to about the first decade and Text B to about the third decade of the 2nd century BCE.Boltz (1993): 284\n\nIn 1993, the oldest known version of the text, written on bamboo tablets, was found in a tomb near the town of Guodian () in Jingmen, Hubei, and dated prior to 300 BCE. The Guodian Chu Slips comprise about 800 slips of bamboo with a total of over 13,000 characters, about 2,000 of which correspond with the Tao Te Ching, including 14 previously unknown verses.\n\nBoth the Mawangdui and Guodian versions are generally consistent with the received texts, excepting differences in chapter sequence and graphic variants. Several recent Tao Te Ching translations (e.g., Lau 1989, Henricks 1989, Mair 1990, Henricks 2000, Allan and Williams 2000, and Roberts 2004) utilize these two versions, sometimes with the verses reordered to synthesize the new finds.\n\nTranslations\n\nThe Tao Te Ching has been translated into Western languages over 250 times, mostly to English, German, and French. According to Holmes Welch, \"It is a famous puzzle which everyone would like to feel he had solved.\"Welch (1965), p. 7 The first English translation of the Tao Te Ching was produced in 1868 by the Scottish Protestant missionary John Chalmers, entitled The Speculations on Metaphysics, Polity, and Morality of the \"Old Philosopher\" Lau-tsze. It was heavily indebted to Julien's French translation and dedicated to James Legge, who later produced his own translation for Oxford's Sacred Books of the East.\n\nOther notable English translations of the Tao Te Ching are those produced by Chinese scholars and teachers: a 1948 translation by linguist Lin Yutang, a 1961 translation by author John Ching Hsiung Wu, a 1963 translation by sinologist Din Cheuk Lau, another 1963 translation by professor Wing-tsit Chan, and a 1972 translation by Taoist teacher Gia-Fu Feng together with his wife Jane English.\n\nMany translations are written by people with a foundation in Chinese language and philosophy who are trying to render the original meaning of the text as faithfully as possible into English. Some of the more popular translations are written from a less scholarly perspective, giving an individual author's interpretation. Critics of these versions claim that their translators deviate from the text and are incompatible with the history of Chinese thought.[https://www.jstor.org/stable/1205252 The Journal of Religion] Russell Kirkland goes further to argue that these versions are based on Western Orientalist fantasies, and represent the colonial appropriation of Chinese culture. In contrast, Huston Smith, scholar of world religions, said of the Mitchell version, \"This translation comes as close to being definitive for our time as any I can imagine. It embodies the virtues its translator credits to the Chinese original: a gemlike lucidity that is radiant with humor, grace, largeheartedness, and deep wisdom.\" Other Taoism scholars, such as Michael LaFargue[https://books.google.com/books?vidISBN0791436004&id\n9Td7s_urErUC&pgPP1&lpg\nPP1&otsENwZI7oEjr&dq\n&sig=e6D1T_Ls3owaWMd8sSdqmgN4t8s#PPP1,M1 ] and Jonathan Herman,[https://www.jstor.org/stable/1466152 Journal of the American Academy of Religion] argue that while they don't pretend to scholarship, they meet a real spiritual need in the West. These Westernized versions aim to make the wisdom of the Tao Te Ching more accessible to modern English-speaking readers by, typically, employing more familiar cultural and temporal references.\n\nTranslational difficulties\n\nThe Tao Te Ching is written in Classical Chinese, which can be difficult to understand completely.  Classical Chinese relies heavily on allusion to a corpus of standard literary works to convey semantic meaning, nuance, and subtext. This corpus was memorized by highly educated people in Laozi's time, and the allusions were reinforced through common use in writing, but few people today have this type of deep acquaintance with ancient Chinese literature. Thus, many levels of subtext are potentially lost on modern translators. Furthermore, many of the words that the Tao Te Ching uses are deliberately vague and ambiguous.\n\nSince there are no punctuation marks in Classical Chinese, it can be difficult to conclusively determine where one sentence ends and the next begins. Moving a full-stop a few words forward or back or inserting a comma can profoundly alter the meaning of many passages, and such divisions and meanings must be determined by the translator. Some editors and translators argue that the received text is so corrupted (from originally being written on one-line bamboo strips linked with silk threads) that it is impossible to understand some chapters without moving sequences of characters from one place to another.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Tao Te Ching" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8574" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Tao Te Ching,. also known by its pinyin romanizations Daodejing and Dao De Jing, is a Chinese classic text traditionally credited to the 6th-century BCE sage Laozi. The text's authorship, date of composition and date of compilation are debated.Eliade (1984), p.26 The oldest excavated portion dates back to the late 4th century BCE, but modern scholarship dates other parts of the text as having been written—or at least compiled—later than the earliest portions of the Zhuangzi.Creel 1970, What is Taoism? 75\n\nThe Tao Te Ching, along with the Zhuangzi, is a fundamental text for both philosophical and religious Taoism. It also strongly influenced other schools of Chinese philosophy and religion, including Legalism, Confucianism, and Buddhism, which was largely interpreted through the use of Taoist words and concepts when it was originally introduced to China. Many Chinese artists, including poets, painters, calligraphers, and gardeners, have used the Tao Te Ching as a source of inspiration. Its influence has spread widely outside East Asia and it is among the most translated works in world literature..\n\nTitle\n\nTao Te Ching is the Wade-Giles romanization of the same name as the pinyin Daodejing and should be pronounced in the same way. That is, its s should be pronounced closer to English s. The Chinese characters in the title are:\n\nDào/tao literally means \"way\", or one of its synonyms, but was extended to mean \"the Way\". This term, which was variously used by other Chinese philosophers (including Confucius, Mencius, Mozi, and Hanfeizi), has special meaning within the context of Taoism, where it implies the essential, unnamable process of the universe.\n\nDé/te means \"virtue\", \"personal character\", \"inner strength\" (virtuosity), or \"integrity\". The semantics of this Chinese word resemble English virtue\", which developed from the Italian virtù, an archaic sense of \"inner potency\" or \"divine power\" (as in \"healing virtue of a drug\") to the modern meaning of \"moral excellence\" or \"goodness\". Compare the compound word taote (; literally: \"ethics\", \"ethical principles\", \"morals\" or \"morality\").\n\nJīng/ching as it is used here means \"canon\", \"great book\", or \"classic\".\n\nThe first character can be considered to modify the second or can be understood as standing alongside it in modifying the third. Thus, Tao Te Ching can be translated as \"The Classic of the Way's Virtue(s)\", the \"Book of the Tao and Its Virtue\", or \"The Book of the Way and of Virtue, It has also been translated as The Tao and its Characteristics, The Canon of Reason and Virtue, The Classic Book of Integrity and the Way, and A Treatise on the Principle and Its Action.\n\nAncient Chinese books were commonly referenced by the name of their real or supposed author, in this case the \"Old Master\", Laozi or Lao-tze. As such, the Tao Te Ching is also sometimes referred to as The Lao-tze, especially in Chinese sources.\n\nOther titles of the work include the honorific \"Sutra\" or \"Truthful Classic of the Way and Its Power\" (Daode Zhenjing) and the descriptive 5,000-character Classic (Wuqian Wen).\n\nText\n\nThe Tao Te Ching has a long and complex textual history. Known versions and commentaries date back two millennia, including ancient bamboo, silk, and paper manuscripts discovered in the twentieth century.\n\nInternal structure\n\nThe Tao Te Ching is a short text of around 5,000 Chinese characters in 81 brief chapters or sections (). There is some evidence that the chapter divisions were later additions—for commentary, or as aids to rote memorization—and that the original text was more fluidly organized. It has two parts, the Tao Ching (道經; chapters 1–37) and the Te Ching (德經; chapters 38–81), which may have been edited together into the received text, possibly reversed from an original Te Tao Ching. The written style is laconic, has few grammatical particles, and encourages varied, contradictory interpretations. The ideas are singular; the style poetic. The rhetorical style combines two major strategies: short, declarative statements and intentional contradictions. The first of these strategies creates memorable phrases, while the second forces to create reconciliations of the supposed contradictions.Austin, Michael (2010). \"Reading the World: Ideas that Matter\", p. 158. W. W. Norton & Company, New York. .\n\nThe Chinese characters in the original versions were probably written in zhuànshū ( seal script), while later versions were written in lìshū ( clerical script) and kǎishū ( regular script) styles.\n\nHistorical authenticity of the author\n\nThe Tao Te Ching is ascribed to Lao Tzu, whose historical existence has been a matter of scholastic debate. His name, which means \"Old Master\", has only fueled controversy on this issue.Feng Cao. \"Daoism in Early China: Huang-Lao Thought in Light of Excavated Texts\"; Palgrave Macmillan, 2017\n\nThe first reliable reference to Laozi is his \"biography\" in Shiji (63, tr. Chan 1963:35–37), by Chinese historian Sima Qian (ca. 145–86 BCE), which combines three stories. First, Lao Tzu was a contemporary of Confucius (551–479 BCE). His surname was Li ( \"plum\"), and his personal name was Er ( \"ear\") or Dan ( \"long ear\"). He was an official in the imperial archives, and wrote a book in two parts before departing to the West. Second, Laozi was Lao Laizi ( \"Old Come Master\"), also a contemporary of Confucius, who wrote a book in 15 parts. Third, Laozi was the grand historian and astrologer Lao Dan ( \"Old Long-ears\"), who lived during the reign (384–362 BCE) of Duke Xian (獻公) of Qin).\n\nGenerations of scholars have debated the historicity of Laozi and the dating of the Tao Te Ching. Linguistic studies of the text's vocabulary and rhyme scheme point to a date of composition after the Shi Jing yet before the Zhuangzi. Legends claim variously that Laozi was \"born old\"; that he lived for 996 years, with twelve previous incarnations starting around the time of the Three Sovereigns before the thirteenth as Laozi. Some Western scholars have expressed doubts over Lao Tzu's historical existence, claiming that the Tao Te Ching is actually a collection of the work of various authors.\n\nMany Taoists venerate Lao Tzu as Daotsu the founder of the school of Dao, the Daode Tianjun in the Three Pure Ones, one of the eight elders transformed from Taiji in the Chinese creation myth.\n\nPrincipal versions\n\nAmong the many transmitted editions of the Tao Te Ching text, the three primary ones are named after early commentaries. The \"Yan Zun Version\", which is only extant for the Te Ching, derives from a commentary attributed to Han Dynasty scholar Yan Zun (巖尊, fl. 80 BCE-10 CE). The \"Heshang Gong Version\" is named after the legendary Heshang Gong ( \"Riverside Sage\") who supposedly lived during the reign (180–157 BCE) of Emperor Wen of Han. This commentary has a preface written by Ge Xuan (, 164–244 CE), granduncle of Ge Hong, and scholarship dates this version to around the 3rd century CE. The \"Wang Bi Version\" has more verifiable origins than either of the above. Wang Bi (, 226–249 CE) was a famous Three Kingdoms period philosopher and commentator on the Tao Te Ching and the I Ching.\n\nTao Te Ching scholarship has advanced from archeological discoveries of manuscripts, some of which are older than any of the received texts. Beginning in the 1920s and 1930s, Marc Aurel Stein and others found thousands of scrolls in the Mogao Caves near Dunhuang. They included more than 50 partial and complete \"Tao Te Ching\" manuscripts. One written by the scribe So/Su Dan (素統) is dated 270 CE and corresponds closely with the Heshang Gong version. Another partial manuscript has the Xiang'er (想爾) commentary, which had previously been lost.\n\nMawangdui and Guodian texts\n\nIn 1973, archeologists discovered copies of early Chinese books, known as the Mawangdui Silk Texts, in a tomb dating from 168 BCE.  They included two nearly complete copies of the text, referred to as Text A () and Text B (), both of which reverse the traditional ordering and put the Te Ching section before the Tao Ching, which is why the Henricks translation of them is named \"Te-Tao Ching\". Based on calligraphic styles and imperial naming taboo avoidances, scholars believe that Text A can be dated to about the first decade and Text B to about the third decade of the 2nd century BCE.Boltz (1993): 284\n\nIn 1993, the oldest known version of the text, written on bamboo tablets, was found in a tomb near the town of Guodian () in Jingmen, Hubei, and dated prior to 300 BCE. The Guodian Chu Slips comprise about 800 slips of bamboo with a total of over 13,000 characters, about 2,000 of which correspond with the Tao Te Ching, including 14 previously unknown verses.\n\nBoth the Mawangdui and Guodian versions are generally consistent with the received texts, excepting differences in chapter sequence and graphic variants. Several recent Tao Te Ching translations (e.g., Lau 1989, Henricks 1989, Mair 1990, Henricks 2000, Allan and Williams 2000, and Roberts 2004) utilize these two versions, sometimes with the verses reordered to synthesize the new finds.\n\nTranslations\n\nThe Tao Te Ching has been translated into Western languages over 250 times, mostly to English, German, and French. According to Holmes Welch, \"It is a famous puzzle which everyone would like to feel he had solved.\"Welch (1965), p. 7 The first English translation of the Tao Te Ching was produced in 1868 by the Scottish Protestant missionary John Chalmers, entitled The Speculations on Metaphysics, Polity, and Morality of the \"Old Philosopher\" Lau-tsze. It was heavily indebted to Julien's French translation and dedicated to James Legge, who later produced his own translation for Oxford's Sacred Books of the East.\n\nOther notable English translations of the Tao Te Ching are those produced by Chinese scholars and teachers: a 1948 translation by linguist Lin Yutang, a 1961 translation by author John Ching Hsiung Wu, a 1963 translation by sinologist Din Cheuk Lau, another 1963 translation by professor Wing-tsit Chan, and a 1972 translation by Taoist teacher Gia-Fu Feng together with his wife Jane English.\n\nMany translations are written by people with a foundation in Chinese language and philosophy who are trying to render the original meaning of the text as faithfully as possible into English. Some of the more popular translations are written from a less scholarly perspective, giving an individual author's interpretation. Critics of these versions claim that their translators deviate from the text and are incompatible with the history of Chinese thought.[https://www.jstor.org/stable/1205252 The Journal of Religion] Russell Kirkland goes further to argue that these versions are based on Western Orientalist fantasies, and represent the colonial appropriation of Chinese culture. In contrast, Huston Smith, scholar of world religions, said of the Mitchell version, \"This translation comes as close to being definitive for our time as any I can imagine. It embodies the virtues its translator credits to the Chinese original: a gemlike lucidity that is radiant with humor, grace, largeheartedness, and deep wisdom.\" Other Taoism scholars, such as Michael LaFargue[https://books.google.com/books?vidISBN0791436004&id\n9Td7s_urErUC&pgPP1&lpg\nPP1&otsENwZI7oEjr&dq\n&sig=e6D1T_Ls3owaWMd8sSdqmgN4t8s#PPP1,M1 ] and Jonathan Herman,[https://www.jstor.org/stable/1466152 Journal of the American Academy of Religion] argue that while they don't pretend to scholarship, they meet a real spiritual need in the West. These Westernized versions aim to make the wisdom of the Tao Te Ching more accessible to modern English-speaking readers by, typically, employing more familiar cultural and temporal references.\n\nTranslational difficulties\n\nThe Tao Te Ching is written in Classical Chinese, which can be difficult to understand completely.  Classical Chinese relies heavily on allusion to a corpus of standard literary works to convey semantic meaning, nuance, and subtext. This corpus was memorized by highly educated people in Laozi's time, and the allusions were reinforced through common use in writing, but few people today have this type of deep acquaintance with ancient Chinese literature. Thus, many levels of subtext are potentially lost on modern translators. Furthermore, many of the words that the Tao Te Ching uses are deliberately vague and ambiguous.\n\nSince there are no punctuation marks in Classical Chinese, it can be difficult to conclusively determine where one sentence ends and the next begins. Moving a full-stop a few words forward or back or inserting a comma can profoundly alter the meaning of many passages, and such divisions and meanings must be determined by the translator. Some editors and translators argue that the received text is so corrupted (from originally being written on one-line bamboo strips linked with silk threads) that it is impossible to understand some chapters without moving sequences of characters from one place to another. Tao Te Ching. http://en.wikipedia.org/?curid=8574."
  }
}
