{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16570",
  "eid" : "26bd5a00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778574240,
  "textBody" : "Jeffrey Lynne (born 30 December 1947) is an English songwriter, singer, record producer, and multi-instrumentalist from Birmingham who co-founded the rock band Electric Light Orchestra (ELO). In 1972, two years after the group's formation, he took over its leadership and wrote, arranged, and produced virtually all of their subsequent records. In 1988, under the pseudonyms Otis Wilbury and Clayton Wilbury, he co-founded the supergroup Traveling Wilburys with George Harrison, Bob Dylan, Roy Orbison, and Tom Petty.\n\nAfter ELO's original disbandment in 1986, Lynne released two solo albums: Armchair Theatre (1990) and Long Wave (2012). In addition, he began producing various artists. His songwriting and production collaborations with ex-Beatles led him to co-produce their Anthology reunion singles \"Free as a Bird\" (1995) and \"Real Love\" (1996). Lynne has received three Ivor Novello Awards from the British Academy of Songwriters, Composers and Authors, including the award for Outstanding Services to British Music.[http://theivors.com/archive/1990-1999/the-ivors-1996/ \"Ivors 1996: Jeff Lynne\"]. The Ivors. Retrieved 28 December 2017\n\nIn 2014, Lynne reformed ELO and resumed concert touring, the same year he received a star on the Birmingham Walk of Stars in his home city. In 2015, he was awarded a star on the Hollywood Walk of Fame. In 2017, Lynne was inducted into the Rock and Roll Hall of Fame as a member of ELO.\n\nMusical career\n\nEarly life and career\n\nLynne grew up in Shard End, Birmingham, England where he attended Alderlea Boys' Secondary School. As a native of Birmingham he has a flat Brummie accent. His first guitar, an acoustic instrument, was bought for him by his father for £2. He was still playing it in 2012. In 1963 he formed a group with Robert Reader and David Walsh using little more than Spanish guitars and cheap electrical instruments. They were originally named the Rockin' Hellcats, then the Handicaps and finally the Andicaps. They practised at Shard End Community Centre and performed weekly. However, in 1964, Robert Reader and David Walsh left the band and Lynne brought in replacements. At the end of 1964, Lynne decided to leave the band to replace Mick Adkins of the local band \"the Chads\".\n\nSome time in or after 1965, he acquired his first item of studio recording equipment, a Bang & Olufsen 'Beocord 2000 De Luxe' stereo reel-to-reel tape recorder, which allowed multi-tracking between left and right channels. He says it \"taught me how to be a producer\". In 1966, Lynne joined the line-up of the Nightriders as guitarist. The band would soon change their name to the Idle Race. Despite recording two critically acclaimed albums with the band and producing the second, success eluded him. In 1970, Lynne accepted an offer from friend Roy Wood to join the line-up of the more successful band the Move.\n\n1970–86: ELO\n\nLynne contributed many songs to the Move's last two albums while formulating, with Roy Wood and Bev Bevan, a band built around a fusion of rock and classical music, with the original idea of both bands existing in tandem. This project would eventually become the highly successful Electric Light Orchestra (ELO). Problems led to Wood's departure in 1972, after the band's eponymous first album, leaving Lynne as the band's dominant creative force. Thereafter followed a succession of band personnel changes and increasingly popular albums: 1973's ELO 2 and On the Third Day, 1974's Eldorado and 1975's Face the Music. By 1976's A New World Record, Lynne had almost developed the roots of the group into a more complex and unique pop-rock sound mixed with studio strings, layered vocals, and tight, catchy pop singles. Lynne's now almost complete creative dominance as producer, songwriter, arranger, lead singer and guitarist could make ELO appear to be an almost solo effort. However, the ELO sound and the focus of Lynne's writing was also shaped by Louis Clark's and Richard Tandy's co-arranging, under Lynne's direction (notably the large string sections), and Bev Bevan's drumming, while Richard Tandy's integration of the Moog, harmonium, and Mellotron, with more novel keyboard technology, gave Lynne's songs a more symphonic sound. Kelly Groucutt's distinctive voice mixed with Lynne's to produce the classic ELO harmonic vocal sound.\n\nThe pinnacle of ELO's chart success and worldwide popularity was the expansive 1977 double album Out of the Blue, which was largely conceived in a Swiss chalet during a two-week writing marathon. The band's 1978 world tour featured an elaborate \"space ship\" set and laser light show. In order to recreate the complex instrumental textures of their albums, the band used pre-recorded supplemental backing tracks in live performances. Although that practice has now become commonplace, it caused considerable derision in the press of the time. Lynne has often stated that he prefers the creative environment of the studio to the rigours and tedium of touring. In 1979, Lynne followed up the success of Out of the Blue with Discovery, which held No. 1 in the UK for 5 weeks. The album is primarily associated with its two disco-flavoured singles (\"Shine a Little Love\" and \"Last Train to London\") and with the title's word play on \"disco\" and \"very\". However, the remaining seven non-disco tracks on the album reflected Lynne's range as a pop-rock songwriter, including a heavy, mid-tempo rock anthem (\"Don't Bring Me Down\") that, despite its use of a drum loop, could be considered the antithesis of disco. Lynne later recalled his forays into dance music: \"I love the force of disco. I love the freedom it gave me to make  different rhythms across it. I enjoyed that really steady driving beat. Just steady as a rock. I’ve always liked that simplicity in the bass drum.\"\n\nIn 1979, Lynne rejected an offer for ELO to headline the Knebworth Concert in the UK, allowing Led Zeppelin to headline instead. In the absence of any touring to support Discovery, Lynne had time to contribute five tracks to the soundtrack for the 1980 film musical Xanadu. The score yielded three Top 40 singles: \"I'm Alive\" (UK No. 20), \"All Over The World\" (UK No. 11), and the title track \"Xanadu\", which reached number one in the UK. Nevertheless, Lynne was not closely involved with the development of the film, and his material consequently had only superficial attachment to the plot. Xanadu performed weakly at the box office (although it later has experienced popularity as a cult favourite). Lynne subsequently disavowed his limited contribution to the project,\n\nIn 1981, Lynne took the band in a somewhat different direction with the science-fiction themed album Time, reaching number one for two weeks in the UK, producing the second Top 3 single in less than two years. The strings were still featured, but with heavily synthesised textures. Following a marginally successful tour, Lynne kept this general approach with 1983's Secret Messages and a final contractually-obligated ELO album Balance of Power in 1986. Lynne discusses the contractually-obligated nature of the final albums on the short interview included with the 'Zoom' DVD. ELO now had only three remaining official members (Lynne, Bevan and Tandy), and Lynne began devoting more time to producing. During his time in the Electric Light Orchestra, Lynne did manage to release a few recordings under his own name. In 1976, Lynne covered the Beatles songs \"With a Little Help from My Friends\" and \"Nowhere Man\" for All This and World War II. In 1977, Lynne released his first solo single, the disco-flavoured \"Doin' That Crazy Thing\"/\"Goin' Down to Rio\". Despite ELO's high-profile at that time, it received little airplay and failed to chart.\n\nIn 1984, Lynne and Tandy contributed two original songs \"Video!\" and \"Let It Run\" to the film Electric Dreams (they also provided a third song, \"Sooner Or Later\", which was released as the b-side of \"Video!\"). Lynne also wrote the song \"The Story of Me,\" which was recorded by the Everly Brothers on their comeback album EB84. Even before the official end of ELO, Lynne began his move toward focusing almost exclusively on studio production work. Lynne produced and wrote the 1983 top-40 hit \"Slipping Away\" for Dave Edmunds and played on sessions (with Tandy) for Edmunds' album, Information. Lynne also produced six tracks on Edmunds' follow-up album in 1984, Riff Raff. In contrast to the dense, boomy, baroque sound of ELO, Lynne's post-ELO studio work has tended toward more minimal, acoustic instrumentation and a sparse, \"organic\" quality that generally favours light room ambience and colouration over artificial reverb, especially on vocals. Lynne's recordings also often feature the jangling compressed acoustic guitar sound pioneered by Roger McGuinn and a heavily gated snare drum sound.\n\n1989–91: Traveling Wilburys\n\nLynne's influence by the Beatles was clearly evident in his ELO work, and the connection to the Beatles was strengthened when Lynne produced George Harrison's Cloud Nine. The latter was a successful comeback album for Harrison, released in 1987, featuring the popular singles \"Got My Mind Set on You\", \"When We Was Fab\" (where Lynne played the violin in the video) and \"This Is Love\", the last two of which were co-written by Lynne. Lynne's association with Harrison led to the 1988 formation of the Traveling Wilburys, a studio \"supergroup\" that also included Tom Petty, Bob Dylan and Roy Orbison and resulted in two albums (Vol. 1 and Vol. 3), both produced by Harrison and Lynne. In 1988, Lynne also worked on Orbison's album Mystery Girl, co-writing and producing Orbison's last major hit, \"You Got It\", plus two other tracks on that album. For Rock On!, the final Del Shannon album, Lynne co-wrote \"Walk Away\" and finished off several tracks after Shannon's death.\n\nIn 1989, Lynne co-produced Full Moon Fever by Tom Petty, which included the hit singles \"Free Fallin'\", \"I Won't Back Down\" and \"Runnin' Down a Dream\", all co-written by Lynne. This album and Traveling Wilburys Vol. 1 received nominations for the Grammy Award for Best Album of the Year in 1989. The Traveling Wilburys won a Grammy for \"Best Rock Performance By a Duo or Group with Vocal\" that year. Lynne's song \"One Way Love\" was released as a single by Agnetha Faltskog and appeared on her second post-ABBA album, Eyes of a Woman. Lynne co-wrote and produced the track \"Let It Shine\" for Beach Boys founder Brian Wilson's first solo album in 1988. Lynne also contributed three tracks to an album by Duane Eddy and \"Falling in Love\" on Land of Dreams for Randy Newman.\n\nIn 1990, Lynne collaborated on the Wilburys' follow up Traveling Wilburys Vol. 3 and released his first solo album Armchair Theatre. The album featured Harrison and Tandy and included the singles \"Every Little Thing\" and \"Lift Me Up\". It received some positive critical attention but little commercial success. Lynne also provided the song \"Wild Times\" to the motion picture soundtrack Robin Hood: Prince of Thieves in 1991. In 1991, Lynne returned to the studio with Petty, co-writing and producing the album Into the Great Wide Open for Tom Petty and the Heartbreakers, which featured the singles \"Learning to Fly\" and \"Into the Great Wide Open\". The following year he produced Roy Orbison's posthumous album King of Hearts, featuring the single \"I Drove All Night\".\n\n1990s–2010s\n\nIn February 1994, Lynne worked with the three surviving Beatles on the Anthology album series. At Harrison's request, Lynne was brought in to assist in reevaluating John Lennon's original studio material. The songs \"Free as a Bird\" and \"Real Love\" were created by digitally processing Lennon's demos for the songs and overdubbing the three surviving band members to form a virtual Beatles reunion that the band had mutually eschewed during Lennon's lifetime. Lynne has also produced records for Ringo Starr and worked on Paul McCartney's Grammy nominated album Flaming Pie.\n\nLynne's work in the 1990s also includes production of a 1993 album for singer-songwriter Julianna Raye entitled Something Peculiar and production or songwriting contributions to albums by Roger McGuinn (Back from Rio) and Joe Cocker (Night Calls), songs by Aerosmith (\"Lizard Love\"), Tom Jones (\"Lift Me Up\"), Bonnie Tyler (\"Time Mends a Broken Heart\"), the film Still Crazy, Hank Marvin (\"Wonderful Land\" and \"Nivram\"), Et Moi (\"Drole De Vie\") and the Tandy Morgan Band (\"Action\"). In 1996, Lynne was officially recognised by his peers when he was awarded the Ivor Novello Award for \"Outstanding Contributions to British Music\" for a second time.\n\nBev Bevan sold his 50% rights to the ELO name to Lynne, after Lynne initiated legal action regarding Bevan's touring group ELO Part II.  This allowed Lynne to release a new album in 2001 under the ELO moniker entitled Zoom. The album featured guest appearances by Ringo Starr, George Harrison and Richard Tandy, with Lynne multi-tracking a majority of the instruments and vocals. The album received positive reviews but had no hit singles. It was marketed as a \"return to the classic ELO sound\" in an attempt to connect with a loyal body of fans and to jump-start a planned concert tour (with Lynne and Tandy as the only returning original ELO members). While a live performance was taped at CBS Television City over two consecutive nights and shown on PBS (with subsequent DVD release), the tour itself was cancelled. \"The off-switch has been flipped on the Electric Light Orchestra. Or at least its tour, which was wired to illuminate the First Union Center on 15 Sept.\"\n\nEarlier in 2001, Lynne began working with George Harrison on what would turn out to be Harrison's final album, Brainwashed. After Harrison's death from cancer on 29 November 2001, Lynne returned to the studio in 2002 to help finish the uncompleted album. Lynne was heavily involved in the memorial Concert for George, held at London's Royal Albert Hall in November 2002, which also featured Traveling Wilburys member Petty. Lynne sang the lead vocal on \"The Inner Light\", \"I Want to Tell You\" and \"Give Me Love (Give Me Peace on Earth)\", and subsequently produced the Surround Sound audio mix for the Concert for George DVD, released in November 2003, which later received a Grammy. Lynne reunited in 2006 with Petty to produce the latter's third solo release, Highway Companion. In 2004, Lynne and Petty inducted Harrison into the Rock and Roll Hall of Fame, then played \"Handle with Care\" with Dhani Harrison, also \"While My Guitar Gently Weeps\" adding Prince, Steve Winwood, and others.\n\nIn a Reuters article on 23 April 2009, Lynne said that he had been working on the follow-up to his 1990 solo debut album Armchair Theatre with a possible tentative release date of \"later this year\". He also produced four tracks on Regina Spektor's fifth album Far, released 23 June 2009.\n\n2010s–present\n\nIn a March 2010 interview with the Daily Express newspaper, Lynne confirmed he was working on a new album with Joe Walsh and simultaneously \"writing a couple of albums under his own name, though he won't tell us in which musical direction he's heading.\" Lynne contributed a cover of Buddy Holly's \"Words of Love\" for the tribute album Listen to Me: Buddy Holly, which was released on 6 September 2011. On 31 December 2011, Brian Williams reported on NBC New Year's Eve with Carson Daly that \"2012 releases will include rare new work from Jeff Lynne.\"\n\nIn 2012, Walsh released his Analog Man album which was produced by Lynne. Lynne's second solo album, a covers album entitled Long Wave, was released on 8 October 2012. A greatest hits collection of re-recorded ELO songs by Lynne titled Mr. Blue Sky: The Very Best of Electric Light Orchestra was also released under the ELO moniker on the same day. Lynne suggested that a new album with original material may be released during 2013. In 2012, Lynne and Tandy teamed up at Lynne's Bungalow Palace home studios to record a live set of ELO's songs. This was broadcast on TV as part of the Mr. Blue Sky documentary. Lynne and Tandy reunited again on 12 November 2013 to perform, under the name Jeff Lynne and Friends, \"Livin' Thing\" and \"Mr. Blue Sky\" at the Children in Need Rocks concert at Hammersmith Eventim Apollo, London.\n\nOn 9 February 2014, Lynne performed George Harrison's \"Something\" with Joe Walsh and Dhani Harrison on The Night That Changed America: A Grammy Salute to The Beatles, as well as \"Hey Bulldog\" from the Yellow Submarine soundtrack, while accompanying Dave Grohl, commemorating the 50th anniversary of the Beatles' performance on The Ed Sullivan Show. On 5 March 2014, Lynne received an honorary doctorate degree from Birmingham City University. He also mentioned he was working with Bryan Adams on new material. On 14 September 2014, Jeff Lynne and his touring band, under the name Jeff Lynne's ELO, played a public concert for the first time in over 25 years, headlining at the Radio 2 festival in Hyde Park, London, Never particularly enthusiastic for live performance even in his younger days, Lynne has called this event \"easily the best concert I've ever been involved with\".\n\nOn 8 February 2015, Lynne appeared at the Grammy Awards, playing \"Evil Woman\" and \"Mr. Blue Sky\" with Ed Sheeran.\n\nOn 10 September 2015, Lynne's website announced he had signed a contract to deliver an album of new ELO music for Columbia Records marking the first time in 14 years new ELO music would be released. On 24 September 2015, \"When I Was a Boy\", the first single from Alone in the Universe was released on the internet with a music video scheduled not long after. The album was released on 13 November 2015 and was followed by promotional shows including the first ELO shows in the United States in 30 years. A 2016 European tour was scheduled, with Dublin, Amsterdam and Zurich being some of the locations toured. Notably, the Dublin concert was delayed by a week due to medical advice given to Lynne.\n\nOn 24 June 2017, Lynne performed at Wembley Stadium to a crowd of 60,000. Playing a 24 song setlist including 'Xanadu', 'Do Ya' and 'Twilight' - Followed by the concerts release on DVD and CD, Wembley or Bust.\n\nPersonal life\n\nLynne has been married twice: first to Rosemary (née Adams, b. 1942) in 1972\n (divorced 1977) and then to Sandi Kapelson in 1979, with whom he has two daughters: Laura (born December 1979) and Stephanie (born 1981).\n\nAwards and honours\n\n* 2009: Golden Note Award from the ASCAP\n* 2013: Songwriters Hall of Fame nominee for 2014 induction.\n* 2014: Star on the Birmingham Walk of Stars.\n* 2015: Star on the Hollywood Walk of Fame.\n* 2015: Songwriters Hall of Fame nominee for 2016 induction.\n* 2016: Songwriters Hall of Fame nominee for 2017 induction.\n* 2017: Rock and Roll Hall of Fame inductee as a member of Electric Light Orchestra.\n\nSolo albums\n\n*Armchair Theatre (1990)\n*Long Wave (2012)\n\nProducer discography\n\nSee also: The Idle Race discography, the Move discography, Electric Light Orchestra discography, Traveling Wilburys discography\n\nAlbums\n\nCo-produced\n\nSoundtracks\n\nCo-produced\n\nSingles\n\nA-sides co-produced\n\nB-sides\n\nB-sides co-produced",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jeff Lynne" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16570" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jeffrey Lynne (born 30 December 1947) is an English songwriter, singer, record producer, and multi-instrumentalist from Birmingham who co-founded the rock band Electric Light Orchestra (ELO). In 1972, two years after the group's formation, he took over its leadership and wrote, arranged, and produced virtually all of their subsequent records. In 1988, under the pseudonyms Otis Wilbury and Clayton Wilbury, he co-founded the supergroup Traveling Wilburys with George Harrison, Bob Dylan, Roy Orbison, and Tom Petty.\n\nAfter ELO's original disbandment in 1986, Lynne released two solo albums: Armchair Theatre (1990) and Long Wave (2012). In addition, he began producing various artists. His songwriting and production collaborations with ex-Beatles led him to co-produce their Anthology reunion singles \"Free as a Bird\" (1995) and \"Real Love\" (1996). Lynne has received three Ivor Novello Awards from the British Academy of Songwriters, Composers and Authors, including the award for Outstanding Services to British Music.[http://theivors.com/archive/1990-1999/the-ivors-1996/ \"Ivors 1996: Jeff Lynne\"]. The Ivors. Retrieved 28 December 2017\n\nIn 2014, Lynne reformed ELO and resumed concert touring, the same year he received a star on the Birmingham Walk of Stars in his home city. In 2015, he was awarded a star on the Hollywood Walk of Fame. In 2017, Lynne was inducted into the Rock and Roll Hall of Fame as a member of ELO.\n\nMusical career\n\nEarly life and career\n\nLynne grew up in Shard End, Birmingham, England where he attended Alderlea Boys' Secondary School. As a native of Birmingham he has a flat Brummie accent. His first guitar, an acoustic instrument, was bought for him by his father for £2. He was still playing it in 2012. In 1963 he formed a group with Robert Reader and David Walsh using little more than Spanish guitars and cheap electrical instruments. They were originally named the Rockin' Hellcats, then the Handicaps and finally the Andicaps. They practised at Shard End Community Centre and performed weekly. However, in 1964, Robert Reader and David Walsh left the band and Lynne brought in replacements. At the end of 1964, Lynne decided to leave the band to replace Mick Adkins of the local band \"the Chads\".\n\nSome time in or after 1965, he acquired his first item of studio recording equipment, a Bang & Olufsen 'Beocord 2000 De Luxe' stereo reel-to-reel tape recorder, which allowed multi-tracking between left and right channels. He says it \"taught me how to be a producer\". In 1966, Lynne joined the line-up of the Nightriders as guitarist. The band would soon change their name to the Idle Race. Despite recording two critically acclaimed albums with the band and producing the second, success eluded him. In 1970, Lynne accepted an offer from friend Roy Wood to join the line-up of the more successful band the Move.\n\n1970–86: ELO\n\nLynne contributed many songs to the Move's last two albums while formulating, with Roy Wood and Bev Bevan, a band built around a fusion of rock and classical music, with the original idea of both bands existing in tandem. This project would eventually become the highly successful Electric Light Orchestra (ELO). Problems led to Wood's departure in 1972, after the band's eponymous first album, leaving Lynne as the band's dominant creative force. Thereafter followed a succession of band personnel changes and increasingly popular albums: 1973's ELO 2 and On the Third Day, 1974's Eldorado and 1975's Face the Music. By 1976's A New World Record, Lynne had almost developed the roots of the group into a more complex and unique pop-rock sound mixed with studio strings, layered vocals, and tight, catchy pop singles. Lynne's now almost complete creative dominance as producer, songwriter, arranger, lead singer and guitarist could make ELO appear to be an almost solo effort. However, the ELO sound and the focus of Lynne's writing was also shaped by Louis Clark's and Richard Tandy's co-arranging, under Lynne's direction (notably the large string sections), and Bev Bevan's drumming, while Richard Tandy's integration of the Moog, harmonium, and Mellotron, with more novel keyboard technology, gave Lynne's songs a more symphonic sound. Kelly Groucutt's distinctive voice mixed with Lynne's to produce the classic ELO harmonic vocal sound.\n\nThe pinnacle of ELO's chart success and worldwide popularity was the expansive 1977 double album Out of the Blue, which was largely conceived in a Swiss chalet during a two-week writing marathon. The band's 1978 world tour featured an elaborate \"space ship\" set and laser light show. In order to recreate the complex instrumental textures of their albums, the band used pre-recorded supplemental backing tracks in live performances. Although that practice has now become commonplace, it caused considerable derision in the press of the time. Lynne has often stated that he prefers the creative environment of the studio to the rigours and tedium of touring. In 1979, Lynne followed up the success of Out of the Blue with Discovery, which held No. 1 in the UK for 5 weeks. The album is primarily associated with its two disco-flavoured singles (\"Shine a Little Love\" and \"Last Train to London\") and with the title's word play on \"disco\" and \"very\". However, the remaining seven non-disco tracks on the album reflected Lynne's range as a pop-rock songwriter, including a heavy, mid-tempo rock anthem (\"Don't Bring Me Down\") that, despite its use of a drum loop, could be considered the antithesis of disco. Lynne later recalled his forays into dance music: \"I love the force of disco. I love the freedom it gave me to make  different rhythms across it. I enjoyed that really steady driving beat. Just steady as a rock. I’ve always liked that simplicity in the bass drum.\"\n\nIn 1979, Lynne rejected an offer for ELO to headline the Knebworth Concert in the UK, allowing Led Zeppelin to headline instead. In the absence of any touring to support Discovery, Lynne had time to contribute five tracks to the soundtrack for the 1980 film musical Xanadu. The score yielded three Top 40 singles: \"I'm Alive\" (UK No. 20), \"All Over The World\" (UK No. 11), and the title track \"Xanadu\", which reached number one in the UK. Nevertheless, Lynne was not closely involved with the development of the film, and his material consequently had only superficial attachment to the plot. Xanadu performed weakly at the box office (although it later has experienced popularity as a cult favourite). Lynne subsequently disavowed his limited contribution to the project,\n\nIn 1981, Lynne took the band in a somewhat different direction with the science-fiction themed album Time, reaching number one for two weeks in the UK, producing the second Top 3 single in less than two years. The strings were still featured, but with heavily synthesised textures. Following a marginally successful tour, Lynne kept this general approach with 1983's Secret Messages and a final contractually-obligated ELO album Balance of Power in 1986. Lynne discusses the contractually-obligated nature of the final albums on the short interview included with the 'Zoom' DVD. ELO now had only three remaining official members (Lynne, Bevan and Tandy), and Lynne began devoting more time to producing. During his time in the Electric Light Orchestra, Lynne did manage to release a few recordings under his own name. In 1976, Lynne covered the Beatles songs \"With a Little Help from My Friends\" and \"Nowhere Man\" for All This and World War II. In 1977, Lynne released his first solo single, the disco-flavoured \"Doin' That Crazy Thing\"/\"Goin' Down to Rio\". Despite ELO's high-profile at that time, it received little airplay and failed to chart.\n\nIn 1984, Lynne and Tandy contributed two original songs \"Video!\" and \"Let It Run\" to the film Electric Dreams (they also provided a third song, \"Sooner Or Later\", which was released as the b-side of \"Video!\"). Lynne also wrote the song \"The Story of Me,\" which was recorded by the Everly Brothers on their comeback album EB84. Even before the official end of ELO, Lynne began his move toward focusing almost exclusively on studio production work. Lynne produced and wrote the 1983 top-40 hit \"Slipping Away\" for Dave Edmunds and played on sessions (with Tandy) for Edmunds' album, Information. Lynne also produced six tracks on Edmunds' follow-up album in 1984, Riff Raff. In contrast to the dense, boomy, baroque sound of ELO, Lynne's post-ELO studio work has tended toward more minimal, acoustic instrumentation and a sparse, \"organic\" quality that generally favours light room ambience and colouration over artificial reverb, especially on vocals. Lynne's recordings also often feature the jangling compressed acoustic guitar sound pioneered by Roger McGuinn and a heavily gated snare drum sound.\n\n1989–91: Traveling Wilburys\n\nLynne's influence by the Beatles was clearly evident in his ELO work, and the connection to the Beatles was strengthened when Lynne produced George Harrison's Cloud Nine. The latter was a successful comeback album for Harrison, released in 1987, featuring the popular singles \"Got My Mind Set on You\", \"When We Was Fab\" (where Lynne played the violin in the video) and \"This Is Love\", the last two of which were co-written by Lynne. Lynne's association with Harrison led to the 1988 formation of the Traveling Wilburys, a studio \"supergroup\" that also included Tom Petty, Bob Dylan and Roy Orbison and resulted in two albums (Vol. 1 and Vol. 3), both produced by Harrison and Lynne. In 1988, Lynne also worked on Orbison's album Mystery Girl, co-writing and producing Orbison's last major hit, \"You Got It\", plus two other tracks on that album. For Rock On!, the final Del Shannon album, Lynne co-wrote \"Walk Away\" and finished off several tracks after Shannon's death.\n\nIn 1989, Lynne co-produced Full Moon Fever by Tom Petty, which included the hit singles \"Free Fallin'\", \"I Won't Back Down\" and \"Runnin' Down a Dream\", all co-written by Lynne. This album and Traveling Wilburys Vol. 1 received nominations for the Grammy Award for Best Album of the Year in 1989. The Traveling Wilburys won a Grammy for \"Best Rock Performance By a Duo or Group with Vocal\" that year. Lynne's song \"One Way Love\" was released as a single by Agnetha Faltskog and appeared on her second post-ABBA album, Eyes of a Woman. Lynne co-wrote and produced the track \"Let It Shine\" for Beach Boys founder Brian Wilson's first solo album in 1988. Lynne also contributed three tracks to an album by Duane Eddy and \"Falling in Love\" on Land of Dreams for Randy Newman.\n\nIn 1990, Lynne collaborated on the Wilburys' follow up Traveling Wilburys Vol. 3 and released his first solo album Armchair Theatre. The album featured Harrison and Tandy and included the singles \"Every Little Thing\" and \"Lift Me Up\". It received some positive critical attention but little commercial success. Lynne also provided the song \"Wild Times\" to the motion picture soundtrack Robin Hood: Prince of Thieves in 1991. In 1991, Lynne returned to the studio with Petty, co-writing and producing the album Into the Great Wide Open for Tom Petty and the Heartbreakers, which featured the singles \"Learning to Fly\" and \"Into the Great Wide Open\". The following year he produced Roy Orbison's posthumous album King of Hearts, featuring the single \"I Drove All Night\".\n\n1990s–2010s\n\nIn February 1994, Lynne worked with the three surviving Beatles on the Anthology album series. At Harrison's request, Lynne was brought in to assist in reevaluating John Lennon's original studio material. The songs \"Free as a Bird\" and \"Real Love\" were created by digitally processing Lennon's demos for the songs and overdubbing the three surviving band members to form a virtual Beatles reunion that the band had mutually eschewed during Lennon's lifetime. Lynne has also produced records for Ringo Starr and worked on Paul McCartney's Grammy nominated album Flaming Pie.\n\nLynne's work in the 1990s also includes production of a 1993 album for singer-songwriter Julianna Raye entitled Something Peculiar and production or songwriting contributions to albums by Roger McGuinn (Back from Rio) and Joe Cocker (Night Calls), songs by Aerosmith (\"Lizard Love\"), Tom Jones (\"Lift Me Up\"), Bonnie Tyler (\"Time Mends a Broken Heart\"), the film Still Crazy, Hank Marvin (\"Wonderful Land\" and \"Nivram\"), Et Moi (\"Drole De Vie\") and the Tandy Morgan Band (\"Action\"). In 1996, Lynne was officially recognised by his peers when he was awarded the Ivor Novello Award for \"Outstanding Contributions to British Music\" for a second time.\n\nBev Bevan sold his 50% rights to the ELO name to Lynne, after Lynne initiated legal action regarding Bevan's touring group ELO Part II.  This allowed Lynne to release a new album in 2001 under the ELO moniker entitled Zoom. The album featured guest appearances by Ringo Starr, George Harrison and Richard Tandy, with Lynne multi-tracking a majority of the instruments and vocals. The album received positive reviews but had no hit singles. It was marketed as a \"return to the classic ELO sound\" in an attempt to connect with a loyal body of fans and to jump-start a planned concert tour (with Lynne and Tandy as the only returning original ELO members). While a live performance was taped at CBS Television City over two consecutive nights and shown on PBS (with subsequent DVD release), the tour itself was cancelled. \"The off-switch has been flipped on the Electric Light Orchestra. Or at least its tour, which was wired to illuminate the First Union Center on 15 Sept.\"\n\nEarlier in 2001, Lynne began working with George Harrison on what would turn out to be Harrison's final album, Brainwashed. After Harrison's death from cancer on 29 November 2001, Lynne returned to the studio in 2002 to help finish the uncompleted album. Lynne was heavily involved in the memorial Concert for George, held at London's Royal Albert Hall in November 2002, which also featured Traveling Wilburys member Petty. Lynne sang the lead vocal on \"The Inner Light\", \"I Want to Tell You\" and \"Give Me Love (Give Me Peace on Earth)\", and subsequently produced the Surround Sound audio mix for the Concert for George DVD, released in November 2003, which later received a Grammy. Lynne reunited in 2006 with Petty to produce the latter's third solo release, Highway Companion. In 2004, Lynne and Petty inducted Harrison into the Rock and Roll Hall of Fame, then played \"Handle with Care\" with Dhani Harrison, also \"While My Guitar Gently Weeps\" adding Prince, Steve Winwood, and others.\n\nIn a Reuters article on 23 April 2009, Lynne said that he had been working on the follow-up to his 1990 solo debut album Armchair Theatre with a possible tentative release date of \"later this year\". He also produced four tracks on Regina Spektor's fifth album Far, released 23 June 2009.\n\n2010s–present\n\nIn a March 2010 interview with the Daily Express newspaper, Lynne confirmed he was working on a new album with Joe Walsh and simultaneously \"writing a couple of albums under his own name, though he won't tell us in which musical direction he's heading.\" Lynne contributed a cover of Buddy Holly's \"Words of Love\" for the tribute album Listen to Me: Buddy Holly, which was released on 6 September 2011. On 31 December 2011, Brian Williams reported on NBC New Year's Eve with Carson Daly that \"2012 releases will include rare new work from Jeff Lynne.\"\n\nIn 2012, Walsh released his Analog Man album which was produced by Lynne. Lynne's second solo album, a covers album entitled Long Wave, was released on 8 October 2012. A greatest hits collection of re-recorded ELO songs by Lynne titled Mr. Blue Sky: The Very Best of Electric Light Orchestra was also released under the ELO moniker on the same day. Lynne suggested that a new album with original material may be released during 2013. In 2012, Lynne and Tandy teamed up at Lynne's Bungalow Palace home studios to record a live set of ELO's songs. This was broadcast on TV as part of the Mr. Blue Sky documentary. Lynne and Tandy reunited again on 12 November 2013 to perform, under the name Jeff Lynne and Friends, \"Livin' Thing\" and \"Mr. Blue Sky\" at the Children in Need Rocks concert at Hammersmith Eventim Apollo, London.\n\nOn 9 February 2014, Lynne performed George Harrison's \"Something\" with Joe Walsh and Dhani Harrison on The Night That Changed America: A Grammy Salute to The Beatles, as well as \"Hey Bulldog\" from the Yellow Submarine soundtrack, while accompanying Dave Grohl, commemorating the 50th anniversary of the Beatles' performance on The Ed Sullivan Show. On 5 March 2014, Lynne received an honorary doctorate degree from Birmingham City University. He also mentioned he was working with Bryan Adams on new material. On 14 September 2014, Jeff Lynne and his touring band, under the name Jeff Lynne's ELO, played a public concert for the first time in over 25 years, headlining at the Radio 2 festival in Hyde Park, London, Never particularly enthusiastic for live performance even in his younger days, Lynne has called this event \"easily the best concert I've ever been involved with\".\n\nOn 8 February 2015, Lynne appeared at the Grammy Awards, playing \"Evil Woman\" and \"Mr. Blue Sky\" with Ed Sheeran.\n\nOn 10 September 2015, Lynne's website announced he had signed a contract to deliver an album of new ELO music for Columbia Records marking the first time in 14 years new ELO music would be released. On 24 September 2015, \"When I Was a Boy\", the first single from Alone in the Universe was released on the internet with a music video scheduled not long after. The album was released on 13 November 2015 and was followed by promotional shows including the first ELO shows in the United States in 30 years. A 2016 European tour was scheduled, with Dublin, Amsterdam and Zurich being some of the locations toured. Notably, the Dublin concert was delayed by a week due to medical advice given to Lynne.\n\nOn 24 June 2017, Lynne performed at Wembley Stadium to a crowd of 60,000. Playing a 24 song setlist including 'Xanadu', 'Do Ya' and 'Twilight' - Followed by the concerts release on DVD and CD, Wembley or Bust.\n\nPersonal life\n\nLynne has been married twice: first to Rosemary (née Adams, b. 1942) in 1972\n (divorced 1977) and then to Sandi Kapelson in 1979, with whom he has two daughters: Laura (born December 1979) and Stephanie (born 1981).\n\nAwards and honours\n\n* 2009: Golden Note Award from the ASCAP\n* 2013: Songwriters Hall of Fame nominee for 2014 induction.\n* 2014: Star on the Birmingham Walk of Stars.\n* 2015: Star on the Hollywood Walk of Fame.\n* 2015: Songwriters Hall of Fame nominee for 2016 induction.\n* 2016: Songwriters Hall of Fame nominee for 2017 induction.\n* 2017: Rock and Roll Hall of Fame inductee as a member of Electric Light Orchestra.\n\nSolo albums\n\n*Armchair Theatre (1990)\n*Long Wave (2012)\n\nProducer discography\n\nSee also: The Idle Race discography, the Move discography, Electric Light Orchestra discography, Traveling Wilburys discography\n\nAlbums\n\nCo-produced\n\nSoundtracks\n\nCo-produced\n\nSingles\n\nA-sides co-produced\n\nB-sides\n\nB-sides co-produced. Jeff Lynne. http://en.wikipedia.org/?curid=16570."
  }
}
