{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14019",
  "eid" : "10f4b8d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778537693,
  "textBody" : "Horsepower (hp) is a unit of measurement of power (the rate at which work is done). There are many different standards and types of horsepower. Two common definitions being used today are the mechanical horsepower (or imperial horsepower), which is 745.7 watts, and the metric horsepower, which is approximately 735.5 watts.\n\nThe term was adopted in the late 18th century by Scottish engineer James Watt to compare the output of steam engines with the power of draft horses. It was later expanded to include the output power of other types of piston engines, as well as turbines, electric motors and other machinery.[http://www.britannica.com/EBchecked/topic/272384/horsepower \"Horsepower\"], Encyclopædia Britannica Online. Retrieved 2012-06-24.[http://www.britannica.com/EBchecked/topic/291305/International-System-of-Units-SI \"International System of Units\" (SI)], Encyclopædia Britannica Online. Retrieved 2012-06-24. The definition of the unit varied among geographical regions. Most countries now use the SI unit watt for measurement of power. With the implementation of the EU Directive 80/181/EEC on January 1, 2010, the use of horsepower in the EU is permitted only as a supplementary unit.[http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2009:114:0010:0013:EN:PDF \"Directive 2009/3/EC of the European Parliament and of the Council of 11 March 2009\"], Official Journal of the European Union. Retrieved 2013-02-15.\n\nHistory\n\nThe development of the steam engine provided a reason to compare the output of horses with that of the engines that could replace them. In 1702, Thomas Savery wrote in The Miner's Friend:\n\nSo that an engine which will raise as much water as two horses, working together at one time in such a work, can do, and for which there must be constantly kept ten or twelve horses for doing the same. Then I say, such an engine may be made large enough to do the work required in employing eight, ten, fifteen, or twenty horses to be constantly maintained and kept for doing such a work…\n\nThe idea was later used by James Watt to help market his improved steam engine.  He had previously agreed to take royalties of one third of the savings in coal from the older Newcomen steam engines.  This royalty scheme did not work with customers who did not have existing steam engines but used horses instead.\n\nWatt determined that a horse could turn a mill wheel 144 times in an hour (or 2.4 times a minute).Hart-Davis, Adam, Engineers, pub Dorling Kindersley, 2012, p121.  The wheel was 12 ft in radius; therefore, the horse travelled 2.4 × 2π × 12 feet in one minute.  Watt judged that the horse could pull with a force of 180 lbf}}.  So:\n\n P \\frac{W}{t} \n \\frac{Fd}{t} \\frac{180\\,\\mathrm{lbf}\\times 2.4 \\times 2\\, \\pi \\times 12\\, \\mathrm{ft}}{1\\,\\mathrm{min}} \n 32,572 \\frac{\\mathrm{ft} \\cdot \\mathrm{lbf}}{\\mathrm{min.\n\nWatt defined and calculated the horsepower as 32,572 ft·lbf/min, which was rounded to an even 33,000 ft·lbf/min.\n\nWatt determined that a pony could lift an average 220 lbf 100 ft per minute over a four-hour working shift.  Watt then judged a horse was 50% more powerful than a pony and thus arrived at the 33,000 ft·lbf/min figure. Engineering in History recounts that John Smeaton initially estimated that a horse could produce 22,916 foot-pounds (31,070 N·m) per minute.Kirby, Richard Shelton (August 1, 1990). \"Engineering in History\". Dover Publications: 171. John Desaguliers had previously suggested 44,000 foot-pounds (59,656 N·m) per minute and Tredgold 27,500 foot-pounds (37,285 N·m) per minute.  \"Watt found by experiment in 1782 that a 'brewery horse' could produce 32,400 foot-pounds [43,928.5 N·m] per minute.\"  James Watt and Matthew Boulton standardized that figure at 33,000 foot-pounds (44,742 N·m) per minute the next year.\n\nA common legend states that the unit was created when one of Watt's first customers, a brewer, specifically demanded an engine that would match a horse, but tried to cheat by taking the strongest horse he had and driving it to the limit. Watt, while aware of the trick, accepted the challenge and built a machine which was actually even stronger than the figure achieved by the brewer, and it was the output of that machine which became the horsepower.Popular Mechanics. [https://books.google.co.il/books?id_d0DAAAAMBAJ&printsec\nfrontcover&sourcegbs_ge_summary_r&cad\n0#vonepage&q&f\nfalse September 1912, page 394]\n\nIn 1993, R. D. Stevenson and R. J. Wassersug published correspondence in Nature summarizing measurements and calculations of peak and sustained work rates of a horse. Citing measurements made at the 1926 Iowa State Fair, they reported that the peak power over a few seconds has been measured to be as high as 14.9 hp (11.1 kW) and also observed that for sustained activity, a work rate of about 1 hp (0.7457 kW) per horse is consistent with agricultural advice from both the 19th and 20th centuries and also consistent with a work rate of about 4 times the basal rate expended by other vertebrates for sustained activity.\n\nWhen considering human-powered equipment, a healthy human can produce about 1.2 hp briefly (see orders of magnitude) and sustain about 0.1 hp (74.57 W) indefinitely; trained athletes can manage up to about 2.5 hp (1.85 kW) brieflyEugene A. Avallone et. al, (ed), Marks' Standard Handbook for Mechanical Engineers 11th Edition , Mc-Graw Hill, New York 2007  page 9-4\nand 0.35 hp (260 W) for a period of several hours. The Jamaican sprinter Usain Bolt produced a maximum of 3.5 hp (2.6 kW) 0.89 seconds into his 9.58 second 100-metre dash world record in 2009.\n\nCalculating power\n\nWhen torque T is in pound-foot units, rotational speed (N) is in rpm and power is required in horsepower:\n\n P / \\text{hp} = \\frac{T / (\\text{ft} \\cdot \\text{lbf}) \\times N / \\text{rpm}} {5252}\n\nThe constant 5252 is the rounded value of (33,000 ft·lbf/min)/(2π rad/rev).\n\nWhen torque T is in inch pounds:\n\n P / \\text{hp} = \\frac{T / (\\text{in} \\cdot \\text{lbf}) \\times N / \\text{rpm}} {63{,}025}\n\nThe constant 63,025 is the approximation of\n\n33{,}000\\,\\frac{\\text{ft} \\cdot \\text{lbf}}{\\text{min}} \\cdot \\frac{ 12 \\, \\frac{\\text{in}} {\\text{ft}}} {2 \\pi ~ \\text{rad}} \\approx 63{,}025.\n\nIf torque and rotational speed are expressed in coherent SI units, the power is calculated by ;\n\nP = \\tau \\cdot \\omega\n\nwhere P is power in watts when  \\tau is torque in newton-metres, and \\omega is angular speed in radians per second. When using other units or if the speed is in revolutions per unit time rather than radians, a conversion factor has to be included.\n\nDefinitions\n\nThe following definitions have been or are widely used:\n\nIn certain situations it is necessary to distinguish between the various definitions of horsepower and thus a suffix is added: hp(I) for mechanical (or imperial) horsepower, hp(M) for metric horsepower, hp(S) for boiler (or steam) horsepower and hp(E) for electrical horsepower.\n\nHydraulic horsepower is equivalent to mechanical horsepower. The formula given above is for conversion to mechanical horsepower from the factors acting on a hydraulic system.\n\nMechanical horsepower\n\nAssuming the third CGPM (1901, CR 70) definition of standard gravity, gn=9.80665 m/s2, is used to define the pound-force as well as the kilogram force, and the international avoirdupois pound (1959), one mechanical horsepower is:\n\nOr given that 1 hp 550 ft·lbf/s, 1 ft \n 0.3048 m, 1 lbf ≈ 4.448 N, 1 J 1 N·m, 1 W \n 1 J/s: 1 hp ≈ 746 W\n\nMetric horsepower (PS, cv, hk, pk, ks, ch)\n\nThe various units used to indicate this definition (PS, cv, hk, pk, ks and ch) all translate to horse power in English, so it is common to see these values referred to as horsepower or hp in the press releases or media coverage of the German, French, Italian, and Japanese automobile companies. British manufacturers often intermix metric horsepower and mechanical horsepower depending on the origin of the engine in question. Sometimes the metric horsepower rating of an engine is conservative enough so that the same figure can be used for both 80/1269/EEC with metric hp and SAE J1349 with imperial hp.\n\nDIN 66036 defines one metric horsepower as the power to raise a mass of 75 kilograms against the Earth's gravitational force over a distance of one metre in one second: 75 kg · 9.80665 m/s2 · 1 m / 1 s 75 ·m/s \n 1 PS. This is equivalent to 735.49875 W, or 98.6% of an imperial mechanical horsepower.\n\nIn 1972, the PS was rendered obsolete by EEC directives, when it was replaced by the kilowatt as the official power-measuring unit. It is still in use for commercial and advertising purposes, in addition to the kW rating, as many customers are still not familiar with the use of kilowatts for engines.\n\nOther names for the metric horsepower are the Dutch  (pk), the French  (ch), the Spanish  and Portuguese  (cv), the Russian  (л. с.), the Swedish  (hk), the Finnish  (hv), the Estonian  (hj), the Norwegian and Danish  (hk), the Hungarian  (LE), the Czech  and Slovak   (k or ks), the Bosnian/Croatian/Serbian  (KS), the Bulgarian , the Macedonian  (KC), the Polish  (KM), Slovenian  (KM) and the Romanian  (CP), which all equal the German  (PS).\n\nIn the 19th century, the French had their own unit, which they used instead of the CV or horsepower. It was called the poncelet and was abbreviated p.\n\nTax horsepower\n\nTax horsepower is a non-linear rating of a motor vehicle for tax purposes. The fiscal power is  \\scriptstyle\\left(\\tfrac{P}{40}\\right)^{1.6} + \\tfrac{U}{45}, where P is the maximum power in kilowatts and U is the amount of carbon dioxide (CO2) emitted in grams per kilometre. The term for CO2 measurements has been included in the definition only since 1998, so older ratings in CV are not directly comparable.  The fiscal power has found its way into naming of automobile models, such as the popular Citroën deux-chevaux.  The  (ch) unit should not be confused with the French  (CV).\n\nElectrical horsepower\n\nThe horsepower used for electrical machines is defined as exactly 746 W.H. Wayne Beatty, Handbook of Electric Power Calculations Third Edition, McGraw Hill 2001,  , page 6-14 In the US, nameplates on electrical motors show their power output in hp, not their power input. Outside the United States watts or kilowatts are generally used for electric motor ratings and in such usage it is the output power that is stated.\n\nHydraulic horsepower \n\nHydraulic horsepower can represent the power available within hydraulic machinery, power through the down-hole nozzle of a drilling rig, or can be used to estimate the mechanical power needed to generate a known hydraulic flow rate.\n\nIt may be calculated as\n\\text{hydraulic horsepower} = \\frac{\\text{pressure} \\times \\text{flow rate}}{1714},\nwhere pressure is in psi, and flow rate is in US gallons per minute.\n\nDrilling rigs are powered mechanically by rotating the drill pipe from above. Hydraulic power is still needed though, as between 2 and 7 hp are required to push mud through the drill bit in order to clear waste rock. This hydraulic power, considerably more than this, may also be used to drive a down-hole mud motor to power directional drilling.\n\nBoiler horsepower \n\nBoiler horsepower is a boiler's capacity to deliver steam to a steam engine and is not the same unit of power as the 550 ft-lb/s definition. One boiler horsepower is equal to the thermal energy rate required to evaporate 34.5 lb of fresh water at 212 °F in one hour. In the early days of steam use, the boiler horsepower was roughly comparable to the horsepower of engines fed by the boiler.Robert McCain Johnston Elements of Applied Thermodynamics, Naval Institute Press, 1992 , p. 503.\n\nThe term \"boiler horsepower\" was originally developed at the Philadelphia Centennial Exhibition in 1876, where the best steam engines of that period were tested.  The average steam consumption of those engines (per output horsepower) was determined to be the evaporation of 30 pounds of water per hour, based on feed water at 100 °F, and saturated steam generated at 70 psig.  This original definition is equivalent to a boiler heat output of 33,485 Btu/h.  Years later in 1884, the ASME re-defined the boiler horsepower as the thermal output equal to the evaporation of 34.5 pounds per hour of water \"from and at\" 212 °F.  This considerably simplified boiler testing, and provided more accurate comparisons of the boilers at that time. This revised definition is equivalent to a boiler heat output of 33,469 Btu/h.  Present industrial practice is to define \"boiler horsepower\" as a boiler thermal output equal to 33,475 Btu/h, which is very close to the original and revised definitions.\n\nBoiler horsepower is still used to measure boiler output in industrial boiler engineering in Australia, the US, and New Zealand. Boiler horsepower is abbreviated BHP, not to be confused with brake horsepower, below, which is also called BHP.\n\nDrawbar horsepower\n\nDrawbar horsepower (dbhp) is the power a railway locomotive has available to haul a train or an agricultural tractor to pull an implement. This is a measured figure rather than a calculated one. A special railway car called a dynamometer car coupled behind the locomotive keeps a continuous record of the drawbar pull exerted, and the speed. From these, the power generated can be calculated. To determine the maximum power available, a controllable load is required; it is normally a second locomotive with its brakes applied, in addition to a static load.\n\nIf the drawbar force (F) is measured in pounds-force (lbf) and speed (v) is measured in miles per hour (mph), then the drawbar power (P) in horsepower (hp) is:\n\nP / {\\rm hp} = {(F / {\\rm lbf}) (v / {\\rm mph}) \\over 375}\n\nExample: How much power is needed to pull a drawbar load of 2,025 pounds-force at 5 miles per hour?\n\nP / {\\rm hp} =",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Horsepower" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14019" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Horsepower (hp) is a unit of measurement of power (the rate at which work is done). There are many different standards and types of horsepower. Two common definitions being used today are the mechanical horsepower (or imperial horsepower), which is 745.7 watts, and the metric horsepower, which is approximately 735.5 watts.\n\nThe term was adopted in the late 18th century by Scottish engineer James Watt to compare the output of steam engines with the power of draft horses. It was later expanded to include the output power of other types of piston engines, as well as turbines, electric motors and other machinery.[http://www.britannica.com/EBchecked/topic/272384/horsepower \"Horsepower\"], Encyclopædia Britannica Online. Retrieved 2012-06-24.[http://www.britannica.com/EBchecked/topic/291305/International-System-of-Units-SI \"International System of Units\" (SI)], Encyclopædia Britannica Online. Retrieved 2012-06-24. The definition of the unit varied among geographical regions. Most countries now use the SI unit watt for measurement of power. With the implementation of the EU Directive 80/181/EEC on January 1, 2010, the use of horsepower in the EU is permitted only as a supplementary unit.[http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2009:114:0010:0013:EN:PDF \"Directive 2009/3/EC of the European Parliament and of the Council of 11 March 2009\"], Official Journal of the European Union. Retrieved 2013-02-15.\n\nHistory\n\nThe development of the steam engine provided a reason to compare the output of horses with that of the engines that could replace them. In 1702, Thomas Savery wrote in The Miner's Friend:\n\nSo that an engine which will raise as much water as two horses, working together at one time in such a work, can do, and for which there must be constantly kept ten or twelve horses for doing the same. Then I say, such an engine may be made large enough to do the work required in employing eight, ten, fifteen, or twenty horses to be constantly maintained and kept for doing such a work…\n\nThe idea was later used by James Watt to help market his improved steam engine.  He had previously agreed to take royalties of one third of the savings in coal from the older Newcomen steam engines.  This royalty scheme did not work with customers who did not have existing steam engines but used horses instead.\n\nWatt determined that a horse could turn a mill wheel 144 times in an hour (or 2.4 times a minute).Hart-Davis, Adam, Engineers, pub Dorling Kindersley, 2012, p121.  The wheel was 12 ft in radius; therefore, the horse travelled 2.4 × 2π × 12 feet in one minute.  Watt judged that the horse could pull with a force of 180 lbf}}.  So:\n\n P \\frac{W}{t} \n \\frac{Fd}{t} \\frac{180\\,\\mathrm{lbf}\\times 2.4 \\times 2\\, \\pi \\times 12\\, \\mathrm{ft}}{1\\,\\mathrm{min}} \n 32,572 \\frac{\\mathrm{ft} \\cdot \\mathrm{lbf}}{\\mathrm{min.\n\nWatt defined and calculated the horsepower as 32,572 ft·lbf/min, which was rounded to an even 33,000 ft·lbf/min.\n\nWatt determined that a pony could lift an average 220 lbf 100 ft per minute over a four-hour working shift.  Watt then judged a horse was 50% more powerful than a pony and thus arrived at the 33,000 ft·lbf/min figure. Engineering in History recounts that John Smeaton initially estimated that a horse could produce 22,916 foot-pounds (31,070 N·m) per minute.Kirby, Richard Shelton (August 1, 1990). \"Engineering in History\". Dover Publications: 171. John Desaguliers had previously suggested 44,000 foot-pounds (59,656 N·m) per minute and Tredgold 27,500 foot-pounds (37,285 N·m) per minute.  \"Watt found by experiment in 1782 that a 'brewery horse' could produce 32,400 foot-pounds [43,928.5 N·m] per minute.\"  James Watt and Matthew Boulton standardized that figure at 33,000 foot-pounds (44,742 N·m) per minute the next year.\n\nA common legend states that the unit was created when one of Watt's first customers, a brewer, specifically demanded an engine that would match a horse, but tried to cheat by taking the strongest horse he had and driving it to the limit. Watt, while aware of the trick, accepted the challenge and built a machine which was actually even stronger than the figure achieved by the brewer, and it was the output of that machine which became the horsepower.Popular Mechanics. [https://books.google.co.il/books?id_d0DAAAAMBAJ&printsec\nfrontcover&sourcegbs_ge_summary_r&cad\n0#vonepage&q&f\nfalse September 1912, page 394]\n\nIn 1993, R. D. Stevenson and R. J. Wassersug published correspondence in Nature summarizing measurements and calculations of peak and sustained work rates of a horse. Citing measurements made at the 1926 Iowa State Fair, they reported that the peak power over a few seconds has been measured to be as high as 14.9 hp (11.1 kW) and also observed that for sustained activity, a work rate of about 1 hp (0.7457 kW) per horse is consistent with agricultural advice from both the 19th and 20th centuries and also consistent with a work rate of about 4 times the basal rate expended by other vertebrates for sustained activity.\n\nWhen considering human-powered equipment, a healthy human can produce about 1.2 hp briefly (see orders of magnitude) and sustain about 0.1 hp (74.57 W) indefinitely; trained athletes can manage up to about 2.5 hp (1.85 kW) brieflyEugene A. Avallone et. al, (ed), Marks' Standard Handbook for Mechanical Engineers 11th Edition , Mc-Graw Hill, New York 2007  page 9-4\nand 0.35 hp (260 W) for a period of several hours. The Jamaican sprinter Usain Bolt produced a maximum of 3.5 hp (2.6 kW) 0.89 seconds into his 9.58 second 100-metre dash world record in 2009.\n\nCalculating power\n\nWhen torque T is in pound-foot units, rotational speed (N) is in rpm and power is required in horsepower:\n\n P / \\text{hp} = \\frac{T / (\\text{ft} \\cdot \\text{lbf}) \\times N / \\text{rpm}} {5252}\n\nThe constant 5252 is the rounded value of (33,000 ft·lbf/min)/(2π rad/rev).\n\nWhen torque T is in inch pounds:\n\n P / \\text{hp} = \\frac{T / (\\text{in} \\cdot \\text{lbf}) \\times N / \\text{rpm}} {63{,}025}\n\nThe constant 63,025 is the approximation of\n\n33{,}000\\,\\frac{\\text{ft} \\cdot \\text{lbf}}{\\text{min}} \\cdot \\frac{ 12 \\, \\frac{\\text{in}} {\\text{ft}}} {2 \\pi ~ \\text{rad}} \\approx 63{,}025.\n\nIf torque and rotational speed are expressed in coherent SI units, the power is calculated by ;\n\nP = \\tau \\cdot \\omega\n\nwhere P is power in watts when  \\tau is torque in newton-metres, and \\omega is angular speed in radians per second. When using other units or if the speed is in revolutions per unit time rather than radians, a conversion factor has to be included.\n\nDefinitions\n\nThe following definitions have been or are widely used:\n\nIn certain situations it is necessary to distinguish between the various definitions of horsepower and thus a suffix is added: hp(I) for mechanical (or imperial) horsepower, hp(M) for metric horsepower, hp(S) for boiler (or steam) horsepower and hp(E) for electrical horsepower.\n\nHydraulic horsepower is equivalent to mechanical horsepower. The formula given above is for conversion to mechanical horsepower from the factors acting on a hydraulic system.\n\nMechanical horsepower\n\nAssuming the third CGPM (1901, CR 70) definition of standard gravity, gn=9.80665 m/s2, is used to define the pound-force as well as the kilogram force, and the international avoirdupois pound (1959), one mechanical horsepower is:\n\nOr given that 1 hp 550 ft·lbf/s, 1 ft \n 0.3048 m, 1 lbf ≈ 4.448 N, 1 J 1 N·m, 1 W \n 1 J/s: 1 hp ≈ 746 W\n\nMetric horsepower (PS, cv, hk, pk, ks, ch)\n\nThe various units used to indicate this definition (PS, cv, hk, pk, ks and ch) all translate to horse power in English, so it is common to see these values referred to as horsepower or hp in the press releases or media coverage of the German, French, Italian, and Japanese automobile companies. British manufacturers often intermix metric horsepower and mechanical horsepower depending on the origin of the engine in question. Sometimes the metric horsepower rating of an engine is conservative enough so that the same figure can be used for both 80/1269/EEC with metric hp and SAE J1349 with imperial hp.\n\nDIN 66036 defines one metric horsepower as the power to raise a mass of 75 kilograms against the Earth's gravitational force over a distance of one metre in one second: 75 kg · 9.80665 m/s2 · 1 m / 1 s 75 ·m/s \n 1 PS. This is equivalent to 735.49875 W, or 98.6% of an imperial mechanical horsepower.\n\nIn 1972, the PS was rendered obsolete by EEC directives, when it was replaced by the kilowatt as the official power-measuring unit. It is still in use for commercial and advertising purposes, in addition to the kW rating, as many customers are still not familiar with the use of kilowatts for engines.\n\nOther names for the metric horsepower are the Dutch  (pk), the French  (ch), the Spanish  and Portuguese  (cv), the Russian  (л. с.), the Swedish  (hk), the Finnish  (hv), the Estonian  (hj), the Norwegian and Danish  (hk), the Hungarian  (LE), the Czech  and Slovak   (k or ks), the Bosnian/Croatian/Serbian  (KS), the Bulgarian , the Macedonian  (KC), the Polish  (KM), Slovenian  (KM) and the Romanian  (CP), which all equal the German  (PS).\n\nIn the 19th century, the French had their own unit, which they used instead of the CV or horsepower. It was called the poncelet and was abbreviated p.\n\nTax horsepower\n\nTax horsepower is a non-linear rating of a motor vehicle for tax purposes. The fiscal power is  \\scriptstyle\\left(\\tfrac{P}{40}\\right)^{1.6} + \\tfrac{U}{45}, where P is the maximum power in kilowatts and U is the amount of carbon dioxide (CO2) emitted in grams per kilometre. The term for CO2 measurements has been included in the definition only since 1998, so older ratings in CV are not directly comparable.  The fiscal power has found its way into naming of automobile models, such as the popular Citroën deux-chevaux.  The  (ch) unit should not be confused with the French  (CV).\n\nElectrical horsepower\n\nThe horsepower used for electrical machines is defined as exactly 746 W.H. Wayne Beatty, Handbook of Electric Power Calculations Third Edition, McGraw Hill 2001,  , page 6-14 In the US, nameplates on electrical motors show their power output in hp, not their power input. Outside the United States watts or kilowatts are generally used for electric motor ratings and in such usage it is the output power that is stated.\n\nHydraulic horsepower \n\nHydraulic horsepower can represent the power available within hydraulic machinery, power through the down-hole nozzle of a drilling rig, or can be used to estimate the mechanical power needed to generate a known hydraulic flow rate.\n\nIt may be calculated as\n\\text{hydraulic horsepower} = \\frac{\\text{pressure} \\times \\text{flow rate}}{1714},\nwhere pressure is in psi, and flow rate is in US gallons per minute.\n\nDrilling rigs are powered mechanically by rotating the drill pipe from above. Hydraulic power is still needed though, as between 2 and 7 hp are required to push mud through the drill bit in order to clear waste rock. This hydraulic power, considerably more than this, may also be used to drive a down-hole mud motor to power directional drilling.\n\nBoiler horsepower \n\nBoiler horsepower is a boiler's capacity to deliver steam to a steam engine and is not the same unit of power as the 550 ft-lb/s definition. One boiler horsepower is equal to the thermal energy rate required to evaporate 34.5 lb of fresh water at 212 °F in one hour. In the early days of steam use, the boiler horsepower was roughly comparable to the horsepower of engines fed by the boiler.Robert McCain Johnston Elements of Applied Thermodynamics, Naval Institute Press, 1992 , p. 503.\n\nThe term \"boiler horsepower\" was originally developed at the Philadelphia Centennial Exhibition in 1876, where the best steam engines of that period were tested.  The average steam consumption of those engines (per output horsepower) was determined to be the evaporation of 30 pounds of water per hour, based on feed water at 100 °F, and saturated steam generated at 70 psig.  This original definition is equivalent to a boiler heat output of 33,485 Btu/h.  Years later in 1884, the ASME re-defined the boiler horsepower as the thermal output equal to the evaporation of 34.5 pounds per hour of water \"from and at\" 212 °F.  This considerably simplified boiler testing, and provided more accurate comparisons of the boilers at that time. This revised definition is equivalent to a boiler heat output of 33,469 Btu/h.  Present industrial practice is to define \"boiler horsepower\" as a boiler thermal output equal to 33,475 Btu/h, which is very close to the original and revised definitions.\n\nBoiler horsepower is still used to measure boiler output in industrial boiler engineering in Australia, the US, and New Zealand. Boiler horsepower is abbreviated BHP, not to be confused with brake horsepower, below, which is also called BHP.\n\nDrawbar horsepower\n\nDrawbar horsepower (dbhp) is the power a railway locomotive has available to haul a train or an agricultural tractor to pull an implement. This is a measured figure rather than a calculated one. A special railway car called a dynamometer car coupled behind the locomotive keeps a continuous record of the drawbar pull exerted, and the speed. From these, the power generated can be calculated. To determine the maximum power available, a controllable load is required; it is normally a second locomotive with its brakes applied, in addition to a static load.\n\nIf the drawbar force (F) is measured in pounds-force (lbf) and speed (v) is measured in miles per hour (mph), then the drawbar power (P) in horsepower (hp) is:\n\nP / {\\rm hp} = {(F / {\\rm lbf}) (v / {\\rm mph}) \\over 375}\n\nExample: How much power is needed to pull a drawbar load of 2,025 pounds-force at 5 miles per hour?\n\nP / {\\rm hp} =. Horsepower. http://en.wikipedia.org/?curid=14019."
  }
}
