{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19747",
  "eid" : "3d9680d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778612573,
  "textBody" : "Marcus Vipsanius Agrippa (; 64/62 BC – 12 BC) was a Roman consul, statesman, general and architect.  He was a close friend, son-in-law, and lieutenant to Gaius Julius Caesar Octavianus and was responsible for the construction of some of the most notable buildings in the history of Rome and for important military victories, most notably at the Battle of Actium in 31 BC against the forces of Mark Antony and Cleopatra. As a result of these victories, Octavianus became the first Roman Emperor, adopting the name of Augustus. Agrippa assisted Augustus in making Rome 'a city of marble\"http://ancienthistory.about.com/od/basics101/f/011508Marble.htm and renovating aqueducts to give all Romans, from every social class, access to the highest quality public services. He was responsible for the creation of many baths, porticoes and gardens, as well as the original Pantheon. Agrippa was also father-in-law to the second Emperor Tiberius, maternal grandfather to Caligula, and maternal great-grandfather to the Emperor Nero. \n\nEarly life\n\nAgrippa was born between 64–62 BC,Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#28.3 54.28.3] places Agrippa's death in late March 12 BC, while Pliny the Elder [http://penelope.uchicago.edu/Thayer/L/Roman/Texts/Pliny_the_Elder/7*.html#46 7.46] states that he died \"in his fifty-first year\". Depending on whether Pliny meant that Agrippa was aged 50 or 51 at his death, this gives a date of birth between March 64 and March 62. His family cognomen was the Latin form of Greek Agrippas, meaning \"wild horse\". A calendar from Cyprus or Syria includes a month named after Agrippa beginning on November 1, which may reflect the month of his birth. See Reinhold, pp. 2–4; Roddaz, pp. 23–26. in an uncertain location. His father was perhaps called Lucius Vipsanius Agrippa.cf Pantheon inscription \"M·AGRIPPA·L·F·COS·TERTIVM·FECIT\" [http://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/Europe/Italy/Lazio/Roma/Rome/_Texts/PLATOP*/Pantheon.html]. He had an elder brother whose name was also Lucius Vipsanius Agrippa, and a sister named Vipsania Polla. The family had not been prominent in Roman public life.Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2D*.html#96 2.96], [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2D*.html#127 127]. However, Agrippa was about the same age as Octavian (the future emperor Augustus), and the two were educated together and became close friends. Despite Agrippa's association with the family of Julius Caesar, his elder brother chose another side in the civil wars of the 40s BC, fighting under Cato against Caesar in Africa. When Cato's forces were defeated, Agrippa's brother was taken prisoner but freed after Octavian interceded on his behalf.Nicolaus of Damascus, [http://www.csun.edu/~hcfll004/nicolaus.html Life of Augustus] 7.\n\nIt is not known whether Agrippa fought against his brother in Africa, but he probably served in Caesar's campaign of 46–45 BC against Gnaeus Pompeius, which culminated in the Battle of Munda.Reinhold, pp. 13–14. Caesar regarded him highly enough to send him with Octavius in 45 BC to study in Apollonia (on the Illyrian coast) with the Macedonian legions, while Caesar consolidated his power in Rome.Suetonius, Life of Augustus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Augustus*.html#94.12 94.12]. In the fourth month of their stay in Apollonia the news of Julius Caesar's assassination in March 44 BC reached them. Agrippa and another friend, Quintus Salvidienus Rufus, advised Octavius to march on Rome with the troops from Macedonia, but Octavius decided to sail to Italy with a small retinue. After his arrival, he learned that Caesar had adopted him as his legal heir.Nicolaus of Damascus, [http://www.csun.edu/~hcfll004/nicolaus.html Life of Augustus] 16–17; Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2C*.html#59.5 2.59.5]. Octavius at this time took Caesar's name, but modern historians refer to him as \"Octavian\" during this period.\n\nRise to power\n\nAfter Octavian's return to Rome, he and his supporters realised they needed the support of legions. Agrippa helped Octavian to levy troops in Campania.Nicolaus of Damascus, [http://www.csun.edu/~hcfll004/nicolaus.html Life of Augustus] 31. It has been speculated that Agrippa was among the negotiators who won over Antony's Macedonian legions to Octavian, but there is no direct evidence for this; see Reinhold, p. 16. Once Octavian had his legions, he made a pact with Mark Antony and Lepidus, legally established in 43 BC as the Second Triumvirate. Octavian and his consular colleague Quintus Pedius arranged for Caesar's assassins to be prosecuted in their absence, and Agrippa was entrusted with the case against Gaius Cassius Longinus.Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2C*.html#69.5 2.69.5]; Plutarch, Life of Brutus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Plutarch/Lives/Brutus*.html#27.4 27.4]. It may have been in the same year that Agrippa began his political career, holding the position of Tribune of the Plebs, which granted him entry to the Senate.Mentioned only by Servius auctus on Virgil, Aeneid [https://archive.is/20120629050209/http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup=Serv.+A.+8.682 8.682], but a necessary preliminary to his position as urban praetor in 40 BC. Roddaz (p. 41) favours the 43 BC date.\n\nIn 42 BC, Agrippa probably fought alongside Octavian and Antony in the Battle of Philippi.Pliny the Elder [http://penelope.uchicago.edu/Thayer/L/Roman/Texts/Pliny_the_Elder/7*.html#148 7.148] cites him as an authority for Octavian's illness on the occasion. After their return to Rome, he played a major role in Octavian's war against Lucius Antonius and Fulvia Antonia, respectively the brother and wife of Mark Antony, which began in 41 BC and ended in the capture of Perusia in 40 BC. However, Salvidienus remained Octavian's main general at this time.Reinhold, pp. 17–20. After the Perusine war, Octavian departed for Gaul, leaving Agrippa as urban praetor in Rome with instructions to defend Italy against Sextus Pompeius, an opponent of the Triumvirate who was now occupying Sicily. In July 40, while Agrippa was occupied with the Ludi Apollinares that were the praetor's responsibility, Sextus began a raid in southern Italy. Agrippa advanced on him, forcing him to withdraw.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#20 48.20]; Reinhold, p. 22. However, the Triumvirate proved unstable, and in August 40 both Sextus and Antony invaded Italy (but not in an organized alliance). Agrippa's success in retaking Sipontum from Antony helped bring an end to the conflict.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#28 48.28]; Reinhold, p. 23. Agrippa was among the intermediaries through whom Antony and Octavian agreed once more upon peace. During the discussions Octavian learned that Salvidienus had offered to betray him to Antony, with the result that Salvidienus was prosecuted and either executed or committed suicide. Agrippa was now Octavian's leading general.Reinhold, pp. 23–24.\n\nIn 39 or 38 BC, Octavian appointed Agrippa governor of Transalpine Gaul, where in 38 he put down a rising of the Aquitanians. He also fought the Germanic tribes, becoming the next Roman general to cross the Rhine after Julius Caesar.Dio, [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#49 48.49] He was summoned back to Rome by Octavian to assume the consulship for 37 BC. He was well below the usual minimum age of 43, but Octavian had suffered a humiliating naval defeat against Sextus Pompey and needed his friend to oversee the preparations for further warfare. Agrippa refused the offer of a triumph for his exploits in Gaul – on the grounds, says Dio, that he thought it improper to celebrate during a time of trouble for Octavian.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#49 48.49]; Reinhold, pp. 25–29. Agrippa's youth is noted by Lendering, \"[http://www.livius.org/vi-vr/vipsanius/agrippa.html#Philippi From Philippi to Actium]\". Since Sextus Pompeius had command of the sea on the coasts of Italy, Agrippa's first care was to provide a safe harbour for his ships. He accomplished this by cutting through the strips of land which separated the Lacus Lucrinus from the sea, thus forming an outer harbour, while joining the lake Avernus to the Lucrinus to serve as an inner harbor.Reinhold, pp. 29–32. The new harbor-complex was named Portus Julius in Octavian's honour.Suetonius, Life of Augustus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Augustus*.html#16 16.1]. Agrippa was also responsible for technological improvements, including larger ships and an improved form of grappling hook.Appian, Civil Wars [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Appian/Civil_Wars/5*.html#106 2.106], [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Appian/Civil_Wars/5*.html#118 118–119]; Reinhold, pp. 33–35. About this time, he married Caecilia Pomponia Attica, daughter of Cicero's friend Titus Pomponius Atticus.Reinhold, pp. 35–37.\n\nIn 36 BC, Octavian and Agrippa set sail against Sextus. The fleet was badly damaged by storms and had to withdraw; Agrippa was left in charge of the second attempt. Thanks to superior technology and training, Agrippa and his men won decisive victories at Mylae and Naulochus, destroying all but seventeen of Sextus' ships and compelling most of his forces to surrender. Octavian, with his power increased, forced the triumvir Lepidus into retirement and entered Rome in triumph.Reinhold, pp. 37–42. Agrippa received the unprecedented honour of a naval crown decorated with the beaks of ships; as Dio remarks, this was \"a decoration given to nobody before or since\".Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/49*.html#14.3 49.14.3].\n\nLife in public service\n\nAgrippa participated in smaller military campaigns in 35 and 34 BC, but by the autumn of 34 he had returned to Rome.Reinhold, pp. 45–47. He rapidly set out on a campaign of public repairs and improvements, including renovation of the aqueduct known as the Aqua Marcia and an extension of its pipes to cover more of the city. He became the first water commissioner of Rome in 33 BC. Through his actions after being elected in 33 BC as one of the aediles (officials responsible for Rome's buildings and festivals), the streets were repaired and the sewers were cleaned out, while lavish public spectacles were put on.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/49*.html#42 49.42–43]. Agrippa signalled his tenure of office by effecting great improvements in the city of Rome, restoring and building aqueducts, enlarging and cleansing the Cloaca Maxima, constructing baths and porticos, and laying out gardens. He also gave a stimulus to the public exhibition of works of art. It was unusual for an ex-consul to hold the lower-ranking position of aedile,Lendering, \"[http://www.livius.org/vi-vr/vipsanius/agrippa.html#Philippi From Philippi to Actium]\". but Agrippa's success bore out this break with tradition. As emperor, Augustus would later boast that \"he had found the city of brick but left it of marble\", thanks in part to the great services provided by Agrippa under his reign.\n\nAntony and Cleopatra\n\nAgrippa was again called away to take command of the fleet when the war with Antony and Cleopatra broke out. He captured the strategically important city of Methone at the southwest of the Peloponnese, then sailed north, raiding the Greek coast and capturing Corcyra (modern Corfu). Octavian then brought his forces to Corcyra, occupying it as a naval base.Orosius, History Against the Pagans [http://www.attalus.org/latin/orosius6B.html#19 6.19.6–7]; Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#11 50.11.1–12.3]; Reinhold, pp. 53–54. Antony drew up his ships and troops at Actium, where Octavian moved to meet him. Agrippa meanwhile defeated Antony's supporter Quintus Nasidius in a naval battle at Patrae.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#13.5 50.13.5]. Dio relates that as Agrippa moved to join Octavian near Actium, he encountered Gaius Sosius, one of Antony's lieutenants, who was making a surprise attack on the squadron of Lucius Tarius, a supporter of Octavian. Agrippa's unexpected arrival turned the battle around.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#14 50.14.1–2]; cf. Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2C*.html#84.2 2.84.2] (\"Agrippa ... before the final conflict had twice defeated the fleet of the enemy\"). Dio is wrong to say that Sosius was killed, since he in fact fought at and survived the Battle of Actium (Reinhold, p. 54 n. 14; Roddaz, p. 163 n. 140).\n\nAs the decisive battle approached, according to Dio, Octavian received intelligence that Antony and Cleopatra planned to break past his naval blockade and escape. At first he wished to allow the flagships past, arguing that he could overtake them with his lighter vessels and that the other opposing ships would surrender when they saw their leaders' cowardice. Agrippa objected that Antony's ships, although larger, could outrun Octavian's if they hoisted sails, and that Octavian ought to fight now because Antony's fleet had just been struck by storms. Octavian followed his friend's advice.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#31 50.31.1–3].\n\nOn September 2, 31 BC, the Battle of Actium was fought. Octavian's victory, which gave him the mastery of Rome and the empire, was mainly due to Agrippa.Reinhold, pp. 57–58; Roddaz, pp. 178–81. Octavian then bestowed upon him the hand of his niece Claudia Marcella Major in 28 BC. He also served a second consulship with Octavian the same year. In 27 BC, Agrippa held a third consulship with Octavian, and in that year, the senate also bestowed upon Octavian the imperial title of Augustus.\n\nIn commemoration of the Battle of Actium, Agrippa built and dedicated the building that served as the Roman Pantheon before its destruction in 80AD. Emperor Hadrian used Agrippa's design to build his own Pantheon, which survives in Rome. The inscription of the later building, which was built around 125, preserves the text of the inscription from Agrippa's building during his third consulship. The years following his third consulship, Agrippa spent in Gaul, reforming the provincial administration and taxation system, along with building an effective road system and aqueducts.\n\nLate life\n\nAgrippa's friendship with Augustus seems to have been clouded by the jealousy of Augustus' nephew Marcus Claudius Marcellus, which was probably instigated by the intrigues of Livia, the third wife of Augustus, who feared his influence over her husband. Traditionally it is said the result of such jealousy was that Agrippa left Rome, ostensibly to take over the governorship of eastern provinces – a sort of honourable exile, but he only sent his legate to Syria, while he himself remained at Lesbos and governed by proxy, though he may have been on a secret mission to negotiate with the Parthians about the return of the Roman legions standards which they held.David Magie, The Mission of Agrippa to the Orient in 23 BC, Classical Philology, Vol. 3, No. 2 (Apr., 1908), pp. 145–52 On the death of Marcellus, which took place within a year of his exile, he was recalled to Rome by Augustus, who found he could not dispense with his services. However, if one places the events in the context of the crisis in 23 BC it seems unlikely that, when facing significant opposition and about to make a major political climb down, the emperor Augustus would place a man in exile in charge of the largest body of Roman troops. What is far more likely is that Agrippa's 'exile' was actually the careful political positioning of a loyal lieutenant in command of a significant army as a backup plan in case the settlement plans of 23 BC failed and Augustus needed military support.Syme (1939), 342. Moreover, after 23 BC as part of what became known as Augustus' Second Constitutional Settlement, Agrippa's constitutional powers were greatly increased to provide the Principate of Augustus with greater constitutional stability by providing for a political heir or replacement for Augustus if he were to succumb to his habitual ill health or was assassinated. In the course of the year proconsular imperium, similar to Augustus' power, was conferred upon Agrippa for five years. The exact nature of the grant is uncertain but it probably covered Augustus' imperial provinces, east and west, perhaps lacking authority over the provinces of the Senate. That was to come later, as was the jealously guarded tribunicia potestas, or powers of a tribune of the plebeians.Syme (1939), 337–38. These great powers of state are not usually heaped upon a former exile.\n\nIt is said that Maecenas advised Augustus to attach Agrippa still more closely to him by making him his son-in-law.Cassius Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#6 54.6] He accordingly induced him to divorce Marcella and marry his daughter Julia the Elder by 21 BC, the widow of Marcellus,Suetonius, The Life of Augustus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Augustus*.html#63 63]; Dio, [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#6.5 6.5]; Reinhold, Marcus Agrippa. A biography, pp. 67–68, 86–87. equally celebrated for her beauty, abilities, and her shameless extravagance. In 19 BC, Agrippa was employed in putting down a rising of the Cantabrians in Hispania (Cantabrian Wars).\n\nIn 18 BC, Agrippa's powers were even further increased to almost match those of Augustus. That year his proconsular imperium was augmented to cover the provinces of the Senate. More than that, he was finally granted tribunicia potestas, or powers of a tribune of the plebeians. As was the case with Augustus, Agrippa’s grant of tribunician powers was conferred without his having to actually hold that office.Dio, Roman History [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#12.4 54.12.4]. These powers were considerable, giving him veto power over the acts of the Senate or other magistracies, including those of other tribunes, and the power to present laws for approval by the People. Just as important, a tribune’s person was sacred, meaning that any person who harmfully touched them or impeded their actions, including political acts, could lawfully be killed.Everett (2006), 217. After the grant of these powers Agrippa was, on paper, almost as powerful as Augustus was. However, there was no doubt that Augustus was the man in charge.\n\nAgrippa was appointed governor of the eastern provinces a second time in 17 BC, where his just and prudent administration won him the respect and good-will of the provincials, especially from the Jewish population. Agrippa also restored effective Roman control over the Cimmerian Chersonnese (Crimean Peninsula) during his governorship.\n\nAgrippa’s last public service was his beginning of the conquest of the upper Danube River region, which would become the Roman province of Pannonia in 13 BC.Dio, [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#28 28] He died at Campania in 12 BC at the age of 51. His posthumous son, Marcus Vipsanius Agrippa Postumus, was named in his honor. Augustus honoured his memory by a magnificent funeral and spent over a month in mourning. Augustus personally oversaw all of Agrippa's children’s educations. Although Agrippa had built a tomb for himself, Augustus had Agrippa's remains placed in Augustus' own mausoleum.Cassius Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#28.5 54.28.5]\n\nLegacy\n\nAgrippa was also known as a writer, especially on the subject of geography. Under his supervision, Julius Caesar's dream of having a complete survey of the Empire made was carried out. Agrippa constructed a circular chart, which was later engraved on marble by Augustus, and afterwards placed in the colonnade built by his sister Polla. Amongst his writings, an autobiography, now lost, is referenced.\n\nAgrippa had it established a standard for Roman foot (Agrippa's own) in 29 BC, and thus a definition of a pace as 5 feet. An imperial Roman mile denotes 5,000 Roman feet.\n\nThe term Via Agrippa is used for any part of the network of roadways in Gaul built by Agrippa. Some of these still exist as paths or even as highways.\n\nMarriages and issue\n\nAgrippa had several children through his three marriages:\n* By his first wife, Caecilia Attica, he had a daughter, Vipsania Agrippina, who was to be the first wife of the Emperor Tiberius, and who gave birth to a son, Drusus the Younger.\n* By his second wife, Claudia Marcella Major, he may have had a daughter, whose existence remains unclear, but this hypothetical figure is referred to as \"Vipsania Marcella\". It is possible that this daughter may have been a second daughter by Caecilia Attica, but there is no information to say one way or the other. The existence of this daughter rests solely on Publius Quinctilius Varus being mentioned as the son-in-law of Agrippa in Augustus' funeral oration for Agrippa.Kölner Papyrus I (1976), no. 10.\n* By his third wife, Julia the Elder (daughter of Augustus), he had five children: Gaius Caesar, Julia the Younger, Lucius Caesar, Agrippina the Elder (wife of Germanicus, mother of the Emperor Caligula and Empress Agrippina the Younger), and Agrippa Postumus (a posthumous son).\n\nThrough his numerous children, Agrippa would become ancestor to many subsequent members of the Julio-Claudian dynasty, whose position he helped to attain, as well as many other reputed Romans.\n\n* (with Caecilia Attica)\n** 1. Vipsania Agrippina I, 36 BC – AD 20, had at least 6 children by 2 husbands (1 by Tiberius, at least 5 by Gaius Asinius Gallus)\n*** A. Drusus Julius Caesar, 13 BC – AD 23, had 3 children\n**** I. Julia Livia, AD 5–43, had at least 1 child\n***** a. Rubellius Plautus, AD 33–62, may have had several children, but none of them survived Nero's purges in 66.\n**** II. Tiberius Julius Caesar Nero 'Gemellus', AD 19–37 or 38, died without issue\n**** III. Tiberius Claudius Caesar Germanicus II 'Gemellus', AD 19–23, died young\n*** B. Gaius Asinius Pollio, died AD 45, children unknown\n*** C. Marcus Asinius Agrippa, died AD 26\n*** D. (?Gnaeus) Asinius Saloninus, died AD 22May be the 'Gnaeus Asinius' mentioned in the records of the townsfolk of Puteoli, to whom that man was a patron\n*** E. Servius Asinius Celer,Consul suffectus in AD 38Seneca, The Pumpkinification of Claudius died before mid-47, had 1 child\n**** a. Asinia Agrippina\n*** F. (?Lucius) Asinius GallusCassius Dio (60.27.5)\n* (with Julia Caesaris)\n** 2. Gaius Julius Caesar, 20 BC – AD 4, died without issue\n** 3. Vipsania Julia Agrippina (Julia the Younger), 19 BC – AD 28, had two children;\n*** A. Aemilia Lepida (fiancee of Claudius), 4 BC – AD 53, had five children;\n**** I. Marcus Junius Silanus Torquatus, 14–54, had one child;\n***** a. Lucius Junius Silanus Torquatus the younger, 50–66, died young\n**** II. Junia Calvina, 15–79, died without issue\n**** III. Decimus Junius Silanus Torquatus, d. 64 without issue\n**** IV. Lucius Junius Silanus Torquatus the elder, d. 49 without issue\n**** V. Junia Lepida, c. 18–65, issue unknown\n*** B. Unnamed illegitimate son (by Decimus Junius Silanus), d. AD 8 (ordered to be exposed by Augustus)\n** 4. Lucius Julius Caesar, 17 BC – AD 2, died without issue\n** 5. Vipsania Agrippina II (Agrippina the Elder), 14 BC – AD 33, had nine children, of whom three died young;\n*** A. Nero Julius Caesar Germanicus, 6–30, died without issue\n*** B. Drusus Julius Caesar Germanicus, 7–33, died without issue\n*** C. Gaius Julius Caesar, bef. AD 12 – bef. AD 12CIL 06, 00889\n*** D. Gaius Julius Caesar Germanicus (Caligula), 12–41, had one child;\n**** I. Julia Drusilla, 39–41, died young\n*** E. Julia Agrippina (Agrippina the Younger), 15–59, had one child;\n**** I. Nero Claudius Caesar Augustus Germanicus (Lucius Domitius Ahenobarbus), 37–68, had one child;\n***** a. Claudia Augusta, Jan. 63 – April 63; died young\n*** F. Julia Drusilla, 16–38, died without issue\n*** G. Julia Livilla, 18–42, died without issue\n*** H. Tiberius Julius Caesar, ? – ? (either born before Nero Julius Caesar, between Drusus Caesar and Gaius Caesar (Caligula) or between Gaius Caesar (Caligula) and Julia Agrippina)CIL 06, 00888\n*** ?I. Son (name unknown), ? – ?CIL 06, 00890\n** 6. Marcus Julius Caesar Agrippa Postumus, 12 BC – AD 14, died without issue\n\nThere have been some attempts to assign further descendants to a number of the aforementioned figures, including two lines of Asinii descended from Gaius Asinius Pollio and Marcus Asinius Agrippa respectively. A daughter (and further descendants) named Rubellia Bassa to Julia, who may have been a daughter of Gaius Rubellius Blandus by an earlier marriage. And, finally, a series of descendants from Junia Lepida and her husband, Gaius Cassius Longinus. However, all of these lines of descent are extremely hypothetical and lack any evidence to support a connection to the descendants of Agrippa.\n\nAgrippa in popular culture\n\nDrama\n\nAgrippa is a character in William Shakespeare's play Antony and Cleopatra.\n\nA fictional version of Agrippa in his later life played a prominent role in the 1976 BBC Television series I, Claudius. Agrippa was portrayed as a much older man, though he would have only been 39 years old at the time of the first episode (24/23 BC).  He was played by John Paul.\n\nAgrippa is the main character in Paul Naschy's 1980 film Los cántabros, played by Naschy himself. It is a highly fictionalized version of the Cantabrian Wars in which Agrippa is depicted as the lover of the sister of Cantabrian leader Corocotta.\n\nAgrippa appears in several film versions of the life of Cleopatra. He is normally portrayed as an old man rather than a young one. Among the people to portray him are Philip Locke, Alan Rowe and Andrew Keir.\n\nAgrippa is also one of the principal characters in the British/Italian joint project Imperium: Augustus (2003) featuring flashbacks between Augustus and Julia about Agrippa, which shows him in his youth on serving in Caesar's army up until his victory at Actium and the defeat of Cleopatra. He is portrayed by Ken Duken. In the 2005 series Empire the young Agrippa (played by Christopher Egan) becomes Octavian's sidekick after saving him from an attempted poisoning.\n\nMarcus Agrippa, a highly fictional character based on Marcus Vipsanius Agrippa's early life, is part of the BBC-HBO-RAI television series Rome. He is played by Allen Leech. He describes himself as the grandson of a slave. The series creates a romantic relationship between Agrippa and Octavian's sister Octavia Minor, for which there is no historical evidence.\n\nLiterature\n\nAgrippa is mentioned by name in book VIII of Virgil's The Aeneid, where Aeneas sees an image of Agrippa leading ships in the Battle of Actium on the shield forged for him by Vulcan and given to him by his mother, Venus.Virgil, The Aeneid, trans. Robert Fitzgerald, Vintage Classics, pp. 252.\n\nAgrippa is a main character in the early part of Robert Graves novel I, Claudius. He is a main character in the later two novels of Colleen McCullough's Masters of Rome series. He is a featured character of prominence and importance in the historical fiction novel Cleopatra's Daughter by Michelle Moran. He also features prominently in John Edward Williams' historical novel Augustus. In the backstory of Gunpowder Empire, the first volume in Harry Turtledove's Crosstime Traffic series, Agrippa lived until AD 26, conquering all of Germania for the Empire and becoming the second Emperor when Augustus died in AD 14.\n\nVideo games\n\nA heavily fictionalized version of Agrippa is one of the playable characters (the other being an equally fictionalized Augustus) in the video game Shadow of Rome. There, Agrippa is sentenced to become a gladiator after his father was wrongly sentenced for assassinating Caesar. Agrippa's goal is to stay alive as a gladiator for as long as possible, while Augustus acts as an infiltrator who slowly exposes the conspiracy against Caesar. Eventually, Augustus is able to prove Vipsanius' innocence and both of them are pardoned. Then a civil war breaks out, because the direct successor was outraged by exposure of the conspiracy. Agrippa and Augustus fight against Antonius. Agrippa appears as a Great Admiral in the computer game Sid Meier's Civilization V. A fictionalized version of Agrippa also appears in the video game Assassin's Creed Origins as the commander of the Roman Citadel in the province of Kyrenaika where the player character has to kill him and retrieve a document from his body.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Marcus Vipsanius Agrippa" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19747" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Marcus Vipsanius Agrippa (; 64/62 BC – 12 BC) was a Roman consul, statesman, general and architect.  He was a close friend, son-in-law, and lieutenant to Gaius Julius Caesar Octavianus and was responsible for the construction of some of the most notable buildings in the history of Rome and for important military victories, most notably at the Battle of Actium in 31 BC against the forces of Mark Antony and Cleopatra. As a result of these victories, Octavianus became the first Roman Emperor, adopting the name of Augustus. Agrippa assisted Augustus in making Rome 'a city of marble\"http://ancienthistory.about.com/od/basics101/f/011508Marble.htm and renovating aqueducts to give all Romans, from every social class, access to the highest quality public services. He was responsible for the creation of many baths, porticoes and gardens, as well as the original Pantheon. Agrippa was also father-in-law to the second Emperor Tiberius, maternal grandfather to Caligula, and maternal great-grandfather to the Emperor Nero. \n\nEarly life\n\nAgrippa was born between 64–62 BC,Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#28.3 54.28.3] places Agrippa's death in late March 12 BC, while Pliny the Elder [http://penelope.uchicago.edu/Thayer/L/Roman/Texts/Pliny_the_Elder/7*.html#46 7.46] states that he died \"in his fifty-first year\". Depending on whether Pliny meant that Agrippa was aged 50 or 51 at his death, this gives a date of birth between March 64 and March 62. His family cognomen was the Latin form of Greek Agrippas, meaning \"wild horse\". A calendar from Cyprus or Syria includes a month named after Agrippa beginning on November 1, which may reflect the month of his birth. See Reinhold, pp. 2–4; Roddaz, pp. 23–26. in an uncertain location. His father was perhaps called Lucius Vipsanius Agrippa.cf Pantheon inscription \"M·AGRIPPA·L·F·COS·TERTIVM·FECIT\" [http://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/Europe/Italy/Lazio/Roma/Rome/_Texts/PLATOP*/Pantheon.html]. He had an elder brother whose name was also Lucius Vipsanius Agrippa, and a sister named Vipsania Polla. The family had not been prominent in Roman public life.Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2D*.html#96 2.96], [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2D*.html#127 127]. However, Agrippa was about the same age as Octavian (the future emperor Augustus), and the two were educated together and became close friends. Despite Agrippa's association with the family of Julius Caesar, his elder brother chose another side in the civil wars of the 40s BC, fighting under Cato against Caesar in Africa. When Cato's forces were defeated, Agrippa's brother was taken prisoner but freed after Octavian interceded on his behalf.Nicolaus of Damascus, [http://www.csun.edu/~hcfll004/nicolaus.html Life of Augustus] 7.\n\nIt is not known whether Agrippa fought against his brother in Africa, but he probably served in Caesar's campaign of 46–45 BC against Gnaeus Pompeius, which culminated in the Battle of Munda.Reinhold, pp. 13–14. Caesar regarded him highly enough to send him with Octavius in 45 BC to study in Apollonia (on the Illyrian coast) with the Macedonian legions, while Caesar consolidated his power in Rome.Suetonius, Life of Augustus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Augustus*.html#94.12 94.12]. In the fourth month of their stay in Apollonia the news of Julius Caesar's assassination in March 44 BC reached them. Agrippa and another friend, Quintus Salvidienus Rufus, advised Octavius to march on Rome with the troops from Macedonia, but Octavius decided to sail to Italy with a small retinue. After his arrival, he learned that Caesar had adopted him as his legal heir.Nicolaus of Damascus, [http://www.csun.edu/~hcfll004/nicolaus.html Life of Augustus] 16–17; Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2C*.html#59.5 2.59.5]. Octavius at this time took Caesar's name, but modern historians refer to him as \"Octavian\" during this period.\n\nRise to power\n\nAfter Octavian's return to Rome, he and his supporters realised they needed the support of legions. Agrippa helped Octavian to levy troops in Campania.Nicolaus of Damascus, [http://www.csun.edu/~hcfll004/nicolaus.html Life of Augustus] 31. It has been speculated that Agrippa was among the negotiators who won over Antony's Macedonian legions to Octavian, but there is no direct evidence for this; see Reinhold, p. 16. Once Octavian had his legions, he made a pact with Mark Antony and Lepidus, legally established in 43 BC as the Second Triumvirate. Octavian and his consular colleague Quintus Pedius arranged for Caesar's assassins to be prosecuted in their absence, and Agrippa was entrusted with the case against Gaius Cassius Longinus.Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2C*.html#69.5 2.69.5]; Plutarch, Life of Brutus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Plutarch/Lives/Brutus*.html#27.4 27.4]. It may have been in the same year that Agrippa began his political career, holding the position of Tribune of the Plebs, which granted him entry to the Senate.Mentioned only by Servius auctus on Virgil, Aeneid [https://archive.is/20120629050209/http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup=Serv.+A.+8.682 8.682], but a necessary preliminary to his position as urban praetor in 40 BC. Roddaz (p. 41) favours the 43 BC date.\n\nIn 42 BC, Agrippa probably fought alongside Octavian and Antony in the Battle of Philippi.Pliny the Elder [http://penelope.uchicago.edu/Thayer/L/Roman/Texts/Pliny_the_Elder/7*.html#148 7.148] cites him as an authority for Octavian's illness on the occasion. After their return to Rome, he played a major role in Octavian's war against Lucius Antonius and Fulvia Antonia, respectively the brother and wife of Mark Antony, which began in 41 BC and ended in the capture of Perusia in 40 BC. However, Salvidienus remained Octavian's main general at this time.Reinhold, pp. 17–20. After the Perusine war, Octavian departed for Gaul, leaving Agrippa as urban praetor in Rome with instructions to defend Italy against Sextus Pompeius, an opponent of the Triumvirate who was now occupying Sicily. In July 40, while Agrippa was occupied with the Ludi Apollinares that were the praetor's responsibility, Sextus began a raid in southern Italy. Agrippa advanced on him, forcing him to withdraw.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#20 48.20]; Reinhold, p. 22. However, the Triumvirate proved unstable, and in August 40 both Sextus and Antony invaded Italy (but not in an organized alliance). Agrippa's success in retaking Sipontum from Antony helped bring an end to the conflict.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#28 48.28]; Reinhold, p. 23. Agrippa was among the intermediaries through whom Antony and Octavian agreed once more upon peace. During the discussions Octavian learned that Salvidienus had offered to betray him to Antony, with the result that Salvidienus was prosecuted and either executed or committed suicide. Agrippa was now Octavian's leading general.Reinhold, pp. 23–24.\n\nIn 39 or 38 BC, Octavian appointed Agrippa governor of Transalpine Gaul, where in 38 he put down a rising of the Aquitanians. He also fought the Germanic tribes, becoming the next Roman general to cross the Rhine after Julius Caesar.Dio, [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#49 48.49] He was summoned back to Rome by Octavian to assume the consulship for 37 BC. He was well below the usual minimum age of 43, but Octavian had suffered a humiliating naval defeat against Sextus Pompey and needed his friend to oversee the preparations for further warfare. Agrippa refused the offer of a triumph for his exploits in Gaul – on the grounds, says Dio, that he thought it improper to celebrate during a time of trouble for Octavian.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/48*.html#49 48.49]; Reinhold, pp. 25–29. Agrippa's youth is noted by Lendering, \"[http://www.livius.org/vi-vr/vipsanius/agrippa.html#Philippi From Philippi to Actium]\". Since Sextus Pompeius had command of the sea on the coasts of Italy, Agrippa's first care was to provide a safe harbour for his ships. He accomplished this by cutting through the strips of land which separated the Lacus Lucrinus from the sea, thus forming an outer harbour, while joining the lake Avernus to the Lucrinus to serve as an inner harbor.Reinhold, pp. 29–32. The new harbor-complex was named Portus Julius in Octavian's honour.Suetonius, Life of Augustus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Augustus*.html#16 16.1]. Agrippa was also responsible for technological improvements, including larger ships and an improved form of grappling hook.Appian, Civil Wars [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Appian/Civil_Wars/5*.html#106 2.106], [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Appian/Civil_Wars/5*.html#118 118–119]; Reinhold, pp. 33–35. About this time, he married Caecilia Pomponia Attica, daughter of Cicero's friend Titus Pomponius Atticus.Reinhold, pp. 35–37.\n\nIn 36 BC, Octavian and Agrippa set sail against Sextus. The fleet was badly damaged by storms and had to withdraw; Agrippa was left in charge of the second attempt. Thanks to superior technology and training, Agrippa and his men won decisive victories at Mylae and Naulochus, destroying all but seventeen of Sextus' ships and compelling most of his forces to surrender. Octavian, with his power increased, forced the triumvir Lepidus into retirement and entered Rome in triumph.Reinhold, pp. 37–42. Agrippa received the unprecedented honour of a naval crown decorated with the beaks of ships; as Dio remarks, this was \"a decoration given to nobody before or since\".Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/49*.html#14.3 49.14.3].\n\nLife in public service\n\nAgrippa participated in smaller military campaigns in 35 and 34 BC, but by the autumn of 34 he had returned to Rome.Reinhold, pp. 45–47. He rapidly set out on a campaign of public repairs and improvements, including renovation of the aqueduct known as the Aqua Marcia and an extension of its pipes to cover more of the city. He became the first water commissioner of Rome in 33 BC. Through his actions after being elected in 33 BC as one of the aediles (officials responsible for Rome's buildings and festivals), the streets were repaired and the sewers were cleaned out, while lavish public spectacles were put on.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/49*.html#42 49.42–43]. Agrippa signalled his tenure of office by effecting great improvements in the city of Rome, restoring and building aqueducts, enlarging and cleansing the Cloaca Maxima, constructing baths and porticos, and laying out gardens. He also gave a stimulus to the public exhibition of works of art. It was unusual for an ex-consul to hold the lower-ranking position of aedile,Lendering, \"[http://www.livius.org/vi-vr/vipsanius/agrippa.html#Philippi From Philippi to Actium]\". but Agrippa's success bore out this break with tradition. As emperor, Augustus would later boast that \"he had found the city of brick but left it of marble\", thanks in part to the great services provided by Agrippa under his reign.\n\nAntony and Cleopatra\n\nAgrippa was again called away to take command of the fleet when the war with Antony and Cleopatra broke out. He captured the strategically important city of Methone at the southwest of the Peloponnese, then sailed north, raiding the Greek coast and capturing Corcyra (modern Corfu). Octavian then brought his forces to Corcyra, occupying it as a naval base.Orosius, History Against the Pagans [http://www.attalus.org/latin/orosius6B.html#19 6.19.6–7]; Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#11 50.11.1–12.3]; Reinhold, pp. 53–54. Antony drew up his ships and troops at Actium, where Octavian moved to meet him. Agrippa meanwhile defeated Antony's supporter Quintus Nasidius in a naval battle at Patrae.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#13.5 50.13.5]. Dio relates that as Agrippa moved to join Octavian near Actium, he encountered Gaius Sosius, one of Antony's lieutenants, who was making a surprise attack on the squadron of Lucius Tarius, a supporter of Octavian. Agrippa's unexpected arrival turned the battle around.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#14 50.14.1–2]; cf. Velleius Paterculus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Velleius_Paterculus/2C*.html#84.2 2.84.2] (\"Agrippa ... before the final conflict had twice defeated the fleet of the enemy\"). Dio is wrong to say that Sosius was killed, since he in fact fought at and survived the Battle of Actium (Reinhold, p. 54 n. 14; Roddaz, p. 163 n. 140).\n\nAs the decisive battle approached, according to Dio, Octavian received intelligence that Antony and Cleopatra planned to break past his naval blockade and escape. At first he wished to allow the flagships past, arguing that he could overtake them with his lighter vessels and that the other opposing ships would surrender when they saw their leaders' cowardice. Agrippa objected that Antony's ships, although larger, could outrun Octavian's if they hoisted sails, and that Octavian ought to fight now because Antony's fleet had just been struck by storms. Octavian followed his friend's advice.Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/50*.html#31 50.31.1–3].\n\nOn September 2, 31 BC, the Battle of Actium was fought. Octavian's victory, which gave him the mastery of Rome and the empire, was mainly due to Agrippa.Reinhold, pp. 57–58; Roddaz, pp. 178–81. Octavian then bestowed upon him the hand of his niece Claudia Marcella Major in 28 BC. He also served a second consulship with Octavian the same year. In 27 BC, Agrippa held a third consulship with Octavian, and in that year, the senate also bestowed upon Octavian the imperial title of Augustus.\n\nIn commemoration of the Battle of Actium, Agrippa built and dedicated the building that served as the Roman Pantheon before its destruction in 80AD. Emperor Hadrian used Agrippa's design to build his own Pantheon, which survives in Rome. The inscription of the later building, which was built around 125, preserves the text of the inscription from Agrippa's building during his third consulship. The years following his third consulship, Agrippa spent in Gaul, reforming the provincial administration and taxation system, along with building an effective road system and aqueducts.\n\nLate life\n\nAgrippa's friendship with Augustus seems to have been clouded by the jealousy of Augustus' nephew Marcus Claudius Marcellus, which was probably instigated by the intrigues of Livia, the third wife of Augustus, who feared his influence over her husband. Traditionally it is said the result of such jealousy was that Agrippa left Rome, ostensibly to take over the governorship of eastern provinces – a sort of honourable exile, but he only sent his legate to Syria, while he himself remained at Lesbos and governed by proxy, though he may have been on a secret mission to negotiate with the Parthians about the return of the Roman legions standards which they held.David Magie, The Mission of Agrippa to the Orient in 23 BC, Classical Philology, Vol. 3, No. 2 (Apr., 1908), pp. 145–52 On the death of Marcellus, which took place within a year of his exile, he was recalled to Rome by Augustus, who found he could not dispense with his services. However, if one places the events in the context of the crisis in 23 BC it seems unlikely that, when facing significant opposition and about to make a major political climb down, the emperor Augustus would place a man in exile in charge of the largest body of Roman troops. What is far more likely is that Agrippa's 'exile' was actually the careful political positioning of a loyal lieutenant in command of a significant army as a backup plan in case the settlement plans of 23 BC failed and Augustus needed military support.Syme (1939), 342. Moreover, after 23 BC as part of what became known as Augustus' Second Constitutional Settlement, Agrippa's constitutional powers were greatly increased to provide the Principate of Augustus with greater constitutional stability by providing for a political heir or replacement for Augustus if he were to succumb to his habitual ill health or was assassinated. In the course of the year proconsular imperium, similar to Augustus' power, was conferred upon Agrippa for five years. The exact nature of the grant is uncertain but it probably covered Augustus' imperial provinces, east and west, perhaps lacking authority over the provinces of the Senate. That was to come later, as was the jealously guarded tribunicia potestas, or powers of a tribune of the plebeians.Syme (1939), 337–38. These great powers of state are not usually heaped upon a former exile.\n\nIt is said that Maecenas advised Augustus to attach Agrippa still more closely to him by making him his son-in-law.Cassius Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#6 54.6] He accordingly induced him to divorce Marcella and marry his daughter Julia the Elder by 21 BC, the widow of Marcellus,Suetonius, The Life of Augustus [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Augustus*.html#63 63]; Dio, [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#6.5 6.5]; Reinhold, Marcus Agrippa. A biography, pp. 67–68, 86–87. equally celebrated for her beauty, abilities, and her shameless extravagance. In 19 BC, Agrippa was employed in putting down a rising of the Cantabrians in Hispania (Cantabrian Wars).\n\nIn 18 BC, Agrippa's powers were even further increased to almost match those of Augustus. That year his proconsular imperium was augmented to cover the provinces of the Senate. More than that, he was finally granted tribunicia potestas, or powers of a tribune of the plebeians. As was the case with Augustus, Agrippa’s grant of tribunician powers was conferred without his having to actually hold that office.Dio, Roman History [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#12.4 54.12.4]. These powers were considerable, giving him veto power over the acts of the Senate or other magistracies, including those of other tribunes, and the power to present laws for approval by the People. Just as important, a tribune’s person was sacred, meaning that any person who harmfully touched them or impeded their actions, including political acts, could lawfully be killed.Everett (2006), 217. After the grant of these powers Agrippa was, on paper, almost as powerful as Augustus was. However, there was no doubt that Augustus was the man in charge.\n\nAgrippa was appointed governor of the eastern provinces a second time in 17 BC, where his just and prudent administration won him the respect and good-will of the provincials, especially from the Jewish population. Agrippa also restored effective Roman control over the Cimmerian Chersonnese (Crimean Peninsula) during his governorship.\n\nAgrippa’s last public service was his beginning of the conquest of the upper Danube River region, which would become the Roman province of Pannonia in 13 BC.Dio, [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#28 28] He died at Campania in 12 BC at the age of 51. His posthumous son, Marcus Vipsanius Agrippa Postumus, was named in his honor. Augustus honoured his memory by a magnificent funeral and spent over a month in mourning. Augustus personally oversaw all of Agrippa's children’s educations. Although Agrippa had built a tomb for himself, Augustus had Agrippa's remains placed in Augustus' own mausoleum.Cassius Dio [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/54*.html#28.5 54.28.5]\n\nLegacy\n\nAgrippa was also known as a writer, especially on the subject of geography. Under his supervision, Julius Caesar's dream of having a complete survey of the Empire made was carried out. Agrippa constructed a circular chart, which was later engraved on marble by Augustus, and afterwards placed in the colonnade built by his sister Polla. Amongst his writings, an autobiography, now lost, is referenced.\n\nAgrippa had it established a standard for Roman foot (Agrippa's own) in 29 BC, and thus a definition of a pace as 5 feet. An imperial Roman mile denotes 5,000 Roman feet.\n\nThe term Via Agrippa is used for any part of the network of roadways in Gaul built by Agrippa. Some of these still exist as paths or even as highways.\n\nMarriages and issue\n\nAgrippa had several children through his three marriages:\n* By his first wife, Caecilia Attica, he had a daughter, Vipsania Agrippina, who was to be the first wife of the Emperor Tiberius, and who gave birth to a son, Drusus the Younger.\n* By his second wife, Claudia Marcella Major, he may have had a daughter, whose existence remains unclear, but this hypothetical figure is referred to as \"Vipsania Marcella\". It is possible that this daughter may have been a second daughter by Caecilia Attica, but there is no information to say one way or the other. The existence of this daughter rests solely on Publius Quinctilius Varus being mentioned as the son-in-law of Agrippa in Augustus' funeral oration for Agrippa.Kölner Papyrus I (1976), no. 10.\n* By his third wife, Julia the Elder (daughter of Augustus), he had five children: Gaius Caesar, Julia the Younger, Lucius Caesar, Agrippina the Elder (wife of Germanicus, mother of the Emperor Caligula and Empress Agrippina the Younger), and Agrippa Postumus (a posthumous son).\n\nThrough his numerous children, Agrippa would become ancestor to many subsequent members of the Julio-Claudian dynasty, whose position he helped to attain, as well as many other reputed Romans.\n\n* (with Caecilia Attica)\n** 1. Vipsania Agrippina I, 36 BC – AD 20, had at least 6 children by 2 husbands (1 by Tiberius, at least 5 by Gaius Asinius Gallus)\n*** A. Drusus Julius Caesar, 13 BC – AD 23, had 3 children\n**** I. Julia Livia, AD 5–43, had at least 1 child\n***** a. Rubellius Plautus, AD 33–62, may have had several children, but none of them survived Nero's purges in 66.\n**** II. Tiberius Julius Caesar Nero 'Gemellus', AD 19–37 or 38, died without issue\n**** III. Tiberius Claudius Caesar Germanicus II 'Gemellus', AD 19–23, died young\n*** B. Gaius Asinius Pollio, died AD 45, children unknown\n*** C. Marcus Asinius Agrippa, died AD 26\n*** D. (?Gnaeus) Asinius Saloninus, died AD 22May be the 'Gnaeus Asinius' mentioned in the records of the townsfolk of Puteoli, to whom that man was a patron\n*** E. Servius Asinius Celer,Consul suffectus in AD 38Seneca, The Pumpkinification of Claudius died before mid-47, had 1 child\n**** a. Asinia Agrippina\n*** F. (?Lucius) Asinius GallusCassius Dio (60.27.5)\n* (with Julia Caesaris)\n** 2. Gaius Julius Caesar, 20 BC – AD 4, died without issue\n** 3. Vipsania Julia Agrippina (Julia the Younger), 19 BC – AD 28, had two children;\n*** A. Aemilia Lepida (fiancee of Claudius), 4 BC – AD 53, had five children;\n**** I. Marcus Junius Silanus Torquatus, 14–54, had one child;\n***** a. Lucius Junius Silanus Torquatus the younger, 50–66, died young\n**** II. Junia Calvina, 15–79, died without issue\n**** III. Decimus Junius Silanus Torquatus, d. 64 without issue\n**** IV. Lucius Junius Silanus Torquatus the elder, d. 49 without issue\n**** V. Junia Lepida, c. 18–65, issue unknown\n*** B. Unnamed illegitimate son (by Decimus Junius Silanus), d. AD 8 (ordered to be exposed by Augustus)\n** 4. Lucius Julius Caesar, 17 BC – AD 2, died without issue\n** 5. Vipsania Agrippina II (Agrippina the Elder), 14 BC – AD 33, had nine children, of whom three died young;\n*** A. Nero Julius Caesar Germanicus, 6–30, died without issue\n*** B. Drusus Julius Caesar Germanicus, 7–33, died without issue\n*** C. Gaius Julius Caesar, bef. AD 12 – bef. AD 12CIL 06, 00889\n*** D. Gaius Julius Caesar Germanicus (Caligula), 12–41, had one child;\n**** I. Julia Drusilla, 39–41, died young\n*** E. Julia Agrippina (Agrippina the Younger), 15–59, had one child;\n**** I. Nero Claudius Caesar Augustus Germanicus (Lucius Domitius Ahenobarbus), 37–68, had one child;\n***** a. Claudia Augusta, Jan. 63 – April 63; died young\n*** F. Julia Drusilla, 16–38, died without issue\n*** G. Julia Livilla, 18–42, died without issue\n*** H. Tiberius Julius Caesar, ? – ? (either born before Nero Julius Caesar, between Drusus Caesar and Gaius Caesar (Caligula) or between Gaius Caesar (Caligula) and Julia Agrippina)CIL 06, 00888\n*** ?I. Son (name unknown), ? – ?CIL 06, 00890\n** 6. Marcus Julius Caesar Agrippa Postumus, 12 BC – AD 14, died without issue\n\nThere have been some attempts to assign further descendants to a number of the aforementioned figures, including two lines of Asinii descended from Gaius Asinius Pollio and Marcus Asinius Agrippa respectively. A daughter (and further descendants) named Rubellia Bassa to Julia, who may have been a daughter of Gaius Rubellius Blandus by an earlier marriage. And, finally, a series of descendants from Junia Lepida and her husband, Gaius Cassius Longinus. However, all of these lines of descent are extremely hypothetical and lack any evidence to support a connection to the descendants of Agrippa.\n\nAgrippa in popular culture\n\nDrama\n\nAgrippa is a character in William Shakespeare's play Antony and Cleopatra.\n\nA fictional version of Agrippa in his later life played a prominent role in the 1976 BBC Television series I, Claudius. Agrippa was portrayed as a much older man, though he would have only been 39 years old at the time of the first episode (24/23 BC).  He was played by John Paul.\n\nAgrippa is the main character in Paul Naschy's 1980 film Los cántabros, played by Naschy himself. It is a highly fictionalized version of the Cantabrian Wars in which Agrippa is depicted as the lover of the sister of Cantabrian leader Corocotta.\n\nAgrippa appears in several film versions of the life of Cleopatra. He is normally portrayed as an old man rather than a young one. Among the people to portray him are Philip Locke, Alan Rowe and Andrew Keir.\n\nAgrippa is also one of the principal characters in the British/Italian joint project Imperium: Augustus (2003) featuring flashbacks between Augustus and Julia about Agrippa, which shows him in his youth on serving in Caesar's army up until his victory at Actium and the defeat of Cleopatra. He is portrayed by Ken Duken. In the 2005 series Empire the young Agrippa (played by Christopher Egan) becomes Octavian's sidekick after saving him from an attempted poisoning.\n\nMarcus Agrippa, a highly fictional character based on Marcus Vipsanius Agrippa's early life, is part of the BBC-HBO-RAI television series Rome. He is played by Allen Leech. He describes himself as the grandson of a slave. The series creates a romantic relationship between Agrippa and Octavian's sister Octavia Minor, for which there is no historical evidence.\n\nLiterature\n\nAgrippa is mentioned by name in book VIII of Virgil's The Aeneid, where Aeneas sees an image of Agrippa leading ships in the Battle of Actium on the shield forged for him by Vulcan and given to him by his mother, Venus.Virgil, The Aeneid, trans. Robert Fitzgerald, Vintage Classics, pp. 252.\n\nAgrippa is a main character in the early part of Robert Graves novel I, Claudius. He is a main character in the later two novels of Colleen McCullough's Masters of Rome series. He is a featured character of prominence and importance in the historical fiction novel Cleopatra's Daughter by Michelle Moran. He also features prominently in John Edward Williams' historical novel Augustus. In the backstory of Gunpowder Empire, the first volume in Harry Turtledove's Crosstime Traffic series, Agrippa lived until AD 26, conquering all of Germania for the Empire and becoming the second Emperor when Augustus died in AD 14.\n\nVideo games\n\nA heavily fictionalized version of Agrippa is one of the playable characters (the other being an equally fictionalized Augustus) in the video game Shadow of Rome. There, Agrippa is sentenced to become a gladiator after his father was wrongly sentenced for assassinating Caesar. Agrippa's goal is to stay alive as a gladiator for as long as possible, while Augustus acts as an infiltrator who slowly exposes the conspiracy against Caesar. Eventually, Augustus is able to prove Vipsanius' innocence and both of them are pardoned. Then a civil war breaks out, because the direct successor was outraged by exposure of the conspiracy. Agrippa and Augustus fight against Antonius. Agrippa appears as a Great Admiral in the computer game Sid Meier's Civilization V. A fictionalized version of Agrippa also appears in the video game Assassin's Creed Origins as the commander of the Roman Citadel in the province of Kyrenaika where the player character has to kill him and retrieve a document from his body. Marcus Vipsanius Agrippa. http://en.wikipedia.org/?curid=19747."
  }
}
