{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10484",
  "eid" : "f5d44b60-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778492182,
  "textBody" : "The Electric Light Orchestra (ELO) are  an English rock band formed in Birmingham in 1970, by songwriters/multi-instrumentalists Jeff Lynne and Roy Wood with drummer Bev Bevan. Their music is characterised by a fusion of Beatlesque pop, classical arrangements, and futuristic iconography. After Wood's departure in 1972, Lynne became the band's leader, arranging and producing every album while writing virtually all of their original material. For their initial tenure, Lynne, Bevan and keyboardist Richard Tandy were the group's only consistent members.\n\nELO was formed out of Lynne's and Wood's desire to create modern rock and pop songs with classical overtones. It derived as an offshoot of Wood's previous band, the Move, of which Lynne and Bevan were also members. During the 1970s and 1980s, ELO released a string of top 10 albums and singles, including two LPs that reached the top of British charts: the disco-inspired Discovery (1979) and the science-fiction-themed concept album Time (1981). In 1986, Lynne lost interest in the band and ceased its operation. Bevan responded by forming his own band, ELO Part II, which later became the Orchestra. With the exception of a short-lived reunion in 2000–01, ELO remained largely inactive for the next three decades. In 2014, Lynne re-formed the band again with Tandy as Jeff Lynne's ELO, where he resumed concert touring and new recordings under the moniker.\n\nDuring ELO's original 13-year period of active recording and touring, they sold over 50 million records worldwide, collecting 19 CRIA, 21 RIAA, and 38 BPI awards. For a period in the mid 1970s, the band saw more success in the United States, where they were billed as \"the English guys with the big fiddles\". From 1972 to 1986, ELO accumulated twenty Top 20 songs on the UK Singles Chart, and fifteen Top 20 songs on the US Billboard Hot 100. The band also holds the record for having the most Billboard Hot 100 Top 40 hits (20) without a number one single of any band in US chart history.Casey Kasem's American Top 40 from 15 March 1986 In 2017, the ELO line-up of Wood, Lynne, Bevan, and Tandy were inducted into the Rock and Roll Hall of Fame.\n\nHistory\n\n1970–1973: Formation and early albums\n\nIn the late 1960s, Roy Wood—guitarist, vocalist and songwriter of The Move—had an idea to form a new band that would use violins, cellos, string basses, horns and woodwinds to give their music a classical sound, taking rock music in the direction to \"pick up where The Beatles left off\". Jeff Lynne, frontman of fellow Birmingham group The Idle Race, was excited by the concept. In January 1970, when Carl Wayne left the Move, Lynne accepted Wood's second invitation to join the band on the condition that they focus their energy on the new project. On 12 July 1970, when Wood added multiple cellos to a Lynne-penned song intended to be a Move B-side, the new concept became a reality and \"10538 Overture\" became the first Electric Light Orchestra song. To help finance the fledgling band, one further Move album Message from the Country was also recorded during the lengthy ELO recordings. The resulting debut album The Electric Light Orchestra was released in 1971. It was released in the United States in 1972 as No Answer, the name being chosen because a record company secretary had tried to ring the UK company and get the name of the album—since they were unable to contact them they left a note saying \"No Answer\".[http://www.snopes.com/music/hidden/noanswer.asp Electric Light Orchestra's No Answer]. snopes.com. Retrieved 31 January 2011. \"10538 Overture\" became a UK top-ten hit. Wood, Lynne and Bev Bevan were the founding members of Electric Light Orchestra.\n\nELO's debut concert took place on 16 April 1972 at the Greyhound Pub in Croydon, Surrey, with a line-up of Wood, Lynne, Bevan, Bill Hunt (keyboards), Andy Craig (cello), Mike Edwards (cello), Wilfred Gibson (violin), Hugh McDowell (cello), and Richard Tandy (bass). However, this line-up did not last for long. First Craig departed, and then Wood, during the recordings for the band's second LP. Taking Hunt and McDowell with him, Wood left the band to form Wizzard. Both cited problems with their manager, Don Arden, and an unsatisfactory tour of Italy, where the cellos and violins could not be heard over the electric instruments. Despite predictions from the music press that the band would fold without Wood, who had been the driving force behind the creation of ELO, Lynne stepped up to lead the band, with Bevan, Edwards, Gibson and Tandy (who had switched from bass to keyboards to replace Hunt) remaining from the previous line-up, and new recruits Mike de Albuquerque and Colin Walker joining the band on bass and cello respectively.\n\nThe new line-up performed at the 1972 Reading Festival. Barcus Berry instrument pick-ups, now sported by the band's string trio, allowed them to have proper amplification on stage for their instruments, which had previously been all but drowned out by all the sound of the electrified instruments. The band released their second album, ELO 2 in 1973, which produced their second UK top 10 and their first US chart single, an elaborate version of the Chuck Berry classic \"Roll Over Beethoven\". ELO also made their first appearance on American Bandstand show. During the recording of the third album, Gibson was let go after a dispute over money, Mik Kaminski joined as violinist and Walker left since touring was keeping him away from his family too much. Remaining cellist Edwards finished the cello parts for the album. The resulting album, On the Third Day, was released in late 1973, with the American version featuring the popular single \"Showdown\". After leaving Wizzard Hugh McDowell returned as the second cellist at the end of 1973.\n\n1974–1982: Global success and concept albums\n\nFor the band's fourth album, Eldorado, A Symphony, a concept album about a daydreamer, Lynne stopped overdubbing strings and hired an orchestra and choir instead. Louis Clark was hired by the band as string arranger.[https://web.archive.org/web/20080605175932/http://www.eatonmusic.com/clark.html Eaton Music – Louis Clark]. Web.archive.org (5 June 2008). Retrieved 31 January 2011. The first single off the album, \"Can't Get It Out of My Head\", became their first US top 10 hit, and Eldorado, A Symphony became ELO's first gold album. Mike de Albuquerque departed the band during the recording sessions as he wished to spend more time with his family; and consequently much of the bass on the album was performed by Lynne. Following the release of Eldorado Kelly Groucutt was recruited as bassist, and in early 1975 Melvyn Gale replaced Edwards on cello. The line-up stabilised as the band took to a decidedly more accessible sound. ELO had become successful in the US at this point and the group was a star attraction on the stadium and arena circuit, and regularly appeared on The Midnight Special (1973, 1975, 1976 & 1977) more than any other band in that show's history with four appearances. Face the Music was released in 1975, producing the hit singles \"Evil Woman\", their third UK top 10, and \"Strange Magic\". The opening instrumental \"Fire on High\", with its mix of strings and acoustic guitars, saw heavy exposure as the theme music for the American television program CBS Sports Spectacular in the mid-1970s. The group toured extensively from 3 February to 13 April 1976, playing 68 shows in 76 days in the US.\n\nTheir sixth album, the platinum selling A New World Record, became their first UK top ten album when it was released in 1976.[http://www.officialcharts.com/artist/_/electric%20light%20orchestra/ \"ELO: UK Chart History\"]. Official Charts Company. Retrieved 9 February 2015 It contained the hit singles \"Livin' Thing\", \"Telephone Line\", \"Rockaria!\" and \"Do Ya\", a re-recording of the Move song. The band toured in support in the US only from September 1976 to April 1977 with a break in December, then an American Music Awards show appearance on 31 January 1977,[https://www.youtube.com/watch?v\nlxkTihkYTs8 ELO Livin Thing American Music Awards 31 Jan 1977 Full]. YouTube (25 February 2011) plus a one-off gig in San Diego in August 1977. Casey Kasem said that the Electric Light Orchestra is the \"World's first touring rock 'n' roll chamber group\" before he played \"Livin' Thing\" at #28.Casey Kasem's American Top 40 from 29 January 1977 A New World Record was followed by a multi-platinum selling album, the double-LP Out of the Blue, in 1977. Out of the Blue featured the singles \"Turn to Stone\", \"Sweet Talkin' Woman\", \"Mr. Blue Sky\", and \"Wild West Hero\", each becoming a hit in the United Kingdom. The band then set out on a nine-month, 92-date world tour, with an enormous set and a hugely expensive space ship stage with fog machines and a laser display. In the United States the concerts were billed as The Big Night and were their largest to date, with 62,000 people seeing them at Cleveland Stadium.Bornino, Bruno, \"62,000 see ELO’s UFO\" Cleveland Press 17 July 1978 The Big Night went on to become the highest-grossing live concert tour in music history up to that point (1978). The band played at London's Wembley Arena for eight straight sold-out nights during the tour, another record at that time.\n\nIn 1979, the multi-platinum album Discovery was released, reaching number one on the UK Albums Chart. Although the biggest hit on the album (and ELO's biggest hit overall) was the rock song \"Don't Bring Me Down\", the album was noted for its heavy disco influence. Discovery also produced the hits \"Shine a Little Love\", their first and only no. 1 hit from 1972 to the present with any of the 4 major or minor US singles charts on Radio & Records (R&R),[http://wweb.uta.edu/faculty/gghunt/charts/elo.htm ELO][http://wweb.uta.edu/faculty/gghunt/charts/chart.html Charts!] \"Last Train to London\", \"Confusion\" and \"The Diary of Horace Wimp\". Another song, \"Midnight Blue\", was released as a single in Southeast Asia. The band recorded promotional videos for all the songs on the album.\n\nBy the end of 1979 ELO had reached the peak of their stardom, selling millions of albums and singles, and even inspiring a parody/tribute song on the Randy Newman album Born Again, titled \"The Story of a Rock and Roll Band\". During 1979 Jeff Lynne also turned down an invitation for ELO to headline the August 1979 Knebworth Festival concerts. That allowed Led Zeppelin the chance to headline instead. In 1980 Jeff Lynne was asked to write for the soundtrack of the musical film Xanadu, with the other half written by John Farrar and performed by the film's star Olivia Newton-John. The movie performed poorly at the box office, but the soundtrack did exceptionally well, eventually going double platinum. The album spawned hit singles from both Newton-John (\"Magic\", a #1 hit in the United States, and \"Suddenly\" with Cliff Richard) and ELO (\"I'm Alive\", which went gold, \"All Over the World\" and \"Don't Walk Away\"). The title track, performed by both Newton-John and ELO, is ELO's only song to top the singles chart in the United Kingdom.Guinness World Records: \"British Hit Singles 14th Edition\", page 195. 0-85112-156-X More than a quarter of a century later, Xanadu, a Broadway musical, based on the film, opened on 10 July 2007 at the Helen Hayes Theatre to uniformly good reviews. It received 4 Tony Award nominations. The musical received its UK premiere in London in October 2015. Casey Kasem called The Electric Light Orchestra a \"7-man supergroup\" and \"amazing\" for hitting The Top 40 a remarkable 6 times in a one-year period from August 1979 to August 1980 before playing \"All Over the World\" at #23Casey Kasem's American Top 40 from 30 August 1980\n\nIn 1981, ELO's sound changed again with the science fiction concept album Time, a throwback to earlier, more progressive rock albums like Eldorado. With the string section now departed, synthesisers took a dominating role, as was the trend in the larger music scene of the time; although studio strings were present on some of the tracks conducted by Rainer Pietsch, the overall soundscape had a more electronic feel in keeping with the futuristic nature of the album. Time topped the UK charts for two weeks and was the last ELO studio album to be certified platinum in the United Kingdom until Alone in the Universe in 2015. Singles from the album included \"Hold On Tight\", \"Twilight\", \"The Way Life's Meant to Be\", \"Here Is the News\" and \"Ticket to the Moon\". The band embarked on their last world tour to promote the LP. For the tour Kaminski returned to the line-up on violin, whilst synthesiser players Louis Clark and Dave Morgan also joined the band.\n\n1983–1986: Secret Messages, Balance of Power, disbanding\n\nJeff Lynne wanted to follow Time with a double album, but CBS blocked his plan on the grounds that a double vinyl album would be too expensive in the oil crisis and as a result, the new album was edited down from double album to a single disc and released as Secret Messages in 1983 (many of the out-takes were later released on Afterglow or as b-sides of singles). The album was a hit in the UK reaching the top 5; but its release was undermined by a string of bad news that there would be no tour to promote the LP, as drummer Bevan was now playing drums for Black Sabbath and bassist Groucutt had left the band during the recording of the album (leaving Lynne to once again record many of the bass parts). Rumours of the group disbanding were publicly denied by Bevan and although Secret Messages debuted at number four in the United Kingdom, it fell off the charts, failing to catch fire with a lack of hit singles in the UK (though \"Rock 'n' Roll Is King\" was a sizeable hit in UK, the US and Australia) and a lukewarm media response. By 1983 Bevan was expressing a desire to join Black Sabbath permanently and Lynne and Tandy were recording tracks for the Electric Dreams soundtrack under Lynne's name; however, Lynne was contractually obliged to make one more ELO album. Lynne, Bevan and Tandy returned to the studio in 1985 as a three-piece (with Christian Schneider playing saxophone on some tracks and Lynne again doubling on bass in addition to his usual guitar in the absence of an official bass player) to record Balance of Power, released early in 1986. Though the single \"Calling America\" placed in the Top 30 in the United Kingdom (number 28) and Top 20 in the States, subsequent singles failed to chart. The album lacked actual classical strings, which were replaced once again by synthesisers, played by Tandy.\n\nThe band was then rejoined by Kaminski, Clark, and Morgan, adding Martin Smith on bass guitar, and proceeded to perform a small number of live ELO performances in 1986, including shows in England and Germany along with US appearances on American Bandstand, Solid Gold, then at Disneyland that summer. The Birmingham Heart Beat Charity Concert 1986 was a charity concert organised by Bevan in ELO's hometown of Birmingham on 15 March 1986. A hint of Lynne's future was seen when George Harrison appeared onstage during the encore at Heartbeat, joining in the all-star jam of \"Johnny B. Goode\". ELO's last performance for several years occurred on 13 July 1986 in Stuttgart, Germany playing as opening act to Rod Stewart. ELO effectively disbanded after that final show in Stuttgart in 1986, but there was no announcement made of it for the next two years, during which George Harrison's Lynne-produced album Cloud Nine and the pair's follow-up (with Roy Orbison, Bob Dylan and Tom Petty as Traveling Wilburys) Traveling Wilburys Vol. 1 were released.\n\n;ELO Part II\n\nBevan (under an agreement with Lynne who co-owned the ELO name with him) continued on in 1989 as ELO Part II, initially with no other former ELO members. ELO Part II released their debut album Electric Light Orchestra Part Two in 1990. Mik Kaminski, Kelly Groucutt and Hugh McDowell joined the band for the first tour in 1991. McDowell left after that tour. Bevan, Groucutt, Kaminski and Clark recorded a second album, Moment of Truth, in 1994 and toured extensively until 1999. Bevan retired from the line-up in 1999 and sold his share of the ELO name to Jeff Lynne in 2000.\n\n2000–2001: Reformation\n\nLynne's comeback with ELO began in 2000 with the release of a retrospective box set, Flashback, containing three CDs of remastered tracks and a handful of out-takes and unfinished works, most notably a new version of ELO's only UK number one hit \"Xanadu\". In 2001 Zoom, ELO's first album since 1986, was released. Though billed and marketed as an ELO album, the only returning member other than Lynne was Tandy, who performed on one track. Guest musicians included former Beatles Ringo Starr and George Harrison. Upon completion of the album, Lynne reformed the band with completely new members, including his then-girlfriend Rosie Vela (who had released her own album, Zazu, in 1986) and announced that ELO would tour again. Former ELO member Tandy rejoined the band a short time afterwards for two television live performances: VH1 Storytellers and a PBS concert shot at CBS Television City, later titled Zoom Tour Live, that was released on DVD. The planned tour was cancelled. \"The off-switch has been flipped on the Electric Light Orchestra. Or at least its tour, which was wired to illuminate the First Union Center on 15 Sept.\"\n\n2001–2013: Non-performing work, reissues and miniature reunions\n\nFor the next six years, Harvest and Epic/Legacy reissued ELO's back catalogue. Included amongst the remastered album tracks were unreleased songs and outtakes, including two new singles. The first was \"Surrender\" which registered on the lower end of the UK Singles Chart at number 81, some 30 years after it was written in 1976. The other single was  \"Latitude 88 North\".\n\nOn 9 August 2010, Eagle Rock Entertainment released Live – The Early Years in the UK as a DVD compilation that included Fusion – Live in London (1976) along with never before released live performances at Brunel University (1973) and on a German TV show Rockpalast (1974).[http://hangout.altsounds.com/news/118072-electric-light-orchestra-live-the-early-years-for-the-first-time-on-dvd.html Electric Light Orchestra \"Live – The Early Years\" for the first time on DVD | Altsounds.com News]. Hangout.altsounds.com. Retrieved 31 January 2011. The US had a slightly edited release on 24 August 2010.[http://www.eagle-rock.com/product/EV303119/Live+-+The+Early+Years Live – The Early Years – Product Details]. Eagle Rock. Retrieved 31 January 2011. The Essential Electric Light Orchestra artwork was re-jigged to feature two different covers. The US and Australian releases shared one design, while the rest of the world featured the other for a new double album release in October 2011.\n\nMr. Blue Sky: The Very Best of Electric Light Orchestra was released on 8 October 2012. It is an album of new recordings of ELO's greatest hits by Lynne; along with a new song \"Point of No Return\", released to coincide with Lynne's second solo album release Long Wave. These new 2012 albums contained advertisement cards, announcing the re-release of expanded and remastered versions of both the 2001 album Zoom and Lynne's debut solo album Armchair Theatre, originally released in 1990. Both albums were re-released in April 2013 with various bonus tracks. Also released was the live album, Electric Light Orchestra Live, showcasing songs from the Zoom tour. All three releases also featured new studio recordings as bonus tracks.\n\nLynne and Tandy reunited again on 12 November 2013 to perform, under the name Jeff Lynne and Friends, \"Livin' Thing\" and \"Mr Blue Sky\" at the Children in Need Rocks concert at Hammersmith Eventim Apollo, London. The backing orchestra was the BBC Concert Orchestra, with Chereene Allen on lead violin.\n\n2014–present: Jeff Lynne's ELO\n\nThe success of the Children in Need was followed by much support from BBC Radio 2's DJ Chris Evans, who asked his listeners if they wanted ELO to perform. The 50,000 tickets for the resulting BBC Radio 2's \"Festival in a Day\" in Hyde Park on 14 September 2014 sold out in 15 minutes. Billed as \"Jeff Lynne's ELO\", Lynne and Tandy were backed by the Take That/Gary Barlow band from the Children in Need concert, led by Mike Stevens  and the BBC Concert Orchestra. The moniker came out from Lynne as a response to ELO tribute and imitation bands, (ELO Part II, the Orchestra, OrKestra and the Music of ELO) who repeatedly used ELO for promoting their own tours. Chereene Allen was the lead violinist for the band. The development of modern digital processing added a smoother finish to the work, which led Lynne to reconsider his preference for studio work, hinting at a UK tour in 2015.\n\nOn 8 February 2015, Jeff Lynne's ELO played at the Grammy Awards for the first time. They performed a medley of \"Evil Woman\" and \"Mr. Blue Sky\" with Ed Sheeran, who introduced them as \"A man and a band who I love\".\n\nOn 10 September 2015, it was announced that a new ELO album would be released. The album was to be under the moniker of Jeff Lynne's ELO, with the band signed to Columbia Records. Alone in the Universe was released on 13 November 2015. The album was ELO's first album of new material in nearly 15 years. The first track, and single, \"When I Was a Boy\" was made available for streaming on the same day and a music video for the song was also released. A small promotional tour followed the album's release which saw ELO perform a full concert for BBC Radio 2 along with ELO's first two shows in the United States in 30 years, both which sold out very quickly. ELO also made rare US television appearances on The Tonight Show Starring Jimmy Fallon, Jimmy Kimmel Live and CBS This Morning. Lynne was joined by Traveling Wilbury's photographer Nick J (NJ Latham) for a 19-date European tour that was announced for 2016, with the band playing the Pyramid Stage at Glastonbury Festival on 26 June 2016. \n\nIn 2017 they played their \"Alone in the Universe\" tour. In 2017 they played at the Rock and Roll Hall of Fame during the 32nd Annual Induction Ceremony.\n\nLegacy and influence\n\nWhen ELO emerged, they were often dismissed by musical cognoscenti as Beatles copyists. According to music journalist Simon Price, ELO was \"arguably the most uncool, even defiantly anti-cool, of the lot, and have been the slowest to be rehabilitated since ... They've been sampled by dozens upon dozens of acts, from Company Flow to the Pussycat Dolls!, if you go looking. Every now and then, in my journalistic career, it's been possible to coax a contemporary band to admit to an ELO influence, the Flaming Lips and Super Furry Animals being two examples. But the band with, arguably, the greatest amount of ELO DNA are outside the rock genre altogether: Daft Punk.\"\n\nIn November 2016, Jeff Lynne's ELO won Band of the Year at the Classic Rock Roll of Honour Awards. In October 2016, ELO were nominated for the 2017 class of the Rock and Roll Hall of Fame for the first time. It was the first time that the Hall had announced in advance the members of bands who would be inducted; the members of ELO listed were  Jeff Lynne, Roy Wood, Bev Bevan and Richard Tandy. On 20 December 2016, it was announced ELO had been elected to the Rock and Roll Hall of Fame Class of 2017.\n\nPersonnel\n\nMembers\n\n;Current members\n*Jeff Lynne – lead and backing vocals, guitars, bass, cello, keyboards, drums, percussion, producer, songwriter, composer, arranger (1970–1986, 2000–2001, 2014–present)\n* Richard Tandy – keyboards, synthesisers, bass, guitar, backing vocals, producer, arranger (1971–1986, 2000–2001, 2014–present)\n\n;Current live members (Jeff Lynne's ELO)\n\n;Former members\n\n;Former live members\n\n;Associated\n\nTimeline\n\nLine-ups\n\nDiscography\n\n;Studio albums\n* The Electric Light Orchestra (1971)\n* ELO 2 (1973)\n* On the Third Day (1973)\n* Eldorado (1974)\n* Face the Music (1975)\n* A New World Record (1976)\n* Out of the Blue (1977)\n* Discovery (1979)\n* Time (1981) (credited as \"ELO\")\n* Secret Messages (1983)\n* Balance of Power (1986)\n* Zoom (2001)\n* Alone in the Universe (2015) (credited as \"Jeff Lynne's ELO\")\n\n;Soundtrack album\n* Xanadu (1980)\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Electric Light Orchestra" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10484" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Electric Light Orchestra (ELO) are  an English rock band formed in Birmingham in 1970, by songwriters/multi-instrumentalists Jeff Lynne and Roy Wood with drummer Bev Bevan. Their music is characterised by a fusion of Beatlesque pop, classical arrangements, and futuristic iconography. After Wood's departure in 1972, Lynne became the band's leader, arranging and producing every album while writing virtually all of their original material. For their initial tenure, Lynne, Bevan and keyboardist Richard Tandy were the group's only consistent members.\n\nELO was formed out of Lynne's and Wood's desire to create modern rock and pop songs with classical overtones. It derived as an offshoot of Wood's previous band, the Move, of which Lynne and Bevan were also members. During the 1970s and 1980s, ELO released a string of top 10 albums and singles, including two LPs that reached the top of British charts: the disco-inspired Discovery (1979) and the science-fiction-themed concept album Time (1981). In 1986, Lynne lost interest in the band and ceased its operation. Bevan responded by forming his own band, ELO Part II, which later became the Orchestra. With the exception of a short-lived reunion in 2000–01, ELO remained largely inactive for the next three decades. In 2014, Lynne re-formed the band again with Tandy as Jeff Lynne's ELO, where he resumed concert touring and new recordings under the moniker.\n\nDuring ELO's original 13-year period of active recording and touring, they sold over 50 million records worldwide, collecting 19 CRIA, 21 RIAA, and 38 BPI awards. For a period in the mid 1970s, the band saw more success in the United States, where they were billed as \"the English guys with the big fiddles\". From 1972 to 1986, ELO accumulated twenty Top 20 songs on the UK Singles Chart, and fifteen Top 20 songs on the US Billboard Hot 100. The band also holds the record for having the most Billboard Hot 100 Top 40 hits (20) without a number one single of any band in US chart history.Casey Kasem's American Top 40 from 15 March 1986 In 2017, the ELO line-up of Wood, Lynne, Bevan, and Tandy were inducted into the Rock and Roll Hall of Fame.\n\nHistory\n\n1970–1973: Formation and early albums\n\nIn the late 1960s, Roy Wood—guitarist, vocalist and songwriter of The Move—had an idea to form a new band that would use violins, cellos, string basses, horns and woodwinds to give their music a classical sound, taking rock music in the direction to \"pick up where The Beatles left off\". Jeff Lynne, frontman of fellow Birmingham group The Idle Race, was excited by the concept. In January 1970, when Carl Wayne left the Move, Lynne accepted Wood's second invitation to join the band on the condition that they focus their energy on the new project. On 12 July 1970, when Wood added multiple cellos to a Lynne-penned song intended to be a Move B-side, the new concept became a reality and \"10538 Overture\" became the first Electric Light Orchestra song. To help finance the fledgling band, one further Move album Message from the Country was also recorded during the lengthy ELO recordings. The resulting debut album The Electric Light Orchestra was released in 1971. It was released in the United States in 1972 as No Answer, the name being chosen because a record company secretary had tried to ring the UK company and get the name of the album—since they were unable to contact them they left a note saying \"No Answer\".[http://www.snopes.com/music/hidden/noanswer.asp Electric Light Orchestra's No Answer]. snopes.com. Retrieved 31 January 2011. \"10538 Overture\" became a UK top-ten hit. Wood, Lynne and Bev Bevan were the founding members of Electric Light Orchestra.\n\nELO's debut concert took place on 16 April 1972 at the Greyhound Pub in Croydon, Surrey, with a line-up of Wood, Lynne, Bevan, Bill Hunt (keyboards), Andy Craig (cello), Mike Edwards (cello), Wilfred Gibson (violin), Hugh McDowell (cello), and Richard Tandy (bass). However, this line-up did not last for long. First Craig departed, and then Wood, during the recordings for the band's second LP. Taking Hunt and McDowell with him, Wood left the band to form Wizzard. Both cited problems with their manager, Don Arden, and an unsatisfactory tour of Italy, where the cellos and violins could not be heard over the electric instruments. Despite predictions from the music press that the band would fold without Wood, who had been the driving force behind the creation of ELO, Lynne stepped up to lead the band, with Bevan, Edwards, Gibson and Tandy (who had switched from bass to keyboards to replace Hunt) remaining from the previous line-up, and new recruits Mike de Albuquerque and Colin Walker joining the band on bass and cello respectively.\n\nThe new line-up performed at the 1972 Reading Festival. Barcus Berry instrument pick-ups, now sported by the band's string trio, allowed them to have proper amplification on stage for their instruments, which had previously been all but drowned out by all the sound of the electrified instruments. The band released their second album, ELO 2 in 1973, which produced their second UK top 10 and their first US chart single, an elaborate version of the Chuck Berry classic \"Roll Over Beethoven\". ELO also made their first appearance on American Bandstand show. During the recording of the third album, Gibson was let go after a dispute over money, Mik Kaminski joined as violinist and Walker left since touring was keeping him away from his family too much. Remaining cellist Edwards finished the cello parts for the album. The resulting album, On the Third Day, was released in late 1973, with the American version featuring the popular single \"Showdown\". After leaving Wizzard Hugh McDowell returned as the second cellist at the end of 1973.\n\n1974–1982: Global success and concept albums\n\nFor the band's fourth album, Eldorado, A Symphony, a concept album about a daydreamer, Lynne stopped overdubbing strings and hired an orchestra and choir instead. Louis Clark was hired by the band as string arranger.[https://web.archive.org/web/20080605175932/http://www.eatonmusic.com/clark.html Eaton Music – Louis Clark]. Web.archive.org (5 June 2008). Retrieved 31 January 2011. The first single off the album, \"Can't Get It Out of My Head\", became their first US top 10 hit, and Eldorado, A Symphony became ELO's first gold album. Mike de Albuquerque departed the band during the recording sessions as he wished to spend more time with his family; and consequently much of the bass on the album was performed by Lynne. Following the release of Eldorado Kelly Groucutt was recruited as bassist, and in early 1975 Melvyn Gale replaced Edwards on cello. The line-up stabilised as the band took to a decidedly more accessible sound. ELO had become successful in the US at this point and the group was a star attraction on the stadium and arena circuit, and regularly appeared on The Midnight Special (1973, 1975, 1976 & 1977) more than any other band in that show's history with four appearances. Face the Music was released in 1975, producing the hit singles \"Evil Woman\", their third UK top 10, and \"Strange Magic\". The opening instrumental \"Fire on High\", with its mix of strings and acoustic guitars, saw heavy exposure as the theme music for the American television program CBS Sports Spectacular in the mid-1970s. The group toured extensively from 3 February to 13 April 1976, playing 68 shows in 76 days in the US.\n\nTheir sixth album, the platinum selling A New World Record, became their first UK top ten album when it was released in 1976.[http://www.officialcharts.com/artist/_/electric%20light%20orchestra/ \"ELO: UK Chart History\"]. Official Charts Company. Retrieved 9 February 2015 It contained the hit singles \"Livin' Thing\", \"Telephone Line\", \"Rockaria!\" and \"Do Ya\", a re-recording of the Move song. The band toured in support in the US only from September 1976 to April 1977 with a break in December, then an American Music Awards show appearance on 31 January 1977,[https://www.youtube.com/watch?v\nlxkTihkYTs8 ELO Livin Thing American Music Awards 31 Jan 1977 Full]. YouTube (25 February 2011) plus a one-off gig in San Diego in August 1977. Casey Kasem said that the Electric Light Orchestra is the \"World's first touring rock 'n' roll chamber group\" before he played \"Livin' Thing\" at #28.Casey Kasem's American Top 40 from 29 January 1977 A New World Record was followed by a multi-platinum selling album, the double-LP Out of the Blue, in 1977. Out of the Blue featured the singles \"Turn to Stone\", \"Sweet Talkin' Woman\", \"Mr. Blue Sky\", and \"Wild West Hero\", each becoming a hit in the United Kingdom. The band then set out on a nine-month, 92-date world tour, with an enormous set and a hugely expensive space ship stage with fog machines and a laser display. In the United States the concerts were billed as The Big Night and were their largest to date, with 62,000 people seeing them at Cleveland Stadium.Bornino, Bruno, \"62,000 see ELO’s UFO\" Cleveland Press 17 July 1978 The Big Night went on to become the highest-grossing live concert tour in music history up to that point (1978). The band played at London's Wembley Arena for eight straight sold-out nights during the tour, another record at that time.\n\nIn 1979, the multi-platinum album Discovery was released, reaching number one on the UK Albums Chart. Although the biggest hit on the album (and ELO's biggest hit overall) was the rock song \"Don't Bring Me Down\", the album was noted for its heavy disco influence. Discovery also produced the hits \"Shine a Little Love\", their first and only no. 1 hit from 1972 to the present with any of the 4 major or minor US singles charts on Radio & Records (R&R),[http://wweb.uta.edu/faculty/gghunt/charts/elo.htm ELO][http://wweb.uta.edu/faculty/gghunt/charts/chart.html Charts!] \"Last Train to London\", \"Confusion\" and \"The Diary of Horace Wimp\". Another song, \"Midnight Blue\", was released as a single in Southeast Asia. The band recorded promotional videos for all the songs on the album.\n\nBy the end of 1979 ELO had reached the peak of their stardom, selling millions of albums and singles, and even inspiring a parody/tribute song on the Randy Newman album Born Again, titled \"The Story of a Rock and Roll Band\". During 1979 Jeff Lynne also turned down an invitation for ELO to headline the August 1979 Knebworth Festival concerts. That allowed Led Zeppelin the chance to headline instead. In 1980 Jeff Lynne was asked to write for the soundtrack of the musical film Xanadu, with the other half written by John Farrar and performed by the film's star Olivia Newton-John. The movie performed poorly at the box office, but the soundtrack did exceptionally well, eventually going double platinum. The album spawned hit singles from both Newton-John (\"Magic\", a #1 hit in the United States, and \"Suddenly\" with Cliff Richard) and ELO (\"I'm Alive\", which went gold, \"All Over the World\" and \"Don't Walk Away\"). The title track, performed by both Newton-John and ELO, is ELO's only song to top the singles chart in the United Kingdom.Guinness World Records: \"British Hit Singles 14th Edition\", page 195. 0-85112-156-X More than a quarter of a century later, Xanadu, a Broadway musical, based on the film, opened on 10 July 2007 at the Helen Hayes Theatre to uniformly good reviews. It received 4 Tony Award nominations. The musical received its UK premiere in London in October 2015. Casey Kasem called The Electric Light Orchestra a \"7-man supergroup\" and \"amazing\" for hitting The Top 40 a remarkable 6 times in a one-year period from August 1979 to August 1980 before playing \"All Over the World\" at #23Casey Kasem's American Top 40 from 30 August 1980\n\nIn 1981, ELO's sound changed again with the science fiction concept album Time, a throwback to earlier, more progressive rock albums like Eldorado. With the string section now departed, synthesisers took a dominating role, as was the trend in the larger music scene of the time; although studio strings were present on some of the tracks conducted by Rainer Pietsch, the overall soundscape had a more electronic feel in keeping with the futuristic nature of the album. Time topped the UK charts for two weeks and was the last ELO studio album to be certified platinum in the United Kingdom until Alone in the Universe in 2015. Singles from the album included \"Hold On Tight\", \"Twilight\", \"The Way Life's Meant to Be\", \"Here Is the News\" and \"Ticket to the Moon\". The band embarked on their last world tour to promote the LP. For the tour Kaminski returned to the line-up on violin, whilst synthesiser players Louis Clark and Dave Morgan also joined the band.\n\n1983–1986: Secret Messages, Balance of Power, disbanding\n\nJeff Lynne wanted to follow Time with a double album, but CBS blocked his plan on the grounds that a double vinyl album would be too expensive in the oil crisis and as a result, the new album was edited down from double album to a single disc and released as Secret Messages in 1983 (many of the out-takes were later released on Afterglow or as b-sides of singles). The album was a hit in the UK reaching the top 5; but its release was undermined by a string of bad news that there would be no tour to promote the LP, as drummer Bevan was now playing drums for Black Sabbath and bassist Groucutt had left the band during the recording of the album (leaving Lynne to once again record many of the bass parts). Rumours of the group disbanding were publicly denied by Bevan and although Secret Messages debuted at number four in the United Kingdom, it fell off the charts, failing to catch fire with a lack of hit singles in the UK (though \"Rock 'n' Roll Is King\" was a sizeable hit in UK, the US and Australia) and a lukewarm media response. By 1983 Bevan was expressing a desire to join Black Sabbath permanently and Lynne and Tandy were recording tracks for the Electric Dreams soundtrack under Lynne's name; however, Lynne was contractually obliged to make one more ELO album. Lynne, Bevan and Tandy returned to the studio in 1985 as a three-piece (with Christian Schneider playing saxophone on some tracks and Lynne again doubling on bass in addition to his usual guitar in the absence of an official bass player) to record Balance of Power, released early in 1986. Though the single \"Calling America\" placed in the Top 30 in the United Kingdom (number 28) and Top 20 in the States, subsequent singles failed to chart. The album lacked actual classical strings, which were replaced once again by synthesisers, played by Tandy.\n\nThe band was then rejoined by Kaminski, Clark, and Morgan, adding Martin Smith on bass guitar, and proceeded to perform a small number of live ELO performances in 1986, including shows in England and Germany along with US appearances on American Bandstand, Solid Gold, then at Disneyland that summer. The Birmingham Heart Beat Charity Concert 1986 was a charity concert organised by Bevan in ELO's hometown of Birmingham on 15 March 1986. A hint of Lynne's future was seen when George Harrison appeared onstage during the encore at Heartbeat, joining in the all-star jam of \"Johnny B. Goode\". ELO's last performance for several years occurred on 13 July 1986 in Stuttgart, Germany playing as opening act to Rod Stewart. ELO effectively disbanded after that final show in Stuttgart in 1986, but there was no announcement made of it for the next two years, during which George Harrison's Lynne-produced album Cloud Nine and the pair's follow-up (with Roy Orbison, Bob Dylan and Tom Petty as Traveling Wilburys) Traveling Wilburys Vol. 1 were released.\n\n;ELO Part II\n\nBevan (under an agreement with Lynne who co-owned the ELO name with him) continued on in 1989 as ELO Part II, initially with no other former ELO members. ELO Part II released their debut album Electric Light Orchestra Part Two in 1990. Mik Kaminski, Kelly Groucutt and Hugh McDowell joined the band for the first tour in 1991. McDowell left after that tour. Bevan, Groucutt, Kaminski and Clark recorded a second album, Moment of Truth, in 1994 and toured extensively until 1999. Bevan retired from the line-up in 1999 and sold his share of the ELO name to Jeff Lynne in 2000.\n\n2000–2001: Reformation\n\nLynne's comeback with ELO began in 2000 with the release of a retrospective box set, Flashback, containing three CDs of remastered tracks and a handful of out-takes and unfinished works, most notably a new version of ELO's only UK number one hit \"Xanadu\". In 2001 Zoom, ELO's first album since 1986, was released. Though billed and marketed as an ELO album, the only returning member other than Lynne was Tandy, who performed on one track. Guest musicians included former Beatles Ringo Starr and George Harrison. Upon completion of the album, Lynne reformed the band with completely new members, including his then-girlfriend Rosie Vela (who had released her own album, Zazu, in 1986) and announced that ELO would tour again. Former ELO member Tandy rejoined the band a short time afterwards for two television live performances: VH1 Storytellers and a PBS concert shot at CBS Television City, later titled Zoom Tour Live, that was released on DVD. The planned tour was cancelled. \"The off-switch has been flipped on the Electric Light Orchestra. Or at least its tour, which was wired to illuminate the First Union Center on 15 Sept.\"\n\n2001–2013: Non-performing work, reissues and miniature reunions\n\nFor the next six years, Harvest and Epic/Legacy reissued ELO's back catalogue. Included amongst the remastered album tracks were unreleased songs and outtakes, including two new singles. The first was \"Surrender\" which registered on the lower end of the UK Singles Chart at number 81, some 30 years after it was written in 1976. The other single was  \"Latitude 88 North\".\n\nOn 9 August 2010, Eagle Rock Entertainment released Live – The Early Years in the UK as a DVD compilation that included Fusion – Live in London (1976) along with never before released live performances at Brunel University (1973) and on a German TV show Rockpalast (1974).[http://hangout.altsounds.com/news/118072-electric-light-orchestra-live-the-early-years-for-the-first-time-on-dvd.html Electric Light Orchestra \"Live – The Early Years\" for the first time on DVD | Altsounds.com News]. Hangout.altsounds.com. Retrieved 31 January 2011. The US had a slightly edited release on 24 August 2010.[http://www.eagle-rock.com/product/EV303119/Live+-+The+Early+Years Live – The Early Years – Product Details]. Eagle Rock. Retrieved 31 January 2011. The Essential Electric Light Orchestra artwork was re-jigged to feature two different covers. The US and Australian releases shared one design, while the rest of the world featured the other for a new double album release in October 2011.\n\nMr. Blue Sky: The Very Best of Electric Light Orchestra was released on 8 October 2012. It is an album of new recordings of ELO's greatest hits by Lynne; along with a new song \"Point of No Return\", released to coincide with Lynne's second solo album release Long Wave. These new 2012 albums contained advertisement cards, announcing the re-release of expanded and remastered versions of both the 2001 album Zoom and Lynne's debut solo album Armchair Theatre, originally released in 1990. Both albums were re-released in April 2013 with various bonus tracks. Also released was the live album, Electric Light Orchestra Live, showcasing songs from the Zoom tour. All three releases also featured new studio recordings as bonus tracks.\n\nLynne and Tandy reunited again on 12 November 2013 to perform, under the name Jeff Lynne and Friends, \"Livin' Thing\" and \"Mr Blue Sky\" at the Children in Need Rocks concert at Hammersmith Eventim Apollo, London. The backing orchestra was the BBC Concert Orchestra, with Chereene Allen on lead violin.\n\n2014–present: Jeff Lynne's ELO\n\nThe success of the Children in Need was followed by much support from BBC Radio 2's DJ Chris Evans, who asked his listeners if they wanted ELO to perform. The 50,000 tickets for the resulting BBC Radio 2's \"Festival in a Day\" in Hyde Park on 14 September 2014 sold out in 15 minutes. Billed as \"Jeff Lynne's ELO\", Lynne and Tandy were backed by the Take That/Gary Barlow band from the Children in Need concert, led by Mike Stevens  and the BBC Concert Orchestra. The moniker came out from Lynne as a response to ELO tribute and imitation bands, (ELO Part II, the Orchestra, OrKestra and the Music of ELO) who repeatedly used ELO for promoting their own tours. Chereene Allen was the lead violinist for the band. The development of modern digital processing added a smoother finish to the work, which led Lynne to reconsider his preference for studio work, hinting at a UK tour in 2015.\n\nOn 8 February 2015, Jeff Lynne's ELO played at the Grammy Awards for the first time. They performed a medley of \"Evil Woman\" and \"Mr. Blue Sky\" with Ed Sheeran, who introduced them as \"A man and a band who I love\".\n\nOn 10 September 2015, it was announced that a new ELO album would be released. The album was to be under the moniker of Jeff Lynne's ELO, with the band signed to Columbia Records. Alone in the Universe was released on 13 November 2015. The album was ELO's first album of new material in nearly 15 years. The first track, and single, \"When I Was a Boy\" was made available for streaming on the same day and a music video for the song was also released. A small promotional tour followed the album's release which saw ELO perform a full concert for BBC Radio 2 along with ELO's first two shows in the United States in 30 years, both which sold out very quickly. ELO also made rare US television appearances on The Tonight Show Starring Jimmy Fallon, Jimmy Kimmel Live and CBS This Morning. Lynne was joined by Traveling Wilbury's photographer Nick J (NJ Latham) for a 19-date European tour that was announced for 2016, with the band playing the Pyramid Stage at Glastonbury Festival on 26 June 2016. \n\nIn 2017 they played their \"Alone in the Universe\" tour. In 2017 they played at the Rock and Roll Hall of Fame during the 32nd Annual Induction Ceremony.\n\nLegacy and influence\n\nWhen ELO emerged, they were often dismissed by musical cognoscenti as Beatles copyists. According to music journalist Simon Price, ELO was \"arguably the most uncool, even defiantly anti-cool, of the lot, and have been the slowest to be rehabilitated since ... They've been sampled by dozens upon dozens of acts, from Company Flow to the Pussycat Dolls!, if you go looking. Every now and then, in my journalistic career, it's been possible to coax a contemporary band to admit to an ELO influence, the Flaming Lips and Super Furry Animals being two examples. But the band with, arguably, the greatest amount of ELO DNA are outside the rock genre altogether: Daft Punk.\"\n\nIn November 2016, Jeff Lynne's ELO won Band of the Year at the Classic Rock Roll of Honour Awards. In October 2016, ELO were nominated for the 2017 class of the Rock and Roll Hall of Fame for the first time. It was the first time that the Hall had announced in advance the members of bands who would be inducted; the members of ELO listed were  Jeff Lynne, Roy Wood, Bev Bevan and Richard Tandy. On 20 December 2016, it was announced ELO had been elected to the Rock and Roll Hall of Fame Class of 2017.\n\nPersonnel\n\nMembers\n\n;Current members\n*Jeff Lynne – lead and backing vocals, guitars, bass, cello, keyboards, drums, percussion, producer, songwriter, composer, arranger (1970–1986, 2000–2001, 2014–present)\n* Richard Tandy – keyboards, synthesisers, bass, guitar, backing vocals, producer, arranger (1971–1986, 2000–2001, 2014–present)\n\n;Current live members (Jeff Lynne's ELO)\n\n;Former members\n\n;Former live members\n\n;Associated\n\nTimeline\n\nLine-ups\n\nDiscography\n\n;Studio albums\n* The Electric Light Orchestra (1971)\n* ELO 2 (1973)\n* On the Third Day (1973)\n* Eldorado (1974)\n* Face the Music (1975)\n* A New World Record (1976)\n* Out of the Blue (1977)\n* Discovery (1979)\n* Time (1981) (credited as \"ELO\")\n* Secret Messages (1983)\n* Balance of Power (1986)\n* Zoom (2001)\n* Alone in the Universe (2015) (credited as \"Jeff Lynne's ELO\")\n\n;Soundtrack album\n* Xanadu (1980)\n\nNotes. Electric Light Orchestra. http://en.wikipedia.org/?curid=10484."
  }
}
