{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10618",
  "eid" : "f678a1b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778493259,
  "textBody" : "A fiddle is a bowed string musical instrument, most often a violin. It is also a colloquial term for the violin, used by players in all genres including classical music. Fiddle playing, or fiddling, refers to various styles of music. The fiddle is part of many traditional (folk) styles of music which are aural traditions, taught 'by ear' rather than via written music. \n\nThere are few real distinctions between violins and fiddles, though more primitively constructed and smaller violins are more likely to be considered fiddles. Due to the style of the music played, fiddles may optionally be set up with a bridge with a flatter arch to reduce the range of right-arm motion needed for techniques such as the double shuffle, a form of bariolage involving rapid alternation between pairs of adjacent strings.\n\nIn order to produce a \"brighter\" tone,  compared to the deeper tones of gut or synthetic core strings, fiddlers often prefer to use steel strings on their instruments.  Among musical styles, fiddling tends to produce rhythms focused on dancing, with associated quick note changes, whereas classical music tends to contain more vibrato and sustained notes. It is less common for a classically trained violinist to play folk music, but today, many fiddlers have classical training.\n\nHistory\n\nThe medieval fiddle emerged in 10th-century Europe, deriving from the Byzantine lira (Greek: λύρα, Latin: lira, English: lyre), a bowed string instrument of the Byzantine Empire and ancestor of most European bowed instruments.\"fiddle.\" Encyclopædia Britannica. 2009. Encyclopædia Britannica Online. 6 March 2009.Anthony Baines: The Oxford Companion to Musical Instruments. Oxford University Press, USA (November 12, 1992). The first recorded reference to the bowed lira was in the 9th century by the Persian geographer Ibn Khurradadhbih (d. 911); in his lexicographical discussion of instruments he cited the lira (lūrā) as a typical instrument of the Byzantines and equivalent to the rabāb played in the Islamic Empires.Margaret J. Kartomi: On Concepts and Classifications of Musical Instruments. Chicago Studies in Ethnomusicology, University of Chicago Press, 1990 p. 124. Lira spread widely westward to Europe; in the 11th and 12th centuries European writers use the terms fiddle and lira interchangeably when referring to bowed instruments (Encyclopædia Britannica. 2009).\n\nOver the centuries, Europe continued to have two distinct types of fiddles: one, relatively square-shaped, held in the arms, became known as the viola da braccio (arm viol) family and evolved into the violin; the other, with sloping shoulders and held between the knees, was the viola da gamba (leg viol) group. During the Renaissance the gambas were important and elegant instruments; they eventually lost ground to the louder (and originally less aristocratic) viola da braccio  family.stringed instrument. (2009). In Encyclopædia Britannica. Retrieved March 14, 2009, from \n[http://www.britannica.com/EBchecked/topic/569200/stringed-instrument Encyclopædia Britannica Online] (Encyclopædia Britannica. 2009).\n\nEtymology\n\nThe etymology of fiddle is uncertain: the Germanic fiddle may derive from the same early Romance word as does violin, or it may be natively Germanic.\n\n(as access to the OED online is not free, the relevant excerpt is provided) \"The ultimate origin is obscure. The [Teutonic] word bears a singular resemblance in sound to its [medieval Latin] synonym vitula, vidula, whence [Old French] viole, Pr. viula, and (by adoption from these [languages]) [Italian], [Spanish], [Portuguese] viola: see [viol]. The supposition that the early [Romance] vidula was adopted independently in more than one [Teutonic language] would account adequately for all the [Teutonic] forms; on the other hand, *fiÞulôn- may be an [Old Teutonic] word of native etymology, though no satisfactory [Teutonic] derivation has been found.\"\n The name seems however to be related to Icelandic Fiðla and also Old English fiðele. A native Germanic ancestor of fiddle may even be the ancestor of the early Romance form of violin.Mario Pei, The Story of the English Language (New York: Simon and Schuster, 1967), p. 109. Historically, fiddle also referred to a predecessor of today's violin. Like the violin, it tended to have four strings, but came in a variety of shapes and sizes. Another family of instruments that contributed to the development of the modern fiddle are the viols, which are held between the legs and played vertically, and have fretted fingerboards.\n\nEnsembles\n\nIn performance, a solo fiddler, or one or two with a group of other instrumentalists, is the norm, though twin fiddling is represented in some North American, Scandinavian, Scottish and Irish styles. Following the folk revivals of the second half of the 20th century, however, it has become common for less formal situations to find large groups of fiddlers playing together—see for example the Calgary Fiddlers, and Swedish Spelmanslag folk-musician clubs, and the worldwide phenomenon of Irish sessions.\n\nOrchestral violins, on the other hand, are commonly grouped in sections, or \"chairs\". These contrasting traditions may be vestiges of historical performance settings: large concert halls where violins were played required more instruments, before electronic amplification, than did more intimate dance halls and houses that fiddlers played in.\n\nThe difference was likely compounded by the different sounds expected of violin music and fiddle music. Historically, the majority of fiddle music was dance music, while violin music had either grown out of dance music or was something else entirely. Violin music came to value a smoothness that fiddling, with its dance-driven clear beat, did not always follow. In situations that required greater volume, a fiddler (as long as they kept the beat) could push their instrument harder than could a violinist. Various fiddle traditions have differing values. \n\nScottish fiddle with cello\n\nIn the very late 20th century, a few artists have successfully attempted a reconstruction of the Scottish tradition of violin and \"big fiddle,\" or cello. Notable recorded examples include Iain Fraser and Christine Hanson, Amelia Kaminski and Christine Hanson's Bonnie Lasses and Alasdair Fraser and Natalie Haas' Fire and Grace.\n\nBalkan fiddle with kontra\n\nHungarian, Slovenian, and Romanian fiddle players are often accompanied by a three-stringed variant of the viola—known as the kontra—and by double bass, with cimbalom and clarinet being less standard yet still common additions to a band.  In Hungary, a three stringed viola variant with a flat bridge, called the kontra or háromhúros brácsa makes up part of a traditional rhythm section in Hungarian folk music.  The flat bridge allows for three string chords to be played. A three stringed double bass variant is also used.\n\nStyles\n\nTo a greater extent than classical violin playing, fiddle playing is characterized by a huge variety of ethnic or folk music traditions, each of which has its own distinctive sound.\n\nEurope\n\nGreat Britain\n\n* English folk music fiddling, including\n**The Northumbrian fiddle style, which features \"seconding\", an improvised harmony part played by a second fiddler.\n* Scottish fiddling, including:\n**Shetland fiddling, which includes trowie tunes said to come from peerie folk. The style is characterized by \"ringing strings\" and syncopated rhythms.\n**A Lowland Scots tradition strongly influenced by baroque violin technique with staccato and Scotch snap bowing techniques in addition to the use of double stops.\n**A Scottish Borders tradition with a repertoire heavy in hornpipes and with heavy use of double stops.\n**A Highland tradition, highly influenced by the ornamentation and mixolydian scale of the Great Highland Bagpipe, as well as smoother bowing than other Scottish fiddle styles and a swinging of the 6/8 jig rhythm.\n**An Orkney tradition with simpler bowing and ornamentation but with tunes featuring accidentals.\n* Welsh fiddling (Welsh Ffidil; see Ar Log), a recently revived tradition.\n\nIreland\n\n* Irish folk music fiddling including:\n**Donegal fiddling from the northwest in Ulster, which features mazurkas and a Scottish-influenced repertoire including Strathspey and Highland Fling dances. Fiddlers tend to play fast and make heavy use of staccato bowing and may from time to time \"play the bass,\" meaning a second fiddler may play a melody an octave below where a first fiddler is playing it.\n**Sligo fiddling from northern Connacht, which like Donegal fiddling tends to be fast, but with a bouncier feel to the bowing.\n**Galway fiddling southern Connacht, which is slower than Sligo or Donegal traditions, with a heavier emphasis on ornamentation. Additionally, tunes are occasionally played in Eb or Bb to match the tonality of flat pipes.\n**Clare fiddling from northern Munster, which tends to be played near the slower Galway tempo yet with a greater emphasis on the melody itself rather than ornamentation.\n**Sliabh Luachra fiddling from the southwest in Munster, characterized by a unique repertoire of polkas and slides, the use of double stops and drones, as well as playing the melody in two octaves as in Donegal.\n\nNordic countries\n\n* Norwegian fiddling (including Hardanger fiddling; see also Bygdedans and Gammaldans), including traditions from:\n**Røros and Nord-Noreg styles, both using the standard fiddle.\n**Finnskogen, using the standard fiddle, but featuring some flatted notes influenced by Finnish folk music.\n**Voss and Telemark styles, both using the Hardanger fiddle.\n**Setesdal, which uses both standard and Hardanger fiddles.\n* Swedish fiddling (including Låtfiol playing; see also Spelmanslag and Gammaldans), including traditions from:\n**Jämtland\n**Dalarna\n* Finnish fiddling, including the regional styles of:\n**Kaustinen\n**Ostrobothnia, heavily influenced by Swedish fiddling.\n\nContinental Europe\n\n* Austrian fiddling\n* French fiddling, including an old tradition from Corrèze and a revived one from Brittany\n* Hungarian folk music traditions\n* Italian fiddling\n* Klezmer fiddling\n* Polish fiddling\n* Mainland Portuguese and Azorean fiddling\n* Romanian fiddling\n\nAmericas\n\nNorth America\n\nAmerican fiddling, a broad category including traditional and modern styles\n\nTraditional\n\n*Blues fiddling\n*Cajun and Zydeco fiddling\n*Native American fiddling, including:\n**Cherokee\n**Creek\n**Tohono O'odham, a style heavily influenced by Mexican fiddling and featuring irregular counts and harmonies in thirds, fourths, and sixths.\n*Old-time fiddling, including:\n**Fiddling from Appalachia, the most well-known style today, featuring heavy use of droning and double-stops as well as syncopated bowing patterns.\n**Athabaskan fiddling of the Interior Alaska.\n**Midwestern fiddling, highly influenced by Scandinavian music.\n**Ozarks fiddling, faster and crisper bowing than Appalachia.\n**Texas fiddling, with influences from Mexican fiddling and an emphasis on competitive playing.\n**New England fiddling, with strong influences from Québécois/French Canadian and British repertoires.\n**Northwest fiddling, with influences from both Ozark and Midwestern fiddle styles, though with a strong emphasis on competitive playing like Texas fiddling.\n\nModern\n\n*Bluegrass fiddling\n*Country fiddling\n*Western swing style fiddling\n\nCanadian\n \nFiddling remains popular in Canada, and the various homegrown styles of Canadian fiddling are seen as an important part of the country's cultural identity, as celebrated during the opening ceremony of the Vancouver 2010 Winter Olympics.\n*Cape Breton fiddling, with a distinct Scottish influence\n*French Canadian fiddling including \"crooked tunes,\" that is, tunes with irregular beat patterns.\n*Métis fiddling, of central and western Canada featuring strong French Canadian influence, but with even more \"crooked\" tunes.\n*Newfoundland and Labrador fiddling\n*Maritimes, Acadian or Downeast style of fiddling, which has many similarities to Cape Breton fiddling\n*English Canadian fiddling or Anglo-Canadian fiddling\n\nLatin America\n\n* Forró, a type of music from Brazil, including the rabeca fiddle tradition\n* Mexican fiddling, including mariachi, son planeco, son arribeño, son huasteco, son calentano, violín-tambora and danza indígena.\n* Peruvian violin\n\nOther areas\n\n* African fiddle\n*Australian folk music traditions\n* Morna fiddling from Cape Verde\n* Indian fiddle\n* Indian classical music\n\nRelated instruments\n\nVariants\n\n*Hardanger fiddle\n*Stroh violin or phonofiddle, known in Romanian as Vioara cu goarnă.\n\nNear relations\n\n*Cello\n*Double bass\n*Kontra\n* Låtfiol\n*Rebec\n*Rabeca\n*Viola\n\nDistant relations\n\n*Apache fiddle\n*Byzantine lyra, the medieval bowed instrument of the Byzantine Empire\n*Cretan Lyra\n*Crwth\n*Gadulka\n*Gudok\n*Gusle\n*Huqin\n*Hurdy-gurdy also known as the wheel fiddle\n*Kamancheh\n*Lijerica\n*Nyckelharpa\n*Rebab",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fiddle" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10618" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A fiddle is a bowed string musical instrument, most often a violin. It is also a colloquial term for the violin, used by players in all genres including classical music. Fiddle playing, or fiddling, refers to various styles of music. The fiddle is part of many traditional (folk) styles of music which are aural traditions, taught 'by ear' rather than via written music. \n\nThere are few real distinctions between violins and fiddles, though more primitively constructed and smaller violins are more likely to be considered fiddles. Due to the style of the music played, fiddles may optionally be set up with a bridge with a flatter arch to reduce the range of right-arm motion needed for techniques such as the double shuffle, a form of bariolage involving rapid alternation between pairs of adjacent strings.\n\nIn order to produce a \"brighter\" tone,  compared to the deeper tones of gut or synthetic core strings, fiddlers often prefer to use steel strings on their instruments.  Among musical styles, fiddling tends to produce rhythms focused on dancing, with associated quick note changes, whereas classical music tends to contain more vibrato and sustained notes. It is less common for a classically trained violinist to play folk music, but today, many fiddlers have classical training.\n\nHistory\n\nThe medieval fiddle emerged in 10th-century Europe, deriving from the Byzantine lira (Greek: λύρα, Latin: lira, English: lyre), a bowed string instrument of the Byzantine Empire and ancestor of most European bowed instruments.\"fiddle.\" Encyclopædia Britannica. 2009. Encyclopædia Britannica Online. 6 March 2009.Anthony Baines: The Oxford Companion to Musical Instruments. Oxford University Press, USA (November 12, 1992). The first recorded reference to the bowed lira was in the 9th century by the Persian geographer Ibn Khurradadhbih (d. 911); in his lexicographical discussion of instruments he cited the lira (lūrā) as a typical instrument of the Byzantines and equivalent to the rabāb played in the Islamic Empires.Margaret J. Kartomi: On Concepts and Classifications of Musical Instruments. Chicago Studies in Ethnomusicology, University of Chicago Press, 1990 p. 124. Lira spread widely westward to Europe; in the 11th and 12th centuries European writers use the terms fiddle and lira interchangeably when referring to bowed instruments (Encyclopædia Britannica. 2009).\n\nOver the centuries, Europe continued to have two distinct types of fiddles: one, relatively square-shaped, held in the arms, became known as the viola da braccio (arm viol) family and evolved into the violin; the other, with sloping shoulders and held between the knees, was the viola da gamba (leg viol) group. During the Renaissance the gambas were important and elegant instruments; they eventually lost ground to the louder (and originally less aristocratic) viola da braccio  family.stringed instrument. (2009). In Encyclopædia Britannica. Retrieved March 14, 2009, from \n[http://www.britannica.com/EBchecked/topic/569200/stringed-instrument Encyclopædia Britannica Online] (Encyclopædia Britannica. 2009).\n\nEtymology\n\nThe etymology of fiddle is uncertain: the Germanic fiddle may derive from the same early Romance word as does violin, or it may be natively Germanic.\n\n(as access to the OED online is not free, the relevant excerpt is provided) \"The ultimate origin is obscure. The [Teutonic] word bears a singular resemblance in sound to its [medieval Latin] synonym vitula, vidula, whence [Old French] viole, Pr. viula, and (by adoption from these [languages]) [Italian], [Spanish], [Portuguese] viola: see [viol]. The supposition that the early [Romance] vidula was adopted independently in more than one [Teutonic language] would account adequately for all the [Teutonic] forms; on the other hand, *fiÞulôn- may be an [Old Teutonic] word of native etymology, though no satisfactory [Teutonic] derivation has been found.\"\n The name seems however to be related to Icelandic Fiðla and also Old English fiðele. A native Germanic ancestor of fiddle may even be the ancestor of the early Romance form of violin.Mario Pei, The Story of the English Language (New York: Simon and Schuster, 1967), p. 109. Historically, fiddle also referred to a predecessor of today's violin. Like the violin, it tended to have four strings, but came in a variety of shapes and sizes. Another family of instruments that contributed to the development of the modern fiddle are the viols, which are held between the legs and played vertically, and have fretted fingerboards.\n\nEnsembles\n\nIn performance, a solo fiddler, or one or two with a group of other instrumentalists, is the norm, though twin fiddling is represented in some North American, Scandinavian, Scottish and Irish styles. Following the folk revivals of the second half of the 20th century, however, it has become common for less formal situations to find large groups of fiddlers playing together—see for example the Calgary Fiddlers, and Swedish Spelmanslag folk-musician clubs, and the worldwide phenomenon of Irish sessions.\n\nOrchestral violins, on the other hand, are commonly grouped in sections, or \"chairs\". These contrasting traditions may be vestiges of historical performance settings: large concert halls where violins were played required more instruments, before electronic amplification, than did more intimate dance halls and houses that fiddlers played in.\n\nThe difference was likely compounded by the different sounds expected of violin music and fiddle music. Historically, the majority of fiddle music was dance music, while violin music had either grown out of dance music or was something else entirely. Violin music came to value a smoothness that fiddling, with its dance-driven clear beat, did not always follow. In situations that required greater volume, a fiddler (as long as they kept the beat) could push their instrument harder than could a violinist. Various fiddle traditions have differing values. \n\nScottish fiddle with cello\n\nIn the very late 20th century, a few artists have successfully attempted a reconstruction of the Scottish tradition of violin and \"big fiddle,\" or cello. Notable recorded examples include Iain Fraser and Christine Hanson, Amelia Kaminski and Christine Hanson's Bonnie Lasses and Alasdair Fraser and Natalie Haas' Fire and Grace.\n\nBalkan fiddle with kontra\n\nHungarian, Slovenian, and Romanian fiddle players are often accompanied by a three-stringed variant of the viola—known as the kontra—and by double bass, with cimbalom and clarinet being less standard yet still common additions to a band.  In Hungary, a three stringed viola variant with a flat bridge, called the kontra or háromhúros brácsa makes up part of a traditional rhythm section in Hungarian folk music.  The flat bridge allows for three string chords to be played. A three stringed double bass variant is also used.\n\nStyles\n\nTo a greater extent than classical violin playing, fiddle playing is characterized by a huge variety of ethnic or folk music traditions, each of which has its own distinctive sound.\n\nEurope\n\nGreat Britain\n\n* English folk music fiddling, including\n**The Northumbrian fiddle style, which features \"seconding\", an improvised harmony part played by a second fiddler.\n* Scottish fiddling, including:\n**Shetland fiddling, which includes trowie tunes said to come from peerie folk. The style is characterized by \"ringing strings\" and syncopated rhythms.\n**A Lowland Scots tradition strongly influenced by baroque violin technique with staccato and Scotch snap bowing techniques in addition to the use of double stops.\n**A Scottish Borders tradition with a repertoire heavy in hornpipes and with heavy use of double stops.\n**A Highland tradition, highly influenced by the ornamentation and mixolydian scale of the Great Highland Bagpipe, as well as smoother bowing than other Scottish fiddle styles and a swinging of the 6/8 jig rhythm.\n**An Orkney tradition with simpler bowing and ornamentation but with tunes featuring accidentals.\n* Welsh fiddling (Welsh Ffidil; see Ar Log), a recently revived tradition.\n\nIreland\n\n* Irish folk music fiddling including:\n**Donegal fiddling from the northwest in Ulster, which features mazurkas and a Scottish-influenced repertoire including Strathspey and Highland Fling dances. Fiddlers tend to play fast and make heavy use of staccato bowing and may from time to time \"play the bass,\" meaning a second fiddler may play a melody an octave below where a first fiddler is playing it.\n**Sligo fiddling from northern Connacht, which like Donegal fiddling tends to be fast, but with a bouncier feel to the bowing.\n**Galway fiddling southern Connacht, which is slower than Sligo or Donegal traditions, with a heavier emphasis on ornamentation. Additionally, tunes are occasionally played in Eb or Bb to match the tonality of flat pipes.\n**Clare fiddling from northern Munster, which tends to be played near the slower Galway tempo yet with a greater emphasis on the melody itself rather than ornamentation.\n**Sliabh Luachra fiddling from the southwest in Munster, characterized by a unique repertoire of polkas and slides, the use of double stops and drones, as well as playing the melody in two octaves as in Donegal.\n\nNordic countries\n\n* Norwegian fiddling (including Hardanger fiddling; see also Bygdedans and Gammaldans), including traditions from:\n**Røros and Nord-Noreg styles, both using the standard fiddle.\n**Finnskogen, using the standard fiddle, but featuring some flatted notes influenced by Finnish folk music.\n**Voss and Telemark styles, both using the Hardanger fiddle.\n**Setesdal, which uses both standard and Hardanger fiddles.\n* Swedish fiddling (including Låtfiol playing; see also Spelmanslag and Gammaldans), including traditions from:\n**Jämtland\n**Dalarna\n* Finnish fiddling, including the regional styles of:\n**Kaustinen\n**Ostrobothnia, heavily influenced by Swedish fiddling.\n\nContinental Europe\n\n* Austrian fiddling\n* French fiddling, including an old tradition from Corrèze and a revived one from Brittany\n* Hungarian folk music traditions\n* Italian fiddling\n* Klezmer fiddling\n* Polish fiddling\n* Mainland Portuguese and Azorean fiddling\n* Romanian fiddling\n\nAmericas\n\nNorth America\n\nAmerican fiddling, a broad category including traditional and modern styles\n\nTraditional\n\n*Blues fiddling\n*Cajun and Zydeco fiddling\n*Native American fiddling, including:\n**Cherokee\n**Creek\n**Tohono O'odham, a style heavily influenced by Mexican fiddling and featuring irregular counts and harmonies in thirds, fourths, and sixths.\n*Old-time fiddling, including:\n**Fiddling from Appalachia, the most well-known style today, featuring heavy use of droning and double-stops as well as syncopated bowing patterns.\n**Athabaskan fiddling of the Interior Alaska.\n**Midwestern fiddling, highly influenced by Scandinavian music.\n**Ozarks fiddling, faster and crisper bowing than Appalachia.\n**Texas fiddling, with influences from Mexican fiddling and an emphasis on competitive playing.\n**New England fiddling, with strong influences from Québécois/French Canadian and British repertoires.\n**Northwest fiddling, with influences from both Ozark and Midwestern fiddle styles, though with a strong emphasis on competitive playing like Texas fiddling.\n\nModern\n\n*Bluegrass fiddling\n*Country fiddling\n*Western swing style fiddling\n\nCanadian\n \nFiddling remains popular in Canada, and the various homegrown styles of Canadian fiddling are seen as an important part of the country's cultural identity, as celebrated during the opening ceremony of the Vancouver 2010 Winter Olympics.\n*Cape Breton fiddling, with a distinct Scottish influence\n*French Canadian fiddling including \"crooked tunes,\" that is, tunes with irregular beat patterns.\n*Métis fiddling, of central and western Canada featuring strong French Canadian influence, but with even more \"crooked\" tunes.\n*Newfoundland and Labrador fiddling\n*Maritimes, Acadian or Downeast style of fiddling, which has many similarities to Cape Breton fiddling\n*English Canadian fiddling or Anglo-Canadian fiddling\n\nLatin America\n\n* Forró, a type of music from Brazil, including the rabeca fiddle tradition\n* Mexican fiddling, including mariachi, son planeco, son arribeño, son huasteco, son calentano, violín-tambora and danza indígena.\n* Peruvian violin\n\nOther areas\n\n* African fiddle\n*Australian folk music traditions\n* Morna fiddling from Cape Verde\n* Indian fiddle\n* Indian classical music\n\nRelated instruments\n\nVariants\n\n*Hardanger fiddle\n*Stroh violin or phonofiddle, known in Romanian as Vioara cu goarnă.\n\nNear relations\n\n*Cello\n*Double bass\n*Kontra\n* Låtfiol\n*Rebec\n*Rabeca\n*Viola\n\nDistant relations\n\n*Apache fiddle\n*Byzantine lyra, the medieval bowed instrument of the Byzantine Empire\n*Cretan Lyra\n*Crwth\n*Gadulka\n*Gudok\n*Gusle\n*Huqin\n*Hurdy-gurdy also known as the wheel fiddle\n*Kamancheh\n*Lijerica\n*Nyckelharpa\n*Rebab. Fiddle. http://en.wikipedia.org/?curid=10618."
  }
}
