{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20209",
  "eid" : "40d55820-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778618018,
  "textBody" : "March 24th is the 365th and last day of the year in many European implementations of the Julian calendar.\n\nEvents\n\n*1401 – Turco-Mongol emperor Timur sacks Damascus.\n*1603 – James VI of Scotland becomes James I of England and Ireland, upon the death of Elizabeth I.\n*  1603   – Tokugawa Ieyasu is granted the title of shogun from Emperor Go-Yōzei, and establishes the Tokugawa shogunate in Edo, Japan.\n*1663 – The Province of Carolina is granted by charter to eight Lords Proprietor in reward for their assistance in restoring Charles II of England to the throne.\n*1720 – Count Frederick of Hesse-Kassel is elected King of Sweden by the Riksdag of the Estates, after his consort Ulrika Eleonora abdicated the throne on 29 February\n*1721 – Johann Sebastian Bach dedicated six concertos to Margrave Christian Ludwig of Brandenburg-Schwedt, now commonly called the Brandenburg Concertos, BWV 1046–1051.\n*1731 – Naturalization of Hieronimus de Salis Parliamentary Act is passed.\n*1765 – Great Britain passes the Quartering Act, which requires the Thirteen Colonies to house British troops.\n*1794 – In Kraków, Tadeusz Kościuszko announces a general uprising against Imperial Russia and the Kingdom of Prussia, and assumes the powers of the Commander in Chief of all of the Polish forces.\n*1829 – The Parliament of the United Kingdom passes the Roman Catholic Relief Act 1829, allowing Catholics to serve in Parliament.\n*1832 – In Hiram, Ohio, a group of men beat and tar and feather Mormon leader Joseph Smith.\n*1837 – Canada gives African Canadian men the right to vote.\n*1854 – Slavery is abolished in Venezuela.\n*1860 – Sakuradamon Incident: Assassination of Japanese Chief Minister (Tairō) Ii Naosuke.\n*1869 – The last of Titokowaru's forces surrendered to the New Zealand government, ending his uprising.\n*1878 – The British frigate  sinks, killing more than 300.\n*1882 – Robert Koch announces the discovery of Mycobacterium tuberculosis, the bacterium responsible for tuberculosis.\n*1885 – Sino-French War: Chinese victory in the Battle of Bang Bo on the Tonkin–Guangxi border.\n*1896 – A. S. Popov makes the first radio signal transmission in history.\n*1900 – Mayor of New York City Robert Anderson Van Wyck breaks ground for a new underground \"Rapid Transit Railroad\" that would link Manhattan and Brooklyn.\n*1907 – The first issue of the Georgian Bolshevik newspaper Dro is published.\n*1921 – The 1921 Women's Olympiad begins in Monte Carlo, first international women's sports event\n*1927 – Nanking Incident: Foreign warships bombard Nanjing, China, in defense of the foreign citizens within the city.\n*1934 – United States Congress passes the Tydings–McDuffie Act, allowing the Philippines to become a self-governing commonwealth.\n*1944 – Ardeatine massacre: German troops murder 335 Italian civilians in Rome.\n*  1944   – World War II: In an event later dramatized in the movie The Great Escape, 76 Allied prisoners of war begin breaking out of the German camp Stalag Luft III.\n*1946 – A British Cabinet Mission arrives in India to discuss and plan for the transfer of power from the British Raj to Indian leadership.\n*1958 – Rock 'n' roll teen idol Elvis Presley is drafted in the U.S. Army.\n*1961 – Quebec Board of the French Language is established.\n*1965 – Images from the Ranger 9 lunar probe are broadcast live on network television.\n*1973 – Kenyan athlete Kip Keino defeats Jim Ryun at the first-ever professional track meet in Los Angeles.\n*1976 – In Argentina, the armed forces overthrow the constitutional government of President Isabel Perón and start a 7-year dictatorial period self-styled the National Reorganization Process.\n*1980 – El Salvadorian Archbishop Óscar Romero is assassinated while celebrating Mass in San Salvador.\n*1986 – The Loscoe gas explosion leads to new UK laws on landfill gas migration and gas protection on landfill sites.\n*1989 – In Prince William Sound in Alaska, the Exxon Valdez spills 240000 oilbbl of crude oil after running aground.\n*1993 – Discovery of Comet Shoemaker–Levy 9.\n*1998 – Mitchell Johnson and Andrew Golden, aged 11 and 13 respectively, fire upon teachers and students at Westside Middle School in Jonesboro, Arkansas; five people are killed and ten are wounded.\n*  1998   – A tornado sweeps through Dantan in India, killing 250 people and injuring 3,000 others.\n*  1998   – First computer-assisted Bone Segment Navigation, performed at the University of Regensburg, Germany\n*1999 – Kosovo war: NATO began attacks on Yugoslavia without United Nations Security Council (UNSC) approval, marking the first time NATO has attacked a sovereign country.\n*1999 – A lorry carrying margarine and flour catches fire inside the Mont Blanc Tunnel. The resulting inferno kills 38 people.\n*2003 – The Arab League votes 21–1 in favor of a resolution demanding the immediate and unconditional removal of U.S. and British soldiers from Iraq.\n*2008 – Bhutan officially becomes a democracy, with its first ever general election.\n*2015 – Germanwings Flight 9525 crashes in the French Alps in an apparent pilot mass murder-suicide, killing all 150 people on board.\n\nBirths\n\n*1103 – Yue Fei, Chinese military general (d. 1142)\n*1285 – An-Nasir Muhammad, Egyptian sultan (d. 1341)\n*1441 – Ernest, Elector of Saxony, German ruler of Saxony (d. 1486)\n*1494 – Georgius Agricola, German mineralogist and scholar (d. 1555)\n*1577 – Francis, Duke of Pomerania-Stettin, Bishop of Cammin (d. 1620)\n*1579 – Tirso de Molina, Spanish monk and dramatist (d. 1648)\n*1607 – Michiel de Ruyter, Dutch admiral (d. 1667)\n*1628 – Sophie Amalie of Brunswick-Lüneburg (d. 1685)\n*1657 – Arai Hakuseki, Japanese academic and politician (d. 1725)\n*1693 – John Harrison, English carpenter and clock-maker, invented the Marine chronometer (d. 1776)\n*1725 – Samuel Ashe, American lawyer and politician, 9th Governor of North Carolina (d. 1813)\n*  1725   – Thomas Cushing, American lawyer and politician, 1st Lieutenant Governor of Massachusetts (d. 1788)\n*1755 – Rufus King, American lawyer and politician, United States Ambassador to the United Kingdom (d. 1827)\n*1762 – Marcos Portugal, Portuguese organist and composer (d. 1830)\n*1775 – Muthuswami Dikshitar, Indian poet and composer (d. 1835)\n*1782 – Orest Kiprensky, Russian-Italian painter (d. 1836)\n*1796 – John Corry Wilson Daly, Canadian businessman and politician (d. 1878)\n*1803 – Egerton Ryerson, Canadian minister, educator, and politician (d. 1882)\n*1808 – Maria Malibran, Spanish-French soprano (d. 1836)\n*1809 – Mariano José de Larra, Spanish journalist and author (d. 1837)\n*  1809   – Joseph Liouville, French mathematician and academic (d. 1882)\n*1820 – Edmond Becquerel, French physicist and academic (d. 1891)\n*  1820   – Fanny Crosby, American poet and composer (d. 1915)\n*1823 – Thomas Spencer Baynes, English philosopher and critic (d. 1887)\n*1826 – Matilda Joslyn Gage, American activist and author (d. 1898)\n*1828 – Horace Gray, American lawyer and jurist (d. 1902)\n*1829 – George Francis Train, American businessman (d. 1904)\n*  1829   – Ignacio Zaragoza, Mexican general (d. 1862)\n*1830 – Robert Hamerling, Austrian poet and playwright (d. 1889)\n*1834 – William Morris, English textile designer, poet, and author (d. 1896)\n*  1834   – John Wesley Powell, American soldier, geologist, and explorer (d. 1902)\n*1835 – Joseph Stefan, Austrian physicist, mathematician, and poet (d. 1893)\n*1848 – Honoré Beaugrand, Canadian journalist and politician, 18th Mayor of Montreal (d. 1906)\n*1850 – Silas Hocking, English minister and author (d. 1935)\n*1855 – Andrew W. Mellon, American banker, financier, and diplomat, 49th United States Secretary of the Treasury (d. 1937)\n*  1855   – Olive Schreiner, South African author and activist (d. 1920)\n*1862 – Frank Weston Benson, American painter and educator (d. 1951)\n*1869 – Émile Fabre, French author and playwright (d. 1955)\n*1871 – Alec Hurley, English music hall singer (d. 1913)\n*1874 – Luigi Einaudi, Italian economist and politician, 2nd President of the Italian Republic (d. 1961)\n*  1874   – Harry Houdini, Hungarian-Jewish American magician and actor (d. 1926)\n*  1874   – Selim Sırrı Tarcan, Turkish educator and politician (d. 1957)\n*1875 – William Burns, Canadian lacrosse player (d. 1953)\n*1879 – Neyzen Tevfik, Turkish philosopher, poet, and composer (d. 1953)\n*1882 – Marcel Lalu, French gymnast (d. 1951)\n*  1882   – George Monckton-Arundell, 8th Viscount Galway, English politician, 5th Governor-General of New Zealand (d. 1943)\n*1883 – Dorothy Campbell, Scottish-American golfer (d. 1945)\n*1884 – Peter Debye, Dutch-American physicist and chemist, Nobel Prize laureate (d. 1966)\n*  1884   – Eugène Tisserant, French cardinal (d. 1972)\n*1885 – Charles Daniels, American swimmer (d. 1973)\n*  1885   – Dimitrie Cuclin, Romanian violinist and composer (d. 1978)\n*1886 – Edward Weston, American photographer (d. 1958)\n*  1886   – Robert Mallet-Stevens, French architect and designer (d. 1945)\n*1887 – Roscoe Arbuckle, American actor, director, and screenwriter (d. 1933)\n*1888 – Viktor Kingissepp, Estonian politician (d. 1922)\n*1889 – Albert Hill, English-Canadian runner (d. 1969)\n*1890 – Agnes Macphail, Canadian educator and politician (d. 1954)\n*1891 – Sergey Ivanovich Vavilov, Russian physicist and academic (d. 1951)\n*1892 – Marston Morse, American mathematician and academic (d. 1977)\n*1893 – Walter Baade, German astronomer and author (d. 1960)\n*  1893   – George Sisler, American baseball player and scout (d. 1973)\n*1897 – Wilhelm Reich, Austrian-American psychotherapist and academic (d. 1957)\n*1901 – Ub Iwerks, American animator, director, and producer, co-created Mickey Mouse (d. 1971)\n*1902 – Thomas E. Dewey, American lawyer and politician, 47th Governor of New York (d. 1971)\n*1903 – Adolf Butenandt, German biochemist and academic, Nobel Prize laureate (d. 1995)\n*  1903   – Malcolm Muggeridge, English journalist, author, and scholar (d. 1990)\n*1905 – Pura Santillan-Castrence, Filipino author and diplomat (d. 2007)\n*1907 – Paul Sauvé, Canadian lawyer and politician, 17th Premier of Quebec (d. 1960)\n*1909 – Clyde Barrow, American criminal (d. 1934)\n*1910 – Richard Conte, American actor, singer, and director (d. 1975)\n*1911 – Joseph Barbera, American animator, director, and producer, co-founded Hanna-Barbera (d. 2006)\n*1912 – Dorothy Height, African-American educator and activist (d. 2010)\n*1915 – Eugène Martin, French racing driver (d. 2006)\n*1916 – Donald Hamilton, Swedish-American soldier and author (d. 2006)\n*  1916   – Harry B. Whittington, English palaeontologist and academic (d. 2010)\n*1917 – John Kendrew, English biochemist and crystallographer, Nobel Prize laureate (d. 1997)\n*1919 – Lawrence Ferlinghetti, American poet and publisher, co-founded City Lights Bookstore\n*  1919   – Robert Heilbroner, American economist and historian (d. 2005)\n*1920 – Gene Nelson, American actor, director, and screenwriter (d. 1996)\n*  1920   – Mary Stolz, American author (d. 2006)\n*1921 – Vasily Smyslov, Russian chess player (d. 2010)\n*1922 – Onna White, Canadian dancer and choreographer (d. 2005)\n*1923 – Murray Hamilton, American actor (d. 1986)\n*  1923   – Michael Legat, English author and publisher (d. 2011)\n*1924 – Norman Fell, American actor (d. 1998)\n*1925 – Puig Aubert, German-French rugby league player and coach (d. 1994)\n*1926 – Desmond Connell, Irish cardinal (d. 2017)\n*  1926   – Dario Fo, Italian playwright, actor, director, and composer, Nobel Prize laureate (d. 2016)\n*  1926   – William Porter, American hurdler (d. 2000)\n*1927 – John Woodland Hastings, American biochemist and academic (d. 2014)\n*  1927   – Martin Walser, German author and playwright\n*1928 – Byron Janis, American pianist and composer\n*1929 – Pat Renella, Italian-American actor (d. 2012)\n*1930 – David Dacko, Central African politician, 1st President of the Central African Republic (d. 2003)\n*  1930   – Steve McQueen, American actor and producer (d. 1980)\n*1931 – Hanno Drechsler, German educator and politician, Mayor of Marburg (d. 2003)\n*1933 – Stephen De Staebler, American sculptor and educator (d. 2011)\n*1936 – Alex Olmedo, Peruvian-American tennis player\n*1937 – Billy Stewart, American singer and pianist (d. 1970)\n*1938 – Don Covay, American singer-songwriter (d. 2015)\n*  1938   – David Irving, English historian and author\n*1940 – Bob Mackie, American fashion designer\n*1941 – Michael Masser, American songwriter, composer and producer (d. 2015)\n*1944 – R. Lee Ermey, American sergeant and actor\n*  1944   – Vojislav Koštunica, Serbian academic and politician, 8th Prime Minister of Serbia\n*1945 – Robert T. Bakker, American paleontologist and academic\n*  1945   – Curtis Hanson, American director, producer, and screenwriter (d. 2016)\n*  1945   – Patrick Malahide, English actor and screenwriter\n*1946 – Klaus Dinger, German guitarist and songwriter (d. 2008)\n*  1946   – Kitty O'Neil, American stuntwoman\n*1947 – Dennis Erickson, American football player and coach\n*  1947   – Christine Gregoire, American lawyer and politician, 22nd Governor of Washington\n*  1947   – Mick Jones, English footballer and coach\n*  1947   – Alan Sugar, English businessman\n*1948 – Javier Diez Canseco, Peruvian sociologist and politician (d. 2013)\n*  1948   – Jerzy Kukuczka, Polish mountaineer (d. 1989)\n*  1948   – Lee Oskar, Jewish-Danish musician\n*1949 – Tabitha King, American author and poet\n*  1949   – Ruud Krol, Dutch footballer and coach\n*  1949   – Steve Lang, Canadian bass player (April Wine) (d. 2017)\n*  1949   – Nick Lowe, English singer-songwriter, bass player, and producer \n*  1949   – Ali Akbar Salehi, Iranian academic and politician, 36th Foreign Affairs Minister of Iran\n*  1949   – Ranil Wickremesinghe, Sri Lankan lawyer and politician, 13th Prime Minister of Sri Lanka\n*1950 – Gary Wichard, American football player and agent (d. 2011)\n*1951 – Peter Boyle, Scottish-Australian footballer and manager (d. 2013)\n*  1951   – Pat Bradley, American golfer\n*  1951   – Tommy Hilfiger, American fashion designer, founded the Tommy Hilfiger Corporation\n*  1951   – Dougie Thomson, Scottish bass player\n*  1951   – Anna Włodarczyk, Polish long jumper and coach\n*1952 – Greg McCrary, American football player (d. 2013)\n*1953 – Anita L. Allen, African-American lawyer, philosopher, and academic\n*  1953   – Louie Anderson, American actor and comedian\n*1955 – Doug Jarvis, Canadian ice hockey player and coach\n*  1955   – Pat Price, Canadian ice hockey player and coach\n*1956 – Steve Ballmer, American businessman\n*  1956   – Bill Wray, American cartoonist and painter\n*1957 – Pierre Harvey, Canadian cyclist and skier\n*  1957   – Pat Jarvis, Australian rugby league player\n*1958 – Mike Woodson, American basketball player and coach\n*1959 – Emmit King, American sprinter\n*  1959   – Renaldo Nehemiah, American hurdler and football player\n*  1959   – Derek Statham, English footballer\n*1960 – Jan Berglin, Swedish cartoonist\n*  1960   – Barry Horowitz, American wrestler\n*  1960   – Kelly Le Brock, English-American actress and model\n*  1960   – Nena, German singer-songwriter and actress\n*  1960   – Scott Pruett, American race car driver\n*  1960   – Annabella Sciorra, American actress \n*1961 – Dean Jones, Australian cricketer and coach\n*1961 – Yanis Varoufakis, Greek economist and politician, Greek Minister of Finance\n*1962 – Angèle Dubeau, Canadian violinist\n*  1962   – Star Jones, African-American lawyer, journalist, and talk show host\n*  1962   – Irina Meszynski, German discus thrower\n*1963 – Raimond van der Gouw, Dutch footballer and coach\n*  1963   – Vadym Tyshchenko, Ukrainian footballer and manager (d. 2015)\n*  1963   – Torsten Voss, German decathlete and bobsledder\n*1965 – The Undertaker, American wrestler and actor\n*1966 – Floyd Heard, American sprinter and coach\n*1967 – Diann Roffe, American skier\n*1968 – Minarti Timur, Indonesian badminton player\n*1969 – Stephan Eberharter, Austrian skier\n*1970 – Lara Flynn Boyle, American actress \n*  1970   – Sharon Corr, Irish singer-songwriter and violinist \n*  1970   – Judith Draxler, Austrian swimmer\n*  1970   – Erica Kennedy, African-American journalist and author (d. 2012)\n*  1970   – Mike Vanderjagt, Canadian-American football player\n*1971 – Tig Notaro, American comedian and actor\n*1972 – Christophe Dugarry, French footballer\n*  1972   – Steve Karsay, American baseball player and coach\n*1973 – Jacek Bąk, Polish footballer\n*  1973   – Philippe Boucher, Canadian ice hockey player and manager\n*  1973   – Steve Corica, Australian footballer and coach\n*  1973   – Mette Jacobsen, Danish swimmer\n*  1973   – Glen Jakovich, Australian footballer\n*  1973   – Jim Parsons, American actor\n*1974 – Alyson Hannigan, American actress\n*  1974   – Sergey Klyugin, Russian high jumper\n*1975 – Thomas Johansson, Swedish-Monacan tennis player\n*1976 – Aaron Brooks, American football player\n*  1976   – Aliou Cissé, Senegalese footballer and coach\n*  1976   – Athanasios Kostoulas, Greek footballer\n*  1976   – Peyton Manning, American football player and entrepreneur\n*1977 – Jessica Chastain, American actress \n*  1977   – Maxim Kuznetsov, Russian ice hockey player\n*  1977   – Darren Lockyer, Australian rugby league player and sportscaster\n*1978 – Michael Braun, Australian footballer and coach\n*  1978   – Tomáš Ujfaluši, Czech footballer and manager\n*  1978   – José Valverde, Dominican baseball player\n*1979 – Lake Bell, Jewish-American actress, director, and screenwriter\n*  1979   – Norris Hopper, American baseball player\n*  1979   – Periklis Iakovakis, Greek hurdler\n*  1979   – Graeme Swann, English cricketer\n*1980 – Tassos Venetis, Greek footballer\n*1981 – Mike Adams, American football player\n*  1981   – Ron Hainsey, American ice hockey player\n*  1981   – Dirk Hayhurst, American baseball player\n*  1981   – Mark Looms, Dutch footballer\n*  1981   – Gary Paffett, English race car driver\n*1982 – Corey Hart, American baseball player\n*  1982   – Jimmy Hempte, Belgian footballer\n*  1982   – Dustin McGowan, American baseball player\n*1983 – Luca Ceccarelli, Italian footballer\n*  1983   – Riccardo Musetti, Italian footballer\n*  1983   – Pierre-Alexandre Parenteau, Canadian ice hockey player\n*1984 – Benoît Assou-Ekotto, French-Cameroonian footballer\n*  1984   – Chris Bosh, American basketball player\n*  1984   – Adrian D'Souza, Indian field hockey player\n*  1984   – Lucy Wangui Kabuu, Kenyan runner\n*  1984   – Park Bom, South Korean Singer\n*1985 – Frederico Gil, Portuguese tennis player\n*  1985   – Lana, American-born professional wrestler/manager\n*  1985   – Haruka Ayase, Japanese actress and singer\n*1986 – Tony McMahon, English footballer\n*1987 – Ramires, Brazilian footballer\n*  1987   – Shakib Al Hasan, Bangladeshi cricketer\n*  1987   – Billy Jones, English footballer\n*  1987   – Josh Zeid, American baseball player\n*1988 – Aiga Grabuste, Latvian heptathlete\n*  1988   – Ryan Higgins, Zimbabwean cricketer\n*  1988   – Matías Martínez, Argentinian footballer\n*  1988   – Kardo Ploomipuu, Estonian swimmer\n*1990 – Starlin Castro, American baseball player\n*  1990   – Libby Clegg, English runner\n*  1990   – Keisha Castle-Hughes, Australian-New Zealand actress\n*1991 – Nick Browne, English cricketer\n*  1991   – Dalila Jakupovic, Slovenian tennis player\n*1995 – Enzo Fernandez, French-Spanish footballer\n*1997 – Myoui Mina, member of South Korean Girl Group - Twice (band)\n\nDeaths\n\n* 809 – Harun al-Rashid, Arab caliph (b. 763)\n* 832 – Wulfred, archbishop of Canterbury\n*1284 – Hugh III of Cyprus (b. 1235)\n*1296 – Odon de Pins, Grand Master of the Knights Hospitaller\n*1381 – Catherine of Vadstena, Swedish saint (b. 1332)\n*1394 – Constance of Castile, claimant to the throne of Castile\n*1396 – Walter Hilton, English mystic and saint (b. 1340)\n*1399 – Margaret, Duchess of Norfolk (b.c. 1320)\n*1443 – James Douglas, 7th Earl of Douglas (b. 1371)\n*1455 – Pope Nicholas V (b. 1397)\n*1499 – Edward Stafford, 2nd Earl of Wiltshire, English nobleman (b. 1470)\n*1563 – Hosokawa Harumoto, Japanese daimyo (b. 1514)\n*1575 – Joseph ben Ephraim Karo, Spanish-Portuguese rabbi and author (b. 1488)\n*1603 – Elizabeth I of England (b. 1533)\n*1653 – Samuel Scheidt, German organist and composer (b. 1587)\n*1684 – Pieter de Hooch, Dutch painter (b. 1629)\n*1773 – Philip Stanhope, 4th Earl of Chesterfield, English politician, Captain of the Yeomen of the Guard (b. 1694)\n*1776 – John Harrison, English carpenter and clockmaker, invented the Marine chronometer (b. 1693)\n*1824 – Louis Marie de La Révellière-Lépeaux, French lawyer (b. 1753)\n*1838 – Abraham Hume, English floriculturist and Tory politician (b. 1748/49)\n*1869 – Antoine-Henri Jomini, French-Russian general (b. 1779)\n*1881 – Achille Ernest Oscar Joseph Delesse, French geologist and mineralogist (b. 1817)\n*1882 – Henry Wadsworth Longfellow, American poet and educator (b. 1807)\n*1887 – Ivan Kramskoi, Russian painter and critic (b. 1837)\n*1888 – Vsevolod Garshin, Russian author (b. 1855)\n*1905 – Jules Verne, French novelist, poet, and playwright (b. 1828)\n*1909 – John Millington Synge, Irish playwright and poet (b. 1871)\n*1915 – Margaret Lindsay Huggins, Anglo-Irish astronomer (b. 1848)\n*  1915   – Karol Olszewski, Polish chemist, mathematician, and physicist (b. 1846)\n*1916 – Enrique Granados, Spanish pianist and composer (b. 1867)\n*1926 – Phan Châu Trinh, Vietnamese activist (b. 1872)\n*1940 – Édouard Branly, French physicist and academic (b. 1844)\n*1944 – Orde Wingate, Indian-English general (b. 1903)\n*1946 – Alexander Alekhine, Russian chess player (b. 1892)\n*  1946   – Carl Schuhmann, German gymnast, shot putter, and jumper (b. 1869)\n*1948 – Sigrid Hjertén, Swedish painter and illustrator (b. 1885)\n*1950 – James Rudolph Garfield, American lawyer and politician, 23rd United States Secretary of the Interior (b. 1865)\n*1951 – Lorna Hodgkinson, Australian educator and educational psychologist (b. 1887)\n*1953 – Mary of Teck (b. 1867)\n*1962 – Jean Goldkette, French-American pianist and bandleader (b. 1899)\n*  1962   – Auguste Piccard, Swiss physicist and explorer (b. 1884)\n*1971 – Arne Jacobsen, Danish architect, designed the Radisson Blu Royal Hotel and Aarhus City Hall (b. 1902)\n*  1971   – Arthur Metcalfe, Australian public servant (b. 1895)\n*1976 – Bernard Montgomery, 1st Viscount Montgomery of Alamein, English field marshal (b. 1887)\n*1980 – Óscar Romero, Salvadoran archbishop (b. 1917)\n*1984 – Sam Jaffe, American actor (b. 1891)\n*1985 – Raoul Ubac, French painter, sculptor, photographer and engraver (b. 1910)\n*1988 – Turhan Feyzioğlu, Turkish academic and politician, 27th Deputy Prime Minister of Turkey (b. 1922)\n*1990 – Ray Goulding, American comedian and radio host (b. 1922)\n*1991 – John Kerr, Australian lawyer and politician, 18th Governor-General of Australia (b. 1914)\n*1993 – Albert Arlen, Australian pianist, composer, actor, and playwright (b. 1905)\n*  1993   – John Hersey, American journalist and author (b. 1914)\n*1995 – Joseph Needham, English historian and academic (b. 1900)\n*1999 – Gertrud Scholtz-Klink, German politician (b. 1902)\n*  1999   – Birdie Tebbetts, American baseball player and manager (b. 1912)\n*2001 – Muriel Young, English television host and producer (b. 1928)\n*2002 – César Milstein, Argentinian-English biochemist and academic, Nobel Prize laureate (b. 1927)\n*  2002   – Bob Said, American race car driver and bobsledder (b. 1932)\n*2003 – Hans Hermann Groër, Austrian cardinal (b. 1919)\n*2006 – Rudra Rajasingham, Sri Lankan police officer and diplomat (b. 1926)\n*2008 – Chalmers Alford, American guitarist (b. 1955)\n*  2008   – Neil Aspinall, Welsh-English record producer and manager (b. 1941)\n*  2008   – Rafael Azcona, Spanish author and screenwriter (b. 1926)\n*  2008   – Hal Riney, American businessman, founded Publicis & Hal Riney (b. 1932)\n*  2008   – Richard Widmark, American actor (b. 1914)\n*2009 – George Kell, American baseball player and sportscaster (b. 1922)\n*  2009   – Hans Klenk, German race car driver (b. 1919)\n*  2009   – Gábor Ocskay, Hungarian ice hockey player (b. 1975)\n*2010 – Robert Culp, American actor (b. 1930)\n*  2010   – Jim Marshall, American photographer (b. 1936)\n*2012 – Paul Callaghan, New Zealand physicist and academic (b. 1947)\n*  2012   – Nick Noble, American singer-songwriter (b. 1926)\n*2013 – Barbara Anderson, New Zealand author (b. 1926)\n*  2013   – Inge Lønning, Norwegian theologian, academic, and politician (b. 1938)\n*  2013   – Gury Marchuk, Russian physicist, mathematician, and academic (b. 1925)\n*  2013   – Paolo Ponzo, Italian footballer (b. 1972)\n*  2013   – Deke Richards, American songwriter and producer (b. 1944)\n*  2013   – Mohamed Yousri Salama, Egyptian dentist and politician (b. 1974)\n*  2013   – Francis Hovell-Thurlow-Cumming-Bruce, 8th Baron Thurlow, English diplomat (b. 1912)\n*2014 – Oleksandr Muzychko, Ukrainian activist (b. 1962)\n*  2014   – John Rowe Townsend, English author and scholar (b. 1922)\n*  2014   – David A. Trampier, American illustrator (b. 1954)\n*2015 – Yehuda Avner, English-Israeli diplomat (b. 1928)\n*  2015   – notable deaths of the Germanwings Flight 9525 crash:\n**Oleg Bryjak, Kazakhstani-German opera singer (b. 1960)\n**Maria Radner, German opera singer (b. 1981)\n*2016 – Johan Cruyff, Dutch footballer (b. 1947)\n*  2016   – Garry Shandling, American comedian, actor, and screenwriter (b. 1949)\n\nHolidays and observances\n\n*Christian feast day:\n**Catherine of Vadstena\n**Mac Cairthinn of Clogher\n**Óscar Romero (Catholic Church, Anglican Communion, Lutheranism)\n**Paul Couturier (Church of England)\n**Simon of Trent (cult suppressed)\n**Walter Hilton (Church of England)\n**March 24 (Eastern Orthodox liturgics)\n*Day of Remembrance for Truth and Justice (Argentina)\n*National Tree Planting Day (Uganda)\n*Student Day (Scientology) \n*World Tuberculosis Day (International)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 24" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20209" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "March 24th is the 365th and last day of the year in many European implementations of the Julian calendar.\n\nEvents\n\n*1401 – Turco-Mongol emperor Timur sacks Damascus.\n*1603 – James VI of Scotland becomes James I of England and Ireland, upon the death of Elizabeth I.\n*  1603   – Tokugawa Ieyasu is granted the title of shogun from Emperor Go-Yōzei, and establishes the Tokugawa shogunate in Edo, Japan.\n*1663 – The Province of Carolina is granted by charter to eight Lords Proprietor in reward for their assistance in restoring Charles II of England to the throne.\n*1720 – Count Frederick of Hesse-Kassel is elected King of Sweden by the Riksdag of the Estates, after his consort Ulrika Eleonora abdicated the throne on 29 February\n*1721 – Johann Sebastian Bach dedicated six concertos to Margrave Christian Ludwig of Brandenburg-Schwedt, now commonly called the Brandenburg Concertos, BWV 1046–1051.\n*1731 – Naturalization of Hieronimus de Salis Parliamentary Act is passed.\n*1765 – Great Britain passes the Quartering Act, which requires the Thirteen Colonies to house British troops.\n*1794 – In Kraków, Tadeusz Kościuszko announces a general uprising against Imperial Russia and the Kingdom of Prussia, and assumes the powers of the Commander in Chief of all of the Polish forces.\n*1829 – The Parliament of the United Kingdom passes the Roman Catholic Relief Act 1829, allowing Catholics to serve in Parliament.\n*1832 – In Hiram, Ohio, a group of men beat and tar and feather Mormon leader Joseph Smith.\n*1837 – Canada gives African Canadian men the right to vote.\n*1854 – Slavery is abolished in Venezuela.\n*1860 – Sakuradamon Incident: Assassination of Japanese Chief Minister (Tairō) Ii Naosuke.\n*1869 – The last of Titokowaru's forces surrendered to the New Zealand government, ending his uprising.\n*1878 – The British frigate  sinks, killing more than 300.\n*1882 – Robert Koch announces the discovery of Mycobacterium tuberculosis, the bacterium responsible for tuberculosis.\n*1885 – Sino-French War: Chinese victory in the Battle of Bang Bo on the Tonkin–Guangxi border.\n*1896 – A. S. Popov makes the first radio signal transmission in history.\n*1900 – Mayor of New York City Robert Anderson Van Wyck breaks ground for a new underground \"Rapid Transit Railroad\" that would link Manhattan and Brooklyn.\n*1907 – The first issue of the Georgian Bolshevik newspaper Dro is published.\n*1921 – The 1921 Women's Olympiad begins in Monte Carlo, first international women's sports event\n*1927 – Nanking Incident: Foreign warships bombard Nanjing, China, in defense of the foreign citizens within the city.\n*1934 – United States Congress passes the Tydings–McDuffie Act, allowing the Philippines to become a self-governing commonwealth.\n*1944 – Ardeatine massacre: German troops murder 335 Italian civilians in Rome.\n*  1944   – World War II: In an event later dramatized in the movie The Great Escape, 76 Allied prisoners of war begin breaking out of the German camp Stalag Luft III.\n*1946 – A British Cabinet Mission arrives in India to discuss and plan for the transfer of power from the British Raj to Indian leadership.\n*1958 – Rock 'n' roll teen idol Elvis Presley is drafted in the U.S. Army.\n*1961 – Quebec Board of the French Language is established.\n*1965 – Images from the Ranger 9 lunar probe are broadcast live on network television.\n*1973 – Kenyan athlete Kip Keino defeats Jim Ryun at the first-ever professional track meet in Los Angeles.\n*1976 – In Argentina, the armed forces overthrow the constitutional government of President Isabel Perón and start a 7-year dictatorial period self-styled the National Reorganization Process.\n*1980 – El Salvadorian Archbishop Óscar Romero is assassinated while celebrating Mass in San Salvador.\n*1986 – The Loscoe gas explosion leads to new UK laws on landfill gas migration and gas protection on landfill sites.\n*1989 – In Prince William Sound in Alaska, the Exxon Valdez spills 240000 oilbbl of crude oil after running aground.\n*1993 – Discovery of Comet Shoemaker–Levy 9.\n*1998 – Mitchell Johnson and Andrew Golden, aged 11 and 13 respectively, fire upon teachers and students at Westside Middle School in Jonesboro, Arkansas; five people are killed and ten are wounded.\n*  1998   – A tornado sweeps through Dantan in India, killing 250 people and injuring 3,000 others.\n*  1998   – First computer-assisted Bone Segment Navigation, performed at the University of Regensburg, Germany\n*1999 – Kosovo war: NATO began attacks on Yugoslavia without United Nations Security Council (UNSC) approval, marking the first time NATO has attacked a sovereign country.\n*1999 – A lorry carrying margarine and flour catches fire inside the Mont Blanc Tunnel. The resulting inferno kills 38 people.\n*2003 – The Arab League votes 21–1 in favor of a resolution demanding the immediate and unconditional removal of U.S. and British soldiers from Iraq.\n*2008 – Bhutan officially becomes a democracy, with its first ever general election.\n*2015 – Germanwings Flight 9525 crashes in the French Alps in an apparent pilot mass murder-suicide, killing all 150 people on board.\n\nBirths\n\n*1103 – Yue Fei, Chinese military general (d. 1142)\n*1285 – An-Nasir Muhammad, Egyptian sultan (d. 1341)\n*1441 – Ernest, Elector of Saxony, German ruler of Saxony (d. 1486)\n*1494 – Georgius Agricola, German mineralogist and scholar (d. 1555)\n*1577 – Francis, Duke of Pomerania-Stettin, Bishop of Cammin (d. 1620)\n*1579 – Tirso de Molina, Spanish monk and dramatist (d. 1648)\n*1607 – Michiel de Ruyter, Dutch admiral (d. 1667)\n*1628 – Sophie Amalie of Brunswick-Lüneburg (d. 1685)\n*1657 – Arai Hakuseki, Japanese academic and politician (d. 1725)\n*1693 – John Harrison, English carpenter and clock-maker, invented the Marine chronometer (d. 1776)\n*1725 – Samuel Ashe, American lawyer and politician, 9th Governor of North Carolina (d. 1813)\n*  1725   – Thomas Cushing, American lawyer and politician, 1st Lieutenant Governor of Massachusetts (d. 1788)\n*1755 – Rufus King, American lawyer and politician, United States Ambassador to the United Kingdom (d. 1827)\n*1762 – Marcos Portugal, Portuguese organist and composer (d. 1830)\n*1775 – Muthuswami Dikshitar, Indian poet and composer (d. 1835)\n*1782 – Orest Kiprensky, Russian-Italian painter (d. 1836)\n*1796 – John Corry Wilson Daly, Canadian businessman and politician (d. 1878)\n*1803 – Egerton Ryerson, Canadian minister, educator, and politician (d. 1882)\n*1808 – Maria Malibran, Spanish-French soprano (d. 1836)\n*1809 – Mariano José de Larra, Spanish journalist and author (d. 1837)\n*  1809   – Joseph Liouville, French mathematician and academic (d. 1882)\n*1820 – Edmond Becquerel, French physicist and academic (d. 1891)\n*  1820   – Fanny Crosby, American poet and composer (d. 1915)\n*1823 – Thomas Spencer Baynes, English philosopher and critic (d. 1887)\n*1826 – Matilda Joslyn Gage, American activist and author (d. 1898)\n*1828 – Horace Gray, American lawyer and jurist (d. 1902)\n*1829 – George Francis Train, American businessman (d. 1904)\n*  1829   – Ignacio Zaragoza, Mexican general (d. 1862)\n*1830 – Robert Hamerling, Austrian poet and playwright (d. 1889)\n*1834 – William Morris, English textile designer, poet, and author (d. 1896)\n*  1834   – John Wesley Powell, American soldier, geologist, and explorer (d. 1902)\n*1835 – Joseph Stefan, Austrian physicist, mathematician, and poet (d. 1893)\n*1848 – Honoré Beaugrand, Canadian journalist and politician, 18th Mayor of Montreal (d. 1906)\n*1850 – Silas Hocking, English minister and author (d. 1935)\n*1855 – Andrew W. Mellon, American banker, financier, and diplomat, 49th United States Secretary of the Treasury (d. 1937)\n*  1855   – Olive Schreiner, South African author and activist (d. 1920)\n*1862 – Frank Weston Benson, American painter and educator (d. 1951)\n*1869 – Émile Fabre, French author and playwright (d. 1955)\n*1871 – Alec Hurley, English music hall singer (d. 1913)\n*1874 – Luigi Einaudi, Italian economist and politician, 2nd President of the Italian Republic (d. 1961)\n*  1874   – Harry Houdini, Hungarian-Jewish American magician and actor (d. 1926)\n*  1874   – Selim Sırrı Tarcan, Turkish educator and politician (d. 1957)\n*1875 – William Burns, Canadian lacrosse player (d. 1953)\n*1879 – Neyzen Tevfik, Turkish philosopher, poet, and composer (d. 1953)\n*1882 – Marcel Lalu, French gymnast (d. 1951)\n*  1882   – George Monckton-Arundell, 8th Viscount Galway, English politician, 5th Governor-General of New Zealand (d. 1943)\n*1883 – Dorothy Campbell, Scottish-American golfer (d. 1945)\n*1884 – Peter Debye, Dutch-American physicist and chemist, Nobel Prize laureate (d. 1966)\n*  1884   – Eugène Tisserant, French cardinal (d. 1972)\n*1885 – Charles Daniels, American swimmer (d. 1973)\n*  1885   – Dimitrie Cuclin, Romanian violinist and composer (d. 1978)\n*1886 – Edward Weston, American photographer (d. 1958)\n*  1886   – Robert Mallet-Stevens, French architect and designer (d. 1945)\n*1887 – Roscoe Arbuckle, American actor, director, and screenwriter (d. 1933)\n*1888 – Viktor Kingissepp, Estonian politician (d. 1922)\n*1889 – Albert Hill, English-Canadian runner (d. 1969)\n*1890 – Agnes Macphail, Canadian educator and politician (d. 1954)\n*1891 – Sergey Ivanovich Vavilov, Russian physicist and academic (d. 1951)\n*1892 – Marston Morse, American mathematician and academic (d. 1977)\n*1893 – Walter Baade, German astronomer and author (d. 1960)\n*  1893   – George Sisler, American baseball player and scout (d. 1973)\n*1897 – Wilhelm Reich, Austrian-American psychotherapist and academic (d. 1957)\n*1901 – Ub Iwerks, American animator, director, and producer, co-created Mickey Mouse (d. 1971)\n*1902 – Thomas E. Dewey, American lawyer and politician, 47th Governor of New York (d. 1971)\n*1903 – Adolf Butenandt, German biochemist and academic, Nobel Prize laureate (d. 1995)\n*  1903   – Malcolm Muggeridge, English journalist, author, and scholar (d. 1990)\n*1905 – Pura Santillan-Castrence, Filipino author and diplomat (d. 2007)\n*1907 – Paul Sauvé, Canadian lawyer and politician, 17th Premier of Quebec (d. 1960)\n*1909 – Clyde Barrow, American criminal (d. 1934)\n*1910 – Richard Conte, American actor, singer, and director (d. 1975)\n*1911 – Joseph Barbera, American animator, director, and producer, co-founded Hanna-Barbera (d. 2006)\n*1912 – Dorothy Height, African-American educator and activist (d. 2010)\n*1915 – Eugène Martin, French racing driver (d. 2006)\n*1916 – Donald Hamilton, Swedish-American soldier and author (d. 2006)\n*  1916   – Harry B. Whittington, English palaeontologist and academic (d. 2010)\n*1917 – John Kendrew, English biochemist and crystallographer, Nobel Prize laureate (d. 1997)\n*1919 – Lawrence Ferlinghetti, American poet and publisher, co-founded City Lights Bookstore\n*  1919   – Robert Heilbroner, American economist and historian (d. 2005)\n*1920 – Gene Nelson, American actor, director, and screenwriter (d. 1996)\n*  1920   – Mary Stolz, American author (d. 2006)\n*1921 – Vasily Smyslov, Russian chess player (d. 2010)\n*1922 – Onna White, Canadian dancer and choreographer (d. 2005)\n*1923 – Murray Hamilton, American actor (d. 1986)\n*  1923   – Michael Legat, English author and publisher (d. 2011)\n*1924 – Norman Fell, American actor (d. 1998)\n*1925 – Puig Aubert, German-French rugby league player and coach (d. 1994)\n*1926 – Desmond Connell, Irish cardinal (d. 2017)\n*  1926   – Dario Fo, Italian playwright, actor, director, and composer, Nobel Prize laureate (d. 2016)\n*  1926   – William Porter, American hurdler (d. 2000)\n*1927 – John Woodland Hastings, American biochemist and academic (d. 2014)\n*  1927   – Martin Walser, German author and playwright\n*1928 – Byron Janis, American pianist and composer\n*1929 – Pat Renella, Italian-American actor (d. 2012)\n*1930 – David Dacko, Central African politician, 1st President of the Central African Republic (d. 2003)\n*  1930   – Steve McQueen, American actor and producer (d. 1980)\n*1931 – Hanno Drechsler, German educator and politician, Mayor of Marburg (d. 2003)\n*1933 – Stephen De Staebler, American sculptor and educator (d. 2011)\n*1936 – Alex Olmedo, Peruvian-American tennis player\n*1937 – Billy Stewart, American singer and pianist (d. 1970)\n*1938 – Don Covay, American singer-songwriter (d. 2015)\n*  1938   – David Irving, English historian and author\n*1940 – Bob Mackie, American fashion designer\n*1941 – Michael Masser, American songwriter, composer and producer (d. 2015)\n*1944 – R. Lee Ermey, American sergeant and actor\n*  1944   – Vojislav Koštunica, Serbian academic and politician, 8th Prime Minister of Serbia\n*1945 – Robert T. Bakker, American paleontologist and academic\n*  1945   – Curtis Hanson, American director, producer, and screenwriter (d. 2016)\n*  1945   – Patrick Malahide, English actor and screenwriter\n*1946 – Klaus Dinger, German guitarist and songwriter (d. 2008)\n*  1946   – Kitty O'Neil, American stuntwoman\n*1947 – Dennis Erickson, American football player and coach\n*  1947   – Christine Gregoire, American lawyer and politician, 22nd Governor of Washington\n*  1947   – Mick Jones, English footballer and coach\n*  1947   – Alan Sugar, English businessman\n*1948 – Javier Diez Canseco, Peruvian sociologist and politician (d. 2013)\n*  1948   – Jerzy Kukuczka, Polish mountaineer (d. 1989)\n*  1948   – Lee Oskar, Jewish-Danish musician\n*1949 – Tabitha King, American author and poet\n*  1949   – Ruud Krol, Dutch footballer and coach\n*  1949   – Steve Lang, Canadian bass player (April Wine) (d. 2017)\n*  1949   – Nick Lowe, English singer-songwriter, bass player, and producer \n*  1949   – Ali Akbar Salehi, Iranian academic and politician, 36th Foreign Affairs Minister of Iran\n*  1949   – Ranil Wickremesinghe, Sri Lankan lawyer and politician, 13th Prime Minister of Sri Lanka\n*1950 – Gary Wichard, American football player and agent (d. 2011)\n*1951 – Peter Boyle, Scottish-Australian footballer and manager (d. 2013)\n*  1951   – Pat Bradley, American golfer\n*  1951   – Tommy Hilfiger, American fashion designer, founded the Tommy Hilfiger Corporation\n*  1951   – Dougie Thomson, Scottish bass player\n*  1951   – Anna Włodarczyk, Polish long jumper and coach\n*1952 – Greg McCrary, American football player (d. 2013)\n*1953 – Anita L. Allen, African-American lawyer, philosopher, and academic\n*  1953   – Louie Anderson, American actor and comedian\n*1955 – Doug Jarvis, Canadian ice hockey player and coach\n*  1955   – Pat Price, Canadian ice hockey player and coach\n*1956 – Steve Ballmer, American businessman\n*  1956   – Bill Wray, American cartoonist and painter\n*1957 – Pierre Harvey, Canadian cyclist and skier\n*  1957   – Pat Jarvis, Australian rugby league player\n*1958 – Mike Woodson, American basketball player and coach\n*1959 – Emmit King, American sprinter\n*  1959   – Renaldo Nehemiah, American hurdler and football player\n*  1959   – Derek Statham, English footballer\n*1960 – Jan Berglin, Swedish cartoonist\n*  1960   – Barry Horowitz, American wrestler\n*  1960   – Kelly Le Brock, English-American actress and model\n*  1960   – Nena, German singer-songwriter and actress\n*  1960   – Scott Pruett, American race car driver\n*  1960   – Annabella Sciorra, American actress \n*1961 – Dean Jones, Australian cricketer and coach\n*1961 – Yanis Varoufakis, Greek economist and politician, Greek Minister of Finance\n*1962 – Angèle Dubeau, Canadian violinist\n*  1962   – Star Jones, African-American lawyer, journalist, and talk show host\n*  1962   – Irina Meszynski, German discus thrower\n*1963 – Raimond van der Gouw, Dutch footballer and coach\n*  1963   – Vadym Tyshchenko, Ukrainian footballer and manager (d. 2015)\n*  1963   – Torsten Voss, German decathlete and bobsledder\n*1965 – The Undertaker, American wrestler and actor\n*1966 – Floyd Heard, American sprinter and coach\n*1967 – Diann Roffe, American skier\n*1968 – Minarti Timur, Indonesian badminton player\n*1969 – Stephan Eberharter, Austrian skier\n*1970 – Lara Flynn Boyle, American actress \n*  1970   – Sharon Corr, Irish singer-songwriter and violinist \n*  1970   – Judith Draxler, Austrian swimmer\n*  1970   – Erica Kennedy, African-American journalist and author (d. 2012)\n*  1970   – Mike Vanderjagt, Canadian-American football player\n*1971 – Tig Notaro, American comedian and actor\n*1972 – Christophe Dugarry, French footballer\n*  1972   – Steve Karsay, American baseball player and coach\n*1973 – Jacek Bąk, Polish footballer\n*  1973   – Philippe Boucher, Canadian ice hockey player and manager\n*  1973   – Steve Corica, Australian footballer and coach\n*  1973   – Mette Jacobsen, Danish swimmer\n*  1973   – Glen Jakovich, Australian footballer\n*  1973   – Jim Parsons, American actor\n*1974 – Alyson Hannigan, American actress\n*  1974   – Sergey Klyugin, Russian high jumper\n*1975 – Thomas Johansson, Swedish-Monacan tennis player\n*1976 – Aaron Brooks, American football player\n*  1976   – Aliou Cissé, Senegalese footballer and coach\n*  1976   – Athanasios Kostoulas, Greek footballer\n*  1976   – Peyton Manning, American football player and entrepreneur\n*1977 – Jessica Chastain, American actress \n*  1977   – Maxim Kuznetsov, Russian ice hockey player\n*  1977   – Darren Lockyer, Australian rugby league player and sportscaster\n*1978 – Michael Braun, Australian footballer and coach\n*  1978   – Tomáš Ujfaluši, Czech footballer and manager\n*  1978   – José Valverde, Dominican baseball player\n*1979 – Lake Bell, Jewish-American actress, director, and screenwriter\n*  1979   – Norris Hopper, American baseball player\n*  1979   – Periklis Iakovakis, Greek hurdler\n*  1979   – Graeme Swann, English cricketer\n*1980 – Tassos Venetis, Greek footballer\n*1981 – Mike Adams, American football player\n*  1981   – Ron Hainsey, American ice hockey player\n*  1981   – Dirk Hayhurst, American baseball player\n*  1981   – Mark Looms, Dutch footballer\n*  1981   – Gary Paffett, English race car driver\n*1982 – Corey Hart, American baseball player\n*  1982   – Jimmy Hempte, Belgian footballer\n*  1982   – Dustin McGowan, American baseball player\n*1983 – Luca Ceccarelli, Italian footballer\n*  1983   – Riccardo Musetti, Italian footballer\n*  1983   – Pierre-Alexandre Parenteau, Canadian ice hockey player\n*1984 – Benoît Assou-Ekotto, French-Cameroonian footballer\n*  1984   – Chris Bosh, American basketball player\n*  1984   – Adrian D'Souza, Indian field hockey player\n*  1984   – Lucy Wangui Kabuu, Kenyan runner\n*  1984   – Park Bom, South Korean Singer\n*1985 – Frederico Gil, Portuguese tennis player\n*  1985   – Lana, American-born professional wrestler/manager\n*  1985   – Haruka Ayase, Japanese actress and singer\n*1986 – Tony McMahon, English footballer\n*1987 – Ramires, Brazilian footballer\n*  1987   – Shakib Al Hasan, Bangladeshi cricketer\n*  1987   – Billy Jones, English footballer\n*  1987   – Josh Zeid, American baseball player\n*1988 – Aiga Grabuste, Latvian heptathlete\n*  1988   – Ryan Higgins, Zimbabwean cricketer\n*  1988   – Matías Martínez, Argentinian footballer\n*  1988   – Kardo Ploomipuu, Estonian swimmer\n*1990 – Starlin Castro, American baseball player\n*  1990   – Libby Clegg, English runner\n*  1990   – Keisha Castle-Hughes, Australian-New Zealand actress\n*1991 – Nick Browne, English cricketer\n*  1991   – Dalila Jakupovic, Slovenian tennis player\n*1995 – Enzo Fernandez, French-Spanish footballer\n*1997 – Myoui Mina, member of South Korean Girl Group - Twice (band)\n\nDeaths\n\n* 809 – Harun al-Rashid, Arab caliph (b. 763)\n* 832 – Wulfred, archbishop of Canterbury\n*1284 – Hugh III of Cyprus (b. 1235)\n*1296 – Odon de Pins, Grand Master of the Knights Hospitaller\n*1381 – Catherine of Vadstena, Swedish saint (b. 1332)\n*1394 – Constance of Castile, claimant to the throne of Castile\n*1396 – Walter Hilton, English mystic and saint (b. 1340)\n*1399 – Margaret, Duchess of Norfolk (b.c. 1320)\n*1443 – James Douglas, 7th Earl of Douglas (b. 1371)\n*1455 – Pope Nicholas V (b. 1397)\n*1499 – Edward Stafford, 2nd Earl of Wiltshire, English nobleman (b. 1470)\n*1563 – Hosokawa Harumoto, Japanese daimyo (b. 1514)\n*1575 – Joseph ben Ephraim Karo, Spanish-Portuguese rabbi and author (b. 1488)\n*1603 – Elizabeth I of England (b. 1533)\n*1653 – Samuel Scheidt, German organist and composer (b. 1587)\n*1684 – Pieter de Hooch, Dutch painter (b. 1629)\n*1773 – Philip Stanhope, 4th Earl of Chesterfield, English politician, Captain of the Yeomen of the Guard (b. 1694)\n*1776 – John Harrison, English carpenter and clockmaker, invented the Marine chronometer (b. 1693)\n*1824 – Louis Marie de La Révellière-Lépeaux, French lawyer (b. 1753)\n*1838 – Abraham Hume, English floriculturist and Tory politician (b. 1748/49)\n*1869 – Antoine-Henri Jomini, French-Russian general (b. 1779)\n*1881 – Achille Ernest Oscar Joseph Delesse, French geologist and mineralogist (b. 1817)\n*1882 – Henry Wadsworth Longfellow, American poet and educator (b. 1807)\n*1887 – Ivan Kramskoi, Russian painter and critic (b. 1837)\n*1888 – Vsevolod Garshin, Russian author (b. 1855)\n*1905 – Jules Verne, French novelist, poet, and playwright (b. 1828)\n*1909 – John Millington Synge, Irish playwright and poet (b. 1871)\n*1915 – Margaret Lindsay Huggins, Anglo-Irish astronomer (b. 1848)\n*  1915   – Karol Olszewski, Polish chemist, mathematician, and physicist (b. 1846)\n*1916 – Enrique Granados, Spanish pianist and composer (b. 1867)\n*1926 – Phan Châu Trinh, Vietnamese activist (b. 1872)\n*1940 – Édouard Branly, French physicist and academic (b. 1844)\n*1944 – Orde Wingate, Indian-English general (b. 1903)\n*1946 – Alexander Alekhine, Russian chess player (b. 1892)\n*  1946   – Carl Schuhmann, German gymnast, shot putter, and jumper (b. 1869)\n*1948 – Sigrid Hjertén, Swedish painter and illustrator (b. 1885)\n*1950 – James Rudolph Garfield, American lawyer and politician, 23rd United States Secretary of the Interior (b. 1865)\n*1951 – Lorna Hodgkinson, Australian educator and educational psychologist (b. 1887)\n*1953 – Mary of Teck (b. 1867)\n*1962 – Jean Goldkette, French-American pianist and bandleader (b. 1899)\n*  1962   – Auguste Piccard, Swiss physicist and explorer (b. 1884)\n*1971 – Arne Jacobsen, Danish architect, designed the Radisson Blu Royal Hotel and Aarhus City Hall (b. 1902)\n*  1971   – Arthur Metcalfe, Australian public servant (b. 1895)\n*1976 – Bernard Montgomery, 1st Viscount Montgomery of Alamein, English field marshal (b. 1887)\n*1980 – Óscar Romero, Salvadoran archbishop (b. 1917)\n*1984 – Sam Jaffe, American actor (b. 1891)\n*1985 – Raoul Ubac, French painter, sculptor, photographer and engraver (b. 1910)\n*1988 – Turhan Feyzioğlu, Turkish academic and politician, 27th Deputy Prime Minister of Turkey (b. 1922)\n*1990 – Ray Goulding, American comedian and radio host (b. 1922)\n*1991 – John Kerr, Australian lawyer and politician, 18th Governor-General of Australia (b. 1914)\n*1993 – Albert Arlen, Australian pianist, composer, actor, and playwright (b. 1905)\n*  1993   – John Hersey, American journalist and author (b. 1914)\n*1995 – Joseph Needham, English historian and academic (b. 1900)\n*1999 – Gertrud Scholtz-Klink, German politician (b. 1902)\n*  1999   – Birdie Tebbetts, American baseball player and manager (b. 1912)\n*2001 – Muriel Young, English television host and producer (b. 1928)\n*2002 – César Milstein, Argentinian-English biochemist and academic, Nobel Prize laureate (b. 1927)\n*  2002   – Bob Said, American race car driver and bobsledder (b. 1932)\n*2003 – Hans Hermann Groër, Austrian cardinal (b. 1919)\n*2006 – Rudra Rajasingham, Sri Lankan police officer and diplomat (b. 1926)\n*2008 – Chalmers Alford, American guitarist (b. 1955)\n*  2008   – Neil Aspinall, Welsh-English record producer and manager (b. 1941)\n*  2008   – Rafael Azcona, Spanish author and screenwriter (b. 1926)\n*  2008   – Hal Riney, American businessman, founded Publicis & Hal Riney (b. 1932)\n*  2008   – Richard Widmark, American actor (b. 1914)\n*2009 – George Kell, American baseball player and sportscaster (b. 1922)\n*  2009   – Hans Klenk, German race car driver (b. 1919)\n*  2009   – Gábor Ocskay, Hungarian ice hockey player (b. 1975)\n*2010 – Robert Culp, American actor (b. 1930)\n*  2010   – Jim Marshall, American photographer (b. 1936)\n*2012 – Paul Callaghan, New Zealand physicist and academic (b. 1947)\n*  2012   – Nick Noble, American singer-songwriter (b. 1926)\n*2013 – Barbara Anderson, New Zealand author (b. 1926)\n*  2013   – Inge Lønning, Norwegian theologian, academic, and politician (b. 1938)\n*  2013   – Gury Marchuk, Russian physicist, mathematician, and academic (b. 1925)\n*  2013   – Paolo Ponzo, Italian footballer (b. 1972)\n*  2013   – Deke Richards, American songwriter and producer (b. 1944)\n*  2013   – Mohamed Yousri Salama, Egyptian dentist and politician (b. 1974)\n*  2013   – Francis Hovell-Thurlow-Cumming-Bruce, 8th Baron Thurlow, English diplomat (b. 1912)\n*2014 – Oleksandr Muzychko, Ukrainian activist (b. 1962)\n*  2014   – John Rowe Townsend, English author and scholar (b. 1922)\n*  2014   – David A. Trampier, American illustrator (b. 1954)\n*2015 – Yehuda Avner, English-Israeli diplomat (b. 1928)\n*  2015   – notable deaths of the Germanwings Flight 9525 crash:\n**Oleg Bryjak, Kazakhstani-German opera singer (b. 1960)\n**Maria Radner, German opera singer (b. 1981)\n*2016 – Johan Cruyff, Dutch footballer (b. 1947)\n*  2016   – Garry Shandling, American comedian, actor, and screenwriter (b. 1949)\n\nHolidays and observances\n\n*Christian feast day:\n**Catherine of Vadstena\n**Mac Cairthinn of Clogher\n**Óscar Romero (Catholic Church, Anglican Communion, Lutheranism)\n**Paul Couturier (Church of England)\n**Simon of Trent (cult suppressed)\n**Walter Hilton (Church of England)\n**March 24 (Eastern Orthodox liturgics)\n*Day of Remembrance for Truth and Justice (Argentina)\n*National Tree Planting Day (Uganda)\n*Student Day (Scientology) \n*World Tuberculosis Day (International). March 24. http://en.wikipedia.org/?curid=20209."
  }
}
