{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17260",
  "eid" : "2b038f30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778581411,
  "textBody" : "Kandahār or Qandahār (; ; known in older literature as Candahar) is the second-largest city in Afghanistan, with a population of about 557,118. Formerly called Alexandria Arachosia, the city is named after Alexander the Great, who founded it in 329 BC around an ancient Arachosian town. Kandahar is located in the south of the country on the Arghandab River, at an elevation of 1010 m. It is the capital of Kandahar Province, and also the center of the larger cultural region called Loy Kandahar. In 1709, Mirwais Hotak made the region an independent kingdom and turned Kandahar into the capital of the Hotak dynasty. In 1747, Ahmad Shah Durrani, founder of the Durrani dynasty, made Kandahar the capital of the Afghan Empire.\n\nKandahar is one of the most culturally significant cities of the Pashtuns and has been their traditional seat of power for more than 300 years. It is a major trading center for sheep, wool, cotton, silk, felt, food grains, fresh and dried fruit, and tobacco. The region produces fine fruits, especially pomegranates and grapes, and the city has plants for canning, drying, and packing fruit, and is a major source of marijuana and hashish en route to Tajikistan.\n\nThe region around Kandahar is one of the oldest known human settlements. A major fortified city existed at the site of Kandahar, probably as early as  1000-750 BCE,F.R. Allchin (ed.), [https://books.google.com/books?idQ5kI02_zW70C&pg\nPA127 The Archaeology of Early Historic South Asia: The Emergence of Cities and States] (Cambridge University Press, 1995), pp.127-130 and it became an important outpost of the Achaemenid (Persian) Empire in the 6th century BCE.Gérard Fussman, [http://www.iranicaonline.org/articles/kandahar-pre-islamic-monuments-and-remains \"KANDAHAR ii. Pre-Islamic Monuments and Remains\"], in Encyclopædia Iranica, online edition, 2012 Alexander the Great had laid-out the foundation of what is now Old Kandahar in the 4th century BC and gave it the Ancient Greek name Αλεξάνδρεια Aραχωσίας (). Many empires have long fought over the city due to its strategic location along the trade routes of southern, central and western Asia. Since the 1978 Marxist revolution, the city has been a magnet for groups such as Haqqani network, Quetta Shura, Hezbi Islami, al-Qaida and other terrorist groups. From late-1996 to 2001, it served as the de facto capital of the Taliban government until the Taliban were overthrown by US-led NATO forces during Operation Enduring Freedom in late-2001 and replaced by the government of President Hamid Karzai.\n\nName\n\nOne hypothesis of the name suggests that \"Kandahar\" has evolved from \"Iskandar\", the local dialect version of the name Alexander, after Alexander the Great who founded the city in 330 BC and named it Alexandria in Arachosia.John E. Hill, Through the Jade Gate to Rome: A Study of the Silk Routes during the Later Han Dynasty, 1st to 2nd centuries CE. BookSurge, Charleston, South Carolina, 2009. , pp. 517–518. This derivation, as that from Gondophares, was characterised as \"philologiquement impossible\" by P. Bernard, \"Un probleme de toponymie antique dans l'Asie Centrale: les noms anciens de Qandahar\", Studia Iranica, tome 3, 1974 and Afghanistan Quarterly, vol.33, no.1, June 1980/Spring 1359, pp.49–62, p59, n.10. A temple to the deified Alexander as well as an inscription in Greek and Aramaic by Emperor Ashoka, who lived a few decades later, have been discovered in Kandahar. The Sri Lankan Pali work the Mahavamsa (Chap. XXIXFull text of the Mahavamsa [http://lakdiva.org/mahavamsa/chapters.html Click chapter XXIX]) refers to the city as \"the Greek city of [http://lakdiva.org/mahavamsa/chap029.html Alasanda]\" when relating how its Indo-Greek King Menander I (165 BC – 135 BC), who practiced Greco-Buddhism, sent \"a Greek (yona) Buddhist head monk\" named Mahadharmaraksita (literally translated 'Great Teacher, Preserver of the Dharma') with 30,000 Buddhist monks to Sri Lanka for the dedication of the Great Stupa in Anuradhapura.\n\nIbn Batutta mentions Kandahar in the 14th century by describing it as a large and prosperous town three nights journey from Ghazni. It has been then mentioned extensively by Mughal Emperor Babur and others.\n\nAn alternative etymology derives the name of the city from Gandhara,[http://dsal.uchicago.edu/cgi-bin/philologic/getobject.pl?c.0:1:390.hobson Hobson Jobson Dictionary]; The Practical Sanskrit-English Dictionary, Vaman Shivram Apte, Motilal Banarsidass, Delhi, India, 1975, ; P. Bernard, \"Une probleme de toponymie antique dans l'Asie centrale: les noms anciens de Qandahar\", Studia Iranica, tome 3 (fasc. 2) 1974, 171–185.\n. the name of an ancient Buddhist kingdom located along the Kabul and Swat rivers of Afghanistan and Pakistan; Kandahar is not in the former territory of Gandhara.\n\nAn alternative story describes Khandahar as Gandhara in Mahabharata ruled by Suvala and later by Shakuni. The princess of Hastinapur, Gandhari was born in Gandhara.\n\nA folk etymology offered is that the word \"kand\" or \"qand\" in Persian and Pashto (the local languages) means \"candy\". The name \"Candahar\" or \"Kandahar\" in this form probably translates to candy area. This probably has to do with the location being fertile and historically known for producing fine grapes, pomegranates, apricots, melons and other sweet fruits.\n\nErnst Herzfeld claimed Kandahar perpetuated the name of the Indo-Parthian king Gondophares, who re-founded the city under the name Gundopharron.Ernst Herzfeld, Archaeological History of Iran, London,  Oxford University Press for the British Academy, 1935, p.63; Ernst Herzfeld, The Persian Empire: Studies in Geography and Ethnography of the Ancient Near East, Wiesbaden, Steiner, 1968, p.335.\n\nHistory\n\nPrehistory\n\nExcavations of prehistoric sites by archaeologists such as Louis Dupree and others suggest that the region around Kandahar is one of the oldest human settlements known so far.\n\nBritish excavations in the 1970s discovered that Kandahar existed as a large fortified city during the early 1st millennium BCE; while this earliest period at Kandahar has not been precisely dated via radiocarbon, ceramic comparisons with the latest period at the major Bronze Age city of Mundigak have suggested an approximate time-frame of 1000 to 750 BCE.F.R. Allchin (ed.), [https://books.google.com/books?idQ5kI02_zW70C&pg\nPA127 The Archaeology of Early Historic South Asia: The Emergence of Cities and States] (Cambridge University Press, 1995), pp.127-130 This fortified city became an important outpost of the Achaemenid Empire in the 6th to 4th centuries BCE, and formed part of the province of Arachosia.Gérard Fussman, [http://www.iranicaonline.org/articles/kandahar-pre-islamic-monuments-and-remains \"KANDAHAR ii. Pre-Islamic Monuments and Remains\"], in Encyclopædia Iranica, online edition, 2012\n\nAlexandria\n\nThe now \"Old Kandahar\" was founded in 330 BC by Alexander the Great, near the site of the ancient city of Mundigak (established around 3000 BC). Mundigak served as the provincial capital of Arachosia and was ruled by the Medes followed by the Achaemenids until the arrival of the Greeks from Macedonia. The main inhabitants of Arachosia were the Pactyans,Map of the Median Empire from the University of Texas in Austin, showing Pactyans in what is now Kandahar, Afghanistan ... [http://www.lib.utexas.edu/maps/historical/shepherd/oriental_empire.jpg Link] an ancient Iranian tribe, who may be among the ancestors of today's Pashtuns. Kandahar was named Alexandria, a name given to cities that Alexander founded during his conquests.\n\nKandahar has been a frequent target for conquest because of its strategic location in Southern Asia, controlling the main trade route linking the Indian subcontinent with the Middle East and Central Asia.Mentioned in Bopearachchi, \"Monnaies Greco-Bactriennes et Indo-Grecques\", p52. Original text in paragraph 19 of [http://www.parthia.com/parthian_stations.htm#PARTHIAN_STATIONS Parthian stations] The territory became part of the Seleucid Empire after the death of Alexander. It is mentioned by Strabo that a treaty of friendship was established eventually between the Greeks and the Mauryans (Indians). The city eventually became part of the Greco-Bactrian Kingdom (250 BC-125 BC), and continued that way for two hundred years under the later Indo-Greek Kingdom (180 BC – 10 CE). King Menander I (165 BC – 135 BC) of the Indo-Greek Kingdom practiced Greco-Buddhism and is recorded by the Mahavamsa (Chap. XXIX) to have sent \"a Greek (\"Yona\") Buddhist head monk\" named Mahadharmaraksita (literally translated as 'Great Teacher/Preserver of the Dharma') with 30,000 Buddhist monks from \"the Greek city of Alasandra\" (possibly Alexandria in Arachosia, as Kandhar was known under the Greeks) to Sri Lanka for the dedication of Great Stupa Buddhist temple in Anuradhapura. (See also Milinda Panha.)\n\nWhile the Diadochi were warring amongst themselves, the Mauryans were developing in the northern part of the Indian subcontinent. The founder of the empire, Chandragupta Maurya, confronted a Macedonian invasion force led by Seleucus I in 305 BC and following a brief conflict, an agreement was reached as Seleucus ceded Gandhara and Arachosia and areas south of Bagram to the Mauryans. During the 120 years of the Mauryans in southern Afghanistan, Buddhism was introduced and eventually become a major religion alongside Zoroastrianism and local pagan beliefs. The ancient Grand Trunk Road was built linking what is now Kabul to various cities in the Punjab and the Gangetic Plain. Commerce, art, and architecture (seen especially in the construction of stupas) developed during this period. It reached its high point under the Mauryan Emperor Ashoka whose edicts, roads, and rest stops were found throughout the subcontinent. Although the vast majority of them throughout the subcontinent were written in Prakrit, Afghanistan is notable for the inclusion of 2 Greek and Aramaic ones alongside the court language of the Mauryans.\n\nInscriptions made by Emperor Ashoka, a fragment of Edict 13 in Greek, as well as a full Edict, written in both Greek and Aramaic has been discovered in Kandahar. It is said to be written in excellent Classical Greek, using sophisticated philosophical terms. In this Edict, Ashoka uses the word Eusebeia (\"Piety\") as the Greek translation for the ubiquitous \"Dharma\" of his other Edicts written in Prakrit: \n\nThe last ruler in the region was probably Subhagasena (Sophagasenus of Polybius), who, in all probability, belonged to the Ashvaka (q.v.) background.\n\nIslamization and Mongol invasion\n\nIn the 7th century AD, Arab armies conquered the region with the new religion of Islam but were unable to succeed in fully converting the population. In AD 870, Yaqub ibn Layth Saffari, a local ruler of the Saffarid dynasty, conquered Kandahar and the rest of the nearby regions in the name of Islam.\n\nIt is believed that the Zunbil dynasty, who were related to the Shahi dynasty of Kabul, were probably the rulers of the Kandahar region from the 7th century until the late 9th century AD.Excavations at Kandahar 1974 & 1975 (Society for South Asian Studies Monograph) by Anthony McNicoll. Kandahar was taken by Sultan Mahmud of Ghazni in the 11th century followed by the Ghurids of Ghor. The region was invaded in the 13th century by Genghis Khan and his Mongol armies, who caused destruction but did not settle. It became part of the lands of the Timurids from the 14th century to the 15th century, a dynasty founded by Timur (Tamerlane) that began rebuilding cities and towns. Kandahar was described by Ibn Batutta in 1333 as a large and prosperous town three nights journey from Ghazni. Pir Muhammad, a grandson of Tamerlane, held the seat of government in Kandahar from about 1383 until his death in 1407. Following his death, the city was ruled by other Timurid governors. Kandahar was entrusted to the Arghuns in the late 15th century, who eventually achieved independence from the Timurids. Guru Nanak, the founder of Sikhism, is believed to have visited the town (c. 1521 AD) during his important journey between Hindustan and Mecca in Arabia.\n\nTamerlane's descendant, Babur, the founder of the Mughal Empire, annexed Kandahar in the early 16th century. Babur's son, Humayun, lost it to the Shi'a Safavids of Persia, who made it part of their far easternmost territories. The Mughals regained the city in 1595 by diplomacy and resisted a Persian siege in 1605–1606, only to lose it to the Persian Safavids permanently during the 1649–53 Mughal–Safavid War. Kandahar was regarded as important to the Mughal Empire because it was one of the gateways to India, and Mughal control over Kandahar helped to prevent foreign intrusions.\n\nThe memory of the wars fought over Kandahar at this time is preserved in the epic poem Qandahār-nāma (\"The Campaign Against Qandahār\"), a major work of Saib Tabrizi which is a classic of Persian literature.\n\nModern history\n\nMirwais Hotak, chief of the Ghilji tribe, revolted in 1709 by killing Gurgin Khan, an ethnic Georgian subject and governor of the Shia Safavid Persians. After establishing the Hotak dynasty in Kandahar, Mirwais and his army successfully defeated subsequent expeditions by Kay Khusraw and Rustam Khán. Mirwais resisted attempts by the Persian government who were seeking to convert the Afghans from Sunni to the Shia sect of Islam. He died of a natural death in November 1715 and was succeeded by his brother Abdul Aziz, but after being suspected of giving Kandahar's sovereignty back to the Persians he was killed by his nephew Mahmud Hotak.\n\nIn 1722, Mahmud led an army of Afghans to the Safavid capital Isfahan and proclaimed himself King of Persia. The Hotak dynasty was eventually removed from power by a new Persian ruler, Nader Shah Afshar of Mashad in Khorasan. In 1738, Nader Shah invaded Afghanistan and destroyed the now Old Kandahar, which was held by Hussain Hotak and his Ghilji tribes. In the meantime, Nader Shah freed Ahmad Khan (later Ahmad Shah Durrani) and his brother Zulfikar who were held prisoners by the Hotak ruler. Before leaving southern Afghanistan for Delhi in India, Nader Shah laid out the foundation for a new town to be built next to the destroyed ancient city, naming it \"Naderabad\". His rule ended in June 1747 after being murdered by his Persian guards.The Afghans (2002) By Willem Vogelsang. Page 228.\n\nAhmad Shah Durrani, chief of the Durrani tribe, gained control of Kandahar and made it the capital of his new Afghan Empire in October 1747. Previously, Ahmad Shah served as a military commander of Nader Shah Afshar. His empire included present-day Afghanistan, Pakistan, the Khorasan and Kohistan provinces of Iran, along with Punjab in India. In October 1772, Ahmad Shah retired and died from a natural cause. A new city was laid out by Ahmad Shah and is dominated by his mausoleum, which is adjacent to the Mosque of the Cloak in the center of the city. By 1776, his eldest son Timur Shah had transferred Afghanistan's main capital from Kandahar to Kabul, where the Durrani legacy continued.\n\nIn September 1826, Syed Ahmad Shaheed's followers arrived to Kandahar in search of volunteers to help them wage jihad against the Sikh invaders to what is now Pakistan. Led by Ranjit Singh, the Sikhs had captured several of Afghanistan's territories in the east, including what is now Khyber Pakhtunkhwa and Kashmir. More than 400 local Kandahar warriors assembled themselves for the jihad. Sayed Din Mohammad Kandharai was appointed as their leader.\n\nBritish-led Indian forces from neighboring British India invaded the city in 1839, during the First Anglo-Afghan War, but withdrew in 1842. The British and Indian forces returned in 1878 during the Second Anglo-Afghan War. They emerged from the city in July 1880 to confront the forces of Ayub Khan, but were defeated at the Battle of Maiwand. They were again forced to withdraw a few years later, despite winning the Battle of Kandahar.\n\nKandahar remained peaceful for the next 100 years, except during 1929 when loyalists of Habibullah Kalakani (Bache Saqqaw) placed the fortified city on lock-down and began torturing its population. Nobody was allowed to enter or leave from within the city's tall defensive walls, and as a result of this many people suffered after running out of food supplies. This lasted until October 1929 when Nadir Khan and his Afghan army came to eliminate Kalakani, known as the Tajik bandit from the village of Kalakan in northern Kabul Province.\n\nDuring Zahir Shah's rule, the city slowly began expanding by adding modern style streets and housing schemes. In the 1960s, during the rivalry between the United States and the Soviet Union, Kandahar International Airport was built by the U.S. Army Corps of Engineers next to the city. The U.S. also completed several other major projects in Kandahar and in other parts of southern Afghanistan. In the meantime, Soviet engineers were busy building major infrastructures in other parts of the country, such as Bagram Airfield and Kabul International Airport.\n\nDuring the 1980s Soviet-Afghan War, Kandahar witnessed heavy fighting as it became a center of resistance as the mujahideen forces waged a strong guerrilla warfare against the Soviet-backed government, who tightly held on control of the city. Government and Soviet troops surrounded the city and subjected it to heavy air bombardment in which many civilians lost lives. In January 1982 indiscriminate shelling and bombing by the Soviets killed hundreds.http://www.heritage.org/node/22652/print-displayhttps://www.nytimes.com/1982/03/08/world/soviet-reprisals-on-afghans-called-fierce.html 300 civilians were killed during Soviet bombings in July 1984.https://www.upi.com/Archives/1984/07/24/Soviet-forces-bombed-the-city-of-Kandahar-in-southern/5417459489600/ Kandahar International Airport was used by the Soviet Army during their ten-year troop placement in the country. The city also became a battle ground for the US and Pakistani-backed  against the pro-Communist government of Afghanistan. After the Soviet withdrawal and the collapse of Najibullah's government in 1992, Kandahar fell to local mujahideen commander, Gul Agha Sherzai.\n\nIn August 1994 the Taliban movement captured Kandahar and turned the city to its capital. The Taliban introduced a strict form of sharia law, banning formal education for boys and girls, including watching TV, films, music, and playing sports. In December 1999, a hijacked Indian Airlines Flight 814 plane by Pakistani militants loyal to Harkat-ul-Mujahideen landed at Kandahar International Airport and kept the passengers hostage as part of a demand to release 3 Pakistani militants from prison in India.\n\n21st century\n\nIn October 2001, as part of Operation Enduring Freedom, the United States Navy began hitting targets inside the city by precision-guided cruise missiles that were fired from the Persian Gulf. These targets were the airport and buildings that were occupied by the Taliban, including Arab families who had arrived several years earlier and were residing in the area.BBC News, [http://news.bbc.co.uk/2/hi/south_asia/7193579.stm Kandahar's cemetery of 'miracles'] About a month later, the Taliban began surrendering in mass numbers to a private militia that had been formed by Gul Agha Sherzai and Hamid Karzai. Kandahar once again fell into the hands of Sherzai, who had control over the area before the rise of the Taliban. He was transferred in 2003 and replaced by Yousef Pashtun until Asadullah Khalid took the post in 2005. The current Governor of the province is Toryalai Wesa. He was appointed by President Hamid Karzai in December 2008 after Rahmatullah Raufi's four-month rule.\n\nAs of 2002, Kandahar International Airport is used by members of the United States armed forces and NATO's International Security Assistance Force (ISAF). NATO began training the newly formed Afghan National Police and are now given the security responsibility of the city. The military of Afghanistan, backed by NATO forces, has gradually expanded its authority and presence throughout most of the country. The 205th Corps of the Afghan National Army is based at Kandahar and provides military assistance to the south of the country. The Canadian Forces maintain their military command headquarters at Kandahar, heading the Regional Command South of the NATO led International Security Assistance Force in Kandahar Province. The Taliban also have supporters inside the city reporting on events.BBC News, [http://news.bbc.co.uk/2/hi/south_asia/8203830.stm Kandahar dreamers test Taliban edicts]\n\nNATO forces expanded the Afghan police force for the prevention of a Taliban comeback in Kandahar, the militants' \"spiritual birthplace\" and a strategic key to ward off the Taliban insurgency, as a part of a larger effort that also aimed to deliver services such as electricity and clean drinking water that the Taliban could not provide – encouraging support for the government in a city that was once the Taliban's headquarters. The most significant battle between NATO troops and the Taliban lasted throughout the summer of 2006, culminating in Operation Medusa. The Taliban failed to defeat the Western troops in open warfare, which marked a turn in their tactics towards IED emplacement. In June 2008, it was reported that over 1,000 inmates had escaped from Sarposa prison. In Spring 2010, the province and the city of Kandahar became a target of American operations following Operation Moshtarak in the neighboring Helmand province. In March 2010, U.S. and NATO commanders released details of plans for the biggest offensive of the war against the Taliban insurgency.\n\nIn May 2010 Kandahar International Airport became subject of a combined rocket and ground attack by insurgents, following similar attacks on Kabul and Bagram in the preceding weeks. Although this attack did not lead to many casualties on the side of NATO forces, it did show that the militants are still capable of launching multiple, coordinated operations in Afghanistan. In June 2010, a shura was held by Afghan President Hamid Karzai with tribal and religious leaders of the Kandahar region. The meeting highlighted the need for support of NATO-led forces in order to stabilize parts of the province.\n\nBy 2011, Kandahar became known as the assassination city of Afghanistan after witnessing many target killings. In July Ahmed Wali Karzai, brother of President Hamid Karzai, was shot by his longtime head of security. Soon after the Quetta Shura of the Taliban claimed responsibility. The next day an Islamic cleric (mulla) of the famous Red Mosque in the Shahr-e Naw area of the city and a number of other people were killed by a Taliban suicide bomber who had hidden explosives inside his turban. On 27 July 2011, the mayor of the city, Ghulam Haider Hamidi, was assassinated by another Taliban militant who had hidden explosives in his turban. Two deputy mayors had been killed in 2010, while many tribal elders and Islamic clerics have also been assassinated in the last several years.\n\nPakistan's Inter-Services Intelligence (ISI) spy network is often blamed as the masterminds behind the Taliban-led insurgency. The Afghan government alleges that the ISI is using the insurgents in the name of Islamic jihad to counter the growing influence of its rival India in Afghanistan and the Afghan claim regarding the disputed Durand Line border.[http://www.pajhwok.com/en/2011/10/05/pakistan-twin-brother-talks-go-karzai Pakistan a twin brother, talks to go on: Karzai]. Pajhwok Afghan News. Sujoy Dhar. 5 October 2011. The overwhelming majority of the victims in the attacks are ordinary Afghan civilians.[http://www.pajhwok.com/en/2011/10/10/challenges-remain-despite-reduced-rebel-attacks-isaf Challenges remain despite reduced rebel attacks: ISAF]. Pajhwok Afghan News. 10 October 2011. On 6 June 2012, at least 21 civilians were killed and 50 others injured when two Taliban suicide bombers on motorcycles blew themselves up in a market area near Kandahar International Airport. Referring to them as the \"agents of Punjab\", ANA provincial police chief, Brig. Gen. Abdul Razaq stated that the Taliban \"have once again spilled the blood of innocent civilians.\"\n\nGeography\n\nThe Arghandab River runs along the west of Kandahar. The city has 15 districts and a total land area of 27,337 hectares. The total number of dwellings in Kandahar is 61,902.\n\nLand Use\n\nKandahar is the Regional Hub in southern Afghanistan, close to the border with Pakistan. Non-built up land use accounts for 59% of the total land area. Within the built-up area, vacant plots occupy a slightly higher percentage of land (36%) than residential land (34%). There is a significant commercial cluster along the road to Pakistan in District 5. India, Iran and Pakistan operate their consulate here for trade, military and political links.\n\nClimate\n\nKandahar has a semi-arid climate (Köppen BWh),[http://www.artofwar.net.ru/profiles/andreev_pavel_v/view_book/kandagrad] (in Russian) characterised by little precipitation and high variation between summer and winter temperatures. Summers start in mid-May, last until late-September, and are extremely dry. Temperatures peak in July with a 24-hour daily average of around . They are followed by dry autumns from early-October to late-November, with days still averaging in the 20s °C (above 68 °F) into November, though nights are sharply cooler. Winter begins in December and sees most of its precipitation in the form of rain. Temperatures average  in January, although lows can drop well below freezing. They end in early-March and are followed by a pleasant spring till late-April with temperatures generally in the upper 10s °C to lower 30s °C (65–88 °F) range. Sunny weather dominates year-round, especially in summer, when rainfall is extremely rare. The annual mean temperature is .\n\nTransport\n\nKandahar International Airport serves as southern Afghanistan's main airport for domestic and international flights. It is also used as a major military base as well as shipping and receiving of supplies for the NATO armies. The entire area in and around the airport is heavily guarded but a section is designated for civilian passengers. Most international flights are with Dubai, Germany, Turkey, Saudi Arabia, and Pakistan.\n\nPakistan plans to build a railroad track from the Pakistani town of Chaman to Kandahar which will connect Afghan Railways with Pakistan Railways. The feasibility study was completed in 2006 but  no construction work had begun.Kandahar-Quetta bus service soon\nBy Bashir Ahmad Naadim Jul 20, 2012 – 17:17, http://www.pajhwok.com/en/2012/07/20/kandahar-quetta-bus-service-soon\n\nKandahar is connected to Kabul by the Kabul-Kandahar Highway and to Herat by the Kandahar-Herat Highway. There is a bus station located at the start of the Kabul-Kandahar Highway, where a number of privately owned older-model Mercedes-Benz coach buses are available to take passengers to most major cities of the country. Kandahar is also connected by road to Quetta in neighboring Pakistan. Due to the ongoing war the route to Kabul has become increasingly dangerous as insurgent attacks on convoys and destruction of bridges make it an unreliable link between the two cities.\n\nCommuters of the city use the public bus system (Milli Bus), and taxicabs and rickshaws are common. Private vehicle use is increasing, partially due to road and highway improvements. Large dealerships are importing cars from Dubai, UAE.\n\nEducation\n\nBefore the 1978 coup in Kabul, majority of the city's population were enrolled in schools. Nearly all of the elite class of the city fled to neighboring Pakistan during the early 1980s, and from there they began immigrating to North America, the European Union, Australia and other parts of the world.\n\nThe two oldest known schools are Ahmad Shah Baba High School and Zarghona Ana High School. There are a number of new schools that opened in the last decade, with more being built in the future as the city's population grows with the large returning Afghans from neighboring countries. Afghan Turk High Schools is one of the top private schools in the city. The main university is Kandahar University. A number of training centers have also opened in the last decade.\n\nCommunications\n\nTelecommunication services in the city are provided by Afghan Wireless, Roshan, Etisalat, MTN Group and Afghan Telecom. In November 2006, the Afghan Ministry of Communications signed a $64.5 million agreement with ZTE for the establishment of a countrywide fiber optical cable network. This was intended to improve telephone, internet, television and radio broadcast services not just in Kandahar but throughout the country.\n\nBesides foreign channels, Afghanistan's local television channels include:\n* Ariana TV\n* Ariana Afghanistan TV\n* Lamar TV\n* Shamshad TV\n* Tolo TV\n* Hewad TV\n\nPlaces of interest\n\nThe tomb of Ahmad Shah Durrani is located in the city center, which also houses Durrani's brass helmet and other personal items. In front of Durrani's mausoleum is the Shrine of the Cloak, containing one of the most valued relics in the Islamic world, which was given by the Emir of Bokhara (Murad Beg) to Ahmad Shah Durrani. The Sacred Cloak is kept locked away, taken out only at times of great crisis. Mullah Omar took it out in November 1996 and displayed it to a crowd of ulema of religious scholars to have himself declared Amir al-Mu'minin (Commander of the Faithful). Prior to that it was taken out when the city was struck by a cholera epidemic in the 1930s.Lamb, Christina (2002). [https://books.google.com/books?idu5joY3VMX-gC&printsec\nfrontcover&sourcegbs_ge_summary_r&cad\n0#vonepage&q&f\nfalse The Sewing Circles of Herat: A Personal Voyage Through Afghanistan]. Harper Collins. First Perennial edition (2004), p. 38 and n. .\n\nThe village of Sher Surkh is located southeast of the city, in the suburbs of the old city of Nadirabad. Kandahar Museum is located at the western end of the third block of buildings lining the main road east of Eidgah Durwaza (gate). It has many paintings by the now famous Ghiyassuddin, painted while he was a young teacher in Kandahar. He is acknowledged among Afghanistan's leading artists.\n\nJust to the north of the city, off its northeast corner at the end of buria (matting) bazaar, there is a shrine dedicated to a saint who lived in Kandahar more than 300 years ago. The grave of Hazratji Baba, 23 ft long to signify his greatness, but otherwise covered solely by rock chips, is undecorated save for tall pennants at its head. A monument to Islamic martyrs stands in the center of Kandahar's main square, called Da Shahidanu Chawk, which was built in the 1940s.\n\nThe Chilzina is a rock-cut chamber above the plain at the end of the rugged chain of mountains forming the western defence of Kandahar's Old City. This is here that Ashoka's Kandahar Bilingual Rock Inscription was found. Forty steps, about, lead to the chamber, which is guarded by two chained lions, defaced, and inscribed with an account of Moghul conquest. The rugged cliffs from which the Chilzina was hewn form the natural western bastion of the Old City of Kandahar, which was destroyed in 1738 by Nadir Shah Afshar of Persia.\n\nA short distance from Chilzina, going west on the main highway, a bright blue dome appears on the right. This is the mausoleum of Mirwais Hotak, the Ghiljai chieftain who declared Kandahar's independence from the Persians in 1709. The shrine of Baba Wali Kandhari (Baba Sahib), its terraces shaded by pomegranate groves beside the Arghandab River, is also very popular for picnics and afternoon outings. He was Muslim pir who had a strange encounter with Guru Nanak at Hasan Abdal in what is now Attock District of Pakistan. The shrine of Baba Wali is important to Muslims and Sikhs. Close to Baba Wali's shrine is a military base established by the United States armed forces in about 2007.\n\nDevelopment and modernization\n\nDecades of war left Kandahar and the rest of the country destroyed and depopulated, but in recent years billions of dollars began pouring in for construction purposes and millions of expats have returned to Afghanistan. New neighborhoods have been established around the city, and a number of modern-style buildings have been constructed.\n\nSome residents of the city have access to clean drinking water and electricity, and the government is working to extend these services to every home.South Asian News Agency, [http://www.sananews.com.pk/news.php?netwire8219&cwire\n8219 30 Power Generators to Be Installed in Kandahar] The city relies on electricity from the Kajaki hydroelectricity plant in neighboring Helmand, which is being upgraded or expanded. About 20 mi north of the city is the Dahla Dam, the second largest dam in Afghanistan.\n\nThe Aino Mina is a new housing project for up to two million people on the northern edge of the city. Originally called the Kandahar Valley and started by Mahmud Karzai, it was announced that the project would build up to 20,000 single-family homes and associated infrastructure such as roads, water and sewer systems, and community buildings, including schools.U.S. Department of State, [http://www.usinfo.state.gov/sa/Archive/2004/Jan/29-5307.html U.S. Government Agency Grants $3 Million to Build Afghan Homes] \n\nIt recently won 2 awards, the Residential Project and Sustainable Project of the Year at the Middle East Architect Awards. Many of the high-ranking government employees and civil servants as well as wealthy businessmen live in this area, which is a more secured community in Kandahar. Work on the next $100 million scheme was initiated in 2011.\n\nAlso, construction of Hamidi Township in the Morchi Kotal area of the city began in August 2011. It is named after Ghulam Haider Hamidi, the mayor of Kandahar who was assassinated by militants in late July 2011.[http://www.afghanpanorama.com/?p=457 Kandahar mayor killed by suicide bomber with explosives in turban] Situated along the Kandahar-Uruzgan Highway in the northeast of the city, the new township will have 2,000 residential and commercial plots. Including new roads, schools, commercial markets, clinics, canals and other facilities.\n\nAbout 10 km east of Kandahar, a huge industrial park is under construction with modern facilities. The park will have professional management for the daily maintenance of public roads, internal streets, common areas, parking areas, 24 hours perimeter security, access control for vehicles and persons.Afghanistan Investment Support Agency, [http://www.aisa.org.af/ipda/kandahar.html Afghanistan Industrial Parks Development Authority] \n\nAirports\n\n* Kandahar International Airport\n\nNeighborhoods\n\n* Aino Meyna (under development since 2003)\n* Hamidi Meyna (under development since 2011)\n* Share Naw (meaning New City)\n* Dand\n* Karz\n* Mirwais Meyna\n* Daman\n* Sarpuza\n* Malajat\n* Old Kandahar (Zorr Shar)\n* Arghandab Valley\n\nCultural sites and parks\n\n* Kandahar Park [https://www.flickr.com/photos/24037728@N08/2408896394/in/photostream]\n* Baba Saab\n* Kokaran Park\n* Baghi Pul Park [https://www.panoramio.com/photo/25270245]\n* Chilzina View (Moghul Emperor Babur's inscription site)\n* Kandahar Museum\n\nStadium\n\n* Kandahar International Cricket Stadium (under construction [https://web.archive.org/web/20140529103150/http://www.pajhwok.com/en/2010/10/27/20-acres-land-donated-cricket-stadium-kandahar])\n* Kandahar Stadium [https://www.flickr.com/photos/24037728@N08/2408005625/in/photostream]\n\nMosques and Shrines \n\n* Friday Mosque of Kandahar\n* Shrine of the Cloak\n* Mosque of the Hair of the Prophet\n* Mosque at Kandahar University (Eidgah Jaami Jumat)\n* Red Mosque\n\nMausoleums \n\n* Mausoleum of Ahmad Shah Durrani\n* Mausoleum of Mirwais Hotak\n* Mausoleum of Baba Wali\n\nShopping\n\n* Al-Jadeed indoor shopping center [https://www.flickr.com/photos/24037728@N08/2407958627/in/photostream]\n* Herat Bazaar\n* Kabul Bazaar\n* Shah Bazaar\n* Shkar Pur Bazaar\n* Piaroz Super store \n* Kandahr Super Store\n* Samimi Super Store\n\nRestaurants\n\n* Lamar Restaurant\n* Mumtaz Restaurant\n* Kandahar Coffee Shop\n\nHotels and guest houses\n\n* Continental Guest House\n* Armani Pashtun Kasi Hotel Pick off and drop services from the airport 0093 705601977\n* Maulvi nasar hotel kabul darwaza.\n\nHospitals\n\n* Afghan National Army Regional Hospital\n* Mirwais Hospital\n* Sial Curative Hospital\n* Bilal Hohpital\n* Momand Hospital\n* Sydal Hospital\n\nBanks\n\n* AIB Bank\n* Kabul Bank\n* Azizi Bank\n\nDemography and culture\n\nThe population of Kandahar numbers approximately 491,500 . The Pashtuns make up the overwhelming majority population of the city and province but exact figures are not available. In a 2003 estimate by the National Geographic, Pashtuns were put at ca. 70%, Tajiks 20%, Baloch 2%, and Uzbeks 2%.\n\nPashto serves as the main language in the city and the region. Persian is also understood by a fair number of the city dwellers, especially those serving in the government and the educated Afghans. Both are the official languages of Afghanistan. A 2006 compendium of provincial data prepared by the Afghan Ministry of Rural Rehabilitation and Development and United Nations Assistance Mission in Afghanistan (UNAMA) states:\n\nThe Pashtun culture is dominant in this region.\n\nNotable people from Kandahar \n\n*Nur Jahan – Empress of the Mughal Empire\n*Mirwais Hotak – founder of the Hotak dynasty\n*Abdul Aziz Hotak – ruler of the Hotak dynasty\n*Mahmud Hotak – ruler of the Hotak dynasty and Shah of Persia\n*Ashraf Hotak – Shah of Persia\n*Hussain Hotak – ruler of the Hotak dynasty\n*Ahmad Shah Durrani – founding father of Afghanistan who is buried in the city\n*Payandah Khan, earliest tribal chief of the Barakzai dynasty\n*Dost Mohammad Khan – Emir of Afghanistan and son of Payandah Khan\n*Sher Ali Khan – Emir of Afghanistan and son of Dost Mohammad Khan\n*Abdur Rahman Khan – Emir of Afghanistan and son of Dost Mohammad Khan\n*Ghulam Muhammad Tarzi – leader of Tarzi family who played an important part in Afghan history during the late 19th century onward\n*Abdul Rehman Khan, father of Bollywood actor Kader Khan\n*Mohammed Zahir Shah – the last king of Afghanistan\n*Mohammed Daoud Khan founder of the republic of Afghanistan\n*Ubaidullah Jan – Pashto music king of southern Afghanistan\n*Naghma – Afghan singer\n*Nashenas – Afghan musician\n*Abdul Hai Habibi – scholar, former professor at Kabul University and author of many books\n*The Karzais – the family of Afghan President Hamid Karzai\n*Gul Agha Sherzai – served as the governor of Kandahar province followed by as governors of Nangarhar province\n*Said Tayeb Jawad – former Afghanistan Ambassador to the United States\n*Yousef Pashtun – Afghan politician\n* Mula Naqib Akhund - Alokozai tribe leader\n* Khan Mohammad Mujahid - Alokozai tribe leader",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kandahar" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17260" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kandahār or Qandahār (; ; known in older literature as Candahar) is the second-largest city in Afghanistan, with a population of about 557,118. Formerly called Alexandria Arachosia, the city is named after Alexander the Great, who founded it in 329 BC around an ancient Arachosian town. Kandahar is located in the south of the country on the Arghandab River, at an elevation of 1010 m. It is the capital of Kandahar Province, and also the center of the larger cultural region called Loy Kandahar. In 1709, Mirwais Hotak made the region an independent kingdom and turned Kandahar into the capital of the Hotak dynasty. In 1747, Ahmad Shah Durrani, founder of the Durrani dynasty, made Kandahar the capital of the Afghan Empire.\n\nKandahar is one of the most culturally significant cities of the Pashtuns and has been their traditional seat of power for more than 300 years. It is a major trading center for sheep, wool, cotton, silk, felt, food grains, fresh and dried fruit, and tobacco. The region produces fine fruits, especially pomegranates and grapes, and the city has plants for canning, drying, and packing fruit, and is a major source of marijuana and hashish en route to Tajikistan.\n\nThe region around Kandahar is one of the oldest known human settlements. A major fortified city existed at the site of Kandahar, probably as early as  1000-750 BCE,F.R. Allchin (ed.), [https://books.google.com/books?idQ5kI02_zW70C&pg\nPA127 The Archaeology of Early Historic South Asia: The Emergence of Cities and States] (Cambridge University Press, 1995), pp.127-130 and it became an important outpost of the Achaemenid (Persian) Empire in the 6th century BCE.Gérard Fussman, [http://www.iranicaonline.org/articles/kandahar-pre-islamic-monuments-and-remains \"KANDAHAR ii. Pre-Islamic Monuments and Remains\"], in Encyclopædia Iranica, online edition, 2012 Alexander the Great had laid-out the foundation of what is now Old Kandahar in the 4th century BC and gave it the Ancient Greek name Αλεξάνδρεια Aραχωσίας (). Many empires have long fought over the city due to its strategic location along the trade routes of southern, central and western Asia. Since the 1978 Marxist revolution, the city has been a magnet for groups such as Haqqani network, Quetta Shura, Hezbi Islami, al-Qaida and other terrorist groups. From late-1996 to 2001, it served as the de facto capital of the Taliban government until the Taliban were overthrown by US-led NATO forces during Operation Enduring Freedom in late-2001 and replaced by the government of President Hamid Karzai.\n\nName\n\nOne hypothesis of the name suggests that \"Kandahar\" has evolved from \"Iskandar\", the local dialect version of the name Alexander, after Alexander the Great who founded the city in 330 BC and named it Alexandria in Arachosia.John E. Hill, Through the Jade Gate to Rome: A Study of the Silk Routes during the Later Han Dynasty, 1st to 2nd centuries CE. BookSurge, Charleston, South Carolina, 2009. , pp. 517–518. This derivation, as that from Gondophares, was characterised as \"philologiquement impossible\" by P. Bernard, \"Un probleme de toponymie antique dans l'Asie Centrale: les noms anciens de Qandahar\", Studia Iranica, tome 3, 1974 and Afghanistan Quarterly, vol.33, no.1, June 1980/Spring 1359, pp.49–62, p59, n.10. A temple to the deified Alexander as well as an inscription in Greek and Aramaic by Emperor Ashoka, who lived a few decades later, have been discovered in Kandahar. The Sri Lankan Pali work the Mahavamsa (Chap. XXIXFull text of the Mahavamsa [http://lakdiva.org/mahavamsa/chapters.html Click chapter XXIX]) refers to the city as \"the Greek city of [http://lakdiva.org/mahavamsa/chap029.html Alasanda]\" when relating how its Indo-Greek King Menander I (165 BC – 135 BC), who practiced Greco-Buddhism, sent \"a Greek (yona) Buddhist head monk\" named Mahadharmaraksita (literally translated 'Great Teacher, Preserver of the Dharma') with 30,000 Buddhist monks to Sri Lanka for the dedication of the Great Stupa in Anuradhapura.\n\nIbn Batutta mentions Kandahar in the 14th century by describing it as a large and prosperous town three nights journey from Ghazni. It has been then mentioned extensively by Mughal Emperor Babur and others.\n\nAn alternative etymology derives the name of the city from Gandhara,[http://dsal.uchicago.edu/cgi-bin/philologic/getobject.pl?c.0:1:390.hobson Hobson Jobson Dictionary]; The Practical Sanskrit-English Dictionary, Vaman Shivram Apte, Motilal Banarsidass, Delhi, India, 1975, ; P. Bernard, \"Une probleme de toponymie antique dans l'Asie centrale: les noms anciens de Qandahar\", Studia Iranica, tome 3 (fasc. 2) 1974, 171–185.\n. the name of an ancient Buddhist kingdom located along the Kabul and Swat rivers of Afghanistan and Pakistan; Kandahar is not in the former territory of Gandhara.\n\nAn alternative story describes Khandahar as Gandhara in Mahabharata ruled by Suvala and later by Shakuni. The princess of Hastinapur, Gandhari was born in Gandhara.\n\nA folk etymology offered is that the word \"kand\" or \"qand\" in Persian and Pashto (the local languages) means \"candy\". The name \"Candahar\" or \"Kandahar\" in this form probably translates to candy area. This probably has to do with the location being fertile and historically known for producing fine grapes, pomegranates, apricots, melons and other sweet fruits.\n\nErnst Herzfeld claimed Kandahar perpetuated the name of the Indo-Parthian king Gondophares, who re-founded the city under the name Gundopharron.Ernst Herzfeld, Archaeological History of Iran, London,  Oxford University Press for the British Academy, 1935, p.63; Ernst Herzfeld, The Persian Empire: Studies in Geography and Ethnography of the Ancient Near East, Wiesbaden, Steiner, 1968, p.335.\n\nHistory\n\nPrehistory\n\nExcavations of prehistoric sites by archaeologists such as Louis Dupree and others suggest that the region around Kandahar is one of the oldest human settlements known so far.\n\nBritish excavations in the 1970s discovered that Kandahar existed as a large fortified city during the early 1st millennium BCE; while this earliest period at Kandahar has not been precisely dated via radiocarbon, ceramic comparisons with the latest period at the major Bronze Age city of Mundigak have suggested an approximate time-frame of 1000 to 750 BCE.F.R. Allchin (ed.), [https://books.google.com/books?idQ5kI02_zW70C&pg\nPA127 The Archaeology of Early Historic South Asia: The Emergence of Cities and States] (Cambridge University Press, 1995), pp.127-130 This fortified city became an important outpost of the Achaemenid Empire in the 6th to 4th centuries BCE, and formed part of the province of Arachosia.Gérard Fussman, [http://www.iranicaonline.org/articles/kandahar-pre-islamic-monuments-and-remains \"KANDAHAR ii. Pre-Islamic Monuments and Remains\"], in Encyclopædia Iranica, online edition, 2012\n\nAlexandria\n\nThe now \"Old Kandahar\" was founded in 330 BC by Alexander the Great, near the site of the ancient city of Mundigak (established around 3000 BC). Mundigak served as the provincial capital of Arachosia and was ruled by the Medes followed by the Achaemenids until the arrival of the Greeks from Macedonia. The main inhabitants of Arachosia were the Pactyans,Map of the Median Empire from the University of Texas in Austin, showing Pactyans in what is now Kandahar, Afghanistan ... [http://www.lib.utexas.edu/maps/historical/shepherd/oriental_empire.jpg Link] an ancient Iranian tribe, who may be among the ancestors of today's Pashtuns. Kandahar was named Alexandria, a name given to cities that Alexander founded during his conquests.\n\nKandahar has been a frequent target for conquest because of its strategic location in Southern Asia, controlling the main trade route linking the Indian subcontinent with the Middle East and Central Asia.Mentioned in Bopearachchi, \"Monnaies Greco-Bactriennes et Indo-Grecques\", p52. Original text in paragraph 19 of [http://www.parthia.com/parthian_stations.htm#PARTHIAN_STATIONS Parthian stations] The territory became part of the Seleucid Empire after the death of Alexander. It is mentioned by Strabo that a treaty of friendship was established eventually between the Greeks and the Mauryans (Indians). The city eventually became part of the Greco-Bactrian Kingdom (250 BC-125 BC), and continued that way for two hundred years under the later Indo-Greek Kingdom (180 BC – 10 CE). King Menander I (165 BC – 135 BC) of the Indo-Greek Kingdom practiced Greco-Buddhism and is recorded by the Mahavamsa (Chap. XXIX) to have sent \"a Greek (\"Yona\") Buddhist head monk\" named Mahadharmaraksita (literally translated as 'Great Teacher/Preserver of the Dharma') with 30,000 Buddhist monks from \"the Greek city of Alasandra\" (possibly Alexandria in Arachosia, as Kandhar was known under the Greeks) to Sri Lanka for the dedication of Great Stupa Buddhist temple in Anuradhapura. (See also Milinda Panha.)\n\nWhile the Diadochi were warring amongst themselves, the Mauryans were developing in the northern part of the Indian subcontinent. The founder of the empire, Chandragupta Maurya, confronted a Macedonian invasion force led by Seleucus I in 305 BC and following a brief conflict, an agreement was reached as Seleucus ceded Gandhara and Arachosia and areas south of Bagram to the Mauryans. During the 120 years of the Mauryans in southern Afghanistan, Buddhism was introduced and eventually become a major religion alongside Zoroastrianism and local pagan beliefs. The ancient Grand Trunk Road was built linking what is now Kabul to various cities in the Punjab and the Gangetic Plain. Commerce, art, and architecture (seen especially in the construction of stupas) developed during this period. It reached its high point under the Mauryan Emperor Ashoka whose edicts, roads, and rest stops were found throughout the subcontinent. Although the vast majority of them throughout the subcontinent were written in Prakrit, Afghanistan is notable for the inclusion of 2 Greek and Aramaic ones alongside the court language of the Mauryans.\n\nInscriptions made by Emperor Ashoka, a fragment of Edict 13 in Greek, as well as a full Edict, written in both Greek and Aramaic has been discovered in Kandahar. It is said to be written in excellent Classical Greek, using sophisticated philosophical terms. In this Edict, Ashoka uses the word Eusebeia (\"Piety\") as the Greek translation for the ubiquitous \"Dharma\" of his other Edicts written in Prakrit: \n\nThe last ruler in the region was probably Subhagasena (Sophagasenus of Polybius), who, in all probability, belonged to the Ashvaka (q.v.) background.\n\nIslamization and Mongol invasion\n\nIn the 7th century AD, Arab armies conquered the region with the new religion of Islam but were unable to succeed in fully converting the population. In AD 870, Yaqub ibn Layth Saffari, a local ruler of the Saffarid dynasty, conquered Kandahar and the rest of the nearby regions in the name of Islam.\n\nIt is believed that the Zunbil dynasty, who were related to the Shahi dynasty of Kabul, were probably the rulers of the Kandahar region from the 7th century until the late 9th century AD.Excavations at Kandahar 1974 & 1975 (Society for South Asian Studies Monograph) by Anthony McNicoll. Kandahar was taken by Sultan Mahmud of Ghazni in the 11th century followed by the Ghurids of Ghor. The region was invaded in the 13th century by Genghis Khan and his Mongol armies, who caused destruction but did not settle. It became part of the lands of the Timurids from the 14th century to the 15th century, a dynasty founded by Timur (Tamerlane) that began rebuilding cities and towns. Kandahar was described by Ibn Batutta in 1333 as a large and prosperous town three nights journey from Ghazni. Pir Muhammad, a grandson of Tamerlane, held the seat of government in Kandahar from about 1383 until his death in 1407. Following his death, the city was ruled by other Timurid governors. Kandahar was entrusted to the Arghuns in the late 15th century, who eventually achieved independence from the Timurids. Guru Nanak, the founder of Sikhism, is believed to have visited the town (c. 1521 AD) during his important journey between Hindustan and Mecca in Arabia.\n\nTamerlane's descendant, Babur, the founder of the Mughal Empire, annexed Kandahar in the early 16th century. Babur's son, Humayun, lost it to the Shi'a Safavids of Persia, who made it part of their far easternmost territories. The Mughals regained the city in 1595 by diplomacy and resisted a Persian siege in 1605–1606, only to lose it to the Persian Safavids permanently during the 1649–53 Mughal–Safavid War. Kandahar was regarded as important to the Mughal Empire because it was one of the gateways to India, and Mughal control over Kandahar helped to prevent foreign intrusions.\n\nThe memory of the wars fought over Kandahar at this time is preserved in the epic poem Qandahār-nāma (\"The Campaign Against Qandahār\"), a major work of Saib Tabrizi which is a classic of Persian literature.\n\nModern history\n\nMirwais Hotak, chief of the Ghilji tribe, revolted in 1709 by killing Gurgin Khan, an ethnic Georgian subject and governor of the Shia Safavid Persians. After establishing the Hotak dynasty in Kandahar, Mirwais and his army successfully defeated subsequent expeditions by Kay Khusraw and Rustam Khán. Mirwais resisted attempts by the Persian government who were seeking to convert the Afghans from Sunni to the Shia sect of Islam. He died of a natural death in November 1715 and was succeeded by his brother Abdul Aziz, but after being suspected of giving Kandahar's sovereignty back to the Persians he was killed by his nephew Mahmud Hotak.\n\nIn 1722, Mahmud led an army of Afghans to the Safavid capital Isfahan and proclaimed himself King of Persia. The Hotak dynasty was eventually removed from power by a new Persian ruler, Nader Shah Afshar of Mashad in Khorasan. In 1738, Nader Shah invaded Afghanistan and destroyed the now Old Kandahar, which was held by Hussain Hotak and his Ghilji tribes. In the meantime, Nader Shah freed Ahmad Khan (later Ahmad Shah Durrani) and his brother Zulfikar who were held prisoners by the Hotak ruler. Before leaving southern Afghanistan for Delhi in India, Nader Shah laid out the foundation for a new town to be built next to the destroyed ancient city, naming it \"Naderabad\". His rule ended in June 1747 after being murdered by his Persian guards.The Afghans (2002) By Willem Vogelsang. Page 228.\n\nAhmad Shah Durrani, chief of the Durrani tribe, gained control of Kandahar and made it the capital of his new Afghan Empire in October 1747. Previously, Ahmad Shah served as a military commander of Nader Shah Afshar. His empire included present-day Afghanistan, Pakistan, the Khorasan and Kohistan provinces of Iran, along with Punjab in India. In October 1772, Ahmad Shah retired and died from a natural cause. A new city was laid out by Ahmad Shah and is dominated by his mausoleum, which is adjacent to the Mosque of the Cloak in the center of the city. By 1776, his eldest son Timur Shah had transferred Afghanistan's main capital from Kandahar to Kabul, where the Durrani legacy continued.\n\nIn September 1826, Syed Ahmad Shaheed's followers arrived to Kandahar in search of volunteers to help them wage jihad against the Sikh invaders to what is now Pakistan. Led by Ranjit Singh, the Sikhs had captured several of Afghanistan's territories in the east, including what is now Khyber Pakhtunkhwa and Kashmir. More than 400 local Kandahar warriors assembled themselves for the jihad. Sayed Din Mohammad Kandharai was appointed as their leader.\n\nBritish-led Indian forces from neighboring British India invaded the city in 1839, during the First Anglo-Afghan War, but withdrew in 1842. The British and Indian forces returned in 1878 during the Second Anglo-Afghan War. They emerged from the city in July 1880 to confront the forces of Ayub Khan, but were defeated at the Battle of Maiwand. They were again forced to withdraw a few years later, despite winning the Battle of Kandahar.\n\nKandahar remained peaceful for the next 100 years, except during 1929 when loyalists of Habibullah Kalakani (Bache Saqqaw) placed the fortified city on lock-down and began torturing its population. Nobody was allowed to enter or leave from within the city's tall defensive walls, and as a result of this many people suffered after running out of food supplies. This lasted until October 1929 when Nadir Khan and his Afghan army came to eliminate Kalakani, known as the Tajik bandit from the village of Kalakan in northern Kabul Province.\n\nDuring Zahir Shah's rule, the city slowly began expanding by adding modern style streets and housing schemes. In the 1960s, during the rivalry between the United States and the Soviet Union, Kandahar International Airport was built by the U.S. Army Corps of Engineers next to the city. The U.S. also completed several other major projects in Kandahar and in other parts of southern Afghanistan. In the meantime, Soviet engineers were busy building major infrastructures in other parts of the country, such as Bagram Airfield and Kabul International Airport.\n\nDuring the 1980s Soviet-Afghan War, Kandahar witnessed heavy fighting as it became a center of resistance as the mujahideen forces waged a strong guerrilla warfare against the Soviet-backed government, who tightly held on control of the city. Government and Soviet troops surrounded the city and subjected it to heavy air bombardment in which many civilians lost lives. In January 1982 indiscriminate shelling and bombing by the Soviets killed hundreds.http://www.heritage.org/node/22652/print-displayhttps://www.nytimes.com/1982/03/08/world/soviet-reprisals-on-afghans-called-fierce.html 300 civilians were killed during Soviet bombings in July 1984.https://www.upi.com/Archives/1984/07/24/Soviet-forces-bombed-the-city-of-Kandahar-in-southern/5417459489600/ Kandahar International Airport was used by the Soviet Army during their ten-year troop placement in the country. The city also became a battle ground for the US and Pakistani-backed  against the pro-Communist government of Afghanistan. After the Soviet withdrawal and the collapse of Najibullah's government in 1992, Kandahar fell to local mujahideen commander, Gul Agha Sherzai.\n\nIn August 1994 the Taliban movement captured Kandahar and turned the city to its capital. The Taliban introduced a strict form of sharia law, banning formal education for boys and girls, including watching TV, films, music, and playing sports. In December 1999, a hijacked Indian Airlines Flight 814 plane by Pakistani militants loyal to Harkat-ul-Mujahideen landed at Kandahar International Airport and kept the passengers hostage as part of a demand to release 3 Pakistani militants from prison in India.\n\n21st century\n\nIn October 2001, as part of Operation Enduring Freedom, the United States Navy began hitting targets inside the city by precision-guided cruise missiles that were fired from the Persian Gulf. These targets were the airport and buildings that were occupied by the Taliban, including Arab families who had arrived several years earlier and were residing in the area.BBC News, [http://news.bbc.co.uk/2/hi/south_asia/7193579.stm Kandahar's cemetery of 'miracles'] About a month later, the Taliban began surrendering in mass numbers to a private militia that had been formed by Gul Agha Sherzai and Hamid Karzai. Kandahar once again fell into the hands of Sherzai, who had control over the area before the rise of the Taliban. He was transferred in 2003 and replaced by Yousef Pashtun until Asadullah Khalid took the post in 2005. The current Governor of the province is Toryalai Wesa. He was appointed by President Hamid Karzai in December 2008 after Rahmatullah Raufi's four-month rule.\n\nAs of 2002, Kandahar International Airport is used by members of the United States armed forces and NATO's International Security Assistance Force (ISAF). NATO began training the newly formed Afghan National Police and are now given the security responsibility of the city. The military of Afghanistan, backed by NATO forces, has gradually expanded its authority and presence throughout most of the country. The 205th Corps of the Afghan National Army is based at Kandahar and provides military assistance to the south of the country. The Canadian Forces maintain their military command headquarters at Kandahar, heading the Regional Command South of the NATO led International Security Assistance Force in Kandahar Province. The Taliban also have supporters inside the city reporting on events.BBC News, [http://news.bbc.co.uk/2/hi/south_asia/8203830.stm Kandahar dreamers test Taliban edicts]\n\nNATO forces expanded the Afghan police force for the prevention of a Taliban comeback in Kandahar, the militants' \"spiritual birthplace\" and a strategic key to ward off the Taliban insurgency, as a part of a larger effort that also aimed to deliver services such as electricity and clean drinking water that the Taliban could not provide – encouraging support for the government in a city that was once the Taliban's headquarters. The most significant battle between NATO troops and the Taliban lasted throughout the summer of 2006, culminating in Operation Medusa. The Taliban failed to defeat the Western troops in open warfare, which marked a turn in their tactics towards IED emplacement. In June 2008, it was reported that over 1,000 inmates had escaped from Sarposa prison. In Spring 2010, the province and the city of Kandahar became a target of American operations following Operation Moshtarak in the neighboring Helmand province. In March 2010, U.S. and NATO commanders released details of plans for the biggest offensive of the war against the Taliban insurgency.\n\nIn May 2010 Kandahar International Airport became subject of a combined rocket and ground attack by insurgents, following similar attacks on Kabul and Bagram in the preceding weeks. Although this attack did not lead to many casualties on the side of NATO forces, it did show that the militants are still capable of launching multiple, coordinated operations in Afghanistan. In June 2010, a shura was held by Afghan President Hamid Karzai with tribal and religious leaders of the Kandahar region. The meeting highlighted the need for support of NATO-led forces in order to stabilize parts of the province.\n\nBy 2011, Kandahar became known as the assassination city of Afghanistan after witnessing many target killings. In July Ahmed Wali Karzai, brother of President Hamid Karzai, was shot by his longtime head of security. Soon after the Quetta Shura of the Taliban claimed responsibility. The next day an Islamic cleric (mulla) of the famous Red Mosque in the Shahr-e Naw area of the city and a number of other people were killed by a Taliban suicide bomber who had hidden explosives inside his turban. On 27 July 2011, the mayor of the city, Ghulam Haider Hamidi, was assassinated by another Taliban militant who had hidden explosives in his turban. Two deputy mayors had been killed in 2010, while many tribal elders and Islamic clerics have also been assassinated in the last several years.\n\nPakistan's Inter-Services Intelligence (ISI) spy network is often blamed as the masterminds behind the Taliban-led insurgency. The Afghan government alleges that the ISI is using the insurgents in the name of Islamic jihad to counter the growing influence of its rival India in Afghanistan and the Afghan claim regarding the disputed Durand Line border.[http://www.pajhwok.com/en/2011/10/05/pakistan-twin-brother-talks-go-karzai Pakistan a twin brother, talks to go on: Karzai]. Pajhwok Afghan News. Sujoy Dhar. 5 October 2011. The overwhelming majority of the victims in the attacks are ordinary Afghan civilians.[http://www.pajhwok.com/en/2011/10/10/challenges-remain-despite-reduced-rebel-attacks-isaf Challenges remain despite reduced rebel attacks: ISAF]. Pajhwok Afghan News. 10 October 2011. On 6 June 2012, at least 21 civilians were killed and 50 others injured when two Taliban suicide bombers on motorcycles blew themselves up in a market area near Kandahar International Airport. Referring to them as the \"agents of Punjab\", ANA provincial police chief, Brig. Gen. Abdul Razaq stated that the Taliban \"have once again spilled the blood of innocent civilians.\"\n\nGeography\n\nThe Arghandab River runs along the west of Kandahar. The city has 15 districts and a total land area of 27,337 hectares. The total number of dwellings in Kandahar is 61,902.\n\nLand Use\n\nKandahar is the Regional Hub in southern Afghanistan, close to the border with Pakistan. Non-built up land use accounts for 59% of the total land area. Within the built-up area, vacant plots occupy a slightly higher percentage of land (36%) than residential land (34%). There is a significant commercial cluster along the road to Pakistan in District 5. India, Iran and Pakistan operate their consulate here for trade, military and political links.\n\nClimate\n\nKandahar has a semi-arid climate (Köppen BWh),[http://www.artofwar.net.ru/profiles/andreev_pavel_v/view_book/kandagrad] (in Russian) characterised by little precipitation and high variation between summer and winter temperatures. Summers start in mid-May, last until late-September, and are extremely dry. Temperatures peak in July with a 24-hour daily average of around . They are followed by dry autumns from early-October to late-November, with days still averaging in the 20s °C (above 68 °F) into November, though nights are sharply cooler. Winter begins in December and sees most of its precipitation in the form of rain. Temperatures average  in January, although lows can drop well below freezing. They end in early-March and are followed by a pleasant spring till late-April with temperatures generally in the upper 10s °C to lower 30s °C (65–88 °F) range. Sunny weather dominates year-round, especially in summer, when rainfall is extremely rare. The annual mean temperature is .\n\nTransport\n\nKandahar International Airport serves as southern Afghanistan's main airport for domestic and international flights. It is also used as a major military base as well as shipping and receiving of supplies for the NATO armies. The entire area in and around the airport is heavily guarded but a section is designated for civilian passengers. Most international flights are with Dubai, Germany, Turkey, Saudi Arabia, and Pakistan.\n\nPakistan plans to build a railroad track from the Pakistani town of Chaman to Kandahar which will connect Afghan Railways with Pakistan Railways. The feasibility study was completed in 2006 but  no construction work had begun.Kandahar-Quetta bus service soon\nBy Bashir Ahmad Naadim Jul 20, 2012 – 17:17, http://www.pajhwok.com/en/2012/07/20/kandahar-quetta-bus-service-soon\n\nKandahar is connected to Kabul by the Kabul-Kandahar Highway and to Herat by the Kandahar-Herat Highway. There is a bus station located at the start of the Kabul-Kandahar Highway, where a number of privately owned older-model Mercedes-Benz coach buses are available to take passengers to most major cities of the country. Kandahar is also connected by road to Quetta in neighboring Pakistan. Due to the ongoing war the route to Kabul has become increasingly dangerous as insurgent attacks on convoys and destruction of bridges make it an unreliable link between the two cities.\n\nCommuters of the city use the public bus system (Milli Bus), and taxicabs and rickshaws are common. Private vehicle use is increasing, partially due to road and highway improvements. Large dealerships are importing cars from Dubai, UAE.\n\nEducation\n\nBefore the 1978 coup in Kabul, majority of the city's population were enrolled in schools. Nearly all of the elite class of the city fled to neighboring Pakistan during the early 1980s, and from there they began immigrating to North America, the European Union, Australia and other parts of the world.\n\nThe two oldest known schools are Ahmad Shah Baba High School and Zarghona Ana High School. There are a number of new schools that opened in the last decade, with more being built in the future as the city's population grows with the large returning Afghans from neighboring countries. Afghan Turk High Schools is one of the top private schools in the city. The main university is Kandahar University. A number of training centers have also opened in the last decade.\n\nCommunications\n\nTelecommunication services in the city are provided by Afghan Wireless, Roshan, Etisalat, MTN Group and Afghan Telecom. In November 2006, the Afghan Ministry of Communications signed a $64.5 million agreement with ZTE for the establishment of a countrywide fiber optical cable network. This was intended to improve telephone, internet, television and radio broadcast services not just in Kandahar but throughout the country.\n\nBesides foreign channels, Afghanistan's local television channels include:\n* Ariana TV\n* Ariana Afghanistan TV\n* Lamar TV\n* Shamshad TV\n* Tolo TV\n* Hewad TV\n\nPlaces of interest\n\nThe tomb of Ahmad Shah Durrani is located in the city center, which also houses Durrani's brass helmet and other personal items. In front of Durrani's mausoleum is the Shrine of the Cloak, containing one of the most valued relics in the Islamic world, which was given by the Emir of Bokhara (Murad Beg) to Ahmad Shah Durrani. The Sacred Cloak is kept locked away, taken out only at times of great crisis. Mullah Omar took it out in November 1996 and displayed it to a crowd of ulema of religious scholars to have himself declared Amir al-Mu'minin (Commander of the Faithful). Prior to that it was taken out when the city was struck by a cholera epidemic in the 1930s.Lamb, Christina (2002). [https://books.google.com/books?idu5joY3VMX-gC&printsec\nfrontcover&sourcegbs_ge_summary_r&cad\n0#vonepage&q&f\nfalse The Sewing Circles of Herat: A Personal Voyage Through Afghanistan]. Harper Collins. First Perennial edition (2004), p. 38 and n. .\n\nThe village of Sher Surkh is located southeast of the city, in the suburbs of the old city of Nadirabad. Kandahar Museum is located at the western end of the third block of buildings lining the main road east of Eidgah Durwaza (gate). It has many paintings by the now famous Ghiyassuddin, painted while he was a young teacher in Kandahar. He is acknowledged among Afghanistan's leading artists.\n\nJust to the north of the city, off its northeast corner at the end of buria (matting) bazaar, there is a shrine dedicated to a saint who lived in Kandahar more than 300 years ago. The grave of Hazratji Baba, 23 ft long to signify his greatness, but otherwise covered solely by rock chips, is undecorated save for tall pennants at its head. A monument to Islamic martyrs stands in the center of Kandahar's main square, called Da Shahidanu Chawk, which was built in the 1940s.\n\nThe Chilzina is a rock-cut chamber above the plain at the end of the rugged chain of mountains forming the western defence of Kandahar's Old City. This is here that Ashoka's Kandahar Bilingual Rock Inscription was found. Forty steps, about, lead to the chamber, which is guarded by two chained lions, defaced, and inscribed with an account of Moghul conquest. The rugged cliffs from which the Chilzina was hewn form the natural western bastion of the Old City of Kandahar, which was destroyed in 1738 by Nadir Shah Afshar of Persia.\n\nA short distance from Chilzina, going west on the main highway, a bright blue dome appears on the right. This is the mausoleum of Mirwais Hotak, the Ghiljai chieftain who declared Kandahar's independence from the Persians in 1709. The shrine of Baba Wali Kandhari (Baba Sahib), its terraces shaded by pomegranate groves beside the Arghandab River, is also very popular for picnics and afternoon outings. He was Muslim pir who had a strange encounter with Guru Nanak at Hasan Abdal in what is now Attock District of Pakistan. The shrine of Baba Wali is important to Muslims and Sikhs. Close to Baba Wali's shrine is a military base established by the United States armed forces in about 2007.\n\nDevelopment and modernization\n\nDecades of war left Kandahar and the rest of the country destroyed and depopulated, but in recent years billions of dollars began pouring in for construction purposes and millions of expats have returned to Afghanistan. New neighborhoods have been established around the city, and a number of modern-style buildings have been constructed.\n\nSome residents of the city have access to clean drinking water and electricity, and the government is working to extend these services to every home.South Asian News Agency, [http://www.sananews.com.pk/news.php?netwire8219&cwire\n8219 30 Power Generators to Be Installed in Kandahar] The city relies on electricity from the Kajaki hydroelectricity plant in neighboring Helmand, which is being upgraded or expanded. About 20 mi north of the city is the Dahla Dam, the second largest dam in Afghanistan.\n\nThe Aino Mina is a new housing project for up to two million people on the northern edge of the city. Originally called the Kandahar Valley and started by Mahmud Karzai, it was announced that the project would build up to 20,000 single-family homes and associated infrastructure such as roads, water and sewer systems, and community buildings, including schools.U.S. Department of State, [http://www.usinfo.state.gov/sa/Archive/2004/Jan/29-5307.html U.S. Government Agency Grants $3 Million to Build Afghan Homes] \n\nIt recently won 2 awards, the Residential Project and Sustainable Project of the Year at the Middle East Architect Awards. Many of the high-ranking government employees and civil servants as well as wealthy businessmen live in this area, which is a more secured community in Kandahar. Work on the next $100 million scheme was initiated in 2011.\n\nAlso, construction of Hamidi Township in the Morchi Kotal area of the city began in August 2011. It is named after Ghulam Haider Hamidi, the mayor of Kandahar who was assassinated by militants in late July 2011.[http://www.afghanpanorama.com/?p=457 Kandahar mayor killed by suicide bomber with explosives in turban] Situated along the Kandahar-Uruzgan Highway in the northeast of the city, the new township will have 2,000 residential and commercial plots. Including new roads, schools, commercial markets, clinics, canals and other facilities.\n\nAbout 10 km east of Kandahar, a huge industrial park is under construction with modern facilities. The park will have professional management for the daily maintenance of public roads, internal streets, common areas, parking areas, 24 hours perimeter security, access control for vehicles and persons.Afghanistan Investment Support Agency, [http://www.aisa.org.af/ipda/kandahar.html Afghanistan Industrial Parks Development Authority] \n\nAirports\n\n* Kandahar International Airport\n\nNeighborhoods\n\n* Aino Meyna (under development since 2003)\n* Hamidi Meyna (under development since 2011)\n* Share Naw (meaning New City)\n* Dand\n* Karz\n* Mirwais Meyna\n* Daman\n* Sarpuza\n* Malajat\n* Old Kandahar (Zorr Shar)\n* Arghandab Valley\n\nCultural sites and parks\n\n* Kandahar Park [https://www.flickr.com/photos/24037728@N08/2408896394/in/photostream]\n* Baba Saab\n* Kokaran Park\n* Baghi Pul Park [https://www.panoramio.com/photo/25270245]\n* Chilzina View (Moghul Emperor Babur's inscription site)\n* Kandahar Museum\n\nStadium\n\n* Kandahar International Cricket Stadium (under construction [https://web.archive.org/web/20140529103150/http://www.pajhwok.com/en/2010/10/27/20-acres-land-donated-cricket-stadium-kandahar])\n* Kandahar Stadium [https://www.flickr.com/photos/24037728@N08/2408005625/in/photostream]\n\nMosques and Shrines \n\n* Friday Mosque of Kandahar\n* Shrine of the Cloak\n* Mosque of the Hair of the Prophet\n* Mosque at Kandahar University (Eidgah Jaami Jumat)\n* Red Mosque\n\nMausoleums \n\n* Mausoleum of Ahmad Shah Durrani\n* Mausoleum of Mirwais Hotak\n* Mausoleum of Baba Wali\n\nShopping\n\n* Al-Jadeed indoor shopping center [https://www.flickr.com/photos/24037728@N08/2407958627/in/photostream]\n* Herat Bazaar\n* Kabul Bazaar\n* Shah Bazaar\n* Shkar Pur Bazaar\n* Piaroz Super store \n* Kandahr Super Store\n* Samimi Super Store\n\nRestaurants\n\n* Lamar Restaurant\n* Mumtaz Restaurant\n* Kandahar Coffee Shop\n\nHotels and guest houses\n\n* Continental Guest House\n* Armani Pashtun Kasi Hotel Pick off and drop services from the airport 0093 705601977\n* Maulvi nasar hotel kabul darwaza.\n\nHospitals\n\n* Afghan National Army Regional Hospital\n* Mirwais Hospital\n* Sial Curative Hospital\n* Bilal Hohpital\n* Momand Hospital\n* Sydal Hospital\n\nBanks\n\n* AIB Bank\n* Kabul Bank\n* Azizi Bank\n\nDemography and culture\n\nThe population of Kandahar numbers approximately 491,500 . The Pashtuns make up the overwhelming majority population of the city and province but exact figures are not available. In a 2003 estimate by the National Geographic, Pashtuns were put at ca. 70%, Tajiks 20%, Baloch 2%, and Uzbeks 2%.\n\nPashto serves as the main language in the city and the region. Persian is also understood by a fair number of the city dwellers, especially those serving in the government and the educated Afghans. Both are the official languages of Afghanistan. A 2006 compendium of provincial data prepared by the Afghan Ministry of Rural Rehabilitation and Development and United Nations Assistance Mission in Afghanistan (UNAMA) states:\n\nThe Pashtun culture is dominant in this region.\n\nNotable people from Kandahar \n\n*Nur Jahan – Empress of the Mughal Empire\n*Mirwais Hotak – founder of the Hotak dynasty\n*Abdul Aziz Hotak – ruler of the Hotak dynasty\n*Mahmud Hotak – ruler of the Hotak dynasty and Shah of Persia\n*Ashraf Hotak – Shah of Persia\n*Hussain Hotak – ruler of the Hotak dynasty\n*Ahmad Shah Durrani – founding father of Afghanistan who is buried in the city\n*Payandah Khan, earliest tribal chief of the Barakzai dynasty\n*Dost Mohammad Khan – Emir of Afghanistan and son of Payandah Khan\n*Sher Ali Khan – Emir of Afghanistan and son of Dost Mohammad Khan\n*Abdur Rahman Khan – Emir of Afghanistan and son of Dost Mohammad Khan\n*Ghulam Muhammad Tarzi – leader of Tarzi family who played an important part in Afghan history during the late 19th century onward\n*Abdul Rehman Khan, father of Bollywood actor Kader Khan\n*Mohammed Zahir Shah – the last king of Afghanistan\n*Mohammed Daoud Khan founder of the republic of Afghanistan\n*Ubaidullah Jan – Pashto music king of southern Afghanistan\n*Naghma – Afghan singer\n*Nashenas – Afghan musician\n*Abdul Hai Habibi – scholar, former professor at Kabul University and author of many books\n*The Karzais – the family of Afghan President Hamid Karzai\n*Gul Agha Sherzai – served as the governor of Kandahar province followed by as governors of Nangarhar province\n*Said Tayeb Jawad – former Afghanistan Ambassador to the United States\n*Yousef Pashtun – Afghan politician\n* Mula Naqib Akhund - Alokozai tribe leader\n* Khan Mohammad Mujahid - Alokozai tribe leader. Kandahar. http://en.wikipedia.org/?curid=17260."
  }
}
