{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7401",
  "eid" : "e161eb60-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778457878,
  "textBody" : "A centaur (; , Kéntauros, ), or occasionally hippocentaur, is a mythological creature with the upper body of a human and the lower body and legs of a horse.Webster's Third New International Dictionary, G. & C. Merriam Company (1961), s.v. hippocentaur.\n\nMythology\n\nOrigin\n\nThe centaurs were usually said to have been born of Ixion and Nephele (the cloud made in the image of Hera). Another version, however, makes them children of a certain Centaurus, who mated with the Magnesian mares. This Centaurus was either himself the son of Ixion and Nephele (inserting an additional generation) or of Apollo and Stilbe, daughter of the river god Peneus. In the later version of the story his twin brother was Lapithes, ancestor of the Lapiths, thus making the two warring peoples cousins.\n\nCentaurs were said to have inhabited the region of Magnesia and Mount Pelion in Thessaly, the Foloi oak forest in Elis, and the Malean peninsula in southern Laconia.\n\nAnother tribe of centaurs was said to have lived on Cyprus.  According to Nonnus, they were fathered by Zeus, who, in frustration after Aphrodite had eluded him, spilled his seed on the ground of that land.  Unlike those of mainland Greece, the Cyprian centaurs were horned.Nonnus, Dionysiaca, v. 611 ff, xiv. 193 ff, xxxii. 65 ff.\n\nThere were also the Lamian Pheres, twelve rustic daimones of the Lamos river. They were set by Zeus to guard the infant Dionysos, protecting him from the machinations of Hera but the enraged goddess transformed them into ox-horned Centaurs. The Lamian Pheres later accompanied Dionysos in his campaign against the Indians.\n\nCentaurs subsequently featured in Roman mythology, and were familiar figures in the medieval bestiary.  They remain a staple of modern fantastic literature.  The centaur's half-human, half-horse composition has led many writers to treat them as liminal beings, caught between the two natures, embodied in contrasted myths, both as the embodiment of untamed nature, as in their battle with the Lapiths (their kin), or conversely as teachers, like Chiron.\n\nCentauromachy\n\nThe Centaurs are best known for their fight with the Lapiths, which was caused by their attempt to carry off Hippodamia and the rest of the Lapith women on the day of Hippodamia's marriage to Pirithous, king of the Lapithae, himself the son of Ixion. The strife among these cousins is a metaphor for the conflict between the lower appetites and civilized behavior in humankind. Theseus, a hero and founder of cities, who happened to be present, threw the balance in favour of the right order of things, and assisted Pirithous. The Centaurs were driven off or destroyed.Plutarch, Theseus, 30.Ovid, Metamorphoses xii. 210.Diodorus Siculusiv. pp. 69-70. Another Lapith hero, Caeneus, who was invulnerable to weapons, was beaten into the earth by Centaurs wielding rocks and the branches of trees. Centaurs are thought of in many Greek myths as wild as untamed horses. Like the Titanomachy, the defeat of the Titans by the Olympian gods, the contests with the Centaurs typify the struggle between civilization and barbarism.\n\nThe Centauromachy is most famously portrayed in the Parthenon metopes by Phidias and in a Renaissance-era sculpture by Michelangelo.\n\nOther depictions in classical art\n\nThe tentative identification of two fragmentary Mycenaean terracotta figures as centaurs,  among the extensive Mycenaean pottery found at Ugarit, suggests a Bronze Age origin for these creatures of myth.Ione Mylonas Shear, \"Mycenaean Centaurs at Ugarit\" The Journal of Hellenic Studies (2002:147–153); but see the interpretation relating them to \"abbreviated group\" figures at the Bronze-Age sanctuary of Aphaia and elsewhere, presented by Korinna Pilafidis-Williams, \"No Mycenaean Centaurs Yet\", The Journal of Hellenic Studies 124 (2004), p. 165, which concludes \"we had perhaps do best not to raise hopes of a continuity of images across the divide between the Bronze Age and the historical period.\" A painted terracotta centaur was found in the \"Hero's tomb\" at Lefkandi, and by the Geometric period, centaurs figure among the first representational figures painted on Greek pottery. An often-published Geometric period bronze of a warrior face-to-face with a centaur is at the Metropolitan Museum of Art.[http://www.metmuseum.org/toah/works-of-art/17.190.2072 Metropolitan Museum of Art] Retrieved 9 October 2011.\n\nIn Greek art of the Archaic period, centaurs are depicted in three different forms.  Some centaurs are depicted with a human torso attached to the body of a horse at the withers, where the horse's neck would be; this form, designated \"Class A\" by Professor Baur, later became standard.  \"Class B\" centaurs are depicted with a human body and legs, joined at the waist with the hindquarters of a horse; in some cases centaurs of both types appear together.  A third type, designated \"Class C\", depicts centaurs with human forelegs terminating in hooves.  Baur describes this as an apparent development of Aeolic art, which never became particularly widespread.Paul V. C. Baur, Centaurs in Ancient Art: The Archaic Period, Karl Curtius, Berlin (1912), pp. 5–7.  At a later period, paintings on some amphoras depict winged centaurs.\n\nCentaurs were also frequently depicted in Roman art.  A particularly famous example is the pair of centaurs drawing the chariot of Constantine the Great and his family, in the Great Cameo of Constantine (circa AD 314–16), which embodies wholly pagan imagery, and contrasts sharply with the popular image of Constantine as the patron of early Christianity.The Great Cameo of Constantine, formerly in the collection of Peter Paul Rubens and now in the Geld en Bankmuseum, Utrecht, is illustrated, for instance, in Paul Stephenson, Constantine, Roman Emperor, Christian Victor, 2010:fig. 53.Iain Ferris, The Arch of Constantine: Inspired by the Divine, Amberley Publishing (2009).\n\nTheories of origin\n\nThe most common theory holds that the idea of centaurs came from the first reaction of a non-riding culture, as in the Minoan Aegean world, to nomads who were mounted on horses. The theory suggests that such riders would appear as half-man, half-animal (Bernal Díaz del Castillo reported that the Aztecs had this misapprehension about Spanish cavalrymen).Stuart Chase, Mexico: A Study of Two Americas, Chapter IV ([http://xroads.virginia.edu/~Hyper2/chase/ch04.html University of Virginia Hypertext]). Retrieved 24 April 2006. Horse taming and horseback culture arose first in the southern steppe grasslands of Central Asia, perhaps approximately in modern Kazakhstan.\n\nThe Lapith tribe of Thessaly, who were the kinsmen of the Centaurs in myth, were described as the inventors of horse-back riding by Greek writers. The Thessalian tribes also claimed their horse breeds were descended from the centaurs.\n\nOf the various Classical Greek authors who mentioned centaurs, Pindar was the first who describes undoubtedly a combined monster.\"...that strange race was born, like to both parents, their mother’s form below, above their sire’s.\" (Second Pythian Ode). Previous authors (Homer) tend to use words such as pheres (cf. theres, \"beasts\")For example, Homer Iliad i. 268, ii. 743. Compare the Hesiodic Shield of Heracles, 104. that could also mean ordinary savage men riding ordinary horses, though Homer does specifically refer to a centaur (\"kentauros\") in the Odyssey At Odyssey 21.295ff, Antinous tells the disguised Odysseus the tale of the drunken rage of Eurytion, the centaur who caused the strife between the centaurs and the Lapiths. The Greek word for centaur appears in lines 295 and 303 of Book 21. Contemporaneous representations of hybrid centaurs can be found in archaic Greek art.\n\nLucretius in his first century BC philosophical poem On the Nature of Things denied the existence of centaurs based on their differing rate of growth. He states that at the age of three years horses are in the prime of their life while, at three humans are still little more than babies, making hybrid animals impossible.Lucretius, On the Nature of Things, book V, translated by William Ellery Leonard, 1916 ([http://www.perseus.tufts.edu/cgi-bin/ptext?lookup=Lucr.+5.878 The Perseus Project].) Retrieved 27 July 2008.\n\nRobert Graves (relying on the work of Georges Dumézil,Dumézil, Le Problème des Centaures  (Paris 1929) and Mitra-Varuna: An essay on two Indo-European representations of sovereignty (1948. tr. 1988). who argued for tracing the centaurs back to the Indian gandharva), speculated that the centaurs were a dimly remembered, pre-Hellenic fraternal earth cult who had the horse as a totem.Graves, The Greek Myths, 1960 § 81.4; § 102 \"Centaurs\"; § 126.3;. A similar theory was incorporated into Mary Renault's The Bull from the Sea. Kinnaras, another half-man half-horse mythical creature from the Indian mythology, appeared in various ancient texts, arts as well as sculptures from all around India. It is shown as a horse with the torso of a man in place of where the horse's head has to be, that is similar to a Greek centaur.Devdutt Pattanaik, “Indian mythology : tales, symbols, and rituals from the heart of the Subcontinent” (Rochester, USA 2003)  P.74: .K. Krishna Murthy, Mythical Animals in Indian Art (New Delhi, India 1985).\n\nThe Greek word kentauros is generally regarded as of obscure origin.Alex Scobie, \"The Origins of 'Centaurs'\" Folklore 89.2 (1978:142–147); Scobie quotes Martin P. Nilsson, Geschichte der griechischen Religion, 1955, \"Die Etymologie und die Deutung der Ursprungs sind unsicher und mögen auf sich beruhen\". The  etymology from ken – tauros, \"piercing bull-stickers\" was a euhemerist suggestion in Palaephatus' rationalizing text on Greek mythology, On Incredible Tales (Περὶ ἀπίστων): mounted archers from a village called Nephele eliminating a herd of bulls that were the scourge of Ixion's kingdom.Noted by Scobie 1978:142. Another possible related etymology can be \"bull-slayer\".Alexander Hislop, in his polemic The Two Babylons: Papal Worship Revealed to be the Worship of Nimrod and His Wife. (1853, revised 1858) theorized that the word is derived from the Semitic Kohen and \"tor\" (to go round) via phonetic shift the less prominent consonants being lost over time, with it developing into Khen Tor or Ken-Tor, and being transliterated phonetically into Ionian as Kentaur, but this is not accepted by any modern philologist.\n\nIndian centaur\n\nIn a popular legend associated with Pazhaya Sreekanteswaram Temple in Thiruvananthapuram, the curse of a saintly Brahmin transformed a handsome Yadava prince into a creature having a horse's body with the prince's head, arms and torso in place of the head and neck of the horse.\n\nFemale centaurs\n\nThough female centaurs, called centaurides or centauresses, are not mentioned in early Greek literature and art, they do appear occasionally in later antiquity. A Macedonian mosaic of the 4th century BC  is one of the earliest examples of the centauress in art.Pella Archaeological Museum  Ovid also mentions a centauress named Hylonome who committed suicide when her husband Cyllarus was killed in the war with the Lapiths.Publius Ovidius Naso, Metamorphoses, xii. 210 ff.\n\nPersistence in the medieval world\n\nCentaurs preserved a Dionysian connection in the 12th century Romanesque carved capitals of Mozac Abbey in the Auvergne, where other capitals depict harvesters, boys riding goats (a further Dionysiac theme) and griffins guarding the chalice that held the wine.\n\nCentaurs are shown on a number of Pictish carved stones from north-east Scotland, erected in the 8th–9th centuries AD (e.g., at Meigle, Perthshire).  Though outside the limits of the Roman Empire, these depictions appear to be derived from Classical prototypes.\n\nJerome's version of the Life of St Anthony the Great, the hermit monk of Egypt, written by Athanasius of Alexandria, was widely disseminated in the Middle Ages; it relates Anthony's encounter with a centaur, who challenged the saint but was forced to admit that the old gods had been overthrown. The episode was often depicted; in The Meeting of St Anthony Abbot and St Paul the Hermit by Stefano di Giovanni called \"Sassetta\",National Gallery of Art, Washington, DC: [http://www.wga.hu/support/viewer/z.html illustration]. of two episodic depictions in a single panel of the hermit Anthony's travel to greet the hermit Paul, one is his encounter along the pathway with the demonic figure of a centaur in a wood.\n\nA centaur-like half-human half-equine creature called Polkan appeared in Russian folk art, and lubok prints of the 17th–19th centuries. Polkan is originally based on Pulicane, a half-dog from Andrea da Barberino's poem I Reali di Francia, which was once popular in the Slavonic world in prosaic translations.\n\nModern day \n\nThe John C. Hodges library at The University of Tennessee hosts a permanent exhibit of a \"Centaur from Volos\", in its library. The exhibit, made by sculptor Bill Willers, by combining a study human skeleton with the skeleton of a Shetland pony is entitled \"Do you believe in Centaurs?\" and was meant to mislead students in order to make them more critically aware, according to the exhibitors.\n\nAnother exhibit by Willers is now on long-term display at the International Wildlife Museum in Tucson, Arizona.  The full-mount skeleton of a Centaur, built by Skulls Unlimited International, is on display, along with several other fabled creatures, including the Cyclops, Unicorn and Griffin.\n\nC.S. Lewis' The Chronicles of Narnia series depicts centaurs as the wisest and noblest of creatures. Narnian Centaurs are gifted at stargazing, prophecy, healing, and warfare, a fierce and valiant race always faithful to the High King Aslan the Lion. Lewis generally used the species to inspire awe in his readers.\n\nIn J.K. Rowling's Harry Potter series, centaurs live in the Forbidden Forest close to Hogwarts, preferring to avoid contact with humans.  They live in societies called herds and are skilled at archery, healing and astrology, but like in the original myths, they are known to have some wild and barbarous tendencies. Although film depictions include very animalistic facial features, the reaction of the Hogwarts girls to Firenze suggests a more classical appearance.\n\nWith the exception of Chiron, the centaurs in Rick Riordan's Percy Jackson & the Olympians are seen as wild party-goers who use a lot of American slang. Chiron retains his mythological role as a trainer of heroes and is skilled in archery. In Riordan's subsequent series, Heroes of Olympus, another group of centaurs are depicted with more animalistic features (such as horns) and appear as villains, serving the Gigantes.\n\nPhilip Jose Farmer's World of Tiers series (1965) includes centaurs, called Half-Horses or Hoi Kentauroi. His creations address several of the metabolic problems of such creatures—how could the human mouth and nose intake sufficient air to sustain both itself and the horse body and, similarly, how could the human ingest sufficient food to sustain both parts.\n\nBrandon Mull's Fablehaven series features Centaurs that live in an area called Grunhold. The Centaurs are portrayed as a proud, elitist group of beings that consider themselves superior to all other creatures. The fourth book also has a variation on the species called an Alcetaur, which is part man, part moose.\n\nCentaur appears in the novel by John Updike (The Centaur, 1963). The author depicts a rural Pennsylvanian town as seen through the optics of the myth of Centaur. An unknown and marginalized local school teacher, just like the mythological Chiron did for Prometheus, gave up his life for the future of his son who had chosen to be an independent artist in New York.\n\nGallery\n\nFile:Centaur lekythos Met 51.163.jpg|Diosphos Painter, white-ground lekythos (500 BC)\nFile:Sandro Botticelli 063.jpg|Botticelli, Pallas and Centaur (1482–83)\nFile:Canova - Theseus defeats the centaur - close.jpg|Antonio Canova, Theseus Defeats the Centaur (1805-1819)\nFile:Bova1860.jpg|Prince Bova fights Polkan, Russian lubok (1860)\nFile:Centaure Malmaison crop.jpg|A bronze statue of a centaur, after the Furietti Centaurs",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Centaur" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7401" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A centaur (; , Kéntauros, ), or occasionally hippocentaur, is a mythological creature with the upper body of a human and the lower body and legs of a horse.Webster's Third New International Dictionary, G. & C. Merriam Company (1961), s.v. hippocentaur.\n\nMythology\n\nOrigin\n\nThe centaurs were usually said to have been born of Ixion and Nephele (the cloud made in the image of Hera). Another version, however, makes them children of a certain Centaurus, who mated with the Magnesian mares. This Centaurus was either himself the son of Ixion and Nephele (inserting an additional generation) or of Apollo and Stilbe, daughter of the river god Peneus. In the later version of the story his twin brother was Lapithes, ancestor of the Lapiths, thus making the two warring peoples cousins.\n\nCentaurs were said to have inhabited the region of Magnesia and Mount Pelion in Thessaly, the Foloi oak forest in Elis, and the Malean peninsula in southern Laconia.\n\nAnother tribe of centaurs was said to have lived on Cyprus.  According to Nonnus, they were fathered by Zeus, who, in frustration after Aphrodite had eluded him, spilled his seed on the ground of that land.  Unlike those of mainland Greece, the Cyprian centaurs were horned.Nonnus, Dionysiaca, v. 611 ff, xiv. 193 ff, xxxii. 65 ff.\n\nThere were also the Lamian Pheres, twelve rustic daimones of the Lamos river. They were set by Zeus to guard the infant Dionysos, protecting him from the machinations of Hera but the enraged goddess transformed them into ox-horned Centaurs. The Lamian Pheres later accompanied Dionysos in his campaign against the Indians.\n\nCentaurs subsequently featured in Roman mythology, and were familiar figures in the medieval bestiary.  They remain a staple of modern fantastic literature.  The centaur's half-human, half-horse composition has led many writers to treat them as liminal beings, caught between the two natures, embodied in contrasted myths, both as the embodiment of untamed nature, as in their battle with the Lapiths (their kin), or conversely as teachers, like Chiron.\n\nCentauromachy\n\nThe Centaurs are best known for their fight with the Lapiths, which was caused by their attempt to carry off Hippodamia and the rest of the Lapith women on the day of Hippodamia's marriage to Pirithous, king of the Lapithae, himself the son of Ixion. The strife among these cousins is a metaphor for the conflict between the lower appetites and civilized behavior in humankind. Theseus, a hero and founder of cities, who happened to be present, threw the balance in favour of the right order of things, and assisted Pirithous. The Centaurs were driven off or destroyed.Plutarch, Theseus, 30.Ovid, Metamorphoses xii. 210.Diodorus Siculusiv. pp. 69-70. Another Lapith hero, Caeneus, who was invulnerable to weapons, was beaten into the earth by Centaurs wielding rocks and the branches of trees. Centaurs are thought of in many Greek myths as wild as untamed horses. Like the Titanomachy, the defeat of the Titans by the Olympian gods, the contests with the Centaurs typify the struggle between civilization and barbarism.\n\nThe Centauromachy is most famously portrayed in the Parthenon metopes by Phidias and in a Renaissance-era sculpture by Michelangelo.\n\nOther depictions in classical art\n\nThe tentative identification of two fragmentary Mycenaean terracotta figures as centaurs,  among the extensive Mycenaean pottery found at Ugarit, suggests a Bronze Age origin for these creatures of myth.Ione Mylonas Shear, \"Mycenaean Centaurs at Ugarit\" The Journal of Hellenic Studies (2002:147–153); but see the interpretation relating them to \"abbreviated group\" figures at the Bronze-Age sanctuary of Aphaia and elsewhere, presented by Korinna Pilafidis-Williams, \"No Mycenaean Centaurs Yet\", The Journal of Hellenic Studies 124 (2004), p. 165, which concludes \"we had perhaps do best not to raise hopes of a continuity of images across the divide between the Bronze Age and the historical period.\" A painted terracotta centaur was found in the \"Hero's tomb\" at Lefkandi, and by the Geometric period, centaurs figure among the first representational figures painted on Greek pottery. An often-published Geometric period bronze of a warrior face-to-face with a centaur is at the Metropolitan Museum of Art.[http://www.metmuseum.org/toah/works-of-art/17.190.2072 Metropolitan Museum of Art] Retrieved 9 October 2011.\n\nIn Greek art of the Archaic period, centaurs are depicted in three different forms.  Some centaurs are depicted with a human torso attached to the body of a horse at the withers, where the horse's neck would be; this form, designated \"Class A\" by Professor Baur, later became standard.  \"Class B\" centaurs are depicted with a human body and legs, joined at the waist with the hindquarters of a horse; in some cases centaurs of both types appear together.  A third type, designated \"Class C\", depicts centaurs with human forelegs terminating in hooves.  Baur describes this as an apparent development of Aeolic art, which never became particularly widespread.Paul V. C. Baur, Centaurs in Ancient Art: The Archaic Period, Karl Curtius, Berlin (1912), pp. 5–7.  At a later period, paintings on some amphoras depict winged centaurs.\n\nCentaurs were also frequently depicted in Roman art.  A particularly famous example is the pair of centaurs drawing the chariot of Constantine the Great and his family, in the Great Cameo of Constantine (circa AD 314–16), which embodies wholly pagan imagery, and contrasts sharply with the popular image of Constantine as the patron of early Christianity.The Great Cameo of Constantine, formerly in the collection of Peter Paul Rubens and now in the Geld en Bankmuseum, Utrecht, is illustrated, for instance, in Paul Stephenson, Constantine, Roman Emperor, Christian Victor, 2010:fig. 53.Iain Ferris, The Arch of Constantine: Inspired by the Divine, Amberley Publishing (2009).\n\nTheories of origin\n\nThe most common theory holds that the idea of centaurs came from the first reaction of a non-riding culture, as in the Minoan Aegean world, to nomads who were mounted on horses. The theory suggests that such riders would appear as half-man, half-animal (Bernal Díaz del Castillo reported that the Aztecs had this misapprehension about Spanish cavalrymen).Stuart Chase, Mexico: A Study of Two Americas, Chapter IV ([http://xroads.virginia.edu/~Hyper2/chase/ch04.html University of Virginia Hypertext]). Retrieved 24 April 2006. Horse taming and horseback culture arose first in the southern steppe grasslands of Central Asia, perhaps approximately in modern Kazakhstan.\n\nThe Lapith tribe of Thessaly, who were the kinsmen of the Centaurs in myth, were described as the inventors of horse-back riding by Greek writers. The Thessalian tribes also claimed their horse breeds were descended from the centaurs.\n\nOf the various Classical Greek authors who mentioned centaurs, Pindar was the first who describes undoubtedly a combined monster.\"...that strange race was born, like to both parents, their mother’s form below, above their sire’s.\" (Second Pythian Ode). Previous authors (Homer) tend to use words such as pheres (cf. theres, \"beasts\")For example, Homer Iliad i. 268, ii. 743. Compare the Hesiodic Shield of Heracles, 104. that could also mean ordinary savage men riding ordinary horses, though Homer does specifically refer to a centaur (\"kentauros\") in the Odyssey At Odyssey 21.295ff, Antinous tells the disguised Odysseus the tale of the drunken rage of Eurytion, the centaur who caused the strife between the centaurs and the Lapiths. The Greek word for centaur appears in lines 295 and 303 of Book 21. Contemporaneous representations of hybrid centaurs can be found in archaic Greek art.\n\nLucretius in his first century BC philosophical poem On the Nature of Things denied the existence of centaurs based on their differing rate of growth. He states that at the age of three years horses are in the prime of their life while, at three humans are still little more than babies, making hybrid animals impossible.Lucretius, On the Nature of Things, book V, translated by William Ellery Leonard, 1916 ([http://www.perseus.tufts.edu/cgi-bin/ptext?lookup=Lucr.+5.878 The Perseus Project].) Retrieved 27 July 2008.\n\nRobert Graves (relying on the work of Georges Dumézil,Dumézil, Le Problème des Centaures  (Paris 1929) and Mitra-Varuna: An essay on two Indo-European representations of sovereignty (1948. tr. 1988). who argued for tracing the centaurs back to the Indian gandharva), speculated that the centaurs were a dimly remembered, pre-Hellenic fraternal earth cult who had the horse as a totem.Graves, The Greek Myths, 1960 § 81.4; § 102 \"Centaurs\"; § 126.3;. A similar theory was incorporated into Mary Renault's The Bull from the Sea. Kinnaras, another half-man half-horse mythical creature from the Indian mythology, appeared in various ancient texts, arts as well as sculptures from all around India. It is shown as a horse with the torso of a man in place of where the horse's head has to be, that is similar to a Greek centaur.Devdutt Pattanaik, “Indian mythology : tales, symbols, and rituals from the heart of the Subcontinent” (Rochester, USA 2003)  P.74: .K. Krishna Murthy, Mythical Animals in Indian Art (New Delhi, India 1985).\n\nThe Greek word kentauros is generally regarded as of obscure origin.Alex Scobie, \"The Origins of 'Centaurs'\" Folklore 89.2 (1978:142–147); Scobie quotes Martin P. Nilsson, Geschichte der griechischen Religion, 1955, \"Die Etymologie und die Deutung der Ursprungs sind unsicher und mögen auf sich beruhen\". The  etymology from ken – tauros, \"piercing bull-stickers\" was a euhemerist suggestion in Palaephatus' rationalizing text on Greek mythology, On Incredible Tales (Περὶ ἀπίστων): mounted archers from a village called Nephele eliminating a herd of bulls that were the scourge of Ixion's kingdom.Noted by Scobie 1978:142. Another possible related etymology can be \"bull-slayer\".Alexander Hislop, in his polemic The Two Babylons: Papal Worship Revealed to be the Worship of Nimrod and His Wife. (1853, revised 1858) theorized that the word is derived from the Semitic Kohen and \"tor\" (to go round) via phonetic shift the less prominent consonants being lost over time, with it developing into Khen Tor or Ken-Tor, and being transliterated phonetically into Ionian as Kentaur, but this is not accepted by any modern philologist.\n\nIndian centaur\n\nIn a popular legend associated with Pazhaya Sreekanteswaram Temple in Thiruvananthapuram, the curse of a saintly Brahmin transformed a handsome Yadava prince into a creature having a horse's body with the prince's head, arms and torso in place of the head and neck of the horse.\n\nFemale centaurs\n\nThough female centaurs, called centaurides or centauresses, are not mentioned in early Greek literature and art, they do appear occasionally in later antiquity. A Macedonian mosaic of the 4th century BC  is one of the earliest examples of the centauress in art.Pella Archaeological Museum  Ovid also mentions a centauress named Hylonome who committed suicide when her husband Cyllarus was killed in the war with the Lapiths.Publius Ovidius Naso, Metamorphoses, xii. 210 ff.\n\nPersistence in the medieval world\n\nCentaurs preserved a Dionysian connection in the 12th century Romanesque carved capitals of Mozac Abbey in the Auvergne, where other capitals depict harvesters, boys riding goats (a further Dionysiac theme) and griffins guarding the chalice that held the wine.\n\nCentaurs are shown on a number of Pictish carved stones from north-east Scotland, erected in the 8th–9th centuries AD (e.g., at Meigle, Perthshire).  Though outside the limits of the Roman Empire, these depictions appear to be derived from Classical prototypes.\n\nJerome's version of the Life of St Anthony the Great, the hermit monk of Egypt, written by Athanasius of Alexandria, was widely disseminated in the Middle Ages; it relates Anthony's encounter with a centaur, who challenged the saint but was forced to admit that the old gods had been overthrown. The episode was often depicted; in The Meeting of St Anthony Abbot and St Paul the Hermit by Stefano di Giovanni called \"Sassetta\",National Gallery of Art, Washington, DC: [http://www.wga.hu/support/viewer/z.html illustration]. of two episodic depictions in a single panel of the hermit Anthony's travel to greet the hermit Paul, one is his encounter along the pathway with the demonic figure of a centaur in a wood.\n\nA centaur-like half-human half-equine creature called Polkan appeared in Russian folk art, and lubok prints of the 17th–19th centuries. Polkan is originally based on Pulicane, a half-dog from Andrea da Barberino's poem I Reali di Francia, which was once popular in the Slavonic world in prosaic translations.\n\nModern day \n\nThe John C. Hodges library at The University of Tennessee hosts a permanent exhibit of a \"Centaur from Volos\", in its library. The exhibit, made by sculptor Bill Willers, by combining a study human skeleton with the skeleton of a Shetland pony is entitled \"Do you believe in Centaurs?\" and was meant to mislead students in order to make them more critically aware, according to the exhibitors.\n\nAnother exhibit by Willers is now on long-term display at the International Wildlife Museum in Tucson, Arizona.  The full-mount skeleton of a Centaur, built by Skulls Unlimited International, is on display, along with several other fabled creatures, including the Cyclops, Unicorn and Griffin.\n\nC.S. Lewis' The Chronicles of Narnia series depicts centaurs as the wisest and noblest of creatures. Narnian Centaurs are gifted at stargazing, prophecy, healing, and warfare, a fierce and valiant race always faithful to the High King Aslan the Lion. Lewis generally used the species to inspire awe in his readers.\n\nIn J.K. Rowling's Harry Potter series, centaurs live in the Forbidden Forest close to Hogwarts, preferring to avoid contact with humans.  They live in societies called herds and are skilled at archery, healing and astrology, but like in the original myths, they are known to have some wild and barbarous tendencies. Although film depictions include very animalistic facial features, the reaction of the Hogwarts girls to Firenze suggests a more classical appearance.\n\nWith the exception of Chiron, the centaurs in Rick Riordan's Percy Jackson & the Olympians are seen as wild party-goers who use a lot of American slang. Chiron retains his mythological role as a trainer of heroes and is skilled in archery. In Riordan's subsequent series, Heroes of Olympus, another group of centaurs are depicted with more animalistic features (such as horns) and appear as villains, serving the Gigantes.\n\nPhilip Jose Farmer's World of Tiers series (1965) includes centaurs, called Half-Horses or Hoi Kentauroi. His creations address several of the metabolic problems of such creatures—how could the human mouth and nose intake sufficient air to sustain both itself and the horse body and, similarly, how could the human ingest sufficient food to sustain both parts.\n\nBrandon Mull's Fablehaven series features Centaurs that live in an area called Grunhold. The Centaurs are portrayed as a proud, elitist group of beings that consider themselves superior to all other creatures. The fourth book also has a variation on the species called an Alcetaur, which is part man, part moose.\n\nCentaur appears in the novel by John Updike (The Centaur, 1963). The author depicts a rural Pennsylvanian town as seen through the optics of the myth of Centaur. An unknown and marginalized local school teacher, just like the mythological Chiron did for Prometheus, gave up his life for the future of his son who had chosen to be an independent artist in New York.\n\nGallery\n\nFile:Centaur lekythos Met 51.163.jpg|Diosphos Painter, white-ground lekythos (500 BC)\nFile:Sandro Botticelli 063.jpg|Botticelli, Pallas and Centaur (1482–83)\nFile:Canova - Theseus defeats the centaur - close.jpg|Antonio Canova, Theseus Defeats the Centaur (1805-1819)\nFile:Bova1860.jpg|Prince Bova fights Polkan, Russian lubok (1860)\nFile:Centaure Malmaison crop.jpg|A bronze statue of a centaur, after the Furietti Centaurs. Centaur. http://en.wikipedia.org/?curid=7401."
  }
}
