{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2987",
  "eid" : "c3948660-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778407878,
  "textBody" : "The Acts of Union were two Acts of Parliament: the Union with Scotland Act 1706 passed by the Parliament of England, and the Union with England Act passed in 1707 by the Parliament of Scotland. They put into effect the terms of the Treaty of Union that had been agreed on 22 July 1706, following negotiation between commissioners representing the parliaments of the two countries. By the two Acts, the Kingdom of England and the Kingdom of Scotlandwhich at the time were separate states with separate legislatures, but with the same monarchwere, in the words of the Treaty, \"United into One Kingdom by the Name of Great Britain\".Article I of the Treaty of Union\n\nThe two countries had shared a monarch since the Union of the Crowns in 1603, when King James VI of Scotland inherited the English throne from his double first cousin twice removed, Queen Elizabeth I. Although described as a Union of Crowns, until 1707 there were in fact two separate Crowns resting on the same head (as opposed to the implied creation of a single Crown and a single Kingdom, exemplified by the later Kingdom of Great Britain). There had been three attempts in 1606, 1667, and 1689 to unite the two countries by Acts of Parliament, but it was not until the early 18th century that both political establishments came to support the idea, albeit for different reasons.\n\nThe Acts took effect on 1 May 1707. On this date, the Scottish Parliament and the English Parliament united to form the Parliament of Great Britain, based in the Palace of Westminster in London, the home of the English Parliament.Act of Union 1707, Article 3 Hence, the Acts are referred to as the Union of the Parliaments. On the Union, the historian Simon Schama said \"What began as a hostile merger, would end in a full partnership in the most powerful going concern in the world ... it was one of the most astonishing transformations in European history.\"\n\nHistorical background \n\nPrevious attempts at union \n\nEngland and Scotland were separate states for several centuries before eventual union, and English attempts to take over Scotland by military force in the late 13th and early 14th centuries were ultimately unsuccessful (see the Wars of Scottish Independence). The first attempts at Union surrounded the foreseen unification of the Royal lines of Scotland and England. In pursuing the English throne in the 1560s, Mary, Queen of Scots pledged herself to a peaceful union between the two kingdoms.[http://www.abdn.ac.uk/historic/actsofunion/panel2.php ABDN.ac.uk]\n\nEngland and Scotland were ruled by the same king for the first time in 1603 when James VI of Scotland also became the king of England. However they remained two separate states until 1 May 1707.\n\nEarly Stuart union \n\nThe first attempt to unite the parliaments of England and Scotland was by Mary's son, King James VI and I. On his accession to the English throne in 1603 King James announced his intention to unite his two realms so that he would not be \"guilty of bigamy\". James used his royal prerogative powers to take the style of \"King of Great Britain\" and to give an explicitly British character to his court and person. Whilst James assumed the creation of a full union was a foregone conclusion, the Parliament of England was concerned that the formation of a new state would deprive England of its ancient liberties, taking on the more absolutist monarchical structure James had previously enjoyed in Scotland.Lockyer, op. cit., pp. 54–59 In the meantime, James declared that Great Britain be viewed \"as presently united, and as one realm and kingdom, and the subjects of both realms as one people\".[http://www.parliament.uk/actofunion/tk_01_dream.html Parliament.uk] \n\nThe Scottish and English parliaments established a commission to negotiate a union, formulating an instrument of union between the two countries. However, the idea of political union was unpopular, and when James dropped his policy of a speedy union, the topic quietly disappeared from the legislative agenda. When the House of Commons attempted to revive the proposal in 1610, it was met with a more open hostility.Lockyer, op. cit., p.59\n\nUnion during the interregnum \n\nThe Solemn League and Covenant 1643 sought a forced union of the Church of England into the Church of Scotland, and although the covenant referred repeatedly to union between the three kingdoms of England, Scotland, and Ireland, a political union was not spelled out.\n\nIn the aftermath of the Civil War, in which the Covenanters had fought for the King, Oliver Cromwell occupied Scotland and began a process of creating a \"Godly Britannic\" Union between the former Kingdoms.[http://www.parliament.uk/actofunion/tk_02_cromwell.html Parliament.uk]  In 1651, the Parliament of England issued the Tender of Union declaration supporting Scotland's incorporation into the Commonwealth and sent Commissioners to Scotland with the express purpose of securing support for Union, which was assented to by the Commissioners (Members of Parliament) in Scotland. On 12 April 1654, Cromwell – styling himself Lord Protector of England, Scotland and Ireland – enacted An Ordinance by the Protector for the Union of England and Scotland, which created \"one Commonwealth and under one Government\" to be known as the Commonwealth of England, Scotland and Ireland.[http://www.constitution.org/eng/conpur098.htm Constitution.org] The ordinance was ratified by the Second Protectorate Parliament, as an Act of Union, on 26 June 1657.The 1657 Act's long title was An Act and Declaration touching several Acts and Ordinances made since 20 April 1653, and before 3 September 1654, and other Acts One united Parliament sat in Westminster, with 30 representatives from Scotland and 30 from Ireland joining the existing members from England. Whilst free trade was brought about amongst the new Commonwealth, the economic benefits were generally not felt as a result of heavy taxation used to fund Cromwell's New Model Army.\n\nThis republican union was dissolved automatically with the restoration of King Charles II to the thrones of England and Scotland. Scottish members expelled from the Commonwealth Parliament petitioned unsuccessfully for a continuance of the union. Cromwell's union had simultaneously raised interest in and suspicion of the concept of union and when Charles II attempted to recreate the union and fulfil the work of his grandfather in 1669, negotiations between Commissioners ground to a halt.C. Whatley, op. cit., p.95\n\nLater attempts \n\nAn abortive scheme for union occurred in Scotland in 1670.C. Whatley, op. cit., p.30\n\nFollowing the Glorious Revolution of 1688, the records of the Parliament of Scotland show much discussion of possible union. William III and Mary II, whilst supportive of the idea, had no interest in allowing it to delay their enthronement. Impetus for this incorporating union came almost entirely from King William, who feared leaving Scotland open to a French invasion. In the 1690s, the economic position of Scotland worsened, and relations between Scotland and England became strained. In the following decade, however, union again became a significant topic of political debate.\n\nTreaty and passage of the Acts of 1707 \n\nDeeper political integration had been a key policy of Queen Anne from the time she acceded to the throne in 1702. Under the aegis of the Queen and her ministers in both kingdoms, the parliaments of England and Scotland agreed to participate in fresh negotiations for a union treaty in 1705.\n\nBoth countries appointed 31 commissioners to conduct the negotiations. Most of the Scottish commissioners favoured union, and about half were government ministers and other officials. At the head of the list was Queensberry, and the Lord Chancellor of Scotland, the Earl of Seafield. The English commissioners included the Lord High Treasurer, the Earl of Godolphin, the Lord Keeper, Baron Cowper, and a large number of Whigs who supported union. Tories were not in favour of union and only one was represented among the commissioners.\n\nNegotiations between the English and Scottish commissioners took place between 16 April and 22 July 1706 at the Cockpit in London. Each side had its own particular concerns. Within a few days, England gained a guarantee that the Hanoverian dynasty would succeed Queen Anne to the Scottish crown, and Scotland received a guarantee of access to colonial markets, in the hope that they would be placed on an equal footing in terms of trade.\n\nAfter negotiations ended in July 1706, the acts had to be ratified by both Parliaments. In Scotland, about 100 of the 227 members of the Parliament of Scotland were supportive of the Court Party. For extra votes the pro-court side could rely on about 25 members of the Squadrone Volante, led by the Marquess of Montrose and the Duke of Roxburghe. Opponents of the court were generally known as the Country party, and included various factions and individuals such as the Duke of Hamilton, Lord Belhaven and Andrew Fletcher of Saltoun, who spoke forcefully and passionately against the union. The Court party enjoyed significant funding from England and the Treasury and included many who had accumulated debts following the Darien Disaster.\n\nIn Scotland, the Duke of Queensberry was largely responsible for the successful passage of the Union act by the Scottish Parliament. In Scotland, he received much criticism from local residents, but in England he was cheered for his action. He had received around half of the funding awarded by the Westminster treasury for himself. In April 1707, he travelled to London to attend celebrations at the royal court, and was greeted by groups of noblemen and gentry lined along the road. From Barnet, the route was lined with crowds of cheering people, and once he reached London a huge crowd had formed. On 17 April, the Duke was gratefully received by the Queen at Kensington Palace.\n\nPolitical motivations \n\nEnglish perspective \n\nThe English purpose was to ensure that Scotland would not choose a monarch different from the one on the English throne. The two countries had shared a king for much of the previous century, but the English were concerned that an independent Scotland with a different king, even if he were a Protestant, might make alliances against England. The English succession was provided for by the English Act of Settlement 1701, which ensured that the monarch of England would be a Protestant member of the House of Hanover. Until the Union of Parliaments, the Scottish throne might be inherited by a different successor after Queen Anne: the Scottish Act of Security 1704 granted parliament the right to choose a successor and explicitly required a choice different from the English monarch unless the English were to grant free trade and navigation. Many people in England were unhappy about the prospect, however. English overseas possessions made England very wealthy in comparison to Scotland, a poor country with few roads, very little industry and almost no Navy.  This made some view unification as a markedly unequal relationship.\n\nScottish perspective \n\nIn Scotland, some claimed that union would enable Scotland to recover from the financial disaster wrought by the Darien scheme through English assistance and the lifting of measures put in place through the Alien Act to force the Scottish Parliament into compliance with the Act of Settlement.\n\nThe combined votes of the Court party with a majority of the Squadrone Volante were sufficient to ensure the final passage of the treaty through the House.\n\nPersonal financial interests were also allegedly involved. Many Commissioners had invested heavily in the Darien scheme and they believed that they would receive compensation for their losses; Article 15 granted £398,085 10s sterling to Scotland, a sum known as The Equivalent, to offset future liability towards the English national debt. In essence it was also used as a means of compensation for investors in the Company of Scotland's Darien scheme, as 58.6% was allocated to its shareholders and creditors.Watt, Douglas. The Price of Scotland: Darien, Union and the wealth of nations. Luath Press 2007.\n\nEven more direct bribery was also said to be a factor.[http://www.parliament.uk/actofunion/09_bribery.html Parliament.uk]  £20,000 (£240,000 Scots) was dispatched to Scotland for distribution by the Earl of Glasgow. James Douglas, 2nd Duke of Queensberry, the Queen's Commissioner in Parliament, received £12,325, more than 60% of the funding. (Some contend that all of this money was properly accounted for as compensation for loss of office, pensions and so forth not outwith the usual run of government. It is perhaps a debate that will never be set to rest. However, modern research has shown that payments were made to supporters of union that appear not to have been overdue salaries. At least four payments were made to people who were not even members of the Scottish Parliament.) Robert Burns referred to this:\n\nWe're bought and sold for English Gold,\nSuch a Parcel of Rogues in a Nation.\n\nSome of the money was used to hire spies, such as Daniel Defoe; his first reports were of vivid descriptions of violent demonstrations against the Union. \"A Scots rabble is the worst of its kind,\" he reported, \"for every Scot in favour there is 99 against\". Years later, Sir John Clerk of Penicuik, originally a leading Unionist, wrote in his memoirs that Defoe \"was a spy among us, but not known as such, otherwise the Mob of Edinburgh would pull him to pieces.\"\n\nThe Treaty could be considered very unpopular at the time. Popular unrest occurred in Edinburgh, as mentioned above, with some lesser but still substantial riots in Glasgow. The people of Edinburgh demonstrated against the treaty, and their apparent leader in opposition to the Unionists was James Hamilton, 4th Duke of Hamilton. However, Hamilton was actually on the side of the English Government. Demonstrators in Edinburgh were opposed to the Union for many reasons: they feared the Kirk would be Anglicised; that Anglicisation would remove democracy from the only really elementally democratic part of the Kingdom; and they feared that tax rises would come.\n\nSir George Lockhart of Carnwath, the only member of the Scottish negotiating team against union, noted that \"The whole nation appears against the Union\" and even Sir John Clerk of Penicuik, an ardent pro-unionist and Union negotiator, observed that the treaty was \"contrary to the inclinations of at least three-fourths of the Kingdom\". Public opinion against the Treaty as it passed through the Scottish Parliament was voiced through petitions from shires, burghs, presbyteries and parishes. The Convention of Royal Burghs also petitioned against the Union as proposed:\n\nNot one petition in favour of an incorporating union was received by Parliament. On the day the treaty was signed, the carilloner in St Giles Cathedral, Edinburgh, rang the bells in the tune Why should I be so sad on my wedding day?Notes by John Purser to CD Scotland's Music, [http://www.electricscotland.com/familytree/magazine/augsep2003/edinburgh.htm Facts about Edinburgh]. Threats of widespread civil unrest resulted in Parliament imposing martial law.\n\nProvisions of the Acts \n\nThe Treaty of Union, agreed between representatives of the Parliament of England and the Parliament of Scotland in 1706, consisted of 25 articles, 15 of which were economic in nature. In Scotland, each article was voted on separately and several clauses in articles were delegated to specialised subcommittees. Article 1 of the treaty was based on the political principle of an incorporating union and this was secured by a majority of 116 votes to 83 on 4 November 1706. To minimise the opposition of the Church of Scotland, an Act was also passed to secure the Presbyterian establishment of the Church, after which the Church stopped its open opposition, although hostility remained at lower levels of the clergy. The treaty as a whole was finally ratified on 16 January 1707 by a majority of 110 votes to 69.\n\nThe two Acts incorporated provisions for Scotland to send representative peers from the Peerage of Scotland to sit in the House of Lords. It guaranteed that the Church of Scotland would remain the established church in Scotland, that the Court of Session would \"remain in all time coming within Scotland\", and that Scots law would \"remain in the same force as before\". Other provisions included the restatement of the Act of Settlement 1701 and the ban on Roman Catholics from taking the throne. It also created a customs union and monetary union.\n\nThe Act provided that any \"laws and statutes\" that were \"contrary to or inconsistent with the terms\" of the Act would \"cease and become void\".\n\nSoon after the Union, the Act 6 Anne c.40later infelicitously named the Union with Scotland (Amendment) Act 1707united the English and Scottish Privy Councils and decentralised Scottish administration by appointing justices of the peace in each shire to carry out administration. In effect it took the day-to-day government of Scotland out of the hands of politicians and into those of the College of Justice.\n\nEvaluations \n\nScotland benefited, says historian G.N. Clark, gaining \"freedom of trade with England and the colonies\" as well as \"a great expansion of markets\". The agreement guaranteed the permanent status of the Presbyterian church in Scotland, and the separate system of laws and courts in Scotland.  Clark argued that in exchange for the financial benefits and bribes that England bestowed, what it gained was\n\nof inestimable value. Scotland accepted the Hanoverian succession and gave up her power of threatening England's military security and complicating her commercial relations ... The sweeping successes of the eighteenth-century wars owed much to the new unity of the two nations.G.N. Clark, The Later Stuarts, 1660–1714 (2nd ed. 1956) pp 290–93.\n\nBy the time Samuel Johnson and James Boswell made their tour in 1773, recorded in A Journey to the Western Islands of Scotland, Johnson noted that Scotland was \"a nation of which the commerce is hourly extending, and the wealth increasing\" and in particular that Glasgow had become one of the greatest cities of Britain.\n\n300th anniversary \n\nA commemorative two-pound coin was issued to mark the tercentennial—300th anniversary—of the Union, which occurred two days before the Scottish Parliament general election on 3 May 2007.[https://www.theyworkforyou.com/wrans/?id=2006-11-06a.79.0 House of Lords – Written answers], 6 November 2006, TheyWorkForYou.com\n\nThe Scottish Executive held a number of commemorative events through the year including an education project led by the Royal Commission on the Ancient and Historical Monuments of Scotland, an exhibition of Union-related objects and documents at the National Museums of Scotland and an exhibition of portraits of people associated with the Union at the National Galleries of Scotland.Announced by the Scottish Culture Minister, Patricia Ferguson, 9 November 2006\n\nScottish voting records \n\n|-\n! colspan\"2\" style\n\"background:#e9e9e9 text-align:left;\"|Commissioner\n! style=\"background:#e9e9e9 text-align:right;\"|Constituency/Position\n! style=\"background:#e9e9e9 text-align:right;\"|Party\n! style=\"background:#e9e9e9 text-align:right;\"|Vote\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |James Graham, 1st Duke of Montrose\n| style=\"text-align:left\" |Lord President of the Council of Scotland/Stirlingshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |John Campbell, 2nd Duke of Argyll\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Hay, 2nd Marquess of Tweeddale\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |William Kerr, 2nd Marquess of Lothian\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |John Erskine, 22nd Earl of Mar\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |John Gordon, 16th Earl of Sutherland\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Hamilton-Leslie, 9th Earl of Rothes\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Douglas, 11th Earl of Morton\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Cunningham, 12th Earl of Glencairn\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Hamilton, 6th Earl of Abercorn\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Ker, 1st Duke of Roxburghe\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Thomas Hamilton, 6th Earl of Haddington\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Maitland, 5th Earl of Lauderdale\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Wemyss, 4th Earl of Wemyss\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Ramsay, 5th Earl of Dalhousie\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Ogilvy, 4th Earl of Findlater\n| style=\"text-align:left\" |Banffshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Leslie, 3rd Earl of Leven\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Carnegie, 4th Earl of Northesk\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Earl of Belcarras\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Douglas, 1st Earl of Forfar\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Boyd, 3rd Earl of Kilmarnock\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Keith, 1st Earl of Kintore\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Patrick Hume, 1st Earl of Marchmont\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Mackenzie, 1st Earl of Cromartie\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Primrose, 1st Earl of Rosebery\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Boyle, 1st Earl of Glasgow\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Charles Hope, 1st Earl of Hopetoun\n| style=\"text-align:left\" |LIKELY Linlithgowshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Henry Scott, 1st Earl of Deloraine\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Campbell, Earl of Illay\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Hay, Viscount Dupplin\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Forbes, 12th Lord Forbes\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Elphinstone, 8th Lord Elphinstone\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Ross, 12th Lord Ross\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Sandilands, 7th Lord Torphichen\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Lord Fraser\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Ogilvy, 3rd Lord Banff\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Murray, 4th Lord Elibank\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Kenneth Sutherland, 3rd Lord Duffus\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Rollo, 4th Lord Rollo\n| style=\"text-align:left\" |Stirlingshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Murray, Lord Philiphaugh\n| style=\"text-align:left\" |Lord Clerk Register/Selkirkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Adam Cockburn, Lord Ormiston\n| style=\"text-align:left\" |Lord Justice Clerk\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Robert Dickson of Inverask\n| style=\"text-align:left\" |Edinburghshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |William Nisbet of Dirletoun\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Cockburn, younger, of Ormestoun\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir John Swintoun of that ilk\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Alexander Campbell of Cessnock\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir William Kerr of Greenhead\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Archibald Douglas of Cavers\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |William Bennet of Grubbet\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Murray of Bowhill\n| style=\"text-align:left\" |Selkirkshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Pringle of Haining\n| style=\"text-align:left\" |Selkirkshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |William Morison of Prestongrange\n| style=\"text-align:left\" |Peeblesshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Horseburgh of that ilk\n| style=\"text-align:left\" |Peeblesshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |George Baylie of Jerviswood\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir John Johnstoun of Westerhall\n| style=\"text-align:left\" |Dumfriesshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Dowglass of Dornock\n| style=\"text-align:left\" |Dumfriesshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Stewart of Castlestewart\n| style=\"text-align:left\" |Wigtownshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Stewart of Sorbie\n| style=\"text-align:left\" |Wigtownshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Francis Montgomery of Giffan\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr William Dalrymple of Glenmuir\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Robert Stewart of Tillicultrie\n| style=\"text-align:left\" |Buteshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir Robert Pollock of that ilk\n| style=\"text-align:left\" |Renfrewshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr John Montgomery of Wrae\n| style=\"text-align:left\" |Linlithgowshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Halden of Glenagies\n| style=\"text-align:left\" |Perthshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Mongo Graham of Gorthie\n| style=\"text-align:left\" |Perthshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir Thomas Burnet of Leyes\n| style=\"text-align:left\" |Kincardineshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |William Seton, younger, of Pitmedden\n| style=\"text-align:left\" |Aberdeenshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Alexander Grant, younger, of that ilk\n| style=\"text-align:left\" |Inverness-shire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir William Mackenzie\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Aeneas McLeod of Cadboll\n| style=\"text-align:left\" |Cromartyshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Campbell of Mammore\n| style=\"text-align:left\" |Argyllshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir James Campbell of Auchinbreck\n| style=\"text-align:left\" |Argyllshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |James Campbell, younger, of Ardkinglass\n| style=\"text-align:left\" |Argyllshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir William Anstruther of that ilk\n| style=\"text-align:left\" |Fife\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |James Halyburton of Pitcurr\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Alexander Abercrombie of Glassoch\n| style=\"text-align:left\" |Banffshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr James Dunbarr, younger, of Hemprigs\n| style=\"text-align:left\" |Caithness\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Alexander Douglas of Eagleshay\n| style=\"text-align:left\" |Orkney and Shetland\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir John Bruce, 2nd Baronet\n| style=\"text-align:left\" |Kinross-shire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Scrimsour\n| style=\"text-align:left\" |Dundee\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Lieutenant Colonel John Areskine\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Mure\n| style=\"text-align:left\" |Likely Ayr\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |James Scott\n| style=\"text-align:left\" |Montrose\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir John Anstruther, 1st Baronet, of Anstruther\n| style=\"text-align:left\" |Anstruther Easter\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Spittle\n| style=\"text-align:left\" |Inverkeithing\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Patrick Moncrieff\n| style=\"text-align:left\" |Kinghorn\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir Andrew Home\n| style=\"text-align:left\" |Kirkcudbright\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir Peter Halket\n| style=\"text-align:left\" |Dunfermline\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir James Smollet\n| style=\"text-align:left\" |Dumbarton\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Carmichell\n| style=\"text-align:left\" |Lanark\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Sutherland\n| style=\"text-align:left\" |Elgin\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Captain Daniel McLeod\n| style=\"text-align:left\" |Tain\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir David Dalrymple, 1st Baronet\n| style=\"text-align:left\" |Culross\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Alexander Ogilvie\n| style=\"text-align:left\" |Banff\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Clerk\n| style=\"text-align:left\" |Whithorn\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Ross\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Hew Dalrymple, Lord North Berwick\n| style=\"text-align:left\" |North Berwick\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Patrick Ogilvie\n| style=\"text-align:left\" |Cullen\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |George Allardyce\n| style=\"text-align:left\" |Kintore\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Avis\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr James Bethun\n| style=\"text-align:left\" |Kilrenny\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Roderick McKenzie\n| style=\"text-align:left\" |Fortrose\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Urquhart\n| style=\"text-align:left\" |Dornoch\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Daniel Campbell\n| style=\"text-align:left\" |Inveraray\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Robert Forbes\n| style=\"text-align:left\" |Inverurie\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Robert Dowglass\n| style=\"text-align:left\" |Kirkwall\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Alexander Maitland\n| style=\"text-align:left\" |Inverbervie\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr George Dalrymple\n| style=\"text-align:left\" |Stranraer\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Charles Campbell\n| style=\"text-align:left\" |Campbeltown\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| colspan\"4\" style\n\"text-align:left; background:lightgreen;\"|Total Ayes\n| style=\"text-align:right\" |106\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Hamilton, 4th Duke of Hamilton\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Johnstone, 1st Marquess of Annandale\n| style=\"text-align:left\" |Annan\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Charles Hay, 13th Earl of Erroll\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Keith, 9th Earl Marischal\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Erskine, 9th Earl of Buchan\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Sinclair, 9th Earl of Caithness\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Fleming, 6th Earl of Wigtown\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Stewart, 5th Earl of Galloway\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Murray, 5th Viscount of Stormont\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Livingston, 3rd Viscount of Kilsyth\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Fraser, 12th Lord Saltoun\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Francis Sempill, 10th Lord Sempill\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Charles Oliphant, 7th Lord Oliphant\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Elphinstone, 4th Lord Balmerino\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Walter Stuart, 6th Lord Blantyre\n| style=\"text-align:left\" |Linlithgow\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Hamilton, 3rd Lord Bargany\n| style=\"text-align:left\" |Queensferry\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Hamilton, 2nd Lord Belhaven and Stenton\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Lord Colvill\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Patrick Kinnaird, 3rd Lord Kinnaird\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir John Lawder of Fountainhall\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Andrew Fletcher of Saltoun\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Robert Sinclair, 3rd Baronet\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Patrick Home of Rentoun\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Gilbert Elliot of Minto\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Bayllie of Lamingtoun\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Sinclair, younger, of Stevensone\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Hamilton of Aikenhead\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Alexander Fergusson of Isle\n| style=\"text-align:left\" |Dumfriesshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Hugh Cathcart of Carletoun\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Brisbane, younger, of Bishoptoun\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Cochrane of Kilmaronock\n| style=\"text-align:left\" |Dumbartonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Humphray Colquhoun of Luss\n| style=\"text-align:left\" |Dumbartonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir John Houstoun of that ilk\n| style=\"text-align:left\" |Renfrewshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Rollo of Powhouse\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Thomas Sharp of Houstoun\n| style=\"text-align:left\" |Linlithgowshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Murray of Strowan\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Gordon of Pitlurg\n| style=\"text-align:left\" |Aberdeenshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Forbes of Colloden\n| style=\"text-align:left\" |Nairnshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Bethun of Balfour\n| style=\"text-align:left\" |Fife\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Major Henry Balfour of Dunboog\n| style=\"text-align:left\" |Fife\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Thomas Hope of Rankeillor\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Patrick Lyon of Auchterhouse\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr James Carnagie of Phinhaven\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Graham, younger, of Fintrie\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Maxwell of Cardines\n| style=\"text-align:left\" |Kirkcudbrightshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander McKye of Palgown\n| style=\"text-align:left\" |Kirkcudbrightshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Sinclair of Stempster\n| style=\"text-align:left\" |Caithness\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Henry Innes, younger, of that ilk\n| style=\"text-align:left\" |Elginshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr George McKenzie of Inchcoulter\n| style=\"text-align:left\" |Ross-shire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Inglis\n| style=\"text-align:left\" |Edinburgh\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Robertson\n| style=\"text-align:left\" |Perth\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Walter Stewart\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Hugh Montgomery\n| style=\"text-align:left\" |Glasgow\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Edgar\n| style=\"text-align:left\" |Haddington\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Duff\n| style=\"text-align:left\" |Banffshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Francis Molison\n| style=\"text-align:left\" |Brechin\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Walter Scott\n| style=\"text-align:left\" |Jedburgh\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Scott\n| style=\"text-align:left\" |Selkirk\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Kellie\n| style=\"text-align:left\" |Dunbar\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Hutchesone\n| style=\"text-align:left\" |Arbroath\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Scheills\n| style=\"text-align:left\" |Peebles\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr John Lyon\n| style=\"text-align:left\" |Forfar\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Brodie\n| style=\"text-align:left\" |Forres\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Spens\n| style=\"text-align:left\" |Rutherglen\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir David Cuningham\n| style=\"text-align:left\" |Lauder\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr John Carruthers\n| style=\"text-align:left\" |Lochmaben\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Home\n| style=\"text-align:left\" |New Galloway\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Bayne\n| style=\"text-align:left\" |Dingwall\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Robert Fraser\n| style=\"text-align:left\" |Wick\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| colspan\"4\" style\n\"text-align:left; background:pink;\"|Total Noes\n| style=\"text-align:right\" |69\n|-\n| colspan\"4\" style\n\"text-align:left; background:lightgrey;\"|Total Votes\n| style=\"text-align:right\" |175\n|-\n| style\"text-align:left\" colspan\n 5|Sources: Records of the Parliament of Scotland, [http://dbooks.bodleian.ox.ac.uk/books/PDFs/555089378.pdf Parliamentary Register, p.598]\n|}",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Acts of Union 1707" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2987" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Acts of Union were two Acts of Parliament: the Union with Scotland Act 1706 passed by the Parliament of England, and the Union with England Act passed in 1707 by the Parliament of Scotland. They put into effect the terms of the Treaty of Union that had been agreed on 22 July 1706, following negotiation between commissioners representing the parliaments of the two countries. By the two Acts, the Kingdom of England and the Kingdom of Scotlandwhich at the time were separate states with separate legislatures, but with the same monarchwere, in the words of the Treaty, \"United into One Kingdom by the Name of Great Britain\".Article I of the Treaty of Union\n\nThe two countries had shared a monarch since the Union of the Crowns in 1603, when King James VI of Scotland inherited the English throne from his double first cousin twice removed, Queen Elizabeth I. Although described as a Union of Crowns, until 1707 there were in fact two separate Crowns resting on the same head (as opposed to the implied creation of a single Crown and a single Kingdom, exemplified by the later Kingdom of Great Britain). There had been three attempts in 1606, 1667, and 1689 to unite the two countries by Acts of Parliament, but it was not until the early 18th century that both political establishments came to support the idea, albeit for different reasons.\n\nThe Acts took effect on 1 May 1707. On this date, the Scottish Parliament and the English Parliament united to form the Parliament of Great Britain, based in the Palace of Westminster in London, the home of the English Parliament.Act of Union 1707, Article 3 Hence, the Acts are referred to as the Union of the Parliaments. On the Union, the historian Simon Schama said \"What began as a hostile merger, would end in a full partnership in the most powerful going concern in the world ... it was one of the most astonishing transformations in European history.\"\n\nHistorical background \n\nPrevious attempts at union \n\nEngland and Scotland were separate states for several centuries before eventual union, and English attempts to take over Scotland by military force in the late 13th and early 14th centuries were ultimately unsuccessful (see the Wars of Scottish Independence). The first attempts at Union surrounded the foreseen unification of the Royal lines of Scotland and England. In pursuing the English throne in the 1560s, Mary, Queen of Scots pledged herself to a peaceful union between the two kingdoms.[http://www.abdn.ac.uk/historic/actsofunion/panel2.php ABDN.ac.uk]\n\nEngland and Scotland were ruled by the same king for the first time in 1603 when James VI of Scotland also became the king of England. However they remained two separate states until 1 May 1707.\n\nEarly Stuart union \n\nThe first attempt to unite the parliaments of England and Scotland was by Mary's son, King James VI and I. On his accession to the English throne in 1603 King James announced his intention to unite his two realms so that he would not be \"guilty of bigamy\". James used his royal prerogative powers to take the style of \"King of Great Britain\" and to give an explicitly British character to his court and person. Whilst James assumed the creation of a full union was a foregone conclusion, the Parliament of England was concerned that the formation of a new state would deprive England of its ancient liberties, taking on the more absolutist monarchical structure James had previously enjoyed in Scotland.Lockyer, op. cit., pp. 54–59 In the meantime, James declared that Great Britain be viewed \"as presently united, and as one realm and kingdom, and the subjects of both realms as one people\".[http://www.parliament.uk/actofunion/tk_01_dream.html Parliament.uk] \n\nThe Scottish and English parliaments established a commission to negotiate a union, formulating an instrument of union between the two countries. However, the idea of political union was unpopular, and when James dropped his policy of a speedy union, the topic quietly disappeared from the legislative agenda. When the House of Commons attempted to revive the proposal in 1610, it was met with a more open hostility.Lockyer, op. cit., p.59\n\nUnion during the interregnum \n\nThe Solemn League and Covenant 1643 sought a forced union of the Church of England into the Church of Scotland, and although the covenant referred repeatedly to union between the three kingdoms of England, Scotland, and Ireland, a political union was not spelled out.\n\nIn the aftermath of the Civil War, in which the Covenanters had fought for the King, Oliver Cromwell occupied Scotland and began a process of creating a \"Godly Britannic\" Union between the former Kingdoms.[http://www.parliament.uk/actofunion/tk_02_cromwell.html Parliament.uk]  In 1651, the Parliament of England issued the Tender of Union declaration supporting Scotland's incorporation into the Commonwealth and sent Commissioners to Scotland with the express purpose of securing support for Union, which was assented to by the Commissioners (Members of Parliament) in Scotland. On 12 April 1654, Cromwell – styling himself Lord Protector of England, Scotland and Ireland – enacted An Ordinance by the Protector for the Union of England and Scotland, which created \"one Commonwealth and under one Government\" to be known as the Commonwealth of England, Scotland and Ireland.[http://www.constitution.org/eng/conpur098.htm Constitution.org] The ordinance was ratified by the Second Protectorate Parliament, as an Act of Union, on 26 June 1657.The 1657 Act's long title was An Act and Declaration touching several Acts and Ordinances made since 20 April 1653, and before 3 September 1654, and other Acts One united Parliament sat in Westminster, with 30 representatives from Scotland and 30 from Ireland joining the existing members from England. Whilst free trade was brought about amongst the new Commonwealth, the economic benefits were generally not felt as a result of heavy taxation used to fund Cromwell's New Model Army.\n\nThis republican union was dissolved automatically with the restoration of King Charles II to the thrones of England and Scotland. Scottish members expelled from the Commonwealth Parliament petitioned unsuccessfully for a continuance of the union. Cromwell's union had simultaneously raised interest in and suspicion of the concept of union and when Charles II attempted to recreate the union and fulfil the work of his grandfather in 1669, negotiations between Commissioners ground to a halt.C. Whatley, op. cit., p.95\n\nLater attempts \n\nAn abortive scheme for union occurred in Scotland in 1670.C. Whatley, op. cit., p.30\n\nFollowing the Glorious Revolution of 1688, the records of the Parliament of Scotland show much discussion of possible union. William III and Mary II, whilst supportive of the idea, had no interest in allowing it to delay their enthronement. Impetus for this incorporating union came almost entirely from King William, who feared leaving Scotland open to a French invasion. In the 1690s, the economic position of Scotland worsened, and relations between Scotland and England became strained. In the following decade, however, union again became a significant topic of political debate.\n\nTreaty and passage of the Acts of 1707 \n\nDeeper political integration had been a key policy of Queen Anne from the time she acceded to the throne in 1702. Under the aegis of the Queen and her ministers in both kingdoms, the parliaments of England and Scotland agreed to participate in fresh negotiations for a union treaty in 1705.\n\nBoth countries appointed 31 commissioners to conduct the negotiations. Most of the Scottish commissioners favoured union, and about half were government ministers and other officials. At the head of the list was Queensberry, and the Lord Chancellor of Scotland, the Earl of Seafield. The English commissioners included the Lord High Treasurer, the Earl of Godolphin, the Lord Keeper, Baron Cowper, and a large number of Whigs who supported union. Tories were not in favour of union and only one was represented among the commissioners.\n\nNegotiations between the English and Scottish commissioners took place between 16 April and 22 July 1706 at the Cockpit in London. Each side had its own particular concerns. Within a few days, England gained a guarantee that the Hanoverian dynasty would succeed Queen Anne to the Scottish crown, and Scotland received a guarantee of access to colonial markets, in the hope that they would be placed on an equal footing in terms of trade.\n\nAfter negotiations ended in July 1706, the acts had to be ratified by both Parliaments. In Scotland, about 100 of the 227 members of the Parliament of Scotland were supportive of the Court Party. For extra votes the pro-court side could rely on about 25 members of the Squadrone Volante, led by the Marquess of Montrose and the Duke of Roxburghe. Opponents of the court were generally known as the Country party, and included various factions and individuals such as the Duke of Hamilton, Lord Belhaven and Andrew Fletcher of Saltoun, who spoke forcefully and passionately against the union. The Court party enjoyed significant funding from England and the Treasury and included many who had accumulated debts following the Darien Disaster.\n\nIn Scotland, the Duke of Queensberry was largely responsible for the successful passage of the Union act by the Scottish Parliament. In Scotland, he received much criticism from local residents, but in England he was cheered for his action. He had received around half of the funding awarded by the Westminster treasury for himself. In April 1707, he travelled to London to attend celebrations at the royal court, and was greeted by groups of noblemen and gentry lined along the road. From Barnet, the route was lined with crowds of cheering people, and once he reached London a huge crowd had formed. On 17 April, the Duke was gratefully received by the Queen at Kensington Palace.\n\nPolitical motivations \n\nEnglish perspective \n\nThe English purpose was to ensure that Scotland would not choose a monarch different from the one on the English throne. The two countries had shared a king for much of the previous century, but the English were concerned that an independent Scotland with a different king, even if he were a Protestant, might make alliances against England. The English succession was provided for by the English Act of Settlement 1701, which ensured that the monarch of England would be a Protestant member of the House of Hanover. Until the Union of Parliaments, the Scottish throne might be inherited by a different successor after Queen Anne: the Scottish Act of Security 1704 granted parliament the right to choose a successor and explicitly required a choice different from the English monarch unless the English were to grant free trade and navigation. Many people in England were unhappy about the prospect, however. English overseas possessions made England very wealthy in comparison to Scotland, a poor country with few roads, very little industry and almost no Navy.  This made some view unification as a markedly unequal relationship.\n\nScottish perspective \n\nIn Scotland, some claimed that union would enable Scotland to recover from the financial disaster wrought by the Darien scheme through English assistance and the lifting of measures put in place through the Alien Act to force the Scottish Parliament into compliance with the Act of Settlement.\n\nThe combined votes of the Court party with a majority of the Squadrone Volante were sufficient to ensure the final passage of the treaty through the House.\n\nPersonal financial interests were also allegedly involved. Many Commissioners had invested heavily in the Darien scheme and they believed that they would receive compensation for their losses; Article 15 granted £398,085 10s sterling to Scotland, a sum known as The Equivalent, to offset future liability towards the English national debt. In essence it was also used as a means of compensation for investors in the Company of Scotland's Darien scheme, as 58.6% was allocated to its shareholders and creditors.Watt, Douglas. The Price of Scotland: Darien, Union and the wealth of nations. Luath Press 2007.\n\nEven more direct bribery was also said to be a factor.[http://www.parliament.uk/actofunion/09_bribery.html Parliament.uk]  £20,000 (£240,000 Scots) was dispatched to Scotland for distribution by the Earl of Glasgow. James Douglas, 2nd Duke of Queensberry, the Queen's Commissioner in Parliament, received £12,325, more than 60% of the funding. (Some contend that all of this money was properly accounted for as compensation for loss of office, pensions and so forth not outwith the usual run of government. It is perhaps a debate that will never be set to rest. However, modern research has shown that payments were made to supporters of union that appear not to have been overdue salaries. At least four payments were made to people who were not even members of the Scottish Parliament.) Robert Burns referred to this:\n\nWe're bought and sold for English Gold,\nSuch a Parcel of Rogues in a Nation.\n\nSome of the money was used to hire spies, such as Daniel Defoe; his first reports were of vivid descriptions of violent demonstrations against the Union. \"A Scots rabble is the worst of its kind,\" he reported, \"for every Scot in favour there is 99 against\". Years later, Sir John Clerk of Penicuik, originally a leading Unionist, wrote in his memoirs that Defoe \"was a spy among us, but not known as such, otherwise the Mob of Edinburgh would pull him to pieces.\"\n\nThe Treaty could be considered very unpopular at the time. Popular unrest occurred in Edinburgh, as mentioned above, with some lesser but still substantial riots in Glasgow. The people of Edinburgh demonstrated against the treaty, and their apparent leader in opposition to the Unionists was James Hamilton, 4th Duke of Hamilton. However, Hamilton was actually on the side of the English Government. Demonstrators in Edinburgh were opposed to the Union for many reasons: they feared the Kirk would be Anglicised; that Anglicisation would remove democracy from the only really elementally democratic part of the Kingdom; and they feared that tax rises would come.\n\nSir George Lockhart of Carnwath, the only member of the Scottish negotiating team against union, noted that \"The whole nation appears against the Union\" and even Sir John Clerk of Penicuik, an ardent pro-unionist and Union negotiator, observed that the treaty was \"contrary to the inclinations of at least three-fourths of the Kingdom\". Public opinion against the Treaty as it passed through the Scottish Parliament was voiced through petitions from shires, burghs, presbyteries and parishes. The Convention of Royal Burghs also petitioned against the Union as proposed:\n\nNot one petition in favour of an incorporating union was received by Parliament. On the day the treaty was signed, the carilloner in St Giles Cathedral, Edinburgh, rang the bells in the tune Why should I be so sad on my wedding day?Notes by John Purser to CD Scotland's Music, [http://www.electricscotland.com/familytree/magazine/augsep2003/edinburgh.htm Facts about Edinburgh]. Threats of widespread civil unrest resulted in Parliament imposing martial law.\n\nProvisions of the Acts \n\nThe Treaty of Union, agreed between representatives of the Parliament of England and the Parliament of Scotland in 1706, consisted of 25 articles, 15 of which were economic in nature. In Scotland, each article was voted on separately and several clauses in articles were delegated to specialised subcommittees. Article 1 of the treaty was based on the political principle of an incorporating union and this was secured by a majority of 116 votes to 83 on 4 November 1706. To minimise the opposition of the Church of Scotland, an Act was also passed to secure the Presbyterian establishment of the Church, after which the Church stopped its open opposition, although hostility remained at lower levels of the clergy. The treaty as a whole was finally ratified on 16 January 1707 by a majority of 110 votes to 69.\n\nThe two Acts incorporated provisions for Scotland to send representative peers from the Peerage of Scotland to sit in the House of Lords. It guaranteed that the Church of Scotland would remain the established church in Scotland, that the Court of Session would \"remain in all time coming within Scotland\", and that Scots law would \"remain in the same force as before\". Other provisions included the restatement of the Act of Settlement 1701 and the ban on Roman Catholics from taking the throne. It also created a customs union and monetary union.\n\nThe Act provided that any \"laws and statutes\" that were \"contrary to or inconsistent with the terms\" of the Act would \"cease and become void\".\n\nSoon after the Union, the Act 6 Anne c.40later infelicitously named the Union with Scotland (Amendment) Act 1707united the English and Scottish Privy Councils and decentralised Scottish administration by appointing justices of the peace in each shire to carry out administration. In effect it took the day-to-day government of Scotland out of the hands of politicians and into those of the College of Justice.\n\nEvaluations \n\nScotland benefited, says historian G.N. Clark, gaining \"freedom of trade with England and the colonies\" as well as \"a great expansion of markets\". The agreement guaranteed the permanent status of the Presbyterian church in Scotland, and the separate system of laws and courts in Scotland.  Clark argued that in exchange for the financial benefits and bribes that England bestowed, what it gained was\n\nof inestimable value. Scotland accepted the Hanoverian succession and gave up her power of threatening England's military security and complicating her commercial relations ... The sweeping successes of the eighteenth-century wars owed much to the new unity of the two nations.G.N. Clark, The Later Stuarts, 1660–1714 (2nd ed. 1956) pp 290–93.\n\nBy the time Samuel Johnson and James Boswell made their tour in 1773, recorded in A Journey to the Western Islands of Scotland, Johnson noted that Scotland was \"a nation of which the commerce is hourly extending, and the wealth increasing\" and in particular that Glasgow had become one of the greatest cities of Britain.\n\n300th anniversary \n\nA commemorative two-pound coin was issued to mark the tercentennial—300th anniversary—of the Union, which occurred two days before the Scottish Parliament general election on 3 May 2007.[https://www.theyworkforyou.com/wrans/?id=2006-11-06a.79.0 House of Lords – Written answers], 6 November 2006, TheyWorkForYou.com\n\nThe Scottish Executive held a number of commemorative events through the year including an education project led by the Royal Commission on the Ancient and Historical Monuments of Scotland, an exhibition of Union-related objects and documents at the National Museums of Scotland and an exhibition of portraits of people associated with the Union at the National Galleries of Scotland.Announced by the Scottish Culture Minister, Patricia Ferguson, 9 November 2006\n\nScottish voting records \n\n|-\n! colspan\"2\" style\n\"background:#e9e9e9 text-align:left;\"|Commissioner\n! style=\"background:#e9e9e9 text-align:right;\"|Constituency/Position\n! style=\"background:#e9e9e9 text-align:right;\"|Party\n! style=\"background:#e9e9e9 text-align:right;\"|Vote\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |James Graham, 1st Duke of Montrose\n| style=\"text-align:left\" |Lord President of the Council of Scotland/Stirlingshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |John Campbell, 2nd Duke of Argyll\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Hay, 2nd Marquess of Tweeddale\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |William Kerr, 2nd Marquess of Lothian\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |John Erskine, 22nd Earl of Mar\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |John Gordon, 16th Earl of Sutherland\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Hamilton-Leslie, 9th Earl of Rothes\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Douglas, 11th Earl of Morton\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Cunningham, 12th Earl of Glencairn\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Hamilton, 6th Earl of Abercorn\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Ker, 1st Duke of Roxburghe\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Thomas Hamilton, 6th Earl of Haddington\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Maitland, 5th Earl of Lauderdale\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Wemyss, 4th Earl of Wemyss\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Ramsay, 5th Earl of Dalhousie\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Ogilvy, 4th Earl of Findlater\n| style=\"text-align:left\" |Banffshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Leslie, 3rd Earl of Leven\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Carnegie, 4th Earl of Northesk\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Earl of Belcarras\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Douglas, 1st Earl of Forfar\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Boyd, 3rd Earl of Kilmarnock\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Keith, 1st Earl of Kintore\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Patrick Hume, 1st Earl of Marchmont\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Mackenzie, 1st Earl of Cromartie\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Primrose, 1st Earl of Rosebery\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Boyle, 1st Earl of Glasgow\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Charles Hope, 1st Earl of Hopetoun\n| style=\"text-align:left\" |LIKELY Linlithgowshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Henry Scott, 1st Earl of Deloraine\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Campbell, Earl of Illay\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Hay, Viscount Dupplin\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Forbes, 12th Lord Forbes\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Elphinstone, 8th Lord Elphinstone\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Ross, 12th Lord Ross\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Sandilands, 7th Lord Torphichen\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Lord Fraser\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Ogilvy, 3rd Lord Banff\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Murray, 4th Lord Elibank\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Kenneth Sutherland, 3rd Lord Duffus\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Rollo, 4th Lord Rollo\n| style=\"text-align:left\" |Stirlingshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Murray, Lord Philiphaugh\n| style=\"text-align:left\" |Lord Clerk Register/Selkirkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Adam Cockburn, Lord Ormiston\n| style=\"text-align:left\" |Lord Justice Clerk\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Robert Dickson of Inverask\n| style=\"text-align:left\" |Edinburghshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |William Nisbet of Dirletoun\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Cockburn, younger, of Ormestoun\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir John Swintoun of that ilk\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Alexander Campbell of Cessnock\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir William Kerr of Greenhead\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Archibald Douglas of Cavers\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |William Bennet of Grubbet\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Murray of Bowhill\n| style=\"text-align:left\" |Selkirkshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Pringle of Haining\n| style=\"text-align:left\" |Selkirkshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |William Morison of Prestongrange\n| style=\"text-align:left\" |Peeblesshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Horseburgh of that ilk\n| style=\"text-align:left\" |Peeblesshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |George Baylie of Jerviswood\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir John Johnstoun of Westerhall\n| style=\"text-align:left\" |Dumfriesshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Dowglass of Dornock\n| style=\"text-align:left\" |Dumfriesshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Stewart of Castlestewart\n| style=\"text-align:left\" |Wigtownshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Stewart of Sorbie\n| style=\"text-align:left\" |Wigtownshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Francis Montgomery of Giffan\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr William Dalrymple of Glenmuir\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Robert Stewart of Tillicultrie\n| style=\"text-align:left\" |Buteshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir Robert Pollock of that ilk\n| style=\"text-align:left\" |Renfrewshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr John Montgomery of Wrae\n| style=\"text-align:left\" |Linlithgowshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |John Halden of Glenagies\n| style=\"text-align:left\" |Perthshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Mongo Graham of Gorthie\n| style=\"text-align:left\" |Perthshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir Thomas Burnet of Leyes\n| style=\"text-align:left\" |Kincardineshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |William Seton, younger, of Pitmedden\n| style=\"text-align:left\" |Aberdeenshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Alexander Grant, younger, of that ilk\n| style=\"text-align:left\" |Inverness-shire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir William Mackenzie\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Aeneas McLeod of Cadboll\n| style=\"text-align:left\" |Cromartyshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Campbell of Mammore\n| style=\"text-align:left\" |Argyllshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir James Campbell of Auchinbreck\n| style=\"text-align:left\" |Argyllshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |James Campbell, younger, of Ardkinglass\n| style=\"text-align:left\" |Argyllshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir William Anstruther of that ilk\n| style=\"text-align:left\" |Fife\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |James Halyburton of Pitcurr\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Alexander Abercrombie of Glassoch\n| style=\"text-align:left\" |Banffshire\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr James Dunbarr, younger, of Hemprigs\n| style=\"text-align:left\" |Caithness\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Alexander Douglas of Eagleshay\n| style=\"text-align:left\" |Orkney and Shetland\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir John Bruce, 2nd Baronet\n| style=\"text-align:left\" |Kinross-shire\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Scrimsour\n| style=\"text-align:left\" |Dundee\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Lieutenant Colonel John Areskine\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Mure\n| style=\"text-align:left\" |Likely Ayr\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |James Scott\n| style=\"text-align:left\" |Montrose\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir John Anstruther, 1st Baronet, of Anstruther\n| style=\"text-align:left\" |Anstruther Easter\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Spittle\n| style=\"text-align:left\" |Inverkeithing\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Patrick Moncrieff\n| style=\"text-align:left\" |Kinghorn\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir Andrew Home\n| style=\"text-align:left\" |Kirkcudbright\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#dfd;\"|\n| style=\"text-align:left\" |Sir Peter Halket\n| style=\"text-align:left\" |Dunfermline\n| style=\"text-align:left\" |Squadrone Volante\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir James Smollet\n| style=\"text-align:left\" |Dumbarton\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Carmichell\n| style=\"text-align:left\" |Lanark\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Sutherland\n| style=\"text-align:left\" |Elgin\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Captain Daniel McLeod\n| style=\"text-align:left\" |Tain\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Sir David Dalrymple, 1st Baronet\n| style=\"text-align:left\" |Culross\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Alexander Ogilvie\n| style=\"text-align:left\" |Banff\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr John Clerk\n| style=\"text-align:left\" |Whithorn\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Ross\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Hew Dalrymple, Lord North Berwick\n| style=\"text-align:left\" |North Berwick\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Patrick Ogilvie\n| style=\"text-align:left\" |Cullen\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |George Allardyce\n| style=\"text-align:left\" |Kintore\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Avis\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr James Bethun\n| style=\"text-align:left\" |Kilrenny\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Roderick McKenzie\n| style=\"text-align:left\" |Fortrose\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Urquhart\n| style=\"text-align:left\" |Dornoch\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Daniel Campbell\n| style=\"text-align:left\" |Inveraray\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Robert Forbes\n| style=\"text-align:left\" |Inverurie\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Robert Dowglass\n| style=\"text-align:left\" |Kirkwall\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Mr Alexander Maitland\n| style=\"text-align:left\" |Inverbervie\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr George Dalrymple\n| style=\"text-align:left\" |Stranraer\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Charles Campbell\n| style=\"text-align:left\" |Campbeltown\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |Yes\n|-\n| colspan\"4\" style\n\"text-align:left; background:lightgreen;\"|Total Ayes\n| style=\"text-align:right\" |106\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Hamilton, 4th Duke of Hamilton\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Johnstone, 1st Marquess of Annandale\n| style=\"text-align:left\" |Annan\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Charles Hay, 13th Earl of Erroll\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Keith, 9th Earl Marischal\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Erskine, 9th Earl of Buchan\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Sinclair, 9th Earl of Caithness\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Fleming, 6th Earl of Wigtown\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Stewart, 5th Earl of Galloway\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Murray, 5th Viscount of Stormont\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Livingston, 3rd Viscount of Kilsyth\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Fraser, 12th Lord Saltoun\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Francis Sempill, 10th Lord Sempill\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Charles Oliphant, 7th Lord Oliphant\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Elphinstone, 4th Lord Balmerino\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Walter Stuart, 6th Lord Blantyre\n| style=\"text-align:left\" |Linlithgow\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Hamilton, 3rd Lord Bargany\n| style=\"text-align:left\" |Queensferry\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Hamilton, 2nd Lord Belhaven and Stenton\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Lord Colvill\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Patrick Kinnaird, 3rd Lord Kinnaird\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir John Lawder of Fountainhall\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Andrew Fletcher of Saltoun\n| style=\"text-align:left\" |Haddingtonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Robert Sinclair, 3rd Baronet\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Patrick Home of Rentoun\n| style=\"text-align:left\" |Berwickshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Gilbert Elliot of Minto\n| style=\"text-align:left\" |Roxburghshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Bayllie of Lamingtoun\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Sinclair, younger, of Stevensone\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Hamilton of Aikenhead\n| style=\"text-align:left\" |Lanarkshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Alexander Fergusson of Isle\n| style=\"text-align:left\" |Dumfriesshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Hugh Cathcart of Carletoun\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Brisbane, younger, of Bishoptoun\n| style=\"text-align:left\" |Ayrshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr William Cochrane of Kilmaronock\n| style=\"text-align:left\" |Dumbartonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Humphray Colquhoun of Luss\n| style=\"text-align:left\" |Dumbartonshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir John Houstoun of that ilk\n| style=\"text-align:left\" |Renfrewshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Rollo of Powhouse\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Thomas Sharp of Houstoun\n| style=\"text-align:left\" |Linlithgowshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Murray of Strowan\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Gordon of Pitlurg\n| style=\"text-align:left\" |Aberdeenshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Forbes of Colloden\n| style=\"text-align:left\" |Nairnshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Bethun of Balfour\n| style=\"text-align:left\" |Fife\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Major Henry Balfour of Dunboog\n| style=\"text-align:left\" |Fife\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Thomas Hope of Rankeillor\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Patrick Lyon of Auchterhouse\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr James Carnagie of Phinhaven\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |David Graham, younger, of Fintrie\n| style=\"text-align:left\" |Forfarshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |William Maxwell of Cardines\n| style=\"text-align:left\" |Kirkcudbrightshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander McKye of Palgown\n| style=\"text-align:left\" |Kirkcudbrightshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |James Sinclair of Stempster\n| style=\"text-align:left\" |Caithness\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir Henry Innes, younger, of that ilk\n| style=\"text-align:left\" |Elginshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr George McKenzie of Inchcoulter\n| style=\"text-align:left\" |Ross-shire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Inglis\n| style=\"text-align:left\" |Edinburgh\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Robertson\n| style=\"text-align:left\" |Perth\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Walter Stewart\n| style=\"text-align:left\" |\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#def;\"|\n| style=\"text-align:left\" |Hugh Montgomery\n| style=\"text-align:left\" |Glasgow\n| style=\"text-align:left\" |Court Party\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Edgar\n| style=\"text-align:left\" |Haddington\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Alexander Duff\n| style=\"text-align:left\" |Banffshire\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Francis Molison\n| style=\"text-align:left\" |Brechin\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Walter Scott\n| style=\"text-align:left\" |Jedburgh\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Scott\n| style=\"text-align:left\" |Selkirk\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Robert Kellie\n| style=\"text-align:left\" |Dunbar\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Hutchesone\n| style=\"text-align:left\" |Arbroath\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Archibald Scheills\n| style=\"text-align:left\" |Peebles\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr John Lyon\n| style=\"text-align:left\" |Forfar\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Brodie\n| style=\"text-align:left\" |Forres\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Spens\n| style=\"text-align:left\" |Rutherglen\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Sir David Cuningham\n| style=\"text-align:left\" |Lauder\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr John Carruthers\n| style=\"text-align:left\" |Lochmaben\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |George Home\n| style=\"text-align:left\" |New Galloway\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |John Bayne\n| style=\"text-align:left\" |Dingwall\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| style=\"background:#ddd;\"|\n| style=\"text-align:left\" |Mr Robert Fraser\n| style=\"text-align:left\" |Wick\n| style=\"text-align:left\" |\n| style=\"text-align:right\" |No\n|-\n| colspan\"4\" style\n\"text-align:left; background:pink;\"|Total Noes\n| style=\"text-align:right\" |69\n|-\n| colspan\"4\" style\n\"text-align:left; background:lightgrey;\"|Total Votes\n| style=\"text-align:right\" |175\n|-\n| style\"text-align:left\" colspan\n 5|Sources: Records of the Parliament of Scotland, [http://dbooks.bodleian.ox.ac.uk/books/PDFs/555089378.pdf Parliamentary Register, p.598]\n|}. Acts of Union 1707. http://en.wikipedia.org/?curid=2987."
  }
}
