{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16111",
  "eid" : "23c109f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778569231,
  "textBody" : "John Thomas Sayles (born September 28, 1950) is an American independent film director, screenwriter, editor, actor and novelist. He has twice been nominated for the Academy Award for Best Original Screenplay, for Passion Fish (1992) and Lone Star (1996).  His film Men with Guns (1997) was nominated for the Golden Globe for Best Foreign Language Film. His directorial debut, Return of the Secaucus 7 (1980), has been added to the National Film Registry.\n\nEarly life\n\nSayles was born in Schenectady, New York, the son of Mary (née Rausch), a teacher, and Donald John Sayles, a school administrator.[http://www.filmreference.com/film/25/John-Sayles.html John Sayles Biography (1950–)] from filmreference.com  Both of Sayles's parents were of half-Irish descent and were Catholic.[http://www.talkingpix.co.uk/Interview_John%20Sayles.html John Sayles Interview] He attended Williams College with frequent collaborators Gordon Clapp and David Strathairn.\n\nCareer\n\nLike Martin Scorsese and James Cameron, Sayles began his career working with Roger Corman. In 1979, Sayles used $30,000 he earned writing scripts for Corman to fund his first film, Return of the Secaucus 7. To make the film on a limited budget, he set the film in a large house so that he did not have to travel to or get permits for different locations, set the story over a three-day weekend to limit costume changes, and wrote about people his age so he could cast his friends in it. The film received near-unanimous critical acclaim at the time and has held its reputation. In November 1997, the National Film Preservation Board announced that Return of the Secaucus 7 would be one of the 25 films selected that year for preservation in the National Film Registry at the Library of Congress.\n\nIn 1983, after the films Baby It's You (starring Rosanna Arquette) and Lianna (a story in which a married woman becomes discontented with her marriage and falls in love with another woman), Sayles received a MacArthur Fellowship. He put the money into the fantasy The Brother from Another Planet, a film about a black, three-toed slave who escapes from another planet and after crash-landing on Earth, finds himself at home among the people of Harlem, being pursued by white male agents from his home planet dressed as Men in black.\n\nIn 1989, Sayles created and wrote the pilot episode for the short-lived television show Shannon's Deal about a down-and-out Philadelphia lawyer played by Jamey Sheridan. Sayles received a 1990 Edgar Award for his teleplay for the pilot. The show ran for 16 episodes before being cancelled in 1991.\n\nSayles has funded most of his films by writing genre scripts, such as Piranha, Alligator, The Howling and The Challenge. Having collaborated with Joe Dante on Piranha and The Howling, Sayles acted in Dante's movie, Matinee. In deciding whether to take a job, Sayles reports that he is interested mostly in whether there is the germ of an idea for a movie which he would want to watch. Sayles gets the rest of his funding by working as a script doctor; he did rewrites for Apollo 13 and Mimic.\n\nA genre script, called Night Skies, inspired what would eventually become the film E.T. the Extra-Terrestrial. That film's director, Steven Spielberg, later commissioned Sayles to write a script (unused) for the fourth Jurassic Park film.\n\nHe has written and directed his own films, including Lone Star, Passion Fish, Eight Men Out, The Secret of Roan Inish, and Matewan. He serves on the advisory board for the Austin Film Society.\n\nMaggie Renzi has been John Sayles' long-time companion (and collaborator), but they have not married. Renzi has produced most of his films since Lianna. They met as students at Williams College.\n\nSayles works with a regular repertory of actors, most notably Chris Cooper, David Strathairn, and Gordon Clapp, each of whom has appeared in at least four of his films.\n\nIn early 2003, Sayles signed the Not In Our Name \"Statement of Conscience\" (along with Noam Chomsky, Steve Earle, Brian Eno, Jesse Jackson, Viggo Mortensen, Bonnie Raitt, Oliver Stone, Marisa Tomei, Susan Sarandon and others) which opposed the invasion of Iraq.\n\nIn February 2009, Sayles was reported to be writing an HBO series based on the early life of Anthony Kiedis of the Red Hot Chili Peppers. The drama, tentatively titled Scar Tissue, centers on Kiedis's early years living in West Hollywood with his father. At that time, Kiedis's father, known as Spider, sold drugs (according to legend, his clients included The Who and Led Zeppelin) and mingled with rock stars on the Sunset Strip, all while aspiring to get into show business.[http://www.variety.com/article/VR1118000444.html Sayles red hot for HBO's 'Scar'] from Variety\n\nIn February 2010, Sayles began shooting his 17th feature film, the historical war drama Amigo, in the Philippines. The film is a fictional account of events during the Philippine–American War, with a cast that includes Joel Torre, Chris Cooper, and Garret Dillahunt.[http://www.mb.com.ph/articles/238469/joel-torre-believes-baryo-may-stir-controversy Joel Torre believes ‘Baryo’ may stir controversy]  from www.mb.com.ph\n\nHis novel A Moment in the Sun, set during the same period as Amigo, in the Philippines, Cuba, and the US, was released in 2011 by McSweeney’s. It includes an account of the Wilmington Insurrection of 1898 in North Carolina, the only coup d'état in United States history in which a duly elected government was overthrown.\n\nLegacy and honors\n\n*1983 MacArthur Fellowship \n*1990 Edgar Award, for teleplay for pilot of Shannon's Deal\n*In June 2014 Sayles donated his film archive to the University of Michigan. It will be accessible at the Harlan Hatcher Graduate Library.\n\nFilmography\n\nWriter/director\n\n*Return of the Secaucus 7 (1980)\n*Lianna (1983) \n*Baby It's You (1983) \n*The Brother from Another Planet (1984) \n*Matewan (1987) \n*Eight Men Out (1988) (Also actor portraying Ring Lardner)\n*City of Hope (1991) \n*Passion Fish (1992) \n*The Secret of Roan Inish (1994) \n*Lone Star (1996) \n*Men with Guns (1997) \n*Limbo (1999) \n*Sunshine State (2002) \n*Casa de los Babys (2003) \n*Silver City (2004) \n*Honeydripper (2007) \n*Amigo (2010) \n*Go for Sisters (2013)\n\nWriter (film)\n\n*Piranha (1978)\n*The Lady in Red (1979)\n*Alligator (1980)\n*Battle Beyond the Stars (1980)\n*The Howling (1981)\n*The Challenge (with Richard Maxwell) (1982)\n*E.T. The Extra Terrestrial – early draft (then titled \"Night Skies\")\n*Enormous Changes at the Last Minute (with Susan Rice) (1983)\n*The Clan of the Cave Bear (1986)\n*Wild Thing (1987)\n*Breaking In (1989)\n*Men of War (as \"A Safe Place\", later repolished by Ethan Reiff and Cyrus Voris) (1994)\n*Apollo 13 (1995) (uncredited)\n*The Spiderwick Chronicles (Co-writer with David Berenbaum and Karey Kirkpatrick) (2008)\n\nWriter (TV)\n\n*A Perfect Match (with Mel Damski) (1980)\n*Unnatural Causes (1986)\n*Shannon's Deal (1989) (Creator)\n\nActor (film)\n\n*In the Electric Mist (as Michael Goldman) (2009)\n\nBibliography\n\nNovels\n\n*Pride of the Bimbos (1975) (novel)\n*Union Dues (1977) (novel)\n*Los Gusanos (1991) (novel)\n*A Moment in the Sun (2011) (novel)\n\nCollections and non-fiction\n\n*The Anarchists' Convention (1979) (short story collection)\n*Thinking in Pictures: The Making of the Movie \"Matewan\" (1987) (non-fiction)\n*Dillinger in Hollywood (2004) (short story collection)\n\nMusic videos\n\n*Bruce Springsteen – \"Born in the U.S.A.\"\n*Bruce Springsteen – \"I'm on Fire\"\n*Bruce Springsteen – \"Glory Days\"\n\nAwards/nominations\n\nFilms\n\nAwards for Honeydripper:\n*Outstanding Independent or Foreign Film (Win) –  2008 NAACP Image Award\n*Outstanding Writing in a Motion Picture (Theatrical or Television) (Nominated) – John Sayles – 2008 NAACP Image Awards\n*Top 10 Independent Films of 2007 – National Board of Review of Motion Pictures\n*Best Screenplay (Win) – John Sayles – 2007 San Sebastián International Film Festival (Tied with Gracia Querejeta and David Planell for Siete mesas de billar francés (2007))\n\nAward for Silver City:\n*Golden Seashell Award for Best Film (Nominated) – John Sayles – 2004 San Sebastián International Film Festival\n\nAwards for Sunshine State:\n*Golden Orange Award (Win) – John Sayles – 2003 Florida Film Critics Circle Awards\n*Special Mention For Excellence In Filmmaking (Win) – 2002 National Board of Review\n\nAwards for Limbo:\n*Best Director Golden Space Needle Award (Win) – John Sayles −1999 Seattle International Film Festival\n*Outstanding Indies (Win) – 1999 National Board of Review\n\nAwards for Men with Guns/Hombres armados:\n*Best Foreign Independent Film (Nominated) – 1998 British Independent Film Awards\n*Best Foreign Film (Nominated) – 1999 Golden Globes\n*Peace Award (Nominated) – 1999 Political Film Society\n*FIPRESCI Prize (Win) – John Sayles – 1997 San Sebastián International Film Festival\n*OCIC Award (Win) – John Sayles – 1997 San Sebastián International Film Festival\n*Solidarity Award (Win) – John Sayles – 1997 San Sebastián International Film Festival\n*Golden Seashell Award for Best Film (Nominated) – John Sayles – 1997 San Sebastián International Film Festival\n\nAwards for Lone Star:\n*Best Original Screenplay (Nominated) – John Sayles – 1997 Academy Awards\n*Best Original Screenplay (Nominated) – John Sayles – 1997 BAFTA Awards\n*Best Screenplay, Motion Picture (Nominated) – John Sayles – 1997 Golden Globes\n*Best Screenplay Written Directly for the Screen (Nominated) – John Sayles – 1997 Writers Guild of America Award\n*Best Picture (Nominated) – 1997 Broadcast Film Critics Association Awards\n*Best Motion Picture Original Screenplay (Win) – John Sayles – 1997 Golden Satellite Awards\n*Best Motion Picture – Drama (Nominated) – Maggie Renzi & R. Paul Miller – 1997 Golden Satellite Awards\n*Best Screenplay (Nominated) – John Sayles – 1997 Independent Spirit Awards\n*Best Film (Win) – Lone Star – 1996 Lone Star Film & Television Awards\n*Best Director (Win) – John Sayles – 1996 Lone Star Film & Television Awards\n*Best Screenplay (Win) – John Sayles – 1996 Lone Star Film & Television Awards\n*Special Achievement Award for Outstanding Feature Film (Win) – 1996 NCLR Bravo Awards\n*Best Director (Win) – John Sayles – 1997 Southeastern Film Critics Association Awards\n\nAwards for The Secret of Roan Inish:\n*Best Genre Video Release (Nominated) – 1996 Academy of Science Fiction, Fantasy & Horror Films\n*International Critics Award (Win) – John Sayles – 1996 Gérardmer Film Festival\n*Best Director (Nominated) – John Sayles – 1996 Independent Spirit Awards\n*Best Screenplay (Nominated) – John Sayles – 1996 Independent Spirit Awards\n\nAwards for Passion Fish:\n*Best Original Screenplay (Nominated) – John Sayles – 1993 Academy Awards\n*Golden Spur Award (Win) – John Sayles – 1993 Flanders International Film Festival\n*Best Screenplay Written Directly for the Screen (Nominated) – John Sayles – 1993 Writers Guild of America\n\nAwards for City of Hope:\n*Critics Award (Nominated) – John Sayles – 1991 Deauville American Film Festival\n*Special Award, Democracy Award (Win) – 1992 Political Film Society\n*Tokyo Grand Prix Award (Win) – John Sayles – 1991 Tokyo International Film Festival\n\nAwards for Matewan:\n*Critics Award (Nominated) – John Sayles – 1987 Deauville American Film Festival\n*Best Director (Nominated) – John Sayles – 1988 Independent Spirit Awards\n*Best Screenplay (Nominated) – John Sayles – 1988 Independent Spirit Award\n*Human Rights Award (Win) – 1988 Political Film Society\n\nAwards for The Brother from Another Planet:\n\n*Best Screenplay Caixa de Catalunya Award (Win) – John Sayles – 1984 Catalan International Film Festival, Sitges, Spain\n*Grand Jury Prize – Dramatic (Nominated) – John Sayles – 1985 USA Film Festival (later became the Sundance Film Festival)\n\nAwards for Return of the Secaucus 7:\n*Best Independent Film (Win) – 1981 Boston Society of Film Critics Awards\n*Best Screenplay (Win) – John Sayles – 1980 Los Angeles Film Critics Association Awards\n*National Film Registry – 1997 Library of Congress, National Film Preservation Board\n*Best Comedy Written Directly for the Screen (Nominated) – John Sayles – 1981 Writers Guild of America\n*Best Screenplay (Nominated) – John Sayles – 1980 New York Film Critics Circle\n*Second Place – 1981 US Film Festival (later became the Sundance Film Festival)\n\nOther recognition\n\nSayles' first published story, \"I-80 Nebraska\", won an O. Henry Award; his novel, Union Dues, was nominated for a National Book Award as well as the National Book Critics Circle Award.\n\nIn 1983, Sayles received the John D. MacArthur Award, given to 20 Americans in diverse fields each year for their innovative work. He has also been the recipient of the Eugene V. Debs Award, the John Steinbeck Award and the John Cassavetes Award. He was honored with the Ian McLellan Hunter Award for Lifetime Achievement by the Writers Guild of America (1999).\n\nRecurring collaborators\n\nActors who have regularly worked with Sayles include Maggie Renzi, David Strathairn, Joe Morton, Chris Cooper, Mary McDonnell, Vincent Spano, Kevin Tighe, Josh Mostel, Tom Wright, Gordon Clapp and Angela Bassett.[https://www.nytimes.com/movies/person/110025/John-Sayles/biography John Sayles biography at The New York Times]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John Sayles" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16111" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Thomas Sayles (born September 28, 1950) is an American independent film director, screenwriter, editor, actor and novelist. He has twice been nominated for the Academy Award for Best Original Screenplay, for Passion Fish (1992) and Lone Star (1996).  His film Men with Guns (1997) was nominated for the Golden Globe for Best Foreign Language Film. His directorial debut, Return of the Secaucus 7 (1980), has been added to the National Film Registry.\n\nEarly life\n\nSayles was born in Schenectady, New York, the son of Mary (née Rausch), a teacher, and Donald John Sayles, a school administrator.[http://www.filmreference.com/film/25/John-Sayles.html John Sayles Biography (1950–)] from filmreference.com  Both of Sayles's parents were of half-Irish descent and were Catholic.[http://www.talkingpix.co.uk/Interview_John%20Sayles.html John Sayles Interview] He attended Williams College with frequent collaborators Gordon Clapp and David Strathairn.\n\nCareer\n\nLike Martin Scorsese and James Cameron, Sayles began his career working with Roger Corman. In 1979, Sayles used $30,000 he earned writing scripts for Corman to fund his first film, Return of the Secaucus 7. To make the film on a limited budget, he set the film in a large house so that he did not have to travel to or get permits for different locations, set the story over a three-day weekend to limit costume changes, and wrote about people his age so he could cast his friends in it. The film received near-unanimous critical acclaim at the time and has held its reputation. In November 1997, the National Film Preservation Board announced that Return of the Secaucus 7 would be one of the 25 films selected that year for preservation in the National Film Registry at the Library of Congress.\n\nIn 1983, after the films Baby It's You (starring Rosanna Arquette) and Lianna (a story in which a married woman becomes discontented with her marriage and falls in love with another woman), Sayles received a MacArthur Fellowship. He put the money into the fantasy The Brother from Another Planet, a film about a black, three-toed slave who escapes from another planet and after crash-landing on Earth, finds himself at home among the people of Harlem, being pursued by white male agents from his home planet dressed as Men in black.\n\nIn 1989, Sayles created and wrote the pilot episode for the short-lived television show Shannon's Deal about a down-and-out Philadelphia lawyer played by Jamey Sheridan. Sayles received a 1990 Edgar Award for his teleplay for the pilot. The show ran for 16 episodes before being cancelled in 1991.\n\nSayles has funded most of his films by writing genre scripts, such as Piranha, Alligator, The Howling and The Challenge. Having collaborated with Joe Dante on Piranha and The Howling, Sayles acted in Dante's movie, Matinee. In deciding whether to take a job, Sayles reports that he is interested mostly in whether there is the germ of an idea for a movie which he would want to watch. Sayles gets the rest of his funding by working as a script doctor; he did rewrites for Apollo 13 and Mimic.\n\nA genre script, called Night Skies, inspired what would eventually become the film E.T. the Extra-Terrestrial. That film's director, Steven Spielberg, later commissioned Sayles to write a script (unused) for the fourth Jurassic Park film.\n\nHe has written and directed his own films, including Lone Star, Passion Fish, Eight Men Out, The Secret of Roan Inish, and Matewan. He serves on the advisory board for the Austin Film Society.\n\nMaggie Renzi has been John Sayles' long-time companion (and collaborator), but they have not married. Renzi has produced most of his films since Lianna. They met as students at Williams College.\n\nSayles works with a regular repertory of actors, most notably Chris Cooper, David Strathairn, and Gordon Clapp, each of whom has appeared in at least four of his films.\n\nIn early 2003, Sayles signed the Not In Our Name \"Statement of Conscience\" (along with Noam Chomsky, Steve Earle, Brian Eno, Jesse Jackson, Viggo Mortensen, Bonnie Raitt, Oliver Stone, Marisa Tomei, Susan Sarandon and others) which opposed the invasion of Iraq.\n\nIn February 2009, Sayles was reported to be writing an HBO series based on the early life of Anthony Kiedis of the Red Hot Chili Peppers. The drama, tentatively titled Scar Tissue, centers on Kiedis's early years living in West Hollywood with his father. At that time, Kiedis's father, known as Spider, sold drugs (according to legend, his clients included The Who and Led Zeppelin) and mingled with rock stars on the Sunset Strip, all while aspiring to get into show business.[http://www.variety.com/article/VR1118000444.html Sayles red hot for HBO's 'Scar'] from Variety\n\nIn February 2010, Sayles began shooting his 17th feature film, the historical war drama Amigo, in the Philippines. The film is a fictional account of events during the Philippine–American War, with a cast that includes Joel Torre, Chris Cooper, and Garret Dillahunt.[http://www.mb.com.ph/articles/238469/joel-torre-believes-baryo-may-stir-controversy Joel Torre believes ‘Baryo’ may stir controversy]  from www.mb.com.ph\n\nHis novel A Moment in the Sun, set during the same period as Amigo, in the Philippines, Cuba, and the US, was released in 2011 by McSweeney’s. It includes an account of the Wilmington Insurrection of 1898 in North Carolina, the only coup d'état in United States history in which a duly elected government was overthrown.\n\nLegacy and honors\n\n*1983 MacArthur Fellowship \n*1990 Edgar Award, for teleplay for pilot of Shannon's Deal\n*In June 2014 Sayles donated his film archive to the University of Michigan. It will be accessible at the Harlan Hatcher Graduate Library.\n\nFilmography\n\nWriter/director\n\n*Return of the Secaucus 7 (1980)\n*Lianna (1983) \n*Baby It's You (1983) \n*The Brother from Another Planet (1984) \n*Matewan (1987) \n*Eight Men Out (1988) (Also actor portraying Ring Lardner)\n*City of Hope (1991) \n*Passion Fish (1992) \n*The Secret of Roan Inish (1994) \n*Lone Star (1996) \n*Men with Guns (1997) \n*Limbo (1999) \n*Sunshine State (2002) \n*Casa de los Babys (2003) \n*Silver City (2004) \n*Honeydripper (2007) \n*Amigo (2010) \n*Go for Sisters (2013)\n\nWriter (film)\n\n*Piranha (1978)\n*The Lady in Red (1979)\n*Alligator (1980)\n*Battle Beyond the Stars (1980)\n*The Howling (1981)\n*The Challenge (with Richard Maxwell) (1982)\n*E.T. The Extra Terrestrial – early draft (then titled \"Night Skies\")\n*Enormous Changes at the Last Minute (with Susan Rice) (1983)\n*The Clan of the Cave Bear (1986)\n*Wild Thing (1987)\n*Breaking In (1989)\n*Men of War (as \"A Safe Place\", later repolished by Ethan Reiff and Cyrus Voris) (1994)\n*Apollo 13 (1995) (uncredited)\n*The Spiderwick Chronicles (Co-writer with David Berenbaum and Karey Kirkpatrick) (2008)\n\nWriter (TV)\n\n*A Perfect Match (with Mel Damski) (1980)\n*Unnatural Causes (1986)\n*Shannon's Deal (1989) (Creator)\n\nActor (film)\n\n*In the Electric Mist (as Michael Goldman) (2009)\n\nBibliography\n\nNovels\n\n*Pride of the Bimbos (1975) (novel)\n*Union Dues (1977) (novel)\n*Los Gusanos (1991) (novel)\n*A Moment in the Sun (2011) (novel)\n\nCollections and non-fiction\n\n*The Anarchists' Convention (1979) (short story collection)\n*Thinking in Pictures: The Making of the Movie \"Matewan\" (1987) (non-fiction)\n*Dillinger in Hollywood (2004) (short story collection)\n\nMusic videos\n\n*Bruce Springsteen – \"Born in the U.S.A.\"\n*Bruce Springsteen – \"I'm on Fire\"\n*Bruce Springsteen – \"Glory Days\"\n\nAwards/nominations\n\nFilms\n\nAwards for Honeydripper:\n*Outstanding Independent or Foreign Film (Win) –  2008 NAACP Image Award\n*Outstanding Writing in a Motion Picture (Theatrical or Television) (Nominated) – John Sayles – 2008 NAACP Image Awards\n*Top 10 Independent Films of 2007 – National Board of Review of Motion Pictures\n*Best Screenplay (Win) – John Sayles – 2007 San Sebastián International Film Festival (Tied with Gracia Querejeta and David Planell for Siete mesas de billar francés (2007))\n\nAward for Silver City:\n*Golden Seashell Award for Best Film (Nominated) – John Sayles – 2004 San Sebastián International Film Festival\n\nAwards for Sunshine State:\n*Golden Orange Award (Win) – John Sayles – 2003 Florida Film Critics Circle Awards\n*Special Mention For Excellence In Filmmaking (Win) – 2002 National Board of Review\n\nAwards for Limbo:\n*Best Director Golden Space Needle Award (Win) – John Sayles −1999 Seattle International Film Festival\n*Outstanding Indies (Win) – 1999 National Board of Review\n\nAwards for Men with Guns/Hombres armados:\n*Best Foreign Independent Film (Nominated) – 1998 British Independent Film Awards\n*Best Foreign Film (Nominated) – 1999 Golden Globes\n*Peace Award (Nominated) – 1999 Political Film Society\n*FIPRESCI Prize (Win) – John Sayles – 1997 San Sebastián International Film Festival\n*OCIC Award (Win) – John Sayles – 1997 San Sebastián International Film Festival\n*Solidarity Award (Win) – John Sayles – 1997 San Sebastián International Film Festival\n*Golden Seashell Award for Best Film (Nominated) – John Sayles – 1997 San Sebastián International Film Festival\n\nAwards for Lone Star:\n*Best Original Screenplay (Nominated) – John Sayles – 1997 Academy Awards\n*Best Original Screenplay (Nominated) – John Sayles – 1997 BAFTA Awards\n*Best Screenplay, Motion Picture (Nominated) – John Sayles – 1997 Golden Globes\n*Best Screenplay Written Directly for the Screen (Nominated) – John Sayles – 1997 Writers Guild of America Award\n*Best Picture (Nominated) – 1997 Broadcast Film Critics Association Awards\n*Best Motion Picture Original Screenplay (Win) – John Sayles – 1997 Golden Satellite Awards\n*Best Motion Picture – Drama (Nominated) – Maggie Renzi & R. Paul Miller – 1997 Golden Satellite Awards\n*Best Screenplay (Nominated) – John Sayles – 1997 Independent Spirit Awards\n*Best Film (Win) – Lone Star – 1996 Lone Star Film & Television Awards\n*Best Director (Win) – John Sayles – 1996 Lone Star Film & Television Awards\n*Best Screenplay (Win) – John Sayles – 1996 Lone Star Film & Television Awards\n*Special Achievement Award for Outstanding Feature Film (Win) – 1996 NCLR Bravo Awards\n*Best Director (Win) – John Sayles – 1997 Southeastern Film Critics Association Awards\n\nAwards for The Secret of Roan Inish:\n*Best Genre Video Release (Nominated) – 1996 Academy of Science Fiction, Fantasy & Horror Films\n*International Critics Award (Win) – John Sayles – 1996 Gérardmer Film Festival\n*Best Director (Nominated) – John Sayles – 1996 Independent Spirit Awards\n*Best Screenplay (Nominated) – John Sayles – 1996 Independent Spirit Awards\n\nAwards for Passion Fish:\n*Best Original Screenplay (Nominated) – John Sayles – 1993 Academy Awards\n*Golden Spur Award (Win) – John Sayles – 1993 Flanders International Film Festival\n*Best Screenplay Written Directly for the Screen (Nominated) – John Sayles – 1993 Writers Guild of America\n\nAwards for City of Hope:\n*Critics Award (Nominated) – John Sayles – 1991 Deauville American Film Festival\n*Special Award, Democracy Award (Win) – 1992 Political Film Society\n*Tokyo Grand Prix Award (Win) – John Sayles – 1991 Tokyo International Film Festival\n\nAwards for Matewan:\n*Critics Award (Nominated) – John Sayles – 1987 Deauville American Film Festival\n*Best Director (Nominated) – John Sayles – 1988 Independent Spirit Awards\n*Best Screenplay (Nominated) – John Sayles – 1988 Independent Spirit Award\n*Human Rights Award (Win) – 1988 Political Film Society\n\nAwards for The Brother from Another Planet:\n\n*Best Screenplay Caixa de Catalunya Award (Win) – John Sayles – 1984 Catalan International Film Festival, Sitges, Spain\n*Grand Jury Prize – Dramatic (Nominated) – John Sayles – 1985 USA Film Festival (later became the Sundance Film Festival)\n\nAwards for Return of the Secaucus 7:\n*Best Independent Film (Win) – 1981 Boston Society of Film Critics Awards\n*Best Screenplay (Win) – John Sayles – 1980 Los Angeles Film Critics Association Awards\n*National Film Registry – 1997 Library of Congress, National Film Preservation Board\n*Best Comedy Written Directly for the Screen (Nominated) – John Sayles – 1981 Writers Guild of America\n*Best Screenplay (Nominated) – John Sayles – 1980 New York Film Critics Circle\n*Second Place – 1981 US Film Festival (later became the Sundance Film Festival)\n\nOther recognition\n\nSayles' first published story, \"I-80 Nebraska\", won an O. Henry Award; his novel, Union Dues, was nominated for a National Book Award as well as the National Book Critics Circle Award.\n\nIn 1983, Sayles received the John D. MacArthur Award, given to 20 Americans in diverse fields each year for their innovative work. He has also been the recipient of the Eugene V. Debs Award, the John Steinbeck Award and the John Cassavetes Award. He was honored with the Ian McLellan Hunter Award for Lifetime Achievement by the Writers Guild of America (1999).\n\nRecurring collaborators\n\nActors who have regularly worked with Sayles include Maggie Renzi, David Strathairn, Joe Morton, Chris Cooper, Mary McDonnell, Vincent Spano, Kevin Tighe, Josh Mostel, Tom Wright, Gordon Clapp and Angela Bassett.[https://www.nytimes.com/movies/person/110025/John-Sayles/biography John Sayles biography at The New York Times]. John Sayles. http://en.wikipedia.org/?curid=16111."
  }
}
