{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2444",
  "eid" : "c0531700-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778402416,
  "textBody" : "The conservation-restoration of cultural heritage focuses on protection and care of tangible cultural heritage, including artworks, architecture, archaeology, and museum collections.Ann Marie Sullivan, Cultural Heritage & New Media: A Future for the Past, 15 J. MARSHALL REV. INTELL. PROP. L. 604 (2016) https://repository.jmls.edu/cgi/viewcontent.cgi?article1392&context\nripl Conservation activities include preventive conservation, examination, documentation, research, treatment, and education. This field is closely allied with conservation science, curators and registrars.\n\nDefinition\n\nConservation of cultural heritage involves protection and restoration using \"any methods that prove effective in keeping that property in as close to its original condition as possible for as long as possible.\" Conservation of cultural heritage is often associated with art collections and museums and involves collection care and management through tracking, examination, documentation, exhibition, storage, preventative conservation, and restoration.Szczepanowska, Hanna M.. 2013. Conservation of cultural heritage: key principles and approaches. Routledge. .\n\nThe scope has widened from art conservation, involving protection and care of artwork and architecture, to conservation of cultural heritage, also including protection and care of a broad set of other cultural and historical works. Conservation of cultural heritage can be described as a type of ethical stewardship.\n\nConservation of cultural heritage applies simple ethical guidelines:\n* Minimal intervention;\n* Appropriate materials and reversible methods;\n* Full documentation of all work undertaken.\n\nOften there are compromises between preserving appearance, maintaining original design and material properties, and ability to reverse changes. Reversibility is now emphasized so as to reduce problems with future treatment, investigation, and use.\n\nIn order for conservators to decide upon an appropriate conservation strategy and apply their professional expertise accordingly, they must take into account views of the stakeholder, the values and meaning of the work, and the physical needs of the material.\n\nCesare Brandi in his Theory of Restoration, describes restoration as \"the methodological moment in which the work of art is appreciated in its material form and in its historical and aesthetic duality, with a view to transmitting it to the future\".[Cesare Brandi, Teoria del restauro; Rome: Edizioni di Storia e Letteratura, 1963: reprint, Turin: G. Einaudi, 1977]\n\nHistory\n\nKey dates\n\nSome consider the tradition of conservation of cultural heritage in Europe to have begun in 1565 with the restoration of the Sistine Chapel frescoes, but more ancient examples include the work of Cassiodorus.\n\nBrief history\n\nThe care of cultural heritage has a long history, one that was primarily aimed at fixing and mending objects for their continued use and aesthetic enjoyment.Pye, E, 2001. Caring for the Past: Issues in Conservation for Archaeology and Museums. London: James and James Until the early 20th century, artists were normally the ones called upon to repair damaged artworks. During the 19th century, however, the fields of science and art became increasingly intertwined as scientists such as Michael Faraday began to study the damaging effects of the environment to works of art. Louis Pasteur carried out scientific analysis on paint as well.Stoner, Joyce Hill. 2005. p. 41. [http://books.nap.edu/openbook.php?record_id11413&page\n41 “Changing Approaches in Art Conservation: 1925 to the present”] in (Sackler NAS Colloquium) Scientific Examination of Art: Modern Techniques in Conservation and Analysis. Proceedings of the National Academy of Sciences. However, perhaps the first organized attempt to apply a theoretical framework to the conservation of cultural heritage came with the founding in the United Kingdom of the Society for the Protection of Ancient Buildings in 1877. The society was founded by William Morris and Philip Webb, both of whom were deeply influenced by the writings of John Ruskin. During the same period, a French movement with similar aims was being developed under the direction of Eugène Viollet-le-Duc, an architect and theorist, famous for his restorations of medieval buildings.\n\nConservation of cultural heritage as a distinct field of study initially developed in Germany, where in 1888 Friedrich Rathgen became the first chemist to be employed by a Museum, the Koniglichen Museen, Berlin (Royal Museums of Berlin). He not only developed a scientific approach to the care of objects in the collections, but disseminated this approach by publishing a Handbook of Conservation in 1898. The early development of conservation of cultural heritage in any area of the world is usually linked to the creation of positions for chemists within museums. In the United Kingdom, pioneering research into painting materials and conservation, ceramics, and stone conservation was conducted by Arthur Pillans Laurie, academic chemist and Principal of Heriot-Watt University from 1900. Laurie's interests were fostered by William Holman Hunt. In 1924 the chemist Dr Harold Plenderleith began to work at the British Museum with Dr. Alexander Scott in the recently created Research Laboratory, although he was actually employed by the Department of Scientific and Industrial Research in the early years. Plenderleith's appointment may be said to have given birth to the conservation profession in the UK, although there had been craftsmen in many museums and in the commercial art world for generations.[https://www.britishmuseum.org/the_museum/departments/conservation_and_science/history.aspx History]. British Museum (2012-06-14). Retrieved on 2012-06-29. This department was created by the museum to address the deteriorating condition of objects in the collection, damages which were a result of their being stored in the London Underground tunnels during the First World War. The creation of this department moved the focus for the development of conservation theory and practice from Germany to Britain, and made the latter a prime force in this fledgling field. In 1956 Plenderleith wrote a significant handbook called The Conservation of Antiquities and Works of Art, which supplanted Rathgen's earlier tome and set new standards for the development of art and conservation science.\n\nIn the United States, the development of conservation of cultural heritage can be traced to the Fogg Art Museum, and Edward Waldo Forbes, its director from 1909 to 1944. He encouraged technical investigation, and was Chairman of the Advisory Committee for the first technical journal, Technical Studies in the Field of the Fine Arts, published by the Fogg from 1932 to 1942. Importantly he also brought onto the museum staff chemists. Rutherford John Gettens was the first of usch in the US to be permanently employed by an art museum. He worked with George L. Stout, the founder and first editor of Technical Studies. Gettens and Stout co-authored Painting Materials: A Short Encyclopaedia in 1942, reprinted in 1966. This compendium is still cited regularly. Only a few dates and descriptions in Gettens' and Stout's book are now outdated.Stoner, Joyce Hill. \"Changing Approaches in Art Conservation: 1925 to the present\". The publication exists in two editions. The earlier one is \"Scientific Examination of Art: Modern Techniques on Conservation and Analysis\" and was published by the National Academy of Sciences in 2003. The later edition of the publication is \"Arthur M. Sackler Colloquia: Scientific Examination of Art: Modern Techniques in Conservation and Analysis\". It was published by the National Academies Press in 2005.\n\nGeorge T. Oliver, of Oliver Brothers Art Restoration and Art Conservation-Boston\n(Est. 1850 in New York City) invented the vacuum hot table for relining paintings in 1920s; he filed a patent for the table in 1937.Patent# 2,073,802 [http://patft1.uspto.gov/netacgi/nph-Parser?Sect1PTO2&Sect2\nHITOFF&p1&u\n%2Fnetahtml%2FPTO%2Fsearch-bool.html&r1&f\nG&l50&co1\nAND&dPALL&s1\nOliver-George-T.INNM.&OSIN/Oliver-George-T&RS\nIN/Oliver-George-T U.S. \"Art of Oil Painting Restoration\"], March 16, 1937. Patft1.uspto.gov. Retrieved on 2012-06-29. Taylor's prototype table, which he designed and constructed, is still in operation. Oliver Brothers is believed to be the first and the oldest continuously operating art restoration company in the United States.\n\nThe focus of conservation development then accelerated in Britain and America, and it was in Britain that the first International Conservation Organisations developed. The International Institute for Conservation of Historic and Artistic Works (IIC) was incorporated under British law in 1950 as \"a permanent organization to co-ordinate and improve the knowledge, methods, and working standards needed to protect and preserve precious materials of all kinds.\" The rapid growth of conservation professional organizations, publications, journals, newsletters, both internationally and in localities, has spearheaded the development of the conservation profession, both practically and theoretically. Art historians and theorists such as Cesare Brandi have also played a significant role in developing conservation science theory. In recent years ethical concerns have been at the forefront of developments in conservation. Most significantly has been the idea of preventive conservation. This concept is based in part on the pioneering work by Garry Thomson CBE, and his book the Museum Environment, first published in 1978.Museum Environment (2nd Edition), 1986, by Garry Thomson CBE  Thomson was associated with the National Gallery in London; it was here that he established a set of guidelines or environmental controls for the best conditions in which objects could be stored and displayed within the museum environment. Although his exact guidelines are no longer rigidly followed, they did inspire this field of conservation.\n\nEthics\n\nThe conservator's work is guided by ethical standards. These take the form of applied ethics. Ethical standards have been established across the world, and national and international ethical guidelines have been written. One such example is:\n\n* American Institute for Conservation Code of Ethics and Guidelines for Practice [http://www.conservation-us.org/index.cfm?fuseactionpage.viewpage&pageid\n858 AIC – Code of Ethics]. Conservation-us.org. Retrieved on 2012-06-29.\n\nConservation OnLine provides resources on ethical issues in conservation,\"[http://cool.conservation-us.org/bytopic/ethics/ Ethical issues in conservation]\". Conservation OnLine (CoOL). cool.conservation-us.org. Retrieved 2017-05-29. including examples of codes of ethics and guidelines for professional conduct in conservation and allied fields; and charters and treaties pertaining to ethical issues involving the preservation of cultural property.\n\nAs well as standards of practice conservators deal with wider ethical concerns, such as the debates as to whether all art is worth preserving.\n\nCaring for cultural heritage\n\nCollections care\n\nMany cultural works are sensitive to environmental conditions such as temperature, humidity and exposure to visible light and ultraviolet radiation. These works must be protected in controlled environments where such variables are maintained within a range of damage-limiting levels. For example, watercolour paintings usually require shielding from sunlight to prevent fading of pigments.\n\nCollections care is an important element of museum policy. It is an essential responsibility of members of the museum profession to create and maintain a protective environment for the collections in their care, whether in store, on display, or in transit. A museum should carefully monitor the condition of collections to determine when an artifact requires conservation work and the services of a qualified conservator.\n\nInterventive conservation\n\nA principal aim of a cultural conservator is to reduce the rate of deterioration of an object. Both non-interventive and interventive methodologies may be employed in pursuit of this goal. Interventive conservation refers to any direct interaction between the conservator and the material fabric of the object. Interventive actions are carried out for a variety of reasons, including aesthetic choices, stabilization needs for structural integrity, or cultural requirements for intangible continuity. Examples of interventive treatments include the removal of discolored varnish from a painting, the application of wax to a sculpture, and the washing and rebinding of a book. Ethical standards within the field require that the conservator fully justify interventive actions and carry out documentation before, during, and after the treatment.\n\nOne of the guiding principles of conservation of cultural heritage has traditionally been the idea of reversibility, that all interventions with the object should be fully reversible and that the object should be able to be returned to the state in which it was prior to the conservator's intervention. Although this concept remains a guiding principle of the profession, it has been widely critiqued within the conservation professionAndrew Oddy and Sara Carroll (eds). 1999. Reversibility – Does it Exist? British Museum Occasional Paper Number 135. London: British Museum. and is now considered by many to be \"a fuzzy concept.\"p. 185. Muñoz-Viñas, Salvador. 2005. Contemporary Theory of Conservation. London: Elsevier/Butterworth Heinemann. Another important principle of conservation is that all alterations should be well documented and should be clearly distinguishable from the original object.[http://icom-cc.icom.museum/Start/ ICOM-CC] International Council of Museums Committee for Conservation]\n\nAn example of a highly publicized interventive conservation effort would be the conservation work conducted on the Sistine Chapel.\n\nConservation laboratories\n\nConservators routinely use chemical and scientific analysis for the examination and treatment of cultural works. The modern conservation laboratory uses equipment such as microscopes, spectrometers, and various x-ray regime instruments to better understand objects and their components. The data thus collected helps in deciding the conservation treatments to be provided to the object.\n\nCountry by country look\n\nUnited States\n\nHeritage Preservation, in partnership with the Institute of Museum and Library Services, a U.S. federal agency, produced The Heritage Health Index. The results of this work was the report [http://www.heritagepreservation.org/HHI/summary.html A Public Trust at Risk: The Heritage Health Index Report on the State of America's Collections], which was published in December 2005 and concluded that immediate action is needed to prevent the loss of 190 million artifacts that are in need of conservation treatment. The report made four recommendations:\n* Institutions must give priority to providing safe conditions for the collections they hold in trust.\n* Every collecting institution must develop an emergency plan to protect its collections and train staff to carry it out.\n* Every institution must assign responsibility for caring for collections to members of its staff.\n* Individuals at all levels of government and in the private sector must assume responsibility for providing the support that will allow these collections to survive.[http://www.heritagepreservation.org/HHI/ Heritage Health Index]. Heritagepreservation.org. Retrieved on 2012-06-29.\n\nUnited Kingdom\n\nIn October 2006, the Department for Culture, Media and Sport, a governmental department, authored a document: \"Understanding the Future: Priorities for England's Museums\".[http://www.culture.gov.uk/images/consultations/cons_uf_prioritiesforenglandsmuseums.pdf Understanding the Future: Priorities for England’s Museums]. Department for Culture, Media and Sport. culture.gov.uk. October 2006 This document was based on several years of consultation aimed to lay out the government's priorities for museums in the 21st century.\n\nThe document listed the following as priorities for the next decade:\n\n# Museums will fulfil their potential as learning resources (pp 7–10).\n#* Museums will be embedded into the delivery of education in every school in the country.\n#* Understanding of the effectiveness of museum education will be improved further and best practice built into education programmes.\n#* The value of museums' collections as a research resource will be well understood and better links built between the academic community and museums.\n# Museums will embrace their role in fostering, exploring, celebrating and questioning the identities of diverse communities (pp 11–14).\n#* The sector needs to work with partners in academia and beyond to create an intellectual framework supporting museums' capacity to tackle issues of identity.\n#* The museum sector must continue to develop improved practical techniques for engaging communities of all sorts.\n# Museums' collections will be more dynamic and better used (pp 15–18).\n#* Government and the sector will find new ways to encourage museums to collect actively and strategically, especially the record of contemporary society.\n#* The sector will develop new collaborative approaches to sharing and developing collections and related expertise.\n# Museums' workforces will be dynamic, highly skilled and representative (pp 17–22).\n#* Museums' governing bodies and workforces will be representative of the communities they serve.\n#* Find more varied ways for a broader range of skills to come into museums.\n#* Improve continuing professional development.\n# Museums will work more closely with each other and partners outside the sector (pp 23–26).\n#* A consistent evidence base of the contribution of all kinds of museums to the full range of public service agendas will be developed.\n#* There will be deeper and longer lasting partnerships between the national museums and a broader range of regional partners.\n#* Museums' international roles will be strengthened to improve museum programmes in this country and Britain's image, reputation and relationships abroad.\n\nThe conservation profession response to this report was on the whole less than favourable, the Institute of Conservation (ICON) published their response under the title \"A Failure of Vision\".[http://www.icon.org.uk/images/stories/icon_understanding_the_future.pdf Understanding the Future: Priorities for England’s Museums]. The Institute of Conservation. icon.org.uk It had the following to say:\n\nConcluding: \n\nFurther to this the ICON website summary report[http://www.icon.org.uk/index.php?optioncom_content&task\nview&id400&Itemid\n15 The Future of Museums: A Failure of Vision]. Icon.org.uk. Retrieved on 2012-06-29. lists the following specific recommendations:\n\n* A national survey to find out what the public want from museums, what motivates them to visit them and what makes for a rewarding visit.\n* A review of survey results and prioritisation of the various intrinsic, instrumental and institutional values to provide a clear basis for a 10-year strategy\n* HR consultants to be brought in from the commercial sector to review recruitment, career development and working practices in the national and regional museums.\n* A commitment to examine the potential for using Museum Accreditation as a more effective driver for improving recruitment, diversity, and career development across the sector.\n* DCMS to take full account of the eventual findings of the current Commons Select Committee enquiry into Care of Collections in the final version of this document\n* The adoption of those recommendations of the recent House of Lords enquiry into Science and Heritage which have a potential impact on the future of museums.\n\nIn November 2008, the UK-based think tank Demos published an influential pamphlet entitled It's a material world: caring for the public realm,\nHolden, John. and Samuel Jones. 2008. [http://demos.co.uk/files/Material%20World%20-%20web.pdf It's A Material World: Caring for the public realm]. London: Demos. in which they argue for integrating the public directly into efforts to conserve material culture, particularly that which is in the public, their argument, as stated on page 16, demonstrates their belief that society can benefit from conservation as a paradigm as well as a profession:\n\nTraining\n\nTraining in conservation of cultural heritage for many years took the form of an apprenticeship, whereby an apprentice slowly developed the necessary skills to undertake their job. For some specializations within conservation this is still the case. However, it is more common in the field of conservation today that the training required to become a practicing conservator comes from a recognized university course in conservation of cultural heritage.[http://www.conservation-us.org/training AIC – Becoming a Conservator]. Conservation-us.org. Retrieved on 2012-06-29.\n\nThe University can rarely provide all the necessary training in first hand experience that an apprenticeship can, and therefore in addition to graduate level training the profession also tends towards encouraging conservation students to spend time as an intern.\n\nConservation of cultural heritage is an interdisciplinary field as conservators have backgrounds in the fine arts, sciences (including chemistry, biology, and materials science), and closely related disciplines, such as art history, archaeology, studio art, and anthropology. They also have design, fabrication, artistic, and other special skills necessary for the practical application of that knowledge.\n\nWithin the various schools that teach conservation of cultural heritage, the approach differs according to the educational and vocational system within the country, and the focus of the school itself. This is acknowledged by the American Institute for Conservation who advise \"Specific admission requirements differ and potential candidates are encouraged to contact the programs directly for details on prerequisites, application procedures, and program curriculum\".\n\nAssociations and professional organizations\n\nSocieties devoted to the care of cultural heritage have been in existence around the world for many years. One early example is the founding in 1877 of the Society for the Protection of Ancient Buildings in Britain to protect the built heritage, this society continues to be active today.[http://www.spab.org.uk/html/what-is-spab/history-of-the-spab/ History of the SPAB]. Retrieved on 2012-06-29.\n\nThe built heritage was at the forefront of the growth of member based organizations in the United States. Preservation Virginia, founded in Richmond in 1889 as the Association for the Preservation of Virginia Antiquities, was the United States' first statewide historic preservation group.[http://www.apva.org/ APVA Preservation Virginia] . Apva.org. Retrieved on 2012-06-29.\n\nToday, professional conservators join and take part in the activities of numerous conservation associations and professional organizations with the wider field, and within their area of specialization.\n\nThese organizations exist to \"support the conservation professionals who preserve our cultural heritage\".[http://www.conservation-us.org/about About AIC – Overview]. Conservation-us.org. Retrieved on 2012-06-29.\n\nThis involves upholding professional standards, promoting research and publications, providing educational opportunities, and fostering the exchange of knowledge among cultural conservators, allied professionals, and the public.\n\nInternational cultural heritage documents\n\nExample of an archaeological discovery and restoration of a mural painting\n\nImage:St amant roche savine 3 (2).jpg|First archaeological search in the 19th-century layer by French archaeologist and restorer Yves Morvan\nImage:St amant roche savine 1 (2).jpg|Painting of the 15th century cleared before restoration\nImage:St amant roche savine 8.jpg|Painting after restoration",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Conservation-restoration of cultural heritage" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2444" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The conservation-restoration of cultural heritage focuses on protection and care of tangible cultural heritage, including artworks, architecture, archaeology, and museum collections.Ann Marie Sullivan, Cultural Heritage & New Media: A Future for the Past, 15 J. MARSHALL REV. INTELL. PROP. L. 604 (2016) https://repository.jmls.edu/cgi/viewcontent.cgi?article1392&context\nripl Conservation activities include preventive conservation, examination, documentation, research, treatment, and education. This field is closely allied with conservation science, curators and registrars.\n\nDefinition\n\nConservation of cultural heritage involves protection and restoration using \"any methods that prove effective in keeping that property in as close to its original condition as possible for as long as possible.\" Conservation of cultural heritage is often associated with art collections and museums and involves collection care and management through tracking, examination, documentation, exhibition, storage, preventative conservation, and restoration.Szczepanowska, Hanna M.. 2013. Conservation of cultural heritage: key principles and approaches. Routledge. .\n\nThe scope has widened from art conservation, involving protection and care of artwork and architecture, to conservation of cultural heritage, also including protection and care of a broad set of other cultural and historical works. Conservation of cultural heritage can be described as a type of ethical stewardship.\n\nConservation of cultural heritage applies simple ethical guidelines:\n* Minimal intervention;\n* Appropriate materials and reversible methods;\n* Full documentation of all work undertaken.\n\nOften there are compromises between preserving appearance, maintaining original design and material properties, and ability to reverse changes. Reversibility is now emphasized so as to reduce problems with future treatment, investigation, and use.\n\nIn order for conservators to decide upon an appropriate conservation strategy and apply their professional expertise accordingly, they must take into account views of the stakeholder, the values and meaning of the work, and the physical needs of the material.\n\nCesare Brandi in his Theory of Restoration, describes restoration as \"the methodological moment in which the work of art is appreciated in its material form and in its historical and aesthetic duality, with a view to transmitting it to the future\".[Cesare Brandi, Teoria del restauro; Rome: Edizioni di Storia e Letteratura, 1963: reprint, Turin: G. Einaudi, 1977]\n\nHistory\n\nKey dates\n\nSome consider the tradition of conservation of cultural heritage in Europe to have begun in 1565 with the restoration of the Sistine Chapel frescoes, but more ancient examples include the work of Cassiodorus.\n\nBrief history\n\nThe care of cultural heritage has a long history, one that was primarily aimed at fixing and mending objects for their continued use and aesthetic enjoyment.Pye, E, 2001. Caring for the Past: Issues in Conservation for Archaeology and Museums. London: James and James Until the early 20th century, artists were normally the ones called upon to repair damaged artworks. During the 19th century, however, the fields of science and art became increasingly intertwined as scientists such as Michael Faraday began to study the damaging effects of the environment to works of art. Louis Pasteur carried out scientific analysis on paint as well.Stoner, Joyce Hill. 2005. p. 41. [http://books.nap.edu/openbook.php?record_id11413&page\n41 “Changing Approaches in Art Conservation: 1925 to the present”] in (Sackler NAS Colloquium) Scientific Examination of Art: Modern Techniques in Conservation and Analysis. Proceedings of the National Academy of Sciences. However, perhaps the first organized attempt to apply a theoretical framework to the conservation of cultural heritage came with the founding in the United Kingdom of the Society for the Protection of Ancient Buildings in 1877. The society was founded by William Morris and Philip Webb, both of whom were deeply influenced by the writings of John Ruskin. During the same period, a French movement with similar aims was being developed under the direction of Eugène Viollet-le-Duc, an architect and theorist, famous for his restorations of medieval buildings.\n\nConservation of cultural heritage as a distinct field of study initially developed in Germany, where in 1888 Friedrich Rathgen became the first chemist to be employed by a Museum, the Koniglichen Museen, Berlin (Royal Museums of Berlin). He not only developed a scientific approach to the care of objects in the collections, but disseminated this approach by publishing a Handbook of Conservation in 1898. The early development of conservation of cultural heritage in any area of the world is usually linked to the creation of positions for chemists within museums. In the United Kingdom, pioneering research into painting materials and conservation, ceramics, and stone conservation was conducted by Arthur Pillans Laurie, academic chemist and Principal of Heriot-Watt University from 1900. Laurie's interests were fostered by William Holman Hunt. In 1924 the chemist Dr Harold Plenderleith began to work at the British Museum with Dr. Alexander Scott in the recently created Research Laboratory, although he was actually employed by the Department of Scientific and Industrial Research in the early years. Plenderleith's appointment may be said to have given birth to the conservation profession in the UK, although there had been craftsmen in many museums and in the commercial art world for generations.[https://www.britishmuseum.org/the_museum/departments/conservation_and_science/history.aspx History]. British Museum (2012-06-14). Retrieved on 2012-06-29. This department was created by the museum to address the deteriorating condition of objects in the collection, damages which were a result of their being stored in the London Underground tunnels during the First World War. The creation of this department moved the focus for the development of conservation theory and practice from Germany to Britain, and made the latter a prime force in this fledgling field. In 1956 Plenderleith wrote a significant handbook called The Conservation of Antiquities and Works of Art, which supplanted Rathgen's earlier tome and set new standards for the development of art and conservation science.\n\nIn the United States, the development of conservation of cultural heritage can be traced to the Fogg Art Museum, and Edward Waldo Forbes, its director from 1909 to 1944. He encouraged technical investigation, and was Chairman of the Advisory Committee for the first technical journal, Technical Studies in the Field of the Fine Arts, published by the Fogg from 1932 to 1942. Importantly he also brought onto the museum staff chemists. Rutherford John Gettens was the first of usch in the US to be permanently employed by an art museum. He worked with George L. Stout, the founder and first editor of Technical Studies. Gettens and Stout co-authored Painting Materials: A Short Encyclopaedia in 1942, reprinted in 1966. This compendium is still cited regularly. Only a few dates and descriptions in Gettens' and Stout's book are now outdated.Stoner, Joyce Hill. \"Changing Approaches in Art Conservation: 1925 to the present\". The publication exists in two editions. The earlier one is \"Scientific Examination of Art: Modern Techniques on Conservation and Analysis\" and was published by the National Academy of Sciences in 2003. The later edition of the publication is \"Arthur M. Sackler Colloquia: Scientific Examination of Art: Modern Techniques in Conservation and Analysis\". It was published by the National Academies Press in 2005.\n\nGeorge T. Oliver, of Oliver Brothers Art Restoration and Art Conservation-Boston\n(Est. 1850 in New York City) invented the vacuum hot table for relining paintings in 1920s; he filed a patent for the table in 1937.Patent# 2,073,802 [http://patft1.uspto.gov/netacgi/nph-Parser?Sect1PTO2&Sect2\nHITOFF&p1&u\n%2Fnetahtml%2FPTO%2Fsearch-bool.html&r1&f\nG&l50&co1\nAND&dPALL&s1\nOliver-George-T.INNM.&OSIN/Oliver-George-T&RS\nIN/Oliver-George-T U.S. \"Art of Oil Painting Restoration\"], March 16, 1937. Patft1.uspto.gov. Retrieved on 2012-06-29. Taylor's prototype table, which he designed and constructed, is still in operation. Oliver Brothers is believed to be the first and the oldest continuously operating art restoration company in the United States.\n\nThe focus of conservation development then accelerated in Britain and America, and it was in Britain that the first International Conservation Organisations developed. The International Institute for Conservation of Historic and Artistic Works (IIC) was incorporated under British law in 1950 as \"a permanent organization to co-ordinate and improve the knowledge, methods, and working standards needed to protect and preserve precious materials of all kinds.\" The rapid growth of conservation professional organizations, publications, journals, newsletters, both internationally and in localities, has spearheaded the development of the conservation profession, both practically and theoretically. Art historians and theorists such as Cesare Brandi have also played a significant role in developing conservation science theory. In recent years ethical concerns have been at the forefront of developments in conservation. Most significantly has been the idea of preventive conservation. This concept is based in part on the pioneering work by Garry Thomson CBE, and his book the Museum Environment, first published in 1978.Museum Environment (2nd Edition), 1986, by Garry Thomson CBE  Thomson was associated with the National Gallery in London; it was here that he established a set of guidelines or environmental controls for the best conditions in which objects could be stored and displayed within the museum environment. Although his exact guidelines are no longer rigidly followed, they did inspire this field of conservation.\n\nEthics\n\nThe conservator's work is guided by ethical standards. These take the form of applied ethics. Ethical standards have been established across the world, and national and international ethical guidelines have been written. One such example is:\n\n* American Institute for Conservation Code of Ethics and Guidelines for Practice [http://www.conservation-us.org/index.cfm?fuseactionpage.viewpage&pageid\n858 AIC – Code of Ethics]. Conservation-us.org. Retrieved on 2012-06-29.\n\nConservation OnLine provides resources on ethical issues in conservation,\"[http://cool.conservation-us.org/bytopic/ethics/ Ethical issues in conservation]\". Conservation OnLine (CoOL). cool.conservation-us.org. Retrieved 2017-05-29. including examples of codes of ethics and guidelines for professional conduct in conservation and allied fields; and charters and treaties pertaining to ethical issues involving the preservation of cultural property.\n\nAs well as standards of practice conservators deal with wider ethical concerns, such as the debates as to whether all art is worth preserving.\n\nCaring for cultural heritage\n\nCollections care\n\nMany cultural works are sensitive to environmental conditions such as temperature, humidity and exposure to visible light and ultraviolet radiation. These works must be protected in controlled environments where such variables are maintained within a range of damage-limiting levels. For example, watercolour paintings usually require shielding from sunlight to prevent fading of pigments.\n\nCollections care is an important element of museum policy. It is an essential responsibility of members of the museum profession to create and maintain a protective environment for the collections in their care, whether in store, on display, or in transit. A museum should carefully monitor the condition of collections to determine when an artifact requires conservation work and the services of a qualified conservator.\n\nInterventive conservation\n\nA principal aim of a cultural conservator is to reduce the rate of deterioration of an object. Both non-interventive and interventive methodologies may be employed in pursuit of this goal. Interventive conservation refers to any direct interaction between the conservator and the material fabric of the object. Interventive actions are carried out for a variety of reasons, including aesthetic choices, stabilization needs for structural integrity, or cultural requirements for intangible continuity. Examples of interventive treatments include the removal of discolored varnish from a painting, the application of wax to a sculpture, and the washing and rebinding of a book. Ethical standards within the field require that the conservator fully justify interventive actions and carry out documentation before, during, and after the treatment.\n\nOne of the guiding principles of conservation of cultural heritage has traditionally been the idea of reversibility, that all interventions with the object should be fully reversible and that the object should be able to be returned to the state in which it was prior to the conservator's intervention. Although this concept remains a guiding principle of the profession, it has been widely critiqued within the conservation professionAndrew Oddy and Sara Carroll (eds). 1999. Reversibility – Does it Exist? British Museum Occasional Paper Number 135. London: British Museum. and is now considered by many to be \"a fuzzy concept.\"p. 185. Muñoz-Viñas, Salvador. 2005. Contemporary Theory of Conservation. London: Elsevier/Butterworth Heinemann. Another important principle of conservation is that all alterations should be well documented and should be clearly distinguishable from the original object.[http://icom-cc.icom.museum/Start/ ICOM-CC] International Council of Museums Committee for Conservation]\n\nAn example of a highly publicized interventive conservation effort would be the conservation work conducted on the Sistine Chapel.\n\nConservation laboratories\n\nConservators routinely use chemical and scientific analysis for the examination and treatment of cultural works. The modern conservation laboratory uses equipment such as microscopes, spectrometers, and various x-ray regime instruments to better understand objects and their components. The data thus collected helps in deciding the conservation treatments to be provided to the object.\n\nCountry by country look\n\nUnited States\n\nHeritage Preservation, in partnership with the Institute of Museum and Library Services, a U.S. federal agency, produced The Heritage Health Index. The results of this work was the report [http://www.heritagepreservation.org/HHI/summary.html A Public Trust at Risk: The Heritage Health Index Report on the State of America's Collections], which was published in December 2005 and concluded that immediate action is needed to prevent the loss of 190 million artifacts that are in need of conservation treatment. The report made four recommendations:\n* Institutions must give priority to providing safe conditions for the collections they hold in trust.\n* Every collecting institution must develop an emergency plan to protect its collections and train staff to carry it out.\n* Every institution must assign responsibility for caring for collections to members of its staff.\n* Individuals at all levels of government and in the private sector must assume responsibility for providing the support that will allow these collections to survive.[http://www.heritagepreservation.org/HHI/ Heritage Health Index]. Heritagepreservation.org. Retrieved on 2012-06-29.\n\nUnited Kingdom\n\nIn October 2006, the Department for Culture, Media and Sport, a governmental department, authored a document: \"Understanding the Future: Priorities for England's Museums\".[http://www.culture.gov.uk/images/consultations/cons_uf_prioritiesforenglandsmuseums.pdf Understanding the Future: Priorities for England’s Museums]. Department for Culture, Media and Sport. culture.gov.uk. October 2006 This document was based on several years of consultation aimed to lay out the government's priorities for museums in the 21st century.\n\nThe document listed the following as priorities for the next decade:\n\n# Museums will fulfil their potential as learning resources (pp 7–10).\n#* Museums will be embedded into the delivery of education in every school in the country.\n#* Understanding of the effectiveness of museum education will be improved further and best practice built into education programmes.\n#* The value of museums' collections as a research resource will be well understood and better links built between the academic community and museums.\n# Museums will embrace their role in fostering, exploring, celebrating and questioning the identities of diverse communities (pp 11–14).\n#* The sector needs to work with partners in academia and beyond to create an intellectual framework supporting museums' capacity to tackle issues of identity.\n#* The museum sector must continue to develop improved practical techniques for engaging communities of all sorts.\n# Museums' collections will be more dynamic and better used (pp 15–18).\n#* Government and the sector will find new ways to encourage museums to collect actively and strategically, especially the record of contemporary society.\n#* The sector will develop new collaborative approaches to sharing and developing collections and related expertise.\n# Museums' workforces will be dynamic, highly skilled and representative (pp 17–22).\n#* Museums' governing bodies and workforces will be representative of the communities they serve.\n#* Find more varied ways for a broader range of skills to come into museums.\n#* Improve continuing professional development.\n# Museums will work more closely with each other and partners outside the sector (pp 23–26).\n#* A consistent evidence base of the contribution of all kinds of museums to the full range of public service agendas will be developed.\n#* There will be deeper and longer lasting partnerships between the national museums and a broader range of regional partners.\n#* Museums' international roles will be strengthened to improve museum programmes in this country and Britain's image, reputation and relationships abroad.\n\nThe conservation profession response to this report was on the whole less than favourable, the Institute of Conservation (ICON) published their response under the title \"A Failure of Vision\".[http://www.icon.org.uk/images/stories/icon_understanding_the_future.pdf Understanding the Future: Priorities for England’s Museums]. The Institute of Conservation. icon.org.uk It had the following to say:\n\nConcluding: \n\nFurther to this the ICON website summary report[http://www.icon.org.uk/index.php?optioncom_content&task\nview&id400&Itemid\n15 The Future of Museums: A Failure of Vision]. Icon.org.uk. Retrieved on 2012-06-29. lists the following specific recommendations:\n\n* A national survey to find out what the public want from museums, what motivates them to visit them and what makes for a rewarding visit.\n* A review of survey results and prioritisation of the various intrinsic, instrumental and institutional values to provide a clear basis for a 10-year strategy\n* HR consultants to be brought in from the commercial sector to review recruitment, career development and working practices in the national and regional museums.\n* A commitment to examine the potential for using Museum Accreditation as a more effective driver for improving recruitment, diversity, and career development across the sector.\n* DCMS to take full account of the eventual findings of the current Commons Select Committee enquiry into Care of Collections in the final version of this document\n* The adoption of those recommendations of the recent House of Lords enquiry into Science and Heritage which have a potential impact on the future of museums.\n\nIn November 2008, the UK-based think tank Demos published an influential pamphlet entitled It's a material world: caring for the public realm,\nHolden, John. and Samuel Jones. 2008. [http://demos.co.uk/files/Material%20World%20-%20web.pdf It's A Material World: Caring for the public realm]. London: Demos. in which they argue for integrating the public directly into efforts to conserve material culture, particularly that which is in the public, their argument, as stated on page 16, demonstrates their belief that society can benefit from conservation as a paradigm as well as a profession:\n\nTraining\n\nTraining in conservation of cultural heritage for many years took the form of an apprenticeship, whereby an apprentice slowly developed the necessary skills to undertake their job. For some specializations within conservation this is still the case. However, it is more common in the field of conservation today that the training required to become a practicing conservator comes from a recognized university course in conservation of cultural heritage.[http://www.conservation-us.org/training AIC – Becoming a Conservator]. Conservation-us.org. Retrieved on 2012-06-29.\n\nThe University can rarely provide all the necessary training in first hand experience that an apprenticeship can, and therefore in addition to graduate level training the profession also tends towards encouraging conservation students to spend time as an intern.\n\nConservation of cultural heritage is an interdisciplinary field as conservators have backgrounds in the fine arts, sciences (including chemistry, biology, and materials science), and closely related disciplines, such as art history, archaeology, studio art, and anthropology. They also have design, fabrication, artistic, and other special skills necessary for the practical application of that knowledge.\n\nWithin the various schools that teach conservation of cultural heritage, the approach differs according to the educational and vocational system within the country, and the focus of the school itself. This is acknowledged by the American Institute for Conservation who advise \"Specific admission requirements differ and potential candidates are encouraged to contact the programs directly for details on prerequisites, application procedures, and program curriculum\".\n\nAssociations and professional organizations\n\nSocieties devoted to the care of cultural heritage have been in existence around the world for many years. One early example is the founding in 1877 of the Society for the Protection of Ancient Buildings in Britain to protect the built heritage, this society continues to be active today.[http://www.spab.org.uk/html/what-is-spab/history-of-the-spab/ History of the SPAB]. Retrieved on 2012-06-29.\n\nThe built heritage was at the forefront of the growth of member based organizations in the United States. Preservation Virginia, founded in Richmond in 1889 as the Association for the Preservation of Virginia Antiquities, was the United States' first statewide historic preservation group.[http://www.apva.org/ APVA Preservation Virginia] . Apva.org. Retrieved on 2012-06-29.\n\nToday, professional conservators join and take part in the activities of numerous conservation associations and professional organizations with the wider field, and within their area of specialization.\n\nThese organizations exist to \"support the conservation professionals who preserve our cultural heritage\".[http://www.conservation-us.org/about About AIC – Overview]. Conservation-us.org. Retrieved on 2012-06-29.\n\nThis involves upholding professional standards, promoting research and publications, providing educational opportunities, and fostering the exchange of knowledge among cultural conservators, allied professionals, and the public.\n\nInternational cultural heritage documents\n\nExample of an archaeological discovery and restoration of a mural painting\n\nImage:St amant roche savine 3 (2).jpg|First archaeological search in the 19th-century layer by French archaeologist and restorer Yves Morvan\nImage:St amant roche savine 1 (2).jpg|Painting of the 15th century cleared before restoration\nImage:St amant roche savine 8.jpg|Painting after restoration. Conservation-restoration of cultural heritage. http://en.wikipedia.org/?curid=2444."
  }
}
