{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12485",
  "eid" : "02e63de0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514110,
  "textBody" : ":For various examples of cuisine, see List of German dishes.\n\nThe cuisine of Germany has evolved as a national cuisine through centuries of social and political change with variations from region to region.\n\nSome regions of Germany, like Bavaria and neighbouring Swabia, share dishes with Austrian and parts of Swiss cuisine.\n\nThe Michelin Guide of 2015 awarded eleven restaurants in Germany three stars, the highest designation, while 38 more received two stars and 233 one star. German restaurants have become the world's second-most decorated after France.\n\nHot foods\n\nMeat\n\nPork, beef, and poultry are the main varieties of meat consumed in Germany, pork being the most popular. Average annual meat consumption is 59 kg. Among poultry, chicken is most common, although duck, goose, and turkey are also consumed. Game meats, especially boar, hare, and venison are also widely available, especially in autumn and winter. Lamb and goat are less popular.\n\nMeat is usually braised; pan-fried dishes also exist, but these recipes usually originate from France and Austria. Several cooking methods used to soften tough cuts have evolved into national specialties, including Sauerbraten (sour roast), involving marinating beef, horse meat or venison in a vinegar or wine vinegar mixture over several days.\n\nA long tradition of sausage-making exists in Germany; more than 1,500 different types of sausage () are made.[http://www.foodfromgermany.org/consumer/facts/guidetosausages.cfm Guide to German Sausages & Meat Products] Most Wurst is made with natural casings of pork, sheep or lamb intestines. Among the most popular and most common are Bratwurst, usually made of ground pork and spices, the Wiener (Viennese), which may be pork or beef and is smoked and fully cooked in a water bath, and Blutwurst (blood sausage) or Schwarzwurst (black sausage) made from blood (often of pigs or geese). Thousands of types of cold cuts also are available. There are many regional specialties, such as the Münchner Weißwurst (Munich white sausage) popular in Bavaria or the Currywurst (depending on region, either a steamed pork sausage or a version of the Bratwurst, sliced and spiced with curry ketchup) popular in the metropolitan areas of Berlin, Hamburg and the Ruhr Area. Strict regulations governing what may and may not be put into them have been in force in Germany since the 13th century. In the market ordinance of Landshut in 1236, it was set down that only top-quality meat could be made into sausages.[\"Wurst\" is best: German cold cuts. (2008, 05). German Review]\n\nFish\n\nOf salt water fish, Alaska pollock is the most common. Popular freshwater fish on the German menu are trout, pike, carp, and European perch also are listed frequently.[http://www.fischinfo.de/index.php/markt/datenfakten Fish information centre fact sheet (German)] Seafood traditionally was restricted to the northern coastal areas, except for pickled herring, which often served in a Fischbrötchen, as Rollmops (a pickled herring fillet rolled into a cylindrical shape around a piece of pickled gherkin or onion), or Brathering (fried, marinated herring).\n\nToday, many sea fish, such as fresh herring, tuna, mackerel, salmon and sardines, are well established throughout the country. Prior to the industrial revolution and the ensuing pollution of the rivers, salmon were common in the rivers Rhine, Elbe, and Oder.\n\nFish fingers, known as Fischstäbchen, are a popular processed food made using a whitefish, such as cod, haddock or pollock, which has been battered or breaded.\n\nVegetables\n\nVegetables are often used in stews or vegetable soups, but are also served as side dishes. Carrots, cauliflower, turnips, spinach, peas, beans, broccoli and many types of cabbage are very common. Fried onions are a common addition to many meat dishes throughout the country. Circa 1900, carrots were sometimes roasted in water, with the broth used in place of coffee.\n\nAsparagus, especially white asparagus known in German as Spargel, is a common side dish or may be prepared as a main dish. Restaurants will sometimes devote an entire menu to nothing but white asparagus when it is in season. Spargel season ( or Spargelsaison) traditionally begins in mid-April and ends on St. John's Day (24 June).[http://www.stripes.com/military-life/germany-s-short-spargel-season-sends-asparagus-fans-to-the-trenches-1.92722 ]\n\nStructure of meals\n\nBreakfast (Frühstück) commonly consists of bread, toast, or bread rolls with butter or margarine, cold cuts, cheeses, jam (Konfitüre or more commonly called Marmelade), honey and eggs (typically boiled). Common drinks at breakfast are coffee, tea, milk, cocoa (hot or cold) or fruit juices. It is very common to eat hearty toppings at breakfast, including deli meats like ham, salted meats, salami and meat-based spreads such as Leberwurst (liver sausage),Teewurst or Mettwurst and cheeses such as Gouda, Frischkäse (cream cheese), Brie, Harzer Roller, Bergkäse and more. Most bakeries tend to sell belegte Brötchen (sandwiches from bread rolls), especially in the morning, for people on the go.\n\nTraditionally, the main meal of the day has been lunch (Mittagessen), eaten around noon. Dinner (Abendessen or Abendbrot) was always a smaller meal, often consisting only of a variety of breads, meat or sausages, cheese and some kind of vegetables, similar to breakfast, or possibly sandwiches. Smaller meals added during the day bear names such as Vesper (in the south), Brotzeit (bread time, also in the south), Kaffee und Kuchen (, literally for ″coffee and cake″), or Kaffeetrinken. It is a very German custom and comparable with the English Five-o'clock-Tea. It takes time between lunch and dinner, often on Sundays with the entire family.\n\nHowever, in Germany, as in other parts of Europe, dining habits have changed over the last 50 years. Today, many people eat only a small meal in the middle of the day at work, often also a second breakfast, and enjoy a hot dinner in the evening at home with the whole family.\n\nFor others, the traditional way of eating is still rather common, not only in rural areas. Breakfast is still very popular and may be elaborate and extended on weekends, with friends invited as guests; the same holds for coffee and cake. Since the 1990s, the Sunday brunch has also become common, especially in city cafés.\n\nSide dishes\n\nNoodles, made from wheat flour and egg, are usually thicker than the Italian flat pasta. Especially in the southwestern part of the country, the predominant variety of noodles are Spätzle, made with a large number of eggs, and Maultaschen, traditional stuffed noodles reminiscent of ravioli.\n\nBesides noodles, potatoes are common. Potatoes entered the German cuisine in the late 17th century, and were almost ubiquitous in the 19th century and since.  They most often are boiled (in salt water, ), but mashed ( or Kartoffelbrei) and pan-roasted potatoes () also are traditional. French fries, called ,  (spoken as \"Pom fritz\" or, respectively, \"Pommes\", deviating from the French pronunciation which would be \"Pom freet\" or \"Pom\") or regionally as  in German, are a common style of fried potatoes; they are traditionally offered with either ketchup or mayonnaise, or, as  (lit. fries red/white), with both.\n\nAlso common are dumplings (including Klöße as the term in the north or Knödel as the term in the south) and in southern Germany potato noodles, including Schupfnudeln, which are similar to Italian gnocchi.\n\nSalads, also modern variations, as well as vegetarian dishes become more and more popular in Germany.\n\nSpices and condiments\n\nWith the exception of mustard for sausages, German dishes are rarely hot and spicy; the most popular herbs are traditionally parsley, thyme, laurel, chives, black pepper (used in small amounts), juniper berries, nutmeg, and caraway. Cardamom, anise seed, and cinnamon are often used in sweet cakes or beverages associated with Christmas time, and sometimes in the preparation of sausages, but are otherwise rare in German meals. Other herbs and spices, such as basil, sage, oregano, and hot chili peppers, have become popular since the early 80´s. Fresh dill is very common in a green salad or fish fillet.\n\nMustard (Senf) is a very common accompaniment to sausages and can vary in strength, the most common version being Mittelscharf (medium hot), which is somewhere between traditional English and French mustards in strength. Düsseldorf, similar to French's Deli Mustard with a taste that is very different from Dijon, and the surrounding area are known for its particularly spicy mustard, which is used both as a table condiment and in local dishes such as Senfrostbraten (pot roast with mustard). In the southern parts of the country, a sweet variety of mustard is made which is almost exclusively served with the Bavarian speciality Weißwurst. German mustard is usually considerably less acidic than American varieties.\n\nHorseradish is commonly used as a condiment either on its own served as a paste, enriched with cream (Sahnemeerrettich), or combined with mustard. In some regions of Germany, it is used with meats and sausages where mustard would otherwise be used. Its use in Germany has been documented to the 16th century, when it was used as medicine, and as a food, whereby its leaves were consumed as a vegetable.\n\nGarlic has never played a large role in traditional German cuisine,\n as it was long frowned upon for causing bad breath, but has risen in popularity in recent decades due to the influence of French, Italian, Spanish, Portuguese, Greek, and Turkish cuisines. Bear's garlic, a rediscovered spice from earlier centuries, has become quite popular again since the 1990s.\n\nDesserts\n\nA wide variety of cakes, tarts and pastries are served throughout the country, most commonly made with fresh fruit. Apples, plums, strawberries, and cherries are used regularly in cakes. Cheesecake is also very popular, often made with quark. Schwarzwälder Kirschtorte (Black Forest cake, made with cherries) is probably the most well-known example of a wide variety of typically German tortes filled with whipped or butter cream.\n\nGerman doughnuts (which have no hole) are usually balls of yeast dough with jam or other fillings, and are known as Berliner, Pfannkuchen (in Berlin and Eastern Germany), Kreppel or Krapfen, depending on the region. Eierkuchen or Pfannkuchen are large (usually around 20–24 cm in diameter), and relatively thin (~5mm) pancakes, comparable to the French crêpes. They are served covered with sugar, jam or syrup. Salty variants with cheese, ground meat or bacon exist as well as variants with apple slices baked in (called Apfelpfannkuchen, literally for apple pancakes), but they are usually considered to be main dishes rather than desserts. In some regions, Eierkuchen are filled and then wrapped; in others, they are cut into small pieces and arranged in a heap (called Kaiserschmarrn, often including raisins baked in). The word Pfannkuchen means pancake in most parts of Germany.\n\nA popular dessert in northern Germany is Rote Grütze, red fruit pudding, which is made with black and red currants, raspberries and sometimes strawberries or cherries cooked in juice with corn starch as a thickener. It is traditionally served with cream, but also is served with vanilla sauce, milk or whipped cream. Rhabarbergrütze (rhubarb pudding) and Grüne Grütze (gooseberry fruit pudding) are variations of the Rote Grütze. A similar dish, Obstkaltschale, may also be found all around Germany.\n\nIce cream and sorbets are also very popular. Italian-run ice cream parlours were the first large wave of foreign-run eateries in Germany, which began around the mid 1850s, becoming widespread in the 1920s. Spaghettieis, which resembles spaghetti, tomato sauce, and ground cheese on a plate, is a popular ice cream dessert.\n\nHolidays\n\nIn Germany, roasted goose is a staple for Christmas Eve and Christmas Day meals. It is sometimes replaced with European carp, particularly in Southern areas. The carp is cut into pieces, coated in breadcrumbs and fried in fat. Common side dishes are potato salad, cucumber salad or potatoes.\n\nAnother very common dish in Christian German culture is Würstchen mit Kartoffelsalat, sausage (mostly Wiener Würstchen) with potato salad.\n\nIn recent years, raclette became known as a Christmas dish, too. While originating in Switzerland the dish has been adapted in wide regions of Germany.\n\nFile:Schoko-Osterhase IMGP1551 smial wp.jpg|Chocolate Easter Bunny \nFile:Juravolksfest Neumarkt 2013 - 021.JPG|Oktoberfest Gingerbread\nChristmas-goose-(Weihnachtsgans) 1.jpg|Roasted Christmas goose \nFile:Cookies - Till Westermayer.jpg|Christmas cookies\nFile:Rotkaeppchen Sekt Riesling Trocken.jpg|New Year Sekt\n\nBread\n\nBread (Brot) is a significant part of German cuisine, with the largest bread diversity in the world. Around 200 types of breads and 1,200 different types of pastries and rolls are produced in about 17,000 bakeries and another 10,000 in-shop bakeries.\n\nBread is served usually for breakfast (often replaced by bread rolls) and in the evening as (open) sandwiches, but rarely as a side dish for the main meal (popular, for example, with Eintopf or soup). The importance of bread in German cuisine is also illustrated by words such as Abendbrot (meaning supper, literally evening bread) and Brotzeit (snack, literally bread time).  In fact, one of the major complaints of the German expatriates in many parts of the world is their inability to find acceptable local breads.\n\nRegarding bread, German cuisine is more varied than that of either Eastern or Western Europe. Bread types range from white wheat bread (Weißbrot) to grey (Graubrot) to black (Schwarzbrot), actually dark brown rye bread. Some breads contain both wheat and rye flour (hence Mischbrot, mixed bread), and often also wholemeal and whole seeds such as linseed, sunflower seed, or pumpkin seed (Vollkornbrot). Darker, rye-dominated breads, such as Vollkornbrot or Schwarzbrot, are typical of German cuisine. Pumpernickel, a steamed, sweet-tasting bread, is internationally well known, although not representative of German black bread as a whole. Most German breads are made with sourdough. Whole grain is also preferred for high fiber. Germans use almost all available types of grain for their breads: wheat, rye, barley, spelt, oats, millet, corn and rice. Some breads are even made with potato starch flour.\n\nGermany's most popular breads are Rye-wheat (Roggenmischbrot), Toast bread (Toastbrot), Whole-grain (Vollkornbrot), Wheat-rye (Weizenmischbrot), White bread (Weißbrot), Multigrain, usually wheat-rye-oats with sesame or linseed (Mehrkornbrot), Rye (Roggenbrot), Sunflower seeds in dark rye bread (Sonnenblumenkernbrot), Pumpkin seeds in dark rye bread (Kürbiskernbrot) and Roasted onions in light wheat-rye bread (Zwiebelbrot).\n\nBread rolls\n\nBread rolls, known in Germany as Brötchen, which is a diminutive of Brot, with regional linguistic varieties being Semmel (in South Germany), Schrippe (especially in Berlin), Rundstück (in the North and Hamburg) or Weck, Weckle, Weckli, or Wecken (in Baden-Württemberg, Switzerland and parts of Southern Hesse), are common in German cuisine. A typical serving is a roll cut in half, and spread with butter or margarine. Cheese, honey, jam, Nutella, meats such as ham, fish, or preserves are then placed between the two halves, or on each half separately, known as a belegtes Brötchen.\n\nRolls are also used for snacks, or as a hotdog-style roll for Bratwurst, Brätel, Fleischkäse or Schwenker/Schwenkbraten.\n\nFranzbrötchen, which originated in the area of Hamburg, is the small, sweet pastry roll baked with butter and cinnamon.\n\nBeverages\n\nAlcoholic drinks\n\nBeer is very common throughout all parts of Germany, with many local and regional breweries producing a wide variety of beers. The pale lager pilsener, a style developed in the mid-19th century, is predominant in most parts of the country today, whereas wheat beer (Weißbier/Weizen) and other types of lager are common, especially in Bavaria. A number of regions have local specialties, many of which, like Weißbier, are more traditionally brewed ales. Among these are Altbier, a dark beer available around Düsseldorf and the lower Rhine, Kölsch, a similar style, but light in color, in the Cologne area, and the low-alcohol Berliner Weiße, a sour beer made in Berlin that is often mixed with raspberry or woodruff syrup. Since the reunification of 1990, Schwarzbier, which was common in East Germany, but could hardly be found in West Germany, has become increasingly popular in Germany as a whole. Beer may also be mixed with other beverages such as pils or lager and carbonated lemonade: Radler (lit: cyclist), Alsterwasser (lit: water from the river Alster).\n\nSince a beer tax law was changed in 1993, many breweries served this trend of mixing beer with other drinks by selling bottles of pre-mixed beverages. Examples are Bibob (by Köstritzer), Veltins V+, Mixery (by Karlsberg), Dimix (by Diebels) and Cab (by Krombacher).\n\nWine is also popular throughout the country. German wine comes predominantly from the areas along the upper and middle Rhine and its tributaries. Riesling and Silvaner are among the best-known varieties of white wine, while Spätburgunder and Dornfelder are important German red wines. The sweet German wines sold in English-speaking countries seem mostly to cater to the foreign market, as they are rare in Germany.\n\nKorn, a German spirit made from malt (wheat, rye or barley), is consumed predominantly in the middle and northern parts of Germany. Obstler, on the other hand, distilled from apples and pears (Obstler), plums, cherries (Kirschwasser), or mirabelle plums, is preferred in the southern parts. The term Schnaps refers to both kinds of hard liquors.\n\nAll cold drinks in bars and restaurants are sold in glasses with a calibration mark (Eichstrich)[http://www.vg-dudenhofen.de/vg_dudenhofen/daten/Schankgefaesse.pdf Merkblatt über Schankgefäße - Eichrechtliche Vorschriften (instruction sheet regarding calibration of drinking vessels) ] that is frequently checked by the Eichamt (~ Bureau of Weights and Measures) to ensure the guest is getting as much as is offered in the menu.\n\nNon-alcoholic drinks\n\nCoffee is also very common, not only for breakfast, but also accompanying a piece of cake (Kaffee und Kuchen) in the afternoon, usually on Sundays or special occasions and birthdays. It is generally filter coffee, which is weaker than espresso. Coffeeshops are also very common in Germany. Tea is more common in the northwest. East Frisians traditionally have their tea with cream and rock candy (Kluntje).\n\nPopular soft drinks include Schorle, juice or wine mixed with sparkling mineral water, with Apfelschorle being popular all over Germany, and Spezi, made with cola and an orange-flavored drink such as Fanta. Germans are unique among their neighbors in preferring bottled, carbonated mineral water, either plain (Sprudel) or flavored (usually lemon) to noncarbonated ones.\n\nDrinking water of excellent quality is available everywhere and at any time in Germany. Water provided by the public water utilities can be had without hesitation directly from the tap. Usually no chlorine is added. Drinking water is controlled by state authority to ensure it is potable. Regulations are even stricter than those for bottled water (see Trinkwasserverordnung).\n\nRegional cuisine\n\nGerman regional cuisine can be divided into many varieties such as Bavarian cuisine (southern Germany) or Thuringian (central Germany) and Lower Saxon cuisine.[http://www.food-links.com/countries/germany/german-regional-food-specialties.php \"German Regional Food Specialties.\"] [http://www.food-links.com Food-links.com]. Accessed July 2011.\n\nBaden-Württemberg\n\nDue to the physiogeographically situation, the Upper Rhine Plain with Germany's warmest climate, fruitful volcanic soils, already in the Roman period used medicinal springs and spas with very good infrastructural features, the proximity to France and Switzerland Baden had better prerequisites to develop a high quality gastronomy than Württemberg or Bavaria. Special plant crops such as tobacco, wine, fruit and horticulture are of supranational importance and offer the inhabitants and visitors a diverse and wide selection of local products. Asparagus and chestnuts are as skillfully used in the kitchen as tripe and escargot and a variety of fruity desserts and pastries is provided for the traditional German \"Kaffee und Kuchen\" (lit. \"coffee and cake\", similar to the British tea time). Nationwide this region features the highest density of star-rated restaurants, similar to the neighbouring region Alsace which does the same for France.\n\nBavaria\n\nThe Bavarian dukes, especially the Wittelsbach family, developed Bavarian cuisine and refined it to be presentable to the royal court. This cuisine has belonged to wealthy households, especially in cities, since the 19th century. The (old) Bavarian cuisine is closely connected to Czech cuisine and Austrian cuisine (especially from Tyrol and Salzburg), mainly through the Wittelsbach and Habsburg families. Already in the beginning, Bavarians were closely connected to their neighbours in Austria through linguistic, cultural and political similarities, which also reflected on the cuisine.\n\nA characteristic Bavarian cuisine was further developed by both groups, with a distinct similarity to Franconian and Swabian cuisine. A Bavarian speciality is the Brotzeit, a savoury snack, which would originally be eaten between breakfast and lunch.\n\nBavaria is a part of Southeastern Germany, including the city of Munich and spreading to board with the countries Austria and the Czech Republic. The region is located at higher elevations, and is known for yielding beet and potato crops and also for the production of fine beers.\n\nHamburg\n\nDue to its century-old history as a harbour town, the traditional cuisine of Hamburg is very diversified and sapid as ingredients’ supply was safe. Until the 20th century, it was predominantly characterized by the extensive choice of different kinds of fish from the river Elbe and the quick access to both the North Sea and the Baltic Sea, both being roughly 100 kilometers away from the city center. The neighboring regions did supply the city state with fresh vegetables, fruit came mainly from a region called Altes Land just southwest of Hamburg and until industrialization, the neighbourhood of Wilhelmsburg was considered the ‘milk isle’ of Hamburg.\n\nInternational trade made spices and exotic nutrition items from Asia and South America available since the 16th century which were soon incorporated into civic kitchens. On this basis, the cuisine of Hamburg developed its characteristics nowadays due to the supraregional harmonization of the Northern German and Scandinavian cuisine. Due to its high economic importance Hamburg, does feature many internationally recognized gourmet restaurants: 11 of them were awarded with a Michelin star in 2010.[http://www.hamburg-magazin.de/gastl_bewertung.htm Hamburg wieder die Hochburg der Sterneköche.] Retrieved, 12 February 2010)\n\nHesse\n\nPalatinate/Pfalz\n\nThuringia\n\nWheat, grapeseed, sugarbeets, and barley grow well, along with a variety of vegetables, which grow near Erfurt, the state's capital. Cauliflower [740 acre], cabbage (savoy, red, white) [25 acre], kohlrabi [37 acre], and broccoli [37 acre] grow by traditional means near Erfurt. Tomatoes, lettuce, broad beans, onions, and cucumbers are grown in the eastern portion of the region near Jena under glass centers on about 12 acre of land.  Thuringia is the second-largest herb-growing region in Germany; the town of Kölleda was once considered the \"peppermint town\", where herb growers used to congregate to study herb cultivation.Metzger, 13,19.\n\nOne-third of Thuringia is covered in forest, and is considered to be one of the best game-hunting regions in Germany.  Anyone holding a valid hunting license[http://berlin.angloinfo.com/countries/germany/hunting.asp Hunting in Germany] and a local hunting permit for the area may hunt for game such as red deer, roe deer, wild boar, rabbit, duck, and mouflon (mountain sheep). Pheasant and capercaillie are protected game species that may not be hunted.  The wooded areas also contain a wide variety of edible mushrooms, such as chestnut mushrooms, porcini, and chanterelles, along with wild berries, such as blueberries, cranberries, raspberries, and blackberries, which are all traditional accompaniments to game dishes.Metzger, 20.\n\nThe most famous foods from Thuringia are Thuringian sausages and Thuringian dumplings. The state is also known for its sausages; steamed, scaled, and cured varieties are all prepared.  Popular varieties include Thüringer Mettwurst (a spreadable cured sausage), Feldkieker (a cured, air-dried sausage dried up to eight months), Thüringer Leberwurst (a steamed pork and liver sausage), Thüringer Rotwurst (a steamed blood sausage packed in a bladder or other natural casing)Metzger, 22-25. and Mett (minced pork).\n\nSaxony\n\nIn general the cuisine is very hearty and features many peculiarities of central Germany such as a great variety of sauces which accompany the main dish and the fashion to serve Klöße\" or Knödel as a side dish instead of potatoes, pasta or rice. Also much freshwater fish is used in Saxon cuisine, particularly carp and trout as is the case throughout Eastern Europe.\n\nThe rich history of the region did and still does influence the cuisine. In the blossoming and growing cities of Dresden and Leipzig an extravagant style of cuisine is cherished (one may only think of the crab as an ingredient in the famous Leipziger Allerlei). Other regions where the people had to work really hard to yield some harvest and were really poor like in the Erzgebirge peasant dishes play a major role and famous dishes originating there are e.g. potatoes with Quark, potato soup or potato with bread and linseed oil. Also in the region Vogtland there were many peasants but they were wealthier and that's why in this region the Sunday roast is a tradition that is nowadays still lived up to.\n\nCereal grain cultivation occupies 62% of the cultivated land in Saxony-Anhalt. Wheat, barley, oats, and rye are grown, with the rye being grown near Borde, where it is used to make Burger Knäckebrot, a flatbread produced there since 1931. Another 10% of the cultivated area is planted in sugar beets for conversion to sugar, popularized after the 19th century, when the region had an economic boom.Metzger, 49.\n\nInternational influences\n\nThe first wave of foreigners coming to Germany specifically to sell their food specialties were ice cream makers from northern Italy, who started to arrive in noticeable numbers during the late 1920s. With the post-World War II contacts with Allied occupation troops, and especially with the influx of more and more foreign workers that began during the second half of the 1950s, many foreign dishes have been adopted into German cuisine — Italian dishes, such as spaghetti and pizza, have become staples of the German diet. In 2008, there were around 9,000 pizzerias and 7,000 Italian restaurants in Germany. The pizza is Germany's favourite fast food.[http://www.rp-online.de/gesundheit/news/die-beliebtesten-fast-food-gerichte-1.569000 rp-online.de]\n\nTurkish immigrants have introduced Turkish foods to Germany, notably döner kebab. In November 2017, it was estimated that 1,500 döner kebab shops were present in Berlin. Chinese, Vietnamese, Greek and Balkan restaurants are also widespread in Germany.\n\nBefore 1990, the cuisine from Eastern Germany (1949-1990) was influenced by Russian, Polish, Bulgarian  and other countries of the Communist bloc. East Germans traveled abroad to these countries on holiday, and soldiers coming to East Germany from these countries brought their dishes with them. A typical dish that came to the East German kitchen this way is Soljanka.\n\nIndian, Vietnamese, Thai, and other Asian cuisines are rapidly gaining in popularity since the early 2000s. Until the late 1990s many of the more expensive restaurants served mostly French inspired dishes for decades. Since the end of the 1990s, they have been shifting to a more refined form of German cuisine.\n\nFood industry \n\nGermany is third largest agricultural producer in the European Union and the third largest agricultural exporter in the world. In 2013, German food exports were worth around EUR 66 billion.[https://www.bmel.de/EN/Agriculture/Market-Trade-Export/_Texte/Zahlen-Fakten-Agrarexport.html Facts and figures on German agricultural exports] Federal Ministry of Food and Agriculture Several food products are internationally known brands.\n\nFile:Gummi Bears in Action 55.JPG|Gummy bears\nFile:Jägermeister.jpg|Liqueur\nFile:Dinkelbrezelchen.jpg|Mini pretzels\nFile:Ritter Sport - english.png|Chocolate\nFile:German Marzipan Lübecker Vielfalt.jpg|Lübecker Marzipan",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "German cuisine" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12485" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : ":For various examples of cuisine, see List of German dishes.\n\nThe cuisine of Germany has evolved as a national cuisine through centuries of social and political change with variations from region to region.\n\nSome regions of Germany, like Bavaria and neighbouring Swabia, share dishes with Austrian and parts of Swiss cuisine.\n\nThe Michelin Guide of 2015 awarded eleven restaurants in Germany three stars, the highest designation, while 38 more received two stars and 233 one star. German restaurants have become the world's second-most decorated after France.\n\nHot foods\n\nMeat\n\nPork, beef, and poultry are the main varieties of meat consumed in Germany, pork being the most popular. Average annual meat consumption is 59 kg. Among poultry, chicken is most common, although duck, goose, and turkey are also consumed. Game meats, especially boar, hare, and venison are also widely available, especially in autumn and winter. Lamb and goat are less popular.\n\nMeat is usually braised; pan-fried dishes also exist, but these recipes usually originate from France and Austria. Several cooking methods used to soften tough cuts have evolved into national specialties, including Sauerbraten (sour roast), involving marinating beef, horse meat or venison in a vinegar or wine vinegar mixture over several days.\n\nA long tradition of sausage-making exists in Germany; more than 1,500 different types of sausage () are made.[http://www.foodfromgermany.org/consumer/facts/guidetosausages.cfm Guide to German Sausages & Meat Products] Most Wurst is made with natural casings of pork, sheep or lamb intestines. Among the most popular and most common are Bratwurst, usually made of ground pork and spices, the Wiener (Viennese), which may be pork or beef and is smoked and fully cooked in a water bath, and Blutwurst (blood sausage) or Schwarzwurst (black sausage) made from blood (often of pigs or geese). Thousands of types of cold cuts also are available. There are many regional specialties, such as the Münchner Weißwurst (Munich white sausage) popular in Bavaria or the Currywurst (depending on region, either a steamed pork sausage or a version of the Bratwurst, sliced and spiced with curry ketchup) popular in the metropolitan areas of Berlin, Hamburg and the Ruhr Area. Strict regulations governing what may and may not be put into them have been in force in Germany since the 13th century. In the market ordinance of Landshut in 1236, it was set down that only top-quality meat could be made into sausages.[\"Wurst\" is best: German cold cuts. (2008, 05). German Review]\n\nFish\n\nOf salt water fish, Alaska pollock is the most common. Popular freshwater fish on the German menu are trout, pike, carp, and European perch also are listed frequently.[http://www.fischinfo.de/index.php/markt/datenfakten Fish information centre fact sheet (German)] Seafood traditionally was restricted to the northern coastal areas, except for pickled herring, which often served in a Fischbrötchen, as Rollmops (a pickled herring fillet rolled into a cylindrical shape around a piece of pickled gherkin or onion), or Brathering (fried, marinated herring).\n\nToday, many sea fish, such as fresh herring, tuna, mackerel, salmon and sardines, are well established throughout the country. Prior to the industrial revolution and the ensuing pollution of the rivers, salmon were common in the rivers Rhine, Elbe, and Oder.\n\nFish fingers, known as Fischstäbchen, are a popular processed food made using a whitefish, such as cod, haddock or pollock, which has been battered or breaded.\n\nVegetables\n\nVegetables are often used in stews or vegetable soups, but are also served as side dishes. Carrots, cauliflower, turnips, spinach, peas, beans, broccoli and many types of cabbage are very common. Fried onions are a common addition to many meat dishes throughout the country. Circa 1900, carrots were sometimes roasted in water, with the broth used in place of coffee.\n\nAsparagus, especially white asparagus known in German as Spargel, is a common side dish or may be prepared as a main dish. Restaurants will sometimes devote an entire menu to nothing but white asparagus when it is in season. Spargel season ( or Spargelsaison) traditionally begins in mid-April and ends on St. John's Day (24 June).[http://www.stripes.com/military-life/germany-s-short-spargel-season-sends-asparagus-fans-to-the-trenches-1.92722 ]\n\nStructure of meals\n\nBreakfast (Frühstück) commonly consists of bread, toast, or bread rolls with butter or margarine, cold cuts, cheeses, jam (Konfitüre or more commonly called Marmelade), honey and eggs (typically boiled). Common drinks at breakfast are coffee, tea, milk, cocoa (hot or cold) or fruit juices. It is very common to eat hearty toppings at breakfast, including deli meats like ham, salted meats, salami and meat-based spreads such as Leberwurst (liver sausage),Teewurst or Mettwurst and cheeses such as Gouda, Frischkäse (cream cheese), Brie, Harzer Roller, Bergkäse and more. Most bakeries tend to sell belegte Brötchen (sandwiches from bread rolls), especially in the morning, for people on the go.\n\nTraditionally, the main meal of the day has been lunch (Mittagessen), eaten around noon. Dinner (Abendessen or Abendbrot) was always a smaller meal, often consisting only of a variety of breads, meat or sausages, cheese and some kind of vegetables, similar to breakfast, or possibly sandwiches. Smaller meals added during the day bear names such as Vesper (in the south), Brotzeit (bread time, also in the south), Kaffee und Kuchen (, literally for ″coffee and cake″), or Kaffeetrinken. It is a very German custom and comparable with the English Five-o'clock-Tea. It takes time between lunch and dinner, often on Sundays with the entire family.\n\nHowever, in Germany, as in other parts of Europe, dining habits have changed over the last 50 years. Today, many people eat only a small meal in the middle of the day at work, often also a second breakfast, and enjoy a hot dinner in the evening at home with the whole family.\n\nFor others, the traditional way of eating is still rather common, not only in rural areas. Breakfast is still very popular and may be elaborate and extended on weekends, with friends invited as guests; the same holds for coffee and cake. Since the 1990s, the Sunday brunch has also become common, especially in city cafés.\n\nSide dishes\n\nNoodles, made from wheat flour and egg, are usually thicker than the Italian flat pasta. Especially in the southwestern part of the country, the predominant variety of noodles are Spätzle, made with a large number of eggs, and Maultaschen, traditional stuffed noodles reminiscent of ravioli.\n\nBesides noodles, potatoes are common. Potatoes entered the German cuisine in the late 17th century, and were almost ubiquitous in the 19th century and since.  They most often are boiled (in salt water, ), but mashed ( or Kartoffelbrei) and pan-roasted potatoes () also are traditional. French fries, called ,  (spoken as \"Pom fritz\" or, respectively, \"Pommes\", deviating from the French pronunciation which would be \"Pom freet\" or \"Pom\") or regionally as  in German, are a common style of fried potatoes; they are traditionally offered with either ketchup or mayonnaise, or, as  (lit. fries red/white), with both.\n\nAlso common are dumplings (including Klöße as the term in the north or Knödel as the term in the south) and in southern Germany potato noodles, including Schupfnudeln, which are similar to Italian gnocchi.\n\nSalads, also modern variations, as well as vegetarian dishes become more and more popular in Germany.\n\nSpices and condiments\n\nWith the exception of mustard for sausages, German dishes are rarely hot and spicy; the most popular herbs are traditionally parsley, thyme, laurel, chives, black pepper (used in small amounts), juniper berries, nutmeg, and caraway. Cardamom, anise seed, and cinnamon are often used in sweet cakes or beverages associated with Christmas time, and sometimes in the preparation of sausages, but are otherwise rare in German meals. Other herbs and spices, such as basil, sage, oregano, and hot chili peppers, have become popular since the early 80´s. Fresh dill is very common in a green salad or fish fillet.\n\nMustard (Senf) is a very common accompaniment to sausages and can vary in strength, the most common version being Mittelscharf (medium hot), which is somewhere between traditional English and French mustards in strength. Düsseldorf, similar to French's Deli Mustard with a taste that is very different from Dijon, and the surrounding area are known for its particularly spicy mustard, which is used both as a table condiment and in local dishes such as Senfrostbraten (pot roast with mustard). In the southern parts of the country, a sweet variety of mustard is made which is almost exclusively served with the Bavarian speciality Weißwurst. German mustard is usually considerably less acidic than American varieties.\n\nHorseradish is commonly used as a condiment either on its own served as a paste, enriched with cream (Sahnemeerrettich), or combined with mustard. In some regions of Germany, it is used with meats and sausages where mustard would otherwise be used. Its use in Germany has been documented to the 16th century, when it was used as medicine, and as a food, whereby its leaves were consumed as a vegetable.\n\nGarlic has never played a large role in traditional German cuisine,\n as it was long frowned upon for causing bad breath, but has risen in popularity in recent decades due to the influence of French, Italian, Spanish, Portuguese, Greek, and Turkish cuisines. Bear's garlic, a rediscovered spice from earlier centuries, has become quite popular again since the 1990s.\n\nDesserts\n\nA wide variety of cakes, tarts and pastries are served throughout the country, most commonly made with fresh fruit. Apples, plums, strawberries, and cherries are used regularly in cakes. Cheesecake is also very popular, often made with quark. Schwarzwälder Kirschtorte (Black Forest cake, made with cherries) is probably the most well-known example of a wide variety of typically German tortes filled with whipped or butter cream.\n\nGerman doughnuts (which have no hole) are usually balls of yeast dough with jam or other fillings, and are known as Berliner, Pfannkuchen (in Berlin and Eastern Germany), Kreppel or Krapfen, depending on the region. Eierkuchen or Pfannkuchen are large (usually around 20–24 cm in diameter), and relatively thin (~5mm) pancakes, comparable to the French crêpes. They are served covered with sugar, jam or syrup. Salty variants with cheese, ground meat or bacon exist as well as variants with apple slices baked in (called Apfelpfannkuchen, literally for apple pancakes), but they are usually considered to be main dishes rather than desserts. In some regions, Eierkuchen are filled and then wrapped; in others, they are cut into small pieces and arranged in a heap (called Kaiserschmarrn, often including raisins baked in). The word Pfannkuchen means pancake in most parts of Germany.\n\nA popular dessert in northern Germany is Rote Grütze, red fruit pudding, which is made with black and red currants, raspberries and sometimes strawberries or cherries cooked in juice with corn starch as a thickener. It is traditionally served with cream, but also is served with vanilla sauce, milk or whipped cream. Rhabarbergrütze (rhubarb pudding) and Grüne Grütze (gooseberry fruit pudding) are variations of the Rote Grütze. A similar dish, Obstkaltschale, may also be found all around Germany.\n\nIce cream and sorbets are also very popular. Italian-run ice cream parlours were the first large wave of foreign-run eateries in Germany, which began around the mid 1850s, becoming widespread in the 1920s. Spaghettieis, which resembles spaghetti, tomato sauce, and ground cheese on a plate, is a popular ice cream dessert.\n\nHolidays\n\nIn Germany, roasted goose is a staple for Christmas Eve and Christmas Day meals. It is sometimes replaced with European carp, particularly in Southern areas. The carp is cut into pieces, coated in breadcrumbs and fried in fat. Common side dishes are potato salad, cucumber salad or potatoes.\n\nAnother very common dish in Christian German culture is Würstchen mit Kartoffelsalat, sausage (mostly Wiener Würstchen) with potato salad.\n\nIn recent years, raclette became known as a Christmas dish, too. While originating in Switzerland the dish has been adapted in wide regions of Germany.\n\nFile:Schoko-Osterhase IMGP1551 smial wp.jpg|Chocolate Easter Bunny \nFile:Juravolksfest Neumarkt 2013 - 021.JPG|Oktoberfest Gingerbread\nChristmas-goose-(Weihnachtsgans) 1.jpg|Roasted Christmas goose \nFile:Cookies - Till Westermayer.jpg|Christmas cookies\nFile:Rotkaeppchen Sekt Riesling Trocken.jpg|New Year Sekt\n\nBread\n\nBread (Brot) is a significant part of German cuisine, with the largest bread diversity in the world. Around 200 types of breads and 1,200 different types of pastries and rolls are produced in about 17,000 bakeries and another 10,000 in-shop bakeries.\n\nBread is served usually for breakfast (often replaced by bread rolls) and in the evening as (open) sandwiches, but rarely as a side dish for the main meal (popular, for example, with Eintopf or soup). The importance of bread in German cuisine is also illustrated by words such as Abendbrot (meaning supper, literally evening bread) and Brotzeit (snack, literally bread time).  In fact, one of the major complaints of the German expatriates in many parts of the world is their inability to find acceptable local breads.\n\nRegarding bread, German cuisine is more varied than that of either Eastern or Western Europe. Bread types range from white wheat bread (Weißbrot) to grey (Graubrot) to black (Schwarzbrot), actually dark brown rye bread. Some breads contain both wheat and rye flour (hence Mischbrot, mixed bread), and often also wholemeal and whole seeds such as linseed, sunflower seed, or pumpkin seed (Vollkornbrot). Darker, rye-dominated breads, such as Vollkornbrot or Schwarzbrot, are typical of German cuisine. Pumpernickel, a steamed, sweet-tasting bread, is internationally well known, although not representative of German black bread as a whole. Most German breads are made with sourdough. Whole grain is also preferred for high fiber. Germans use almost all available types of grain for their breads: wheat, rye, barley, spelt, oats, millet, corn and rice. Some breads are even made with potato starch flour.\n\nGermany's most popular breads are Rye-wheat (Roggenmischbrot), Toast bread (Toastbrot), Whole-grain (Vollkornbrot), Wheat-rye (Weizenmischbrot), White bread (Weißbrot), Multigrain, usually wheat-rye-oats with sesame or linseed (Mehrkornbrot), Rye (Roggenbrot), Sunflower seeds in dark rye bread (Sonnenblumenkernbrot), Pumpkin seeds in dark rye bread (Kürbiskernbrot) and Roasted onions in light wheat-rye bread (Zwiebelbrot).\n\nBread rolls\n\nBread rolls, known in Germany as Brötchen, which is a diminutive of Brot, with regional linguistic varieties being Semmel (in South Germany), Schrippe (especially in Berlin), Rundstück (in the North and Hamburg) or Weck, Weckle, Weckli, or Wecken (in Baden-Württemberg, Switzerland and parts of Southern Hesse), are common in German cuisine. A typical serving is a roll cut in half, and spread with butter or margarine. Cheese, honey, jam, Nutella, meats such as ham, fish, or preserves are then placed between the two halves, or on each half separately, known as a belegtes Brötchen.\n\nRolls are also used for snacks, or as a hotdog-style roll for Bratwurst, Brätel, Fleischkäse or Schwenker/Schwenkbraten.\n\nFranzbrötchen, which originated in the area of Hamburg, is the small, sweet pastry roll baked with butter and cinnamon.\n\nBeverages\n\nAlcoholic drinks\n\nBeer is very common throughout all parts of Germany, with many local and regional breweries producing a wide variety of beers. The pale lager pilsener, a style developed in the mid-19th century, is predominant in most parts of the country today, whereas wheat beer (Weißbier/Weizen) and other types of lager are common, especially in Bavaria. A number of regions have local specialties, many of which, like Weißbier, are more traditionally brewed ales. Among these are Altbier, a dark beer available around Düsseldorf and the lower Rhine, Kölsch, a similar style, but light in color, in the Cologne area, and the low-alcohol Berliner Weiße, a sour beer made in Berlin that is often mixed with raspberry or woodruff syrup. Since the reunification of 1990, Schwarzbier, which was common in East Germany, but could hardly be found in West Germany, has become increasingly popular in Germany as a whole. Beer may also be mixed with other beverages such as pils or lager and carbonated lemonade: Radler (lit: cyclist), Alsterwasser (lit: water from the river Alster).\n\nSince a beer tax law was changed in 1993, many breweries served this trend of mixing beer with other drinks by selling bottles of pre-mixed beverages. Examples are Bibob (by Köstritzer), Veltins V+, Mixery (by Karlsberg), Dimix (by Diebels) and Cab (by Krombacher).\n\nWine is also popular throughout the country. German wine comes predominantly from the areas along the upper and middle Rhine and its tributaries. Riesling and Silvaner are among the best-known varieties of white wine, while Spätburgunder and Dornfelder are important German red wines. The sweet German wines sold in English-speaking countries seem mostly to cater to the foreign market, as they are rare in Germany.\n\nKorn, a German spirit made from malt (wheat, rye or barley), is consumed predominantly in the middle and northern parts of Germany. Obstler, on the other hand, distilled from apples and pears (Obstler), plums, cherries (Kirschwasser), or mirabelle plums, is preferred in the southern parts. The term Schnaps refers to both kinds of hard liquors.\n\nAll cold drinks in bars and restaurants are sold in glasses with a calibration mark (Eichstrich)[http://www.vg-dudenhofen.de/vg_dudenhofen/daten/Schankgefaesse.pdf Merkblatt über Schankgefäße - Eichrechtliche Vorschriften (instruction sheet regarding calibration of drinking vessels) ] that is frequently checked by the Eichamt (~ Bureau of Weights and Measures) to ensure the guest is getting as much as is offered in the menu.\n\nNon-alcoholic drinks\n\nCoffee is also very common, not only for breakfast, but also accompanying a piece of cake (Kaffee und Kuchen) in the afternoon, usually on Sundays or special occasions and birthdays. It is generally filter coffee, which is weaker than espresso. Coffeeshops are also very common in Germany. Tea is more common in the northwest. East Frisians traditionally have their tea with cream and rock candy (Kluntje).\n\nPopular soft drinks include Schorle, juice or wine mixed with sparkling mineral water, with Apfelschorle being popular all over Germany, and Spezi, made with cola and an orange-flavored drink such as Fanta. Germans are unique among their neighbors in preferring bottled, carbonated mineral water, either plain (Sprudel) or flavored (usually lemon) to noncarbonated ones.\n\nDrinking water of excellent quality is available everywhere and at any time in Germany. Water provided by the public water utilities can be had without hesitation directly from the tap. Usually no chlorine is added. Drinking water is controlled by state authority to ensure it is potable. Regulations are even stricter than those for bottled water (see Trinkwasserverordnung).\n\nRegional cuisine\n\nGerman regional cuisine can be divided into many varieties such as Bavarian cuisine (southern Germany) or Thuringian (central Germany) and Lower Saxon cuisine.[http://www.food-links.com/countries/germany/german-regional-food-specialties.php \"German Regional Food Specialties.\"] [http://www.food-links.com Food-links.com]. Accessed July 2011.\n\nBaden-Württemberg\n\nDue to the physiogeographically situation, the Upper Rhine Plain with Germany's warmest climate, fruitful volcanic soils, already in the Roman period used medicinal springs and spas with very good infrastructural features, the proximity to France and Switzerland Baden had better prerequisites to develop a high quality gastronomy than Württemberg or Bavaria. Special plant crops such as tobacco, wine, fruit and horticulture are of supranational importance and offer the inhabitants and visitors a diverse and wide selection of local products. Asparagus and chestnuts are as skillfully used in the kitchen as tripe and escargot and a variety of fruity desserts and pastries is provided for the traditional German \"Kaffee und Kuchen\" (lit. \"coffee and cake\", similar to the British tea time). Nationwide this region features the highest density of star-rated restaurants, similar to the neighbouring region Alsace which does the same for France.\n\nBavaria\n\nThe Bavarian dukes, especially the Wittelsbach family, developed Bavarian cuisine and refined it to be presentable to the royal court. This cuisine has belonged to wealthy households, especially in cities, since the 19th century. The (old) Bavarian cuisine is closely connected to Czech cuisine and Austrian cuisine (especially from Tyrol and Salzburg), mainly through the Wittelsbach and Habsburg families. Already in the beginning, Bavarians were closely connected to their neighbours in Austria through linguistic, cultural and political similarities, which also reflected on the cuisine.\n\nA characteristic Bavarian cuisine was further developed by both groups, with a distinct similarity to Franconian and Swabian cuisine. A Bavarian speciality is the Brotzeit, a savoury snack, which would originally be eaten between breakfast and lunch.\n\nBavaria is a part of Southeastern Germany, including the city of Munich and spreading to board with the countries Austria and the Czech Republic. The region is located at higher elevations, and is known for yielding beet and potato crops and also for the production of fine beers.\n\nHamburg\n\nDue to its century-old history as a harbour town, the traditional cuisine of Hamburg is very diversified and sapid as ingredients’ supply was safe. Until the 20th century, it was predominantly characterized by the extensive choice of different kinds of fish from the river Elbe and the quick access to both the North Sea and the Baltic Sea, both being roughly 100 kilometers away from the city center. The neighboring regions did supply the city state with fresh vegetables, fruit came mainly from a region called Altes Land just southwest of Hamburg and until industrialization, the neighbourhood of Wilhelmsburg was considered the ‘milk isle’ of Hamburg.\n\nInternational trade made spices and exotic nutrition items from Asia and South America available since the 16th century which were soon incorporated into civic kitchens. On this basis, the cuisine of Hamburg developed its characteristics nowadays due to the supraregional harmonization of the Northern German and Scandinavian cuisine. Due to its high economic importance Hamburg, does feature many internationally recognized gourmet restaurants: 11 of them were awarded with a Michelin star in 2010.[http://www.hamburg-magazin.de/gastl_bewertung.htm Hamburg wieder die Hochburg der Sterneköche.] Retrieved, 12 February 2010)\n\nHesse\n\nPalatinate/Pfalz\n\nThuringia\n\nWheat, grapeseed, sugarbeets, and barley grow well, along with a variety of vegetables, which grow near Erfurt, the state's capital. Cauliflower [740 acre], cabbage (savoy, red, white) [25 acre], kohlrabi [37 acre], and broccoli [37 acre] grow by traditional means near Erfurt. Tomatoes, lettuce, broad beans, onions, and cucumbers are grown in the eastern portion of the region near Jena under glass centers on about 12 acre of land.  Thuringia is the second-largest herb-growing region in Germany; the town of Kölleda was once considered the \"peppermint town\", where herb growers used to congregate to study herb cultivation.Metzger, 13,19.\n\nOne-third of Thuringia is covered in forest, and is considered to be one of the best game-hunting regions in Germany.  Anyone holding a valid hunting license[http://berlin.angloinfo.com/countries/germany/hunting.asp Hunting in Germany] and a local hunting permit for the area may hunt for game such as red deer, roe deer, wild boar, rabbit, duck, and mouflon (mountain sheep). Pheasant and capercaillie are protected game species that may not be hunted.  The wooded areas also contain a wide variety of edible mushrooms, such as chestnut mushrooms, porcini, and chanterelles, along with wild berries, such as blueberries, cranberries, raspberries, and blackberries, which are all traditional accompaniments to game dishes.Metzger, 20.\n\nThe most famous foods from Thuringia are Thuringian sausages and Thuringian dumplings. The state is also known for its sausages; steamed, scaled, and cured varieties are all prepared.  Popular varieties include Thüringer Mettwurst (a spreadable cured sausage), Feldkieker (a cured, air-dried sausage dried up to eight months), Thüringer Leberwurst (a steamed pork and liver sausage), Thüringer Rotwurst (a steamed blood sausage packed in a bladder or other natural casing)Metzger, 22-25. and Mett (minced pork).\n\nSaxony\n\nIn general the cuisine is very hearty and features many peculiarities of central Germany such as a great variety of sauces which accompany the main dish and the fashion to serve Klöße\" or Knödel as a side dish instead of potatoes, pasta or rice. Also much freshwater fish is used in Saxon cuisine, particularly carp and trout as is the case throughout Eastern Europe.\n\nThe rich history of the region did and still does influence the cuisine. In the blossoming and growing cities of Dresden and Leipzig an extravagant style of cuisine is cherished (one may only think of the crab as an ingredient in the famous Leipziger Allerlei). Other regions where the people had to work really hard to yield some harvest and were really poor like in the Erzgebirge peasant dishes play a major role and famous dishes originating there are e.g. potatoes with Quark, potato soup or potato with bread and linseed oil. Also in the region Vogtland there were many peasants but they were wealthier and that's why in this region the Sunday roast is a tradition that is nowadays still lived up to.\n\nCereal grain cultivation occupies 62% of the cultivated land in Saxony-Anhalt. Wheat, barley, oats, and rye are grown, with the rye being grown near Borde, where it is used to make Burger Knäckebrot, a flatbread produced there since 1931. Another 10% of the cultivated area is planted in sugar beets for conversion to sugar, popularized after the 19th century, when the region had an economic boom.Metzger, 49.\n\nInternational influences\n\nThe first wave of foreigners coming to Germany specifically to sell their food specialties were ice cream makers from northern Italy, who started to arrive in noticeable numbers during the late 1920s. With the post-World War II contacts with Allied occupation troops, and especially with the influx of more and more foreign workers that began during the second half of the 1950s, many foreign dishes have been adopted into German cuisine — Italian dishes, such as spaghetti and pizza, have become staples of the German diet. In 2008, there were around 9,000 pizzerias and 7,000 Italian restaurants in Germany. The pizza is Germany's favourite fast food.[http://www.rp-online.de/gesundheit/news/die-beliebtesten-fast-food-gerichte-1.569000 rp-online.de]\n\nTurkish immigrants have introduced Turkish foods to Germany, notably döner kebab. In November 2017, it was estimated that 1,500 döner kebab shops were present in Berlin. Chinese, Vietnamese, Greek and Balkan restaurants are also widespread in Germany.\n\nBefore 1990, the cuisine from Eastern Germany (1949-1990) was influenced by Russian, Polish, Bulgarian  and other countries of the Communist bloc. East Germans traveled abroad to these countries on holiday, and soldiers coming to East Germany from these countries brought their dishes with them. A typical dish that came to the East German kitchen this way is Soljanka.\n\nIndian, Vietnamese, Thai, and other Asian cuisines are rapidly gaining in popularity since the early 2000s. Until the late 1990s many of the more expensive restaurants served mostly French inspired dishes for decades. Since the end of the 1990s, they have been shifting to a more refined form of German cuisine.\n\nFood industry \n\nGermany is third largest agricultural producer in the European Union and the third largest agricultural exporter in the world. In 2013, German food exports were worth around EUR 66 billion.[https://www.bmel.de/EN/Agriculture/Market-Trade-Export/_Texte/Zahlen-Fakten-Agrarexport.html Facts and figures on German agricultural exports] Federal Ministry of Food and Agriculture Several food products are internationally known brands.\n\nFile:Gummi Bears in Action 55.JPG|Gummy bears\nFile:Jägermeister.jpg|Liqueur\nFile:Dinkelbrezelchen.jpg|Mini pretzels\nFile:Ritter Sport - english.png|Chocolate\nFile:German Marzipan Lübecker Vielfalt.jpg|Lübecker Marzipan. German cuisine. http://en.wikipedia.org/?curid=12485."
  }
}
