{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15513",
  "eid" : "1ccdb620-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778557570,
  "textBody" : "Islamic eschatology is the branch of Islamic theology concerning the end of the world, and the \"Day of resurrection\" after that, known as Yawm al-Qiyāmah (,, \"the Day of Resurrection\") or Yawm ad-Dīn (,, \"the Day of Judgment\"). when the annihilation of all life will be followed by its resurrection and judgment by Allah. When al-Qiyamah will happen is not specified, but according to prophecy there are major and minor signs that will foretell its coming. Many verses in the Quran mention the Last Judgment.\n\nThe main subject of Surat al-Qiyama is the resurrection. The Great Tribulation is described in the hadith and commentaries of the ulama, including al-Ghazali, Ibn Kathir, Ibn Majah, Muhammad al-Bukhari, and Ibn Khuzaymah. The Day of Judgment is also known as the Day of Reckoning, the Last Day, and the Hour (al-sā'ah).\n\nThe hadith are more specific than the Quran, and describe twelve major signs of al-Qiyamah. At the time of judgment, terrible corruption and chaos will rule. Isa (Jesus) and the Mahdi are central characters in events near the time. The Mahdi will have established a seven-year rule in Medina at which time Jesus will descend from Heaven and battle Masih ad-Dajjal (the Antichrist in Islam). The Mahdi and Jesus will triumph and liberate Islam from cruelty. These events will be followed by a time of serenity when people live according to religious values.\n\nLike other Abrahamic religions, Islam teaches that there will be a resurrection of the dead followed by a final tribulation and eternal division of the righteous and wicked. Islamic apocalyptic literature describing Armageddon is often known as fitna, Al-Malhama Al-Kubra (The Great Massacre) or ghaybah in Shī'a Islam. The righteous are rewarded with the pleasures of Jannah (Paradise), while the unrighteous are punished in Jahannam (Hell).\n\nArticles of faith\n\nThe Day of Judgment, al-Qiyāmah, (also known as the Day of Reckoning or Resurrection, the Last Day, or the Hour) is one of the six articles of faith in Sunni Islam, and one of seven in Shia Islam.\n\nSources\n\nTwo main sources in Islamic scripture discuss the Last Judgment and the tribulation associated with it: the Quran, which is viewed in Islam as infallible, and the hadith, or sayings of the prophet. Hadith are viewed with more flexibility due to the late compilation of the sayings in written form, two hundred years after the death of Muhammad. The Last Judgment and the tribulation have also been discussed in the commentaries of ulama such as al-Ghazali, Ibn Kathir, and Muhammad al-Bukhari.\n\nLast Judgment in the Quran\n\nInterpretations of the Quran yield the following specifics:\n# The time is known only to Allah.\n# Even Muhammad cannot bring it forward.\n# Those who have been dead, when resurrected, will believe that a short time has passed between death and resurrection. \n#Nothing will remain except Allah. Allah will resurrect all, even if they have turned to stone or iron.\n# Those that have accepted false deities will suffer in the afterlife.\n\nResurrection theories\n\nAlthough Islamic philosophers and scholars were in general agreement on a bodily resurrection after death, however their opinions differ in regard what bodily resurrection will be like. Some of the theories are the following:\n* The return to the same material body, someone had during lifetime, that will be restored.Joseph Hell Die Religion des Islam Motilal Banarsidass Publishe 1915 page 201\n* Conjunction of the soul with a Mithali body, which is congenial to the worlds of Barzakh and the Akhirah.Zailan Moris Revelation, Intellectual Intuition and Reason in the Philosophy of Mulla Sadra: An Analysis of the al-hikmah al-'arshiyyah Routledge  page 107\n* Resurrection with a Hurqaliyati body, accordingly a second invisible body, that survives death.Juan Cole Sacred Space And Holy War: The Politics, Culture and History of Shi'ite Islam I.B.Tauris 2002  page 55\n\nSigns of the End time\n\nIn Islam, a number of major and minor signs foretell the end of days. There is debate over whether they could occur concurrently or must be at different points in time, although Islamic scholars typically divide them into three major periods.\n\n#Sexual immorality appears among people to such an extent that they commit it openly, except that they will be afflicted by plagues and diseases unknown to their forefathers;\n#People cheat in weights and measures (business, trades, etc.) and are stricken with famine, calamity, and oppression as a result;\n#They withhold charity and hoard their wealth, and rain is withheld from the sky from them; there is rain only for animals;\n#They break their covenant with God and His Messenger and God enables their enemies to overpower them and take some of what is in their hands;\n#God causes those who do not live according to His book to fight among themselves.Sunan Ibn Maajah 4019\n\nMinor signs\n\n#The coming of fitna (tribulations) and removal of khushoo' (fearfulness of God, taqwah, reverence, etc.)Sahih Muslim, Book 1, Hadith 0213\n#The coming of 30 Dajjals, each one of them presuming himself an apostle of God.Dawud, Book 37, Hadith 4319\n#A person passing by a grave might say to another: I wish it were my abode.Sahih Muslim, Book 41, Hadith 6947\n#The loss of honesty, and authority put in the hands of those who do not deserve it.Sahih Bukhari, Volume 8, Book 076, Hadith 503\n#The loss of knowledge and the prevalence of religious ignorance.Sahih Bukhari Volume 1, Book 3, Hadith Number 81\n#Frequent, sudden, and unexpected deaths.Sahih Muslim Book 41, Hadith 7040\n#Increase in pointless killings.Sahih Bukhari Volume 9, Book 88, Number 184\n#Acceleration of time.Imam Ahmed, recorded in Muslim\n#Rejection of Hadith.Abu Dawud Book 35, Hadith 4587\n#The spread of riba (usury, interest), zina (adultery, fornication), and the drinking of alcohol.Sahih Muslim Book 41, Hadith 7015\n#Widespread acceptance of music.Sahih Bukhari Volume 7, Book 69, Hadith 494\n#Pride and competition in the decoration of mosques.Sahih ibn Majah 610\n#Women will increase in number and men will decrease in number so much so that fifty women will be looked after by one man.Sahih Bukhari Volume 1, Book 3, Hadith 81\n#Abundance of earthquakes.Sahih Bukhari Volume 9, Book 88, Hadith Number 237\n#Frequent occurrences of disgrace, distortion, and defamation.Al-Adab Al-Mufrad 485, Book 1, Hadith 3\n#When people wish to die because of the severe trials and tribulations that they are suffering.Sahih Bukhari Volume 9, Book 88, Hadith Number 231\n#Jews fighting Muslims.Sahih Musim Book 41, Hadith Number 6985\n#When paying charity becomes a burden.Sahih Bukhari Volume 009, Book 088, Hadith Number 236\n#Nomads will compete in the construction of very tall buildings.Sahih Bukhari Volume 009, Book 088, Hadith Number 237\n#Women will appear naked despite their being dressed.Sahih Muslim Book 40, Hadith Number 6840\n#People will seek knowledge from misguided and straying scholars.Musnad Imam Ahmad (no.21,334 and no.21,335\n#Liars will be believed, honest people disbelieved, and faithful people called traitors.Sunan At-Tirmidhi 2209\n#The death of righteous, knowledgeable people.Sahih Bukhari Volume 1, Book 3, Hadith Number 81\n#The emergence of indecency (obscenity) and enmity among relatives and neighbours.Musnad Ahmad\n#The rise of idolatry and polytheists in the community.Abu-Dawud, Book 30, Number 4239 (and others)\n#The Euphrates will uncover a mountain of gold.Sahih Muslim Book 041, Hadith Number 6918\n#The land of the Arabs will return to being a land of rivers and fields.Sahih Muslim Book 5, Hadith 2208\n#The Romans will form a majority amongst people.Sahih Muslim Book 041, Hadith Number 6925\n#People will increasingly earn money by unlawful (Haram) ways.Al-Bukhari \n#There will be much rain but little vegetation.Reported by Anas and declared Sahih by Hasan al Albani\n#Evil people will be expelled from Al-Madinah.Sahih Muslim Book 7, Hadith Number 3188\n#Wild animals will communicate with humans, and humans will communicate with objects.Musnad Ahmad\n#Lightning and thunder will become more prevalent.Ahmad\n#There will be a special greeting for people of distinction.Musnad Ahmad\n#Trade will become so widespread that a woman will help her husband in business.Musnad Ahmad\n#No truly honest man will remain and no one will be trusted.Sahih Bukhari\n#Only the worst people will be left; they will not know any good nor forbid any evil (i.e. No one will say there is no God but Allah).Ahmad\n#Nations will call each other to destroy Islam by any and every means.Musnad Ahmad\n#Islamic knowledge will be passed on, but no one will follow it correctly.Tirmidhee 2653 and Ibn Maajah 4048\n#Muslim rulers will come who do not follow the guidance and tradition of the Sunnah. Some of their men will have the hearts of devils in a human body.Sahih Muslim 1847\n#Stinginess will become more widespread and honorable people will perish.Mujamma'uz-Zawaa'id 7/327\n#A man will obey his wife and disobey his mother, and treat his friend kindly while shunning his father.Sunan al-Tirmidhi\n#Voices will be raised in the mosques.Sunan al-Tirmidhi\n#The leader of a people will be the worst of them.Sunan al-Tirmidhi\n#People will treat a man with respect because they fear the evil he could do.Sunan al-Tirmidhi\n#Much wine will be drunk.Sunan al-Tirmidhi\n# Muslims shall fight against a nation who wear shoes made of hair and with faces like hammered shields, with red complexions and small eyes.Sahih Muslim, Book 41, Hadith 6960\n# The emergence of the Sufyani within the Syria region.Sahih Muslim, Book 41, Hadith 6926\n# The truce and joint Roman-Muslim campaign against a common enemy, followed by al-Malhama al-Kubra (Armageddon), a Roman vs. Muslim war.Narrated with sound chains from Dhu Mikhbar al-Najashi by Abu Dawud, Ahmad, Ibn Majah, Ibn Hibban, and al-Hakim who declared it sahih and al-Dhahabi concurred. See Shaykh Shu`ayb Arna'ut's documentation of this hadith in his edition of Sahih Ibn Hibban (15:101-103 #6708-6709).\n#The Black Standard will come from Khorasan, nothing shall turn them back until it is planted in Jerusalem.Sunan At-Tirmidhi 2269 (Weak) https://muflihun.com/tirmidhi/31/2269\n# Quran will be forgotten and no one will recall its verses.\n# All Islamic knowledge will be lost to the extent that people will not say \"La Illaha Ila Allah\" (There is no God, but Allah), but instead old people will babble without understanding, \"Allah, Allah\".\n# People will fornicate in the streets \"like donkeys\".\n# The first trumpet blow will be sounded by Israfil, all that is in heaven and earth will be stunned and die except what God wills, and silence will envelop everything for forty undetermined periods of time.\n# There will be disagreement concerning succession. Then a man will emerge from Madina. He will hurry to Makkah, and the people of Makkah will come out to him and urge him and try to force him to accept the Bai'aa.The Promised Deliverer (Kitab Al-Mahdi) Dawud : Book 36 : Hadith 4273\n# Mecca will be attacked and the Kaaba will be destroyed.Muslim, Book 41, Hadith 6953\n# A pleasant breeze will blow from the south that shall cause all believers to die peacefully.\n# The Moon will split in two, but non-believers will insist it isn't happening for real.Qu'ran Surah Al-Qamar 54:1-2\n# There are two groups of ummah whom Allah will free from the fire: The group that invades India, and the group that will be with Isa bin Maryam.Sunan an-Nasa'i 3175\n\nOne of the last of the minor signs, and which will signal the coming of the 10 Major signs\n\n#The appearance of the Mahdi.\n\nMajor signs\n\nFollowing the second period, the third will be marked by the ten major signs known as alamatu's-sa'ah al-kubra (the major signs of the end).Sahih Muslim, Book 41, Hadith 6931 They are as follows:\n# The false messiah—anti-Christ, Masih ad-Dajjal—shall appear with great powers as a one-eyed man with his right eye blind and deformed like a grape. Although believers will not be deceived, he will claim to be God, to hold the keys to heaven and hell, and will lead many astray. In reality, his heaven is hell, and his hell is heaven. The Dajjal will be followed by seventy thousand Jews of Isfahan wearing Persian shawls.Muslim, Book 41, Hadith 7034\n# The return of Isa (Jesus), from the fourth sky, to kill Dajjal.\n# Ya'jooj and Ma'jooj (Gog and Magog), a Japhetic tribe of vicious beings who had been imprisoned by Dhul-Qarnayn, will break out. They will ravage the earth, drink all the water of Lake Tiberias, and kill all believers in their way. Isa, Imam Al-Mahdi, and the believers with them will go to the top of a mountain and pray for the destruction of Gog and Magog. God eventually will send disease and worms to wipe them out.\n# A huge black cloud of smoke will cover the earth.Sahih Muslim\n# Dabbat al-ard, or the beast that will come out of the ground to talk to people.\n# The sun will rise from the west.\n# Three sinkings of the earth, one in the east,Sahih Muslim\n# One in the west,Sahih Muslim\n# And one in Arabia.Sahih Muslim\n# The second blow of the trumpet will be sounded, the dead will return to life, and, out of Yemen, will come a fire that shall gather all to Mahshar Al Qiy'amah (The Gathering for Judgment).\n\nMajor figures \n\nThe Mahdi\n\nMahdi  () means \"guided one\", with hadith being the primary source of descriptions of him. His appearance will be the first sign of the third period. Hadith state that he will be a descendant of Muhammad through Muhammad's daughter Fatimah and cousin Ali. The Mahdi will be looked upon to kill al-Dajjal, to end the disintegration of the Muslim community, and to prepare for the reign of Jesus, who will rule for a time thereafter. The Mahdi will fulfill his prophetic mission, a vision of justice and peace, before submitting to Jesus' rule.  The physical features of Mahdi are described in the hadith—he will be of Arab complexion, of average height, with a large belly, large eyes, and a sharp nose. He will have a mole on his cheek, the sign of the prophet on his shoulder, and be recognised by the caliphate while he sits in his own home. As written by Abu Dawud, \"Our Mahdi will have a broad forehead and a pointed (prominent) nose. He will fill the earth with justice as it is filled with injustice and tyranny. He will rule for seven years.\"Abu Dawud, Sahih, 2.208 and Fusul al-muhimma, 275\n\nThough the predictions of the duration of his rule differ, hadith are consistent in describing that God will perfect him in a single night, imbuing him with inspiration and wisdom, and his name will be announced from the sky. The Mahdi will bring back worship of true Islamic values, and bring the Ark of the Covenant to light. He will conquer Istanbul and Mount Daylam and will regard Jerusalem and the Dome as his home. His banner will be that of the prophet Muhammad: black and unstitched, with a halo. Furled since the death of Muhammad, the banner will unfurl when the Mahdi appears. He will be helped by angels and others that will prepare the way for him. He will understand the secrets of abjad.\n\nAmr bin Shuaib learned from his grandfather that the Messenger of God said, \"In Dhu al-Qi'dah (Islamic month), there will be fight among the tribes, Muslim pilgrims will be looted and there will be a battle in Mina in which many people will be slain and blood will flow until it runs over the Jamaratul Aqba (one of the three stone pillars at Mina). The man they seek will flee and will be found between the Rukn (a corner of the Kaaba containing the Black Stone) and the Maqam of Prophet Abraham (near Ka'ba). He will be forced to accept people's Bay'ah (being chosen as a Leader/Caliph). The number of those offering Bay'ah will be the same as the number of the people of Badr (Muslim fighters who participated in the Battle of Badr at time of Prophet Mohammad). Then, the dweller of  Heaven and the dweller of the Earth will be pleased with him.\"Naeem Bin Hammad's book Kitab Al-Fitan (8584\\503\\4) أخرج ( ك ) نعيم بن حماد (986), والحاكم\n\nSunni and Shi'ite perspectives on the Mahdi\n\nSunni and Shi'a Islam have different beliefs regarding the identity of Mahdi. Historically, Sunni Islam considers religious authority as being derived from the caliph, who was appointed by the companions of Muhammad at his death. The Sunnis view the Mahdi as the successor of Mohammad; the Mahdi is expected to arrive to rule the world and reestablish righteousness. Some Sunnis share a belief that there may be no actual Mahdi, but that a series of mujaddid will instead lead to an Islamic revolution of a renewal of faith and avoidance of deviation from God's path. Sunni tradition has attributed such intellectual and spiritual attributes to numerous Muslims at the end of each Muslim century from the origin of Islam to the present day. This classical interpretation is favored by Sunni scholars like Ghazali and Ibn Taymiyyah.\n\nContrarily, Shi'a Islam vested religious authority in those of the bloodline of Muhammad, favoring his cousin and son by marriage, Ali. Ali was appointed the first Imam; and according to Twelver interpretation, he was followed by eleven more. Muhammad al-Mahdi, otherwise known as the Twelfth Imam, went into hiding in 873 at the age of four. His father was al-`Askari, who had been murdered; and so he was hidden from the authorities of the Abbasid Caliphate. He maintained contact with his followers until 940, when he entered the Occultation. Twelverism believes that al-Mahdi is the current Imam, and will emerge at the end of the current age. Some scholars say that, although unnoticed by others present, the Mahdi of Twelver Islam continues to make an annual pilgrimage while he resides outside of Mecca.  In contradistinction, Sunni Islam foresees him as a separate and new person. The present Ayatollahs of Iran see themselves as joint caretakers of the office of the Imam until he returns.\n\nThe Mahdi is not described in the Qurʾān, only in hadith, with scholars suggesting he arose when Arabian tribes were settling in Syria under Muawiya. \"They anticipated 'the Mahdi who will lead the rising people of the Yemen back to their country' in order to restore the glory of their lost Himyarite kingdom. It was believed that he would eventually conquer Constantinople.\"\n\nClaimants to being the Mahdi\n\nThroughout history, there have been multiple claimants to the role of Mahdi, who by their pious deeds acquired followings. One of these men, Muhammad ibn al-Hanafiyyah, was said to have judgment and character over rival caliphs; and mysteries of his death arose in the 8th century.  It was believed he had in fact not died and would one day return as the Mahdi.  The sect of Mahdavis arose as followers of another claimant, Muhammad Mahdi of Janpur, in the 15th century.  Furthermore, a potential Mahdi, Muhammad Ahmad of Sudan, was believed to hold the title following his self-proclamation, in 1881, and stand against the Turco-Egyptian government, as well as the British.  Additionally, Mirza Ghulam Ahmad of Punjab claimed to be the Mahdi during the same period as Muhammad Ahmad, but was considered a heretic by Orthodox Muslims, though he amassed a substantial following of 10 to 20 million and is credited with founding the Ahmadiyya sect, which, today, is established in over 200 countries and territories of the world.\n\nTwo 19th century religious movements—linked to Shi'ism, Bábism, and the Bahá'í Faith—believe that their prophets, the Báb (d. 1850) and Bahá'u'lláh, fulfilled the prophecy. The Báb is thought to be the return of the Twelfth Imam, who is also the Mahdi according to the twelver tradition, and Bahá'u'lláh that of Jesus. Since the Baha'is now are a successful international religion with possibly as many as six million followers, their concept of the fulfillment of Islamic prophecy now extends well beyond the Islamic world.\n\nIsa\n\nIsa is the Arabic name for Jesus, and his return is considered the third major sign of the last days (the second being the appearance of Jesus's nemesis Masih ad-Dajjal). Although Muhammad is the preeminent Prophet in Islam, Jesus is the only Prophet mentioned in the Quran, other than Idris (Enoch), who is said not to have died but who was rather raised up by God. Thus, in accordance with post-Quranic hadith, Jesus conceivably will return to Earth as a just judge before the Day of Judgment. As written in hadith:\n\nHadith reference both the Mahdi and Isa simultaneously and the return of the Mahdi will coincide with the return of Isa, who will descend from the heavens in al-Quds at dawn. The two will meet, and the Mahdi will lead the people in fajr prayer. After the prayer, they will open a gate to the west and encounter Masih ad-Dajjal. After the defeat of ad-Dajjal, Isa will lead a peaceful forty-year reign until his death. He will be buried in a tomb beside Muhammad in Medina.  Though the two certainly differ regarding their role and persona in Islamic eschatology, the figures of the Mahdi and Isa are ultimately inseparable, according to the Prophet. Though Isa is said to descend upon the world once again, the Mahdi will already be present.\n\nWhat will be your reaction when the son of Mary (Jesus) descends and your Imam is from among yourselves? (Sahih Muslim, bab nuzul 'isa, Vol. 2; Sahih Bukhari, kitab bad' al-khalq wa nuzul 'isa, Vol. 4)\n\nMasih ad-Dajjal\n\nMasih ad-Dajjal does not appear in the Quran but is a prominent figure in hadith and Islamic eschatology as a whole. He appears gruesome and is blind in his right eye. His one eye is thought to be a symbol that correlates with how single-minded he is in achieving his goal of converting Muslims to his side. Al-Dajjal has the intention of gaining followers through his miracle working and apparent wealth and generosity. To resist such munificence is a test for true believers of Islam, who have been warned about Al-Dajjal's power, and who must resist his material temptations. It is thought that Al-Dajjal will appear prior to the Day of Judgment, where he will engage in an epic battle with, and be killed by, Jesus. Al-Dajjal functions symbolically as a key cog in the overall Islamic eschatological picture, which emphasises the world coming to an end, of good finally triumphing over evil, and of the remarkable events that will prefigure the replacement of the mortal world with a more authentic form of existence in the afterlife. Various Muslim political movements use the concept of Al-Dajjal to comment on contemporary events, and often identify him with opposing regimes or other worldly forces that they consider as harmful to Islam.\n\nYa'juj and Ma'juj\n\nThe fourth major sign of the end time will be that the wall which imprisons the nations of Ya'juj and Ma'juj will break, and they will surge forth. Some Islamic scholars, such as Imran Nazar Hosein, believe the wall began to crack during the life of Muhammad.[http://www.imranhosein.org/articles/signs-of-the-last-day/69-gog-and-magog-in-the-quran.html?start1 Gog and Magog in the Qur'an - Gog, Magog and Jerusalem] by Imran N. Hosein This is supported in the hadith, when the prophet mentions that \"a hole has been made in the wall containing the Ya'juj and Ma'juj\", indicating the size of the hole with his thumb and index finger. Their release will occur forty years prior to the Last Judgment:\n\nThey will ravage the earth. Ultimately, God will send worms and insects to destroy them.\n\nMajor events \n\nDestruction of the Kaaba and the Beast of the Earth\n\nBefore doomsday, a thin ruler from Ethiopia, with short legs, will attack Mecca and destroy the Kaaba.Muslim, Book 41, Hadith 6951 Another sign is the appearance of the da'ba-tul-ard, or the Beast of the Earth.\n\nThe entire world will be engulfed by dukhan or smoke, for forty days, and there will be three huge earthquakes. The Qur'an will be taken to heaven and even the huffaz will not recall its verses. Finally, a pleasant breeze will blow that shall cause all believers to die, but infidels and sinners will remain alive. A fire will start, from Hadramawt in Yemen, that will gather all the people of the world in the land of Mahshar, and al-Qiyamah will commence.\n\nResurrection of the dead\n\nIn the Qur'an,  barzakh () is the intermediate state in which nafs of the deceased are held between realities to rest with loved ones until Qiyamah.\n\nThe eighth sign is a breeze bearing a pleasant scent, which will emanate from Yemen, causing the awliya, sulaha and the pious to die peacefully once they inhale it. After the believers die, there will be a period of 120 years during which the world will contain only kafirs, sinners, oppressors, liars, and adulterers; and there will be a reversion to idolatry.\n\nThe ninth sign is the rising of the sun from the west after a long night. After midday, the sun will set again. According to hadith:\n\nThe final signs will be nafkhatu'l-ula, when a trumpet will be sounded for the first time, and which will result in the death of the remaining sinners.  Then there will be a period of forty years, after which the eleventh sign is the sounding of a second trumpet to signal the resurrection as ba'as ba'da'l-mawt.  As written in the Qur'an:\n All will be naked and running to the Place of Gathering, while the enemies of God will be travelling on their faces with their legs upright.\n\nFinally, there will be no more injustice: \n\nSeparation of the righteous and the damned at al-Qiyamah\n\nAt divine judgment, each person's Book of Deeds will be read, in which \"every small and great thing is recorded\", but with actions before adolescence omitted. Records shall be given with the right hand if they are good, and the left if they are evil. Even the smallest acts will not be ignored:  This will be followed by perfect, divine, and merciful justice. The age of the hereafter, or the rest of eternity, is the final stage after the Day of Judgment, when all will receive their judgment from God.\n\nThe dead will stand in a grand assembly, awaiting a scroll detailing their righteous deeds, sinful acts, and ultimate judgment. Muhammad will be the first to be resurrected.Esposito, John (2003). The Oxford Dictionary of Islam. Oxford University Press. , p.264\n\nIf one did good deeds, one would go to Jannah, and if unrighteous, would go to Jahannam. Punishments will include  adhab, or severe pain, and khizy or shame.\"Reward and Punishment\", Encyclopedia of the Qur'an(2005) There will also be a punishment of the grave (for those who disbelieved) between death and the resurrection.Leor Halevi, [https://www.nytimes.com/2007/05/04/opinion/04iht-edhalevi.1.5565834.html].\n\nIslamic eschatology in literature\n\nIbn al-Nafis wrote of Islamic eschatology in Theologus Autodidactus (circa AD 1270), where he used reason, science, and early Islamic philosophy to explain how he believed al-Qiyamah would unfold, told in the form of a theological fiction novel.Dr. Abu Shadi Al-Roubi (1982), \"Ibn Al-Nafis as a philosopher\", Symposium on Ibn al-Nafis, Second International Conference on Islamic Medicine: Islamic Medical Organization, Kuwait (cf. [https://web.archive.org/web/20080206072116/http://www.islamset.com/isc/nafis/drroubi.html Ibn al-Nafis As a Philosopher], Encyclopedia of Islamic World)\n\nImran Nazar Hosein wrote numerous books that deal with Islamic eschatology (Ilmu Ākhir al-Zamān – Knowledge of the later days), among which the most famous is Jerusalem in the Qur'an.[http://www.imranhosein.org/books/37-jerusalem-in-the-quran.html Jerusalem in the Qur'an] by Imran N. Hosein.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Islamic eschatology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15513" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Islamic eschatology is the branch of Islamic theology concerning the end of the world, and the \"Day of resurrection\" after that, known as Yawm al-Qiyāmah (,, \"the Day of Resurrection\") or Yawm ad-Dīn (,, \"the Day of Judgment\"). when the annihilation of all life will be followed by its resurrection and judgment by Allah. When al-Qiyamah will happen is not specified, but according to prophecy there are major and minor signs that will foretell its coming. Many verses in the Quran mention the Last Judgment.\n\nThe main subject of Surat al-Qiyama is the resurrection. The Great Tribulation is described in the hadith and commentaries of the ulama, including al-Ghazali, Ibn Kathir, Ibn Majah, Muhammad al-Bukhari, and Ibn Khuzaymah. The Day of Judgment is also known as the Day of Reckoning, the Last Day, and the Hour (al-sā'ah).\n\nThe hadith are more specific than the Quran, and describe twelve major signs of al-Qiyamah. At the time of judgment, terrible corruption and chaos will rule. Isa (Jesus) and the Mahdi are central characters in events near the time. The Mahdi will have established a seven-year rule in Medina at which time Jesus will descend from Heaven and battle Masih ad-Dajjal (the Antichrist in Islam). The Mahdi and Jesus will triumph and liberate Islam from cruelty. These events will be followed by a time of serenity when people live according to religious values.\n\nLike other Abrahamic religions, Islam teaches that there will be a resurrection of the dead followed by a final tribulation and eternal division of the righteous and wicked. Islamic apocalyptic literature describing Armageddon is often known as fitna, Al-Malhama Al-Kubra (The Great Massacre) or ghaybah in Shī'a Islam. The righteous are rewarded with the pleasures of Jannah (Paradise), while the unrighteous are punished in Jahannam (Hell).\n\nArticles of faith\n\nThe Day of Judgment, al-Qiyāmah, (also known as the Day of Reckoning or Resurrection, the Last Day, or the Hour) is one of the six articles of faith in Sunni Islam, and one of seven in Shia Islam.\n\nSources\n\nTwo main sources in Islamic scripture discuss the Last Judgment and the tribulation associated with it: the Quran, which is viewed in Islam as infallible, and the hadith, or sayings of the prophet. Hadith are viewed with more flexibility due to the late compilation of the sayings in written form, two hundred years after the death of Muhammad. The Last Judgment and the tribulation have also been discussed in the commentaries of ulama such as al-Ghazali, Ibn Kathir, and Muhammad al-Bukhari.\n\nLast Judgment in the Quran\n\nInterpretations of the Quran yield the following specifics:\n# The time is known only to Allah.\n# Even Muhammad cannot bring it forward.\n# Those who have been dead, when resurrected, will believe that a short time has passed between death and resurrection. \n#Nothing will remain except Allah. Allah will resurrect all, even if they have turned to stone or iron.\n# Those that have accepted false deities will suffer in the afterlife.\n\nResurrection theories\n\nAlthough Islamic philosophers and scholars were in general agreement on a bodily resurrection after death, however their opinions differ in regard what bodily resurrection will be like. Some of the theories are the following:\n* The return to the same material body, someone had during lifetime, that will be restored.Joseph Hell Die Religion des Islam Motilal Banarsidass Publishe 1915 page 201\n* Conjunction of the soul with a Mithali body, which is congenial to the worlds of Barzakh and the Akhirah.Zailan Moris Revelation, Intellectual Intuition and Reason in the Philosophy of Mulla Sadra: An Analysis of the al-hikmah al-'arshiyyah Routledge  page 107\n* Resurrection with a Hurqaliyati body, accordingly a second invisible body, that survives death.Juan Cole Sacred Space And Holy War: The Politics, Culture and History of Shi'ite Islam I.B.Tauris 2002  page 55\n\nSigns of the End time\n\nIn Islam, a number of major and minor signs foretell the end of days. There is debate over whether they could occur concurrently or must be at different points in time, although Islamic scholars typically divide them into three major periods.\n\n#Sexual immorality appears among people to such an extent that they commit it openly, except that they will be afflicted by plagues and diseases unknown to their forefathers;\n#People cheat in weights and measures (business, trades, etc.) and are stricken with famine, calamity, and oppression as a result;\n#They withhold charity and hoard their wealth, and rain is withheld from the sky from them; there is rain only for animals;\n#They break their covenant with God and His Messenger and God enables their enemies to overpower them and take some of what is in their hands;\n#God causes those who do not live according to His book to fight among themselves.Sunan Ibn Maajah 4019\n\nMinor signs\n\n#The coming of fitna (tribulations) and removal of khushoo' (fearfulness of God, taqwah, reverence, etc.)Sahih Muslim, Book 1, Hadith 0213\n#The coming of 30 Dajjals, each one of them presuming himself an apostle of God.Dawud, Book 37, Hadith 4319\n#A person passing by a grave might say to another: I wish it were my abode.Sahih Muslim, Book 41, Hadith 6947\n#The loss of honesty, and authority put in the hands of those who do not deserve it.Sahih Bukhari, Volume 8, Book 076, Hadith 503\n#The loss of knowledge and the prevalence of religious ignorance.Sahih Bukhari Volume 1, Book 3, Hadith Number 81\n#Frequent, sudden, and unexpected deaths.Sahih Muslim Book 41, Hadith 7040\n#Increase in pointless killings.Sahih Bukhari Volume 9, Book 88, Number 184\n#Acceleration of time.Imam Ahmed, recorded in Muslim\n#Rejection of Hadith.Abu Dawud Book 35, Hadith 4587\n#The spread of riba (usury, interest), zina (adultery, fornication), and the drinking of alcohol.Sahih Muslim Book 41, Hadith 7015\n#Widespread acceptance of music.Sahih Bukhari Volume 7, Book 69, Hadith 494\n#Pride and competition in the decoration of mosques.Sahih ibn Majah 610\n#Women will increase in number and men will decrease in number so much so that fifty women will be looked after by one man.Sahih Bukhari Volume 1, Book 3, Hadith 81\n#Abundance of earthquakes.Sahih Bukhari Volume 9, Book 88, Hadith Number 237\n#Frequent occurrences of disgrace, distortion, and defamation.Al-Adab Al-Mufrad 485, Book 1, Hadith 3\n#When people wish to die because of the severe trials and tribulations that they are suffering.Sahih Bukhari Volume 9, Book 88, Hadith Number 231\n#Jews fighting Muslims.Sahih Musim Book 41, Hadith Number 6985\n#When paying charity becomes a burden.Sahih Bukhari Volume 009, Book 088, Hadith Number 236\n#Nomads will compete in the construction of very tall buildings.Sahih Bukhari Volume 009, Book 088, Hadith Number 237\n#Women will appear naked despite their being dressed.Sahih Muslim Book 40, Hadith Number 6840\n#People will seek knowledge from misguided and straying scholars.Musnad Imam Ahmad (no.21,334 and no.21,335\n#Liars will be believed, honest people disbelieved, and faithful people called traitors.Sunan At-Tirmidhi 2209\n#The death of righteous, knowledgeable people.Sahih Bukhari Volume 1, Book 3, Hadith Number 81\n#The emergence of indecency (obscenity) and enmity among relatives and neighbours.Musnad Ahmad\n#The rise of idolatry and polytheists in the community.Abu-Dawud, Book 30, Number 4239 (and others)\n#The Euphrates will uncover a mountain of gold.Sahih Muslim Book 041, Hadith Number 6918\n#The land of the Arabs will return to being a land of rivers and fields.Sahih Muslim Book 5, Hadith 2208\n#The Romans will form a majority amongst people.Sahih Muslim Book 041, Hadith Number 6925\n#People will increasingly earn money by unlawful (Haram) ways.Al-Bukhari \n#There will be much rain but little vegetation.Reported by Anas and declared Sahih by Hasan al Albani\n#Evil people will be expelled from Al-Madinah.Sahih Muslim Book 7, Hadith Number 3188\n#Wild animals will communicate with humans, and humans will communicate with objects.Musnad Ahmad\n#Lightning and thunder will become more prevalent.Ahmad\n#There will be a special greeting for people of distinction.Musnad Ahmad\n#Trade will become so widespread that a woman will help her husband in business.Musnad Ahmad\n#No truly honest man will remain and no one will be trusted.Sahih Bukhari\n#Only the worst people will be left; they will not know any good nor forbid any evil (i.e. No one will say there is no God but Allah).Ahmad\n#Nations will call each other to destroy Islam by any and every means.Musnad Ahmad\n#Islamic knowledge will be passed on, but no one will follow it correctly.Tirmidhee 2653 and Ibn Maajah 4048\n#Muslim rulers will come who do not follow the guidance and tradition of the Sunnah. Some of their men will have the hearts of devils in a human body.Sahih Muslim 1847\n#Stinginess will become more widespread and honorable people will perish.Mujamma'uz-Zawaa'id 7/327\n#A man will obey his wife and disobey his mother, and treat his friend kindly while shunning his father.Sunan al-Tirmidhi\n#Voices will be raised in the mosques.Sunan al-Tirmidhi\n#The leader of a people will be the worst of them.Sunan al-Tirmidhi\n#People will treat a man with respect because they fear the evil he could do.Sunan al-Tirmidhi\n#Much wine will be drunk.Sunan al-Tirmidhi\n# Muslims shall fight against a nation who wear shoes made of hair and with faces like hammered shields, with red complexions and small eyes.Sahih Muslim, Book 41, Hadith 6960\n# The emergence of the Sufyani within the Syria region.Sahih Muslim, Book 41, Hadith 6926\n# The truce and joint Roman-Muslim campaign against a common enemy, followed by al-Malhama al-Kubra (Armageddon), a Roman vs. Muslim war.Narrated with sound chains from Dhu Mikhbar al-Najashi by Abu Dawud, Ahmad, Ibn Majah, Ibn Hibban, and al-Hakim who declared it sahih and al-Dhahabi concurred. See Shaykh Shu`ayb Arna'ut's documentation of this hadith in his edition of Sahih Ibn Hibban (15:101-103 #6708-6709).\n#The Black Standard will come from Khorasan, nothing shall turn them back until it is planted in Jerusalem.Sunan At-Tirmidhi 2269 (Weak) https://muflihun.com/tirmidhi/31/2269\n# Quran will be forgotten and no one will recall its verses.\n# All Islamic knowledge will be lost to the extent that people will not say \"La Illaha Ila Allah\" (There is no God, but Allah), but instead old people will babble without understanding, \"Allah, Allah\".\n# People will fornicate in the streets \"like donkeys\".\n# The first trumpet blow will be sounded by Israfil, all that is in heaven and earth will be stunned and die except what God wills, and silence will envelop everything for forty undetermined periods of time.\n# There will be disagreement concerning succession. Then a man will emerge from Madina. He will hurry to Makkah, and the people of Makkah will come out to him and urge him and try to force him to accept the Bai'aa.The Promised Deliverer (Kitab Al-Mahdi) Dawud : Book 36 : Hadith 4273\n# Mecca will be attacked and the Kaaba will be destroyed.Muslim, Book 41, Hadith 6953\n# A pleasant breeze will blow from the south that shall cause all believers to die peacefully.\n# The Moon will split in two, but non-believers will insist it isn't happening for real.Qu'ran Surah Al-Qamar 54:1-2\n# There are two groups of ummah whom Allah will free from the fire: The group that invades India, and the group that will be with Isa bin Maryam.Sunan an-Nasa'i 3175\n\nOne of the last of the minor signs, and which will signal the coming of the 10 Major signs\n\n#The appearance of the Mahdi.\n\nMajor signs\n\nFollowing the second period, the third will be marked by the ten major signs known as alamatu's-sa'ah al-kubra (the major signs of the end).Sahih Muslim, Book 41, Hadith 6931 They are as follows:\n# The false messiah—anti-Christ, Masih ad-Dajjal—shall appear with great powers as a one-eyed man with his right eye blind and deformed like a grape. Although believers will not be deceived, he will claim to be God, to hold the keys to heaven and hell, and will lead many astray. In reality, his heaven is hell, and his hell is heaven. The Dajjal will be followed by seventy thousand Jews of Isfahan wearing Persian shawls.Muslim, Book 41, Hadith 7034\n# The return of Isa (Jesus), from the fourth sky, to kill Dajjal.\n# Ya'jooj and Ma'jooj (Gog and Magog), a Japhetic tribe of vicious beings who had been imprisoned by Dhul-Qarnayn, will break out. They will ravage the earth, drink all the water of Lake Tiberias, and kill all believers in their way. Isa, Imam Al-Mahdi, and the believers with them will go to the top of a mountain and pray for the destruction of Gog and Magog. God eventually will send disease and worms to wipe them out.\n# A huge black cloud of smoke will cover the earth.Sahih Muslim\n# Dabbat al-ard, or the beast that will come out of the ground to talk to people.\n# The sun will rise from the west.\n# Three sinkings of the earth, one in the east,Sahih Muslim\n# One in the west,Sahih Muslim\n# And one in Arabia.Sahih Muslim\n# The second blow of the trumpet will be sounded, the dead will return to life, and, out of Yemen, will come a fire that shall gather all to Mahshar Al Qiy'amah (The Gathering for Judgment).\n\nMajor figures \n\nThe Mahdi\n\nMahdi  () means \"guided one\", with hadith being the primary source of descriptions of him. His appearance will be the first sign of the third period. Hadith state that he will be a descendant of Muhammad through Muhammad's daughter Fatimah and cousin Ali. The Mahdi will be looked upon to kill al-Dajjal, to end the disintegration of the Muslim community, and to prepare for the reign of Jesus, who will rule for a time thereafter. The Mahdi will fulfill his prophetic mission, a vision of justice and peace, before submitting to Jesus' rule.  The physical features of Mahdi are described in the hadith—he will be of Arab complexion, of average height, with a large belly, large eyes, and a sharp nose. He will have a mole on his cheek, the sign of the prophet on his shoulder, and be recognised by the caliphate while he sits in his own home. As written by Abu Dawud, \"Our Mahdi will have a broad forehead and a pointed (prominent) nose. He will fill the earth with justice as it is filled with injustice and tyranny. He will rule for seven years.\"Abu Dawud, Sahih, 2.208 and Fusul al-muhimma, 275\n\nThough the predictions of the duration of his rule differ, hadith are consistent in describing that God will perfect him in a single night, imbuing him with inspiration and wisdom, and his name will be announced from the sky. The Mahdi will bring back worship of true Islamic values, and bring the Ark of the Covenant to light. He will conquer Istanbul and Mount Daylam and will regard Jerusalem and the Dome as his home. His banner will be that of the prophet Muhammad: black and unstitched, with a halo. Furled since the death of Muhammad, the banner will unfurl when the Mahdi appears. He will be helped by angels and others that will prepare the way for him. He will understand the secrets of abjad.\n\nAmr bin Shuaib learned from his grandfather that the Messenger of God said, \"In Dhu al-Qi'dah (Islamic month), there will be fight among the tribes, Muslim pilgrims will be looted and there will be a battle in Mina in which many people will be slain and blood will flow until it runs over the Jamaratul Aqba (one of the three stone pillars at Mina). The man they seek will flee and will be found between the Rukn (a corner of the Kaaba containing the Black Stone) and the Maqam of Prophet Abraham (near Ka'ba). He will be forced to accept people's Bay'ah (being chosen as a Leader/Caliph). The number of those offering Bay'ah will be the same as the number of the people of Badr (Muslim fighters who participated in the Battle of Badr at time of Prophet Mohammad). Then, the dweller of  Heaven and the dweller of the Earth will be pleased with him.\"Naeem Bin Hammad's book Kitab Al-Fitan (8584\\503\\4) أخرج ( ك ) نعيم بن حماد (986), والحاكم\n\nSunni and Shi'ite perspectives on the Mahdi\n\nSunni and Shi'a Islam have different beliefs regarding the identity of Mahdi. Historically, Sunni Islam considers religious authority as being derived from the caliph, who was appointed by the companions of Muhammad at his death. The Sunnis view the Mahdi as the successor of Mohammad; the Mahdi is expected to arrive to rule the world and reestablish righteousness. Some Sunnis share a belief that there may be no actual Mahdi, but that a series of mujaddid will instead lead to an Islamic revolution of a renewal of faith and avoidance of deviation from God's path. Sunni tradition has attributed such intellectual and spiritual attributes to numerous Muslims at the end of each Muslim century from the origin of Islam to the present day. This classical interpretation is favored by Sunni scholars like Ghazali and Ibn Taymiyyah.\n\nContrarily, Shi'a Islam vested religious authority in those of the bloodline of Muhammad, favoring his cousin and son by marriage, Ali. Ali was appointed the first Imam; and according to Twelver interpretation, he was followed by eleven more. Muhammad al-Mahdi, otherwise known as the Twelfth Imam, went into hiding in 873 at the age of four. His father was al-`Askari, who had been murdered; and so he was hidden from the authorities of the Abbasid Caliphate. He maintained contact with his followers until 940, when he entered the Occultation. Twelverism believes that al-Mahdi is the current Imam, and will emerge at the end of the current age. Some scholars say that, although unnoticed by others present, the Mahdi of Twelver Islam continues to make an annual pilgrimage while he resides outside of Mecca.  In contradistinction, Sunni Islam foresees him as a separate and new person. The present Ayatollahs of Iran see themselves as joint caretakers of the office of the Imam until he returns.\n\nThe Mahdi is not described in the Qurʾān, only in hadith, with scholars suggesting he arose when Arabian tribes were settling in Syria under Muawiya. \"They anticipated 'the Mahdi who will lead the rising people of the Yemen back to their country' in order to restore the glory of their lost Himyarite kingdom. It was believed that he would eventually conquer Constantinople.\"\n\nClaimants to being the Mahdi\n\nThroughout history, there have been multiple claimants to the role of Mahdi, who by their pious deeds acquired followings. One of these men, Muhammad ibn al-Hanafiyyah, was said to have judgment and character over rival caliphs; and mysteries of his death arose in the 8th century.  It was believed he had in fact not died and would one day return as the Mahdi.  The sect of Mahdavis arose as followers of another claimant, Muhammad Mahdi of Janpur, in the 15th century.  Furthermore, a potential Mahdi, Muhammad Ahmad of Sudan, was believed to hold the title following his self-proclamation, in 1881, and stand against the Turco-Egyptian government, as well as the British.  Additionally, Mirza Ghulam Ahmad of Punjab claimed to be the Mahdi during the same period as Muhammad Ahmad, but was considered a heretic by Orthodox Muslims, though he amassed a substantial following of 10 to 20 million and is credited with founding the Ahmadiyya sect, which, today, is established in over 200 countries and territories of the world.\n\nTwo 19th century religious movements—linked to Shi'ism, Bábism, and the Bahá'í Faith—believe that their prophets, the Báb (d. 1850) and Bahá'u'lláh, fulfilled the prophecy. The Báb is thought to be the return of the Twelfth Imam, who is also the Mahdi according to the twelver tradition, and Bahá'u'lláh that of Jesus. Since the Baha'is now are a successful international religion with possibly as many as six million followers, their concept of the fulfillment of Islamic prophecy now extends well beyond the Islamic world.\n\nIsa\n\nIsa is the Arabic name for Jesus, and his return is considered the third major sign of the last days (the second being the appearance of Jesus's nemesis Masih ad-Dajjal). Although Muhammad is the preeminent Prophet in Islam, Jesus is the only Prophet mentioned in the Quran, other than Idris (Enoch), who is said not to have died but who was rather raised up by God. Thus, in accordance with post-Quranic hadith, Jesus conceivably will return to Earth as a just judge before the Day of Judgment. As written in hadith:\n\nHadith reference both the Mahdi and Isa simultaneously and the return of the Mahdi will coincide with the return of Isa, who will descend from the heavens in al-Quds at dawn. The two will meet, and the Mahdi will lead the people in fajr prayer. After the prayer, they will open a gate to the west and encounter Masih ad-Dajjal. After the defeat of ad-Dajjal, Isa will lead a peaceful forty-year reign until his death. He will be buried in a tomb beside Muhammad in Medina.  Though the two certainly differ regarding their role and persona in Islamic eschatology, the figures of the Mahdi and Isa are ultimately inseparable, according to the Prophet. Though Isa is said to descend upon the world once again, the Mahdi will already be present.\n\nWhat will be your reaction when the son of Mary (Jesus) descends and your Imam is from among yourselves? (Sahih Muslim, bab nuzul 'isa, Vol. 2; Sahih Bukhari, kitab bad' al-khalq wa nuzul 'isa, Vol. 4)\n\nMasih ad-Dajjal\n\nMasih ad-Dajjal does not appear in the Quran but is a prominent figure in hadith and Islamic eschatology as a whole. He appears gruesome and is blind in his right eye. His one eye is thought to be a symbol that correlates with how single-minded he is in achieving his goal of converting Muslims to his side. Al-Dajjal has the intention of gaining followers through his miracle working and apparent wealth and generosity. To resist such munificence is a test for true believers of Islam, who have been warned about Al-Dajjal's power, and who must resist his material temptations. It is thought that Al-Dajjal will appear prior to the Day of Judgment, where he will engage in an epic battle with, and be killed by, Jesus. Al-Dajjal functions symbolically as a key cog in the overall Islamic eschatological picture, which emphasises the world coming to an end, of good finally triumphing over evil, and of the remarkable events that will prefigure the replacement of the mortal world with a more authentic form of existence in the afterlife. Various Muslim political movements use the concept of Al-Dajjal to comment on contemporary events, and often identify him with opposing regimes or other worldly forces that they consider as harmful to Islam.\n\nYa'juj and Ma'juj\n\nThe fourth major sign of the end time will be that the wall which imprisons the nations of Ya'juj and Ma'juj will break, and they will surge forth. Some Islamic scholars, such as Imran Nazar Hosein, believe the wall began to crack during the life of Muhammad.[http://www.imranhosein.org/articles/signs-of-the-last-day/69-gog-and-magog-in-the-quran.html?start1 Gog and Magog in the Qur'an - Gog, Magog and Jerusalem] by Imran N. Hosein This is supported in the hadith, when the prophet mentions that \"a hole has been made in the wall containing the Ya'juj and Ma'juj\", indicating the size of the hole with his thumb and index finger. Their release will occur forty years prior to the Last Judgment:\n\nThey will ravage the earth. Ultimately, God will send worms and insects to destroy them.\n\nMajor events \n\nDestruction of the Kaaba and the Beast of the Earth\n\nBefore doomsday, a thin ruler from Ethiopia, with short legs, will attack Mecca and destroy the Kaaba.Muslim, Book 41, Hadith 6951 Another sign is the appearance of the da'ba-tul-ard, or the Beast of the Earth.\n\nThe entire world will be engulfed by dukhan or smoke, for forty days, and there will be three huge earthquakes. The Qur'an will be taken to heaven and even the huffaz will not recall its verses. Finally, a pleasant breeze will blow that shall cause all believers to die, but infidels and sinners will remain alive. A fire will start, from Hadramawt in Yemen, that will gather all the people of the world in the land of Mahshar, and al-Qiyamah will commence.\n\nResurrection of the dead\n\nIn the Qur'an,  barzakh () is the intermediate state in which nafs of the deceased are held between realities to rest with loved ones until Qiyamah.\n\nThe eighth sign is a breeze bearing a pleasant scent, which will emanate from Yemen, causing the awliya, sulaha and the pious to die peacefully once they inhale it. After the believers die, there will be a period of 120 years during which the world will contain only kafirs, sinners, oppressors, liars, and adulterers; and there will be a reversion to idolatry.\n\nThe ninth sign is the rising of the sun from the west after a long night. After midday, the sun will set again. According to hadith:\n\nThe final signs will be nafkhatu'l-ula, when a trumpet will be sounded for the first time, and which will result in the death of the remaining sinners.  Then there will be a period of forty years, after which the eleventh sign is the sounding of a second trumpet to signal the resurrection as ba'as ba'da'l-mawt.  As written in the Qur'an:\n All will be naked and running to the Place of Gathering, while the enemies of God will be travelling on their faces with their legs upright.\n\nFinally, there will be no more injustice: \n\nSeparation of the righteous and the damned at al-Qiyamah\n\nAt divine judgment, each person's Book of Deeds will be read, in which \"every small and great thing is recorded\", but with actions before adolescence omitted. Records shall be given with the right hand if they are good, and the left if they are evil. Even the smallest acts will not be ignored:  This will be followed by perfect, divine, and merciful justice. The age of the hereafter, or the rest of eternity, is the final stage after the Day of Judgment, when all will receive their judgment from God.\n\nThe dead will stand in a grand assembly, awaiting a scroll detailing their righteous deeds, sinful acts, and ultimate judgment. Muhammad will be the first to be resurrected.Esposito, John (2003). The Oxford Dictionary of Islam. Oxford University Press. , p.264\n\nIf one did good deeds, one would go to Jannah, and if unrighteous, would go to Jahannam. Punishments will include  adhab, or severe pain, and khizy or shame.\"Reward and Punishment\", Encyclopedia of the Qur'an(2005) There will also be a punishment of the grave (for those who disbelieved) between death and the resurrection.Leor Halevi, [https://www.nytimes.com/2007/05/04/opinion/04iht-edhalevi.1.5565834.html].\n\nIslamic eschatology in literature\n\nIbn al-Nafis wrote of Islamic eschatology in Theologus Autodidactus (circa AD 1270), where he used reason, science, and early Islamic philosophy to explain how he believed al-Qiyamah would unfold, told in the form of a theological fiction novel.Dr. Abu Shadi Al-Roubi (1982), \"Ibn Al-Nafis as a philosopher\", Symposium on Ibn al-Nafis, Second International Conference on Islamic Medicine: Islamic Medical Organization, Kuwait (cf. [https://web.archive.org/web/20080206072116/http://www.islamset.com/isc/nafis/drroubi.html Ibn al-Nafis As a Philosopher], Encyclopedia of Islamic World)\n\nImran Nazar Hosein wrote numerous books that deal with Islamic eschatology (Ilmu Ākhir al-Zamān – Knowledge of the later days), among which the most famous is Jerusalem in the Qur'an.[http://www.imranhosein.org/books/37-jerusalem-in-the-quran.html Jerusalem in the Qur'an] by Imran N. Hosein. Islamic eschatology. http://en.wikipedia.org/?curid=15513."
  }
}
