{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7564",
  "eid" : "e246a610-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778459377,
  "textBody" : "The foreign policy of the United States is the way in which it interacts with foreign nations and sets standards of interaction for its organizations, corporations and system citizens of the United States.\n\nThe officially stated goals of the foreign policy of the United States, including all the Bureaus and Offices in the United States Department of State, as mentioned in the Foreign Policy Agenda of the Department of State, are \"to build and sustain a more democratic, secure, and prosperous world for the benefit of the American people and the international community.\" In addition, the United States House Committee on Foreign Affairs states as some of its jurisdictional goals: \"export controls, including nonproliferation of nuclear technology and nuclear hardware; measures to foster commercial interaction with foreign nations and to safeguard American business abroad; international commodity agreements; international education; and protection of American citizens abroad and expatriation.\" U.S. foreign policy and foreign aid have been the subject of much debate, praise and criticism, both domestically and abroad.\n\nPowers of the President \n\nSubject to the advice and consent role of the U.S. Senate, the President of the United States negotiates treaties with foreign nations, but treaties enter into force if ratified by two-thirds of the Senate. The President is also Commander in Chief of the United States Armed Forces, and as such has broad authority over the armed forces. Both the Secretary of State and ambassadors are appointed by the President, with the advice and consent of the Senate. The United States Secretary of State acts similarly to a foreign minister and under Executive leadership is the primary conductor of state-to-state diplomacy.\n\nPowers of the Congress\n\nCongress is the only branch of government that has the authority to declare war. Furthermore, Congress writes the civilian and military budget, thus has vast power in military action and foreign aid. Congress also has power to regulate commerce with foreign nations.James M. McCormick, American Foreign Policy and  Process (2009)  ch. 7–8\n\nHistorical overview\n\nThe main trend regarding the history of U.S. foreign policy since the American Revolution is the shift from non-interventionism before and after World War I, to its growth as a world power and global hegemony during and since World War II and the end of the Cold War in the 20th century.George C. Herring, From Colony to Superpower: U.S. Foreign Relations Since 1776 (2008) Since the 19th century, U.S. foreign policy also has been characterized by a shift from the realist school to the idealistic or Wilsonian school of international relations.Richard Russell, \"American Diplomatic Realism: A Tradition Practised and Preached by George F. Kennan,\" Diplomacy and Statecraft, Nov 2000, Vol. 11 Issue 3, pp. 159–83\n\nForeign policy themes were expressed considerably in George Washington's farewell address; these included among other things, observing good faith and justice towards all nations and cultivating peace and harmony with all, excluding both \"inveterate antipathies against particular nations, and passionate attachments for others\", \"steer[ing] clear of permanent alliances with any portion of the foreign world\", and advocating trade with all nations. These policies became the basis of the Federalist Party in the 1790s. But the rival Jeffersonians feared Britain and favored France in the 1790s, declaring the War of 1812 on Britain. After the 1778 alliance with France, the U.S. did not sign another permanent treaty until the North Atlantic Treaty in 1949. Over time, other themes, key goals, attitudes, or stances have been variously expressed by Presidential 'doctrines', named for them. Initially these were uncommon events, but since WWII, these have been made by most presidents.\n\nJeffersonians vigorously opposed a large standing army and any navy until attacks against American shipping by Barbary corsairs spurred the country into developing a naval force projection capability, resulting in the First Barbary War in 1801.\n\nDespite two wars with European Powers—the War of 1812 and the 1898 Spanish–American War—American foreign policy was peaceful and marked by steady expansion of its foreign trade during the 19th century.  The 1803 Louisiana Purchase doubled the nation's geographical area; Spain ceded the territory of Florida in 1819; annexation brought in the independent Texas Republic in 1845; a war with Mexico in 1848 added California, Arizona, Utah, Nevada, and New Mexico. The U.S. bought Alaska from the Russian Empire in 1867, and it annexed the independent Republic of Hawaii in 1898. Victory over Spain in 1898 brought the Philippines, and Puerto Rico, as well as oversight of Cuba. The short experiment in imperialism ended by 1908, as the U.S. turned its attention to the Panama Canal and the stabilization of regions to its south, including Mexico.\n\n20th century\n\nWorld War I\n\nThe 20th century was marked by two world wars in which the United States, along with allied powers, defeated its enemies and increased its international reputation. President Wilson's Fourteen Points was developed from his idealistic Wilsonianism program of spreading democracy and fighting militarism so as to end any wars. It became the basis of the German Armistice (really a surrender) and the 1919 Paris Peace Conference. The resulting Treaty of Versailles, due to European allies' punitive and territorial designs, showed insufficient conformity with these points and the U.S. signed separate treaties with each of its adversaries; due to Senate objections also, the U.S. never joined the League of Nations, which was established as a result of Wilson's initiative. In the 1920s, the United States followed an independent course, and succeeded in a program of naval disarmament, and refunding the German economy. Operating outside the League it became a dominant player in diplomatic affairs. New York became the financial capital of the world, but the Wall Street Crash of 1929 hurled the Western industrialized world into the Great Depression. American trade policy relied on high tariffs under the Republicans, and reciprocal trade agreements under the Democrats, but in any case exports were at very low levels in the 1930s.\n\nWorld War II\n\nThe United States adopted a non-interventionist foreign policy from 1932 to 1938, but then President Franklin D. Roosevelt moved toward strong support of the Allies in their wars against Germany and Japan. As a result of intense internal debate, the national policy was one of becoming the Arsenal of Democracy, that is financing and equipping the Allied armies without sending American combat soldiers. Roosevelt mentioned four fundamental freedoms, which ought to be enjoyed by people \"everywhere in the world\"; these included the freedom of speech and religion, as well as freedom from want and fear. Roosevelt helped establish terms for a post-war world among potential allies at the Atlantic Conference; specific points were included to correct earlier failures, which became a step toward the United Nations. American policy was to threaten Japan, to force it out of China, and to prevent its attacking the Soviet Union. However, Japan reacted by an attack on Pearl Harbor in December 1941, and the United States was at war with Japan, Germany, and Italy. Instead of the loans given to allies in World War I, the United States provided Lend-Lease grants of $50,000,000,000. Working closely with Winston Churchill of Britain, and Joseph Stalin of the Soviet Union, Roosevelt sent his forces into the Pacific against Japan, then into North Africa against Italy and Germany, and finally into Europe starting with France and Italy in 1944 against the Germans. The American economy roared forward, doubling industrial production, and building vast quantities of airplanes, ships, tanks, munitions, and, finally, the atomic bomb. Much of the American war effort went to strategic bombers, which flattened the cities of Japan and Germany.\n\nCold War\n\nAfter the war, the U.S. rose to become the dominant non-colonial economic power with broad influence in much of the world, with the key policies of the Marshall Plan and the Truman Doctrine. Almost immediately, however, the world witnessed division into broad two camps during the Cold War; one side was led by the U.S. and the other by the Soviet Union, but this situation also led to the establishment of the Non-Aligned Movement. This period lasted until almost the end of the 20th century and is thought to be both an ideological and power struggle between the two superpowers. A policy of containment was adopted to limit Soviet expansion, and a series of proxy wars were fought with mixed results. In 1991, the Soviet Union dissolved into separate nations, and the Cold War formally ended as the United States gave separate diplomatic recognition to the Russian Federation and other former Soviet states.\n\nIn domestic politics, foreign policy is not usually a central issue. In 1945–1970 the Democratic Party took a strong anti-Communist line and supported wars in Korea and Vietnam. Then the party split with a strong, \"dovish\", pacifist element (typified by 1972 presidential candidate George McGovern).  Many \"hawks\", advocates for war, joined the Neoconservative movement and started supporting the Republicans—especially Reagan—based on foreign policy.Seymour Martin Lipset, \"Neoconservatism: Myth and reality.\" Society 25.5 (1988): pp. 9-13 [http://www.diss.fu-berlin.de/docs/servlets/MCRFileNodeServlet/FUDOCS_derivate_000000001215/fraenkelvortraege01.pdf online]. Meanwhile, down to 1952 the Republican Party was split between an isolationist wing, based in the Midwest and led by Senator Robert A. Taft, and an internationalist wing based in the East and led by Dwight D. Eisenhower. Eisenhower defeated Taft for the 1952 nomination largely on foreign policy grounds. Since then the Republicans have been characterized by a hawkish and intense American nationalism, and strong opposition to Communism, and strong support for Israel.Colin  Dueck, Hard Line: The Republican Party and U.S. Foreign Policy since World War II (2010).\n\n21st century\n\nIn the 21st century, U.S. influence remains strong but, in relative terms, is declining in terms of economic output compared to rising nations such as China, India, Russia, and the newly consolidated European Union. Substantial problems remain, such as climate change, nuclear proliferation, and the specter of nuclear terrorism. Foreign policy analysts Hachigian and Sutphen in their book The Next American Century suggest all five powers have similar vested interests in stability and terrorism prevention and trade; if they can find common ground, then the next decades may be marked by peaceful growth and prosperity.\n\nIn 2017 diplomats from other countries developed new tactics to deal with President Donald Trump.  The New York Times reported on the eve of his first foreign trip as president:\n\nFor foreign leaders trying to figure out the best way to approach an American president unlike any they have known, it is a time of experimentation. Embassies in Washington trade tips and ambassadors send cables to presidents and ministers back home suggesting how to handle a mercurial, strong-willed leader with no real experience on the world stage, a preference for personal diplomacy and a taste for glitz....certain rules have emerged: Keep it short — no 30-minute monologue for a 30-second attention span. Do not assume he knows the history of the country or its major points of contention. Compliment him on his Electoral College victory. Contrast him favorably with President Barack Obama. Do not get hung up on whatever was said during the campaign. Stay in regular touch. Do not go in with a shopping list but bring some sort of deal he can call a victory.See Peter Baker,\n \"Tips for Leaders Meeting Trump: Keep It Short and Give Him a Win,\"\n [https://www.nytimes.com/2017/05/18/world/middleeast/trump-saudi-arabia-foreign-trip.html?hp&actionclick&pgtype\nHomepage&clickSourcestory-heading&module\nb-lede-package-region&regiontop-news&WT.nav\ntop-news&_r=0 New York Times May 18, 2017]\n\nTrump has numerous aides giving advice on foreign policy. The chief diplomat is Secretary of State Rex Tillerson.  His major foreign policy positions, which sometimes are at odds with Trump, include:\nurging the United States to stay in the Trans-Pacific Partnership and the Paris climate accord, taking a hard line on Russia, advocating negotiations and dialogue to defuse the mounting crisis with North Korea, advocating for continued U.S. adherence to the Iran nuclear deal, taking a neutral position in the dispute between Qatar and Saudi Arabia, and reassuring jittery allies, from South Korea and Japan to our NATO partners, that America still has their back.Aaron David Miller and Richard Sokolsky, \"Should Rex Tillerson Resign?,\" [http://www.politico.com/magazine/story/2017/10/01/should-rex-tillerson-resign-215664 Politico  October 1, 2017] \n\nLaw\n\nIn the United States, there are three types of treaty-related law:\n* Treaties are formal written agreements specified by the Treaty Clause of the Constitution. The President makes a treaty with foreign powers, but then the proposed treaty must be ratified by a two-thirds vote in the Senate. For example, President Wilson proposed the Treaty of Versailles after World War I after consulting with allied powers, but this treaty was rejected by the Senate; as a result, the U.S. subsequently made separate agreements with different nations. While most international law has a broader interpretation of the term treaty, the U.S. sense of the term is more restricted. In Missouri v. Holland, the Supreme Court ruled that the power to make treaties under the U.S. Constitution is a power separate from the other enumerated powers of the federal government, and hence the federal government can use treaties to legislate in areas which would otherwise fall within the exclusive authority of the states.\n* Executive agreements are made by the President—in the exercise of his Constitutional executive powers—alone.\n* Congressional-executive agreements are made by the President and Congress. A majority of both houses makes it binding much like regular legislation after it is signed by the president. The Constitution does not expressly state that these agreements are allowed, and constitutional scholars such as Laurence Tribe think they are unconstitutional.Laurence H. Tribe, \"Taking Text and Structure Seriously: Reflections on Free-Form Method in Constitutional Interpretation,\" 108 Harv. L. Rev. 1221, 1227 (1995).\n\nIn contrast to most other nations, the United States considers the three types of agreements as distinct. Further, the United States incorporates treaty law into the body of U.S. federal law. As a result, Congress can modify or repeal treaties afterward. It can overrule an agreed-upon treaty obligation even if this is seen as a violation of the treaty under international law. Several U.S. court rulings confirmed this understanding, including Supreme Court decisions in Paquete Habana v. United States (1900), and Reid v. Covert (1957), as well as a lower court ruling n Garcia-Mir v. Meese (1986). Further, the Supreme Court has declared itself as having the power to rule a treaty as void by declaring it \"unconstitutional\", although as of 2011, it has never exercised this power.\n\nThe State Department has taken the position that the Vienna Convention on the Law of Treaties represents established law. Generally, when the U.S. signs a treaty, it is binding. However, as a result of the Reid v. Covert decision, the U.S. adds a reservation to the text of every treaty that says, in effect, that the U.S. intends to abide by the treaty, but if the treaty is found to be in violation of the Constitution, then the U.S. legally can't abide by the treaty since the U.S. signature would be ultra vires.\n\nInternational agreements\n\nThe United States has ratified and participates in many other multilateral treaties, including arms control treaties (especially with the Soviet Union), human rights treaties, environmental protocols, and free trade agreements.\n\nEconomic and general government\n\nThe United States is a founding member of the United Nations and most of its specialized agencies, notably including the World Bank Group and International Monetary Fund.  The U.S. has at times has withheld payment of dues due to disagreements with the UN.\n\nThe United States is also member of:\n* Organization of American States\n* Organization for Security and Co-operation in Europe (OECD)\n* NAFTA, the regional trade bloc with Canada and Mexico\n* World Trade Organization\n* Asia-Pacific Economic Cooperation (APEC)\n* Group of Seven (G7)\n* World Customs Organization\n\nFreely Associated States\n\nAfter it captured the islands from Japan during World War II, the United States administered the Trust Territory of the Pacific Islands from 1947 to 1986 (1994 for Palau).  The Northern Mariana Islands became a U.S. territory (part of the United States), while Federated States of Micronesia, the Marshall Islands, and Palau became independent countries.  Each has signed a Compact of Free Association that gives the United States exclusive military access in return for U.S. defense protection and conduct of military foreign affairs (except the declaration of war) and a few billion dollars of aid.  These agreements also generally allow citizens of these countries to live and work in the United States with their spouses (and vice versa), and provide for largely free trade.  The federal government also grants access to services from domestic agencies, including the Federal Emergency Management Agency, National Weather Service, the United States Postal Service, the Federal Aviation Administration, the Federal Communications Commission, and U.S. representation to the International Frequency Registration Board of the International Telecommunication Union.\n\nNon-participation in multi-lateral agreements\n\nThe United States notably does not participate in various international agreements adhered to by almost all other industrialized countries, by almost all the countries of the Americas, or by almost all other countries in the world.  With a large population and economy, on a practical level this can undermine the effect of certain agreements,The power of the League was limited by the United States' refusal to join.The United States was responsible for 36% of greenhouse gas emissions at the time of the Kyoto Protocol or give other countries a precedent to cite for non-participation in various agreements.[http://www.huffingtonpost.com/entry/the-united-states-should_b_10930236 The United States Should Ratify The Law Of The Sea Convention] (due to China citing U.S. citing non-ratification as a reason it doesn't need to follow the agreement)\n\nIn some cases the arguments against participation include that the United States should maximize its sovereignty and freedom of action, or that ratification would create a basis for lawsuits that would treat American citizens unfairly.  In other cases, the debate became involved in domestic political issues, such as gun control, climate change, and the death penalty.\n\nExamples include:\n* Versailles Treaty and the League of Nations covenant (in force 1920–45, signed but not ratified)\n* International Covenant on Civil and Political Rights (took effect in 1976, ratified with substantial reservations)\n* International Covenant on Economic, Social and Cultural Rights (took effect in 1976, signed but not ratified)\n* American Convention on Human Rights (took effect in 1978)\n* Convention on the Elimination of All Forms of Discrimination against Women (took effect in 1981, signed but not ratified)\n* Convention on the Rights of the Child (took effect in 1990, signed but not ratified)\n* United Nations Convention on the Law of the Sea (took effect in 1994)\n* Comprehensive Nuclear-Test-Ban Treaty (signed in 1996 but never ratified and never took effect)\n* Mine Ban Treaty (took effect in 1999)\n* International Criminal Court (took effect in 2002)\n* Kyoto Protocol (in force 2005–12, signed but not ratified)\n* Optional Protocol to the Convention against Torture (took effect in 2006)\n* Convention on the Rights of Persons with Disabilities (took effect in 2008, signed but not ratified)\n* Convention on Cluster Munitions (took effect in 2010)\n* International Convention for the Protection of All Persons from Enforced Disappearance (took effect in 2010)\n* Arms Trade Treaty (took effect in 2014)\n* Other human rights treaties\n\nHub and spoke vs multilateral\n\nWhile America's relationships with Europe have tended to be in terms of multilateral frameworks, such as NATO, America's relations with Asia have tended to be based on a \"hub and spoke\" model using a series of bilateral relationships where states coordinate with the United States and do not collaborate with each other.  On May 30, 2009, at the Shangri-La Dialogue Defense Secretary Robert M. Gates urged the nations of Asia to build on this hub and spoke model as they established and grew multilateral institutions such as ASEAN, APEC and the ad hoc arrangements in the area. However, in 2011 Gates said that the United States must serve as the \"indispensable nation,\" for building multilateral cooperation.Shanker, Tom. [https://www.nytimes.com/2011/06/03/world/asia/03Gates.html \"Gates Talks of Boosting Asian Security Despite Budget Cuts.\"] New York Times, 1 June 2011.\n\nOil\n\nPersian Gulf\n\nAs of 2014, the U.S. currently produces about 66% of the oil that it consumes. While its imports have exceeded domestic production since the early 1990s, new hydraulic fracturing techniques and discovery of shale oil deposits in Canada and the American Dakotas offer the potential for increased energy independence from oil exporting countries such as OPEC. Former U.S. President George W. Bush identified dependence on imported oil as an urgent \"national security concern\".[https://www.bloomberg.com/apps/news?pid10000087&sid\nar4D7HVGikXo&refer=top_world_news Bush Leverage With Russia, Iran, China Falls as Oil Prices Rise], Bloomberg.com\n\nTwo-thirds of the world's proven oil reserves are estimated to be found in the\nPersian Gulf.[https://query.nytimes.com/gst/fullpage.html?res=9E02E4D6123AF93AA15752C0A9649C8B63 Shrinking Our Presence in Saudi Arabia], New York Times[http://science.nationalgeographic.com/science/environment/alternative-energy/end-cheap-oil.html The End of Cheap Oil], National Geographic Despite its distance, the Persian Gulf region was first proclaimed to be of national interest to the United States during World War II. Petroleum is of central importance to modern armies, and the United States—as the world's leading oil producer at that time—supplied most of the oil for the Allied armies. Many U.S. strategists were concerned that the war would dangerously reduce the U.S. oil supply, and so they sought to establish good relations with Saudi Arabia, a kingdom with large oil reserves.\n\nThe Persian Gulf region continued to be regarded as an area of vital importance to the United States during the Cold War. Three Cold War United States Presidential doctrines—the Truman Doctrine, the Eisenhower Doctrine, and the Nixon Doctrine—played roles in the formulation of the Carter Doctrine, which stated that the United States would use military force if necessary to defend its \"national interests\" in the Persian Gulf region.[http://www.msnbc.msn.com/id/20874331/ The war is about oil but it's not that simple], msnbc.com Carter's successor, President Ronald Reagan, extended the policy in October 1981 with what is sometimes called the \"Reagan Corollary to the Carter Doctrine\", which proclaimed that the United States would intervene to protect Saudi Arabia, whose security was threatened after the outbreak of the Iran–Iraq War.[http://www.history.navy.mil/wars/dstorm/sword-shield.htm The United States Navy and the Persian Gulf]  Some analysts have argued that the implementation of the Carter Doctrine and the Reagan Corollary also played a role in the outbreak of the 2003 Iraq War.[http://www.haaretz.com/hasen/spages/996605.html What if the Chinese were to apply the Carter Doctrine?], Haaretz - Israel News[http://www.time.com/time/magazine/article/0,9171,921819,00.html Selling the Carter Doctrine], TIME[http://www.timesonline.co.uk/tol/news/world/article2461214.ece Alan Greenspan claims Iraq war was really for oil], Times Online[https://www.theguardian.com/world/2008/jun/20/iraq.oil Oil giants to sign contracts with Iraq], The Guardian\n\nCanada\n\nAlmost all of Canada's energy exports go to the United States, making it the largest foreign source of U.S. energy imports: Canada is consistently among the top sources for U.S. oil imports, and it is the largest source of U.S. natural gas and electricity imports.See Energy Information Administration, [http://www.eia.doe.gov/emeu/cabs/Canada/Background.html \"Canada\" (2009 report)] \n\nAfrica\n\nIn 2007 the U.S. was Sub-Saharan Africa's largest single export market accounting for 28% of exports (second in total to the EU at 31%). 81% of U.S. imports from this region were petroleum products.\n\nForeign aid\n\nForeign assistance is a core component of the State Department's international affairs budget, which is $49 billion in all for 2014.See [http://appropriations.house.gov/uploadedfiles/01.13.14_fy_2014_omnibus_-_state_foreign_operations_-_summary.pdf \"FY 2014 Omnibus – State and Foreign Operations Appropriations\" (Jan 2014)]  Aid is considered an essential instrument of U.S. foreign policy. There are four major categories of non-military foreign assistance: bilateral development aid, economic assistance supporting U.S. political and security goals, humanitarian aid, and multilateral economic contributions (for example, contributions to the World Bank and International Monetary Fund).\n\nIn absolute dollar terms, the United States government is the largest international aid donor ($23 billion in 2014).  The U.S. Agency for International Development (USAID) manages the bulk of bilateral economic assistance; the Treasury Department handles most multilateral aid. In addition many private agencies, churches and philanthropies provide aid.\n\nAlthough the United States is the largest donor in absolute dollar terms, it is actually ranked 19 out of 27 countries on the Commitment to Development Index. The CDI ranks the 27 richest donor countries on their policies that affect the developing world. In the aid component the United States is penalized for low net aid volume as a share of the economy, a large share of tied or partially tied aid, and a large share of aid given to less poor and relatively undemocratic governments.\n\nForeign aid is a highly partisan issue in the United States, with liberals, on average, supporting foreign aid much more than conservatives do.\n\nMilitary\n\nAs of 2016, the United States is actively conducting military operations against the Islamic State of Iraq and the Levant and Al-Qaeda under the Authorization for Use of Military Force Against Terrorists, including in areas of fighting in the Syrian Civil War and Yemeni Civil War.  The Guantanamo Bay Naval Base holds what the federal government considers unlawful combatants from these ongoing activities, and has been a controversial issue in foreign relations, domestic politics, and Cuba–United States relations.  Other major U.S. military concerns include stability in Afghanistan and Iraq after the recent invasions of those countries, and Russian military activity in Ukraine.\n\nMutual defense agreements\n\nThe United States is a founding member of NATO, an alliance of 28 North American and European nations formed to defend Western Europe against the Soviet Union during the Cold War.  Under the NATO charter, the United States is compelled to defend any NATO state that is attacked by a foreign power.  The United States itself was the first country to invoke the mutual defense provisions of the alliance, in response to the September 11 attacks.\n\nThe United States also has mutual military defense treaties with:\n* Australia and New Zealand\n* Japan\n* South Korea\n* Philippines\n* Thailand, with other states formerly in the Southeast Asia Treaty Organization\n* Most countries in South America, Central America, and the Caribbean, through the Inter-American Treaty of Reciprocal Assistance\n\nThe United States has responsibility for the defense of the three Compact of Free Association states: Federated States of Micronesia, the Marshall Islands, and Palau.\n\nOther allies and multilateral organizations\n\nIn 1989, the United States also granted five nations the major non-NATO ally status (MNNA), and additions by later presidents have brought the list to 28 nations. Each such state has a unique relationship with the United States, involving various military and economic partnerships and alliances.\n\nand lesser agreements with:\n* Taiwan\n* Israel\n* Saudi Arabia\n\nThe U.S. participates in various military-related multi-lateral organizations, including:\n* Organisation for the Prohibition of Chemical Weapons\n* International Atomic Energy Agency\n\nThe U.S. also operates hundreds of military bases around the world.\n\nUnilateral vs. multilateral military actions\n\nThe United States has undertaken unilateral and multilateral military operations throughout its history (see Timeline of United States military operations).  In the post-World War II era, the country has had permanent membership and veto power in the United Nations Security Council, allowing it to undertake any military action without formal Security Council opposition.  With vast military expenditures, the United States is known as the sole remaining superpower after the collapse of the Soviet Union.  The U.S. contributes a relatively small number of personnel for United Nations peacekeeping operations.  It sometimes acts though NATO, as with the NATO intervention in Bosnia and Herzegovina, NATO bombing of Yugoslavia, and ISAF in Afghanistan, but often acts unilaterally or in ad-hoc coalitions as with the 2003 invasion of Iraq.\n\nThe United Nations Charter requires that military operations be either for self-defense or affirmatively approved by the Security Council.  Though many of their operations have followed these rules, the United States and NATO have been accused of committing crimes against peace in international law, for example in the 1999 Yugoslavia and 2003 Iraq operations.\n\nAid\n\nThe U.S. provides military aid through many different channels. Counting the items that appear in the budget as 'Foreign Military Financing' and 'Plan Colombia', the U.S. spent approximately $4.5 billion in military aid in 2001, of which $2 billion went to Israel, $1.3 billion went to Egypt, and $1 billion went to Colombia. Since 9/11, Pakistan has received approximately $11.5 billion in direct military aid.\n\nAs of 2004, according to Fox News, the U.S. had more than 700 military bases in 130 different countries.Fox News, 1 November 2004 [http://www.globalsecurity.org/org/news/2004/041101-iraq-basing.htm Analysts Ponder U.S. Basing in Iraq]\n\nEstimated U.S. foreign military financing and aid by recipient for 2010:\n\nAccording to a 2016 report by the Congressional Research Service, the U.S. topped the market in global weapon sales for 2015, with $40 billion sold. The largest buyers were Qatar, Egypt, Saudi Arabia, South Korea, Pakistan, Israel, the United Arab Emirates and Iraq.\n\nMissile defense\n\nThe Strategic Defense Initiative (SDI) was a proposal by U.S. President Ronald Reagan on March 23, 1983Federation of American Scientists. [https://fas.org/spp/starwars/program/milestone.htm Missile Defense Milestones] . Accessed March 10, 2006. to use ground and space-based systems to protect the United States from attack by strategic nuclear ballistic missiles,[https://www.independent.co.uk/opinion/commentators/johann-hari/johann-hari-obamas-chance-to-end-the--fantasy-that-is-star-wars-1015509.html Johann Hari: Obama's chance to end the fantasy that is Star Wars], The Independent, November 13, 2008 later dubbed \"Star Wars\".[http://www.cnn.com/SPECIALS/cold.war/episodes/22/documents/starwars.speech/ Historical Documents: Reagan's 'Star Wars' speech] , CNN Cold War The initiative focused on strategic defense rather than the prior strategic offense doctrine of mutual assured destruction (MAD). Though it was never fully developed or deployed, the research and technologies of SDI paved the way for some anti-ballistic missile systems of today.\n\nIn February 2007, the U.S. started formal negotiations with Poland and Czech Republic concerning construction of missile shield installations in those countries for a Ground-Based Midcourse Defense system (in April 2007, 57% of Poles opposed the plan).[https://www.washingtonpost.com/wp-dyn/content/article/2007/04/24/AR2007042400871.html U.S. Might Negotiate on Missile Defense], washingtonpost.com According to press reports the government of the Czech Republic agreed (while 67% Czechs disagree)[http://www.cvvm.cas.cz/upl/zpravy/100761s_pm80306.pdf Citizens on U.S. Anti-Missile Radar Base in Czech Republic]  to host a missile defense radar on its territory while a base of missile interceptors is supposed to be built in Poland.[http://news.bbc.co.uk/2/hi/europe/6704669.stm Europe diary: Missile defence], BBC News\n\nRussia threatened to place short-range nuclear missiles on the Russia's border with NATO if the United States refuses to abandon plans to deploy 10 interceptor missiles and a radar in Poland and the Czech Republic.[http://www.telegraph.co.uk/news/worldnews/1569495/Russia-piles-pressure-on-EU-over-missile-shield.html Russia piles pressure on EU over missile shield], Telegraph[http://www.iht.com/articles/ap/2008/05/23/asia/AS-GEN-China-Russia.php China, Russia sign nuclear deal, condemn U.S. missile defense plans], International Herald Tribune In April 2007, Putin warned of a new Cold War if the Americans deployed the shield in Central Europe.[https://www.theguardian.com/world/2007/apr/11/usa.topstories3 Russia threatening new cold war over missile defence], The Guardian Putin also said that Russia is prepared to abandon its obligations under an Intermediate-Range Nuclear Forces Treaty of 1987 with the United States.[https://www.usatoday.com/news/world/2007-10-12-us-russia_N.htm U.S., Russia no closer on missile defense], USATODAY.com\n\nOn August 14, 2008, the United States and Poland announced a deal to implement the missile defense system in Polish territory, with a tracking system placed in the Czech Republic.[https://www.nytimes.com/2008/08/15/world/europe/16poland.html?hp Russia Lashes Out on Missile Deal], The New York Times, August 15, 2008 \"The fact that this was signed in a period of very difficult crisis in the relations between Russia and the United States over the situation in Georgia shows that, of course, the missile defense system will be deployed not against Iran but against the strategic potential of Russia\", Dmitry Rogozin, Russia's NATO envoy, said.[http://english.aljazeera.net/news/europe/2008/08/200881514010734640.html Russia angry over U.S. missile shield], Al Jazeera English, August 15, 2008\n\nKeir A. Lieber and Daryl G. Press, argue in Foreign Affairs that U.S. missile defenses are designed to secure Washington's nuclear primacy and are chiefly directed at potential rivals, such as Russia and China. The authors note that Washington continues to eschew nuclear first strike and contend that deploying missile defenses \"would be valuable primarily in an offensive context, not a defensive one; as an adjunct to a US First Strike capability, not as a stand-alone shield\":\n\nIf the United States launched a nuclear attack against Russia (or China), the targeted country would be left with only a tiny surviving arsenal, if any at all. At that point, even a relatively modest or inefficient missile defense system might well be enough to protect against any retaliatory strikes.[https://www.foreignaffairs.com/articles/united-states/2006-03-01/rise-us-nuclear-primacy \"The Rise of U.S. Nuclear Primacy\"] Keir A. Lieber and Daryl G. Press, Foreign Affairs, March/April 2006\n\nThis analysis is corroborated by the Pentagon's 1992 Defense Planning Guidance (DPG), prepared by then Secretary of Defense Richard Cheney and his deputies. The DPG declares that the United States should use its power to \"prevent the reemergence of a new rival\" either on former Soviet territory or elsewhere. The authors of the Guidance determined that the United States had to \"Field a missile defense system as a shield against accidental missile launches or limited missile strikes by 'international outlaws'\" and also must \"Find ways to integrate the 'new democracies' of the former Soviet bloc into the U.S.-led system\". The National Archive notes that Document 10 of the DPG includes wording about \"disarming capabilities to destroy\" which is followed by several blacked out words. \"This suggests that some of the heavily excised pages in the still-classified DPG drafts may include some discussion of preventive action against threatening nuclear and other WMD programs.\"[http://nsarchive.gwu.edu/nukevault/ebb245/ \"Prevent the Reemergence of a New Rival\"] The National Security Archive\n\nFinally, Robert David English, writing in Foreign Affairs, observes that in addition to the deployment U.S. missile defenses, the DPG's second recommendation has also been proceeding on course. \"Washington has pursued policies that have ignored Russian interests (and sometimes international law as well) in order to encircle Moscow with military alliances and trade blocs conducive to U.S. interests.\"[https://www.foreignaffairs.com/articles/russian-federation/2017-03-10/russia-trump-and-new-d-tente \"Russia, Trump, and a New Détente\"] Foreign Affairs, March 10, 2017\n\nExporting democracy\n\n  \n\nIn United States history, critics have charged that presidents have used democracy to justify military intervention abroad. Also see [https://www.webcitation.org/query?url\nhttp://www.geocities.com/travbailey/why.html&date2009-10-25+23:16:02 this page]. Critics have also charged that the U.S. helped local militaries overthrow democratically elected governments in Iran, Guatemala, and in other instances. Studies have been devoted to the historical success rate of the U.S. in exporting democracy abroad. Some studies of American intervention have been pessimistic about the overall effectiveness of U.S. efforts to encourage democracy in foreign nations.PDF file. Until recently, scholars have generally agreed with international relations professor Abraham Lowenthal that U.S. attempts to export democracy have been \"negligible, often counterproductive, and only occasionally positive.\" Other studies find U.S. intervention has had mixed results, and another by Hermann and Kegley has found that military interventions have improved democracy in other countries.\n\nOpinion that U.S. intervention does not export democracy\n\nProfessor Paul W. Drake argued that the U.S. first attempted to export democracy in Latin America through intervention from 1912 to 1932. Drake argued that this was contradictory because international law defines intervention as \"dictatorial interference in the affairs of another state for the purpose of altering the condition of things.\" The study suggested that efforts to promote democracy failed because democracy needs to develop out of internal conditions, and can not be forcibly imposed. There was disagreement about what constituted democracy; Drake suggested American leaders sometimes defined democracy in a narrow sense of a nation having elections; Drake suggested a broader understanding was needed. Further, there was disagreement about what constituted a \"rebellion\"; Drake saw a pattern in which the U.S. State Department disapproved of any type of rebellion, even so-called \"revolutions\", and in some instances rebellions against dictatorships. Historian Walter LaFeber stated, \"The world's leading revolutionary nation (the U.S.) in the eighteenth century became the leading protector of the status quo in the twentieth century.\"\n\nMesquita and Downs evaluated 35 U.S. interventions from 1945 to 2004 and concluded that in only one case, Colombia, did a \"full fledged, stable democracy\" develop within ten years following the intervention.Factors included limits on executive power, clear rules for the transition of power, universal adult suffrage, and\ncompetitive elections. Samia Amin Pei argued that nation building in developed countries usually unravelled four to six years after American intervention ended. Pei, based on study of a database on worldwide democracies called Polity, agreed with Mesquita and Downs that U.S. intervention efforts usually don't produce real democracies, and that most cases result in greater authoritarianism after ten years.\n\nProfessor Joshua Muravchik argued U.S. occupation was critical for Axis power democratization after World War II, but America's failure to encourage democracy in the third world \"prove ... that U.S. military occupation is not a sufficient condition to make a country democratic.\"Peceny, p. 186. The success of democracy in former Axis countries such as Italy were seen as a result of high national per-capita income, although U.S. protection was seen as a key to stabilization and important for encouraging the transition to democracy. Steven Krasner agreed that there was a link between wealth and democracy; when per-capita incomes of $6,000 were achieved in a democracy, there was little chance of that country ever reverting to an autocracy, according to an analysis of his research in the Los Angeles Times.\n\nOpinion that U.S. intervention has mixed results\n\nTures examined 228 cases of American intervention from 1973 to 2005, using Freedom House data. A plurality of interventions, 96, caused no change in the country's democracy. In 69 instances, the country became less democratic after the intervention. In the remaining 63 cases, a country became more democratic. However this does not take into account the direction the country would have gone with no U.S. intervention.\n\nOpinion that U.S. intervention effectively exports democracy\n\nHermann and Kegley found that American military interventions designed to protect or promote democracy increased freedom in those countries. Peceny argued that the democracies created after military intervention are still closer to an autocracy than a democracy, quoting Przeworski \"while some democracies are more democratic than others, unless offices are contested, no regime should be considered democratic.\" Therefore, Peceny concludes, it is difficult to know from the Hermann and Kegley study whether U.S. intervention has only produced less repressive autocratic governments or genuine democracies.Peceny, p. 193\n\nPeceny stated that the United States attempted to export democracy in 33 of its 93 20th-century military interventions.Peceny, p. 2 Peceny argued that proliberal policies after military intervention had a positive impact on democracy.Review: \n\nGlobal opinion\n\nA global survey done by Pewglobal indicated that at (as of 2014) least 33 surveyed countries have a positive view (50% or above) of the United States. With the top ten most positive countries being Philippines (92%), Israel (84%), South Korea (82%), Kenya (80%), El Salvador (80%), Italy (78%), Ghana (77%), Vietnam (76%), Bangladesh (76%), and Tanzania (75%). While 10 surveyed countries have the most negative view (Below 50%) of the United States. With the countries being Egypt (10%), Jordan (12%), Pakistan (14%), Turkey (19%), Russia (23%), Palestinian Territories (30%), Greece (34%), Argentina (36%), Lebanon (41%), Tunisia (42%). Americans' own view of the United States was viewed at 84%.\nInternational opinion about the US has often changed with different executive administrations. For example in 2009, the French public favored the United States when President Barack Obama (75% favorable) replaced President George W. Bush (42%). After President Donald Trump took the helm in 2017, French public opinion about the US fell from 63% to 46%. These trends were also seen in other European countries.\n http://www.pewresearch.org/fact-tank/2017/08/18/6-trends-in-international-public-opinion-from-our-global-indicators-database/\n\nCovert actions\n\nUnited States foreign policy also includes covert actions to topple foreign governments that have been opposed to the United States. According to J. Dana Stuster, writing in Foreign Policy, there are seven \"confirmed cases\" where the U.S.—acting principally through the Central Intelligence Agency (CIA), but sometimes with the support of other parts of the U.S. government, including the Navy and State Department—covertly assisted in the overthrow of a foreign government: Iran in 1953, Guatemala in 1954, Congo in 1960, the Dominican Republic in 1961, South Vietnam in 1963, Brazil in 1964, and Chile in 1973. Stuster states that this list excludes \"U.S.-supported insurgencies and failed assassination attempts\" such as those directed against Cuba's Fidel Castro, as well as instances where U.S. involvement has been alleged but not proven (such as Syria in 1949).\n\nIn 1953 the CIA, working with the British government, initiated Operation Ajax against the Prime Minister of Iran Mohammad Mossadegh who had attempted to nationalize Iran's oil, threatening the interests of the Anglo-Persian Oil Company. This had the effect of restoring and strengthening the authoritarian monarchical reign of Shah Mohammad Reza Pahlavi. In 1957, the CIA and Israeli Mossad aided the Iranian government in establishing its intelligence service, SAVAK, later blamed for the torture and execution of the regime's opponents.\n\nA year later, in Operation PBSUCCESS, the CIA assisted the local military in toppling the democratically elected left-wing government of Jacobo Árbenz in Guatemala and installing the military dictator Carlos Castillo Armas. The United Fruit Company lobbied for Árbenz overthrow as his land reforms jeopardized their land holdings in Guatemala, and painted these reforms as a communist threat. The coup triggered a decades long civil war which claimed the lives of an estimated 200,000 people (42,275 individual cases have been documented), mostly through 626 massacres against the Maya population perpetrated by the U.S.-backed Guatemalan military.Stephen Schlesinger (3 June 2011). [https://www.nytimes.com/2011/06/04/opinion/04schlesinger.html?_r0 Ghosts of Guatemala's Past]. The New York Times. Retrieved 5 July 2014. An independent Historical Clarification Commission found that U.S. corporations and government officials \"exercised pressure to maintain the country's archaic and unjust socio-economic structure,\" and that the CIA backed illegal counterinsurgency operations.\n\nDuring the massacre of at least 500,000 alleged communists in 1960s Indonesia, U.S. government officials applauded the mass killings while providing covert assistance to the Indonesian military which helped facilitate them.Samantha Michaels (October 1, 2015). [http://www.motherjones.com/politics/2015/09/its-been-50-years-biggest-us-backed-genocide-youve-never-heard It's Been 50 Years Since the Biggest US-Backed Genocide You've Never Heard Of]. Mother Jones. Retrieved December 25, 2015. This included the U.S. Embassy in Jakarta supplying Indonesian forces with lists of up to 5,000 names of suspected members of the Communist Party of Indonesia (PKI), who were subsequently killed in the massacres.Bellamy, Alex J. (2012). Massacres and Morality: Mass Atrocities in an Age of Civilian Immunity. Oxford University Press. . [https://books.google.com/books?idEK8eK2xPCycC&lpg\nPP1&pgPA210#v\nonepage&q&ffalse p. 210.]Mark Aarons (2007). \"[https://books.google.com/books?iddg0hWswKgTIC&lpg\nPA80&pgPA69#v\nonepage&q&ffalse Justice Betrayed: Post-1945 Responses to Genocide].\" In David A. Blumenthal and Timothy L. H. McCormack (eds). [http://www.brill.com/legacy-nuremberg-civilising-influence-or-institutionalised-vengeance The Legacy of Nuremberg: Civilising Influence or Institutionalised Vengeance? (International Humanitarian Law).] Martinus Nijhoff Publishers.  [https://books.google.com/books?id\ndg0hWswKgTIC&lpgPP1&pg\nPA81#vonepage&q&f\nfalse pp. 80–81]Vickers, Adrian (2005). A History of Modern Indonesia. Cambridge University Press.  p. 157Friend, Theodore (2003). Indonesian Destinies. Harvard University Press.  p. 117 In 2001, the CIA attempted to prevent the publication of the State Department volume Foreign Relations of the United States, 1964–1968, which documents the U.S. role in providing covert assistance to the Indonesian military for the express purpose of the extirpation of the PKI.Margaret Scott (November 2, 2015) [http://www.nybooks.com/blogs/nyrblog/2015/nov/02/indonesian-massacre-what-did-us-know/ The Indonesian Massacre: What Did the US Know?] The New York Review of Books. Retrieved November 6, 2015.[http://articles.latimes.com/2001/jul/28/news/mn-27536 U.S. Seeks to Keep Lid on Far East Purge Role]. The Associated Press via The Los Angeles Times, July 28, 2001. Retrieved November 6, 2015.Thomas Blanton (ed). [http://nsarchive.gwu.edu/NSAEBB/NSAEBB52/ CIA STALLING STATE DEPARTMENT HISTORIES: STATE HISTORIANS CONCLUDE U.S. PASSED NAMES OF COMMUNISTS TO INDONESIAN ARMY, WHICH KILLED AT LEAST 105,000 IN 1965–66]. National Security Archive Electronic Briefing Book No. 52., July 27, 2001. Retrieved November 6, 2015. In July 2016,  an international panel of judges ruled the killings constitute crimes against humanity, and that the US, along with other Western governments, were complicit in these crimes.\n\nIn 1970, the CIA worked with coup-plotters in Chile in the attempted kidnapping of General René Schneider, who was targeted for refusing to participate in a military coup upon the election of Salvador Allende. Schneider was shot in the botched attempt and died three days later. The CIA later paid the group $35,000 for the failed kidnapping.[http://abcnews.go.com/International/story?id82588 CIA Admits Involvement in Chile]. ABC News. September 20John Dinges. The Condor Years: How Pinochet And His Allies Brought Terrorism To Three Continents. The New Press, 2005. [https://books.google.com/books?id\n3JjtHROah_YC&lpgPP1&pg\nPA20#vonepage&q&f\nfalse p. 20]. \n\nInfluencing foreign elections\n\nAccording to one peer-reviewed study, the U.S. intervened in 81 foreign elections between 1946 and 2000, while the Soviet Union or Russia intervened in 36. See the full list of interventions in the [http://isq.oxfordjournals.org/content/isq/suppl/2016/02/29/sqv016.DC1/appendix_2.pdf appendix.]\n\nHuman rights\n\nSince the 1970s, issues of human rights have become increasingly important in American foreign policy.Joe Renouard, Human Rights in American Foreign Policy: From the 1960s to the Soviet Collapse (U of Pennsylvania Press, 2016). 324 pp. Congress took the lead in the 1970s. Following the Vietnam War, the feeling that U.S. foreign policy had grown apart from traditional American values was seized upon by Senator Donald M. Fraser (D, MI), leading the Subcommittee on International Organizations and Movements, in criticizing Republican Foreign Policy under the Nixon administration. In the early 1970s, Congress concluded the Vietnam War and passed the War Powers Act. As \"part of a growing assertiveness by Congress about many aspects of Foreign Policy,\" Human Rights concerns became a battleground between the Legislative and the Executive branches in the formulation of foreign policy. David Forsythe points to three specific, early examples of Congress interjecting its own thoughts on foreign policy:\n\n# Subsection (a) of the International Financial Assistance Act of 1977: ensured assistance through international financial institutions would be limited to countries \"other than those whose governments engage in a consistent pattern of gross violations of internationally recognized human rights.\"\n# Section 116 of the Foreign Assistance Act of 1961, as amended in 1984: reads in part, \"No assistance may be provided under this part to the government of any country which engages in a consistent pattern of gross violations of internationally recognized human rights.\"\n# Section 502B of the Foreign Assistance Act of 1961, as amended in 1978: \"No security assistance may be provided to any country the government of which engages in a consistent pattern of gross violations of internationally recognized human rights.\"\n\nThese measures were repeatedly used by Congress, with varying success, to affect U.S. foreign policy towards the inclusion of Human Rights concerns. Specific examples include El Salvador, Nicaragua, Guatemala and South Africa. The Executive (from Nixon to Reagan) argued that the Cold War required placing regional security in favor of U.S. interests over any behavioral concerns of national allies. Congress argued the opposite, in favor of distancing the United States from oppressive regimes. Nevertheless, according to historian Daniel Goldhagen, during the last two decades of the Cold War, the number of American client states practicing mass murder outnumbered those of the Soviet Union.Daniel Goldhagen (2009). Worse Than War. PublicAffairs.  p. 537\n* \"During the 1970s and 1980s, the number of American client states practicing mass-murderous politics exceeded those of the Soviets.\" John Henry Coatsworth, a historian of Latin America and the provost of Columbia University, suggests the number of repression victims in Latin America alone far surpassed that of the USSR and its East European satellites during the period 1960 to 1990. W. John Green contends that the United States was an \"essential enabler\" of \"Latin America's political murder habit, bringing out and allowing to flourish some of the region's worst tendencies.\"W. John Green (June 1, 2015). [http://www.sunypress.edu/p-6060-a-history-of-political-murder-i.aspx A History of Political Murder in Latin America: Killing the Messengers of Change] . SUNY Press. [https://books.google.com/books?idNyezCAAAQBAJ&lpg\nPP1&pgPA147#v\nonepage&q&f=false p. 147]. \n\nOn December 6, 2011, Obama instructed agencies to consider LGBT rights when issuing financial aid to foreign countries. He also criticized Russia's law discriminating against gays, joining other western leaders in the boycott of the 2014 Winter Olympics in Russia.\n\nIn June 2014, a Chilean court ruled that the United States played a key role in the murders of Charles Horman and Frank Teruggi, both American citizens, shortly after the 1973 Chilean coup d'état.Pascale Bonnefoy (30 June 2014). [https://www.nytimes.com/2014/07/01/world/americas/chilean-court-rules-us-had-role-in-murders.html?_r=0 Chilean Court Rules U.S. Had Role in Murders]. The New York Times. Retrieved 4 July 2014.\n\nWar on Drugs\n\nUnited States foreign policy is influenced by the efforts of the U.S. government to control imports of illicit drugs, including cocaine, heroin, methamphetamine, and cannabis. This is especially true in Latin America, a focus for the U.S. War on Drugs. Those efforts date back to at least 1880, when the U.S. and China completed an agreement that prohibited the shipment of opium between the two countries.\n\nOver a century later, the Foreign Relations Authorization Act requires the President to identify the major drug transit or major illicit drug-producing countries. In September 2005, the following countries were identified: Bahamas, Bolivia, Brazil, Burma, Colombia, Dominican Republic, Ecuador, Guatemala, Haiti, India, Jamaica, Laos, Mexico, Nigeria, Pakistan, Panama, Paraguay, Peru and Venezuela. Two of these, Burma and Venezuela are countries that the U.S. considers to have failed to adhere to their obligations under international counternarcotics agreements during the previous 12 months. Notably absent from the 2005 list were Afghanistan, the People's Republic of China and Vietnam; Canada was also omitted in spite of evidence that criminal groups there are increasingly involved in the production of MDMA destined for the United States and that large-scale cross-border trafficking of Canadian-grown cannabis continues. The U.S. believes that the Netherlands are successfully countering the production and flow of MDMA to the U.S.\n\nCriticism\n\nCritics from the left cite episodes that undercut leftist governments or showed support for Israel. Others cite human rights abuses and violations of international law. Critics have charged that the U.S. presidents have used democracy to justify military intervention abroad. Critics also point to declassified records which indicate that the CIA under Allen Dulles and the FBI under J. Edgar Hoover aggressively recruited more than 1,000 Nazis, including those responsible for war crimes, to use as spies and informants against the Soviet Union in the Cold War.Eric Lichtblau (October 26, 2014). [https://www.nytimes.com/2014/10/27/us/in-cold-war-us-spy-agencies-used-1000-nazis.html In Cold War, U.S. Spy Agencies Used 1,000 Nazis]. The New York Times. Retrieved November 10, 2014.[http://www.democracynow.org/2014/10/31/the_nazis_next_door_eric_lichtblau The Nazis Next Door: Eric Lichtblau on How the CIA & FBI Secretly Sheltered Nazi War Criminals]. Democracy Now! October 31, 2014.\n\nThe U.S. has faced criticism for backing right-wing dictators that systematically violated human rights, such as Augusto Pinochet of Chile,Peter Kornbluh (September 11, 2013). The Pinochet File: A Declassified Dossier on Atrocity and Accountability. The New Press.  [https://books.google.com/books?idWHYRBAAAQBAJ&lpg\nPP1&pgPR18#v\nonepage&q&ffalse p. xviii] Alfredo Stroessner of Paraguay,Walter L. Hixson (2009). [http://yalepress.yale.edu/book.asp?isbn9780300119121 The Myth of American Diplomacy: National Identity and U.S. Foreign Policy]. Yale University Press. [https://books.google.com/books?id\nDNId6HxkzQwC&lpgPP1&pg\nPA223#vonepage&q&f\nfalse p. 223].  Efraín Ríos Montt of Guatemala,[https://www.nytimes.com/roomfordebate/2013/05/19/what-guilt-does-the-us-bear-in-guatemala What Guilt Does the U.S. Bear in Guatemala?] The New York Times, May 19, 2013. Retrieved July 1, 2014. Jorge Rafael Videla of Argentina,Duncan Campbell (December 5, 2003). [https://www.theguardian.com/world/2003/dec/06/argentina.usa Kissinger approved Argentinian 'dirty war']. The Guardian. Retrieved August 29, 2015. Hissène Habré of Chad[https://www.nytimes.com/2016/05/31/world/africa/hissene-habre-leader-chad-war-crimes.html?_r0 Hissène Habré, Ex-President of Chad, Is Convicted of War Crimes]. The New York Times. May 30, 2016.[http://www.democracynow.org/2016/5/31/from_us_ally_to_convicted_war From U.S. Ally to Convicted War Criminal: Inside Chad's Hissène Habré's Close Ties to Reagan Admin]. Democracy Now! May 31, 2016. Yahya Khan of Pakistan[http://www.newyorker.com/news/news-desk/looking-away-from-genocide Looking Away from Genocide]. The New Yorker. November 19, 2013. and Suharto of Indonesia.Kai Thaler (December 2, 2015). [https://www.washingtonpost.com/news/monkey-cage/wp/2015/12/02/50-years-ago-today-the-u-s-embassy-endorsed-mass-killings-in-indonesia-heres-what-that-means-for-today/ 50 years ago today, American diplomats endorsed mass killings in Indonesia. Here's what that means for today.] The Washington Post. Retrieved December 4, 2015. Critics have also accused the United States of supporting Operation Condor, an international campaign of political assassination and state terror organized by right-wing military dictatorships in the Southern Cone of South America.Greg Grandin (2011). [http://www.press.uchicago.edu/ucp/books/book/chicago/L/bo11643711.html The Last Colonial Massacre: Latin America in the Cold War]. University of Chicago Press. [https://books.google.com/books?id6FivSpNY2fkC&lpg\nPP1&pgPA75#v\nonepage&q&f=false p. 75]. \n\nJournalists and human rights organizations have been critical of US-led airstrikes and targeted killings by drones which have in some cases resulted in collateral damage of civilian populations.[http://www.cnn.com/2016/07/19/world/syria-airstrikes-civilian-casualties/ U.S.-led airstrikes in Syria kill civilians, rights groups say]. CNN. July 20, 2016.Jeremy Scahill and the staff of The Intercept (2016).  The Assassination Complex: Inside the Government's Secret Drone Warfare Program. Simon & Schuster.  In early 2017, the U.S. faced criticism from some scholars, activists and media outlets for dropping 26,171 bombs on seven different countries throughout 2016: Syria, Iraq, Afghanistan, Libya, Yemen, Somalia and Pakistan.\n\nStudies have been devoted to the historical success rate of the U.S. in exporting democracy abroad. Some studies of American intervention have been pessimistic about the overall effectiveness of U.S. efforts to encourage democracy in foreign nations. Some scholars have generally agreed with international relations professor Abraham Lowenthal that U.S. attempts to export democracy have been \"negligible, often counterproductive, and only occasionally positive.\" Other studies find U.S. intervention has had mixed results, and another by Hermann and Kegley has found that military interventions have improved democracy in other countries. A 2013 global poll in 68 countries with 66,000 respondents by Win/Gallup found that the U.S. is perceived as the biggest threat to world peace.\n\nSupport\n\nRegarding support for certain anti-Communist dictatorships during the Cold War, a response is that they were seen as a necessary evil, with the alternatives even worse Communist or fundamentalist dictatorships. David Schmitz says this policy did not serve U.S. interests. Friendly tyrants resisted necessary reforms and destroyed the political center (though not in South Korea), while the 'realist' policy of coddling dictators brought a backlash among foreign populations with long memories.The United States and Right-Wing Dictatorships, 1965–1989. David F. Schmitz. 2006.[http://www.telegraph.co.uk/opinion/main.jhtml?xml\n/opinion/2005/12/11/do1102.xml&sSheet=/opinion/2005/12/11/ixopinion.html Do the sums, then compare U.S. and Communist crimes from the Cold War] Telegraph, 11 December 2005, Niall Ferguson\n\nMany democracies have voluntary military ties with United States. See NATO, ANZUS, Treaty of Mutual Cooperation and Security between the United States and Japan, Mutual Defense Treaty with South Korea, and Major non-NATO ally. Those nations with military alliances with the U.S. can spend less on the military since they can count on U.S. protection. This may give a false impression that the U.S. is less peaceful than those nations.[http://www.economist.com/world/international/displaystory.cfm?story_id=9266967 Give peace a rating] May 31, 2007, from The Economist print edition[https://web.archive.org/web/20070626090409/http://www.japantoday.com/jp/news/407850/all Japan ranked as world's 5th most peaceful nation: report] Japan Today, May 31, 2007\n\nResearch on the democratic peace theory has generally found that democracies, including the United States, have not made war on one another. There have been U.S. support for coups against some democracies, but for example Spencer R. Weart argues that part of the explanation was the perception, correct or not, that these states were turning into Communist dictatorships. Also important was the role of rarely transparent United States government agencies, who sometimes mislead or did not fully implement the decisions of elected civilian leaders. pp. 221–24, 314.\n\nEmpirical studies (see democide) have found that democracies, including the United States, have killed much fewer civilians than dictatorships.Death By Government By R.J. Rummel New Brunswick, N.J.: Transaction Publishers, 1994. Online links: [http://www.hawaii.edu/powerkills/NOTE1.HTM] [http://www.hawaii.edu/powerkills/SOD.FIG23.4.GIF] [http://www.hawaii.edu/powerkills/POWER.FIG2.GIF][http://www.cidcm.umd.edu/inscr/genocide/ No Lessons Learned from the Holocaust?] , Barbara Harff, 2003. Media may be biased against the U.S. regarding reporting human rights violations. Studies have found that The New York Times coverage of worldwide human rights violations predominantly focuses on the human rights violations in nations where there is clear U.S. involvement, while having relatively little coverage of the human rights violations in other nations. For example, the bloodiest war in recent time, involving eight nations and killing millions of civilians, was the Second Congo War, which was almost completely ignored by the media.\n\nNiall Ferguson argues that the U.S. is incorrectly blamed for all the human rights violations in nations they have supported. He writes that it is generally agreed that Guatemala was the worst of the US-backed regimes during the Cold War. However, the U.S. cannot credibly be blamed for all the 200,000 deaths during the long Guatemalan Civil War. The U.S. Intelligence Oversight Board writes that military aid was cut for long periods because of such violations, that the U.S. helped stop a coup in 1993, and that efforts were made to improve the conduct of the security services.[http://www.ciponline.org/iob.htm Report on the Guatemala Review] Intelligence Oversight Board. June 28, 1996.\n\nToday the U.S. states that democratic nations best support U.S. national interests. According to the U.S. State Department, \"Democracy is the one national interest that helps to secure all the others. Democratically governed nations are more likely to secure the peace, deter aggression, expand open markets, promote economic development, protect American citizens, combat international terrorism and crime, uphold human and worker rights, avoid humanitarian crises and refugee flows, improve the global environment, and protect human health.\" According to former U.S. President Bill Clinton, \"Ultimately, the best strategy to ensure our security and to build a durable peace is to support the advance of democracy elsewhere. Democracies don't attack each other.\" In one view mentioned by the U.S. State Department, democracy is also good for business. Countries that embrace political reforms are also more likely to pursue economic reforms that improve the productivity of businesses. Accordingly, since the mid-1980s, under President Ronald Reagan, there has been an increase in levels of foreign direct investment going to emerging market democracies relative to countries that have not undertaken political reforms. Leaked cables in 2010 suggested that the \"dark shadow of terrorism still dominates the United States' relations with the world\".\n\nThe United States officially maintains that it supports democracy and human rights through several tools  Examples of these tools are as follows:\n* A published yearly report by the State Department entitled \"Advancing Freedom and Democracy\", issued in compliance with ADVANCE Democracy Act of 2007 (earlier the report was known as \"Supporting Human Rights and Democracy: The U.S. Record\" and was issued in compliance with a 2002 law).\n* A yearly published \"Country Reports on Human Rights Practices.\" \n* In 2006 (under President George W. Bush), the United States created a \"Human Rights Defenders Fund\" and \"Freedom Awards.\" \n* The \"Human Rights and Democracy Achievement Award\" recognizes the exceptional achievement of officers of foreign affairs agencies posted abroad.[https://web.archive.org/web/20061217115244/http://www.state.gov/g/drl/rls/77769.htm ]\n* The \"Ambassadorial Roundtable Series\", created in 2006, are informal discussions between newly confirmed U.S. Ambassadors and human rights and democracy non-governmental organizations.\n* The National Endowment for Democracy, a private non-profit created by Congress in 1983 (and signed into law by President Ronald Reagan), which is mostly funded by the U.S. Government and gives cash grants to strengthen democratic institutions around the world.\n\nBy country or region\n\nUnited Kingdom\n\nUnited States foreign policy affirms its alliance with the United Kingdom as its most important bilateral relationship in the world, evidenced by aligned political affairs between the White House and 10 Downing Street, as well as joint military operations carried out between the two nations. While both the United States and the United Kingdom maintain close relationships with many other nations around the world, the level of cooperation in military planning, execution of military operations, nuclear weapons technology, and intelligence sharing with each other has been described as \"unparalleled\" among major powers throughout the 20th and early 21st century.\n\nThe United States and Britain share the world's largest foreign direct investment partnership. American investment in the United Kingdom reached $255.4 billion in 2002, while British direct investment in the United States totaled $283.3 billion.US Department of State, Background Note on the United Kingdom\n\nCanada\n\nThe bilateral relationship between Canada and the United States is of notable importance to both countries. About 75–85% of Canadian trade is with the United States, and Canada is the United States' largest trading partner and chief supplier of oil. While there are disputed issues between the two nations, relations are close and the two countries share the \"world's longest undefended border.\"John Herd Thompson, and Stephen J. Randall, Canada and the United States: Ambivalent Allies (4th ed. McGill-Queen's University Press, 2008) is the standard scholarly survey The border was demilitarized after the War of 1812 and, apart from minor raids, has remained peaceful. Military collaboration began during World War II and continued throughout the Cold War on both a bilateral basis and a multilateral relationship through NATO. A high volume of trade and migration between the United States and Canada since the 1850s has generated closer ties, despite continued Canadian fears of being culturally overwhelmed by its neighbor, which is nine times larger in terms of population and eleven times larger in terms of economy. The two economies have increasingly merged since the North American Free Trade Agreement (NAFTA) of 1994, which also includes Mexico.\n\nMexico\n\nThe United States shares a unique and often complex relationship with Mexico. A history of armed conflict goes back to the Texas Revolution in the 1830s, the Mexican–American War in the 1840s, and an American invasion in the 1910s. Important treaties include the Gadsden Purchase, and multilaterally with Canada, the North American Free Trade Agreement. The central issue in recent years has been illegal immigration, followed by illegal gun sales (from the U.S.), drug smuggling (to the U.S.) and escalating drug cartel violence just south of the U.S.-Mexico border.Tim Padgett, \"Mexico's Calderón Needs to Listen, Not Just Lecture U.S.\" TIME May 19, 2010 [http://www.time.com/time/world/article/0,8599,1990176,00.html online]Burton Kirkwood, The History of Mexico (2010) pp 97–99, 138–52, 216\n\nAustralia\n\nThe United States' relationship with Australia is a very close one, with Secretary of State Hillary Clinton stating that \"America doesn't have a better friend in the world than Australia\". The relationship is formalized by the ANZUS treaty and the Australia–United States Free Trade Agreement.\nThe two countries have a shared history, both have previously been British Colonies and many Americans flocked to the Australian goldfields in the 19th century. At a strategic level, the relationship really came to prominence in World War II, when the two nations worked extremely closely in the Pacific War against Japan, with General Douglas MacArthur undertaking his role as Supreme Allied Commander based in Australia, effectively having Australian troops and resources under his command. During this period, the cultural interaction between Australia and the U.S. were elevated to a higher level as over 1 million U.S. military personnel moved through Australia during the course of the war. The relationship continued to evolve throughout the second half of the 20th Century, and today now involves strong relationships at the executive and mid levels of government and the military, leading Assistant Secretary of State for East Asian and Pacific Affairs, Kurt M. Campbell to declare that \"in the last ten years, [Australia] has ascended to one of the closest one or two allies [of the U.S.] on the planet\".\n\nMiddle East\n\nThe United States has many important allies in the Greater Middle East region. These allies are Turkey, Saudi Arabia, Morocco, Jordan, Afghanistan, Israel, Egypt, Kuwait, Bahrain and Qatar. Israel and Egypt are leading recipients of United States foreign aid, receiving $2.775 billion and 1.75 billion in 2010. Turkey is an ally of the United States through its membership in NATO, while all of the other countries except Saudi Arabia and Qatar are major non-NATO allies.\n\nThe United States toppled the government of Saddam Hussein during the 2003 invasion of Iraq. Turkey is host to approximately 90 B61 nuclear bombs at Incirlik Air Base. Other allies include Qatar, where 3,500 U.S. troops are based, and Bahrain, where the United States Navy maintains NSA Bahrain, home of NAVCENT and the Fifth Fleet.\n\nJapan\n\nThe relationship began in the 1850s as the U.S. was a major factor in forcing Japan to resume contacts with the outer world beyond a very restricted role. In the late 19th century the Japanese sent many delegations to Europe, and some to the U.S., to discover and copy the latest technology and thereby modernize Japan very rapidly and allow it to build its own empire. There was some friction over control of Hawaii and the Philippines, but Japan stood aside as the U.S. annexed those lands in 1898. Likewise the U.S. did not object when Japan took control of Korea. The two nations cooperated with the European powers in suppressing the Boxer Rebellion in China in 1900, but the U.S. was increasingly troubled about Japan's denial of the Open Door Policy that would ensure that all nations could do business with China on an equal basis.Foster Rhea Dulles, Yankees and Samurai: America's Role in the Emergence of Modern Japan, 1791–1900 (1965)\n\nPresident Theodore Roosevelt admired Japan's strength as it defeated a major European power, Russia. He brokered an end to the war between Russia and Japan in 1905–6. Anti-Japanese sentiment (especially on the West Coast) soured relations in the 1907–24 era. In the 1930s the U.S. protested vehemently against Japan's seizure of Manchuria (1931), its war against China (1937–45), and its seizure of Indochina (Vietnam) 1940–41. American sympathies were with China and Japan rejected increasingly angry American demands that Japan pull out of China. The two nations fought an all-out war 1941–45; the U.S. won a total victory, with heavy bombing (including two atomic bombs on Hiroshima and Nagasaki) that devastated Japan's 50 largest industrial cities. The American army under Douglas MacArthur occupied and ruled Japan, 1945–51, with the successful goal of sponsoring a peaceful, prosperous and democratic nation.Walter LaFeber, The Clash: A History of US–Japan Relations (W.W. Norton, 1997)\n\nIn 1951, the U.S. and Japan signed Treaty of San Francisco and Security Treaty Between the United States and Japan, subsequently revised as Treaty of Mutual Cooperation and Security between the United States and Japan in 1960, relations since then have been excellent. The United States considers Japan to be one of its closest allies, and it is both a Major Non-NATO ally and NATO contact country. The United States has several military bases in Japan including Yokosuka, which harbors the U.S. 7th Fleet. The JSDF, or Japanese Self Defense Force, cross train with the U.S. Military, often providing auxiliary security and conducting war games. When the U.S.President Barack Obama met with Japanese Prime Minister Taro Aso in 2009, he said the relationship with Japan as the \"cornerstone of security in East Asia\". After the several years of critical moment during Japan's Democratic Party administration, President Obama and Prime Minister Shinzō Abe reconfirmed the importance of its alliance and currently the U.S. and Japan negotiating to participate Trans-Pacific Strategic Economic Partnership.\n\nSouth Korea\n\nSouth Korea–United States relations have been most extensive since 1945, when the United States helped establish capitalism in South Korea and led the UN-sponsored Korean War against North Korea and China (1950–53).Jae Ho  Chung, Between Ally and Partner: Korea-China Relations and the United States (2008) [https://www.amazon.com/gp/reader/0231139071/ excerpt and text search] Stimulated by heavy American aid, South Korea's rapid economic growth, democratization and modernization greatly reduced its U.S. dependency. Large numbers of U.S. forces remain in Korea. At the 2009 G-20 London summit, U.S. President Barack Obama called South Korea \"one of America's closest allies and greatest friends.\" \n\nChina\n\nAmerican relations with the People's Republic of China are quite strong, yet complex. A great amount of trade between the two countries necessitates positive political relations, although occasional disagreements over tariffs, currency exchange rates and the Political status of Taiwan do occur. Nevertheless, the United States and China have an extremely extensive partnership. The U.S. criticizes China on human rights issues and in recent years, China has criticized the United States on human rights in return.\n\nTaiwan\n\nTaiwan (officially the Republic of China), does not have official diplomatic relations with America and no longer receives diplomatic recognition from the State Department of the United States, but it conducts unofficial diplomatic relations through its de facto embassy, commonly known as the \"American Institute in Taiwan (AIT)\", and is considered to be a strong Asian ally and supporter of the United States.Nancy Bernkopf Tucker, ed., Dangerous Strait: The U.S.-Taiwan-China Crisis (2005)\n\nASEAN\n\nAssociation of Southeast Asian Nations (ASEAN) is an important partner for United States in both economic and geostrategic aspects. ASEAN's geostrategic importance stems from many factors, including: the strategic location of member countries, the large shares of global trade that pass through regional waters, and the alliances and partnerships which the United States shares with ASEAN member states. In July 2009, the United States signed ASEAN's Treaty of Amity and Cooperation, which establishes guiding principles intended to build confidence among its signatories with the aim of maintaining regional peace and stability.Daniel Seah, \"The Treaty of Amity and Cooperation in Southeast Asia: The Issue of Non-Intervention and its Accession by Australia and the USA,\"  Chinese Journal of international Law and (2012) 11#4 pp. 785–822  [http://chinesejil.oxfordjournals.org/content/11/4/785.short online] Trade flows are robust and increasing between America and the ASEAN region.\n\nIndonesia\n\nAs the largest ASEAN member, Indonesia has played an active and prominent role in developing the organization.See  For United States, Indonesia is important for dealing with certain issues; such as terrorism,[http://www.cdi.org/terrorism/priority.cfm U.S.-Indonesia Military Relations in The Anti-Terror War]  democracy, and how United States project its relations with Islamic world, since Indonesia has the world's largest Islamic population, and one that honors and respects religious diversity. The U.S. eyes Indonesia as a potential strategic ally in Southeast Asia. During his stately visit to Indonesia, U.S. President Barack Obama has held up Indonesia as an example of how a developing nation can embrace democracy and diversity.[http://projects.washingtonpost.com/obama-speeches/speech/486/ Obama delivers a speech in the University of Indonesia] \n\nMalaysia\n\nDespite increasingly strained relations under the Mahathir Mohamad government, ties have been thawed under Najib Razak's administration. Economic ties are particularly robust, with the United States being Malaysia's largest trading partner and Malaysia is the tenth-largest trading partner of the U.S. Annual two-way trade amounts to $49 billion. The United States and Malaysia launched negotiations for a bilateral free trade agreement (FTA) in June 2006.\n\nThe United States and Malaysia enjoy strong security cooperation. Malaysia hosts the Southeast Asia Regional Center for Counterterrorism (SEARCCT), where over 2000 officials from various countries have received training. The United States is among the foreign countries that has collaborated with the center in conducting capacity building programmes. The U.S. and Malaysia share a strong military-to-military relationship with numerous exchanges, training, joint exercises, and visits.\n\nMyanmar\n\nBilateral ties have generally been strained but are slowly improving. The United States has placed broad sanctions on Burma because of the military crackdown in 1988 and the military regime's refusal to honour the election results of the 1990 People's Assembly election. Similarly, the European Union has placed embargoes on Burma, including an arms embargo, cessation of trade preferences, and suspension of all aid with the exception of humanitarian aid.\n\nUS and European government sanctions against the military government, alongside boycotts and other types direct pressure on corporations by western supporters of the Burmese democracy movement, have resulted in the withdrawal from Burma of most U.S. and many European companies. However, several Western companies remain due to loopholes in the sanctions.[https://foreignpolicy.com/story/cms.php?story_id=3986 The List: Burma's Economic Lifelines]. Foreign Policy. October 2007 Asian corporations have generally remained willing to continue investing in Myanmar and to initiate new investments, particularly in natural resource extraction.\n\nOngoing reforms have improved relations between Burma and the United States.\n\nPhilippines\n\nThe United States ruled the Philippines from 1898 to 1946. The Spanish government ceded the Philippines to the United States in the 1898 Treaty of Paris that ended the Spanish–American War. The United States finally recognized Philippine independence on July 4, 1946 in the Treaty of Manila. July 4 was observed in the Philippines as Independence Day until August 4, 1964 when, upon the advice of historians and the urging of nationalists, President Diosdado Macapagal signed into law Republic Act No. 4166 designating June 12 as the country's Independence Day. Since 2003 the U.S. has designated the Philippines as a Major Non-NATO Ally.\n\nThailand\n\nThailand and the U.S. are both former Southeast Asia Treaty Organization (SEATO) members, being close partners throughout the Cold War, and are still close allies. Since 2003, the U.S. has designated  Thailand as a Major Non-NATO Ally.\n\nVietnam\n\nUnited States involved in Vietnam War in 1955 to 1975. In 1995, President Bill Clinton announced the formal normalization of diplomatic relations with Vietnam. Today, the U.S. eyes Vietnam as a potential strategic ally in Southeast Asia.\n\nEastern Europe\n\nAmerican relations with Eastern Europe are influenced by the legacy of the Cold War. Since the collapse of the Soviet Union, former Communist-bloc states in Europe have gradually transitioned to democracy and capitalism. Many have also joined the European Union and NATO, strengthening economic ties with the broader Western world and gaining the military protection of the United States via the North Atlantic Treaty.\n\nKosovo\n\nThe UN Security Council divided on the question of Kosovo's declaration of independence. Kosovo declared its independence on February 17, 2008, whilst Serbia objected that Kosovo is part of its territory. Of the five members with veto power in the UN Security Council, the US, UK, and France recognized the declaration of independence, and China has expressed concern, while Russia considers it illegal. \"In its declaration of independence, Kosovo committed itself to the highest standards of democracy, including freedom and tolerance and justice for citizens of all ethnic backgrounds\", President George W. Bush said on February 19, 2008.[http://www.america.gov/st/peacesec-english/2008/February/20080219131902idybeekcm0.4052851.html Bush Hails Kosovo Independence] , U.S. Department of State's Bureau of International Information Programs[https://www.theguardian.com/world/2007/jun/11/balkans.usa Bush insists Kosovo must be independent and receives hero's welcome in Albania], The Guardian",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign policy of the United States" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7564" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The foreign policy of the United States is the way in which it interacts with foreign nations and sets standards of interaction for its organizations, corporations and system citizens of the United States.\n\nThe officially stated goals of the foreign policy of the United States, including all the Bureaus and Offices in the United States Department of State, as mentioned in the Foreign Policy Agenda of the Department of State, are \"to build and sustain a more democratic, secure, and prosperous world for the benefit of the American people and the international community.\" In addition, the United States House Committee on Foreign Affairs states as some of its jurisdictional goals: \"export controls, including nonproliferation of nuclear technology and nuclear hardware; measures to foster commercial interaction with foreign nations and to safeguard American business abroad; international commodity agreements; international education; and protection of American citizens abroad and expatriation.\" U.S. foreign policy and foreign aid have been the subject of much debate, praise and criticism, both domestically and abroad.\n\nPowers of the President \n\nSubject to the advice and consent role of the U.S. Senate, the President of the United States negotiates treaties with foreign nations, but treaties enter into force if ratified by two-thirds of the Senate. The President is also Commander in Chief of the United States Armed Forces, and as such has broad authority over the armed forces. Both the Secretary of State and ambassadors are appointed by the President, with the advice and consent of the Senate. The United States Secretary of State acts similarly to a foreign minister and under Executive leadership is the primary conductor of state-to-state diplomacy.\n\nPowers of the Congress\n\nCongress is the only branch of government that has the authority to declare war. Furthermore, Congress writes the civilian and military budget, thus has vast power in military action and foreign aid. Congress also has power to regulate commerce with foreign nations.James M. McCormick, American Foreign Policy and  Process (2009)  ch. 7–8\n\nHistorical overview\n\nThe main trend regarding the history of U.S. foreign policy since the American Revolution is the shift from non-interventionism before and after World War I, to its growth as a world power and global hegemony during and since World War II and the end of the Cold War in the 20th century.George C. Herring, From Colony to Superpower: U.S. Foreign Relations Since 1776 (2008) Since the 19th century, U.S. foreign policy also has been characterized by a shift from the realist school to the idealistic or Wilsonian school of international relations.Richard Russell, \"American Diplomatic Realism: A Tradition Practised and Preached by George F. Kennan,\" Diplomacy and Statecraft, Nov 2000, Vol. 11 Issue 3, pp. 159–83\n\nForeign policy themes were expressed considerably in George Washington's farewell address; these included among other things, observing good faith and justice towards all nations and cultivating peace and harmony with all, excluding both \"inveterate antipathies against particular nations, and passionate attachments for others\", \"steer[ing] clear of permanent alliances with any portion of the foreign world\", and advocating trade with all nations. These policies became the basis of the Federalist Party in the 1790s. But the rival Jeffersonians feared Britain and favored France in the 1790s, declaring the War of 1812 on Britain. After the 1778 alliance with France, the U.S. did not sign another permanent treaty until the North Atlantic Treaty in 1949. Over time, other themes, key goals, attitudes, or stances have been variously expressed by Presidential 'doctrines', named for them. Initially these were uncommon events, but since WWII, these have been made by most presidents.\n\nJeffersonians vigorously opposed a large standing army and any navy until attacks against American shipping by Barbary corsairs spurred the country into developing a naval force projection capability, resulting in the First Barbary War in 1801.\n\nDespite two wars with European Powers—the War of 1812 and the 1898 Spanish–American War—American foreign policy was peaceful and marked by steady expansion of its foreign trade during the 19th century.  The 1803 Louisiana Purchase doubled the nation's geographical area; Spain ceded the territory of Florida in 1819; annexation brought in the independent Texas Republic in 1845; a war with Mexico in 1848 added California, Arizona, Utah, Nevada, and New Mexico. The U.S. bought Alaska from the Russian Empire in 1867, and it annexed the independent Republic of Hawaii in 1898. Victory over Spain in 1898 brought the Philippines, and Puerto Rico, as well as oversight of Cuba. The short experiment in imperialism ended by 1908, as the U.S. turned its attention to the Panama Canal and the stabilization of regions to its south, including Mexico.\n\n20th century\n\nWorld War I\n\nThe 20th century was marked by two world wars in which the United States, along with allied powers, defeated its enemies and increased its international reputation. President Wilson's Fourteen Points was developed from his idealistic Wilsonianism program of spreading democracy and fighting militarism so as to end any wars. It became the basis of the German Armistice (really a surrender) and the 1919 Paris Peace Conference. The resulting Treaty of Versailles, due to European allies' punitive and territorial designs, showed insufficient conformity with these points and the U.S. signed separate treaties with each of its adversaries; due to Senate objections also, the U.S. never joined the League of Nations, which was established as a result of Wilson's initiative. In the 1920s, the United States followed an independent course, and succeeded in a program of naval disarmament, and refunding the German economy. Operating outside the League it became a dominant player in diplomatic affairs. New York became the financial capital of the world, but the Wall Street Crash of 1929 hurled the Western industrialized world into the Great Depression. American trade policy relied on high tariffs under the Republicans, and reciprocal trade agreements under the Democrats, but in any case exports were at very low levels in the 1930s.\n\nWorld War II\n\nThe United States adopted a non-interventionist foreign policy from 1932 to 1938, but then President Franklin D. Roosevelt moved toward strong support of the Allies in their wars against Germany and Japan. As a result of intense internal debate, the national policy was one of becoming the Arsenal of Democracy, that is financing and equipping the Allied armies without sending American combat soldiers. Roosevelt mentioned four fundamental freedoms, which ought to be enjoyed by people \"everywhere in the world\"; these included the freedom of speech and religion, as well as freedom from want and fear. Roosevelt helped establish terms for a post-war world among potential allies at the Atlantic Conference; specific points were included to correct earlier failures, which became a step toward the United Nations. American policy was to threaten Japan, to force it out of China, and to prevent its attacking the Soviet Union. However, Japan reacted by an attack on Pearl Harbor in December 1941, and the United States was at war with Japan, Germany, and Italy. Instead of the loans given to allies in World War I, the United States provided Lend-Lease grants of $50,000,000,000. Working closely with Winston Churchill of Britain, and Joseph Stalin of the Soviet Union, Roosevelt sent his forces into the Pacific against Japan, then into North Africa against Italy and Germany, and finally into Europe starting with France and Italy in 1944 against the Germans. The American economy roared forward, doubling industrial production, and building vast quantities of airplanes, ships, tanks, munitions, and, finally, the atomic bomb. Much of the American war effort went to strategic bombers, which flattened the cities of Japan and Germany.\n\nCold War\n\nAfter the war, the U.S. rose to become the dominant non-colonial economic power with broad influence in much of the world, with the key policies of the Marshall Plan and the Truman Doctrine. Almost immediately, however, the world witnessed division into broad two camps during the Cold War; one side was led by the U.S. and the other by the Soviet Union, but this situation also led to the establishment of the Non-Aligned Movement. This period lasted until almost the end of the 20th century and is thought to be both an ideological and power struggle between the two superpowers. A policy of containment was adopted to limit Soviet expansion, and a series of proxy wars were fought with mixed results. In 1991, the Soviet Union dissolved into separate nations, and the Cold War formally ended as the United States gave separate diplomatic recognition to the Russian Federation and other former Soviet states.\n\nIn domestic politics, foreign policy is not usually a central issue. In 1945–1970 the Democratic Party took a strong anti-Communist line and supported wars in Korea and Vietnam. Then the party split with a strong, \"dovish\", pacifist element (typified by 1972 presidential candidate George McGovern).  Many \"hawks\", advocates for war, joined the Neoconservative movement and started supporting the Republicans—especially Reagan—based on foreign policy.Seymour Martin Lipset, \"Neoconservatism: Myth and reality.\" Society 25.5 (1988): pp. 9-13 [http://www.diss.fu-berlin.de/docs/servlets/MCRFileNodeServlet/FUDOCS_derivate_000000001215/fraenkelvortraege01.pdf online]. Meanwhile, down to 1952 the Republican Party was split between an isolationist wing, based in the Midwest and led by Senator Robert A. Taft, and an internationalist wing based in the East and led by Dwight D. Eisenhower. Eisenhower defeated Taft for the 1952 nomination largely on foreign policy grounds. Since then the Republicans have been characterized by a hawkish and intense American nationalism, and strong opposition to Communism, and strong support for Israel.Colin  Dueck, Hard Line: The Republican Party and U.S. Foreign Policy since World War II (2010).\n\n21st century\n\nIn the 21st century, U.S. influence remains strong but, in relative terms, is declining in terms of economic output compared to rising nations such as China, India, Russia, and the newly consolidated European Union. Substantial problems remain, such as climate change, nuclear proliferation, and the specter of nuclear terrorism. Foreign policy analysts Hachigian and Sutphen in their book The Next American Century suggest all five powers have similar vested interests in stability and terrorism prevention and trade; if they can find common ground, then the next decades may be marked by peaceful growth and prosperity.\n\nIn 2017 diplomats from other countries developed new tactics to deal with President Donald Trump.  The New York Times reported on the eve of his first foreign trip as president:\n\nFor foreign leaders trying to figure out the best way to approach an American president unlike any they have known, it is a time of experimentation. Embassies in Washington trade tips and ambassadors send cables to presidents and ministers back home suggesting how to handle a mercurial, strong-willed leader with no real experience on the world stage, a preference for personal diplomacy and a taste for glitz....certain rules have emerged: Keep it short — no 30-minute monologue for a 30-second attention span. Do not assume he knows the history of the country or its major points of contention. Compliment him on his Electoral College victory. Contrast him favorably with President Barack Obama. Do not get hung up on whatever was said during the campaign. Stay in regular touch. Do not go in with a shopping list but bring some sort of deal he can call a victory.See Peter Baker,\n \"Tips for Leaders Meeting Trump: Keep It Short and Give Him a Win,\"\n [https://www.nytimes.com/2017/05/18/world/middleeast/trump-saudi-arabia-foreign-trip.html?hp&actionclick&pgtype\nHomepage&clickSourcestory-heading&module\nb-lede-package-region&regiontop-news&WT.nav\ntop-news&_r=0 New York Times May 18, 2017]\n\nTrump has numerous aides giving advice on foreign policy. The chief diplomat is Secretary of State Rex Tillerson.  His major foreign policy positions, which sometimes are at odds with Trump, include:\nurging the United States to stay in the Trans-Pacific Partnership and the Paris climate accord, taking a hard line on Russia, advocating negotiations and dialogue to defuse the mounting crisis with North Korea, advocating for continued U.S. adherence to the Iran nuclear deal, taking a neutral position in the dispute between Qatar and Saudi Arabia, and reassuring jittery allies, from South Korea and Japan to our NATO partners, that America still has their back.Aaron David Miller and Richard Sokolsky, \"Should Rex Tillerson Resign?,\" [http://www.politico.com/magazine/story/2017/10/01/should-rex-tillerson-resign-215664 Politico  October 1, 2017] \n\nLaw\n\nIn the United States, there are three types of treaty-related law:\n* Treaties are formal written agreements specified by the Treaty Clause of the Constitution. The President makes a treaty with foreign powers, but then the proposed treaty must be ratified by a two-thirds vote in the Senate. For example, President Wilson proposed the Treaty of Versailles after World War I after consulting with allied powers, but this treaty was rejected by the Senate; as a result, the U.S. subsequently made separate agreements with different nations. While most international law has a broader interpretation of the term treaty, the U.S. sense of the term is more restricted. In Missouri v. Holland, the Supreme Court ruled that the power to make treaties under the U.S. Constitution is a power separate from the other enumerated powers of the federal government, and hence the federal government can use treaties to legislate in areas which would otherwise fall within the exclusive authority of the states.\n* Executive agreements are made by the President—in the exercise of his Constitutional executive powers—alone.\n* Congressional-executive agreements are made by the President and Congress. A majority of both houses makes it binding much like regular legislation after it is signed by the president. The Constitution does not expressly state that these agreements are allowed, and constitutional scholars such as Laurence Tribe think they are unconstitutional.Laurence H. Tribe, \"Taking Text and Structure Seriously: Reflections on Free-Form Method in Constitutional Interpretation,\" 108 Harv. L. Rev. 1221, 1227 (1995).\n\nIn contrast to most other nations, the United States considers the three types of agreements as distinct. Further, the United States incorporates treaty law into the body of U.S. federal law. As a result, Congress can modify or repeal treaties afterward. It can overrule an agreed-upon treaty obligation even if this is seen as a violation of the treaty under international law. Several U.S. court rulings confirmed this understanding, including Supreme Court decisions in Paquete Habana v. United States (1900), and Reid v. Covert (1957), as well as a lower court ruling n Garcia-Mir v. Meese (1986). Further, the Supreme Court has declared itself as having the power to rule a treaty as void by declaring it \"unconstitutional\", although as of 2011, it has never exercised this power.\n\nThe State Department has taken the position that the Vienna Convention on the Law of Treaties represents established law. Generally, when the U.S. signs a treaty, it is binding. However, as a result of the Reid v. Covert decision, the U.S. adds a reservation to the text of every treaty that says, in effect, that the U.S. intends to abide by the treaty, but if the treaty is found to be in violation of the Constitution, then the U.S. legally can't abide by the treaty since the U.S. signature would be ultra vires.\n\nInternational agreements\n\nThe United States has ratified and participates in many other multilateral treaties, including arms control treaties (especially with the Soviet Union), human rights treaties, environmental protocols, and free trade agreements.\n\nEconomic and general government\n\nThe United States is a founding member of the United Nations and most of its specialized agencies, notably including the World Bank Group and International Monetary Fund.  The U.S. has at times has withheld payment of dues due to disagreements with the UN.\n\nThe United States is also member of:\n* Organization of American States\n* Organization for Security and Co-operation in Europe (OECD)\n* NAFTA, the regional trade bloc with Canada and Mexico\n* World Trade Organization\n* Asia-Pacific Economic Cooperation (APEC)\n* Group of Seven (G7)\n* World Customs Organization\n\nFreely Associated States\n\nAfter it captured the islands from Japan during World War II, the United States administered the Trust Territory of the Pacific Islands from 1947 to 1986 (1994 for Palau).  The Northern Mariana Islands became a U.S. territory (part of the United States), while Federated States of Micronesia, the Marshall Islands, and Palau became independent countries.  Each has signed a Compact of Free Association that gives the United States exclusive military access in return for U.S. defense protection and conduct of military foreign affairs (except the declaration of war) and a few billion dollars of aid.  These agreements also generally allow citizens of these countries to live and work in the United States with their spouses (and vice versa), and provide for largely free trade.  The federal government also grants access to services from domestic agencies, including the Federal Emergency Management Agency, National Weather Service, the United States Postal Service, the Federal Aviation Administration, the Federal Communications Commission, and U.S. representation to the International Frequency Registration Board of the International Telecommunication Union.\n\nNon-participation in multi-lateral agreements\n\nThe United States notably does not participate in various international agreements adhered to by almost all other industrialized countries, by almost all the countries of the Americas, or by almost all other countries in the world.  With a large population and economy, on a practical level this can undermine the effect of certain agreements,The power of the League was limited by the United States' refusal to join.The United States was responsible for 36% of greenhouse gas emissions at the time of the Kyoto Protocol or give other countries a precedent to cite for non-participation in various agreements.[http://www.huffingtonpost.com/entry/the-united-states-should_b_10930236 The United States Should Ratify The Law Of The Sea Convention] (due to China citing U.S. citing non-ratification as a reason it doesn't need to follow the agreement)\n\nIn some cases the arguments against participation include that the United States should maximize its sovereignty and freedom of action, or that ratification would create a basis for lawsuits that would treat American citizens unfairly.  In other cases, the debate became involved in domestic political issues, such as gun control, climate change, and the death penalty.\n\nExamples include:\n* Versailles Treaty and the League of Nations covenant (in force 1920–45, signed but not ratified)\n* International Covenant on Civil and Political Rights (took effect in 1976, ratified with substantial reservations)\n* International Covenant on Economic, Social and Cultural Rights (took effect in 1976, signed but not ratified)\n* American Convention on Human Rights (took effect in 1978)\n* Convention on the Elimination of All Forms of Discrimination against Women (took effect in 1981, signed but not ratified)\n* Convention on the Rights of the Child (took effect in 1990, signed but not ratified)\n* United Nations Convention on the Law of the Sea (took effect in 1994)\n* Comprehensive Nuclear-Test-Ban Treaty (signed in 1996 but never ratified and never took effect)\n* Mine Ban Treaty (took effect in 1999)\n* International Criminal Court (took effect in 2002)\n* Kyoto Protocol (in force 2005–12, signed but not ratified)\n* Optional Protocol to the Convention against Torture (took effect in 2006)\n* Convention on the Rights of Persons with Disabilities (took effect in 2008, signed but not ratified)\n* Convention on Cluster Munitions (took effect in 2010)\n* International Convention for the Protection of All Persons from Enforced Disappearance (took effect in 2010)\n* Arms Trade Treaty (took effect in 2014)\n* Other human rights treaties\n\nHub and spoke vs multilateral\n\nWhile America's relationships with Europe have tended to be in terms of multilateral frameworks, such as NATO, America's relations with Asia have tended to be based on a \"hub and spoke\" model using a series of bilateral relationships where states coordinate with the United States and do not collaborate with each other.  On May 30, 2009, at the Shangri-La Dialogue Defense Secretary Robert M. Gates urged the nations of Asia to build on this hub and spoke model as they established and grew multilateral institutions such as ASEAN, APEC and the ad hoc arrangements in the area. However, in 2011 Gates said that the United States must serve as the \"indispensable nation,\" for building multilateral cooperation.Shanker, Tom. [https://www.nytimes.com/2011/06/03/world/asia/03Gates.html \"Gates Talks of Boosting Asian Security Despite Budget Cuts.\"] New York Times, 1 June 2011.\n\nOil\n\nPersian Gulf\n\nAs of 2014, the U.S. currently produces about 66% of the oil that it consumes. While its imports have exceeded domestic production since the early 1990s, new hydraulic fracturing techniques and discovery of shale oil deposits in Canada and the American Dakotas offer the potential for increased energy independence from oil exporting countries such as OPEC. Former U.S. President George W. Bush identified dependence on imported oil as an urgent \"national security concern\".[https://www.bloomberg.com/apps/news?pid10000087&sid\nar4D7HVGikXo&refer=top_world_news Bush Leverage With Russia, Iran, China Falls as Oil Prices Rise], Bloomberg.com\n\nTwo-thirds of the world's proven oil reserves are estimated to be found in the\nPersian Gulf.[https://query.nytimes.com/gst/fullpage.html?res=9E02E4D6123AF93AA15752C0A9649C8B63 Shrinking Our Presence in Saudi Arabia], New York Times[http://science.nationalgeographic.com/science/environment/alternative-energy/end-cheap-oil.html The End of Cheap Oil], National Geographic Despite its distance, the Persian Gulf region was first proclaimed to be of national interest to the United States during World War II. Petroleum is of central importance to modern armies, and the United States—as the world's leading oil producer at that time—supplied most of the oil for the Allied armies. Many U.S. strategists were concerned that the war would dangerously reduce the U.S. oil supply, and so they sought to establish good relations with Saudi Arabia, a kingdom with large oil reserves.\n\nThe Persian Gulf region continued to be regarded as an area of vital importance to the United States during the Cold War. Three Cold War United States Presidential doctrines—the Truman Doctrine, the Eisenhower Doctrine, and the Nixon Doctrine—played roles in the formulation of the Carter Doctrine, which stated that the United States would use military force if necessary to defend its \"national interests\" in the Persian Gulf region.[http://www.msnbc.msn.com/id/20874331/ The war is about oil but it's not that simple], msnbc.com Carter's successor, President Ronald Reagan, extended the policy in October 1981 with what is sometimes called the \"Reagan Corollary to the Carter Doctrine\", which proclaimed that the United States would intervene to protect Saudi Arabia, whose security was threatened after the outbreak of the Iran–Iraq War.[http://www.history.navy.mil/wars/dstorm/sword-shield.htm The United States Navy and the Persian Gulf]  Some analysts have argued that the implementation of the Carter Doctrine and the Reagan Corollary also played a role in the outbreak of the 2003 Iraq War.[http://www.haaretz.com/hasen/spages/996605.html What if the Chinese were to apply the Carter Doctrine?], Haaretz - Israel News[http://www.time.com/time/magazine/article/0,9171,921819,00.html Selling the Carter Doctrine], TIME[http://www.timesonline.co.uk/tol/news/world/article2461214.ece Alan Greenspan claims Iraq war was really for oil], Times Online[https://www.theguardian.com/world/2008/jun/20/iraq.oil Oil giants to sign contracts with Iraq], The Guardian\n\nCanada\n\nAlmost all of Canada's energy exports go to the United States, making it the largest foreign source of U.S. energy imports: Canada is consistently among the top sources for U.S. oil imports, and it is the largest source of U.S. natural gas and electricity imports.See Energy Information Administration, [http://www.eia.doe.gov/emeu/cabs/Canada/Background.html \"Canada\" (2009 report)] \n\nAfrica\n\nIn 2007 the U.S. was Sub-Saharan Africa's largest single export market accounting for 28% of exports (second in total to the EU at 31%). 81% of U.S. imports from this region were petroleum products.\n\nForeign aid\n\nForeign assistance is a core component of the State Department's international affairs budget, which is $49 billion in all for 2014.See [http://appropriations.house.gov/uploadedfiles/01.13.14_fy_2014_omnibus_-_state_foreign_operations_-_summary.pdf \"FY 2014 Omnibus – State and Foreign Operations Appropriations\" (Jan 2014)]  Aid is considered an essential instrument of U.S. foreign policy. There are four major categories of non-military foreign assistance: bilateral development aid, economic assistance supporting U.S. political and security goals, humanitarian aid, and multilateral economic contributions (for example, contributions to the World Bank and International Monetary Fund).\n\nIn absolute dollar terms, the United States government is the largest international aid donor ($23 billion in 2014).  The U.S. Agency for International Development (USAID) manages the bulk of bilateral economic assistance; the Treasury Department handles most multilateral aid. In addition many private agencies, churches and philanthropies provide aid.\n\nAlthough the United States is the largest donor in absolute dollar terms, it is actually ranked 19 out of 27 countries on the Commitment to Development Index. The CDI ranks the 27 richest donor countries on their policies that affect the developing world. In the aid component the United States is penalized for low net aid volume as a share of the economy, a large share of tied or partially tied aid, and a large share of aid given to less poor and relatively undemocratic governments.\n\nForeign aid is a highly partisan issue in the United States, with liberals, on average, supporting foreign aid much more than conservatives do.\n\nMilitary\n\nAs of 2016, the United States is actively conducting military operations against the Islamic State of Iraq and the Levant and Al-Qaeda under the Authorization for Use of Military Force Against Terrorists, including in areas of fighting in the Syrian Civil War and Yemeni Civil War.  The Guantanamo Bay Naval Base holds what the federal government considers unlawful combatants from these ongoing activities, and has been a controversial issue in foreign relations, domestic politics, and Cuba–United States relations.  Other major U.S. military concerns include stability in Afghanistan and Iraq after the recent invasions of those countries, and Russian military activity in Ukraine.\n\nMutual defense agreements\n\nThe United States is a founding member of NATO, an alliance of 28 North American and European nations formed to defend Western Europe against the Soviet Union during the Cold War.  Under the NATO charter, the United States is compelled to defend any NATO state that is attacked by a foreign power.  The United States itself was the first country to invoke the mutual defense provisions of the alliance, in response to the September 11 attacks.\n\nThe United States also has mutual military defense treaties with:\n* Australia and New Zealand\n* Japan\n* South Korea\n* Philippines\n* Thailand, with other states formerly in the Southeast Asia Treaty Organization\n* Most countries in South America, Central America, and the Caribbean, through the Inter-American Treaty of Reciprocal Assistance\n\nThe United States has responsibility for the defense of the three Compact of Free Association states: Federated States of Micronesia, the Marshall Islands, and Palau.\n\nOther allies and multilateral organizations\n\nIn 1989, the United States also granted five nations the major non-NATO ally status (MNNA), and additions by later presidents have brought the list to 28 nations. Each such state has a unique relationship with the United States, involving various military and economic partnerships and alliances.\n\nand lesser agreements with:\n* Taiwan\n* Israel\n* Saudi Arabia\n\nThe U.S. participates in various military-related multi-lateral organizations, including:\n* Organisation for the Prohibition of Chemical Weapons\n* International Atomic Energy Agency\n\nThe U.S. also operates hundreds of military bases around the world.\n\nUnilateral vs. multilateral military actions\n\nThe United States has undertaken unilateral and multilateral military operations throughout its history (see Timeline of United States military operations).  In the post-World War II era, the country has had permanent membership and veto power in the United Nations Security Council, allowing it to undertake any military action without formal Security Council opposition.  With vast military expenditures, the United States is known as the sole remaining superpower after the collapse of the Soviet Union.  The U.S. contributes a relatively small number of personnel for United Nations peacekeeping operations.  It sometimes acts though NATO, as with the NATO intervention in Bosnia and Herzegovina, NATO bombing of Yugoslavia, and ISAF in Afghanistan, but often acts unilaterally or in ad-hoc coalitions as with the 2003 invasion of Iraq.\n\nThe United Nations Charter requires that military operations be either for self-defense or affirmatively approved by the Security Council.  Though many of their operations have followed these rules, the United States and NATO have been accused of committing crimes against peace in international law, for example in the 1999 Yugoslavia and 2003 Iraq operations.\n\nAid\n\nThe U.S. provides military aid through many different channels. Counting the items that appear in the budget as 'Foreign Military Financing' and 'Plan Colombia', the U.S. spent approximately $4.5 billion in military aid in 2001, of which $2 billion went to Israel, $1.3 billion went to Egypt, and $1 billion went to Colombia. Since 9/11, Pakistan has received approximately $11.5 billion in direct military aid.\n\nAs of 2004, according to Fox News, the U.S. had more than 700 military bases in 130 different countries.Fox News, 1 November 2004 [http://www.globalsecurity.org/org/news/2004/041101-iraq-basing.htm Analysts Ponder U.S. Basing in Iraq]\n\nEstimated U.S. foreign military financing and aid by recipient for 2010:\n\nAccording to a 2016 report by the Congressional Research Service, the U.S. topped the market in global weapon sales for 2015, with $40 billion sold. The largest buyers were Qatar, Egypt, Saudi Arabia, South Korea, Pakistan, Israel, the United Arab Emirates and Iraq.\n\nMissile defense\n\nThe Strategic Defense Initiative (SDI) was a proposal by U.S. President Ronald Reagan on March 23, 1983Federation of American Scientists. [https://fas.org/spp/starwars/program/milestone.htm Missile Defense Milestones] . Accessed March 10, 2006. to use ground and space-based systems to protect the United States from attack by strategic nuclear ballistic missiles,[https://www.independent.co.uk/opinion/commentators/johann-hari/johann-hari-obamas-chance-to-end-the--fantasy-that-is-star-wars-1015509.html Johann Hari: Obama's chance to end the fantasy that is Star Wars], The Independent, November 13, 2008 later dubbed \"Star Wars\".[http://www.cnn.com/SPECIALS/cold.war/episodes/22/documents/starwars.speech/ Historical Documents: Reagan's 'Star Wars' speech] , CNN Cold War The initiative focused on strategic defense rather than the prior strategic offense doctrine of mutual assured destruction (MAD). Though it was never fully developed or deployed, the research and technologies of SDI paved the way for some anti-ballistic missile systems of today.\n\nIn February 2007, the U.S. started formal negotiations with Poland and Czech Republic concerning construction of missile shield installations in those countries for a Ground-Based Midcourse Defense system (in April 2007, 57% of Poles opposed the plan).[https://www.washingtonpost.com/wp-dyn/content/article/2007/04/24/AR2007042400871.html U.S. Might Negotiate on Missile Defense], washingtonpost.com According to press reports the government of the Czech Republic agreed (while 67% Czechs disagree)[http://www.cvvm.cas.cz/upl/zpravy/100761s_pm80306.pdf Citizens on U.S. Anti-Missile Radar Base in Czech Republic]  to host a missile defense radar on its territory while a base of missile interceptors is supposed to be built in Poland.[http://news.bbc.co.uk/2/hi/europe/6704669.stm Europe diary: Missile defence], BBC News\n\nRussia threatened to place short-range nuclear missiles on the Russia's border with NATO if the United States refuses to abandon plans to deploy 10 interceptor missiles and a radar in Poland and the Czech Republic.[http://www.telegraph.co.uk/news/worldnews/1569495/Russia-piles-pressure-on-EU-over-missile-shield.html Russia piles pressure on EU over missile shield], Telegraph[http://www.iht.com/articles/ap/2008/05/23/asia/AS-GEN-China-Russia.php China, Russia sign nuclear deal, condemn U.S. missile defense plans], International Herald Tribune In April 2007, Putin warned of a new Cold War if the Americans deployed the shield in Central Europe.[https://www.theguardian.com/world/2007/apr/11/usa.topstories3 Russia threatening new cold war over missile defence], The Guardian Putin also said that Russia is prepared to abandon its obligations under an Intermediate-Range Nuclear Forces Treaty of 1987 with the United States.[https://www.usatoday.com/news/world/2007-10-12-us-russia_N.htm U.S., Russia no closer on missile defense], USATODAY.com\n\nOn August 14, 2008, the United States and Poland announced a deal to implement the missile defense system in Polish territory, with a tracking system placed in the Czech Republic.[https://www.nytimes.com/2008/08/15/world/europe/16poland.html?hp Russia Lashes Out on Missile Deal], The New York Times, August 15, 2008 \"The fact that this was signed in a period of very difficult crisis in the relations between Russia and the United States over the situation in Georgia shows that, of course, the missile defense system will be deployed not against Iran but against the strategic potential of Russia\", Dmitry Rogozin, Russia's NATO envoy, said.[http://english.aljazeera.net/news/europe/2008/08/200881514010734640.html Russia angry over U.S. missile shield], Al Jazeera English, August 15, 2008\n\nKeir A. Lieber and Daryl G. Press, argue in Foreign Affairs that U.S. missile defenses are designed to secure Washington's nuclear primacy and are chiefly directed at potential rivals, such as Russia and China. The authors note that Washington continues to eschew nuclear first strike and contend that deploying missile defenses \"would be valuable primarily in an offensive context, not a defensive one; as an adjunct to a US First Strike capability, not as a stand-alone shield\":\n\nIf the United States launched a nuclear attack against Russia (or China), the targeted country would be left with only a tiny surviving arsenal, if any at all. At that point, even a relatively modest or inefficient missile defense system might well be enough to protect against any retaliatory strikes.[https://www.foreignaffairs.com/articles/united-states/2006-03-01/rise-us-nuclear-primacy \"The Rise of U.S. Nuclear Primacy\"] Keir A. Lieber and Daryl G. Press, Foreign Affairs, March/April 2006\n\nThis analysis is corroborated by the Pentagon's 1992 Defense Planning Guidance (DPG), prepared by then Secretary of Defense Richard Cheney and his deputies. The DPG declares that the United States should use its power to \"prevent the reemergence of a new rival\" either on former Soviet territory or elsewhere. The authors of the Guidance determined that the United States had to \"Field a missile defense system as a shield against accidental missile launches or limited missile strikes by 'international outlaws'\" and also must \"Find ways to integrate the 'new democracies' of the former Soviet bloc into the U.S.-led system\". The National Archive notes that Document 10 of the DPG includes wording about \"disarming capabilities to destroy\" which is followed by several blacked out words. \"This suggests that some of the heavily excised pages in the still-classified DPG drafts may include some discussion of preventive action against threatening nuclear and other WMD programs.\"[http://nsarchive.gwu.edu/nukevault/ebb245/ \"Prevent the Reemergence of a New Rival\"] The National Security Archive\n\nFinally, Robert David English, writing in Foreign Affairs, observes that in addition to the deployment U.S. missile defenses, the DPG's second recommendation has also been proceeding on course. \"Washington has pursued policies that have ignored Russian interests (and sometimes international law as well) in order to encircle Moscow with military alliances and trade blocs conducive to U.S. interests.\"[https://www.foreignaffairs.com/articles/russian-federation/2017-03-10/russia-trump-and-new-d-tente \"Russia, Trump, and a New Détente\"] Foreign Affairs, March 10, 2017\n\nExporting democracy\n\n  \n\nIn United States history, critics have charged that presidents have used democracy to justify military intervention abroad. Also see [https://www.webcitation.org/query?url\nhttp://www.geocities.com/travbailey/why.html&date2009-10-25+23:16:02 this page]. Critics have also charged that the U.S. helped local militaries overthrow democratically elected governments in Iran, Guatemala, and in other instances. Studies have been devoted to the historical success rate of the U.S. in exporting democracy abroad. Some studies of American intervention have been pessimistic about the overall effectiveness of U.S. efforts to encourage democracy in foreign nations.PDF file. Until recently, scholars have generally agreed with international relations professor Abraham Lowenthal that U.S. attempts to export democracy have been \"negligible, often counterproductive, and only occasionally positive.\" Other studies find U.S. intervention has had mixed results, and another by Hermann and Kegley has found that military interventions have improved democracy in other countries.\n\nOpinion that U.S. intervention does not export democracy\n\nProfessor Paul W. Drake argued that the U.S. first attempted to export democracy in Latin America through intervention from 1912 to 1932. Drake argued that this was contradictory because international law defines intervention as \"dictatorial interference in the affairs of another state for the purpose of altering the condition of things.\" The study suggested that efforts to promote democracy failed because democracy needs to develop out of internal conditions, and can not be forcibly imposed. There was disagreement about what constituted democracy; Drake suggested American leaders sometimes defined democracy in a narrow sense of a nation having elections; Drake suggested a broader understanding was needed. Further, there was disagreement about what constituted a \"rebellion\"; Drake saw a pattern in which the U.S. State Department disapproved of any type of rebellion, even so-called \"revolutions\", and in some instances rebellions against dictatorships. Historian Walter LaFeber stated, \"The world's leading revolutionary nation (the U.S.) in the eighteenth century became the leading protector of the status quo in the twentieth century.\"\n\nMesquita and Downs evaluated 35 U.S. interventions from 1945 to 2004 and concluded that in only one case, Colombia, did a \"full fledged, stable democracy\" develop within ten years following the intervention.Factors included limits on executive power, clear rules for the transition of power, universal adult suffrage, and\ncompetitive elections. Samia Amin Pei argued that nation building in developed countries usually unravelled four to six years after American intervention ended. Pei, based on study of a database on worldwide democracies called Polity, agreed with Mesquita and Downs that U.S. intervention efforts usually don't produce real democracies, and that most cases result in greater authoritarianism after ten years.\n\nProfessor Joshua Muravchik argued U.S. occupation was critical for Axis power democratization after World War II, but America's failure to encourage democracy in the third world \"prove ... that U.S. military occupation is not a sufficient condition to make a country democratic.\"Peceny, p. 186. The success of democracy in former Axis countries such as Italy were seen as a result of high national per-capita income, although U.S. protection was seen as a key to stabilization and important for encouraging the transition to democracy. Steven Krasner agreed that there was a link between wealth and democracy; when per-capita incomes of $6,000 were achieved in a democracy, there was little chance of that country ever reverting to an autocracy, according to an analysis of his research in the Los Angeles Times.\n\nOpinion that U.S. intervention has mixed results\n\nTures examined 228 cases of American intervention from 1973 to 2005, using Freedom House data. A plurality of interventions, 96, caused no change in the country's democracy. In 69 instances, the country became less democratic after the intervention. In the remaining 63 cases, a country became more democratic. However this does not take into account the direction the country would have gone with no U.S. intervention.\n\nOpinion that U.S. intervention effectively exports democracy\n\nHermann and Kegley found that American military interventions designed to protect or promote democracy increased freedom in those countries. Peceny argued that the democracies created after military intervention are still closer to an autocracy than a democracy, quoting Przeworski \"while some democracies are more democratic than others, unless offices are contested, no regime should be considered democratic.\" Therefore, Peceny concludes, it is difficult to know from the Hermann and Kegley study whether U.S. intervention has only produced less repressive autocratic governments or genuine democracies.Peceny, p. 193\n\nPeceny stated that the United States attempted to export democracy in 33 of its 93 20th-century military interventions.Peceny, p. 2 Peceny argued that proliberal policies after military intervention had a positive impact on democracy.Review: \n\nGlobal opinion\n\nA global survey done by Pewglobal indicated that at (as of 2014) least 33 surveyed countries have a positive view (50% or above) of the United States. With the top ten most positive countries being Philippines (92%), Israel (84%), South Korea (82%), Kenya (80%), El Salvador (80%), Italy (78%), Ghana (77%), Vietnam (76%), Bangladesh (76%), and Tanzania (75%). While 10 surveyed countries have the most negative view (Below 50%) of the United States. With the countries being Egypt (10%), Jordan (12%), Pakistan (14%), Turkey (19%), Russia (23%), Palestinian Territories (30%), Greece (34%), Argentina (36%), Lebanon (41%), Tunisia (42%). Americans' own view of the United States was viewed at 84%.\nInternational opinion about the US has often changed with different executive administrations. For example in 2009, the French public favored the United States when President Barack Obama (75% favorable) replaced President George W. Bush (42%). After President Donald Trump took the helm in 2017, French public opinion about the US fell from 63% to 46%. These trends were also seen in other European countries.\n http://www.pewresearch.org/fact-tank/2017/08/18/6-trends-in-international-public-opinion-from-our-global-indicators-database/\n\nCovert actions\n\nUnited States foreign policy also includes covert actions to topple foreign governments that have been opposed to the United States. According to J. Dana Stuster, writing in Foreign Policy, there are seven \"confirmed cases\" where the U.S.—acting principally through the Central Intelligence Agency (CIA), but sometimes with the support of other parts of the U.S. government, including the Navy and State Department—covertly assisted in the overthrow of a foreign government: Iran in 1953, Guatemala in 1954, Congo in 1960, the Dominican Republic in 1961, South Vietnam in 1963, Brazil in 1964, and Chile in 1973. Stuster states that this list excludes \"U.S.-supported insurgencies and failed assassination attempts\" such as those directed against Cuba's Fidel Castro, as well as instances where U.S. involvement has been alleged but not proven (such as Syria in 1949).\n\nIn 1953 the CIA, working with the British government, initiated Operation Ajax against the Prime Minister of Iran Mohammad Mossadegh who had attempted to nationalize Iran's oil, threatening the interests of the Anglo-Persian Oil Company. This had the effect of restoring and strengthening the authoritarian monarchical reign of Shah Mohammad Reza Pahlavi. In 1957, the CIA and Israeli Mossad aided the Iranian government in establishing its intelligence service, SAVAK, later blamed for the torture and execution of the regime's opponents.\n\nA year later, in Operation PBSUCCESS, the CIA assisted the local military in toppling the democratically elected left-wing government of Jacobo Árbenz in Guatemala and installing the military dictator Carlos Castillo Armas. The United Fruit Company lobbied for Árbenz overthrow as his land reforms jeopardized their land holdings in Guatemala, and painted these reforms as a communist threat. The coup triggered a decades long civil war which claimed the lives of an estimated 200,000 people (42,275 individual cases have been documented), mostly through 626 massacres against the Maya population perpetrated by the U.S.-backed Guatemalan military.Stephen Schlesinger (3 June 2011). [https://www.nytimes.com/2011/06/04/opinion/04schlesinger.html?_r0 Ghosts of Guatemala's Past]. The New York Times. Retrieved 5 July 2014. An independent Historical Clarification Commission found that U.S. corporations and government officials \"exercised pressure to maintain the country's archaic and unjust socio-economic structure,\" and that the CIA backed illegal counterinsurgency operations.\n\nDuring the massacre of at least 500,000 alleged communists in 1960s Indonesia, U.S. government officials applauded the mass killings while providing covert assistance to the Indonesian military which helped facilitate them.Samantha Michaels (October 1, 2015). [http://www.motherjones.com/politics/2015/09/its-been-50-years-biggest-us-backed-genocide-youve-never-heard It's Been 50 Years Since the Biggest US-Backed Genocide You've Never Heard Of]. Mother Jones. Retrieved December 25, 2015. This included the U.S. Embassy in Jakarta supplying Indonesian forces with lists of up to 5,000 names of suspected members of the Communist Party of Indonesia (PKI), who were subsequently killed in the massacres.Bellamy, Alex J. (2012). Massacres and Morality: Mass Atrocities in an Age of Civilian Immunity. Oxford University Press. . [https://books.google.com/books?idEK8eK2xPCycC&lpg\nPP1&pgPA210#v\nonepage&q&ffalse p. 210.]Mark Aarons (2007). \"[https://books.google.com/books?iddg0hWswKgTIC&lpg\nPA80&pgPA69#v\nonepage&q&ffalse Justice Betrayed: Post-1945 Responses to Genocide].\" In David A. Blumenthal and Timothy L. H. McCormack (eds). [http://www.brill.com/legacy-nuremberg-civilising-influence-or-institutionalised-vengeance The Legacy of Nuremberg: Civilising Influence or Institutionalised Vengeance? (International Humanitarian Law).] Martinus Nijhoff Publishers.  [https://books.google.com/books?id\ndg0hWswKgTIC&lpgPP1&pg\nPA81#vonepage&q&f\nfalse pp. 80–81]Vickers, Adrian (2005). A History of Modern Indonesia. Cambridge University Press.  p. 157Friend, Theodore (2003). Indonesian Destinies. Harvard University Press.  p. 117 In 2001, the CIA attempted to prevent the publication of the State Department volume Foreign Relations of the United States, 1964–1968, which documents the U.S. role in providing covert assistance to the Indonesian military for the express purpose of the extirpation of the PKI.Margaret Scott (November 2, 2015) [http://www.nybooks.com/blogs/nyrblog/2015/nov/02/indonesian-massacre-what-did-us-know/ The Indonesian Massacre: What Did the US Know?] The New York Review of Books. Retrieved November 6, 2015.[http://articles.latimes.com/2001/jul/28/news/mn-27536 U.S. Seeks to Keep Lid on Far East Purge Role]. The Associated Press via The Los Angeles Times, July 28, 2001. Retrieved November 6, 2015.Thomas Blanton (ed). [http://nsarchive.gwu.edu/NSAEBB/NSAEBB52/ CIA STALLING STATE DEPARTMENT HISTORIES: STATE HISTORIANS CONCLUDE U.S. PASSED NAMES OF COMMUNISTS TO INDONESIAN ARMY, WHICH KILLED AT LEAST 105,000 IN 1965–66]. National Security Archive Electronic Briefing Book No. 52., July 27, 2001. Retrieved November 6, 2015. In July 2016,  an international panel of judges ruled the killings constitute crimes against humanity, and that the US, along with other Western governments, were complicit in these crimes.\n\nIn 1970, the CIA worked with coup-plotters in Chile in the attempted kidnapping of General René Schneider, who was targeted for refusing to participate in a military coup upon the election of Salvador Allende. Schneider was shot in the botched attempt and died three days later. The CIA later paid the group $35,000 for the failed kidnapping.[http://abcnews.go.com/International/story?id82588 CIA Admits Involvement in Chile]. ABC News. September 20John Dinges. The Condor Years: How Pinochet And His Allies Brought Terrorism To Three Continents. The New Press, 2005. [https://books.google.com/books?id\n3JjtHROah_YC&lpgPP1&pg\nPA20#vonepage&q&f\nfalse p. 20]. \n\nInfluencing foreign elections\n\nAccording to one peer-reviewed study, the U.S. intervened in 81 foreign elections between 1946 and 2000, while the Soviet Union or Russia intervened in 36. See the full list of interventions in the [http://isq.oxfordjournals.org/content/isq/suppl/2016/02/29/sqv016.DC1/appendix_2.pdf appendix.]\n\nHuman rights\n\nSince the 1970s, issues of human rights have become increasingly important in American foreign policy.Joe Renouard, Human Rights in American Foreign Policy: From the 1960s to the Soviet Collapse (U of Pennsylvania Press, 2016). 324 pp. Congress took the lead in the 1970s. Following the Vietnam War, the feeling that U.S. foreign policy had grown apart from traditional American values was seized upon by Senator Donald M. Fraser (D, MI), leading the Subcommittee on International Organizations and Movements, in criticizing Republican Foreign Policy under the Nixon administration. In the early 1970s, Congress concluded the Vietnam War and passed the War Powers Act. As \"part of a growing assertiveness by Congress about many aspects of Foreign Policy,\" Human Rights concerns became a battleground between the Legislative and the Executive branches in the formulation of foreign policy. David Forsythe points to three specific, early examples of Congress interjecting its own thoughts on foreign policy:\n\n# Subsection (a) of the International Financial Assistance Act of 1977: ensured assistance through international financial institutions would be limited to countries \"other than those whose governments engage in a consistent pattern of gross violations of internationally recognized human rights.\"\n# Section 116 of the Foreign Assistance Act of 1961, as amended in 1984: reads in part, \"No assistance may be provided under this part to the government of any country which engages in a consistent pattern of gross violations of internationally recognized human rights.\"\n# Section 502B of the Foreign Assistance Act of 1961, as amended in 1978: \"No security assistance may be provided to any country the government of which engages in a consistent pattern of gross violations of internationally recognized human rights.\"\n\nThese measures were repeatedly used by Congress, with varying success, to affect U.S. foreign policy towards the inclusion of Human Rights concerns. Specific examples include El Salvador, Nicaragua, Guatemala and South Africa. The Executive (from Nixon to Reagan) argued that the Cold War required placing regional security in favor of U.S. interests over any behavioral concerns of national allies. Congress argued the opposite, in favor of distancing the United States from oppressive regimes. Nevertheless, according to historian Daniel Goldhagen, during the last two decades of the Cold War, the number of American client states practicing mass murder outnumbered those of the Soviet Union.Daniel Goldhagen (2009). Worse Than War. PublicAffairs.  p. 537\n* \"During the 1970s and 1980s, the number of American client states practicing mass-murderous politics exceeded those of the Soviets.\" John Henry Coatsworth, a historian of Latin America and the provost of Columbia University, suggests the number of repression victims in Latin America alone far surpassed that of the USSR and its East European satellites during the period 1960 to 1990. W. John Green contends that the United States was an \"essential enabler\" of \"Latin America's political murder habit, bringing out and allowing to flourish some of the region's worst tendencies.\"W. John Green (June 1, 2015). [http://www.sunypress.edu/p-6060-a-history-of-political-murder-i.aspx A History of Political Murder in Latin America: Killing the Messengers of Change] . SUNY Press. [https://books.google.com/books?idNyezCAAAQBAJ&lpg\nPP1&pgPA147#v\nonepage&q&f=false p. 147]. \n\nOn December 6, 2011, Obama instructed agencies to consider LGBT rights when issuing financial aid to foreign countries. He also criticized Russia's law discriminating against gays, joining other western leaders in the boycott of the 2014 Winter Olympics in Russia.\n\nIn June 2014, a Chilean court ruled that the United States played a key role in the murders of Charles Horman and Frank Teruggi, both American citizens, shortly after the 1973 Chilean coup d'état.Pascale Bonnefoy (30 June 2014). [https://www.nytimes.com/2014/07/01/world/americas/chilean-court-rules-us-had-role-in-murders.html?_r=0 Chilean Court Rules U.S. Had Role in Murders]. The New York Times. Retrieved 4 July 2014.\n\nWar on Drugs\n\nUnited States foreign policy is influenced by the efforts of the U.S. government to control imports of illicit drugs, including cocaine, heroin, methamphetamine, and cannabis. This is especially true in Latin America, a focus for the U.S. War on Drugs. Those efforts date back to at least 1880, when the U.S. and China completed an agreement that prohibited the shipment of opium between the two countries.\n\nOver a century later, the Foreign Relations Authorization Act requires the President to identify the major drug transit or major illicit drug-producing countries. In September 2005, the following countries were identified: Bahamas, Bolivia, Brazil, Burma, Colombia, Dominican Republic, Ecuador, Guatemala, Haiti, India, Jamaica, Laos, Mexico, Nigeria, Pakistan, Panama, Paraguay, Peru and Venezuela. Two of these, Burma and Venezuela are countries that the U.S. considers to have failed to adhere to their obligations under international counternarcotics agreements during the previous 12 months. Notably absent from the 2005 list were Afghanistan, the People's Republic of China and Vietnam; Canada was also omitted in spite of evidence that criminal groups there are increasingly involved in the production of MDMA destined for the United States and that large-scale cross-border trafficking of Canadian-grown cannabis continues. The U.S. believes that the Netherlands are successfully countering the production and flow of MDMA to the U.S.\n\nCriticism\n\nCritics from the left cite episodes that undercut leftist governments or showed support for Israel. Others cite human rights abuses and violations of international law. Critics have charged that the U.S. presidents have used democracy to justify military intervention abroad. Critics also point to declassified records which indicate that the CIA under Allen Dulles and the FBI under J. Edgar Hoover aggressively recruited more than 1,000 Nazis, including those responsible for war crimes, to use as spies and informants against the Soviet Union in the Cold War.Eric Lichtblau (October 26, 2014). [https://www.nytimes.com/2014/10/27/us/in-cold-war-us-spy-agencies-used-1000-nazis.html In Cold War, U.S. Spy Agencies Used 1,000 Nazis]. The New York Times. Retrieved November 10, 2014.[http://www.democracynow.org/2014/10/31/the_nazis_next_door_eric_lichtblau The Nazis Next Door: Eric Lichtblau on How the CIA & FBI Secretly Sheltered Nazi War Criminals]. Democracy Now! October 31, 2014.\n\nThe U.S. has faced criticism for backing right-wing dictators that systematically violated human rights, such as Augusto Pinochet of Chile,Peter Kornbluh (September 11, 2013). The Pinochet File: A Declassified Dossier on Atrocity and Accountability. The New Press.  [https://books.google.com/books?idWHYRBAAAQBAJ&lpg\nPP1&pgPR18#v\nonepage&q&ffalse p. xviii] Alfredo Stroessner of Paraguay,Walter L. Hixson (2009). [http://yalepress.yale.edu/book.asp?isbn9780300119121 The Myth of American Diplomacy: National Identity and U.S. Foreign Policy]. Yale University Press. [https://books.google.com/books?id\nDNId6HxkzQwC&lpgPP1&pg\nPA223#vonepage&q&f\nfalse p. 223].  Efraín Ríos Montt of Guatemala,[https://www.nytimes.com/roomfordebate/2013/05/19/what-guilt-does-the-us-bear-in-guatemala What Guilt Does the U.S. Bear in Guatemala?] The New York Times, May 19, 2013. Retrieved July 1, 2014. Jorge Rafael Videla of Argentina,Duncan Campbell (December 5, 2003). [https://www.theguardian.com/world/2003/dec/06/argentina.usa Kissinger approved Argentinian 'dirty war']. The Guardian. Retrieved August 29, 2015. Hissène Habré of Chad[https://www.nytimes.com/2016/05/31/world/africa/hissene-habre-leader-chad-war-crimes.html?_r0 Hissène Habré, Ex-President of Chad, Is Convicted of War Crimes]. The New York Times. May 30, 2016.[http://www.democracynow.org/2016/5/31/from_us_ally_to_convicted_war From U.S. Ally to Convicted War Criminal: Inside Chad's Hissène Habré's Close Ties to Reagan Admin]. Democracy Now! May 31, 2016. Yahya Khan of Pakistan[http://www.newyorker.com/news/news-desk/looking-away-from-genocide Looking Away from Genocide]. The New Yorker. November 19, 2013. and Suharto of Indonesia.Kai Thaler (December 2, 2015). [https://www.washingtonpost.com/news/monkey-cage/wp/2015/12/02/50-years-ago-today-the-u-s-embassy-endorsed-mass-killings-in-indonesia-heres-what-that-means-for-today/ 50 years ago today, American diplomats endorsed mass killings in Indonesia. Here's what that means for today.] The Washington Post. Retrieved December 4, 2015. Critics have also accused the United States of supporting Operation Condor, an international campaign of political assassination and state terror organized by right-wing military dictatorships in the Southern Cone of South America.Greg Grandin (2011). [http://www.press.uchicago.edu/ucp/books/book/chicago/L/bo11643711.html The Last Colonial Massacre: Latin America in the Cold War]. University of Chicago Press. [https://books.google.com/books?id6FivSpNY2fkC&lpg\nPP1&pgPA75#v\nonepage&q&f=false p. 75]. \n\nJournalists and human rights organizations have been critical of US-led airstrikes and targeted killings by drones which have in some cases resulted in collateral damage of civilian populations.[http://www.cnn.com/2016/07/19/world/syria-airstrikes-civilian-casualties/ U.S.-led airstrikes in Syria kill civilians, rights groups say]. CNN. July 20, 2016.Jeremy Scahill and the staff of The Intercept (2016).  The Assassination Complex: Inside the Government's Secret Drone Warfare Program. Simon & Schuster.  In early 2017, the U.S. faced criticism from some scholars, activists and media outlets for dropping 26,171 bombs on seven different countries throughout 2016: Syria, Iraq, Afghanistan, Libya, Yemen, Somalia and Pakistan.\n\nStudies have been devoted to the historical success rate of the U.S. in exporting democracy abroad. Some studies of American intervention have been pessimistic about the overall effectiveness of U.S. efforts to encourage democracy in foreign nations. Some scholars have generally agreed with international relations professor Abraham Lowenthal that U.S. attempts to export democracy have been \"negligible, often counterproductive, and only occasionally positive.\" Other studies find U.S. intervention has had mixed results, and another by Hermann and Kegley has found that military interventions have improved democracy in other countries. A 2013 global poll in 68 countries with 66,000 respondents by Win/Gallup found that the U.S. is perceived as the biggest threat to world peace.\n\nSupport\n\nRegarding support for certain anti-Communist dictatorships during the Cold War, a response is that they were seen as a necessary evil, with the alternatives even worse Communist or fundamentalist dictatorships. David Schmitz says this policy did not serve U.S. interests. Friendly tyrants resisted necessary reforms and destroyed the political center (though not in South Korea), while the 'realist' policy of coddling dictators brought a backlash among foreign populations with long memories.The United States and Right-Wing Dictatorships, 1965–1989. David F. Schmitz. 2006.[http://www.telegraph.co.uk/opinion/main.jhtml?xml\n/opinion/2005/12/11/do1102.xml&sSheet=/opinion/2005/12/11/ixopinion.html Do the sums, then compare U.S. and Communist crimes from the Cold War] Telegraph, 11 December 2005, Niall Ferguson\n\nMany democracies have voluntary military ties with United States. See NATO, ANZUS, Treaty of Mutual Cooperation and Security between the United States and Japan, Mutual Defense Treaty with South Korea, and Major non-NATO ally. Those nations with military alliances with the U.S. can spend less on the military since they can count on U.S. protection. This may give a false impression that the U.S. is less peaceful than those nations.[http://www.economist.com/world/international/displaystory.cfm?story_id=9266967 Give peace a rating] May 31, 2007, from The Economist print edition[https://web.archive.org/web/20070626090409/http://www.japantoday.com/jp/news/407850/all Japan ranked as world's 5th most peaceful nation: report] Japan Today, May 31, 2007\n\nResearch on the democratic peace theory has generally found that democracies, including the United States, have not made war on one another. There have been U.S. support for coups against some democracies, but for example Spencer R. Weart argues that part of the explanation was the perception, correct or not, that these states were turning into Communist dictatorships. Also important was the role of rarely transparent United States government agencies, who sometimes mislead or did not fully implement the decisions of elected civilian leaders. pp. 221–24, 314.\n\nEmpirical studies (see democide) have found that democracies, including the United States, have killed much fewer civilians than dictatorships.Death By Government By R.J. Rummel New Brunswick, N.J.: Transaction Publishers, 1994. Online links: [http://www.hawaii.edu/powerkills/NOTE1.HTM] [http://www.hawaii.edu/powerkills/SOD.FIG23.4.GIF] [http://www.hawaii.edu/powerkills/POWER.FIG2.GIF][http://www.cidcm.umd.edu/inscr/genocide/ No Lessons Learned from the Holocaust?] , Barbara Harff, 2003. Media may be biased against the U.S. regarding reporting human rights violations. Studies have found that The New York Times coverage of worldwide human rights violations predominantly focuses on the human rights violations in nations where there is clear U.S. involvement, while having relatively little coverage of the human rights violations in other nations. For example, the bloodiest war in recent time, involving eight nations and killing millions of civilians, was the Second Congo War, which was almost completely ignored by the media.\n\nNiall Ferguson argues that the U.S. is incorrectly blamed for all the human rights violations in nations they have supported. He writes that it is generally agreed that Guatemala was the worst of the US-backed regimes during the Cold War. However, the U.S. cannot credibly be blamed for all the 200,000 deaths during the long Guatemalan Civil War. The U.S. Intelligence Oversight Board writes that military aid was cut for long periods because of such violations, that the U.S. helped stop a coup in 1993, and that efforts were made to improve the conduct of the security services.[http://www.ciponline.org/iob.htm Report on the Guatemala Review] Intelligence Oversight Board. June 28, 1996.\n\nToday the U.S. states that democratic nations best support U.S. national interests. According to the U.S. State Department, \"Democracy is the one national interest that helps to secure all the others. Democratically governed nations are more likely to secure the peace, deter aggression, expand open markets, promote economic development, protect American citizens, combat international terrorism and crime, uphold human and worker rights, avoid humanitarian crises and refugee flows, improve the global environment, and protect human health.\" According to former U.S. President Bill Clinton, \"Ultimately, the best strategy to ensure our security and to build a durable peace is to support the advance of democracy elsewhere. Democracies don't attack each other.\" In one view mentioned by the U.S. State Department, democracy is also good for business. Countries that embrace political reforms are also more likely to pursue economic reforms that improve the productivity of businesses. Accordingly, since the mid-1980s, under President Ronald Reagan, there has been an increase in levels of foreign direct investment going to emerging market democracies relative to countries that have not undertaken political reforms. Leaked cables in 2010 suggested that the \"dark shadow of terrorism still dominates the United States' relations with the world\".\n\nThe United States officially maintains that it supports democracy and human rights through several tools  Examples of these tools are as follows:\n* A published yearly report by the State Department entitled \"Advancing Freedom and Democracy\", issued in compliance with ADVANCE Democracy Act of 2007 (earlier the report was known as \"Supporting Human Rights and Democracy: The U.S. Record\" and was issued in compliance with a 2002 law).\n* A yearly published \"Country Reports on Human Rights Practices.\" \n* In 2006 (under President George W. Bush), the United States created a \"Human Rights Defenders Fund\" and \"Freedom Awards.\" \n* The \"Human Rights and Democracy Achievement Award\" recognizes the exceptional achievement of officers of foreign affairs agencies posted abroad.[https://web.archive.org/web/20061217115244/http://www.state.gov/g/drl/rls/77769.htm ]\n* The \"Ambassadorial Roundtable Series\", created in 2006, are informal discussions between newly confirmed U.S. Ambassadors and human rights and democracy non-governmental organizations.\n* The National Endowment for Democracy, a private non-profit created by Congress in 1983 (and signed into law by President Ronald Reagan), which is mostly funded by the U.S. Government and gives cash grants to strengthen democratic institutions around the world.\n\nBy country or region\n\nUnited Kingdom\n\nUnited States foreign policy affirms its alliance with the United Kingdom as its most important bilateral relationship in the world, evidenced by aligned political affairs between the White House and 10 Downing Street, as well as joint military operations carried out between the two nations. While both the United States and the United Kingdom maintain close relationships with many other nations around the world, the level of cooperation in military planning, execution of military operations, nuclear weapons technology, and intelligence sharing with each other has been described as \"unparalleled\" among major powers throughout the 20th and early 21st century.\n\nThe United States and Britain share the world's largest foreign direct investment partnership. American investment in the United Kingdom reached $255.4 billion in 2002, while British direct investment in the United States totaled $283.3 billion.US Department of State, Background Note on the United Kingdom\n\nCanada\n\nThe bilateral relationship between Canada and the United States is of notable importance to both countries. About 75–85% of Canadian trade is with the United States, and Canada is the United States' largest trading partner and chief supplier of oil. While there are disputed issues between the two nations, relations are close and the two countries share the \"world's longest undefended border.\"John Herd Thompson, and Stephen J. Randall, Canada and the United States: Ambivalent Allies (4th ed. McGill-Queen's University Press, 2008) is the standard scholarly survey The border was demilitarized after the War of 1812 and, apart from minor raids, has remained peaceful. Military collaboration began during World War II and continued throughout the Cold War on both a bilateral basis and a multilateral relationship through NATO. A high volume of trade and migration between the United States and Canada since the 1850s has generated closer ties, despite continued Canadian fears of being culturally overwhelmed by its neighbor, which is nine times larger in terms of population and eleven times larger in terms of economy. The two economies have increasingly merged since the North American Free Trade Agreement (NAFTA) of 1994, which also includes Mexico.\n\nMexico\n\nThe United States shares a unique and often complex relationship with Mexico. A history of armed conflict goes back to the Texas Revolution in the 1830s, the Mexican–American War in the 1840s, and an American invasion in the 1910s. Important treaties include the Gadsden Purchase, and multilaterally with Canada, the North American Free Trade Agreement. The central issue in recent years has been illegal immigration, followed by illegal gun sales (from the U.S.), drug smuggling (to the U.S.) and escalating drug cartel violence just south of the U.S.-Mexico border.Tim Padgett, \"Mexico's Calderón Needs to Listen, Not Just Lecture U.S.\" TIME May 19, 2010 [http://www.time.com/time/world/article/0,8599,1990176,00.html online]Burton Kirkwood, The History of Mexico (2010) pp 97–99, 138–52, 216\n\nAustralia\n\nThe United States' relationship with Australia is a very close one, with Secretary of State Hillary Clinton stating that \"America doesn't have a better friend in the world than Australia\". The relationship is formalized by the ANZUS treaty and the Australia–United States Free Trade Agreement.\nThe two countries have a shared history, both have previously been British Colonies and many Americans flocked to the Australian goldfields in the 19th century. At a strategic level, the relationship really came to prominence in World War II, when the two nations worked extremely closely in the Pacific War against Japan, with General Douglas MacArthur undertaking his role as Supreme Allied Commander based in Australia, effectively having Australian troops and resources under his command. During this period, the cultural interaction between Australia and the U.S. were elevated to a higher level as over 1 million U.S. military personnel moved through Australia during the course of the war. The relationship continued to evolve throughout the second half of the 20th Century, and today now involves strong relationships at the executive and mid levels of government and the military, leading Assistant Secretary of State for East Asian and Pacific Affairs, Kurt M. Campbell to declare that \"in the last ten years, [Australia] has ascended to one of the closest one or two allies [of the U.S.] on the planet\".\n\nMiddle East\n\nThe United States has many important allies in the Greater Middle East region. These allies are Turkey, Saudi Arabia, Morocco, Jordan, Afghanistan, Israel, Egypt, Kuwait, Bahrain and Qatar. Israel and Egypt are leading recipients of United States foreign aid, receiving $2.775 billion and 1.75 billion in 2010. Turkey is an ally of the United States through its membership in NATO, while all of the other countries except Saudi Arabia and Qatar are major non-NATO allies.\n\nThe United States toppled the government of Saddam Hussein during the 2003 invasion of Iraq. Turkey is host to approximately 90 B61 nuclear bombs at Incirlik Air Base. Other allies include Qatar, where 3,500 U.S. troops are based, and Bahrain, where the United States Navy maintains NSA Bahrain, home of NAVCENT and the Fifth Fleet.\n\nJapan\n\nThe relationship began in the 1850s as the U.S. was a major factor in forcing Japan to resume contacts with the outer world beyond a very restricted role. In the late 19th century the Japanese sent many delegations to Europe, and some to the U.S., to discover and copy the latest technology and thereby modernize Japan very rapidly and allow it to build its own empire. There was some friction over control of Hawaii and the Philippines, but Japan stood aside as the U.S. annexed those lands in 1898. Likewise the U.S. did not object when Japan took control of Korea. The two nations cooperated with the European powers in suppressing the Boxer Rebellion in China in 1900, but the U.S. was increasingly troubled about Japan's denial of the Open Door Policy that would ensure that all nations could do business with China on an equal basis.Foster Rhea Dulles, Yankees and Samurai: America's Role in the Emergence of Modern Japan, 1791–1900 (1965)\n\nPresident Theodore Roosevelt admired Japan's strength as it defeated a major European power, Russia. He brokered an end to the war between Russia and Japan in 1905–6. Anti-Japanese sentiment (especially on the West Coast) soured relations in the 1907–24 era. In the 1930s the U.S. protested vehemently against Japan's seizure of Manchuria (1931), its war against China (1937–45), and its seizure of Indochina (Vietnam) 1940–41. American sympathies were with China and Japan rejected increasingly angry American demands that Japan pull out of China. The two nations fought an all-out war 1941–45; the U.S. won a total victory, with heavy bombing (including two atomic bombs on Hiroshima and Nagasaki) that devastated Japan's 50 largest industrial cities. The American army under Douglas MacArthur occupied and ruled Japan, 1945–51, with the successful goal of sponsoring a peaceful, prosperous and democratic nation.Walter LaFeber, The Clash: A History of US–Japan Relations (W.W. Norton, 1997)\n\nIn 1951, the U.S. and Japan signed Treaty of San Francisco and Security Treaty Between the United States and Japan, subsequently revised as Treaty of Mutual Cooperation and Security between the United States and Japan in 1960, relations since then have been excellent. The United States considers Japan to be one of its closest allies, and it is both a Major Non-NATO ally and NATO contact country. The United States has several military bases in Japan including Yokosuka, which harbors the U.S. 7th Fleet. The JSDF, or Japanese Self Defense Force, cross train with the U.S. Military, often providing auxiliary security and conducting war games. When the U.S.President Barack Obama met with Japanese Prime Minister Taro Aso in 2009, he said the relationship with Japan as the \"cornerstone of security in East Asia\". After the several years of critical moment during Japan's Democratic Party administration, President Obama and Prime Minister Shinzō Abe reconfirmed the importance of its alliance and currently the U.S. and Japan negotiating to participate Trans-Pacific Strategic Economic Partnership.\n\nSouth Korea\n\nSouth Korea–United States relations have been most extensive since 1945, when the United States helped establish capitalism in South Korea and led the UN-sponsored Korean War against North Korea and China (1950–53).Jae Ho  Chung, Between Ally and Partner: Korea-China Relations and the United States (2008) [https://www.amazon.com/gp/reader/0231139071/ excerpt and text search] Stimulated by heavy American aid, South Korea's rapid economic growth, democratization and modernization greatly reduced its U.S. dependency. Large numbers of U.S. forces remain in Korea. At the 2009 G-20 London summit, U.S. President Barack Obama called South Korea \"one of America's closest allies and greatest friends.\" \n\nChina\n\nAmerican relations with the People's Republic of China are quite strong, yet complex. A great amount of trade between the two countries necessitates positive political relations, although occasional disagreements over tariffs, currency exchange rates and the Political status of Taiwan do occur. Nevertheless, the United States and China have an extremely extensive partnership. The U.S. criticizes China on human rights issues and in recent years, China has criticized the United States on human rights in return.\n\nTaiwan\n\nTaiwan (officially the Republic of China), does not have official diplomatic relations with America and no longer receives diplomatic recognition from the State Department of the United States, but it conducts unofficial diplomatic relations through its de facto embassy, commonly known as the \"American Institute in Taiwan (AIT)\", and is considered to be a strong Asian ally and supporter of the United States.Nancy Bernkopf Tucker, ed., Dangerous Strait: The U.S.-Taiwan-China Crisis (2005)\n\nASEAN\n\nAssociation of Southeast Asian Nations (ASEAN) is an important partner for United States in both economic and geostrategic aspects. ASEAN's geostrategic importance stems from many factors, including: the strategic location of member countries, the large shares of global trade that pass through regional waters, and the alliances and partnerships which the United States shares with ASEAN member states. In July 2009, the United States signed ASEAN's Treaty of Amity and Cooperation, which establishes guiding principles intended to build confidence among its signatories with the aim of maintaining regional peace and stability.Daniel Seah, \"The Treaty of Amity and Cooperation in Southeast Asia: The Issue of Non-Intervention and its Accession by Australia and the USA,\"  Chinese Journal of international Law and (2012) 11#4 pp. 785–822  [http://chinesejil.oxfordjournals.org/content/11/4/785.short online] Trade flows are robust and increasing between America and the ASEAN region.\n\nIndonesia\n\nAs the largest ASEAN member, Indonesia has played an active and prominent role in developing the organization.See  For United States, Indonesia is important for dealing with certain issues; such as terrorism,[http://www.cdi.org/terrorism/priority.cfm U.S.-Indonesia Military Relations in The Anti-Terror War]  democracy, and how United States project its relations with Islamic world, since Indonesia has the world's largest Islamic population, and one that honors and respects religious diversity. The U.S. eyes Indonesia as a potential strategic ally in Southeast Asia. During his stately visit to Indonesia, U.S. President Barack Obama has held up Indonesia as an example of how a developing nation can embrace democracy and diversity.[http://projects.washingtonpost.com/obama-speeches/speech/486/ Obama delivers a speech in the University of Indonesia] \n\nMalaysia\n\nDespite increasingly strained relations under the Mahathir Mohamad government, ties have been thawed under Najib Razak's administration. Economic ties are particularly robust, with the United States being Malaysia's largest trading partner and Malaysia is the tenth-largest trading partner of the U.S. Annual two-way trade amounts to $49 billion. The United States and Malaysia launched negotiations for a bilateral free trade agreement (FTA) in June 2006.\n\nThe United States and Malaysia enjoy strong security cooperation. Malaysia hosts the Southeast Asia Regional Center for Counterterrorism (SEARCCT), where over 2000 officials from various countries have received training. The United States is among the foreign countries that has collaborated with the center in conducting capacity building programmes. The U.S. and Malaysia share a strong military-to-military relationship with numerous exchanges, training, joint exercises, and visits.\n\nMyanmar\n\nBilateral ties have generally been strained but are slowly improving. The United States has placed broad sanctions on Burma because of the military crackdown in 1988 and the military regime's refusal to honour the election results of the 1990 People's Assembly election. Similarly, the European Union has placed embargoes on Burma, including an arms embargo, cessation of trade preferences, and suspension of all aid with the exception of humanitarian aid.\n\nUS and European government sanctions against the military government, alongside boycotts and other types direct pressure on corporations by western supporters of the Burmese democracy movement, have resulted in the withdrawal from Burma of most U.S. and many European companies. However, several Western companies remain due to loopholes in the sanctions.[https://foreignpolicy.com/story/cms.php?story_id=3986 The List: Burma's Economic Lifelines]. Foreign Policy. October 2007 Asian corporations have generally remained willing to continue investing in Myanmar and to initiate new investments, particularly in natural resource extraction.\n\nOngoing reforms have improved relations between Burma and the United States.\n\nPhilippines\n\nThe United States ruled the Philippines from 1898 to 1946. The Spanish government ceded the Philippines to the United States in the 1898 Treaty of Paris that ended the Spanish–American War. The United States finally recognized Philippine independence on July 4, 1946 in the Treaty of Manila. July 4 was observed in the Philippines as Independence Day until August 4, 1964 when, upon the advice of historians and the urging of nationalists, President Diosdado Macapagal signed into law Republic Act No. 4166 designating June 12 as the country's Independence Day. Since 2003 the U.S. has designated the Philippines as a Major Non-NATO Ally.\n\nThailand\n\nThailand and the U.S. are both former Southeast Asia Treaty Organization (SEATO) members, being close partners throughout the Cold War, and are still close allies. Since 2003, the U.S. has designated  Thailand as a Major Non-NATO Ally.\n\nVietnam\n\nUnited States involved in Vietnam War in 1955 to 1975. In 1995, President Bill Clinton announced the formal normalization of diplomatic relations with Vietnam. Today, the U.S. eyes Vietnam as a potential strategic ally in Southeast Asia.\n\nEastern Europe\n\nAmerican relations with Eastern Europe are influenced by the legacy of the Cold War. Since the collapse of the Soviet Union, former Communist-bloc states in Europe have gradually transitioned to democracy and capitalism. Many have also joined the European Union and NATO, strengthening economic ties with the broader Western world and gaining the military protection of the United States via the North Atlantic Treaty.\n\nKosovo\n\nThe UN Security Council divided on the question of Kosovo's declaration of independence. Kosovo declared its independence on February 17, 2008, whilst Serbia objected that Kosovo is part of its territory. Of the five members with veto power in the UN Security Council, the US, UK, and France recognized the declaration of independence, and China has expressed concern, while Russia considers it illegal. \"In its declaration of independence, Kosovo committed itself to the highest standards of democracy, including freedom and tolerance and justice for citizens of all ethnic backgrounds\", President George W. Bush said on February 19, 2008.[http://www.america.gov/st/peacesec-english/2008/February/20080219131902idybeekcm0.4052851.html Bush Hails Kosovo Independence] , U.S. Department of State's Bureau of International Information Programs[https://www.theguardian.com/world/2007/jun/11/balkans.usa Bush insists Kosovo must be independent and receives hero's welcome in Albania], The Guardian. Foreign policy of the United States. http://en.wikipedia.org/?curid=7564."
  }
}
