{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10991",
  "eid" : "f8efe340-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497396,
  "textBody" : "Events\n\n*1258 – Baghdad falls to the Mongols, and the Abbasid Caliphate is destroyed.\n*1306 – In front of the high altar of Greyfriar's Church in Dumfries, Robert the Bruce murders John Comyn sparking revolution in the Wars of Scottish Independence\n*1355 – The St Scholastica Day riot breaks out in Oxford, England, leaving 63 scholars and perhaps 30 locals dead in two days.\n*1567 – Lord Darnley, second husband of Mary, Queen of Scots, is found strangled following an explosion at the Kirk o' Field house in Edinburgh, Scotland, a suspected assassination.\n*1763 – French and Indian War: The Treaty of Paris ends the war and France cedes Quebec to Great Britain.\n*1814 – Napoleonic Wars: The Battle of Champaubert ends in French victory over the Russians and the Prussians.\n*1840 – Queen Victoria of the United Kingdom marries Prince Albert of Saxe-Coburg-Gotha.\n*1846 – First Anglo-Sikh War: Battle of Sobraon: British defeat Sikhs in final battle of the war\n*1861 – Jefferson Davis is notified by telegraph that he has been chosen as provisional President of the Confederate States of America.\n*1862 – American Civil War: A Union naval flotilla destroys the bulk of the Confederate Mosquito Fleet in the Battle of Elizabeth City on the Pasquotank River in North Carolina.\n*1870 – The YWCA is founded in New York City.\n*1906 – , the first of a revolutionary new breed of battleships is christened and launched by King Edward VII.\n*1920 – Józef Haller de Hallenburg performs symbolic wedding of Poland to the sea, celebrating restitution of Polish access to open sea.\n*1923 – Texas Tech University is founded as Texas Technological College in Lubbock, Texas\n*1930 – Yên Bái mutiny in French Indochina\n*1933 – In round 13 of a boxing match at New York City's Madison Square Garden, Primo Carnera knocks out Ernie Schaaf. Schaaf dies four days later.\n*1936 – Second Italo-Abyssinian War: Italian troops launched the Battle of Amba Aradam against Ethiopian defenders.\n*1939 – Spanish Civil War: The Nationalists conclude their conquest of Catalonia and seal the border with France.\n*1940 – The Soviet Union begins mass deportations of Polish citizens from occupied eastern Poland to Siberia.\n*1942 – World War II: Imperial Japanese Army capture Banjarmasin, capital of Borneo in Dutch East Indies.\n*1943 – World War II: Attempting to completely lift the Siege of Leningrad, the Soviet Red Army engages German troops and Spanish volunteers in the Battle of Krasny Bor.\n*1947 – Italy cedes most of Venezia Giulia to Yugoslavia.\n*  1947   – Crowds gathered at shop windows in Paris to see Christian Dior's New Look fashion - longer skirts, nipped-in waists and padded shoulders.\n*1954 – United States President Dwight Eisenhower warns against United States intervention in Vietnam.\n*1962 – Captured American U2 spy-plane pilot Gary Powers is exchanged for captured Soviet spy Rudolf Abel.\n*  1962   – Roy Lichtenstein's first solo exhibition opened, and it included Look Mickey, which featured his first employment of Ben-Day dots, speech balloons and comic imagery sourcing, all of which he is now known for.\n*1964 – Melbourne–Voyager collision: The aircraft carrier  collides with and sinks the destroyer   off the south coast of New South Wales, Australia, killing 82.\n*1967 – The 25th Amendment to the United States Constitution is ratified.\n*1972 – Ras Al Khaimah joins the United Arab Emirates, now making up seven emirates.\n*1984 – Kenyan soldiers commit the worst ever human rights violation in the country by slaughtering an estimated 5000 ethnic Somali Kenyans in Wagalla in N.E.-Kenya.\n*1989 – Ron Brown is elected chairman of the Democratic National Committee becoming the first African American to lead a major American political party.\n*1996 – IBM supercomputer Deep Blue defeats Garry Kasparov in chess for the first time.\n*2003 – France and Belgium break the NATO procedure of silent approval concerning the timing of protective measures for Turkey in case of a possible war with Iraq.\n*2007 – Then Illinois senator Barack Obama announces his candidacy for president in the 2008 elections, which he later goes on to win. \n*2009 – The communications satellites Iridium 33 and Kosmos 2251 collide in orbit, destroying both.\n*2013 – Thirty-six people are killed and 39 others are injured in a stampede in Allahabad, India, during the Kumbh Mela festival.\n*2016 – South Korea decides to stop the operation of the Kaesong joint industrial complex with North Korea in response to the launch of Kwangmyŏngsŏng-4.\n\nBirths\n\n*1486 – George of the Palatinate, German bishop (d. 1529)\n*1499 – Thomas Platter, Swiss author and scholar (d. 1582)\n*1514 – Domenico Bollani, Bishop of Milan (d. 1579)\n*1606 – Christine of France, Duchess of Savoy (d. 1663)\n*1609 – John Suckling, English poet and playwright (d. 1642)\n*1627 – Cornelis de Bie, Flemish poet and jurist (d. 1715)\n*1685 – Aaron Hill, English poet and playwright (d. 1750)\n*1696 – Johann Melchior Molter, German violinist and composer (d. 1765)\n*1744 – William Cornwallis, English admiral and politician (d. 1819)\n*1766 – Benjamin Smith Barton, American botanist and physician (d. 1815)\n*1775 – Charles Lamb, English poet and essayist (d. 1834)\n*1785 – Claude-Louis Navier, French physicist and engineer (d. 1836)\n*1795 – Ary Scheffer, Dutch-French painter and academic (d. 1858)\n*1797 – George Chichester, 3rd Marquess of Donegall (d. 1883)\n*1821 – Roberto Bompiani, Italian painter and sculptor (d. 1908)\n*1824 – Samuel Plimsoll, English merchant and politician (d. 1898)\n*1842 – Agnes Mary Clerke, Irish astronomer and author (d. 1907)\n*1843 – Adelina Patti, Italian-French opera singer (d. 1919)\n*1846 – Lord Charles Beresford, Irish admiral and politician (d. 1919)\n*  1846   – Ira Remsen, American chemist and academic (d. 1927)\n*1847 – Nabinchandra Sen, Bangladeshi poet and author (d. 1909)\n*1859 – Alexandre Millerand, French lawyer and politician, 12th President of France (d. 1943)\n*1867 – Robert Garran, Australian lawyer and public servant (d. 1957)\n*1868 – Prince Waldemar of Prussia (d. 1879)\n*  1868   – William Allen White, American journalist and author (d. 1944)\n*1869 – Royal Cortissoz, American art critic (d. 1948)\n*1879 – Ernst Põdder, Estonian general (d. 1932)\n*1881 – Pauline Brunius, Swedish actress and director (d. 1954)\n*1883 – Edith Clarke, American electrical engineer (d. 1959)\n*  1883   – H.V. Hordern, Australian cricketer (d. 1938)\n*1889 – Cevdet Sunay, Turkish general and politician, 5th President of Turkey (d. 1982)\n*1890 – Fanny Kaplan, Ukrainian-Russian activist (d. 1918)\n*  1890   – Boris Pasternak, Russian poet, novelist, and literary translator Nobel Prize laureate (d. 1960)\n*1892 – Alan Hale Sr., American actor and director (d. 1950)\n*1893 – Jimmy Durante, American actor, singer, and pianist (d. 1980)\n*  1893   – Bill Tilden, American tennis player and coach (d. 1953)\n*1894 – Harold Macmillan, English captain and politician, Prime Minister of the United Kingdom (d. 1986)\n*1897 – Judith Anderson, Australian actress (d. 1992)\n*  1897   – John Franklin Enders, American virologist and academic, Nobel Prize laureate (d. 1985)\n*1898 – Bertolt Brecht, German director, playwright, and poet (d. 1956)\n*  1898   – Joseph Kessel, French journalist and author (d. 1979)\n*1901 – Stella Adler, American actress and educator (d. 1992)\n*1902 – Walter Houser Brattain, Chinese-American physicist and academic, Nobel Prize laureate (d. 1987)\n*1903 – Waldemar Hoven, German physician (d. 1948)\n*  1903   – Matthias Sindelar, Austrian footballer and manager (d. 1939)\n*1904 – John Farrow, Australian-American director, producer, and screenwriter (d. 1963)\n*1905 – Walter A. Brown, American businessman, founded the Boston Celtics (d. 1964)\n*  1905   – Chick Webb, American drummer and bandleader (d. 1939)\n*1906 – Lon Chaney Jr., American actor (d. 1973)\n*1907 – Anthony Cottrell, New Zealand rugby player (d. 1988)\n*1909 – Min Thu Wun, Burmese poet, scholar, and politician (d. 2004)\n*1910 – Dominique Pire, Belgian friar, Nobel Prize laureate (d. 1969)\n*1914 – Larry Adler, American harmonica player, composer, and actor (d. 2001)\n*1915 – Vladimir Zeldin, Russian actor (d. 2016)\n*1919 – Ioannis Charalambopoulos, Greek colonel and politician, Deputy Prime Minister of Greece (d. 2014)\n*1920 – Alex Comfort, English physician and author (d. 2000)\n*  1920   – Neva Patterson, American actress (d. 2010)\n*  1920   – José Manuel Castañón, Spanish lawyer and author (d. 2001)\n*1922 – Árpád Göncz, Hungarian author, playwright, and politician, 1st President of Hungary (d. 2015)\n*1923 – Allie Sherman, American football player and coach (d. 2015)\n*1924 – Max Ferguson, Canadian radio host and actor (d. 2013)\n*  1924   – Bud Poile, Canadian ice hockey player and coach (d. 2005)\n*1925 – Pierre Mondy, French actor and director (d. 2012)\n*1926 – Sidney Bryan Berry, American general (d. 2013)\n*  1926   – Danny Blanchflower, Northern Irish soldier, footballer and manager (d. 1993)\n*1927 – Leontyne Price, American operatic soprano \n*1929 – Jerry Goldsmith, American composer and conductor (d. 2004)\n*  1929   – Jim Whittaker, American mountaineer\n*  1929   – Lou Whittaker, American mountaineer\n*1930 – E. L. Konigsburg, American author and illustrator (d. 2013)\n*  1930   – Robert Wagner, American actor and producer\n*1931 – James Edward Maceo West, American inventor and acoustician\n*1932 – Barrie Ingham, English-American actor (d. 2015)\n*1933 – Richard Schickel, American journalist, author, and critic (d. 2017)\n*  1933   – Faramarz Payvar, Iranian santur player and composer (d. 2009)\n*1935 – Theodore Antoniou, Greek composer and conductor\n*1937 – Anne Anderson, Scottish physiologist and academic (d. 1983)\n*  1937   – Roberta Flack, American singer-songwriter and pianist \n*1939 – Adrienne Clarkson, Hong Kong-Canadian journalist and politician, 26th Governor General of Canada\n*1940 – Mary Rand, English sprinter and long jumper\n*  1940   – Kenny Rankin, American singer-songwriter (d. 2009)\n*1941 – Michael Apted, English director and producer\n*1944 – Peter Allen, Australian singer-songwriter, pianist, and actor (d. 1992)\n*  1944   – Frank Keating, American lawyer and politician, 25th Governor of Oklahoma\n*  1944   – Frances Moore Lappé, American author and activist\n*  1944   – Rufus Reid, American bassist and composer \n*1945 – Delma S. Arrigoitia, Puerto Rican historian, author, educator and lawyer \n*1947 – Louise Arbour, Canadian lawyer and jurist\n*  1947   – Butch Morris, American cornet player, composer, and conductor (d. 2013)\n*  1947   – Nicholas Owen, English journalist\n*1949 – Nigel Olsson, English rock drummer and singer-songwriter\n*1950 – Luis Donaldo Colosio, Mexican economist and politician (d. 1994)\n*  1950   – Mark Spitz, American swimmer\n*1951 – Bob Iger, American media executive\n*1952 – Lee Hsien Loong, Singaporean general and politician, 3rd Prime Minister of Singapore\n*1955 – Jim Cramer, American television personality, pundit, and author\n*  1955   – Greg Norman, Australian golfer and sportscaster\n*1956 – Enele Sopoaga, Tuvaluan politician, 12th Prime Minister of Tuvalu\n*1957 – Katherine Freese, American astrophysicist and academic\n*1959 – John Calipari, American basketball player and coach\n*1960 – Jim Kent, American biologist, computer programmer, academic\n*1961 – Alexander Payne, American director, producer, and screenwriter\n*  1961   – George Stephanopoulos, American television journalist\n*1962 – Randy Velischek, Canadian ice hockey player and coach\n*  1962   – Cliff Burton, American heavy metal bassist (d. 1986)\n*1963 – Lenny Dykstra, American baseball player\n*1964 – Glenn Beck, American journalist, producer, and author\n*1966 – Natalie Bennett, Australian-English journalist and politician\n*  1966   – Daryl Johnston, American football player and sportscaster\n*1967 – Laura Dern, American actress, director, and producer\n*  1967   – Jacky Durand, French cyclist and sportscaster\n*  1967   – Vince Gilligan, American director, producer, and screenwriter\n*1968 – Peter Popovic, Swedish ice hockey player and coach\n*  1968   – Garrett Reisman, American engineer and astronaut\n*1969 – Joe Mangrum, American painter and sculptor\n*  1969   – James Small, South African rugby player\n*1970 – Melissa Doyle, Australian journalist and author\n*  1970   – Noureddine Naybet, Moroccan footballer and manager\n*  1970   – Åsne Seierstad, Norwegian journalist and author\n*1971 – Lorena Rojas, Mexican actress and singer (d. 2015)\n*1972 – Michael Kasprowicz, Australian cricketer\n*1973 – Martha Lane Fox, Baroness Lane-Fox of Soho, English businesswoman and politician\n*1974 – Elizabeth Banks, American actress\n*  1974   – Ty Law, American football player\n*  1974   – Henry Paul, New Zealand rugby player and coach\n*1976 – Lance Berkman, American baseball player and coach\n*  1976   – Keeley Hawes, English actress\n*  1977   – Salif Diao, Senegalese footballer\n*1979 – Joey Hand, American race car driver\n*1980 – César Izturis, Venezuelan baseball player\n*  1980   – Enzo Maresca, Italian footballer\n*  1980   – Mike Ribeiro, Canadian ice hockey player\n*1981 – Uzo Aduba, American actress \n*  1981   – Andrew Johnson, English footballer\n*  1981   – Holly Willoughby, English model and television host\n*1982 – Justin Gatlin, American sprinter\n*  1982   – Tarmo Neemelo, Estonian footballer\n*  1982   – Hamad Al-Tayyar, Kuwaiti footballer\n*  1982   – Iafeta Paleaaesina, New Zealand rugby league player\n*1983 – Vic Fuentes, American singer-songwriter and guitarist\n*1984 – Greg Bird, Australian rugby league player\n*  1984   – Alex Gordon, American baseball player\n*  1984   – Kim Hyo-jin, South Korean actress\n*1985 – Selçuk İnan, Turkish footballer\n*1986 – Jeff Adrien, American basketball player\n*  1986   – Josh Akognon, American basketball player\n*  1986   – Radamel Falcao, Colombian footballer\n*  1986   – Roberto Jiménez Gago, Spanish footballer\n*  1986   – Viktor Troicki, Serbian tennis player\n*1987 – Jakub Kindl, Czech ice hockey player\n*  1987   – Facundo Roncaglia, Argentinian footballer\n*1988 – Francesco Acerbi, Italian footballer\n*1989 – Liam Hendriks, Australian baseball player\n*1990 – Barbara Guarischi, Italian cyclist\n*  1990   – Choi Soo-young, South Korean singer-songwriter, actress, and dancer \n*1991 – Emma Roberts, American actress \n*1992 – Haruka Nakagawa, Japanese singer and actress \n*  1992   – Reinhold Yabo, German footballer\n*1993 – Max Kepler, German baseball player\n*  1993   – Filip Twardzik, Czech footballer\n*  1993   – Luis Madrigal, Mexican footballer\n*1996 – Emanuel Mammana, Argentinian footballer\n*1997 – Lilly King, American swimmer\n*  1997   – Chloë Grace Moretz, American actress\n*  1997   – Nadia Podoroska, Argentinian tennis player\n*2000 – Yara Shahidi, American actress and model\n\nDeaths\n\n* 547 – Scholastica, Christian nun\n*1127 – William IX, Duke of Aquitaine (b. 1071)\n*1163 – Baldwin III of Jerusalem (b. 1130)\n*1242 – Emperor Shijō of Japan (b. 1231)\n*  1242   – Saint Verdiana, Italian recluse (b. 1182)\n*1280 – Margaret II, Countess of Flanders (b. 1202)\n*1306 – John \"the Red\" Comyn, Scottish nobleman\n*1307 – Temür Khan, Emperor Chengzong of Yuan (b. 1265)\n*1346 – Blessed Clare of Rimini (b. 1282)Butler, Alban et al. Butler's Lives of the Saints. London: Burns & Oates, 1995. p. 103. \n*1471 – Frederick II, Margrave of Brandenburg (b. 1413)\n*1524 – Catherine of Saxony, Archduchess of Austria (b. 1468)\n*1526 – John V, Count of Oldenburg, German noble (b. 1460)\n*1567 – Henry Stuart, Lord Darnley, consort of Mary, Queen of Scots (b. 1545)\n*1576 – Wilhelm Xylander, German scholar, translator, and academic (b. 1532)\n*1686 – William Dugdale, English genealogist and historian (b. 1605)\n*1755 – Montesquieu, French lawyer and philosopher (b. 1689)\n*1782 – Friedrich Christoph Oetinger, German theologian and author (b. 1702)\n*1829 – Pope Leo XII (b. 1760)\n*1837 – Alexander Pushkin, Russian poet and author (b. 1799)\n*1857 – David Thompson, English-Canadian surveyor and explorer (b. 1770)\n*1865 – Heinrich Lenz, Estonian-Italian physicist and academic (b. 1804) \n*1879 – Honoré Daumier, French illustrator and painter (b. 1808)\n*1887 – Ellen Wood, English author (b. 1814)\n*1891 – Sofia Kovalevskaya, Russian-Swedish mathematician and physicist (b. 1850)\n*1904 – John A. Roche, American lawyer and politician, 30th Mayor of Chicago (b. 1844)\n*1906 – Ezra Butler Eddy, American-Canadian businessman and politician (b. 1827)\n*1912 – Joseph Lister, 1st Baron Lister, English surgeon and academic (b. 1827)\n*1913 – Konstantinos Tsiklitiras, Greek long jumper (b. 1888)\n*1917 – John William Waterhouse, English soldier and painter (b. 1849)\n*1918 – Abdul Hamid II Ottoman sultan (b. 1842)\n*  1918   – Ernesto Teodoro Moneta, Italian soldier and journalist, Nobel Prize laureate (b. 1833)\n*1920 – Henry Strangways, English-Australian politician, 12th Premier of South Australia (b. 1832)\n*1923 – Wilhelm Röntgen, German physicist and academic, Nobel Prize laureate (b. 1845)\n*1928 – José Sánchez del Río, Mexican martyr and saint (b. 1913)\n*1932 – Edgar Wallace, English author and screenwriter (b. 1875)\n*1939 – Pope Pius XI (b. 1857)\n*1944 – E. M. Antoniadi, Greek-French astronomer and chess player (b. 1870)\n*1945 – Anacleto Díaz, Filipino lawyer and jurist (b. 1878)\n*1950 – Marcel Mauss, French sociologist and anthropologist (b. 1872)\n*1956 – Leonora Speyer, American poet and violinist (b. 1872)\n*  1956   – Emmanouil Tsouderos, Greek banker and politician, 132nd Prime Minister of Greece (b. 1882)\n*1957 – Laura Ingalls Wilder, American author (b. 1867)\n*1960 – Aloysius Stepinac, Croatian cardinal (b. 1898)\n*1966 – Billy Rose, American composer and songwriter (b. 1899)\n*1967 – Dionysios Kokkinos, Greek historian and author (b. 1884)\n*1975 – Nikos Kavvadias, Greek sailor and poet (b. 1910)\n*1979 – Edvard Kardelj, Slovene general and politician, 2nd Foreign Minister of Yugoslavia (b. 1910)\n*1992 – Alex Haley, American soldier, journalist, and author (b. 1921)\n*1993 – Fred Hollows, New Zealand-Australian ophthalmologist and academic (b. 1929)\n*1995 – Paul Monette, American author, poet, and activist (b. 1945)\n*1997 – Brian Connolly, Scottish musician, lead singer The Sweet (b. 1945)\n*2000 – Jim Varney, American actor, comedian and writer (b. 1949)\n*2001 – Abraham Beame, American academic and politician, 104th Mayor of New York City (b. 1906)\n*  2001   – Buddy Tate, American saxophonist and clarinet player (b. 1913)\n*2002 – Dave Van Ronk, American singer-songwriter and guitarist (b. 1936)\n*2003 – Edgar de Evia, Mexican-American photographer (b. 1910)\n*  2003   – Albert J. Ruffo, American lawyer and politician, Mayor of San Jose (b. 1908)\n*  2003   – Ron Ziegler, American politician, 14th White House Press Secretary (b. 1939)\n*2005 – Arthur Miller, American actor, playwright, and author (b. 1915)\n*2006 – James Yancey, American record producer and rapper (b. 1974)\n*2008 – Roy Scheider, American actor and boxer (b. 1932)\n*2010 – Fred Schaus, American basketball player and coach (b. 1925)\n*  2010   – Charles Wilson, American lieutenant and politician (b. 1933)\n*2011 – Trevor Bailey, English cricketer and journalist (b. 1923)\n*2012 – Lloyd Morrison, New Zealand banker and businessman, founded H. R. L. Morrison & Co (b. 1957)\n*  2012   – Jeffrey Zaslow, American journalist and author (b. 1958)\t\n*2013 – W. Watts Biggers, American author, screenwriter, and animator (b. 1927)\t\n*  2013   – David Hartman, American-Israeli rabbi and philosopher, founded the Shalom Hartman Institute (b. 1931)\t\n*2014 – Stuart Hall, Jamaican-English sociologist and theorist (b. 1932)\n*  2014   – Shirley Temple, American actress and diplomat (b. 1928)\n*2015 – Naseer Aruri, Palestinian scholar and activist (b. 1934)\n*  2015   – Karl Josef Becker, German cardinal and theologian (b. 1928)\n*  2015   – Deng Liqun, Chinese theorist and politician (b. 1915)\n*2016 – Fatima Surayya Bajia, Indian-Pakistani author and playwright (b. 1930)  \n*2017   – Mike Ilitch, American businessman (b. 1929)\n\nHolidays and observances\n\n*Christian feast day:\n**Austrebertha\n**Charalambos\n**José Sánchez del Río\n**Scholastica\n**February 10 (Eastern Orthodox liturgics)\n*Feast of St. Paul's Shipwreck (Malta)\n*Fenkil Day (Eritrea)\n*Kurdish Authors Union Day (Iraqi Kurdistan)\n*National Memorial Day of the Exiles and Foibe (Italy)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 10" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10991" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*1258 – Baghdad falls to the Mongols, and the Abbasid Caliphate is destroyed.\n*1306 – In front of the high altar of Greyfriar's Church in Dumfries, Robert the Bruce murders John Comyn sparking revolution in the Wars of Scottish Independence\n*1355 – The St Scholastica Day riot breaks out in Oxford, England, leaving 63 scholars and perhaps 30 locals dead in two days.\n*1567 – Lord Darnley, second husband of Mary, Queen of Scots, is found strangled following an explosion at the Kirk o' Field house in Edinburgh, Scotland, a suspected assassination.\n*1763 – French and Indian War: The Treaty of Paris ends the war and France cedes Quebec to Great Britain.\n*1814 – Napoleonic Wars: The Battle of Champaubert ends in French victory over the Russians and the Prussians.\n*1840 – Queen Victoria of the United Kingdom marries Prince Albert of Saxe-Coburg-Gotha.\n*1846 – First Anglo-Sikh War: Battle of Sobraon: British defeat Sikhs in final battle of the war\n*1861 – Jefferson Davis is notified by telegraph that he has been chosen as provisional President of the Confederate States of America.\n*1862 – American Civil War: A Union naval flotilla destroys the bulk of the Confederate Mosquito Fleet in the Battle of Elizabeth City on the Pasquotank River in North Carolina.\n*1870 – The YWCA is founded in New York City.\n*1906 – , the first of a revolutionary new breed of battleships is christened and launched by King Edward VII.\n*1920 – Józef Haller de Hallenburg performs symbolic wedding of Poland to the sea, celebrating restitution of Polish access to open sea.\n*1923 – Texas Tech University is founded as Texas Technological College in Lubbock, Texas\n*1930 – Yên Bái mutiny in French Indochina\n*1933 – In round 13 of a boxing match at New York City's Madison Square Garden, Primo Carnera knocks out Ernie Schaaf. Schaaf dies four days later.\n*1936 – Second Italo-Abyssinian War: Italian troops launched the Battle of Amba Aradam against Ethiopian defenders.\n*1939 – Spanish Civil War: The Nationalists conclude their conquest of Catalonia and seal the border with France.\n*1940 – The Soviet Union begins mass deportations of Polish citizens from occupied eastern Poland to Siberia.\n*1942 – World War II: Imperial Japanese Army capture Banjarmasin, capital of Borneo in Dutch East Indies.\n*1943 – World War II: Attempting to completely lift the Siege of Leningrad, the Soviet Red Army engages German troops and Spanish volunteers in the Battle of Krasny Bor.\n*1947 – Italy cedes most of Venezia Giulia to Yugoslavia.\n*  1947   – Crowds gathered at shop windows in Paris to see Christian Dior's New Look fashion - longer skirts, nipped-in waists and padded shoulders.\n*1954 – United States President Dwight Eisenhower warns against United States intervention in Vietnam.\n*1962 – Captured American U2 spy-plane pilot Gary Powers is exchanged for captured Soviet spy Rudolf Abel.\n*  1962   – Roy Lichtenstein's first solo exhibition opened, and it included Look Mickey, which featured his first employment of Ben-Day dots, speech balloons and comic imagery sourcing, all of which he is now known for.\n*1964 – Melbourne–Voyager collision: The aircraft carrier  collides with and sinks the destroyer   off the south coast of New South Wales, Australia, killing 82.\n*1967 – The 25th Amendment to the United States Constitution is ratified.\n*1972 – Ras Al Khaimah joins the United Arab Emirates, now making up seven emirates.\n*1984 – Kenyan soldiers commit the worst ever human rights violation in the country by slaughtering an estimated 5000 ethnic Somali Kenyans in Wagalla in N.E.-Kenya.\n*1989 – Ron Brown is elected chairman of the Democratic National Committee becoming the first African American to lead a major American political party.\n*1996 – IBM supercomputer Deep Blue defeats Garry Kasparov in chess for the first time.\n*2003 – France and Belgium break the NATO procedure of silent approval concerning the timing of protective measures for Turkey in case of a possible war with Iraq.\n*2007 – Then Illinois senator Barack Obama announces his candidacy for president in the 2008 elections, which he later goes on to win. \n*2009 – The communications satellites Iridium 33 and Kosmos 2251 collide in orbit, destroying both.\n*2013 – Thirty-six people are killed and 39 others are injured in a stampede in Allahabad, India, during the Kumbh Mela festival.\n*2016 – South Korea decides to stop the operation of the Kaesong joint industrial complex with North Korea in response to the launch of Kwangmyŏngsŏng-4.\n\nBirths\n\n*1486 – George of the Palatinate, German bishop (d. 1529)\n*1499 – Thomas Platter, Swiss author and scholar (d. 1582)\n*1514 – Domenico Bollani, Bishop of Milan (d. 1579)\n*1606 – Christine of France, Duchess of Savoy (d. 1663)\n*1609 – John Suckling, English poet and playwright (d. 1642)\n*1627 – Cornelis de Bie, Flemish poet and jurist (d. 1715)\n*1685 – Aaron Hill, English poet and playwright (d. 1750)\n*1696 – Johann Melchior Molter, German violinist and composer (d. 1765)\n*1744 – William Cornwallis, English admiral and politician (d. 1819)\n*1766 – Benjamin Smith Barton, American botanist and physician (d. 1815)\n*1775 – Charles Lamb, English poet and essayist (d. 1834)\n*1785 – Claude-Louis Navier, French physicist and engineer (d. 1836)\n*1795 – Ary Scheffer, Dutch-French painter and academic (d. 1858)\n*1797 – George Chichester, 3rd Marquess of Donegall (d. 1883)\n*1821 – Roberto Bompiani, Italian painter and sculptor (d. 1908)\n*1824 – Samuel Plimsoll, English merchant and politician (d. 1898)\n*1842 – Agnes Mary Clerke, Irish astronomer and author (d. 1907)\n*1843 – Adelina Patti, Italian-French opera singer (d. 1919)\n*1846 – Lord Charles Beresford, Irish admiral and politician (d. 1919)\n*  1846   – Ira Remsen, American chemist and academic (d. 1927)\n*1847 – Nabinchandra Sen, Bangladeshi poet and author (d. 1909)\n*1859 – Alexandre Millerand, French lawyer and politician, 12th President of France (d. 1943)\n*1867 – Robert Garran, Australian lawyer and public servant (d. 1957)\n*1868 – Prince Waldemar of Prussia (d. 1879)\n*  1868   – William Allen White, American journalist and author (d. 1944)\n*1869 – Royal Cortissoz, American art critic (d. 1948)\n*1879 – Ernst Põdder, Estonian general (d. 1932)\n*1881 – Pauline Brunius, Swedish actress and director (d. 1954)\n*1883 – Edith Clarke, American electrical engineer (d. 1959)\n*  1883   – H.V. Hordern, Australian cricketer (d. 1938)\n*1889 – Cevdet Sunay, Turkish general and politician, 5th President of Turkey (d. 1982)\n*1890 – Fanny Kaplan, Ukrainian-Russian activist (d. 1918)\n*  1890   – Boris Pasternak, Russian poet, novelist, and literary translator Nobel Prize laureate (d. 1960)\n*1892 – Alan Hale Sr., American actor and director (d. 1950)\n*1893 – Jimmy Durante, American actor, singer, and pianist (d. 1980)\n*  1893   – Bill Tilden, American tennis player and coach (d. 1953)\n*1894 – Harold Macmillan, English captain and politician, Prime Minister of the United Kingdom (d. 1986)\n*1897 – Judith Anderson, Australian actress (d. 1992)\n*  1897   – John Franklin Enders, American virologist and academic, Nobel Prize laureate (d. 1985)\n*1898 – Bertolt Brecht, German director, playwright, and poet (d. 1956)\n*  1898   – Joseph Kessel, French journalist and author (d. 1979)\n*1901 – Stella Adler, American actress and educator (d. 1992)\n*1902 – Walter Houser Brattain, Chinese-American physicist and academic, Nobel Prize laureate (d. 1987)\n*1903 – Waldemar Hoven, German physician (d. 1948)\n*  1903   – Matthias Sindelar, Austrian footballer and manager (d. 1939)\n*1904 – John Farrow, Australian-American director, producer, and screenwriter (d. 1963)\n*1905 – Walter A. Brown, American businessman, founded the Boston Celtics (d. 1964)\n*  1905   – Chick Webb, American drummer and bandleader (d. 1939)\n*1906 – Lon Chaney Jr., American actor (d. 1973)\n*1907 – Anthony Cottrell, New Zealand rugby player (d. 1988)\n*1909 – Min Thu Wun, Burmese poet, scholar, and politician (d. 2004)\n*1910 – Dominique Pire, Belgian friar, Nobel Prize laureate (d. 1969)\n*1914 – Larry Adler, American harmonica player, composer, and actor (d. 2001)\n*1915 – Vladimir Zeldin, Russian actor (d. 2016)\n*1919 – Ioannis Charalambopoulos, Greek colonel and politician, Deputy Prime Minister of Greece (d. 2014)\n*1920 – Alex Comfort, English physician and author (d. 2000)\n*  1920   – Neva Patterson, American actress (d. 2010)\n*  1920   – José Manuel Castañón, Spanish lawyer and author (d. 2001)\n*1922 – Árpád Göncz, Hungarian author, playwright, and politician, 1st President of Hungary (d. 2015)\n*1923 – Allie Sherman, American football player and coach (d. 2015)\n*1924 – Max Ferguson, Canadian radio host and actor (d. 2013)\n*  1924   – Bud Poile, Canadian ice hockey player and coach (d. 2005)\n*1925 – Pierre Mondy, French actor and director (d. 2012)\n*1926 – Sidney Bryan Berry, American general (d. 2013)\n*  1926   – Danny Blanchflower, Northern Irish soldier, footballer and manager (d. 1993)\n*1927 – Leontyne Price, American operatic soprano \n*1929 – Jerry Goldsmith, American composer and conductor (d. 2004)\n*  1929   – Jim Whittaker, American mountaineer\n*  1929   – Lou Whittaker, American mountaineer\n*1930 – E. L. Konigsburg, American author and illustrator (d. 2013)\n*  1930   – Robert Wagner, American actor and producer\n*1931 – James Edward Maceo West, American inventor and acoustician\n*1932 – Barrie Ingham, English-American actor (d. 2015)\n*1933 – Richard Schickel, American journalist, author, and critic (d. 2017)\n*  1933   – Faramarz Payvar, Iranian santur player and composer (d. 2009)\n*1935 – Theodore Antoniou, Greek composer and conductor\n*1937 – Anne Anderson, Scottish physiologist and academic (d. 1983)\n*  1937   – Roberta Flack, American singer-songwriter and pianist \n*1939 – Adrienne Clarkson, Hong Kong-Canadian journalist and politician, 26th Governor General of Canada\n*1940 – Mary Rand, English sprinter and long jumper\n*  1940   – Kenny Rankin, American singer-songwriter (d. 2009)\n*1941 – Michael Apted, English director and producer\n*1944 – Peter Allen, Australian singer-songwriter, pianist, and actor (d. 1992)\n*  1944   – Frank Keating, American lawyer and politician, 25th Governor of Oklahoma\n*  1944   – Frances Moore Lappé, American author and activist\n*  1944   – Rufus Reid, American bassist and composer \n*1945 – Delma S. Arrigoitia, Puerto Rican historian, author, educator and lawyer \n*1947 – Louise Arbour, Canadian lawyer and jurist\n*  1947   – Butch Morris, American cornet player, composer, and conductor (d. 2013)\n*  1947   – Nicholas Owen, English journalist\n*1949 – Nigel Olsson, English rock drummer and singer-songwriter\n*1950 – Luis Donaldo Colosio, Mexican economist and politician (d. 1994)\n*  1950   – Mark Spitz, American swimmer\n*1951 – Bob Iger, American media executive\n*1952 – Lee Hsien Loong, Singaporean general and politician, 3rd Prime Minister of Singapore\n*1955 – Jim Cramer, American television personality, pundit, and author\n*  1955   – Greg Norman, Australian golfer and sportscaster\n*1956 – Enele Sopoaga, Tuvaluan politician, 12th Prime Minister of Tuvalu\n*1957 – Katherine Freese, American astrophysicist and academic\n*1959 – John Calipari, American basketball player and coach\n*1960 – Jim Kent, American biologist, computer programmer, academic\n*1961 – Alexander Payne, American director, producer, and screenwriter\n*  1961   – George Stephanopoulos, American television journalist\n*1962 – Randy Velischek, Canadian ice hockey player and coach\n*  1962   – Cliff Burton, American heavy metal bassist (d. 1986)\n*1963 – Lenny Dykstra, American baseball player\n*1964 – Glenn Beck, American journalist, producer, and author\n*1966 – Natalie Bennett, Australian-English journalist and politician\n*  1966   – Daryl Johnston, American football player and sportscaster\n*1967 – Laura Dern, American actress, director, and producer\n*  1967   – Jacky Durand, French cyclist and sportscaster\n*  1967   – Vince Gilligan, American director, producer, and screenwriter\n*1968 – Peter Popovic, Swedish ice hockey player and coach\n*  1968   – Garrett Reisman, American engineer and astronaut\n*1969 – Joe Mangrum, American painter and sculptor\n*  1969   – James Small, South African rugby player\n*1970 – Melissa Doyle, Australian journalist and author\n*  1970   – Noureddine Naybet, Moroccan footballer and manager\n*  1970   – Åsne Seierstad, Norwegian journalist and author\n*1971 – Lorena Rojas, Mexican actress and singer (d. 2015)\n*1972 – Michael Kasprowicz, Australian cricketer\n*1973 – Martha Lane Fox, Baroness Lane-Fox of Soho, English businesswoman and politician\n*1974 – Elizabeth Banks, American actress\n*  1974   – Ty Law, American football player\n*  1974   – Henry Paul, New Zealand rugby player and coach\n*1976 – Lance Berkman, American baseball player and coach\n*  1976   – Keeley Hawes, English actress\n*  1977   – Salif Diao, Senegalese footballer\n*1979 – Joey Hand, American race car driver\n*1980 – César Izturis, Venezuelan baseball player\n*  1980   – Enzo Maresca, Italian footballer\n*  1980   – Mike Ribeiro, Canadian ice hockey player\n*1981 – Uzo Aduba, American actress \n*  1981   – Andrew Johnson, English footballer\n*  1981   – Holly Willoughby, English model and television host\n*1982 – Justin Gatlin, American sprinter\n*  1982   – Tarmo Neemelo, Estonian footballer\n*  1982   – Hamad Al-Tayyar, Kuwaiti footballer\n*  1982   – Iafeta Paleaaesina, New Zealand rugby league player\n*1983 – Vic Fuentes, American singer-songwriter and guitarist\n*1984 – Greg Bird, Australian rugby league player\n*  1984   – Alex Gordon, American baseball player\n*  1984   – Kim Hyo-jin, South Korean actress\n*1985 – Selçuk İnan, Turkish footballer\n*1986 – Jeff Adrien, American basketball player\n*  1986   – Josh Akognon, American basketball player\n*  1986   – Radamel Falcao, Colombian footballer\n*  1986   – Roberto Jiménez Gago, Spanish footballer\n*  1986   – Viktor Troicki, Serbian tennis player\n*1987 – Jakub Kindl, Czech ice hockey player\n*  1987   – Facundo Roncaglia, Argentinian footballer\n*1988 – Francesco Acerbi, Italian footballer\n*1989 – Liam Hendriks, Australian baseball player\n*1990 – Barbara Guarischi, Italian cyclist\n*  1990   – Choi Soo-young, South Korean singer-songwriter, actress, and dancer \n*1991 – Emma Roberts, American actress \n*1992 – Haruka Nakagawa, Japanese singer and actress \n*  1992   – Reinhold Yabo, German footballer\n*1993 – Max Kepler, German baseball player\n*  1993   – Filip Twardzik, Czech footballer\n*  1993   – Luis Madrigal, Mexican footballer\n*1996 – Emanuel Mammana, Argentinian footballer\n*1997 – Lilly King, American swimmer\n*  1997   – Chloë Grace Moretz, American actress\n*  1997   – Nadia Podoroska, Argentinian tennis player\n*2000 – Yara Shahidi, American actress and model\n\nDeaths\n\n* 547 – Scholastica, Christian nun\n*1127 – William IX, Duke of Aquitaine (b. 1071)\n*1163 – Baldwin III of Jerusalem (b. 1130)\n*1242 – Emperor Shijō of Japan (b. 1231)\n*  1242   – Saint Verdiana, Italian recluse (b. 1182)\n*1280 – Margaret II, Countess of Flanders (b. 1202)\n*1306 – John \"the Red\" Comyn, Scottish nobleman\n*1307 – Temür Khan, Emperor Chengzong of Yuan (b. 1265)\n*1346 – Blessed Clare of Rimini (b. 1282)Butler, Alban et al. Butler's Lives of the Saints. London: Burns & Oates, 1995. p. 103. \n*1471 – Frederick II, Margrave of Brandenburg (b. 1413)\n*1524 – Catherine of Saxony, Archduchess of Austria (b. 1468)\n*1526 – John V, Count of Oldenburg, German noble (b. 1460)\n*1567 – Henry Stuart, Lord Darnley, consort of Mary, Queen of Scots (b. 1545)\n*1576 – Wilhelm Xylander, German scholar, translator, and academic (b. 1532)\n*1686 – William Dugdale, English genealogist and historian (b. 1605)\n*1755 – Montesquieu, French lawyer and philosopher (b. 1689)\n*1782 – Friedrich Christoph Oetinger, German theologian and author (b. 1702)\n*1829 – Pope Leo XII (b. 1760)\n*1837 – Alexander Pushkin, Russian poet and author (b. 1799)\n*1857 – David Thompson, English-Canadian surveyor and explorer (b. 1770)\n*1865 – Heinrich Lenz, Estonian-Italian physicist and academic (b. 1804) \n*1879 – Honoré Daumier, French illustrator and painter (b. 1808)\n*1887 – Ellen Wood, English author (b. 1814)\n*1891 – Sofia Kovalevskaya, Russian-Swedish mathematician and physicist (b. 1850)\n*1904 – John A. Roche, American lawyer and politician, 30th Mayor of Chicago (b. 1844)\n*1906 – Ezra Butler Eddy, American-Canadian businessman and politician (b. 1827)\n*1912 – Joseph Lister, 1st Baron Lister, English surgeon and academic (b. 1827)\n*1913 – Konstantinos Tsiklitiras, Greek long jumper (b. 1888)\n*1917 – John William Waterhouse, English soldier and painter (b. 1849)\n*1918 – Abdul Hamid II Ottoman sultan (b. 1842)\n*  1918   – Ernesto Teodoro Moneta, Italian soldier and journalist, Nobel Prize laureate (b. 1833)\n*1920 – Henry Strangways, English-Australian politician, 12th Premier of South Australia (b. 1832)\n*1923 – Wilhelm Röntgen, German physicist and academic, Nobel Prize laureate (b. 1845)\n*1928 – José Sánchez del Río, Mexican martyr and saint (b. 1913)\n*1932 – Edgar Wallace, English author and screenwriter (b. 1875)\n*1939 – Pope Pius XI (b. 1857)\n*1944 – E. M. Antoniadi, Greek-French astronomer and chess player (b. 1870)\n*1945 – Anacleto Díaz, Filipino lawyer and jurist (b. 1878)\n*1950 – Marcel Mauss, French sociologist and anthropologist (b. 1872)\n*1956 – Leonora Speyer, American poet and violinist (b. 1872)\n*  1956   – Emmanouil Tsouderos, Greek banker and politician, 132nd Prime Minister of Greece (b. 1882)\n*1957 – Laura Ingalls Wilder, American author (b. 1867)\n*1960 – Aloysius Stepinac, Croatian cardinal (b. 1898)\n*1966 – Billy Rose, American composer and songwriter (b. 1899)\n*1967 – Dionysios Kokkinos, Greek historian and author (b. 1884)\n*1975 – Nikos Kavvadias, Greek sailor and poet (b. 1910)\n*1979 – Edvard Kardelj, Slovene general and politician, 2nd Foreign Minister of Yugoslavia (b. 1910)\n*1992 – Alex Haley, American soldier, journalist, and author (b. 1921)\n*1993 – Fred Hollows, New Zealand-Australian ophthalmologist and academic (b. 1929)\n*1995 – Paul Monette, American author, poet, and activist (b. 1945)\n*1997 – Brian Connolly, Scottish musician, lead singer The Sweet (b. 1945)\n*2000 – Jim Varney, American actor, comedian and writer (b. 1949)\n*2001 – Abraham Beame, American academic and politician, 104th Mayor of New York City (b. 1906)\n*  2001   – Buddy Tate, American saxophonist and clarinet player (b. 1913)\n*2002 – Dave Van Ronk, American singer-songwriter and guitarist (b. 1936)\n*2003 – Edgar de Evia, Mexican-American photographer (b. 1910)\n*  2003   – Albert J. Ruffo, American lawyer and politician, Mayor of San Jose (b. 1908)\n*  2003   – Ron Ziegler, American politician, 14th White House Press Secretary (b. 1939)\n*2005 – Arthur Miller, American actor, playwright, and author (b. 1915)\n*2006 – James Yancey, American record producer and rapper (b. 1974)\n*2008 – Roy Scheider, American actor and boxer (b. 1932)\n*2010 – Fred Schaus, American basketball player and coach (b. 1925)\n*  2010   – Charles Wilson, American lieutenant and politician (b. 1933)\n*2011 – Trevor Bailey, English cricketer and journalist (b. 1923)\n*2012 – Lloyd Morrison, New Zealand banker and businessman, founded H. R. L. Morrison & Co (b. 1957)\n*  2012   – Jeffrey Zaslow, American journalist and author (b. 1958)\t\n*2013 – W. Watts Biggers, American author, screenwriter, and animator (b. 1927)\t\n*  2013   – David Hartman, American-Israeli rabbi and philosopher, founded the Shalom Hartman Institute (b. 1931)\t\n*2014 – Stuart Hall, Jamaican-English sociologist and theorist (b. 1932)\n*  2014   – Shirley Temple, American actress and diplomat (b. 1928)\n*2015 – Naseer Aruri, Palestinian scholar and activist (b. 1934)\n*  2015   – Karl Josef Becker, German cardinal and theologian (b. 1928)\n*  2015   – Deng Liqun, Chinese theorist and politician (b. 1915)\n*2016 – Fatima Surayya Bajia, Indian-Pakistani author and playwright (b. 1930)  \n*2017   – Mike Ilitch, American businessman (b. 1929)\n\nHolidays and observances\n\n*Christian feast day:\n**Austrebertha\n**Charalambos\n**José Sánchez del Río\n**Scholastica\n**February 10 (Eastern Orthodox liturgics)\n*Feast of St. Paul's Shipwreck (Malta)\n*Fenkil Day (Eritrea)\n*Kurdish Authors Union Day (Iraqi Kurdistan)\n*National Memorial Day of the Exiles and Foibe (Italy). February 10. http://en.wikipedia.org/?curid=10991."
  }
}
