{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17125",
  "eid" : "2aa76570-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580807,
  "textBody" : "The Kerguelen Islands ( or;, respectively  or . in French commonly ' but officially ',), also known as the Desolation Islands (' in French), are a group of islands in the southern Indian Ocean constituting one of the two exposed parts of the mostly submerged Kerguelen Plateau. They are among the most isolated places on Earth, located  northwest of the uninhabited Heard Island and McDonald Islands and more than  from Madagascar, the nearest populated location (excluding the Alfred Faure scientific station in Île de la Possession, about  from there, and the non-permanent station located in Île Amsterdam,  away). The islands, along with Adélie Land, the Crozet Islands, Amsterdam, and Saint Paul Islands, and France's Scattered Islands in the Indian Ocean are part of the French Southern and Antarctic Lands and are administered as a separate district.\n\nThe main island, Grande Terre, is  in area and is surrounded by a further 300 smaller islands and islets,  forming an archipelago of . The climate is raw and chilly with frequent high winds throughout the year. The surrounding seas are generally rough and they remain ice-free year-round. There are no indigenous inhabitants, but France maintains a permanent presence of 45 to 100 scientists, engineers and researchers.[http://www.oceandocs.org/bitstream/1834/993/1/Comoros.pdf Sea Level Measurement and Analysis in the Western Indian Ocean], UNESCO Intergovernmental Oceanographic Commission There are no airports on the islands, so all travel and transport from the outside world is conducted by ship.\n\nHistory \n\nKerguelen Islands appear as the \"Ile de Nachtegal\" on Philippe Buache's map from 1754 before the island was officially discovered in 1772. The Buache map has the title Carte des Terres Australes comprises entre le Tropique du Capricorne et le Pôle Antarctique où se voyent les nouvelles découvertes faites en 1739 au Sud du Cap de Bonne Esperance ('Map of the Southern Lands contained between the Tropic of Capricorn and the Antarctic Pole, where the new discoveries made in 1739 to the south of the Cape of Good Hope may be seen'). It is possible this early name was after Abel Tasman's ship \"De Zeeuwsche Nachtegaal.\" On the Buache map, \"Ile de Nachtegal\" is located at 43°S, 72°E, about 6 degrees north and 2 degrees east of the accepted location of Grande Terre.\n\nThe islands were officially discovered by the French navigator Yves-Joseph de Kerguelen-Trémarec on 12 February 1772. The next day Charles de Boisguehenneuc landed and claimed the island for the French crown. Yves de Kerguelen organised a second expedition in 1773 and arrived at the \"baie de l'Oiseau\" by December of the same year. On 6 January 1774 he commanded his lieutenant, Henri Pascal de Rochegude, to leave a message notifying any passers-by of the two passages and of the French claim to the islands.[https://books.google.com/books?id\nh6UFAAAAMAAJ&pgPA149&dq\n%22christmas+harbour%22+rochegude&hlfr&sa\nX&eiSJpGUvumJM7W4ATm14GoAQ&ved\n0CDkQ6AEwAQ#vonepage&q\n%22christmas%20harbour%22%20rochegude&ffalse The Three Voyages of Captain James Cook Round the World], volume 5, James Cook, pub. Longman, Hurst, Rees, Orme, et Brown, Londres, 1821, pp. 146–151. Thereafter, a number of expeditions briefly visited the islands, including that of Captain James Cook in December 1776 during his third voyage, who verified and confirmed the passage of de Kerguelen by discovering and annotating the message left by the French navigator.\n\nSoon after their discovery, the archipelago was regularly visited by whalers and sealers (mostly British, American and Norwegian) who hunted the resident populations of whales and seals to the point of near extinction, including fur seals in the 18th century and elephant seals in the 19th century. Since the end of the whaling and sealing era, most of the islands' species have been able to increase their population again.[https://books.google.com/books?id\ndaY_utPoJGAC&lpgPA266&ots\n5G6Y51ADaZ&dqkerguelen%20whale%20population&pg\nPA266#vonepage&q\nkerguelen%20whale%20population&f=false Whales, whaling, and ocean ecosystems], James A. Estes\n\nIn 1800,  spent eight months sealing and whaling around the islands. During this time Captain Robert Rhodes, her master, prepared a chart of the islands.Clayton, Jane M. (2014) Ships employed in the South Sea Whale Fishery from Britain: 1775–1815: An alphabetical list of ships. (Berforts Group), p.141. \n\nIn 1825, the British sealer John Nunn and three crew members from Favourite,  were shipwrecked on Kerguelen until they were rescued in 1827 by Captain Alexander Distant during his hunting campaign.\n\nThe islands were not completely surveyed until the Ross expedition of 1840.\n\nFor the 1874 transit of Venus, George Biddell Airy at the Royal Observatory of the UK organised and equipped five expeditions to different parts of the world. Three of these were sent to the Kerguelen Islands. The Reverend Stephen Joseph Perry led the British expeditions to the Kerguelen Islands. He set up his main observation station at Observatory Bay and two auxiliary stations, one at Thumb Peak () led by Sommerville Goodridge, and the second at Supply Bay () led by Cyril Corbet. Observatory Bay was also used by the German Antarctic Expedition led by Erich Dagobert von Drygalski in 1902–03. In January 2007, an archaeological excavation of this site was carried out.\n\nIn 1874–1875, British, German and U.S. expeditions visited Kerguelen to observe the transit of Venus.[https://books.google.com/books?idPYdBH4dOOM4C&pg\nPA346 Exploring Polar Frontiers, p. 346], William James Mills, 2003\n\nIn 1877 the French started a coal mining operation; however, this was abandoned soon after.\n\nThe Kerguelen Islands, along with the islands of Amsterdam and St Paul, and the Crozet archipelago were officially annexed by France in 1893, and were included as possessions in the French constitution in 1924 (in addition to that portion of Antarctica claimed by France and known as Adélie Land; as with all Antarctic territorial claims, France's possession on the continent is held in abeyance until a new international treaty is ratified that defines each claimant's rights and obligations).\n\nThe German auxiliary cruiser Atlantis called at Kerguelen during December 1940. During their stay the crew performed maintenance and replenished their water supplies. This ship's first fatality of the war occurred when a sailor, Bernhard Herrmann, fell while painting the funnel. He is buried in what is sometimes referred to as \"the most southerly German war grave\" of World War II.\n\nKerguelen has been continually occupied since 1950 by scientific research teams, with a population of 50 to 100 frequently present. There is also a French satellite tracking station.\n\nUntil 1955, the Kerguelen Islands were administrative-wise part of the French Colony of Madagascar and Dependencies. That same year they collectively became known as ' (French Southern and Antarctic Lands) and were administratively part of the French '. In 2004 they were permanently transformed into their own entity (keeping the same name) but having inherited another group of five very remote tropical islands, Scattered islands in the Indian Ocean|, which are also owned by France and are dispersed widely throughout the southern Indian Ocean.\n\nGrande Terre\n\nThe main island of the archipelago is called '. It measures 150 km east to west and 120 km north to south.\n\nPort-aux-Français, a scientific base, is along the eastern shore of the Gulf of Morbihan on La Grande Terre at . Facilities there include scientific-research buildings, a satellite tracking station, dormitories, a hospital, a library, a gymnasium, a pub, and the chapel of Notre-Dame des Vents.\n\nThe highest point is Mont Ross in the Gallieni Massif, which rises along the southern coast of the island and has an elevation of 1850 m. The Cook Ice Cap (), France's largest glacier with an area of about 403 km², lies on the west-central part of the island. Overall, the glaciers of the Kerguelen Islands cover just over 500 km². Grande Terre has also numerous bays, inlets, fjords, and coves, as well as several peninsulas and promontories. The most important ones are listed below:\n\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nNotable localities\n\nThere are also a number of notable localities, all on La Grande Terre (see also the main map):\n\n* Anse Betsy [Betsy Cove] (a former geomagnetic station at ), on Baie Accessible [Accessible Bay], on the north coast of the Courbet Peninsula. On this site an astronomical and geomagnetic observatory was erected on 26 October 1874 by a German research expedition led by Georg Gustav Freiherr von Schleinitz. The primary goal of this station was the 1874 observation of the transit of Venus.\n* Armor (Base Armor), established in 1983, is located 40 km west of Port-aux-Français at the bottom of Morbihan Gulf, for the acclimatization of salmon to the Kerguelen islands.\n* Baie de l'Observatoire [Observatory Bay] (a former geomagnetic observation station at ), just west of Port-Aux-Français, on the eastern fringe of the Central Plateau, along the northern shore of the Golfe du Morbihan.\n* Cabane Port-Raymond (scientific camp at ), at the head of a fjord cutting into the Courbet Peninsula from the south.\n* Cap Ratmanoff (geomagnetic station at ), the eastmost point of the Kerguelens.\n* La Montjoie (scientific camp at ), on the south shore of Baie Rocheuse, along the northwestern coast of the archipelago.\n* Molloy (Pointe Molloy), a former observatory ten kilometers west of the present-day Port-Aux-Français, along the south coast of the Courbet Peninsula, or northern shore of the Golfe du Morbihan (Kerguelen), at . An American expedition led by G. P. Ryan erected a station at this site on 7 September 1874. That station was also established to observe the 1874 transit of Venus.\n* Port Bizet (seismographic station at ), on the northeastern coast of Île Longue. This also serves as the principal sheep farm for the island's resident flock of Bizet sheep.\n* Port Christmas (a former geomagnetic station at ), on Baie de l'Oiseau, in the extreme northwest of the Loranchet Peninsula. This place was so named by Captain James Cook, who re-discovered the islands and who anchored there on Christmas Day, 1776. This is also the place where Captain Cook coined the name \"Desolation Islands\" in reference to what he saw as a sterile landscape.\n* Port Couvreux (a former whaling station, experimental sheep farm, and geomagnetic station, at ), on Baie du Hillsborough, on the southeast coast of Presqu'île Bouquet de la Grye. Starting in 1912, sheep were raised here to create an economic base for future settlement.  However, the attempt failed and the last inhabitants had to be evacuated, and the station abandoned, in 1931. The huts remain, as well as a graveyard with five anonymous graves. These are those of the settlers who were unable to survive in the harsh environment.\n* Port Curieuse (a harbor on the west coast across Île de l'Ouest ). The site was named after the ship La Curieuse, which was used by Raymond Rallier du Baty on his second visit to the islands (1913–14).\n* Port Douzième (literally Twelfth Port, a hut and former geomagnetic station at ), on the north coast of Presqu'île Ronarch, southern shore of the Golfe du Morbihan.\n* Port Jeanne d'Arc (a former whaling station founded by a Norwegian whaling company in 1908, and a former geomagnetic station at ), in the northwestern corner of Presqu'île Jeanne d'Arc, looking across the Buenos Aires passage to Île Longue (4 km northeast). The derelict settlement consists of four residential buildings with wooden walls and tin roofs, and a barn. One of the buildings was restored in 1977, and another in 2007.\n\nFrom 1968 to 1981,  just east of Port-aux-Français was a launching site for sounding rockets, some for French (Dragon rockets), American (Arcas) or French-Soviet (Eridans) surveys, but at the end mainly for a Soviet program (M-100). [http://fuseurop.univ-perp.fr/b_tmp_f.htm bases temporaires de lancements de fusées] It is understood the islands have received the attention of the French military.\n\nIslands\n\nThe following is a list of the most important adjacent islands:\n\n* Île Foch in the north of the archipelago, at",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kerguelen Islands" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17125" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Kerguelen Islands ( or;, respectively  or . in French commonly ' but officially ',), also known as the Desolation Islands (' in French), are a group of islands in the southern Indian Ocean constituting one of the two exposed parts of the mostly submerged Kerguelen Plateau. They are among the most isolated places on Earth, located  northwest of the uninhabited Heard Island and McDonald Islands and more than  from Madagascar, the nearest populated location (excluding the Alfred Faure scientific station in Île de la Possession, about  from there, and the non-permanent station located in Île Amsterdam,  away). The islands, along with Adélie Land, the Crozet Islands, Amsterdam, and Saint Paul Islands, and France's Scattered Islands in the Indian Ocean are part of the French Southern and Antarctic Lands and are administered as a separate district.\n\nThe main island, Grande Terre, is  in area and is surrounded by a further 300 smaller islands and islets,  forming an archipelago of . The climate is raw and chilly with frequent high winds throughout the year. The surrounding seas are generally rough and they remain ice-free year-round. There are no indigenous inhabitants, but France maintains a permanent presence of 45 to 100 scientists, engineers and researchers.[http://www.oceandocs.org/bitstream/1834/993/1/Comoros.pdf Sea Level Measurement and Analysis in the Western Indian Ocean], UNESCO Intergovernmental Oceanographic Commission There are no airports on the islands, so all travel and transport from the outside world is conducted by ship.\n\nHistory \n\nKerguelen Islands appear as the \"Ile de Nachtegal\" on Philippe Buache's map from 1754 before the island was officially discovered in 1772. The Buache map has the title Carte des Terres Australes comprises entre le Tropique du Capricorne et le Pôle Antarctique où se voyent les nouvelles découvertes faites en 1739 au Sud du Cap de Bonne Esperance ('Map of the Southern Lands contained between the Tropic of Capricorn and the Antarctic Pole, where the new discoveries made in 1739 to the south of the Cape of Good Hope may be seen'). It is possible this early name was after Abel Tasman's ship \"De Zeeuwsche Nachtegaal.\" On the Buache map, \"Ile de Nachtegal\" is located at 43°S, 72°E, about 6 degrees north and 2 degrees east of the accepted location of Grande Terre.\n\nThe islands were officially discovered by the French navigator Yves-Joseph de Kerguelen-Trémarec on 12 February 1772. The next day Charles de Boisguehenneuc landed and claimed the island for the French crown. Yves de Kerguelen organised a second expedition in 1773 and arrived at the \"baie de l'Oiseau\" by December of the same year. On 6 January 1774 he commanded his lieutenant, Henri Pascal de Rochegude, to leave a message notifying any passers-by of the two passages and of the French claim to the islands.[https://books.google.com/books?id\nh6UFAAAAMAAJ&pgPA149&dq\n%22christmas+harbour%22+rochegude&hlfr&sa\nX&eiSJpGUvumJM7W4ATm14GoAQ&ved\n0CDkQ6AEwAQ#vonepage&q\n%22christmas%20harbour%22%20rochegude&ffalse The Three Voyages of Captain James Cook Round the World], volume 5, James Cook, pub. Longman, Hurst, Rees, Orme, et Brown, Londres, 1821, pp. 146–151. Thereafter, a number of expeditions briefly visited the islands, including that of Captain James Cook in December 1776 during his third voyage, who verified and confirmed the passage of de Kerguelen by discovering and annotating the message left by the French navigator.\n\nSoon after their discovery, the archipelago was regularly visited by whalers and sealers (mostly British, American and Norwegian) who hunted the resident populations of whales and seals to the point of near extinction, including fur seals in the 18th century and elephant seals in the 19th century. Since the end of the whaling and sealing era, most of the islands' species have been able to increase their population again.[https://books.google.com/books?id\ndaY_utPoJGAC&lpgPA266&ots\n5G6Y51ADaZ&dqkerguelen%20whale%20population&pg\nPA266#vonepage&q\nkerguelen%20whale%20population&f=false Whales, whaling, and ocean ecosystems], James A. Estes\n\nIn 1800,  spent eight months sealing and whaling around the islands. During this time Captain Robert Rhodes, her master, prepared a chart of the islands.Clayton, Jane M. (2014) Ships employed in the South Sea Whale Fishery from Britain: 1775–1815: An alphabetical list of ships. (Berforts Group), p.141. \n\nIn 1825, the British sealer John Nunn and three crew members from Favourite,  were shipwrecked on Kerguelen until they were rescued in 1827 by Captain Alexander Distant during his hunting campaign.\n\nThe islands were not completely surveyed until the Ross expedition of 1840.\n\nFor the 1874 transit of Venus, George Biddell Airy at the Royal Observatory of the UK organised and equipped five expeditions to different parts of the world. Three of these were sent to the Kerguelen Islands. The Reverend Stephen Joseph Perry led the British expeditions to the Kerguelen Islands. He set up his main observation station at Observatory Bay and two auxiliary stations, one at Thumb Peak () led by Sommerville Goodridge, and the second at Supply Bay () led by Cyril Corbet. Observatory Bay was also used by the German Antarctic Expedition led by Erich Dagobert von Drygalski in 1902–03. In January 2007, an archaeological excavation of this site was carried out.\n\nIn 1874–1875, British, German and U.S. expeditions visited Kerguelen to observe the transit of Venus.[https://books.google.com/books?idPYdBH4dOOM4C&pg\nPA346 Exploring Polar Frontiers, p. 346], William James Mills, 2003\n\nIn 1877 the French started a coal mining operation; however, this was abandoned soon after.\n\nThe Kerguelen Islands, along with the islands of Amsterdam and St Paul, and the Crozet archipelago were officially annexed by France in 1893, and were included as possessions in the French constitution in 1924 (in addition to that portion of Antarctica claimed by France and known as Adélie Land; as with all Antarctic territorial claims, France's possession on the continent is held in abeyance until a new international treaty is ratified that defines each claimant's rights and obligations).\n\nThe German auxiliary cruiser Atlantis called at Kerguelen during December 1940. During their stay the crew performed maintenance and replenished their water supplies. This ship's first fatality of the war occurred when a sailor, Bernhard Herrmann, fell while painting the funnel. He is buried in what is sometimes referred to as \"the most southerly German war grave\" of World War II.\n\nKerguelen has been continually occupied since 1950 by scientific research teams, with a population of 50 to 100 frequently present. There is also a French satellite tracking station.\n\nUntil 1955, the Kerguelen Islands were administrative-wise part of the French Colony of Madagascar and Dependencies. That same year they collectively became known as ' (French Southern and Antarctic Lands) and were administratively part of the French '. In 2004 they were permanently transformed into their own entity (keeping the same name) but having inherited another group of five very remote tropical islands, Scattered islands in the Indian Ocean|, which are also owned by France and are dispersed widely throughout the southern Indian Ocean.\n\nGrande Terre\n\nThe main island of the archipelago is called '. It measures 150 km east to west and 120 km north to south.\n\nPort-aux-Français, a scientific base, is along the eastern shore of the Gulf of Morbihan on La Grande Terre at . Facilities there include scientific-research buildings, a satellite tracking station, dormitories, a hospital, a library, a gymnasium, a pub, and the chapel of Notre-Dame des Vents.\n\nThe highest point is Mont Ross in the Gallieni Massif, which rises along the southern coast of the island and has an elevation of 1850 m. The Cook Ice Cap (), France's largest glacier with an area of about 403 km², lies on the west-central part of the island. Overall, the glaciers of the Kerguelen Islands cover just over 500 km². Grande Terre has also numerous bays, inlets, fjords, and coves, as well as several peninsulas and promontories. The most important ones are listed below:\n\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nNotable localities\n\nThere are also a number of notable localities, all on La Grande Terre (see also the main map):\n\n* Anse Betsy [Betsy Cove] (a former geomagnetic station at ), on Baie Accessible [Accessible Bay], on the north coast of the Courbet Peninsula. On this site an astronomical and geomagnetic observatory was erected on 26 October 1874 by a German research expedition led by Georg Gustav Freiherr von Schleinitz. The primary goal of this station was the 1874 observation of the transit of Venus.\n* Armor (Base Armor), established in 1983, is located 40 km west of Port-aux-Français at the bottom of Morbihan Gulf, for the acclimatization of salmon to the Kerguelen islands.\n* Baie de l'Observatoire [Observatory Bay] (a former geomagnetic observation station at ), just west of Port-Aux-Français, on the eastern fringe of the Central Plateau, along the northern shore of the Golfe du Morbihan.\n* Cabane Port-Raymond (scientific camp at ), at the head of a fjord cutting into the Courbet Peninsula from the south.\n* Cap Ratmanoff (geomagnetic station at ), the eastmost point of the Kerguelens.\n* La Montjoie (scientific camp at ), on the south shore of Baie Rocheuse, along the northwestern coast of the archipelago.\n* Molloy (Pointe Molloy), a former observatory ten kilometers west of the present-day Port-Aux-Français, along the south coast of the Courbet Peninsula, or northern shore of the Golfe du Morbihan (Kerguelen), at . An American expedition led by G. P. Ryan erected a station at this site on 7 September 1874. That station was also established to observe the 1874 transit of Venus.\n* Port Bizet (seismographic station at ), on the northeastern coast of Île Longue. This also serves as the principal sheep farm for the island's resident flock of Bizet sheep.\n* Port Christmas (a former geomagnetic station at ), on Baie de l'Oiseau, in the extreme northwest of the Loranchet Peninsula. This place was so named by Captain James Cook, who re-discovered the islands and who anchored there on Christmas Day, 1776. This is also the place where Captain Cook coined the name \"Desolation Islands\" in reference to what he saw as a sterile landscape.\n* Port Couvreux (a former whaling station, experimental sheep farm, and geomagnetic station, at ), on Baie du Hillsborough, on the southeast coast of Presqu'île Bouquet de la Grye. Starting in 1912, sheep were raised here to create an economic base for future settlement.  However, the attempt failed and the last inhabitants had to be evacuated, and the station abandoned, in 1931. The huts remain, as well as a graveyard with five anonymous graves. These are those of the settlers who were unable to survive in the harsh environment.\n* Port Curieuse (a harbor on the west coast across Île de l'Ouest ). The site was named after the ship La Curieuse, which was used by Raymond Rallier du Baty on his second visit to the islands (1913–14).\n* Port Douzième (literally Twelfth Port, a hut and former geomagnetic station at ), on the north coast of Presqu'île Ronarch, southern shore of the Golfe du Morbihan.\n* Port Jeanne d'Arc (a former whaling station founded by a Norwegian whaling company in 1908, and a former geomagnetic station at ), in the northwestern corner of Presqu'île Jeanne d'Arc, looking across the Buenos Aires passage to Île Longue (4 km northeast). The derelict settlement consists of four residential buildings with wooden walls and tin roofs, and a barn. One of the buildings was restored in 1977, and another in 2007.\n\nFrom 1968 to 1981,  just east of Port-aux-Français was a launching site for sounding rockets, some for French (Dragon rockets), American (Arcas) or French-Soviet (Eridans) surveys, but at the end mainly for a Soviet program (M-100). [http://fuseurop.univ-perp.fr/b_tmp_f.htm bases temporaires de lancements de fusées] It is understood the islands have received the attention of the French military.\n\nIslands\n\nThe following is a list of the most important adjacent islands:\n\n* Île Foch in the north of the archipelago, at. Kerguelen Islands. http://en.wikipedia.org/?curid=17125."
  }
}
