{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17330",
  "eid" : "2b6b9fd0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778582093,
  "textBody" : "The King's Royal Rifle Corps was an infantry rifle regiment of the British Army that was originally raised in British North America as the Royal American Regiment (also known as the Royal Americans) in the Seven Years' War and for Loyalist service in the American Revolutionary War. Later, ranked as the 60th Regiment of Foot, the regiment served for more than 200 years throughout the British Empire. In 1958, the regiment joined the Oxfordshire and Buckinghamshire Light Infantry and the Rifle Brigade in the Green Jackets Brigade and in 1966 the three regiments were formally amalgamated to become the Royal Green Jackets. The KRRC became the 2nd Battalion Royal Green Jackets. On the disbandment of 1/RGJ in 1992, the RGJ's KRRC battalion was redesignated as 1/RGJ, eventually becoming 2/RIFLES in 2007.\n\nHistory\n\nFrench and Indian War\n\nThe King's Royal Rifle Corps was raised in the American colonies in 1756 as the 62nd (Royal American) Regiment to defend the thirteen colonies against attack by the French and their Native American allies. After Braddock's defeat in 1755, royal approval for a new regiment, as well as funds, were granted by parliament just before Christmas 1755 – hence the regiment's traditional birthday of Christmas Day. However, parliamentary delays meant that it was 4 March 1756 before a special act of parliament created four battalions of 1,000 men each to include foreigners for service in the Americas.Cusick, p. 44\n\nA regimental history compiled in 1879 by a captain in the Kings Royal Rifle Corps, states that, in November 1755, Parliament voted the sum of £81,000 for the purpose of raising a regiment of four battalions, each one thousand strong, for service in British North America. Parliament approved “An Act to enable His Majesty to grant commissions to a certain number of foreign Protestants, who have served abroad as officers or engineers, to act and rank as officers or engineers in America only under certain restrictions and regulations.” The Earl of Loudoun, who as commander-in-chief of the Forces in North America, was appointed colonel-in-chief of the regiment. About fifty officers’ commissions were given to Germans and Swiss, and none were allowed to rise above the rank of lieutenant-colonel.Wallace, Captain Nesbit Willoughby, p. 1\n\nAccording to a modern history of the regiment, the idea for creating this unique force was proposed by Jacques Prevost, a Swiss soldier and adventurer who was a friend of the Duke of Cumberland (the Duke was the King's second son and also Commander-in-Chief of the Forces). Prevost recognised the need for soldiers who understood forest warfare, unlike the regulars who were brought to America in 1755 by General Edward Braddock.\n\nThe regiment was intended to combine the characteristics of a colonial corps with those of a foreign legion. Swiss and German forest fighting experts, American colonists and British volunteers from other British regiments were recruited. These men were Protestants, an important consideration for fighting against the predominantly Catholic French. The officers were also recruited from Europe – not from the American colonies – and consisted of English, Scots, Irish, Dutch, Swiss and Germans. It was the first time foreign officers were commissioned as British Army officers. In total, the regiment consisted of 101 officers, 240 non-commissioned officers and 4,160 enlisted men. The battalions were raised on Governors Island, New York. The regiment was renumbered the 60th (Royal American) Regiment in February 1757 when the 50th (Shirley's) and 51st (Pepperrell's) foot regiments were removed from the British Army roll after their surrender at Fort Oswego.\n\nAmong the distinguished foreign officers given commissions in the 60th (Royal Americans) was Henry Bouquet, a Swiss citizen, whose ideas on tactics, training and man-management (including the unofficial introduction of the rifle and 'battle-dress') would become universal in the British Army some 150 years later. Bouquet was commanding officer of the 1st battalion, and with his fellow battalion commanders, set about creating units that were better suited to warfare in the forests and lakes of northeast America.\n\nThe new regiment fought at Louisbourg in June 1758, the Cape Sable Campaign in September 1758 and Quebec in September 1759 in the campaign which finally wrested Canada from France; at Quebec it won from General James Wolfe the motto  (Swift and Bold). These were conventional battles on the European model, but fighting during Pontiac's War in 1763 was of a very different character. The frontier war threatened the British control of North America. The new regiment at first lost several outlying garrisons such as Fort Michilimackinac, but finally proved its mastery of forest warfare under Bouquet's leadership at the victory of Bushy Run in August 1763.\n\nThe 60th was uniformed and equipped in a similar manner to other British regiments with red coats and cocked hats or grenadier caps, but on campaign, swords were replaced with hatchets, and coats and hats cut down for ease of movement in the woods.\n\nAmerican Revolutionary War\n\nTwo additional battalions of the regiment (the 3rd and 4th battalions) were raised in England in 1775, principally of men recruited from England and Hanover in 1775 for service in the American Revolutionary War.  After assembly in the Isle of Wight, both battalions were sent in 1776 to Florida where they were joined by detachments from 1st and 2nd Battalions.\nThese battalions were deployed to Georgia and were involved in skirmishes at Sudbury in January 1779, the Battle of Briar Creek in March 1779, the Siege of Savannah in October 1779 where elements from the 4th Battalion captured the Colour of the 2nd South Carolina Regiment, and at Augusta in September 1780. The 3rd and 4th battalions were disbanded in June 1783.\n\nNapoleonic Wars\n\nDuring the Napoleonic Wars, the regiment saw action in the Peninsular War. The first four battalions had been raised as regular line battalions, but in 1797 a 5th battalion had been raised at Cowes on the Isle of Wight and equipped entirely with the Baker rifle, and wore green jackets with red facings. The mixing of rifle troops and muskets proved so effective that eventually line battalion light companies were replaced with rifle companies. The line battalions found themselves in several different theatres, including the West Indies. The rifle battalion was soon joined by a second, and these found themselves in the Peninsula with Wellington's army, serving along with the 95th Rifles, and the King's German Legion rifle units. A 7th battalion was eventually raised as a rifle battalion specifically for service in the American War of 1812.\n\nAnglo-Egyptian War and Second Boer War\n\nAfter the Napoleonic Wars, the regiment received a new title: first, in 1815, its name was changed to The Duke of York's Own Rifle Corps and then, in 1830, to the King's Royal Rifle Corps (KRRC). In 1858, the Rifle Depot at Winchester was made their headquarters. The regiment served in the Anglo-Egyptian War in 1882. During the rest of the 1800s, the unit also was active in China, Canada (Wolseley expedition), Afghanistan, India, Burma and South Africa. The regiment was deployed during the Second Boer War from the outset playing a key role in the first battle at Talana Hill. Two officers from the regiment were awarded the Victoria Cross; Lieutenant Frederick Hugh Sherston Roberts and Lieutenant Llewelyn Alberic Emilius Price-Davies. Private Frederick Corbett also received the Victoria Cross for his action at Kafr Dowar, Egypt, on 5 August 1882; his VC was later rescinded when he was convicted of embezzlement, theft, and being absent without leave.\n\nIn 1908, the Volunteers and Militia were reorganised nationally, with the former becoming the Territorial Force and the latter the Special Reserve; the regiment now had two Reserve but no Territorial battalions.These were the 5th Battalion (Special Reserve) and the 6th Battalion (Special Reserve)\n\nFirst World War\n\nRegular Army\n\nThe 1st Battalion landed at Rouen as part of the 6th Brigade in the 2nd Division in August 1914 for service on the Western Front and saw action at the Battle of Mons in August 1914, the First Battle of the Marne in September 1914, the First Battle of the Aisne in September 1914 and First Battle of Ypres in October 1914 as well as the Battle of Festubert in May 1915, the Battle of Loos in September 1915 and the Battle of the Somme in Autumn 1916 before taking part in the advance to the Hindenburg Line, the Battle of Arras in November 1917, the Battle of Cambrai in November 1917, the Second Battle of the Somme in Autumn 1918 and the Battle of the Selle in October 1918. The war ended a month later with the signing of the Armistice of 11 November 1918.\n\nThe 2nd Battalion landed at Le Havre as part of the 2nd Brigade in the 1st Division in August 1914 for service on the Western Front and saw action at the Battle of Aubers Ridge in May 1915.\n\nThe 3rd Battalion landed at Le Havre as part of the 80th Brigade in the 27th Division in December 1914 for service on the Western Front and saw action at the Second Battle of Ypres in April 1915.\n\nThe 4th Battalion landed at Le Havre as part of the 80th Brigade in the 27th Division in December 1914 for service on the Western Front and saw action at the Second Battle of Ypres in April 1915 but moved to Salonika in November 1915 before returning to France in June 1918.\n\nTerritorial Force\n\nThe regiment did not have any territorial force battalions.\n\nNew Armies\n\nThe 7th (Service) Battalion landed at Boulogne-sur-Mer as part of the 41st Brigade in the 14th (Light) Division in August 1914 for service on the Western Front and saw action the Second Battle of Ypres in May 1915, the Battle of Delville Wood in July 1916 and the Battle of Flers–Courcelette in September 1916 as well as the advance to the Hindenburg Line, the Battle of Arras in April 1917, the Battle of Langemark in August 1917, the First Battle of Passchendaele in October 1917 and the Second Battle of Passchendaele in November 1917 before taking part in the Battle of St Quentin in March 1918 and the Battle of the Avre in April 1918.\n\nThe 8th (Service) Battalion landed at Boulogne-sur-Mer as part of the 41st Brigade in the 14th (Light) Division in May 1915 for service on the Western Front and saw action most of the same battles as the 7th Battalion. The 9th (Service) Battalion landed at Boulogne-sur-Mer as part of the 42nd Brigade in the 14th (Light) Division in May 1915 for service on the Western Front and saw action most of the same battles as the 7th and 8th battalions.\n\nThe 10th (Service) Battalion and 11th (Service) Battalion landed at Boulogne-sur-Mer as part of the 59th Brigade in the 20th (Light) Division in July 1915 for service on the Western Front and saw action at the Battle of Mont Sorrel in June 1916, the Battle of Delville Wood in July 1916 and the Battle of Guillemont in September 1916 as well as the Battle of Flers–Courcelette in September 1916, the Battle of Morval in September 1916 and the Battle of Le Transloy in October 1916 before taking part in the advance to the Hindenburg Line, the Battle of Langemarck in August 1917, the Battle of the Menin Road Ridge in September 1917, the Battle of Polygon Wood in September 1917 and the Battle of Cambrai in November 1917.\n\nThe 12th (Service) Battalion landed at Boulogne-sur-Mer as part of the 60th Brigade in the 20th (Light) Division in July 1915 for service on the Western Front and saw action most of the same battles as the 10th and 11th Battalions. The 13th (Service) Battalion landed at Boulogne-sur-Mer as part of the 111th Brigade in the 37th Division in July 1915 for service on the Western Front and saw action at the Battle of Morval in September 1916, the advance to the Hindenburg Line and the Battle of Arras in April 1917 as well as the Battle of Passchendaele in Autumn 1917, the Battle of Cambrai in November 1917 and the Hundred Days Offensive in Autumn 1918 before taking part in the Battles of the Hindenburg Line and the Final Advance in Picardy.\n\nThe 16th (Service) Battalion (Church Lads Brigade) landed at Le Havre as part of the 100th Brigade in the 33rd Division in November 1915 for service on the Western Front. \n\nThe 17th (Service) Battalion (British Empire League) landed at Le Havre as part of the 117th Brigade in the 39th Division in March 1916 for service on the Western Front. \n\nThe 18th (Service) Battalion (Arts & Crafts) landed at Le Havre as part of the 122nd Brigade in the 41st Division in March 1916 for service on the Western Front.\n\nThe 20th (Service) Battalion (British Empire League Pioneers) landed at Le Havre as pioneer battalion for the 3rd Division in March 1916 for service on the Western Front. The 21st (Service) Battalion (Yeoman Rifles) landed in France as part of the 124th Brigade in the 41st Division in May 1916 for service on the Western Front but moved to Italy in November 1917 before returning to France in March 1918.\n\nSeven members of the regiment received the Victoria Cross.\n\nInter-war years\n\nAfter 1918, the unit returned to garrison duties in India, Palestine and Ireland. In 1922, the regiment was reduced from four to two battalions with the third and fourth being disbanded. In 1926, the Regiment was reorganised as one of the first mechanised infantry regiments.\n\nSecond World War\n\nThe 1st Battalion, KRRC was deployed to North Africa and saw action as part of the pivot group within the 7th Armoured Division at the Battle of Sidi Rezegh in November 1941, the First Battle of El Alamein in July 1942 and the Second Battle of El Alamein in October 1942 during the Western Desert Campaign. Rifleman John Beeley was awarded a posthumous Victoria Cross for his actions during Operation Crusader in North Africa. It then served in Italy, initially in the 1st Armoured Division's 2nd Armoured Brigade, then with the independent 9th Armoured Brigade and finally the 6th Armoured Division's 61st Infantry Brigade.\n\nThe 2nd Battalion was part of the British Expeditionary Force (BEF) that landed in France in May 1940. The battalion, which was part of the 30th Infantry Brigade, 1st Armoured Division, was lost in the defence of Calais, where the brigade slowed the German advance and enabled the Dunkirk evacuation to proceed. The reformed battalion took part in the Battle of Gazala in May 1942 and the Second Battle of El Alamein in October 1942 during the North African Campaign. Following the Normandy landings in June 1944, the Battalion served in the 4th Armoured Brigade and in the subsequent campaign in North-West Europe\n\nThe 7th Battalion (The Queen Victoria's Rifles) was also part of the BEF; like the 2nd battalion, it was also part of the 30th Infantry Brigade and lost in the defence of Calais. The 9th Battalion (The Rangers) was deployed to the Mediterranean theatre as part of the 1st Armoured Brigade in the 7th Armoured Division. It saw action in the Greek campaign in April 1941 before being disbanded in August 1942.\n\nRoyal Green Jackets\n\nIn 1958 for administrative purposes, the KRRC was brigaded with the Oxfordshire and Buckinghamshire Light Infantry and the Rifle Brigade to form the Green Jackets Brigade. In 1958, the Regiment was re-titled the 2nd Green Jackets, the King's Royal Rifle Corps, while the two other regiments of the Green Jackets Brigade were re-titled the 1st Green Jackets (43rd and 52nd) and 3rd Green Jackets, the Rifle Brigade (Prince Consort's Own) respectively. In 1966, the three regiments were amalgamated to form the three battalions of the Royal Green Jackets.\n\nTerritorial Battalions\n\n*Queen Victoria's Rifles\n*The Rangers\n*The Queen's Westminsters\n\nIn the Second World War, the following territorial battalions were formally made part of the KRRC:\n*1st Battalion Queen Victoria's Rifles – 7th Battalion KRRC\n*2nd Battalion Queen Victoria's Rifles – 8th Battalion KRRC\n*1st Battalion The Rangers – 9th Battalion KRRC\n*2nd Battalion The Rangers – 10th Battalion KRRC\n*1st Battalion The Queen's Westminsters – 11th Battalion KRRC\n*2nd Battalion The Queen's Westminsters – 12th Battalion KRRC\n\nCadet Battalions\n\nThere were two cadet battalions: 1st Cadet Battalion, The King’s Royal Rifle Corps and Queen Victoria’s Rifles Cadet Corps (re-titled the 2nd Cadet Battalion, The King’s Royal Rifle Corps in 1945). Over the years, the formation of the cadet battalions was changed regularly, due to the changes to do with rules and the commanding officer.\nThe 1st Cadet Battalion owes its foundation to the Reverend Freeman Wills, who was commissioned into the Volunteer Army in the rank of captain on 26 July 1890. He was also Vicar of St Agatha’s just behind Sun Street, Finsbury Square. On receiving his commission he decided to form a cadet company within the 1st Cadet Battalion, the Royal West Surrey Regiment. The Company quickly expanded to become the 2nd Cadet Battalion, the Royal West Surrey Regiment, at which point he moved the Battalion Headquarters to No. 2 Finsbury Square (and in 1904 to 42 Sun Street, which he had specially built for the purpose). In 1894 he applied to HRH Prince George, Duke of Cambridge, Colonel-in-Chief, to affiliate to the Regiment, with the title of 1st Cadet Battalion, the King’s Royal Rifle Corps. Consent was granted on 8 November 1894 and the Battalion has remained a part of the Regiment ever since.\n\nIn the days of their foundation, Cadet battalions were privately organized and funded. On becoming a part of the King’s Royal Rifle Corps, subscriptions began to flow in and, after the commanding officer had spent nearly £1,000, the Battalion was placed on a financial basis that many Volunteer Corps would have envied. There were to be many ups and down in later years, especially when recognition of the Cadet Force was withdrawn between the two World Wars, but fortunately the enthusiasm and commitment of those involved consistently triumphed over the parsimony of Governments.\n\nIn 1900, when volunteers were urgently needed for the Second Boer War, the Commanding Officer, Colonel Freeman Croft-Wills persuaded the War Office to accept a\nCompany of the older Cadets, principally N.C.O.s (Non-Commissioned Officers), the company being enrolled in the City Imperial Volunteers. Around 100 cadets thus served in South Africa with this unit, whilst other Cadets and ex-Cadets served in the Royal Army Medical Corps, and other units. Four were killed in action, one serving with the 1st Battalion King's Royal Rifle Corps at the Battle of Dundee, and the others with units of the C.I.V.s. Their comrades erected brass plaques in their memory in the Drill Hall at Sun Street. These are now displayed in the Cadet Company Office here at Davies Street.\n\nIn recognition of this service, King Edward VII granted the Battalion the honour of wearing on its accoutrements the Battle Honour “South Africa 1900-1902” (Army Order 151 of 1905). The announcement of this privilege was made to the Battalion by His Majesty, King George V, then Prince of Wales, when, accompanied by Her Majesty Queen Mary, he distributed the prizes at the Guildhall in the City of London. The 1st Cadet Battalion King's Royal Rifle Corps are the only Cadet Unit in the United Kingdom to have been granted such an honour and are permitted to wear the miniature 60th Cap Badge with the single Battle Honour, and call their Cadets “Riflemen”.\n\nThe 2nd Cadet Battalion, the King’s Royal Rifle Corps was formed in 1942 when a Home Guard instruction was issued ordering each Home Guard battalion to raise a cadet unit. Lieutenant-Colonel R.L. Clark of Queen Victoria’s Rifles was given the task and on 15 May 1942 the Queen Victoria’s Rifles Cadet Corps was born. Over the next three years the unit expanded to five companies, which in April 1945 led to it being re-titled the 2nd Cadet Battalion, The King’s Royal Rifle Corps. In 1951 the 1st and 2nd Cadet Battalion were amalgamated. This resulted in the disposal of the Headquarters of the 1st Cadet Battalion at 42 Sun Street. In 1954, the Battalion office of the ‘new’ 1st Cadet Battalion was established at 56 Davies Street, where it remains to this day.\n\nToday, the KRRC 1st Cadet Battalion still exists, with the following units making up the Battalion:\n\n*A Company, 231 KRRC (Paddington) Rifles ACF\n*B Company, 232 KRRC (Westminster) Rifles ACF\n*C Company, 233 KRRC (Camden) Rifles ACF\n*D Company, 234 KRRC (Putney) RGJ ACF; until recently, when they formed the London Oratory School RGJ ACF unit (now CCF), although they were rebadged as Irish Guards in 2010 (making them the last remaining RGJ unit).\n\nAlliances\n\n* – The Queen's Own Rifles of Canada (1956–1966)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "King's Royal Rifle Corps" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17330" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The King's Royal Rifle Corps was an infantry rifle regiment of the British Army that was originally raised in British North America as the Royal American Regiment (also known as the Royal Americans) in the Seven Years' War and for Loyalist service in the American Revolutionary War. Later, ranked as the 60th Regiment of Foot, the regiment served for more than 200 years throughout the British Empire. In 1958, the regiment joined the Oxfordshire and Buckinghamshire Light Infantry and the Rifle Brigade in the Green Jackets Brigade and in 1966 the three regiments were formally amalgamated to become the Royal Green Jackets. The KRRC became the 2nd Battalion Royal Green Jackets. On the disbandment of 1/RGJ in 1992, the RGJ's KRRC battalion was redesignated as 1/RGJ, eventually becoming 2/RIFLES in 2007.\n\nHistory\n\nFrench and Indian War\n\nThe King's Royal Rifle Corps was raised in the American colonies in 1756 as the 62nd (Royal American) Regiment to defend the thirteen colonies against attack by the French and their Native American allies. After Braddock's defeat in 1755, royal approval for a new regiment, as well as funds, were granted by parliament just before Christmas 1755 – hence the regiment's traditional birthday of Christmas Day. However, parliamentary delays meant that it was 4 March 1756 before a special act of parliament created four battalions of 1,000 men each to include foreigners for service in the Americas.Cusick, p. 44\n\nA regimental history compiled in 1879 by a captain in the Kings Royal Rifle Corps, states that, in November 1755, Parliament voted the sum of £81,000 for the purpose of raising a regiment of four battalions, each one thousand strong, for service in British North America. Parliament approved “An Act to enable His Majesty to grant commissions to a certain number of foreign Protestants, who have served abroad as officers or engineers, to act and rank as officers or engineers in America only under certain restrictions and regulations.” The Earl of Loudoun, who as commander-in-chief of the Forces in North America, was appointed colonel-in-chief of the regiment. About fifty officers’ commissions were given to Germans and Swiss, and none were allowed to rise above the rank of lieutenant-colonel.Wallace, Captain Nesbit Willoughby, p. 1\n\nAccording to a modern history of the regiment, the idea for creating this unique force was proposed by Jacques Prevost, a Swiss soldier and adventurer who was a friend of the Duke of Cumberland (the Duke was the King's second son and also Commander-in-Chief of the Forces). Prevost recognised the need for soldiers who understood forest warfare, unlike the regulars who were brought to America in 1755 by General Edward Braddock.\n\nThe regiment was intended to combine the characteristics of a colonial corps with those of a foreign legion. Swiss and German forest fighting experts, American colonists and British volunteers from other British regiments were recruited. These men were Protestants, an important consideration for fighting against the predominantly Catholic French. The officers were also recruited from Europe – not from the American colonies – and consisted of English, Scots, Irish, Dutch, Swiss and Germans. It was the first time foreign officers were commissioned as British Army officers. In total, the regiment consisted of 101 officers, 240 non-commissioned officers and 4,160 enlisted men. The battalions were raised on Governors Island, New York. The regiment was renumbered the 60th (Royal American) Regiment in February 1757 when the 50th (Shirley's) and 51st (Pepperrell's) foot regiments were removed from the British Army roll after their surrender at Fort Oswego.\n\nAmong the distinguished foreign officers given commissions in the 60th (Royal Americans) was Henry Bouquet, a Swiss citizen, whose ideas on tactics, training and man-management (including the unofficial introduction of the rifle and 'battle-dress') would become universal in the British Army some 150 years later. Bouquet was commanding officer of the 1st battalion, and with his fellow battalion commanders, set about creating units that were better suited to warfare in the forests and lakes of northeast America.\n\nThe new regiment fought at Louisbourg in June 1758, the Cape Sable Campaign in September 1758 and Quebec in September 1759 in the campaign which finally wrested Canada from France; at Quebec it won from General James Wolfe the motto  (Swift and Bold). These were conventional battles on the European model, but fighting during Pontiac's War in 1763 was of a very different character. The frontier war threatened the British control of North America. The new regiment at first lost several outlying garrisons such as Fort Michilimackinac, but finally proved its mastery of forest warfare under Bouquet's leadership at the victory of Bushy Run in August 1763.\n\nThe 60th was uniformed and equipped in a similar manner to other British regiments with red coats and cocked hats or grenadier caps, but on campaign, swords were replaced with hatchets, and coats and hats cut down for ease of movement in the woods.\n\nAmerican Revolutionary War\n\nTwo additional battalions of the regiment (the 3rd and 4th battalions) were raised in England in 1775, principally of men recruited from England and Hanover in 1775 for service in the American Revolutionary War.  After assembly in the Isle of Wight, both battalions were sent in 1776 to Florida where they were joined by detachments from 1st and 2nd Battalions.\nThese battalions were deployed to Georgia and were involved in skirmishes at Sudbury in January 1779, the Battle of Briar Creek in March 1779, the Siege of Savannah in October 1779 where elements from the 4th Battalion captured the Colour of the 2nd South Carolina Regiment, and at Augusta in September 1780. The 3rd and 4th battalions were disbanded in June 1783.\n\nNapoleonic Wars\n\nDuring the Napoleonic Wars, the regiment saw action in the Peninsular War. The first four battalions had been raised as regular line battalions, but in 1797 a 5th battalion had been raised at Cowes on the Isle of Wight and equipped entirely with the Baker rifle, and wore green jackets with red facings. The mixing of rifle troops and muskets proved so effective that eventually line battalion light companies were replaced with rifle companies. The line battalions found themselves in several different theatres, including the West Indies. The rifle battalion was soon joined by a second, and these found themselves in the Peninsula with Wellington's army, serving along with the 95th Rifles, and the King's German Legion rifle units. A 7th battalion was eventually raised as a rifle battalion specifically for service in the American War of 1812.\n\nAnglo-Egyptian War and Second Boer War\n\nAfter the Napoleonic Wars, the regiment received a new title: first, in 1815, its name was changed to The Duke of York's Own Rifle Corps and then, in 1830, to the King's Royal Rifle Corps (KRRC). In 1858, the Rifle Depot at Winchester was made their headquarters. The regiment served in the Anglo-Egyptian War in 1882. During the rest of the 1800s, the unit also was active in China, Canada (Wolseley expedition), Afghanistan, India, Burma and South Africa. The regiment was deployed during the Second Boer War from the outset playing a key role in the first battle at Talana Hill. Two officers from the regiment were awarded the Victoria Cross; Lieutenant Frederick Hugh Sherston Roberts and Lieutenant Llewelyn Alberic Emilius Price-Davies. Private Frederick Corbett also received the Victoria Cross for his action at Kafr Dowar, Egypt, on 5 August 1882; his VC was later rescinded when he was convicted of embezzlement, theft, and being absent without leave.\n\nIn 1908, the Volunteers and Militia were reorganised nationally, with the former becoming the Territorial Force and the latter the Special Reserve; the regiment now had two Reserve but no Territorial battalions.These were the 5th Battalion (Special Reserve) and the 6th Battalion (Special Reserve)\n\nFirst World War\n\nRegular Army\n\nThe 1st Battalion landed at Rouen as part of the 6th Brigade in the 2nd Division in August 1914 for service on the Western Front and saw action at the Battle of Mons in August 1914, the First Battle of the Marne in September 1914, the First Battle of the Aisne in September 1914 and First Battle of Ypres in October 1914 as well as the Battle of Festubert in May 1915, the Battle of Loos in September 1915 and the Battle of the Somme in Autumn 1916 before taking part in the advance to the Hindenburg Line, the Battle of Arras in November 1917, the Battle of Cambrai in November 1917, the Second Battle of the Somme in Autumn 1918 and the Battle of the Selle in October 1918. The war ended a month later with the signing of the Armistice of 11 November 1918.\n\nThe 2nd Battalion landed at Le Havre as part of the 2nd Brigade in the 1st Division in August 1914 for service on the Western Front and saw action at the Battle of Aubers Ridge in May 1915.\n\nThe 3rd Battalion landed at Le Havre as part of the 80th Brigade in the 27th Division in December 1914 for service on the Western Front and saw action at the Second Battle of Ypres in April 1915.\n\nThe 4th Battalion landed at Le Havre as part of the 80th Brigade in the 27th Division in December 1914 for service on the Western Front and saw action at the Second Battle of Ypres in April 1915 but moved to Salonika in November 1915 before returning to France in June 1918.\n\nTerritorial Force\n\nThe regiment did not have any territorial force battalions.\n\nNew Armies\n\nThe 7th (Service) Battalion landed at Boulogne-sur-Mer as part of the 41st Brigade in the 14th (Light) Division in August 1914 for service on the Western Front and saw action the Second Battle of Ypres in May 1915, the Battle of Delville Wood in July 1916 and the Battle of Flers–Courcelette in September 1916 as well as the advance to the Hindenburg Line, the Battle of Arras in April 1917, the Battle of Langemark in August 1917, the First Battle of Passchendaele in October 1917 and the Second Battle of Passchendaele in November 1917 before taking part in the Battle of St Quentin in March 1918 and the Battle of the Avre in April 1918.\n\nThe 8th (Service) Battalion landed at Boulogne-sur-Mer as part of the 41st Brigade in the 14th (Light) Division in May 1915 for service on the Western Front and saw action most of the same battles as the 7th Battalion. The 9th (Service) Battalion landed at Boulogne-sur-Mer as part of the 42nd Brigade in the 14th (Light) Division in May 1915 for service on the Western Front and saw action most of the same battles as the 7th and 8th battalions.\n\nThe 10th (Service) Battalion and 11th (Service) Battalion landed at Boulogne-sur-Mer as part of the 59th Brigade in the 20th (Light) Division in July 1915 for service on the Western Front and saw action at the Battle of Mont Sorrel in June 1916, the Battle of Delville Wood in July 1916 and the Battle of Guillemont in September 1916 as well as the Battle of Flers–Courcelette in September 1916, the Battle of Morval in September 1916 and the Battle of Le Transloy in October 1916 before taking part in the advance to the Hindenburg Line, the Battle of Langemarck in August 1917, the Battle of the Menin Road Ridge in September 1917, the Battle of Polygon Wood in September 1917 and the Battle of Cambrai in November 1917.\n\nThe 12th (Service) Battalion landed at Boulogne-sur-Mer as part of the 60th Brigade in the 20th (Light) Division in July 1915 for service on the Western Front and saw action most of the same battles as the 10th and 11th Battalions. The 13th (Service) Battalion landed at Boulogne-sur-Mer as part of the 111th Brigade in the 37th Division in July 1915 for service on the Western Front and saw action at the Battle of Morval in September 1916, the advance to the Hindenburg Line and the Battle of Arras in April 1917 as well as the Battle of Passchendaele in Autumn 1917, the Battle of Cambrai in November 1917 and the Hundred Days Offensive in Autumn 1918 before taking part in the Battles of the Hindenburg Line and the Final Advance in Picardy.\n\nThe 16th (Service) Battalion (Church Lads Brigade) landed at Le Havre as part of the 100th Brigade in the 33rd Division in November 1915 for service on the Western Front. \n\nThe 17th (Service) Battalion (British Empire League) landed at Le Havre as part of the 117th Brigade in the 39th Division in March 1916 for service on the Western Front. \n\nThe 18th (Service) Battalion (Arts & Crafts) landed at Le Havre as part of the 122nd Brigade in the 41st Division in March 1916 for service on the Western Front.\n\nThe 20th (Service) Battalion (British Empire League Pioneers) landed at Le Havre as pioneer battalion for the 3rd Division in March 1916 for service on the Western Front. The 21st (Service) Battalion (Yeoman Rifles) landed in France as part of the 124th Brigade in the 41st Division in May 1916 for service on the Western Front but moved to Italy in November 1917 before returning to France in March 1918.\n\nSeven members of the regiment received the Victoria Cross.\n\nInter-war years\n\nAfter 1918, the unit returned to garrison duties in India, Palestine and Ireland. In 1922, the regiment was reduced from four to two battalions with the third and fourth being disbanded. In 1926, the Regiment was reorganised as one of the first mechanised infantry regiments.\n\nSecond World War\n\nThe 1st Battalion, KRRC was deployed to North Africa and saw action as part of the pivot group within the 7th Armoured Division at the Battle of Sidi Rezegh in November 1941, the First Battle of El Alamein in July 1942 and the Second Battle of El Alamein in October 1942 during the Western Desert Campaign. Rifleman John Beeley was awarded a posthumous Victoria Cross for his actions during Operation Crusader in North Africa. It then served in Italy, initially in the 1st Armoured Division's 2nd Armoured Brigade, then with the independent 9th Armoured Brigade and finally the 6th Armoured Division's 61st Infantry Brigade.\n\nThe 2nd Battalion was part of the British Expeditionary Force (BEF) that landed in France in May 1940. The battalion, which was part of the 30th Infantry Brigade, 1st Armoured Division, was lost in the defence of Calais, where the brigade slowed the German advance and enabled the Dunkirk evacuation to proceed. The reformed battalion took part in the Battle of Gazala in May 1942 and the Second Battle of El Alamein in October 1942 during the North African Campaign. Following the Normandy landings in June 1944, the Battalion served in the 4th Armoured Brigade and in the subsequent campaign in North-West Europe\n\nThe 7th Battalion (The Queen Victoria's Rifles) was also part of the BEF; like the 2nd battalion, it was also part of the 30th Infantry Brigade and lost in the defence of Calais. The 9th Battalion (The Rangers) was deployed to the Mediterranean theatre as part of the 1st Armoured Brigade in the 7th Armoured Division. It saw action in the Greek campaign in April 1941 before being disbanded in August 1942.\n\nRoyal Green Jackets\n\nIn 1958 for administrative purposes, the KRRC was brigaded with the Oxfordshire and Buckinghamshire Light Infantry and the Rifle Brigade to form the Green Jackets Brigade. In 1958, the Regiment was re-titled the 2nd Green Jackets, the King's Royal Rifle Corps, while the two other regiments of the Green Jackets Brigade were re-titled the 1st Green Jackets (43rd and 52nd) and 3rd Green Jackets, the Rifle Brigade (Prince Consort's Own) respectively. In 1966, the three regiments were amalgamated to form the three battalions of the Royal Green Jackets.\n\nTerritorial Battalions\n\n*Queen Victoria's Rifles\n*The Rangers\n*The Queen's Westminsters\n\nIn the Second World War, the following territorial battalions were formally made part of the KRRC:\n*1st Battalion Queen Victoria's Rifles – 7th Battalion KRRC\n*2nd Battalion Queen Victoria's Rifles – 8th Battalion KRRC\n*1st Battalion The Rangers – 9th Battalion KRRC\n*2nd Battalion The Rangers – 10th Battalion KRRC\n*1st Battalion The Queen's Westminsters – 11th Battalion KRRC\n*2nd Battalion The Queen's Westminsters – 12th Battalion KRRC\n\nCadet Battalions\n\nThere were two cadet battalions: 1st Cadet Battalion, The King’s Royal Rifle Corps and Queen Victoria’s Rifles Cadet Corps (re-titled the 2nd Cadet Battalion, The King’s Royal Rifle Corps in 1945). Over the years, the formation of the cadet battalions was changed regularly, due to the changes to do with rules and the commanding officer.\nThe 1st Cadet Battalion owes its foundation to the Reverend Freeman Wills, who was commissioned into the Volunteer Army in the rank of captain on 26 July 1890. He was also Vicar of St Agatha’s just behind Sun Street, Finsbury Square. On receiving his commission he decided to form a cadet company within the 1st Cadet Battalion, the Royal West Surrey Regiment. The Company quickly expanded to become the 2nd Cadet Battalion, the Royal West Surrey Regiment, at which point he moved the Battalion Headquarters to No. 2 Finsbury Square (and in 1904 to 42 Sun Street, which he had specially built for the purpose). In 1894 he applied to HRH Prince George, Duke of Cambridge, Colonel-in-Chief, to affiliate to the Regiment, with the title of 1st Cadet Battalion, the King’s Royal Rifle Corps. Consent was granted on 8 November 1894 and the Battalion has remained a part of the Regiment ever since.\n\nIn the days of their foundation, Cadet battalions were privately organized and funded. On becoming a part of the King’s Royal Rifle Corps, subscriptions began to flow in and, after the commanding officer had spent nearly £1,000, the Battalion was placed on a financial basis that many Volunteer Corps would have envied. There were to be many ups and down in later years, especially when recognition of the Cadet Force was withdrawn between the two World Wars, but fortunately the enthusiasm and commitment of those involved consistently triumphed over the parsimony of Governments.\n\nIn 1900, when volunteers were urgently needed for the Second Boer War, the Commanding Officer, Colonel Freeman Croft-Wills persuaded the War Office to accept a\nCompany of the older Cadets, principally N.C.O.s (Non-Commissioned Officers), the company being enrolled in the City Imperial Volunteers. Around 100 cadets thus served in South Africa with this unit, whilst other Cadets and ex-Cadets served in the Royal Army Medical Corps, and other units. Four were killed in action, one serving with the 1st Battalion King's Royal Rifle Corps at the Battle of Dundee, and the others with units of the C.I.V.s. Their comrades erected brass plaques in their memory in the Drill Hall at Sun Street. These are now displayed in the Cadet Company Office here at Davies Street.\n\nIn recognition of this service, King Edward VII granted the Battalion the honour of wearing on its accoutrements the Battle Honour “South Africa 1900-1902” (Army Order 151 of 1905). The announcement of this privilege was made to the Battalion by His Majesty, King George V, then Prince of Wales, when, accompanied by Her Majesty Queen Mary, he distributed the prizes at the Guildhall in the City of London. The 1st Cadet Battalion King's Royal Rifle Corps are the only Cadet Unit in the United Kingdom to have been granted such an honour and are permitted to wear the miniature 60th Cap Badge with the single Battle Honour, and call their Cadets “Riflemen”.\n\nThe 2nd Cadet Battalion, the King’s Royal Rifle Corps was formed in 1942 when a Home Guard instruction was issued ordering each Home Guard battalion to raise a cadet unit. Lieutenant-Colonel R.L. Clark of Queen Victoria’s Rifles was given the task and on 15 May 1942 the Queen Victoria’s Rifles Cadet Corps was born. Over the next three years the unit expanded to five companies, which in April 1945 led to it being re-titled the 2nd Cadet Battalion, The King’s Royal Rifle Corps. In 1951 the 1st and 2nd Cadet Battalion were amalgamated. This resulted in the disposal of the Headquarters of the 1st Cadet Battalion at 42 Sun Street. In 1954, the Battalion office of the ‘new’ 1st Cadet Battalion was established at 56 Davies Street, where it remains to this day.\n\nToday, the KRRC 1st Cadet Battalion still exists, with the following units making up the Battalion:\n\n*A Company, 231 KRRC (Paddington) Rifles ACF\n*B Company, 232 KRRC (Westminster) Rifles ACF\n*C Company, 233 KRRC (Camden) Rifles ACF\n*D Company, 234 KRRC (Putney) RGJ ACF; until recently, when they formed the London Oratory School RGJ ACF unit (now CCF), although they were rebadged as Irish Guards in 2010 (making them the last remaining RGJ unit).\n\nAlliances\n\n* – The Queen's Own Rifles of Canada (1956–1966). King's Royal Rifle Corps. http://en.wikipedia.org/?curid=17330."
  }
}
