{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12543",
  "eid" : "034b6850-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514773,
  "textBody" : "In mathematics, especially in category theory and homotopy theory, a groupoid (less often Brandt groupoid or virtual group) generalises the notion of group in several equivalent ways. A groupoid can be seen as a:\n*Group with a partial function replacing the binary operation;\n*Category in which every morphism is invertible. A category of this sort can be viewed as augmented with a unary operation, called inverse by analogy with group theory. Notice that a groupoid where there is only one object is a usual group.\n\nSpecial cases include:\n*Setoids, that is: sets that come with an equivalence relation;\n*G-sets, sets equipped with an action of a group G.\n\nGroupoids are often used to reason about geometrical objects such as manifolds.  introduced groupoids implicitly via Brandt semigroups.[http://eom.springer.de/b/b017600.htm Brandt semigroup] in Springer Encyclopaedia of Mathematics - \n\nDefinitions \n\nA groupoid is an algebraic structure (G,\\ast) consisting of a non-empty set G and a binary partial function  '\\ast'  defined on G.\n\nAlgebraic \n\nA groupoid is a set G with a unary operation {}^{-1}:G\\to G, and a partial function  *:G\\times G \\rightharpoonup G.  Here * is not a binary operation because it is not necessarily defined for all possible pairs of G-elements.  The precise conditions under which * is defined are not articulated here and vary by situation.\n\n\\ast and −1 have the following axiomatic properties.  Let a, b, and c be elements of G.  Then:\n# Associativity: If a*b and b*c are defined, then (a * b) * c and a * (b * c) are defined and equal.  Conversely, if either of these last two expressions is defined, then so is the other (and again they are equal).\n# Inverse: a^{-1} * a and a*{a^{-1}} are always defined.\n# Identity: If a*b is defined, then a*{b^{-1}}*b a, and {a^{-1}} * a * b \n b.  (The previous two axioms already show that these expressions are defined and unambiguous.)\n\nFrom these axioms, two easy and convenient properties follow:\n* (a^{-1})^{-1} = a;\n* If a*b is defined, then (a*b)^{-1} = b^{-1} * a^{-1}.\n\nProof of first property: from 2. and 3. we obtain (a^{-1})^{-1} (a^{-1})^{-1} * a^{-1} * a \n a.  ✓ \nProof of second property: since a * b is defined, so is (a * b)−1 * a * b.  Therefore (a * b)−1 * a * b * b−1 (a * b)−1 * a is also defined.  Moreover since a * b is defined, so is a * b * b−1 \n a.  Therefore a * b * b−1 * a−1 is also defined.  From 3. we obtain (a * b)−1 (a * b)−1 * a * a−1 \n (a * b)−1 * a * b * b−1 * a−1 = b−1 * a−1.  ✓\n\nCategory theoretic\n\nA groupoid is a small category in which every morphism is an isomorphism, i.e. invertible. More precisely, a groupoid G is:\n* A set G0 of objects;\n* For each pair of objects x and y in G0, there exists a (possibly empty) set G(x,y) of morphisms (or arrows) from x to y. We write f : x → y to indicate that f is an element of G(x,y).\n* For every object x, a designated element \\mathrm{id}_x of G(x,x);\n* For each triple of objects x, y, and z, a function \\mathrm{comp}_{x,y,z} : G(y, z)\\times G(x, y) \\rightarrow G(x, z): (g, f) \\mapsto gf;\n* For each pair of objects x, y a function \\mathrm{inv}: G(x, y) \\rightarrow G(y, x): f \\mapsto f^{-1};\n\nsatisfying, for any f : x → y, g : y → z, and h : z → w:\n* f \\mathrm{id}_x f and \\mathrm{id}_y f \n f;\n* (hg)f = h(gf);\n* f f^{-1} \\mathrm{id}_y and f^{-1} f \n \\mathrm{id}_x.\n\nIf f is an element of G(x,y) then x is called the source of f, written s(f), and y the target of f (written t(f)).\n\nMore generally, one can consider a groupoid object in an arbitrary category admitting finite fiber products.\n\nComparing the definitions\n\nThe algebraic and category-theoretic definitions are equivalent, as follows. Given a groupoid in the category-theoretic sense, let G be the disjoint union of all of the sets G(x,y) (i.e. the sets of morphisms from x to y).\n\nThen \\mathrm{comp} and \\mathrm{inv} become partially defined operations on G, and \\mathrm{inv} will in fact be defined everywhere; so we define ∗  to be \\mathrm{comp} and −1 to be \\mathrm{inv}. Thus we have a groupoid in the algebraic sense. Explicit reference to G0 (and hence to \\mathrm{id}) can be dropped.\n\nConversely, given a groupoid G in the algebraic sense, let G0 be the set of all elements of the form x ∗ x−1 with x varying through G and define\n\nG(x*x^{-1}, y*y^{-1})\n\nas the set of all elements f such that\n\ny*y^{-1}*f*x*x^{-1}\n\nexists. Given\n\nf \\in G(x * x^{-1}, y * y^{-1}) \\quad\\mathrm{and}\\quad \ng \\in G(y * y^{-1}, z * z^{-1}),\n\ntheir composite is defined as\n\ng*f \\in G(x*x^{-1},z*z^{-1}).\n\nTo see this is well defined, observe that since\n\nz*z^{-1}*g*y*y^{-1} \\quad\\mathrm{and}\\quad y*y^{-1}*f*x*x^{-1}\n\nexist, so does\n\nz*z^{-1}*g*y*y^{-1}*y*y^{-1}*f*x*x^{-1} = z*z^{-1}*g*f*x*x^{-1}.\n\nThe identity morphism on x ∗ x−1 is then x ∗ x−1 itself, and the category-theoretic inverse of f is f−1.\n\nSets in the definitions above may be replaced with classes, as is generally the case in category theory.\n\nVertex groups\n\nGiven a groupoid G, the vertex groups or isotropy groups or object groups in G are the subsets of the form G(x,x), where x is any object of G.  It follows easily from the axioms above that these are indeed groups, as every pair of elements is composable and inverses are in the same vertex group.\n\nCategory of groupoids\n\nA subgroupoid is a subcategory that is itself a groupoid. A groupoid morphism is simply a functor between two (category-theoretic) groupoids. The category whose objects are groupoids and whose morphisms are groupoid morphisms is called the groupoid category, or the category of groupoids, denoted Grpd.\n\nIt is useful that this category is, like the category of small categories,  Cartesian closed. That is, we can construct  for any groupoids H,K a groupoid  C\\operatorname{GPD}(H,K) whose objects are the morphisms  H \\to K  and whose arrows are the natural equivalences  of morphisms. Thus if  H,K  are just groups, then such arrows are the conjugacies of morphisms. The main result is that for any groupoids  G,H,K  there is a natural bijection\n\n\\operatorname{Grpd}(G \\times H, K) \\cong \\operatorname{Grpd}(G, \\operatorname{GPD}(H,K)).\n\nThis result is of interest even if all the groupoids  G,H,K  are just groups.\n\nFibrations and coverings\n\nParticular kinds of morphisms of groupoids are of interest. A morphism p: E \\to B of groupoids is called a fibration if for each object x of E and each morphism b of B starting at p(x) there is a morphism e of E starting at x  such that p(e)=b. A fibration is called a covering morphism or covering of groupoids if further such an e is unique. The covering morphisms of groupoids are especially useful because they can be used to model covering maps of spaces.J.P. May, A Concise Course in Algebraic Topology, 1999, The University of Chicago Press  (see chapter 2)\n\nIt is also true that the category of covering morphisms of a given groupoid B is equivalent to the category of actions of the groupoid B on sets.\n\nExamples \n\nLinear algebra\n\nGiven a field K, the corresponding general linear groupoid GL*(K) consists of all invertible matrices, of any size, whose entries range over K. Matrix multiplication interprets composition. If G GL*(K), then the set of natural numbers is a proper subset of G0, since for each natural number n, there is a corresponding identity matrix of dimension n.  G(m,n) is empty unless m\nn, in which case it is the set of all nxn invertible matrices.\n\nTopology\n\nGiven a topological space X, let G_0 be the set X. The morphisms from the point p to the point q are equivalence classes of continuous paths from p to q, with two paths being equivalent if they are homotopic.\nTwo such morphisms are composed by first following the first path, then the second; the homotopy equivalence guarantees that this composition is associative. This groupoid is called the fundamental groupoid of X, denoted \\pi_1(X) (or sometimes, \\Pi_1(X)).  The usual fundamental group \\pi_1(X,x) is then the vertex group for the point x.\n\nAn important extension of this idea is to consider the fundamental groupoid \\pi_1(X,A) where A\\subset X is a chosen set of \"base points\". Here, one considers only paths whose endpoints belong to A. \\pi_1(X,A) is a sub-groupoid of \\pi_1(X). The set A may be chosen according to the geometry of the situation at hand.\n\nEquivalence relation\n\nIf X is a set with an equivalence relation denoted by infix \\sim, then a groupoid \"representing\" this equivalence relation can be formed as follows:\n* The objects of the groupoid are the elements of X;\n*For any two elements x and y in X, there is a single morphism from x to y if and only if x\\sim y.\n\nGroup action\n\nIf the group G acts on the set X, then we can form the action groupoid (or transformation groupoid) representing this group action as follows:\n*The objects are the elements of X;\n*For any two elements x and y in X, there is a morphism from x to y corresponding to every element g of G such that gx = y;\n*Composition of morphisms interprets the binary operation of G.\n\nMore explicitly, the action groupoid is the set G\\times X with source and target maps s(g,x) x and t(g,x) \n gx.  It is often denoted G \\ltimes X (or X\\rtimes G). Multiplication (or composition) in the groupoid is then (h,y)(g,x) (hg,x) which is defined provided y\ngx.\n\nFor x in X, the vertex group consists of those (g,x) with gx=x, which is just the isotropy subgroup at x for the given action (which is why vertex groups are also called isotropy groups).\n\nAnother way to describe G-sets is the functor category [\\mathrm{Gr},\\mathrm{Set}], where \\mathrm{Gr} is the groupoid (category) with one element and isomorphic to the group G. Indeed, every functor F of this category defines a set X=F(\\mathrm{Gr}) and for every g in G (i.e. for every morphism in \\mathrm{Gr}) induces a bijection F_g : X\\to X. The categorical structure of the functor F assures us that F defines a G-action on the set G. The (unique) representable functor F : \\mathrm{Gr}→\\mathrm{Set} is the Cayley representation of G. In fact, this functor is isomorphic to \\mathrm{Hom}(\\mathrm{Gr},-) and so sends \\mathrm{ob}(\\mathrm{Gr}) to the set \\mathrm{Hom}(\\mathrm{Gr},\\mathrm{Gr}) which is by definition the \"set\" G and the morphism g of \\mathrm{Gr} (i.e. the element g of G) to the permutation F_g of the set G. We deduce from the Yoneda embedding that the group G is isomorphic to the group {F_g\\mid g\\in G}, a subgroup of the group of permutations of G.\n\nFifteen puzzle\n\nThe transformations of the fifteen puzzle form a groupoid (not a group, as not all moves can be composed).Jim Belk (2008) [https://cornellmath.wordpress.com/2008/01/27/puzzles-groups-and-groupoids/ Puzzles, Groups, and Groupoids], The Everything Seminar[http://www.neverendingbooks.org/the-15-puzzle-groupoid-1 The 15-puzzle groupoid (1)], Never Ending Books[http://www.neverendingbooks.org/the-15-puzzle-groupoid-2 The 15-puzzle groupoid (2)], Never Ending Books This groupoid acts on configurations.\n\nMathieu groupoid\n\nThe Mathieu groupoid is a groupoid introduced by John Horton Conway acting on 13 points such that the elements fixing a point form a copy of the Mathieu group M12.\n\nRelation to groups \n\nIf a groupoid has only one object, then the set of its morphisms forms a group. Using the algebraic definition, such a groupoid is literally just a group.Mapping a group to the corresponding groupoid with one object is sometimes called delooping, especially in the context of homotopy theory, see . Many concepts of group theory generalize to groupoids, with the notion of functor replacing that of group homomorphism.\n\nIf x is an object of the groupoid G, then the set of all morphisms from x to x forms a group G(x) (called the vertex group, defined above). If there is a morphism f from x to y, then the groups G(x) and G(y) are isomorphic, with an isomorphism given by the mapping g\\to fgf^{-1}.\n\nEvery connected groupoid (that is, one in which any two objects are connected by at least one morphism) is isomorphic to an action groupoid (as defined above) (G, X) [by connectedness, there will only be one orbit under the action]. If the groupoid is not connected, then it is isomorphic to a disjoint union of groupoids of the above type (possibly with different groups G and sets X for each connected component).\n\nNote that the isomorphism described above is not unique, and there is no natural choice. Choosing such an isomorphism for a connected groupoid essentially amounts to picking one object x_0, a group isomorphism h from G(x_0) to G, and for each x other than x_0, a morphism in G from x_0 to x.\n\nIn category-theoretic terms, each connected component of a groupoid is equivalent (but not isomorphic) to a groupoid with a single object, that is, a single group. Thus any groupoid is equivalent to a multiset of unrelated groups. In other words, for equivalence instead of isomorphism, one need not specify the sets X, only the groups G.\n\nConsider the examples in the previous section. The general linear groupoid is both equivalent and isomorphic to the disjoint union of the various general linear groups GL_n(F). On the other hand:\n*The fundamental groupoid of X is equivalent to the collection of the fundamental groups of each path-connected component of X, but an isomorphism requires specifying the set of points in each component;\n*The set X with the equivalence relation \\sim is equivalent (as a groupoid) to one copy of the trivial group for each equivalence class, but an isomorphism requires specifying what each equivalence class is:\n*The set X equipped with an action of the group G is equivalent (as a groupoid) to one copy of G for each orbit of the action, but an isomorphism requires specifying what set each orbit is.\n\nThe collapse of a groupoid into a mere collection of groups loses some information, even from a category-theoretic point of view, because it is not natural. Thus when groupoids arise in terms of other structures, as in the above examples, it can be helpful to maintain the full groupoid. Otherwise, one must choose a way to view each G(x) in terms of a single group, and this choice can be arbitrary. In our example from topology, you would have to make a coherent choice of paths (or equivalence classes of paths) from each point p to each point q in the same path-connected component.\n\nAs a more illuminating example, the classification of groupoids with one endomorphism does not reduce to purely group theoretic considerations. This is analogous to the fact that the classification of vector spaces with one endomorphism is nontrivial.\n\nMorphisms of groupoids come in more kinds than those of groups: we have, for example,  fibrations, covering morphisms, universal morphisms, and quotient morphisms. Thus a subgroup H of a group G yields an action of G on the set of cosets of H in G and hence a covering morphism p from, say, K to G, where K is a groupoid with vertex groups isomorphic to H. In this way, presentations of the group G can be \"lifted\" to presentations of the groupoid K, and this is a useful way of obtaining information about presentations of the subgroup H. For further information, see the books by Higgins and by Brown in the References.\n\nProperties of the category Grpd \n\n* Grpd both complete and cocomplete\n* Grpd is a cartesian closed category\n\nRelation to Cat \n\nThe inclusion i : \\mathbf{Grpd} \\to \\mathbf{Cat} has both a left and a right adjoint:\n\n \\hom_{\\mathbf{Grpd}}(C[C^{-1}], G) \\cong \\hom_{\\mathbf{Cat}}(C, i(G)) \n \\hom_{\\mathbf{Cat}}(i(G), C) \\cong \\hom_{\\mathbf{Grpd}}(G, \\mathrm{Core}(C)) \n\nHere, C[C^{-1}] denotes the localization of a category that inverts every morphism, and \\mathrm{Core}(C) denotes the subcategory of all isomorphisms.\n\nRelation to sSet \n\nThe nerve functor N :  \\mathbf{Grpd} \\to \\mathbf{sSet} embeds Grpd as a full subcategory of the category of simplicial sets. The nerve of a groupoid is always Kan complex.\n\nThe nerve has a left adjoint\n \\hom_{\\mathbf{Grpd}}(\\pi_1(X), G) \\cong \\hom_{\\mathbf{sSet}}(X, N(G)) \nHere, \\pi_1(X) denotes the fundamental groupoid of the simpicial set X.\n\nLie groupoids and Lie algebroids \n\nWhen studying geometrical objects, the arising groupoids often carry some differentiable structure, turning them into Lie groupoids.\nThese can be studied in terms of Lie algebroids, in analogy to the relation between Lie groups and Lie algebras.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Groupoid" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12543" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, especially in category theory and homotopy theory, a groupoid (less often Brandt groupoid or virtual group) generalises the notion of group in several equivalent ways. A groupoid can be seen as a:\n*Group with a partial function replacing the binary operation;\n*Category in which every morphism is invertible. A category of this sort can be viewed as augmented with a unary operation, called inverse by analogy with group theory. Notice that a groupoid where there is only one object is a usual group.\n\nSpecial cases include:\n*Setoids, that is: sets that come with an equivalence relation;\n*G-sets, sets equipped with an action of a group G.\n\nGroupoids are often used to reason about geometrical objects such as manifolds.  introduced groupoids implicitly via Brandt semigroups.[http://eom.springer.de/b/b017600.htm Brandt semigroup] in Springer Encyclopaedia of Mathematics - \n\nDefinitions \n\nA groupoid is an algebraic structure (G,\\ast) consisting of a non-empty set G and a binary partial function  '\\ast'  defined on G.\n\nAlgebraic \n\nA groupoid is a set G with a unary operation {}^{-1}:G\\to G, and a partial function  *:G\\times G \\rightharpoonup G.  Here * is not a binary operation because it is not necessarily defined for all possible pairs of G-elements.  The precise conditions under which * is defined are not articulated here and vary by situation.\n\n\\ast and −1 have the following axiomatic properties.  Let a, b, and c be elements of G.  Then:\n# Associativity: If a*b and b*c are defined, then (a * b) * c and a * (b * c) are defined and equal.  Conversely, if either of these last two expressions is defined, then so is the other (and again they are equal).\n# Inverse: a^{-1} * a and a*{a^{-1}} are always defined.\n# Identity: If a*b is defined, then a*{b^{-1}}*b a, and {a^{-1}} * a * b \n b.  (The previous two axioms already show that these expressions are defined and unambiguous.)\n\nFrom these axioms, two easy and convenient properties follow:\n* (a^{-1})^{-1} = a;\n* If a*b is defined, then (a*b)^{-1} = b^{-1} * a^{-1}.\n\nProof of first property: from 2. and 3. we obtain (a^{-1})^{-1} (a^{-1})^{-1} * a^{-1} * a \n a.  ✓ \nProof of second property: since a * b is defined, so is (a * b)−1 * a * b.  Therefore (a * b)−1 * a * b * b−1 (a * b)−1 * a is also defined.  Moreover since a * b is defined, so is a * b * b−1 \n a.  Therefore a * b * b−1 * a−1 is also defined.  From 3. we obtain (a * b)−1 (a * b)−1 * a * a−1 \n (a * b)−1 * a * b * b−1 * a−1 = b−1 * a−1.  ✓\n\nCategory theoretic\n\nA groupoid is a small category in which every morphism is an isomorphism, i.e. invertible. More precisely, a groupoid G is:\n* A set G0 of objects;\n* For each pair of objects x and y in G0, there exists a (possibly empty) set G(x,y) of morphisms (or arrows) from x to y. We write f : x → y to indicate that f is an element of G(x,y).\n* For every object x, a designated element \\mathrm{id}_x of G(x,x);\n* For each triple of objects x, y, and z, a function \\mathrm{comp}_{x,y,z} : G(y, z)\\times G(x, y) \\rightarrow G(x, z): (g, f) \\mapsto gf;\n* For each pair of objects x, y a function \\mathrm{inv}: G(x, y) \\rightarrow G(y, x): f \\mapsto f^{-1};\n\nsatisfying, for any f : x → y, g : y → z, and h : z → w:\n* f \\mathrm{id}_x f and \\mathrm{id}_y f \n f;\n* (hg)f = h(gf);\n* f f^{-1} \\mathrm{id}_y and f^{-1} f \n \\mathrm{id}_x.\n\nIf f is an element of G(x,y) then x is called the source of f, written s(f), and y the target of f (written t(f)).\n\nMore generally, one can consider a groupoid object in an arbitrary category admitting finite fiber products.\n\nComparing the definitions\n\nThe algebraic and category-theoretic definitions are equivalent, as follows. Given a groupoid in the category-theoretic sense, let G be the disjoint union of all of the sets G(x,y) (i.e. the sets of morphisms from x to y).\n\nThen \\mathrm{comp} and \\mathrm{inv} become partially defined operations on G, and \\mathrm{inv} will in fact be defined everywhere; so we define ∗  to be \\mathrm{comp} and −1 to be \\mathrm{inv}. Thus we have a groupoid in the algebraic sense. Explicit reference to G0 (and hence to \\mathrm{id}) can be dropped.\n\nConversely, given a groupoid G in the algebraic sense, let G0 be the set of all elements of the form x ∗ x−1 with x varying through G and define\n\nG(x*x^{-1}, y*y^{-1})\n\nas the set of all elements f such that\n\ny*y^{-1}*f*x*x^{-1}\n\nexists. Given\n\nf \\in G(x * x^{-1}, y * y^{-1}) \\quad\\mathrm{and}\\quad \ng \\in G(y * y^{-1}, z * z^{-1}),\n\ntheir composite is defined as\n\ng*f \\in G(x*x^{-1},z*z^{-1}).\n\nTo see this is well defined, observe that since\n\nz*z^{-1}*g*y*y^{-1} \\quad\\mathrm{and}\\quad y*y^{-1}*f*x*x^{-1}\n\nexist, so does\n\nz*z^{-1}*g*y*y^{-1}*y*y^{-1}*f*x*x^{-1} = z*z^{-1}*g*f*x*x^{-1}.\n\nThe identity morphism on x ∗ x−1 is then x ∗ x−1 itself, and the category-theoretic inverse of f is f−1.\n\nSets in the definitions above may be replaced with classes, as is generally the case in category theory.\n\nVertex groups\n\nGiven a groupoid G, the vertex groups or isotropy groups or object groups in G are the subsets of the form G(x,x), where x is any object of G.  It follows easily from the axioms above that these are indeed groups, as every pair of elements is composable and inverses are in the same vertex group.\n\nCategory of groupoids\n\nA subgroupoid is a subcategory that is itself a groupoid. A groupoid morphism is simply a functor between two (category-theoretic) groupoids. The category whose objects are groupoids and whose morphisms are groupoid morphisms is called the groupoid category, or the category of groupoids, denoted Grpd.\n\nIt is useful that this category is, like the category of small categories,  Cartesian closed. That is, we can construct  for any groupoids H,K a groupoid  C\\operatorname{GPD}(H,K) whose objects are the morphisms  H \\to K  and whose arrows are the natural equivalences  of morphisms. Thus if  H,K  are just groups, then such arrows are the conjugacies of morphisms. The main result is that for any groupoids  G,H,K  there is a natural bijection\n\n\\operatorname{Grpd}(G \\times H, K) \\cong \\operatorname{Grpd}(G, \\operatorname{GPD}(H,K)).\n\nThis result is of interest even if all the groupoids  G,H,K  are just groups.\n\nFibrations and coverings\n\nParticular kinds of morphisms of groupoids are of interest. A morphism p: E \\to B of groupoids is called a fibration if for each object x of E and each morphism b of B starting at p(x) there is a morphism e of E starting at x  such that p(e)=b. A fibration is called a covering morphism or covering of groupoids if further such an e is unique. The covering morphisms of groupoids are especially useful because they can be used to model covering maps of spaces.J.P. May, A Concise Course in Algebraic Topology, 1999, The University of Chicago Press  (see chapter 2)\n\nIt is also true that the category of covering morphisms of a given groupoid B is equivalent to the category of actions of the groupoid B on sets.\n\nExamples \n\nLinear algebra\n\nGiven a field K, the corresponding general linear groupoid GL*(K) consists of all invertible matrices, of any size, whose entries range over K. Matrix multiplication interprets composition. If G GL*(K), then the set of natural numbers is a proper subset of G0, since for each natural number n, there is a corresponding identity matrix of dimension n.  G(m,n) is empty unless m\nn, in which case it is the set of all nxn invertible matrices.\n\nTopology\n\nGiven a topological space X, let G_0 be the set X. The morphisms from the point p to the point q are equivalence classes of continuous paths from p to q, with two paths being equivalent if they are homotopic.\nTwo such morphisms are composed by first following the first path, then the second; the homotopy equivalence guarantees that this composition is associative. This groupoid is called the fundamental groupoid of X, denoted \\pi_1(X) (or sometimes, \\Pi_1(X)).  The usual fundamental group \\pi_1(X,x) is then the vertex group for the point x.\n\nAn important extension of this idea is to consider the fundamental groupoid \\pi_1(X,A) where A\\subset X is a chosen set of \"base points\". Here, one considers only paths whose endpoints belong to A. \\pi_1(X,A) is a sub-groupoid of \\pi_1(X). The set A may be chosen according to the geometry of the situation at hand.\n\nEquivalence relation\n\nIf X is a set with an equivalence relation denoted by infix \\sim, then a groupoid \"representing\" this equivalence relation can be formed as follows:\n* The objects of the groupoid are the elements of X;\n*For any two elements x and y in X, there is a single morphism from x to y if and only if x\\sim y.\n\nGroup action\n\nIf the group G acts on the set X, then we can form the action groupoid (or transformation groupoid) representing this group action as follows:\n*The objects are the elements of X;\n*For any two elements x and y in X, there is a morphism from x to y corresponding to every element g of G such that gx = y;\n*Composition of morphisms interprets the binary operation of G.\n\nMore explicitly, the action groupoid is the set G\\times X with source and target maps s(g,x) x and t(g,x) \n gx.  It is often denoted G \\ltimes X (or X\\rtimes G). Multiplication (or composition) in the groupoid is then (h,y)(g,x) (hg,x) which is defined provided y\ngx.\n\nFor x in X, the vertex group consists of those (g,x) with gx=x, which is just the isotropy subgroup at x for the given action (which is why vertex groups are also called isotropy groups).\n\nAnother way to describe G-sets is the functor category [\\mathrm{Gr},\\mathrm{Set}], where \\mathrm{Gr} is the groupoid (category) with one element and isomorphic to the group G. Indeed, every functor F of this category defines a set X=F(\\mathrm{Gr}) and for every g in G (i.e. for every morphism in \\mathrm{Gr}) induces a bijection F_g : X\\to X. The categorical structure of the functor F assures us that F defines a G-action on the set G. The (unique) representable functor F : \\mathrm{Gr}→\\mathrm{Set} is the Cayley representation of G. In fact, this functor is isomorphic to \\mathrm{Hom}(\\mathrm{Gr},-) and so sends \\mathrm{ob}(\\mathrm{Gr}) to the set \\mathrm{Hom}(\\mathrm{Gr},\\mathrm{Gr}) which is by definition the \"set\" G and the morphism g of \\mathrm{Gr} (i.e. the element g of G) to the permutation F_g of the set G. We deduce from the Yoneda embedding that the group G is isomorphic to the group {F_g\\mid g\\in G}, a subgroup of the group of permutations of G.\n\nFifteen puzzle\n\nThe transformations of the fifteen puzzle form a groupoid (not a group, as not all moves can be composed).Jim Belk (2008) [https://cornellmath.wordpress.com/2008/01/27/puzzles-groups-and-groupoids/ Puzzles, Groups, and Groupoids], The Everything Seminar[http://www.neverendingbooks.org/the-15-puzzle-groupoid-1 The 15-puzzle groupoid (1)], Never Ending Books[http://www.neverendingbooks.org/the-15-puzzle-groupoid-2 The 15-puzzle groupoid (2)], Never Ending Books This groupoid acts on configurations.\n\nMathieu groupoid\n\nThe Mathieu groupoid is a groupoid introduced by John Horton Conway acting on 13 points such that the elements fixing a point form a copy of the Mathieu group M12.\n\nRelation to groups \n\nIf a groupoid has only one object, then the set of its morphisms forms a group. Using the algebraic definition, such a groupoid is literally just a group.Mapping a group to the corresponding groupoid with one object is sometimes called delooping, especially in the context of homotopy theory, see . Many concepts of group theory generalize to groupoids, with the notion of functor replacing that of group homomorphism.\n\nIf x is an object of the groupoid G, then the set of all morphisms from x to x forms a group G(x) (called the vertex group, defined above). If there is a morphism f from x to y, then the groups G(x) and G(y) are isomorphic, with an isomorphism given by the mapping g\\to fgf^{-1}.\n\nEvery connected groupoid (that is, one in which any two objects are connected by at least one morphism) is isomorphic to an action groupoid (as defined above) (G, X) [by connectedness, there will only be one orbit under the action]. If the groupoid is not connected, then it is isomorphic to a disjoint union of groupoids of the above type (possibly with different groups G and sets X for each connected component).\n\nNote that the isomorphism described above is not unique, and there is no natural choice. Choosing such an isomorphism for a connected groupoid essentially amounts to picking one object x_0, a group isomorphism h from G(x_0) to G, and for each x other than x_0, a morphism in G from x_0 to x.\n\nIn category-theoretic terms, each connected component of a groupoid is equivalent (but not isomorphic) to a groupoid with a single object, that is, a single group. Thus any groupoid is equivalent to a multiset of unrelated groups. In other words, for equivalence instead of isomorphism, one need not specify the sets X, only the groups G.\n\nConsider the examples in the previous section. The general linear groupoid is both equivalent and isomorphic to the disjoint union of the various general linear groups GL_n(F). On the other hand:\n*The fundamental groupoid of X is equivalent to the collection of the fundamental groups of each path-connected component of X, but an isomorphism requires specifying the set of points in each component;\n*The set X with the equivalence relation \\sim is equivalent (as a groupoid) to one copy of the trivial group for each equivalence class, but an isomorphism requires specifying what each equivalence class is:\n*The set X equipped with an action of the group G is equivalent (as a groupoid) to one copy of G for each orbit of the action, but an isomorphism requires specifying what set each orbit is.\n\nThe collapse of a groupoid into a mere collection of groups loses some information, even from a category-theoretic point of view, because it is not natural. Thus when groupoids arise in terms of other structures, as in the above examples, it can be helpful to maintain the full groupoid. Otherwise, one must choose a way to view each G(x) in terms of a single group, and this choice can be arbitrary. In our example from topology, you would have to make a coherent choice of paths (or equivalence classes of paths) from each point p to each point q in the same path-connected component.\n\nAs a more illuminating example, the classification of groupoids with one endomorphism does not reduce to purely group theoretic considerations. This is analogous to the fact that the classification of vector spaces with one endomorphism is nontrivial.\n\nMorphisms of groupoids come in more kinds than those of groups: we have, for example,  fibrations, covering morphisms, universal morphisms, and quotient morphisms. Thus a subgroup H of a group G yields an action of G on the set of cosets of H in G and hence a covering morphism p from, say, K to G, where K is a groupoid with vertex groups isomorphic to H. In this way, presentations of the group G can be \"lifted\" to presentations of the groupoid K, and this is a useful way of obtaining information about presentations of the subgroup H. For further information, see the books by Higgins and by Brown in the References.\n\nProperties of the category Grpd \n\n* Grpd both complete and cocomplete\n* Grpd is a cartesian closed category\n\nRelation to Cat \n\nThe inclusion i : \\mathbf{Grpd} \\to \\mathbf{Cat} has both a left and a right adjoint:\n\n \\hom_{\\mathbf{Grpd}}(C[C^{-1}], G) \\cong \\hom_{\\mathbf{Cat}}(C, i(G)) \n \\hom_{\\mathbf{Cat}}(i(G), C) \\cong \\hom_{\\mathbf{Grpd}}(G, \\mathrm{Core}(C)) \n\nHere, C[C^{-1}] denotes the localization of a category that inverts every morphism, and \\mathrm{Core}(C) denotes the subcategory of all isomorphisms.\n\nRelation to sSet \n\nThe nerve functor N :  \\mathbf{Grpd} \\to \\mathbf{sSet} embeds Grpd as a full subcategory of the category of simplicial sets. The nerve of a groupoid is always Kan complex.\n\nThe nerve has a left adjoint\n \\hom_{\\mathbf{Grpd}}(\\pi_1(X), G) \\cong \\hom_{\\mathbf{sSet}}(X, N(G)) \nHere, \\pi_1(X) denotes the fundamental groupoid of the simpicial set X.\n\nLie groupoids and Lie algebroids \n\nWhen studying geometrical objects, the arising groupoids often carry some differentiable structure, turning them into Lie groupoids.\nThese can be studied in terms of Lie algebroids, in analogy to the relation between Lie groups and Lie algebras. Groupoid. http://en.wikipedia.org/?curid=12543."
  }
}
