{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4664",
  "eid" : "cfaab3c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778428156,
  "textBody" : "A Bézier curve  (pronounced) is a parametric curve frequently used in computer graphics and related fields.  Generalizations of Bézier curves to higher dimensions are called Bézier surfaces, of which the Bézier triangle is a special case.\n\nIn vector graphics, Bézier curves are used to model smooth curves that can be scaled indefinitely. \"Paths\", as they are commonly referred to in image manipulation programs,Image manipulation programs such as Inkscape, Adobe Photoshop, and GIMP. are combinations of linked Bézier curves. Paths are not bound by the limits of rasterized images and are intuitive to modify.\n\nBézier curves are also used in the time domain, particularly in animation, user interfaceIn animation applications such as Adobe Flash, Adobe After Effects, Microsoft Expression Blend, Blender, Autodesk Maya and Autodesk 3ds max. design and smoothing cursor trajectory in eye gaze controlled interfaces. For example, a Bézier curve can be used to specify the velocity over time of an object such as an icon moving from A to B, rather than simply moving at a fixed number of pixels per step. When animators or interface designers talk about the \"physics\" or \"feel\" of an operation, they may be referring to the particular Bézier curve used to control the velocity over time of the move in question.\n\nThis also applies to robotics where the motion of a welding arm, for example, should be smooth to avoid unnecessary wear.\n\nThe mathematical basis for Bézier curves—the Bernstein polynomial—had been known since 1912, but the polynomials were not applied to graphics until some 50 years later,\nwhen they were widely publicised by the French engineer Pierre Bézier, who used them to design automobile bodies at Renault.  The study of these curves was however first developed in 1959 by mathematician Paul de Casteljau using de Casteljau's algorithm, a numerically stable method to evaluate Bézier curves at Citroën, another French automaker.\n\nApplications\n\nComputer graphics\n\nBézier curves are widely used in computer graphics to model smooth curves. As the curve is completely contained in the convex hull of its control points, the points can be graphically displayed and used to manipulate the curve intuitively. Affine transformations such as translation and rotation can be applied on the curve by applying the respective transform on the control points of the curve.\n\nQuadratic and cubic Bézier curves are most common. Higher degree curves are more computationally expensive to evaluate. When more complex shapes are needed, low order Bézier curves are patched together, producing a composite Bézier curve. A composite Bézier curve is commonly referred to as a \"path\" in vector graphics languages (like PostScript), vector graphics standards (like SVG) and vector graphics programs (like Adobe Illustrator, CorelDraw and Inkscape). To guarantee smoothness (C1 continuity), the control point at which two curves meet must be on the line between the two control points on either side.\n\nThe simplest method for scan converting (rasterizing) a Bézier curve is to evaluate it at many closely spaced points and scan convert the approximating sequence of line segments. However, this does not guarantee that the rasterized output looks sufficiently smooth, because the points may be spaced too far apart. Conversely it may generate too many points in areas where the curve is close to linear. A common adaptive method is recursive subdivision, in which a curve's control points are checked to see if the curve approximates a straight line to within a small tolerance. If not, the curve is subdivided parametrically into two segments, 0 ≤ t ≤ 0.5 and 0.5 ≤ t ≤ 1, and the same procedure is applied recursively to each half. There are also forward differencing methods, but great care must be taken to analyse error propagation.\n\nAnalytical methods where a Bézier is intersected with each scan line involve finding roots of cubic polynomials (for cubic Béziers) and dealing with multiple roots, so they are not often used in practice.\"Complex Quadratic Bézier Curve on Unit Circle.\" Xuexiang Li and Junxiao Xue School of Software, Zhengzhou University, Zhengzhou, China. Retrieved from www.atlantis-press.com/php/download_paper.php?id=12403\n\nAnimation\n\nIn animation applications, such as Adobe Flash and Synfig, Bézier curves are used to outline, for example, movement. Users outline the wanted path in Bézier curves, and the application creates the needed frames for the object to move along the path.\n\nFor 3D animation Bézier curves are often used to define 3D paths as well as 2D curves for keyframe interpolation.. Bézier curves are now very frequently used to control the animation easing in CSS and JavaScript.\n\nFonts\n\nTrueType fonts use composite Bézier curves composed of quadratic Bézier curves. Modern imaging systems like PostScript, Asymptote, Metafont, and SVG use composite Béziers composed of cubic Bézier curves for drawing curved shapes. OpenType fonts can use either kind, depending on the flavor of the font.\n\nThe internal rendering of all Bézier curves in font or vector graphics renderers will split them recursively up to the point where the curve is flat enough to be drawn as a series of linear or circular segments. The exact splitting algorithm is implementation dependent, only the flatness criteria must be respected to reach the necessary precision and to avoid non-monotonic local changes of curvature. The \"smooth curve\" feature of charts in Microsoft Excel also uses this algorithm.\n\nBecause arcs of circles and ellipses cannot be exactly represented by Bézier curves, they are first approximated by Bézier curves, which are in turn approximated by arcs of circles. This is inefficient as there exists also approximations of all Bézier curves using arcs of circles or ellipses, which can be rendered incrementally with arbitrary precision. Another approach, used by modern hardware graphics adapters with accelerated geometry, can convert exactly all Bézier and conic curves (or surfaces) into NURBS, that can be rendered incrementally without first splitting the curve recursively to reach the necessary flatness condition. This approach also allows preserving the curve definition under all linear or perspective 2D and 3D transforms and projections.\n\nFont engines, like FreeType, draw the font's curves (and lines) on a pixellated surface using a process known as font rasterization.[http://www.freetype.org/freetype2/docs/glyphs/glyphs-6.html FreeType Glyph Conventions], David Turner + Freetype Development Team, Freetype.org, retr May 2011\n\nSpecific cases\n\nA Bézier curve is defined by a set of control points P0 through Pn, where n is called its order (n = 1 for linear, 2 for quadratic, etc.). The first and last control points are always the end points of the curve; however, the intermediate control points (if any) generally do not lie on the curve. The sums in the following sections are to be understood as affine combinations, the coefficients sum to 1.\n\nLinear Bézier curves\n\nGiven distinct points P0 and P1, a linear Bézier curve is simply a straight line between those two points. The curve is given by\n\n\\mathbf{B}(t)\\mathbf{P}_0 + t(\\mathbf{P}_1-\\mathbf{P}_0)\n(1-t)\\mathbf{P}_0 + t\\mathbf{P}_1 \\mbox{ , } 0 \\le t \\le 1\nand is equivalent to linear interpolation.\n\nQuadratic Bézier curves\n\nA quadratic Bézier curve is the path traced by the function B(t), given points P0, P1, and P2,\n\n\\mathbf{B}(t) = (1 - t)[(1 - t) \\mathbf P_0 + t \\mathbf P_1] + t [(1 - t) \\mathbf P_1 + t \\mathbf P_2] \\mbox{ , } 0 \\le t \\le 1,\n\nwhich can be interpreted as the linear interpolant of corresponding points on the linear Bézier curves from P0 to P1 and from P1 to P2 respectively. Rearranging the preceding equation yields:\n\n\\mathbf{B}(t) = (1 - t)^{2}\\mathbf{P}_0 + 2(1 - t)t\\mathbf{P}_1 + t^{2}\\mathbf{P}_2 \\mbox{ , } 0 \\le t \\le 1.\n\nThe derivative of the Bézier curve with respect to t is\n\n\\mathbf{B}'(t) = 2 (1 - t) (\\mathbf{P}_1 - \\mathbf{P}_0) + 2 t (\\mathbf{P}_2 - \\mathbf{P}_1) \\,.\n\nfrom which it can be concluded that the tangents to the curve at P0 and P2 intersect at P1. As t increases from 0 to 1, the curve departs from P0 in the direction of P1, then bends to arrive at P2 from the direction of P1.\n\nThe second derivative of the Bézier curve with respect to t is\n\n\\mathbf{B}(t) = 2(\\mathbf{P}_2 - 2 \\mathbf{P}_1 + \\mathbf{P}_0) \\,.\n\nCubic Bézier curves\n\nFour points P0, P1, P2 and P3 in the plane or in higher-dimensional space define a cubic Bézier curve.\nThe curve starts at P0 going toward P1 and arrives at P3 coming from the direction of P2. Usually, it will not pass through P1 or P2; these points are only there to provide directional information. The distance between P1 and P2 determines \"how far\" and \"how fast\" the curve moves towards P1 before turning towards P2.\n\nWriting BPi,Pj,Pk(t) for the quadratic Bézier curve defined by points Pi, Pj, and Pk, the cubic Bézier curve can be defined as an affine combination of two quadratic Bézier curves:\n\n\\mathbf{B}(t)=(1-t)\\mathbf{B}_{\\mathbf P_0,\\mathbf P_1,\\mathbf P_2}(t) + t \\mathbf{B}_{\\mathbf P_1,\\mathbf P_2,\\mathbf P_3}(t) \\mbox{ , } 0 \\le t \\le 1.\n\nThe explicit form of the curve is:\n\n\\mathbf{B}(t)=(1-t)^3\\mathbf{P}_0+3(1-t)^2t\\mathbf{P}_1+3(1-t)t^2\\mathbf{P}_2+t^3\\mathbf{P}_3 \\mbox{ , } 0 \\le t \\le 1.\n\nFor some choices of P1 and P2 the curve may intersect itself, or contain a cusp.\n\nAny series of any 4 distinct points can be converted to a cubic Bézier curve that goes through all 4 points in order.\nGiven the starting and ending point of some cubic Bézier curve, and the points along the curve corresponding to t 1/3 and t \n 2/3, the control points for the original Bézier curve can be recovered.\nJohn Burkardt.\n[https://web.archive.org/web/20131225210855/http://people.sc.fsu.edu/~jburkardt/html/bezier_interpolation.html \"Forcing Bezier Interpolation (from web.archive.org 2013-12-25)\"].\n\nThe derivative of the cubic Bézier curve with respect to t is\n\\mathbf{B}'(t) = 3(1-t)^2(\\mathbf{P}_1 - \\mathbf{P}_0) + 6(1-t)t(\\mathbf{P}_2 - \\mathbf{P}_1) + 3t^2(\\mathbf{P}_3 - \\mathbf{P}_2) \\,.\n\nThe second derivative of the Bézier curve with respect to t is\n\\mathbf{B}(t) = 6(1-t)(\\mathbf{P}_2 - 2 \\mathbf{P}_1 + \\mathbf{P}_0) +  6t(\\mathbf{P}_3 - 2 \\mathbf{P}_2 + \\mathbf{P}_1) \\,.\n\nGeneral definition\n\nBézier curves can be defined for any degree n.\n\nRecursive definition\n\nA recursive definition for the Bézier curve of degree n expresses it as a point-to-point linear combination (linear interpolation) of a pair of corresponding points in two Bézier curves of degree n − 1.\n\nLet \\mathbf{B}_{\\mathbf{P}_0\\mathbf{P}_1\\ldots\\mathbf{P}_n} denote the Bézier curve determined by any selection of points P0, P1, ..., Pn.  Then to start,\n\n\\mathbf{B}_{\\mathbf{P}_0}(t) = \\mathbf{P}_0 \\text{, and}\n\n\\mathbf{B}(t) \\mathbf{B}_{\\mathbf{P}_0\\mathbf{P}_1\\ldots\\mathbf{P}_n}(t) \n (1-t)\\mathbf{B}_{\\mathbf{P}_0\\mathbf{P}_1\\ldots\\mathbf{P}_{n-1}}(t) + t\\mathbf{B}_{\\mathbf{P}_1\\mathbf{P}_2\\ldots\\mathbf{P}_n}(t)\n\nThis recursion is elucidated in the animations below.\n\nExplicit definition\n\nThe formula can be expressed explicitly as follows:\n\n\\begin{align}\n  \\mathbf{B}(t) &\\sum_{i\n0}^n {n\\choose i}(1 - t)^{n - i}t^i\\mathbf{P}_i \\\\\n                &=(1 - t)^n\\mathbf{P}_0 + {n\\choose 1}(1 - t)^{n - 1}t\\mathbf{P}_1 + \\cdots + {n\\choose n - 1}(1 - t)t^{n - 1}\\mathbf{P}_{n - 1} + t^n\\mathbf{P}_n && 0 \\leqslant t \\leqslant 1\n\\end{align}\n\nwhere \\scriptstyle {n \\choose i} are the binomial coefficients.\n\nFor example, for n = 5:\n\n\\begin{align}\n\\mathbf{B}(t) &= (1 - t)^5\\mathbf{P}_0 + 5t(1 - t)^4\\mathbf{P}_1 + 10t^2(1 - t)^3 \\mathbf{P}_2  + 10t^3 (1-t)^2 \\mathbf{P}_3 + 5t^4(1-t) \\mathbf{P}_4 + t^5 \\mathbf{P}_5 && 0 \\leqslant t \\leqslant 1\n\\end{align}\n\nTerminology\n\nSome terminology is associated with these parametric curves. We have\n\n\\mathbf{B}(t) \\sum_{i\n0}^n b_{i, n}(t)\\mathbf{P}_i,\\quad 0 \\le t \\le 1\n\nwhere the polynomials\n\nb_{i,n}(t) {n\\choose i} t^i (1 - t)^{n - i},\\quad i \n 0, \\ldots, n\n\nare known as Bernstein basis polynomials of degree n.\n\nNote that t0  1, (1 − t)0 \n 1, and that the binomial coefficient, \\scriptstyle {n \\choose i}, also expressed as ^n{\\mathbf{C}}_i  or {\\mathbf{C}_i}^n , is:\n\n{n \\choose i} = \\frac{n!}{i!(n - i)!}\n\nThe points Pi are called control points for the Bézier curve. The polygon formed by connecting the Bézier points with lines, starting with P0 and finishing with Pn, is called the Bézier polygon (or control polygon). The convex hull of the Bézier polygon contains the Bézier curve.\n\nPolynomial form\n\nSometimes it is desirable to express the Bézier curve as a polynomial instead of a sum of less straightforward Bernstein polynomials. Application of the binomial theorem to the definition of the curve followed by some rearrangement will yield:\n\n\\mathbf{B}(t) \\sum_{j \n 0}^n {t^j \\mathbf{C}_j}\n\nwhere\n\n\\mathbf{C}_j \\frac{n!}{(n - j)!} \\sum_{i \n 0}^j \\frac{(-1)^{i + j} \\mathbf{P}_i}{i! (j - i)!} \\prod_{m \n 0}^{j - 1} (n - m) \\sum_{i = 0}^j \\frac{(-1)^{i + j} \\mathbf{P}_i}{i! (j - i)!}\n.\n\nThis could be practical if \\mathbf{C}_j can be computed prior to many evaluations of \\mathbf{B}(t); however one should use caution as high order curves may lack numeric stability (de Casteljau's algorithm should be used if this occurs). Note that the empty product is 1.\n\nProperties\n\n* The curve begins at P0 and ends at Pn; this is the so-called endpoint interpolation property.\n* The curve is a straight line if and only if all the control points are collinear.\n* The start and end of the curve is tangent to the first and last section of the Bézier polygon, respectively.\n* A curve can be split at any point into two subcurves, or into arbitrarily many subcurves, each of which is also a Bézier curve.\n* Some curves that seem simple, such as the circle, cannot be described exactly by a Bézier or piecewise Bézier curve; though a four-piece cubic Bézier curve can approximate a circle (see composite Bézier curve), with a maximum radial error of less than one part in a thousand, when each inner control point (or offline point) is the distance \\textstyle\\frac{4\\left(\\sqrt {2}-1\\right)}{3} horizontally or vertically from an outer control point on a unit circle.  More generally, an n-piece cubic Bézier curve can approximate a circle, when each inner control point is the distance \\textstyle\\frac{4}{3}\\tan(t/4) from an outer control point on a unit circle, where t is 360/n degrees, and n > 2.\n* Every quadratic Bézier curve is also a cubic Bézier curve, and more generally, every degree n Bézier curve is also a degree m curve for any m > n. In detail, a degree n curve with control points P0, …, Pn is equivalent (including the parametrization) to the degree n + 1 curve with control points P'0, …, P'n + 1, where \\mathbf P'_k=\\tfrac{k}{n+1}\\mathbf P_{k-1}+\\left(1-\\tfrac{k}{n+1}\\right)\\mathbf P_k.\n* Bézier curves have the variation diminishing property. What this means in intuitive terms is that a Bézier curves does not \"undulate\" more than the polygon of its control points, and may actually \"undulate\" less than that.\n* There is no local control in degree n Bézier curves—meaning that any change to a control point requires recalculation of and thus affects the aspect of the entire curve, \"although the further that one is from the control point that was changed, the smaller is the change in the curve.\"\n\nSecond order curve is a parabolic segment\n\nA quadratic Bézier curve is also a segment of a parabola. As a parabola is a conic section, some sources refer to quadratic Béziers as \"conic arcs\". With reference to the figure on the right, the important features of the parabola can be derived as follows:Duncan Marsh, [https://www.amazon.co.uk/Geometry-Computer-Graphics-Undergraduate-Mathematics/dp/1852338016 Applied Geometry for Computer Graphics and CAD], Springer Undergraduate Mathematics Series, 2005\n\n# Tangents to the parabola at the end-points of the curve (A and B) intersect at its control point (C).\n# If D is the midpoint of AB, the tangent to the curve which is perpendicular to CD (dashed cyan line) defines its vertex (V). Its axis of symmetry (dash-dot cyan) passes through V and is perpendicular to the tangent.\n# E is either point on the curve with a tangent at 45° to CD (dashed green). If G is the intersection of this tangent and the axis, the line passing through G and perpendicular to CD is the directrix (solid green).\n# The focus (F) is at the intersection of the axis and a line passing through E and perpendicular to CD (dotted yellow). The latus rectum is the line segment within the curve (solid yellow).\n\nDerivative\n\nThe derivative for a curve of order n is\n\n\\mathbf{B}'(t) n \\sum_{i\n0}^{n-1} b_{i,n-1}(t) (\\mathbf{P}_{i+1} - \\mathbf{P}_i)\n\nConstructing Bézier curves\n\nLinear curves\n\nThe t in the function for a linear Bézier curve can be thought of as describing how far B(t) is from P0 to P1. For example, when t=0.25, B(t) is one quarter of the way from point P0 to P1. As t varies from 0 to 1, B(t) describes a straight line from P0 to P1.\n\nQuadratic curves\n\nFor quadratic Bézier curves one can construct intermediate points Q0 and Q1 such that as t varies from 0 to 1:\n* Point Q0(t) varies from P0 to P1 and describes a linear Bézier curve.\n* Point Q1(t) varies from P1 to P2 and describes a linear Bézier curve.\n* Point B(t) is interpolated linearly between Q0(t) to Q1(t) and describes a quadratic Bézier curve.\n\nHigher-order curves\n\nFor higher-order curves one needs correspondingly more intermediate points. For cubic curves one can construct intermediate points Q0,  Q1, and Q2 that describe linear Bézier curves, and points R0 & R1 that describe quadratic Bézier curves:\n\nFor fourth-order curves one can construct intermediate points Q0,  Q1, Q2 & Q3 that describe linear Bézier curves, points R0, R1 & R2 that describe quadratic Bézier curves, and points S0 & S1 that describe cubic Bézier curves:\n\nFor fifth-order curves, one can construct similar intermediate points.\n\nThese representations rest on the process used in De Casteljau's algorithm to calculate Bézier curves.\n\nOffsets (a.k.a. stroking) of Bézier curves \n\nThe curve at a fixed offset from a given Bézier curve, called an offset or parallel curve in mathematics (lying \"parallel\" to the original curve, like the offset between rails in a railroad track), cannot be exactly formed by a Bézier curve (except in some trivial cases). In general, the two-sided offset curve of a cubic Bézier is a 10th-order algebraic curvehttp://www.slideshare.net/Mark_Kilgard/22pathrender, p. 28 and more generally for a Bézier of degree n the two-sided offset curve is an algebraic curve of degree 4n-2.[http://faculty.engineering.ucdavis.edu/farouki/wp-content/uploads/sites/41/2013/02/Introduction-to-PH-curves.pdf, particularly p. 16 \"taxonomy of offset curves\"] However, there are heuristic methods that usually give an adequate approximation for practical purposes.For example: [http://citeseerx.ist.psu.edu/viewdoc/summary?doi\n10.1.1.43.1724] or [http://www.google.com/patents/US20110285719]. For a survey see [http://www.computer.org/csdl/mags/cg/1997/03/mcg1997030062.pdf].\n\nIn the field of vector graphics, painting two symmetrically distanced offset curves is called stroking (the Bézier curve or in general a path of several Bézier segments). The conversion from offset curves to filled Bézier contours is of practical importance in converting fonts defined in METAFONT, which allows stroking of Bézier curves, to the more widely used PostScript type 1 fonts, which only allow (for efficiency purposes) the mathematically simpler operation of filling a contour defined by (non-self-intersecting) Bézier curves.[https://www.tug.org/TUGboat/tb16-3/tb48kinc.pdf MetaFog: Converting Metafont shapes to contours]\n\nDegree elevation\n\nA Bézier curve of degree n can be converted into a Bézier curve of degree n + 1 with the same shape. This is useful if software supports Bézier curves only of specific degree. For example, systems that can only work with cubic Bézier curves can implicitly work with quadratic curves by using their equivalent cubic representation.\n\nTo do degree elevation, we use the equality \\mathbf{B}(t) = (1-t)\\mathbf{B}(t) + t\\mathbf{B}(t). Each component \\mathbf{b}_{i,n}(t)\\mathbf{P}_i is multiplied by (1 − t) and t, thus increasing a degree by one, without changing the value. Here is the example of increasing degree from 2 to 3.\n\n\\begin{align}\n(1 - t)^2 \\mathbf{P}_0 + 2(1 - t)t\\mathbf{P}_1 + t^2 \\mathbf{P}_2 &= (1 - t)^3 \\mathbf{P}_0  + 2(1 - t)^2 t\\mathbf{P}_1 + (1 - t)t^2 \\mathbf{P}_2 + (1 - t)^{2}t\\mathbf{P}_0 + 2(1 - t)t^2 \\mathbf{P}_1  + t^3 \\mathbf{P}_2 \\\\\n  &= (1 - t)^3 \\mathbf{P}_0 + (1 - t)^2 t   \\left( \\mathbf{P}_0 + 2\\mathbf{P}_1\\right) + (1 - t)   t^2 \\left(2\\mathbf{P}_1 +  \\mathbf{P}_2\\right) + t^{3}\\mathbf{P}_2 \\\\\n  &= (1 - t)^3 \\mathbf{P}_0 + 3(1 - t)^2 t   \\tfrac{1}{3} \\left(  \\mathbf{P}_0 + 2\\mathbf{P}_1 \\right) + 3(1 - t)   t^2 \\tfrac{1}{3} \\left( 2\\mathbf{P}_1 +  \\mathbf{P}_2 \\right) + t^{3}\\mathbf{P}_2\n\\end{align}\n\nFor arbitrary n we use equalities\n\n\\begin{cases}  {n + 1 \\choose i}(1 - t)\\mathbf{b}_{i, n} {n \\choose i} \\mathbf{b}_{i, n + 1} \\\\  {n + 1 \\choose i + 1} t\\mathbf{b}_{i, n} \n {n \\choose i} \\mathbf{b}_{i + 1, n + 1} \\end{cases} \\quad \\Rightarrow \\quad \\begin{cases}  (1 - t)\\mathbf{b}_{i, n} \\frac{n + 1 - i}{n + 1} \\mathbf{b}_{i, n + 1} \\\\ t\\mathbf{b}_{i, n} \n \\frac{i + 1}{n + 1} \\mathbf{b}_{i + 1, n + 1} \\end{cases} \n\nTherefore:\n\n\\begin{align}\n\\mathbf{B}(t) &(1 - t)\\sum_{i\n0}^n \\mathbf{b}_{i, n}(t)\\mathbf{P}_i + t\\sum_{i=0}^n \\mathbf{b}_{i, n}(t)\\mathbf{P}_i \\\\\n                &\\sum_{i\n0}^n \\frac{n + 1 - i}{n + 1}\\mathbf{b}_{i, n + 1}(t)\\mathbf{P}_i + \\sum_{i=0}^n \\frac{i + 1}{n + 1}\\mathbf{b}_{i + 1, n + 1}(t)\\mathbf{P}_i \\\\\n                &\\sum_{i\n0}^{n + 1} \\left(\\frac{i}{n + 1}\\mathbf{P}_{i - 1} + \\frac{n + 1 - i}{n + 1}\\mathbf{P}_i\\right) \\mathbf{b}_{i, n + 1}(t) \\\\\n                &\\sum_{i\n0}^{n + 1} \\mathbf{b}_{i, n + 1}(t)\\mathbf{P'}_i\n\\end{align}\n\nintroducing arbitrary \\mathbf{P}_{-1} and \\mathbf{P}_{n + 1}.\n\nTherefore, new control points are \n\n\\mathbf{P'}_i \\frac{i}{n + 1}\\mathbf{P}_{i - 1} + \\frac{n + 1 - i}{n + 1}\\mathbf{P}_i,\\quad i\n0, \\ldots, n + 1\n\nRepeated Degree Elevation\n\nThe concept of Degree Elevation can be repeated on a control polygon R to get a sequence of control polygons R,R1,R2, and so on. After r degree elevations, the polygon Rr has the vertices P0,r,P1,r,P2,r,...,Pn+r,r given by \n\n\\mathbf{P}_{i,r} \\sum_{j\n0}^n \\mathbf{P}_j \\tbinom nj \\frac{\\tbinom{r}{i-j}}{\\tbinom{n+r}{i}}\n\nIt can also be shown that for the underlying Bézier curve B,\n\n\\mathbf{\\lim_{r \\to \\infty}R_r} = \\mathbf{B}\n\nRational Bézier curves\n\nThe rational Bézier curve adds adjustable weights to provide closer approximations to arbitrary shapes. The numerator is a weighted Bernstein-form Bézier curve and the denominator is a weighted sum of Bernstein polynomials. Rational Bézier curves can, among other uses, be used to represent segments of conic sections exactly, including circular arcs.\n\nGiven n + 1 control points Pi, the rational Bézier curve can be described by:\n\n\\mathbf{B}(t) =\n\\frac{\n\\sum_{i=0}^n b_{i,n}(t) \\mathbf{P}_{i}w_i\n}\n{\n\\sum_{i=0}^n b_{i,n}(t) w_i\n}\n\nor simply\n\n\\mathbf{B}(t) =\n\\frac{\n\\sum_{i=0}^n {n \\choose i} t^i (1-t)^{n-i}\\mathbf{P}_{i}w_i\n}\n{\n\\sum_{i=0}^n {n \\choose i} t^i (1-t)^{n-i}w_i\n}.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bézier curve" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4664" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A Bézier curve  (pronounced) is a parametric curve frequently used in computer graphics and related fields.  Generalizations of Bézier curves to higher dimensions are called Bézier surfaces, of which the Bézier triangle is a special case.\n\nIn vector graphics, Bézier curves are used to model smooth curves that can be scaled indefinitely. \"Paths\", as they are commonly referred to in image manipulation programs,Image manipulation programs such as Inkscape, Adobe Photoshop, and GIMP. are combinations of linked Bézier curves. Paths are not bound by the limits of rasterized images and are intuitive to modify.\n\nBézier curves are also used in the time domain, particularly in animation, user interfaceIn animation applications such as Adobe Flash, Adobe After Effects, Microsoft Expression Blend, Blender, Autodesk Maya and Autodesk 3ds max. design and smoothing cursor trajectory in eye gaze controlled interfaces. For example, a Bézier curve can be used to specify the velocity over time of an object such as an icon moving from A to B, rather than simply moving at a fixed number of pixels per step. When animators or interface designers talk about the \"physics\" or \"feel\" of an operation, they may be referring to the particular Bézier curve used to control the velocity over time of the move in question.\n\nThis also applies to robotics where the motion of a welding arm, for example, should be smooth to avoid unnecessary wear.\n\nThe mathematical basis for Bézier curves—the Bernstein polynomial—had been known since 1912, but the polynomials were not applied to graphics until some 50 years later,\nwhen they were widely publicised by the French engineer Pierre Bézier, who used them to design automobile bodies at Renault.  The study of these curves was however first developed in 1959 by mathematician Paul de Casteljau using de Casteljau's algorithm, a numerically stable method to evaluate Bézier curves at Citroën, another French automaker.\n\nApplications\n\nComputer graphics\n\nBézier curves are widely used in computer graphics to model smooth curves. As the curve is completely contained in the convex hull of its control points, the points can be graphically displayed and used to manipulate the curve intuitively. Affine transformations such as translation and rotation can be applied on the curve by applying the respective transform on the control points of the curve.\n\nQuadratic and cubic Bézier curves are most common. Higher degree curves are more computationally expensive to evaluate. When more complex shapes are needed, low order Bézier curves are patched together, producing a composite Bézier curve. A composite Bézier curve is commonly referred to as a \"path\" in vector graphics languages (like PostScript), vector graphics standards (like SVG) and vector graphics programs (like Adobe Illustrator, CorelDraw and Inkscape). To guarantee smoothness (C1 continuity), the control point at which two curves meet must be on the line between the two control points on either side.\n\nThe simplest method for scan converting (rasterizing) a Bézier curve is to evaluate it at many closely spaced points and scan convert the approximating sequence of line segments. However, this does not guarantee that the rasterized output looks sufficiently smooth, because the points may be spaced too far apart. Conversely it may generate too many points in areas where the curve is close to linear. A common adaptive method is recursive subdivision, in which a curve's control points are checked to see if the curve approximates a straight line to within a small tolerance. If not, the curve is subdivided parametrically into two segments, 0 ≤ t ≤ 0.5 and 0.5 ≤ t ≤ 1, and the same procedure is applied recursively to each half. There are also forward differencing methods, but great care must be taken to analyse error propagation.\n\nAnalytical methods where a Bézier is intersected with each scan line involve finding roots of cubic polynomials (for cubic Béziers) and dealing with multiple roots, so they are not often used in practice.\"Complex Quadratic Bézier Curve on Unit Circle.\" Xuexiang Li and Junxiao Xue School of Software, Zhengzhou University, Zhengzhou, China. Retrieved from www.atlantis-press.com/php/download_paper.php?id=12403\n\nAnimation\n\nIn animation applications, such as Adobe Flash and Synfig, Bézier curves are used to outline, for example, movement. Users outline the wanted path in Bézier curves, and the application creates the needed frames for the object to move along the path.\n\nFor 3D animation Bézier curves are often used to define 3D paths as well as 2D curves for keyframe interpolation.. Bézier curves are now very frequently used to control the animation easing in CSS and JavaScript.\n\nFonts\n\nTrueType fonts use composite Bézier curves composed of quadratic Bézier curves. Modern imaging systems like PostScript, Asymptote, Metafont, and SVG use composite Béziers composed of cubic Bézier curves for drawing curved shapes. OpenType fonts can use either kind, depending on the flavor of the font.\n\nThe internal rendering of all Bézier curves in font or vector graphics renderers will split them recursively up to the point where the curve is flat enough to be drawn as a series of linear or circular segments. The exact splitting algorithm is implementation dependent, only the flatness criteria must be respected to reach the necessary precision and to avoid non-monotonic local changes of curvature. The \"smooth curve\" feature of charts in Microsoft Excel also uses this algorithm.\n\nBecause arcs of circles and ellipses cannot be exactly represented by Bézier curves, they are first approximated by Bézier curves, which are in turn approximated by arcs of circles. This is inefficient as there exists also approximations of all Bézier curves using arcs of circles or ellipses, which can be rendered incrementally with arbitrary precision. Another approach, used by modern hardware graphics adapters with accelerated geometry, can convert exactly all Bézier and conic curves (or surfaces) into NURBS, that can be rendered incrementally without first splitting the curve recursively to reach the necessary flatness condition. This approach also allows preserving the curve definition under all linear or perspective 2D and 3D transforms and projections.\n\nFont engines, like FreeType, draw the font's curves (and lines) on a pixellated surface using a process known as font rasterization.[http://www.freetype.org/freetype2/docs/glyphs/glyphs-6.html FreeType Glyph Conventions], David Turner + Freetype Development Team, Freetype.org, retr May 2011\n\nSpecific cases\n\nA Bézier curve is defined by a set of control points P0 through Pn, where n is called its order (n = 1 for linear, 2 for quadratic, etc.). The first and last control points are always the end points of the curve; however, the intermediate control points (if any) generally do not lie on the curve. The sums in the following sections are to be understood as affine combinations, the coefficients sum to 1.\n\nLinear Bézier curves\n\nGiven distinct points P0 and P1, a linear Bézier curve is simply a straight line between those two points. The curve is given by\n\n\\mathbf{B}(t)\\mathbf{P}_0 + t(\\mathbf{P}_1-\\mathbf{P}_0)\n(1-t)\\mathbf{P}_0 + t\\mathbf{P}_1 \\mbox{ , } 0 \\le t \\le 1\nand is equivalent to linear interpolation.\n\nQuadratic Bézier curves\n\nA quadratic Bézier curve is the path traced by the function B(t), given points P0, P1, and P2,\n\n\\mathbf{B}(t) = (1 - t)[(1 - t) \\mathbf P_0 + t \\mathbf P_1] + t [(1 - t) \\mathbf P_1 + t \\mathbf P_2] \\mbox{ , } 0 \\le t \\le 1,\n\nwhich can be interpreted as the linear interpolant of corresponding points on the linear Bézier curves from P0 to P1 and from P1 to P2 respectively. Rearranging the preceding equation yields:\n\n\\mathbf{B}(t) = (1 - t)^{2}\\mathbf{P}_0 + 2(1 - t)t\\mathbf{P}_1 + t^{2}\\mathbf{P}_2 \\mbox{ , } 0 \\le t \\le 1.\n\nThe derivative of the Bézier curve with respect to t is\n\n\\mathbf{B}'(t) = 2 (1 - t) (\\mathbf{P}_1 - \\mathbf{P}_0) + 2 t (\\mathbf{P}_2 - \\mathbf{P}_1) \\,.\n\nfrom which it can be concluded that the tangents to the curve at P0 and P2 intersect at P1. As t increases from 0 to 1, the curve departs from P0 in the direction of P1, then bends to arrive at P2 from the direction of P1.\n\nThe second derivative of the Bézier curve with respect to t is\n\n\\mathbf{B}(t) = 2(\\mathbf{P}_2 - 2 \\mathbf{P}_1 + \\mathbf{P}_0) \\,.\n\nCubic Bézier curves\n\nFour points P0, P1, P2 and P3 in the plane or in higher-dimensional space define a cubic Bézier curve.\nThe curve starts at P0 going toward P1 and arrives at P3 coming from the direction of P2. Usually, it will not pass through P1 or P2; these points are only there to provide directional information. The distance between P1 and P2 determines \"how far\" and \"how fast\" the curve moves towards P1 before turning towards P2.\n\nWriting BPi,Pj,Pk(t) for the quadratic Bézier curve defined by points Pi, Pj, and Pk, the cubic Bézier curve can be defined as an affine combination of two quadratic Bézier curves:\n\n\\mathbf{B}(t)=(1-t)\\mathbf{B}_{\\mathbf P_0,\\mathbf P_1,\\mathbf P_2}(t) + t \\mathbf{B}_{\\mathbf P_1,\\mathbf P_2,\\mathbf P_3}(t) \\mbox{ , } 0 \\le t \\le 1.\n\nThe explicit form of the curve is:\n\n\\mathbf{B}(t)=(1-t)^3\\mathbf{P}_0+3(1-t)^2t\\mathbf{P}_1+3(1-t)t^2\\mathbf{P}_2+t^3\\mathbf{P}_3 \\mbox{ , } 0 \\le t \\le 1.\n\nFor some choices of P1 and P2 the curve may intersect itself, or contain a cusp.\n\nAny series of any 4 distinct points can be converted to a cubic Bézier curve that goes through all 4 points in order.\nGiven the starting and ending point of some cubic Bézier curve, and the points along the curve corresponding to t 1/3 and t \n 2/3, the control points for the original Bézier curve can be recovered.\nJohn Burkardt.\n[https://web.archive.org/web/20131225210855/http://people.sc.fsu.edu/~jburkardt/html/bezier_interpolation.html \"Forcing Bezier Interpolation (from web.archive.org 2013-12-25)\"].\n\nThe derivative of the cubic Bézier curve with respect to t is\n\\mathbf{B}'(t) = 3(1-t)^2(\\mathbf{P}_1 - \\mathbf{P}_0) + 6(1-t)t(\\mathbf{P}_2 - \\mathbf{P}_1) + 3t^2(\\mathbf{P}_3 - \\mathbf{P}_2) \\,.\n\nThe second derivative of the Bézier curve with respect to t is\n\\mathbf{B}(t) = 6(1-t)(\\mathbf{P}_2 - 2 \\mathbf{P}_1 + \\mathbf{P}_0) +  6t(\\mathbf{P}_3 - 2 \\mathbf{P}_2 + \\mathbf{P}_1) \\,.\n\nGeneral definition\n\nBézier curves can be defined for any degree n.\n\nRecursive definition\n\nA recursive definition for the Bézier curve of degree n expresses it as a point-to-point linear combination (linear interpolation) of a pair of corresponding points in two Bézier curves of degree n − 1.\n\nLet \\mathbf{B}_{\\mathbf{P}_0\\mathbf{P}_1\\ldots\\mathbf{P}_n} denote the Bézier curve determined by any selection of points P0, P1, ..., Pn.  Then to start,\n\n\\mathbf{B}_{\\mathbf{P}_0}(t) = \\mathbf{P}_0 \\text{, and}\n\n\\mathbf{B}(t) \\mathbf{B}_{\\mathbf{P}_0\\mathbf{P}_1\\ldots\\mathbf{P}_n}(t) \n (1-t)\\mathbf{B}_{\\mathbf{P}_0\\mathbf{P}_1\\ldots\\mathbf{P}_{n-1}}(t) + t\\mathbf{B}_{\\mathbf{P}_1\\mathbf{P}_2\\ldots\\mathbf{P}_n}(t)\n\nThis recursion is elucidated in the animations below.\n\nExplicit definition\n\nThe formula can be expressed explicitly as follows:\n\n\\begin{align}\n  \\mathbf{B}(t) &\\sum_{i\n0}^n {n\\choose i}(1 - t)^{n - i}t^i\\mathbf{P}_i \\\\\n                &=(1 - t)^n\\mathbf{P}_0 + {n\\choose 1}(1 - t)^{n - 1}t\\mathbf{P}_1 + \\cdots + {n\\choose n - 1}(1 - t)t^{n - 1}\\mathbf{P}_{n - 1} + t^n\\mathbf{P}_n && 0 \\leqslant t \\leqslant 1\n\\end{align}\n\nwhere \\scriptstyle {n \\choose i} are the binomial coefficients.\n\nFor example, for n = 5:\n\n\\begin{align}\n\\mathbf{B}(t) &= (1 - t)^5\\mathbf{P}_0 + 5t(1 - t)^4\\mathbf{P}_1 + 10t^2(1 - t)^3 \\mathbf{P}_2  + 10t^3 (1-t)^2 \\mathbf{P}_3 + 5t^4(1-t) \\mathbf{P}_4 + t^5 \\mathbf{P}_5 && 0 \\leqslant t \\leqslant 1\n\\end{align}\n\nTerminology\n\nSome terminology is associated with these parametric curves. We have\n\n\\mathbf{B}(t) \\sum_{i\n0}^n b_{i, n}(t)\\mathbf{P}_i,\\quad 0 \\le t \\le 1\n\nwhere the polynomials\n\nb_{i,n}(t) {n\\choose i} t^i (1 - t)^{n - i},\\quad i \n 0, \\ldots, n\n\nare known as Bernstein basis polynomials of degree n.\n\nNote that t0  1, (1 − t)0 \n 1, and that the binomial coefficient, \\scriptstyle {n \\choose i}, also expressed as ^n{\\mathbf{C}}_i  or {\\mathbf{C}_i}^n , is:\n\n{n \\choose i} = \\frac{n!}{i!(n - i)!}\n\nThe points Pi are called control points for the Bézier curve. The polygon formed by connecting the Bézier points with lines, starting with P0 and finishing with Pn, is called the Bézier polygon (or control polygon). The convex hull of the Bézier polygon contains the Bézier curve.\n\nPolynomial form\n\nSometimes it is desirable to express the Bézier curve as a polynomial instead of a sum of less straightforward Bernstein polynomials. Application of the binomial theorem to the definition of the curve followed by some rearrangement will yield:\n\n\\mathbf{B}(t) \\sum_{j \n 0}^n {t^j \\mathbf{C}_j}\n\nwhere\n\n\\mathbf{C}_j \\frac{n!}{(n - j)!} \\sum_{i \n 0}^j \\frac{(-1)^{i + j} \\mathbf{P}_i}{i! (j - i)!} \\prod_{m \n 0}^{j - 1} (n - m) \\sum_{i = 0}^j \\frac{(-1)^{i + j} \\mathbf{P}_i}{i! (j - i)!}\n.\n\nThis could be practical if \\mathbf{C}_j can be computed prior to many evaluations of \\mathbf{B}(t); however one should use caution as high order curves may lack numeric stability (de Casteljau's algorithm should be used if this occurs). Note that the empty product is 1.\n\nProperties\n\n* The curve begins at P0 and ends at Pn; this is the so-called endpoint interpolation property.\n* The curve is a straight line if and only if all the control points are collinear.\n* The start and end of the curve is tangent to the first and last section of the Bézier polygon, respectively.\n* A curve can be split at any point into two subcurves, or into arbitrarily many subcurves, each of which is also a Bézier curve.\n* Some curves that seem simple, such as the circle, cannot be described exactly by a Bézier or piecewise Bézier curve; though a four-piece cubic Bézier curve can approximate a circle (see composite Bézier curve), with a maximum radial error of less than one part in a thousand, when each inner control point (or offline point) is the distance \\textstyle\\frac{4\\left(\\sqrt {2}-1\\right)}{3} horizontally or vertically from an outer control point on a unit circle.  More generally, an n-piece cubic Bézier curve can approximate a circle, when each inner control point is the distance \\textstyle\\frac{4}{3}\\tan(t/4) from an outer control point on a unit circle, where t is 360/n degrees, and n > 2.\n* Every quadratic Bézier curve is also a cubic Bézier curve, and more generally, every degree n Bézier curve is also a degree m curve for any m > n. In detail, a degree n curve with control points P0, …, Pn is equivalent (including the parametrization) to the degree n + 1 curve with control points P'0, …, P'n + 1, where \\mathbf P'_k=\\tfrac{k}{n+1}\\mathbf P_{k-1}+\\left(1-\\tfrac{k}{n+1}\\right)\\mathbf P_k.\n* Bézier curves have the variation diminishing property. What this means in intuitive terms is that a Bézier curves does not \"undulate\" more than the polygon of its control points, and may actually \"undulate\" less than that.\n* There is no local control in degree n Bézier curves—meaning that any change to a control point requires recalculation of and thus affects the aspect of the entire curve, \"although the further that one is from the control point that was changed, the smaller is the change in the curve.\"\n\nSecond order curve is a parabolic segment\n\nA quadratic Bézier curve is also a segment of a parabola. As a parabola is a conic section, some sources refer to quadratic Béziers as \"conic arcs\". With reference to the figure on the right, the important features of the parabola can be derived as follows:Duncan Marsh, [https://www.amazon.co.uk/Geometry-Computer-Graphics-Undergraduate-Mathematics/dp/1852338016 Applied Geometry for Computer Graphics and CAD], Springer Undergraduate Mathematics Series, 2005\n\n# Tangents to the parabola at the end-points of the curve (A and B) intersect at its control point (C).\n# If D is the midpoint of AB, the tangent to the curve which is perpendicular to CD (dashed cyan line) defines its vertex (V). Its axis of symmetry (dash-dot cyan) passes through V and is perpendicular to the tangent.\n# E is either point on the curve with a tangent at 45° to CD (dashed green). If G is the intersection of this tangent and the axis, the line passing through G and perpendicular to CD is the directrix (solid green).\n# The focus (F) is at the intersection of the axis and a line passing through E and perpendicular to CD (dotted yellow). The latus rectum is the line segment within the curve (solid yellow).\n\nDerivative\n\nThe derivative for a curve of order n is\n\n\\mathbf{B}'(t) n \\sum_{i\n0}^{n-1} b_{i,n-1}(t) (\\mathbf{P}_{i+1} - \\mathbf{P}_i)\n\nConstructing Bézier curves\n\nLinear curves\n\nThe t in the function for a linear Bézier curve can be thought of as describing how far B(t) is from P0 to P1. For example, when t=0.25, B(t) is one quarter of the way from point P0 to P1. As t varies from 0 to 1, B(t) describes a straight line from P0 to P1.\n\nQuadratic curves\n\nFor quadratic Bézier curves one can construct intermediate points Q0 and Q1 such that as t varies from 0 to 1:\n* Point Q0(t) varies from P0 to P1 and describes a linear Bézier curve.\n* Point Q1(t) varies from P1 to P2 and describes a linear Bézier curve.\n* Point B(t) is interpolated linearly between Q0(t) to Q1(t) and describes a quadratic Bézier curve.\n\nHigher-order curves\n\nFor higher-order curves one needs correspondingly more intermediate points. For cubic curves one can construct intermediate points Q0,  Q1, and Q2 that describe linear Bézier curves, and points R0 & R1 that describe quadratic Bézier curves:\n\nFor fourth-order curves one can construct intermediate points Q0,  Q1, Q2 & Q3 that describe linear Bézier curves, points R0, R1 & R2 that describe quadratic Bézier curves, and points S0 & S1 that describe cubic Bézier curves:\n\nFor fifth-order curves, one can construct similar intermediate points.\n\nThese representations rest on the process used in De Casteljau's algorithm to calculate Bézier curves.\n\nOffsets (a.k.a. stroking) of Bézier curves \n\nThe curve at a fixed offset from a given Bézier curve, called an offset or parallel curve in mathematics (lying \"parallel\" to the original curve, like the offset between rails in a railroad track), cannot be exactly formed by a Bézier curve (except in some trivial cases). In general, the two-sided offset curve of a cubic Bézier is a 10th-order algebraic curvehttp://www.slideshare.net/Mark_Kilgard/22pathrender, p. 28 and more generally for a Bézier of degree n the two-sided offset curve is an algebraic curve of degree 4n-2.[http://faculty.engineering.ucdavis.edu/farouki/wp-content/uploads/sites/41/2013/02/Introduction-to-PH-curves.pdf, particularly p. 16 \"taxonomy of offset curves\"] However, there are heuristic methods that usually give an adequate approximation for practical purposes.For example: [http://citeseerx.ist.psu.edu/viewdoc/summary?doi\n10.1.1.43.1724] or [http://www.google.com/patents/US20110285719]. For a survey see [http://www.computer.org/csdl/mags/cg/1997/03/mcg1997030062.pdf].\n\nIn the field of vector graphics, painting two symmetrically distanced offset curves is called stroking (the Bézier curve or in general a path of several Bézier segments). The conversion from offset curves to filled Bézier contours is of practical importance in converting fonts defined in METAFONT, which allows stroking of Bézier curves, to the more widely used PostScript type 1 fonts, which only allow (for efficiency purposes) the mathematically simpler operation of filling a contour defined by (non-self-intersecting) Bézier curves.[https://www.tug.org/TUGboat/tb16-3/tb48kinc.pdf MetaFog: Converting Metafont shapes to contours]\n\nDegree elevation\n\nA Bézier curve of degree n can be converted into a Bézier curve of degree n + 1 with the same shape. This is useful if software supports Bézier curves only of specific degree. For example, systems that can only work with cubic Bézier curves can implicitly work with quadratic curves by using their equivalent cubic representation.\n\nTo do degree elevation, we use the equality \\mathbf{B}(t) = (1-t)\\mathbf{B}(t) + t\\mathbf{B}(t). Each component \\mathbf{b}_{i,n}(t)\\mathbf{P}_i is multiplied by (1 − t) and t, thus increasing a degree by one, without changing the value. Here is the example of increasing degree from 2 to 3.\n\n\\begin{align}\n(1 - t)^2 \\mathbf{P}_0 + 2(1 - t)t\\mathbf{P}_1 + t^2 \\mathbf{P}_2 &= (1 - t)^3 \\mathbf{P}_0  + 2(1 - t)^2 t\\mathbf{P}_1 + (1 - t)t^2 \\mathbf{P}_2 + (1 - t)^{2}t\\mathbf{P}_0 + 2(1 - t)t^2 \\mathbf{P}_1  + t^3 \\mathbf{P}_2 \\\\\n  &= (1 - t)^3 \\mathbf{P}_0 + (1 - t)^2 t   \\left( \\mathbf{P}_0 + 2\\mathbf{P}_1\\right) + (1 - t)   t^2 \\left(2\\mathbf{P}_1 +  \\mathbf{P}_2\\right) + t^{3}\\mathbf{P}_2 \\\\\n  &= (1 - t)^3 \\mathbf{P}_0 + 3(1 - t)^2 t   \\tfrac{1}{3} \\left(  \\mathbf{P}_0 + 2\\mathbf{P}_1 \\right) + 3(1 - t)   t^2 \\tfrac{1}{3} \\left( 2\\mathbf{P}_1 +  \\mathbf{P}_2 \\right) + t^{3}\\mathbf{P}_2\n\\end{align}\n\nFor arbitrary n we use equalities\n\n\\begin{cases}  {n + 1 \\choose i}(1 - t)\\mathbf{b}_{i, n} {n \\choose i} \\mathbf{b}_{i, n + 1} \\\\  {n + 1 \\choose i + 1} t\\mathbf{b}_{i, n} \n {n \\choose i} \\mathbf{b}_{i + 1, n + 1} \\end{cases} \\quad \\Rightarrow \\quad \\begin{cases}  (1 - t)\\mathbf{b}_{i, n} \\frac{n + 1 - i}{n + 1} \\mathbf{b}_{i, n + 1} \\\\ t\\mathbf{b}_{i, n} \n \\frac{i + 1}{n + 1} \\mathbf{b}_{i + 1, n + 1} \\end{cases} \n\nTherefore:\n\n\\begin{align}\n\\mathbf{B}(t) &(1 - t)\\sum_{i\n0}^n \\mathbf{b}_{i, n}(t)\\mathbf{P}_i + t\\sum_{i=0}^n \\mathbf{b}_{i, n}(t)\\mathbf{P}_i \\\\\n                &\\sum_{i\n0}^n \\frac{n + 1 - i}{n + 1}\\mathbf{b}_{i, n + 1}(t)\\mathbf{P}_i + \\sum_{i=0}^n \\frac{i + 1}{n + 1}\\mathbf{b}_{i + 1, n + 1}(t)\\mathbf{P}_i \\\\\n                &\\sum_{i\n0}^{n + 1} \\left(\\frac{i}{n + 1}\\mathbf{P}_{i - 1} + \\frac{n + 1 - i}{n + 1}\\mathbf{P}_i\\right) \\mathbf{b}_{i, n + 1}(t) \\\\\n                &\\sum_{i\n0}^{n + 1} \\mathbf{b}_{i, n + 1}(t)\\mathbf{P'}_i\n\\end{align}\n\nintroducing arbitrary \\mathbf{P}_{-1} and \\mathbf{P}_{n + 1}.\n\nTherefore, new control points are \n\n\\mathbf{P'}_i \\frac{i}{n + 1}\\mathbf{P}_{i - 1} + \\frac{n + 1 - i}{n + 1}\\mathbf{P}_i,\\quad i\n0, \\ldots, n + 1\n\nRepeated Degree Elevation\n\nThe concept of Degree Elevation can be repeated on a control polygon R to get a sequence of control polygons R,R1,R2, and so on. After r degree elevations, the polygon Rr has the vertices P0,r,P1,r,P2,r,...,Pn+r,r given by \n\n\\mathbf{P}_{i,r} \\sum_{j\n0}^n \\mathbf{P}_j \\tbinom nj \\frac{\\tbinom{r}{i-j}}{\\tbinom{n+r}{i}}\n\nIt can also be shown that for the underlying Bézier curve B,\n\n\\mathbf{\\lim_{r \\to \\infty}R_r} = \\mathbf{B}\n\nRational Bézier curves\n\nThe rational Bézier curve adds adjustable weights to provide closer approximations to arbitrary shapes. The numerator is a weighted Bernstein-form Bézier curve and the denominator is a weighted sum of Bernstein polynomials. Rational Bézier curves can, among other uses, be used to represent segments of conic sections exactly, including circular arcs.\n\nGiven n + 1 control points Pi, the rational Bézier curve can be described by:\n\n\\mathbf{B}(t) =\n\\frac{\n\\sum_{i=0}^n b_{i,n}(t) \\mathbf{P}_{i}w_i\n}\n{\n\\sum_{i=0}^n b_{i,n}(t) w_i\n}\n\nor simply\n\n\\mathbf{B}(t) =\n\\frac{\n\\sum_{i=0}^n {n \\choose i} t^i (1-t)^{n-i}\\mathbf{P}_{i}w_i\n}\n{\n\\sum_{i=0}^n {n \\choose i} t^i (1-t)^{n-i}w_i\n}. Bézier curve. http://en.wikipedia.org/?curid=4664."
  }
}
