{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8244",
  "eid" : "e6ac7130-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778466755,
  "textBody" : "Dice (singular die or dice;[http://oxforddictionaries.com/definition/english/dice Definition of dice in English], Oxford Dictionaries from Old French dé; from Latin datum \"something which is given or played\") are small throwable objects with multiple resting positions, used for generating random numbers. Dice are suitable as gambling devices for games like craps and are also used in non-gambling tabletop games.\n\nA traditional die is a cube, with each of its six faces showing a different number of dots (pips) from 1 to 6. When thrown or rolled, the die comes to rest showing on its upper surface a random integer from one to six, each value being equally likely. A variety of similar devices are also described as dice; such specialized dice may have polyhedral or irregular shapes and may have faces marked with symbols instead of numbers. They may be used to produce results other than one through six. Loaded and crooked dice are designed to favor some results over others for purposes of cheating or amusement.\n\nA dice tray, a tray used to contain thrown dice, is sometimes used for gambling or board games, in particular to allow dice throws which do not interfere with other game pieces.\n\nHistory\n\nDice have been used since before recorded history, and it is uncertain where they originated. The oldest known dice were excavated as part of a backgammon-like game set at the Burnt City, an archeological site in south-eastern Iran, estimated to be from between 2800–2500 BC. Other excavations from ancient tombs in the Indus Valley civilization indicate a South Asian origin.Possehl, Gregory. \"Meluhha\". In: J. Reade (ed.) The Indian Ocean in Antiquity. London: Kegan Paul Intl. 1996a, 133–208\n\nThe Egyptian game of Senet was played with dice. Senet was played before 3000 BC and up to the 2nd century AD. It was likely a racing game, but there is no scholarly consensus on the rules of Senet. Dicing is mentioned as an Indian game in the Rigveda, Atharvaveda and the early Buddhist games list.2.3, 4.38, 6.118, 7.52, 7.109 There are several biblical references to \"casting lots\", as in Psalm 22, indicating that dicing (or a related activity) was commonplace when the psalm was composed. It is theorized that dice developed from the practice of fortunetelling with the talus of hoofed animals, colloquially known as \"knucklebones\", but knucklebones is not the oldest divination technique that incorporates randomness. Knucklebones was a game of skill played by women and children; a derivative form had the four sides of the bone receive different values and count as modern dice.\n\nAlthough gambling was illegal, many Romans were passionate gamblers who enjoyed dicing, which was known as aleam ludere (\"to play at dice\"). Dicing was even a popular pastime of emperors. Letters by Augustus to Tacitus and his daughter recount his hobby of dicing. There were two sizes of Roman dice. Tali were large dice inscribed with one, three, four, and six on four sides. Tesserae were smaller dice with sides numbered from one to six. Twenty-sided dice date back to the 2nd century AD and from Ptolemaic Egypt as early as the 2nd century BC.\n\nDominoes and playing cards originated in China as developments from dice. The transition from dice to playing cards occurred in China around the Tang dynasty, and coincides with the technological transition from rolls of manuscripts to block printed books. In Japan, dice were used to play a popular game called sugoroku. There are two types of sugoroku. Ban-sugoroku is similar to backgammon and dates to the Heian period, while e-sugoroku is a racing game.\n\nUsage\n\nDice are thrown onto a flat surface either from the hand or from a container designed for this (such as a dice cup). The face of the die that is uppermost when it comes to rest provides the value of the throw. One typical dice game today is craps, where two dice are thrown simultaneously and wagers are made on the total value of the two dice. Dice are frequently used to randomize moves in board games, usually by deciding the distance through which a piece will move along the board; examples of this are backgammon and Monopoly.\n\nThe result of a die roll is determined by the way it is thrown, according to the laws of classical mechanics. A die roll is made random by uncertainty in minor factors such as tiny movements in the thrower's hand; they are thus a crude form of hardware random number generator. Perhaps to mitigate against concerns that the pips on the faces of certain styles of dice cause a small bias, casinos use precision dice with flush markings.\n\nConstruction\n\nArrangement\n\nCommon dice are small cubes most commonly  across, whose faces are numbered from one to six, usually by patterns of round dots called pips. (While the use of Hindu-Arabic numerals is occasionally seen, such dice are less common.)\n\nOpposite sides of a modern die traditionally add up to seven, implying that the 1, 2 and 3 faces share a vertex.Cf. [https://archive.org/details/greekanthology05newyuoft Greek Anthology] Book 14, §8: \"The Opposite Pairs of Numbers on a Die. The numbers on a die run so: six one, five two, three four.\" The faces of a die may be placed clockwise or counterclockwise about this vertex. If the 1, 2 and 3 faces run counterclockwise, the die is called \"right-handed\", and if those faces run clockwise, the die is called \"left-handed\". Western dice are normally right-handed, and Chinese dice are normally left-handed.\n\nThe pips on dice are arranged in specific patterns as shown. Asian style dice bear similar patterns to Western ones, but the pips are closer to the center of the face; in addition, the pips are differently sized on Asian style dice, and the pips are colored red on the 1 and 4 sides. One possible explanation is that red fours are of Indian origin. In some older sets, the \"one\" pip is a colorless depression.\n\nManufacturing\n\nNon-precision dice are manufactured via the plastic injection molding process. The pips or numbers on the die are a part of the mold. The coloring for numbering is achieved by submerging the die entirely in paint, which is allowed to dry. The die is then polished via a tumble finishing process similar to rock polishing. The abrasive agent scrapes off all of the paint except for the indents of the numbering. A finer abrasive is then used to polish the die. This process also creates the smoother, rounded edges on the dice.[http://www.awesomedice.com/blog/64/how-dice-are-made/ How Dice Are Made] from Awesome Dice\n\nPrecision casino dice may have a polished or sand finish, making them transparent or translucent respectively. Casino dice have their pips drilled, then filled flush with a paint of the same density as the material used for the dice, such that the center of gravity of the dice is as close to the geometric center as possible. All such dice are stamped with a serial number to prevent potential cheaters from substituting a die. Precision backgammon dice are made the same way; they tend to be slightly smaller and have rounded corners and edges, to allow better movement inside the dice cup and stop forceful rolls from damaging the playing surface.\n\nTerms\n\nWhile the terms ace, deuce, trey, cater, cinque and sice are generally obsolete, with the names of the numbers preferred, they are still used by some professional gamblers to designate different sides of the dice. Ace is from the Latin as, meaning \"a unit\"; the others are 2 to 6 in Old French.\n\nUnicode representation\n\nUsing Unicode characters, the faces ⚀ ⚁ ⚂ ⚃ ⚄ ⚅, can be shown in text using the range U+2680 to U+2685 or using decimal ⚀ to ⚅.\n\nLoaded dice\n\nA loaded, weighted, or crooked die is one that has been tampered with so that it will land with a specific side facing upwards more or less often than a fair die would. There are several methods for creating loaded dice, including rounded faces, off-square faces and weights. Transparent cellulose acetate dice are used by casinos as tampering is more apparent than with opaque dice.\n\nVariants\n\nPolyhedral dice\n\nAround the end of the 1960s, non-cubical dice became popular among players of wargames, and since have been employed extensively in role-playing games and trading card games. The numerals 6 and 9, which are reciprocally symmetric through rotation, are distinguished with a dot or underline.\n\nStandard variations\n\nDice are often sold in sets, matching in color, of six different shapes. Five of the dice are shaped like the Platonic solids, whose faces are regular polygons. Aside from the cube, the other four Platonic solids have 4, 8, 12, and 20 faces, allowing for those number ranges to be generated. The only other common non-cubical die is the 10-sided die, a pentagonal trapezohedron die, whose faces are ten kites, each with two different edge lengths, three different angles, and two different kinds of vertices. Such sets frequently include a second 10-sided die either of contrasting color or numbered by tens, allowing for a pair of 10-sided dice to generate numbers between 1 and 100.\n\nUsing these dice in various ways, games can closely approximate the real probability distributions of the events they simulate. For instance, 10-sided dice can be rolled in pairs to produce a uniform distribution of random percentages, and summing the values of multiple dice will produce approximations to normal distributions. \n\nUnlike other common dice, a four-sided die does not have a side that faces upward when it is at rest on a surface, so it has to be read in a different way. Many such dice have the numbers printed around the points, so that when it settles, the numbers at the vertex pointing up are the same and are read. Alternatively, the numbers on a tetrahedral die can be placed at the middles of the edges, in which case the numbers around the base are read.\n\nNormally, the faces on a die will be placed so opposite faces will add up to one more than the number of faces (this is not possible with 4-sided dice and dice with an odd-number of faces). Some dice, such as those with 10 sides, are usually numbered sequentially beginning with 0, in which case the opposite faces will add to one less than the number of faces.\n\nRarer variations\n\n\"Uniform fair dice\" are dice where all faces have equal probability of outcome, which follows from the symmetry of the die (as it is face-transitive), and include:\n\n* Platonic solids, the five regular polyhedra: 4, 6, 8, 12, 20 sides\n* Catalan solids, the duals of the 13 Archimedean solids: 12, 24, 30, 48, 60, 120 sides\n* Bipyramids, the duals of the infinite set of prisms, with triangle faces: any multiple of 4 (so that a face will face up) above 8\n* Trapezohedrons, the duals of the infinite set of antiprisms, with kite faces: any even number not divisible by 4 (so that a face will face up) above 6\n* Disphenoids, an infinite set of tetrahedra made from congruent non-regular triangles: 4 sides\n\nA variation on the standard die is known as the \"average\" die. These are six-sided dice with sides numbered 2, 3, 3, 4, 4, 5, which have the same arithmetic mean as a standard die (3.5 for a single die, 7 for a pair of dice), but have a narrower range of possible values (2 through 5 for one, 4 through 10 for a pair). They are used in some table-top wargames, where a narrower range of numbers is required. \n\nDice with an odd number of flat faces can be made as \"long dice\". They are based on an infinite set of prisms. All the (rectangular) faces they may actually land on are congruent, so they are equally fair. (The other 2 sides of the prism are rounded or capped with a pyramid, designed so that the die never actually rests on those faces.)\n\nNon-numeric\n\nThe faces of most dice are labelled using sequences of whole numbers, usually starting at one, expressed with either pips or digits. However, there are some applications that require results other than numbers. Examples include letters for Boggle, directions for Warhammer Fantasy Battle, Fudge dice, playing card symbols for poker dice, and instructions for sexual acts using sex dice.\n\nSpherical dice\n\nA die can be constructed in the shape of a sphere, with the addition of an internal cavity in the shape of the dual polyhedron of the desired die shape and an internal weight. The weight will settle in one of the points of the internal cavity, causing it to settle with one of the numbers uppermost. For instance, a sphere with an octahedral cavity and a small internal weight will settle with one of the 6 points of the cavity held downwards by the weight.\n\nApplications\n\nPolyhedral dice are commonly used in role-playing games. The fantasy role-playing game Dungeons & Dragons (D&D) is largely credited with popularizing dice in such games. Some games use only one type, like Exalted which uses only ten-sided dice. Others use numerous types for different game purposes, such as D&D, which makes use of all common polyhedral dice. Dice are usually used to determine the outcome of events. Games typically determine results either as a total on one or more dice above or below a fixed number, or a certain number of rolls above a certain number on one or more dice. Due to circumstances or character skill, the initial roll may have a number added to or subtracted from the final result, or have the player roll extra or fewer dice. To keep track of rolls easily, dice notation is frequently used.\n\nMany board games use dice to randomize how far pieces move or to settle conflicts. Typically, this has meant that rolling higher numbers is better. Some games, such as Axis & Allies, have inverted this system by making the lower values more potent. In the modern age, a few games and game designers have approached dice in a different way by making each side of the die similarly valuable. In Castles of Burgundy, players spend their dice to take actions based on the die's value. In this game, a six is not better than a one, or vice versa. In Quarriors (and its descendent, Dicemasters), different sides of the dice can offer completely different abilities. Several sides often give resources while others grant the player useful actions.\n\nDice can be used for divination and using dice for such a purpose is called cleromancy. A pair of common dice is usual, though other forms of polyhedra can be used. Tibetan Buddhists sometimes use this method of divination. It is highly likely that the Pythagoreans used the Platonic solids as dice. They referred to such dice as \"the dice of the gods\" and they sought to understand the universe through an understanding of geometry in polyhedra.\n\nAstrological dice are a specialized set of three 12-sided dice for divination; the first die represents planets, the Sun, the Moon, and the nodes of the Moon, the second die represents the 12 zodiac signs, and the third represents the 12 houses. A specialized icosahedron die provides the answers of the Magic 8-Ball, conventionally used to provide answers to yes-or-no questions.\n\nNotation\n\nIn many gaming contexts, especially tabletop role-playing games, shorthand notations representing different dice rolls are used. A \"d\" or \"D\" is used to indicate a die with a specific number of sides; for example, d4 denotes a four-sided die. If several dice of the same type are to be rolled, this is indicated by a leading number specifying the number of dice. Hence, 6d8 means the player should roll six eight-sided dice and add the results. Modifiers to a die roll can also be indicated as desired. For example, 3d6+4 instructs the player to roll three six-sided dice, calculate the total, and add four to it.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dice" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8244" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dice (singular die or dice;[http://oxforddictionaries.com/definition/english/dice Definition of dice in English], Oxford Dictionaries from Old French dé; from Latin datum \"something which is given or played\") are small throwable objects with multiple resting positions, used for generating random numbers. Dice are suitable as gambling devices for games like craps and are also used in non-gambling tabletop games.\n\nA traditional die is a cube, with each of its six faces showing a different number of dots (pips) from 1 to 6. When thrown or rolled, the die comes to rest showing on its upper surface a random integer from one to six, each value being equally likely. A variety of similar devices are also described as dice; such specialized dice may have polyhedral or irregular shapes and may have faces marked with symbols instead of numbers. They may be used to produce results other than one through six. Loaded and crooked dice are designed to favor some results over others for purposes of cheating or amusement.\n\nA dice tray, a tray used to contain thrown dice, is sometimes used for gambling or board games, in particular to allow dice throws which do not interfere with other game pieces.\n\nHistory\n\nDice have been used since before recorded history, and it is uncertain where they originated. The oldest known dice were excavated as part of a backgammon-like game set at the Burnt City, an archeological site in south-eastern Iran, estimated to be from between 2800–2500 BC. Other excavations from ancient tombs in the Indus Valley civilization indicate a South Asian origin.Possehl, Gregory. \"Meluhha\". In: J. Reade (ed.) The Indian Ocean in Antiquity. London: Kegan Paul Intl. 1996a, 133–208\n\nThe Egyptian game of Senet was played with dice. Senet was played before 3000 BC and up to the 2nd century AD. It was likely a racing game, but there is no scholarly consensus on the rules of Senet. Dicing is mentioned as an Indian game in the Rigveda, Atharvaveda and the early Buddhist games list.2.3, 4.38, 6.118, 7.52, 7.109 There are several biblical references to \"casting lots\", as in Psalm 22, indicating that dicing (or a related activity) was commonplace when the psalm was composed. It is theorized that dice developed from the practice of fortunetelling with the talus of hoofed animals, colloquially known as \"knucklebones\", but knucklebones is not the oldest divination technique that incorporates randomness. Knucklebones was a game of skill played by women and children; a derivative form had the four sides of the bone receive different values and count as modern dice.\n\nAlthough gambling was illegal, many Romans were passionate gamblers who enjoyed dicing, which was known as aleam ludere (\"to play at dice\"). Dicing was even a popular pastime of emperors. Letters by Augustus to Tacitus and his daughter recount his hobby of dicing. There were two sizes of Roman dice. Tali were large dice inscribed with one, three, four, and six on four sides. Tesserae were smaller dice with sides numbered from one to six. Twenty-sided dice date back to the 2nd century AD and from Ptolemaic Egypt as early as the 2nd century BC.\n\nDominoes and playing cards originated in China as developments from dice. The transition from dice to playing cards occurred in China around the Tang dynasty, and coincides with the technological transition from rolls of manuscripts to block printed books. In Japan, dice were used to play a popular game called sugoroku. There are two types of sugoroku. Ban-sugoroku is similar to backgammon and dates to the Heian period, while e-sugoroku is a racing game.\n\nUsage\n\nDice are thrown onto a flat surface either from the hand or from a container designed for this (such as a dice cup). The face of the die that is uppermost when it comes to rest provides the value of the throw. One typical dice game today is craps, where two dice are thrown simultaneously and wagers are made on the total value of the two dice. Dice are frequently used to randomize moves in board games, usually by deciding the distance through which a piece will move along the board; examples of this are backgammon and Monopoly.\n\nThe result of a die roll is determined by the way it is thrown, according to the laws of classical mechanics. A die roll is made random by uncertainty in minor factors such as tiny movements in the thrower's hand; they are thus a crude form of hardware random number generator. Perhaps to mitigate against concerns that the pips on the faces of certain styles of dice cause a small bias, casinos use precision dice with flush markings.\n\nConstruction\n\nArrangement\n\nCommon dice are small cubes most commonly  across, whose faces are numbered from one to six, usually by patterns of round dots called pips. (While the use of Hindu-Arabic numerals is occasionally seen, such dice are less common.)\n\nOpposite sides of a modern die traditionally add up to seven, implying that the 1, 2 and 3 faces share a vertex.Cf. [https://archive.org/details/greekanthology05newyuoft Greek Anthology] Book 14, §8: \"The Opposite Pairs of Numbers on a Die. The numbers on a die run so: six one, five two, three four.\" The faces of a die may be placed clockwise or counterclockwise about this vertex. If the 1, 2 and 3 faces run counterclockwise, the die is called \"right-handed\", and if those faces run clockwise, the die is called \"left-handed\". Western dice are normally right-handed, and Chinese dice are normally left-handed.\n\nThe pips on dice are arranged in specific patterns as shown. Asian style dice bear similar patterns to Western ones, but the pips are closer to the center of the face; in addition, the pips are differently sized on Asian style dice, and the pips are colored red on the 1 and 4 sides. One possible explanation is that red fours are of Indian origin. In some older sets, the \"one\" pip is a colorless depression.\n\nManufacturing\n\nNon-precision dice are manufactured via the plastic injection molding process. The pips or numbers on the die are a part of the mold. The coloring for numbering is achieved by submerging the die entirely in paint, which is allowed to dry. The die is then polished via a tumble finishing process similar to rock polishing. The abrasive agent scrapes off all of the paint except for the indents of the numbering. A finer abrasive is then used to polish the die. This process also creates the smoother, rounded edges on the dice.[http://www.awesomedice.com/blog/64/how-dice-are-made/ How Dice Are Made] from Awesome Dice\n\nPrecision casino dice may have a polished or sand finish, making them transparent or translucent respectively. Casino dice have their pips drilled, then filled flush with a paint of the same density as the material used for the dice, such that the center of gravity of the dice is as close to the geometric center as possible. All such dice are stamped with a serial number to prevent potential cheaters from substituting a die. Precision backgammon dice are made the same way; they tend to be slightly smaller and have rounded corners and edges, to allow better movement inside the dice cup and stop forceful rolls from damaging the playing surface.\n\nTerms\n\nWhile the terms ace, deuce, trey, cater, cinque and sice are generally obsolete, with the names of the numbers preferred, they are still used by some professional gamblers to designate different sides of the dice. Ace is from the Latin as, meaning \"a unit\"; the others are 2 to 6 in Old French.\n\nUnicode representation\n\nUsing Unicode characters, the faces ⚀ ⚁ ⚂ ⚃ ⚄ ⚅, can be shown in text using the range U+2680 to U+2685 or using decimal ⚀ to ⚅.\n\nLoaded dice\n\nA loaded, weighted, or crooked die is one that has been tampered with so that it will land with a specific side facing upwards more or less often than a fair die would. There are several methods for creating loaded dice, including rounded faces, off-square faces and weights. Transparent cellulose acetate dice are used by casinos as tampering is more apparent than with opaque dice.\n\nVariants\n\nPolyhedral dice\n\nAround the end of the 1960s, non-cubical dice became popular among players of wargames, and since have been employed extensively in role-playing games and trading card games. The numerals 6 and 9, which are reciprocally symmetric through rotation, are distinguished with a dot or underline.\n\nStandard variations\n\nDice are often sold in sets, matching in color, of six different shapes. Five of the dice are shaped like the Platonic solids, whose faces are regular polygons. Aside from the cube, the other four Platonic solids have 4, 8, 12, and 20 faces, allowing for those number ranges to be generated. The only other common non-cubical die is the 10-sided die, a pentagonal trapezohedron die, whose faces are ten kites, each with two different edge lengths, three different angles, and two different kinds of vertices. Such sets frequently include a second 10-sided die either of contrasting color or numbered by tens, allowing for a pair of 10-sided dice to generate numbers between 1 and 100.\n\nUsing these dice in various ways, games can closely approximate the real probability distributions of the events they simulate. For instance, 10-sided dice can be rolled in pairs to produce a uniform distribution of random percentages, and summing the values of multiple dice will produce approximations to normal distributions. \n\nUnlike other common dice, a four-sided die does not have a side that faces upward when it is at rest on a surface, so it has to be read in a different way. Many such dice have the numbers printed around the points, so that when it settles, the numbers at the vertex pointing up are the same and are read. Alternatively, the numbers on a tetrahedral die can be placed at the middles of the edges, in which case the numbers around the base are read.\n\nNormally, the faces on a die will be placed so opposite faces will add up to one more than the number of faces (this is not possible with 4-sided dice and dice with an odd-number of faces). Some dice, such as those with 10 sides, are usually numbered sequentially beginning with 0, in which case the opposite faces will add to one less than the number of faces.\n\nRarer variations\n\n\"Uniform fair dice\" are dice where all faces have equal probability of outcome, which follows from the symmetry of the die (as it is face-transitive), and include:\n\n* Platonic solids, the five regular polyhedra: 4, 6, 8, 12, 20 sides\n* Catalan solids, the duals of the 13 Archimedean solids: 12, 24, 30, 48, 60, 120 sides\n* Bipyramids, the duals of the infinite set of prisms, with triangle faces: any multiple of 4 (so that a face will face up) above 8\n* Trapezohedrons, the duals of the infinite set of antiprisms, with kite faces: any even number not divisible by 4 (so that a face will face up) above 6\n* Disphenoids, an infinite set of tetrahedra made from congruent non-regular triangles: 4 sides\n\nA variation on the standard die is known as the \"average\" die. These are six-sided dice with sides numbered 2, 3, 3, 4, 4, 5, which have the same arithmetic mean as a standard die (3.5 for a single die, 7 for a pair of dice), but have a narrower range of possible values (2 through 5 for one, 4 through 10 for a pair). They are used in some table-top wargames, where a narrower range of numbers is required. \n\nDice with an odd number of flat faces can be made as \"long dice\". They are based on an infinite set of prisms. All the (rectangular) faces they may actually land on are congruent, so they are equally fair. (The other 2 sides of the prism are rounded or capped with a pyramid, designed so that the die never actually rests on those faces.)\n\nNon-numeric\n\nThe faces of most dice are labelled using sequences of whole numbers, usually starting at one, expressed with either pips or digits. However, there are some applications that require results other than numbers. Examples include letters for Boggle, directions for Warhammer Fantasy Battle, Fudge dice, playing card symbols for poker dice, and instructions for sexual acts using sex dice.\n\nSpherical dice\n\nA die can be constructed in the shape of a sphere, with the addition of an internal cavity in the shape of the dual polyhedron of the desired die shape and an internal weight. The weight will settle in one of the points of the internal cavity, causing it to settle with one of the numbers uppermost. For instance, a sphere with an octahedral cavity and a small internal weight will settle with one of the 6 points of the cavity held downwards by the weight.\n\nApplications\n\nPolyhedral dice are commonly used in role-playing games. The fantasy role-playing game Dungeons & Dragons (D&D) is largely credited with popularizing dice in such games. Some games use only one type, like Exalted which uses only ten-sided dice. Others use numerous types for different game purposes, such as D&D, which makes use of all common polyhedral dice. Dice are usually used to determine the outcome of events. Games typically determine results either as a total on one or more dice above or below a fixed number, or a certain number of rolls above a certain number on one or more dice. Due to circumstances or character skill, the initial roll may have a number added to or subtracted from the final result, or have the player roll extra or fewer dice. To keep track of rolls easily, dice notation is frequently used.\n\nMany board games use dice to randomize how far pieces move or to settle conflicts. Typically, this has meant that rolling higher numbers is better. Some games, such as Axis & Allies, have inverted this system by making the lower values more potent. In the modern age, a few games and game designers have approached dice in a different way by making each side of the die similarly valuable. In Castles of Burgundy, players spend their dice to take actions based on the die's value. In this game, a six is not better than a one, or vice versa. In Quarriors (and its descendent, Dicemasters), different sides of the dice can offer completely different abilities. Several sides often give resources while others grant the player useful actions.\n\nDice can be used for divination and using dice for such a purpose is called cleromancy. A pair of common dice is usual, though other forms of polyhedra can be used. Tibetan Buddhists sometimes use this method of divination. It is highly likely that the Pythagoreans used the Platonic solids as dice. They referred to such dice as \"the dice of the gods\" and they sought to understand the universe through an understanding of geometry in polyhedra.\n\nAstrological dice are a specialized set of three 12-sided dice for divination; the first die represents planets, the Sun, the Moon, and the nodes of the Moon, the second die represents the 12 zodiac signs, and the third represents the 12 houses. A specialized icosahedron die provides the answers of the Magic 8-Ball, conventionally used to provide answers to yes-or-no questions.\n\nNotation\n\nIn many gaming contexts, especially tabletop role-playing games, shorthand notations representing different dice rolls are used. A \"d\" or \"D\" is used to indicate a die with a specific number of sides; for example, d4 denotes a four-sided die. If several dice of the same type are to be rolled, this is indicated by a leading number specifying the number of dice. Hence, 6d8 means the player should roll six eight-sided dice and add the results. Modifiers to a die roll can also be indicated as desired. For example, 3d6+4 instructs the player to roll three six-sided dice, calculate the total, and add four to it. Dice. http://en.wikipedia.org/?curid=8244."
  }
}
