{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19674",
  "eid" : "3cf67040-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778611524,
  "textBody" : "Events\n\n*495 BC – A newly constructed temple in honour of the god Mercury was dedicated in ancient Rome on the Circus Maximus, between the Aventine and Palatine hills. To spite the senate and the consuls, the people awarded the dedication to a senior military officer, Marcus Laetorius.\n* 221 – Liu Bei, Chinese warlord, proclaims himself emperor of Shu Han, the successor of the Han dynasty.\n* 392 – Emperor Valentinian II is assassinated while advancing into Gaul against the Frankish usurper Arbogast. He is found hanging in his residence at Vienne. \n* 589 – King Authari marries Theodelinda, daughter of the Bavarian duke Garibald I. A Catholic, she has great influence among the Lombard nobility.\n* 908 – The three-year-old Constantine VII, the son of Emperor Leo VI the Wise, is crowned as co-emperor of the Byzantine Empire by Patriarch Euthymius I at Constantinople.\n*1252 – Pope Innocent IV issues the papal bull ad extirpanda, which authorizes, but also limits, the torture of heretics in the Medieval Inquisition.\n*1525 – Insurgent peasants led by Anabaptist pastor Thomas Müntzer were defeated at the Battle of Frankenhausen, ending the German Peasants' War in the Holy Roman Empire.\n*1536 – Anne Boleyn, Queen of England, stands trial in London on  charges of treason, adultery and incest; she is condemned to death by a specially-selected jury.\n*1567 – Mary, Queen of Scots marries James Hepburn, 4th Earl of Bothwell, her third husband.\n*1618 – Johannes Kepler confirms his previously rejected discovery of the third law of planetary motion (he first discovered it on March 8 but soon rejected the idea after some initial calculations were made).\n*1648 – The Treaty of Westphalia is signed.\n*1718 – James Puckle, a London lawyer, patents the world's first machine gun.\n*1730 – Robert Walpole effectively became the first Prime Minister of the United Kingdom.\n*1776 – American Revolution: The Fifth Virginia Convention instructs its Continental Congress delegation to propose a resolution of independence from Great Britain, paving the way for the United States Declaration of Independence.\n*1791 – French Revolution: Maximilien Robespierre proposes the Self-denying Ordinance.\n*1792 – War of the First Coalition: France declares war on Kingdom of Sardinia.\n*1793 – Diego Marín Aguilera flies a glider for \"about 360 meters\", at a height of 5–6 meters, during one of the first attempted manned flights.\n*1796 – War of the First Coalition: Napoleon enters Milan in triumph.\n*1800 – King George III of the United Kingdom survives an assassination attempt by James Hadfield, who is later acquitted by reason of insanity.\n*1811 – Paraguay declares independence from Spain.\n*1817 – Opening of the first private mental health hospital in the United States, the Asylum for the Relief of Persons Deprived of the Use of Their Reason (now Friends Hospital, Philadelphia, Pennsylvania).\n*1836 – Francis Baily observes \"Baily's beads\" during an annular eclipse.\n*1848 – Serfdom is abolished in the Habsburg Galicia, as a result of the 1848 revolutions.  The rest of monarchy followed later in the year.\n*1849 – Troops of the Two Sicilies take Palermo and crush the republican government of Sicily.\n*1850 – The Bloody Island massacre takes place in Lake County, California, in which a large number of Pomo Indians are slaughtered by a regiment of the United States Cavalry.\n*1850 – The Arana–Southern Treaty is ratified, ending \"the existing differences\" between Great Britain and Argentina.\n*1851 – The first Australian gold rush is proclaimed, although the discovery had been made three months earlier.\n*1858 – Opening of the present Royal Opera House in Covent Garden, London.\n*1862 – President Abraham Lincoln signs a bill into law creating the United States Bureau of Agriculture. It is later renamed the United States Department of Agriculture.\n*1864 – American Civil War: Battle of New Market, Virginia: Students from the Virginia Military Institute fight alongside the Confederate Army to force Union General Franz Sigel out of the Shenandoah Valley.\n*1867 – Canadian Bank of Commerce opens for business in Toronto, Ontario. The bank would later merge with Imperial Bank of Canada to become what is CIBC in 1961.\n*1869 – Women's suffrage: In New York, Susan B. Anthony and Elizabeth Cady Stanton form the National Woman Suffrage Association.\n*1891 – Pope Leo XIII defends workers' rights and property rights in the encyclical Rerum novarum, the beginning of modern Catholic social teaching.\n*1904 – Russo-Japanese War: The Russian minelayer Amur lays a minefield about 15 miles off Port Arthur and sinks Japan's battleships Hatsuse, 15,000 tons, with 496 crew and Yashima.\n*1905 – Las Vegas is founded when 110 acre, in what later would become downtown, are auctioned off.\n*1911 – In Standard Oil Co. of New Jersey v. United States, the United States Supreme Court declares Standard Oil to be an \"unreasonable\" monopoly under the Sherman Antitrust Act and orders the company to be broken up.\n*  1911   – More than 300 Chinese immigrants are killed in the Torreón massacre when the forces of the Mexican Revolution led by Emilio Madero take the city of Torreón from the Federales. \n*1919 – The Winnipeg general strike begins. By 11:00, almost the whole working population of Winnipeg had walked off the job.\n*  1919   – Greek occupation of Smyrna. During the occupation, the Greek army kills or wounds 350 Turks; those responsible are punished by Greek commander Aristides Stergiades.\n*1925 – Al-Insaniyyah, the first Arabic communist newspaper, is founded.\n*1928 – Walt Disney character Mickey Mouse premieres in his first cartoon, \"Plane Crazy\".\n*1929 – A fire at the Cleveland Clinic in Cleveland, Ohio kills 123.\n*1932 – In an attempted coup d'état, the Prime Minister of Japan Inukai Tsuyoshi is assassinated.\n*1933 – All military aviation organizations within, or under the control of, the RLM of Germany were officially merged in a covert manner, to form its Wehrmacht military's air arm, the Luftwaffe.\n*1934 – Kārlis Ulmanis establishes an authoritarian government in Latvia.\n*1940 –  is recommissioned. It was originally the USS Squalus.\n*  1940   – World War II: After fierce fighting, the poorly trained and equipped Dutch troops surrender to Germany, marking the beginning of five years of occupation.\n*  1940   – McDonald's opens its first restaurant in San Bernardino, California.\n*1941 – First flight of the Gloster E.28/39 the first British and Allied jet aircraft.\n*  1941   – Joe DiMaggio begins a 56-game hitting streak.\n*1942 – World War II: In the United States, a bill creating the Women's Army Auxiliary Corps (WAAC) is signed into law.\n*1943 – Joseph Stalin dissolves the Comintern (or Third International).\n*1945 – World War II: The Battle of Poljana, the final skirmish in Europe is fought near Prevalje, Slovenia.\n*1948 – Following the expiration of The British Mandate for Palestine, the Kingdom of Egypt, Transjordan, Lebanon, Syria, Iraq and Saudi Arabia invade Israel thus starting the 1948 Arab–Israeli War.\n*1957 – At Malden Island in the Pacific Ocean, Britain tests its first hydrogen bomb in Operation Grapple.\n*1958 – The Soviet Union launches Sputnik 3.\n*1960 – The Soviet Union launches Sputnik 4.\n*1963 – Project Mercury: The launch of the final Mercury mission, Mercury-Atlas 9 with astronaut Gordon Cooper on board. He becomes the first American to spend more than a day in space, and the last American to go into space alone.\n*1966 – After a policy dispute, Prime Minister Nguyễn Cao Kỳ of South Vietnam's ruling junta launches a military attack on the forces of General Tôn Thất Đính, forcing him to abandon his command.\n*1969 – People's Park: California Governor Ronald Reagan has an impromptu student park owned by the University of California at Berkeley fenced off from student anti-war protestors, sparking a riot.\n*1970 – President Richard Nixon appoints Anna Mae Hays and Elizabeth P. Hoisington the first female United States Army generals.\n*  1970   – Philip Lafayette Gibbs and James Earl Green are killed at Jackson State University by police during student protests.\n*1972 – Ryukyu Islands, under U.S. military governance since its conquest in 1945, hand over to Japanese control.\n*  1972   – In Laurel, Maryland, Arthur Bremer shoots and paralyzes Alabama Governor George Wallace while he is campaigning to become President.\n*1974 – Ma'alot massacre: Members of the Democratic Front for the Liberation of Palestine attack and take hostages at an Israeli school; a total of 31 people are killed, including 22 schoolchildren.\n*1987 – The Soviet Union launches the Polyus prototype orbital weapons platform. It fails to reach orbit.\n*1988 – Soviet–Afghan War: After more than eight years of fighting, the Soviet Army begins to withdraw 115,000 troops from Afghanistan.\n*1991 – Édith Cresson becomes France's first female premier.\n*1997 – The United States government acknowledges the existence of the \"Secret War\" in Laos and dedicates the Laos Memorial in honor of Hmong and other \"Secret War\" veterans.\n*2004 – Arsenal F.C. go an entire league campaign unbeaten in the English Premier League, joining Preston North End F.C with the right to claim the title The Invincibles\n*2008 – California becomes the second U.S. state after Massachusetts in 2004 to legalize same-sex marriage after the state's own Supreme Court rules a previous ban unconstitutional.\n*2010 – Jessica Watson becomes the youngest person to sail, non-stop and unassisted around the world solo.\n*2013 – An upsurge in violence in Iraq leaves more than 389 people dead over three days.\n\nBirths\n\n*1397 – Sejong the Great, Korean king (d. 1450)\n*1531 – Maria of Austria, Duchess of Jülich-Cleves-Berg (d. 1581)\n*1553 – Margaret of Valois, Queen of France (d. 1615)\n*1565 – Hendrick de Keyser, Dutch sculptor and architect born in Utrecht (d. 1621)\n*1567 – Claudio Monteverdi, Italian priest and composer (d. 1643)\n*1608 – René Goupil, French-American missionary and saint (d. 1642)\n*1633 – Sébastien Le Prestre de Vauban, French noble (d. 1707)\n*1645 – George Jeffreys, 1st Baron Jeffreys, British judge (d. 1689)\n*1689 – Lady Mary Wortley Montagu, English author and playwright (d. 1762)\n*1720 – Maximilian Hell, Hungarian priest and astronomer (d. 1792)\n*1749 – Levi Lincoln Sr., American lawyer and politician, 4th United States Attorney General (d. 1820)\n*1759 – Maria Theresia von Paradis, Austrian pianist and composer (d. 1824)\n*1764 – Johann Nepomuk Kalcher, German organist and composer (d. 1827)\n*1770 – Ezekiel Hart, Canadian businessman and politician (d. 1843)\n*1773 – Klemens von Metternich, German-Austrian politician, 1st State Chancellor of the Austrian Empire (d. 1859)\n*1786 – Dimitris Plapoutas, Greek general and politician (d. 1864)\n*1808 – Michael William Balfe, Irish composer and conductor (d. 1870)\n*1817 – Debendranath Tagore, Indian philosopher and author (d. 1905)\n*1841 – Clarence Dutton, American commander and geologist (d. 1912)\n*1848 – Viktor Vasnetsov, Russian painter and illustrator (d. 1926)\n*1854 – Ioannis Psycharis, Ukrainian-French philologist and author (d. 1929)\n*1856 – L. Frank Baum, American novelist (d. 1919)\n*  1856   – Matthias Zurbriggen, Swiss mountaineer (d. 1917)\n*1857 – Williamina Fleming, Scottish-American astronomer and academic (d. 1911)\n*1859 – Pierre Curie, French physicist and academic, Nobel Prize laureate (d. 1906)\n*1862 – Arthur Schnitzler, Austrian author and playwright (d. 1931)\n*1863 – Frank Hornby, English businessman and politician, invented Meccano (d. 1936)\n*1869 – Paul Probst, Swiss target shooter (d. 1945)\n*  1869   – John Storey, Australian politician, 20th Premier of New South Wales (d. 1921) \n*1890 – Katherine Anne Porter, American short story writer, novelist, and essayist (d. 1980)\n*1891 – Mikhail Bulgakov, Russian novelist and playwright (d. 1940)\n*  1891   – Fritz Feigl, Austrian-Brazilian chemist and academic (d. 1971)\n*1892 – Charles E. Rosendahl, American admiral (d. 1977)\n*  1892   – Jimmy Wilde, Welsh boxer (d. 1969)\n*1894 – Feg Murray, American hurdler and cartoonist (d. 1973)\n*1895 – Prescott Bush, American captain, banker, and politician (d. 1972)\n*  1895   – William D. Byron, American lieutenant and politician (d. 1941)\n*1898 – Arletty, French model, actress, and singer (d. 1992)\n*1899 – Jean Étienne Valluy, French general (d. 1970)\n*1900 – Ida Rhodes, American mathematician, pioneer in computer programming (d. 1986) \n*1901 – Xavier Herbert, Australian author (d. 1984)\n*  1901   – Luis Monti, Argentinian-Italian footballer and manager (d. 1983)\n*1902 – Richard J. Daley, American lawyer and politician, 48th Mayor of Chicago (d. 1976)\n*  1902   – Sigizmund Levanevsky, Soviet aircraft pilot of Polish origin (d. 1937)\n*1903 – Maria Reiche, German mathematician and archaeologist (d. 1998)\n*1904 – Clifton Fadiman, American game show host and author (d. 1999)\n*1905 – Joseph Cotten, American actor (d. 1994)\n*  1905   – Albert Dubout, French cartoonist, illustrator, painter, and sculptor (d. 1976)\n*  1905   – Abraham Zapruder, American businessman and amateur photographer, filmed the Zapruder film (d. 1970)\n*1907 – Sukhdev Thapar, Indian activist (d. 1931)\n*1909 – James Mason, English actor, producer, and screenwriter (d. 1984)\n*  1909   – Clara Solovera, Chilean singer-songwriter (d. 1992)\n*1910 – Constance Cummings, British-based American actress (d. 2005)\n*1911 – Max Frisch, Swiss playwright and novelist (d. 1991)\n*  1911   – Herta Oberheuser, German physician (d. 1978)\n*1912 – Arthur Berger, American composer and educator (d. 2003)\n*1914 – Turk Broda, Canadian ice hockey player and coach (d. 1972)\n*  1914   – Angus MacLean, Canadian farmer and politician, 25th Premier of Prince Edward Island (d. 2000)\n*  1914   – Norrie Paramor, English composer, producer, and conductor (d. 1979)\n*1915 – Hilda Bernstein, English-South African author and activist (d. 2006)\n*  1915   – Paul Samuelson, American economist and academic, Nobel Prize laureate (d. 2009)\n*  1915   – Henrik Sandberg, Danish production manager and producer (d. 1993)\n*1916 – Vera Gebuhr, Danish actress (d. 2014)\n*1918 – Eddy Arnold, American singer-songwriter, guitarist, and actor (d. 2008)\n*  1918   – Arthur Jackson, American lieutenant and target shooter (d. 2015)\n*  1918   – Joseph Wiseman, Canadian-American actor (d. 2009)\n*1920 – Michel Audiard, French director and screenwriter (d. 1985)\n*  1920   – Louis Siminovitch, Canadian biologist and academic\n*1922 – Sigurd Ottovich Schmidt, Russian historian and ethnographer (d. 2013)\n*  1922   – Jakucho Setouchi, Japanese nun and author\n*1923 – Richard Avedon, American sailor and photographer (d. 2004)\n*  1923   – John Lanchbery, English-Australian composer and conductor (d. 2003)\n*1924 – Maria Koepcke, German-Peruvian ornithologist and zoologist (d. 1971)\n*1925 – Andrei Eshpai, Russian pianist and composer (d. 2015) \n*  1925   – Mary F. Lyon, English geneticist and biologist (d. 2014)\n*  1925   – Carl Sanders, American soldier, pilot, and politician, 74th Governor of Georgia (d. 2014)\n*  1925   – Roy Stewart, Jamaican-English actor and stuntman (d. 2008)\n*1926 – Clermont Pépin, Canadian pianist, composer, and educator (d. 2006)\n*  1926   – Anthony Shaffer, English author, playwright, and screenwriter (d. 2001)\n*  1926   – Peter Shaffer, English playwright and screenwriter (d. 2016)\n*1930 – Jasper Johns, American painter and sculptor\n*1931 – Ken Venturi, American golfer and sportscaster (d. 2013)\n*1935 – Don Bragg, American pole vaulter\n*  1935   – Ted Dexter, Italian-English cricketer\n*  1935   – Utah Phillips, American singer-songwriter and guitarist (d. 2008)\n*1936 – Anna Maria Alberghetti, Italian-American actress and singer\n*  1936   – Mart Laga, Estonian basketball player (d. 1977)\n*  1936   – Ralph Steadman, English painter and illustrator\n*  1936   – Paul Zindel, American playwright and novelist (d. 2003)\n*1937 – Madeleine Albright, Czech-American politician and diplomat, 64th United States Secretary of State\n*  1937   – Karin Krog, Norwegian singer\n*  1937   – Trini Lopez, American singer, guitarist, and actor\n*1938 – Mireille Darc, French actress, director, and screenwriter\n*  1938   – Nancy Garden, American author (d. 2014)\n*1939 – Dorothy Shirley, English high jumper and educator\n*1940 – Roger Ailes, American businessman (d. 2017)\n*  1940   – Lainie Kazan, American actress and singer\n*  1940   – Don Nelson, American basketball player and coach\n*1941 – Jaxon, American illustrator and publisher, co-founded the Rip Off Press (d. 2006)\n*1942 – Lois Johnson, American singer-songwriter (d. 2014)\n*  1942   – Jusuf Kalla, Indonesian businessman and politician, 10th Vice President of Indonesia\n*  1942   – Doug Lowe, Australian politician, 35th Premier of Tasmania\n*  1942   – K. T. Oslin, American singer-songwriter and actress\n*1943 – Paul Bégin, Canadian lawyer and politician\n*  1943   – Freddie Perren, American songwriter, producer, and conductor (d. 2004)\n*1944 – Bill Alter, American police officer and politician\n*  1944   – Ulrich Beck, German sociologist and academic (d. 2015)\n*1945 – Michael Dexter, English hematologist and academic\n*  1945   – Jerry Quarry, American boxer (d. 1999)\n*1946 – Thadeus Nguyễn Văn Lý, Vietnamese priest and activist\n*1947 – Graeham Goble, Australian singer-songwriter, guitarist and producer\n*1948 – Yutaka Enatsu, Japanese baseball player\n*  1948   – Brian Eno, English singer-songwriter, keyboard player, and producer \n*  1948   – Kathleen Sebelius, American politician, 44th Governor of Kansas\n*1949 – Frank L. Culbertson Jr., American captain, pilot, and astronaut\n*  1949   – Robert S.J. Sparks, English geologist and academic\n*1950 – Jim Bacon, Australian politician, 41st Premier of Tasmania (d. 2004)\n*  1950   – Jim Simons, American golfer (d. 2005) \n*1951 – Dennis Frederiksen, American singer-songwriter (d. 2014)\n*  1951   – Chris Ham, English political scientist and academic\n*  1951   – Frank Wilczek, American mathematician and physicist, Nobel Prize laureate\n*1952 – Chazz Palminteri, American actor, director, producer, and screenwriter\n*1953 – George Brett, American baseball player and coach\n*  1953   – Athene Donald, English physicist and academic\n*  1953   – Mike Oldfield, English-Irish singer-songwriter, guitarist, and producer \n*1954 – Diana Liverman, English-American geographer and academic\n*  1954   – Caroline Thomson, English journalist and broadcaster\n*1955 – Mohamed Brahmi, Tunisian politician (d. 2013)\n*  1955   – Lia Vissi, Cypriot singer-songwriter and politician\n*1956 – Andreas Loverdos, Greek lawyer and politician, Greek Minister of Labour\n*  1956   – Dan Patrick, American television anchor and sportscaster \n*  1956   – Kevin Greenaugh, American nuclear engineer\n*1957 – Meg Gardiner, American-English author and academic\n*  1957   – Juan José Ibarretxe, Spanish politician\n*  1957   – Kevin Von Erich, American football player and wrestler\n*1958 – Jason Graae, American musical theater actor\n*  1958   – Ron Simmons, American football player and wrestler\n*1959 – Khaosai Galaxy, Thai boxer and politician\n*  1959   – Luis Pérez-Sala, Spanish race car driver\n*  1959   – Beverly Jo Scott, American-Belgian singer-songwriter\n*1960 – Rhonda Burchmore, Australian actress, singer, and dancer\n*  1960   – Rob Bowman, American director and producer\n*  1960   – R. Kuhaneswaran, Sri Lankan politician\n*  1960   – Rimas Kurtinaitis, Lithuanian basketball player and coach\n*1962 – Lisa Curry, Australian swimmer \n*1964 – Lars Løkke Rasmussen, Danish lawyer and politician, 40th Prime Minister of Denmark\n*1965 – André Abujamra, Brazilian singer-songwriter and guitarist\n*  1965   – Scott Tronc, Australian rugby league player\n*  1966   – Jiří Němec, Czech footballer\n*1967 – Simen Agdestein, Norwegian chess grandmaster and football player\n*  1967   – Laura Hillenbrand, American journalist and author\n*  1967   – John Smoltz, American baseball player and sportscaster\n*1968 – Cecilia Malmström, Swedish academic and politician, 15th European Commissioner for Trade\n*  1968   – Sophie Raworth, English journalist and broadcaster\n*1969 – Hideki Irabu, Japanese-American baseball player (d. 2011)\n*  1969   – Emmitt Smith, American football player and sportscaster\n*1970 – Frank de Boer, Dutch footballer and manager\n*  1970   – Ronald de Boer, Dutch footballer and manager\n*  1970   – Desmond Howard, American football player and sportscaster\n*  1970   – Alison Jackson, English photographer, director, and screenwriter\n*  1970   – Rod Smith, American football player\n*  1970   – Ben Wallace, English captain and politician\n*1971 – Karin Lušnic, Slovenian tennis player\n*1972 – Danny Alexander, Scottish politician, Secretary of State for Scotland\n*  1972   – David Charvet, French actor and singer\n*1974 – Vasilis Kikilias, Greek basketball player and politician\n*  1974   – Matthew Sadler, English chess player and author\n*  1974   – Marko Tredup, German footballer and manager\n*  1974   – Ahmet Zappa, American musician and writer\n*1975 – Ray Lewis, American football player and sportscaster\n*  1975   – Ales Michalevic, Belarusian lawyer and politician\n*1976 – Torraye Braggs, American basketball player\n*  1976   – Mark Kennedy, Irish footballer\n*  1976   – Jacek Krzynówek, Polish footballer\n*  1976   – Ryan Leaf, American football player and coach\n*  1976   – Tyler Walker, American baseball player\n*1978 – Amy Chow, American gymnast and pediatrician\n*  1978   – Dwayne De Rosario, Canadian soccer player \n*  1978   – Edu Gaspar, Brazilian footballer\n*  1978   – David Krumholtz, American actor \n*1979 – Adolfo Bautista, Mexican footballer\n*  1979   – Daniel Caines, English sprinter\n*  1979   – Chris Masoe, New Zealand rugby player\n*  1979   – Ryan Max Riley, American skier \n*  1979   – Robert Royal, American football player\n*1980 – Josh Beckett, American baseball player\n*1981 – Patrice Evra, French footballer\n*  1981   – Justin Morneau, Canadian baseball player\n*  1981   – Zara Phillips, English horse rider \n*  1981   – Jamie-Lynn Sigler, American actress and singer\n*1982 – Veronica Campbell-Brown, Jamaican sprinter\n*  1982   – Segundo Castillo, Ecuadorian footballer\n*  1982   – Rafael Pérez, Dominican baseball player\n*  1982   – Layal Abboud, Lebanese singer\n*1984 – Jeff Deslauriers, Canadian ice hockey player\n*  1984   – Sérgio Jimenez, Brazilian race car driver\n*  1984   – Samantha Noble, Australian actress\n*  1984   – Beau Scott, Australian rugby league player\n*1985 – Cristiane, Brazilian footballer\n*  1985   – Tania Cagnotto, Italian diver\n*  1985   – Laura Harvey, English football coach\n*  1985   – Denis Onyango, Ugandan goalkeeper\n*  1985   – Justine Robbeson, South African javelin thrower\n*1986 – Thomas Brown, American football player\n*  1986   – Matías Fernández, Chilean footballer\n*  1986   – Adam Moffat, Scottish footballer\n*1987 – David Adams, American baseball player\n*  1987   – Michael Brantley, American baseball player\n*  1987   – Brian Dozier, American baseball player\n*  1987   – Mark Fayne, American ice hockey player\n*  1987   – Ersan İlyasova, Turkish basketball player\n*  1987   – Leonardo Mayer, Argentinian tennis player\n*  1987   – Andy Murray, Scottish tennis player\n*1988 – Indrek Kajupank, Estonian basketball player\n*1989 – Mapou Yanga-Mbiwa, French footballer\n*1990 – Jordan Eberle, Canadian ice hockey player.\n*  1990   – Lee Jong-hyun, Korean guitarist.\n*1993 – Jeremy Hawkins, New Zealand rugby league player\n*1997 – Ousmane Dembélé, French footballer\n\nDeaths\n\n* 392 – Valentinian II, Roman emperor (b. 371)\n* 558 – Hilary of Galeata, Christian monk\n* 884 – Pope Marinus I \n* 913 – Hatto I, German archbishop (b. 850)\n* 925 – Nicholas I Mystikos, Byzantine patriarch (b. 852)\n* 926 – Zhuang Zong, emperor of Later Tang (b. 885)\n* 973 – Byrhthelm, bishop of Wells (Somerset)\n*1036 – Emperor Go-Ichijō of Japan (b. 1008)\n*1157 – Yuri Dolgorukiy, Grand Prince of Kiev (b. 1099)\n*1175 – Mleh, Prince of Armenia\n*1174 – Nur ad-Din, atabeg of Aleppo, Seljuk governor of Syria (b. 1118)\n*1268 – Peter II, Count of Savoy (b. 1203)\n*1461 – Domenico Veneziano, Italian painter (b. c. 1410)\n*1464 – Henry Beaufort, 3rd Duke of Somerset (b. 1436)\n*1470 – Charles VIII of Sweden (b. 1409)\n*1585 – Niwa Nagahide, Japanese samurai (b. 1535)\n*1609 – Giovanni Croce, Italian composer and educator (b. 1557)\n*1615 – Henry Bromley, English politician (b. 1560)\n*1634 – Hendrick Avercamp, Dutch painter (b. 1585)\n*1698 – Marie Champmeslé, French actress (b. 1642)\n*1699 – Sir Edward Petre, 3rd Baronet, English politician (b. 1631)\n*1700 – John Hale, American minister (b. 1636)\n*1740 – Ephraim Chambers, English publisher (b. 1680)\n*1773 – Alban Butler, English priest and hagiographer (b. 1710)\n*1845 – Braulio Carrillo Colina, Costa Rican lawyer and politician, Head of State of Costa Rica (b. 1800)\n*1879 – Gottfried Semper, German architect and educator, designed the Semper Opera House (b. 1803)\n*1886 – Emily Dickinson, American poet and author (b. 1830)\n*1919 – Hasan Tahsin, Turkish journalist (b. 1888)\n*1924 – Paul-Henri-Benjamin d'Estournelles de Constant, French diplomat and politician, Nobel Prize laureate (b. 1852)\n*1926 – Joseph James Fletcher, Australian biologist (b. 1850)\n*1928 – Umegatani Tōtarō I, Japanese sumo wrestler, the 15th Yokozuna (b. 1845)\n*1935 – Kazimir Malevich, Ukrainian-Russian painter and theoretician (b. 1878)\n*1937 – Philip Snowden, 1st Viscount Snowden, English politician, Chancellor of the Exchequer (b. 1864)\n*1945 – Charles Williams, English author, poet, and critic (b. 1886)\n*1948 – Edward J. Flanagan, Irish-American priest, founded Boys Town (b. 1886)\n*1954 – William March, American soldier and author (b. 1893)\n*1956 – Austin Osman Spare, English painter and magician (b. 1886)\n*1957 – Keith Andrews, American racing driver (b. 1920)\n*  1957   – Dick Irvin, Canadian ice hockey player and coach (b. 1892)\n*1963 – John Aglionby, English-born Bishop of Accra and soldier (b. 1884)\n*1964 – Vladko Maček, Croatian lawyer and politician (b. 1879)\n*1965 – Pio Pion, Italian businessman (b. 1887)\n*1967 – Edward Hopper, American painter (b. 1882)\n*  1967   – Italo Mus, Italian painter (b. 1892)\n*1969 – Joe Malone, Canadian ice hockey player (b. 1890)\n*1971 – Tyrone Guthrie, English director, producer, and playwright (b. 1900)\n*1978 – Robert Menzies, Australian lawyer and politician, 12th Prime Minister of Australia (b. 1894)\n*1980 – Gordon Prange, American  historian and author (b. 1910)\n*1982 – Gordon Smiley, American race car driver (b. 1946)\n*1984 – Francis Schaeffer, American pastor, theologian, and philosopher (b. 1912)\n*1985 – Jackie Curtis, American actress and writer (b. 1947)\n*1986 – Elio de Angelis, Italian race car driver (b. 1958)\n*  1986   – Theodore H. White, American historian, journalist, and author (b. 1915)\n*1989 – Johnny Green, American composer and conductor (b. 1908)\n*  1989   – Luc Lacourcière, Canadian ethnographer and author (b. 1910)\n*1991 – Andreas Floer, German mathematician and academic (b. 1956)\n*  1991   – Amadou Hampâté Bâ, Malian ethnologist and author (b. 1901)\n*  1991   – Fritz Riess, German race car driver (b. 1922)\n*1993 – Salah Ahmed Ibrahim, Sudanese poet and diplomat (b. 1933)\n*1994 – Gilbert Roland, American actor (b. 1905)\n*1995 – Eric Porter, English actor (b. 1928)\n*1996 – Charles B. Fulton, American lawyer and judge (b. 1910)\n*1998 – Earl Manigault, American basketball player (b. 1944)\n*  1998   – Naim Talu, Turkish economist, banker, politician, 15th Prime Minister of Turkey (b. 1919)\n*2003 – June Carter Cash, American singer-songwriter, guitarist, and actress (b. 1929)\n*2006 – Nizar Abdul Zahra, Iraqi footballer (b. 1961)\n*2007 – Jerry Falwell, American pastor, founded Liberty University (b. 1933)\n*2008 – Tommy Burns, Scottish footballer and manager (b. 1956)\n*  2008   – Alexander Courage, American composer and conductor (b. 1919)\n*2009 – Bud Tingwell, Australian actor, director, and producer (b. 1923)\n*  2009   – Wayman Tisdale, American basketball player and bass player (b. 1964)\n*2010 – Besian Idrizaj, Austrian footballer (b. 1987)\n*  2010   – Loris Kessel, Swiss race car driver (b. 1950)\n*2012 – Carlos Fuentes, Mexican novelist and essayist (b. 1928)\n*  2012   – Arno Lustiger, German historian and author (b. 1924)\n*  2012   – Zakaria Mohieddin, Egyptian soldier and politician, 33rd Prime Minister of Egypt (b. 1918)\n*2013 – Henrique Rosa, Bissau-Guinean politician, President of Guinea-Bissau (b. 1946)\n*2014 – Jean-Luc Dehaene, French-Belgian politician, 63rd Prime Minister of Belgium (b. 1940)\n*  2014   – Noribumi Suzuki, Japanese director and screenwriter (b. 1933)\n*2015 – Elisabeth Bing, German-American physical therapist and author (b. 1914)\n*  2015   – Jackie Brookner, American sculptor and educator (b. 1945)\n*  2015   – Garo Yepremian, Cypriot-American football player (b. 1944)\n\nHolidays and observances\n\n* Aoi Matsuri (Kyoto)\n* Christian feast day:\n** Achillius of Larissa\n** Athanasius of Alexandria (Coptic Church)\n** Dymphna\n** Hallvard Vebjørnsson (Roman Catholic Church)\n** Hesychius of Cazorla\n** Hilary of Galeata\n** Isidore the Laborer, celebrated with festivals in various countries, the beginning of bullfighting season in Madrid.\n** Jean-Baptiste de La Salle (Roman Catholic Church)\n** Peter, Andrew, Paul, and Denise (Roman Catholic Church)\n** Reticius (Roman Catholic Church)\n** Sophia of Rome (Roman Catholic church)\n** May 15 (Eastern Orthodox liturgics)\n* Constituent Assembly Day (Lithuania)\n* Earliest date on which Armed Forces Day (United States) can fall, while May 21 is the latest; celebrated on the third Saturday of May.\n* Earliest date on which Bike-to-Work Day can fall, while May 21 is the latest; celebrated on the third Friday of May. (United States)\n* Independence Day (Paraguay), celebrates the independence of Paraguay from Spain in 1811. Celebrations for the anniversary of the independence begin on Flag Day, May 14.\n* International Day of Families (International)\n* La Corsa dei Ceri begins on the eve of the feast day of Saint Ubaldo. (Gubbio)\n* Mercuralia, in honour of Mercury. (Roman Empire)\n* Nakba Day (Palestinian communities)\n* Peace Officers Memorial Day (United States)\n* Army Day (Slovenia)\n* Teachers' Day (Colombia, Mexico and South Korea)\n* Argei (Ancient Rome)\n* Mother's Day (Paraguay)\n* Republic Day (Lithuania)\n* International Conscientious Objectors Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 15" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19674" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*495 BC – A newly constructed temple in honour of the god Mercury was dedicated in ancient Rome on the Circus Maximus, between the Aventine and Palatine hills. To spite the senate and the consuls, the people awarded the dedication to a senior military officer, Marcus Laetorius.\n* 221 – Liu Bei, Chinese warlord, proclaims himself emperor of Shu Han, the successor of the Han dynasty.\n* 392 – Emperor Valentinian II is assassinated while advancing into Gaul against the Frankish usurper Arbogast. He is found hanging in his residence at Vienne. \n* 589 – King Authari marries Theodelinda, daughter of the Bavarian duke Garibald I. A Catholic, she has great influence among the Lombard nobility.\n* 908 – The three-year-old Constantine VII, the son of Emperor Leo VI the Wise, is crowned as co-emperor of the Byzantine Empire by Patriarch Euthymius I at Constantinople.\n*1252 – Pope Innocent IV issues the papal bull ad extirpanda, which authorizes, but also limits, the torture of heretics in the Medieval Inquisition.\n*1525 – Insurgent peasants led by Anabaptist pastor Thomas Müntzer were defeated at the Battle of Frankenhausen, ending the German Peasants' War in the Holy Roman Empire.\n*1536 – Anne Boleyn, Queen of England, stands trial in London on  charges of treason, adultery and incest; she is condemned to death by a specially-selected jury.\n*1567 – Mary, Queen of Scots marries James Hepburn, 4th Earl of Bothwell, her third husband.\n*1618 – Johannes Kepler confirms his previously rejected discovery of the third law of planetary motion (he first discovered it on March 8 but soon rejected the idea after some initial calculations were made).\n*1648 – The Treaty of Westphalia is signed.\n*1718 – James Puckle, a London lawyer, patents the world's first machine gun.\n*1730 – Robert Walpole effectively became the first Prime Minister of the United Kingdom.\n*1776 – American Revolution: The Fifth Virginia Convention instructs its Continental Congress delegation to propose a resolution of independence from Great Britain, paving the way for the United States Declaration of Independence.\n*1791 – French Revolution: Maximilien Robespierre proposes the Self-denying Ordinance.\n*1792 – War of the First Coalition: France declares war on Kingdom of Sardinia.\n*1793 – Diego Marín Aguilera flies a glider for \"about 360 meters\", at a height of 5–6 meters, during one of the first attempted manned flights.\n*1796 – War of the First Coalition: Napoleon enters Milan in triumph.\n*1800 – King George III of the United Kingdom survives an assassination attempt by James Hadfield, who is later acquitted by reason of insanity.\n*1811 – Paraguay declares independence from Spain.\n*1817 – Opening of the first private mental health hospital in the United States, the Asylum for the Relief of Persons Deprived of the Use of Their Reason (now Friends Hospital, Philadelphia, Pennsylvania).\n*1836 – Francis Baily observes \"Baily's beads\" during an annular eclipse.\n*1848 – Serfdom is abolished in the Habsburg Galicia, as a result of the 1848 revolutions.  The rest of monarchy followed later in the year.\n*1849 – Troops of the Two Sicilies take Palermo and crush the republican government of Sicily.\n*1850 – The Bloody Island massacre takes place in Lake County, California, in which a large number of Pomo Indians are slaughtered by a regiment of the United States Cavalry.\n*1850 – The Arana–Southern Treaty is ratified, ending \"the existing differences\" between Great Britain and Argentina.\n*1851 – The first Australian gold rush is proclaimed, although the discovery had been made three months earlier.\n*1858 – Opening of the present Royal Opera House in Covent Garden, London.\n*1862 – President Abraham Lincoln signs a bill into law creating the United States Bureau of Agriculture. It is later renamed the United States Department of Agriculture.\n*1864 – American Civil War: Battle of New Market, Virginia: Students from the Virginia Military Institute fight alongside the Confederate Army to force Union General Franz Sigel out of the Shenandoah Valley.\n*1867 – Canadian Bank of Commerce opens for business in Toronto, Ontario. The bank would later merge with Imperial Bank of Canada to become what is CIBC in 1961.\n*1869 – Women's suffrage: In New York, Susan B. Anthony and Elizabeth Cady Stanton form the National Woman Suffrage Association.\n*1891 – Pope Leo XIII defends workers' rights and property rights in the encyclical Rerum novarum, the beginning of modern Catholic social teaching.\n*1904 – Russo-Japanese War: The Russian minelayer Amur lays a minefield about 15 miles off Port Arthur and sinks Japan's battleships Hatsuse, 15,000 tons, with 496 crew and Yashima.\n*1905 – Las Vegas is founded when 110 acre, in what later would become downtown, are auctioned off.\n*1911 – In Standard Oil Co. of New Jersey v. United States, the United States Supreme Court declares Standard Oil to be an \"unreasonable\" monopoly under the Sherman Antitrust Act and orders the company to be broken up.\n*  1911   – More than 300 Chinese immigrants are killed in the Torreón massacre when the forces of the Mexican Revolution led by Emilio Madero take the city of Torreón from the Federales. \n*1919 – The Winnipeg general strike begins. By 11:00, almost the whole working population of Winnipeg had walked off the job.\n*  1919   – Greek occupation of Smyrna. During the occupation, the Greek army kills or wounds 350 Turks; those responsible are punished by Greek commander Aristides Stergiades.\n*1925 – Al-Insaniyyah, the first Arabic communist newspaper, is founded.\n*1928 – Walt Disney character Mickey Mouse premieres in his first cartoon, \"Plane Crazy\".\n*1929 – A fire at the Cleveland Clinic in Cleveland, Ohio kills 123.\n*1932 – In an attempted coup d'état, the Prime Minister of Japan Inukai Tsuyoshi is assassinated.\n*1933 – All military aviation organizations within, or under the control of, the RLM of Germany were officially merged in a covert manner, to form its Wehrmacht military's air arm, the Luftwaffe.\n*1934 – Kārlis Ulmanis establishes an authoritarian government in Latvia.\n*1940 –  is recommissioned. It was originally the USS Squalus.\n*  1940   – World War II: After fierce fighting, the poorly trained and equipped Dutch troops surrender to Germany, marking the beginning of five years of occupation.\n*  1940   – McDonald's opens its first restaurant in San Bernardino, California.\n*1941 – First flight of the Gloster E.28/39 the first British and Allied jet aircraft.\n*  1941   – Joe DiMaggio begins a 56-game hitting streak.\n*1942 – World War II: In the United States, a bill creating the Women's Army Auxiliary Corps (WAAC) is signed into law.\n*1943 – Joseph Stalin dissolves the Comintern (or Third International).\n*1945 – World War II: The Battle of Poljana, the final skirmish in Europe is fought near Prevalje, Slovenia.\n*1948 – Following the expiration of The British Mandate for Palestine, the Kingdom of Egypt, Transjordan, Lebanon, Syria, Iraq and Saudi Arabia invade Israel thus starting the 1948 Arab–Israeli War.\n*1957 – At Malden Island in the Pacific Ocean, Britain tests its first hydrogen bomb in Operation Grapple.\n*1958 – The Soviet Union launches Sputnik 3.\n*1960 – The Soviet Union launches Sputnik 4.\n*1963 – Project Mercury: The launch of the final Mercury mission, Mercury-Atlas 9 with astronaut Gordon Cooper on board. He becomes the first American to spend more than a day in space, and the last American to go into space alone.\n*1966 – After a policy dispute, Prime Minister Nguyễn Cao Kỳ of South Vietnam's ruling junta launches a military attack on the forces of General Tôn Thất Đính, forcing him to abandon his command.\n*1969 – People's Park: California Governor Ronald Reagan has an impromptu student park owned by the University of California at Berkeley fenced off from student anti-war protestors, sparking a riot.\n*1970 – President Richard Nixon appoints Anna Mae Hays and Elizabeth P. Hoisington the first female United States Army generals.\n*  1970   – Philip Lafayette Gibbs and James Earl Green are killed at Jackson State University by police during student protests.\n*1972 – Ryukyu Islands, under U.S. military governance since its conquest in 1945, hand over to Japanese control.\n*  1972   – In Laurel, Maryland, Arthur Bremer shoots and paralyzes Alabama Governor George Wallace while he is campaigning to become President.\n*1974 – Ma'alot massacre: Members of the Democratic Front for the Liberation of Palestine attack and take hostages at an Israeli school; a total of 31 people are killed, including 22 schoolchildren.\n*1987 – The Soviet Union launches the Polyus prototype orbital weapons platform. It fails to reach orbit.\n*1988 – Soviet–Afghan War: After more than eight years of fighting, the Soviet Army begins to withdraw 115,000 troops from Afghanistan.\n*1991 – Édith Cresson becomes France's first female premier.\n*1997 – The United States government acknowledges the existence of the \"Secret War\" in Laos and dedicates the Laos Memorial in honor of Hmong and other \"Secret War\" veterans.\n*2004 – Arsenal F.C. go an entire league campaign unbeaten in the English Premier League, joining Preston North End F.C with the right to claim the title The Invincibles\n*2008 – California becomes the second U.S. state after Massachusetts in 2004 to legalize same-sex marriage after the state's own Supreme Court rules a previous ban unconstitutional.\n*2010 – Jessica Watson becomes the youngest person to sail, non-stop and unassisted around the world solo.\n*2013 – An upsurge in violence in Iraq leaves more than 389 people dead over three days.\n\nBirths\n\n*1397 – Sejong the Great, Korean king (d. 1450)\n*1531 – Maria of Austria, Duchess of Jülich-Cleves-Berg (d. 1581)\n*1553 – Margaret of Valois, Queen of France (d. 1615)\n*1565 – Hendrick de Keyser, Dutch sculptor and architect born in Utrecht (d. 1621)\n*1567 – Claudio Monteverdi, Italian priest and composer (d. 1643)\n*1608 – René Goupil, French-American missionary and saint (d. 1642)\n*1633 – Sébastien Le Prestre de Vauban, French noble (d. 1707)\n*1645 – George Jeffreys, 1st Baron Jeffreys, British judge (d. 1689)\n*1689 – Lady Mary Wortley Montagu, English author and playwright (d. 1762)\n*1720 – Maximilian Hell, Hungarian priest and astronomer (d. 1792)\n*1749 – Levi Lincoln Sr., American lawyer and politician, 4th United States Attorney General (d. 1820)\n*1759 – Maria Theresia von Paradis, Austrian pianist and composer (d. 1824)\n*1764 – Johann Nepomuk Kalcher, German organist and composer (d. 1827)\n*1770 – Ezekiel Hart, Canadian businessman and politician (d. 1843)\n*1773 – Klemens von Metternich, German-Austrian politician, 1st State Chancellor of the Austrian Empire (d. 1859)\n*1786 – Dimitris Plapoutas, Greek general and politician (d. 1864)\n*1808 – Michael William Balfe, Irish composer and conductor (d. 1870)\n*1817 – Debendranath Tagore, Indian philosopher and author (d. 1905)\n*1841 – Clarence Dutton, American commander and geologist (d. 1912)\n*1848 – Viktor Vasnetsov, Russian painter and illustrator (d. 1926)\n*1854 – Ioannis Psycharis, Ukrainian-French philologist and author (d. 1929)\n*1856 – L. Frank Baum, American novelist (d. 1919)\n*  1856   – Matthias Zurbriggen, Swiss mountaineer (d. 1917)\n*1857 – Williamina Fleming, Scottish-American astronomer and academic (d. 1911)\n*1859 – Pierre Curie, French physicist and academic, Nobel Prize laureate (d. 1906)\n*1862 – Arthur Schnitzler, Austrian author and playwright (d. 1931)\n*1863 – Frank Hornby, English businessman and politician, invented Meccano (d. 1936)\n*1869 – Paul Probst, Swiss target shooter (d. 1945)\n*  1869   – John Storey, Australian politician, 20th Premier of New South Wales (d. 1921) \n*1890 – Katherine Anne Porter, American short story writer, novelist, and essayist (d. 1980)\n*1891 – Mikhail Bulgakov, Russian novelist and playwright (d. 1940)\n*  1891   – Fritz Feigl, Austrian-Brazilian chemist and academic (d. 1971)\n*1892 – Charles E. Rosendahl, American admiral (d. 1977)\n*  1892   – Jimmy Wilde, Welsh boxer (d. 1969)\n*1894 – Feg Murray, American hurdler and cartoonist (d. 1973)\n*1895 – Prescott Bush, American captain, banker, and politician (d. 1972)\n*  1895   – William D. Byron, American lieutenant and politician (d. 1941)\n*1898 – Arletty, French model, actress, and singer (d. 1992)\n*1899 – Jean Étienne Valluy, French general (d. 1970)\n*1900 – Ida Rhodes, American mathematician, pioneer in computer programming (d. 1986) \n*1901 – Xavier Herbert, Australian author (d. 1984)\n*  1901   – Luis Monti, Argentinian-Italian footballer and manager (d. 1983)\n*1902 – Richard J. Daley, American lawyer and politician, 48th Mayor of Chicago (d. 1976)\n*  1902   – Sigizmund Levanevsky, Soviet aircraft pilot of Polish origin (d. 1937)\n*1903 – Maria Reiche, German mathematician and archaeologist (d. 1998)\n*1904 – Clifton Fadiman, American game show host and author (d. 1999)\n*1905 – Joseph Cotten, American actor (d. 1994)\n*  1905   – Albert Dubout, French cartoonist, illustrator, painter, and sculptor (d. 1976)\n*  1905   – Abraham Zapruder, American businessman and amateur photographer, filmed the Zapruder film (d. 1970)\n*1907 – Sukhdev Thapar, Indian activist (d. 1931)\n*1909 – James Mason, English actor, producer, and screenwriter (d. 1984)\n*  1909   – Clara Solovera, Chilean singer-songwriter (d. 1992)\n*1910 – Constance Cummings, British-based American actress (d. 2005)\n*1911 – Max Frisch, Swiss playwright and novelist (d. 1991)\n*  1911   – Herta Oberheuser, German physician (d. 1978)\n*1912 – Arthur Berger, American composer and educator (d. 2003)\n*1914 – Turk Broda, Canadian ice hockey player and coach (d. 1972)\n*  1914   – Angus MacLean, Canadian farmer and politician, 25th Premier of Prince Edward Island (d. 2000)\n*  1914   – Norrie Paramor, English composer, producer, and conductor (d. 1979)\n*1915 – Hilda Bernstein, English-South African author and activist (d. 2006)\n*  1915   – Paul Samuelson, American economist and academic, Nobel Prize laureate (d. 2009)\n*  1915   – Henrik Sandberg, Danish production manager and producer (d. 1993)\n*1916 – Vera Gebuhr, Danish actress (d. 2014)\n*1918 – Eddy Arnold, American singer-songwriter, guitarist, and actor (d. 2008)\n*  1918   – Arthur Jackson, American lieutenant and target shooter (d. 2015)\n*  1918   – Joseph Wiseman, Canadian-American actor (d. 2009)\n*1920 – Michel Audiard, French director and screenwriter (d. 1985)\n*  1920   – Louis Siminovitch, Canadian biologist and academic\n*1922 – Sigurd Ottovich Schmidt, Russian historian and ethnographer (d. 2013)\n*  1922   – Jakucho Setouchi, Japanese nun and author\n*1923 – Richard Avedon, American sailor and photographer (d. 2004)\n*  1923   – John Lanchbery, English-Australian composer and conductor (d. 2003)\n*1924 – Maria Koepcke, German-Peruvian ornithologist and zoologist (d. 1971)\n*1925 – Andrei Eshpai, Russian pianist and composer (d. 2015) \n*  1925   – Mary F. Lyon, English geneticist and biologist (d. 2014)\n*  1925   – Carl Sanders, American soldier, pilot, and politician, 74th Governor of Georgia (d. 2014)\n*  1925   – Roy Stewart, Jamaican-English actor and stuntman (d. 2008)\n*1926 – Clermont Pépin, Canadian pianist, composer, and educator (d. 2006)\n*  1926   – Anthony Shaffer, English author, playwright, and screenwriter (d. 2001)\n*  1926   – Peter Shaffer, English playwright and screenwriter (d. 2016)\n*1930 – Jasper Johns, American painter and sculptor\n*1931 – Ken Venturi, American golfer and sportscaster (d. 2013)\n*1935 – Don Bragg, American pole vaulter\n*  1935   – Ted Dexter, Italian-English cricketer\n*  1935   – Utah Phillips, American singer-songwriter and guitarist (d. 2008)\n*1936 – Anna Maria Alberghetti, Italian-American actress and singer\n*  1936   – Mart Laga, Estonian basketball player (d. 1977)\n*  1936   – Ralph Steadman, English painter and illustrator\n*  1936   – Paul Zindel, American playwright and novelist (d. 2003)\n*1937 – Madeleine Albright, Czech-American politician and diplomat, 64th United States Secretary of State\n*  1937   – Karin Krog, Norwegian singer\n*  1937   – Trini Lopez, American singer, guitarist, and actor\n*1938 – Mireille Darc, French actress, director, and screenwriter\n*  1938   – Nancy Garden, American author (d. 2014)\n*1939 – Dorothy Shirley, English high jumper and educator\n*1940 – Roger Ailes, American businessman (d. 2017)\n*  1940   – Lainie Kazan, American actress and singer\n*  1940   – Don Nelson, American basketball player and coach\n*1941 – Jaxon, American illustrator and publisher, co-founded the Rip Off Press (d. 2006)\n*1942 – Lois Johnson, American singer-songwriter (d. 2014)\n*  1942   – Jusuf Kalla, Indonesian businessman and politician, 10th Vice President of Indonesia\n*  1942   – Doug Lowe, Australian politician, 35th Premier of Tasmania\n*  1942   – K. T. Oslin, American singer-songwriter and actress\n*1943 – Paul Bégin, Canadian lawyer and politician\n*  1943   – Freddie Perren, American songwriter, producer, and conductor (d. 2004)\n*1944 – Bill Alter, American police officer and politician\n*  1944   – Ulrich Beck, German sociologist and academic (d. 2015)\n*1945 – Michael Dexter, English hematologist and academic\n*  1945   – Jerry Quarry, American boxer (d. 1999)\n*1946 – Thadeus Nguyễn Văn Lý, Vietnamese priest and activist\n*1947 – Graeham Goble, Australian singer-songwriter, guitarist and producer\n*1948 – Yutaka Enatsu, Japanese baseball player\n*  1948   – Brian Eno, English singer-songwriter, keyboard player, and producer \n*  1948   – Kathleen Sebelius, American politician, 44th Governor of Kansas\n*1949 – Frank L. Culbertson Jr., American captain, pilot, and astronaut\n*  1949   – Robert S.J. Sparks, English geologist and academic\n*1950 – Jim Bacon, Australian politician, 41st Premier of Tasmania (d. 2004)\n*  1950   – Jim Simons, American golfer (d. 2005) \n*1951 – Dennis Frederiksen, American singer-songwriter (d. 2014)\n*  1951   – Chris Ham, English political scientist and academic\n*  1951   – Frank Wilczek, American mathematician and physicist, Nobel Prize laureate\n*1952 – Chazz Palminteri, American actor, director, producer, and screenwriter\n*1953 – George Brett, American baseball player and coach\n*  1953   – Athene Donald, English physicist and academic\n*  1953   – Mike Oldfield, English-Irish singer-songwriter, guitarist, and producer \n*1954 – Diana Liverman, English-American geographer and academic\n*  1954   – Caroline Thomson, English journalist and broadcaster\n*1955 – Mohamed Brahmi, Tunisian politician (d. 2013)\n*  1955   – Lia Vissi, Cypriot singer-songwriter and politician\n*1956 – Andreas Loverdos, Greek lawyer and politician, Greek Minister of Labour\n*  1956   – Dan Patrick, American television anchor and sportscaster \n*  1956   – Kevin Greenaugh, American nuclear engineer\n*1957 – Meg Gardiner, American-English author and academic\n*  1957   – Juan José Ibarretxe, Spanish politician\n*  1957   – Kevin Von Erich, American football player and wrestler\n*1958 – Jason Graae, American musical theater actor\n*  1958   – Ron Simmons, American football player and wrestler\n*1959 – Khaosai Galaxy, Thai boxer and politician\n*  1959   – Luis Pérez-Sala, Spanish race car driver\n*  1959   – Beverly Jo Scott, American-Belgian singer-songwriter\n*1960 – Rhonda Burchmore, Australian actress, singer, and dancer\n*  1960   – Rob Bowman, American director and producer\n*  1960   – R. Kuhaneswaran, Sri Lankan politician\n*  1960   – Rimas Kurtinaitis, Lithuanian basketball player and coach\n*1962 – Lisa Curry, Australian swimmer \n*1964 – Lars Løkke Rasmussen, Danish lawyer and politician, 40th Prime Minister of Denmark\n*1965 – André Abujamra, Brazilian singer-songwriter and guitarist\n*  1965   – Scott Tronc, Australian rugby league player\n*  1966   – Jiří Němec, Czech footballer\n*1967 – Simen Agdestein, Norwegian chess grandmaster and football player\n*  1967   – Laura Hillenbrand, American journalist and author\n*  1967   – John Smoltz, American baseball player and sportscaster\n*1968 – Cecilia Malmström, Swedish academic and politician, 15th European Commissioner for Trade\n*  1968   – Sophie Raworth, English journalist and broadcaster\n*1969 – Hideki Irabu, Japanese-American baseball player (d. 2011)\n*  1969   – Emmitt Smith, American football player and sportscaster\n*1970 – Frank de Boer, Dutch footballer and manager\n*  1970   – Ronald de Boer, Dutch footballer and manager\n*  1970   – Desmond Howard, American football player and sportscaster\n*  1970   – Alison Jackson, English photographer, director, and screenwriter\n*  1970   – Rod Smith, American football player\n*  1970   – Ben Wallace, English captain and politician\n*1971 – Karin Lušnic, Slovenian tennis player\n*1972 – Danny Alexander, Scottish politician, Secretary of State for Scotland\n*  1972   – David Charvet, French actor and singer\n*1974 – Vasilis Kikilias, Greek basketball player and politician\n*  1974   – Matthew Sadler, English chess player and author\n*  1974   – Marko Tredup, German footballer and manager\n*  1974   – Ahmet Zappa, American musician and writer\n*1975 – Ray Lewis, American football player and sportscaster\n*  1975   – Ales Michalevic, Belarusian lawyer and politician\n*1976 – Torraye Braggs, American basketball player\n*  1976   – Mark Kennedy, Irish footballer\n*  1976   – Jacek Krzynówek, Polish footballer\n*  1976   – Ryan Leaf, American football player and coach\n*  1976   – Tyler Walker, American baseball player\n*1978 – Amy Chow, American gymnast and pediatrician\n*  1978   – Dwayne De Rosario, Canadian soccer player \n*  1978   – Edu Gaspar, Brazilian footballer\n*  1978   – David Krumholtz, American actor \n*1979 – Adolfo Bautista, Mexican footballer\n*  1979   – Daniel Caines, English sprinter\n*  1979   – Chris Masoe, New Zealand rugby player\n*  1979   – Ryan Max Riley, American skier \n*  1979   – Robert Royal, American football player\n*1980 – Josh Beckett, American baseball player\n*1981 – Patrice Evra, French footballer\n*  1981   – Justin Morneau, Canadian baseball player\n*  1981   – Zara Phillips, English horse rider \n*  1981   – Jamie-Lynn Sigler, American actress and singer\n*1982 – Veronica Campbell-Brown, Jamaican sprinter\n*  1982   – Segundo Castillo, Ecuadorian footballer\n*  1982   – Rafael Pérez, Dominican baseball player\n*  1982   – Layal Abboud, Lebanese singer\n*1984 – Jeff Deslauriers, Canadian ice hockey player\n*  1984   – Sérgio Jimenez, Brazilian race car driver\n*  1984   – Samantha Noble, Australian actress\n*  1984   – Beau Scott, Australian rugby league player\n*1985 – Cristiane, Brazilian footballer\n*  1985   – Tania Cagnotto, Italian diver\n*  1985   – Laura Harvey, English football coach\n*  1985   – Denis Onyango, Ugandan goalkeeper\n*  1985   – Justine Robbeson, South African javelin thrower\n*1986 – Thomas Brown, American football player\n*  1986   – Matías Fernández, Chilean footballer\n*  1986   – Adam Moffat, Scottish footballer\n*1987 – David Adams, American baseball player\n*  1987   – Michael Brantley, American baseball player\n*  1987   – Brian Dozier, American baseball player\n*  1987   – Mark Fayne, American ice hockey player\n*  1987   – Ersan İlyasova, Turkish basketball player\n*  1987   – Leonardo Mayer, Argentinian tennis player\n*  1987   – Andy Murray, Scottish tennis player\n*1988 – Indrek Kajupank, Estonian basketball player\n*1989 – Mapou Yanga-Mbiwa, French footballer\n*1990 – Jordan Eberle, Canadian ice hockey player.\n*  1990   – Lee Jong-hyun, Korean guitarist.\n*1993 – Jeremy Hawkins, New Zealand rugby league player\n*1997 – Ousmane Dembélé, French footballer\n\nDeaths\n\n* 392 – Valentinian II, Roman emperor (b. 371)\n* 558 – Hilary of Galeata, Christian monk\n* 884 – Pope Marinus I \n* 913 – Hatto I, German archbishop (b. 850)\n* 925 – Nicholas I Mystikos, Byzantine patriarch (b. 852)\n* 926 – Zhuang Zong, emperor of Later Tang (b. 885)\n* 973 – Byrhthelm, bishop of Wells (Somerset)\n*1036 – Emperor Go-Ichijō of Japan (b. 1008)\n*1157 – Yuri Dolgorukiy, Grand Prince of Kiev (b. 1099)\n*1175 – Mleh, Prince of Armenia\n*1174 – Nur ad-Din, atabeg of Aleppo, Seljuk governor of Syria (b. 1118)\n*1268 – Peter II, Count of Savoy (b. 1203)\n*1461 – Domenico Veneziano, Italian painter (b. c. 1410)\n*1464 – Henry Beaufort, 3rd Duke of Somerset (b. 1436)\n*1470 – Charles VIII of Sweden (b. 1409)\n*1585 – Niwa Nagahide, Japanese samurai (b. 1535)\n*1609 – Giovanni Croce, Italian composer and educator (b. 1557)\n*1615 – Henry Bromley, English politician (b. 1560)\n*1634 – Hendrick Avercamp, Dutch painter (b. 1585)\n*1698 – Marie Champmeslé, French actress (b. 1642)\n*1699 – Sir Edward Petre, 3rd Baronet, English politician (b. 1631)\n*1700 – John Hale, American minister (b. 1636)\n*1740 – Ephraim Chambers, English publisher (b. 1680)\n*1773 – Alban Butler, English priest and hagiographer (b. 1710)\n*1845 – Braulio Carrillo Colina, Costa Rican lawyer and politician, Head of State of Costa Rica (b. 1800)\n*1879 – Gottfried Semper, German architect and educator, designed the Semper Opera House (b. 1803)\n*1886 – Emily Dickinson, American poet and author (b. 1830)\n*1919 – Hasan Tahsin, Turkish journalist (b. 1888)\n*1924 – Paul-Henri-Benjamin d'Estournelles de Constant, French diplomat and politician, Nobel Prize laureate (b. 1852)\n*1926 – Joseph James Fletcher, Australian biologist (b. 1850)\n*1928 – Umegatani Tōtarō I, Japanese sumo wrestler, the 15th Yokozuna (b. 1845)\n*1935 – Kazimir Malevich, Ukrainian-Russian painter and theoretician (b. 1878)\n*1937 – Philip Snowden, 1st Viscount Snowden, English politician, Chancellor of the Exchequer (b. 1864)\n*1945 – Charles Williams, English author, poet, and critic (b. 1886)\n*1948 – Edward J. Flanagan, Irish-American priest, founded Boys Town (b. 1886)\n*1954 – William March, American soldier and author (b. 1893)\n*1956 – Austin Osman Spare, English painter and magician (b. 1886)\n*1957 – Keith Andrews, American racing driver (b. 1920)\n*  1957   – Dick Irvin, Canadian ice hockey player and coach (b. 1892)\n*1963 – John Aglionby, English-born Bishop of Accra and soldier (b. 1884)\n*1964 – Vladko Maček, Croatian lawyer and politician (b. 1879)\n*1965 – Pio Pion, Italian businessman (b. 1887)\n*1967 – Edward Hopper, American painter (b. 1882)\n*  1967   – Italo Mus, Italian painter (b. 1892)\n*1969 – Joe Malone, Canadian ice hockey player (b. 1890)\n*1971 – Tyrone Guthrie, English director, producer, and playwright (b. 1900)\n*1978 – Robert Menzies, Australian lawyer and politician, 12th Prime Minister of Australia (b. 1894)\n*1980 – Gordon Prange, American  historian and author (b. 1910)\n*1982 – Gordon Smiley, American race car driver (b. 1946)\n*1984 – Francis Schaeffer, American pastor, theologian, and philosopher (b. 1912)\n*1985 – Jackie Curtis, American actress and writer (b. 1947)\n*1986 – Elio de Angelis, Italian race car driver (b. 1958)\n*  1986   – Theodore H. White, American historian, journalist, and author (b. 1915)\n*1989 – Johnny Green, American composer and conductor (b. 1908)\n*  1989   – Luc Lacourcière, Canadian ethnographer and author (b. 1910)\n*1991 – Andreas Floer, German mathematician and academic (b. 1956)\n*  1991   – Amadou Hampâté Bâ, Malian ethnologist and author (b. 1901)\n*  1991   – Fritz Riess, German race car driver (b. 1922)\n*1993 – Salah Ahmed Ibrahim, Sudanese poet and diplomat (b. 1933)\n*1994 – Gilbert Roland, American actor (b. 1905)\n*1995 – Eric Porter, English actor (b. 1928)\n*1996 – Charles B. Fulton, American lawyer and judge (b. 1910)\n*1998 – Earl Manigault, American basketball player (b. 1944)\n*  1998   – Naim Talu, Turkish economist, banker, politician, 15th Prime Minister of Turkey (b. 1919)\n*2003 – June Carter Cash, American singer-songwriter, guitarist, and actress (b. 1929)\n*2006 – Nizar Abdul Zahra, Iraqi footballer (b. 1961)\n*2007 – Jerry Falwell, American pastor, founded Liberty University (b. 1933)\n*2008 – Tommy Burns, Scottish footballer and manager (b. 1956)\n*  2008   – Alexander Courage, American composer and conductor (b. 1919)\n*2009 – Bud Tingwell, Australian actor, director, and producer (b. 1923)\n*  2009   – Wayman Tisdale, American basketball player and bass player (b. 1964)\n*2010 – Besian Idrizaj, Austrian footballer (b. 1987)\n*  2010   – Loris Kessel, Swiss race car driver (b. 1950)\n*2012 – Carlos Fuentes, Mexican novelist and essayist (b. 1928)\n*  2012   – Arno Lustiger, German historian and author (b. 1924)\n*  2012   – Zakaria Mohieddin, Egyptian soldier and politician, 33rd Prime Minister of Egypt (b. 1918)\n*2013 – Henrique Rosa, Bissau-Guinean politician, President of Guinea-Bissau (b. 1946)\n*2014 – Jean-Luc Dehaene, French-Belgian politician, 63rd Prime Minister of Belgium (b. 1940)\n*  2014   – Noribumi Suzuki, Japanese director and screenwriter (b. 1933)\n*2015 – Elisabeth Bing, German-American physical therapist and author (b. 1914)\n*  2015   – Jackie Brookner, American sculptor and educator (b. 1945)\n*  2015   – Garo Yepremian, Cypriot-American football player (b. 1944)\n\nHolidays and observances\n\n* Aoi Matsuri (Kyoto)\n* Christian feast day:\n** Achillius of Larissa\n** Athanasius of Alexandria (Coptic Church)\n** Dymphna\n** Hallvard Vebjørnsson (Roman Catholic Church)\n** Hesychius of Cazorla\n** Hilary of Galeata\n** Isidore the Laborer, celebrated with festivals in various countries, the beginning of bullfighting season in Madrid.\n** Jean-Baptiste de La Salle (Roman Catholic Church)\n** Peter, Andrew, Paul, and Denise (Roman Catholic Church)\n** Reticius (Roman Catholic Church)\n** Sophia of Rome (Roman Catholic church)\n** May 15 (Eastern Orthodox liturgics)\n* Constituent Assembly Day (Lithuania)\n* Earliest date on which Armed Forces Day (United States) can fall, while May 21 is the latest; celebrated on the third Saturday of May.\n* Earliest date on which Bike-to-Work Day can fall, while May 21 is the latest; celebrated on the third Friday of May. (United States)\n* Independence Day (Paraguay), celebrates the independence of Paraguay from Spain in 1811. Celebrations for the anniversary of the independence begin on Flag Day, May 14.\n* International Day of Families (International)\n* La Corsa dei Ceri begins on the eve of the feast day of Saint Ubaldo. (Gubbio)\n* Mercuralia, in honour of Mercury. (Roman Empire)\n* Nakba Day (Palestinian communities)\n* Peace Officers Memorial Day (United States)\n* Army Day (Slovenia)\n* Teachers' Day (Colombia, Mexico and South Korea)\n* Argei (Ancient Rome)\n* Mother's Day (Paraguay)\n* Republic Day (Lithuania)\n* International Conscientious Objectors Day. May 15. http://en.wikipedia.org/?curid=19674."
  }
}
