{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18642",
  "eid" : "3426bb50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596741,
  "textBody" : "Ian Fraser Kilmister (24 December 1945 – 28 December 2015), better known as Lemmy, was an English musician and singer-songwriter who founded and fronted the rock band Motörhead. His music was one of the foundations of the heavy metal genre. He was known for his appearance (including his friendly mutton chops), his distinctive gravelly, \"rasp[y]\" singing voice, which \"...was one of the most recognisable voices in rock\", and his way of singing, looking up towards \"...a towering microphone tilted down into his weather-beaten face\". He was also known for his unmistakable bass playing style, in which he used his Rickenbacker bass to create an \"overpowered, distorted rhythmic rumble\". Another unique aspect of Lemmy's bass sound is that he often played power chords using growling overdriven Marshall tube bass stacks. Alongside his music career, he also had many minor roles and cameo appearances in film and television.\n\nLemmy was born in Stoke-on-Trent and grew up in Staffordshire and later North Wales. He was influenced by rock and roll and the early works of the Beatles, which led to him playing in several rock groups in the 1960s; including the Rockin' Vickers. He worked as a roadie for Jimi Hendrix and The Nice, before joining the space rock band Hawkwind in 1971, singing lead vocals on their hit \"Silver Machine\". After being fired from Hawkwind for drug possession in 1975, he founded Motörhead during the same year as the lead singer, bassist, songwriter and frontman. Motörhead's success peaked in 1980 and 1981 and included the hit single \"Ace of Spades\" and the top charting live album No Sleep 'til Hammersmith. Lemmy continued to record and tour regularly with Motörhead until his death in December 2015 in Los Angeles, where he had lived since 1990.\n\nAside from his musical activities, Lemmy was well known for his hard-living lifestyle, chain smoking, and regular consumption of alcohol (notably Jack Daniel's Tennessee whiskey) and amphetamines.\n\nEarly life\n\nLemmy was born on Christmas Eve in the Burslem area of Stoke-on-Trent, Staffordshire.[http://www.bbc.co.uk/stoke/content/articles/2009/09/08/lemmy_book_feature.shtml Lemmy: White Line Fever] BBC News Stoke and Staffordshire article. Retrieved on 22 August 2014. When he was three months old, his father,Overkill: The Story of Motorhead, Joel McIver, Omnibus Press, 2011 an ex-Royal Air Force chaplain and concert pianist, separated from his mother. His mother and grandmother moved to nearby Newcastle-under-Lyme, then to Madeley. When Lemmy was ten years old, his mother married former footballer George Willis, who already had two older children from a previous marriage, Patricia and Tony, with whom Lemmy did not get along.\n\nThe family moved to a farm in the Welsh town of Benllech, Anglesey, with Lemmy later commenting that \"funnily enough, being the only English kid among 700 Welsh ones didn't make for the happiest time, but it was interesting from an anthropological point of view\". He attended Sir Thomas Jones' School in Amlwch, where he was nicknamed \"Lemmy\". It was later suggested by some that the name originated from the phrase \"lemmy [lend me] a quid 'til Friday\" because of his alleged habit of borrowing money from people to play slot machines,Motorhead Videobiography (Double DVD with 48-page book) Edgehill Publishing Ltd., June 2007  although Lemmy himself said that he did not know the origin of the name. He soon started to show an interest in rock and roll music, girls, and horses.\n\nAt school, Lemmy noticed a pupil who had brought a guitar to school and had been \"surrounded by chicks\". His mother had a guitar, which he then took to school, even though he could not play, and was himself surrounded by girls. By the time he left school, his family had moved to Conwy. Whilst there, he worked at menial jobs; including one at the local Hotpoint electric appliance factory, while also playing guitar for local bands such as the Sundowners and spending time at a horse-riding school. Lemmy saw the Beatles perform at the Cavern Club when he was sixteen, and then learned to play along on guitar to their first album Please Please Me. He also admired the sarcastic attitude of the group, particularly that of John Lennon.\n\nRecording and performing career\n\n1960–1970: Early years\n\nIn Stockport, Lemmy joined local bands the Rainmakers and then the Motown Sect who played northern clubs for three years. In 1965, he joined the Rockin' Vickers[http://www.inkedmag.com/articles/detail/123/damage-case-lemmy-kilmister/ ]  who signed a deal with CBS, released three singles and toured Europe, reportedly being the first British band to visit the Socialist Federal Republic of Yugoslavia. The Rockin' Vickers moved to Manchester, where they shared a flat together. There, Lemmy got involved with a woman named Tracy who bore him a son, Paul Inder. Lemmy did not have any involvement in his life until the boy was six.\n\nLeaving the Rockin' Vickers, Lemmy moved to London in 1967. He shared a flat with Noel Redding, bassist of the Jimi Hendrix Experience, and with Neville Chesters, their manager. He got a job as a roadie for the band. In 1968, he joined the psychedelic rock band Sam Gopal under the name Ian Willis and recorded the album Escalator which was released in 1969. After meeting Simon King at a shopping centre in Chelsea in 1969, he joined the band Opal Butterfly; but the group soon disbanded, having failed to raise enough interest with their singles.\n\n1971–1975: Hawkwind\n\nSee also Hawkwind (1970–75: United Artists era)\nIn August 1971, Lemmy joined the space rock band Hawkwind, who were based in Ladbroke Grove, London, as a bassist and vocalist. He had no previous experience as a bass guitarist, and was cajoled into joining immediately before a benefit gig in Notting Hill by bandmate Dik Mik to have two members who enjoyed amphetamines. He quickly developed a distinctive style that was strongly shaped by his early experience as a rhythm guitarist, often using double stops and chords rather than the single note lines preferred by most bassists. His bass work was a fundamental part of the Hawkwind sound during his tenure, perhaps best documented on Space Ritual. He also provided the lead vocals on several songs, including the band's biggest UK chart single, \"Silver Machine\", which reached #3 in 1972.\n\nIn 1975, Lemmy was arrested at the Canada/United States border in Windsor, Ontario, on drug possession charges; he spent five days in jail but was released without charge. Nonetheless, he was fired from Hawkwind.\n\n1975–2015: Motörhead\n\nAfter Hawkwind, Lemmy formed a new band called \"Bastard\" with guitarist Larry Wallis (former member of the Pink Fairies, Steve Took's Shagrat and UFO) and drummer Lucas Fox. Lemmy and Took were friends, and Took was the stepfather to Lemmy's son Paul. When his manager informed him that a band by the name of \"Bastard\" would never get a slot on Top of the Pops, Lemmy changed the band's name to \"Motörhead\" – the title of the last song he had written for Hawkwind.\n \nSoon after, both Wallis and Fox were replaced with guitarist \"Fast\" Eddie Clarke and drummer Phil \"Philthy Animal\" Taylor and with this line-up, the band began to achieve success. Lemmy's guttural vocals were unique in rock at that time, and were copied during the time when punk rock became popular. The band's sound appealed to Lemmy's original fans and, eventually, to fans of punk. Lemmy asserted that he generally felt more kinship with punks than with metalheads; he even played with the Damned for a handful of gigs when they had no regular bassist.see the notes for Smash It Up – The Anthology 1976 – 1987 The band's success peaked in 1980 and 1981 with several UK chart hits, including the single \"Ace of Spades\", which remained a crowd favourite throughout the band's career, and the UK #1 live album No Sleep 'til Hammersmith. Motörhead became one of the most influential bands in the heavy metal genre. Their – and Lemmy's – final live performance was in Berlin, Germany on 11 December 2015.\n\nPersonal life\n\nAt the age of 17, Lemmy met a holidaying girl named Cathy. He followed her to Stockport, Greater Manchester, where she gave birth to his son Sean, who was put up for adoption. In the 2010 documentary film Lemmy, he mentioned having a son whose mother has only recently \"found him\" and \"hadn't got the heart to tell him who his father was\", indicating that the boy – perhaps Sean – was given up for adoption.\n\nIn the Channel 4 documentary Motörhead: Live Fast, Die Old, broadcast on 22 August 2005, it was claimed that Lemmy had \"bedded\" in excess of 2,000 women. Lemmy stated: \"I said more than a thousand, the magazine made two thousand of it.\"  Maxim had Lemmy at #8 on its top ten \"Living Sex Legends\" list, as they claimed that he had slept with around 1,200 women. Lemmy is one of the characters in the book Sex Tips from Rock Stars by Paul Miles.\n\nDave Grohl, on his Probot website, describes musicians with whom he has worked. In his entry for Lemmy, he wrote:\n\nLemmy was well known for his alcohol abuse. The documentary Live Fast Die Old stated that he drank a bottle of Jack Daniel's every day and had done so since he was 30 years old. In 2013, Lemmy stopped drinking Jack Daniel's for health reasons. During his time with Hawkwind he developed an appetite for amphetamines and LSD, particularly the former. Before joining Hawkwind, he recalled Dik Mik, a former Hawkwind sound technician, visiting his squat in the middle of the night and taking speed with him. They became interested in how long \"you could make the human body jump about without stopping\", which they did for a few months, until Mik ran out of money and wanted to return to Hawkwind, taking Lemmy with him.\n\nIn November 2005, he was invited to the National Assembly for Wales as a guest speaker by Conservative member William Graham. He was asked to express his views on the detrimental effects of drugs, and called for the legalisation of heroin. He stated that legalisation would eradicate the drug dealer from society and generate money from its taxation, however hard this would be to accept.\n\nLemmy collected German military regalia; he had an Iron Cross encrusted on his bass, which led to accusations of Nazi sympathies. He stated that he collected the memorabilia because he liked the way it looked, and considered himself an anarchist or libertarian. Lemmy said he was against religion, government, and established authority. In 2011, he identified as agnostic, saying, \"I can find out when I die. I can wait. I'm not in a hurry.\" Jeff Hanneman, the founder of the thrash metal band Slayer, befriended Lemmy due to their shared fondness for collecting Nazi memorabilia. According to Keith Emerson's autobiography, Lemmy gave him two of his Hitler Youth knives during his time as a roadie for the Nice. Emerson used these knives many times as keyholders when playing the Hammond organ during concerts with the Nice and Emerson, Lake & Palmer before destroying them. Lemmy defended his collection by saying that if his black girlfriend had no problem with it, nobody else should.\n\nLater years, Illness and death\n\nLemmy lived in Los Angeles, from 1990 until his death, most recently in a two-room apartment two blocks away from his favourite hangout, the Rainbow Bar and Grill. In December 2000, his tour was cancelled when he was hospitalised in Italy with flu, exhaustion and a lung infection. He was hospitalised with extreme dehydration and exhaustion in Germany in July 2005. As he grew older, he used less alcohol and drugs as he suffered from diabetes and hypertension. In June 2013, it was reported that he had an implantable cardioverter-defibrillator fitted. His tour was cancelled in July 2013 due to a severe haematoma. He referred to his continuing drug use as \"dogged insolence in the face of mounting opposition to the contrary\". Towards the end of his life he had to use a walking stick. He had started smoking at the age of 11. In August 2015, he said he had cut down his smoking habit from two packs a day to one pack a week. He was hospitalised with a lung infection in September 2015, after having breathing problems when performing onstage.\n\nOn 28 December 2015, four days after his 70th birthday, Lemmy died at his apartment in Los Angeles at 4pm PST, from prostate cancer, cardiac arrhythmia and congestive heart failure.http://tmz.vo.llnwd.net/o28/newsdesk/tmz_documents/0119-lemmy-kilmister.pdf Motörhead announced his death on their official Facebook page later that day. According to the band, his cancer had only been diagnosed two days prior to his death.\n\nLemmy's manager, Todd Singerman, later revealed:\n\nLemmy's doctor had given him between two and six months to live. Following the terminal diagnosis, Rainbow Bar owner Mikael Maglieri brought a video game machine that Lemmy was fond of playing at the establishment over to his apartment so he could continue playing it from his bedside. Although his manager had planned to keep the news private until his eventual death, Lemmy strongly encouraged him to make the diagnosis public in early 2016, but he died before a press release could be drafted.\n\nFuneral\n\nLemmy's memorial service took place at Forest Lawn Memorial Park, Hollywood Hills, on 9 January 2016. The service was streamed live over YouTube with more than 230,000 people logging on to watch, while others gathered at the Rainbow. His body was cremated following the funeral. His remains were placed in a 3D-printed mantelpiece shaped like his trademark cavalry hat and emblazoned with the slogan \"born to lose, lived to win\". The piece was on display during his funeral and was later interred at Forest Lawn.\n\nTributes\n\nIn various media, additional tributes appeared from fellow rock stars such as Ozzy Osbourne, Alice Cooper, Metallica, Scott Ian of Anthrax, and Black Sabbath guitarist Tony Iommi.\n\nReviewing his career after his death, The Daily Telegraph said:\n\nIn 2005, the UK magazine Classic Rock presented Lemmy with its first \"Living Legend\" award. In a 2013 interview with the magazine, Lemmy said he had never expected to make it to 30, but he spoke very pointedly about the future, indicating neither he nor the band were obsessing about the end:\n\nIn February 2016, the Hollywood Vampires performed at the Grammy Award ceremony as a tribute to Lemmy. On 11 June, Download Festival paid tribute to Lemmy by renaming the main stage the \"Lemmy Stage\", and in the slot where Motorhead were due to play, there was a video tribute to Lemmy in which they played his music and his peers talked about him. On 17 November, Metallica released a tribute song titled \"Murder One\", named after Lemmy's frequently used amp. The song, from their album Hardwired... to Self-Destruct, depicts Lemmy's rise to fame. On 18 January 2017, Lemmy was inducted into the Hall of Heavy Metal History for being the creator of thrash metal. In 2017, the extinct crocodile-relative Lemmysuchus was named after Lemmy.\"Scaly snuggle-toothed beast? That'll be Lemmy\" > Daily Telegraph Issue no 50,455 dated Wednesday 9 August 2017\n\nCollaborations and songwriting\n\nLemmy worked with several musicians, apart from his Motörhead bandmates, over the course of his career. He wrote the song \"R.A.M.O.N.E.S\" for the Ramones, which he played in his live sets as a tribute to the band. He was brought in as a songwriter for Ozzy Osbourne's 1991 No More Tears album, providing lyrics for the tracks \"Hellraiser,\" (which Motörhead later recorded themselves and released as a single), \"Desire,\" \"I Don't Want to Change the World\" and the single \"Mama I'm Coming Home\". Lemmy noted in several magazine and television interviews that he made more money from the royalties of that one song than he had in his entire time with Motörhead. After being diagnosed with Type 2 diabetes in 2000, for which he was hospitalised briefly, Lemmy again appeared with Motörhead at WrestleMania X-Seven. Lemmy published his autobiography, White Line Fever, in November 2002. In 2005 Motörhead won their first Grammy in the Best Metal Performance category with their cover of Metallica's \"Whiplash\". In the same year he began recording an unreleased solo album titled Lemmy & Friends, which was intended to include a collaboration with Janet Jackson.\n\nFilm and television\n\nCameo appearances\n\nLemmy made appearances in film and television, including the 1990 science fiction film Hardware and the 1987 comedy Eat the Rich, for which Motörhead also recorded the soundtracks including the title song. He appeared as himself in the 1986 The Comic Strip Presents... episode More Bad News, along with fellow heavy metal musicians Ozzy Osbourne, Scorpions (band)  and Def Leppard. In 1984, Motörhead were the musical guests on the TV show The Young Ones, in the episode \"Bambi\". He appears in the 1994 comedy Airheads (in which he is credited as \"Lemmy von Motörhead\"). Lemmy has a cameo in Ron Jeremy's 1994 pornographic film John Wayne Bobbitt Uncut as the discoverer of Bobbitt's severed penis. The appendage is thrown from the window of a moving car and lands at Lemmy's feet who exclaims: \"Looks like a dick! Fucking hell! Ah well, it's not mine at least.\" The film's soundtrack also features the Motörhead song \"Under the Knife\".\n\nHe has also appeared in several movies from Troma Entertainment, including the narrator in 1996's Tromeo and Juliet and as himself in both Terror Firmer and Citizen Toxie: The Toxic Avenger IV. His last role was portraying the President of the United States in Return to Nuke 'Em High. He has a cameo role in the film Down and Out with the Dolls (Kurt Voss, 2001). He appears as a lodger who lives in a closet. He appeared on Down and Dirty with Jim Norton as the series DJ, and also wrote the theme music.[http://www.hbo.com/events/down-and-dirty/index.html HBO: Down + Dirty with Jim Norton] Official Website He appeared in a 2001 advertisement for Kit Kat, playing violin as part of a string quartet in a genteel tearoom. In 2015 Lemmy appeared as a central figure in the Björn Tagemose-directed silent film Gutterdämmerung opposite Grace Jones, Henry Rollins, Iggy Pop, Tom Araya of Slayer and Eagles of Death Metal's Jesse Hughes.\n\nLemmy film\n\nThe 2010 rockumentary film Lemmy was directed and produced by Greg Olliver and Wes Orshoski. It consists of a combination of 16 mm film and HD video footage, produced over three years.[http://lemmymovie.com/ Lemmy: The Movie] Official Website It features interviews with friends, peers, and admirers such as Dave Grohl, Slash, Ozzy Osbourne, James Hetfield, Lars Ulrich, Kirk Hammett, and Robert Trujillo of Metallica, David Ellefson of Megadeth, Scott Ian of Anthrax, Alice Cooper, Peter Hook of Joy Division/New Order, Dee Snider, Nikki Sixx, Mick Jones of the Clash, Ice-T, Kat Von D, Henry Rollins, Lars Frederiksen of Rancid, Jim Heath of The Reverend Horton Heat, Slim Jim Phantom of the Stray Cats, Mike Inez, Joan Jett, pro skateboarder Geoff Rowley, pro wrestler Triple H, \"Fast\" Eddie Clarke, Jarvis Cocker, Marky Ramone, former Hawkwind bandmates Dave Brock and Stacia, and Steve Vai.\n\nIn video games\n\nHe was the main character in the 16-bit video game Motörhead, released for the Commodore Amiga and Atari ST in 1992. Lemmy provided his voice as the Arms Dealer in the 2006 game Scarface: The World Is Yours. Lemmy also appeared as an unlockable character in the 2009 game Guitar Hero: Metallica. He also provided his voice for the 2009 video game Brütal Legend, voicing the Kill Master, a character designed and based on his surname and likeness. Lemmy was also the inspiration for the Mario game character Lemmy Koopa, which made its first appearance in Super Mario Bros. 3.\n\nEquipment\n\nLemmy positioned his microphone in an uncommonly high position, angled so that he appeared to be looking up at the sky rather than at the audience. He said that it was for \"personal comfort, that's all. It's also one way of avoiding seeing the audience. In the days when we only had ten people and a dog, it was a way of avoiding seeing that we only had ten people and a dog.\"\n\nLemmy's first bass was a Hopf model that he bought soon after joining Hawkwind. For the majority of his career, he used Rickenbacker basses. In September 1996, his Rickenbacker bass was featured in the Bang Your Head exhibition at the Rock and Roll Hall of Fame in Cleveland, Ohio, US. Rickenbacker have introduced a signature 4004LK \"Lemmy Kilmister\" bass. He used a large, powerful, loud bass stack made by Marshall Amplification. Specifically, he used Marshall JMP Super Bass amplifier heads to drive three cabinets, each with four 15\" speakers; the three heads were labelled \"Killer,\" \"No Remorse,\" and \"Murder One\". After he blew up \"Murder One\" he replaced it with a Marshall he named \"Marsha\". Early on he used perhaps his best known amp named \"Hammer\".\n\nDiscography\n\nFor releases with Motörhead see the Motörhead discography\n\nMember of the Rockin' Vickers\n\n* 1965 – \"Zing! Went the Strings of My Heart\" / \"Stella\" (7\" single)\n* 1965 – \"It's Alright\" / \"Stay By Me\" (7\" single)\n* 1966 – \"Dandy\" / \"I Don't Need Your Kind\" (7\" single)\n* 2000 – The Complete: It's Alright (compilation)\n\nMember of Sam Gopal\n\n* 1969 – Escalator\n* 1969 – \"Horse\" / \"Back Door Man\" (7\" single)\n\nMember of Hawkwind\n\n* 1972 – \"Silver Machine\" / \"Seven by Seven\" (7\" single)\n* 1972 – Glastonbury Fayre – contains \"Silver Machine\" and \"Welcome to the Future\"\n* 1972 – Greasy Truckers Party – contains \"Born to Go\" and \"Master of the Universe\" (10/11 Hawkwind tracks on 2007 re-release)\n* 1972 – Doremi Fasol Latido\n* 1973 – \"Lord of Light\" / \"Born to Go\" (7\" single)\n* 1973 – \"Urban Guerrilla\" / \"Brainbox Pollution\" (7\" single)\n* 1973 – Space Ritual\n* 1974 – Hall of the Mountain Grill\n* 1974 – \"Psychedelic Warlords\" / \"It's So Easy\" (7\" single)\n* 1975 – \"Kings of Speed\" / \"Motorhead\" (7\" single)\n* 1975 – Warrior on the Edge of Time\n* 1983 – The Weird Tapes (live and out-takes, 1967–1982)\n* 1984 – The Earth Ritual Preview EP (guest appearance as bass and backing vocals on Night of the Hawks)\n* 1985 – Bring Me the Head of Yuri Gagarin (live 1973)\n* 1985 – Space Ritual#Volume 2 (live 1972)\n* 1986 – Hawkwind Anthology (live and out-takes, 1967–1982)\n* 1991 – BBC Radio 1 Live in Concert (live 1972)\n* 1992 – The Friday Rock Show Sessions (live 1986)\n* 1997 – The 1999 Party (live 1974)\n\nMember of Robert Calvert's band\n\n* 1974 – \"Ejection\" / \"Catch a Falling Starfighter\" (7\" single)\n* 1974 – Captain Lockheed and the Starfighters\n* 1980 – \"Lord of the Hornets\" / \"The Greenfly and the Rose\" (7\" single)\n\nSide projects and career-spanning groups\n\n* 1990 – Lemmy & The Upsetters – Blue Suede Shoes\n* 2000 – Lemmy, Slim Jim & Danny B (aka the Head Cat) – Lemmy, Slim Jim & Danny B\n* 2006 – The Head Cat – Fool's Paradise\n* 2006 – The Head Cat – Rockin' the Cat Club: Live from the Sunset Strip\n* 2006 – Lemmy – Damage Case (Compilation)\n* 2007 – Keli Raven & Lemmy Kilmister \"Bad Boyz 4 Life\" (single).\n* 2011 – The Head Cat – Walk The Walk… Talk The Talk\n\nBand collaborations\n\n* 1978 – The Doomed (one-off performance at the Electric Ballroom, 5 September 1978). Bootleg recording with Dave Vanian, Captain Sensible and Rat Scabies. Brian James had left The Damned and took the rights to the name with him.\n* 1979 – The Damned – \"I Just Can't Be Happy Today\" / \"Ballroom Blitz\" (with Lemmy on bass) / \"Turkey Song\" (7\" single) – available as bonus track on the reissued Machine Gun Etiquette album\n* 1980 – The Young & Moody Band – \"Don't Do That\" (7\" & 12\" single)\n* 1981 – Headgirl (Motörhead & Girlschool) – St. Valentine's Day Massacre EP\n* 1982 – Lemmy & Wendy O. Williams – Stand by Your Man EP\n\nCharity collaborations\n\n* 1985 – Hear 'n Aid\n* 1985 – The Crowd – You'll Never Walk Alone (Bradford City F.C. Fire Disaster)\n* 2011 – Emergency – Livewire + Girlschool + Rudy Sarzo vocals (Haiti Appeal)\n\nGuest appearances\n\n* 1984 – Albert Järvinen Band – Countdown\n* 1986 – Boys Don't Cry – \"I Wanna Be a Cowboy\" (appears in the music video)\n* 1989 – Nina Hagen – Nina Hagen – guests on \"Where's the Party\"\n* 1992 – Bootsauce – Bull – guests on \"Hold Tight\"\n* 1994 – Fast Eddie Clarke – It Ain't Over till It's Over – guests on \"Laugh at the Devil\".\n* 1994 – Shonen Knife – Rock Animals – guests on \"Tomato Head\" single remix (Track 3 – \"Lemmy in There Mix\") – not the album track\n* 1996 – Skew Siskin – Electric Chair Music\n* 1996 – Ugly Kid Joe – Motel California\n* 1996 – Myth, Dreams of the World – Stories of the Greek & Roman Gods & Goddesses\n* 1996 – Skew Siskin – Voices from the War\n* 1997 – Ramones – We're Outta Here! – guests on \"R.A.M.O.N.E.S.\"\n* 1999 – Jetboy – Lost & Found\n* 1999 – Skew Siskin – What the Hell\n* 1999 – A.N.I.M.A.L. – Usa Toda Tu Fuerza – guests on a version of AC/DC's \"Highway to Hell\"\n* 2000 – Doro – Calling the Wild\n* 2000 – Swing Cats – A Special Tribute to Elvis – guests on \"Good Rockin' Tonight\", \"Trying to Get to You\" and \"Stuck on You\"\n* 2001 – The Pirates – Rock Bottom\n* 2001 – Hair of the Dog – Ignite – guests on \"Law\"\n* 2002 – Royal Philharmonic Orchestra, Mike Batt and guests – Philharmania – guests on \"Eve of Destruction\"\n* 2003 – Ace Sounds – Still Hungry\n* 2003 – Skew Siskin – Album of the Year\n* 2004 – Probot – Probot – guests on \"Shake Your Blood\"\n* 2005 – Throw Rag – 13 Ft. and Rising – guests on \"Tonight the Bottle Let Me Down\"\n* 2006 – Doro – 20 Years – A Warrior Soul – guests on \"Love Me Forever\" and \"All We Are\"\n* 2007 – Meldrum – Blowin' Up The Machine – guests on \"Miss Me When I'm Gone\"\n* 2007 – The Warriors – Genuine Sense of Outrage – guests on \"Price of Punishment\"\n* 2007 – Keli Raven single \"Bad Boyz 4 Life\" (co-writer and guest vocalist)\n* 2008 – Airbourne – Guest actor on Airbourne's \"Runnin' Wild\" Music Video\n* 2008 – We Wish You a Metal Christmas – Run Run Rudolph\n* 2008 – Legacy – Girlschool album – Don't Talk to Me vocals, bass, triangle and lyrics.\n* 2009 – Queen V – Death or Glory – guests on \"Wasted\"\n* 2009 – Brütal Legend (video game) – The Kill Master (voice)\n* 2010 – Slash – Slash – \"Doctor Alibi\" (vocals and bass)\n* 2011 – Michael Monroe – Sensory Overdrive guests on \"Debauchery As A Fine Art\"\n* 2012 – Doro – Raise Your Fist guest on \"It Stll Hurts\"\n* 2012 – Nashville Pussy – Guest on Nashville Pussy's song \"Lazy Jesus\" on the re-release of the album \"From Hell to Texas\"\n* 2014 – Emigrate – Guest bass and vocals on track Rock City, from their album Silent So Long\n\nFilm soundtracks, tribute, wrestling and various artists albums\n\n* 1990 – Hardware: Original Soundtrack – contains \"A Piece of Pipe\" by Kaduta Massi with Lemmy\n* 1990 – The Last Temptation of Elvis: Blue Suede Shoes – contains \"Blue Suede Shoes\" by Lemmy & The Upsetters\n* 1994 – Airheads: Cameo on film and performing \"Born to Raise Hell\" on the soundtrack\n* 1997 – Dragon Attack: A Tribute to Queen – performs on \"Tie Your Mother Down\"\n* 1998 – Thunderbolt: A Tribute to AC/DC – performs on \"It's a Long Way to the Top\"\n* 1998 – ECW: Extreme Music – contains a cover of Metallica's \"Enter Sandman\"\n* 2000 – Bat Head Soup – Tribute to Ozzy Osbourne – performs on \"Desire\"\n* 2001 – WWF The Music, Vol. 5 - \"The Game\"\n* 2001 – Frezno Smooth: Original Soundtrack – contains a version of Twisted Sister's \"Hardcore\" by Lemmy\n* 2001 – A Tribute to Metallica: Metallic Assault – performs on \"Nothing Else Matters\"\n* 2002 – Rise Above: 24 Black Flag Songs to Benefit the West Memphis Three – performs on \"Thirsty & Miserable\"\n* 2002 – Metal Brigade – performs on \"Good Rockin' Tonight\" by Lemmy and Johnny Ramone\n* 2004 – Spin the Bottle – An All-Star Tribute to KISS – performs on \"Shout It Out Loud\"\n* 2004 – The SpongeBob SquarePants Movie – performs \"You Better Swim\"\n* 2004 – ThemeAddict: WWE The Music, Vol. 6 - \"Line in the Sand\"\n* 2005 – Numbers from the Beast: An All Star Salute to Iron Maiden – performs on \"The Trooper\"\n* 2005 – Metal: A Headbangers Journey\n* 2006 – WWE Wreckless Intent - \"King of Kings\"\n* 2006 – Flying High Again: The World's Greatest Tribute to Ozzy Osbourne – Performs \"Desire\" with Richie Kotzen\n* 2006 – Cover Me in '80s Metal (Fantastic Price Records) – Metal artists covering the hits of others. Performs AC/DC's \"It's a Long Way to the Top\".\n* 2006 – Butchering the Beatles: A Headbashing Tribute – Performs \"Back in the USSR\".\n* 2009 – Flip Skateboards Presents Extremely Sorry – Performs \"Stand By Me\" with Baron and Dave Lombardo.\n* 2010 – Danko Jones – Full of Regret – Stars in the music video along with Elijah Wood and Selma Blair\n* 2011 – Foo Fighters – White Limo – Stars in the music video\n\nVideography\n\nVideo tape/laser disc\n\n* 1982 Live in Toronto – Castle Hendring\n* 1984 Another Perfect Day EP\n* 1985 Birthday Party\n* 1986 Deaf Not Blind\n* 1987 More Bad News\n* 1988 EP\n* 1988 The Decline of Western Civilization II: The Metal Years\n* 1990 Hardware (Lemmy was cast as a water taxi driver; and plays a recording of \"Ace of Spades\" for his passengers).\n* 1991 Everything Louder than Everyone Else\n\nDVD\n\n* 1987 Eat the Rich\n* 1994 Airheads – cameo as \"The Rocker\" who \"was editor of the school magazine!\"\n* 1997 Tromeo and Juliet – cast as Narrator, Troma pictures\n* 1999 Terror Firmer\n* 2001 Down and Out with the Dolls – as Joe\n* 2001 25 & Alive Boneshaker\n* 2001 WrestleMania X-Seven – Performing Triple-H's entrance theme \"The Game\" live\n* 2001 Citizen Toxie: The Toxic Avenger IV – as a Tromaville citizen\n* 2002 Motörhead EP\n* 2002 The Best of Motörhead\n* 2003 The Special Edition EP\n* 2003 Charlie's Death Wish – as himself\n* 2004 Everything Louder than Everything Else\n* 2005 Stage Fright (also HD-DVD 2007)\n* 2005 Ringers: Lord of the Fans\n* 2005 WrestleMania 21 Performing \"The Game\"\n* 2005 Metal: A Headbanger's Journey\n* 2006 The Head Cat Live: Rockin' the Cat Club\n* 2006 Foo Fighters: Hyde Park\n* 2010 Lemmy\n* 2011 The Wörld Is Yours bonus DVD",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lemmy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18642" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ian Fraser Kilmister (24 December 1945 – 28 December 2015), better known as Lemmy, was an English musician and singer-songwriter who founded and fronted the rock band Motörhead. His music was one of the foundations of the heavy metal genre. He was known for his appearance (including his friendly mutton chops), his distinctive gravelly, \"rasp[y]\" singing voice, which \"...was one of the most recognisable voices in rock\", and his way of singing, looking up towards \"...a towering microphone tilted down into his weather-beaten face\". He was also known for his unmistakable bass playing style, in which he used his Rickenbacker bass to create an \"overpowered, distorted rhythmic rumble\". Another unique aspect of Lemmy's bass sound is that he often played power chords using growling overdriven Marshall tube bass stacks. Alongside his music career, he also had many minor roles and cameo appearances in film and television.\n\nLemmy was born in Stoke-on-Trent and grew up in Staffordshire and later North Wales. He was influenced by rock and roll and the early works of the Beatles, which led to him playing in several rock groups in the 1960s; including the Rockin' Vickers. He worked as a roadie for Jimi Hendrix and The Nice, before joining the space rock band Hawkwind in 1971, singing lead vocals on their hit \"Silver Machine\". After being fired from Hawkwind for drug possession in 1975, he founded Motörhead during the same year as the lead singer, bassist, songwriter and frontman. Motörhead's success peaked in 1980 and 1981 and included the hit single \"Ace of Spades\" and the top charting live album No Sleep 'til Hammersmith. Lemmy continued to record and tour regularly with Motörhead until his death in December 2015 in Los Angeles, where he had lived since 1990.\n\nAside from his musical activities, Lemmy was well known for his hard-living lifestyle, chain smoking, and regular consumption of alcohol (notably Jack Daniel's Tennessee whiskey) and amphetamines.\n\nEarly life\n\nLemmy was born on Christmas Eve in the Burslem area of Stoke-on-Trent, Staffordshire.[http://www.bbc.co.uk/stoke/content/articles/2009/09/08/lemmy_book_feature.shtml Lemmy: White Line Fever] BBC News Stoke and Staffordshire article. Retrieved on 22 August 2014. When he was three months old, his father,Overkill: The Story of Motorhead, Joel McIver, Omnibus Press, 2011 an ex-Royal Air Force chaplain and concert pianist, separated from his mother. His mother and grandmother moved to nearby Newcastle-under-Lyme, then to Madeley. When Lemmy was ten years old, his mother married former footballer George Willis, who already had two older children from a previous marriage, Patricia and Tony, with whom Lemmy did not get along.\n\nThe family moved to a farm in the Welsh town of Benllech, Anglesey, with Lemmy later commenting that \"funnily enough, being the only English kid among 700 Welsh ones didn't make for the happiest time, but it was interesting from an anthropological point of view\". He attended Sir Thomas Jones' School in Amlwch, where he was nicknamed \"Lemmy\". It was later suggested by some that the name originated from the phrase \"lemmy [lend me] a quid 'til Friday\" because of his alleged habit of borrowing money from people to play slot machines,Motorhead Videobiography (Double DVD with 48-page book) Edgehill Publishing Ltd., June 2007  although Lemmy himself said that he did not know the origin of the name. He soon started to show an interest in rock and roll music, girls, and horses.\n\nAt school, Lemmy noticed a pupil who had brought a guitar to school and had been \"surrounded by chicks\". His mother had a guitar, which he then took to school, even though he could not play, and was himself surrounded by girls. By the time he left school, his family had moved to Conwy. Whilst there, he worked at menial jobs; including one at the local Hotpoint electric appliance factory, while also playing guitar for local bands such as the Sundowners and spending time at a horse-riding school. Lemmy saw the Beatles perform at the Cavern Club when he was sixteen, and then learned to play along on guitar to their first album Please Please Me. He also admired the sarcastic attitude of the group, particularly that of John Lennon.\n\nRecording and performing career\n\n1960–1970: Early years\n\nIn Stockport, Lemmy joined local bands the Rainmakers and then the Motown Sect who played northern clubs for three years. In 1965, he joined the Rockin' Vickers[http://www.inkedmag.com/articles/detail/123/damage-case-lemmy-kilmister/ ]  who signed a deal with CBS, released three singles and toured Europe, reportedly being the first British band to visit the Socialist Federal Republic of Yugoslavia. The Rockin' Vickers moved to Manchester, where they shared a flat together. There, Lemmy got involved with a woman named Tracy who bore him a son, Paul Inder. Lemmy did not have any involvement in his life until the boy was six.\n\nLeaving the Rockin' Vickers, Lemmy moved to London in 1967. He shared a flat with Noel Redding, bassist of the Jimi Hendrix Experience, and with Neville Chesters, their manager. He got a job as a roadie for the band. In 1968, he joined the psychedelic rock band Sam Gopal under the name Ian Willis and recorded the album Escalator which was released in 1969. After meeting Simon King at a shopping centre in Chelsea in 1969, he joined the band Opal Butterfly; but the group soon disbanded, having failed to raise enough interest with their singles.\n\n1971–1975: Hawkwind\n\nSee also Hawkwind (1970–75: United Artists era)\nIn August 1971, Lemmy joined the space rock band Hawkwind, who were based in Ladbroke Grove, London, as a bassist and vocalist. He had no previous experience as a bass guitarist, and was cajoled into joining immediately before a benefit gig in Notting Hill by bandmate Dik Mik to have two members who enjoyed amphetamines. He quickly developed a distinctive style that was strongly shaped by his early experience as a rhythm guitarist, often using double stops and chords rather than the single note lines preferred by most bassists. His bass work was a fundamental part of the Hawkwind sound during his tenure, perhaps best documented on Space Ritual. He also provided the lead vocals on several songs, including the band's biggest UK chart single, \"Silver Machine\", which reached #3 in 1972.\n\nIn 1975, Lemmy was arrested at the Canada/United States border in Windsor, Ontario, on drug possession charges; he spent five days in jail but was released without charge. Nonetheless, he was fired from Hawkwind.\n\n1975–2015: Motörhead\n\nAfter Hawkwind, Lemmy formed a new band called \"Bastard\" with guitarist Larry Wallis (former member of the Pink Fairies, Steve Took's Shagrat and UFO) and drummer Lucas Fox. Lemmy and Took were friends, and Took was the stepfather to Lemmy's son Paul. When his manager informed him that a band by the name of \"Bastard\" would never get a slot on Top of the Pops, Lemmy changed the band's name to \"Motörhead\" – the title of the last song he had written for Hawkwind.\n \nSoon after, both Wallis and Fox were replaced with guitarist \"Fast\" Eddie Clarke and drummer Phil \"Philthy Animal\" Taylor and with this line-up, the band began to achieve success. Lemmy's guttural vocals were unique in rock at that time, and were copied during the time when punk rock became popular. The band's sound appealed to Lemmy's original fans and, eventually, to fans of punk. Lemmy asserted that he generally felt more kinship with punks than with metalheads; he even played with the Damned for a handful of gigs when they had no regular bassist.see the notes for Smash It Up – The Anthology 1976 – 1987 The band's success peaked in 1980 and 1981 with several UK chart hits, including the single \"Ace of Spades\", which remained a crowd favourite throughout the band's career, and the UK #1 live album No Sleep 'til Hammersmith. Motörhead became one of the most influential bands in the heavy metal genre. Their – and Lemmy's – final live performance was in Berlin, Germany on 11 December 2015.\n\nPersonal life\n\nAt the age of 17, Lemmy met a holidaying girl named Cathy. He followed her to Stockport, Greater Manchester, where she gave birth to his son Sean, who was put up for adoption. In the 2010 documentary film Lemmy, he mentioned having a son whose mother has only recently \"found him\" and \"hadn't got the heart to tell him who his father was\", indicating that the boy – perhaps Sean – was given up for adoption.\n\nIn the Channel 4 documentary Motörhead: Live Fast, Die Old, broadcast on 22 August 2005, it was claimed that Lemmy had \"bedded\" in excess of 2,000 women. Lemmy stated: \"I said more than a thousand, the magazine made two thousand of it.\"  Maxim had Lemmy at #8 on its top ten \"Living Sex Legends\" list, as they claimed that he had slept with around 1,200 women. Lemmy is one of the characters in the book Sex Tips from Rock Stars by Paul Miles.\n\nDave Grohl, on his Probot website, describes musicians with whom he has worked. In his entry for Lemmy, he wrote:\n\nLemmy was well known for his alcohol abuse. The documentary Live Fast Die Old stated that he drank a bottle of Jack Daniel's every day and had done so since he was 30 years old. In 2013, Lemmy stopped drinking Jack Daniel's for health reasons. During his time with Hawkwind he developed an appetite for amphetamines and LSD, particularly the former. Before joining Hawkwind, he recalled Dik Mik, a former Hawkwind sound technician, visiting his squat in the middle of the night and taking speed with him. They became interested in how long \"you could make the human body jump about without stopping\", which they did for a few months, until Mik ran out of money and wanted to return to Hawkwind, taking Lemmy with him.\n\nIn November 2005, he was invited to the National Assembly for Wales as a guest speaker by Conservative member William Graham. He was asked to express his views on the detrimental effects of drugs, and called for the legalisation of heroin. He stated that legalisation would eradicate the drug dealer from society and generate money from its taxation, however hard this would be to accept.\n\nLemmy collected German military regalia; he had an Iron Cross encrusted on his bass, which led to accusations of Nazi sympathies. He stated that he collected the memorabilia because he liked the way it looked, and considered himself an anarchist or libertarian. Lemmy said he was against religion, government, and established authority. In 2011, he identified as agnostic, saying, \"I can find out when I die. I can wait. I'm not in a hurry.\" Jeff Hanneman, the founder of the thrash metal band Slayer, befriended Lemmy due to their shared fondness for collecting Nazi memorabilia. According to Keith Emerson's autobiography, Lemmy gave him two of his Hitler Youth knives during his time as a roadie for the Nice. Emerson used these knives many times as keyholders when playing the Hammond organ during concerts with the Nice and Emerson, Lake & Palmer before destroying them. Lemmy defended his collection by saying that if his black girlfriend had no problem with it, nobody else should.\n\nLater years, Illness and death\n\nLemmy lived in Los Angeles, from 1990 until his death, most recently in a two-room apartment two blocks away from his favourite hangout, the Rainbow Bar and Grill. In December 2000, his tour was cancelled when he was hospitalised in Italy with flu, exhaustion and a lung infection. He was hospitalised with extreme dehydration and exhaustion in Germany in July 2005. As he grew older, he used less alcohol and drugs as he suffered from diabetes and hypertension. In June 2013, it was reported that he had an implantable cardioverter-defibrillator fitted. His tour was cancelled in July 2013 due to a severe haematoma. He referred to his continuing drug use as \"dogged insolence in the face of mounting opposition to the contrary\". Towards the end of his life he had to use a walking stick. He had started smoking at the age of 11. In August 2015, he said he had cut down his smoking habit from two packs a day to one pack a week. He was hospitalised with a lung infection in September 2015, after having breathing problems when performing onstage.\n\nOn 28 December 2015, four days after his 70th birthday, Lemmy died at his apartment in Los Angeles at 4pm PST, from prostate cancer, cardiac arrhythmia and congestive heart failure.http://tmz.vo.llnwd.net/o28/newsdesk/tmz_documents/0119-lemmy-kilmister.pdf Motörhead announced his death on their official Facebook page later that day. According to the band, his cancer had only been diagnosed two days prior to his death.\n\nLemmy's manager, Todd Singerman, later revealed:\n\nLemmy's doctor had given him between two and six months to live. Following the terminal diagnosis, Rainbow Bar owner Mikael Maglieri brought a video game machine that Lemmy was fond of playing at the establishment over to his apartment so he could continue playing it from his bedside. Although his manager had planned to keep the news private until his eventual death, Lemmy strongly encouraged him to make the diagnosis public in early 2016, but he died before a press release could be drafted.\n\nFuneral\n\nLemmy's memorial service took place at Forest Lawn Memorial Park, Hollywood Hills, on 9 January 2016. The service was streamed live over YouTube with more than 230,000 people logging on to watch, while others gathered at the Rainbow. His body was cremated following the funeral. His remains were placed in a 3D-printed mantelpiece shaped like his trademark cavalry hat and emblazoned with the slogan \"born to lose, lived to win\". The piece was on display during his funeral and was later interred at Forest Lawn.\n\nTributes\n\nIn various media, additional tributes appeared from fellow rock stars such as Ozzy Osbourne, Alice Cooper, Metallica, Scott Ian of Anthrax, and Black Sabbath guitarist Tony Iommi.\n\nReviewing his career after his death, The Daily Telegraph said:\n\nIn 2005, the UK magazine Classic Rock presented Lemmy with its first \"Living Legend\" award. In a 2013 interview with the magazine, Lemmy said he had never expected to make it to 30, but he spoke very pointedly about the future, indicating neither he nor the band were obsessing about the end:\n\nIn February 2016, the Hollywood Vampires performed at the Grammy Award ceremony as a tribute to Lemmy. On 11 June, Download Festival paid tribute to Lemmy by renaming the main stage the \"Lemmy Stage\", and in the slot where Motorhead were due to play, there was a video tribute to Lemmy in which they played his music and his peers talked about him. On 17 November, Metallica released a tribute song titled \"Murder One\", named after Lemmy's frequently used amp. The song, from their album Hardwired... to Self-Destruct, depicts Lemmy's rise to fame. On 18 January 2017, Lemmy was inducted into the Hall of Heavy Metal History for being the creator of thrash metal. In 2017, the extinct crocodile-relative Lemmysuchus was named after Lemmy.\"Scaly snuggle-toothed beast? That'll be Lemmy\" > Daily Telegraph Issue no 50,455 dated Wednesday 9 August 2017\n\nCollaborations and songwriting\n\nLemmy worked with several musicians, apart from his Motörhead bandmates, over the course of his career. He wrote the song \"R.A.M.O.N.E.S\" for the Ramones, which he played in his live sets as a tribute to the band. He was brought in as a songwriter for Ozzy Osbourne's 1991 No More Tears album, providing lyrics for the tracks \"Hellraiser,\" (which Motörhead later recorded themselves and released as a single), \"Desire,\" \"I Don't Want to Change the World\" and the single \"Mama I'm Coming Home\". Lemmy noted in several magazine and television interviews that he made more money from the royalties of that one song than he had in his entire time with Motörhead. After being diagnosed with Type 2 diabetes in 2000, for which he was hospitalised briefly, Lemmy again appeared with Motörhead at WrestleMania X-Seven. Lemmy published his autobiography, White Line Fever, in November 2002. In 2005 Motörhead won their first Grammy in the Best Metal Performance category with their cover of Metallica's \"Whiplash\". In the same year he began recording an unreleased solo album titled Lemmy & Friends, which was intended to include a collaboration with Janet Jackson.\n\nFilm and television\n\nCameo appearances\n\nLemmy made appearances in film and television, including the 1990 science fiction film Hardware and the 1987 comedy Eat the Rich, for which Motörhead also recorded the soundtracks including the title song. He appeared as himself in the 1986 The Comic Strip Presents... episode More Bad News, along with fellow heavy metal musicians Ozzy Osbourne, Scorpions (band)  and Def Leppard. In 1984, Motörhead were the musical guests on the TV show The Young Ones, in the episode \"Bambi\". He appears in the 1994 comedy Airheads (in which he is credited as \"Lemmy von Motörhead\"). Lemmy has a cameo in Ron Jeremy's 1994 pornographic film John Wayne Bobbitt Uncut as the discoverer of Bobbitt's severed penis. The appendage is thrown from the window of a moving car and lands at Lemmy's feet who exclaims: \"Looks like a dick! Fucking hell! Ah well, it's not mine at least.\" The film's soundtrack also features the Motörhead song \"Under the Knife\".\n\nHe has also appeared in several movies from Troma Entertainment, including the narrator in 1996's Tromeo and Juliet and as himself in both Terror Firmer and Citizen Toxie: The Toxic Avenger IV. His last role was portraying the President of the United States in Return to Nuke 'Em High. He has a cameo role in the film Down and Out with the Dolls (Kurt Voss, 2001). He appears as a lodger who lives in a closet. He appeared on Down and Dirty with Jim Norton as the series DJ, and also wrote the theme music.[http://www.hbo.com/events/down-and-dirty/index.html HBO: Down + Dirty with Jim Norton] Official Website He appeared in a 2001 advertisement for Kit Kat, playing violin as part of a string quartet in a genteel tearoom. In 2015 Lemmy appeared as a central figure in the Björn Tagemose-directed silent film Gutterdämmerung opposite Grace Jones, Henry Rollins, Iggy Pop, Tom Araya of Slayer and Eagles of Death Metal's Jesse Hughes.\n\nLemmy film\n\nThe 2010 rockumentary film Lemmy was directed and produced by Greg Olliver and Wes Orshoski. It consists of a combination of 16 mm film and HD video footage, produced over three years.[http://lemmymovie.com/ Lemmy: The Movie] Official Website It features interviews with friends, peers, and admirers such as Dave Grohl, Slash, Ozzy Osbourne, James Hetfield, Lars Ulrich, Kirk Hammett, and Robert Trujillo of Metallica, David Ellefson of Megadeth, Scott Ian of Anthrax, Alice Cooper, Peter Hook of Joy Division/New Order, Dee Snider, Nikki Sixx, Mick Jones of the Clash, Ice-T, Kat Von D, Henry Rollins, Lars Frederiksen of Rancid, Jim Heath of The Reverend Horton Heat, Slim Jim Phantom of the Stray Cats, Mike Inez, Joan Jett, pro skateboarder Geoff Rowley, pro wrestler Triple H, \"Fast\" Eddie Clarke, Jarvis Cocker, Marky Ramone, former Hawkwind bandmates Dave Brock and Stacia, and Steve Vai.\n\nIn video games\n\nHe was the main character in the 16-bit video game Motörhead, released for the Commodore Amiga and Atari ST in 1992. Lemmy provided his voice as the Arms Dealer in the 2006 game Scarface: The World Is Yours. Lemmy also appeared as an unlockable character in the 2009 game Guitar Hero: Metallica. He also provided his voice for the 2009 video game Brütal Legend, voicing the Kill Master, a character designed and based on his surname and likeness. Lemmy was also the inspiration for the Mario game character Lemmy Koopa, which made its first appearance in Super Mario Bros. 3.\n\nEquipment\n\nLemmy positioned his microphone in an uncommonly high position, angled so that he appeared to be looking up at the sky rather than at the audience. He said that it was for \"personal comfort, that's all. It's also one way of avoiding seeing the audience. In the days when we only had ten people and a dog, it was a way of avoiding seeing that we only had ten people and a dog.\"\n\nLemmy's first bass was a Hopf model that he bought soon after joining Hawkwind. For the majority of his career, he used Rickenbacker basses. In September 1996, his Rickenbacker bass was featured in the Bang Your Head exhibition at the Rock and Roll Hall of Fame in Cleveland, Ohio, US. Rickenbacker have introduced a signature 4004LK \"Lemmy Kilmister\" bass. He used a large, powerful, loud bass stack made by Marshall Amplification. Specifically, he used Marshall JMP Super Bass amplifier heads to drive three cabinets, each with four 15\" speakers; the three heads were labelled \"Killer,\" \"No Remorse,\" and \"Murder One\". After he blew up \"Murder One\" he replaced it with a Marshall he named \"Marsha\". Early on he used perhaps his best known amp named \"Hammer\".\n\nDiscography\n\nFor releases with Motörhead see the Motörhead discography\n\nMember of the Rockin' Vickers\n\n* 1965 – \"Zing! Went the Strings of My Heart\" / \"Stella\" (7\" single)\n* 1965 – \"It's Alright\" / \"Stay By Me\" (7\" single)\n* 1966 – \"Dandy\" / \"I Don't Need Your Kind\" (7\" single)\n* 2000 – The Complete: It's Alright (compilation)\n\nMember of Sam Gopal\n\n* 1969 – Escalator\n* 1969 – \"Horse\" / \"Back Door Man\" (7\" single)\n\nMember of Hawkwind\n\n* 1972 – \"Silver Machine\" / \"Seven by Seven\" (7\" single)\n* 1972 – Glastonbury Fayre – contains \"Silver Machine\" and \"Welcome to the Future\"\n* 1972 – Greasy Truckers Party – contains \"Born to Go\" and \"Master of the Universe\" (10/11 Hawkwind tracks on 2007 re-release)\n* 1972 – Doremi Fasol Latido\n* 1973 – \"Lord of Light\" / \"Born to Go\" (7\" single)\n* 1973 – \"Urban Guerrilla\" / \"Brainbox Pollution\" (7\" single)\n* 1973 – Space Ritual\n* 1974 – Hall of the Mountain Grill\n* 1974 – \"Psychedelic Warlords\" / \"It's So Easy\" (7\" single)\n* 1975 – \"Kings of Speed\" / \"Motorhead\" (7\" single)\n* 1975 – Warrior on the Edge of Time\n* 1983 – The Weird Tapes (live and out-takes, 1967–1982)\n* 1984 – The Earth Ritual Preview EP (guest appearance as bass and backing vocals on Night of the Hawks)\n* 1985 – Bring Me the Head of Yuri Gagarin (live 1973)\n* 1985 – Space Ritual#Volume 2 (live 1972)\n* 1986 – Hawkwind Anthology (live and out-takes, 1967–1982)\n* 1991 – BBC Radio 1 Live in Concert (live 1972)\n* 1992 – The Friday Rock Show Sessions (live 1986)\n* 1997 – The 1999 Party (live 1974)\n\nMember of Robert Calvert's band\n\n* 1974 – \"Ejection\" / \"Catch a Falling Starfighter\" (7\" single)\n* 1974 – Captain Lockheed and the Starfighters\n* 1980 – \"Lord of the Hornets\" / \"The Greenfly and the Rose\" (7\" single)\n\nSide projects and career-spanning groups\n\n* 1990 – Lemmy & The Upsetters – Blue Suede Shoes\n* 2000 – Lemmy, Slim Jim & Danny B (aka the Head Cat) – Lemmy, Slim Jim & Danny B\n* 2006 – The Head Cat – Fool's Paradise\n* 2006 – The Head Cat – Rockin' the Cat Club: Live from the Sunset Strip\n* 2006 – Lemmy – Damage Case (Compilation)\n* 2007 – Keli Raven & Lemmy Kilmister \"Bad Boyz 4 Life\" (single).\n* 2011 – The Head Cat – Walk The Walk… Talk The Talk\n\nBand collaborations\n\n* 1978 – The Doomed (one-off performance at the Electric Ballroom, 5 September 1978). Bootleg recording with Dave Vanian, Captain Sensible and Rat Scabies. Brian James had left The Damned and took the rights to the name with him.\n* 1979 – The Damned – \"I Just Can't Be Happy Today\" / \"Ballroom Blitz\" (with Lemmy on bass) / \"Turkey Song\" (7\" single) – available as bonus track on the reissued Machine Gun Etiquette album\n* 1980 – The Young & Moody Band – \"Don't Do That\" (7\" & 12\" single)\n* 1981 – Headgirl (Motörhead & Girlschool) – St. Valentine's Day Massacre EP\n* 1982 – Lemmy & Wendy O. Williams – Stand by Your Man EP\n\nCharity collaborations\n\n* 1985 – Hear 'n Aid\n* 1985 – The Crowd – You'll Never Walk Alone (Bradford City F.C. Fire Disaster)\n* 2011 – Emergency – Livewire + Girlschool + Rudy Sarzo vocals (Haiti Appeal)\n\nGuest appearances\n\n* 1984 – Albert Järvinen Band – Countdown\n* 1986 – Boys Don't Cry – \"I Wanna Be a Cowboy\" (appears in the music video)\n* 1989 – Nina Hagen – Nina Hagen – guests on \"Where's the Party\"\n* 1992 – Bootsauce – Bull – guests on \"Hold Tight\"\n* 1994 – Fast Eddie Clarke – It Ain't Over till It's Over – guests on \"Laugh at the Devil\".\n* 1994 – Shonen Knife – Rock Animals – guests on \"Tomato Head\" single remix (Track 3 – \"Lemmy in There Mix\") – not the album track\n* 1996 – Skew Siskin – Electric Chair Music\n* 1996 – Ugly Kid Joe – Motel California\n* 1996 – Myth, Dreams of the World – Stories of the Greek & Roman Gods & Goddesses\n* 1996 – Skew Siskin – Voices from the War\n* 1997 – Ramones – We're Outta Here! – guests on \"R.A.M.O.N.E.S.\"\n* 1999 – Jetboy – Lost & Found\n* 1999 – Skew Siskin – What the Hell\n* 1999 – A.N.I.M.A.L. – Usa Toda Tu Fuerza – guests on a version of AC/DC's \"Highway to Hell\"\n* 2000 – Doro – Calling the Wild\n* 2000 – Swing Cats – A Special Tribute to Elvis – guests on \"Good Rockin' Tonight\", \"Trying to Get to You\" and \"Stuck on You\"\n* 2001 – The Pirates – Rock Bottom\n* 2001 – Hair of the Dog – Ignite – guests on \"Law\"\n* 2002 – Royal Philharmonic Orchestra, Mike Batt and guests – Philharmania – guests on \"Eve of Destruction\"\n* 2003 – Ace Sounds – Still Hungry\n* 2003 – Skew Siskin – Album of the Year\n* 2004 – Probot – Probot – guests on \"Shake Your Blood\"\n* 2005 – Throw Rag – 13 Ft. and Rising – guests on \"Tonight the Bottle Let Me Down\"\n* 2006 – Doro – 20 Years – A Warrior Soul – guests on \"Love Me Forever\" and \"All We Are\"\n* 2007 – Meldrum – Blowin' Up The Machine – guests on \"Miss Me When I'm Gone\"\n* 2007 – The Warriors – Genuine Sense of Outrage – guests on \"Price of Punishment\"\n* 2007 – Keli Raven single \"Bad Boyz 4 Life\" (co-writer and guest vocalist)\n* 2008 – Airbourne – Guest actor on Airbourne's \"Runnin' Wild\" Music Video\n* 2008 – We Wish You a Metal Christmas – Run Run Rudolph\n* 2008 – Legacy – Girlschool album – Don't Talk to Me vocals, bass, triangle and lyrics.\n* 2009 – Queen V – Death or Glory – guests on \"Wasted\"\n* 2009 – Brütal Legend (video game) – The Kill Master (voice)\n* 2010 – Slash – Slash – \"Doctor Alibi\" (vocals and bass)\n* 2011 – Michael Monroe – Sensory Overdrive guests on \"Debauchery As A Fine Art\"\n* 2012 – Doro – Raise Your Fist guest on \"It Stll Hurts\"\n* 2012 – Nashville Pussy – Guest on Nashville Pussy's song \"Lazy Jesus\" on the re-release of the album \"From Hell to Texas\"\n* 2014 – Emigrate – Guest bass and vocals on track Rock City, from their album Silent So Long\n\nFilm soundtracks, tribute, wrestling and various artists albums\n\n* 1990 – Hardware: Original Soundtrack – contains \"A Piece of Pipe\" by Kaduta Massi with Lemmy\n* 1990 – The Last Temptation of Elvis: Blue Suede Shoes – contains \"Blue Suede Shoes\" by Lemmy & The Upsetters\n* 1994 – Airheads: Cameo on film and performing \"Born to Raise Hell\" on the soundtrack\n* 1997 – Dragon Attack: A Tribute to Queen – performs on \"Tie Your Mother Down\"\n* 1998 – Thunderbolt: A Tribute to AC/DC – performs on \"It's a Long Way to the Top\"\n* 1998 – ECW: Extreme Music – contains a cover of Metallica's \"Enter Sandman\"\n* 2000 – Bat Head Soup – Tribute to Ozzy Osbourne – performs on \"Desire\"\n* 2001 – WWF The Music, Vol. 5 - \"The Game\"\n* 2001 – Frezno Smooth: Original Soundtrack – contains a version of Twisted Sister's \"Hardcore\" by Lemmy\n* 2001 – A Tribute to Metallica: Metallic Assault – performs on \"Nothing Else Matters\"\n* 2002 – Rise Above: 24 Black Flag Songs to Benefit the West Memphis Three – performs on \"Thirsty & Miserable\"\n* 2002 – Metal Brigade – performs on \"Good Rockin' Tonight\" by Lemmy and Johnny Ramone\n* 2004 – Spin the Bottle – An All-Star Tribute to KISS – performs on \"Shout It Out Loud\"\n* 2004 – The SpongeBob SquarePants Movie – performs \"You Better Swim\"\n* 2004 – ThemeAddict: WWE The Music, Vol. 6 - \"Line in the Sand\"\n* 2005 – Numbers from the Beast: An All Star Salute to Iron Maiden – performs on \"The Trooper\"\n* 2005 – Metal: A Headbangers Journey\n* 2006 – WWE Wreckless Intent - \"King of Kings\"\n* 2006 – Flying High Again: The World's Greatest Tribute to Ozzy Osbourne – Performs \"Desire\" with Richie Kotzen\n* 2006 – Cover Me in '80s Metal (Fantastic Price Records) – Metal artists covering the hits of others. Performs AC/DC's \"It's a Long Way to the Top\".\n* 2006 – Butchering the Beatles: A Headbashing Tribute – Performs \"Back in the USSR\".\n* 2009 – Flip Skateboards Presents Extremely Sorry – Performs \"Stand By Me\" with Baron and Dave Lombardo.\n* 2010 – Danko Jones – Full of Regret – Stars in the music video along with Elijah Wood and Selma Blair\n* 2011 – Foo Fighters – White Limo – Stars in the music video\n\nVideography\n\nVideo tape/laser disc\n\n* 1982 Live in Toronto – Castle Hendring\n* 1984 Another Perfect Day EP\n* 1985 Birthday Party\n* 1986 Deaf Not Blind\n* 1987 More Bad News\n* 1988 EP\n* 1988 The Decline of Western Civilization II: The Metal Years\n* 1990 Hardware (Lemmy was cast as a water taxi driver; and plays a recording of \"Ace of Spades\" for his passengers).\n* 1991 Everything Louder than Everyone Else\n\nDVD\n\n* 1987 Eat the Rich\n* 1994 Airheads – cameo as \"The Rocker\" who \"was editor of the school magazine!\"\n* 1997 Tromeo and Juliet – cast as Narrator, Troma pictures\n* 1999 Terror Firmer\n* 2001 Down and Out with the Dolls – as Joe\n* 2001 25 & Alive Boneshaker\n* 2001 WrestleMania X-Seven – Performing Triple-H's entrance theme \"The Game\" live\n* 2001 Citizen Toxie: The Toxic Avenger IV – as a Tromaville citizen\n* 2002 Motörhead EP\n* 2002 The Best of Motörhead\n* 2003 The Special Edition EP\n* 2003 Charlie's Death Wish – as himself\n* 2004 Everything Louder than Everything Else\n* 2005 Stage Fright (also HD-DVD 2007)\n* 2005 Ringers: Lord of the Fans\n* 2005 WrestleMania 21 Performing \"The Game\"\n* 2005 Metal: A Headbanger's Journey\n* 2006 The Head Cat Live: Rockin' the Cat Club\n* 2006 Foo Fighters: Hyde Park\n* 2010 Lemmy\n* 2011 The Wörld Is Yours bonus DVD. Lemmy. http://en.wikipedia.org/?curid=18642."
  }
}
