{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9835",
  "eid" : "f245cd70-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778486215,
  "textBody" : "Escape from New York is a 1981 American dystopian science-fiction action film co-written, co-scored and directed by John Carpenter. The film is set in what was near-future of 1997, in a crime-ridden United States that has converted Manhattan Island in New York City into the country's maximum security prison. When Air Force One is hijacked by terrorists and crashes into New York City, ex-soldier and federal prisoner Snake Plissken (Kurt Russell) is given 24 hours to rescue the President of the United States.\n\nCarpenter wrote the film in the mid-1970s as a reaction to the Watergate scandal. After the success of Halloween, he had enough influence to begin production and filmed it mainly in St. Louis, Missouri on an estimated budget of $6 million. Debra Hill and Larry J. Franco served as the producers. The film was co-written by Nick Castle, who had collaborated with Carpenter by portraying Michael Myers in Halloween.\n\nEscape from New York was released in the United States on July 10, 1981. The film received positive reviews from critics and was a commercial success, grossing over $25 million at the box office. The film was nominated for four Saturn Awards, including Best Science Fiction Film and Best Direction. The film became a cult classic and was followed by a sequel, Escape from L.A. (1996), which was also directed and written by Carpenter and starred Russell but which was much less favorably received.\n\nPlot\n\nIn 1988, following a 400% increase in crime, the United States government has turned Manhattan into a giant maximum-security prison. A 50 ft containment wall surrounds the island and routes out of Manhattan have been dismantled or mined, while armed helicopters patrol the rivers, and all prisoners there are sentenced to life, with no means of leaving.\n\nIn 1997, while traveling to a peace summit between the United States, China and Russia, Air Force One is hijacked by a domestic terrorist posing as a stewardess. The President is given a tracking bracelet and his briefcase (containing an audiotape describing the secret to using nuclear fusion for power generation) handcuffed to his wrist. He makes it to an escape pod, and lands in Manhattan just before Air Force One crashes, killing everyone else aboard.\n\nPolice are dispatched to rescue the President. However, Romero, the right-hand man of the Duke of New York, the top crime boss in the prison, warns them that the Duke has taken the President hostage, and that he will be killed if any further rescue attempts are mounted. Commissioner Bob Hauk offers a deal to Snake Plissken, a former Special Forces soldier convicted of attempting to rob the Federal Reserve in Denver: if Snake rescues the President and retrieves the cassette tape, Hauk will arrange a presidential pardon. To ensure his compliance, Hauk has Plissken injected with micro-explosives that will rupture Snake's carotid arteries within 22 hours; if Snake returns with the President and the tape in time, Hauk will have the explosives neutralized.\n\nSnake is sent into Manhattan in a stealth glider, landing atop the World Trade Center. He tracks the President's life-monitor bracelet to a vaudeville theater, only to find it on the wrist of an insane old man. He meets \"Cabbie,\" who takes Snake in his armored taxi cab to Harold \"Brain\" Hellman, an advisor to the Duke and a former associate of Snake's. Brain tells Snake that the Duke plans to unify the gangs in a mass exodus across the heavily guarded Queensboro Bridge, using the President as a human shield and a map Brain has created to avoid the landmines. Snake forces Brain and his girlfriend Maggie to lead him to the Duke's compound at Grand Central Terminal. He finds the President, but is captured by the Duke's men.\n\nWhile Snake is forced to fight in a deathmatch with Slag, a prisoner, Brain and Maggie kill Romero and flee with the President. As Snake kills Slag, the Duke learns of Brain's treachery and rallies his gang to chase them. Snake, Brain, Maggie, and the President race to the World Trade Center in an attempt to use Snake's glider to escape from Manhattan. After a group of crazies destroy it, the group returns to the street and encounters Cabbie, who offers to take them across the bridge. When Cabbie reveals that he has the secret tape (having traded it to Romero earlier for his hat), the President demands it, but Snake keeps it.\n\nThe Duke pursues the group onto the bridge, setting off mines as he tries to catch up. With Brain navigating through the minefield, Snake manages to avoid most of the explosives, but the cab hits a mine and is blown in half, killing Cabbie. As the group flees on foot, Brain is killed when he steps on another mine. Maggie refuses to leave him, and stands in the middle of the road, shooting at the Duke's car until he runs her down, killing her. Snake and the President reach the perimeter wall and the guards raise the President on a rope. The Duke opens fire on the wall, killing the guards and forcing Snake to dive for cover, but the President shoots the Duke dead. Snake is lifted to safety, and the micro-explosives in his neck are neutralized.\n\nAs the President prepares for a televised speech to the leaders at the summit meeting, he thanks Snake for saving him. Snake asks how he feels about the people who died saving him, but the President only offers half-hearted regret. As Snake walks away in disgust, Hauk offers Snake a job, which he refuses. The President's speech commences, and he offers the contents of the cassette; to his embarrassment, the tape is Cabbie's cassette of the swing song \"Bandstand Boogie\". As Snake walks away, he intentionally tears the magnetic tape out of the cassette reel with the actual message that was intended to be delivered by the President.\n\nCast\n\nThe character \"Rehme\" was named after producer Robert Rehme, while \"Taylor\", \"Romero\" and \"Cronenberg\" were named after the directors Don Taylor, George Romero and David Cronenberg respectively.\n\nProduction\n\nDevelopment\n\nCarpenter originally wrote the screenplay for Escape from New York in 1976, in the aftermath of the Watergate scandal. Carpenter said, \"The whole feeling of the nation was one of real cynicism about the President. I wrote the screenplay and no studio wanted to make it\" because, according to Carpenter, \"it was too violent, too scary, too weird.\" He had been inspired by the film Death Wish, which was very popular at the time. He did not agree with this film's philosophy but liked how it conveyed \"the sense of New York as a kind of jungle, and I wanted to make a science fiction film along these lines\".\n\nCasting\n\nAVCO Embassy Pictures, the film's financial backer, preferred either Charles Bronson or Tommy Lee Jones to play the role of Snake Plissken to Carpenter's choice of Kurt Russell, who was trying to overcome the \"lightweight\" screen image conveyed by his roles in several Disney comedies. Carpenter refused to cast Bronson on the grounds that he was too old, and because he worried that he could lose directorial control over the picture with an experienced actor. At the time, Russell described his character as \"a mercenary, and his style of fighting is a combination of Bruce Lee, The Exterminator, and Darth Vader, with Eastwood's vocal-ness.\" All that matters to Snake, according to the actor, is \"the next 60 seconds. Living for exactly that next minute is all there is.\" Russell used a rigorous diet and exercise program in order to develop a lean and muscular build. He also endeavored to stay in character between takes and throughout the shooting, as he welcomed the opportunity to get away from the Disney comedies he had done previously. He did find it necessary to remove the eyepatch between takes, as wearing it constantly seriously affected his depth perception.\n\nPre-production\n\nCarpenter had just made Dark Star but no one wanted to hire him as a director, so he assumed that he would make it in Hollywood as a screenwriter. The filmmaker went on to do other films with the intention of making Escape later. After the success of Halloween, Avco-Embassy signed him and producer Debra Hill to a two-picture deal. The first film from this contract was The Fog. Initially, the second film that he was going to make to finish the contract was The Philadelphia Experiment, but because of script-writing problems, Carpenter rejected it in favor of this project. However, Carpenter felt that something was missing and recalls, \"This was basically a straight action film. And at one point, I realized it really doesn't have this kind of crazy humor that people from New York would expect to see.\" He brought in Nick Castle, a friend from his film school days at University of Southern California who played \"The Shape\" in Halloween. Castle invented the Cabbie character and came up with the film's ending.\n\nThe film's setting proved to be a potential problem for Carpenter, who needed to create a decaying, semi-destroyed version of New York City on a shoe-string budget. He and the film's production designer Joe Alves rejected shooting on location in New York City because it would be too hard to make it look like a destroyed city. Carpenter suggested shooting on a movie back lot but Alves nixed that idea \"because the texture of a real street is not like a back lot.\" They sent Barry Bernardi, their location manager (and associate producer), \"on a sort of all-expense-paid trip across the country looking for the worst city in America,\" producer Debra Hill remembers.\n\nBernardi suggested East St. Louis, Illinois, because it was filled with old buildings \"that exist in New York now, and [that] have that seedy run-down quality\" that the team was looking for. East St. Louis, sitting across the Mississippi River from the more prosperous St. Louis, Missouri, had entire neighborhoods burned out in 1976 during a massive urban fire. Hill said in an interview, \"block after block was burnt-out rubble. In some places there was absolutely nothing, so that you could see three and four blocks away.\" As well, Alves found an old bridge to double for the \"69th St. Bridge\". The filmmaker purchased the Old Chain of Rocks Bridge for one dollar from the government and then gave it back to them, for the same amount, once production was completed, \"so that they wouldn't have any liability,\" Hill remembers. Locations across the river in St. Louis, Missouri were used, including Union Station and the Fox Theatre, both of which have since been renovated, as well as the building which would eventually become the Schlafly Tap Room microbrewery.\n\nFilming\n\nCarpenter and his crew persuaded the city to shut off the electricity to ten blocks at a time at night. The film was shot from August to November 1980. It was a tough and demanding shoot for the filmmaker as he recalls. \"We'd finish shooting at about 6 am and I'd just be going to sleep at 7 when the sun would be coming up. I'd wake up around 5 or 6 pm, depending on whether or not we had dailies, and by the time I got going, the sun would be setting. So for about two and a half months I never saw daylight, which was really strange.\" The gladiatorial fight to the death scene between Snake and Slag (played by professional wrestler Ox Baker) was filmed in the Grand Hall at St. Louis Union Station. Russell has stated, \"That day was a nightmare. All I did was swing a [spiked] bat at that guy and get swung at in return. He threw a trash can in my face about five times ... I could have wound up in pretty bad shape.\" In addition to shooting on location in St. Louis, Carpenter shot parts of the film in Los Angeles. Various interior scenes were shot on a sound stage; the final scenes were shot at the Sepulveda Dam, in Sherman Oaks. New York served as a location, as did Atlanta, to use their futuristic-looking rapid-transit system. In New York City, Carpenter persuaded federal officials to grant access to Liberty Island. \"We were the first film company in history allowed to shoot on Liberty Island at the Statue of Liberty at night. They let us have the whole island to ourselves. We were lucky. It wasn't easy to get that initial permission. They'd had a bombing three months earlier and were worried about trouble\".\n\nCarpenter was interested in creating two distinct looks for the movie. \"One is the police state, high tech, lots of neon, a United States dominated by underground computers. That was easy to shoot compared to the Manhattan Island prison sequences which had few lights, mainly torch lights, like feudal England\". Certain matte paintings were rendered by James Cameron, who was at the time a special effects artist with Roger Corman's New World Pictures. Cameron was also one of the directors of photography on the film. As Snake pilots the glider into the city, there are three screens on his control panel displaying wireframe animations of the landing target on the World Trade Center and surrounding buildings. Carpenter wanted high-tech computer graphics, which were very expensive, even for such a simple animation. The effects crew filmed the miniature model set of New York City they used for other scenes under black light, with reflective tape placed along every edge of the model buildings. Only the tape is visible and appears to be a 3D wireframe animation.\n\nReception\n\nEscape from New York opened in New York and Los Angeles July 10, 1981. The film grossed $25.2 million in American theaters in summer 1981. The film received generally positive reviews. As of November 19, 2017, it had a rating of 86 percent on Rotten Tomatoes, with the critical consensus \"Featuring an atmospherically grimy futuristic metropolis, Escape from New York is a strange, entertaining jumble of thrilling action and oddball weirdness\". Newsweek magazine wrote \"[He has a] deeply ingrained B-movie sensibility - which is both his strength and limitation. He does clean work, but settles for too little. He uses Russell well, however\". In Time magazine, Richard Corliss wrote, \"John Carpenter is offering this summer's moviegoers a rare opportunity: to escape from the air-conditioned torpor of ordinary entertainment into the hothouse humidity of their own paranoia. It's a trip worth taking\". Vincent Canby, in his review for The New York Times, wrote, \"[The film] is not to be analyzed too solemnly, though. It's a toughly told, very tall tale, one of the best escape (and escapist) movies of the season.\" In his review for the Chicago Reader, Dave Kehr, wrote \"it fails to satisfy–it gives us too little of too much\".\n\nCyberpunk pioneer William Gibson credits the film as an influence on his novel Neuromancer. \"I was intrigued by the exchange in one of the opening scenes where the Warden says to Snake 'You flew the Gullfire over Leningrad, didn't you?' It turns out to be just a throwaway line, but for a moment it worked like the best SF where a casual reference can imply a lot.\" Popular videogame director Hideo Kojima has referred to the movie frequently as an influence on his work, in particular the Metal Gear series. Solid Snake is partially influenced by Snake Plissken. In Metal Gear Solid 2: Sons of Liberty Snake actually uses the alias \"Pliskin\" to hide his real identity during most of the game.SEAL: I'm not an enemy. Calm down. My name is S... My name is Pliskin. Iroquois Pliskin, Lieutenant Junior Grade. (Metal Gear Solid 2: Sons of Liberty, Konami, 2001). J. J. Abrams, producer of the 2008 film Cloverfield, mentioned that a scene in his film, which shows the head of the Statue of Liberty crashing into a New York street, was inspired by the poster for Escape from New York. Empire magazine ranked Snake Plissken #29 in their \"The 100 Greatest Movie Characters\" poll.\n\nSoundtrack\n\nHome media\n\nVideocassette releases\n\nEscape from New York was released numerous times on VHS during the 1980s and 1990s.\n\nDVD releases\n\nEscape from New York was released on DVD twice by MGM (USA), and once by Momentum Pictures (UK). One MGM release is a barebones edition containing just the theatrical trailer. Another version is the Collector's Edition, a two-disc set featuring a High Definition remastered transfer with a 5.1 Stereo audio track, two commentaries (one by John Carpenter and Kurt Russell, another by producer Debra Hill and Joe Alves), a making-of featurette, the first issue of a comic book series titled John Carpenter's Snake Plissken Chronicles, and the ten-minute Colorado bank robbery deleted opening sequence.\n\nMGM's special edition of the 1981 film was not released until 2003 because the original negative had disappeared.  The workprint containing deleted scenes finally turned up in the Hutchinson, Kansas salt mine film depository.  The excised scenes feature Snake Plissken robbing a bank, introducing the character of Plissken and establishing a backstory. Director John Carpenter decided to add the original scenes into the special edition release as an extra only: \"After we screened the rough cut, we realized that the movie didn't really start until Snake got to New York. It wasn't necessary to show what sent him there.\" The film has been released on the UMD format for Sony's PlayStation Portable.\n\nBlu-ray release\n\nOn August 3, 2010, MGM Home Entertainment released Escape From New York as a bare-bones Blu-ray. Scream Factory, in association with Shout! Factory, released the film on a special edition Blu-ray on April 21, 2015.\n\nNovelization\n\nIn 1981, Bantam Books published a movie tie-in novelization written by Mike McQuay that adopts a lean, humorous style reminiscent of the film. The novel is significant because it includes scenes that were cut out of the film, such as the Federal Reserve Depository robbery that results in Snake's incarceration. The novel provides motivation and backstory to Snake and Hauk — both disillusioned war veterans — deepening their relationship that was only hinted at it in the film. The novel explains how Snake lost his eye during the Battle for Leningrad in World War III, how Hauk became warden of New York, and Hauk's quest to find his crazy son who lives somewhere in the prison. The novel fleshes out the world that these characters exist in, at times presenting a future even bleaker than the one depicted in the film. The book explains that the West Coast is a no-man's land, and the country's population is gradually being driven crazy by nerve gas as a result of World War III.\n\nComic books\n\nMarvel Comics released the one-shot The Adventures of Snake Plissken in January 1997. The story takes place sometime between Escape from New York and before his famous Cleveland escape mentioned in Escape from L.A. Snake has robbed Atlanta's Center for Disease Control of some engineered metaviruses and is looking for buyers in Chicago. Finding himself in a deal that's really a set-up, he makes his getaway and exacts revenge on the buyer for ratting him out to the United States Police Force. In the meantime, a government lab has built a robot called A.T.A.C.S. (Autonomous Tracking And Combat System) that can catch criminals by imprinting their personalities upon its program in order to predict and anticipate a specific criminal's every move. The robot's first test subject is America's public enemy number one, Snake Plissken. After a brief battle, the tide turns when A.T.A.C.S. copies Snake to the point of fully becoming his personality. Now recognizing the government as the enemy, A.T.A.C.S. sides with Snake. Unamused, Snake sucker punches the machine and destroys it. As A.T.A.C.S. shuts down, it can only ask him, \"Why?\" Snake just walks off answering, \"I don't need the competition\".\n\nIn 2003, CrossGen published John Carpenter's Snake Plissken Chronicles, a four-part comic book miniseries. The story takes place a day or so after the events of Escape from New York. Snake has been given a military Humvee after his presidential pardon and makes his way to Atlantic City. Although the director's cut of Escape from New York shows Snake was caught after a bank job, this story has Snake finishing up a second heist that was pre-planned before his capture. The job entails stealing the car in which John F. Kennedy was assassinated from a casino before delivering it to a buyer in the Gulf of Mexico. Snake partners with a man named Marrs who ends up double crossing him. Left for dead in a sinking crab cage, Snake escapes and is saved by a passing fisherman named Captain Ron (an in-joke referring to Kurt Russell's 1992 comedy, Captain Ron). When Ron denies Snake's request to use his boat in order to beat Marrs to the robbery, Snake decides to kill him. When Snake ends up saving Ron from the Russian mob who wants money, Ron changes his mind and helps Snake. Once at the casino, Snake comes face-to-face with Marrs and his men, who arrive at the same time, ending in a high-speed shootout. Snake gets away with the car and its actress portraying Jackie Kennedy, leaving Marrs to be caught by the casino owner, who cuts him a deal to bring his car back and live. After some trouble, Snake manages to finally get the car to the buyer's yacht, using Ron's boat, and is then attacked by Marrs. Following the firefight, the yacht and car are destroyed, Marrs and Captain Ron are dead, and Snake makes his escape in a helicopter with the 30 million credits owed to him for the job.\n\nIn 2014, BOOM! Studios began publishing an Escape From New York comic book by writer, Christopher Sebela.[http://www.comicbookresources.com/?pagearticle&id\n54326 SDCC: Sebela Attempts an \"Escape From New York\" at BOOM!] The first issue of the series was released on December 3, 2014[http://bloody-disgusting.com/reviews/3323200/comic-book-review-escape-new-york-1-sequel-deserve/ “Escape From New York” #1 Is The Sequel We Deserve] and the story picks up moments after the end of the film.\n\nBOOM! will release a crossover comics miniseries between Snake and Jack Burton titled Big Trouble in Little China / Escape from New York in October 2016.\n\nBoard game\n\nAn Escape from New York board game was released in 1981 by TSR, Inc.\n\nAnime\n\nCarpenter was planning an anime spin-off of Escape from New York, with Outlaw Stars Mitsuru Hongo slated to direct. However, nothing new has emerged since that announcement.\n\nSequel\n\nA sequel, Escape from L.A., was released in 1996, with Carpenter returning along with Russell, now also acting as producer and co-writer.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Escape from New York" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9835" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Escape from New York is a 1981 American dystopian science-fiction action film co-written, co-scored and directed by John Carpenter. The film is set in what was near-future of 1997, in a crime-ridden United States that has converted Manhattan Island in New York City into the country's maximum security prison. When Air Force One is hijacked by terrorists and crashes into New York City, ex-soldier and federal prisoner Snake Plissken (Kurt Russell) is given 24 hours to rescue the President of the United States.\n\nCarpenter wrote the film in the mid-1970s as a reaction to the Watergate scandal. After the success of Halloween, he had enough influence to begin production and filmed it mainly in St. Louis, Missouri on an estimated budget of $6 million. Debra Hill and Larry J. Franco served as the producers. The film was co-written by Nick Castle, who had collaborated with Carpenter by portraying Michael Myers in Halloween.\n\nEscape from New York was released in the United States on July 10, 1981. The film received positive reviews from critics and was a commercial success, grossing over $25 million at the box office. The film was nominated for four Saturn Awards, including Best Science Fiction Film and Best Direction. The film became a cult classic and was followed by a sequel, Escape from L.A. (1996), which was also directed and written by Carpenter and starred Russell but which was much less favorably received.\n\nPlot\n\nIn 1988, following a 400% increase in crime, the United States government has turned Manhattan into a giant maximum-security prison. A 50 ft containment wall surrounds the island and routes out of Manhattan have been dismantled or mined, while armed helicopters patrol the rivers, and all prisoners there are sentenced to life, with no means of leaving.\n\nIn 1997, while traveling to a peace summit between the United States, China and Russia, Air Force One is hijacked by a domestic terrorist posing as a stewardess. The President is given a tracking bracelet and his briefcase (containing an audiotape describing the secret to using nuclear fusion for power generation) handcuffed to his wrist. He makes it to an escape pod, and lands in Manhattan just before Air Force One crashes, killing everyone else aboard.\n\nPolice are dispatched to rescue the President. However, Romero, the right-hand man of the Duke of New York, the top crime boss in the prison, warns them that the Duke has taken the President hostage, and that he will be killed if any further rescue attempts are mounted. Commissioner Bob Hauk offers a deal to Snake Plissken, a former Special Forces soldier convicted of attempting to rob the Federal Reserve in Denver: if Snake rescues the President and retrieves the cassette tape, Hauk will arrange a presidential pardon. To ensure his compliance, Hauk has Plissken injected with micro-explosives that will rupture Snake's carotid arteries within 22 hours; if Snake returns with the President and the tape in time, Hauk will have the explosives neutralized.\n\nSnake is sent into Manhattan in a stealth glider, landing atop the World Trade Center. He tracks the President's life-monitor bracelet to a vaudeville theater, only to find it on the wrist of an insane old man. He meets \"Cabbie,\" who takes Snake in his armored taxi cab to Harold \"Brain\" Hellman, an advisor to the Duke and a former associate of Snake's. Brain tells Snake that the Duke plans to unify the gangs in a mass exodus across the heavily guarded Queensboro Bridge, using the President as a human shield and a map Brain has created to avoid the landmines. Snake forces Brain and his girlfriend Maggie to lead him to the Duke's compound at Grand Central Terminal. He finds the President, but is captured by the Duke's men.\n\nWhile Snake is forced to fight in a deathmatch with Slag, a prisoner, Brain and Maggie kill Romero and flee with the President. As Snake kills Slag, the Duke learns of Brain's treachery and rallies his gang to chase them. Snake, Brain, Maggie, and the President race to the World Trade Center in an attempt to use Snake's glider to escape from Manhattan. After a group of crazies destroy it, the group returns to the street and encounters Cabbie, who offers to take them across the bridge. When Cabbie reveals that he has the secret tape (having traded it to Romero earlier for his hat), the President demands it, but Snake keeps it.\n\nThe Duke pursues the group onto the bridge, setting off mines as he tries to catch up. With Brain navigating through the minefield, Snake manages to avoid most of the explosives, but the cab hits a mine and is blown in half, killing Cabbie. As the group flees on foot, Brain is killed when he steps on another mine. Maggie refuses to leave him, and stands in the middle of the road, shooting at the Duke's car until he runs her down, killing her. Snake and the President reach the perimeter wall and the guards raise the President on a rope. The Duke opens fire on the wall, killing the guards and forcing Snake to dive for cover, but the President shoots the Duke dead. Snake is lifted to safety, and the micro-explosives in his neck are neutralized.\n\nAs the President prepares for a televised speech to the leaders at the summit meeting, he thanks Snake for saving him. Snake asks how he feels about the people who died saving him, but the President only offers half-hearted regret. As Snake walks away in disgust, Hauk offers Snake a job, which he refuses. The President's speech commences, and he offers the contents of the cassette; to his embarrassment, the tape is Cabbie's cassette of the swing song \"Bandstand Boogie\". As Snake walks away, he intentionally tears the magnetic tape out of the cassette reel with the actual message that was intended to be delivered by the President.\n\nCast\n\nThe character \"Rehme\" was named after producer Robert Rehme, while \"Taylor\", \"Romero\" and \"Cronenberg\" were named after the directors Don Taylor, George Romero and David Cronenberg respectively.\n\nProduction\n\nDevelopment\n\nCarpenter originally wrote the screenplay for Escape from New York in 1976, in the aftermath of the Watergate scandal. Carpenter said, \"The whole feeling of the nation was one of real cynicism about the President. I wrote the screenplay and no studio wanted to make it\" because, according to Carpenter, \"it was too violent, too scary, too weird.\" He had been inspired by the film Death Wish, which was very popular at the time. He did not agree with this film's philosophy but liked how it conveyed \"the sense of New York as a kind of jungle, and I wanted to make a science fiction film along these lines\".\n\nCasting\n\nAVCO Embassy Pictures, the film's financial backer, preferred either Charles Bronson or Tommy Lee Jones to play the role of Snake Plissken to Carpenter's choice of Kurt Russell, who was trying to overcome the \"lightweight\" screen image conveyed by his roles in several Disney comedies. Carpenter refused to cast Bronson on the grounds that he was too old, and because he worried that he could lose directorial control over the picture with an experienced actor. At the time, Russell described his character as \"a mercenary, and his style of fighting is a combination of Bruce Lee, The Exterminator, and Darth Vader, with Eastwood's vocal-ness.\" All that matters to Snake, according to the actor, is \"the next 60 seconds. Living for exactly that next minute is all there is.\" Russell used a rigorous diet and exercise program in order to develop a lean and muscular build. He also endeavored to stay in character between takes and throughout the shooting, as he welcomed the opportunity to get away from the Disney comedies he had done previously. He did find it necessary to remove the eyepatch between takes, as wearing it constantly seriously affected his depth perception.\n\nPre-production\n\nCarpenter had just made Dark Star but no one wanted to hire him as a director, so he assumed that he would make it in Hollywood as a screenwriter. The filmmaker went on to do other films with the intention of making Escape later. After the success of Halloween, Avco-Embassy signed him and producer Debra Hill to a two-picture deal. The first film from this contract was The Fog. Initially, the second film that he was going to make to finish the contract was The Philadelphia Experiment, but because of script-writing problems, Carpenter rejected it in favor of this project. However, Carpenter felt that something was missing and recalls, \"This was basically a straight action film. And at one point, I realized it really doesn't have this kind of crazy humor that people from New York would expect to see.\" He brought in Nick Castle, a friend from his film school days at University of Southern California who played \"The Shape\" in Halloween. Castle invented the Cabbie character and came up with the film's ending.\n\nThe film's setting proved to be a potential problem for Carpenter, who needed to create a decaying, semi-destroyed version of New York City on a shoe-string budget. He and the film's production designer Joe Alves rejected shooting on location in New York City because it would be too hard to make it look like a destroyed city. Carpenter suggested shooting on a movie back lot but Alves nixed that idea \"because the texture of a real street is not like a back lot.\" They sent Barry Bernardi, their location manager (and associate producer), \"on a sort of all-expense-paid trip across the country looking for the worst city in America,\" producer Debra Hill remembers.\n\nBernardi suggested East St. Louis, Illinois, because it was filled with old buildings \"that exist in New York now, and [that] have that seedy run-down quality\" that the team was looking for. East St. Louis, sitting across the Mississippi River from the more prosperous St. Louis, Missouri, had entire neighborhoods burned out in 1976 during a massive urban fire. Hill said in an interview, \"block after block was burnt-out rubble. In some places there was absolutely nothing, so that you could see three and four blocks away.\" As well, Alves found an old bridge to double for the \"69th St. Bridge\". The filmmaker purchased the Old Chain of Rocks Bridge for one dollar from the government and then gave it back to them, for the same amount, once production was completed, \"so that they wouldn't have any liability,\" Hill remembers. Locations across the river in St. Louis, Missouri were used, including Union Station and the Fox Theatre, both of which have since been renovated, as well as the building which would eventually become the Schlafly Tap Room microbrewery.\n\nFilming\n\nCarpenter and his crew persuaded the city to shut off the electricity to ten blocks at a time at night. The film was shot from August to November 1980. It was a tough and demanding shoot for the filmmaker as he recalls. \"We'd finish shooting at about 6 am and I'd just be going to sleep at 7 when the sun would be coming up. I'd wake up around 5 or 6 pm, depending on whether or not we had dailies, and by the time I got going, the sun would be setting. So for about two and a half months I never saw daylight, which was really strange.\" The gladiatorial fight to the death scene between Snake and Slag (played by professional wrestler Ox Baker) was filmed in the Grand Hall at St. Louis Union Station. Russell has stated, \"That day was a nightmare. All I did was swing a [spiked] bat at that guy and get swung at in return. He threw a trash can in my face about five times ... I could have wound up in pretty bad shape.\" In addition to shooting on location in St. Louis, Carpenter shot parts of the film in Los Angeles. Various interior scenes were shot on a sound stage; the final scenes were shot at the Sepulveda Dam, in Sherman Oaks. New York served as a location, as did Atlanta, to use their futuristic-looking rapid-transit system. In New York City, Carpenter persuaded federal officials to grant access to Liberty Island. \"We were the first film company in history allowed to shoot on Liberty Island at the Statue of Liberty at night. They let us have the whole island to ourselves. We were lucky. It wasn't easy to get that initial permission. They'd had a bombing three months earlier and were worried about trouble\".\n\nCarpenter was interested in creating two distinct looks for the movie. \"One is the police state, high tech, lots of neon, a United States dominated by underground computers. That was easy to shoot compared to the Manhattan Island prison sequences which had few lights, mainly torch lights, like feudal England\". Certain matte paintings were rendered by James Cameron, who was at the time a special effects artist with Roger Corman's New World Pictures. Cameron was also one of the directors of photography on the film. As Snake pilots the glider into the city, there are three screens on his control panel displaying wireframe animations of the landing target on the World Trade Center and surrounding buildings. Carpenter wanted high-tech computer graphics, which were very expensive, even for such a simple animation. The effects crew filmed the miniature model set of New York City they used for other scenes under black light, with reflective tape placed along every edge of the model buildings. Only the tape is visible and appears to be a 3D wireframe animation.\n\nReception\n\nEscape from New York opened in New York and Los Angeles July 10, 1981. The film grossed $25.2 million in American theaters in summer 1981. The film received generally positive reviews. As of November 19, 2017, it had a rating of 86 percent on Rotten Tomatoes, with the critical consensus \"Featuring an atmospherically grimy futuristic metropolis, Escape from New York is a strange, entertaining jumble of thrilling action and oddball weirdness\". Newsweek magazine wrote \"[He has a] deeply ingrained B-movie sensibility - which is both his strength and limitation. He does clean work, but settles for too little. He uses Russell well, however\". In Time magazine, Richard Corliss wrote, \"John Carpenter is offering this summer's moviegoers a rare opportunity: to escape from the air-conditioned torpor of ordinary entertainment into the hothouse humidity of their own paranoia. It's a trip worth taking\". Vincent Canby, in his review for The New York Times, wrote, \"[The film] is not to be analyzed too solemnly, though. It's a toughly told, very tall tale, one of the best escape (and escapist) movies of the season.\" In his review for the Chicago Reader, Dave Kehr, wrote \"it fails to satisfy–it gives us too little of too much\".\n\nCyberpunk pioneer William Gibson credits the film as an influence on his novel Neuromancer. \"I was intrigued by the exchange in one of the opening scenes where the Warden says to Snake 'You flew the Gullfire over Leningrad, didn't you?' It turns out to be just a throwaway line, but for a moment it worked like the best SF where a casual reference can imply a lot.\" Popular videogame director Hideo Kojima has referred to the movie frequently as an influence on his work, in particular the Metal Gear series. Solid Snake is partially influenced by Snake Plissken. In Metal Gear Solid 2: Sons of Liberty Snake actually uses the alias \"Pliskin\" to hide his real identity during most of the game.SEAL: I'm not an enemy. Calm down. My name is S... My name is Pliskin. Iroquois Pliskin, Lieutenant Junior Grade. (Metal Gear Solid 2: Sons of Liberty, Konami, 2001). J. J. Abrams, producer of the 2008 film Cloverfield, mentioned that a scene in his film, which shows the head of the Statue of Liberty crashing into a New York street, was inspired by the poster for Escape from New York. Empire magazine ranked Snake Plissken #29 in their \"The 100 Greatest Movie Characters\" poll.\n\nSoundtrack\n\nHome media\n\nVideocassette releases\n\nEscape from New York was released numerous times on VHS during the 1980s and 1990s.\n\nDVD releases\n\nEscape from New York was released on DVD twice by MGM (USA), and once by Momentum Pictures (UK). One MGM release is a barebones edition containing just the theatrical trailer. Another version is the Collector's Edition, a two-disc set featuring a High Definition remastered transfer with a 5.1 Stereo audio track, two commentaries (one by John Carpenter and Kurt Russell, another by producer Debra Hill and Joe Alves), a making-of featurette, the first issue of a comic book series titled John Carpenter's Snake Plissken Chronicles, and the ten-minute Colorado bank robbery deleted opening sequence.\n\nMGM's special edition of the 1981 film was not released until 2003 because the original negative had disappeared.  The workprint containing deleted scenes finally turned up in the Hutchinson, Kansas salt mine film depository.  The excised scenes feature Snake Plissken robbing a bank, introducing the character of Plissken and establishing a backstory. Director John Carpenter decided to add the original scenes into the special edition release as an extra only: \"After we screened the rough cut, we realized that the movie didn't really start until Snake got to New York. It wasn't necessary to show what sent him there.\" The film has been released on the UMD format for Sony's PlayStation Portable.\n\nBlu-ray release\n\nOn August 3, 2010, MGM Home Entertainment released Escape From New York as a bare-bones Blu-ray. Scream Factory, in association with Shout! Factory, released the film on a special edition Blu-ray on April 21, 2015.\n\nNovelization\n\nIn 1981, Bantam Books published a movie tie-in novelization written by Mike McQuay that adopts a lean, humorous style reminiscent of the film. The novel is significant because it includes scenes that were cut out of the film, such as the Federal Reserve Depository robbery that results in Snake's incarceration. The novel provides motivation and backstory to Snake and Hauk — both disillusioned war veterans — deepening their relationship that was only hinted at it in the film. The novel explains how Snake lost his eye during the Battle for Leningrad in World War III, how Hauk became warden of New York, and Hauk's quest to find his crazy son who lives somewhere in the prison. The novel fleshes out the world that these characters exist in, at times presenting a future even bleaker than the one depicted in the film. The book explains that the West Coast is a no-man's land, and the country's population is gradually being driven crazy by nerve gas as a result of World War III.\n\nComic books\n\nMarvel Comics released the one-shot The Adventures of Snake Plissken in January 1997. The story takes place sometime between Escape from New York and before his famous Cleveland escape mentioned in Escape from L.A. Snake has robbed Atlanta's Center for Disease Control of some engineered metaviruses and is looking for buyers in Chicago. Finding himself in a deal that's really a set-up, he makes his getaway and exacts revenge on the buyer for ratting him out to the United States Police Force. In the meantime, a government lab has built a robot called A.T.A.C.S. (Autonomous Tracking And Combat System) that can catch criminals by imprinting their personalities upon its program in order to predict and anticipate a specific criminal's every move. The robot's first test subject is America's public enemy number one, Snake Plissken. After a brief battle, the tide turns when A.T.A.C.S. copies Snake to the point of fully becoming his personality. Now recognizing the government as the enemy, A.T.A.C.S. sides with Snake. Unamused, Snake sucker punches the machine and destroys it. As A.T.A.C.S. shuts down, it can only ask him, \"Why?\" Snake just walks off answering, \"I don't need the competition\".\n\nIn 2003, CrossGen published John Carpenter's Snake Plissken Chronicles, a four-part comic book miniseries. The story takes place a day or so after the events of Escape from New York. Snake has been given a military Humvee after his presidential pardon and makes his way to Atlantic City. Although the director's cut of Escape from New York shows Snake was caught after a bank job, this story has Snake finishing up a second heist that was pre-planned before his capture. The job entails stealing the car in which John F. Kennedy was assassinated from a casino before delivering it to a buyer in the Gulf of Mexico. Snake partners with a man named Marrs who ends up double crossing him. Left for dead in a sinking crab cage, Snake escapes and is saved by a passing fisherman named Captain Ron (an in-joke referring to Kurt Russell's 1992 comedy, Captain Ron). When Ron denies Snake's request to use his boat in order to beat Marrs to the robbery, Snake decides to kill him. When Snake ends up saving Ron from the Russian mob who wants money, Ron changes his mind and helps Snake. Once at the casino, Snake comes face-to-face with Marrs and his men, who arrive at the same time, ending in a high-speed shootout. Snake gets away with the car and its actress portraying Jackie Kennedy, leaving Marrs to be caught by the casino owner, who cuts him a deal to bring his car back and live. After some trouble, Snake manages to finally get the car to the buyer's yacht, using Ron's boat, and is then attacked by Marrs. Following the firefight, the yacht and car are destroyed, Marrs and Captain Ron are dead, and Snake makes his escape in a helicopter with the 30 million credits owed to him for the job.\n\nIn 2014, BOOM! Studios began publishing an Escape From New York comic book by writer, Christopher Sebela.[http://www.comicbookresources.com/?pagearticle&id\n54326 SDCC: Sebela Attempts an \"Escape From New York\" at BOOM!] The first issue of the series was released on December 3, 2014[http://bloody-disgusting.com/reviews/3323200/comic-book-review-escape-new-york-1-sequel-deserve/ “Escape From New York” #1 Is The Sequel We Deserve] and the story picks up moments after the end of the film.\n\nBOOM! will release a crossover comics miniseries between Snake and Jack Burton titled Big Trouble in Little China / Escape from New York in October 2016.\n\nBoard game\n\nAn Escape from New York board game was released in 1981 by TSR, Inc.\n\nAnime\n\nCarpenter was planning an anime spin-off of Escape from New York, with Outlaw Stars Mitsuru Hongo slated to direct. However, nothing new has emerged since that announcement.\n\nSequel\n\nA sequel, Escape from L.A., was released in 1996, with Carpenter returning along with Russell, now also acting as producer and co-writer. Escape from New York. http://en.wikipedia.org/?curid=9835."
  }
}
