{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6122",
  "eid" : "da0bde20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778445570,
  "textBody" : "In mathematics, a continuous function is a function for which sufficiently small changes in the input result in arbitrarily small changes in the output. Otherwise, a function is said to be a discontinuous function. A continuous function with a continuous inverse function is called a homeomorphism.\n\nContinuity of functions is one of the core concepts of topology, which is treated in full generality below. The introductory portion of this article focuses on the special case where the inputs and outputs of functions are real numbers.  A stronger form of continuity is uniform continuity. In addition, this article discusses the definition for the more general case of functions between two metric spaces. In order theory, especially in domain theory, one considers a notion of continuity known as Scott continuity. Other forms of continuity do exist but they are not discussed in this article.\n\nAs an example, consider the function h(t), which describes the height of a growing flower at time t. This function is continuous. By contrast, if M(t) denotes the amount of money in a bank account at time t, then the function jumps at each point in time when money is deposited or withdrawn, so the function M(t) is discontinuous.\n\nHistory\n\nA form of the epsilon–delta definition of continuity was first given by Bernard Bolzano in 1817. Augustin-Louis Cauchy defined continuity of y=f(x) as follows: an infinitely small increment \\alpha of the independent variable x always produces an infinitely small change f(x+\\alpha)-f(x) of the dependent variable y (see e.g., Cours d'Analyse, p. 34). Cauchy defined infinitely small quantities in terms of variable quantities, and his definition of continuity closely parallels the infinitesimal definition used today (see microcontinuity). The formal definition and the distinction between pointwise continuity and uniform continuity were first given by Bolzano in the 1830s but the work wasn't published until the 1930s. Like Bolzano, Karl Weierstrass denied continuity of a function at a point c unless it was defined at and on both sides of c, but Édouard Goursat allowed the function to be defined only at and on one side of c, and Camille Jordan allowed it even if the function was defined only at c. All three of those nonequivalent definitions of pointwise continuity are still in use. Eduard Heine provided the first published definition of uniform continuity in 1872, but based these ideas on lectures given by Peter Gustav Lejeune Dirichlet in 1854.\n\nReal-valued continuous functions\n\nDefinition\n\nA function from the set of real numbers to the real numbers can be represented by a graph in the Cartesian plane; such a function is continuous if, roughly speaking, the graph is a single unbroken curve whose domain is the entire real line.  A more mathematically rigorous definition is given below.\n\nA rigorous definition of continuity of real valued function of a real variable is usually given in a first course in calculus in terms of the idea of a limit. First, a function  with variable  is said to be continuous at the point  on the real line, if the limit of , as  approaches that point , is equal to the value ; and second, the function (as a whole) is said to be continuous, if it is continuous at every point. A function is said to be discontinuous (or to have a discontinuity) at some point when it is not continuous there. These points themselves are also addressed as discontinuities.\n\nThere are several different definitions of continuity of a function.  Sometimes a function is said to be continuous if it is continuous at every point in its domain.  In this case, the function , with the domain of all real ,  any integer, is continuous. Sometimes an exception is made for boundaries of the domain. For example, the graph of the function , with the domain of all non-negative reals, has a left-hand endpoint. In this case only the limit from the right is required to equal the value of the function. Under this definition f is continuous at the boundary  and so for all non-negative arguments. The most common and restrictive definition is that a function is continuous if it is continuous at all real numbers.  In this case, the previous two examples are not continuous, but every polynomial function is continuous, as are the sine, cosine, and exponential functions.  Care should be exercised in using the word continuous, so that it is clear from the context which meaning of the word is intended.\n\nUsing mathematical notation, there are several ways to define continuous functions in each of the three senses mentioned above.\n\nLet\nf\\colon D \\rightarrow \\mathbf R \\quad be a function defined on a subset  D  of the set \\mathbf R of real numbers.\n\nThis subset  D  is the domain of f. Some possible choices include \nD = \\mathbf R \\quad  ( D  is the whole set of real numbers), or, for a and b real numbers,\nD [a, b] \n \\{x \\in \\mathbf R \\,|\\, a \\leq x \\leq b \\} \\quad  ( D  is a closed interval), or\nD (a, b) \n \\{x \\in \\mathbf R \\,|\\, a  ( D  is an open interval).\n\nIn case of the domain D being defined as an open interval, a and b are no boundaries in the above sense and the values of f(a) and f(b) do not matter for continuity on D.\n\nDefinition in terms of limits of functions\n\nThe function f is continuous at some point c of its domain if the limit of f(x), as x approaches c through the domain of f,  exists and is equal to f(c)., section II.4 In mathematical notation, this is written as\n\\lim_{x \\to c}{f(x)} = f(c).\nIn detail this means three conditions: first, f has to be defined at c. Second, the limit on the left hand side of that equation has to exist.  Third, the value of this limit must equal f(c).\n\n(We have here assumed that the domain of f does not have any isolated points.  For example, an interval or union of intervals has no isolated points.)\n\nDefinition in terms of neighborhoods\n\nA neighborhood of a point c is a set that contains all points of the domain within some fixed distance of c.  Intuitively, a function is continuous at a point c if the range of the restriction of f to a neighborhood of c shrinks to a single point f(c) as the width of the neighborhood around c shrinks to zero.  More precisely, a function f is continuous at a point c of its domain if, for any neighborhood N_1(f(c)) there is a neighborhood N_2(c) such that f(x)\\in N_1(f(c)) whenever x\\in N_2(c).\n\nThis definition only requires that the domain and the codomain are topological spaces and is thus the most general definition.  It follows from this definition that a function f is automatically continuous at every isolated point of its domain.  As a specific example, every real valued function on the set of integers is continuous.\n\nDefinition in terms of limits of sequences\n\nOne can instead require that for any sequence (x_n)_{n\\in\\mathbb{N}} of points in the domain which converges to c, the corresponding sequence \\left(f(x_n)\\right)_{n\\in \\mathbb{N}} converges to f(c).  In mathematical notation, \\forall (x_n)_{n\\in\\mathbb{N}} \\subset D:\\lim_{n\\to\\infty} x_nc \\Rightarrow \\lim_{n\\to\\infty} f(x_n)\nf(c)\\,.\n\nWeierstrass and Jordan definitions (epsilon–delta) of continuous functions\n\nExplicitly including the definition of the limit of a function, we obtain a self-contained definition:\nGiven a function  f : D → R as above and an element x0 of the domain D, f is said to be continuous at the point x0 when the following holds: For any number ε > 0, however small, there exists some number δ > 0 such that for all x in the domain of f with x0 − δ 0 + δ, the value of f(x) satisfies\n\n f(x_0) - \\varepsilon \n\nAlternatively written, continuity of f : D → R at x0 ∈ D means that for every ε > 0 there exists a δ > 0 such that for all x ∈ D :\n\n| x - x_0 | \n\nMore intuitively, we can say that if we want to get all the f(x) values to stay in some small neighborhood around f(x0), we simply need to choose a small enough neighborhood for the x values around x0. If we can do that no matter how small the f(x) neighborhood is, then f is continuous at x0.\n\nIn modern terms, this is generalized by the definition of continuity of a function with respect to a basis for the topology, here the metric topology.\n\nWeierstrass had required that the interval x0 − δ 0 + δ be entirely within the domain D, but Jordan removed that restriction.\n\nDefinition in terms of control of the remainder\n\nIn proofs and numerical analysis we often need to know how fast limits are converging, or in other words, control of the remainder. We can formalise this to a definition of continuity. \nA function C: [0,\\infty) \\to [0,\\infty] is called a control function if\n* C is non decreasing\n* \\inf_{\\delta > 0} C(\\delta) = 0\n\nA function f : D → R  is C-continuous at x0 if \n:  | f(x) - f(x_0)| \\le C(|x- x_0|)  for all  x \\in D \n\nA function is continuous in x0 if it is C-continuous for some control function C.\n\nThis approach leads naturally to refining the notion of  continuity by restricting the set of admissible control functions. For a given set of control functions \\mathcal{C} a function is \\mathcal{C}-continuous if it is C-continuous for some  C \\in \\mathcal{C}. For example the Lipschitz and Hölder continuous functions of exponent α  below are defined by the set of control functions \n:\\mathcal{C}_{\\mathrm{Lipschitz}} \\{C |  C(\\delta) \n K|\\delta| ,\\  K > 0\\}  \nrespectively  \n:\\mathcal{C}_{\\text{Hölder}-\\alpha}  \\{C | C(\\delta)  \n K |\\delta|^\\alpha, \\ K > 0\\} .\n\nDefinition using oscillation\n\nContinuity can also be defined in terms of oscillation: a function f is continuous at a point x0 if and only if its oscillation at that point is zero;[http://ramanujan.math.trinity.edu/wtrench/texts/TRENCH_REAL_ANALYSIS.PDF Introduction to Real Analysis], updated April 2010, William F. Trench, Theorem 3.5.2, p. 172 in symbols, \\omega_f(x_0) = 0. A benefit of this definition is that it quantifies discontinuity: the oscillation gives how much the function is discontinuous at a point.\n\nThis definition is useful in descriptive set theory to study the set of discontinuities and continuous points – the continuous points are the intersection of the sets where the oscillation is less than ε (hence a Gδ set) – and gives a very quick proof of one direction of the Lebesgue integrability condition.[http://ramanujan.math.trinity.edu/wtrench/texts/TRENCH_REAL_ANALYSIS.PDF Introduction to Real Analysis], updated April 2010, William F. Trench, 3.5 \"A More Advanced Look at the Existence of the Proper Riemann Integral\", pp. 171–177\n\nThe oscillation is equivalent to the ε-δ definition by a simple re-arrangement, and by using a limit (lim sup, lim inf) to define oscillation: if (at a given point) for a given ε0 there is no δ that satisfies the ε-δ definition, then the oscillation is at least ε0, and conversely if for every ε there is a desired δ, the oscillation is 0. The oscillation definition can be naturally generalized to maps from a topological space to a metric space.\n\nDefinition using the hyperreals\n\nCauchy defined continuity of a function in the following intuitive terms: an infinitesimal change in the independent variable corresponds to an infinitesimal change of the dependent variable (see Cours d'analyse, page 34). Non-standard analysis is a way of making this mathematically rigorous. The real line is augmented by the addition of infinite and infinitesimal numbers to form the hyperreal numbers.  In nonstandard analysis, continuity can be defined as follows.\n\nA real-valued function f is continuous at x if its natural extension to the hyperreals has the property that for all infinitesimal dx,  is infinitesimal\n\n(see microcontinuity).  In other words, an infinitesimal increment of the independent variable always produces to an infinitesimal change of the dependent variable, giving a modern expression to Augustin-Louis Cauchy's definition of continuity.\n\nConstruction of continuous functions\n\nChecking the continuity of a given function can be simplified by checking one of the above defining properties for the building blocks of the given function. It is straightforward to show that the sum of two functions, continuous on some domain, is also continuous on this domain. Given\nf, g\\colon D \\rightarrow \\mathbf R,\n\nthen the sum of continuous functions\ns f + g, defined  by s(x) \n f(x) + g(x) for all x\\in D\n\nis continuous in D.\n\nThe same holds for the product of continuous functions.\np f \\cdot g, defined by p(x) \n f(x) \\cdot g(x) for all x \\in D,\n\nis continuous in D.\n\nCombining the above preservations of continuity and the continuity of constant functions and of the identity function I(x) = x  one arrives at the continuity of all polynomial functions   such as\n(pictured, above).\n\nIn the same way it can be shown that the reciprocal of a continuous function \nr 1/f, defined by r(x) \n 1/f(x) for all x \\in D such that f(x) \\ne 0,\n\nis continuous in D\\smallsetminus \\{x:f(x) = 0\\}.\n\nThis implies that, excluding the roots of g, the quotient of continuous functions \nq f/g, defined by g(x) \n f(x)/g(x) for all x \\in D, such that g(x) \\ne 0,\n\nis also continuous on D\\smallsetminus \\{x:g(x) = 0\\}.\n\nFor example, the function (pictured)\ny(x) = \\frac {2x-1} {x+2}\n\nis defined for all real numbers  and is continuous at every such point. Thus it is a continuous function. The question of continuity at  does not arise, since   is not in the domain of y. There is no continuous function F: R → R that agrees with y(x) for all .\n\nSince the sine-function is continuous on all reals, the sinc function G(x) = sin x/x, when defined for all real x ≠ 0, is continuous at these points. Thus G is a continuous function there, too. However, unlike the previous example, G can be extended to a continuous function on all real numbers, by defining the value G(0) to be the limit of G(x), when x approaches 0, i.e.,\nG(0) \\lim_{x\\rightarrow 0}\\frac{\\sin x}{x} \n 1\n\nand thus\n\nG(x) = \n\\begin{cases}\n\\frac {\\sin (x)}x & \\text{ if }x \\ne 0\\\\\n1 & \\text{ if }x = 0,\n\\end{cases}\n\nthe sinc-function becomes a continuous function on all real numbers. The term removable singularity is used in such cases, when (re)defining values of a function to coincide with the appropriate limits make a function continuous at specific points.\n\nA more involved construction of continuous functions is the function composition. Given two continuous functions\nf\\colon D_f \\;(\\subseteq \\mathbf R) \\rightarrow R_f\\; (\\subseteq \\mathbf R)\\quad and \\quad g\\colon D_g\\; (R_f \\subseteq D_g) \\rightarrow R_g \\;(\\subseteq \\mathbf R),\ntheir composition being denoted as\nc g \\circ f \\colon D_f \\rightarrow \\mathbf R, and defined by c(x) \n g(f(x)), is continuous.\n\nThis construction allows to state, for example, that\ne^{\\sin(\\ln x)} is continuous for all x > 0.\n\nExamples of discontinuous functions\n\nAn example of a discontinuous function is the Heaviside step function H, defined by\n\nH(x) = \\begin{cases}\n1 & \\text{ if } x \\ge 0\\\\\n0 & \\text{ if } x \n\nPick for instance \\varepsilon 1/2. Then there is no  around x \n 0, i.e. no open interval (-\\delta,\\;\\delta) with \\delta > 0, that will force all the H(x) values to be within the  of H(0), i.e. within (1/2,\\;3/2). Intuitively we can think of this type of discontinuity as a sudden jump in function values.\n\nSimilarly, the signum or sign function\n\n\\sgn(x) = \\begin{cases}\n\\;\\;\\ 1 & \\text{ if }x > 0\\\\\n\\;\\;\\ 0 & \\text{ if }x = 0\\\\\n-1 & \\text{ if }x \nis discontinuous at x = 0 but continuous everywhere else. Yet another example: the function\nf(x)=\\begin{cases}\n  \\sin\\left(x^{-2}\\right)&\\text{ if }x \\ne 0\\\\\n   0&\\text{ if }x = 0\n\\end{cases}\nis continuous everywhere apart from x = 0.\n\nBesides plausible continuities and discontinuities like above, there are also functions with a behavior, often coined pathological, for example, Thomae's function,\nf(x)=\\begin{cases}\n1   &\\text{ if }x=0\\\\\n\\frac{1}{q}&\\text{ if }x=\\frac{p}{q}\\text{(in lowest terms) is a rational number}\\\\\n  0&\\text{ if }x\\text{ is irrational}.\n\\end{cases}\nis continuous at all irrational numbers and discontinuous at all rational numbers. In a similar vein, Dirichlet's function, the indicator function for the set of rational numbers,\nD(x)=\\begin{cases}\n  0&\\text{ if }x\\text{  is irrational } (\\in \\mathbb{R} \\smallsetminus \\mathbb{Q})\\\\\n  1&\\text{ if }x\\text{ is rational } (\\in \\mathbb{Q})\n\\end{cases}\nis nowhere continuous.\n\nProperties\n\nIntermediate value theorem\n\nThe intermediate value theorem is an existence theorem, based on the real number property of completeness, and states:\n\nIf the real-valued function f is continuous on the closed interval [a, b] and k is some number between f(a) and f(b), then there is some number c in [a, b] such that f(c) = k.\n\nFor example, if a child grows from 1 m to 1.5 m between the ages of two and six years, then, at some time between two and six years of age, the child's height must have been 1.25 m.\n\nAs a consequence, if f is continuous on [a, b] and f(a) and f(b) differ in sign, then, at some point c in [a, b], f(c) must equal zero.\n\nExtreme value theorem\n\nThe extreme value theorem states that if a function f is defined on a closed interval [a,b] (or any closed and bounded set) and is continuous there, then the function attains its maximum, i.e. there exists c ∈ [a,b] with f(c) ≥ f(x) for all x ∈ [a,b]. The same is true of the minimum of f. These statements are not, in general, true if the function is defined on an open interval (a,b) (or any set that is not both closed and bounded), as, for example, the continuous function f(x) = 1/x, defined on the open interval (0,1), does not attain a maximum, being unbounded above.\n\nRelation to differentiability and integrability\n\nEvery differentiable function\nf\\colon (a, b) \\rightarrow \\mathbf R\nis continuous, as can be shown. The converse  does not hold: for example, the absolute value function\nf(x)|x| \n \\begin{cases}\n  \\;\\;\\ x & \\text{ if }x \\geq 0\\\\\n  -x & \\text{ if }x \nis everywhere continuous. However, it is not differentiable at x = 0 (but is so everywhere else). Weierstrass's function is also everywhere continuous but nowhere differentiable.\n\nThe derivative f′(x) of a differentiable function f(x) need not be continuous. If f′(x) is continuous, f(x) is said to be continuously differentiable. The set of such functions is denoted C1(). More generally, the set of functions\nf\\colon \\Omega \\rightarrow \\mathbf R\n(from an open interval (or open subset of R) Ω to the reals) such that f is n times differentiable and such that the n-th derivative of f is continuous is denoted Cn(Ω). See differentiability class. In the field of computer graphics, these three levels are sometimes called G0 (continuity of position), G1 (continuity of tangency), and G2 (continuity of curvature).\n\nEvery continuous function\nf\\colon [a, b] \\rightarrow \\mathbf R\nis integrable (for example in the sense of the Riemann integral). The converse does not hold, as the (integrable, but discontinuous) sign function shows.\n\nPointwise and uniform limits\n\nGiven a sequence\nf_1, f_2, \\dotsc \\colon I \\rightarrow \\mathbf R\nof functions such that the limit\nf(x) := \\lim_{n \\rightarrow \\infty} f_n(x)\nexists for all x in D, the resulting function f(x) is referred to as the pointwise limit of the sequence of functions (fn)n∈N. The pointwise limit function need not be continuous, even if all functions fn are continuous, as the animation at the right shows. However, f is continuous when the sequence converges uniformly, by the uniform convergence theorem. This theorem can be used to show that the exponential functions, logarithms, square root function, trigonometric functions are continuous.\n\nDirectional and semi-continuity\n\nImage:Right-continuous.svg|A right-continuous function\nImage:Left-continuous.svg|A left-continuous function\nDiscontinuous functions may be discontinuous in a restricted way, giving rise to the concept of directional continuity (or right and left continuous functions) and semi-continuity. Roughly speaking, a function is right-continuous if no jump occurs when the limit point is approached from the right. Formally, f is said to be right-continuous at the point c if the following holds: For any number ε > 0 however small, there exists some number δ > 0 such that for all x in the domain with , the value of f(x) will satisfy\n\n |f(x) - f(c)| \n\nThis is the same condition as for continuous functions, except that it is required to hold for x strictly larger than c only. Requiring it instead for all x with  yields the notion of left-continuous functions. A function is continuous if and only if it is both right-continuous and left-continuous.\n\nA function f is lower semi-continuous if, roughly, any jumps that might occur only go down, but not up. That is, for any ε > 0, there exists some number δ > 0 such that for all x in the domain with , the value of f(x) satisfies\nf(x) \\geq f(c) - \\epsilon.\nThe reverse condition is upper semi-continuity.\n\nContinuous functions between metric spaces\n \n\nThe concept of continuous real-valued functions can be generalized to functions between metric spaces. A metric space is a set X equipped with a function (called metric) dX, that can be thought of as a measurement of the distance of any two elements in X. Formally, the metric is a function\nd_X \\colon X \\times X \\rightarrow \\mathbf R\nthat satisfies a number of requirements, notably the triangle inequality. Given two metric spaces (X, dX) and (Y, dY) and a function\nf\\colon X \\rightarrow Y\nthen f is continuous at the point c in X (with respect to the given metrics) if for any positive real number ε, there exists a positive real number δ such that all x in X satisfying dX(x, c) Y(f(x), f(c)) n) in X with limit lim xn c, we have lim f(xn) \n f(c). The latter condition can be weakened as follows: f is continuous at the point c if and only if for every convergent sequence (xn) in X with limit c, the sequence (f(xn)) is a Cauchy sequence, and c is in the domain of f.\n\nThe set of points at which a function between metric spaces is continuous is a Gδ set – this follows from the ε-δ definition of continuity.\n\nThis notion of continuity is applied, for example, in functional analysis. A key statement in this area says that a linear operator\nT\\colon V \\rightarrow W\nbetween normed vector spaces V and W (which are vector spaces equipped with a compatible norm, denoted ||x||)\nis continuous if and only if it is bounded, that is, there is a constant K such that\n\\|T(x)\\| \\leq K \\|x\\|\nfor all x in V.\n\nUniform, Hölder and Lipschitz continuity\n\nThe concept of continuity for functions between metric spaces can be strengthened in various ways by limiting the way δ depends on ε and c in the definition above. Intuitively, a function f as above is uniformly continuous if the δ does\nnot depend on the point c. More precisely, it is required that for every real number ε > 0 there exists δ > 0 such that for every c, b ∈ X with dX(b, c) Y(f(b), f(c)) , section IV.10\n\nA function is Hölder continuous with exponent α (a real number) if there is a constant K such that for all b and c in X, the inequality\nd_Y (f(b), f(c)) \\leq K \\cdot (d_X (b, c))^\\alpha\nholds. Any Hölder continuous function is uniformly continuous. The particular case  is referred to as Lipschitz continuity. That is, a function is Lipschitz continuous if there is a constant K such that the inequality\nd_Y (f(b), f(c)) \\leq K \\cdot d_X (b, c)\nholds for any b, c in X., section 9.4 The Lipschitz condition occurs, for example, in the Picard–Lindelöf theorem concerning the solutions of ordinary differential equations.\n\nContinuous functions between topological spaces\n\nAnother, more abstract, notion of continuity is continuity of functions between topological spaces in which there generally is no formal notion of distance, as there is in the case of metric spaces. A topological space is a set X together with a topology on X, which is a set of subsets of X satisfying a few requirements with respect to their unions and intersections that generalize the properties of the open balls in metric spaces while still allowing to talk about the neighbourhoods of a given point. The elements of a topology are called open subsets of X (with respect to the topology).\n\nA function\nf\\colon X \\rightarrow Y\nbetween two topological spaces X and Y is continuous if for every open set V ⊆ Y, the inverse image\nf^{-1}(V) = \\{x \\in X \\; | \\; f(x) \\in V \\}\nis an open subset of X. That is, f is a function between the sets X and Y (not on the elements of the topology TX), but the continuity of f depends on the topologies used on X and Y.\n\nThis is equivalent to the condition that the preimages of the closed sets (which are the complements of the open subsets) in Y are closed in X.\n\nAn extreme example: if a set X is given the discrete topology (in which every subset is open), all functions\nf\\colon X \\rightarrow T\nto any topological space T are continuous. On the other hand, if X is equipped with the indiscrete topology (in which the only open subsets are the empty set and X) and the space T set is at least T0, then the only continuous functions are the constant functions. Conversely, any function whose range is indiscrete is continuous.\n\nContinuity at a point\n\nThe translation in the language of neighborhoods of the (ε, δ)-definition of continuity leads to the following definition of the continuity at a point:\n\nThis definition is equivalent to the same statement with neighborhoods restricted to open neighborhoods and can be restated in several ways by using preimages rather than images.\n\nAlso, as every set that contains a neighborhood is also a neighborhood, and f^{-1}(V) is the largest subset  of  such that , this definition may be simplified into:\n\nAs an open set is a set that is a neighborhood of all its points, a function f:X\\rightarrow Y is continuous at every point of  if and only if it is a continuous function.\n\nIf X and Y are metric spaces, it is equivalent to consider the neighborhood system of open balls centered at x and f(x) instead of all neighborhoods. This gives back the above δ-ε definition of continuity in the context of metric spaces.  In general topological spaces, there is no notion of nearness or distance. If however the target space is a Hausdorff space, it is still true that f is continuous at a if and only if the limit of f as x approaches a is f(a). At an isolated point, every function is continuous.\n\nAlternative definitions\n\nSeveral equivalent definitions for a topological structure exist and thus there are several equivalent ways to define a continuous function.\n\nSequences and nets \n\nIn several contexts, the topology of a space is conveniently  specified in terms of limit points.  In many instances, this is accomplished by specifying when a point is the limit of a sequence, but for some spaces that are too large in some sense, one specifies also when a point is the limit of more general sets of points indexed by a directed set, known as nets.  A function is (Heine-)continuous only if it takes limits of sequences to limits of sequences.  In the former case, preservation of limits is also sufficient; in the latter, a function may preserve all limits of sequences yet still fail to be continuous, and preservation of nets is a necessary and sufficient condition.\n\nIn detail, a function f: X → Y is sequentially continuous if whenever a sequence (xn) in X converges to a limit x, the sequence (f(xn)) converges to f(x).  Thus sequentially continuous functions \"preserve sequential limits\".  Every continuous function is sequentially continuous.  If X is a first-countable space and countable choice holds, then the converse also holds: any function preserving sequential limits is continuous.  In particular, if X is a metric space, sequential continuity and continuity are equivalent.  For non first-countable spaces, sequential continuity might be strictly weaker than continuity. (The spaces for which the two properties are equivalent are called sequential spaces.) This motivates the consideration of nets instead of sequences in general topological spaces.  Continuous functions preserve limits of nets, and in fact this property characterizes continuous functions.\n\nClosure operator definition\n\nInstead of specifying the open subsets of a topological space, the topology can also be determined by a closure operator (denoted cl) which assigns to any subset A ⊆ X its closure, or an interior operator (denoted int), which assigns to any subset A of X its interior. In these terms, a function\nf\\colon (X,\\mathrm{cl}) \\to (X' ,\\mathrm{cl}')\nbetween topological spaces is continuous in the sense above if and only if for all subsets A of X\nf(\\mathrm{cl}(A)) \\subseteq \\mathrm{cl}'(f(A)).\nThat is to say, given any element x of X that is in the closure of any subset A, f(x) belongs to the closure of f(A). This is equivalent to the requirement that for all subsets A' of X'\nf^{-1}(\\mathrm{cl}'(A')) \\supseteq \\mathrm{cl}(f^{-1}(A')).\nMoreover,\nf\\colon (X,\\mathrm{int}) \\to (X' ,\\mathrm{int}') \nis continuous if and only if\nf^{-1}(\\mathrm{int}'(A')) \\subseteq \\mathrm{int}(f^{-1}(A'))\nfor any subset A of Y.\n\nProperties\n\nIf f: X → Y and g: Y → Z are continuous, then so is the composition g ∘ f: X → Z. If f: X → Y is continuous and\n* X is compact, then f(X) is compact.\n* X is connected, then f(X) is connected.\n* X is path-connected, then f(X) is path-connected.\n* X is Lindelöf, then f(X) is Lindelöf.\n* X is separable, then f(X) is separable.\n\nThe possible topologies on a fixed set X are partially ordered: a topology τ1 is said to be coarser than another topology τ2 (notation: τ1 ⊆ τ2) if every open subset with respect to τ1 is also open with respect to τ2. Then, the identity map\nidX: (X, τ2) → (X, τ1)\nis continuous if and only if τ1 ⊆ τ2 (see also comparison of topologies). More generally, a continuous function\n(X, \\tau_X) \\rightarrow (Y, \\tau_Y)\nstays continuous if the topology τY is replaced by a coarser topology and/or τX is replaced by a finer topology.\n\nHomeomorphisms\n\nSymmetric to the concept of a continuous map is an open map, for which images of open sets are open. In fact, if an open map f has an inverse function, that inverse is continuous, and if a continuous map g has an inverse, that inverse is open. Given a bijective function f between two topological spaces, the inverse function f−1 need not be continuous. A bijective continuous function with continuous inverse function is called a homeomorphism.\n\nIf a continuous bijection has as its domain a compact space and its codomain is Hausdorff, then it is a homeomorphism.\n\nDefining topologies via continuous functions\n\nGiven a function\nf\\colon X \\rightarrow S, \nwhere X is a topological space and S is a set (without a specified topology), the final topology on S is defined by letting the open sets of S be those subsets A of S for which f−1(A) is open in X. If S has an existing topology, f is continuous with respect to this topology if and only if the existing topology is coarser than the final topology on S.  Thus the final topology can be characterized as the finest topology on S that makes f continuous.  If f is surjective, this topology is canonically identified with the quotient topology under the equivalence relation defined by f.\n\nDually, for a function f from a set S to a topological space, the initial topology on S has as open subsets A of S those subsets for which f(A) is open in X.  If S has an existing topology, f is continuous with respect to this topology if and only if the existing topology is finer than the initial topology on S.  Thus the initial topology can be characterized as the coarsest topology on S that makes f continuous.  If f is injective, this topology is canonically identified with the subspace topology of S, viewed as a subset of X.\n\nA topology on a set S is uniquely determined by the class of all continuous functions S \\rightarrow X into all topological spaces X. Dually, a similar idea can be applied to maps X \\rightarrow S.\n\nRelated notions\n\nVarious other mathematical domains use the concept of continuity in different, but related meanings. For example, in order theory, an order-preserving function f: X → Y between particular types of partially ordered sets X and Y is continuous if for each directed subset A of X, we have sup(f(A)) = f(sup(A)). Here sup is the supremum with respect to the orderings in X and Y, respectively. This notion of continuity is the same as topological continuity when the partially ordered sets are given the Scott topology.\n\nIn category theory, a functor\nF\\colon \\mathcal C \\rightarrow \\mathcal D\nbetween two categories is called continuous, if it commutes with small limits. That is to say,\n\\varprojlim_{i \\in I} F(C_i) \\cong F \\left(\\varprojlim_{i \\in I} C_i \\right)\nfor any small (i.e., indexed by a set I, as opposed to a class) diagram of objects in \\mathcal C.\n\nA continuity space is a generalization of metric spaces and posets, which uses the concept of quantales, and that can be used to unify the notions of metric spaces and domains.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Continuous function" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6122" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, a continuous function is a function for which sufficiently small changes in the input result in arbitrarily small changes in the output. Otherwise, a function is said to be a discontinuous function. A continuous function with a continuous inverse function is called a homeomorphism.\n\nContinuity of functions is one of the core concepts of topology, which is treated in full generality below. The introductory portion of this article focuses on the special case where the inputs and outputs of functions are real numbers.  A stronger form of continuity is uniform continuity. In addition, this article discusses the definition for the more general case of functions between two metric spaces. In order theory, especially in domain theory, one considers a notion of continuity known as Scott continuity. Other forms of continuity do exist but they are not discussed in this article.\n\nAs an example, consider the function h(t), which describes the height of a growing flower at time t. This function is continuous. By contrast, if M(t) denotes the amount of money in a bank account at time t, then the function jumps at each point in time when money is deposited or withdrawn, so the function M(t) is discontinuous.\n\nHistory\n\nA form of the epsilon–delta definition of continuity was first given by Bernard Bolzano in 1817. Augustin-Louis Cauchy defined continuity of y=f(x) as follows: an infinitely small increment \\alpha of the independent variable x always produces an infinitely small change f(x+\\alpha)-f(x) of the dependent variable y (see e.g., Cours d'Analyse, p. 34). Cauchy defined infinitely small quantities in terms of variable quantities, and his definition of continuity closely parallels the infinitesimal definition used today (see microcontinuity). The formal definition and the distinction between pointwise continuity and uniform continuity were first given by Bolzano in the 1830s but the work wasn't published until the 1930s. Like Bolzano, Karl Weierstrass denied continuity of a function at a point c unless it was defined at and on both sides of c, but Édouard Goursat allowed the function to be defined only at and on one side of c, and Camille Jordan allowed it even if the function was defined only at c. All three of those nonequivalent definitions of pointwise continuity are still in use. Eduard Heine provided the first published definition of uniform continuity in 1872, but based these ideas on lectures given by Peter Gustav Lejeune Dirichlet in 1854.\n\nReal-valued continuous functions\n\nDefinition\n\nA function from the set of real numbers to the real numbers can be represented by a graph in the Cartesian plane; such a function is continuous if, roughly speaking, the graph is a single unbroken curve whose domain is the entire real line.  A more mathematically rigorous definition is given below.\n\nA rigorous definition of continuity of real valued function of a real variable is usually given in a first course in calculus in terms of the idea of a limit. First, a function  with variable  is said to be continuous at the point  on the real line, if the limit of , as  approaches that point , is equal to the value ; and second, the function (as a whole) is said to be continuous, if it is continuous at every point. A function is said to be discontinuous (or to have a discontinuity) at some point when it is not continuous there. These points themselves are also addressed as discontinuities.\n\nThere are several different definitions of continuity of a function.  Sometimes a function is said to be continuous if it is continuous at every point in its domain.  In this case, the function , with the domain of all real ,  any integer, is continuous. Sometimes an exception is made for boundaries of the domain. For example, the graph of the function , with the domain of all non-negative reals, has a left-hand endpoint. In this case only the limit from the right is required to equal the value of the function. Under this definition f is continuous at the boundary  and so for all non-negative arguments. The most common and restrictive definition is that a function is continuous if it is continuous at all real numbers.  In this case, the previous two examples are not continuous, but every polynomial function is continuous, as are the sine, cosine, and exponential functions.  Care should be exercised in using the word continuous, so that it is clear from the context which meaning of the word is intended.\n\nUsing mathematical notation, there are several ways to define continuous functions in each of the three senses mentioned above.\n\nLet\nf\\colon D \\rightarrow \\mathbf R \\quad be a function defined on a subset  D  of the set \\mathbf R of real numbers.\n\nThis subset  D  is the domain of f. Some possible choices include \nD = \\mathbf R \\quad  ( D  is the whole set of real numbers), or, for a and b real numbers,\nD [a, b] \n \\{x \\in \\mathbf R \\,|\\, a \\leq x \\leq b \\} \\quad  ( D  is a closed interval), or\nD (a, b) \n \\{x \\in \\mathbf R \\,|\\, a  ( D  is an open interval).\n\nIn case of the domain D being defined as an open interval, a and b are no boundaries in the above sense and the values of f(a) and f(b) do not matter for continuity on D.\n\nDefinition in terms of limits of functions\n\nThe function f is continuous at some point c of its domain if the limit of f(x), as x approaches c through the domain of f,  exists and is equal to f(c)., section II.4 In mathematical notation, this is written as\n\\lim_{x \\to c}{f(x)} = f(c).\nIn detail this means three conditions: first, f has to be defined at c. Second, the limit on the left hand side of that equation has to exist.  Third, the value of this limit must equal f(c).\n\n(We have here assumed that the domain of f does not have any isolated points.  For example, an interval or union of intervals has no isolated points.)\n\nDefinition in terms of neighborhoods\n\nA neighborhood of a point c is a set that contains all points of the domain within some fixed distance of c.  Intuitively, a function is continuous at a point c if the range of the restriction of f to a neighborhood of c shrinks to a single point f(c) as the width of the neighborhood around c shrinks to zero.  More precisely, a function f is continuous at a point c of its domain if, for any neighborhood N_1(f(c)) there is a neighborhood N_2(c) such that f(x)\\in N_1(f(c)) whenever x\\in N_2(c).\n\nThis definition only requires that the domain and the codomain are topological spaces and is thus the most general definition.  It follows from this definition that a function f is automatically continuous at every isolated point of its domain.  As a specific example, every real valued function on the set of integers is continuous.\n\nDefinition in terms of limits of sequences\n\nOne can instead require that for any sequence (x_n)_{n\\in\\mathbb{N}} of points in the domain which converges to c, the corresponding sequence \\left(f(x_n)\\right)_{n\\in \\mathbb{N}} converges to f(c).  In mathematical notation, \\forall (x_n)_{n\\in\\mathbb{N}} \\subset D:\\lim_{n\\to\\infty} x_nc \\Rightarrow \\lim_{n\\to\\infty} f(x_n)\nf(c)\\,.\n\nWeierstrass and Jordan definitions (epsilon–delta) of continuous functions\n\nExplicitly including the definition of the limit of a function, we obtain a self-contained definition:\nGiven a function  f : D → R as above and an element x0 of the domain D, f is said to be continuous at the point x0 when the following holds: For any number ε > 0, however small, there exists some number δ > 0 such that for all x in the domain of f with x0 − δ 0 + δ, the value of f(x) satisfies\n\n f(x_0) - \\varepsilon \n\nAlternatively written, continuity of f : D → R at x0 ∈ D means that for every ε > 0 there exists a δ > 0 such that for all x ∈ D :\n\n| x - x_0 | \n\nMore intuitively, we can say that if we want to get all the f(x) values to stay in some small neighborhood around f(x0), we simply need to choose a small enough neighborhood for the x values around x0. If we can do that no matter how small the f(x) neighborhood is, then f is continuous at x0.\n\nIn modern terms, this is generalized by the definition of continuity of a function with respect to a basis for the topology, here the metric topology.\n\nWeierstrass had required that the interval x0 − δ 0 + δ be entirely within the domain D, but Jordan removed that restriction.\n\nDefinition in terms of control of the remainder\n\nIn proofs and numerical analysis we often need to know how fast limits are converging, or in other words, control of the remainder. We can formalise this to a definition of continuity. \nA function C: [0,\\infty) \\to [0,\\infty] is called a control function if\n* C is non decreasing\n* \\inf_{\\delta > 0} C(\\delta) = 0\n\nA function f : D → R  is C-continuous at x0 if \n:  | f(x) - f(x_0)| \\le C(|x- x_0|)  for all  x \\in D \n\nA function is continuous in x0 if it is C-continuous for some control function C.\n\nThis approach leads naturally to refining the notion of  continuity by restricting the set of admissible control functions. For a given set of control functions \\mathcal{C} a function is \\mathcal{C}-continuous if it is C-continuous for some  C \\in \\mathcal{C}. For example the Lipschitz and Hölder continuous functions of exponent α  below are defined by the set of control functions \n:\\mathcal{C}_{\\mathrm{Lipschitz}} \\{C |  C(\\delta) \n K|\\delta| ,\\  K > 0\\}  \nrespectively  \n:\\mathcal{C}_{\\text{Hölder}-\\alpha}  \\{C | C(\\delta)  \n K |\\delta|^\\alpha, \\ K > 0\\} .\n\nDefinition using oscillation\n\nContinuity can also be defined in terms of oscillation: a function f is continuous at a point x0 if and only if its oscillation at that point is zero;[http://ramanujan.math.trinity.edu/wtrench/texts/TRENCH_REAL_ANALYSIS.PDF Introduction to Real Analysis], updated April 2010, William F. Trench, Theorem 3.5.2, p. 172 in symbols, \\omega_f(x_0) = 0. A benefit of this definition is that it quantifies discontinuity: the oscillation gives how much the function is discontinuous at a point.\n\nThis definition is useful in descriptive set theory to study the set of discontinuities and continuous points – the continuous points are the intersection of the sets where the oscillation is less than ε (hence a Gδ set) – and gives a very quick proof of one direction of the Lebesgue integrability condition.[http://ramanujan.math.trinity.edu/wtrench/texts/TRENCH_REAL_ANALYSIS.PDF Introduction to Real Analysis], updated April 2010, William F. Trench, 3.5 \"A More Advanced Look at the Existence of the Proper Riemann Integral\", pp. 171–177\n\nThe oscillation is equivalent to the ε-δ definition by a simple re-arrangement, and by using a limit (lim sup, lim inf) to define oscillation: if (at a given point) for a given ε0 there is no δ that satisfies the ε-δ definition, then the oscillation is at least ε0, and conversely if for every ε there is a desired δ, the oscillation is 0. The oscillation definition can be naturally generalized to maps from a topological space to a metric space.\n\nDefinition using the hyperreals\n\nCauchy defined continuity of a function in the following intuitive terms: an infinitesimal change in the independent variable corresponds to an infinitesimal change of the dependent variable (see Cours d'analyse, page 34). Non-standard analysis is a way of making this mathematically rigorous. The real line is augmented by the addition of infinite and infinitesimal numbers to form the hyperreal numbers.  In nonstandard analysis, continuity can be defined as follows.\n\nA real-valued function f is continuous at x if its natural extension to the hyperreals has the property that for all infinitesimal dx,  is infinitesimal\n\n(see microcontinuity).  In other words, an infinitesimal increment of the independent variable always produces to an infinitesimal change of the dependent variable, giving a modern expression to Augustin-Louis Cauchy's definition of continuity.\n\nConstruction of continuous functions\n\nChecking the continuity of a given function can be simplified by checking one of the above defining properties for the building blocks of the given function. It is straightforward to show that the sum of two functions, continuous on some domain, is also continuous on this domain. Given\nf, g\\colon D \\rightarrow \\mathbf R,\n\nthen the sum of continuous functions\ns f + g, defined  by s(x) \n f(x) + g(x) for all x\\in D\n\nis continuous in D.\n\nThe same holds for the product of continuous functions.\np f \\cdot g, defined by p(x) \n f(x) \\cdot g(x) for all x \\in D,\n\nis continuous in D.\n\nCombining the above preservations of continuity and the continuity of constant functions and of the identity function I(x) = x  one arrives at the continuity of all polynomial functions   such as\n(pictured, above).\n\nIn the same way it can be shown that the reciprocal of a continuous function \nr 1/f, defined by r(x) \n 1/f(x) for all x \\in D such that f(x) \\ne 0,\n\nis continuous in D\\smallsetminus \\{x:f(x) = 0\\}.\n\nThis implies that, excluding the roots of g, the quotient of continuous functions \nq f/g, defined by g(x) \n f(x)/g(x) for all x \\in D, such that g(x) \\ne 0,\n\nis also continuous on D\\smallsetminus \\{x:g(x) = 0\\}.\n\nFor example, the function (pictured)\ny(x) = \\frac {2x-1} {x+2}\n\nis defined for all real numbers  and is continuous at every such point. Thus it is a continuous function. The question of continuity at  does not arise, since   is not in the domain of y. There is no continuous function F: R → R that agrees with y(x) for all .\n\nSince the sine-function is continuous on all reals, the sinc function G(x) = sin x/x, when defined for all real x ≠ 0, is continuous at these points. Thus G is a continuous function there, too. However, unlike the previous example, G can be extended to a continuous function on all real numbers, by defining the value G(0) to be the limit of G(x), when x approaches 0, i.e.,\nG(0) \\lim_{x\\rightarrow 0}\\frac{\\sin x}{x} \n 1\n\nand thus\n\nG(x) = \n\\begin{cases}\n\\frac {\\sin (x)}x & \\text{ if }x \\ne 0\\\\\n1 & \\text{ if }x = 0,\n\\end{cases}\n\nthe sinc-function becomes a continuous function on all real numbers. The term removable singularity is used in such cases, when (re)defining values of a function to coincide with the appropriate limits make a function continuous at specific points.\n\nA more involved construction of continuous functions is the function composition. Given two continuous functions\nf\\colon D_f \\;(\\subseteq \\mathbf R) \\rightarrow R_f\\; (\\subseteq \\mathbf R)\\quad and \\quad g\\colon D_g\\; (R_f \\subseteq D_g) \\rightarrow R_g \\;(\\subseteq \\mathbf R),\ntheir composition being denoted as\nc g \\circ f \\colon D_f \\rightarrow \\mathbf R, and defined by c(x) \n g(f(x)), is continuous.\n\nThis construction allows to state, for example, that\ne^{\\sin(\\ln x)} is continuous for all x > 0.\n\nExamples of discontinuous functions\n\nAn example of a discontinuous function is the Heaviside step function H, defined by\n\nH(x) = \\begin{cases}\n1 & \\text{ if } x \\ge 0\\\\\n0 & \\text{ if } x \n\nPick for instance \\varepsilon 1/2. Then there is no  around x \n 0, i.e. no open interval (-\\delta,\\;\\delta) with \\delta > 0, that will force all the H(x) values to be within the  of H(0), i.e. within (1/2,\\;3/2). Intuitively we can think of this type of discontinuity as a sudden jump in function values.\n\nSimilarly, the signum or sign function\n\n\\sgn(x) = \\begin{cases}\n\\;\\;\\ 1 & \\text{ if }x > 0\\\\\n\\;\\;\\ 0 & \\text{ if }x = 0\\\\\n-1 & \\text{ if }x \nis discontinuous at x = 0 but continuous everywhere else. Yet another example: the function\nf(x)=\\begin{cases}\n  \\sin\\left(x^{-2}\\right)&\\text{ if }x \\ne 0\\\\\n   0&\\text{ if }x = 0\n\\end{cases}\nis continuous everywhere apart from x = 0.\n\nBesides plausible continuities and discontinuities like above, there are also functions with a behavior, often coined pathological, for example, Thomae's function,\nf(x)=\\begin{cases}\n1   &\\text{ if }x=0\\\\\n\\frac{1}{q}&\\text{ if }x=\\frac{p}{q}\\text{(in lowest terms) is a rational number}\\\\\n  0&\\text{ if }x\\text{ is irrational}.\n\\end{cases}\nis continuous at all irrational numbers and discontinuous at all rational numbers. In a similar vein, Dirichlet's function, the indicator function for the set of rational numbers,\nD(x)=\\begin{cases}\n  0&\\text{ if }x\\text{  is irrational } (\\in \\mathbb{R} \\smallsetminus \\mathbb{Q})\\\\\n  1&\\text{ if }x\\text{ is rational } (\\in \\mathbb{Q})\n\\end{cases}\nis nowhere continuous.\n\nProperties\n\nIntermediate value theorem\n\nThe intermediate value theorem is an existence theorem, based on the real number property of completeness, and states:\n\nIf the real-valued function f is continuous on the closed interval [a, b] and k is some number between f(a) and f(b), then there is some number c in [a, b] such that f(c) = k.\n\nFor example, if a child grows from 1 m to 1.5 m between the ages of two and six years, then, at some time between two and six years of age, the child's height must have been 1.25 m.\n\nAs a consequence, if f is continuous on [a, b] and f(a) and f(b) differ in sign, then, at some point c in [a, b], f(c) must equal zero.\n\nExtreme value theorem\n\nThe extreme value theorem states that if a function f is defined on a closed interval [a,b] (or any closed and bounded set) and is continuous there, then the function attains its maximum, i.e. there exists c ∈ [a,b] with f(c) ≥ f(x) for all x ∈ [a,b]. The same is true of the minimum of f. These statements are not, in general, true if the function is defined on an open interval (a,b) (or any set that is not both closed and bounded), as, for example, the continuous function f(x) = 1/x, defined on the open interval (0,1), does not attain a maximum, being unbounded above.\n\nRelation to differentiability and integrability\n\nEvery differentiable function\nf\\colon (a, b) \\rightarrow \\mathbf R\nis continuous, as can be shown. The converse  does not hold: for example, the absolute value function\nf(x)|x| \n \\begin{cases}\n  \\;\\;\\ x & \\text{ if }x \\geq 0\\\\\n  -x & \\text{ if }x \nis everywhere continuous. However, it is not differentiable at x = 0 (but is so everywhere else). Weierstrass's function is also everywhere continuous but nowhere differentiable.\n\nThe derivative f′(x) of a differentiable function f(x) need not be continuous. If f′(x) is continuous, f(x) is said to be continuously differentiable. The set of such functions is denoted C1(). More generally, the set of functions\nf\\colon \\Omega \\rightarrow \\mathbf R\n(from an open interval (or open subset of R) Ω to the reals) such that f is n times differentiable and such that the n-th derivative of f is continuous is denoted Cn(Ω). See differentiability class. In the field of computer graphics, these three levels are sometimes called G0 (continuity of position), G1 (continuity of tangency), and G2 (continuity of curvature).\n\nEvery continuous function\nf\\colon [a, b] \\rightarrow \\mathbf R\nis integrable (for example in the sense of the Riemann integral). The converse does not hold, as the (integrable, but discontinuous) sign function shows.\n\nPointwise and uniform limits\n\nGiven a sequence\nf_1, f_2, \\dotsc \\colon I \\rightarrow \\mathbf R\nof functions such that the limit\nf(x) := \\lim_{n \\rightarrow \\infty} f_n(x)\nexists for all x in D, the resulting function f(x) is referred to as the pointwise limit of the sequence of functions (fn)n∈N. The pointwise limit function need not be continuous, even if all functions fn are continuous, as the animation at the right shows. However, f is continuous when the sequence converges uniformly, by the uniform convergence theorem. This theorem can be used to show that the exponential functions, logarithms, square root function, trigonometric functions are continuous.\n\nDirectional and semi-continuity\n\nImage:Right-continuous.svg|A right-continuous function\nImage:Left-continuous.svg|A left-continuous function\nDiscontinuous functions may be discontinuous in a restricted way, giving rise to the concept of directional continuity (or right and left continuous functions) and semi-continuity. Roughly speaking, a function is right-continuous if no jump occurs when the limit point is approached from the right. Formally, f is said to be right-continuous at the point c if the following holds: For any number ε > 0 however small, there exists some number δ > 0 such that for all x in the domain with , the value of f(x) will satisfy\n\n |f(x) - f(c)| \n\nThis is the same condition as for continuous functions, except that it is required to hold for x strictly larger than c only. Requiring it instead for all x with  yields the notion of left-continuous functions. A function is continuous if and only if it is both right-continuous and left-continuous.\n\nA function f is lower semi-continuous if, roughly, any jumps that might occur only go down, but not up. That is, for any ε > 0, there exists some number δ > 0 such that for all x in the domain with , the value of f(x) satisfies\nf(x) \\geq f(c) - \\epsilon.\nThe reverse condition is upper semi-continuity.\n\nContinuous functions between metric spaces\n \n\nThe concept of continuous real-valued functions can be generalized to functions between metric spaces. A metric space is a set X equipped with a function (called metric) dX, that can be thought of as a measurement of the distance of any two elements in X. Formally, the metric is a function\nd_X \\colon X \\times X \\rightarrow \\mathbf R\nthat satisfies a number of requirements, notably the triangle inequality. Given two metric spaces (X, dX) and (Y, dY) and a function\nf\\colon X \\rightarrow Y\nthen f is continuous at the point c in X (with respect to the given metrics) if for any positive real number ε, there exists a positive real number δ such that all x in X satisfying dX(x, c) Y(f(x), f(c)) n) in X with limit lim xn c, we have lim f(xn) \n f(c). The latter condition can be weakened as follows: f is continuous at the point c if and only if for every convergent sequence (xn) in X with limit c, the sequence (f(xn)) is a Cauchy sequence, and c is in the domain of f.\n\nThe set of points at which a function between metric spaces is continuous is a Gδ set – this follows from the ε-δ definition of continuity.\n\nThis notion of continuity is applied, for example, in functional analysis. A key statement in this area says that a linear operator\nT\\colon V \\rightarrow W\nbetween normed vector spaces V and W (which are vector spaces equipped with a compatible norm, denoted ||x||)\nis continuous if and only if it is bounded, that is, there is a constant K such that\n\\|T(x)\\| \\leq K \\|x\\|\nfor all x in V.\n\nUniform, Hölder and Lipschitz continuity\n\nThe concept of continuity for functions between metric spaces can be strengthened in various ways by limiting the way δ depends on ε and c in the definition above. Intuitively, a function f as above is uniformly continuous if the δ does\nnot depend on the point c. More precisely, it is required that for every real number ε > 0 there exists δ > 0 such that for every c, b ∈ X with dX(b, c) Y(f(b), f(c)) , section IV.10\n\nA function is Hölder continuous with exponent α (a real number) if there is a constant K such that for all b and c in X, the inequality\nd_Y (f(b), f(c)) \\leq K \\cdot (d_X (b, c))^\\alpha\nholds. Any Hölder continuous function is uniformly continuous. The particular case  is referred to as Lipschitz continuity. That is, a function is Lipschitz continuous if there is a constant K such that the inequality\nd_Y (f(b), f(c)) \\leq K \\cdot d_X (b, c)\nholds for any b, c in X., section 9.4 The Lipschitz condition occurs, for example, in the Picard–Lindelöf theorem concerning the solutions of ordinary differential equations.\n\nContinuous functions between topological spaces\n\nAnother, more abstract, notion of continuity is continuity of functions between topological spaces in which there generally is no formal notion of distance, as there is in the case of metric spaces. A topological space is a set X together with a topology on X, which is a set of subsets of X satisfying a few requirements with respect to their unions and intersections that generalize the properties of the open balls in metric spaces while still allowing to talk about the neighbourhoods of a given point. The elements of a topology are called open subsets of X (with respect to the topology).\n\nA function\nf\\colon X \\rightarrow Y\nbetween two topological spaces X and Y is continuous if for every open set V ⊆ Y, the inverse image\nf^{-1}(V) = \\{x \\in X \\; | \\; f(x) \\in V \\}\nis an open subset of X. That is, f is a function between the sets X and Y (not on the elements of the topology TX), but the continuity of f depends on the topologies used on X and Y.\n\nThis is equivalent to the condition that the preimages of the closed sets (which are the complements of the open subsets) in Y are closed in X.\n\nAn extreme example: if a set X is given the discrete topology (in which every subset is open), all functions\nf\\colon X \\rightarrow T\nto any topological space T are continuous. On the other hand, if X is equipped with the indiscrete topology (in which the only open subsets are the empty set and X) and the space T set is at least T0, then the only continuous functions are the constant functions. Conversely, any function whose range is indiscrete is continuous.\n\nContinuity at a point\n\nThe translation in the language of neighborhoods of the (ε, δ)-definition of continuity leads to the following definition of the continuity at a point:\n\nThis definition is equivalent to the same statement with neighborhoods restricted to open neighborhoods and can be restated in several ways by using preimages rather than images.\n\nAlso, as every set that contains a neighborhood is also a neighborhood, and f^{-1}(V) is the largest subset  of  such that , this definition may be simplified into:\n\nAs an open set is a set that is a neighborhood of all its points, a function f:X\\rightarrow Y is continuous at every point of  if and only if it is a continuous function.\n\nIf X and Y are metric spaces, it is equivalent to consider the neighborhood system of open balls centered at x and f(x) instead of all neighborhoods. This gives back the above δ-ε definition of continuity in the context of metric spaces.  In general topological spaces, there is no notion of nearness or distance. If however the target space is a Hausdorff space, it is still true that f is continuous at a if and only if the limit of f as x approaches a is f(a). At an isolated point, every function is continuous.\n\nAlternative definitions\n\nSeveral equivalent definitions for a topological structure exist and thus there are several equivalent ways to define a continuous function.\n\nSequences and nets \n\nIn several contexts, the topology of a space is conveniently  specified in terms of limit points.  In many instances, this is accomplished by specifying when a point is the limit of a sequence, but for some spaces that are too large in some sense, one specifies also when a point is the limit of more general sets of points indexed by a directed set, known as nets.  A function is (Heine-)continuous only if it takes limits of sequences to limits of sequences.  In the former case, preservation of limits is also sufficient; in the latter, a function may preserve all limits of sequences yet still fail to be continuous, and preservation of nets is a necessary and sufficient condition.\n\nIn detail, a function f: X → Y is sequentially continuous if whenever a sequence (xn) in X converges to a limit x, the sequence (f(xn)) converges to f(x).  Thus sequentially continuous functions \"preserve sequential limits\".  Every continuous function is sequentially continuous.  If X is a first-countable space and countable choice holds, then the converse also holds: any function preserving sequential limits is continuous.  In particular, if X is a metric space, sequential continuity and continuity are equivalent.  For non first-countable spaces, sequential continuity might be strictly weaker than continuity. (The spaces for which the two properties are equivalent are called sequential spaces.) This motivates the consideration of nets instead of sequences in general topological spaces.  Continuous functions preserve limits of nets, and in fact this property characterizes continuous functions.\n\nClosure operator definition\n\nInstead of specifying the open subsets of a topological space, the topology can also be determined by a closure operator (denoted cl) which assigns to any subset A ⊆ X its closure, or an interior operator (denoted int), which assigns to any subset A of X its interior. In these terms, a function\nf\\colon (X,\\mathrm{cl}) \\to (X' ,\\mathrm{cl}')\nbetween topological spaces is continuous in the sense above if and only if for all subsets A of X\nf(\\mathrm{cl}(A)) \\subseteq \\mathrm{cl}'(f(A)).\nThat is to say, given any element x of X that is in the closure of any subset A, f(x) belongs to the closure of f(A). This is equivalent to the requirement that for all subsets A' of X'\nf^{-1}(\\mathrm{cl}'(A')) \\supseteq \\mathrm{cl}(f^{-1}(A')).\nMoreover,\nf\\colon (X,\\mathrm{int}) \\to (X' ,\\mathrm{int}') \nis continuous if and only if\nf^{-1}(\\mathrm{int}'(A')) \\subseteq \\mathrm{int}(f^{-1}(A'))\nfor any subset A of Y.\n\nProperties\n\nIf f: X → Y and g: Y → Z are continuous, then so is the composition g ∘ f: X → Z. If f: X → Y is continuous and\n* X is compact, then f(X) is compact.\n* X is connected, then f(X) is connected.\n* X is path-connected, then f(X) is path-connected.\n* X is Lindelöf, then f(X) is Lindelöf.\n* X is separable, then f(X) is separable.\n\nThe possible topologies on a fixed set X are partially ordered: a topology τ1 is said to be coarser than another topology τ2 (notation: τ1 ⊆ τ2) if every open subset with respect to τ1 is also open with respect to τ2. Then, the identity map\nidX: (X, τ2) → (X, τ1)\nis continuous if and only if τ1 ⊆ τ2 (see also comparison of topologies). More generally, a continuous function\n(X, \\tau_X) \\rightarrow (Y, \\tau_Y)\nstays continuous if the topology τY is replaced by a coarser topology and/or τX is replaced by a finer topology.\n\nHomeomorphisms\n\nSymmetric to the concept of a continuous map is an open map, for which images of open sets are open. In fact, if an open map f has an inverse function, that inverse is continuous, and if a continuous map g has an inverse, that inverse is open. Given a bijective function f between two topological spaces, the inverse function f−1 need not be continuous. A bijective continuous function with continuous inverse function is called a homeomorphism.\n\nIf a continuous bijection has as its domain a compact space and its codomain is Hausdorff, then it is a homeomorphism.\n\nDefining topologies via continuous functions\n\nGiven a function\nf\\colon X \\rightarrow S, \nwhere X is a topological space and S is a set (without a specified topology), the final topology on S is defined by letting the open sets of S be those subsets A of S for which f−1(A) is open in X. If S has an existing topology, f is continuous with respect to this topology if and only if the existing topology is coarser than the final topology on S.  Thus the final topology can be characterized as the finest topology on S that makes f continuous.  If f is surjective, this topology is canonically identified with the quotient topology under the equivalence relation defined by f.\n\nDually, for a function f from a set S to a topological space, the initial topology on S has as open subsets A of S those subsets for which f(A) is open in X.  If S has an existing topology, f is continuous with respect to this topology if and only if the existing topology is finer than the initial topology on S.  Thus the initial topology can be characterized as the coarsest topology on S that makes f continuous.  If f is injective, this topology is canonically identified with the subspace topology of S, viewed as a subset of X.\n\nA topology on a set S is uniquely determined by the class of all continuous functions S \\rightarrow X into all topological spaces X. Dually, a similar idea can be applied to maps X \\rightarrow S.\n\nRelated notions\n\nVarious other mathematical domains use the concept of continuity in different, but related meanings. For example, in order theory, an order-preserving function f: X → Y between particular types of partially ordered sets X and Y is continuous if for each directed subset A of X, we have sup(f(A)) = f(sup(A)). Here sup is the supremum with respect to the orderings in X and Y, respectively. This notion of continuity is the same as topological continuity when the partially ordered sets are given the Scott topology.\n\nIn category theory, a functor\nF\\colon \\mathcal C \\rightarrow \\mathcal D\nbetween two categories is called continuous, if it commutes with small limits. That is to say,\n\\varprojlim_{i \\in I} F(C_i) \\cong F \\left(\\varprojlim_{i \\in I} C_i \\right)\nfor any small (i.e., indexed by a set I, as opposed to a class) diagram of objects in \\mathcal C.\n\nA continuity space is a generalization of metric spaces and posets, which uses the concept of quantales, and that can be used to unify the notions of metric spaces and domains. Continuous function. http://en.wikipedia.org/?curid=6122."
  }
}
