{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12628",
  "eid" : "03c8d5b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778515595,
  "textBody" : "GIMP ( ) (GNU Image Manipulation Program) is a free and open-source raster graphics editor used for image retouching and editing, free-form drawing, converting between different image formats, and more specialized tasks.\n\nGIMP is released under GPLv3+ licenses and is available for Linux, macOS, and Microsoft Windows.\n\nHistory \n\nGIMP was originally released as the General Image Manipulation Program.  In 1995 Spencer Kimball and Peter Mattis began developing GIMP as a semester-long project at the University of California, Berkeley for the eXperimental Computing Facility. In 1996 GIMP (0.54) was released as the first publicly available release. In the following year Richard Stallman visited UC Berkeley where Spencer Kimball and Peter Mattis asked if they could change General to GNU (the name given to the operating system created by Stallman). Richard Stallman approved and the definition of the acronym GIMP was changed to be the GNU Image Manipulation Program.  This reflected its new existence as being developed as Free Software as a part of the GNU Project.\n\nThe number of computer architectures and operating systems supported has expanded significantly since its first release. The first release supported UNIX systems, such as Linux, SGI IRIX and HP-UX. Since the initial release, GIMP has been ported to many operating systems, including Microsoft Windows and macOS; the original port to the Windows 32-bit platform was started by Finnish programmer Tor M. Lillqvist (tml) in 1997 and was supported in the GIMP 1.1 release.\n\nFollowing the first release GIMP was quickly adopted and a community of contributors formed. The community began developing tutorials, artwork and shared better work-flows and techniques.\n\nA GUI toolkit called GTK (GIMP tool kit) was developed to facilitate the development of GIMP. GTK was replaced by its successor GTK+ after being redesigned using object-oriented programming techniques. The development of GTK+ has been attributed to Peter Mattis becoming disenchanted with the Motif toolkit GIMP originally used; Motif was used up until GIMP 0.60.\n\nDevelopment \n\nGIMP is primarily developed by volunteers as a free software project associated to both the GNU and GNOME Projects. Development takes place in a public git source code repository, on public mailing lists and in public chat channels on the GIMPNET IRC network.\n\nNew features are held in public separate source code branches and merged into the main (or development) branch when the GIMP team is sure they won't damage existing functions. Sometimes this means that features that appear complete do not get merged or take months or years before they become available in GIMP.\n\nGIMP itself is released as source code. After a source code release installers and packages are made for different operating systems by parties who might not be in contact with the maintainers of GIMP.\n\nThe version number used in GIMP is expressed in a major-minor-micro format, with each number carrying a specific meaning: the first (major) number is incremented only for major developments (and is currently 2). The second (minor) number is incremented with each release of new features, with odd numbers reserved for in-progress development versions and even numbers assigned to stable releases; the third (micro) number is incremented before and after each release (resulting in even numbers for releases, and odd numbers for development snapshots) with any bug fixes subsequently applied and released for a stable version.\n\nEach year GIMP applies for several positions in the Google Summer of Code (GSoC); to date GIMP has participated in all years except 2007. From 2006 to 2009 there have been nine GSoC projects that have been listed as successful, although not all successful projects have been merged into GIMP immediately. The healing brush and perspective clone tools and Ruby bindings were created as part of the 2006 GSoC and can be used in version 2.8.0 of GIMP, although there were three other projects that were completed and are later available in a stable version of GIMP; those projects being Vector Layers (end 2008 in 2.8 and master),https://git.gnome.org/browse/gimp/commit/?id39af762f615a6a86a82f154638bfca133592e140 and a JPEG 2000 plug-in (mid 2009 in 2.8 and master).https://git.gnome.org/browse/gimp/commit/?id\n6e581ca990326ca083986ae209443612439b3e51 \nSeveral of the GSoC projects were completed in 2008, but have been merged into a stable GIMP release later in 2009 to 2014 for Version 2.8.xx and 2.9.x. Some of them needed some more code work for the master tree. \n\nSecond public Development 2.9-Version was 2.9.4 with many deep improvements after initial Public Version 2.9.2 https://www.gimp.org/news/2015/11/27/gimp-2-9-2-released/https://www.gimp.org/news/2016/07/13/gimp-2-9-4-released/ Third Public 2.9-Development version is Version 2.9.6.https://www.gimp.org/news/2017/08/24/gimp-2-9-6-released/ One of the new features is removing the 4GB size limit of XCF file.http://www.phoronix.com/scan.php?pagenews_item&px\nGIMP-2.9.6-Featureshttps://git.gnome.org/browse/gimp/commit/?id=226fb033859e64b2e6bea67df50ee76de53370a7 \nIncrease of possible threads to 64 is also an important point for modern parallel execution in actual AMD Ryzen and Intel Xeon processors. Actual Version is 2.9.8 with many bugfixes and improvements in gradients and clips.https://www.gimp.org/news/2017/12/12/gimp-2-9-8-released/\n\nNext stable versions in roadmap are 2.10 with full GEGL and 3.0 with GTK3-Port.http://wiki.gimp.org/index.php/Roadmap\n\nUser interface \n\nThe user interface of GIMP is designed by a dedicated design and usability team. This team was formed after the developers of GIMP signed up to join the OpenUsability project. A user interface brainstorming group has since been created for GIMP, where users of GIMP can send in their suggestions as to how they think the GIMP user interface could be improved.\n\nGIMP is presented in two forms, single and multiple window mode; GIMP 2.8 defaults to the multiple window mode.  In multiple window mode a set of windows contain all GIMPs functionality. By default, tools and tool settings are on the left and other dialogues are on the right. A layers tab is often to the right of the tools tab, and allows a user to work individually on separate image layers. Layers can be edited by right-clicking on a particular layer to bring up edit options for that layer. The tools tab and layers tab are the most common dockable tabs.\n\nGTK+ (GIMP tool kit) is used to create the graphical user interface. GTK+'s creation and history regarding GIMP is described in the history section above.\n\nLibre Graphics Meetings \n\nThe Libre Graphics Meeting (LGM) is a yearly event where developers of GIMP and other projects meet up to discuss issues related to free and open source graphics software. The GIMP developers hold birds of a feather (BOF) sessions at this event.\n\nDistribution \n\nThe current version of GIMP works with numerous operating systems, including Linux, macOS and Microsoft Windows. Many Linux distributions include GIMP as a part of their desktop operating systems, including Fedora and Debian.\n\nThe GIMP website links to binary installers compiled by Jernej Simončič for the platform. MacPorts was listed as the recommended provider of Mac builds of GIMP, but this is no longer needed as version 2.8.2 and later run natively on macOS. GTK+ was originally designed to run on an X11 server.  Because macOS can optionally use an X11 server, porting GIMP to macOS is simpler compared to creating a Windows port.  GIMP is also available as part of the Ubuntu noroot package from the Google Play Store on Android. In November 2013, GIMP removed its download from SourceForge, citing misleading download buttons that potentially confuse customers, as well as SourceForge's own Windows installer, which bundles potentially unwanted programs. In a statement, GIMP called SourceForge a once \"useful and trustworthy place to develop and host FLOSS applications\" that now faces \"a problem with the ads they allow on their sites ...\"\n\nSourceforge controversy \n\nGIMP, who discontinued their use of SourceForge as a download mirror in November 2013,https://web.archive.org/web/20150529094757/https://sourceforge.net/blog/gimp-win-project-wasnt-hijacked-just-abandoned/ reported in May 2015 that SourceForge was hosting infected versions of their Windows binaries on their Open Source Mirror directory.https://mail.gnome.org/archives/gimp-developer-list/2015-May/msg00144.htmlhttps://arstechnica.com/information-technology/2015/05/sourceforge-grabs-gimp-for-windows-account-wraps-installer-in-bundle-pushing-adware/\n\nProfessional reviews \n\nGIMP's fitness for use in professional environments is regularly reviewed; it is often compared to and suggested as a possible replacement for Adobe Photoshop. GIMP has similar functionality to Photoshop, but has a different user interface.\n\nGIMP 2.6 was used to create nearly all of the art in Lucas the Game, an independent video game by developer Timothy Courtney. Courtney started development of Lucas the Game in early 2014, and the video game was published in July 2015 for PC and Mac. Courtney explains GIMP is a powerful tool, fully capable of large professional projects, such as video games. This is the first case of GIMP having played a major role in the production of a published video game.\n\nThe single-window mode introduced in GIMP 2.8 was reviewed in 2012 by Ryan Paul of Ars Technica, who noted that it made the user experience feel \"more streamlined and less cluttered.\" Michael Burns, writing for Macworld in 2014, described the single-window interface of GIMP 2.8.10 as a \"big improvement\".\n\nIn his review of GIMP for ExtremeTech in October 2013, David Cardinal noted that GIMP's reputation of being hard to use and lacking features has \"changed dramatically over the last couple years\", and that it was \"no longer a crippled alternative to Photoshop\". He described GIMP's scripting as one of its strengths, but also remarked that some of Photoshop's features - such as Text, 3D commands, Adjustment Layers and History - are either less powerful or missing in GIMP. Cardinal favorably described the UFRaw converter for raw images used with GIMP, noting that it still \"requires some patience to figure out how to use those more advanced capabilities\". Cardinal stated that GIMP is \"easy enough to try\" despite not having as well developed documentation and help system as those for Photoshop, concluding that it \"has become a worthy alternative to Photoshop for anyone on a budget who doesn’t need all of Photoshop’s vast feature set\".\n\nA 2016 comparison recommended GIMP for use with Linux, for its low (no) cost, for occasional use, and Photoshop for professional users such as photographers and designers, and for some things that GIMP cannot do. The author commented \"GIMP has improved a lot in the last few years, going from unbearably ugly to bearably ugly — but what’s indisputable is that Photoshop is much easier to learn thanks to the countless awesome tutorials available online.\n\nMascot \n\nWilber is the official GIMP mascot. Wilber has relevance outside of GIMP as a racer in SuperTuxKart and was displayed on the Bibliothèque nationale de France (National Library of France) as part of Project Blinkenlights. on the Bibliothèque nationale de France\n\nWilber was created at some time before 25 September 1997 by Tuomas Kuosmanen (tigert) and has since received additional accessories and a construction kit to ease the process.[http://www.gimp.org/about/linking.html GIMP — linking to us]. For Wilber kit see /docs/Wilber_Construction_Kit.xcf.gz\n\nFeatures \n\nTools used to perform image editing can be accessed via the toolbox, through menus and dialogue windows. They include filters and brushes, as well as transformation, selection, layer and masking tools.\n\n;Color\nThere are several ways of selecting colors, including palettes, color choosers and using an eyedropper tool to select a colour on the canvas. The built-in color choosers include RGB/HSV selector or scales, water-color selector, CMYK selector and a color-wheel selector. Colors can also be selected using hexadecimal color codes as used in HTML color selection. GIMP has native support for indexed colour and RGB color spaces; other color spaces are supported using decomposition where each channel of the new color space becomes a black-and-white image. CMYK, LAB and HSV (hue, saturation, value) are supported this way. Color blending can be achieved using the Blend tool, by applying a gradient to the surface of an image and using GIMP's color modes. Gradients are also integrated into tools such as the brush tool, when the user paints this way the output color slowly changes. There are a number of default gradients included with GIMP; a user can also create custom gradients with tools provided. Gradient plug-ins are also available.\n\n;Selections and paths\nGIMP selection tools include a rectangular and circular selection tool, free select tool, and fuzzy select tool (also known as magic wand). More advanced selection tools include the select by color tool for selecting contiguous regions of color—and the scissors select tool, which creates selections semi-automatically between areas of highly contrasting colors. GIMP also supports a quick mask mode where a user can use a brush to paint the area of a selection.  Visibly this looks like a red colored overlay being added or removed. The foreground select tool is an implementation of Simple Interactive Object Extraction (SIOX) a method used to perform the extraction of foreground elements, such as a person or a tree in focus. The Paths Tool allows a user to create vectors (also known as Bézier curves). Users can use paths to create complex selections, including around natural curves. They can paint (or \"stroke\") the paths with brushes, patterns, or various line styles. Users can name and save paths for reuse.\n\n;Image editing\nThere are many tools that can be used for editing images in GIMP. The more common tools include a paint brush, pencil, airbrush, eraser and ink tools used to create new or blended pixels. The Bucket Fill tool can be used to fill a selection with a color or pattern. The Blend tool can be used to fill a selection with a color gradient. These color transitions can be applied to large regions or smaller custom path selections.\n\nGIMP also provides \"smart\" tools that use a more complex algorithm to do things that otherwise would be time consuming or impossible. These include:\n* Clone tool, which copies pixels using a brush\n* Healing brush, which copies pixels from an area and corrects tone and color\n* Perspective clone tool, which works like the clone tool but corrects for distance changes\n* Blur and sharpen tool blurs and sharpens using a brush\n* The Smudge tool can be used to subtly smear a selection where it stands.\n* Dodge and burn tool is a brush that makes target pixels lighter (dodges) or darker (burns)\n\n;Layers, layer masks and channels\nAn image being edited in GIMP can consist of many layers in a stack. The user manual suggests that \"A good way to visualize a GIMP image is as a stack of transparencies,\" where in GIMP terminology, each transparency is a layer. Each layer in an image is made up of several channels. In an RGB image, there are normally 3 or 4 channels, each consisting of a red, green and blue channel. Color sublayers look like slightly different gray images, but when put together they make a complete image. The fourth channel that may be part of a layer is the alpha channel (or layer mask). This channel measures opacity where a whole or part of an image can be completely visible, partially visible or invisible. Each layer has a layer mode that can be set to change the colors in the image.\n\nText layers can be created using the text tool, allowing a user to write on an image. Text layers can be transformed in several ways, such as converting them to a path or selection.\n\n;Automation, scripts and plug-ins\nGIMP has approximately 150 standard effects and filters, including Drop Shadow, Blur, Motion Blur and Noise.\n\nGIMP operations can be automated with scripting languages. The Script-Fu is a Scheme-based language implemented using a TinyScheme interpreter built into GIMP. GIMP can also be scripted in Perl, Python (Python-Fu), or Tcl, using interpreters external to GIMP. New features can be added to GIMP not only by changing program code (GIMP core), but also by creating plug-ins. These are external programs that are executed and controlled by the main GIMP program. MathMap is an example of a plug-in written in C.\n\nThere is support for several methods of sharpening and blurring images, including the blur and sharpen tool. The unsharp mask tool is used to sharpen an image selectively — it only sharpens areas of an image that are sufficiently detailed. The Unsharp Mask tool is considered to give more targeted results for photographs than a normal sharpening filter. The Selective Gaussian Blur tool works in a similar way, except it blurs areas of an image with little detail.\n\n;GEGL\nThe Generic Graphics Library (GEGL) was first introduced as part of GIMP on the 2.6 release of GIMP. This initial introduction does not yet exploit all of the capabilities of GEGL; as of the 2.6 release, GIMP can use GEGL to perform high bit-depth color operations; because of this less information is lost when performing color operations. When GEGL is fully integrated, GIMP will have a higher color bit depth and better non-destructive work-flow. Current distribution versions of GIMP only support 8-bit of color, which is much less than what e.g. digital cameras produce (12-bit or more). Full support for high bit depth is included with actual Gimp 2.9 Development version. For accelerations OpenCL is available for some operations.http://wiki.gimp.org/wiki/Hacking:Porting_filters_to_GEGL\n\n;File formats\nGIMP supports importing and exporting with a large number of different file formats, GIMP's native format XCF is designed to store all information GIMP can contain about an image; XCF is named after the eXperimental Computing Facility where GIMP was authored.  Import and export capability can be extended to additional file formats by means of plug-ins.\n\nForks and derivatives \n\nBecause of the free and open-source nature of GIMP, several forks, variants and derivatives of the computer program have been created to fit the needs of their creators. While GIMP is available for popular operating systems, variants of GIMP may be OS-specific. These variants are neither hosted nor linked on the GIMP site.  The GIMP site does not host GIMP builds for Windows or Unix-like operating systems either, although it does include a link to a Windows build.\n\nWell-known variants include:\n* CinePaint: Formerly Film Gimp, it is a fork of GIMP version 1.0.4, used for frame-by-frame retouching of feature film. CinePaint supports up to 32-bit IEEE-floating point color depth per channel, as well as color management and HDR. CinePaint is used primarily within the film industry due mainly to its support of high-fidelity image formats. It is available for BSD, Linux, and macOS.\n* GIMP classic: A patch against GIMP v2.6.8 source code created to undo changes made to the user interface in GIMP v2.4 through v2.6. A build of GIMP classic for Ubuntu is available. As of March 2011, a new patch could be downloaded that patches against the experimental GIMP v2.7.\n* GIMP Portable: A portable version of GIMP for Microsoft Windows XP or later that preserves brushes and presets between computers\n* GIMPshop: Derivative that aim to replicate the Adobe Photoshop in some form. Development of GIMPshop was halted in 2006 and the project disavowed by the developer, Scott Moschella, after an unrelated party registered \"GIMPshop\" as part of an Internet domain name and passed off the website as belonging to Moschella while accepting donations and making revenue from advertising but passing on none of the income to Moschella\n* GimPhoto: In Tradition of GIMPshop stands GimPhoto,[http://www.gimphoto.com/ Website of GimPhoto.] In: gimphoto.com. which is also with GUI like Photoshop. With tool GimPad some more modifications are possible. Actual Version of GimPhoto is 24.1 with installer for Windows 8.1 and also included for Windows 7 und 10. It is based on previous Version 1.4.3 by Old GIMP 2.4.3. in 2008.  LinuxVersion is also based on Gimp 2.4.3 and have Files for Ubuntu 14, Fedora and a universal Source for other Unix and Linux. For Mac OS X 10.6+  is Version 26.1 available based by Gimp-Version 2.6.8.http://www.gimphoto.com/2011/08/gimphoto-261-for-osx-released-wakatobi.html Only one Developer is on work in this project actual, so fast updates and new versions based on Gimp 2.8.2x or 2.9.x are not in pipe.\n\n* Instrumented GIMP (ingimp): Created at the University of Waterloo to track and report user interaction with the program to generate statistics about how GIMP is used, first released on 5 May 2007. Statistics collected by ingimp were publicly available freely of charge on the project's site after being anonymized.[https://web.archive.org/web/20120320120006/http://www.ingimp.org/ Ingimp website] via Internet Archive The ingimp site is no longer functioning as of 2014.\n\nNotable extensions \n\nGIMP Animation Package (GAP)\nA GIMP plug-in for creating animations. GAP can save animations in several formats, including GIF and AVI. The animation function relies on GIMP's layering and image file name numbering capability. Animations are created either by placing each frame on its own layer (in other words, treating each layer as an animation cel), or by manipulating each numbered file as if it were a frame in the video: moving, rotating, flipping, changing colors, applying filters, etc. to the layers by taking advantage of interpolation within function calls(plug-in usage), within a specified frame range. The resulting project can be saved as an animated GIF or encoded video file. GAP also provides programmed layer transitions, frame rate change, and move paths, allowing the creation of sophisticated animations.\n\nGIMP Paint Studio (GPS)\nA collection of brushes and accompanying tool presets, aimed at artists and graphic designers. It speeds up repetitive tasks and can save tool settings between sessions.\n\nResynthesizer\nA set of plugins originally developed as part of Paul Harrison's PhD thesis providing \"context-aware fill\" features, including heal selection, heal transparency, uncrop and general resynthesize (the other plugins are user-friendly specialisations of this plugin). The plugin is now maintained by Lloyd Konneker. Some uses for the plugin are creating more of a texture, including creation of tileable textures, removing objects from images for touching up photos, and creating themed images.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "GIMP" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12628" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "GIMP ( ) (GNU Image Manipulation Program) is a free and open-source raster graphics editor used for image retouching and editing, free-form drawing, converting between different image formats, and more specialized tasks.\n\nGIMP is released under GPLv3+ licenses and is available for Linux, macOS, and Microsoft Windows.\n\nHistory \n\nGIMP was originally released as the General Image Manipulation Program.  In 1995 Spencer Kimball and Peter Mattis began developing GIMP as a semester-long project at the University of California, Berkeley for the eXperimental Computing Facility. In 1996 GIMP (0.54) was released as the first publicly available release. In the following year Richard Stallman visited UC Berkeley where Spencer Kimball and Peter Mattis asked if they could change General to GNU (the name given to the operating system created by Stallman). Richard Stallman approved and the definition of the acronym GIMP was changed to be the GNU Image Manipulation Program.  This reflected its new existence as being developed as Free Software as a part of the GNU Project.\n\nThe number of computer architectures and operating systems supported has expanded significantly since its first release. The first release supported UNIX systems, such as Linux, SGI IRIX and HP-UX. Since the initial release, GIMP has been ported to many operating systems, including Microsoft Windows and macOS; the original port to the Windows 32-bit platform was started by Finnish programmer Tor M. Lillqvist (tml) in 1997 and was supported in the GIMP 1.1 release.\n\nFollowing the first release GIMP was quickly adopted and a community of contributors formed. The community began developing tutorials, artwork and shared better work-flows and techniques.\n\nA GUI toolkit called GTK (GIMP tool kit) was developed to facilitate the development of GIMP. GTK was replaced by its successor GTK+ after being redesigned using object-oriented programming techniques. The development of GTK+ has been attributed to Peter Mattis becoming disenchanted with the Motif toolkit GIMP originally used; Motif was used up until GIMP 0.60.\n\nDevelopment \n\nGIMP is primarily developed by volunteers as a free software project associated to both the GNU and GNOME Projects. Development takes place in a public git source code repository, on public mailing lists and in public chat channels on the GIMPNET IRC network.\n\nNew features are held in public separate source code branches and merged into the main (or development) branch when the GIMP team is sure they won't damage existing functions. Sometimes this means that features that appear complete do not get merged or take months or years before they become available in GIMP.\n\nGIMP itself is released as source code. After a source code release installers and packages are made for different operating systems by parties who might not be in contact with the maintainers of GIMP.\n\nThe version number used in GIMP is expressed in a major-minor-micro format, with each number carrying a specific meaning: the first (major) number is incremented only for major developments (and is currently 2). The second (minor) number is incremented with each release of new features, with odd numbers reserved for in-progress development versions and even numbers assigned to stable releases; the third (micro) number is incremented before and after each release (resulting in even numbers for releases, and odd numbers for development snapshots) with any bug fixes subsequently applied and released for a stable version.\n\nEach year GIMP applies for several positions in the Google Summer of Code (GSoC); to date GIMP has participated in all years except 2007. From 2006 to 2009 there have been nine GSoC projects that have been listed as successful, although not all successful projects have been merged into GIMP immediately. The healing brush and perspective clone tools and Ruby bindings were created as part of the 2006 GSoC and can be used in version 2.8.0 of GIMP, although there were three other projects that were completed and are later available in a stable version of GIMP; those projects being Vector Layers (end 2008 in 2.8 and master),https://git.gnome.org/browse/gimp/commit/?id39af762f615a6a86a82f154638bfca133592e140 and a JPEG 2000 plug-in (mid 2009 in 2.8 and master).https://git.gnome.org/browse/gimp/commit/?id\n6e581ca990326ca083986ae209443612439b3e51 \nSeveral of the GSoC projects were completed in 2008, but have been merged into a stable GIMP release later in 2009 to 2014 for Version 2.8.xx and 2.9.x. Some of them needed some more code work for the master tree. \n\nSecond public Development 2.9-Version was 2.9.4 with many deep improvements after initial Public Version 2.9.2 https://www.gimp.org/news/2015/11/27/gimp-2-9-2-released/https://www.gimp.org/news/2016/07/13/gimp-2-9-4-released/ Third Public 2.9-Development version is Version 2.9.6.https://www.gimp.org/news/2017/08/24/gimp-2-9-6-released/ One of the new features is removing the 4GB size limit of XCF file.http://www.phoronix.com/scan.php?pagenews_item&px\nGIMP-2.9.6-Featureshttps://git.gnome.org/browse/gimp/commit/?id=226fb033859e64b2e6bea67df50ee76de53370a7 \nIncrease of possible threads to 64 is also an important point for modern parallel execution in actual AMD Ryzen and Intel Xeon processors. Actual Version is 2.9.8 with many bugfixes and improvements in gradients and clips.https://www.gimp.org/news/2017/12/12/gimp-2-9-8-released/\n\nNext stable versions in roadmap are 2.10 with full GEGL and 3.0 with GTK3-Port.http://wiki.gimp.org/index.php/Roadmap\n\nUser interface \n\nThe user interface of GIMP is designed by a dedicated design and usability team. This team was formed after the developers of GIMP signed up to join the OpenUsability project. A user interface brainstorming group has since been created for GIMP, where users of GIMP can send in their suggestions as to how they think the GIMP user interface could be improved.\n\nGIMP is presented in two forms, single and multiple window mode; GIMP 2.8 defaults to the multiple window mode.  In multiple window mode a set of windows contain all GIMPs functionality. By default, tools and tool settings are on the left and other dialogues are on the right. A layers tab is often to the right of the tools tab, and allows a user to work individually on separate image layers. Layers can be edited by right-clicking on a particular layer to bring up edit options for that layer. The tools tab and layers tab are the most common dockable tabs.\n\nGTK+ (GIMP tool kit) is used to create the graphical user interface. GTK+'s creation and history regarding GIMP is described in the history section above.\n\nLibre Graphics Meetings \n\nThe Libre Graphics Meeting (LGM) is a yearly event where developers of GIMP and other projects meet up to discuss issues related to free and open source graphics software. The GIMP developers hold birds of a feather (BOF) sessions at this event.\n\nDistribution \n\nThe current version of GIMP works with numerous operating systems, including Linux, macOS and Microsoft Windows. Many Linux distributions include GIMP as a part of their desktop operating systems, including Fedora and Debian.\n\nThe GIMP website links to binary installers compiled by Jernej Simončič for the platform. MacPorts was listed as the recommended provider of Mac builds of GIMP, but this is no longer needed as version 2.8.2 and later run natively on macOS. GTK+ was originally designed to run on an X11 server.  Because macOS can optionally use an X11 server, porting GIMP to macOS is simpler compared to creating a Windows port.  GIMP is also available as part of the Ubuntu noroot package from the Google Play Store on Android. In November 2013, GIMP removed its download from SourceForge, citing misleading download buttons that potentially confuse customers, as well as SourceForge's own Windows installer, which bundles potentially unwanted programs. In a statement, GIMP called SourceForge a once \"useful and trustworthy place to develop and host FLOSS applications\" that now faces \"a problem with the ads they allow on their sites ...\"\n\nSourceforge controversy \n\nGIMP, who discontinued their use of SourceForge as a download mirror in November 2013,https://web.archive.org/web/20150529094757/https://sourceforge.net/blog/gimp-win-project-wasnt-hijacked-just-abandoned/ reported in May 2015 that SourceForge was hosting infected versions of their Windows binaries on their Open Source Mirror directory.https://mail.gnome.org/archives/gimp-developer-list/2015-May/msg00144.htmlhttps://arstechnica.com/information-technology/2015/05/sourceforge-grabs-gimp-for-windows-account-wraps-installer-in-bundle-pushing-adware/\n\nProfessional reviews \n\nGIMP's fitness for use in professional environments is regularly reviewed; it is often compared to and suggested as a possible replacement for Adobe Photoshop. GIMP has similar functionality to Photoshop, but has a different user interface.\n\nGIMP 2.6 was used to create nearly all of the art in Lucas the Game, an independent video game by developer Timothy Courtney. Courtney started development of Lucas the Game in early 2014, and the video game was published in July 2015 for PC and Mac. Courtney explains GIMP is a powerful tool, fully capable of large professional projects, such as video games. This is the first case of GIMP having played a major role in the production of a published video game.\n\nThe single-window mode introduced in GIMP 2.8 was reviewed in 2012 by Ryan Paul of Ars Technica, who noted that it made the user experience feel \"more streamlined and less cluttered.\" Michael Burns, writing for Macworld in 2014, described the single-window interface of GIMP 2.8.10 as a \"big improvement\".\n\nIn his review of GIMP for ExtremeTech in October 2013, David Cardinal noted that GIMP's reputation of being hard to use and lacking features has \"changed dramatically over the last couple years\", and that it was \"no longer a crippled alternative to Photoshop\". He described GIMP's scripting as one of its strengths, but also remarked that some of Photoshop's features - such as Text, 3D commands, Adjustment Layers and History - are either less powerful or missing in GIMP. Cardinal favorably described the UFRaw converter for raw images used with GIMP, noting that it still \"requires some patience to figure out how to use those more advanced capabilities\". Cardinal stated that GIMP is \"easy enough to try\" despite not having as well developed documentation and help system as those for Photoshop, concluding that it \"has become a worthy alternative to Photoshop for anyone on a budget who doesn’t need all of Photoshop’s vast feature set\".\n\nA 2016 comparison recommended GIMP for use with Linux, for its low (no) cost, for occasional use, and Photoshop for professional users such as photographers and designers, and for some things that GIMP cannot do. The author commented \"GIMP has improved a lot in the last few years, going from unbearably ugly to bearably ugly — but what’s indisputable is that Photoshop is much easier to learn thanks to the countless awesome tutorials available online.\n\nMascot \n\nWilber is the official GIMP mascot. Wilber has relevance outside of GIMP as a racer in SuperTuxKart and was displayed on the Bibliothèque nationale de France (National Library of France) as part of Project Blinkenlights. on the Bibliothèque nationale de France\n\nWilber was created at some time before 25 September 1997 by Tuomas Kuosmanen (tigert) and has since received additional accessories and a construction kit to ease the process.[http://www.gimp.org/about/linking.html GIMP — linking to us]. For Wilber kit see /docs/Wilber_Construction_Kit.xcf.gz\n\nFeatures \n\nTools used to perform image editing can be accessed via the toolbox, through menus and dialogue windows. They include filters and brushes, as well as transformation, selection, layer and masking tools.\n\n;Color\nThere are several ways of selecting colors, including palettes, color choosers and using an eyedropper tool to select a colour on the canvas. The built-in color choosers include RGB/HSV selector or scales, water-color selector, CMYK selector and a color-wheel selector. Colors can also be selected using hexadecimal color codes as used in HTML color selection. GIMP has native support for indexed colour and RGB color spaces; other color spaces are supported using decomposition where each channel of the new color space becomes a black-and-white image. CMYK, LAB and HSV (hue, saturation, value) are supported this way. Color blending can be achieved using the Blend tool, by applying a gradient to the surface of an image and using GIMP's color modes. Gradients are also integrated into tools such as the brush tool, when the user paints this way the output color slowly changes. There are a number of default gradients included with GIMP; a user can also create custom gradients with tools provided. Gradient plug-ins are also available.\n\n;Selections and paths\nGIMP selection tools include a rectangular and circular selection tool, free select tool, and fuzzy select tool (also known as magic wand). More advanced selection tools include the select by color tool for selecting contiguous regions of color—and the scissors select tool, which creates selections semi-automatically between areas of highly contrasting colors. GIMP also supports a quick mask mode where a user can use a brush to paint the area of a selection.  Visibly this looks like a red colored overlay being added or removed. The foreground select tool is an implementation of Simple Interactive Object Extraction (SIOX) a method used to perform the extraction of foreground elements, such as a person or a tree in focus. The Paths Tool allows a user to create vectors (also known as Bézier curves). Users can use paths to create complex selections, including around natural curves. They can paint (or \"stroke\") the paths with brushes, patterns, or various line styles. Users can name and save paths for reuse.\n\n;Image editing\nThere are many tools that can be used for editing images in GIMP. The more common tools include a paint brush, pencil, airbrush, eraser and ink tools used to create new or blended pixels. The Bucket Fill tool can be used to fill a selection with a color or pattern. The Blend tool can be used to fill a selection with a color gradient. These color transitions can be applied to large regions or smaller custom path selections.\n\nGIMP also provides \"smart\" tools that use a more complex algorithm to do things that otherwise would be time consuming or impossible. These include:\n* Clone tool, which copies pixels using a brush\n* Healing brush, which copies pixels from an area and corrects tone and color\n* Perspective clone tool, which works like the clone tool but corrects for distance changes\n* Blur and sharpen tool blurs and sharpens using a brush\n* The Smudge tool can be used to subtly smear a selection where it stands.\n* Dodge and burn tool is a brush that makes target pixels lighter (dodges) or darker (burns)\n\n;Layers, layer masks and channels\nAn image being edited in GIMP can consist of many layers in a stack. The user manual suggests that \"A good way to visualize a GIMP image is as a stack of transparencies,\" where in GIMP terminology, each transparency is a layer. Each layer in an image is made up of several channels. In an RGB image, there are normally 3 or 4 channels, each consisting of a red, green and blue channel. Color sublayers look like slightly different gray images, but when put together they make a complete image. The fourth channel that may be part of a layer is the alpha channel (or layer mask). This channel measures opacity where a whole or part of an image can be completely visible, partially visible or invisible. Each layer has a layer mode that can be set to change the colors in the image.\n\nText layers can be created using the text tool, allowing a user to write on an image. Text layers can be transformed in several ways, such as converting them to a path or selection.\n\n;Automation, scripts and plug-ins\nGIMP has approximately 150 standard effects and filters, including Drop Shadow, Blur, Motion Blur and Noise.\n\nGIMP operations can be automated with scripting languages. The Script-Fu is a Scheme-based language implemented using a TinyScheme interpreter built into GIMP. GIMP can also be scripted in Perl, Python (Python-Fu), or Tcl, using interpreters external to GIMP. New features can be added to GIMP not only by changing program code (GIMP core), but also by creating plug-ins. These are external programs that are executed and controlled by the main GIMP program. MathMap is an example of a plug-in written in C.\n\nThere is support for several methods of sharpening and blurring images, including the blur and sharpen tool. The unsharp mask tool is used to sharpen an image selectively — it only sharpens areas of an image that are sufficiently detailed. The Unsharp Mask tool is considered to give more targeted results for photographs than a normal sharpening filter. The Selective Gaussian Blur tool works in a similar way, except it blurs areas of an image with little detail.\n\n;GEGL\nThe Generic Graphics Library (GEGL) was first introduced as part of GIMP on the 2.6 release of GIMP. This initial introduction does not yet exploit all of the capabilities of GEGL; as of the 2.6 release, GIMP can use GEGL to perform high bit-depth color operations; because of this less information is lost when performing color operations. When GEGL is fully integrated, GIMP will have a higher color bit depth and better non-destructive work-flow. Current distribution versions of GIMP only support 8-bit of color, which is much less than what e.g. digital cameras produce (12-bit or more). Full support for high bit depth is included with actual Gimp 2.9 Development version. For accelerations OpenCL is available for some operations.http://wiki.gimp.org/wiki/Hacking:Porting_filters_to_GEGL\n\n;File formats\nGIMP supports importing and exporting with a large number of different file formats, GIMP's native format XCF is designed to store all information GIMP can contain about an image; XCF is named after the eXperimental Computing Facility where GIMP was authored.  Import and export capability can be extended to additional file formats by means of plug-ins.\n\nForks and derivatives \n\nBecause of the free and open-source nature of GIMP, several forks, variants and derivatives of the computer program have been created to fit the needs of their creators. While GIMP is available for popular operating systems, variants of GIMP may be OS-specific. These variants are neither hosted nor linked on the GIMP site.  The GIMP site does not host GIMP builds for Windows or Unix-like operating systems either, although it does include a link to a Windows build.\n\nWell-known variants include:\n* CinePaint: Formerly Film Gimp, it is a fork of GIMP version 1.0.4, used for frame-by-frame retouching of feature film. CinePaint supports up to 32-bit IEEE-floating point color depth per channel, as well as color management and HDR. CinePaint is used primarily within the film industry due mainly to its support of high-fidelity image formats. It is available for BSD, Linux, and macOS.\n* GIMP classic: A patch against GIMP v2.6.8 source code created to undo changes made to the user interface in GIMP v2.4 through v2.6. A build of GIMP classic for Ubuntu is available. As of March 2011, a new patch could be downloaded that patches against the experimental GIMP v2.7.\n* GIMP Portable: A portable version of GIMP for Microsoft Windows XP or later that preserves brushes and presets between computers\n* GIMPshop: Derivative that aim to replicate the Adobe Photoshop in some form. Development of GIMPshop was halted in 2006 and the project disavowed by the developer, Scott Moschella, after an unrelated party registered \"GIMPshop\" as part of an Internet domain name and passed off the website as belonging to Moschella while accepting donations and making revenue from advertising but passing on none of the income to Moschella\n* GimPhoto: In Tradition of GIMPshop stands GimPhoto,[http://www.gimphoto.com/ Website of GimPhoto.] In: gimphoto.com. which is also with GUI like Photoshop. With tool GimPad some more modifications are possible. Actual Version of GimPhoto is 24.1 with installer for Windows 8.1 and also included for Windows 7 und 10. It is based on previous Version 1.4.3 by Old GIMP 2.4.3. in 2008.  LinuxVersion is also based on Gimp 2.4.3 and have Files for Ubuntu 14, Fedora and a universal Source for other Unix and Linux. For Mac OS X 10.6+  is Version 26.1 available based by Gimp-Version 2.6.8.http://www.gimphoto.com/2011/08/gimphoto-261-for-osx-released-wakatobi.html Only one Developer is on work in this project actual, so fast updates and new versions based on Gimp 2.8.2x or 2.9.x are not in pipe.\n\n* Instrumented GIMP (ingimp): Created at the University of Waterloo to track and report user interaction with the program to generate statistics about how GIMP is used, first released on 5 May 2007. Statistics collected by ingimp were publicly available freely of charge on the project's site after being anonymized.[https://web.archive.org/web/20120320120006/http://www.ingimp.org/ Ingimp website] via Internet Archive The ingimp site is no longer functioning as of 2014.\n\nNotable extensions \n\nGIMP Animation Package (GAP)\nA GIMP plug-in for creating animations. GAP can save animations in several formats, including GIF and AVI. The animation function relies on GIMP's layering and image file name numbering capability. Animations are created either by placing each frame on its own layer (in other words, treating each layer as an animation cel), or by manipulating each numbered file as if it were a frame in the video: moving, rotating, flipping, changing colors, applying filters, etc. to the layers by taking advantage of interpolation within function calls(plug-in usage), within a specified frame range. The resulting project can be saved as an animated GIF or encoded video file. GAP also provides programmed layer transitions, frame rate change, and move paths, allowing the creation of sophisticated animations.\n\nGIMP Paint Studio (GPS)\nA collection of brushes and accompanying tool presets, aimed at artists and graphic designers. It speeds up repetitive tasks and can save tool settings between sessions.\n\nResynthesizer\nA set of plugins originally developed as part of Paul Harrison's PhD thesis providing \"context-aware fill\" features, including heal selection, heal transparency, uncrop and general resynthesize (the other plugins are user-friendly specialisations of this plugin). The plugin is now maintained by Lloyd Konneker. Some uses for the plugin are creating more of a texture, including creation of tileable textures, removing objects from images for touching up photos, and creating themed images. GIMP. http://en.wikipedia.org/?curid=12628."
  }
}
