{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12028",
  "eid" : "ff99d200-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778508576,
  "textBody" : "Little is known of the history of Gabon prior to European contact. Bantu migrants settled the area beginning in the 14th century. Portuguese explorers and traders arrived in the area in the late 15th century. The coast subsequently became a center of the slave trade with Dutch, English, and French traders arriving in the 16th century. In 1839 and 1841, France established a protectorate over the coast.\n\nIn 1849, captives released from a captured slave ship founded Libreville. In 1862-1887, France expanded its control to include the interior, and took full sovereignty.\n\nIn 1910 Gabon became part of French Equatorial Africa and in 1960, Gabon became independent.\n\nAt the time of Gabon's independence, two principal political parties existed: the Gabonese Democratic Bloc (BDG), led by Léon M'Ba, and the Gabonese Democratic and Social Union (UDSG), led by Jean-Hilaire Aubame. In the first post-independence election, held under a parliamentary system, neither party was able to win a majority; the leaders subsequently agreed against a two-party system and ran with a single list of candidates. In the February 1961 election, held under the new presidential system, M'Ba became President and Aubame became Foreign Minister. The single-party solution disintegrated in 1963, and there was a single-day bloodless coup in 1964. In March 1967, Leon M'Ba and Omar Bongo were elected President and Vice President. M'Ba died later that year. Bongo declared Gabon a one-party state, dissolved the BDG and established the Gabonese Democratic Party (PDG). Sweeping political reforms in 1990 led to a new constitution, and the PDG garnered a large majority in the country's first multi-party elections in 30 years. Despite discontent from opposition parties, Bongo has remained president ever since.\n\nEarly history\n\nGabon was settled from the 14th century by Bantu.  Little is known of tribal life before European contact but tribal art suggests a rich cultural heritage.\n\nGabon's first confirmed European visitors were Portuguese explorers and traders who arrived in the late 15th century. The Portuguese settled on the offshore islands of São Tomé, Príncipe, and Fernando Pó, but were regular visitors to the coast.\n\nThey named the Gabon region after the Portuguese word gabão — a coat with sleeve and hood resembling the shape of the Komo River estuary. The coast became a center of the slave trade.\n\nSome Portuguese adventurers established themselves as rulers of areas in Gabon. One such was Ogandaga é Butu, son of a Portuguese father and a Gabonese mother. He ruled some islands along the coast, which are still controlled by his descendant Mbourou Eranga Yanelle Prunella.\n\nDutch, English, and French traders came in the 16th century.\n\nFrench colonial period\n\nIn 1839 and 1841, France established a protectorate over the coastal regions of Gabon by treaties with Gabonese coastal chiefs.\n\nAmerican missionaries from New England established a mission  at the mouth of the Komo River in 1842. In 1849, the French authorities captured an illegal slave ship and freed the captives on board. The captives were released near the mission station, where they founded a settlement which was called Libreville (French for \"free town\")\n\nFrench explorers penetrated Gabon's dense jungles between 1862 and 1887. The most famous, Savorgnan de Brazza, used Gabonese bearers and guides in his search for the headwaters of the Congo river. France occupied Gabon in 1885, but did not administer it until 1903. Gabon's first political party, the Jeunesse Gabonais, was founded around 1922.\n\nIn 1910 Gabon became one of the four territories of French Equatorial Africa. On 15 July 1960 France agreed to Gabon becoming fully independent.https://select.nytimes.com/mem/archive/pdf?res=FA0D16F63D5C1A728DDDAF0994DF405B808AF1D3 On 17 August 1960 Gabon became an independent country.\n\nIndependence\n\nAt the time of Gabon's independence in 1960, two principal political parties existed: the Gabonese Democratic Bloc (BDG), led by Léon M'Ba, and the Gabonese Democratic and Social Union (UDSG), led by Jean-Hilaire Aubame. In the first post-independence election, held under a parliamentary system, neither party was able to win a majority. The BDG obtained support from three of the four independent legislative deputies, and M'Ba was named Prime Minister. Soon after concluding that Gabon had an insufficient number of people for a two-party system, the two party leaders agreed on a single list of candidates. In the February 1961 election, held under the new presidential system, M'Ba became president and Aubame became foreign minister.\n\nThis one-party system appeared to work until February 1963, when the larger BDG element forced the UDSG members to choose between a merger of the parties or resignation. The UDSG cabinet ministers resigned, and M'Ba called an election for February 1964 and a reduced number of National Assembly deputies (from 67 to 47). The UDSG failed to muster a list of candidates able to meet the requirements of the electoral decrees. When the BDG appeared likely to win the election by default, the Gabonese military toppled M'Ba in a bloodless coup on 18 February 1964. French troops re-established his government the next day. Elections were held in April 1964 with many opposition participants. BDG-supported candidates won 31 seats and the opposition 16. Late in 1966, the constitution was revised to provide for automatic succession of the vice president should the president die in office. In March 1967, Leon M'Ba and Omar Bongo (then known as Albert Bongo) were elected President and Vice President, with the BDG winning all 47 seats in the National Assembly. M'Ba died later that year, and Omar Bongo became president.\n\nIn March 1968 Bongo declared Gabon a one-party state by dissolving the BDG and establishing a new party: the Gabonese Democratic Party (Parti Démocratique Gabonais) (PDG). He invited all Gabonese, regardless of previous political affiliation, to participate. Bongo was elected President in February 1973; in April 1975, the office of vice president was abolished and replaced by the office of prime minister, who had no right to automatic succession. Bongo was re-elected president in December 1979 and November 1986 to 7-year terms. Using the PDG as a tool to submerge the regional and tribal rivalries that divided Gabonese politics in the past, Bongo sought to forge a single national movement in support of the government's development policies.\n\nEconomic discontent and a desire for political liberalization provoked violent demonstrations and strikes by students and workers in early 1990. In response to worker grievances, Bongo negotiated on a sector-by-sector basis, making significant wage concessions. In addition, he promised to open up the PDG and to organize a national political conference in March–April 1990 to discuss Gabon's future political system. The PDG and 74 political organizations attended the conference. Participants essentially divided into two loose coalitions, the ruling PDG and its allies, and the United Front of Opposition Associations and Parties, consisting of the breakaway Morena Fundamental and the Gabonese Progress Party.\n\nThe April 1990 conference approved sweeping political reforms, including creation of a national Senate, decentralization of the budgetary process, freedom of assembly and press, and cancellation of the exit visa requirement. In an attempt to guide the political system's transformation to multiparty democracy, Bongo resigned as PDG chairman and created a transitional government headed by a new Prime Minister, Casimir Oyé-Mba. The Gabonese Social Democratic Grouping (RSDG), as the resulting government was called, was smaller than the previous government and included representatives from several opposition parties in its cabinet. The RSDG drafted a provisional constitution in May 1990 that provided a basic bill of rights and an independent judiciary but retained strong executive powers for the president. After further review by a constitutional committee and the National Assembly, this document came into force in March 1991. Under the 1991 constitution, in the event of the president's death, the Prime Minister, the National Assembly president, and the defense minister were to share power until a new election could be held.\n\nOpposition to the PDG continued, however, and in September 1990, two coup d'état attempts were uncovered and aborted. Despite anti-government demonstrations after the untimely death of an opposition leader, the first multiparty National Assembly elections in almost 30 years took place in September–October 1990, with the PDG garnering a large majority.\n\nFollowing President Bongo's re-election in December 1993 with 51% of the vote, opposition candidates refused to validate the election results. Serious civil disturbances led to an agreement between the government and opposition factions to work toward a political settlement. These talks led to the Paris Accords in November 1994, under which several opposition figures were included in a government of national unity, and constitutional reforms were approved in a referendum in 1995. This arrangement soon broke down, however, and the 1996 and 1997 legislative and municipal elections provided the background for renewed partisan politics. The PDG won a landslide victory in the legislative election, but several major cities, including Libreville, elected opposition mayors during the 1997 local election.\n\nModern times\n\nPresident Bongo coasted to easy re-elections in December 1998 and November 2005, with large majorities of the vote against a divided opposition. While Bongo's major opponents rejected the outcome as fraudulent, some international observers characterized the results as representative despite any perceived irregularities. Legislative elections held in 2001-2002, which were boycotted by a number of smaller opposition parties and were widely criticized for their administrative weaknesses, produced a National Assembly almost completely dominated by the PDG and allied independents.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "History of Gabon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12028" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Little is known of the history of Gabon prior to European contact. Bantu migrants settled the area beginning in the 14th century. Portuguese explorers and traders arrived in the area in the late 15th century. The coast subsequently became a center of the slave trade with Dutch, English, and French traders arriving in the 16th century. In 1839 and 1841, France established a protectorate over the coast.\n\nIn 1849, captives released from a captured slave ship founded Libreville. In 1862-1887, France expanded its control to include the interior, and took full sovereignty.\n\nIn 1910 Gabon became part of French Equatorial Africa and in 1960, Gabon became independent.\n\nAt the time of Gabon's independence, two principal political parties existed: the Gabonese Democratic Bloc (BDG), led by Léon M'Ba, and the Gabonese Democratic and Social Union (UDSG), led by Jean-Hilaire Aubame. In the first post-independence election, held under a parliamentary system, neither party was able to win a majority; the leaders subsequently agreed against a two-party system and ran with a single list of candidates. In the February 1961 election, held under the new presidential system, M'Ba became President and Aubame became Foreign Minister. The single-party solution disintegrated in 1963, and there was a single-day bloodless coup in 1964. In March 1967, Leon M'Ba and Omar Bongo were elected President and Vice President. M'Ba died later that year. Bongo declared Gabon a one-party state, dissolved the BDG and established the Gabonese Democratic Party (PDG). Sweeping political reforms in 1990 led to a new constitution, and the PDG garnered a large majority in the country's first multi-party elections in 30 years. Despite discontent from opposition parties, Bongo has remained president ever since.\n\nEarly history\n\nGabon was settled from the 14th century by Bantu.  Little is known of tribal life before European contact but tribal art suggests a rich cultural heritage.\n\nGabon's first confirmed European visitors were Portuguese explorers and traders who arrived in the late 15th century. The Portuguese settled on the offshore islands of São Tomé, Príncipe, and Fernando Pó, but were regular visitors to the coast.\n\nThey named the Gabon region after the Portuguese word gabão — a coat with sleeve and hood resembling the shape of the Komo River estuary. The coast became a center of the slave trade.\n\nSome Portuguese adventurers established themselves as rulers of areas in Gabon. One such was Ogandaga é Butu, son of a Portuguese father and a Gabonese mother. He ruled some islands along the coast, which are still controlled by his descendant Mbourou Eranga Yanelle Prunella.\n\nDutch, English, and French traders came in the 16th century.\n\nFrench colonial period\n\nIn 1839 and 1841, France established a protectorate over the coastal regions of Gabon by treaties with Gabonese coastal chiefs.\n\nAmerican missionaries from New England established a mission  at the mouth of the Komo River in 1842. In 1849, the French authorities captured an illegal slave ship and freed the captives on board. The captives were released near the mission station, where they founded a settlement which was called Libreville (French for \"free town\")\n\nFrench explorers penetrated Gabon's dense jungles between 1862 and 1887. The most famous, Savorgnan de Brazza, used Gabonese bearers and guides in his search for the headwaters of the Congo river. France occupied Gabon in 1885, but did not administer it until 1903. Gabon's first political party, the Jeunesse Gabonais, was founded around 1922.\n\nIn 1910 Gabon became one of the four territories of French Equatorial Africa. On 15 July 1960 France agreed to Gabon becoming fully independent.https://select.nytimes.com/mem/archive/pdf?res=FA0D16F63D5C1A728DDDAF0994DF405B808AF1D3 On 17 August 1960 Gabon became an independent country.\n\nIndependence\n\nAt the time of Gabon's independence in 1960, two principal political parties existed: the Gabonese Democratic Bloc (BDG), led by Léon M'Ba, and the Gabonese Democratic and Social Union (UDSG), led by Jean-Hilaire Aubame. In the first post-independence election, held under a parliamentary system, neither party was able to win a majority. The BDG obtained support from three of the four independent legislative deputies, and M'Ba was named Prime Minister. Soon after concluding that Gabon had an insufficient number of people for a two-party system, the two party leaders agreed on a single list of candidates. In the February 1961 election, held under the new presidential system, M'Ba became president and Aubame became foreign minister.\n\nThis one-party system appeared to work until February 1963, when the larger BDG element forced the UDSG members to choose between a merger of the parties or resignation. The UDSG cabinet ministers resigned, and M'Ba called an election for February 1964 and a reduced number of National Assembly deputies (from 67 to 47). The UDSG failed to muster a list of candidates able to meet the requirements of the electoral decrees. When the BDG appeared likely to win the election by default, the Gabonese military toppled M'Ba in a bloodless coup on 18 February 1964. French troops re-established his government the next day. Elections were held in April 1964 with many opposition participants. BDG-supported candidates won 31 seats and the opposition 16. Late in 1966, the constitution was revised to provide for automatic succession of the vice president should the president die in office. In March 1967, Leon M'Ba and Omar Bongo (then known as Albert Bongo) were elected President and Vice President, with the BDG winning all 47 seats in the National Assembly. M'Ba died later that year, and Omar Bongo became president.\n\nIn March 1968 Bongo declared Gabon a one-party state by dissolving the BDG and establishing a new party: the Gabonese Democratic Party (Parti Démocratique Gabonais) (PDG). He invited all Gabonese, regardless of previous political affiliation, to participate. Bongo was elected President in February 1973; in April 1975, the office of vice president was abolished and replaced by the office of prime minister, who had no right to automatic succession. Bongo was re-elected president in December 1979 and November 1986 to 7-year terms. Using the PDG as a tool to submerge the regional and tribal rivalries that divided Gabonese politics in the past, Bongo sought to forge a single national movement in support of the government's development policies.\n\nEconomic discontent and a desire for political liberalization provoked violent demonstrations and strikes by students and workers in early 1990. In response to worker grievances, Bongo negotiated on a sector-by-sector basis, making significant wage concessions. In addition, he promised to open up the PDG and to organize a national political conference in March–April 1990 to discuss Gabon's future political system. The PDG and 74 political organizations attended the conference. Participants essentially divided into two loose coalitions, the ruling PDG and its allies, and the United Front of Opposition Associations and Parties, consisting of the breakaway Morena Fundamental and the Gabonese Progress Party.\n\nThe April 1990 conference approved sweeping political reforms, including creation of a national Senate, decentralization of the budgetary process, freedom of assembly and press, and cancellation of the exit visa requirement. In an attempt to guide the political system's transformation to multiparty democracy, Bongo resigned as PDG chairman and created a transitional government headed by a new Prime Minister, Casimir Oyé-Mba. The Gabonese Social Democratic Grouping (RSDG), as the resulting government was called, was smaller than the previous government and included representatives from several opposition parties in its cabinet. The RSDG drafted a provisional constitution in May 1990 that provided a basic bill of rights and an independent judiciary but retained strong executive powers for the president. After further review by a constitutional committee and the National Assembly, this document came into force in March 1991. Under the 1991 constitution, in the event of the president's death, the Prime Minister, the National Assembly president, and the defense minister were to share power until a new election could be held.\n\nOpposition to the PDG continued, however, and in September 1990, two coup d'état attempts were uncovered and aborted. Despite anti-government demonstrations after the untimely death of an opposition leader, the first multiparty National Assembly elections in almost 30 years took place in September–October 1990, with the PDG garnering a large majority.\n\nFollowing President Bongo's re-election in December 1993 with 51% of the vote, opposition candidates refused to validate the election results. Serious civil disturbances led to an agreement between the government and opposition factions to work toward a political settlement. These talks led to the Paris Accords in November 1994, under which several opposition figures were included in a government of national unity, and constitutional reforms were approved in a referendum in 1995. This arrangement soon broke down, however, and the 1996 and 1997 legislative and municipal elections provided the background for renewed partisan politics. The PDG won a landslide victory in the legislative election, but several major cities, including Libreville, elected opposition mayors during the 1997 local election.\n\nModern times\n\nPresident Bongo coasted to easy re-elections in December 1998 and November 2005, with large majorities of the vote against a divided opposition. While Bongo's major opponents rejected the outcome as fraudulent, some international observers characterized the results as representative despite any perceived irregularities. Legislative elections held in 2001-2002, which were boycotted by a number of smaller opposition parties and were widely criticized for their administrative weaknesses, produced a National Assembly almost completely dominated by the PDG and allied independents. History of Gabon. http://en.wikipedia.org/?curid=12028."
  }
}
