{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15996",
  "eid" : "228f40b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778567227,
  "textBody" : "Events\n\n* 838 – Battle of Anzen: The Byzantine emperor Theophilos suffers a heavy defeat by the Abbasids.\n*1099 – First Crusade: Godfrey of Bouillon is elected the first Defender of the Holy Sepulchre of The Kingdom of Jerusalem.\n*1209 – Massacre at Béziers: The first major military action of the Albigensian Crusade.\n*1298 – Wars of Scottish Independence: Battle of Falkirk: King Edward I of England and his longbowmen defeat William Wallace and his Scottish schiltrons outside the town of Falkirk.\n*1443 – Battle of St. Jakob an der Sihl in the Old Zürich War. \n*1456 – Ottoman wars in Europe: Siege of Belgrade: John Hunyadi, Regent of the Kingdom of Hungary, defeats Mehmet II of the Ottoman Empire\n*1484 – Battle of Lochmaben Fair: A 500-man raiding party led by Alexander Stewart, Duke of Albany and James Douglas, 9th Earl of Douglas are defeated by Scots forces loyal to Albany's brother James III of Scotland; Douglas is captured.\n*1499 – Battle of Dornach: The Swiss decisively defeat the army of Maximilian I, Holy Roman Emperor.\n*1587 – Roanoke Colony: A second group of English settlers arrives on Roanoke Island off North Carolina to re-establish the deserted colony.\n* 1598 – William Shakespeare’s play The Merchant of Venice is entered on the Stationers’ Register. By decree of Queen Elizabeth, the Stationers’ Register licensed printed works, giving the Crown tight control over all published material.\n*1686 – Albany, New York is formally chartered as a municipality by Governor Thomas Dongan.\n*1706 – The Acts of Union 1707 are agreed upon by commissioners from the Kingdom of England and the Kingdom of Scotland, which, when passed by each countries' Parliaments, led to the creation of the Kingdom of Great Britain.\n*1793 – Alexander Mackenzie reaches the Pacific Ocean becoming the first recorded human to complete a transcontinental crossing of North America.\n*1796 – Surveyors of the Connecticut Land Company name an area in Ohio \"Cleveland\" after Gen. Moses Cleaveland, the superintendent of the surveying party.\n*1797 – Battle of Santa Cruz de Tenerife: Battle between Spanish and British naval forces during the French Revolutionary Wars. During the Battle, Rear-Admiral Nelson is wounded in the arm and the arm had to be partially amputated.\n*1802 – Emperor Gia Long conquers Hanoi and unified Viet Nam, which had experienced centuries of feudal warfare.\n*1805 – Napoleonic Wars: War of the Third Coalition: Battle of Cape Finisterre: An inconclusive naval action is fought between a combined French and Spanish fleet under Admiral Pierre-Charles Villeneuve of Spain and a British fleet under Admiral Robert Calder.\n*1812 – Napoleonic Wars: Peninsular War: Battle of Salamanca: British forces led by Arthur Wellesley (later the Duke of Wellington) defeat French troops near Salamanca, Spain.\n*1864 – American Civil War: Battle of Atlanta: Outside Atlanta, Confederate General John Bell Hood leads an unsuccessful attack on Union troops under General William T. Sherman on Bald Hill.\n*1893 – Katharine Lee Bates writes America the Beautiful after admiring the view from the top of Pikes Peak near Colorado Springs, Colorado.\n*1894 – The first ever motor race is held in France between the cities of Paris and Rouen. The fastest finisher was the Comte Jules-Albert de Dion, but the 'official' victory was awarded to Albert Lemaître driving his 3 hp petrol engined Peugeot.\n*1916 – Preparedness Day Bombing: In San Francisco, a bomb explodes on Market Street during a parade, killing ten and injuring 40.\n*1933 – Aviator Wiley Post returns to Floyd Bennett Field in New York City, completing the first solo flight around the world in seven days, 18 hours and 49 minutes.\n*1937 – New Deal: The United States Senate votes down President Franklin D. Roosevelt's proposal to add more justices to the Supreme Court of the United States.\n*1942 – The United States government begins compulsory civilian gasoline rationing due to the wartime demands.\n*  1942   – Holocaust: The systematic deportation of Jews from the Warsaw Ghetto begins.\n*1943 – World War II: Allied forces capture the Italian city of Palermo.\n*  1943   – World War II: Axis occupation forces violently disperse a massive protest in Athens, killing 22.\n*1944 – The Polish Committee of National Liberation publishes its manifesto, starting the period of Communist rule in Poland\n*1946 – King David Hotel bombing: A Zionist underground organisation, the Irgun, bombs the King David Hotel in Jerusalem, site of the civil administration and military headquarters for Mandatory Palestine, resulting in 91 deaths.\n*1962 – Mariner program: Mariner 1 spacecraft flies erratically several minutes after launch and has to be destroyed.\n*1963 – Crown Colony of Sarawak gains self-governance.\n*1976 – Japan completes its last reparation to the Philippines for war crimes committed during imperial Japan's conquest of the country in the Second World War.\n*1977 – Chinese leader Deng Xiaoping is restored to power.\n*1983 – Martial law in Poland is officially revoked.\n*1990 – Greg LeMond, an American road racing cyclist, wins his third Tour de France after leading the majority of the race. It was LeMond’s second consecutive Tour de France victory.\n*1992 – Near Medellín, Colombian drug lord Pablo Escobar escapes from his luxury prison fearing extradition to the United States.\n*1993 – Great Flood of 1993: Levees near Kaskaskia, Illinois rupture, forcing the entire town to evacuate by barges operated by the Army Corps of Engineers.\n*1995 – The Hale-Bopp comet is discovered by Alan Hale and Thomas Bopp.\n*1997 – The second Blue Water Bridge opens between Port Huron, Michigan and Sarnia, Ontario.\n*2003 – Members of 101st Airborne of the United States, aided by Special Forces, attack a compound in Iraq, killing Saddam Hussein's sons Uday and Qusay, along with Mustapha Hussein, Qusay's 14-year-old son, and a bodyguard.\n*2005 – Jean Charles de Menezes is killed by police as the hunt begins for the London Bombers responsible for the 7 July 2005 London bombings and the 21 July 2005 London bombings.\n*2011 – Norway is the victim of twin terror attacks, the first being a bomb blast which targeted government buildings in central Oslo, the second being a massacre at a youth camp on the island of Utøya.\n*2013 – A series of earthquakes in Dingxi, China, kills at least 89 people and injures more than 500 others.\n\nBirths\n\n*1210 – Joan of England, Queen of Scotland (d. 1238)\n*1437 – John Scrope, 5th Baron Scrope of Bolton, English Baron (d. 1498)\n*1476 – Zhu Youyuan, Ming Dynasty politician (d. 1519)\n*1478 – Philip I of Castile (d. 1506)\n*1531 – Leonhard Thurneysser, scholar and elector of Brandenburg (d. 1595)\n*1535 – Katarina Stenbock, queen of Gustav I of Sweden (d. 1621)\n*1552 – Anthony Browne, Sheriff of Surrey and Kent (d. 1592)\n*  1552   – Mary Wriothesley, Countess of Southampton, Lady of English peer and others (d. 1607)\n*1559 – Lawrence of Brindisi, Italian priest and saint (d. 1619)\n*1615 – Marguerite of Lorraine, princess of Lorraine, duchess of Orléans (d. 1672)\n*1618 – Johan Nieuhof, Dutch traveler (d. 1672)\n*1621 – Anthony Ashley Cooper, 1st Earl of Shaftesbury, English politician, Lord Chancellor of the United Kingdom (d. 1683)\n*1630 – Madame de Brinvilliers, French aristocrat (d. 1676)\n*1647 – Margaret Mary Alacoque, French nun, mystic and saint (d. 1690)\n*1651 – Ferdinand Tobias Richter, Austrian organist and composer (d. 1711)\n*1711 – Georg Wilhelm Richmann, German-Russian physicist and academic (d. 1753)\n*1713 – Jacques-Germain Soufflot, French architect, designed the Panthéon (d. 1780)\n*1733 – Mikhail Shcherbatov, Russian philosopher and historian (d. 1790)\n*1755 – Gaspard de Prony, French mathematician and engineer (d. 1839)\n*1784 – Friedrich Bessel, German mathematician and astronomer (d. 1846)\n*1839 – Jakob Hurt, Estonian theologist and linguist (d. 1907)\n*1844 – William Archibald Spooner, English priest and scholar (d. 1930)\n*1848 – Adolphus Frederick V, Grand Duke of Mecklenburg-Strelitz (d. 1914)\n*1849 – Emma Lazarus, American poet and educator (d. 1887)\n*1856 – Octave Hamelin, French philosopher (d. 1907)\n*1862 – Cosmo Duff-Gordon, Scottish fencer (d. 1931)\n*1863 – Alec Hearne, English cricketer (d. 1952)\n*1878 – Janusz Korczak, Polish pediatrician and author (d. 1942)\n*1881 – Augusta Fox Bronner, American psychologist, specialist in juvenile psychology (d. 1966)\n*1882 – Edward Hopper, American painter and etcher (d. 1967)\n*1884 – Odell Shepard, American poet and politician, 66th Lieutenant Governor of Connecticut (d. 1967)\n*1886 – Hella Wuolijoki, Estonian-Finnish author (d. 1954)\n*1887 – Gustav Ludwig Hertz, German physicist and academic, Nobel Prize laureate (d. 1975)\n*1888 – Kirk Bryan, American geologist and academic (d. 1950)\n*  1888   – Selman Waksman, Jewish-American biochemist and microbiologist, Nobel Prize laureate (d. 1973)\n*1889 – James Whale, English director (d. 1957)\n*1890 – Rose Kennedy, American philanthropist (d. 1995)\n*1892 – Jack MacBryan, English cricketer and field hockey player (d. 1983)\n*1893 – Jesse Haines, American baseball player and coach (d. 1978)\n*  1893   – Karl Menninger, American psychiatrist and author (d. 1990)\n*1895 – León de Greiff, Colombian poet, journalist, and diplomat (d. 1976)\n*1898 – Stephen Vincent Benét, American poet, short story writer, and novelist (d. 1943)\n*1899 – Sobhuza II of Swaziland (d. 1982)\n*1908 – Amy Vanderbilt, American author (d. 1974)\n*1909 – Licia Albanese, Italian-American soprano and actress (d. 2014)\n*  1909   – Dorino Serafini, Italian race car driver (d. 2000)\n*1910 – Ruthie Tompson, American animator and artist\n*1913 – Gorni Kramer, Italian bassist, songwriter, and bandleader (d. 1995)\n*1915 – Shaista Suhrawardy Ikramullah, Indian-Pakistani politician and diplomat (d. 2000)\n*1916 – Gino Bianco, Brazilian race car driver (d. 1984)\n*  1916   – Marcel Cerdan, French boxer (d. 1949)\n*1921 – William V. Roth Jr., American lawyer and politician (d. 2003)\n*1923 – Bob Dole, American soldier, lawyer, and politician\n*  1923   – César Fernández Ardavín, Spanish director, producer, and screenwriter (d. 2012)\n*1924 – Margaret Whiting, American singer (d. 2011)\n*1925 – Jack Matthews, American author, playwright, and academic (d. 2013)\n*  1925   – Joseph Sargent, American actor, director, and producer (d. 2014)\n*1926 – Bryan Forbes, English actor, director, producer, and screenwriter (d. 2013)\n*  1926   – Wolfgang Iser, German scholar, literary theorist (d. 2007)\n*1927 – Johan Ferner, Norwegian sailor (d. 2015)\n*1928 – Orson Bean, American actor\n*  1928   – Jimmy Hill, English footballer, manager, and sportscaster (d. 2015)\n*1929 – John Barber, English race car driver\n*  1929   – Leonid Stolovich, Russian-Estonian philosopher and academic (d. 2013)\n*  1929   – Neil Welliver, American painter (d. 2005)\n*1931 – Leo Labine, Canadian ice hockey player (d. 2005)\n*1932 – Oscar de la Renta, Dominican-American fashion designer (d. 2014)\n*  1932   – Tom Robbins, American novelist\n*1934 – Junior Cook, American saxophonist (d. 1992)  \n*  1934   – Louise Fletcher, American actress\n*1935 – Tom Cartwright, English-Welsh cricketer and coach (d. 2007)\n*1936 – Don Patterson, American organist (d. 1988) \n*  1936   – Harold Rhodes, English cricketer\n*  1936   – Geraldine Claudette Darden, American mathematician\n*1937 – Chuck Jackson, American R&B singer and songwriter\n*  1937   – Yasuhiro Kojima, Japanese-American wrestler and manager (d. 1999)\n*  1937   – John Price, English cricketer\n*  1937   – Vasant Ranjane, Indian cricketer (d. 2011)\n*1938 – Terence Stamp, English actor\n*1940 – Judith Walzer Leavitt, American historian and academic\n*  1940   – Alex Trebek, Canadian-American game show host and producer\n*1941 – Estelle Bennett, American singer (d. 2009)\n*  1941   – Vaughn Bodē, American illustrator (d. 1975)\n*  1941   – George Clinton, American singer-songwriter and producer\n*  1941   – David M. Kennedy, American historian and author\n*1942 – Michael Abney-Hastings, 14th Earl of Loudoun, English-Australian politician (d. 2012)\n*  1942   – Peter Habeler, Austrian mountaineer and skier\n*  1942   – Les Johns, Australian rugby league player and coach\n*1943 – Masaru Emoto, Japanese author and activist (d. 2014)\n*  1943   – Kay Bailey Hutchison, American lawyer and politician\n*  1943   – Bobby Sherman, American singer-songwriter and actor\n*1944 – Rick Davies, English singer-songwriter and keyboard player \n*  1944   – Sparky Lyle, American baseball player and manager\n*  1944   – Anand Satyanand, New Zealand lawyer, judge, and politician, 19th Governor-General of New Zealand\n*1945 – Philip Cohen, English biochemist and academic\n*1946 – Danny Glover, American actor, director, and producer\n*  1946   – Paul Schrader, American director and screenwriter\n*  1946   – Rolando Joven Tria Tirona, Filipino archbishop\n*  1946   – Johnson Toribiong, Palauan lawyer and politician, 7th President of Palau\n*1947 – Albert Brooks, American actor, comedian, director, and screenwriter\n*  1947   – Gilles Duceppe, Canadian politician\n*  1947   – Don Henley, American singer-songwriter and drummer \n*1949 – Alan Menken, American pianist and composer\n*  1949   – Lasse Virén, Finnish runner and police officer\n*1950 – S. E. Hinton, American Author\n*1951 – Richard Bennett, American guitarist and producer \n*  1951   – J. V. Cain, American football player (d. 1979)\n*  1951   – Patriarch Daniel of Romania\n*1953 – Brian Howe, English singer-songwriter \n*1954 – Al Di Meola, American guitarist, songwriter, and producer \n*  1954   – Steve LaTourette, American lawyer and politician (d. 2016)\n*  1954   – Lonette McKee, American actress and singer\n*  1954   – Ingrid Daubechies, Belgian physicist and mathematician\n*1955 – Richard J. Corman, American businessman, founded the R.J. Corman Railroad Group (d. 2013)\n*  1955   – Willem Dafoe, American actor\n*1956 – Mick Pointer, English neo-progressive rock drummer (Marillion; Arena)\n*  1956   – Scott Sanderson, American baseball player and sportscaster\n*1957 – Dave Stieb, American baseball player\n*1958 – Tatsunori Hara, Japanese baseball player and coach\n*  1958   – David Von Erich, American wrestler (d. 1984)\n*1960 – Jon Oliva, American singer-songwriter and keyboard player \n*1961 – Calvin Fish, English race car driver and sportscaster\n*  1961   – Keith Sweat, American singer-songwriter and producer \n*1962 – Alvin Robertson, American basketball player\n*  1962   – Martine St. Clair, Canadian singer and actress\n*1963 – Emilio Butragueño, Spanish footballer\n*  1963   – Emily Saliers, American singer-songwriter and musician \n*1964 – Will Calhoun, American rock drummer (Living Colour)\n*  1964   – Bonnie Langford, English actress and dancer\n*  1964   – John Leguizamo, Colombian-American actor, producer, and screenwriter\n*  1964   – David Spade, American actor, producer, and screenwriter\n*1965 – Derrick Dalley, Canadian educator and politician\n*  1965   – Shawn Michaels, American wrestler, trainer, and actor\n*  1965   – Richard B. Poore, New Zealand humanitarian\n*  1965   – Doug Riesenberg, American football player and coach\n*1966 – Tim Brown, American football player and manager\n*1967 – Lauren Booth, English journalist and activist\n*1968 – Rhys Ifans, Welsh actor \n*1969 – Despina Vandi, German-Greek singer and actress\n*1970 – Jason Becker, American guitarist and songwriter \n*  1970   – Steve Carter, Australian rugby league player \n*  1970   – Devendra Fadnavis, Indian lawyer and politician, 18th Chief Minister of Maharashtra\n*  1970   – Sergei Zubov, Russian ice hockey player and coach\n*1972 – Colin Ferguson, Canadian actor, director, and producer\n*  1972   – Seth Fisher, American illustrator (d. 2006)\n*  1972   – Keyshawn Johnson, American football player and sportscaster\n*1973 – Brian Chippendale, American singer and drummer \n*  1973   – Daniel Jones, English-Australian guitarist, songwriter, and producer \n*  1973   – Mike Sweeney, American baseball player and sportscaster\n*  1973   – Ece Temelkuran, Turkish journalist and author\n*  1973   – Rufus Wainwright, American-Canadian singer-songwriter\n*1974 – Franka Potente, German actress \n*1977 – Ezio Galon, Italian rugby player\n*  1977   – Ingo Hertzsch, German footballer\n*  1977   – Gustavo Nery, Brazilian footballer\n*1978 – Martyn Lee, English radio host and producer\n*  1978   – Runako Morton, Nevisian cricketer (d. 2012)\n*  1978   – Dennis Rommedahl, Danish footballer\n*1979 – Anna Bieleń-Żarska, Polish tennis player\n*  1979   – Lucas Luhr, German race car driver\n*  1979   – Yadel Martí, Cuban baseball player\n*1980 – Dirk Kuyt, Dutch footballer\n*  1980   – Kate Ryan, Belgian singer-songwriter\n*  1980   – Tablo, South Korean-Canadian rapper\n*1982 – Nuwan Kulasekara, Sri Lankan cricketer\n*1983 – Aldo de Nigris, Mexican footballer\n*  1983   – Dries Devenyns, Belgian cyclist\n*  1983   – Steven Jackson, American football player\n*  1983   – Andreas Ulvo, Norwegian pianist \n*1984 – Stewart Downing, English footballer\n*1985 – Jessica Abbott, Australian swimmer\n*  1985   – Takudzwa Ngwenya, Zimbabwean-American rugby player\n*  1985   – Akira Tozawa, Japanese wrestler\n*1986 – Steve Johnson, American football player\n*1987 – Charlotte Kalla, Swedish skier\n*1988 – William Buick, Norwegian-British flat jockey\n*  1988   – Paul Coutts, Scottish footballer\n*  1988   – Thomas Kraft, German footballer\n*  1988   – Sercan Temizyürek, Turkish footballer\n*1989 – Keegan Allen, American actor, photographer and musician\n*1991 – Matty James, English footballer\n*1992 – Anja Aguilar, Filipino actress and singer\n*  1992   – Selena Gomez, American singer and actress\n*1993 – Dzhokhar Tsarnaev, Kyrgyzstani-American terrorist\n*1994 – Jaz Sinclair, American film and television actress\n*1995 – Ezekiel Elliott, American football player\n*2002 – Prince Felix of Denmark\n*2013 – Prince George of Cambridge\n\nDeaths\n\n* 698 – Wu Chengsi, nephew of Chinese sovereign Wu Zetian\n*1258 – Meinhard I, Count of Gorizia-Tyrol (b. c. 1200)\n*1274 – Henry I of Navarre, Count of Champagne and Brie and King of Navarre\n*1298 – Sir John de Graham, Scottish soldier at the Battle of Falkirk\n*1362 – Louis, Count of Gravina (b. 1324)\n*1376 – Simon Langham, Archbishop of Canterbury (b. 1310)\n*1387 – Frans Ackerman, Flemish politician (b. 1330)\n*1461 – Charles VII of France (b. 1403)\n*1525 – Richard Wingfield, English courtier and diplomat, Chancellor of the Duchy of Lancaster (b. 1426)\n*1540 – John Zápolya, Hungarian king (b. 1487)\n*1550 – Jorge de Lencastre, Duke of Coimbra (b. 1481)\n*1581 – Richard Cox, English bishop (b. 1500)\n*1619 – Lawrence of Brindisi, Italian priest and saint (b. 1559)\n*1645  – Gaspar de Guzmán, Count-Duke of Olivares, Spanish statesman (b. 1587)\n*1676 – Pope Clement X (b. 1590)\n*1726 – Hugh Drysdale, English-American politician, Colonial Governor of Virginia\n*1734 – Peter King, 1st Baron King, English lawyer and politician, Lord Chancellor of England (b. 1669)\n*1789 – Joseph Foullon de Doué, French politician, Controller-General of Finances (b. 1715)\n*1802 – Marie François Xavier Bichat, French anatomist and physiologist (b. 1771)\n*1824 – Thomas Macnamara Russell, English admiral\n*1826 – Giuseppe Piazzi, Italian mathematician and astronomer (b. 1746)\n*1832 – Napoleon II, French emperor (b. 1811)\n*1833 – Joseph Forlenze, Italian ophthalmologist and surgeon (b. 1757)\n*1864 – James B. McPherson, American general (b. 1828)\n*1869 – John A. Roebling, German-American engineer, designed the Brooklyn Bridge (b. 1806)\n*1902 – Mieczysław Halka-Ledóchowski, Polish cardinal (b. 1822)\n*1903 – Cassius Marcellus Clay, American publisher, lawyer, and politician, United States Ambassador to Russia (b. 1810)\n*1904 – Wilson Barrett, English actor and playwright (b. 1846)\n*1906 – William Snodgrass, Canadian minister and academic (b. 1827)\n*1908 – Randal Cremer, English politician, Nobel Prize laureate (b. 1828)\n*1915 – Sandford Fleming, Scottish-Canadian engineer and inventor, developed Standard time (b. 1827)\n*1916 – James Whitcomb Riley, American poet and author (b. 1849)\n*1918 – Indra Lal Roy, Indian lieutenant and pilot (b. 1898)\n*1920 – William Kissam Vanderbilt, American businessman and horse breeder (b. 1849)\n*1922 – Jokichi Takamine, Japanese-American chemist and academic (b. 1854)\n*1932 – J. Meade Falkner, English author and poet (b. 1858)\n*  1932   – Reginald Fessenden, Canadian inventor and academic (b. 1866)\n*  1932   – Errico Malatesta, Italian activist and author (b. 1853)\n*  1932   – Flo Ziegfeld, American actor and producer (b. 1867)\n*1934 – John Dillinger, American gangster (b. 1903)\n*1937 – Ted McDonald, Australian cricketer and footballer (b. 1891)\n*1940 – George Fuller, Australian politician, 22nd Premier of New South Wales (b. 1861)\n*  1940   – Albert Young, American boxer and promoter (b. 1877)\n*1948 – Rūdolfs Jurciņš, Latvian basketball player (b. 1909) \n*1950 – William Lyon Mackenzie King, Canadian economist and politician, 10th Prime Minister of Canada (b. 1874)\n*1958 – Mikhail Zoshchenko, Ukrainian-Russian soldier and author (b. 1895)\n*1967 – Carl Sandburg, American poet and historian (b. 1878)\n*1968 – Giovannino Guareschi, Italian journalist and cartoonist (b. 1908)\n*1970 – George Johnston, Australian journalist and author (b. 1912)\n*1974 – Wayne Morse, American lawyer and politician (b. 1900)\n*1979 – J. V. Cain, American football player (b. 1951)\n*  1979   – Sándor Kocsis, Hungarian footballer and manager (b. 1929)\n*1986 – Floyd Gottfredson, American author and illustrator (b. 1905)\n*  1986   – Ede Staal, Dutch singer-songwriter (b. 1941)\n*1987 – Fahrettin Kerim Gökay, Turkish physician and politician, Turkish Minister of Health (b. 1900)\n*1990 – Manuel Puig, Argentinian author, playwright, and screenwriter (b. 1932)\n*  1990   – Eduard Streltsov, Soviet footballer (b. 1937)\n*1992 – David Wojnarowicz, American painter, photographer, and activist (b. 1954)\n*1995 – Harold Larwood, English-Australian cricketer (b. 1904)\n*1996 – Rob Collins, English keyboard player (b. 1956)\n*1998 – Fritz Buchloh, German footballer and coach (b. 1909)\n*2000 – Eric Christmas, English-born Canadian actor (b. 1916)\n*  2000   – Carmen Martín Gaite, Spanish author, poet, and playwright (b. 1925)\n*  2000   – Raymond Lemieux, Canadian chemist and academic (b. 1920)\n*  2000   – Claude Sautet, French director and screenwriter (b. 1924)\n*2001 – Indro Montanelli, Italian journalist and historian (b. 1909)\n*2004 – Sacha Distel, French singer and guitarist (b. 1933)\n*  2004   – Illinois Jacquet, American saxophonist and composer (b. 1922)\n*2005 – Eugene Record, American singer-songwriter and producer (b. 1940)\n*2006 – Dika Newlin, American composer, singer-songwriter, and pianist (d. 1923)\n*  2006   – José Antonio Delgado, Venezuelan mountaineer (b. 1965)\n*2007 – Mike Coolbaugh, American baseball player and coach (b. 1972)\n*  2007   – Jarrod Cunningham, New Zealand rugby player (b. 1968)\n*  2007   – László Kovács, Hungarian-American director and cinematographer (b. 1933)\n*  2007   – Rollie Stiles, American baseball player (b. 1906)\n*2008 – Estelle Getty, American actress (b. 1923)\n*2009 – Richard M. Givan, American lawyer and judge (b. 1921)\n*  2009   – Peter Krieg, German director, producer, and screenwriter (b. 1947)\n*2010 – Kenny Guinn, American banker and politician, 27th Governor of Nevada (b. 1936)\n*2011 – Linda Christian, Mexican-American actress (b. 1923)\n*  2011   – Cees de Wolf, Dutch footballer (b. 1945)\n*2012 – Ding Guangen, Chinese engineer and politician (b. 1929)\n*  2012   – George Armitage Miller, American psychologist and academic (b. 1920)\n*  2012   – Frank Pierson, American director and screenwriter (b. 1925)\n*2013 – Natalie de Blois, American architect, co-designed the Lever House (b. 1921)\n*  2013   – Dennis Farina, American policeman and actor (b. 1944)\n*  2013   – Lawrie Reilly, Scottish footballer (b. 1928)\n*  2013   – Rosalie E. Wahl, American lawyer and judge (b. 1924)\n*2014 – Johann Breyer, German SS officer (b. 1925)\n*  2014   – Louis Lentin, Irish director and producer (b. 1933)\n*  2014   – Nitzan Shirazi, Israeli footballer and manager (b. 1971)\n\nHolidays and observances\n\n*Birthday of the Late King Sobhuza (Swaziland)\n*Christian feast day:\n**Abd-al-Masih\n**Joseph of Tiberias (or of Palestine)\n**Markella\n**Mary Magdalene\n**Nohra (Maronite Church)\n**July 22 (Eastern Orthodox liturgics)\n*Earliest day on which Parents' Day can fall, while 28 July is the latest; celebrated on the fourth Sunday in July. (United States)\n*National Press Day (Azerbaijan)\n*Pi Approximation Day, see also March 14\n*Ratcatcher's Day\n*Revolution Day (The Gambia)\n*Sarawak Self-government Day (Sarawak, Malaysia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "July 22" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15996" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 838 – Battle of Anzen: The Byzantine emperor Theophilos suffers a heavy defeat by the Abbasids.\n*1099 – First Crusade: Godfrey of Bouillon is elected the first Defender of the Holy Sepulchre of The Kingdom of Jerusalem.\n*1209 – Massacre at Béziers: The first major military action of the Albigensian Crusade.\n*1298 – Wars of Scottish Independence: Battle of Falkirk: King Edward I of England and his longbowmen defeat William Wallace and his Scottish schiltrons outside the town of Falkirk.\n*1443 – Battle of St. Jakob an der Sihl in the Old Zürich War. \n*1456 – Ottoman wars in Europe: Siege of Belgrade: John Hunyadi, Regent of the Kingdom of Hungary, defeats Mehmet II of the Ottoman Empire\n*1484 – Battle of Lochmaben Fair: A 500-man raiding party led by Alexander Stewart, Duke of Albany and James Douglas, 9th Earl of Douglas are defeated by Scots forces loyal to Albany's brother James III of Scotland; Douglas is captured.\n*1499 – Battle of Dornach: The Swiss decisively defeat the army of Maximilian I, Holy Roman Emperor.\n*1587 – Roanoke Colony: A second group of English settlers arrives on Roanoke Island off North Carolina to re-establish the deserted colony.\n* 1598 – William Shakespeare’s play The Merchant of Venice is entered on the Stationers’ Register. By decree of Queen Elizabeth, the Stationers’ Register licensed printed works, giving the Crown tight control over all published material.\n*1686 – Albany, New York is formally chartered as a municipality by Governor Thomas Dongan.\n*1706 – The Acts of Union 1707 are agreed upon by commissioners from the Kingdom of England and the Kingdom of Scotland, which, when passed by each countries' Parliaments, led to the creation of the Kingdom of Great Britain.\n*1793 – Alexander Mackenzie reaches the Pacific Ocean becoming the first recorded human to complete a transcontinental crossing of North America.\n*1796 – Surveyors of the Connecticut Land Company name an area in Ohio \"Cleveland\" after Gen. Moses Cleaveland, the superintendent of the surveying party.\n*1797 – Battle of Santa Cruz de Tenerife: Battle between Spanish and British naval forces during the French Revolutionary Wars. During the Battle, Rear-Admiral Nelson is wounded in the arm and the arm had to be partially amputated.\n*1802 – Emperor Gia Long conquers Hanoi and unified Viet Nam, which had experienced centuries of feudal warfare.\n*1805 – Napoleonic Wars: War of the Third Coalition: Battle of Cape Finisterre: An inconclusive naval action is fought between a combined French and Spanish fleet under Admiral Pierre-Charles Villeneuve of Spain and a British fleet under Admiral Robert Calder.\n*1812 – Napoleonic Wars: Peninsular War: Battle of Salamanca: British forces led by Arthur Wellesley (later the Duke of Wellington) defeat French troops near Salamanca, Spain.\n*1864 – American Civil War: Battle of Atlanta: Outside Atlanta, Confederate General John Bell Hood leads an unsuccessful attack on Union troops under General William T. Sherman on Bald Hill.\n*1893 – Katharine Lee Bates writes America the Beautiful after admiring the view from the top of Pikes Peak near Colorado Springs, Colorado.\n*1894 – The first ever motor race is held in France between the cities of Paris and Rouen. The fastest finisher was the Comte Jules-Albert de Dion, but the 'official' victory was awarded to Albert Lemaître driving his 3 hp petrol engined Peugeot.\n*1916 – Preparedness Day Bombing: In San Francisco, a bomb explodes on Market Street during a parade, killing ten and injuring 40.\n*1933 – Aviator Wiley Post returns to Floyd Bennett Field in New York City, completing the first solo flight around the world in seven days, 18 hours and 49 minutes.\n*1937 – New Deal: The United States Senate votes down President Franklin D. Roosevelt's proposal to add more justices to the Supreme Court of the United States.\n*1942 – The United States government begins compulsory civilian gasoline rationing due to the wartime demands.\n*  1942   – Holocaust: The systematic deportation of Jews from the Warsaw Ghetto begins.\n*1943 – World War II: Allied forces capture the Italian city of Palermo.\n*  1943   – World War II: Axis occupation forces violently disperse a massive protest in Athens, killing 22.\n*1944 – The Polish Committee of National Liberation publishes its manifesto, starting the period of Communist rule in Poland\n*1946 – King David Hotel bombing: A Zionist underground organisation, the Irgun, bombs the King David Hotel in Jerusalem, site of the civil administration and military headquarters for Mandatory Palestine, resulting in 91 deaths.\n*1962 – Mariner program: Mariner 1 spacecraft flies erratically several minutes after launch and has to be destroyed.\n*1963 – Crown Colony of Sarawak gains self-governance.\n*1976 – Japan completes its last reparation to the Philippines for war crimes committed during imperial Japan's conquest of the country in the Second World War.\n*1977 – Chinese leader Deng Xiaoping is restored to power.\n*1983 – Martial law in Poland is officially revoked.\n*1990 – Greg LeMond, an American road racing cyclist, wins his third Tour de France after leading the majority of the race. It was LeMond’s second consecutive Tour de France victory.\n*1992 – Near Medellín, Colombian drug lord Pablo Escobar escapes from his luxury prison fearing extradition to the United States.\n*1993 – Great Flood of 1993: Levees near Kaskaskia, Illinois rupture, forcing the entire town to evacuate by barges operated by the Army Corps of Engineers.\n*1995 – The Hale-Bopp comet is discovered by Alan Hale and Thomas Bopp.\n*1997 – The second Blue Water Bridge opens between Port Huron, Michigan and Sarnia, Ontario.\n*2003 – Members of 101st Airborne of the United States, aided by Special Forces, attack a compound in Iraq, killing Saddam Hussein's sons Uday and Qusay, along with Mustapha Hussein, Qusay's 14-year-old son, and a bodyguard.\n*2005 – Jean Charles de Menezes is killed by police as the hunt begins for the London Bombers responsible for the 7 July 2005 London bombings and the 21 July 2005 London bombings.\n*2011 – Norway is the victim of twin terror attacks, the first being a bomb blast which targeted government buildings in central Oslo, the second being a massacre at a youth camp on the island of Utøya.\n*2013 – A series of earthquakes in Dingxi, China, kills at least 89 people and injures more than 500 others.\n\nBirths\n\n*1210 – Joan of England, Queen of Scotland (d. 1238)\n*1437 – John Scrope, 5th Baron Scrope of Bolton, English Baron (d. 1498)\n*1476 – Zhu Youyuan, Ming Dynasty politician (d. 1519)\n*1478 – Philip I of Castile (d. 1506)\n*1531 – Leonhard Thurneysser, scholar and elector of Brandenburg (d. 1595)\n*1535 – Katarina Stenbock, queen of Gustav I of Sweden (d. 1621)\n*1552 – Anthony Browne, Sheriff of Surrey and Kent (d. 1592)\n*  1552   – Mary Wriothesley, Countess of Southampton, Lady of English peer and others (d. 1607)\n*1559 – Lawrence of Brindisi, Italian priest and saint (d. 1619)\n*1615 – Marguerite of Lorraine, princess of Lorraine, duchess of Orléans (d. 1672)\n*1618 – Johan Nieuhof, Dutch traveler (d. 1672)\n*1621 – Anthony Ashley Cooper, 1st Earl of Shaftesbury, English politician, Lord Chancellor of the United Kingdom (d. 1683)\n*1630 – Madame de Brinvilliers, French aristocrat (d. 1676)\n*1647 – Margaret Mary Alacoque, French nun, mystic and saint (d. 1690)\n*1651 – Ferdinand Tobias Richter, Austrian organist and composer (d. 1711)\n*1711 – Georg Wilhelm Richmann, German-Russian physicist and academic (d. 1753)\n*1713 – Jacques-Germain Soufflot, French architect, designed the Panthéon (d. 1780)\n*1733 – Mikhail Shcherbatov, Russian philosopher and historian (d. 1790)\n*1755 – Gaspard de Prony, French mathematician and engineer (d. 1839)\n*1784 – Friedrich Bessel, German mathematician and astronomer (d. 1846)\n*1839 – Jakob Hurt, Estonian theologist and linguist (d. 1907)\n*1844 – William Archibald Spooner, English priest and scholar (d. 1930)\n*1848 – Adolphus Frederick V, Grand Duke of Mecklenburg-Strelitz (d. 1914)\n*1849 – Emma Lazarus, American poet and educator (d. 1887)\n*1856 – Octave Hamelin, French philosopher (d. 1907)\n*1862 – Cosmo Duff-Gordon, Scottish fencer (d. 1931)\n*1863 – Alec Hearne, English cricketer (d. 1952)\n*1878 – Janusz Korczak, Polish pediatrician and author (d. 1942)\n*1881 – Augusta Fox Bronner, American psychologist, specialist in juvenile psychology (d. 1966)\n*1882 – Edward Hopper, American painter and etcher (d. 1967)\n*1884 – Odell Shepard, American poet and politician, 66th Lieutenant Governor of Connecticut (d. 1967)\n*1886 – Hella Wuolijoki, Estonian-Finnish author (d. 1954)\n*1887 – Gustav Ludwig Hertz, German physicist and academic, Nobel Prize laureate (d. 1975)\n*1888 – Kirk Bryan, American geologist and academic (d. 1950)\n*  1888   – Selman Waksman, Jewish-American biochemist and microbiologist, Nobel Prize laureate (d. 1973)\n*1889 – James Whale, English director (d. 1957)\n*1890 – Rose Kennedy, American philanthropist (d. 1995)\n*1892 – Jack MacBryan, English cricketer and field hockey player (d. 1983)\n*1893 – Jesse Haines, American baseball player and coach (d. 1978)\n*  1893   – Karl Menninger, American psychiatrist and author (d. 1990)\n*1895 – León de Greiff, Colombian poet, journalist, and diplomat (d. 1976)\n*1898 – Stephen Vincent Benét, American poet, short story writer, and novelist (d. 1943)\n*1899 – Sobhuza II of Swaziland (d. 1982)\n*1908 – Amy Vanderbilt, American author (d. 1974)\n*1909 – Licia Albanese, Italian-American soprano and actress (d. 2014)\n*  1909   – Dorino Serafini, Italian race car driver (d. 2000)\n*1910 – Ruthie Tompson, American animator and artist\n*1913 – Gorni Kramer, Italian bassist, songwriter, and bandleader (d. 1995)\n*1915 – Shaista Suhrawardy Ikramullah, Indian-Pakistani politician and diplomat (d. 2000)\n*1916 – Gino Bianco, Brazilian race car driver (d. 1984)\n*  1916   – Marcel Cerdan, French boxer (d. 1949)\n*1921 – William V. Roth Jr., American lawyer and politician (d. 2003)\n*1923 – Bob Dole, American soldier, lawyer, and politician\n*  1923   – César Fernández Ardavín, Spanish director, producer, and screenwriter (d. 2012)\n*1924 – Margaret Whiting, American singer (d. 2011)\n*1925 – Jack Matthews, American author, playwright, and academic (d. 2013)\n*  1925   – Joseph Sargent, American actor, director, and producer (d. 2014)\n*1926 – Bryan Forbes, English actor, director, producer, and screenwriter (d. 2013)\n*  1926   – Wolfgang Iser, German scholar, literary theorist (d. 2007)\n*1927 – Johan Ferner, Norwegian sailor (d. 2015)\n*1928 – Orson Bean, American actor\n*  1928   – Jimmy Hill, English footballer, manager, and sportscaster (d. 2015)\n*1929 – John Barber, English race car driver\n*  1929   – Leonid Stolovich, Russian-Estonian philosopher and academic (d. 2013)\n*  1929   – Neil Welliver, American painter (d. 2005)\n*1931 – Leo Labine, Canadian ice hockey player (d. 2005)\n*1932 – Oscar de la Renta, Dominican-American fashion designer (d. 2014)\n*  1932   – Tom Robbins, American novelist\n*1934 – Junior Cook, American saxophonist (d. 1992)  \n*  1934   – Louise Fletcher, American actress\n*1935 – Tom Cartwright, English-Welsh cricketer and coach (d. 2007)\n*1936 – Don Patterson, American organist (d. 1988) \n*  1936   – Harold Rhodes, English cricketer\n*  1936   – Geraldine Claudette Darden, American mathematician\n*1937 – Chuck Jackson, American R&B singer and songwriter\n*  1937   – Yasuhiro Kojima, Japanese-American wrestler and manager (d. 1999)\n*  1937   – John Price, English cricketer\n*  1937   – Vasant Ranjane, Indian cricketer (d. 2011)\n*1938 – Terence Stamp, English actor\n*1940 – Judith Walzer Leavitt, American historian and academic\n*  1940   – Alex Trebek, Canadian-American game show host and producer\n*1941 – Estelle Bennett, American singer (d. 2009)\n*  1941   – Vaughn Bodē, American illustrator (d. 1975)\n*  1941   – George Clinton, American singer-songwriter and producer\n*  1941   – David M. Kennedy, American historian and author\n*1942 – Michael Abney-Hastings, 14th Earl of Loudoun, English-Australian politician (d. 2012)\n*  1942   – Peter Habeler, Austrian mountaineer and skier\n*  1942   – Les Johns, Australian rugby league player and coach\n*1943 – Masaru Emoto, Japanese author and activist (d. 2014)\n*  1943   – Kay Bailey Hutchison, American lawyer and politician\n*  1943   – Bobby Sherman, American singer-songwriter and actor\n*1944 – Rick Davies, English singer-songwriter and keyboard player \n*  1944   – Sparky Lyle, American baseball player and manager\n*  1944   – Anand Satyanand, New Zealand lawyer, judge, and politician, 19th Governor-General of New Zealand\n*1945 – Philip Cohen, English biochemist and academic\n*1946 – Danny Glover, American actor, director, and producer\n*  1946   – Paul Schrader, American director and screenwriter\n*  1946   – Rolando Joven Tria Tirona, Filipino archbishop\n*  1946   – Johnson Toribiong, Palauan lawyer and politician, 7th President of Palau\n*1947 – Albert Brooks, American actor, comedian, director, and screenwriter\n*  1947   – Gilles Duceppe, Canadian politician\n*  1947   – Don Henley, American singer-songwriter and drummer \n*1949 – Alan Menken, American pianist and composer\n*  1949   – Lasse Virén, Finnish runner and police officer\n*1950 – S. E. Hinton, American Author\n*1951 – Richard Bennett, American guitarist and producer \n*  1951   – J. V. Cain, American football player (d. 1979)\n*  1951   – Patriarch Daniel of Romania\n*1953 – Brian Howe, English singer-songwriter \n*1954 – Al Di Meola, American guitarist, songwriter, and producer \n*  1954   – Steve LaTourette, American lawyer and politician (d. 2016)\n*  1954   – Lonette McKee, American actress and singer\n*  1954   – Ingrid Daubechies, Belgian physicist and mathematician\n*1955 – Richard J. Corman, American businessman, founded the R.J. Corman Railroad Group (d. 2013)\n*  1955   – Willem Dafoe, American actor\n*1956 – Mick Pointer, English neo-progressive rock drummer (Marillion; Arena)\n*  1956   – Scott Sanderson, American baseball player and sportscaster\n*1957 – Dave Stieb, American baseball player\n*1958 – Tatsunori Hara, Japanese baseball player and coach\n*  1958   – David Von Erich, American wrestler (d. 1984)\n*1960 – Jon Oliva, American singer-songwriter and keyboard player \n*1961 – Calvin Fish, English race car driver and sportscaster\n*  1961   – Keith Sweat, American singer-songwriter and producer \n*1962 – Alvin Robertson, American basketball player\n*  1962   – Martine St. Clair, Canadian singer and actress\n*1963 – Emilio Butragueño, Spanish footballer\n*  1963   – Emily Saliers, American singer-songwriter and musician \n*1964 – Will Calhoun, American rock drummer (Living Colour)\n*  1964   – Bonnie Langford, English actress and dancer\n*  1964   – John Leguizamo, Colombian-American actor, producer, and screenwriter\n*  1964   – David Spade, American actor, producer, and screenwriter\n*1965 – Derrick Dalley, Canadian educator and politician\n*  1965   – Shawn Michaels, American wrestler, trainer, and actor\n*  1965   – Richard B. Poore, New Zealand humanitarian\n*  1965   – Doug Riesenberg, American football player and coach\n*1966 – Tim Brown, American football player and manager\n*1967 – Lauren Booth, English journalist and activist\n*1968 – Rhys Ifans, Welsh actor \n*1969 – Despina Vandi, German-Greek singer and actress\n*1970 – Jason Becker, American guitarist and songwriter \n*  1970   – Steve Carter, Australian rugby league player \n*  1970   – Devendra Fadnavis, Indian lawyer and politician, 18th Chief Minister of Maharashtra\n*  1970   – Sergei Zubov, Russian ice hockey player and coach\n*1972 – Colin Ferguson, Canadian actor, director, and producer\n*  1972   – Seth Fisher, American illustrator (d. 2006)\n*  1972   – Keyshawn Johnson, American football player and sportscaster\n*1973 – Brian Chippendale, American singer and drummer \n*  1973   – Daniel Jones, English-Australian guitarist, songwriter, and producer \n*  1973   – Mike Sweeney, American baseball player and sportscaster\n*  1973   – Ece Temelkuran, Turkish journalist and author\n*  1973   – Rufus Wainwright, American-Canadian singer-songwriter\n*1974 – Franka Potente, German actress \n*1977 – Ezio Galon, Italian rugby player\n*  1977   – Ingo Hertzsch, German footballer\n*  1977   – Gustavo Nery, Brazilian footballer\n*1978 – Martyn Lee, English radio host and producer\n*  1978   – Runako Morton, Nevisian cricketer (d. 2012)\n*  1978   – Dennis Rommedahl, Danish footballer\n*1979 – Anna Bieleń-Żarska, Polish tennis player\n*  1979   – Lucas Luhr, German race car driver\n*  1979   – Yadel Martí, Cuban baseball player\n*1980 – Dirk Kuyt, Dutch footballer\n*  1980   – Kate Ryan, Belgian singer-songwriter\n*  1980   – Tablo, South Korean-Canadian rapper\n*1982 – Nuwan Kulasekara, Sri Lankan cricketer\n*1983 – Aldo de Nigris, Mexican footballer\n*  1983   – Dries Devenyns, Belgian cyclist\n*  1983   – Steven Jackson, American football player\n*  1983   – Andreas Ulvo, Norwegian pianist \n*1984 – Stewart Downing, English footballer\n*1985 – Jessica Abbott, Australian swimmer\n*  1985   – Takudzwa Ngwenya, Zimbabwean-American rugby player\n*  1985   – Akira Tozawa, Japanese wrestler\n*1986 – Steve Johnson, American football player\n*1987 – Charlotte Kalla, Swedish skier\n*1988 – William Buick, Norwegian-British flat jockey\n*  1988   – Paul Coutts, Scottish footballer\n*  1988   – Thomas Kraft, German footballer\n*  1988   – Sercan Temizyürek, Turkish footballer\n*1989 – Keegan Allen, American actor, photographer and musician\n*1991 – Matty James, English footballer\n*1992 – Anja Aguilar, Filipino actress and singer\n*  1992   – Selena Gomez, American singer and actress\n*1993 – Dzhokhar Tsarnaev, Kyrgyzstani-American terrorist\n*1994 – Jaz Sinclair, American film and television actress\n*1995 – Ezekiel Elliott, American football player\n*2002 – Prince Felix of Denmark\n*2013 – Prince George of Cambridge\n\nDeaths\n\n* 698 – Wu Chengsi, nephew of Chinese sovereign Wu Zetian\n*1258 – Meinhard I, Count of Gorizia-Tyrol (b. c. 1200)\n*1274 – Henry I of Navarre, Count of Champagne and Brie and King of Navarre\n*1298 – Sir John de Graham, Scottish soldier at the Battle of Falkirk\n*1362 – Louis, Count of Gravina (b. 1324)\n*1376 – Simon Langham, Archbishop of Canterbury (b. 1310)\n*1387 – Frans Ackerman, Flemish politician (b. 1330)\n*1461 – Charles VII of France (b. 1403)\n*1525 – Richard Wingfield, English courtier and diplomat, Chancellor of the Duchy of Lancaster (b. 1426)\n*1540 – John Zápolya, Hungarian king (b. 1487)\n*1550 – Jorge de Lencastre, Duke of Coimbra (b. 1481)\n*1581 – Richard Cox, English bishop (b. 1500)\n*1619 – Lawrence of Brindisi, Italian priest and saint (b. 1559)\n*1645  – Gaspar de Guzmán, Count-Duke of Olivares, Spanish statesman (b. 1587)\n*1676 – Pope Clement X (b. 1590)\n*1726 – Hugh Drysdale, English-American politician, Colonial Governor of Virginia\n*1734 – Peter King, 1st Baron King, English lawyer and politician, Lord Chancellor of England (b. 1669)\n*1789 – Joseph Foullon de Doué, French politician, Controller-General of Finances (b. 1715)\n*1802 – Marie François Xavier Bichat, French anatomist and physiologist (b. 1771)\n*1824 – Thomas Macnamara Russell, English admiral\n*1826 – Giuseppe Piazzi, Italian mathematician and astronomer (b. 1746)\n*1832 – Napoleon II, French emperor (b. 1811)\n*1833 – Joseph Forlenze, Italian ophthalmologist and surgeon (b. 1757)\n*1864 – James B. McPherson, American general (b. 1828)\n*1869 – John A. Roebling, German-American engineer, designed the Brooklyn Bridge (b. 1806)\n*1902 – Mieczysław Halka-Ledóchowski, Polish cardinal (b. 1822)\n*1903 – Cassius Marcellus Clay, American publisher, lawyer, and politician, United States Ambassador to Russia (b. 1810)\n*1904 – Wilson Barrett, English actor and playwright (b. 1846)\n*1906 – William Snodgrass, Canadian minister and academic (b. 1827)\n*1908 – Randal Cremer, English politician, Nobel Prize laureate (b. 1828)\n*1915 – Sandford Fleming, Scottish-Canadian engineer and inventor, developed Standard time (b. 1827)\n*1916 – James Whitcomb Riley, American poet and author (b. 1849)\n*1918 – Indra Lal Roy, Indian lieutenant and pilot (b. 1898)\n*1920 – William Kissam Vanderbilt, American businessman and horse breeder (b. 1849)\n*1922 – Jokichi Takamine, Japanese-American chemist and academic (b. 1854)\n*1932 – J. Meade Falkner, English author and poet (b. 1858)\n*  1932   – Reginald Fessenden, Canadian inventor and academic (b. 1866)\n*  1932   – Errico Malatesta, Italian activist and author (b. 1853)\n*  1932   – Flo Ziegfeld, American actor and producer (b. 1867)\n*1934 – John Dillinger, American gangster (b. 1903)\n*1937 – Ted McDonald, Australian cricketer and footballer (b. 1891)\n*1940 – George Fuller, Australian politician, 22nd Premier of New South Wales (b. 1861)\n*  1940   – Albert Young, American boxer and promoter (b. 1877)\n*1948 – Rūdolfs Jurciņš, Latvian basketball player (b. 1909) \n*1950 – William Lyon Mackenzie King, Canadian economist and politician, 10th Prime Minister of Canada (b. 1874)\n*1958 – Mikhail Zoshchenko, Ukrainian-Russian soldier and author (b. 1895)\n*1967 – Carl Sandburg, American poet and historian (b. 1878)\n*1968 – Giovannino Guareschi, Italian journalist and cartoonist (b. 1908)\n*1970 – George Johnston, Australian journalist and author (b. 1912)\n*1974 – Wayne Morse, American lawyer and politician (b. 1900)\n*1979 – J. V. Cain, American football player (b. 1951)\n*  1979   – Sándor Kocsis, Hungarian footballer and manager (b. 1929)\n*1986 – Floyd Gottfredson, American author and illustrator (b. 1905)\n*  1986   – Ede Staal, Dutch singer-songwriter (b. 1941)\n*1987 – Fahrettin Kerim Gökay, Turkish physician and politician, Turkish Minister of Health (b. 1900)\n*1990 – Manuel Puig, Argentinian author, playwright, and screenwriter (b. 1932)\n*  1990   – Eduard Streltsov, Soviet footballer (b. 1937)\n*1992 – David Wojnarowicz, American painter, photographer, and activist (b. 1954)\n*1995 – Harold Larwood, English-Australian cricketer (b. 1904)\n*1996 – Rob Collins, English keyboard player (b. 1956)\n*1998 – Fritz Buchloh, German footballer and coach (b. 1909)\n*2000 – Eric Christmas, English-born Canadian actor (b. 1916)\n*  2000   – Carmen Martín Gaite, Spanish author, poet, and playwright (b. 1925)\n*  2000   – Raymond Lemieux, Canadian chemist and academic (b. 1920)\n*  2000   – Claude Sautet, French director and screenwriter (b. 1924)\n*2001 – Indro Montanelli, Italian journalist and historian (b. 1909)\n*2004 – Sacha Distel, French singer and guitarist (b. 1933)\n*  2004   – Illinois Jacquet, American saxophonist and composer (b. 1922)\n*2005 – Eugene Record, American singer-songwriter and producer (b. 1940)\n*2006 – Dika Newlin, American composer, singer-songwriter, and pianist (d. 1923)\n*  2006   – José Antonio Delgado, Venezuelan mountaineer (b. 1965)\n*2007 – Mike Coolbaugh, American baseball player and coach (b. 1972)\n*  2007   – Jarrod Cunningham, New Zealand rugby player (b. 1968)\n*  2007   – László Kovács, Hungarian-American director and cinematographer (b. 1933)\n*  2007   – Rollie Stiles, American baseball player (b. 1906)\n*2008 – Estelle Getty, American actress (b. 1923)\n*2009 – Richard M. Givan, American lawyer and judge (b. 1921)\n*  2009   – Peter Krieg, German director, producer, and screenwriter (b. 1947)\n*2010 – Kenny Guinn, American banker and politician, 27th Governor of Nevada (b. 1936)\n*2011 – Linda Christian, Mexican-American actress (b. 1923)\n*  2011   – Cees de Wolf, Dutch footballer (b. 1945)\n*2012 – Ding Guangen, Chinese engineer and politician (b. 1929)\n*  2012   – George Armitage Miller, American psychologist and academic (b. 1920)\n*  2012   – Frank Pierson, American director and screenwriter (b. 1925)\n*2013 – Natalie de Blois, American architect, co-designed the Lever House (b. 1921)\n*  2013   – Dennis Farina, American policeman and actor (b. 1944)\n*  2013   – Lawrie Reilly, Scottish footballer (b. 1928)\n*  2013   – Rosalie E. Wahl, American lawyer and judge (b. 1924)\n*2014 – Johann Breyer, German SS officer (b. 1925)\n*  2014   – Louis Lentin, Irish director and producer (b. 1933)\n*  2014   – Nitzan Shirazi, Israeli footballer and manager (b. 1971)\n\nHolidays and observances\n\n*Birthday of the Late King Sobhuza (Swaziland)\n*Christian feast day:\n**Abd-al-Masih\n**Joseph of Tiberias (or of Palestine)\n**Markella\n**Mary Magdalene\n**Nohra (Maronite Church)\n**July 22 (Eastern Orthodox liturgics)\n*Earliest day on which Parents' Day can fall, while 28 July is the latest; celebrated on the fourth Sunday in July. (United States)\n*National Press Day (Azerbaijan)\n*Pi Approximation Day, see also March 14\n*Ratcatcher's Day\n*Revolution Day (The Gambia)\n*Sarawak Self-government Day (Sarawak, Malaysia). July 22. http://en.wikipedia.org/?curid=15996."
  }
}
