{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12537",
  "eid" : "033bff00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514672,
  "textBody" : "Guangzhou (English /ɡwæŋ'dʒəʊ/, ; or;), traditionally romanised as Canton,\"[http://www.britannica.com/EBchecked/topic/93196/Guangzhou Guangzhou (China)]\". Encyclopædia Britannica. Accessed September 12, 2010. is the capital and most populous city of the province of Guangdong in southern China. Located on the Pearl River about 120 km north-northwest of Hong Kong and 145 km north of Macau, Guangzhou has a history of over 2,200 years and was a major terminus of the maritime Silk Road and continues to serve as a major port and transportation hub today.\n\nGuangzhou is situated at the heart of the most-populous built-up metropolitan area in mainland China, an area that extends into the neighboring cities of Foshan, Dongguan, and Shenzhen, forming one of the largest urban agglomerations on the planet. Administratively, the city holds sub-provincial status; and is one of China's five National Central Cities.. In 2015 the city's administrative area was estimated to have a population of 13,501,100. Guangzhou is ranked as an Alpha- Global city. In recent years, there has been a rapidly increasing number of foreign residents and immigrants from Southeast Asia, the Middle East, Eastern Europe, and especially from Africa.[https://www.theguardian.com/world/2010/oct/06/china-crackdown-african-immigration China cracks down on African immigrants and traders], The Guardian, 6 October 2010 This has led to it being dubbed the \"Capital of the Third World\"..[http://m.caijing.com.cn/api/show?contentid\n3702350 广州常住非裔人士或达30万 被称作第三世界首都]. The migrant population from other provinces of China in Guangzhou was 40 percent of the city's total population in 2008. Together with Shanghai, Beijing and Shenzhen, Guangzhou has one of the most expensive real estate markets in China.\n\nGuangzhou has a comparatively recent history of two centuries related to its importance for foreign trade. Long the only Chinese port accessible to  foreign traders, the city fell to the British during the First Opium War. No longer enjoying a monopoly after the war, it lost trade to other ports such as Hong Kong (which is close by) and Shanghai, but continued to serve as a major entrepôt.  In modern commerce, Guangzhou is best known for its annual Canton Fair, the oldest and largest trade fair in China.  For the three consecutive years 2013–2015, Forbes ranked Guangzhou as the best commercial city on the Chinese mainland..\n\nNames \n\nGuǎngzhōu is the pinyin romanisation of the Chinese name , which was simplified in mainland China to  in the 1950s. The name of the city is taken from the ancient Guang Province (Guang Zhou), after it had become the prefecture's seat of government, which is how some other Chinese cities, including Hangzhou, Suzhou and Fuzhou got their names. The character  or —which also appears in the names of the provinces Guangdong and Guangxi, together called the Liangguang—means \"broad\" or \"expansive\" and refers to the intention to dispense imperial grace broadly in the region with the founding of county of Guangxin in Han Dynasty.\n\nBefore acquiring its current name, the town was known as Panyu, a name still borne by one of Guangzhou's districts. The origin of the name is still uncertain, with 11 various explanations being offered, including that it may have referred to two local mountains. The city has also sometimes been known as Guangzhou Fu or Guangfu after its status as the capital of a prefecture. From this latter name, Guangzhou was known to medieval Persians such as Al-Masudi and Ibn Khordadbeh as Khanfu ().. Under the Southern Han, the city was renamed Xingwang.\n\nThe Chinese abbreviation for Guangzhou is , after its nickname \"Rice City\". The city has long borne the nickname  or  from the five stones at the old Temple of the Five Immortals said to have been the sheep or goats ridden by the Taoist culture heroes credited with introducing rice cultivation to the area around the time of the city's foundation. The former name \"City of the Immortals\" came from the same story. The more recent  is usually taken as a simple reference to the area's greenery.\n\nThe English name \"Canton\" derived from Portuguese ' or ', a muddling of dialectical pronunciations of \"Guangdong\" (e.g., Hakka Kóng-tûng). Although it originally and chiefly applied to the walled city, it was also used in English in reference to Guangdong generally. It was adopted as the Postal Map Romanization of Guangzhou and remained in common use until the gradual adoption of pinyin. As an adjective, it is still used in describing the people, language, cuisine and culture of Guangzhou and the surrounding Liangguang region. The 19th-century name \"\" derived from Nanjing dialect of Mandarin and the town's status as a prefectural capital.\n\nHistory \n\nPrehistory \n\nA settlement now known as Nanwucheng was present in the area by . Some traditional Chinese histories placed Nanwucheng's founding during the reign of Ji Yan,.. king of Zhou from 314–256 . It was said to have consisted of little more than a stockade of bamboo and mud.\n\nNanyue \n\nPanyu was established on the east bank of the Pearl River in 214  to serve as a base for the Qin Empire's first failed invasion of the Baiyue lands in southern China. Legendary accounts claimed the soldiers at Panyu were so vigilant that they did not remove their armor for three years. Upon the fall of the Qin, General Zhao Tuo established his own kingdom of Nanyue and made Panyu its capital in 204 . It remained independent through the Chu-Han Contention, although Zhao negotiated recognition of his independence in exchange for his nominal submission to the Han in 196 . Archaeological evidence shows that Panyu was an expansive commercial centre: in addition to items from central China, archaeologists have found remains originating from Southeast Asia, India, and even Africa. Zhao Tuo was succeeded by Zhao Mo and then Zhao Yingqi. Upon Zhao Yingqi's death in , his younger son Zhao Xing was named as his successor in violation of Chinese primogeniture. By , his Chinese mother, the Empress Dowager Jiu () had prevailed upon him to submit Nanyue as a formal part of the Han Empire. The native prime minister Lü Jia () launched a coup, killing Han ambassadors along with the king, his mother, and their supporters. A successful ambush then annihilated a Han force which had been sent to arrest him. The enraged Emperor Wu launched a massive river- and sea-borne invasion: six armies under Lu Bode and Yang Pu. took Panyu and annexed Nanyue by the end of 111 .\n\nImperial China \n\nIncorporated into the Han Empire, Panyu became a provincial capital. In  226, it became the seat of Guang Prefecture, which gave it its modern name. The Old Book of Tang described Guangzhou as important port in southern China.刘煦.旧唐书·王方庆传〔M〕.北京：中华书局，1975 Direct routes connected the Middle East and China, as shown in records of a Chinese prisoner returning home from Iraq twelve years after his capture at Talas. Relations were not always peaceful: Muslims sacked the city on 30 October 758. and were massacred by the Chinese rebel Huang Chao in 878, along with the city's Jews, Christians, and Parsis.\n\nAmid the Five Dynasties and Ten Kingdoms that followed the collapse of the Tang Dynasty, the Later Liang governor Liu Yan used his base at Panyu to establish a \"Great Yue\" or \"Southern Han\" empire, which lasted from 917 to 971. The region enjoyed considerable cultural and economic success in this period. From the 10th to 12th century, there are records that the large foreign communities were not exclusively male, but included \"Persian women\"... Guangzhou was visited by the Moroccan traveler Ibn Battuta during his 14th-century journey around the world; he detailed the process by which the Chinese constructed their large ships in the port's shipyards.\n\nShortly after the Hongwu Emperor's declaration of the Ming Dynasty, he reversed his earlier support of foreign trade and imposed the first of a series of sea bans (haijin). These banned private foreign trade upon penalty of death for the merchant and exile for his family and neighbors. The Yuan-era maritime intendancies of Guangzhou, Quanzhou, and Ningbo were closed in 1384 and legal trade became limited to the tribute delegations sent to or by official representatives of foreign governments. The policies exacerbated \"Japanese\" pirate (the nanbu) attacks in the area until their removal in 1567.\n\nFollowing the Portuguese conquest of Malacca, Rafael Perestrello travelled to Guangzhou as a passenger on a native junk in 1516. His report induced Fernão Pires de Andrade to sail to the city with eight ships the next year, but De Andrade's exploration was understood as spying and his brother Simão and others began attempting to monopolize trade, enslaving Chinese women and children, engaging in piracy, and fortifying the island of Tamão. Rumors even circulated that Portuguese were eating the children. The Guangzhou administration was charged with driving them off: they bested the Portuguese at the Battle of Tunmen and in Xicao Bay; held a diplomatic mission hostage in a failed attempt to pressure the restoration of the sultan of Malacca, who had been accounted a Ming vassal; and, after placing them in cangues and keeping them for most of a year, ultimately executed 23 by lingchi. With the help of local pirates, the \"Folangji\" then carried out smuggling at Macao, Lampacau, and  Island (now Shangchuan), until Leonel de Sousa legalized their trade with bribes to Admiral Wang Bo () and the 1554 Luso-Chinese Accord. The Portuguese undertook not to raise fortifications and to pay customs dues; three years later, after providing the Chinese with assistance suppressing their former pirate allies, the Portuguese were permitted to warehouse their goods at Macau instead of Guangzhou itself.\n\nAfter the fall of Fuzhou in October 1646, the Longwu Emperor's brother Zhu Yuyue fled by sea to Guangzhou. On 11 December, he declared himself the Shaowu Emperor, borrowing his imperial regalia from local theatre troupes. He led a successful offense against his cousin Zhu Youlang but was deposed and executed on 20 January 1647 when the Ming turncoat Li Chengdong () sacked the city on behalf of the Qing.\n\nThe Qing became somewhat more open to foreign trade after gaining control of Taiwan in 1683. The Portuguese from Macau and Spaniards from Manila returned, as did private Muslim, Armenian, and English traders. From 1699 to 1714, the French and British East India Companies sent a ship or two each year; the Austrian Ostend General India Co. arrived in 1717, the Dutch East India Co. in 1729, the Danish Asiatic Co. in 1731, and the Swedish East India Co. the next year. These were joined by the occasional Prussian or Trieste Company vessel. The first independent American ship arrived in 1784 and the first colonial Australian one in 1788. By that time, Guangzhou was one of the world's great ports, organised under the Canton System. The main exports were tea and porcelain. As a meeting place of merchants from all over the world, Guangzhou became a major contributor to the rise of the modern global economy.\n\nIn the 19th century, most of the city's buildings were still only one or two storeys. The major structures were the Plain Minaret of the Huaisheng Mosque, the Flower Pagoda of the Temple of the Six Banyan Trees, and the guard tower known as the 5-Storey Pagoda. The northern hills, since urbanized, were bare and covered with traditional graves. The brick city walls were about 6 mi in circumference, 25 ft high, and 20 ft wide. Its eight main gates and two water gates all held guards during the day and were closed at night. The wall rose to incorporate a hill on its northern side and was surrounded on the other three by a moat which, along with the canals, functioned as the city's sewer, emptied daily by the river's tides. A partition wall with four gates divided the northern \"old town\" from the southern \"new town\" closer to the river; the suburb of Xiguan (\"West Gate\") stretched beyond and the boats of fishers, traders, and Tanka (\"boat people\") almost entirely concealed the riverbank for about 4 mi. It was common for homes to have a storefront facing the street and to treat their courtyards as a kind of warehouse. The city was part of a network of signal towers so effective that messages could be relayed to Beijing—about 1200 mi away—in less than 24 hours.\n\nThe Canton System was maintained until the outbreak of the First Opium War in 1839. Following a series of battles in the Pearl River Delta, the British captured Guangzhou itself on 18 March 1841. The Second Battle of Canton was fought two months later. Following the Qing Empire's 1842 treaty with Great Britain, Guangzhou lost its privileged trade status as more and more treaty ports were opened to more and more countries, usually including extraterritorial enclaves. Amid the decline of Qing prestige and the chaos of the Taiping Rebellion, the Punti and Hakka waged a series of clan wars from 1855 to 1867 in which 1 million people died.\n\nThe concession for the Canton–Hankow Railway was awarded to the American China Development Co. in 1898. It completed its branch line west to Foshan and Sanshui before being engulfed in a diplomatic crisis after a Belgian consortium bought a controlling interest and the Qing cancelled its concession. J.P. Morgan was awarded millions in damages and the line to Wuchang wasn't completed until 1936 and a unified Beijing–Guangzhou Railway waited until the completion of Wuhan's Yangtze River Bridge in 1957.\n\nModern China \n\nRevolutions \n\nDuring the late Qing Dynasty, Guangzhou was the site of failed revolts such as the Uprisings of 1895 and 1911 to overthrow the Qing; the 72 rebels whose bodies were found after the latter uprising are remembered and honoured as the city's 72 Martyrs in the Huanghuagang (\"Yellow Flower Mound\") Mausoleum.\n\nAll these failed revolutionary attempts would eventually lead to the Xinhai Revolution which successfully overthrew the Qing Dynasty to establish a new Han Chinese republic.\n\nKuomintang rule \n\nAfter the assassination of Song Jiaoren and Yuan Shikai's attempts to remove Nationalists from power, the leader of Guangdong Hu Hanmin joined the 1913 Second Revolution against him but was forced to flee to Japan with Sun Yat-sen after its failure. The city came under national spotlight again in 1917, when Prime Minister Duan Qirui's abrogation of the constitution triggered the Constitutional Protection Movement. Sun Yat-sen came to head the Guangzhou Military Government supported by the members of the dissolved parliament and the Southwestern warlords. The Guangzhou government fell apart as the warlords withdrew their support. Sun fled to Shanghai in November 1918 until the Guangdong warlord Chen Jiongming restored him in October 1920 during the Yuegui Wars. On 16 June 1922, Sun was ousted in a coup and fled on the warship Yongfeng after Chen sided with the Zhili Clique's Beijing government. In the following months Sun mounted a counterattack into Guangdong by rallying supporters from Yunnan and Guangxi, and in January established a government in the city for the third time.\n\nFrom 1923 to 1926 Sun and the Kuomintang used the city as a base to prosecute a renewed revolution in China by conquering the warlords in the north.  Although Sun was previously dependent on opportunistic warlords who hosted him in the city, with the leadership of Chiang Kai-shek, the KMT developed its own military power that served its ambition. The Canton years saw the evolution of the KMT into a revolutionary movement with a strong military focus and ideological commitment, setting the tone of the KMT rule of China beyond 1927.\n\nIn 1924 the KMT made the momentous decision to ally with the Communist Party and the USSR. With Soviet help, KMT reorganized itself along the Leninist line and adopted a pro-labor and pro-peasant stance. The Kuomintang-CCP cooperation was confirmed in the First Congress of the KMT and the communists were instructed to join the KMT. The allied government set up the Peasant Movement Training Institute in the city, of which Mao Zedong was a director for one term. Sun and his military commander Chiang used Soviet funds and weapons to build an armed force staffed by communist commissars, training its cadres in the Whampoa Military Academy. In August, the fledgling army suppressed the Canton Merchants' Corps Uprising. The next year the anti-imperialist May Thirtieth Movement swept the country, and the KMT government called for strikes in Canton and Hong Kong. The tensions of the massive strikes and protests led to the Shakee Massacre.\n\nAfter the death of Sun Yat-sen in 1925 the mood was changing in the party toward the communists. In August the left-wing KMT leader Liao Zhongkai was assassinated and the right-wing leader Hu Hanmin, the suspected mastermind, was exiled to the Soviet Union, leaving the pro-communist Wang Jingwei in charge. Opposing communist encroachment, the right-wing Western Hills Group vowed to expel the communists from the KMT. The \"Canton Coup\" on 20 March 1926 saw Chiang solidify his control over the Nationalists and their army against Wang Jingwei, the party's left wing, its Communist allies, and its Soviet advisors. By May, he had ended civilian control of the military and begun his Northern Expedition against the warlords of the north. Its success led to the split of the KMT and the subsequent purge of the communists in the Shanghai Massacre. When Zhang Fakui took Guangzhou from the New Guangxi Clique as part of the infighting in 1927, the communists saw an opening and launched the Guangzhou Uprising, but the rebel army units and armed workers were defeated after heavy fighting in the city.\n\nBy 1929, Chen Jitang had established himself as the military ruler of Guangdong. In 1931 he threw his weight behind the anti-Chiang schism which established a separate Nationalist government in Guangzhou.李洁之，陈济棠主粤始末，《广州文史》第三十七辑。 The separatists included prominent KMT leaders like Wang Jingwei, Sun Fo and others from diverse factions. While the intraparty division was resolved next year, Chen kept his power until he was defeated by Chiang in 1936.\n\nCommunist takeover \n\nAmid the closing months of the Chinese Civil War, Guangzhou briefly served as the capital of the Republic of China after the fall of Nanjing to communism in April 1949. The People's Liberation Army entered the city on 14 October 1949. Amid a massive exodus to Hong Kong and Macau, the Nationalists blew up the Haizhu Bridge across the Pearl River in retreat. The Cultural Revolution had a large effect on the city with much of its temples, churches and other monuments destroyed during this chaotic period.\n\nThe People's Republic of China initiated building projects including new housing on the banks of the Pearl River to adjust the city's boat people to life on land. Since the 1980s, the city's close proximity to Hong Kong and Shenzhen and its ties to overseas Chinese have made it one of the first beneficiaries of China's opening up under Deng Xiaoping. Beneficial tax reforms in the 1990s have also helped the city's industrialisation and development.\n\nThe municipality was expanded in the year 2000, with Huadu and Panyu joining the city as urban districts and Conghua and Zengcheng as more rural counties. The former districts of Dongshan and Fangcun were abolished in 2005, merged into Yuexiu and Liwan respectively. The city acquired Nansha and Luogang. The former was carved out of Panyu, the latter from parts of Baiyun, Tianhe, Zengcheng, and an exclave within Huangpu. The National People's Congress approved a development plan for the Pearl River Delta in January 2009; on March 19 the same year, the Guangzhou and Foshan municipal governments agreed to establish a framework to merge the two cities. In 2014, Luogang merged into Huangpu and both Conghua and Zengcheng counties were upgraded to districts. Guangzhou was then the most populous consolidated district-governed city in China until Beijing overtook it the next year.\n\nGallery \n\nFile:Nieuhof-Ambassade-vers-la-Chine-1665 0744-2.tif|Nieuhof's imaginative 1665 map of \"Kanton\", made from second-hand accounts while Europeans were still forbidden from entering the walled city\nFile:Canton factories.jpg|The Thirteen Factories , displaying the flags of Denmark, Spain, the United States, Sweden, Britain, and the Netherlands\nFile:Shop of Tingqua, the painter.jpg|An 1855 painting of the gallery of Tingqua, one of the most successful suppliers of \"export paintings\" for Guangzhou's foreign traders.Common themes included the Thirteen Factories, the Whampoa Anchorage (now Pazhou), and the Sea-Banner Temple (now Hoi Tong Monastery)\nFile:Canton1860.jpg|Vrooman's 1860 map of the \"City and Entire Suburbs of Canton\", one of the first made after the treaties of Tianjin and Beijing permitted foreigners full access to Guangzhou's walled city\nFile:Flowery Pagoda.jpg|The Flowery Pagoda at the Temple of the Six Banyan Trees in 1863\nFile:Lai Afong, Five Stories Pagoda Guangzhou, c1880.JPG|The Five-storey Pagoda atop Yuexiu Hill \nFile:Lai Afong, Sacred Heart Cathedral Guangzhou, c1880.JPG|The Sacred Heart Cathedral towering over the one- and two-storey homes of old Guangzhou \nFile:Canton street scene, 1919.jpg|Street scene in Guangzhou, 1919\nFile:Canton1920 d006 map of of the city.jpg|The US Navy's Dept of Navigation's 1920 map of \"Canton\"\nFile:Whampoa3.jpg|Sun Yat-sen and Chiang Kai-shek at the opening of the Whampoa Military Academy on 16 June 1924\nFile:The Bund Canton.jpg|The Guangzhou Bund in 1930, with rows of Tanka boats.\nFile:1937 Canton, China VP8.webm|A short film of Guangzhou in 1937\nFile:PLA Troops entered to Guangzhou.jpg|Communist troops entering Guangzhou on 14 October 1949\n\nGeography \n\nThe old town of Guangzhou was near Baiyun Mountain on the east bank of the Pearl River (Zhujiang) about 80 mi from its junction with the South China Sea and about 300 mi below its head of navigation. It commanded the rich alluvial plain of the Pearl River Delta, with its connection to the sea protected at the Humen Strait. The present city spans  on both sides of the river from  to  longitude and  to  latitude in south-central Guangdong. The Pearl is the 3rd-largest river of China. Baiyun Mountain is now locally referred to as the city's \"lung\" ().\n\nThe elevation of the prefecture generally increases from southwest to northeast, with mountains forming the backbone of the city and the ocean comprising the front. Tiantang Peak (, \"Heavenly Peak\") is the highest point of elevation at 1210 m above sea level.\n\nNatural resources \n\nThere are 47 different types of minerals and also 820 ore fields in Guangzhou, including 18 large and medium-sized oil deposits. The major minerals are granite, cement limestone, ceramic clay, potassium, albite, salt mine, mirabilite, nepheline, syenite, fluorite, marble, mineral water, and geothermal mineral water. Since Guangzhou is located in the water-rich area of southern China, it has a wide water area with lots of rivers and water systems, accounting for 10% of the total land area. The rivers and streams improve the landscape and keep the ecological environment of the city stable.\n\nClimate \n\nDespite being located just south of the Tropic of Cancer, Guangzhou has a humid subtropical climate (Köppen Cfa) influenced by the East Asian monsoon. Summers are wet with high temperatures, high humidity, and a high heat index. Winters are mild and comparatively dry. Guangzhou has a lengthy monsoon season, spanning from April through September. Monthly averages range from  in January to  in July, while the annual mean is . Autumn, from October to December, is very moderate, cool and windy, and is the best travel time. The relative humidity is approximately 68 percent, whereas annual rainfall in the metropolitan area is over 1700 mm. With monthly percent possible sunshine ranging from 17 percent in March and April to 52 percent in November, the city receives 1,628 hours of bright sunshine annually, considerably less than nearby Shenzhen and Hong Kong. Extreme temperatures have ranged from 0 °C to . The last recorded snowfall in the city was on 24 January 2016, 87 years after the second last recorded snowfall.\n\nAdministrative divisions \n\nGuangzhou is a sub-provincial city. It has direct jurisdiction over eleven districts:\n\nEconomy \n\nGuangzhou is the main manufacturing hub of the Pearl River Delta, one of mainland China's leading commercial and manufacturing regions. In 2013, the GDP reached ¥1542 billion (US$248 billion), per capita was ¥120,515 (US $19,459). Guangzhou is considered one of the most prosperous cities in China.  But due to rapid industrialisation, it is also considered one of the most polluted cities.\n\nThe Canton Fair, formally the \"China Import and Export Fair\", is held every year in April and October by the Ministry of Trade. Inaugurated in the spring of 1957, the fair is a major event for the city. It is the trade fair with the longest history, highest level, largest scale in China. From the 104th session onwards, the fair moved to the new Guangzhou International Convention and Exhibition Center () in Pazhou, from the older complex in Liuhua. The GICEC is served by two stations on Metro Line 8. Since the 104th session, the Canton Fair has been arranged in three phases instead of two phases.\n\nGuangzhou is one the largest hubs of China's illegal drug trade.\n\nFile:Guangzhou skyline.jpg|Guangzhou skyline\nFile:Canton Fair.jpg|The former Canton Fair site at Yuexiu's Liuhua Complex\nFile:Canton Trade Fair (tarotastic).jpg|A display at the current Canton Fair site in Pazhou\n\nLocal products \n\n* Cantonese is one of China's most famous and popular regional cuisines, with a saying stating simply to \"Eat in Guangzhou\" ()\n* Cantonese sculpture includes work in jade, wood, and (now controversially) ivory.\n* Canton porcelain developed over the past three centuries as one of the major forms of exportware. It is now known within China for its highly colorful style.\n* Cantonese embroidery is one of China's four main styles of the art and is represented in Guangzhou, although its principal centre is at Chaozhou.\n* Zhujiang Beer, a pale lager, is one of China's most successful brands. It is made in Guangzhou from water piped directly to the brewery from a natural spring.\n\nIndustry \n\nGuangzhou Peugeot Automobile Company produced the Peugeot 504 and Peugeot 505 automobiles from 1989 to 1997.\n\n* Guangzhou Economic and Technological Development Zone\n* Guangzhou Nansha Export Processing Zone\nThe Export Processing Zone was founded in 2005. Its total planned area is . It is located in Nansha District and it belongs to the provincial capital, Guangzhou. The major industries encouraged in the zone include automobile assembly, biotechnology and heavy industry. It is situated 54 km (70 minutes drive) south of Guangzhou Baiyun International Airport and close to Nansha Port. It also has the advantage of Guangzhou Metro line 4 which is being extended to Nansha Ferry Terminal.\n* Guangzhou Free Trade Zone\nThe zone was founded in 1992. It is located in the east of Huangpu District and near to Guangzhou Economic and Technological Development Zone. It is also very close to Guangzhou Baiyun Airport. The major industries encouraged in the zone include international trade, logistics, processing and computer software.\n\nScience City \n\n* Guangzhou Science City\n\nMalls and pedestrian streets \n\n* 101 Dynamics\n* Beijing Road\n* China Plaza\n* Jiangnanxi\n* Liwan Plaza\n* Shangxiajiu\n* Teem Plaza\n* Victory Plaza\n* Wanguo Plaza\n* Zhengjia Square (Grandview Mall Aquarium)\n* Wanda square\n* Happy Valley (Guangzhou)\n* TaiKoo Hui\n* Parc Central\n* OneLinkWalk\n* Rock Square\n* Aeon Mall\n* GT Land Plaza\n\nDemographics \n\nThe 2010 census found Guangzhou's population to be 12.78 million. , it was estimated at 13,080,500, with 11,264,800 urban residents. Its population density is thus around 1,800 people per km2. The built-up area of the Guangzhou proper connects directly to several other cities. The built-up area of the Pearl River Delta Economic Zone covers around  and has been estimated to house 22 million people, including Guangzhou's nine urban districts, Shenzhen (5.36m), Dongguan (3.22m), Zhongshan (3.12m), most of Foshan (2.2m), Jiangmen (1.82m), Zhuhai (890k), and Huizhou's Huiyang District (760k). The total population of this agglomeration is over 28 million after including the population of the adjacent Hong Kong Special Administrative Region. The area's fast-growing economy and high demand for labour has produced a huge \"floating population\" of migrant workers. Up to 10 million migrants reside in the area least six months each year. In 2008, about 5 million of Guangzhou's permanent residents were hukouless migrants.\n\nEthnicity \n\nMost of Guangzhou's population is Han Chinese. Almost all of the local Cantonese people speak Cantonese as their first language, while most migrants speak forms of Mandarin. In 2010, each language was the native tongue of roughly half of the city's population, although minor but substantial numbers speak other varieties as well. As with elsewhere in the People's Republic of China, the household registration system (hukou) limits migrants' access to residences, educational institutions and other public benefits. In May 2014, legally employed migrants in Guangzhou were permitted to receive a hukou card allowing them to marry and obtain permission for their pregnancies in the city, rather than having to return to their official hometowns as previously.\n\nHistorically, the Cantonese people have made up a sizeable part of the 19th- and 20th-century Chinese diaspora and many overseas Chinese have ties to Guangzhou. This is particularly true in the United States, Canada, and Australia.\n\nDemographically, the only significant immigration into China has been by overseas Chinese, but Guangzhou sees many foreign tourists, workers, and residents from the usual locations such as the United States. Notably, it is also home to thousands of African immigrants, including people from Nigeria, Angola and the Democratic Republic of Congo.\n\nMetropolitan area\n\nThe encompassing metropolitan area was estimated by the OECD (Organisation for Economic Co-operation and Development) to have, , a population of 25 million.Linked from the OECD [http://www.oecd.org/china/oecd-urban-policy-reviews-china-2015-9789264230040-en.htm here]\n\nTransportation \n\nUrban mass transit \n\nWhen the first line of the Guangzhou Metro opened in 1997, Guangzhou was the fourth city in Mainland China to have an underground railway system, behind Beijing, Tianjin, and Shanghai. Currently the metro network is made up of thirteen lines, covering a total length of . A long-term plan is to make the city's metro system expand to over 500 km by 2020 with 15 lines in operation. In addition to the metro system there is also the Haizhu Tram line which opened on 31 December 2014.\n\nThe Guangzhou Bus Rapid Transit (GBRT) system which was introduced in 2010 along Zhongshan Road. It has several connections to the metro and is the world's 2nd-largest Bus Rapid Transit system with 1,000,000 passenger trips daily. It handles 26,900 pphpd during the peak hour a capacity second only to the TransMilenio BRT system in Bogota. The system averages 1 bus every 10 seconds or 350 per hour in a single direction and contains the world's longest BRT stations—around 260 m including bridges.\n\nMotor transport \n\nIn the 19th century, city already boasted over 600 long, straight streets; these were mostly paved but still very narrow. In June 1919, work began on demolishing the city wall to make way for wider streets and the development of tramways. The demolition took three years in total.\n\nIn 2009, it was reported that all 9,424 buses and 17,695 taxis in Guangzhou would be operating on LPG-fuel by 2010 to promote clean energy for transport and improve the environment ahead of the 2010 Asian Games which were held in the city. At present, Guangzhou is the city that uses the most LPG-fueled vehicles in the world, and at the end of 2006, 6,500 buses and 16,000 taxis were using LPG, taking up 85 percent of all buses and taxis.\n\nEffective January 1, 2007, the municipal government banned motorcycles in Guangdong's urban areas. Motorcycles found violating the ban are confiscated. The Guangzhou traffic bureau claimed to have reported reduced traffic problems and accidents in the downtown area since the ban.\n\nAirports \n\nGuangzhou's main airport is the Baiyun International Airport in Baiyun District; it opened on August 5, 2004. This airport is the second busiest airport in terms of traffic movements in China. It replaced the old Baiyun International Airport, which was very close to the city centre but failed to meet the city's fast-growing air traffic demand. The old Baiyun International Airport was in operation for 72 years.\n\nGuangzhou Baiyun International Airport now has three runways, with two more planned. The Terminal 2 is under construction and will open in 2018.\n\nRailways \n\nGuangzhou is the terminus of the Beijing–Guangzhou, Guangzhou–Shenzhen, Guangzhou–Maoming and Guangzhou–Meizhou–Shantou conventional speed railways. In late 2009, the Wuhan–Guangzhou High-Speed Railway started service, with multiple unit trains covering 980 km at a top speed of 320 km/h.  In December 2014, the Guiyang–Guangzhou High-Speed Railway and Nanning-Guangzhou Railway began service with trains running at top speeds of 250 km/h and 200 km/h, respectively.(Chinese) [http://news.southcn.com/g/2014-12/26/content_115108037.htm 陈清浩, \"贵广高铁正式开通运营 从贵阳到广州4小时可达\" 南方日报] 2014-12-26 The Guangdong Through Train departs from the Guangzhou East railway station and arrives at the Hung Hom KCR station in Kowloon, Hong Kong. The route is approximately 182 km in length and the ride takes less than two hours. Frequent coach services are also provided with coaches departing every day from different locations (mostly major hotels) around the city. A number of regional railways radiating from Guangzhou started operating such as the Guangzhou–Zhuhai Intercity Railway and the Guangzhou-Zhaoqing Intercity Railway.\n\nWater transport \n\nThere are daily high-speed catamaran services between Nansha Ferry Terminal and Lianhua Shan Ferry Terminal in Guangzhou and the Hong Kong China Ferry Terminal, as well as between Nansha Ferry Terminal and Macau Ferry Pier in Hong Kong.\n\nFile:GongYuanQian-MTR-Gz.JPG|Gongyuanqian Station of the Guangzhou Metro\nFile:GBRT Tianhe Sports Center.JPG|Tianhe Sports Centre Station (GBRT)\nFile:Guangzhou Baiyun Airport 2.JPG|Baiyun International Airport in Huadu District\nFile:Guangzhou South Railway Station Platform CRH3 EMU.jpg|A CRH3 Train at Guangzhou South Railway Station\n\nCulture \n\nWithin China, the culture of the Cantonese people is a subset of the larger \"Southern\" or \"Lingnan\" cultural areas. Notable aspects of Guangzhou's cultural heritage include:\n\n* Cantonese language, the local and prestige variant of Yue Chinese\n* Cantonese cuisine, one of China's eight major culinary traditions\n* Cantonese opera, usually divided into martial and literary performances\n* Xiguan, the area west of the former walled city\n\nThe Guangzhou Opera House & Symphony Orchestra also perform classical Western music and Chinese compositions in their style. Cantonese music is a traditional style of Chinese instrumental music, while Cantopop is the local form of pop music and rock-and-roll which developed from neighbouring Hong Kong.\n\nReligions \n\nQing-era Guangzhou had around 124 religious pavilions, halls, and temples. Today, in addition to the Buddhist Association, Guangzhou also has a Taoist Association, a Jewish community, and a history with Christianity and Islam.\n\nDaoism \n\nDaoism and Chinese folk religion are still represented at a few of the city's temples. Among the most important is the Temple of the Five Immortals, honoring the five immortals credited with introducing rice cultivation at the foundation of the city. The five rams they rode were supposed to have turned into stones upon their departure and gave the city several of its nicknames. Another place of worship is the City God Temple. Guangzhou, like most of southern China, is also notably observant concerning ancestral veneration during occasions like the Tomb Sweeping and Ghost Festivals.\n\nBuddhism \n\nBuddhism is the most prominent religion in Guangzhou. The Zhizhi Temple was founded in  233 from the estate of a Wu official; it is said to comprise the residence of Zhao Jiande, the last of the Nanyue kings, and has been known as the Guangxiao Temple (\"Temple of Bright Filial Piety\") since the Ming. The missionary Bodhidharma is traditionally said to have visited Panyu during the Liu Song or Liang dynasties (5th or 6th century). Around  520, Emperor Wu of the Liang ordered the construction of the Baozhuangyan Temple and the Xilai Monastery to store the relics of Cambodian Buddhist saints which had been brought to the city and to house the monks beginning to assemble there. The Baozhuangyan is now known as the Temple of the Six Banyan Trees, after a famous poem composed by Su Shi after a visit during the Northern Song. The Xilai Monastery was renamed the Hualin Temple (\"Flowery Forest Temple\") after its reconstruction during the Qing.\n\nThe temples were damaged by both the Republican campaign to \"Promote Education with Temple Property\" () and the Maoist Cultural Revolution but have been renovated since the opening up that began in the 1980s. The Ocean Banner Temple on Henan Island, once famous in the west as the only tourist spot in Guangzhou accessible to foreigners, has been reopened as the Hoi Tong Monastery.\n\nChristianity \n\nNestorian Christians first arrived in China via the overland Silk Road, but suffered during Emperor Wuzong's 845 persecution and were essentially extinct by the year 1000. The Qing-era ban on foreigners limited missionaries until it was abolished following the First Opium War, although the Protestant Robert Morrison was able to perform some work through his service with the British factory. The Catholic archdiocese is housed at Guangzhou's Sacred Heart Cathedral, known locally as the \"Stone House\". A Gothic Revival edifice which was built by hand from 1861 to 1888 under French direction, its original Latin and French stained-glass windows were destroyed during the wars and amid the Cultural Revolution; they have since been replaced by English ones. The Canton Christian College (1888) and Hackett Medical College for Women (1902) were both founded by missionaries and now form part of Guangzhou's Lingnan. Since the opening up of China in the 1980s, there has been renewed interest in Christianity, but Guangzhou maintains pressure on underground churches which avoid registration with government officials. The Catholic archbishop Dominic Tang was imprisoned without trial for 22 years, but his present successor is recognised by both the Vatican and China's Patriotic Church.\n\nIslam \n\nGuangzhou has had a Muslim community since very early in the history of Islam; the native or nativised adherents of the faith are known as the Hui. Huaisheng Mosque was probably built during the Tang Dynasty. Muslims sacked the city in 758 and were massacred by the Chinese rebel Huang Chao in 878, along with the Jews, Christians, and Parsis.  The modern city includes numerous halal restaurants.\n\nFile:WuXianGuan-rams-0484.jpg|Guangzhou's Temple of the Five Immortals\nFile:John Thomson - Wah Lum Chu, Canton - cropped.jpg| at the  (Hualin) in the 1870s\nFile:The Mahavira Palace of Guangxiaosi.jpg| (Guangxiao)\nFile:Guangzhou Chenghuang Miao 2014.01.24 16-47-58.jpg|Guangzhou's City God Temple\nFile:The Sea-screen Temple at Honam Canton.png|The sacred pigs of the Ocean Banner Temple (Haichuan/ in the 1830s\n\nFile:Canton pagoda de las flores.JPG| at the Temple of the Six Banyan Trees (Liurong)\nFile:Hoi Tong Monastery Pagoda.JPG|The Thousand Buddha Tower at the present-day \nFile:Guangzhou Shishi Shengxin Dajiaotang 2012.11.15 10-46-30.jpg|Sacred Heart Cathedral\nFile:Mosque, Canton.jpg|Huaisheng Mosque and its \"Plain Pagoda\" minaret in 1860\n\nSport \n\nThe 18,000 seat Guangzhou International Sports Arena will be one of the venues for the 2019 FIBA Basketball World Cup.[http://www.fiba.com/basketballworldcup/2019 The Official website of the 2019 FIBA Basketball World Cup], FIBA.com, Retrieved 9 March 2016.\n\nFrom 12–27 November 2010, Guangzhou hosted the 16th Asian Games. The same year, it hosted the first Asian Para Games from December 12 to 19. Combined, these were the largest sporting events the city ever hosted.\n\nGuangzhou also hosted the following major sporting events:\n* 1987 The 6th National Games of China\n* 1991 The 1st FIFA Women's World Cup\n* 2001 The 2001 National Games of China\n* 2007 The 8th National Traditional Games of Ethnic Minorities of the People's Republic of China\n* 2008 The 49th World Table Tennis Championships\n* 2009 The 11th Sudirman Cup: the world badminton mixed team championships\n\nCurrent professional sports clubs based in Guangzhou include:\n\nGuangzhou Evergrande Taobao F.C. has risen in recent years to be a powerhouse in association football in China, having won seven consecutive national titles between 2011 and 2017. The team also won the AFC Champions League in 2013 and 2015. The club competed in the 2013 FIFA Club World Cup, where it lost 3–0 in the semi-final stage to the 2012–13 UEFA Champions League winners FC Bayern Munich.\n\nDestinations \n\nEight Views \n\nThe Eight Views of Ram City are Guangzhou's eight most famous tourist attractions. They have varied over time since the Song dynasty, with some being named or demoted by emperors. The following modern list was chosen through public appraisal in 2011:\n\n* \"Towers Shining through the New Town\"\n* \"The Pearl River Flowing and Shining\": The Pearl River from Bai'etan to Pazhou\n* \"Cloudy Mountain Green and Tidy\": Baiyun Mountain Scenic Area\n* \"Yuexiu's Grandeur\": Yuexiu Hill and Park\n* \"The Ancient Academy's Lingering Fame\": The Chen Clan Ancestral Hall and its folk art museum\n* \"Liwan's Wonderful Scenery\": Liwan Lake\n* \"Science City, Splendid as Brocade\"\n* \"Wetlands Singing at Night\": Nansha Wetlands Park\n\nFile:Pearl River Night Cruise.jpg|The Pearl River at Haiyin Bridge\nFile:Guangzhou BaiyunShan.jpg|Zhujiang New City from Pakwan or Baiyun Mountain\nFile:刘庆伏狼驹3.jpg|A brick carving at the Guangzhou Folk Art Museum, housed in the Chen Clan Ancestral Hall\n\nParks and gardens \n\n* Baiyun Mountain\n* Nansha Wetland Park\n* People's Park\n* South China Botanical Garden\n* Yuexiu Park\n* Dongshanhu Park ()\n* Liuhuahu Park ()\n* Liwanhu Park ()\n* Luhu Park ()\n* Martyrs' Park ()\n* Pearl River Park ()\n* Yuntai Garden ()\n\nTourist attractions \n\nGuangzhou attracts more than 100 million visitors each year. There are many tourist attractions, including:\n\n* Canton Tower\n* Chen Clan Ancestral Hall, housing Guangzhou's folk art museum\n* Chime-Long Paradise\n* Chime-Long Waterpark ()\n* Guangdong Provincial Museum\n* Guangzhou Zoo\n* Huaisheng Mosque, site of the Plain Pagoda\n* Museum of the Mausoleum of the Nanyue King\n* Peasant Movement Training Institute, an important Maoist site\n* Sacred Heart Cathedral or Stone House\n* Temple of Bright Filial Piety (Guangxiao)\n* Temple of the Six Banyan Trees (Liurong), site of the Flowery Pagoda\n* Shamian or Shameen Island, the old trading compound\n* Sun Yat-sen Memorial Hall, site of Guangzhou's former presidential palace\n* Xiguan, the western suburbs of the old city\n\nMajor buildings \n\n \n\n* CITIC Plaza\n* Canton Tower\n* Guangzhou Circle Mansion\n* Guangdong Olympic Stadium\n* Guangzhou Opera House\n* Guangzhou TV Tower\n* Pearl River Tower\n* The Twin Towers:\n** International Finance Centre (West)\n** The CTF Guangzhou (East)\n\nFile:OldGzCustoms3.JPG|Canton Custom House (est. 1916), one of the oldest surviving in China\nFile:Ai Qun Hotel.JPG|Aiqun Hotel, Guangzhou's tallest building from 1937 to 1967\nFile:Our Lady of Lourdes Chapel.jpg|Our Lady of Lourdes Chapel on Shamian\nFile:Dabenying (Generalissimo Sun Yat-sen%27s Mansion).jpg|The Canton Cement Factory (est. 1907), which housed Sun Yat-sen from 1923 to 1925\nFile:Guangzhou Guangdong Ziyi Ju Jiuzhi 2014.01.24 15-05-46.jpg|The old provincial capitol, now the Museum of Revolutionary History\nFile:Guangzhou (6344321124).jpg|Guangzhou's CBD, including the IFC (right)\n\nMedia \n\nGuangzhou has two local radio stations: the provincial Radio Guangdong and the municipal Radio Guangzhou. Together they broadcast in more than a dozen channels. The primary language of both stations is Cantonese. Traditionally only one channel of Radio Guangdong is dedicated to Mandarin Chinese. However, in recent years there has been an increase in Mandarin programmes on most Cantonese channels. Radio stations from cities around Guangzhou mainly broadcast in Cantonese and can be received in different parts of the city, depending on the radio stations' locations and transmission power. The Beijing-based China National Radio also broadcasts Mandarin programmes in the city. Radio Guangdong has a 30-minute weekly English programme, Guangdong Today, which is broadcast globally through the World Radio Network. Daily English news programmes are also broadcast by Radio Guangdong.\n\nGuangzhou has some of the best Chinese-language newspapers and magazines in mainland China, most of which are published by three major newspaper groups in the city, the Guangzhou Daily Press Group, Nanfang Press Corporation, and the Yangcheng Evening News Group. The two leading newspapers of the city are Guangzhou Daily and Southern Metropolis Daily. The former, with a circulation of 1.8 million, has been China's most successful newspaper for 14 years in terms of advertising revenue, while Southern Metropolis Daily is considered one of the most liberal newspapers in mainland China. In addition to Guangzhou's Chinese-language publications, there are a few English magazines and newspapers. The most successful is That's Guangzhou, which started more than a decade ago and has since blossomed into That's PRD, producing expatriate magazines in Beijing and Shanghai as well. It also produces In the Red.\n\nEducation \n\nThe Guangzhou Higher Education Mega Centre, also known as Guangzhou University Town (), is a large tertiary education complex located in the southeast suburbs of Guangzhou. It occupies the entirety of Xiaoguwei Island in Panyu District, covering an area of about 18 km2. The complex accommodates campuses from ten higher education institutions and can eventually accommodate up to 200,000 students, 20,000 teachers, and 50,000 staff.\n\nThe Guangzhou Higher Education Mega Centre higher education campuses:\n* Guangdong Pharmaceutical University\n* Guangdong University of Foreign Studies\n* Guangdong University of Technology\n* Guangzhou Academy of Fine Arts\n* Guangzhou University\n* Guangzhou University of Chinese Medicine\n* South China Normal University\n* South China University of Technology\n* Sun Yat-sen University\n* Xinghai Conservatory of Music\n\nGuangzhou's other fully accredited and degree-granting universities and colleges include:\n* Guangdong Institute of Science and Technology\n* Guangdong Polytechnic Normal University\n* Guangdong University of Finance & Economics\n* Guangdong University of Finance\n* Guangzhou College of South China University of Technology\n* Guangzhou Medical University\n* Guangzhou Sports University\n* Jinan University\n* South China Agricultural University\n* Southern Medical University\n* Zhongkai University of Agriculture and Engineering\n\nThe two main comprehensive libraries are Guangzhou Library and Sun Yat-sen Library of Guangdong Province. Guangzhou Library is a public library in Guangzhou. The library has moved to a new building in Zhujiang New Town, which fully opened on 23 June 2013. Sun Yat-sen Library of Guangdong Province has the largest collection of ancient books in Southern China.\n\nInternational relations \n\nTwin towns and sister cities \n\nGuangzhou currently maintains sister city agreements with the following foreign cities.\n\n*  Fukuoka, Japan (since 1979)\n*  Los Angeles, United States (since 1981)\n*  Manila, Philippines (since 1982)\n*  Vancouver, Canada (since 1985)\n*  Sydney, Australia (since 1986)\n*  Bari, Italy (since 1986)\n*  Lyon, France (since 1988)\n*  Frankfurt, Germany (since 1988)\n*  Auckland, New Zealand (since 1989)\n*  Gwangju, South Korea (since 1996)\n*  Linköping, Sweden (since 1997)\n*  Durban, South Africa (since 2000)\n*  Bristol, United Kingdom (since 2001)\n*  Yekaterinburg, Russia (since 2002)\n*  Arequipa, Peru (since 2004)\n*  Surabaya, Indonesia (since 2005)\n*  Vilnius, Lithuania (since 2006)\n*  Birmingham, United Kingdom (since 2006)\n*  Hambantota, Sri Lanka (since 2007)\n*  Recife, Brazil (since 2007)\n*  Tampere, Finland (since 2008)\n*  Bangkok, Thailand (since 2009)\n*  Kota Kinabalu, Malaysia (since 2011)\n*  Petaling Jaya, Malaysia (since 2012)\n*  Rabat, Morocco (since 2013)\n*  Ahmedabad, India (since 2014)\n*  Łódź, Poland (since 2014)\n*  Ecatepec, Mexico (since 2016)\n*  Genoa, Italy (since 2016)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guangzhou" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12537" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Guangzhou (English /ɡwæŋ'dʒəʊ/, ; or;), traditionally romanised as Canton,\"[http://www.britannica.com/EBchecked/topic/93196/Guangzhou Guangzhou (China)]\". Encyclopædia Britannica. Accessed September 12, 2010. is the capital and most populous city of the province of Guangdong in southern China. Located on the Pearl River about 120 km north-northwest of Hong Kong and 145 km north of Macau, Guangzhou has a history of over 2,200 years and was a major terminus of the maritime Silk Road and continues to serve as a major port and transportation hub today.\n\nGuangzhou is situated at the heart of the most-populous built-up metropolitan area in mainland China, an area that extends into the neighboring cities of Foshan, Dongguan, and Shenzhen, forming one of the largest urban agglomerations on the planet. Administratively, the city holds sub-provincial status; and is one of China's five National Central Cities.. In 2015 the city's administrative area was estimated to have a population of 13,501,100. Guangzhou is ranked as an Alpha- Global city. In recent years, there has been a rapidly increasing number of foreign residents and immigrants from Southeast Asia, the Middle East, Eastern Europe, and especially from Africa.[https://www.theguardian.com/world/2010/oct/06/china-crackdown-african-immigration China cracks down on African immigrants and traders], The Guardian, 6 October 2010 This has led to it being dubbed the \"Capital of the Third World\"..[http://m.caijing.com.cn/api/show?contentid\n3702350 广州常住非裔人士或达30万 被称作第三世界首都]. The migrant population from other provinces of China in Guangzhou was 40 percent of the city's total population in 2008. Together with Shanghai, Beijing and Shenzhen, Guangzhou has one of the most expensive real estate markets in China.\n\nGuangzhou has a comparatively recent history of two centuries related to its importance for foreign trade. Long the only Chinese port accessible to  foreign traders, the city fell to the British during the First Opium War. No longer enjoying a monopoly after the war, it lost trade to other ports such as Hong Kong (which is close by) and Shanghai, but continued to serve as a major entrepôt.  In modern commerce, Guangzhou is best known for its annual Canton Fair, the oldest and largest trade fair in China.  For the three consecutive years 2013–2015, Forbes ranked Guangzhou as the best commercial city on the Chinese mainland..\n\nNames \n\nGuǎngzhōu is the pinyin romanisation of the Chinese name , which was simplified in mainland China to  in the 1950s. The name of the city is taken from the ancient Guang Province (Guang Zhou), after it had become the prefecture's seat of government, which is how some other Chinese cities, including Hangzhou, Suzhou and Fuzhou got their names. The character  or —which also appears in the names of the provinces Guangdong and Guangxi, together called the Liangguang—means \"broad\" or \"expansive\" and refers to the intention to dispense imperial grace broadly in the region with the founding of county of Guangxin in Han Dynasty.\n\nBefore acquiring its current name, the town was known as Panyu, a name still borne by one of Guangzhou's districts. The origin of the name is still uncertain, with 11 various explanations being offered, including that it may have referred to two local mountains. The city has also sometimes been known as Guangzhou Fu or Guangfu after its status as the capital of a prefecture. From this latter name, Guangzhou was known to medieval Persians such as Al-Masudi and Ibn Khordadbeh as Khanfu ().. Under the Southern Han, the city was renamed Xingwang.\n\nThe Chinese abbreviation for Guangzhou is , after its nickname \"Rice City\". The city has long borne the nickname  or  from the five stones at the old Temple of the Five Immortals said to have been the sheep or goats ridden by the Taoist culture heroes credited with introducing rice cultivation to the area around the time of the city's foundation. The former name \"City of the Immortals\" came from the same story. The more recent  is usually taken as a simple reference to the area's greenery.\n\nThe English name \"Canton\" derived from Portuguese ' or ', a muddling of dialectical pronunciations of \"Guangdong\" (e.g., Hakka Kóng-tûng). Although it originally and chiefly applied to the walled city, it was also used in English in reference to Guangdong generally. It was adopted as the Postal Map Romanization of Guangzhou and remained in common use until the gradual adoption of pinyin. As an adjective, it is still used in describing the people, language, cuisine and culture of Guangzhou and the surrounding Liangguang region. The 19th-century name \"\" derived from Nanjing dialect of Mandarin and the town's status as a prefectural capital.\n\nHistory \n\nPrehistory \n\nA settlement now known as Nanwucheng was present in the area by . Some traditional Chinese histories placed Nanwucheng's founding during the reign of Ji Yan,.. king of Zhou from 314–256 . It was said to have consisted of little more than a stockade of bamboo and mud.\n\nNanyue \n\nPanyu was established on the east bank of the Pearl River in 214  to serve as a base for the Qin Empire's first failed invasion of the Baiyue lands in southern China. Legendary accounts claimed the soldiers at Panyu were so vigilant that they did not remove their armor for three years. Upon the fall of the Qin, General Zhao Tuo established his own kingdom of Nanyue and made Panyu its capital in 204 . It remained independent through the Chu-Han Contention, although Zhao negotiated recognition of his independence in exchange for his nominal submission to the Han in 196 . Archaeological evidence shows that Panyu was an expansive commercial centre: in addition to items from central China, archaeologists have found remains originating from Southeast Asia, India, and even Africa. Zhao Tuo was succeeded by Zhao Mo and then Zhao Yingqi. Upon Zhao Yingqi's death in , his younger son Zhao Xing was named as his successor in violation of Chinese primogeniture. By , his Chinese mother, the Empress Dowager Jiu () had prevailed upon him to submit Nanyue as a formal part of the Han Empire. The native prime minister Lü Jia () launched a coup, killing Han ambassadors along with the king, his mother, and their supporters. A successful ambush then annihilated a Han force which had been sent to arrest him. The enraged Emperor Wu launched a massive river- and sea-borne invasion: six armies under Lu Bode and Yang Pu. took Panyu and annexed Nanyue by the end of 111 .\n\nImperial China \n\nIncorporated into the Han Empire, Panyu became a provincial capital. In  226, it became the seat of Guang Prefecture, which gave it its modern name. The Old Book of Tang described Guangzhou as important port in southern China.刘煦.旧唐书·王方庆传〔M〕.北京：中华书局，1975 Direct routes connected the Middle East and China, as shown in records of a Chinese prisoner returning home from Iraq twelve years after his capture at Talas. Relations were not always peaceful: Muslims sacked the city on 30 October 758. and were massacred by the Chinese rebel Huang Chao in 878, along with the city's Jews, Christians, and Parsis.\n\nAmid the Five Dynasties and Ten Kingdoms that followed the collapse of the Tang Dynasty, the Later Liang governor Liu Yan used his base at Panyu to establish a \"Great Yue\" or \"Southern Han\" empire, which lasted from 917 to 971. The region enjoyed considerable cultural and economic success in this period. From the 10th to 12th century, there are records that the large foreign communities were not exclusively male, but included \"Persian women\"... Guangzhou was visited by the Moroccan traveler Ibn Battuta during his 14th-century journey around the world; he detailed the process by which the Chinese constructed their large ships in the port's shipyards.\n\nShortly after the Hongwu Emperor's declaration of the Ming Dynasty, he reversed his earlier support of foreign trade and imposed the first of a series of sea bans (haijin). These banned private foreign trade upon penalty of death for the merchant and exile for his family and neighbors. The Yuan-era maritime intendancies of Guangzhou, Quanzhou, and Ningbo were closed in 1384 and legal trade became limited to the tribute delegations sent to or by official representatives of foreign governments. The policies exacerbated \"Japanese\" pirate (the nanbu) attacks in the area until their removal in 1567.\n\nFollowing the Portuguese conquest of Malacca, Rafael Perestrello travelled to Guangzhou as a passenger on a native junk in 1516. His report induced Fernão Pires de Andrade to sail to the city with eight ships the next year, but De Andrade's exploration was understood as spying and his brother Simão and others began attempting to monopolize trade, enslaving Chinese women and children, engaging in piracy, and fortifying the island of Tamão. Rumors even circulated that Portuguese were eating the children. The Guangzhou administration was charged with driving them off: they bested the Portuguese at the Battle of Tunmen and in Xicao Bay; held a diplomatic mission hostage in a failed attempt to pressure the restoration of the sultan of Malacca, who had been accounted a Ming vassal; and, after placing them in cangues and keeping them for most of a year, ultimately executed 23 by lingchi. With the help of local pirates, the \"Folangji\" then carried out smuggling at Macao, Lampacau, and  Island (now Shangchuan), until Leonel de Sousa legalized their trade with bribes to Admiral Wang Bo () and the 1554 Luso-Chinese Accord. The Portuguese undertook not to raise fortifications and to pay customs dues; three years later, after providing the Chinese with assistance suppressing their former pirate allies, the Portuguese were permitted to warehouse their goods at Macau instead of Guangzhou itself.\n\nAfter the fall of Fuzhou in October 1646, the Longwu Emperor's brother Zhu Yuyue fled by sea to Guangzhou. On 11 December, he declared himself the Shaowu Emperor, borrowing his imperial regalia from local theatre troupes. He led a successful offense against his cousin Zhu Youlang but was deposed and executed on 20 January 1647 when the Ming turncoat Li Chengdong () sacked the city on behalf of the Qing.\n\nThe Qing became somewhat more open to foreign trade after gaining control of Taiwan in 1683. The Portuguese from Macau and Spaniards from Manila returned, as did private Muslim, Armenian, and English traders. From 1699 to 1714, the French and British East India Companies sent a ship or two each year; the Austrian Ostend General India Co. arrived in 1717, the Dutch East India Co. in 1729, the Danish Asiatic Co. in 1731, and the Swedish East India Co. the next year. These were joined by the occasional Prussian or Trieste Company vessel. The first independent American ship arrived in 1784 and the first colonial Australian one in 1788. By that time, Guangzhou was one of the world's great ports, organised under the Canton System. The main exports were tea and porcelain. As a meeting place of merchants from all over the world, Guangzhou became a major contributor to the rise of the modern global economy.\n\nIn the 19th century, most of the city's buildings were still only one or two storeys. The major structures were the Plain Minaret of the Huaisheng Mosque, the Flower Pagoda of the Temple of the Six Banyan Trees, and the guard tower known as the 5-Storey Pagoda. The northern hills, since urbanized, were bare and covered with traditional graves. The brick city walls were about 6 mi in circumference, 25 ft high, and 20 ft wide. Its eight main gates and two water gates all held guards during the day and were closed at night. The wall rose to incorporate a hill on its northern side and was surrounded on the other three by a moat which, along with the canals, functioned as the city's sewer, emptied daily by the river's tides. A partition wall with four gates divided the northern \"old town\" from the southern \"new town\" closer to the river; the suburb of Xiguan (\"West Gate\") stretched beyond and the boats of fishers, traders, and Tanka (\"boat people\") almost entirely concealed the riverbank for about 4 mi. It was common for homes to have a storefront facing the street and to treat their courtyards as a kind of warehouse. The city was part of a network of signal towers so effective that messages could be relayed to Beijing—about 1200 mi away—in less than 24 hours.\n\nThe Canton System was maintained until the outbreak of the First Opium War in 1839. Following a series of battles in the Pearl River Delta, the British captured Guangzhou itself on 18 March 1841. The Second Battle of Canton was fought two months later. Following the Qing Empire's 1842 treaty with Great Britain, Guangzhou lost its privileged trade status as more and more treaty ports were opened to more and more countries, usually including extraterritorial enclaves. Amid the decline of Qing prestige and the chaos of the Taiping Rebellion, the Punti and Hakka waged a series of clan wars from 1855 to 1867 in which 1 million people died.\n\nThe concession for the Canton–Hankow Railway was awarded to the American China Development Co. in 1898. It completed its branch line west to Foshan and Sanshui before being engulfed in a diplomatic crisis after a Belgian consortium bought a controlling interest and the Qing cancelled its concession. J.P. Morgan was awarded millions in damages and the line to Wuchang wasn't completed until 1936 and a unified Beijing–Guangzhou Railway waited until the completion of Wuhan's Yangtze River Bridge in 1957.\n\nModern China \n\nRevolutions \n\nDuring the late Qing Dynasty, Guangzhou was the site of failed revolts such as the Uprisings of 1895 and 1911 to overthrow the Qing; the 72 rebels whose bodies were found after the latter uprising are remembered and honoured as the city's 72 Martyrs in the Huanghuagang (\"Yellow Flower Mound\") Mausoleum.\n\nAll these failed revolutionary attempts would eventually lead to the Xinhai Revolution which successfully overthrew the Qing Dynasty to establish a new Han Chinese republic.\n\nKuomintang rule \n\nAfter the assassination of Song Jiaoren and Yuan Shikai's attempts to remove Nationalists from power, the leader of Guangdong Hu Hanmin joined the 1913 Second Revolution against him but was forced to flee to Japan with Sun Yat-sen after its failure. The city came under national spotlight again in 1917, when Prime Minister Duan Qirui's abrogation of the constitution triggered the Constitutional Protection Movement. Sun Yat-sen came to head the Guangzhou Military Government supported by the members of the dissolved parliament and the Southwestern warlords. The Guangzhou government fell apart as the warlords withdrew their support. Sun fled to Shanghai in November 1918 until the Guangdong warlord Chen Jiongming restored him in October 1920 during the Yuegui Wars. On 16 June 1922, Sun was ousted in a coup and fled on the warship Yongfeng after Chen sided with the Zhili Clique's Beijing government. In the following months Sun mounted a counterattack into Guangdong by rallying supporters from Yunnan and Guangxi, and in January established a government in the city for the third time.\n\nFrom 1923 to 1926 Sun and the Kuomintang used the city as a base to prosecute a renewed revolution in China by conquering the warlords in the north.  Although Sun was previously dependent on opportunistic warlords who hosted him in the city, with the leadership of Chiang Kai-shek, the KMT developed its own military power that served its ambition. The Canton years saw the evolution of the KMT into a revolutionary movement with a strong military focus and ideological commitment, setting the tone of the KMT rule of China beyond 1927.\n\nIn 1924 the KMT made the momentous decision to ally with the Communist Party and the USSR. With Soviet help, KMT reorganized itself along the Leninist line and adopted a pro-labor and pro-peasant stance. The Kuomintang-CCP cooperation was confirmed in the First Congress of the KMT and the communists were instructed to join the KMT. The allied government set up the Peasant Movement Training Institute in the city, of which Mao Zedong was a director for one term. Sun and his military commander Chiang used Soviet funds and weapons to build an armed force staffed by communist commissars, training its cadres in the Whampoa Military Academy. In August, the fledgling army suppressed the Canton Merchants' Corps Uprising. The next year the anti-imperialist May Thirtieth Movement swept the country, and the KMT government called for strikes in Canton and Hong Kong. The tensions of the massive strikes and protests led to the Shakee Massacre.\n\nAfter the death of Sun Yat-sen in 1925 the mood was changing in the party toward the communists. In August the left-wing KMT leader Liao Zhongkai was assassinated and the right-wing leader Hu Hanmin, the suspected mastermind, was exiled to the Soviet Union, leaving the pro-communist Wang Jingwei in charge. Opposing communist encroachment, the right-wing Western Hills Group vowed to expel the communists from the KMT. The \"Canton Coup\" on 20 March 1926 saw Chiang solidify his control over the Nationalists and their army against Wang Jingwei, the party's left wing, its Communist allies, and its Soviet advisors. By May, he had ended civilian control of the military and begun his Northern Expedition against the warlords of the north. Its success led to the split of the KMT and the subsequent purge of the communists in the Shanghai Massacre. When Zhang Fakui took Guangzhou from the New Guangxi Clique as part of the infighting in 1927, the communists saw an opening and launched the Guangzhou Uprising, but the rebel army units and armed workers were defeated after heavy fighting in the city.\n\nBy 1929, Chen Jitang had established himself as the military ruler of Guangdong. In 1931 he threw his weight behind the anti-Chiang schism which established a separate Nationalist government in Guangzhou.李洁之，陈济棠主粤始末，《广州文史》第三十七辑。 The separatists included prominent KMT leaders like Wang Jingwei, Sun Fo and others from diverse factions. While the intraparty division was resolved next year, Chen kept his power until he was defeated by Chiang in 1936.\n\nCommunist takeover \n\nAmid the closing months of the Chinese Civil War, Guangzhou briefly served as the capital of the Republic of China after the fall of Nanjing to communism in April 1949. The People's Liberation Army entered the city on 14 October 1949. Amid a massive exodus to Hong Kong and Macau, the Nationalists blew up the Haizhu Bridge across the Pearl River in retreat. The Cultural Revolution had a large effect on the city with much of its temples, churches and other monuments destroyed during this chaotic period.\n\nThe People's Republic of China initiated building projects including new housing on the banks of the Pearl River to adjust the city's boat people to life on land. Since the 1980s, the city's close proximity to Hong Kong and Shenzhen and its ties to overseas Chinese have made it one of the first beneficiaries of China's opening up under Deng Xiaoping. Beneficial tax reforms in the 1990s have also helped the city's industrialisation and development.\n\nThe municipality was expanded in the year 2000, with Huadu and Panyu joining the city as urban districts and Conghua and Zengcheng as more rural counties. The former districts of Dongshan and Fangcun were abolished in 2005, merged into Yuexiu and Liwan respectively. The city acquired Nansha and Luogang. The former was carved out of Panyu, the latter from parts of Baiyun, Tianhe, Zengcheng, and an exclave within Huangpu. The National People's Congress approved a development plan for the Pearl River Delta in January 2009; on March 19 the same year, the Guangzhou and Foshan municipal governments agreed to establish a framework to merge the two cities. In 2014, Luogang merged into Huangpu and both Conghua and Zengcheng counties were upgraded to districts. Guangzhou was then the most populous consolidated district-governed city in China until Beijing overtook it the next year.\n\nGallery \n\nFile:Nieuhof-Ambassade-vers-la-Chine-1665 0744-2.tif|Nieuhof's imaginative 1665 map of \"Kanton\", made from second-hand accounts while Europeans were still forbidden from entering the walled city\nFile:Canton factories.jpg|The Thirteen Factories , displaying the flags of Denmark, Spain, the United States, Sweden, Britain, and the Netherlands\nFile:Shop of Tingqua, the painter.jpg|An 1855 painting of the gallery of Tingqua, one of the most successful suppliers of \"export paintings\" for Guangzhou's foreign traders.Common themes included the Thirteen Factories, the Whampoa Anchorage (now Pazhou), and the Sea-Banner Temple (now Hoi Tong Monastery)\nFile:Canton1860.jpg|Vrooman's 1860 map of the \"City and Entire Suburbs of Canton\", one of the first made after the treaties of Tianjin and Beijing permitted foreigners full access to Guangzhou's walled city\nFile:Flowery Pagoda.jpg|The Flowery Pagoda at the Temple of the Six Banyan Trees in 1863\nFile:Lai Afong, Five Stories Pagoda Guangzhou, c1880.JPG|The Five-storey Pagoda atop Yuexiu Hill \nFile:Lai Afong, Sacred Heart Cathedral Guangzhou, c1880.JPG|The Sacred Heart Cathedral towering over the one- and two-storey homes of old Guangzhou \nFile:Canton street scene, 1919.jpg|Street scene in Guangzhou, 1919\nFile:Canton1920 d006 map of of the city.jpg|The US Navy's Dept of Navigation's 1920 map of \"Canton\"\nFile:Whampoa3.jpg|Sun Yat-sen and Chiang Kai-shek at the opening of the Whampoa Military Academy on 16 June 1924\nFile:The Bund Canton.jpg|The Guangzhou Bund in 1930, with rows of Tanka boats.\nFile:1937 Canton, China VP8.webm|A short film of Guangzhou in 1937\nFile:PLA Troops entered to Guangzhou.jpg|Communist troops entering Guangzhou on 14 October 1949\n\nGeography \n\nThe old town of Guangzhou was near Baiyun Mountain on the east bank of the Pearl River (Zhujiang) about 80 mi from its junction with the South China Sea and about 300 mi below its head of navigation. It commanded the rich alluvial plain of the Pearl River Delta, with its connection to the sea protected at the Humen Strait. The present city spans  on both sides of the river from  to  longitude and  to  latitude in south-central Guangdong. The Pearl is the 3rd-largest river of China. Baiyun Mountain is now locally referred to as the city's \"lung\" ().\n\nThe elevation of the prefecture generally increases from southwest to northeast, with mountains forming the backbone of the city and the ocean comprising the front. Tiantang Peak (, \"Heavenly Peak\") is the highest point of elevation at 1210 m above sea level.\n\nNatural resources \n\nThere are 47 different types of minerals and also 820 ore fields in Guangzhou, including 18 large and medium-sized oil deposits. The major minerals are granite, cement limestone, ceramic clay, potassium, albite, salt mine, mirabilite, nepheline, syenite, fluorite, marble, mineral water, and geothermal mineral water. Since Guangzhou is located in the water-rich area of southern China, it has a wide water area with lots of rivers and water systems, accounting for 10% of the total land area. The rivers and streams improve the landscape and keep the ecological environment of the city stable.\n\nClimate \n\nDespite being located just south of the Tropic of Cancer, Guangzhou has a humid subtropical climate (Köppen Cfa) influenced by the East Asian monsoon. Summers are wet with high temperatures, high humidity, and a high heat index. Winters are mild and comparatively dry. Guangzhou has a lengthy monsoon season, spanning from April through September. Monthly averages range from  in January to  in July, while the annual mean is . Autumn, from October to December, is very moderate, cool and windy, and is the best travel time. The relative humidity is approximately 68 percent, whereas annual rainfall in the metropolitan area is over 1700 mm. With monthly percent possible sunshine ranging from 17 percent in March and April to 52 percent in November, the city receives 1,628 hours of bright sunshine annually, considerably less than nearby Shenzhen and Hong Kong. Extreme temperatures have ranged from 0 °C to . The last recorded snowfall in the city was on 24 January 2016, 87 years after the second last recorded snowfall.\n\nAdministrative divisions \n\nGuangzhou is a sub-provincial city. It has direct jurisdiction over eleven districts:\n\nEconomy \n\nGuangzhou is the main manufacturing hub of the Pearl River Delta, one of mainland China's leading commercial and manufacturing regions. In 2013, the GDP reached ¥1542 billion (US$248 billion), per capita was ¥120,515 (US $19,459). Guangzhou is considered one of the most prosperous cities in China.  But due to rapid industrialisation, it is also considered one of the most polluted cities.\n\nThe Canton Fair, formally the \"China Import and Export Fair\", is held every year in April and October by the Ministry of Trade. Inaugurated in the spring of 1957, the fair is a major event for the city. It is the trade fair with the longest history, highest level, largest scale in China. From the 104th session onwards, the fair moved to the new Guangzhou International Convention and Exhibition Center () in Pazhou, from the older complex in Liuhua. The GICEC is served by two stations on Metro Line 8. Since the 104th session, the Canton Fair has been arranged in three phases instead of two phases.\n\nGuangzhou is one the largest hubs of China's illegal drug trade.\n\nFile:Guangzhou skyline.jpg|Guangzhou skyline\nFile:Canton Fair.jpg|The former Canton Fair site at Yuexiu's Liuhua Complex\nFile:Canton Trade Fair (tarotastic).jpg|A display at the current Canton Fair site in Pazhou\n\nLocal products \n\n* Cantonese is one of China's most famous and popular regional cuisines, with a saying stating simply to \"Eat in Guangzhou\" ()\n* Cantonese sculpture includes work in jade, wood, and (now controversially) ivory.\n* Canton porcelain developed over the past three centuries as one of the major forms of exportware. It is now known within China for its highly colorful style.\n* Cantonese embroidery is one of China's four main styles of the art and is represented in Guangzhou, although its principal centre is at Chaozhou.\n* Zhujiang Beer, a pale lager, is one of China's most successful brands. It is made in Guangzhou from water piped directly to the brewery from a natural spring.\n\nIndustry \n\nGuangzhou Peugeot Automobile Company produced the Peugeot 504 and Peugeot 505 automobiles from 1989 to 1997.\n\n* Guangzhou Economic and Technological Development Zone\n* Guangzhou Nansha Export Processing Zone\nThe Export Processing Zone was founded in 2005. Its total planned area is . It is located in Nansha District and it belongs to the provincial capital, Guangzhou. The major industries encouraged in the zone include automobile assembly, biotechnology and heavy industry. It is situated 54 km (70 minutes drive) south of Guangzhou Baiyun International Airport and close to Nansha Port. It also has the advantage of Guangzhou Metro line 4 which is being extended to Nansha Ferry Terminal.\n* Guangzhou Free Trade Zone\nThe zone was founded in 1992. It is located in the east of Huangpu District and near to Guangzhou Economic and Technological Development Zone. It is also very close to Guangzhou Baiyun Airport. The major industries encouraged in the zone include international trade, logistics, processing and computer software.\n\nScience City \n\n* Guangzhou Science City\n\nMalls and pedestrian streets \n\n* 101 Dynamics\n* Beijing Road\n* China Plaza\n* Jiangnanxi\n* Liwan Plaza\n* Shangxiajiu\n* Teem Plaza\n* Victory Plaza\n* Wanguo Plaza\n* Zhengjia Square (Grandview Mall Aquarium)\n* Wanda square\n* Happy Valley (Guangzhou)\n* TaiKoo Hui\n* Parc Central\n* OneLinkWalk\n* Rock Square\n* Aeon Mall\n* GT Land Plaza\n\nDemographics \n\nThe 2010 census found Guangzhou's population to be 12.78 million. , it was estimated at 13,080,500, with 11,264,800 urban residents. Its population density is thus around 1,800 people per km2. The built-up area of the Guangzhou proper connects directly to several other cities. The built-up area of the Pearl River Delta Economic Zone covers around  and has been estimated to house 22 million people, including Guangzhou's nine urban districts, Shenzhen (5.36m), Dongguan (3.22m), Zhongshan (3.12m), most of Foshan (2.2m), Jiangmen (1.82m), Zhuhai (890k), and Huizhou's Huiyang District (760k). The total population of this agglomeration is over 28 million after including the population of the adjacent Hong Kong Special Administrative Region. The area's fast-growing economy and high demand for labour has produced a huge \"floating population\" of migrant workers. Up to 10 million migrants reside in the area least six months each year. In 2008, about 5 million of Guangzhou's permanent residents were hukouless migrants.\n\nEthnicity \n\nMost of Guangzhou's population is Han Chinese. Almost all of the local Cantonese people speak Cantonese as their first language, while most migrants speak forms of Mandarin. In 2010, each language was the native tongue of roughly half of the city's population, although minor but substantial numbers speak other varieties as well. As with elsewhere in the People's Republic of China, the household registration system (hukou) limits migrants' access to residences, educational institutions and other public benefits. In May 2014, legally employed migrants in Guangzhou were permitted to receive a hukou card allowing them to marry and obtain permission for their pregnancies in the city, rather than having to return to their official hometowns as previously.\n\nHistorically, the Cantonese people have made up a sizeable part of the 19th- and 20th-century Chinese diaspora and many overseas Chinese have ties to Guangzhou. This is particularly true in the United States, Canada, and Australia.\n\nDemographically, the only significant immigration into China has been by overseas Chinese, but Guangzhou sees many foreign tourists, workers, and residents from the usual locations such as the United States. Notably, it is also home to thousands of African immigrants, including people from Nigeria, Angola and the Democratic Republic of Congo.\n\nMetropolitan area\n\nThe encompassing metropolitan area was estimated by the OECD (Organisation for Economic Co-operation and Development) to have, , a population of 25 million.Linked from the OECD [http://www.oecd.org/china/oecd-urban-policy-reviews-china-2015-9789264230040-en.htm here]\n\nTransportation \n\nUrban mass transit \n\nWhen the first line of the Guangzhou Metro opened in 1997, Guangzhou was the fourth city in Mainland China to have an underground railway system, behind Beijing, Tianjin, and Shanghai. Currently the metro network is made up of thirteen lines, covering a total length of . A long-term plan is to make the city's metro system expand to over 500 km by 2020 with 15 lines in operation. In addition to the metro system there is also the Haizhu Tram line which opened on 31 December 2014.\n\nThe Guangzhou Bus Rapid Transit (GBRT) system which was introduced in 2010 along Zhongshan Road. It has several connections to the metro and is the world's 2nd-largest Bus Rapid Transit system with 1,000,000 passenger trips daily. It handles 26,900 pphpd during the peak hour a capacity second only to the TransMilenio BRT system in Bogota. The system averages 1 bus every 10 seconds or 350 per hour in a single direction and contains the world's longest BRT stations—around 260 m including bridges.\n\nMotor transport \n\nIn the 19th century, city already boasted over 600 long, straight streets; these were mostly paved but still very narrow. In June 1919, work began on demolishing the city wall to make way for wider streets and the development of tramways. The demolition took three years in total.\n\nIn 2009, it was reported that all 9,424 buses and 17,695 taxis in Guangzhou would be operating on LPG-fuel by 2010 to promote clean energy for transport and improve the environment ahead of the 2010 Asian Games which were held in the city. At present, Guangzhou is the city that uses the most LPG-fueled vehicles in the world, and at the end of 2006, 6,500 buses and 16,000 taxis were using LPG, taking up 85 percent of all buses and taxis.\n\nEffective January 1, 2007, the municipal government banned motorcycles in Guangdong's urban areas. Motorcycles found violating the ban are confiscated. The Guangzhou traffic bureau claimed to have reported reduced traffic problems and accidents in the downtown area since the ban.\n\nAirports \n\nGuangzhou's main airport is the Baiyun International Airport in Baiyun District; it opened on August 5, 2004. This airport is the second busiest airport in terms of traffic movements in China. It replaced the old Baiyun International Airport, which was very close to the city centre but failed to meet the city's fast-growing air traffic demand. The old Baiyun International Airport was in operation for 72 years.\n\nGuangzhou Baiyun International Airport now has three runways, with two more planned. The Terminal 2 is under construction and will open in 2018.\n\nRailways \n\nGuangzhou is the terminus of the Beijing–Guangzhou, Guangzhou–Shenzhen, Guangzhou–Maoming and Guangzhou–Meizhou–Shantou conventional speed railways. In late 2009, the Wuhan–Guangzhou High-Speed Railway started service, with multiple unit trains covering 980 km at a top speed of 320 km/h.  In December 2014, the Guiyang–Guangzhou High-Speed Railway and Nanning-Guangzhou Railway began service with trains running at top speeds of 250 km/h and 200 km/h, respectively.(Chinese) [http://news.southcn.com/g/2014-12/26/content_115108037.htm 陈清浩, \"贵广高铁正式开通运营 从贵阳到广州4小时可达\" 南方日报] 2014-12-26 The Guangdong Through Train departs from the Guangzhou East railway station and arrives at the Hung Hom KCR station in Kowloon, Hong Kong. The route is approximately 182 km in length and the ride takes less than two hours. Frequent coach services are also provided with coaches departing every day from different locations (mostly major hotels) around the city. A number of regional railways radiating from Guangzhou started operating such as the Guangzhou–Zhuhai Intercity Railway and the Guangzhou-Zhaoqing Intercity Railway.\n\nWater transport \n\nThere are daily high-speed catamaran services between Nansha Ferry Terminal and Lianhua Shan Ferry Terminal in Guangzhou and the Hong Kong China Ferry Terminal, as well as between Nansha Ferry Terminal and Macau Ferry Pier in Hong Kong.\n\nFile:GongYuanQian-MTR-Gz.JPG|Gongyuanqian Station of the Guangzhou Metro\nFile:GBRT Tianhe Sports Center.JPG|Tianhe Sports Centre Station (GBRT)\nFile:Guangzhou Baiyun Airport 2.JPG|Baiyun International Airport in Huadu District\nFile:Guangzhou South Railway Station Platform CRH3 EMU.jpg|A CRH3 Train at Guangzhou South Railway Station\n\nCulture \n\nWithin China, the culture of the Cantonese people is a subset of the larger \"Southern\" or \"Lingnan\" cultural areas. Notable aspects of Guangzhou's cultural heritage include:\n\n* Cantonese language, the local and prestige variant of Yue Chinese\n* Cantonese cuisine, one of China's eight major culinary traditions\n* Cantonese opera, usually divided into martial and literary performances\n* Xiguan, the area west of the former walled city\n\nThe Guangzhou Opera House & Symphony Orchestra also perform classical Western music and Chinese compositions in their style. Cantonese music is a traditional style of Chinese instrumental music, while Cantopop is the local form of pop music and rock-and-roll which developed from neighbouring Hong Kong.\n\nReligions \n\nQing-era Guangzhou had around 124 religious pavilions, halls, and temples. Today, in addition to the Buddhist Association, Guangzhou also has a Taoist Association, a Jewish community, and a history with Christianity and Islam.\n\nDaoism \n\nDaoism and Chinese folk religion are still represented at a few of the city's temples. Among the most important is the Temple of the Five Immortals, honoring the five immortals credited with introducing rice cultivation at the foundation of the city. The five rams they rode were supposed to have turned into stones upon their departure and gave the city several of its nicknames. Another place of worship is the City God Temple. Guangzhou, like most of southern China, is also notably observant concerning ancestral veneration during occasions like the Tomb Sweeping and Ghost Festivals.\n\nBuddhism \n\nBuddhism is the most prominent religion in Guangzhou. The Zhizhi Temple was founded in  233 from the estate of a Wu official; it is said to comprise the residence of Zhao Jiande, the last of the Nanyue kings, and has been known as the Guangxiao Temple (\"Temple of Bright Filial Piety\") since the Ming. The missionary Bodhidharma is traditionally said to have visited Panyu during the Liu Song or Liang dynasties (5th or 6th century). Around  520, Emperor Wu of the Liang ordered the construction of the Baozhuangyan Temple and the Xilai Monastery to store the relics of Cambodian Buddhist saints which had been brought to the city and to house the monks beginning to assemble there. The Baozhuangyan is now known as the Temple of the Six Banyan Trees, after a famous poem composed by Su Shi after a visit during the Northern Song. The Xilai Monastery was renamed the Hualin Temple (\"Flowery Forest Temple\") after its reconstruction during the Qing.\n\nThe temples were damaged by both the Republican campaign to \"Promote Education with Temple Property\" () and the Maoist Cultural Revolution but have been renovated since the opening up that began in the 1980s. The Ocean Banner Temple on Henan Island, once famous in the west as the only tourist spot in Guangzhou accessible to foreigners, has been reopened as the Hoi Tong Monastery.\n\nChristianity \n\nNestorian Christians first arrived in China via the overland Silk Road, but suffered during Emperor Wuzong's 845 persecution and were essentially extinct by the year 1000. The Qing-era ban on foreigners limited missionaries until it was abolished following the First Opium War, although the Protestant Robert Morrison was able to perform some work through his service with the British factory. The Catholic archdiocese is housed at Guangzhou's Sacred Heart Cathedral, known locally as the \"Stone House\". A Gothic Revival edifice which was built by hand from 1861 to 1888 under French direction, its original Latin and French stained-glass windows were destroyed during the wars and amid the Cultural Revolution; they have since been replaced by English ones. The Canton Christian College (1888) and Hackett Medical College for Women (1902) were both founded by missionaries and now form part of Guangzhou's Lingnan. Since the opening up of China in the 1980s, there has been renewed interest in Christianity, but Guangzhou maintains pressure on underground churches which avoid registration with government officials. The Catholic archbishop Dominic Tang was imprisoned without trial for 22 years, but his present successor is recognised by both the Vatican and China's Patriotic Church.\n\nIslam \n\nGuangzhou has had a Muslim community since very early in the history of Islam; the native or nativised adherents of the faith are known as the Hui. Huaisheng Mosque was probably built during the Tang Dynasty. Muslims sacked the city in 758 and were massacred by the Chinese rebel Huang Chao in 878, along with the Jews, Christians, and Parsis.  The modern city includes numerous halal restaurants.\n\nFile:WuXianGuan-rams-0484.jpg|Guangzhou's Temple of the Five Immortals\nFile:John Thomson - Wah Lum Chu, Canton - cropped.jpg| at the  (Hualin) in the 1870s\nFile:The Mahavira Palace of Guangxiaosi.jpg| (Guangxiao)\nFile:Guangzhou Chenghuang Miao 2014.01.24 16-47-58.jpg|Guangzhou's City God Temple\nFile:The Sea-screen Temple at Honam Canton.png|The sacred pigs of the Ocean Banner Temple (Haichuan/ in the 1830s\n\nFile:Canton pagoda de las flores.JPG| at the Temple of the Six Banyan Trees (Liurong)\nFile:Hoi Tong Monastery Pagoda.JPG|The Thousand Buddha Tower at the present-day \nFile:Guangzhou Shishi Shengxin Dajiaotang 2012.11.15 10-46-30.jpg|Sacred Heart Cathedral\nFile:Mosque, Canton.jpg|Huaisheng Mosque and its \"Plain Pagoda\" minaret in 1860\n\nSport \n\nThe 18,000 seat Guangzhou International Sports Arena will be one of the venues for the 2019 FIBA Basketball World Cup.[http://www.fiba.com/basketballworldcup/2019 The Official website of the 2019 FIBA Basketball World Cup], FIBA.com, Retrieved 9 March 2016.\n\nFrom 12–27 November 2010, Guangzhou hosted the 16th Asian Games. The same year, it hosted the first Asian Para Games from December 12 to 19. Combined, these were the largest sporting events the city ever hosted.\n\nGuangzhou also hosted the following major sporting events:\n* 1987 The 6th National Games of China\n* 1991 The 1st FIFA Women's World Cup\n* 2001 The 2001 National Games of China\n* 2007 The 8th National Traditional Games of Ethnic Minorities of the People's Republic of China\n* 2008 The 49th World Table Tennis Championships\n* 2009 The 11th Sudirman Cup: the world badminton mixed team championships\n\nCurrent professional sports clubs based in Guangzhou include:\n\nGuangzhou Evergrande Taobao F.C. has risen in recent years to be a powerhouse in association football in China, having won seven consecutive national titles between 2011 and 2017. The team also won the AFC Champions League in 2013 and 2015. The club competed in the 2013 FIFA Club World Cup, where it lost 3–0 in the semi-final stage to the 2012–13 UEFA Champions League winners FC Bayern Munich.\n\nDestinations \n\nEight Views \n\nThe Eight Views of Ram City are Guangzhou's eight most famous tourist attractions. They have varied over time since the Song dynasty, with some being named or demoted by emperors. The following modern list was chosen through public appraisal in 2011:\n\n* \"Towers Shining through the New Town\"\n* \"The Pearl River Flowing and Shining\": The Pearl River from Bai'etan to Pazhou\n* \"Cloudy Mountain Green and Tidy\": Baiyun Mountain Scenic Area\n* \"Yuexiu's Grandeur\": Yuexiu Hill and Park\n* \"The Ancient Academy's Lingering Fame\": The Chen Clan Ancestral Hall and its folk art museum\n* \"Liwan's Wonderful Scenery\": Liwan Lake\n* \"Science City, Splendid as Brocade\"\n* \"Wetlands Singing at Night\": Nansha Wetlands Park\n\nFile:Pearl River Night Cruise.jpg|The Pearl River at Haiyin Bridge\nFile:Guangzhou BaiyunShan.jpg|Zhujiang New City from Pakwan or Baiyun Mountain\nFile:刘庆伏狼驹3.jpg|A brick carving at the Guangzhou Folk Art Museum, housed in the Chen Clan Ancestral Hall\n\nParks and gardens \n\n* Baiyun Mountain\n* Nansha Wetland Park\n* People's Park\n* South China Botanical Garden\n* Yuexiu Park\n* Dongshanhu Park ()\n* Liuhuahu Park ()\n* Liwanhu Park ()\n* Luhu Park ()\n* Martyrs' Park ()\n* Pearl River Park ()\n* Yuntai Garden ()\n\nTourist attractions \n\nGuangzhou attracts more than 100 million visitors each year. There are many tourist attractions, including:\n\n* Canton Tower\n* Chen Clan Ancestral Hall, housing Guangzhou's folk art museum\n* Chime-Long Paradise\n* Chime-Long Waterpark ()\n* Guangdong Provincial Museum\n* Guangzhou Zoo\n* Huaisheng Mosque, site of the Plain Pagoda\n* Museum of the Mausoleum of the Nanyue King\n* Peasant Movement Training Institute, an important Maoist site\n* Sacred Heart Cathedral or Stone House\n* Temple of Bright Filial Piety (Guangxiao)\n* Temple of the Six Banyan Trees (Liurong), site of the Flowery Pagoda\n* Shamian or Shameen Island, the old trading compound\n* Sun Yat-sen Memorial Hall, site of Guangzhou's former presidential palace\n* Xiguan, the western suburbs of the old city\n\nMajor buildings \n\n \n\n* CITIC Plaza\n* Canton Tower\n* Guangzhou Circle Mansion\n* Guangdong Olympic Stadium\n* Guangzhou Opera House\n* Guangzhou TV Tower\n* Pearl River Tower\n* The Twin Towers:\n** International Finance Centre (West)\n** The CTF Guangzhou (East)\n\nFile:OldGzCustoms3.JPG|Canton Custom House (est. 1916), one of the oldest surviving in China\nFile:Ai Qun Hotel.JPG|Aiqun Hotel, Guangzhou's tallest building from 1937 to 1967\nFile:Our Lady of Lourdes Chapel.jpg|Our Lady of Lourdes Chapel on Shamian\nFile:Dabenying (Generalissimo Sun Yat-sen%27s Mansion).jpg|The Canton Cement Factory (est. 1907), which housed Sun Yat-sen from 1923 to 1925\nFile:Guangzhou Guangdong Ziyi Ju Jiuzhi 2014.01.24 15-05-46.jpg|The old provincial capitol, now the Museum of Revolutionary History\nFile:Guangzhou (6344321124).jpg|Guangzhou's CBD, including the IFC (right)\n\nMedia \n\nGuangzhou has two local radio stations: the provincial Radio Guangdong and the municipal Radio Guangzhou. Together they broadcast in more than a dozen channels. The primary language of both stations is Cantonese. Traditionally only one channel of Radio Guangdong is dedicated to Mandarin Chinese. However, in recent years there has been an increase in Mandarin programmes on most Cantonese channels. Radio stations from cities around Guangzhou mainly broadcast in Cantonese and can be received in different parts of the city, depending on the radio stations' locations and transmission power. The Beijing-based China National Radio also broadcasts Mandarin programmes in the city. Radio Guangdong has a 30-minute weekly English programme, Guangdong Today, which is broadcast globally through the World Radio Network. Daily English news programmes are also broadcast by Radio Guangdong.\n\nGuangzhou has some of the best Chinese-language newspapers and magazines in mainland China, most of which are published by three major newspaper groups in the city, the Guangzhou Daily Press Group, Nanfang Press Corporation, and the Yangcheng Evening News Group. The two leading newspapers of the city are Guangzhou Daily and Southern Metropolis Daily. The former, with a circulation of 1.8 million, has been China's most successful newspaper for 14 years in terms of advertising revenue, while Southern Metropolis Daily is considered one of the most liberal newspapers in mainland China. In addition to Guangzhou's Chinese-language publications, there are a few English magazines and newspapers. The most successful is That's Guangzhou, which started more than a decade ago and has since blossomed into That's PRD, producing expatriate magazines in Beijing and Shanghai as well. It also produces In the Red.\n\nEducation \n\nThe Guangzhou Higher Education Mega Centre, also known as Guangzhou University Town (), is a large tertiary education complex located in the southeast suburbs of Guangzhou. It occupies the entirety of Xiaoguwei Island in Panyu District, covering an area of about 18 km2. The complex accommodates campuses from ten higher education institutions and can eventually accommodate up to 200,000 students, 20,000 teachers, and 50,000 staff.\n\nThe Guangzhou Higher Education Mega Centre higher education campuses:\n* Guangdong Pharmaceutical University\n* Guangdong University of Foreign Studies\n* Guangdong University of Technology\n* Guangzhou Academy of Fine Arts\n* Guangzhou University\n* Guangzhou University of Chinese Medicine\n* South China Normal University\n* South China University of Technology\n* Sun Yat-sen University\n* Xinghai Conservatory of Music\n\nGuangzhou's other fully accredited and degree-granting universities and colleges include:\n* Guangdong Institute of Science and Technology\n* Guangdong Polytechnic Normal University\n* Guangdong University of Finance & Economics\n* Guangdong University of Finance\n* Guangzhou College of South China University of Technology\n* Guangzhou Medical University\n* Guangzhou Sports University\n* Jinan University\n* South China Agricultural University\n* Southern Medical University\n* Zhongkai University of Agriculture and Engineering\n\nThe two main comprehensive libraries are Guangzhou Library and Sun Yat-sen Library of Guangdong Province. Guangzhou Library is a public library in Guangzhou. The library has moved to a new building in Zhujiang New Town, which fully opened on 23 June 2013. Sun Yat-sen Library of Guangdong Province has the largest collection of ancient books in Southern China.\n\nInternational relations \n\nTwin towns and sister cities \n\nGuangzhou currently maintains sister city agreements with the following foreign cities.\n\n*  Fukuoka, Japan (since 1979)\n*  Los Angeles, United States (since 1981)\n*  Manila, Philippines (since 1982)\n*  Vancouver, Canada (since 1985)\n*  Sydney, Australia (since 1986)\n*  Bari, Italy (since 1986)\n*  Lyon, France (since 1988)\n*  Frankfurt, Germany (since 1988)\n*  Auckland, New Zealand (since 1989)\n*  Gwangju, South Korea (since 1996)\n*  Linköping, Sweden (since 1997)\n*  Durban, South Africa (since 2000)\n*  Bristol, United Kingdom (since 2001)\n*  Yekaterinburg, Russia (since 2002)\n*  Arequipa, Peru (since 2004)\n*  Surabaya, Indonesia (since 2005)\n*  Vilnius, Lithuania (since 2006)\n*  Birmingham, United Kingdom (since 2006)\n*  Hambantota, Sri Lanka (since 2007)\n*  Recife, Brazil (since 2007)\n*  Tampere, Finland (since 2008)\n*  Bangkok, Thailand (since 2009)\n*  Kota Kinabalu, Malaysia (since 2011)\n*  Petaling Jaya, Malaysia (since 2012)\n*  Rabat, Morocco (since 2013)\n*  Ahmedabad, India (since 2014)\n*  Łódź, Poland (since 2014)\n*  Ecatepec, Mexico (since 2016)\n*  Genoa, Italy (since 2016). Guangzhou. http://en.wikipedia.org/?curid=12537."
  }
}
