{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17546",
  "eid" : "2c9e0550-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778584101,
  "textBody" : "The Louvre,The New Oxford American Dictionary gives the respelling \"/'lv(rə)/\", which has been converted to its IPA equivalent. The portion within parentheses indicates a variant pronunciation. or the Louvre Museum (), is the world's largest art museum and a historic monument in Paris, France. A central landmark of the city, it is located on the Right Bank of the Seine in the city's 1st arrondissement (district or ward). Approximately 38,000 objects from prehistory to the 21st century are exhibited over an area of 72,735 square metres (782,910 square feet).http://www.louvre.fr/sites/default/files/dp_pyramide%2028102014_en.pdf In 2017, the Louvre was the world's most visited art museum, receiving 8.1 million visitors. \n\nThe museum is housed in the Louvre Palace, originally built as a fortress in the late 12th to 13th century under Philip II. Remnants of the fortress are visible in the basement of the museum. Due to the urban expansion of the city, the fortress eventually lost its defensive function and, in 1546, was converted by Francis I into the main residence of the French Kings. The building was extended many times to form the present Louvre Palace. In 1682, Louis XIV chose the Palace of Versailles for his household, leaving the Louvre primarily as a place to display the royal collection, including, from 1692, a collection of ancient Greek and Roman sculpture. In 1692, the building was occupied by the Académie des Inscriptions et Belles Lettres and the Académie Royale de Peinture et de Sculpture, which in 1699 held the first of a series of salons. The Académie remained at the Louvre for 100 years. During the French Revolution, the National Assembly decreed that the Louvre should be used as a museum to display the nation's masterpieces.\n\nThe museum opened on 10 August 1793 with an exhibition of 537 paintings, the majority of the works being royal and confiscated church property. Because of structural problems with the building, the museum was closed in 1796 until 1801. The collection was increased under Napoleon and the museum was renamed Musée Napoléon, but after Napoleon's abdication many works seized by his armies were returned to their original owners. The collection was further increased during the reigns of Louis XVIII and Charles X, and during the Second French Empire the museum gained 20,000 pieces. Holdings have grown steadily through donations and bequests since the Third Republic. The collection is divided among eight curatorial departments: Egyptian Antiquities; Near Eastern Antiquities; Greek, Etruscan and Roman Antiquities; Islamic Art; Sculpture; Decorative Arts; Paintings; Prints and Drawings.\n\nHistory\n\n12th–20th centuries\n\nMedieval, Renaissance, and Bourbon palace \n\nThe Louvre Palace, which houses the museum, was begun as a fortress by Philip II in the 12th century to protect the city from English soldiers which were in Normandy. Remnants of this castle are still visible in the crypt.Mignot, p. 32 Whether this was the first building on that spot is not known; it is possible that Philip modified an existing tower. According to the authoritative Grand Larousse encyclopédique, the name derives from an association with wolf hunting den (via Latin: lupus, lower Empire: lupara).Edwards, pp. 193–94In Larousse Nouveau Dictionnaire étymologique et historique, Librairie Larousse, Paris, 1971, p. 430: ***loup 1080, Roland (leu, forme conservée dans à la queue leu leu, Saint Leu, etc.); du lat. lupus; loup est refait sur le fém. louve, où le *v* a empêché le passage du *ou* à *eu* (cf. Louvre, du lat. pop. lupara)*** the etymology of the word louvre is from lupara, feminine (pop. Latin) form of lupus. In the 7th century, St. Fare, an abbess in Meaux, left part of her \"Villa called Luvra situated in the region of Paris\" to a monastery.;In Lebeuf (Abbé), Fernand Bournon, Histoire de la ville et de tout le diocèse de Paris par l'abbé Lebeuf, Vol. 2, Paris: Féchoz et Letouzey, 1883, p. 296: \"Louvre\". this territory probably did not correspond exactly to the modern site, however.\n\nThe Louvre Palace was altered frequently throughout the Middle Ages. In the 14th century, Charles V converted the building into a residence and in 1546, Francis I renovated the site in French Renaissance style.Edwards, p. 198 Francis acquired what would become the nucleus of the Louvre's holdings, his acquisitions including Leonardo da Vinci's Mona Lisa. After Louis XIV chose Versailles as his residence in 1682, constructions slowed; however, the move permitted the Louvre to be used as a residence for artists, under Royal patronage.Mignot, p. 42Nore, p. 274 Four generations of Boulle were granted Royal patronage and resided in the Louvre in the following order: Pierre Boulle, Jean Boulle, Andre-Charles Boulle and his four sons (Jean-Philippe, Pierre-Benoît (c.1683-1741), Charles-André (1685–1749) and Charles-Joseph (1688–1754)), after him. André-Charles Boulle (11 November 164229 February 1732) is the most famous French cabinetmaker and the preeminent artist in the field of marquetry , also known as \"Inlay\".  Boulle was \"the most remarkable of all French cabinetmakers\"Theodore Dell, The Frick Collection, V: Furniture in the Frick Collection (1992:187).. He was commended to Louis XIV of France, the \"Sun King\", by Jean-Baptiste Colbert (29 August 1619 – 6 September 1683) as being “the most skilled craftsman in his profession”.  Before the fire of 1720 destroyed them, André-Charles Boulle held priceless works of art in the Louvre, including forty-eight drawings by Raphael'. C.R. Williams, \"The Mentor:Furniture and its Makers Vol.1, No. 30, Serial Number 30, September 7, 2015, [EBook #49904]\n\nBy the mid-18th century there were an increasing number of proposals to create a public gallery, with the art critic La Font de Saint-Yenne publishing, in 1747, a call for a display of the royal collection. On 14 October 1750, Louis XV agreed and sanctioned a display of 96 pieces from the royal collection, mounted in the Galerie royale de peinture of the Luxembourg Palace. A hall was opened by Le Normant de Tournehem and the Marquis de Marigny for public viewing of the Tableaux du Roy on Wednesdays and Saturdays, and contained Andrea del Sarto's Charity and works by Raphael; Titian; Veronese; Rembrandt; Poussin or Van Dyck, until its closing in 1780 as a result of the gift of the palace to the Count of Provence (the future king, Louis XVIII) by the king in 1778. Under Louis XVI, the royal museum idea became policy.Carbonell, p. 56 The comte d'Angiviller broadened the collection and in 1776 proposed conversion of the Grande Galerie of the Louvre – which contained maps – into the \"French Museum\". Many proposals were offered for the Louvre's renovation into a museum; however, none was agreed on. Hence the museum remained incomplete until the French Revolution.\n\nFrench Revolution\n\nDuring the French Revolution the Louvre was transformed into a public museum. In May 1791, the Assembly declared that the Louvre would be \"a place for bringing together monuments of all the sciences and arts\". On 10 August 1792, Louis XVI was imprisoned and the royal collection in the Louvre became national property. Because of fear of vandalism or theft, on 19 August, the National Assembly pronounced the museum's preparation as urgent. In October, a committee to \"preserve the national memory\" began assembling the collection for display.Oliver, p. 21–22\n\nOpening\n\nThe museum opened on 10 August 1793, the first anniversary of the monarchy's demise. The public was given free accessibility on three days per week, which was \"perceived as a major accomplishment and was generally appreciated\".Oliver, p. 35 The collection showcased 537 paintings and 184 objects of art. Three quarters were derived from the royal collections, the remainder from confiscated émigrés and Church property (biens nationaux).Mignot, pp. 68, 69 To expand and organize the collection, the Republic dedicated 100,000 livres per year.Nora, p. 278 In 1794, France's revolutionary armies began bringing pieces from Northern Europe, augmented after the Treaty of Tolentino (1797) by works from the Vatican, such as Laocoön and His Sons and the Apollo Belvedere, to establish the Louvre as a museum and as a \"sign of popular sovereignty\".McClellan, p. 7\n\nThe early days were hectic; privileged artists continued to live in residence, and the unlabelled paintings hung \"frame to frame from floor to ceiling\".Alderson, p.24, 25 The structure itself closed in May 1796 due to structural deficiencies. It reopened on 14 July 1801, arranged chronologically and with new lighting and columns.\n\nNapoleon\n\nUnder Napoleon I, a northern wing paralleling the Grande Galerie was begun, and the collection grew through successful military campaigns.Mignot, p. 52 Following the Egyptian campaign of 1798–1801, Napoléon appointed the museum's first director, Dominique Vivant Denon. In tribute, the museum was renamed the \"Musée Napoléon\" in 1803, and acquisitions were made of Spanish, Austrian, Dutch, and Italian works, either as spoils or through treaties such as the Treaty of Tolentino. At the end of Napoleon's First Italian Campaign in 1797, the Treaty of Campo Formio was signed with Count Philipp von Cobenzl of the Austrian Monarchy. This treaty not only marked the completion of Napoleon's conquest of Italy, but also the end of the first phases of the French Revolutionary Wars. Under this treaty, Italian cities were required to contribute pieces of art and patrimony to take part in Napoleon's \"parades of booty\" through Paris before being put into the Louvre Museum.Plant, p. 36 One of the most famous pieces taken under this program was the Horses of Saint Mark. The four antique bronze horses, which had adorned the basilica of San Marco in Venice after the sack of Constantinople in 1204, were brought to Paris to reside atop Napoleon's Arc du Carrousel in Paris in 1797.\n\nSeveral churches and palaces, including Saint Mark's Basilica, were looted by the French, which outraged the Italians and their artistic and cultural sensibilities.Popkin, p.88 In 1797, the Treaty of Tolentino was signed by Napoleon, and two statues, the Nile and Tiber, were taken to Paris. These statues had previously been in the Vatican, and both were housed in the Louvre until 1815. After the defeat of Napoleon, the Nile was returned to Italy. However, the Tiber remained in the Louvre Museum and can be seen in the collections today.\n\nThe Italian Peninsula was not the only region from which Napoleon took art. Under the Directory government of the 1790s, Napoleon (then a General) led an expedition to Egypt. The campaign was an expansionist effort on the part of the government, but the Directory had another goal to make Paris the center of art, science, and culture.Popkin, p. 89 The Directory wanted France to assume responsibility for liberating the works of art they deemed in danger in order to protect and nationalize the heritage and culture of their subjects.Bierman, p. 41 As a result, there were teams of artists and scientists who accompanied the armies into battle equipped with lists of paintings, sculptures, and other pieces of patrimony that would be collected, crated, and shipped back to France.Bierman, p.42\n\nDominique Vivant Denon was Napoleon's art advisor, and accompanied him on the expedition to Egypt. Through his initiative, the Valley of the Kings in Egypt was discovered and studied extensively.Strathern, p. 305 As a result, he was later installed by Napoleon as the director of Musée Napoléon, formerly the Louvre, cementing the status of the museum as a center for global patrimony and storehouse for cultural heritage.Quynn, Dorothy (1945) \"The Art Confiscations of the Napoleonic Wars\". The American Historical Review. https://www.jstor.org/stable/1843116 p. 442\n\nOne of the most important discoveries made during Napoleon's campaign in Egypt was the Rosetta Stone. It was discovered in 1799, and eventually led to the ability to decipher ancient hieroglyphs. Although the Rosetta Stone was discovered by the French, it actually never made it to the Louvre Museum. It was seized by British Forces following the defeat of Napoleon in Egypt and the subsequent signing of the Treaty of Alexandria in 1801.Parkinson, Pg. 28 It is now on display at the British Museum.Bierman, p. 161\n\nAfter the French defeat at Waterloo, the works' former owners sought their return. The Louvre's administrators were loath to comply and hid many works in their private collections. In response, foreign states sent emissaries to London to seek help, and many pieces were returned, even some that had been restored by the Louvre.Alderson, p.25Mignot, p. 69. According to Mignot, Mantegna's Calvary, Veronese's The Wedding at Cana|The Marriage of Cana, and Rogier van der Weyden's Annunciation were not returned. In 1815 Louis XVIII finally concluded agreements with the Austrian government for the keeping of pieces such as Veronese's Wedding at Cana which was exchanged for a large Le Brun or the repurchase of the Albani collection.\n\nRestoration and Second Empire\n\nDuring the Restoration (1814–30), Louis XVIII and Charles X between them added 135 pieces at a cost of 720,000 francs and created the department of Egyptian antiquities curated by Champollion, increased by more than 7,000 works with the acquisition of antiquities in the Edme-Antoine Durand, the Egyptian collection of Henry Salt or the second collection former by Bernardino Drovetti. This was less than the amount given for rehabilitation of Versailles, and the Louvre suffered relative to the rest of Paris. After the creation of the French Second Republic in 1848, the new government allocated two million francs for repair work and ordered the completion of the Galerie d'Apollon, the Salon Carré, and the Grande Galérie. In 1861, Louis-Napoléon Bonaparte bought 11,835 artworks including 641 paintings, Greek gold and other antiquities of the Campana collection. During the Second French Empire, between 1852 and 1870, the French economy grew; by 1870 the museum had added 20,000 new pieces to its collections, and the Pavillon de Flore and the Grande Galérie were remodelled under architects Louis Visconti and Hector Lefuel.Mignot, pp. 52–54\n\nDamage during the 1871 Paris Commune\n\nThe Louvre was damaged during the suppression of the Paris Commune.  On 23 May 1871, as the French Army advanced into Paris, a force of Communard soldiers led by Jules Bergeret set fire to the adjoining Tuileries Palace. The fire burned for forty-eight hours, entirely destroying the interior of the palace and spreading to the museum next to it.  The library of the museum and some of the adjoining halls were destroyed, but the museum was saved by the efforts of Paris firemen and museum employees.Rene Heron de Villefosse, Histoire de Paris, Bernard Grasset (1959). The father of the author of this book was an assistant curator at the Louvre, and helped put out the fires\n\nThird Republic and World Wars\n\nDuring the Third Republic (1870–1940) the Louvre acquired new pieces mainly via donations and gifts. The Société des Amis du Louvre donated the Pietà of Villeneuve-lès-Avignon, and in 1863 an expedition uncovered the sculpture Winged Victory of Samothrace in the Aegean Sea. This piece, though heavily damaged, has been prominently displayed since 1884. The 583-item Collection La Caze donated in 1869, included works by Chardin; Fragonard; Rembrandt – such as Bathsheba at Her Bath – and Gilles by Watteau.Mignot, pp. 70–71\n\nMuseum expansion slowed after World War I, and the collection did not acquire many significant new works; exceptions were Georges de La Tour's Saint Thomas and Baron Edmond de Rothschild's (1845–1934) 1935 donation of 4,000 engravings, 3,000 drawings, and 500 illustrated books.\nAt the beginning of World War II the museum removed most of the art and hid valuable pieces. When Germany occupied the Sudetenland, many important artworks such as the Mona Lisa were temporarily moved to the Château de Chambord. When war was formally declared a year later, most of the museum's paintings were sent there as well. Select sculptures such as Winged Victory of Samothrace and the Venus de Milo were sent to the Château de Valençay.Alan Riding, And the Show Went On: Cultural Life in Nazi-Occupied Paris. Alfred A Knopf, New York: 2010. p34. On 27 August 1939, after two days of packing, truck convoys began to leave Paris. By 28 December, the museum was cleared of most works, except those that were too heavy and \"unimportant paintings [that] were left in the basement\".Matila Simon, \"The battle of the Louvre;: The struggle to save French art in World War II\". Hawthorn Books, 1971. p. 23. In early 1945, after the liberation of France, art began returning to the Louvre.Simon, p. 177\n\nGrand Louvre Pyramids\n\nBy 1874, the Louvre Palace had achieved its present form of an almost rectangular structure with the Sully Wing to the east containing the Cour Carrée (Square Court) and the oldest parts of the Louvre; and two wings which wrap the Cour Napoléon, the Richelieu Wing to the north and the Denon Wing, which borders the Seine to the south.Mignot, p. 13 In 1983, French President François Mitterrand proposed, as one of his Grands Projets, the Grand Louvre plan to renovate the building and relocate the Finance Ministry, allowing displays throughout the building. Architect I. M. Pei was awarded the project and proposed a glass pyramid to stand over a new entrance in the main court, the Cour Napoléon.Mignot, p. 66 The pyramid and its underground lobby were inaugurated on 15 October 1988 and the Louvre Pyramid was completed in 1989. The second phase of the Grand Louvre plan, La Pyramide Inversée (The Inverted Pyramid), was completed in 1993. As of 2002, attendance had doubled since completion.\n\n21st century\n\nThe Musée du Louvre contains more than 380,000 objects and displays 35,000 works of art in eight curatorial departments with more than 60600 m2 dedicated to the permanent collection. The Louvre exhibits sculptures, objets d'art, paintings, drawings, and archaeological finds. It is the world's most visited museum, averaging 15,000 visitors per day, 65 percent of whom are foreign tourists.\n\nAfter architects Mario Bellini and Rudy Ricciotti had won an international competition to create its new galleries for Islamic art, the new 3,000 sq mGareth Harris (13 September 2012), [http://www.ft.com/cms/s/2/ad9c2ff2-f5bf-11e1-bf76-00144feabdc0.html#axzz26xYVPBmB Islamic art, covered] Financial Times. pavilion eventually opened in 2012, consisting of ground- and lower-ground-level interior spaces topped by a golden, undulating roof (fashioned from almost 9,000 steel tubes that form an interior web) that seems to float within the neo-Classical Visconti Courtyard in the middle of the Louvre's south wing.Carol Vogel (19 September 2012), [https://www.nytimes.com/2012/09/20/arts/design/the-louvres-new-islamic-galleries-bring-riches-to-light.html The Louvre's New Islamic Galleries Bring Riches to Light] New York Times. The galleries, which the museum had initially hoped to open by 2009, represent the first major architectural intervention at the Louvre since the addition of I.M. Pei's glass pyramid in 1989.\n\nOn 5 February 2015, about one hundred archaeologists, protesting against commercial private involvement to protect France's heritage, blocked Louvre's ticket desks to facilitate free access to the museum. At least one announcement reading \"Free entrance offered by the archeologists\" has been attached to the ticket desk and a number of people visited the museum free of charge.\n\nThe Louvre is owned by the French government; however, since the 1990s it has become more independent. Since 2003, the museum has been required to generate funds for projects. By 2006, government funds had dipped from 75 percent of the total budget to 62 percent. Every year, the Louvre now raises as much as it gets from the state, about €122 million. The government pays for operating costs (salaries, safety and maintenance), while the rest – new wings, refurbishments, acquisitions – is up to the museum to finance.Farah Nayeri (20 January 2009), [https://www.nytimes.com/2009/01/20/business/worldbusiness/20iht-louvre.4.19526510.html Banks compete to manage Louvre's endowment] International Herald Tribune. A further €3 million to €5 million a year is raised by the Louvre from exhibitions that it curates for other museums, while the host museum keeps the ticket money. As the Louvre became a point of interest in the book The Da Vinci Code and the 2006 film based on the book, the museum earned $2.5 million by allowing filming in its galleries.Lunn, p. 137 In 2008, the French government provided $180 million of the Louvre's yearly $350 million budget; the remainder came from private contributions and ticket sales.\n\nThe Louvre employs a staff of 2,000 led by Director Jean-Luc Martinez,[http://www.lemonde.fr/culture/article/2013/04/03/un-archeologue-prend-la-direction-du-louvre_3152530_3246.html Un archéologue prend la direction du Louvre], Le Monde du 3 April 2013. who reports to the French Ministry of Culture and Communications. Martinez replaced Henri Loyrette in April 2013. Under Loyrette, who replaced Pierre Rosenberg in 2001, the Louvre has undergone policy changes that allow it to lend and borrow more works than before. In 2006, it loaned 1,300 works, which enabled it to borrow more foreign works. From 2006 to 2009, the Louvre lent artwork to the High Museum of Art in Atlanta, Georgia, and received a $6.9 million payment to be used for renovations.\n\nIn 2012, the Louvre and the Fine Arts Museums of San Francisco announced a five-year collaboration on exhibitions, publications, art conservation and educational programming.Scarlet Cheng (15 November 2012), [http://theartnewspaper.com/articles/Louvre+and+San+Francisco+museums+sign+five-year+deal/28063 Louvre and Sll Francisco museums sign five-year deal]  The Art Newspaper. The €98.5 million expansion of the Islamic Art galleries in 2012 received state funding of €31 million, as well as €17 million from the Alwaleed Bin Talal Foundation founded by the eponymous Saudi prince. The republic of Azerbaijan, the Emir of Kuwait, the Sultan of Oman and King Mohammed VI of Morocco donated in total €26 million. In addition, the opening of the Louvre Abu Dhabi is supposed to provide €400 million over the course of 30 years for its use of the museum's prestigious brand. Loyrette has tried to improve weak parts of the collection through income generated from loans of art and by guaranteeing that \"20% of admissions receipts will be taken annually for acquisitions\". He has more administrative independence for the museum and achieved 90 percent of galleries to be open daily, as opposed to 80 percent previously. He oversaw the creation of extended hours and free admission on Friday nights and an increase in the acquisition budget to $36 million from $4.5 million.\n\nSatellite museums\n\nLens\n\nIn 2004, French officials decided to build a satellite museum on the site of an abandoned coal pit in the former mining town of Lens to relieve the crowded Paris Louvre, increase total museum visits, and improve the industrial north's economy. Six cities were considered for the project: Amiens, Arras, Boulogne-sur-Mer, Calais, Lens, and Valenciennes. In 2004, French Prime Minister Jean-Pierre Raffarin chose Lens to be the site of the new building, the Louvre-Lens. Japanese architects SANAA were selected to design the Lens project in 2005. Museum officials predicted that the new building, capable of receiving about 600 works of art, would attract up to 500,000 visitors a year when it opened in 2012.\n\nAbu Dhabi\n\nOn 8 November 2017, a direct extension of the Louvre, Louvre Abu Dhabi, opened its doors to the public in the city of Abu Dhabi. A 30-year agreement, signed by French Culture Minister Renaud Donnedieu de Vabres and Sheik Sultan bin Tahnoon Al Nahyan, established the museum on Saadiyat Island in Abu Dhabi in exchange for €832,000,000 (US$1.3 billion). The Louvre Abu Dhabi, designed by the French architect Jean Nouvel and the engineering firm of Buro Happold, occupy 24000 m2 and is covered by an iconic metallic roof designed to cast rays of light mimicking sunlight passing through date palm fronds in an oasis. France agreed to rotate between 200 and 300 artworks during a 10-year period; to provide management expertise; and to provide four temporary exhibitions a year for 15 years. The art will come from multiple museums, including the Louvre, the Georges Pompidou Centre, the Musée d'Orsay, Versailles, the Musée Guimet, the Musée Rodin, and the Musée du quai Branly.\n\nConservation\n\nIn 2009, Minister of Culture Frédéric Mitterrand approved a plan that would have created a storage facility 30 km northwest of Paris to hold objects from the Louvre and two other national museums in Paris's flood zone, the Musée du Quai Branly and the Musée d'Orsay; the plan was later scrapped. In 2013, his successor Aurélie Filippetti announced that the Louvre would move more than 250,000 works of artVincent Noce (13 July 2015), [http://theartnewspaper.com/news/museums/157551/ Louvre's superstore to go ahead despite protests]  The Art Newspaper. held in a 20000 m2 basement storage area in Liévin; the cost of the project, estimated at €60 million, will be split between the region (49%) and the Louvre (51%).Victoria Stapley-Brown (10 November 2014), [http://theartnewspaper.com/articles/Designers-chosen-for-Louvres-m-storage-outpost/36260 Designers chosen for Louvre's €60m storage outpost]  The Art Newspaper. The Louvre will be the sole owner and manager of the store. In July 2015, a team led by British firm Rogers Stirk Harbour + Partners was selected to design the complex, which will have light-filled work spaces under one vast, green roof.\n\nControversial acquisitions\n\nThe Louvre is involved in controversies that surround cultural property seized under Napoleon I, as well as during World War II by the Nazis. During Nazi occupation, thousands of artworks were stolen. But after the war, 61,233 articles of more than 150,000 seized artworks returned to France and were assigned to the Louvre's Office des Biens Privés. In 1949, it entrusted 2,130 unclaimed pieces (including 1,001 paintings) to the Direction des Musées de France in order to keep them under appropriate conditions of conservation until their restitution and meanwhile classified them as MNRs (Musées Nationaux Recuperation or, in English, the National Museums of Recovered Artwork). Some 10% to 35% of the pieces are believed to come from Jewish spoliations and until the identification of their rightful owners, which declined at the end of the 1960s, they are registered indefinitely on separate inventories from the museum's collections.\n\nThey were exhibited in 1946 and shown all together to the public during four years (1950–1954) in order to allow rightful claimants to identify their properties, then stored or displayed, according to their interest, in several French museums including the Louvre. From 1951 to 1965, about 37 pieces were restituted. Since November 1996, the partly illustrated catalogue of 1947–1949 has been accessible online and completed. In 1997, Prime Minister Alain Juppé initiated the Mattéoli Commission, headed by Jean Mattéoli, to investigate the matter and according to the government, the Louvre is in charge of 678 pieces of artwork still unclaimed by their rightful owners.Rickman, p. 294 During the late 1990s, the comparison of the American war archives, which had not been done before, with the French and German ones as well as two court cases which finally settled some of the heirs' rights (Gentili di Giuseppe and Rosenberg families) allowed more accurate investigations. Since 1996, the restitutions, according sometimes to less formal criteria, concerned 47 more pieces (26 paintings, with 6 from the Louvre including a then displayed Tiepolo), until the last claims of French owners and their heirs ended again in 2006.\n\nAccording to Serge Klarsfeld, since the now complete and constant publicity which the artworks got in 1996, the majority of the French Jewish community is nevertheless in favour of the return to the normal French civil rule of prescription acquisitive of any unclaimed good after another long period of time and consequently to their ultimate integration into the common French heritage instead of their transfer to foreign institutions like during World War II.\n\nIn June 2015, the Louvre was accused of discriminating against Israeli students.\n\nNapoleon's campaigns acquired Italian pieces by treaties, as war reparations, and Northern European pieces as spoils as well as some antiquities excavated in Egypt, though the vast majority of the latter were seized as war reparations by the British army and are now part of collections of the British Museum. On the other hand, the Dendera zodiac is, like the Rosetta stone, claimed by Egypt even though it was acquired in 1821, before the Egyptian Anti-export legislation of 1835. The Louvre administration has thus argued in favor of retaining this item despite requests by Egypt for its return. The museum participates too in arbitration sessions held via UNESCO's Committee for Promoting the Return of Cultural Property to Its Countries of Origin.Merryman, abstract The museum consequently returned in 2009 five Egyptian fragments of frescoes (30 cm x 15 cm each) whose existence of the tomb of origin had only been brought to the authorities attention in 2008, eight to five years after their good-faith acquisition by the museum from two private collections and after the necessary respect of the procedure of déclassement from French public collections before the Commission scientifique nationale des collections des musées de France.\n\nCollections\n\nThe Musée du Louvre contains more than 380,000 objects and displays 35,000 works of art in eight curatorial departments.\n\nEgyptian antiquities\n\nThe department, comprising over 50,000 pieces, includes artifacts from the Nile civilizations which date from 4,000 BC to the 4th century AD. The collection, among the world's largest, overviews Egyptian life spanning Ancient Egypt, the Middle Kingdom, the New Kingdom, Coptic art, and the Roman, Ptolemaic, and Byzantine periods.Nave, pp.42–43\n\nThe department's origins lie in the royal collection, but it was augmented by Napoleon's 1798 expeditionary trip with Dominique Vivant, the future director of the Louvre.Mignot, pp 76, 77 After Jean-François Champollion translated the Rosetta Stone, Charles X decreed that an Egyptian Antiquities department be created. Champollion advised the purchase of three collections, formed by Edmé-Antoine Durand, Henry Salt and Bernardino Drovet; these additions added 7,000 works. Growth continued via acquisitions by Auguste Mariette, founder of the Egyptian Museum in Cairo. Mariette, after excavations at Memphis, sent back crates of archaeological finds including The Seated Scribe.\n\nGuarded by the Large Sphinx (c. 2000 BC), the collection is housed in more than 20 rooms. Holdings include art, papyrus scrolls, mummies, tools, clothing, jewelry, games, musical instruments, and weapons. Pieces from the ancient period include the Gebel el-Arak Knife from 3400 BC, The Seated Scribe, and the Head of King Djedefre. Middle Kingdom art, \"known for its gold work and statues\", moved from realism to idealization; this is exemplified by the schist statue of Amenemhatankh and the wooden Offering Bearer. The New Kingdom and Coptic Egyptian sections are deep, but the statue of the goddess Nephthys and the limestone depiction of the goddess Hathor demonstrate New Kingdom sentiment and wealth.\n\nNear Eastern antiquities\n\nNear Eastern antiquities, the second newest department, dates from 1881 and presents an overview of early Near Eastern civilization and \"first settlements\", before the arrival of Islam. The department is divided into three geographic areas: the Levant, Mesopotamia (Iraq), and Persia (Iran). The collection's development corresponds to archaeological work such as Paul-Émile Botta's 1843 expedition to Khorsabad and the discovery of Sargon II's palace. These finds formed the basis of the Assyrian museum, the precursor to today's department.\n\nThe museum contains exhibits from Sumer and the city of Akkad, with monuments such as the Prince of Lagash's Stele of the Vultures from 2450 BC and the stele erected by Naram-Sin, King of Akkad, to celebrate a victory over barbarians in the Zagros Mountains. The  Code of Hammurabi, discovered in 1901, displays Babylonian Laws prominently, so that no man could plead their ignorance. The 18th-century BC mural of the Investiture of Zimrilim and the 25th-century BC Statue of Ebih-Il found in the ancient city-state of Mari are also on display at the museum.\n\nThe Persian portion of Louvre contains work from the archaic period, like the Funerary Head and the Persian Archers of Darius I. This section also contains rare objects from Persepolis which were also lent to the British Museum for its Ancient Persia exhibition in 2005.\n\nGreek, Etruscan, and Roman\n\nThe Greek, Etruscan, and Roman department displays pieces from the Mediterranean Basin dating from the Neolithic to the 6th century. The collection spans from the Cycladic period to the decline of the Roman Empire. This department is one of the museum's oldest; it began with appropriated royal art, some of which was acquired under Francis I.Mignot, pp. 155–58 Initially, the collection focused on marble sculptures, such as the Venus de Milo. Works such as the Apollo Belvedere arrived during the Napoleonic Wars, but these pieces were returned after Napoleon I's fall in 1815. In the 19th century, the Louvre acquired works including vases from the Durand collection, bronzes such as the Borghese Vase from the Bibliothèque nationale.\n\nThe archaic is demonstrated by jewellery and pieces such as the limestone Lady of Auxerre, from 640 BC; and the cylindrical Hera of Samos, circa 570–560 BC.Hannan, p.252 After the 4th century BC, focus on the human form increased, exemplified by the Borghese Gladiator. The Louvre holds masterpieces from the Hellenistic era, including The Winged Victory of Samothrace (190 BC) and the Venus de Milo, symbolic of classical art. The long Galerie Campana displays an outstanding collection of more than one thousand Greek potteries. In the galleries paralleling the Seine, much of the museum's Roman sculpture is displayed. The Roman portraiture is representative of that genre; examples include the portraits of Agrippa and Annius Verus; among the bronzes is the Greek Apollo of Piombino.\n\nIslamic art\n\nThe Islamic art collection, the museum's newest, spans \"thirteen centuries and three continents\". These exhibits, comprising ceramics, glass, metalware, wood, ivory, carpet, textiles, and miniatures, include more than 5,000 works and 1,000 shards.Ahlund, p. 24 Originally part of the decorative arts department, the holdings became separate in 2003. Among the works are the Pyxide d'al-Mughira, a 10th century ivory box from Andalusia; the Baptistery of Saint-Louis, an engraved brass basin from the 13th or 14th century Mamluk period; and the 10th century Shroud of Saint-Josse from Iran.Mignot, pp. 119–21 The collection contains three pages of the Shahnameh, an epic book of poems by Ferdowsi in Persian, and a Syrian metalwork named the Barberini Vase.\n\nSculpture\n\nThe sculpture department comprises work created before 1850 that does not belong in the Etruscan, Greek, and Roman department. The Louvre has been a repository of sculpted material since its time as a palace; however, only ancient architecture was displayed until 1824, except for Michelangelo's Dying Slave and Rebellious Slave.Mignot, 397–401 Initially the collection included only 100 pieces, the rest of the royal sculpture collection being at Versailles. It remained small until 1847, when Léon Laborde was given control of the department. Laborde developed the medieval section and purchased the first such statues and sculptures in the collection, King Childebert and stanga door, respectively. The collection was part of the Department of Antiquities but was given autonomy in 1871 under Louis Courajod, a director who organized a wider representation of French works. In 1986, all post-1850 works were relocated to the new Musée d'Orsay. The Grand Louvre project separated the department into two exhibition spaces; the French collection is displayed in the Richelieu wing, and foreign works in the Denon wing.\n\nThe collection's overview of French sculpture contains Romanesque works such as the 11th-century Daniel in the Lions' Den and the 12th-century Virgin of Auvergne. In the 16th century, Renaissance influence caused French sculpture to become more restrained, as seen in Jean Goujon's bas-reliefs, and Germain Pilon's Descent from the Cross and Resurrection of Christ. The 17th and 18th centuries are represented by Gian Lorenzo Bernini's 1640–1 Bust of Cardinal Richelieu, Étienne Maurice Falconet's Woman Bathing and Amour menaçant, and François Anguier's obelisks. Neoclassical works includes Antonio Canova's Psyche Revived by Cupid's Kiss (1787). The 18th and 19th centuries are represented by the French sculptor Alfred Barye.\n\nDecorative arts\n\nThe Objets d'art collection spans the time from the Middle Ages to the mid-19th century. The department began as a subset of the sculpture department, based on royal property and the transfer of work from the Basilique Saint-Denis, the burial ground of French monarchs that held the Coronation Sword of the Kings of France.Mignot, pp. 451–54 Among the budding collection's most prized works were pietre dure vases and bronzes. The Durand collection's 1825 acquisition added \"ceramics, enamels, and stained glass\", and 800 pieces were given by Pierre Révoil. The onset of Romanticism rekindled interest in Renaissance and Medieval artwork, and the Sauvageot donation expanded the department with 1,500 middle-age and faïence works. In 1862, the Campana collection added gold jewelry and maiolicas, mainly from the 15th and 16th centuries.\n\nThe works are displayed on the Richelieu Wing's first floor and in the Apollo Gallery, named by the painter Charles Le Brun, who was commissioned by Louis XIV (the Sun King) to decorate the space in a solar theme. The medieval collection contains the coronation crown of Louis XIV, Charles V's sceptre, and the 12th century porphyry vase.Lasko, p. 242 The Renaissance art holdings include Giambologna's bronze Nessus and Deianira and the tapestry Maximillian's Hunt.Nave, p 130 From later periods, highlights include Madame de Pompadour's Sèvres vase collection and Napoleon III's apartments.\n\nIn September 2000, the Louvre Museum dedicated the Gilbert Chagoury and Rose-Marie Chagoury Gallery to display tapestries donated by the Chagourys, including a 16th-century six-part tapestry suite, sewn with gold and silver threads representing sea divinities, which was commissioned in Paris for Colbert de Seignelay, Secretary of State for the Navy.\n\nPainting\n\nThe painting collection has more than 7,500 works Pierre Rosenberg, Dictionnaire amoureux du Louvre, Plon, Paris, 2007, p. 229. from the 13th century to 1848 and is managed by 12 curators who oversee the collection's display. Nearly two-thirds are by French artists, and more than 1,200 are Northern European. The Italian paintings compose most of the remnants of Francis I and Louis XIV's collections, others are unreturned artwork from the Napoleon era, and some were bought.Hannan, p. 262Mignot, pp. 199–201, 272–73, 333–35 The collection began with Francis, who acquired works from Italian masters such as Raphael and MichelangeloAccording to Giorgio Vasari, Michelangelo's Leda and the Swan, (now lost) was acquired by Francis I. and brought Leonardo da Vinci to his court. After the French Revolution, the Royal Collection formed the nucleus of the Louvre. When the d'Orsay train station was converted into the Musée d'Orsay in 1986, the collection was split, and pieces completed after the 1848 Revolution were moved to the new museum. French and Northern European works are in the Richelieu wing and Cour Carrée; Spanish and Italian paintings are on the first floor of the Denon wing.\n\nExemplifying the French School are the early Avignon Pietà of Enguerrand Quarton; the anonymous painting of King Jean le Bon (c.1360), possibly the oldest independent portrait in Western painting to survive from the postclassical era;Mignot, p. 201 Hyacinthe Rigaud's Louis XIV; Jacques-Louis David's The Coronation of Napoleon; and Eugène Delacroix's Liberty Leading the People.\n\nNorthern European works include Johannes Vermeer's The Lacemaker and The Astronomer; Caspar David Friedrich's The Tree of Crows; Rembrandt's The Supper at Emmaus, Bathsheba at Her Bath, and The Slaughtered Ox.\n\nThe Italian holdings are notable, particularly the Renaissance collection. The works include Andrea Mantegna and Giovanni Bellini's Calvarys, which reflect realism and detail \"meant to depict the significant events of a greater spiritual world\".Hannan, p. 267 The High Renaissance collection includes Leonardo da Vinci's Mona Lisa, Virgin and Child with St. Anne, St. John the Baptist, and Madonna of the Rocks. Caravaggio is represented by The Fortune Teller and Death of the Virgin. From 16th century Venice, the Louvre displays Titian's Le Concert Champetre, The Entombment and The Crowning with Thorns.Mignot, p. 378Hannan, pp. 270–278\n\nThe La Caze Collection, a bequest to the Musée du Louvre in 1869 by Louis La Caze, was the largest contribution of a person in the history of the Louvre. La Caze gave 584 paintings of his personal collection to the museum. The bequest included Antoine Watteau's Commedia dell'arte player of Pierrot (\"Gilles\"). In 2007, this bequest was the topic of the exhibition \"1869: Watteau, Chardin... entrent au Louvre. La collection La Caze\".[http://www.louvre.fr/llv/exposition/detail_exposition.jsp?CONTENT%3C%3Ecnt_id10134198673469921&CURRENT_LLV_EXPO%3C%3Ecnt_id\n10134198673469921&FOLDER%3C%3Efolder_id9852723696500927&bmLocale\nen www.louvre.fr] – Musée du Louvre – Exhibitions – Past Exhibitions – The La Caze Collection. Retrieved 23 May 2009. \n\nSome of the best known paintings of the museum have been digitized by the French Center for Research and Restoration of the Museums of France.\n\nPrints and drawings\n\nThe prints and drawings department encompasses works on paper.Mignot, 496 The origins of the collection were the 8,600 works in the Royal Collection (Cabinet du Roi), which were increased via state appropriation, purchases such as the 1,200 works from Fillipo Baldinucci's collection in 1806, and donations. The department opened on 5 August 1797, with 415 pieces displayed in the Galerie d'Apollon. The collection is organized into three sections: the core Cabinet du Roi, 14,000 royal copper printing-plates, and the donations of Edmond de Rothschild, which include 40,000 prints, 3,000 drawings, and 5,000 illustrated books. The holdings are displayed in the Pavillon de Flore; due to the fragility of the paper medium, only a portion are displayed at one time.\n\nLocation, access, and facilities\n\nThe museum lies in the center of Paris on the Right Bank. The neighborhood, known as the 1st arrondissement, was home to the former Tuileries Palace, which closed off the western end of the Louvre entrance courtyard, but was heavily damaged by fire during the Paris Commune of 1871 and later demolished. The adjacent Tuileries Gardens, created in 1564 by Catherine de' Medici, was designed in 1664 by André Le Nôtre. The gardens house the Galerie nationale du Jeu de Paume, a contemporary art exhibition space which was used to store confiscated Jewish cultural property during the 1940 to 1944 German occupation of France.Mroue, p. 176 Parallel to the Jeu de Paume is the Orangerie, home to the famous Water Lilies paintings by Claude Monet.\n\nThe Louvre is slightly askew of the Historic Axis (Axe historique), a roughly eight-kilometre (five-mile) architectural line bisecting the city. It begins on the east in the Louvre courtyard and runs west along the Champs-Élysées. In 1871, the burning of the Tuileries Palace by the Paris Commune revealed that the Louvre was slightly askew of the Axe despite past appearances to the contrary.Rogers, p. 159 The Louvre can be reached by the Palais Royal – Musée du Louvre Métro or the Louvre-Rivoli stations.\n\nThe Louvre has three entrances: the main entrance at the pyramid, an entrance from the Carrousel du Louvre underground shopping mall, and an entrance at the Porte des Lions (near the western end of the Denon wing).\n\nUnder the main entrance to the museum is the Carrousel du Louvre, a shopping mall operated by Unibail-Rodamco. Among other stores, it has the first Apple Store in France, and a McDonald's restaurant, the presence of which has created controversy.\n\nThe use of cameras and video recorders is permitted inside, but flash photography is forbidden.\n\nGallery\n\nFile:Head figurine Spedos Louvre Ma2709.jpg|Cycladic, a votive head, 2700–2300 BC\nFile:Stele Ra-Horakhty Louvre N3795.jpg|Egyptian, stele, Priest burning incense before Ra-Horakhty-Atum, ca. 900 BC\nFile:Ibex rhyton AO3115.jpg|Ancient Persia, the Ibex Rhyton, 600–300 BC\nFile:003MA Equestrian Kouros (2).jpg|Ancient Greek, Athens, The Rampin Rider,\nFile:Etruscan amphora Louvre E703 side B.jpg|Etruscan amphora, Diomedes and Polyxena, ca. 540–530 BC\nFile:Eros medallion Louvre Bj2248.jpg|Hellenic Near East, The Eros Medallion, ca. 250–200 BC\nFile:Fayum-34.jpg|Fayum Egyptian, Fayum mummy portrait\nFile:Marcus agrippa louvre portrait.jpg|Roman, portrait of Marcus Agrippa, 25 BC\nFile:Apostles Christ ivory Louvre OA3850.jpg|Frankish, ivory, Christ between two apostles, 5th century\nFile:Cup lustre Louvre OA8179.jpg|Islamic art from Iraq, terracotta cup, 9th century\nFile:Reliure.jpg|Romanesque art from Maastricht, Reliquary, 11th century\nFile:Louvre saint michel rf1427.jpg|Romanesque architecture from France, St Michael and the Devil, 12th century\nFile:Giotto di Bondone 002.jpg|Italian Renaissance painting, St Francis receiving the stigmata, Giotto, c.1300\nFile:Rogier van der Weyden 030.jpg|Early Netherlandish painting, The Annunciation, Rogier van der Weyden, 1435\nFile:Meister der Pietà von Avignon 004.jpg|Gothic art from France, The Pieta of Villeneuve les Avignon, Enguerrand Quarton, 1460\nFile:Domenico ghirlandaio, ritratto di nonno con nipote.jpg|Italian Renaissance painting, Portrait of an old man and his grandson, Ghirlandaio, 1488\nFile:Quentin Massys 001.jpg|Flemish painting, The Money Changer and His Wife, Quentin Massys, 1514\nFile:Baldassare Castiglione, by Raffaello Sanzio, from C2RMF retouched.jpg|Italian Renaissance painting, Baltasar de Castiglione, Raphael, c.1515\nFile:'Dying_Slave'_Michelangelo_JBU004.jpg|Italian Renaissance sculpture, Dying Slave, Michelangelo, 1513–16\nFile:Paolo Veronese 010.jpg|Venetian Mannerist painting, The Crucifixion, Paolo Veronese, c.1550\nFile:La Diseuse de bonne aventure, Caravaggio (Louvre INV 55) 02.jpg|Italian Baroque painting, The Fortune Teller, Caravaggio, c.1600\nFile:Charles I of England.jpg|English painting, Charles I at the Hunt, van Dyck, 1635\nFile:Jan Vermeer van Delft 016.jpg|Dutch Baroque, The Lacemaker, Vermeer, 1664\nFile:Diego Velázquez 029.jpg|Spanish painting, Infanta María Margarita, Velázquez, 1655\nFile:The shepherds of arcadia.jpg|French Classicism, The Shepherds of Arcadia, Poussin, c.1640\nFile:Boucher Diane sortant du bain Louvre 2712.jpg|French Rococo, Diana bathing, Boucher, 1742\nFile:Jean-Auguste-Dominique Ingres - La Baigneuse Valpinçon.jpg|French Classical painting, The Bather, Ingres, 1808\nFile:Eugène Delacroix - La liberté guidant le peuple.jpg|French Romantic art, Liberty Leading the People, Delacroix, 1830\nFile:Cabinet sur piètement - Cabinet on stand - Vers 1690-1710 - Boulle - Louvre - OA 5469.jpg|André-Charles Boulle Cabinet sur piètement, 1690-1710 \nFile:Cabinet sur piètement - Tiroirs - Cabinet on stand - Drawers - Vers 1690-1710 - Boulle - Louvre - OA 5469.jpg|André-Charles Boulle Cabinet sur piètement\nFile:Musée du Louvre - Département des Objets d'art - Salle 34 -2.JPG|André-Charles Boulle\nFile:Gaine - Pedestal - vers 1700-1720 - Boulle - Louvre - OA 5058 ou 5061.jpg|André-Charles Boulle, 1700-1720 \nFile:Musée du Louvre - Département des Objets d'art - Salle 34 -1.JPG|André-Charles Boulle\nFile:Régulateur - Regulator clock - vers 1714-1719 - Oppenordt - Boulle - Louvre - OA 6746.jpg|André-Charles Boulle 1714-1719",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Louvre" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17546" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Louvre,The New Oxford American Dictionary gives the respelling \"/'lv(rə)/\", which has been converted to its IPA equivalent. The portion within parentheses indicates a variant pronunciation. or the Louvre Museum (), is the world's largest art museum and a historic monument in Paris, France. A central landmark of the city, it is located on the Right Bank of the Seine in the city's 1st arrondissement (district or ward). Approximately 38,000 objects from prehistory to the 21st century are exhibited over an area of 72,735 square metres (782,910 square feet).http://www.louvre.fr/sites/default/files/dp_pyramide%2028102014_en.pdf In 2017, the Louvre was the world's most visited art museum, receiving 8.1 million visitors. \n\nThe museum is housed in the Louvre Palace, originally built as a fortress in the late 12th to 13th century under Philip II. Remnants of the fortress are visible in the basement of the museum. Due to the urban expansion of the city, the fortress eventually lost its defensive function and, in 1546, was converted by Francis I into the main residence of the French Kings. The building was extended many times to form the present Louvre Palace. In 1682, Louis XIV chose the Palace of Versailles for his household, leaving the Louvre primarily as a place to display the royal collection, including, from 1692, a collection of ancient Greek and Roman sculpture. In 1692, the building was occupied by the Académie des Inscriptions et Belles Lettres and the Académie Royale de Peinture et de Sculpture, which in 1699 held the first of a series of salons. The Académie remained at the Louvre for 100 years. During the French Revolution, the National Assembly decreed that the Louvre should be used as a museum to display the nation's masterpieces.\n\nThe museum opened on 10 August 1793 with an exhibition of 537 paintings, the majority of the works being royal and confiscated church property. Because of structural problems with the building, the museum was closed in 1796 until 1801. The collection was increased under Napoleon and the museum was renamed Musée Napoléon, but after Napoleon's abdication many works seized by his armies were returned to their original owners. The collection was further increased during the reigns of Louis XVIII and Charles X, and during the Second French Empire the museum gained 20,000 pieces. Holdings have grown steadily through donations and bequests since the Third Republic. The collection is divided among eight curatorial departments: Egyptian Antiquities; Near Eastern Antiquities; Greek, Etruscan and Roman Antiquities; Islamic Art; Sculpture; Decorative Arts; Paintings; Prints and Drawings.\n\nHistory\n\n12th–20th centuries\n\nMedieval, Renaissance, and Bourbon palace \n\nThe Louvre Palace, which houses the museum, was begun as a fortress by Philip II in the 12th century to protect the city from English soldiers which were in Normandy. Remnants of this castle are still visible in the crypt.Mignot, p. 32 Whether this was the first building on that spot is not known; it is possible that Philip modified an existing tower. According to the authoritative Grand Larousse encyclopédique, the name derives from an association with wolf hunting den (via Latin: lupus, lower Empire: lupara).Edwards, pp. 193–94In Larousse Nouveau Dictionnaire étymologique et historique, Librairie Larousse, Paris, 1971, p. 430: ***loup 1080, Roland (leu, forme conservée dans à la queue leu leu, Saint Leu, etc.); du lat. lupus; loup est refait sur le fém. louve, où le *v* a empêché le passage du *ou* à *eu* (cf. Louvre, du lat. pop. lupara)*** the etymology of the word louvre is from lupara, feminine (pop. Latin) form of lupus. In the 7th century, St. Fare, an abbess in Meaux, left part of her \"Villa called Luvra situated in the region of Paris\" to a monastery.;In Lebeuf (Abbé), Fernand Bournon, Histoire de la ville et de tout le diocèse de Paris par l'abbé Lebeuf, Vol. 2, Paris: Féchoz et Letouzey, 1883, p. 296: \"Louvre\". this territory probably did not correspond exactly to the modern site, however.\n\nThe Louvre Palace was altered frequently throughout the Middle Ages. In the 14th century, Charles V converted the building into a residence and in 1546, Francis I renovated the site in French Renaissance style.Edwards, p. 198 Francis acquired what would become the nucleus of the Louvre's holdings, his acquisitions including Leonardo da Vinci's Mona Lisa. After Louis XIV chose Versailles as his residence in 1682, constructions slowed; however, the move permitted the Louvre to be used as a residence for artists, under Royal patronage.Mignot, p. 42Nore, p. 274 Four generations of Boulle were granted Royal patronage and resided in the Louvre in the following order: Pierre Boulle, Jean Boulle, Andre-Charles Boulle and his four sons (Jean-Philippe, Pierre-Benoît (c.1683-1741), Charles-André (1685–1749) and Charles-Joseph (1688–1754)), after him. André-Charles Boulle (11 November 164229 February 1732) is the most famous French cabinetmaker and the preeminent artist in the field of marquetry , also known as \"Inlay\".  Boulle was \"the most remarkable of all French cabinetmakers\"Theodore Dell, The Frick Collection, V: Furniture in the Frick Collection (1992:187).. He was commended to Louis XIV of France, the \"Sun King\", by Jean-Baptiste Colbert (29 August 1619 – 6 September 1683) as being “the most skilled craftsman in his profession”.  Before the fire of 1720 destroyed them, André-Charles Boulle held priceless works of art in the Louvre, including forty-eight drawings by Raphael'. C.R. Williams, \"The Mentor:Furniture and its Makers Vol.1, No. 30, Serial Number 30, September 7, 2015, [EBook #49904]\n\nBy the mid-18th century there were an increasing number of proposals to create a public gallery, with the art critic La Font de Saint-Yenne publishing, in 1747, a call for a display of the royal collection. On 14 October 1750, Louis XV agreed and sanctioned a display of 96 pieces from the royal collection, mounted in the Galerie royale de peinture of the Luxembourg Palace. A hall was opened by Le Normant de Tournehem and the Marquis de Marigny for public viewing of the Tableaux du Roy on Wednesdays and Saturdays, and contained Andrea del Sarto's Charity and works by Raphael; Titian; Veronese; Rembrandt; Poussin or Van Dyck, until its closing in 1780 as a result of the gift of the palace to the Count of Provence (the future king, Louis XVIII) by the king in 1778. Under Louis XVI, the royal museum idea became policy.Carbonell, p. 56 The comte d'Angiviller broadened the collection and in 1776 proposed conversion of the Grande Galerie of the Louvre – which contained maps – into the \"French Museum\". Many proposals were offered for the Louvre's renovation into a museum; however, none was agreed on. Hence the museum remained incomplete until the French Revolution.\n\nFrench Revolution\n\nDuring the French Revolution the Louvre was transformed into a public museum. In May 1791, the Assembly declared that the Louvre would be \"a place for bringing together monuments of all the sciences and arts\". On 10 August 1792, Louis XVI was imprisoned and the royal collection in the Louvre became national property. Because of fear of vandalism or theft, on 19 August, the National Assembly pronounced the museum's preparation as urgent. In October, a committee to \"preserve the national memory\" began assembling the collection for display.Oliver, p. 21–22\n\nOpening\n\nThe museum opened on 10 August 1793, the first anniversary of the monarchy's demise. The public was given free accessibility on three days per week, which was \"perceived as a major accomplishment and was generally appreciated\".Oliver, p. 35 The collection showcased 537 paintings and 184 objects of art. Three quarters were derived from the royal collections, the remainder from confiscated émigrés and Church property (biens nationaux).Mignot, pp. 68, 69 To expand and organize the collection, the Republic dedicated 100,000 livres per year.Nora, p. 278 In 1794, France's revolutionary armies began bringing pieces from Northern Europe, augmented after the Treaty of Tolentino (1797) by works from the Vatican, such as Laocoön and His Sons and the Apollo Belvedere, to establish the Louvre as a museum and as a \"sign of popular sovereignty\".McClellan, p. 7\n\nThe early days were hectic; privileged artists continued to live in residence, and the unlabelled paintings hung \"frame to frame from floor to ceiling\".Alderson, p.24, 25 The structure itself closed in May 1796 due to structural deficiencies. It reopened on 14 July 1801, arranged chronologically and with new lighting and columns.\n\nNapoleon\n\nUnder Napoleon I, a northern wing paralleling the Grande Galerie was begun, and the collection grew through successful military campaigns.Mignot, p. 52 Following the Egyptian campaign of 1798–1801, Napoléon appointed the museum's first director, Dominique Vivant Denon. In tribute, the museum was renamed the \"Musée Napoléon\" in 1803, and acquisitions were made of Spanish, Austrian, Dutch, and Italian works, either as spoils or through treaties such as the Treaty of Tolentino. At the end of Napoleon's First Italian Campaign in 1797, the Treaty of Campo Formio was signed with Count Philipp von Cobenzl of the Austrian Monarchy. This treaty not only marked the completion of Napoleon's conquest of Italy, but also the end of the first phases of the French Revolutionary Wars. Under this treaty, Italian cities were required to contribute pieces of art and patrimony to take part in Napoleon's \"parades of booty\" through Paris before being put into the Louvre Museum.Plant, p. 36 One of the most famous pieces taken under this program was the Horses of Saint Mark. The four antique bronze horses, which had adorned the basilica of San Marco in Venice after the sack of Constantinople in 1204, were brought to Paris to reside atop Napoleon's Arc du Carrousel in Paris in 1797.\n\nSeveral churches and palaces, including Saint Mark's Basilica, were looted by the French, which outraged the Italians and their artistic and cultural sensibilities.Popkin, p.88 In 1797, the Treaty of Tolentino was signed by Napoleon, and two statues, the Nile and Tiber, were taken to Paris. These statues had previously been in the Vatican, and both were housed in the Louvre until 1815. After the defeat of Napoleon, the Nile was returned to Italy. However, the Tiber remained in the Louvre Museum and can be seen in the collections today.\n\nThe Italian Peninsula was not the only region from which Napoleon took art. Under the Directory government of the 1790s, Napoleon (then a General) led an expedition to Egypt. The campaign was an expansionist effort on the part of the government, but the Directory had another goal to make Paris the center of art, science, and culture.Popkin, p. 89 The Directory wanted France to assume responsibility for liberating the works of art they deemed in danger in order to protect and nationalize the heritage and culture of their subjects.Bierman, p. 41 As a result, there were teams of artists and scientists who accompanied the armies into battle equipped with lists of paintings, sculptures, and other pieces of patrimony that would be collected, crated, and shipped back to France.Bierman, p.42\n\nDominique Vivant Denon was Napoleon's art advisor, and accompanied him on the expedition to Egypt. Through his initiative, the Valley of the Kings in Egypt was discovered and studied extensively.Strathern, p. 305 As a result, he was later installed by Napoleon as the director of Musée Napoléon, formerly the Louvre, cementing the status of the museum as a center for global patrimony and storehouse for cultural heritage.Quynn, Dorothy (1945) \"The Art Confiscations of the Napoleonic Wars\". The American Historical Review. https://www.jstor.org/stable/1843116 p. 442\n\nOne of the most important discoveries made during Napoleon's campaign in Egypt was the Rosetta Stone. It was discovered in 1799, and eventually led to the ability to decipher ancient hieroglyphs. Although the Rosetta Stone was discovered by the French, it actually never made it to the Louvre Museum. It was seized by British Forces following the defeat of Napoleon in Egypt and the subsequent signing of the Treaty of Alexandria in 1801.Parkinson, Pg. 28 It is now on display at the British Museum.Bierman, p. 161\n\nAfter the French defeat at Waterloo, the works' former owners sought their return. The Louvre's administrators were loath to comply and hid many works in their private collections. In response, foreign states sent emissaries to London to seek help, and many pieces were returned, even some that had been restored by the Louvre.Alderson, p.25Mignot, p. 69. According to Mignot, Mantegna's Calvary, Veronese's The Wedding at Cana|The Marriage of Cana, and Rogier van der Weyden's Annunciation were not returned. In 1815 Louis XVIII finally concluded agreements with the Austrian government for the keeping of pieces such as Veronese's Wedding at Cana which was exchanged for a large Le Brun or the repurchase of the Albani collection.\n\nRestoration and Second Empire\n\nDuring the Restoration (1814–30), Louis XVIII and Charles X between them added 135 pieces at a cost of 720,000 francs and created the department of Egyptian antiquities curated by Champollion, increased by more than 7,000 works with the acquisition of antiquities in the Edme-Antoine Durand, the Egyptian collection of Henry Salt or the second collection former by Bernardino Drovetti. This was less than the amount given for rehabilitation of Versailles, and the Louvre suffered relative to the rest of Paris. After the creation of the French Second Republic in 1848, the new government allocated two million francs for repair work and ordered the completion of the Galerie d'Apollon, the Salon Carré, and the Grande Galérie. In 1861, Louis-Napoléon Bonaparte bought 11,835 artworks including 641 paintings, Greek gold and other antiquities of the Campana collection. During the Second French Empire, between 1852 and 1870, the French economy grew; by 1870 the museum had added 20,000 new pieces to its collections, and the Pavillon de Flore and the Grande Galérie were remodelled under architects Louis Visconti and Hector Lefuel.Mignot, pp. 52–54\n\nDamage during the 1871 Paris Commune\n\nThe Louvre was damaged during the suppression of the Paris Commune.  On 23 May 1871, as the French Army advanced into Paris, a force of Communard soldiers led by Jules Bergeret set fire to the adjoining Tuileries Palace. The fire burned for forty-eight hours, entirely destroying the interior of the palace and spreading to the museum next to it.  The library of the museum and some of the adjoining halls were destroyed, but the museum was saved by the efforts of Paris firemen and museum employees.Rene Heron de Villefosse, Histoire de Paris, Bernard Grasset (1959). The father of the author of this book was an assistant curator at the Louvre, and helped put out the fires\n\nThird Republic and World Wars\n\nDuring the Third Republic (1870–1940) the Louvre acquired new pieces mainly via donations and gifts. The Société des Amis du Louvre donated the Pietà of Villeneuve-lès-Avignon, and in 1863 an expedition uncovered the sculpture Winged Victory of Samothrace in the Aegean Sea. This piece, though heavily damaged, has been prominently displayed since 1884. The 583-item Collection La Caze donated in 1869, included works by Chardin; Fragonard; Rembrandt – such as Bathsheba at Her Bath – and Gilles by Watteau.Mignot, pp. 70–71\n\nMuseum expansion slowed after World War I, and the collection did not acquire many significant new works; exceptions were Georges de La Tour's Saint Thomas and Baron Edmond de Rothschild's (1845–1934) 1935 donation of 4,000 engravings, 3,000 drawings, and 500 illustrated books.\nAt the beginning of World War II the museum removed most of the art and hid valuable pieces. When Germany occupied the Sudetenland, many important artworks such as the Mona Lisa were temporarily moved to the Château de Chambord. When war was formally declared a year later, most of the museum's paintings were sent there as well. Select sculptures such as Winged Victory of Samothrace and the Venus de Milo were sent to the Château de Valençay.Alan Riding, And the Show Went On: Cultural Life in Nazi-Occupied Paris. Alfred A Knopf, New York: 2010. p34. On 27 August 1939, after two days of packing, truck convoys began to leave Paris. By 28 December, the museum was cleared of most works, except those that were too heavy and \"unimportant paintings [that] were left in the basement\".Matila Simon, \"The battle of the Louvre;: The struggle to save French art in World War II\". Hawthorn Books, 1971. p. 23. In early 1945, after the liberation of France, art began returning to the Louvre.Simon, p. 177\n\nGrand Louvre Pyramids\n\nBy 1874, the Louvre Palace had achieved its present form of an almost rectangular structure with the Sully Wing to the east containing the Cour Carrée (Square Court) and the oldest parts of the Louvre; and two wings which wrap the Cour Napoléon, the Richelieu Wing to the north and the Denon Wing, which borders the Seine to the south.Mignot, p. 13 In 1983, French President François Mitterrand proposed, as one of his Grands Projets, the Grand Louvre plan to renovate the building and relocate the Finance Ministry, allowing displays throughout the building. Architect I. M. Pei was awarded the project and proposed a glass pyramid to stand over a new entrance in the main court, the Cour Napoléon.Mignot, p. 66 The pyramid and its underground lobby were inaugurated on 15 October 1988 and the Louvre Pyramid was completed in 1989. The second phase of the Grand Louvre plan, La Pyramide Inversée (The Inverted Pyramid), was completed in 1993. As of 2002, attendance had doubled since completion.\n\n21st century\n\nThe Musée du Louvre contains more than 380,000 objects and displays 35,000 works of art in eight curatorial departments with more than 60600 m2 dedicated to the permanent collection. The Louvre exhibits sculptures, objets d'art, paintings, drawings, and archaeological finds. It is the world's most visited museum, averaging 15,000 visitors per day, 65 percent of whom are foreign tourists.\n\nAfter architects Mario Bellini and Rudy Ricciotti had won an international competition to create its new galleries for Islamic art, the new 3,000 sq mGareth Harris (13 September 2012), [http://www.ft.com/cms/s/2/ad9c2ff2-f5bf-11e1-bf76-00144feabdc0.html#axzz26xYVPBmB Islamic art, covered] Financial Times. pavilion eventually opened in 2012, consisting of ground- and lower-ground-level interior spaces topped by a golden, undulating roof (fashioned from almost 9,000 steel tubes that form an interior web) that seems to float within the neo-Classical Visconti Courtyard in the middle of the Louvre's south wing.Carol Vogel (19 September 2012), [https://www.nytimes.com/2012/09/20/arts/design/the-louvres-new-islamic-galleries-bring-riches-to-light.html The Louvre's New Islamic Galleries Bring Riches to Light] New York Times. The galleries, which the museum had initially hoped to open by 2009, represent the first major architectural intervention at the Louvre since the addition of I.M. Pei's glass pyramid in 1989.\n\nOn 5 February 2015, about one hundred archaeologists, protesting against commercial private involvement to protect France's heritage, blocked Louvre's ticket desks to facilitate free access to the museum. At least one announcement reading \"Free entrance offered by the archeologists\" has been attached to the ticket desk and a number of people visited the museum free of charge.\n\nThe Louvre is owned by the French government; however, since the 1990s it has become more independent. Since 2003, the museum has been required to generate funds for projects. By 2006, government funds had dipped from 75 percent of the total budget to 62 percent. Every year, the Louvre now raises as much as it gets from the state, about €122 million. The government pays for operating costs (salaries, safety and maintenance), while the rest – new wings, refurbishments, acquisitions – is up to the museum to finance.Farah Nayeri (20 January 2009), [https://www.nytimes.com/2009/01/20/business/worldbusiness/20iht-louvre.4.19526510.html Banks compete to manage Louvre's endowment] International Herald Tribune. A further €3 million to €5 million a year is raised by the Louvre from exhibitions that it curates for other museums, while the host museum keeps the ticket money. As the Louvre became a point of interest in the book The Da Vinci Code and the 2006 film based on the book, the museum earned $2.5 million by allowing filming in its galleries.Lunn, p. 137 In 2008, the French government provided $180 million of the Louvre's yearly $350 million budget; the remainder came from private contributions and ticket sales.\n\nThe Louvre employs a staff of 2,000 led by Director Jean-Luc Martinez,[http://www.lemonde.fr/culture/article/2013/04/03/un-archeologue-prend-la-direction-du-louvre_3152530_3246.html Un archéologue prend la direction du Louvre], Le Monde du 3 April 2013. who reports to the French Ministry of Culture and Communications. Martinez replaced Henri Loyrette in April 2013. Under Loyrette, who replaced Pierre Rosenberg in 2001, the Louvre has undergone policy changes that allow it to lend and borrow more works than before. In 2006, it loaned 1,300 works, which enabled it to borrow more foreign works. From 2006 to 2009, the Louvre lent artwork to the High Museum of Art in Atlanta, Georgia, and received a $6.9 million payment to be used for renovations.\n\nIn 2012, the Louvre and the Fine Arts Museums of San Francisco announced a five-year collaboration on exhibitions, publications, art conservation and educational programming.Scarlet Cheng (15 November 2012), [http://theartnewspaper.com/articles/Louvre+and+San+Francisco+museums+sign+five-year+deal/28063 Louvre and Sll Francisco museums sign five-year deal]  The Art Newspaper. The €98.5 million expansion of the Islamic Art galleries in 2012 received state funding of €31 million, as well as €17 million from the Alwaleed Bin Talal Foundation founded by the eponymous Saudi prince. The republic of Azerbaijan, the Emir of Kuwait, the Sultan of Oman and King Mohammed VI of Morocco donated in total €26 million. In addition, the opening of the Louvre Abu Dhabi is supposed to provide €400 million over the course of 30 years for its use of the museum's prestigious brand. Loyrette has tried to improve weak parts of the collection through income generated from loans of art and by guaranteeing that \"20% of admissions receipts will be taken annually for acquisitions\". He has more administrative independence for the museum and achieved 90 percent of galleries to be open daily, as opposed to 80 percent previously. He oversaw the creation of extended hours and free admission on Friday nights and an increase in the acquisition budget to $36 million from $4.5 million.\n\nSatellite museums\n\nLens\n\nIn 2004, French officials decided to build a satellite museum on the site of an abandoned coal pit in the former mining town of Lens to relieve the crowded Paris Louvre, increase total museum visits, and improve the industrial north's economy. Six cities were considered for the project: Amiens, Arras, Boulogne-sur-Mer, Calais, Lens, and Valenciennes. In 2004, French Prime Minister Jean-Pierre Raffarin chose Lens to be the site of the new building, the Louvre-Lens. Japanese architects SANAA were selected to design the Lens project in 2005. Museum officials predicted that the new building, capable of receiving about 600 works of art, would attract up to 500,000 visitors a year when it opened in 2012.\n\nAbu Dhabi\n\nOn 8 November 2017, a direct extension of the Louvre, Louvre Abu Dhabi, opened its doors to the public in the city of Abu Dhabi. A 30-year agreement, signed by French Culture Minister Renaud Donnedieu de Vabres and Sheik Sultan bin Tahnoon Al Nahyan, established the museum on Saadiyat Island in Abu Dhabi in exchange for €832,000,000 (US$1.3 billion). The Louvre Abu Dhabi, designed by the French architect Jean Nouvel and the engineering firm of Buro Happold, occupy 24000 m2 and is covered by an iconic metallic roof designed to cast rays of light mimicking sunlight passing through date palm fronds in an oasis. France agreed to rotate between 200 and 300 artworks during a 10-year period; to provide management expertise; and to provide four temporary exhibitions a year for 15 years. The art will come from multiple museums, including the Louvre, the Georges Pompidou Centre, the Musée d'Orsay, Versailles, the Musée Guimet, the Musée Rodin, and the Musée du quai Branly.\n\nConservation\n\nIn 2009, Minister of Culture Frédéric Mitterrand approved a plan that would have created a storage facility 30 km northwest of Paris to hold objects from the Louvre and two other national museums in Paris's flood zone, the Musée du Quai Branly and the Musée d'Orsay; the plan was later scrapped. In 2013, his successor Aurélie Filippetti announced that the Louvre would move more than 250,000 works of artVincent Noce (13 July 2015), [http://theartnewspaper.com/news/museums/157551/ Louvre's superstore to go ahead despite protests]  The Art Newspaper. held in a 20000 m2 basement storage area in Liévin; the cost of the project, estimated at €60 million, will be split between the region (49%) and the Louvre (51%).Victoria Stapley-Brown (10 November 2014), [http://theartnewspaper.com/articles/Designers-chosen-for-Louvres-m-storage-outpost/36260 Designers chosen for Louvre's €60m storage outpost]  The Art Newspaper. The Louvre will be the sole owner and manager of the store. In July 2015, a team led by British firm Rogers Stirk Harbour + Partners was selected to design the complex, which will have light-filled work spaces under one vast, green roof.\n\nControversial acquisitions\n\nThe Louvre is involved in controversies that surround cultural property seized under Napoleon I, as well as during World War II by the Nazis. During Nazi occupation, thousands of artworks were stolen. But after the war, 61,233 articles of more than 150,000 seized artworks returned to France and were assigned to the Louvre's Office des Biens Privés. In 1949, it entrusted 2,130 unclaimed pieces (including 1,001 paintings) to the Direction des Musées de France in order to keep them under appropriate conditions of conservation until their restitution and meanwhile classified them as MNRs (Musées Nationaux Recuperation or, in English, the National Museums of Recovered Artwork). Some 10% to 35% of the pieces are believed to come from Jewish spoliations and until the identification of their rightful owners, which declined at the end of the 1960s, they are registered indefinitely on separate inventories from the museum's collections.\n\nThey were exhibited in 1946 and shown all together to the public during four years (1950–1954) in order to allow rightful claimants to identify their properties, then stored or displayed, according to their interest, in several French museums including the Louvre. From 1951 to 1965, about 37 pieces were restituted. Since November 1996, the partly illustrated catalogue of 1947–1949 has been accessible online and completed. In 1997, Prime Minister Alain Juppé initiated the Mattéoli Commission, headed by Jean Mattéoli, to investigate the matter and according to the government, the Louvre is in charge of 678 pieces of artwork still unclaimed by their rightful owners.Rickman, p. 294 During the late 1990s, the comparison of the American war archives, which had not been done before, with the French and German ones as well as two court cases which finally settled some of the heirs' rights (Gentili di Giuseppe and Rosenberg families) allowed more accurate investigations. Since 1996, the restitutions, according sometimes to less formal criteria, concerned 47 more pieces (26 paintings, with 6 from the Louvre including a then displayed Tiepolo), until the last claims of French owners and their heirs ended again in 2006.\n\nAccording to Serge Klarsfeld, since the now complete and constant publicity which the artworks got in 1996, the majority of the French Jewish community is nevertheless in favour of the return to the normal French civil rule of prescription acquisitive of any unclaimed good after another long period of time and consequently to their ultimate integration into the common French heritage instead of their transfer to foreign institutions like during World War II.\n\nIn June 2015, the Louvre was accused of discriminating against Israeli students.\n\nNapoleon's campaigns acquired Italian pieces by treaties, as war reparations, and Northern European pieces as spoils as well as some antiquities excavated in Egypt, though the vast majority of the latter were seized as war reparations by the British army and are now part of collections of the British Museum. On the other hand, the Dendera zodiac is, like the Rosetta stone, claimed by Egypt even though it was acquired in 1821, before the Egyptian Anti-export legislation of 1835. The Louvre administration has thus argued in favor of retaining this item despite requests by Egypt for its return. The museum participates too in arbitration sessions held via UNESCO's Committee for Promoting the Return of Cultural Property to Its Countries of Origin.Merryman, abstract The museum consequently returned in 2009 five Egyptian fragments of frescoes (30 cm x 15 cm each) whose existence of the tomb of origin had only been brought to the authorities attention in 2008, eight to five years after their good-faith acquisition by the museum from two private collections and after the necessary respect of the procedure of déclassement from French public collections before the Commission scientifique nationale des collections des musées de France.\n\nCollections\n\nThe Musée du Louvre contains more than 380,000 objects and displays 35,000 works of art in eight curatorial departments.\n\nEgyptian antiquities\n\nThe department, comprising over 50,000 pieces, includes artifacts from the Nile civilizations which date from 4,000 BC to the 4th century AD. The collection, among the world's largest, overviews Egyptian life spanning Ancient Egypt, the Middle Kingdom, the New Kingdom, Coptic art, and the Roman, Ptolemaic, and Byzantine periods.Nave, pp.42–43\n\nThe department's origins lie in the royal collection, but it was augmented by Napoleon's 1798 expeditionary trip with Dominique Vivant, the future director of the Louvre.Mignot, pp 76, 77 After Jean-François Champollion translated the Rosetta Stone, Charles X decreed that an Egyptian Antiquities department be created. Champollion advised the purchase of three collections, formed by Edmé-Antoine Durand, Henry Salt and Bernardino Drovet; these additions added 7,000 works. Growth continued via acquisitions by Auguste Mariette, founder of the Egyptian Museum in Cairo. Mariette, after excavations at Memphis, sent back crates of archaeological finds including The Seated Scribe.\n\nGuarded by the Large Sphinx (c. 2000 BC), the collection is housed in more than 20 rooms. Holdings include art, papyrus scrolls, mummies, tools, clothing, jewelry, games, musical instruments, and weapons. Pieces from the ancient period include the Gebel el-Arak Knife from 3400 BC, The Seated Scribe, and the Head of King Djedefre. Middle Kingdom art, \"known for its gold work and statues\", moved from realism to idealization; this is exemplified by the schist statue of Amenemhatankh and the wooden Offering Bearer. The New Kingdom and Coptic Egyptian sections are deep, but the statue of the goddess Nephthys and the limestone depiction of the goddess Hathor demonstrate New Kingdom sentiment and wealth.\n\nNear Eastern antiquities\n\nNear Eastern antiquities, the second newest department, dates from 1881 and presents an overview of early Near Eastern civilization and \"first settlements\", before the arrival of Islam. The department is divided into three geographic areas: the Levant, Mesopotamia (Iraq), and Persia (Iran). The collection's development corresponds to archaeological work such as Paul-Émile Botta's 1843 expedition to Khorsabad and the discovery of Sargon II's palace. These finds formed the basis of the Assyrian museum, the precursor to today's department.\n\nThe museum contains exhibits from Sumer and the city of Akkad, with monuments such as the Prince of Lagash's Stele of the Vultures from 2450 BC and the stele erected by Naram-Sin, King of Akkad, to celebrate a victory over barbarians in the Zagros Mountains. The  Code of Hammurabi, discovered in 1901, displays Babylonian Laws prominently, so that no man could plead their ignorance. The 18th-century BC mural of the Investiture of Zimrilim and the 25th-century BC Statue of Ebih-Il found in the ancient city-state of Mari are also on display at the museum.\n\nThe Persian portion of Louvre contains work from the archaic period, like the Funerary Head and the Persian Archers of Darius I. This section also contains rare objects from Persepolis which were also lent to the British Museum for its Ancient Persia exhibition in 2005.\n\nGreek, Etruscan, and Roman\n\nThe Greek, Etruscan, and Roman department displays pieces from the Mediterranean Basin dating from the Neolithic to the 6th century. The collection spans from the Cycladic period to the decline of the Roman Empire. This department is one of the museum's oldest; it began with appropriated royal art, some of which was acquired under Francis I.Mignot, pp. 155–58 Initially, the collection focused on marble sculptures, such as the Venus de Milo. Works such as the Apollo Belvedere arrived during the Napoleonic Wars, but these pieces were returned after Napoleon I's fall in 1815. In the 19th century, the Louvre acquired works including vases from the Durand collection, bronzes such as the Borghese Vase from the Bibliothèque nationale.\n\nThe archaic is demonstrated by jewellery and pieces such as the limestone Lady of Auxerre, from 640 BC; and the cylindrical Hera of Samos, circa 570–560 BC.Hannan, p.252 After the 4th century BC, focus on the human form increased, exemplified by the Borghese Gladiator. The Louvre holds masterpieces from the Hellenistic era, including The Winged Victory of Samothrace (190 BC) and the Venus de Milo, symbolic of classical art. The long Galerie Campana displays an outstanding collection of more than one thousand Greek potteries. In the galleries paralleling the Seine, much of the museum's Roman sculpture is displayed. The Roman portraiture is representative of that genre; examples include the portraits of Agrippa and Annius Verus; among the bronzes is the Greek Apollo of Piombino.\n\nIslamic art\n\nThe Islamic art collection, the museum's newest, spans \"thirteen centuries and three continents\". These exhibits, comprising ceramics, glass, metalware, wood, ivory, carpet, textiles, and miniatures, include more than 5,000 works and 1,000 shards.Ahlund, p. 24 Originally part of the decorative arts department, the holdings became separate in 2003. Among the works are the Pyxide d'al-Mughira, a 10th century ivory box from Andalusia; the Baptistery of Saint-Louis, an engraved brass basin from the 13th or 14th century Mamluk period; and the 10th century Shroud of Saint-Josse from Iran.Mignot, pp. 119–21 The collection contains three pages of the Shahnameh, an epic book of poems by Ferdowsi in Persian, and a Syrian metalwork named the Barberini Vase.\n\nSculpture\n\nThe sculpture department comprises work created before 1850 that does not belong in the Etruscan, Greek, and Roman department. The Louvre has been a repository of sculpted material since its time as a palace; however, only ancient architecture was displayed until 1824, except for Michelangelo's Dying Slave and Rebellious Slave.Mignot, 397–401 Initially the collection included only 100 pieces, the rest of the royal sculpture collection being at Versailles. It remained small until 1847, when Léon Laborde was given control of the department. Laborde developed the medieval section and purchased the first such statues and sculptures in the collection, King Childebert and stanga door, respectively. The collection was part of the Department of Antiquities but was given autonomy in 1871 under Louis Courajod, a director who organized a wider representation of French works. In 1986, all post-1850 works were relocated to the new Musée d'Orsay. The Grand Louvre project separated the department into two exhibition spaces; the French collection is displayed in the Richelieu wing, and foreign works in the Denon wing.\n\nThe collection's overview of French sculpture contains Romanesque works such as the 11th-century Daniel in the Lions' Den and the 12th-century Virgin of Auvergne. In the 16th century, Renaissance influence caused French sculpture to become more restrained, as seen in Jean Goujon's bas-reliefs, and Germain Pilon's Descent from the Cross and Resurrection of Christ. The 17th and 18th centuries are represented by Gian Lorenzo Bernini's 1640–1 Bust of Cardinal Richelieu, Étienne Maurice Falconet's Woman Bathing and Amour menaçant, and François Anguier's obelisks. Neoclassical works includes Antonio Canova's Psyche Revived by Cupid's Kiss (1787). The 18th and 19th centuries are represented by the French sculptor Alfred Barye.\n\nDecorative arts\n\nThe Objets d'art collection spans the time from the Middle Ages to the mid-19th century. The department began as a subset of the sculpture department, based on royal property and the transfer of work from the Basilique Saint-Denis, the burial ground of French monarchs that held the Coronation Sword of the Kings of France.Mignot, pp. 451–54 Among the budding collection's most prized works were pietre dure vases and bronzes. The Durand collection's 1825 acquisition added \"ceramics, enamels, and stained glass\", and 800 pieces were given by Pierre Révoil. The onset of Romanticism rekindled interest in Renaissance and Medieval artwork, and the Sauvageot donation expanded the department with 1,500 middle-age and faïence works. In 1862, the Campana collection added gold jewelry and maiolicas, mainly from the 15th and 16th centuries.\n\nThe works are displayed on the Richelieu Wing's first floor and in the Apollo Gallery, named by the painter Charles Le Brun, who was commissioned by Louis XIV (the Sun King) to decorate the space in a solar theme. The medieval collection contains the coronation crown of Louis XIV, Charles V's sceptre, and the 12th century porphyry vase.Lasko, p. 242 The Renaissance art holdings include Giambologna's bronze Nessus and Deianira and the tapestry Maximillian's Hunt.Nave, p 130 From later periods, highlights include Madame de Pompadour's Sèvres vase collection and Napoleon III's apartments.\n\nIn September 2000, the Louvre Museum dedicated the Gilbert Chagoury and Rose-Marie Chagoury Gallery to display tapestries donated by the Chagourys, including a 16th-century six-part tapestry suite, sewn with gold and silver threads representing sea divinities, which was commissioned in Paris for Colbert de Seignelay, Secretary of State for the Navy.\n\nPainting\n\nThe painting collection has more than 7,500 works Pierre Rosenberg, Dictionnaire amoureux du Louvre, Plon, Paris, 2007, p. 229. from the 13th century to 1848 and is managed by 12 curators who oversee the collection's display. Nearly two-thirds are by French artists, and more than 1,200 are Northern European. The Italian paintings compose most of the remnants of Francis I and Louis XIV's collections, others are unreturned artwork from the Napoleon era, and some were bought.Hannan, p. 262Mignot, pp. 199–201, 272–73, 333–35 The collection began with Francis, who acquired works from Italian masters such as Raphael and MichelangeloAccording to Giorgio Vasari, Michelangelo's Leda and the Swan, (now lost) was acquired by Francis I. and brought Leonardo da Vinci to his court. After the French Revolution, the Royal Collection formed the nucleus of the Louvre. When the d'Orsay train station was converted into the Musée d'Orsay in 1986, the collection was split, and pieces completed after the 1848 Revolution were moved to the new museum. French and Northern European works are in the Richelieu wing and Cour Carrée; Spanish and Italian paintings are on the first floor of the Denon wing.\n\nExemplifying the French School are the early Avignon Pietà of Enguerrand Quarton; the anonymous painting of King Jean le Bon (c.1360), possibly the oldest independent portrait in Western painting to survive from the postclassical era;Mignot, p. 201 Hyacinthe Rigaud's Louis XIV; Jacques-Louis David's The Coronation of Napoleon; and Eugène Delacroix's Liberty Leading the People.\n\nNorthern European works include Johannes Vermeer's The Lacemaker and The Astronomer; Caspar David Friedrich's The Tree of Crows; Rembrandt's The Supper at Emmaus, Bathsheba at Her Bath, and The Slaughtered Ox.\n\nThe Italian holdings are notable, particularly the Renaissance collection. The works include Andrea Mantegna and Giovanni Bellini's Calvarys, which reflect realism and detail \"meant to depict the significant events of a greater spiritual world\".Hannan, p. 267 The High Renaissance collection includes Leonardo da Vinci's Mona Lisa, Virgin and Child with St. Anne, St. John the Baptist, and Madonna of the Rocks. Caravaggio is represented by The Fortune Teller and Death of the Virgin. From 16th century Venice, the Louvre displays Titian's Le Concert Champetre, The Entombment and The Crowning with Thorns.Mignot, p. 378Hannan, pp. 270–278\n\nThe La Caze Collection, a bequest to the Musée du Louvre in 1869 by Louis La Caze, was the largest contribution of a person in the history of the Louvre. La Caze gave 584 paintings of his personal collection to the museum. The bequest included Antoine Watteau's Commedia dell'arte player of Pierrot (\"Gilles\"). In 2007, this bequest was the topic of the exhibition \"1869: Watteau, Chardin... entrent au Louvre. La collection La Caze\".[http://www.louvre.fr/llv/exposition/detail_exposition.jsp?CONTENT%3C%3Ecnt_id10134198673469921&CURRENT_LLV_EXPO%3C%3Ecnt_id\n10134198673469921&FOLDER%3C%3Efolder_id9852723696500927&bmLocale\nen www.louvre.fr] – Musée du Louvre – Exhibitions – Past Exhibitions – The La Caze Collection. Retrieved 23 May 2009. \n\nSome of the best known paintings of the museum have been digitized by the French Center for Research and Restoration of the Museums of France.\n\nPrints and drawings\n\nThe prints and drawings department encompasses works on paper.Mignot, 496 The origins of the collection were the 8,600 works in the Royal Collection (Cabinet du Roi), which were increased via state appropriation, purchases such as the 1,200 works from Fillipo Baldinucci's collection in 1806, and donations. The department opened on 5 August 1797, with 415 pieces displayed in the Galerie d'Apollon. The collection is organized into three sections: the core Cabinet du Roi, 14,000 royal copper printing-plates, and the donations of Edmond de Rothschild, which include 40,000 prints, 3,000 drawings, and 5,000 illustrated books. The holdings are displayed in the Pavillon de Flore; due to the fragility of the paper medium, only a portion are displayed at one time.\n\nLocation, access, and facilities\n\nThe museum lies in the center of Paris on the Right Bank. The neighborhood, known as the 1st arrondissement, was home to the former Tuileries Palace, which closed off the western end of the Louvre entrance courtyard, but was heavily damaged by fire during the Paris Commune of 1871 and later demolished. The adjacent Tuileries Gardens, created in 1564 by Catherine de' Medici, was designed in 1664 by André Le Nôtre. The gardens house the Galerie nationale du Jeu de Paume, a contemporary art exhibition space which was used to store confiscated Jewish cultural property during the 1940 to 1944 German occupation of France.Mroue, p. 176 Parallel to the Jeu de Paume is the Orangerie, home to the famous Water Lilies paintings by Claude Monet.\n\nThe Louvre is slightly askew of the Historic Axis (Axe historique), a roughly eight-kilometre (five-mile) architectural line bisecting the city. It begins on the east in the Louvre courtyard and runs west along the Champs-Élysées. In 1871, the burning of the Tuileries Palace by the Paris Commune revealed that the Louvre was slightly askew of the Axe despite past appearances to the contrary.Rogers, p. 159 The Louvre can be reached by the Palais Royal – Musée du Louvre Métro or the Louvre-Rivoli stations.\n\nThe Louvre has three entrances: the main entrance at the pyramid, an entrance from the Carrousel du Louvre underground shopping mall, and an entrance at the Porte des Lions (near the western end of the Denon wing).\n\nUnder the main entrance to the museum is the Carrousel du Louvre, a shopping mall operated by Unibail-Rodamco. Among other stores, it has the first Apple Store in France, and a McDonald's restaurant, the presence of which has created controversy.\n\nThe use of cameras and video recorders is permitted inside, but flash photography is forbidden.\n\nGallery\n\nFile:Head figurine Spedos Louvre Ma2709.jpg|Cycladic, a votive head, 2700–2300 BC\nFile:Stele Ra-Horakhty Louvre N3795.jpg|Egyptian, stele, Priest burning incense before Ra-Horakhty-Atum, ca. 900 BC\nFile:Ibex rhyton AO3115.jpg|Ancient Persia, the Ibex Rhyton, 600–300 BC\nFile:003MA Equestrian Kouros (2).jpg|Ancient Greek, Athens, The Rampin Rider,\nFile:Etruscan amphora Louvre E703 side B.jpg|Etruscan amphora, Diomedes and Polyxena, ca. 540–530 BC\nFile:Eros medallion Louvre Bj2248.jpg|Hellenic Near East, The Eros Medallion, ca. 250–200 BC\nFile:Fayum-34.jpg|Fayum Egyptian, Fayum mummy portrait\nFile:Marcus agrippa louvre portrait.jpg|Roman, portrait of Marcus Agrippa, 25 BC\nFile:Apostles Christ ivory Louvre OA3850.jpg|Frankish, ivory, Christ between two apostles, 5th century\nFile:Cup lustre Louvre OA8179.jpg|Islamic art from Iraq, terracotta cup, 9th century\nFile:Reliure.jpg|Romanesque art from Maastricht, Reliquary, 11th century\nFile:Louvre saint michel rf1427.jpg|Romanesque architecture from France, St Michael and the Devil, 12th century\nFile:Giotto di Bondone 002.jpg|Italian Renaissance painting, St Francis receiving the stigmata, Giotto, c.1300\nFile:Rogier van der Weyden 030.jpg|Early Netherlandish painting, The Annunciation, Rogier van der Weyden, 1435\nFile:Meister der Pietà von Avignon 004.jpg|Gothic art from France, The Pieta of Villeneuve les Avignon, Enguerrand Quarton, 1460\nFile:Domenico ghirlandaio, ritratto di nonno con nipote.jpg|Italian Renaissance painting, Portrait of an old man and his grandson, Ghirlandaio, 1488\nFile:Quentin Massys 001.jpg|Flemish painting, The Money Changer and His Wife, Quentin Massys, 1514\nFile:Baldassare Castiglione, by Raffaello Sanzio, from C2RMF retouched.jpg|Italian Renaissance painting, Baltasar de Castiglione, Raphael, c.1515\nFile:'Dying_Slave'_Michelangelo_JBU004.jpg|Italian Renaissance sculpture, Dying Slave, Michelangelo, 1513–16\nFile:Paolo Veronese 010.jpg|Venetian Mannerist painting, The Crucifixion, Paolo Veronese, c.1550\nFile:La Diseuse de bonne aventure, Caravaggio (Louvre INV 55) 02.jpg|Italian Baroque painting, The Fortune Teller, Caravaggio, c.1600\nFile:Charles I of England.jpg|English painting, Charles I at the Hunt, van Dyck, 1635\nFile:Jan Vermeer van Delft 016.jpg|Dutch Baroque, The Lacemaker, Vermeer, 1664\nFile:Diego Velázquez 029.jpg|Spanish painting, Infanta María Margarita, Velázquez, 1655\nFile:The shepherds of arcadia.jpg|French Classicism, The Shepherds of Arcadia, Poussin, c.1640\nFile:Boucher Diane sortant du bain Louvre 2712.jpg|French Rococo, Diana bathing, Boucher, 1742\nFile:Jean-Auguste-Dominique Ingres - La Baigneuse Valpinçon.jpg|French Classical painting, The Bather, Ingres, 1808\nFile:Eugène Delacroix - La liberté guidant le peuple.jpg|French Romantic art, Liberty Leading the People, Delacroix, 1830\nFile:Cabinet sur piètement - Cabinet on stand - Vers 1690-1710 - Boulle - Louvre - OA 5469.jpg|André-Charles Boulle Cabinet sur piètement, 1690-1710 \nFile:Cabinet sur piètement - Tiroirs - Cabinet on stand - Drawers - Vers 1690-1710 - Boulle - Louvre - OA 5469.jpg|André-Charles Boulle Cabinet sur piètement\nFile:Musée du Louvre - Département des Objets d'art - Salle 34 -2.JPG|André-Charles Boulle\nFile:Gaine - Pedestal - vers 1700-1720 - Boulle - Louvre - OA 5058 ou 5061.jpg|André-Charles Boulle, 1700-1720 \nFile:Musée du Louvre - Département des Objets d'art - Salle 34 -1.JPG|André-Charles Boulle\nFile:Régulateur - Regulator clock - vers 1714-1719 - Oppenordt - Boulle - Louvre - OA 6746.jpg|André-Charles Boulle 1714-1719. Louvre. http://en.wikipedia.org/?curid=17546."
  }
}
