{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19358",
  "eid" : "3a3ad2b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606939,
  "textBody" : "Michael John Moorcock (born 18 December 1939) is an English writer, primarily of science fiction and fantasy, who has also published literary novels. He is best known for his novels about the character Elric of Melniboné, a seminal influence on the field of fantasy in the 1960s and 1970s.\n\nAs editor of the British science fiction magazine New Worlds, from May 1964 until March 1971 and then again from 1976 to 1996, Moorcock fostered the development of the science fiction \"New Wave\" in the UK and indirectly in the United States. His publication of Bug Jack Barron by Norman Spinrad as a serial novel was notorious; in Parliament some British MPs condemned the Arts Council for funding the magazine.Michael Ashley, Transformations: Volume 2 in the History of the Science Fiction Magazine, 1950–1970 (Liverpool, England: Liverpool University Press, 2005), p. 250. He is also a successful recording musician, contributing to the band Hawkwind, and his own project.\n\nIn 2008, The Times newspaper named Moorcock in its list of \"The 50 greatest British writers since 1945\".[http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/books/article3127837.ece The 50 Greatest British Writers Since 1945]. 5 January 2008. The Times. Retrieved 2010-02-27.\n\nBiography\n\nMichael Moorcock was born in London in 1939 and the landscape of London, particularly the area of Notting Hill Gate and Ladbroke Grove, is an important influence in some of his fiction (cf. the Cornelius novels).\n\nMoorcock has mentioned The Gods of Mars by Edgar Rice Burroughs, The Apple Cart by George Bernard Shaw and The Constable of St. Nicholas by Edwin Lester Arnold as the first three books that captured his imagination.[https://web.archive.org/web/20040701233612/http://www.novymir.com.au/terminalcafe/intpeopl.html Thoughts \\ Interviews \\ People Online Chat with Michael Moorcock] The first book he bought was a secondhand copy of The Pilgrim's Progress.\n\nMoorcock is the former husband of Hilary Bailey. He is also the former husband of Jill Riches, who later married Robert Calvert. She illustrated some of Moorcock's book covers, including the Gloriana dustjacket.[http://www.isfdb.org/cgi-bin/ea.cgi?58821 \"Jill Riches – Summary Bibliography\"]. ISFDB. Retrieved 2013-04-04.\n\nHe was an original member of the Swordsmen and Sorcerers' Guild of America (SAGA), a loose-knit group of eight heroic fantasy authors founded in the 1960s and led by Lin Carter, self-selected by fantasy credentials alone.\n\nMoorcock was the subject of two book-length works, a monograph and an interview, by Colin Greenland. In 1983, Greenland published The Entropy Exhibition: Michael Moorcock and the British 'New Wave' in Science Fiction. He followed this with Michael Moorcock: Death is No Obstacle, a book-length interview in 1992.\n\nIn the 1990s, he moved to Texas in the United States.    He spends half of the year in Texas, the other half in Paris.\n\nViews on politics\n\nMoorcock's works are noted for their political nature and content. In one interview, he states, \"I am an anarchist and a pragmatist. My moral/philosophical position is that of an anarchist.\" Further, in describing how his writing relates to his political philosophy, Moorcock says, \"My books frequently deal with aristocratic heroes, gods and so forth. All of them end on a note which often states quite directly that one should serve neither gods nor masters but become one's own master.\"\n\nBesides using fiction to explore his politics, Moorcock also engages in political activism. In order to \"marginalize stuff that works to objectify women and suggests women enjoy being beaten\", he has encouraged W H Smiths to move John Norman's Gor series novels to the top shelf.\n\nWriter\n\nFiction\n\nMoorcock began writing whilst he was still at school, contributing to a magazine he entitled Outlaw's Own from 1950 on.\n\nIn 1957 at the age of 17, Moorcock became editor of the Tarzan Adventures where he published at least a dozen of his own Sojan the Swordsman stories during that year and the next. At age 18 (in 1958), he wrote the allegorical fantasy novel The Golden Barge. This remained unpublished until 1980, when it was issued by Savoy Books with an introduction by M. John Harrison. At 19 years of age he also edited Sexton Blake Library (serial pulp fiction featuring Sexton Blake, the poor man's Sherlock Holmes) and returned to late Victorian London for some of his books. Writing ever since, he has produced a huge volume of work. His first story in New Worlds was \"Going Home\" (1958; with Barrington J. Bayley). \"The Sundered Worlds\", a 57-page novella published in the November 1962 number of Science Fiction Adventures edited by John Carnell, became, with its sequel \"The Blood Red Game\" from the same magazine, the basis for his 190-page paperback debut novel three years later, The Sundered Worlds (Compact Books, 1965; in the U.S., Paperback Library, 1966).\n\nMoorcock replaced Carnell as New Worlds editor from the May–June 1964 number. Under his leadership the magazine became central to \"New Wave\" science fiction. This movement promoted literary style and an existential view of technological change, in contrast to \"hard science fiction\", which extrapolated on technological change itself. Some \"New Wave\" stories were not recognisable as traditional science fiction, and New Worlds remained controversial for as long as Moorcock edited it.\n\nDuring that time, he occasionally wrote as \"James Colvin\", a \"house pseudonym\" that was also used by other New Worlds critics. A spoof obituary of Colvin appeared in New Worlds #197 (January 1970), written by Charles Platt as \"William Barclay\". Moorcock makes much use of the initials \"JC\"; these are also the initials of Jesus Christ, the subject of his 1967 Nebula award-winning novella Behold the Man, which tells the story of Karl Glogauer, a time-traveller who takes on the role of Christ. They are also the initials of various \"Eternal Champion\" Moorcock characters such as Jerry Cornelius, Jerry Cornell and Jherek Carnelian. In more recent years, Moorcock has taken to using \"Warwick Colvin, Jr.\" as a pseudonym, particularly in his \"Second Ether\" fiction.\n\nMoorcock talks about much of his writing in Death Is No Obstacle by Colin Greenland, which is a book-length transcription of interviews with Moorcock about the structures in his writing.\n\nMoorcock has also published pastiches of writers for whom he felt affection as a boy, including Edgar Rice Burroughs, Leigh Brackett, and Robert E. Howard. All his fantasy adventures have elements of satire and parody, while respecting what he considered the essentials of the form. Although his heroic fantasies have been his most consistently reprinted books in the United States, he achieved prominence in the UK as a literary author, with the Guardian Fiction Prize in 1977 for The Condition of Muzak, and with Mother London later shortlisted for the Whitbread Prize.\n\nNovels and series like the Cornelius Quartet, Mother London, King of the City, the Pyat Quartet and the short story collection London Bone have established him in the eyes of critics such as Iain Sinclair, Peter Ackroyd and Alan Massie in publications that include The Times Literary Supplement and the London Review of Books as a major contemporary literary novelist. In 2008 Moorcock was named by a critics' panel in The Times as one of the fifty best British novelists since 1945. Virtually all of his stories are part of his overarching \"Eternal Champion\" theme or oeuvre, with characters (including Elric) moving from one storyline and fictional universe to another, all of them interconnected (though often only in dreams or visions).\n\nMost of Moorcock's earlier work consisted of short stories and relatively brief novels: he has mentioned that \"I could write 15,000 words a day and gave myself three days a volume. That's how, for instance, the Hawkmoon books were written.\" Over the period of the New Worlds editorship and his publishing of the original fantasy novels Moorcock has maintained an interest in the craft of writing and a continuing interest in the semi-journalistic craft of \"pulp\" authorship. This is reflected in his development of interlocking cycles which hark back to the origins of fantasy in myth and medieval cycles (see \"Wizardry and Wild Romance – Moorcock\" and \"Death Is No Obstacle – Colin Greenland\" for more commentary). This also provides an implicit link with the episodic  origins of literature in newspaper/magazine serials from Trollope and Dickens onwards. None of this should be surprising given Moorcock's background in magazine publishing.\n\nSince the 1980s, Moorcock has tended to write longer, more literary \"mainstream\" novels, such as Mother London and Byzantium Endures, but he continues to revisit characters from his earlier works, such as Elric, with books like The Dreamthief's Daughter or The Skrayling Tree. With the publication of the third and last book in this series, The White Wolf's Son, he announced that he was \"retiring\" from writing heroic fantasy fiction, though he continues to write Elric's adventures as graphic novels with his long-time collaborators Walter Simonson and the late James Cawthorn (1929–2008). Together, they produced the graphic novel, Elric: the Making of a Sorcerer, published by DC Comics in 2007. He has also completed his Colonel Pyat sequence, dealing with the Nazi Holocaust, which began in 1981 with Byzantium Endures, continued through The Laughter of Carthage (1984) and Jerusalem Commands (1992), and now culminates with The Vengeance of Rome (2006).\n\nAmong other works by Moorcock are The Dancers at the End of Time, set on Earth millions of years in the future, and Gloriana, or The Unfulfill'd Queen, set in an alternative Earth history.\n\nMoorcock is prone to revising his existing work, with the result that different editions of a given book may contain significant variations. The changes range from simple retitlings (e.g., the Elric story The Flame Bringers becoming The Caravan of Forgotten Dreams in the 1990s Gollancz/White Wolf omnibus editions) to character name changes (e.g., detective \"Minos Aquilinas\" becoming first \"Minos von Bek\" and later \"Sam Begg\" in three different versions of the short story \"The Pleasure Garden of Felipe Sagittarius\".[http://www.multiverse.org wiki/index.php?title=The_Pleasure_Garden_of_Felipe_Sagittarius \"The Pleasure Garden of Felipe Sagittarius\"]. Wiki hosted by Moorcock's Miscellany.), major textual alterations (e.g., the addition of several new chapters to The Steel Tsar in the omnibus editions), and even complete restructurings (e.g., the 1966 novella Behold the Man being expanded to novel length for republication in 1969).\n\nA new, final revision of almost his entire oeuvre, with the exception of his literary novels Mother London, King of the City and the Pyat quartet, is currently being issued by Victor Gollancz and many of his titles are being reprinted in the United States and France.\nMany comics based on his work are being reprinted by Titan Books under the general title The Michael Moorcock Library while in France a new adaptation of the Elric series has been very popular, translated into many languages, including English.  \nElric of Melniboné\n\nMoorcock's most popular works by far have been the \"Elric of Melniboné\" stories. In these books, Elric is written as a deliberate reversal of what Moorcock saw as clichés commonly found in fantasy adventure novels inspired by the works of J. R. R. Tolkien, and a direct antithesis of Robert E. Howard's Conan the Barbarian.\n\nMoorcock's work is complex and multilayered. Central to many of his fantasy novels is the concept of an \"Eternal Champion\", who has potentially multiple identities across multiple dimensions of reality and alternative universes. This cosmology is called the \"Multiverse\" within his novels and is based on the concept which arose in particle physics in the 1960s and is still a current theory in high energy physics. The Multiverse deals with various primal polarities such as good and evil, law and chaos, and order and entropy.\n\nThe popularity of Elric has overshadowed his many other works, though he has worked a number of the themes of the Elric stories into his other works (the \"Hawkmoon\" and \"Corum\" novels, for example) and Elric appears in the Jerry Cornelius and Dancers at the End of Time cycles. His Eternal Champion sequence has been collected in two different editions of omnibus volumes totalling 16 books (the U.S. edition was 15 volumes, while the British edition was 14 volumes, but due to various rights issues, the U.S. edition contained two volumes that were not included in the British edition, and the British edition likewise contained one volume that was not included in the U.S. edition) containing several books per volume, by Victor Gollancz in the UK and by White Wolf Publishing in the US. In 2003, Universal optioned the film rights to the Elric series, with the Weitz brothers as potential producers.\n\nJerry Cornelius\n\nAnother of Moorcock's popular creations is Jerry Cornelius, a kind of hip urban adventurer of ambiguous gender; the same characters featured in each of several Cornelius books. These books were most obviously satirical of modern times, including the Vietnam War, and continue to feature as another variation of the Multiverse theme. The first Jerry Cornelius book, The Final Programme (1968), was made into a feature film in 1973. Its story line is essentially identical to two of the Elric stories: The Dreaming City and The Dead Gods' Book. Since 1998, Moorcock has returned to Cornelius in a series of new stories: The Spencer Inheritance, The Camus Connection, Cheering for the Rockets, and Firing the Cathedral, which was concerned with 9/11. All four novellas were included in the 2003 edition of The Lives and Times of Jerry Cornelius. Moorcock's most recent Cornelius story, \"Modem Times\", appeared in The Solaris Book of New Science Fiction: Volume 2, published in 2008, this was expanded in 2011 as \"Modem Times 2.0\". Additionally, a version of Cornelius also appeared in Moorcock's 2010 Doctor Who novel The Coming of the Terraphiles.\n\nSince the 1990s he has worked on novels containing autobiography and fake autobiography mixed with fantasy and parody beginning with \"Blood\" and \"The War Amongst the Angels\". His most recent sequence began with \"The Whispering Swarm\", published to critical success in 2015.  With the forthcoming \"Kaboul\" (Denoel) he has begun to publish original work in France.\n\nMusic\n\nMoorcock collaborated with the British rock band HawkwindMike Coombes, [http://www.irosf.com/q/zine/article/10115 \"An Interview with Michael Moorcock\"], The Internet Review of Science Fiction, February 2005. on many occasions: the Hawkwind track \"The Black Corridor\", for example, included verbatim quotes from Moorcock's novel of the same name, and he worked with the band on their album Warrior on the Edge of Time, for which he earned a gold disc. Moorcock also wrote the lyrics to \"Sonic Attack\", a Sci-Fi satire of the public information broadcast, that was part of Hawkwind's Space Ritual set. Hawkwind's album The Chronicle of the Black Sword was largely based on the Elric novels. Moorcock appeared on stage with the band on many occasions, including the Black Sword tour. His contributions were removed from the original release of the Live Chronicles album, recorded on this tour, for legal reasons, but have subsequently appeared on some double CD versions. He can also be seen performing on the DVD version of Chronicle of the Black Sword.\n\nMoorcock also collaborated with former Hawkwind frontman and resident poet, Robert Calvert (who gave the chilling declamation of \"Sonic Attack\"), on Calvert's albums Lucky Leif and the Longships and Hype, playing guitar and banjo and singing background vocals.\n\nMoorcock has his own music project, which records under the name Michael Moorcock & The Deep Fix. The first single from the band was \"Starcruiser/Dodgem Dude\".  The first album New Worlds Fair was released in 1975. The album included a number of Hawkwind regulars in the credits. A second version of the album Roller Coaster Holiday was issued in 2004. In 2008, The Entropy Tango & Gloriana Demo Sessions was released. These were sessions for planned albums based on two of his novels: Gloriana, or The Unfulfill'd Queen, and The Entropy Tango. The albums were never completed. (The Deep Fix was the title story of an obscure collection of short stories by James Colvin published in the 1960s. The Deep Fix was also the fictional band fronted by Moorcock's character Jerry Cornelius.)  Working with Martin Stone he has recently been recording an album in Paris, Live From the Terminal Cafe. Following Stone's death in 2016, he plans to complete the album in Austin, Texas.\n\nMoorcock wrote the lyrics to three album tracks by the American band Blue Öyster Cult: \"Black Blade\", referring to the sword Stormbringer in the Elric books, \"Veteran of the Psychic Wars\", showing us Elric's emotions at a critical point of his story (this song may also refer to the \"Warriors at the Edge of Time\", which figure heavily in Moorcock's novels about John Daker; at one point his novel The Dragon in the Sword they call themselves the \"veterans of a thousand psychic wars\"), and \"The Great Sun Jester\", about his friend, the poet Bill Butler, who died of a drug overdose. Moorcock has performed live with BÖC (in 1987 at the Atlanta, GA Dragon Con Convention) and Hawkwind.\n\nMoorcock appeared on five tracks on the Spirits Burning CD Alien Injection, released in 2008. He is credited with singing lead vocals and playing guitar and mandolin. The performances used on the CD were from The Entropy Tango & Gloriana Demo Sessions.  He also contributed vocals and harmonica to Albert Bouchard's tribute album to his novel An Alien Heat.\n\nThe first of an audiobook series of unabridged Elric novels, with new work read by Moorcock, have recently begun appearing from AudioRealms. The second audiobook in the series – The Sailor on the Seas of Fate – was published in 2007.\n\nViews on fiction writing\n\nMoorcock is a fervent supporter of the works of Mervyn Peake. \n\nHe cites Fritz Leiber, an important sword and sorcery pioneer, as an author who writes fantasy that is not escapist and contains meaningful themes. These views can be found in his study of epic fantasy, Wizardry and Wild Romance (Gollancz, 1987) which was revised and reissued by MonkeyBrain Books in 2004—its first U.S. edition catalogued by ISFDB.\n\nMoorcock is somewhat dismissive of the works of J. R. R. Tolkien. He met both Tolkien and C. S. Lewis in his teens, and claims to have liked them personally even though he does not admire them on artistic grounds. Moorcock criticised works like The Lord of the Rings for their \"Merry England\" point of view, famously equating Tolkien's novel to Winnie-the-Pooh in his essay Epic Pooh.\n\nJames Cawthorn and Moorcock included The Lord of the Rings in Fantasy: The 100 Best Books (Carroll & Graf, 1988), and their review is not dismissive.\n\nMoorcock has also criticized writers for their political agendas. His targets include Robert A. Heinlein and H. P. Lovecraft, both of whom he attacked in a 1978 essay, \"Starship Stormtroopers\" (Anarchist Review). There he criticised the production of \"authoritarian\" fiction by a range of canonical writers, and Lovecraft for having anti-semitic, misogynistic and extremely racist viewpoints that he included in his short stories.\n\nSharing fictional universes with others\n\nMoorcock has allowed a number of other writers to create stories in his fictional Jerry Cornelius universe. Brian Aldiss, M. John Harrison, Norman Spinrad, James Sallis, and Steve Aylett, among others, have written such stories. In an interview published in The Internet Review of Science Fiction, Moorcock explains the reason for sharing his character:\n\nTwo short stories by Keith Roberts, \"Coranda\" and \"The Wreck of the Kissing Bitch\", are set in the frozen Matto Grosso plateau of Moorcock's 1969 novel, The Ice Schooner.\n\nElric of Melnibone and Moonglum appear in Karl Edward Wagner's story \"The Gothic Touch\", where they meet with Kane, who borrows Elric for his ability to deal with demons.\n \nHe is a friend and fan of comic book writer Alan Moore, and allowed Moore the use of his own character, Michael Kane of Old Mars, mentioned in Moore's The League of Extraordinary Gentlemen, Volume II. The two men appeared on stage at the Vanbrugh Theatre in London in January 2006 where they discussed Moorcock's work. The Green City from Warriors of Mars was also referenced in Larry Niven's Rainbow Mars. Moorcock's character Jerry Cornelius appeared in Moore's The League of Extraordinary Gentlemen, Volume III: Century.\n\nCornelius also appeared in French artist Mœbius' comic series Le Garage Hermétique.\n\nIn 1995-96, Moorcock wrote a script for a computer game by Origin Systems. The game was cancelled, but Moorcock's outline was fleshed out by Storm Constantine, resulting in the novel, Silverheart. The story is set in Karadur-Shriltasi, a city at the heart of the Multiverse. A second novel, Dragonskin, is currently in preparation, with Constantine as the main writer.\n\nMoorcock is currently working on a memoir about his friends Mervyn Peake and Maeve Gilmore and writing a text for first publication in French to accompany a set of unpublished Peake drawings. His book The Metatemporal Detective was published in 2007.\n\nIn November 2009, Moorcock announced that he would be writing a Doctor Who novel for BBC Books in 2010, making it one of the few occasions when he has written stories set in other people's \"shared universes\". The novel, The Coming of the Terraphiles, was released in October 2010. The story merges Doctor Who with many of Moorcock's characters from the multiverse, notably Captain Cornelius and his pirates.\n\nAwards and honours\n\nMichael Moorcock has received great recognition for his career contributions as well as for particular works.\n\nThe Science Fiction and Fantasy Hall of Fame inducted Moorcock in 2002, its seventh class of two deceased and two living writers. He also received life achievement awards at the World Fantasy Convention in 2000 (World Fantasy Award), at the Utopiales International Festival in 2004 (Prix Utopia), from the Horror Writers Association in 2005 (Bram Stoker Award), and from the Science Fiction and Fantasy Writers of America in 2008 (named its 25th Grand Master).\n\n* 1993 British Fantasy Award (Committee Award)\n* 2000 World Fantasy Award for Life Achievement\n* 2004 Prix Utopiales \"Grandmaster\" Lifetime Achievement Award\n* 2004 Bram Stoker Award for Lifetime Achievement in the horror genre\n* 2008 Damon Knight Memorial Grand Master Award, literary fantasy and science fiction\n\nHe was \"Co-Guest of Honor\" at the 1976 World Fantasy Convention in New York City and one Guest of Honor at the 1997 55th World Science Fiction Convention in San Antonio, Texas.\n\n;Awards for particular works\n\n* 1967 Nebula Award (Novella): Behold the Man\n* 1972 August Derleth Fantasy Award: The Knight of the Swords\n* 1973 August Derleth Fantasy Award: The King of the Swords\n* 1974 British Fantasy Award (Best Short Story): The Jade Man's Eyes\n* 1975 August Derleth Fantasy Award: The Sword and the Stallion\n* 1976 August Derleth Fantasy Award: The Hollow Lands\n* 1977 Guardian Fiction Award: The Condition of Muzak\n* 1979 John W. Campbell Memorial Award for Best Science Fiction Novel: Gloriana\n* 1979 World Fantasy Award (Best Novel): Gloriana\n\nSelected works\n\n* The Best of Michael Moorcock (Tachyon Publications, 2009)\n* The Elric of Melniboné series (1961–1991), including:\n** The Dreaming City (1961)\n** The Stealer of Souls (1963)\n** Stormbringer (1965, revised 1977)\n** Elric of Melniboné (1972)\n** Elric: The Sailor on the Seas of Fate (1976)\n** The Vanishing Tower (1977)\n** Elric at the End of Time\n* The Dorian Hawkmoon series (1967-1975), including:\n** The Jewel in the Skull (1967)\n** The Mad God's Amulet (1968)\n** The Sword of the Dawn (1968)\n** The Runestaff (1969)\n** Count Brass (1973)\n** The Champion of Garathorm (1973)\n** The Quest for Tanelorn (1975)\n* The Erekosë series (1970-1987), including:\n** The Eternal Champion (1970)\n** Phoenix in Obsidian, aka The Silver Warriors (1970)\n** The Dragon in the Sword (1987)\n* The Corum series (1971-1974), including:\n** The Knight of the Swords (1971)\n** The Queen of the Swords (1971)\n** The King of the Swords (1971)\n** The Bull and the Spear (1973)\n** The Oak and the Ram (1973)\n** The Sword and the Stallion (1974)\n* Behold the Man (1969)\n* The Time Dweller (1969)\n* Sailing to Utopia, comprising:\n** Flux (1962)\n** The Ice Schooner (1966)\n** The Black Corridor (1969)\n** The Distant Suns (1975)\n* The Chinese Agent (1970)\n* The Russian Intelligence (1980)\n* Michael Moorcock's Multiverse (1999) (graphic novel)\n* The Metatemporal Detective (2007) (collection)\n* A Nomad of the Time Streams:\n** The Warlord of the Air (1971)\n** The Land Leviathan (1974)\n** The Steel Tsar (1981)\n* The Dancers at the End of Time sequence (1972–76):\n** An Alien Heat (1972)\n** The Hollow Lands (1974)\n** The End of All Songs (1976)\n* Legends from the End of Time (1976)\n* Gloriana (1978)\n* My Experiences in the Third World War (1980)\n* Mother London (1988)\n* King of the City (2000)\n* The Jerry Cornelius quartet of novels and shorter fiction:\n** The Final Programme (1969)\n** A Cure for Cancer (1971)\n** The English Assassin (1972)\n** The Condition of Muzak (1977)\n** The Cornelius Quartet (Compilation volume)\n** The Adventures of Una Persson and Catherine Cornelius in the 20th Century (1976)\n** The Lives and Times of Jerry Cornelius (1976)\n** The Entropy Tango (1981)\n** The Alchemist's Question (1984)\n** Firing the Cathedral (novella) (2002)\n** Modem Times 2.0 (novella) (2011)\n* The von Bek sequence:\n** The War Hound and the World's Pain (1981)\n** The Brothel in Rosenstrasse (1982)\n** The City in the Autumn Stars (1986)\n* The Between the Wars sequence:\n** Byzantium Endures (1981)\n** The Laughter of Carthage (1984)\n** Jerusalem Commands (1992)\n** The Vengeance of Rome (2006)\n* The Second Ether sequence:\n** Blood: A Southern Fantasy (1994)\n** Fabulous Harbours (1995)\n** The War Amongst The Angels (1996)\n* London Bone  (2001) – short stories\n* The Elric/Oona Von Bek sequence:\n** The Dreamthief's Daughter (2001)\n** The Skrayling Tree (2003)\n** The White Wolf's Son (2005)\n* Doctor Who:\n** The Coming of the Terraphiles (2010)\n* The Sanctuary of the White Friars\n**The Whispering Swarm (2015)\n\nAnthologies edited\n\nHe has also edited other volumes, including two bringing together examples of invasion literature:\n* Before Armageddon (1975)\n* England Invaded (1977)\n\nNonfiction\n\n* Wizardry and Wild Romance: a study of epic fantasy (UK: Gollancz, 1987, ), 160 pp., \n** Wizardry and Wild Romance: a study of epic fantasy, revised and expanded (US: MonkeyBrain Books, 2004, ), 206 pp., \n* Fantasy: The 100 Best Books (London: Xanadu Publications, 1988, ; Carroll & Graf, 1988, ), James Cawthorn and Moorcock\n* Into the Media Web: Selected short non-fiction, 1956-2006, edited by John Davey, introduced by Alan Moore, (UK: Savoy Books, 2010, ) 718 pp\n* London Peculiar and Other Nonfiction, Edited by Michael Moorcock and Allan Kausch, introduced by Iain Sinclair, (US: PM Press, 2012, ), 377pp",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Michael Moorcock" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19358" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Michael John Moorcock (born 18 December 1939) is an English writer, primarily of science fiction and fantasy, who has also published literary novels. He is best known for his novels about the character Elric of Melniboné, a seminal influence on the field of fantasy in the 1960s and 1970s.\n\nAs editor of the British science fiction magazine New Worlds, from May 1964 until March 1971 and then again from 1976 to 1996, Moorcock fostered the development of the science fiction \"New Wave\" in the UK and indirectly in the United States. His publication of Bug Jack Barron by Norman Spinrad as a serial novel was notorious; in Parliament some British MPs condemned the Arts Council for funding the magazine.Michael Ashley, Transformations: Volume 2 in the History of the Science Fiction Magazine, 1950–1970 (Liverpool, England: Liverpool University Press, 2005), p. 250. He is also a successful recording musician, contributing to the band Hawkwind, and his own project.\n\nIn 2008, The Times newspaper named Moorcock in its list of \"The 50 greatest British writers since 1945\".[http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/books/article3127837.ece The 50 Greatest British Writers Since 1945]. 5 January 2008. The Times. Retrieved 2010-02-27.\n\nBiography\n\nMichael Moorcock was born in London in 1939 and the landscape of London, particularly the area of Notting Hill Gate and Ladbroke Grove, is an important influence in some of his fiction (cf. the Cornelius novels).\n\nMoorcock has mentioned The Gods of Mars by Edgar Rice Burroughs, The Apple Cart by George Bernard Shaw and The Constable of St. Nicholas by Edwin Lester Arnold as the first three books that captured his imagination.[https://web.archive.org/web/20040701233612/http://www.novymir.com.au/terminalcafe/intpeopl.html Thoughts \\ Interviews \\ People Online Chat with Michael Moorcock] The first book he bought was a secondhand copy of The Pilgrim's Progress.\n\nMoorcock is the former husband of Hilary Bailey. He is also the former husband of Jill Riches, who later married Robert Calvert. She illustrated some of Moorcock's book covers, including the Gloriana dustjacket.[http://www.isfdb.org/cgi-bin/ea.cgi?58821 \"Jill Riches – Summary Bibliography\"]. ISFDB. Retrieved 2013-04-04.\n\nHe was an original member of the Swordsmen and Sorcerers' Guild of America (SAGA), a loose-knit group of eight heroic fantasy authors founded in the 1960s and led by Lin Carter, self-selected by fantasy credentials alone.\n\nMoorcock was the subject of two book-length works, a monograph and an interview, by Colin Greenland. In 1983, Greenland published The Entropy Exhibition: Michael Moorcock and the British 'New Wave' in Science Fiction. He followed this with Michael Moorcock: Death is No Obstacle, a book-length interview in 1992.\n\nIn the 1990s, he moved to Texas in the United States.    He spends half of the year in Texas, the other half in Paris.\n\nViews on politics\n\nMoorcock's works are noted for their political nature and content. In one interview, he states, \"I am an anarchist and a pragmatist. My moral/philosophical position is that of an anarchist.\" Further, in describing how his writing relates to his political philosophy, Moorcock says, \"My books frequently deal with aristocratic heroes, gods and so forth. All of them end on a note which often states quite directly that one should serve neither gods nor masters but become one's own master.\"\n\nBesides using fiction to explore his politics, Moorcock also engages in political activism. In order to \"marginalize stuff that works to objectify women and suggests women enjoy being beaten\", he has encouraged W H Smiths to move John Norman's Gor series novels to the top shelf.\n\nWriter\n\nFiction\n\nMoorcock began writing whilst he was still at school, contributing to a magazine he entitled Outlaw's Own from 1950 on.\n\nIn 1957 at the age of 17, Moorcock became editor of the Tarzan Adventures where he published at least a dozen of his own Sojan the Swordsman stories during that year and the next. At age 18 (in 1958), he wrote the allegorical fantasy novel The Golden Barge. This remained unpublished until 1980, when it was issued by Savoy Books with an introduction by M. John Harrison. At 19 years of age he also edited Sexton Blake Library (serial pulp fiction featuring Sexton Blake, the poor man's Sherlock Holmes) and returned to late Victorian London for some of his books. Writing ever since, he has produced a huge volume of work. His first story in New Worlds was \"Going Home\" (1958; with Barrington J. Bayley). \"The Sundered Worlds\", a 57-page novella published in the November 1962 number of Science Fiction Adventures edited by John Carnell, became, with its sequel \"The Blood Red Game\" from the same magazine, the basis for his 190-page paperback debut novel three years later, The Sundered Worlds (Compact Books, 1965; in the U.S., Paperback Library, 1966).\n\nMoorcock replaced Carnell as New Worlds editor from the May–June 1964 number. Under his leadership the magazine became central to \"New Wave\" science fiction. This movement promoted literary style and an existential view of technological change, in contrast to \"hard science fiction\", which extrapolated on technological change itself. Some \"New Wave\" stories were not recognisable as traditional science fiction, and New Worlds remained controversial for as long as Moorcock edited it.\n\nDuring that time, he occasionally wrote as \"James Colvin\", a \"house pseudonym\" that was also used by other New Worlds critics. A spoof obituary of Colvin appeared in New Worlds #197 (January 1970), written by Charles Platt as \"William Barclay\". Moorcock makes much use of the initials \"JC\"; these are also the initials of Jesus Christ, the subject of his 1967 Nebula award-winning novella Behold the Man, which tells the story of Karl Glogauer, a time-traveller who takes on the role of Christ. They are also the initials of various \"Eternal Champion\" Moorcock characters such as Jerry Cornelius, Jerry Cornell and Jherek Carnelian. In more recent years, Moorcock has taken to using \"Warwick Colvin, Jr.\" as a pseudonym, particularly in his \"Second Ether\" fiction.\n\nMoorcock talks about much of his writing in Death Is No Obstacle by Colin Greenland, which is a book-length transcription of interviews with Moorcock about the structures in his writing.\n\nMoorcock has also published pastiches of writers for whom he felt affection as a boy, including Edgar Rice Burroughs, Leigh Brackett, and Robert E. Howard. All his fantasy adventures have elements of satire and parody, while respecting what he considered the essentials of the form. Although his heroic fantasies have been his most consistently reprinted books in the United States, he achieved prominence in the UK as a literary author, with the Guardian Fiction Prize in 1977 for The Condition of Muzak, and with Mother London later shortlisted for the Whitbread Prize.\n\nNovels and series like the Cornelius Quartet, Mother London, King of the City, the Pyat Quartet and the short story collection London Bone have established him in the eyes of critics such as Iain Sinclair, Peter Ackroyd and Alan Massie in publications that include The Times Literary Supplement and the London Review of Books as a major contemporary literary novelist. In 2008 Moorcock was named by a critics' panel in The Times as one of the fifty best British novelists since 1945. Virtually all of his stories are part of his overarching \"Eternal Champion\" theme or oeuvre, with characters (including Elric) moving from one storyline and fictional universe to another, all of them interconnected (though often only in dreams or visions).\n\nMost of Moorcock's earlier work consisted of short stories and relatively brief novels: he has mentioned that \"I could write 15,000 words a day and gave myself three days a volume. That's how, for instance, the Hawkmoon books were written.\" Over the period of the New Worlds editorship and his publishing of the original fantasy novels Moorcock has maintained an interest in the craft of writing and a continuing interest in the semi-journalistic craft of \"pulp\" authorship. This is reflected in his development of interlocking cycles which hark back to the origins of fantasy in myth and medieval cycles (see \"Wizardry and Wild Romance – Moorcock\" and \"Death Is No Obstacle – Colin Greenland\" for more commentary). This also provides an implicit link with the episodic  origins of literature in newspaper/magazine serials from Trollope and Dickens onwards. None of this should be surprising given Moorcock's background in magazine publishing.\n\nSince the 1980s, Moorcock has tended to write longer, more literary \"mainstream\" novels, such as Mother London and Byzantium Endures, but he continues to revisit characters from his earlier works, such as Elric, with books like The Dreamthief's Daughter or The Skrayling Tree. With the publication of the third and last book in this series, The White Wolf's Son, he announced that he was \"retiring\" from writing heroic fantasy fiction, though he continues to write Elric's adventures as graphic novels with his long-time collaborators Walter Simonson and the late James Cawthorn (1929–2008). Together, they produced the graphic novel, Elric: the Making of a Sorcerer, published by DC Comics in 2007. He has also completed his Colonel Pyat sequence, dealing with the Nazi Holocaust, which began in 1981 with Byzantium Endures, continued through The Laughter of Carthage (1984) and Jerusalem Commands (1992), and now culminates with The Vengeance of Rome (2006).\n\nAmong other works by Moorcock are The Dancers at the End of Time, set on Earth millions of years in the future, and Gloriana, or The Unfulfill'd Queen, set in an alternative Earth history.\n\nMoorcock is prone to revising his existing work, with the result that different editions of a given book may contain significant variations. The changes range from simple retitlings (e.g., the Elric story The Flame Bringers becoming The Caravan of Forgotten Dreams in the 1990s Gollancz/White Wolf omnibus editions) to character name changes (e.g., detective \"Minos Aquilinas\" becoming first \"Minos von Bek\" and later \"Sam Begg\" in three different versions of the short story \"The Pleasure Garden of Felipe Sagittarius\".[http://www.multiverse.org wiki/index.php?title=The_Pleasure_Garden_of_Felipe_Sagittarius \"The Pleasure Garden of Felipe Sagittarius\"]. Wiki hosted by Moorcock's Miscellany.), major textual alterations (e.g., the addition of several new chapters to The Steel Tsar in the omnibus editions), and even complete restructurings (e.g., the 1966 novella Behold the Man being expanded to novel length for republication in 1969).\n\nA new, final revision of almost his entire oeuvre, with the exception of his literary novels Mother London, King of the City and the Pyat quartet, is currently being issued by Victor Gollancz and many of his titles are being reprinted in the United States and France.\nMany comics based on his work are being reprinted by Titan Books under the general title The Michael Moorcock Library while in France a new adaptation of the Elric series has been very popular, translated into many languages, including English.  \nElric of Melniboné\n\nMoorcock's most popular works by far have been the \"Elric of Melniboné\" stories. In these books, Elric is written as a deliberate reversal of what Moorcock saw as clichés commonly found in fantasy adventure novels inspired by the works of J. R. R. Tolkien, and a direct antithesis of Robert E. Howard's Conan the Barbarian.\n\nMoorcock's work is complex and multilayered. Central to many of his fantasy novels is the concept of an \"Eternal Champion\", who has potentially multiple identities across multiple dimensions of reality and alternative universes. This cosmology is called the \"Multiverse\" within his novels and is based on the concept which arose in particle physics in the 1960s and is still a current theory in high energy physics. The Multiverse deals with various primal polarities such as good and evil, law and chaos, and order and entropy.\n\nThe popularity of Elric has overshadowed his many other works, though he has worked a number of the themes of the Elric stories into his other works (the \"Hawkmoon\" and \"Corum\" novels, for example) and Elric appears in the Jerry Cornelius and Dancers at the End of Time cycles. His Eternal Champion sequence has been collected in two different editions of omnibus volumes totalling 16 books (the U.S. edition was 15 volumes, while the British edition was 14 volumes, but due to various rights issues, the U.S. edition contained two volumes that were not included in the British edition, and the British edition likewise contained one volume that was not included in the U.S. edition) containing several books per volume, by Victor Gollancz in the UK and by White Wolf Publishing in the US. In 2003, Universal optioned the film rights to the Elric series, with the Weitz brothers as potential producers.\n\nJerry Cornelius\n\nAnother of Moorcock's popular creations is Jerry Cornelius, a kind of hip urban adventurer of ambiguous gender; the same characters featured in each of several Cornelius books. These books were most obviously satirical of modern times, including the Vietnam War, and continue to feature as another variation of the Multiverse theme. The first Jerry Cornelius book, The Final Programme (1968), was made into a feature film in 1973. Its story line is essentially identical to two of the Elric stories: The Dreaming City and The Dead Gods' Book. Since 1998, Moorcock has returned to Cornelius in a series of new stories: The Spencer Inheritance, The Camus Connection, Cheering for the Rockets, and Firing the Cathedral, which was concerned with 9/11. All four novellas were included in the 2003 edition of The Lives and Times of Jerry Cornelius. Moorcock's most recent Cornelius story, \"Modem Times\", appeared in The Solaris Book of New Science Fiction: Volume 2, published in 2008, this was expanded in 2011 as \"Modem Times 2.0\". Additionally, a version of Cornelius also appeared in Moorcock's 2010 Doctor Who novel The Coming of the Terraphiles.\n\nSince the 1990s he has worked on novels containing autobiography and fake autobiography mixed with fantasy and parody beginning with \"Blood\" and \"The War Amongst the Angels\". His most recent sequence began with \"The Whispering Swarm\", published to critical success in 2015.  With the forthcoming \"Kaboul\" (Denoel) he has begun to publish original work in France.\n\nMusic\n\nMoorcock collaborated with the British rock band HawkwindMike Coombes, [http://www.irosf.com/q/zine/article/10115 \"An Interview with Michael Moorcock\"], The Internet Review of Science Fiction, February 2005. on many occasions: the Hawkwind track \"The Black Corridor\", for example, included verbatim quotes from Moorcock's novel of the same name, and he worked with the band on their album Warrior on the Edge of Time, for which he earned a gold disc. Moorcock also wrote the lyrics to \"Sonic Attack\", a Sci-Fi satire of the public information broadcast, that was part of Hawkwind's Space Ritual set. Hawkwind's album The Chronicle of the Black Sword was largely based on the Elric novels. Moorcock appeared on stage with the band on many occasions, including the Black Sword tour. His contributions were removed from the original release of the Live Chronicles album, recorded on this tour, for legal reasons, but have subsequently appeared on some double CD versions. He can also be seen performing on the DVD version of Chronicle of the Black Sword.\n\nMoorcock also collaborated with former Hawkwind frontman and resident poet, Robert Calvert (who gave the chilling declamation of \"Sonic Attack\"), on Calvert's albums Lucky Leif and the Longships and Hype, playing guitar and banjo and singing background vocals.\n\nMoorcock has his own music project, which records under the name Michael Moorcock & The Deep Fix. The first single from the band was \"Starcruiser/Dodgem Dude\".  The first album New Worlds Fair was released in 1975. The album included a number of Hawkwind regulars in the credits. A second version of the album Roller Coaster Holiday was issued in 2004. In 2008, The Entropy Tango & Gloriana Demo Sessions was released. These were sessions for planned albums based on two of his novels: Gloriana, or The Unfulfill'd Queen, and The Entropy Tango. The albums were never completed. (The Deep Fix was the title story of an obscure collection of short stories by James Colvin published in the 1960s. The Deep Fix was also the fictional band fronted by Moorcock's character Jerry Cornelius.)  Working with Martin Stone he has recently been recording an album in Paris, Live From the Terminal Cafe. Following Stone's death in 2016, he plans to complete the album in Austin, Texas.\n\nMoorcock wrote the lyrics to three album tracks by the American band Blue Öyster Cult: \"Black Blade\", referring to the sword Stormbringer in the Elric books, \"Veteran of the Psychic Wars\", showing us Elric's emotions at a critical point of his story (this song may also refer to the \"Warriors at the Edge of Time\", which figure heavily in Moorcock's novels about John Daker; at one point his novel The Dragon in the Sword they call themselves the \"veterans of a thousand psychic wars\"), and \"The Great Sun Jester\", about his friend, the poet Bill Butler, who died of a drug overdose. Moorcock has performed live with BÖC (in 1987 at the Atlanta, GA Dragon Con Convention) and Hawkwind.\n\nMoorcock appeared on five tracks on the Spirits Burning CD Alien Injection, released in 2008. He is credited with singing lead vocals and playing guitar and mandolin. The performances used on the CD were from The Entropy Tango & Gloriana Demo Sessions.  He also contributed vocals and harmonica to Albert Bouchard's tribute album to his novel An Alien Heat.\n\nThe first of an audiobook series of unabridged Elric novels, with new work read by Moorcock, have recently begun appearing from AudioRealms. The second audiobook in the series – The Sailor on the Seas of Fate – was published in 2007.\n\nViews on fiction writing\n\nMoorcock is a fervent supporter of the works of Mervyn Peake. \n\nHe cites Fritz Leiber, an important sword and sorcery pioneer, as an author who writes fantasy that is not escapist and contains meaningful themes. These views can be found in his study of epic fantasy, Wizardry and Wild Romance (Gollancz, 1987) which was revised and reissued by MonkeyBrain Books in 2004—its first U.S. edition catalogued by ISFDB.\n\nMoorcock is somewhat dismissive of the works of J. R. R. Tolkien. He met both Tolkien and C. S. Lewis in his teens, and claims to have liked them personally even though he does not admire them on artistic grounds. Moorcock criticised works like The Lord of the Rings for their \"Merry England\" point of view, famously equating Tolkien's novel to Winnie-the-Pooh in his essay Epic Pooh.\n\nJames Cawthorn and Moorcock included The Lord of the Rings in Fantasy: The 100 Best Books (Carroll & Graf, 1988), and their review is not dismissive.\n\nMoorcock has also criticized writers for their political agendas. His targets include Robert A. Heinlein and H. P. Lovecraft, both of whom he attacked in a 1978 essay, \"Starship Stormtroopers\" (Anarchist Review). There he criticised the production of \"authoritarian\" fiction by a range of canonical writers, and Lovecraft for having anti-semitic, misogynistic and extremely racist viewpoints that he included in his short stories.\n\nSharing fictional universes with others\n\nMoorcock has allowed a number of other writers to create stories in his fictional Jerry Cornelius universe. Brian Aldiss, M. John Harrison, Norman Spinrad, James Sallis, and Steve Aylett, among others, have written such stories. In an interview published in The Internet Review of Science Fiction, Moorcock explains the reason for sharing his character:\n\nTwo short stories by Keith Roberts, \"Coranda\" and \"The Wreck of the Kissing Bitch\", are set in the frozen Matto Grosso plateau of Moorcock's 1969 novel, The Ice Schooner.\n\nElric of Melnibone and Moonglum appear in Karl Edward Wagner's story \"The Gothic Touch\", where they meet with Kane, who borrows Elric for his ability to deal with demons.\n \nHe is a friend and fan of comic book writer Alan Moore, and allowed Moore the use of his own character, Michael Kane of Old Mars, mentioned in Moore's The League of Extraordinary Gentlemen, Volume II. The two men appeared on stage at the Vanbrugh Theatre in London in January 2006 where they discussed Moorcock's work. The Green City from Warriors of Mars was also referenced in Larry Niven's Rainbow Mars. Moorcock's character Jerry Cornelius appeared in Moore's The League of Extraordinary Gentlemen, Volume III: Century.\n\nCornelius also appeared in French artist Mœbius' comic series Le Garage Hermétique.\n\nIn 1995-96, Moorcock wrote a script for a computer game by Origin Systems. The game was cancelled, but Moorcock's outline was fleshed out by Storm Constantine, resulting in the novel, Silverheart. The story is set in Karadur-Shriltasi, a city at the heart of the Multiverse. A second novel, Dragonskin, is currently in preparation, with Constantine as the main writer.\n\nMoorcock is currently working on a memoir about his friends Mervyn Peake and Maeve Gilmore and writing a text for first publication in French to accompany a set of unpublished Peake drawings. His book The Metatemporal Detective was published in 2007.\n\nIn November 2009, Moorcock announced that he would be writing a Doctor Who novel for BBC Books in 2010, making it one of the few occasions when he has written stories set in other people's \"shared universes\". The novel, The Coming of the Terraphiles, was released in October 2010. The story merges Doctor Who with many of Moorcock's characters from the multiverse, notably Captain Cornelius and his pirates.\n\nAwards and honours\n\nMichael Moorcock has received great recognition for his career contributions as well as for particular works.\n\nThe Science Fiction and Fantasy Hall of Fame inducted Moorcock in 2002, its seventh class of two deceased and two living writers. He also received life achievement awards at the World Fantasy Convention in 2000 (World Fantasy Award), at the Utopiales International Festival in 2004 (Prix Utopia), from the Horror Writers Association in 2005 (Bram Stoker Award), and from the Science Fiction and Fantasy Writers of America in 2008 (named its 25th Grand Master).\n\n* 1993 British Fantasy Award (Committee Award)\n* 2000 World Fantasy Award for Life Achievement\n* 2004 Prix Utopiales \"Grandmaster\" Lifetime Achievement Award\n* 2004 Bram Stoker Award for Lifetime Achievement in the horror genre\n* 2008 Damon Knight Memorial Grand Master Award, literary fantasy and science fiction\n\nHe was \"Co-Guest of Honor\" at the 1976 World Fantasy Convention in New York City and one Guest of Honor at the 1997 55th World Science Fiction Convention in San Antonio, Texas.\n\n;Awards for particular works\n\n* 1967 Nebula Award (Novella): Behold the Man\n* 1972 August Derleth Fantasy Award: The Knight of the Swords\n* 1973 August Derleth Fantasy Award: The King of the Swords\n* 1974 British Fantasy Award (Best Short Story): The Jade Man's Eyes\n* 1975 August Derleth Fantasy Award: The Sword and the Stallion\n* 1976 August Derleth Fantasy Award: The Hollow Lands\n* 1977 Guardian Fiction Award: The Condition of Muzak\n* 1979 John W. Campbell Memorial Award for Best Science Fiction Novel: Gloriana\n* 1979 World Fantasy Award (Best Novel): Gloriana\n\nSelected works\n\n* The Best of Michael Moorcock (Tachyon Publications, 2009)\n* The Elric of Melniboné series (1961–1991), including:\n** The Dreaming City (1961)\n** The Stealer of Souls (1963)\n** Stormbringer (1965, revised 1977)\n** Elric of Melniboné (1972)\n** Elric: The Sailor on the Seas of Fate (1976)\n** The Vanishing Tower (1977)\n** Elric at the End of Time\n* The Dorian Hawkmoon series (1967-1975), including:\n** The Jewel in the Skull (1967)\n** The Mad God's Amulet (1968)\n** The Sword of the Dawn (1968)\n** The Runestaff (1969)\n** Count Brass (1973)\n** The Champion of Garathorm (1973)\n** The Quest for Tanelorn (1975)\n* The Erekosë series (1970-1987), including:\n** The Eternal Champion (1970)\n** Phoenix in Obsidian, aka The Silver Warriors (1970)\n** The Dragon in the Sword (1987)\n* The Corum series (1971-1974), including:\n** The Knight of the Swords (1971)\n** The Queen of the Swords (1971)\n** The King of the Swords (1971)\n** The Bull and the Spear (1973)\n** The Oak and the Ram (1973)\n** The Sword and the Stallion (1974)\n* Behold the Man (1969)\n* The Time Dweller (1969)\n* Sailing to Utopia, comprising:\n** Flux (1962)\n** The Ice Schooner (1966)\n** The Black Corridor (1969)\n** The Distant Suns (1975)\n* The Chinese Agent (1970)\n* The Russian Intelligence (1980)\n* Michael Moorcock's Multiverse (1999) (graphic novel)\n* The Metatemporal Detective (2007) (collection)\n* A Nomad of the Time Streams:\n** The Warlord of the Air (1971)\n** The Land Leviathan (1974)\n** The Steel Tsar (1981)\n* The Dancers at the End of Time sequence (1972–76):\n** An Alien Heat (1972)\n** The Hollow Lands (1974)\n** The End of All Songs (1976)\n* Legends from the End of Time (1976)\n* Gloriana (1978)\n* My Experiences in the Third World War (1980)\n* Mother London (1988)\n* King of the City (2000)\n* The Jerry Cornelius quartet of novels and shorter fiction:\n** The Final Programme (1969)\n** A Cure for Cancer (1971)\n** The English Assassin (1972)\n** The Condition of Muzak (1977)\n** The Cornelius Quartet (Compilation volume)\n** The Adventures of Una Persson and Catherine Cornelius in the 20th Century (1976)\n** The Lives and Times of Jerry Cornelius (1976)\n** The Entropy Tango (1981)\n** The Alchemist's Question (1984)\n** Firing the Cathedral (novella) (2002)\n** Modem Times 2.0 (novella) (2011)\n* The von Bek sequence:\n** The War Hound and the World's Pain (1981)\n** The Brothel in Rosenstrasse (1982)\n** The City in the Autumn Stars (1986)\n* The Between the Wars sequence:\n** Byzantium Endures (1981)\n** The Laughter of Carthage (1984)\n** Jerusalem Commands (1992)\n** The Vengeance of Rome (2006)\n* The Second Ether sequence:\n** Blood: A Southern Fantasy (1994)\n** Fabulous Harbours (1995)\n** The War Amongst The Angels (1996)\n* London Bone  (2001) – short stories\n* The Elric/Oona Von Bek sequence:\n** The Dreamthief's Daughter (2001)\n** The Skrayling Tree (2003)\n** The White Wolf's Son (2005)\n* Doctor Who:\n** The Coming of the Terraphiles (2010)\n* The Sanctuary of the White Friars\n**The Whispering Swarm (2015)\n\nAnthologies edited\n\nHe has also edited other volumes, including two bringing together examples of invasion literature:\n* Before Armageddon (1975)\n* England Invaded (1977)\n\nNonfiction\n\n* Wizardry and Wild Romance: a study of epic fantasy (UK: Gollancz, 1987, ), 160 pp., \n** Wizardry and Wild Romance: a study of epic fantasy, revised and expanded (US: MonkeyBrain Books, 2004, ), 206 pp., \n* Fantasy: The 100 Best Books (London: Xanadu Publications, 1988, ; Carroll & Graf, 1988, ), James Cawthorn and Moorcock\n* Into the Media Web: Selected short non-fiction, 1956-2006, edited by John Davey, introduced by Alan Moore, (UK: Savoy Books, 2010, ) 718 pp\n* London Peculiar and Other Nonfiction, Edited by Michael Moorcock and Allan Kausch, introduced by Iain Sinclair, (US: PM Press, 2012, ), 377pp. Michael Moorcock. http://en.wikipedia.org/?curid=19358."
  }
}
