{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11432",
  "eid" : "fbafc690-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778502009,
  "textBody" : "The full moon is the lunar phase when the Moon appears fully illuminated from Earth's perspective. This occurs when Earth is located directly between the Sun and the Moon (more exactly, when the ecliptic longitudes of the Sun and Moon differ by 180°). This means that the lunar hemisphere facing Earth – the near side – is completely sunlit and appears as a circular disk, while the far side is dark. The full moon occurs once roughly every month.\n\nWhen the Moon moves into Earth's shadow, a lunar eclipse occurs, during which all or part of the Moon's face may appear reddish due to the Rayleigh scattering of blue wavelengths and the refraction of sunlight through Earth's atmosphere. Lunar eclipses happen only during full moon and around points on its orbit where the satellite may pass through the planet's shadow. A lunar eclipses does not occur every month because the Moon's orbit is inclined 5.14° to the ecliptic plane; thus, the Moon usually passes north or south of Earth's shadow, which is mostly restricted to this plane of reference. Lunar eclipses happen only when the full moon occurs around either node of its orbit (ascending or descending). Therefore, a lunar eclipse occurs approximately every 6 months and often 2 weeks before or after a solar eclipse, which occurs during new moon around the opposite node.\n\nThe interval period between a new or full moon and the next same phase, a synodic month, averages about 29.53 days. Therefore, in those lunar calendars in which each month begins on the day of the new moon, the full moon falls on either the 14th or 15th day of the lunar month. Because a calendar month consists of a whole number of days, a lunar month may be either 29 or 30 days long.\n\nCharacteristics\n\nA full moon is often thought of as an event of a full night's duration. This is somewhat misleading because its phase seen from Earth continuously waxes or wanes (though much too slowly to notice in real time with the naked eye). Its maximum illumination occurs at the moment waxing has stopped. For any given location, about half of these maximum full moons may be visible, while the other half occurs during the day, when the full moon is below the horizon.\n\nMany almanacs list full moons not only by date, but also by their exact time, usually in Coordinated Universal Time (UTC). Typical monthly calendars that include lunar phases may be offset by one day when used in a different time zone.\n\nFull moon is generally a suboptimal time to conduct astronomical observations because the bright sunlight reflected by the Moon then outshines the apparently dimmer stars.\n\nOn 12 December 2008, the full moon occurred closer to the Earth than it had been at any time for the previous 15 years, called a supermoon.\n\nOn 19 March 2011, another full supermoon occurred, closer to the Earth than at any time for the previous 18 years.\n\nOn 14 November 2016, a full supermoon occurred closer to the Earth than at any time for the previous 68 years.\n\nFormula \n\nThe date and approximate time of a specific full moon (assuming a circular orbit) can be calculated from the following equation:\n d = 20.362000+ 29.530588861 \\times N + 102.026 \\times 10^{-12} \\times N^2\nwhere d is the number of days since 1 January 2000 00:00:00 in the Terrestrial Time scale used in astronomical ephemerides; for Universal Time (UT) add the following approximate correction to d:\n-0.000739 - (235 \\times 10^{-12})\\times N^2 days\nwhere N is the number of full moons since the first full moon of 2000. The true time of a full moon may differ from this approximation by up to about 14.5 hours as a result of the non-circularity of the moon's orbit. See New moon for an explanation of the formula and its parameters.\n\nThe age and apparent size of the full moon vary in a cycle of just under 14 synodic months, which has been referred to as a full moon cycle.\n\nIn folklore and tradition\n\nFull moons are traditionally associated with temporal insomnia (inability to sleep), insanity (hence the terms lunacy and lunatic) and various \"magical phenomena\" such as lycanthropy. Psychologists, however, have found that there is no strong evidence for effects on human behavior around the time of a full moon. They find that studies are generally not consistent, with some showing a positive effect and others showing a negative effect. In one instance, the 23 December 2000 issue of the British Medical Journal published two studies on dog bite admission to hospitals in England and Australia. The study of the Bradford Royal Infirmary found that dog bites were twice as common during a full moon, whereas the study conducted by the public hospitals in Australia found that they were less likely.   All this is relevant to canine rather than human behavior.\n\nFull moon names\n\nHistorically, month names are names of moons (lunations, not necessarily full moons) in lunisolar calendars. Since the introduction of the solar Julian calendar in the Roman Empire, and later the Gregorian calendar worldwide, people no longer perceive month names as \"moon\" names. The traditional Old English month names were equated with the names of the Julian calendar from an early time (soon after Christianization, according to the testimony of Bede ca. AD 700).\n\nSome full moons have developed new names in modern times, e.g., the blue moon, and the names \"harvest moon\" and \"hunter's moon\" for the full moons of autumn.\n\nHarvest and hunter's moons\n\nThe \"harvest moon\" and \"hunter's moon\" are traditional terms for the full moons occurring during late summer and in the autumn, in the northern hemisphere usually in September and October respectively.\nThe \"harvest moon\" is the full moon closest to the autumnal equinox (22 or 23 September), coming anywhere from two weeks before to two weeks after that date. The \"hunter's moon\" is the full moon following it.\nThe names are recorded from the early 18th century.see James Ferguson, Astronomy explained upon Sir Isaac Newton's principles,: and made easy to those who have not studied mathematics, 1756, [https://books.google.com/books?idJi1cAAAAQAAJ&pg\nPA128#vonepage&q&f\nfalse p. 128].\n\"harvest moon\" is also the cognate of herbist-mānod, the Old High German name of November\nrecorded in Vita Karoli Magni, ch. 29.\nThe Oxford English Dictionary entry for \"harvest moon\" cites a 1706 reference, and for \"hunter's moon\" a 1710 edition of The British Apollo, where the term is attributed to \"the country people\" (The Country People call this the Hunters-Moon.) The names became traditional in American folklore, where they are now often popularly attributed to the Native Americans.\nThe Feast of the Hunters' Moon is a yearly festival in West Lafayette, Indiana, held in late September or early October each year since 1968.\n\nIn 2010, the Harvest moon occurred on the night of equinox itself (some 5 hours after the point of equinox) for the first time since 1991.\n\nAll full moons rise around the time of sunset. Because the moon moves eastward among the stars faster than the sun its meridian passage is delayed, causing it to rise later each day – on average by about 50.47 minutes.(1440/(29.531)=50.47 minutes) The harvest moon and hunter's moon are unique because the time difference between moonrises on successive evenings is much shorter than average. The moon rises approximately 30 minutes later from one night to the next, as seen from about 40 degrees N or S latitude. (This is because a full moon in September appears to move not straight east but north-east in the sky.) Thus, there is no long period of darkness between sunset and moonrise for several days following the actual date of the full moon. This gives a graph showing the effect as seen from Calgary, for the whole of the year 2007.\n\nFarmers' Almanacs\n\nThe Maine Farmers' Almanac from c. the 1930s began to publish Native American \"Indian\" full moon names. The Farmers' Almanac (since 1955 published in Maine, but not the same publication as the Maine Farmers' Almanac) continues to do so. (); \n\nAn early list of \"Indian month names\" was published in 1918 by Daniel Carter Beard in his The American Boy's Book of Signs, Signals and Symbols for use by the boy scouts. Beard's \"Indian\" month names were:Beard 1918, pp. 78–80. \"The Indians' Moons naturally vary in the different parts of the country, but by comparing them all and striking an average as near as may be, the moons are reduced to the following\"\n*January: Difficulty, Black Smoke\n*February: Raccoon, Bare Spots on the Ground\n*March: Wind, Little Grass, Sore-Eye\n*April: Ducks, Goose-Eggs\n*May: Green Grass, Root-Food\n*June: Corn-Planting, Strawberry\n*July: Buffalo (Bull), Hot Sun\n*August: Harvest, Cow Buffalo\n*September: Wild Rice, Red Plum\n*October: Leaf-Falling, Nuts\n*November: Deer-Mating, Fur-Pelts\n*December: Wolves, Big Moon\n\nSuch names have gained currency in American folklore. They appear in print more widely outside of the almanac tradition from the 1990s in popular publications about the Moon.\nMysteries of the Moon by Patricia Haddock (\"Great Mysteries Series\", Greenhaven Press, 1992) gave an extensive list of such names along with the individual tribal groups they were supposedly associated with.repeated in The Moon Book by Kim Long (1998:[https://books.google.com/books?ide6-ddrk3nxsC&pg\nPA102#vonepage&q&f\nfalse 102ff.]) Also in Llewellyn's 1996 Moon Sign Book (1995).\n Haddock supposes that certain \"Colonial American\" moon names were adopted from Algonquian languages (which were formerly spoken in the territory of New England), while others are based in European tradition (e.g., the Colonial American names for the May moon, \"Milk Moon\", \"Mother's Moon\", \"Hare Moon\" have no parallels in the supposed native names, while the name of November, \"Beaver Moon\" is supposedly based in the Algonquin).\n\nThe individual names given in Farmers' Almanac include:\n*January: \"Wolf Moon\" (this is the name of December in Beard 1918)\"Wolf Moon\" is attributed to the Algonquin by Haddock (1992); the actual Algonquin name for that moon is squochee kesos or \"sun has not strength to thaw\". [https://books.google.com/books?idwQcQAQAAMAAJ&lpg\nPA166&ots1aiqhDjivK&dq\nsquochee%20kesos&pgPA166#v\nonepage&q&f=false The New England historical & genealogical register and antiquarian journal: v. 10] The Sioux do mention wolves in their name for January, which means \"when wolves run together\". [http://www.wwu.edu/depts/skywise/indianmoons.html American Indian Moons]; they also refer to that moon as the \"moon of the strong cold\" or \"frost in the teepee\". Other tribes had different names for the moons. See also [http://americanindian.net/moons.html Indian Moons, Days & Other Calendar Stuff American Indian Moons] also \"Old Moon\"\n*February: \"Snow Moon\", also \"Hunger Moon\"\n*March: \"Worm Moon\", \"Crow Moon\", \"Sap Moon\", \"Lenten Moon\"\n*April: \"Seed Moon\", \"Pink Moon\", \"Sprouting Grass Moon\", \"Egg Moon\" (c.f. \"Goose-Egg\" in Beard 1918), \"Fish Moon\"\n*May: \"Milk Moon\", \"Flower Moon\", \"Corn Planting Moon\"\n*June: \"Mead Moon\", \"Strawberry Moon\" (c.f. Beard 1918), \"Rose Moon\", \"Thunder Moon\"\n*July: \"Hay Moon\", \"Buck Moon\", \"Elk Moon\", \"Thunder Moon\"\n*August: \"Corn Moon\", \"Sturgeon Moon\", \"Red Moon\", \"Green Corn Moon\", \"Grain Moon\"\n*September: \"Harvest Moon\", \"Full Corn Moon\",\n*October: \"Hunter's moon\", \"Blood Moon\"/\"Sanguine Moon\"\n*November: \"Beaver Moon\", \"Frosty Moon\"\n*December: \"Oak Moon\", \"Cold Moon\", \"Long Night's Moon\"\nThe Long Night's Moon is the last of the year and the closest to the winter solstice.[http://www.baltimoresun.com/news/weather/weather-blog/bal-wx-long-nights-moon-comes-on-christmas-for-first-time-since-1977-20151222-story.html Dance, Scott. \"'Long Night's Moon' comes on Christmas for first time since 1977,\" The Baltimore Sun, Wednesday, December 23, 2015.]\n\n\"Ice moon\" is also used to refer to the first full moon of January or Februaryhttps://www.timeanddate.com/astronomy/moon/wolf.html.\n\nHindu full moon festivals\n\nIn Hinduism, most festivals are celebrated on auspicious days. Many of the Hindu festivals are celebrated on days with a full moon at night.\nDifferent parts of India celebrate the same day with different names, as listed below:\n#Chaitra Purnima - Gudi Padua, Yugadi, Ugadi, Hanuman Jayanti (April 15, 2014)http://www.drikpanchang.com/purnima/chaitra/chaitra-purnima-date-time.html?year=2014\n#Vaishakh Purnima - Narasimh Jayanti, Buddha Jayanthi (May 14, 2014)http://www.drikpanchang.com/purnima/vaishakha/vaishakha-purnima-date-time.html?year=2014\n#Jyeshtha Purnima - Vat Savitri Vrat Vat Purnima (June 8, 2014)http://www.drikpanchang.com/festivals/guru-purnima/guru-purnima-date-time.html?year\n2014\n#Guru Purnima - the full moon of the Ashadh month\n#Vyas Purnima - important day for starting education and honoring teachers\n#Shravan Purnima -  good day for starting Upanayan day, Avani Avittam, Raksha Bandhan- conceptually Onam also comes on this day.\n#Bhadrapad Purnima - start of Pitrupaksha, Madhu Purnima\n#Ashvin Purnima - Sharad Purnima\n#Kartik Poornima - Thrukkarthika\n#Margasirsha Purnima - Thiruvathira, Dathatreya Jayanthi \n#Pushya Purnima - Thaipusam, Shakambharee Purnima\n#Magha Purnima\n#Phalguna Purnima - Holi\n\nLunar and lunisolar calendars\n\nMost pre-modern calendars the world over were lunisolar, combining the solar year with the lunation by means of intercalary months.see e.g., \nThe Julian calendar abandoned this method in favour of a purely solar reckoning while conversely the 7th-century Islamic calendar opted for a purely lunar one.\n\nA continuing lunisolar calendar is in the Hebrew calendar. Evidence of this is noted in the dates of Passover and Easter in Judaism and Christianity, respectively. The date of the Jewish Rosh Hashana and Sukkot festivals along with all other Jewish holidays are dependent on the dates of the new moons.Leviticus 23:4-7, 33-35.\n\nIntercalary months\n\nIn lunisolar calendars, an intercalary month occurs seven times in the 19 years of the Metonic cycle, or on average every 2.7 years (19/7). In the Hebrew Calendar this is noted with a periodic extra month of Adar in the early spring.\n\nBlue moon\n\nIn the modern system of \"traditional\" full moon names tied to the solstice and equinox points, a supernumerary full moon in such a period is called a blue moon. The term \"blue moon\" used in this sense may date to as early as the 16th century, but it became well known in the United States due to the Farmers' Almanac (published since 1818).\nThe saying \"once in a blue moon\" meaning \"very rarely\" is recorded since the 1820s.\nThe term \"blue moon\" is recorded in 1528, in the couplet O churche men are wyly foxes [...] Yf they say the mone is blewe / We must beleve that it is true / Admittynge their interpretacion. (Thomas Wolsey, Rede me and be nott wrothe, for I say no thynge but trothe ed. 1871 [https://archive.org/stream/redemeandbenottw00roywuoft#page/n121/mode/2up p. 114]); it isn't clear however if this refers to intercalation.\n\nAccording to the Farmers' Almanac, a \"blue moon\" is the third full moon in any period between either solstice and equinox, or between equinox and solstice, (calculated using the mean tropical year), which contains four full moons.Farmers' Almanac, \"What is a blue moon?\", 24 August 2009, available at [http://farmersalmanac.com/astronomy/2009/08/24/what-is-a-blue-moon]. These seasons are equal in length, unlike the astronomical ones, which vary in length depending on the Earth's speed in its elliptical orbit round the sun.   To compare, in 1983 the equal length seasons began at 1.48 AM on 23 March, 9.15 AM on 22 June, 4.42 PM on 21 September and 12.10 AM on 22 December, while the astronomical seasons began at 4.39 AM on 21 March, 11.09 PM on 21 June, 2.42 PM on 23 September and 10.30 AM on 22 December (all times GMT).   Due to a misinterpretation of this definition in the March 1946 Sky & Telescope magazine, \"blue moon\" has also been used in the sense of \"the second full moon in any month which contains two full moons (this usage has been noted as \"erroneous\" by Sky & Telescope in 1999).[http://www.skyandtelescope.com/observing/objects/moon/3304131.html Sky and Telescope \"What's a blue moon?\"]\nAccording to either definition, \"blue moons\" occur with the average frequency of intercalary months, seven times in 19 years, the Farmers' Almanac system of \"full moon names\" effectively defining a lunisolar calendar.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Full moon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11432" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The full moon is the lunar phase when the Moon appears fully illuminated from Earth's perspective. This occurs when Earth is located directly between the Sun and the Moon (more exactly, when the ecliptic longitudes of the Sun and Moon differ by 180°). This means that the lunar hemisphere facing Earth – the near side – is completely sunlit and appears as a circular disk, while the far side is dark. The full moon occurs once roughly every month.\n\nWhen the Moon moves into Earth's shadow, a lunar eclipse occurs, during which all or part of the Moon's face may appear reddish due to the Rayleigh scattering of blue wavelengths and the refraction of sunlight through Earth's atmosphere. Lunar eclipses happen only during full moon and around points on its orbit where the satellite may pass through the planet's shadow. A lunar eclipses does not occur every month because the Moon's orbit is inclined 5.14° to the ecliptic plane; thus, the Moon usually passes north or south of Earth's shadow, which is mostly restricted to this plane of reference. Lunar eclipses happen only when the full moon occurs around either node of its orbit (ascending or descending). Therefore, a lunar eclipse occurs approximately every 6 months and often 2 weeks before or after a solar eclipse, which occurs during new moon around the opposite node.\n\nThe interval period between a new or full moon and the next same phase, a synodic month, averages about 29.53 days. Therefore, in those lunar calendars in which each month begins on the day of the new moon, the full moon falls on either the 14th or 15th day of the lunar month. Because a calendar month consists of a whole number of days, a lunar month may be either 29 or 30 days long.\n\nCharacteristics\n\nA full moon is often thought of as an event of a full night's duration. This is somewhat misleading because its phase seen from Earth continuously waxes or wanes (though much too slowly to notice in real time with the naked eye). Its maximum illumination occurs at the moment waxing has stopped. For any given location, about half of these maximum full moons may be visible, while the other half occurs during the day, when the full moon is below the horizon.\n\nMany almanacs list full moons not only by date, but also by their exact time, usually in Coordinated Universal Time (UTC). Typical monthly calendars that include lunar phases may be offset by one day when used in a different time zone.\n\nFull moon is generally a suboptimal time to conduct astronomical observations because the bright sunlight reflected by the Moon then outshines the apparently dimmer stars.\n\nOn 12 December 2008, the full moon occurred closer to the Earth than it had been at any time for the previous 15 years, called a supermoon.\n\nOn 19 March 2011, another full supermoon occurred, closer to the Earth than at any time for the previous 18 years.\n\nOn 14 November 2016, a full supermoon occurred closer to the Earth than at any time for the previous 68 years.\n\nFormula \n\nThe date and approximate time of a specific full moon (assuming a circular orbit) can be calculated from the following equation:\n d = 20.362000+ 29.530588861 \\times N + 102.026 \\times 10^{-12} \\times N^2\nwhere d is the number of days since 1 January 2000 00:00:00 in the Terrestrial Time scale used in astronomical ephemerides; for Universal Time (UT) add the following approximate correction to d:\n-0.000739 - (235 \\times 10^{-12})\\times N^2 days\nwhere N is the number of full moons since the first full moon of 2000. The true time of a full moon may differ from this approximation by up to about 14.5 hours as a result of the non-circularity of the moon's orbit. See New moon for an explanation of the formula and its parameters.\n\nThe age and apparent size of the full moon vary in a cycle of just under 14 synodic months, which has been referred to as a full moon cycle.\n\nIn folklore and tradition\n\nFull moons are traditionally associated with temporal insomnia (inability to sleep), insanity (hence the terms lunacy and lunatic) and various \"magical phenomena\" such as lycanthropy. Psychologists, however, have found that there is no strong evidence for effects on human behavior around the time of a full moon. They find that studies are generally not consistent, with some showing a positive effect and others showing a negative effect. In one instance, the 23 December 2000 issue of the British Medical Journal published two studies on dog bite admission to hospitals in England and Australia. The study of the Bradford Royal Infirmary found that dog bites were twice as common during a full moon, whereas the study conducted by the public hospitals in Australia found that they were less likely.   All this is relevant to canine rather than human behavior.\n\nFull moon names\n\nHistorically, month names are names of moons (lunations, not necessarily full moons) in lunisolar calendars. Since the introduction of the solar Julian calendar in the Roman Empire, and later the Gregorian calendar worldwide, people no longer perceive month names as \"moon\" names. The traditional Old English month names were equated with the names of the Julian calendar from an early time (soon after Christianization, according to the testimony of Bede ca. AD 700).\n\nSome full moons have developed new names in modern times, e.g., the blue moon, and the names \"harvest moon\" and \"hunter's moon\" for the full moons of autumn.\n\nHarvest and hunter's moons\n\nThe \"harvest moon\" and \"hunter's moon\" are traditional terms for the full moons occurring during late summer and in the autumn, in the northern hemisphere usually in September and October respectively.\nThe \"harvest moon\" is the full moon closest to the autumnal equinox (22 or 23 September), coming anywhere from two weeks before to two weeks after that date. The \"hunter's moon\" is the full moon following it.\nThe names are recorded from the early 18th century.see James Ferguson, Astronomy explained upon Sir Isaac Newton's principles,: and made easy to those who have not studied mathematics, 1756, [https://books.google.com/books?idJi1cAAAAQAAJ&pg\nPA128#vonepage&q&f\nfalse p. 128].\n\"harvest moon\" is also the cognate of herbist-mānod, the Old High German name of November\nrecorded in Vita Karoli Magni, ch. 29.\nThe Oxford English Dictionary entry for \"harvest moon\" cites a 1706 reference, and for \"hunter's moon\" a 1710 edition of The British Apollo, where the term is attributed to \"the country people\" (The Country People call this the Hunters-Moon.) The names became traditional in American folklore, where they are now often popularly attributed to the Native Americans.\nThe Feast of the Hunters' Moon is a yearly festival in West Lafayette, Indiana, held in late September or early October each year since 1968.\n\nIn 2010, the Harvest moon occurred on the night of equinox itself (some 5 hours after the point of equinox) for the first time since 1991.\n\nAll full moons rise around the time of sunset. Because the moon moves eastward among the stars faster than the sun its meridian passage is delayed, causing it to rise later each day – on average by about 50.47 minutes.(1440/(29.531)=50.47 minutes) The harvest moon and hunter's moon are unique because the time difference between moonrises on successive evenings is much shorter than average. The moon rises approximately 30 minutes later from one night to the next, as seen from about 40 degrees N or S latitude. (This is because a full moon in September appears to move not straight east but north-east in the sky.) Thus, there is no long period of darkness between sunset and moonrise for several days following the actual date of the full moon. This gives a graph showing the effect as seen from Calgary, for the whole of the year 2007.\n\nFarmers' Almanacs\n\nThe Maine Farmers' Almanac from c. the 1930s began to publish Native American \"Indian\" full moon names. The Farmers' Almanac (since 1955 published in Maine, but not the same publication as the Maine Farmers' Almanac) continues to do so. (); \n\nAn early list of \"Indian month names\" was published in 1918 by Daniel Carter Beard in his The American Boy's Book of Signs, Signals and Symbols for use by the boy scouts. Beard's \"Indian\" month names were:Beard 1918, pp. 78–80. \"The Indians' Moons naturally vary in the different parts of the country, but by comparing them all and striking an average as near as may be, the moons are reduced to the following\"\n*January: Difficulty, Black Smoke\n*February: Raccoon, Bare Spots on the Ground\n*March: Wind, Little Grass, Sore-Eye\n*April: Ducks, Goose-Eggs\n*May: Green Grass, Root-Food\n*June: Corn-Planting, Strawberry\n*July: Buffalo (Bull), Hot Sun\n*August: Harvest, Cow Buffalo\n*September: Wild Rice, Red Plum\n*October: Leaf-Falling, Nuts\n*November: Deer-Mating, Fur-Pelts\n*December: Wolves, Big Moon\n\nSuch names have gained currency in American folklore. They appear in print more widely outside of the almanac tradition from the 1990s in popular publications about the Moon.\nMysteries of the Moon by Patricia Haddock (\"Great Mysteries Series\", Greenhaven Press, 1992) gave an extensive list of such names along with the individual tribal groups they were supposedly associated with.repeated in The Moon Book by Kim Long (1998:[https://books.google.com/books?ide6-ddrk3nxsC&pg\nPA102#vonepage&q&f\nfalse 102ff.]) Also in Llewellyn's 1996 Moon Sign Book (1995).\n Haddock supposes that certain \"Colonial American\" moon names were adopted from Algonquian languages (which were formerly spoken in the territory of New England), while others are based in European tradition (e.g., the Colonial American names for the May moon, \"Milk Moon\", \"Mother's Moon\", \"Hare Moon\" have no parallels in the supposed native names, while the name of November, \"Beaver Moon\" is supposedly based in the Algonquin).\n\nThe individual names given in Farmers' Almanac include:\n*January: \"Wolf Moon\" (this is the name of December in Beard 1918)\"Wolf Moon\" is attributed to the Algonquin by Haddock (1992); the actual Algonquin name for that moon is squochee kesos or \"sun has not strength to thaw\". [https://books.google.com/books?idwQcQAQAAMAAJ&lpg\nPA166&ots1aiqhDjivK&dq\nsquochee%20kesos&pgPA166#v\nonepage&q&f=false The New England historical & genealogical register and antiquarian journal: v. 10] The Sioux do mention wolves in their name for January, which means \"when wolves run together\". [http://www.wwu.edu/depts/skywise/indianmoons.html American Indian Moons]; they also refer to that moon as the \"moon of the strong cold\" or \"frost in the teepee\". Other tribes had different names for the moons. See also [http://americanindian.net/moons.html Indian Moons, Days & Other Calendar Stuff American Indian Moons] also \"Old Moon\"\n*February: \"Snow Moon\", also \"Hunger Moon\"\n*March: \"Worm Moon\", \"Crow Moon\", \"Sap Moon\", \"Lenten Moon\"\n*April: \"Seed Moon\", \"Pink Moon\", \"Sprouting Grass Moon\", \"Egg Moon\" (c.f. \"Goose-Egg\" in Beard 1918), \"Fish Moon\"\n*May: \"Milk Moon\", \"Flower Moon\", \"Corn Planting Moon\"\n*June: \"Mead Moon\", \"Strawberry Moon\" (c.f. Beard 1918), \"Rose Moon\", \"Thunder Moon\"\n*July: \"Hay Moon\", \"Buck Moon\", \"Elk Moon\", \"Thunder Moon\"\n*August: \"Corn Moon\", \"Sturgeon Moon\", \"Red Moon\", \"Green Corn Moon\", \"Grain Moon\"\n*September: \"Harvest Moon\", \"Full Corn Moon\",\n*October: \"Hunter's moon\", \"Blood Moon\"/\"Sanguine Moon\"\n*November: \"Beaver Moon\", \"Frosty Moon\"\n*December: \"Oak Moon\", \"Cold Moon\", \"Long Night's Moon\"\nThe Long Night's Moon is the last of the year and the closest to the winter solstice.[http://www.baltimoresun.com/news/weather/weather-blog/bal-wx-long-nights-moon-comes-on-christmas-for-first-time-since-1977-20151222-story.html Dance, Scott. \"'Long Night's Moon' comes on Christmas for first time since 1977,\" The Baltimore Sun, Wednesday, December 23, 2015.]\n\n\"Ice moon\" is also used to refer to the first full moon of January or Februaryhttps://www.timeanddate.com/astronomy/moon/wolf.html.\n\nHindu full moon festivals\n\nIn Hinduism, most festivals are celebrated on auspicious days. Many of the Hindu festivals are celebrated on days with a full moon at night.\nDifferent parts of India celebrate the same day with different names, as listed below:\n#Chaitra Purnima - Gudi Padua, Yugadi, Ugadi, Hanuman Jayanti (April 15, 2014)http://www.drikpanchang.com/purnima/chaitra/chaitra-purnima-date-time.html?year=2014\n#Vaishakh Purnima - Narasimh Jayanti, Buddha Jayanthi (May 14, 2014)http://www.drikpanchang.com/purnima/vaishakha/vaishakha-purnima-date-time.html?year=2014\n#Jyeshtha Purnima - Vat Savitri Vrat Vat Purnima (June 8, 2014)http://www.drikpanchang.com/festivals/guru-purnima/guru-purnima-date-time.html?year\n2014\n#Guru Purnima - the full moon of the Ashadh month\n#Vyas Purnima - important day for starting education and honoring teachers\n#Shravan Purnima -  good day for starting Upanayan day, Avani Avittam, Raksha Bandhan- conceptually Onam also comes on this day.\n#Bhadrapad Purnima - start of Pitrupaksha, Madhu Purnima\n#Ashvin Purnima - Sharad Purnima\n#Kartik Poornima - Thrukkarthika\n#Margasirsha Purnima - Thiruvathira, Dathatreya Jayanthi \n#Pushya Purnima - Thaipusam, Shakambharee Purnima\n#Magha Purnima\n#Phalguna Purnima - Holi\n\nLunar and lunisolar calendars\n\nMost pre-modern calendars the world over were lunisolar, combining the solar year with the lunation by means of intercalary months.see e.g., \nThe Julian calendar abandoned this method in favour of a purely solar reckoning while conversely the 7th-century Islamic calendar opted for a purely lunar one.\n\nA continuing lunisolar calendar is in the Hebrew calendar. Evidence of this is noted in the dates of Passover and Easter in Judaism and Christianity, respectively. The date of the Jewish Rosh Hashana and Sukkot festivals along with all other Jewish holidays are dependent on the dates of the new moons.Leviticus 23:4-7, 33-35.\n\nIntercalary months\n\nIn lunisolar calendars, an intercalary month occurs seven times in the 19 years of the Metonic cycle, or on average every 2.7 years (19/7). In the Hebrew Calendar this is noted with a periodic extra month of Adar in the early spring.\n\nBlue moon\n\nIn the modern system of \"traditional\" full moon names tied to the solstice and equinox points, a supernumerary full moon in such a period is called a blue moon. The term \"blue moon\" used in this sense may date to as early as the 16th century, but it became well known in the United States due to the Farmers' Almanac (published since 1818).\nThe saying \"once in a blue moon\" meaning \"very rarely\" is recorded since the 1820s.\nThe term \"blue moon\" is recorded in 1528, in the couplet O churche men are wyly foxes [...] Yf they say the mone is blewe / We must beleve that it is true / Admittynge their interpretacion. (Thomas Wolsey, Rede me and be nott wrothe, for I say no thynge but trothe ed. 1871 [https://archive.org/stream/redemeandbenottw00roywuoft#page/n121/mode/2up p. 114]); it isn't clear however if this refers to intercalation.\n\nAccording to the Farmers' Almanac, a \"blue moon\" is the third full moon in any period between either solstice and equinox, or between equinox and solstice, (calculated using the mean tropical year), which contains four full moons.Farmers' Almanac, \"What is a blue moon?\", 24 August 2009, available at [http://farmersalmanac.com/astronomy/2009/08/24/what-is-a-blue-moon]. These seasons are equal in length, unlike the astronomical ones, which vary in length depending on the Earth's speed in its elliptical orbit round the sun.   To compare, in 1983 the equal length seasons began at 1.48 AM on 23 March, 9.15 AM on 22 June, 4.42 PM on 21 September and 12.10 AM on 22 December, while the astronomical seasons began at 4.39 AM on 21 March, 11.09 PM on 21 June, 2.42 PM on 23 September and 10.30 AM on 22 December (all times GMT).   Due to a misinterpretation of this definition in the March 1946 Sky & Telescope magazine, \"blue moon\" has also been used in the sense of \"the second full moon in any month which contains two full moons (this usage has been noted as \"erroneous\" by Sky & Telescope in 1999).[http://www.skyandtelescope.com/observing/objects/moon/3304131.html Sky and Telescope \"What's a blue moon?\"]\nAccording to either definition, \"blue moons\" occur with the average frequency of intercalary months, seven times in 19 years, the Farmers' Almanac system of \"full moon names\" effectively defining a lunisolar calendar. Full moon. http://en.wikipedia.org/?curid=11432."
  }
}
