{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12938",
  "eid" : "05866430-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778518515,
  "textBody" : "The Greyhound is a breed of dog; a sighthound which has been bred for coursing game and Greyhound racing. Since the rise in large-scale adoption of retired racing Greyhounds, the breed has seen a resurgence in popularity as a family pet.\n\nAccording to Merriam-Webster, a Greyhound is \"any of a breed of tall slender graceful smooth-coated dogs characterized by swiftness and keen sight\", as well as \"any of several related dogs,\" such as the Italian Greyhound.\n\nIt is a gentle and intelligent breed whose combination of long, powerful legs, deep chest, flexible spine and slim build allows it to reach average race speeds exceeding 64 km/h. The Greyhound can reach a full speed of 70 km/h within 30 m, or six strides from the boxes, traveling at almost 20 m/s for the first 250 m of a race.Sharp, N.C. Craig. Animal athletes: a performance review. Veterinary Record Vol 171 (4) 87-94 2012\n\nAppearance \n\nMales are usually 71 to tall at the withers, and weigh on average 27 to. Females tend to be smaller, with shoulder heights ranging from 68 to and weights from less than 27 to. Greyhounds have very short fur, which is easy to maintain. There are approximately thirty recognized color forms, of which variations of white, brindle, fawn, black, red and blue (gray) can appear uniquely or in combination. Greyhounds are dolichocephalic, with a skull which is relatively long in comparison to its breadth, and an elongated muzzle.\n\nTemperament \n\nGreyhounds can be aloof and indifferent to strangers, but are affectionate with their own pack. They are generally docile, lazy, easy-going, and calm.\n\nGreyhounds wear muzzles during racing, which can lead some to believe they are aggressive dogs, but this is not true. Muzzles are worn to prevent injuries resulting from dogs nipping one another during or immediately after a race, when the 'hare' has disappeared out of sight and the dogs are no longer racing but remain excited. \n\nContrary to popular belief, adult Greyhounds do not need extended periods of daily exercise, as they are bred for sprinting rather than endurance. Greyhound puppies that have not been taught how to utilize their energy, however, can be hyperactive and destructive if not given an outlet, and therefore require more experienced handlers.\"[https://web.archive.org/web/20100301120349/http://friendsofgreyhounds.org/faq.html Greyhound Rescue and Greyhound Adoption in South Florida FAQ]\". Friends of Greyhounds. Accessed Nov 5, 2014\n\nPets \n\nGreyhound owners and adoption groups consider Greyhounds wonderful pets. Greyhounds are quiet, gentle and loyal to owners. They are very loving, and enjoy the company of their humans and other dogs. Whether a Greyhound will enjoy the company of other small animals, such as cats, depends on the individual dog's personality. Greyhounds will typically chase small animals; those lacking a high 'prey drive' will be able to coexist happily with toy dog breeds and/or cats. Many owners describe their Greyhounds as \"45-mile-per-hour couch potatoes\".\n\nGreyhounds live most happily as pets in quiet environments.Livinggood, Lee (2000). Retired Racing Greyhounds for Dummies, p. 31. IDG Books Worldwide, Inc., Foster City, CA.  They do well in families with children, as long as the children are taught to treat the dog properly with politeness and appropriate respect.Livinggood 2000, p. 55-56 Greyhounds have a sensitive nature, and gentle commands work best as training methods.Livinggood, Lee (2000). Retired Racing Greyhounds for Dummies. IDG Books Worldwide, Inc., Foster City, CA. \n\nOccasionally, a Greyhound may bark; however, Greyhounds are generally not barkers, which is beneficial in suburban environments, and are usually as friendly to strangers as they are with their own families.Branigan, Cynthia A. (1998). Adopting the Racing Greyhound, p. 17-18. Howell Book House, New York. .\n\nA very common misconception regarding Greyhounds is that they are hyperactive. This is usually not the case with retired racing Greyhounds.\"The Greyhound Adoption Program (GAP) in Australia and New Zealand: A survey of owners' experiences with their greyhounds one month after adoption\" Applied Animal Behaviour Science Elliott, 2010 vol:124 iss:3-4 pg:121 -135. Greyhounds can live comfortably as apartment dogs, as they do not require much space and sleep almost 18 hours per day. Due to their calm temperament, Greyhounds can make better \"apartment dogs\" than smaller, more active breeds.\n\nAt most race tracks, Greyhounds are housed in crates. Most such animals know nothing other than being in a crate for the majority of the day. Therefore, crate training a retired Greyhound in a home is generally easy.\n\nMany Greyhound adoption groups recommend that owners keep their Greyhounds on a leash whenever outdoors, except in fully enclosed areas.\"[http://www.gapnsw.org.au/content/view/10/29/ Greyhound Adoption Program – Is a Greyhound Right for You?]\"[https://web.archive.org/web/20090318021547/http://www.adopt-a-greyhound.org/advice/offlead.html How Safe is an Off-Lead Run?], Adopt a Greyhound  This is due to their prey-drive, their speed, and the assertion that Greyhounds have no road sense. In some jurisdictions, it is illegal for Greyhounds to be allowed off-lead even in off-lead dog parks. Due to their size and strength, adoption groups recommend that fences be between 4 and 6 feet tall, to prevent Greyhounds from jumping over them.\n\nAbilities \n\nCoursing \n\nThe original primary use of Greyhounds, both in the British Isles and on the Continent of Europe, was in the coursing of deer. Later, they specialized in competition hare coursing.see p.246 Turbervile: A short observation … concerning coursing https://archive.org/details/turbervilesbooke00turb Some Greyhounds are still used for coursing, although artificial lure sports like lure coursing and racing are far more common and popular. Many leading 300- to 550-yard sprinters have bloodlines traceable back through Irish sires, within a few generations of racers that won events such as the Irish Coursing Derby or the Irish Cup.Irish Greyhound Stud Book\n\nRacing \n\nUntil the early twentieth century, Greyhounds were principally bred and trained for hunting and coursing. During the 1920s, modern greyhound racing was introduced into the United States and England (Belle Vue Stadium, Manchester, July 1926), as well as Northern Ireland (Celtic Park (Belfast), April 1927) and the Republic of Ireland (Shelbourne Park, Dublin). \n\nAustralia also has a significant racing culture. However, the 2015 live baiting scandal and adverse media coverage led to a Special Commission of Inquiry into the Greyhound Racing Industry in NSW. On 7 July 2016, New South Wales Premier Mike Baird announced that greyhound racing was to be banned in the state from 1 July 2017 after the inquiry found evidence of systemic animal cruelty, including mass greyhound killings and live baiting,Greyhound Racing Regulation 2016, available at: http://www.legislation.nsw.gov.au/regulations/2016-436.pdf  however the plan for the ban was later reversed before it was implemented. After the NSW announcement to ban racing,  Australian Capital Territory (ACT) Chief Minister Andrew Barr stated that greyhound racing would be banned in the ACT.\n\nAside from professional racing, many Greyhounds enjoy success on the amateur race track. Organizations like the Large Gazehound Racing Association (LGRA) and the National Oval Track Racing Association (NOTRA) provide opportunities for Greyhounds and other sighthound breeds to compete in amateur racing events all over the United States.\n\nCompanion \n\nHistorically, the Greyhound has, since its first appearance as a hunting type and breed, enjoyed a specific degree of fame and definition in Western literature, heraldry and art as the most elegant or noble companion and hunter of the canine world. In modern times, the professional racing industry, with its large numbers of track-bred Greyhounds, as well as international adoption programs aimed at rescuing and re-homing dogs that were at a surplus to the industry. They have redefined the breed in their almost mutually dependent pursuit of its welfare- as a sporting dog that will supply friendly companionship in its retirement.Madden, Raymond (2010) 'Imagining the greyhound: 'Racing' and 'rescue' narratives in a human and dog relationship', Continuum, 24: 4, 503 — 515 . Outside the racing industry and coursing community, the Kennel Clubs' registered breed still enjoys a modest following as a show dog and pet. There is an emerging pattern visible in recent years (2009–2010) of a significant decline in track betting and multiple track closures in the US, which will have consequences for the origin of future companion Greyhounds and the re-homing of current ex-racers.Flaim, Denise (2010) 'Forward Thinking', Sighthound Review, Vol 1 Issue 1.\n\nHealth and physiology \n\nGreyhounds are typically a healthy and long-lived breed, and hereditary illness is rare. Some Greyhounds have been known to develop esophageal achalasia, gastric dilatation volvulus (also known as bloat), and osteosarcoma. If exposed to E. coli, they may develop Alabama rot. Because the Greyhound's lean physique makes it ill-suited to sleeping on hard surfaces, owners of both racing and companion Greyhounds generally provide soft bedding; without bedding, Greyhounds are prone to develop painful skin sores. The average lifespan of a Greyhound is 9 to 11 years. \"n88 median\n10.8 IQR=8.1-12.0\"\n\nDue to the Greyhound's unique physiology and anatomy, a veterinarian who understands the issues relevant to the breed is generally needed when the dogs need treatment, particularly when anesthesia is required. Greyhounds cannot metabolize barbiturate-based anesthesia in the same way that other breeds can because their livers have lower amounts of oxidative enzymes.Blythe, Linda, Gannon, James, Craig, A. Morrie, and Fegan, Desmond P. (2007). Care of the Racing and Retired Greyhound, p. 416. American Greyhound Council, Inc., Kansas. .  Greyhounds demonstrate unusual blood chemistry [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3816276/], which can be misread by veterinarians not familiar with the breed and can result in an incorrect diagnosis.[https://www.riversideanimalcare.com/about-us/your-dublin-vet/c-guillermo-couto-dvm-diplomate-acvim-columbus-ohio-veterinarian/greyhounds-really-dogs/Couto Veterinary Consultants Are Sighthounds Really Dogs?], 2017\n\nGreyhounds are very sensitive to insecticides.Branigan, Cynthia A. (1998). Adopting the Racing Greyhound, p. 99-101. Howell Book House, New York. . Many vets do not recommend the use of flea collars or flea spray on Greyhounds if the product is a pyrethrin-based. Products like Advantage, Frontline, Lufenuron, and Amitraz are safe for use on Greyhounds, however, and are very effective in controlling fleas and ticks.Branigan, Cynthia A. (1998). Adopting the Racing Greyhound, p. 101-103. Howell Book House, New York. .\n\nGreyhounds have higher levels of red blood cells than other breeds. Since red blood cells carry oxygen to the muscles, this higher level allows the hound to move larger quantities of oxygen faster from the lungs to the muscles.Blythe, Linda, Gannon, James, Craig, A. Morrie, and Fegan, Desmond P. (2007). Care of the Racing and Retired Greyhound, p. 82. American Greyhound Council, Inc., Kansas. . Conversely, Greyhounds have lower levels of platelets than other breeds. Veterinary blood services often use Greyhounds as universal blood donors.[http://www.unitedbloodservices.org/llcoverside.html United Blood Services] article about Greyhounds as blood donors.\n\nGreyhounds do not have undercoats and thus are less likely to trigger dog allergies in humans (they are sometimes incorrectly referred to as \"hypoallergenic\"). The lack of an undercoat, coupled with a general lack of body fat, also makes Greyhounds more susceptible to extreme temperatures (both hot and cold); because of this, they must be housed inside.Blythe, Linda, Gannon, James, Craig, A. Morrie, and Fegan, Desmond P. (2007). Care of the Racing and Retired Greyhound, p. 394. American Greyhound Council, Kansas. .\n\nThe key to the speed of a Greyhound can be found in its light but muscular build, large heart, highest percentage of fast-twitch muscle of any breed,Snow, D.H. and Harris R.C. \"Thoroughbreds and Greyhounds: Biochemical Adaptations in Creatures of Nature and of Man\" Circulation, Respiration, and Metabolism Berlin: Springer Verlag 1985Snow, D.H. \"The horse and dog, elite athletes – why and how?\" Proceedings of the Nutrition Society 44 267 1985 double suspension gallop, and extreme flexibility of its spine. \"Double suspension rotary gallop\" describes the fastest running gait of the Greyhound in which all four feet are free from the ground in two phases, contracted and extended, during each full stride.Curtis M Brown. Dog Locomotion and Gait Analysis. Wheat Ridge, Colorado: Hoflin 1986 \n\nHistory \n\nThe breed's origin has in popular literature often been romantically connected to Ancient Egypt, in which it is believed \"that the breed dates back about 4,000 years;\" a belief for which there is no scientific evidence. While similar in appearance to Saluki (Persian Greyhound) or Sloughi (tombs at Beni Hassan c. 2000 BC), analyses of DNA reported in 2004 suggest that the Greyhound may not be closely related to these breeds, but is a close relative of herding dogs.Mark Derr (May 21, 2004). \"[https://www.nytimes.com/2004/05/21/science/21dog.html Collie or Pug? Study Finds the Genetic Code]\". The New York Times. Historical literature on the first sighthound in Europe (Arrian), the vertragus, probable antecedent of the Greyhound, suggests that its origin lies with the ancient Celts from Eastern Europe or Eurasia. Greyhound-type dogs of small, medium, and large size, appear to have been bred across Europe since that time. All modern, pure-bred pedigree Greyhounds derive from the Greyhound stock recorded and registered first in private studbooks in the 18th century, then in public studbooks in the 19th century, which ultimately were registered with coursing, racing, and kennel club authorities of the United Kingdom.\n\nHistorically, these sighthounds were used primarily for hunting in the open where their keen eyesight was valuable. It is believed that they (or at least similarly named dogs) were introduced to the British Isles in the 5th and 6th century BC from Celtic mainland Europe, although the Picts and other peoples of the northern British Isles (modern Scotland) were believed to have had large hounds similar to that of the deerhound before the 6th century BC.\n\nThe name \"Greyhound\" is generally believed to come from the Old English grighund. \"Hund\" is the antecedent of the modern \"hound\", but the meaning of \"grig\" is undetermined, other than in reference to dogs in Old English and Old Norse. Its origin does not appear to have any common root with the modern word \"grey\" for color, and indeed the Greyhound is seen with a wide variety of coat colors. The lighter colors, patch-like markings and white appeared in the breed that was once ordinarily grey in color. The Greyhound is the only dog mentioned by name in the Bible; many versions, including the King James version, name the Greyhound as one of the \"four things stately\" in the Proverbs.Proverbs 30:29–31 King James version. However, some newer biblical translations, including The New International Version, have changed this to strutting rooster, which appears to be an alternative translation of the Hebrew term mothen zarzir. However, the Douay–Rheims Bible translation from the late 4th-century Latin Vulgate into English translates this term as \"a cock.\"\n\nAccording to PokornyPokorny, Indogermanisches Woerterbuch, pp. 441–442. the English name \"Greyhound\" does not mean \"grey dog/hound\", but simply \"fair dog\". Subsequent words have been derived from the Proto-Indo-European root *g'her- \"shine, twinkle\": English grey, Old High German gris \"grey, old,\" Old Icelandic griss \"piglet, pig,\" Old Icelandic gryja \"to dawn,\" gryjandi \"morning twilight,\" Old Irish grian \"sun,\" Old Church Slavonic zorja \"morning twilight, brightness.\" The common sense of these words is \"to shine; bright.\"\n\nIn 1928, the first winner of Best in Show at Crufts was Primley Sceptre, a Greyhound owned by H. Whitley.\n\nIn popular culture \n\nSport \n\n*Sault Ste. Marie Greyhounds (Ontario Hockey League)cC\n*Ohio Valley Greyhounds (United Indoor Football)\n\nCollege \n\n*Assumption College (in Worcester, Massachusetts)\n*University of Indianapolis\n*Loyola University Maryland\n*Eastern New Mexico University\n*Moberly Area Community College (in Moberly, Missouri)\n*Moravian College in Bethlehem, Pennsylvania\n*Yankton College (Yankton, South Dakota)\n*Athol Murray College of Notre Dame (Wilcox, Saskatchewan)\n*Mid-South Community College (West Memphis, Ark.)\n*Fort Scott Community College (Fort Scott Kansas.)\n*Kearsney College (Botha's Hill, KwaZulu-Natal)\n*Foundation University (Dumaguete City, Negros Oriental, Philippines)\n\nOther \n\n* Greyhound Bus Lines bus company occasionally airs television commercials starring a talking computer-generated Greyhound.\n*The Who's 1968 non-album singles \"Dogs\" and \"Dogs (Part II)\" are humorous references to Greyhound racing and the associated betting.\n*The main-character family of the animated television series The Simpsons have a Greyhound named Santa's Little Helper, a retired racing greyhound who was adopted by the family at the conclusion of the pilot episode.\n*The cover art of the 1994 Britpop album \"Parklife\" by Blur features Greyhounds.\n*The M8 Light Armored Car, a US military vehicle, was nicknamed \"Greyhound\" by British armed forces during the Second World War.\n*Greyhounds are the main characters of Swedish House Mafia's official music video for their track Greyhound.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Greyhound" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12938" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Greyhound is a breed of dog; a sighthound which has been bred for coursing game and Greyhound racing. Since the rise in large-scale adoption of retired racing Greyhounds, the breed has seen a resurgence in popularity as a family pet.\n\nAccording to Merriam-Webster, a Greyhound is \"any of a breed of tall slender graceful smooth-coated dogs characterized by swiftness and keen sight\", as well as \"any of several related dogs,\" such as the Italian Greyhound.\n\nIt is a gentle and intelligent breed whose combination of long, powerful legs, deep chest, flexible spine and slim build allows it to reach average race speeds exceeding 64 km/h. The Greyhound can reach a full speed of 70 km/h within 30 m, or six strides from the boxes, traveling at almost 20 m/s for the first 250 m of a race.Sharp, N.C. Craig. Animal athletes: a performance review. Veterinary Record Vol 171 (4) 87-94 2012\n\nAppearance \n\nMales are usually 71 to tall at the withers, and weigh on average 27 to. Females tend to be smaller, with shoulder heights ranging from 68 to and weights from less than 27 to. Greyhounds have very short fur, which is easy to maintain. There are approximately thirty recognized color forms, of which variations of white, brindle, fawn, black, red and blue (gray) can appear uniquely or in combination. Greyhounds are dolichocephalic, with a skull which is relatively long in comparison to its breadth, and an elongated muzzle.\n\nTemperament \n\nGreyhounds can be aloof and indifferent to strangers, but are affectionate with their own pack. They are generally docile, lazy, easy-going, and calm.\n\nGreyhounds wear muzzles during racing, which can lead some to believe they are aggressive dogs, but this is not true. Muzzles are worn to prevent injuries resulting from dogs nipping one another during or immediately after a race, when the 'hare' has disappeared out of sight and the dogs are no longer racing but remain excited. \n\nContrary to popular belief, adult Greyhounds do not need extended periods of daily exercise, as they are bred for sprinting rather than endurance. Greyhound puppies that have not been taught how to utilize their energy, however, can be hyperactive and destructive if not given an outlet, and therefore require more experienced handlers.\"[https://web.archive.org/web/20100301120349/http://friendsofgreyhounds.org/faq.html Greyhound Rescue and Greyhound Adoption in South Florida FAQ]\". Friends of Greyhounds. Accessed Nov 5, 2014\n\nPets \n\nGreyhound owners and adoption groups consider Greyhounds wonderful pets. Greyhounds are quiet, gentle and loyal to owners. They are very loving, and enjoy the company of their humans and other dogs. Whether a Greyhound will enjoy the company of other small animals, such as cats, depends on the individual dog's personality. Greyhounds will typically chase small animals; those lacking a high 'prey drive' will be able to coexist happily with toy dog breeds and/or cats. Many owners describe their Greyhounds as \"45-mile-per-hour couch potatoes\".\n\nGreyhounds live most happily as pets in quiet environments.Livinggood, Lee (2000). Retired Racing Greyhounds for Dummies, p. 31. IDG Books Worldwide, Inc., Foster City, CA.  They do well in families with children, as long as the children are taught to treat the dog properly with politeness and appropriate respect.Livinggood 2000, p. 55-56 Greyhounds have a sensitive nature, and gentle commands work best as training methods.Livinggood, Lee (2000). Retired Racing Greyhounds for Dummies. IDG Books Worldwide, Inc., Foster City, CA. \n\nOccasionally, a Greyhound may bark; however, Greyhounds are generally not barkers, which is beneficial in suburban environments, and are usually as friendly to strangers as they are with their own families.Branigan, Cynthia A. (1998). Adopting the Racing Greyhound, p. 17-18. Howell Book House, New York. .\n\nA very common misconception regarding Greyhounds is that they are hyperactive. This is usually not the case with retired racing Greyhounds.\"The Greyhound Adoption Program (GAP) in Australia and New Zealand: A survey of owners' experiences with their greyhounds one month after adoption\" Applied Animal Behaviour Science Elliott, 2010 vol:124 iss:3-4 pg:121 -135. Greyhounds can live comfortably as apartment dogs, as they do not require much space and sleep almost 18 hours per day. Due to their calm temperament, Greyhounds can make better \"apartment dogs\" than smaller, more active breeds.\n\nAt most race tracks, Greyhounds are housed in crates. Most such animals know nothing other than being in a crate for the majority of the day. Therefore, crate training a retired Greyhound in a home is generally easy.\n\nMany Greyhound adoption groups recommend that owners keep their Greyhounds on a leash whenever outdoors, except in fully enclosed areas.\"[http://www.gapnsw.org.au/content/view/10/29/ Greyhound Adoption Program – Is a Greyhound Right for You?]\"[https://web.archive.org/web/20090318021547/http://www.adopt-a-greyhound.org/advice/offlead.html How Safe is an Off-Lead Run?], Adopt a Greyhound  This is due to their prey-drive, their speed, and the assertion that Greyhounds have no road sense. In some jurisdictions, it is illegal for Greyhounds to be allowed off-lead even in off-lead dog parks. Due to their size and strength, adoption groups recommend that fences be between 4 and 6 feet tall, to prevent Greyhounds from jumping over them.\n\nAbilities \n\nCoursing \n\nThe original primary use of Greyhounds, both in the British Isles and on the Continent of Europe, was in the coursing of deer. Later, they specialized in competition hare coursing.see p.246 Turbervile: A short observation … concerning coursing https://archive.org/details/turbervilesbooke00turb Some Greyhounds are still used for coursing, although artificial lure sports like lure coursing and racing are far more common and popular. Many leading 300- to 550-yard sprinters have bloodlines traceable back through Irish sires, within a few generations of racers that won events such as the Irish Coursing Derby or the Irish Cup.Irish Greyhound Stud Book\n\nRacing \n\nUntil the early twentieth century, Greyhounds were principally bred and trained for hunting and coursing. During the 1920s, modern greyhound racing was introduced into the United States and England (Belle Vue Stadium, Manchester, July 1926), as well as Northern Ireland (Celtic Park (Belfast), April 1927) and the Republic of Ireland (Shelbourne Park, Dublin). \n\nAustralia also has a significant racing culture. However, the 2015 live baiting scandal and adverse media coverage led to a Special Commission of Inquiry into the Greyhound Racing Industry in NSW. On 7 July 2016, New South Wales Premier Mike Baird announced that greyhound racing was to be banned in the state from 1 July 2017 after the inquiry found evidence of systemic animal cruelty, including mass greyhound killings and live baiting,Greyhound Racing Regulation 2016, available at: http://www.legislation.nsw.gov.au/regulations/2016-436.pdf  however the plan for the ban was later reversed before it was implemented. After the NSW announcement to ban racing,  Australian Capital Territory (ACT) Chief Minister Andrew Barr stated that greyhound racing would be banned in the ACT.\n\nAside from professional racing, many Greyhounds enjoy success on the amateur race track. Organizations like the Large Gazehound Racing Association (LGRA) and the National Oval Track Racing Association (NOTRA) provide opportunities for Greyhounds and other sighthound breeds to compete in amateur racing events all over the United States.\n\nCompanion \n\nHistorically, the Greyhound has, since its first appearance as a hunting type and breed, enjoyed a specific degree of fame and definition in Western literature, heraldry and art as the most elegant or noble companion and hunter of the canine world. In modern times, the professional racing industry, with its large numbers of track-bred Greyhounds, as well as international adoption programs aimed at rescuing and re-homing dogs that were at a surplus to the industry. They have redefined the breed in their almost mutually dependent pursuit of its welfare- as a sporting dog that will supply friendly companionship in its retirement.Madden, Raymond (2010) 'Imagining the greyhound: 'Racing' and 'rescue' narratives in a human and dog relationship', Continuum, 24: 4, 503 — 515 . Outside the racing industry and coursing community, the Kennel Clubs' registered breed still enjoys a modest following as a show dog and pet. There is an emerging pattern visible in recent years (2009–2010) of a significant decline in track betting and multiple track closures in the US, which will have consequences for the origin of future companion Greyhounds and the re-homing of current ex-racers.Flaim, Denise (2010) 'Forward Thinking', Sighthound Review, Vol 1 Issue 1.\n\nHealth and physiology \n\nGreyhounds are typically a healthy and long-lived breed, and hereditary illness is rare. Some Greyhounds have been known to develop esophageal achalasia, gastric dilatation volvulus (also known as bloat), and osteosarcoma. If exposed to E. coli, they may develop Alabama rot. Because the Greyhound's lean physique makes it ill-suited to sleeping on hard surfaces, owners of both racing and companion Greyhounds generally provide soft bedding; without bedding, Greyhounds are prone to develop painful skin sores. The average lifespan of a Greyhound is 9 to 11 years. \"n88 median\n10.8 IQR=8.1-12.0\"\n\nDue to the Greyhound's unique physiology and anatomy, a veterinarian who understands the issues relevant to the breed is generally needed when the dogs need treatment, particularly when anesthesia is required. Greyhounds cannot metabolize barbiturate-based anesthesia in the same way that other breeds can because their livers have lower amounts of oxidative enzymes.Blythe, Linda, Gannon, James, Craig, A. Morrie, and Fegan, Desmond P. (2007). Care of the Racing and Retired Greyhound, p. 416. American Greyhound Council, Inc., Kansas. .  Greyhounds demonstrate unusual blood chemistry [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3816276/], which can be misread by veterinarians not familiar with the breed and can result in an incorrect diagnosis.[https://www.riversideanimalcare.com/about-us/your-dublin-vet/c-guillermo-couto-dvm-diplomate-acvim-columbus-ohio-veterinarian/greyhounds-really-dogs/Couto Veterinary Consultants Are Sighthounds Really Dogs?], 2017\n\nGreyhounds are very sensitive to insecticides.Branigan, Cynthia A. (1998). Adopting the Racing Greyhound, p. 99-101. Howell Book House, New York. . Many vets do not recommend the use of flea collars or flea spray on Greyhounds if the product is a pyrethrin-based. Products like Advantage, Frontline, Lufenuron, and Amitraz are safe for use on Greyhounds, however, and are very effective in controlling fleas and ticks.Branigan, Cynthia A. (1998). Adopting the Racing Greyhound, p. 101-103. Howell Book House, New York. .\n\nGreyhounds have higher levels of red blood cells than other breeds. Since red blood cells carry oxygen to the muscles, this higher level allows the hound to move larger quantities of oxygen faster from the lungs to the muscles.Blythe, Linda, Gannon, James, Craig, A. Morrie, and Fegan, Desmond P. (2007). Care of the Racing and Retired Greyhound, p. 82. American Greyhound Council, Inc., Kansas. . Conversely, Greyhounds have lower levels of platelets than other breeds. Veterinary blood services often use Greyhounds as universal blood donors.[http://www.unitedbloodservices.org/llcoverside.html United Blood Services] article about Greyhounds as blood donors.\n\nGreyhounds do not have undercoats and thus are less likely to trigger dog allergies in humans (they are sometimes incorrectly referred to as \"hypoallergenic\"). The lack of an undercoat, coupled with a general lack of body fat, also makes Greyhounds more susceptible to extreme temperatures (both hot and cold); because of this, they must be housed inside.Blythe, Linda, Gannon, James, Craig, A. Morrie, and Fegan, Desmond P. (2007). Care of the Racing and Retired Greyhound, p. 394. American Greyhound Council, Kansas. .\n\nThe key to the speed of a Greyhound can be found in its light but muscular build, large heart, highest percentage of fast-twitch muscle of any breed,Snow, D.H. and Harris R.C. \"Thoroughbreds and Greyhounds: Biochemical Adaptations in Creatures of Nature and of Man\" Circulation, Respiration, and Metabolism Berlin: Springer Verlag 1985Snow, D.H. \"The horse and dog, elite athletes – why and how?\" Proceedings of the Nutrition Society 44 267 1985 double suspension gallop, and extreme flexibility of its spine. \"Double suspension rotary gallop\" describes the fastest running gait of the Greyhound in which all four feet are free from the ground in two phases, contracted and extended, during each full stride.Curtis M Brown. Dog Locomotion and Gait Analysis. Wheat Ridge, Colorado: Hoflin 1986 \n\nHistory \n\nThe breed's origin has in popular literature often been romantically connected to Ancient Egypt, in which it is believed \"that the breed dates back about 4,000 years;\" a belief for which there is no scientific evidence. While similar in appearance to Saluki (Persian Greyhound) or Sloughi (tombs at Beni Hassan c. 2000 BC), analyses of DNA reported in 2004 suggest that the Greyhound may not be closely related to these breeds, but is a close relative of herding dogs.Mark Derr (May 21, 2004). \"[https://www.nytimes.com/2004/05/21/science/21dog.html Collie or Pug? Study Finds the Genetic Code]\". The New York Times. Historical literature on the first sighthound in Europe (Arrian), the vertragus, probable antecedent of the Greyhound, suggests that its origin lies with the ancient Celts from Eastern Europe or Eurasia. Greyhound-type dogs of small, medium, and large size, appear to have been bred across Europe since that time. All modern, pure-bred pedigree Greyhounds derive from the Greyhound stock recorded and registered first in private studbooks in the 18th century, then in public studbooks in the 19th century, which ultimately were registered with coursing, racing, and kennel club authorities of the United Kingdom.\n\nHistorically, these sighthounds were used primarily for hunting in the open where their keen eyesight was valuable. It is believed that they (or at least similarly named dogs) were introduced to the British Isles in the 5th and 6th century BC from Celtic mainland Europe, although the Picts and other peoples of the northern British Isles (modern Scotland) were believed to have had large hounds similar to that of the deerhound before the 6th century BC.\n\nThe name \"Greyhound\" is generally believed to come from the Old English grighund. \"Hund\" is the antecedent of the modern \"hound\", but the meaning of \"grig\" is undetermined, other than in reference to dogs in Old English and Old Norse. Its origin does not appear to have any common root with the modern word \"grey\" for color, and indeed the Greyhound is seen with a wide variety of coat colors. The lighter colors, patch-like markings and white appeared in the breed that was once ordinarily grey in color. The Greyhound is the only dog mentioned by name in the Bible; many versions, including the King James version, name the Greyhound as one of the \"four things stately\" in the Proverbs.Proverbs 30:29–31 King James version. However, some newer biblical translations, including The New International Version, have changed this to strutting rooster, which appears to be an alternative translation of the Hebrew term mothen zarzir. However, the Douay–Rheims Bible translation from the late 4th-century Latin Vulgate into English translates this term as \"a cock.\"\n\nAccording to PokornyPokorny, Indogermanisches Woerterbuch, pp. 441–442. the English name \"Greyhound\" does not mean \"grey dog/hound\", but simply \"fair dog\". Subsequent words have been derived from the Proto-Indo-European root *g'her- \"shine, twinkle\": English grey, Old High German gris \"grey, old,\" Old Icelandic griss \"piglet, pig,\" Old Icelandic gryja \"to dawn,\" gryjandi \"morning twilight,\" Old Irish grian \"sun,\" Old Church Slavonic zorja \"morning twilight, brightness.\" The common sense of these words is \"to shine; bright.\"\n\nIn 1928, the first winner of Best in Show at Crufts was Primley Sceptre, a Greyhound owned by H. Whitley.\n\nIn popular culture \n\nSport \n\n*Sault Ste. Marie Greyhounds (Ontario Hockey League)cC\n*Ohio Valley Greyhounds (United Indoor Football)\n\nCollege \n\n*Assumption College (in Worcester, Massachusetts)\n*University of Indianapolis\n*Loyola University Maryland\n*Eastern New Mexico University\n*Moberly Area Community College (in Moberly, Missouri)\n*Moravian College in Bethlehem, Pennsylvania\n*Yankton College (Yankton, South Dakota)\n*Athol Murray College of Notre Dame (Wilcox, Saskatchewan)\n*Mid-South Community College (West Memphis, Ark.)\n*Fort Scott Community College (Fort Scott Kansas.)\n*Kearsney College (Botha's Hill, KwaZulu-Natal)\n*Foundation University (Dumaguete City, Negros Oriental, Philippines)\n\nOther \n\n* Greyhound Bus Lines bus company occasionally airs television commercials starring a talking computer-generated Greyhound.\n*The Who's 1968 non-album singles \"Dogs\" and \"Dogs (Part II)\" are humorous references to Greyhound racing and the associated betting.\n*The main-character family of the animated television series The Simpsons have a Greyhound named Santa's Little Helper, a retired racing greyhound who was adopted by the family at the conclusion of the pilot episode.\n*The cover art of the 1994 Britpop album \"Parklife\" by Blur features Greyhounds.\n*The M8 Light Armored Car, a US military vehicle, was nicknamed \"Greyhound\" by British armed forces during the Second World War.\n*Greyhounds are the main characters of Swedish House Mafia's official music video for their track Greyhound. Greyhound. http://en.wikipedia.org/?curid=12938."
  }
}
