{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14381",
  "eid" : "14360120-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778543154,
  "textBody" : "In quantum mechanics, a Hamiltonian is an operator corresponding to the total energy of the system in most of the cases. It is usually denoted by H, also Ȟ or Ĥ. Its spectrum is the set of possible outcomes when one measures the total energy of a system.  Because of its close relation to the time-evolution of a system, it is of fundamental importance in most formulations of quantum theory.\n\nThe Hamiltonian is named after William Rowan Hamilton, who also created a revolutionary reformation of Newtonian mechanics, now called Hamiltonian mechanics, that is important in quantum physics.\n\nIntroduction\n\nThe Hamiltonian is the sum of the kinetic energies of all the particles, plus the potential energy of the particles associated with the system. For different situations or number of particles, the Hamiltonian is different since it includes the sum of kinetic energies of the particles, and the potential energy function corresponding to the situation.\n\nThe Schrödinger Hamiltonian\n\nOne particle\n\nBy analogy with classical mechanics, the Hamiltonian is commonly expressed as the sum of operators corresponding to the kinetic and potential energies of a system in the form\n\n \\hat{H} = \\hat{T} + \\hat{V} \n\nwhere\n \\hat{V} V \n V(\\bold{r},t) \nis the potential energy operator and \n\\hat{T} \\frac{\\bold{\\hat{p}}\\cdot\\bold{\\hat{p}}}{2m} \n \\frac{\\hat{p}^2}{2m} = -\\frac{\\hbar^2}{2m}\\nabla^2\nis the kinetic energy operator in which m is the mass of the particle, the dot denotes the dot product of vectors, and \n \\hat{p} = -i\\hbar\\nabla \nis the momentum operator where an ∇ is the del operator. The dot product of ∇ with itself is the Laplacian ∇2. In three dimensions using Cartesian coordinates the Laplace operator is\n\\nabla^2 = \\frac{\\partial^2}_n\\cdot\\bold{\\hat{p}}_n}{2m_n}+ V(\\mathbf{r}_1,\\mathbf{r}_2\\cdots\\mathbf{r}_N,t) \\\\\n & -\\frac{\\hbar^2}{2}\\sum_{n\n1}^N \\frac{1}{m_n}\\nabla_n^2 + V(\\mathbf{r}_1,\\mathbf{r}_2\\cdots\\mathbf{r}_N,t)\n\\end{align} \n\nHowever, complications can arise in the many-body problem. Since the potential energy depends on the spatial arrangement of the particles, the kinetic energy will also depend on the spatial configuration to conserve energy. The motion due to any one particle will vary due to the motion of all the other particles in the system. For this reason cross terms for kinetic energy may appear in the Hamiltonian; a mix of the gradients for two particles:\n\n-\\frac{\\hbar^2}{2M}\\nabla_i\\cdot\\nabla_j \n\nwhere M denotes the mass of the collection of particles resulting in this extra kinetic energy. Terms of this form are known as mass polarization terms, and appear in the Hamiltonian of many electron atoms (see below).\n\nFor N interacting particles, i.e. particles which interact mutually and constitute a many-body situation, the potential energy function V is not simply a sum of the separate potentials (and certainly not a product, as this is dimensionally incorrect). The potential energy function can only be written as above: a function of all the spatial positions of each particle.\n\nFor non-interacting particles, i.e. particles which do not interact mutually and move independently, the potential of the system is the sum of the separate potential energy for each particle,Quantum Physics of Atoms, Molecules, Solids, Nuclei and Particles (2nd Edition), R. Resnick, R. Eisberg, John Wiley & Sons, 1985,  that is\n\n V \\sum_{i\n1}^N V(\\bold{r}_i,t) = V(\\bold{r}_1,t) + V(\\bold{r}_2,t) + \\cdots + V(\\bold{r}_N,t) \n\nThe general form of the Hamiltonian in this case is:\n\n\\begin{align} \\hat{H} & -\\frac{\\hbar^2}{2}\\sum_{i\n1}^{N}\\frac{1}{m_i}\\nabla_i^2 + \\sum_{i=1}^N V_i\\\\\n & \\sum_{i\n1}^{N}\\left(-\\frac{\\hbar^2}{2m_i}\\nabla_i^2 + V_i \\right) \\\\\n & \\sum_{i\n1}^{N}\\hat{H}_i \\\\\n\\end{align}\n\nwhere the sum is taken over all particles and their corresponding potentials; the result is that the Hamiltonian of the system is the sum of the separate Hamiltonians for each particle. This is an idealized situation - in practice the particles are almost always influenced by some potential, and there are many-body interactions. One illustrative example of a two-body interaction where this form would not apply is for electrostatic potentials due to charged particles, because they interact with each other by Coulomb interaction (electrostatic force), as shown below.\n\nSchrödinger equation\n\nThe Hamiltonian generates the time evolution of quantum states. If  \\left| \\psi (t) \\right\\rangle is the state of the system at time t, then\n\n H \\left| \\psi (t) \\right\\rangle = i \\hbar {\\partial\\over\\partial t} \\left| \\psi (t) \\right\\rangle.\n\nThis equation is the Schrödinger equation. It takes the same form as the Hamilton–Jacobi equation, which is one of the reasons H is also called the Hamiltonian. Given the state at some initial time (t = 0), we can solve it to obtain the state at any subsequent time. In particular, if H is independent of time, then\n\n \\left| \\psi (t) \\right\\rangle = e^{-iHt/\\hbar} \\left| \\psi (0) \\right\\rangle.\n\nThe exponential operator on the right hand side of the Schrödinger equation is usually defined by the corresponding power series in H. One might notice that taking polynomials or power series of unbounded operators that are not defined everywhere may not make mathematical sense. Rigorously, to take functions of unbounded operators, a functional calculus is required. In the case of the exponential function, the continuous, or just the holomorphic functional calculus suffices. We note again, however, that for common calculations the physicists' formulation is quite sufficient.\n\nBy the *-homomorphism property of the functional calculus, the operator\n\n U = e^{-iHt/\\hbar} \n\nis a unitary operator. It is the time evolution operator, or propagator, of a closed quantum system. If the Hamiltonian is time-independent, {U(t)} form a one parameter unitary group (more than a semigroup); this gives rise to the physical principle of detailed balance.\n\nDirac formalism\n\nHowever, in the more general formalism of Dirac, the Hamiltonian is typically implemented as an operator on a Hilbert space in the following way:\n\nThe eigenkets (eigenvectors) of H, denoted \\left| a \\right\\rang, provide an orthonormal basis for the Hilbert space. The spectrum of allowed energy levels of the system is given by the set of eigenvalues, denoted {Ea}, solving the equation:\n\n H \\left| a \\right\\rangle = E_a \\left| a \\right\\rangle.\n\nSince H is a Hermitian operator, the energy is always a real number.\n\nFrom a mathematically rigorous point of view, care must be taken with the above assumptions. Operators on infinite-dimensional Hilbert spaces need not have eigenvalues (the set of eigenvalues does not necessarily coincide with the spectrum of an operator). However, all routine quantum mechanical calculations can be done using the physical formulation.\n\nExpressions for the Hamiltonian\n\nFollowing are expressions for the Hamiltonian in a number of situations.Quanta: A handbook of concepts, P.W. Atkins, Oxford University Press, 1974,  Typical ways to classify the expressions are the number of particles, number of dimensions, and the nature of the potential energy function - importantly space and time dependence. Masses are denoted by m, and charges by q.\n\nGeneral forms for one particle\n\nFree particle\n\nThe particle is not bound by any potential energy, so the potential is zero and this Hamiltonian is the simplest. For one dimension:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} \n\nand in three dimensions:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\nabla^2 \n\nConstant-potential well\n\nFor a particle in a region of constant potential V = V0 (no dependence on space or time), in one dimension, the Hamiltonian is:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} + V_0 \n\nin three dimensions\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\nabla^2 + V_0 \n\nThis applies to the elementary \"particle in a box\" problem, and step potentials.\n\nSimple harmonic oscillator\n\nFor a simple harmonic oscillator in one dimension, the potential varies with position (but not time), according to:\n\nV \\frac{k}{2}x^2 \n \\frac{m\\omega^2}{2}x^2  \n\nwhere the angular frequency \\omega, effective spring constant k, and mass m of the oscillator satisfy:\n\n\\omega^2 = \\frac{k}{m}\n\nso the Hamiltonian is:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} + \\frac{m\\omega^2}{2}x^2 \n\nFor three dimensions, this becomes\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\nabla^2 + \\frac{m\\omega^2}{2} r^2 \n\nwhere the three-dimensional position vector r using cartesian coordinates is (x, y, z), its magnitude is\n\nr^2 \\bold{r}\\cdot\\bold{r} \n |\\bold{r}|^2 = x^2+y^2+z^2 \n\nWriting the Hamiltonian out in full shows it is simply the sum of the one-dimensional Hamiltonians in each direction:\n\n\\begin{align} \\hat{H} & = -\\frac{\\hbar^2}{2m}\\left( \\frac{\\partial^2}{\\partial x^2} + \\frac{\\partial^2}{\\partial y^2} + \\frac{\\partial^2}{\\partial z^2} \\right) + \\frac{m\\omega^2}{2} (x^2+y^2+z^2) \\\\\n& = \\left(-\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} + \\frac{m\\omega^2}{2}x^2\\right) + \\left(-\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial y^2} + \\frac{m\\omega^2}{2}y^2 \\right ) + \\left(- \\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial z^2} +\\frac{m\\omega^2}{2}z^2 \\right) \\\\\n\\end{align}\n\nRigid rotor\n\nFor a rigid rotor – i.e. system of particles which can rotate freely about any axes, not bound in any potential (such as free molecules with negligible vibrational degrees of freedom, say due to double or triple chemical bonds), Hamiltonian is:\n\n \\hat{H} = -\\frac{\\hbar^2}{2I_{xx}}\\hat{J}_x^2 -\\frac{\\hbar^2}{2I_{yy}}\\hat{J}_y^2 -\\frac{\\hbar^2}{2I_{zz}}\\hat{J}_z^2 \n\nwhere Ixx, Iyy, and Izz are the moment of inertia components (technically the diagonal elements of the moment of inertia tensor), and  \\hat{J}_x \\,\\!,  \\hat{J}_y \\,\\! and  \\hat{J}_z \\,\\! are the total angular momentum operators (components), about the x, y, and z axes respectively.\n\nElectrostatic or coulomb potential\n\nThe Coulomb potential energy for two point charges q1 and q2 (i.e. charged particles, since particles have no spatial extent), in three dimensions, is (in SI units - rather than Gaussian units which are frequently used in electromagnetism):\n\nV = \\frac{q_1q_2}{4\\pi\\epsilon_0 |\\bold{r}|}\n\nHowever, this is only the potential for one point charge due to another. If there are many charged particles, each charge has a potential energy due to every other point charge (except itself). For N charges, the potential energy of charge qj due to all other charges is (see also Electrostatic potential energy stored in a configuration of discrete point charges):Electromagnetism (2nd edition), I.S. Grant, W.R. Phillips, Manchester Physics Series, 2008 \n\nV_j \\frac{1}{2}\\sum_{i\\neq j} q_i \\phi(\\mathbf{r}_i)\n\\frac{1}{8\\pi\\varepsilon_0}\\sum_{i\\neq j} \\frac{q_iq_j}\n\nwhere φ(ri) is the electrostatic potential of charge qj at ri. The total potential of the system is then the sum over j:\n\nV \\frac{1}{8\\pi\\varepsilon_0}\\sum_{j\n1}^N\\sum_{i\\neq j} \\frac{q_iq_j}\n\nso the Hamiltonian is:\n\n\\begin{align}\\hat{H} & -\\frac{\\hbar^2}{2}\\sum_{j\n1}^N\\frac{1}{m_j}\\nabla_j^2 + \\frac{1}{8\\pi\\varepsilon_0}\\sum_{j=1}^N\\sum_{i\\neq j} \\frac{q_iq_j} \\\\\n & \\sum_{j\n1}^N \\left ( -\\frac{\\hbar^2}{2m_j}\\nabla_j^2 + \\frac{1}{8\\pi\\varepsilon_0}\\sum_{i\\neq j} \\frac{q_iq_j}\\right) \\\\\n\\end{align}\n\nElectric dipole in an electric field\n\nFor an electric dipole moment d constituting charges of magnitude q, in a uniform, electrostatic field (time-independent) E, positioned in one place, the potential is:\n\nV = -\\bold{\\hat{d}}\\cdot\\bold{E} \n\nthe dipole moment itself is the operator\n\n\\bold{\\hat{d}} = q\\bold{\\hat{r}} \n\nSince the particle is stationary, there is no translational kinetic energy of the dipole, so the Hamiltonian of the dipole is just the potential energy:\n\n\\hat{H} -\\bold{\\hat{d}}\\cdot\\bold{E} \n -q\\bold{\\hat{r}}\\cdot\\bold{E}\n\nMagnetic dipole in a magnetic field\n\nFor a magnetic dipole moment μ in a uniform, magnetostatic field (time-independent) B, positioned in one place, the potential is:\n\nV = -\\boldsymbol{\\mu}\\cdot\\bold{B} \n\nSince the particle is stationary, there is no translational kinetic energy of the dipole, so the Hamiltonian of the dipole is just the potential energy:\n\n\\hat{H} = -\\boldsymbol{\\mu}\\cdot\\bold{B} \n\nFor a Spin-½ particle, the corresponding spin magnetic moment is:Physics of Atoms and Molecules, B.H. Bransden, C.J.Joachain, Longman, 1983, \n\n\\boldsymbol{\\mu}_S = \\frac{g_s e}{2m} \\bold{S} \n\nwhere gs is the spin gyromagnetic ratio (a.k.a. \"spin g-factor\"), e is the electron charge, S is the spin operator vector, whose components are the Pauli matrices, hence\n\n\\hat{H} = \\frac{g_s e}{2m} \\bold{S} \\cdot\\bold{B} \n\nCharged particle in an electromagnetic field\n\nFor a charged particle q in an electromagnetic field, described by the scalar potential φ and vector potential A, there are two parts to the Hamiltonian to substitute for. The momentum operator must be replaced by the kinetic momentum operator, which includes a contribution from the A field:\n\n\\bold{\\hat{\\Pi}} = \\bold{\\hat{P}} - q\\bold{A} \n\nwhere \\bold{\\hat{P}} is the canonical momentum operator given as the usual momentum operator:\n\n\\bold{\\hat{P}} = -i\\hbar\\nabla \n\nso the corresponding kinetic energy operator is:\n\n\\hat{T} \\frac{\\bold{\\hat{\\Pi}}\\cdot\\bold{\\hat{\\Pi}}}{2m} \n \\frac{1}{2m} \\left ( \\bold{\\hat{P}} - q\\bold{A} \\right)^2 \n\nand the potential energy, which is due to the φ field:\n\nV = q\\phi \n\nCasting all of these into the Hamiltonian gives:\n\n\\hat{H} = \\frac{1}{2m} \\left ( -i\\hbar\\nabla - q\\bold{A} \\right)^2 + q\\phi \n\nEnergy eigenket degeneracy, symmetry, and conservation laws\n\nIn many systems, two or more energy eigenstates have the same energy. A simple example of this is a free particle, whose energy eigenstates have wavefunctions that are propagating plane waves. The energy of each of these plane waves is inversely proportional to the square of its wavelength.  A wave propagating in the x direction is a different state from one propagating in the y direction, but if they have the same wavelength, then their energies will be the same. When this happens, the states are said to be degenerate.\n\nIt turns out that degeneracy occurs whenever a nontrivial unitary operator U commutes with the Hamiltonian. To see this, suppose that |a\\rang is an energy eigenket. Then U|a\\rang is an energy eigenket with the same eigenvalue, since\n\nUH |a\\rangle U E_a|a\\rangle \n E_a (U|a\\rangle) = H \\; (U|a\\rangle). \n\nSince U is nontrivial, at least one pair of |a\\rang and U|a\\rang must represent distinct states. Therefore, H has at least one pair of degenerate energy eigenkets. In the case of the free particle, the unitary operator which produces the symmetry is the rotation operator, which rotates the wavefunctions by some angle while otherwise preserving their shape.\n\nThe existence of a symmetry operator implies the existence of a conserved observable. Let G be the Hermitian generator of U:\n\n U = I - i \\epsilon G + O(\\epsilon^2) \\,\n\nIt is straightforward to show that if U commutes with H, then so does G:\n\n [H, G] = 0 \\,\n\nTherefore,\n\n\\frac{\\part}{\\part t} \\langle\\psi(t)|G|\\psi(t)\\rangle\n= \\frac{1}{i\\hbar} \\langle\\psi(t)|[G,H]|\\psi(t)\\rangle \n= 0.\n\nIn obtaining this result, we have used the Schrödinger equation, as well as its dual,\n\n \\langle\\psi (t)|H = - i \\hbar {\\partial\\over\\partial t} \\langle\\psi(t)|.\n\nThus, the expected value of the observable G is conserved for any state of the system. In the case of the free particle, the conserved quantity is the angular momentum.\n\nHamilton's equations\n\nHamilton's equations in classical Hamiltonian mechanics have a direct analogy in quantum mechanics. Suppose we have a set of basis states \\left\\{\\left| n \\right\\rangle\\right\\}, which need not necessarily be eigenstates of the energy. For simplicity, we assume that they are discrete, and that they are orthonormal, i.e.,\n\n \\langle n' | n \\rangle = \\delta_{nn'}\n\nNote that these basis states are assumed to be independent of time. We will assume that the Hamiltonian is also independent of time.\n\nThe instantaneous state of the system at time t, \\left| \\psi\\left(t\\right) \\right\\rangle, can be expanded in terms of these basis states:\n\n |\\psi (t)\\rangle = \\sum_{n} a_n(t) |n\\rangle \n\nwhere\n\n a_n(t) = \\langle n | \\psi(t) \\rangle. \n\nThe coefficients an(t) are complex variables. We can treat them as coordinates which specify the state of the system, like the position and momentum coordinates which specify a classical system. Like classical coordinates, they are generally not constant in time, and their time dependence gives rise to the time dependence of the system as a whole.\n\nThe expectation value of the Hamiltonian of this state, which is also the mean energy, is\n\n \\langle H(t) \\rangle \\ \\stackrel{\\mathrm{def}}{=}\\  \\langle\\psi(t)|H|\\psi(t)\\rangle\n= \\sum_{nn'} a_{n'}^* a_n \\langle n'|H|n \\rangle \n\nwhere the last step was obtained by expanding \\left| \\psi\\left(t\\right) \\right\\rangle in terms of the basis states.\n\nEach an(t) actually corresponds to two independent degrees of freedom, since the variable has a real part and an imaginary part. We now perform the following trick: instead of using the real and imaginary parts as the independent variables, we use an(t) and its complex conjugate an*(t). With this choice of independent variables, we can calculate the partial derivative\n\n\\frac{\\partial \\langle H \\rangle}{\\partial a_{n'}^{*}}\n= \\sum_{n} a_n \\langle n'|H|n \\rangle\n= \\langle n'|H|\\psi\\rangle\n\nBy applying Schrödinger's equation and using the orthonormality of the basis states, this further reduces to\n\n\\frac{\\partial \\langle H \\rangle}{\\partial a_{n'}^{*}}\n= i \\hbar \\frac{\\partial a_{n'}}{\\partial t} \n\nSimilarly, one can show that\n\n \\frac{\\partial \\langle H \\rangle}{\\partial a_n}\n= - i \\hbar \\frac{\\partial a_{n}^{*}}{\\partial t} \n\nIf we define \"conjugate momentum\" variables πn by\n\n \\pi_{n}(t) = i \\hbar a_n^*(t) \n\nthen the above equations become\n\n \\frac{\\partial \\langle H \\rangle}{\\partial \\pi_n} \\frac{\\partial a_n}{\\partial t},\\quad \\frac{\\partial \\langle H \\rangle}{\\partial a_n} \n - \\frac{\\partial \\pi_n}{\\partial t} \n\nwhich is precisely the form of Hamilton's equations, with the a_ns as the generalized coordinates, the \\pi_ns as the conjugate momenta, and \\langle H\\rangle taking the place of the classical Hamiltonian.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hamiltonian (quantum mechanics)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14381" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In quantum mechanics, a Hamiltonian is an operator corresponding to the total energy of the system in most of the cases. It is usually denoted by H, also Ȟ or Ĥ. Its spectrum is the set of possible outcomes when one measures the total energy of a system.  Because of its close relation to the time-evolution of a system, it is of fundamental importance in most formulations of quantum theory.\n\nThe Hamiltonian is named after William Rowan Hamilton, who also created a revolutionary reformation of Newtonian mechanics, now called Hamiltonian mechanics, that is important in quantum physics.\n\nIntroduction\n\nThe Hamiltonian is the sum of the kinetic energies of all the particles, plus the potential energy of the particles associated with the system. For different situations or number of particles, the Hamiltonian is different since it includes the sum of kinetic energies of the particles, and the potential energy function corresponding to the situation.\n\nThe Schrödinger Hamiltonian\n\nOne particle\n\nBy analogy with classical mechanics, the Hamiltonian is commonly expressed as the sum of operators corresponding to the kinetic and potential energies of a system in the form\n\n \\hat{H} = \\hat{T} + \\hat{V} \n\nwhere\n \\hat{V} V \n V(\\bold{r},t) \nis the potential energy operator and \n\\hat{T} \\frac{\\bold{\\hat{p}}\\cdot\\bold{\\hat{p}}}{2m} \n \\frac{\\hat{p}^2}{2m} = -\\frac{\\hbar^2}{2m}\\nabla^2\nis the kinetic energy operator in which m is the mass of the particle, the dot denotes the dot product of vectors, and \n \\hat{p} = -i\\hbar\\nabla \nis the momentum operator where an ∇ is the del operator. The dot product of ∇ with itself is the Laplacian ∇2. In three dimensions using Cartesian coordinates the Laplace operator is\n\\nabla^2 = \\frac{\\partial^2}_n\\cdot\\bold{\\hat{p}}_n}{2m_n}+ V(\\mathbf{r}_1,\\mathbf{r}_2\\cdots\\mathbf{r}_N,t) \\\\\n & -\\frac{\\hbar^2}{2}\\sum_{n\n1}^N \\frac{1}{m_n}\\nabla_n^2 + V(\\mathbf{r}_1,\\mathbf{r}_2\\cdots\\mathbf{r}_N,t)\n\\end{align} \n\nHowever, complications can arise in the many-body problem. Since the potential energy depends on the spatial arrangement of the particles, the kinetic energy will also depend on the spatial configuration to conserve energy. The motion due to any one particle will vary due to the motion of all the other particles in the system. For this reason cross terms for kinetic energy may appear in the Hamiltonian; a mix of the gradients for two particles:\n\n-\\frac{\\hbar^2}{2M}\\nabla_i\\cdot\\nabla_j \n\nwhere M denotes the mass of the collection of particles resulting in this extra kinetic energy. Terms of this form are known as mass polarization terms, and appear in the Hamiltonian of many electron atoms (see below).\n\nFor N interacting particles, i.e. particles which interact mutually and constitute a many-body situation, the potential energy function V is not simply a sum of the separate potentials (and certainly not a product, as this is dimensionally incorrect). The potential energy function can only be written as above: a function of all the spatial positions of each particle.\n\nFor non-interacting particles, i.e. particles which do not interact mutually and move independently, the potential of the system is the sum of the separate potential energy for each particle,Quantum Physics of Atoms, Molecules, Solids, Nuclei and Particles (2nd Edition), R. Resnick, R. Eisberg, John Wiley & Sons, 1985,  that is\n\n V \\sum_{i\n1}^N V(\\bold{r}_i,t) = V(\\bold{r}_1,t) + V(\\bold{r}_2,t) + \\cdots + V(\\bold{r}_N,t) \n\nThe general form of the Hamiltonian in this case is:\n\n\\begin{align} \\hat{H} & -\\frac{\\hbar^2}{2}\\sum_{i\n1}^{N}\\frac{1}{m_i}\\nabla_i^2 + \\sum_{i=1}^N V_i\\\\\n & \\sum_{i\n1}^{N}\\left(-\\frac{\\hbar^2}{2m_i}\\nabla_i^2 + V_i \\right) \\\\\n & \\sum_{i\n1}^{N}\\hat{H}_i \\\\\n\\end{align}\n\nwhere the sum is taken over all particles and their corresponding potentials; the result is that the Hamiltonian of the system is the sum of the separate Hamiltonians for each particle. This is an idealized situation - in practice the particles are almost always influenced by some potential, and there are many-body interactions. One illustrative example of a two-body interaction where this form would not apply is for electrostatic potentials due to charged particles, because they interact with each other by Coulomb interaction (electrostatic force), as shown below.\n\nSchrödinger equation\n\nThe Hamiltonian generates the time evolution of quantum states. If  \\left| \\psi (t) \\right\\rangle is the state of the system at time t, then\n\n H \\left| \\psi (t) \\right\\rangle = i \\hbar {\\partial\\over\\partial t} \\left| \\psi (t) \\right\\rangle.\n\nThis equation is the Schrödinger equation. It takes the same form as the Hamilton–Jacobi equation, which is one of the reasons H is also called the Hamiltonian. Given the state at some initial time (t = 0), we can solve it to obtain the state at any subsequent time. In particular, if H is independent of time, then\n\n \\left| \\psi (t) \\right\\rangle = e^{-iHt/\\hbar} \\left| \\psi (0) \\right\\rangle.\n\nThe exponential operator on the right hand side of the Schrödinger equation is usually defined by the corresponding power series in H. One might notice that taking polynomials or power series of unbounded operators that are not defined everywhere may not make mathematical sense. Rigorously, to take functions of unbounded operators, a functional calculus is required. In the case of the exponential function, the continuous, or just the holomorphic functional calculus suffices. We note again, however, that for common calculations the physicists' formulation is quite sufficient.\n\nBy the *-homomorphism property of the functional calculus, the operator\n\n U = e^{-iHt/\\hbar} \n\nis a unitary operator. It is the time evolution operator, or propagator, of a closed quantum system. If the Hamiltonian is time-independent, {U(t)} form a one parameter unitary group (more than a semigroup); this gives rise to the physical principle of detailed balance.\n\nDirac formalism\n\nHowever, in the more general formalism of Dirac, the Hamiltonian is typically implemented as an operator on a Hilbert space in the following way:\n\nThe eigenkets (eigenvectors) of H, denoted \\left| a \\right\\rang, provide an orthonormal basis for the Hilbert space. The spectrum of allowed energy levels of the system is given by the set of eigenvalues, denoted {Ea}, solving the equation:\n\n H \\left| a \\right\\rangle = E_a \\left| a \\right\\rangle.\n\nSince H is a Hermitian operator, the energy is always a real number.\n\nFrom a mathematically rigorous point of view, care must be taken with the above assumptions. Operators on infinite-dimensional Hilbert spaces need not have eigenvalues (the set of eigenvalues does not necessarily coincide with the spectrum of an operator). However, all routine quantum mechanical calculations can be done using the physical formulation.\n\nExpressions for the Hamiltonian\n\nFollowing are expressions for the Hamiltonian in a number of situations.Quanta: A handbook of concepts, P.W. Atkins, Oxford University Press, 1974,  Typical ways to classify the expressions are the number of particles, number of dimensions, and the nature of the potential energy function - importantly space and time dependence. Masses are denoted by m, and charges by q.\n\nGeneral forms for one particle\n\nFree particle\n\nThe particle is not bound by any potential energy, so the potential is zero and this Hamiltonian is the simplest. For one dimension:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} \n\nand in three dimensions:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\nabla^2 \n\nConstant-potential well\n\nFor a particle in a region of constant potential V = V0 (no dependence on space or time), in one dimension, the Hamiltonian is:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} + V_0 \n\nin three dimensions\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\nabla^2 + V_0 \n\nThis applies to the elementary \"particle in a box\" problem, and step potentials.\n\nSimple harmonic oscillator\n\nFor a simple harmonic oscillator in one dimension, the potential varies with position (but not time), according to:\n\nV \\frac{k}{2}x^2 \n \\frac{m\\omega^2}{2}x^2  \n\nwhere the angular frequency \\omega, effective spring constant k, and mass m of the oscillator satisfy:\n\n\\omega^2 = \\frac{k}{m}\n\nso the Hamiltonian is:\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} + \\frac{m\\omega^2}{2}x^2 \n\nFor three dimensions, this becomes\n\n\\hat{H} = -\\frac{\\hbar^2}{2m}\\nabla^2 + \\frac{m\\omega^2}{2} r^2 \n\nwhere the three-dimensional position vector r using cartesian coordinates is (x, y, z), its magnitude is\n\nr^2 \\bold{r}\\cdot\\bold{r} \n |\\bold{r}|^2 = x^2+y^2+z^2 \n\nWriting the Hamiltonian out in full shows it is simply the sum of the one-dimensional Hamiltonians in each direction:\n\n\\begin{align} \\hat{H} & = -\\frac{\\hbar^2}{2m}\\left( \\frac{\\partial^2}{\\partial x^2} + \\frac{\\partial^2}{\\partial y^2} + \\frac{\\partial^2}{\\partial z^2} \\right) + \\frac{m\\omega^2}{2} (x^2+y^2+z^2) \\\\\n& = \\left(-\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial x^2} + \\frac{m\\omega^2}{2}x^2\\right) + \\left(-\\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial y^2} + \\frac{m\\omega^2}{2}y^2 \\right ) + \\left(- \\frac{\\hbar^2}{2m}\\frac{\\partial^2}{\\partial z^2} +\\frac{m\\omega^2}{2}z^2 \\right) \\\\\n\\end{align}\n\nRigid rotor\n\nFor a rigid rotor – i.e. system of particles which can rotate freely about any axes, not bound in any potential (such as free molecules with negligible vibrational degrees of freedom, say due to double or triple chemical bonds), Hamiltonian is:\n\n \\hat{H} = -\\frac{\\hbar^2}{2I_{xx}}\\hat{J}_x^2 -\\frac{\\hbar^2}{2I_{yy}}\\hat{J}_y^2 -\\frac{\\hbar^2}{2I_{zz}}\\hat{J}_z^2 \n\nwhere Ixx, Iyy, and Izz are the moment of inertia components (technically the diagonal elements of the moment of inertia tensor), and  \\hat{J}_x \\,\\!,  \\hat{J}_y \\,\\! and  \\hat{J}_z \\,\\! are the total angular momentum operators (components), about the x, y, and z axes respectively.\n\nElectrostatic or coulomb potential\n\nThe Coulomb potential energy for two point charges q1 and q2 (i.e. charged particles, since particles have no spatial extent), in three dimensions, is (in SI units - rather than Gaussian units which are frequently used in electromagnetism):\n\nV = \\frac{q_1q_2}{4\\pi\\epsilon_0 |\\bold{r}|}\n\nHowever, this is only the potential for one point charge due to another. If there are many charged particles, each charge has a potential energy due to every other point charge (except itself). For N charges, the potential energy of charge qj due to all other charges is (see also Electrostatic potential energy stored in a configuration of discrete point charges):Electromagnetism (2nd edition), I.S. Grant, W.R. Phillips, Manchester Physics Series, 2008 \n\nV_j \\frac{1}{2}\\sum_{i\\neq j} q_i \\phi(\\mathbf{r}_i)\n\\frac{1}{8\\pi\\varepsilon_0}\\sum_{i\\neq j} \\frac{q_iq_j}\n\nwhere φ(ri) is the electrostatic potential of charge qj at ri. The total potential of the system is then the sum over j:\n\nV \\frac{1}{8\\pi\\varepsilon_0}\\sum_{j\n1}^N\\sum_{i\\neq j} \\frac{q_iq_j}\n\nso the Hamiltonian is:\n\n\\begin{align}\\hat{H} & -\\frac{\\hbar^2}{2}\\sum_{j\n1}^N\\frac{1}{m_j}\\nabla_j^2 + \\frac{1}{8\\pi\\varepsilon_0}\\sum_{j=1}^N\\sum_{i\\neq j} \\frac{q_iq_j} \\\\\n & \\sum_{j\n1}^N \\left ( -\\frac{\\hbar^2}{2m_j}\\nabla_j^2 + \\frac{1}{8\\pi\\varepsilon_0}\\sum_{i\\neq j} \\frac{q_iq_j}\\right) \\\\\n\\end{align}\n\nElectric dipole in an electric field\n\nFor an electric dipole moment d constituting charges of magnitude q, in a uniform, electrostatic field (time-independent) E, positioned in one place, the potential is:\n\nV = -\\bold{\\hat{d}}\\cdot\\bold{E} \n\nthe dipole moment itself is the operator\n\n\\bold{\\hat{d}} = q\\bold{\\hat{r}} \n\nSince the particle is stationary, there is no translational kinetic energy of the dipole, so the Hamiltonian of the dipole is just the potential energy:\n\n\\hat{H} -\\bold{\\hat{d}}\\cdot\\bold{E} \n -q\\bold{\\hat{r}}\\cdot\\bold{E}\n\nMagnetic dipole in a magnetic field\n\nFor a magnetic dipole moment μ in a uniform, magnetostatic field (time-independent) B, positioned in one place, the potential is:\n\nV = -\\boldsymbol{\\mu}\\cdot\\bold{B} \n\nSince the particle is stationary, there is no translational kinetic energy of the dipole, so the Hamiltonian of the dipole is just the potential energy:\n\n\\hat{H} = -\\boldsymbol{\\mu}\\cdot\\bold{B} \n\nFor a Spin-½ particle, the corresponding spin magnetic moment is:Physics of Atoms and Molecules, B.H. Bransden, C.J.Joachain, Longman, 1983, \n\n\\boldsymbol{\\mu}_S = \\frac{g_s e}{2m} \\bold{S} \n\nwhere gs is the spin gyromagnetic ratio (a.k.a. \"spin g-factor\"), e is the electron charge, S is the spin operator vector, whose components are the Pauli matrices, hence\n\n\\hat{H} = \\frac{g_s e}{2m} \\bold{S} \\cdot\\bold{B} \n\nCharged particle in an electromagnetic field\n\nFor a charged particle q in an electromagnetic field, described by the scalar potential φ and vector potential A, there are two parts to the Hamiltonian to substitute for. The momentum operator must be replaced by the kinetic momentum operator, which includes a contribution from the A field:\n\n\\bold{\\hat{\\Pi}} = \\bold{\\hat{P}} - q\\bold{A} \n\nwhere \\bold{\\hat{P}} is the canonical momentum operator given as the usual momentum operator:\n\n\\bold{\\hat{P}} = -i\\hbar\\nabla \n\nso the corresponding kinetic energy operator is:\n\n\\hat{T} \\frac{\\bold{\\hat{\\Pi}}\\cdot\\bold{\\hat{\\Pi}}}{2m} \n \\frac{1}{2m} \\left ( \\bold{\\hat{P}} - q\\bold{A} \\right)^2 \n\nand the potential energy, which is due to the φ field:\n\nV = q\\phi \n\nCasting all of these into the Hamiltonian gives:\n\n\\hat{H} = \\frac{1}{2m} \\left ( -i\\hbar\\nabla - q\\bold{A} \\right)^2 + q\\phi \n\nEnergy eigenket degeneracy, symmetry, and conservation laws\n\nIn many systems, two or more energy eigenstates have the same energy. A simple example of this is a free particle, whose energy eigenstates have wavefunctions that are propagating plane waves. The energy of each of these plane waves is inversely proportional to the square of its wavelength.  A wave propagating in the x direction is a different state from one propagating in the y direction, but if they have the same wavelength, then their energies will be the same. When this happens, the states are said to be degenerate.\n\nIt turns out that degeneracy occurs whenever a nontrivial unitary operator U commutes with the Hamiltonian. To see this, suppose that |a\\rang is an energy eigenket. Then U|a\\rang is an energy eigenket with the same eigenvalue, since\n\nUH |a\\rangle U E_a|a\\rangle \n E_a (U|a\\rangle) = H \\; (U|a\\rangle). \n\nSince U is nontrivial, at least one pair of |a\\rang and U|a\\rang must represent distinct states. Therefore, H has at least one pair of degenerate energy eigenkets. In the case of the free particle, the unitary operator which produces the symmetry is the rotation operator, which rotates the wavefunctions by some angle while otherwise preserving their shape.\n\nThe existence of a symmetry operator implies the existence of a conserved observable. Let G be the Hermitian generator of U:\n\n U = I - i \\epsilon G + O(\\epsilon^2) \\,\n\nIt is straightforward to show that if U commutes with H, then so does G:\n\n [H, G] = 0 \\,\n\nTherefore,\n\n\\frac{\\part}{\\part t} \\langle\\psi(t)|G|\\psi(t)\\rangle\n= \\frac{1}{i\\hbar} \\langle\\psi(t)|[G,H]|\\psi(t)\\rangle \n= 0.\n\nIn obtaining this result, we have used the Schrödinger equation, as well as its dual,\n\n \\langle\\psi (t)|H = - i \\hbar {\\partial\\over\\partial t} \\langle\\psi(t)|.\n\nThus, the expected value of the observable G is conserved for any state of the system. In the case of the free particle, the conserved quantity is the angular momentum.\n\nHamilton's equations\n\nHamilton's equations in classical Hamiltonian mechanics have a direct analogy in quantum mechanics. Suppose we have a set of basis states \\left\\{\\left| n \\right\\rangle\\right\\}, which need not necessarily be eigenstates of the energy. For simplicity, we assume that they are discrete, and that they are orthonormal, i.e.,\n\n \\langle n' | n \\rangle = \\delta_{nn'}\n\nNote that these basis states are assumed to be independent of time. We will assume that the Hamiltonian is also independent of time.\n\nThe instantaneous state of the system at time t, \\left| \\psi\\left(t\\right) \\right\\rangle, can be expanded in terms of these basis states:\n\n |\\psi (t)\\rangle = \\sum_{n} a_n(t) |n\\rangle \n\nwhere\n\n a_n(t) = \\langle n | \\psi(t) \\rangle. \n\nThe coefficients an(t) are complex variables. We can treat them as coordinates which specify the state of the system, like the position and momentum coordinates which specify a classical system. Like classical coordinates, they are generally not constant in time, and their time dependence gives rise to the time dependence of the system as a whole.\n\nThe expectation value of the Hamiltonian of this state, which is also the mean energy, is\n\n \\langle H(t) \\rangle \\ \\stackrel{\\mathrm{def}}{=}\\  \\langle\\psi(t)|H|\\psi(t)\\rangle\n= \\sum_{nn'} a_{n'}^* a_n \\langle n'|H|n \\rangle \n\nwhere the last step was obtained by expanding \\left| \\psi\\left(t\\right) \\right\\rangle in terms of the basis states.\n\nEach an(t) actually corresponds to two independent degrees of freedom, since the variable has a real part and an imaginary part. We now perform the following trick: instead of using the real and imaginary parts as the independent variables, we use an(t) and its complex conjugate an*(t). With this choice of independent variables, we can calculate the partial derivative\n\n\\frac{\\partial \\langle H \\rangle}{\\partial a_{n'}^{*}}\n= \\sum_{n} a_n \\langle n'|H|n \\rangle\n= \\langle n'|H|\\psi\\rangle\n\nBy applying Schrödinger's equation and using the orthonormality of the basis states, this further reduces to\n\n\\frac{\\partial \\langle H \\rangle}{\\partial a_{n'}^{*}}\n= i \\hbar \\frac{\\partial a_{n'}}{\\partial t} \n\nSimilarly, one can show that\n\n \\frac{\\partial \\langle H \\rangle}{\\partial a_n}\n= - i \\hbar \\frac{\\partial a_{n}^{*}}{\\partial t} \n\nIf we define \"conjugate momentum\" variables πn by\n\n \\pi_{n}(t) = i \\hbar a_n^*(t) \n\nthen the above equations become\n\n \\frac{\\partial \\langle H \\rangle}{\\partial \\pi_n} \\frac{\\partial a_n}{\\partial t},\\quad \\frac{\\partial \\langle H \\rangle}{\\partial a_n} \n - \\frac{\\partial \\pi_n}{\\partial t} \n\nwhich is precisely the form of Hamilton's equations, with the a_ns as the generalized coordinates, the \\pi_ns as the conjugate momenta, and \\langle H\\rangle taking the place of the classical Hamiltonian. Hamiltonian (quantum mechanics). http://en.wikipedia.org/?curid=14381."
  }
}
