{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12639",
  "eid" : "03d70680-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778515688,
  "textBody" : "Galilee (, transliteration HaGalil); , translit. al-Jalīl)  is a region in northern Israel. The term Galilee traditionally refers to the mountainous part, divided into Upper Galilee ( Galil Elyon) and Lower Galilee ( Galil Tahton). In the modern common usage, Galilee refers to all of the area that is beyond Mount Carmel to the northeast, extending from Dan to the north, at the base of Mount Hermon, along Mount Lebanon to the ridges of Mount Carmel and Mount Gilboa north of Jenin to the south, and from the Jordan Rift Valley to the east across the plains of the Jezreel Valley and Acre to the shores of the Mediterranean Sea and the coastal plain in the west, including Beth Shean's valley, Sea of Galilee's valley, and Hula Valley, although it usually does not include Haifa's immediate northern suburbs. By this definition it overlaps with much of the administrative Northern District of the country (which also includes the Golan Heights and part of Menashe Heights but not Qiryat Tiv'on). Western Galilee ( Galil Ma'aravi) is a common term referring to the western part of the Upper Galilee and its shore, and usually also the northwestern part of the Lower Galilee, mostly overlapping with Acre sub district. Galilee Panhandle is a common term referring to the \"panhandle\" in the east that extends to the north, where Lebanon is to the west, and includes Hula Valley and Ramot Naftali mountains of the Upper Galilee. Historically, the part of Southern Lebanon south of the east-west section of the Litani River also belonged to the region of Galilee, but the present article mainly deals with the Israeli part of the region.\n\nEtymology\n\nThe region's Israelite name is from the Hebrew root galil, an ultimately unique word for \"district\", and usually \"circle\". The Hebrew form used in Isaiah 8:23 (or 9:1 in different Biblical versions) is in the construct state, \"g'lil hagoyim\", meaning \"Galilee of the Nations\", i.e. the part of Galilee inhabited by Gentiles at the time that the book was written.\n\nThe region in turn gave rise to the English name for the \"Sea of Galilee\" referred to as such in many languages including ancient Arabic. In the Hebrew language, the lake is referred to as Kinneret (Numbers 34:11, etc.), from Hebrew kinnor, \"harp\", describing its shape, Lake of Gennesaret (Luke 5:1, etc.), from Ginosar (Hebrew) ge, \"valley\", and either netser, \"branch\", or natsor, \"to guard\", \"to watch\" (the name which may have been a reference to Nazareth town, alternatively renamed the Sea of Tiberias (John 6:1, etc.), from the town of Tiberias at its southwestern end, named after the Greek Tiberius following the first-century CE Roman Emperor's Greek derived name. These are the three names used in originally internal Jewish-authored literature rather than the \"Sea of Galilee\".Room, Adrian, 2nd Ed. (2006) [https://books.google.com/books?id\nM1JIPAN-eJ4C&pgPA140&lpg\nPA140&dqgalilee+conquered+gauls&source\nbl&otsidxrJYKTTL&sig\nPlXKpRFZRYK2RRT2W3vsMq5Baxw&hlen&ei\n85FiTZWcBIX0swODupTFCA&saX&oi\nbook_result&ctresult&resnum\n1&ved=0CBYQ6AEwAA# p. 138.] However, Jews did use \"the Galilee\" to refer to the whole region (Aramaic הגלילי), including its lake.\n\nGeography\n\nMost of Galilee consists of rocky terrain, at heights of between 500 and 700 m. Several high mountains are in the region, including Mount Tabor and Mount Meron, which have relatively low temperatures and high rainfall. As a result of this climate, flora and fauna thrive in the region, while many birds annually migrate from colder climates to Africa and back through the Hula–Jordan corridor. The streams and waterfalls, the latter mainly in Upper Galilee, along with vast fields of greenery and colourful wildflowers, as well as numerous towns of biblical importance, make the region a popular tourist destination.\n\nDue to its high rainfall 900 mm–1200 mm, mild temperatures and high mountains (Mount Meron's elevation is 1,000–1,208 m), the upper Galilee region contains some distinctive flora and fauna: prickly juniper (Juniperus oxycedrus), Lebanese cedar (Cedrus libani), which grows in a small grove on Mount Meron, cyclamens, paeonias, and Rhododendron ponticum which sometimes appears on Meron.\n\nHistory\n\nAncient times\n\nAccording to the Bible, Galilee was named by the Israelites and was the tribal region of Naphthali and Dan, at times overlapping the Tribe of Asher's land. However, Dan was dispersed among the whole people rather than isolated to the lands of Dan, as the Tribe of Dan was the hereditary local law enforcement and judiciary for the whole nation.Gen. 49:16 earliest reference among others Normally, Galilee is just referred to as Naphthali.\n\nChapter 9 of 1 Kings states that Solomon rewarded his Phoenician ally, King Hiram I of Sidon, with twenty cities in the land of Galilee, which would then have been either settled by foreigners during and after the reign of Hiram, or by those who had been forcibly deported there by later conquerors such as the Assyrians. Hiram, to reciprocate previous gifts given to David, accepted the upland plain among the mountains of Naphtali and renamed it \"the land of Cabul\" for a time.History of Phoenicia, by George Rawlinson 1889, \"Phoenicia under the hegemony of Tyre (B.C. 1252–877)\"\n\nClassical antiquity\n\nIn Roman times, the client kingdom of Judea was divided into Judea, Samaria, the Paralia (Palestine), and Galilee, which comprised the whole northern section of the country, and was the largest of the three regions under the Tetrarchy (Judea). After Judea became a Roman province in 6 CE, Galilee briefly became a part of it, then separated from it for two to three centuries.\n\nThe Galilee region was presumably the home of Jesus during at least 30 years of his life. Much of the first three Gospels of the New Testament give an account of Jesus' public ministry in this province, particularly in the towns of Nazareth and Capernaum. Galilee is also cited as the place where Jesus performed many public miracles, including curing a blind man. After the death of Jesus, some accounts suggest his disciples returned to Galilee and their experience of His resurrection took place there.Mark 14:28 and 16:7\n\nMany of the important Tannaim, the Rabbinic sages whose views are recorded in the Mishnah and Talmud, claim to have also spent their lives there, including Honi Ha-Ma'agel, Jose the Galilean, and Ishmael the Galilean, among many others. Traditional rabbinic sources assert that the followers of the rabbis from the Galilee were widely reputed to believe their teachers (rabbis) were miracle workers, as opposed to those from Judea, Persia, and Babylon, who rarely are credited with miracles. Many are cited for their large number of students and followers throughout the Jewish peopleMishnah Ta'anit 3:8 is one example in it Honi prays for rain, dancing and drawing circles and geometric patterns, on behalf of the Jewish agricultural community, and receiving rain [http://www.mechon-mamre.org/b/h/h29.htm] for the original Mishnah's Hebrew of one version of that story. Honi does other miracles for the people of the Galilee elsewhere in Jewish lore. among the common people. The Galilee among the Jewish population was known as a wellspring of miracle workers and mystical philosophers of all types, especially just prior to the major split between Jesus' followers and those who opposed Jesus. According to the Talmud, one of the most important founders of the modern Jewish faith, Johanan ben Zakai, was born there. Simeon bar Yochai, one of the most famed of all the Tannaim, hid from the Romans in the Galilee, and dug tunnels there to hide. Many miracles are ascribed to him during his Galilean period after escaping Judea proper. In medieval Hebrew legend, he may have written the Zohar while there.\n\nThe archaeological discoveries of synagogues from the Hellenistic and Roman period in the Galilee show strong Phoenician influences, and a high level of tolerance for other cultures,\nrelative to other Jewish sacred sites from the period, the latter being \"cleansed of impurities\". Eastern Galilee retained a Jewish majority until at least the seventh century.\n\nMiddle Ages\n\nAfter the Arab caliphate took control of the region in 638, it became part of Jund al-Urdunn (District of Jordan). Its major towns were Tiberias (which was capital of the district—Qadas), Baysan, Acre, Saffuriya, and Kabul.Le Strange, Guy. (1890) [https://books.google.com/books?id\nENANAAAAIAAJ&pgPA493&dq\nLajjun+Guy+le+Strange&lr&ei\n-0MmScyML4TkygTn-J2KAg#PPA26,M1 Palestine Under the Moslems] pp. 30–32.\n\nThe Shia Fatimids conquered the region in the 10th century; a breakaway sect, venerating the Fatimid caliph al-Hakim, formed the Druze religion, centered in Mount Lebanon and partially Galilee. During the Crusades, Galilee was organized into the Principality of Galilee, one of the most important Crusader seigneuries.\n\nOttoman era\n\nDuring Early Ottoman era, the Galilee was governed as the Safad Sanjak, initially part of the larger administrative unit of Damascus Eyalet (1549–1660) and later as part of Sidon Eyalet (1660–1864). During the 18th century, the administrative division of Galilee was renamed to Acre Sanjak, and the Eyalet itself became centered in Acre, factually becoming the Acre Eyalet between 1775 and 1841.\n\nThe Jewish population of Galilee increased significantly following their expulsion from Spain and welcome from the Ottoman Empire. The community for a time made Safed an international center of cloth weaving and manufacturing, as well as a key site for Jewish learning. Today it remains one of Judaism's four holy cities and a center for kabbalah.\n\nIn mid-17th century Galilee and Mount Lebanon became the scene of the Druze power struggle, which came in parallel with much destruction in the region and decline of major cities.\n\nIn the mid-18th century, Galilee was caught up in a struggle between the Arab leader Zahir al-Umar and the Ottoman authorities who were centred in Damascus. Zahir ruled Galilee for 25 years until Ottoman loyalist Jezzar Pasha conquered the region in 1775.\n\nIn 1831, the Galilee, a part of Ottoman Syria, switched hands from Ottomans to Ibrahim Pasha of Egypt until 1840. During this period, aggressive social and politic policies were introduced, which led to a violent 1834 Arab revolt. In the process of this revolt the Jewish community of Safed was greatly reduced, in the event of Safed Plunder by the rebels. The Arab rebels were subsequently defeated by the Egyptian troops, though in 1838, the Druze of Galilee led another uprising. In 1834 and 1837, major earthquakes leveled most of the towns, resulting in great loss of life.\n\nFollowing the 1864 Tanszimat reforms in the Ottoman Empire, the Galilee remained within Acre Sanjak, but was transferred from Sidon Eyalet to the newly formed Syria Vilayet and shortly, from 1888, became administered from Beirut Vilayet.\n\nIn 1866, Galilee's first hospital, the Nazareth Hospital, was founded under the leadership of American-Armenian missionary Dr. Kaloost Vartan, assisted by German missionary John Zeller.\n\nIn the early 20th century, Galilee remained part of Acre Sanjak of Ottoman Syria. It was administered as the southernmost territory of the Beirut Vilayet.\n\nBritish administration and Israeli rule\n\nFollowing the defeat of the Ottoman Empire in World War I, and the Armistice of Mudros, it came under British rule, as part of the Occupied Enemy Territory Administration. Shortly after, in 1920, the region was included in the British Mandate territory, officially a part of Mandatory Palestine from 1923.\n\nAfter the 1948 Arab–Israeli war, nearly the whole of Galilee came under Israel's control. A large portion of the population fled or was forced to leave, leaving dozens of entire villages empty; however, a large Israeli Arab community remained based in and near the cities of Nazareth, Acre, Tamra, Sakhnin, and Shefa-'Amr, due to some extent to a successful rapprochement with the Druze. The kibbutzim around the Sea of Galilee were sometimes shelled by the Syrian army's artillery until Israel seized the Golan Heights in the 1967 Six-Day War.\n\nDuring the 1970s and the early 1980s, the Palestine Liberation Organization (PLO) launched several attacks on towns and villages of the Upper and Western Galilee from Lebanon. Israel initiated Operation Litani (1979) and Operation Peace For Galilee (1982) with the stated objectives of destroying the PLO infrastructure in Lebanon and protecting the citizens of the Galilee. Israel occupied much of southern Lebanon until 1985, when it withdrew to a narrow security buffer zone.\n\nUntil 2000, Hezbollah, and earlier Amal, continued to fight the Israel Defense Forces, sometimes shelling Upper Galilee communities with Katyusha rockets. In May 2000, Israeli prime minister Ehud Barak unilaterally withdrew IDF troops from southern Lebanon, maintaining a security force on the Israeli side of the international border recognized by the United Nations. However, clashes between Hezbollah and Israel continued along the border, and UN observers condemned both for their attacks.\n\nThe 2006 Israel-Lebanon conflict was characterized by round-the-clock Katyusha rocket attacks (with a greatly extended range) by Hezbollah on the whole of Galilee, with long-range, ground-launched missiles hitting as far south as the Sharon Plain, Jezreel Valley, and Jordan Valley below the Sea of Galilee.\n\nDemography\n\nThe largest cities in the region are Acre, Nahariya, Nazareth, Safed, Karmiel, Shaghur, Shefa-'Amr, Afula, and Tiberias. The port city of Haifa serves as a commercial center for the whole region.\n\nBecause of its hilly terrain, most of the people in the Galilee live in small villages connected by relatively few roads. A railroad runs south from Nahariya along the Mediterranean coast, and a fork to the east is due to operate in 2015. The main sources of livelihood throughout the area are agriculture and tourism. Industrial parks are being developed, bringing further employment opportunities to the local population which includes many recent immigrants. The Israeli government is contributing funding to the private initiative, the Galilee Finance Facility, organised by the Milken Institute and Koret Economic Development Fund.\n\nThe Galilee is home to a large Arab population, comprising a Muslim majority and two smaller populations, of Druze and Arab Christians, of comparable sizes. Both Israeli Druze and Christians have their majorities in the Galilee. Other notable minorities are the Bedouin, the Maronites and the Circassians.\n\nThe north-central portion of the Galilee is also known as Central Galilee, stretching from the border with Lebanon to the northern edge of the Jezreel Valley, including the cities of Nazareth and Sakhnin, has an Arab majority of 75% with most of the Jewish population living in hilltop cities like Upper Nazareth. The northern half of the central Lower Galilee, surrounding Karmiel and Sakhnin is known as the \"Heart of the Galilee\". The eastern Galilee is nearly 100% Jewish. This part includes the Finger of the Galilee, the Jordan River Valley, and the shores the Sea of Galilee, and contains two of Judaism's Four Holy Cities. The southern part of the Galilee, including Jezreel Valley, and the Gilboa region are also nearly 100% Jewish, with a few small Arab villages near the West Bank border. About 80% of the population of the Western Galilee is Jewish, all the way up to the Lebanese border. Jews also form a small majority in the mountainous Upper Galilee with a significant minority Arab population (mainly Druze and Christians).\n\nThe Jewish Agency has attempted to increase the Jewish population in this area, but the non-Jewish population also has a high growth rate, , there were 1.2 million residents in Galilee, of which 47% were Jewish.\n\nCurrently, the Galilee is attracting significant internal migration of Haredi Jews, who are increasingly moving to the Galilee and Negev as an answer to rising housing prices in central Israel.\n\nTourism\n\nGalilee is a popular destination for domestic and foreign tourists who enjoy its scenic, recreational, and gastronomic offerings. The Galilee attracts many Christian pilgrims, as many of the miracles of Jesus occurred, according to the New Testament, on the shores of the Sea of Galilee—including his walking on water, calming the storm, and feeding five thousand people in Tabgha. In addition, numerous sites of biblical importance are located in the Galilee, such as Megiddo, Jezreel Valley, Mount Tabor, Hazor, Horns of Hattin, and more.\n\nA popular hiking trail known as the yam leyam, or sea-to-sea, starts hikers at the Mediterranean. They then hike through the Galilee mountains, Tabor, Neria, and Meron, until their final destination, the Kinneret (Sea of Galilee).\n\nIn April 2011, Israel unveiled the \"Jesus Trail\", a 40-mile (60-km) hiking trail in the Galilee for Christian pilgrims. The trail includes a network of footpaths, roads, and bicycle paths linking sites central to the lives of Jesus and his disciples, including Tabgha, the traditional site of Jesus' miracle of the loaves and fishes, and the Mount of Beatitudes, where he delivered his Sermon on the Mount. It ends at Capernaum on the shores of the Sea of Galilee, where Jesus espoused his teachings.\n\nMany kibbutzim and moshav families operate Zimmern (German: \"rooms\", the local term for a Bed and breakfasts). Numerous festivals are held throughout the year, especially in the autumn and spring holiday seasons. These include the Acre (Acco) Festival of Alternative Theater, the olive harvest festival, music festivals featuring Anglo-American folk, klezmer, Renaissance, and chamber music, and Karmiel Dance Festival.\n\nCuisine\n\nThe cuisine of the Galilee is very diverse. The meals are lighter than in the central and southern regions. Dairy products are heavily consumed (especially the Safed cheese that originated in the mountains of the Upper Galilee). Herbs like thyme, mint, parsley, basil, and rosemary are very common with everything including dips, meat, fish, stews and cheese.\nIn the eastern part of the Galilee, freshwater fish as much as meat (especially the tilapia that lives in the Sea of Galilee, Jordan river, and other streams in the region), fish filled with thyme and grilled with rosemary to flavor, or stuffed with oregano leaves, then topped with parsley and served with lemon to squash. This technique exists in other parts of the country including the coasts of the Mediterranean and the Red Sea. A specialty of the region is a baked Tilapia flavored with celery, mint and a lot of lemon juice. Baked fish with tahini is also common in Tiberias while the coastal Galileans prefer to replace the tahini with yogurt and add sumac on top.\n\nThe Galilee is famous for its olives, pomegranates, wine and especially its Labneh w'Za'atar which is served with pita bread, meat stews with wine, pomegranates and herbs such as akub, parsley, khalmit, mint, fennel, etc. are common. Galilean kubba is usually flavored with cumin, cinnamon, cardamom, concentrated pomegranate juice, onion, parsley and pine nuts and served as meze with tahini dip.\nKebabs are also made almost in the same way with sumac replacing cardamom and with carob sometimes replacing the pomegranate juice.\nBecause of its climate, beef has become more popular than lamb, although both are still eaten there.\nDates are popular in the tropical climate of the Eastern Galilee.\n\nSubregions\n\nThe Galilee is often divided into these subregions:\n* Lower Galilee covers the area north of the Valleys (Jezreel, Harod and Beth Shean Valley) and south of the Beit HaKerem Valley. Its borders to the east on the Jordan Rift Valley. It contains the Arab village of Cana.\n* Upper Galilee extends from the Beit HaKerem Valley northwards into southern Lebanon. Its eastern border is the Hula Valley and the Sea of Galilee separating it from the Golan Heights. To the west it reaches to the Coastal Plain which separates it from the Mediterranean.\n* The Jezreel Valley\n* Jordan Valley\n* Valley of Beit She'an\n* Sea of Galilee and its valley\n* The Hula Valley\n* Mount Gilboa\n* Western Galilee in its minimal definition refers to the coastal plain just west of the Upper Galilee, also known as Plain of Asher, or Plain of the Galilee, which stretches from north of Acre to Rosh HaNikra on the Israel-Lebanon border, and in the common broad definition adds the western part of Upper Galilee, and usually the northwestern part of Lower Galilee as well, corresponding more or less to Acre sub district or the Northern District.\n* The \"Galilee Panhandle\" (, Etzba HaGalil, lit. \"Finger of Galilee\") is a panhandle along the Hulah Valley; it contains the towns of Metulla and Qiryat Shemona, and the Dan and Banias rivers.\n\nGallery",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Galilee" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12639" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Galilee (, transliteration HaGalil); , translit. al-Jalīl)  is a region in northern Israel. The term Galilee traditionally refers to the mountainous part, divided into Upper Galilee ( Galil Elyon) and Lower Galilee ( Galil Tahton). In the modern common usage, Galilee refers to all of the area that is beyond Mount Carmel to the northeast, extending from Dan to the north, at the base of Mount Hermon, along Mount Lebanon to the ridges of Mount Carmel and Mount Gilboa north of Jenin to the south, and from the Jordan Rift Valley to the east across the plains of the Jezreel Valley and Acre to the shores of the Mediterranean Sea and the coastal plain in the west, including Beth Shean's valley, Sea of Galilee's valley, and Hula Valley, although it usually does not include Haifa's immediate northern suburbs. By this definition it overlaps with much of the administrative Northern District of the country (which also includes the Golan Heights and part of Menashe Heights but not Qiryat Tiv'on). Western Galilee ( Galil Ma'aravi) is a common term referring to the western part of the Upper Galilee and its shore, and usually also the northwestern part of the Lower Galilee, mostly overlapping with Acre sub district. Galilee Panhandle is a common term referring to the \"panhandle\" in the east that extends to the north, where Lebanon is to the west, and includes Hula Valley and Ramot Naftali mountains of the Upper Galilee. Historically, the part of Southern Lebanon south of the east-west section of the Litani River also belonged to the region of Galilee, but the present article mainly deals with the Israeli part of the region.\n\nEtymology\n\nThe region's Israelite name is from the Hebrew root galil, an ultimately unique word for \"district\", and usually \"circle\". The Hebrew form used in Isaiah 8:23 (or 9:1 in different Biblical versions) is in the construct state, \"g'lil hagoyim\", meaning \"Galilee of the Nations\", i.e. the part of Galilee inhabited by Gentiles at the time that the book was written.\n\nThe region in turn gave rise to the English name for the \"Sea of Galilee\" referred to as such in many languages including ancient Arabic. In the Hebrew language, the lake is referred to as Kinneret (Numbers 34:11, etc.), from Hebrew kinnor, \"harp\", describing its shape, Lake of Gennesaret (Luke 5:1, etc.), from Ginosar (Hebrew) ge, \"valley\", and either netser, \"branch\", or natsor, \"to guard\", \"to watch\" (the name which may have been a reference to Nazareth town, alternatively renamed the Sea of Tiberias (John 6:1, etc.), from the town of Tiberias at its southwestern end, named after the Greek Tiberius following the first-century CE Roman Emperor's Greek derived name. These are the three names used in originally internal Jewish-authored literature rather than the \"Sea of Galilee\".Room, Adrian, 2nd Ed. (2006) [https://books.google.com/books?id\nM1JIPAN-eJ4C&pgPA140&lpg\nPA140&dqgalilee+conquered+gauls&source\nbl&otsidxrJYKTTL&sig\nPlXKpRFZRYK2RRT2W3vsMq5Baxw&hlen&ei\n85FiTZWcBIX0swODupTFCA&saX&oi\nbook_result&ctresult&resnum\n1&ved=0CBYQ6AEwAA# p. 138.] However, Jews did use \"the Galilee\" to refer to the whole region (Aramaic הגלילי), including its lake.\n\nGeography\n\nMost of Galilee consists of rocky terrain, at heights of between 500 and 700 m. Several high mountains are in the region, including Mount Tabor and Mount Meron, which have relatively low temperatures and high rainfall. As a result of this climate, flora and fauna thrive in the region, while many birds annually migrate from colder climates to Africa and back through the Hula–Jordan corridor. The streams and waterfalls, the latter mainly in Upper Galilee, along with vast fields of greenery and colourful wildflowers, as well as numerous towns of biblical importance, make the region a popular tourist destination.\n\nDue to its high rainfall 900 mm–1200 mm, mild temperatures and high mountains (Mount Meron's elevation is 1,000–1,208 m), the upper Galilee region contains some distinctive flora and fauna: prickly juniper (Juniperus oxycedrus), Lebanese cedar (Cedrus libani), which grows in a small grove on Mount Meron, cyclamens, paeonias, and Rhododendron ponticum which sometimes appears on Meron.\n\nHistory\n\nAncient times\n\nAccording to the Bible, Galilee was named by the Israelites and was the tribal region of Naphthali and Dan, at times overlapping the Tribe of Asher's land. However, Dan was dispersed among the whole people rather than isolated to the lands of Dan, as the Tribe of Dan was the hereditary local law enforcement and judiciary for the whole nation.Gen. 49:16 earliest reference among others Normally, Galilee is just referred to as Naphthali.\n\nChapter 9 of 1 Kings states that Solomon rewarded his Phoenician ally, King Hiram I of Sidon, with twenty cities in the land of Galilee, which would then have been either settled by foreigners during and after the reign of Hiram, or by those who had been forcibly deported there by later conquerors such as the Assyrians. Hiram, to reciprocate previous gifts given to David, accepted the upland plain among the mountains of Naphtali and renamed it \"the land of Cabul\" for a time.History of Phoenicia, by George Rawlinson 1889, \"Phoenicia under the hegemony of Tyre (B.C. 1252–877)\"\n\nClassical antiquity\n\nIn Roman times, the client kingdom of Judea was divided into Judea, Samaria, the Paralia (Palestine), and Galilee, which comprised the whole northern section of the country, and was the largest of the three regions under the Tetrarchy (Judea). After Judea became a Roman province in 6 CE, Galilee briefly became a part of it, then separated from it for two to three centuries.\n\nThe Galilee region was presumably the home of Jesus during at least 30 years of his life. Much of the first three Gospels of the New Testament give an account of Jesus' public ministry in this province, particularly in the towns of Nazareth and Capernaum. Galilee is also cited as the place where Jesus performed many public miracles, including curing a blind man. After the death of Jesus, some accounts suggest his disciples returned to Galilee and their experience of His resurrection took place there.Mark 14:28 and 16:7\n\nMany of the important Tannaim, the Rabbinic sages whose views are recorded in the Mishnah and Talmud, claim to have also spent their lives there, including Honi Ha-Ma'agel, Jose the Galilean, and Ishmael the Galilean, among many others. Traditional rabbinic sources assert that the followers of the rabbis from the Galilee were widely reputed to believe their teachers (rabbis) were miracle workers, as opposed to those from Judea, Persia, and Babylon, who rarely are credited with miracles. Many are cited for their large number of students and followers throughout the Jewish peopleMishnah Ta'anit 3:8 is one example in it Honi prays for rain, dancing and drawing circles and geometric patterns, on behalf of the Jewish agricultural community, and receiving rain [http://www.mechon-mamre.org/b/h/h29.htm] for the original Mishnah's Hebrew of one version of that story. Honi does other miracles for the people of the Galilee elsewhere in Jewish lore. among the common people. The Galilee among the Jewish population was known as a wellspring of miracle workers and mystical philosophers of all types, especially just prior to the major split between Jesus' followers and those who opposed Jesus. According to the Talmud, one of the most important founders of the modern Jewish faith, Johanan ben Zakai, was born there. Simeon bar Yochai, one of the most famed of all the Tannaim, hid from the Romans in the Galilee, and dug tunnels there to hide. Many miracles are ascribed to him during his Galilean period after escaping Judea proper. In medieval Hebrew legend, he may have written the Zohar while there.\n\nThe archaeological discoveries of synagogues from the Hellenistic and Roman period in the Galilee show strong Phoenician influences, and a high level of tolerance for other cultures,\nrelative to other Jewish sacred sites from the period, the latter being \"cleansed of impurities\". Eastern Galilee retained a Jewish majority until at least the seventh century.\n\nMiddle Ages\n\nAfter the Arab caliphate took control of the region in 638, it became part of Jund al-Urdunn (District of Jordan). Its major towns were Tiberias (which was capital of the district—Qadas), Baysan, Acre, Saffuriya, and Kabul.Le Strange, Guy. (1890) [https://books.google.com/books?id\nENANAAAAIAAJ&pgPA493&dq\nLajjun+Guy+le+Strange&lr&ei\n-0MmScyML4TkygTn-J2KAg#PPA26,M1 Palestine Under the Moslems] pp. 30–32.\n\nThe Shia Fatimids conquered the region in the 10th century; a breakaway sect, venerating the Fatimid caliph al-Hakim, formed the Druze religion, centered in Mount Lebanon and partially Galilee. During the Crusades, Galilee was organized into the Principality of Galilee, one of the most important Crusader seigneuries.\n\nOttoman era\n\nDuring Early Ottoman era, the Galilee was governed as the Safad Sanjak, initially part of the larger administrative unit of Damascus Eyalet (1549–1660) and later as part of Sidon Eyalet (1660–1864). During the 18th century, the administrative division of Galilee was renamed to Acre Sanjak, and the Eyalet itself became centered in Acre, factually becoming the Acre Eyalet between 1775 and 1841.\n\nThe Jewish population of Galilee increased significantly following their expulsion from Spain and welcome from the Ottoman Empire. The community for a time made Safed an international center of cloth weaving and manufacturing, as well as a key site for Jewish learning. Today it remains one of Judaism's four holy cities and a center for kabbalah.\n\nIn mid-17th century Galilee and Mount Lebanon became the scene of the Druze power struggle, which came in parallel with much destruction in the region and decline of major cities.\n\nIn the mid-18th century, Galilee was caught up in a struggle between the Arab leader Zahir al-Umar and the Ottoman authorities who were centred in Damascus. Zahir ruled Galilee for 25 years until Ottoman loyalist Jezzar Pasha conquered the region in 1775.\n\nIn 1831, the Galilee, a part of Ottoman Syria, switched hands from Ottomans to Ibrahim Pasha of Egypt until 1840. During this period, aggressive social and politic policies were introduced, which led to a violent 1834 Arab revolt. In the process of this revolt the Jewish community of Safed was greatly reduced, in the event of Safed Plunder by the rebels. The Arab rebels were subsequently defeated by the Egyptian troops, though in 1838, the Druze of Galilee led another uprising. In 1834 and 1837, major earthquakes leveled most of the towns, resulting in great loss of life.\n\nFollowing the 1864 Tanszimat reforms in the Ottoman Empire, the Galilee remained within Acre Sanjak, but was transferred from Sidon Eyalet to the newly formed Syria Vilayet and shortly, from 1888, became administered from Beirut Vilayet.\n\nIn 1866, Galilee's first hospital, the Nazareth Hospital, was founded under the leadership of American-Armenian missionary Dr. Kaloost Vartan, assisted by German missionary John Zeller.\n\nIn the early 20th century, Galilee remained part of Acre Sanjak of Ottoman Syria. It was administered as the southernmost territory of the Beirut Vilayet.\n\nBritish administration and Israeli rule\n\nFollowing the defeat of the Ottoman Empire in World War I, and the Armistice of Mudros, it came under British rule, as part of the Occupied Enemy Territory Administration. Shortly after, in 1920, the region was included in the British Mandate territory, officially a part of Mandatory Palestine from 1923.\n\nAfter the 1948 Arab–Israeli war, nearly the whole of Galilee came under Israel's control. A large portion of the population fled or was forced to leave, leaving dozens of entire villages empty; however, a large Israeli Arab community remained based in and near the cities of Nazareth, Acre, Tamra, Sakhnin, and Shefa-'Amr, due to some extent to a successful rapprochement with the Druze. The kibbutzim around the Sea of Galilee were sometimes shelled by the Syrian army's artillery until Israel seized the Golan Heights in the 1967 Six-Day War.\n\nDuring the 1970s and the early 1980s, the Palestine Liberation Organization (PLO) launched several attacks on towns and villages of the Upper and Western Galilee from Lebanon. Israel initiated Operation Litani (1979) and Operation Peace For Galilee (1982) with the stated objectives of destroying the PLO infrastructure in Lebanon and protecting the citizens of the Galilee. Israel occupied much of southern Lebanon until 1985, when it withdrew to a narrow security buffer zone.\n\nUntil 2000, Hezbollah, and earlier Amal, continued to fight the Israel Defense Forces, sometimes shelling Upper Galilee communities with Katyusha rockets. In May 2000, Israeli prime minister Ehud Barak unilaterally withdrew IDF troops from southern Lebanon, maintaining a security force on the Israeli side of the international border recognized by the United Nations. However, clashes between Hezbollah and Israel continued along the border, and UN observers condemned both for their attacks.\n\nThe 2006 Israel-Lebanon conflict was characterized by round-the-clock Katyusha rocket attacks (with a greatly extended range) by Hezbollah on the whole of Galilee, with long-range, ground-launched missiles hitting as far south as the Sharon Plain, Jezreel Valley, and Jordan Valley below the Sea of Galilee.\n\nDemography\n\nThe largest cities in the region are Acre, Nahariya, Nazareth, Safed, Karmiel, Shaghur, Shefa-'Amr, Afula, and Tiberias. The port city of Haifa serves as a commercial center for the whole region.\n\nBecause of its hilly terrain, most of the people in the Galilee live in small villages connected by relatively few roads. A railroad runs south from Nahariya along the Mediterranean coast, and a fork to the east is due to operate in 2015. The main sources of livelihood throughout the area are agriculture and tourism. Industrial parks are being developed, bringing further employment opportunities to the local population which includes many recent immigrants. The Israeli government is contributing funding to the private initiative, the Galilee Finance Facility, organised by the Milken Institute and Koret Economic Development Fund.\n\nThe Galilee is home to a large Arab population, comprising a Muslim majority and two smaller populations, of Druze and Arab Christians, of comparable sizes. Both Israeli Druze and Christians have their majorities in the Galilee. Other notable minorities are the Bedouin, the Maronites and the Circassians.\n\nThe north-central portion of the Galilee is also known as Central Galilee, stretching from the border with Lebanon to the northern edge of the Jezreel Valley, including the cities of Nazareth and Sakhnin, has an Arab majority of 75% with most of the Jewish population living in hilltop cities like Upper Nazareth. The northern half of the central Lower Galilee, surrounding Karmiel and Sakhnin is known as the \"Heart of the Galilee\". The eastern Galilee is nearly 100% Jewish. This part includes the Finger of the Galilee, the Jordan River Valley, and the shores the Sea of Galilee, and contains two of Judaism's Four Holy Cities. The southern part of the Galilee, including Jezreel Valley, and the Gilboa region are also nearly 100% Jewish, with a few small Arab villages near the West Bank border. About 80% of the population of the Western Galilee is Jewish, all the way up to the Lebanese border. Jews also form a small majority in the mountainous Upper Galilee with a significant minority Arab population (mainly Druze and Christians).\n\nThe Jewish Agency has attempted to increase the Jewish population in this area, but the non-Jewish population also has a high growth rate, , there were 1.2 million residents in Galilee, of which 47% were Jewish.\n\nCurrently, the Galilee is attracting significant internal migration of Haredi Jews, who are increasingly moving to the Galilee and Negev as an answer to rising housing prices in central Israel.\n\nTourism\n\nGalilee is a popular destination for domestic and foreign tourists who enjoy its scenic, recreational, and gastronomic offerings. The Galilee attracts many Christian pilgrims, as many of the miracles of Jesus occurred, according to the New Testament, on the shores of the Sea of Galilee—including his walking on water, calming the storm, and feeding five thousand people in Tabgha. In addition, numerous sites of biblical importance are located in the Galilee, such as Megiddo, Jezreel Valley, Mount Tabor, Hazor, Horns of Hattin, and more.\n\nA popular hiking trail known as the yam leyam, or sea-to-sea, starts hikers at the Mediterranean. They then hike through the Galilee mountains, Tabor, Neria, and Meron, until their final destination, the Kinneret (Sea of Galilee).\n\nIn April 2011, Israel unveiled the \"Jesus Trail\", a 40-mile (60-km) hiking trail in the Galilee for Christian pilgrims. The trail includes a network of footpaths, roads, and bicycle paths linking sites central to the lives of Jesus and his disciples, including Tabgha, the traditional site of Jesus' miracle of the loaves and fishes, and the Mount of Beatitudes, where he delivered his Sermon on the Mount. It ends at Capernaum on the shores of the Sea of Galilee, where Jesus espoused his teachings.\n\nMany kibbutzim and moshav families operate Zimmern (German: \"rooms\", the local term for a Bed and breakfasts). Numerous festivals are held throughout the year, especially in the autumn and spring holiday seasons. These include the Acre (Acco) Festival of Alternative Theater, the olive harvest festival, music festivals featuring Anglo-American folk, klezmer, Renaissance, and chamber music, and Karmiel Dance Festival.\n\nCuisine\n\nThe cuisine of the Galilee is very diverse. The meals are lighter than in the central and southern regions. Dairy products are heavily consumed (especially the Safed cheese that originated in the mountains of the Upper Galilee). Herbs like thyme, mint, parsley, basil, and rosemary are very common with everything including dips, meat, fish, stews and cheese.\nIn the eastern part of the Galilee, freshwater fish as much as meat (especially the tilapia that lives in the Sea of Galilee, Jordan river, and other streams in the region), fish filled with thyme and grilled with rosemary to flavor, or stuffed with oregano leaves, then topped with parsley and served with lemon to squash. This technique exists in other parts of the country including the coasts of the Mediterranean and the Red Sea. A specialty of the region is a baked Tilapia flavored with celery, mint and a lot of lemon juice. Baked fish with tahini is also common in Tiberias while the coastal Galileans prefer to replace the tahini with yogurt and add sumac on top.\n\nThe Galilee is famous for its olives, pomegranates, wine and especially its Labneh w'Za'atar which is served with pita bread, meat stews with wine, pomegranates and herbs such as akub, parsley, khalmit, mint, fennel, etc. are common. Galilean kubba is usually flavored with cumin, cinnamon, cardamom, concentrated pomegranate juice, onion, parsley and pine nuts and served as meze with tahini dip.\nKebabs are also made almost in the same way with sumac replacing cardamom and with carob sometimes replacing the pomegranate juice.\nBecause of its climate, beef has become more popular than lamb, although both are still eaten there.\nDates are popular in the tropical climate of the Eastern Galilee.\n\nSubregions\n\nThe Galilee is often divided into these subregions:\n* Lower Galilee covers the area north of the Valleys (Jezreel, Harod and Beth Shean Valley) and south of the Beit HaKerem Valley. Its borders to the east on the Jordan Rift Valley. It contains the Arab village of Cana.\n* Upper Galilee extends from the Beit HaKerem Valley northwards into southern Lebanon. Its eastern border is the Hula Valley and the Sea of Galilee separating it from the Golan Heights. To the west it reaches to the Coastal Plain which separates it from the Mediterranean.\n* The Jezreel Valley\n* Jordan Valley\n* Valley of Beit She'an\n* Sea of Galilee and its valley\n* The Hula Valley\n* Mount Gilboa\n* Western Galilee in its minimal definition refers to the coastal plain just west of the Upper Galilee, also known as Plain of Asher, or Plain of the Galilee, which stretches from north of Acre to Rosh HaNikra on the Israel-Lebanon border, and in the common broad definition adds the western part of Upper Galilee, and usually the northwestern part of Lower Galilee as well, corresponding more or less to Acre sub district or the Northern District.\n* The \"Galilee Panhandle\" (, Etzba HaGalil, lit. \"Finger of Galilee\") is a panhandle along the Hulah Valley; it contains the towns of Metulla and Qiryat Shemona, and the Dan and Banias rivers.\n\nGallery. Galilee. http://en.wikipedia.org/?curid=12639."
  }
}
