{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14651",
  "eid" : "16954de0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778547134,
  "textBody" : "Since independence, Indonesia foreign relations have adhered to a \"free and active\" foreign policy, seeking to play a role in regional affairs commensurate with its size and location but avoiding involvement in conflicts among major powers. Indonesian foreign policy under the \"New Order\" government of President Suharto moved away from the stridently anti-Western, anti-American posturing that characterised the latter part of the Sukarno era. Following Suharto's ouster in 1998, Indonesia's government has preserved the broad outlines of Suharto's independent, moderate foreign policy. Preoccupation with domestic problems has not prevented successive presidents from travelling abroad and Indonesia's participation in many international fora.\n\nIndonesia's relations with the international community were strained as a result of its invasion of neighbouring East Timor in December 1975, the subsequent annexation and occupation, the independence referendum in 1999 and the resulting violence afterwards. As one of the founding members of Association of Southeast Asian Nations (ASEAN), established in 1967, and also as the largest country in Southeast Asia, Indonesia has put ASEAN as the cornerstone of its foreign policy and outlook. After the transformation from Suharto's regime to a relatively open and democratic country in the 21st century, Indonesia today exercises its influence to promote co-operation, development, democracy, security, peace and stability in the region through its leadership in ASEAN.\n\nIndonesia managed to play a role as a peacemaker in the Cambodia-Thailand conflict over the Preah Vihear temple. Indonesia and other ASEAN member countries collectively have also played a role in encouraging the government of Myanmar to open up its political system and introduce other reforms more quickly.\n\nGiven its geographic and demographic size, rising capabilities and diplomatic initiatives, scholars have labelled Indonesia to be one Asia-Pacific's middle powers.\n\nSignificant international memberships\n\nASEAN\n\nA cornerstone of Indonesia's contemporary foreign policy is its participation in the Association of Southeast Asian Nations (ASEAN), of which it was a founding member in 1967 with Thailand, Malaysia, Singapore, and the Philippines. Since then, Brunei, Vietnam, Laos, Burma, and Cambodia also have joined ASEAN. While organised to promote common economic, social, and cultural goals, ASEAN acquired a security dimension after Vietnam's invasion of Cambodia in 1979; this aspect of ASEAN expanded with the establishment of the ASEAN Regional Forum in 1994, which comprises 22 countries, including the US\n\nIndonesian national capital Jakarta is also the seat of ASEAN Secretariat, located at Jalan Sisingamangaraja No.70A, Kebayoran Baru, South Jakarta. Other than serving their diplomatic missions for Indonesia, numbers of foreign embassies and diplomatic mission in Jakarta are also accredited to ASEAN. ASEAN Headquarter has led to the prominence of Jakarta as a diplomatic hub in Southeast Asia.\n\nIn the late 1990s to early 2000s, Indonesia's continued domestic troubles have distracted it from ASEAN matters and consequently lessened its influence within the organisation. However, after the politics and economic transformation, from the turmoil of 1998 Reformasi to the relatively open and democratic civil society with rapid economic growth in the 2010s, Indonesia returned to the region's diplomatic stage by assuming its leadership role in ASEAN in 2011.  Indonesia is viewed to have weight, international legitimacy and global appeal to draw support and attention from around the world to ASEAN. Indonesia believes that ASEAN can contribute positively to the global community, by promoting economic development and co-operation, improving security, peace, stability of ASEAN, and making the Southeast Asia region far from conflicts.\n\nIndonesia's bilateral relations with three neighboring fellow ASEAN members — Malaysia, Singapore, and Vietnam — are not without challenges. If not managed properly would result in mutual mistrust and suspicion, thus hindering bilateral and regional cooperation. In the era of rising Indonesia which might asserts its leadership role within ASEAN, the problem could become greater. Nevertheless, the rise of Indonesia should be regarded in the sense of optimism. First, although Indonesia is likely to become assertive, the general tone of its foreign policy are mainly liberal and accommodating. The consolidation of Indonesian democratic government played a key role and influence in ASEAN. The second, institutional web of ASEAN will sustain engagements and regular meeting between regional elites, thus deepening their mutual understanding and personal connections.\n\nNon-Aligned Movement\n\nIndonesia also was one of the founders of the Non-Aligned Movement (NAM) and has taken moderate positions in its councils. As NAM Chairman in 1992-95, it led NAM positions away from the rhetoric of North-South confrontation, advocating instead the broadening of North-South co-operation in the area of development. Indonesia continues to be a prominent, and generally helpful, leader of the Non-Aligned Movement.\n\nOrganization of Islamic Cooperation\n\nIndonesia has the world's largest Muslim population, and is a member of the Organisation of Islamic Cooperation (OIC). It carefully considers the interests of Islamic solidarity in its foreign policy decisions but generally has been an influence for moderation in the OIC. President Abdurrahman Wahid has pursued better relations with Israel, and in August 2000 he met with former Israeli Prime Minister Shimon Peres. However, as of January 2006, there's no formal diplomacy link between Indonesia and Israel. As such, Indonesia, alongside its Malaysian neighbour, conducts its foreign relations with Israel through Singapore.[http://www.asiamedia.ucla.edu/article.asp?parentid=59785 AsiaMedia :: INDONESIA: Israel starts website in Indonesian]\n\nAPEC\n\nIndonesia has been a strong supporter of the Asia-Pacific Economic Cooperation (APEC) forum. Largely through the efforts of President Suharto at the 1994 meeting in Bogor, Indonesia, APEC members agreed to implement free trade in the region by 2010 for industrialised economies and 2020 for developing economies. As the largest economy in Southeast Asia, Indonesia also belongs to another economic groupings such as G-20 major economies (G-20) and Developing 8 Countries (D-8).\n\nG-20 major economies\n\nIn 2008, Indonesia was admitted as a member of the G20, as the only ASEAN member state to be included in the group. Through its membership in the global economic powerhouse that accounted of 85 percent of global economy, Indonesia is keen to position itself as a mouthpiece for ASEAN countries, and as a representative of the developing world within the G-20.\n\nIGGI and CGI\n\nAfter 1966, Indonesia welcomed and maintained close relations with the donor community, particularly the United States, western Europe, Australia, and Japan, through the Inter-Governmental Group on Indonesia (IGGI) and its successor, the Consultative Group on Indonesia (CGI), which have provided substantial foreign economic assistance. Problems in Timor and Indonesia's reluctance to implement economic reform, have complicated Indonesia's relationship with donors.\n\nInternational disputes\n\nIndonesia has numerous outlying and remote islands, which some are inhabited by many pirate groups that regularly attack ships in the Strait of Malacca in the north, and illegal fishing crews known for penetrating Australian and Filipino waters.[http://www.afma.gov.au/management/compliance/illegal/default.htm afma.gov.au]; [http://www.abc.net.au/worldtoday/content/2006/s1637120.htm abc.net.au] While Indonesian waters itself is the target of many illegal fishing activities by numerous foreign vessels.\n\nIndonesia has some present and historic territorial disputes with neighboring nations, such as:\n* Ambalat Block in dispute with Malaysia (ongoing, overlapping EEZ line drawn by both countries)\n* Ashmore and Cartier Islands in dispute with Australia (ongoing, the islands known by Indonesians as Pulau Pasir)\n* Fatu Sinai Island (Pulau Batek) formerly disputed with East Timor (settled, East Timor ceded the island to Indonesia in August 2004)\n* Miangas (Las Palmas) formerly disputed with Philippine Islands (settled, see Island of Palmas Case)\n* Northern waters off Natuna Islands in dispute with China and Taiwan (ongoing; overlapping with Chinese Nine-Dash Line claim)\n* Sipadan and Ligitan Islands formerly disputed with Malaysia (settled, part of Malaysia's territory per International Court of Justice's decision in 2002)\n\nWithin ASEAN countries \n\nIndonesia considers ASEAN as cornerstone of its foreign policy, through exercising its regional power and influence in peaceful and constructive manner among ASEAN countries.\n\nBrunei \n\nRepublic of Indonesia established diplomatic relations with Brunei Darussalam on 1 January 1984. Brunei Darussalam was recognised by Jakarta on independence in 1984.\nAlthough they do not share a direct land border, Indonesia and Brunei share the island of Borneo. Overall relations between the two countries were progressing well and that both sides continued to enjoy strong ties in a wide spectrum of co-operations; including trade and investment, tourism, agriculture, marine and fisheries, health, defence, transnational crimes, education, youth, culture and people-to-people contacts.\n\nCambodia \n\nThe relationship between ancient Indonesia and Cambodia dated back from the kingdom of Chenla and Javan Sailendra also Srivijaya; it was mentioned that king Jayavarman II had resided for some times in Java during the reign of Sailendras, and in 802 declare sovereignty of Cambodia from Java and proclaimed himself as universal monarch thus started the Angkor period.\n\nDuring the Sukarno reign in the 1960s, the president of Indonesia has visited Cambodia and vice versa prince Norodom Sihanouk also visited Indonesia.\nIn 1992, Indonesia is among the countries that provides troops for United Nations Transitional Authority in Cambodia. Indonesia also supported Cambodia membership to ASEAN in 1999. Indonesia also among the countries that provide aid to Angkor restoration project, especially the three main gates of Angkor Royal Palace archaeological site near Phimeanakas site. Indonesia is also appointed as observer in Cambodian–Thai border dispute.\n\nLaos \n\nSince established diplomatic relations on 1957, both countries enjoys cordial relations. Indonesia have an embassy in Vientiane, while Laos have an embassy in Jakarta. Indonesia supported and welcomed Laotian membership to the Association of Southeast Asian Nations (ASEAN) in 1997. Laos and Indonesia agreed to enhance relations to focus on exploring the potential of both countries to co-operate on trade and investment. The two countries expressed a desire to reach further agreements relating to security, tourism, sport, air transport and education. Indonesia through bilateral co-operation assist Laos on capacity building and development in various sectors, trough scholarships and trainings for Laotian students.\n\nMalaysia \n\n* Indonesia and Malaysia enjoy friendly relations. The populations of both countries have cordial relations and trade between the two countries has greatly increased over the years.\n* Indonesia has an embassy in Kuala Lumpur and consulate general in Johor Bahru, George Town, Kota Kinabalu and Kuching. Malaysia has an embassy in Jakarta and a consulate general in Medan and Pekanbaru.\n* Indonesia and Malaysia has same ethnic population that belongs to the Austronesian group and sharing the same language although minor differences in vocabulary.\n* Both countries are founding members of ASEAN and APEC. both countries are also members of the Non-Aligned Movement.\n* Relations were deteriorated under President Sukarno, whose opposition to the formation of Malaysia led to a confrontation between the two countries. However, relations were restored following a government transition in Indonesia.\n* Currently, both countries are in a territorial dispute over the oil rich islands of Ambalat. Previously, they were over territorial disputes over the islands of Ligitan and Sipadan, which were won by Malaysia.\n* The Indonesian migrant workers (Indonesian: TKI/Tenaga Kerja Indonesia) have become the important issue between both countries. The problems concerning migrant workers such as illegal immigration, crime, human trafficking, abuse, poor treatment and extortion upon migrant workers. Since 2009 Indonesia has temporarily stop sending domestic workers to Malaysia until both countries agree on ways to protect them.[https://archive.is/20120904091244/http://www.monstersandcritics.com/news/asiapacific/news/article_1485858.php/Report_Indonesia_to_halt_sending_workers_to_Malaysia Indonesia to halt sending workers to Malaysia] Indonesia will resume sending migrant workers to Malaysia in May 2011 as both countries will sign a memorandum of understanding (MoU) about worker protection by the end of April 2011.\n\nMyanmar\n\n*Both Indonesia and Myanmar are promoting the two countries trade volume. The trade volume is estimated to reach up to $1 billion in 2016.\n*Indonesia has offered to purchase 300,000 tons of rice from Myanmar, with prospects of buying more in the future.\n*Indonesia supports Myanmar's democratisation process.\n\nPhilippines \n\n* Indonesia and the Philippines are both archipelagic country and same ethnic population that belongs to the Austronesian group.\n* Both countries established their bilateral and diplomatic relations in 1949. The Indonesian Government has opened its Consular office in Manila but it was not until the mid-1950s that an Embassy was established headed by an Ambassador.\n* A treaty of friendship was signed in 1951. This Treaty constituted the basic relationship of both countries, covering several aspects such as maintenance of peace and friendship, settlement of disputes by diplomatic and peaceful means, traffic arrangements for citizens of both countries and activities to promote co-operation in the area of trade and cultural, which include the political, social-economic and security matters of both countries.\n* Both countries are members of the East ASEAN Growth Triangle together with Brunei Darussalam and Malaysia in the BIMP-EAGA.\n* Both countries peacefully settled their maritime borders after 20 years of diplomatic talks.\n* Both countries have high cooperation in fields of economy, tourism, culture, and defense.\n\nSingapore \n\n* In August 2005, Singapore and Indonesia signed a memorandum of understanding to expand aviation rights between the two countries.\n* On 3 October 2005, Prime Minister Lee Hsien Loong met Indonesian President Susilo Bambang Yudhoyono in Bali, just two days after the Bali bombings. They agreed to strengthen the fight against terrorism and also discussed co-operation in the fields of economy, trade and investment.\n* Relations with Indonesia are generally good, though current outstanding issues include the bans on the export of sand, and granite; both of which Singapore's construction industry is reliant on.\n\nThailand \n\n* Indonesia is Thailand's third most important trade partner within ASEAN, with bilateral trade worth $8.7 billion in 2007. Trade between the two countries is set to grow over the years.\n\nVietnam \n\n* Formal relations started in 1955 for the consulate general level. Soedibjo Wirjowerdojo (former chargé d'affaires of Indonesian Embassy in Peking, China from year of 1953 - 1955) was appointed to be The First Indonesian Consul General to Vietnam, and located in Hanoi.\n* Vietnam and Indonesia are both members of ASEAN.\n* President Megawati Sukarnoputri of Indonesia visited Vietnam in June 2003.  At this time the two countries signed a \"Declaration on the Framework of Friendly and Comprehensive Cooperation Entering the 21st Century\".\n* In May 2005 President Susilo Bambang Yudhoyono of Indonesia visited Vietnam.\n* In the December of the same year festivities were organised in the respective capital cities to celebrate the 50th anniversary of the establishment of diplomatic ties.\n* http://english.vovnews.vn/Home/Vietnam-Indonesia-aim-for-allround-co-operation-development/20062/37663.vov\n\nOceania \n\nAustralia \n\nSince Indonesian independence, the two countries have maintained mutual diplomatic relations, formalised co-operation (especially in the fields of fisheries conservation, law enforcement, and justice co-operation), a measure of security co-operation, broadening treaty relationships, co-membership of regional forums, and co-participation in several multilateral Treaties of significance. Trade between the two countries has grown over the years.\n\nRecent years have seen a deepening of Australia's aid commitment to Indonesia, and Australia has become a popular venue for Indonesian students.http://www.dfat.gov.au/media/speeches/foreign/1996/austindo.html see reference to '12000 students' from Indonesia\n\nIn 2008-09, Indonesia is the largest recipient of Australian aid at a value of AUD462 million.\n\nIndonesia has an embassy in Canberra and consulate general in Melbourne, Perth and Sydney, While Australia has an embassy in Jakarta and consulate in Medan, Makassar, Surabaya and Bali.\n\nFiji \n\nNew Zealand \n\nHaving common interests as democracies and neighbours in the Asia-Pacific region, New Zealand and Indonesia are viewed as natural partners.\n Both countries are members of APEC. Indonesia and New Zealand officially established diplomatic relations in 1958, the diplomatic and economic ties have grown stronger ever since. New Zealand has an embassy in Jakarta and Indonesia has an embassy in Wellington. Indonesia’s commodity exports to New Zealand consist mainly of energy products and minerals as well as lumber and agriculture, while New Zealand's commodity exports to Indonesia mainly consists of dairy products and meats, such as beef, milk, and cheese.\n\nPapua New Guinea \n\nIndonesia shares a 760 km border with Papua New Guinea through its provinces of Papua and West Papua. The common border has raised tensions and ongoing diplomatic issues over many decades.\n\nIndonesia is represented in Papua New Guinea with an embassy in Port Moresby and a consulate in Vanimo.\n\nSolomon Islands \n\nAsia\n\nBangladesh\n\nIndonesia is the world largest Muslim country in terms of its population, whereas Bangladesh is the fourth largest Muslim country. Indonesia and Bangladesh are partners in Organisation of Islamic Cooperation and the Developing 8 Countries. Bangladesh has an embassy in Jakarta and a consulate in Padang, whereas Indonesia has an embassy in Dhaka. Since the official bilateral relations were established in 1972, both countries enjoy cordial and friendly relations.\n\nChina\n\nChina and Indonesia established diplomatic relations on 13 April 1950, which was suspended on 30 October 1967 due to the occurrence of the 30 September event of 1965. Indonesia also supports China on the Diaoyu (Senkaku) issue.\n\nThe bilateral relations began to ease since the 1980s. Foreign Minister Qian Qichen of China met with President Suharto and State Minister Moerdiono of Indonesia in 1989 to discuss the resumption of diplomatic relations of the two countries. In December 1989, the two sides held talks on the technical issues regarding the normalisation of bilateral relations and signed the Minutes. Foreign Minister Ali Alatas of Indonesia visited China on invitation in July 1990 and the two sides issued the Agreement on the Settlement of Indonesia's Debt Obligation to China and the Communique on the Resumption of Diplomatic Relations between the two countries. The two countries issued the \"Communiqué on the Restoration of Diplomatic Relations between the Two Countries\".\n\nPremier Li Peng visited Indonesia on invitation on 6 August 1990. In his talks with President Suharto, the two sides expressed their willingness to improve relations between the two countries on the basis of the Five Principles of Peaceful Co-Existence and the Ten Principles of the Bandung Conference. On 8 August, Foreign Ministers of China and Indonesia on behalf of their respective governments, signed the Memorandum of Understanding on the Resumption of Diplomatic Relations. The two sides declared the formal resumption of the diplomatic relations between China and Indonesia on that day.\n\nEast Timor \n\nEast Timor (officially named the Democratic Republic of Timor-Leste) and Indonesia share the island of Timor.  Indonesia invaded the former Portuguese colony in 1975 and annexed East Timor in 1976, maintaining East Timor as its 27th province until a United Nations-sponsored referendum in 1999, in which the people of East Timor chose independence. Following a United Nations interim administration, East Timor gained independence in 2002.\n\nDespite the traumatic past, relations with Indonesia are very good. Indonesia is by far the largest trading partner of East Timor (Approximately 50% of imports, 2005) and is steadily increasing its share.\n\nProblems to be solved include, East Timor-Indonesia Boundary Committee meetings to survey and delimit land boundary; and Indonesia is seeking resolution of East Timorese refugees in Indonesia.\n\nIndia\n\nIn 1950, Sukarno, Indonesian first president, called upon the peoples of Indonesia and India to \"intensify the cordial relations\" that had existed between the two countries \"for more than 1000 years\" before they had been \"disrupted\" by colonial powers.Foreign Policy of India:  Text of Documents 1947-59 (p.54) Fifteen years later in Djakarta, government-inspired mobs were shouting: \"Down with India, the servant of imperialists\" and \"Crush India, our enemy. \"I New York Times 10 September 1965 Yet in the spring of 1966, the foreign ministers of both countries began speaking again of an era of friendly relations. India had supported Indonesian independence and Nehru had raised the Indonesian question in the United Nations Security Council.\n\nIndia has an embassy in Jakarta and Indonesia operates an embassy in Delhi.http://www.indonesianembassy.org.in/\n\nIran\n\nIndonesia and Iran are Muslim-majority countries, despite the differences in its religious orientation. Indonesian has the largest Muslim Sunni population in the world, while Iran is a predominantly Shiite nation.\n\nAs Islamic countries that have among the largest Muslim populations in the world, Iran and Indonesia hold themselves responsible for promoting Islam as a peaceful religion. Diplomatic relations has been established since 1950. Indonesia has an embassy in Tehran, and Iran has an embassy in Jakarta. Both countries are full members of the World Trade Organization (WTO), The Non-Aligned Movement, Organisation of Islamic Cooperation (OIC), and Developing 8 Countries.\n\nJakarta had offered to help mediate the Iranian nuclear dispute, Jakarta is on good terms with Iran and other Middle East countries, as well as with the West.\n\nIraq\n\nIndonesia and Iraq share similarity as Muslim-majority countries. both countries share their experiences in rebuilding and development. Indonesia has an embassy in Baghdad, while Iraq has an embassy in Jakarta. Both countries are partners in multilateral organisations, such as World Trade Organization (WTO), The Non-Aligned Movement and Organisation of Islamic Cooperation (OIC).\n\nAfter World War II, Iraq was one of the first countries to recognise Indonesia’s independence in 1945. The two countries established diplomatic relations in 1950 and have signed around 15 agreements to boost bilateral ties. Indonesia has maintained its embassy in Baghdad during various crises, such as the Iraq-Iran War in the 1980s. However, at the height of the Iraq War, Indonesia was forced to temporarily closed its embassy in Baghdad in 2003, and reopen it in June 2011.\n\nIn 2003, the Indonesian government and people protested against a US-led military campaign against Baghdad. Over 50,000 Indonesian people crowded the streets of the Indonesian capital, Jakarta, on Sunday, 9 February 2003, to protest the United States' threat of military action against Iraq. After the war ended and Indonesia reopened its embassy in 2011, relations between the two countries have developed at a fast pace. Iraq invited Indonesia's companies to participate in the reconstruction of Iraq. Traditionally, Indonesia views Iraq as a source of energy resources, such as oil and gas. Iraqi people are familiar with Indonesian exported products such as: tires, soaps, spices, furniture, coal, clothing, palm oil, shoes, paper, automobiles, rubber, and electronic goods.\n\nJapan\n\n* Indonesia and Japan enjoy friendly relations.\n* Indonesia has an embassy in Tokyo and a consulate in Osaka. Japan has an embassy in Jakarta and consulates in Medan, Denpasar, Surabaya, and Makassar.\n* Japan is Indonesia's largest export partner.\n* Both countries are members of the G-20 major economies and APEC.\n\nJordan\n\n* Jordan and Indonesia often shares similar stances upon issues in the Middle East, such as the Syrian conflict and the Israeli–Palestinian conflict.\n* Indonesia is currently Jordan's largest trade partner in ASEAN.\n* Jordan have an embassy in Jakarta, while Indonesia have an embassy in Amman that also accredited to Palestine.\n* Both countries are the member of Organisation of Islamic Cooperation and Non-Aligned Movement.\n* Jordan serves as the gate for Indonesian Muslim and Christian pilgrims wishing to visit the holy sites in Palestine and Israel.\n\nNepal\n\nSince diplomatic relations were established in 1960, both countries enjoy friendly and cordial relations, although both parties have not established embassies in each counterparts' capitals. Indonesia only established an honorary consulate in Kathmandu, while its embassy in Dhaka, Bangladesh, is also accredited to Nepal. Nepal on the other hand accredited its embassy in Bangkok, Thailand, also to Indonesia. Both the countries have many cultural proximities and similar view on international issues. Both countries are also partners and founding members of the Non-Aligned Movement (NAM).\n\nNorth Korea\n\nIndonesia is one of the very few countries that still maintain cordial relations with North Korea, despite international sanctions and isolation applied upon North Korea concerning its human rights abuses and nuclear missile program. Indonesia has adopted what it calls a \"free-and-active\" foreign policy, which allows it to be consistent in counting on both North and South Korea as friends.\n\nBoth countries share a relationship that dates back to the Sukarno and Kim Il-sung era in the 60s. Indonesia has an embassy in Pyongyang, while North Korea has an embassy in Jakarta. both countries are members of the Non-Aligned Movement.\n\nAccording to a 2014 BBC World Service Poll, 28% of Indonesians view North Korea's influence positively, with 44% expressing a negative view. This shows a deterioration from previous year's poll where 42% of Indonesians view North Korea's influence positively, with 29% expressing a negative view.[http://downloads.bbc.co.uk/mediacentre/country-rating-poll.pdf 2014 World Service Poll] BBC[http://www.globescan.com/images/images/pressreleases/bbc2013_country_ratings/2013_country_rating_poll_bbc_globescan.pdf 2013 World Service Poll] BBC\n\nPakistan\n\n* Indonesia has its embassy in Islamabad and a Consulate in Karachi\n* Pakistan has its embassy in Jakarta and a Consulate in Medan.\n* Both countries are members of the Developing 8 (D-8) countries and the Next Eleven (N-11) Countries. They are also members of the Non-Aligned Movement (NAM) and the Organisation of Islamic Cooperation (OIC).\n* Bilateral trade between the two countries currently stand at $800 million but both countries are looking at increase this to $2 billion.\n\nSaudi Arabia \n\n*Saudi Arabia have an embassy in Jakarta, while Indonesia have an embassy in Riyadh and a consulate in Jeddah.\n*Saudi Arabia was one of the first countries to recognise Indonesia's independence.http://saudigazette.com.sa/article/161484/Broadening-Indonesia-Saudi-bilateral-relationshttps://www.kemlu.go.id/en/berita/berita-perwakilan/Pages/Broadening%20Indonesia-Saudi%20bilateral%20relations.aspx#\n*Both countries are the member of Organisation of Islamic Cooperation and G-20 major economies.\n*Indonesia sent the largest hajj pilgrims among Muslim-majority countries.\n*The balance of trade is heavily in favour of Saudi Arabia, because of its oil and gas exports to Indonesia.\n*Migrant worker abuse and death sentences faced by Indonesian workers in Saudi Arabia are the main problems that strained diplomatic relations between two countries.\n\nSouth Korea\n\n*Indonesia has an embassy in Seoul.\n*South Korea has an embassy in Jakarta.\n*Scale of bilateral trade between two nation is US$14.88 billion.\n*Both countries have invested in multiple joint military development projects including the KFX/IFX fighter jet.\n*South Korea firm Daewoo Shipbuilding and Marine Engineering (DSME) is in final contract negotiations to supply Indonesia with three Type-209 submarines. This will be the largest ever bilateral defence deal valued at USD1.1 billion.http://www.mofa.go.kr/ENG/countries/asiapacific/countries/20070802/1_24400.jsp?menu=m_30_10\n\nSri Lanka \n\n*Indonesia and Sri Lanka are the founder of the Non-Aligned Movement.\n*Since the diplomatic relations were established in 1952, both countries enjoys cordial and friendly relationship\n*Indonesia has an embassy in Colombo, while Sri Lanka has an embassy in Jakarta.\n\nTaiwan \n\nIndonesia and Taiwan (ROC) do not have diplomatic relations, both have only an unofficial relationship.\n\nTurkey\n\n* Relations with the Ottoman Empire (Turkey's predecessor state) began with the 16th century Ottoman expedition to Aceh, in with the response to the Aceh Sultanate's request for assistance against the Portuguese in Malacca\n* Indonesia has an embassy in Ankara.\n* Turkey has an embassy in Jakarta.\n* Both countries are full members of the World Trade Organization (WTO), Organisation of Islamic Cooperation (OIC), and the G-20 major economies.\n\nUnited Arab Emirates\n\n* The diplomatic relations between Indonesia and the United Arab Emirates are important because both share the solidarity as Muslim-majority countries, and both countries recognise the important role of each counterparts in the region.\n*Since the diplomatic relations established in 1976, both country enjoy friendly and cordial relationship.\n*Indonesia has an embassy in Abu Dhabi, while the United Arab Emirates has an embassy in Jakarta.\n*Both countries are partners in multilateral organisations, such as the World Trade Organization (WTO), Non-Aligned Movement and Organisation of Islamic Cooperation (OIC).\n*Indonesia uses the UAE as the main gate to enter the Gulf and Middle East market, Indonesia's export to UAE is the largest in the Middle East.\n*The Indonesian government has established the trade and investment representative office to promote its products in the United Arab Emirates and the entire Middle East region.\n\nPalestine\n\n* Indonesia has an embassy, non resident in Amman\n* Palestine has an embassy in Jakarta\n\nIsrael\n\nThe two countries maintain no formal diplomatic ties.\n\nEurope\n\nAustria\n\n* The bilateral relations between Austria an Indonesia officially established in 1954.\n* Austria recognises Indonesia as a stable and reliable partner, and both countries enjoy excellent relations.\n\n* The two countries have agreed to expand relations in business, trade and investment, tourism, culture, environment and green technology.\n\n* Austria has an embassy in Jakarta and consulates in Bandung and Surabaya, while Indonesia has an embassy in Vienna that also accredited to Slovenia as well as multilateral organisations; IAEA, PrepCom CTBTO, UNODC and UNOOSA.\n\nArmenia\n\n* Both countries established diplomatic relations on September 22, 1992.[http://www.mfa.am/en/country-by-country/id/]\n* Armenia has an embassy in Jakarta.\n* Indonesia has an honorary consulate in Yerevan.\n\nBulgaria\n\n* Bulgaria was among the States that recognised Indonesia's independence since its Proclamation of Independence on 17 August 1945.  Diplomatic relations started on 21 September 1956.\n* Bulgaria has had an embassy in Jakarta since October 1958\n* Indonesia has had an embassy in Sofia Since 1960.[http://www.indonesia.bg/bilateral%20bulgaria.htm Official Website of the Embassy of the Republic of Indonesia in Sofia, Bulgaria] .\n\nCyprus\n\n*  Diplomatic relations were established on 4 December 1987[http://www.olc.gov.cy/olc/olc.nsf/all/E9FE893C2708E0E1C22575D70024CE6E/$file/INDONESIA.pdf?openelement Ministry Foreign Affairs of Cyprus]\n* Cyprus is represented in Cyprus through its embassy in Canberra, Australia.[http://www.mfa.gov.cy/mfa/mfa2006.nsf/policy02_en/policy02_en?OpenDocument Ministry Foreign Affairs of Cyprus]\n* Indonesia is represented in Cyprus through its embassy in Rome, Italy.[http://www.mfa.gov.cy/mfa/mfa2006.nsf/All/D7A26A33A9B65E62C22571B500249940?OpenDocument Ministry Foreign Affairs of Cyprus]\n\nDenmark\n\nDenmark has an embassy in Jakarta, and Indonesia has an embassy in Copenhagen. Bilateral relations are strong.\n\nFrance \n\n*Indonesia has an embassy in Paris and France has an embassy in Jakarta\n*The relations between France and Indonesia have been increasing of late, while Indonesia has become increasingly strategic to the government and people of France.\n*There are 110 French multinational companies operated in Indonesia.\n*The relations between two countries are important as both are democratic republics and both holds significant geopolitical influences in each regions. France is indispensable member of European Union, as well as Indonesia for the Association of Southeast Asian Nations.\n*The diplomatic relation between France and Indonesia is also a key element for developing relations between Indonesia and the European Union and between France and the ASEAN.\n*Both countries are the member of G-20 major economies.\n\nFinland\n\n* Indonesia and Finland enjoy friendly relations. Nokia has a substantial share of the mobile phone market in Indonesia.\n\nGermany\n\n*Indonesia and Germany have traditionally enjoyed good, intensive and wide-ranging relations.\n*Germany and Indonesia, as the largest members of the European Union and the Association of Southeast Asian Nations (ASEAN), respectively, take similar positions on many issues relating to the development of the two regional organisations.\n\n*Indonesia has an embassy in Berlin\n*Germany has an embassy in Jakarta\n\nGreece\n\n* Diplomatic relations started in 1960.\n* The embassy of Indonesia in Athens was opened since 1994.\n* The embassy of Greece in Jakarta was opened in 1997.[http://www.greekembassy.or.id/  Greek embassy in Jakarta]\n* [http://www.mfa.gr/www.mfa.gr/en-US/Policy/Geographic+Regions/Asia+-+Oceania/Bilateral+Relations/Indonesia/  Greek Foreign Affairs Ministry about relations with Indonesia].\n\nHoly See\n\n* Indonesia, the world’s largest Muslim-majority country in terms of population, recognise Catholicism as one of its six approved religions.\n* The Holy See has an Apostolic Nunciature in Jakarta, while Indonesia has an embassy in Rome. \n* The Holy See recognised the Republic of Indonesia on 6 July 1947 and established an Apostolic delegate in the country. \n* Official relations was established in 1950 with the status of Apostolic Internunciatur. In December 1965, the status changed to Nunciatur Apostolic.\n* There have been two papal visits to Indonesia: those of Pope Paul VI in December 1970, and of Pope John Paul II in October 1989.\n\nItaly\n\n* Both countries has shown strong desire to improve their relations, especially in intercultural understanding and trade.\n* Indonesia recognises Italy's strategic location and important role in the middle of Mediterranean region, while Italy has favoured relations with Indonesia, and sees Indonesia as the leader in Southeast Asia.\n* The relations between two countries not only important to bridge the two regional communities; European Union and ASEAN, but also vital as intercultural and interfaith dialogue,\n* Indonesia has an embassy in Rome, that also accredited to Malta, Cyprus, San Marino, while Italy has an embassy in Jakarta.\n\nNetherlands \n\n*Indonesia–Netherlands relations refers to relations between Indonesia and the Netherlands. The relationship begun during the spice trade as Netherlands started a trading post in what is now Indonesia before colonising it as the Dutch East Indies.\n*The Indonesian military still sometimes buys equipment from the Dutch.\n*Indonesia has an embassy in The Hague.\n*The Netherlands has an embassy in Jakarta.\n*Indonesian consulate in Amsterdam is not in service anymore.\n\nPortugal\n\nIn 1999, Indonesia and Portugal restored diplomatic relations, which were broken off following the Indonesian invasion of East Timor in 1975.\n\n* Indonesia has an embassy in Lisbon.[http://kbri3.indonesianembassy-lisbon.net/en/home-mainmenu-1.html Indonesian embassy in Lisbon] \n* Portugal has an embassy in Jakarta.[http://www.embassyportugaljakarta.or.id/indexeng.htmEmbassy of Portugal]\n\nRomania\n\n* Indonesia has an embassy in Bucharest.\n* Romania has an embassy in Jakarta.\n\nRussia\n\n* Both Indonesia and Russia are members of the APEC.\n* Russia has an embassy in Jakarta.[http://www.indonesia.mid.ru/  Russian embassy in Jakarta]\n* Indonesia has an embassy in Moscow along with a consulate general in Saint Petersburg.[http://www.kbrimoskow.org/embassy/list_040107.htm Indonesian embassy in Moscow] \n* Early in the Cold War, both countries had very strong relations with Indonesian president Sukarno visiting Moscow and Soviet leader Nikita Khrushchev visiting Jakarta. When Sukarno was overthrown by General Suharto, relations between the two states were not as close as they were during Sukarno's times.\n* In late 2007, Indonesia purchased military weapons from Russia with long term payment. Both countries are also members of the G20 and APEC.\n\nSpain\n\n* Spain identifies Indonesia as their natural ally and has named Indonesia as one of their priority countries in their foreign relations with the Asian region. \n* Indonesia supports Spain in the Gibraltar issue.\n* Indonesia has an embassy in Madrid and consulates in Barcelona and Las Palmas, while Spain has an embassy in Jakarta and a consulate in Denpasar, Bali. \n* Today, the co-operation has expanded to various fields, from trade and culture to education and the defence technology sector. \n* Since the 1980s, Spain and Indonesia have embarked on a strategic partnership in aeronautics technology. Spain's CASA and Indonesia's IPTN (formerly known as Nurtanio) co-designed and co-produced the CASA/IPTN CN-235 medium transport aircraft.\n\nSwitzerland\n\n* In 2010 the heads of state of the two countries agreed to launch negotiations on a Comprehensive Economic Partnership Agreement (CEPA). \n* Switzerland has named Indonesia as one of seven priority countries for economic development co-operation.\n* Indonesia has an embassy in Bern, while Switzerland has an embassy in Jakarta, also accredited for East Timor and ASEAN.\n* On 6 December 1973, the Indonesian and Swiss governments signed an agreement to establish Polytechnic for Mechanics within the Bandung Institute of Technology at Bandung. Today, the Swiss Mechanics Polytechnic has transformed into Bandung State Polytechnic for Manufacture.\n\nUkraine\n\n* Indonesia recognised Ukraine’s independence in 1992 and established diplomatic relations in 1993. Indonesia has an embassy in Kiev.\n* Ukraine has an embassy in Jakarta.\n\nUnited Kingdom\n\nThe United Kingdom and Indonesia have maintained strong relations since formal relations were established in 1949.[http://ukinindonesia.fco.gov.uk/en/about-us/working-with-indonesia/uk-indo-relation UK-Indonesia relations]  Indonesia has an embassy in London,[http://www.indonesianembassy.org.uk/News/news_2010_03_27_jp_1.html News-Indonesianembassy]  the United Kingdom has an embassy in Jakarta and consulate in Surabaya and Medan.[http://ukinindonesia.fco.gov.uk/en/about-us/our-embassy/ Our embassy]\n\nThe Culture and Tourism Ministry of Indonesia launched a campaign to boost the number of tourists from the UK entering Indonesia. In 2009, 160,000 British tourists visited Indonesia, the aim of the campaign was to boost this number to 200,000.\n\nIn 2006 former British prime-minister Tony Blair met with Susilo Bambang Yudhoyono where they agreed upon \"the establishment of a regular Indonesia-UK Partnership Forum to be chaired by the Foreign Ministers, to promote strategic dialogue on bilateral, multilateral and global issues\". The first Indonesia-UK forum was held in 2007 and was chaired by British foreign minister Margaret Beckett and Indonesian foreign minister Hassan Wirajuda.\n\nIn March 2010 members of the House of Lords praised Indonesia for their progress in democratising society, media freedom and environmental protection.[http://www.deplu.go.id/Pages/News.aspx?IDP\n3265&len Ministry of Foreign Affairs - Members of the UK’s House of Lords praised Indonesia’s achievements]  In a meeting with Indonesian MP Hayono Isman, the Lords stated that they wanted to improve the relationship between the two countries.\n\nNorth America\n\nBelize\n\nBoth countries established diplomatic relations on 11 July 2014.http://www.guardian.bz/index.php?optioncom_content&id\n8103:belize-establishes-diplomatic-relations-with-indonesia-and-palestine\n\nCanada\n\n* Canada has an embassy in Jakarta (World Trade Centre I).[http://geo.international.gc.ca/asia/jakarta/menu-en.asp Canadian embassy in Jakarta]\n* Indonesia has an embassy in Ottawa (55 Parkdale Avenue) and consulates-general in Toronto (129 Jarvis Street) and Vancouver (1630 Alberni Street).\n* Both countries are full members of the G-20 major economies, of the Cairns Group and of the Asia-Pacific Economic Cooperation.\n\nMexico\n\n* The diplomatic relations was officially established in 1953,\n* Indonesia has an embassy in Mexico City, while Mexico has an embassy in Jakarta that also accredited to East Timor.\n* both countries sees their counterpart as their strategic partners in each regions.\n* Mexico has renewed its interest on Asia, sees Indonesia's strategic role in ASEAN, and willing to create an economic partnership agreement with Indonesia.\n* Both countries are partners in multilateral organisations such as the WTO, FEALAC, APEC and G-20.\n\nUnited States\n\nThe United States has important economic, commercial, and security interests in Indonesia. It remains a lynchpin of regional security due to its strategic location astride a number of key international maritime straits, particularly the Malacca Strait. Relations between Indonesia and the US are positive and have advanced since the election of President Yudhoyono in October 2004. The US played a role in Indonesian independence in the late 1940s and appreciated Indonesia's role as an anti-communist bulwark during the Cold War. Cooperative relations are maintained today, although no formal security treaties bind the two countries. The United States and Indonesia share the common goal of maintaining peace, security, and stability in the region and engaging in a dialogue on threats to regional security. Cooperation between the US and Indonesia on counter-terrorism has increased steadily since 2002, as terrorist attacks in Bali (October 2002 and October 2005), Jakarta (August 2003 and September 2004) and other regional locations demonstrated the presence of terrorist organisations, principally Jemaah Islamiyah, in Indonesia. The United States has welcomed Indonesia's contributions to regional security, especially its leading role in helping restore democracy in Cambodia and in mediating territorial disputes in the South China Sea.\n\nSouth America\n\nArgentina\n\n* Since the diplomatic relations established in 1956, the bilateral relations between Argentina and Indonesia were becoming increasingly more strategic.\n* Indonesia supports Argentina on the Malvinas issue.\n* Argentina has an embassy in Jakarta, while Indonesia has an embassy in Buenos Aires. \n* Both countries are members of Group of 77, the G-20 major economies, the G20 developing nations, and Forum of East Asia-Latin America Cooperation.\n* Indonesia is the second-largest destination for Argentine exports to Asia after China, and the largest one in Southeast Asia. While Argentina is South America's second-largest importer of Indonesian products after Brazil.\n\nBrazil\n\n* Brazil and Indonesia possess the largest tropical rainforest of the world\n that contains the world's richest biodiversity, which gave them a vital role in global environment issues, such as ensuring tropical forests protection.\n \n* Both countries leading the list of megadiverse countries with Indonesia second only to Brazil. \n* Brazil expects to expand its co-operation with Indonesia in many areas, including agriculture and high-technology industry.\n \n* Both countries are members of World Trade Organization (WTO), Forum of East Asia-Latin America Cooperation and the G-20 major economies. \n* By first quarter of 21st-century, both countries are expected to emerge as the rising global power.\n\nChile\n\nColombia\n\nCuba\n\n* During the administration Sukarno in the 1960s, Indonesia and Cuba enjoyed exceptionally close relationship. \n* The relations between two countries mostly focused on sports and health. \n* Cuba has an embassy in Jakarta, while Indonesia has an embassy in Havana that also accredited to the Commonwealth of the Bahamas and Jamaica. \n* Indonesia supports Cuba in the Guantanamo Bay issue.\n* both countries are full members of Group of 77, NAM and FEALAC.\n\nGuyana\n\nBoth countries established diplomatic relations on 27 August 1999.\n\nPeru\n\nSuriname\n\n* Indonesia and Suriname had a special relationship, based upon shared common history as former colonies of the Dutch Empire. \n* Large numbers of Javanese migrated to Suriname to work on plantations during the late 19th and early 20th-centuries. \n* Indonesia has an embassy in Paramaribo also accredited to Guyana, while Suriname has an embassy in Jakarta. \n* both countries committed to expand and improve their relations covering trade, agriculture and cultural sectors. \n* Indonesia and Suriname are partners in multilateral organisations such as the WTO and FEALAC.\n\nVenezuela\n\n* Since the diplomatic relations established in 1959, Indonesia and Venezuela enjoy friendly ties. \n* Indonesia supports Venezuela on the Guayana Esequiba issue.\n* both countries agreed to expand the trade and investment relations, especially in tourism, technology, chemicals and natural gas sectors. \n* Indonesia has an embassy in Caracas, while Venezuela has an embassy in Jakarta. \n* Indonesia and Venezuela are partners in multilateral organisations such as the WTO, NAM and FEALAC.\n\nAfrica\n\nAlgeria\n\n* The relationship between two countries is mostly founded on common religious and anti-colonialism solidarity, as Indonesia and Algeria are Muslim-majority countries that also once fell under colonialism. \n* Algeria recognised Indonesia's role on supporting their country on gaining independence in 1962. \n* Both countries agreed on expanding co-operations and strengthening relations. \n* Algeria has an embassy in Jakarta that also accredited to Singapore and Brunei Darussalam, while Indonesia has an embassy in Algiers. \n* both countries are members of the NAM, Group of 77 and OIC.\n\nCape Verde\n\nIndonesia is represented in Cape Verde by its embassy in Dakar[https://www.kemlu.go.id/dakar/en/Pages/Cape-Verde.aspx]. \n\nEgypt\n\n* Indonesia has an embassy in Cairo and Egypt has an embassy in Jakarta.\n* Egypt was one of the first countries to recognise Indonesia's independence.\n* Gamel Abdel Nasser of Egypt and Sukarno of Indonesia were two of the five founding members of the Non-Aligned Movement.\n* Both countries are members of the OIC, the Non-Aligned Movement, and the G20 developing nations.\n\nGuinea-Bissau\n\nBoth countries established diplomatic relations on December 12, 1996[https://www.kemlu.go.id/dakar/en/Pages/Guinea-Bissau.aspx]. \n\nKenya\n\n* Indonesia has an embassy in Nairobi, also accredited to Mauritius, Seychelles, and Uganda,  while Kenya did not establishes embassy in Indonesia yet, diplomatic relations with Indonesia is accredited to its embassy in Kuala Lumpur, Malaysia. \n* both countries are partners in multilateral organisations, such as the WTO and NAM.\n\nLiberia\n\n* The diplomatic relations was officially established in 1965, however it was not until 2013 that both leaders of each countries visited each other's to further the co-operations.\n\nLibya\n\n* Indonesia has an embassy in Tripoli and Libya has an embassy in Jakarta.\n* Both countries are members of the OIC and the Non-Aligned Movement.\n\nMadagascar\n\n* The ancestors of Madagascar people came from Indonesia, sailed across Indian Ocean, back in early 8th to 9th century CE.\n* Indonesia have an embassy in Antananarivo, while Madagascar do not established an embassy in Jakarta yet.\n* Malagasy language and Indonesian language shared similar words, such as hand: ˈtananə (Malagasy), tangan (Indonesian); skin: ˈhulitse (Malagasy), kulit (Indonesian); white: ˈfuti (Malagasy), putih (Indonesian).\n\nMorocco\n\n* Indonesia and Morocco shared similarity as the Muslim-majority countries.\n* Morocco praised Indonesia as a strong democratic nation, and pointed that both countries facing the same challenges of separatism and terrorism. \n* Diplomatic relations were established in 1960. Indonesia has an embassy in Rabat and a consulate in Casablanca, while Morocco has an embassy in Jakarta. \n* both countries are members of the WTO, NAM and OIC.\n\nNigeria\n\n* Indonesia has an embassy in Abuja and Nigeria has an embassy in Jakarta.\n* Both countries are members of the OIC, the Non-Aligned Movement, the G20 developing nations, and the Next Eleven.\n\nSouth Africa\n\n* Indonesia has an embassy in Pretoria and South Africa has an embassy in Jakarta.\n* Both countries are members of the G-20 major economies, the Non-Aligned Movement, and the G20 developing nations.\n\nTanzania\n\n* The relations between Indonesia and Tanzania are mostly in agriculture sector, where Indonesia provides training for Tanzanian farmers. \n* Indonesia has an embassy in Dar es Salaam, while Tanzania has a non-resident ambassador in Kuala Lumpur, Malaysia. \n* Both countries are members of multilateral organisations such as World Trade Organization (WTO), the Group of 77 and Non-Aligned Movement.\n\nTunisia\n\n* Tunisia and Indonesia are partners in capacity building and partnership for democracy. \n* Indonesia hails Tunisia as a shining example of democratic transition in Arab world. \n* The diplomatic relations dated back to the 1950s when Indonesia supports Tunisian independence from France.\n* Indonesia have an embassy in Tunis, while Tunisia have an embassy in Jakarta.\n* Both countries are the member of Organisation of Islamic Cooperation and Non-Aligned Movement.\n\nInternational organisation participation",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Indonesia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14651" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Since independence, Indonesia foreign relations have adhered to a \"free and active\" foreign policy, seeking to play a role in regional affairs commensurate with its size and location but avoiding involvement in conflicts among major powers. Indonesian foreign policy under the \"New Order\" government of President Suharto moved away from the stridently anti-Western, anti-American posturing that characterised the latter part of the Sukarno era. Following Suharto's ouster in 1998, Indonesia's government has preserved the broad outlines of Suharto's independent, moderate foreign policy. Preoccupation with domestic problems has not prevented successive presidents from travelling abroad and Indonesia's participation in many international fora.\n\nIndonesia's relations with the international community were strained as a result of its invasion of neighbouring East Timor in December 1975, the subsequent annexation and occupation, the independence referendum in 1999 and the resulting violence afterwards. As one of the founding members of Association of Southeast Asian Nations (ASEAN), established in 1967, and also as the largest country in Southeast Asia, Indonesia has put ASEAN as the cornerstone of its foreign policy and outlook. After the transformation from Suharto's regime to a relatively open and democratic country in the 21st century, Indonesia today exercises its influence to promote co-operation, development, democracy, security, peace and stability in the region through its leadership in ASEAN.\n\nIndonesia managed to play a role as a peacemaker in the Cambodia-Thailand conflict over the Preah Vihear temple. Indonesia and other ASEAN member countries collectively have also played a role in encouraging the government of Myanmar to open up its political system and introduce other reforms more quickly.\n\nGiven its geographic and demographic size, rising capabilities and diplomatic initiatives, scholars have labelled Indonesia to be one Asia-Pacific's middle powers.\n\nSignificant international memberships\n\nASEAN\n\nA cornerstone of Indonesia's contemporary foreign policy is its participation in the Association of Southeast Asian Nations (ASEAN), of which it was a founding member in 1967 with Thailand, Malaysia, Singapore, and the Philippines. Since then, Brunei, Vietnam, Laos, Burma, and Cambodia also have joined ASEAN. While organised to promote common economic, social, and cultural goals, ASEAN acquired a security dimension after Vietnam's invasion of Cambodia in 1979; this aspect of ASEAN expanded with the establishment of the ASEAN Regional Forum in 1994, which comprises 22 countries, including the US\n\nIndonesian national capital Jakarta is also the seat of ASEAN Secretariat, located at Jalan Sisingamangaraja No.70A, Kebayoran Baru, South Jakarta. Other than serving their diplomatic missions for Indonesia, numbers of foreign embassies and diplomatic mission in Jakarta are also accredited to ASEAN. ASEAN Headquarter has led to the prominence of Jakarta as a diplomatic hub in Southeast Asia.\n\nIn the late 1990s to early 2000s, Indonesia's continued domestic troubles have distracted it from ASEAN matters and consequently lessened its influence within the organisation. However, after the politics and economic transformation, from the turmoil of 1998 Reformasi to the relatively open and democratic civil society with rapid economic growth in the 2010s, Indonesia returned to the region's diplomatic stage by assuming its leadership role in ASEAN in 2011.  Indonesia is viewed to have weight, international legitimacy and global appeal to draw support and attention from around the world to ASEAN. Indonesia believes that ASEAN can contribute positively to the global community, by promoting economic development and co-operation, improving security, peace, stability of ASEAN, and making the Southeast Asia region far from conflicts.\n\nIndonesia's bilateral relations with three neighboring fellow ASEAN members — Malaysia, Singapore, and Vietnam — are not without challenges. If not managed properly would result in mutual mistrust and suspicion, thus hindering bilateral and regional cooperation. In the era of rising Indonesia which might asserts its leadership role within ASEAN, the problem could become greater. Nevertheless, the rise of Indonesia should be regarded in the sense of optimism. First, although Indonesia is likely to become assertive, the general tone of its foreign policy are mainly liberal and accommodating. The consolidation of Indonesian democratic government played a key role and influence in ASEAN. The second, institutional web of ASEAN will sustain engagements and regular meeting between regional elites, thus deepening their mutual understanding and personal connections.\n\nNon-Aligned Movement\n\nIndonesia also was one of the founders of the Non-Aligned Movement (NAM) and has taken moderate positions in its councils. As NAM Chairman in 1992-95, it led NAM positions away from the rhetoric of North-South confrontation, advocating instead the broadening of North-South co-operation in the area of development. Indonesia continues to be a prominent, and generally helpful, leader of the Non-Aligned Movement.\n\nOrganization of Islamic Cooperation\n\nIndonesia has the world's largest Muslim population, and is a member of the Organisation of Islamic Cooperation (OIC). It carefully considers the interests of Islamic solidarity in its foreign policy decisions but generally has been an influence for moderation in the OIC. President Abdurrahman Wahid has pursued better relations with Israel, and in August 2000 he met with former Israeli Prime Minister Shimon Peres. However, as of January 2006, there's no formal diplomacy link between Indonesia and Israel. As such, Indonesia, alongside its Malaysian neighbour, conducts its foreign relations with Israel through Singapore.[http://www.asiamedia.ucla.edu/article.asp?parentid=59785 AsiaMedia :: INDONESIA: Israel starts website in Indonesian]\n\nAPEC\n\nIndonesia has been a strong supporter of the Asia-Pacific Economic Cooperation (APEC) forum. Largely through the efforts of President Suharto at the 1994 meeting in Bogor, Indonesia, APEC members agreed to implement free trade in the region by 2010 for industrialised economies and 2020 for developing economies. As the largest economy in Southeast Asia, Indonesia also belongs to another economic groupings such as G-20 major economies (G-20) and Developing 8 Countries (D-8).\n\nG-20 major economies\n\nIn 2008, Indonesia was admitted as a member of the G20, as the only ASEAN member state to be included in the group. Through its membership in the global economic powerhouse that accounted of 85 percent of global economy, Indonesia is keen to position itself as a mouthpiece for ASEAN countries, and as a representative of the developing world within the G-20.\n\nIGGI and CGI\n\nAfter 1966, Indonesia welcomed and maintained close relations with the donor community, particularly the United States, western Europe, Australia, and Japan, through the Inter-Governmental Group on Indonesia (IGGI) and its successor, the Consultative Group on Indonesia (CGI), which have provided substantial foreign economic assistance. Problems in Timor and Indonesia's reluctance to implement economic reform, have complicated Indonesia's relationship with donors.\n\nInternational disputes\n\nIndonesia has numerous outlying and remote islands, which some are inhabited by many pirate groups that regularly attack ships in the Strait of Malacca in the north, and illegal fishing crews known for penetrating Australian and Filipino waters.[http://www.afma.gov.au/management/compliance/illegal/default.htm afma.gov.au]; [http://www.abc.net.au/worldtoday/content/2006/s1637120.htm abc.net.au] While Indonesian waters itself is the target of many illegal fishing activities by numerous foreign vessels.\n\nIndonesia has some present and historic territorial disputes with neighboring nations, such as:\n* Ambalat Block in dispute with Malaysia (ongoing, overlapping EEZ line drawn by both countries)\n* Ashmore and Cartier Islands in dispute with Australia (ongoing, the islands known by Indonesians as Pulau Pasir)\n* Fatu Sinai Island (Pulau Batek) formerly disputed with East Timor (settled, East Timor ceded the island to Indonesia in August 2004)\n* Miangas (Las Palmas) formerly disputed with Philippine Islands (settled, see Island of Palmas Case)\n* Northern waters off Natuna Islands in dispute with China and Taiwan (ongoing; overlapping with Chinese Nine-Dash Line claim)\n* Sipadan and Ligitan Islands formerly disputed with Malaysia (settled, part of Malaysia's territory per International Court of Justice's decision in 2002)\n\nWithin ASEAN countries \n\nIndonesia considers ASEAN as cornerstone of its foreign policy, through exercising its regional power and influence in peaceful and constructive manner among ASEAN countries.\n\nBrunei \n\nRepublic of Indonesia established diplomatic relations with Brunei Darussalam on 1 January 1984. Brunei Darussalam was recognised by Jakarta on independence in 1984.\nAlthough they do not share a direct land border, Indonesia and Brunei share the island of Borneo. Overall relations between the two countries were progressing well and that both sides continued to enjoy strong ties in a wide spectrum of co-operations; including trade and investment, tourism, agriculture, marine and fisheries, health, defence, transnational crimes, education, youth, culture and people-to-people contacts.\n\nCambodia \n\nThe relationship between ancient Indonesia and Cambodia dated back from the kingdom of Chenla and Javan Sailendra also Srivijaya; it was mentioned that king Jayavarman II had resided for some times in Java during the reign of Sailendras, and in 802 declare sovereignty of Cambodia from Java and proclaimed himself as universal monarch thus started the Angkor period.\n\nDuring the Sukarno reign in the 1960s, the president of Indonesia has visited Cambodia and vice versa prince Norodom Sihanouk also visited Indonesia.\nIn 1992, Indonesia is among the countries that provides troops for United Nations Transitional Authority in Cambodia. Indonesia also supported Cambodia membership to ASEAN in 1999. Indonesia also among the countries that provide aid to Angkor restoration project, especially the three main gates of Angkor Royal Palace archaeological site near Phimeanakas site. Indonesia is also appointed as observer in Cambodian–Thai border dispute.\n\nLaos \n\nSince established diplomatic relations on 1957, both countries enjoys cordial relations. Indonesia have an embassy in Vientiane, while Laos have an embassy in Jakarta. Indonesia supported and welcomed Laotian membership to the Association of Southeast Asian Nations (ASEAN) in 1997. Laos and Indonesia agreed to enhance relations to focus on exploring the potential of both countries to co-operate on trade and investment. The two countries expressed a desire to reach further agreements relating to security, tourism, sport, air transport and education. Indonesia through bilateral co-operation assist Laos on capacity building and development in various sectors, trough scholarships and trainings for Laotian students.\n\nMalaysia \n\n* Indonesia and Malaysia enjoy friendly relations. The populations of both countries have cordial relations and trade between the two countries has greatly increased over the years.\n* Indonesia has an embassy in Kuala Lumpur and consulate general in Johor Bahru, George Town, Kota Kinabalu and Kuching. Malaysia has an embassy in Jakarta and a consulate general in Medan and Pekanbaru.\n* Indonesia and Malaysia has same ethnic population that belongs to the Austronesian group and sharing the same language although minor differences in vocabulary.\n* Both countries are founding members of ASEAN and APEC. both countries are also members of the Non-Aligned Movement.\n* Relations were deteriorated under President Sukarno, whose opposition to the formation of Malaysia led to a confrontation between the two countries. However, relations were restored following a government transition in Indonesia.\n* Currently, both countries are in a territorial dispute over the oil rich islands of Ambalat. Previously, they were over territorial disputes over the islands of Ligitan and Sipadan, which were won by Malaysia.\n* The Indonesian migrant workers (Indonesian: TKI/Tenaga Kerja Indonesia) have become the important issue between both countries. The problems concerning migrant workers such as illegal immigration, crime, human trafficking, abuse, poor treatment and extortion upon migrant workers. Since 2009 Indonesia has temporarily stop sending domestic workers to Malaysia until both countries agree on ways to protect them.[https://archive.is/20120904091244/http://www.monstersandcritics.com/news/asiapacific/news/article_1485858.php/Report_Indonesia_to_halt_sending_workers_to_Malaysia Indonesia to halt sending workers to Malaysia] Indonesia will resume sending migrant workers to Malaysia in May 2011 as both countries will sign a memorandum of understanding (MoU) about worker protection by the end of April 2011.\n\nMyanmar\n\n*Both Indonesia and Myanmar are promoting the two countries trade volume. The trade volume is estimated to reach up to $1 billion in 2016.\n*Indonesia has offered to purchase 300,000 tons of rice from Myanmar, with prospects of buying more in the future.\n*Indonesia supports Myanmar's democratisation process.\n\nPhilippines \n\n* Indonesia and the Philippines are both archipelagic country and same ethnic population that belongs to the Austronesian group.\n* Both countries established their bilateral and diplomatic relations in 1949. The Indonesian Government has opened its Consular office in Manila but it was not until the mid-1950s that an Embassy was established headed by an Ambassador.\n* A treaty of friendship was signed in 1951. This Treaty constituted the basic relationship of both countries, covering several aspects such as maintenance of peace and friendship, settlement of disputes by diplomatic and peaceful means, traffic arrangements for citizens of both countries and activities to promote co-operation in the area of trade and cultural, which include the political, social-economic and security matters of both countries.\n* Both countries are members of the East ASEAN Growth Triangle together with Brunei Darussalam and Malaysia in the BIMP-EAGA.\n* Both countries peacefully settled their maritime borders after 20 years of diplomatic talks.\n* Both countries have high cooperation in fields of economy, tourism, culture, and defense.\n\nSingapore \n\n* In August 2005, Singapore and Indonesia signed a memorandum of understanding to expand aviation rights between the two countries.\n* On 3 October 2005, Prime Minister Lee Hsien Loong met Indonesian President Susilo Bambang Yudhoyono in Bali, just two days after the Bali bombings. They agreed to strengthen the fight against terrorism and also discussed co-operation in the fields of economy, trade and investment.\n* Relations with Indonesia are generally good, though current outstanding issues include the bans on the export of sand, and granite; both of which Singapore's construction industry is reliant on.\n\nThailand \n\n* Indonesia is Thailand's third most important trade partner within ASEAN, with bilateral trade worth $8.7 billion in 2007. Trade between the two countries is set to grow over the years.\n\nVietnam \n\n* Formal relations started in 1955 for the consulate general level. Soedibjo Wirjowerdojo (former chargé d'affaires of Indonesian Embassy in Peking, China from year of 1953 - 1955) was appointed to be The First Indonesian Consul General to Vietnam, and located in Hanoi.\n* Vietnam and Indonesia are both members of ASEAN.\n* President Megawati Sukarnoputri of Indonesia visited Vietnam in June 2003.  At this time the two countries signed a \"Declaration on the Framework of Friendly and Comprehensive Cooperation Entering the 21st Century\".\n* In May 2005 President Susilo Bambang Yudhoyono of Indonesia visited Vietnam.\n* In the December of the same year festivities were organised in the respective capital cities to celebrate the 50th anniversary of the establishment of diplomatic ties.\n* http://english.vovnews.vn/Home/Vietnam-Indonesia-aim-for-allround-co-operation-development/20062/37663.vov\n\nOceania \n\nAustralia \n\nSince Indonesian independence, the two countries have maintained mutual diplomatic relations, formalised co-operation (especially in the fields of fisheries conservation, law enforcement, and justice co-operation), a measure of security co-operation, broadening treaty relationships, co-membership of regional forums, and co-participation in several multilateral Treaties of significance. Trade between the two countries has grown over the years.\n\nRecent years have seen a deepening of Australia's aid commitment to Indonesia, and Australia has become a popular venue for Indonesian students.http://www.dfat.gov.au/media/speeches/foreign/1996/austindo.html see reference to '12000 students' from Indonesia\n\nIn 2008-09, Indonesia is the largest recipient of Australian aid at a value of AUD462 million.\n\nIndonesia has an embassy in Canberra and consulate general in Melbourne, Perth and Sydney, While Australia has an embassy in Jakarta and consulate in Medan, Makassar, Surabaya and Bali.\n\nFiji \n\nNew Zealand \n\nHaving common interests as democracies and neighbours in the Asia-Pacific region, New Zealand and Indonesia are viewed as natural partners.\n Both countries are members of APEC. Indonesia and New Zealand officially established diplomatic relations in 1958, the diplomatic and economic ties have grown stronger ever since. New Zealand has an embassy in Jakarta and Indonesia has an embassy in Wellington. Indonesia’s commodity exports to New Zealand consist mainly of energy products and minerals as well as lumber and agriculture, while New Zealand's commodity exports to Indonesia mainly consists of dairy products and meats, such as beef, milk, and cheese.\n\nPapua New Guinea \n\nIndonesia shares a 760 km border with Papua New Guinea through its provinces of Papua and West Papua. The common border has raised tensions and ongoing diplomatic issues over many decades.\n\nIndonesia is represented in Papua New Guinea with an embassy in Port Moresby and a consulate in Vanimo.\n\nSolomon Islands \n\nAsia\n\nBangladesh\n\nIndonesia is the world largest Muslim country in terms of its population, whereas Bangladesh is the fourth largest Muslim country. Indonesia and Bangladesh are partners in Organisation of Islamic Cooperation and the Developing 8 Countries. Bangladesh has an embassy in Jakarta and a consulate in Padang, whereas Indonesia has an embassy in Dhaka. Since the official bilateral relations were established in 1972, both countries enjoy cordial and friendly relations.\n\nChina\n\nChina and Indonesia established diplomatic relations on 13 April 1950, which was suspended on 30 October 1967 due to the occurrence of the 30 September event of 1965. Indonesia also supports China on the Diaoyu (Senkaku) issue.\n\nThe bilateral relations began to ease since the 1980s. Foreign Minister Qian Qichen of China met with President Suharto and State Minister Moerdiono of Indonesia in 1989 to discuss the resumption of diplomatic relations of the two countries. In December 1989, the two sides held talks on the technical issues regarding the normalisation of bilateral relations and signed the Minutes. Foreign Minister Ali Alatas of Indonesia visited China on invitation in July 1990 and the two sides issued the Agreement on the Settlement of Indonesia's Debt Obligation to China and the Communique on the Resumption of Diplomatic Relations between the two countries. The two countries issued the \"Communiqué on the Restoration of Diplomatic Relations between the Two Countries\".\n\nPremier Li Peng visited Indonesia on invitation on 6 August 1990. In his talks with President Suharto, the two sides expressed their willingness to improve relations between the two countries on the basis of the Five Principles of Peaceful Co-Existence and the Ten Principles of the Bandung Conference. On 8 August, Foreign Ministers of China and Indonesia on behalf of their respective governments, signed the Memorandum of Understanding on the Resumption of Diplomatic Relations. The two sides declared the formal resumption of the diplomatic relations between China and Indonesia on that day.\n\nEast Timor \n\nEast Timor (officially named the Democratic Republic of Timor-Leste) and Indonesia share the island of Timor.  Indonesia invaded the former Portuguese colony in 1975 and annexed East Timor in 1976, maintaining East Timor as its 27th province until a United Nations-sponsored referendum in 1999, in which the people of East Timor chose independence. Following a United Nations interim administration, East Timor gained independence in 2002.\n\nDespite the traumatic past, relations with Indonesia are very good. Indonesia is by far the largest trading partner of East Timor (Approximately 50% of imports, 2005) and is steadily increasing its share.\n\nProblems to be solved include, East Timor-Indonesia Boundary Committee meetings to survey and delimit land boundary; and Indonesia is seeking resolution of East Timorese refugees in Indonesia.\n\nIndia\n\nIn 1950, Sukarno, Indonesian first president, called upon the peoples of Indonesia and India to \"intensify the cordial relations\" that had existed between the two countries \"for more than 1000 years\" before they had been \"disrupted\" by colonial powers.Foreign Policy of India:  Text of Documents 1947-59 (p.54) Fifteen years later in Djakarta, government-inspired mobs were shouting: \"Down with India, the servant of imperialists\" and \"Crush India, our enemy. \"I New York Times 10 September 1965 Yet in the spring of 1966, the foreign ministers of both countries began speaking again of an era of friendly relations. India had supported Indonesian independence and Nehru had raised the Indonesian question in the United Nations Security Council.\n\nIndia has an embassy in Jakarta and Indonesia operates an embassy in Delhi.http://www.indonesianembassy.org.in/\n\nIran\n\nIndonesia and Iran are Muslim-majority countries, despite the differences in its religious orientation. Indonesian has the largest Muslim Sunni population in the world, while Iran is a predominantly Shiite nation.\n\nAs Islamic countries that have among the largest Muslim populations in the world, Iran and Indonesia hold themselves responsible for promoting Islam as a peaceful religion. Diplomatic relations has been established since 1950. Indonesia has an embassy in Tehran, and Iran has an embassy in Jakarta. Both countries are full members of the World Trade Organization (WTO), The Non-Aligned Movement, Organisation of Islamic Cooperation (OIC), and Developing 8 Countries.\n\nJakarta had offered to help mediate the Iranian nuclear dispute, Jakarta is on good terms with Iran and other Middle East countries, as well as with the West.\n\nIraq\n\nIndonesia and Iraq share similarity as Muslim-majority countries. both countries share their experiences in rebuilding and development. Indonesia has an embassy in Baghdad, while Iraq has an embassy in Jakarta. Both countries are partners in multilateral organisations, such as World Trade Organization (WTO), The Non-Aligned Movement and Organisation of Islamic Cooperation (OIC).\n\nAfter World War II, Iraq was one of the first countries to recognise Indonesia’s independence in 1945. The two countries established diplomatic relations in 1950 and have signed around 15 agreements to boost bilateral ties. Indonesia has maintained its embassy in Baghdad during various crises, such as the Iraq-Iran War in the 1980s. However, at the height of the Iraq War, Indonesia was forced to temporarily closed its embassy in Baghdad in 2003, and reopen it in June 2011.\n\nIn 2003, the Indonesian government and people protested against a US-led military campaign against Baghdad. Over 50,000 Indonesian people crowded the streets of the Indonesian capital, Jakarta, on Sunday, 9 February 2003, to protest the United States' threat of military action against Iraq. After the war ended and Indonesia reopened its embassy in 2011, relations between the two countries have developed at a fast pace. Iraq invited Indonesia's companies to participate in the reconstruction of Iraq. Traditionally, Indonesia views Iraq as a source of energy resources, such as oil and gas. Iraqi people are familiar with Indonesian exported products such as: tires, soaps, spices, furniture, coal, clothing, palm oil, shoes, paper, automobiles, rubber, and electronic goods.\n\nJapan\n\n* Indonesia and Japan enjoy friendly relations.\n* Indonesia has an embassy in Tokyo and a consulate in Osaka. Japan has an embassy in Jakarta and consulates in Medan, Denpasar, Surabaya, and Makassar.\n* Japan is Indonesia's largest export partner.\n* Both countries are members of the G-20 major economies and APEC.\n\nJordan\n\n* Jordan and Indonesia often shares similar stances upon issues in the Middle East, such as the Syrian conflict and the Israeli–Palestinian conflict.\n* Indonesia is currently Jordan's largest trade partner in ASEAN.\n* Jordan have an embassy in Jakarta, while Indonesia have an embassy in Amman that also accredited to Palestine.\n* Both countries are the member of Organisation of Islamic Cooperation and Non-Aligned Movement.\n* Jordan serves as the gate for Indonesian Muslim and Christian pilgrims wishing to visit the holy sites in Palestine and Israel.\n\nNepal\n\nSince diplomatic relations were established in 1960, both countries enjoy friendly and cordial relations, although both parties have not established embassies in each counterparts' capitals. Indonesia only established an honorary consulate in Kathmandu, while its embassy in Dhaka, Bangladesh, is also accredited to Nepal. Nepal on the other hand accredited its embassy in Bangkok, Thailand, also to Indonesia. Both the countries have many cultural proximities and similar view on international issues. Both countries are also partners and founding members of the Non-Aligned Movement (NAM).\n\nNorth Korea\n\nIndonesia is one of the very few countries that still maintain cordial relations with North Korea, despite international sanctions and isolation applied upon North Korea concerning its human rights abuses and nuclear missile program. Indonesia has adopted what it calls a \"free-and-active\" foreign policy, which allows it to be consistent in counting on both North and South Korea as friends.\n\nBoth countries share a relationship that dates back to the Sukarno and Kim Il-sung era in the 60s. Indonesia has an embassy in Pyongyang, while North Korea has an embassy in Jakarta. both countries are members of the Non-Aligned Movement.\n\nAccording to a 2014 BBC World Service Poll, 28% of Indonesians view North Korea's influence positively, with 44% expressing a negative view. This shows a deterioration from previous year's poll where 42% of Indonesians view North Korea's influence positively, with 29% expressing a negative view.[http://downloads.bbc.co.uk/mediacentre/country-rating-poll.pdf 2014 World Service Poll] BBC[http://www.globescan.com/images/images/pressreleases/bbc2013_country_ratings/2013_country_rating_poll_bbc_globescan.pdf 2013 World Service Poll] BBC\n\nPakistan\n\n* Indonesia has its embassy in Islamabad and a Consulate in Karachi\n* Pakistan has its embassy in Jakarta and a Consulate in Medan.\n* Both countries are members of the Developing 8 (D-8) countries and the Next Eleven (N-11) Countries. They are also members of the Non-Aligned Movement (NAM) and the Organisation of Islamic Cooperation (OIC).\n* Bilateral trade between the two countries currently stand at $800 million but both countries are looking at increase this to $2 billion.\n\nSaudi Arabia \n\n*Saudi Arabia have an embassy in Jakarta, while Indonesia have an embassy in Riyadh and a consulate in Jeddah.\n*Saudi Arabia was one of the first countries to recognise Indonesia's independence.http://saudigazette.com.sa/article/161484/Broadening-Indonesia-Saudi-bilateral-relationshttps://www.kemlu.go.id/en/berita/berita-perwakilan/Pages/Broadening%20Indonesia-Saudi%20bilateral%20relations.aspx#\n*Both countries are the member of Organisation of Islamic Cooperation and G-20 major economies.\n*Indonesia sent the largest hajj pilgrims among Muslim-majority countries.\n*The balance of trade is heavily in favour of Saudi Arabia, because of its oil and gas exports to Indonesia.\n*Migrant worker abuse and death sentences faced by Indonesian workers in Saudi Arabia are the main problems that strained diplomatic relations between two countries.\n\nSouth Korea\n\n*Indonesia has an embassy in Seoul.\n*South Korea has an embassy in Jakarta.\n*Scale of bilateral trade between two nation is US$14.88 billion.\n*Both countries have invested in multiple joint military development projects including the KFX/IFX fighter jet.\n*South Korea firm Daewoo Shipbuilding and Marine Engineering (DSME) is in final contract negotiations to supply Indonesia with three Type-209 submarines. This will be the largest ever bilateral defence deal valued at USD1.1 billion.http://www.mofa.go.kr/ENG/countries/asiapacific/countries/20070802/1_24400.jsp?menu=m_30_10\n\nSri Lanka \n\n*Indonesia and Sri Lanka are the founder of the Non-Aligned Movement.\n*Since the diplomatic relations were established in 1952, both countries enjoys cordial and friendly relationship\n*Indonesia has an embassy in Colombo, while Sri Lanka has an embassy in Jakarta.\n\nTaiwan \n\nIndonesia and Taiwan (ROC) do not have diplomatic relations, both have only an unofficial relationship.\n\nTurkey\n\n* Relations with the Ottoman Empire (Turkey's predecessor state) began with the 16th century Ottoman expedition to Aceh, in with the response to the Aceh Sultanate's request for assistance against the Portuguese in Malacca\n* Indonesia has an embassy in Ankara.\n* Turkey has an embassy in Jakarta.\n* Both countries are full members of the World Trade Organization (WTO), Organisation of Islamic Cooperation (OIC), and the G-20 major economies.\n\nUnited Arab Emirates\n\n* The diplomatic relations between Indonesia and the United Arab Emirates are important because both share the solidarity as Muslim-majority countries, and both countries recognise the important role of each counterparts in the region.\n*Since the diplomatic relations established in 1976, both country enjoy friendly and cordial relationship.\n*Indonesia has an embassy in Abu Dhabi, while the United Arab Emirates has an embassy in Jakarta.\n*Both countries are partners in multilateral organisations, such as the World Trade Organization (WTO), Non-Aligned Movement and Organisation of Islamic Cooperation (OIC).\n*Indonesia uses the UAE as the main gate to enter the Gulf and Middle East market, Indonesia's export to UAE is the largest in the Middle East.\n*The Indonesian government has established the trade and investment representative office to promote its products in the United Arab Emirates and the entire Middle East region.\n\nPalestine\n\n* Indonesia has an embassy, non resident in Amman\n* Palestine has an embassy in Jakarta\n\nIsrael\n\nThe two countries maintain no formal diplomatic ties.\n\nEurope\n\nAustria\n\n* The bilateral relations between Austria an Indonesia officially established in 1954.\n* Austria recognises Indonesia as a stable and reliable partner, and both countries enjoy excellent relations.\n\n* The two countries have agreed to expand relations in business, trade and investment, tourism, culture, environment and green technology.\n\n* Austria has an embassy in Jakarta and consulates in Bandung and Surabaya, while Indonesia has an embassy in Vienna that also accredited to Slovenia as well as multilateral organisations; IAEA, PrepCom CTBTO, UNODC and UNOOSA.\n\nArmenia\n\n* Both countries established diplomatic relations on September 22, 1992.[http://www.mfa.am/en/country-by-country/id/]\n* Armenia has an embassy in Jakarta.\n* Indonesia has an honorary consulate in Yerevan.\n\nBulgaria\n\n* Bulgaria was among the States that recognised Indonesia's independence since its Proclamation of Independence on 17 August 1945.  Diplomatic relations started on 21 September 1956.\n* Bulgaria has had an embassy in Jakarta since October 1958\n* Indonesia has had an embassy in Sofia Since 1960.[http://www.indonesia.bg/bilateral%20bulgaria.htm Official Website of the Embassy of the Republic of Indonesia in Sofia, Bulgaria] .\n\nCyprus\n\n*  Diplomatic relations were established on 4 December 1987[http://www.olc.gov.cy/olc/olc.nsf/all/E9FE893C2708E0E1C22575D70024CE6E/$file/INDONESIA.pdf?openelement Ministry Foreign Affairs of Cyprus]\n* Cyprus is represented in Cyprus through its embassy in Canberra, Australia.[http://www.mfa.gov.cy/mfa/mfa2006.nsf/policy02_en/policy02_en?OpenDocument Ministry Foreign Affairs of Cyprus]\n* Indonesia is represented in Cyprus through its embassy in Rome, Italy.[http://www.mfa.gov.cy/mfa/mfa2006.nsf/All/D7A26A33A9B65E62C22571B500249940?OpenDocument Ministry Foreign Affairs of Cyprus]\n\nDenmark\n\nDenmark has an embassy in Jakarta, and Indonesia has an embassy in Copenhagen. Bilateral relations are strong.\n\nFrance \n\n*Indonesia has an embassy in Paris and France has an embassy in Jakarta\n*The relations between France and Indonesia have been increasing of late, while Indonesia has become increasingly strategic to the government and people of France.\n*There are 110 French multinational companies operated in Indonesia.\n*The relations between two countries are important as both are democratic republics and both holds significant geopolitical influences in each regions. France is indispensable member of European Union, as well as Indonesia for the Association of Southeast Asian Nations.\n*The diplomatic relation between France and Indonesia is also a key element for developing relations between Indonesia and the European Union and between France and the ASEAN.\n*Both countries are the member of G-20 major economies.\n\nFinland\n\n* Indonesia and Finland enjoy friendly relations. Nokia has a substantial share of the mobile phone market in Indonesia.\n\nGermany\n\n*Indonesia and Germany have traditionally enjoyed good, intensive and wide-ranging relations.\n*Germany and Indonesia, as the largest members of the European Union and the Association of Southeast Asian Nations (ASEAN), respectively, take similar positions on many issues relating to the development of the two regional organisations.\n\n*Indonesia has an embassy in Berlin\n*Germany has an embassy in Jakarta\n\nGreece\n\n* Diplomatic relations started in 1960.\n* The embassy of Indonesia in Athens was opened since 1994.\n* The embassy of Greece in Jakarta was opened in 1997.[http://www.greekembassy.or.id/  Greek embassy in Jakarta]\n* [http://www.mfa.gr/www.mfa.gr/en-US/Policy/Geographic+Regions/Asia+-+Oceania/Bilateral+Relations/Indonesia/  Greek Foreign Affairs Ministry about relations with Indonesia].\n\nHoly See\n\n* Indonesia, the world’s largest Muslim-majority country in terms of population, recognise Catholicism as one of its six approved religions.\n* The Holy See has an Apostolic Nunciature in Jakarta, while Indonesia has an embassy in Rome. \n* The Holy See recognised the Republic of Indonesia on 6 July 1947 and established an Apostolic delegate in the country. \n* Official relations was established in 1950 with the status of Apostolic Internunciatur. In December 1965, the status changed to Nunciatur Apostolic.\n* There have been two papal visits to Indonesia: those of Pope Paul VI in December 1970, and of Pope John Paul II in October 1989.\n\nItaly\n\n* Both countries has shown strong desire to improve their relations, especially in intercultural understanding and trade.\n* Indonesia recognises Italy's strategic location and important role in the middle of Mediterranean region, while Italy has favoured relations with Indonesia, and sees Indonesia as the leader in Southeast Asia.\n* The relations between two countries not only important to bridge the two regional communities; European Union and ASEAN, but also vital as intercultural and interfaith dialogue,\n* Indonesia has an embassy in Rome, that also accredited to Malta, Cyprus, San Marino, while Italy has an embassy in Jakarta.\n\nNetherlands \n\n*Indonesia–Netherlands relations refers to relations between Indonesia and the Netherlands. The relationship begun during the spice trade as Netherlands started a trading post in what is now Indonesia before colonising it as the Dutch East Indies.\n*The Indonesian military still sometimes buys equipment from the Dutch.\n*Indonesia has an embassy in The Hague.\n*The Netherlands has an embassy in Jakarta.\n*Indonesian consulate in Amsterdam is not in service anymore.\n\nPortugal\n\nIn 1999, Indonesia and Portugal restored diplomatic relations, which were broken off following the Indonesian invasion of East Timor in 1975.\n\n* Indonesia has an embassy in Lisbon.[http://kbri3.indonesianembassy-lisbon.net/en/home-mainmenu-1.html Indonesian embassy in Lisbon] \n* Portugal has an embassy in Jakarta.[http://www.embassyportugaljakarta.or.id/indexeng.htmEmbassy of Portugal]\n\nRomania\n\n* Indonesia has an embassy in Bucharest.\n* Romania has an embassy in Jakarta.\n\nRussia\n\n* Both Indonesia and Russia are members of the APEC.\n* Russia has an embassy in Jakarta.[http://www.indonesia.mid.ru/  Russian embassy in Jakarta]\n* Indonesia has an embassy in Moscow along with a consulate general in Saint Petersburg.[http://www.kbrimoskow.org/embassy/list_040107.htm Indonesian embassy in Moscow] \n* Early in the Cold War, both countries had very strong relations with Indonesian president Sukarno visiting Moscow and Soviet leader Nikita Khrushchev visiting Jakarta. When Sukarno was overthrown by General Suharto, relations between the two states were not as close as they were during Sukarno's times.\n* In late 2007, Indonesia purchased military weapons from Russia with long term payment. Both countries are also members of the G20 and APEC.\n\nSpain\n\n* Spain identifies Indonesia as their natural ally and has named Indonesia as one of their priority countries in their foreign relations with the Asian region. \n* Indonesia supports Spain in the Gibraltar issue.\n* Indonesia has an embassy in Madrid and consulates in Barcelona and Las Palmas, while Spain has an embassy in Jakarta and a consulate in Denpasar, Bali. \n* Today, the co-operation has expanded to various fields, from trade and culture to education and the defence technology sector. \n* Since the 1980s, Spain and Indonesia have embarked on a strategic partnership in aeronautics technology. Spain's CASA and Indonesia's IPTN (formerly known as Nurtanio) co-designed and co-produced the CASA/IPTN CN-235 medium transport aircraft.\n\nSwitzerland\n\n* In 2010 the heads of state of the two countries agreed to launch negotiations on a Comprehensive Economic Partnership Agreement (CEPA). \n* Switzerland has named Indonesia as one of seven priority countries for economic development co-operation.\n* Indonesia has an embassy in Bern, while Switzerland has an embassy in Jakarta, also accredited for East Timor and ASEAN.\n* On 6 December 1973, the Indonesian and Swiss governments signed an agreement to establish Polytechnic for Mechanics within the Bandung Institute of Technology at Bandung. Today, the Swiss Mechanics Polytechnic has transformed into Bandung State Polytechnic for Manufacture.\n\nUkraine\n\n* Indonesia recognised Ukraine’s independence in 1992 and established diplomatic relations in 1993. Indonesia has an embassy in Kiev.\n* Ukraine has an embassy in Jakarta.\n\nUnited Kingdom\n\nThe United Kingdom and Indonesia have maintained strong relations since formal relations were established in 1949.[http://ukinindonesia.fco.gov.uk/en/about-us/working-with-indonesia/uk-indo-relation UK-Indonesia relations]  Indonesia has an embassy in London,[http://www.indonesianembassy.org.uk/News/news_2010_03_27_jp_1.html News-Indonesianembassy]  the United Kingdom has an embassy in Jakarta and consulate in Surabaya and Medan.[http://ukinindonesia.fco.gov.uk/en/about-us/our-embassy/ Our embassy]\n\nThe Culture and Tourism Ministry of Indonesia launched a campaign to boost the number of tourists from the UK entering Indonesia. In 2009, 160,000 British tourists visited Indonesia, the aim of the campaign was to boost this number to 200,000.\n\nIn 2006 former British prime-minister Tony Blair met with Susilo Bambang Yudhoyono where they agreed upon \"the establishment of a regular Indonesia-UK Partnership Forum to be chaired by the Foreign Ministers, to promote strategic dialogue on bilateral, multilateral and global issues\". The first Indonesia-UK forum was held in 2007 and was chaired by British foreign minister Margaret Beckett and Indonesian foreign minister Hassan Wirajuda.\n\nIn March 2010 members of the House of Lords praised Indonesia for their progress in democratising society, media freedom and environmental protection.[http://www.deplu.go.id/Pages/News.aspx?IDP\n3265&len Ministry of Foreign Affairs - Members of the UK’s House of Lords praised Indonesia’s achievements]  In a meeting with Indonesian MP Hayono Isman, the Lords stated that they wanted to improve the relationship between the two countries.\n\nNorth America\n\nBelize\n\nBoth countries established diplomatic relations on 11 July 2014.http://www.guardian.bz/index.php?optioncom_content&id\n8103:belize-establishes-diplomatic-relations-with-indonesia-and-palestine\n\nCanada\n\n* Canada has an embassy in Jakarta (World Trade Centre I).[http://geo.international.gc.ca/asia/jakarta/menu-en.asp Canadian embassy in Jakarta]\n* Indonesia has an embassy in Ottawa (55 Parkdale Avenue) and consulates-general in Toronto (129 Jarvis Street) and Vancouver (1630 Alberni Street).\n* Both countries are full members of the G-20 major economies, of the Cairns Group and of the Asia-Pacific Economic Cooperation.\n\nMexico\n\n* The diplomatic relations was officially established in 1953,\n* Indonesia has an embassy in Mexico City, while Mexico has an embassy in Jakarta that also accredited to East Timor.\n* both countries sees their counterpart as their strategic partners in each regions.\n* Mexico has renewed its interest on Asia, sees Indonesia's strategic role in ASEAN, and willing to create an economic partnership agreement with Indonesia.\n* Both countries are partners in multilateral organisations such as the WTO, FEALAC, APEC and G-20.\n\nUnited States\n\nThe United States has important economic, commercial, and security interests in Indonesia. It remains a lynchpin of regional security due to its strategic location astride a number of key international maritime straits, particularly the Malacca Strait. Relations between Indonesia and the US are positive and have advanced since the election of President Yudhoyono in October 2004. The US played a role in Indonesian independence in the late 1940s and appreciated Indonesia's role as an anti-communist bulwark during the Cold War. Cooperative relations are maintained today, although no formal security treaties bind the two countries. The United States and Indonesia share the common goal of maintaining peace, security, and stability in the region and engaging in a dialogue on threats to regional security. Cooperation between the US and Indonesia on counter-terrorism has increased steadily since 2002, as terrorist attacks in Bali (October 2002 and October 2005), Jakarta (August 2003 and September 2004) and other regional locations demonstrated the presence of terrorist organisations, principally Jemaah Islamiyah, in Indonesia. The United States has welcomed Indonesia's contributions to regional security, especially its leading role in helping restore democracy in Cambodia and in mediating territorial disputes in the South China Sea.\n\nSouth America\n\nArgentina\n\n* Since the diplomatic relations established in 1956, the bilateral relations between Argentina and Indonesia were becoming increasingly more strategic.\n* Indonesia supports Argentina on the Malvinas issue.\n* Argentina has an embassy in Jakarta, while Indonesia has an embassy in Buenos Aires. \n* Both countries are members of Group of 77, the G-20 major economies, the G20 developing nations, and Forum of East Asia-Latin America Cooperation.\n* Indonesia is the second-largest destination for Argentine exports to Asia after China, and the largest one in Southeast Asia. While Argentina is South America's second-largest importer of Indonesian products after Brazil.\n\nBrazil\n\n* Brazil and Indonesia possess the largest tropical rainforest of the world\n that contains the world's richest biodiversity, which gave them a vital role in global environment issues, such as ensuring tropical forests protection.\n \n* Both countries leading the list of megadiverse countries with Indonesia second only to Brazil. \n* Brazil expects to expand its co-operation with Indonesia in many areas, including agriculture and high-technology industry.\n \n* Both countries are members of World Trade Organization (WTO), Forum of East Asia-Latin America Cooperation and the G-20 major economies. \n* By first quarter of 21st-century, both countries are expected to emerge as the rising global power.\n\nChile\n\nColombia\n\nCuba\n\n* During the administration Sukarno in the 1960s, Indonesia and Cuba enjoyed exceptionally close relationship. \n* The relations between two countries mostly focused on sports and health. \n* Cuba has an embassy in Jakarta, while Indonesia has an embassy in Havana that also accredited to the Commonwealth of the Bahamas and Jamaica. \n* Indonesia supports Cuba in the Guantanamo Bay issue.\n* both countries are full members of Group of 77, NAM and FEALAC.\n\nGuyana\n\nBoth countries established diplomatic relations on 27 August 1999.\n\nPeru\n\nSuriname\n\n* Indonesia and Suriname had a special relationship, based upon shared common history as former colonies of the Dutch Empire. \n* Large numbers of Javanese migrated to Suriname to work on plantations during the late 19th and early 20th-centuries. \n* Indonesia has an embassy in Paramaribo also accredited to Guyana, while Suriname has an embassy in Jakarta. \n* both countries committed to expand and improve their relations covering trade, agriculture and cultural sectors. \n* Indonesia and Suriname are partners in multilateral organisations such as the WTO and FEALAC.\n\nVenezuela\n\n* Since the diplomatic relations established in 1959, Indonesia and Venezuela enjoy friendly ties. \n* Indonesia supports Venezuela on the Guayana Esequiba issue.\n* both countries agreed to expand the trade and investment relations, especially in tourism, technology, chemicals and natural gas sectors. \n* Indonesia has an embassy in Caracas, while Venezuela has an embassy in Jakarta. \n* Indonesia and Venezuela are partners in multilateral organisations such as the WTO, NAM and FEALAC.\n\nAfrica\n\nAlgeria\n\n* The relationship between two countries is mostly founded on common religious and anti-colonialism solidarity, as Indonesia and Algeria are Muslim-majority countries that also once fell under colonialism. \n* Algeria recognised Indonesia's role on supporting their country on gaining independence in 1962. \n* Both countries agreed on expanding co-operations and strengthening relations. \n* Algeria has an embassy in Jakarta that also accredited to Singapore and Brunei Darussalam, while Indonesia has an embassy in Algiers. \n* both countries are members of the NAM, Group of 77 and OIC.\n\nCape Verde\n\nIndonesia is represented in Cape Verde by its embassy in Dakar[https://www.kemlu.go.id/dakar/en/Pages/Cape-Verde.aspx]. \n\nEgypt\n\n* Indonesia has an embassy in Cairo and Egypt has an embassy in Jakarta.\n* Egypt was one of the first countries to recognise Indonesia's independence.\n* Gamel Abdel Nasser of Egypt and Sukarno of Indonesia were two of the five founding members of the Non-Aligned Movement.\n* Both countries are members of the OIC, the Non-Aligned Movement, and the G20 developing nations.\n\nGuinea-Bissau\n\nBoth countries established diplomatic relations on December 12, 1996[https://www.kemlu.go.id/dakar/en/Pages/Guinea-Bissau.aspx]. \n\nKenya\n\n* Indonesia has an embassy in Nairobi, also accredited to Mauritius, Seychelles, and Uganda,  while Kenya did not establishes embassy in Indonesia yet, diplomatic relations with Indonesia is accredited to its embassy in Kuala Lumpur, Malaysia. \n* both countries are partners in multilateral organisations, such as the WTO and NAM.\n\nLiberia\n\n* The diplomatic relations was officially established in 1965, however it was not until 2013 that both leaders of each countries visited each other's to further the co-operations.\n\nLibya\n\n* Indonesia has an embassy in Tripoli and Libya has an embassy in Jakarta.\n* Both countries are members of the OIC and the Non-Aligned Movement.\n\nMadagascar\n\n* The ancestors of Madagascar people came from Indonesia, sailed across Indian Ocean, back in early 8th to 9th century CE.\n* Indonesia have an embassy in Antananarivo, while Madagascar do not established an embassy in Jakarta yet.\n* Malagasy language and Indonesian language shared similar words, such as hand: ˈtananə (Malagasy), tangan (Indonesian); skin: ˈhulitse (Malagasy), kulit (Indonesian); white: ˈfuti (Malagasy), putih (Indonesian).\n\nMorocco\n\n* Indonesia and Morocco shared similarity as the Muslim-majority countries.\n* Morocco praised Indonesia as a strong democratic nation, and pointed that both countries facing the same challenges of separatism and terrorism. \n* Diplomatic relations were established in 1960. Indonesia has an embassy in Rabat and a consulate in Casablanca, while Morocco has an embassy in Jakarta. \n* both countries are members of the WTO, NAM and OIC.\n\nNigeria\n\n* Indonesia has an embassy in Abuja and Nigeria has an embassy in Jakarta.\n* Both countries are members of the OIC, the Non-Aligned Movement, the G20 developing nations, and the Next Eleven.\n\nSouth Africa\n\n* Indonesia has an embassy in Pretoria and South Africa has an embassy in Jakarta.\n* Both countries are members of the G-20 major economies, the Non-Aligned Movement, and the G20 developing nations.\n\nTanzania\n\n* The relations between Indonesia and Tanzania are mostly in agriculture sector, where Indonesia provides training for Tanzanian farmers. \n* Indonesia has an embassy in Dar es Salaam, while Tanzania has a non-resident ambassador in Kuala Lumpur, Malaysia. \n* Both countries are members of multilateral organisations such as World Trade Organization (WTO), the Group of 77 and Non-Aligned Movement.\n\nTunisia\n\n* Tunisia and Indonesia are partners in capacity building and partnership for democracy. \n* Indonesia hails Tunisia as a shining example of democratic transition in Arab world. \n* The diplomatic relations dated back to the 1950s when Indonesia supports Tunisian independence from France.\n* Indonesia have an embassy in Tunis, while Tunisia have an embassy in Jakarta.\n* Both countries are the member of Organisation of Islamic Cooperation and Non-Aligned Movement.\n\nInternational organisation participation. Foreign relations of Indonesia. http://en.wikipedia.org/?curid=14651."
  }
}
