{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16881",
  "eid" : "29682eb0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778578715,
  "textBody" : "Kashrut (also kashruth or kashrus, ) is a set of Jewish religious dietary laws. Food that may be consumed according to halakha (Jewish law) is termed kosher ( in English, ), from the Ashkenazi pronunciation of the Hebrew term kashér (), meaning \"fit\" (in this context, fit for consumption).\n\nAmong the numerous laws that form part of kashrut are the prohibitions on the consumption of certain animals (such as pork, shellfish [both Mollusca and Crustacea], and most insects, with the exception of certain species of kosher locusts), mixtures of meat and milk, and the commandment to slaughter mammals and birds according to a process known as shechita. There are also laws regarding agricultural produce that might impact the suitability of food for consumption.\n\nMost of the basic laws of kashrut are derived from the Torah's Books of Leviticus and Deuteronomy. Their details and practical application, however, are set down in the oral law (eventually codified in the Mishnah and Talmud) and elaborated on in the later rabbinical literature. Although the Torah does not state the rationale for most kashrut laws, some suggest that they are only tests for man's obedience,Maimonides, Guide for the Perplexed (ed. M. Friedländer), Part III (chapter 26), New York 1956, p. 311 while others have suggested philosophical, practical and hygienic reasons.Maimonides, Guide for the Perplexed (ed. M. Friedländer), Part III (chapter 48), New York 1956, p. 371\n\nOver the past century, there have developed numerous rabbinical organizations that certify products, manufacturers, and restaurants as kosher, usually using a symbol (called a hechsher) to indicate their support. Currently, about a sixth of American Jews or 0.3% of the American population fully keep kosher, and there are many more who  do not strictly follow all the rules but still abstain from some prohibited foods (especially pork).\n\nExplanations\n\nPhilosophical\n\nJewish philosophy divides the 613 mitzvot into three groups—laws that have a rational explanation and would probably be enacted by most orderly societies, (mishpatim), laws that are understood after being explained but would not be legislated without the Torah's command (edot), and laws that do not have a rational explanation (chukim). Some Jewish scholars say that kashrut should be categorized as laws for which there is no particular explanation, since the human mind is not always capable of understanding divine intentions. However, many believe that it could be because of the concept that many rabbis refer to as \"glabenshlugan\". This concept is uncommon in most Jewish laws, but it is present in the laws of kashrut, as R'Sprintza Pesha said in her book. In this line of thinking, the dietary laws were given as a demonstration of God's authority, and man must obey without asking why., December 1998 (archived from [http://www.adventistbiblicalresearch.org/documents/Clean%20&%20Unclean%20Meats.htm the original]  ) However, Maimonides believed that Jews were permitted to seek out reasons for the laws of the Torah.Mishneh Torah Korbanot, Temurah 4:13 (in eds. Frankel; \"Rambam L'Am\")\n\nSome theologians have said that the laws of kashrut are symbolic in character: Kosher animals represent virtues, while non-kosher animals represent vices. The 1st century BCE Letter of Aristeas argues that the laws \"have been given ... to awake pious thoughts and to form the character\".Letter of Aristeas, 145–154 This view reappears in the work of the 19th century Rabbi Samson Raphael Hirsch.\n\nThe Torah prohibits \"seething the kid (goat, sheep, calf) in its mother's milk\". While the Bible does not provide a reason, it has been suggested that the practice was perceived as cruel and insensitive. quoting Deuteronomy Rabbah 6:1\n\nHasidic Judaism believes that everyday life is imbued with channels connecting with Divinity, the activation of which it sees as helping the Divine Presence to be drawn into the physical world; Hasidism argues that the food laws are related to the way such channels, termed sparks of holiness, interact with various animals. These sparks of Holiness are released whenever a Jew manipulates any object for a holy reason (which includes eating); however, not all animal products are capable of releasing their sparks of holiness. The Hasidic argument is that  animals are imbued with signs that reveal the release of these sparks, and the signs are expressed in the biblical categorization of ritually clean and ritually unclean., rabbifriedman.org (archived from [http://www.rabbifriedman.org/sichaReeh.asp the original]  on August 29, 2007).\n\nAccording to Christian theologian Gordon J. Wenham, the purpose of kashrut was to help Jews maintain a distinct and separate existence from other peoples; he says that the effect of the laws was to prevent socialization and intermarriage with non-Jews, preventing Jewish identity from being diluted.Gordon J. Wenham, The Theology of Unclean Food, The Evangelical Quarterly 53, January March 1981, pp.6–15 Wenham argued that since the impact of the food laws was a public affair, this would have enhanced Jewish attachment to them as a reminder of their distinct status as Jews.\n\nMedical\n\nThere have been attempts to provide empirical support for the view that Jewish food laws have an overarching health benefit or purpose, one of the earliest being from Maimonides in his Guide for the Perplexed.  In 1953, David Macht, an Orthodox Jew and proponent of the theory of biblical scientific foresight, conducted toxicity experiments on many kinds of animals and fish. His experiment involved lupin seedlings being supplied with extracts from the meat of various animals; Macht reported that in 100% of cases, extracts from ritually unclean meat inhibited the seedling's growth more than that from ritually clean meats. op. cit. At the same time, these explanations are controversial. Scholar Lester L. Grabbe, writing in the Oxford Bible Commentary on Leviticus, says \"[a]n explanation now almost universally rejected is that the laws in this section [] have hygiene as their basis. Although some of the laws of ritual purity roughly correspond to modern ideas of physical cleanliness, many of them have little to do with hygiene. For example, there is no evidence that the 'unclean' animals are intrinsically bad to eat or to be avoided in a Mediterranean climate, as is sometimes asserted.\"The Oxford Bible Commentary, eds. J. Barton and J. Muddiman. Oxford: Oxford University Press. 2001: 99.\n\nProhibited foods\n\nThe laws of kashrut can be classified according to the origin of the prohibition (Biblical or rabbinical) and whether the prohibition concerns the food itself or a mixture of foods.\n\nBiblically prohibited foods include:\n* Non-kosher animals and birds (based on  and ): mammals require certain identifying characteristics (cloven hooves and being ruminants), while birds require a tradition that they can be consumed. Fish require scales and fins (thus excluding catfish, for instance). All invertebrates are non-kosher apart from certain types of locust, on which most communities lack a clear tradition. No reptiles or amphibians are kosher.\n* Carrion (nevelah): meat from a kosher animal that has not been slaughtered according to the laws of shechita. This prohibition includes animals that have been slaughtered by non-Jews.Babylonian Talmud, Hullin 13a (on Mishnah Hullin 1:1).\n* Injured (terefah): an animal with a significant defect or injury, such as a fractured bone or particular types of lung adhesions.\n* Blood (dam): blood of kosher mammals and fowl is removed through salting, with special procedures for the liver, which is very rich in blood.\n* Particular fats (chelev): particular parts of the abdominal fat of cattle, goats and sheep must be removed by a process called nikkur.\n* The twisted nerve (gid hanasheh): the sciatic nerve, as according to  the patriarch Jacob's was damaged when he fought with an angel, cannot be eaten and is removed by nikkur.\n* Limb of a living animal (ever min ha-chai): in , God forbade Noah and his descendants to consume a limb torn from a live animal. Hence, Jewish law considers this prohibition applicable even to non-Jews, and therefore, a Jew may not give or sell such meat to a non-Jew.\n* Untithed food (tevel): produce of the Land of Israel requires the removal of certain tithes, which in ancient times were given to the Kohanim (priests), Levites and the poor (terumah, maaser rishon and maaser ani respectively) or taken to the Old City of Jerusalem to be eaten there (maaser sheni).\n* Fruit during the first three years (orlah): according to , fruit from a tree in the first three years after planting cannot be consumed (both in the Land of Israel and the diaspora). This applies also to the fruit of the vine—grapes, and wine produced from them.\n* New grain (chadash): in  the Bible prohibits newly grown grain (planted after Passover the previous year) until the second day of Passover; there is debate as to whether this law applies to grain grown outside the Land of Israel.\n* Wine of libation (yayin nesekh): wine that may have been dedicated to idolatrous practices.\n\nBiblically prohibited mixtures include:\n* Mixtures of meat and milk(basar be-chalav): this law derives from the broad interpretation of the commandment not to \"cook a kid in its mother's milk\" (, , and ); other non-kosher food may be used for other benefit (e.g. sold to non-Jews), but mixtures of meat and milk are prohibited even with regards to other benefit.\n* Plants grown together (kilayim): in the Land of Israel plants are to be grown separately and not in close proximity according to  and . A specific subdivision of this law is kil'ei ha-kerem, the prohibition of planting any grain or vegetable near a grapevine; this law applies to Jews throughout the world, and one may not derive benefit from the produce.\n\nRabbinically prohibited foods include:\n* Non-Jewish milk (chalav akum): milk that may have an admixture of milk from non-kosher animals (see below for current views on this prohibition).\n* Non-Jewish cheese (gevinat akum): cheese that may have been produced with non-kosher rennet.\n* Non-Jewish wine (stam yeinam): wine that while not produced for idolatrous purposes may otherwise have been poured for such a purpose or alternatively when consumed will lead to intermarriage.\n* Food cooked by a non-Jew (bishul akum): this law was enacted for concerns of intermarriage.\n* Non-Jewish bread (pat akum): this law was enacted for concerns of intermarriage.\n* Health risk (sakanah): certain foods and mixtures are considered a health risk, such as mixtures of fish and meat.\n\nPermitted and forbidden animals\n\nOnly meat from particular species is permissible. Mammals that both chew their cud (ruminate) and have cloven hooves can be kosher. Animals with one characteristic but not the other (the camel, the hyrax, and the hare because they have no cloven hooves, and the pig because it does not ruminate) are specifically excluded ().Shulchan Aruch, Yoreh De'ah 79For a comprehensive review of the issue involving the difficulty that neither the hyrax nor the hare are ruminants, see . In 2008, a rabbinical ruling determined that giraffes and their milk are eligible to be considered kosher. The giraffe has both split hooves and chews its cud, characteristics of animals considered kosher.  Findings from 2008 show that giraffe milk curdles, meeting kosher standards. Although kosher, the giraffe is not slaughtered today because the process would be very costly. Giraffes are difficult to restrain, and their use for food could cause the species to become endangered.Shulchan Aruch, Yoreh De'ah 82:1–5\n\nNon-kosher birds are listed outright () but the exact zoological references are disputed and some references refer to families of birds (24 are mentioned). The MishnahBavli Chullin 3:22–23 refers to four signs provided by the sages.  First, a dores (predatory bird) is not kosher.  Additionally, kosher birds possess three physical characteristics:  an extra toe in the back (which does not join the other toes in supporting the leg), a zefek (crop), and a korkoban (gizzard) with a peelable lumen.  However, individual Jews are barred from merely applying these regulations alone; an established tradition (masorah) is necessary to allow birds to be consumed, even if it can be substantiated that they meet all four criteria. The only exception to this is turkey.  There was a time when certain authorities considered the signs enough, so Jews started eating this bird without a masorah because it possesses all the signs (simanim) in Hebrew.\n\nFish must have fins and scales to be kosher (). Shellfish and other non-fish water animals fauna are not kosher.Shulchan Aruch, Yoreh De'ah 83 and 84 Here is a list of kosher species of fish. Insects are not kosher, except for certain species of kosher locust.Shulchan Aruch, Yoreh De'ah 85  Generally, any animal that eats other animals, whether they kill their food or eat carrion (), is not kosher, as well as any animal that has been partially eaten by other animals ().\n\nSeparation of meat and milk\n\nMeat and milk (or derivatives) cannot be mixed in the sense that meat and dairy products are not served at the same meal, served or cooked in the same utensils, or stored together. Observant Jews have separate sets of dishes, and sometimes different kitchens, for meat and milk, and wait anywhere between one and six hours after eating meat before consuming milk products.Shulchan Aruch, Yoreh De'ah 87 et seq The milchig and fleishig  (lit. milky and meaty) utensils and dishes are the commonly referred to Yiddish delineations between dairy and meat ones, respectively.\n\nKosher slaughter\n\nMammals and fowl must be slaughtered by a trained individual (a shochet) using a special method of slaughter, shechita (). Among other features, shechita slaughter severs the jugular vein, carotid artery, esophagus, and trachea in a single continuous cutting movement with an unserrated, sharp knife. Failure of any of these criteria renders the meat of the animal unsuitable. The body must be checked after slaughter to confirm that the animal had no medical condition or defect that would have caused it to die of its own accord within a year, which would make the meat unsuitable.Shulchan Aruch, Yoreh De'ah 1–65 These conditions (treifot) include 70 different categories of injuries, diseases, and abnormalities whose presence renders the animal non-kosher. It is forbidden to consume certain parts of the animal, such as certain fats (chelev) and the sciatic nerves from the legs, the process of excision being done by experts before the meat is sold. As much blood as possible must be removed () through the kashering process; this is usually done through soaking and salting the meat, but the liver, as it is rich in blood, is grilled over an open flame.Shulchan Aruch, Yoreh De'ah 66–78 Fish (and kosher locusts, for those who follow the traditions permitting them) must be killed before being eaten, but no particular method has been specified in Jewish law. Legal aspects of ritual slaughter are governed not only by Jewish law but civil law as well.\n\nPreparation of meats\n\nWhen an animal is ritually slaughtered (shechted) the raw meat is traditionally cut, rinsed and salted, prior to cooking. Salting of raw meat draws out the blood that lodges on the inner surface of the meat. Salting is made with any coarse grain of salt, while the meat is laid over a grating or colander to allow for drainage, and where the salt is allowed to remain on the meat for the duration of time that it takes to walk one biblical mileShulhan Arukh, Yoreh De'ah § 69:6; ibid., § 69:16–19 (appx. 18– 24 minutes). Afterwards, the residue of salt is rinsed away with water, and the meat cooked. Meat that is roasted requires no prior salting, as fire acts as a natural purgatory of blood. \n\nA late Commentary on the Shulchan Arukh known as the Taz (Turei Zahav), on Yoreh De'ah 69:5:16, writes that the pieces of meat can be \"very thick\" when salting.Shulhan Arukh, Yoreh De'ah, § 69:5 The Yemenite Jewish practice, however, follows Rabbi Saadiah Gaon who required that the meat not be larger than half a \"rotal\" (i.e. ca. 216 grams) when salting.Rabbi Isaac Alfasi on Tractate Ḥullin (ed. Yosef Qafih), chapter Kol haBasar, Jerusalem 1960, p. 98. This allows the effects of the salt to penetrate. Some Orthodox Jewish communities require the additional stricture of submersing raw meat in boiling water prior to cooking it, a practice known as ḥaliṭah (), “blanching.”Maimonides, Mishne Torah (Hil. Ma'achaloth Asuroth 6:10); cf. Babylonian Talmud, Hullin 111a. This was believed to constrict the blood lodged within the meat, to prevent its oozing out when it is eaten. The raw meat is left in the pot of boiling water for as long as it takes for the meat to whiten on its outer layer. If someone wanted to use the water for soup after making ḥaliṭah in the same pot, he simply scoops out the film, froth and scum that surface in the boiling water. Ḥaliṭah is not required when roasting meat over a fire, as the fire constricts the blood.\n\nKosher utensils\n\nUtensils used for non-kosher foods become non-kosher, and make even otherwise kosher food prepared with them non-kosher. Some such utensils, depending on the material they are made from, can be made suitable for preparing kosher food again by immersion in boiling water or by the application of a blowtorch. Food prepared in a manner that violates the Shabbat (Sabbath) may not be eaten; although in certain instances it is permitted after the Shabbat is over.Shulchan Aruch, Orach Chayim, 318:1\n\nPassover laws\n\nPassover has special dietary rules, the most important of which is the prohibition on eating leavened bread or derivatives of this, which are known as chametz. This prohibition is derived from . Utensils used in preparing and serving chametz are also forbidden on Passover unless they have been ritually cleansed (kashered).Shulchan Aruch, Orach Chayim, 431–452 Observant Jews often keep separate sets of meat and dairy utensils for Passover use only. In addition, some groups follow various eating restrictions on Passover that go beyond the rules of kashrut, such as not eating gebrochts or garlic.\n\nProduce of the Land of Israel\n\nBiblical rules also control the use of agriculture produce.  For produce grown in the Land of Israel a modified version of the  biblical tithes must be applied, including Terumat HaMaaser, Maaser Rishon, Maaser Sheni, and Maaser Ani (untithed produce is called tevel); the fruit of the first three years of a tree's growth or replanting are forbidden for eating or any other use as orlah; produce grown in the Land of Israel on the seventh year obtains k'dushat shvi'it, and unless managed carefully is forbidden as a violation of the Shmita (Sabbatical Year). Some rules of kashrut are subject to different rabbinical opinions. For example, many hold that the rule against eating chadash (new grain) before the 16th of the month Nisan does not apply outside the Land of Israel.\n\nVegetables\n\nMany vegetarian restaurants and producers of vegetarian foods acquire a hechsher, certifying that a Rabbinical organization has approved their products as being kosher. The hechsher usually certifies that certain vegetables have been checked for insect infestation and steps have been taken to ensure that cooked food meets the requirements of bishul Yisrael. Vegetables such as spinach and cauliflower must be checked for insect infestation. The proper procedure for inspecting and cleaning varies by species, growing conditions, and views of individual rabbis.\n\nPareve foods\n\nSome processes convert a meat or dairy product into a pareve (neither meat nor dairy) one. For example, rennet is sometimes made from stomach linings, yet is acceptable for making kosher cheese,The rennet must be kosher, either microbial or from special productions of animal rennet using kosher calf stomachs.[http://oukosher.org/index.php/articles/single/2828/ Oukosher.org] , Retrieved August 10, 2005. but such cheeses might not be acceptable to some vegetarians, who would eat only cheese made from a vegetarian rennet. The same applies to kosher gelatin, an animal product, derived from kosher animal sources. Other gelatin-like products from non-animal sources such as agar agar and carrageenan are pareve by nature. Fish gelatin is derived from fish and is therefore (like all kosher fish products) pareve. Eggs are also considered pareve despite being an animal product.\n\nKashrut has procedures by which equipment can be cleaned of its previous non-kosher use, but that might be inadequate for those with allergies, vegetarians, or adherents to other religious statutes. For example, dairy manufacturing equipment can be cleaned well enough that the rabbis grant pareve status to products manufactured with it. Nevertheless, someone with a strong allergic sensitivity to dairy products might still react to the dairy residue, and that is why some products that are legitimately pareve carry \"milk\" warnings.\n\nGenetically modified foods\n\nWith the advent of genetic engineering, a whole new type of food has been brought into the world, and scholars in both academia and Judaic faith have differing viewpoints on whether these new strains of foods are to be considered kosher or not. The first genetically modified animal approved by the FDA for human consumption is the AquAdvantage salmon, and while salmon is normally an acceptably kosher food, this modified organism has a gene from a nonkosher organism.\n\nSome put forth that this intermixing of species is against the teachings of the Talmud and thus against Jewish Law and nonkosher. Others argue that the one in sixty parts law of kashrut is of significance, and that the foreign gene accounts for the less than 1/60 of the animal and thus the modified salmon is kosher.http://www.rabbinicalassembly.org/sites/default/files/public/halakhah/teshuvot/2011-2020/nevins-gmos.pdf\n\nSupervision and marketing\n\nHashgacha\n\nCertain foods must be prepared in whole or in part by Jews. This includes grape wine,Shulchan Aruch, Yoreh De'ah 114 certain cooked foods (bishul akum),Shulchan Aruch, Yoreh De'ah 113 cheese (g'vinat akum), and according to some also butter (chem'at akum);Shulchan Aruch, Yoreh De'ah 115 dairy products (Hebrew: חלב ישראל chalav Yisrael \"milk of Israel\");Many rely on lenient rulings by Rabbi Moshe Feinstein in Teshuvot Igrot Moshe, Yoreh De'ah 1:47 and other 20th century rabbinic authorities who rule that strict government supervision prevents the admixture of non-kosher milk, making supervision unnecessary. See also  and bread  (Pas Yisroel).Shulchan Aruch, Yoreh De'ah 112, Orach Chayim 603\n\nProduct labeling standards\n\nAlthough reading the label of food products can identify obviously non-kosher ingredients, some countries allow manufacturers to omit identification of certain ingredients.  Such \"hidden\" ingredients may include lubricants and flavorings, among other additives; in some cases, for instance, the use of natural flavorings, these ingredients are more likely to be derived from non-kosher substances. Furthermore, certain products, such as fish, have a high rate of mislabeling, which may result in a non-kosher fish being sold in a package labeled as a species of kosher fish.\n\nProducers of foods and food additives can contact Jewish religious authorities to have their products certified as kosher: this involves a visit to the manufacturing facilities by an individual rabbi or a committee from a rabbinic organization, who will inspect the production methods and contents, and if everything is sufficiently kosher a certificate would be issued.\n\nManufacturers sometimes identify the products that have received such certification by adding particular graphical symbols to the label. These symbols are known in Judaism as hechsherim. Due to differences in kashrut standards held by different organizations, the hechsheirim of certain Jewish authorities may at times be considered invalid by other Jewish authorities. The certification marks of the various rabbis and organisations are too numerous to list, but one of the most commonly used in the United States of America is that of the Union of Orthodox Congregations, who use a U inside a circle (\"O-U\"), symbolising the initials of Orthodox Union. In Britain, a commonly used symbol is the \"KLBD\" logo of the London Beth Din.  A single K is sometimes used as a symbol for kosher, but since many countries do not allow letters to be trademarked (the method by which other symbols are protected from misuse), it only indicates that the company producing the product claims that it is kosher.\n\nMany of the certification symbols are accompanied by additional letters or words to indicate the category of the product, according to Jewish law; the categorisation may conflict with legal classifications, especially in the case of food that Jewish law regards as dairy, but legal classification does not.\n* D—Dairy\n* DE—Dairy equipment\n* M—Meat, including poultry\n* Pareve—Food that is neither meat nor dairy\n* Fish\n* P—Passover-related (P is not used for Pareve)\n\nIn many cases constant supervision is required because, for various reasons, such as changes in manufacturing processes, products that once were kosher may cease to be so. For example, a kosher lubricating oil may be replaced by one containing tallow, which many rabbinic authorities view as non-kosher. Such changes are often co-ordinated with the supervising rabbi, or supervising organisation, to ensure that new packaging does not suggest any hechsher or kashrut. In some cases, however, existing stocks of pre-printed labels with the hechsher may continue to be used on the now non-kosher product. An active grapevine among the Jewish community discusses which products are now questionable, as well as products which have become kosher but whose labels have yet to carry the hechsher. Some newspapers and periodicals also discuss kashrut products.\n\nProducts labeled kosher-style are non-kosher products that have characteristics of kosher foods, such as all-beef hot dogs, or are flavored or prepared in a manner consistent with Ashkenazi practices, like dill pickles. The designation usually refers to delicatessen items.\n\nHistory of kosher supervision and marketing\n\nFood producers often look to expand their markets or marketing potential, and offering kosher food has become a way to do that. The uniqueness of kosher food was advertised as early as 1849. In 1911 Procter & Gamble became the first company to advertise one of their products, Crisco, as kosher.\n\n Over the next two decades, companies such as Lender's Bagels, Maxwell House, Manischewitz, and Empire evolved and gave the kosher market more shelf-space. In the 1960s, Hebrew National hotdogs launched a \"we answer to a higher authority\" campaign to appeal to Jews and non-Jews alike. From that point on, \"kosher\" became a symbol for both quality and value. The kosher market quickly expanded, and with it more opportunities for kosher products. Menachem Lubinsky, founder of the Kosherfest trade fair, estimates as many as  kosher consumers and  in sales of kosher products in the USA.\n\nIn 2014 the Israeli Defense Forces decided to allow female kosher supervisors to work in its kitchens on military bases, and the first women kosher inspectors were \ncertified in Israel.\n\nLegal usage\n\nAdvertising standards laws in many jurisdictions prohibit the use of the phrase kosher in a product's labelling unless the producer can show that the product conforms to Jewish dietary laws; however, different jurisdictions often define the legal qualifications for conforming to Jewish dietary laws differently. For example, in some places the law may require that a rabbi certify the kashrut nature, in others the rules of kosher are fully defined in law, and in others still it is sufficient that the manufacturer only believes that the product complies with Jewish dietary regulations. In several cases, laws restricting the use of the term kosher have later been determined to be illegal religious interference.\n\nCosts\n\nIn the United States the cost of certification for mass-produced items is typically minuscule, and is usually more than offset by the advantages of being certified. In 1975 The New York Times estimated the cost per item for obtaining kosher certification at 6.5 millionths of a cent ($0.000000065) per item for a General Foods frozen-food item. According to a 2005 report by Burns & McDonnell, most US national certifying agencies are non-profit, only charging for supervision and on-site work, for which the on-site supervisor \"typically makes less per visit than an auto mechanic does per hour\". However, re-engineering an existing manufacturing process can be costly. Certification usually leads to increased revenues by opening up additional markets to Jews who keep kosher, Muslims who keep halal, Seventh-day Adventists who keep the main laws of Kosher Diet, vegetarians, and the lactose-intolerant who wish to avoid dairy products (products that are reliably certified as pareve meet this criterion). According to the Orthodox Union, one of the largest kashrut organizations in the United States, \"when positioned next to a competing non-kosher brand, a kosher product will do better by 20%\".\n\nIn some European communities there is a special tax imposed on the purchase of kosher meat to help support the community's educational institutions. In 2009 delegates at a meeting of the Rabbinical Council of Europe broadly agreed that the tax which supports the rabbinate, mikvo’os and other communal facilities should be reduced. \"While the supermarket Tesco sells a whole chicken for £2, its kosher counterpart of similar weight costs five to six times more.\"\n\nSociety and culture\n\nAdherence\n\nA 2013 survey found that 22% of American Jews surveyed claimed to keep kosher in the home.\n\nMany Jews observe kashrut partially, by abstaining from pork or shellfish, or by not drinking milk with a meat dish. Some keep kosher at home but will eat in a non-kosher restaurant. In 2012, one analysis of the specialty food market in North America estimated that only 15% of kosher consumers were Jewish. A sizable non-Jewish segment of the population views kosher certification as an indication of wholesomeness. Muslims, Hindus, and people with allergies to dairy foods often consider the kosher-pareve designation as an assurance that a food contains no animal-derived ingredients, including milk and all of its derivatives. However, since kosher-pareve foods may contain honey, eggs, or fish, strict vegetarians cannot rely on the certification.\n\nLinguistics\n\nIn Ancient Hebrew Kosher () means be advantageous, proper, suitable, or succeed according to the Brown-Driver-Briggs Hebrew and English Lexicon.  In Modern Hebrew, it generally refers to kashrut but it can also sometimes mean \"proper\". For example, the Babylonian Talmud uses kosher in the sense of virtuous, when referring to Darius I as a \"kosher king\"; Darius, a Persian King, assisted in building the Second Temple.Tractate Rosh Hashanah 3b, Schottenstein Edition, Mesorah Publications Ltd. In English, kosher often means legitimate, acceptable, permissible, genuine, or authentic.\n\nThe word kosher is also part of some common product names. Sometimes it is used as an abbreviation of koshering, meaning the process for making something kosher; for example, kosher salt is a form of salt with irregularly shaped crystals, making it particularly suitable for preparing meat according to the rules of kashrut, because the increased surface area of the crystals absorbs blood more effectively. At other times it is used as a synonym for Jewish tradition; for example, a kosher dill pickle is simply a pickle made in the traditional manner of Jewish New York City pickle makers, using a generous addition of garlic to the brine, and is not necessarily compliant with the traditional Jewish food laws.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kashrut" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16881" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kashrut (also kashruth or kashrus, ) is a set of Jewish religious dietary laws. Food that may be consumed according to halakha (Jewish law) is termed kosher ( in English, ), from the Ashkenazi pronunciation of the Hebrew term kashér (), meaning \"fit\" (in this context, fit for consumption).\n\nAmong the numerous laws that form part of kashrut are the prohibitions on the consumption of certain animals (such as pork, shellfish [both Mollusca and Crustacea], and most insects, with the exception of certain species of kosher locusts), mixtures of meat and milk, and the commandment to slaughter mammals and birds according to a process known as shechita. There are also laws regarding agricultural produce that might impact the suitability of food for consumption.\n\nMost of the basic laws of kashrut are derived from the Torah's Books of Leviticus and Deuteronomy. Their details and practical application, however, are set down in the oral law (eventually codified in the Mishnah and Talmud) and elaborated on in the later rabbinical literature. Although the Torah does not state the rationale for most kashrut laws, some suggest that they are only tests for man's obedience,Maimonides, Guide for the Perplexed (ed. M. Friedländer), Part III (chapter 26), New York 1956, p. 311 while others have suggested philosophical, practical and hygienic reasons.Maimonides, Guide for the Perplexed (ed. M. Friedländer), Part III (chapter 48), New York 1956, p. 371\n\nOver the past century, there have developed numerous rabbinical organizations that certify products, manufacturers, and restaurants as kosher, usually using a symbol (called a hechsher) to indicate their support. Currently, about a sixth of American Jews or 0.3% of the American population fully keep kosher, and there are many more who  do not strictly follow all the rules but still abstain from some prohibited foods (especially pork).\n\nExplanations\n\nPhilosophical\n\nJewish philosophy divides the 613 mitzvot into three groups—laws that have a rational explanation and would probably be enacted by most orderly societies, (mishpatim), laws that are understood after being explained but would not be legislated without the Torah's command (edot), and laws that do not have a rational explanation (chukim). Some Jewish scholars say that kashrut should be categorized as laws for which there is no particular explanation, since the human mind is not always capable of understanding divine intentions. However, many believe that it could be because of the concept that many rabbis refer to as \"glabenshlugan\". This concept is uncommon in most Jewish laws, but it is present in the laws of kashrut, as R'Sprintza Pesha said in her book. In this line of thinking, the dietary laws were given as a demonstration of God's authority, and man must obey without asking why., December 1998 (archived from [http://www.adventistbiblicalresearch.org/documents/Clean%20&%20Unclean%20Meats.htm the original]  ) However, Maimonides believed that Jews were permitted to seek out reasons for the laws of the Torah.Mishneh Torah Korbanot, Temurah 4:13 (in eds. Frankel; \"Rambam L'Am\")\n\nSome theologians have said that the laws of kashrut are symbolic in character: Kosher animals represent virtues, while non-kosher animals represent vices. The 1st century BCE Letter of Aristeas argues that the laws \"have been given ... to awake pious thoughts and to form the character\".Letter of Aristeas, 145–154 This view reappears in the work of the 19th century Rabbi Samson Raphael Hirsch.\n\nThe Torah prohibits \"seething the kid (goat, sheep, calf) in its mother's milk\". While the Bible does not provide a reason, it has been suggested that the practice was perceived as cruel and insensitive. quoting Deuteronomy Rabbah 6:1\n\nHasidic Judaism believes that everyday life is imbued with channels connecting with Divinity, the activation of which it sees as helping the Divine Presence to be drawn into the physical world; Hasidism argues that the food laws are related to the way such channels, termed sparks of holiness, interact with various animals. These sparks of Holiness are released whenever a Jew manipulates any object for a holy reason (which includes eating); however, not all animal products are capable of releasing their sparks of holiness. The Hasidic argument is that  animals are imbued with signs that reveal the release of these sparks, and the signs are expressed in the biblical categorization of ritually clean and ritually unclean., rabbifriedman.org (archived from [http://www.rabbifriedman.org/sichaReeh.asp the original]  on August 29, 2007).\n\nAccording to Christian theologian Gordon J. Wenham, the purpose of kashrut was to help Jews maintain a distinct and separate existence from other peoples; he says that the effect of the laws was to prevent socialization and intermarriage with non-Jews, preventing Jewish identity from being diluted.Gordon J. Wenham, The Theology of Unclean Food, The Evangelical Quarterly 53, January March 1981, pp.6–15 Wenham argued that since the impact of the food laws was a public affair, this would have enhanced Jewish attachment to them as a reminder of their distinct status as Jews.\n\nMedical\n\nThere have been attempts to provide empirical support for the view that Jewish food laws have an overarching health benefit or purpose, one of the earliest being from Maimonides in his Guide for the Perplexed.  In 1953, David Macht, an Orthodox Jew and proponent of the theory of biblical scientific foresight, conducted toxicity experiments on many kinds of animals and fish. His experiment involved lupin seedlings being supplied with extracts from the meat of various animals; Macht reported that in 100% of cases, extracts from ritually unclean meat inhibited the seedling's growth more than that from ritually clean meats. op. cit. At the same time, these explanations are controversial. Scholar Lester L. Grabbe, writing in the Oxford Bible Commentary on Leviticus, says \"[a]n explanation now almost universally rejected is that the laws in this section [] have hygiene as their basis. Although some of the laws of ritual purity roughly correspond to modern ideas of physical cleanliness, many of them have little to do with hygiene. For example, there is no evidence that the 'unclean' animals are intrinsically bad to eat or to be avoided in a Mediterranean climate, as is sometimes asserted.\"The Oxford Bible Commentary, eds. J. Barton and J. Muddiman. Oxford: Oxford University Press. 2001: 99.\n\nProhibited foods\n\nThe laws of kashrut can be classified according to the origin of the prohibition (Biblical or rabbinical) and whether the prohibition concerns the food itself or a mixture of foods.\n\nBiblically prohibited foods include:\n* Non-kosher animals and birds (based on  and ): mammals require certain identifying characteristics (cloven hooves and being ruminants), while birds require a tradition that they can be consumed. Fish require scales and fins (thus excluding catfish, for instance). All invertebrates are non-kosher apart from certain types of locust, on which most communities lack a clear tradition. No reptiles or amphibians are kosher.\n* Carrion (nevelah): meat from a kosher animal that has not been slaughtered according to the laws of shechita. This prohibition includes animals that have been slaughtered by non-Jews.Babylonian Talmud, Hullin 13a (on Mishnah Hullin 1:1).\n* Injured (terefah): an animal with a significant defect or injury, such as a fractured bone or particular types of lung adhesions.\n* Blood (dam): blood of kosher mammals and fowl is removed through salting, with special procedures for the liver, which is very rich in blood.\n* Particular fats (chelev): particular parts of the abdominal fat of cattle, goats and sheep must be removed by a process called nikkur.\n* The twisted nerve (gid hanasheh): the sciatic nerve, as according to  the patriarch Jacob's was damaged when he fought with an angel, cannot be eaten and is removed by nikkur.\n* Limb of a living animal (ever min ha-chai): in , God forbade Noah and his descendants to consume a limb torn from a live animal. Hence, Jewish law considers this prohibition applicable even to non-Jews, and therefore, a Jew may not give or sell such meat to a non-Jew.\n* Untithed food (tevel): produce of the Land of Israel requires the removal of certain tithes, which in ancient times were given to the Kohanim (priests), Levites and the poor (terumah, maaser rishon and maaser ani respectively) or taken to the Old City of Jerusalem to be eaten there (maaser sheni).\n* Fruit during the first three years (orlah): according to , fruit from a tree in the first three years after planting cannot be consumed (both in the Land of Israel and the diaspora). This applies also to the fruit of the vine—grapes, and wine produced from them.\n* New grain (chadash): in  the Bible prohibits newly grown grain (planted after Passover the previous year) until the second day of Passover; there is debate as to whether this law applies to grain grown outside the Land of Israel.\n* Wine of libation (yayin nesekh): wine that may have been dedicated to idolatrous practices.\n\nBiblically prohibited mixtures include:\n* Mixtures of meat and milk(basar be-chalav): this law derives from the broad interpretation of the commandment not to \"cook a kid in its mother's milk\" (, , and ); other non-kosher food may be used for other benefit (e.g. sold to non-Jews), but mixtures of meat and milk are prohibited even with regards to other benefit.\n* Plants grown together (kilayim): in the Land of Israel plants are to be grown separately and not in close proximity according to  and . A specific subdivision of this law is kil'ei ha-kerem, the prohibition of planting any grain or vegetable near a grapevine; this law applies to Jews throughout the world, and one may not derive benefit from the produce.\n\nRabbinically prohibited foods include:\n* Non-Jewish milk (chalav akum): milk that may have an admixture of milk from non-kosher animals (see below for current views on this prohibition).\n* Non-Jewish cheese (gevinat akum): cheese that may have been produced with non-kosher rennet.\n* Non-Jewish wine (stam yeinam): wine that while not produced for idolatrous purposes may otherwise have been poured for such a purpose or alternatively when consumed will lead to intermarriage.\n* Food cooked by a non-Jew (bishul akum): this law was enacted for concerns of intermarriage.\n* Non-Jewish bread (pat akum): this law was enacted for concerns of intermarriage.\n* Health risk (sakanah): certain foods and mixtures are considered a health risk, such as mixtures of fish and meat.\n\nPermitted and forbidden animals\n\nOnly meat from particular species is permissible. Mammals that both chew their cud (ruminate) and have cloven hooves can be kosher. Animals with one characteristic but not the other (the camel, the hyrax, and the hare because they have no cloven hooves, and the pig because it does not ruminate) are specifically excluded ().Shulchan Aruch, Yoreh De'ah 79For a comprehensive review of the issue involving the difficulty that neither the hyrax nor the hare are ruminants, see . In 2008, a rabbinical ruling determined that giraffes and their milk are eligible to be considered kosher. The giraffe has both split hooves and chews its cud, characteristics of animals considered kosher.  Findings from 2008 show that giraffe milk curdles, meeting kosher standards. Although kosher, the giraffe is not slaughtered today because the process would be very costly. Giraffes are difficult to restrain, and their use for food could cause the species to become endangered.Shulchan Aruch, Yoreh De'ah 82:1–5\n\nNon-kosher birds are listed outright () but the exact zoological references are disputed and some references refer to families of birds (24 are mentioned). The MishnahBavli Chullin 3:22–23 refers to four signs provided by the sages.  First, a dores (predatory bird) is not kosher.  Additionally, kosher birds possess three physical characteristics:  an extra toe in the back (which does not join the other toes in supporting the leg), a zefek (crop), and a korkoban (gizzard) with a peelable lumen.  However, individual Jews are barred from merely applying these regulations alone; an established tradition (masorah) is necessary to allow birds to be consumed, even if it can be substantiated that they meet all four criteria. The only exception to this is turkey.  There was a time when certain authorities considered the signs enough, so Jews started eating this bird without a masorah because it possesses all the signs (simanim) in Hebrew.\n\nFish must have fins and scales to be kosher (). Shellfish and other non-fish water animals fauna are not kosher.Shulchan Aruch, Yoreh De'ah 83 and 84 Here is a list of kosher species of fish. Insects are not kosher, except for certain species of kosher locust.Shulchan Aruch, Yoreh De'ah 85  Generally, any animal that eats other animals, whether they kill their food or eat carrion (), is not kosher, as well as any animal that has been partially eaten by other animals ().\n\nSeparation of meat and milk\n\nMeat and milk (or derivatives) cannot be mixed in the sense that meat and dairy products are not served at the same meal, served or cooked in the same utensils, or stored together. Observant Jews have separate sets of dishes, and sometimes different kitchens, for meat and milk, and wait anywhere between one and six hours after eating meat before consuming milk products.Shulchan Aruch, Yoreh De'ah 87 et seq The milchig and fleishig  (lit. milky and meaty) utensils and dishes are the commonly referred to Yiddish delineations between dairy and meat ones, respectively.\n\nKosher slaughter\n\nMammals and fowl must be slaughtered by a trained individual (a shochet) using a special method of slaughter, shechita (). Among other features, shechita slaughter severs the jugular vein, carotid artery, esophagus, and trachea in a single continuous cutting movement with an unserrated, sharp knife. Failure of any of these criteria renders the meat of the animal unsuitable. The body must be checked after slaughter to confirm that the animal had no medical condition or defect that would have caused it to die of its own accord within a year, which would make the meat unsuitable.Shulchan Aruch, Yoreh De'ah 1–65 These conditions (treifot) include 70 different categories of injuries, diseases, and abnormalities whose presence renders the animal non-kosher. It is forbidden to consume certain parts of the animal, such as certain fats (chelev) and the sciatic nerves from the legs, the process of excision being done by experts before the meat is sold. As much blood as possible must be removed () through the kashering process; this is usually done through soaking and salting the meat, but the liver, as it is rich in blood, is grilled over an open flame.Shulchan Aruch, Yoreh De'ah 66–78 Fish (and kosher locusts, for those who follow the traditions permitting them) must be killed before being eaten, but no particular method has been specified in Jewish law. Legal aspects of ritual slaughter are governed not only by Jewish law but civil law as well.\n\nPreparation of meats\n\nWhen an animal is ritually slaughtered (shechted) the raw meat is traditionally cut, rinsed and salted, prior to cooking. Salting of raw meat draws out the blood that lodges on the inner surface of the meat. Salting is made with any coarse grain of salt, while the meat is laid over a grating or colander to allow for drainage, and where the salt is allowed to remain on the meat for the duration of time that it takes to walk one biblical mileShulhan Arukh, Yoreh De'ah § 69:6; ibid., § 69:16–19 (appx. 18– 24 minutes). Afterwards, the residue of salt is rinsed away with water, and the meat cooked. Meat that is roasted requires no prior salting, as fire acts as a natural purgatory of blood. \n\nA late Commentary on the Shulchan Arukh known as the Taz (Turei Zahav), on Yoreh De'ah 69:5:16, writes that the pieces of meat can be \"very thick\" when salting.Shulhan Arukh, Yoreh De'ah, § 69:5 The Yemenite Jewish practice, however, follows Rabbi Saadiah Gaon who required that the meat not be larger than half a \"rotal\" (i.e. ca. 216 grams) when salting.Rabbi Isaac Alfasi on Tractate Ḥullin (ed. Yosef Qafih), chapter Kol haBasar, Jerusalem 1960, p. 98. This allows the effects of the salt to penetrate. Some Orthodox Jewish communities require the additional stricture of submersing raw meat in boiling water prior to cooking it, a practice known as ḥaliṭah (), “blanching.”Maimonides, Mishne Torah (Hil. Ma'achaloth Asuroth 6:10); cf. Babylonian Talmud, Hullin 111a. This was believed to constrict the blood lodged within the meat, to prevent its oozing out when it is eaten. The raw meat is left in the pot of boiling water for as long as it takes for the meat to whiten on its outer layer. If someone wanted to use the water for soup after making ḥaliṭah in the same pot, he simply scoops out the film, froth and scum that surface in the boiling water. Ḥaliṭah is not required when roasting meat over a fire, as the fire constricts the blood.\n\nKosher utensils\n\nUtensils used for non-kosher foods become non-kosher, and make even otherwise kosher food prepared with them non-kosher. Some such utensils, depending on the material they are made from, can be made suitable for preparing kosher food again by immersion in boiling water or by the application of a blowtorch. Food prepared in a manner that violates the Shabbat (Sabbath) may not be eaten; although in certain instances it is permitted after the Shabbat is over.Shulchan Aruch, Orach Chayim, 318:1\n\nPassover laws\n\nPassover has special dietary rules, the most important of which is the prohibition on eating leavened bread or derivatives of this, which are known as chametz. This prohibition is derived from . Utensils used in preparing and serving chametz are also forbidden on Passover unless they have been ritually cleansed (kashered).Shulchan Aruch, Orach Chayim, 431–452 Observant Jews often keep separate sets of meat and dairy utensils for Passover use only. In addition, some groups follow various eating restrictions on Passover that go beyond the rules of kashrut, such as not eating gebrochts or garlic.\n\nProduce of the Land of Israel\n\nBiblical rules also control the use of agriculture produce.  For produce grown in the Land of Israel a modified version of the  biblical tithes must be applied, including Terumat HaMaaser, Maaser Rishon, Maaser Sheni, and Maaser Ani (untithed produce is called tevel); the fruit of the first three years of a tree's growth or replanting are forbidden for eating or any other use as orlah; produce grown in the Land of Israel on the seventh year obtains k'dushat shvi'it, and unless managed carefully is forbidden as a violation of the Shmita (Sabbatical Year). Some rules of kashrut are subject to different rabbinical opinions. For example, many hold that the rule against eating chadash (new grain) before the 16th of the month Nisan does not apply outside the Land of Israel.\n\nVegetables\n\nMany vegetarian restaurants and producers of vegetarian foods acquire a hechsher, certifying that a Rabbinical organization has approved their products as being kosher. The hechsher usually certifies that certain vegetables have been checked for insect infestation and steps have been taken to ensure that cooked food meets the requirements of bishul Yisrael. Vegetables such as spinach and cauliflower must be checked for insect infestation. The proper procedure for inspecting and cleaning varies by species, growing conditions, and views of individual rabbis.\n\nPareve foods\n\nSome processes convert a meat or dairy product into a pareve (neither meat nor dairy) one. For example, rennet is sometimes made from stomach linings, yet is acceptable for making kosher cheese,The rennet must be kosher, either microbial or from special productions of animal rennet using kosher calf stomachs.[http://oukosher.org/index.php/articles/single/2828/ Oukosher.org] , Retrieved August 10, 2005. but such cheeses might not be acceptable to some vegetarians, who would eat only cheese made from a vegetarian rennet. The same applies to kosher gelatin, an animal product, derived from kosher animal sources. Other gelatin-like products from non-animal sources such as agar agar and carrageenan are pareve by nature. Fish gelatin is derived from fish and is therefore (like all kosher fish products) pareve. Eggs are also considered pareve despite being an animal product.\n\nKashrut has procedures by which equipment can be cleaned of its previous non-kosher use, but that might be inadequate for those with allergies, vegetarians, or adherents to other religious statutes. For example, dairy manufacturing equipment can be cleaned well enough that the rabbis grant pareve status to products manufactured with it. Nevertheless, someone with a strong allergic sensitivity to dairy products might still react to the dairy residue, and that is why some products that are legitimately pareve carry \"milk\" warnings.\n\nGenetically modified foods\n\nWith the advent of genetic engineering, a whole new type of food has been brought into the world, and scholars in both academia and Judaic faith have differing viewpoints on whether these new strains of foods are to be considered kosher or not. The first genetically modified animal approved by the FDA for human consumption is the AquAdvantage salmon, and while salmon is normally an acceptably kosher food, this modified organism has a gene from a nonkosher organism.\n\nSome put forth that this intermixing of species is against the teachings of the Talmud and thus against Jewish Law and nonkosher. Others argue that the one in sixty parts law of kashrut is of significance, and that the foreign gene accounts for the less than 1/60 of the animal and thus the modified salmon is kosher.http://www.rabbinicalassembly.org/sites/default/files/public/halakhah/teshuvot/2011-2020/nevins-gmos.pdf\n\nSupervision and marketing\n\nHashgacha\n\nCertain foods must be prepared in whole or in part by Jews. This includes grape wine,Shulchan Aruch, Yoreh De'ah 114 certain cooked foods (bishul akum),Shulchan Aruch, Yoreh De'ah 113 cheese (g'vinat akum), and according to some also butter (chem'at akum);Shulchan Aruch, Yoreh De'ah 115 dairy products (Hebrew: חלב ישראל chalav Yisrael \"milk of Israel\");Many rely on lenient rulings by Rabbi Moshe Feinstein in Teshuvot Igrot Moshe, Yoreh De'ah 1:47 and other 20th century rabbinic authorities who rule that strict government supervision prevents the admixture of non-kosher milk, making supervision unnecessary. See also  and bread  (Pas Yisroel).Shulchan Aruch, Yoreh De'ah 112, Orach Chayim 603\n\nProduct labeling standards\n\nAlthough reading the label of food products can identify obviously non-kosher ingredients, some countries allow manufacturers to omit identification of certain ingredients.  Such \"hidden\" ingredients may include lubricants and flavorings, among other additives; in some cases, for instance, the use of natural flavorings, these ingredients are more likely to be derived from non-kosher substances. Furthermore, certain products, such as fish, have a high rate of mislabeling, which may result in a non-kosher fish being sold in a package labeled as a species of kosher fish.\n\nProducers of foods and food additives can contact Jewish religious authorities to have their products certified as kosher: this involves a visit to the manufacturing facilities by an individual rabbi or a committee from a rabbinic organization, who will inspect the production methods and contents, and if everything is sufficiently kosher a certificate would be issued.\n\nManufacturers sometimes identify the products that have received such certification by adding particular graphical symbols to the label. These symbols are known in Judaism as hechsherim. Due to differences in kashrut standards held by different organizations, the hechsheirim of certain Jewish authorities may at times be considered invalid by other Jewish authorities. The certification marks of the various rabbis and organisations are too numerous to list, but one of the most commonly used in the United States of America is that of the Union of Orthodox Congregations, who use a U inside a circle (\"O-U\"), symbolising the initials of Orthodox Union. In Britain, a commonly used symbol is the \"KLBD\" logo of the London Beth Din.  A single K is sometimes used as a symbol for kosher, but since many countries do not allow letters to be trademarked (the method by which other symbols are protected from misuse), it only indicates that the company producing the product claims that it is kosher.\n\nMany of the certification symbols are accompanied by additional letters or words to indicate the category of the product, according to Jewish law; the categorisation may conflict with legal classifications, especially in the case of food that Jewish law regards as dairy, but legal classification does not.\n* D—Dairy\n* DE—Dairy equipment\n* M—Meat, including poultry\n* Pareve—Food that is neither meat nor dairy\n* Fish\n* P—Passover-related (P is not used for Pareve)\n\nIn many cases constant supervision is required because, for various reasons, such as changes in manufacturing processes, products that once were kosher may cease to be so. For example, a kosher lubricating oil may be replaced by one containing tallow, which many rabbinic authorities view as non-kosher. Such changes are often co-ordinated with the supervising rabbi, or supervising organisation, to ensure that new packaging does not suggest any hechsher or kashrut. In some cases, however, existing stocks of pre-printed labels with the hechsher may continue to be used on the now non-kosher product. An active grapevine among the Jewish community discusses which products are now questionable, as well as products which have become kosher but whose labels have yet to carry the hechsher. Some newspapers and periodicals also discuss kashrut products.\n\nProducts labeled kosher-style are non-kosher products that have characteristics of kosher foods, such as all-beef hot dogs, or are flavored or prepared in a manner consistent with Ashkenazi practices, like dill pickles. The designation usually refers to delicatessen items.\n\nHistory of kosher supervision and marketing\n\nFood producers often look to expand their markets or marketing potential, and offering kosher food has become a way to do that. The uniqueness of kosher food was advertised as early as 1849. In 1911 Procter & Gamble became the first company to advertise one of their products, Crisco, as kosher.\n\n Over the next two decades, companies such as Lender's Bagels, Maxwell House, Manischewitz, and Empire evolved and gave the kosher market more shelf-space. In the 1960s, Hebrew National hotdogs launched a \"we answer to a higher authority\" campaign to appeal to Jews and non-Jews alike. From that point on, \"kosher\" became a symbol for both quality and value. The kosher market quickly expanded, and with it more opportunities for kosher products. Menachem Lubinsky, founder of the Kosherfest trade fair, estimates as many as  kosher consumers and  in sales of kosher products in the USA.\n\nIn 2014 the Israeli Defense Forces decided to allow female kosher supervisors to work in its kitchens on military bases, and the first women kosher inspectors were \ncertified in Israel.\n\nLegal usage\n\nAdvertising standards laws in many jurisdictions prohibit the use of the phrase kosher in a product's labelling unless the producer can show that the product conforms to Jewish dietary laws; however, different jurisdictions often define the legal qualifications for conforming to Jewish dietary laws differently. For example, in some places the law may require that a rabbi certify the kashrut nature, in others the rules of kosher are fully defined in law, and in others still it is sufficient that the manufacturer only believes that the product complies with Jewish dietary regulations. In several cases, laws restricting the use of the term kosher have later been determined to be illegal religious interference.\n\nCosts\n\nIn the United States the cost of certification for mass-produced items is typically minuscule, and is usually more than offset by the advantages of being certified. In 1975 The New York Times estimated the cost per item for obtaining kosher certification at 6.5 millionths of a cent ($0.000000065) per item for a General Foods frozen-food item. According to a 2005 report by Burns & McDonnell, most US national certifying agencies are non-profit, only charging for supervision and on-site work, for which the on-site supervisor \"typically makes less per visit than an auto mechanic does per hour\". However, re-engineering an existing manufacturing process can be costly. Certification usually leads to increased revenues by opening up additional markets to Jews who keep kosher, Muslims who keep halal, Seventh-day Adventists who keep the main laws of Kosher Diet, vegetarians, and the lactose-intolerant who wish to avoid dairy products (products that are reliably certified as pareve meet this criterion). According to the Orthodox Union, one of the largest kashrut organizations in the United States, \"when positioned next to a competing non-kosher brand, a kosher product will do better by 20%\".\n\nIn some European communities there is a special tax imposed on the purchase of kosher meat to help support the community's educational institutions. In 2009 delegates at a meeting of the Rabbinical Council of Europe broadly agreed that the tax which supports the rabbinate, mikvo’os and other communal facilities should be reduced. \"While the supermarket Tesco sells a whole chicken for £2, its kosher counterpart of similar weight costs five to six times more.\"\n\nSociety and culture\n\nAdherence\n\nA 2013 survey found that 22% of American Jews surveyed claimed to keep kosher in the home.\n\nMany Jews observe kashrut partially, by abstaining from pork or shellfish, or by not drinking milk with a meat dish. Some keep kosher at home but will eat in a non-kosher restaurant. In 2012, one analysis of the specialty food market in North America estimated that only 15% of kosher consumers were Jewish. A sizable non-Jewish segment of the population views kosher certification as an indication of wholesomeness. Muslims, Hindus, and people with allergies to dairy foods often consider the kosher-pareve designation as an assurance that a food contains no animal-derived ingredients, including milk and all of its derivatives. However, since kosher-pareve foods may contain honey, eggs, or fish, strict vegetarians cannot rely on the certification.\n\nLinguistics\n\nIn Ancient Hebrew Kosher () means be advantageous, proper, suitable, or succeed according to the Brown-Driver-Briggs Hebrew and English Lexicon.  In Modern Hebrew, it generally refers to kashrut but it can also sometimes mean \"proper\". For example, the Babylonian Talmud uses kosher in the sense of virtuous, when referring to Darius I as a \"kosher king\"; Darius, a Persian King, assisted in building the Second Temple.Tractate Rosh Hashanah 3b, Schottenstein Edition, Mesorah Publications Ltd. In English, kosher often means legitimate, acceptable, permissible, genuine, or authentic.\n\nThe word kosher is also part of some common product names. Sometimes it is used as an abbreviation of koshering, meaning the process for making something kosher; for example, kosher salt is a form of salt with irregularly shaped crystals, making it particularly suitable for preparing meat according to the rules of kashrut, because the increased surface area of the crystals absorbs blood more effectively. At other times it is used as a synonym for Jewish tradition; for example, a kosher dill pickle is simply a pickle made in the traditional manner of Jewish New York City pickle makers, using a generous addition of garlic to the brine, and is not necessarily compliant with the traditional Jewish food laws. Kashrut. http://en.wikipedia.org/?curid=16881."
  }
}
