{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13956",
  "eid" : "105c2250-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778536693,
  "textBody" : "Heraclius (; ; c. 575 – February 11, 641) was the Emperor of the Byzantine (Eastern Roman) Empire from 610 to 641.\n\nHe was responsible for introducing Greek as the Eastern Roman Empire's official language. His rise to power began in 608, when he and his father, Heraclius the Elder, the exarch of Africa, led a revolt against the unpopular usurper Phocas.\n\nHeraclius's reign was marked by several military campaigns. The year Heraclius came to power, the empire was threatened on multiple frontiers. Heraclius immediately took charge of the Byzantine–Sasanian War of 602–628. The first battles of the campaign ended in defeat for the Byzantines; the Persian army fought their way to the Bosphorus but Constantinople was protected by impenetrable walls and a strong navy, and Heraclius was able to avoid total defeat. Soon after, he initiated reforms to rebuild and strengthen the military. Heraclius drove the Persians out of Asia Minor and pushed deep into their territory, defeating them decisively in 627 at the Battle of Nineveh. The Persian king Khosrau II was overthrown and executed by his son Kavadh II, who soon sued for a peace treaty, agreeing to withdraw from all occupied territory. This way peaceful relations were restored to the two deeply strained empires.\n\nHeraclius soon experienced a new event, the Muslim conquests. Emerging from the Arabian Peninsula, the Muslims quickly conquered the Sasanian Empire. In 634 the Muslims marched into Roman Syria, defeating Heraclius's brother Theodore. Within a short period of time, the Arabs conquered Mesopotamia, Armenia and Egypt.\n\nHeraclius entered diplomatic relations with the Croats and Serbs in the Balkans. He tried to repair the schism in the Christian church in regard to the Monophysites, by promoting a compromise doctrine called Monothelitism. The Church of the East (commonly called Nestorian) was also involved in the process.[http://east-west.rsuh.ru/article.html?id=67105 Seleznyov N.N. \"Heraclius and Ishoʿyahb II\"] , Simvol 61: Syriaca-Arabica-Iranica. (Paris-Moscow, 2012), pp. 280–300. Eventually this project of unity was rejected by all sides of the dispute.\n\nEarly life\n\nOrigins\n\nHeraclius was the eldest son of Heraclius the Elder and Epiphania, of a family of possible Armenian origin from Cappadocia,Treadgold 1997, p. 287. with speculative Arsacid descent. Beyond that, there is little specific information known about his ancestry. His father was a key general during Emperor Maurice's war with Bahrām Chobin, usurper of the Sasanian Empire, during 590.Kaegi 2003, pp. 24–25.  After the war, Maurice appointed Heraclius the Elder to the position of Exarch of Africa.\n\nRevolt against Phocas and accession\n\nIn 608, Heraclius the Elder renounced his loyalty to the Emperor Phocas, who had overthrown Maurice six years earlier. The rebels issued coins showing both Heraclii dressed as consuls, though neither of them explicitly claimed the imperial title at this time.Mitchell 2007, p. 411. Heraclius's younger cousin Nicetas launched an overland invasion of Egypt; by 609, he had defeated Phocas's general Bonosus and secured the province. Meanwhile, the younger Heraclius sailed eastward with another force via Sicily and Cyprus.\n\nAs he approached Constantinople, he made contact with prominent leaders and planned an attack to overthrow aristocrats in the city, and soon arranged a ceremony where he was crowned and acclaimed as Emperor. When he reached the capital, the Excubitors, an elite Imperial Guard unit led by Phocas's son-in-law Priscus, deserted to Heraclius, and he entered the city without serious resistance. When Heraclius captured Phocas, he asked him \"Is this how you have ruled, wretch?\" Phocas's reply—\"And will you rule better?\"—so enraged Heraclius that he beheaded Phocas on the spot.Olster 1993, p. 133. He later had the genitalia removed from the body because Phocas had raped the wife of Photius, a powerful politician in the city..\n\nOn October 5, 610, Heraclius was crowned for a second time, this time in the Chapel of St. Stephen within the  Great Palace; at the same time he married Fabia, who took the name Eudokia. After her death in 612, he married his niece Martina in 613; this second marriage was considered incestuous and was very unpopular.Kaegi 2003, p. 106. In the reign of Heraclius's two sons, the divisive Martina was to become the center of power and political intrigue. Despite widespread hatred for Martina in Constantinople, Heraclius took her on campaigns with him and refused attempts by Patriarch Sergius to prevent and later dissolve the marriage.\n\nByzantine–Sasanian War of 602–628\n\nInitial Persian advantage\n\nDuring his Balkan Campaigns, Emperor Maurice and his family were murdered by Phocas in November 602 after a mutiny.Gibbon 1994, chap. 46,\n ii.902.  Khosrau II (Chosroes) of the Sasanian Empire had been restored to his throne by Maurice, and they had remained allies.  Thus, the Persian King Khosrau II seized the pretext to attack the Byzantine Empire and reconquer the Byzantine province of Mesopotamia.Foss 1975, p. 722. Khosrau had at his court a man who claimed to be Maurice's son Theodosius, and Khosrau demanded that the Byzantines accept this Theodosius as Emperor.\n\nThe war initially went the Persians' way, partly because of Phocas's brutal repression and the succession crisis that ensued as the general Heraclius sent his nephew Nicetas to attack Egypt, enabling his son Heraclius the younger to claim the throne in 610.Gibbon 1994, ii.906. Phocas, an unpopular ruler who is invariably described in historical sources as a \"tyrant\" (in its original meaning of the word, i.e. illegitimate king by the rules of succession), was eventually deposed by Heraclius, who sailed to Constantinople from Carthage with an icon affixed to the prow of his ship.Haldon 1997, p. 41.Speck 1984, p. 178.\n\nBy this time, the Persians had conquered Mesopotamia and the Caucasus, and in 611 they overran Syria and entered Anatolia. A major counter-attack led by Heraclius two years later was decisively defeated outside Antioch by Shahrbaraz and Shahin, and the Roman position collapsed; the Persians devastated parts of Asia Minor and captured Chalcedon across from Constantinople on the Bosporus.Greatrex-Lieu 2002, pp. II, 194–195.  Over the following decade the Persians were able to conquer Palestine and Egypt (by mid-621 the whole province was in their hands)Greatrex-Lieu 2002, p. II, 196. and to devastate Anatolia, while the Avars and Slavs took advantage of the situation to overrun the Balkans, bringing the Empire to the brink of destruction. In 613, the Persian army took Damascus with the help of the Jews, seized Jerusalem in 614, damaging the Church of the Holy Sepulchre and capturing the True Cross, and afterwards capturing Egypt in 617 or 618.Gibbon 1994, ii.908–909.\n\nWith the Persians at the very gate of Constantinople, Heraclius thought of abandoning the city and moving the capital to Carthage, but the powerful church figure Patriarch Sergius convinced him to stay. Safe behind the walls of Constantinople, Heraclius was able to sue for peace in exchange for an annual tribute of a thousand talents of gold, a thousand talents of silver, a thousand silk robes, a thousand horses, and a thousand virgins to the Persian King.Gibbon 1994, chap. 46, ii.914.  The peace allowed him to rebuild the Empire's army by slashing non-military expenditure, devaluing the currency, and melting down, with the backing of Patriarch Sergius, Church treasures to raise the necessary funds to continue the war.Greatrex-Lieu 2002, p. II, 198.\n\nByzantine counter-offensive and resurgence\n\nOn April 5, 622, Heraclius left Constantinople, entrusting the city to Sergius and general Bonus as regents of his son. He assembled his forces in Asia Minor, probably in Bithynia, and, after he revived their broken morale, he launched a new counter-offensive, which took on the character of a holy war; an acheiropoietos image of Christ was carried as a military standard.\nTheophanes 1997, pp. 303.12–304.13.Cameron 1979, p. 23.Grabar 1984, p. 37.\n\nThe Roman army proceeded to Armenia, inflicted a defeat on an army led by a Persian-allied Arab chief, and then won a victory over the Persians under Shahrbaraz.Treadgold 1997, p. 294. Heraclius would stay on campaign for several years.Theophanes 1997, pp. 304.25–306.7.Greatrex-Lieu 2002, p. II, 199.  On March 25, 624 he again left Constantinople with his wife, Martina, and his two children; after he celebrated Easter in Nicomedia on April 15, he campaigned in the Caucasus, winning a series of victories in Armenia against Khosrau and his generals Shahrbaraz, Shahin, and Shahraplakan.Theophanes 1997, pp. 307.19–308.25.Greatrex-Lieu 2002, pp. II, 202–205. In the same year the Visigoths succeeded in recapturing Cartagena, capital of the western Byzantine province of Spania, resulting in the loss of one of the few minor provinces that had been conquered by the armies of Justinian I.The Oxford Dictionary of Byzantium, article Cartagena, p. 384. In 626 the Avars and Slavs supported by a Persian army commanded by Shahrbaraz, besieged Constantinople, but the siege ended in failure (the victory was attributed to the icons of the Virgin which were led in procession by Sergius about the walls of the city),Cameron 1979, pp. 5–6, 20–22. while a second Persian army under Shahin suffered another crushing defeat at the hands of Heraclius's brother Theodore.\n\nWith the Persian war effort disintegrating, Heraclius was able to bring the Gokturks of the Western Turkic Khaganate, Ziebel, who invaded Persian Transcaucasia. Heraclius exploited divisions within the Persian Empire, keeping the Persian general Shahrbaraz neutral by convincing him that Khosrau had grown jealous of him and had ordered his execution. Late in 627 he launched a winter offensive into Mesopotamia, where, despite the desertion of his Turkish allies, he defeated the Persians under Rhahzadh at the Battle of Nineveh.Treadgold 1997, p. 298. Continuing south along the Tigris he sacked Khosrau's great palace at Dastagird and was only prevented from attacking Ctesiphon by the destruction of the bridges on the Nahrawan Canal. Discredited by this series of disasters, Khosrau was overthrown and killed in a coup led by his son Kavadh II, who at once sued for peace, agreeing to withdraw from all occupied territories.  In 629 Heraclius restored the True Cross to Jerusalem in a majestic ceremony., passim.Haldon 1997, p. 46.\n\nHeraclius took for himself the ancient Persian title of \"King of Kings\" after his victory over Persia. Later on, starting in 629, he styled himself as Basileus, the Greek word for \"sovereign\", and that title was used by the Roman Emperors for the next 800 years. The reason Heraclius chose this title over previous Roman terms such as Augustus has been attributed by some scholars as relating to his Armenian origins.Kouymjian 1983, pp. 635–642.\n\nHeraclius's defeat of the Persians ended a war that had been going on intermittently for almost 400 years and led to instability in the Persian Empire. Kavadh II died only months after assuming the throne, plunging Persia into several years of dynastic turmoil and civil war. Ardashir III, Heraclius's ally Shahrbaraz, and Khosrau's daughters Purandokht and Azarmidokht all succeeded to the throne within months of each other. Only when Yazdgerd III, a grandson of Khosrau II, succeeded to the throne in 632 was there stability. But by then the Sasanid Empire was severely disorganised and had been severely weakened by years of war and civil strife over the succession to the throne..\n\nThe Byzantine victory was ultimately a pyrrhic one, as the devastating impact of the war left the Byzantines in much weakened state. Within a few years both empires were overwhelmed by the onslaught of the Arabs who had become newly united by Islam,. ultimately leading to the Muslim conquest of Persia in 644 and the fall of the Sasanian dynasty in 651..\n\nWar against the Arabs\n\nIn 629, the Islamic Prophet Muhammad had recently succeeded in unifying all the tribes of the Arabian Peninsula. Those tribes had previously been too divided to pose a serious military challenge to the Byzantines or the Persians. Now unified and animated by their new conversion to Islam, they comprised one of the most powerful states in the region.Lewis 2002, pp. 43–44. The first conflict between the Byzantines and Muslims was the Battle of Mu'tah in September 629. A small Muslim skirmishing force attacked the province of Arabia in response to their ambassador's murder at the hands of the Ghassanid Roman governor, but were repulsed. Because the engagement was a Byzantine victory, there was no apparent reason to make changes to the military configuration of the region.Kaegi 2003, p. 231. Also, the Byzantines had little preceding battlefield experience with the Arabs, and even less with zealous soldiers united by a prophet.Kaegi 2003, p. 230. Even the Strategicon of Maurice, a manual of war praised for the variety of enemies it covers, does not mention warfare against Arabs at any length.\n\nThe following year the Muslims launched an offensive into the Arabah south of Lake Tiberias, taking Al Karak. Other raids penetrated into the Negev reaching as far as Gaza.Kaegi 2003, p. 233. The Battle of Yarmouk in 636 resulted in a crushing defeat for the larger Byzantine army; within three years, the Levant had been lost again. By the time of Heraclius's death in Constantinople, on February 11, 641, most of Egypt had fallen as well.\n\nLegacy\n\nLooking back at the reign of Heraclius, scholars have credited him with many accomplishments. He enlarged the Empire, and his reorganization of the government and military were great successes. His attempts at religious harmony failed, but he succeeded in returning the True Cross, one of the holiest Christian relics, to Jerusalem.\n\nAccomplishments\n\nAlthough the territorial gains produced by his defeat of the Persians were lost to the advance of the Muslims, Heraclius still ranks among the great Roman Emperors. His reforms of the government reduced the corruption which had taken hold in Phocas's reign, and he reorganized the military with great success. Ultimately, the reformed Imperial army halted the Muslims in Asia Minor and held on to Carthage for another 60 years, saving a core from which the empire's strength could be rebuilt.Collins 2004, p. 128.\n\nThe recovery of the eastern areas of the Roman Empire from the Persians once again raised the problem of religious unity centering on the understanding of the true nature of Christ. Most of the inhabitants of these provinces were Monophysites who rejected the Council of Chalcedon.Bury 2005, p. 251. Heraclius tried to promote a compromise doctrine called Monothelitism but this philosophy was rejected as heretical by both sides of the dispute. For this reason, Heraclius was viewed as a heretic and bad ruler by some later religious writers. After the Monophysite provinces were finally lost to the Muslims, Monotheletism rather lost its raison d'être and was eventually abandoned.\n\nOne of the most important legacies of Heraclius was changing the official language of the Empire from Latin to Greek in 620.Davis 1990, p. 260.  The Croats and Serbs of Byzantine Dalmatia initiated diplomatic relations and dependencies with Heraclius.Kaegi, p. 319. The Serbs, who briefly lived in Macedonia, became foederati and were baptized at the request of Heraclius (before 626).De Administrando Imperio, ch. 32 [Of the Serbs and of the country they now dwell in.]: \"the emperor brought elders from Rome and baptized them and taught them fairly to perform the works of piety and expounded to them the faith of the Christians.\"  At his request, Pope John IV (640–642) sent Christian teachers and missionaries to Duke Porga and his Croats, who practiced Slavic paganism.Deanesly 1969, p. 491. He also created the office of sakellarios, a comptroller of the treasury.Kaegi 2003, p. 227.\n\nUp to the 20th century he was credited with establishing the Thematic system but modern scholarship now points more to the 660s, under Constans II.Haldon 1997, pp. 208ff.\n\nEdward Gibbon in his work The History of the Decline and Fall of the Roman Empire wrote:\n\nRecovery of the True Cross\n\nHeraclius was long remembered favourably in the Western church for his reputed feat in recovering the True Cross, which had been captured by the Persians. As Heraclius approached the capital, Khosrau fled from his favourite residence, Dastagird near Baghdad, without offering resistance. Meanwhile, some of the Persian grandees freed Khosrau's eldest son Kavadh II, who had been imprisoned by his father, and proclaimed him King on the night of 23–24 February, 628.Thomson 1999, p. 221. Kavadh however was mortally ill and was anxious that Heraclius should protect his infant son Ardeshir. So, as a goodwill gesture, he sent the True Cross with a negotiator to sue for peace in 628..\n\nAfter a tour of the Empire Heraclius returned the cross on March 21, 629 or 630. For Christians of the Western Medieval Europe, Heraclius was the \"first crusader\". The iconography of the emperor appeared in the sanctuary at Mont Saint-Michel (ca. 1060),. and then it became popular especially in France, Italian Peninsula and Holy Roman Empire.. The story was included in the Golden Legend, the famous 13th century compendium of hagiography, and he is sometimes shown in art, as in The History of the True Cross sequence of frescoes painted by Piero della Francesca in Arezzo, and a similar sequence on a small altarpiece by Adam Elsheimer (Städel, Frankfurt). Both of these show scenes of Heraclius and Constantine I's mother Saint Helena, traditionally responsible for the excavation of the cross. The scene usually shown is Heraclius carrying the cross; according to the Golden Legend he insisted on doing this as he entered Jerusalem, against the advice of the Patriarch. At first, when he was on horseback (shown above), the burden was too heavy, but after he dismounted and removed his crown it became miraculously light, and the barred city gate opened of its own accord.\n\nProbably because he was one of the few Eastern Roman Emperors widely known in the West, the Late Antique Colossus of Barletta was considered to depict Heraclius.\n\nOpposing view: returned relic a fake\n\nSome scholars disagree with this narrative, Professor Constantin Zuckerman going as far as to suggest that the True Cross was actually lost, and that the wood contained in the allegedly still sealed reliquary brought to Jerusalem by Heraclius in 629 was a fake. In his analysis, the hoax was designed to serve the political purposes of both Heraclius and his former foe, recently turned ally and co-father-in-law, Persian general and soon-to-become king, Shahrvaraz.\n\nIslamic view of Heraclius\n\nIn Surah 30, the Qur'an refers to the Roman-Sasanian wars as follows:\n\n30:2  The Romans have been defeated 3 In the nearest land. But they, after their defeat, will overcome. 4 Within several years. To Allah belongs the command before and after. And that day the believers will rejoice 5 In the victory of Allah . He gives victory to whom He wills, and He is the Exalted in Might, the Merciful.\n\nIn Islamic and Arab histories Heraclius is the only Roman Emperor who is discussed at any length.El-Cheikh 1999, p. 7. Owing to his role as the Roman Emperor at the time Islam emerged, he was remembered in Arabic literature, such as the Islamic hadith and sira.\n\nThe Swahili Utendi wa Tambuka, an epic poem composed in 1728 at Pate Island (off the shore of present-day Kenya) and depicting the wars between the Muslims and Byzantines from the former's point of view, is also known as Kyuo kya Hereḳali (\"The book of Heraclius\"). In that work, Heraclius is portrayed as declining the Prophet's command to renounce his belief in Christianity; he is therefore defeated by the Muslim forces.[http://mercury.soas.ac.uk/perl/Project/showSwahiliItem.pl?ref=MS%2045022a Summary of the plot of the poem]  at the Swahili Manuscripts Project at the School of Oriental and African Studies of London.\n\nIn Muslim tradition he is seen as a just ruler of great piety, who had direct contact with the emerging Islamic forces.El-Cheikh 1999, p. 9. The 14th century scholar Ibn Kathir (d. 1373) went even further stating that \"Heraclius was one of the wisest men and among the most resolute, shrewd, deep and opinionated of kings. He ruled the Romans with great leadership and splendor.\" Historians such as Nadia Maria El-Cheikh and Lawrence Conrad note that Islamic histories even go so far as claiming that Heraclius recognized Islam as the true faith and Muhammad as its prophet, by comparing Islam to Christianity.El-Cheikh 1999, p. 12...\n\nIslamic historians often cite a letter that they claim Heraclius wrote to Muhammad: \"I have received your letter with your ambassador and I testify that you are the messenger of God found in our New Testament. Jesus, son of Mary, announced you.\" According to the Muslim sources reported by El-Cheikh, he tried to convert the ruling class of the Empire, but they resisted so strongly that he reversed his course and claimed that he was just testing their faith in Christianity.El-Cheikh 1999, p. 14. El-Cheikh notes that these accounts of Heraclius add \"little to our historical knowledge\" of the emperor; rather, they are an important part of \"Islamic kerygma,\" attempting to legitimate Muhammad's status as a prophet.El-Cheikh 1999, p. 54.\n\nMost scholarly historians view such traditions as \"profoundly kerygmatic\" and that \"enormous difficulties\" exist in using these sources for actual history.Lawrence I. Conrad. 'Heraclius in Early Islamic Kerygma' Edited by Reinink and Stolte. (Leuven, Paris: Peeters, 2002) Furthermore, any messengers sent by Muhammad to Heraclius would not have received an imperial audience or recognition. Outside of Islamic sources there is no evidence to suggest Heraclius ever heard of Islam,Kaegi 2003, p. 229. and it is possible that he and his advisors actually viewed the Muslims as some special sect of Jews.\n\nFamily\n\nHeraclius was married twice: first to Fabia Eudokia, a daughter of Rogatus, and then to his niece Martina. He had two children with Fabia (Princess Eudoxia Epiphania and Emperor Constantine III) and at least nine with Martina, most of whom were sickly children.Bellinger-Grierson 1992, p. 385.  Of Martina's children at least two were disabled, which was seen as punishment for the illegality of the marriage: Fabius (Flavius) had a paralyzed neck and Theodosios, who was a deaf-mute, married Nike, daughter of Persian general Shahrbaraz or daughter of Niketas, cousin of Heraclius.\n\nTwo of Heraclius's children would become Emperor: Heraclius Constantine (Constantine III), his son from Eudokia, for four months in 641, and Martina's son Constantine Heraclius (Heraklonas), in 638–641.\n\nHeraclius had at least one illegitimate son, John Athalarichos, who conspired a plot against Heraclius with his cousin, the magister Theodorus, and the Armenian noble David Saharuni. When Heraclius discovered the plot, he had Athalarichos's nose and hands cut off, and he was exiled to Prinkipo, one of the Princes' Islands.Nicephorus 1990, p. 73. Theodorus had the same treatment but was sent to Gaudomelete (possibly modern day Gozo Island) with additional instructions to cut off one leg.\n\nDuring the last years of Heraclius's life, it became evident that a struggle was taking place between Heraclius Constantine and Martina, who was trying to position her son Heraklonas in line for the throne. When Heraclius died, he devised the empire to both Heraclius Constantine and Heraklonas to rule jointly with Martina as Empress.\n\nFamily tree",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Heraclius" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13956" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Heraclius (; ; c. 575 – February 11, 641) was the Emperor of the Byzantine (Eastern Roman) Empire from 610 to 641.\n\nHe was responsible for introducing Greek as the Eastern Roman Empire's official language. His rise to power began in 608, when he and his father, Heraclius the Elder, the exarch of Africa, led a revolt against the unpopular usurper Phocas.\n\nHeraclius's reign was marked by several military campaigns. The year Heraclius came to power, the empire was threatened on multiple frontiers. Heraclius immediately took charge of the Byzantine–Sasanian War of 602–628. The first battles of the campaign ended in defeat for the Byzantines; the Persian army fought their way to the Bosphorus but Constantinople was protected by impenetrable walls and a strong navy, and Heraclius was able to avoid total defeat. Soon after, he initiated reforms to rebuild and strengthen the military. Heraclius drove the Persians out of Asia Minor and pushed deep into their territory, defeating them decisively in 627 at the Battle of Nineveh. The Persian king Khosrau II was overthrown and executed by his son Kavadh II, who soon sued for a peace treaty, agreeing to withdraw from all occupied territory. This way peaceful relations were restored to the two deeply strained empires.\n\nHeraclius soon experienced a new event, the Muslim conquests. Emerging from the Arabian Peninsula, the Muslims quickly conquered the Sasanian Empire. In 634 the Muslims marched into Roman Syria, defeating Heraclius's brother Theodore. Within a short period of time, the Arabs conquered Mesopotamia, Armenia and Egypt.\n\nHeraclius entered diplomatic relations with the Croats and Serbs in the Balkans. He tried to repair the schism in the Christian church in regard to the Monophysites, by promoting a compromise doctrine called Monothelitism. The Church of the East (commonly called Nestorian) was also involved in the process.[http://east-west.rsuh.ru/article.html?id=67105 Seleznyov N.N. \"Heraclius and Ishoʿyahb II\"] , Simvol 61: Syriaca-Arabica-Iranica. (Paris-Moscow, 2012), pp. 280–300. Eventually this project of unity was rejected by all sides of the dispute.\n\nEarly life\n\nOrigins\n\nHeraclius was the eldest son of Heraclius the Elder and Epiphania, of a family of possible Armenian origin from Cappadocia,Treadgold 1997, p. 287. with speculative Arsacid descent. Beyond that, there is little specific information known about his ancestry. His father was a key general during Emperor Maurice's war with Bahrām Chobin, usurper of the Sasanian Empire, during 590.Kaegi 2003, pp. 24–25.  After the war, Maurice appointed Heraclius the Elder to the position of Exarch of Africa.\n\nRevolt against Phocas and accession\n\nIn 608, Heraclius the Elder renounced his loyalty to the Emperor Phocas, who had overthrown Maurice six years earlier. The rebels issued coins showing both Heraclii dressed as consuls, though neither of them explicitly claimed the imperial title at this time.Mitchell 2007, p. 411. Heraclius's younger cousin Nicetas launched an overland invasion of Egypt; by 609, he had defeated Phocas's general Bonosus and secured the province. Meanwhile, the younger Heraclius sailed eastward with another force via Sicily and Cyprus.\n\nAs he approached Constantinople, he made contact with prominent leaders and planned an attack to overthrow aristocrats in the city, and soon arranged a ceremony where he was crowned and acclaimed as Emperor. When he reached the capital, the Excubitors, an elite Imperial Guard unit led by Phocas's son-in-law Priscus, deserted to Heraclius, and he entered the city without serious resistance. When Heraclius captured Phocas, he asked him \"Is this how you have ruled, wretch?\" Phocas's reply—\"And will you rule better?\"—so enraged Heraclius that he beheaded Phocas on the spot.Olster 1993, p. 133. He later had the genitalia removed from the body because Phocas had raped the wife of Photius, a powerful politician in the city..\n\nOn October 5, 610, Heraclius was crowned for a second time, this time in the Chapel of St. Stephen within the  Great Palace; at the same time he married Fabia, who took the name Eudokia. After her death in 612, he married his niece Martina in 613; this second marriage was considered incestuous and was very unpopular.Kaegi 2003, p. 106. In the reign of Heraclius's two sons, the divisive Martina was to become the center of power and political intrigue. Despite widespread hatred for Martina in Constantinople, Heraclius took her on campaigns with him and refused attempts by Patriarch Sergius to prevent and later dissolve the marriage.\n\nByzantine–Sasanian War of 602–628\n\nInitial Persian advantage\n\nDuring his Balkan Campaigns, Emperor Maurice and his family were murdered by Phocas in November 602 after a mutiny.Gibbon 1994, chap. 46,\n ii.902.  Khosrau II (Chosroes) of the Sasanian Empire had been restored to his throne by Maurice, and they had remained allies.  Thus, the Persian King Khosrau II seized the pretext to attack the Byzantine Empire and reconquer the Byzantine province of Mesopotamia.Foss 1975, p. 722. Khosrau had at his court a man who claimed to be Maurice's son Theodosius, and Khosrau demanded that the Byzantines accept this Theodosius as Emperor.\n\nThe war initially went the Persians' way, partly because of Phocas's brutal repression and the succession crisis that ensued as the general Heraclius sent his nephew Nicetas to attack Egypt, enabling his son Heraclius the younger to claim the throne in 610.Gibbon 1994, ii.906. Phocas, an unpopular ruler who is invariably described in historical sources as a \"tyrant\" (in its original meaning of the word, i.e. illegitimate king by the rules of succession), was eventually deposed by Heraclius, who sailed to Constantinople from Carthage with an icon affixed to the prow of his ship.Haldon 1997, p. 41.Speck 1984, p. 178.\n\nBy this time, the Persians had conquered Mesopotamia and the Caucasus, and in 611 they overran Syria and entered Anatolia. A major counter-attack led by Heraclius two years later was decisively defeated outside Antioch by Shahrbaraz and Shahin, and the Roman position collapsed; the Persians devastated parts of Asia Minor and captured Chalcedon across from Constantinople on the Bosporus.Greatrex-Lieu 2002, pp. II, 194–195.  Over the following decade the Persians were able to conquer Palestine and Egypt (by mid-621 the whole province was in their hands)Greatrex-Lieu 2002, p. II, 196. and to devastate Anatolia, while the Avars and Slavs took advantage of the situation to overrun the Balkans, bringing the Empire to the brink of destruction. In 613, the Persian army took Damascus with the help of the Jews, seized Jerusalem in 614, damaging the Church of the Holy Sepulchre and capturing the True Cross, and afterwards capturing Egypt in 617 or 618.Gibbon 1994, ii.908–909.\n\nWith the Persians at the very gate of Constantinople, Heraclius thought of abandoning the city and moving the capital to Carthage, but the powerful church figure Patriarch Sergius convinced him to stay. Safe behind the walls of Constantinople, Heraclius was able to sue for peace in exchange for an annual tribute of a thousand talents of gold, a thousand talents of silver, a thousand silk robes, a thousand horses, and a thousand virgins to the Persian King.Gibbon 1994, chap. 46, ii.914.  The peace allowed him to rebuild the Empire's army by slashing non-military expenditure, devaluing the currency, and melting down, with the backing of Patriarch Sergius, Church treasures to raise the necessary funds to continue the war.Greatrex-Lieu 2002, p. II, 198.\n\nByzantine counter-offensive and resurgence\n\nOn April 5, 622, Heraclius left Constantinople, entrusting the city to Sergius and general Bonus as regents of his son. He assembled his forces in Asia Minor, probably in Bithynia, and, after he revived their broken morale, he launched a new counter-offensive, which took on the character of a holy war; an acheiropoietos image of Christ was carried as a military standard.\nTheophanes 1997, pp. 303.12–304.13.Cameron 1979, p. 23.Grabar 1984, p. 37.\n\nThe Roman army proceeded to Armenia, inflicted a defeat on an army led by a Persian-allied Arab chief, and then won a victory over the Persians under Shahrbaraz.Treadgold 1997, p. 294. Heraclius would stay on campaign for several years.Theophanes 1997, pp. 304.25–306.7.Greatrex-Lieu 2002, p. II, 199.  On March 25, 624 he again left Constantinople with his wife, Martina, and his two children; after he celebrated Easter in Nicomedia on April 15, he campaigned in the Caucasus, winning a series of victories in Armenia against Khosrau and his generals Shahrbaraz, Shahin, and Shahraplakan.Theophanes 1997, pp. 307.19–308.25.Greatrex-Lieu 2002, pp. II, 202–205. In the same year the Visigoths succeeded in recapturing Cartagena, capital of the western Byzantine province of Spania, resulting in the loss of one of the few minor provinces that had been conquered by the armies of Justinian I.The Oxford Dictionary of Byzantium, article Cartagena, p. 384. In 626 the Avars and Slavs supported by a Persian army commanded by Shahrbaraz, besieged Constantinople, but the siege ended in failure (the victory was attributed to the icons of the Virgin which were led in procession by Sergius about the walls of the city),Cameron 1979, pp. 5–6, 20–22. while a second Persian army under Shahin suffered another crushing defeat at the hands of Heraclius's brother Theodore.\n\nWith the Persian war effort disintegrating, Heraclius was able to bring the Gokturks of the Western Turkic Khaganate, Ziebel, who invaded Persian Transcaucasia. Heraclius exploited divisions within the Persian Empire, keeping the Persian general Shahrbaraz neutral by convincing him that Khosrau had grown jealous of him and had ordered his execution. Late in 627 he launched a winter offensive into Mesopotamia, where, despite the desertion of his Turkish allies, he defeated the Persians under Rhahzadh at the Battle of Nineveh.Treadgold 1997, p. 298. Continuing south along the Tigris he sacked Khosrau's great palace at Dastagird and was only prevented from attacking Ctesiphon by the destruction of the bridges on the Nahrawan Canal. Discredited by this series of disasters, Khosrau was overthrown and killed in a coup led by his son Kavadh II, who at once sued for peace, agreeing to withdraw from all occupied territories.  In 629 Heraclius restored the True Cross to Jerusalem in a majestic ceremony., passim.Haldon 1997, p. 46.\n\nHeraclius took for himself the ancient Persian title of \"King of Kings\" after his victory over Persia. Later on, starting in 629, he styled himself as Basileus, the Greek word for \"sovereign\", and that title was used by the Roman Emperors for the next 800 years. The reason Heraclius chose this title over previous Roman terms such as Augustus has been attributed by some scholars as relating to his Armenian origins.Kouymjian 1983, pp. 635–642.\n\nHeraclius's defeat of the Persians ended a war that had been going on intermittently for almost 400 years and led to instability in the Persian Empire. Kavadh II died only months after assuming the throne, plunging Persia into several years of dynastic turmoil and civil war. Ardashir III, Heraclius's ally Shahrbaraz, and Khosrau's daughters Purandokht and Azarmidokht all succeeded to the throne within months of each other. Only when Yazdgerd III, a grandson of Khosrau II, succeeded to the throne in 632 was there stability. But by then the Sasanid Empire was severely disorganised and had been severely weakened by years of war and civil strife over the succession to the throne..\n\nThe Byzantine victory was ultimately a pyrrhic one, as the devastating impact of the war left the Byzantines in much weakened state. Within a few years both empires were overwhelmed by the onslaught of the Arabs who had become newly united by Islam,. ultimately leading to the Muslim conquest of Persia in 644 and the fall of the Sasanian dynasty in 651..\n\nWar against the Arabs\n\nIn 629, the Islamic Prophet Muhammad had recently succeeded in unifying all the tribes of the Arabian Peninsula. Those tribes had previously been too divided to pose a serious military challenge to the Byzantines or the Persians. Now unified and animated by their new conversion to Islam, they comprised one of the most powerful states in the region.Lewis 2002, pp. 43–44. The first conflict between the Byzantines and Muslims was the Battle of Mu'tah in September 629. A small Muslim skirmishing force attacked the province of Arabia in response to their ambassador's murder at the hands of the Ghassanid Roman governor, but were repulsed. Because the engagement was a Byzantine victory, there was no apparent reason to make changes to the military configuration of the region.Kaegi 2003, p. 231. Also, the Byzantines had little preceding battlefield experience with the Arabs, and even less with zealous soldiers united by a prophet.Kaegi 2003, p. 230. Even the Strategicon of Maurice, a manual of war praised for the variety of enemies it covers, does not mention warfare against Arabs at any length.\n\nThe following year the Muslims launched an offensive into the Arabah south of Lake Tiberias, taking Al Karak. Other raids penetrated into the Negev reaching as far as Gaza.Kaegi 2003, p. 233. The Battle of Yarmouk in 636 resulted in a crushing defeat for the larger Byzantine army; within three years, the Levant had been lost again. By the time of Heraclius's death in Constantinople, on February 11, 641, most of Egypt had fallen as well.\n\nLegacy\n\nLooking back at the reign of Heraclius, scholars have credited him with many accomplishments. He enlarged the Empire, and his reorganization of the government and military were great successes. His attempts at religious harmony failed, but he succeeded in returning the True Cross, one of the holiest Christian relics, to Jerusalem.\n\nAccomplishments\n\nAlthough the territorial gains produced by his defeat of the Persians were lost to the advance of the Muslims, Heraclius still ranks among the great Roman Emperors. His reforms of the government reduced the corruption which had taken hold in Phocas's reign, and he reorganized the military with great success. Ultimately, the reformed Imperial army halted the Muslims in Asia Minor and held on to Carthage for another 60 years, saving a core from which the empire's strength could be rebuilt.Collins 2004, p. 128.\n\nThe recovery of the eastern areas of the Roman Empire from the Persians once again raised the problem of religious unity centering on the understanding of the true nature of Christ. Most of the inhabitants of these provinces were Monophysites who rejected the Council of Chalcedon.Bury 2005, p. 251. Heraclius tried to promote a compromise doctrine called Monothelitism but this philosophy was rejected as heretical by both sides of the dispute. For this reason, Heraclius was viewed as a heretic and bad ruler by some later religious writers. After the Monophysite provinces were finally lost to the Muslims, Monotheletism rather lost its raison d'être and was eventually abandoned.\n\nOne of the most important legacies of Heraclius was changing the official language of the Empire from Latin to Greek in 620.Davis 1990, p. 260.  The Croats and Serbs of Byzantine Dalmatia initiated diplomatic relations and dependencies with Heraclius.Kaegi, p. 319. The Serbs, who briefly lived in Macedonia, became foederati and were baptized at the request of Heraclius (before 626).De Administrando Imperio, ch. 32 [Of the Serbs and of the country they now dwell in.]: \"the emperor brought elders from Rome and baptized them and taught them fairly to perform the works of piety and expounded to them the faith of the Christians.\"  At his request, Pope John IV (640–642) sent Christian teachers and missionaries to Duke Porga and his Croats, who practiced Slavic paganism.Deanesly 1969, p. 491. He also created the office of sakellarios, a comptroller of the treasury.Kaegi 2003, p. 227.\n\nUp to the 20th century he was credited with establishing the Thematic system but modern scholarship now points more to the 660s, under Constans II.Haldon 1997, pp. 208ff.\n\nEdward Gibbon in his work The History of the Decline and Fall of the Roman Empire wrote:\n\nRecovery of the True Cross\n\nHeraclius was long remembered favourably in the Western church for his reputed feat in recovering the True Cross, which had been captured by the Persians. As Heraclius approached the capital, Khosrau fled from his favourite residence, Dastagird near Baghdad, without offering resistance. Meanwhile, some of the Persian grandees freed Khosrau's eldest son Kavadh II, who had been imprisoned by his father, and proclaimed him King on the night of 23–24 February, 628.Thomson 1999, p. 221. Kavadh however was mortally ill and was anxious that Heraclius should protect his infant son Ardeshir. So, as a goodwill gesture, he sent the True Cross with a negotiator to sue for peace in 628..\n\nAfter a tour of the Empire Heraclius returned the cross on March 21, 629 or 630. For Christians of the Western Medieval Europe, Heraclius was the \"first crusader\". The iconography of the emperor appeared in the sanctuary at Mont Saint-Michel (ca. 1060),. and then it became popular especially in France, Italian Peninsula and Holy Roman Empire.. The story was included in the Golden Legend, the famous 13th century compendium of hagiography, and he is sometimes shown in art, as in The History of the True Cross sequence of frescoes painted by Piero della Francesca in Arezzo, and a similar sequence on a small altarpiece by Adam Elsheimer (Städel, Frankfurt). Both of these show scenes of Heraclius and Constantine I's mother Saint Helena, traditionally responsible for the excavation of the cross. The scene usually shown is Heraclius carrying the cross; according to the Golden Legend he insisted on doing this as he entered Jerusalem, against the advice of the Patriarch. At first, when he was on horseback (shown above), the burden was too heavy, but after he dismounted and removed his crown it became miraculously light, and the barred city gate opened of its own accord.\n\nProbably because he was one of the few Eastern Roman Emperors widely known in the West, the Late Antique Colossus of Barletta was considered to depict Heraclius.\n\nOpposing view: returned relic a fake\n\nSome scholars disagree with this narrative, Professor Constantin Zuckerman going as far as to suggest that the True Cross was actually lost, and that the wood contained in the allegedly still sealed reliquary brought to Jerusalem by Heraclius in 629 was a fake. In his analysis, the hoax was designed to serve the political purposes of both Heraclius and his former foe, recently turned ally and co-father-in-law, Persian general and soon-to-become king, Shahrvaraz.\n\nIslamic view of Heraclius\n\nIn Surah 30, the Qur'an refers to the Roman-Sasanian wars as follows:\n\n30:2  The Romans have been defeated 3 In the nearest land. But they, after their defeat, will overcome. 4 Within several years. To Allah belongs the command before and after. And that day the believers will rejoice 5 In the victory of Allah . He gives victory to whom He wills, and He is the Exalted in Might, the Merciful.\n\nIn Islamic and Arab histories Heraclius is the only Roman Emperor who is discussed at any length.El-Cheikh 1999, p. 7. Owing to his role as the Roman Emperor at the time Islam emerged, he was remembered in Arabic literature, such as the Islamic hadith and sira.\n\nThe Swahili Utendi wa Tambuka, an epic poem composed in 1728 at Pate Island (off the shore of present-day Kenya) and depicting the wars between the Muslims and Byzantines from the former's point of view, is also known as Kyuo kya Hereḳali (\"The book of Heraclius\"). In that work, Heraclius is portrayed as declining the Prophet's command to renounce his belief in Christianity; he is therefore defeated by the Muslim forces.[http://mercury.soas.ac.uk/perl/Project/showSwahiliItem.pl?ref=MS%2045022a Summary of the plot of the poem]  at the Swahili Manuscripts Project at the School of Oriental and African Studies of London.\n\nIn Muslim tradition he is seen as a just ruler of great piety, who had direct contact with the emerging Islamic forces.El-Cheikh 1999, p. 9. The 14th century scholar Ibn Kathir (d. 1373) went even further stating that \"Heraclius was one of the wisest men and among the most resolute, shrewd, deep and opinionated of kings. He ruled the Romans with great leadership and splendor.\" Historians such as Nadia Maria El-Cheikh and Lawrence Conrad note that Islamic histories even go so far as claiming that Heraclius recognized Islam as the true faith and Muhammad as its prophet, by comparing Islam to Christianity.El-Cheikh 1999, p. 12...\n\nIslamic historians often cite a letter that they claim Heraclius wrote to Muhammad: \"I have received your letter with your ambassador and I testify that you are the messenger of God found in our New Testament. Jesus, son of Mary, announced you.\" According to the Muslim sources reported by El-Cheikh, he tried to convert the ruling class of the Empire, but they resisted so strongly that he reversed his course and claimed that he was just testing their faith in Christianity.El-Cheikh 1999, p. 14. El-Cheikh notes that these accounts of Heraclius add \"little to our historical knowledge\" of the emperor; rather, they are an important part of \"Islamic kerygma,\" attempting to legitimate Muhammad's status as a prophet.El-Cheikh 1999, p. 54.\n\nMost scholarly historians view such traditions as \"profoundly kerygmatic\" and that \"enormous difficulties\" exist in using these sources for actual history.Lawrence I. Conrad. 'Heraclius in Early Islamic Kerygma' Edited by Reinink and Stolte. (Leuven, Paris: Peeters, 2002) Furthermore, any messengers sent by Muhammad to Heraclius would not have received an imperial audience or recognition. Outside of Islamic sources there is no evidence to suggest Heraclius ever heard of Islam,Kaegi 2003, p. 229. and it is possible that he and his advisors actually viewed the Muslims as some special sect of Jews.\n\nFamily\n\nHeraclius was married twice: first to Fabia Eudokia, a daughter of Rogatus, and then to his niece Martina. He had two children with Fabia (Princess Eudoxia Epiphania and Emperor Constantine III) and at least nine with Martina, most of whom were sickly children.Bellinger-Grierson 1992, p. 385.  Of Martina's children at least two were disabled, which was seen as punishment for the illegality of the marriage: Fabius (Flavius) had a paralyzed neck and Theodosios, who was a deaf-mute, married Nike, daughter of Persian general Shahrbaraz or daughter of Niketas, cousin of Heraclius.\n\nTwo of Heraclius's children would become Emperor: Heraclius Constantine (Constantine III), his son from Eudokia, for four months in 641, and Martina's son Constantine Heraclius (Heraklonas), in 638–641.\n\nHeraclius had at least one illegitimate son, John Athalarichos, who conspired a plot against Heraclius with his cousin, the magister Theodorus, and the Armenian noble David Saharuni. When Heraclius discovered the plot, he had Athalarichos's nose and hands cut off, and he was exiled to Prinkipo, one of the Princes' Islands.Nicephorus 1990, p. 73. Theodorus had the same treatment but was sent to Gaudomelete (possibly modern day Gozo Island) with additional instructions to cut off one leg.\n\nDuring the last years of Heraclius's life, it became evident that a struggle was taking place between Heraclius Constantine and Martina, who was trying to position her son Heraklonas in line for the throne. When Heraclius died, he devised the empire to both Heraclius Constantine and Heraklonas to rule jointly with Martina as Empress.\n\nFamily tree. Heraclius. http://en.wikipedia.org/?curid=13956."
  }
}
