{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=904",
  "eid" : "a87689f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778362383,
  "textBody" : "Aluminium (British and IUPAC spelling) or aluminum (American spelling) is a chemical element with symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic, ductile metal in the boron group. By mass, aluminium makes up about 8% of the  Earth's crust; it is the third most abundant element after oxygen and silicon and the most abundant metal in the crust, though it is less common in the mantle below. The chief ore of aluminium is bauxite. Aluminium metal is so chemically reactive that native specimens are rare and limited to extreme reducing environments. Instead, it is found combined in over 270 different minerals.\n\nAluminium is remarkable for its low density and its ability to resist corrosion through the phenomenon of passivation. Aluminium and its alloys are vital to the aerospace industry and important in transportation and building industries, such as building facades and window frames. The oxides and sulfates are the most useful compounds of aluminium.\n\nDespite its prevalence in the environment, no known form of life uses aluminium salts metabolically, but aluminium is well tolerated by plants and animals. Because of these salts' abundance, the potential for a biological role for them is of continuing interest, and studies continue.\n\nPhysical characteristics \n\nNuclei and isotopes \n\nAluminium's atomic number is 13. Of aluminium isotopes, only one is stable: 27Al. It is the only isotope that has existed on Earth in its current form since the creation of the planet. It is essentially the only isotope representing the element on Earth, which makes aluminium a mononuclidic element and practically equates its standard atomic weight to that of the isotope. Such a low standard atomic weight of aluminium has some effects on the properties of the element (see below).\n\nAll other isotopes are radioactive and could not have survived; the most stable isotope of these is 26Al (half-life 720,000 years). 26Al is produced from argon in the atmosphere by spallation caused by cosmic ray protons and used in radiodating. The ratio of 26Al to 10Be has been used to study transport, deposition, sediment storage, burial times, and erosion on 105 to 106 year time scales. Most meteorite scientists believe that the energy released by the decay of 26Al was responsible for the melting and differentiation of some asteroids after their formation 4.55 billion years ago.\n\nThe remaining isotopes of aluminium, with mass numbers ranging from 21 to 43, all have half-lives well under an hour. Three metastable states are known, all with half-lives under a minute.\n\nElectron shell \n\nAn aluminium atom has 13 electrons, arranged in an electron configuration of [Ne]3s23p1, with three atoms beyond a stable noble gas configuration. Accordingly, the combined first three ionization energies of aluminium are far lower than the fourth ionization energy alone. Aluminium can relatively easily surrender its three outermost electrons in many chemical reactions (see below). The electronegativity of aluminium is 1.61 (Pauling scale). \n\nA free aluminium atom has a radius of 143 pm. With the three outermost electrons removed, the radius shrinks to 39 pm for a 4-coordinated atom or 53.5 pm for a 6-coordinated atom. At standard temperature and pressure, aluminium atoms (when not affected by atoms of other elements) form a face-centered cubic crystal system bound by metallic bonding provided by atoms' outermost electrons; hence aluminium (at these conditions) is a metal. This crystal system is shared by some other metals, such as lead and copper; the size of a unit cell of aluminium is comparable to that of those.\n\nBulk \n\nAluminium metal, when in quantity, is very shiny and resembles silver. Another important characteristic of aluminium is its low density, 2.70 g/cm3. Aluminium is a relatively soft, durable, lightweight, ductile, and malleable with appearance ranging from silvery to dull gray, depending on the surface roughness. It is nonmagnetic and does not easily ignite. A fresh film of aluminium serves as a good reflector (approximately 92%) of visible light and an excellent reflector (as much as 98%) of medium and far infrared radiation. The yield strength of pure aluminium is 7–11 MPa, while aluminium alloys have yield strengths ranging from 200 MPa to 600 MPa. Aluminium has about one-third the density and stiffness of steel. It is easily machined, cast, drawn and extruded.\n\nAluminium atoms are arranged in a face-centered cubic (fcc) structure. Aluminium has a stacking-fault energy of approximately 200 mJ/m2.\n\nAluminium is a good thermal and electrical conductor, having 59% the conductivity of copper, both thermal and electrical, while having only 30% of copper's density. Aluminium is capable of superconductivity, with a superconducting critical temperature of 1.2 kelvin and a critical magnetic field of about 100 gauss (10 milliteslas).\n\nAluminium is the most common material for the fabrication of superconducting qubits.\n\nChemistry \n\nCorrosion resistance can be excellent because a thin surface layer of aluminium oxide forms when the bare metal is exposed to air, effectively preventing further oxidation, in a process termed passivation.  The strongest aluminium alloys are less corrosion resistant due to galvanic reactions with alloyed copper. This corrosion resistance is greatly reduced by aqueous salts, particularly in the presence of dissimilar metals.\n\nIn highly acidic solutions, aluminium reacts with water to form hydrogen, and in highly alkaline ones to form aluminates— protective passivation under these conditions is negligible.  Primarily because it is corroded by dissolved chlorides, such as common sodium chloride, household plumbing is never made from aluminium.\n\nHowever, because of its general resistance to corrosion, aluminium is one of the few metals that retains silvery reflectance in finely powdered form, making it an important component of silver-colored paints. Aluminium mirror finish has the highest reflectance of any metal in the 200–400 nm (UV) and the 3,000–10,000 nm (far IR) regions; in the 400–700 nm visible range it is slightly outperformed by tin and silver and in the 700–3000 nm (near IR) by silver, gold, and copper.\n\nAluminium is oxidized by water at temperatures below 280 °C to produce hydrogen, aluminium hydroxide and heat:\n2 Al + 6 H2O → 2 Al(OH)3 + 3 H2\nThis conversion is of interest for the production of hydrogen. However, commercial application of this fact has challenges in circumventing the passivating oxide layer, which inhibits the reaction, and in storing the energy required to regenerate the aluminium metal.\n\nInorganic compounds \n\nThe vast majority of compounds, including all Al-containing minerals and all commercially significant aluminium compounds, feature aluminium in the oxidation state 3+. The coordination number of such compounds varies, but generally Al3+ is six-coordinate or tetracoordinate. Almost all compounds of aluminium(III) are colorless.\n\nAll four trihalides are well known. Unlike the structures of the three heavier trihalides, aluminium fluoride (AlF3) features six-coordinate Al. The octahedral coordination environment for AlF3 is related to the compactness of the fluoride ion, six of which can fit around the small Al3+ center. AlF3 sublimes (with cracking) at 1291 °C. With heavier halides, the coordination numbers are lower. The other trihalides are dimeric or polymeric with tetrahedral Al centers. These materials are prepared by treating aluminium metal with the halogen, although other methods exist. Acidification of the oxides or hydroxides affords hydrates. In aqueous solution, the halides often form mixtures, generally containing six-coordinate Al centers that feature both halide and aquo ligands. When aluminium and fluoride are together in aqueous solution, they readily form complex ions such as , , and . In the case of chloride, polyaluminium clusters are formed such as [Al13O4(OH)24(H2O)12]7+.\n\nAluminium forms one stable oxide with the chemical formula Al2O3. It can be found in nature in the mineral corundum. Aluminium oxide is also commonly called alumina. Sapphire and ruby are impure corundum contaminated with trace amounts of other metals. The two oxide-hydroxides, AlO(OH), are boehmite and diaspore. There are three trihydroxides: bayerite, gibbsite, and nordstrandite, which differ in their crystalline structure (polymorphs). Most are produced from ores by a variety of wet processes using acid and base. Heating the hydroxides leads to formation of corundum. These materials are of central importance to the production of aluminium and are themselves extremely useful.\n\nAluminium carbide (Al4C3) is made by heating a mixture of the elements above 1000 °C. The pale yellow crystals consist of tetrahedral aluminium centers. It reacts with water or dilute acids to give methane. The acetylide, Al2(C2)3, is made by passing acetylene over heated aluminium.\n\nAluminium nitride (AlN) is the only nitride known for aluminium. Unlike the oxides, it features tetrahedral Al centers. It can be made from the elements at 800 °C. It is air-stable material with a usefully high thermal conductivity. Aluminium phosphide (AlP) is made similarly; it hydrolyses to give phosphine:\n\nAlP + 3 H2O → Al(OH)3 + PH3\n\nRarer oxidation states \n\nAlthough the great majority of aluminium compounds feature Al3+ centers, compounds with lower oxidation states are known and sometime of significance as precursors to the Al3+ species.\n\nAluminium(I) \n\nAlF, AlCl and AlBr exist in the gaseous phase when the trihalide is heated with aluminium. The composition  is unstable at room temperature, converting to triiodide:\n\n3 AlI -> AlI3 + 2 Al\n\nA stable derivative of aluminium monoiodide is the cyclic adduct formed with triethylamine, . Also of theoretical interest but only of fleeting existence are Al2O and Al2S. Al2O is made by heating the normal oxide, Al2O3, with silicon at 1800 °C in a vacuum. Such materials quickly disproportionate to the starting materials.\n\nAluminium(II) \n\nVery simple Al(II) compounds are invoked or observed in the reactions of Al metal with oxidants. For example, aluminium monoxide, AlO, has been detected in the gas phase after explosion and in stellar absorption spectra. More thoroughly investigated are compounds of the formula R4Al2 which contain an Al-Al bond and where R is a large organic ligand.\n\nOrganoaluminium compounds and related hydrides \n\nA variety of compounds of empirical formula AlR3 and AlR1.5Cl1.5 exist. These species usually feature tetrahedral Al centers formed by dimerization with some R or Cl bridging between both Al atoms, e.g. \"trimethylaluminium\" has the formula Al2(CH3)6 (see figure). With large organic groups, triorganoaluminium compounds exist as three-coordinate monomers, such as triisobutylaluminium. Such compounds are widely used in industrial chemistry, despite the fact that they are often highly pyrophoric. Few analogues exist between organoaluminium and organoboron compounds other than large organic groups.\n\nThe important aluminium hydride is lithium aluminium hydride (LiAlH4), which is used in as a reducing agent in organic chemistry. It can be produced from lithium hydride and aluminium trichloride:\n\n4 LiH + AlCl3 → LiAlH4 + 3 LiCl\n\nSeveral useful derivatives of LiAlH4 are known, e.g. sodium bis(2-methoxyethoxy)dihydridoaluminate. The simplest hydride, aluminium hydride or alane, remains a laboratory curiosity. It is a polymer with the formula (AlH3)n, in contrast to the corresponding boron hydride that is a dimer with the formula (BH3)2.\n\nNatural occurrence\n\nStable aluminium is created when hydrogen fuses with magnesium, either in large stars or in supernovae. It is estimated to be the 14th most common element in the Universe, by mass-fraction.[http://periodictable.com/Properties/A/UniverseAbundance.v.log.html Abundance in the Universe for all the elements in the Periodic Table] . Periodictable.com. Retrieved on 30 July 2016. However, among the elements that have odd atomic numbers, aluminium is the third most abundant by mass fraction, after hydrogen and nitrogen.\n\nIn the Earth's crust, aluminium is the most abundant (8.3% by mass) metallic element and the third most abundant of all elements (after oxygen and silicon). The Earth's crust has a greater abundance of aluminium than the rest of the planet, primarily in aluminium silicates. In the Earth's mantle, which is only 2% aluminium by mass, these aluminium silicate minerals are largely replaced by silica and magnesium oxides. Overall, the Earth is about 1.4% aluminium by mass (eighth in abundance by mass). Aluminium occurs in greater proportion in the Earth than in the Solar system and Universe because the more common elements (hydrogen, helium, neon, nitrogen, carbon as hydrocarbon) are volatile at Earth's proximity to the Sun and large quantities of those were lost.\n\nBecause of its strong affinity for oxygen, aluminium is almost never found in the elemental state; instead it is found in oxides or silicates. Feldspars, the most common group of minerals in the Earth's crust, are aluminosilicates. Native aluminium metal can only be found as a minor phase in low oxygen fugacity environments, such as the interiors of certain volcanoes. Native aluminium has been reported in cold seeps in the northeastern continental slope of the South China Sea. Chen et al. (2011) propose the theory that these deposits resulted from bacterial reduction of tetrahydroxoaluminate Al(OH)4−.\n\nAluminium also occurs in the minerals beryl, cryolite, garnet, spinel, and turquoise. Impurities in Al2O3, such as chromium and iron, yield the gemstones ruby and sapphire, respectively.\n\nAlthough aluminium is a common and widespread element, not all aluminium minerals are economically viable sources of the metal. Almost all metallic aluminium is produced from the ore bauxite (AlOx(OH)3–2x). Bauxite occurs as a weathering product of low iron and silica bedrock in tropical climatic conditions. Bauxite is mined from large deposits in Australia, Brazil, Guinea, and Jamaica; it is also mined from lesser deposits in China, India, Indonesia, Russia, and Suriname.\n\nHistory \n\nEarly history \n\nAluminium metal was unknown to ancient people. Some sources, based on an account by Pliny the Elder, suggest a possibility that a Roman in the time of the emperor Tiberius had isolated aluminium; however, this claim has been disputed. It is possible that the Chinese were able to produce aluminium-containing alloys during the reign of the first Jin dynasty (265–420).\n\nThe history of aluminium has been shaped by usage of alum. First written record of alum, made by Greek historian Herodotus, dates back to the 5th century BCE. The ancients are known to have used alum as dyeing mordants and for city defense. After the Crusades, alum, a good indispensable in European fabric industry, was a subject of international commerce; it was imported to Europe from the eastern Mediterranean until the mid-15th century.\n\nEstablishing nature of alum \n\nThe nature of alum remained unknown. Around 1530, Swiss physician Paracelsus identified alum as separate from vitriole (sulfates), suggesting it was a salt of an earth of alum. In 1595, German doctor and chemist Andreas Libavius demonstrated that alum and green and blue vitriole were formed by the same acid but different earths; for the undiscovered earth that formed alum, he proposed the name \"alumina\". In 1722, German chemist Friedrich Hoffmann announced his belief that the base of alum was a distinct earth. In 1728, French chemist Étienne Geoffroy Saint-Hilaire suggested that alum was formed by an unknown earth and the sulfuric acid.\n\nIn 1754, German chemist Andreas Sigismund Marggraf synthesized the earth of alum by boiling clay in sulfuric acid and subsequently adding potash. In 1758, French chemist Pierre Macquer wrote that alumina resembled a metallic earth. In 1782, French chemist Antoine Lavoisier wrote he considered highly probable that alumina was an oxide of a metal which had an affinity for oxygen so strong no known reducing agents could overcome it. In 1783, Lavoisier replaced the dominant phlogiston theory with the idea of oxygen combustion and stated that metallic earths were oxides of their metals. Swedish chemist Jöns Jacob Berzelius suggested in 1815 the formula AlO3 for alumina. The correct formula, Al2O3, was established by the German chemist Eilhard Mitscherlich in 1821; this helped Berzelius determine the correct atomic weight of the metal, 27.\n\nSynthesis of metal \n\nAttempts to produce aluminium metal date back to 1760. The first successful attempt, however, was completed in 1824 by Danish physicist and chemist Hans Christian Ørsted. He reacted anhydrous aluminium chloride with potassium amalgam, yielding a lump of metal looking similar to tin. He presented his results and demonstrated a sample of the new metal in 1825. Ørsted gave little importance to his discovery; a different source suggests he could not continue his research because of financial reasons. Because of this and that he published his work in an unknown to the general European public Danish magazine, he is often not credited as the discoverer of the element; some earlier sources went further and claimed Ørsted had not in fact isolated aluminium.\n\nGerman chemist Friedrich Wöhler visited Ørsted in 1827. Ørsted told Wöhler he did not intend to continue his research on aluminium extraction. Wöhler was engaged with the problem and investigated it on his return from Denmark. After repeating Ørsted's experiments, Wöhler did not identify any aluminium. (The reason for this inconsistency was only discovered in 1921.) He conducted a similar experiment in 1827 by mixing anhydrous aluminium chloride with potassium and produced a powder of aluminium. In 1845, he was able to produce small pieces of the metal and described some physical properties of this metal.\n\nRare metal \n\nAs Wöhler's method could not yield great quantities of aluminium, the metal remained rare; its cost exceeded that of gold.\n\nFrench chemist Henri Etienne Sainte-Claire Deville announced an industrial method of aluminium production in 1854 at the Paris Academy of Sciences. Aluminium trichloride could be reduced by sodium, which was more convenient and less expensive than potassium, which Wöhler had used. Subsequently, bars of aluminium were exhibited for the first time to the general public at the Exposition Universelle of 1855. In 1856, Deville along with companions established the world's first industrial production of aluminium. From 1855 to 1859, the price of aluminium dropped by an order of magnitude, from US$500 to $40 per pound. Even then, aluminium was still not of great purity and produced aluminium differed in properties by sample.\n\nAt the next fair in Paris in 1867, the visitors were presented aluminium wire and foil; by the time of the next fair in 1878, aluminium had become a symbol of the future.\n\nElectrolytic production \n\nThe first industrial large-scale production method was independently developed by French engineer Paul Héroult and American engineer Charles Martin Hall; it is now known as the Hall–Héroult process. Héroult long could not find enough interest in his invention as demand for aluminium was still small; he started industrial production of aluminium bronze in Neuhausen am Rheinfall in 1888. Héroult sold his patents in a year; the buyers appointed him to the position of director of a smelter in Isère, which would produce on a large scale aluminium bronze at the initiation and pure aluminium in a few months. At the same time, Hall invented the same process and successfully tested it. He then sought to employ it for a large-scale production; for that, however, the existing smelters refused to adopt the new technique. He started the Pittsburgh Reduction Company in 1888 where he initiated mass production of aluminium. In the coming years, this technology was improved and new factories were constructed.\n\nThe Hall–Héroult process converts alumina into the metal; Austrian chemist Carl Joseph Bayer discovered a way of purifying bauxite to yield alumina, now known as the Bayer process, in 1889. Modern production of the aluminium metal is based on the Bayer and Hall–Héroult processes. The Hall–Héroult process was further improved in 1920 by a team led by Swedish chemist Carl Wilhelm Söderberg; this improvement greatly increased the world output of aluminium.\n\nMass usage \n\nPrices of aluminium did drop and aluminium had become widely used in jewelry, everyday items, eyeglass frames, and optical instruments by the early 1890s. Aluminium tableware began to be produced in the late 19th century and gradually supplanted copper and cast iron tableware in the first decades of the 20th century. Aluminium foil was also popularized at that time. Aluminium is soft and light; it was soon discovered, however, that alloying it with other metals could increase its hardness while preserving the low density. Aluminium's ability to form alloys with other metals provided the metal many uses in the late 19th and early 20th centuries. For instance, aluminium bronze is applied to make flexible bands, sheets, and wire and is widely employed in the shipbuilding and aviation industries. During World War I, major governments demanded large shipments of aluminium for light strong airframes. They often subsidized factories and the necessary electrical supply systems. Aviation during that time employed a new aluminium alloy, duralumin, invented in 1903 by German materials scientist Alfred Wilm.\n\nBy the mid-20th century, aluminium had become a part of everyday lives, also becoming an essential component of houseware. During the mid-20th century, aluminium emerged as a civil engineering material, with buildings using for both basic construction and interior, and advanced its use in military engineering, for both airplanes and land armor vehicle engines. In the beginning of the second half of that century, the space race began. Earth's first artificial satellite, launched in 1957, consisted of two separate aluminium semi-spheres joined together and all subsequent space vehicles have been made of aluminium. The aluminium can was invented in 1956 and employed as a storage for drinks in 1958.\n\nThroughout the 20th century, the production of aluminium rose rapidly: while the world production of aluminium in 1900 was 6,800 metric tons, the annual production first exceeded 100,000 metric tons in 1916; 1,000,000 tons in 1941; 10,000,000 tons in 1971. In the 1970s, the increased demand for aluminium made it an exchange commodity; it entered the London Metal Exchange, the oldest industrial metal exchange in the world, in 1978. The output continued to grow: the annual production of aluminium exceeded 50,000,000 metric tons in 2013.\n\nThe real price for aluminium declined from $14,000 per metric ton in 1900 to $2,340 in 1948 (all prices in this subsection are in 1998 United States dollars). Extraction and processing costs were lowered over technological progress and the scale of the economies. However, the need to exploit lower-grade poorer quality deposits and the use of fast increasing input costs (above all, energy) increased the net cost of aluminium; the real price began to grow in the 1970s with the rise of energy cost. Production moved from the industrialized countries to countries where production was cheaper. After aluminium became an exchange commodity, aluminium has been traded for United States dollars and its price fluctuated along with the exchange rates of the currency.  Production costs in the late 20th century changed because of advances in technology, lower energy prices, exchange rates of the United States dollar, and alumina prices. The BRIC countries' combined share grew in the first decade of the 21st century from 32.6% to 56.5% in primary production and 21.4% to 47.8% in primary consumption. China is accumulating an especially large share of world's production thanks to abundance of resources, cheap energy, and governmental stimuli; it also increased its consumption share from 2% in 1972 to 40% in 2010. In the United States, Western Europe, and Japan, most aluminium was consumed in transportation, engineering, construction, and packaging.\n\nEtymology \n\nAluminium is named after alumina, or aluminium oxide in modern nomenclature. The word \"alumina\" comes from \"alum\", the mineral from which it was collected. The word \"alum\" comes from alumen, a Latin word meaning \"bitter salt\". The word alumen stems from the Proto-Indo-European root *alu- meaning \"bitter\" or \"beer\".\n\nBritish chemist Humphry Davy, who performed a number of experiments aimed to synthesize the metal, is credited as the person who named aluminium. In 1808, he suggested the metal be named alumium. This suggestion was criticized by contemporary chemists from France, Germany, and Sweden, who insisted the metal should be named for the oxide, alumina, from which it would be isolated. In 1812, Davy chose aluminum, thus producing the modern name. However, it is spelled and pronounced differently outside of North America: aluminum is in use in the U.S. and Canada while aluminium is in use elsewhere.\n\nSpelling \n\nThe ' suffix followed the precedent set in other newly discovered elements of the time: potassium, sodium, magnesium, calcium, and strontium (all of which Davy isolated himself). Nevertheless, element names ending in ' were not unknown at the time; for example, platinum (known to Europeans since the 16th century), molybdenum (discovered in 1778), and tantalum (discovered in 1802). The ' suffix is consistent with the universal spelling alumina for the oxide (as opposed to aluminia); compare to lanthana, the oxide of lanthanum, and magnesia, ceria, and thoria, the oxides of magnesium, cerium, and thorium, respectively.\n\nIn 1812, British scientist Thomas Young wrote an anonymous review of Davy's book, in which he objected to aluminum and proposed the name aluminium: \"for so we shall take the liberty of writing the word, in preference to aluminum, which has a less classical sound.\" This name did catch on: while the ' spelling was occasionally used in Britain, the American scientific language used ' from the start. Most scientists used ' throughout the world in the 19th century; it still remains the standard in most other languages. In 1828, American lexicographer Noah Webster used exclusively the aluminum spelling in his American Dictionary of the English Language. In the 1830s, the ' spelling started to gain usage in the United States; by the 1860s, it had become the more common spelling there outside science. In 1892, Hall used the ' spelling in his advertising handbill for his new electrolytic method of producing the metal, despite his constant use of the ' spelling in all the patents he filed between 1886 and 1903. It was subsequently suggested this was a typo rather than intended. By 1890, both spellings had been common in the U.S. overall, the ' spelling being slightly more common; by 1895, the situation had reversed; by 1900, aluminum had been twice as common as aluminium; during the following decade, the ' spelling dominated American usage. In 1925, the American Chemical Society adopted this spelling.\n\nThe International Union of Pure and Applied Chemistry (IUPAC) adopted aluminium as the standard international name for the element in 1990. In 1993, they recognized aluminum as an acceptable variant; the same is true for the most recent 2005 edition of the IUPAC nomenclature of inorganic chemistry. IUPAC official publications use the ' spelling as primary but list both where appropriate. English Wikipedia follows this standard by adopting the \"aluminium\" spelling as the sole spelling in chemistry-related articles.\n\nProduction and refinement\n\nBayer process and Hall–Héroult processes\n\nBauxite is converted to aluminium oxide (Al2O3) by the Bayer process. Relevant chemical equations are:\nAl2O3  +  2 NaOH  →  2 NaAlO2   + H2O \n2 H2O  +  NaAlO2   →   Al(OH)3  +  NaOH\n2 Al(OH)3 → Al2O3 + 3 H2O\nThe intermediate, sodium aluminate, with the simplified formula NaAlO2, is soluble in strongly alkaline water, and the other components of the ore are not. Depending on the quality of the bauxite ore, twice as much waste (\"Bauxite tailings\") as alumina is generated.\n\nThe conversion of alumina to aluminium metal is achieved by the Hall–Héroult process. In this energy-intensive process, a solution of alumina in a molten (950 and) mixture of cryolite (Na3AlF6) with calcium fluoride is electrolyzed to produce metallic aluminium:\nAl3+ + 3 e− →  Al\nThe liquid aluminium metal sinks to the bottom of the solution and is tapped off, and usually cast into large blocks called aluminium billets for further processing.  Carbon dioxide is produced at the carbon anode:\n2 O2−  +  C   →   CO2  +  4 e−\nThe carbon anode is consumed by reaction with oxygen to form carbon dioxide gas, with a small quantity of fluoride gases. In modern smelters, the gas is filtered through alumina to remove fluorine compounds and return aluminium fluoride to the electrolytic cells.  The anode (i.e. the reduction cell) must be replaced regularly, since it is consumed in the process. The cathode is also eroded, mainly by electrochemical processes and liquid metal movement induced by intense electrolytic currents. After five to ten years, depending on the current used in the electrolysis, a cell must be rebuilt because of cathode wear.\n\nAluminium electrolysis with the Hall–Héroult process consumes a lot of energy. The worldwide average specific energy consumption is approximately 15±0.5 kilowatt-hours per kilogram of aluminium produced (52 to 56 MJ/kg). Some smelters achieve approximately 12.8 kW·h/kg (46.1 MJ/kg). (Compare this to the heat of reaction, 31 MJ/kg, and the Gibbs free energy of reaction, 29 MJ/kg.) Minimizing line currents for older technologies are typically 100 to 200 kiloamperes; state-of-the-art smelters operate at about 350 kA.\n\nThe Hall–Heroult process produces aluminium with a purity of above 99%. Further purification can be done by the Hoopes process. This process involves the electrolysis of molten aluminium with a sodium, barium and aluminium fluoride electrolyte. The resulting aluminium has a purity of 99.99%.\n\nElectric power represents about 20% to 40% of the cost of producing aluminium, depending on the location of the smelter. Aluminium production consumes roughly 5% of electricity generated in the US. Aluminium producers tend to locate smelters in places where electric power is both plentiful and inexpensive—such as the United Arab Emirates with its large natural gas supplies, and Iceland and Norway with energy generated from renewable sources. The world's largest smelters of alumina are located in the People's Republic of China, Russia and the provinces of Quebec and British Columbia in Canada.\n\nIn 2005, the People's Republic of China was the top producer of aluminium with almost a one-fifth world share, followed by Russia, Canada, and the US, reports the British Geological Survey.\n\nOver the last 50 years, Australia has become the world's top producer of bauxite ore and a major producer and exporter of alumina (before being overtaken by China in 2007). Australia produced 77 million tonnes of bauxite in 2013. The Australian deposits have some refining problems, some being high in silica, but have the advantage of being shallow and relatively easy to mine.\n\nAluminium chloride electrolysis process\n\nThe high energy consumption of Hall–Héroult process motivated the development of the electrolytic process based on aluminium chloride. The pilot plant with 6500 tons/year output was started in 1976 by Alcoa. The plant offered two advantages: (i) energy requirements were 40% less than plants using the Hall–Héroult process, and (ii) the more accessible kaolinite (instead of bauxite and cryolite) was used for feedstock.  Nonetheless, the pilot plant was shut down. The reasons for failure were the cost of aluminium chloride, general technology maturity problems, and leakage of the trace amounts of toxic polychlorinated biphenyl compounds.\n\nAluminium chloride process can also be used for the co-production of titanium, depending on titanium contents in kaolinite.\n\nAluminium carbothermic process\n\nThe non-electrolytic aluminium carbothermic process of aluminium production would theoretically be cheaper and consume less energy. However, it has been in the experimental phase for decades because the high operating temperature creates difficulties in material technology that have not yet been solved.[http://www1.eere.energy.gov/manufacturing/resources/aluminum/pdfs/act-arp.pdf Aluminum Carbothermic Technology Advanced Reactor Process] . US Department of Energy\n\nRecycling\n\nAluminium is theoretically 100% recyclable without any loss of its natural qualities. According to the International Resource Panel's Metal Stocks in Society report, the global per capita stock of aluminium in use in society (i.e. in cars, buildings, electronics etc.) is 80 kg. Much of this is in more-developed countries (350 – per capita) rather than less-developed countries (35 kg per capita). Knowing the per capita stocks and their approximate lifespans is important for planning recycling.\n\nRecovery of the metal through recycling has become an important task of the aluminium industry. Recycling was a low-profile activity until the late 1960s, when the growing use of aluminium beverage cans brought it to public awareness.\n\nRecycling involves melting the scrap, a process that requires only 5% of the energy used to produce aluminium from ore, though a significant part (up to 15% of the input material) is lost as dross (ash-like oxide). An aluminium stack melter produces significantly less dross, with values reported below 1%. The dross can undergo a further process to extract aluminium.\n\nEurope has achieved high rates of aluminium recycling ranging from 42% of beverage cans, 85% of construction materials, and 95% of transport vehicles.\n\nRecycled aluminium is known as secondary aluminium, but maintains the same physical properties as primary aluminium. Secondary aluminium is produced in a wide range of formats and is employed in 80% of alloy injections. Another important use is extrusion.\n\nWhite dross from primary aluminium production and from secondary recycling operations still contains useful quantities of aluminium that can be extracted industrially. The process produces aluminium billets, together with a highly complex waste material. This waste is difficult to manage. It reacts with water, releasing a mixture of gases (including, among others, hydrogen, acetylene, and ammonia), which spontaneously ignites on contact with air; contact with damp air results in the release of copious quantities of ammonia gas. Despite these difficulties, the waste is used as a filler in asphalt and concrete.\n\nApplications \n\nGeneral use \n\nAluminium is the most widely used non-ferrous metal. The global production of aluminium in 2005 was 31.9 million tonnes. It exceeded that of any other metal except iron (837.5 million tonnes).\n\nAluminium is almost always alloyed, which markedly improves its mechanical properties, especially when tempered. For example, the common aluminium foils and beverage cans are alloys of 92% to 99% aluminium. The main alloying agents are copper, zinc, magnesium, manganese, and silicon (e.g., duralumin) with the levels of other metals in a few percent by weight.\n\nSome of the many uses for aluminium metal are in:\n* Transportation (automobiles, aircraft, trucks, railway cars, marine vessels, bicycles, spacecraft, etc.) as sheet, tube, and castings.\n* Packaging (cans, foil, frame of etc.).\n* Food and beverage containers, because of its resistance to corrosion.\n* Construction (windows, doors, siding, building wire, sheathing, roofing, etc.).\n* A wide range of household items, from cooking utensils to baseball bats and watches.\n* Street lighting poles, sailing ship masts, walking poles.\n* Outer shells and cases for consumer electronics and photographic equipment.\n* Electrical transmission lines for power distribution (\"creep\" and oxidation are not issues in this application as the terminations are usually multi-sided \"crimps\" which enclose all sides of the conductor with a gas-tight seal).\n* MKM steel and Alnico magnets.\n* Super purity aluminium (SPA, 99.980% to 99.999% Al), used in electronics and CDs, and also in wires/cabling.\n* Heat sinks for transistors, CPUs, and other components in electronic appliances.\n* Substrate material of metal-core copper clad laminates used in high brightness LED lighting.\n* Light reflective surfaces and paint.\n* Pyrotechnics, solid rocket fuels, explosives and thermite\n* Production of hydrogen gas by reaction with water or sodium hydroxide.\n* In alloy with magnesium to make aircraft bodies and other transportation components.\n* Cooking utensils, because of its resistance to corrosion and light-weight.\n* Coins in such countries as France, Italy, Poland, Finland, Romania, Israel, and the former Yugoslavia struck from aluminium or an aluminium-copper alloy.\n* Musical instruments. Some guitar models sport aluminium diamond plates on the surface of the instruments, usually either chrome or black. Kramer Guitars and Travis Bean are both known for having produced guitars with necks made of aluminium, which gives the instrument a very distinctive sound. Aluminium is used to make some guitar resonators and some electric guitar speakers.\n\nAluminium is usually alloyed – it is used as pure metal only when corrosion resistance and/or workability is more important than strength or hardness. The strength of aluminium alloys is abruptly increased with small additions of scandium, zirconium, or hafnium.  A thin layer of aluminium can be deposited onto a flat surface by physical vapor deposition or (very infrequently) chemical vapor deposition or other chemical means to form optical coatings and mirrors.\n\nAluminium compounds\n\nBecause aluminium is abundant and most of its derivatives exhibit low toxicity, the compounds of aluminium enjoy wide and sometimes large-scale applications.\n\nAlumina\n\nAluminium oxide (Al2O3) and the associated oxy-hydroxides and trihydroxides are produced or extracted from minerals on a large scale. The great majority of this material is converted to metallic aluminium. In 2013, about 10% of the domestic shipments in the United States were used for other applications. One major use is to absorb water where it is viewed as a contaminant or impurity. Alumina is used to remove water from hydrocarbons in preparation for subsequent processes that would be poisoned by moisture.\n\nAluminium oxides are common catalysts for industrial processes; e.g. the Claus process to convert hydrogen sulfide to sulfur in refineries and to alkylate amines. Many industrial catalysts are \"supported\" by alumina, meaning that the expensive catalyst material (e.g., platinum) is dispersed over a surface of the inert alumina.\n\nBeing a very hard material (Mohs hardness 9), alumina is widely used as an abrasive; being extraordinarily chemically inert, it is useful in highly reactive environments such as high pressure sodium lamps.\n\nSulfates\n\nSeveral sulfates of aluminium have industrial and commercial application. Aluminium sulfate (Al2(SO4)3·(H2O)18) is produced on the annual scale of several billions of kilograms. About half of the production is consumed in water treatment. The next major application is in the manufacture of paper. It is also used as a mordant, in fire extinguishers, in fireproofing, as a food additive (E number E173), and in leather tanning. Aluminium ammonium sulfate, which is also called ammonium alum, (NH4)Al(SO4)2·12H2O, is used as a mordant and in leather tanning, as is aluminium potassium sulfate ([Al(K)](SO4)2)·(H2O)12. The consumption of both alums is declining.\n\nChlorides\n\nAluminium chloride (AlCl3) is used in petroleum refining and in the production of synthetic rubber and polymers. Although it has a similar name, aluminium chlorohydrate has fewer and very different applications, particularly as a colloidal agent in water purification and an antiperspirant. It is an intermediate in the production of aluminium metal.\n\nNiche compounds\n\nMany aluminium compounds have niche applications:\n* Aluminium acetate in solution is used as an astringent.\n* Aluminium borate (Al2O3·B2O3) and aluminium fluorosilicate (Al2(SiF6)3) are used in the production of glass, ceramics, synthetic gemstones. \n* Aluminium phosphate (AlPO4) used in the manufacture of glass, ceramic, pulp and paper products, cosmetics, paints, varnishes, and in dental cement. \n* Aluminium hydroxide (Al(OH)3) is used as an antacid, and mordant; it is used also in water purification, the manufacture of glass and ceramics, and in the waterproofing fabrics. \n* Lithium aluminium hydride is a powerful reducing agent used in organic chemistry. \n* Organoaluminiums are used as Lewis acids and cocatalysts.\n* Methylaluminoxane is a cocatalyst for Ziegler-Natta olefin polymerization to produce vinyl polymers such as polyethene. \n* Aqueous aluminium ions (such as aqueous aluminium sulfate) are used to treat against fish parasites such as Gyrodactylus salaris. \n* In many vaccines, certain aluminium salts serve as an immune adjuvant (immune response booster) to allow the protein in the vaccine to achieve sufficient potency as an immune stimulant.\n\nAluminium alloys in structural applications\n\nAluminium alloys with a wide range of properties are used in engineering structures. Alloy systems are classified by a number system (ANSI) or by names indicating their main alloying constituents (DIN and ISO).\n\nThe strength and durability of aluminium alloys vary widely, not only as a result of the components of the specific alloy, but also as a result of heat treatments and manufacturing processes. A lack of knowledge of these aspects has from time to time led to improperly designed structures and gained aluminium a bad reputation.\n\nOne important structural limitation of aluminium alloys is their fatigue strength. Unlike steels, aluminium alloys have no well-defined fatigue limit, meaning that fatigue failure eventually occurs, under even very small cyclic loadings. Engineers must assess applications and design for a fixed and finite life of the structure, rather than infinite life.\n\nAnother important property of aluminium alloys is sensitivity to heat. Workshop procedures are complicated by the fact that aluminium, unlike steel, melts without first glowing red. Manual blow torch operations require additional skill and experience. Aluminium alloys, like all structural alloys, are subject to internal stresses after heat operations such as welding and casting. The lower melting points of aluminium alloys make them more susceptible to distortions from thermally induced stress relief.  Stress can be relieved and controlled during manufacturing by heat-treating the parts in an oven, followed by gradual cooling—in effect annealing the stresses.\n\nThe low melting point of aluminium alloys has not precluded use in rocketry, even in combustion chambers where gases can reach 3500 K. The Agena upper stage engine used regeneratively cooled aluminium in some parts of the nozzle, including the thermally critical throat region.\n\nAnother alloy of some value is aluminium bronze (Cu-Al alloy).\n\nBiology\n\nDespite its widespread occurrence in the Earth crust, aluminium has no known function in biology. Aluminium salts are remarkably nontoxic, aluminium sulfate having an LD50 of 6207 mg/kg (oral, mouse), which corresponds to 500 grams for an 80 kg person. The extremely low acute toxicity notwithstanding, the health effects of aluminium are of interest in view of the widespread occurrence of the element in the environment and in commerce.\n\nHealth concerns\n\nIn very high doses, aluminium is associated with altered function of the blood–brain barrier. A small percentage of people are allergic to aluminium and experience contact dermatitis, digestive disorders, vomiting or other symptoms upon contact or ingestion of products containing aluminium, such as antiperspirants and antacids. In those without allergies, aluminium is not as toxic as heavy metals, but there is evidence of some toxicity if it is consumed in amounts greater than 40 mg/day per kg of body mass. The use of aluminium cookware has not been shown to lead to aluminium toxicity in general, however excessive consumption of antacids containing aluminium compounds and excessive use of aluminium-containing antiperspirants provide more significant exposure levels. Consumption of acidic foods or liquids with aluminium enhances aluminium absorption, and maltol has been shown to increase the accumulation of aluminium in nerve and bone tissues. Aluminium increases estrogen-related gene expression in human breast cancer cells cultured in the laboratory. The estrogen-like effects of these salts have led to their classification as metalloestrogens.\n\nThere is little evidence that aluminium in antiperspirants causes skin irritation. Nonetheless, its occurrence in antiperspirants, dyes (such as aluminium lake), and food additives has caused concern. Although there is little evidence that normal exposure to aluminium presents a risk to healthy adults,Gitelman, H. J. [https://books.google.com/books?id\nwRnOytsi8boC&pgPA90 \"Physiology of Aluminum in Man\"] , in Aluminum and Health, CRC Press, 1988, , p. 90 some studies point to risks associated with increased exposure to the metal. Aluminium in food may be absorbed more than aluminium from water. It is classified as a non-carcinogen by the US Department of Health and Human Services.\n\nIn case of suspected sudden intake of a large amount of aluminium, deferoxamine mesylate may be given to help eliminate it from the body by chelation.[http://www.med.nyu.edu/content?ChunkIID=164929 Aluminum Toxicity]  from NYU Langone Medical Center. Last reviewed November 2012 by Igor Puzanov, MD\n\nOccupational safety \n\nExposure to powdered aluminium or aluminium welding fumes can cause pulmonary fibrosis. The United States Occupational Safety and Health Administration (OSHA) has set a permissible exposure limit of 15 mg/m3 time weighted average (TWA) for total exposure and 5 mg/m3 TWA for respiratory exposure. The US National Institute for Occupational Safety and Health (NIOSH) recommended exposure limit is the same for respiratory exposure but is 10 mg/m3 for total exposure, and 5 mg/m3 for fumes and powder.\n\nFine aluminium powder can ignite or explode, posing another workplace hazard.\n\nAlzheimer's disease\n\nAluminium has controversially been implicated as a factor in Alzheimer's disease.  According to the Alzheimer's Society, the medical and scientific opinion is that studies have not convincingly demonstrated a causal relationship between aluminium and Alzheimer's disease.[http://alzheimers.org.uk/site/scripts/documents_info.php?documentID=99 Aluminium and Alzheimer's disease] , The Alzheimer's Society. Retrieved 30 January 2009. Research in this area has been inconclusive; aluminium accumulation may be a consequence of the disease rather than a causal agent.\n\nEffect on plants\n\nAluminium is primary among the factors that reduce plant growth on acid soils. Although it is generally harmless to plant growth in pH-neutral soils, the concentration in acid soils of toxic Al3+ cations increases and disturbs root growth and function.\n\nMost acid soils are saturated with aluminium rather than hydrogen ions. The acidity of the soil is therefore, a result of hydrolysis of aluminium compounds. The concept of \"corrected lime potential\" is now used to define the degree of base saturation in soil testing to determine the \"lime requirement\".Applying lime to soils reduces the Aluminum toxicity to plants.\n\nWheat has developed a tolerance to aluminium, releasing organic compounds that bind to harmful aluminium cations. Sorghum is believed to have the same tolerance mechanism. The first gene for aluminium tolerance has been identified in wheat. It was shown that sorghum's aluminium tolerance is controlled by a single gene, as for wheat. This adaptation is not found in all plants.\n\nBiodegradation \n\nA Spanish scientific report from 2001 claimed that the fungus Geotrichum candidum consumes the aluminium in compact discs. Other reports all refer back to the 2001 Spanish report and there is no supporting original research. Better documented, the bacterium Pseudomonas aeruginosa and the fungus Cladosporium resinae are commonly detected in aircraft fuel tanks that use kerosene-based fuels (not AV gas), and laboratory cultures can degrade aluminium. However, these life forms do not directly attack or consume the aluminium; rather, the metal is corroded by microbe waste products.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Aluminium" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=904" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Aluminium (British and IUPAC spelling) or aluminum (American spelling) is a chemical element with symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic, ductile metal in the boron group. By mass, aluminium makes up about 8% of the  Earth's crust; it is the third most abundant element after oxygen and silicon and the most abundant metal in the crust, though it is less common in the mantle below. The chief ore of aluminium is bauxite. Aluminium metal is so chemically reactive that native specimens are rare and limited to extreme reducing environments. Instead, it is found combined in over 270 different minerals.\n\nAluminium is remarkable for its low density and its ability to resist corrosion through the phenomenon of passivation. Aluminium and its alloys are vital to the aerospace industry and important in transportation and building industries, such as building facades and window frames. The oxides and sulfates are the most useful compounds of aluminium.\n\nDespite its prevalence in the environment, no known form of life uses aluminium salts metabolically, but aluminium is well tolerated by plants and animals. Because of these salts' abundance, the potential for a biological role for them is of continuing interest, and studies continue.\n\nPhysical characteristics \n\nNuclei and isotopes \n\nAluminium's atomic number is 13. Of aluminium isotopes, only one is stable: 27Al. It is the only isotope that has existed on Earth in its current form since the creation of the planet. It is essentially the only isotope representing the element on Earth, which makes aluminium a mononuclidic element and practically equates its standard atomic weight to that of the isotope. Such a low standard atomic weight of aluminium has some effects on the properties of the element (see below).\n\nAll other isotopes are radioactive and could not have survived; the most stable isotope of these is 26Al (half-life 720,000 years). 26Al is produced from argon in the atmosphere by spallation caused by cosmic ray protons and used in radiodating. The ratio of 26Al to 10Be has been used to study transport, deposition, sediment storage, burial times, and erosion on 105 to 106 year time scales. Most meteorite scientists believe that the energy released by the decay of 26Al was responsible for the melting and differentiation of some asteroids after their formation 4.55 billion years ago.\n\nThe remaining isotopes of aluminium, with mass numbers ranging from 21 to 43, all have half-lives well under an hour. Three metastable states are known, all with half-lives under a minute.\n\nElectron shell \n\nAn aluminium atom has 13 electrons, arranged in an electron configuration of [Ne]3s23p1, with three atoms beyond a stable noble gas configuration. Accordingly, the combined first three ionization energies of aluminium are far lower than the fourth ionization energy alone. Aluminium can relatively easily surrender its three outermost electrons in many chemical reactions (see below). The electronegativity of aluminium is 1.61 (Pauling scale). \n\nA free aluminium atom has a radius of 143 pm. With the three outermost electrons removed, the radius shrinks to 39 pm for a 4-coordinated atom or 53.5 pm for a 6-coordinated atom. At standard temperature and pressure, aluminium atoms (when not affected by atoms of other elements) form a face-centered cubic crystal system bound by metallic bonding provided by atoms' outermost electrons; hence aluminium (at these conditions) is a metal. This crystal system is shared by some other metals, such as lead and copper; the size of a unit cell of aluminium is comparable to that of those.\n\nBulk \n\nAluminium metal, when in quantity, is very shiny and resembles silver. Another important characteristic of aluminium is its low density, 2.70 g/cm3. Aluminium is a relatively soft, durable, lightweight, ductile, and malleable with appearance ranging from silvery to dull gray, depending on the surface roughness. It is nonmagnetic and does not easily ignite. A fresh film of aluminium serves as a good reflector (approximately 92%) of visible light and an excellent reflector (as much as 98%) of medium and far infrared radiation. The yield strength of pure aluminium is 7–11 MPa, while aluminium alloys have yield strengths ranging from 200 MPa to 600 MPa. Aluminium has about one-third the density and stiffness of steel. It is easily machined, cast, drawn and extruded.\n\nAluminium atoms are arranged in a face-centered cubic (fcc) structure. Aluminium has a stacking-fault energy of approximately 200 mJ/m2.\n\nAluminium is a good thermal and electrical conductor, having 59% the conductivity of copper, both thermal and electrical, while having only 30% of copper's density. Aluminium is capable of superconductivity, with a superconducting critical temperature of 1.2 kelvin and a critical magnetic field of about 100 gauss (10 milliteslas).\n\nAluminium is the most common material for the fabrication of superconducting qubits.\n\nChemistry \n\nCorrosion resistance can be excellent because a thin surface layer of aluminium oxide forms when the bare metal is exposed to air, effectively preventing further oxidation, in a process termed passivation.  The strongest aluminium alloys are less corrosion resistant due to galvanic reactions with alloyed copper. This corrosion resistance is greatly reduced by aqueous salts, particularly in the presence of dissimilar metals.\n\nIn highly acidic solutions, aluminium reacts with water to form hydrogen, and in highly alkaline ones to form aluminates— protective passivation under these conditions is negligible.  Primarily because it is corroded by dissolved chlorides, such as common sodium chloride, household plumbing is never made from aluminium.\n\nHowever, because of its general resistance to corrosion, aluminium is one of the few metals that retains silvery reflectance in finely powdered form, making it an important component of silver-colored paints. Aluminium mirror finish has the highest reflectance of any metal in the 200–400 nm (UV) and the 3,000–10,000 nm (far IR) regions; in the 400–700 nm visible range it is slightly outperformed by tin and silver and in the 700–3000 nm (near IR) by silver, gold, and copper.\n\nAluminium is oxidized by water at temperatures below 280 °C to produce hydrogen, aluminium hydroxide and heat:\n2 Al + 6 H2O → 2 Al(OH)3 + 3 H2\nThis conversion is of interest for the production of hydrogen. However, commercial application of this fact has challenges in circumventing the passivating oxide layer, which inhibits the reaction, and in storing the energy required to regenerate the aluminium metal.\n\nInorganic compounds \n\nThe vast majority of compounds, including all Al-containing minerals and all commercially significant aluminium compounds, feature aluminium in the oxidation state 3+. The coordination number of such compounds varies, but generally Al3+ is six-coordinate or tetracoordinate. Almost all compounds of aluminium(III) are colorless.\n\nAll four trihalides are well known. Unlike the structures of the three heavier trihalides, aluminium fluoride (AlF3) features six-coordinate Al. The octahedral coordination environment for AlF3 is related to the compactness of the fluoride ion, six of which can fit around the small Al3+ center. AlF3 sublimes (with cracking) at 1291 °C. With heavier halides, the coordination numbers are lower. The other trihalides are dimeric or polymeric with tetrahedral Al centers. These materials are prepared by treating aluminium metal with the halogen, although other methods exist. Acidification of the oxides or hydroxides affords hydrates. In aqueous solution, the halides often form mixtures, generally containing six-coordinate Al centers that feature both halide and aquo ligands. When aluminium and fluoride are together in aqueous solution, they readily form complex ions such as , , and . In the case of chloride, polyaluminium clusters are formed such as [Al13O4(OH)24(H2O)12]7+.\n\nAluminium forms one stable oxide with the chemical formula Al2O3. It can be found in nature in the mineral corundum. Aluminium oxide is also commonly called alumina. Sapphire and ruby are impure corundum contaminated with trace amounts of other metals. The two oxide-hydroxides, AlO(OH), are boehmite and diaspore. There are three trihydroxides: bayerite, gibbsite, and nordstrandite, which differ in their crystalline structure (polymorphs). Most are produced from ores by a variety of wet processes using acid and base. Heating the hydroxides leads to formation of corundum. These materials are of central importance to the production of aluminium and are themselves extremely useful.\n\nAluminium carbide (Al4C3) is made by heating a mixture of the elements above 1000 °C. The pale yellow crystals consist of tetrahedral aluminium centers. It reacts with water or dilute acids to give methane. The acetylide, Al2(C2)3, is made by passing acetylene over heated aluminium.\n\nAluminium nitride (AlN) is the only nitride known for aluminium. Unlike the oxides, it features tetrahedral Al centers. It can be made from the elements at 800 °C. It is air-stable material with a usefully high thermal conductivity. Aluminium phosphide (AlP) is made similarly; it hydrolyses to give phosphine:\n\nAlP + 3 H2O → Al(OH)3 + PH3\n\nRarer oxidation states \n\nAlthough the great majority of aluminium compounds feature Al3+ centers, compounds with lower oxidation states are known and sometime of significance as precursors to the Al3+ species.\n\nAluminium(I) \n\nAlF, AlCl and AlBr exist in the gaseous phase when the trihalide is heated with aluminium. The composition  is unstable at room temperature, converting to triiodide:\n\n3 AlI -> AlI3 + 2 Al\n\nA stable derivative of aluminium monoiodide is the cyclic adduct formed with triethylamine, . Also of theoretical interest but only of fleeting existence are Al2O and Al2S. Al2O is made by heating the normal oxide, Al2O3, with silicon at 1800 °C in a vacuum. Such materials quickly disproportionate to the starting materials.\n\nAluminium(II) \n\nVery simple Al(II) compounds are invoked or observed in the reactions of Al metal with oxidants. For example, aluminium monoxide, AlO, has been detected in the gas phase after explosion and in stellar absorption spectra. More thoroughly investigated are compounds of the formula R4Al2 which contain an Al-Al bond and where R is a large organic ligand.\n\nOrganoaluminium compounds and related hydrides \n\nA variety of compounds of empirical formula AlR3 and AlR1.5Cl1.5 exist. These species usually feature tetrahedral Al centers formed by dimerization with some R or Cl bridging between both Al atoms, e.g. \"trimethylaluminium\" has the formula Al2(CH3)6 (see figure). With large organic groups, triorganoaluminium compounds exist as three-coordinate monomers, such as triisobutylaluminium. Such compounds are widely used in industrial chemistry, despite the fact that they are often highly pyrophoric. Few analogues exist between organoaluminium and organoboron compounds other than large organic groups.\n\nThe important aluminium hydride is lithium aluminium hydride (LiAlH4), which is used in as a reducing agent in organic chemistry. It can be produced from lithium hydride and aluminium trichloride:\n\n4 LiH + AlCl3 → LiAlH4 + 3 LiCl\n\nSeveral useful derivatives of LiAlH4 are known, e.g. sodium bis(2-methoxyethoxy)dihydridoaluminate. The simplest hydride, aluminium hydride or alane, remains a laboratory curiosity. It is a polymer with the formula (AlH3)n, in contrast to the corresponding boron hydride that is a dimer with the formula (BH3)2.\n\nNatural occurrence\n\nStable aluminium is created when hydrogen fuses with magnesium, either in large stars or in supernovae. It is estimated to be the 14th most common element in the Universe, by mass-fraction.[http://periodictable.com/Properties/A/UniverseAbundance.v.log.html Abundance in the Universe for all the elements in the Periodic Table] . Periodictable.com. Retrieved on 30 July 2016. However, among the elements that have odd atomic numbers, aluminium is the third most abundant by mass fraction, after hydrogen and nitrogen.\n\nIn the Earth's crust, aluminium is the most abundant (8.3% by mass) metallic element and the third most abundant of all elements (after oxygen and silicon). The Earth's crust has a greater abundance of aluminium than the rest of the planet, primarily in aluminium silicates. In the Earth's mantle, which is only 2% aluminium by mass, these aluminium silicate minerals are largely replaced by silica and magnesium oxides. Overall, the Earth is about 1.4% aluminium by mass (eighth in abundance by mass). Aluminium occurs in greater proportion in the Earth than in the Solar system and Universe because the more common elements (hydrogen, helium, neon, nitrogen, carbon as hydrocarbon) are volatile at Earth's proximity to the Sun and large quantities of those were lost.\n\nBecause of its strong affinity for oxygen, aluminium is almost never found in the elemental state; instead it is found in oxides or silicates. Feldspars, the most common group of minerals in the Earth's crust, are aluminosilicates. Native aluminium metal can only be found as a minor phase in low oxygen fugacity environments, such as the interiors of certain volcanoes. Native aluminium has been reported in cold seeps in the northeastern continental slope of the South China Sea. Chen et al. (2011) propose the theory that these deposits resulted from bacterial reduction of tetrahydroxoaluminate Al(OH)4−.\n\nAluminium also occurs in the minerals beryl, cryolite, garnet, spinel, and turquoise. Impurities in Al2O3, such as chromium and iron, yield the gemstones ruby and sapphire, respectively.\n\nAlthough aluminium is a common and widespread element, not all aluminium minerals are economically viable sources of the metal. Almost all metallic aluminium is produced from the ore bauxite (AlOx(OH)3–2x). Bauxite occurs as a weathering product of low iron and silica bedrock in tropical climatic conditions. Bauxite is mined from large deposits in Australia, Brazil, Guinea, and Jamaica; it is also mined from lesser deposits in China, India, Indonesia, Russia, and Suriname.\n\nHistory \n\nEarly history \n\nAluminium metal was unknown to ancient people. Some sources, based on an account by Pliny the Elder, suggest a possibility that a Roman in the time of the emperor Tiberius had isolated aluminium; however, this claim has been disputed. It is possible that the Chinese were able to produce aluminium-containing alloys during the reign of the first Jin dynasty (265–420).\n\nThe history of aluminium has been shaped by usage of alum. First written record of alum, made by Greek historian Herodotus, dates back to the 5th century BCE. The ancients are known to have used alum as dyeing mordants and for city defense. After the Crusades, alum, a good indispensable in European fabric industry, was a subject of international commerce; it was imported to Europe from the eastern Mediterranean until the mid-15th century.\n\nEstablishing nature of alum \n\nThe nature of alum remained unknown. Around 1530, Swiss physician Paracelsus identified alum as separate from vitriole (sulfates), suggesting it was a salt of an earth of alum. In 1595, German doctor and chemist Andreas Libavius demonstrated that alum and green and blue vitriole were formed by the same acid but different earths; for the undiscovered earth that formed alum, he proposed the name \"alumina\". In 1722, German chemist Friedrich Hoffmann announced his belief that the base of alum was a distinct earth. In 1728, French chemist Étienne Geoffroy Saint-Hilaire suggested that alum was formed by an unknown earth and the sulfuric acid.\n\nIn 1754, German chemist Andreas Sigismund Marggraf synthesized the earth of alum by boiling clay in sulfuric acid and subsequently adding potash. In 1758, French chemist Pierre Macquer wrote that alumina resembled a metallic earth. In 1782, French chemist Antoine Lavoisier wrote he considered highly probable that alumina was an oxide of a metal which had an affinity for oxygen so strong no known reducing agents could overcome it. In 1783, Lavoisier replaced the dominant phlogiston theory with the idea of oxygen combustion and stated that metallic earths were oxides of their metals. Swedish chemist Jöns Jacob Berzelius suggested in 1815 the formula AlO3 for alumina. The correct formula, Al2O3, was established by the German chemist Eilhard Mitscherlich in 1821; this helped Berzelius determine the correct atomic weight of the metal, 27.\n\nSynthesis of metal \n\nAttempts to produce aluminium metal date back to 1760. The first successful attempt, however, was completed in 1824 by Danish physicist and chemist Hans Christian Ørsted. He reacted anhydrous aluminium chloride with potassium amalgam, yielding a lump of metal looking similar to tin. He presented his results and demonstrated a sample of the new metal in 1825. Ørsted gave little importance to his discovery; a different source suggests he could not continue his research because of financial reasons. Because of this and that he published his work in an unknown to the general European public Danish magazine, he is often not credited as the discoverer of the element; some earlier sources went further and claimed Ørsted had not in fact isolated aluminium.\n\nGerman chemist Friedrich Wöhler visited Ørsted in 1827. Ørsted told Wöhler he did not intend to continue his research on aluminium extraction. Wöhler was engaged with the problem and investigated it on his return from Denmark. After repeating Ørsted's experiments, Wöhler did not identify any aluminium. (The reason for this inconsistency was only discovered in 1921.) He conducted a similar experiment in 1827 by mixing anhydrous aluminium chloride with potassium and produced a powder of aluminium. In 1845, he was able to produce small pieces of the metal and described some physical properties of this metal.\n\nRare metal \n\nAs Wöhler's method could not yield great quantities of aluminium, the metal remained rare; its cost exceeded that of gold.\n\nFrench chemist Henri Etienne Sainte-Claire Deville announced an industrial method of aluminium production in 1854 at the Paris Academy of Sciences. Aluminium trichloride could be reduced by sodium, which was more convenient and less expensive than potassium, which Wöhler had used. Subsequently, bars of aluminium were exhibited for the first time to the general public at the Exposition Universelle of 1855. In 1856, Deville along with companions established the world's first industrial production of aluminium. From 1855 to 1859, the price of aluminium dropped by an order of magnitude, from US$500 to $40 per pound. Even then, aluminium was still not of great purity and produced aluminium differed in properties by sample.\n\nAt the next fair in Paris in 1867, the visitors were presented aluminium wire and foil; by the time of the next fair in 1878, aluminium had become a symbol of the future.\n\nElectrolytic production \n\nThe first industrial large-scale production method was independently developed by French engineer Paul Héroult and American engineer Charles Martin Hall; it is now known as the Hall–Héroult process. Héroult long could not find enough interest in his invention as demand for aluminium was still small; he started industrial production of aluminium bronze in Neuhausen am Rheinfall in 1888. Héroult sold his patents in a year; the buyers appointed him to the position of director of a smelter in Isère, which would produce on a large scale aluminium bronze at the initiation and pure aluminium in a few months. At the same time, Hall invented the same process and successfully tested it. He then sought to employ it for a large-scale production; for that, however, the existing smelters refused to adopt the new technique. He started the Pittsburgh Reduction Company in 1888 where he initiated mass production of aluminium. In the coming years, this technology was improved and new factories were constructed.\n\nThe Hall–Héroult process converts alumina into the metal; Austrian chemist Carl Joseph Bayer discovered a way of purifying bauxite to yield alumina, now known as the Bayer process, in 1889. Modern production of the aluminium metal is based on the Bayer and Hall–Héroult processes. The Hall–Héroult process was further improved in 1920 by a team led by Swedish chemist Carl Wilhelm Söderberg; this improvement greatly increased the world output of aluminium.\n\nMass usage \n\nPrices of aluminium did drop and aluminium had become widely used in jewelry, everyday items, eyeglass frames, and optical instruments by the early 1890s. Aluminium tableware began to be produced in the late 19th century and gradually supplanted copper and cast iron tableware in the first decades of the 20th century. Aluminium foil was also popularized at that time. Aluminium is soft and light; it was soon discovered, however, that alloying it with other metals could increase its hardness while preserving the low density. Aluminium's ability to form alloys with other metals provided the metal many uses in the late 19th and early 20th centuries. For instance, aluminium bronze is applied to make flexible bands, sheets, and wire and is widely employed in the shipbuilding and aviation industries. During World War I, major governments demanded large shipments of aluminium for light strong airframes. They often subsidized factories and the necessary electrical supply systems. Aviation during that time employed a new aluminium alloy, duralumin, invented in 1903 by German materials scientist Alfred Wilm.\n\nBy the mid-20th century, aluminium had become a part of everyday lives, also becoming an essential component of houseware. During the mid-20th century, aluminium emerged as a civil engineering material, with buildings using for both basic construction and interior, and advanced its use in military engineering, for both airplanes and land armor vehicle engines. In the beginning of the second half of that century, the space race began. Earth's first artificial satellite, launched in 1957, consisted of two separate aluminium semi-spheres joined together and all subsequent space vehicles have been made of aluminium. The aluminium can was invented in 1956 and employed as a storage for drinks in 1958.\n\nThroughout the 20th century, the production of aluminium rose rapidly: while the world production of aluminium in 1900 was 6,800 metric tons, the annual production first exceeded 100,000 metric tons in 1916; 1,000,000 tons in 1941; 10,000,000 tons in 1971. In the 1970s, the increased demand for aluminium made it an exchange commodity; it entered the London Metal Exchange, the oldest industrial metal exchange in the world, in 1978. The output continued to grow: the annual production of aluminium exceeded 50,000,000 metric tons in 2013.\n\nThe real price for aluminium declined from $14,000 per metric ton in 1900 to $2,340 in 1948 (all prices in this subsection are in 1998 United States dollars). Extraction and processing costs were lowered over technological progress and the scale of the economies. However, the need to exploit lower-grade poorer quality deposits and the use of fast increasing input costs (above all, energy) increased the net cost of aluminium; the real price began to grow in the 1970s with the rise of energy cost. Production moved from the industrialized countries to countries where production was cheaper. After aluminium became an exchange commodity, aluminium has been traded for United States dollars and its price fluctuated along with the exchange rates of the currency.  Production costs in the late 20th century changed because of advances in technology, lower energy prices, exchange rates of the United States dollar, and alumina prices. The BRIC countries' combined share grew in the first decade of the 21st century from 32.6% to 56.5% in primary production and 21.4% to 47.8% in primary consumption. China is accumulating an especially large share of world's production thanks to abundance of resources, cheap energy, and governmental stimuli; it also increased its consumption share from 2% in 1972 to 40% in 2010. In the United States, Western Europe, and Japan, most aluminium was consumed in transportation, engineering, construction, and packaging.\n\nEtymology \n\nAluminium is named after alumina, or aluminium oxide in modern nomenclature. The word \"alumina\" comes from \"alum\", the mineral from which it was collected. The word \"alum\" comes from alumen, a Latin word meaning \"bitter salt\". The word alumen stems from the Proto-Indo-European root *alu- meaning \"bitter\" or \"beer\".\n\nBritish chemist Humphry Davy, who performed a number of experiments aimed to synthesize the metal, is credited as the person who named aluminium. In 1808, he suggested the metal be named alumium. This suggestion was criticized by contemporary chemists from France, Germany, and Sweden, who insisted the metal should be named for the oxide, alumina, from which it would be isolated. In 1812, Davy chose aluminum, thus producing the modern name. However, it is spelled and pronounced differently outside of North America: aluminum is in use in the U.S. and Canada while aluminium is in use elsewhere.\n\nSpelling \n\nThe ' suffix followed the precedent set in other newly discovered elements of the time: potassium, sodium, magnesium, calcium, and strontium (all of which Davy isolated himself). Nevertheless, element names ending in ' were not unknown at the time; for example, platinum (known to Europeans since the 16th century), molybdenum (discovered in 1778), and tantalum (discovered in 1802). The ' suffix is consistent with the universal spelling alumina for the oxide (as opposed to aluminia); compare to lanthana, the oxide of lanthanum, and magnesia, ceria, and thoria, the oxides of magnesium, cerium, and thorium, respectively.\n\nIn 1812, British scientist Thomas Young wrote an anonymous review of Davy's book, in which he objected to aluminum and proposed the name aluminium: \"for so we shall take the liberty of writing the word, in preference to aluminum, which has a less classical sound.\" This name did catch on: while the ' spelling was occasionally used in Britain, the American scientific language used ' from the start. Most scientists used ' throughout the world in the 19th century; it still remains the standard in most other languages. In 1828, American lexicographer Noah Webster used exclusively the aluminum spelling in his American Dictionary of the English Language. In the 1830s, the ' spelling started to gain usage in the United States; by the 1860s, it had become the more common spelling there outside science. In 1892, Hall used the ' spelling in his advertising handbill for his new electrolytic method of producing the metal, despite his constant use of the ' spelling in all the patents he filed between 1886 and 1903. It was subsequently suggested this was a typo rather than intended. By 1890, both spellings had been common in the U.S. overall, the ' spelling being slightly more common; by 1895, the situation had reversed; by 1900, aluminum had been twice as common as aluminium; during the following decade, the ' spelling dominated American usage. In 1925, the American Chemical Society adopted this spelling.\n\nThe International Union of Pure and Applied Chemistry (IUPAC) adopted aluminium as the standard international name for the element in 1990. In 1993, they recognized aluminum as an acceptable variant; the same is true for the most recent 2005 edition of the IUPAC nomenclature of inorganic chemistry. IUPAC official publications use the ' spelling as primary but list both where appropriate. English Wikipedia follows this standard by adopting the \"aluminium\" spelling as the sole spelling in chemistry-related articles.\n\nProduction and refinement\n\nBayer process and Hall–Héroult processes\n\nBauxite is converted to aluminium oxide (Al2O3) by the Bayer process. Relevant chemical equations are:\nAl2O3  +  2 NaOH  →  2 NaAlO2   + H2O \n2 H2O  +  NaAlO2   →   Al(OH)3  +  NaOH\n2 Al(OH)3 → Al2O3 + 3 H2O\nThe intermediate, sodium aluminate, with the simplified formula NaAlO2, is soluble in strongly alkaline water, and the other components of the ore are not. Depending on the quality of the bauxite ore, twice as much waste (\"Bauxite tailings\") as alumina is generated.\n\nThe conversion of alumina to aluminium metal is achieved by the Hall–Héroult process. In this energy-intensive process, a solution of alumina in a molten (950 and) mixture of cryolite (Na3AlF6) with calcium fluoride is electrolyzed to produce metallic aluminium:\nAl3+ + 3 e− →  Al\nThe liquid aluminium metal sinks to the bottom of the solution and is tapped off, and usually cast into large blocks called aluminium billets for further processing.  Carbon dioxide is produced at the carbon anode:\n2 O2−  +  C   →   CO2  +  4 e−\nThe carbon anode is consumed by reaction with oxygen to form carbon dioxide gas, with a small quantity of fluoride gases. In modern smelters, the gas is filtered through alumina to remove fluorine compounds and return aluminium fluoride to the electrolytic cells.  The anode (i.e. the reduction cell) must be replaced regularly, since it is consumed in the process. The cathode is also eroded, mainly by electrochemical processes and liquid metal movement induced by intense electrolytic currents. After five to ten years, depending on the current used in the electrolysis, a cell must be rebuilt because of cathode wear.\n\nAluminium electrolysis with the Hall–Héroult process consumes a lot of energy. The worldwide average specific energy consumption is approximately 15±0.5 kilowatt-hours per kilogram of aluminium produced (52 to 56 MJ/kg). Some smelters achieve approximately 12.8 kW·h/kg (46.1 MJ/kg). (Compare this to the heat of reaction, 31 MJ/kg, and the Gibbs free energy of reaction, 29 MJ/kg.) Minimizing line currents for older technologies are typically 100 to 200 kiloamperes; state-of-the-art smelters operate at about 350 kA.\n\nThe Hall–Heroult process produces aluminium with a purity of above 99%. Further purification can be done by the Hoopes process. This process involves the electrolysis of molten aluminium with a sodium, barium and aluminium fluoride electrolyte. The resulting aluminium has a purity of 99.99%.\n\nElectric power represents about 20% to 40% of the cost of producing aluminium, depending on the location of the smelter. Aluminium production consumes roughly 5% of electricity generated in the US. Aluminium producers tend to locate smelters in places where electric power is both plentiful and inexpensive—such as the United Arab Emirates with its large natural gas supplies, and Iceland and Norway with energy generated from renewable sources. The world's largest smelters of alumina are located in the People's Republic of China, Russia and the provinces of Quebec and British Columbia in Canada.\n\nIn 2005, the People's Republic of China was the top producer of aluminium with almost a one-fifth world share, followed by Russia, Canada, and the US, reports the British Geological Survey.\n\nOver the last 50 years, Australia has become the world's top producer of bauxite ore and a major producer and exporter of alumina (before being overtaken by China in 2007). Australia produced 77 million tonnes of bauxite in 2013. The Australian deposits have some refining problems, some being high in silica, but have the advantage of being shallow and relatively easy to mine.\n\nAluminium chloride electrolysis process\n\nThe high energy consumption of Hall–Héroult process motivated the development of the electrolytic process based on aluminium chloride. The pilot plant with 6500 tons/year output was started in 1976 by Alcoa. The plant offered two advantages: (i) energy requirements were 40% less than plants using the Hall–Héroult process, and (ii) the more accessible kaolinite (instead of bauxite and cryolite) was used for feedstock.  Nonetheless, the pilot plant was shut down. The reasons for failure were the cost of aluminium chloride, general technology maturity problems, and leakage of the trace amounts of toxic polychlorinated biphenyl compounds.\n\nAluminium chloride process can also be used for the co-production of titanium, depending on titanium contents in kaolinite.\n\nAluminium carbothermic process\n\nThe non-electrolytic aluminium carbothermic process of aluminium production would theoretically be cheaper and consume less energy. However, it has been in the experimental phase for decades because the high operating temperature creates difficulties in material technology that have not yet been solved.[http://www1.eere.energy.gov/manufacturing/resources/aluminum/pdfs/act-arp.pdf Aluminum Carbothermic Technology Advanced Reactor Process] . US Department of Energy\n\nRecycling\n\nAluminium is theoretically 100% recyclable without any loss of its natural qualities. According to the International Resource Panel's Metal Stocks in Society report, the global per capita stock of aluminium in use in society (i.e. in cars, buildings, electronics etc.) is 80 kg. Much of this is in more-developed countries (350 – per capita) rather than less-developed countries (35 kg per capita). Knowing the per capita stocks and their approximate lifespans is important for planning recycling.\n\nRecovery of the metal through recycling has become an important task of the aluminium industry. Recycling was a low-profile activity until the late 1960s, when the growing use of aluminium beverage cans brought it to public awareness.\n\nRecycling involves melting the scrap, a process that requires only 5% of the energy used to produce aluminium from ore, though a significant part (up to 15% of the input material) is lost as dross (ash-like oxide). An aluminium stack melter produces significantly less dross, with values reported below 1%. The dross can undergo a further process to extract aluminium.\n\nEurope has achieved high rates of aluminium recycling ranging from 42% of beverage cans, 85% of construction materials, and 95% of transport vehicles.\n\nRecycled aluminium is known as secondary aluminium, but maintains the same physical properties as primary aluminium. Secondary aluminium is produced in a wide range of formats and is employed in 80% of alloy injections. Another important use is extrusion.\n\nWhite dross from primary aluminium production and from secondary recycling operations still contains useful quantities of aluminium that can be extracted industrially. The process produces aluminium billets, together with a highly complex waste material. This waste is difficult to manage. It reacts with water, releasing a mixture of gases (including, among others, hydrogen, acetylene, and ammonia), which spontaneously ignites on contact with air; contact with damp air results in the release of copious quantities of ammonia gas. Despite these difficulties, the waste is used as a filler in asphalt and concrete.\n\nApplications \n\nGeneral use \n\nAluminium is the most widely used non-ferrous metal. The global production of aluminium in 2005 was 31.9 million tonnes. It exceeded that of any other metal except iron (837.5 million tonnes).\n\nAluminium is almost always alloyed, which markedly improves its mechanical properties, especially when tempered. For example, the common aluminium foils and beverage cans are alloys of 92% to 99% aluminium. The main alloying agents are copper, zinc, magnesium, manganese, and silicon (e.g., duralumin) with the levels of other metals in a few percent by weight.\n\nSome of the many uses for aluminium metal are in:\n* Transportation (automobiles, aircraft, trucks, railway cars, marine vessels, bicycles, spacecraft, etc.) as sheet, tube, and castings.\n* Packaging (cans, foil, frame of etc.).\n* Food and beverage containers, because of its resistance to corrosion.\n* Construction (windows, doors, siding, building wire, sheathing, roofing, etc.).\n* A wide range of household items, from cooking utensils to baseball bats and watches.\n* Street lighting poles, sailing ship masts, walking poles.\n* Outer shells and cases for consumer electronics and photographic equipment.\n* Electrical transmission lines for power distribution (\"creep\" and oxidation are not issues in this application as the terminations are usually multi-sided \"crimps\" which enclose all sides of the conductor with a gas-tight seal).\n* MKM steel and Alnico magnets.\n* Super purity aluminium (SPA, 99.980% to 99.999% Al), used in electronics and CDs, and also in wires/cabling.\n* Heat sinks for transistors, CPUs, and other components in electronic appliances.\n* Substrate material of metal-core copper clad laminates used in high brightness LED lighting.\n* Light reflective surfaces and paint.\n* Pyrotechnics, solid rocket fuels, explosives and thermite\n* Production of hydrogen gas by reaction with water or sodium hydroxide.\n* In alloy with magnesium to make aircraft bodies and other transportation components.\n* Cooking utensils, because of its resistance to corrosion and light-weight.\n* Coins in such countries as France, Italy, Poland, Finland, Romania, Israel, and the former Yugoslavia struck from aluminium or an aluminium-copper alloy.\n* Musical instruments. Some guitar models sport aluminium diamond plates on the surface of the instruments, usually either chrome or black. Kramer Guitars and Travis Bean are both known for having produced guitars with necks made of aluminium, which gives the instrument a very distinctive sound. Aluminium is used to make some guitar resonators and some electric guitar speakers.\n\nAluminium is usually alloyed – it is used as pure metal only when corrosion resistance and/or workability is more important than strength or hardness. The strength of aluminium alloys is abruptly increased with small additions of scandium, zirconium, or hafnium.  A thin layer of aluminium can be deposited onto a flat surface by physical vapor deposition or (very infrequently) chemical vapor deposition or other chemical means to form optical coatings and mirrors.\n\nAluminium compounds\n\nBecause aluminium is abundant and most of its derivatives exhibit low toxicity, the compounds of aluminium enjoy wide and sometimes large-scale applications.\n\nAlumina\n\nAluminium oxide (Al2O3) and the associated oxy-hydroxides and trihydroxides are produced or extracted from minerals on a large scale. The great majority of this material is converted to metallic aluminium. In 2013, about 10% of the domestic shipments in the United States were used for other applications. One major use is to absorb water where it is viewed as a contaminant or impurity. Alumina is used to remove water from hydrocarbons in preparation for subsequent processes that would be poisoned by moisture.\n\nAluminium oxides are common catalysts for industrial processes; e.g. the Claus process to convert hydrogen sulfide to sulfur in refineries and to alkylate amines. Many industrial catalysts are \"supported\" by alumina, meaning that the expensive catalyst material (e.g., platinum) is dispersed over a surface of the inert alumina.\n\nBeing a very hard material (Mohs hardness 9), alumina is widely used as an abrasive; being extraordinarily chemically inert, it is useful in highly reactive environments such as high pressure sodium lamps.\n\nSulfates\n\nSeveral sulfates of aluminium have industrial and commercial application. Aluminium sulfate (Al2(SO4)3·(H2O)18) is produced on the annual scale of several billions of kilograms. About half of the production is consumed in water treatment. The next major application is in the manufacture of paper. It is also used as a mordant, in fire extinguishers, in fireproofing, as a food additive (E number E173), and in leather tanning. Aluminium ammonium sulfate, which is also called ammonium alum, (NH4)Al(SO4)2·12H2O, is used as a mordant and in leather tanning, as is aluminium potassium sulfate ([Al(K)](SO4)2)·(H2O)12. The consumption of both alums is declining.\n\nChlorides\n\nAluminium chloride (AlCl3) is used in petroleum refining and in the production of synthetic rubber and polymers. Although it has a similar name, aluminium chlorohydrate has fewer and very different applications, particularly as a colloidal agent in water purification and an antiperspirant. It is an intermediate in the production of aluminium metal.\n\nNiche compounds\n\nMany aluminium compounds have niche applications:\n* Aluminium acetate in solution is used as an astringent.\n* Aluminium borate (Al2O3·B2O3) and aluminium fluorosilicate (Al2(SiF6)3) are used in the production of glass, ceramics, synthetic gemstones. \n* Aluminium phosphate (AlPO4) used in the manufacture of glass, ceramic, pulp and paper products, cosmetics, paints, varnishes, and in dental cement. \n* Aluminium hydroxide (Al(OH)3) is used as an antacid, and mordant; it is used also in water purification, the manufacture of glass and ceramics, and in the waterproofing fabrics. \n* Lithium aluminium hydride is a powerful reducing agent used in organic chemistry. \n* Organoaluminiums are used as Lewis acids and cocatalysts.\n* Methylaluminoxane is a cocatalyst for Ziegler-Natta olefin polymerization to produce vinyl polymers such as polyethene. \n* Aqueous aluminium ions (such as aqueous aluminium sulfate) are used to treat against fish parasites such as Gyrodactylus salaris. \n* In many vaccines, certain aluminium salts serve as an immune adjuvant (immune response booster) to allow the protein in the vaccine to achieve sufficient potency as an immune stimulant.\n\nAluminium alloys in structural applications\n\nAluminium alloys with a wide range of properties are used in engineering structures. Alloy systems are classified by a number system (ANSI) or by names indicating their main alloying constituents (DIN and ISO).\n\nThe strength and durability of aluminium alloys vary widely, not only as a result of the components of the specific alloy, but also as a result of heat treatments and manufacturing processes. A lack of knowledge of these aspects has from time to time led to improperly designed structures and gained aluminium a bad reputation.\n\nOne important structural limitation of aluminium alloys is their fatigue strength. Unlike steels, aluminium alloys have no well-defined fatigue limit, meaning that fatigue failure eventually occurs, under even very small cyclic loadings. Engineers must assess applications and design for a fixed and finite life of the structure, rather than infinite life.\n\nAnother important property of aluminium alloys is sensitivity to heat. Workshop procedures are complicated by the fact that aluminium, unlike steel, melts without first glowing red. Manual blow torch operations require additional skill and experience. Aluminium alloys, like all structural alloys, are subject to internal stresses after heat operations such as welding and casting. The lower melting points of aluminium alloys make them more susceptible to distortions from thermally induced stress relief.  Stress can be relieved and controlled during manufacturing by heat-treating the parts in an oven, followed by gradual cooling—in effect annealing the stresses.\n\nThe low melting point of aluminium alloys has not precluded use in rocketry, even in combustion chambers where gases can reach 3500 K. The Agena upper stage engine used regeneratively cooled aluminium in some parts of the nozzle, including the thermally critical throat region.\n\nAnother alloy of some value is aluminium bronze (Cu-Al alloy).\n\nBiology\n\nDespite its widespread occurrence in the Earth crust, aluminium has no known function in biology. Aluminium salts are remarkably nontoxic, aluminium sulfate having an LD50 of 6207 mg/kg (oral, mouse), which corresponds to 500 grams for an 80 kg person. The extremely low acute toxicity notwithstanding, the health effects of aluminium are of interest in view of the widespread occurrence of the element in the environment and in commerce.\n\nHealth concerns\n\nIn very high doses, aluminium is associated with altered function of the blood–brain barrier. A small percentage of people are allergic to aluminium and experience contact dermatitis, digestive disorders, vomiting or other symptoms upon contact or ingestion of products containing aluminium, such as antiperspirants and antacids. In those without allergies, aluminium is not as toxic as heavy metals, but there is evidence of some toxicity if it is consumed in amounts greater than 40 mg/day per kg of body mass. The use of aluminium cookware has not been shown to lead to aluminium toxicity in general, however excessive consumption of antacids containing aluminium compounds and excessive use of aluminium-containing antiperspirants provide more significant exposure levels. Consumption of acidic foods or liquids with aluminium enhances aluminium absorption, and maltol has been shown to increase the accumulation of aluminium in nerve and bone tissues. Aluminium increases estrogen-related gene expression in human breast cancer cells cultured in the laboratory. The estrogen-like effects of these salts have led to their classification as metalloestrogens.\n\nThere is little evidence that aluminium in antiperspirants causes skin irritation. Nonetheless, its occurrence in antiperspirants, dyes (such as aluminium lake), and food additives has caused concern. Although there is little evidence that normal exposure to aluminium presents a risk to healthy adults,Gitelman, H. J. [https://books.google.com/books?id\nwRnOytsi8boC&pgPA90 \"Physiology of Aluminum in Man\"] , in Aluminum and Health, CRC Press, 1988, , p. 90 some studies point to risks associated with increased exposure to the metal. Aluminium in food may be absorbed more than aluminium from water. It is classified as a non-carcinogen by the US Department of Health and Human Services.\n\nIn case of suspected sudden intake of a large amount of aluminium, deferoxamine mesylate may be given to help eliminate it from the body by chelation.[http://www.med.nyu.edu/content?ChunkIID=164929 Aluminum Toxicity]  from NYU Langone Medical Center. Last reviewed November 2012 by Igor Puzanov, MD\n\nOccupational safety \n\nExposure to powdered aluminium or aluminium welding fumes can cause pulmonary fibrosis. The United States Occupational Safety and Health Administration (OSHA) has set a permissible exposure limit of 15 mg/m3 time weighted average (TWA) for total exposure and 5 mg/m3 TWA for respiratory exposure. The US National Institute for Occupational Safety and Health (NIOSH) recommended exposure limit is the same for respiratory exposure but is 10 mg/m3 for total exposure, and 5 mg/m3 for fumes and powder.\n\nFine aluminium powder can ignite or explode, posing another workplace hazard.\n\nAlzheimer's disease\n\nAluminium has controversially been implicated as a factor in Alzheimer's disease.  According to the Alzheimer's Society, the medical and scientific opinion is that studies have not convincingly demonstrated a causal relationship between aluminium and Alzheimer's disease.[http://alzheimers.org.uk/site/scripts/documents_info.php?documentID=99 Aluminium and Alzheimer's disease] , The Alzheimer's Society. Retrieved 30 January 2009. Research in this area has been inconclusive; aluminium accumulation may be a consequence of the disease rather than a causal agent.\n\nEffect on plants\n\nAluminium is primary among the factors that reduce plant growth on acid soils. Although it is generally harmless to plant growth in pH-neutral soils, the concentration in acid soils of toxic Al3+ cations increases and disturbs root growth and function.\n\nMost acid soils are saturated with aluminium rather than hydrogen ions. The acidity of the soil is therefore, a result of hydrolysis of aluminium compounds. The concept of \"corrected lime potential\" is now used to define the degree of base saturation in soil testing to determine the \"lime requirement\".Applying lime to soils reduces the Aluminum toxicity to plants.\n\nWheat has developed a tolerance to aluminium, releasing organic compounds that bind to harmful aluminium cations. Sorghum is believed to have the same tolerance mechanism. The first gene for aluminium tolerance has been identified in wheat. It was shown that sorghum's aluminium tolerance is controlled by a single gene, as for wheat. This adaptation is not found in all plants.\n\nBiodegradation \n\nA Spanish scientific report from 2001 claimed that the fungus Geotrichum candidum consumes the aluminium in compact discs. Other reports all refer back to the 2001 Spanish report and there is no supporting original research. Better documented, the bacterium Pseudomonas aeruginosa and the fungus Cladosporium resinae are commonly detected in aircraft fuel tanks that use kerosene-based fuels (not AV gas), and laboratory cultures can degrade aluminium. However, these life forms do not directly attack or consume the aluminium; rather, the metal is corroded by microbe waste products. Aluminium. http://en.wikipedia.org/?curid=904."
  }
}
