{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12430",
  "eid" : "02596730-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778513187,
  "textBody" : "The Game Boy Advance (GBA) is a 32-bit handheld video game console developed, manufactured and marketed by Nintendo as the successor to the Game Boy Color. It was released in Japan on March 21, 2001, in North America on June 11, 2001, in Australia and Europe on June 22, 2001, and in mainland China on June 8, 2004 (as iQue Game Boy Advance). Nintendo's competitors in the handheld market at the time were the Neo Geo Pocket Color, WonderSwan, GP32, Tapwave Zodiac, and the N-Gage. Despite the competitors' best efforts, Nintendo maintained a majority market share with the Game Boy Advance.\n\nAs of June 30, 2010, the Game Boy Advance series has sold 81.51 million units worldwide. Its successor, the Nintendo DS, was released in November 2004 and is also compatible with Game Boy Advance software.\n\nHistory\n\nContrary to the previous Game Boy models, which were all following the \"portrait\" form factor of the original Game Boy (designed by Gunpei Yokoi), the Game Boy Advance was designed in a \"landscape\" form factor, putting the buttons to the sides of the device instead of below the screen. The Game Boy Advance was designed by the French designer Gwénaël Nicolas and his Tokyo-based design studio Curiosity Inc.[http://curiosity.jp/works/en/product/gameboy-advance.html Gameboy Advance | WORKS - CURIOSITY - キュリオシティ - ]. Retrieved December 21, 2015.\n\nProject Atlantis\n\nIn 1996, magazines including Electronic Gaming Monthly, Next Generation, issues 53 and 54 of Total! and the July 1996 issue of Game Informer featured reports of a new Game Boy, codenamed Project Atlantis. Although Nintendo's expectations of releasing the system in at least one territory by the end of 1996 would make that machine seem to be the Game Boy Color, it was described as having a 32-bit RISC processor, a 3-by-2-inch color LCD screen, and a link port—a description that more closely matches the Game Boy Advance. It also may have referred to the unnamed, unreleased Game Boy Color successor prototype that was revealed at 2009's Game Developers Conference.[http://www.joystiq.com/2009/03/25/gdc09-dsi-architect-reveals-unreleased-nintendo-handhelds/#continued GDC 2009 Nintendo Reveals Unreleased Nintendo Handhelds]. Retrieved March 25, 2009. It was announced that Nintendo of Japan was working on a game for the system called \"Mario's Castle\".\n\nTechnical specifications\n\nThe technical specificationshttp://www.cs.rit.edu/~tjh8300/CowBite/CowBiteSpec.htm#Text Backgrounds of the original Game Boy Advance are, as provided by Nintendo:\n\nBackward compatibility for Game Boy and Game Boy Color games is provided by a custom 4.194/8.388 MHz Z80-based coprocessor (Game Boy Advance software can use the audio tone generators to supplement the primary sound system), while a link port at the top of the unit allows it to be connected to other devices using a Game Link cable or GameCube link cable. When playing Game Boy or Game Boy Color games on the Game Boy Advance, the L and R buttons can be used to toggle between a stretched widescreen format  and the original screen ratio of the Game Boy . Game Boy games can be played using the same selectable color palettes as on the Game Boy Color.\nEvery Nintendo handheld system following the release of the Game Boy Advance SP has included a built-in light and rechargeable battery.\n\nThe Game Boy Advance and Nintendo DS 2D graphics hardware have scaling and rotation for traditional tiled backgrounds in its modes 1 and 2 and scaling and rotation for bitmaps in modes 3 through 5 (used less often on the GBA because of technical limitations). On each machine supporting this effect, it is possible to change the scaling and rotation values during the horizontal blanking period of each scanline to draw a flat plane in a perspective projection. More complex effects such as fuzz are possible by using other equations for the position, scaling, and rotation of each line. The \"character mode\" supports up to 4 tile map background layers per frame, with each tile being 8x8 pixels in size and having 16 or 256 colors. The \"character mode\" also supports up to 128 hardware sprites per frame, with any sprite size from 8x8 to 64x64 pixels and with 16 or 256 colors per sprite.\n\nGames\n\n \n\nWith hardware comparable to the Super NES, the Game Boy Advance represents progress for sprite-based technology. The Game Boy Advance has platformers, SNES-style role-playing video games, and classic games ported from various 8-bit and 16-bit systems of the previous generations.  This includes the Super Mario Advance series, as well as the system's backward compatibility with all earlier Game Boy titles.\n\nFinal Fantasy VI Advance was the final licensed Japanese GBA game release.  Released November 2006, it was the final Nintendo-published game for the system.  The Legend of Spyro: The Eternal Night was the final European GBA game, released November 2007. Samurai Deeper Kyo was the final North American GBA game, released in February 2008. The last Nintendo-developed game released for the system was the Japan-only rhythm game Rhythm Tengoku, which later went on to form the popular Rhythm Heaven series.\n\nCompatibility with other systems\n\nAn accessory for the GameCube, known as the Game Boy Player, was released in 2003 as the successor to the Super Game Boy peripheral for the Super Nintendo Entertainment System. The accessory allows Game Boy Advance games, as well as Game Boy and Game Boy Color games, to be played on the GameCube. However, some games may have compatibility issues due to certain features (for example, games with built-in motion sensors would require players to manipulate the console itself).\n\nGame Boy Advance games are compatible with the Nintendo DS and Nintendo DS Lite handheld consoles, which feature a cartridge slot at the bottom. They are not, however, compatible with the Nintendo DSi, as it does not feature a cartridge slot.\n\nVirtual Console\n\nAs part of an Ambassador Program for early adopters of the Nintendo 3DS system, ten Game Boy Advance games were made available free for players who bought a system before August 2011. Unlike other Virtual Console games for the system, players were not able to use features such as the Home menu or save states. 3DS systems that have custom firmware installed can also install the ten available games available to Ambassador Program members. Many other Game Boy Advance games can also be played via custom firmware by injecting a difference game into one of the officially released Game Boy Advance games, including Game Boy Advance games not available on the Wii U Virtual console. Satoru Iwata stated Game Boy Advance games will be available on the Wii U Virtual Console sometime during April 2014. On April 3, 2014, the first of the announced GBA games (Advance Wars, Metroid Fusion and Mario & Luigi: Superstar Saga) were released for the Wii U Virtual Console. A full Virtual Console service for Game Boy Advance games was launched for the Wii U console. All of the Virtual Console releases are single player only, as they do not emulate multiplayer features enabled by Game Link cables.\n\nAccessories\n\nOfficial\n\nNintendo released many addons for the Game Boy Advance. These include:\n* Wireless Adapter: Released in 2004, this adapter hooks up to the back of the Game Boy Advance. It replaces link cables and allows many people to link together. It marketed for US$20 and came included with Pokémon FireRed and LeafGreen. Because it was released so late in the Game Boy Advance's life, fewer than 20 games support this hardware. The adapter's usefulness is most evident in Pokémon, as FireRed/LeafGreen and Emerald feature a \"Union Room\" where up to forty people can enter to battle or trade Pokémon. A Game Boy Micro version has also been released; it can interact fully with both models of the Wireless Adapter.\n* Game Boy Advance Infra-Red Adapter: This adapter was included with the game Cyberdrive Zoids, as it is only compatible with this game and the latest GBA Pokémon games. The adapter was not sold separately. This is also currently the only Game Boy Advance accessory that has not been remade for the Game Boy Micro.\n* Nintendo GameCube – Game Boy Advance link cable: The link cable is used to connect the Game Boy Advance to the GameCube gaming console. It is intended for interoperability between games for the Game Boy and corresponding games for the GameCube. There were not many games that supported the hardware; notable titles are Final Fantasy Crystal Chronicles and The Legend of Zelda: Four Swords Adventures, allowing up to 4 players to use their Advance or SP handheld as a controller that has additional information on the screen, as well as The Legend of Zelda: The Wind Waker, allowing additional content to be unlocked through Tingle, one of the characters in the game. When using the cable in the game \"Animal Crossing\", players would be greeted by the in game character Kapp'n at the dock who would transport them to a previously inaccessible island. The device works for Pokémon Colosseum and Pokémon XD which lets you trade Pokémon back and forth to its GBA iterations (Pokémon FireRed, LeafGreen, Ruby, Sapphire, and Emerald). In addition, it can be used to transfer Chao between Sonic Adventure 2, Sonic Adventure DX and Sonic Advance, Sonic Advance 2. Finally, it can be used to unlock the \"Fusion\" skin for Samus (that was introduced in Metroid Fusion) for use in Metroid Prime, provided that the player has also met certain conditions in both Fusion and Prime.\n* Play-Yan: The Play-Yan is an MP3/MPEG4 player for the Game Boy Advance and Nintendo DS. The cartridge is slightly broader than a normal Game Boy Advance cartridge and includes a built-in headphone port as well as an SD Card slot. Music or videos that users have downloaded from the Internet can be transferred onto an SD Card and slotted into the Play-Yan device. Nintendo has released several mini games for the Play-Yan that can be downloaded from their website, although Nintendo later removed all minigame functionality through a firmware update. The Play-Yan was initially available in Japan only, but was released in Europe as the Nintendo MP3 Player on December 8, 2006, with the MPEG4 functionality removed. The Play-Yan was never released in North America.\n* e-Reader: The e-Reader is a scanning device that plugs into the game cartridge slot of the Game Boy Advance. Specialized cards with codes along the side and bottom are slid through the slot, scanning the card into the Game Boy Advance. Many ideas for the e-Reader include cards that scan classic games like Donkey Kong and Excitebike onto the handheld ready to play, as well as a collaboration with Super Mario Advance 4 and Pokémon Ruby and Sapphire to have cards that unlock content. GameCube games like Animal Crossing have cards with unlockable content as well, and the Pokémon Trading Card Game playing cards also adopt the e-Reader codes. The e-Reader works with the Game Boy Player and Game Boy Advance SP, but cannot fit into the Nintendo DS's Game Boy slot (however it can fit into the Nintendo DS Lite's Game Boy slot). Though it failed to catch on in the US, it proved to be very popular in Japan. It was not released in Europe.\n* Game Boy Advance Video: These cartridges contain two episodes of thirty-minute cartoon programs. First released in North America in May 2004, these cartridges included cartoons such as Dragon Ball GT, Pokémon, SpongeBob SquarePants, Sonic X, Teenage Mutant Ninja Turtles, and Yu-Gi-Oh!. The movies Shrek, Shrek 2, and Shark Tale are also available for Game Boy Advance Video and all three movies are full. Due to the Game Boy Advance screen ratio, the three movies are in their widescreen format. These cartridges display an error when inserted into a GameCube via a Game Boy Player. The Game Boy Advance Videos are no longer available at most major retailers.\n* Cleaning cartridge: A white cartridge that has a soft cloth inside so that it cleans the connectors of the Game Boy Advance when inserted. It can also be used to clean Slot 2 of the Nintendo DS or DS Lite.\n* Mobile Adapter: The device works with Game Boy and Game Boy Advance systems to connect to mobile phones for remote play. It was released in Japan and was compatible with Pokémon Crystal.\n\nUnofficial\n\nOther accessories for the Game Boy Advance are:\n* Afterburner: The Afterburner was an internal front-lighting system manufactured by Triton Labs and released in mid-2002. The installation consisted of disassembling the system, removing some plastic from the interior of the case, attaching the lighting mechanism to the screen, and soldering two wires to the motherboard for power. Optionally, a potentiometer or an integrated circuit could be added to allow adjusting the brightness of the light. When the initial version of the Game Boy Advance SP was released, it included a very similar integrated lighting system.  This was replaced in the subsequent version of the Game Boy Advance SP with a backlit display. According to Triton Labs, the Afterburner achieved considerable success during the lifespan of the GBA, with many gamers buying it despite the kit technically voiding the system’s warranty, and the company had minor trouble keeping up with demand for the accessory during the 2002 holiday season.\n* Halo Light: The Halo light was an external front-lighting system that replaced the screen protector/lens of the GBA. The Halo had an external power adapter that connected to the link port, it featured on/off functions with a dimmer and a pass-through connector so other devices could be connected to the link port.\n* Worm Light: The Worm Light was an adjustable and flexible light that connected to the link port. It had a small bulb which shone over the screen.\n* GBA Movie Player: The GBA Movie Player is a versatile gaming cartridge that allows users to play NES/Famicom games, watch movies, read .txt files, listen to sound clips, etc. The GBA Movie Player does not actually play MPEGS or MP3s directly, a freeware conversion software is needed, that converts an array of formats into GBM and GBS formats that are compatible with the GBA Movie Player. There are two forms of the GBA Movie Player with one using a CF (Compact Flash) card and one using an SD (Secure Digital) card, though different companies have made their own devices similar to the GBA Movie Player.\n* GBA TV Tuner: It makes the portable system into a portable television. There are several versions available, which are made by different companies. The most popular TV Tuner requires a cartridge inserted in the Tuner to start up. The TV Tuners can store up to 99 channels.\n* GameShark: The Game Boy Advance version of the GameShark, programmed only to work with Game Boy Advance games as making the device take Game Boy Color cartridges too would have made it expensive. This cheat device allowed users to change the code in their games to create cheats. Codes could be entered by hand or uploaded to the device itself with the provided USB cable and software.\n* Action Replay: A cheating device like the GameShark, the Action Replay was sold mainly in Europe. It has a few extra features as well as an updated interface.\n* Action Replay MAX Duo: This was an update to the Action Replay for Game Boy Advance. Not only did it function as an Action Replay, but for DS users, it could hold premade game saves or \"powersaves\" that could be downloaded from the Action Replay site as well as user made saves. It did not, however, function as a cheat device for Nintendo DS games; it was only for data backup.\n* Worm Cam: This device by Nyko attached to the top of the Game Boy Advance and connected into the link port of the GBA. This device functioned as a digital camera which allowed digital pictures to be taken. The snapshots could then be uploaded to a PC with the USB cable and software provided. This camera's strange shape prevented it from being used with the GBA SP.\n* DigiCam SP: This camera attachment was also made by Nyko and was essentially the Worm Cam for the Game Boy Advance SP. This add-on would slide on to the top half of the GBA SP (behind the screen) and a small plug would be connected into the link port.\n* DataBoy: This cartridge plugs into the GBA game slot and converts the Game Boy into an RS-232 data scope (also known as serial line monitor or protocol analyzer). Users can play GB games, GBC games, and GBA games on it.\n* Game Boy Advance flash cartridges: These devices are commonly used for independently created games, or other third party development.\n* Glucoboy: A blood glucose monitor with built-in games released in Australia in 2007 for children with diabetes.\n* There are also numerous AC adapters that allow the Game Boy Advance to be used without batteries.\n\nRevisions\n\nGame Boy Advance SP\n\nIn early 2003, Nintendo introduced a new form-factor for the handheld, known as the Game Boy Advance SP (model AGS-001).  The redesigned unit resembles a pocket-size laptop computer, including a folding case approximately one-half the size of the original unit.  It also supports a rechargeable lithium ion battery, a significantly brighter LCD screen, and an internal front-light that can be toggled on and off. The redesign was intended to address some common complaints about the original Game Boy Advance, which had been criticized for being somewhat uncomfortable to use, especially due to an overly dark screen.\n\nAround the same time as the release of the Game Boy Micro, Nintendo released a new backlit version of the SP (model AGS-101) in North America (commonly referred to as the \"GBA SP+\", SPII, or SP2). The switch that controls the light now toggles between \"normal\" (which itself is already brighter than the original Game Boy Advance SP's screen), and \"bright\", an intense brightness level similar to an LCD television set.\n\nGame Boy Micro\n\nIn September 2005, Nintendo released a second redesign of the Game Boy Advance. This model, dubbed the Game Boy Micro, is similar in style to the original Game Boy Advance's horizontal orientation, but is much smaller and sleeker. The Game Boy Micro also allows the user to switch between several colored faceplates to allow customization, a feature which Nintendo advertised heavily around the Game Boy Micro's launch. Nintendo also hoped that this \"fashion\" feature would help target audiences outside of typical video game players. Unlike the previous Game Boy Advance models, Game Boy Micro is unable to support Game Boy and Game Boy Color titles. The Game Boy Micro did not make much of an impact in the video game market as it was overshadowed by Nintendo's other portable, the Nintendo DS.\n\nUnit colors\n\nThe Game Boy Advance, SP, and Micro had numerous colors and limited editions.\n\nGame Boy Advance\n\nThe Game Boy Advance was initially available in Arctic, Black, Orange, Fuchsia, Glacier (translucent blue/purple) and Indigo. Later in the system's availability, additional colours and special editions were released. These editions include: Red, Clear Orange/Black, Platinum, White, Gold, Hello Kitty edition (pink with Hello Kitty and logo on bezel), King of Fighters edition (black with images on bezel and buttons), Chobits edition (translucent light blue, with images on bezel and buttons), Battle Network Rockman EXE 2 (light blue with images on bezel), Mario Bros. edition (Glacier with Mario and Luigi on bezel) and Yumiuri Giant edition (Glacier with images on bezel).\n\nA number of Pokémon-themed limited-edition systems were made available in Pokémon Center stores in Japan. These editions include: Gold Pokémon edition (Gold with Pikachu and Pichu on bezel), Suicune edition (blue/grey with greyscale Pikachu and Pichu on bezel, and a Pokémon Center sticker on the back), Celebi edition (olive green with Celebi images on bezel), and Latias/Latios edition (pink/red and purple, with images of Latias and Latios on bezel).\n\nGame Boy Advance SP\n\n* Blue Kyogre\n* Cobalt Blue\n* Flame Red\n* Famicom 20th Anniversary Edition\n* Gold with Zelda Triforce\n* Graphite\n* Green Rayquaza\n* Green Venusaur\n* Kingdom Silver (Kingdom Hearts: Chain of Memories Edition)\n* Spice & Lime\n* Mario\n* NES Black (UK and US only as a limited edition)\n* Onyx Black\n* Pearl Blue\n* Pearl Green\n* Pearl Pink\n* Pearl White (Limited Edition)\n* Pikachu Yellow\n* Platinum\n* Red Groudon\n* Snow White\n* SpongeBob\n* Torchic Orange\n* Tribal\n* White Rip Curl special edition (Australia only)\n* \"Who Are You?\" (Black with \"Who Are You?\" printed on the top)\n* All Blacks (New Zealand only)\n* Surf Blue (UK only)\n\nGame Boy Micro\n\n* Black (included silver, green camo, and fire faceplates)\n* Silver (included black, flower, and blue energy faceplates)\n* Green (Europe only)\n* Blue (Europe and Japan only)\n* Pink (Europe only)\n* Red (Australia only)\n* Lavender (Japan only)\n* Famicom 20th Anniversary Edition\n* Final Fantasy IV\n* Lite Blue (Japan only)\n* Mother 3 (Red)\n\nReception\n\nUpon its North American release, IGN praised the Game Boy Advance's graphical capabilities and battery life, but criticized the system's shoulder button placement and noted the system's high price tag which \"may be a tad bit too high to swallow,\" ultimately scoring the system with in \"8.0\" out of 10. They also pointed out the system's lack of a backlight which occasionally got in the way of playing games.\nABC News praised the Game Boy Advance's graphics, grip and larger screen, stating that \"You've never had as much fun playing old games.\"\n\nReviewing for CNET, Darren Gladstone scored the system with a 7.0 out of 10, praising its graphical performance and backwards compatibility but being considerably critical of the system's lack of a backlit screen, noting that it makes it \"nearly impossible\" to play in normal lighting conditions. Gladstone ultimately suggested the sleeker and backlit Game Boy Advance SP over the system despite noting that its cheaper price may \"appeal to gamers on a lower budget.\"\n\nSales\n\nNintendo hoped to move 1.1 million Game Boy Advance units by the end of March with the system's Japanese debut, and anticipated sales of 24 million units before the end of 2001; many marketing analysts believed for this to be a realistic goal due to the company's lack of major competition in the handheld video game market. Within the first week of its North American launch in June, the Game Boy Advance sold 500,000 units, making it the fastest-selling video game console in the United States at the time. In response to strong sales, Nintendo ordered 100,000 units to ship to retail stores, hoping to ship another half million of them by the end of June. The game also became the fastest-selling system in the United Kingdom, selling 81,000 units in its first week of release and beating the Playstation 2’s previous record of 20,000 units. In 2004, the system’s sales in the United Kingdom surpassed one million units.\n\nOn December 1, 2006, Nintendo of America released launch-to-date information indicating that the company had sold 33.6 million units of the  Game Boy Advance series in the United States. In a Kotaku article published on January 18, 2008, Nintendo revealed that the Game Boy Advance series has sold 36.2 million units in the United States, as of January 1, 2008. As of December 31, 2009, the Game Boy Advance series has sold 81.51 million units worldwide, 43.57 million of which are Game Boy Advance SP units and 2.42 million of which are Game Boy Micro units.\n\nAfter the Game Boy Advance's support lessened, the most popular software became mostly games oriented to younger gamers.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Game Boy Advance" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12430" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Game Boy Advance (GBA) is a 32-bit handheld video game console developed, manufactured and marketed by Nintendo as the successor to the Game Boy Color. It was released in Japan on March 21, 2001, in North America on June 11, 2001, in Australia and Europe on June 22, 2001, and in mainland China on June 8, 2004 (as iQue Game Boy Advance). Nintendo's competitors in the handheld market at the time were the Neo Geo Pocket Color, WonderSwan, GP32, Tapwave Zodiac, and the N-Gage. Despite the competitors' best efforts, Nintendo maintained a majority market share with the Game Boy Advance.\n\nAs of June 30, 2010, the Game Boy Advance series has sold 81.51 million units worldwide. Its successor, the Nintendo DS, was released in November 2004 and is also compatible with Game Boy Advance software.\n\nHistory\n\nContrary to the previous Game Boy models, which were all following the \"portrait\" form factor of the original Game Boy (designed by Gunpei Yokoi), the Game Boy Advance was designed in a \"landscape\" form factor, putting the buttons to the sides of the device instead of below the screen. The Game Boy Advance was designed by the French designer Gwénaël Nicolas and his Tokyo-based design studio Curiosity Inc.[http://curiosity.jp/works/en/product/gameboy-advance.html Gameboy Advance | WORKS - CURIOSITY - キュリオシティ - ]. Retrieved December 21, 2015.\n\nProject Atlantis\n\nIn 1996, magazines including Electronic Gaming Monthly, Next Generation, issues 53 and 54 of Total! and the July 1996 issue of Game Informer featured reports of a new Game Boy, codenamed Project Atlantis. Although Nintendo's expectations of releasing the system in at least one territory by the end of 1996 would make that machine seem to be the Game Boy Color, it was described as having a 32-bit RISC processor, a 3-by-2-inch color LCD screen, and a link port—a description that more closely matches the Game Boy Advance. It also may have referred to the unnamed, unreleased Game Boy Color successor prototype that was revealed at 2009's Game Developers Conference.[http://www.joystiq.com/2009/03/25/gdc09-dsi-architect-reveals-unreleased-nintendo-handhelds/#continued GDC 2009 Nintendo Reveals Unreleased Nintendo Handhelds]. Retrieved March 25, 2009. It was announced that Nintendo of Japan was working on a game for the system called \"Mario's Castle\".\n\nTechnical specifications\n\nThe technical specificationshttp://www.cs.rit.edu/~tjh8300/CowBite/CowBiteSpec.htm#Text Backgrounds of the original Game Boy Advance are, as provided by Nintendo:\n\nBackward compatibility for Game Boy and Game Boy Color games is provided by a custom 4.194/8.388 MHz Z80-based coprocessor (Game Boy Advance software can use the audio tone generators to supplement the primary sound system), while a link port at the top of the unit allows it to be connected to other devices using a Game Link cable or GameCube link cable. When playing Game Boy or Game Boy Color games on the Game Boy Advance, the L and R buttons can be used to toggle between a stretched widescreen format  and the original screen ratio of the Game Boy . Game Boy games can be played using the same selectable color palettes as on the Game Boy Color.\nEvery Nintendo handheld system following the release of the Game Boy Advance SP has included a built-in light and rechargeable battery.\n\nThe Game Boy Advance and Nintendo DS 2D graphics hardware have scaling and rotation for traditional tiled backgrounds in its modes 1 and 2 and scaling and rotation for bitmaps in modes 3 through 5 (used less often on the GBA because of technical limitations). On each machine supporting this effect, it is possible to change the scaling and rotation values during the horizontal blanking period of each scanline to draw a flat plane in a perspective projection. More complex effects such as fuzz are possible by using other equations for the position, scaling, and rotation of each line. The \"character mode\" supports up to 4 tile map background layers per frame, with each tile being 8x8 pixels in size and having 16 or 256 colors. The \"character mode\" also supports up to 128 hardware sprites per frame, with any sprite size from 8x8 to 64x64 pixels and with 16 or 256 colors per sprite.\n\nGames\n\n \n\nWith hardware comparable to the Super NES, the Game Boy Advance represents progress for sprite-based technology. The Game Boy Advance has platformers, SNES-style role-playing video games, and classic games ported from various 8-bit and 16-bit systems of the previous generations.  This includes the Super Mario Advance series, as well as the system's backward compatibility with all earlier Game Boy titles.\n\nFinal Fantasy VI Advance was the final licensed Japanese GBA game release.  Released November 2006, it was the final Nintendo-published game for the system.  The Legend of Spyro: The Eternal Night was the final European GBA game, released November 2007. Samurai Deeper Kyo was the final North American GBA game, released in February 2008. The last Nintendo-developed game released for the system was the Japan-only rhythm game Rhythm Tengoku, which later went on to form the popular Rhythm Heaven series.\n\nCompatibility with other systems\n\nAn accessory for the GameCube, known as the Game Boy Player, was released in 2003 as the successor to the Super Game Boy peripheral for the Super Nintendo Entertainment System. The accessory allows Game Boy Advance games, as well as Game Boy and Game Boy Color games, to be played on the GameCube. However, some games may have compatibility issues due to certain features (for example, games with built-in motion sensors would require players to manipulate the console itself).\n\nGame Boy Advance games are compatible with the Nintendo DS and Nintendo DS Lite handheld consoles, which feature a cartridge slot at the bottom. They are not, however, compatible with the Nintendo DSi, as it does not feature a cartridge slot.\n\nVirtual Console\n\nAs part of an Ambassador Program for early adopters of the Nintendo 3DS system, ten Game Boy Advance games were made available free for players who bought a system before August 2011. Unlike other Virtual Console games for the system, players were not able to use features such as the Home menu or save states. 3DS systems that have custom firmware installed can also install the ten available games available to Ambassador Program members. Many other Game Boy Advance games can also be played via custom firmware by injecting a difference game into one of the officially released Game Boy Advance games, including Game Boy Advance games not available on the Wii U Virtual console. Satoru Iwata stated Game Boy Advance games will be available on the Wii U Virtual Console sometime during April 2014. On April 3, 2014, the first of the announced GBA games (Advance Wars, Metroid Fusion and Mario & Luigi: Superstar Saga) were released for the Wii U Virtual Console. A full Virtual Console service for Game Boy Advance games was launched for the Wii U console. All of the Virtual Console releases are single player only, as they do not emulate multiplayer features enabled by Game Link cables.\n\nAccessories\n\nOfficial\n\nNintendo released many addons for the Game Boy Advance. These include:\n* Wireless Adapter: Released in 2004, this adapter hooks up to the back of the Game Boy Advance. It replaces link cables and allows many people to link together. It marketed for US$20 and came included with Pokémon FireRed and LeafGreen. Because it was released so late in the Game Boy Advance's life, fewer than 20 games support this hardware. The adapter's usefulness is most evident in Pokémon, as FireRed/LeafGreen and Emerald feature a \"Union Room\" where up to forty people can enter to battle or trade Pokémon. A Game Boy Micro version has also been released; it can interact fully with both models of the Wireless Adapter.\n* Game Boy Advance Infra-Red Adapter: This adapter was included with the game Cyberdrive Zoids, as it is only compatible with this game and the latest GBA Pokémon games. The adapter was not sold separately. This is also currently the only Game Boy Advance accessory that has not been remade for the Game Boy Micro.\n* Nintendo GameCube – Game Boy Advance link cable: The link cable is used to connect the Game Boy Advance to the GameCube gaming console. It is intended for interoperability between games for the Game Boy and corresponding games for the GameCube. There were not many games that supported the hardware; notable titles are Final Fantasy Crystal Chronicles and The Legend of Zelda: Four Swords Adventures, allowing up to 4 players to use their Advance or SP handheld as a controller that has additional information on the screen, as well as The Legend of Zelda: The Wind Waker, allowing additional content to be unlocked through Tingle, one of the characters in the game. When using the cable in the game \"Animal Crossing\", players would be greeted by the in game character Kapp'n at the dock who would transport them to a previously inaccessible island. The device works for Pokémon Colosseum and Pokémon XD which lets you trade Pokémon back and forth to its GBA iterations (Pokémon FireRed, LeafGreen, Ruby, Sapphire, and Emerald). In addition, it can be used to transfer Chao between Sonic Adventure 2, Sonic Adventure DX and Sonic Advance, Sonic Advance 2. Finally, it can be used to unlock the \"Fusion\" skin for Samus (that was introduced in Metroid Fusion) for use in Metroid Prime, provided that the player has also met certain conditions in both Fusion and Prime.\n* Play-Yan: The Play-Yan is an MP3/MPEG4 player for the Game Boy Advance and Nintendo DS. The cartridge is slightly broader than a normal Game Boy Advance cartridge and includes a built-in headphone port as well as an SD Card slot. Music or videos that users have downloaded from the Internet can be transferred onto an SD Card and slotted into the Play-Yan device. Nintendo has released several mini games for the Play-Yan that can be downloaded from their website, although Nintendo later removed all minigame functionality through a firmware update. The Play-Yan was initially available in Japan only, but was released in Europe as the Nintendo MP3 Player on December 8, 2006, with the MPEG4 functionality removed. The Play-Yan was never released in North America.\n* e-Reader: The e-Reader is a scanning device that plugs into the game cartridge slot of the Game Boy Advance. Specialized cards with codes along the side and bottom are slid through the slot, scanning the card into the Game Boy Advance. Many ideas for the e-Reader include cards that scan classic games like Donkey Kong and Excitebike onto the handheld ready to play, as well as a collaboration with Super Mario Advance 4 and Pokémon Ruby and Sapphire to have cards that unlock content. GameCube games like Animal Crossing have cards with unlockable content as well, and the Pokémon Trading Card Game playing cards also adopt the e-Reader codes. The e-Reader works with the Game Boy Player and Game Boy Advance SP, but cannot fit into the Nintendo DS's Game Boy slot (however it can fit into the Nintendo DS Lite's Game Boy slot). Though it failed to catch on in the US, it proved to be very popular in Japan. It was not released in Europe.\n* Game Boy Advance Video: These cartridges contain two episodes of thirty-minute cartoon programs. First released in North America in May 2004, these cartridges included cartoons such as Dragon Ball GT, Pokémon, SpongeBob SquarePants, Sonic X, Teenage Mutant Ninja Turtles, and Yu-Gi-Oh!. The movies Shrek, Shrek 2, and Shark Tale are also available for Game Boy Advance Video and all three movies are full. Due to the Game Boy Advance screen ratio, the three movies are in their widescreen format. These cartridges display an error when inserted into a GameCube via a Game Boy Player. The Game Boy Advance Videos are no longer available at most major retailers.\n* Cleaning cartridge: A white cartridge that has a soft cloth inside so that it cleans the connectors of the Game Boy Advance when inserted. It can also be used to clean Slot 2 of the Nintendo DS or DS Lite.\n* Mobile Adapter: The device works with Game Boy and Game Boy Advance systems to connect to mobile phones for remote play. It was released in Japan and was compatible with Pokémon Crystal.\n\nUnofficial\n\nOther accessories for the Game Boy Advance are:\n* Afterburner: The Afterburner was an internal front-lighting system manufactured by Triton Labs and released in mid-2002. The installation consisted of disassembling the system, removing some plastic from the interior of the case, attaching the lighting mechanism to the screen, and soldering two wires to the motherboard for power. Optionally, a potentiometer or an integrated circuit could be added to allow adjusting the brightness of the light. When the initial version of the Game Boy Advance SP was released, it included a very similar integrated lighting system.  This was replaced in the subsequent version of the Game Boy Advance SP with a backlit display. According to Triton Labs, the Afterburner achieved considerable success during the lifespan of the GBA, with many gamers buying it despite the kit technically voiding the system’s warranty, and the company had minor trouble keeping up with demand for the accessory during the 2002 holiday season.\n* Halo Light: The Halo light was an external front-lighting system that replaced the screen protector/lens of the GBA. The Halo had an external power adapter that connected to the link port, it featured on/off functions with a dimmer and a pass-through connector so other devices could be connected to the link port.\n* Worm Light: The Worm Light was an adjustable and flexible light that connected to the link port. It had a small bulb which shone over the screen.\n* GBA Movie Player: The GBA Movie Player is a versatile gaming cartridge that allows users to play NES/Famicom games, watch movies, read .txt files, listen to sound clips, etc. The GBA Movie Player does not actually play MPEGS or MP3s directly, a freeware conversion software is needed, that converts an array of formats into GBM and GBS formats that are compatible with the GBA Movie Player. There are two forms of the GBA Movie Player with one using a CF (Compact Flash) card and one using an SD (Secure Digital) card, though different companies have made their own devices similar to the GBA Movie Player.\n* GBA TV Tuner: It makes the portable system into a portable television. There are several versions available, which are made by different companies. The most popular TV Tuner requires a cartridge inserted in the Tuner to start up. The TV Tuners can store up to 99 channels.\n* GameShark: The Game Boy Advance version of the GameShark, programmed only to work with Game Boy Advance games as making the device take Game Boy Color cartridges too would have made it expensive. This cheat device allowed users to change the code in their games to create cheats. Codes could be entered by hand or uploaded to the device itself with the provided USB cable and software.\n* Action Replay: A cheating device like the GameShark, the Action Replay was sold mainly in Europe. It has a few extra features as well as an updated interface.\n* Action Replay MAX Duo: This was an update to the Action Replay for Game Boy Advance. Not only did it function as an Action Replay, but for DS users, it could hold premade game saves or \"powersaves\" that could be downloaded from the Action Replay site as well as user made saves. It did not, however, function as a cheat device for Nintendo DS games; it was only for data backup.\n* Worm Cam: This device by Nyko attached to the top of the Game Boy Advance and connected into the link port of the GBA. This device functioned as a digital camera which allowed digital pictures to be taken. The snapshots could then be uploaded to a PC with the USB cable and software provided. This camera's strange shape prevented it from being used with the GBA SP.\n* DigiCam SP: This camera attachment was also made by Nyko and was essentially the Worm Cam for the Game Boy Advance SP. This add-on would slide on to the top half of the GBA SP (behind the screen) and a small plug would be connected into the link port.\n* DataBoy: This cartridge plugs into the GBA game slot and converts the Game Boy into an RS-232 data scope (also known as serial line monitor or protocol analyzer). Users can play GB games, GBC games, and GBA games on it.\n* Game Boy Advance flash cartridges: These devices are commonly used for independently created games, or other third party development.\n* Glucoboy: A blood glucose monitor with built-in games released in Australia in 2007 for children with diabetes.\n* There are also numerous AC adapters that allow the Game Boy Advance to be used without batteries.\n\nRevisions\n\nGame Boy Advance SP\n\nIn early 2003, Nintendo introduced a new form-factor for the handheld, known as the Game Boy Advance SP (model AGS-001).  The redesigned unit resembles a pocket-size laptop computer, including a folding case approximately one-half the size of the original unit.  It also supports a rechargeable lithium ion battery, a significantly brighter LCD screen, and an internal front-light that can be toggled on and off. The redesign was intended to address some common complaints about the original Game Boy Advance, which had been criticized for being somewhat uncomfortable to use, especially due to an overly dark screen.\n\nAround the same time as the release of the Game Boy Micro, Nintendo released a new backlit version of the SP (model AGS-101) in North America (commonly referred to as the \"GBA SP+\", SPII, or SP2). The switch that controls the light now toggles between \"normal\" (which itself is already brighter than the original Game Boy Advance SP's screen), and \"bright\", an intense brightness level similar to an LCD television set.\n\nGame Boy Micro\n\nIn September 2005, Nintendo released a second redesign of the Game Boy Advance. This model, dubbed the Game Boy Micro, is similar in style to the original Game Boy Advance's horizontal orientation, but is much smaller and sleeker. The Game Boy Micro also allows the user to switch between several colored faceplates to allow customization, a feature which Nintendo advertised heavily around the Game Boy Micro's launch. Nintendo also hoped that this \"fashion\" feature would help target audiences outside of typical video game players. Unlike the previous Game Boy Advance models, Game Boy Micro is unable to support Game Boy and Game Boy Color titles. The Game Boy Micro did not make much of an impact in the video game market as it was overshadowed by Nintendo's other portable, the Nintendo DS.\n\nUnit colors\n\nThe Game Boy Advance, SP, and Micro had numerous colors and limited editions.\n\nGame Boy Advance\n\nThe Game Boy Advance was initially available in Arctic, Black, Orange, Fuchsia, Glacier (translucent blue/purple) and Indigo. Later in the system's availability, additional colours and special editions were released. These editions include: Red, Clear Orange/Black, Platinum, White, Gold, Hello Kitty edition (pink with Hello Kitty and logo on bezel), King of Fighters edition (black with images on bezel and buttons), Chobits edition (translucent light blue, with images on bezel and buttons), Battle Network Rockman EXE 2 (light blue with images on bezel), Mario Bros. edition (Glacier with Mario and Luigi on bezel) and Yumiuri Giant edition (Glacier with images on bezel).\n\nA number of Pokémon-themed limited-edition systems were made available in Pokémon Center stores in Japan. These editions include: Gold Pokémon edition (Gold with Pikachu and Pichu on bezel), Suicune edition (blue/grey with greyscale Pikachu and Pichu on bezel, and a Pokémon Center sticker on the back), Celebi edition (olive green with Celebi images on bezel), and Latias/Latios edition (pink/red and purple, with images of Latias and Latios on bezel).\n\nGame Boy Advance SP\n\n* Blue Kyogre\n* Cobalt Blue\n* Flame Red\n* Famicom 20th Anniversary Edition\n* Gold with Zelda Triforce\n* Graphite\n* Green Rayquaza\n* Green Venusaur\n* Kingdom Silver (Kingdom Hearts: Chain of Memories Edition)\n* Spice & Lime\n* Mario\n* NES Black (UK and US only as a limited edition)\n* Onyx Black\n* Pearl Blue\n* Pearl Green\n* Pearl Pink\n* Pearl White (Limited Edition)\n* Pikachu Yellow\n* Platinum\n* Red Groudon\n* Snow White\n* SpongeBob\n* Torchic Orange\n* Tribal\n* White Rip Curl special edition (Australia only)\n* \"Who Are You?\" (Black with \"Who Are You?\" printed on the top)\n* All Blacks (New Zealand only)\n* Surf Blue (UK only)\n\nGame Boy Micro\n\n* Black (included silver, green camo, and fire faceplates)\n* Silver (included black, flower, and blue energy faceplates)\n* Green (Europe only)\n* Blue (Europe and Japan only)\n* Pink (Europe only)\n* Red (Australia only)\n* Lavender (Japan only)\n* Famicom 20th Anniversary Edition\n* Final Fantasy IV\n* Lite Blue (Japan only)\n* Mother 3 (Red)\n\nReception\n\nUpon its North American release, IGN praised the Game Boy Advance's graphical capabilities and battery life, but criticized the system's shoulder button placement and noted the system's high price tag which \"may be a tad bit too high to swallow,\" ultimately scoring the system with in \"8.0\" out of 10. They also pointed out the system's lack of a backlight which occasionally got in the way of playing games.\nABC News praised the Game Boy Advance's graphics, grip and larger screen, stating that \"You've never had as much fun playing old games.\"\n\nReviewing for CNET, Darren Gladstone scored the system with a 7.0 out of 10, praising its graphical performance and backwards compatibility but being considerably critical of the system's lack of a backlit screen, noting that it makes it \"nearly impossible\" to play in normal lighting conditions. Gladstone ultimately suggested the sleeker and backlit Game Boy Advance SP over the system despite noting that its cheaper price may \"appeal to gamers on a lower budget.\"\n\nSales\n\nNintendo hoped to move 1.1 million Game Boy Advance units by the end of March with the system's Japanese debut, and anticipated sales of 24 million units before the end of 2001; many marketing analysts believed for this to be a realistic goal due to the company's lack of major competition in the handheld video game market. Within the first week of its North American launch in June, the Game Boy Advance sold 500,000 units, making it the fastest-selling video game console in the United States at the time. In response to strong sales, Nintendo ordered 100,000 units to ship to retail stores, hoping to ship another half million of them by the end of June. The game also became the fastest-selling system in the United Kingdom, selling 81,000 units in its first week of release and beating the Playstation 2’s previous record of 20,000 units. In 2004, the system’s sales in the United Kingdom surpassed one million units.\n\nOn December 1, 2006, Nintendo of America released launch-to-date information indicating that the company had sold 33.6 million units of the  Game Boy Advance series in the United States. In a Kotaku article published on January 18, 2008, Nintendo revealed that the Game Boy Advance series has sold 36.2 million units in the United States, as of January 1, 2008. As of December 31, 2009, the Game Boy Advance series has sold 81.51 million units worldwide, 43.57 million of which are Game Boy Advance SP units and 2.42 million of which are Game Boy Micro units.\n\nAfter the Game Boy Advance's support lessened, the most popular software became mostly games oriented to younger gamers.\n\nNotes. Game Boy Advance. http://en.wikipedia.org/?curid=12430."
  }
}
