{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13787",
  "eid" : "0d4126b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778531483,
  "textBody" : "The Hermetic Order of the Golden Dawn (; or, more commonly, the Golden Dawn (Aurora Aurea)) was an organization devoted to the study and practice of the occult, metaphysics, and paranormal activities during the late 19th and early 20th centuries. Known as a magical order, the Hermetic Order of the Golden Dawn was active in Great Britain and focused its practices on theurgy and spiritual development.  Many present-day concepts of ritual and magic that are at the centre of contemporary traditions, such as WiccaColquhoun, Ithell (1975) The Sword of Wisdom: MacGregor Mathers & the Golden Dawn. New York: G.P. Putnam's Sons.Phillips, Julia (1991) [http://www.geraldgardner.com/History_of_Wicca_Revised.pdf History of Wicca in England: 1939 - present day].  Lecture at the Wiccan Conference in Canberra, 1991. and Thelema, were inspired by the Golden Dawn, which became one of the largest single influences on 20th-century Western occultism.Jenkins, Phillip (2000) Mystics and Messiahs: Cults and New Religions in American History, pg. 74. \"Also in the 1880s, the tradition of ritual magic was revived in London by a group of Masonic adepts, who formed the Order of the Golden Dawn, which would prove an incalculable influence on the whole subsequent history of occultism.\" USA: Oxford University Press.Smoley, Richard (1999) Hidden Wisdom: A Guide to the Western Inner Traditions, ppg 102-103. \"Founded in 1888, the Golden Dawn lasted a mere twelve years before it was shattered by personal conflicts. At its height it probably had no more than a hundred members. Yet its influence on magic and esoteric thought in the English-speaking world would be hard to overestimate.\" USA: Quest Books.\n\nThe three founders, William Robert Woodman, William Wynn Westcott, and Samuel Liddell Mathers, were Freemasons. Westcott appears to have been the initial driving force behind the establishment of the Golden Dawn.\n\nThe Golden Dawn system was based on hierarchy and initiation like the Masonic Lodges; however women were admitted on an equal basis with men.  The \"Golden Dawn\" was the first of three Orders, although all three are often collectively referred to as the \"Golden Dawn\".  The First Order taught esoteric philosophy based on the Hermetic Qabalah and personal development through study and awareness of the four Classical Elements as well as the basics of astrology, tarot divination, and geomancy.  The Second or \"Inner\" Order, the Rosae Rubeae et Aureae Crucis (the Ruby Rose and Cross of Gold), taught magic, including scrying, astral travel, and alchemy.  The Third Order was that of the \"Secret Chiefs\", who were said to be highly skilled; they supposedly directed the activities of the lower two orders by spirit communication with the Chiefs of the Second Order.\n\nHistory\n\nCipher Manuscripts\n\nThe foundational documents of the original Order of the Golden Dawn, known as the Cipher Manuscripts, are written in English using the Trithemius cipher.  The manuscripts give the specific outlines of the Grade Rituals of the Order and prescribe a curriculum of graduated teachings that encompass the Hermetic Qabalah, astrology, occult tarot, geomancy, and alchemy.\n\nAccording to the records of the Order, the manuscripts passed from Kenneth R. H. Mackenzie, a Masonic scholar, to the Rev. A. F. A. Woodford, whom British occult writer Francis King describes as the fourth founder\nKing, 1989, page 42-43 (although Woodford died shortly after the Order was founded).King, 1989, page 47  The documents did not excite Woodford, and in February 1886 he passed them on to Freemason William Wynn Westcott, who managed to decode them in 1887. Westcott, pleased with his discovery, called on fellow Freemason Samuel Liddell MacGregor Mathers  for a second opinion. Westcott asked for Mathers' help to turn the manuscripts into a coherent system for lodge work. Mathers in turn asked fellow Freemason William Robert Woodman to assist the two, and he accepted. Mathers and Westcott have been credited with developing the ritual outlines in the Cipher Manuscripts into a workable format.\nGolden Dawn researcher R. A. Gilbert has found evidence which suggests that Westcott was instrumental in developing the Order's rituals from the Cipher Manuscripts. See Gilbert's article, From Cipher to Enigma: The Role of William Wynn Westcott in the Creation of the Hermetic Order of the Golden Dawn, from Carroll Runyon's book Secrets of the Golden Dawn Cypher Manuscripts.\n Mathers, however, is generally credited with the design of the curriculum and rituals of the Second Order, which he called the Rosae Rubae et Aureae Crucis (\"Ruby Rose and Golden Cross\" or the RR et AC).Regardie, 1993, page 92\n\nFounding of first temple\n\nIn October 1887, Westcott claimed to have written to a German countess and prominent Rosicrucian named Anna Sprengel, whose address was said to have been found in the decoded Cipher Manuscripts. According to Westcott, Sprengel claimed the ability to contact certain supernatural entities, known as the Secret Chiefs, that were considered the authorities over any magical order or esoteric organization. Westcott purportedly received a reply from Sprengel granting permission to establish a Golden Dawn temple and conferring honorary grades of Adeptus Exemptus on Westcott, Mathers, and Woodman.  The temple was to consist of the five grades outlined in the manuscripts.King, 1989, page 43Regardie, 1993, page 11.\n\nIn 1888, the Isis-Urania Temple was founded in London.  In contrast to the S.R.I.A. and Masonry, women were allowed and welcome to participate in the Order in \"perfect equality\" with men. The Order was more of a philosophical and metaphysical teaching order in its early years.  Other than certain rituals and meditations found in the Cipher manuscripts and developed further,King, 1997, page 35 \"magical practices\" were generally not taught at the first temple.\n\nFor the first four years, the Golden Dawn was one cohesive group later known as \"the Outer Order\" or \"First Order.\" An \"Inner Order\" was established and became active in 1892.  The Inner Order consisted of members known as \"adepts,\" who had completed the entire course of study for the Outer Order. This group of adepts eventually became known as the Second Order.\n\nEventually, the Osiris temple in Weston-super-Mare, the Horus temple in Bradford (both in 1888), and the Amen-Ra temple in Edinburgh (1893) were founded. In 1893 Mathers founded the Ahathoor temple in Paris.\n\nSecret Chiefs\n\nIn 1891, Westcott's alleged correspondence with Anna Sprengel suddenly ceased.  He claimed to have received word from Germany that she was either dead or that her companions did not approve of the founding of the Order and no further contact was to be made. If the founders were to contact the Secret Chiefs, apparently, it had to be done on their own. In 1892, Mathers professed that a link to the Secret Chiefs had been established.  Subsequently, he supplied rituals for the Second Order, calling them the Red Rose and Cross of Gold. The rituals were based on the tradition of the tomb of Christian Rosenkreuz, and a Vault of Adepts became the controlling force behind the Outer Order.King, 1989, page 44 Later in 1916, Westcott claimed that Mathers also constructed these rituals from materials he received from Frater Lux ex Tenebris, a purported Continental Adept.King, 1989, page 46\n\nSome followers of the Golden Dawn tradition believe that the Secret Chiefs were not human or supernatural beings but, rather, symbolic representations of actual or legendary sources of spiritual esotericism.  The term came to stand for a great leader or teacher of a spiritual path or practice that found its way into the teachings of the Order.Penczak, Christopher. Spirit Allies, p. 27.  Red Wheel/Weiser Books. \n\nGolden Age\n\nBy the mid-1890s, the Golden Dawn was well established in Great Britain, with over one hundred members from every class of Victorian society. Many celebrities belonged to the Golden Dawn, such as the actress Florence Farr, the Irish revolutionary Maud Gonne, the Irish poet William Butler Yeats, the Welsh author Arthur Machen, and the English authors Evelyn Underhill and Aleister Crowley.\n\nIn 1896 or 1897, Westcott broke all ties to the Golden Dawn, leaving Mathers in control. It has been speculated that his departure was due to his having lost a number of occult-related papers in a hansom cab.  Apparently, when the papers were found, Westcott's connection to the Golden Dawn was discovered and brought to the attention of his employers. He may have been told to either resign from the Order or to give up his occupation as coroner.King, 1989, page 48 After Westcott's departure, Mathers appointed Florence Farr to be Chief Adept in Anglia.  Dr. Henry B. Pullen Burry succeeded Westcott as Cancellarius—one of the three Chiefs of the Order.\n\nMathers was the only active founding member after Westcott's departure. Due to personality clashes with other members and frequent absences from the center of Lodge activity in Great Britain, however, challenges to Mathers's authority as leader developed among the members of the Second Order.\n\nRevolt\n\nToward the end of 1899, the Adepts of the Isis-Urania and Amen-Ra temples had become dissatisfied with Mathers' leadership, as well as his growing friendship with Aleister Crowley. They had also become anxious to make contact with the Secret Chiefs themselves, instead of relying on Mathers as an intermediary.King, 1989, page 66 Within the Isis-Urania temple, disputes were arising between Farr's The Sphere, a secret society within the Isis-Urania, and the rest of the Adepti Minores.\n\nCrowley was refused initiation into the Adeptus Minor grade by the London officials. Mathers overrode their decision and quickly initiated him at the Ahathoor temple in Paris on January 16, 1900.King, 1989, page 67 Upon his return to the London temple, Crowley requested from Miss Cracknell, the acting secretary, the papers acknowledging his grade, to which he was now entitled. To the London Adepts, this was the final straw. Farr, already of the opinion that the London temple should be closed, wrote to Mathers expressing her wish to resign as his representative, although she was willing to carry on until a successor was found. Mathers believed  Westcott was behind this turn of events and replied on February 16. On March 3, a committee of seven Adepts was elected in London, and requested a full investigation of the matter. Mathers sent an immediate reply, declining to provide proof, refusing to acknowledge the London temple, and dismissing Farr as his representative on March 23.King, 1989, page 68-69 In response, a general meeting was called on March 29 in London to remove Mathers as chief and expel him from the Order.King, 1989, page 69\n\nSplinters\n\nIn 1901, W. B. Yeats privately published a pamphlet titled Is the Order of R. R. & A. C. to Remain a Magical Order?Melton, J. Gordon, editor, Encyclopedia of Occultism and Parapsychology, v. 2 p. 1327, Gale Group, 2001 \nAfter the Isis-Urania temple claimed its independence, there were even more disputes, leading to Yeats resigning.King, 1989, page 78 A committee of three was to temporarily govern, which included P.W. Bullock, M.W. Blackden and J. W. Brodie-Innes. After a short time, Bullock resigned, and Dr. Robert Felkin took his place.King, 1989, page 94\n\nIn 1903, A. E. Waite and Blackden joined forces to retain the name Isis-Urania, while Felkin and other London members formed the Stella Matutina.  Yeats remained in the Stella Matutina until 1921, while Brodie-Innes continued his Amen-Ra membership in Edinburgh.King, 1989, pages 95-96\n\nReconstruction\n\nOnce Mathers realised that reconciliation was impossible, he made efforts to reestablish himself in London. The Bradford and Weston-super-Mare temples remained loyal to him, but their numbers were few.King, 1989, page 109 He then appointed Edward Berridge as his representative.King, 1989, page 110 According to Francis King, historical evidence shows that there were \"twenty three members of a flourishing Second Order under Berridge-Mathers in 1913.\"\n\nJ.W. Brodie-Innes continued leading the Amen-Ra temple, deciding that the revolt was unjustified. By 1908, Mathers and Brodie-Innes were in complete accord.Regardie, 1993, page 33 According to sources that differ regarding the actual date, sometime between 1901 and 1913 Mathers renamed the branch of the Golden Dawn remaining loyal to his leadership to Alpha et Omega.King, 1971, p. 110-111King, 1989, page 111\"The Golden Dawn ceased to exist by that name after October, 1901, replaced by Mathers' Alpha et Omega and the London group’s Order of the Morgan Rothe. No longer associated with the SRIA after 1902, Mathers continued to oversee a few temples until his death, when his wife, Moina, assumed supervision.\" Samuel Liddel MacGregor Mathers biography, [http://freemasonry.bcy.ca/biography/esoterica/mathers_m/mathers_m.html Grand Lodge of British Columbia and Yukon], February 26, 2001Golden Dawn Time Line, Chic Cicero and Sandra Tabatha Cicero, [http://www.llewellynencyclopedia.com/article/35 Llewellyn Encyclopedia] Brodie-Innes assumed command of the English and Scottish temples, while Mathers concentrated on building up his Ahathoor temple and extending his American connections. According to occultist Israel Regardie, the Golden Dawn had spread to the United States of America before 1900 and a Thoth-Hermes temple had been founded in Chicago. By the beginning of the First World War in 1914, Mathers had established two to three American temples.\n\nMost temples of the Alpha et Omega and Stella Matutina closed or went into abeyance by the end of the 1930s, with the exceptions of two Stella Matutina temples: Hermes Temple in Bristol, which operated sporadically until 1970, and the Smaragdum Thallasses Temple (commonly referred to as  Whare Ra) in Havelock North, New Zealand, which operated regularly until its closure in 1978.Gilbert, R. A. Golden Dawn Companion. Aquarian Press, 1986. Llewellyn Encyclopedia: [http://www.llewellynencyclopedia.com/article/35 \"Golden Dawn Time Line\"]\n\nStructure and grades\n\nMuch of the hierarchical structure for the Golden dawn came from the Societas Rosicruciana in Anglia, which was itself derived from the Order of the Golden and Rosy Cross.[http://freemasonry.bcy.ca/aqc/waite/waite.html The masonic career of A.E. Waite] by Bro. R. A. Gilbert\n\n;First Order:\n* Introduction—Neophyte 0=0\n* Zelator 1=10\n* Theoricus 2=9\n* Practicus 3=8\n* Philosophus 4=7\n* Intermediate—Portal Grade\n\n;Second Order:\n* Adeptus Minor 5=6\n* Adeptus Major 6=5\n* Adeptus Exemptus 7=4\n\n;Third Order:\n* Magister Templi 8=3\n* Magus 9=2\n* Ipsissimus 10=1\n\nThe paired numbers attached to the Grades relate to positions on the Tree of Life. The Neophyte Grade of \"0=0\" indicates no position on the Tree. In the other pairs, the first numeral is the number of steps up from the bottom (Malkuth), and the second numeral is the number of steps down from the top (Kether).\n\nThe First Order Grades were related to the four elements of Earth, Air, Water, and Fire, respectively.  The Aspirant to a Grade received instruction on the metaphysical meaning of each of these Elements and had to pass a written examination and demonstrate certain skills to receive admission to that Grade.\n\nThe Portal Grade was an \"Invisible\" or in-between grade separating the First Order from the Second Order.[http://www.golden-dawn.org/wgd.html Golden Dawn Research Center - What is the Golden Dawn?] The Circle of existing Adepts from the Second Order had to consent to allow an Aspirant to be initiated as an Adept and join the Second Order.\n\nThe Second Order was not, properly, part of the \"Golden Dawn\", but a separate Order in its own right, known as the R.R. et A.C. The Second Order directed the teachings of the First Order and was the governing force behind the First Order.\n\nAfter passing the Portal, the Aspirant was instructed in the techniques of practical magic. When another examination was passed, and the other Adepts consented, the Aspirant attained the Grade of Adeptus Minor (5=6). There were also four sub-Grades of instruction for the Adeptus Minor, again relating to the four Outer Order grades.\n\nA member of the Second Order had the power and authority to initiate aspirants to the First Order, though usually not without the permission of the Chiefs of his or her Lodge.\n\nOrder of angels\n\nAccording to the Golden Dawn's interpretation of the Kabbalah, there are ten archangels, each commanding one of the choirs of angels and corresponding to one of the Sephirot.  It is similar to the Jewish angelic hierarchy.\n\nKnown or alleged members\n\n* Sara Allgood (1879–1950), Irish stage actress and later film actress in America\n* Charles Henry Allan Bennett (1872–1923), best known for introducing Buddhism to the West\n* Arnold Bennett (1867–1931), British novelistRegardie, 1982, page 16\n* Arthur Edward Waite (2 October 1857 – 19 May 1942) Mystic\n* Edward W. Berridge (ca. 1843–1923), British homeopathic physician\n* Algernon Blackwood (1869–1951), English writer and radio broadcaster of supernatural storiesRegardie, 1982, foreword - page ix\n* Anna de Brémont, American-born singer and writer.\n* Dario Carpaneda (1856 - 1916) Italian occultist and esotericism professor at the University of Lausanne.\n* Paul Foster Case was not an original member of the Golden Dawn, but was a member of the successor organization, Alpha et Omega. He was an American occultist\n* Sir Arthur Conan Doyle (1859-1930), author of Sherlock Holmes, doctor, scientist, and spiritualist.http://moreintelligentlife.com/story/conan-doyle-spiritualism\n* Florence Farr (1860–1917), London stage actress and musician\n* Robert Felkin (1853–1925), medical missionary, explorer and anthropologist in Central Africa, author\n* Dion Fortune was not an original member of the Golden Dawn, rather a member of the offshoot Golden Dawn order the Stella Matutina. Dion Fortune Founded the Society of Inner Light.\n* Frederick Leigh Gardner (1857–1930), British stock broker and occultist; published three-volume bibliography Catalogue Raisonné of Works on the Occult Sciences (1912)[http://freemasonry.bcy.ca/biography/esoterica/gardner_f/gardner_f.html \"Frederick Leigh Gardner\"], Biographies: Fringe freemasons, Grand Lodge of British Columbia and Yukon (Freemasons) web site. Retrieved November 2008.\n* Maud Gonne (1866–1953), Irish revolutionary, actress.\n* Annie Horniman (1860–1937), British repertory theatre producer and pioneer; member of the wealthy Horniman family of tea-traders\n* Arthur Machen (1863–1947), leading London writer of the 1890s, author of acclaimed works of imaginative and occult fiction, such as \"The Great God Pan\", \"The White People\" and \"The Hill of Dreams\". Welsh by birth and upbringing.\n* Gustav Meyrink (1868–1932), Austrian author, storyteller, dramatist, translator, banker, and Buddhist\n* E. Nesbit (1858–1924), real name Edith Bland; English author and political activist\n* Israel Regardie was not a member of the original Golden Dawn, but rather of the Stella Matutina, which he claimed was as close to the original order as could be found in the early 1930s (when he was initiated). Regardie wrote many respected and acclaimed books about magic and the Golden Dawn Order, including The Golden Dawn, The Tree Of Life, Middle Pillar, and A Garden of Pomegranates.\n* Sax Rohmer, novelist, creator of the Fu Manchu character\n* Charles Rosher (1885–1974), British cinematographer\n* William Sharp (1855–1905), poet and author; alias Fiona MacLeod\n* Pamela Colman Smith (1878–1951), British-American artist and co-creator of the Rider-Waite Tarot deck\n* Bram Stoker (1847–1912), Irish writer best-known today for his 1897 horror novel Dracula\n* John Todhunter (1839–1916), Aktis Heliou Irish poet and playwright who wrote seven volumes of poetry, and several plays\n* Violet Tweedale (1862–1936), author.\n* Evelyn Underhill (1875–1941), British Christian mystic, author of Mysticism: A Study in Nature and Development of Spiritual Consciousness\n* \n* Charles Williams (1886–1945), British poet, novelist, theologian, and literary critic\n* W. B. Yeats (1865–1939), Irish poet, dramatist, writer and Freemason.\n\nContemporary Golden Dawn orders\n\nWhile no temples in the original chartered lineage of the Golden Dawn survived past the 1970s, several organizations have since revived its teachings and rituals. Among these, the following are notable:\n* The Hermetic Order of the Golden Dawn, Inc.\n* The Open Source Order of the Golden Dawn\n* [http://www.goldendawnfellowship.com/ The Fellowship of the Golden Dawn]\n*[http://ogdu.org/ Golden Dawn Universum]\n* [http://www.rosae-crucis.net Sodalitas Rosae+Crucis et Solis Alati]\n* [http://www.auroradorada.com Orden Hermética de la Aurora Dorada]\n* [http://www.auroradourada.com Ordem Esotérica da Aurora Dourada no Brasil]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hermetic Order of the Golden Dawn" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13787" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Hermetic Order of the Golden Dawn (; or, more commonly, the Golden Dawn (Aurora Aurea)) was an organization devoted to the study and practice of the occult, metaphysics, and paranormal activities during the late 19th and early 20th centuries. Known as a magical order, the Hermetic Order of the Golden Dawn was active in Great Britain and focused its practices on theurgy and spiritual development.  Many present-day concepts of ritual and magic that are at the centre of contemporary traditions, such as WiccaColquhoun, Ithell (1975) The Sword of Wisdom: MacGregor Mathers & the Golden Dawn. New York: G.P. Putnam's Sons.Phillips, Julia (1991) [http://www.geraldgardner.com/History_of_Wicca_Revised.pdf History of Wicca in England: 1939 - present day].  Lecture at the Wiccan Conference in Canberra, 1991. and Thelema, were inspired by the Golden Dawn, which became one of the largest single influences on 20th-century Western occultism.Jenkins, Phillip (2000) Mystics and Messiahs: Cults and New Religions in American History, pg. 74. \"Also in the 1880s, the tradition of ritual magic was revived in London by a group of Masonic adepts, who formed the Order of the Golden Dawn, which would prove an incalculable influence on the whole subsequent history of occultism.\" USA: Oxford University Press.Smoley, Richard (1999) Hidden Wisdom: A Guide to the Western Inner Traditions, ppg 102-103. \"Founded in 1888, the Golden Dawn lasted a mere twelve years before it was shattered by personal conflicts. At its height it probably had no more than a hundred members. Yet its influence on magic and esoteric thought in the English-speaking world would be hard to overestimate.\" USA: Quest Books.\n\nThe three founders, William Robert Woodman, William Wynn Westcott, and Samuel Liddell Mathers, were Freemasons. Westcott appears to have been the initial driving force behind the establishment of the Golden Dawn.\n\nThe Golden Dawn system was based on hierarchy and initiation like the Masonic Lodges; however women were admitted on an equal basis with men.  The \"Golden Dawn\" was the first of three Orders, although all three are often collectively referred to as the \"Golden Dawn\".  The First Order taught esoteric philosophy based on the Hermetic Qabalah and personal development through study and awareness of the four Classical Elements as well as the basics of astrology, tarot divination, and geomancy.  The Second or \"Inner\" Order, the Rosae Rubeae et Aureae Crucis (the Ruby Rose and Cross of Gold), taught magic, including scrying, astral travel, and alchemy.  The Third Order was that of the \"Secret Chiefs\", who were said to be highly skilled; they supposedly directed the activities of the lower two orders by spirit communication with the Chiefs of the Second Order.\n\nHistory\n\nCipher Manuscripts\n\nThe foundational documents of the original Order of the Golden Dawn, known as the Cipher Manuscripts, are written in English using the Trithemius cipher.  The manuscripts give the specific outlines of the Grade Rituals of the Order and prescribe a curriculum of graduated teachings that encompass the Hermetic Qabalah, astrology, occult tarot, geomancy, and alchemy.\n\nAccording to the records of the Order, the manuscripts passed from Kenneth R. H. Mackenzie, a Masonic scholar, to the Rev. A. F. A. Woodford, whom British occult writer Francis King describes as the fourth founder\nKing, 1989, page 42-43 (although Woodford died shortly after the Order was founded).King, 1989, page 47  The documents did not excite Woodford, and in February 1886 he passed them on to Freemason William Wynn Westcott, who managed to decode them in 1887. Westcott, pleased with his discovery, called on fellow Freemason Samuel Liddell MacGregor Mathers  for a second opinion. Westcott asked for Mathers' help to turn the manuscripts into a coherent system for lodge work. Mathers in turn asked fellow Freemason William Robert Woodman to assist the two, and he accepted. Mathers and Westcott have been credited with developing the ritual outlines in the Cipher Manuscripts into a workable format.\nGolden Dawn researcher R. A. Gilbert has found evidence which suggests that Westcott was instrumental in developing the Order's rituals from the Cipher Manuscripts. See Gilbert's article, From Cipher to Enigma: The Role of William Wynn Westcott in the Creation of the Hermetic Order of the Golden Dawn, from Carroll Runyon's book Secrets of the Golden Dawn Cypher Manuscripts.\n Mathers, however, is generally credited with the design of the curriculum and rituals of the Second Order, which he called the Rosae Rubae et Aureae Crucis (\"Ruby Rose and Golden Cross\" or the RR et AC).Regardie, 1993, page 92\n\nFounding of first temple\n\nIn October 1887, Westcott claimed to have written to a German countess and prominent Rosicrucian named Anna Sprengel, whose address was said to have been found in the decoded Cipher Manuscripts. According to Westcott, Sprengel claimed the ability to contact certain supernatural entities, known as the Secret Chiefs, that were considered the authorities over any magical order or esoteric organization. Westcott purportedly received a reply from Sprengel granting permission to establish a Golden Dawn temple and conferring honorary grades of Adeptus Exemptus on Westcott, Mathers, and Woodman.  The temple was to consist of the five grades outlined in the manuscripts.King, 1989, page 43Regardie, 1993, page 11.\n\nIn 1888, the Isis-Urania Temple was founded in London.  In contrast to the S.R.I.A. and Masonry, women were allowed and welcome to participate in the Order in \"perfect equality\" with men. The Order was more of a philosophical and metaphysical teaching order in its early years.  Other than certain rituals and meditations found in the Cipher manuscripts and developed further,King, 1997, page 35 \"magical practices\" were generally not taught at the first temple.\n\nFor the first four years, the Golden Dawn was one cohesive group later known as \"the Outer Order\" or \"First Order.\" An \"Inner Order\" was established and became active in 1892.  The Inner Order consisted of members known as \"adepts,\" who had completed the entire course of study for the Outer Order. This group of adepts eventually became known as the Second Order.\n\nEventually, the Osiris temple in Weston-super-Mare, the Horus temple in Bradford (both in 1888), and the Amen-Ra temple in Edinburgh (1893) were founded. In 1893 Mathers founded the Ahathoor temple in Paris.\n\nSecret Chiefs\n\nIn 1891, Westcott's alleged correspondence with Anna Sprengel suddenly ceased.  He claimed to have received word from Germany that she was either dead or that her companions did not approve of the founding of the Order and no further contact was to be made. If the founders were to contact the Secret Chiefs, apparently, it had to be done on their own. In 1892, Mathers professed that a link to the Secret Chiefs had been established.  Subsequently, he supplied rituals for the Second Order, calling them the Red Rose and Cross of Gold. The rituals were based on the tradition of the tomb of Christian Rosenkreuz, and a Vault of Adepts became the controlling force behind the Outer Order.King, 1989, page 44 Later in 1916, Westcott claimed that Mathers also constructed these rituals from materials he received from Frater Lux ex Tenebris, a purported Continental Adept.King, 1989, page 46\n\nSome followers of the Golden Dawn tradition believe that the Secret Chiefs were not human or supernatural beings but, rather, symbolic representations of actual or legendary sources of spiritual esotericism.  The term came to stand for a great leader or teacher of a spiritual path or practice that found its way into the teachings of the Order.Penczak, Christopher. Spirit Allies, p. 27.  Red Wheel/Weiser Books. \n\nGolden Age\n\nBy the mid-1890s, the Golden Dawn was well established in Great Britain, with over one hundred members from every class of Victorian society. Many celebrities belonged to the Golden Dawn, such as the actress Florence Farr, the Irish revolutionary Maud Gonne, the Irish poet William Butler Yeats, the Welsh author Arthur Machen, and the English authors Evelyn Underhill and Aleister Crowley.\n\nIn 1896 or 1897, Westcott broke all ties to the Golden Dawn, leaving Mathers in control. It has been speculated that his departure was due to his having lost a number of occult-related papers in a hansom cab.  Apparently, when the papers were found, Westcott's connection to the Golden Dawn was discovered and brought to the attention of his employers. He may have been told to either resign from the Order or to give up his occupation as coroner.King, 1989, page 48 After Westcott's departure, Mathers appointed Florence Farr to be Chief Adept in Anglia.  Dr. Henry B. Pullen Burry succeeded Westcott as Cancellarius—one of the three Chiefs of the Order.\n\nMathers was the only active founding member after Westcott's departure. Due to personality clashes with other members and frequent absences from the center of Lodge activity in Great Britain, however, challenges to Mathers's authority as leader developed among the members of the Second Order.\n\nRevolt\n\nToward the end of 1899, the Adepts of the Isis-Urania and Amen-Ra temples had become dissatisfied with Mathers' leadership, as well as his growing friendship with Aleister Crowley. They had also become anxious to make contact with the Secret Chiefs themselves, instead of relying on Mathers as an intermediary.King, 1989, page 66 Within the Isis-Urania temple, disputes were arising between Farr's The Sphere, a secret society within the Isis-Urania, and the rest of the Adepti Minores.\n\nCrowley was refused initiation into the Adeptus Minor grade by the London officials. Mathers overrode their decision and quickly initiated him at the Ahathoor temple in Paris on January 16, 1900.King, 1989, page 67 Upon his return to the London temple, Crowley requested from Miss Cracknell, the acting secretary, the papers acknowledging his grade, to which he was now entitled. To the London Adepts, this was the final straw. Farr, already of the opinion that the London temple should be closed, wrote to Mathers expressing her wish to resign as his representative, although she was willing to carry on until a successor was found. Mathers believed  Westcott was behind this turn of events and replied on February 16. On March 3, a committee of seven Adepts was elected in London, and requested a full investigation of the matter. Mathers sent an immediate reply, declining to provide proof, refusing to acknowledge the London temple, and dismissing Farr as his representative on March 23.King, 1989, page 68-69 In response, a general meeting was called on March 29 in London to remove Mathers as chief and expel him from the Order.King, 1989, page 69\n\nSplinters\n\nIn 1901, W. B. Yeats privately published a pamphlet titled Is the Order of R. R. & A. C. to Remain a Magical Order?Melton, J. Gordon, editor, Encyclopedia of Occultism and Parapsychology, v. 2 p. 1327, Gale Group, 2001 \nAfter the Isis-Urania temple claimed its independence, there were even more disputes, leading to Yeats resigning.King, 1989, page 78 A committee of three was to temporarily govern, which included P.W. Bullock, M.W. Blackden and J. W. Brodie-Innes. After a short time, Bullock resigned, and Dr. Robert Felkin took his place.King, 1989, page 94\n\nIn 1903, A. E. Waite and Blackden joined forces to retain the name Isis-Urania, while Felkin and other London members formed the Stella Matutina.  Yeats remained in the Stella Matutina until 1921, while Brodie-Innes continued his Amen-Ra membership in Edinburgh.King, 1989, pages 95-96\n\nReconstruction\n\nOnce Mathers realised that reconciliation was impossible, he made efforts to reestablish himself in London. The Bradford and Weston-super-Mare temples remained loyal to him, but their numbers were few.King, 1989, page 109 He then appointed Edward Berridge as his representative.King, 1989, page 110 According to Francis King, historical evidence shows that there were \"twenty three members of a flourishing Second Order under Berridge-Mathers in 1913.\"\n\nJ.W. Brodie-Innes continued leading the Amen-Ra temple, deciding that the revolt was unjustified. By 1908, Mathers and Brodie-Innes were in complete accord.Regardie, 1993, page 33 According to sources that differ regarding the actual date, sometime between 1901 and 1913 Mathers renamed the branch of the Golden Dawn remaining loyal to his leadership to Alpha et Omega.King, 1971, p. 110-111King, 1989, page 111\"The Golden Dawn ceased to exist by that name after October, 1901, replaced by Mathers' Alpha et Omega and the London group’s Order of the Morgan Rothe. No longer associated with the SRIA after 1902, Mathers continued to oversee a few temples until his death, when his wife, Moina, assumed supervision.\" Samuel Liddel MacGregor Mathers biography, [http://freemasonry.bcy.ca/biography/esoterica/mathers_m/mathers_m.html Grand Lodge of British Columbia and Yukon], February 26, 2001Golden Dawn Time Line, Chic Cicero and Sandra Tabatha Cicero, [http://www.llewellynencyclopedia.com/article/35 Llewellyn Encyclopedia] Brodie-Innes assumed command of the English and Scottish temples, while Mathers concentrated on building up his Ahathoor temple and extending his American connections. According to occultist Israel Regardie, the Golden Dawn had spread to the United States of America before 1900 and a Thoth-Hermes temple had been founded in Chicago. By the beginning of the First World War in 1914, Mathers had established two to three American temples.\n\nMost temples of the Alpha et Omega and Stella Matutina closed or went into abeyance by the end of the 1930s, with the exceptions of two Stella Matutina temples: Hermes Temple in Bristol, which operated sporadically until 1970, and the Smaragdum Thallasses Temple (commonly referred to as  Whare Ra) in Havelock North, New Zealand, which operated regularly until its closure in 1978.Gilbert, R. A. Golden Dawn Companion. Aquarian Press, 1986. Llewellyn Encyclopedia: [http://www.llewellynencyclopedia.com/article/35 \"Golden Dawn Time Line\"]\n\nStructure and grades\n\nMuch of the hierarchical structure for the Golden dawn came from the Societas Rosicruciana in Anglia, which was itself derived from the Order of the Golden and Rosy Cross.[http://freemasonry.bcy.ca/aqc/waite/waite.html The masonic career of A.E. Waite] by Bro. R. A. Gilbert\n\n;First Order:\n* Introduction—Neophyte 0=0\n* Zelator 1=10\n* Theoricus 2=9\n* Practicus 3=8\n* Philosophus 4=7\n* Intermediate—Portal Grade\n\n;Second Order:\n* Adeptus Minor 5=6\n* Adeptus Major 6=5\n* Adeptus Exemptus 7=4\n\n;Third Order:\n* Magister Templi 8=3\n* Magus 9=2\n* Ipsissimus 10=1\n\nThe paired numbers attached to the Grades relate to positions on the Tree of Life. The Neophyte Grade of \"0=0\" indicates no position on the Tree. In the other pairs, the first numeral is the number of steps up from the bottom (Malkuth), and the second numeral is the number of steps down from the top (Kether).\n\nThe First Order Grades were related to the four elements of Earth, Air, Water, and Fire, respectively.  The Aspirant to a Grade received instruction on the metaphysical meaning of each of these Elements and had to pass a written examination and demonstrate certain skills to receive admission to that Grade.\n\nThe Portal Grade was an \"Invisible\" or in-between grade separating the First Order from the Second Order.[http://www.golden-dawn.org/wgd.html Golden Dawn Research Center - What is the Golden Dawn?] The Circle of existing Adepts from the Second Order had to consent to allow an Aspirant to be initiated as an Adept and join the Second Order.\n\nThe Second Order was not, properly, part of the \"Golden Dawn\", but a separate Order in its own right, known as the R.R. et A.C. The Second Order directed the teachings of the First Order and was the governing force behind the First Order.\n\nAfter passing the Portal, the Aspirant was instructed in the techniques of practical magic. When another examination was passed, and the other Adepts consented, the Aspirant attained the Grade of Adeptus Minor (5=6). There were also four sub-Grades of instruction for the Adeptus Minor, again relating to the four Outer Order grades.\n\nA member of the Second Order had the power and authority to initiate aspirants to the First Order, though usually not without the permission of the Chiefs of his or her Lodge.\n\nOrder of angels\n\nAccording to the Golden Dawn's interpretation of the Kabbalah, there are ten archangels, each commanding one of the choirs of angels and corresponding to one of the Sephirot.  It is similar to the Jewish angelic hierarchy.\n\nKnown or alleged members\n\n* Sara Allgood (1879–1950), Irish stage actress and later film actress in America\n* Charles Henry Allan Bennett (1872–1923), best known for introducing Buddhism to the West\n* Arnold Bennett (1867–1931), British novelistRegardie, 1982, page 16\n* Arthur Edward Waite (2 October 1857 – 19 May 1942) Mystic\n* Edward W. Berridge (ca. 1843–1923), British homeopathic physician\n* Algernon Blackwood (1869–1951), English writer and radio broadcaster of supernatural storiesRegardie, 1982, foreword - page ix\n* Anna de Brémont, American-born singer and writer.\n* Dario Carpaneda (1856 - 1916) Italian occultist and esotericism professor at the University of Lausanne.\n* Paul Foster Case was not an original member of the Golden Dawn, but was a member of the successor organization, Alpha et Omega. He was an American occultist\n* Sir Arthur Conan Doyle (1859-1930), author of Sherlock Holmes, doctor, scientist, and spiritualist.http://moreintelligentlife.com/story/conan-doyle-spiritualism\n* Florence Farr (1860–1917), London stage actress and musician\n* Robert Felkin (1853–1925), medical missionary, explorer and anthropologist in Central Africa, author\n* Dion Fortune was not an original member of the Golden Dawn, rather a member of the offshoot Golden Dawn order the Stella Matutina. Dion Fortune Founded the Society of Inner Light.\n* Frederick Leigh Gardner (1857–1930), British stock broker and occultist; published three-volume bibliography Catalogue Raisonné of Works on the Occult Sciences (1912)[http://freemasonry.bcy.ca/biography/esoterica/gardner_f/gardner_f.html \"Frederick Leigh Gardner\"], Biographies: Fringe freemasons, Grand Lodge of British Columbia and Yukon (Freemasons) web site. Retrieved November 2008.\n* Maud Gonne (1866–1953), Irish revolutionary, actress.\n* Annie Horniman (1860–1937), British repertory theatre producer and pioneer; member of the wealthy Horniman family of tea-traders\n* Arthur Machen (1863–1947), leading London writer of the 1890s, author of acclaimed works of imaginative and occult fiction, such as \"The Great God Pan\", \"The White People\" and \"The Hill of Dreams\". Welsh by birth and upbringing.\n* Gustav Meyrink (1868–1932), Austrian author, storyteller, dramatist, translator, banker, and Buddhist\n* E. Nesbit (1858–1924), real name Edith Bland; English author and political activist\n* Israel Regardie was not a member of the original Golden Dawn, but rather of the Stella Matutina, which he claimed was as close to the original order as could be found in the early 1930s (when he was initiated). Regardie wrote many respected and acclaimed books about magic and the Golden Dawn Order, including The Golden Dawn, The Tree Of Life, Middle Pillar, and A Garden of Pomegranates.\n* Sax Rohmer, novelist, creator of the Fu Manchu character\n* Charles Rosher (1885–1974), British cinematographer\n* William Sharp (1855–1905), poet and author; alias Fiona MacLeod\n* Pamela Colman Smith (1878–1951), British-American artist and co-creator of the Rider-Waite Tarot deck\n* Bram Stoker (1847–1912), Irish writer best-known today for his 1897 horror novel Dracula\n* John Todhunter (1839–1916), Aktis Heliou Irish poet and playwright who wrote seven volumes of poetry, and several plays\n* Violet Tweedale (1862–1936), author.\n* Evelyn Underhill (1875–1941), British Christian mystic, author of Mysticism: A Study in Nature and Development of Spiritual Consciousness\n* \n* Charles Williams (1886–1945), British poet, novelist, theologian, and literary critic\n* W. B. Yeats (1865–1939), Irish poet, dramatist, writer and Freemason.\n\nContemporary Golden Dawn orders\n\nWhile no temples in the original chartered lineage of the Golden Dawn survived past the 1970s, several organizations have since revived its teachings and rituals. Among these, the following are notable:\n* The Hermetic Order of the Golden Dawn, Inc.\n* The Open Source Order of the Golden Dawn\n* [http://www.goldendawnfellowship.com/ The Fellowship of the Golden Dawn]\n*[http://ogdu.org/ Golden Dawn Universum]\n* [http://www.rosae-crucis.net Sodalitas Rosae+Crucis et Solis Alati]\n* [http://www.auroradorada.com Orden Hermética de la Aurora Dorada]\n* [http://www.auroradourada.com Ordem Esotérica da Aurora Dourada no Brasil]. Hermetic Order of the Golden Dawn. http://en.wikipedia.org/?curid=13787."
  }
}
