{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11296",
  "eid" : "faeb6520-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778500722,
  "textBody" : "First aid is the assistance given to any person suffering a sudden illness or injury, with care provided to preserve life, prevent the condition from worsening, or to promote recovery.  It includes initial intervention in a serious condition prior to professional medical help being available, such as performing CPR while awaiting an ambulance, as well as the complete treatment of minor conditions, such as applying a plaster to a cut.  First aid is generally performed by the layperson, with many people trained in providing basic levels of first aid, and others willing to do so from acquired knowledge. Mental health first aid is an extension of the concept of first aid to cover mental  health.\n\nThere are many situations which may require first aid, and many countries have legislation, regulation, or guidance which specifies a minimum level of first aid provision in certain circumstances.  This can include specific training or equipment to be available in the workplace (such as an Automated External Defibrillator), the provision of specialist first aid cover at public gatherings, or mandatory first aid training within schools. First aid, however, does not necessarily require any particular equipment or prior knowledge, and can involve improvisation with materials available at the time, often by untrained persons.\n\nFirst aid can be performed on all mammals, although this article relates to the care of human patients.\n\nHistory \n\nEarly history and warfare\n\nSkills of what is now known as first aid have been recorded throughout history, especially in relation to warfare, where the care of both traumatic and medical cases is required in particularly large numbers. The bandaging of battle wounds is shown on Classical Greek pottery from circa 500 BCE, whilst the parable of the Good Samaritan includes references to binding or dressing wounds.  There are numerous references to first aid performed within the Roman army, with a system of first aid supported by surgeons, field ambulances, and hospitals.  Roman legions had the specific role of capsarii, who were responsible for first aid such as bandaging, and are the forerunners of the modern combat medic.\n\nFurther examples occur through history, still mostly related to battle, with examples such as the Knights Hospitaller in the 11th century CE, providing care to pilgrims and knights in the Holy Land.\n\nFormalization of life saving treatments\n\nDuring the late 18th century, drowning as a cause of death was a major concern amongst the population. In 1767, a society for the preservation of life from accidents in water was started in Amsterdam, and in 1773, physician William Hawes began publicizing the power of artificial respiration as means of resuscitation of those who appeared drowned.  This led to the formation, in 1774, of the Society for the Recovery of Persons Apparently Drowned, later the Royal Humane Society, who did much to promote resuscitation.New Scientist, Vol. 193 No. 2586 (13–19 Jan 2007), p. 50\n\nNapoleon's surgeon, Baron Dominique-Jean Larrey, is credited with creating an ambulance corps (the ambulance volantes), which included medical assistants, tasked to administer first aid in battle.\n\nIn 1859 Jean-Henri Dunant witnessed the aftermath of the Battle of Solferino, and his work led to the formation of the Red Cross, with a key stated aim of \"aid to sick and  wounded soldiers in the field\".  The Red Cross and Red Crescent are still the largest provider of first aid worldwide.\n\nIn 1870, Prussian military surgeon Friedrich von Esmarch introduced formalized first aid to the military, and first coined the term \"erste hilfe\" (translating to 'first aid'), including training for soldiers in the Franco-Prussian War on care for wounded comrades using pre-learnt bandaging and splinting skills, and making use of the Esmarch bandage which he designed.  The bandage was issued as standard to the Prussian combatants, and also included aide-memoire pictures showing common uses.\n\nIn 1872, the Order of Saint John of Jerusalem in England changed its focus from hospice care, and set out to start a system of practical medical help, starting with making a grant towards the establishment of the UK's first ambulance service.  This was followed by creating its own wheeled transport litter in 1875 (the St John Ambulance), and in 1877 established the St John Ambulance Association (the forerunner of modern-day St John Ambulance) \"to train men and women for the benefit of the sick and wounded\".Fletcher NC. The St John Ambulance Association: its history and its past in the ambulance movement. London: St John Ambulance Association, 1929:12–3.\n\nAlso in the UK, Surgeon-Major Peter Shepherd had seen the advantages of von Esmarch's new teaching of first aid, and introduced an equivalent programme for the British Army, and so being the first user of \"first aid for the injured\" in English, disseminating information through a series of lectures.    Following this, in 1878, Shepherd and Colonel Francis Duncan took advantage of the newly charitable focus of St John, and established the concept of teaching first aid skills to civilians.  The first classes were conducted in the hall of the Presbyterian school in Woolwich (near Woolwich barracks where Shepherd was based) using a comprehensive first aid curriculum.\n\nFirst aid training began to spread through the British Empire through organisations such as St John, often starting, as in the UK, with high risk activities such as ports and railways.[http://www.sja.org.uk/history/victorian_britain.asp Industrial Revolution: St. John Ambulance] , retrieved December 10, 2006.\n\nAims\n\nThe key aims of first aid can be summarised in three key points, sometimes known as 'the three P's':-\n* Preserve life: The overriding aim of all medical care which includes first aid, is to save lives and minimize the threat of death.\n* Prevent further harm: Prevent further harm also sometimes called prevent the condition from worsening, or danger of further injury, this covers both external factors, such as moving a patient away from any cause of harm, and applying first aid techniques to prevent worsening of the condition, such as applying pressure to stop a bleed becoming dangerous.\n* Promote recovery: First aid also involves trying to start the recovery process from the illness or injury, and in some cases might involve completing a treatment, such as in the case of applying a plaster to a small wound.\n\nKey skills\n\nCertain skills are considered essential to the provision of first aid and are taught ubiquitously. Particularly the \"ABC\"s of first aid, which focus on critical life-saving intervention, must be rendered before treatment of less serious injuries. ABC stands for Airway, Breathing, and Circulation. The same mnemonic is used by all emergency health professionals. Attention must first be brought to the airway to ensure it is clear. Obstruction (choking) is a life-threatening emergency. Following evaluation of the airway, a first aid attendant would determine adequacy of breathing and provide rescue breathing if necessary. Assessment of circulation is now not usually carried out for patients who are not breathing, with first aiders now trained to go straight to chest compressions (and thus providing artificial circulation) but pulse checks may be done on less serious patients.\n\nSome organizations add a fourth step of \"D\" for Deadly bleeding or Defibrillation, while others consider this as part of the Circulation step. Variations on techniques to evaluate and maintain the ABCs depend on the skill level of the first aider.  Once the ABCs are secured, first aiders can begin additional treatments, as required. Some organizations teach the same order of priority using the \"3Bs\": Breathing, Bleeding, and Bones (or \"4Bs\": Breathing, Bleeding, Burns, and Bones). While the ABCs and 3Bs are taught to be performed sequentially, certain conditions may require the consideration of two steps simultaneously. This includes the provision of both artificial respiration and chest compressions to someone who is not breathing and has no pulse, and the consideration of cervical spine injuries when ensuring an open airway.\n\nPreserving life \n\nIn order to stay alive, all persons need to have an open airway—a clear passage where air can move in through the mouth or nose through the pharynx and down into the lungs, without obstruction. Conscious people will maintain their own airway automatically, but those who are unconscious (with a GCS of less than 8) may be unable to maintain a patent airway, as the part of the brain which automatically controls breathing in normal situations may not be functioning.\n\nIf the patient was breathing, a first aider would normally then place them in the recovery position, with the patient leant over on their side, which also has the effect of clearing the tongue from the pharynx. It also avoids a common cause of death in unconscious patients, which is choking on regurgitated stomach contents.\n\nThe airway can also become blocked through a foreign object becoming lodged in the pharynx or larynx, commonly called choking. The first aider will be taught to deal with this through a combination of ‘back slaps’ and ‘abdominal thrusts’.\n\nOnce the airway has been opened, the first aider would assess to see if the patient is breathing. If there is no breathing, or the patient is not breathing normally, such as agonal breathing, the first aider would undertake what is probably the most recognized first aid procedure—cardiopulmonary resuscitation or CPR, which involves breathing for the patient, and manually massaging the heart to promote blood flow around the body.\n\nThe first aider is also likely to be trained in dealing with injuries such as cuts, grazes or bone fracture. They may be able to deal with the situation in its entirety (a small adhesive bandage on a paper cut), or may be required to maintain the condition of something like a broken bone, until the next stage of definitive care (usually an ambulance) arrives.\n\nTraining\n\nBasic principles, such as knowing to use an adhesive bandage or applying direct pressure on a bleed, are often acquired passively through life experiences. However, to provide effective, life-saving first aid interventions requires instruction and practical training. This is especially true where it relates to potentially fatal illnesses and injuries, such as those that require cardiopulmonary resuscitation (CPR); these procedures may be invasive, and carry a risk of further injury to the patient and the provider. As with any training, it is more useful if it occurs before an actual emergency, and in many countries, emergency ambulance dispatchers may give basic first aid instructions over the phone while the ambulance is on the way.\n\nTraining is generally provided by attending a course, typically leading to certification. Due to regular changes in procedures and protocols, based on updated clinical knowledge, and to maintain skill, attendance at regular refresher courses or re-certification is often necessary. First aid training is often available through community organizations such as the Red Cross and St. John Ambulance, or through commercial providers, who will train people for a fee. This commercial training is most common for training of employees to perform first aid in their workplace. Many community organizations also provide a commercial service, which complements their community programmes.\n\nSpecific disciplines\n\nThere are several types of first aid (and first aider) which require specific additional training. These are usually undertaken to fulfill the demands of the work or activity undertaken.\n* Aquatic/Marine first aid is usually practiced by professionals such as lifeguards, professional mariners or in diver rescue, and covers the specific problems which may be faced after water-based rescue or delayed MedEvac.\n* Battlefield first aid takes into account the specific needs of treating wounded combatants and non-combatants during armed conflict.\n* Hyperbaric first aid may be practiced by SCUBA diving professionals, who need to treat conditions such as the bends.\n* Oxygen first aid is the providing of oxygen to casualties who suffer from conditions resulting in hypoxia.\n* Wilderness first aid is the provision of first aid under conditions where the arrival of emergency responders or the evacuation of an injured person may be delayed due to constraints of terrain, weather, and available persons or equipment. It may be necessary to care for an injured person for several hours or days.\n* Mental health first aid is taught independently of physical first aid.  How to support someone experiencing a mental health problem or in a crisis situation.  Also how to identify  the first signs of someone developing mental ill health and guide people towards appropriate help.\n\nFirst aid services\n\nSome people undertake specific training in order to provide first aid at public or private events, during filming, or other places where people gather.  They may be designated as a first aider, or use some other title.  This role may be undertaken on a voluntary basis, with organisations such as the Red Cross and St John Ambulance, or as paid employment with a medical contractor.\n\nPeople performing a first aid role, whether in a professional or voluntary capacity, are often expected to have a high level of first aid training and are often uniformed.\n\nSymbols\n\nAlthough commonly associated with first aid, the symbol of a red cross is an official protective symbol of the Red Cross. According to the Geneva Conventions and other international laws, the use of this and similar symbols is reserved for official agencies of the International Red Cross and Red Crescent, and as a protective emblem for medical personnel and facilities in combat situations. Use by any other person or organization is illegal, and may lead to prosecution.\n\nThe internationally accepted symbol for first aid is the white cross on a green background shown below.\n\nSome organizations may make use of the Star of Life, although this is usually reserved for use by ambulance services, or may use symbols such as the Maltese Cross, like the Order of Malta Ambulance Corps and St John Ambulance. Other symbols may also be used.\n\nFile:ISO 7010 E003 - First aid sign.svg| ISO First Aid Symbol\nFile:St. Andrews First Aid.png| St. Andrew's First Aid Badge\nFile:Flag of the Red Cross.svg| Emblem of the Red Cross\nFile:Maltese-Cross-Heraldry.svg| Maltese or Amalfi Cross\nFile:Star of life2.svg| Star of life\nFile:CivilDefence.svg| Civil defence\n\nConditions that often require first aid\n\nAlso see medical emergency.\n* Altitude sickness, which can begin in susceptible people at altitudes as low as 5,000 feet, can cause potentially fatal swelling of the brain or lungs.\n* Anaphylaxis, a life-threatening condition in which the airway can become constricted and the patient may go into shock. The reaction can be caused by a systemic allergic reaction to allergens such as insect bites or peanuts. Anaphylaxis is initially treated with injection of epinephrine.\n* Battlefield first aid—This protocol refers to treating shrapnel, gunshot wounds, burns, bone fractures, etc. as seen either in the ‘traditional’ battlefield setting or in an area subject to damage by large-scale weaponry, such as a bomb blast.\n* Bone fracture, a break in a bone initially treated by stabilizing the fracture with a splint.\n* Burns, which can result in damage to tissues and loss of body fluids through the burn site.\n* Cardiac Arrest, which will lead to death unless CPR preferably combined with an AED is started within minutes. There is often no time to wait for the emergency services to arrive as 92 percent of people suffering a sudden cardiac arrest die before reaching hospital according to the American Heart Association.\n* Choking, blockage of the airway which can quickly result in death due to lack of oxygen if the patient’s trachea is not cleared, for example by the Heimlich Maneuver.\n* Childbirth.\n* Cramps in muscles due to lactic acid build up caused either by inadequate oxygenation of muscle or lack of water or salt.\n* Diving disorders, drowning or asphyxiation.\n* Gender-specific conditions, such as dysmenorrhea and testicular torsion.\n* Heart attack, or inadequate blood flow to the blood vessels supplying the heart muscle.\n* Heat stroke, also known as sunstroke or hyperthermia, which tends to occur during heavy exercise in high humidity, or with inadequate water, though it may occur spontaneously in some chronically ill persons. Sunstroke, especially when the victim has been unconscious, often causes major damage to body systems such as brain, kidney, liver, gastric tract. Unconsciousness for more than two hours usually leads to permanent disability. Emergency treatment involves rapid cooling of the patient.\n* Hair tourniquet a condition where a hair or other thread becomes tied around a toe or finger tightly enough to cut off blood flow.\n* Heat syncope, another stage in the same process as heat stroke, occurs under similar conditions as heat stroke and is not distinguished from the latter by some authorities.\n* Heavy bleeding, treated by applying pressure (manually and later with a pressure bandage) to the wound site and elevating the limb if possible.\n* Hyperglycemia (diabetic coma) and Hypoglycemia (insulin shock).\n* Hypothermia, or Exposure, occurs when a person’s core body temperature falls below 33.7 °C (92.6 °F). First aid for a mildly hypothermic patient includes rewarming, which can be achieved by wrapping the affected person in a blanket, and providing warm drinks, such as soup, and high energy food, such as chocolate. However, rewarming a severely hypothermic person could result in a fatal arrhythmia, an irregular heart rhythm.\n* Insect and animal bites and stings.\n* Joint dislocation.\n* Poisoning, which can occur by injection, inhalation, absorption, or ingestion.\n* Seizures, or a malfunction in the electrical activity in the brain. Three types of seizures include a grand mal (which usually features convulsions as well as temporary respiratory abnormalities, change in skin complexion, etc.) and petit mal (which usually features twitching, rapid blinking, or fidgeting as well as altered consciousness and temporary respiratory abnormalities).\n* Muscle strains and Sprains, a temporary dislocation of a joint that immediately reduces automatically but may result in ligament damage.\n* Stroke, a temporary loss of blood supply to the brain.\n* Toothache, which can result in severe pain and loss of the tooth but is rarely life-threatening, unless over time the infection spreads into the bone of the jaw and starts osteomyelitis.\n* Wounds and bleeding, including lacerations, incisions and abrasions, Gastrointestinal bleeding, avulsions and Sucking chest wounds, treated with an occlusive dressing to let air out but not in.\n\nFirst Aid Kit\n\nMany accidents can happen at home, office, schools, laboratories etc. which require immediate attention before the patient is attended by the doctor.\n\nMaking of the First Aid Kit\n\nThough professional first aid kits are readily available, one can make a simple kit easily at home. Still, ready made First Aid kits/boxes/pouches/cases are recommended, as they have well organized compartments. \nTo make a First Aid kit, a strong, durable bag or transparent plastic box should be taken and a white cross in a green square placed on the sides and on the top. This will make for easy identification of the box to any user. The kit should be kept such that it is within reach in case of an emergency.\n\nContents\n\nA First Aid Kit should have the following contents:\n*first-aid manual different sizes\n*adhesive tape\n*adhesive bandages in several  sizes\n*elastic bandage\n*a splint\n*antiseptic wipes\n*soap\n*antibiotic ointment\n*antiseptic solution (like hydrogen peroxide or saline)\n*hydrocortisone cream (1%)\n*acetaminophen and ibuprofen\n*extra prescription medications (if traveling)\n*tweezers\n*sharp scissors\n*safety pins\n*disposable instant cold packs\n*calamine lotion\n*alcohol wipes or ethyl alcohol\n*thermometer\n*tooth preservation kit\n*plastic non-latex gloves(at least 2 pairs)\n*flashlight and extra batteries\n*thermal shock blanket\n*mouthpiece for administering CPR (can be obtained from your local Red Cross)\n*blanket (stored nearby)\n*First Aid Card containing emergency personal information, phone numbers, medications, manual,\n*pocket defibrillator",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "First aid" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11296" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "First aid is the assistance given to any person suffering a sudden illness or injury, with care provided to preserve life, prevent the condition from worsening, or to promote recovery.  It includes initial intervention in a serious condition prior to professional medical help being available, such as performing CPR while awaiting an ambulance, as well as the complete treatment of minor conditions, such as applying a plaster to a cut.  First aid is generally performed by the layperson, with many people trained in providing basic levels of first aid, and others willing to do so from acquired knowledge. Mental health first aid is an extension of the concept of first aid to cover mental  health.\n\nThere are many situations which may require first aid, and many countries have legislation, regulation, or guidance which specifies a minimum level of first aid provision in certain circumstances.  This can include specific training or equipment to be available in the workplace (such as an Automated External Defibrillator), the provision of specialist first aid cover at public gatherings, or mandatory first aid training within schools. First aid, however, does not necessarily require any particular equipment or prior knowledge, and can involve improvisation with materials available at the time, often by untrained persons.\n\nFirst aid can be performed on all mammals, although this article relates to the care of human patients.\n\nHistory \n\nEarly history and warfare\n\nSkills of what is now known as first aid have been recorded throughout history, especially in relation to warfare, where the care of both traumatic and medical cases is required in particularly large numbers. The bandaging of battle wounds is shown on Classical Greek pottery from circa 500 BCE, whilst the parable of the Good Samaritan includes references to binding or dressing wounds.  There are numerous references to first aid performed within the Roman army, with a system of first aid supported by surgeons, field ambulances, and hospitals.  Roman legions had the specific role of capsarii, who were responsible for first aid such as bandaging, and are the forerunners of the modern combat medic.\n\nFurther examples occur through history, still mostly related to battle, with examples such as the Knights Hospitaller in the 11th century CE, providing care to pilgrims and knights in the Holy Land.\n\nFormalization of life saving treatments\n\nDuring the late 18th century, drowning as a cause of death was a major concern amongst the population. In 1767, a society for the preservation of life from accidents in water was started in Amsterdam, and in 1773, physician William Hawes began publicizing the power of artificial respiration as means of resuscitation of those who appeared drowned.  This led to the formation, in 1774, of the Society for the Recovery of Persons Apparently Drowned, later the Royal Humane Society, who did much to promote resuscitation.New Scientist, Vol. 193 No. 2586 (13–19 Jan 2007), p. 50\n\nNapoleon's surgeon, Baron Dominique-Jean Larrey, is credited with creating an ambulance corps (the ambulance volantes), which included medical assistants, tasked to administer first aid in battle.\n\nIn 1859 Jean-Henri Dunant witnessed the aftermath of the Battle of Solferino, and his work led to the formation of the Red Cross, with a key stated aim of \"aid to sick and  wounded soldiers in the field\".  The Red Cross and Red Crescent are still the largest provider of first aid worldwide.\n\nIn 1870, Prussian military surgeon Friedrich von Esmarch introduced formalized first aid to the military, and first coined the term \"erste hilfe\" (translating to 'first aid'), including training for soldiers in the Franco-Prussian War on care for wounded comrades using pre-learnt bandaging and splinting skills, and making use of the Esmarch bandage which he designed.  The bandage was issued as standard to the Prussian combatants, and also included aide-memoire pictures showing common uses.\n\nIn 1872, the Order of Saint John of Jerusalem in England changed its focus from hospice care, and set out to start a system of practical medical help, starting with making a grant towards the establishment of the UK's first ambulance service.  This was followed by creating its own wheeled transport litter in 1875 (the St John Ambulance), and in 1877 established the St John Ambulance Association (the forerunner of modern-day St John Ambulance) \"to train men and women for the benefit of the sick and wounded\".Fletcher NC. The St John Ambulance Association: its history and its past in the ambulance movement. London: St John Ambulance Association, 1929:12–3.\n\nAlso in the UK, Surgeon-Major Peter Shepherd had seen the advantages of von Esmarch's new teaching of first aid, and introduced an equivalent programme for the British Army, and so being the first user of \"first aid for the injured\" in English, disseminating information through a series of lectures.    Following this, in 1878, Shepherd and Colonel Francis Duncan took advantage of the newly charitable focus of St John, and established the concept of teaching first aid skills to civilians.  The first classes were conducted in the hall of the Presbyterian school in Woolwich (near Woolwich barracks where Shepherd was based) using a comprehensive first aid curriculum.\n\nFirst aid training began to spread through the British Empire through organisations such as St John, often starting, as in the UK, with high risk activities such as ports and railways.[http://www.sja.org.uk/history/victorian_britain.asp Industrial Revolution: St. John Ambulance] , retrieved December 10, 2006.\n\nAims\n\nThe key aims of first aid can be summarised in three key points, sometimes known as 'the three P's':-\n* Preserve life: The overriding aim of all medical care which includes first aid, is to save lives and minimize the threat of death.\n* Prevent further harm: Prevent further harm also sometimes called prevent the condition from worsening, or danger of further injury, this covers both external factors, such as moving a patient away from any cause of harm, and applying first aid techniques to prevent worsening of the condition, such as applying pressure to stop a bleed becoming dangerous.\n* Promote recovery: First aid also involves trying to start the recovery process from the illness or injury, and in some cases might involve completing a treatment, such as in the case of applying a plaster to a small wound.\n\nKey skills\n\nCertain skills are considered essential to the provision of first aid and are taught ubiquitously. Particularly the \"ABC\"s of first aid, which focus on critical life-saving intervention, must be rendered before treatment of less serious injuries. ABC stands for Airway, Breathing, and Circulation. The same mnemonic is used by all emergency health professionals. Attention must first be brought to the airway to ensure it is clear. Obstruction (choking) is a life-threatening emergency. Following evaluation of the airway, a first aid attendant would determine adequacy of breathing and provide rescue breathing if necessary. Assessment of circulation is now not usually carried out for patients who are not breathing, with first aiders now trained to go straight to chest compressions (and thus providing artificial circulation) but pulse checks may be done on less serious patients.\n\nSome organizations add a fourth step of \"D\" for Deadly bleeding or Defibrillation, while others consider this as part of the Circulation step. Variations on techniques to evaluate and maintain the ABCs depend on the skill level of the first aider.  Once the ABCs are secured, first aiders can begin additional treatments, as required. Some organizations teach the same order of priority using the \"3Bs\": Breathing, Bleeding, and Bones (or \"4Bs\": Breathing, Bleeding, Burns, and Bones). While the ABCs and 3Bs are taught to be performed sequentially, certain conditions may require the consideration of two steps simultaneously. This includes the provision of both artificial respiration and chest compressions to someone who is not breathing and has no pulse, and the consideration of cervical spine injuries when ensuring an open airway.\n\nPreserving life \n\nIn order to stay alive, all persons need to have an open airway—a clear passage where air can move in through the mouth or nose through the pharynx and down into the lungs, without obstruction. Conscious people will maintain their own airway automatically, but those who are unconscious (with a GCS of less than 8) may be unable to maintain a patent airway, as the part of the brain which automatically controls breathing in normal situations may not be functioning.\n\nIf the patient was breathing, a first aider would normally then place them in the recovery position, with the patient leant over on their side, which also has the effect of clearing the tongue from the pharynx. It also avoids a common cause of death in unconscious patients, which is choking on regurgitated stomach contents.\n\nThe airway can also become blocked through a foreign object becoming lodged in the pharynx or larynx, commonly called choking. The first aider will be taught to deal with this through a combination of ‘back slaps’ and ‘abdominal thrusts’.\n\nOnce the airway has been opened, the first aider would assess to see if the patient is breathing. If there is no breathing, or the patient is not breathing normally, such as agonal breathing, the first aider would undertake what is probably the most recognized first aid procedure—cardiopulmonary resuscitation or CPR, which involves breathing for the patient, and manually massaging the heart to promote blood flow around the body.\n\nThe first aider is also likely to be trained in dealing with injuries such as cuts, grazes or bone fracture. They may be able to deal with the situation in its entirety (a small adhesive bandage on a paper cut), or may be required to maintain the condition of something like a broken bone, until the next stage of definitive care (usually an ambulance) arrives.\n\nTraining\n\nBasic principles, such as knowing to use an adhesive bandage or applying direct pressure on a bleed, are often acquired passively through life experiences. However, to provide effective, life-saving first aid interventions requires instruction and practical training. This is especially true where it relates to potentially fatal illnesses and injuries, such as those that require cardiopulmonary resuscitation (CPR); these procedures may be invasive, and carry a risk of further injury to the patient and the provider. As with any training, it is more useful if it occurs before an actual emergency, and in many countries, emergency ambulance dispatchers may give basic first aid instructions over the phone while the ambulance is on the way.\n\nTraining is generally provided by attending a course, typically leading to certification. Due to regular changes in procedures and protocols, based on updated clinical knowledge, and to maintain skill, attendance at regular refresher courses or re-certification is often necessary. First aid training is often available through community organizations such as the Red Cross and St. John Ambulance, or through commercial providers, who will train people for a fee. This commercial training is most common for training of employees to perform first aid in their workplace. Many community organizations also provide a commercial service, which complements their community programmes.\n\nSpecific disciplines\n\nThere are several types of first aid (and first aider) which require specific additional training. These are usually undertaken to fulfill the demands of the work or activity undertaken.\n* Aquatic/Marine first aid is usually practiced by professionals such as lifeguards, professional mariners or in diver rescue, and covers the specific problems which may be faced after water-based rescue or delayed MedEvac.\n* Battlefield first aid takes into account the specific needs of treating wounded combatants and non-combatants during armed conflict.\n* Hyperbaric first aid may be practiced by SCUBA diving professionals, who need to treat conditions such as the bends.\n* Oxygen first aid is the providing of oxygen to casualties who suffer from conditions resulting in hypoxia.\n* Wilderness first aid is the provision of first aid under conditions where the arrival of emergency responders or the evacuation of an injured person may be delayed due to constraints of terrain, weather, and available persons or equipment. It may be necessary to care for an injured person for several hours or days.\n* Mental health first aid is taught independently of physical first aid.  How to support someone experiencing a mental health problem or in a crisis situation.  Also how to identify  the first signs of someone developing mental ill health and guide people towards appropriate help.\n\nFirst aid services\n\nSome people undertake specific training in order to provide first aid at public or private events, during filming, or other places where people gather.  They may be designated as a first aider, or use some other title.  This role may be undertaken on a voluntary basis, with organisations such as the Red Cross and St John Ambulance, or as paid employment with a medical contractor.\n\nPeople performing a first aid role, whether in a professional or voluntary capacity, are often expected to have a high level of first aid training and are often uniformed.\n\nSymbols\n\nAlthough commonly associated with first aid, the symbol of a red cross is an official protective symbol of the Red Cross. According to the Geneva Conventions and other international laws, the use of this and similar symbols is reserved for official agencies of the International Red Cross and Red Crescent, and as a protective emblem for medical personnel and facilities in combat situations. Use by any other person or organization is illegal, and may lead to prosecution.\n\nThe internationally accepted symbol for first aid is the white cross on a green background shown below.\n\nSome organizations may make use of the Star of Life, although this is usually reserved for use by ambulance services, or may use symbols such as the Maltese Cross, like the Order of Malta Ambulance Corps and St John Ambulance. Other symbols may also be used.\n\nFile:ISO 7010 E003 - First aid sign.svg| ISO First Aid Symbol\nFile:St. Andrews First Aid.png| St. Andrew's First Aid Badge\nFile:Flag of the Red Cross.svg| Emblem of the Red Cross\nFile:Maltese-Cross-Heraldry.svg| Maltese or Amalfi Cross\nFile:Star of life2.svg| Star of life\nFile:CivilDefence.svg| Civil defence\n\nConditions that often require first aid\n\nAlso see medical emergency.\n* Altitude sickness, which can begin in susceptible people at altitudes as low as 5,000 feet, can cause potentially fatal swelling of the brain or lungs.\n* Anaphylaxis, a life-threatening condition in which the airway can become constricted and the patient may go into shock. The reaction can be caused by a systemic allergic reaction to allergens such as insect bites or peanuts. Anaphylaxis is initially treated with injection of epinephrine.\n* Battlefield first aid—This protocol refers to treating shrapnel, gunshot wounds, burns, bone fractures, etc. as seen either in the ‘traditional’ battlefield setting or in an area subject to damage by large-scale weaponry, such as a bomb blast.\n* Bone fracture, a break in a bone initially treated by stabilizing the fracture with a splint.\n* Burns, which can result in damage to tissues and loss of body fluids through the burn site.\n* Cardiac Arrest, which will lead to death unless CPR preferably combined with an AED is started within minutes. There is often no time to wait for the emergency services to arrive as 92 percent of people suffering a sudden cardiac arrest die before reaching hospital according to the American Heart Association.\n* Choking, blockage of the airway which can quickly result in death due to lack of oxygen if the patient’s trachea is not cleared, for example by the Heimlich Maneuver.\n* Childbirth.\n* Cramps in muscles due to lactic acid build up caused either by inadequate oxygenation of muscle or lack of water or salt.\n* Diving disorders, drowning or asphyxiation.\n* Gender-specific conditions, such as dysmenorrhea and testicular torsion.\n* Heart attack, or inadequate blood flow to the blood vessels supplying the heart muscle.\n* Heat stroke, also known as sunstroke or hyperthermia, which tends to occur during heavy exercise in high humidity, or with inadequate water, though it may occur spontaneously in some chronically ill persons. Sunstroke, especially when the victim has been unconscious, often causes major damage to body systems such as brain, kidney, liver, gastric tract. Unconsciousness for more than two hours usually leads to permanent disability. Emergency treatment involves rapid cooling of the patient.\n* Hair tourniquet a condition where a hair or other thread becomes tied around a toe or finger tightly enough to cut off blood flow.\n* Heat syncope, another stage in the same process as heat stroke, occurs under similar conditions as heat stroke and is not distinguished from the latter by some authorities.\n* Heavy bleeding, treated by applying pressure (manually and later with a pressure bandage) to the wound site and elevating the limb if possible.\n* Hyperglycemia (diabetic coma) and Hypoglycemia (insulin shock).\n* Hypothermia, or Exposure, occurs when a person’s core body temperature falls below 33.7 °C (92.6 °F). First aid for a mildly hypothermic patient includes rewarming, which can be achieved by wrapping the affected person in a blanket, and providing warm drinks, such as soup, and high energy food, such as chocolate. However, rewarming a severely hypothermic person could result in a fatal arrhythmia, an irregular heart rhythm.\n* Insect and animal bites and stings.\n* Joint dislocation.\n* Poisoning, which can occur by injection, inhalation, absorption, or ingestion.\n* Seizures, or a malfunction in the electrical activity in the brain. Three types of seizures include a grand mal (which usually features convulsions as well as temporary respiratory abnormalities, change in skin complexion, etc.) and petit mal (which usually features twitching, rapid blinking, or fidgeting as well as altered consciousness and temporary respiratory abnormalities).\n* Muscle strains and Sprains, a temporary dislocation of a joint that immediately reduces automatically but may result in ligament damage.\n* Stroke, a temporary loss of blood supply to the brain.\n* Toothache, which can result in severe pain and loss of the tooth but is rarely life-threatening, unless over time the infection spreads into the bone of the jaw and starts osteomyelitis.\n* Wounds and bleeding, including lacerations, incisions and abrasions, Gastrointestinal bleeding, avulsions and Sucking chest wounds, treated with an occlusive dressing to let air out but not in.\n\nFirst Aid Kit\n\nMany accidents can happen at home, office, schools, laboratories etc. which require immediate attention before the patient is attended by the doctor.\n\nMaking of the First Aid Kit\n\nThough professional first aid kits are readily available, one can make a simple kit easily at home. Still, ready made First Aid kits/boxes/pouches/cases are recommended, as they have well organized compartments. \nTo make a First Aid kit, a strong, durable bag or transparent plastic box should be taken and a white cross in a green square placed on the sides and on the top. This will make for easy identification of the box to any user. The kit should be kept such that it is within reach in case of an emergency.\n\nContents\n\nA First Aid Kit should have the following contents:\n*first-aid manual different sizes\n*adhesive tape\n*adhesive bandages in several  sizes\n*elastic bandage\n*a splint\n*antiseptic wipes\n*soap\n*antibiotic ointment\n*antiseptic solution (like hydrogen peroxide or saline)\n*hydrocortisone cream (1%)\n*acetaminophen and ibuprofen\n*extra prescription medications (if traveling)\n*tweezers\n*sharp scissors\n*safety pins\n*disposable instant cold packs\n*calamine lotion\n*alcohol wipes or ethyl alcohol\n*thermometer\n*tooth preservation kit\n*plastic non-latex gloves(at least 2 pairs)\n*flashlight and extra batteries\n*thermal shock blanket\n*mouthpiece for administering CPR (can be obtained from your local Red Cross)\n*blanket (stored nearby)\n*First Aid Card containing emergency personal information, phone numbers, medications, manual,\n*pocket defibrillator. First aid. http://en.wikipedia.org/?curid=11296."
  }
}
