{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7756",
  "eid" : "e33d1400-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460992,
  "textBody" : "Chester Burton \"Chet\" Atkins (June 20, 1924 – June 30, 2001), known as \"Mr. Guitar\" and \"The Country Gentleman\", was an American musician, occasional vocalist, songwriter, and record producer, who along with Owen Bradley and Bob Ferguson, among others, created the country music style that came to be known as the Nashville sound, which expanded country music's appeal to adult pop music fans. He was primarily known as a guitarist. He also played the mandolin, fiddle, banjo, and ukulele.\n\nAtkins' signature picking style was inspired by Merle Travis. Other major guitar influences were Django Reinhardt, George Barnes, Les Paul, and, later, Jerry Reed. His distinctive picking style and musicianship brought him admirers inside and outside the country scene, both in the United States and abroad. Atkins spent most of his career at RCA Victor and produced records for the Browns, Hank Snow, Porter Wagoner, Norma Jean, Dolly Parton, Dottie West, Perry Como, Floyd Cramer, Elvis Presley, the Everly Brothers, Eddy Arnold, Don Gibson, Jim Reeves, Jerry Reed, Skeeter Davis, Waylon Jennings, and many others.\n\nRolling Stone credited Atkins with inventing the \"popwise \"Nashville sound\" that rescued country music from a commercial slump\", and ranked him number 21 on their list of \"The 100 Greatest Guitarists Of All Time.\"[https://www.rollingstone.com/music/lists/100-greatest-guitarists-20111123/chet-atkins-20111122 \"Chet Atkins\"]. Rolling Stone. Among many other honors, Atkins received 14 Grammy Awards and the Grammy Lifetime Achievement Award. He also received nine Country Music Association awards for Instrumentalist of the Year. He was inducted into the Rock & Roll Hall of Fame, the Country Music Hall of Fame and Museum, and the Musicians Hall of Fame and Museum.\n\nBiography\n\nChildhood and early life\n\nAtkins was born on June 20, 1924, in Luttrell, Tennessee, near Clinch Mountain. His parents divorced when he was six years old, after which he was raised by his mother. He was the youngest of three boys and a girl. He started out on the ukulele, later moving on to the fiddle, but swapped with his brother Lowell; an old pistol and some chores for a guitar when he was nine. He stated in his 1974 autobiography, \"We were so poor and everybody around us was so poor that it was the forties before anyone even knew there had been a depression.\" Forced to relocate to Fortson, Georgia, outside of Columbus, to live with his father because of a critical asthma condition, Atkins was a sensitive youth who made music his obsession. Because of his illness, he was forced to sleep in a straight-back chair to breathe comfortably. On those nights, he played his guitar until he fell asleep holding it, a habit which lasted his whole life.Atkins, Chet; Neely, Bill (1974). \"Country Gentleman\". Chicago. Harry Regnery. . While living in Fortson, he attended the historic Mountain Hill School. He returned in the 1990s to play a series of charity concerts to save the school from demolition.\nStories have been told about the very young Chet, who, when a friend or relative would come to visit and play guitar, would crowd in and put his ear so close to the instrument that it became difficult for the visitor to play.\n\nAtkins became an accomplished guitarist while he was in high school. He used the restroom in the school to practice, because it gave better acoustics.Atkins, Chet; Neely, Bill (1974). \"Country Gentleman\". Chicago. Harry Regnery. p. 52. .Halberstam, David (1961). iner notes. Chet Atkins' Workshop. RCA Victor LSP-2232. His first guitar had a nail for a nut and was so bowed that only the first few frets could be used.Atkins, Chet; Cochran, Russ (2003). \"Me and My Guitars\". Milwaukee: Hal Leonard. . He later purchased a semi-acoustic electric guitar and amp, but he had to travel many miles to find an electrical outlet, since his home didn't have electricity.Atkins, Chet; Neely, Bill. (1974). \"Country Gentleman\". Chicago. Harry Regnery. pp. 61–62. .\n\nLater in life, he lightheartedly gave himself (along with John Knowles, Marcel Dadi, Tommy Emmanuel, Steve Wariner, and Jerry Reed) the honorary degree CGP (\"Certified Guitar Player\").\nIn 2011, his daughter Merle Atkins Russell bestowed the CGP degree on his longtime sideman Paul Yandell.  She then declared no more CGPs would be allowed by the Atkins estate.\n\nHis half-brother Jim, was a successful guitarist who worked with the Les Paul Trio in New York.\n\nAtkins did not have a strong style of his own until 1939, when (while still living in Georgia) he heard Merle Travis picking over WLW radio.*[http://www.countrymusichalloffame.com/site/inductees.aspx?cid\n99 Country Music Hall of Fame and Museum]  This early influence dramatically shaped his unique playing style. Whereas Travis' right hand used his index finger for the melody and thumb for bass notes, Atkins expanded his right-hand style to include picking with his first three fingers, with the thumb on bass.\n\nChet Atkins was a ham radio general class licensee. Formerly using the call sign WA4CZD, he obtained the vanity call sign W4CGP in 1998 to include the CGP designation. He was a member of the American Radio Relay League.[http://www.arrl.org/news/stories/2001/07/02/1/?nc=1 ARRLWeb: \"Mister Guitar\", Chet Atkins, W4CGP, SK] \n\nEarly musical career\n\nAfter dropping out of high school in 1942, Atkins landed a job at WNOX-AM radio in Knoxville, where he played fiddle and guitar with the singer Bill Carlisle and the comic Archie Campbell and became a member of the station's Dixieland Swingsters, a small swing instrumental combo. After three years, he moved to WLW-AM in Cincinnati, Ohio, where Merle Travis had formerly worked.\n\nAfter six months, he moved to Raleigh and worked with Johnnie and Jack before heading for Richmond, Virginia, where he performed with Sunshine Sue Workman. Atkins' shy personality worked against him, as did the fact that his sophisticated style led many to doubt he was truly \"country\". He was fired often, but was soon able to land another job at another radio station on account of his unique playing ability.\n\nAtkins and Jethro Burns (of Homer and Jethro) married twin sisters, Leona and Lois Johnson, who sang as Laverne and Fern Johnson, the Johnson Sisters. Leona Atkins outlived her husband by eight years, dying in 2009 at the age of 85.\n\nTravelling to Chicago, Atkins auditioned for Red Foley, who was leaving his star position on WLS-AM's National Barn Dance to join the Grand Ole Opry.[https://www.rollingstone.com/news/story/5931727/chet_atkins_dies/print \"Chet Atkins Dies\"] Rolling Stone. Accessed on March 28, 2008. Atkins made his first appearance at the Opry in 1946 as a member of Foley's band. He also recorded a single for Nashville-based Bullet Records that year. That single, \"Guitar Blues\", was fairly progressive, including a clarinet solo by the Nashville dance band musician Dutch McMillan, with Owen Bradley on piano. He had a solo spot on the Opry, but when that was cut, Atkins moved on to KWTO in Springfield, Missouri. Despite the support of executive Si Siman, however, he soon was fired for not sounding \"country enough\".\n\nSigning with RCA Victor\n\nWhile working with a Western band in Denver, Colorado, Atkins came to the attention of RCA Victor. Siman had been encouraging Steve Sholes to sign Atkins, as his style (with the success of Merle Travis as a hit recording artist) was suddenly in vogue. Sholes, A&R director of country music at RCA, tracked Atkins down in Denver.\n\nHe made his first RCA Victor recordings in Chicago in 1947. They did not sell, but he did some studio work for RCA that year but had relocated to Knoxville again, where he worked with Homer and Jethro on WNOX's new Saturday night radio show The Tennessee Barn Dance and the popular Midday Merry Go Round.\n\nIn 1949, he left WNOX to join June Carter with Mother Maybelle and the Carter Sisters on KWTO. This incarnation of the old Carter Family featured Maybelle Carter and daughters June, Helen, and Anita. Their work soon attracted attention from the Grand Ole Opry. The group relocated to Nashville in the mid-1950s. Atkins began working on recording sessions and performing on WSM-AM and the Opry. Atkins became a member of the Opry in the 1950s.\n\nWhile he had not yet had a hit record for RCA Victor, his stature was growing. He began assisting Sholes as a session leader when the New York–based producer needed help organizing Nashville sessions for RCA Victor artists. Atkins' first hit single was \"Mr. Sandman\", followed by \"Silver Bell\", which he recorded as a duet with Hank Snow. His albums also became more popular. He was featured on ABC-TV's The Eddy Arnold Show in the summer of 1956 and on Country Music Jubilee in 1957 and 1958 (by then renamed Jubilee USA).\n\nIn addition to recording, Atkins was a design consultant for Gretsch, which manufactured a popular Chet Atkins line of electric guitars from 1955–1980. He became manager of RCA Victor's Nashville studio, eventually inspiring and seeing the completion of the legendary RCA Studio B, the first studio built specifically for the purpose of recording on the now-famous Music Row.\n\nPerformer and producer\n\nWhen Sholes took over pop production in 1957—a result of his success with Elvis Presley—he put Atkins in charge of RCA Victor's Nashville division. With country music record sales declining; as rock and roll became more popular, Atkins and Bob Ferguson took their cue from Owen Bradley and eliminated fiddles and steel guitar as a means of making country singers appeal to pop fans. This became known as the Nashville sound which Atkins said was a label created by the media attached to a style of recording done during that period to keep country (and their jobs) viable.\n\nAtkins used the Jordanaires and a rhythm section on hits such as Jim Reeves's \"Four Walls\" and \"He'll Have to Go\"[ Allmusic entry for Welcome to My World, Jim Reeves 1996 box set, Bear Family Records] and Don Gibson's \"Oh Lonesome Me\" and \"Blue Blue Day\".[ Allmusic biography of Don Gibson] The once-rare phenomenon of having a country hit cross over to pop success became more common. Bradley and he had essentially put the producer in the driver's seat, guiding an artist's choice of material and the musical background.\n\nAtkins made his own records, which usually visited pop standards and jazz, in a sophisticated home studio, often recording the rhythm tracks at RCA and adding his solo parts at home, refining the tracks until the results satisfied him. Guitarists of all styles came to admire various Atkins albums for their unique musical ideas and in some cases experimental electronic ideas. In this period, he became known internationally as \"Mister Guitar\", inspiring an album, Mister Guitar, engineered by both Bob Ferris and Bill Porter, Ferris's replacement.\n\nAt the end of March 1959, Porter took over as chief engineer at RCA's Nashville studio, in the space now known as Studio B. (At the time, only one RCA studio was in Nashville, with no letter designation.) Porter soon helped Atkins get a better reverberation sound from the studio's German effects device, an EMT plate reverb. With his golden ear, Porter found the studio's acoustics to be problematic, and he devised a set of acoustic baffles to hang from the ceiling, then selected positions for microphones based on resonant room modes. The sound of the recordings improved significantly, and the studio achieved a string of successes. The Nashville sound became more dynamic. In later years, when Bradley asked how he achieved his sound, Atkins told him \"it was Porter.\" Porter described Atkins as respectful of musicians when recording—if someone was out of tune, he would not single that person out by name. Instead, he would say something like, \"we got a little tuning problem ... Everybody check and see what's going on.\" If that did not work, Atkins would instruct Porter to turn the offending player down in the mix. When Porter left RCA in late-1964, Atkins said, \"the sound was never the same, never as great.\"\n\nAtkins' trademark \"Atkins style\" of playing uses the thumb and first two or sometimes three fingers of the right hand. He developed this style from listening to Merle Travis, occasionally on a primitive radio. He was sure no one could play that articulately with just the thumb and index finger (which was exactly how Travis played), and he assumed it required the thumb and two fingers—and that was the style he pioneered and mastered.\n\nHe enjoyed jamming with fellow studio musicians, and they were asked to perform at the Newport Jazz Festival in 1960. That performance was cancelled because of rioting, but a live recording of the group (After the Riot at Newport) was released. Atkins performed by invitation at the White House for every U.S. President from John F. Kennedy through to George H. W. Bush. Atkins was a member of the Million Dollar Band during the 1980s. He is also well known for his song \"Yankee Doodle Dixie\", in which he played \"Yankee Doodle\" and \"Dixie\" simultaneously, on the same guitar.\n\nBefore his mentor Sholes died in 1968, Atkins had become vice president of RCA's country division. In 1987, he told Nine-O-One Network magazine that he was \"ashamed\" of his promotion: \"I wanted to be known as a guitarist and I know, too, that they give you titles like that in lieu of money. So beware when they want to make you vice president.\"Nine-O-One Interview, Nine-O-One Network Magazine, December 1987, p.10-11 He had brought Waylon Jennings, Willie Nelson, Connie Smith, Bobby Bare, Dolly Parton, Jerry Reed, and John Hartford to the label in the 1960s and inspired and helped countless others.[http://www.rockhall.com/inductees/chet-atkins \"Chet Atkins\"], Rock and Roll Hall of Fame. Accessed on March 28, 2008. He took a considerable risk during the mid-1960s, when the Civil Rights Movement sparked violence throughout the South, by signing country music's first African-American singer, Charley Pride, who sang rawer country than the smoother music Atkins had pioneered.\n\nAtkins' biggest hit single came in 1965, with \"Yakety Axe\", an adaptation of \"Yakety Sax\", by his friend, the saxophonist Boots Randolph. He rarely performed in those days and eventually hired other RCA producers, such as Bob Ferguson and Felton Jarvis, to lessen his workload.\n\nLater career\n\nIn the 1970s, Atkins became increasingly stressed by his executive duties. He produced fewer records, but could still turn out hits such as Perry Como's 1973 pop hit \"And I Love You So\". He recorded extensively with close friend and fellow picker Jerry Reed, who had become a hit artist in his own right. A 1973 diagnosis of colon cancer, however, led Atkins to redefine his role at RCA, to allow others to handle administration while he went back to his first love, the guitar, often recording with Reed or even Jethro Burns from Homer and Jethro (his brother-in-law) after Homer died in 1971.\n\nBy the late-1970s, RCA decided to remove Atkins from his production duties and replace him with younger men. He also felt stifled because the record company would not let him branch into jazz. His mid-1970s collaborations with one of his influences, Les Paul, Chester & Lester and Guitar Monsters, had already reflected that interest; Chester & Lester was one of the best-selling recordings of Atkins's career. At the same time, he grew dissatisfied with the direction Gretsch (no longer family-owned) was going and withdrew his authorization for them to use his name and began designing guitars with Gibson. Atkins ended his 35-year association with RCA in 1982 and signed with Columbia Records, for whom he produced a debut album in 1983.\n\nJazz had always been a strong love of his, and often in his career he was criticized by \"pure\" country musicians for his jazz influences. He also said on many occasions that he did not like being called a \"country guitarist\", insisting that he was a guitarist, period. Although he played \"by ear\" and was a masterful improviser, he was able to read music and even performed some classical guitar pieces. When Roger C. Field, a friend, suggested to him in 1991 that he record and perform with a female singer, he did so with Suzy Bogguss.\n\nHe returned to his country roots for albums he recorded with Mark Knopfler and Jerry Reed. Knopfler had long mentioned Atkins as one of his earliest influences. Atkins also collaborated with Australian guitar legend Tommy Emmanuel. On being asked to name the ten most influential guitarists of the twentieth century, he named Django Reinhardt to the first position, and also placed himself on the list.[http://www.misterguitar.com/news/chetsten.html Official Web Site of Chet Atkins]. Accessed on August 27, 2014.\n\nIn later years, he even went back to radio, appearing on Garrison Keillor's Prairie Home Companion radio program, on American Public Media radio, even picking up a fiddle from time to time, and performing songs such as Bob Wills' \"Corrina, Corrina\" and Willie Nelson's \"Seven Spanish Angels\" with Nelson on a 1985 broadcast of the show at the Bridges Auditorium on the campus of Pomona College (then Claremont College).\n\nDeath and legacy\n\nAtkins received numerous awards, including 14 Grammy awards and nine Country Music Association awards for Instrumentalist of the Year. In 1993, he was honored with the Grammy Lifetime Achievement Award. Billboard magazine awarded him its Century Award, its \"highest honor for distinguished creative achievement\", in December 1997.[https://www.rollingstone.com/artists/chetatkins/biography \"Biography – Chet Atkins\"]. Rolling Stone. Accessed on May 10, 2008.\n\nAtkins is notable for his broad influence. His love for numerous styles of music can be traced from his early recording of the stride pianist James P. Johnson's \"Johnson Rag\", all the way to the rock stylings of Eric Johnson, an invited guest on Atkins's recording sessions, who, when Atkins attempted to copy his influential rocker \"Cliffs of Dover\", led to Atkins's creation of a unique arrangement of \"Londonderry Air (Danny Boy)\".\n\nAtkins's recordings of \"Malagueña\" inspired a new generation of flamenco guitarists; the classical guitar selections included on almost all his albums were, for many American artists working in the field today, the first classical guitar they ever heard. He recorded smooth jazz guitar still played on American airwaves today.\n\nAtkins continued performing in the 1990s, but his health declined after he was diagnosed again with cancer in 1996. He died on June 30, 2001, at his home in Nashville, Tennessee, ten days after his 77th birthday.[http://archives.cnn.com/2001/SHOWBIZ/Music/07/02/obit.chet.atkins/index.html \"Obituary\"] , CNN, July 2, 2001 Accessed June 21, 2008 His memorial service was held at Ryman Auditorium in Nashville. He was buried at Harpeth Hills Memory Gardens in Nashville.[https://www.findagrave.com/memorial/23366 Chet Atkins at Find a Grave.] Accessed November 24, 2010\n\nA stretch of Interstate 185 in southwest Georgia (between LaGrange and Columbus) is named \"Chet Atkins Parkway\". This stretch of interstate runs through Fortson, where Atkins spent much of his childhood.\n\nIn 2002, Atkins was posthumously inducted into the Rock and Roll Hall of Fame. His award was presented by Marty Stuart and Brian Setzer and accepted by Atkins's grandson, Jonathan Russell. The following year, Atkins ranked number 28 in Country Music Television's \"40 Greatest Men of Country Music\".\n\nAt the age of 13, the future jazz guitarist Earl Klugh was captivated watching Atkins's guitar playing on The Perry Como Show. Similarly, he was a big influence on Doyle Dykes. Atkins also inspired Drexl Jonez and Tommy Emmanuel.[http://www.tommyemmanuel.com/bio/ Tommy Emmanuel official website biography.] Retrieved September 2009.\n\nClint Black's album Nothin' but the Taillights includes the song \"Ode to Chet\", which includes the lyrics \"'Cause I can win her over like Romeo did Juliet, if I can only show her I can almost pick that legato lick like Chet\" and \"It'll take more than Mel Bay 1, 2, & 3 if I'm ever gonna play like CGP.\" Atkins played guitar on the track. At the end of the song, Black and Atkins had a brief conversation.\n\nChet's song \"Jam Man\" is currently used in commercials for Esurance.\n\nThe opening guitar licks to the Miranda Lambert song \"Only Prettier\" sound very similar to Atkins's guitar-picking style.\n\nIn 1967, a tribute song, \"Chet's Tune\", was produced for his birthday, with contributions by a long list of RCA Victor artists, including Eddy Arnold, Connie Smith, Jerry Reed, Willie Nelson, Hank Snow, and others. The song was written by the Nashville songwriter Cy Coben, a friend of Atkins's. The single reached number 38 on the country charts.Billboard, June 3, 1967, p. 41.McClellan, John; Bratic, Deyan. Chet Atkins in Three Dimensions: 50 Years of Legendary Guitar, vol. 1. Pacific, MO: Mel Bay Publications. pp. 47–49.\n\nIn 2009, Steve Wariner released an album entitled My Tribute to Chet Atkins. One song from that record, \"Producer's Medley\", featured Wariner's recreation of several famous songs which Atkins both produced and performed. \"Producer's Medley\" won the Grammy for Best Country Instrumental Performance in 2010.\n\nIn November 2011, Rolling Stone ranked Atkins number 21 on their list of the \"100 Greatest Guitarists of All Time\".[https://www.rollingstone.com/music/lists/100-greatest-guitarists-20111123/chet-atkins-20111122 \"Chet Atkins\"]. Rolling Stone.\n\nDiscography\n\nIndustry awards\n\nCountry Music Association\n*1967 Instrumentalist of the Year\n*1968 Instrumentalist of the Year\n*1969 Instrumentalist of the Year\n*1981 Instrumentalist of the Year\n*1982 Instrumentalist of the Year\n*1983 Instrumentalist of the Year\n*1984 Instrumentalist of the Year\n*1985 Instrumentalist of the Year\n*1988 Instrumentalist of the Year\n\nCountry Music Hall of Fame and Museum\n*Inducted in 1973\n\nGrammy Awards\n*1971 Best Country Instrumental Performance with Jerry Reed – Me and Jerry\n*1972 Best Country Instrumental Performance – \"Snowbird\"\n*1975 Best Country Instrumental Performance with Merle Travis – The Atkins-Travis Traveling Show\n*1976 Best Country Instrumental Performance – \"The Entertainer\"\n*1977 Best Country Instrumental Performance with Les Paul – Chester and Lester\n*1982 Best Country Instrumental Performance – Country After All These Years\n*1986 Best Country Instrumental Performance with Mark Knopfler – \"Cosmic Square Dance\"\n*1991 Best Country Instrumental Performance with Mark Knopfler – \"So Soft, Your Goodbye\"\n*1991 Best Country Vocal Collaboration  with Mark Knopfler – \"Poor Boy Blues\"\n*1993 Best Country Instrumental Performance with Jerry Reed – Sneakin' Around\n*1993 Grammy Lifetime Achievement Award'\n*1994 Best Country Instrumental Performance with Asleep at the Wheel, Eldon Shamblin, Johnny Gimble, Marty Stuart, Reuben \"Lucky Oceans\" Gosfield & Vince Gill – \"Red Wing\"\n*1995 Best Country Instrumental Performance – \"Young Thing\"\n*1997 Best Country Instrumental Performance – \"Jam Man\"\n\nRock and Roll Hall of Fame\n*Inductees of the Rock and Roll Hall of Fame",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chet Atkins" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7756" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Chester Burton \"Chet\" Atkins (June 20, 1924 – June 30, 2001), known as \"Mr. Guitar\" and \"The Country Gentleman\", was an American musician, occasional vocalist, songwriter, and record producer, who along with Owen Bradley and Bob Ferguson, among others, created the country music style that came to be known as the Nashville sound, which expanded country music's appeal to adult pop music fans. He was primarily known as a guitarist. He also played the mandolin, fiddle, banjo, and ukulele.\n\nAtkins' signature picking style was inspired by Merle Travis. Other major guitar influences were Django Reinhardt, George Barnes, Les Paul, and, later, Jerry Reed. His distinctive picking style and musicianship brought him admirers inside and outside the country scene, both in the United States and abroad. Atkins spent most of his career at RCA Victor and produced records for the Browns, Hank Snow, Porter Wagoner, Norma Jean, Dolly Parton, Dottie West, Perry Como, Floyd Cramer, Elvis Presley, the Everly Brothers, Eddy Arnold, Don Gibson, Jim Reeves, Jerry Reed, Skeeter Davis, Waylon Jennings, and many others.\n\nRolling Stone credited Atkins with inventing the \"popwise \"Nashville sound\" that rescued country music from a commercial slump\", and ranked him number 21 on their list of \"The 100 Greatest Guitarists Of All Time.\"[https://www.rollingstone.com/music/lists/100-greatest-guitarists-20111123/chet-atkins-20111122 \"Chet Atkins\"]. Rolling Stone. Among many other honors, Atkins received 14 Grammy Awards and the Grammy Lifetime Achievement Award. He also received nine Country Music Association awards for Instrumentalist of the Year. He was inducted into the Rock & Roll Hall of Fame, the Country Music Hall of Fame and Museum, and the Musicians Hall of Fame and Museum.\n\nBiography\n\nChildhood and early life\n\nAtkins was born on June 20, 1924, in Luttrell, Tennessee, near Clinch Mountain. His parents divorced when he was six years old, after which he was raised by his mother. He was the youngest of three boys and a girl. He started out on the ukulele, later moving on to the fiddle, but swapped with his brother Lowell; an old pistol and some chores for a guitar when he was nine. He stated in his 1974 autobiography, \"We were so poor and everybody around us was so poor that it was the forties before anyone even knew there had been a depression.\" Forced to relocate to Fortson, Georgia, outside of Columbus, to live with his father because of a critical asthma condition, Atkins was a sensitive youth who made music his obsession. Because of his illness, he was forced to sleep in a straight-back chair to breathe comfortably. On those nights, he played his guitar until he fell asleep holding it, a habit which lasted his whole life.Atkins, Chet; Neely, Bill (1974). \"Country Gentleman\". Chicago. Harry Regnery. . While living in Fortson, he attended the historic Mountain Hill School. He returned in the 1990s to play a series of charity concerts to save the school from demolition.\nStories have been told about the very young Chet, who, when a friend or relative would come to visit and play guitar, would crowd in and put his ear so close to the instrument that it became difficult for the visitor to play.\n\nAtkins became an accomplished guitarist while he was in high school. He used the restroom in the school to practice, because it gave better acoustics.Atkins, Chet; Neely, Bill (1974). \"Country Gentleman\". Chicago. Harry Regnery. p. 52. .Halberstam, David (1961). iner notes. Chet Atkins' Workshop. RCA Victor LSP-2232. His first guitar had a nail for a nut and was so bowed that only the first few frets could be used.Atkins, Chet; Cochran, Russ (2003). \"Me and My Guitars\". Milwaukee: Hal Leonard. . He later purchased a semi-acoustic electric guitar and amp, but he had to travel many miles to find an electrical outlet, since his home didn't have electricity.Atkins, Chet; Neely, Bill. (1974). \"Country Gentleman\". Chicago. Harry Regnery. pp. 61–62. .\n\nLater in life, he lightheartedly gave himself (along with John Knowles, Marcel Dadi, Tommy Emmanuel, Steve Wariner, and Jerry Reed) the honorary degree CGP (\"Certified Guitar Player\").\nIn 2011, his daughter Merle Atkins Russell bestowed the CGP degree on his longtime sideman Paul Yandell.  She then declared no more CGPs would be allowed by the Atkins estate.\n\nHis half-brother Jim, was a successful guitarist who worked with the Les Paul Trio in New York.\n\nAtkins did not have a strong style of his own until 1939, when (while still living in Georgia) he heard Merle Travis picking over WLW radio.*[http://www.countrymusichalloffame.com/site/inductees.aspx?cid\n99 Country Music Hall of Fame and Museum]  This early influence dramatically shaped his unique playing style. Whereas Travis' right hand used his index finger for the melody and thumb for bass notes, Atkins expanded his right-hand style to include picking with his first three fingers, with the thumb on bass.\n\nChet Atkins was a ham radio general class licensee. Formerly using the call sign WA4CZD, he obtained the vanity call sign W4CGP in 1998 to include the CGP designation. He was a member of the American Radio Relay League.[http://www.arrl.org/news/stories/2001/07/02/1/?nc=1 ARRLWeb: \"Mister Guitar\", Chet Atkins, W4CGP, SK] \n\nEarly musical career\n\nAfter dropping out of high school in 1942, Atkins landed a job at WNOX-AM radio in Knoxville, where he played fiddle and guitar with the singer Bill Carlisle and the comic Archie Campbell and became a member of the station's Dixieland Swingsters, a small swing instrumental combo. After three years, he moved to WLW-AM in Cincinnati, Ohio, where Merle Travis had formerly worked.\n\nAfter six months, he moved to Raleigh and worked with Johnnie and Jack before heading for Richmond, Virginia, where he performed with Sunshine Sue Workman. Atkins' shy personality worked against him, as did the fact that his sophisticated style led many to doubt he was truly \"country\". He was fired often, but was soon able to land another job at another radio station on account of his unique playing ability.\n\nAtkins and Jethro Burns (of Homer and Jethro) married twin sisters, Leona and Lois Johnson, who sang as Laverne and Fern Johnson, the Johnson Sisters. Leona Atkins outlived her husband by eight years, dying in 2009 at the age of 85.\n\nTravelling to Chicago, Atkins auditioned for Red Foley, who was leaving his star position on WLS-AM's National Barn Dance to join the Grand Ole Opry.[https://www.rollingstone.com/news/story/5931727/chet_atkins_dies/print \"Chet Atkins Dies\"] Rolling Stone. Accessed on March 28, 2008. Atkins made his first appearance at the Opry in 1946 as a member of Foley's band. He also recorded a single for Nashville-based Bullet Records that year. That single, \"Guitar Blues\", was fairly progressive, including a clarinet solo by the Nashville dance band musician Dutch McMillan, with Owen Bradley on piano. He had a solo spot on the Opry, but when that was cut, Atkins moved on to KWTO in Springfield, Missouri. Despite the support of executive Si Siman, however, he soon was fired for not sounding \"country enough\".\n\nSigning with RCA Victor\n\nWhile working with a Western band in Denver, Colorado, Atkins came to the attention of RCA Victor. Siman had been encouraging Steve Sholes to sign Atkins, as his style (with the success of Merle Travis as a hit recording artist) was suddenly in vogue. Sholes, A&R director of country music at RCA, tracked Atkins down in Denver.\n\nHe made his first RCA Victor recordings in Chicago in 1947. They did not sell, but he did some studio work for RCA that year but had relocated to Knoxville again, where he worked with Homer and Jethro on WNOX's new Saturday night radio show The Tennessee Barn Dance and the popular Midday Merry Go Round.\n\nIn 1949, he left WNOX to join June Carter with Mother Maybelle and the Carter Sisters on KWTO. This incarnation of the old Carter Family featured Maybelle Carter and daughters June, Helen, and Anita. Their work soon attracted attention from the Grand Ole Opry. The group relocated to Nashville in the mid-1950s. Atkins began working on recording sessions and performing on WSM-AM and the Opry. Atkins became a member of the Opry in the 1950s.\n\nWhile he had not yet had a hit record for RCA Victor, his stature was growing. He began assisting Sholes as a session leader when the New York–based producer needed help organizing Nashville sessions for RCA Victor artists. Atkins' first hit single was \"Mr. Sandman\", followed by \"Silver Bell\", which he recorded as a duet with Hank Snow. His albums also became more popular. He was featured on ABC-TV's The Eddy Arnold Show in the summer of 1956 and on Country Music Jubilee in 1957 and 1958 (by then renamed Jubilee USA).\n\nIn addition to recording, Atkins was a design consultant for Gretsch, which manufactured a popular Chet Atkins line of electric guitars from 1955–1980. He became manager of RCA Victor's Nashville studio, eventually inspiring and seeing the completion of the legendary RCA Studio B, the first studio built specifically for the purpose of recording on the now-famous Music Row.\n\nPerformer and producer\n\nWhen Sholes took over pop production in 1957—a result of his success with Elvis Presley—he put Atkins in charge of RCA Victor's Nashville division. With country music record sales declining; as rock and roll became more popular, Atkins and Bob Ferguson took their cue from Owen Bradley and eliminated fiddles and steel guitar as a means of making country singers appeal to pop fans. This became known as the Nashville sound which Atkins said was a label created by the media attached to a style of recording done during that period to keep country (and their jobs) viable.\n\nAtkins used the Jordanaires and a rhythm section on hits such as Jim Reeves's \"Four Walls\" and \"He'll Have to Go\"[ Allmusic entry for Welcome to My World, Jim Reeves 1996 box set, Bear Family Records] and Don Gibson's \"Oh Lonesome Me\" and \"Blue Blue Day\".[ Allmusic biography of Don Gibson] The once-rare phenomenon of having a country hit cross over to pop success became more common. Bradley and he had essentially put the producer in the driver's seat, guiding an artist's choice of material and the musical background.\n\nAtkins made his own records, which usually visited pop standards and jazz, in a sophisticated home studio, often recording the rhythm tracks at RCA and adding his solo parts at home, refining the tracks until the results satisfied him. Guitarists of all styles came to admire various Atkins albums for their unique musical ideas and in some cases experimental electronic ideas. In this period, he became known internationally as \"Mister Guitar\", inspiring an album, Mister Guitar, engineered by both Bob Ferris and Bill Porter, Ferris's replacement.\n\nAt the end of March 1959, Porter took over as chief engineer at RCA's Nashville studio, in the space now known as Studio B. (At the time, only one RCA studio was in Nashville, with no letter designation.) Porter soon helped Atkins get a better reverberation sound from the studio's German effects device, an EMT plate reverb. With his golden ear, Porter found the studio's acoustics to be problematic, and he devised a set of acoustic baffles to hang from the ceiling, then selected positions for microphones based on resonant room modes. The sound of the recordings improved significantly, and the studio achieved a string of successes. The Nashville sound became more dynamic. In later years, when Bradley asked how he achieved his sound, Atkins told him \"it was Porter.\" Porter described Atkins as respectful of musicians when recording—if someone was out of tune, he would not single that person out by name. Instead, he would say something like, \"we got a little tuning problem ... Everybody check and see what's going on.\" If that did not work, Atkins would instruct Porter to turn the offending player down in the mix. When Porter left RCA in late-1964, Atkins said, \"the sound was never the same, never as great.\"\n\nAtkins' trademark \"Atkins style\" of playing uses the thumb and first two or sometimes three fingers of the right hand. He developed this style from listening to Merle Travis, occasionally on a primitive radio. He was sure no one could play that articulately with just the thumb and index finger (which was exactly how Travis played), and he assumed it required the thumb and two fingers—and that was the style he pioneered and mastered.\n\nHe enjoyed jamming with fellow studio musicians, and they were asked to perform at the Newport Jazz Festival in 1960. That performance was cancelled because of rioting, but a live recording of the group (After the Riot at Newport) was released. Atkins performed by invitation at the White House for every U.S. President from John F. Kennedy through to George H. W. Bush. Atkins was a member of the Million Dollar Band during the 1980s. He is also well known for his song \"Yankee Doodle Dixie\", in which he played \"Yankee Doodle\" and \"Dixie\" simultaneously, on the same guitar.\n\nBefore his mentor Sholes died in 1968, Atkins had become vice president of RCA's country division. In 1987, he told Nine-O-One Network magazine that he was \"ashamed\" of his promotion: \"I wanted to be known as a guitarist and I know, too, that they give you titles like that in lieu of money. So beware when they want to make you vice president.\"Nine-O-One Interview, Nine-O-One Network Magazine, December 1987, p.10-11 He had brought Waylon Jennings, Willie Nelson, Connie Smith, Bobby Bare, Dolly Parton, Jerry Reed, and John Hartford to the label in the 1960s and inspired and helped countless others.[http://www.rockhall.com/inductees/chet-atkins \"Chet Atkins\"], Rock and Roll Hall of Fame. Accessed on March 28, 2008. He took a considerable risk during the mid-1960s, when the Civil Rights Movement sparked violence throughout the South, by signing country music's first African-American singer, Charley Pride, who sang rawer country than the smoother music Atkins had pioneered.\n\nAtkins' biggest hit single came in 1965, with \"Yakety Axe\", an adaptation of \"Yakety Sax\", by his friend, the saxophonist Boots Randolph. He rarely performed in those days and eventually hired other RCA producers, such as Bob Ferguson and Felton Jarvis, to lessen his workload.\n\nLater career\n\nIn the 1970s, Atkins became increasingly stressed by his executive duties. He produced fewer records, but could still turn out hits such as Perry Como's 1973 pop hit \"And I Love You So\". He recorded extensively with close friend and fellow picker Jerry Reed, who had become a hit artist in his own right. A 1973 diagnosis of colon cancer, however, led Atkins to redefine his role at RCA, to allow others to handle administration while he went back to his first love, the guitar, often recording with Reed or even Jethro Burns from Homer and Jethro (his brother-in-law) after Homer died in 1971.\n\nBy the late-1970s, RCA decided to remove Atkins from his production duties and replace him with younger men. He also felt stifled because the record company would not let him branch into jazz. His mid-1970s collaborations with one of his influences, Les Paul, Chester & Lester and Guitar Monsters, had already reflected that interest; Chester & Lester was one of the best-selling recordings of Atkins's career. At the same time, he grew dissatisfied with the direction Gretsch (no longer family-owned) was going and withdrew his authorization for them to use his name and began designing guitars with Gibson. Atkins ended his 35-year association with RCA in 1982 and signed with Columbia Records, for whom he produced a debut album in 1983.\n\nJazz had always been a strong love of his, and often in his career he was criticized by \"pure\" country musicians for his jazz influences. He also said on many occasions that he did not like being called a \"country guitarist\", insisting that he was a guitarist, period. Although he played \"by ear\" and was a masterful improviser, he was able to read music and even performed some classical guitar pieces. When Roger C. Field, a friend, suggested to him in 1991 that he record and perform with a female singer, he did so with Suzy Bogguss.\n\nHe returned to his country roots for albums he recorded with Mark Knopfler and Jerry Reed. Knopfler had long mentioned Atkins as one of his earliest influences. Atkins also collaborated with Australian guitar legend Tommy Emmanuel. On being asked to name the ten most influential guitarists of the twentieth century, he named Django Reinhardt to the first position, and also placed himself on the list.[http://www.misterguitar.com/news/chetsten.html Official Web Site of Chet Atkins]. Accessed on August 27, 2014.\n\nIn later years, he even went back to radio, appearing on Garrison Keillor's Prairie Home Companion radio program, on American Public Media radio, even picking up a fiddle from time to time, and performing songs such as Bob Wills' \"Corrina, Corrina\" and Willie Nelson's \"Seven Spanish Angels\" with Nelson on a 1985 broadcast of the show at the Bridges Auditorium on the campus of Pomona College (then Claremont College).\n\nDeath and legacy\n\nAtkins received numerous awards, including 14 Grammy awards and nine Country Music Association awards for Instrumentalist of the Year. In 1993, he was honored with the Grammy Lifetime Achievement Award. Billboard magazine awarded him its Century Award, its \"highest honor for distinguished creative achievement\", in December 1997.[https://www.rollingstone.com/artists/chetatkins/biography \"Biography – Chet Atkins\"]. Rolling Stone. Accessed on May 10, 2008.\n\nAtkins is notable for his broad influence. His love for numerous styles of music can be traced from his early recording of the stride pianist James P. Johnson's \"Johnson Rag\", all the way to the rock stylings of Eric Johnson, an invited guest on Atkins's recording sessions, who, when Atkins attempted to copy his influential rocker \"Cliffs of Dover\", led to Atkins's creation of a unique arrangement of \"Londonderry Air (Danny Boy)\".\n\nAtkins's recordings of \"Malagueña\" inspired a new generation of flamenco guitarists; the classical guitar selections included on almost all his albums were, for many American artists working in the field today, the first classical guitar they ever heard. He recorded smooth jazz guitar still played on American airwaves today.\n\nAtkins continued performing in the 1990s, but his health declined after he was diagnosed again with cancer in 1996. He died on June 30, 2001, at his home in Nashville, Tennessee, ten days after his 77th birthday.[http://archives.cnn.com/2001/SHOWBIZ/Music/07/02/obit.chet.atkins/index.html \"Obituary\"] , CNN, July 2, 2001 Accessed June 21, 2008 His memorial service was held at Ryman Auditorium in Nashville. He was buried at Harpeth Hills Memory Gardens in Nashville.[https://www.findagrave.com/memorial/23366 Chet Atkins at Find a Grave.] Accessed November 24, 2010\n\nA stretch of Interstate 185 in southwest Georgia (between LaGrange and Columbus) is named \"Chet Atkins Parkway\". This stretch of interstate runs through Fortson, where Atkins spent much of his childhood.\n\nIn 2002, Atkins was posthumously inducted into the Rock and Roll Hall of Fame. His award was presented by Marty Stuart and Brian Setzer and accepted by Atkins's grandson, Jonathan Russell. The following year, Atkins ranked number 28 in Country Music Television's \"40 Greatest Men of Country Music\".\n\nAt the age of 13, the future jazz guitarist Earl Klugh was captivated watching Atkins's guitar playing on The Perry Como Show. Similarly, he was a big influence on Doyle Dykes. Atkins also inspired Drexl Jonez and Tommy Emmanuel.[http://www.tommyemmanuel.com/bio/ Tommy Emmanuel official website biography.] Retrieved September 2009.\n\nClint Black's album Nothin' but the Taillights includes the song \"Ode to Chet\", which includes the lyrics \"'Cause I can win her over like Romeo did Juliet, if I can only show her I can almost pick that legato lick like Chet\" and \"It'll take more than Mel Bay 1, 2, & 3 if I'm ever gonna play like CGP.\" Atkins played guitar on the track. At the end of the song, Black and Atkins had a brief conversation.\n\nChet's song \"Jam Man\" is currently used in commercials for Esurance.\n\nThe opening guitar licks to the Miranda Lambert song \"Only Prettier\" sound very similar to Atkins's guitar-picking style.\n\nIn 1967, a tribute song, \"Chet's Tune\", was produced for his birthday, with contributions by a long list of RCA Victor artists, including Eddy Arnold, Connie Smith, Jerry Reed, Willie Nelson, Hank Snow, and others. The song was written by the Nashville songwriter Cy Coben, a friend of Atkins's. The single reached number 38 on the country charts.Billboard, June 3, 1967, p. 41.McClellan, John; Bratic, Deyan. Chet Atkins in Three Dimensions: 50 Years of Legendary Guitar, vol. 1. Pacific, MO: Mel Bay Publications. pp. 47–49.\n\nIn 2009, Steve Wariner released an album entitled My Tribute to Chet Atkins. One song from that record, \"Producer's Medley\", featured Wariner's recreation of several famous songs which Atkins both produced and performed. \"Producer's Medley\" won the Grammy for Best Country Instrumental Performance in 2010.\n\nIn November 2011, Rolling Stone ranked Atkins number 21 on their list of the \"100 Greatest Guitarists of All Time\".[https://www.rollingstone.com/music/lists/100-greatest-guitarists-20111123/chet-atkins-20111122 \"Chet Atkins\"]. Rolling Stone.\n\nDiscography\n\nIndustry awards\n\nCountry Music Association\n*1967 Instrumentalist of the Year\n*1968 Instrumentalist of the Year\n*1969 Instrumentalist of the Year\n*1981 Instrumentalist of the Year\n*1982 Instrumentalist of the Year\n*1983 Instrumentalist of the Year\n*1984 Instrumentalist of the Year\n*1985 Instrumentalist of the Year\n*1988 Instrumentalist of the Year\n\nCountry Music Hall of Fame and Museum\n*Inducted in 1973\n\nGrammy Awards\n*1971 Best Country Instrumental Performance with Jerry Reed – Me and Jerry\n*1972 Best Country Instrumental Performance – \"Snowbird\"\n*1975 Best Country Instrumental Performance with Merle Travis – The Atkins-Travis Traveling Show\n*1976 Best Country Instrumental Performance – \"The Entertainer\"\n*1977 Best Country Instrumental Performance with Les Paul – Chester and Lester\n*1982 Best Country Instrumental Performance – Country After All These Years\n*1986 Best Country Instrumental Performance with Mark Knopfler – \"Cosmic Square Dance\"\n*1991 Best Country Instrumental Performance with Mark Knopfler – \"So Soft, Your Goodbye\"\n*1991 Best Country Vocal Collaboration  with Mark Knopfler – \"Poor Boy Blues\"\n*1993 Best Country Instrumental Performance with Jerry Reed – Sneakin' Around\n*1993 Grammy Lifetime Achievement Award'\n*1994 Best Country Instrumental Performance with Asleep at the Wheel, Eldon Shamblin, Johnny Gimble, Marty Stuart, Reuben \"Lucky Oceans\" Gosfield & Vince Gill – \"Red Wing\"\n*1995 Best Country Instrumental Performance – \"Young Thing\"\n*1997 Best Country Instrumental Performance – \"Jam Man\"\n\nRock and Roll Hall of Fame\n*Inductees of the Rock and Roll Hall of Fame. Chet Atkins. http://en.wikipedia.org/?curid=7756."
  }
}
