{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2216",
  "eid" : "bee3a880-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778400008,
  "textBody" : "Abu Sayyaf (; ; ', ASG; ), unofficially known as the Islamic State of Iraq and the Levant – Philippines Province, is a Jihadist militant group that follows the Wahhabi doctrine of Sunni Islam based in and around Jolo and Basilan islands in the southwestern part of the Philippines, where for more than four decades, Moro groups have been engaged in an insurgency for an independent province in the country. The group is considered violent, and was responsible for the Philippines' worst terrorist attack, the bombing of Superferry 14 in 2004, which killed 116 people.\nThe name of the group is derived from the Arabic abu () (\"father of\"), and sayyaf () (\"swordsmith\").[https://www.fbi.gov/pressrel/pressrel06/mostwantedterrorists022406.htm FBI Updates Most Wanted Terrorists and Seeking Information – War on Terrorism Lists], FBI national Press Release, 24 February 2006  As of 2012, the group was estimated to have between 200 and 400 members, down from 1,250 in 2000. They use mostly improvised explosive devices, mortars, and automatic rifles.\n\nSince its inception in 1991, the group has carried out bombings, kidnappings, assassinations, and extortion\nin what they describe as their fight for an independent Islamic province in the Philippines. They have also been involved in criminal activities, including kidnapping, rape, child sexual assault, forced marriage, drive-by shootings, extortion, and drug trafficking,\nand the goals of the group \"appear to have alternated over time between criminal objectives and a more ideological intent\".\n\nThe group has been designated as a terrorist group by the United Nations, Australia, Canada, Indonesia, Japan, Malaysia, the Philippines, United Arab Emirates, the United Kingdom, and the United States. From 15 January 2002 – 24 February 2015, fighting Abu Sayyaf became a mission of the American military's Operation Enduring Freedom and part of the Global War on Terrorism. and  and and  Several hundred United States soldiers were stationed in the area to mainly train local forces in counter-terror and counter-guerrilla operations, but, as a status of forces agreement and under Philippine law, they were not allowed to engage in direct combat.\n\nThe group was founded by Abdurajak Abubakar Janjalani, and led after his death in 1998 by his younger brother Khadaffy Janjalani who was killed in 2006. On 23 July 2014, Abu Sayyaf leader Isnilon Hapilon swore an oath of loyalty to Abu Bakr al-Baghdadi, the leader of ISIL. In September 2014, the group began kidnapping people to ransom, in the name of ISIL.\n\nBackground and history\n\nIn the early 1970s, the Moro National Liberation Front (MNLF) was the main Muslim rebel groups fighting in Basilan and Mindanao in the southern Philippines. Abdurajik Abubakar Janjalani, the older brother of Khadaffy Janjalani, had been a teacher from Basilan, who later studied Islamic theology and Arabic in Libya, Syria and Saudi Arabia during the 1980s. Abdurajik then went to Afghanistan to fight against the Soviet Union and the Afghan government during the Soviet war in Afghanistan in the 1980s. During that period, he is alleged to have met Osama Bin Laden and been given $6 million to establish a more Islamic group with the MNLF in the southern Philippines, made up of members of the extant MNLF. By then, as a political solution in the southern Philippines, the Autonomous Region in Muslim Mindanao was established in 1989. Both Abdurajik Abubakar and his younger brother who succeeded him were natives of Isabela City, currently one of the poorest cities of the Philippines. Located on the North-Western part of the island of Basilan, Isabela is also the capital of Basilan province, across the Isabela Channel from the Malamwi Island. But Isabela City is administered under the Zamboanga Peninsula political region north of the island of Basilan, while the rest of the island province of Basilan is now (since 1996) governed as part of the Autonomous Region in Muslim Mindanao (ARMM) to the east.\n\nAbdurajik Abubakar Janjalani leadership (1989–1998)\n\nMNLF had moderated into an established political government, the ARMM. It was established in 1989, fully institutionalised by 1996 and which eventually became the ruling government in southern Mindanao. When Abdurajik Abubakar Janjalani returned home to Basilan island in 1990, he gathered radical members of the old MNLF who wanted to resume armed struggle for an independent Islamic state and in 1991 established the Abu Sayyaf. Janjalani was provided some funding by a Saudi Islamist, Mohammed Jamal Khalifa, who came to the Philippines in 1987 or 1988 and was head of the Philippine branch of the International Islamic Relief Organization foundation. A defector from Abu Sayyaf told Filipino authorities, \"The IIRO was behind the construction of Mosques, school buildings and other livelihood projects\" but only \"in areas penetrated, highly influenced and controlled by the Abu Sayyaf.\" According to the defector \"Only 10 to 30% of the foreign funding goes to the legitimate relief and livelihood projects and the rest go to terrorist operations\".Zachary Abuza, \"[https://www.jstor.org/stable/25798639 Funding Terrorism in Southeast Asia: The Financial Network of Al Qaeda and Jemaah Islamiyah],\" The National Bureau of Asian Research 14, no. 5 (December 2003): 176.\n Khalifa had married a local woman, Alice \"Jameelah\" Yabo.\n\nBy 1995 Abu Sayyaf was active in large scale bombings and attacks in the Philippines. The Abu Sayyaf's first attack was the assault on the town of Ipil in Mindanao in April 1995. This year also marked the escape of 20-year-old Khadaffy Janjalani from Camp Crame in Manila along with another member named Jovenal Bruno. On 18 December 1998, Abdurajik Abubakar Janjalani was killed in a gun battle with the Philippine National Police on Basilan Island. He is thought to have been about age 39 at the time of his death. The death of Aburajik Abubakar Janjalani marked a turning point in Abu Sayyaf operations, shifting from its ideological focus to more general kidnappings, murders and robberies, as the younger brother Khadaffy Janjalani succeeded Abdurajak. Consequently, being on the social or political division line, Basilan, Jolo and Sulu have seen some of the fiercest fighting between government troops and the Muslim separatist group Abu Sayyaf through the early 1990s. The Abu Sayyaf primarily operates in the southern Philippines with members travelling to Manila and other provinces in the country. It was reported that Abu Sayyaf had begun expanding into neighbouring Malaysia and Indonesia by the early 1990s. The Abu Sayyaf is one of the smallest, but strongest of the Islamist separatist groups in the Philippines. Some Abu Sayyaf members have studied or worked in Saudi Arabia and developed ties to mujahadeen while fighting and training in the war against the Soviet invasion of Afghanistan. Abu Sayyaf proclaimed themselves as mujahideen and freedom fighters but are not supported by many people in the Philippines including its Muslim clerics.\n\nKhadaffy Janjalani leadership (1999–2007)\n\nUntil his death in a gunbattle on 4 September 2006, Khaddafy Janjalani was considered the nominal leader of the group by the Armed Forces of the Philippines.\nThe 23-year-old Khadaffy Janjalani then took leadership of one of Abu Sayyaf's factions in an internecine struggle. He then worked to consolidate his leadership of the Abu Sayyaf, causing the group to appear inactive for a period. After Janjalani's leadership was secured, the Abu Sayyaf began a new strategy, as they proceeded to take hostages. The group's motive for kidnapping became more financial than religious during the period of Khadaffy's leadership, according to locals in the areas associated with Abu Sayyaf. The hostage money is probably the method of financing of the group.\n\nThe group expanded its operations to Malaysia in 2000 when it abducted foreigners from two resorts. This action was condemned by most leaders in the Islamic world. It was also responsible for the kidnapping and murder of more than 30 foreigners and Christian clerics and workers, including Martin and Gracia Burnham. A commander named Abu Sabaya was killed in 2002 while trying to evade forces. Galib Andang, one of the leaders of the group, was captured in Sulu in December 2003. An explosion at a military base in Jolo on 18 February 2006 was blamed on Abu Sayyaf by Brig. General Alexander Aleo, an Army officer. Khadaffy Janjalani was indicted in the United States District Court for the District of Columbia for his alleged involvement in terrorist attacks, including hostage taking by Abu Sayyaf and murder, against United States nationals and other foreign nationals in and around the Republic of the Philippines. Consequently, on 24 February 2006, Janjalani was among six fugitives in the second and most recent group of indicted fugitives to be added to the FBI Most Wanted Terrorists list along with two fellow members of the Abu Sayyaf, including Isnilon Totoni Hapilon and Jainal Antel Sali Jr.\n\nOn 13 December 2006, it was reported that Abu Sayyaf members may have been planning attacks during the Association of Southeast Asian Nations (ASEAN) summit in the Philippines. The group was reported to have been training alongside Jemaah Islamiyah militants. The plot was reported to have involved detonating a car bomb in Cebu City where the summit was scheduled to take place. On 27 December, the Philippine military reported that Janjalani's remains had been recovered near Patikul, in Jolo in the southern Philippines and that DNA tests had been ordered to confirm the discovery. He was allegedly shot in the neck in an encounter with government troops on September on Luba Hills, Patikul town in Sulu.\n\nPresent time (2010–present)\n\nIn a video published in the summer of 2014, senior Abu Sayyaf leader Isnilon Hapilon and other masked men swore their allegiance or \"bay'ah\" to Abu Bakr al-Baghdadi, the \"Islamic State\" (ISIL) caliph. \"We pledge to obey him on anything which our hearts desire or not and to value him more than anyone else. We will not take any emir (leader) other than him unless we see in him any obvious act of disbelief that could be questioned by Allah in the hereafter.\" For many years prior to this Islamic State's competitor, al-Qaeda, had the support of Abu Sayyaf \"through various connections.\" Observers were sceptical of whether the pledge would lead to Abu Sayyaf becoming an ISIS outpost in Southeast Asia, or was simply a way for the group to taking advantage of the international publicity Islamic State is getting.\n\nSupporters and funding\n\nAbdurajik Abubakar Janjalani's first recruits were soldiers of the Moro National Liberation Front (MNLF) and the Moro Islamic Liberation Front (MILF). However, both MNLF and MILF deny having any links with Abu Sayyaf. Both officially distance themselves from Abu Sayyaf because of its attacks on civilians and its supposed profiteering. The Philippine military, however, has claimed that elements of both groups provide support to the Abu Sayyaf. The group was originally not thought to receive funding from outside sources, but intelligence reports from the United States, Indonesia and Australia have found intermittent ties to the Indonesian Jemaah Islamiyah terrorist group, and the Philippine government considers the Abu Sayyaf as a part of Jemaah Islamiyah. The government also notes that initial funding for ASG in the 1990s came from al-Qaeda through the brother-in-law of Osama bin Laden, Mohammed Jamal Khalifa, through Islamic charities in the region.\n\nAl-Qaeda-affiliated terrorist Ramzi Yousef operated in the Philippines in the mid-1990s and trained Abu Sayyaf soldiers. The 2002 edition of the United State Department's Patterns of Global Terrorism mention links to Al-Qaeda. Continuing ties to Islamist groups in the Middle East indicate that al-Qaeda may be continuing support. As of mid 2005, Jemaah Islamiyah personnel reportedly had trained about 60 Abu Sayyarf cadre in bomb assembling and detonations.Mogato, Manny, \"Philippine rebels linking up with foreign jihadist.\" Reuters News, 21 August 2005.Del Puerto, Luige A. \"PNP [Philippine National Police]: Alliance of JI, RP terrorists strong.\" Philippines Daily Inquirer (internet version), 20 November 2005\n\nFunding\n\nThe group obtains most of its financing through ransom and extortion. One report estimated its revenues from ransom payments in 2000 alone between $10 and $25 million. According to the State Department, it may also receive funding from radical Islamic benefactors in the Middle East and South Asia. It was reported that Libya facilitated ransom payments to Abu Sayyaf. Libya was also suggested that Libyan money could possibly be channelled to Abu Sayyaf. Russian intelligence agencies connected with Victor Bout's planes have reportedly provided Abu Sayyaf with arms.[http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?id\n88499&lngen The deadly convenience of Victor Bout]. ISN Eth Zurich. 24 June 2008[https://www.theguardian.com/world/2009/mar/06/viktor-bout-background Background: the life of Viktor Bout]. The Guardian. 6 March 2009 In 2014 and since, kidnapping for ransom has been the primary means of funding.\n\nThe chart below collects events that Abu Sayyaf received ransoms or payments that are euphemistically called \"board and lodgings\". The more detailed information can be seen in the Timeline of Abu Sayyaf attacks.\n\nMotivation, beliefs, targets\n\nFilipino Islamist guerillas such as Abu Sayyaf, have been described as \"rooted in a distinct class made up of closely knit networks built through marriage of important families through socioeconomic backgrounds and family structures,\" according to Michael Buehler, a lecturer in comparative politics at the University of London's School of Oriental and African Studies. This tight-knit, familial structure provides resilience but also limits their ability to expand. The commander of the Philippines military's Western Mindanao Command Lieutenant General Rustico Guerrero, also describes Abu Sayyaf as \"a local group with a local agenda.\" Two kidnapping victims, (Martin and Gracia Burnham) who were kept in captivity by ASG for over a year, \"gently engaged their captors in theological discussion\" and found Abu Sayyaf fighters to be unfamiliar with the Qur'an. They had only \"a sketchy\" notion of Islam, which they saw as \"a set of behavioural rules, to be violated when it suited them\", according to author Mark Bowden. As \"holy warriors, they were justified in kidnapping, killing and stealing. Having sex with women captives was justified by their claiming them as \"wives\".\n\nUnlike the Moro Islamic Liberation Front and Moro National Liberation Front, the group is not recognised by the Organisation of Islamic Cooperation, and according to author Dr Robert (Bob) East, was seen as \"nothing more than a criminal operation\" at least prior to 2001. A Center for Strategic and International Studies report by Jack Fellman notes the political rather than religious motivation of ASG. He quotes ASG leader Khadaffy Janjalain's statement that his brother (the former leader of ASG) was right to split from the more moderate MNLF because \"up to now, nothing came out\" of attempts to gain more autonomy for Moro Muslims. This suggests, Fellman believes, that ASG \"is merely the latest, albeit most violent, iteration of Moro political dissatisfaction that has existed for the last several decades\".\n\nSome Abu Sayyaf members are also \"shabu\" (methamphetamine) users as been revealed from surviving hostages who saw Abu Sayyaf members taking shabu as well from military findings who found drug packets in many of the abandoned Abu Sayyaf nests that justified their motivation as extreme like criminals and terrorists than truly fighting for religion and their region future. Although if one Abu Sayyaf spokesman claimed he is representing the whole group, its spokesman also lack of knowledge of the activities on other members as the group was separated into many small group with their own leader just like the MNLF as been discovered by a Malaysian journalist, who see the spokesman known as Abu Rami seems did not know the news of their fellow members deaths.\n\nTargets\n\nMost of the Abu Sayyaf victims have been Filipinos; however, in recent years (especially from 2011 onwards), Australian, British, Canadian, Chinese, Dutch, French, German, Indonesian, Japanese, Korean, Malaysian, Norwegian, Swiss and Vietnamese nationals have also been captured or attacked.\n\nPreviously, Americans seem to have been particularly targeted for political and nationalistic reasons. An unnamed spokesman for the Abu Sayyaf allegedly stated on an unspecified date, \"We have been trying hard to get an American because they may think we are afraid of them\". He added, \"We want to fight the American people\".\n\nIn 1993, Abu Sayyaf kidnapped an American Bible translator in the southern Philippines. In 2000, Abu Sayyaf captured an American Muslim visiting Jolo and demanded that the United States release Sheikh Omar Abdel Rahman and Ramzi Yousef, who were jailed for their involvement in the 1993 World Trade Center bombing in New York City.\n\nBetween March 2016 - July 2017, the majority of Abu Sayyaf kidnap for ransom operations shifted to the high seas. Seventeen ships were boarded and some sixty-five hostages from six countries were taken. In total, thirty hostages have been released (usually after a ransom was paid), seven escaped, three were rescued by Philippine security forces, and four were executed.  Two others were killed during the attacks while eight seamen escaped during the shipjackings. An additional forty seamen were not taken hostage.\n\nCrimes and terrorism\n\nAbu Sayyaf has carried out numerous bombings, kidnappings, assassinations, and extortion activities in what they describe as their fight for an independent Islamic province in the Philippines. These include the 2000 Sipadan kidnappings, the 2001 Dos Palmas kidnappings and the 2004 SuperFerry 14 bombing.\n\nKidnappings\n\nAlthough the group has engaged in kidnapping hostages to be exchanged for ransom for many years, this means of funding grew dramatically beginning in 2014, providing funds for the group's rapid growth.\n\nIn the Philippines\n\nJournalists abducted since 2000\n\nABS-CBN's Newsbreak reported that Abu Sayyaf abducted at least 20 journalists from 2000 - 2008 (mostly foreign journalists), and all of them were eventually released upon payment of ransom.The journalists held captive are listed below.\n \n# GMA-7 television reporter Susan Enriquez (April 2000, Basilan, a few days);\n# 10 Foreign journalists (7 German, 1 French, 1 Australian and 1 Danish, in May 2000, Jolo, for 10 hours);\n# German Andreas Lorenz of the magazine Der Spiegel (July 2000, Jolo, for 25 days; he was also kidnapped in May);\n# French television reporter Maryse Burgot and cameraman Jean-Jacques Le Garrec and sound technician Roland Madura (July 2000, Jolo, for 2 months);\n# ABS-CBN television reporter Maan Macapagal and cameraman Val Cuenca (July 2000, Jolo, for 4 days);\n# Philippine Daily Inquirer contributor and Net 25 television reporter Arlyn de la Cruz (January 2002, Zamboanga, for 3 months)\n# GMA-7 television reporter Carlo Lorenzo and cameraman Gilbert Ordiales (September 2002, Jolo, for 6 days).\n# Filipino Ces Drilon and news cameramen Jimmy Encarnacion and Angelo Valderrama released unharmed after ransom paid (June 2008 Maimbung, Sulu for 9 days).\n\nJournalists abducted since 2010\n\n# Jordanian TV journalist Baker Atyani and his two Filipino crew were kidnapped in June 2012 by the Abu Sayyaf militants they had sought to interview in the jungles of Sulu province. The two crew were freed in February 2013. Al Arabiya News Channel stated that their correspondent, Atyani, was handed over to the local governor's office on 4 December 2013. However, police and military officials could not ascertain whether Atyani had escaped from his captors or was freed.\n\nJeffrey Schilling\n\nOn 31 August 2000, American citizen and Muslim convert Jeffrey Schilling from Oakland, California was captured on Jolo by Abu Sayyaf while visiting a terrorist camp with his new wife, Ivy Osani (a cousin of Abu Sabaya, one of the rebel leaders), whom he had met online. The Abu Sayyaf Group demanded a $10 million ransom for Schilling's release. Rebels also sarcastically threatened to behead him in 2001 as a \"birthday present\" to then Philippine President Gloria Macapagal Arroyo, who responded by declaring \"all-out war\" on them. The beheading threat was withdrawn after Schilling's mother, Carol, flew to the Philippines and appealed for mercy on local radio. On 12 April 2001, Philippine soldiers raided a rebel camp and rescued the American. The United States praised the Philippine government for freeing Schilling.\n\nMany commentators have been critical of Schilling who claims to have walked willingly into the camp after being invited by his wife's cousin, a member of Abu Sayyaf.\n\nSchilling was one of more than forty hostages taken by Abu Sayyaf in 2000, including twenty-one tourists and workers seized in a raid on Sipadan diving resort in neighbouring Malaysia. Many of the hostages were released after Libya paid millions of dollars. A Libyan official stated that Schilling had visited the Jolo camp often before his capture. Philippine intelligence sources say he was interested in selling military equipment to the rebels, while the bandits accused him of being a CIA agent. Abu Sayyaf had threatened several times to kill Schilling. At one stage, Schilling reportedly went on a hunger strike to win his freedom.\n\nMartin and Gracia Burnham\n\nOn 27 May 2001, an Abu Sayyaf raid kidnapped about 20 people from Dos Palmas, an expensive resort in Honda Bay, to the north of Puerto Princesa City on the island of Palawan, which had been \"considered completely safe\". The most \"valuable\" of the hostages were three North Americans, Martin and Gracia Burnham, a missionary couple, and Guillermo Sobero, a Peruvian-American tourist who was later beheaded by Abu Sayyaf, for whom Abu Sayyaf demanded $1 million in ransom. The hostages and hostage-takers then returned hundreds of kilometres back across the Sulu Sea to the Abu Sayyaf's territories in Mindanao.\"Manhunt\" by Mark Bowden, The Atlantic, March 2007, p.54 (15) According to author Mark Bowden, the leader of the raid was Abu Sabaya. According to Gracia Burnham, she told her husband \"to identify his kidnappers\" to authorities \"as 'the Osama bin Laden Group,' but Burnham was unfamiliar with that name and stuck with\" Abu Sayyaf. After returning to Mindanao, Abu Sayyaf operatives conducted numerous raids, including one that culminated in the Siege of Lamitan and \"one at a coconut plantation called Golden Harvest; they took about 15 people captive there and later used bolo knives to hack the heads off two men. The number of hostages waxed and waned as some were ransomed and released, new ones were taken and others were killed.\"\n\nOn 7 June 2002, about a year after the raid, Philippine army troops conducted a rescue operation in which two of the three hostages held, Martin Burnham and Filipino nurse, Ediborah Yap, were killed. The remaining hostage was wounded and the hostage takers escaped. In July 2004, Gracia Burnham testified at a trial of eight Abu Sayyaf members and identified six of the suspects as being her erstwhile captors, including Alhamzer Limbong, Abdul Azan Diamla, Abu Khari Moctar, Bas Ishmael, Alzen Jandul, and Dazid Baize. \"The eight suspects sat silently during her three-hour testimony, separated from her by a wooden grill. They face the death sentence if found guilty of kidnapping for ransom. The trial began this year and is not expected to end for several months.\" Alhamzer Limbong was later killed in a prison uprising.\"[http://www.graciaburnham.org/index.asp?sec=3_1 Philippines Brace for Retaliation] \" 15 March 2005, Associated Press. Gracia Burnham has claimed that Philippine military officials were colluding with her captors, saying that the Armed Forces of the Philippines \"didn't pursue us...As time went on, we noticed that they never pursued us\".\n\n2007 Father Bossi kidnapping\n\nOn 10 June 2007, Italian priest Reverend Giancarlo Bossi was kidnapped near Pagadian, capital of Zamboanga del Sur Province in the southern Philippines. Even Pope Benedict XVI made an appeal to the abductors to free him. Bossi was released on 19 July 2007 at Karumatan, a Muslim town in Lanao del Norte Province, allegedly after the payment of ransom. Father Bossi died in Italy on 23 September 2012.\n\n2009 Red Cross kidnapping\n\nOn 15 January 2009, Abu Sayyaf kidnapped International Committee of the Red Cross (ICRC) delegates in Patikul, Sulu province, Philippines. The three ICRC workers had finished conducting field work in Sulu province, located in the southwest of the country, when they were abducted by an unknown group, later confirmed as Abu Sayyaf leader Albader Parad's group. Parad himself was said to be involved in the kidnapping. All three workers were eventually released. According to a CNN story, Parad was reportedly killed, along with five other militants, in an assault raid by Philippine marines in Sulu province on Sunday, 21 February 2010.\n\n2009 Irish priest kidnapping\n\nOn 11 October 2009, Irish Catholic missionary Michael Sinnott, aged 79, from Barntown County Wexford was kidnapped from a gated compound in Pagadian, capital of Zamboanga del Sur Province in the southern Philippines by armed men, suspected to be part of the Al Qaeda-linked Abu Sayyaf and some renegade members of the Moro Islamic Liberation Front. Six kidnappers forced the priest into a mini-van and drove towards Sta. Lucia (district), where they transferred to a boat. Sinnott had a heart condition and was without medication when abducted. In early November, a demand for $US2 million ransom was made by video. On 11 November 2009, Father Sinnott was released in Zamboanga City. The Department of Foreign Affairs (Ireland) claimed that no ransom was paid by the Irish Government.\n\n2010 Japanese treasure hunter\n\nOn 16 July 2010, Japanese national Toshio Ito was kidnapped from Pangutaran, Sulu. At one point, the Philippine police believed the \"treasure hunter,\" a Muslim convert also known by his Muslim name Mamaito Katayama, was being used as a cook for Abu Sayyaf; however, this was disputed by other nations, including the United States, which includes him on its list of kidnap victims. A classified document obtained by Rappler lists Ito first, saying he was held captive by Abu Sayyaf’s most senior leader, Radullan Sahiron, in Langpas, Indanan, Sulu early in 2013.\n\n2011 Malaysian gecko trader\n\nOn 8 May 2011, Malaysian gecko trader Mohammad Nasauddin Bin Saidin was kidnapped while hunting for gecko (tuko) in Indanan, Sulu. Saidin was freed on 12 May 2012.\n\n2011 Indian national kidnapping\n\nOn 22 June 2011, Indian national Biju Kolara Veetil was captured by four armed men while visiting his Filipina wife’s relatives on the island of Jolo.  A $10 million ransom was demanded. Veetil later denied that he was released in August 2012 because he had fully converted to Islam during captivity.\n\nWarren Rodwell \n\n \nWarren Richard Rodwell (born 16 June 1958 Homebush NSW) a former soldier in the Australian Army, and university English teacher, grew up in Tamworth NSW. He was shot through the right hand when seized from his home at Ipil, Zamboanga Sibugay on the island of Mindanao in the southern Philippines on 5 December 2011 by Abu Sayyaf (ASG) militants. Rodwell later had to have a finger amputated.\n\nThe ASG threatened to behead Rodwell if their ransom demand for $US2 million was not paid.Portal:Current events/2012 January 5 Both the Philippine and Australian governments had strict policies of refusing to pay ransoms. Australia formed a multi-agency task force to assist the Philippine authorities, and liaise with Rodwell's family. A news blackout was imposed. Filipino politicians helped negotiate the release. After the payment of $AUD94,000 for \"board and lodging\" expenses by his siblings, Rodwell was released 472 days later on 23 March 2013. The incumbent Australian prime minister praised the Philippines government for securing Rodwell's release. Tribute was also made to Australian officials from the Department of Foreign Affairs, the Australian Federal Police and Defence. Rodwell subsequently returned to Australia. His appearances in media include a news conference at Manila airport, Today Tonight - an Australian current affairs television program,https://www.linkedin.com/pulse/today-tonight-hostage-horror-warren-rodwell Today - an Australian breakfast television program, Sunday Profile - An Australian national radio interview program, The Independent - a British online newspaper, The Globe and Mail - a Canadian newspaper, and Vice News - Canada.,\n\nAs part of the 2015 Australia Day Honours, Australian Army Lieutenant Colonel Paul Joseph Barta was awarded the Conspicuous Service Cross (CSC) for outstanding devotion to duty as the Assistant Defence Attaché Manila during the Australian whole of government response to the Rodwell kidnap for ransom (and immediately following, the devastation of Typhoon Haiyan). At the 2015 Australian Federal Police Foundation Day award ceremony in Canberra, fourteen AFP members received the Commissioners’ Group Citation for Conspicuous Conduct for their work in support of the Philippine National Police and Australian Government efforts to release Australian man Warren Rodwell. By the end of his 15 months as a hostage in the Autonomous Region in Muslim Mindanao, Rodwell had lost about 30 kilograms in weight due to starvation, In popular culture, Blue Mountains (Sydney) techno Cowpunk band Mad Cowboy Disease composed, performed and released songs written by Rodwell, based on his ordeal ; Situation Not Normal, Our Sibling Hearts and Eyes of Lies\n\nRodwell's biography 472 Days Captive of the Abu Sayyaf - The Survival of Australian Warren Rodwell by independent researcher Dr Robert (Bob) East was published by Cambridge Scholars Publishing, United Kingdom (2015) . A subsequent book review by Assistant Professor Francis C. Domingo was published by Ateneo de Manila University in the journal Philippine Studies: Historical and Ethnographic Viewpoints - Volume 64, Number 2 (June 2016)  (Pages 317 - 320). Domingo states that the biography's main contribution lies in the operational methods and practices of the Abu Sayyaf Group, as well as a focus on the physical, mental, and psychological aspects of Rodwell’s survival techniques. In April 2017, the incumbent Australian Prime Minister officially declared the Rodwell incident as an overseas act of terrorism, referring to it as \"December 2011 - March 2013 Mindanao, Philippines kidnapping\".\n\nAward-winning Filipino journalist and CEO of Rappler, Maria A. Ressa wrote at some length about the Warren Rodwell case in the 2013 international edition of her Imperial College Press - published book From Bin Laden to Facebook: 10 Days of Abduction, 10 Years of Terrorism  (Refer to Pages 265 - 271) Crowdsourcing for ransom, and social media (such as, Facebook and YouTube) were used by Abu Sayyaf during negotiations. The author asserts on Page 270; \"Social media is changing what was once a closed dialogue between kidnappers, their victims and governments.\" Also, Colonel (reserve) in the Israel Defence Forces and research fellow at the International Institute for Counter-Terrorism (ICT), Dr Shaul Shay, analysed the Warren Rodwell terror abduction in: Global Jihad and The Tactic of Terror Abduction : A Comprehensive Review of Islamic Terrorist Organisations.  (Refer to Chapter 10) (Sussex Academic Press).\n\nCounter-terrorism analyst Dr Edward Mickolus wrote in Terrorism, 2013-2015: A Worldwide Chronology . (Pp 218 & 530) (McFarland & Company publisher) of the arrest on 16 June 2014 of two Abu Sayyaf suspects, Jimmy Nurilla (alias Doc) and Bakrin Haris. Both reportedly worked under Basilan-based Abu Sayyaf leader Khair Mundos and Furuji Indama. Authorities believed Nurilla and Haris took part in the kidnapping of Australian Warren Rodwell in 2011, as well as USA citizen Gerfa Yeatts Lunsman and her son Kevin in 2012.\n\nIn January 2015, Mindanao Examiner newspaper reported the arrest of Barahama Ali kidnap gang sub-leaders linked to the kidnapping of Warren Rodwell, who was seized by at least 5 gunmen (disguised as policemen), and eventually handed over or sold by the kidnappers to the Abu Sayyaf in Basilan province. In May, ex-Philippine National Police (PNP) officer Jun A. Malban, alias Michael Zoo, was arrested in Kota Kinabalu, Malaysia, for the crime of \"Kidnapping for Ransom\" after Rodwell identified him as the negotiator/spokesperson of the Abu Sayyaf Group during his captivity. Further PNP investigation revealed that Malban is the cousin of Abu Sayyaf leaders Khair Mundos and his brother Borhan Mundos. (Both were arrested in 2014). The director of the Anti-Kidnapping Group (AKG) stated that Malban's arrest resulted from close co-ordination by the PNP, National Bureau of Investigation (Philippines) and Presidential Anti-Organized Crime Commission with the Malaysian counterparts and through Interpol. In January 2018, Rodwell attended a court hearing for Malban and others in Ipil, Zamboanga Sibugay, pursuant to a Supreme Court petition to transfer his case for security reasons to a court in either Manila or Zamboanga City.\n\nIn August 2015, Edeliza Sumbahon Ulep, alias Gina Perez, was arrested at Trento, Agusan del Sur during a joint manhunt operation by police and military units. Ulep was tagged as the ransom courier of the Abu Sayyaf bandits in Zamboanga Sibugay in the kidnapping of Rodwell.\n\nIn August 2016, The Manila Times reported the arrest of the kidnap-for-ransom group of Barahama Alih sub-leader, Hasim Calon alias Husien (also a notorious provincial drug dealer), in his hideout in Tenan village in Ipil town. Hasim Calon was involved in the abduction of Warren Rodwell. Earlier in 2016, police forces killed Waning Abdulsalam. a former leader of the Moro Islamic Liberation Front, in the village of Singkilon in the town of Naga, Zamboanga Sibugay. Abdulsalam was one of the most wanted criminals in southern Philippines, and connected also to the Abu Sayyaf. He was linked to the kidnappings of Rodwell in 2011, Irish missionary Michael Sinnott in 2009 in Pagadian City, and Italian Catholic priest Giancarlo Bossi in Zamboanga del Sur’s Payao town in 2007.\n\n2012 European bird watchers\n\nOn 1 February 2012, two European bird watchers were seized by Abu Sayyaf militants on Tawi Tawi island in the southern Philippines. Swiss Lorenzo Vinciguerra escaped in December 2014 as government troops attacked the jungle camp he was being held on the island of Jolo. Vinciguerra was shot by rebels as he escaped; however, injuries sustained were non-life-threatening.  Dutch captive Ewold Horn was reportedly 'very sick and very weak' and unable to escape. The whereabouts of Horn remains unknown.\n\n2012 Mayor Jeffrey Lim Kidnapping\n\nOn 2 April 2012, Mayor Jeffrey Lim of Salug, Zamboanga del Norte was kidnapped by ten armed men disguised as policemen while having dinner with his family near a bus terminal. Lim was reportedly handed over to Abu Sayyaf. On 6 November, he was freed near Zamboanga City after payment of P1.3M ($US25,000) ransom. On 9 August 2013, a Mindanao Pagadian Frontline report named a \"Sehar Muloc\" aka \"Red Eye\" as a suspect in the 2012 kidnapping of Mayor Jeffrey Lim. Abner Gumandol, alias Sehar Muloc and Red Eye, was said to be the leader of a criminal syndicate called the Muloc Group. Gumandol was arrested on 12 June 2016.\n\n2014 Kabasalan ZSP kidnapping\n\nOn 11 September 2014,  Chinese national Li Pei Zhei was abducted by four gunmen in Kabasalan, Zamboanga Sibugay and taken to Basilan province. He was released in Sitio Lugay-Lugay, Barangay Naga-Naga, Alicia, Zamboanga Sibugay on 5 November 2014. Police subsequently charged Ibni Basaludin, Yug Enriquez, Brahama Ali, and Ging-Ging Calon, all residents of Barangay Tenan, Ipil, Zamboanga Sibugay with kidnapping with serious illegal detention.\n\n2015 Roseller Lim ZSP kidnapping\n\nOn 24 January 2015, Korean national Nwi Seong Hong was abducted by armed men in Roseller Lim, Zamboanga Sibugay Province in the southern Philippines. The victim’s son, Abby, managed to escape after he fought off the kidnappers.  According to highly placed intelligence information from the JTG-SULU, the captors of Nwi Seong Hong were allegedly Algabsy Misaya, Idang Susukan, Alden Bagade and Mohammad Salud alias Ama Maas, Indanan-based members of the Abu Sayyaf group led by sub-leaders Isang Susukan and Anga Adji. On 31 October 2015, the body of 74 year old Nwi Seong Hong was found near Sulu State College in Barangay Bangkal, Patikul, Sulu. Investigators said the victim died due to severe illness while being held by his abductors in the municipality of Indanan. Hong's body was then left near the school after his death.\n\n2015 Samal Island kidnappings\n\nOn 21 September 2015, Canadians Robert Hall and John Ridsdel, as well as Norwegian Kjartan Sekkingstad, and (Hall's girlfriend) Marites Flor; a Filipino woman, were all abducted from an upscale resort complex on the Philippine island of Samal near Davao in south eastern Mindanao. Ridsdel was beheaded by Abu Sayyaf on 25 April 2016 following a ransom deadline. ASG reportedly demanded more than $8.1 million for Ridsdel and the others. Former Canadian politician Bob Rae (and friend of Ridsdel), worked with the family to try to secure his release. Rae stated that the Canadian government was \"very directly involved\" in helping Ridsdel's family deal with the kidnappers.  Abu Sayyaf refused to lower their demand.\n\nOn 3 May 2016, a video of the Ridsdel execution was released, along with a new set of demands for the remaining hostages. A masked captor said, \"Note to the Philippine government and to the Canadian government: The lesson is clear. John Ridsdel has been beheaded. Now there are three remaining captives here. If you procrastinate once again the negotiations, we will behead this all anytime\".\n\nOn 15 May, media reports advised that Canadian Robert Hall had appeared in a new video, announcing that he and Norwegian Kjartan Sekkingstad would be decapitated at 3pm on Monday 13 June 2016 if a ransom of $16 million is not paid. Both hostages wore orange coveralls, similar to hostages in videos produced by ISIL, to which Abu Sayyaf had previously pledged allegiance. The deadline passed. Robert Hall was beheaded.\n\nCanadian newspaper Toronto Star published (from 30 November - 7 December 2016) \"Held Hostage\", an eight-part investigation into what really happens when a Canadian is taken hostage abroad. The Star revealed \"a system ripe for overhaul\", and ways Canada can change its approach, so it may be more effectively prepared in future.\n\nOn 24 June, Abu Sayyaf released Filipina Marites Flor. She was subsequently flown to Davao to meet President-elect Rodrigo Duterte. Duterte said he directed negotiations with the Abu Sayyaf. He did not elaborate.\n\nOn 17 September 2016, remaining hostage Norwegian Kjartan Sekkingstad was released on Jolo island. Abu Ramie, an ASG spokesman, claimed $638,000 was paid as ransom. Sekkingstad subsequently returned to Norway.\n\n2015 Dipolog City kidnapping\n\nOn 7 October 2015, Italian national and pizza restaurant owner Rolando del Torchio was kidnapped in Dipolog City, capital of Zamboanga del Norte Province in the southern Philippines. On 8 April 2016, Del Torchio was released and found at Jolo port aboard MV KC Beatrice bound for Zamboanga City after his family paid P29 million ($US650,000) in ransom.\n\nIn Malaysia\n\n2000 Sipadan kidnappings\n\nOn 3 May 2000, Abu Sayyaf guerillas occupied the Malaysian dive resort island Sipadan and took 21 hostages, including 10 tourists and 11 resort workers – 19 non-Filipino nationals in total. The hostages were taken to an Abu Sayyaf base in Jolo, Sulu. Two Muslim Malaysians were released soon after, however Abu Sayyaf made various demands for the release of several prisoners, including 1993 World Trade Center bomber Ramzi Yousef and $2.4 million. In July, a Filipino television evangelist and 12 of members of the Jesus Miracle Crusade Church offered their help and went as mediators for the relief of other hostages. They, three French television crew members and a German journalist, all visiting Abu Sayyaf on Jolo, were also taken hostage. Most hostages were released in August and September 2000, partly due to mediation by Libyan leader Muammar Gaddafi and an offer of $25 million in \"development aid\".\n\nAbu Sayyaf conducted a second raid on the island of Pandanan near Sipadan on 10 September and seized three more Malaysians. The Philippine army launched a major offensive on 16 September 2000, rescuing all remaining hostages, except Filipino dive instructor Roland Ullah. He was eventually freed in 2003. Abu Sayyaf coordinated with the Chinese 14K Triad gang in carrying out the kidnappings. The 14K Triad has militarily supported Abu Sayyaf.\n\n2013 Pom Pom kidnappings\n\nOn 15 November 2013, Abu Sayyaf militants raided a resort on a Malaysian island of Pom Pom in Semporna, Sabah. During the ambush, Taiwanese citizen Chang An-wei was kidnapped and her husband, Hsu Li-min, was killed. Chang was taken to the Sulu Archipelago in the southern Philippines. Gene Yu, an American and former US Army Special Forces captain was instrumental in negotiating, locating and working to free Taiwanese citizen Chang An-wei from Abu Sayyaf militants with Filipino special forces and private security contractors in 2013. Chang was freed in Sulu Province and returned to Taiwan on 21 December.\n\n2014 Singamata, Baik Island & Kampung Air Sapang kidnappings\n\nOn 2 April 2014, a kidnap gang believed to originate from Abu Sayyaf militants raided Singamata Reef Resort off Semporna, Sabah. Chinese tourist Gao Huayun from Shanghai and Filipino resort worker Marcy Dayawan were abducted and taken to the Sulu Archipelago. The two hostages were later rescued after a collaboration between Malaysian and Philippines security forces.\n\nOn 6 May, five Abu Sayyaf gunmen raided a Malaysian fish farm on Baik Island Sabah, kidnapped the fish farm manager and took him to Jolo island. He was later freed in July with the help of Malaysian negotiators.\n\nOn 16 June, two gunmen believed to be from Abu Sayyaf kidnapped another Chinese fish farm manager and one Filipino worker in Kampung Air Sapang, Kunak, Sabah. The Filipino fish farm worker managed to escape and went missing. Meanwhile, the fish farm manager was taken to Jolo. He was later released on 10 December.\n\nMalaysian authorities have identified five Filipinos, the \"Muktadir brothers\", as being behind all of the above kidnapping cases. They then sell their hostages to the Abu Sayyaf group.\n\nOf the five Muktadil brothers: Mindas Muktadil was killed by Philippine police in Jolo in May 2015, Kadafi Muktadil was arrested in late 2015, Nixon Muktadil and Brown Muktadil were killed during an operation by the Philippine military on 27 September 2016 after they resisted arrest, while Badong Muktadil succumbed to his injuries during his run after being shot at the time his brothers was killed. His body was discovered in a pump boat in Mususiasi area in Siasi Island, close to Jolo.\n\n2015 Ocean King Restaurant kidnappings\n\nOn 15 May 2015, four armed Abu Sayyaf members kidnapped two Malaysian nationals from Ocean King Restaurant in an upscale resort in Sandakan, Sabah and took them to Parang, Sulu. Police identified the leaders of the group behind the abduction as Alhabsy Misaya, Alden Bagade and Angah Adji. On 8 November, Thien Nyuk Fun, the seafood restaurant owner, was released  after payment of 30 million pesos ($US675,000) ransom. The initial agreement of 30 million pesos was reportedly for both hostages; however, a faction within the Abu Sayyaf Group demanded more after Thien Nyuk Fun was released. Further negotiations broke down and the other hostage, electrical engineer Bernard Then, was beheaded on Jolo Island on 17 November.\n\nPhilippines and Malaysia waters\n\n2014 German sailors kidnapping\n\nIn April 2014, Germans Dr. Stefan Viktor Okonek and Henrike Dielen were captured on their yacht on the high seas near Borneo. Abu Sayyaf threatened to behead one of them. After payment of $US5.6 million in October 2014, the pair were released in Patikul, Sulu.\n\n2016 Local and foreign sailors kidnappings\n\nOn 26 March 2016, ten Indonesian seafarers were held hostage by Islamist militant group Abu Sayyaf operating in Sulu Archipelago in the southern Philippines. The ten crew members were abducted from the Brahma 12 tugboat and the Anand 12 barge — carrying 7,500 tons of coal  — near the country's southernmost Tawi-Tawi province. The Indonesian vessels were freighting coal from South Borneo heading for Batangas port when hijacked near Sulu waters. In April, the Indonesian government announced that the company that owned tugboat Brahma 12 had agreed to pay the 50-million-peso ($1 million) ransom demanded for the release of the ten crew members. On 2 May, the ten Indonesians were released.\n\nOn 1 April, four Malaysian sailors aboard a tugboat from Manila were kidnapped when they arrived near the shore of Ligitan Island. Their companions, three Myanmar nationals and two Indonesians, were unharmed. On 8 June, the four Malaysian hostages were released.\n\nOn 15 April, another four Indonesian sailors were kidnapped when two Indonesian tugboats from Cebu, Henry and Cristi carrying ten passengers, were attacked by Abu Sayyaf militants. While five of the passengers were safe, one was injured after being shot, but he was rescued by operatives from the Malaysian Maritime Enforcement Agency (MMEA) when the vessels arrived in Malaysian waters. The four abductees were released on 11 May with the help of the Philippine government. A group of concerned Filipinos in Sabah urged then Philippine president-elect Rodrigo Duterte to intervene for the release of four Malaysians held hostage by Abu Sayyaf. The issue strained the relationship between the Philippines and Malaysia, and affected the lives of Filipinos in Sabah.\n\nOn 21 June, seven Indonesian sailors were kidnapped while aboard a tugboat passing through the Sulu Archipelago.\n\nOn 9 July, three Indonesian fishermen were kidnapped near the coast of Lahad Datu, Sabah, Malaysia  and released on 17 September.\n\nOn 18 July, five Malaysian sailors were abducted near the coast of Lahad Datu.\n\nOn 3 August, an Indonesian sailor was kidnapped in the waters of Malaysia  while leaving two other crew members unharmed. This incident was only reported by victims on 5 August. Two of the Indonesian sailor hostages managed to escape from the Abu Sayyaf after receiving persistent threats of beheading.\n\nOn 10 September, three Filipino fishermen were kidnapped on the shores of Pom Pom Island in Sabah, Malaysia.\n\nOn 22 September, another Indonesian hostage was released.\n\nOn 27 September, one Malaysian boat-skipper was kidnapped from his trawler by seven armed Filipino militants before the group attacked another Indonesian trawler; however, no kidnappings were committed in the second incident. The boat-skipper was released on 1 October, with no ransom having been asked, along with three Indonesians hostages that were released the same day.\n\nOn 21 October, approximately ten Abu Sayyaf militants attacked a South Korean-bound vessel named MV Dongbang Gian and abducted a South Korean skipper and a Filipino crewman off Bongao, Tawi-Tawi.\n\nOn 5 November, German sailor Sabine Merz was shot dead while her husband Jürgen Kantner was abducted by Abu Sayyaf militants from their yacht off Tanjong Luuk Pisuk in Sabah. On or before 27 February 2017, Kantner was beheaded after a ransom of 30 million pesos ($US600,000) was not met.\n\nOn 11 November, a Vietnamese vessel MV Royale 16 with nineteen sailors on board was attacked by Abu Sayyaf near Basilan, abducting six sailors and injuring one.  The remaining thirteen sailors were released.\n\nOn 20 November, two Indonesian fishermen were kidnapped by five Abu Sayyaf gunmen off Lahad Datu, Sabah, while Philippine military were informed to intercept the bandits.\n\nDue to the increase of attacks against foreign vessels by Abu Sayyaf, the governments of Indonesia, Malaysia and the Philippines agreed to jointly patrol their waters on 5 May 2016. The three countries also signed another agreement on joint air patrols.\n\nDuring the first six months of 2016, Abu Sayyaf made $7.3 million, equivalent to Php 353 million, from ransom payoffs according to a Philippine government report.\n\nBeheadings\n\nAs part of its kidnap-for-ransom operations, the Abu Sayyaf has executed some of their male hostages if ransom demands were not being met. The group had also previously beheaded Christian civilians and other non-believers of Islam without raising any ransoms for their release, simply due to religious affiliation.\n\nBombings\n\n2004 Superferry 14 Bombing\n\nSuperferry 14 was a large ferry destroyed by a bomb on 27 February 2004, killing 116 people in the Philippines' worst terrorist attack and the world's deadliest terrorist attack at sea. On that day, the 10,192 ton ferry sailed out of Manila with about 900 passengers and crew on board. A television set filled with 8 lb. (4 kilograms) of TNT had been placed on board. 90 minutes out of port, the bomb exploded. 63 people were killed instantly and 53 went missing and presumed dead. Despite claims from terrorist groups, the blast was initially thought to have been an accident caused by a gas explosion. However, after divers righted the ferry five months after it had sunk, they found evidence of a bomb blast. A man called Redendo Cain Dellosa also admitted to planting the bomb on board for Abu Sayyaf. Philippine president Gloria Macapagal-Arroyo announced on 11 October 2004 that investigators had concluded the explosion was caused by a bomb. She said six suspects had been arrested in connection with the bombing and that the masterminds, Khadaffy Janjalani and Abu Sulaiman, have been killed. Despite being shed by two of its leaders, the ASG would continue to pose a threat to Philippine security.\n\n2016 Davao City bombing\n\nOn 2 September 2016, an explosion occurred at a night market in Davao City, Philippines resulting in at least 15 deaths and 70 injuries. Shortly before the bombing, the Abu Sayyaf has make a threat following the intensified military operation against them. The Abu Sayyaf through one of its spokesperson Abu Rami have claimed responsibility on the attack according to a report released by local radio station, DZMM.  The spokesman later denied the report and any of their involvement in the bombing, saying a group that allied to them; the Daulat Ul-Islamiya who responsible to the attack. Although the Abu Sayyaf spokesman have denied their involvement, the Philippine government have put the blame on Abu Sayyaf based on a statement by the country President that stated:\n\nCriticism of attacks against civilians\n\nCondemnation from Muslim countries and organisations\n\nSheikh Yusuf al-Qaradawi in Qatar has denounced the kidnapping and killings committed by the Abu Sayyaf towards civilians and foreigners, asserting that they are not part of the dispute between the Abu Sayyaf and the Philippines government. He stated that it is shameful to commit such acts in the name of the Islamic faith, saying that such acts produce backlashes against Islam and Muslims worldwide. During the 2000 Sipadan kidnappings, the Organisation of the Islamic Conference (OIC) condemned the kidnapping and offered to help secure their release. OIC Secretary General Azeddine Laraki who represents the world's largest Islamic body, told the Philippine government he was prepared to send an envoy to help save the hostages and issued a statement condemning the rebels. \"The Secretary General has pointed out that this operation and the like are rejected by divine laws and that they are neither the appropriate nor correct means to resolve conflicts\", the statement said.\n\nThe terrorism to innocent civilians committed by Abu Sayyaf have been condemned by fellow Moro separatists of MNLF and MILF who said the Abu Sayyaf have gone too far from their real paths of struggle, with MILF labelling Abu Sayyaf as \"anti-Islam\" soon after the beheading of Canadian hostage John Ridsdel in 2016. While MNLF describing the group as \"causing chaos to their community\". Both Christian and Muslim groups in the Philippines also strongly condemning the Abu Sayyaf beheading habits.\n\nThe rampant kidnappings have also been heavily criticised by Indonesia. On 14 July 2016, a group of Indonesian protesters gathered in front of the Philippine Embassy in Indonesia, holding banners that read \"Go to hell Philippines and Abu Sayyaf\" and \"Destroy the Philippines and Abu Sayyaf\" due to what was seen as the lack of action from the Philippine government who seems cannot defeating the militant on its own and protecting foreign citizens. The group demanding there should be a large scale military operation to destroy the Abu Sayyaf, of which the Indonesian military before also have proposing to sent their military to Philippines but were rejected by the Philippine government, citing it is against their constitution.\n\nMilitary operation against Abu Sayyaf\n\nThe Philippine military has been engaging the Abu Sayyaf since 1990s as part of its operation in Mindanao. Under the administration of President Rodrigo Duterte, the Philippine government are interested to make a peace agreement with the Moro separatists of MNLF and MILF, while the Abu Sayyaf are excluded as they was seen no more than a \"bunch of criminals\" who terrorise innocent civilians. The Philippine government has pledged to destroy the group to maintain the peace in Mindanao. The Philippine military has intensified their operation more since 2003 following the arrest of a Filipino-American who been alleged to have selling illegal weapons to the group. The suspect has been tagged by the United States authorities as \"one of the United States most wanted fugitives\" which he was then deported by the Philippine government to facing legal action in the United States.\n\nOn 29 July 2016, the Philippine military gained control of one of the Abu Sayyaf strongholds in Tipo-Tipo, Basilan. The Philippine military has pledged that they will continue with more major operations to eliminate the Abu Sayyaf group. The Philippine security forces also collaborating with neighbouring Malaysia and Indonesia to maintains the security in the Sulu Sea. On 25 August, President Duterte ordered the group to be \"destroyed\" after a teenager was beheaded by the extremist group. Since the incident, the Philippine military sent thousands more troops to fight and destroy the Abu Sayyaf. The Filipino Army Major Filemon Tan said, \"The order of the president is to search and destroy the Abu Sayyaf so that’s what we are doing\". Both MNLF and MILF also have since helping the government forces to suppress extremism in Mindanao which affecting the peace process for both groups as both want to end their decades wars.\n\nThe Indonesian government have proposing before to stationed their army in Mindanao to launch major operation in the southern Philippines to destroy the Abu Sayyaf. The Indonesian government has calling both Malaysian and Philippine armies to launch a combined land attacks together on Mindanao in every Abu Sayyaf nests to wipe them out, while at the same time urging the Philippine government to give a law relaxation to both Indonesia and Malaysia military forces to enter the Philippines territory. The Vietnamese military has also start to holding military exercise and precaution against the Abu Sayyaf (more known locally as \"pirates\" by the Vietnamese) following the repeat kidnappings of Malaysian and Indonesian sailors by the group. As the Abu Sayyaf is divided between different leaders, the Philippine military has provided one battalion to go against each group. On 9 September, following the meeting between President Duterte and Indonesian President of Joko Widodo, an agreement was reached to pursue the Abu Sayyaf for their persistent terrorism. The Philippine President said in a statement:\n\nHowever, despite the permission that have been granted by the Philippine government, the government of Indonesia decided to not launching any military operation to southern Philippines, citing the reason was due to there have been enough military personnel been deployed by the Philippine government, with the Malaysian side also shared the similar view to not sending their armies. The Philippine military chief Ricardo Visaya had warned the Abu Sayyaf that they will continue with more further major military operation to stop the rampant lawlessness in the southern Philippines islands. The military chief had giving a notice to any Abu Sayyaf members to surrender or \"neutralised\", a term that means getting killed, apprehended or arrested. A mayor in Sumisip of Basilan has support the calling, saying:\n\nThis was responded by around 20 Abu Sayyaf who have surrender and giving their arms to the Philippine military in Sumisip on 22 September. A day before, the Philippine armed forces confiscated a total of 200 speedboats used by the Abu Sayyaf in Basilan, Sulu, Tawi-Tawi and Zamboanga. President Duterte have reminded that there will be \"no amnesty\" for Abu Sayyaf despite a proposal by Nur Misuari, the leader of MNLF to include Abu Sayyaf in peace talks as the group have killed too many innocent peoples. The President has told that he will stick to his position for the group to be destroyed. On 27 September, another largest attempt for the smuggling of weapons to the Abu Sayyaf group were busted by the Philippine National Police in San Juan City, Philippines with the arrestment of four people. Until 14 October, the Philippine military has launched 579 massive military operations, 426 of which were focused \"to neutralise\" the group members. Of all the total operations, 54 lead to armed engagements resulting to 56 Abu Sayyaf members been killed, 21 surrendered, 17 arrested while 94 being neutralised.\n\nThe total Abu Sayyaf fatalities then increase to 102, with seven more apprehended and a total of 130 been neutralised. Among the notable Abu Sayyaf leaders killed during the ongoing operations including Nelson Muktadil, Braun Muktadil, their sub-leader Mohammad Said, Jamiri Jawhari, Musanna Jamiri, the group spokesman Abu Rami and Alhabsy Misaya. In addition, another 165 fast boats that being used by the Abu Sayyaf for their transport and for their kidnappings activities were also confiscated by the military. Until 13 April 2017, a total of 50 more members of the Abu Sayyaf group have surrendered to the Philippine authorities. In the same month, the Philippine authorities also discovered the presence of more foreign militants from Indonesia and Malaysia that was killed during the ongoing operations (especially since the killings of notable militants such as Sanusi, Zulkifli Abdhir, Ibrahim Ali, Mohd Najib Husen and Mohisen) as well the presence of \"traitor\" among their security members when a top policewoman was caught for her ties with the group. Indonesia admits the presence of its citizen who became militants in the southern Philippines who depart from the areas of North Sulawesi and said they could not prevent them following the lack of security in their borders, while Malaysia discovered the militants using Sabah as a transit point to the southern Philippines. The two have pledge to prevent cross-border terrorism and curbing the activities of militants in their territories, with a major co-operation operation of the two countries with the Philippines will be launched in May 2017.\n\nEarly on 26 November 2016, Duterte stated that he will open to peace talks with the Abu Sayyaf group (as he did with the MNLF and MILF by offering federalism as a possible solution) while continue fighting against the Maute group, a move that were criticised by Philippine analyst as it would be used by extreme rebels to claim for legitimacy as a group. In a statement, the President said:\n\nHis statements were also criticised by the country media as leading to a confusion whether he want to make peace talks with the group that have taken so many innocent lives or continue fighting against them, with the Philippine government have been criticised for unable to stop the rampant lawlessness in Mindanao until this day especially with the formation of another IS-linked group, the Maute.  On 7 December, Duterte told the Indonesian and Malaysian leaders that \"they can bomb the Abu Sayyaf along with the hostages if the Abu Sayyaf continue to present persistent threats and the hostages should already know that there is repeated warnings to not go there\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Abu Sayyaf" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2216" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Abu Sayyaf (; ; ', ASG; ), unofficially known as the Islamic State of Iraq and the Levant – Philippines Province, is a Jihadist militant group that follows the Wahhabi doctrine of Sunni Islam based in and around Jolo and Basilan islands in the southwestern part of the Philippines, where for more than four decades, Moro groups have been engaged in an insurgency for an independent province in the country. The group is considered violent, and was responsible for the Philippines' worst terrorist attack, the bombing of Superferry 14 in 2004, which killed 116 people.\nThe name of the group is derived from the Arabic abu () (\"father of\"), and sayyaf () (\"swordsmith\").[https://www.fbi.gov/pressrel/pressrel06/mostwantedterrorists022406.htm FBI Updates Most Wanted Terrorists and Seeking Information – War on Terrorism Lists], FBI national Press Release, 24 February 2006  As of 2012, the group was estimated to have between 200 and 400 members, down from 1,250 in 2000. They use mostly improvised explosive devices, mortars, and automatic rifles.\n\nSince its inception in 1991, the group has carried out bombings, kidnappings, assassinations, and extortion\nin what they describe as their fight for an independent Islamic province in the Philippines. They have also been involved in criminal activities, including kidnapping, rape, child sexual assault, forced marriage, drive-by shootings, extortion, and drug trafficking,\nand the goals of the group \"appear to have alternated over time between criminal objectives and a more ideological intent\".\n\nThe group has been designated as a terrorist group by the United Nations, Australia, Canada, Indonesia, Japan, Malaysia, the Philippines, United Arab Emirates, the United Kingdom, and the United States. From 15 January 2002 – 24 February 2015, fighting Abu Sayyaf became a mission of the American military's Operation Enduring Freedom and part of the Global War on Terrorism. and  and and  Several hundred United States soldiers were stationed in the area to mainly train local forces in counter-terror and counter-guerrilla operations, but, as a status of forces agreement and under Philippine law, they were not allowed to engage in direct combat.\n\nThe group was founded by Abdurajak Abubakar Janjalani, and led after his death in 1998 by his younger brother Khadaffy Janjalani who was killed in 2006. On 23 July 2014, Abu Sayyaf leader Isnilon Hapilon swore an oath of loyalty to Abu Bakr al-Baghdadi, the leader of ISIL. In September 2014, the group began kidnapping people to ransom, in the name of ISIL.\n\nBackground and history\n\nIn the early 1970s, the Moro National Liberation Front (MNLF) was the main Muslim rebel groups fighting in Basilan and Mindanao in the southern Philippines. Abdurajik Abubakar Janjalani, the older brother of Khadaffy Janjalani, had been a teacher from Basilan, who later studied Islamic theology and Arabic in Libya, Syria and Saudi Arabia during the 1980s. Abdurajik then went to Afghanistan to fight against the Soviet Union and the Afghan government during the Soviet war in Afghanistan in the 1980s. During that period, he is alleged to have met Osama Bin Laden and been given $6 million to establish a more Islamic group with the MNLF in the southern Philippines, made up of members of the extant MNLF. By then, as a political solution in the southern Philippines, the Autonomous Region in Muslim Mindanao was established in 1989. Both Abdurajik Abubakar and his younger brother who succeeded him were natives of Isabela City, currently one of the poorest cities of the Philippines. Located on the North-Western part of the island of Basilan, Isabela is also the capital of Basilan province, across the Isabela Channel from the Malamwi Island. But Isabela City is administered under the Zamboanga Peninsula political region north of the island of Basilan, while the rest of the island province of Basilan is now (since 1996) governed as part of the Autonomous Region in Muslim Mindanao (ARMM) to the east.\n\nAbdurajik Abubakar Janjalani leadership (1989–1998)\n\nMNLF had moderated into an established political government, the ARMM. It was established in 1989, fully institutionalised by 1996 and which eventually became the ruling government in southern Mindanao. When Abdurajik Abubakar Janjalani returned home to Basilan island in 1990, he gathered radical members of the old MNLF who wanted to resume armed struggle for an independent Islamic state and in 1991 established the Abu Sayyaf. Janjalani was provided some funding by a Saudi Islamist, Mohammed Jamal Khalifa, who came to the Philippines in 1987 or 1988 and was head of the Philippine branch of the International Islamic Relief Organization foundation. A defector from Abu Sayyaf told Filipino authorities, \"The IIRO was behind the construction of Mosques, school buildings and other livelihood projects\" but only \"in areas penetrated, highly influenced and controlled by the Abu Sayyaf.\" According to the defector \"Only 10 to 30% of the foreign funding goes to the legitimate relief and livelihood projects and the rest go to terrorist operations\".Zachary Abuza, \"[https://www.jstor.org/stable/25798639 Funding Terrorism in Southeast Asia: The Financial Network of Al Qaeda and Jemaah Islamiyah],\" The National Bureau of Asian Research 14, no. 5 (December 2003): 176.\n Khalifa had married a local woman, Alice \"Jameelah\" Yabo.\n\nBy 1995 Abu Sayyaf was active in large scale bombings and attacks in the Philippines. The Abu Sayyaf's first attack was the assault on the town of Ipil in Mindanao in April 1995. This year also marked the escape of 20-year-old Khadaffy Janjalani from Camp Crame in Manila along with another member named Jovenal Bruno. On 18 December 1998, Abdurajik Abubakar Janjalani was killed in a gun battle with the Philippine National Police on Basilan Island. He is thought to have been about age 39 at the time of his death. The death of Aburajik Abubakar Janjalani marked a turning point in Abu Sayyaf operations, shifting from its ideological focus to more general kidnappings, murders and robberies, as the younger brother Khadaffy Janjalani succeeded Abdurajak. Consequently, being on the social or political division line, Basilan, Jolo and Sulu have seen some of the fiercest fighting between government troops and the Muslim separatist group Abu Sayyaf through the early 1990s. The Abu Sayyaf primarily operates in the southern Philippines with members travelling to Manila and other provinces in the country. It was reported that Abu Sayyaf had begun expanding into neighbouring Malaysia and Indonesia by the early 1990s. The Abu Sayyaf is one of the smallest, but strongest of the Islamist separatist groups in the Philippines. Some Abu Sayyaf members have studied or worked in Saudi Arabia and developed ties to mujahadeen while fighting and training in the war against the Soviet invasion of Afghanistan. Abu Sayyaf proclaimed themselves as mujahideen and freedom fighters but are not supported by many people in the Philippines including its Muslim clerics.\n\nKhadaffy Janjalani leadership (1999–2007)\n\nUntil his death in a gunbattle on 4 September 2006, Khaddafy Janjalani was considered the nominal leader of the group by the Armed Forces of the Philippines.\nThe 23-year-old Khadaffy Janjalani then took leadership of one of Abu Sayyaf's factions in an internecine struggle. He then worked to consolidate his leadership of the Abu Sayyaf, causing the group to appear inactive for a period. After Janjalani's leadership was secured, the Abu Sayyaf began a new strategy, as they proceeded to take hostages. The group's motive for kidnapping became more financial than religious during the period of Khadaffy's leadership, according to locals in the areas associated with Abu Sayyaf. The hostage money is probably the method of financing of the group.\n\nThe group expanded its operations to Malaysia in 2000 when it abducted foreigners from two resorts. This action was condemned by most leaders in the Islamic world. It was also responsible for the kidnapping and murder of more than 30 foreigners and Christian clerics and workers, including Martin and Gracia Burnham. A commander named Abu Sabaya was killed in 2002 while trying to evade forces. Galib Andang, one of the leaders of the group, was captured in Sulu in December 2003. An explosion at a military base in Jolo on 18 February 2006 was blamed on Abu Sayyaf by Brig. General Alexander Aleo, an Army officer. Khadaffy Janjalani was indicted in the United States District Court for the District of Columbia for his alleged involvement in terrorist attacks, including hostage taking by Abu Sayyaf and murder, against United States nationals and other foreign nationals in and around the Republic of the Philippines. Consequently, on 24 February 2006, Janjalani was among six fugitives in the second and most recent group of indicted fugitives to be added to the FBI Most Wanted Terrorists list along with two fellow members of the Abu Sayyaf, including Isnilon Totoni Hapilon and Jainal Antel Sali Jr.\n\nOn 13 December 2006, it was reported that Abu Sayyaf members may have been planning attacks during the Association of Southeast Asian Nations (ASEAN) summit in the Philippines. The group was reported to have been training alongside Jemaah Islamiyah militants. The plot was reported to have involved detonating a car bomb in Cebu City where the summit was scheduled to take place. On 27 December, the Philippine military reported that Janjalani's remains had been recovered near Patikul, in Jolo in the southern Philippines and that DNA tests had been ordered to confirm the discovery. He was allegedly shot in the neck in an encounter with government troops on September on Luba Hills, Patikul town in Sulu.\n\nPresent time (2010–present)\n\nIn a video published in the summer of 2014, senior Abu Sayyaf leader Isnilon Hapilon and other masked men swore their allegiance or \"bay'ah\" to Abu Bakr al-Baghdadi, the \"Islamic State\" (ISIL) caliph. \"We pledge to obey him on anything which our hearts desire or not and to value him more than anyone else. We will not take any emir (leader) other than him unless we see in him any obvious act of disbelief that could be questioned by Allah in the hereafter.\" For many years prior to this Islamic State's competitor, al-Qaeda, had the support of Abu Sayyaf \"through various connections.\" Observers were sceptical of whether the pledge would lead to Abu Sayyaf becoming an ISIS outpost in Southeast Asia, or was simply a way for the group to taking advantage of the international publicity Islamic State is getting.\n\nSupporters and funding\n\nAbdurajik Abubakar Janjalani's first recruits were soldiers of the Moro National Liberation Front (MNLF) and the Moro Islamic Liberation Front (MILF). However, both MNLF and MILF deny having any links with Abu Sayyaf. Both officially distance themselves from Abu Sayyaf because of its attacks on civilians and its supposed profiteering. The Philippine military, however, has claimed that elements of both groups provide support to the Abu Sayyaf. The group was originally not thought to receive funding from outside sources, but intelligence reports from the United States, Indonesia and Australia have found intermittent ties to the Indonesian Jemaah Islamiyah terrorist group, and the Philippine government considers the Abu Sayyaf as a part of Jemaah Islamiyah. The government also notes that initial funding for ASG in the 1990s came from al-Qaeda through the brother-in-law of Osama bin Laden, Mohammed Jamal Khalifa, through Islamic charities in the region.\n\nAl-Qaeda-affiliated terrorist Ramzi Yousef operated in the Philippines in the mid-1990s and trained Abu Sayyaf soldiers. The 2002 edition of the United State Department's Patterns of Global Terrorism mention links to Al-Qaeda. Continuing ties to Islamist groups in the Middle East indicate that al-Qaeda may be continuing support. As of mid 2005, Jemaah Islamiyah personnel reportedly had trained about 60 Abu Sayyarf cadre in bomb assembling and detonations.Mogato, Manny, \"Philippine rebels linking up with foreign jihadist.\" Reuters News, 21 August 2005.Del Puerto, Luige A. \"PNP [Philippine National Police]: Alliance of JI, RP terrorists strong.\" Philippines Daily Inquirer (internet version), 20 November 2005\n\nFunding\n\nThe group obtains most of its financing through ransom and extortion. One report estimated its revenues from ransom payments in 2000 alone between $10 and $25 million. According to the State Department, it may also receive funding from radical Islamic benefactors in the Middle East and South Asia. It was reported that Libya facilitated ransom payments to Abu Sayyaf. Libya was also suggested that Libyan money could possibly be channelled to Abu Sayyaf. Russian intelligence agencies connected with Victor Bout's planes have reportedly provided Abu Sayyaf with arms.[http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?id\n88499&lngen The deadly convenience of Victor Bout]. ISN Eth Zurich. 24 June 2008[https://www.theguardian.com/world/2009/mar/06/viktor-bout-background Background: the life of Viktor Bout]. The Guardian. 6 March 2009 In 2014 and since, kidnapping for ransom has been the primary means of funding.\n\nThe chart below collects events that Abu Sayyaf received ransoms or payments that are euphemistically called \"board and lodgings\". The more detailed information can be seen in the Timeline of Abu Sayyaf attacks.\n\nMotivation, beliefs, targets\n\nFilipino Islamist guerillas such as Abu Sayyaf, have been described as \"rooted in a distinct class made up of closely knit networks built through marriage of important families through socioeconomic backgrounds and family structures,\" according to Michael Buehler, a lecturer in comparative politics at the University of London's School of Oriental and African Studies. This tight-knit, familial structure provides resilience but also limits their ability to expand. The commander of the Philippines military's Western Mindanao Command Lieutenant General Rustico Guerrero, also describes Abu Sayyaf as \"a local group with a local agenda.\" Two kidnapping victims, (Martin and Gracia Burnham) who were kept in captivity by ASG for over a year, \"gently engaged their captors in theological discussion\" and found Abu Sayyaf fighters to be unfamiliar with the Qur'an. They had only \"a sketchy\" notion of Islam, which they saw as \"a set of behavioural rules, to be violated when it suited them\", according to author Mark Bowden. As \"holy warriors, they were justified in kidnapping, killing and stealing. Having sex with women captives was justified by their claiming them as \"wives\".\n\nUnlike the Moro Islamic Liberation Front and Moro National Liberation Front, the group is not recognised by the Organisation of Islamic Cooperation, and according to author Dr Robert (Bob) East, was seen as \"nothing more than a criminal operation\" at least prior to 2001. A Center for Strategic and International Studies report by Jack Fellman notes the political rather than religious motivation of ASG. He quotes ASG leader Khadaffy Janjalain's statement that his brother (the former leader of ASG) was right to split from the more moderate MNLF because \"up to now, nothing came out\" of attempts to gain more autonomy for Moro Muslims. This suggests, Fellman believes, that ASG \"is merely the latest, albeit most violent, iteration of Moro political dissatisfaction that has existed for the last several decades\".\n\nSome Abu Sayyaf members are also \"shabu\" (methamphetamine) users as been revealed from surviving hostages who saw Abu Sayyaf members taking shabu as well from military findings who found drug packets in many of the abandoned Abu Sayyaf nests that justified their motivation as extreme like criminals and terrorists than truly fighting for religion and their region future. Although if one Abu Sayyaf spokesman claimed he is representing the whole group, its spokesman also lack of knowledge of the activities on other members as the group was separated into many small group with their own leader just like the MNLF as been discovered by a Malaysian journalist, who see the spokesman known as Abu Rami seems did not know the news of their fellow members deaths.\n\nTargets\n\nMost of the Abu Sayyaf victims have been Filipinos; however, in recent years (especially from 2011 onwards), Australian, British, Canadian, Chinese, Dutch, French, German, Indonesian, Japanese, Korean, Malaysian, Norwegian, Swiss and Vietnamese nationals have also been captured or attacked.\n\nPreviously, Americans seem to have been particularly targeted for political and nationalistic reasons. An unnamed spokesman for the Abu Sayyaf allegedly stated on an unspecified date, \"We have been trying hard to get an American because they may think we are afraid of them\". He added, \"We want to fight the American people\".\n\nIn 1993, Abu Sayyaf kidnapped an American Bible translator in the southern Philippines. In 2000, Abu Sayyaf captured an American Muslim visiting Jolo and demanded that the United States release Sheikh Omar Abdel Rahman and Ramzi Yousef, who were jailed for their involvement in the 1993 World Trade Center bombing in New York City.\n\nBetween March 2016 - July 2017, the majority of Abu Sayyaf kidnap for ransom operations shifted to the high seas. Seventeen ships were boarded and some sixty-five hostages from six countries were taken. In total, thirty hostages have been released (usually after a ransom was paid), seven escaped, three were rescued by Philippine security forces, and four were executed.  Two others were killed during the attacks while eight seamen escaped during the shipjackings. An additional forty seamen were not taken hostage.\n\nCrimes and terrorism\n\nAbu Sayyaf has carried out numerous bombings, kidnappings, assassinations, and extortion activities in what they describe as their fight for an independent Islamic province in the Philippines. These include the 2000 Sipadan kidnappings, the 2001 Dos Palmas kidnappings and the 2004 SuperFerry 14 bombing.\n\nKidnappings\n\nAlthough the group has engaged in kidnapping hostages to be exchanged for ransom for many years, this means of funding grew dramatically beginning in 2014, providing funds for the group's rapid growth.\n\nIn the Philippines\n\nJournalists abducted since 2000\n\nABS-CBN's Newsbreak reported that Abu Sayyaf abducted at least 20 journalists from 2000 - 2008 (mostly foreign journalists), and all of them were eventually released upon payment of ransom.The journalists held captive are listed below.\n \n# GMA-7 television reporter Susan Enriquez (April 2000, Basilan, a few days);\n# 10 Foreign journalists (7 German, 1 French, 1 Australian and 1 Danish, in May 2000, Jolo, for 10 hours);\n# German Andreas Lorenz of the magazine Der Spiegel (July 2000, Jolo, for 25 days; he was also kidnapped in May);\n# French television reporter Maryse Burgot and cameraman Jean-Jacques Le Garrec and sound technician Roland Madura (July 2000, Jolo, for 2 months);\n# ABS-CBN television reporter Maan Macapagal and cameraman Val Cuenca (July 2000, Jolo, for 4 days);\n# Philippine Daily Inquirer contributor and Net 25 television reporter Arlyn de la Cruz (January 2002, Zamboanga, for 3 months)\n# GMA-7 television reporter Carlo Lorenzo and cameraman Gilbert Ordiales (September 2002, Jolo, for 6 days).\n# Filipino Ces Drilon and news cameramen Jimmy Encarnacion and Angelo Valderrama released unharmed after ransom paid (June 2008 Maimbung, Sulu for 9 days).\n\nJournalists abducted since 2010\n\n# Jordanian TV journalist Baker Atyani and his two Filipino crew were kidnapped in June 2012 by the Abu Sayyaf militants they had sought to interview in the jungles of Sulu province. The two crew were freed in February 2013. Al Arabiya News Channel stated that their correspondent, Atyani, was handed over to the local governor's office on 4 December 2013. However, police and military officials could not ascertain whether Atyani had escaped from his captors or was freed.\n\nJeffrey Schilling\n\nOn 31 August 2000, American citizen and Muslim convert Jeffrey Schilling from Oakland, California was captured on Jolo by Abu Sayyaf while visiting a terrorist camp with his new wife, Ivy Osani (a cousin of Abu Sabaya, one of the rebel leaders), whom he had met online. The Abu Sayyaf Group demanded a $10 million ransom for Schilling's release. Rebels also sarcastically threatened to behead him in 2001 as a \"birthday present\" to then Philippine President Gloria Macapagal Arroyo, who responded by declaring \"all-out war\" on them. The beheading threat was withdrawn after Schilling's mother, Carol, flew to the Philippines and appealed for mercy on local radio. On 12 April 2001, Philippine soldiers raided a rebel camp and rescued the American. The United States praised the Philippine government for freeing Schilling.\n\nMany commentators have been critical of Schilling who claims to have walked willingly into the camp after being invited by his wife's cousin, a member of Abu Sayyaf.\n\nSchilling was one of more than forty hostages taken by Abu Sayyaf in 2000, including twenty-one tourists and workers seized in a raid on Sipadan diving resort in neighbouring Malaysia. Many of the hostages were released after Libya paid millions of dollars. A Libyan official stated that Schilling had visited the Jolo camp often before his capture. Philippine intelligence sources say he was interested in selling military equipment to the rebels, while the bandits accused him of being a CIA agent. Abu Sayyaf had threatened several times to kill Schilling. At one stage, Schilling reportedly went on a hunger strike to win his freedom.\n\nMartin and Gracia Burnham\n\nOn 27 May 2001, an Abu Sayyaf raid kidnapped about 20 people from Dos Palmas, an expensive resort in Honda Bay, to the north of Puerto Princesa City on the island of Palawan, which had been \"considered completely safe\". The most \"valuable\" of the hostages were three North Americans, Martin and Gracia Burnham, a missionary couple, and Guillermo Sobero, a Peruvian-American tourist who was later beheaded by Abu Sayyaf, for whom Abu Sayyaf demanded $1 million in ransom. The hostages and hostage-takers then returned hundreds of kilometres back across the Sulu Sea to the Abu Sayyaf's territories in Mindanao.\"Manhunt\" by Mark Bowden, The Atlantic, March 2007, p.54 (15) According to author Mark Bowden, the leader of the raid was Abu Sabaya. According to Gracia Burnham, she told her husband \"to identify his kidnappers\" to authorities \"as 'the Osama bin Laden Group,' but Burnham was unfamiliar with that name and stuck with\" Abu Sayyaf. After returning to Mindanao, Abu Sayyaf operatives conducted numerous raids, including one that culminated in the Siege of Lamitan and \"one at a coconut plantation called Golden Harvest; they took about 15 people captive there and later used bolo knives to hack the heads off two men. The number of hostages waxed and waned as some were ransomed and released, new ones were taken and others were killed.\"\n\nOn 7 June 2002, about a year after the raid, Philippine army troops conducted a rescue operation in which two of the three hostages held, Martin Burnham and Filipino nurse, Ediborah Yap, were killed. The remaining hostage was wounded and the hostage takers escaped. In July 2004, Gracia Burnham testified at a trial of eight Abu Sayyaf members and identified six of the suspects as being her erstwhile captors, including Alhamzer Limbong, Abdul Azan Diamla, Abu Khari Moctar, Bas Ishmael, Alzen Jandul, and Dazid Baize. \"The eight suspects sat silently during her three-hour testimony, separated from her by a wooden grill. They face the death sentence if found guilty of kidnapping for ransom. The trial began this year and is not expected to end for several months.\" Alhamzer Limbong was later killed in a prison uprising.\"[http://www.graciaburnham.org/index.asp?sec=3_1 Philippines Brace for Retaliation] \" 15 March 2005, Associated Press. Gracia Burnham has claimed that Philippine military officials were colluding with her captors, saying that the Armed Forces of the Philippines \"didn't pursue us...As time went on, we noticed that they never pursued us\".\n\n2007 Father Bossi kidnapping\n\nOn 10 June 2007, Italian priest Reverend Giancarlo Bossi was kidnapped near Pagadian, capital of Zamboanga del Sur Province in the southern Philippines. Even Pope Benedict XVI made an appeal to the abductors to free him. Bossi was released on 19 July 2007 at Karumatan, a Muslim town in Lanao del Norte Province, allegedly after the payment of ransom. Father Bossi died in Italy on 23 September 2012.\n\n2009 Red Cross kidnapping\n\nOn 15 January 2009, Abu Sayyaf kidnapped International Committee of the Red Cross (ICRC) delegates in Patikul, Sulu province, Philippines. The three ICRC workers had finished conducting field work in Sulu province, located in the southwest of the country, when they were abducted by an unknown group, later confirmed as Abu Sayyaf leader Albader Parad's group. Parad himself was said to be involved in the kidnapping. All three workers were eventually released. According to a CNN story, Parad was reportedly killed, along with five other militants, in an assault raid by Philippine marines in Sulu province on Sunday, 21 February 2010.\n\n2009 Irish priest kidnapping\n\nOn 11 October 2009, Irish Catholic missionary Michael Sinnott, aged 79, from Barntown County Wexford was kidnapped from a gated compound in Pagadian, capital of Zamboanga del Sur Province in the southern Philippines by armed men, suspected to be part of the Al Qaeda-linked Abu Sayyaf and some renegade members of the Moro Islamic Liberation Front. Six kidnappers forced the priest into a mini-van and drove towards Sta. Lucia (district), where they transferred to a boat. Sinnott had a heart condition and was without medication when abducted. In early November, a demand for $US2 million ransom was made by video. On 11 November 2009, Father Sinnott was released in Zamboanga City. The Department of Foreign Affairs (Ireland) claimed that no ransom was paid by the Irish Government.\n\n2010 Japanese treasure hunter\n\nOn 16 July 2010, Japanese national Toshio Ito was kidnapped from Pangutaran, Sulu. At one point, the Philippine police believed the \"treasure hunter,\" a Muslim convert also known by his Muslim name Mamaito Katayama, was being used as a cook for Abu Sayyaf; however, this was disputed by other nations, including the United States, which includes him on its list of kidnap victims. A classified document obtained by Rappler lists Ito first, saying he was held captive by Abu Sayyaf’s most senior leader, Radullan Sahiron, in Langpas, Indanan, Sulu early in 2013.\n\n2011 Malaysian gecko trader\n\nOn 8 May 2011, Malaysian gecko trader Mohammad Nasauddin Bin Saidin was kidnapped while hunting for gecko (tuko) in Indanan, Sulu. Saidin was freed on 12 May 2012.\n\n2011 Indian national kidnapping\n\nOn 22 June 2011, Indian national Biju Kolara Veetil was captured by four armed men while visiting his Filipina wife’s relatives on the island of Jolo.  A $10 million ransom was demanded. Veetil later denied that he was released in August 2012 because he had fully converted to Islam during captivity.\n\nWarren Rodwell \n\n \nWarren Richard Rodwell (born 16 June 1958 Homebush NSW) a former soldier in the Australian Army, and university English teacher, grew up in Tamworth NSW. He was shot through the right hand when seized from his home at Ipil, Zamboanga Sibugay on the island of Mindanao in the southern Philippines on 5 December 2011 by Abu Sayyaf (ASG) militants. Rodwell later had to have a finger amputated.\n\nThe ASG threatened to behead Rodwell if their ransom demand for $US2 million was not paid.Portal:Current events/2012 January 5 Both the Philippine and Australian governments had strict policies of refusing to pay ransoms. Australia formed a multi-agency task force to assist the Philippine authorities, and liaise with Rodwell's family. A news blackout was imposed. Filipino politicians helped negotiate the release. After the payment of $AUD94,000 for \"board and lodging\" expenses by his siblings, Rodwell was released 472 days later on 23 March 2013. The incumbent Australian prime minister praised the Philippines government for securing Rodwell's release. Tribute was also made to Australian officials from the Department of Foreign Affairs, the Australian Federal Police and Defence. Rodwell subsequently returned to Australia. His appearances in media include a news conference at Manila airport, Today Tonight - an Australian current affairs television program,https://www.linkedin.com/pulse/today-tonight-hostage-horror-warren-rodwell Today - an Australian breakfast television program, Sunday Profile - An Australian national radio interview program, The Independent - a British online newspaper, The Globe and Mail - a Canadian newspaper, and Vice News - Canada.,\n\nAs part of the 2015 Australia Day Honours, Australian Army Lieutenant Colonel Paul Joseph Barta was awarded the Conspicuous Service Cross (CSC) for outstanding devotion to duty as the Assistant Defence Attaché Manila during the Australian whole of government response to the Rodwell kidnap for ransom (and immediately following, the devastation of Typhoon Haiyan). At the 2015 Australian Federal Police Foundation Day award ceremony in Canberra, fourteen AFP members received the Commissioners’ Group Citation for Conspicuous Conduct for their work in support of the Philippine National Police and Australian Government efforts to release Australian man Warren Rodwell. By the end of his 15 months as a hostage in the Autonomous Region in Muslim Mindanao, Rodwell had lost about 30 kilograms in weight due to starvation, In popular culture, Blue Mountains (Sydney) techno Cowpunk band Mad Cowboy Disease composed, performed and released songs written by Rodwell, based on his ordeal ; Situation Not Normal, Our Sibling Hearts and Eyes of Lies\n\nRodwell's biography 472 Days Captive of the Abu Sayyaf - The Survival of Australian Warren Rodwell by independent researcher Dr Robert (Bob) East was published by Cambridge Scholars Publishing, United Kingdom (2015) . A subsequent book review by Assistant Professor Francis C. Domingo was published by Ateneo de Manila University in the journal Philippine Studies: Historical and Ethnographic Viewpoints - Volume 64, Number 2 (June 2016)  (Pages 317 - 320). Domingo states that the biography's main contribution lies in the operational methods and practices of the Abu Sayyaf Group, as well as a focus on the physical, mental, and psychological aspects of Rodwell’s survival techniques. In April 2017, the incumbent Australian Prime Minister officially declared the Rodwell incident as an overseas act of terrorism, referring to it as \"December 2011 - March 2013 Mindanao, Philippines kidnapping\".\n\nAward-winning Filipino journalist and CEO of Rappler, Maria A. Ressa wrote at some length about the Warren Rodwell case in the 2013 international edition of her Imperial College Press - published book From Bin Laden to Facebook: 10 Days of Abduction, 10 Years of Terrorism  (Refer to Pages 265 - 271) Crowdsourcing for ransom, and social media (such as, Facebook and YouTube) were used by Abu Sayyaf during negotiations. The author asserts on Page 270; \"Social media is changing what was once a closed dialogue between kidnappers, their victims and governments.\" Also, Colonel (reserve) in the Israel Defence Forces and research fellow at the International Institute for Counter-Terrorism (ICT), Dr Shaul Shay, analysed the Warren Rodwell terror abduction in: Global Jihad and The Tactic of Terror Abduction : A Comprehensive Review of Islamic Terrorist Organisations.  (Refer to Chapter 10) (Sussex Academic Press).\n\nCounter-terrorism analyst Dr Edward Mickolus wrote in Terrorism, 2013-2015: A Worldwide Chronology . (Pp 218 & 530) (McFarland & Company publisher) of the arrest on 16 June 2014 of two Abu Sayyaf suspects, Jimmy Nurilla (alias Doc) and Bakrin Haris. Both reportedly worked under Basilan-based Abu Sayyaf leader Khair Mundos and Furuji Indama. Authorities believed Nurilla and Haris took part in the kidnapping of Australian Warren Rodwell in 2011, as well as USA citizen Gerfa Yeatts Lunsman and her son Kevin in 2012.\n\nIn January 2015, Mindanao Examiner newspaper reported the arrest of Barahama Ali kidnap gang sub-leaders linked to the kidnapping of Warren Rodwell, who was seized by at least 5 gunmen (disguised as policemen), and eventually handed over or sold by the kidnappers to the Abu Sayyaf in Basilan province. In May, ex-Philippine National Police (PNP) officer Jun A. Malban, alias Michael Zoo, was arrested in Kota Kinabalu, Malaysia, for the crime of \"Kidnapping for Ransom\" after Rodwell identified him as the negotiator/spokesperson of the Abu Sayyaf Group during his captivity. Further PNP investigation revealed that Malban is the cousin of Abu Sayyaf leaders Khair Mundos and his brother Borhan Mundos. (Both were arrested in 2014). The director of the Anti-Kidnapping Group (AKG) stated that Malban's arrest resulted from close co-ordination by the PNP, National Bureau of Investigation (Philippines) and Presidential Anti-Organized Crime Commission with the Malaysian counterparts and through Interpol. In January 2018, Rodwell attended a court hearing for Malban and others in Ipil, Zamboanga Sibugay, pursuant to a Supreme Court petition to transfer his case for security reasons to a court in either Manila or Zamboanga City.\n\nIn August 2015, Edeliza Sumbahon Ulep, alias Gina Perez, was arrested at Trento, Agusan del Sur during a joint manhunt operation by police and military units. Ulep was tagged as the ransom courier of the Abu Sayyaf bandits in Zamboanga Sibugay in the kidnapping of Rodwell.\n\nIn August 2016, The Manila Times reported the arrest of the kidnap-for-ransom group of Barahama Alih sub-leader, Hasim Calon alias Husien (also a notorious provincial drug dealer), in his hideout in Tenan village in Ipil town. Hasim Calon was involved in the abduction of Warren Rodwell. Earlier in 2016, police forces killed Waning Abdulsalam. a former leader of the Moro Islamic Liberation Front, in the village of Singkilon in the town of Naga, Zamboanga Sibugay. Abdulsalam was one of the most wanted criminals in southern Philippines, and connected also to the Abu Sayyaf. He was linked to the kidnappings of Rodwell in 2011, Irish missionary Michael Sinnott in 2009 in Pagadian City, and Italian Catholic priest Giancarlo Bossi in Zamboanga del Sur’s Payao town in 2007.\n\n2012 European bird watchers\n\nOn 1 February 2012, two European bird watchers were seized by Abu Sayyaf militants on Tawi Tawi island in the southern Philippines. Swiss Lorenzo Vinciguerra escaped in December 2014 as government troops attacked the jungle camp he was being held on the island of Jolo. Vinciguerra was shot by rebels as he escaped; however, injuries sustained were non-life-threatening.  Dutch captive Ewold Horn was reportedly 'very sick and very weak' and unable to escape. The whereabouts of Horn remains unknown.\n\n2012 Mayor Jeffrey Lim Kidnapping\n\nOn 2 April 2012, Mayor Jeffrey Lim of Salug, Zamboanga del Norte was kidnapped by ten armed men disguised as policemen while having dinner with his family near a bus terminal. Lim was reportedly handed over to Abu Sayyaf. On 6 November, he was freed near Zamboanga City after payment of P1.3M ($US25,000) ransom. On 9 August 2013, a Mindanao Pagadian Frontline report named a \"Sehar Muloc\" aka \"Red Eye\" as a suspect in the 2012 kidnapping of Mayor Jeffrey Lim. Abner Gumandol, alias Sehar Muloc and Red Eye, was said to be the leader of a criminal syndicate called the Muloc Group. Gumandol was arrested on 12 June 2016.\n\n2014 Kabasalan ZSP kidnapping\n\nOn 11 September 2014,  Chinese national Li Pei Zhei was abducted by four gunmen in Kabasalan, Zamboanga Sibugay and taken to Basilan province. He was released in Sitio Lugay-Lugay, Barangay Naga-Naga, Alicia, Zamboanga Sibugay on 5 November 2014. Police subsequently charged Ibni Basaludin, Yug Enriquez, Brahama Ali, and Ging-Ging Calon, all residents of Barangay Tenan, Ipil, Zamboanga Sibugay with kidnapping with serious illegal detention.\n\n2015 Roseller Lim ZSP kidnapping\n\nOn 24 January 2015, Korean national Nwi Seong Hong was abducted by armed men in Roseller Lim, Zamboanga Sibugay Province in the southern Philippines. The victim’s son, Abby, managed to escape after he fought off the kidnappers.  According to highly placed intelligence information from the JTG-SULU, the captors of Nwi Seong Hong were allegedly Algabsy Misaya, Idang Susukan, Alden Bagade and Mohammad Salud alias Ama Maas, Indanan-based members of the Abu Sayyaf group led by sub-leaders Isang Susukan and Anga Adji. On 31 October 2015, the body of 74 year old Nwi Seong Hong was found near Sulu State College in Barangay Bangkal, Patikul, Sulu. Investigators said the victim died due to severe illness while being held by his abductors in the municipality of Indanan. Hong's body was then left near the school after his death.\n\n2015 Samal Island kidnappings\n\nOn 21 September 2015, Canadians Robert Hall and John Ridsdel, as well as Norwegian Kjartan Sekkingstad, and (Hall's girlfriend) Marites Flor; a Filipino woman, were all abducted from an upscale resort complex on the Philippine island of Samal near Davao in south eastern Mindanao. Ridsdel was beheaded by Abu Sayyaf on 25 April 2016 following a ransom deadline. ASG reportedly demanded more than $8.1 million for Ridsdel and the others. Former Canadian politician Bob Rae (and friend of Ridsdel), worked with the family to try to secure his release. Rae stated that the Canadian government was \"very directly involved\" in helping Ridsdel's family deal with the kidnappers.  Abu Sayyaf refused to lower their demand.\n\nOn 3 May 2016, a video of the Ridsdel execution was released, along with a new set of demands for the remaining hostages. A masked captor said, \"Note to the Philippine government and to the Canadian government: The lesson is clear. John Ridsdel has been beheaded. Now there are three remaining captives here. If you procrastinate once again the negotiations, we will behead this all anytime\".\n\nOn 15 May, media reports advised that Canadian Robert Hall had appeared in a new video, announcing that he and Norwegian Kjartan Sekkingstad would be decapitated at 3pm on Monday 13 June 2016 if a ransom of $16 million is not paid. Both hostages wore orange coveralls, similar to hostages in videos produced by ISIL, to which Abu Sayyaf had previously pledged allegiance. The deadline passed. Robert Hall was beheaded.\n\nCanadian newspaper Toronto Star published (from 30 November - 7 December 2016) \"Held Hostage\", an eight-part investigation into what really happens when a Canadian is taken hostage abroad. The Star revealed \"a system ripe for overhaul\", and ways Canada can change its approach, so it may be more effectively prepared in future.\n\nOn 24 June, Abu Sayyaf released Filipina Marites Flor. She was subsequently flown to Davao to meet President-elect Rodrigo Duterte. Duterte said he directed negotiations with the Abu Sayyaf. He did not elaborate.\n\nOn 17 September 2016, remaining hostage Norwegian Kjartan Sekkingstad was released on Jolo island. Abu Ramie, an ASG spokesman, claimed $638,000 was paid as ransom. Sekkingstad subsequently returned to Norway.\n\n2015 Dipolog City kidnapping\n\nOn 7 October 2015, Italian national and pizza restaurant owner Rolando del Torchio was kidnapped in Dipolog City, capital of Zamboanga del Norte Province in the southern Philippines. On 8 April 2016, Del Torchio was released and found at Jolo port aboard MV KC Beatrice bound for Zamboanga City after his family paid P29 million ($US650,000) in ransom.\n\nIn Malaysia\n\n2000 Sipadan kidnappings\n\nOn 3 May 2000, Abu Sayyaf guerillas occupied the Malaysian dive resort island Sipadan and took 21 hostages, including 10 tourists and 11 resort workers – 19 non-Filipino nationals in total. The hostages were taken to an Abu Sayyaf base in Jolo, Sulu. Two Muslim Malaysians were released soon after, however Abu Sayyaf made various demands for the release of several prisoners, including 1993 World Trade Center bomber Ramzi Yousef and $2.4 million. In July, a Filipino television evangelist and 12 of members of the Jesus Miracle Crusade Church offered their help and went as mediators for the relief of other hostages. They, three French television crew members and a German journalist, all visiting Abu Sayyaf on Jolo, were also taken hostage. Most hostages were released in August and September 2000, partly due to mediation by Libyan leader Muammar Gaddafi and an offer of $25 million in \"development aid\".\n\nAbu Sayyaf conducted a second raid on the island of Pandanan near Sipadan on 10 September and seized three more Malaysians. The Philippine army launched a major offensive on 16 September 2000, rescuing all remaining hostages, except Filipino dive instructor Roland Ullah. He was eventually freed in 2003. Abu Sayyaf coordinated with the Chinese 14K Triad gang in carrying out the kidnappings. The 14K Triad has militarily supported Abu Sayyaf.\n\n2013 Pom Pom kidnappings\n\nOn 15 November 2013, Abu Sayyaf militants raided a resort on a Malaysian island of Pom Pom in Semporna, Sabah. During the ambush, Taiwanese citizen Chang An-wei was kidnapped and her husband, Hsu Li-min, was killed. Chang was taken to the Sulu Archipelago in the southern Philippines. Gene Yu, an American and former US Army Special Forces captain was instrumental in negotiating, locating and working to free Taiwanese citizen Chang An-wei from Abu Sayyaf militants with Filipino special forces and private security contractors in 2013. Chang was freed in Sulu Province and returned to Taiwan on 21 December.\n\n2014 Singamata, Baik Island & Kampung Air Sapang kidnappings\n\nOn 2 April 2014, a kidnap gang believed to originate from Abu Sayyaf militants raided Singamata Reef Resort off Semporna, Sabah. Chinese tourist Gao Huayun from Shanghai and Filipino resort worker Marcy Dayawan were abducted and taken to the Sulu Archipelago. The two hostages were later rescued after a collaboration between Malaysian and Philippines security forces.\n\nOn 6 May, five Abu Sayyaf gunmen raided a Malaysian fish farm on Baik Island Sabah, kidnapped the fish farm manager and took him to Jolo island. He was later freed in July with the help of Malaysian negotiators.\n\nOn 16 June, two gunmen believed to be from Abu Sayyaf kidnapped another Chinese fish farm manager and one Filipino worker in Kampung Air Sapang, Kunak, Sabah. The Filipino fish farm worker managed to escape and went missing. Meanwhile, the fish farm manager was taken to Jolo. He was later released on 10 December.\n\nMalaysian authorities have identified five Filipinos, the \"Muktadir brothers\", as being behind all of the above kidnapping cases. They then sell their hostages to the Abu Sayyaf group.\n\nOf the five Muktadil brothers: Mindas Muktadil was killed by Philippine police in Jolo in May 2015, Kadafi Muktadil was arrested in late 2015, Nixon Muktadil and Brown Muktadil were killed during an operation by the Philippine military on 27 September 2016 after they resisted arrest, while Badong Muktadil succumbed to his injuries during his run after being shot at the time his brothers was killed. His body was discovered in a pump boat in Mususiasi area in Siasi Island, close to Jolo.\n\n2015 Ocean King Restaurant kidnappings\n\nOn 15 May 2015, four armed Abu Sayyaf members kidnapped two Malaysian nationals from Ocean King Restaurant in an upscale resort in Sandakan, Sabah and took them to Parang, Sulu. Police identified the leaders of the group behind the abduction as Alhabsy Misaya, Alden Bagade and Angah Adji. On 8 November, Thien Nyuk Fun, the seafood restaurant owner, was released  after payment of 30 million pesos ($US675,000) ransom. The initial agreement of 30 million pesos was reportedly for both hostages; however, a faction within the Abu Sayyaf Group demanded more after Thien Nyuk Fun was released. Further negotiations broke down and the other hostage, electrical engineer Bernard Then, was beheaded on Jolo Island on 17 November.\n\nPhilippines and Malaysia waters\n\n2014 German sailors kidnapping\n\nIn April 2014, Germans Dr. Stefan Viktor Okonek and Henrike Dielen were captured on their yacht on the high seas near Borneo. Abu Sayyaf threatened to behead one of them. After payment of $US5.6 million in October 2014, the pair were released in Patikul, Sulu.\n\n2016 Local and foreign sailors kidnappings\n\nOn 26 March 2016, ten Indonesian seafarers were held hostage by Islamist militant group Abu Sayyaf operating in Sulu Archipelago in the southern Philippines. The ten crew members were abducted from the Brahma 12 tugboat and the Anand 12 barge — carrying 7,500 tons of coal  — near the country's southernmost Tawi-Tawi province. The Indonesian vessels were freighting coal from South Borneo heading for Batangas port when hijacked near Sulu waters. In April, the Indonesian government announced that the company that owned tugboat Brahma 12 had agreed to pay the 50-million-peso ($1 million) ransom demanded for the release of the ten crew members. On 2 May, the ten Indonesians were released.\n\nOn 1 April, four Malaysian sailors aboard a tugboat from Manila were kidnapped when they arrived near the shore of Ligitan Island. Their companions, three Myanmar nationals and two Indonesians, were unharmed. On 8 June, the four Malaysian hostages were released.\n\nOn 15 April, another four Indonesian sailors were kidnapped when two Indonesian tugboats from Cebu, Henry and Cristi carrying ten passengers, were attacked by Abu Sayyaf militants. While five of the passengers were safe, one was injured after being shot, but he was rescued by operatives from the Malaysian Maritime Enforcement Agency (MMEA) when the vessels arrived in Malaysian waters. The four abductees were released on 11 May with the help of the Philippine government. A group of concerned Filipinos in Sabah urged then Philippine president-elect Rodrigo Duterte to intervene for the release of four Malaysians held hostage by Abu Sayyaf. The issue strained the relationship between the Philippines and Malaysia, and affected the lives of Filipinos in Sabah.\n\nOn 21 June, seven Indonesian sailors were kidnapped while aboard a tugboat passing through the Sulu Archipelago.\n\nOn 9 July, three Indonesian fishermen were kidnapped near the coast of Lahad Datu, Sabah, Malaysia  and released on 17 September.\n\nOn 18 July, five Malaysian sailors were abducted near the coast of Lahad Datu.\n\nOn 3 August, an Indonesian sailor was kidnapped in the waters of Malaysia  while leaving two other crew members unharmed. This incident was only reported by victims on 5 August. Two of the Indonesian sailor hostages managed to escape from the Abu Sayyaf after receiving persistent threats of beheading.\n\nOn 10 September, three Filipino fishermen were kidnapped on the shores of Pom Pom Island in Sabah, Malaysia.\n\nOn 22 September, another Indonesian hostage was released.\n\nOn 27 September, one Malaysian boat-skipper was kidnapped from his trawler by seven armed Filipino militants before the group attacked another Indonesian trawler; however, no kidnappings were committed in the second incident. The boat-skipper was released on 1 October, with no ransom having been asked, along with three Indonesians hostages that were released the same day.\n\nOn 21 October, approximately ten Abu Sayyaf militants attacked a South Korean-bound vessel named MV Dongbang Gian and abducted a South Korean skipper and a Filipino crewman off Bongao, Tawi-Tawi.\n\nOn 5 November, German sailor Sabine Merz was shot dead while her husband Jürgen Kantner was abducted by Abu Sayyaf militants from their yacht off Tanjong Luuk Pisuk in Sabah. On or before 27 February 2017, Kantner was beheaded after a ransom of 30 million pesos ($US600,000) was not met.\n\nOn 11 November, a Vietnamese vessel MV Royale 16 with nineteen sailors on board was attacked by Abu Sayyaf near Basilan, abducting six sailors and injuring one.  The remaining thirteen sailors were released.\n\nOn 20 November, two Indonesian fishermen were kidnapped by five Abu Sayyaf gunmen off Lahad Datu, Sabah, while Philippine military were informed to intercept the bandits.\n\nDue to the increase of attacks against foreign vessels by Abu Sayyaf, the governments of Indonesia, Malaysia and the Philippines agreed to jointly patrol their waters on 5 May 2016. The three countries also signed another agreement on joint air patrols.\n\nDuring the first six months of 2016, Abu Sayyaf made $7.3 million, equivalent to Php 353 million, from ransom payoffs according to a Philippine government report.\n\nBeheadings\n\nAs part of its kidnap-for-ransom operations, the Abu Sayyaf has executed some of their male hostages if ransom demands were not being met. The group had also previously beheaded Christian civilians and other non-believers of Islam without raising any ransoms for their release, simply due to religious affiliation.\n\nBombings\n\n2004 Superferry 14 Bombing\n\nSuperferry 14 was a large ferry destroyed by a bomb on 27 February 2004, killing 116 people in the Philippines' worst terrorist attack and the world's deadliest terrorist attack at sea. On that day, the 10,192 ton ferry sailed out of Manila with about 900 passengers and crew on board. A television set filled with 8 lb. (4 kilograms) of TNT had been placed on board. 90 minutes out of port, the bomb exploded. 63 people were killed instantly and 53 went missing and presumed dead. Despite claims from terrorist groups, the blast was initially thought to have been an accident caused by a gas explosion. However, after divers righted the ferry five months after it had sunk, they found evidence of a bomb blast. A man called Redendo Cain Dellosa also admitted to planting the bomb on board for Abu Sayyaf. Philippine president Gloria Macapagal-Arroyo announced on 11 October 2004 that investigators had concluded the explosion was caused by a bomb. She said six suspects had been arrested in connection with the bombing and that the masterminds, Khadaffy Janjalani and Abu Sulaiman, have been killed. Despite being shed by two of its leaders, the ASG would continue to pose a threat to Philippine security.\n\n2016 Davao City bombing\n\nOn 2 September 2016, an explosion occurred at a night market in Davao City, Philippines resulting in at least 15 deaths and 70 injuries. Shortly before the bombing, the Abu Sayyaf has make a threat following the intensified military operation against them. The Abu Sayyaf through one of its spokesperson Abu Rami have claimed responsibility on the attack according to a report released by local radio station, DZMM.  The spokesman later denied the report and any of their involvement in the bombing, saying a group that allied to them; the Daulat Ul-Islamiya who responsible to the attack. Although the Abu Sayyaf spokesman have denied their involvement, the Philippine government have put the blame on Abu Sayyaf based on a statement by the country President that stated:\n\nCriticism of attacks against civilians\n\nCondemnation from Muslim countries and organisations\n\nSheikh Yusuf al-Qaradawi in Qatar has denounced the kidnapping and killings committed by the Abu Sayyaf towards civilians and foreigners, asserting that they are not part of the dispute between the Abu Sayyaf and the Philippines government. He stated that it is shameful to commit such acts in the name of the Islamic faith, saying that such acts produce backlashes against Islam and Muslims worldwide. During the 2000 Sipadan kidnappings, the Organisation of the Islamic Conference (OIC) condemned the kidnapping and offered to help secure their release. OIC Secretary General Azeddine Laraki who represents the world's largest Islamic body, told the Philippine government he was prepared to send an envoy to help save the hostages and issued a statement condemning the rebels. \"The Secretary General has pointed out that this operation and the like are rejected by divine laws and that they are neither the appropriate nor correct means to resolve conflicts\", the statement said.\n\nThe terrorism to innocent civilians committed by Abu Sayyaf have been condemned by fellow Moro separatists of MNLF and MILF who said the Abu Sayyaf have gone too far from their real paths of struggle, with MILF labelling Abu Sayyaf as \"anti-Islam\" soon after the beheading of Canadian hostage John Ridsdel in 2016. While MNLF describing the group as \"causing chaos to their community\". Both Christian and Muslim groups in the Philippines also strongly condemning the Abu Sayyaf beheading habits.\n\nThe rampant kidnappings have also been heavily criticised by Indonesia. On 14 July 2016, a group of Indonesian protesters gathered in front of the Philippine Embassy in Indonesia, holding banners that read \"Go to hell Philippines and Abu Sayyaf\" and \"Destroy the Philippines and Abu Sayyaf\" due to what was seen as the lack of action from the Philippine government who seems cannot defeating the militant on its own and protecting foreign citizens. The group demanding there should be a large scale military operation to destroy the Abu Sayyaf, of which the Indonesian military before also have proposing to sent their military to Philippines but were rejected by the Philippine government, citing it is against their constitution.\n\nMilitary operation against Abu Sayyaf\n\nThe Philippine military has been engaging the Abu Sayyaf since 1990s as part of its operation in Mindanao. Under the administration of President Rodrigo Duterte, the Philippine government are interested to make a peace agreement with the Moro separatists of MNLF and MILF, while the Abu Sayyaf are excluded as they was seen no more than a \"bunch of criminals\" who terrorise innocent civilians. The Philippine government has pledged to destroy the group to maintain the peace in Mindanao. The Philippine military has intensified their operation more since 2003 following the arrest of a Filipino-American who been alleged to have selling illegal weapons to the group. The suspect has been tagged by the United States authorities as \"one of the United States most wanted fugitives\" which he was then deported by the Philippine government to facing legal action in the United States.\n\nOn 29 July 2016, the Philippine military gained control of one of the Abu Sayyaf strongholds in Tipo-Tipo, Basilan. The Philippine military has pledged that they will continue with more major operations to eliminate the Abu Sayyaf group. The Philippine security forces also collaborating with neighbouring Malaysia and Indonesia to maintains the security in the Sulu Sea. On 25 August, President Duterte ordered the group to be \"destroyed\" after a teenager was beheaded by the extremist group. Since the incident, the Philippine military sent thousands more troops to fight and destroy the Abu Sayyaf. The Filipino Army Major Filemon Tan said, \"The order of the president is to search and destroy the Abu Sayyaf so that’s what we are doing\". Both MNLF and MILF also have since helping the government forces to suppress extremism in Mindanao which affecting the peace process for both groups as both want to end their decades wars.\n\nThe Indonesian government have proposing before to stationed their army in Mindanao to launch major operation in the southern Philippines to destroy the Abu Sayyaf. The Indonesian government has calling both Malaysian and Philippine armies to launch a combined land attacks together on Mindanao in every Abu Sayyaf nests to wipe them out, while at the same time urging the Philippine government to give a law relaxation to both Indonesia and Malaysia military forces to enter the Philippines territory. The Vietnamese military has also start to holding military exercise and precaution against the Abu Sayyaf (more known locally as \"pirates\" by the Vietnamese) following the repeat kidnappings of Malaysian and Indonesian sailors by the group. As the Abu Sayyaf is divided between different leaders, the Philippine military has provided one battalion to go against each group. On 9 September, following the meeting between President Duterte and Indonesian President of Joko Widodo, an agreement was reached to pursue the Abu Sayyaf for their persistent terrorism. The Philippine President said in a statement:\n\nHowever, despite the permission that have been granted by the Philippine government, the government of Indonesia decided to not launching any military operation to southern Philippines, citing the reason was due to there have been enough military personnel been deployed by the Philippine government, with the Malaysian side also shared the similar view to not sending their armies. The Philippine military chief Ricardo Visaya had warned the Abu Sayyaf that they will continue with more further major military operation to stop the rampant lawlessness in the southern Philippines islands. The military chief had giving a notice to any Abu Sayyaf members to surrender or \"neutralised\", a term that means getting killed, apprehended or arrested. A mayor in Sumisip of Basilan has support the calling, saying:\n\nThis was responded by around 20 Abu Sayyaf who have surrender and giving their arms to the Philippine military in Sumisip on 22 September. A day before, the Philippine armed forces confiscated a total of 200 speedboats used by the Abu Sayyaf in Basilan, Sulu, Tawi-Tawi and Zamboanga. President Duterte have reminded that there will be \"no amnesty\" for Abu Sayyaf despite a proposal by Nur Misuari, the leader of MNLF to include Abu Sayyaf in peace talks as the group have killed too many innocent peoples. The President has told that he will stick to his position for the group to be destroyed. On 27 September, another largest attempt for the smuggling of weapons to the Abu Sayyaf group were busted by the Philippine National Police in San Juan City, Philippines with the arrestment of four people. Until 14 October, the Philippine military has launched 579 massive military operations, 426 of which were focused \"to neutralise\" the group members. Of all the total operations, 54 lead to armed engagements resulting to 56 Abu Sayyaf members been killed, 21 surrendered, 17 arrested while 94 being neutralised.\n\nThe total Abu Sayyaf fatalities then increase to 102, with seven more apprehended and a total of 130 been neutralised. Among the notable Abu Sayyaf leaders killed during the ongoing operations including Nelson Muktadil, Braun Muktadil, their sub-leader Mohammad Said, Jamiri Jawhari, Musanna Jamiri, the group spokesman Abu Rami and Alhabsy Misaya. In addition, another 165 fast boats that being used by the Abu Sayyaf for their transport and for their kidnappings activities were also confiscated by the military. Until 13 April 2017, a total of 50 more members of the Abu Sayyaf group have surrendered to the Philippine authorities. In the same month, the Philippine authorities also discovered the presence of more foreign militants from Indonesia and Malaysia that was killed during the ongoing operations (especially since the killings of notable militants such as Sanusi, Zulkifli Abdhir, Ibrahim Ali, Mohd Najib Husen and Mohisen) as well the presence of \"traitor\" among their security members when a top policewoman was caught for her ties with the group. Indonesia admits the presence of its citizen who became militants in the southern Philippines who depart from the areas of North Sulawesi and said they could not prevent them following the lack of security in their borders, while Malaysia discovered the militants using Sabah as a transit point to the southern Philippines. The two have pledge to prevent cross-border terrorism and curbing the activities of militants in their territories, with a major co-operation operation of the two countries with the Philippines will be launched in May 2017.\n\nEarly on 26 November 2016, Duterte stated that he will open to peace talks with the Abu Sayyaf group (as he did with the MNLF and MILF by offering federalism as a possible solution) while continue fighting against the Maute group, a move that were criticised by Philippine analyst as it would be used by extreme rebels to claim for legitimacy as a group. In a statement, the President said:\n\nHis statements were also criticised by the country media as leading to a confusion whether he want to make peace talks with the group that have taken so many innocent lives or continue fighting against them, with the Philippine government have been criticised for unable to stop the rampant lawlessness in Mindanao until this day especially with the formation of another IS-linked group, the Maute.  On 7 December, Duterte told the Indonesian and Malaysian leaders that \"they can bomb the Abu Sayyaf along with the hostages if the Abu Sayyaf continue to present persistent threats and the hostages should already know that there is repeated warnings to not go there\". Abu Sayyaf. http://en.wikipedia.org/?curid=2216."
  }
}
