{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6310",
  "eid" : "daee27d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778447053,
  "textBody" : "Columbia University (Columbia; officially Columbia University in the City of New York), established in 1754, is a private Ivy League research university in Upper Manhattan, New York City. Columbia contains the oldest college in the state of New York and is the fifth chartered institution of higher learning in the United States, making it one of nine colonial colleges founded prior to the Declaration of Independence. It was established as King's College by royal charter of George II of Great Britain and renamed Columbia College in 1784 following the American Revolutionary War. The college has produced numerous distinguished alumni. It has been among the most selective colleges in the United States since its founding. With an undergraduate acceptance rate of 5.8%, it currently stands as the third most selective college in the United States and the second most selective in the Ivy League.http://www.businessinsider.com/most-selective-ivy-league-schools-2017-3\n\nA 1787 charter placed the institution under a private board of trustees before it was renamed Columbia University in 1896 when the campus was moved from Madison Avenue to its current location in Morningside Heights occupying 32 acres of land. Columbia is one of the fourteen founding members of the Association of American Universities and was the first school in the United States to grant the M.D. degree. The university administers the Pulitzer Prize annually.\n\nThe university is organized into twenty schools, including undergraduate schools such as Columbia College, the Fu Foundation School of Engineering and Applied Science, and the School of General Studies, as well as graduate schools such as Columbia Law School, Teachers College, Columbia College of Physicians and Surgeons, and Columbia Business School. The university also has global research outposts in Amman, Beijing, Istanbul, Paris, Mumbai, Rio de Janeiro, Santiago, Asunción and Nairobi. There are nearby institutions that are affiliated with Columbia including Barnard College, List College, and Union Theological Seminary. Columbia also has joint undergraduate programs available through the Jewish Theological Seminary of America, University College London, Sciences Po, City University of Hong Kong, Trinity College Dublin, and the Juilliard School.\n\nThe university has graduated many notable alumni. As of 2017, alumni and affiliates include 5 Founding Fathers of the United States – among these an author of the Declaration of Independence and an author of the United States Constitution; 10 Justices of the United States Supreme Court;  95 Nobel laureates; 20 living billionaires; 123 Pulitzer Prize winners; 39 Academy Award winners; 3 United States Presidents; 29 heads of state; 101 National Academy members; 77 National Medal of Science winners; and 23 National Humanities Medal recipients.\n\nHistory\n\nColonial\n\nDiscussions regarding the founding of a college in the Province of New York began as early as 1704, at which time Colonel Lewis Morris wrote to the Society for the Propagation of the Gospel in Foreign Parts, the missionary arm of the Church of England, persuading the society that New York City was an ideal community in which to establish a college. However, it was not until the founding of the College of New Jersey (the present Princeton University) across the Hudson River in New Jersey that the City of New York seriously consider founding a college. In 1746, an act was passed by the general assembly of New York to raise funds for the foundation of a new college. In 1751, the assembly appointed a commission of ten New York residents, seven of whom were members of the Church of England, to direct the funds accrued by the state lottery towards the foundation of a college.\n\nClasses were initially held in July 1754 and were presided over by the college's first president, Dr. Samuel Johnson. Dr. Johnson was the only instructor of the college's first class, which consisted of a mere eight students. Instruction was held in a new schoolhouse adjoining Trinity Church, located on what is now lower Broadway in Manhattan. The college was officially founded on October 31, 1754, as King's College by royal charter of King George II, making it the oldest institution of higher learning in the state of New York and the fifth oldest in the United States.\n\nIn 1763, Dr. Johnson was succeeded in the presidency by Myles Cooper, a graduate of The Queen's College, Oxford, and an ardent Tory. In the charged political climate of the American Revolution, his chief opponent in discussions at the college was an undergraduate of the class of 1777, Alexander Hamilton. The American Revolutionary War broke out in 1776, and was catastrophic for the operation of King's College, which suspended instruction for eight years beginning in 1776 with the arrival of the Continental Army. The suspension continued through the military occupation of New York City by British troops until their departure in 1783. The college's library was looted and its sole building requisitioned for use as a military hospital first by American and then British forces. Loyalists were forced to abandon their King's College in New York, which was seized by the rebels and renamed Columbia College. The Loyalists, led by Bishop Charles Inglis fled to Windsor, Nova Scotia, where they founded King's Collegiate School.\n\n18th century\n\nAfter the Revolution, the college turned to the State of New York in order to restore its vitality, promising to make whatever changes to the school's charter the state might demand. The Legislature agreed to assist the college, and on May 1, 1784, it passed \"an Act for granting certain privileges to the College heretofore called King's College\". The Act created a Board of Regents to oversee the resuscitation of King's College, and, in an effort to demonstrate its support for the new Republic, the Legislature stipulated that \"the College within the City of New York heretofore called King's College be forever hereafter called and known by the name of Columbia College\", a reference to Columbia, an alternative name for America. The Regents finally became aware of the college's defective constitution in February 1787 and appointed a revision committee, which was headed by John Jay and Alexander Hamilton. In April of that same year, a new charter was adopted for the college, still in use today, granting power to a private board of 24 Trustees.\n\nOn May 21, 1787, William Samuel Johnson, the son of Dr. Samuel Johnson, was unanimously elected President of Columbia College. Prior to serving at the university, Johnson had participated in the First Continental Congress and been chosen as a delegate to the Constitutional Convention. For a period in the 1790s, with New York City as the federal and state capital and the country under successive Federalist governments, a revived Columbia thrived under the auspices of Federalists such as Hamilton and Jay. Both President George Washington and Vice President John Adams attended the college's commencement on May 6, 1789, as a tribute of honor to the many alumni of the school who had been involved in the American Revolution.\n\n19th century to present\n\nIn November 1813, the College agreed to incorporate its medical school with The College of Physicians and Surgeons, a new school created by the Regents of New York, forming Columbia University College of Physicians and Surgeons. The college's enrollment, structure, and academics stagnated for the majority of the 19th century, with many of the college presidents doing little to change the way that the college functioned. In 1857, the college moved from the King's College campus at Park Place to a primarily Gothic Revival campus on 49th Street and Madison Avenue, where it remained for the next forty years. During the last half of the 19th century, under the leadership of President F.A.P. Barnard, the president Barnard College is named after, the institution rapidly assumed the shape of a modern university. Barnard College was created in 1889 as a response to the university's refusal to accept women.  By this time, the college's investments in New York real estate became a primary source of steady income for the school, mainly owing to the city's expanding population. University president Seth Low moved the campus from 49th Street to its present location, a more spacious campus in the developing neighborhood of Morningside Heights.[http://ephemeralnewyork.wordpress.com/2008/05/05/columbia-universitys-lunatic-past \"Columbia University's Lunatic Past.\" Ephemeral New York website. May 5, 2008] Under the leadership of Low's successor, Nicholas Murray Butler, who served for over four decades, Columbia rapidly became the nation's major institution for research, setting the \"multiversity\" model that later universities would adopt. Prior to becoming the president of Columbia University, Butler founded Teachers College, as a school to prepare home economists and manual art teachers for the children of the poor, with philanthropist Grace Hoadley Dodge. Teachers College came under the aegis of Columbia University in 1893 and became the University's Graduate School of Education.\n\nResearch into the atom by faculty members John R. Dunning, I. I. Rabi, Enrico Fermi and Polykarp Kusch placed Columbia's Physics Department in the international spotlight in the 1940s after the first nuclear pile was built to start what became the Manhattan Project. In 1928, Seth Low Junior College was established by Columbia University in order to mitigate the number of Jewish applicants to Columbia College. The college was closed in 1938 due to the adverse effects of the Great Depression and its students were subsequently absorbed into University Extension. In 1947, the program was reorganized as an undergraduate college and designated the School of General Studies in response to the return of GIs after World War II. In 1995, the School of General Studies was again reorganized as a full-fledged liberal arts college for non-traditional students (those who have had an academic break of one year or more, or are pursuing dual-degrees) and was fully integrated into Columbia's traditional undergraduate curriculum. Within the same year, the Division of Special Programs—later the School of Continuing Education, and now the School of Professional Studies—was established to reprise the former role of University Extension. While the School of Professional Studies only offered non-degree programs for lifelong learners and high school students in its earliest stages, it now offers degree programs in a diverse range of professional and inter-disciplinary fields.\n\nIn the aftermath of World War II, the discipline of international relations became a major scholarly focus of the University, and in response, the School of International and Public Affairs was founded in 1946, drawing upon the resources of the faculties of political science, economics, and history.\n\nDuring the 1960s Columbia experienced large-scale student activism, which reached a climax in the spring of 1968 when hundreds of students occupied buildings on campus. The incident forced the resignation of Columbia's President, Grayson Kirk and the establishment of the University Senate.\n\nThough several schools within the university had admitted women for years, Columbia College first admitted women in the fall of 1983, after a decade of failed negotiations with Barnard College, the all-female institution affiliated with the university, to merge the two schools.[http://www.columbiaspectator.com/2009/03/31/reception-honors-anniversary-cc-coeducation Reception honors anniversary of CC coeducation | Columbia Daily Spectator]. Columbiaspectator.com. Retrieved on September 7, 2013. Barnard College still remains affiliated with Columbia, and all Barnard graduates are issued diplomas authorized by both Columbia University and Barnard College.\n\nIn the 1970s, Teachers College's departments ran joint Ph.D programs with the University in the disciplines of psychology, history, and anthropology and all Teachers College diplomas were conferred by Columbia University. Teachers College was soon established as the University's Faculty of Education and Department of Education.\n\nDuring the late 20th century, the University underwent significant academic, structural, and administrative changes as it developed into a major research university. For much of the 19th century, the University consisted of decentralized and separate faculties specializing in Political Science, Philosophy, and Pure Science. In 1979, these faculties were merged into the Graduate School of Arts and Sciences. In 1991, the faculties of Columbia College, the School of General Studies, the Graduate School of Arts and Sciences, the School of the Arts, and the School of Professional Studies were merged into the Faculty of Arts and Sciences, leading to the academic integration and centralized governance of these schools. In 2010, the School of International and Public Affairs, which was previously a part of the Faculty of Arts and Sciences, became an independent faculty.\n\nCampus\n\nAccording to New York, Columbia University is the second largest landowner in New York City, after the Catholic Church.\n\nMorningside Heights\n\nThe majority of Columbia's graduate and undergraduate studies are conducted in Morningside Heights on Seth Low's late-19th century vision of a university campus where all disciplines could be taught at one location. The campus was designed along Beaux-Arts principles by architects McKim, Mead, and White. Columbia's main campus occupies more than six city blocks, or 32 acres, in Morningside Heights, New York City, a neighborhood that contains a number of academic institutions. The university owns over 7,800 apartments in Morningside Heights, housing faculty, graduate students, and staff. Almost two dozen undergraduate dormitories (purpose-built or converted) are located on campus or in Morningside Heights. Columbia University has an extensive underground tunnel system more than a century old, with the oldest portions predating the present campus. Some of these remain accessible to the public, while others have been cordoned off.\n\nThe Nicholas Murray Butler Library, known simply as Butler Library, is the largest single library in the Columbia University Library System, and is one of the largest buildings on the campus. Proposed as \"South Hall\" by the university's former President Nicholas Murray Butler as expansion plans for Low Memorial Library stalled, the new library was funded by Edward Harkness, benefactor of Yale's residential college system, and designed by his favorite architect, James Gamble Rogers. It was completed in 1934 and renamed for Butler in 1946. The library design is neo-classical in style. Its facade features a row of columns in the Ionic order above which are inscribed the names of great writers, philosophers, and thinkers, most of whom are read by students engaged in the Core Curriculum of Columbia College. As of 2012, Columbia's library system includes over 11.9  million volumes, making it the eighth largest library system and fifth largest collegiate library system in the United States. It has also been ranked among the United States' most beautiful libraries.\n\nSeveral buildings on the Morningside Heights campus are listed on the National Register of Historic Places. Low Memorial Library, a National Historic Landmark and the centerpiece of the campus, is listed for its architectural significance. Philosophy Hall is listed as the site of the invention of FM radio. Also listed is Pupin Hall, another National Historic Landmark, which houses the physics and astronomy departments. Here the first experiments on the fission of uranium were conducted by Enrico Fermi. The uranium atom was split there ten days after the world's first atom-splitting in Copenhagen, Denmark.Robert D. Colburn (July 2002) , National Park Service and \n\nA statue by sculptor Daniel Chester French called Alma Mater is centered on the front steps of Low Memorial Library. McKim, Mead & White invited French to build the sculpture in order to harmonize with the larger composition of the court and library in the center of the campus. Draped in an academic gown, the female figure of Alma Mater wears a crown of laurels and sits on a throne. The scroll-like arms of the throne end in lamps, representing sapientia and doctrina. A book signifying knowledge, balances on her lap, and an owl, the attribute of wisdom, is hidden in the folds of her gown. Her right hand holds a scepter composed of four sprays of wheat, terminating with a crown of King's College which refers to Columbia's origin as a Royalist institution in 1754. A local actress named Mary Lawton was said to have posed for parts of the sculpture. The statue was dedicated on September 23, 1903, as a gift of Mr. & Mrs. Robert Goelet, and was originally covered in golden leaf. During the Columbia University protests of 1968 a bomb damaged the sculpture, but it has since been repaired. The small hidden owl on the sculpture is also the subject of many Columbia legends, the main legend being that the first student in the freshmen class to find the hidden owl on the statue will be valedictorian, and that any subsequent Columbia male who finds it will marry a Barnard student, given that Barnard is a women's college.\n\n\"The Steps\", alternatively known as \"Low Steps\" or the \"Urban Beach\", are a popular meeting area for Columbia students. The term refers to the long series of granite steps leading from the lower part of campus (South Field) to its upper terrace. With a design inspired by the City Beautiful movement, the steps of Low Library provides Columbia University and Barnard College students, faculty, and staff with a comfortable outdoor platform and space for informal gatherings, events, and ceremonies. McKim's classical facade epitomizes late 19th century new-classical designs, with its columns and portico marking the entrance to an important structure. On warm days when the weather is favorable, the Low Steps often become a popular gathering place for students to sunbathe, eat lunch, or play frisbee.\n\nOther campuses\n\nIn April 2007, the university purchased more than two-thirds of a 17 acre site for a new campus in Manhattanville, an industrial neighborhood to the north of the Morningside Heights campus. Stretching from 125th Street to 133rd Street, the new campus will house buildings for Columbia's Business School, School of International and Public Affairs, and the Jerome L. Greene Center for Mind, Brain, and Behavior, where research will occur on neurodegenerative diseases such as Parkinson's and Alzheimer's. The $7 billion expansion plan includes demolishing all buildings, except three that are historically significant, eliminating the existing light industry and storage warehouses, and relocating tenants in 132 apartments. Replacing these buildings will be 6800000 sqft of space for the university. Community activist groups in West Harlem fought the expansion for reasons ranging from property protection and fair exchange for land, to residents' rights. Subsequent public hearings drew neighborhood opposition. Most recently (as of December 2008), the State of New York's Empire State Development Corporation approved use of eminent domain, which, through declaration of Manhattanville's \"blighted\" status, gives governmental bodies the right to appropriate private property for public use. On May 20, 2009, the New York State Public Authorities Control Board approved the Manhanttanville expansion plan and the first buildings are under construction.\n\nNew York-Presbyterian Hospital is affiliated with the medical schools of both Columbia University and Cornell University. According to U.S. News & World Reports \"America's Best Hospitals 2009\", it is ranked sixth overall and third among university hospitals. Columbia's medical school has a strategic partnership with New York State Psychiatric Institute, and is affiliated with 19 other hospitals in the U.S. and four hospitals overseas. Health-related schools are located at the Columbia University Medical Center, a 20 acre campus located in the neighborhood of Washington Heights, fifty blocks uptown. Other teaching hospitals affiliated with Columbia through the New York-Presbyterian network include the Payne Whitney Clinic in Manhattan, and the Payne Whitney Westchester, a psychiatric institute located in White Plains, New York. On the northern tip of Manhattan island (in the neighborhood of Inwood), Columbia owns 26 acre Baker Field, which includes the Lawrence A. Wien Stadium as well as facilities for field sports, outdoor track, and tennis. There is a third campus on the west bank of the Hudson River, the 157 acre Lamont-Doherty Earth Observatory and Earth Institute in Palisades, New York. A fourth is the 60 acre Nevis Laboratories in Irvington, New York for the study of particle and motion physics. A satellite site in Paris, France holds classes at Reid Hall.\n\nSustainability\n\nIn 2006, the university established the Office of Environmental Stewardship to initiate, coordinate and implement programs to reduce the university's environmental footprint. The U.S. Green Building Council selected the university's Manhattanville plan for the Leadership in Energy and Environmental Design (LEED) Neighborhood Design pilot program. The plan commits to incorporating smart growth, new urbanism and \"green\" building design principles. Columbia is one of the 2030 Challenge Partners, a group of nine universities in the city of New York that have pledged to reduce their greenhouse emissions by 30% within the next ten years. Columbia University adopts LEED standards for all new construction and major renovations. The University requires a minimum of Silver, but through its design and review process seeks to achieve higher levels. This is especially challenging for lab and research buildings with their intensive energy use; however, the university also uses lab design guidelines that seek to maximize energy efficiency while protecting the safety of researchers.\n\nEvery Thursday and Sunday of the month, Columbia hosts a greenmarket where local farmers can sell their produce to residents of the city. In addition, from April to November Hodgson's farm, a local New York gardening center, joins the market bringing a large selection of plants and blooming flowers. The market is one of the many operated at different points throughout the city by the non-profit group GrowNYC. Dining services at Columbia spends 36 percent of its food budget on local products, in addition to serving sustainably harvested seafood and fair trade coffee on campus. Columbia has been rated \"B+\" by the 2011 College Sustainability Report Card for its environmental and sustainability initiatives.\n\nAcademics\n\nUndergraduate admissions and financial aid\n\nColumbia University received 36,292 applications for its undergraduate class of 2020 (entering 2016). In early decision, 620 out of 3,520 applicants were admitted, for an acceptance rate of 17.61%. In regular decision, 1,573 out of 32,772 applicants were admitted, for an acceptance rate of 4.79%. For the Class of 2021, 2,185 out of 37,389 applicants were admitted for an overall acceptance rate of 5.8%, making Columbia the third most selective college in the United States behind Stanford and Harvard and the second most selective college in the Ivy League. According to the 2012 college selectivity ranking by U.S. News & World Report, which factors admission and yield rates among other criteria, Columbia was tied with Yale, Caltech and MIT as the most selective colleges in the country.U.S. News & World Report, Americas Best Rankings 2012, National University Rankings, Selectivity Ranking (the former is available only in the print edition and--for purchase--in the online premium edition) Columbia is a racially diverse school, with approximately 52% of all students identifying themselves as persons of color. Additionally, 50% of all undergraduates received grants from Columbia. The average grant size awarded to these students is $46,516. In 2015–2016, annual undergraduate tuition at Columbia was $50,526 with a total cost of attendance of $65,860 (including room and board).\n\nOn April 11, 2007, Columbia University announced a $400m to $600m donation from media billionaire alumnus John Kluge to be used exclusively for undergraduate financial aid. The donation is among the largest single gifts to higher education. Its exact value will depend on the eventual value of Kluge's estate at the time of his death; however, the generous donation has helped change financial aid policy at Columbia. Annual gifts, fund-raising, and an increase in spending from the university's endowment have allowed Columbia to extend generous financial aid packages to qualifying students. As of 2008, undergraduates from families with incomes as high as $60,000 a year will have the projected cost of attending the university, including room, board, and academic fees, fully paid for by the university. That same year, the university ended loans for incoming and current students who were on financial aid, replacing loans that were traditionally part of aid packages with grants from the university. However, this does not apply to international students, transfer students, visiting students, or students in the School of General Studies. In the fall of 2010, admission to Columbia's undergraduate colleges Columbia College and the Fu Foundation School of Engineering and Applied Science (also known as SEAS or Columbia Engineering) began accepting the Common Application. The policy change made Columbia one of the last major academic institutions and the last Ivy League university to switch to the Common Application.\n\nScholarships are also given to undergraduate students by the admissions committee. Designations include John W. Kluge Scholars, John Jay Scholars, C. Prescott Davis Scholars, Global Scholars, Egleston Scholars, and Science Research Fellows. Named scholars are selected by the admission committee from first-year applicants. According to Columbia, the first four designated scholars \"distinguish themselves for their remarkable academic and personal achievements, dynamism, intellectual curiosity, the originality and independence of their thinking, and the diversity that stems from their different cultures and their varied educational experiences.\"\n\nOrganization\n\nColumbia University is an independent, privately supported, nonsectarian institution of higher education. Its official corporate name is \"The Trustees of Columbia University in the City of New York.\" The university's first Charter was granted in 1754 by King George II; however, its modern Charter was first enacted in 1787 and last amended in 1810 by the New York State Legislature. The university is governed by 24 Trustees, customarily including the President, who serves ex officio. The Trustees themselves are responsible for choosing their successors. Six of the 24 are nominated from a pool of candidates recommended by the Columbia Alumni Association. Another six are nominated by the Board in consultation with the Executive Committee of the University Senate. The remaining 12, including the President, are nominated by the Trustees themselves through their internal processes. The term of office for Trustees is six years. Generally, they serve for no more than two consecutive terms. The Trustees appoint the President and other senior administrative officers of the university, and review and confirm faculty appointments as required. They determine the university's financial and investment policies, authorize the budget, supervise the endowment, direct the management of the university's real estate and other assets, and otherwise oversee the administration and management of the university.\n\nThe University Senate was established by the Trustees after a university-wide referendum in 1969. It succeeded to the powers of the University Council, which was created in 1890 as a body of faculty, deans, and other administrators to regulate inter-Faculty affairs and consider issues of university-wide concern. The University Senate is a unicameral body consisting of 107 members drawn from all constituencies of the university. These include the president of the university, the Provost, the Deans of Columbia College and the Graduate School of Arts and Sciences, all who serve ex officio, and five additional representatives, appointed by the President, from the university's administration. The President serves as the Senate's presiding officer. The Senate is charged with reviewing the educational policies, physical development, budget, and external relations of the university. It oversees the welfare and academic freedom of the faculty and the welfare of students.http://senate.columbia.edu/elections/elections_packet_2017.pdfhttp://senate.columbia.edu/topbar_pages/elections.html\n\nThe President of Columbia University, who is selected by the Trustees in consultation with the Executive Committee of the University Senate and who serves at the Trustees' pleasure, is the chief executive officer of the university. Assisting the President in administering the University are the Provost, the Senior Executive Vice President, the Executive Vice President for Health and Biomedical Sciences, several other vice presidents, the General Counsel, the Secretary of the University, and the deans of the Faculties, all of whom are appointed by the Trustees on the nomination of the President and serve at their pleasure. Lee C. Bollinger became the 19th President of Columbia University on June 1, 2002. A prominent advocate of affirmative action, he played a leading role in the twin Supreme Court cases—Grutter v Bollinger and Gratz v Bollinger—that upheld and clarified the importance of diversity as a compelling justification for affirmative action in higher education. A leading First Amendment scholar, he is widely published on freedom of speech and press, and  serves on the faculty of Columbia Law School.\n\nColumbia has three official undergraduate colleges: Columbia College (CC), the liberal arts college offering the Bachelor of Arts degree, the Fu Foundation School of Engineering and Applied Science (also known as SEAS or Columbia Engineering) is the engineering and applied science school offering the Bachelor of Science degree, and The School of General Studies (GS), the liberal arts college offering the Bachelor of Arts degree to non-traditional students undertaking full- or part-time study.\n\nThe university is affiliated with Teachers College, Barnard College, and Union Theological Seminary, all located nearby in Morningside Heights. Of these, Barnard College and Teachers College are integrated as Faculties of the university. Students from both Teachers College and Barnard College graduate with Columbia University degrees. Furthermore, Teachers College is incorporated as an academic department of Columbia University, serving as the University's Graduate School of Education and Department of Education. Joint undergraduate programs are available through the Jewish Theological Seminary of America as well as through the Juilliard School.\n\nRankings\n\nColumbia University was ranked 2nd among U.S. colleges for 2017 by Wall Street Journal and Times Higher Education and 2nd among Ivy League schools. It was ranked 4th overall among U.S. national universities for 2016 by U.S. News & World Report. Individual colleges and schools were also nationally ranked by U.S. News & World Report for its 2016 edition. Columbia Law School was ranked tied for 4th, the Mailman School of Public Health 5th, the School of Social Work 5th, Teachers College (Columbia Graduate School of Education) 7th, Columbia Business School 8th, the College of Physicians and Surgeons tied for 6th for research (and tied for 51st for primary care), the Graduate School of Arts 6th, the School of Nursing tied for 8th, and the Fu Foundation School of Engineering and Applied Science (graduate) was ranked 13th.\n\nIn 2017, Columbia was ranked 8th in the world by Academic Ranking of World Universities, 18th in the world by QS World University Rankings, 14th globally by Times Higher Education World University Rankings, and 8th in the world by U.S. News and World Report.\n\nRankings by other organizations include the Graduate School of Architecture, Planning and Preservation #2,[http://archinect.com/news/article/60523655/di-releases-design-school-rankings-for-2013 DI releases Design School Rankings for 2013], Archinect News, Reporting rankings from DesignIntelligence for best Architecture and Design Schools. By James P. Cramer of DI. November 1, 2012. Retrieved November 3, 2012. and its Graduate School of Journalism #1.Education Portalhttp://education-portal.com/top_journalism_colleges.html\n\nBetween 1996 and 2008, 18 Columbia affiliates have won Nobel Prizes, of whom nine are faculty members while one is an adjunct senior research scientist (Daniel Tsui) and the other a Global Fellow (Kofi Annan). Columbia faculty awarded the Nobel Prize include Richard Axel, Martin Chalfie, Eric Kandel, Tsung-Dao Lee, Robert Mundell, Orhan Pamuk, Edmund S. Phelps, Joseph Stiglitz, and Horst L. Stormer. Other awards and honors won by faculty include 30 MacArthur Foundation Award winners, 4 National Medal of Science recipients, 43 National Academy of Sciences Award winners, 20 National Academy of Engineering Award winners, 38 Institute of Medicine of the National Academies Award recipients and 143 American Academy of Arts and Sciences Award winners.\n\nIn 2015, Columbia University was ranked the first in the state by average professor salaries. In 2011, the Mines ParisTech : Professional Ranking World Universities ranked Columbia 3rd best university for forming CEOs in the US and 12th worldwide.\n\nResearch\n\nColumbia was the first North American site where the uranium atom was split. The College of Physicians and Surgeons played a central role in developing the modern understanding of neuroscience with the publication of Principles of Neural Science, described by historian of science Katja Huenther as the \"neuroscience 'bible'\". The book was written by a team of Columbia researchers that included Nobel Prize winner Eric Kandel, James H. Schwartz, and Thomas Jessell. Columbia was the birthplace of FM radio and the laser. The MPEG-2 algorithm of transmitting high quality audio and video over limited bandwidth was developed by Dimitris Anastassiou, a Columbia professor of electrical engineering. Biologist Martin Chalfie was the first to introduce the use of Green Fluorescent Protein (GFP) in labeling cells in intact organisms. Other inventions and products related to Columbia include Sequential Lateral Solidification (SLS) technology for making LCDs, System Management Arts (SMARTS), Session Initiation Protocol (SIP) (which is used for audio, video, chat, instant messaging and whiteboarding), pharmacopeia, Macromodel (software for computational chemistry), a new and better recipe for glass concrete, Blue LEDs, and Beamprop (used in photonics).\nColumbia scientists have been credited with about 175 new inventions in the health sciences each year. More than 30 pharmaceutical products based on discoveries and inventions made at Columbia are on the market today. These include Remicade (for arthritis), Reopro (for blood clot complications), Xalatan (for glaucoma), Benefix, Latanoprost (a glaucoma treatment), shoulder prosthesis, homocysteine (testing for cardiovascular disease), and Zolinza (for cancer therapy). Columbia Technology Ventures (formerly Science and Technology Ventures), , manages some 600 patents and more than 250 active license agreements. Patent-related deals earned Columbia more than $230 million in the 2006 fiscal year, according to the university, more than any university in the world. Columbia owns many unique research facilities, such as the Columbia Institute for Tele-Information dedicated to telecommunications and the Goddard Institute for Space Studies, which is an astronomical observatory affiliated with NASA.\n\nStudent life\n\nStudents\n\nIn fall 2014, Columbia University's student population was 29,870 (8,559 students in undergraduate programs and 21,311 in postgraduate programs), with 39% of the student population identifying themselves as a minority and 28% born outside of the United States. Twenty-six percent of students at Columbia have family incomes below $60,000, making it one of the most socioeconomically diverse top-tier colleges. Sixteen percent of students at Columbia receive Federal Pell Grants, which mostly go to students whose family incomes are below $40,000. Fifteen percent of students are the first member of their family to attend a four-year college.\n\nOn-campus housing is guaranteed for all four years as an undergraduate. Columbia College and the Fu Foundation School of Engineering and Applied Science (also known as SEAS or Columbia Engineering) share housing in the on-campus residence halls. First-year students usually live in one of the large residence halls situated around South Lawn: Hartley Hall, Wallach Hall (originally Livingston Hall), John Jay Hall, Furnald Hall or Carman Hall. Upperclassmen participate in a room selection process, wherein students can pick to live in a mix of either corridor- or apartment-style housing with their friends. The Columbia University School of General Studies, Barnard College and graduate schools have their own apartment-style housing in the surrounding neighborhood.\n\nColumbia University is home to many fraternities, sororities, and co-educational Greek organizations. Approximately 10–15% of undergraduate students are associated with Greek life.[http://www.studentaffairs.columbia.edu/admissions/faq/campus.php#4 Office of Undergraduate Admissions site about Campus Life]. Retrieved September 12, 2007. Many Barnard women also join Columbia sororities. There has been a Greek presence on campus since the establishment in 1836 of the Delta Chapter of Alpha Delta Phi. The InterGreek Council is the self-governing student organization that provides guidelines and support to its member organizations within each of the three councils at Columbia, the Interfraternity Council, Panhellenic Council, and Multicultural Greek Council. The three council presidents bring their affiliated chapters together once a month to meet as one Greek community. The InterGreek Council meetings provide opportunity for member organizations to learn from each other, work together and advocate for community needs.\n\nPublications\n\nColumbia University is home to a rich diversity of undergraduate, graduate, and professional publications. The Columbia Daily Spectator is the nation's second-oldest student newspaper; and The Blue and White, a monthly literary magazine established in 1890, has recently begun to delve into campus life and local politics in print and on its daily blog, dubbed the Bwog. The Morningside Post is a student-run multimedia news publication. Its content: student-written investigative news, international affairs analysis, opinion, and satire.\n\nPolitical publications include The Current, a journal of politics, culture and Jewish Affairs; the Columbia Political Review, the multi-partisan political magazine of the Columbia Political Union; and AdHoc, which denotes itself as the \"progressive\" campus magazine and deals largely with local political issues and arts events.\n\nArts and literary publications include The Columbia Review, the nation's oldest college literary magazine; Columbia, a nationally regarded literary journal; the Columbia Journal of Literary Criticism; and The Mobius Strip, an online arts and literary magazine. Inside New York is an annual guidebook to New York City, written, edited, and published by Columbia undergraduates. Through a distribution agreement with Columbia University Press, the book is sold at major retailers and independent bookstores.\n\nColumbia is home to numerous undergraduate academic publications. The Journal of Politics & Society, is a journal of undergraduate research in the social sciences, published and distributed nationally by the Helvidius Group; Publius is an undergraduate journal of politics established in 2008 and published biannually; the Columbia East Asia Review allows undergraduates throughout the world to publish original work on China, Japan, Korea, Tibet, and Vietnam and is supported by the Weatherhead East Asian Institute; and The Birch, is an undergraduate journal of Eastern European and Eurasian culture that is the first national student-run journal of its kind; the Columbia Political Review, the undergraduate magazine on politics operated by the Columbia Political Union; the Columbia Economics Review, the undergraduate economic journal on research and policy supported by the Columbia Economics Department; and the Columbia Science Review is a science magazine that prints general interest articles, faculty profiles, and student research papers.\n\nThe Fed a triweekly satire and investigative newspaper, and the Jester of Columbia, the newly (and frequently) revived campus humor magazine both inject humor into local life. Other publications include The Columbian, the undergraduate colleges' annually published yearbook the Gadfly, a biannual journal of popular philosophy produced by undergraduates; and Rhapsody in Blue, an undergraduate urban studies magazine. Professional journals published by academic departments at Columbia University include Current Musicology and The Journal of Philosophy. During the spring semester, graduate students in the Journalism School publish The Bronx Beat, a bi-weekly newspaper covering the South Bronx. Teachers College publishes the Teachers College Record, a journal of research, analysis, and commentary in the field of education, published continuously since 1900.\n\nFounded in 1961 under the auspices of Columbia University's Graduate School of Journalism, the Columbia Journalism Review (CJR) examines day-to-day press performance as well as the forces that affect that performance. The magazine is published six times a year, and offers a reporting, analysis, criticism, and commentary. CJR.org, its web site, delivers real-time criticism and reporting, giving CJR a presence in the ongoing conversation about the media.\n\nBroadcasting\n\nColumbia is home to two pioneers in undergraduate campus radio broadcasting, WKCR-FM and CTV. Many undergraduates are also involved with Barnard's radio station, WBAR. WKCR, the student run radio station that broadcasts to the Tri-State area, claims to be the oldest FM radio station in the world, owing to the university's affiliation with Major Edwin Armstrong. The station went operational on July 18, 1939, from a 400-foot antenna tower in Alpine, New Jersey, broadcasting the very first FM transmission in the world. Initially, WKCR wasn't a radio station, but an organization concerned with the technology of radio communications. As membership grew, however, the nascent club turned its efforts to broadcasting. Armstrong helped the students in their early efforts, donating a microphone and turntables when they designed their first makeshift studio in a dorm room. The station has its studios on the second floor of Alfred Lerner Hall on the Morningside campus with its main transmitter tower at 4 Times Square in Midtown Manhattan. Columbia Television (CTV) is the nation's second oldest Student television station and home of CTV News, a weekly live news program produced by undergraduate students.\n\nDebate and Model UN\n\nThe Philolexian Society is a literary and debating club founded in 1802, making it the oldest student group at Columbia, as well as the third oldest collegiate literary society in the country. The society annually administers the Joyce Kilmer Bad Poetry Contest. The Columbia Parliamentary Debate Team competes in tournaments around the country as part of the American Parliamentary Debate Association, and hosts both high school and college tournaments on Columbia's campus, as well as public debates on issues affecting the university.\n\nThe Columbia International Relations Council and Association (CIRCA), oversees Columbia's Model United Nations activities. CIRCA hosts college and high school Model UN conferences, hosts speakers influential in international politics to speak on campus, trains students from underprivileged schools in New York in Model UN and oversees a competitive team, which travels to colleges around the country and to an international conference every year. The competitive team consistently wins best and outstanding delegation awards and is considered one of the top teams in the country.\n\nTechnology and entrepreneurship\n\nThe Columbia University Organization of Rising Entrepreneurs (CORE) was founded in 1999. The student-run group aims to foster entrepreneurship on campus. Each year CORE hosts dozens of events, including talks, #StartupColumbia, a conference and venture competition for $250,000, and Ignite@CU, a weekend for undergrads interested in design, engineering, and entrepreneurship. Notable speakers include Peter Thiel, Jack Dorsey, Alexis Ohanian, Drew Houston, and Mark Cuban. By 2006, CORE had awarded graduate and undergraduate students over $100,000 in seed capital.\n\nCampusNetwork, an on-campus social networking site called Campus Network that preceded Facebook, was created and popularized by Columbia engineering student Adam Goldberg in 2003. Mark Zuckerberg later asked Goldberg to join him in Palo Alto to work on Facebook, but Goldberg declined the offer. The Fu Foundation School of Engineering and Applied Science offers a minor in Technical Entrepreneurship through its Center for Technology, Innovation, and Community Engagement. SEAS' entrepreneurship activities focus on community building initiatives in New York and worldwide, made possible through partners such as Microsoft Corporation.\n\nColumbia is a top supplier of young engineering entrepreneurs for New York City. Over the past 20 years, graduates of Columbia established over 100 technology companies. Mayor Bloomberg has provided over $6.7 million towards entrepreneurial programs that partner with Columbia and other universities in New York. Professor Chris Wiggins of the Fu Foundation School of Engineering and Applied Science is working in conjunction with Professors Evan Korth of New York University and Hilary Mason, chief scientist at bit.ly to facilitate the growth of student tech-startups in an effort to transform a traditionally financially centered New York City into the next Silicon Valley. Their website, hackny.org, is a gathering ground of ideas and discussions for New York's young entrepreneurial community, the Silicon Alley.\n\nOn June 14, 2010, Mayor Michael R. Bloomberg launched the NYC Media Lab to promote innovations in New York's media industry. Situated at the New York University Tandon School of Engineering, the lab is a consortium of Columbia University, New York University, and New York City Economic Development Corporation acting to connect companies with universities in new technology research. The Lab is modeled after similar ones at MIT and Stanford. A $250,000 grant from the New York City Economic Development Corporation was used to establish the NYC Media Lab. Each year, the lab will host a range of roundtable discussions between the private sector and academic institutions. It will support research projects on topics of content format, next-generation search technologies, computer animation for film and gaming, emerging marketing techniques, and new devices development. The lab will also create a media research and development database. Columbia University will coordinate the long-term direction of the media lab as well as the involvement of its faculty and those of other universities.\n\nAthletics\n\nA member institution of the National Collegiate Athletic Association (NCAA) in Division I FCS, Columbia fields varsity teams in 29 sports and is a member of the Ivy League. The football Lions play home games at the 17,000-seat Robert K. Kraft Field at Lawrence A. Wien Stadium. The Baker Athletics Complex also includes facilities for baseball, softball, soccer, lacrosse, field hockey, tennis, track and rowing, as well as the new Campbell Sports Center opened in January 2013.  The basketball, fencing, swimming & diving, volleyball and wrestling programs are based at the Dodge Physical Fitness Center on the main campus.\n\nColumbia University athletics has a long history, with many accomplishments in athletic fields. In 1870, Columbia played against Rutgers University in the second football game in the history of the sport. Eight years later, Columbia crew won the famed Henley Royal Regatta in the first-ever defeat for an English crew rowing in English waters. In 1900, Olympian and Columbia College student Maxie Long set the first official world record in the 400 meters with a time of 47.8 seconds. In 1983, Columbia men's soccer went 18-0 and was ranked first in the nation, but lost to Indiana 1-0 in double overtime in the NCAA championship game; nevertheless, the team went further toward the NCAA title than any Ivy League soccer team in history. The football program unfortunately is best known for its record of futility set during the 1980s: between 1983 and 1988, the team lost 44 games in a row, which is still the record for the NCAA Football Championship Subdivision. The streak was broken on October 8, 1988, with a 16-13 victory over archrival Princeton University. That was the Lions' first victory at Wien Stadium, which had been opened during the losing streak and was already four years old.[http://www.wikicu.com/Losing_streak Losing streak – WikiCU, the Columbia University wiki encyclopedia]. Wikicu.com. Retrieved on September 7, 2013. A new tradition has developed with the Liberty Cup. The Liberty Cup is awarded annually to the winner of the football game between Fordham and Columbia Universities, two of the only three NCAA Division I football teams in New York City. The tradition began in 2002, a year after the Fordham-Columbia game was postponed due to the September 11 attacks.\n\nFormer students include Baseball Hall of Famers Lou Gehrig and Eddie Collins, football Hall of Famer Sid Luckman, Marcellus Wiley, and world champion women's weightlifter Karyn Marshall. On May 17, 1939, fledgling NBC broadcast a doubleheader between the Columbia Lions and the Princeton Tigers at Columbia's Baker Field, making it the first televised regular athletic event in history.[http://www.college.columbia.edu/cct/spr99/34a.html Baker Field: Birthplace of Sports Television] . Columbia University.\n\nWorld Leaders Forum\n\nEstablished in 2003 by university president Lee C. Bollinger, the World Leaders Forum at Columbia University provides the opportunity for undergraduate and graduate students alike to listen to world leaders in government, religion, industry, finance, and academia. The World Leaders Forum is a year-around event series that strives to provide a platform for uninhibited speech among nations and cultures, while educating students about problems and progress around the globe.\n\nAll Columbia undergraduates and graduates as well as students of Barnard College and other Columbia affiliated schools can register to participate in the World Leaders Forum using their student IDs. Even for individuals who do not have the privilege to attend the event live, they can watch the forum via online videos on Columbia University's website.\n\nPast forum speakers include former President of the United States Bill Clinton, the Prime Minister of India Atal Bihari Vajpayee, Former President of Ghana John Agyekum Kufuor, President of Afghanistan Hamid Karzai, Prime Minister of Russia Vladimir Putin, President of the Republic of Mozambique Joaquim Alberto Chissano, President of the Republic of Bolivia Carlos Diego Mesa Gisbert, President of the Republic of Romania Ion Iliescu, President of the Republic of Latvia Vaira Vīķe-Freiberga, the first female President of Finland Tarja Halonen, President Yudhoyono of Indonesia, President Pervez Musharraf of the Islamic Republic of Pakistan, Iraq President Jalal Talabani, the 14th Dalai Lama, President of the Islamic Republic of Iran Mahmoud Ahmadinejad, financier George Soros, Mayor of New York City Michael R. Bloomberg, President Václav Klaus of the Czech Republic, President Cristina Fernández de Kirchner of Argentina, former Secretary-General of the United Nations Kofi Annan, and Al Gore.\n\nOther\n\nThe Columbia University Orchestra was founded by composer Edward MacDowell in 1896, and is the oldest continually operating university orchestra in the United States. Undergraduate student composers at Columbia may choose to become involved with Columbia New Music, which sponsors concerts of music written by undergraduate students from all of Columbia's schools.\n\nThere are a number of performing arts groups at Columbia dedicated to producing student theater, including the Columbia Players, King's Crown Shakespeare Troupe (KCST), Columbia Musical Theater Society (CMTS), NOMADS (New and Original Material Authored and Directed by Students), LateNite Theatre, Columbia University Performing Arts League (CUPAL), Black Theatre Ensemble (BTE), sketch comedy group Chowdah, and improvisational troupes Alfred and Fruit Paunch. The Columbia University Marching Band tells jokes during the campus tradition of Orgo Night.\n\nThe Columbia Queer Alliance is the central Columbia student organization that represents the bisexual, lesbian, gay, transgender, and questioning student population. It is the oldest gay student organization in the world, founded as the Student Homophile League in 1967 by students including lifelong activist Stephen Donaldson. Columbia University campus military groups include the U.S. Military Veterans of Columbia University and Advocates for Columbia ROTC. In the 2005–06 academic year, the Columbia Military Society, Columbia's student group for ROTC cadets and Marine officer candidates, was renamed the Hamilton Society for \"students who aspire to serve their nation through the military in the tradition of Alexander Hamilton\".\n\nThe university also houses an independent nonprofit organization, Community Impact, which strives to serve disadvantaged people in the Harlem, Washington Heights, and Morningside Heights communities. From its earliest inception as a single service initiative formed in 1981 by Columbia University undergraduates, Community Impact has grown into Columbia University's largest student service organization. CI provides food, clothing, shelter, education, job training, and companionship for residents in its surrounding communities. CI consists of a dedicated corps of about 950 Columbia University student volunteers participating in 25 community service programs, which serve more than 8,000 people each year.\n\nStudent activism\n\nProtests of 1968\n\nStudents initiated a major demonstration in 1968 over two main issues. The first was Columbia's proposed gymnasium in neighboring Morningside Park; this was seen by the protesters to be an act of aggression aimed at the black residents of neighboring Harlem. A second issue was the Columbia administration's failure to resign its institutional membership in the Pentagon's weapons research think-tank, the Institute for Defense Analyses (IDA). Students barricaded themselves inside Low Library, Hamilton Hall, and several other university buildings during the protests, and New York City police were called onto the campus to arrest or forcibly remove the students.[https://www.nytimes.com/2008/04/28/nyregion/28columbia.html \"Columbia's Radicals of 1968 Hold a Bittersweet Reunion\"]. The New York Times. April 28, 2008.\n\nThe protests achieved two of their stated goals. Columbia disaffiliated from the IDA and scrapped the plans for the controversial gym, building a subterranean physical fitness center under the north end of campus instead.  A popular myth states that the gym's plans were eventually used by Princeton University for the expansion of its athletic facilities, but as Jadwin Gymnasium was already 50% complete by 1966 (when the Columbia gym was announced) this was clearly not correct.Hevesi, Dennis. [http://spectatorarchive.library.columbia.edu/cgi-bin/columbia?ad&d\ncs19660920-01.2.16&e=-------en-20--10062--txt-IN-Columbia----l \"Gym Groundbreaking Will Be Held Next Month\"], Columbia Spectator, September 29, 1966.  At least 30 Columbia students were suspended by the administration as a result of the protests. Many of the Class of '68 walked out of their graduation and held a countercommencement on Low Plaza with a picnic following at Morningside Park, the place where the protests began. The protests hurt Columbia financially as many potential students chose to attend other universities and some alumni refused to donate money to the school. Allan Bloom, a professor of philosophy at the University of Chicago,\nbelieved that the protest efforts at Columbia were responsible for pushing higher education further toward the liberal left. As a result of the protests, Bloom stated, \"American universities were no longer places of intellectual and academic debate, but rather places of 'political correctness' and liberalism.\" \n\nProtests against racism and apartheid\n\nFurther student protests, including hunger strike and more barricades of Hamilton Hall and the Business School\"Disinvestment from South Africa#University campuses\" during the late 1970s and early 1980s, were aimed at convincing the university trustees to divest all of the university's investments in companies that were seen as active or tacit supporters of the apartheid regime in South Africa. A notable upsurge in the protests occurred in 1978, when following a celebration of the tenth anniversary of the student uprising in 1968, students marched and rallied in protest of university investments in South Africa. The Committee Against Investment in South Africa (CAISA) and numerous student groups including the Socialist Action Committee, the Black Student Organization and the Gay Students group joined together and succeeded in pressing for the first partial divestment of a U.S. university.\n\nThe initial (and partial) Columbia divestment,\nfocused largely on bonds and financial institutions directly involved with the South African regime. It followed a year-long campaign first initiated by students who had worked together to block the appointment of former United States Secretary of State Henry Kissinger to an endowed chair at the university in 1977.\n\nBroadly backed by student groups and many faculty members the Committee Against Investment in South Africa held teach-ins and demonstrations through the year focused on the trustees ties to the corporations doing business with South Africa. Trustee meetings were picketed and interrupted by demonstrations culminating in May 1978 in the takeover of the Graduate School of Business.\n\nAhmadinejad speech controversy\n\nThe School of International and Public Affairs extends invitations to heads of state and heads of government who come to New York City for the opening of the fall session of the United Nations General Assembly. In 2007, Iranian President Mahmoud Ahmadinejad was one of those invited to speak on campus. Ahmadinejad accepted his invitation and spoke on September 24, 2007, as part of Columbia University's World Leaders Forum. The invitation proved to be highly controversial. Hundreds of demonstrators swarmed the campus on September 24 and the speech itself was televised worldwide. University President Lee C. Bollinger tried to allay the controversy by letting Ahmadenijad speak, but with a negative introduction (given personally by Bollinger). This did not mollify those who were displeased with the fact that the Iranian leader had been invited onto the campus. Columbia students, though, turned out en masse to listen to the speech on the South Lawn. An estimated 2,500 undergraduates and graduates came out for the historic occasion.\n\nDuring his speech, Ahmadinejad criticized Israel's policies towards the Palestinians; called for research on the historical accuracy of the Holocaust; raised questions as to who initiated the 9/11 attacks; defended Iran's nuclear power program, criticizing the UN's policy of sanctions on his country; and attacked U.S. foreign policy in the Middle East. In response to a question about Iran's treatment of women and homosexuals, he asserted that women are respected in Iran and that \"In Iran, we don't have homosexuals like in your country... In Iran, we do not have this phenomenon. I don't know who told you this.\" The latter statement drew laughter from the audience. The Manhattan District Attorney's Office accused Columbia of accepting grant money from the Alavi Foundation to support faculty \"sympathetic\" to Iran's Islamic republic.\n\nROTC controversy\n\nBeginning in 1969, during the Vietnam War, the university did not allow the U.S. military to have Reserve Officers' Training Corps (ROTC) programs on campus,Feith, David J., \"[http://article.nationalreview.com/?qMGQ2Y2YyYTAxOTliMzQ3NjE2MmY1YzE3ZTI2YzIwMjQ\n Duty, Honor, Country… and Columbia]\", National Review, September 15, 2008.   though Columbia students could participate in ROTC programs at other local colleges and universities.[http://www.fordham.edu/academics/special_programs/army_rotc_ram_battal/affiliated_instituti_29928.asp Army ROTC at Fordham University]  Accessed September 9, 2010[http://www.sunymaritime.edu/NROTC/Command%20Information/Command.aspx/ NAVY ROTC IN NEW YORK CITY]   At a forum at the university during the 2008 presidential election campaign, both John McCain and Barack Obama said that the university should consider reinstating ROTC on campus.McGurn, William, \"[http://s.wsj.net/article/SB122273091416788171.html A Columbia Marine To Obama: Help!]\", Wall Street Journal, September 30, 2008, Page 17.[https://www.nrotc.navy.mil/colleges-univers.cfm Colleges and Universities with NROTC Units]   After the debate, the President of the University, Lee C. Bollinger, stated that he did not favor reinstating Columbia's ROTC program, because of the military's anti-gay policies. In November 2008, Columbia's undergraduate student body held a referendum on the question of whether or not to invite ROTC back to campus, and the students who voted were almost evenly divided on the issue. ROTC lost the vote (which would not have been binding on the administration, and did not include graduate students, faculty, or alumni) by a fraction of a percentage point.\n\nIn April 2010 during Admiral Mike Mullen's address at Columbia, President Lee C. Bollinger stated that the ROTC would be readmitted to campus if the admiral's plans for revoking the don't ask, don't tell policy were successful. In February 2011 during one of three town-hall meetings on the ROTC ban, former Army staff sergeant Anthony Maschek, a Purple Heart recipient for injuries sustained during his service in Iraq, was booed and hissed at by some students during his speech promoting the idea of allowing the ROTC on campus.Karni, Annie, \"[http://www.nypost.com/p/news/local/manhattan/hero_unwelcome_Zi3u1fwtRpo87vXAiAQfSN]\", New York Post, February 20, 2011. In April 2011 the Columbia University Senate voted to welcome the ROTC program back on campus.[http://www.huffingtonpost.com/2011/04/02/columbia-rotc_n_843992.html], \"Huff Post College\", April 2, 2011. Secretary of the Navy Ray Mabus and Columbia University President Lee C. Bollinger signed an agreement to reinstate Naval Reserve Officers Training Corps (NROTC) program at Columbia for the first time in more than 40 years on May 26, 2011. The agreement was signed at a ceremony on board the , docked in New York for the Navy's annual Fleet Week. \"Navy and Columbia Sign NROTC Agreement,\" May 26, 2011\n\nDivestment from private prisons \n\nIn February 2014, after learning that the university had over $10 million invested in the private prison industry, a group of students delivered a letter President Bollinger’s office requesting a meeting and officially launching the Columbia Prison Divest (CPD) campaign. As of June 30, 2013, Columbia held investments in Corrections Corporation of America, the largest private prison company in the United States, as well as G4s, the largest multinational security firm in the world. Students demanded that the university divest these holdings from the industry and instate a ban on future investments in the private prison industry. Aligning themselves with the growing Movement for Black Lives and in conversation with the heightened attention on race and the system of mass incarceration, CPD student activists hosted events to raise awareness of the issue and worked to involve large numbers of members of the Columbia and West Harlem community in campaign activities. After eighteen months of student driven organizing, the Board of Trustees of Columbia University voted to support the petition for divestment from private prison companies, which was confirmed to student leaders on June 22, 2015. The Columbia Prison Divest campaign was the first campaign to successfully get a U.S. university to divest from the private prison industry.\n\nTraditions\n\nOrgo Night\n\nFrom 1975 until 2016, at midnight on the day of the Organic Chemistry exam—which is often on the first day of finals—the Columbia University Marching Band occupied Butler Library to distract students from studying. After about forty-five minutes of jokes and music, the procession would move out to the lawn in front of Hartley, Wallach and John Jay residence halls to entertain the residents there. The band then plays at other locations around Morningside Heights, including the residential quadrangle of Barnard College. The band tends to close their Orgo Night performances at Furnald Hall, where the underclassmen in the band sing a mock-hymn to Columbia and its graduating seniors, composed of quips that poke fun at the stereotypes about the Columbia student body.\n\nIn December 2016, University administrators banned the Marching Band from performing its Orgo Night show in its traditional Butler Library location, which resulted in protests and accusations of censorship. Alumni published series of pamphlets addressing the issues in order to try to restore the show.  University administration continued to prohibit the traditional Orgo Night performance during the spring semester of 2017, prompting the Marching Band to again stage the show outside the library on May 4, 2017, as objections from alumni persisted.  University administrators sent a letter to the alumni in which they said that they were working with current Band leadership concerning the future of Orgo Night, but band leadership stated that they had received no correspondence from the university. For the winter 2017 Orgo Night show, the Marching Band performed in Butler Library despite the University's ban on the event.\n\nTree-Lighting and Yule Log ceremonies\n\nThe campus Tree-Lighting Ceremony was inaugurated in 1998. It celebrates the illumination of the medium-sized trees lining College Walk in front of Kent and Hamilton Halls on the east end and Dodge and Journalism Halls on the west, just before finals week in early December. The lights remain on until February 28. Students meet at the sun-dial for free hot chocolate, performances by a cappella groups, and speeches by the university president and a guest.\n\nImmediately following the College Walk festivities is one of Columbia's older holiday traditions, the lighting of the Yule Log. The Christmas ceremony dates to a period prior to the American Revolutionary War, but lapsed before being revived by University President Nicholas Murray Butler in the early 20th century. A troop of students dressed as Continental Army soldiers carry the eponymous log from the sun-dial to the lounge of John Jay Hall, where it is lit amid the singing of seasonal carols. The Christmas ceremony is accompanied by a reading of A Visit From St. Nicholas by Clement Clarke Moore and Yes, Virginia, There is a Santa Claus by Francis Pharcellus Church.\n\nThe Varsity Show\n\nThe Varsity Show is an annual musical written by and for students and was established in 1894, making it one of Columbia's oldest traditions. Past writers and directors have included Columbians Richard Rodgers and Oscar Hammerstein, Lorenz Hart, I.A.L. Diamond, and Herman Wouk. The show has one of the largest operating budgets of all university events.\n\nNotable people\n\nAs of 2011, Columbia alumni included three United States Presidents, 26 foreign Heads of State, ten Justices of the Supreme Court of the United States (including three Chief Justices) and 39 Nobel winners. As of 2011, alumni also have received more than 35 National Book Awards and 123 Pulitzer Prizes. Today, two United States Senators and 16 Chief Executives of Fortune 500 companies hold Columbia degrees, as do three of the 25 richest Americans and 20 living billionaires. Columbia is second only to Harvard in the number of living billionaire graduates. Five Founding Fathers including an author of the United States Constitution and a member of the Committee of Five are alumni of Columbia University, then named \"King's College\".\n\nFormer U.S. Presidents Theodore Roosevelt and Franklin Delano Roosevelt attended the law school. Other more recent political figures educated at Columbia include former U.S President Barack Obama, Associate Justice of the U.S. Supreme Court Ruth Bader Ginsburg, former U.S. Secretary of State Madeleine Albright, former chairman of the U.S. Federal Reserve Bank Alan Greenspan, U.S. Attorney General Eric Holder, and U.S. Solicitor General Donald Verrilli Jr. Dwight D. Eisenhower served as the thirteenth president of Columbia University from 1948 to 1953. The university has also educated 26 foreign heads of state, including President of Georgia Mikheil Saakashvili, President of East Timor Jose Ramos Horta, President of Estonia Toomas Hendrik Ilves and other historical figures such as Wellington Koo, Radovan Karadžić, Gaston Eyskens, and T. V. Soong. The author of India's constitution and Dalit leader Dr. B. R. Ambedkar was also an alumnus of Columbia.\n\nAlumni of Columbia have occupied top positions in Wall Street and the rest of the business world. Notable members of the Astor family attended Columbia, while some recent business graduates include investor Warren Buffett, former CEO of PBS and NBC Larry Grossman, chairman of Wal-Mart S. Robson Walton and Bain Capital Co-Managing Partner, Jonathan Lavine. CEO's of top Fortune 500 companies include James P. Gorman of Morgan Stanley,The Age (2009). [http://www.theage.com.au/business/melbourneraised-gorman-new-chief-of-morgan-stanley-20090911-fkw8.html Melbourne-raised Gorman new chief of Morgan Stanley]. Retrieved September 13, 2009. Robert J. Stevens of Lockheed Martin, Philippe Dauman of Viacom, Ursula Burns of Xerox, and Vikram Pandit of Citigroup. Notable labor organizer and women's educator Louise Leonard McLaren received her degree of Master of Arts from Columbia.\n\nIn science and technology, Columbia alumni include: founder of IBM Herman Hollerith; inventor of FM radio Edwin Armstrong; Francis Mechner; integral in development of the nuclear submarine Hyman Rickover; founder of Google China Kai-Fu Lee; scientists Stephen Jay Gould,Green, Michelle (1986). [http://www.stephenjaygould.org/library/green_sjgould.html \"Stephen Jay Gould: driven by a hunger to learn and to write\".] People 25 (June 2): 109-114. Robert Millikan, Helium–neon laser inventor Ali Javan and Mihajlo Pupin; chief-engineer of the New York City Subway, William Barclay Parsons; philosophers Irwin Edman and Robert Nozick; economist Milton Friedman; and psychologist Harriet Babcock.\n\nMany Columbia alumni have gone on to renowned careers in the arts, including composers Richard Rodgers,Rodgers, Richard. Musical Stages: An Autobiography (2002 Reissue), pp. 12, 20–21, 44. Cambridge, MA: Da Capo Press.  Oscar Hammerstein II, Lorenz Hart,[https://www.pbs.org/wnet/broadway/stars/hart_l.html Hughson Mooney, \"Lorenz Hart\"] , PBS, Excerpted from the DICTIONARY OF AMERICAN BIOGRAPHY, SUPPLEMENT 3: 1941–1945. American Council of Learned Societies, 1973. Reprinted by permission of the American Council of Learned Societies, retrieved April 18, 2011 and Art Garfunkel.Herman, Jan (February 6, 1977). [http://www.artgarfunkel.com/articles/gannett.html \"TV Makes You Famous; Rock 'n Roll Makes You Rich\"]. Gannett News Service. Four United States Poet Laureates received their degrees from Columbia. Columbia alumni have made an indelible mark in the field of American poetry and literature, with such people as Jack Kerouac and Allen Ginsberg, pioneers of the Beat Generation,Literature Resource Center: [http://go.galegroup.com/ps/i.do?idGALE%7CH1410002462&v\n2.1&uiuclassb&it\nr&pLitRC&sw\nw&asid=468444b0b09aacc2b7192350d1606bb6 \"The Beat Generation\"]. Retrieved November 13, 2013. and Langston Hughes, a seminal figure in the Harlem Renaissance, all having attended the university. Other notable writers who attended Columbia include authors Isaac Asimov, J.D. Salinger, Upton Sinclair,Encyclopædia Britannica: [http://www.britannica.com/EBchecked/topic/545642/Upton-Sinclair \"Upton Sinclair\"]. Retrieved April 15, 2011. Danielle Valore Evans, and Hunter S. Thompson.\n\nUniversity alumni have also been very prominent in the film industry, with 28 alumni and former students winning a combined 39 Academy Awards (as of 2011), second in the world only to New York University (NYU). Some notable Columbia alumni that have gone on to work in film include directors Sidney Lumet (12 Angry Men) and Kathryn Bigelow (The Hurt Locker), screenwriters Howard Koch (Casablanca) and Joseph L. Mankiewicz (All About Eve), and actors James Cagney and Ed Harris.\n\nFile:Alexander Hamilton portrait by John Trumbull 1806.jpg|Alexander Hamilton, Founding Father of the United States, the first United States Secretary of the Treasury, King's College\nFile:John Jay (Gilbert Stuart portrait).jpg|John Jay, Founding Father of the United States, the first Chief Justice of the Supreme Court, King's College\nFile:Gouverneur Morris 1789.jpg|Gouverneur Morris, Founding Father of the United States, author of the United States Constitution and Senator from New York, King's College\nFile:President Barack Obama.jpg|Barack Obama, 44th President of the United States and Nobel laureate, Columbia College\nFile:Judge Gorsuch official portrait.jpg|Neil Gorsuch, Associate Justice of the Supreme Court of the United States, Columbia College\nFile:President Theodore Roosevelt, 1904.jpg|Theodore Roosevelt, President of the United States and Nobel laureate, Columbia Law School\nFile:FDR in 1933.jpg|Franklin D. Roosevelt, President of the United States, Columbia Law School\nFile:Ruth Bader Ginsburg official SCOTUS portrait.jpg|Ruth Bader Ginsburg, Associate Justice of the Supreme Court of the United States, Columbia Law School\nFile:Hollerith.jpg|Herman Hollerith, co-founder of IBM, Columbia University School of Mines\nFile:Robert Kraft at Patriots at Raiders 12-14-08.JPG|Robert Kraft, billionaire, owner of the New England Patriots, Chairman and CEO of the Kraft Group, Columbia College\nFile:O'Keeffe-(hands).jpg|Georgia O'Keeffe, American artist, recognized as the \"Mother of American modernism\", Teachers College\nFile:S. Robson Walton by Gage Skidmore.jpg|S. Robson Walton, one of the world's wealthiest people, Chairman of Walmart, Columbia Law School\nFile:Warren Buffett KU Visit.jpg|Warren Buffett, CEO of Berkshire Hathaway and one of the world's wealthiest people, Columbia Business School\nFile:Portrait of Milton Friedman.jpg|Milton Friedman, Nobel laureate, Columbia University Graduate School of Arts and Sciences\nFile:Secalbright.jpg|Madeleine Albright, first female Secretary of State, Columbia University Graduate School of Arts and Sciences\nFile:Lou Gehrig as a new Yankee 11 Jun 1923.jpg|Lou Gehrig, 2-time AL MVP, 6-time World Series Champion, and member of Baseball Hall of Fame, Columbia College\nFile:Shirley Chisholm.jpg|Shirley Chisholm, first black woman elected to the United States Congress, Teachers College\nFile:Sidluckman.JPG|Sid Luckman, NFL MVP, 4-time NFL Champion, member of the Pro Football Hall of Fame, and member of the College Football Hall of Fame, Columbia College\nFile:Rodgers.jpg|Richard Rodgers, legendary Emmy; Grammy; Oscar; and Tony award-winning composer, Pulitzer Prize winner, Columbia College\nFile:Oscar Hammerstein - portrait.jpg|Oscar Hammerstein II, 8-time Tony Award winner, 2-time Academy Award winner, Columbia College\nFile:Allen Ginsberg 1979 - cropped.jpg|Allen Ginsberg, founder of Beat Generation, Columbia College\nFile:Dr. Bhim Rao Ambedkar.jpg|B. R. Ambedkar, jurist, economist, politician and social reformer; led committee that drafted Constitution of India and served as first Minister of Law and Justice, Graduate School of Arts and Sciences",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Columbia University" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6310" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Columbia University (Columbia; officially Columbia University in the City of New York), established in 1754, is a private Ivy League research university in Upper Manhattan, New York City. Columbia contains the oldest college in the state of New York and is the fifth chartered institution of higher learning in the United States, making it one of nine colonial colleges founded prior to the Declaration of Independence. It was established as King's College by royal charter of George II of Great Britain and renamed Columbia College in 1784 following the American Revolutionary War. The college has produced numerous distinguished alumni. It has been among the most selective colleges in the United States since its founding. With an undergraduate acceptance rate of 5.8%, it currently stands as the third most selective college in the United States and the second most selective in the Ivy League.http://www.businessinsider.com/most-selective-ivy-league-schools-2017-3\n\nA 1787 charter placed the institution under a private board of trustees before it was renamed Columbia University in 1896 when the campus was moved from Madison Avenue to its current location in Morningside Heights occupying 32 acres of land. Columbia is one of the fourteen founding members of the Association of American Universities and was the first school in the United States to grant the M.D. degree. The university administers the Pulitzer Prize annually.\n\nThe university is organized into twenty schools, including undergraduate schools such as Columbia College, the Fu Foundation School of Engineering and Applied Science, and the School of General Studies, as well as graduate schools such as Columbia Law School, Teachers College, Columbia College of Physicians and Surgeons, and Columbia Business School. The university also has global research outposts in Amman, Beijing, Istanbul, Paris, Mumbai, Rio de Janeiro, Santiago, Asunción and Nairobi. There are nearby institutions that are affiliated with Columbia including Barnard College, List College, and Union Theological Seminary. Columbia also has joint undergraduate programs available through the Jewish Theological Seminary of America, University College London, Sciences Po, City University of Hong Kong, Trinity College Dublin, and the Juilliard School.\n\nThe university has graduated many notable alumni. As of 2017, alumni and affiliates include 5 Founding Fathers of the United States – among these an author of the Declaration of Independence and an author of the United States Constitution; 10 Justices of the United States Supreme Court;  95 Nobel laureates; 20 living billionaires; 123 Pulitzer Prize winners; 39 Academy Award winners; 3 United States Presidents; 29 heads of state; 101 National Academy members; 77 National Medal of Science winners; and 23 National Humanities Medal recipients.\n\nHistory\n\nColonial\n\nDiscussions regarding the founding of a college in the Province of New York began as early as 1704, at which time Colonel Lewis Morris wrote to the Society for the Propagation of the Gospel in Foreign Parts, the missionary arm of the Church of England, persuading the society that New York City was an ideal community in which to establish a college. However, it was not until the founding of the College of New Jersey (the present Princeton University) across the Hudson River in New Jersey that the City of New York seriously consider founding a college. In 1746, an act was passed by the general assembly of New York to raise funds for the foundation of a new college. In 1751, the assembly appointed a commission of ten New York residents, seven of whom were members of the Church of England, to direct the funds accrued by the state lottery towards the foundation of a college.\n\nClasses were initially held in July 1754 and were presided over by the college's first president, Dr. Samuel Johnson. Dr. Johnson was the only instructor of the college's first class, which consisted of a mere eight students. Instruction was held in a new schoolhouse adjoining Trinity Church, located on what is now lower Broadway in Manhattan. The college was officially founded on October 31, 1754, as King's College by royal charter of King George II, making it the oldest institution of higher learning in the state of New York and the fifth oldest in the United States.\n\nIn 1763, Dr. Johnson was succeeded in the presidency by Myles Cooper, a graduate of The Queen's College, Oxford, and an ardent Tory. In the charged political climate of the American Revolution, his chief opponent in discussions at the college was an undergraduate of the class of 1777, Alexander Hamilton. The American Revolutionary War broke out in 1776, and was catastrophic for the operation of King's College, which suspended instruction for eight years beginning in 1776 with the arrival of the Continental Army. The suspension continued through the military occupation of New York City by British troops until their departure in 1783. The college's library was looted and its sole building requisitioned for use as a military hospital first by American and then British forces. Loyalists were forced to abandon their King's College in New York, which was seized by the rebels and renamed Columbia College. The Loyalists, led by Bishop Charles Inglis fled to Windsor, Nova Scotia, where they founded King's Collegiate School.\n\n18th century\n\nAfter the Revolution, the college turned to the State of New York in order to restore its vitality, promising to make whatever changes to the school's charter the state might demand. The Legislature agreed to assist the college, and on May 1, 1784, it passed \"an Act for granting certain privileges to the College heretofore called King's College\". The Act created a Board of Regents to oversee the resuscitation of King's College, and, in an effort to demonstrate its support for the new Republic, the Legislature stipulated that \"the College within the City of New York heretofore called King's College be forever hereafter called and known by the name of Columbia College\", a reference to Columbia, an alternative name for America. The Regents finally became aware of the college's defective constitution in February 1787 and appointed a revision committee, which was headed by John Jay and Alexander Hamilton. In April of that same year, a new charter was adopted for the college, still in use today, granting power to a private board of 24 Trustees.\n\nOn May 21, 1787, William Samuel Johnson, the son of Dr. Samuel Johnson, was unanimously elected President of Columbia College. Prior to serving at the university, Johnson had participated in the First Continental Congress and been chosen as a delegate to the Constitutional Convention. For a period in the 1790s, with New York City as the federal and state capital and the country under successive Federalist governments, a revived Columbia thrived under the auspices of Federalists such as Hamilton and Jay. Both President George Washington and Vice President John Adams attended the college's commencement on May 6, 1789, as a tribute of honor to the many alumni of the school who had been involved in the American Revolution.\n\n19th century to present\n\nIn November 1813, the College agreed to incorporate its medical school with The College of Physicians and Surgeons, a new school created by the Regents of New York, forming Columbia University College of Physicians and Surgeons. The college's enrollment, structure, and academics stagnated for the majority of the 19th century, with many of the college presidents doing little to change the way that the college functioned. In 1857, the college moved from the King's College campus at Park Place to a primarily Gothic Revival campus on 49th Street and Madison Avenue, where it remained for the next forty years. During the last half of the 19th century, under the leadership of President F.A.P. Barnard, the president Barnard College is named after, the institution rapidly assumed the shape of a modern university. Barnard College was created in 1889 as a response to the university's refusal to accept women.  By this time, the college's investments in New York real estate became a primary source of steady income for the school, mainly owing to the city's expanding population. University president Seth Low moved the campus from 49th Street to its present location, a more spacious campus in the developing neighborhood of Morningside Heights.[http://ephemeralnewyork.wordpress.com/2008/05/05/columbia-universitys-lunatic-past \"Columbia University's Lunatic Past.\" Ephemeral New York website. May 5, 2008] Under the leadership of Low's successor, Nicholas Murray Butler, who served for over four decades, Columbia rapidly became the nation's major institution for research, setting the \"multiversity\" model that later universities would adopt. Prior to becoming the president of Columbia University, Butler founded Teachers College, as a school to prepare home economists and manual art teachers for the children of the poor, with philanthropist Grace Hoadley Dodge. Teachers College came under the aegis of Columbia University in 1893 and became the University's Graduate School of Education.\n\nResearch into the atom by faculty members John R. Dunning, I. I. Rabi, Enrico Fermi and Polykarp Kusch placed Columbia's Physics Department in the international spotlight in the 1940s after the first nuclear pile was built to start what became the Manhattan Project. In 1928, Seth Low Junior College was established by Columbia University in order to mitigate the number of Jewish applicants to Columbia College. The college was closed in 1938 due to the adverse effects of the Great Depression and its students were subsequently absorbed into University Extension. In 1947, the program was reorganized as an undergraduate college and designated the School of General Studies in response to the return of GIs after World War II. In 1995, the School of General Studies was again reorganized as a full-fledged liberal arts college for non-traditional students (those who have had an academic break of one year or more, or are pursuing dual-degrees) and was fully integrated into Columbia's traditional undergraduate curriculum. Within the same year, the Division of Special Programs—later the School of Continuing Education, and now the School of Professional Studies—was established to reprise the former role of University Extension. While the School of Professional Studies only offered non-degree programs for lifelong learners and high school students in its earliest stages, it now offers degree programs in a diverse range of professional and inter-disciplinary fields.\n\nIn the aftermath of World War II, the discipline of international relations became a major scholarly focus of the University, and in response, the School of International and Public Affairs was founded in 1946, drawing upon the resources of the faculties of political science, economics, and history.\n\nDuring the 1960s Columbia experienced large-scale student activism, which reached a climax in the spring of 1968 when hundreds of students occupied buildings on campus. The incident forced the resignation of Columbia's President, Grayson Kirk and the establishment of the University Senate.\n\nThough several schools within the university had admitted women for years, Columbia College first admitted women in the fall of 1983, after a decade of failed negotiations with Barnard College, the all-female institution affiliated with the university, to merge the two schools.[http://www.columbiaspectator.com/2009/03/31/reception-honors-anniversary-cc-coeducation Reception honors anniversary of CC coeducation | Columbia Daily Spectator]. Columbiaspectator.com. Retrieved on September 7, 2013. Barnard College still remains affiliated with Columbia, and all Barnard graduates are issued diplomas authorized by both Columbia University and Barnard College.\n\nIn the 1970s, Teachers College's departments ran joint Ph.D programs with the University in the disciplines of psychology, history, and anthropology and all Teachers College diplomas were conferred by Columbia University. Teachers College was soon established as the University's Faculty of Education and Department of Education.\n\nDuring the late 20th century, the University underwent significant academic, structural, and administrative changes as it developed into a major research university. For much of the 19th century, the University consisted of decentralized and separate faculties specializing in Political Science, Philosophy, and Pure Science. In 1979, these faculties were merged into the Graduate School of Arts and Sciences. In 1991, the faculties of Columbia College, the School of General Studies, the Graduate School of Arts and Sciences, the School of the Arts, and the School of Professional Studies were merged into the Faculty of Arts and Sciences, leading to the academic integration and centralized governance of these schools. In 2010, the School of International and Public Affairs, which was previously a part of the Faculty of Arts and Sciences, became an independent faculty.\n\nCampus\n\nAccording to New York, Columbia University is the second largest landowner in New York City, after the Catholic Church.\n\nMorningside Heights\n\nThe majority of Columbia's graduate and undergraduate studies are conducted in Morningside Heights on Seth Low's late-19th century vision of a university campus where all disciplines could be taught at one location. The campus was designed along Beaux-Arts principles by architects McKim, Mead, and White. Columbia's main campus occupies more than six city blocks, or 32 acres, in Morningside Heights, New York City, a neighborhood that contains a number of academic institutions. The university owns over 7,800 apartments in Morningside Heights, housing faculty, graduate students, and staff. Almost two dozen undergraduate dormitories (purpose-built or converted) are located on campus or in Morningside Heights. Columbia University has an extensive underground tunnel system more than a century old, with the oldest portions predating the present campus. Some of these remain accessible to the public, while others have been cordoned off.\n\nThe Nicholas Murray Butler Library, known simply as Butler Library, is the largest single library in the Columbia University Library System, and is one of the largest buildings on the campus. Proposed as \"South Hall\" by the university's former President Nicholas Murray Butler as expansion plans for Low Memorial Library stalled, the new library was funded by Edward Harkness, benefactor of Yale's residential college system, and designed by his favorite architect, James Gamble Rogers. It was completed in 1934 and renamed for Butler in 1946. The library design is neo-classical in style. Its facade features a row of columns in the Ionic order above which are inscribed the names of great writers, philosophers, and thinkers, most of whom are read by students engaged in the Core Curriculum of Columbia College. As of 2012, Columbia's library system includes over 11.9  million volumes, making it the eighth largest library system and fifth largest collegiate library system in the United States. It has also been ranked among the United States' most beautiful libraries.\n\nSeveral buildings on the Morningside Heights campus are listed on the National Register of Historic Places. Low Memorial Library, a National Historic Landmark and the centerpiece of the campus, is listed for its architectural significance. Philosophy Hall is listed as the site of the invention of FM radio. Also listed is Pupin Hall, another National Historic Landmark, which houses the physics and astronomy departments. Here the first experiments on the fission of uranium were conducted by Enrico Fermi. The uranium atom was split there ten days after the world's first atom-splitting in Copenhagen, Denmark.Robert D. Colburn (July 2002) , National Park Service and \n\nA statue by sculptor Daniel Chester French called Alma Mater is centered on the front steps of Low Memorial Library. McKim, Mead & White invited French to build the sculpture in order to harmonize with the larger composition of the court and library in the center of the campus. Draped in an academic gown, the female figure of Alma Mater wears a crown of laurels and sits on a throne. The scroll-like arms of the throne end in lamps, representing sapientia and doctrina. A book signifying knowledge, balances on her lap, and an owl, the attribute of wisdom, is hidden in the folds of her gown. Her right hand holds a scepter composed of four sprays of wheat, terminating with a crown of King's College which refers to Columbia's origin as a Royalist institution in 1754. A local actress named Mary Lawton was said to have posed for parts of the sculpture. The statue was dedicated on September 23, 1903, as a gift of Mr. & Mrs. Robert Goelet, and was originally covered in golden leaf. During the Columbia University protests of 1968 a bomb damaged the sculpture, but it has since been repaired. The small hidden owl on the sculpture is also the subject of many Columbia legends, the main legend being that the first student in the freshmen class to find the hidden owl on the statue will be valedictorian, and that any subsequent Columbia male who finds it will marry a Barnard student, given that Barnard is a women's college.\n\n\"The Steps\", alternatively known as \"Low Steps\" or the \"Urban Beach\", are a popular meeting area for Columbia students. The term refers to the long series of granite steps leading from the lower part of campus (South Field) to its upper terrace. With a design inspired by the City Beautiful movement, the steps of Low Library provides Columbia University and Barnard College students, faculty, and staff with a comfortable outdoor platform and space for informal gatherings, events, and ceremonies. McKim's classical facade epitomizes late 19th century new-classical designs, with its columns and portico marking the entrance to an important structure. On warm days when the weather is favorable, the Low Steps often become a popular gathering place for students to sunbathe, eat lunch, or play frisbee.\n\nOther campuses\n\nIn April 2007, the university purchased more than two-thirds of a 17 acre site for a new campus in Manhattanville, an industrial neighborhood to the north of the Morningside Heights campus. Stretching from 125th Street to 133rd Street, the new campus will house buildings for Columbia's Business School, School of International and Public Affairs, and the Jerome L. Greene Center for Mind, Brain, and Behavior, where research will occur on neurodegenerative diseases such as Parkinson's and Alzheimer's. The $7 billion expansion plan includes demolishing all buildings, except three that are historically significant, eliminating the existing light industry and storage warehouses, and relocating tenants in 132 apartments. Replacing these buildings will be 6800000 sqft of space for the university. Community activist groups in West Harlem fought the expansion for reasons ranging from property protection and fair exchange for land, to residents' rights. Subsequent public hearings drew neighborhood opposition. Most recently (as of December 2008), the State of New York's Empire State Development Corporation approved use of eminent domain, which, through declaration of Manhattanville's \"blighted\" status, gives governmental bodies the right to appropriate private property for public use. On May 20, 2009, the New York State Public Authorities Control Board approved the Manhanttanville expansion plan and the first buildings are under construction.\n\nNew York-Presbyterian Hospital is affiliated with the medical schools of both Columbia University and Cornell University. According to U.S. News & World Reports \"America's Best Hospitals 2009\", it is ranked sixth overall and third among university hospitals. Columbia's medical school has a strategic partnership with New York State Psychiatric Institute, and is affiliated with 19 other hospitals in the U.S. and four hospitals overseas. Health-related schools are located at the Columbia University Medical Center, a 20 acre campus located in the neighborhood of Washington Heights, fifty blocks uptown. Other teaching hospitals affiliated with Columbia through the New York-Presbyterian network include the Payne Whitney Clinic in Manhattan, and the Payne Whitney Westchester, a psychiatric institute located in White Plains, New York. On the northern tip of Manhattan island (in the neighborhood of Inwood), Columbia owns 26 acre Baker Field, which includes the Lawrence A. Wien Stadium as well as facilities for field sports, outdoor track, and tennis. There is a third campus on the west bank of the Hudson River, the 157 acre Lamont-Doherty Earth Observatory and Earth Institute in Palisades, New York. A fourth is the 60 acre Nevis Laboratories in Irvington, New York for the study of particle and motion physics. A satellite site in Paris, France holds classes at Reid Hall.\n\nSustainability\n\nIn 2006, the university established the Office of Environmental Stewardship to initiate, coordinate and implement programs to reduce the university's environmental footprint. The U.S. Green Building Council selected the university's Manhattanville plan for the Leadership in Energy and Environmental Design (LEED) Neighborhood Design pilot program. The plan commits to incorporating smart growth, new urbanism and \"green\" building design principles. Columbia is one of the 2030 Challenge Partners, a group of nine universities in the city of New York that have pledged to reduce their greenhouse emissions by 30% within the next ten years. Columbia University adopts LEED standards for all new construction and major renovations. The University requires a minimum of Silver, but through its design and review process seeks to achieve higher levels. This is especially challenging for lab and research buildings with their intensive energy use; however, the university also uses lab design guidelines that seek to maximize energy efficiency while protecting the safety of researchers.\n\nEvery Thursday and Sunday of the month, Columbia hosts a greenmarket where local farmers can sell their produce to residents of the city. In addition, from April to November Hodgson's farm, a local New York gardening center, joins the market bringing a large selection of plants and blooming flowers. The market is one of the many operated at different points throughout the city by the non-profit group GrowNYC. Dining services at Columbia spends 36 percent of its food budget on local products, in addition to serving sustainably harvested seafood and fair trade coffee on campus. Columbia has been rated \"B+\" by the 2011 College Sustainability Report Card for its environmental and sustainability initiatives.\n\nAcademics\n\nUndergraduate admissions and financial aid\n\nColumbia University received 36,292 applications for its undergraduate class of 2020 (entering 2016). In early decision, 620 out of 3,520 applicants were admitted, for an acceptance rate of 17.61%. In regular decision, 1,573 out of 32,772 applicants were admitted, for an acceptance rate of 4.79%. For the Class of 2021, 2,185 out of 37,389 applicants were admitted for an overall acceptance rate of 5.8%, making Columbia the third most selective college in the United States behind Stanford and Harvard and the second most selective college in the Ivy League. According to the 2012 college selectivity ranking by U.S. News & World Report, which factors admission and yield rates among other criteria, Columbia was tied with Yale, Caltech and MIT as the most selective colleges in the country.U.S. News & World Report, Americas Best Rankings 2012, National University Rankings, Selectivity Ranking (the former is available only in the print edition and--for purchase--in the online premium edition) Columbia is a racially diverse school, with approximately 52% of all students identifying themselves as persons of color. Additionally, 50% of all undergraduates received grants from Columbia. The average grant size awarded to these students is $46,516. In 2015–2016, annual undergraduate tuition at Columbia was $50,526 with a total cost of attendance of $65,860 (including room and board).\n\nOn April 11, 2007, Columbia University announced a $400m to $600m donation from media billionaire alumnus John Kluge to be used exclusively for undergraduate financial aid. The donation is among the largest single gifts to higher education. Its exact value will depend on the eventual value of Kluge's estate at the time of his death; however, the generous donation has helped change financial aid policy at Columbia. Annual gifts, fund-raising, and an increase in spending from the university's endowment have allowed Columbia to extend generous financial aid packages to qualifying students. As of 2008, undergraduates from families with incomes as high as $60,000 a year will have the projected cost of attending the university, including room, board, and academic fees, fully paid for by the university. That same year, the university ended loans for incoming and current students who were on financial aid, replacing loans that were traditionally part of aid packages with grants from the university. However, this does not apply to international students, transfer students, visiting students, or students in the School of General Studies. In the fall of 2010, admission to Columbia's undergraduate colleges Columbia College and the Fu Foundation School of Engineering and Applied Science (also known as SEAS or Columbia Engineering) began accepting the Common Application. The policy change made Columbia one of the last major academic institutions and the last Ivy League university to switch to the Common Application.\n\nScholarships are also given to undergraduate students by the admissions committee. Designations include John W. Kluge Scholars, John Jay Scholars, C. Prescott Davis Scholars, Global Scholars, Egleston Scholars, and Science Research Fellows. Named scholars are selected by the admission committee from first-year applicants. According to Columbia, the first four designated scholars \"distinguish themselves for their remarkable academic and personal achievements, dynamism, intellectual curiosity, the originality and independence of their thinking, and the diversity that stems from their different cultures and their varied educational experiences.\"\n\nOrganization\n\nColumbia University is an independent, privately supported, nonsectarian institution of higher education. Its official corporate name is \"The Trustees of Columbia University in the City of New York.\" The university's first Charter was granted in 1754 by King George II; however, its modern Charter was first enacted in 1787 and last amended in 1810 by the New York State Legislature. The university is governed by 24 Trustees, customarily including the President, who serves ex officio. The Trustees themselves are responsible for choosing their successors. Six of the 24 are nominated from a pool of candidates recommended by the Columbia Alumni Association. Another six are nominated by the Board in consultation with the Executive Committee of the University Senate. The remaining 12, including the President, are nominated by the Trustees themselves through their internal processes. The term of office for Trustees is six years. Generally, they serve for no more than two consecutive terms. The Trustees appoint the President and other senior administrative officers of the university, and review and confirm faculty appointments as required. They determine the university's financial and investment policies, authorize the budget, supervise the endowment, direct the management of the university's real estate and other assets, and otherwise oversee the administration and management of the university.\n\nThe University Senate was established by the Trustees after a university-wide referendum in 1969. It succeeded to the powers of the University Council, which was created in 1890 as a body of faculty, deans, and other administrators to regulate inter-Faculty affairs and consider issues of university-wide concern. The University Senate is a unicameral body consisting of 107 members drawn from all constituencies of the university. These include the president of the university, the Provost, the Deans of Columbia College and the Graduate School of Arts and Sciences, all who serve ex officio, and five additional representatives, appointed by the President, from the university's administration. The President serves as the Senate's presiding officer. The Senate is charged with reviewing the educational policies, physical development, budget, and external relations of the university. It oversees the welfare and academic freedom of the faculty and the welfare of students.http://senate.columbia.edu/elections/elections_packet_2017.pdfhttp://senate.columbia.edu/topbar_pages/elections.html\n\nThe President of Columbia University, who is selected by the Trustees in consultation with the Executive Committee of the University Senate and who serves at the Trustees' pleasure, is the chief executive officer of the university. Assisting the President in administering the University are the Provost, the Senior Executive Vice President, the Executive Vice President for Health and Biomedical Sciences, several other vice presidents, the General Counsel, the Secretary of the University, and the deans of the Faculties, all of whom are appointed by the Trustees on the nomination of the President and serve at their pleasure. Lee C. Bollinger became the 19th President of Columbia University on June 1, 2002. A prominent advocate of affirmative action, he played a leading role in the twin Supreme Court cases—Grutter v Bollinger and Gratz v Bollinger—that upheld and clarified the importance of diversity as a compelling justification for affirmative action in higher education. A leading First Amendment scholar, he is widely published on freedom of speech and press, and  serves on the faculty of Columbia Law School.\n\nColumbia has three official undergraduate colleges: Columbia College (CC), the liberal arts college offering the Bachelor of Arts degree, the Fu Foundation School of Engineering and Applied Science (also known as SEAS or Columbia Engineering) is the engineering and applied science school offering the Bachelor of Science degree, and The School of General Studies (GS), the liberal arts college offering the Bachelor of Arts degree to non-traditional students undertaking full- or part-time study.\n\nThe university is affiliated with Teachers College, Barnard College, and Union Theological Seminary, all located nearby in Morningside Heights. Of these, Barnard College and Teachers College are integrated as Faculties of the university. Students from both Teachers College and Barnard College graduate with Columbia University degrees. Furthermore, Teachers College is incorporated as an academic department of Columbia University, serving as the University's Graduate School of Education and Department of Education. Joint undergraduate programs are available through the Jewish Theological Seminary of America as well as through the Juilliard School.\n\nRankings\n\nColumbia University was ranked 2nd among U.S. colleges for 2017 by Wall Street Journal and Times Higher Education and 2nd among Ivy League schools. It was ranked 4th overall among U.S. national universities for 2016 by U.S. News & World Report. Individual colleges and schools were also nationally ranked by U.S. News & World Report for its 2016 edition. Columbia Law School was ranked tied for 4th, the Mailman School of Public Health 5th, the School of Social Work 5th, Teachers College (Columbia Graduate School of Education) 7th, Columbia Business School 8th, the College of Physicians and Surgeons tied for 6th for research (and tied for 51st for primary care), the Graduate School of Arts 6th, the School of Nursing tied for 8th, and the Fu Foundation School of Engineering and Applied Science (graduate) was ranked 13th.\n\nIn 2017, Columbia was ranked 8th in the world by Academic Ranking of World Universities, 18th in the world by QS World University Rankings, 14th globally by Times Higher Education World University Rankings, and 8th in the world by U.S. News and World Report.\n\nRankings by other organizations include the Graduate School of Architecture, Planning and Preservation #2,[http://archinect.com/news/article/60523655/di-releases-design-school-rankings-for-2013 DI releases Design School Rankings for 2013], Archinect News, Reporting rankings from DesignIntelligence for best Architecture and Design Schools. By James P. Cramer of DI. November 1, 2012. Retrieved November 3, 2012. and its Graduate School of Journalism #1.Education Portalhttp://education-portal.com/top_journalism_colleges.html\n\nBetween 1996 and 2008, 18 Columbia affiliates have won Nobel Prizes, of whom nine are faculty members while one is an adjunct senior research scientist (Daniel Tsui) and the other a Global Fellow (Kofi Annan). Columbia faculty awarded the Nobel Prize include Richard Axel, Martin Chalfie, Eric Kandel, Tsung-Dao Lee, Robert Mundell, Orhan Pamuk, Edmund S. Phelps, Joseph Stiglitz, and Horst L. Stormer. Other awards and honors won by faculty include 30 MacArthur Foundation Award winners, 4 National Medal of Science recipients, 43 National Academy of Sciences Award winners, 20 National Academy of Engineering Award winners, 38 Institute of Medicine of the National Academies Award recipients and 143 American Academy of Arts and Sciences Award winners.\n\nIn 2015, Columbia University was ranked the first in the state by average professor salaries. In 2011, the Mines ParisTech : Professional Ranking World Universities ranked Columbia 3rd best university for forming CEOs in the US and 12th worldwide.\n\nResearch\n\nColumbia was the first North American site where the uranium atom was split. The College of Physicians and Surgeons played a central role in developing the modern understanding of neuroscience with the publication of Principles of Neural Science, described by historian of science Katja Huenther as the \"neuroscience 'bible'\". The book was written by a team of Columbia researchers that included Nobel Prize winner Eric Kandel, James H. Schwartz, and Thomas Jessell. Columbia was the birthplace of FM radio and the laser. The MPEG-2 algorithm of transmitting high quality audio and video over limited bandwidth was developed by Dimitris Anastassiou, a Columbia professor of electrical engineering. Biologist Martin Chalfie was the first to introduce the use of Green Fluorescent Protein (GFP) in labeling cells in intact organisms. Other inventions and products related to Columbia include Sequential Lateral Solidification (SLS) technology for making LCDs, System Management Arts (SMARTS), Session Initiation Protocol (SIP) (which is used for audio, video, chat, instant messaging and whiteboarding), pharmacopeia, Macromodel (software for computational chemistry), a new and better recipe for glass concrete, Blue LEDs, and Beamprop (used in photonics).\nColumbia scientists have been credited with about 175 new inventions in the health sciences each year. More than 30 pharmaceutical products based on discoveries and inventions made at Columbia are on the market today. These include Remicade (for arthritis), Reopro (for blood clot complications), Xalatan (for glaucoma), Benefix, Latanoprost (a glaucoma treatment), shoulder prosthesis, homocysteine (testing for cardiovascular disease), and Zolinza (for cancer therapy). Columbia Technology Ventures (formerly Science and Technology Ventures), , manages some 600 patents and more than 250 active license agreements. Patent-related deals earned Columbia more than $230 million in the 2006 fiscal year, according to the university, more than any university in the world. Columbia owns many unique research facilities, such as the Columbia Institute for Tele-Information dedicated to telecommunications and the Goddard Institute for Space Studies, which is an astronomical observatory affiliated with NASA.\n\nStudent life\n\nStudents\n\nIn fall 2014, Columbia University's student population was 29,870 (8,559 students in undergraduate programs and 21,311 in postgraduate programs), with 39% of the student population identifying themselves as a minority and 28% born outside of the United States. Twenty-six percent of students at Columbia have family incomes below $60,000, making it one of the most socioeconomically diverse top-tier colleges. Sixteen percent of students at Columbia receive Federal Pell Grants, which mostly go to students whose family incomes are below $40,000. Fifteen percent of students are the first member of their family to attend a four-year college.\n\nOn-campus housing is guaranteed for all four years as an undergraduate. Columbia College and the Fu Foundation School of Engineering and Applied Science (also known as SEAS or Columbia Engineering) share housing in the on-campus residence halls. First-year students usually live in one of the large residence halls situated around South Lawn: Hartley Hall, Wallach Hall (originally Livingston Hall), John Jay Hall, Furnald Hall or Carman Hall. Upperclassmen participate in a room selection process, wherein students can pick to live in a mix of either corridor- or apartment-style housing with their friends. The Columbia University School of General Studies, Barnard College and graduate schools have their own apartment-style housing in the surrounding neighborhood.\n\nColumbia University is home to many fraternities, sororities, and co-educational Greek organizations. Approximately 10–15% of undergraduate students are associated with Greek life.[http://www.studentaffairs.columbia.edu/admissions/faq/campus.php#4 Office of Undergraduate Admissions site about Campus Life]. Retrieved September 12, 2007. Many Barnard women also join Columbia sororities. There has been a Greek presence on campus since the establishment in 1836 of the Delta Chapter of Alpha Delta Phi. The InterGreek Council is the self-governing student organization that provides guidelines and support to its member organizations within each of the three councils at Columbia, the Interfraternity Council, Panhellenic Council, and Multicultural Greek Council. The three council presidents bring their affiliated chapters together once a month to meet as one Greek community. The InterGreek Council meetings provide opportunity for member organizations to learn from each other, work together and advocate for community needs.\n\nPublications\n\nColumbia University is home to a rich diversity of undergraduate, graduate, and professional publications. The Columbia Daily Spectator is the nation's second-oldest student newspaper; and The Blue and White, a monthly literary magazine established in 1890, has recently begun to delve into campus life and local politics in print and on its daily blog, dubbed the Bwog. The Morningside Post is a student-run multimedia news publication. Its content: student-written investigative news, international affairs analysis, opinion, and satire.\n\nPolitical publications include The Current, a journal of politics, culture and Jewish Affairs; the Columbia Political Review, the multi-partisan political magazine of the Columbia Political Union; and AdHoc, which denotes itself as the \"progressive\" campus magazine and deals largely with local political issues and arts events.\n\nArts and literary publications include The Columbia Review, the nation's oldest college literary magazine; Columbia, a nationally regarded literary journal; the Columbia Journal of Literary Criticism; and The Mobius Strip, an online arts and literary magazine. Inside New York is an annual guidebook to New York City, written, edited, and published by Columbia undergraduates. Through a distribution agreement with Columbia University Press, the book is sold at major retailers and independent bookstores.\n\nColumbia is home to numerous undergraduate academic publications. The Journal of Politics & Society, is a journal of undergraduate research in the social sciences, published and distributed nationally by the Helvidius Group; Publius is an undergraduate journal of politics established in 2008 and published biannually; the Columbia East Asia Review allows undergraduates throughout the world to publish original work on China, Japan, Korea, Tibet, and Vietnam and is supported by the Weatherhead East Asian Institute; and The Birch, is an undergraduate journal of Eastern European and Eurasian culture that is the first national student-run journal of its kind; the Columbia Political Review, the undergraduate magazine on politics operated by the Columbia Political Union; the Columbia Economics Review, the undergraduate economic journal on research and policy supported by the Columbia Economics Department; and the Columbia Science Review is a science magazine that prints general interest articles, faculty profiles, and student research papers.\n\nThe Fed a triweekly satire and investigative newspaper, and the Jester of Columbia, the newly (and frequently) revived campus humor magazine both inject humor into local life. Other publications include The Columbian, the undergraduate colleges' annually published yearbook the Gadfly, a biannual journal of popular philosophy produced by undergraduates; and Rhapsody in Blue, an undergraduate urban studies magazine. Professional journals published by academic departments at Columbia University include Current Musicology and The Journal of Philosophy. During the spring semester, graduate students in the Journalism School publish The Bronx Beat, a bi-weekly newspaper covering the South Bronx. Teachers College publishes the Teachers College Record, a journal of research, analysis, and commentary in the field of education, published continuously since 1900.\n\nFounded in 1961 under the auspices of Columbia University's Graduate School of Journalism, the Columbia Journalism Review (CJR) examines day-to-day press performance as well as the forces that affect that performance. The magazine is published six times a year, and offers a reporting, analysis, criticism, and commentary. CJR.org, its web site, delivers real-time criticism and reporting, giving CJR a presence in the ongoing conversation about the media.\n\nBroadcasting\n\nColumbia is home to two pioneers in undergraduate campus radio broadcasting, WKCR-FM and CTV. Many undergraduates are also involved with Barnard's radio station, WBAR. WKCR, the student run radio station that broadcasts to the Tri-State area, claims to be the oldest FM radio station in the world, owing to the university's affiliation with Major Edwin Armstrong. The station went operational on July 18, 1939, from a 400-foot antenna tower in Alpine, New Jersey, broadcasting the very first FM transmission in the world. Initially, WKCR wasn't a radio station, but an organization concerned with the technology of radio communications. As membership grew, however, the nascent club turned its efforts to broadcasting. Armstrong helped the students in their early efforts, donating a microphone and turntables when they designed their first makeshift studio in a dorm room. The station has its studios on the second floor of Alfred Lerner Hall on the Morningside campus with its main transmitter tower at 4 Times Square in Midtown Manhattan. Columbia Television (CTV) is the nation's second oldest Student television station and home of CTV News, a weekly live news program produced by undergraduate students.\n\nDebate and Model UN\n\nThe Philolexian Society is a literary and debating club founded in 1802, making it the oldest student group at Columbia, as well as the third oldest collegiate literary society in the country. The society annually administers the Joyce Kilmer Bad Poetry Contest. The Columbia Parliamentary Debate Team competes in tournaments around the country as part of the American Parliamentary Debate Association, and hosts both high school and college tournaments on Columbia's campus, as well as public debates on issues affecting the university.\n\nThe Columbia International Relations Council and Association (CIRCA), oversees Columbia's Model United Nations activities. CIRCA hosts college and high school Model UN conferences, hosts speakers influential in international politics to speak on campus, trains students from underprivileged schools in New York in Model UN and oversees a competitive team, which travels to colleges around the country and to an international conference every year. The competitive team consistently wins best and outstanding delegation awards and is considered one of the top teams in the country.\n\nTechnology and entrepreneurship\n\nThe Columbia University Organization of Rising Entrepreneurs (CORE) was founded in 1999. The student-run group aims to foster entrepreneurship on campus. Each year CORE hosts dozens of events, including talks, #StartupColumbia, a conference and venture competition for $250,000, and Ignite@CU, a weekend for undergrads interested in design, engineering, and entrepreneurship. Notable speakers include Peter Thiel, Jack Dorsey, Alexis Ohanian, Drew Houston, and Mark Cuban. By 2006, CORE had awarded graduate and undergraduate students over $100,000 in seed capital.\n\nCampusNetwork, an on-campus social networking site called Campus Network that preceded Facebook, was created and popularized by Columbia engineering student Adam Goldberg in 2003. Mark Zuckerberg later asked Goldberg to join him in Palo Alto to work on Facebook, but Goldberg declined the offer. The Fu Foundation School of Engineering and Applied Science offers a minor in Technical Entrepreneurship through its Center for Technology, Innovation, and Community Engagement. SEAS' entrepreneurship activities focus on community building initiatives in New York and worldwide, made possible through partners such as Microsoft Corporation.\n\nColumbia is a top supplier of young engineering entrepreneurs for New York City. Over the past 20 years, graduates of Columbia established over 100 technology companies. Mayor Bloomberg has provided over $6.7 million towards entrepreneurial programs that partner with Columbia and other universities in New York. Professor Chris Wiggins of the Fu Foundation School of Engineering and Applied Science is working in conjunction with Professors Evan Korth of New York University and Hilary Mason, chief scientist at bit.ly to facilitate the growth of student tech-startups in an effort to transform a traditionally financially centered New York City into the next Silicon Valley. Their website, hackny.org, is a gathering ground of ideas and discussions for New York's young entrepreneurial community, the Silicon Alley.\n\nOn June 14, 2010, Mayor Michael R. Bloomberg launched the NYC Media Lab to promote innovations in New York's media industry. Situated at the New York University Tandon School of Engineering, the lab is a consortium of Columbia University, New York University, and New York City Economic Development Corporation acting to connect companies with universities in new technology research. The Lab is modeled after similar ones at MIT and Stanford. A $250,000 grant from the New York City Economic Development Corporation was used to establish the NYC Media Lab. Each year, the lab will host a range of roundtable discussions between the private sector and academic institutions. It will support research projects on topics of content format, next-generation search technologies, computer animation for film and gaming, emerging marketing techniques, and new devices development. The lab will also create a media research and development database. Columbia University will coordinate the long-term direction of the media lab as well as the involvement of its faculty and those of other universities.\n\nAthletics\n\nA member institution of the National Collegiate Athletic Association (NCAA) in Division I FCS, Columbia fields varsity teams in 29 sports and is a member of the Ivy League. The football Lions play home games at the 17,000-seat Robert K. Kraft Field at Lawrence A. Wien Stadium. The Baker Athletics Complex also includes facilities for baseball, softball, soccer, lacrosse, field hockey, tennis, track and rowing, as well as the new Campbell Sports Center opened in January 2013.  The basketball, fencing, swimming & diving, volleyball and wrestling programs are based at the Dodge Physical Fitness Center on the main campus.\n\nColumbia University athletics has a long history, with many accomplishments in athletic fields. In 1870, Columbia played against Rutgers University in the second football game in the history of the sport. Eight years later, Columbia crew won the famed Henley Royal Regatta in the first-ever defeat for an English crew rowing in English waters. In 1900, Olympian and Columbia College student Maxie Long set the first official world record in the 400 meters with a time of 47.8 seconds. In 1983, Columbia men's soccer went 18-0 and was ranked first in the nation, but lost to Indiana 1-0 in double overtime in the NCAA championship game; nevertheless, the team went further toward the NCAA title than any Ivy League soccer team in history. The football program unfortunately is best known for its record of futility set during the 1980s: between 1983 and 1988, the team lost 44 games in a row, which is still the record for the NCAA Football Championship Subdivision. The streak was broken on October 8, 1988, with a 16-13 victory over archrival Princeton University. That was the Lions' first victory at Wien Stadium, which had been opened during the losing streak and was already four years old.[http://www.wikicu.com/Losing_streak Losing streak – WikiCU, the Columbia University wiki encyclopedia]. Wikicu.com. Retrieved on September 7, 2013. A new tradition has developed with the Liberty Cup. The Liberty Cup is awarded annually to the winner of the football game between Fordham and Columbia Universities, two of the only three NCAA Division I football teams in New York City. The tradition began in 2002, a year after the Fordham-Columbia game was postponed due to the September 11 attacks.\n\nFormer students include Baseball Hall of Famers Lou Gehrig and Eddie Collins, football Hall of Famer Sid Luckman, Marcellus Wiley, and world champion women's weightlifter Karyn Marshall. On May 17, 1939, fledgling NBC broadcast a doubleheader between the Columbia Lions and the Princeton Tigers at Columbia's Baker Field, making it the first televised regular athletic event in history.[http://www.college.columbia.edu/cct/spr99/34a.html Baker Field: Birthplace of Sports Television] . Columbia University.\n\nWorld Leaders Forum\n\nEstablished in 2003 by university president Lee C. Bollinger, the World Leaders Forum at Columbia University provides the opportunity for undergraduate and graduate students alike to listen to world leaders in government, religion, industry, finance, and academia. The World Leaders Forum is a year-around event series that strives to provide a platform for uninhibited speech among nations and cultures, while educating students about problems and progress around the globe.\n\nAll Columbia undergraduates and graduates as well as students of Barnard College and other Columbia affiliated schools can register to participate in the World Leaders Forum using their student IDs. Even for individuals who do not have the privilege to attend the event live, they can watch the forum via online videos on Columbia University's website.\n\nPast forum speakers include former President of the United States Bill Clinton, the Prime Minister of India Atal Bihari Vajpayee, Former President of Ghana John Agyekum Kufuor, President of Afghanistan Hamid Karzai, Prime Minister of Russia Vladimir Putin, President of the Republic of Mozambique Joaquim Alberto Chissano, President of the Republic of Bolivia Carlos Diego Mesa Gisbert, President of the Republic of Romania Ion Iliescu, President of the Republic of Latvia Vaira Vīķe-Freiberga, the first female President of Finland Tarja Halonen, President Yudhoyono of Indonesia, President Pervez Musharraf of the Islamic Republic of Pakistan, Iraq President Jalal Talabani, the 14th Dalai Lama, President of the Islamic Republic of Iran Mahmoud Ahmadinejad, financier George Soros, Mayor of New York City Michael R. Bloomberg, President Václav Klaus of the Czech Republic, President Cristina Fernández de Kirchner of Argentina, former Secretary-General of the United Nations Kofi Annan, and Al Gore.\n\nOther\n\nThe Columbia University Orchestra was founded by composer Edward MacDowell in 1896, and is the oldest continually operating university orchestra in the United States. Undergraduate student composers at Columbia may choose to become involved with Columbia New Music, which sponsors concerts of music written by undergraduate students from all of Columbia's schools.\n\nThere are a number of performing arts groups at Columbia dedicated to producing student theater, including the Columbia Players, King's Crown Shakespeare Troupe (KCST), Columbia Musical Theater Society (CMTS), NOMADS (New and Original Material Authored and Directed by Students), LateNite Theatre, Columbia University Performing Arts League (CUPAL), Black Theatre Ensemble (BTE), sketch comedy group Chowdah, and improvisational troupes Alfred and Fruit Paunch. The Columbia University Marching Band tells jokes during the campus tradition of Orgo Night.\n\nThe Columbia Queer Alliance is the central Columbia student organization that represents the bisexual, lesbian, gay, transgender, and questioning student population. It is the oldest gay student organization in the world, founded as the Student Homophile League in 1967 by students including lifelong activist Stephen Donaldson. Columbia University campus military groups include the U.S. Military Veterans of Columbia University and Advocates for Columbia ROTC. In the 2005–06 academic year, the Columbia Military Society, Columbia's student group for ROTC cadets and Marine officer candidates, was renamed the Hamilton Society for \"students who aspire to serve their nation through the military in the tradition of Alexander Hamilton\".\n\nThe university also houses an independent nonprofit organization, Community Impact, which strives to serve disadvantaged people in the Harlem, Washington Heights, and Morningside Heights communities. From its earliest inception as a single service initiative formed in 1981 by Columbia University undergraduates, Community Impact has grown into Columbia University's largest student service organization. CI provides food, clothing, shelter, education, job training, and companionship for residents in its surrounding communities. CI consists of a dedicated corps of about 950 Columbia University student volunteers participating in 25 community service programs, which serve more than 8,000 people each year.\n\nStudent activism\n\nProtests of 1968\n\nStudents initiated a major demonstration in 1968 over two main issues. The first was Columbia's proposed gymnasium in neighboring Morningside Park; this was seen by the protesters to be an act of aggression aimed at the black residents of neighboring Harlem. A second issue was the Columbia administration's failure to resign its institutional membership in the Pentagon's weapons research think-tank, the Institute for Defense Analyses (IDA). Students barricaded themselves inside Low Library, Hamilton Hall, and several other university buildings during the protests, and New York City police were called onto the campus to arrest or forcibly remove the students.[https://www.nytimes.com/2008/04/28/nyregion/28columbia.html \"Columbia's Radicals of 1968 Hold a Bittersweet Reunion\"]. The New York Times. April 28, 2008.\n\nThe protests achieved two of their stated goals. Columbia disaffiliated from the IDA and scrapped the plans for the controversial gym, building a subterranean physical fitness center under the north end of campus instead.  A popular myth states that the gym's plans were eventually used by Princeton University for the expansion of its athletic facilities, but as Jadwin Gymnasium was already 50% complete by 1966 (when the Columbia gym was announced) this was clearly not correct.Hevesi, Dennis. [http://spectatorarchive.library.columbia.edu/cgi-bin/columbia?ad&d\ncs19660920-01.2.16&e=-------en-20--10062--txt-IN-Columbia----l \"Gym Groundbreaking Will Be Held Next Month\"], Columbia Spectator, September 29, 1966.  At least 30 Columbia students were suspended by the administration as a result of the protests. Many of the Class of '68 walked out of their graduation and held a countercommencement on Low Plaza with a picnic following at Morningside Park, the place where the protests began. The protests hurt Columbia financially as many potential students chose to attend other universities and some alumni refused to donate money to the school. Allan Bloom, a professor of philosophy at the University of Chicago,\nbelieved that the protest efforts at Columbia were responsible for pushing higher education further toward the liberal left. As a result of the protests, Bloom stated, \"American universities were no longer places of intellectual and academic debate, but rather places of 'political correctness' and liberalism.\" \n\nProtests against racism and apartheid\n\nFurther student protests, including hunger strike and more barricades of Hamilton Hall and the Business School\"Disinvestment from South Africa#University campuses\" during the late 1970s and early 1980s, were aimed at convincing the university trustees to divest all of the university's investments in companies that were seen as active or tacit supporters of the apartheid regime in South Africa. A notable upsurge in the protests occurred in 1978, when following a celebration of the tenth anniversary of the student uprising in 1968, students marched and rallied in protest of university investments in South Africa. The Committee Against Investment in South Africa (CAISA) and numerous student groups including the Socialist Action Committee, the Black Student Organization and the Gay Students group joined together and succeeded in pressing for the first partial divestment of a U.S. university.\n\nThe initial (and partial) Columbia divestment,\nfocused largely on bonds and financial institutions directly involved with the South African regime. It followed a year-long campaign first initiated by students who had worked together to block the appointment of former United States Secretary of State Henry Kissinger to an endowed chair at the university in 1977.\n\nBroadly backed by student groups and many faculty members the Committee Against Investment in South Africa held teach-ins and demonstrations through the year focused on the trustees ties to the corporations doing business with South Africa. Trustee meetings were picketed and interrupted by demonstrations culminating in May 1978 in the takeover of the Graduate School of Business.\n\nAhmadinejad speech controversy\n\nThe School of International and Public Affairs extends invitations to heads of state and heads of government who come to New York City for the opening of the fall session of the United Nations General Assembly. In 2007, Iranian President Mahmoud Ahmadinejad was one of those invited to speak on campus. Ahmadinejad accepted his invitation and spoke on September 24, 2007, as part of Columbia University's World Leaders Forum. The invitation proved to be highly controversial. Hundreds of demonstrators swarmed the campus on September 24 and the speech itself was televised worldwide. University President Lee C. Bollinger tried to allay the controversy by letting Ahmadenijad speak, but with a negative introduction (given personally by Bollinger). This did not mollify those who were displeased with the fact that the Iranian leader had been invited onto the campus. Columbia students, though, turned out en masse to listen to the speech on the South Lawn. An estimated 2,500 undergraduates and graduates came out for the historic occasion.\n\nDuring his speech, Ahmadinejad criticized Israel's policies towards the Palestinians; called for research on the historical accuracy of the Holocaust; raised questions as to who initiated the 9/11 attacks; defended Iran's nuclear power program, criticizing the UN's policy of sanctions on his country; and attacked U.S. foreign policy in the Middle East. In response to a question about Iran's treatment of women and homosexuals, he asserted that women are respected in Iran and that \"In Iran, we don't have homosexuals like in your country... In Iran, we do not have this phenomenon. I don't know who told you this.\" The latter statement drew laughter from the audience. The Manhattan District Attorney's Office accused Columbia of accepting grant money from the Alavi Foundation to support faculty \"sympathetic\" to Iran's Islamic republic.\n\nROTC controversy\n\nBeginning in 1969, during the Vietnam War, the university did not allow the U.S. military to have Reserve Officers' Training Corps (ROTC) programs on campus,Feith, David J., \"[http://article.nationalreview.com/?qMGQ2Y2YyYTAxOTliMzQ3NjE2MmY1YzE3ZTI2YzIwMjQ\n Duty, Honor, Country… and Columbia]\", National Review, September 15, 2008.   though Columbia students could participate in ROTC programs at other local colleges and universities.[http://www.fordham.edu/academics/special_programs/army_rotc_ram_battal/affiliated_instituti_29928.asp Army ROTC at Fordham University]  Accessed September 9, 2010[http://www.sunymaritime.edu/NROTC/Command%20Information/Command.aspx/ NAVY ROTC IN NEW YORK CITY]   At a forum at the university during the 2008 presidential election campaign, both John McCain and Barack Obama said that the university should consider reinstating ROTC on campus.McGurn, William, \"[http://s.wsj.net/article/SB122273091416788171.html A Columbia Marine To Obama: Help!]\", Wall Street Journal, September 30, 2008, Page 17.[https://www.nrotc.navy.mil/colleges-univers.cfm Colleges and Universities with NROTC Units]   After the debate, the President of the University, Lee C. Bollinger, stated that he did not favor reinstating Columbia's ROTC program, because of the military's anti-gay policies. In November 2008, Columbia's undergraduate student body held a referendum on the question of whether or not to invite ROTC back to campus, and the students who voted were almost evenly divided on the issue. ROTC lost the vote (which would not have been binding on the administration, and did not include graduate students, faculty, or alumni) by a fraction of a percentage point.\n\nIn April 2010 during Admiral Mike Mullen's address at Columbia, President Lee C. Bollinger stated that the ROTC would be readmitted to campus if the admiral's plans for revoking the don't ask, don't tell policy were successful. In February 2011 during one of three town-hall meetings on the ROTC ban, former Army staff sergeant Anthony Maschek, a Purple Heart recipient for injuries sustained during his service in Iraq, was booed and hissed at by some students during his speech promoting the idea of allowing the ROTC on campus.Karni, Annie, \"[http://www.nypost.com/p/news/local/manhattan/hero_unwelcome_Zi3u1fwtRpo87vXAiAQfSN]\", New York Post, February 20, 2011. In April 2011 the Columbia University Senate voted to welcome the ROTC program back on campus.[http://www.huffingtonpost.com/2011/04/02/columbia-rotc_n_843992.html], \"Huff Post College\", April 2, 2011. Secretary of the Navy Ray Mabus and Columbia University President Lee C. Bollinger signed an agreement to reinstate Naval Reserve Officers Training Corps (NROTC) program at Columbia for the first time in more than 40 years on May 26, 2011. The agreement was signed at a ceremony on board the , docked in New York for the Navy's annual Fleet Week. \"Navy and Columbia Sign NROTC Agreement,\" May 26, 2011\n\nDivestment from private prisons \n\nIn February 2014, after learning that the university had over $10 million invested in the private prison industry, a group of students delivered a letter President Bollinger’s office requesting a meeting and officially launching the Columbia Prison Divest (CPD) campaign. As of June 30, 2013, Columbia held investments in Corrections Corporation of America, the largest private prison company in the United States, as well as G4s, the largest multinational security firm in the world. Students demanded that the university divest these holdings from the industry and instate a ban on future investments in the private prison industry. Aligning themselves with the growing Movement for Black Lives and in conversation with the heightened attention on race and the system of mass incarceration, CPD student activists hosted events to raise awareness of the issue and worked to involve large numbers of members of the Columbia and West Harlem community in campaign activities. After eighteen months of student driven organizing, the Board of Trustees of Columbia University voted to support the petition for divestment from private prison companies, which was confirmed to student leaders on June 22, 2015. The Columbia Prison Divest campaign was the first campaign to successfully get a U.S. university to divest from the private prison industry.\n\nTraditions\n\nOrgo Night\n\nFrom 1975 until 2016, at midnight on the day of the Organic Chemistry exam—which is often on the first day of finals—the Columbia University Marching Band occupied Butler Library to distract students from studying. After about forty-five minutes of jokes and music, the procession would move out to the lawn in front of Hartley, Wallach and John Jay residence halls to entertain the residents there. The band then plays at other locations around Morningside Heights, including the residential quadrangle of Barnard College. The band tends to close their Orgo Night performances at Furnald Hall, where the underclassmen in the band sing a mock-hymn to Columbia and its graduating seniors, composed of quips that poke fun at the stereotypes about the Columbia student body.\n\nIn December 2016, University administrators banned the Marching Band from performing its Orgo Night show in its traditional Butler Library location, which resulted in protests and accusations of censorship. Alumni published series of pamphlets addressing the issues in order to try to restore the show.  University administration continued to prohibit the traditional Orgo Night performance during the spring semester of 2017, prompting the Marching Band to again stage the show outside the library on May 4, 2017, as objections from alumni persisted.  University administrators sent a letter to the alumni in which they said that they were working with current Band leadership concerning the future of Orgo Night, but band leadership stated that they had received no correspondence from the university. For the winter 2017 Orgo Night show, the Marching Band performed in Butler Library despite the University's ban on the event.\n\nTree-Lighting and Yule Log ceremonies\n\nThe campus Tree-Lighting Ceremony was inaugurated in 1998. It celebrates the illumination of the medium-sized trees lining College Walk in front of Kent and Hamilton Halls on the east end and Dodge and Journalism Halls on the west, just before finals week in early December. The lights remain on until February 28. Students meet at the sun-dial for free hot chocolate, performances by a cappella groups, and speeches by the university president and a guest.\n\nImmediately following the College Walk festivities is one of Columbia's older holiday traditions, the lighting of the Yule Log. The Christmas ceremony dates to a period prior to the American Revolutionary War, but lapsed before being revived by University President Nicholas Murray Butler in the early 20th century. A troop of students dressed as Continental Army soldiers carry the eponymous log from the sun-dial to the lounge of John Jay Hall, where it is lit amid the singing of seasonal carols. The Christmas ceremony is accompanied by a reading of A Visit From St. Nicholas by Clement Clarke Moore and Yes, Virginia, There is a Santa Claus by Francis Pharcellus Church.\n\nThe Varsity Show\n\nThe Varsity Show is an annual musical written by and for students and was established in 1894, making it one of Columbia's oldest traditions. Past writers and directors have included Columbians Richard Rodgers and Oscar Hammerstein, Lorenz Hart, I.A.L. Diamond, and Herman Wouk. The show has one of the largest operating budgets of all university events.\n\nNotable people\n\nAs of 2011, Columbia alumni included three United States Presidents, 26 foreign Heads of State, ten Justices of the Supreme Court of the United States (including three Chief Justices) and 39 Nobel winners. As of 2011, alumni also have received more than 35 National Book Awards and 123 Pulitzer Prizes. Today, two United States Senators and 16 Chief Executives of Fortune 500 companies hold Columbia degrees, as do three of the 25 richest Americans and 20 living billionaires. Columbia is second only to Harvard in the number of living billionaire graduates. Five Founding Fathers including an author of the United States Constitution and a member of the Committee of Five are alumni of Columbia University, then named \"King's College\".\n\nFormer U.S. Presidents Theodore Roosevelt and Franklin Delano Roosevelt attended the law school. Other more recent political figures educated at Columbia include former U.S President Barack Obama, Associate Justice of the U.S. Supreme Court Ruth Bader Ginsburg, former U.S. Secretary of State Madeleine Albright, former chairman of the U.S. Federal Reserve Bank Alan Greenspan, U.S. Attorney General Eric Holder, and U.S. Solicitor General Donald Verrilli Jr. Dwight D. Eisenhower served as the thirteenth president of Columbia University from 1948 to 1953. The university has also educated 26 foreign heads of state, including President of Georgia Mikheil Saakashvili, President of East Timor Jose Ramos Horta, President of Estonia Toomas Hendrik Ilves and other historical figures such as Wellington Koo, Radovan Karadžić, Gaston Eyskens, and T. V. Soong. The author of India's constitution and Dalit leader Dr. B. R. Ambedkar was also an alumnus of Columbia.\n\nAlumni of Columbia have occupied top positions in Wall Street and the rest of the business world. Notable members of the Astor family attended Columbia, while some recent business graduates include investor Warren Buffett, former CEO of PBS and NBC Larry Grossman, chairman of Wal-Mart S. Robson Walton and Bain Capital Co-Managing Partner, Jonathan Lavine. CEO's of top Fortune 500 companies include James P. Gorman of Morgan Stanley,The Age (2009). [http://www.theage.com.au/business/melbourneraised-gorman-new-chief-of-morgan-stanley-20090911-fkw8.html Melbourne-raised Gorman new chief of Morgan Stanley]. Retrieved September 13, 2009. Robert J. Stevens of Lockheed Martin, Philippe Dauman of Viacom, Ursula Burns of Xerox, and Vikram Pandit of Citigroup. Notable labor organizer and women's educator Louise Leonard McLaren received her degree of Master of Arts from Columbia.\n\nIn science and technology, Columbia alumni include: founder of IBM Herman Hollerith; inventor of FM radio Edwin Armstrong; Francis Mechner; integral in development of the nuclear submarine Hyman Rickover; founder of Google China Kai-Fu Lee; scientists Stephen Jay Gould,Green, Michelle (1986). [http://www.stephenjaygould.org/library/green_sjgould.html \"Stephen Jay Gould: driven by a hunger to learn and to write\".] People 25 (June 2): 109-114. Robert Millikan, Helium–neon laser inventor Ali Javan and Mihajlo Pupin; chief-engineer of the New York City Subway, William Barclay Parsons; philosophers Irwin Edman and Robert Nozick; economist Milton Friedman; and psychologist Harriet Babcock.\n\nMany Columbia alumni have gone on to renowned careers in the arts, including composers Richard Rodgers,Rodgers, Richard. Musical Stages: An Autobiography (2002 Reissue), pp. 12, 20–21, 44. Cambridge, MA: Da Capo Press.  Oscar Hammerstein II, Lorenz Hart,[https://www.pbs.org/wnet/broadway/stars/hart_l.html Hughson Mooney, \"Lorenz Hart\"] , PBS, Excerpted from the DICTIONARY OF AMERICAN BIOGRAPHY, SUPPLEMENT 3: 1941–1945. American Council of Learned Societies, 1973. Reprinted by permission of the American Council of Learned Societies, retrieved April 18, 2011 and Art Garfunkel.Herman, Jan (February 6, 1977). [http://www.artgarfunkel.com/articles/gannett.html \"TV Makes You Famous; Rock 'n Roll Makes You Rich\"]. Gannett News Service. Four United States Poet Laureates received their degrees from Columbia. Columbia alumni have made an indelible mark in the field of American poetry and literature, with such people as Jack Kerouac and Allen Ginsberg, pioneers of the Beat Generation,Literature Resource Center: [http://go.galegroup.com/ps/i.do?idGALE%7CH1410002462&v\n2.1&uiuclassb&it\nr&pLitRC&sw\nw&asid=468444b0b09aacc2b7192350d1606bb6 \"The Beat Generation\"]. Retrieved November 13, 2013. and Langston Hughes, a seminal figure in the Harlem Renaissance, all having attended the university. Other notable writers who attended Columbia include authors Isaac Asimov, J.D. Salinger, Upton Sinclair,Encyclopædia Britannica: [http://www.britannica.com/EBchecked/topic/545642/Upton-Sinclair \"Upton Sinclair\"]. Retrieved April 15, 2011. Danielle Valore Evans, and Hunter S. Thompson.\n\nUniversity alumni have also been very prominent in the film industry, with 28 alumni and former students winning a combined 39 Academy Awards (as of 2011), second in the world only to New York University (NYU). Some notable Columbia alumni that have gone on to work in film include directors Sidney Lumet (12 Angry Men) and Kathryn Bigelow (The Hurt Locker), screenwriters Howard Koch (Casablanca) and Joseph L. Mankiewicz (All About Eve), and actors James Cagney and Ed Harris.\n\nFile:Alexander Hamilton portrait by John Trumbull 1806.jpg|Alexander Hamilton, Founding Father of the United States, the first United States Secretary of the Treasury, King's College\nFile:John Jay (Gilbert Stuart portrait).jpg|John Jay, Founding Father of the United States, the first Chief Justice of the Supreme Court, King's College\nFile:Gouverneur Morris 1789.jpg|Gouverneur Morris, Founding Father of the United States, author of the United States Constitution and Senator from New York, King's College\nFile:President Barack Obama.jpg|Barack Obama, 44th President of the United States and Nobel laureate, Columbia College\nFile:Judge Gorsuch official portrait.jpg|Neil Gorsuch, Associate Justice of the Supreme Court of the United States, Columbia College\nFile:President Theodore Roosevelt, 1904.jpg|Theodore Roosevelt, President of the United States and Nobel laureate, Columbia Law School\nFile:FDR in 1933.jpg|Franklin D. Roosevelt, President of the United States, Columbia Law School\nFile:Ruth Bader Ginsburg official SCOTUS portrait.jpg|Ruth Bader Ginsburg, Associate Justice of the Supreme Court of the United States, Columbia Law School\nFile:Hollerith.jpg|Herman Hollerith, co-founder of IBM, Columbia University School of Mines\nFile:Robert Kraft at Patriots at Raiders 12-14-08.JPG|Robert Kraft, billionaire, owner of the New England Patriots, Chairman and CEO of the Kraft Group, Columbia College\nFile:O'Keeffe-(hands).jpg|Georgia O'Keeffe, American artist, recognized as the \"Mother of American modernism\", Teachers College\nFile:S. Robson Walton by Gage Skidmore.jpg|S. Robson Walton, one of the world's wealthiest people, Chairman of Walmart, Columbia Law School\nFile:Warren Buffett KU Visit.jpg|Warren Buffett, CEO of Berkshire Hathaway and one of the world's wealthiest people, Columbia Business School\nFile:Portrait of Milton Friedman.jpg|Milton Friedman, Nobel laureate, Columbia University Graduate School of Arts and Sciences\nFile:Secalbright.jpg|Madeleine Albright, first female Secretary of State, Columbia University Graduate School of Arts and Sciences\nFile:Lou Gehrig as a new Yankee 11 Jun 1923.jpg|Lou Gehrig, 2-time AL MVP, 6-time World Series Champion, and member of Baseball Hall of Fame, Columbia College\nFile:Shirley Chisholm.jpg|Shirley Chisholm, first black woman elected to the United States Congress, Teachers College\nFile:Sidluckman.JPG|Sid Luckman, NFL MVP, 4-time NFL Champion, member of the Pro Football Hall of Fame, and member of the College Football Hall of Fame, Columbia College\nFile:Rodgers.jpg|Richard Rodgers, legendary Emmy; Grammy; Oscar; and Tony award-winning composer, Pulitzer Prize winner, Columbia College\nFile:Oscar Hammerstein - portrait.jpg|Oscar Hammerstein II, 8-time Tony Award winner, 2-time Academy Award winner, Columbia College\nFile:Allen Ginsberg 1979 - cropped.jpg|Allen Ginsberg, founder of Beat Generation, Columbia College\nFile:Dr. Bhim Rao Ambedkar.jpg|B. R. Ambedkar, jurist, economist, politician and social reformer; led committee that drafted Constitution of India and served as first Minister of Law and Justice, Graduate School of Arts and Sciences. Columbia University. http://en.wikipedia.org/?curid=6310."
  }
}
