{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9282",
  "eid" : "edaa4c50-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778478485,
  "textBody" : "ECHELON, originally a secret government code name, is a surveillance program (signals intelligence/SIGINT collection and analysis network) operated by the US with the aid of four other signatory nations to the UKUSA Security Agreement\nGiven the 5 dialects that use the terms, UKUSA can be pronounced from \"You-Q-SA\" to \"Oo-Coo-SA\", AUSCANNZUKUS can be pronounced from \"Oz-Can-Zuke-Us\" to \"Orse-Can-Zoo-Cuss\".\nFrom Talk:UKUSA Agreement: \"Per documents officially released by both the Government Communications Headquarters and the National Security Agency, this agreement is referred to as the UKUSA Agreement. This name is subsequently used by media sources reporting on the story, as written in new references used for the article. The NSA press release provides a pronunciation guide, indicating that \"UKUSA\" should not be read as two separate entities.  [http://www.nsa.gov/public_info/press_room/2010/ukusa.shtml (National Security Agency)]\"—Australia, Canada, New Zealand, the United Kingdom and the United States, also known as the Five Eyes.Google books – [https://books.google.com/books?id1x6Akzkxv5IC&printsec\nfrontcover&sourcegbs_summary_r&cad\n0 Echelon] by John O'Neill\n\nThe ECHELON program was created in the late 1960s to monitor the military and diplomatic communications of the Soviet Union and its Eastern Bloc allies during the Cold War, and was formally established in 1971.\n\nBy the end of the 20th century, the system referred to as \"ECHELON\" had allegedly evolved beyond its military and diplomatic origins, to also become \"…a global system for the interception of private and commercial communications\" (mass surveillance and industrial espionage).\n\nName \n\nThe European Parliament's Temporary Committee on the ECHELON Interception System stated, \"It seems likely, in view of the evidence and the consistent pattern of statements from a very wide range of individuals and organisations, including American sources, that its name is in fact ECHELON, although this is a relatively minor detail\". The U.S. intelligence community uses many code names (see, for example, CIA cryptonym).\n\nFormer NSA employee Margaret Newsham claims that she worked on the configuration and installation of software that makes up the ECHELON system while employed at Lockheed Martin, from 1974 to 1984 in Sunnyvale, California, in the United States, and in Menwith Hill, England, in the UK. \"Unfortunately, I can't tell you all my duties. I am still bound by professional secrecy, and I would hate to go to prison or get involved in any trouble, if you know what I mean. In general, I can tell you that I was responsible for compiling the various systems and programs, configuring the whole thing and making it operational on mainframes\"; \"Margaret Newsham worked for the NSA through her employment at Ford and Lockheed from 1974 to 1984. In 1977 and 1978 Newsham was stationed at the largest listening post in the world at Menwith Hill, England ... Ekstra Bladet has Margaret Newsham's stationing orders from the US Department of Defense. She possessed the high security classification TOP SECRET CRYPTO.\" At that time, according to Newsham, the code name ECHELON was NSA's term for the computer network itself. Lockheed called it P415. The software programs were called SILKWORTH and SIRE. A satellite named VORTEX intercepted communications. An image available on the internet of a fragment apparently torn from a job description shows Echelon listed along with several other code names.\n\nBritain's The Guardian newspaper summarized the capabilities of the ECHELON system as follows:\n\nReporting and disclosures \n\nPublic disclosures (1972–2000) \n\nIn 1972, former NSA analyst Perry Fellwock under pseudonym Winslow Peck, first blew the whistle on ECHELON to Ramparts in 1972, where he gave commentary revealing a global network of listening posts and his experiences working there. Fellwock also included revelations such as the Israeli attack on  was deliberate and known by both sides, the existence of nuclear weapons in Israel in 1972, the widespread involvement of CIA and NSA personnel in drugs and human smuggling, and CIA operatives leading Nationalist China (Taiwan) commandos in burning villages inside PRC borders.\n\nIn 1982, James Bamford, investigative journalist and author wrote The Puzzle Palace, an in-depth look inside the workings of the NSA, then a super-secret agency, and the massive eavesdropping operation under the codename \"SHAMROCK\". The NSA has used many codenames, and SHAMROCK was the codename used for ECHELON prior to 1975.\n\nIn 1988, Margaret Newsham, a Lockheed employee under NSA contract, disclosed the ECHELON surveillance system to members of congress. Newsham told a member of the U.S. Congress that the telephone calls of Strom Thurmond, a Republican U.S. senator, were being collected by the NSA. Congressional investigators determined that \"targeting of U.S. political figures would not occur by accident, but was designed into the system from the start.\"\n\nAlso in 1988, an article titled \"Somebody's Listening\", written by investigative journalist Duncan Campbell in the New Statesman, described the signals intelligence gathering activities of a program code-named \"ECHELON\". James Bamford describes the system as the software controlling the collection and distribution of civilian telecommunications traffic conveyed using communication satellites, with the collection being undertaken by ground stations located in the footprint of the downlink leg.\n\nIn 1996, a detailed description of ECHELON was provided by New Zealand journalist Nicky Hager in his 1996 book Secret Power: New Zealand's Role in the International Spy Network. Two years later, Hager's book was cited by the European Parliament in a report titled \"An Appraisal of the Technology of Political Control\" (PE 168.184).\n\nIn March 1999, for the first time in history, the Australian government admitted that news reports about the top secret UKUSA Agreement were true. Martin Brady, the director of Australia's Defence Signals Directorate (DSD) told the Australian broadcasting channel Nine Network that the DSD \"does co-operate with counterpart signals intelligence organisations overseas under the UKUSA relationship.\"\n\nIn 2000, James Woolsey, the former Director of the U.S. Central Intelligence Agency, confirmed that U.S. intelligence uses interception systems and keyword searches to monitor European businesses.\n\nLawmakers in the United States feared that the ECHELON system could be used to monitor U.S. citizens. According to The New York Times, the ECHELON system has been \"shrouded in such secrecy that its very existence has been difficult to prove.\" Critics said the ECHELON system emerged from the Cold War as a \"Big Brother without a cause\".\n\nEuropean Parliament investigation (2000–2001)\n\nThe program's capabilities and political implications were investigated by a committee of the European Parliament during 2000 and 2001 with a report published in 2001. In July 2000, the Temporary Committee on the ECHELON Interception System was established by the European parliament to investigate the surveillance network. It was chaired by the Portuguese politician Carlos Coelho, who was in charge of supervising investigations throughout 2000 and 2001.\n\nIn May 2001, as the committee finalised its report on the ECHELON system, a delegation travelled to Washington, D.C. to attend meetings with U.S. officials from the following agencies and departments:\n* U.S. Central Intelligence Agency (CIA)\n* U.S. Department of Commerce (DOC)\n* U.S. National Security Agency (NSA)\n\nAll meetings were cancelled by the U.S. government and the committee was forced to end its trip prematurely. According to a BBC correspondent in May 2001, \"The US Government still refuses to admit that Echelon even exists.\"\n\nIn July 2001, the Temporary Committee on the ECHELON Interception System released its final report. On 5 September 2001, the European Parliament voted to accept the committee's report.\n\nThe European Parliament stated in its report that the term ECHELON is used in a number of contexts, but that the evidence presented indicates that it was the name for a signals intelligence collection system. The report concludes that, on the basis of information presented, ECHELON was capable of interception and content inspection of telephone calls, fax, e-mail and other data traffic globally through the interception of communication bearers including satellite transmission, public switched telephone networks (which once carried most Internet traffic), and microwave links.\n\nConfirmation of ECHELON (2015) \n\nTwo internal NSA newsletters from January 2011 and July 2012, published as part of the Snowden-revelations by the website The Intercept on 3 August 2015, for the first time confirmed that NSA used the codeword ECHELON and provided some details about the scope of the program: ECHELON was part of an umbrella program codenamed FROSTING, which was established by the NSA in 1966 to collect and process data from communications satellites. FROSTING had two sub-programs:The Northwest Passage, Yakima Research Station (YRS) newsletter: [http://www.documentcloud.org/documents/2189960-nwp-nsa.html Volume 2, Issue 1, January 2011] & [http://www.documentcloud.org/documents/2189961-nwp2-nsa.html Volume 3, Issue 7, July 2012].\n* TRANSIENT: for intercepting Soviet satellite transmissions, and\n* ECHELON: for intercepting Intelsat satellite transmissions.\n\nOrganization\n\nThe UKUSA intelligence community was assessed by the European Parliament (EP) in 2000 to include the signals intelligence agencies of each of the member states:\n* the Government Communications Headquarters of the United Kingdom,\n* the National Security Agency of the United States,\n* the Communications Security Establishment of Canada,\n* the Australian Signals Directorate of Australia, and\n* the Government Communications Security Bureau of New Zealand.\nThe EP report concluded that it seemed likely that ECHELON is a method of sorting captured signal traffic, rather than a comprehensive analysis tool.\n\nLikely satellite intercept stations\n\nIn 2001, the EP report (p. 54 ff) listed the following ground stations as likely to have, or to have had, a role in intercepting transmissions from telecommunications satellites:\n* Hong Kong (since closed)\n* Australian Defence Satellite Communications Station (Geraldton, Western Australia)\n* RAF Menwith Hill (Yorkshire, U.K.) [https://maps.google.com/maps?fq&geocode\n&q+54%C2%B0+0'31.29%22N+++1%C2%B041'22.17%22W&ie\nUTF8&ll54.009118,-1.689384&spn\n0.003228,0.013561&tk&z\n17&om=1 Map] (reportedly the largest Echelon facility)[http://mondediplo.com/2010/09/04israelbase Le Monde Diplomatique], September 2010\n* Misawa Air Base (Japan) [https://maps.google.com/maps?ll=40.72051,141.326087 Map]\n* GCHQ Bude, formerly known as GCHQ CSO Morwenstow           (Cornwall, U.K.) [https://maps.google.com/maps?fq&source\ns_q&geocode&sspn\n0.009846,0.019312&ieUTF8&ll\n50.885979,-4.553018&spn0.008948,0.019312&t\nh&z=16 Map]\n* Pine Gap (Northern Territory, Australia – close to Alice Springs) [https://maps.google.com/maps?fq&geocode\n&q23.799S,+133.737E&ie\nUTF8&ll-23.798853,133.737066&spn\n0.005026,0.013561&th&z\n17 Map]\n* Sugar Grove (West Virginia, U.S.) [https://maps.google.com/maps?fq&source\ns_q&geocode&sll\n40.442767,-77.338257&sspn2.763215,4.943848&ie\nUTF8&ll38.513906,-79.27964&spn\n0.011098,0.019312&th&z\n16 Map] (since closed)\n* Yakima Training Center (Washington, U.S.) [https://maps.google.com/maps?fq&geocode\n&q46.68209++-120.356544&sll\n46.681405,-120.356056&sspn0.005186,0.004399&g\n46.68209++-120.356544&ieUTF8&t\nk&ll46.681795,-120.357381&spn\n0.005185,0.006437&z18&iwloc\naddr Map] (since closed)\n* GCSB Waihopai (New Zealand)\n* GCSB Tangimoana (New Zealand)\n* CFS Leitrim (Ontario, Canada)\n* Teufelsberg (Berlin, Germany) (closed 1992) – Responsible for listening in to the Eastern Bloc.\n\nOther potentially related stations\n\nThe following stations are listed in the EP report (p. 57 ff) as ones whose roles \"cannot be clearly established\":\n* Ayios Nikolaos (British Sovereign Base area of Dhekelia, Cyprus – U.K.)\n* Gibraltar (U.K.)\n* Diego Garcia (U.K.)\n* Bad Aibling Station (Bad Aibling, Germany – U.S.)\n** relocated to Griesheim/Darmstadt in 2004.According to a statement by Terence Dudlee, the speaker of the US Navy in London, in an interview to the German HR (Hessischer Rundfunk) (German), hr online, 1 October 2004\n* Buckley Air Force Base (Aurora, Colorado)\n* Fort Gordon (Georgia, U.S.)\n* CFB Gander (Newfoundland & Labrador, Canada) \n* Guam (Pacific Ocean, U.S.)\n* Kunia Regional SIGINT Operations Center (Hawaii, U.S.)\n* Lackland Air Force Base, Medina Annex (San Antonio, Texas)\n* RAF Edzell (Scotland) \n* RAF Boulmer (England) \n\nHistory and context \n\nThe ability to intercept communications depends on the medium used, be it radio, satellite, microwave, cellular or fiber-optic. During World War II and through the 1950s, high-frequency (\"short-wave\") radio was widely used for military and diplomatic communicationThe Codebreakers, Ch. 10, 11 and could be intercepted at great distances. The rise of geostationary communications satellites in the 1960s presented new possibilities for intercepting international communications.\n\nIn 1964, plans for the establishment of the ECHELON network took off after dozens of countries agreed to establish the International Telecommunications Satellite Organisation (Intelsat), which would own and operate a global constellation of communications satellites.\n\nIn 1966, the first Intelsat satellite was launched into orbit. From 1970 to 1971, the Government Communications Headquarters (GCHQ) of Britain began to operate a secret signal station  at Morwenstow, near Bude in Cornwall, England. The station intercepted satellite communications over the Atlantic and Indian Oceans. Soon afterwards, the U.S. National Security Agency (NSA) built a second signal station at Yakima, near Seattle, for the interception of satellite communications over the Pacific Ocean.\n\nIn 1981, the GCHQ and the NSA started the construction of the first global wide area network (WAN). Soon after Australia, Canada, and New Zealand joined the ECHELON system. The report to the European Parliament of 2001 states: \"If UKUSA states operate listening stations in the relevant regions of the earth, in principle they can intercept all telephone, fax, and data traffic transmitted via such satellites.\"\n\nMost reports on ECHELON focus on satellite interception. Testimony before the European Parliament indicated that separate but similar UK-U.S. systems are in place to monitor communication through undersea cables, microwave transmissions, and other lines.For example:  The report to the European Parliament points out that interception of private communications by foreign intelligence services is not necessarily limited to the U.S. or British foreign intelligence services.\n\nThe role of satellites in point-to-point voice and data communications has largely been supplanted by fiber optics. In 2006, 99% of the world's long-distance voice and data traffic was carried over optical-fiber. The proportion of international communications accounted for by satellite links is said to have decreased substantially to an amount between 0.4% and 5% in Central Europe. Even in less-developed parts of the world, communications satellites are used largely for point-to-multipoint applications, such as video. Thus, the majority of communications can no longer be intercepted by earth stations; they can only be collected by tapping cables and intercepting line-of-sight microwave signals, which is possible only to a limited extent.\n\nConcerns\n\nBritish journalist Duncan Campbell and New Zealand journalist Nicky Hager asserted in the 1990s that the United States was exploiting ECHELON traffic for industrial espionage, rather than military and diplomatic purposes. Examples alleged by the journalists include the gear-less wind turbine technology designed by the German firm EnerconDie Zeit: 40/1999 \"Verrat unter Freunden (\"Treachery among friends\", German), available at  and the speech technology developed by the Belgian firm Lernout & Hauspie. ([https://translate.google.com/translate?hlen&sl\nnl&uhttp://www.daanspeak.com/Hypocratie09.html&sa\nX&oitranslate&resnum\n1&ct=result Google's translation of the article into English]).\n\nIn 2001, the Temporary Committee on the ECHELON Interception System recommended to the European Parliament that citizens of member states routinely use cryptography in their communications to protect their privacy, because economic espionage with ECHELON has been conducted by the U.S. intelligence agencies.\n\nAmerican author James Bamford provides an alternative view, highlighting that legislation prohibits the use of intercepted communications for commercial purposes, although he does not elaborate on how intercepted communications are used as part of an all-source intelligence process.\n\nIn its report, the committee of the European Parliament stated categorically that the Echelon network was being used to intercept not only military communications, but also private and business ones. In its epigraph to the report, the parliamentary committee quoted Juvenal, \"Sed quis custodiet ipsos custodes. (\"But who will watch the watchers\"). James Bamford, in The Guardian in May 2001, warned that if Echelon were to continue unchecked, it could become a \"cyber secret police, without courts, juries, or the right to a defence\".Bustillos, Maria (9 June 2013). [http://www.newyorker.com/online/blogs/elements/2013/06/a-reflection-in-the-nsas-prism.html \"Our reflection in the N.S.A.'s PRISM\"]. The New Yorker. Retrieved: 2013-10-12.\n\nAlleged examples of espionage conducted by the members of the \"Five Eyes\" include:\n\n* On behalf of the British Prime Minister Margaret Thatcher, the Canadian Security Intelligence Service of Canada spied on two British cabinet ministers in 1983.\n* The U.S. National Security Agency spied on and intercepted the phone calls of Princess Diana right until she died in a Paris car crash with Dodi Fayed in 1997. The NSA currently holds 1,056 pages of classified information about Princess Diana, which has been classified as top secret \"because their disclosure could reasonably be expected to cause exceptionally grave damage to the national security ... the damage would be caused not by the information about Diana, but because the documents would disclose 'sources and methods' of U.S. intelligence gathering\". An official insisted that \"the references to Diana in intercepted conversations were 'incidental',\" and she was never a 'target' of the NSA eavesdropping.\n* U.K. agents monitored the conversations of  the 7th Secretary-General of the United Nations Kofi Annan.\n* U.S. agents gathered \"detailed biometric information\" on the 8th Secretary-General of the United Nations, Ban Ki-Moon.\n* In the early 1990s, the U.S. National Security Agency intercepted the communications between the European aerospace company Airbus and the Saudi Arabian national airline.  In 1994, Airbus lost a $6 billion contract with Saudi Arabia after the NSA,  acting as  a whistleblower, reported that Airbus officials had been bribing Saudi officials to secure the contract. As a result, the American aerospace company McDonnell Douglas (now part of Boeing) won the multibillion-dollar contract instead of Airbus.\n* The American defense contractor Raytheon won a US$1.3 billion contract with the Government of Brazil to monitor the Amazon rainforest after the U.S. Central Intelligence Agency (CIA), acting as a whistleblower, reported that Raytheon's French competitor Thomson-Alcatel had been paying bribes to get the contract.\n* In order to boost America's position in trade negotiations with the then Japanese Trade Minister Ryutaro Hashimoto, in 1995 the CIA eavesdropped on the conversations between Japanese bureaucrats and executives of car manufacturers Toyota and Nissan.\n\nWorkings \n\nThe first American satellite ground station for the ECHELON collection program was built in 1971 at a military firing and training center near Yakima, Washington. The facility, which was codenamed JACKKNIFE, was an investment of ca. 21.3 million dollars and had around 90 people. Satellite traffic was intercepted by a 30-meter single dish antenna. The station became fully operational on 4 October 1974. It was connected with NSA headquarters at Fort Meade by a 75-baud secure Teletype orderwire channel.\n\nIn 1999 the Australian Senate Joint Standing Committee on Treaties was told by Professor Desmond Ball that the Pine Gap facility was used as a ground station for a satellite-based interception network. The satellites were said to be large radio dishes between 20 and 100 meters in diameter in geostationary orbits. The original purpose of the network was to monitor the telemetry from 1970s Soviet weapons, air defence- and other radar's capabilities, satellite's ground station's transmissions and ground-based microwave communications., Official Committee Hansard, Joint Standing Committee on Treaties, 9 August 1999. Commonwealth of Australia.\n\nIn popular culture \n\nThe television series Alias made recurring references to ECHELON throughout its run.\n\nThe antagonist of the anime series Digimon Tamers, D-Reaper, was created by ECHELON.\n\nEchelon Conspiracy, inspired by the surveillance system ECHELON, is a 2009 action thriller film directed by Greg Marcks. It tells the story of Max Peterson (Shane West), an American computer specialist who attempts to uncover a secret plot to turn the world into a global police state. After being chased down by NSA agent Raymond Burke (Martin Sheen), Peterson decides to flee to Moscow.\n\nThe video game series Tom Clancy's Splinter Cell also draws inspiration from this. The series features the protagonist, Sam Fisher, a trained operative belonging to a fictional branch of the National Security Agency called Third Echelon (later, in Splinter Cell: Blacklist, the unit is replaced by the Fourth Echelon).\n\nThe 2007 film The Bourne Ultimatum makes several references to ECHELON. A CIA listening station in London is alerted when ECHELON detects the keyword \"Blackbriar\" in a cell phone conversation between a journalist and his editor. Later in the film, CIA Deputy Director Pamela Landy requests an \"ECHELON package\" on the main character, Jason Bourne.\n\nAlternative rock band Thirty Seconds to Mars' first album includes a song called \"Echelon\". Their fan base is also referred to as the Echelon, though an explanation has not been given as to why the fanbase and the song are referred to as such.\n\nIn the 2000 computer game Deus Ex, the signals intelligence supercomputers Daedalus and Icarus (later Helios) are referred to as Echelon IV.\n\nThe sci-fi crime thriller, Person of Interest, a television show which aired from 2011 to 2016 on the CBS network, had a data-collecting supercomputer as its central narrative.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "ECHELON" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9282" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "ECHELON, originally a secret government code name, is a surveillance program (signals intelligence/SIGINT collection and analysis network) operated by the US with the aid of four other signatory nations to the UKUSA Security Agreement\nGiven the 5 dialects that use the terms, UKUSA can be pronounced from \"You-Q-SA\" to \"Oo-Coo-SA\", AUSCANNZUKUS can be pronounced from \"Oz-Can-Zuke-Us\" to \"Orse-Can-Zoo-Cuss\".\nFrom Talk:UKUSA Agreement: \"Per documents officially released by both the Government Communications Headquarters and the National Security Agency, this agreement is referred to as the UKUSA Agreement. This name is subsequently used by media sources reporting on the story, as written in new references used for the article. The NSA press release provides a pronunciation guide, indicating that \"UKUSA\" should not be read as two separate entities.  [http://www.nsa.gov/public_info/press_room/2010/ukusa.shtml (National Security Agency)]\"—Australia, Canada, New Zealand, the United Kingdom and the United States, also known as the Five Eyes.Google books – [https://books.google.com/books?id1x6Akzkxv5IC&printsec\nfrontcover&sourcegbs_summary_r&cad\n0 Echelon] by John O'Neill\n\nThe ECHELON program was created in the late 1960s to monitor the military and diplomatic communications of the Soviet Union and its Eastern Bloc allies during the Cold War, and was formally established in 1971.\n\nBy the end of the 20th century, the system referred to as \"ECHELON\" had allegedly evolved beyond its military and diplomatic origins, to also become \"…a global system for the interception of private and commercial communications\" (mass surveillance and industrial espionage).\n\nName \n\nThe European Parliament's Temporary Committee on the ECHELON Interception System stated, \"It seems likely, in view of the evidence and the consistent pattern of statements from a very wide range of individuals and organisations, including American sources, that its name is in fact ECHELON, although this is a relatively minor detail\". The U.S. intelligence community uses many code names (see, for example, CIA cryptonym).\n\nFormer NSA employee Margaret Newsham claims that she worked on the configuration and installation of software that makes up the ECHELON system while employed at Lockheed Martin, from 1974 to 1984 in Sunnyvale, California, in the United States, and in Menwith Hill, England, in the UK. \"Unfortunately, I can't tell you all my duties. I am still bound by professional secrecy, and I would hate to go to prison or get involved in any trouble, if you know what I mean. In general, I can tell you that I was responsible for compiling the various systems and programs, configuring the whole thing and making it operational on mainframes\"; \"Margaret Newsham worked for the NSA through her employment at Ford and Lockheed from 1974 to 1984. In 1977 and 1978 Newsham was stationed at the largest listening post in the world at Menwith Hill, England ... Ekstra Bladet has Margaret Newsham's stationing orders from the US Department of Defense. She possessed the high security classification TOP SECRET CRYPTO.\" At that time, according to Newsham, the code name ECHELON was NSA's term for the computer network itself. Lockheed called it P415. The software programs were called SILKWORTH and SIRE. A satellite named VORTEX intercepted communications. An image available on the internet of a fragment apparently torn from a job description shows Echelon listed along with several other code names.\n\nBritain's The Guardian newspaper summarized the capabilities of the ECHELON system as follows:\n\nReporting and disclosures \n\nPublic disclosures (1972–2000) \n\nIn 1972, former NSA analyst Perry Fellwock under pseudonym Winslow Peck, first blew the whistle on ECHELON to Ramparts in 1972, where he gave commentary revealing a global network of listening posts and his experiences working there. Fellwock also included revelations such as the Israeli attack on  was deliberate and known by both sides, the existence of nuclear weapons in Israel in 1972, the widespread involvement of CIA and NSA personnel in drugs and human smuggling, and CIA operatives leading Nationalist China (Taiwan) commandos in burning villages inside PRC borders.\n\nIn 1982, James Bamford, investigative journalist and author wrote The Puzzle Palace, an in-depth look inside the workings of the NSA, then a super-secret agency, and the massive eavesdropping operation under the codename \"SHAMROCK\". The NSA has used many codenames, and SHAMROCK was the codename used for ECHELON prior to 1975.\n\nIn 1988, Margaret Newsham, a Lockheed employee under NSA contract, disclosed the ECHELON surveillance system to members of congress. Newsham told a member of the U.S. Congress that the telephone calls of Strom Thurmond, a Republican U.S. senator, were being collected by the NSA. Congressional investigators determined that \"targeting of U.S. political figures would not occur by accident, but was designed into the system from the start.\"\n\nAlso in 1988, an article titled \"Somebody's Listening\", written by investigative journalist Duncan Campbell in the New Statesman, described the signals intelligence gathering activities of a program code-named \"ECHELON\". James Bamford describes the system as the software controlling the collection and distribution of civilian telecommunications traffic conveyed using communication satellites, with the collection being undertaken by ground stations located in the footprint of the downlink leg.\n\nIn 1996, a detailed description of ECHELON was provided by New Zealand journalist Nicky Hager in his 1996 book Secret Power: New Zealand's Role in the International Spy Network. Two years later, Hager's book was cited by the European Parliament in a report titled \"An Appraisal of the Technology of Political Control\" (PE 168.184).\n\nIn March 1999, for the first time in history, the Australian government admitted that news reports about the top secret UKUSA Agreement were true. Martin Brady, the director of Australia's Defence Signals Directorate (DSD) told the Australian broadcasting channel Nine Network that the DSD \"does co-operate with counterpart signals intelligence organisations overseas under the UKUSA relationship.\"\n\nIn 2000, James Woolsey, the former Director of the U.S. Central Intelligence Agency, confirmed that U.S. intelligence uses interception systems and keyword searches to monitor European businesses.\n\nLawmakers in the United States feared that the ECHELON system could be used to monitor U.S. citizens. According to The New York Times, the ECHELON system has been \"shrouded in such secrecy that its very existence has been difficult to prove.\" Critics said the ECHELON system emerged from the Cold War as a \"Big Brother without a cause\".\n\nEuropean Parliament investigation (2000–2001)\n\nThe program's capabilities and political implications were investigated by a committee of the European Parliament during 2000 and 2001 with a report published in 2001. In July 2000, the Temporary Committee on the ECHELON Interception System was established by the European parliament to investigate the surveillance network. It was chaired by the Portuguese politician Carlos Coelho, who was in charge of supervising investigations throughout 2000 and 2001.\n\nIn May 2001, as the committee finalised its report on the ECHELON system, a delegation travelled to Washington, D.C. to attend meetings with U.S. officials from the following agencies and departments:\n* U.S. Central Intelligence Agency (CIA)\n* U.S. Department of Commerce (DOC)\n* U.S. National Security Agency (NSA)\n\nAll meetings were cancelled by the U.S. government and the committee was forced to end its trip prematurely. According to a BBC correspondent in May 2001, \"The US Government still refuses to admit that Echelon even exists.\"\n\nIn July 2001, the Temporary Committee on the ECHELON Interception System released its final report. On 5 September 2001, the European Parliament voted to accept the committee's report.\n\nThe European Parliament stated in its report that the term ECHELON is used in a number of contexts, but that the evidence presented indicates that it was the name for a signals intelligence collection system. The report concludes that, on the basis of information presented, ECHELON was capable of interception and content inspection of telephone calls, fax, e-mail and other data traffic globally through the interception of communication bearers including satellite transmission, public switched telephone networks (which once carried most Internet traffic), and microwave links.\n\nConfirmation of ECHELON (2015) \n\nTwo internal NSA newsletters from January 2011 and July 2012, published as part of the Snowden-revelations by the website The Intercept on 3 August 2015, for the first time confirmed that NSA used the codeword ECHELON and provided some details about the scope of the program: ECHELON was part of an umbrella program codenamed FROSTING, which was established by the NSA in 1966 to collect and process data from communications satellites. FROSTING had two sub-programs:The Northwest Passage, Yakima Research Station (YRS) newsletter: [http://www.documentcloud.org/documents/2189960-nwp-nsa.html Volume 2, Issue 1, January 2011] & [http://www.documentcloud.org/documents/2189961-nwp2-nsa.html Volume 3, Issue 7, July 2012].\n* TRANSIENT: for intercepting Soviet satellite transmissions, and\n* ECHELON: for intercepting Intelsat satellite transmissions.\n\nOrganization\n\nThe UKUSA intelligence community was assessed by the European Parliament (EP) in 2000 to include the signals intelligence agencies of each of the member states:\n* the Government Communications Headquarters of the United Kingdom,\n* the National Security Agency of the United States,\n* the Communications Security Establishment of Canada,\n* the Australian Signals Directorate of Australia, and\n* the Government Communications Security Bureau of New Zealand.\nThe EP report concluded that it seemed likely that ECHELON is a method of sorting captured signal traffic, rather than a comprehensive analysis tool.\n\nLikely satellite intercept stations\n\nIn 2001, the EP report (p. 54 ff) listed the following ground stations as likely to have, or to have had, a role in intercepting transmissions from telecommunications satellites:\n* Hong Kong (since closed)\n* Australian Defence Satellite Communications Station (Geraldton, Western Australia)\n* RAF Menwith Hill (Yorkshire, U.K.) [https://maps.google.com/maps?fq&geocode\n&q+54%C2%B0+0'31.29%22N+++1%C2%B041'22.17%22W&ie\nUTF8&ll54.009118,-1.689384&spn\n0.003228,0.013561&tk&z\n17&om=1 Map] (reportedly the largest Echelon facility)[http://mondediplo.com/2010/09/04israelbase Le Monde Diplomatique], September 2010\n* Misawa Air Base (Japan) [https://maps.google.com/maps?ll=40.72051,141.326087 Map]\n* GCHQ Bude, formerly known as GCHQ CSO Morwenstow           (Cornwall, U.K.) [https://maps.google.com/maps?fq&source\ns_q&geocode&sspn\n0.009846,0.019312&ieUTF8&ll\n50.885979,-4.553018&spn0.008948,0.019312&t\nh&z=16 Map]\n* Pine Gap (Northern Territory, Australia – close to Alice Springs) [https://maps.google.com/maps?fq&geocode\n&q23.799S,+133.737E&ie\nUTF8&ll-23.798853,133.737066&spn\n0.005026,0.013561&th&z\n17 Map]\n* Sugar Grove (West Virginia, U.S.) [https://maps.google.com/maps?fq&source\ns_q&geocode&sll\n40.442767,-77.338257&sspn2.763215,4.943848&ie\nUTF8&ll38.513906,-79.27964&spn\n0.011098,0.019312&th&z\n16 Map] (since closed)\n* Yakima Training Center (Washington, U.S.) [https://maps.google.com/maps?fq&geocode\n&q46.68209++-120.356544&sll\n46.681405,-120.356056&sspn0.005186,0.004399&g\n46.68209++-120.356544&ieUTF8&t\nk&ll46.681795,-120.357381&spn\n0.005185,0.006437&z18&iwloc\naddr Map] (since closed)\n* GCSB Waihopai (New Zealand)\n* GCSB Tangimoana (New Zealand)\n* CFS Leitrim (Ontario, Canada)\n* Teufelsberg (Berlin, Germany) (closed 1992) – Responsible for listening in to the Eastern Bloc.\n\nOther potentially related stations\n\nThe following stations are listed in the EP report (p. 57 ff) as ones whose roles \"cannot be clearly established\":\n* Ayios Nikolaos (British Sovereign Base area of Dhekelia, Cyprus – U.K.)\n* Gibraltar (U.K.)\n* Diego Garcia (U.K.)\n* Bad Aibling Station (Bad Aibling, Germany – U.S.)\n** relocated to Griesheim/Darmstadt in 2004.According to a statement by Terence Dudlee, the speaker of the US Navy in London, in an interview to the German HR (Hessischer Rundfunk) (German), hr online, 1 October 2004\n* Buckley Air Force Base (Aurora, Colorado)\n* Fort Gordon (Georgia, U.S.)\n* CFB Gander (Newfoundland & Labrador, Canada) \n* Guam (Pacific Ocean, U.S.)\n* Kunia Regional SIGINT Operations Center (Hawaii, U.S.)\n* Lackland Air Force Base, Medina Annex (San Antonio, Texas)\n* RAF Edzell (Scotland) \n* RAF Boulmer (England) \n\nHistory and context \n\nThe ability to intercept communications depends on the medium used, be it radio, satellite, microwave, cellular or fiber-optic. During World War II and through the 1950s, high-frequency (\"short-wave\") radio was widely used for military and diplomatic communicationThe Codebreakers, Ch. 10, 11 and could be intercepted at great distances. The rise of geostationary communications satellites in the 1960s presented new possibilities for intercepting international communications.\n\nIn 1964, plans for the establishment of the ECHELON network took off after dozens of countries agreed to establish the International Telecommunications Satellite Organisation (Intelsat), which would own and operate a global constellation of communications satellites.\n\nIn 1966, the first Intelsat satellite was launched into orbit. From 1970 to 1971, the Government Communications Headquarters (GCHQ) of Britain began to operate a secret signal station  at Morwenstow, near Bude in Cornwall, England. The station intercepted satellite communications over the Atlantic and Indian Oceans. Soon afterwards, the U.S. National Security Agency (NSA) built a second signal station at Yakima, near Seattle, for the interception of satellite communications over the Pacific Ocean.\n\nIn 1981, the GCHQ and the NSA started the construction of the first global wide area network (WAN). Soon after Australia, Canada, and New Zealand joined the ECHELON system. The report to the European Parliament of 2001 states: \"If UKUSA states operate listening stations in the relevant regions of the earth, in principle they can intercept all telephone, fax, and data traffic transmitted via such satellites.\"\n\nMost reports on ECHELON focus on satellite interception. Testimony before the European Parliament indicated that separate but similar UK-U.S. systems are in place to monitor communication through undersea cables, microwave transmissions, and other lines.For example:  The report to the European Parliament points out that interception of private communications by foreign intelligence services is not necessarily limited to the U.S. or British foreign intelligence services.\n\nThe role of satellites in point-to-point voice and data communications has largely been supplanted by fiber optics. In 2006, 99% of the world's long-distance voice and data traffic was carried over optical-fiber. The proportion of international communications accounted for by satellite links is said to have decreased substantially to an amount between 0.4% and 5% in Central Europe. Even in less-developed parts of the world, communications satellites are used largely for point-to-multipoint applications, such as video. Thus, the majority of communications can no longer be intercepted by earth stations; they can only be collected by tapping cables and intercepting line-of-sight microwave signals, which is possible only to a limited extent.\n\nConcerns\n\nBritish journalist Duncan Campbell and New Zealand journalist Nicky Hager asserted in the 1990s that the United States was exploiting ECHELON traffic for industrial espionage, rather than military and diplomatic purposes. Examples alleged by the journalists include the gear-less wind turbine technology designed by the German firm EnerconDie Zeit: 40/1999 \"Verrat unter Freunden (\"Treachery among friends\", German), available at  and the speech technology developed by the Belgian firm Lernout & Hauspie. ([https://translate.google.com/translate?hlen&sl\nnl&uhttp://www.daanspeak.com/Hypocratie09.html&sa\nX&oitranslate&resnum\n1&ct=result Google's translation of the article into English]).\n\nIn 2001, the Temporary Committee on the ECHELON Interception System recommended to the European Parliament that citizens of member states routinely use cryptography in their communications to protect their privacy, because economic espionage with ECHELON has been conducted by the U.S. intelligence agencies.\n\nAmerican author James Bamford provides an alternative view, highlighting that legislation prohibits the use of intercepted communications for commercial purposes, although he does not elaborate on how intercepted communications are used as part of an all-source intelligence process.\n\nIn its report, the committee of the European Parliament stated categorically that the Echelon network was being used to intercept not only military communications, but also private and business ones. In its epigraph to the report, the parliamentary committee quoted Juvenal, \"Sed quis custodiet ipsos custodes. (\"But who will watch the watchers\"). James Bamford, in The Guardian in May 2001, warned that if Echelon were to continue unchecked, it could become a \"cyber secret police, without courts, juries, or the right to a defence\".Bustillos, Maria (9 June 2013). [http://www.newyorker.com/online/blogs/elements/2013/06/a-reflection-in-the-nsas-prism.html \"Our reflection in the N.S.A.'s PRISM\"]. The New Yorker. Retrieved: 2013-10-12.\n\nAlleged examples of espionage conducted by the members of the \"Five Eyes\" include:\n\n* On behalf of the British Prime Minister Margaret Thatcher, the Canadian Security Intelligence Service of Canada spied on two British cabinet ministers in 1983.\n* The U.S. National Security Agency spied on and intercepted the phone calls of Princess Diana right until she died in a Paris car crash with Dodi Fayed in 1997. The NSA currently holds 1,056 pages of classified information about Princess Diana, which has been classified as top secret \"because their disclosure could reasonably be expected to cause exceptionally grave damage to the national security ... the damage would be caused not by the information about Diana, but because the documents would disclose 'sources and methods' of U.S. intelligence gathering\". An official insisted that \"the references to Diana in intercepted conversations were 'incidental',\" and she was never a 'target' of the NSA eavesdropping.\n* U.K. agents monitored the conversations of  the 7th Secretary-General of the United Nations Kofi Annan.\n* U.S. agents gathered \"detailed biometric information\" on the 8th Secretary-General of the United Nations, Ban Ki-Moon.\n* In the early 1990s, the U.S. National Security Agency intercepted the communications between the European aerospace company Airbus and the Saudi Arabian national airline.  In 1994, Airbus lost a $6 billion contract with Saudi Arabia after the NSA,  acting as  a whistleblower, reported that Airbus officials had been bribing Saudi officials to secure the contract. As a result, the American aerospace company McDonnell Douglas (now part of Boeing) won the multibillion-dollar contract instead of Airbus.\n* The American defense contractor Raytheon won a US$1.3 billion contract with the Government of Brazil to monitor the Amazon rainforest after the U.S. Central Intelligence Agency (CIA), acting as a whistleblower, reported that Raytheon's French competitor Thomson-Alcatel had been paying bribes to get the contract.\n* In order to boost America's position in trade negotiations with the then Japanese Trade Minister Ryutaro Hashimoto, in 1995 the CIA eavesdropped on the conversations between Japanese bureaucrats and executives of car manufacturers Toyota and Nissan.\n\nWorkings \n\nThe first American satellite ground station for the ECHELON collection program was built in 1971 at a military firing and training center near Yakima, Washington. The facility, which was codenamed JACKKNIFE, was an investment of ca. 21.3 million dollars and had around 90 people. Satellite traffic was intercepted by a 30-meter single dish antenna. The station became fully operational on 4 October 1974. It was connected with NSA headquarters at Fort Meade by a 75-baud secure Teletype orderwire channel.\n\nIn 1999 the Australian Senate Joint Standing Committee on Treaties was told by Professor Desmond Ball that the Pine Gap facility was used as a ground station for a satellite-based interception network. The satellites were said to be large radio dishes between 20 and 100 meters in diameter in geostationary orbits. The original purpose of the network was to monitor the telemetry from 1970s Soviet weapons, air defence- and other radar's capabilities, satellite's ground station's transmissions and ground-based microwave communications., Official Committee Hansard, Joint Standing Committee on Treaties, 9 August 1999. Commonwealth of Australia.\n\nIn popular culture \n\nThe television series Alias made recurring references to ECHELON throughout its run.\n\nThe antagonist of the anime series Digimon Tamers, D-Reaper, was created by ECHELON.\n\nEchelon Conspiracy, inspired by the surveillance system ECHELON, is a 2009 action thriller film directed by Greg Marcks. It tells the story of Max Peterson (Shane West), an American computer specialist who attempts to uncover a secret plot to turn the world into a global police state. After being chased down by NSA agent Raymond Burke (Martin Sheen), Peterson decides to flee to Moscow.\n\nThe video game series Tom Clancy's Splinter Cell also draws inspiration from this. The series features the protagonist, Sam Fisher, a trained operative belonging to a fictional branch of the National Security Agency called Third Echelon (later, in Splinter Cell: Blacklist, the unit is replaced by the Fourth Echelon).\n\nThe 2007 film The Bourne Ultimatum makes several references to ECHELON. A CIA listening station in London is alerted when ECHELON detects the keyword \"Blackbriar\" in a cell phone conversation between a journalist and his editor. Later in the film, CIA Deputy Director Pamela Landy requests an \"ECHELON package\" on the main character, Jason Bourne.\n\nAlternative rock band Thirty Seconds to Mars' first album includes a song called \"Echelon\". Their fan base is also referred to as the Echelon, though an explanation has not been given as to why the fanbase and the song are referred to as such.\n\nIn the 2000 computer game Deus Ex, the signals intelligence supercomputers Daedalus and Icarus (later Helios) are referred to as Echelon IV.\n\nThe sci-fi crime thriller, Person of Interest, a television show which aired from 2011 to 2016 on the CBS network, had a data-collecting supercomputer as its central narrative. ECHELON. http://en.wikipedia.org/?curid=9282."
  }
}
