{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15821",
  "eid" : "1ef1f5b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778561163,
  "textBody" : "John Uhler \"Jack\" Lemmon III (February 8, 1925 – June 27, 2001) was an American actor and musician. Lemmon was an eight time Academy Award nominee, with two wins. He starred in over 60 films, such as Some Like It Hot, The Apartment, Mister Roberts (for which he won the 1955 Academy Award for Best Supporting Actor), Days of Wine and Roses, The Great Race, Irma la Douce, The Odd Couple and its sequel 30 years later, The Odd Couple II,  (and other frequent collaborations with Odd Couple co-star Walter Matthau), Save the Tiger (for which he won the 1973 Academy Award for Best Actor), The Out-of-Towners, The China Syndrome, Missing (for which he won Best Actor at the 1982 Cannes Film Festival), Glengarry Glen Ross, Tuesdays with Morrie, Grumpy Old Men, and Grumpier Old Men.\n\nEarly life\n\nLemmon was born on February 8, 1925, in an elevator at Newton-Wellesley Hospital in Newton, Massachusetts, a suburb of Boston. He was the only child of Mildred Burgess LaRue  and John Uhler Lemmon, Jr., the president of a doughnut company. Lemmon attended John Ward Elementary School in Newton and the Rivers School in Weston, Massachusetts. During his acceptance of his lifetime achievement award, he stated that he knew he wanted to be an actor from the age of eight. Lemmon attended Phillips Academy (Class of 1943) and Harvard College (Class of 1947), where he lived in Eliot House and was an active member of several Drama Clubs – and president of the Hasty Pudding ClubStated on Inside the Actors Studio, 1998 – as well as a member of the Delphic Club for Gentleman, a final club at Harvard.\n\nAt Harvard, Lemmon was a member of the V-12 Navy College Training Program and was commissioned by the United States Navy, serving briefly as an ensign on an aircraft carrier during World War II before returning to Harvard after completing his military service. After graduation with a degree in War Service Sciences in 1947, Lemmon took up acting professionally, working on radio, television and Broadway. He studied acting under coach Uta Hagen. He was enamored of the piano and learned to play it on his own. He could also play the harmonica, guitar, organ, and the double bass.\n\nCareer\n\nLemmon's film debut was a bit part as a plasterer/painter in the 1949 film The Lady Takes a Sailor, but he went unnoticed until his debut, opposite Judy Holliday, in the 1954 comedy It Should Happen to You. Lemmon worked with actresses such as Marilyn Monroe, Natalie Wood, Betty Grable, Janet Leigh, Shirley MacLaine, Lee Remick, Romy Schneider, Doris Day, Kim Novak, Judy Holliday, Rita Hayworth, June Allyson, Virna Lisi, Ann-Margret and Sophia Loren. He was close friends with actors Tony Curtis, Ernie Kovacs, Walter Matthau and Kevin Spacey. He made two films with Curtis, and fifteen with Matthau.\n\nEarly in Lemmon's career he met comedian Ernie Kovacs while co-starring with him in Operation Mad Ball. Lemmon and Kovacs became close friends and appeared together in two subsequent films, Bell, Book and Candle and It Happened to Jane. In 1977, PBS broadcast a compilation series of Kovacs' television work, and Lemmon served as the narrator of the series. Lemmon discussed his friendship with Kovacs in the documentary Ernie Kovacs: Television's Original Genius.\n\nHe was a favorite of director Billy Wilder, starring in the films Some Like It Hot (for which he was awarded Best Actor at the Cannes Film Festival), The Apartment, Irma la Douce, The Fortune Cookie, Avanti!, The Front Page, and Buddy Buddy.  Wilder felt Lemmon had a natural tendency toward overacting that had to be tempered; the Wilder biography Nobody's Perfect quotes the director as saying, \"Lemmon, I would describe him as a ham, a fine ham, and with ham you have to trim a little fat\". The biography quotes Lemmon as saying, \"I am particularly susceptible to the parts I play... If my character was having a nervous breakdown, I started to have one\".\n\nHe enjoyed longtime working relationships with both Blake Edwards, starring in  Days of Wine and Roses (1962), The Great Race (1965) and That's Life! (1986), and Richard Quine, starring in My Sister Eileen, Operation Mad Ball., Bell, Book and Candle and It Happened to Jane and How to Murder Your Wife (1965). Quine also directed Lemmon's screen test when the actor was signed by Columbia.\n\nSinging and piano playing\n\nLemmon's singing voice was first heard on two film soundtracks in 1955, Three for the Show with Betty Grable and My Sister Eileen. He also performed songs in the 1956 film You Can't Run Away from It with Stubby Kaye and June Allyson. His first solo album A Twist of Lemmon was released in 1958 on Epic Records. While filming Some Like It Hot with Marilyn Monroe in 1959, Lemmon released a second album, Some Like It Hot. Both featured Lemmon's singing and piano solos.\n\nThe two Epic albums were later released as A Twist of Lemmon/Some Like It Hot, a single cd on Collector's Choice Music, in 2001. Two singles, Daphne/Sleepy Lagoon (released in 1959) and I'm Forever Blowing Bubbles/I Cover the Waterfront (released in 1960) did not appear on either album. Epic released a third single in 1960, Lemmon's piano solo of the theme to the film The Apartment, backed with his own composition Lemmon Blues. In 1963, Lemmon released a third album, this time on Capitol Records, entitled Jack Lemmon Plays Piano Selections from Irma La Douce.\n\nAwards and favorite films\n\nLemmon was awarded the Best Supporting Actor Oscar in 1956 for Mister Roberts (1955) and the Best Actor Oscar for Save the Tiger (1973), becoming the first actor to achieve this rare double (the only other actors to achieve this are: Robert De Niro, Gene Hackman, Jack Nicholson, Kevin Spacey and Denzel Washington). He was also nominated for a Best Actor Oscar for his role in the controversial film Missing in 1982, and for his roles in Some Like It Hot (1959), The Apartment (1960), Days of Wine and Roses (1962),  The China Syndrome  (1979), and Tribute (1980). He won another Cannes award for his performance in Missing (which received the Palme d'Or). In 1986, the U.S. National Board of Review of Motion Pictures gave Lemmon a \"Career Achievement\" award; two years later, the American Film Institute gave him its Lifetime Achievement Award.\n\nDays of Wine and Roses (1962) was a favorite role. He portrayed Joe Clay, a young, fun-loving alcoholic businessman. In that film, Lemmon delivered the line, \"My name is Joe Clay ... I'm an alcoholic.\" Three and a half decades later, he stated on the television program Inside the Actors Studio that he was a recovering alcoholic.\n\nLemmon's production company JML produced Cool Hand Luke in 1967. Paul Newman was grateful to Lemmon for his support and offered him the role of the Sundance Kid, later played by Robert Redford in Butch Cassidy and the Sundance Kid, but Lemmon turned it down.  He did not like riding horses and he felt he'd already played too many aspects of the Sundance Kid's character before.A slice of Lemmon for extra character, Bob Flynn, Panorama, p. 7, Canberra Times, August 15, 1998\n\nLemmon appeared in many films partnered with actor Walter Matthau. Among their pairings was 1968's The Odd Couple, as Felix Ungar (Lemmon) and Oscar Madison (Matthau). The first film they starred in together was The Fortune Cookie (for which Matthau won the 1966 Oscar for Best Supporting Actor), The Front Page and Buddy Buddy. In 1971, Lemmon directed Matthau in the comedy Kotch. It was the only movie that Lemmon directed and Matthau was nominated for the Best Actor Oscar for his performance.\n\nAdditionally, Lemmon and Matthau had small parts in Oliver Stone's 1991 film, JFK (the only film in which both appeared without sharing screen time). In 1993, the duo teamed again to star in Grumpy Old Men. The film was a surprise hit, earning the two actors a new generation of young fans.  During the rest of the decade, they would star together in Grumpier Old Men, Out to Sea, and the widely panned The Odd Couple II. In 1996, Lemmon was awarded the Honorary Golden Bear award at the 46th Berlin International Film Festival. In 1997, Lemmon was a guest voice on The Simpsons episode \"The Twisted World of Marge Simpson,\" playing the character Frank Ormand, owner of the pretzel business that Marge Simpson franchised. The recurring character Gil Gunderson, voiced by Dan Castellaneta, is an ongoing parody of Lemmon's character in Glengarry Glen Ross.\n\nAt the 1998 Golden Globe Awards, he was nominated for \"Best Actor in a Made for TV Movie\" for his role in Twelve Angry Men losing to Ving Rhames.  After accepting the award, Rhames asked Lemmon to come on stage and, in a move that stunned the audience, gave his award to him. (The Hollywood Foreign Press Association, which presents the Golden Globes, had a second award made and sent to Rhames.).[https://www.youtube.com/watch?v=Tk3EgDPZD0w# Ving Rhames gives his Golden Globe to Jack Lemmon (1998)] He received the AFI Life Achievement Award in 1988.\n\nLemmon won the Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for his role as Morrie Schwartz in his final television role, Tuesdays with Morrie. His final film role was an uncredited one: the narrator in Robert Redford's film The Legend of Bagger Vance.\n\nActor Kevin Spacey recalled that Lemmon is remembered for always making time for other people. Already regarded as a legend, he met teenage Spacey backstage after a theater performance and spoke to him about pursuing an acting career. Spacey would later work with Lemmon in The Murder of Mary Phagan (1987), Dad (1989), the critically acclaimed film Glengarry Glen Ross (1992) and on stage in a revival of Long Day's Journey into Night. Lemmon was Spacey's mentor, and taught Spacey that people who do well in a business have an obligation to \"send the elevator back down\" to help lift people starting out on the ground floor.\n\nIn his autobiography, My Life, Burt Reynolds recalls Lemmon as the quintessential gentleman who never spoke ill of anyone, even if they deserved it. This kindness backfired for Reynolds: prior to accepting the lead in W.W. and the Dixie Dancekings (1975), directed by John G. Avildsen, Reynolds asked Lemmon, whom Avildsen had directed in Save the Tiger (1973) for an opinion of Avildsen as a director. Lemmon told Reynolds that Avildsen was \"okay\", and Reynolds accepted the role. After the film was released and his experiences in production proved unhappy, Reynolds complained to Lemmon and described Avildsen as an \"asshole\", whereupon Lemmon replied, \"I guess you could say that.\"Reynolds, Burt. (1994) My Life. New York: Hyperion. \n\nPersonal life\n\nLemmon was married twice. His first wife was actress Cynthia Stone, with whom he had a son, Chris Lemmon (born 1954). His second wife was actress Felicia Farr, with whom he had a daughter, Courtney (born 1966). Farr had a daughter from a previous relationship (her marriage to Lee Farr) named Denise. Lemmon was a Catholic.Don Widener Lemmon: A Biography (1975), page 7 He publicly announced his alcoholism during a 1998 interview on Inside the Actors Studio.\n\nTo golfers everywhere Lemmon was known as the \"star\" of the celebrity-packed third round telecast of the annual AT&T Pebble Beach Pro-Am, held at Pebble Beach Golf Links each February.  Lemmon's packed gallery was there not only for his humor but also to root him on in his lifelong quest to \"make the cut\" to round 4, something he was not able to achieve.  The amateur who helps his team most in the Pro-Am portion is annually awarded the Jack Lemmon Award.\n\nDuring the 1980s and 1990s Lemmon served on the advisory board of the National Student Film Institute.\n\nLemmon was a registered Democrat.https://www.theguardian.com/news/2001/jun/29/guardianobituaries.filmnews2\n\nDeath\n\nLemmon died of metastatic cancer of the bladder on June 27, 2001. He had been fighting the disease, privately, for two years before his death. He was interred at Westwood Village Memorial Park Cemetery in Westwood, California, buried near his friend and co-star, Walter Matthau, who died almost exactly one year before Lemmon. His gravestone reads like a title screen from a film: \"JACK LEMMON in\"[http://www.seeing-stars.com/imagepages/jacklemmongravephoto.shtml \"THE GRAVE OF JACK LEMMON\"]. Seeing Stars in Hollywood. Retrieved September 21, 2015.\n\nFilmography\n\nFilm\n\nTelevision\n\nDiscography\n\n* A Twist of Lemmon (1958)\n* Some Like It Hot (1959)\n* Piano Selections from Irma La Douce (1963)\n* Piano and Vocals (1990)\n* Peter and the Wolf (1991)\n* Songs and music from Some Like It Hot (2001)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jack Lemmon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15821" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Uhler \"Jack\" Lemmon III (February 8, 1925 – June 27, 2001) was an American actor and musician. Lemmon was an eight time Academy Award nominee, with two wins. He starred in over 60 films, such as Some Like It Hot, The Apartment, Mister Roberts (for which he won the 1955 Academy Award for Best Supporting Actor), Days of Wine and Roses, The Great Race, Irma la Douce, The Odd Couple and its sequel 30 years later, The Odd Couple II,  (and other frequent collaborations with Odd Couple co-star Walter Matthau), Save the Tiger (for which he won the 1973 Academy Award for Best Actor), The Out-of-Towners, The China Syndrome, Missing (for which he won Best Actor at the 1982 Cannes Film Festival), Glengarry Glen Ross, Tuesdays with Morrie, Grumpy Old Men, and Grumpier Old Men.\n\nEarly life\n\nLemmon was born on February 8, 1925, in an elevator at Newton-Wellesley Hospital in Newton, Massachusetts, a suburb of Boston. He was the only child of Mildred Burgess LaRue  and John Uhler Lemmon, Jr., the president of a doughnut company. Lemmon attended John Ward Elementary School in Newton and the Rivers School in Weston, Massachusetts. During his acceptance of his lifetime achievement award, he stated that he knew he wanted to be an actor from the age of eight. Lemmon attended Phillips Academy (Class of 1943) and Harvard College (Class of 1947), where he lived in Eliot House and was an active member of several Drama Clubs – and president of the Hasty Pudding ClubStated on Inside the Actors Studio, 1998 – as well as a member of the Delphic Club for Gentleman, a final club at Harvard.\n\nAt Harvard, Lemmon was a member of the V-12 Navy College Training Program and was commissioned by the United States Navy, serving briefly as an ensign on an aircraft carrier during World War II before returning to Harvard after completing his military service. After graduation with a degree in War Service Sciences in 1947, Lemmon took up acting professionally, working on radio, television and Broadway. He studied acting under coach Uta Hagen. He was enamored of the piano and learned to play it on his own. He could also play the harmonica, guitar, organ, and the double bass.\n\nCareer\n\nLemmon's film debut was a bit part as a plasterer/painter in the 1949 film The Lady Takes a Sailor, but he went unnoticed until his debut, opposite Judy Holliday, in the 1954 comedy It Should Happen to You. Lemmon worked with actresses such as Marilyn Monroe, Natalie Wood, Betty Grable, Janet Leigh, Shirley MacLaine, Lee Remick, Romy Schneider, Doris Day, Kim Novak, Judy Holliday, Rita Hayworth, June Allyson, Virna Lisi, Ann-Margret and Sophia Loren. He was close friends with actors Tony Curtis, Ernie Kovacs, Walter Matthau and Kevin Spacey. He made two films with Curtis, and fifteen with Matthau.\n\nEarly in Lemmon's career he met comedian Ernie Kovacs while co-starring with him in Operation Mad Ball. Lemmon and Kovacs became close friends and appeared together in two subsequent films, Bell, Book and Candle and It Happened to Jane. In 1977, PBS broadcast a compilation series of Kovacs' television work, and Lemmon served as the narrator of the series. Lemmon discussed his friendship with Kovacs in the documentary Ernie Kovacs: Television's Original Genius.\n\nHe was a favorite of director Billy Wilder, starring in the films Some Like It Hot (for which he was awarded Best Actor at the Cannes Film Festival), The Apartment, Irma la Douce, The Fortune Cookie, Avanti!, The Front Page, and Buddy Buddy.  Wilder felt Lemmon had a natural tendency toward overacting that had to be tempered; the Wilder biography Nobody's Perfect quotes the director as saying, \"Lemmon, I would describe him as a ham, a fine ham, and with ham you have to trim a little fat\". The biography quotes Lemmon as saying, \"I am particularly susceptible to the parts I play... If my character was having a nervous breakdown, I started to have one\".\n\nHe enjoyed longtime working relationships with both Blake Edwards, starring in  Days of Wine and Roses (1962), The Great Race (1965) and That's Life! (1986), and Richard Quine, starring in My Sister Eileen, Operation Mad Ball., Bell, Book and Candle and It Happened to Jane and How to Murder Your Wife (1965). Quine also directed Lemmon's screen test when the actor was signed by Columbia.\n\nSinging and piano playing\n\nLemmon's singing voice was first heard on two film soundtracks in 1955, Three for the Show with Betty Grable and My Sister Eileen. He also performed songs in the 1956 film You Can't Run Away from It with Stubby Kaye and June Allyson. His first solo album A Twist of Lemmon was released in 1958 on Epic Records. While filming Some Like It Hot with Marilyn Monroe in 1959, Lemmon released a second album, Some Like It Hot. Both featured Lemmon's singing and piano solos.\n\nThe two Epic albums were later released as A Twist of Lemmon/Some Like It Hot, a single cd on Collector's Choice Music, in 2001. Two singles, Daphne/Sleepy Lagoon (released in 1959) and I'm Forever Blowing Bubbles/I Cover the Waterfront (released in 1960) did not appear on either album. Epic released a third single in 1960, Lemmon's piano solo of the theme to the film The Apartment, backed with his own composition Lemmon Blues. In 1963, Lemmon released a third album, this time on Capitol Records, entitled Jack Lemmon Plays Piano Selections from Irma La Douce.\n\nAwards and favorite films\n\nLemmon was awarded the Best Supporting Actor Oscar in 1956 for Mister Roberts (1955) and the Best Actor Oscar for Save the Tiger (1973), becoming the first actor to achieve this rare double (the only other actors to achieve this are: Robert De Niro, Gene Hackman, Jack Nicholson, Kevin Spacey and Denzel Washington). He was also nominated for a Best Actor Oscar for his role in the controversial film Missing in 1982, and for his roles in Some Like It Hot (1959), The Apartment (1960), Days of Wine and Roses (1962),  The China Syndrome  (1979), and Tribute (1980). He won another Cannes award for his performance in Missing (which received the Palme d'Or). In 1986, the U.S. National Board of Review of Motion Pictures gave Lemmon a \"Career Achievement\" award; two years later, the American Film Institute gave him its Lifetime Achievement Award.\n\nDays of Wine and Roses (1962) was a favorite role. He portrayed Joe Clay, a young, fun-loving alcoholic businessman. In that film, Lemmon delivered the line, \"My name is Joe Clay ... I'm an alcoholic.\" Three and a half decades later, he stated on the television program Inside the Actors Studio that he was a recovering alcoholic.\n\nLemmon's production company JML produced Cool Hand Luke in 1967. Paul Newman was grateful to Lemmon for his support and offered him the role of the Sundance Kid, later played by Robert Redford in Butch Cassidy and the Sundance Kid, but Lemmon turned it down.  He did not like riding horses and he felt he'd already played too many aspects of the Sundance Kid's character before.A slice of Lemmon for extra character, Bob Flynn, Panorama, p. 7, Canberra Times, August 15, 1998\n\nLemmon appeared in many films partnered with actor Walter Matthau. Among their pairings was 1968's The Odd Couple, as Felix Ungar (Lemmon) and Oscar Madison (Matthau). The first film they starred in together was The Fortune Cookie (for which Matthau won the 1966 Oscar for Best Supporting Actor), The Front Page and Buddy Buddy. In 1971, Lemmon directed Matthau in the comedy Kotch. It was the only movie that Lemmon directed and Matthau was nominated for the Best Actor Oscar for his performance.\n\nAdditionally, Lemmon and Matthau had small parts in Oliver Stone's 1991 film, JFK (the only film in which both appeared without sharing screen time). In 1993, the duo teamed again to star in Grumpy Old Men. The film was a surprise hit, earning the two actors a new generation of young fans.  During the rest of the decade, they would star together in Grumpier Old Men, Out to Sea, and the widely panned The Odd Couple II. In 1996, Lemmon was awarded the Honorary Golden Bear award at the 46th Berlin International Film Festival. In 1997, Lemmon was a guest voice on The Simpsons episode \"The Twisted World of Marge Simpson,\" playing the character Frank Ormand, owner of the pretzel business that Marge Simpson franchised. The recurring character Gil Gunderson, voiced by Dan Castellaneta, is an ongoing parody of Lemmon's character in Glengarry Glen Ross.\n\nAt the 1998 Golden Globe Awards, he was nominated for \"Best Actor in a Made for TV Movie\" for his role in Twelve Angry Men losing to Ving Rhames.  After accepting the award, Rhames asked Lemmon to come on stage and, in a move that stunned the audience, gave his award to him. (The Hollywood Foreign Press Association, which presents the Golden Globes, had a second award made and sent to Rhames.).[https://www.youtube.com/watch?v=Tk3EgDPZD0w# Ving Rhames gives his Golden Globe to Jack Lemmon (1998)] He received the AFI Life Achievement Award in 1988.\n\nLemmon won the Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for his role as Morrie Schwartz in his final television role, Tuesdays with Morrie. His final film role was an uncredited one: the narrator in Robert Redford's film The Legend of Bagger Vance.\n\nActor Kevin Spacey recalled that Lemmon is remembered for always making time for other people. Already regarded as a legend, he met teenage Spacey backstage after a theater performance and spoke to him about pursuing an acting career. Spacey would later work with Lemmon in The Murder of Mary Phagan (1987), Dad (1989), the critically acclaimed film Glengarry Glen Ross (1992) and on stage in a revival of Long Day's Journey into Night. Lemmon was Spacey's mentor, and taught Spacey that people who do well in a business have an obligation to \"send the elevator back down\" to help lift people starting out on the ground floor.\n\nIn his autobiography, My Life, Burt Reynolds recalls Lemmon as the quintessential gentleman who never spoke ill of anyone, even if they deserved it. This kindness backfired for Reynolds: prior to accepting the lead in W.W. and the Dixie Dancekings (1975), directed by John G. Avildsen, Reynolds asked Lemmon, whom Avildsen had directed in Save the Tiger (1973) for an opinion of Avildsen as a director. Lemmon told Reynolds that Avildsen was \"okay\", and Reynolds accepted the role. After the film was released and his experiences in production proved unhappy, Reynolds complained to Lemmon and described Avildsen as an \"asshole\", whereupon Lemmon replied, \"I guess you could say that.\"Reynolds, Burt. (1994) My Life. New York: Hyperion. \n\nPersonal life\n\nLemmon was married twice. His first wife was actress Cynthia Stone, with whom he had a son, Chris Lemmon (born 1954). His second wife was actress Felicia Farr, with whom he had a daughter, Courtney (born 1966). Farr had a daughter from a previous relationship (her marriage to Lee Farr) named Denise. Lemmon was a Catholic.Don Widener Lemmon: A Biography (1975), page 7 He publicly announced his alcoholism during a 1998 interview on Inside the Actors Studio.\n\nTo golfers everywhere Lemmon was known as the \"star\" of the celebrity-packed third round telecast of the annual AT&T Pebble Beach Pro-Am, held at Pebble Beach Golf Links each February.  Lemmon's packed gallery was there not only for his humor but also to root him on in his lifelong quest to \"make the cut\" to round 4, something he was not able to achieve.  The amateur who helps his team most in the Pro-Am portion is annually awarded the Jack Lemmon Award.\n\nDuring the 1980s and 1990s Lemmon served on the advisory board of the National Student Film Institute.\n\nLemmon was a registered Democrat.https://www.theguardian.com/news/2001/jun/29/guardianobituaries.filmnews2\n\nDeath\n\nLemmon died of metastatic cancer of the bladder on June 27, 2001. He had been fighting the disease, privately, for two years before his death. He was interred at Westwood Village Memorial Park Cemetery in Westwood, California, buried near his friend and co-star, Walter Matthau, who died almost exactly one year before Lemmon. His gravestone reads like a title screen from a film: \"JACK LEMMON in\"[http://www.seeing-stars.com/imagepages/jacklemmongravephoto.shtml \"THE GRAVE OF JACK LEMMON\"]. Seeing Stars in Hollywood. Retrieved September 21, 2015.\n\nFilmography\n\nFilm\n\nTelevision\n\nDiscography\n\n* A Twist of Lemmon (1958)\n* Some Like It Hot (1959)\n* Piano Selections from Irma La Douce (1963)\n* Piano and Vocals (1990)\n* Peter and the Wolf (1991)\n* Songs and music from Some Like It Hot (2001). Jack Lemmon. http://en.wikipedia.org/?curid=15821."
  }
}
