{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15978",
  "eid" : "2248c1d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778566765,
  "textBody" : "James Monroe (; April 28, 1758 – July 4, 1831) was an American statesman and Founding Father who served as the fifth President of the United States from 1817 to 1825. Monroe was the last president of the Virginia dynasty, and his presidency ushered in what is known as the Era of Good Feelings. Born in Westmoreland County, Virginia, Monroe was of the planter class and fought in the American Revolutionary War. He was wounded in the Battle of Trenton with a musket ball to his shoulder. After studying law under Thomas Jefferson from 1780 to 1783, he served as a delegate in the Continental Congress.\n\nAs an anti-federalist delegate to the Virginia convention that considered ratification of the United States Constitution, Monroe opposed ratification, claiming it gave too much power to the central government. He took an active part in the new government, and in 1790 he was elected to the Senate of the first United States Congress, where he joined the Democratic-Republicans. He gained experience as an executive as the Governor of Virginia and rose to national prominence as a diplomat in France, when he helped negotiate the Louisiana Purchase in 1803. During the War of 1812, Monroe served in critical roles as Secretary of State and the Secretary of War under President James Madison..\n\nFacing little opposition from the fractured Federalist Party, Monroe was easily elected president in 1816, winning over 80 percent of the electoral vote and becoming the last president during the First Party System era of American politics. As president, he sought to ease partisan tensions, embarking on a tour of the country that was well received. With the ratification of the Treaty of 1818, under the successful diplomacy of his Secretary of State John Quincy Adams, the United States extended its reach from the Atlantic to the Pacific, by acquiring harbor and fishing rights in the Pacific Northwest; the United States and Britain jointly occupied the Oregon Country. In addition to the acquisition of Florida, the 1819 Adams–Onís Treaty secured the westernmost section of the southern border of the United States along the 42nd Parallel to the Pacific Ocean and represented America's first determined attempt at creating an \"American global empire\". As nationalism surged, partisan acrimony subsided. This swell of national purpose and political harmony subsided some when the Panic of 1819 struck and a dispute over the admission of Missouri embroiled the country in 1820. Nonetheless, Monroe won near-unanimous reelection.\n\nMonroe supported the founding of colonies in Africa for freed slaves that would eventually form the nation of Liberia, whose capital, Monrovia, is named in his honor. In 1823, he announced the United States' opposition to any European intervention in the recently independent countries of the Americas with the Monroe Doctrine, which became a landmark in American foreign policy. His presidency concluded the first period of American presidential history before the beginning of Jacksonian democracy and the Second Party System era. Following his retirement in 1825, Monroe was plagued by financial difficulties. He died in New York City on July 4, 1831. He has been generally ranked as an above-average president.\n\nEarly life\n\nJames Monroe was born on April 28, 1758, in his parents' house located in a wooded area of Westmoreland County, Virginia. The marked site is one mile from the unincorporated community known today as Monroe Hall, Virginia. The James Monroe Family Home Site was listed on the National Register of Historic Places in 1979. His father Spence Monroe (1727–1774) was a moderately prosperous planter who also practiced carpentry. His mother Elizabeth Jones (1730–1772) married Spence Monroe in 1752 and they had five children: Elizabeth, James, Spence, Andrew, and Joseph Jones..\n\nHis paternal great-grandfather Patrick Andrew Monroe emigrated to America from Scotland in the mid-17th century. In 1650 he patented a large tract of land in Washington Parish, Westmoreland County, Virginia. Monroe's mother was the daughter of a wealthy Welsh immigrant who had settled in nearby King George County, Virginia. Also among James Monroe's ancestors were French Huguenot immigrants, who came to Virginia in 1700.\n\nAt age eleven, Monroe was enrolled in the lone school in the county. Monroe attended this school for only eleven weeks a year, as his labor was needed on the farm. During this time, Monroe formed a lifelong friendship with an older classmate, John Marshall. Monroe's mother died in 1772, and his father died two years later. Though he inherited property from both of his parents, the sixteen-year-old Monroe was forced to withdraw from school to support his younger brothers. His childless maternal uncle, Joseph Jones, became a surrogate father to Monroe and his siblings. A member of the Virginia House of Burgesses, Jones took Monroe to the capital of Williamsburg, Virginia and enrolled him in the College of William and Mary. Jones also introduced Monroe to important Virginians such as Thomas Jefferson, Patrick Henry, and George Washington. In 1774, opposition to the British government grew in the Thirteen Colonies in reaction to the \"Intolerable Acts,\" and Virginia sent a delegation to the First Continental Congress. Monroe became involved in the opposition to Lord Dunmore, the colonial governor of Virginia, and he took part in the storming of the Governor's Palace.\n\nRevolutionary War service\n\nIn early 1776, about a year and a half after his enrollment, Monroe dropped out of college and joined the 3rd Virginia Regiment in the Continental Army.. As the fledgling army valued literacy in its officers, Monroe was commissioned with the rank of lieutenant, serving under Captain William Washington. After months of training, Monroe and seven hundred Virginia infantrymen were called north to serve in the New York and New Jersey campaign. Shortly after the Virginians arrived, Washington led the army in a retreat from New York City into New Jersey and then across the Delaware River into Pennsylvania. In December, Monroe took part in a surprise attack on a Hessian encampment. Though the attack was successful, Monroe suffered a severed artery in the battle and nearly died. In the aftermath of the battle, George Washington cited Monroe and William Washington for their bravery, and promoted Monroe to the rank of captain. After his wounds healed, Monroe returned to Virginia to recruit his own company of soldiers. Monroe's participation in the battle was memorialized in John Trumbull's painting, The Capture of the Hessians at Trenton, December 26, 1776, as well as Emanuel Leutze's Washington Crossing the Delaware.\n\nLacking the wealth to induce soldiers to join his company, Monroe instead asked his uncle to return him to the front. Monroe was assigned to the staff of General William Alexander, Lord Stirling. During this time, Monroe formed a close friendship with the Marquis de Lafayette, a French volunteer who encouraged Monroe to view the war as part of a wider struggle against religious and political tyranny. Monroe served in the Philadelphia campaign and spent the winter of 1777–1778 at the encampment of Valley Forge, sharing a log hut with Marshall. After serving in the Battle of Monmouth, the destitute Monroe resigned his commission in December 1778 and joined his uncle in Philadelphia. After the British captured Savannah, the Virginia legislature decided to raise four regiments, and Monroe returned to his native state, hoping to receive his own command. With letters of recommendation from Washington, Stirling, and Alexander Hamilton, Monroe received a commission as a lieutenant colonel and was expected to lead one of the regiments, but recruitment again proved to be an issue. On the advice of Jones, Monroe returned to Williamsburg to study law, becoming a protege of Virginia Governor Thomas Jefferson.\n\nWith the British increasingly focusing their operations in the Southern colonies, the Virginians moved the capital to the more defensible city of Richmond, and Monroe accompanied Jefferson to the new capital. As Governor of Virginia, Jefferson held command over the state's militia, and he appointed Monroe to the rank of colonel, and Monroe established a messenger network to coordinate with the Continental Army and other state militias. Still unable to raise an army due to a lack of interested recruits, Monroe traveled to his home in King George County, and thus was not present for the British raid of Richmond. As both the Continental Army and the Virginia militia had an abundance of officers, Monroe did not serve during the Yorktown campaign, and, much to his frustration, Monroe did not take part in the Siege of Yorktown. Although Andrew Jackson served as a courier in a militia unit at age thirteen, Monroe is regarded as the last U.S. President who was a Revolutionary War veteran, since he served as an officer of the Continental Army and took part in combat.\nMonroe resumed studying law under Jefferson and continued until 1783. He was not particularly interested in legal theory or practice, but chose to take it up because he thought it offered \"the most immediate rewards\" and could ease his path to wealth, social standing, and political influence. Monroe was admitted to the Virginia bar and practiced in Fredericksburg, Virginia.\n\nMarriage and family\n\nOn February 16, 1786 Monroe married Elizabeth Kortright (1768–1830) in New York City. She was the daughter of Hannah Aspinwall Kortright and Laurence Kortright, a wealthy trader and former British officer. He met her while serving in the Continental Congress.\n\nAfter a brief honeymoon on Long Island, New York, the Monroes returned to New York City to live with her father until Congress adjourned. They then moved to Virginia, settling in Charlottesville, Virginia in 1789. They bought an estate in Charlottesville known as Ash Lawn–Highland, settling on the property in 1799. The Monroes had the following children:\n* Eliza Kortright Monroe Hay (1786–1840): Eliza was born in Fredericksburg, Virginia, in 1786, and was educated in Paris at the school of Madame Campan during the time her father was the United States Ambassador to France. In 1808 she married George Hay, a prominent Virginia attorney who had served as prosecutor in the trial of Aaron Burr and later U.S. District Judge.\n* James Spence Monroe (1799–1800): a son who died 16 months after birth.\n* Maria Hester Monroe (1804–1850): married her cousin Samuel L. Gouverneur on March 8, 1820, in the first wedding of a president's child in the White House. Excerpt from \n\nPlantations and slavery\n\nMonroe sold his small inherited Virginia plantation in 1783 to enter law and politics. He later fulfilled his youthful dream of becoming the owner of a large plantation and wielding great political power, but his plantation was never profitable. Although he owned much more land and many more slaves, and speculated in property, he was rarely on-site to oversee the operations. Overseers treated the slaves harshly to force production, but the plantations barely broke even. Monroe incurred debts by his lavish and expensive lifestyle and often sold property (including slaves) to pay them off. Overseers moved or separated slave families from different Monroe plantations in accordance with production and maintenance needs of each satellite plantation. One of Monroe's slaves named Daniel often ran away from his plantation in Albermarle County, to visit other slaves or separated family members. Monroe commonly referred to Daniel as a \"scoundrel\" and described the \"worthlessness\" of Daniel as a runaway slave. The practice of moving and separating slave families was common treatment of slaves in the South.\n\nEarly political career\n\nVirginia politics\n\nMonroe was elected to the Virginia House of Delegates in 1782. After serving on Virginia's Executive Council, he was elected to the Congress of the Confederation in November 1783 and served in Annapolis until Congress convened in Trenton, New Jersey in June 1784. He had served a total of three years when he finally retired from that office by the rule of rotation. By that time, the government was meeting in the temporary capital of New York City. While serving in Congress, Monroe became an advocate for western expansion, and played a key role in the writing and passage of the Northwest Ordinance. The ordinance created the Northwest Territory, providing for federal administration of the territories West of Pennsylvania and North of the Ohio River. During this period, Jefferson continued to serve as a mentor to Monroe, and, at Jefferson's prompting, he befriended another prominent Virginian, James Madison.\n\nMonroe resigned from Congress in 1786 to focus on his legal career, and he became an attorney for the state. In 1787, Monroe won election to another term in the Virginia House of Delegates. Though he had become outspoken in his desire to reform the Articles, he was unable to attend the Philadelphia Convention due to his work obligations. In 1788, Monroe became a delegate to the Virginia Ratifying Convention. In Virginia, the struggle over the ratification of the proposed Constitution involved more than a simple clash between federalists and anti-federalists. Virginians held a full spectrum of opinions about the merits of the proposed change in national government. Washington and Madison were leading supporters; Patrick Henry and George Mason were leading opponents. Those who held the middle ground in the ideological struggle became the central figures. Led by Monroe and Edmund Pendleton, these \"federalists who are for amendments,\" criticized the absence of a bill of rights and worried about surrendering taxation powers to the central government. After Madison reversed himself and promised to pass a bill of rights, the Virginia convention ratified the constitution by a narrow vote, though Monroe himself voted against it. Virginia was tenth state to ratify the Constitution, and all thirteen states eventually ratified the document.\n\nSenator\n\nHenry and other anti-federalists hoped to elect a Congress that would amend the Constitution to take away most of the powers it had been granted (\"commit suicide on [its] own authority,\" as Madison put it). Henry recruited Monroe to run against Madison for a House seat in the First Congress, and he had the Virginia legislature draw a congressional district designed to elect Monroe. During the campaign, Madison and Monroe often traveled together, and the election did not destroy their friendship. Madison prevailed over Monroe, taking 1,308 votes compared to Monroe's 972 votes. Following his defeat, Monroe returned to his legal duties and developed his farm in Charlottesville. After the death of Senator William Grayson in 1790, Monroe was elected to serve the remainder of Grayson's term.\n\nDuring the presidency of George Washington, U.S. politics became increasingly polarized between the supporters of Secretary of State Jefferson and\nthe Federalists, led by Secretary of the Treasury Alexander Hamilton. Monroe stood firmly with Jefferson in opposing Hamilton's strong central government and strong executive. The Democratic-Republican Party coalesced around Jefferson and Madison, and Monroe became one of the fledgling party's leader in the Senate. He also helped organize opposition to John Adams in the 1792\nelection, though Adams defeated George Clinton to win re-election.Cunningham, pp. 3–5 As the 1790s progressed, the French Revolutionary Wars came to dominate U.S. foreign policy, with British and French raids both threatening U.S. trade with Europe. Like most other Jeffersonians, Monroe supported the French Revolution, but Hamilton's followers tended to sympathize more with Britain. In 1794, hoping to find a way to avoid war with both countries, Washington appointed Monroe as his ambassador to France. At the same time, he appointed the anglophile Federalist John Jay as his Ambassador to the United Kingdom.\n\nAmbassador to France\n\nAfter arriving in France, Monroe addressed the National Convention, receiving a standing applause for his speech celebrating republicanism. He experienced several early diplomatic successes, including the protection of U.S. trade from French attacks. He also used his influence to win the release of Thomas Paine and Adrienne de La Fayette, the wife of the Marquis de Lafayette. Months after Monroe arrived in France, the U.S. and Great Britain concluded the Jay Treaty, outraging both the French and Monroe—not fully informed about the treaty prior to its publication. Despite the undesirable effects of the Jay Treaty on Franco-American relations, Monroe won French support for U.S. navigational rights on the Mississippi River—the mouth of which was controlled by Spain—and in 1795 the U.S. and Spain signed Pinckney's Treaty. The treaty granted the U.S. limited rights to use the port of New Orleans.\n\nFrustrated by Monroe's inability to convince the French of the benign nature of the Jay Treaty, Washington recalled Monroe in November 1796. He returned to the United States, where he wrote a 400-page defense of his tenure as ambassador, criticizing Washington's desire to pursue closer relations with Britain at the expense of relations with France. Returning to his home in Charlottesville, he resumed his dual careers as a farmer and lawyer. Jefferson and Madison urged Monroe to run for Congress, but Monroe chose to focus on state politics instead.Cunningham, pp. 6–7\n\nGovernor of Virginia and diplomat\n\nGovernor of Virginia\n\nOn a party-line vote, the Virginia legislature elected Monroe as Governor of Virginia in 1799. He would serve as governor until 1802.Cunningham, p. 7 The constitution of Virginia endowed the governor with very few powers aside from commanding the militia when the Assembly called it into action. But Monroe used his stature to convince legislators to enhance state involvement in transportation and education and to increase training for the militia. Monroe also began to give State of the Commonwealth addresses to the legislature, in which he highlighted areas in which he believed the legislature should act. Monroe also led an effort to create the state's first penitentiary, and imprisonment replaced other, often harsher, punishments. In 1800, Monroe called out the state militia to suppress Gabriel's Rebellion, a slave rebellion originating on a plantation six miles from the capital of Richmond. Gabriel and 27 other enslaved people who participated were all hanged for treason.\n\nMonroe thought that foreign and Federalist elements had created the Quasi War of 1798–1800, and he strongly supported Thomas Jefferson's candidacy for president in 1800. Federalists were likewise suspicious of Monroe, some viewing him at best as a French dupe and at worst a traitor. With the power to appoint election officials in Virginia, Monroe exercised his influence to help Jefferson win Virginia's presidential electors.Cunningham, pp. 7–8 He also considered using the Virginia militia to force the outcome in favor of Jefferson.. Jefferson won the 1800 election, and he appointed Madison as his Secretary of State. As a member of Jefferson's party and the leader of the largest state in the country, Monroe emerged as one of Jefferson's two most likely successors, alongside Madison.\n\nLouisiana Purchase and ambassador to Britain\n\nShortly after the end of Monroe's gubernatorial tenure, President Jefferson sent Monroe back to France to assist Ambassador Robert R. Livingston in negotiating the Louisiana Purchase. In the 1800 Treaty of San Ildefonso, France had acquired the territory of Louisiana from Spain; at the time, many in the U.S. believed that France had also acquired West Florida in the same treaty. The American delegation originally sought to acquire West Florida and the city of New Orleans, which controlled the trade of the Mississippi River. Determined to acquire New Orleans even if it meant war with France, Jefferson also authorized Monroe to form an alliance with the British if the French refused to sell the city.\n\nMeeting with François Barbé-Marbois, the French foreign minister, Monroe and Livingston agreed to purchase the entire territory of Louisiana for $15 million; the purchase became known as the Louisiana Purchase. In agreeing to the purchase, Monroe violated his instructions, which had only allowed $9 million for the purchase of New Orleans and West Florida. The French did not acknowledge that West Florida remained in Spanish possession, and the United States would claim that France had sold West Florida to the United States for several years to come. Though he had not ordered the purchase of the entire territory, Jefferson strongly supported Monroe's actions, which ensured that the United States would continue to expand to the West. Overcoming doubts about whether the Constitution authorized the purchase of foreign territory, Jefferson won congressional approval for the Louisiana Purchase, and the acquisition doubled the size of the United States. Monroe would travel to Spain in 1805 to try to win the cession of West Florida, but, with the support of France, Spain refused to consider relinquishing the territory.\n\nAfter the resignation of Rufus King, Monroe was appointed as the ambassador to Great Britain in 1803. The greatest issue of contention between the United States and Britain was that of the impressment of U.S. sailors. Many U.S. merchant ships employed British seamen who had deserted or dodged conscription, and the British frequently impressed sailors on U.S. ships in hopes of quelling their manpower issues. However, many of the sailors they impressed had never been British subjects, and Monroe was tasked with persuading the British to stop their practice of impressment. Monroe found little success in this endeavor, partly due to Jefferson's alienation of the British minister to the United States, Anthony Merry. Rejecting Jefferson's offer to serve as the first governor of Louisiana Territory, Monroe continued to serve as ambassador to Britain until 1807.\n\nIn 1806 he negotiated the Monroe–Pinkney Treaty with Great Britain. It would have extended the Jay Treaty of 1794 which had expired after ten years. Jefferson had fought the Jay Treaty intensely in 1794–95 because he felt it would allow the British to subvert American republicanism. The treaty had produced ten years of peace and highly lucrative trade for American merchants, but Jefferson was still opposed. When Monroe and the British signed the new treaty in December 1806, Jefferson refused to submit it to the Senate for ratification. Although the treaty called for ten more years of trade between the United States and the British Empire and gave American merchants guarantees that would have been good for business, Jefferson was unhappy that it did not end the hated British practice of impressment, and refused to give up the potential weapon of commercial warfare against Britain. The president made no attempt to obtain another treaty, and as a result, the two nations drifted from peace toward the War of 1812. Monroe was severely pained by the administration's repudiation of the treaty, and he fell out with Secretary of State James Madison.\n\n1808 election and the Quids\n\nOn his return to Virginia in 1807, Monroe received a warm reception, and many urged him to run in the 1808 presidential election. After Jefferson refused to submit the Monroe-Pinkney Treaty, Monroe had come to believe that Jefferson had snubbed the treaty out of the desire to avoid elevating Monroe above Madison in 1808. Out of deference to Jefferson, Monroe agreed to avoid actively campaigning for the presidency, but he did not rule out accepting a draft effort. The Democratic-Republican Party was increasingly factionalized, with \"Old Republicans\" or \"Quids\" denouncing the Jefferson administration for abandoning what they considered to be true republican principles. The Quids tried to enlist Monroe in their cause. The plan was to run Monroe for president in the 1808 election in cooperation with the Federalist Party, which had a strong base in New England. John Randolph of Roanoke led the Quid effort to stop Jefferson's choice of Madison. However, the regular Democratic-Republicans overcame the Quids in the nominating caucus, kept control of the party in Virginia, and protected Madison's base.David A. Carson, \"Quiddism and the Reluctant Candidacy of James Monroe in the Election of 1808,\" Mid-America 1988 70(2): 79–89 Monroe did not publicly criticize Jefferson or Madison during Madison's campaign against Federalist Charles Cotesworth Pinckney, but he also refused to support Madison.Cunningham, pp. 10–11 Madison defeated Pinckney by a large margin, carrying all but one state outside of New England. Monroe won 3,400 votes in Virginia, but received little support elsewhere. After the election Monroe quickly reconciled with Jefferson, but did not speak with Madison until 1810. Returning to private life, he devoted his attentions to farming at his Charlottesville estate.\n\nSecretary of State and Secretary of War\n\nMadison administration\n\nMonroe returned to the Virginia House of Burgesses and was elected to another term as governor in 1811, but served only four months. In April 1811, Madison appointed Monroe as Secretary of State in hopes of shoring up the support of the more radical factions of the Democratic-Republicans. Madison also hoped that Monroe, an experienced diplomat with whom he had once been close friends, would improve upon the performance of the previous Secretary of State, Robert Smith. Madison assured Monroe that their differences regarding the Monroe-Pinkney Treaty had been a misunderstanding, and the two resumed their friendship. On taking office, Monroe hoped to negotiate treaties with the British and French to end the attacks on American merchant ships. While the French agreed to reduce the attacks and release seized American ships, the British were less receptive to Monroe's demands. Monroe had long worked for peace with the British, but he came to favor war with Britain, joining with \"war hawks\" such as Speaker of the House Henry Clay. With the support of Monroe and Clay, Madison asked Congress to declare war upon the British, and Congress complied on June 18, 1812, thus beginning the War of 1812.\n\nThe war went very badly, and the Madison administration quickly sought peace, but were rejected by the British. The U.S. Navy did experience several successes after Monroe convinced Madison to allow the Navy's ships to set sail rather than remaining in port for the duration of the war. After the resignation of Secretary of War William Eustis, Madison asked Monroe to serve in dual roles as Secretary of State and Secretary of War, but opposition from the Senate limited Monroe to serving as acting Secretary of War until Brigadier General John Armstrong won Senate confirmation. Monroe and Armstrong clashed over war policy, and Armstrong blocked Monroe's hopes of being appointed to lead an invasion of Canada.Cunningham, p. 12 As the war dragged on, the British offered to begin negotiations in Ghent, and the United States sent a delegation led by John Quincy Adams to conduct negotiations. Monroe allowed Adams leeway in setting terms, so long as he ended the hostilities and preserved American neutrality.\n\nWhen the British burned the U.S. Capitol and the White House on August 24, 1814, Madison removed Armstrong as Secretary of War and turned to Monroe for help, appointing him Secretary of War on September 27. Monroe resigned as Secretary of State on October 1, 1814, but no successor was ever appointed and thus from October 1814 to February 28, 1815, Monroe effectively held both Cabinet posts. Now in command of the war effort, Monroe ordered General Andrew Jackson to defend against a likely attack on New Orleans by the British, and he asked the governors of nearby states to send their militias to reinforce Jackson. He also called on Congress to draft an army of 100,000 men, increase compensation to soldiers, and establish a new national bank to ensure adequate funding for the war effort. Months Monroe took office as Secretary of War, the war ended with the signing of the Treaty of Ghent. The treaty resulted in a return to the status quo ante bellum, and many outstanding issues between the United States and Britain remained. But Americans celebrated the end of the war as a great victory, partly due to the news of the treaty reaching the United States shortly after Jackson's victory in the Battle of New Orleans. With the end of the Napoleonic Wars in 1815, the British also ended the practice of impressment. After the war, Congress authorized the creation a national bank in the form of the Second Bank of the United States.\n\nElection of 1816\n\nMonroe decided to seek the presidency in the 1816 election, and his war-time leadership had established him as Madison's heir apparent. Monroe had strong support from many in the party, but his candidacy was challenged at the 1816 Democratic-Republican congressional nominating caucus. Secretary of the Treasury William H. Crawford had the support of numerous Southern and Western Congressmen, while Governor Daniel D. Tompkins was backed by several Congressmen from New York. Crawford appealed especially to many Democratic-Republicans who were wary of Madison and Monroe's support for the establishment of the Second Bank of the United States.Cunningham, pp. 15–16 Despite his substantial backing, Crawford decided to defer to Monroe on the belief that he could eventually run as Monroe's successor, and Monroe won his party's nomination. Tompkins won the party's vice presidential nomination. The moribund Federalists nominated Rufus King as their presidential nominee, but the party offered little opposition following the conclusion of a popular war that they had opposed. Monroe received 183 of the 217 electoral votes, winning every state but Massachusetts, Connecticut, and Delaware.\n\nPresidency\n\nDomestic affairs\n\nDemocratic-Republican Party dominance\n\nMonroe largely ignored old party lines in making federal appointments, which reduced political tensions and augmented the sense of \"oneness\" that pervaded the United States. He made two long national tours to build national trust. At Boston, a newspaper hailed his 1817 visit as the beginning of an \"Era of Good Feelings\". Frequent stops on his tours included ceremonies of welcome and expressions of good-will. The Federalist Party continued to fade during his administration; it maintained its vitality and organizational integrity in Delaware and a few localities, but lacked influence in national politics. Lacking serious opposition, the Democratic-Republican Party's Congressional caucus stopped meeting, and for practical purposes the party stopped operating.\n\nMissouri Compromise\n\nIn February 1819, a bill to enable the people of the Missouri Territory to draft a constitution and form a government preliminary to admission into the Union came before the House of Representatives. During these proceedings, Congressman James Tallmadge, Jr. of New York \"tossed a bombshell into the Era of Good Feelings\". by offering the Tallmadge Amendment, which prohibited the further introduction of slaves into Missouri and required that all future children of slave parents therein should be free at the age of twenty-five years. After three days of rancorous and sometimes bitter debate, the bill, with Tallmadge’s amendments, passed. The measure then went to the Senate, where both amendments were rejected.. A House–Senate conference committee was unable to resolve the disagreements on the bill, and so the entire measure failed. The ensuing debates pitted the northern \"restrictionists\" (antislavery legislators who wished to bar slavery from the Louisiana territories) against southern \"anti-restrictionists\" (proslavery legislators who rejected any interference by Congress inhibiting slavery expansion).\n\nDuring the following session, the House passed a similar bill with an amendment, introduced on January 26, 1820, by John W. Taylor of New York, allowing Missouri into the union as a slave state. The question had been complicated by the admission in December of Alabama, a slave state, making the number of slave and free states equal. In addition, there was a bill in passage through the House (January 3, 1820) to admit Maine as a free state.Dixon, 1899 pp. 58–59 The Senate decided to connect the two measures. It passed a bill for the admission of Maine with an amendment enabling the people of Missouri to form a state constitution. Before the bill was returned to the House, a second amendment was adopted on the motion of Jesse B. Thomas of Illinois, excluding slavery from the Louisiana Territory north of the parallel 36°30′ north (the southern boundary of Missouri), except within the limits of the proposed state of Missouri. The House then approved the bill as amended by the Senate. The legislation passed, which became known as the Missouri Compromise, won the support of Monroe and both houses of Congress, and compromise temporarily settled the issue of slavery in the territories.\n\nInternal improvements\n\nAs the United States continued to grow, many Americans advocated a system of internal improvements to help the country develop. Monroe agreed the young nation needed an improved infrastructure, including a transportation network in order to grow and thrive economically. However, he discerned no Constitutional authority to build, maintain, and operate a national transportation system. He therefore urged Congress to introduce a constitutional amendment granting it such power. Congress never acted on his suggestion because many legislators thought they already had the implied authority to enact such measures.\n\nIn 1822, a bill to authorize the collection of tolls on the Cumberland Road (which provided for yearly improvements to the road) was vetoed by the President. In an elaborate essay, Monroe set forth his views on the constitutional aspects of a policy of internal improvements. Congress might appropriate money, he admitted, but it could not undertake the construction of national works nor assume jurisdiction over them. For the moment, the drift toward a larger participation of the national government in internal improvements was stayed. Two years later, Congress authorized the President to institute surveys for such roads and canals as he believed to be needed for commerce and military defense. No one pleaded more eloquently for a larger conception of the functions of the national government than Henry Clay. He called the attention of his hearers to provisions made for coast surveys and lighthouses on the Atlantic seaboard and deplored the neglect of the interior of the country. Of the other presidential candidates, Jackson voted in the Senate for the general survey bill; and Adams left no doubt in the public mind that he did not reflect the narrow views of his section on this issue. Crawford felt the constitutional scruples which were everywhere being voiced in the South, and followed the old expedient of advocating a constitutional amendment to sanction national internal improvements..\n\nPanic of 1819\n\nTwo years into his presidency, Monroe faced an economic crisis known as the Panic of 1819, the first major depression to hit the country since the 1780s. The panic stemmed from declining imports and exports, and sagging agricultural prices as global markets readjusted to peacetime production and commerce in the aftermath of the War of 1812 and the Napoleonic Wars. The severity of the economic downturn in the U.S. was compounded by excessive speculation in public lands, fueled by the unrestrained issue of paper money from banks and business concerns. Monroe lacked the power to intervene directly in the economy, as banks were largely regulated by the states, and he could do little to stem the economic crisis. The resulting high unemployment and an increase in bankruptcies and foreclosures provoked popular resentment against banking and business enterprises. It also exacerbated tensions within the Democratic-Republican Party and aggravated sectional tensions as northerners pressed for higher tariffs while southerners abandoned their support of nationalistic economic programs.\n\nForeign affairs\n\nTreaties with Britain and Russia\n\nMonroe pursued warmer relations with Britain in the aftermath of the War of 1812. In 1817 the United States and Britain signed the Rush–Bagot Treaty, which regulated naval armaments on the Great Lakes and Lake Champlain and demilitarized the border between the U.S. and British North America. The Treaty of 1818, also with Great Britain, was concluded October 20, 1818, and fixed the present Canada–United States border from Minnesota to the Rocky Mountains at the 49th parallel. The accords also established a joint U.S.–British occupation of Oregon Country for the next ten years. Though they did not solve every outstanding issue between the U.S. and Britain, the treaties allowed for greater trade between the United States and the British Empire and helped avoid an expensive naval arms race in the Great Lakes. Late in Monroe's second term, the U.S. concluded a treaty with the Russian Empire. The Russo-American Treaty of 1824 set the southern limit of Russian sovereignty on the Pacific coast of North America at the 54°40′ parallel. (the present southern tip of the Alaska Panhandle).\n\nAcquisition of Florida\n\nSpain had long rejected repeated American efforts to purchase Florida. But by 1818, Spain was facing a troubling colonial situation in which the cession of Florida made sense. Spain had been exhausted by the Peninsular War in Europe and needed to rebuild its credibility and presence in its colonies. Revolutionaries in Central America and South America were beginning to demand independence. Spain was unwilling to invest further in Florida, encroached on by American settlers, and it worried about the border between New Spain and the United States. With only a minor military presence in Florida, Spain was not able to restrain the Seminole warriors who routinely crossed the border and raided American villages and farms, as well as protected southern slave refugees from slave owners and traders of the southern United States.\n\nIn response to these Seminole attacks, Monroe ordered a military expedition to cross into Spanish Florida and attack the Seminoles. The expedition, led by Andrew Jackson, defeated numerous Seminoles but also seized the Spanish territorial capital of Pensacola. With the capture of Pensacola, Jackson established de facto American control of the entire territory. While Monroe supported Jackson's actions, many in Congress harshly criticized what they saw as an undeclared war. With the support of Secretary of State Adams, Monroe defended Jackson against domestic and international criticism, and the United States began negotiations with Spain.\n\nConfronted by the revolt of all her American colonies, Spain could hardly resist the insistent pressure upon a province which she could neither govern nor defend. On February 22, 1819, Spain and the United States signed the Adams–Onís Treaty, which ceded the Floridas in return for the assumption by the United States of claims of American citizens against Spain to an amount not exceeding $5,000,000. The treaty also contained a definition of the boundary between Spanish and American possessions on the North American continent. Beginning at the mouth of the Sabine River the line ran along that river to the 32nd parallel, then due north to the Red River, which it followed to the 100th meridian, due north to the Arkansas River, and along that river to its source, then north to the 42nd parallel, which it followed to the Pacific Ocean. As the United States renounced all claims to the west and south of this boundary (Texas), so Spain surrendered any title she had to the Northwest (Oregon Country).\n\nMonroe Doctrine\n\nIn March 1822, Monroe officially recognized the countries of Argentina, Peru, Colombia, Chile, and Mexico, all of which had won independence from Spain. Secretary of State Adams, under Monroe's supervision, wrote the instructions for the ministers to these new countries. They declared that the policy of the United States was to uphold republican institutions and to seek treaties of commerce on a most-favored-nation basis. The United States would support inter-American congresses dedicated to the development of economic and political institutions fundamentally differing from those prevailing in Europe. Monroe took pride as the United States was the first nation to extend recognition and to set an example to the rest of the world for its support of the \"cause of liberty and humanity\".\n\nFor their part, the British also had a strong interest in ensuring the demise of Spanish colonialism, with all the trade restrictions mercantilism imposed. In October 1823, Richard Rush, the American minister in London, advised that Foreign Secretary George Canning was proposing that the U.S. and Britain issue a joint declaration to deter any other power from intervening in Central and South America. Adams, however, vigorously opposed cooperation with Great Britain, contending that a statement of bilateral nature could limit United States expansion in the future. He also argued that the British were not committed to recognizing the Latin American republics and must have had imperial motivations themselves.\n\nTwo months later, the bilateral statement proposed by the British became a unilateral declaration by the United States. While Monroe thought that Spain was unlikely to re-establish its colonial empire on its own, he feared that France or the Holy Alliance might seek to establish control over the former Spanish possessions. On December 2, 1823, in his annual message to Congress, Monroe articulated what became known as the Monroe Doctrine. He first reiterated the traditional U.S. policy of neutrality with regard to European wars and conflicts. He then declared that the United States would not accept the recolonization of any country by its former European master, though he also avowed non-interference with existing European colonies in the Americas. Finally, he stated that European countries should no longer consider the Western Hemisphere open to new colonization, a jab aimed primarily at Russia, which was attempting to expand its colony on the northern Pacific Coast.\n\nElection of 1820\n\nThe collapse of the Federalists left Monroe with no organized opposition at the end of his first term, and he ran for reelection unopposed, the only president other than Washington to do so. A single elector from New Hampshire, William Plumer, cast a vote for John Quincy Adams, preventing a unanimous vote in the Electoral College. He did so because he thought Monroe was incompetent. Later in the century, the story arose that he had cast his dissenting vote so that only George Washington would have the honor of unanimous election. Plumer never mentioned Washington in his speech explaining his vote to the other New Hampshire electors.\n\nAdministration and Cabinet\n\nMonroe made balanced Cabinet choices, naming a southerner, John C. Calhoun, as Secretary of War, and a northerner, John Quincy Adams, as Secretary of State. Both proved outstanding, as Adams was a master diplomat. and Calhoun completely reorganized the War Department to overcome the serious deficiencies that had hobbled it during the War of 1812.. Monroe decided on political grounds not to offer Henry Clay the State Department, and Clay turned down the War Department and remained Speaker of the House, so Monroe lacked an outstanding westerner in his cabinet. Monroe was the only president in the 19th century to complete two full terms with the same Vice President.\n\nJudicial appointments\n\nMonroe appointed one justice to the Supreme Court of the United States, Smith Thompson. He appointed 21 other federal judges, all to United States district courts.\n\nStates admitted to the Union\n\nFive new states were admitted to the Union while Monroe was in office:\n* MississippiDecember 10, 1817\n* IllinoisDecember 3, 1818\n* AlabamaDecember 14, 1819\n* MaineMarch 15, 1820\n* MissouriAugust 10, 1821\n\nPost-presidency\n\nWhen his presidency ended on March 4, 1825, James Monroe resided at Monroe Hill, what is now included in the grounds of the University of Virginia. He served on the university's Board of Visitors under Jefferson and under the second rector James Madison, both former presidents, almost until his death. He and his wife lived in Oak Hill, Virginia, until Elizabeth's death on September 23, 1830. In August 1825, the Monroes had received the Marquis de Lafayette and President John Quincy Adams as guests there.\n\nMonroe incurred many unliquidated debts during his years of public life. He sold off his Highland Plantation (now called Ash Lawn-Highland). It is now owned by his alma mater, the College of William and Mary, which has opened it to the public as a historic site. Throughout his life, he was financially insolvent, and this was exacerbated by his wife's poor health.\n\nMonroe was elected as a delegate to the Virginia Constitutional Convention of 1829-1830. He was one of four delegates elected from the senatorial district made up of his home district of Loudoun and Fairfax County.Pulliam 1901, p. 68, 80 In October 1829, he was elected by the Convention to serve as the presiding officer, until his failing health required him to withdraw on December 8, after which Philip Pendleton Barbour of Orange County was elected presiding officer.\n\nUpon Elizabeth's death in 1830, Monroe moved to New York City to live with his daughter Maria Hester Monroe Gouverneur, who had married Samuel L. Gouverneur. Monroe's health began to slowly fail by the end of the 1820s. On July 4, 1831, Monroe died from heart failure and tuberculosis, thus becoming the third president to have died on Independence Day. His death came 55 years after the United States Declaration of Independence was proclaimed and 5 years after the death of John Adams and Thomas Jefferson. Monroe was originally buried in New York at the Gouverneur family's vault in the New York City Marble Cemetery. Twenty-seven years later, in 1858, his body was re-interred at the President's Circle in Hollywood Cemetery. The James Monroe Tomb is a U.S. National Historic Landmark.\n\nReligious beliefs\n\n\"When it comes to Monroe's thoughts on religion,\" historian Bliss Isely notes, \"less is known than that of any other President.\" No letters survive in which he discussed his religious beliefs. Nor did his friends, family or associates comment on his beliefs. Letters that do survive, such as ones written after the death of his son, contain no discussion of religion.\n\nMonroe was raised in a family that belonged to the Church of England when it was the state church in Virginia before the Revolution. As an adult, he attended Episcopal churches. Some historians see \"deistic tendencies\" in his few references to an impersonal God. Unlike Jefferson, Monroe was rarely attacked as an atheist or infidel. In 1832 James Renwick Willson, a Reformed Presbyterian minister in Albany, New York, criticized Monroe for having \"lived and died like a second-rate Athenian philosopher.\"\n\nSlavery\n\nMonroe owned dozens of slaves. According to William Seale, he took several slaves with him to Washington to serve at the White House from 1817 to 1825. This was typical of other slaveholders, as Congress did not provide for domestic staff of the presidents at that time.Kranish, Michael. [http://www.boston.com/news/nation/articles/2008/12/28/at_capitol_slaverys_story_turns_full_circle/?page=2 \"At Capitol, slavery's story turns full circle\"] , The Boston GLobe, Boston, December 28, 2008.\n\nAs president of Virginia's constitutional convention in the fall of 1829, Monroe reiterated his belief that slavery was a blight which, even as a British colony, Virginia had attempted to eradicate. \"What was the origin of our slave population?\" he rhetorically asked. \"The evil commenced when we were in our Colonial state, but acts were passed by our Colonial Legislature, prohibiting the importation, of more slaves, into the Colony. These were rejected by the Crown.\" To the dismay of states' rights proponents, he was willing to accept the federal government's financial assistance to emancipate and transport freed slaves to other countries. At the convention, Monroe made his final public statement on slavery, proposing that Virginia emancipate and deport its bondsmen with \"the aid of the Union.\"Ammon, 1990, pp 563–66\n\nMonroe was part of the American Colonization Society, which supported the establishment of colonies outside of the United States for free African-Americans. The society helped send several thousand freed slaves to the new colony of Liberia in Africa from 1820 to 1840. Slave owners like Monroe and Andrew Jackson wanted to prevent free blacks from encouraging slaves in the South to rebel. With about $100,000 in federal grant money, the organization also bought land for the freedmen in what is today Liberia.Powell & Steinberg . [https://books.google.com/books?idligvL-cLFIEC&pg\nPA40 \"The nonprofit sector: a research handbook\"] , Yale, 2006, p. 40. The capital of Liberia was named Monrovia after President Monroe.Ammon, 1990, pp 522–23\n\nWhen Monroe was Governor of Virginia in 1800, hundreds of slaves from Virginia planned to kidnap him, take Richmond, and negotiate for their freedom. Due to a storm on August 30, they were unable to attack. What became known as Gabriel's slave conspiracy became public knowledge.Rodriguez, Junius. [https://books.google.com/books?id4X44KbDBl9gC&pg\nPR21 \"Slavery in the United States: A Social, Political, and Historical Encyclopedia\"] , Santa Barbara, 2007, p. 428. In response, Governor Monroe called out the militia; the slave patrols soon captured some slaves accused of involvement. Sidbury says some trials had a few measures to prevent abuses, such as an appointed attorney, but they were \"hardly 'fair'\". Slave codes prevented slaves from being treated like whites, and they were given quick trials without a jury.Sidbury, James. [https://books.google.com/books?id0WrqU3Va-BMC&pg\nPA127 Ploughshares into Swords: Race, Rebellion, and Identity in Gabriel's Virginia, 1730–1810] , Cambridge, 1997, pp. 127–28. Monroe influenced the Executive Council to pardon and sell some slaves instead of hanging them.Morris, Thomas. [https://books.google.com/books?idVmPWCKh0hZAC&pg\nPA272 \"Southern Slavery and the Law, 1619–1860\"] , 1996, p. 272. Historians say the Virginia courts executed between 26 and 35 slaves. None of the executed slaves had killed any whites because the uprising had been foiled before it began.\n\nLegacy and memory\n\n* Since its 1824 renaming in his honor, the capital city of the West African country of Liberia has been named Monrovia. It is the only non-American capital city named after a U.S. President.\n* On December 12, 1954, the United States Postal Service released a 5¢ Liberty Issue postage stamp honoring Monroe.\n* Monroe is the namesake of seventeen Monroe counties.\n* The cities of Monroe, Maine incorporated in 1818, Monroe, Michigan and Monroe, Georgia incorporated in 1821, and Monroe, Connecticut incorporated in 1823, are named for him. The Township of Monroe, in central New Jersey, founded in 1838, bears his name as well.\n* Fort Monroe is named for him.\n* Monroe was the last U.S. President to wear a powdered wig tied in a queue, a tricorne hat and knee-breeches according to the style of the late 18th century. That earned him the nickname \"The Last Cocked Hat\".\n* Monroe is the last president not photographed.\n*Monroe received the honorary degree of LL.D. from Dartmouth College (1817), Harvard University (1817), and Princeton University (1822).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "James Monroe" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15978" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "James Monroe (; April 28, 1758 – July 4, 1831) was an American statesman and Founding Father who served as the fifth President of the United States from 1817 to 1825. Monroe was the last president of the Virginia dynasty, and his presidency ushered in what is known as the Era of Good Feelings. Born in Westmoreland County, Virginia, Monroe was of the planter class and fought in the American Revolutionary War. He was wounded in the Battle of Trenton with a musket ball to his shoulder. After studying law under Thomas Jefferson from 1780 to 1783, he served as a delegate in the Continental Congress.\n\nAs an anti-federalist delegate to the Virginia convention that considered ratification of the United States Constitution, Monroe opposed ratification, claiming it gave too much power to the central government. He took an active part in the new government, and in 1790 he was elected to the Senate of the first United States Congress, where he joined the Democratic-Republicans. He gained experience as an executive as the Governor of Virginia and rose to national prominence as a diplomat in France, when he helped negotiate the Louisiana Purchase in 1803. During the War of 1812, Monroe served in critical roles as Secretary of State and the Secretary of War under President James Madison..\n\nFacing little opposition from the fractured Federalist Party, Monroe was easily elected president in 1816, winning over 80 percent of the electoral vote and becoming the last president during the First Party System era of American politics. As president, he sought to ease partisan tensions, embarking on a tour of the country that was well received. With the ratification of the Treaty of 1818, under the successful diplomacy of his Secretary of State John Quincy Adams, the United States extended its reach from the Atlantic to the Pacific, by acquiring harbor and fishing rights in the Pacific Northwest; the United States and Britain jointly occupied the Oregon Country. In addition to the acquisition of Florida, the 1819 Adams–Onís Treaty secured the westernmost section of the southern border of the United States along the 42nd Parallel to the Pacific Ocean and represented America's first determined attempt at creating an \"American global empire\". As nationalism surged, partisan acrimony subsided. This swell of national purpose and political harmony subsided some when the Panic of 1819 struck and a dispute over the admission of Missouri embroiled the country in 1820. Nonetheless, Monroe won near-unanimous reelection.\n\nMonroe supported the founding of colonies in Africa for freed slaves that would eventually form the nation of Liberia, whose capital, Monrovia, is named in his honor. In 1823, he announced the United States' opposition to any European intervention in the recently independent countries of the Americas with the Monroe Doctrine, which became a landmark in American foreign policy. His presidency concluded the first period of American presidential history before the beginning of Jacksonian democracy and the Second Party System era. Following his retirement in 1825, Monroe was plagued by financial difficulties. He died in New York City on July 4, 1831. He has been generally ranked as an above-average president.\n\nEarly life\n\nJames Monroe was born on April 28, 1758, in his parents' house located in a wooded area of Westmoreland County, Virginia. The marked site is one mile from the unincorporated community known today as Monroe Hall, Virginia. The James Monroe Family Home Site was listed on the National Register of Historic Places in 1979. His father Spence Monroe (1727–1774) was a moderately prosperous planter who also practiced carpentry. His mother Elizabeth Jones (1730–1772) married Spence Monroe in 1752 and they had five children: Elizabeth, James, Spence, Andrew, and Joseph Jones..\n\nHis paternal great-grandfather Patrick Andrew Monroe emigrated to America from Scotland in the mid-17th century. In 1650 he patented a large tract of land in Washington Parish, Westmoreland County, Virginia. Monroe's mother was the daughter of a wealthy Welsh immigrant who had settled in nearby King George County, Virginia. Also among James Monroe's ancestors were French Huguenot immigrants, who came to Virginia in 1700.\n\nAt age eleven, Monroe was enrolled in the lone school in the county. Monroe attended this school for only eleven weeks a year, as his labor was needed on the farm. During this time, Monroe formed a lifelong friendship with an older classmate, John Marshall. Monroe's mother died in 1772, and his father died two years later. Though he inherited property from both of his parents, the sixteen-year-old Monroe was forced to withdraw from school to support his younger brothers. His childless maternal uncle, Joseph Jones, became a surrogate father to Monroe and his siblings. A member of the Virginia House of Burgesses, Jones took Monroe to the capital of Williamsburg, Virginia and enrolled him in the College of William and Mary. Jones also introduced Monroe to important Virginians such as Thomas Jefferson, Patrick Henry, and George Washington. In 1774, opposition to the British government grew in the Thirteen Colonies in reaction to the \"Intolerable Acts,\" and Virginia sent a delegation to the First Continental Congress. Monroe became involved in the opposition to Lord Dunmore, the colonial governor of Virginia, and he took part in the storming of the Governor's Palace.\n\nRevolutionary War service\n\nIn early 1776, about a year and a half after his enrollment, Monroe dropped out of college and joined the 3rd Virginia Regiment in the Continental Army.. As the fledgling army valued literacy in its officers, Monroe was commissioned with the rank of lieutenant, serving under Captain William Washington. After months of training, Monroe and seven hundred Virginia infantrymen were called north to serve in the New York and New Jersey campaign. Shortly after the Virginians arrived, Washington led the army in a retreat from New York City into New Jersey and then across the Delaware River into Pennsylvania. In December, Monroe took part in a surprise attack on a Hessian encampment. Though the attack was successful, Monroe suffered a severed artery in the battle and nearly died. In the aftermath of the battle, George Washington cited Monroe and William Washington for their bravery, and promoted Monroe to the rank of captain. After his wounds healed, Monroe returned to Virginia to recruit his own company of soldiers. Monroe's participation in the battle was memorialized in John Trumbull's painting, The Capture of the Hessians at Trenton, December 26, 1776, as well as Emanuel Leutze's Washington Crossing the Delaware.\n\nLacking the wealth to induce soldiers to join his company, Monroe instead asked his uncle to return him to the front. Monroe was assigned to the staff of General William Alexander, Lord Stirling. During this time, Monroe formed a close friendship with the Marquis de Lafayette, a French volunteer who encouraged Monroe to view the war as part of a wider struggle against religious and political tyranny. Monroe served in the Philadelphia campaign and spent the winter of 1777–1778 at the encampment of Valley Forge, sharing a log hut with Marshall. After serving in the Battle of Monmouth, the destitute Monroe resigned his commission in December 1778 and joined his uncle in Philadelphia. After the British captured Savannah, the Virginia legislature decided to raise four regiments, and Monroe returned to his native state, hoping to receive his own command. With letters of recommendation from Washington, Stirling, and Alexander Hamilton, Monroe received a commission as a lieutenant colonel and was expected to lead one of the regiments, but recruitment again proved to be an issue. On the advice of Jones, Monroe returned to Williamsburg to study law, becoming a protege of Virginia Governor Thomas Jefferson.\n\nWith the British increasingly focusing their operations in the Southern colonies, the Virginians moved the capital to the more defensible city of Richmond, and Monroe accompanied Jefferson to the new capital. As Governor of Virginia, Jefferson held command over the state's militia, and he appointed Monroe to the rank of colonel, and Monroe established a messenger network to coordinate with the Continental Army and other state militias. Still unable to raise an army due to a lack of interested recruits, Monroe traveled to his home in King George County, and thus was not present for the British raid of Richmond. As both the Continental Army and the Virginia militia had an abundance of officers, Monroe did not serve during the Yorktown campaign, and, much to his frustration, Monroe did not take part in the Siege of Yorktown. Although Andrew Jackson served as a courier in a militia unit at age thirteen, Monroe is regarded as the last U.S. President who was a Revolutionary War veteran, since he served as an officer of the Continental Army and took part in combat.\nMonroe resumed studying law under Jefferson and continued until 1783. He was not particularly interested in legal theory or practice, but chose to take it up because he thought it offered \"the most immediate rewards\" and could ease his path to wealth, social standing, and political influence. Monroe was admitted to the Virginia bar and practiced in Fredericksburg, Virginia.\n\nMarriage and family\n\nOn February 16, 1786 Monroe married Elizabeth Kortright (1768–1830) in New York City. She was the daughter of Hannah Aspinwall Kortright and Laurence Kortright, a wealthy trader and former British officer. He met her while serving in the Continental Congress.\n\nAfter a brief honeymoon on Long Island, New York, the Monroes returned to New York City to live with her father until Congress adjourned. They then moved to Virginia, settling in Charlottesville, Virginia in 1789. They bought an estate in Charlottesville known as Ash Lawn–Highland, settling on the property in 1799. The Monroes had the following children:\n* Eliza Kortright Monroe Hay (1786–1840): Eliza was born in Fredericksburg, Virginia, in 1786, and was educated in Paris at the school of Madame Campan during the time her father was the United States Ambassador to France. In 1808 she married George Hay, a prominent Virginia attorney who had served as prosecutor in the trial of Aaron Burr and later U.S. District Judge.\n* James Spence Monroe (1799–1800): a son who died 16 months after birth.\n* Maria Hester Monroe (1804–1850): married her cousin Samuel L. Gouverneur on March 8, 1820, in the first wedding of a president's child in the White House. Excerpt from \n\nPlantations and slavery\n\nMonroe sold his small inherited Virginia plantation in 1783 to enter law and politics. He later fulfilled his youthful dream of becoming the owner of a large plantation and wielding great political power, but his plantation was never profitable. Although he owned much more land and many more slaves, and speculated in property, he was rarely on-site to oversee the operations. Overseers treated the slaves harshly to force production, but the plantations barely broke even. Monroe incurred debts by his lavish and expensive lifestyle and often sold property (including slaves) to pay them off. Overseers moved or separated slave families from different Monroe plantations in accordance with production and maintenance needs of each satellite plantation. One of Monroe's slaves named Daniel often ran away from his plantation in Albermarle County, to visit other slaves or separated family members. Monroe commonly referred to Daniel as a \"scoundrel\" and described the \"worthlessness\" of Daniel as a runaway slave. The practice of moving and separating slave families was common treatment of slaves in the South.\n\nEarly political career\n\nVirginia politics\n\nMonroe was elected to the Virginia House of Delegates in 1782. After serving on Virginia's Executive Council, he was elected to the Congress of the Confederation in November 1783 and served in Annapolis until Congress convened in Trenton, New Jersey in June 1784. He had served a total of three years when he finally retired from that office by the rule of rotation. By that time, the government was meeting in the temporary capital of New York City. While serving in Congress, Monroe became an advocate for western expansion, and played a key role in the writing and passage of the Northwest Ordinance. The ordinance created the Northwest Territory, providing for federal administration of the territories West of Pennsylvania and North of the Ohio River. During this period, Jefferson continued to serve as a mentor to Monroe, and, at Jefferson's prompting, he befriended another prominent Virginian, James Madison.\n\nMonroe resigned from Congress in 1786 to focus on his legal career, and he became an attorney for the state. In 1787, Monroe won election to another term in the Virginia House of Delegates. Though he had become outspoken in his desire to reform the Articles, he was unable to attend the Philadelphia Convention due to his work obligations. In 1788, Monroe became a delegate to the Virginia Ratifying Convention. In Virginia, the struggle over the ratification of the proposed Constitution involved more than a simple clash between federalists and anti-federalists. Virginians held a full spectrum of opinions about the merits of the proposed change in national government. Washington and Madison were leading supporters; Patrick Henry and George Mason were leading opponents. Those who held the middle ground in the ideological struggle became the central figures. Led by Monroe and Edmund Pendleton, these \"federalists who are for amendments,\" criticized the absence of a bill of rights and worried about surrendering taxation powers to the central government. After Madison reversed himself and promised to pass a bill of rights, the Virginia convention ratified the constitution by a narrow vote, though Monroe himself voted against it. Virginia was tenth state to ratify the Constitution, and all thirteen states eventually ratified the document.\n\nSenator\n\nHenry and other anti-federalists hoped to elect a Congress that would amend the Constitution to take away most of the powers it had been granted (\"commit suicide on [its] own authority,\" as Madison put it). Henry recruited Monroe to run against Madison for a House seat in the First Congress, and he had the Virginia legislature draw a congressional district designed to elect Monroe. During the campaign, Madison and Monroe often traveled together, and the election did not destroy their friendship. Madison prevailed over Monroe, taking 1,308 votes compared to Monroe's 972 votes. Following his defeat, Monroe returned to his legal duties and developed his farm in Charlottesville. After the death of Senator William Grayson in 1790, Monroe was elected to serve the remainder of Grayson's term.\n\nDuring the presidency of George Washington, U.S. politics became increasingly polarized between the supporters of Secretary of State Jefferson and\nthe Federalists, led by Secretary of the Treasury Alexander Hamilton. Monroe stood firmly with Jefferson in opposing Hamilton's strong central government and strong executive. The Democratic-Republican Party coalesced around Jefferson and Madison, and Monroe became one of the fledgling party's leader in the Senate. He also helped organize opposition to John Adams in the 1792\nelection, though Adams defeated George Clinton to win re-election.Cunningham, pp. 3–5 As the 1790s progressed, the French Revolutionary Wars came to dominate U.S. foreign policy, with British and French raids both threatening U.S. trade with Europe. Like most other Jeffersonians, Monroe supported the French Revolution, but Hamilton's followers tended to sympathize more with Britain. In 1794, hoping to find a way to avoid war with both countries, Washington appointed Monroe as his ambassador to France. At the same time, he appointed the anglophile Federalist John Jay as his Ambassador to the United Kingdom.\n\nAmbassador to France\n\nAfter arriving in France, Monroe addressed the National Convention, receiving a standing applause for his speech celebrating republicanism. He experienced several early diplomatic successes, including the protection of U.S. trade from French attacks. He also used his influence to win the release of Thomas Paine and Adrienne de La Fayette, the wife of the Marquis de Lafayette. Months after Monroe arrived in France, the U.S. and Great Britain concluded the Jay Treaty, outraging both the French and Monroe—not fully informed about the treaty prior to its publication. Despite the undesirable effects of the Jay Treaty on Franco-American relations, Monroe won French support for U.S. navigational rights on the Mississippi River—the mouth of which was controlled by Spain—and in 1795 the U.S. and Spain signed Pinckney's Treaty. The treaty granted the U.S. limited rights to use the port of New Orleans.\n\nFrustrated by Monroe's inability to convince the French of the benign nature of the Jay Treaty, Washington recalled Monroe in November 1796. He returned to the United States, where he wrote a 400-page defense of his tenure as ambassador, criticizing Washington's desire to pursue closer relations with Britain at the expense of relations with France. Returning to his home in Charlottesville, he resumed his dual careers as a farmer and lawyer. Jefferson and Madison urged Monroe to run for Congress, but Monroe chose to focus on state politics instead.Cunningham, pp. 6–7\n\nGovernor of Virginia and diplomat\n\nGovernor of Virginia\n\nOn a party-line vote, the Virginia legislature elected Monroe as Governor of Virginia in 1799. He would serve as governor until 1802.Cunningham, p. 7 The constitution of Virginia endowed the governor with very few powers aside from commanding the militia when the Assembly called it into action. But Monroe used his stature to convince legislators to enhance state involvement in transportation and education and to increase training for the militia. Monroe also began to give State of the Commonwealth addresses to the legislature, in which he highlighted areas in which he believed the legislature should act. Monroe also led an effort to create the state's first penitentiary, and imprisonment replaced other, often harsher, punishments. In 1800, Monroe called out the state militia to suppress Gabriel's Rebellion, a slave rebellion originating on a plantation six miles from the capital of Richmond. Gabriel and 27 other enslaved people who participated were all hanged for treason.\n\nMonroe thought that foreign and Federalist elements had created the Quasi War of 1798–1800, and he strongly supported Thomas Jefferson's candidacy for president in 1800. Federalists were likewise suspicious of Monroe, some viewing him at best as a French dupe and at worst a traitor. With the power to appoint election officials in Virginia, Monroe exercised his influence to help Jefferson win Virginia's presidential electors.Cunningham, pp. 7–8 He also considered using the Virginia militia to force the outcome in favor of Jefferson.. Jefferson won the 1800 election, and he appointed Madison as his Secretary of State. As a member of Jefferson's party and the leader of the largest state in the country, Monroe emerged as one of Jefferson's two most likely successors, alongside Madison.\n\nLouisiana Purchase and ambassador to Britain\n\nShortly after the end of Monroe's gubernatorial tenure, President Jefferson sent Monroe back to France to assist Ambassador Robert R. Livingston in negotiating the Louisiana Purchase. In the 1800 Treaty of San Ildefonso, France had acquired the territory of Louisiana from Spain; at the time, many in the U.S. believed that France had also acquired West Florida in the same treaty. The American delegation originally sought to acquire West Florida and the city of New Orleans, which controlled the trade of the Mississippi River. Determined to acquire New Orleans even if it meant war with France, Jefferson also authorized Monroe to form an alliance with the British if the French refused to sell the city.\n\nMeeting with François Barbé-Marbois, the French foreign minister, Monroe and Livingston agreed to purchase the entire territory of Louisiana for $15 million; the purchase became known as the Louisiana Purchase. In agreeing to the purchase, Monroe violated his instructions, which had only allowed $9 million for the purchase of New Orleans and West Florida. The French did not acknowledge that West Florida remained in Spanish possession, and the United States would claim that France had sold West Florida to the United States for several years to come. Though he had not ordered the purchase of the entire territory, Jefferson strongly supported Monroe's actions, which ensured that the United States would continue to expand to the West. Overcoming doubts about whether the Constitution authorized the purchase of foreign territory, Jefferson won congressional approval for the Louisiana Purchase, and the acquisition doubled the size of the United States. Monroe would travel to Spain in 1805 to try to win the cession of West Florida, but, with the support of France, Spain refused to consider relinquishing the territory.\n\nAfter the resignation of Rufus King, Monroe was appointed as the ambassador to Great Britain in 1803. The greatest issue of contention between the United States and Britain was that of the impressment of U.S. sailors. Many U.S. merchant ships employed British seamen who had deserted or dodged conscription, and the British frequently impressed sailors on U.S. ships in hopes of quelling their manpower issues. However, many of the sailors they impressed had never been British subjects, and Monroe was tasked with persuading the British to stop their practice of impressment. Monroe found little success in this endeavor, partly due to Jefferson's alienation of the British minister to the United States, Anthony Merry. Rejecting Jefferson's offer to serve as the first governor of Louisiana Territory, Monroe continued to serve as ambassador to Britain until 1807.\n\nIn 1806 he negotiated the Monroe–Pinkney Treaty with Great Britain. It would have extended the Jay Treaty of 1794 which had expired after ten years. Jefferson had fought the Jay Treaty intensely in 1794–95 because he felt it would allow the British to subvert American republicanism. The treaty had produced ten years of peace and highly lucrative trade for American merchants, but Jefferson was still opposed. When Monroe and the British signed the new treaty in December 1806, Jefferson refused to submit it to the Senate for ratification. Although the treaty called for ten more years of trade between the United States and the British Empire and gave American merchants guarantees that would have been good for business, Jefferson was unhappy that it did not end the hated British practice of impressment, and refused to give up the potential weapon of commercial warfare against Britain. The president made no attempt to obtain another treaty, and as a result, the two nations drifted from peace toward the War of 1812. Monroe was severely pained by the administration's repudiation of the treaty, and he fell out with Secretary of State James Madison.\n\n1808 election and the Quids\n\nOn his return to Virginia in 1807, Monroe received a warm reception, and many urged him to run in the 1808 presidential election. After Jefferson refused to submit the Monroe-Pinkney Treaty, Monroe had come to believe that Jefferson had snubbed the treaty out of the desire to avoid elevating Monroe above Madison in 1808. Out of deference to Jefferson, Monroe agreed to avoid actively campaigning for the presidency, but he did not rule out accepting a draft effort. The Democratic-Republican Party was increasingly factionalized, with \"Old Republicans\" or \"Quids\" denouncing the Jefferson administration for abandoning what they considered to be true republican principles. The Quids tried to enlist Monroe in their cause. The plan was to run Monroe for president in the 1808 election in cooperation with the Federalist Party, which had a strong base in New England. John Randolph of Roanoke led the Quid effort to stop Jefferson's choice of Madison. However, the regular Democratic-Republicans overcame the Quids in the nominating caucus, kept control of the party in Virginia, and protected Madison's base.David A. Carson, \"Quiddism and the Reluctant Candidacy of James Monroe in the Election of 1808,\" Mid-America 1988 70(2): 79–89 Monroe did not publicly criticize Jefferson or Madison during Madison's campaign against Federalist Charles Cotesworth Pinckney, but he also refused to support Madison.Cunningham, pp. 10–11 Madison defeated Pinckney by a large margin, carrying all but one state outside of New England. Monroe won 3,400 votes in Virginia, but received little support elsewhere. After the election Monroe quickly reconciled with Jefferson, but did not speak with Madison until 1810. Returning to private life, he devoted his attentions to farming at his Charlottesville estate.\n\nSecretary of State and Secretary of War\n\nMadison administration\n\nMonroe returned to the Virginia House of Burgesses and was elected to another term as governor in 1811, but served only four months. In April 1811, Madison appointed Monroe as Secretary of State in hopes of shoring up the support of the more radical factions of the Democratic-Republicans. Madison also hoped that Monroe, an experienced diplomat with whom he had once been close friends, would improve upon the performance of the previous Secretary of State, Robert Smith. Madison assured Monroe that their differences regarding the Monroe-Pinkney Treaty had been a misunderstanding, and the two resumed their friendship. On taking office, Monroe hoped to negotiate treaties with the British and French to end the attacks on American merchant ships. While the French agreed to reduce the attacks and release seized American ships, the British were less receptive to Monroe's demands. Monroe had long worked for peace with the British, but he came to favor war with Britain, joining with \"war hawks\" such as Speaker of the House Henry Clay. With the support of Monroe and Clay, Madison asked Congress to declare war upon the British, and Congress complied on June 18, 1812, thus beginning the War of 1812.\n\nThe war went very badly, and the Madison administration quickly sought peace, but were rejected by the British. The U.S. Navy did experience several successes after Monroe convinced Madison to allow the Navy's ships to set sail rather than remaining in port for the duration of the war. After the resignation of Secretary of War William Eustis, Madison asked Monroe to serve in dual roles as Secretary of State and Secretary of War, but opposition from the Senate limited Monroe to serving as acting Secretary of War until Brigadier General John Armstrong won Senate confirmation. Monroe and Armstrong clashed over war policy, and Armstrong blocked Monroe's hopes of being appointed to lead an invasion of Canada.Cunningham, p. 12 As the war dragged on, the British offered to begin negotiations in Ghent, and the United States sent a delegation led by John Quincy Adams to conduct negotiations. Monroe allowed Adams leeway in setting terms, so long as he ended the hostilities and preserved American neutrality.\n\nWhen the British burned the U.S. Capitol and the White House on August 24, 1814, Madison removed Armstrong as Secretary of War and turned to Monroe for help, appointing him Secretary of War on September 27. Monroe resigned as Secretary of State on October 1, 1814, but no successor was ever appointed and thus from October 1814 to February 28, 1815, Monroe effectively held both Cabinet posts. Now in command of the war effort, Monroe ordered General Andrew Jackson to defend against a likely attack on New Orleans by the British, and he asked the governors of nearby states to send their militias to reinforce Jackson. He also called on Congress to draft an army of 100,000 men, increase compensation to soldiers, and establish a new national bank to ensure adequate funding for the war effort. Months Monroe took office as Secretary of War, the war ended with the signing of the Treaty of Ghent. The treaty resulted in a return to the status quo ante bellum, and many outstanding issues between the United States and Britain remained. But Americans celebrated the end of the war as a great victory, partly due to the news of the treaty reaching the United States shortly after Jackson's victory in the Battle of New Orleans. With the end of the Napoleonic Wars in 1815, the British also ended the practice of impressment. After the war, Congress authorized the creation a national bank in the form of the Second Bank of the United States.\n\nElection of 1816\n\nMonroe decided to seek the presidency in the 1816 election, and his war-time leadership had established him as Madison's heir apparent. Monroe had strong support from many in the party, but his candidacy was challenged at the 1816 Democratic-Republican congressional nominating caucus. Secretary of the Treasury William H. Crawford had the support of numerous Southern and Western Congressmen, while Governor Daniel D. Tompkins was backed by several Congressmen from New York. Crawford appealed especially to many Democratic-Republicans who were wary of Madison and Monroe's support for the establishment of the Second Bank of the United States.Cunningham, pp. 15–16 Despite his substantial backing, Crawford decided to defer to Monroe on the belief that he could eventually run as Monroe's successor, and Monroe won his party's nomination. Tompkins won the party's vice presidential nomination. The moribund Federalists nominated Rufus King as their presidential nominee, but the party offered little opposition following the conclusion of a popular war that they had opposed. Monroe received 183 of the 217 electoral votes, winning every state but Massachusetts, Connecticut, and Delaware.\n\nPresidency\n\nDomestic affairs\n\nDemocratic-Republican Party dominance\n\nMonroe largely ignored old party lines in making federal appointments, which reduced political tensions and augmented the sense of \"oneness\" that pervaded the United States. He made two long national tours to build national trust. At Boston, a newspaper hailed his 1817 visit as the beginning of an \"Era of Good Feelings\". Frequent stops on his tours included ceremonies of welcome and expressions of good-will. The Federalist Party continued to fade during his administration; it maintained its vitality and organizational integrity in Delaware and a few localities, but lacked influence in national politics. Lacking serious opposition, the Democratic-Republican Party's Congressional caucus stopped meeting, and for practical purposes the party stopped operating.\n\nMissouri Compromise\n\nIn February 1819, a bill to enable the people of the Missouri Territory to draft a constitution and form a government preliminary to admission into the Union came before the House of Representatives. During these proceedings, Congressman James Tallmadge, Jr. of New York \"tossed a bombshell into the Era of Good Feelings\". by offering the Tallmadge Amendment, which prohibited the further introduction of slaves into Missouri and required that all future children of slave parents therein should be free at the age of twenty-five years. After three days of rancorous and sometimes bitter debate, the bill, with Tallmadge’s amendments, passed. The measure then went to the Senate, where both amendments were rejected.. A House–Senate conference committee was unable to resolve the disagreements on the bill, and so the entire measure failed. The ensuing debates pitted the northern \"restrictionists\" (antislavery legislators who wished to bar slavery from the Louisiana territories) against southern \"anti-restrictionists\" (proslavery legislators who rejected any interference by Congress inhibiting slavery expansion).\n\nDuring the following session, the House passed a similar bill with an amendment, introduced on January 26, 1820, by John W. Taylor of New York, allowing Missouri into the union as a slave state. The question had been complicated by the admission in December of Alabama, a slave state, making the number of slave and free states equal. In addition, there was a bill in passage through the House (January 3, 1820) to admit Maine as a free state.Dixon, 1899 pp. 58–59 The Senate decided to connect the two measures. It passed a bill for the admission of Maine with an amendment enabling the people of Missouri to form a state constitution. Before the bill was returned to the House, a second amendment was adopted on the motion of Jesse B. Thomas of Illinois, excluding slavery from the Louisiana Territory north of the parallel 36°30′ north (the southern boundary of Missouri), except within the limits of the proposed state of Missouri. The House then approved the bill as amended by the Senate. The legislation passed, which became known as the Missouri Compromise, won the support of Monroe and both houses of Congress, and compromise temporarily settled the issue of slavery in the territories.\n\nInternal improvements\n\nAs the United States continued to grow, many Americans advocated a system of internal improvements to help the country develop. Monroe agreed the young nation needed an improved infrastructure, including a transportation network in order to grow and thrive economically. However, he discerned no Constitutional authority to build, maintain, and operate a national transportation system. He therefore urged Congress to introduce a constitutional amendment granting it such power. Congress never acted on his suggestion because many legislators thought they already had the implied authority to enact such measures.\n\nIn 1822, a bill to authorize the collection of tolls on the Cumberland Road (which provided for yearly improvements to the road) was vetoed by the President. In an elaborate essay, Monroe set forth his views on the constitutional aspects of a policy of internal improvements. Congress might appropriate money, he admitted, but it could not undertake the construction of national works nor assume jurisdiction over them. For the moment, the drift toward a larger participation of the national government in internal improvements was stayed. Two years later, Congress authorized the President to institute surveys for such roads and canals as he believed to be needed for commerce and military defense. No one pleaded more eloquently for a larger conception of the functions of the national government than Henry Clay. He called the attention of his hearers to provisions made for coast surveys and lighthouses on the Atlantic seaboard and deplored the neglect of the interior of the country. Of the other presidential candidates, Jackson voted in the Senate for the general survey bill; and Adams left no doubt in the public mind that he did not reflect the narrow views of his section on this issue. Crawford felt the constitutional scruples which were everywhere being voiced in the South, and followed the old expedient of advocating a constitutional amendment to sanction national internal improvements..\n\nPanic of 1819\n\nTwo years into his presidency, Monroe faced an economic crisis known as the Panic of 1819, the first major depression to hit the country since the 1780s. The panic stemmed from declining imports and exports, and sagging agricultural prices as global markets readjusted to peacetime production and commerce in the aftermath of the War of 1812 and the Napoleonic Wars. The severity of the economic downturn in the U.S. was compounded by excessive speculation in public lands, fueled by the unrestrained issue of paper money from banks and business concerns. Monroe lacked the power to intervene directly in the economy, as banks were largely regulated by the states, and he could do little to stem the economic crisis. The resulting high unemployment and an increase in bankruptcies and foreclosures provoked popular resentment against banking and business enterprises. It also exacerbated tensions within the Democratic-Republican Party and aggravated sectional tensions as northerners pressed for higher tariffs while southerners abandoned their support of nationalistic economic programs.\n\nForeign affairs\n\nTreaties with Britain and Russia\n\nMonroe pursued warmer relations with Britain in the aftermath of the War of 1812. In 1817 the United States and Britain signed the Rush–Bagot Treaty, which regulated naval armaments on the Great Lakes and Lake Champlain and demilitarized the border between the U.S. and British North America. The Treaty of 1818, also with Great Britain, was concluded October 20, 1818, and fixed the present Canada–United States border from Minnesota to the Rocky Mountains at the 49th parallel. The accords also established a joint U.S.–British occupation of Oregon Country for the next ten years. Though they did not solve every outstanding issue between the U.S. and Britain, the treaties allowed for greater trade between the United States and the British Empire and helped avoid an expensive naval arms race in the Great Lakes. Late in Monroe's second term, the U.S. concluded a treaty with the Russian Empire. The Russo-American Treaty of 1824 set the southern limit of Russian sovereignty on the Pacific coast of North America at the 54°40′ parallel. (the present southern tip of the Alaska Panhandle).\n\nAcquisition of Florida\n\nSpain had long rejected repeated American efforts to purchase Florida. But by 1818, Spain was facing a troubling colonial situation in which the cession of Florida made sense. Spain had been exhausted by the Peninsular War in Europe and needed to rebuild its credibility and presence in its colonies. Revolutionaries in Central America and South America were beginning to demand independence. Spain was unwilling to invest further in Florida, encroached on by American settlers, and it worried about the border between New Spain and the United States. With only a minor military presence in Florida, Spain was not able to restrain the Seminole warriors who routinely crossed the border and raided American villages and farms, as well as protected southern slave refugees from slave owners and traders of the southern United States.\n\nIn response to these Seminole attacks, Monroe ordered a military expedition to cross into Spanish Florida and attack the Seminoles. The expedition, led by Andrew Jackson, defeated numerous Seminoles but also seized the Spanish territorial capital of Pensacola. With the capture of Pensacola, Jackson established de facto American control of the entire territory. While Monroe supported Jackson's actions, many in Congress harshly criticized what they saw as an undeclared war. With the support of Secretary of State Adams, Monroe defended Jackson against domestic and international criticism, and the United States began negotiations with Spain.\n\nConfronted by the revolt of all her American colonies, Spain could hardly resist the insistent pressure upon a province which she could neither govern nor defend. On February 22, 1819, Spain and the United States signed the Adams–Onís Treaty, which ceded the Floridas in return for the assumption by the United States of claims of American citizens against Spain to an amount not exceeding $5,000,000. The treaty also contained a definition of the boundary between Spanish and American possessions on the North American continent. Beginning at the mouth of the Sabine River the line ran along that river to the 32nd parallel, then due north to the Red River, which it followed to the 100th meridian, due north to the Arkansas River, and along that river to its source, then north to the 42nd parallel, which it followed to the Pacific Ocean. As the United States renounced all claims to the west and south of this boundary (Texas), so Spain surrendered any title she had to the Northwest (Oregon Country).\n\nMonroe Doctrine\n\nIn March 1822, Monroe officially recognized the countries of Argentina, Peru, Colombia, Chile, and Mexico, all of which had won independence from Spain. Secretary of State Adams, under Monroe's supervision, wrote the instructions for the ministers to these new countries. They declared that the policy of the United States was to uphold republican institutions and to seek treaties of commerce on a most-favored-nation basis. The United States would support inter-American congresses dedicated to the development of economic and political institutions fundamentally differing from those prevailing in Europe. Monroe took pride as the United States was the first nation to extend recognition and to set an example to the rest of the world for its support of the \"cause of liberty and humanity\".\n\nFor their part, the British also had a strong interest in ensuring the demise of Spanish colonialism, with all the trade restrictions mercantilism imposed. In October 1823, Richard Rush, the American minister in London, advised that Foreign Secretary George Canning was proposing that the U.S. and Britain issue a joint declaration to deter any other power from intervening in Central and South America. Adams, however, vigorously opposed cooperation with Great Britain, contending that a statement of bilateral nature could limit United States expansion in the future. He also argued that the British were not committed to recognizing the Latin American republics and must have had imperial motivations themselves.\n\nTwo months later, the bilateral statement proposed by the British became a unilateral declaration by the United States. While Monroe thought that Spain was unlikely to re-establish its colonial empire on its own, he feared that France or the Holy Alliance might seek to establish control over the former Spanish possessions. On December 2, 1823, in his annual message to Congress, Monroe articulated what became known as the Monroe Doctrine. He first reiterated the traditional U.S. policy of neutrality with regard to European wars and conflicts. He then declared that the United States would not accept the recolonization of any country by its former European master, though he also avowed non-interference with existing European colonies in the Americas. Finally, he stated that European countries should no longer consider the Western Hemisphere open to new colonization, a jab aimed primarily at Russia, which was attempting to expand its colony on the northern Pacific Coast.\n\nElection of 1820\n\nThe collapse of the Federalists left Monroe with no organized opposition at the end of his first term, and he ran for reelection unopposed, the only president other than Washington to do so. A single elector from New Hampshire, William Plumer, cast a vote for John Quincy Adams, preventing a unanimous vote in the Electoral College. He did so because he thought Monroe was incompetent. Later in the century, the story arose that he had cast his dissenting vote so that only George Washington would have the honor of unanimous election. Plumer never mentioned Washington in his speech explaining his vote to the other New Hampshire electors.\n\nAdministration and Cabinet\n\nMonroe made balanced Cabinet choices, naming a southerner, John C. Calhoun, as Secretary of War, and a northerner, John Quincy Adams, as Secretary of State. Both proved outstanding, as Adams was a master diplomat. and Calhoun completely reorganized the War Department to overcome the serious deficiencies that had hobbled it during the War of 1812.. Monroe decided on political grounds not to offer Henry Clay the State Department, and Clay turned down the War Department and remained Speaker of the House, so Monroe lacked an outstanding westerner in his cabinet. Monroe was the only president in the 19th century to complete two full terms with the same Vice President.\n\nJudicial appointments\n\nMonroe appointed one justice to the Supreme Court of the United States, Smith Thompson. He appointed 21 other federal judges, all to United States district courts.\n\nStates admitted to the Union\n\nFive new states were admitted to the Union while Monroe was in office:\n* MississippiDecember 10, 1817\n* IllinoisDecember 3, 1818\n* AlabamaDecember 14, 1819\n* MaineMarch 15, 1820\n* MissouriAugust 10, 1821\n\nPost-presidency\n\nWhen his presidency ended on March 4, 1825, James Monroe resided at Monroe Hill, what is now included in the grounds of the University of Virginia. He served on the university's Board of Visitors under Jefferson and under the second rector James Madison, both former presidents, almost until his death. He and his wife lived in Oak Hill, Virginia, until Elizabeth's death on September 23, 1830. In August 1825, the Monroes had received the Marquis de Lafayette and President John Quincy Adams as guests there.\n\nMonroe incurred many unliquidated debts during his years of public life. He sold off his Highland Plantation (now called Ash Lawn-Highland). It is now owned by his alma mater, the College of William and Mary, which has opened it to the public as a historic site. Throughout his life, he was financially insolvent, and this was exacerbated by his wife's poor health.\n\nMonroe was elected as a delegate to the Virginia Constitutional Convention of 1829-1830. He was one of four delegates elected from the senatorial district made up of his home district of Loudoun and Fairfax County.Pulliam 1901, p. 68, 80 In October 1829, he was elected by the Convention to serve as the presiding officer, until his failing health required him to withdraw on December 8, after which Philip Pendleton Barbour of Orange County was elected presiding officer.\n\nUpon Elizabeth's death in 1830, Monroe moved to New York City to live with his daughter Maria Hester Monroe Gouverneur, who had married Samuel L. Gouverneur. Monroe's health began to slowly fail by the end of the 1820s. On July 4, 1831, Monroe died from heart failure and tuberculosis, thus becoming the third president to have died on Independence Day. His death came 55 years after the United States Declaration of Independence was proclaimed and 5 years after the death of John Adams and Thomas Jefferson. Monroe was originally buried in New York at the Gouverneur family's vault in the New York City Marble Cemetery. Twenty-seven years later, in 1858, his body was re-interred at the President's Circle in Hollywood Cemetery. The James Monroe Tomb is a U.S. National Historic Landmark.\n\nReligious beliefs\n\n\"When it comes to Monroe's thoughts on religion,\" historian Bliss Isely notes, \"less is known than that of any other President.\" No letters survive in which he discussed his religious beliefs. Nor did his friends, family or associates comment on his beliefs. Letters that do survive, such as ones written after the death of his son, contain no discussion of religion.\n\nMonroe was raised in a family that belonged to the Church of England when it was the state church in Virginia before the Revolution. As an adult, he attended Episcopal churches. Some historians see \"deistic tendencies\" in his few references to an impersonal God. Unlike Jefferson, Monroe was rarely attacked as an atheist or infidel. In 1832 James Renwick Willson, a Reformed Presbyterian minister in Albany, New York, criticized Monroe for having \"lived and died like a second-rate Athenian philosopher.\"\n\nSlavery\n\nMonroe owned dozens of slaves. According to William Seale, he took several slaves with him to Washington to serve at the White House from 1817 to 1825. This was typical of other slaveholders, as Congress did not provide for domestic staff of the presidents at that time.Kranish, Michael. [http://www.boston.com/news/nation/articles/2008/12/28/at_capitol_slaverys_story_turns_full_circle/?page=2 \"At Capitol, slavery's story turns full circle\"] , The Boston GLobe, Boston, December 28, 2008.\n\nAs president of Virginia's constitutional convention in the fall of 1829, Monroe reiterated his belief that slavery was a blight which, even as a British colony, Virginia had attempted to eradicate. \"What was the origin of our slave population?\" he rhetorically asked. \"The evil commenced when we were in our Colonial state, but acts were passed by our Colonial Legislature, prohibiting the importation, of more slaves, into the Colony. These were rejected by the Crown.\" To the dismay of states' rights proponents, he was willing to accept the federal government's financial assistance to emancipate and transport freed slaves to other countries. At the convention, Monroe made his final public statement on slavery, proposing that Virginia emancipate and deport its bondsmen with \"the aid of the Union.\"Ammon, 1990, pp 563–66\n\nMonroe was part of the American Colonization Society, which supported the establishment of colonies outside of the United States for free African-Americans. The society helped send several thousand freed slaves to the new colony of Liberia in Africa from 1820 to 1840. Slave owners like Monroe and Andrew Jackson wanted to prevent free blacks from encouraging slaves in the South to rebel. With about $100,000 in federal grant money, the organization also bought land for the freedmen in what is today Liberia.Powell & Steinberg . [https://books.google.com/books?idligvL-cLFIEC&pg\nPA40 \"The nonprofit sector: a research handbook\"] , Yale, 2006, p. 40. The capital of Liberia was named Monrovia after President Monroe.Ammon, 1990, pp 522–23\n\nWhen Monroe was Governor of Virginia in 1800, hundreds of slaves from Virginia planned to kidnap him, take Richmond, and negotiate for their freedom. Due to a storm on August 30, they were unable to attack. What became known as Gabriel's slave conspiracy became public knowledge.Rodriguez, Junius. [https://books.google.com/books?id4X44KbDBl9gC&pg\nPR21 \"Slavery in the United States: A Social, Political, and Historical Encyclopedia\"] , Santa Barbara, 2007, p. 428. In response, Governor Monroe called out the militia; the slave patrols soon captured some slaves accused of involvement. Sidbury says some trials had a few measures to prevent abuses, such as an appointed attorney, but they were \"hardly 'fair'\". Slave codes prevented slaves from being treated like whites, and they were given quick trials without a jury.Sidbury, James. [https://books.google.com/books?id0WrqU3Va-BMC&pg\nPA127 Ploughshares into Swords: Race, Rebellion, and Identity in Gabriel's Virginia, 1730–1810] , Cambridge, 1997, pp. 127–28. Monroe influenced the Executive Council to pardon and sell some slaves instead of hanging them.Morris, Thomas. [https://books.google.com/books?idVmPWCKh0hZAC&pg\nPA272 \"Southern Slavery and the Law, 1619–1860\"] , 1996, p. 272. Historians say the Virginia courts executed between 26 and 35 slaves. None of the executed slaves had killed any whites because the uprising had been foiled before it began.\n\nLegacy and memory\n\n* Since its 1824 renaming in his honor, the capital city of the West African country of Liberia has been named Monrovia. It is the only non-American capital city named after a U.S. President.\n* On December 12, 1954, the United States Postal Service released a 5¢ Liberty Issue postage stamp honoring Monroe.\n* Monroe is the namesake of seventeen Monroe counties.\n* The cities of Monroe, Maine incorporated in 1818, Monroe, Michigan and Monroe, Georgia incorporated in 1821, and Monroe, Connecticut incorporated in 1823, are named for him. The Township of Monroe, in central New Jersey, founded in 1838, bears his name as well.\n* Fort Monroe is named for him.\n* Monroe was the last U.S. President to wear a powdered wig tied in a queue, a tricorne hat and knee-breeches according to the style of the late 18th century. That earned him the nickname \"The Last Cocked Hat\".\n* Monroe is the last president not photographed.\n*Monroe received the honorary degree of LL.D. from Dartmouth College (1817), Harvard University (1817), and Princeton University (1822). James Monroe. http://en.wikipedia.org/?curid=15978."
  }
}
