{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17310",
  "eid" : "2b466490-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778581849,
  "textBody" : "Koenigsegg Automotive AB is a Swedish manufacturer of high-performance sports cars, based in Ängelholm, Skåne County, Sweden.\n\nCompany\n\nThe company was founded in 1994 in Sweden by Christian von Koenigsegg, with the intention of producing a \"world-class\" supercar. Many years of development and prototyping led to the company's first street-legal production car delivery in 2002.\n\nIn 2006 Koenigsegg began production of the CCX, which uses an engine created in-house especially for that vehicle. The CCX is street-legal in most countries, including the United States.\n\nIn March 2009 the Koenigsegg CCXR was listed by Forbes as one of \"the world's most beautiful cars\".\n\nIn December 2010 the Koenigsegg Agera won the BBC Top Gear Hypercar of the Year Award.\n\nApart from developing, manufacturing and selling the Koenigsegg line of supercars, Koenigsegg is also involved in \"green technology\" development programmes beginning with the CCXR (\"Flower Power\") flex-fuel supercar and continuing through the present with the Agera R. Koenigsegg is also active in development programs of plug-in electric cars' systems and next-generation reciprocating engine technologies. Koenigsegg also is working on a camless piston engine for the Regera.\n\nKoenigsegg develops and produces most of the main systems, subsystems and components needed for their cars in-house instead of relying on subcontractors.  Koenigsegg had 97 employees, with an engineering department of 25 engineers, led by the founder.\n\nHistory\n\nPrototypes and production\n\nThe initial design of the Koenigsegg CC was drawn by von Koenigsegg. Industrial designer David Crafoord realised the sketches as a 1:5 scale model. This model was later scaled up in order to create the base plug for the initial Koenigsegg prototype that was finished in 1996. During the next years the prototype went through extensive testing and several new prototypes were built.\n\nFactory history\n\nChristian von Koenigsegg got the idea to build his own car after watching the Norwegian stop-motion animated movie Pinchcliffe Grand Prix in his youth. He took his first steps in the world of business in his early 20s running a trading company called Alpraaz in Stockholm, Sweden. Alpraaz exported food from Europe to the developing world. The success of this venture gave von Koenigsegg the necessary financial standing to launch his chosen career as a car manufacturer.\n\nInitially, Koenigsegg Automotive was based in Olofström. In 1997 the company needed larger facilities and moved to a farm, just outside Ängelholm. On 22 February 2003, one of the production facilities caught fire and was badly damaged. From 2003 on the two large fighter-jet hangars and an office building were converted into a car factory. Since it is located on the still-active Ängelholm airport, clients can arrive by private jet nearby. Koenigsegg controls and uses the former military runway for shakedown runs of production cars and high-speed testing.\n\nThe Koenigsegg badge was designed in 1994 by Jacob Låftman, based on the heraldic coat of arms of the Koenigsegg family. The shield has been the family's coat of arms since the 12th century when a family member was knighted by the Germany-based Holy Roman Empire.\n\nAttempted purchase of Saab\n\nOn 12 June 2009, the media reported that Koenigsegg Group, consisting of Koenigsegg Automotive AB, Christian von Koenigsegg, Bård Eker and a group of investors led by Mark Bishop had signed a letter of intent with Saab to take over the brand from General Motors. General Motors confirmed on June 16 that they had chosen Koenigsegg Group as the buyer of Saab Automobile. The deal, set to close 30 September 2009, included  in financing from the European Investment Bank, guaranteed by the Swedish government. By comparison, in 2008 Koenigsegg with its staff of 45 produced 18 cars at an average price of ; Saab employed 3,400 workers and made more than 93,000 cars.\n\nGeneral Motors announced on 18 August that the deal had been signed, although certain financing details remained to be completed. On 9 September 2009, Koenigsegg announced that BAIC was going to join as a minority stakeholder in Koenigsegg.\n\nIn November 2009 Koenigsegg decided not to finalise the purchase of Saab and, therefore, left the negotiations. The timing uncertainty of finalisation of the take over was the reason Koenigsegg stated for leaving the deal.\n\nModels\n\nA Koenigsegg CC prototype was first publicised in 1996, while the full carbon fibre production prototype was finally unveiled at the 2000 Paris Motor Show. The first customer took delivery of a red CC8S in 2002 at the Geneva Auto Show and four more cars were built that year. Koenigsegg was established in Asia later that year with a premiere at the Seoul Auto Show. In 2004 the new CCR was unveiled at the Geneva Auto Show; only 14 were made.\n\nIn 2006 Koenigsegg introduced the CCX, a new model, that was created in order to meet worldwide regulations for road use. This meant the cars had to go through extensive development in order to meet the latest and most stringent safety and emission standards that the world's authorities demanded; Koenigsegg had to, for example, develop their own engines and other related technologies. Furthermore, Koenigsegg is the only supercar and low-volume manufacturer to pass the new European pedestrian impact tests. Just after Koenigsegg passed this test, the requirement was deemed too complicated for compliance by low-volume manufacturers, so it is now unnecessary to meet these regulations if the production volume of a given model is less than 10,000 cars annually.\n\nIn 2007 Koenigsegg premiered the CCXR, a biofuel/flex-fuel version of the CCX. The car features a modified engine, fuel system, and engine management system that enables the car to run on regular petrol or ethanol, and in any mixture between these two fuels. Ethanol has a higher octane rating compared to regular fuel and has an internal cooling effect on the combustion chamber, which allows increased performance.\n\nIn 2009 Koenigsegg released information about a special edition car called the Trevita, of which three were planned to be made but only two were finished due to technical problems. The Trevita, which translates into English as \"three whites\", has a body made entirely of Koenigsegg's proprietary material consisting of diamond-coated carbon fibre. The Trevita is based on the CCXR, and therefore produces  when running on biofuel.\n\nIn 2010 Koenigsegg released information at the 2010 Geneva Motor Show on a new model called the Agera, which translates into English as \"take action/act\". The Agera features a Koenigsegg developed 5.0-litre variable geometry twin-turbocharger V8 engine capable of , coupled to a newly developed 7-speed gearbox. The Agera's design follows a clear lineage from the previous Koenigsegg supercars, but adds many special new features, such as a wider front track, new styling and aerodynamic features, and a new interior; including a new lighting technique they call \"Ghost Light\", which consists of microscopic holes to hide the interior lighting until it is turned on, which then shines through what appears to be solid aluminium. The Agera has been in production since late 2010.\n\nAt the 2015 Geneva Motor Show, Koenigsegg presented a new car named the Regera, which translates into English as to \"reign\" or \"rule\". The Regera uses the Koenigsegg Direct Drive (KDD) transmission. Below 30 mph, motive power is by two electric motors on the rear wheels and the internal combustion engine (ICE) is disconnected. Above 30 mph, the ICE is connected by a fixed ratio transmission with no gearbox, torque vectoring by the previously mentioned electric motors and boosted by a third electric motor attached to the driveshaft.\n\nKoenigsegg initially based its custom engine builds on a V8 engine block from Ford Racing. These engines powered the initial run of CC monikered cars. The block for the 4800cc V8 in the CCX (Competition Coupe Ten, to celebrate ten years of the company) was cast for Koenigsegg by Grainger & Worrall of the UK who also casts the block for the Agera R's 5.0-litre engine\n\nList of models \n\n* Koenigsegg CC (1996) 1 prototype\n* Koenigsegg CC8S (2002–2004) 6 units (2 right hand drive) – 0–100 km/h (0–62 mph) under 3.5 sec. Top speed 387 km/h (240 mph)\n* Koenigsegg CCR (2004–2006) 14 units – 0–100 km/h (0-62 mph) 3.2 sec.  Top speed 390 km/h (242 mph)\n* Koenigsegg CCGT (2007) 1 unit created for the sole purpose of competing in the FIA GT1\n* Koenigsegg CCX (2006–2010) 29 units – 0–100 km/h (0-62 mph) 3.2 sec. Top speed 390 km/h (245 mph)\n* Koenigsegg CCXR (2007–10) 8 units – 0–100 km/h (0-62 mph) 3.1 sec.  Top speed 400 km/h (250 mph)\n* Koenigsegg CCXR Special Edition (2007) 2 units\n* Koenigsegg CCX Edition (2008) 2 units\n* Koenigsegg CCXR Edition (2008) 4 units\n* Koenigsegg Quant (2009) Solar Concept\n* Koenigsegg Trevita (2009–10) 2 units – 0–100 km/h (0-62 mph) 2.9 sec Top speed 410 km/h (254 mph)\n* Koenigsegg Agera (2010–2013) 7 units – 0–100 km/h (0-62 mph) 3.0 sec. Top speed 424 km/h (260 mph)\n* Koenigsegg Agera R (2011–2014) 18 units – 0–100 km/h (62 mph) 2.8 sec, 0–200 km/h (124 mph) 7.8 sec.  Top speed 430 km/h (267 mph) \n* Koenigsegg Agera S (2012–2014) 5 units – (2013–present) 0–100 km/h (62 mph) 2.9 sec, 200 km/h (124 mph) 7.9 sec. Top speed 430 km/h (267 mph)\n* Koenigsegg One:1 (2014) 6 units + 1 prototype – 0–400 km/h (248 mph) 20 sec.  Top speed 440 km/h (274 mph)\n* Koenigsegg Agera RS (2015–present) 25 units planned, 3 Agera RSR for Japanese market included. Top speed )\n* Koenigsegg Regera (2015–present) 80 units planned – 0–100 km/h (0–62 mph)  2.5 sec. Top speed 397 km/h (246 mph)\n* Koenigsegg Agera Final (2016–2017) 3 units\n\nRecords\n\nOn 28 February 2005, at 12:08 h local time, in Nardò, Italy, the CCR broke the Guinness World Record for the fastest production car in the world, having attained  on the Nardò Ring (a circular track of  circumference), breaking the record previously held by the McLaren F1.\nIt held the record until September 2005 when the Bugatti Veyron broke the record again at , proven by Car and Driver and Top Gear. Both the record set by Bugatti and the one set by McLaren were set on Volkswagen's own test-track Ehra-Lessien, which features a  straight.\n\nWhen it was introduced, the Koenigsegg CCXR held the power-to-weight ratio record for production cars, with a power-to-weight ratio of /hp.  Later the Koenigsegg One:1 held this record, with a power-to-weight ratio of /hp.\n\nIn 2008 the German magazine sport auto conducted a 0 - test for production cars, with the CCX winning the event in a total time of .\n\nIn September 2011, the Agera R broke the Guinness World Record for 0–300 km/h with a time of just 14.53 seconds and a 0-300-0 km/h time of 21.19 seconds. Koenigsegg improved this record with the One:1 on 8 June 2015. It proved 0–300 km/h in 11.92 seconds and 0-300-0 km/h in 17.95 seconds (3.24 sec improvement on the 2011, Koenigsegg Agera R record), it also proved 0–200 mph (0–322 km/h) in 14.328 seconds and 0-200-0 mph in 20.71 seconds.\n\nOn 1 October 2017, an Agera RS set an unofficial record for  with a time of 36.44 seconds. The record was set at the Vandel Airfield in Denmark and broke the record of 42 seconds. The Agera RS broke the previous record set by the Bugatti Chiron a few weeks earlier.\n\nOn 4 November 2017, an Agera RS set a new record for the world's fastest production car with an average speed of . The record breaking run was done on a closed 11 mi section of Nevada State Route 160 in Pahrump, Nevada, United States. On the same day they also beat their own 0–400–0 km/h record they set a few weeks prior (33.29 seconds compared to the old record of 36.44 seconds).\n\nAwards\n\n* Top Gear - Award 2010 - The Agera becomes BBCs Top Gear Hypercar of the Year\n* Red Dot - Award for excellent Design\n* National Swedish Design Prize - Utmärkt Svensk Form\n* Entrepreneur of the Year Nomination - Företagarna Sweden\n* Powercar - Superexotic import of the year 2007 and 2008 - Germany\n* Nürburgring - speed record\n* Top Gear - speed record\n* Nardo - speed record\n* sport auto - slalom record\n* sport auto - Hockenheimring speed record\n* sport auto - 0–200 km/h record\n* sport auto - 0–300 km/h record\n* sport auto - 0-300-0 km/h record",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Koenigsegg" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17310" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Koenigsegg Automotive AB is a Swedish manufacturer of high-performance sports cars, based in Ängelholm, Skåne County, Sweden.\n\nCompany\n\nThe company was founded in 1994 in Sweden by Christian von Koenigsegg, with the intention of producing a \"world-class\" supercar. Many years of development and prototyping led to the company's first street-legal production car delivery in 2002.\n\nIn 2006 Koenigsegg began production of the CCX, which uses an engine created in-house especially for that vehicle. The CCX is street-legal in most countries, including the United States.\n\nIn March 2009 the Koenigsegg CCXR was listed by Forbes as one of \"the world's most beautiful cars\".\n\nIn December 2010 the Koenigsegg Agera won the BBC Top Gear Hypercar of the Year Award.\n\nApart from developing, manufacturing and selling the Koenigsegg line of supercars, Koenigsegg is also involved in \"green technology\" development programmes beginning with the CCXR (\"Flower Power\") flex-fuel supercar and continuing through the present with the Agera R. Koenigsegg is also active in development programs of plug-in electric cars' systems and next-generation reciprocating engine technologies. Koenigsegg also is working on a camless piston engine for the Regera.\n\nKoenigsegg develops and produces most of the main systems, subsystems and components needed for their cars in-house instead of relying on subcontractors.  Koenigsegg had 97 employees, with an engineering department of 25 engineers, led by the founder.\n\nHistory\n\nPrototypes and production\n\nThe initial design of the Koenigsegg CC was drawn by von Koenigsegg. Industrial designer David Crafoord realised the sketches as a 1:5 scale model. This model was later scaled up in order to create the base plug for the initial Koenigsegg prototype that was finished in 1996. During the next years the prototype went through extensive testing and several new prototypes were built.\n\nFactory history\n\nChristian von Koenigsegg got the idea to build his own car after watching the Norwegian stop-motion animated movie Pinchcliffe Grand Prix in his youth. He took his first steps in the world of business in his early 20s running a trading company called Alpraaz in Stockholm, Sweden. Alpraaz exported food from Europe to the developing world. The success of this venture gave von Koenigsegg the necessary financial standing to launch his chosen career as a car manufacturer.\n\nInitially, Koenigsegg Automotive was based in Olofström. In 1997 the company needed larger facilities and moved to a farm, just outside Ängelholm. On 22 February 2003, one of the production facilities caught fire and was badly damaged. From 2003 on the two large fighter-jet hangars and an office building were converted into a car factory. Since it is located on the still-active Ängelholm airport, clients can arrive by private jet nearby. Koenigsegg controls and uses the former military runway for shakedown runs of production cars and high-speed testing.\n\nThe Koenigsegg badge was designed in 1994 by Jacob Låftman, based on the heraldic coat of arms of the Koenigsegg family. The shield has been the family's coat of arms since the 12th century when a family member was knighted by the Germany-based Holy Roman Empire.\n\nAttempted purchase of Saab\n\nOn 12 June 2009, the media reported that Koenigsegg Group, consisting of Koenigsegg Automotive AB, Christian von Koenigsegg, Bård Eker and a group of investors led by Mark Bishop had signed a letter of intent with Saab to take over the brand from General Motors. General Motors confirmed on June 16 that they had chosen Koenigsegg Group as the buyer of Saab Automobile. The deal, set to close 30 September 2009, included  in financing from the European Investment Bank, guaranteed by the Swedish government. By comparison, in 2008 Koenigsegg with its staff of 45 produced 18 cars at an average price of ; Saab employed 3,400 workers and made more than 93,000 cars.\n\nGeneral Motors announced on 18 August that the deal had been signed, although certain financing details remained to be completed. On 9 September 2009, Koenigsegg announced that BAIC was going to join as a minority stakeholder in Koenigsegg.\n\nIn November 2009 Koenigsegg decided not to finalise the purchase of Saab and, therefore, left the negotiations. The timing uncertainty of finalisation of the take over was the reason Koenigsegg stated for leaving the deal.\n\nModels\n\nA Koenigsegg CC prototype was first publicised in 1996, while the full carbon fibre production prototype was finally unveiled at the 2000 Paris Motor Show. The first customer took delivery of a red CC8S in 2002 at the Geneva Auto Show and four more cars were built that year. Koenigsegg was established in Asia later that year with a premiere at the Seoul Auto Show. In 2004 the new CCR was unveiled at the Geneva Auto Show; only 14 were made.\n\nIn 2006 Koenigsegg introduced the CCX, a new model, that was created in order to meet worldwide regulations for road use. This meant the cars had to go through extensive development in order to meet the latest and most stringent safety and emission standards that the world's authorities demanded; Koenigsegg had to, for example, develop their own engines and other related technologies. Furthermore, Koenigsegg is the only supercar and low-volume manufacturer to pass the new European pedestrian impact tests. Just after Koenigsegg passed this test, the requirement was deemed too complicated for compliance by low-volume manufacturers, so it is now unnecessary to meet these regulations if the production volume of a given model is less than 10,000 cars annually.\n\nIn 2007 Koenigsegg premiered the CCXR, a biofuel/flex-fuel version of the CCX. The car features a modified engine, fuel system, and engine management system that enables the car to run on regular petrol or ethanol, and in any mixture between these two fuels. Ethanol has a higher octane rating compared to regular fuel and has an internal cooling effect on the combustion chamber, which allows increased performance.\n\nIn 2009 Koenigsegg released information about a special edition car called the Trevita, of which three were planned to be made but only two were finished due to technical problems. The Trevita, which translates into English as \"three whites\", has a body made entirely of Koenigsegg's proprietary material consisting of diamond-coated carbon fibre. The Trevita is based on the CCXR, and therefore produces  when running on biofuel.\n\nIn 2010 Koenigsegg released information at the 2010 Geneva Motor Show on a new model called the Agera, which translates into English as \"take action/act\". The Agera features a Koenigsegg developed 5.0-litre variable geometry twin-turbocharger V8 engine capable of , coupled to a newly developed 7-speed gearbox. The Agera's design follows a clear lineage from the previous Koenigsegg supercars, but adds many special new features, such as a wider front track, new styling and aerodynamic features, and a new interior; including a new lighting technique they call \"Ghost Light\", which consists of microscopic holes to hide the interior lighting until it is turned on, which then shines through what appears to be solid aluminium. The Agera has been in production since late 2010.\n\nAt the 2015 Geneva Motor Show, Koenigsegg presented a new car named the Regera, which translates into English as to \"reign\" or \"rule\". The Regera uses the Koenigsegg Direct Drive (KDD) transmission. Below 30 mph, motive power is by two electric motors on the rear wheels and the internal combustion engine (ICE) is disconnected. Above 30 mph, the ICE is connected by a fixed ratio transmission with no gearbox, torque vectoring by the previously mentioned electric motors and boosted by a third electric motor attached to the driveshaft.\n\nKoenigsegg initially based its custom engine builds on a V8 engine block from Ford Racing. These engines powered the initial run of CC monikered cars. The block for the 4800cc V8 in the CCX (Competition Coupe Ten, to celebrate ten years of the company) was cast for Koenigsegg by Grainger & Worrall of the UK who also casts the block for the Agera R's 5.0-litre engine\n\nList of models \n\n* Koenigsegg CC (1996) 1 prototype\n* Koenigsegg CC8S (2002–2004) 6 units (2 right hand drive) – 0–100 km/h (0–62 mph) under 3.5 sec. Top speed 387 km/h (240 mph)\n* Koenigsegg CCR (2004–2006) 14 units – 0–100 km/h (0-62 mph) 3.2 sec.  Top speed 390 km/h (242 mph)\n* Koenigsegg CCGT (2007) 1 unit created for the sole purpose of competing in the FIA GT1\n* Koenigsegg CCX (2006–2010) 29 units – 0–100 km/h (0-62 mph) 3.2 sec. Top speed 390 km/h (245 mph)\n* Koenigsegg CCXR (2007–10) 8 units – 0–100 km/h (0-62 mph) 3.1 sec.  Top speed 400 km/h (250 mph)\n* Koenigsegg CCXR Special Edition (2007) 2 units\n* Koenigsegg CCX Edition (2008) 2 units\n* Koenigsegg CCXR Edition (2008) 4 units\n* Koenigsegg Quant (2009) Solar Concept\n* Koenigsegg Trevita (2009–10) 2 units – 0–100 km/h (0-62 mph) 2.9 sec Top speed 410 km/h (254 mph)\n* Koenigsegg Agera (2010–2013) 7 units – 0–100 km/h (0-62 mph) 3.0 sec. Top speed 424 km/h (260 mph)\n* Koenigsegg Agera R (2011–2014) 18 units – 0–100 km/h (62 mph) 2.8 sec, 0–200 km/h (124 mph) 7.8 sec.  Top speed 430 km/h (267 mph) \n* Koenigsegg Agera S (2012–2014) 5 units – (2013–present) 0–100 km/h (62 mph) 2.9 sec, 200 km/h (124 mph) 7.9 sec. Top speed 430 km/h (267 mph)\n* Koenigsegg One:1 (2014) 6 units + 1 prototype – 0–400 km/h (248 mph) 20 sec.  Top speed 440 km/h (274 mph)\n* Koenigsegg Agera RS (2015–present) 25 units planned, 3 Agera RSR for Japanese market included. Top speed )\n* Koenigsegg Regera (2015–present) 80 units planned – 0–100 km/h (0–62 mph)  2.5 sec. Top speed 397 km/h (246 mph)\n* Koenigsegg Agera Final (2016–2017) 3 units\n\nRecords\n\nOn 28 February 2005, at 12:08 h local time, in Nardò, Italy, the CCR broke the Guinness World Record for the fastest production car in the world, having attained  on the Nardò Ring (a circular track of  circumference), breaking the record previously held by the McLaren F1.\nIt held the record until September 2005 when the Bugatti Veyron broke the record again at , proven by Car and Driver and Top Gear. Both the record set by Bugatti and the one set by McLaren were set on Volkswagen's own test-track Ehra-Lessien, which features a  straight.\n\nWhen it was introduced, the Koenigsegg CCXR held the power-to-weight ratio record for production cars, with a power-to-weight ratio of /hp.  Later the Koenigsegg One:1 held this record, with a power-to-weight ratio of /hp.\n\nIn 2008 the German magazine sport auto conducted a 0 - test for production cars, with the CCX winning the event in a total time of .\n\nIn September 2011, the Agera R broke the Guinness World Record for 0–300 km/h with a time of just 14.53 seconds and a 0-300-0 km/h time of 21.19 seconds. Koenigsegg improved this record with the One:1 on 8 June 2015. It proved 0–300 km/h in 11.92 seconds and 0-300-0 km/h in 17.95 seconds (3.24 sec improvement on the 2011, Koenigsegg Agera R record), it also proved 0–200 mph (0–322 km/h) in 14.328 seconds and 0-200-0 mph in 20.71 seconds.\n\nOn 1 October 2017, an Agera RS set an unofficial record for  with a time of 36.44 seconds. The record was set at the Vandel Airfield in Denmark and broke the record of 42 seconds. The Agera RS broke the previous record set by the Bugatti Chiron a few weeks earlier.\n\nOn 4 November 2017, an Agera RS set a new record for the world's fastest production car with an average speed of . The record breaking run was done on a closed 11 mi section of Nevada State Route 160 in Pahrump, Nevada, United States. On the same day they also beat their own 0–400–0 km/h record they set a few weeks prior (33.29 seconds compared to the old record of 36.44 seconds).\n\nAwards\n\n* Top Gear - Award 2010 - The Agera becomes BBCs Top Gear Hypercar of the Year\n* Red Dot - Award for excellent Design\n* National Swedish Design Prize - Utmärkt Svensk Form\n* Entrepreneur of the Year Nomination - Företagarna Sweden\n* Powercar - Superexotic import of the year 2007 and 2008 - Germany\n* Nürburgring - speed record\n* Top Gear - speed record\n* Nardo - speed record\n* sport auto - slalom record\n* sport auto - Hockenheimring speed record\n* sport auto - 0–200 km/h record\n* sport auto - 0–300 km/h record\n* sport auto - 0-300-0 km/h record. Koenigsegg. http://en.wikipedia.org/?curid=17310."
  }
}
