{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15863",
  "eid" : "1f6550f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778561919,
  "textBody" : "The terms 7th July, July 7th, and 7/7 (pronounced \"Seven-seven\") have been widely used in the Western media as a shorthand for the 7 July 2005 bombings on London's transport system. In the Chinese language, this term is used to denote the Battle of Lugou Bridge started on July 7, 1937, marking the beginning of the Second Sino-Japanese War.\n\nEvents\n\n*1124 – Tyre falls to the Crusaders.\n*1456 – A retrial verdict acquits Joan of Arc of heresy 25 years after her death.\n*1520 – Spanish conquistadores defeat a larger Aztec army at the Battle of Otumba.\n*1534 – Jacques Cartier makes his first contact with aboriginal peoples in what is now Canada.\n*1575 – The Raid of the Redeswire is the last major battle between England and Scotland.\n*1585 – The Treaty of Nemours abolishes tolerance to Protestants in France.\n*1770 – The Battle of Larga between the Russian Empire and the Ottoman Empire takes place.\n*1777 – American forces retreating from Fort Ticonderoga are defeated in the Battle of Hubbardton.\n*1798 – As a result of the XYZ Affair, the U.S. Congress rescinds the Treaty of Alliance with France sparking the \"Quasi-War\".\n*1807 – The Peace of Tilsit between France, Prussia and Russia ends the War of the Fourth Coalition.\n*1834 – In New York City, four nights of rioting against abolitionists began.\n*1846 – American troops occupy Monterey and Yerba Buena, thus beginning the conquest of California.\n*1863 – The United States begins its first military draft; exemptions cost $300.\n*1865 – Four conspirators in the assassination of Abraham Lincoln are hanged.\n*1892 – The Katipunan is established, the discovery of which by Spanish authorities initiated the Philippine Revolution.\n*1898 – U.S. President William McKinley signs the Newlands Resolution annexing Hawaii as a territory of the United States.\n*1907 – Florenz Ziegfeld, Jr. staged his first Follies on the roof of the New York Theater in New York City.\n*1911 – The United States, Great Britain, Japan, and Russia sign the North Pacific Fur Seal Convention of 1911 banning open-water seal hunting, the first international treaty to address wildlife preservation issues.\n*1915 – The First Battle of the Isonzo comes to an end.\n*  1915   – An International Railway trolley with an extreme overload of 157 passengers crashes near Queenston, Ontario, killing 15.\n*  1915   – Colombo Town Guard officer Henry Pedris is executed in British Ceylon for allegedly inciting persecution of Muslims.\n*1916 – The New Zealand Labour Party was founded in Wellington.\n*1928 – Sliced bread is sold for the first time (on the inventor's 48th birthday) by the Chillicothe Baking Company of Chillicothe, Missouri.\n*1930 – Industrialist Henry J. Kaiser begins construction of Boulder Dam (now known as Hoover Dam).\n*  1930   – Sir Arthur Conan Doyle, the creator of Sherlock Holmes, dies. \n*1937 – The Marco Polo Bridge Incident provides the Imperial Japanese Army with a pretext for starting the Second Sino-Japanese War.\n*1937 – The Peel Commission Report recommends the partition of Palestine - the first formal recommendation for partition in the history of Palestine\n*1941 – The American occupation of Iceland replaces the British occupation.\n*  1941   – World War II: Beirut is occupied by Free France and British troops.\n*1942 – World War II: German submarine U-701 destroyed off Cape Hatteras.\n*1944 – World War II: Largest Banzai charge of the Pacific War at the Battle of Saipan.\n*1946 – Mother Francesca S. Cabrini becomes the first American to be canonized.\n*  1946   – Howard Hughes nearly dies when his XF-11 reconnaissance aircraft prototype crashes in a Beverly Hills neighborhood.\n*1952 – The ocean liner  passes Bishop Rock on her maiden voyage, breaking the transatlantic speed record to become the fastest passenger ship in the world.\n*1953 – Ernesto \"Che\" Guevara sets out on a trip through Bolivia, Peru, Ecuador, Panama, Costa Rica, Nicaragua, Honduras, and El Salvador.\n*1954 – Elvis Presley makes his radio debut when WHBQ Memphis played his first recording for Sun Records, \"That's All Right\".\n*1958 – U.S. President Dwight D. Eisenhower signs the Alaska Statehood Act into law.\n*1959 – Venus occults the star Regulus. This rare event is used to determine the diameter of Venus and the structure of the Venusian atmosphere.\n*1963 – Buddhist crisis: The police of Ngô Đình Nhu, brother and chief political adviser of President Ngô Đình Diệm, attacked a group of American journalists who were covering a protest.\n*1978 – The Solomon Islands becomes independent from the United Kingdom\n*1980 – Institution of sharia law in Iran.\n*  1980   – During the Lebanese Civil War, 83 Tiger militants are killed during what will be known as the Safra massacre.\n*1981 – U.S. President Ronald Reagan appoints Sandra Day O'Connor to become the first female member of the Supreme Court of the United States.\n*1983 – Cold War: Samantha Smith, a U.S. schoolgirl, flies to the Soviet Union at the invitation of Secretary General Yuri Andropov.\n*1985 – Boris Becker becomes the youngest player ever to win Wimbledon at age 17.\n*1991 – Yugoslav Wars: The Brioni Agreement ends the ten-day independence war in Slovenia against the rest of the Socialist Federal Republic of Yugoslavia.\n*1992 – The New York Court of Appeals rules that women have the same right as men to go topless in public.\n*1997 – The Turkish Armed Forces withdraw from northern Iraq after assisting the Kurdistan Democratic Party in the Iraqi Kurdish Civil War.\n*2003 – NASA Opportunity rover, MER-B or Mars Exploration Rover–B, was launched into space aboard a Delta II rocket.\n*2005 – A series of four explosions occurs on London's transport system, killing 56 people, including four suicide bombers, and injuring over 700 others.\n*2007 – The first Live Earth benefit concert was held in 11 locations around the world.\n*2012 – At least 172 people are killed in a flash flood in the Krasnodar Krai region of Russia.\n*2013 – A De Havilland Otter air taxi crashes in Soldotna, Alaska, killing ten people.\n*2016 – Former U.S. Army soldier Micah Xavier Johnson shoots fourteen policemen during an anti-police protest in downtown Dallas, Texas, killing five of them. He is subsequently killed by a robot-delivered bomb.\n\nBirths\n\n* 611 – Eudoxia Epiphania, daughter of Byzantine emperor Heraclius \n*1053 – Emperor Shirakawa of Japan (d. 1129)\n*1119 – Emperor Sutoku of Japan (d. 1164)\n*1207 – Elizabeth of Hungary (d. 1231)\n*1482 – Andrzej Krzycki, Polish archbishop (d. 1537)\n*1528 – Archduchess Anna of Austria (d. 1590)\n*1540 – John Sigismund Zápolya, King of Hungary (d. 1571)\n*1586 – Thomas Howard, 21st Earl of Arundel, English courtier and politician, Lord Lieutenant of Northumberland (d. 1646)\n*1616 – John Leverett, Governor of Massachusetts Bay Colony (d. 1679)\n*1752 – Joseph Marie Jacquard, French merchant, invented the Jacquard loom (d. 1834)\n*1766 – Guillaume Philibert Duhesme, French general (d. 1815)\n*1831 – Jane Elizabeth Conklin, American poet and religious writer (d. 1914)\n*1833 – Félicien Rops, Belgian painter and illustrator (d. 1898)\n*1843 – Camillo Golgi, Italian physician and pathologist, Nobel Prize laureate (d. 1926)\n*1846 – Heinrich Rosenthal, Estonian physician and author (d. 1916)\n*1848 – Francisco de Paula Rodrigues Alves, Brazilian politician, 5th President of Brazil (d. 1919)\n*1851 – Charles Albert Tindley, American minister and composer (d. 1933)\n*1855 – Ludwig Ganghofer, German author and playwright (d. 1920)\n*1859 – Rettamalai Srinivasan, Indian politician (d. 1911)\n*1860 – Gustav Mahler, Austrian composer and conductor (d. 1911)\n*1861 – Nettie Stevens, American geneticist (d. 1912)\n*1874 – Erwin Bumke, Polish-German lawyer and jurist (d. 1945)\n*1880 – Otto Frederick Rohwedder, American engineer, invented sliced bread (d. 1960)\n*1882 – Yanka Kupala, Belarusian poet and writer (d. 1941)\n*1884 – Toivo Kuula, Finnish conductor and composer (d. 1918)\n*1884 – Lion Feuchtwanger, German author and playwright (d. 1958)\n*1891 – Tadamichi Kuribayashi, Japanese general and poet (d. 1945)\n*  1891   – Virginia Rappe, American model and actress (d. 1921)\n*1893 – Herbert Feis, American historian and author (d. 1972)\n*  1893   – Miroslav Krleža, Croatian author, poet, and playwright (d. 1981)\n*1898 – Arnold Horween, American football player and coach (d. 1985)\n*1899 – George Cukor, American director and producer (d. 1983)\n*1900 – Maria Bard, German stage and silent film actress (d. 1944)\n*  1900   – Earle E. Partridge, American general (d. 1990)\n*1901 – Vittorio De Sica, Italian actor and director (d. 1974)\n*  1901   – Sam Katzman, American director and producer (d. 1973)\n*  1901   – Eiji Tsuburaya, Japanese cinematographer and producer (d. 1970)\n*1902 – Ted Radcliffe, American baseball player and manager (d. 2005)\n*1904 – Simone Beck, French chef and author (d. 1991)\n*1905 – Marie-Louise Dubreil-Jacotin, French mathematician (d. 1972)\n*1906 – William Feller, Croatian-American mathematician and academic (d. 1970)\n*  1906   – Anton Karas, Austrian zither player and composer (d. 1985)\n*  1906   – Satchel Paige, American baseball player and coach (d. 1982)\n*1907 – Robert A. Heinlein, American science fiction writer and screenwriter (d. 1988)\n*1908 – Revilo P. Oliver, American author and academic (d. 1994)\n*1909 – Gottfried von Cramm, German tennis player (d. 1976)\n*1910 – Doris McCarthy, Canadian painter and author (d. 2010)\n*1911 – Gian Carlo Menotti, Italian-American composer (d. 2007)\n*1913 – Pinetop Perkins, American singer and pianist (d. 2011)\n*1915 – Margaret Walker, American novelist and poet (d. 1998)\n*1917 – Fidel Sánchez Hernández, Salvadoran general and politician, President of El Salvador (d. 2003)\n*  1917   – Iva Withers, Canadian-American actress and singer (d. 2014)\n*1918 – Bob Vanatta, American head basketball coach (d. 2016)\n*  1918   – Jing Shuping, Chinese businessman (d. 2009)\n*1919 – Jon Pertwee, English actor (d. 1996)\n*1921 – Ezzard Charles, American boxer and bassist (d. 1975)\n*  1921   – Adolf von Thadden, German lieutenant and politician (d. 1996)\n*1922 – Alan Armer, American director, producer, and screenwriter (d. 2010)\n*1923 – Liviu Ciulei, Romanian actor, director, and screenwriter (d. 2011)\n*  1923   – Eduardo Falú, Argentinian guitarist and composer (d. 2013)\n*1924 – Natalia Bekhtereva, Russian neuroscientist and psychologist (d. 2008)\n*  1924   – Karim Olowu, Nigerian sprinter and long jumper\n*  1924   – Mary Ford, American singer and guitarist (d. 1977)\n*  1924   – Eddie Romero, Filipino director, producer, and screenwriter (d. 2013)\n*1925 – Wally Phillips, American radio host (d. 2008)\n*1926 – Nuon Chea, Cambodian politician\n*  1926   – Anand Mohan Zutshi Gulzar Dehlvi, Urdu poet\n*1927 – Alan J. Dixon, American soldier, lawyer, and politician, 34th Illinois Secretary of State (d. 2014)\n*  1927   – Charlie Louvin, American singer-songwriter and guitarist (d. 2011) \n*  1927   – Doc Severinsen, American trumpet player and conductor \n*1928 – Patricia Hitchcock, English actress\n*1929 – Hasan Abidi, Pakistani journalist and poet (d. 2005)\n*1930 – Hamish MacInnes, Scottish mountaineer and author\n*  1930   – Theodore Edgar McCarrick, American cardinal\n*  1930   – Hank Mobley, American saxophonist and composer (d. 1986)\n*1931 – David Eddings, American author and academic (d. 2009)\n*1932 – T. J. Bass, American physician and author (d. 2011)\n*1932 – Joe Zawinul, Austrian jazz keyboardist and composer (d. 2007)\n*1933 – David McCullough, American historian and author\n*1934 – Robert McNeill Alexander, British zoologist (d. 2016)\n*1936 – Egbert Brieskorn, German mathematician and academic (d. 2013)\n*  1936   – Jo Siffert, Swiss race car driver (d. 1971)\n*  1936   – Nikos Xilouris, Greek singer-songwriter (d. 1980)\n*1937 – Tung Chee-hwa, Hong Kong businessman and politician, 1st Chief Executive of Hong Kong\n*1938 – James Montgomery Boice, American pastor and theologian (d. 2000)\n*1939 – Elena Obraztsova, Russian soprano and actress (d. 2015)\n*1940 – Ringo Starr, English singer-songwriter, drummer, and actor \n*1941 – Marco Bollesan, Italian rugby player and coach\n*  1941   – Nancy Farmer, American author\n*  1941   – Michael Howard, Welsh lawyer and politician, Secretary of State for the Environment\n*  1941   – Bill Oddie, English comedian, actor, and singer\n*  1941   – Jim Rodford, English bass player\n*1943 – Toto Cutugno, Italian singer-songwriter\n*  1943   – Joel Siegel, American journalist and critic (d. 2007)\n*1944 – Warren Entner, American pop-rock singer-songwriter, organist, and guitarist \n*  1944   – Tony Jacklin, English golfer and sportscaster\n*  1944   – Glenys Kinnock, Baroness Kinnock of Holyhead, English educator and politician, Minister of State for Europe\n*  1944   – Emanuel Steward, American boxer and trainer (d. 2012)\n*  1944   – Ian Wilmut, English-Scottish embryologist and academic\n*1945 – Michael Ancram, English lawyer and politician, Shadow Secretary of State for Defence\n*  1945   – Adele Goldberg, American computer scientist and academic\n*1947 – Gyanendra, King of Nepal\n*  1947   – Howard Rheingold, American author and critic\n*1949 – Shelley Duvall, American actress, writer, and producer\n*1955 – Len Barker, American baseball player and coach\n*1957 – Jonathan Dayton, American director and producer\n*  1957   – Berry Sakharof, Turkish-Israeli singer-songwriter and guitarist \n*1958 – Michala Petri, Danish recorder player\n*  1958   – Alexander Svinin, Russian figure skater and coach\n*1959 – Billy Campbell, American actor\n*1960 – Kevin A. Ford, American colonel and astronaut\n*  1960   – Ralph Sampson, American basketball player and coach\n*1963 – Vonda Shepard, American singer-songwriter and actress\n*1965 – Mo Collins, American actress, comedian and screenwriter\n*  1965   – Jeremy Kyle, English talk show host\n*1966 – Jim Gaffigan, American comedian, actor, producer, and screenwriter\n*1967 – Tom Kristensen, Danish race car driver\n*1968 – Jorja Fox, American actress \n*  1968   – John Paris, American drummer\n*  1968   – Jeff VanderMeer, American author and educator\n*1969 – Sylke Otto, German luger\n*  1969   – Joe Sakic, Canadian ice hockey player\n*  1969   – Cree Summer, American-Canadian actress\n*1970 – Wayne McCullough, Northern Irish boxer\n*  1970   – Min Patel, Indian-English cricketer\n*  1970   – Erik Zabel, German cyclist and coach\n*1971 – Christian Camargo, American actor, producer, and screenwriter\n*1972 – Lisa Leslie, American basketball player and actress\n*  1972   – Manfred Stohl, Austrian race car driver\n*  1972   – Kirsten Vangsness, American actress and writer\n*1973 – José Jiménez, Dominican baseball player\n*  1973   – Kailash Kher, Indian singer-songwriter and director\n*  1973   – Kārlis Skrastiņš, Latvian ice hockey player (d. 2011)\n*  1973   – Natsuki Takaya, Japanese author and illustrator\n*1974 – Patrick Lalime, Canadian ice hockey player and sportscaster\n*1975 – Tony Benshoof, American luger\n*  1975   – Louis Koen, South African rugby player\n*  1975   – Adam Nelson, American shot putter\n*1976 – Bérénice Bejo, Argentinian-French actress\n*  1976   – Dominic Foley, Irish footballer\n*  1976   – Vasily Petrenko, Russian conductor\n*  1976   – Ercüment Olgundeniz, Turkish discus thrower and shot putter\n*1978 – Chris Andersen, American basketball player\n*  1978   – Davor Kraljević, Croatian footballer\n*1979 – Ibrahim Sulayman Muhammad Arbaysh, Saudi Arabian terrorist (d. 2015)\n*  1979   – Anastasios Gousis, Greek sprinter\n*1980 – John Buck, American baseball player\n*  1980   – Michelle Kwan, American figure skater\n*1981 – Mahendra Singh Dhoni, Indian cricketer\n*1982 – Jan Laštůvka, Czech footballer\n*  1982   – George Owu, Ghanaian footballer\n*1983 – Justin Davies, Australian footballer\n*1984 – Minas Alozidis, Greek hurdler\n*  1984   – Alberto Aquilani, Italian footballer\n*  1984   – Mohammad Ashraful, Bangladeshi cricketer\n*1985 – Marc Stein, German footballer\n*1986 – Ana Kasparian, American journalist and producer\n*  1986   – Udo Schwarz, German rugby player\n*  1986   – Sevyn Streeter, American singer-songwriter\n*1988 – Kaci Brown, American singer-songwriter\n*1989 – Landon Cassill, American race car driver\n*  1989   – Miina Kallas, Estonian footballer\n*  1989   – Karl-August Tiirmaa, Estonian skier\n*1990 – Lee Addy, Ghanaian footballer\n*1991 – Alesso, Swedish DJ and musician\n*1992 – Ellina Anissimova, Estonian hammer thrower\n*  1992   – Dominik Furman, Polish footballer\n*1994 – Timothy Cathcart, Northern Irish race car driver (d. 2014)\n\nDeaths\n\n* 984 – Crescentius the Elder, politician and aristocrat\n*1162 – King Haakon II of Norway\n*1285 – Tile Kolup, German impostor claiming to be Frederick II, Holy Roman Emperor\n*1304 – Pope Benedict XI (b. 1240)\n*1307 – Edward I of England (b. 1239)\n*1345 – Momchil, Bulgarian brigand\n*1531 – Tilman Riemenschneider, German sculptor (b. 1460)\n*1568 – William Turner, British ornithologist and botanist (b. 1508)\n*1572 – Sigismund II Augustus, Polish king (b. 1520)\n*1573 – Giacomo Barozzi da Vignola, Italian architect, designed the Church of the Gesù and Villa Farnese (b. 1507)\n*1593 – Mohammed Bagayogo, Malian scholar and academic (b. 1523)\n*1600 – Thomas Lucy, English politician (b. 1532)\n*1607 – Penelope Blount, Countess of Devonshire, English noblewoman (b. 1563)\n*1647 – Thomas Hooker, English minister, founded the Colony of Connecticut (b. 1586)\n*1701 – William Stoughton, American judge and politician, Governor of the Province of Massachusetts Bay (b. 1631)\n*1713 – Henry Compton, English bishop (b. 1632)\n*1718 – Alexei Petrovich, Tsarevich of Russia (b. 1690)\n*1730 – Olivier Levasseur, French pirate (b. 1690)\n*1764 – William Pulteney, 1st Earl of Bath, English politician, Secretary at War (b. 1683)\n*1776 – Jeremiah Markland, English scholar and academic (b. 1693)\n*1790 – François Hemsterhuis, Dutch philosopher and author (b. 1721)\n*1816 – Richard Brinsley Sheridan, Irish playwright and poet (b. 1751)\n*1863 – William Mulready, Irish genre painter (b. 1786)\n*1865 – George Atzerodt (b. 1833)\n*  1865   – David Herold (b. 1842)\n*  1865   – Lewis Payne (b. 1844)\n*  1865   – Mary Surratt (b. 1823)\n*1890 – Henri Nestlé, German businessman, founded Nestlé (b. 1814)\n*1901 – Johanna Spyri, Swiss author (b. 1827)\n*1913 – Edward Burd Grubb, Jr., American general and diplomat, United States Ambassador to Spain (b. 1841)\n*1922 – Cathal Brugha, Irish revolutionary and politician, active in the Easter Rising, Irish War of Independence; first Ceann Comhairle and first President of Dáil Éireann (b. 1874)\n*1925 – Clarence Hudson White, American photographer and educator (b. 1871)\n*1927 – Gösta Mittag-Leffler, Swedish mathematician and academic (b. 1846)\n*1930 – Arthur Conan Doyle, British writer (b. 1859)\n*1932 – Alexander Grin, Russian author (b. 1880)\n*  1932   – Henry Eyster Jacobs, American theologian and educator (b. 1844)\n*1939 – Deacon White, American baseball player and manager (b. 1847)\n*1950 – Fats Navarro, American trumpet player and composer (b. 1923)\n*1955 – Ali Naci Karacan, Turkish journalist and publisher (b. 1896)\n*1956 – Gottfried Benn, German author and poet (b. 1886)\n*1960 – Francis Browne, Irish priest and photographer (b. 1880)\n*1964 – Lillian Copeland, American discus thrower and shot putter (b. 1904)\n*1965 – Moshe Sharett, Ukrainian-Israeli lieutenant and politician, 2nd Prime Minister of Israel (b. 1894)\n*1968 – Jo Schlesser, French race car driver (b. 1928)\n*1971 – Claude Gauvreau, Canadian poet and playwright (b. 1925)\n*1972 – Athenagoras I of Constantinople (b. 1886)\n*1973 – Max Horkheimer, German philosopher and sociologist (b. 1895)\n*  1973   – Veronica Lake, American actress (b. 1922)\n*1976 – Walter Giesler, American soccer player and referee (b. 1910)\n*1978 – Francisco Mendes, Guinea-Bissau lawyer and politician, 1st Prime Minister of Guinea-Bissau (b. 1933)\n*1980 – Dore Schary, American director, producer, and screenwriter (b. 1905)\n*1982 – Bon Maharaja, Indian guru and religious writer (b. 1901)\n*1984 – George Oppen, American poet and author (b. 1908)\n*1987 – Germaine Thyssens-Valentin, Dutch-French pianist (b. 1902)\n*1990 – Bill Cullen, American television panelist and game show host (b. 1920)\n*  1990   – Cazuza, Brazilian singer and songwriter (b. 1958)\n*1993 – Rıfat Ilgaz, Turkish author, poet, and educator (b. 1911)\n*1994 – Carlo Chiti, Italian engineer (b. 1924)\n*  1994   – Cameron Mitchell, American actor (b. 1918)\n*  1994   – Friedrich August Freiherr von der Heydte, German general (b. 1907)\n*1998 – Moshood Abiola, Nigerian businessman and politician (b. 1937)\n*1999 – Julie Campbell Tatham, American author (b. 1908)\n*2000 – Kenny Irwin Jr., American race car driver (b. 1969)\n*2001 – Fred Neil, American singer-songwriter and guitarist (b. 1936)\n*2003 – Izhak Graziani, Bulgarian trumpet player and conductor (b. 1924)\n*2006 – Syd Barrett, English singer-songwriter and guitarist (b. 1946)\n*  2006   – Juan de Ávalos, Spanish sculptor (b. 1911)\n*  2006   – John Money, New Zealand-American psychologist and author (b. 1921)\n*2008 – Bruce Conner, American sculptor, painter, and photographer (b. 1933)\n*  2008   – Dorian Leigh, American model (b. 1917)\n*2011 – Allan W. Eckert, American historian and author (b. 1931)\n*  2011   – Dick Williams, American baseball player, coach, and manager (b. 1929)\n*2012 – Ronaldo Cunha Lima, Brazilian poet and politician (b. 1936)\n*  2012   – Dennis Flemion, American drummer (b. 1955)\n*  2012   – Doris Neal, American baseball player (b. 1928)\n*  2012   – Jerry Norman, American sinologist and linguist (b. 1936)\n*  2012   – Leon Schlumpf, Swiss politician (b. 1927)\n*2013 – Artur Hajzer, Polish mountaineer (b. 1962)\n*  2013   – Robert Hamerton-Kelly, South African-American pastor, theologian, and author (b. 1938)\n*  2013   – Donald J. Irwin, American lawyer and politician, 32nd Mayor of Norwalk, Connecticut (b. 1926)\n*  2013   – Ben Pucci, American football player and sportscaster (b. 1925)\n*2014 – Alfredo Di Stéfano, Argentinian-Spanish footballer and coach (b. 1926)\n*  2014   – Eduard Shevardnadze, Georgian general and politician, 2nd President of Georgia (b. 1928)\n*  2014   – Peter Underwood, Australian lawyer and politician, 27th Governor of Tasmania (b. 1937)\n*2015 – Maria Barroso, Portuguese actress and politician (b. 1925)\n*  2015   – Bob MacKinnon, American basketball player and coach (b. 1927)\n\nHolidays and observances\n\n* Christian feast day:\n** Æthelburh of Faremoutiers\n** Felix of Nantes\n** Illidius\n** Job of Manyava (Ukrainian Orthodox Church)\n** Willibald (Catholic Church)\n** July 7 (Eastern Orthodox liturgics)\n* Independence Day, celebrates the independence of Solomon Islands from the United Kingdom in 1978.\n* Ivan Kupala Day (Belarus, Poland, Russia, Ukraine)\n* Saba Saba Day (Tanzania)\n* Tanabata (Japan)\n* World Chocolate Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "July 7" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15863" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The terms 7th July, July 7th, and 7/7 (pronounced \"Seven-seven\") have been widely used in the Western media as a shorthand for the 7 July 2005 bombings on London's transport system. In the Chinese language, this term is used to denote the Battle of Lugou Bridge started on July 7, 1937, marking the beginning of the Second Sino-Japanese War.\n\nEvents\n\n*1124 – Tyre falls to the Crusaders.\n*1456 – A retrial verdict acquits Joan of Arc of heresy 25 years after her death.\n*1520 – Spanish conquistadores defeat a larger Aztec army at the Battle of Otumba.\n*1534 – Jacques Cartier makes his first contact with aboriginal peoples in what is now Canada.\n*1575 – The Raid of the Redeswire is the last major battle between England and Scotland.\n*1585 – The Treaty of Nemours abolishes tolerance to Protestants in France.\n*1770 – The Battle of Larga between the Russian Empire and the Ottoman Empire takes place.\n*1777 – American forces retreating from Fort Ticonderoga are defeated in the Battle of Hubbardton.\n*1798 – As a result of the XYZ Affair, the U.S. Congress rescinds the Treaty of Alliance with France sparking the \"Quasi-War\".\n*1807 – The Peace of Tilsit between France, Prussia and Russia ends the War of the Fourth Coalition.\n*1834 – In New York City, four nights of rioting against abolitionists began.\n*1846 – American troops occupy Monterey and Yerba Buena, thus beginning the conquest of California.\n*1863 – The United States begins its first military draft; exemptions cost $300.\n*1865 – Four conspirators in the assassination of Abraham Lincoln are hanged.\n*1892 – The Katipunan is established, the discovery of which by Spanish authorities initiated the Philippine Revolution.\n*1898 – U.S. President William McKinley signs the Newlands Resolution annexing Hawaii as a territory of the United States.\n*1907 – Florenz Ziegfeld, Jr. staged his first Follies on the roof of the New York Theater in New York City.\n*1911 – The United States, Great Britain, Japan, and Russia sign the North Pacific Fur Seal Convention of 1911 banning open-water seal hunting, the first international treaty to address wildlife preservation issues.\n*1915 – The First Battle of the Isonzo comes to an end.\n*  1915   – An International Railway trolley with an extreme overload of 157 passengers crashes near Queenston, Ontario, killing 15.\n*  1915   – Colombo Town Guard officer Henry Pedris is executed in British Ceylon for allegedly inciting persecution of Muslims.\n*1916 – The New Zealand Labour Party was founded in Wellington.\n*1928 – Sliced bread is sold for the first time (on the inventor's 48th birthday) by the Chillicothe Baking Company of Chillicothe, Missouri.\n*1930 – Industrialist Henry J. Kaiser begins construction of Boulder Dam (now known as Hoover Dam).\n*  1930   – Sir Arthur Conan Doyle, the creator of Sherlock Holmes, dies. \n*1937 – The Marco Polo Bridge Incident provides the Imperial Japanese Army with a pretext for starting the Second Sino-Japanese War.\n*1937 – The Peel Commission Report recommends the partition of Palestine - the first formal recommendation for partition in the history of Palestine\n*1941 – The American occupation of Iceland replaces the British occupation.\n*  1941   – World War II: Beirut is occupied by Free France and British troops.\n*1942 – World War II: German submarine U-701 destroyed off Cape Hatteras.\n*1944 – World War II: Largest Banzai charge of the Pacific War at the Battle of Saipan.\n*1946 – Mother Francesca S. Cabrini becomes the first American to be canonized.\n*  1946   – Howard Hughes nearly dies when his XF-11 reconnaissance aircraft prototype crashes in a Beverly Hills neighborhood.\n*1952 – The ocean liner  passes Bishop Rock on her maiden voyage, breaking the transatlantic speed record to become the fastest passenger ship in the world.\n*1953 – Ernesto \"Che\" Guevara sets out on a trip through Bolivia, Peru, Ecuador, Panama, Costa Rica, Nicaragua, Honduras, and El Salvador.\n*1954 – Elvis Presley makes his radio debut when WHBQ Memphis played his first recording for Sun Records, \"That's All Right\".\n*1958 – U.S. President Dwight D. Eisenhower signs the Alaska Statehood Act into law.\n*1959 – Venus occults the star Regulus. This rare event is used to determine the diameter of Venus and the structure of the Venusian atmosphere.\n*1963 – Buddhist crisis: The police of Ngô Đình Nhu, brother and chief political adviser of President Ngô Đình Diệm, attacked a group of American journalists who were covering a protest.\n*1978 – The Solomon Islands becomes independent from the United Kingdom\n*1980 – Institution of sharia law in Iran.\n*  1980   – During the Lebanese Civil War, 83 Tiger militants are killed during what will be known as the Safra massacre.\n*1981 – U.S. President Ronald Reagan appoints Sandra Day O'Connor to become the first female member of the Supreme Court of the United States.\n*1983 – Cold War: Samantha Smith, a U.S. schoolgirl, flies to the Soviet Union at the invitation of Secretary General Yuri Andropov.\n*1985 – Boris Becker becomes the youngest player ever to win Wimbledon at age 17.\n*1991 – Yugoslav Wars: The Brioni Agreement ends the ten-day independence war in Slovenia against the rest of the Socialist Federal Republic of Yugoslavia.\n*1992 – The New York Court of Appeals rules that women have the same right as men to go topless in public.\n*1997 – The Turkish Armed Forces withdraw from northern Iraq after assisting the Kurdistan Democratic Party in the Iraqi Kurdish Civil War.\n*2003 – NASA Opportunity rover, MER-B or Mars Exploration Rover–B, was launched into space aboard a Delta II rocket.\n*2005 – A series of four explosions occurs on London's transport system, killing 56 people, including four suicide bombers, and injuring over 700 others.\n*2007 – The first Live Earth benefit concert was held in 11 locations around the world.\n*2012 – At least 172 people are killed in a flash flood in the Krasnodar Krai region of Russia.\n*2013 – A De Havilland Otter air taxi crashes in Soldotna, Alaska, killing ten people.\n*2016 – Former U.S. Army soldier Micah Xavier Johnson shoots fourteen policemen during an anti-police protest in downtown Dallas, Texas, killing five of them. He is subsequently killed by a robot-delivered bomb.\n\nBirths\n\n* 611 – Eudoxia Epiphania, daughter of Byzantine emperor Heraclius \n*1053 – Emperor Shirakawa of Japan (d. 1129)\n*1119 – Emperor Sutoku of Japan (d. 1164)\n*1207 – Elizabeth of Hungary (d. 1231)\n*1482 – Andrzej Krzycki, Polish archbishop (d. 1537)\n*1528 – Archduchess Anna of Austria (d. 1590)\n*1540 – John Sigismund Zápolya, King of Hungary (d. 1571)\n*1586 – Thomas Howard, 21st Earl of Arundel, English courtier and politician, Lord Lieutenant of Northumberland (d. 1646)\n*1616 – John Leverett, Governor of Massachusetts Bay Colony (d. 1679)\n*1752 – Joseph Marie Jacquard, French merchant, invented the Jacquard loom (d. 1834)\n*1766 – Guillaume Philibert Duhesme, French general (d. 1815)\n*1831 – Jane Elizabeth Conklin, American poet and religious writer (d. 1914)\n*1833 – Félicien Rops, Belgian painter and illustrator (d. 1898)\n*1843 – Camillo Golgi, Italian physician and pathologist, Nobel Prize laureate (d. 1926)\n*1846 – Heinrich Rosenthal, Estonian physician and author (d. 1916)\n*1848 – Francisco de Paula Rodrigues Alves, Brazilian politician, 5th President of Brazil (d. 1919)\n*1851 – Charles Albert Tindley, American minister and composer (d. 1933)\n*1855 – Ludwig Ganghofer, German author and playwright (d. 1920)\n*1859 – Rettamalai Srinivasan, Indian politician (d. 1911)\n*1860 – Gustav Mahler, Austrian composer and conductor (d. 1911)\n*1861 – Nettie Stevens, American geneticist (d. 1912)\n*1874 – Erwin Bumke, Polish-German lawyer and jurist (d. 1945)\n*1880 – Otto Frederick Rohwedder, American engineer, invented sliced bread (d. 1960)\n*1882 – Yanka Kupala, Belarusian poet and writer (d. 1941)\n*1884 – Toivo Kuula, Finnish conductor and composer (d. 1918)\n*1884 – Lion Feuchtwanger, German author and playwright (d. 1958)\n*1891 – Tadamichi Kuribayashi, Japanese general and poet (d. 1945)\n*  1891   – Virginia Rappe, American model and actress (d. 1921)\n*1893 – Herbert Feis, American historian and author (d. 1972)\n*  1893   – Miroslav Krleža, Croatian author, poet, and playwright (d. 1981)\n*1898 – Arnold Horween, American football player and coach (d. 1985)\n*1899 – George Cukor, American director and producer (d. 1983)\n*1900 – Maria Bard, German stage and silent film actress (d. 1944)\n*  1900   – Earle E. Partridge, American general (d. 1990)\n*1901 – Vittorio De Sica, Italian actor and director (d. 1974)\n*  1901   – Sam Katzman, American director and producer (d. 1973)\n*  1901   – Eiji Tsuburaya, Japanese cinematographer and producer (d. 1970)\n*1902 – Ted Radcliffe, American baseball player and manager (d. 2005)\n*1904 – Simone Beck, French chef and author (d. 1991)\n*1905 – Marie-Louise Dubreil-Jacotin, French mathematician (d. 1972)\n*1906 – William Feller, Croatian-American mathematician and academic (d. 1970)\n*  1906   – Anton Karas, Austrian zither player and composer (d. 1985)\n*  1906   – Satchel Paige, American baseball player and coach (d. 1982)\n*1907 – Robert A. Heinlein, American science fiction writer and screenwriter (d. 1988)\n*1908 – Revilo P. Oliver, American author and academic (d. 1994)\n*1909 – Gottfried von Cramm, German tennis player (d. 1976)\n*1910 – Doris McCarthy, Canadian painter and author (d. 2010)\n*1911 – Gian Carlo Menotti, Italian-American composer (d. 2007)\n*1913 – Pinetop Perkins, American singer and pianist (d. 2011)\n*1915 – Margaret Walker, American novelist and poet (d. 1998)\n*1917 – Fidel Sánchez Hernández, Salvadoran general and politician, President of El Salvador (d. 2003)\n*  1917   – Iva Withers, Canadian-American actress and singer (d. 2014)\n*1918 – Bob Vanatta, American head basketball coach (d. 2016)\n*  1918   – Jing Shuping, Chinese businessman (d. 2009)\n*1919 – Jon Pertwee, English actor (d. 1996)\n*1921 – Ezzard Charles, American boxer and bassist (d. 1975)\n*  1921   – Adolf von Thadden, German lieutenant and politician (d. 1996)\n*1922 – Alan Armer, American director, producer, and screenwriter (d. 2010)\n*1923 – Liviu Ciulei, Romanian actor, director, and screenwriter (d. 2011)\n*  1923   – Eduardo Falú, Argentinian guitarist and composer (d. 2013)\n*1924 – Natalia Bekhtereva, Russian neuroscientist and psychologist (d. 2008)\n*  1924   – Karim Olowu, Nigerian sprinter and long jumper\n*  1924   – Mary Ford, American singer and guitarist (d. 1977)\n*  1924   – Eddie Romero, Filipino director, producer, and screenwriter (d. 2013)\n*1925 – Wally Phillips, American radio host (d. 2008)\n*1926 – Nuon Chea, Cambodian politician\n*  1926   – Anand Mohan Zutshi Gulzar Dehlvi, Urdu poet\n*1927 – Alan J. Dixon, American soldier, lawyer, and politician, 34th Illinois Secretary of State (d. 2014)\n*  1927   – Charlie Louvin, American singer-songwriter and guitarist (d. 2011) \n*  1927   – Doc Severinsen, American trumpet player and conductor \n*1928 – Patricia Hitchcock, English actress\n*1929 – Hasan Abidi, Pakistani journalist and poet (d. 2005)\n*1930 – Hamish MacInnes, Scottish mountaineer and author\n*  1930   – Theodore Edgar McCarrick, American cardinal\n*  1930   – Hank Mobley, American saxophonist and composer (d. 1986)\n*1931 – David Eddings, American author and academic (d. 2009)\n*1932 – T. J. Bass, American physician and author (d. 2011)\n*1932 – Joe Zawinul, Austrian jazz keyboardist and composer (d. 2007)\n*1933 – David McCullough, American historian and author\n*1934 – Robert McNeill Alexander, British zoologist (d. 2016)\n*1936 – Egbert Brieskorn, German mathematician and academic (d. 2013)\n*  1936   – Jo Siffert, Swiss race car driver (d. 1971)\n*  1936   – Nikos Xilouris, Greek singer-songwriter (d. 1980)\n*1937 – Tung Chee-hwa, Hong Kong businessman and politician, 1st Chief Executive of Hong Kong\n*1938 – James Montgomery Boice, American pastor and theologian (d. 2000)\n*1939 – Elena Obraztsova, Russian soprano and actress (d. 2015)\n*1940 – Ringo Starr, English singer-songwriter, drummer, and actor \n*1941 – Marco Bollesan, Italian rugby player and coach\n*  1941   – Nancy Farmer, American author\n*  1941   – Michael Howard, Welsh lawyer and politician, Secretary of State for the Environment\n*  1941   – Bill Oddie, English comedian, actor, and singer\n*  1941   – Jim Rodford, English bass player\n*1943 – Toto Cutugno, Italian singer-songwriter\n*  1943   – Joel Siegel, American journalist and critic (d. 2007)\n*1944 – Warren Entner, American pop-rock singer-songwriter, organist, and guitarist \n*  1944   – Tony Jacklin, English golfer and sportscaster\n*  1944   – Glenys Kinnock, Baroness Kinnock of Holyhead, English educator and politician, Minister of State for Europe\n*  1944   – Emanuel Steward, American boxer and trainer (d. 2012)\n*  1944   – Ian Wilmut, English-Scottish embryologist and academic\n*1945 – Michael Ancram, English lawyer and politician, Shadow Secretary of State for Defence\n*  1945   – Adele Goldberg, American computer scientist and academic\n*1947 – Gyanendra, King of Nepal\n*  1947   – Howard Rheingold, American author and critic\n*1949 – Shelley Duvall, American actress, writer, and producer\n*1955 – Len Barker, American baseball player and coach\n*1957 – Jonathan Dayton, American director and producer\n*  1957   – Berry Sakharof, Turkish-Israeli singer-songwriter and guitarist \n*1958 – Michala Petri, Danish recorder player\n*  1958   – Alexander Svinin, Russian figure skater and coach\n*1959 – Billy Campbell, American actor\n*1960 – Kevin A. Ford, American colonel and astronaut\n*  1960   – Ralph Sampson, American basketball player and coach\n*1963 – Vonda Shepard, American singer-songwriter and actress\n*1965 – Mo Collins, American actress, comedian and screenwriter\n*  1965   – Jeremy Kyle, English talk show host\n*1966 – Jim Gaffigan, American comedian, actor, producer, and screenwriter\n*1967 – Tom Kristensen, Danish race car driver\n*1968 – Jorja Fox, American actress \n*  1968   – John Paris, American drummer\n*  1968   – Jeff VanderMeer, American author and educator\n*1969 – Sylke Otto, German luger\n*  1969   – Joe Sakic, Canadian ice hockey player\n*  1969   – Cree Summer, American-Canadian actress\n*1970 – Wayne McCullough, Northern Irish boxer\n*  1970   – Min Patel, Indian-English cricketer\n*  1970   – Erik Zabel, German cyclist and coach\n*1971 – Christian Camargo, American actor, producer, and screenwriter\n*1972 – Lisa Leslie, American basketball player and actress\n*  1972   – Manfred Stohl, Austrian race car driver\n*  1972   – Kirsten Vangsness, American actress and writer\n*1973 – José Jiménez, Dominican baseball player\n*  1973   – Kailash Kher, Indian singer-songwriter and director\n*  1973   – Kārlis Skrastiņš, Latvian ice hockey player (d. 2011)\n*  1973   – Natsuki Takaya, Japanese author and illustrator\n*1974 – Patrick Lalime, Canadian ice hockey player and sportscaster\n*1975 – Tony Benshoof, American luger\n*  1975   – Louis Koen, South African rugby player\n*  1975   – Adam Nelson, American shot putter\n*1976 – Bérénice Bejo, Argentinian-French actress\n*  1976   – Dominic Foley, Irish footballer\n*  1976   – Vasily Petrenko, Russian conductor\n*  1976   – Ercüment Olgundeniz, Turkish discus thrower and shot putter\n*1978 – Chris Andersen, American basketball player\n*  1978   – Davor Kraljević, Croatian footballer\n*1979 – Ibrahim Sulayman Muhammad Arbaysh, Saudi Arabian terrorist (d. 2015)\n*  1979   – Anastasios Gousis, Greek sprinter\n*1980 – John Buck, American baseball player\n*  1980   – Michelle Kwan, American figure skater\n*1981 – Mahendra Singh Dhoni, Indian cricketer\n*1982 – Jan Laštůvka, Czech footballer\n*  1982   – George Owu, Ghanaian footballer\n*1983 – Justin Davies, Australian footballer\n*1984 – Minas Alozidis, Greek hurdler\n*  1984   – Alberto Aquilani, Italian footballer\n*  1984   – Mohammad Ashraful, Bangladeshi cricketer\n*1985 – Marc Stein, German footballer\n*1986 – Ana Kasparian, American journalist and producer\n*  1986   – Udo Schwarz, German rugby player\n*  1986   – Sevyn Streeter, American singer-songwriter\n*1988 – Kaci Brown, American singer-songwriter\n*1989 – Landon Cassill, American race car driver\n*  1989   – Miina Kallas, Estonian footballer\n*  1989   – Karl-August Tiirmaa, Estonian skier\n*1990 – Lee Addy, Ghanaian footballer\n*1991 – Alesso, Swedish DJ and musician\n*1992 – Ellina Anissimova, Estonian hammer thrower\n*  1992   – Dominik Furman, Polish footballer\n*1994 – Timothy Cathcart, Northern Irish race car driver (d. 2014)\n\nDeaths\n\n* 984 – Crescentius the Elder, politician and aristocrat\n*1162 – King Haakon II of Norway\n*1285 – Tile Kolup, German impostor claiming to be Frederick II, Holy Roman Emperor\n*1304 – Pope Benedict XI (b. 1240)\n*1307 – Edward I of England (b. 1239)\n*1345 – Momchil, Bulgarian brigand\n*1531 – Tilman Riemenschneider, German sculptor (b. 1460)\n*1568 – William Turner, British ornithologist and botanist (b. 1508)\n*1572 – Sigismund II Augustus, Polish king (b. 1520)\n*1573 – Giacomo Barozzi da Vignola, Italian architect, designed the Church of the Gesù and Villa Farnese (b. 1507)\n*1593 – Mohammed Bagayogo, Malian scholar and academic (b. 1523)\n*1600 – Thomas Lucy, English politician (b. 1532)\n*1607 – Penelope Blount, Countess of Devonshire, English noblewoman (b. 1563)\n*1647 – Thomas Hooker, English minister, founded the Colony of Connecticut (b. 1586)\n*1701 – William Stoughton, American judge and politician, Governor of the Province of Massachusetts Bay (b. 1631)\n*1713 – Henry Compton, English bishop (b. 1632)\n*1718 – Alexei Petrovich, Tsarevich of Russia (b. 1690)\n*1730 – Olivier Levasseur, French pirate (b. 1690)\n*1764 – William Pulteney, 1st Earl of Bath, English politician, Secretary at War (b. 1683)\n*1776 – Jeremiah Markland, English scholar and academic (b. 1693)\n*1790 – François Hemsterhuis, Dutch philosopher and author (b. 1721)\n*1816 – Richard Brinsley Sheridan, Irish playwright and poet (b. 1751)\n*1863 – William Mulready, Irish genre painter (b. 1786)\n*1865 – George Atzerodt (b. 1833)\n*  1865   – David Herold (b. 1842)\n*  1865   – Lewis Payne (b. 1844)\n*  1865   – Mary Surratt (b. 1823)\n*1890 – Henri Nestlé, German businessman, founded Nestlé (b. 1814)\n*1901 – Johanna Spyri, Swiss author (b. 1827)\n*1913 – Edward Burd Grubb, Jr., American general and diplomat, United States Ambassador to Spain (b. 1841)\n*1922 – Cathal Brugha, Irish revolutionary and politician, active in the Easter Rising, Irish War of Independence; first Ceann Comhairle and first President of Dáil Éireann (b. 1874)\n*1925 – Clarence Hudson White, American photographer and educator (b. 1871)\n*1927 – Gösta Mittag-Leffler, Swedish mathematician and academic (b. 1846)\n*1930 – Arthur Conan Doyle, British writer (b. 1859)\n*1932 – Alexander Grin, Russian author (b. 1880)\n*  1932   – Henry Eyster Jacobs, American theologian and educator (b. 1844)\n*1939 – Deacon White, American baseball player and manager (b. 1847)\n*1950 – Fats Navarro, American trumpet player and composer (b. 1923)\n*1955 – Ali Naci Karacan, Turkish journalist and publisher (b. 1896)\n*1956 – Gottfried Benn, German author and poet (b. 1886)\n*1960 – Francis Browne, Irish priest and photographer (b. 1880)\n*1964 – Lillian Copeland, American discus thrower and shot putter (b. 1904)\n*1965 – Moshe Sharett, Ukrainian-Israeli lieutenant and politician, 2nd Prime Minister of Israel (b. 1894)\n*1968 – Jo Schlesser, French race car driver (b. 1928)\n*1971 – Claude Gauvreau, Canadian poet and playwright (b. 1925)\n*1972 – Athenagoras I of Constantinople (b. 1886)\n*1973 – Max Horkheimer, German philosopher and sociologist (b. 1895)\n*  1973   – Veronica Lake, American actress (b. 1922)\n*1976 – Walter Giesler, American soccer player and referee (b. 1910)\n*1978 – Francisco Mendes, Guinea-Bissau lawyer and politician, 1st Prime Minister of Guinea-Bissau (b. 1933)\n*1980 – Dore Schary, American director, producer, and screenwriter (b. 1905)\n*1982 – Bon Maharaja, Indian guru and religious writer (b. 1901)\n*1984 – George Oppen, American poet and author (b. 1908)\n*1987 – Germaine Thyssens-Valentin, Dutch-French pianist (b. 1902)\n*1990 – Bill Cullen, American television panelist and game show host (b. 1920)\n*  1990   – Cazuza, Brazilian singer and songwriter (b. 1958)\n*1993 – Rıfat Ilgaz, Turkish author, poet, and educator (b. 1911)\n*1994 – Carlo Chiti, Italian engineer (b. 1924)\n*  1994   – Cameron Mitchell, American actor (b. 1918)\n*  1994   – Friedrich August Freiherr von der Heydte, German general (b. 1907)\n*1998 – Moshood Abiola, Nigerian businessman and politician (b. 1937)\n*1999 – Julie Campbell Tatham, American author (b. 1908)\n*2000 – Kenny Irwin Jr., American race car driver (b. 1969)\n*2001 – Fred Neil, American singer-songwriter and guitarist (b. 1936)\n*2003 – Izhak Graziani, Bulgarian trumpet player and conductor (b. 1924)\n*2006 – Syd Barrett, English singer-songwriter and guitarist (b. 1946)\n*  2006   – Juan de Ávalos, Spanish sculptor (b. 1911)\n*  2006   – John Money, New Zealand-American psychologist and author (b. 1921)\n*2008 – Bruce Conner, American sculptor, painter, and photographer (b. 1933)\n*  2008   – Dorian Leigh, American model (b. 1917)\n*2011 – Allan W. Eckert, American historian and author (b. 1931)\n*  2011   – Dick Williams, American baseball player, coach, and manager (b. 1929)\n*2012 – Ronaldo Cunha Lima, Brazilian poet and politician (b. 1936)\n*  2012   – Dennis Flemion, American drummer (b. 1955)\n*  2012   – Doris Neal, American baseball player (b. 1928)\n*  2012   – Jerry Norman, American sinologist and linguist (b. 1936)\n*  2012   – Leon Schlumpf, Swiss politician (b. 1927)\n*2013 – Artur Hajzer, Polish mountaineer (b. 1962)\n*  2013   – Robert Hamerton-Kelly, South African-American pastor, theologian, and author (b. 1938)\n*  2013   – Donald J. Irwin, American lawyer and politician, 32nd Mayor of Norwalk, Connecticut (b. 1926)\n*  2013   – Ben Pucci, American football player and sportscaster (b. 1925)\n*2014 – Alfredo Di Stéfano, Argentinian-Spanish footballer and coach (b. 1926)\n*  2014   – Eduard Shevardnadze, Georgian general and politician, 2nd President of Georgia (b. 1928)\n*  2014   – Peter Underwood, Australian lawyer and politician, 27th Governor of Tasmania (b. 1937)\n*2015 – Maria Barroso, Portuguese actress and politician (b. 1925)\n*  2015   – Bob MacKinnon, American basketball player and coach (b. 1927)\n\nHolidays and observances\n\n* Christian feast day:\n** Æthelburh of Faremoutiers\n** Felix of Nantes\n** Illidius\n** Job of Manyava (Ukrainian Orthodox Church)\n** Willibald (Catholic Church)\n** July 7 (Eastern Orthodox liturgics)\n* Independence Day, celebrates the independence of Solomon Islands from the United Kingdom in 1978.\n* Ivan Kupala Day (Belarus, Poland, Russia, Ukraine)\n* Saba Saba Day (Tanzania)\n* Tanabata (Japan)\n* World Chocolate Day. July 7. http://en.wikipedia.org/?curid=15863."
  }
}
