{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6587",
  "eid" : "dc3267a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778449178,
  "textBody" : "Cadillac is a city in the U.S. state of Michigan and is the county seat of Wexford County. The population was 10,355 at the 2010 census. The city is situated at the junction of US 131, M-55 and M-115. The geographic center of Michigan is approximately five miles (8.05 km) north-northwest of Cadillac.[http://www.netstate.com/states/geography/mi_geography.htm Michigan Geography from NETSTATE]. [http://www.netstate.com/ NETSTATE]. Retrieved on January 5, 2008.\n\nCadillac became the county seat after the so-called \"Battle of Manton,\" in which a show of force was involved in enforcing a controversial decision to move the county seat from Manton.\n\nHistory\n\nVillage of Clam Lake\n\nAlthough European explorers and traders visited the area since the 18th century, permanent white communities were not established until some time later. Initial settlements were connected with the logging industry.\n\nIn 1871, Cadillac's first sawmill began operations. Originally called the Pioneer Mill, it was built by John R. Yale. That same year, George A. Mitchell, a prominent Cadillac banker and railroad entrepreneur, and Adam Gallinger, a local carpenter, formed the Clam Lake Canal Improvement and Construction Company. Two years later, the Clam Lake Canal was constructed between Big and Little Clam lakes, present-day Lakes Mitchell and Cadillac. Sawmill owners used the canal to transport timber from Big Clam Lake to the mills and railroad sites—the G.R. & I. Railroad had reached the area in 1872—on Little Clam Lake, in Cadillac.Schindler, Kurt H. (2002) [http://35.8.121.133/wexford_county/factbook/pdfs/Chapter%20B2%20History.pdf Wexford County Factbook, History,]  Chapter B2. [http://www.msue.msu.edu/ MSU Extension]. Retrieved on January 5, 2008\n\nCadillac was originally named Clam Lake and was incorporated as a village in 1874. George Mitchell was elected the first mayor. The village was incorporated as a city in 1877 and renamed Cadillac, after Antoine Laumet de La Mothe, sieur de Cadillac, a Frenchman who made the first permanent settlement at Detroit in 1701.[http://www.cadillac-mi.net/profile_history.php City of Cadillac, History] . [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on January 5, 2008\n\nBattle of Manton\n\nThe Wexford County seat of government, originally located in Sherman, was moved to Manton in 1881, as the result of a compromise between the feuding residents of Cadillac and Sherman. Cadillac partisans, however, won the county seat by county-wide vote in April 1882. The day following the election a sheriff's posse left the city for Manton by special train to seize the county records. After arriving and collecting a portion of the materials, however, an angry crowd confronted the Cadillac men and drove them from the town.[http://www.absolutemichigan.com/dig/michigan/battling-for-the-county-seat/ Battling for the County Seat]. [http://www.absolutemichigan.com/ Absolute Michigan]. Retrieved on January 5, 2008.\n\nWhen the sheriff returned to Cadillac, a force consisting of several hundred armed men was assembled; this group reportedly included a brass band. The Sheriff's force, some of whom may have been intoxicated, traveled back to Manton to seize the remaining records. Although Manton residents confronted the Cadillac men and barricaded the courthouse, the posse successfully seized the documents and, in dubious glory, returned to Cadillac.\n\nCity of Cadillac\n\nIn 1878, Ephraim Shay perfected his Shay locomotive, which was particularly effective in its ability to climb steep grades, maneuver sharp turns and manage imperfections in railroad tracks. Cadillac was home to the Michigan Iron Works Company, which manufactured the Shay locomotive for a short time in the early 1880s.Henderson, Rick (2001). [http://www.shaylocomotives.com/shaypages/EphraimShay.htm Ephraim Shay, the Man]. [http://www.shaylocomotives.com/ Shaylocomotives.com] Retrieved January 5, 2008. It was however the lumber industry that continued to dominate the city, drawing in a large immigrant labor force, most of whom were Swedish (two of Cadillac's sister cities are Mölnlycke, Sweden, and Rovaniemi, Finland).\n\nIn 1899, the Cadillac Club formed, the forerunner of the Cadillac Area Chamber of Commerce.[https://web.archive.org/web/20040107194314/http://cadillac.org/discover/history.htm Cadillac: Where We Came From] Cadillac Area Chamber of Commerce. Retrieved on January 5, 2008 Gradually, various manufacturing firms found success in Cadillac. By the early 20th century, with the lumber depleted, the timber industry was in decline. Industrial development soon dominated the local economy, and it continues to do so today. Cadillac's range of industries includes the manufacture of pleasure boats, automotive parts, water-well components, vacuum cleaners, and rubber products.[https://web.archive.org/web/20030608045839/http://www.cadillac.org/CIF/community.php Cadillac Industrial Fund] Cadillac Area Chamber of Commerce. Retrieved on January 4, 2008\n\nIn 1936, the U.S. Forest Service and the Civilian Conservation Corps created the Caberfae Ski Area, which led to promotion of the area as a tourist center.[http://www.michiganskier.com/cabclub/history.htm Caberfae Ski Club History] Caberfae Ski Club Retrieved January 4, 2008  Caberfae remains in operation today, as the oldest ski resort in the midwest.[http://www.cadillacmichigan.com/pages.php?tabid\n11&pageid44&title\nCadillac+Yesterday Cadillac Area Visitors Bureau, Cadillac Yesterday] . [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau]. Retrieved on January 4, 2008. Tourism has since become an important sector of Cadillac's economy.[http://www.michiganhistorymagazine.com/extra/cadillac/cadillac.html Welcome to Cadillac]  [http://www.michiganhistorymagazine.com/ Michigan History Magazine] Retrieved on January 4, 2008Ingraham, Lesa (July 1, 2002). [http://www.cadillacnews.com/articles/2002/07/01/news/news01.txt Summer Tourism Outlook Favorable]  [http://www.cadillacnews.com/ Cadillac News] Retrieved on January 5, 2008 In the summer, tourists travel to the city for boating, fishing, hiking, mountain biking and camping. During the fall, hunting and color tours are popular.[http://www.michigan.org/travel/drivingtours/detail.asp?cid98295B8C-670C-4B2F-A8D5-85CEF990EF9A&da\ny&m9;1 Cadillac Fall Color Tours.] [http://www.michigan.org/ Michigan.org] Retrieved on January 5, 2005. The winter is possibly the busiest season; the area can be found packed with downhill skiers, cross-country skiers, ice-fishers, snow-shoers and–most of all-snowmobilers.[http://www.snowtracks.com/michigan/cadillac.htm Cadillac, Michigan – Snowmobiling Information]  [http://www.snowtracks.com/ Snowtracks.com] Retrieved January 5, 2008 The North American Snowmobile Festival (NASF) is held on frozen Lake Cadillac every winter.[http://www.cadillacmichigan.com/pages.php?tabid\n14&pageid50&title\nNASF Cadillac Area Visitors Bureau NASF] . [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau,]. Retrieved on January 4, 2008.\n\nThirsty's, a gas station on M-55 west of Cadillac, was the home of Samantha or \"Sam The Bear\" from the 1970s through the late 1990s, when Sam died of old age. Sam was the only brown bear in captivity in the US at the time to hibernate naturally. Sam lived in a large cage in front of the gas station and was fed ice cream cones by tourists every summer.\n\nIn October 1975 the rock group Kiss visited Cadillac and performed at the Cadillac High School gymnasium. They played the concert to honor the Cadillac High School football team. In previous years, the team had compiled a record of sixteen consecutive victories, but the 1974 squad opened the season with two losses. The assistant coach, Jim Neff, an English teacher and rock'n'roll fan, thought to inspire the team by playing Kiss music in the locker room. He also connected the team's game plan, K-I-S-S or \"Keep It Simple Stupid\", with the band. The team went on to win seven straight games and their conference co-championship. After learning of their association with the team's success, the band decided to visit the school and play for the homecoming game.Weinstein, Fannie (1996). [http://www.neffzone.com/kiss/detroit_news_article_about_kiss_.htm The Kiss that Inspired a Small Town Team] . [http://www.neffzone.com/ Neffzone.com]. Retrieved on January 4, 2008.\n\nHistoric landmarks\n\nCadillac maintains a number of state historic landmarks. Most are marked with a green \"Michigan Historical Marker\" sign that includes a description of the landmark. There are six markers within the city limits: 'Cadillac Carnegie Library,' 'Charles T. Mitchell House,' 'Clam Lake Canal,' 'Cobbs & Mitchell Building,' 'Cobbs & Mitchell No. 1' and the 'Shay Locomotive,' which is pictured at the right. Two more are in the near Cadillac area ('Caberfae Ski Resort' and 'Greenwood Disciples of Christ Church') and another two are dispersed in surrounding Wexford County ('Battle of Manton' and '1st Wexford County Court House').[http://www.michmarkers.com/Frameset.htm Michigan Historical Markers] See \"Wexford County.\" Retrieved on January 5, 2008\n\nGeography\n\nTopography\n\nAccording to the United States Census Bureau, the city has a total area of , of which  is land and  is water.\n\nThe 1150 acre Lake Cadillac is entirely within the city limits. The larger, 2580 acre Lake Mitchell is nearby on the west side of the city, with 1760 ft of shoreline within the city's municipal boundary. The lakes were connected by a stream which was replaced in 1873 by the Clam Lake Canal. The canal was featured on Ripley's Believe It or Not in the 1970s due to the phenomenon that in winter the canal freezes before the lakes and then after the lakes freeze, the canal thaws and remains unfrozen for the rest of the winter.[http://www.cadillacmichigan.com/pages.php?tabid9&pageid\n37&title=Frequently+Asked+Questions#4 Cadillac Area Visitors Bureau, FAQ] . [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau]. Retrieved on January 4, 2008.\n\nCadillac sits on the eastern edge of the Manistee National Forest and the surrounding area is heavily wooded with mixed hardwood and conifer forests. A main agricultural industry in the area is Christmas tree farming. Cadillac was chosen in 1988 to donate the holiday tree to sit on the lawn of the U.S. Capitol building in Washington D.C.\n\nThe area surrounding Cadillac is primarily rural, and is considered to be part of Northern Michigan. The small size of nearby communities make the city a major commercial and industrial hub of the region.Schindler, Kurt H. (2002). [http://35.8.121.133/wexford_county/factbook/pdfs/Chapter%20B8%20Population.pdf Wexford County Factbook, Population,]  Chapter B8. [http://www.msue.msu.edu/ MSU Extension]. Retrieved on January 5, 2008\n\nCityscape\n\nThe commercial center of the city is located on the eastern edge of Lake Cadillac. Most downtown buildings range from two to five stories in height and face the traditional corridor of travel through town, Mitchell Street, the city's tree-lined main street. The downtown contains a movie theater, gift shops, restaurants, a bookstore, specialty food stores, jewelers, clothing retailers and various other businesses.[http://www.downtowncadillac.com/directory.html Downtown Cadillac Business Directory]  [http://www.downtowncadillac.com/ Downtown Cadillac Association] Retrieved on July 3, 2008[http://www.cadillacmichigan.com/pages.php?tabid13&pageid\n47&titleThings+To+Do Cadillac Area Activities and Attractions]  [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau] Retrieved on January 5, 2008 The Courthouse Hill Historic District, established in April 2005, lies adjacent to the city's commercial center. The District contains a number of large Victorian-style residences built by the lumber barons and businessmen who helped establish the city in the 1870s.[http://www.cadillac-mi.net/index.asp?NID\n126 Cadillac's Courthouse Hill Historic District] [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on January 5, 2008 Population and building density is highest in this area.[http://factfinder.census.gov/servlet/ThematicMapFramesetServlet?_bmy&-_MapEvent\ndisplayBy&-errMsg&-_useSS\nN&-_dBy150&-redoLog\nfalse&-_zoomLevel&-tm_name\nDEC_2000_SF1_U_M00090&-tm_configb\n50|len|t\n4001|zf0.0|ms\nthm_def|dw0.1397926221024198|dh\n0.07458776315041693|dtgov.census.aff.domain.map.EnglishMapExtent|if\ngif|cx-85.416605|cy\n44.2541885|zl4|pz\n4|bo|bl\n|ft350:349:335:389:388:332:331|fl\n403:381:204:380:369:379:368|g16000US2612320|ds\nDEC_2000_SF1_U|sb50|tud\nfalse|db100|mn\n0|mx41250|cc\n1|cm1|cn\n5|cb|um\nPersons/Sq%20 Mile|pr0|th\nDEC_2000_SF1_U_M00090|sfN|sg\n&-PANEL_IDtm_result&-_pageY\n&-_langen&-geo_id\n16000US2612320&-_pageX&-_mapY\n&-_mapX&-_latitude\n&-_pan&-ds_name\nDEC_2000_SF1_U&-_longitude&-_changeMap\nIdentify Cadillac city, Michigan by Block Group: Persons per Square Mile]   [https://www.census.gov/ U.S. Census] Retrieved on July 3, 2008\n\nOn the western portion of Lake Cadillac, where M-55 intersects M-115, is what is locally referred to as Cadillac West. This is a small commercial district, bordering Mitchell State Park and the two lakes, which caters mostly to tourists. It contains a number of motels and restaurants.For evidence on the usage of the name Cadillac West and the commercial features of the district, look for descriptions in local websites such as [http://www.northguide.com/cgi-bin/snowmobile/cadillac.pl Cadillac Area Snowmobile Lodging Guide] and [http://www.visitcadillac.com/lodging/ Cadillac Area Lodging.] Retrieved on January 5, 2008\n\nAlong the northern and southern stretches of the lake are the residential areas of the city. They are generally of low to moderate density, characterized primarily by single family structures.[http://www.liaa.info/wexford/standard_maps.asp City of Cadillac Zoning]  [http://www.freewebs.com/wexfordgis/ Wexford County GIS]  Retrieved on July 3, 2008\n\nClimate\n\nCadillac experiences a typical northern Michigan climate, undergoing temperate seasonal changes, influenced by the presence of Lake Michigan and the inevitable lake effect. Winters are generally cold with large amounts of snowfall. Summers are warm.[http://www.michiganvacations.com/regions/Cadillac-Michigan.html Cadillac Weather & Climate (2006)]. Michigan Vacations (accessed July 20, 2006). The average high temperature in July is 80 °F (27 °C) and the average low is in February, at 9 °F (−13 °C). Summer temperatures can exceed 90 °F (32 °C), and winter temperatures can drop below 0 °F (−18 °C). Average annual rainfall is 30 inches (76 cm), and average annual snowfall is 81 inches (206 cm) . Snowfall typically occurs between the months of November and March.  According to the Köppen Climate Classification system, Cadillac has a humid continental climate, abbreviated \"Dfb\" on climate maps.\n\nSuperfund sites\n\nCadillac is also home to two superfund sites according to the U.S. Environmental Protection Agency. One located at 1100 Wright Street, the former home of Kysor Industrial Corp. The other is located at 1002 6th Street, the former home of Northernaire Plating.\n\nDemographics\n\n2010 census\n\nAs of the census of 2010, there were 10,355 people, 4,280 households, and 2,625 families residing in the city. The population density was . There were 4,927 housing units at an average density of . The racial makeup of the city was 95.6% White, 0.5% African American, 0.6% Native American, 1.0% Asian, 0.4% from other races, and 1.8% from two or more races. Hispanic or Latino of any race were 1.8% of the population.\n\nThere were 4,280 households of which 32.9% had children under the age of 18 living with them, 39.2% were married couples living together, 16.4% had a female householder with no husband present, 5.7% had a male householder with no wife present, and 38.7% were non-families. 32.0% of all households were made up of individuals and 14% had someone living alone who was 65 years of age or older. The average household size was 2.34 and the average family size was 2.90.\n\nThe median age in the city was 36.5 years. 24.7% of residents were under the age of 18; 10% were between the ages of 18 and 24; 24.4% were from 25 to 44; 23.8% were from 45 to 64; and 17.1% were 65 years of age or older. The gender makeup of the city was 47.4% male and 52.6% female.\n\n2000 census\n\nAs of the census of 2000, there were 10,000 people, 4,118 households, and 2,577 families residing in the city. The population density was 1,466.0 per square mile (566.1/km²). There were 4,466 housing units at an average density of 654.7 per square mile (252.8/km²). The racial makeup of the city was 96.55% White, 0.21% Black or African American, 0.92% Native American, 0.63% Asian, 0.03% Pacific Islander, 0.28% from other races, and 1.38% from two or more races. 1.18% of the population were Hispanic or Latino of any race.\n\nThere were 4,118 households out of which 32.2% had children under the age of 18 living with them, 43.9% were married couples living together, 14.2% had a female householder with no husband present, and 37.4% were non-families. 31.8% of all households were made up of individuals and 14.4% had someone living alone who was 65 years of age or older. The average household size was 2.37 and the average family size was 2.96.\n\nIn the city, the population was spread out with 26.2% under the age of 18, 9.6% from 18 to 24, 27.9% from 25 to 44, 19.6% from 45 to 64, and 16.7% who were 65 years of age or older. The median age was 36 years. For every 100 females there were 91.4 males. For every 100 females age 18 and over, there were 84.4 males.\n\nThe median income for a household in the city was $29,899, and the median income for a family was $36,825. Males had a median income of $29,773 versus $21,283 for females. The per capita income for the city was $16,801. About 10.9% of families and 13.7% of the population were below the poverty line, including 15.4% of those under age 18 and 13.3% of those age 65 or over.\n\nGovernment\n\nCadillac was incorporated as a city in 1877. It is a home rule city with a Council-Manager form of government-one.[http://www.cadillac-mi.com/CadillacBook/gov.html Cadillac, The Community: Government] , Retrieved on March 23, 2010\n\nCurrent Council members are Shari Spoelman, Antoinette Schippers, Arthur Stevens, James Dean and Carla Filkins(Mayor). The present City Manager is Marcus Peccia.[http://www.cadillac-mi.net/index.aspx?NID=31 Administration] [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on March 23, 2010\n\nCadillac is located in Michigan's 2nd congressional district, represented by Republican Bill Huizenga.[http://huizenga.house.gov/ U.S. Congressman Bill Huizenga] Official website of Bill Huizenga.\n\nEconomy\n\nManufacturing has been the greatest employer in Cadillac since the logging industry. Presently, over 26% of the city's labor force is employed in manufacturing.[http://factfinder.census.gov/servlet/QTTable?_bmy&-geo_id\n16000US2612320&-qr_nameDEC_2000_SF3_U_DP3&-ds_name\nDEC_2000_SF3_U&-_langen&-_sse\non 2000 U.S. Census Data]  [https://www.census.gov/ U.S. Census] Retrieved on January 5, 2008 There are three industrial parks within the city limits, comprising 7% of the total land use in Cadillac and 47% of the city's tax base.[http://www.cadillac-mi.net/economic_development/industrial_parks/BusinessClimateTestimonials.htm City of Cadillac Industrial Parks]  [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on January 5, 2008 Much of the city's economic performance is determined by the fortunes of local industry.\n\nMajor manufacturers include Four Winns, AAR Manufacturing, Avon Rubber, FIAMM Technologies, Michigan Rubber Products and Rexair.\n\nThe center of the city is generally perceived to have a \"small-town-feel.\"Whetstone, Matt (December 7, 2007). [https://archive.is/20120728115506/http://www.cadillacnews.com/articles/2007/12/07/news/107766.txt Survey says: Cadillac good, improvement needed] [http://www.cadillacnews.com/ Cadillac News] Retrieved on January 5, 2008 In the summer, the downtown fills with tourists, many of whom are from southern Michigan. The city center is in fact only one block from Lake Cadillac and, by docking at the public docks, is as nearly accessible by boat as it is by car. The city's immediate proximity to two lakes, as well as Manistee National Forest, Pere Marquette State Forest, Mitchell State Park and a number of major highways ensures that tourism occupies a significant sector of the local economy.\n\nDuring the winter months Lake Cadillac and Lake Mitchell freeze over and the city becomes covered with snow. Cadillac is connected to a number of trail systems heavily used by winter recreation enthusiasts, and the city itself integrates unusually well into the corridors of travel created by snowmobilers.For details on popular trails, see [http://www.visitcadillac.com/snowmobile Cadillac Snowmobiling] Retrieved on January 5, 2008\n\nCadillac is also known as Chestnut Town, USA. The local area is home to a relatively large number of American chestnut trees, planted by pioneers from New York and Pennsylvania who settled in western Michigan. A blight in the early 20th century wiped out nearly every American Chestnut tree, but those in western Michigan developed a mysterious resistance and survived.\n\nLou Gehrig's Disease\n\nBased on a single, limited study involving twenty people, some people have labeled Cadillac as one of three \"hot spots\" for Lou Gehrig's Disease in the US. However, the study made no attempt to ascertain the occurrence of the disease in other parts of the state, or elsewhere in the country. The study was designed to examine the possible occurrence of the disease due to genetic influences. The occurrence of the disease within the city limits of Cadillac is reportedly over 100 times the normal rate. The cause of the abnormally large occurrence of the disease in Cadillac remains unknown.Kaminski, Frank (March 14, 2003). [http://www.cns.jrn.msu.edu/articles/2003_0314/DISEASE.html Disease Rates in Greenville, Cadillac Puzzle Scientists.]  Capital News Service. Retrieved on January 5, 2008\n\nEducation\n\nCadillac's public education system has a total of 10 schools, with approximately 3,100 students and 166 teachers with a student:teacher ratio of 19.1:1. Cadillac has 4 private primary and secondary schools with approximately 394 students, 20 teachers and a student:teacher ratio of 20:1.[http://www.localschooldirectory.com/city-schools/Cadillac/MI] LocalSchoolDirectory\n\nCadillac Area Public Schools (CAPS)\n\nThe city has two high schools: Cadillac High School and Innovation High School. The area also has a junior high school, covering grades 7 and 8, located adjacent to the high school, and a middle school, Mackinaw Trail Middle School, covering grades 5 and 6.  There are four elementary schools, Forest View Elementary, Franklin Elementary, Kenwood Elementary, and Lincoln Elementary.[http://vikingnet.org/ Vikingnet] VikingNet\n\nCadillac also has an alternative high school, located in the building that formerly housed Cooley Elementary School. Adult high school and GED courses are offered there as well. As a whole, the programs at Cooley are part of a curriculum that aids individuals in overcoming the exceptional obstacles to their educational and workforce goals.\n\nVocational career training is available to high school students free of charge in Cadillac and nearby schools at Wexford-Missaukee Independent School District (ISD) Career Tech Center (formerly Wexford-Missaukee Vocational Center or Voc-Tech). Students are bussed for part of the day to the Career Tech Center from their respective schools and receive credits toward high school graduation. Students are also able to earn certification in a chosen trade. Courses include:\n\n*Agriscience\n*Allied Heath Technologies\n*Automotive\n*Building Trades\n*Business Management and Administration\n*Computers and Electronics\n*Digital Media Productions\n*Electrical Occupations (formally Robotics and Automation)\n*Heavy Equipment\n*Hospitality Retailing and Entrepreneureship\n*Machine Trades\n*Metal Fabrication\n*Power sports and Equipment\n\nCosmetology is offered through the Career Tech Center, but at an off-campus location in downtown Cadillac. Adults can attend the vocational or cosmetology school with tuition or financial aid for certification.[http://www.publicschoolreview.com/school_ov/school_id/92015] PublicSchoolReview \n\nCadillac hosts the Wexford-Missaukee ISD Special Education for residents of the two counties who are in need of special services. This school is on the same campus as the Career Tech Center.\n\nThe class of 2006 was the largest class to go through Cadillac Public Schools.\n\nPrivate schools\n\nCadillac offers several options for private religious education.[http://www.privateschoolreview.com/county_private_schools/stateid/MI/county/26165] privateschoolreview\n\nCadillac Heritage Christian offers nondenominational Christian education from pre-K through 12th grade. It is a coed school with 98 students and a teacher:student ratio of 1:11. Graduating classes are typically between 3–12 students.\n\nNorthview SDA Christian School has 5 students in grades 1–9. It is a coed Seventh Day Adventist school.\n\nNoah's Ark Day School is a small alternative non-denominational Christian school for students in pre-K through first grade only. It is coed with 42 students and 1 teacher.\n\nCadillac's largest and most well-known private school is St. Ann School, a coed private Roman Catholic school with 236 students in grades pre-K through 7. The teacher:student ratio is 1:26. St. Ann is a member of the National Catholic Education Association. No Catholic high school education is offered at St. Ann School, and students typically attend public school for grades 8–12.\n\nTraining schools\n\nNorthwoods Aviation, located at Wexford County Airport, offers training programs for piloting and servicing aircraft. Northwoods Aviation also offers primary instruction for those interested in sport pilot, private, and commercial certificates.[http://northwoodsaviation.com/] Northwoods Aviation\n\nThe Cadillac Institute of Cosmetology (formerly Cadillac Academy of Beauty) is a full service teaching salon in downtown Cadillac that offers training for general cosmetologists and specialized technicians to high school students through a partnership with Wexford-Missaukee Intermediate School District. Training is also available to adult students though private courses on a tuition basis. Upon completion of the program, students are qualified to take the state board exam to become a licensed cosmetologist or specialty technician.\n\nColleges\n\nThe Baker College-Cadillac campus occupies 66 acre just outside the City of Cadillac. The school has an enrollment of more than 1,300 students and offers Associate's and bachelor's degrees, in addition to professional certifications.[http://www.baker.edu/campusresources/Cadillac/cacinfo.cfm Baker College-Cadillac]. Online profile. Retrieved on January 5, 2005 \n\nTransportation\n\nMajor highways\n\nCadillac is situated as the confluence of three highways: US 131, M-55 and M-115. Prior to 2001, the northern end of the freeway portion of US 131 was located at the southern entrance to Cadillac. With the construction of a bypass, the US 131 freeway was extended around the east side of the city. The former route of the highway through downtown Cadillac was redesignated as BUS US 131. In the city, BUS US 131 is named Mitchell Street, after George Mitchell, but may be referred to as main street.\n\n* bypasses the city to the east. The freeway continues southerly toward Big Rapids and Grand Rapids and northerly toward Manton before transitioning to a two-lane highway for the remainder of the distance to Petoskey.\n*, a loop route through downtown, running largely along the former route of US 131 through the city.\n* is a major two-lane east-west route across the state, connecting with Manistee on the west and Lake City, Houghton Lake, West Branch, and Tawas City on the east.\n*, another major two-lane route, runs diagonally from Clare to the southeast to Frankfort to the northwest.\n\nRail\n\nThe city is serviced by rail via the Great Lakes Central Railroad. This is primarily a freight line, although passenger service is expected in the future.[https://web.archive.org/web/20080905150026/http://www.glcrailroad.com/passenger.aspx Great Lakes Central Railroad.] [http://www.glcrailroad.com/ GLC] Retrieved on March 4, 2009\n\nPublic transit\n\n*Cadillac and Wexford County jointly operate a local public bus service. The [http://www.cwta.us/ Cadillac/Wexford Transit Authority (CWTA)] is a demand-response, public transportation system, and has been in operation since 1974.[http://www.michigan.gov/mdot/0,1607,7-151-9625_21607-162305--,00.html Cadillac/Wexford Transportation Authority] [http://www.michigan.gov/mdot/ Michigan Department of Transportation] Retrieved on January 5, 2008\n*Indian Trails provides daily intercity bus service between Grand Rapids, Michigan and St. Ignace, Michigan and stops in Cadillac.\n\nNon-motorized transportation\n\nThe White Pine Trail's northern terminus is in Cadillac. The trail, which stretches 92 mi and originates from Comstock Park, follows an abandoned railroad bed into the center of the city. The trail is paved from the village of Leroy 16 miles north to Cadillac.[http://www.whitepinetrail.com/about Trail Surface]  [http://www.whitepinetrail.com/ White Pine Trail] Retrieved on March 5, 2009\n\nLocal media\n\nNewspapers\n\n*The Cadillac News\n\nRadio\n\n*WTCM (580 am, Traverse City) – news and talk\n*WLDR (1210 am, Kingsley-Traverse City) – classic country\n*WATT (1240 am) – news and talk\n*WLJW (1370 am) – religious\n*WIAA (88.7 FM, Interlochen) – classical music \"IPR Music Radio\"\n*WOLW (91.1 FM) – religious \"Northern Christian Radio\"\n*WGCP (91.9 FM) – religious \"3ABN Radio\"\n*WJZQ (92.9 FM) – Top 40 \"Z-93\"\n*WKAD (93.7 FM) – \"The Ticket\" (Fox Sports Radio)\n*WLXV (96.7 FM) – 96.7 The Bull\n*WUPS (98.5 FM, Houghton Lake) – classic hits\n*WLDR (101.9 FM, Traverse City) – country music \"101.9 Sunny Country\"\n*WTCM (103.5 FM, Traverse City) – country music\n*WAIR (104.9 FM) – contemporary Christian \"Smile-FM\"\n*WCKC (107.1 FM) – classic rock \"The Drive\"\n*WCDY (107.9 FM) – hot AC \"107.9 CDY\"\n\nTelevision\n\n*WPBN (Channel 7, Traverse City) – NBC\n*WWTV (Channel 9) – CBS\n*WMNN (Channel 26) – Independent\n*WCMV (Channel 27) – PBS\n*WGTU (Channel 29, Traverse City) – ABC\n*WFQX (Channel 32) – Fox\n\nNotable people \n\n* Jim Bowman, NFL player\n* Larry Joe Campbell, actor (According to Jim); born in Cadillac\n* Reed Cowan, journalist\n* Robert Dorigo Jones, writer\n* George A. Mitchell, father of the city of Cadillac (first developer).\n* Jackie Swanson, actress (Cheers), attended high school in Cadillac\n* Guy Vander Jagt, U.S. congressman from Michigan's 9th congressional district; born in Cadillac\n* Luke Winslow-King, musician; born in Cadillac",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cadillac, Michigan" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6587" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cadillac is a city in the U.S. state of Michigan and is the county seat of Wexford County. The population was 10,355 at the 2010 census. The city is situated at the junction of US 131, M-55 and M-115. The geographic center of Michigan is approximately five miles (8.05 km) north-northwest of Cadillac.[http://www.netstate.com/states/geography/mi_geography.htm Michigan Geography from NETSTATE]. [http://www.netstate.com/ NETSTATE]. Retrieved on January 5, 2008.\n\nCadillac became the county seat after the so-called \"Battle of Manton,\" in which a show of force was involved in enforcing a controversial decision to move the county seat from Manton.\n\nHistory\n\nVillage of Clam Lake\n\nAlthough European explorers and traders visited the area since the 18th century, permanent white communities were not established until some time later. Initial settlements were connected with the logging industry.\n\nIn 1871, Cadillac's first sawmill began operations. Originally called the Pioneer Mill, it was built by John R. Yale. That same year, George A. Mitchell, a prominent Cadillac banker and railroad entrepreneur, and Adam Gallinger, a local carpenter, formed the Clam Lake Canal Improvement and Construction Company. Two years later, the Clam Lake Canal was constructed between Big and Little Clam lakes, present-day Lakes Mitchell and Cadillac. Sawmill owners used the canal to transport timber from Big Clam Lake to the mills and railroad sites—the G.R. & I. Railroad had reached the area in 1872—on Little Clam Lake, in Cadillac.Schindler, Kurt H. (2002) [http://35.8.121.133/wexford_county/factbook/pdfs/Chapter%20B2%20History.pdf Wexford County Factbook, History,]  Chapter B2. [http://www.msue.msu.edu/ MSU Extension]. Retrieved on January 5, 2008\n\nCadillac was originally named Clam Lake and was incorporated as a village in 1874. George Mitchell was elected the first mayor. The village was incorporated as a city in 1877 and renamed Cadillac, after Antoine Laumet de La Mothe, sieur de Cadillac, a Frenchman who made the first permanent settlement at Detroit in 1701.[http://www.cadillac-mi.net/profile_history.php City of Cadillac, History] . [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on January 5, 2008\n\nBattle of Manton\n\nThe Wexford County seat of government, originally located in Sherman, was moved to Manton in 1881, as the result of a compromise between the feuding residents of Cadillac and Sherman. Cadillac partisans, however, won the county seat by county-wide vote in April 1882. The day following the election a sheriff's posse left the city for Manton by special train to seize the county records. After arriving and collecting a portion of the materials, however, an angry crowd confronted the Cadillac men and drove them from the town.[http://www.absolutemichigan.com/dig/michigan/battling-for-the-county-seat/ Battling for the County Seat]. [http://www.absolutemichigan.com/ Absolute Michigan]. Retrieved on January 5, 2008.\n\nWhen the sheriff returned to Cadillac, a force consisting of several hundred armed men was assembled; this group reportedly included a brass band. The Sheriff's force, some of whom may have been intoxicated, traveled back to Manton to seize the remaining records. Although Manton residents confronted the Cadillac men and barricaded the courthouse, the posse successfully seized the documents and, in dubious glory, returned to Cadillac.\n\nCity of Cadillac\n\nIn 1878, Ephraim Shay perfected his Shay locomotive, which was particularly effective in its ability to climb steep grades, maneuver sharp turns and manage imperfections in railroad tracks. Cadillac was home to the Michigan Iron Works Company, which manufactured the Shay locomotive for a short time in the early 1880s.Henderson, Rick (2001). [http://www.shaylocomotives.com/shaypages/EphraimShay.htm Ephraim Shay, the Man]. [http://www.shaylocomotives.com/ Shaylocomotives.com] Retrieved January 5, 2008. It was however the lumber industry that continued to dominate the city, drawing in a large immigrant labor force, most of whom were Swedish (two of Cadillac's sister cities are Mölnlycke, Sweden, and Rovaniemi, Finland).\n\nIn 1899, the Cadillac Club formed, the forerunner of the Cadillac Area Chamber of Commerce.[https://web.archive.org/web/20040107194314/http://cadillac.org/discover/history.htm Cadillac: Where We Came From] Cadillac Area Chamber of Commerce. Retrieved on January 5, 2008 Gradually, various manufacturing firms found success in Cadillac. By the early 20th century, with the lumber depleted, the timber industry was in decline. Industrial development soon dominated the local economy, and it continues to do so today. Cadillac's range of industries includes the manufacture of pleasure boats, automotive parts, water-well components, vacuum cleaners, and rubber products.[https://web.archive.org/web/20030608045839/http://www.cadillac.org/CIF/community.php Cadillac Industrial Fund] Cadillac Area Chamber of Commerce. Retrieved on January 4, 2008\n\nIn 1936, the U.S. Forest Service and the Civilian Conservation Corps created the Caberfae Ski Area, which led to promotion of the area as a tourist center.[http://www.michiganskier.com/cabclub/history.htm Caberfae Ski Club History] Caberfae Ski Club Retrieved January 4, 2008  Caberfae remains in operation today, as the oldest ski resort in the midwest.[http://www.cadillacmichigan.com/pages.php?tabid\n11&pageid44&title\nCadillac+Yesterday Cadillac Area Visitors Bureau, Cadillac Yesterday] . [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau]. Retrieved on January 4, 2008. Tourism has since become an important sector of Cadillac's economy.[http://www.michiganhistorymagazine.com/extra/cadillac/cadillac.html Welcome to Cadillac]  [http://www.michiganhistorymagazine.com/ Michigan History Magazine] Retrieved on January 4, 2008Ingraham, Lesa (July 1, 2002). [http://www.cadillacnews.com/articles/2002/07/01/news/news01.txt Summer Tourism Outlook Favorable]  [http://www.cadillacnews.com/ Cadillac News] Retrieved on January 5, 2008 In the summer, tourists travel to the city for boating, fishing, hiking, mountain biking and camping. During the fall, hunting and color tours are popular.[http://www.michigan.org/travel/drivingtours/detail.asp?cid98295B8C-670C-4B2F-A8D5-85CEF990EF9A&da\ny&m9;1 Cadillac Fall Color Tours.] [http://www.michigan.org/ Michigan.org] Retrieved on January 5, 2005. The winter is possibly the busiest season; the area can be found packed with downhill skiers, cross-country skiers, ice-fishers, snow-shoers and–most of all-snowmobilers.[http://www.snowtracks.com/michigan/cadillac.htm Cadillac, Michigan – Snowmobiling Information]  [http://www.snowtracks.com/ Snowtracks.com] Retrieved January 5, 2008 The North American Snowmobile Festival (NASF) is held on frozen Lake Cadillac every winter.[http://www.cadillacmichigan.com/pages.php?tabid\n14&pageid50&title\nNASF Cadillac Area Visitors Bureau NASF] . [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau,]. Retrieved on January 4, 2008.\n\nThirsty's, a gas station on M-55 west of Cadillac, was the home of Samantha or \"Sam The Bear\" from the 1970s through the late 1990s, when Sam died of old age. Sam was the only brown bear in captivity in the US at the time to hibernate naturally. Sam lived in a large cage in front of the gas station and was fed ice cream cones by tourists every summer.\n\nIn October 1975 the rock group Kiss visited Cadillac and performed at the Cadillac High School gymnasium. They played the concert to honor the Cadillac High School football team. In previous years, the team had compiled a record of sixteen consecutive victories, but the 1974 squad opened the season with two losses. The assistant coach, Jim Neff, an English teacher and rock'n'roll fan, thought to inspire the team by playing Kiss music in the locker room. He also connected the team's game plan, K-I-S-S or \"Keep It Simple Stupid\", with the band. The team went on to win seven straight games and their conference co-championship. After learning of their association with the team's success, the band decided to visit the school and play for the homecoming game.Weinstein, Fannie (1996). [http://www.neffzone.com/kiss/detroit_news_article_about_kiss_.htm The Kiss that Inspired a Small Town Team] . [http://www.neffzone.com/ Neffzone.com]. Retrieved on January 4, 2008.\n\nHistoric landmarks\n\nCadillac maintains a number of state historic landmarks. Most are marked with a green \"Michigan Historical Marker\" sign that includes a description of the landmark. There are six markers within the city limits: 'Cadillac Carnegie Library,' 'Charles T. Mitchell House,' 'Clam Lake Canal,' 'Cobbs & Mitchell Building,' 'Cobbs & Mitchell No. 1' and the 'Shay Locomotive,' which is pictured at the right. Two more are in the near Cadillac area ('Caberfae Ski Resort' and 'Greenwood Disciples of Christ Church') and another two are dispersed in surrounding Wexford County ('Battle of Manton' and '1st Wexford County Court House').[http://www.michmarkers.com/Frameset.htm Michigan Historical Markers] See \"Wexford County.\" Retrieved on January 5, 2008\n\nGeography\n\nTopography\n\nAccording to the United States Census Bureau, the city has a total area of , of which  is land and  is water.\n\nThe 1150 acre Lake Cadillac is entirely within the city limits. The larger, 2580 acre Lake Mitchell is nearby on the west side of the city, with 1760 ft of shoreline within the city's municipal boundary. The lakes were connected by a stream which was replaced in 1873 by the Clam Lake Canal. The canal was featured on Ripley's Believe It or Not in the 1970s due to the phenomenon that in winter the canal freezes before the lakes and then after the lakes freeze, the canal thaws and remains unfrozen for the rest of the winter.[http://www.cadillacmichigan.com/pages.php?tabid9&pageid\n37&title=Frequently+Asked+Questions#4 Cadillac Area Visitors Bureau, FAQ] . [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau]. Retrieved on January 4, 2008.\n\nCadillac sits on the eastern edge of the Manistee National Forest and the surrounding area is heavily wooded with mixed hardwood and conifer forests. A main agricultural industry in the area is Christmas tree farming. Cadillac was chosen in 1988 to donate the holiday tree to sit on the lawn of the U.S. Capitol building in Washington D.C.\n\nThe area surrounding Cadillac is primarily rural, and is considered to be part of Northern Michigan. The small size of nearby communities make the city a major commercial and industrial hub of the region.Schindler, Kurt H. (2002). [http://35.8.121.133/wexford_county/factbook/pdfs/Chapter%20B8%20Population.pdf Wexford County Factbook, Population,]  Chapter B8. [http://www.msue.msu.edu/ MSU Extension]. Retrieved on January 5, 2008\n\nCityscape\n\nThe commercial center of the city is located on the eastern edge of Lake Cadillac. Most downtown buildings range from two to five stories in height and face the traditional corridor of travel through town, Mitchell Street, the city's tree-lined main street. The downtown contains a movie theater, gift shops, restaurants, a bookstore, specialty food stores, jewelers, clothing retailers and various other businesses.[http://www.downtowncadillac.com/directory.html Downtown Cadillac Business Directory]  [http://www.downtowncadillac.com/ Downtown Cadillac Association] Retrieved on July 3, 2008[http://www.cadillacmichigan.com/pages.php?tabid13&pageid\n47&titleThings+To+Do Cadillac Area Activities and Attractions]  [http://www.cadillacmichigan.com/ Cadillac Area Visitors Bureau] Retrieved on January 5, 2008 The Courthouse Hill Historic District, established in April 2005, lies adjacent to the city's commercial center. The District contains a number of large Victorian-style residences built by the lumber barons and businessmen who helped establish the city in the 1870s.[http://www.cadillac-mi.net/index.asp?NID\n126 Cadillac's Courthouse Hill Historic District] [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on January 5, 2008 Population and building density is highest in this area.[http://factfinder.census.gov/servlet/ThematicMapFramesetServlet?_bmy&-_MapEvent\ndisplayBy&-errMsg&-_useSS\nN&-_dBy150&-redoLog\nfalse&-_zoomLevel&-tm_name\nDEC_2000_SF1_U_M00090&-tm_configb\n50|len|t\n4001|zf0.0|ms\nthm_def|dw0.1397926221024198|dh\n0.07458776315041693|dtgov.census.aff.domain.map.EnglishMapExtent|if\ngif|cx-85.416605|cy\n44.2541885|zl4|pz\n4|bo|bl\n|ft350:349:335:389:388:332:331|fl\n403:381:204:380:369:379:368|g16000US2612320|ds\nDEC_2000_SF1_U|sb50|tud\nfalse|db100|mn\n0|mx41250|cc\n1|cm1|cn\n5|cb|um\nPersons/Sq%20 Mile|pr0|th\nDEC_2000_SF1_U_M00090|sfN|sg\n&-PANEL_IDtm_result&-_pageY\n&-_langen&-geo_id\n16000US2612320&-_pageX&-_mapY\n&-_mapX&-_latitude\n&-_pan&-ds_name\nDEC_2000_SF1_U&-_longitude&-_changeMap\nIdentify Cadillac city, Michigan by Block Group: Persons per Square Mile]   [https://www.census.gov/ U.S. Census] Retrieved on July 3, 2008\n\nOn the western portion of Lake Cadillac, where M-55 intersects M-115, is what is locally referred to as Cadillac West. This is a small commercial district, bordering Mitchell State Park and the two lakes, which caters mostly to tourists. It contains a number of motels and restaurants.For evidence on the usage of the name Cadillac West and the commercial features of the district, look for descriptions in local websites such as [http://www.northguide.com/cgi-bin/snowmobile/cadillac.pl Cadillac Area Snowmobile Lodging Guide] and [http://www.visitcadillac.com/lodging/ Cadillac Area Lodging.] Retrieved on January 5, 2008\n\nAlong the northern and southern stretches of the lake are the residential areas of the city. They are generally of low to moderate density, characterized primarily by single family structures.[http://www.liaa.info/wexford/standard_maps.asp City of Cadillac Zoning]  [http://www.freewebs.com/wexfordgis/ Wexford County GIS]  Retrieved on July 3, 2008\n\nClimate\n\nCadillac experiences a typical northern Michigan climate, undergoing temperate seasonal changes, influenced by the presence of Lake Michigan and the inevitable lake effect. Winters are generally cold with large amounts of snowfall. Summers are warm.[http://www.michiganvacations.com/regions/Cadillac-Michigan.html Cadillac Weather & Climate (2006)]. Michigan Vacations (accessed July 20, 2006). The average high temperature in July is 80 °F (27 °C) and the average low is in February, at 9 °F (−13 °C). Summer temperatures can exceed 90 °F (32 °C), and winter temperatures can drop below 0 °F (−18 °C). Average annual rainfall is 30 inches (76 cm), and average annual snowfall is 81 inches (206 cm) . Snowfall typically occurs between the months of November and March.  According to the Köppen Climate Classification system, Cadillac has a humid continental climate, abbreviated \"Dfb\" on climate maps.\n\nSuperfund sites\n\nCadillac is also home to two superfund sites according to the U.S. Environmental Protection Agency. One located at 1100 Wright Street, the former home of Kysor Industrial Corp. The other is located at 1002 6th Street, the former home of Northernaire Plating.\n\nDemographics\n\n2010 census\n\nAs of the census of 2010, there were 10,355 people, 4,280 households, and 2,625 families residing in the city. The population density was . There were 4,927 housing units at an average density of . The racial makeup of the city was 95.6% White, 0.5% African American, 0.6% Native American, 1.0% Asian, 0.4% from other races, and 1.8% from two or more races. Hispanic or Latino of any race were 1.8% of the population.\n\nThere were 4,280 households of which 32.9% had children under the age of 18 living with them, 39.2% were married couples living together, 16.4% had a female householder with no husband present, 5.7% had a male householder with no wife present, and 38.7% were non-families. 32.0% of all households were made up of individuals and 14% had someone living alone who was 65 years of age or older. The average household size was 2.34 and the average family size was 2.90.\n\nThe median age in the city was 36.5 years. 24.7% of residents were under the age of 18; 10% were between the ages of 18 and 24; 24.4% were from 25 to 44; 23.8% were from 45 to 64; and 17.1% were 65 years of age or older. The gender makeup of the city was 47.4% male and 52.6% female.\n\n2000 census\n\nAs of the census of 2000, there were 10,000 people, 4,118 households, and 2,577 families residing in the city. The population density was 1,466.0 per square mile (566.1/km²). There were 4,466 housing units at an average density of 654.7 per square mile (252.8/km²). The racial makeup of the city was 96.55% White, 0.21% Black or African American, 0.92% Native American, 0.63% Asian, 0.03% Pacific Islander, 0.28% from other races, and 1.38% from two or more races. 1.18% of the population were Hispanic or Latino of any race.\n\nThere were 4,118 households out of which 32.2% had children under the age of 18 living with them, 43.9% were married couples living together, 14.2% had a female householder with no husband present, and 37.4% were non-families. 31.8% of all households were made up of individuals and 14.4% had someone living alone who was 65 years of age or older. The average household size was 2.37 and the average family size was 2.96.\n\nIn the city, the population was spread out with 26.2% under the age of 18, 9.6% from 18 to 24, 27.9% from 25 to 44, 19.6% from 45 to 64, and 16.7% who were 65 years of age or older. The median age was 36 years. For every 100 females there were 91.4 males. For every 100 females age 18 and over, there were 84.4 males.\n\nThe median income for a household in the city was $29,899, and the median income for a family was $36,825. Males had a median income of $29,773 versus $21,283 for females. The per capita income for the city was $16,801. About 10.9% of families and 13.7% of the population were below the poverty line, including 15.4% of those under age 18 and 13.3% of those age 65 or over.\n\nGovernment\n\nCadillac was incorporated as a city in 1877. It is a home rule city with a Council-Manager form of government-one.[http://www.cadillac-mi.com/CadillacBook/gov.html Cadillac, The Community: Government] , Retrieved on March 23, 2010\n\nCurrent Council members are Shari Spoelman, Antoinette Schippers, Arthur Stevens, James Dean and Carla Filkins(Mayor). The present City Manager is Marcus Peccia.[http://www.cadillac-mi.net/index.aspx?NID=31 Administration] [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on March 23, 2010\n\nCadillac is located in Michigan's 2nd congressional district, represented by Republican Bill Huizenga.[http://huizenga.house.gov/ U.S. Congressman Bill Huizenga] Official website of Bill Huizenga.\n\nEconomy\n\nManufacturing has been the greatest employer in Cadillac since the logging industry. Presently, over 26% of the city's labor force is employed in manufacturing.[http://factfinder.census.gov/servlet/QTTable?_bmy&-geo_id\n16000US2612320&-qr_nameDEC_2000_SF3_U_DP3&-ds_name\nDEC_2000_SF3_U&-_langen&-_sse\non 2000 U.S. Census Data]  [https://www.census.gov/ U.S. Census] Retrieved on January 5, 2008 There are three industrial parks within the city limits, comprising 7% of the total land use in Cadillac and 47% of the city's tax base.[http://www.cadillac-mi.net/economic_development/industrial_parks/BusinessClimateTestimonials.htm City of Cadillac Industrial Parks]  [http://www.cadillac-mi.net/ City of Cadillac] Retrieved on January 5, 2008 Much of the city's economic performance is determined by the fortunes of local industry.\n\nMajor manufacturers include Four Winns, AAR Manufacturing, Avon Rubber, FIAMM Technologies, Michigan Rubber Products and Rexair.\n\nThe center of the city is generally perceived to have a \"small-town-feel.\"Whetstone, Matt (December 7, 2007). [https://archive.is/20120728115506/http://www.cadillacnews.com/articles/2007/12/07/news/107766.txt Survey says: Cadillac good, improvement needed] [http://www.cadillacnews.com/ Cadillac News] Retrieved on January 5, 2008 In the summer, the downtown fills with tourists, many of whom are from southern Michigan. The city center is in fact only one block from Lake Cadillac and, by docking at the public docks, is as nearly accessible by boat as it is by car. The city's immediate proximity to two lakes, as well as Manistee National Forest, Pere Marquette State Forest, Mitchell State Park and a number of major highways ensures that tourism occupies a significant sector of the local economy.\n\nDuring the winter months Lake Cadillac and Lake Mitchell freeze over and the city becomes covered with snow. Cadillac is connected to a number of trail systems heavily used by winter recreation enthusiasts, and the city itself integrates unusually well into the corridors of travel created by snowmobilers.For details on popular trails, see [http://www.visitcadillac.com/snowmobile Cadillac Snowmobiling] Retrieved on January 5, 2008\n\nCadillac is also known as Chestnut Town, USA. The local area is home to a relatively large number of American chestnut trees, planted by pioneers from New York and Pennsylvania who settled in western Michigan. A blight in the early 20th century wiped out nearly every American Chestnut tree, but those in western Michigan developed a mysterious resistance and survived.\n\nLou Gehrig's Disease\n\nBased on a single, limited study involving twenty people, some people have labeled Cadillac as one of three \"hot spots\" for Lou Gehrig's Disease in the US. However, the study made no attempt to ascertain the occurrence of the disease in other parts of the state, or elsewhere in the country. The study was designed to examine the possible occurrence of the disease due to genetic influences. The occurrence of the disease within the city limits of Cadillac is reportedly over 100 times the normal rate. The cause of the abnormally large occurrence of the disease in Cadillac remains unknown.Kaminski, Frank (March 14, 2003). [http://www.cns.jrn.msu.edu/articles/2003_0314/DISEASE.html Disease Rates in Greenville, Cadillac Puzzle Scientists.]  Capital News Service. Retrieved on January 5, 2008\n\nEducation\n\nCadillac's public education system has a total of 10 schools, with approximately 3,100 students and 166 teachers with a student:teacher ratio of 19.1:1. Cadillac has 4 private primary and secondary schools with approximately 394 students, 20 teachers and a student:teacher ratio of 20:1.[http://www.localschooldirectory.com/city-schools/Cadillac/MI] LocalSchoolDirectory\n\nCadillac Area Public Schools (CAPS)\n\nThe city has two high schools: Cadillac High School and Innovation High School. The area also has a junior high school, covering grades 7 and 8, located adjacent to the high school, and a middle school, Mackinaw Trail Middle School, covering grades 5 and 6.  There are four elementary schools, Forest View Elementary, Franklin Elementary, Kenwood Elementary, and Lincoln Elementary.[http://vikingnet.org/ Vikingnet] VikingNet\n\nCadillac also has an alternative high school, located in the building that formerly housed Cooley Elementary School. Adult high school and GED courses are offered there as well. As a whole, the programs at Cooley are part of a curriculum that aids individuals in overcoming the exceptional obstacles to their educational and workforce goals.\n\nVocational career training is available to high school students free of charge in Cadillac and nearby schools at Wexford-Missaukee Independent School District (ISD) Career Tech Center (formerly Wexford-Missaukee Vocational Center or Voc-Tech). Students are bussed for part of the day to the Career Tech Center from their respective schools and receive credits toward high school graduation. Students are also able to earn certification in a chosen trade. Courses include:\n\n*Agriscience\n*Allied Heath Technologies\n*Automotive\n*Building Trades\n*Business Management and Administration\n*Computers and Electronics\n*Digital Media Productions\n*Electrical Occupations (formally Robotics and Automation)\n*Heavy Equipment\n*Hospitality Retailing and Entrepreneureship\n*Machine Trades\n*Metal Fabrication\n*Power sports and Equipment\n\nCosmetology is offered through the Career Tech Center, but at an off-campus location in downtown Cadillac. Adults can attend the vocational or cosmetology school with tuition or financial aid for certification.[http://www.publicschoolreview.com/school_ov/school_id/92015] PublicSchoolReview \n\nCadillac hosts the Wexford-Missaukee ISD Special Education for residents of the two counties who are in need of special services. This school is on the same campus as the Career Tech Center.\n\nThe class of 2006 was the largest class to go through Cadillac Public Schools.\n\nPrivate schools\n\nCadillac offers several options for private religious education.[http://www.privateschoolreview.com/county_private_schools/stateid/MI/county/26165] privateschoolreview\n\nCadillac Heritage Christian offers nondenominational Christian education from pre-K through 12th grade. It is a coed school with 98 students and a teacher:student ratio of 1:11. Graduating classes are typically between 3–12 students.\n\nNorthview SDA Christian School has 5 students in grades 1–9. It is a coed Seventh Day Adventist school.\n\nNoah's Ark Day School is a small alternative non-denominational Christian school for students in pre-K through first grade only. It is coed with 42 students and 1 teacher.\n\nCadillac's largest and most well-known private school is St. Ann School, a coed private Roman Catholic school with 236 students in grades pre-K through 7. The teacher:student ratio is 1:26. St. Ann is a member of the National Catholic Education Association. No Catholic high school education is offered at St. Ann School, and students typically attend public school for grades 8–12.\n\nTraining schools\n\nNorthwoods Aviation, located at Wexford County Airport, offers training programs for piloting and servicing aircraft. Northwoods Aviation also offers primary instruction for those interested in sport pilot, private, and commercial certificates.[http://northwoodsaviation.com/] Northwoods Aviation\n\nThe Cadillac Institute of Cosmetology (formerly Cadillac Academy of Beauty) is a full service teaching salon in downtown Cadillac that offers training for general cosmetologists and specialized technicians to high school students through a partnership with Wexford-Missaukee Intermediate School District. Training is also available to adult students though private courses on a tuition basis. Upon completion of the program, students are qualified to take the state board exam to become a licensed cosmetologist or specialty technician.\n\nColleges\n\nThe Baker College-Cadillac campus occupies 66 acre just outside the City of Cadillac. The school has an enrollment of more than 1,300 students and offers Associate's and bachelor's degrees, in addition to professional certifications.[http://www.baker.edu/campusresources/Cadillac/cacinfo.cfm Baker College-Cadillac]. Online profile. Retrieved on January 5, 2005 \n\nTransportation\n\nMajor highways\n\nCadillac is situated as the confluence of three highways: US 131, M-55 and M-115. Prior to 2001, the northern end of the freeway portion of US 131 was located at the southern entrance to Cadillac. With the construction of a bypass, the US 131 freeway was extended around the east side of the city. The former route of the highway through downtown Cadillac was redesignated as BUS US 131. In the city, BUS US 131 is named Mitchell Street, after George Mitchell, but may be referred to as main street.\n\n* bypasses the city to the east. The freeway continues southerly toward Big Rapids and Grand Rapids and northerly toward Manton before transitioning to a two-lane highway for the remainder of the distance to Petoskey.\n*, a loop route through downtown, running largely along the former route of US 131 through the city.\n* is a major two-lane east-west route across the state, connecting with Manistee on the west and Lake City, Houghton Lake, West Branch, and Tawas City on the east.\n*, another major two-lane route, runs diagonally from Clare to the southeast to Frankfort to the northwest.\n\nRail\n\nThe city is serviced by rail via the Great Lakes Central Railroad. This is primarily a freight line, although passenger service is expected in the future.[https://web.archive.org/web/20080905150026/http://www.glcrailroad.com/passenger.aspx Great Lakes Central Railroad.] [http://www.glcrailroad.com/ GLC] Retrieved on March 4, 2009\n\nPublic transit\n\n*Cadillac and Wexford County jointly operate a local public bus service. The [http://www.cwta.us/ Cadillac/Wexford Transit Authority (CWTA)] is a demand-response, public transportation system, and has been in operation since 1974.[http://www.michigan.gov/mdot/0,1607,7-151-9625_21607-162305--,00.html Cadillac/Wexford Transportation Authority] [http://www.michigan.gov/mdot/ Michigan Department of Transportation] Retrieved on January 5, 2008\n*Indian Trails provides daily intercity bus service between Grand Rapids, Michigan and St. Ignace, Michigan and stops in Cadillac.\n\nNon-motorized transportation\n\nThe White Pine Trail's northern terminus is in Cadillac. The trail, which stretches 92 mi and originates from Comstock Park, follows an abandoned railroad bed into the center of the city. The trail is paved from the village of Leroy 16 miles north to Cadillac.[http://www.whitepinetrail.com/about Trail Surface]  [http://www.whitepinetrail.com/ White Pine Trail] Retrieved on March 5, 2009\n\nLocal media\n\nNewspapers\n\n*The Cadillac News\n\nRadio\n\n*WTCM (580 am, Traverse City) – news and talk\n*WLDR (1210 am, Kingsley-Traverse City) – classic country\n*WATT (1240 am) – news and talk\n*WLJW (1370 am) – religious\n*WIAA (88.7 FM, Interlochen) – classical music \"IPR Music Radio\"\n*WOLW (91.1 FM) – religious \"Northern Christian Radio\"\n*WGCP (91.9 FM) – religious \"3ABN Radio\"\n*WJZQ (92.9 FM) – Top 40 \"Z-93\"\n*WKAD (93.7 FM) – \"The Ticket\" (Fox Sports Radio)\n*WLXV (96.7 FM) – 96.7 The Bull\n*WUPS (98.5 FM, Houghton Lake) – classic hits\n*WLDR (101.9 FM, Traverse City) – country music \"101.9 Sunny Country\"\n*WTCM (103.5 FM, Traverse City) – country music\n*WAIR (104.9 FM) – contemporary Christian \"Smile-FM\"\n*WCKC (107.1 FM) – classic rock \"The Drive\"\n*WCDY (107.9 FM) – hot AC \"107.9 CDY\"\n\nTelevision\n\n*WPBN (Channel 7, Traverse City) – NBC\n*WWTV (Channel 9) – CBS\n*WMNN (Channel 26) – Independent\n*WCMV (Channel 27) – PBS\n*WGTU (Channel 29, Traverse City) – ABC\n*WFQX (Channel 32) – Fox\n\nNotable people \n\n* Jim Bowman, NFL player\n* Larry Joe Campbell, actor (According to Jim); born in Cadillac\n* Reed Cowan, journalist\n* Robert Dorigo Jones, writer\n* George A. Mitchell, father of the city of Cadillac (first developer).\n* Jackie Swanson, actress (Cheers), attended high school in Cadillac\n* Guy Vander Jagt, U.S. congressman from Michigan's 9th congressional district; born in Cadillac\n* Luke Winslow-King, musician; born in Cadillac. Cadillac, Michigan. http://en.wikipedia.org/?curid=6587."
  }
}
