{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13986",
  "eid" : "10c878b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778537403,
  "textBody" : "Hertfordshire (; often abbreviated Herts) is a county in southern England, bordered by Bedfordshire to the north, Cambridgeshire to the north-east, Essex to the east, Buckinghamshire to the west and Greater London to the south. For government statistical purposes, it is placed in the East of England region.\n\nIn 2013, the county had a population of 1,140,700 living in an area of 634 sqmi. Four towns have between 50,000 and 100,000 residents: Hemel Hempstead, Stevenage, Watford and St Albans. Hertford, once the main market town for the medieval agricultural county, derives its name from a hart (stag) and a ford, used as the components of the county's coat of arms and flag.  Elevations are high for the region in the north and west.  These reach over 240 m in the western projection around Tring which is in the Chilterns.  The county's borders are approximately the watersheds of the Colne and Lea; both flowing to the south; each accompanied by a canal. Hertfordshire's undeveloped land is mainly agricultural and much is protected by green belt.\n\nThe county's landmarks span many centuries, ranging from the Six Hills in the new town of Stevenage built by local inhabitants during the Roman period, to Leavesden Film Studios. The volume of intact medieval and Tudor buildings surpasses London, in places in well-preserved conservation areas, especially in St Albans which includes some remains of Verulamium, the town where in the 3rd century an early recorded British martyrdom took place. Saint Alban, a Romano-British soldier, took the place of a Christian priest and was beheaded on Holywell Hill. His martyr's cross of a yellow saltire on a blue background is reflected in the flag and coat of arms of Hertfordshire.\n\nHertfordshire is well-served with motorways and railways, providing good access to London. The largest sector of the economy of the county is in services.\n\nHistory \n\nHertfordshire was the area assigned to a fortress constructed at Hertford under the rule of Edward the Elder in 913. Hertford is derived from the Anglo-Saxon heort ford, meaning deer crossing (of a watercourse). The name Hertfordshire is first recorded in the Anglo-Saxon Chronicle in 1011. Deer feature in many county emblems.\n\nThere is evidence of humans living in Hertfordshire from the Mesolithic period. It was first farmed during the Neolithic period and permanent habitation appeared at the beginning of the Bronze Age. This was followed by tribes settling in the area during the Iron Age.\n\nFollowing the Roman conquest of Britain in AD 43, the aboriginal Catuvellauni quickly submitted and adapted to the Roman life; resulting in the development of several new towns, including Verulamium (St Albans) where in c. 293 the first recorded British martyrdom is traditionally believed to have taken place. Saint Alban, a Romano-British soldier, took the place of a Christian priest and was beheaded on Holywell Hill. His martyr's cross of a yellow saltire on a blue background is reflected in the flag and coat of arms of Hertfordshire as the yellow background to the stag or Hart representing the county. He is the Patron Saint of Hertfordshire.\n\nWith the departure of the Roman Legions in the early 5th century, the now unprotected territory was invaded and colonised by the Anglo-Saxons. By the 6th century the majority of the modern county was part of the East Saxon kingdom. This relatively short lived kingdom collapsed in the 9th century, ceding the territory of Hertfordshire to the control of the West Anglians of Mercia. The region finally became an English shire in the 10th century, on the merger of the West Saxon and Mercian kingdoms.\n\nA century later, William of Normandy received the surrender of the surviving senior English Lords and Clergy at Berkhamsted, resulting in a new Anglicised title of William the Conqueror before embarking on an uncontested entry into London and his coronation at Westminster. Hertfordshire was used for some of the new Norman castles at Bishop's Stortford, and at King's Langley, a staging post between London and the royal residence of Berkhamsted.\n\nThe Domesday Book recorded the county as having nine hundreds. Tring and Danais became oneDacorumfrom Danis Corum or Danish rule harking back to a Viking not Saxon past. The other seven were Braughing, Broadwater, Cashio, Edwinstree, Hertford, Hitchin and Odsey.\n\nThe first shooting-down of a zeppelin over Great Britain during WW1 happened in Cuffley. \n\nAs London grew, Hertfordshire became conveniently close to the English capital; much of the area was owned by the nobility and aristocracy, this patronage helped to boost the local economy. However, the greatest boost to Hertfordshire came during the Industrial Revolution, after which the population rose dramatically. In 1903, Letchworth became the world's first garden city and Stevenage became the first town to redevelop under the New Towns Act 1946.\n\nFrom the 1920s until the late 1980s, the town of Borehamwood was home to one of the major British film studio complexes, including the MGM-British Studios. Many well-known films were made here including the first three Star Wars movies (IV, V, & VI). The studios generally used the name of Elstree. American director Stanley Kubrick not only used to shoot in those studios but also lived in the area until his death. Big Brother UK and Who Wants To Be A Millionaire? have been filmed there. EastEnders is filmed at Elstree. Hertfordshire has seen development at Leavesden Film Studios developed on the Leavesden Aerodome site; the Harry Potter series was filmed here and the 1995 James Bond film GoldenEye.[http://www.filmlondon.org.uk/content.asp?CategoryID=836 ] \n\nOn 17 October 2000, the Hatfield rail crash killed four people with over 70 injured. The crash exposed the shortcomings of Railtrack, which consequently saw speed restrictions and major track replacement. On 10 May 2002, the second of the Potters Bar rail accidents occurred killing seven people; the train was at high speed when it derailed and flipped into the air when one of the carriages slid along the platform where it came to rest.\n\nIn early December 2005, the 2005 Hemel Hempstead fuel depot explosions occurred at the Hertfordshire Oil Storage Terminal.\n\nIn 2012, the canoe and kayak slalom events of the 2012 Summer Olympic Games took place in the town of Waltham Cross, within the borough of Broxbourne.\n\nGeography \n\nHertfordshire is the county immediately north of London and is part of the East of England region, a mainly statistical unit. A significant minority of the population across all districts are City of London commuters. To the east is Essex, to the west is Buckinghamshire and to the north are Bedfordshire and Cambridgeshire.\n\nThe county's boundaries were roughly fixed by the Counties (Detached Parts) Act 1844 which eliminated exclaves; amended when, in 1965 under the London Government Act 1963, East Barnet Urban District and Barnet Urban District were abolished, their area was transferred to form part of the present-day London Borough of Barnet and the Potters Bar Urban District of Middlesex was transferred to Hertfordshire.\n\nThe highest point in the county is at 245 m  (AOD) on the Ridgeway long distance national path, on the border of Hastoe near Tring with Drayton Beauchamp, Buckinghamshire.\n\nAs at the 2011 census of the ten Districts, East Hertfordshire had the minimal, 290 people per km², whereas Watford had the maximal 4210 people per km²\n\nAn unofficial status, the purple star-shaped flower with yellow stamens, the Pasqueflower is among endemic county flowers.[http://www.plantlife.org.uk/wild_plants/plant_species/pasqueflower \"Wild Plants: Pasqueflower\"] Plantlife. Retrieved 26 February 2015\n\nGeology \n\nThe rocks of Hertfordshire belong to the great shallow syncline known as the London Basin. The beds dip in a south-easterly direction towards the syncline's lowest point roughly under the River Thames. The most important formations are the Cretaceous Chalk, exposed as the high ground in the north and west of the county, forming the Chiltern Hills and the younger Palaeocene, Reading Beds and Eocene, London Clay which occupy the remaining southern part. The eastern half of the county was covered by glaciers during the Ice Age and has a superficial layer of glacial boulder clays.\n\nNatural resources and environment \n\nDespite the spread of built areas, much of the county is given over to agriculture. One product, now largely defunct, was water-cress, based in Hemel Hempstead and Berkhamsted supported by reliable, clean chalk rivers. \n\nSome quarrying of sand and gravel occurs in the St Albans area. In the past, clay has supplied local brick-making and still does in Bovingdon, just south-west of Hemel Hempstead. The chalk that is the bedrock of much of the county provides an aquifer that feeds streams and is also exploited to provide water supplies for much of the county and beyond. Chalk has also been used as a building material and, once fired, the resultant lime was spread on agricultural land to improve fertility. The mining of chalk since the early 18th century has left unrecorded underground galleries that occasionally collapse unexpectedly and endanger buildings.\n\nFresh water is supplied to London from Ware, using the New River built by Hugh Myddleton and opened in 1613. Local rivers, although small, supported developing industries such as paper production at Nash Mills. \n\nHertfordshire affords habitat for a variety of flora and fauna. One bird common in the shire is the Royston crow, which is the eponymous name of the regional newspaper, the Royston Crow published in Royston.\n\nUrban areas \n\nIn November 2013, the uSwitch Quality of Life Index listed Hertfordshire as the third-best place to live in the UK.\n\nEconomy \n\nThis is a table of trends of regional gross value added of Hertfordshire at current basic prices with figures in millions of British Pounds Sterling.[http://www.statistics.gov.uk/downloads/theme_economy/RegionalGVA.pdf Regional Gross Value Added] , Office for National Statistics, pp. 240–253.\n\nHertfordshire has headquarters of many large well-known UK companies. Hemel Hempstead is home to DSG International. Welwyn Garden City hosts Tesco, as well as Roche UK's headquarters (subsidiary of the Swiss pharmaceutical firm Hoffman-La Roche) and Cereal Partners production facilities, Pure the DAB radio maker is based in Kings Langley. JD Wetherspoon is in Watford. Skanska is in Rickmansworth, GlaxoSmithKline has plants in Ware and Stevenage. Hatfield used to be connected with the aircraft industry, as it was where de Havilland developed the world's first commercial jet liner, the Comet. Now the site is a business park and new campus for the University of Hertfordshire. This major new employment site is home to, among others, EE, Computacenter and Ocado. A subsidiary of BAE Systems and Finmeccanica in Stevenage, MBDA, develops missiles. In the same town Airbus (Defence & Space Division) produces satellites. The National Pharmacy Association (NPA), the trade association for all of the UK's community pharmacies, is based in St. Albans. Warner Bros. also owns and runs Warner Studios in Leavesden.\n\nLandmarks \n\nBelow is a list of notable visitor attractions in Hertfordshire:\n* Aldenham Country Park\n* Ashridge. The estate surrounding the neo-Gothic house by James Wyatt (not open to the public) is National Trust land\n** Bridgewater Monument built in 1832 in memory of Francis Egerton, 3rd Duke of Bridgewater. 108 ft tall and open to the public to ascend to the top\n* Berkhamsted Castle\n* Butterfly World, Chiswell Green\n* Cedars Park, Broxbourne –  a historic public park on the site of a Tudor palace\n* de Havilland Aircraft Heritage Centre, between London Colney and South Mimms\n* Gardens of the Rose, Chiswell Green, near St Albans. Home of the Royal National Rose Society\n* Hatfield\n** Hatfield House – Jacobean house, gardens and park\n** Mill Green Watermill in Hatfield\n* Henry Moore Foundation, Much Hadham – sculpture park on the work of Henry Moore\n* Knebworth House, 250 acre of country park, venue of regular rock and pop festivals\n* Leavesden Film Studios, home of the Warner Bros. Making of Harry Potter studio tour\n* Letchworth Garden City World's first Garden City. Home of the first planned Green Belt, the UK's first roundabout, and a number of experiments in early town planning and house and factory design\n** Spirella Building\n* Magic Roundabout (Hemel Hempstead) a complex road junction\n* Royston Cave  – in Royston town centre\n* Rye House Gatehouse in Hoddesdon (part of the Rye House Plot to assassinate King Charles II)\n* St Albans\n** Beech Bottom Dyke – large scale iron age defensive or boundary ditch\n** Sopwell Nunnery\n** St Albans Cathedral\n** Verulamium – Roman town remains, including museum of Roman life and the remains of a Roman amphitheatre\n* Scott's Grotto, Ware in its protected rural buffer area\n* Shaw's Corner, Ayot St Lawrence – home of George Bernard Shaw\n* Stevenage – the first UK New Town\n** Six Hills Roman barrows site\n* Therfield Heath – a local nature reserve in the north of the county\n* University of Hertfordshire – a public research university based in Hatfield\n* Welwyn Viaduct to the north of Welwyn Garden City\n* Walter Rothschild Zoological Museum, Tring a museum-annotated collection of dead mammals, birds, reptiles and insects.\n* Watford Museum, fine art and local artefacts\n\nMain national footpaths \n\n*The Ridgeway\n*Icknield Way\n*Grand Union Canal Walk\n*Harcamlow Way\n*Hertfordshire Way\n\nIntra-county notable footpaths \n\n*Hertfordshire Chain Walk\n\nTransport \n\nHertfordshire lies across major road and rail routes connecting London to the Midlands, Northern England and Scotland. As one of the home counties, many towns in the county form part of the London commuter belt.\n\nThe county has some of the principal roads in England: A1, A1(M), A5, A6, A41, M1, M11, and M25.\n\nFour principal national railway lines pass through the county:\n* the West Coast Main Line from . London Midland provides local commuter and regional services in the far west of the county. Virgin Trains also operates high speed inter-city services via  to the Midlands, North Wales, the North West England and Scotland\n* the East Coast Main Line from . Local commuter and regional services are provided by Great Northern. Virgin Trains East Coast runs high speed inter-city services via  to Yorkshire, North East England and Scotland\n* the Midland Main Line which forms part of the Thameslink route between Bedford and Brighton via Central London with services are provided by Thameslink. East Midlands Trains also provide inter-city services along the line from London St. Pancras to the East Midlands and Yorkshire\n* the West Anglia Main Line from London Liverpool Street. Local commuter and regional services are provided by Greater Anglia mainly in the east of the county\n\nA number of other local rail routes also cross Hertfordshire:\n* the London to Aylesbury Line from London Marylebone runs via Rickmansworth and Chorleywood\n* the Abbey Line, a local line from Watford to \n* the Cambridge Line, a branch of the East Coast line which runs via Royston and Letchworth to \n\nThree commuter lines operated by Transport for London enter the county:\n* the Lea Valley Lines, a suburban metro line from Liverpool Street to Cheshunt via Seven Sisters\n* the Watford DC Line, a suburban metro line from Euston to Watford Junction\n* five stations on the London Underground Metropolitan line , Croxley, Moor Park,  and Watford  are in Hertfordshire.\n\nStansted and Luton are within 10 mi of the county's borders. A commercial airfield is at Elstree for light aircraft.\n\nThe Grand Union Canal passes through much of the far west of Hertfordshire: Rickmansworth, Watford, Hemel Hempstead, Berkhamsted and Tring.\n\nLocal bus services are run by a number of private operators. Intalink is an organisation run by the county council that manages transport and funds bus services in rural areas.\n\nEducation \n\nHertfordshire has 26 independent schools and 73 state secondary schools.\nThe state secondary schools are entirely comprehensive, although 7 schools in the south and southwest of the county are partially selective (see Education in Watford).\nAll state schools have sixth forms, and there are no sixth form colleges.\nThe tertiary colleges, each with multiple campuses, are Hertford Regional College, North Hertfordshire College, Oaklands College and West Herts College.\nThe University of Hertfordshire is a modern university based largely in Hatfield. It has more than 23,000 students.\n\nLiterature \n\nHertfordshire is the location of Jack Worthing's country house in Oscar Wilde's play The Importance of Being Earnest.\n\nJane Austen's novel Pride and Prejudice is primarily set in Hertfordshire..\n\nThe location of Mr Jarndyce's Bleak House in Charles Dickens's Bleak House is near St. Albans.\n\nThe eponymous residence in E. M. Forster's novel, Howards End was based on Rooks Nest House just outside Stevenage.\n\nGeorge Orwell based Animal Farm on Wallington, Hertfordshire where he lived between 1936 and 1940. Manor Farm and The Great Barn both feature in the novel.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hertfordshire" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13986" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hertfordshire (; often abbreviated Herts) is a county in southern England, bordered by Bedfordshire to the north, Cambridgeshire to the north-east, Essex to the east, Buckinghamshire to the west and Greater London to the south. For government statistical purposes, it is placed in the East of England region.\n\nIn 2013, the county had a population of 1,140,700 living in an area of 634 sqmi. Four towns have between 50,000 and 100,000 residents: Hemel Hempstead, Stevenage, Watford and St Albans. Hertford, once the main market town for the medieval agricultural county, derives its name from a hart (stag) and a ford, used as the components of the county's coat of arms and flag.  Elevations are high for the region in the north and west.  These reach over 240 m in the western projection around Tring which is in the Chilterns.  The county's borders are approximately the watersheds of the Colne and Lea; both flowing to the south; each accompanied by a canal. Hertfordshire's undeveloped land is mainly agricultural and much is protected by green belt.\n\nThe county's landmarks span many centuries, ranging from the Six Hills in the new town of Stevenage built by local inhabitants during the Roman period, to Leavesden Film Studios. The volume of intact medieval and Tudor buildings surpasses London, in places in well-preserved conservation areas, especially in St Albans which includes some remains of Verulamium, the town where in the 3rd century an early recorded British martyrdom took place. Saint Alban, a Romano-British soldier, took the place of a Christian priest and was beheaded on Holywell Hill. His martyr's cross of a yellow saltire on a blue background is reflected in the flag and coat of arms of Hertfordshire.\n\nHertfordshire is well-served with motorways and railways, providing good access to London. The largest sector of the economy of the county is in services.\n\nHistory \n\nHertfordshire was the area assigned to a fortress constructed at Hertford under the rule of Edward the Elder in 913. Hertford is derived from the Anglo-Saxon heort ford, meaning deer crossing (of a watercourse). The name Hertfordshire is first recorded in the Anglo-Saxon Chronicle in 1011. Deer feature in many county emblems.\n\nThere is evidence of humans living in Hertfordshire from the Mesolithic period. It was first farmed during the Neolithic period and permanent habitation appeared at the beginning of the Bronze Age. This was followed by tribes settling in the area during the Iron Age.\n\nFollowing the Roman conquest of Britain in AD 43, the aboriginal Catuvellauni quickly submitted and adapted to the Roman life; resulting in the development of several new towns, including Verulamium (St Albans) where in c. 293 the first recorded British martyrdom is traditionally believed to have taken place. Saint Alban, a Romano-British soldier, took the place of a Christian priest and was beheaded on Holywell Hill. His martyr's cross of a yellow saltire on a blue background is reflected in the flag and coat of arms of Hertfordshire as the yellow background to the stag or Hart representing the county. He is the Patron Saint of Hertfordshire.\n\nWith the departure of the Roman Legions in the early 5th century, the now unprotected territory was invaded and colonised by the Anglo-Saxons. By the 6th century the majority of the modern county was part of the East Saxon kingdom. This relatively short lived kingdom collapsed in the 9th century, ceding the territory of Hertfordshire to the control of the West Anglians of Mercia. The region finally became an English shire in the 10th century, on the merger of the West Saxon and Mercian kingdoms.\n\nA century later, William of Normandy received the surrender of the surviving senior English Lords and Clergy at Berkhamsted, resulting in a new Anglicised title of William the Conqueror before embarking on an uncontested entry into London and his coronation at Westminster. Hertfordshire was used for some of the new Norman castles at Bishop's Stortford, and at King's Langley, a staging post between London and the royal residence of Berkhamsted.\n\nThe Domesday Book recorded the county as having nine hundreds. Tring and Danais became oneDacorumfrom Danis Corum or Danish rule harking back to a Viking not Saxon past. The other seven were Braughing, Broadwater, Cashio, Edwinstree, Hertford, Hitchin and Odsey.\n\nThe first shooting-down of a zeppelin over Great Britain during WW1 happened in Cuffley. \n\nAs London grew, Hertfordshire became conveniently close to the English capital; much of the area was owned by the nobility and aristocracy, this patronage helped to boost the local economy. However, the greatest boost to Hertfordshire came during the Industrial Revolution, after which the population rose dramatically. In 1903, Letchworth became the world's first garden city and Stevenage became the first town to redevelop under the New Towns Act 1946.\n\nFrom the 1920s until the late 1980s, the town of Borehamwood was home to one of the major British film studio complexes, including the MGM-British Studios. Many well-known films were made here including the first three Star Wars movies (IV, V, & VI). The studios generally used the name of Elstree. American director Stanley Kubrick not only used to shoot in those studios but also lived in the area until his death. Big Brother UK and Who Wants To Be A Millionaire? have been filmed there. EastEnders is filmed at Elstree. Hertfordshire has seen development at Leavesden Film Studios developed on the Leavesden Aerodome site; the Harry Potter series was filmed here and the 1995 James Bond film GoldenEye.[http://www.filmlondon.org.uk/content.asp?CategoryID=836 ] \n\nOn 17 October 2000, the Hatfield rail crash killed four people with over 70 injured. The crash exposed the shortcomings of Railtrack, which consequently saw speed restrictions and major track replacement. On 10 May 2002, the second of the Potters Bar rail accidents occurred killing seven people; the train was at high speed when it derailed and flipped into the air when one of the carriages slid along the platform where it came to rest.\n\nIn early December 2005, the 2005 Hemel Hempstead fuel depot explosions occurred at the Hertfordshire Oil Storage Terminal.\n\nIn 2012, the canoe and kayak slalom events of the 2012 Summer Olympic Games took place in the town of Waltham Cross, within the borough of Broxbourne.\n\nGeography \n\nHertfordshire is the county immediately north of London and is part of the East of England region, a mainly statistical unit. A significant minority of the population across all districts are City of London commuters. To the east is Essex, to the west is Buckinghamshire and to the north are Bedfordshire and Cambridgeshire.\n\nThe county's boundaries were roughly fixed by the Counties (Detached Parts) Act 1844 which eliminated exclaves; amended when, in 1965 under the London Government Act 1963, East Barnet Urban District and Barnet Urban District were abolished, their area was transferred to form part of the present-day London Borough of Barnet and the Potters Bar Urban District of Middlesex was transferred to Hertfordshire.\n\nThe highest point in the county is at 245 m  (AOD) on the Ridgeway long distance national path, on the border of Hastoe near Tring with Drayton Beauchamp, Buckinghamshire.\n\nAs at the 2011 census of the ten Districts, East Hertfordshire had the minimal, 290 people per km², whereas Watford had the maximal 4210 people per km²\n\nAn unofficial status, the purple star-shaped flower with yellow stamens, the Pasqueflower is among endemic county flowers.[http://www.plantlife.org.uk/wild_plants/plant_species/pasqueflower \"Wild Plants: Pasqueflower\"] Plantlife. Retrieved 26 February 2015\n\nGeology \n\nThe rocks of Hertfordshire belong to the great shallow syncline known as the London Basin. The beds dip in a south-easterly direction towards the syncline's lowest point roughly under the River Thames. The most important formations are the Cretaceous Chalk, exposed as the high ground in the north and west of the county, forming the Chiltern Hills and the younger Palaeocene, Reading Beds and Eocene, London Clay which occupy the remaining southern part. The eastern half of the county was covered by glaciers during the Ice Age and has a superficial layer of glacial boulder clays.\n\nNatural resources and environment \n\nDespite the spread of built areas, much of the county is given over to agriculture. One product, now largely defunct, was water-cress, based in Hemel Hempstead and Berkhamsted supported by reliable, clean chalk rivers. \n\nSome quarrying of sand and gravel occurs in the St Albans area. In the past, clay has supplied local brick-making and still does in Bovingdon, just south-west of Hemel Hempstead. The chalk that is the bedrock of much of the county provides an aquifer that feeds streams and is also exploited to provide water supplies for much of the county and beyond. Chalk has also been used as a building material and, once fired, the resultant lime was spread on agricultural land to improve fertility. The mining of chalk since the early 18th century has left unrecorded underground galleries that occasionally collapse unexpectedly and endanger buildings.\n\nFresh water is supplied to London from Ware, using the New River built by Hugh Myddleton and opened in 1613. Local rivers, although small, supported developing industries such as paper production at Nash Mills. \n\nHertfordshire affords habitat for a variety of flora and fauna. One bird common in the shire is the Royston crow, which is the eponymous name of the regional newspaper, the Royston Crow published in Royston.\n\nUrban areas \n\nIn November 2013, the uSwitch Quality of Life Index listed Hertfordshire as the third-best place to live in the UK.\n\nEconomy \n\nThis is a table of trends of regional gross value added of Hertfordshire at current basic prices with figures in millions of British Pounds Sterling.[http://www.statistics.gov.uk/downloads/theme_economy/RegionalGVA.pdf Regional Gross Value Added] , Office for National Statistics, pp. 240–253.\n\nHertfordshire has headquarters of many large well-known UK companies. Hemel Hempstead is home to DSG International. Welwyn Garden City hosts Tesco, as well as Roche UK's headquarters (subsidiary of the Swiss pharmaceutical firm Hoffman-La Roche) and Cereal Partners production facilities, Pure the DAB radio maker is based in Kings Langley. JD Wetherspoon is in Watford. Skanska is in Rickmansworth, GlaxoSmithKline has plants in Ware and Stevenage. Hatfield used to be connected with the aircraft industry, as it was where de Havilland developed the world's first commercial jet liner, the Comet. Now the site is a business park and new campus for the University of Hertfordshire. This major new employment site is home to, among others, EE, Computacenter and Ocado. A subsidiary of BAE Systems and Finmeccanica in Stevenage, MBDA, develops missiles. In the same town Airbus (Defence & Space Division) produces satellites. The National Pharmacy Association (NPA), the trade association for all of the UK's community pharmacies, is based in St. Albans. Warner Bros. also owns and runs Warner Studios in Leavesden.\n\nLandmarks \n\nBelow is a list of notable visitor attractions in Hertfordshire:\n* Aldenham Country Park\n* Ashridge. The estate surrounding the neo-Gothic house by James Wyatt (not open to the public) is National Trust land\n** Bridgewater Monument built in 1832 in memory of Francis Egerton, 3rd Duke of Bridgewater. 108 ft tall and open to the public to ascend to the top\n* Berkhamsted Castle\n* Butterfly World, Chiswell Green\n* Cedars Park, Broxbourne –  a historic public park on the site of a Tudor palace\n* de Havilland Aircraft Heritage Centre, between London Colney and South Mimms\n* Gardens of the Rose, Chiswell Green, near St Albans. Home of the Royal National Rose Society\n* Hatfield\n** Hatfield House – Jacobean house, gardens and park\n** Mill Green Watermill in Hatfield\n* Henry Moore Foundation, Much Hadham – sculpture park on the work of Henry Moore\n* Knebworth House, 250 acre of country park, venue of regular rock and pop festivals\n* Leavesden Film Studios, home of the Warner Bros. Making of Harry Potter studio tour\n* Letchworth Garden City World's first Garden City. Home of the first planned Green Belt, the UK's first roundabout, and a number of experiments in early town planning and house and factory design\n** Spirella Building\n* Magic Roundabout (Hemel Hempstead) a complex road junction\n* Royston Cave  – in Royston town centre\n* Rye House Gatehouse in Hoddesdon (part of the Rye House Plot to assassinate King Charles II)\n* St Albans\n** Beech Bottom Dyke – large scale iron age defensive or boundary ditch\n** Sopwell Nunnery\n** St Albans Cathedral\n** Verulamium – Roman town remains, including museum of Roman life and the remains of a Roman amphitheatre\n* Scott's Grotto, Ware in its protected rural buffer area\n* Shaw's Corner, Ayot St Lawrence – home of George Bernard Shaw\n* Stevenage – the first UK New Town\n** Six Hills Roman barrows site\n* Therfield Heath – a local nature reserve in the north of the county\n* University of Hertfordshire – a public research university based in Hatfield\n* Welwyn Viaduct to the north of Welwyn Garden City\n* Walter Rothschild Zoological Museum, Tring a museum-annotated collection of dead mammals, birds, reptiles and insects.\n* Watford Museum, fine art and local artefacts\n\nMain national footpaths \n\n*The Ridgeway\n*Icknield Way\n*Grand Union Canal Walk\n*Harcamlow Way\n*Hertfordshire Way\n\nIntra-county notable footpaths \n\n*Hertfordshire Chain Walk\n\nTransport \n\nHertfordshire lies across major road and rail routes connecting London to the Midlands, Northern England and Scotland. As one of the home counties, many towns in the county form part of the London commuter belt.\n\nThe county has some of the principal roads in England: A1, A1(M), A5, A6, A41, M1, M11, and M25.\n\nFour principal national railway lines pass through the county:\n* the West Coast Main Line from . London Midland provides local commuter and regional services in the far west of the county. Virgin Trains also operates high speed inter-city services via  to the Midlands, North Wales, the North West England and Scotland\n* the East Coast Main Line from . Local commuter and regional services are provided by Great Northern. Virgin Trains East Coast runs high speed inter-city services via  to Yorkshire, North East England and Scotland\n* the Midland Main Line which forms part of the Thameslink route between Bedford and Brighton via Central London with services are provided by Thameslink. East Midlands Trains also provide inter-city services along the line from London St. Pancras to the East Midlands and Yorkshire\n* the West Anglia Main Line from London Liverpool Street. Local commuter and regional services are provided by Greater Anglia mainly in the east of the county\n\nA number of other local rail routes also cross Hertfordshire:\n* the London to Aylesbury Line from London Marylebone runs via Rickmansworth and Chorleywood\n* the Abbey Line, a local line from Watford to \n* the Cambridge Line, a branch of the East Coast line which runs via Royston and Letchworth to \n\nThree commuter lines operated by Transport for London enter the county:\n* the Lea Valley Lines, a suburban metro line from Liverpool Street to Cheshunt via Seven Sisters\n* the Watford DC Line, a suburban metro line from Euston to Watford Junction\n* five stations on the London Underground Metropolitan line , Croxley, Moor Park,  and Watford  are in Hertfordshire.\n\nStansted and Luton are within 10 mi of the county's borders. A commercial airfield is at Elstree for light aircraft.\n\nThe Grand Union Canal passes through much of the far west of Hertfordshire: Rickmansworth, Watford, Hemel Hempstead, Berkhamsted and Tring.\n\nLocal bus services are run by a number of private operators. Intalink is an organisation run by the county council that manages transport and funds bus services in rural areas.\n\nEducation \n\nHertfordshire has 26 independent schools and 73 state secondary schools.\nThe state secondary schools are entirely comprehensive, although 7 schools in the south and southwest of the county are partially selective (see Education in Watford).\nAll state schools have sixth forms, and there are no sixth form colleges.\nThe tertiary colleges, each with multiple campuses, are Hertford Regional College, North Hertfordshire College, Oaklands College and West Herts College.\nThe University of Hertfordshire is a modern university based largely in Hatfield. It has more than 23,000 students.\n\nLiterature \n\nHertfordshire is the location of Jack Worthing's country house in Oscar Wilde's play The Importance of Being Earnest.\n\nJane Austen's novel Pride and Prejudice is primarily set in Hertfordshire..\n\nThe location of Mr Jarndyce's Bleak House in Charles Dickens's Bleak House is near St. Albans.\n\nThe eponymous residence in E. M. Forster's novel, Howards End was based on Rooks Nest House just outside Stevenage.\n\nGeorge Orwell based Animal Farm on Wallington, Hertfordshire where he lived between 1936 and 1940. Manor Farm and The Great Barn both feature in the novel. Hertfordshire. http://en.wikipedia.org/?curid=13986."
  }
}
