{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12239",
  "eid" : "012be3b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511211,
  "textBody" : "Guilt is a cognitive or an emotional experience that occurs when a person believes or realizes—accurately or not—that he or she has compromised his or her own standards of conduct or has violated a universal moral standard and bears significant responsibility for that violation.\nCompare: http://www.enotes.com/gale-psychology-encyclopedia/guilt \"In psychology, what is \"guilt,\" and what are the stages of guilt development?\". eNotes.com. 2006. 31 December 2007: 'Let's begin with a working definition of guilt. Guilt is “an emotional state produced by thoughts that we have not lived up to our ideal self and could have done otherwise.”' Retrieved 2017-12-03.\n\nGuilt is closely related to the concept of remorse.\n\nPsychology\n\nGuilt is an important factor in perpetuating obsessive–compulsive disorder symptoms. Guilt and its associated causes, merits, and demerits are common themes in psychology and psychiatry. Both in specialized and in ordinary language, guilt is an affective state in which one experiences conflict at having done something that one believes one should not have done (or conversely, having not done something one believes one should have done). It gives rise to a feeling which does not go away easily, driven by 'conscience'. Sigmund Freud described this as the result of a struggle between the ego and the superego – parental imprinting. Freud rejected the role of God as punisher in times of illness or rewarder in time of wellness. While removing one source of guilt from patients, he described another. This was the unconscious force within the individual that contributed to illness, Freud in fact coming to consider \"the obstacle of an unconscious sense of guilt...as the most powerful of all obstacles to recovery.\"Sigmund Freud, On Metapsychology (PFL 11) pp. 390–1 For his later explicator, Lacan, guilt was the inevitable companion of the signifying subject who acknowledged normality in the form of the Symbolic order.Catherine Belsey, Shakespeare in Theory and Practice (2008) p. 25\n\nAlice Miller claims that \"many people suffer all their lives from this oppressive feeling of guilt, the sense of not having lived up to their parents' expectations....no argument can overcome these guilt feelings, for they have their beginnings in life's earliest period, and from that they derive their intensity.\"Alice Miller, The Drama of Being a Child (1995) pp. 99–100 This may be linked to what Les Parrott has called \"the disease of false guilt....At the root of false guilt is the idea that what you feel must be true.\"Parrott, pp. 158–9 If you feel guilty, you must be guilty!\n\nThe philosopher Martin Buber underlined the difference between the Freudian notion of guilt, based on internal conflicts, and existential guilt, based on actual harm done to others.\n\nGuilt is often associated with anxiety. In mania, according to Otto Fenichel, the patient succeeds in applying to guilt \"the defense mechanism of denial by overcompensation...re-enacts being a person without guilt feelings.\"Otto Fenichel, The Psychoanalytic Theory of Neurosis (London 1946) pp. 409–10\n\nIn psychological research, guilt can be measured by using questionnaires, such as the Differential Emotions Scale (Izard's DES), or the Dutch Guilt Measurement Instrument.\n\nDefenses\n\nDefenses against feeling guilt can become an overriding aspect of one's personality.Otto Fenichel The Psychoanalytic Theory of Neurosis (1946) p. 496  The methods that can be used to avoid guilt are multiple.  They include:\n#Repression, usually used by the superego and ego against instinctive impulses, but on occasion employed against the superego/conscience itself.Sigmund Freud, On Metapsychology (PFL 11)p. 393  If the defence fails, then (in a return of the repressed) one may begin to feel guilty years later for actions lightly committed at the time.Eric Berne, A Layman's Guide to Psychiatry and Psychoanalysis (Penguin 1976) p. 191\n#Projection is another defensive tool with wide applications. It may take the form of blaming the victim: The victim of someone else's accident or bad luck may be offered criticism, the theory being that the victim may be at fault for having attracted the other person's hostility.The Pursuit of Health, June Bingham & Norman Tamarkin, M.D., Walker Press Alternatively, not the guilt, but the condemning agency itself, may be projected onto other people, in the hope that they will look upon one's deeds more favorably than one's own conscience  (a process that verges on ideas of reference).Otto Fenichel, The Psychoanalytic Theory of Neurosis (1946) p. 165 and p. 293\n#Sharing a feeling of guilt, and thereby being less alone with it, is a motive force in both art and joke-telling; while it is also possible to \"borrow\" a sense of guilt from someone who is seen as in the wrong, and thereby assuage one's own.Otto Fenichel, The Psychoanalytic Theory of Neurosis (1946) p. 165-6 and p. 496\n#Self-harm may be used as an alternative to compensating the object of one's transgression – perhaps in the form of not allowing oneself to enjoy opportunities open to one, or benefits due, as a result of uncompensated guilt feelings.\n\nBehavioral responses \n\nFeelings of guilt can prompt subsequent virtuous behavior. People who feel guilty may be more likely to exercise restraint, avoid self-indulgence, and exhibit less prejudice. Guilt appears to prompt reparatory behaviors to alleviate the negative emotions that it engenders. People appear to engage in targeted and specific reparatory behaviors toward the persons they wronged or offended.\n\nLack of guilt in psychopaths\n\nIndividuals high in psychopathy lack any true sense of guilt or remorse for harm they may have caused others. Instead, they rationalize their behavior, blame someone else, or deny it outright. A person with psychopathy has a tendency to be harmful to his or herself and to others. They have little ability to plan ahead for the future. An individual with psychopathy will never find themselves at fault because they will do whatever it takes to benefit themselves without reservation. A person that does not feel guilt or remorse would have no reason to find themselves at fault for something that they did with the intention of hurting another person. To a person high in psychopathy, their actions can always be rationalized to be the fault of another person. This is seen by psychologists as part of a lack of moral reasoning (in comparison with the majority of humans), an inability to evaluate situations in a moral framework, and an inability to develop emotional bonds with other people due to a lack of empathy.\n\nCauses\n\nEvolutionary theories\n\nSome evolutionary psychologists theorize that guilt and shame helped maintain beneficial relationships, such as reciprocal altruism. If a person feels guilty when he harms another, or even fails to reciprocate kindness, he is more likely not to harm others or become too selfish. In this way, he reduces the chances of retaliation by members of his tribe, and thereby increases his survival prospects, and those of the tribe or group. As with any other emotion, guilt can be manipulated to control or influence others. As a highly social animal living in large groups that are relatively stable, we need ways to deal with conflicts and events in which we inadvertently or purposefully harm others. If someone causes harm to another, and then feels guilt and demonstrates regret and sorrow, the person harmed is likely to forgive. Thus, guilt makes it possible to forgive, and helps hold the social group together.\n\nSocial psychology theories\n\nWhen we see another person suffering, it can also cause us pain. This constitutes our powerful system of empathy, which leads to our thinking that we should do something to relieve the suffering of others. If we cannot help another, or fail in our efforts, we experience feelings of guilt. From the perspective of group selection, groups that are made up of a high percentage of co-operators outdo groups with a low percentage of co-operators in between-group competition. People who are more prone to high levels of empathy-based guilt may be likely to suffer from anxiety and depression; however, they are also more likely to cooperate and behave altruistically. This suggests that guilt-proneness may not always be beneficial at the level of the individual, or within-group competition, but highly beneficial in between-group competition.\n\nOther theories\n\nAnother common notion is that guilt is assigned by social processes, such as a jury trial (i. e., that it is a strictly legal concept). Thus, the ruling of a jury that O. J. Simpson or Julius Rosenberg was \"guilty\" or \"not innocent\" is taken as an actual judgment by the whole society that they must act as if they were so. By corollary, the ruling that such a person is \"not guilty\" may not be so taken, due to the asymmetry in the assumption that one is assumed innocent until proven guilty, and prefers to take the risk of freeing a guilty party over convicting innocents. Still others—often, but not always, theists of one type or another—believe that the origin of guilt comes from violating universal principles of right and wrong. In most instances, people who believe this also acknowledge that even though there is proper guilt from doing 'wrong' instead of doing 'right', people endure all sorts of guilty feelings which do not stem from violating universal moral principles.\n\nCollective guilt\n\nCollective guilt (or group guilt) is the unpleasant and often emotional reaction that results among a group of individuals when it is perceived that the group illegitimately harmed members of another group. It is often the result of “sharing a social identity with others whose actions represent a threat to the positivity of that identity.” For an individual to experience collective guilt, he must identify himself as a part of the in-group. “This produces a perceptual shift from thinking of oneself in terms of ‘I’ and ‘me’ to ‘us’ or ‘we’.”\n\nCultural views\n\nTraditional Japanese society, Korean society and Chinese cultureBill Brugger, China, Liberation and Transformation (1981) pp. 18–19 are sometimes said to be \"shame-based\" rather than \"guilt-based\", in that the social consequences of \"getting caught\" are seen as more important than the individual feelings or experiences of the agent (see the work of Ruth Benedict). The same has been said of Ancient Greek society, a culture where, in Bruno Snell's words, if \"honour is destroyed the moral existence of the loser collapses.\"Quoted in M. I. Finley, The World of Odysseus (1967) p. 136\n\nThis may lead to more of a focus on etiquette than on ethics as understood in Western civilization, leading some in Western civilizations to question why the word ethos was adapted from Ancient Greek with such vast differences in cultural norms. Christianity and Islam inherit most notions of guilt from Judaism, Persian, and Roman ideas, mostly as interpreted through Augustine, who adapted Plato's ideas to Christianity. The Latin word for guilt is culpa, a word sometimes seen in law literature, for instance in mea culpa meaning \"my fault (guilt)\".\n\nEtymology\n\nGuilt, from O.E. gylt \"crime, sin, fault, fine, debt\", derived from O.E. gieldan \"to pay for, debt\". The mistaken use for \"sense of guilt\" is first recorded in 1690. \"Guilt by association\" is first recorded in 1941. \"Guilty\" is from O.E. gyltig, from gylt.\n\nIn literature\n\nGuilt is a main theme in John Steinbeck's East of Eden, Fyodor Dostoyevsky's Crime and Punishment, Tennessee Williams' A Streetcar Named Desire, William Shakespeare's play Macbeth, Edgar Allan Poe's \"The Tell-Tale Heart\" and \"The Black Cat\", and many other works of literature. In Sartre's The Flies, the Furies (in the form of flies) represent the morbid, strangling forces of neurotic guilt which bind us to authoritarian and totalitarian power.Robert Fagles trans., The Oresteia (Penguin 1981) p. 92\n\nGuilt is a major theme in many works by Nathaniel Hawthorne, and is an almost universal concern of novelists who explore inner life and secrets.\n\nIn the Christian Bible\n\nGuilt in the Christian Bible is not merely an emotional state but is a legal state of deserving punishment. The Hebrew Bible does not have a unique word for guilt, but uses a single word to signify: \"sin, the guilt of it, the punishment due unto it, and a sacrifice for it.\" The Greek New Testament uses a word for guilt that means \"standing exposed to judgment for sin\" (e. g., Romans 3:19). In what Christians call the \"Old Testament\", Christians believe the Bible teaches that, through sacrifice, one's sins can be forgiven (Judaism categorically rejects this idea, holding that forgiveness of sin is exclusively through repentance, and the role of sacrifices was for atonement of sins committed by accident or ignorance [http://www.shamash.org/lists/scj-faq/HTML/faq/11-08-02.html]). The New Testament says that this forgiveness is given as written in 1 Corinthians 15:3–4: \"3 For what I received I passed on to you as of first importance: that Christ died for our sins according to the Scriptures, for that he was buried, that he was raised on the third day according to the Scriptures.\" Some believe that the Old and New Testaments have differing opinions on the expiation of guilt because the Old Testaments were subject to the Age of Law and the New Testaments replace the Age of Law with the now current Age of Grace. However, both in the Old Testament and the New Testament salvation was granted based on God's grace and forgiveness (Gen 6:8; 19:19; Exo 33:12–17; 34:6–7). Animal sacrifices were only a symbol of the future sacrifice of Jesus Christ (Heb 10:1–4; 9–12). The whole world is guilty before God for abandoning him and his ways (Rom 3:19). In Jesus Christ, God took upon himself the sins of the world and died on the cross to pay our debt (Rom 6:23). Those who repent and accept the sacrifice of Jesus Christ for their sins, will be redeemed by God and thus not guilty before him. They will be granted eternal life which will take effect when Jesus comes the second time (1 Thess 4:13–18). In contrast to surrounding nations which addressed their guilt with human sacrifice, the Israeli authors of the Bible called that an abomination (1 Kings 11:7, Jer 32:35). The Bible agrees with pagan cultures that guilt creates a cost that someone must pay (Heb 9:22). (This assumption was expressed in the previous section, \"Defences\": \"Guilty people punish themselves if they have no opportunity to compensate the transgression that caused them to feel guilty. It was found that self-punishment did not occur if people had an opportunity to compensate the victim of their transgression.\") But unlike pagan deities who demanded it be paid by humans, God, according to the Bible, loved us enough to pay it Himself, as a good father would, while calling us His \"children\" and calling Himself our \"father\" (Mat 5:45).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guilt (emotion)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12239" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Guilt is a cognitive or an emotional experience that occurs when a person believes or realizes—accurately or not—that he or she has compromised his or her own standards of conduct or has violated a universal moral standard and bears significant responsibility for that violation.\nCompare: http://www.enotes.com/gale-psychology-encyclopedia/guilt \"In psychology, what is \"guilt,\" and what are the stages of guilt development?\". eNotes.com. 2006. 31 December 2007: 'Let's begin with a working definition of guilt. Guilt is “an emotional state produced by thoughts that we have not lived up to our ideal self and could have done otherwise.”' Retrieved 2017-12-03.\n\nGuilt is closely related to the concept of remorse.\n\nPsychology\n\nGuilt is an important factor in perpetuating obsessive–compulsive disorder symptoms. Guilt and its associated causes, merits, and demerits are common themes in psychology and psychiatry. Both in specialized and in ordinary language, guilt is an affective state in which one experiences conflict at having done something that one believes one should not have done (or conversely, having not done something one believes one should have done). It gives rise to a feeling which does not go away easily, driven by 'conscience'. Sigmund Freud described this as the result of a struggle between the ego and the superego – parental imprinting. Freud rejected the role of God as punisher in times of illness or rewarder in time of wellness. While removing one source of guilt from patients, he described another. This was the unconscious force within the individual that contributed to illness, Freud in fact coming to consider \"the obstacle of an unconscious sense of guilt...as the most powerful of all obstacles to recovery.\"Sigmund Freud, On Metapsychology (PFL 11) pp. 390–1 For his later explicator, Lacan, guilt was the inevitable companion of the signifying subject who acknowledged normality in the form of the Symbolic order.Catherine Belsey, Shakespeare in Theory and Practice (2008) p. 25\n\nAlice Miller claims that \"many people suffer all their lives from this oppressive feeling of guilt, the sense of not having lived up to their parents' expectations....no argument can overcome these guilt feelings, for they have their beginnings in life's earliest period, and from that they derive their intensity.\"Alice Miller, The Drama of Being a Child (1995) pp. 99–100 This may be linked to what Les Parrott has called \"the disease of false guilt....At the root of false guilt is the idea that what you feel must be true.\"Parrott, pp. 158–9 If you feel guilty, you must be guilty!\n\nThe philosopher Martin Buber underlined the difference between the Freudian notion of guilt, based on internal conflicts, and existential guilt, based on actual harm done to others.\n\nGuilt is often associated with anxiety. In mania, according to Otto Fenichel, the patient succeeds in applying to guilt \"the defense mechanism of denial by overcompensation...re-enacts being a person without guilt feelings.\"Otto Fenichel, The Psychoanalytic Theory of Neurosis (London 1946) pp. 409–10\n\nIn psychological research, guilt can be measured by using questionnaires, such as the Differential Emotions Scale (Izard's DES), or the Dutch Guilt Measurement Instrument.\n\nDefenses\n\nDefenses against feeling guilt can become an overriding aspect of one's personality.Otto Fenichel The Psychoanalytic Theory of Neurosis (1946) p. 496  The methods that can be used to avoid guilt are multiple.  They include:\n#Repression, usually used by the superego and ego against instinctive impulses, but on occasion employed against the superego/conscience itself.Sigmund Freud, On Metapsychology (PFL 11)p. 393  If the defence fails, then (in a return of the repressed) one may begin to feel guilty years later for actions lightly committed at the time.Eric Berne, A Layman's Guide to Psychiatry and Psychoanalysis (Penguin 1976) p. 191\n#Projection is another defensive tool with wide applications. It may take the form of blaming the victim: The victim of someone else's accident or bad luck may be offered criticism, the theory being that the victim may be at fault for having attracted the other person's hostility.The Pursuit of Health, June Bingham & Norman Tamarkin, M.D., Walker Press Alternatively, not the guilt, but the condemning agency itself, may be projected onto other people, in the hope that they will look upon one's deeds more favorably than one's own conscience  (a process that verges on ideas of reference).Otto Fenichel, The Psychoanalytic Theory of Neurosis (1946) p. 165 and p. 293\n#Sharing a feeling of guilt, and thereby being less alone with it, is a motive force in both art and joke-telling; while it is also possible to \"borrow\" a sense of guilt from someone who is seen as in the wrong, and thereby assuage one's own.Otto Fenichel, The Psychoanalytic Theory of Neurosis (1946) p. 165-6 and p. 496\n#Self-harm may be used as an alternative to compensating the object of one's transgression – perhaps in the form of not allowing oneself to enjoy opportunities open to one, or benefits due, as a result of uncompensated guilt feelings.\n\nBehavioral responses \n\nFeelings of guilt can prompt subsequent virtuous behavior. People who feel guilty may be more likely to exercise restraint, avoid self-indulgence, and exhibit less prejudice. Guilt appears to prompt reparatory behaviors to alleviate the negative emotions that it engenders. People appear to engage in targeted and specific reparatory behaviors toward the persons they wronged or offended.\n\nLack of guilt in psychopaths\n\nIndividuals high in psychopathy lack any true sense of guilt or remorse for harm they may have caused others. Instead, they rationalize their behavior, blame someone else, or deny it outright. A person with psychopathy has a tendency to be harmful to his or herself and to others. They have little ability to plan ahead for the future. An individual with psychopathy will never find themselves at fault because they will do whatever it takes to benefit themselves without reservation. A person that does not feel guilt or remorse would have no reason to find themselves at fault for something that they did with the intention of hurting another person. To a person high in psychopathy, their actions can always be rationalized to be the fault of another person. This is seen by psychologists as part of a lack of moral reasoning (in comparison with the majority of humans), an inability to evaluate situations in a moral framework, and an inability to develop emotional bonds with other people due to a lack of empathy.\n\nCauses\n\nEvolutionary theories\n\nSome evolutionary psychologists theorize that guilt and shame helped maintain beneficial relationships, such as reciprocal altruism. If a person feels guilty when he harms another, or even fails to reciprocate kindness, he is more likely not to harm others or become too selfish. In this way, he reduces the chances of retaliation by members of his tribe, and thereby increases his survival prospects, and those of the tribe or group. As with any other emotion, guilt can be manipulated to control or influence others. As a highly social animal living in large groups that are relatively stable, we need ways to deal with conflicts and events in which we inadvertently or purposefully harm others. If someone causes harm to another, and then feels guilt and demonstrates regret and sorrow, the person harmed is likely to forgive. Thus, guilt makes it possible to forgive, and helps hold the social group together.\n\nSocial psychology theories\n\nWhen we see another person suffering, it can also cause us pain. This constitutes our powerful system of empathy, which leads to our thinking that we should do something to relieve the suffering of others. If we cannot help another, or fail in our efforts, we experience feelings of guilt. From the perspective of group selection, groups that are made up of a high percentage of co-operators outdo groups with a low percentage of co-operators in between-group competition. People who are more prone to high levels of empathy-based guilt may be likely to suffer from anxiety and depression; however, they are also more likely to cooperate and behave altruistically. This suggests that guilt-proneness may not always be beneficial at the level of the individual, or within-group competition, but highly beneficial in between-group competition.\n\nOther theories\n\nAnother common notion is that guilt is assigned by social processes, such as a jury trial (i. e., that it is a strictly legal concept). Thus, the ruling of a jury that O. J. Simpson or Julius Rosenberg was \"guilty\" or \"not innocent\" is taken as an actual judgment by the whole society that they must act as if they were so. By corollary, the ruling that such a person is \"not guilty\" may not be so taken, due to the asymmetry in the assumption that one is assumed innocent until proven guilty, and prefers to take the risk of freeing a guilty party over convicting innocents. Still others—often, but not always, theists of one type or another—believe that the origin of guilt comes from violating universal principles of right and wrong. In most instances, people who believe this also acknowledge that even though there is proper guilt from doing 'wrong' instead of doing 'right', people endure all sorts of guilty feelings which do not stem from violating universal moral principles.\n\nCollective guilt\n\nCollective guilt (or group guilt) is the unpleasant and often emotional reaction that results among a group of individuals when it is perceived that the group illegitimately harmed members of another group. It is often the result of “sharing a social identity with others whose actions represent a threat to the positivity of that identity.” For an individual to experience collective guilt, he must identify himself as a part of the in-group. “This produces a perceptual shift from thinking of oneself in terms of ‘I’ and ‘me’ to ‘us’ or ‘we’.”\n\nCultural views\n\nTraditional Japanese society, Korean society and Chinese cultureBill Brugger, China, Liberation and Transformation (1981) pp. 18–19 are sometimes said to be \"shame-based\" rather than \"guilt-based\", in that the social consequences of \"getting caught\" are seen as more important than the individual feelings or experiences of the agent (see the work of Ruth Benedict). The same has been said of Ancient Greek society, a culture where, in Bruno Snell's words, if \"honour is destroyed the moral existence of the loser collapses.\"Quoted in M. I. Finley, The World of Odysseus (1967) p. 136\n\nThis may lead to more of a focus on etiquette than on ethics as understood in Western civilization, leading some in Western civilizations to question why the word ethos was adapted from Ancient Greek with such vast differences in cultural norms. Christianity and Islam inherit most notions of guilt from Judaism, Persian, and Roman ideas, mostly as interpreted through Augustine, who adapted Plato's ideas to Christianity. The Latin word for guilt is culpa, a word sometimes seen in law literature, for instance in mea culpa meaning \"my fault (guilt)\".\n\nEtymology\n\nGuilt, from O.E. gylt \"crime, sin, fault, fine, debt\", derived from O.E. gieldan \"to pay for, debt\". The mistaken use for \"sense of guilt\" is first recorded in 1690. \"Guilt by association\" is first recorded in 1941. \"Guilty\" is from O.E. gyltig, from gylt.\n\nIn literature\n\nGuilt is a main theme in John Steinbeck's East of Eden, Fyodor Dostoyevsky's Crime and Punishment, Tennessee Williams' A Streetcar Named Desire, William Shakespeare's play Macbeth, Edgar Allan Poe's \"The Tell-Tale Heart\" and \"The Black Cat\", and many other works of literature. In Sartre's The Flies, the Furies (in the form of flies) represent the morbid, strangling forces of neurotic guilt which bind us to authoritarian and totalitarian power.Robert Fagles trans., The Oresteia (Penguin 1981) p. 92\n\nGuilt is a major theme in many works by Nathaniel Hawthorne, and is an almost universal concern of novelists who explore inner life and secrets.\n\nIn the Christian Bible\n\nGuilt in the Christian Bible is not merely an emotional state but is a legal state of deserving punishment. The Hebrew Bible does not have a unique word for guilt, but uses a single word to signify: \"sin, the guilt of it, the punishment due unto it, and a sacrifice for it.\" The Greek New Testament uses a word for guilt that means \"standing exposed to judgment for sin\" (e. g., Romans 3:19). In what Christians call the \"Old Testament\", Christians believe the Bible teaches that, through sacrifice, one's sins can be forgiven (Judaism categorically rejects this idea, holding that forgiveness of sin is exclusively through repentance, and the role of sacrifices was for atonement of sins committed by accident or ignorance [http://www.shamash.org/lists/scj-faq/HTML/faq/11-08-02.html]). The New Testament says that this forgiveness is given as written in 1 Corinthians 15:3–4: \"3 For what I received I passed on to you as of first importance: that Christ died for our sins according to the Scriptures, for that he was buried, that he was raised on the third day according to the Scriptures.\" Some believe that the Old and New Testaments have differing opinions on the expiation of guilt because the Old Testaments were subject to the Age of Law and the New Testaments replace the Age of Law with the now current Age of Grace. However, both in the Old Testament and the New Testament salvation was granted based on God's grace and forgiveness (Gen 6:8; 19:19; Exo 33:12–17; 34:6–7). Animal sacrifices were only a symbol of the future sacrifice of Jesus Christ (Heb 10:1–4; 9–12). The whole world is guilty before God for abandoning him and his ways (Rom 3:19). In Jesus Christ, God took upon himself the sins of the world and died on the cross to pay our debt (Rom 6:23). Those who repent and accept the sacrifice of Jesus Christ for their sins, will be redeemed by God and thus not guilty before him. They will be granted eternal life which will take effect when Jesus comes the second time (1 Thess 4:13–18). In contrast to surrounding nations which addressed their guilt with human sacrifice, the Israeli authors of the Bible called that an abomination (1 Kings 11:7, Jer 32:35). The Bible agrees with pagan cultures that guilt creates a cost that someone must pay (Heb 9:22). (This assumption was expressed in the previous section, \"Defences\": \"Guilty people punish themselves if they have no opportunity to compensate the transgression that caused them to feel guilty. It was found that self-punishment did not occur if people had an opportunity to compensate the victim of their transgression.\") But unlike pagan deities who demanded it be paid by humans, God, according to the Bible, loved us enough to pay it Himself, as a good father would, while calling us His \"children\" and calling Himself our \"father\" (Mat 5:45). Guilt (emotion). http://en.wikipedia.org/?curid=12239."
  }
}
