{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6416",
  "eid" : "db5993d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778447757,
  "textBody" : "An impact crater is an approximately circular depression in the surface of a planet, moon, or other solid body in the Solar System or elsewhere, formed by the hypervelocity impact of a smaller body. In contrast to volcanic craters, which result from explosion or internal collapse,Basaltic Volcanism Study Project. (1981). Basaltic Volcanism on the Terrestrial Planets; Pergamon Press, Inc.: New York, p. 746. http://articles.adsabs.harvard.edu//full/book/bvtp./1981//0000746.000.html. impact craters typically have raised rims and floors that are lower in elevation than the surrounding terrain.Consolmagno, G.J.; Schaefer, M.W. (1994). Worlds Apart: A Textbook in Planetary Sciences; Prentice Hall: Englewood Cliffs, NJ, p.56. Although Meteor Crater is perhaps the best-known example of a small impact crater on Earth, impact craters range from small, simple, bowl-shaped depressions to large, complex, multi-ringed impact basins.\n\nImpact craters are the dominant geographic features on many solid Solar System objects including the Moon, Mercury, Callisto, Ganymede and most small moons and asteroids. On other planets and moons that experience more active surface geological processes, such as Earth, Venus, Mars, Europa, Io and Titan, visible impact craters are less common because they become eroded, buried or transformed by tectonics over time. Where such processes have destroyed most of the original crater topography, the terms impact structure or astrobleme are more commonly used. In early literature, before the significance of impact cratering was widely recognised, the terms cryptoexplosion or cryptovolcanic structure were often used to describe what are now recognised as impact-related features on Earth.French, B.M. (1998). Traces of Catastrophe: A Handbook of Shock-Metamorphic Effects in Terrestrial Meteorite Impact Structures; Simthsonian Institution: Washington DC, p. 97. http://www.lpi.usra.edu/publications/books/CB-954/CB-954.intro.html.\n\nThe cratering records of very old surfaces, such as Mercury, the Moon, and the southern highlands of Mars, record a period of intense early bombardment in the inner Solar System around 3.9 billion years ago. The rate of crater production on Earth has since been considerably lower, but it is appreciable nonetheless; Earth experiences from one to three impacts large enough to produce a 20 km diameter crater about once every million years on average.Carr, M.H. (2006) The surface of Mars; Cambridge University Press: Cambridge, UK, p. 23.Grieve R.A.; Shoemaker, E.M. (1994). The Record of Past Impacts on Earth in Hazards due to Comets and Asteroids, T. Gehrels, Ed.; University of Arizona Press, Tucson, AZ, pp. 417–464. This indicates that there should be far more relatively young craters on the planet than have been discovered so far. The cratering rate in the inner solar system fluctuates as a consequence of collisions in the asteroid belt that create a family of fragments that are often sent cascading into the inner solar system.  Formed in a collision 160 million years ago, the Baptistina family of asteroids is thought to have caused a large spike in the impact rate, perhaps causing the Chicxulub impact that may have triggered the extinction of the non-avian dinosaurs 66 million years ago. Note that the rate of impact cratering in the outer Solar System could be different from the inner Solar System.\n\nAlthough Earth's active surface processes quickly destroy the impact record, about [http://www.passc.net/EarthImpactDatabase/ 190] terrestrial impact craters have been identified.Grieve, R.A.F.; Cintala, M.J.; Tagle, R. (2007). Planetary Impacts in Encyclopedia of the Solar System, 2nd ed., L-A. McFadden et al. Eds, p. 826. These range in diameter from a few tens of meters up to about 300 km, and they range in age from recent times (e.g. the Sikhote-Alin craters in Russia whose creation was witnessed in 1947) to more than two billion years, though most are less than 500 million years old because geological processes tend to obliterate older craters. They are also selectively found in the stable interior regions of continents.Shoemaker, E.M.; Shoemaker, C.S. (1999). The Role of Collisions in The New Solar System, 4th ed., J.K. Beatty et al., Eds., p. 73. Few undersea craters have been discovered because of the difficulty of surveying the sea floor, the rapid rate of change of the ocean bottom, and the subduction of the ocean floor into Earth's interior by processes of plate tectonics.\n\nImpact craters are not to be confused with landforms that may appear similar, including calderas, sinkholes, glacial cirques, ring dikes, salt domes, and others.\n\nHistory\n\nDaniel Barringer (1860–1929) was one of the first to identify an impact crater, Meteor Crater in Arizona; to crater specialists the site is referred to as Barringer Crater in his honor. Initially Barringer's ideas were not widely accepted, and even when the origin of Meteor Crater was finally acknowledged, the wider implications for impact cratering as a significant geological process on Earth were not.\n\nIn the 1920s, the American geologist Walter H. Bucher studied a number of sites now recognized as impact craters in the United States. He concluded they had been created by some great explosive event, but believed that this force was probably volcanic in origin. However, in 1936, the geologists John D. Boon and Claude C. Albritton Jr. revisited Bucher's studies and concluded that the craters that he studied were probably formed by impacts.\n\nThe concept of impact cratering remained more or less speculative until the 1960s. At that time a number of researchers, most notably Eugene Shoemaker, (co-discoverer of the comet Shoemaker-Levy 9), conducted detailed studies of a number of craters and recognized clear evidence that they had been created by impacts, specifically identifying the shock-metamorphic effects uniquely associated with impact events, of which the most familiar is shocked quartz.\n\nArmed with the knowledge of shock-metamorphic features, Carlyle S. Beals and colleagues at the Dominion Astrophysical Observatory in Victoria, British Columbia, Canada and Wolf von Engelhardt of the University of Tübingen in Germany began a methodical search for impact craters. By 1970, they had tentatively identified more than 50. Although their work was controversial, the American Apollo Moon landings, which were in progress at the time, provided supportive evidence by recognizing the rate of impact cratering on the Moon.Grieve, R.A.F. (1990) Impact Cratering on the Earth. Scientific American, April 1990, p. 66. Because the processes of erosion on the Moon are minimal, craters persist almost indefinitely. Since the Earth could be expected to have roughly the same cratering rate as the Moon, it became clear that the Earth had suffered far more impacts than could be seen by counting evident craters.\n\nCrater formation\n\nImpact cratering involves high velocity collisions between solid objects, typically much greater than the velocity of sound in those objects.  Such hyper-velocity impacts produce physical effects such as melting and vaporization that do not occur in familiar sub-sonic collisions.  On Earth, ignoring the slowing effects of travel through the atmosphere, the lowest impact velocity with an object from space is equal to the gravitational escape velocity of about 11 km/s. The fastest impacts occur at about 72 km/s in the \"worst case\" scenario in which an object in a retrograde near-parabolic orbit hits Earth. (Because kinetic energy scales as velocity squared, Earth's gravity only contributes 1 km/s to this figure, not 11 km/s). The median impact velocity on Earth is about 20 km/s.\n\nHowever, the slowing effects of travel through the atmosphere rapidly decelerate any potential impactor, especially in the lowest 12 kilometres where 90% of the earth’s atmospheric mass lies. Meteorites of up to 7,000 kg lose all their cosmic velocity due to atmospheric drag at a certain altitude (retardation point), and start to accelerate again due to Earth's gravity until the body reaches its terminal velocity of  0.09 to 0.16 km/s. The larger the meteoroid (i.e. asteroids and comets) the more of its initial cosmic velocity it preserves. While an object of 9,000 kg maintains about 6% of its original velocity, one of 900,000 kg already preserves about 70%. Extremely large bodies (about 100,000 tonnes) are not slowed by the atmosphere at all, and impact with their initial cosmic velocity if no prior disintegration occurs.\n\nImpacts at these high speeds produce shock waves in solid materials, and both impactor and the material impacted are rapidly compressed to high density. Following initial compression, the high-density, over-compressed region rapidly depressurizes, exploding violently, to set in train the sequence of events that produces the impact crater. Impact-crater formation is therefore more closely analogous to cratering by high explosives than by mechanical displacement. Indeed, the energy density of some material involved in the formation of impact craters is many times higher than that generated by high explosives. Since craters are caused by explosions, they are nearly always circular – only very low-angle impacts cause significantly elliptical craters.Melosh, H.J., 1989, Impact cratering: A geologic process: New York, Oxford University Press, 245 p.\n\nThis describes impacts on solid surfaces. Impacts on porous surfaces, such as that of Hyperion, may produce internal compression without ejecta, punching a hole in the surface without filling in nearby craters. This may explain the 'sponge-like' appearance of that moon.[http://www.space.com/4028-key-giant-space-sponge-revealed.html 'Key to Giant Space Sponge Revealed'], Space.com, 4 July 2007\n\nIt is convenient to divide the impact process conceptually into three distinct stages: (1) initial contact and compression, (2) excavation, (3) modification and collapse.  In practice, there is overlap between the three processes with, for example, the excavation of the crater continuing in some regions while modification and collapse is already underway in others.\n\nContact and compression\n\nIn the absence of atmosphere, the impact process begins when the impactor first touches the target surface. This contact accelerates the target and decelerates the impactor.  Because the impactor is moving so rapidly, the rear of the object moves a significant distance during the short-but-finite time taken for the deceleration to propagate across the impactor. As a result, the impactor is compressed, its density rises, and the pressure within it increases dramatically.  Peak pressures in large impacts exceed 1 TPa to reach values more usually found deep in the interiors of planets, or generated artificially in nuclear explosions.\n\nIn physical terms, a shock wave originates from the point of contact.  As this shock wave expands, it decelerates and compresses the impactor, and it accelerates and compresses the target. Stress levels within the shock wave far exceed the strength of solid materials; consequently, both the impactor and the target close to the impact site are irreversibly damaged.  Many crystalline minerals can be transformed into higher-density phases by shock waves; for example, the common mineral quartz can be transformed into the higher-pressure forms coesite and stishovite.  Many other shock-related changes take place within both impactor and target as the shock wave passes through, and some of these changes can be used as diagnostic tools to determine whether particular geological features were produced by impact cratering.\n\nAs the shock wave decays, the shocked region decompresses towards more usual pressures and densities. The damage produced by the shock wave raises the temperature of the material. In all but the smallest impacts this increase in temperature is sufficient to melt the impactor, and in larger impacts to vaporize most of it and to melt large volumes of the target. As well as being heated, the target near the impact is accelerated by the shock wave, and it continues moving away from the impact behind the decaying shock wave.\n\nExcavation\n\nContact, compression, decompression, and the passage of the shock wave all occur within a few tenths of a second for a large impact. The subsequent excavation of the crater occurs more slowly, and during this stage the flow of material is largely subsonic. During excavation, the crater grows as the accelerated target material moves away from the point of impact. The target's motion is initially downwards and outwards, but it becomes outwards and upwards. The flow initially produces an approximately hemispherical cavity that continues to grow, eventually producing a paraboloid (bowl-shaped) crater in which the centre has been pushed down, a significant volume of material has been ejected, and a topographically elevated crater rim has been pushed up.  When this cavity has reached its maximum size, it is called the transient cavity.\n\nThe depth of the transient cavity is typically a quarter to a third of its diameter. Ejecta thrown out of the crater do not include material excavated from the full depth of the transient cavity; typically the depth of maximum excavation is only about a third of the total depth.  As a result, about one third of the volume of the transient crater is formed by the ejection of material, and the remaining two thirds is formed by the displacement of material downwards, outwards and upwards, to form the elevated rim.  For impacts into highly porous materials, a significant crater volume may also be formed by the permanent compaction of the pore space. Such compaction craters may be important on many asteroids, comets and small moons.\n\nIn large impacts, as well as material displaced and ejected to form the crater, significant volumes of target material may be melted and vaporized together with the original impactor.  Some of this impact melt rock may be ejected, but most of it remains within the transient crater, initially forming a layer of impact melt coating the interior of the transient cavity.  In contrast, the hot dense vaporized material expands rapidly out of the growing cavity, carrying some solid and molten material within it as it does so.  As this hot vapor cloud expands, it rises and cools much like the archetypal mushroom cloud generated by large nuclear explosions.  In large impacts, the expanding vapor cloud may rise to many times the scale height of the atmosphere, effectively expanding into free space.\n\nMost material ejected from the crater is deposited within a few crater radii, but a small fraction may travel large distances at high velocity, and in large impacts it may exceed escape velocity and leave the impacted planet or moon entirely.  The majority of the fastest material is ejected from close to the center of impact, and the slowest material is ejected close to the rim at low velocities to form an overturned coherent flap of ejecta immediately outside the rim.  As ejecta escapes from the growing crater, it forms an expanding curtain in the shape of an inverted cone. The trajectory of individual particles within the curtain is thought to be largely ballistic.\n\nSmall volumes of un-melted and relatively un-shocked material may be spalled at very high relative velocities from the surface of the target and from the rear of the impactor.  Spalling provides a potential mechanism whereby material may be ejected into inter-planetary space largely undamaged, and whereby small volumes of the impactor may be preserved undamaged even in large impacts.  Small volumes of high-speed material may also be generated early in the impact by jetting.  This occurs when two surfaces converge rapidly and obliquely at a small angle, and high-temperature highly shocked material is expelled from the convergence zone with velocities that may be several times larger than the impact velocity.\n\nModification and collapse\n\nIn most circumstances, the transient cavity is not stable and collapses under gravity.  In small craters, less than about 4 km diameter on Earth, there is some limited collapse of the crater rim coupled with debris sliding down the crater walls and drainage of impact melts into the deeper cavity.  The resultant structure is called a simple crater, and it remains bowl-shaped and superficially similar to the transient crater. In simple craters, the original excavation cavity is overlain by a lens of collapse breccia, ejecta and melt rock, and a portion of the central crater floor may sometimes be flat.\n\nAbove a certain threshold size, which varies with planetary gravity, the collapse and modification of the transient cavity is much more extensive, and the resulting structure is called a complex crater.  The collapse of the transient cavity is driven by gravity, and involves both the uplift of the central region and the inward collapse of the rim.  The central uplift is not the result of elastic rebound, which is a process in which a material with elastic strength attempts to return to its original geometry; rather the collapse is a process in which a material with little or no strength attempts to return to a state of gravitational equilibrium.\n\nComplex craters have uplifted centers, and they have typically broad flat shallow crater floors, and terraced walls.  At the largest sizes, one or more exterior or interior rings may appear, and the structure may be labeled an impact basin rather than an impact crater.  Complex-crater morphology on rocky planets appears to follow a regular sequence with increasing size: small complex craters with a central topographic peak are called central peak craters, for example Tycho; intermediate-sized craters, in which the central peak is replaced by a ring of peaks, are called peak-ring craters, for example Schrödinger; and the largest craters contain multiple concentric topographic rings, and are called multi-ringed basins, for example Orientale.  On icy (as opposed to rocky) bodies, other morphological forms appear that may have central pits rather than central peaks, and at the largest sizes may contain many concentric rings. Valhalla on Callisto is an example of this type.\n\nIdentifying impact craters \n\nNon-explosive volcanic craters can usually be distinguished from impact craters by their irregular shape and the association of volcanic flows and other volcanic materials. Impact craters produce melted rocks as well, but usually in smaller volumes with different characteristics.\n\nThe distinctive mark of an impact crater is the presence of rock that has undergone shock-metamorphic effects, such as shatter cones, melted rocks, and crystal deformations. The problem is that these materials tend to be deeply buried, at least for simple craters. They tend to be revealed in the uplifted center of a complex crater, however.\n\nImpacts produce distinctive shock-metamorphic effects that allow impact sites to be distinctively identified. Such shock-metamorphic effects can include:\n* A layer of shattered or \"brecciated\" rock under the floor of the crater. This layer is called a \"breccia lens\".\n* Shatter cones, which are chevron-shaped impressions in rocks. Such cones are formed most easily in fine-grained rocks.\n* High-temperature rock types, including laminated and welded blocks of sand, spherulites and tektites, or glassy spatters of molten rock. The impact origin of tektites has been questioned by some researchers; they have observed some volcanic features in tektites not found in impactites. Tektites are also drier (contain less water) than typical impactites. While rocks melted by the impact resemble volcanic rocks, they incorporate unmelted fragments of bedrock, form unusually large and unbroken fields, and have a much more mixed chemical composition than volcanic materials spewed up from within the Earth. They also may have relatively large amounts of trace elements that are associated with meteorites, such as nickel, platinum, iridium, and cobalt. Note: scientific literature has reported that some \"shock\" features, such as small shatter cones, which are often associated only with impact events, have been found also in terrestrial volcanic ejecta.\n* Microscopic pressure deformations of minerals. These include fracture patterns in crystals of quartz and feldspar, and formation of high-pressure materials such as diamond, derived from graphite and other carbon compounds, or stishovite and coesite, varieties of shocked quartz.\n* Buried craters, such as the Decorah crater, can be identified through drill coring, aerial electromagnetic resistivity imaging, and airborne gravity gradiometry.\n\nEconomic importance of impacts\n\nOn Earth impact craters have resulted in useful minerals.   Some of the ores produced from impact related effects on Earth include ores of iron, uranium, gold, copper, and nickel.  It is estimated that the value of materials mined from impact structures is 5 billion dollars/year just for North America.Grieve, R., V. Masaitis.  1994.  The Economic Potential of Terrestrial Impact Craters.  International Geology Review:  36, 105-151.   \nThe eventual usefulness of impact craters depends on several factors especially the nature of the materials that were impacted and when the materials were affected.  In some cases the deposits were already in place and the impact brought them to the surface.  These are called “progenetic economic deposits.”  Others were created during the actual impact.  The great energy involved caused melting.  Useful minerals formed as a result of this energy are classified as “syngenetic deposits.”  The third type, called “epigenetic deposits,” is caused by the creation of a basin from the impact.\nMany of the minerals that our modern lives depend on are associated with impacts in the past.  The Vredeford Dome in the center of the Witwatersrand Basin is the largest goldfield in the world which has supplied about 40% of all the gold ever mined is an impact structure.Daly, R.   1947.  The Vredefort ring structure of South Africa. Journal of Geology 55: 125145Hargraves,  R.  1961.  Shatter cones in the rocks of the Vredefort Ring. Transactions of the Geological Society of South Africa 64: 147-154Leroux H., Reimold W., Doukhan ,J.  1994.   A TEM investigation of shock metamorphism in quartz from the Vredefort Dome, South Africa. Tectonophysics 230: 223-230Martini , J.  1978.   Coesite and stishovite in the Vredefort Dome, South Africa. Nature 272: 715-717   The asteroid that struck the region was 6 miles wide.  The Sudbury Basin was caused by an impacting body over 6 miles in diameter.Grieve, R., Stöffler D, A. Deutsch.  1991.  The Sudbury Structure: controversial or misunderstood. Journal of Geophysical Research 96: 22 753-22 764French, B.  1970.  Possible Relations Between Meteorite Impact and Igneous Petrogenesis As Indicated by the Sudbury Structure, Ontario, Canada.  Bull. Volcan.  34, 466-517.   This basin is famous for its deposits of nickel, copper, and Platinum Group Elements.  An impact was involved in making the Carswell structure in Saskatchewan, Canada; it contains uranium deposits.Harper, C.  1983.   The Geology and Uranium Deposits of the Central Part of the Carswell Structure, Northern Sasketchewan, Canada. Unpublished PhD Thesis, Colorado School of Mines, Golden, CO, USA, 337 ppLainé,  R.,  D. Alonso,  M. Svab (eds).   1985.   The Carswell Structure Uranium Deposits. Geological Association of Canada, Special Paper 29: 230 ppGrieve, R., V. Masaitis.  1994.  The economic potential of terrestrial impact craters. International Geology Review 36: 105-151\nHydrocarbons are common around impact structures.  Fifty percent of impact structures in North America in hydrocarbon-bearing sedimentary basins contain oil/gas fields.http://nitishpriyadarshi.blogspot.com/2009/08/are-impact-craters-useful.html\n\nMartian Craters\n\nBecause of the many missions studying Mars since the 1960s, we have good coverage of its surface which contains large numbers of craters.  Many of the craters on Mars are different than on our moon and other moons since Mars contains ice under the ground, especially in the higher latitudes.  Some of the types of craters that have special shapes due to impact into ice-rich ground are pedestal craters, rampart craters, expanded craters, and LARLE craters.\n\nLists of craters\n\nImpact craters on Earth\n\nOn Earth, the recognition of impact craters is a branch of geology, and is related to planetary geology in the study of other worlds.  Out of many proposed craters, relatively few are confirmed.  The following twenty are a sample of articles of confirmed and well-documented impact sites.\n\nSee the Earth Impact Database,[https://www.unb.ca/passc/ImpactDatabase/essay.html Impact Cratering on Earth] a website concerned with 190 (as of November 2017) scientifically-confirmed impact craters on Earth.\n\nSome extraterrestrial craters\n\n* Caloris Basin (Mercury)\n* Hellas Basin (Mars)\n* Mare Orientale (Moon)\n* Petrarch crater (Mercury)\n* South Pole – Aitken basin (Moon)\n* Herschel crater (Mimas)\n\nLargest named craters in the Solar System\n\n# North Polar Basin/Borealis Basin (disputed) – Mars – Diameter: 10,600 km\n# South Pole-Aitken basin – Moon – Diameter: 2,500 km\n# Hellas Basin – Mars – Diameter: 2,100 km\n\n# Caloris Basin – Mercury – Diameter: 1,550 km\n# Imbrium Basin – Moon – Diameter: 1,100 km\n# Isidis Planitia – Mars – Diameter: 1,100 km\n# Mare Tranquilitatis – Moon – Diameter: 870 km\n# Argyre Planitia – Mars – Diameter: 800 km\n# Rembrandt – Mercury – Diameter: 715 km\n# Serenitatis Basin – Moon – Diameter: 700 km\n# Mare Nubium – Moon – Diameter: 700 km\n# Beethoven – Mercury – Diameter: 625 km\n# Valhalla – Callisto – Diameter: 600 km, with rings to 4,000 km diameter\n# Hertzsprung – Moon – Diameter: 590 km\n# Turgis – Iapetus – Diameter: 580 km\n# Apollo – Moon – Diameter: 540 km\n# Engelier – Iapetus – Diameter: 504 km\n# Mamaldi – Rhea – Diameter: 480 km\n# Huygens – Mars – Diameter: 470 km\n# Schiaparelli – Mars – Diameter: 470 km\n# Rheasilvia – 4 Vesta – Diameter: 460 km\n# Gerin – Iapetus – Diameter: 445 km\n# Odysseus – Tethys – Diameter: 445 km\n# Korolev – Moon – Diameter: 430 km\n# Falsaron – Iapetus – Diameter: 424 km\n# Dostoevskij – Mercury – Diameter: 400 km\n# Menrva – Titan – Diameter: 392 km\n# Tolstoj – Mercury – Diameter: 390 km\n# Goethe – Mercury – Diameter: 380 km\n# Malprimis – Iapetus – Diameter: 377 km\n# Tirawa – Rhea – Diameter: 360 km\n# Orientale Basin – Moon – Diameter: 350 km, with rings to 930 km diameter\n# Evander – Dione – Diameter: 350 km\n# Epigeus – Ganymede – Diameter: 343 km\n# Gertrude – Titania – Diameter: 326 km\n# Telemus – Tethys – Diameter: 320 km\n# Asgard – Callisto – Diameter: 300 km, with rings to 1,400 km diameter\n# Vredefort crater – Earth – Diameter: 300 km\n# Kerwan – Ceres – Diameter: 284 km\n# Powehiwehi – Rhea – Diameter: 271 km\nThere are approximately twelve more impact craters/basins larger than 300 km on the Moon, five on Mercury, and four on Mars.[http://planetarynames.wr.usgs.gov/ USGS Astrogeology: Gazetteer of Planetary Nomenclature] Large basins, some unnamed but mostly smaller than 300 km, can also be found on Saturn's moons Dione, Rhea and Iapetus.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Impact crater" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6416" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An impact crater is an approximately circular depression in the surface of a planet, moon, or other solid body in the Solar System or elsewhere, formed by the hypervelocity impact of a smaller body. In contrast to volcanic craters, which result from explosion or internal collapse,Basaltic Volcanism Study Project. (1981). Basaltic Volcanism on the Terrestrial Planets; Pergamon Press, Inc.: New York, p. 746. http://articles.adsabs.harvard.edu//full/book/bvtp./1981//0000746.000.html. impact craters typically have raised rims and floors that are lower in elevation than the surrounding terrain.Consolmagno, G.J.; Schaefer, M.W. (1994). Worlds Apart: A Textbook in Planetary Sciences; Prentice Hall: Englewood Cliffs, NJ, p.56. Although Meteor Crater is perhaps the best-known example of a small impact crater on Earth, impact craters range from small, simple, bowl-shaped depressions to large, complex, multi-ringed impact basins.\n\nImpact craters are the dominant geographic features on many solid Solar System objects including the Moon, Mercury, Callisto, Ganymede and most small moons and asteroids. On other planets and moons that experience more active surface geological processes, such as Earth, Venus, Mars, Europa, Io and Titan, visible impact craters are less common because they become eroded, buried or transformed by tectonics over time. Where such processes have destroyed most of the original crater topography, the terms impact structure or astrobleme are more commonly used. In early literature, before the significance of impact cratering was widely recognised, the terms cryptoexplosion or cryptovolcanic structure were often used to describe what are now recognised as impact-related features on Earth.French, B.M. (1998). Traces of Catastrophe: A Handbook of Shock-Metamorphic Effects in Terrestrial Meteorite Impact Structures; Simthsonian Institution: Washington DC, p. 97. http://www.lpi.usra.edu/publications/books/CB-954/CB-954.intro.html.\n\nThe cratering records of very old surfaces, such as Mercury, the Moon, and the southern highlands of Mars, record a period of intense early bombardment in the inner Solar System around 3.9 billion years ago. The rate of crater production on Earth has since been considerably lower, but it is appreciable nonetheless; Earth experiences from one to three impacts large enough to produce a 20 km diameter crater about once every million years on average.Carr, M.H. (2006) The surface of Mars; Cambridge University Press: Cambridge, UK, p. 23.Grieve R.A.; Shoemaker, E.M. (1994). The Record of Past Impacts on Earth in Hazards due to Comets and Asteroids, T. Gehrels, Ed.; University of Arizona Press, Tucson, AZ, pp. 417–464. This indicates that there should be far more relatively young craters on the planet than have been discovered so far. The cratering rate in the inner solar system fluctuates as a consequence of collisions in the asteroid belt that create a family of fragments that are often sent cascading into the inner solar system.  Formed in a collision 160 million years ago, the Baptistina family of asteroids is thought to have caused a large spike in the impact rate, perhaps causing the Chicxulub impact that may have triggered the extinction of the non-avian dinosaurs 66 million years ago. Note that the rate of impact cratering in the outer Solar System could be different from the inner Solar System.\n\nAlthough Earth's active surface processes quickly destroy the impact record, about [http://www.passc.net/EarthImpactDatabase/ 190] terrestrial impact craters have been identified.Grieve, R.A.F.; Cintala, M.J.; Tagle, R. (2007). Planetary Impacts in Encyclopedia of the Solar System, 2nd ed., L-A. McFadden et al. Eds, p. 826. These range in diameter from a few tens of meters up to about 300 km, and they range in age from recent times (e.g. the Sikhote-Alin craters in Russia whose creation was witnessed in 1947) to more than two billion years, though most are less than 500 million years old because geological processes tend to obliterate older craters. They are also selectively found in the stable interior regions of continents.Shoemaker, E.M.; Shoemaker, C.S. (1999). The Role of Collisions in The New Solar System, 4th ed., J.K. Beatty et al., Eds., p. 73. Few undersea craters have been discovered because of the difficulty of surveying the sea floor, the rapid rate of change of the ocean bottom, and the subduction of the ocean floor into Earth's interior by processes of plate tectonics.\n\nImpact craters are not to be confused with landforms that may appear similar, including calderas, sinkholes, glacial cirques, ring dikes, salt domes, and others.\n\nHistory\n\nDaniel Barringer (1860–1929) was one of the first to identify an impact crater, Meteor Crater in Arizona; to crater specialists the site is referred to as Barringer Crater in his honor. Initially Barringer's ideas were not widely accepted, and even when the origin of Meteor Crater was finally acknowledged, the wider implications for impact cratering as a significant geological process on Earth were not.\n\nIn the 1920s, the American geologist Walter H. Bucher studied a number of sites now recognized as impact craters in the United States. He concluded they had been created by some great explosive event, but believed that this force was probably volcanic in origin. However, in 1936, the geologists John D. Boon and Claude C. Albritton Jr. revisited Bucher's studies and concluded that the craters that he studied were probably formed by impacts.\n\nThe concept of impact cratering remained more or less speculative until the 1960s. At that time a number of researchers, most notably Eugene Shoemaker, (co-discoverer of the comet Shoemaker-Levy 9), conducted detailed studies of a number of craters and recognized clear evidence that they had been created by impacts, specifically identifying the shock-metamorphic effects uniquely associated with impact events, of which the most familiar is shocked quartz.\n\nArmed with the knowledge of shock-metamorphic features, Carlyle S. Beals and colleagues at the Dominion Astrophysical Observatory in Victoria, British Columbia, Canada and Wolf von Engelhardt of the University of Tübingen in Germany began a methodical search for impact craters. By 1970, they had tentatively identified more than 50. Although their work was controversial, the American Apollo Moon landings, which were in progress at the time, provided supportive evidence by recognizing the rate of impact cratering on the Moon.Grieve, R.A.F. (1990) Impact Cratering on the Earth. Scientific American, April 1990, p. 66. Because the processes of erosion on the Moon are minimal, craters persist almost indefinitely. Since the Earth could be expected to have roughly the same cratering rate as the Moon, it became clear that the Earth had suffered far more impacts than could be seen by counting evident craters.\n\nCrater formation\n\nImpact cratering involves high velocity collisions between solid objects, typically much greater than the velocity of sound in those objects.  Such hyper-velocity impacts produce physical effects such as melting and vaporization that do not occur in familiar sub-sonic collisions.  On Earth, ignoring the slowing effects of travel through the atmosphere, the lowest impact velocity with an object from space is equal to the gravitational escape velocity of about 11 km/s. The fastest impacts occur at about 72 km/s in the \"worst case\" scenario in which an object in a retrograde near-parabolic orbit hits Earth. (Because kinetic energy scales as velocity squared, Earth's gravity only contributes 1 km/s to this figure, not 11 km/s). The median impact velocity on Earth is about 20 km/s.\n\nHowever, the slowing effects of travel through the atmosphere rapidly decelerate any potential impactor, especially in the lowest 12 kilometres where 90% of the earth’s atmospheric mass lies. Meteorites of up to 7,000 kg lose all their cosmic velocity due to atmospheric drag at a certain altitude (retardation point), and start to accelerate again due to Earth's gravity until the body reaches its terminal velocity of  0.09 to 0.16 km/s. The larger the meteoroid (i.e. asteroids and comets) the more of its initial cosmic velocity it preserves. While an object of 9,000 kg maintains about 6% of its original velocity, one of 900,000 kg already preserves about 70%. Extremely large bodies (about 100,000 tonnes) are not slowed by the atmosphere at all, and impact with their initial cosmic velocity if no prior disintegration occurs.\n\nImpacts at these high speeds produce shock waves in solid materials, and both impactor and the material impacted are rapidly compressed to high density. Following initial compression, the high-density, over-compressed region rapidly depressurizes, exploding violently, to set in train the sequence of events that produces the impact crater. Impact-crater formation is therefore more closely analogous to cratering by high explosives than by mechanical displacement. Indeed, the energy density of some material involved in the formation of impact craters is many times higher than that generated by high explosives. Since craters are caused by explosions, they are nearly always circular – only very low-angle impacts cause significantly elliptical craters.Melosh, H.J., 1989, Impact cratering: A geologic process: New York, Oxford University Press, 245 p.\n\nThis describes impacts on solid surfaces. Impacts on porous surfaces, such as that of Hyperion, may produce internal compression without ejecta, punching a hole in the surface without filling in nearby craters. This may explain the 'sponge-like' appearance of that moon.[http://www.space.com/4028-key-giant-space-sponge-revealed.html 'Key to Giant Space Sponge Revealed'], Space.com, 4 July 2007\n\nIt is convenient to divide the impact process conceptually into three distinct stages: (1) initial contact and compression, (2) excavation, (3) modification and collapse.  In practice, there is overlap between the three processes with, for example, the excavation of the crater continuing in some regions while modification and collapse is already underway in others.\n\nContact and compression\n\nIn the absence of atmosphere, the impact process begins when the impactor first touches the target surface. This contact accelerates the target and decelerates the impactor.  Because the impactor is moving so rapidly, the rear of the object moves a significant distance during the short-but-finite time taken for the deceleration to propagate across the impactor. As a result, the impactor is compressed, its density rises, and the pressure within it increases dramatically.  Peak pressures in large impacts exceed 1 TPa to reach values more usually found deep in the interiors of planets, or generated artificially in nuclear explosions.\n\nIn physical terms, a shock wave originates from the point of contact.  As this shock wave expands, it decelerates and compresses the impactor, and it accelerates and compresses the target. Stress levels within the shock wave far exceed the strength of solid materials; consequently, both the impactor and the target close to the impact site are irreversibly damaged.  Many crystalline minerals can be transformed into higher-density phases by shock waves; for example, the common mineral quartz can be transformed into the higher-pressure forms coesite and stishovite.  Many other shock-related changes take place within both impactor and target as the shock wave passes through, and some of these changes can be used as diagnostic tools to determine whether particular geological features were produced by impact cratering.\n\nAs the shock wave decays, the shocked region decompresses towards more usual pressures and densities. The damage produced by the shock wave raises the temperature of the material. In all but the smallest impacts this increase in temperature is sufficient to melt the impactor, and in larger impacts to vaporize most of it and to melt large volumes of the target. As well as being heated, the target near the impact is accelerated by the shock wave, and it continues moving away from the impact behind the decaying shock wave.\n\nExcavation\n\nContact, compression, decompression, and the passage of the shock wave all occur within a few tenths of a second for a large impact. The subsequent excavation of the crater occurs more slowly, and during this stage the flow of material is largely subsonic. During excavation, the crater grows as the accelerated target material moves away from the point of impact. The target's motion is initially downwards and outwards, but it becomes outwards and upwards. The flow initially produces an approximately hemispherical cavity that continues to grow, eventually producing a paraboloid (bowl-shaped) crater in which the centre has been pushed down, a significant volume of material has been ejected, and a topographically elevated crater rim has been pushed up.  When this cavity has reached its maximum size, it is called the transient cavity.\n\nThe depth of the transient cavity is typically a quarter to a third of its diameter. Ejecta thrown out of the crater do not include material excavated from the full depth of the transient cavity; typically the depth of maximum excavation is only about a third of the total depth.  As a result, about one third of the volume of the transient crater is formed by the ejection of material, and the remaining two thirds is formed by the displacement of material downwards, outwards and upwards, to form the elevated rim.  For impacts into highly porous materials, a significant crater volume may also be formed by the permanent compaction of the pore space. Such compaction craters may be important on many asteroids, comets and small moons.\n\nIn large impacts, as well as material displaced and ejected to form the crater, significant volumes of target material may be melted and vaporized together with the original impactor.  Some of this impact melt rock may be ejected, but most of it remains within the transient crater, initially forming a layer of impact melt coating the interior of the transient cavity.  In contrast, the hot dense vaporized material expands rapidly out of the growing cavity, carrying some solid and molten material within it as it does so.  As this hot vapor cloud expands, it rises and cools much like the archetypal mushroom cloud generated by large nuclear explosions.  In large impacts, the expanding vapor cloud may rise to many times the scale height of the atmosphere, effectively expanding into free space.\n\nMost material ejected from the crater is deposited within a few crater radii, but a small fraction may travel large distances at high velocity, and in large impacts it may exceed escape velocity and leave the impacted planet or moon entirely.  The majority of the fastest material is ejected from close to the center of impact, and the slowest material is ejected close to the rim at low velocities to form an overturned coherent flap of ejecta immediately outside the rim.  As ejecta escapes from the growing crater, it forms an expanding curtain in the shape of an inverted cone. The trajectory of individual particles within the curtain is thought to be largely ballistic.\n\nSmall volumes of un-melted and relatively un-shocked material may be spalled at very high relative velocities from the surface of the target and from the rear of the impactor.  Spalling provides a potential mechanism whereby material may be ejected into inter-planetary space largely undamaged, and whereby small volumes of the impactor may be preserved undamaged even in large impacts.  Small volumes of high-speed material may also be generated early in the impact by jetting.  This occurs when two surfaces converge rapidly and obliquely at a small angle, and high-temperature highly shocked material is expelled from the convergence zone with velocities that may be several times larger than the impact velocity.\n\nModification and collapse\n\nIn most circumstances, the transient cavity is not stable and collapses under gravity.  In small craters, less than about 4 km diameter on Earth, there is some limited collapse of the crater rim coupled with debris sliding down the crater walls and drainage of impact melts into the deeper cavity.  The resultant structure is called a simple crater, and it remains bowl-shaped and superficially similar to the transient crater. In simple craters, the original excavation cavity is overlain by a lens of collapse breccia, ejecta and melt rock, and a portion of the central crater floor may sometimes be flat.\n\nAbove a certain threshold size, which varies with planetary gravity, the collapse and modification of the transient cavity is much more extensive, and the resulting structure is called a complex crater.  The collapse of the transient cavity is driven by gravity, and involves both the uplift of the central region and the inward collapse of the rim.  The central uplift is not the result of elastic rebound, which is a process in which a material with elastic strength attempts to return to its original geometry; rather the collapse is a process in which a material with little or no strength attempts to return to a state of gravitational equilibrium.\n\nComplex craters have uplifted centers, and they have typically broad flat shallow crater floors, and terraced walls.  At the largest sizes, one or more exterior or interior rings may appear, and the structure may be labeled an impact basin rather than an impact crater.  Complex-crater morphology on rocky planets appears to follow a regular sequence with increasing size: small complex craters with a central topographic peak are called central peak craters, for example Tycho; intermediate-sized craters, in which the central peak is replaced by a ring of peaks, are called peak-ring craters, for example Schrödinger; and the largest craters contain multiple concentric topographic rings, and are called multi-ringed basins, for example Orientale.  On icy (as opposed to rocky) bodies, other morphological forms appear that may have central pits rather than central peaks, and at the largest sizes may contain many concentric rings. Valhalla on Callisto is an example of this type.\n\nIdentifying impact craters \n\nNon-explosive volcanic craters can usually be distinguished from impact craters by their irregular shape and the association of volcanic flows and other volcanic materials. Impact craters produce melted rocks as well, but usually in smaller volumes with different characteristics.\n\nThe distinctive mark of an impact crater is the presence of rock that has undergone shock-metamorphic effects, such as shatter cones, melted rocks, and crystal deformations. The problem is that these materials tend to be deeply buried, at least for simple craters. They tend to be revealed in the uplifted center of a complex crater, however.\n\nImpacts produce distinctive shock-metamorphic effects that allow impact sites to be distinctively identified. Such shock-metamorphic effects can include:\n* A layer of shattered or \"brecciated\" rock under the floor of the crater. This layer is called a \"breccia lens\".\n* Shatter cones, which are chevron-shaped impressions in rocks. Such cones are formed most easily in fine-grained rocks.\n* High-temperature rock types, including laminated and welded blocks of sand, spherulites and tektites, or glassy spatters of molten rock. The impact origin of tektites has been questioned by some researchers; they have observed some volcanic features in tektites not found in impactites. Tektites are also drier (contain less water) than typical impactites. While rocks melted by the impact resemble volcanic rocks, they incorporate unmelted fragments of bedrock, form unusually large and unbroken fields, and have a much more mixed chemical composition than volcanic materials spewed up from within the Earth. They also may have relatively large amounts of trace elements that are associated with meteorites, such as nickel, platinum, iridium, and cobalt. Note: scientific literature has reported that some \"shock\" features, such as small shatter cones, which are often associated only with impact events, have been found also in terrestrial volcanic ejecta.\n* Microscopic pressure deformations of minerals. These include fracture patterns in crystals of quartz and feldspar, and formation of high-pressure materials such as diamond, derived from graphite and other carbon compounds, or stishovite and coesite, varieties of shocked quartz.\n* Buried craters, such as the Decorah crater, can be identified through drill coring, aerial electromagnetic resistivity imaging, and airborne gravity gradiometry.\n\nEconomic importance of impacts\n\nOn Earth impact craters have resulted in useful minerals.   Some of the ores produced from impact related effects on Earth include ores of iron, uranium, gold, copper, and nickel.  It is estimated that the value of materials mined from impact structures is 5 billion dollars/year just for North America.Grieve, R., V. Masaitis.  1994.  The Economic Potential of Terrestrial Impact Craters.  International Geology Review:  36, 105-151.   \nThe eventual usefulness of impact craters depends on several factors especially the nature of the materials that were impacted and when the materials were affected.  In some cases the deposits were already in place and the impact brought them to the surface.  These are called “progenetic economic deposits.”  Others were created during the actual impact.  The great energy involved caused melting.  Useful minerals formed as a result of this energy are classified as “syngenetic deposits.”  The third type, called “epigenetic deposits,” is caused by the creation of a basin from the impact.\nMany of the minerals that our modern lives depend on are associated with impacts in the past.  The Vredeford Dome in the center of the Witwatersrand Basin is the largest goldfield in the world which has supplied about 40% of all the gold ever mined is an impact structure.Daly, R.   1947.  The Vredefort ring structure of South Africa. Journal of Geology 55: 125145Hargraves,  R.  1961.  Shatter cones in the rocks of the Vredefort Ring. Transactions of the Geological Society of South Africa 64: 147-154Leroux H., Reimold W., Doukhan ,J.  1994.   A TEM investigation of shock metamorphism in quartz from the Vredefort Dome, South Africa. Tectonophysics 230: 223-230Martini , J.  1978.   Coesite and stishovite in the Vredefort Dome, South Africa. Nature 272: 715-717   The asteroid that struck the region was 6 miles wide.  The Sudbury Basin was caused by an impacting body over 6 miles in diameter.Grieve, R., Stöffler D, A. Deutsch.  1991.  The Sudbury Structure: controversial or misunderstood. Journal of Geophysical Research 96: 22 753-22 764French, B.  1970.  Possible Relations Between Meteorite Impact and Igneous Petrogenesis As Indicated by the Sudbury Structure, Ontario, Canada.  Bull. Volcan.  34, 466-517.   This basin is famous for its deposits of nickel, copper, and Platinum Group Elements.  An impact was involved in making the Carswell structure in Saskatchewan, Canada; it contains uranium deposits.Harper, C.  1983.   The Geology and Uranium Deposits of the Central Part of the Carswell Structure, Northern Sasketchewan, Canada. Unpublished PhD Thesis, Colorado School of Mines, Golden, CO, USA, 337 ppLainé,  R.,  D. Alonso,  M. Svab (eds).   1985.   The Carswell Structure Uranium Deposits. Geological Association of Canada, Special Paper 29: 230 ppGrieve, R., V. Masaitis.  1994.  The economic potential of terrestrial impact craters. International Geology Review 36: 105-151\nHydrocarbons are common around impact structures.  Fifty percent of impact structures in North America in hydrocarbon-bearing sedimentary basins contain oil/gas fields.http://nitishpriyadarshi.blogspot.com/2009/08/are-impact-craters-useful.html\n\nMartian Craters\n\nBecause of the many missions studying Mars since the 1960s, we have good coverage of its surface which contains large numbers of craters.  Many of the craters on Mars are different than on our moon and other moons since Mars contains ice under the ground, especially in the higher latitudes.  Some of the types of craters that have special shapes due to impact into ice-rich ground are pedestal craters, rampart craters, expanded craters, and LARLE craters.\n\nLists of craters\n\nImpact craters on Earth\n\nOn Earth, the recognition of impact craters is a branch of geology, and is related to planetary geology in the study of other worlds.  Out of many proposed craters, relatively few are confirmed.  The following twenty are a sample of articles of confirmed and well-documented impact sites.\n\nSee the Earth Impact Database,[https://www.unb.ca/passc/ImpactDatabase/essay.html Impact Cratering on Earth] a website concerned with 190 (as of November 2017) scientifically-confirmed impact craters on Earth.\n\nSome extraterrestrial craters\n\n* Caloris Basin (Mercury)\n* Hellas Basin (Mars)\n* Mare Orientale (Moon)\n* Petrarch crater (Mercury)\n* South Pole – Aitken basin (Moon)\n* Herschel crater (Mimas)\n\nLargest named craters in the Solar System\n\n# North Polar Basin/Borealis Basin (disputed) – Mars – Diameter: 10,600 km\n# South Pole-Aitken basin – Moon – Diameter: 2,500 km\n# Hellas Basin – Mars – Diameter: 2,100 km\n\n# Caloris Basin – Mercury – Diameter: 1,550 km\n# Imbrium Basin – Moon – Diameter: 1,100 km\n# Isidis Planitia – Mars – Diameter: 1,100 km\n# Mare Tranquilitatis – Moon – Diameter: 870 km\n# Argyre Planitia – Mars – Diameter: 800 km\n# Rembrandt – Mercury – Diameter: 715 km\n# Serenitatis Basin – Moon – Diameter: 700 km\n# Mare Nubium – Moon – Diameter: 700 km\n# Beethoven – Mercury – Diameter: 625 km\n# Valhalla – Callisto – Diameter: 600 km, with rings to 4,000 km diameter\n# Hertzsprung – Moon – Diameter: 590 km\n# Turgis – Iapetus – Diameter: 580 km\n# Apollo – Moon – Diameter: 540 km\n# Engelier – Iapetus – Diameter: 504 km\n# Mamaldi – Rhea – Diameter: 480 km\n# Huygens – Mars – Diameter: 470 km\n# Schiaparelli – Mars – Diameter: 470 km\n# Rheasilvia – 4 Vesta – Diameter: 460 km\n# Gerin – Iapetus – Diameter: 445 km\n# Odysseus – Tethys – Diameter: 445 km\n# Korolev – Moon – Diameter: 430 km\n# Falsaron – Iapetus – Diameter: 424 km\n# Dostoevskij – Mercury – Diameter: 400 km\n# Menrva – Titan – Diameter: 392 km\n# Tolstoj – Mercury – Diameter: 390 km\n# Goethe – Mercury – Diameter: 380 km\n# Malprimis – Iapetus – Diameter: 377 km\n# Tirawa – Rhea – Diameter: 360 km\n# Orientale Basin – Moon – Diameter: 350 km, with rings to 930 km diameter\n# Evander – Dione – Diameter: 350 km\n# Epigeus – Ganymede – Diameter: 343 km\n# Gertrude – Titania – Diameter: 326 km\n# Telemus – Tethys – Diameter: 320 km\n# Asgard – Callisto – Diameter: 300 km, with rings to 1,400 km diameter\n# Vredefort crater – Earth – Diameter: 300 km\n# Kerwan – Ceres – Diameter: 284 km\n# Powehiwehi – Rhea – Diameter: 271 km\nThere are approximately twelve more impact craters/basins larger than 300 km on the Moon, five on Mercury, and four on Mars.[http://planetarynames.wr.usgs.gov/ USGS Astrogeology: Gazetteer of Planetary Nomenclature] Large basins, some unnamed but mostly smaller than 300 km, can also be found on Saturn's moons Dione, Rhea and Iapetus. Impact crater. http://en.wikipedia.org/?curid=6416."
  }
}
