{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16724",
  "eid" : "27d3fa20-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778576066,
  "textBody" : "Kirk Lee Hammett (born November 18, 1962) is an American musician who has been lead guitarist and a contributing songwriter for the heavy metal band Metallica since 1983. Before joining Metallica he formed and named the band Exodus. In 2003, Hammett was ranked 11th on Rolling Stone's list of The 100 Greatest Guitarists of All Time.[https://www.rollingstone.com/music/lists/100-greatest-guitarists-of-all-time-19691231/kirk-hammett-19691231 Hammett ranked at number 11 on Rolling Stone's 100 Greatest Guitarists of All Time] In 2009, Hammett was ranked number 15 in Joel McIver's book The 100 Greatest Metal Guitarists.\n\nEarly life \n\nHammett was born on November 18, 1962 in San Francisco, and raised in the town of El Sobrante, California. He is the son of Teofila \"Chefela\" (née Oyao) and Dennis L. Hammett (a Merchant Marine). His mother is of Filipino descent and his father was of part Irish ancestry. He attended De Anza High School in Richmond, California. While attending De Anza High School, he met Les Claypool of Primus, and they remain close friends.\n\nHammett has a well-known passion for horror movies; that stretches back to the late Sixties. After spraining his arm in a fight with his sister at the age of five, Hammett’s parents placed him in front of the television. It was during this time that he first watched The Day of the Triffids.Angle, Brad. [http://www.guitarworld.com/interview-metallicas-kirk-hammett-his-new-book-too-much-horror-business Interview: Metallica's Kirk Hammett on His New Book, 'Too Much Horror Business'], Guitar World, December 21, 2012. Retrieved April 06, 2015. After that, Hammett found himself drawn to his brother’s Frankenstein figures, and it wasn’t long before he was spending his milk money on horror magazines. For the better part of the next decade, Hammett dove deep into the horror scene.\n\nHammett began showing an interest in music after listening to his brother Rick's extensive record collection (which included Jimi Hendrix, Led Zeppelin and UFO).[http://www.metallica.com/band/band-bio-kirk.asp Kirk Hammett (biography)], metallica.com. Retrieved April 6, 2015. It was then that Hammett's whole life shifted and he stopped collecting horror magazines, and began selling his magazines to buy music records. This all led him to properly picking up the guitar at the age of fifteen. Hammett's first guitar was (in his own words) a \"wholly unglamorous\" Montgomery Ward catalog special, which was accompanied by a shoebox (with a 4-inch speaker) for an amp. After purchasing a 1978 Fender Stratocaster copy, Hammett attempted to customize his sound with various guitar parts, before eventually buying a 1974 Gibson Flying V. Hammett also took a job at Burger King as a youth, which he quit as soon as he had saved enough money to purchase a Marshall amplifier.\n\nCareer\n\nExodus (1979–1983)\n\nHammett's musical interests eventually drew him into the fledgling thrash metal genre. In 1979, he formed the band Exodus at the age of sixteen,Titus, Christa. [http://www.billboard.com/articles/news/6258706/kirk-hammett-exodus-reunion-interview-album Metallica's Kirk Hammett Is 'Tickled' About Contributing to New Exodus Album], billboard.com, September 18, 2014. Retrieved April 4, 2015. along with vocalist Paul Baloff, guitarist Gary Holt, bassist Geoff Andrews, and drummer Tom Hunting. Hammett named Exodus after the Leon Uris novel of the same name,[http://www.blabbermouth.net/news/audio-premiere-exodus-new-song-salt-the-wound-featuring-metallicas-kirk-hammett/ \"Audio Premiere: EXODUS' New Song 'Salt The Wound' Featuring METALLICA's KIRK HAMMETT\"], blabbermouth.net, September 9, 2014. and played on the band's 1982 Demo. Exodus was an influential band in the Bay Area thrash movement.\n\nMetallica (1983–present) \n\nIn May 1983, Metallica traveled to Rochester, New York to record its debut album, Metal Up Your Ass. Due to the lead guitarist's (Dave Mustaine) substance abuse and violent tendencies, he was fired from the band, and would eventually form the band Megadeth. Hammett received a phone call from Metallica the same afternoon. Even though he had never left California before, Hammett gathered some money together and flew out to New York for an audition.  According to James Hetfield: - \"The first song we played was \"Seek and Destroy\", and Kirk pulled off this solo, and it was like...things are going to be alright!\"; so  Kirk was instantly asked to join the band. All of this happened prior to the recording of Kill 'Em All. At the time, Hammett was taking private lessons from guitar virtuoso Joe Satriani. He was also still a member of Exodus at the time he was offered to join Metallica, and although the offer may have come as a surprise to him, he was already well acquainted with Metallica.Giles, Jeff. [http://ultimateclassicrock.com/kirk-hammett-joins-metallica/ 32 Years Ago: Kirk Hammett Joins Metallica], ultimateclassicrock.com, April 01, 2015. While in Exodus, Hammett had shared the stage with Metallica on more than one occasion.\n\nHammett has written a number of riffs for Metallica since Ride the Lightning (the band's second album). One of his riffs was used on \"Enter Sandman\" - which went on to become one of Metallica's most popular songs. It was the first track and the first single on the band's self-titled album Metallica (also known as The Black Album), and was ranked 399th on Rolling Stones list of The 500 Greatest Songs of All Time.[https://www.rollingstone.com/news/coverstory/500songs rollingstone.com 500 greatest songs of all time]  The bridge for \"Creeping Death\" was originally an Exodus riff that Hammett took with him to Metallica.\n\nIn 1986, during the band's European leg of their tour to support Master of Puppets, Hammett and bassist Cliff Burton had a dispute over sleeping arrangements on the band's tour bus. The outcome of the dispute was decided by a card draw, which Burton won by picking the Ace of Spades. Once the draw was completed, Burton looked at Hammett and said \"I want your bunk\", to which Hammett complied, saying that he might be able to sleep better in the front of the bus anyway. In the early hours of the following morning, Metallica's tour bus slid off the road and overturned in Sweden. Burton was thrown through the window of the bus, which fell on top of Burton and subsequently killed him.Whitaker, Sterling. [http://ultimateclassicrock.com/metallica-bassist-cliff-burton-dies-in-a-bus-accident/ 28 Years Ago: Metallica Bassist Cliff Burton Dies in a Bus Accident], ultimateclassicrock.com, re-published September 27, 2014. Retrieved April 7, 2015. Hammett has stated in an interview that he once thought that it easily could've been him who was killed instead, since Burton was sleeping in what was considered to be Hammett's bunk.\n\nBetween the end of touring (and promoting) the Black Album and the start of touring in promotion of Load, he studied at San Francisco State University, focusing on Film and Asian arts. Hammett went through a \"blues period\" around this time - which had some influence on Metallica's Load and Reload albums.Tolinski, Brad. [http://www.guitarworld.com/interview-kirk-hammett-discusses-metallicas-death-magnetic Interview: Kirk Hammett Discusses Metallica's 'Death Magnetic'], Guitar World, November 21, 2012. Retrieved April 8, 2015. He also began listening to a lot of jazz music. Hammett described this period of his life as \"great education\",  because he was able to discover where all of his own rock influences had gotten their own guitar licks. However, even though jazz music had a profound effect on his improvisation skills and solos, Hammett felt that he was delving too deep into the genre. Since Death Magnetic, Hammett has gone back to being \"primarily\" a metal guitarist, but some of his experiences of jazz and blues music still remain.\n\nHammett wanted to have guitar solos on Metallica's 2003 album, St. Anger, but drummer Lars Ulrich and producer Bob Rock thought that the solos did not sound right in the songs. He later admitted himself, \"We tried to put in solos but they sounded like an afterthought so we left them out\".[http://www.blabbermouth.net/news/metallica-s-hammett-explains-why-there-are-no-guitar-solos-on-st-anger/ METALLICA's HAMMETT Explains Why There Are No Guitar Solos On 'St. Anger'], Ultimate Guitar, June 9, 2003. Retrieved April 7, 2015. Recording for St. Anger was halted in 2001; so that Metallica front-man James Hetfield could enter rehab for alcohol abuse.[http://www.billboard.com/articles/news/79038/metallicas-hetfield-in-rehab Metallica's Hetfield In Rehab], billboard.com, July 20, 2001. Retrieved April 8, 2015. Due to tensions within the band (which were well-documented in the Metallica documentary Some Kind of Monster) at the time, Hammett expressed interest in working on a solo album.Gregory, Jason. [http://www.gigwise.com/news/46156/metallicas-kirk-hammett-i-was-ready-to-go-solo-after-st-anger Metallica's Kirk Hammett: 'I Was Ready To Go Solo After 'St Anger: But was drawn back...], gigwise.com, September 17, 2008. Retrieved April 8, 2015. According to Hammett, if he ever worked on a solo album, it wouldn't be \"super-duty\" heavy metal,[http://www.metalunderground.com/news/details.cfm?newsid16823 Kirk Hammett: Metallica Has A Lot More To Say], metalunderground.com, November 27, 2005. Retrieved April 8, 2015. and may include some classical guitarists. When he was asked about his experiences of recording St. Anger, Hammett said:\n\nOn April 4, 2009, Hammett, along with Metallica bandmates Lars Ulrich, James Hetfield, and Robert Trujillo and former Metallica bandmates Jason Newsted and the deceased Cliff Burton, were inducted into the Rock and Roll Hall of Fame. In 2009, Hammett provided the foreword to British author Joel McIver's book To Live Is to Die: The Life and Death of Metallica's Cliff Burton.[http://www.roadrunnerrecords.com/blabbermouth.net/news.aspx?modeArticle&newsitemID\n112537 BLABBERMOUTH.NET – METALLICA Guitarist Provides Foreword To First-Ever CLIFF BURTON Biography]. Roadrunnerrecords.com. Retrieved on 2010-11-05.\n\nIn April, 2015, Hammett admitted to losing his phone - which contained 250 new \"ideas\" for Metallica's upcoming studio release.Kennelty, Greg. [http://www.metalinjection.net/ouch/kirk-hammett-lost-his-phone-containing-250-ideas-for-the-new-metallica-album \"Kirk Hammett Lost His Phone Containing 250 Ideas For The New METALLICA Album\"], metalinjection.net, published April 20, 2015. Retrieved June 14, 2015.[http://www.blabbermouth.net/news/kirk-hammett-lost-his-phone-containing-250-musical-ideas-for-next-metallica-album/ \"KIRK HAMMETT Lost His Phone Containing 250 Musical Ideas For Next METALLICA Album\"], blabbermouth.net, published April 18, 2015. Retrieved June 14, 2015. The incident happened about six months prior to the admission (around November 2014). The phone wasn't backed up and Hammett can only remember eight out of the 250 \"ideas\" he had. On the subject, Hammett said:\n\nOther appearances\n\nHe also appeared on the Kichigai E.P. by punk band Septic Death. He played additional lead guitar on the title track.\n\nHammett can be seen in the background in Primus' \"John the Fisherman\" video fishing off of Les Claypool's boat. Hammett has been friends with Primus bassist and lead vocalist Les Claypool since childhood. Claypool even auditioned for Metallica after the tragic death of Cliff Burton.[http://www.ultimate-guitar.com/news/general_music_news/primus_les_claypool_remembers_metallica_audition.html Primus' Les Claypool Remembers Metallica Audition], Ultimate Guitar, June 14, 2011. Retrieved April 8, 2015.\n\nHammett played guitar on the track \"Satan\" with Orbital for the Spawn: The Album soundtrack released in July 1997.\n\nHammett plays a guitar solo on Pansy Division's song Headbanger which appears on the ep \"For Those About to Suck Cock\" Lookout Records 1996 http://www.pansydivision.com/www.pansydivision.com/FAQ.html\n\nIn 2005, Hammett was featured playing the guitar roles on the Carlos Santana track \"Trinity\" alongside steel-pedal guitarist, Robert Randolph. Santana personally asked Hammett to contribute to his then-upcoming album All That I Am.[http://www.ultimate-guitar.com/news/online_downloads/kirk_hammett_on_new_santana_album.html Kirk Hammett On New Santana Album], Ultimate Guitar, September 23, 2005. Retrieved April 8, 2015. Hammett previously worked with Santana in 2001 at a live show benefit in San Francisco. Metallica had also invited Santana into the studio while recording St. Anger.\n\nIn 2006, Hammett voiced himself on The Simpsons (\"The Mook, the Chef, the Wife and Her Homer\"). He also provided various voices on the Adult Swim show Metalocalypse, including a two fingered fan (\"The Curse of Dethklok\"), The Queen of Denmark (\"Happy Dethday\"), and a Finnish barkeep (\"Dethtroll\").\n\nHammett also appeared as a guest in an episode of Space Ghost Coast to Coast titled \"Jacksonville\", alongside fellow Metallica member James Hetfield.\n\nHe appeared as a guest guitarist on K'Naan's 2006 song \"If Rap Gets Jealous\" off of the Troubadour album.\n\nAfter performing a set with Metallica at Bonnaroo in June 2008, Hammett played one song with My Morning Jacket and a couple songs with the annual Superjam collaboration, which also included Les Claypool and members of Gogol Bordello playing primarily Tom Waits songs.\n\nHammett is one of the main characters in Guitar Hero: Metallica, along with the rest of the current line-up of Metallica.\n\nIn 2010, Hammett played with Nicolas Abou Chedid on Chedid's solo album.\n\nIn 2011, Hammett appeared in an episode of Jon Benjamin Has a Van as an actor and guitarist.\n\nBook\n\nOn October 1, 2012, Abrams Image published Hammett's first book, Too Much Horror Business (a collection of photos detailing Hammett's lifelong love of monster movies and horror memorabilia).Florino, Rick (September 11, 2012). [http://www.artistdirect.com/entertainment-news/article/kirk-hammett-of-metallica-talks-his-book-too-much-horror-business/10230247 \"Kirk Hammett of Metallica Talks His Book 'Too Much Horror Business'\"]. Artistdirect Hammett has said that the book is \"basically\" all of the horror memorabilia he has managed to amass over the last 30 years. In an interview with Guitar World, Hammett said that he has such a huge horror collection and thought it was the right time to share it with everyone.Hart, Josh. [http://www.guitarworld.com/kirk-hammett-release-too-much-horror-business-book-october Kirk Hammett to Release 'Too Much Horror Business' Book in October], Guitar World, June 20, 2012. Retrieved April 06, 2015. The 228 page hardcover features more than 300 images of Hammett's horror collection. Among these images are the costumes from the Bela Lugosi movies White Zombie and The Black Cat (which also starred Boris Karloff), original movie posters (ranging from Nosferatu to Hellraiser), rare horror-themed toys (including the 'Great Garloo' and 'Frankenstein Tricky Walkers'), movie props (including the 'Dr. Tongue' zombie from George Romero's Day of the Dead, original Basil Gogos 'Famous Monsters', and fantasy paintings by the late Frank Frazetta. In addition to the images from Hammett's horror collection, Too Much Horror Business contains three conversations with the guitarist about his childhood, the nature of his horror collection, and the connection between Metallica's music and horror movies. On the book, Hammett has been quoted saying:\n\nKirk Von Hammett's Fear FestEvil\n\nKirk Von Hammett's Fear FestEvil is an annual horror convention created by Kirk Hammett. The first annual  Fear FestEvil took place at the Regency Ballroom in San Francisco - over a three-day period (from February 6–8, 2014). Hammett was inspired to create his own horror convention after experiencing the enjoyment of making his “crypt” at the ‘’Orion Music + More’’ festival.Grow, Kory. [http://www.revolvermag.com/news/interview-metallicas-kirk-hammett-talks-horror-metal-and-his-inaugural-fear-festevil.html “Interview: Metallica’s Kirk Hammett Talks Horror, Metal, and His Inaugural Fear FestEvil”], ‘’revolvermag.com’’, January 15, 2014. Retrieved April 4, 2015. The convention features live music, signings, interactive displays, vending, live talks, and guest appearances.Barkan, Jonathan. [http://bloody-disgusting.com/news/3259029/metallicas-kirk-hammet-to-host-the-kirk-von-hammetts-fear-festevil-horror-convention/ “Metallica’s Kirk Hammet To Host The “Kirk Von Hammett’s Fear FestEvil” Horror Convention”], ‘’bloody-disgusting.com’’, October 11, 2013. Retrieved April 20, 2015. At the 2014 event, guests included Sara Karloff (daughter of actor Boris Karloff), Bela G. Lugosi (son of actor Bela Lugosi),Childers, Chad. [http://loudwire.com/metallica-kirk-hammett-exodus-death-angel-fear-festevil-event/ “Metallica’s Kirk Hammett to Join Exodus + Death Angel for Encores at Fear FestEvil Event”], ‘‘loudwire.com’’, January 3, 2014. Retrieved April 20, 2015. make-up artist Gregory Nicotero (who worked on George A. Romero’s Day of the Dead),  actor Tom Savini (who portrayed Sex Machine in From Dusk Till Dawn and worked on many of George A. Romero's movies), Heather Langenkamp (who portrayed Nancy in Wes Craven's A Nightmare on Elm Street),http://www.gettyimages.at/detail/nachrichtenfoto/heather-langenkamp-p-j-soles-and-patty-mullen-on-the-nachrichtenfoto/467862043. Retrieved April 20, 2015. Kane Hodder (who portrayed Jason Voorhees in the Friday the 13th film series), and Haruo Nakajima (of Godzilla fame).Childers, Chad. [http://loudwire.com/exodus-kirk-hammett-fear-festevil-2014/ “Exodus Join Kirk Hammett’s 2014 Fear FestEvil”], ‘’loudwire.com’’, December 23, 2013. Retrieved April 20, 2015. Other guests in attendance included Hammett’s former band Exodus, Death Angel, Orchid, Metallica band member Robert Trujillo, Richard Christy, Stephen Perkins,Chocko. [http://www.planetchocko.com/?p\n20080 “Fear FestEvil After Party featured Exodus, Kirk Hammett of Metallica and Special Guests”], August 3, 2014. Retrieved April 20, 2015. Slash, and Scott Ian. Exodus played on-stage with Carcass on the Friday, whilst Death Division and Orchid played before Death Angel on the Saturday. Hammett joined Exodus and Death Angel on-stage for their encores.\n\nThe second annual Fear FestEvil took place between April 10–12, 2015, at the Rockbar Theater in San Jose, California.Pasbani, Robert. [http://www.metalinjection.net/tour-dates/meshuggah-headlines-kirk-hammetts-fear-festevil-2015-does-that-mean-u-s-tour \"MESHUGGAH Headlines Kirk Hammett's Fear FestEvil 2015; Does That Mean U.S. Tour?\"], metalinjecton.net, January 9, 2015. Retrieved April 20, 2015. Meshuggah headlined the event, whilst High on Fire, Blues Pills, Agnostic Front, and Asada Messiah also made appearances. Orchid also made a second appearance at the Fear FestEvil. On April 10, VIP's were able to attend the Dinner and Murder Mystery - along with Hammett - at the Winchester Mystery House.\n\nPersonal life\n\nAt the age of eleven, Hammett was left traumatized after he witnessed his pet dog Tippy being raped by his next door neighbor.DR Dave De Sylvia. [http://www.sputnikmusic.com/news/3834/Kirk-Hammetts-Dog-Raped/  Kirk Hammett's Dog Raped], sputnikmusic.com, July 12, 2007. Retrieved April 06, 2015.[http://www.ultimate-guitar.com/news/general_music_news/kirk_hammett_neighbour_had_sex_with_my_dog.html Kirk Hammett: Neighbour Had Sex With My Dog], Ultimate Guitar, July 17, 2007. Retrieved April 06, 2015. On the subject, Hammett recalled:\n\nHammett has been married twice. His first marriage to Rebecca lasted three years, having ended in 1990, during the recording of The Black Album. Hammett has been married to his second wife Lani since 1998. They have two sons, Angel (b. September 29, 2006), and Vincenzo (b. June 28, 2008). He and his family reside in San Francisco.[http://www.metallica.com/band/band-bio-kirk.asp Kirk Hammett biography], metallica.com. Retrieved April 6, 2015.\n\nIn addition to playing guitar and collecting horror memorabilia, Hammett's hobbies include reading comic books and surfing.[http://ultimatemetallica.com/kirk-hammett-biography/ Kirk Hammett (biography)], ultimatemetallica.com. Retrieved April 11, 2015.\n\nSubstance abuse\n\nAt one point in his life, Hammett spent a \"lot of money\" on drugs.Pushead. [http://www.metallicaworld.co.uk/Interviews/1986_thrasher.htm JAMES HETFIELD AND KIRK HAMMETT - THRASHER MAGAZINE 1986], metallicaworld.co.uk, 1986. Retrieved April 7, 2015.Wiederhorn, Jon. [http://www.guitarworld.com/archive-james-hetfield-and-kirk-hammett-metallica-discuss-their-1997-album-re-load?page\n0,2 From the Archive: James Hetfield and Kirk Hammett of Metallica Discuss Their 1997 Album, 'Re-Load'], Guitar World, November 25, 2011. Retrieved April 7, 2015. Hammett has said that he used drugs because he thought they would be fun.  During the Damaged Justice tour, he had a cocaine addiction. Hammett eventually pulled out of the addiction because cocaine made him feel depressed,[http://www.ultimatemetal.com/forum/testament/132357-metallica-playboy-interview-part-2-a.html Metallica Playboy Interview Part 2], ultimatemetal.com. Retrieved April 7, 2015. but relapsed during the Load era.[http://metallicablogmagnetic.com/metallica-the-ultimate-rock-monsters-tell-all/ Metallica: The Ultimate Rock Monsters Tell All], Q Magazine. Retrieved April 7, 2015. One of the reasons that Hammett spends a lot of money on comic books, is because he finds them to be a more enjoyable (and healthier) alternative to drugs. Hammett has also smoked heroin a few times, but \"didn't like it\".\n\nEnvironmentalism and Trump \n\nEven though Metallica chooses to stay away from politics, Hammett expressed his disagreement with U.S. President-elect Donald Trump's public pronouncements. In an interview with Billboard magazine, he said, “I’m just waiting to get into a personal Twitter war with him.” He stressed the importance of the fight against global warming, which Donald Trump claimed a hoax.\n\nEquipment and techniques\n\nHammett is known for always having his picking hand taped to protect his skin due to his habit of palm muting and fast picking during lengthy tours.\n\nHammett's playing style is noted for his extensive use of the wah-wah pedal in his solos. Hammett says \"The wah-wah is an extension of my personality.\"  Hammett's use of the wah-pedal hadn't been featured in recent Metallica solos, but has seen a resurgence in his solos on the 2008 album Death Magnetic, in songs like \"The Unforgiven III.\"\n\nGuitars\n\nKirk Hammett's tour guitars :\n* ESP M-II \"Zorlac\" – This was the starting line for the whole KH series. It features a vertical skull and crossbones as opposed to the horizontal ones featured on today's KH's, and an upside down Jackson Guitars style headstock which is what Hammett originally intended. However, Jackson Guitars threatened lawsuits if this model was ever sold. As a result, the headstock was changed to the typical ESP style, but flipped upside down.\n* ESP M-II Standard – with EMG and Seymour Duncan pickups. Hammett used this a lot in the studio and live.\n* ESP KH-2 \"Bride of Frankenstein\" – New for 2009.[http://www.metalremains.com/news/images/tour2009/07july2209_pic07.jpg Image of Hammett at Metalremains.com]\n* ESP KH-4 Chrome – New for 2009. A remake of his former KH-4 guitar, with a chrome pickguard, chrome hardware, and chrome EMG pickups.\n* ESP MII-NT – New for 2009. It is custom finished with Occult-themed graphics.\n* ESP KH-2 \"Skully\" – Hammett's main touring guitar. This signature model is based upon the modifications he made to his M-II.\n* ESP KH-2 M-II \"Boris Karloff Mummy\" #I – This has been Hammett's favourite guitar for many years. It features the Boris Karloff Mummy I graphic of which Hammett owns the rights to. It will not be released by ESP. Hammett has two of these guitars, one with Eye of Horus inlays and the other with hieroglyphics inlays.\n* ESP KH-2 M-II \"Ouija\" – This guitar contains two spelling errors. It sports the words \"WILLIAM FUED TALKING BAARD SET\" but it in fact should say \"WILLIAM FULD TALKING BOARD SET\". Hammett also now plays a white version of this guitar on tour.\n* ESP KH-2 M-II \"Greenburst\" A standard KH-2 with a custom green sunburst finish, green inlays, and green logo.\n* ESP KH-3 Eclipse – Pushead Spider graphic. It is taken from a classic Les Paul Jr. shape with a Floyd Rose vibrato and EMG pickups.\n* ESP Flying V copy – Cherry Red with white pickguard and gold hardware. Hammett uses this live mostly for the song \"Seek & Destroy\".\n* ESP Michael Schenker Flying V[http://dashboard.metallica.com/ivergence/image/11nov1808_pic27.jpg Image]\n* ESP VIPER Baritone;; Used for performances of \"The Unnamed Feeling\".\n* Gibson 1968 Les Paul Custom – Mostly on ballads such as \"Fade to Black\" and \"Welcome Home\".[http://media.photobucket.com/image/1968%20Les%20Paul%20Custom%20Kirk/Stryke-Azrael/Kirk_Hammet_Les_Paul_by_karpett.jpg 1968 les paul custom kirk image by Stryke-Azrael on Photobucket]. Media.photobucket.com. Retrieved on 2010-11-05.\n* Gibson Les Paul Standard – Used on songs from St. Anger.[http://dashboard.metallica.com/ivergence/image/10oct2008_pic06.jpg Image]\n* Ibanez RG – Used during the Wherever We May Roam American and European tour. It was used as a stunt guitar and for Deep Purple covers.\n* Jackson Randy Rhoads Model RR1T – Custom made specifically for Hammett. It is usually tuned one step down from standard tuning, and used for songs like \"Sad but True\" and \"The Memory Remains\".\n* TC Customs Death Magnetic Flying V – Used on the World Magnetic Tour.\n* Teuffel Birdfish – Designed and produced by German guitar designer/builder, Ulrich Teuffel. The model is limited (500 made) and is made to amplify sound using various pickups. This guitar is used live for \"The Judas Kiss\".[http://www.teuffelguitars.de/english/guitars/birdfish/birdfish_main.htm birdfish]. Teuffelguitars.de. Retrieved on 2010-11-05.\n* Teuffel Tulsa\n\nOn the 25th anniversary of Metallica's debut album Kill 'Em All, Hammett appears on the cover of Feb. 2008's Guitar World sporting his new custom ESP. This model is the KH20, the 20th anniversary model from ESP.\n\nIn 2014, Hammett purchased the 1959 Les Paul formerly used by Gary Moore and Peter Green; using it on tour  when playing the Thin Lizzy cover: \"Whiskey in the Jar\".\n\nAmplifiers and cabinets\n\nThroughout Metallica's career, Hammett has used a range of different amplifiers. For the first two albums, he used Marshall amplifiers and cabinets, with occasional effects. For the recording of Metallica's third album, Master of Puppets (1986), he and James Hetfield bought a Mesa/Boogie MarkIIC+ amplifier, and used Mesa/Boogie Dual Rectifier heads. Even when he made his move to Randall Amplifiers in 2007, he still used Mesa/Boogie amplifiers in his setup, and still does to this day. He currently uses two rackmounted Dual Rectifier 2-channel heads in tandem with his Randalls.\n\nIn September 2007, Randall Amplifiers announced a partnership with Hammett to design a line of signature amplifiers, heads, combos and preamp modules.[http://www.randallamplifiers.com/about/news/pr_hammett.asp Randall Amplifiers Announces Partnership With Kirk Hammett of Metallica] \n\nIn December 2011, it was announced by Fortin Amps that they would team up with Randall to start a new line of tube amplifiers based on the Fortin Meathead amplifier. Hammett is currently using a prototype of the amplifier that he used for the Big 4 show at Yankee Stadium and for all of the shows in India and Asia, and was recently sent a second prototype.\n\n* Mesa/Boogie Rackmounted Dual Rectifier (x2)\n* Randall RM100KH Signature Model (modified version of the MTS series RM100) (x1)\n* Randall/Fortin Prototype head (x2)\n\n* Randall 4x12 Cabinets (x4)\n* Randall/Fortin 4x12 Cabinet\n\nEffects\n\nTo avoid problems with pedals being damaged during live performances, Hammett keeps his effect pedals in a rack along with his amplifiers and his guitar technician controls them through a pedalboard sidestage. The pedal controller allows him to change between different effect pedals and amplifiers.\n\nIn 2008, Jim Dunlop started working in partnership with Hammett to create a signature Wah-wah pedal, the KH95. It is now available to buy in stores.\n\n* TC Electronic G-Major 2 effects processor\n* Boss NS-2 Noise Suppressor\n* Dunlop KH95 Kirk Hammett Signature Crybaby\n* Ibanez Tube Screamer (Keeley modified)\n* DigiTech Whammy WH-1\n* Line 6 DL4 Delay Modeler\n* Line 6 MM4 Modulation Modeler\n\n* Shure UR-4D Wireless Receiver\n* GCX Audio Switcher\n* Voodoo Lab Ground Control Pro floorboard\n* DBX 1074 Quad Gate\n* MXR Eddie Van Halen Flanger\n* MXR Bass Octave Deluxe\n* DigiTech Space Station\n* ToneBone Hot British Tube Distortion\n\nAccessories\n\n* Ernie Ball \"Power Slinky\" strings (.11-.48)\n* Jim Dunlop Dunlop Jazz III Kirk Hammett(green)\n* Levy Custom Straps\n\n* Peterson Strobe 420 Tuner\n* Bridge position: EMG 81\n* Neck position: Some Guitars EMG 81 Others EMG 60 (EMG 60 usually used for clean and to match harmony sections with James Hetfield)\n\nDiscography\n\nDeath Angel\n\n* Kill as One (Demo) (Producer)\n\nHeadbanged\n\n* Metal Militia (Demo)\n\nExodus\n\n* 1982 Demo (1982) (Demo)\n* Die By His Hand (1983) (Demo)http://www.metal-archives.com/albums/Exodus/Die_by_His_Hand/47727\n* Tempo of the Damned (2004) (Writing credit on \"Impaler\")\n* Blood In, Blood Out (2014) (Guitar solo on \"Salt the Wound\")\n\nMetallica",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kirk Hammett" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16724" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kirk Lee Hammett (born November 18, 1962) is an American musician who has been lead guitarist and a contributing songwriter for the heavy metal band Metallica since 1983. Before joining Metallica he formed and named the band Exodus. In 2003, Hammett was ranked 11th on Rolling Stone's list of The 100 Greatest Guitarists of All Time.[https://www.rollingstone.com/music/lists/100-greatest-guitarists-of-all-time-19691231/kirk-hammett-19691231 Hammett ranked at number 11 on Rolling Stone's 100 Greatest Guitarists of All Time] In 2009, Hammett was ranked number 15 in Joel McIver's book The 100 Greatest Metal Guitarists.\n\nEarly life \n\nHammett was born on November 18, 1962 in San Francisco, and raised in the town of El Sobrante, California. He is the son of Teofila \"Chefela\" (née Oyao) and Dennis L. Hammett (a Merchant Marine). His mother is of Filipino descent and his father was of part Irish ancestry. He attended De Anza High School in Richmond, California. While attending De Anza High School, he met Les Claypool of Primus, and they remain close friends.\n\nHammett has a well-known passion for horror movies; that stretches back to the late Sixties. After spraining his arm in a fight with his sister at the age of five, Hammett’s parents placed him in front of the television. It was during this time that he first watched The Day of the Triffids.Angle, Brad. [http://www.guitarworld.com/interview-metallicas-kirk-hammett-his-new-book-too-much-horror-business Interview: Metallica's Kirk Hammett on His New Book, 'Too Much Horror Business'], Guitar World, December 21, 2012. Retrieved April 06, 2015. After that, Hammett found himself drawn to his brother’s Frankenstein figures, and it wasn’t long before he was spending his milk money on horror magazines. For the better part of the next decade, Hammett dove deep into the horror scene.\n\nHammett began showing an interest in music after listening to his brother Rick's extensive record collection (which included Jimi Hendrix, Led Zeppelin and UFO).[http://www.metallica.com/band/band-bio-kirk.asp Kirk Hammett (biography)], metallica.com. Retrieved April 6, 2015. It was then that Hammett's whole life shifted and he stopped collecting horror magazines, and began selling his magazines to buy music records. This all led him to properly picking up the guitar at the age of fifteen. Hammett's first guitar was (in his own words) a \"wholly unglamorous\" Montgomery Ward catalog special, which was accompanied by a shoebox (with a 4-inch speaker) for an amp. After purchasing a 1978 Fender Stratocaster copy, Hammett attempted to customize his sound with various guitar parts, before eventually buying a 1974 Gibson Flying V. Hammett also took a job at Burger King as a youth, which he quit as soon as he had saved enough money to purchase a Marshall amplifier.\n\nCareer\n\nExodus (1979–1983)\n\nHammett's musical interests eventually drew him into the fledgling thrash metal genre. In 1979, he formed the band Exodus at the age of sixteen,Titus, Christa. [http://www.billboard.com/articles/news/6258706/kirk-hammett-exodus-reunion-interview-album Metallica's Kirk Hammett Is 'Tickled' About Contributing to New Exodus Album], billboard.com, September 18, 2014. Retrieved April 4, 2015. along with vocalist Paul Baloff, guitarist Gary Holt, bassist Geoff Andrews, and drummer Tom Hunting. Hammett named Exodus after the Leon Uris novel of the same name,[http://www.blabbermouth.net/news/audio-premiere-exodus-new-song-salt-the-wound-featuring-metallicas-kirk-hammett/ \"Audio Premiere: EXODUS' New Song 'Salt The Wound' Featuring METALLICA's KIRK HAMMETT\"], blabbermouth.net, September 9, 2014. and played on the band's 1982 Demo. Exodus was an influential band in the Bay Area thrash movement.\n\nMetallica (1983–present) \n\nIn May 1983, Metallica traveled to Rochester, New York to record its debut album, Metal Up Your Ass. Due to the lead guitarist's (Dave Mustaine) substance abuse and violent tendencies, he was fired from the band, and would eventually form the band Megadeth. Hammett received a phone call from Metallica the same afternoon. Even though he had never left California before, Hammett gathered some money together and flew out to New York for an audition.  According to James Hetfield: - \"The first song we played was \"Seek and Destroy\", and Kirk pulled off this solo, and it was like...things are going to be alright!\"; so  Kirk was instantly asked to join the band. All of this happened prior to the recording of Kill 'Em All. At the time, Hammett was taking private lessons from guitar virtuoso Joe Satriani. He was also still a member of Exodus at the time he was offered to join Metallica, and although the offer may have come as a surprise to him, he was already well acquainted with Metallica.Giles, Jeff. [http://ultimateclassicrock.com/kirk-hammett-joins-metallica/ 32 Years Ago: Kirk Hammett Joins Metallica], ultimateclassicrock.com, April 01, 2015. While in Exodus, Hammett had shared the stage with Metallica on more than one occasion.\n\nHammett has written a number of riffs for Metallica since Ride the Lightning (the band's second album). One of his riffs was used on \"Enter Sandman\" - which went on to become one of Metallica's most popular songs. It was the first track and the first single on the band's self-titled album Metallica (also known as The Black Album), and was ranked 399th on Rolling Stones list of The 500 Greatest Songs of All Time.[https://www.rollingstone.com/news/coverstory/500songs rollingstone.com 500 greatest songs of all time]  The bridge for \"Creeping Death\" was originally an Exodus riff that Hammett took with him to Metallica.\n\nIn 1986, during the band's European leg of their tour to support Master of Puppets, Hammett and bassist Cliff Burton had a dispute over sleeping arrangements on the band's tour bus. The outcome of the dispute was decided by a card draw, which Burton won by picking the Ace of Spades. Once the draw was completed, Burton looked at Hammett and said \"I want your bunk\", to which Hammett complied, saying that he might be able to sleep better in the front of the bus anyway. In the early hours of the following morning, Metallica's tour bus slid off the road and overturned in Sweden. Burton was thrown through the window of the bus, which fell on top of Burton and subsequently killed him.Whitaker, Sterling. [http://ultimateclassicrock.com/metallica-bassist-cliff-burton-dies-in-a-bus-accident/ 28 Years Ago: Metallica Bassist Cliff Burton Dies in a Bus Accident], ultimateclassicrock.com, re-published September 27, 2014. Retrieved April 7, 2015. Hammett has stated in an interview that he once thought that it easily could've been him who was killed instead, since Burton was sleeping in what was considered to be Hammett's bunk.\n\nBetween the end of touring (and promoting) the Black Album and the start of touring in promotion of Load, he studied at San Francisco State University, focusing on Film and Asian arts. Hammett went through a \"blues period\" around this time - which had some influence on Metallica's Load and Reload albums.Tolinski, Brad. [http://www.guitarworld.com/interview-kirk-hammett-discusses-metallicas-death-magnetic Interview: Kirk Hammett Discusses Metallica's 'Death Magnetic'], Guitar World, November 21, 2012. Retrieved April 8, 2015. He also began listening to a lot of jazz music. Hammett described this period of his life as \"great education\",  because he was able to discover where all of his own rock influences had gotten their own guitar licks. However, even though jazz music had a profound effect on his improvisation skills and solos, Hammett felt that he was delving too deep into the genre. Since Death Magnetic, Hammett has gone back to being \"primarily\" a metal guitarist, but some of his experiences of jazz and blues music still remain.\n\nHammett wanted to have guitar solos on Metallica's 2003 album, St. Anger, but drummer Lars Ulrich and producer Bob Rock thought that the solos did not sound right in the songs. He later admitted himself, \"We tried to put in solos but they sounded like an afterthought so we left them out\".[http://www.blabbermouth.net/news/metallica-s-hammett-explains-why-there-are-no-guitar-solos-on-st-anger/ METALLICA's HAMMETT Explains Why There Are No Guitar Solos On 'St. Anger'], Ultimate Guitar, June 9, 2003. Retrieved April 7, 2015. Recording for St. Anger was halted in 2001; so that Metallica front-man James Hetfield could enter rehab for alcohol abuse.[http://www.billboard.com/articles/news/79038/metallicas-hetfield-in-rehab Metallica's Hetfield In Rehab], billboard.com, July 20, 2001. Retrieved April 8, 2015. Due to tensions within the band (which were well-documented in the Metallica documentary Some Kind of Monster) at the time, Hammett expressed interest in working on a solo album.Gregory, Jason. [http://www.gigwise.com/news/46156/metallicas-kirk-hammett-i-was-ready-to-go-solo-after-st-anger Metallica's Kirk Hammett: 'I Was Ready To Go Solo After 'St Anger: But was drawn back...], gigwise.com, September 17, 2008. Retrieved April 8, 2015. According to Hammett, if he ever worked on a solo album, it wouldn't be \"super-duty\" heavy metal,[http://www.metalunderground.com/news/details.cfm?newsid16823 Kirk Hammett: Metallica Has A Lot More To Say], metalunderground.com, November 27, 2005. Retrieved April 8, 2015. and may include some classical guitarists. When he was asked about his experiences of recording St. Anger, Hammett said:\n\nOn April 4, 2009, Hammett, along with Metallica bandmates Lars Ulrich, James Hetfield, and Robert Trujillo and former Metallica bandmates Jason Newsted and the deceased Cliff Burton, were inducted into the Rock and Roll Hall of Fame. In 2009, Hammett provided the foreword to British author Joel McIver's book To Live Is to Die: The Life and Death of Metallica's Cliff Burton.[http://www.roadrunnerrecords.com/blabbermouth.net/news.aspx?modeArticle&newsitemID\n112537 BLABBERMOUTH.NET – METALLICA Guitarist Provides Foreword To First-Ever CLIFF BURTON Biography]. Roadrunnerrecords.com. Retrieved on 2010-11-05.\n\nIn April, 2015, Hammett admitted to losing his phone - which contained 250 new \"ideas\" for Metallica's upcoming studio release.Kennelty, Greg. [http://www.metalinjection.net/ouch/kirk-hammett-lost-his-phone-containing-250-ideas-for-the-new-metallica-album \"Kirk Hammett Lost His Phone Containing 250 Ideas For The New METALLICA Album\"], metalinjection.net, published April 20, 2015. Retrieved June 14, 2015.[http://www.blabbermouth.net/news/kirk-hammett-lost-his-phone-containing-250-musical-ideas-for-next-metallica-album/ \"KIRK HAMMETT Lost His Phone Containing 250 Musical Ideas For Next METALLICA Album\"], blabbermouth.net, published April 18, 2015. Retrieved June 14, 2015. The incident happened about six months prior to the admission (around November 2014). The phone wasn't backed up and Hammett can only remember eight out of the 250 \"ideas\" he had. On the subject, Hammett said:\n\nOther appearances\n\nHe also appeared on the Kichigai E.P. by punk band Septic Death. He played additional lead guitar on the title track.\n\nHammett can be seen in the background in Primus' \"John the Fisherman\" video fishing off of Les Claypool's boat. Hammett has been friends with Primus bassist and lead vocalist Les Claypool since childhood. Claypool even auditioned for Metallica after the tragic death of Cliff Burton.[http://www.ultimate-guitar.com/news/general_music_news/primus_les_claypool_remembers_metallica_audition.html Primus' Les Claypool Remembers Metallica Audition], Ultimate Guitar, June 14, 2011. Retrieved April 8, 2015.\n\nHammett played guitar on the track \"Satan\" with Orbital for the Spawn: The Album soundtrack released in July 1997.\n\nHammett plays a guitar solo on Pansy Division's song Headbanger which appears on the ep \"For Those About to Suck Cock\" Lookout Records 1996 http://www.pansydivision.com/www.pansydivision.com/FAQ.html\n\nIn 2005, Hammett was featured playing the guitar roles on the Carlos Santana track \"Trinity\" alongside steel-pedal guitarist, Robert Randolph. Santana personally asked Hammett to contribute to his then-upcoming album All That I Am.[http://www.ultimate-guitar.com/news/online_downloads/kirk_hammett_on_new_santana_album.html Kirk Hammett On New Santana Album], Ultimate Guitar, September 23, 2005. Retrieved April 8, 2015. Hammett previously worked with Santana in 2001 at a live show benefit in San Francisco. Metallica had also invited Santana into the studio while recording St. Anger.\n\nIn 2006, Hammett voiced himself on The Simpsons (\"The Mook, the Chef, the Wife and Her Homer\"). He also provided various voices on the Adult Swim show Metalocalypse, including a two fingered fan (\"The Curse of Dethklok\"), The Queen of Denmark (\"Happy Dethday\"), and a Finnish barkeep (\"Dethtroll\").\n\nHammett also appeared as a guest in an episode of Space Ghost Coast to Coast titled \"Jacksonville\", alongside fellow Metallica member James Hetfield.\n\nHe appeared as a guest guitarist on K'Naan's 2006 song \"If Rap Gets Jealous\" off of the Troubadour album.\n\nAfter performing a set with Metallica at Bonnaroo in June 2008, Hammett played one song with My Morning Jacket and a couple songs with the annual Superjam collaboration, which also included Les Claypool and members of Gogol Bordello playing primarily Tom Waits songs.\n\nHammett is one of the main characters in Guitar Hero: Metallica, along with the rest of the current line-up of Metallica.\n\nIn 2010, Hammett played with Nicolas Abou Chedid on Chedid's solo album.\n\nIn 2011, Hammett appeared in an episode of Jon Benjamin Has a Van as an actor and guitarist.\n\nBook\n\nOn October 1, 2012, Abrams Image published Hammett's first book, Too Much Horror Business (a collection of photos detailing Hammett's lifelong love of monster movies and horror memorabilia).Florino, Rick (September 11, 2012). [http://www.artistdirect.com/entertainment-news/article/kirk-hammett-of-metallica-talks-his-book-too-much-horror-business/10230247 \"Kirk Hammett of Metallica Talks His Book 'Too Much Horror Business'\"]. Artistdirect Hammett has said that the book is \"basically\" all of the horror memorabilia he has managed to amass over the last 30 years. In an interview with Guitar World, Hammett said that he has such a huge horror collection and thought it was the right time to share it with everyone.Hart, Josh. [http://www.guitarworld.com/kirk-hammett-release-too-much-horror-business-book-october Kirk Hammett to Release 'Too Much Horror Business' Book in October], Guitar World, June 20, 2012. Retrieved April 06, 2015. The 228 page hardcover features more than 300 images of Hammett's horror collection. Among these images are the costumes from the Bela Lugosi movies White Zombie and The Black Cat (which also starred Boris Karloff), original movie posters (ranging from Nosferatu to Hellraiser), rare horror-themed toys (including the 'Great Garloo' and 'Frankenstein Tricky Walkers'), movie props (including the 'Dr. Tongue' zombie from George Romero's Day of the Dead, original Basil Gogos 'Famous Monsters', and fantasy paintings by the late Frank Frazetta. In addition to the images from Hammett's horror collection, Too Much Horror Business contains three conversations with the guitarist about his childhood, the nature of his horror collection, and the connection between Metallica's music and horror movies. On the book, Hammett has been quoted saying:\n\nKirk Von Hammett's Fear FestEvil\n\nKirk Von Hammett's Fear FestEvil is an annual horror convention created by Kirk Hammett. The first annual  Fear FestEvil took place at the Regency Ballroom in San Francisco - over a three-day period (from February 6–8, 2014). Hammett was inspired to create his own horror convention after experiencing the enjoyment of making his “crypt” at the ‘’Orion Music + More’’ festival.Grow, Kory. [http://www.revolvermag.com/news/interview-metallicas-kirk-hammett-talks-horror-metal-and-his-inaugural-fear-festevil.html “Interview: Metallica’s Kirk Hammett Talks Horror, Metal, and His Inaugural Fear FestEvil”], ‘’revolvermag.com’’, January 15, 2014. Retrieved April 4, 2015. The convention features live music, signings, interactive displays, vending, live talks, and guest appearances.Barkan, Jonathan. [http://bloody-disgusting.com/news/3259029/metallicas-kirk-hammet-to-host-the-kirk-von-hammetts-fear-festevil-horror-convention/ “Metallica’s Kirk Hammet To Host The “Kirk Von Hammett’s Fear FestEvil” Horror Convention”], ‘’bloody-disgusting.com’’, October 11, 2013. Retrieved April 20, 2015. At the 2014 event, guests included Sara Karloff (daughter of actor Boris Karloff), Bela G. Lugosi (son of actor Bela Lugosi),Childers, Chad. [http://loudwire.com/metallica-kirk-hammett-exodus-death-angel-fear-festevil-event/ “Metallica’s Kirk Hammett to Join Exodus + Death Angel for Encores at Fear FestEvil Event”], ‘‘loudwire.com’’, January 3, 2014. Retrieved April 20, 2015. make-up artist Gregory Nicotero (who worked on George A. Romero’s Day of the Dead),  actor Tom Savini (who portrayed Sex Machine in From Dusk Till Dawn and worked on many of George A. Romero's movies), Heather Langenkamp (who portrayed Nancy in Wes Craven's A Nightmare on Elm Street),http://www.gettyimages.at/detail/nachrichtenfoto/heather-langenkamp-p-j-soles-and-patty-mullen-on-the-nachrichtenfoto/467862043. Retrieved April 20, 2015. Kane Hodder (who portrayed Jason Voorhees in the Friday the 13th film series), and Haruo Nakajima (of Godzilla fame).Childers, Chad. [http://loudwire.com/exodus-kirk-hammett-fear-festevil-2014/ “Exodus Join Kirk Hammett’s 2014 Fear FestEvil”], ‘’loudwire.com’’, December 23, 2013. Retrieved April 20, 2015. Other guests in attendance included Hammett’s former band Exodus, Death Angel, Orchid, Metallica band member Robert Trujillo, Richard Christy, Stephen Perkins,Chocko. [http://www.planetchocko.com/?p\n20080 “Fear FestEvil After Party featured Exodus, Kirk Hammett of Metallica and Special Guests”], August 3, 2014. Retrieved April 20, 2015. Slash, and Scott Ian. Exodus played on-stage with Carcass on the Friday, whilst Death Division and Orchid played before Death Angel on the Saturday. Hammett joined Exodus and Death Angel on-stage for their encores.\n\nThe second annual Fear FestEvil took place between April 10–12, 2015, at the Rockbar Theater in San Jose, California.Pasbani, Robert. [http://www.metalinjection.net/tour-dates/meshuggah-headlines-kirk-hammetts-fear-festevil-2015-does-that-mean-u-s-tour \"MESHUGGAH Headlines Kirk Hammett's Fear FestEvil 2015; Does That Mean U.S. Tour?\"], metalinjecton.net, January 9, 2015. Retrieved April 20, 2015. Meshuggah headlined the event, whilst High on Fire, Blues Pills, Agnostic Front, and Asada Messiah also made appearances. Orchid also made a second appearance at the Fear FestEvil. On April 10, VIP's were able to attend the Dinner and Murder Mystery - along with Hammett - at the Winchester Mystery House.\n\nPersonal life\n\nAt the age of eleven, Hammett was left traumatized after he witnessed his pet dog Tippy being raped by his next door neighbor.DR Dave De Sylvia. [http://www.sputnikmusic.com/news/3834/Kirk-Hammetts-Dog-Raped/  Kirk Hammett's Dog Raped], sputnikmusic.com, July 12, 2007. Retrieved April 06, 2015.[http://www.ultimate-guitar.com/news/general_music_news/kirk_hammett_neighbour_had_sex_with_my_dog.html Kirk Hammett: Neighbour Had Sex With My Dog], Ultimate Guitar, July 17, 2007. Retrieved April 06, 2015. On the subject, Hammett recalled:\n\nHammett has been married twice. His first marriage to Rebecca lasted three years, having ended in 1990, during the recording of The Black Album. Hammett has been married to his second wife Lani since 1998. They have two sons, Angel (b. September 29, 2006), and Vincenzo (b. June 28, 2008). He and his family reside in San Francisco.[http://www.metallica.com/band/band-bio-kirk.asp Kirk Hammett biography], metallica.com. Retrieved April 6, 2015.\n\nIn addition to playing guitar and collecting horror memorabilia, Hammett's hobbies include reading comic books and surfing.[http://ultimatemetallica.com/kirk-hammett-biography/ Kirk Hammett (biography)], ultimatemetallica.com. Retrieved April 11, 2015.\n\nSubstance abuse\n\nAt one point in his life, Hammett spent a \"lot of money\" on drugs.Pushead. [http://www.metallicaworld.co.uk/Interviews/1986_thrasher.htm JAMES HETFIELD AND KIRK HAMMETT - THRASHER MAGAZINE 1986], metallicaworld.co.uk, 1986. Retrieved April 7, 2015.Wiederhorn, Jon. [http://www.guitarworld.com/archive-james-hetfield-and-kirk-hammett-metallica-discuss-their-1997-album-re-load?page\n0,2 From the Archive: James Hetfield and Kirk Hammett of Metallica Discuss Their 1997 Album, 'Re-Load'], Guitar World, November 25, 2011. Retrieved April 7, 2015. Hammett has said that he used drugs because he thought they would be fun.  During the Damaged Justice tour, he had a cocaine addiction. Hammett eventually pulled out of the addiction because cocaine made him feel depressed,[http://www.ultimatemetal.com/forum/testament/132357-metallica-playboy-interview-part-2-a.html Metallica Playboy Interview Part 2], ultimatemetal.com. Retrieved April 7, 2015. but relapsed during the Load era.[http://metallicablogmagnetic.com/metallica-the-ultimate-rock-monsters-tell-all/ Metallica: The Ultimate Rock Monsters Tell All], Q Magazine. Retrieved April 7, 2015. One of the reasons that Hammett spends a lot of money on comic books, is because he finds them to be a more enjoyable (and healthier) alternative to drugs. Hammett has also smoked heroin a few times, but \"didn't like it\".\n\nEnvironmentalism and Trump \n\nEven though Metallica chooses to stay away from politics, Hammett expressed his disagreement with U.S. President-elect Donald Trump's public pronouncements. In an interview with Billboard magazine, he said, “I’m just waiting to get into a personal Twitter war with him.” He stressed the importance of the fight against global warming, which Donald Trump claimed a hoax.\n\nEquipment and techniques\n\nHammett is known for always having his picking hand taped to protect his skin due to his habit of palm muting and fast picking during lengthy tours.\n\nHammett's playing style is noted for his extensive use of the wah-wah pedal in his solos. Hammett says \"The wah-wah is an extension of my personality.\"  Hammett's use of the wah-pedal hadn't been featured in recent Metallica solos, but has seen a resurgence in his solos on the 2008 album Death Magnetic, in songs like \"The Unforgiven III.\"\n\nGuitars\n\nKirk Hammett's tour guitars :\n* ESP M-II \"Zorlac\" – This was the starting line for the whole KH series. It features a vertical skull and crossbones as opposed to the horizontal ones featured on today's KH's, and an upside down Jackson Guitars style headstock which is what Hammett originally intended. However, Jackson Guitars threatened lawsuits if this model was ever sold. As a result, the headstock was changed to the typical ESP style, but flipped upside down.\n* ESP M-II Standard – with EMG and Seymour Duncan pickups. Hammett used this a lot in the studio and live.\n* ESP KH-2 \"Bride of Frankenstein\" – New for 2009.[http://www.metalremains.com/news/images/tour2009/07july2209_pic07.jpg Image of Hammett at Metalremains.com]\n* ESP KH-4 Chrome – New for 2009. A remake of his former KH-4 guitar, with a chrome pickguard, chrome hardware, and chrome EMG pickups.\n* ESP MII-NT – New for 2009. It is custom finished with Occult-themed graphics.\n* ESP KH-2 \"Skully\" – Hammett's main touring guitar. This signature model is based upon the modifications he made to his M-II.\n* ESP KH-2 M-II \"Boris Karloff Mummy\" #I – This has been Hammett's favourite guitar for many years. It features the Boris Karloff Mummy I graphic of which Hammett owns the rights to. It will not be released by ESP. Hammett has two of these guitars, one with Eye of Horus inlays and the other with hieroglyphics inlays.\n* ESP KH-2 M-II \"Ouija\" – This guitar contains two spelling errors. It sports the words \"WILLIAM FUED TALKING BAARD SET\" but it in fact should say \"WILLIAM FULD TALKING BOARD SET\". Hammett also now plays a white version of this guitar on tour.\n* ESP KH-2 M-II \"Greenburst\" A standard KH-2 with a custom green sunburst finish, green inlays, and green logo.\n* ESP KH-3 Eclipse – Pushead Spider graphic. It is taken from a classic Les Paul Jr. shape with a Floyd Rose vibrato and EMG pickups.\n* ESP Flying V copy – Cherry Red with white pickguard and gold hardware. Hammett uses this live mostly for the song \"Seek & Destroy\".\n* ESP Michael Schenker Flying V[http://dashboard.metallica.com/ivergence/image/11nov1808_pic27.jpg Image]\n* ESP VIPER Baritone;; Used for performances of \"The Unnamed Feeling\".\n* Gibson 1968 Les Paul Custom – Mostly on ballads such as \"Fade to Black\" and \"Welcome Home\".[http://media.photobucket.com/image/1968%20Les%20Paul%20Custom%20Kirk/Stryke-Azrael/Kirk_Hammet_Les_Paul_by_karpett.jpg 1968 les paul custom kirk image by Stryke-Azrael on Photobucket]. Media.photobucket.com. Retrieved on 2010-11-05.\n* Gibson Les Paul Standard – Used on songs from St. Anger.[http://dashboard.metallica.com/ivergence/image/10oct2008_pic06.jpg Image]\n* Ibanez RG – Used during the Wherever We May Roam American and European tour. It was used as a stunt guitar and for Deep Purple covers.\n* Jackson Randy Rhoads Model RR1T – Custom made specifically for Hammett. It is usually tuned one step down from standard tuning, and used for songs like \"Sad but True\" and \"The Memory Remains\".\n* TC Customs Death Magnetic Flying V – Used on the World Magnetic Tour.\n* Teuffel Birdfish – Designed and produced by German guitar designer/builder, Ulrich Teuffel. The model is limited (500 made) and is made to amplify sound using various pickups. This guitar is used live for \"The Judas Kiss\".[http://www.teuffelguitars.de/english/guitars/birdfish/birdfish_main.htm birdfish]. Teuffelguitars.de. Retrieved on 2010-11-05.\n* Teuffel Tulsa\n\nOn the 25th anniversary of Metallica's debut album Kill 'Em All, Hammett appears on the cover of Feb. 2008's Guitar World sporting his new custom ESP. This model is the KH20, the 20th anniversary model from ESP.\n\nIn 2014, Hammett purchased the 1959 Les Paul formerly used by Gary Moore and Peter Green; using it on tour  when playing the Thin Lizzy cover: \"Whiskey in the Jar\".\n\nAmplifiers and cabinets\n\nThroughout Metallica's career, Hammett has used a range of different amplifiers. For the first two albums, he used Marshall amplifiers and cabinets, with occasional effects. For the recording of Metallica's third album, Master of Puppets (1986), he and James Hetfield bought a Mesa/Boogie MarkIIC+ amplifier, and used Mesa/Boogie Dual Rectifier heads. Even when he made his move to Randall Amplifiers in 2007, he still used Mesa/Boogie amplifiers in his setup, and still does to this day. He currently uses two rackmounted Dual Rectifier 2-channel heads in tandem with his Randalls.\n\nIn September 2007, Randall Amplifiers announced a partnership with Hammett to design a line of signature amplifiers, heads, combos and preamp modules.[http://www.randallamplifiers.com/about/news/pr_hammett.asp Randall Amplifiers Announces Partnership With Kirk Hammett of Metallica] \n\nIn December 2011, it was announced by Fortin Amps that they would team up with Randall to start a new line of tube amplifiers based on the Fortin Meathead amplifier. Hammett is currently using a prototype of the amplifier that he used for the Big 4 show at Yankee Stadium and for all of the shows in India and Asia, and was recently sent a second prototype.\n\n* Mesa/Boogie Rackmounted Dual Rectifier (x2)\n* Randall RM100KH Signature Model (modified version of the MTS series RM100) (x1)\n* Randall/Fortin Prototype head (x2)\n\n* Randall 4x12 Cabinets (x4)\n* Randall/Fortin 4x12 Cabinet\n\nEffects\n\nTo avoid problems with pedals being damaged during live performances, Hammett keeps his effect pedals in a rack along with his amplifiers and his guitar technician controls them through a pedalboard sidestage. The pedal controller allows him to change between different effect pedals and amplifiers.\n\nIn 2008, Jim Dunlop started working in partnership with Hammett to create a signature Wah-wah pedal, the KH95. It is now available to buy in stores.\n\n* TC Electronic G-Major 2 effects processor\n* Boss NS-2 Noise Suppressor\n* Dunlop KH95 Kirk Hammett Signature Crybaby\n* Ibanez Tube Screamer (Keeley modified)\n* DigiTech Whammy WH-1\n* Line 6 DL4 Delay Modeler\n* Line 6 MM4 Modulation Modeler\n\n* Shure UR-4D Wireless Receiver\n* GCX Audio Switcher\n* Voodoo Lab Ground Control Pro floorboard\n* DBX 1074 Quad Gate\n* MXR Eddie Van Halen Flanger\n* MXR Bass Octave Deluxe\n* DigiTech Space Station\n* ToneBone Hot British Tube Distortion\n\nAccessories\n\n* Ernie Ball \"Power Slinky\" strings (.11-.48)\n* Jim Dunlop Dunlop Jazz III Kirk Hammett(green)\n* Levy Custom Straps\n\n* Peterson Strobe 420 Tuner\n* Bridge position: EMG 81\n* Neck position: Some Guitars EMG 81 Others EMG 60 (EMG 60 usually used for clean and to match harmony sections with James Hetfield)\n\nDiscography\n\nDeath Angel\n\n* Kill as One (Demo) (Producer)\n\nHeadbanged\n\n* Metal Militia (Demo)\n\nExodus\n\n* 1982 Demo (1982) (Demo)\n* Die By His Hand (1983) (Demo)http://www.metal-archives.com/albums/Exodus/Die_by_His_Hand/47727\n* Tempo of the Damned (2004) (Writing credit on \"Impaler\")\n* Blood In, Blood Out (2014) (Guitar solo on \"Salt the Wound\")\n\nMetallica. Kirk Hammett. http://en.wikipedia.org/?curid=16724."
  }
}
