{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18139",
  "eid" : "3124ed00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778591696,
  "textBody" : "A League of Nations mandate was a legal status for certain territories transferred from the control of one country to another following World War I, or the legal instruments that contained the internationally agreed-upon terms for administering the territory on behalf of the League of Nations. These were of the nature of both a treaty and a constitution, which contained minority rights clauses that provided for the rights of petition and adjudication by the International Court. \n\nThe mandate system was established under Article 22 of the Covenant of the League of Nations, entered into on 28 June 1919. With the dissolution of the League of Nations after World War II, it was stipulated at the Yalta Conference that the remaining Mandates should be placed under the trusteeship of the United Nations, subject to future discussions and formal agreements. Most of the remaining mandates of the League of Nations (with the exception of South-West Africa) thus eventually became United Nations Trust Territories.\n\nTwo governing principles formed the core of the Mandate System, being non-annexation of the territory and its administration as a “sacred trust of civilisation” to develop the territory for the benefit of its native people.Matz, 2005, p.70-71, \"Primarily, two elements formed the core of the Mandate System, the principle of non-annexation of the territory on the one hand and its administration as a “sacred trust of civilisation” on the other... The principle of administration as a “sacred trust of civilisation” was designed to prevent a practice of imperial exploitation of the mandated territory in contrast to former colonial habits. Instead, the Mandatory’s administration should assist in developing the territory for the well-being of its native people.\"\n\nBasis\n\nThe mandate system was established by Article 22 of the Covenant of the League of Nations, drafted by the victors of World War I. The article referred to territories which after the war were no longer ruled by their previous sovereign, but their peoples were not considered \"able to stand by themselves under the strenuous conditions of the modern world\". The article called for such people's tutelage to be \"entrusted to advanced nations who by reason of their resources, their experience or their geographical position can best undertake this responsibility\".\n\nGeneralities\n\nAll of the territories subject to League of Nations mandates were previously controlled by states defeated in World War I, principally Imperial Germany and the Ottoman Empire. The mandates were fundamentally different from the protectorates in that the Mandatory power undertook obligations to the inhabitants of the territory and to the League of Nations.\n\nThe process of establishing the mandates consisted of two phases:\n#The formal removal of sovereignty of the state previously controlling the territory.\n#The transfer of mandatory powers to individual states among the Allied Powers.\n\nTreaties\n\nThe divestiture of Germany's overseas colonies, along with three territories disentangled from its European homeland area (the Free City of Danzig, Memel Territory, and Saar), was accomplished in the Treaty of Versailles (1919), with the territories being allotted among the Allies on 7 May of that year.  Ottoman territorial claims were first addressed in the Treaty of Sèvres (1920) and finalized in the Treaty of Lausanne (1923).  The Turkish territories were allotted among the Allied Powers at the San Remo conference in 1920.\n\nHidden agendas and objections\n\nPeace treaties have played an important role in the formation of the modern law of nations.[http://www.cambridge.org/catalogue/catalogue.asp?isbn=0511207069 Peace Treaties and International Law in European History, From the Late Middle Ages to World War One] Many rules that govern the relations between states have been introduced and codified in the terms of peace treaties.See 'The Law of Nations or the Principles of Natural Law', Emmerich de Vattel, 1758, Book IV: Of The Restoration of Peace: And of Embassies, [http://www.lonang.com/exlibris/vattel/vatt-402.htm Chapter 2: Treaties of Peace]. The first twenty-six articles of the Treaty of Versailles contained the Covenant of the League of Nations. It contained the international machinery for the enforcement of the terms of the treaty. Article 22 established a system of Mandates to administer former colonies and territories.\n\nLegitimacy of the allocations\n\nArticle 22 was written two months before the signing of the peace treaty, before it was known what communities, peoples, or territories were related to sub-paragraphs 4, 5, and 6. The treaty was signed, and the peace conference had been adjourned, before a formal decision was made.[http://digicoll.library.wisc.edu/cgi-bin/FRUS/FRUS-idx?typegoto&id\nFRUS.FRUS1919Parisv13&isizeM&submit\nGo+to+page&page=94, Papers relating to the foreign relations of the United States, The Paris Peace Conference, 1919] The mandates were arrangements guaranteed by, or arising out of the general treaty which stipulated that mandates were to be exercised on behalf of the League.\n\nThe treaty contained no provision for the mandates to be allocated on the basis of decisions taken by four members of the League acting in the name of the so-called \"Principal Allied and Associated Powers\". The decisions taken at the conferences of the Council of Four were not made on the basis of consultation or League unanimity as stipulated by the Covenant. As a result, the actions of the conferees were viewed by some as having no legitimacy.see for example [https://books.google.com/books?idGASk9InJVQkC&pg\nPA699&dq&ei\nrceCSaKdGpjEMuPG0NoF&client=#PPA699,M1 The Century, The San Remo Conference, by Herbert Adams Gibbons]\n\nIn testimony before the Senate Committee on Foreign Relations, a former US State Department official who had been a member of the American Commission at Paris testified that the United Kingdom and France had simply gone ahead and arranged the world to suit themselves. He pointed out that the League of Nations could do nothing to alter their arrangements, since the League could only act by unanimous consent of its members – including the UK and France.[http://www.gutenberg.org/etext/10444 Project Gutenberg: The Peace Negotiations by Robert Lansing, Boston and New York: Houghton Mifflin Company. 1921,  Chapter XIX. 'THE BULLITT AFFAIR']\n\nUnited States Secretary of State Robert Lansing was a member of the American Commission to Negotiate Peace at Paris in 1919. He explained that the system of mandates was a device created by the Great Powers to conceal their division of the spoils of war under the colour of international law. If the former German and Ottoman territories had been ceded to the victorious powers directly, their economic value would have been credited to offset the Allies' claims for war reparations.\"Thus under the mandatory system Germany lost her territorial assets, which might have greatly reduced her financial debt to the Allies, while the latter obtained the German colonial possessions without the loss of any of their claims for indemnity. In actual operation the apparent altruism of the mandatory system worked in favour of the selfish and material interests of the Powers which accepted the mandates. And the same may be said of the dismemberment of Turkey....The truth of this was very apparent at Paris. In the tentative distribution of mandates among the Powers, which took place on the strong presumption that the mandatory system would be adopted, the principal European Powers appeared to be willing and even eager to become mandatories over territories possessing natural resources which could be profitably developed and showed an unwillingness to accept mandates for territories which, barren of mineral or agricultural wealth, would be continuing liabilities rather than assets. This is not stated by way of criticism, but only in explanation of what took place.[http://www.gutenberg.org/etext/10444 Project Gutenberg: The Peace Negotiations by Robert Lansing, Boston and New York: Houghton Mifflin Company. 1921, Chapter XIII 'THE SYSTEM OF MANDATES']\nArticle 243 of the treaty instructed the Reparations Commission that non-mandate areas of the Saar and Alsace-Lorraine were to be reckoned as credits to Germany in respect of its reparation obligations.[http://net.lib.byu.edu/~rdh7/wwi/versa/versa7.html Peace Treaty of Versailles, Articles 231–247 and Annexes, Reparations]\n\nLegitimacy of the provisions\n\nThe US failed to ratify the Treaty of Versailles which included the Covenant of the League of Nations so the US never joined the League. The US government subsequently entered into individual treaties to secure legal rights for its citizens, to protect property rights and businesses interests in the mandates, and to preclude the mandatory administration from altering the terms of the mandates without prior US approval.see for example [http://digicoll.library.wisc.edu/cgi-bin/FRUS/FRUS-idx?typeturn&entity\nFRUS.FRUS1925v02.p0299&q1=Palestine DELAY IN EXCHANGE OF RATIFICATIONS OF THE PALESTINE MANDATE CONVENTION PENDING ADJUSTMENT OF CASES INVOLVING THE CAPITULATORY RIGHTS OF AMERICANS, 1925]\n\nThe Official Journal of the League of Nations, dated June 1922, contained a statement by Lord Balfour (UK) in which he explained that the League's authority was strictly limited. The article related that the 'Mandates were not the creation of the League, and they could not in substance be altered by the League. The League's duties were confined to seeing that the specific and detailed terms of the mandates were in accordance with the decisions taken by the Allied and Associated Powers, and that in carrying out these mandates the Mandatory Powers should be under the supervision—not under the control—of the League.'[http://domino.un.org/unispal.nsf/2ee9468747556b2d85256cf60060d2a6/b08168048e277b5a052565f70058cef3!OpenDocument Excerpts from League of Nations Official Journal dated June 1922, pp. 546–549]\n\nTypes of mandates\n\nThe League of Nations decided the exact level of control by the Mandatory power over each mandate on an individual basis. However, in every case the Mandatory power was forbidden to construct fortifications or raise an army within the territory of the mandate, and was required to present an annual report on the territory to the League of Nations.\n\nThe mandates were divided into three distinct groups based upon the level of development each population had achieved at that time.\n\nClass A mandates\n\nThe first group, or Class A mandates, were territories formerly controlled by the Ottoman Empire that were deemed to \"... have reached a stage of development where their existence as independent nations can be provisionally recognized subject to the rendering of administrative advice and assistance by a Mandatory until such time as they are able to stand alone. The wishes of these communities must be a principal consideration in the selection of the Mandatory.\"\n\nThe Class A mandates were:\n* Palestine (United Kingdom), from 29 September 1923 – 15 May 1948. In April 1921, Transjordan provisionally became an autonomous area for 6 months but then continued to be part of the Mandate until independence.[https://books.google.com/books?idP4cjDhBXV-4C&pg\nPA13&lpgPA13&dq\n&sourcebl&ots\nHNAzuhmFV9&sig5OCqCDmg0ytqTaIkq9nhN3jl2cs#PPA21,M1 The Making of Jordan: Tribes, Colonialism and the Modern State, By Yoav Alon, Published by I.B.Tauris, 2007], , p. 21[https://books.google.com/books?id\nx7qEqVpq9poC&pgPA100&dq\n&eiScGOScOiApr2Mf6H2bAF#PPA89,M1 Determining Boundaries in a Conflicted World: The Role of Uti Possidetis, By Suzanne Lalonde, Published by McGill-Queen's Press (MQUP), 2002], , pp. 89–100 It eventually became the independent Hashemite Kingdom of Transjordan (later Jordan) on 17 June 1946 upon joint ratification of the Treaty of London (1946). A plan for peacefully dividing the remainder of the Mandate failed. The Mandate terminated at midnight between 14 and 15 May 1948. On the evening of 14 May, the Chairman of the Jewish Agency for Palestine had declared the establishment of the State of Israel.[http://www.mfa.gov.il/MFA/Peace+Process/Guide+to+the+Peace+Process/Declaration+of+Establishment+of+State+of+Israel.htm Israel Ministry of Foreign Affairs: THE DECLARATION OF THE ESTABLISHMENT OF THE STATE OF ISRAEL May 14, 1948: Retrieved 28 January 2013] Following the war, 75% of the area west of the Jordan River was controlled by the new State of Israel. Other parts, until 1967, formed the West Bank of the Hashemite Kingdom of Jordan and the Egyptian-occupied Gaza Strip.\n* Syria (France), 29 September 1923 – 24 October 1945: This mandate included Lebanon; Hatay (a former Ottoman Alexandretta sandjak) broke away from it on 2 September 1938 and became a French protectorate until it was ceded to the new Republic of Turkey on 29 June 1939. When Syria and Lebanon formally joined the United Nations on 24 October 1945 as independent states, the French Mandate was by that action terminated.\n* Mesopotamia (United Kingdom), not enacted and replaced by the Anglo-Iraqi Treaty of October 1922. Iraq attained independence from Britain on 3 October 1932.\n\nClass B mandates\n\nThe second group of mandates, or Class B mandates, were all former Schutzgebiete (German territories) in West and Central Africa which were deemed to require a greater level of control by the mandatory power: \"...the Mandatory must be responsible for the administration of the territory under conditions which will guarantee freedom of conscience and religion.\" The mandatory power was forbidden to construct military or naval bases within the mandates.\n\nThe Class B mandates were:\n* Ruanda-Urundi (Belgium), from 20 July 1922 to 13 December 1946. Formerly two separate German protectorates, they were joined as a single mandate on 20 July 1922. From 1 March 1926 to 30 June 1960, Ruanda-Urundi was in administrative union with the neighbouring colony of Belgian Congo. After 13 December 1946, it became a United Nations Trust Territory, remaining under Belgian administration until the separate nations of Rwanda and Burundi gained independence on 1 July 1962.\n* Tanganyika (United Kingdom), from 20 July 1922 to 11 December 1946. It became a United Nations Trust Territory on 11 December 1946, and was granted internal self-rule on 1 May 1961. On 9 December 1961, it became independent while retaining the British monarch as nominal head of state, transforming into a republic on the same day the next year. On 26 April 1964, Tanganyika merged with the neighbouring island of Zanzibar to become the modern nation of Tanzania.\n* Kamerun was split on 20 July 1922 into British Cameroons (under a Resident) and French Cameroun (under a Commissioner until 27 August 1940, then under a Governor), on 13 December 1946 transformed into United Nations Trust Territories, again a British (successively under senior district officers officiating as Resident, a Special Resident and Commissioners) and a French Trust (under a Haut Commissaire)\n* Togoland was split into British Togoland (under an Administrator, a post filled by the colonial Governor of the British Gold Coast (present Ghana) except 30 September 1920 – 11 October 1923 Francis Walter Fillon Jackson) and French Togoland (under a Commissioner) (United Kingdom and France), 20 July 1922 separate Mandates, transformed on 13 December 1946 into United Nations trust territories, French Togoland (under a Commissioner till 30 August 1956, then under a High Commissioner as Autonomous Republic of Togo) and British Togoland (as before; on 13 December 1956 it ceased to exist as it became part of Ghana)\n\nClass C mandates\n\nThe Class C mandates, including South West Africa and certain of the South Pacific Islands, were considered to be \"best administered under the laws of the Mandatory as integral portions of its territory\"\n\nThe Class C mandates were former German possessions:\n*former  German New Guinea became the Territory of New Guinea (Australia/United Kingdom) from 17 December 1920 under an (at first Military) Administrator; after (wartime) Japanese/U.S. military commands from 8 December 1946 under UN mandate as North East New Guinea (under Australia, as administrative unit), until it became part of present Papua New Guinea at independence in 1975\n* Nauru, formerly part of German New Guinea (Australia in effective control, formally together with United Kingdom and New Zealand) from 17 December 1920, 1 November 1947 made into a United Nations trust territory (same three powers) until its 31 January 1968 independence as a Republic – all that time under an Administrator\n*former  German Samoa (New Zealand/United Kingdom) 17 December 1920 a League of Nations mandate, renamed Western Samoa (as opposed to American Samoa), from 25 January 1947 a United Nations trust territory until its 1 January 1962 independence\n* South Pacific Mandate (Japan)\n* South West Africa (South Africa/United KingdomTreaty of Peace and South West Africa Mandate Bill of 1919)\n** from 1 October 1922, Walvis Bay's administration (still merely having a Magistrate until its 16 March 1931 Municipal status, hence a Mayor) was also assigned to the mandate\n\nRules of establishment\n\nAccording to the Council of the League of Nations, meeting of August 1920:(pp. 109–110)  \"draft mandates adopted by the Allied and Associated Powers would not be definitive until they had been considered and approved by the League ... the legal title held by the mandatory Power must be a double one: one conferred by the Principal Powers and the other conferred by the League of Nations,\"Quincy Wright, Mandates under the League of Nations, Univ.Chicago Press, 1930.\n\nThree steps were required to establish a Mandate under international law:\n(1) The Principal Allied and Associated Powers confer a mandate on one of their number or on a third power; (2) the principal powers officially notify the council of the League of Nations that a certain power has been appointed mandatory for such a certain defined territory; and (3) the council of the League of Nations takes official cognisance of the appointment of the mandatory power and informs the latter that it [the council] considers it as invested with the mandate, and at the same time notifies it of the terms of the mandate, after ascertaining whether they are in conformance with the provisions of the covenant.\"See also: Temperley, History of the Paris Peace Conference, Vol VI, pp. 505–506; League of Nations, The Mandates System (official publication of 1945); Hill, Mandates, Dependencies and Trusteeship, pp. 133ff.\n\nThe U.S. State Department Digest of International Law says that the terms of the Treaty of Lausanne  provided for the application of the principles of state succession to the \"A\" Mandates. The Treaty of Versailles (1920) provisionally recognized the former Ottoman communities as independent nations.[http://net.lib.byu.edu/~rdh7/wwi/versa/versa1.html See Article 22 of the Peace Treaty of Versailles] It also required Germany to recognize the disposition of the former Ottoman territories and to recognize the new states laid down within their boundaries.[http://net.lib.byu.edu/~rdh7/wwi/versa/versa15.html See Article 434 of the Peace Treaty of Versailles] The terms of the Treaty of Lausanne required the newly created states that acquired the territory detached from the Ottoman Empire to pay annuities on the Ottoman public debt and to assume responsibility for the administration of concessions that had been granted by the Ottomans. The treaty also let the States acquire, without payment, all the property and possessions of the Ottoman Empire situated within their territory.[http://wwi.lib.byu.edu/index.php/Treaty_of_Lausanne Article 47, 60, and Protocol XII, Article 9 of the Treaty of Lausanne] The treaty provided that the League of Nations was responsible for establishing an arbitral court to resolve disputes that might arise and stipulated that its decisions were final.\n\nA disagreement regarding the legal status and the portion of the annuities to be paid by the \"A\" mandates was settled when an Arbitrator ruled that some of the mandates contained more than one State:The difficulty arises here how one is to regard the Asiatic countries under the British and French mandates. Iraq is a Kingdom in regard to which Great Britain has undertaken responsibilities equivalent to those of a Mandatory Power. Under the British mandate, Palestine and Transjordan have each an entirely separate organisation. We are, therefore, in the presence of three States sufficiently separate to be considered as distinct Parties. France has received a single mandate from the Council of the League of Nations, but in the countries subject to that mandate, one can distinguish two distinct States: Syria and the Lebanon, each State possessing its own constitution and a nationality clearly different from the other.See Marjorie M. Whiteman, Digest of International Law, vol. 1 (Washington, DC: U. S. Government Printing Office, 1963) pp. 650–652, Questia, Web, 21 Apr. 2010\n\nLater history\n\nAfter the United Nations was founded in 1945 and the League of Nations was disbanded, all but one of the mandated territories that remained under the control of the mandatory power became United Nations trust territories, a roughly equivalent status. In each case, the colonial power that held the mandate on each territory became the administering power of the trusteeship, except that Japan, which had been defeated in World War II, lost its mandate over the South Pacific islands, which became a \"strategic trust territory\" known as the Trust Territory of the Pacific Islands under United States administration.\n\nThe sole exception to the transformation of League of Nations mandates into UN trusteeships was that South Africa refused to place South-West Africa under trusteeship. Instead, South Africa proposed that it be allowed to annex South-West Africa, a proposal rejected by the United Nations General Assembly. The International Court of Justice held that South Africa continued to have international obligations under the mandate for South-West Africa. The territory finally attained independence in 1990 as Namibia, after a long guerrilla war of independence against the apartheid regime.\n\nNearly all the former League of Nations mandates had become sovereign states by 1990, including all of the former United Nations Trust Territories with the exception of a few successor entities of the gradually dismembered Trust Territory of the Pacific Islands (formerly Japan's South Pacific Trust Mandate). These exceptions include the Northern Mariana Islands which is a commonwealth in political union with the United States with the status of unincorporated organized territory. The Northern Mariana Islands does elect its own governor to serve as territorial head of government, but it remains a U.S. territory with its head of state being the President of the United States and federal funds to the Commonwealth administered by the Office of Insular Affairs of the United States Department of the Interior.\n\nRemnant Micronesia and the Marshall Islands, the heirs of the last territories of the Trust, attained final independence on 22 December 1990. (The UN Security Council ratified termination of trusteeship, effectively dissolving trusteeship status, on 10 July 1987). The Republic of Palau, split off from the Federated States of Micronesia, became the last to get its independence effectively on 1 October 1994.\n\nSources and references\n\n* Nele Matz, [http://www.mpil.de/files/pdf2/mpunyb_matz_9_47_95.pdf Civilization and the Mandate System under the League of Nations as Origin of Trusteeship], in: A. von Bogdandy and R. Wolfrum, (eds.), Max Planck Yearbook of United Nations Law, Volume 9, 2005, p. 47-95. \n* Pugh, Jeffrey, “[https://www.researchgate.net/publication/262864875_Whose_Brother%27s_Keeper_International_Trusteeship_and_the_Search_for_Peace_in_the_Palestinian_Territories Whose Brother’s Keeper?  International Trusteeship and the Search for Peace in the Palestinian Territories],” International Studies Perspectives 13, no. 4 (November 2012): 321-343. \n*Tamburini, Francesco \"I mandati della Società delle Nazioni\", in «Africana, Rivista di Studi Extraeuropei», n.XV - 2009, pp. 99–122.\n* Anghie, Antony \"Colonialism and the Birth of International Institutions: Sovereignty, Economy, and the Mandate System of the League of Nations\" 34(3) New York University Journal of International Law and Politics 513 (2002)\n* [http://www.worldstatesmen.org/COLONIES.html WorldStatesmen - links to each present nation]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "League of Nations mandate" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18139" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A League of Nations mandate was a legal status for certain territories transferred from the control of one country to another following World War I, or the legal instruments that contained the internationally agreed-upon terms for administering the territory on behalf of the League of Nations. These were of the nature of both a treaty and a constitution, which contained minority rights clauses that provided for the rights of petition and adjudication by the International Court. \n\nThe mandate system was established under Article 22 of the Covenant of the League of Nations, entered into on 28 June 1919. With the dissolution of the League of Nations after World War II, it was stipulated at the Yalta Conference that the remaining Mandates should be placed under the trusteeship of the United Nations, subject to future discussions and formal agreements. Most of the remaining mandates of the League of Nations (with the exception of South-West Africa) thus eventually became United Nations Trust Territories.\n\nTwo governing principles formed the core of the Mandate System, being non-annexation of the territory and its administration as a “sacred trust of civilisation” to develop the territory for the benefit of its native people.Matz, 2005, p.70-71, \"Primarily, two elements formed the core of the Mandate System, the principle of non-annexation of the territory on the one hand and its administration as a “sacred trust of civilisation” on the other... The principle of administration as a “sacred trust of civilisation” was designed to prevent a practice of imperial exploitation of the mandated territory in contrast to former colonial habits. Instead, the Mandatory’s administration should assist in developing the territory for the well-being of its native people.\"\n\nBasis\n\nThe mandate system was established by Article 22 of the Covenant of the League of Nations, drafted by the victors of World War I. The article referred to territories which after the war were no longer ruled by their previous sovereign, but their peoples were not considered \"able to stand by themselves under the strenuous conditions of the modern world\". The article called for such people's tutelage to be \"entrusted to advanced nations who by reason of their resources, their experience or their geographical position can best undertake this responsibility\".\n\nGeneralities\n\nAll of the territories subject to League of Nations mandates were previously controlled by states defeated in World War I, principally Imperial Germany and the Ottoman Empire. The mandates were fundamentally different from the protectorates in that the Mandatory power undertook obligations to the inhabitants of the territory and to the League of Nations.\n\nThe process of establishing the mandates consisted of two phases:\n#The formal removal of sovereignty of the state previously controlling the territory.\n#The transfer of mandatory powers to individual states among the Allied Powers.\n\nTreaties\n\nThe divestiture of Germany's overseas colonies, along with three territories disentangled from its European homeland area (the Free City of Danzig, Memel Territory, and Saar), was accomplished in the Treaty of Versailles (1919), with the territories being allotted among the Allies on 7 May of that year.  Ottoman territorial claims were first addressed in the Treaty of Sèvres (1920) and finalized in the Treaty of Lausanne (1923).  The Turkish territories were allotted among the Allied Powers at the San Remo conference in 1920.\n\nHidden agendas and objections\n\nPeace treaties have played an important role in the formation of the modern law of nations.[http://www.cambridge.org/catalogue/catalogue.asp?isbn=0511207069 Peace Treaties and International Law in European History, From the Late Middle Ages to World War One] Many rules that govern the relations between states have been introduced and codified in the terms of peace treaties.See 'The Law of Nations or the Principles of Natural Law', Emmerich de Vattel, 1758, Book IV: Of The Restoration of Peace: And of Embassies, [http://www.lonang.com/exlibris/vattel/vatt-402.htm Chapter 2: Treaties of Peace]. The first twenty-six articles of the Treaty of Versailles contained the Covenant of the League of Nations. It contained the international machinery for the enforcement of the terms of the treaty. Article 22 established a system of Mandates to administer former colonies and territories.\n\nLegitimacy of the allocations\n\nArticle 22 was written two months before the signing of the peace treaty, before it was known what communities, peoples, or territories were related to sub-paragraphs 4, 5, and 6. The treaty was signed, and the peace conference had been adjourned, before a formal decision was made.[http://digicoll.library.wisc.edu/cgi-bin/FRUS/FRUS-idx?typegoto&id\nFRUS.FRUS1919Parisv13&isizeM&submit\nGo+to+page&page=94, Papers relating to the foreign relations of the United States, The Paris Peace Conference, 1919] The mandates were arrangements guaranteed by, or arising out of the general treaty which stipulated that mandates were to be exercised on behalf of the League.\n\nThe treaty contained no provision for the mandates to be allocated on the basis of decisions taken by four members of the League acting in the name of the so-called \"Principal Allied and Associated Powers\". The decisions taken at the conferences of the Council of Four were not made on the basis of consultation or League unanimity as stipulated by the Covenant. As a result, the actions of the conferees were viewed by some as having no legitimacy.see for example [https://books.google.com/books?idGASk9InJVQkC&pg\nPA699&dq&ei\nrceCSaKdGpjEMuPG0NoF&client=#PPA699,M1 The Century, The San Remo Conference, by Herbert Adams Gibbons]\n\nIn testimony before the Senate Committee on Foreign Relations, a former US State Department official who had been a member of the American Commission at Paris testified that the United Kingdom and France had simply gone ahead and arranged the world to suit themselves. He pointed out that the League of Nations could do nothing to alter their arrangements, since the League could only act by unanimous consent of its members – including the UK and France.[http://www.gutenberg.org/etext/10444 Project Gutenberg: The Peace Negotiations by Robert Lansing, Boston and New York: Houghton Mifflin Company. 1921,  Chapter XIX. 'THE BULLITT AFFAIR']\n\nUnited States Secretary of State Robert Lansing was a member of the American Commission to Negotiate Peace at Paris in 1919. He explained that the system of mandates was a device created by the Great Powers to conceal their division of the spoils of war under the colour of international law. If the former German and Ottoman territories had been ceded to the victorious powers directly, their economic value would have been credited to offset the Allies' claims for war reparations.\"Thus under the mandatory system Germany lost her territorial assets, which might have greatly reduced her financial debt to the Allies, while the latter obtained the German colonial possessions without the loss of any of their claims for indemnity. In actual operation the apparent altruism of the mandatory system worked in favour of the selfish and material interests of the Powers which accepted the mandates. And the same may be said of the dismemberment of Turkey....The truth of this was very apparent at Paris. In the tentative distribution of mandates among the Powers, which took place on the strong presumption that the mandatory system would be adopted, the principal European Powers appeared to be willing and even eager to become mandatories over territories possessing natural resources which could be profitably developed and showed an unwillingness to accept mandates for territories which, barren of mineral or agricultural wealth, would be continuing liabilities rather than assets. This is not stated by way of criticism, but only in explanation of what took place.[http://www.gutenberg.org/etext/10444 Project Gutenberg: The Peace Negotiations by Robert Lansing, Boston and New York: Houghton Mifflin Company. 1921, Chapter XIII 'THE SYSTEM OF MANDATES']\nArticle 243 of the treaty instructed the Reparations Commission that non-mandate areas of the Saar and Alsace-Lorraine were to be reckoned as credits to Germany in respect of its reparation obligations.[http://net.lib.byu.edu/~rdh7/wwi/versa/versa7.html Peace Treaty of Versailles, Articles 231–247 and Annexes, Reparations]\n\nLegitimacy of the provisions\n\nThe US failed to ratify the Treaty of Versailles which included the Covenant of the League of Nations so the US never joined the League. The US government subsequently entered into individual treaties to secure legal rights for its citizens, to protect property rights and businesses interests in the mandates, and to preclude the mandatory administration from altering the terms of the mandates without prior US approval.see for example [http://digicoll.library.wisc.edu/cgi-bin/FRUS/FRUS-idx?typeturn&entity\nFRUS.FRUS1925v02.p0299&q1=Palestine DELAY IN EXCHANGE OF RATIFICATIONS OF THE PALESTINE MANDATE CONVENTION PENDING ADJUSTMENT OF CASES INVOLVING THE CAPITULATORY RIGHTS OF AMERICANS, 1925]\n\nThe Official Journal of the League of Nations, dated June 1922, contained a statement by Lord Balfour (UK) in which he explained that the League's authority was strictly limited. The article related that the 'Mandates were not the creation of the League, and they could not in substance be altered by the League. The League's duties were confined to seeing that the specific and detailed terms of the mandates were in accordance with the decisions taken by the Allied and Associated Powers, and that in carrying out these mandates the Mandatory Powers should be under the supervision—not under the control—of the League.'[http://domino.un.org/unispal.nsf/2ee9468747556b2d85256cf60060d2a6/b08168048e277b5a052565f70058cef3!OpenDocument Excerpts from League of Nations Official Journal dated June 1922, pp. 546–549]\n\nTypes of mandates\n\nThe League of Nations decided the exact level of control by the Mandatory power over each mandate on an individual basis. However, in every case the Mandatory power was forbidden to construct fortifications or raise an army within the territory of the mandate, and was required to present an annual report on the territory to the League of Nations.\n\nThe mandates were divided into three distinct groups based upon the level of development each population had achieved at that time.\n\nClass A mandates\n\nThe first group, or Class A mandates, were territories formerly controlled by the Ottoman Empire that were deemed to \"... have reached a stage of development where their existence as independent nations can be provisionally recognized subject to the rendering of administrative advice and assistance by a Mandatory until such time as they are able to stand alone. The wishes of these communities must be a principal consideration in the selection of the Mandatory.\"\n\nThe Class A mandates were:\n* Palestine (United Kingdom), from 29 September 1923 – 15 May 1948. In April 1921, Transjordan provisionally became an autonomous area for 6 months but then continued to be part of the Mandate until independence.[https://books.google.com/books?idP4cjDhBXV-4C&pg\nPA13&lpgPA13&dq\n&sourcebl&ots\nHNAzuhmFV9&sig5OCqCDmg0ytqTaIkq9nhN3jl2cs#PPA21,M1 The Making of Jordan: Tribes, Colonialism and the Modern State, By Yoav Alon, Published by I.B.Tauris, 2007], , p. 21[https://books.google.com/books?id\nx7qEqVpq9poC&pgPA100&dq\n&eiScGOScOiApr2Mf6H2bAF#PPA89,M1 Determining Boundaries in a Conflicted World: The Role of Uti Possidetis, By Suzanne Lalonde, Published by McGill-Queen's Press (MQUP), 2002], , pp. 89–100 It eventually became the independent Hashemite Kingdom of Transjordan (later Jordan) on 17 June 1946 upon joint ratification of the Treaty of London (1946). A plan for peacefully dividing the remainder of the Mandate failed. The Mandate terminated at midnight between 14 and 15 May 1948. On the evening of 14 May, the Chairman of the Jewish Agency for Palestine had declared the establishment of the State of Israel.[http://www.mfa.gov.il/MFA/Peace+Process/Guide+to+the+Peace+Process/Declaration+of+Establishment+of+State+of+Israel.htm Israel Ministry of Foreign Affairs: THE DECLARATION OF THE ESTABLISHMENT OF THE STATE OF ISRAEL May 14, 1948: Retrieved 28 January 2013] Following the war, 75% of the area west of the Jordan River was controlled by the new State of Israel. Other parts, until 1967, formed the West Bank of the Hashemite Kingdom of Jordan and the Egyptian-occupied Gaza Strip.\n* Syria (France), 29 September 1923 – 24 October 1945: This mandate included Lebanon; Hatay (a former Ottoman Alexandretta sandjak) broke away from it on 2 September 1938 and became a French protectorate until it was ceded to the new Republic of Turkey on 29 June 1939. When Syria and Lebanon formally joined the United Nations on 24 October 1945 as independent states, the French Mandate was by that action terminated.\n* Mesopotamia (United Kingdom), not enacted and replaced by the Anglo-Iraqi Treaty of October 1922. Iraq attained independence from Britain on 3 October 1932.\n\nClass B mandates\n\nThe second group of mandates, or Class B mandates, were all former Schutzgebiete (German territories) in West and Central Africa which were deemed to require a greater level of control by the mandatory power: \"...the Mandatory must be responsible for the administration of the territory under conditions which will guarantee freedom of conscience and religion.\" The mandatory power was forbidden to construct military or naval bases within the mandates.\n\nThe Class B mandates were:\n* Ruanda-Urundi (Belgium), from 20 July 1922 to 13 December 1946. Formerly two separate German protectorates, they were joined as a single mandate on 20 July 1922. From 1 March 1926 to 30 June 1960, Ruanda-Urundi was in administrative union with the neighbouring colony of Belgian Congo. After 13 December 1946, it became a United Nations Trust Territory, remaining under Belgian administration until the separate nations of Rwanda and Burundi gained independence on 1 July 1962.\n* Tanganyika (United Kingdom), from 20 July 1922 to 11 December 1946. It became a United Nations Trust Territory on 11 December 1946, and was granted internal self-rule on 1 May 1961. On 9 December 1961, it became independent while retaining the British monarch as nominal head of state, transforming into a republic on the same day the next year. On 26 April 1964, Tanganyika merged with the neighbouring island of Zanzibar to become the modern nation of Tanzania.\n* Kamerun was split on 20 July 1922 into British Cameroons (under a Resident) and French Cameroun (under a Commissioner until 27 August 1940, then under a Governor), on 13 December 1946 transformed into United Nations Trust Territories, again a British (successively under senior district officers officiating as Resident, a Special Resident and Commissioners) and a French Trust (under a Haut Commissaire)\n* Togoland was split into British Togoland (under an Administrator, a post filled by the colonial Governor of the British Gold Coast (present Ghana) except 30 September 1920 – 11 October 1923 Francis Walter Fillon Jackson) and French Togoland (under a Commissioner) (United Kingdom and France), 20 July 1922 separate Mandates, transformed on 13 December 1946 into United Nations trust territories, French Togoland (under a Commissioner till 30 August 1956, then under a High Commissioner as Autonomous Republic of Togo) and British Togoland (as before; on 13 December 1956 it ceased to exist as it became part of Ghana)\n\nClass C mandates\n\nThe Class C mandates, including South West Africa and certain of the South Pacific Islands, were considered to be \"best administered under the laws of the Mandatory as integral portions of its territory\"\n\nThe Class C mandates were former German possessions:\n*former  German New Guinea became the Territory of New Guinea (Australia/United Kingdom) from 17 December 1920 under an (at first Military) Administrator; after (wartime) Japanese/U.S. military commands from 8 December 1946 under UN mandate as North East New Guinea (under Australia, as administrative unit), until it became part of present Papua New Guinea at independence in 1975\n* Nauru, formerly part of German New Guinea (Australia in effective control, formally together with United Kingdom and New Zealand) from 17 December 1920, 1 November 1947 made into a United Nations trust territory (same three powers) until its 31 January 1968 independence as a Republic – all that time under an Administrator\n*former  German Samoa (New Zealand/United Kingdom) 17 December 1920 a League of Nations mandate, renamed Western Samoa (as opposed to American Samoa), from 25 January 1947 a United Nations trust territory until its 1 January 1962 independence\n* South Pacific Mandate (Japan)\n* South West Africa (South Africa/United KingdomTreaty of Peace and South West Africa Mandate Bill of 1919)\n** from 1 October 1922, Walvis Bay's administration (still merely having a Magistrate until its 16 March 1931 Municipal status, hence a Mayor) was also assigned to the mandate\n\nRules of establishment\n\nAccording to the Council of the League of Nations, meeting of August 1920:(pp. 109–110)  \"draft mandates adopted by the Allied and Associated Powers would not be definitive until they had been considered and approved by the League ... the legal title held by the mandatory Power must be a double one: one conferred by the Principal Powers and the other conferred by the League of Nations,\"Quincy Wright, Mandates under the League of Nations, Univ.Chicago Press, 1930.\n\nThree steps were required to establish a Mandate under international law:\n(1) The Principal Allied and Associated Powers confer a mandate on one of their number or on a third power; (2) the principal powers officially notify the council of the League of Nations that a certain power has been appointed mandatory for such a certain defined territory; and (3) the council of the League of Nations takes official cognisance of the appointment of the mandatory power and informs the latter that it [the council] considers it as invested with the mandate, and at the same time notifies it of the terms of the mandate, after ascertaining whether they are in conformance with the provisions of the covenant.\"See also: Temperley, History of the Paris Peace Conference, Vol VI, pp. 505–506; League of Nations, The Mandates System (official publication of 1945); Hill, Mandates, Dependencies and Trusteeship, pp. 133ff.\n\nThe U.S. State Department Digest of International Law says that the terms of the Treaty of Lausanne  provided for the application of the principles of state succession to the \"A\" Mandates. The Treaty of Versailles (1920) provisionally recognized the former Ottoman communities as independent nations.[http://net.lib.byu.edu/~rdh7/wwi/versa/versa1.html See Article 22 of the Peace Treaty of Versailles] It also required Germany to recognize the disposition of the former Ottoman territories and to recognize the new states laid down within their boundaries.[http://net.lib.byu.edu/~rdh7/wwi/versa/versa15.html See Article 434 of the Peace Treaty of Versailles] The terms of the Treaty of Lausanne required the newly created states that acquired the territory detached from the Ottoman Empire to pay annuities on the Ottoman public debt and to assume responsibility for the administration of concessions that had been granted by the Ottomans. The treaty also let the States acquire, without payment, all the property and possessions of the Ottoman Empire situated within their territory.[http://wwi.lib.byu.edu/index.php/Treaty_of_Lausanne Article 47, 60, and Protocol XII, Article 9 of the Treaty of Lausanne] The treaty provided that the League of Nations was responsible for establishing an arbitral court to resolve disputes that might arise and stipulated that its decisions were final.\n\nA disagreement regarding the legal status and the portion of the annuities to be paid by the \"A\" mandates was settled when an Arbitrator ruled that some of the mandates contained more than one State:The difficulty arises here how one is to regard the Asiatic countries under the British and French mandates. Iraq is a Kingdom in regard to which Great Britain has undertaken responsibilities equivalent to those of a Mandatory Power. Under the British mandate, Palestine and Transjordan have each an entirely separate organisation. We are, therefore, in the presence of three States sufficiently separate to be considered as distinct Parties. France has received a single mandate from the Council of the League of Nations, but in the countries subject to that mandate, one can distinguish two distinct States: Syria and the Lebanon, each State possessing its own constitution and a nationality clearly different from the other.See Marjorie M. Whiteman, Digest of International Law, vol. 1 (Washington, DC: U. S. Government Printing Office, 1963) pp. 650–652, Questia, Web, 21 Apr. 2010\n\nLater history\n\nAfter the United Nations was founded in 1945 and the League of Nations was disbanded, all but one of the mandated territories that remained under the control of the mandatory power became United Nations trust territories, a roughly equivalent status. In each case, the colonial power that held the mandate on each territory became the administering power of the trusteeship, except that Japan, which had been defeated in World War II, lost its mandate over the South Pacific islands, which became a \"strategic trust territory\" known as the Trust Territory of the Pacific Islands under United States administration.\n\nThe sole exception to the transformation of League of Nations mandates into UN trusteeships was that South Africa refused to place South-West Africa under trusteeship. Instead, South Africa proposed that it be allowed to annex South-West Africa, a proposal rejected by the United Nations General Assembly. The International Court of Justice held that South Africa continued to have international obligations under the mandate for South-West Africa. The territory finally attained independence in 1990 as Namibia, after a long guerrilla war of independence against the apartheid regime.\n\nNearly all the former League of Nations mandates had become sovereign states by 1990, including all of the former United Nations Trust Territories with the exception of a few successor entities of the gradually dismembered Trust Territory of the Pacific Islands (formerly Japan's South Pacific Trust Mandate). These exceptions include the Northern Mariana Islands which is a commonwealth in political union with the United States with the status of unincorporated organized territory. The Northern Mariana Islands does elect its own governor to serve as territorial head of government, but it remains a U.S. territory with its head of state being the President of the United States and federal funds to the Commonwealth administered by the Office of Insular Affairs of the United States Department of the Interior.\n\nRemnant Micronesia and the Marshall Islands, the heirs of the last territories of the Trust, attained final independence on 22 December 1990. (The UN Security Council ratified termination of trusteeship, effectively dissolving trusteeship status, on 10 July 1987). The Republic of Palau, split off from the Federated States of Micronesia, became the last to get its independence effectively on 1 October 1994.\n\nSources and references\n\n* Nele Matz, [http://www.mpil.de/files/pdf2/mpunyb_matz_9_47_95.pdf Civilization and the Mandate System under the League of Nations as Origin of Trusteeship], in: A. von Bogdandy and R. Wolfrum, (eds.), Max Planck Yearbook of United Nations Law, Volume 9, 2005, p. 47-95. \n* Pugh, Jeffrey, “[https://www.researchgate.net/publication/262864875_Whose_Brother%27s_Keeper_International_Trusteeship_and_the_Search_for_Peace_in_the_Palestinian_Territories Whose Brother’s Keeper?  International Trusteeship and the Search for Peace in the Palestinian Territories],” International Studies Perspectives 13, no. 4 (November 2012): 321-343. \n*Tamburini, Francesco \"I mandati della Società delle Nazioni\", in «Africana, Rivista di Studi Extraeuropei», n.XV - 2009, pp. 99–122.\n* Anghie, Antony \"Colonialism and the Birth of International Institutions: Sovereignty, Economy, and the Mandate System of the League of Nations\" 34(3) New York University Journal of International Law and Politics 513 (2002)\n* [http://www.worldstatesmen.org/COLONIES.html WorldStatesmen - links to each present nation]. League of Nations mandate. http://en.wikipedia.org/?curid=18139."
  }
}
