{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19818",
  "eid" : "3dfa24a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778613226,
  "textBody" : "Events\n\n* 597 BC – Babylonians capture Jerusalem, and replace Jeconiah with Zedekiah as king.\n* 455 – Emperor Valentinian III is assassinated by two Hunnic retainers while training with the bow on the Campus Martius (Rome).\n* 934 – Meng Zhixiang declares himself emperor and establishes Later Shu as a new state independent of Later Tang.\n*1190 – Massacre of Jews at Clifford's Tower, York.\n*1244 – Over 200 Cathars are burned after the Fall of Montségur.\n*1322 – The Battle of Boroughbridge take place in the Despenser Wars.\n*1521 – Ferdinand Magellan reaches the island of Homonhon in the Philippines.\n*1621 – Samoset, a Mohegan, visited the settlers of Plymouth Colony and greets them, \"Welcome, Englishmen! My name is Samoset.\"\n*1660 – The Long Parliament of England is dissolved so as to prepare for the new Convention Parliament.\n*1689 – The 23rd Regiment of Foot, or Royal Welch Fusiliers, is founded.\n*1782 – American Revolutionary War: Spanish troops capture the British-held island of Roatán.\n*  1782   – Anglo-Spanish War (1779): Action of 16 March 1782\n*1792 – King Gustav III of Sweden is shot; he dies on March 29.\n*1797 – French Revolutionary Wars: An Austrian column is defeated by the French in the Battle of Valvasone.\n*1802 – The Army Corps of Engineers is established to found and operate the United States Military Academy at West Point.\n*1812 – The Siege of Badajoz begins: British and Portuguese forces besiege and defeat the French garrison during the Peninsular War.\n*1815 – Prince Willem proclaims himself King of the United Kingdom of the Netherlands, the first constitutional monarch in the Netherlands.\n*1818 – In the Second Battle of Cancha Rayada, Spanish forces defeated Chileans under José de San Martín.\n*1864 – American Civil War: During the Red River Campaign, Union troops reach Alexandria, Louisiana.\n*1865 – American Civil War: The Battle of Averasborough began as Confederate forces suffer irreplaceable casualties in the final months of the war.\n*1870 – The first version of the overture fantasy Romeo and Juliet by Tchaikovsky receives its première performance. \n*1872 – The Wanderers F.C. won the first FA Cup, the oldest football competition in the world, beating Royal Engineers A.F.C. 1–0 at The Oval in Kennington, London.\n*1894 – Jules Massenet's opera Thaïs is first performed.\n*1898 – In Melbourne the representatives of five colonies adopted a constitution, which would become the basis of the Commonwealth of Australia.J.A. LaNauze. The Making of the Australian Constitution. Melbourne University Press,\n 1972.\n*1900 – Sir Arthur Evans purchased the land around the ruins of Knossos, the largest Bronze Age archaeological site on Crete.\n*1916 – The 7th and 10th US cavalry regiments under John J. Pershing cross the US–Mexico border to join the hunt for Pancho Villa.\n*1917 – World War I: A German auxiliary cruiser is sunk in the Action of 16 March 1917.\n*1918 – Finnish Civil War: Battle of Länkipohja is infamous for its bloody aftermath as the Whites executed 70–100 capitulated Reds.\n*1924 – In accordance with the Treaty of Rome, Fiume becomes annexed as part of Italy.\n*1925 – An earthquake occurs in Yunnan, China.\n*1926 – History of Rocketry: Robert Goddard launches the first liquid-fueled rocket, at Auburn, Massachusetts.\n*1935 – Adolf Hitler orders Germany to rearm herself in violation of the Treaty of Versailles. Conscription is reintroduced to form the Wehrmacht.\n*1936 – Warmer-than-normal temperatures rapidly melt snow and ice on the upper Allegheny and Monongahela rivers, leading to a major flood in Pittsburgh.\n*1939 – From Prague Castle, Hitler proclaims Bohemia and Moravia a German protectorate.\n*1940 – First person killed (James Isbister) in a German bombing raid on the UK in World War II during a raid on Scapa Flow in the Orkney Islands.\n*1945 – World War II: The Battle of Iwo Jima ended, but small pockets of Japanese resistance persisted.\n*  1945   – Ninety percent of Würzburg, Germany is destroyed in only 20 minutes by British bombers, resulting in around 5,000 deaths. \n*1958 – The Ford Motor Company produces its 50 millionth automobile, the Thunderbird, averaging almost a million cars a year since the company's founding.\n*1962 – A Flying Tiger Line Super Constellation disappears in the western Pacific Ocean, with all 107 aboard missing and presumed dead.\n*1966 – Launch of Gemini 8, the 12th manned American space flight and first space docking with the Agena target vehicle.\n*1968 – Vietnam War: My Lai Massacre occurs; between 347 and 500 Vietnamese villagers (men, women, and children) are killed by American troops.\n*  1968   – General Motors produces its 100 millionth automobile, the Oldsmobile Toronado.\n*1969 – A Viasa McDonnell Douglas DC-9 crashes in Maracaibo, Venezuela, killing 155.\n*1976 – British Prime Minister Harold Wilson resigns, citing personal reasons.\n*1977 – Assassination of Kamal Jumblatt, the main leader of the anti-government forces in the Lebanese Civil War.\n*1978 – Former Italian Prime Minister Aldo Moro is kidnapped. (He is later murdered by his captors.)\n*  1978   – Supertanker Amoco Cadiz splits in two after running aground on the Portsall Rocks, three miles off the coast of Brittany, resulting in the largest oil spill in history at that time.\n*1979 – Sino-Vietnamese War: The People's Liberation Army crosses the border back into China, ends the war.\n*1983 – Demolition of the Ismaning radio transmitter, the last wooden radio tower in Germany.\n*1984 – William Buckley, the CIA station chief in Beirut, Lebanon, is kidnapped by Islamic fundamentalists. (He later dies in captivity.)\n*1985 – Associated Press newsman Terry Anderson is taken hostage in Beirut. He is released on December 4, 1991.\n*1988 – Iran–Contra affair: Lieutenant Colonel Oliver North and Vice Admiral John Poindexter are indicted on charges of conspiracy to defraud the United States.\n*  1988   – Halabja chemical attack: The Kurdish town of Halabja in Iraq is attacked with a mix of poison gas and nerve agents on the orders of Saddam Hussein, killing 5000 people and injuring about 10000 people.\n*  1988   – The Troubles: Ulster loyalist militant Michael Stone attacks a Provisional IRA funeral in Belfast with pistols and grenades. A PIRA volunteer and two civilians are killed, and more than 60 others are wounded.\n*1989 – In Egypt, a 4,400-year-old mummy is found near the Pyramid of Cheops.\n*1991 – The airplane carrying eight members of Reba McEntire's touring band crashed on the side of Otay Mountain.\n*1995 – Mississippi formally ratifies the Thirteenth Amendment, becoming the last state to approve the abolition of slavery. The Thirteenth Amendment was officially ratified in 1865.\n*2001 – A series of bomb blasts that took place in the city of Shijiazhuang, China killed 108 people and injured 38 others, was the biggest mass murder in China in decades.\n*2005 – Israel officially hands over Jericho to Palestinian control.\n*2014 – Crimea votes in a controversial referendum to secede from Ukraine to join Russia.\n*2016 – A bomb detonates in a bus carrying government employees in Peshawar, Pakistan, killing 15 and injuring at least 54.\n*  2016   – Two suicide bombers detonate their explosives at a mosque during morning prayer on the outskirts of Maiduguri, Nigeria, killing 22 and injuring 18.\n\nBirths\n\n*1399 – The Xuande Emperor, ruler of Ming China (d. 1435)\n*1445 – Johann Geiler von Kaisersberg, Swiss priest and theologian (d. 1510)\n*1465 – Kunigunde of Austria, Archduchess of Austria (d. 1520)\n*1473 – Henry IV, Duke of Saxony (d. 1541)\n*1559 – Amar Singh I, successor of Maharana Pratap of Mewar (d. 1620)\n*1581 – Pieter Corneliszoon Hooft, Dutch historian and poet (d. 1647)\n*1585 – Gerbrand Bredero, Dutch poet and playwright (d. 1618)\n*1590 – Ii Naotaka, Japanese daimyo (d. 1659)\n*1596 – Ebba Brahe, Swedish countess (d. 1674)\n*1609 – Michael Franck, German baker, teacher, poet, and composer (d. 1667)\n*  1609   – Agostino Mitelli, Italian painter (d. 1660)\n*1621 – Georg Neumark, German poet and composer (d. 1681)\n*1631 – René Le Bossu, French critic (d. 1680)\n*1638 – François Crépieul, Jesuit missionary (d. 1702)\n*1654 – Andreas Acoluthus, German scholar (d. 1704)\n*1670 – François de Franquetot de Coigny, French general (d. 1759)\n*1673 – Jean Bouhier, French jurist and scholar (d. 1746)\n*1687 – Sophia Dorothea of Hanover, queen consort of Frederick William I (d. 1757)\n*1693 – Malhar Rao Holkar, Indian nobleman (d. 1766)\n*1701 – Daniel Lorenz Salthenius, Swedish theologian (d. 1750)\n*1729 – Maria Louise Albertine (d. 1818)\n*1741 – Carlo Amoretti, Italian scientist (d. 1816)\n*1744 – Nicolas-Germain Léonard, French poet and novelist (d. 1793)\n*1750 – Caroline Herschel, German-English astronomer (d. 1848)\n*1751 – James Madison, American academic and politician, 4th President of the United States (d. 1836)\n*1753 – François Amédée Doppet, French general (d. 1799)\n*1760 – Johann Heinrich Meyer, Swiss painter and writer (d. 1832)\n*1766 – Jean-Frédéric Waldeck,  French antiquarian, cartographer, artist and explorer (d. 1875)\n*1771 – Antoine-Jean Gros, French painter (d. 1835)\n*1773 – Juan Ramón Balcarce, Argentinian general and politician, 6th Governor of Buenos Aires Province (d. 1836)\n*1774 – Matthew Flinders, English navigator and cartographer (d. 1814)\n*1789 – Francis Rawdon Chesney, English general and explorer (d. 1872)\n*  1789   – Georg Ohm, German physicist and mathematician (d. 1854)\n*1794 – Ami Boué, Austrian geologist and ethnographer (d. 1881)\n*1797 – Alaric Alexander Watts, English poet and journalist (d. 1864)\n*1799 – Anna Atkins, English botanist and photographer (d. 1871)\n*1800 – Emperor Ninkō of Japan (d. 1846)\n*1805 – Peter Ernst von Lasaulx, German philologist and politician (d. 1861)\n*1806 – Félix De Vigne, Belgian painter (d. 1862)\n*1813 – Gaëtan de Rochebouët, French prime minister (d. 1899)\n*1819 – José Paranhos, Brazilian politician (d. 1880)\n*1820 – Enrico Tamberlik, Italian tenor (d. 1889)\n*1821 – Eduard Heine, German mathematician and academic (d. 1881)\n*1822 – Rosa Bonheur, French painter and sculptor (d. 1899)\n*  1822   – John Pope, American general (d. 1892)\n*1823 – William Henry Monk, English organist and composer  (d. 1889)\n*1828 – Émile Deshayes de Marcère, French politician (d. 1918)\n*1834 – James Hector, Scottish geologist and surgeon (d. 1907)\n*1836 – Andrew Smith Hallidie, English-American engineer and businessman (d. 1900)\n*1839 – Sully Prudhomme, French poet and critic, Nobel Prize laureate (d. 1907)\n*  1839   – John Butler Yeats, Irish painter (d. 1922)\n*1840 – Shibusawa Eiichi, Japanese businessman (d. 1931)\n*  1840   – Georg von der Gabelentz, German linguist and sinologist (d. 1893)\n*1845 – Umegatani Tōtarō I, Japanese sumo wrestler, the 15th Yokozuna (d. 1928)\n*1846 – Gösta Mittag-Leffler, Swedish mathematician and academic (d. 1927)\n*  1846   – Rebecca Cole, American physician and social reformer (d. 1922)\n*  1846   – Jurgis Bielinis, Lithuanian book smuggler (d. 1918)\n*1848 – Axel Heiberg, Norwegian financier and diplomat (d. 1932)\n*1851 – Otto Bardenhewer, German patrologist (d. 1935)\n*  1851   – Martinus Beijerinck, Dutch microbiologist and botanist (d. 1931)\n*1856 – Napoléon, Prince Imperial of France (d. 1879)\n*1857 – Charles Harding Firth, English historian and academic (d. 1936)\n*1859 – Alexander Stepanovich Popov, Russian physicist and academic (d. 1906)\n*1865 – Patsy Donovan, Irish-American baseball player and manager (d. 1953)\n*1869 – Willy Burmester, German violinist (d. 1933)\n*1871 – Hans Merensky, South African geologist and philanthropist (d. 1951)\n*  1871   – Frantz Reichel, French rugby player and hurdler (d. 1932)\n*1874 – Frédéric François-Marsal, French prime minister (d. 1958)\n*1877 – Léo-Ernest Ouimet, Canadian director and producer (d. 1972)\n*1878 – Clemens August Graf von Galen, German cardinal (d. 1946)\n*  1878   – Paul Jouve, French painter (d. 1973)\n*1881 – Fannie Charles Dillon, American composer (d. 1947)\n*1882 – James Lightbody, American runner (d. 1953)\n*1883 – Ethel Anderson, Australian poet, author, and painter (d. 1958)\n*1884 – Eric P. Kelly, American journalist and author (d. 1960)\n*1885 – Giacomo Benvenuti, Italian composer and musicologist (d. 1943)\n*  1885   – Sydney Chaplin, English actor (d. 1965)\n*1886 – Herbert Lindström, Swedish tug of war player (d. 1951)\n*1887 – Emilio Lunghi, Italian runner (d. 1925)\n*  1887   – S. Stillman Berry, American marine zoologist (1984)\n*1889 – Reggie Walker, South African athlete (d. 1951)\n*1892 – César Vallejo, Peruvian poet, playwright, and journalist (d. 1938)\n*1895 – Ernest Labrousse, French historian (d. 1988)\n*1897 – Antonio Donghi, Italian painter (d. 1963)\n*  1897   – Conrad Nagel, American actor (d. 1970)\n*1900 – Cyril Hume, American novelist (d. 1966)\n*  1900 – Mencha Karnicheva, Macedonian revolutionary and assassin (d. 1964) \n*1901 – Alexis Chantraine, Belgian footballer (d. 1987)\n*1903 – Mike Mansfield, American politician and diplomat, 22nd United States Ambassador to Japan (d. 2001)\n*1906 – Francisco Ayala, Spanish sociologist, author, and translator (d. 2009)\n*  1906   – Maurice Turnbull, Welsh-English cricketer and rugby player (d. 1944)\n*  1906   – Henny Youngman, English-American violinist and comedian (d. 1998)\n*1908 – René Daumal, French author and poet (d. 1944)\n*  1908   – Ernest Rogez, French water polo player (d. 1986)\n*  1908   – Robert Rossen, American director, producer, and screenwriter (d. 1966)\n*1910 – Aladár Gerevich, Hungarian fencer (d. 1991)\n*  1910   – Iftikhar Ali Khan Pataudi, Indian-English cricketer and politician, 8th Nawab of Pataudi (d. 1952)\n*1911 – Pierre Harmel, Belgian lawyer and politician, 40th Prime Minister of Belgium (d. 2009)\n*  1911   – Josef Mengele, German physician and captain (d. 1979)\n*1912 – Pat Nixon, First Lady of the United States (d. 1993)\n*1913 – Rémy Raffalli, French soldier (d. 1952)\n*1915 – Kunihiko Kodaira, Japanese mathematician and academic (d. 1997)\n*1916 – Mercedes McCambridge, American actress (d. 2004)\n*  1916   – Tsutomu Yamaguchi, Japanese engineer and businessman (d. 2010)\n*1917 – Louis C. Wyman, American lawyer and politician (d. 2002)\n*1918 – Aldo van Eyck, Dutch architect (d. 1999)\n*  1918   – Frederick Reines, American physicist and academic, Nobel Prize laureate (d. 1998)\n*1920 – John Addison, English-American soldier and composer (d. 1998)\n*  1920   – Sid Fleischman, American author and screenwriter (d. 2010)\n*  1920   – Traudl Junge, German secretary (d. 2002)\n*  1920   – Leo McKern, Australian-English actor (d. 2002)\n*1922 – Harding Lemay, American screenwriter and playwright\n*1923 – Heinz Wallberg, German conductor (d. 2004)\n*1925 – Cornell Borchers, Lithuanian-German actress and singer (d. 2014)\n*  1925   – Mary Hinkson, American dancer and choreographer (d. 2014)\n*  1925   – Ervin Kassai, Hungarian basketball player and referee (d. 2012)\n*  1925   – Luis E. Miramontes, Mexican chemist and engineer (d. 2004)\n*1926 – Charles Goodell, American lawyer and politician (d. 1987)\n*  1926   – Jerry Lewis, American actor and comedian (d. 2017)\n*1927 – Vladimir Komarov, Russian pilot, engineer, and astronaut (d. 1967)\n*  1927   – Daniel Patrick Moynihan, American sociologist and politician, 12th United States Ambassador to the United Nations (d. 2003)\n*  1927   – Olga San Juan, American actress and dancer (d. 2009)\n*1928 – Wakanohana Kanji I, Japanese sumo wrestler, the 45th Yokozuna (d. 2010)\n*  1928   – Christa Ludwig, German soprano and actress\n*1929 – Betty Johnson, American singer\n*  1929   – Tihomir Novakov, Serbian-American physicist and academic (d. 2015)\n*  1929   – Nadja Tiller, Austrian actress\n*1930 – Tommy Flanagan, American pianist and composer (d. 2001)\n*1931 – Augusto Boal, Brazilian theatre director, writer and politician (d. 2009)\n*  1931   – Alan Heyman, American-South Korean musicologist and composer (d. 2014)\n*  1931   – Anthony Kenny, English philosopher and academic\n*  1931   – John Munro, Canadian lawyer and politician, 22nd Canadian Minister of Labour (d. 2003)\n*1932 – Don Blasingame, American baseball player and manager (d. 2005)\n*  1932   – Walter Cunningham, American colonel, pilot, and astronaut\n*  1932   – Kurt Diemberger, Austrian mountaineer and author\n*  1932   – Herbert Marx, Canadian politician \n*1933 – Keith Critchlow, English architect and academic, co-founded Temenos Academy\n*  1933   – Sanford I. Weill, American banker, financier, and philanthropist\n*1934 – Jean Cournoyer, Canadian politician\n*  1934   – Ray Hnatyshyn, Canadian lawyer and politician, 24th Governor General of Canada (d. 2002)\n*  1934   – Roger Norrington, English violinist and conductor\n*1935 – Teresa Berganza, Spanish soprano and actress\n*  1935   – Pepe Cáceres, Colombian bullfighter (d. 1987)\n*1936 – Raymond Vahan Damadian, Armenian-American inventor, invented the MRI\n*  1936   – Fred Neil, American folk singer-songwriter and guitarist (d. 2001)\n*1937 – David Frith, English historian, journalist, and author\n*  1937   – Attilio Nicora, Italian cardinal (d. 2017)\n*  1937   – Amos Tversky, Israeli-American psychologist and academic (d. 1996)\n*1939 – Carlos Bilardo, Argentinian footballer and manager\n*  1939   – Yvon Côté, Canadian teacher\n*1940 – Bernardo Bertolucci, Italian director and screenwriter\n*  1940   – Vagif Mustafazadeh, Azerbaijani pianist and composer (d. 1979)\n*  1940   – Jan Pronk, Dutch academic and politician, Dutch Ministry of Housing, Spatial Planning and the Environment\n*  1940   – Keith Rowe, English guitarist \n*1941 – Robert Guéï, Ivorian soldier and politician, 3rd President of Côte d'Ivoire (d. 2002)\n*  1941   – Chuck Woolery, American game show host and television personality\n*1942 – Roger Crozier, Canadian-American ice hockey player and coach (d. 1996)\n*  1942   – Gijs van Lennep, Dutch race car driver\n*  1942   – Jean-Pierre Schosteck, French politician\n*  1942   – James Soong, Chinese-Taiwanese politician, Governor of Taiwan Province\n*  1942   – Jerry Jeff Walker, American singer-songwriter and guitarist \n*1943 – Ursula Goodenough, American biologist, zoologist, and author\n*  1943   – Hans Heyer, German racing driver\n*  1943   – Álvaro de Soto, Peruvian diplomat\n*1944 – Andrew S. Tanenbaum, American computer scientist and academic\n*1946 – Sigmund Groven, Norwegian harmonica player and composer\n*  1946   – Mary Kaldor, English economist and academic\n*  1946   – J. Z. Knight, American New Age teacher and author\n*  1946   – Guesch Patti, French singer\n*1948 – Michael Owen Bruce, American singer-songwriter and guitarist \n*  1948   – Richard Desjardins, Canadian singer-songwriter and director\n*  1948   – Catherine Quéré, French politician\n*1949 – Erik Estrada, American actor \n*  1949   – Victor Garber, Canadian actor and singer\n*  1949   – Elliott Murphy, American-French singer-songwriter and journalist\n*1950 – Peter Forster, English bishop\n*  1950   – Kate Nelligan, Canadian actress\n*  1950   – Edhem Šljivo, Bosnian footballer \n*1951 – Ray Benson, American singer-songwriter, guitarist, and producer \n*  1951   – Abdelmajid Bourebbou,  Algerian footballer\n*  1951   – Oddvar Brå, Norwegian skier\n*  1951   – Joe DeLamielleure, American football player\n*  1951   – Alexandre Gonzalez, French long-distance runner\n*1953 – Claus Peter Flor, German conductor\n*  1953   – Isabelle Huppert, French actress\n*  1953   – Rainer Knaak, German chess player\n*  1953   – Richard Stallman, American computer scientist and programmer\n*1954 – David Heath, English politician\n*  1954   – Jimmy Nail, English singer-songwriter, guitarist, and actor\n*  1954   – Tim O'Brien, American singer-songwriter and guitarist \n*  1954   – Dav Whatmore, Sri Lankan-Australian cricketer and coach\n*  1954   – Nancy Wilson, American singer-songwriter, guitarist, producer, and actress \n*1955 – Svetlana Alexeeva, Russian ice dancer and coach\n*  1955   – Rimantas Astrauskas, Lithuanian physicist\n*  1955   – Bruno Barreto, Brazilian director, producer, and screenwriter\n*  1955   – Linda Lepomme, Belgian actress and singer\n*  1955   – Bob Ley, American sports anchor and reporter\n*  1955   – Andy Scott, Canadian politician (d. 2013)\n*  1955   – Jiro Watanabe, Japanese boxer\n*1956 – Ozzie Newsome, American football player and manager\n*  1956   – Clifton Powell, American actor, director, and producer\n*  1956   – Yoriko Shono, Japanese writer\n*  1956   – Eveline Widmer-Schlumpf, Swiss lawyer and politician\n*1958 – Phillip Wilcher, Australian pianist and composer\n*  1958   – Kate Worley, American author (d. 2004)\n*1959 – Michael J. Bloomfield, American astronaut\n*  1959   – Sebastian Currier, American composer and educator\n*  1959   – Greg Dyer, Australian cricketer\n*  1959   – Flavor Flav, American rapper and actor\n*  1959   – Charles Hudson, American baseball player \n*  1959   – Steve Marker, American musician\n*  1959   – Jens Stoltenberg, Norwegian economist and politician, 27th Prime Minister of Norway\n*1960 – John Hemming, English businessman and politician\n*  1960   – Duane Sutter, Canadian ice hockey player and coach\n*  1960   – Jenny Eclair, English comedian, actress and screenwriter\n*1961 – Brett Kenny, Australian rugby player and coach\n*  1961   – Todd McFarlane, Canadian author, illustrator, and businessman, founded McFarlane Toys\n*1962 – Franck Fréon, French race car driver\n*  1962   – Liliane Gaschet, French athlete \n*1963 – Jerome Flynn, English actor and singer\n*  1963   – Kevin Smith, New Zealand actor and singer (d. 2002)\n*1964 – Patty Griffin, American singer-songwriter \n*  1964   – Pascal Richard, Swiss racing cyclist\n*  1964   – Gore Verbinski, American director, producer, and screenwriter\n*1965 – Steve Armstrong, American wrestler\n*  1965   – Cindy Brown, basketball player\n*  1965   – Mark Carney, Canadian-English economist and banker\n*  1965   – Cristiana Reali, Italian-Brazilian actress\n*1967 – Tracy Bonham, American singer and violinist\n*  1967   – John Darnielle, American musician and novelist\n*  1967   – Lauren Graham, American actress and producer\n*  1967   – Ronnie McCoury, American bluegrass mandolin player, singer and songwriter\n*  1967   – Heidi Zurbriggen, Swiss alpine skier\n*1968 – Trevor Wilson, American basketball player and police officer\n*1969 – Judah Friedlander, American comedian and actor\n*  1969   – Ottis Gibson, Barbadian cricketer and coach\n*  1969   – Alina Ivanova, Russian athlete\n*  1969   – Evangelos Koronios, Greek basketball player and coach\n*1970 – Joakim Berg, Swedish singer-songwriter and guitarist \n*1971 – Franck Comba, French rugby player\n*  1971   – Alan Tudyk, American actor\n*1972 – Ismaïl Sghyr, French-Moroccan long-distance runner\n*1973 – Andrey Mizurov, Kazakhstani road bicycle racer\n*  1973   – Vonda Ward, American boxer\n*1974 – Georgios Anatolakis, Greek footballer and politician\n*  1974   – Anne Charrier, French actress\n*  1974   – Heath Streak, Zimbabwean cricketer\n*1975 – Luciano Castro, Argentine actor \n*  1975   – Sienna Guillory, English model and actress\n*  1975   – Lionel Torres, French archer\n*1976 – Blu Cantrell, American singer-songwriter and producer\n*  1976   – Leila Lejeune, French handballer \n*  1976   – Susanne Ljungskog, Swedish cyclist\n*  1976   – Abraham Núñez, Dominican baseball player\n*  1976   – Zhu Chen, Qatari chess Grandmaster\n*1977 – Mónica Cruz, Spanish actress and dancer\n*  1977   – Thomas Rupprath, German swimmer\n*1978 – Brooke Burns, American fashion model and actress\n*  1978   – Annett Renneberg, German actress and singer\n*1979 – Christina Liebherr, Swiss equestrian\n*  1979   – Rashad Moore, American football player\n*  1979   – Sébastien Ostertag, French handball player\n*  1979   – Leena Peisa, Finnish keyboard player and songwriter \n*  1979   – Andrei Stepanov, Estonian footballer\n*1980 – Todd Heap, American football player\n*  1980   – Felipe Reyes, Spanish basketball player\n*1981 – Andrew Bree, Irish swimmer\n*  1981   – Curtis Granderson, American baseball player\n*  1981   – Julien Mazet, French road bicycle racer\n*  1981   – Fabiana Murer, Brazilian pole vaulter\n*1982 – Miguel Comminges, Guadeloupean footballer \n*  1982   – Riley Cote, Canadian ice hockey player and coach\n*  1982   – Tommy Hansen, Czech actor\n*  1982   – Jesús Del Nero, Spanish road bicycle racer \n*  1982   – Brian Wilson, American baseball player\n*1983 – Stephen Drew, American baseball player\n*  1983   – Brandon League, American baseball player\n*  1983   – Nicolas Rousseau, French road bicycle racer \n*  1983   – Tramon Williams, American football player\n*1984 – Levi Brown, American football player\n*  1984   – Aisling Bea, Irish comedienne and actress\n*  1984   – Sharon Cherop, Kenyan long-distance runner\n*  1984   – Michael Ennis, Australian rugby player\n*  1984   – Hosea Gear, New Zealand rugby player\n*  1984   – Brandon Prust, Canadian ice hockey player\n*1985 – Teddy Atine-Venel, French athlete \n*  1985   – Eddy Lover, Panamanian singer-songwriter\n*  1985   – Aleksei Sokirskiy, Russian hammer thrower\n*1986 – Alexandra Daddario, American actress\n*  1986   – Toney Douglas, American basketball player\n*  1986   – Kenny Dykstra, American wrestler\n*  1986   – T. J. Jordan, American basketball player\n*  1986   – Boaz Solossa, Indonesian footballer\n*  1986   – Daisuke Takahashi, Japanese figure skater\n*1987 – Fabien Lemoine, French football player\n*1988 – Jessica Gregg, Canadian speed skater\n*  1988   – Patrick Herrmann, German footballer\n*1989 – Blake Griffin, American basketball player\n*  1989   – Jung So-min, Korean actress\n*  1989   – Magalie Pottier, French racing cyclist\n*  1989   – Theo Walcott, English footballer\n*1990 – Andre Young, basketball player\n*1991 – Reggie Bullock, American basketball player\n*  1991   – Wolfgang Van Halen, American bassist\n*1993 – George Ford, English rugby union player\n*  1993   – Marine Lorphelin, Miss France\n*1994 – Joel Embiid, Cameroonian basketball player\n*1995 – Inga Janulevičiūtė, Lithuanian figure skater\n*1997 – Florian Neuhaus, German football player\n\nDeaths\n\n* AD 37 – Tiberius, Roman emperor (b. 42 BC)\n* 455 – Valentinian III, Roman emperor (b. 419)\n*   455   – Heraclius, Roman courtier (primicerius sacri cubiculi )\n* 842 – Xiao Mian, chancellor of the Tang Dynasty\n* 933 – Takin al-Khazari, Egyptian commander and politician, Abbasid Governor of Egypt\n* 943 – Pi Guangye, Chinese official and chancellor (b. 877)\n*1021 – Heribert of Cologne, German archbishop and saint (b. 970)\n*1072 – Adalbert of Hamburg, German archbishop (b. 1000)\n*1181 – Henry I, Count of Champagne\n*1185 – Baldwin IV of Jerusalem (b. 1161)\n*1279 – Jeanne of Dammartin, Queen consort of Castile and León (b. 1216)\n*1322 – Humphrey de Bohun, 4th Earl of Hereford, English general and politician, Lord High Constable of England (b. 1276)\n*1405 – Margaret III, Countess of Flanders (b. 1350)\n*1410 – John Beaufort, 1st Earl of Somerset, French-English admiral and politician, Lord Warden of the Cinque Ports (b. 1373)\n*1457 – Ladislaus Hunyadi, Hungarian politician (b. 1433)\n*1485 – Anne Neville, queen of Richard III of England (b. 1456)\n*1559 – Anthony St. Leger, English-Irish politician Lord Deputy of Ireland (b. 1496)\n*1649 – Jean de Brébeuf, French-Canadian missionary and saint (b. 1593)\n*1679 – John Leverett, English general and politician, 19th Governor of the Massachusetts Bay Colony (b. 1616)\n*1721 – James Craggs the Elder, English politician, Postmaster General of the United Kingdom (b. 1657)\n*1736 – Giovanni Battista Pergolesi, Italian organist and composer (b. 1710)\n*1737 – Benjamin Wadsworth, American minister and academic (b. 1670)\n*1738 – George Bähr, German architect, designed the Dresden Frauenkirche (b. 1666)\n*1747 – Christian August, Prince of Anhalt-Zerbst (b. 1690)\n*1838 – Nathaniel Bowditch, American captain and mathematician (b. 1773)\n*1841 – Félix Savart, French physicist and psychologist (d. 1791)\n*1868 – David Wilmot, American politician, sponsor of Wilmot Proviso (b. 1814)\n*1884 – Art Croft, American baseball player (b. 1855)\n*1888 – Hippolyte Carnot, French politician (b. 1801)\n*1892 – Samuel F. Miller, American lawyer and politician (b. 1827)\n*1898 – Aubrey Beardsley, English author and illustrator (b. 1872)\n*1899 – Joseph Medill, American journalist and politician, 26th Mayor of Chicago (b. 1823)\n*1903 – Roy Bean, American lawyer and judge (b. 1825)\n*1912 – Max Burckhard, Austrian theater director (b. 1854)\n*1914 – Gaston Calmette, French journalist (b. 1858)\n*  1914   – Charles Albert Gobat, Swiss lawyer and politician, Nobel Prize laureate (b. 1843)\n*  1914   – John Murray, Scottish oceanographer, biologist, and limnologist (b. 1841)\n*1925 – August von Wassermann, German bacteriologist and hygienist (b. 1866)\n*1930 – Miguel Primo de Rivera, Spanish general and politician, Prime Minister of Spain (b. 1870)\n*1935 – John James Rickard Macleod, Scottish physician and physiologist, Nobel Prize laureate (b. 1876)\n*  1935   – Aron Nimzowitsch, Latvian-Danish chess player (b. 1886)\n*1936 – Marguerite Durand, French actress, journalist, and activist (b. 1864)\n*1937 – Alexander von Staël-Holstein, Estonian orientalist and sinologist (b. 1877)\n*1940 – Selma Lagerlöf, Swedish author and academic, Nobel Prize laureate (b. 1858)\n*1945 – Börries von Münchhausen, German poet (b. 1874)\n*1955 – Nicolas de Staël, French-Russian painter and illustrator (b. 1914)\n*1957 – Constantin Brâncuși, Romanian-French sculptor, painter, and photographer (b. 1876)\n*1958 – Leon Cadore, American baseball player (b. 1891)\n*1961 – Chen Geng, Chinese general and politician (b. 1903)\n*  1961   – Václav Talich, Czech violinist and conductor (b. 1883)\n*1963 – Laura Adams Armer, American author and photographer (b. 1874)\n*1965 – Alice Herz, German activist (b. 1882)\n*1967 – Thomas MacGreevy, Irish poet (b. 1893)\n*1968 – Mario Castelnuovo-Tedesco, Italian-American pianist and composer (b. 1895)\n*  1968   – Gunnar Ekelöf, Swedish poet and translator (b. 1907)\n*  1970   – Tammi Terrell, American singer (b. 1945)\n*1971 – Bebe Daniels, American actress (b. 1901)\n*  1971   – Thomas E. Dewey, American lawyer and politician, 47th Governor of New York (b. 1902)\n*1972 – Pie Traynor, American baseball player (b. 1898)\n*1975 – T-Bone Walker, American singer-songwriter and guitarist (b. 1910)\n*1977 – Kamal Jumblatt, Lebanese lawyer and politician (b. 1917)\n*1979 – Jean Monnet, French economist and politician (b. 1888)\n*1980 – Tamara de Lempicka, Polish-American painter (b. 1898)\n*1983 – Arthur Godfrey, American actor and television host (b. 1903)\n*  1983   – Fred Rose, Polish-Canadian politician (b. 1907)\n*1985 – Roger Sessions, American composer, critic, and educator (b. 1896)\n*  1985   – Eddie Shore, Canadian-American ice hockey player (b. 1902)\n*1988 – Mickey Thompson, American race car driver (b. 1928)\n*1990 – Ernst Bacon, American pianist, composer, and conductor (b. 1898)\n*1991 – Chris Austin, American country singer (b .1964)\n*  1991   – Jean Bellette, Australian artist (b. 1908)\n*1992 – Yves Rocard, French physicist and engineer (b. 1903)\n*1994 – Eric Show, American baseball player (b. 1956)\n*1998 – Derek Barton, English-American chemist and academic, Nobel Prize laureate (b. 1918)\n*  1998   – Esther Bubley, American photographer (b. 1921)\n*1999 – Gratien Gélinas, Canadian actor, director, and playwright (b. 1909)\n*2000 – Thomas Ferebee, American colonel and pilot (b. 1918)\n*  2000   – Pavel Prudnikau, Belarusian poet and author (b. 1911)\n*  2000   – Michael Starr, Canadian judge and politician, 16th Canadian Minister of Labour (b. 1910)\n*  2000   – Carlos Velázquez, Puerto Rican pitcher (b. 1948)\n*2001 – Bob Wollek, French race car driver (b. 1943)\n*2003 – Rachel Corrie, American activist (b. 1979)\n*  2003   – Ronald Ferguson, English captain, polo player, and manager (b. 1931)\n*2004 – Vilém Tauský, Czech conductor and composer (b. 1910)\n*2005 – Todd Bell, American football player (b. 1958)\n*  2005   – Ralph Erskine, English architect, designed The London Ark (b. 1914)\n*  2005   – Dick Radatz, American baseball player (b. 1937)\n*2007 – Manjural Islam Rana, Bangladeshi cricketer (b. 1984)\n*2008 – Bill Brown, Australian cricketer and soldier (b. 1912)\n*  2008   – Ivan Dixon, American actor, director, and producer (b. 1931)\n*  2008   – Gary Hart, American wrestler and manager (b. 1942)\n*2011 – Richard Wirthlin, American religious leader (b. 1931)\n*2012 – Donald E. Hillman, American colonel and pilot (b. 1918)\n*  2012   – Takaaki Yoshimoto, Japanese poet, philosopher, and critic (b. 1924)\n*2013 – Jamal Nazrul Islam, Bangladeshi physicist and cosmologist (b. 1939)\n*  2013   – José Alfredo Martínez de Hoz, Argentinian economist and politician, Minister of Economy of Argentina (b. 1925)\n*  2013   – Yadier Pedroso, Cuban pitcher (b. 1986)\n*  2013   – Ruchoma Shain, American-born teacher and author (b. 1914)\n*  2013   – Marina Solodkin, Russian-Israeli academic and politician (b. 1952)\n*  2013   – Frank Thornton, English actor (b. 1921)\n*2014 – Gary Bettenhausen, American race car driver (b. 1941)\n*  2014   – Donald Crothers, American chemist and academic (b. 1937)\n*  2014   – Yulisa Pat Amadu Maddy, Sierra Leonean author, poet, and playwright (b. 1936)\n*  2014   – Steve Moore, English author and illustrator (b. 1949)\n*  2014   – Alexander Pochinok, Russian economist and politician (b. 1958)\n*2015 – Jack Haley, American basketball player, coach, and sportscaster (b. 1964)\n*  2015   – Don Robertson, American pianist and composer (b. 1922)\n*2016 – Alexander Esenin-Volpin, Russian-American mathematician and poet (b. 1924)\n*  2016   – Frank Sinatra, Jr., American singer and actor (b. 1944)\n\nHolidays and observances\n\n*Christian feast day:\n**Abbán\n**Heribert of Cologne\n**March 16 (Eastern Orthodox liturgics)\n*Day of the Book Smugglers (Lithuania)\n*Latvian Legion Day (Latvia)\n*Saint Urho's Day (Finnish Americans and Finnish Canadians)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 16" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19818" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 597 BC – Babylonians capture Jerusalem, and replace Jeconiah with Zedekiah as king.\n* 455 – Emperor Valentinian III is assassinated by two Hunnic retainers while training with the bow on the Campus Martius (Rome).\n* 934 – Meng Zhixiang declares himself emperor and establishes Later Shu as a new state independent of Later Tang.\n*1190 – Massacre of Jews at Clifford's Tower, York.\n*1244 – Over 200 Cathars are burned after the Fall of Montségur.\n*1322 – The Battle of Boroughbridge take place in the Despenser Wars.\n*1521 – Ferdinand Magellan reaches the island of Homonhon in the Philippines.\n*1621 – Samoset, a Mohegan, visited the settlers of Plymouth Colony and greets them, \"Welcome, Englishmen! My name is Samoset.\"\n*1660 – The Long Parliament of England is dissolved so as to prepare for the new Convention Parliament.\n*1689 – The 23rd Regiment of Foot, or Royal Welch Fusiliers, is founded.\n*1782 – American Revolutionary War: Spanish troops capture the British-held island of Roatán.\n*  1782   – Anglo-Spanish War (1779): Action of 16 March 1782\n*1792 – King Gustav III of Sweden is shot; he dies on March 29.\n*1797 – French Revolutionary Wars: An Austrian column is defeated by the French in the Battle of Valvasone.\n*1802 – The Army Corps of Engineers is established to found and operate the United States Military Academy at West Point.\n*1812 – The Siege of Badajoz begins: British and Portuguese forces besiege and defeat the French garrison during the Peninsular War.\n*1815 – Prince Willem proclaims himself King of the United Kingdom of the Netherlands, the first constitutional monarch in the Netherlands.\n*1818 – In the Second Battle of Cancha Rayada, Spanish forces defeated Chileans under José de San Martín.\n*1864 – American Civil War: During the Red River Campaign, Union troops reach Alexandria, Louisiana.\n*1865 – American Civil War: The Battle of Averasborough began as Confederate forces suffer irreplaceable casualties in the final months of the war.\n*1870 – The first version of the overture fantasy Romeo and Juliet by Tchaikovsky receives its première performance. \n*1872 – The Wanderers F.C. won the first FA Cup, the oldest football competition in the world, beating Royal Engineers A.F.C. 1–0 at The Oval in Kennington, London.\n*1894 – Jules Massenet's opera Thaïs is first performed.\n*1898 – In Melbourne the representatives of five colonies adopted a constitution, which would become the basis of the Commonwealth of Australia.J.A. LaNauze. The Making of the Australian Constitution. Melbourne University Press,\n 1972.\n*1900 – Sir Arthur Evans purchased the land around the ruins of Knossos, the largest Bronze Age archaeological site on Crete.\n*1916 – The 7th and 10th US cavalry regiments under John J. Pershing cross the US–Mexico border to join the hunt for Pancho Villa.\n*1917 – World War I: A German auxiliary cruiser is sunk in the Action of 16 March 1917.\n*1918 – Finnish Civil War: Battle of Länkipohja is infamous for its bloody aftermath as the Whites executed 70–100 capitulated Reds.\n*1924 – In accordance with the Treaty of Rome, Fiume becomes annexed as part of Italy.\n*1925 – An earthquake occurs in Yunnan, China.\n*1926 – History of Rocketry: Robert Goddard launches the first liquid-fueled rocket, at Auburn, Massachusetts.\n*1935 – Adolf Hitler orders Germany to rearm herself in violation of the Treaty of Versailles. Conscription is reintroduced to form the Wehrmacht.\n*1936 – Warmer-than-normal temperatures rapidly melt snow and ice on the upper Allegheny and Monongahela rivers, leading to a major flood in Pittsburgh.\n*1939 – From Prague Castle, Hitler proclaims Bohemia and Moravia a German protectorate.\n*1940 – First person killed (James Isbister) in a German bombing raid on the UK in World War II during a raid on Scapa Flow in the Orkney Islands.\n*1945 – World War II: The Battle of Iwo Jima ended, but small pockets of Japanese resistance persisted.\n*  1945   – Ninety percent of Würzburg, Germany is destroyed in only 20 minutes by British bombers, resulting in around 5,000 deaths. \n*1958 – The Ford Motor Company produces its 50 millionth automobile, the Thunderbird, averaging almost a million cars a year since the company's founding.\n*1962 – A Flying Tiger Line Super Constellation disappears in the western Pacific Ocean, with all 107 aboard missing and presumed dead.\n*1966 – Launch of Gemini 8, the 12th manned American space flight and first space docking with the Agena target vehicle.\n*1968 – Vietnam War: My Lai Massacre occurs; between 347 and 500 Vietnamese villagers (men, women, and children) are killed by American troops.\n*  1968   – General Motors produces its 100 millionth automobile, the Oldsmobile Toronado.\n*1969 – A Viasa McDonnell Douglas DC-9 crashes in Maracaibo, Venezuela, killing 155.\n*1976 – British Prime Minister Harold Wilson resigns, citing personal reasons.\n*1977 – Assassination of Kamal Jumblatt, the main leader of the anti-government forces in the Lebanese Civil War.\n*1978 – Former Italian Prime Minister Aldo Moro is kidnapped. (He is later murdered by his captors.)\n*  1978   – Supertanker Amoco Cadiz splits in two after running aground on the Portsall Rocks, three miles off the coast of Brittany, resulting in the largest oil spill in history at that time.\n*1979 – Sino-Vietnamese War: The People's Liberation Army crosses the border back into China, ends the war.\n*1983 – Demolition of the Ismaning radio transmitter, the last wooden radio tower in Germany.\n*1984 – William Buckley, the CIA station chief in Beirut, Lebanon, is kidnapped by Islamic fundamentalists. (He later dies in captivity.)\n*1985 – Associated Press newsman Terry Anderson is taken hostage in Beirut. He is released on December 4, 1991.\n*1988 – Iran–Contra affair: Lieutenant Colonel Oliver North and Vice Admiral John Poindexter are indicted on charges of conspiracy to defraud the United States.\n*  1988   – Halabja chemical attack: The Kurdish town of Halabja in Iraq is attacked with a mix of poison gas and nerve agents on the orders of Saddam Hussein, killing 5000 people and injuring about 10000 people.\n*  1988   – The Troubles: Ulster loyalist militant Michael Stone attacks a Provisional IRA funeral in Belfast with pistols and grenades. A PIRA volunteer and two civilians are killed, and more than 60 others are wounded.\n*1989 – In Egypt, a 4,400-year-old mummy is found near the Pyramid of Cheops.\n*1991 – The airplane carrying eight members of Reba McEntire's touring band crashed on the side of Otay Mountain.\n*1995 – Mississippi formally ratifies the Thirteenth Amendment, becoming the last state to approve the abolition of slavery. The Thirteenth Amendment was officially ratified in 1865.\n*2001 – A series of bomb blasts that took place in the city of Shijiazhuang, China killed 108 people and injured 38 others, was the biggest mass murder in China in decades.\n*2005 – Israel officially hands over Jericho to Palestinian control.\n*2014 – Crimea votes in a controversial referendum to secede from Ukraine to join Russia.\n*2016 – A bomb detonates in a bus carrying government employees in Peshawar, Pakistan, killing 15 and injuring at least 54.\n*  2016   – Two suicide bombers detonate their explosives at a mosque during morning prayer on the outskirts of Maiduguri, Nigeria, killing 22 and injuring 18.\n\nBirths\n\n*1399 – The Xuande Emperor, ruler of Ming China (d. 1435)\n*1445 – Johann Geiler von Kaisersberg, Swiss priest and theologian (d. 1510)\n*1465 – Kunigunde of Austria, Archduchess of Austria (d. 1520)\n*1473 – Henry IV, Duke of Saxony (d. 1541)\n*1559 – Amar Singh I, successor of Maharana Pratap of Mewar (d. 1620)\n*1581 – Pieter Corneliszoon Hooft, Dutch historian and poet (d. 1647)\n*1585 – Gerbrand Bredero, Dutch poet and playwright (d. 1618)\n*1590 – Ii Naotaka, Japanese daimyo (d. 1659)\n*1596 – Ebba Brahe, Swedish countess (d. 1674)\n*1609 – Michael Franck, German baker, teacher, poet, and composer (d. 1667)\n*  1609   – Agostino Mitelli, Italian painter (d. 1660)\n*1621 – Georg Neumark, German poet and composer (d. 1681)\n*1631 – René Le Bossu, French critic (d. 1680)\n*1638 – François Crépieul, Jesuit missionary (d. 1702)\n*1654 – Andreas Acoluthus, German scholar (d. 1704)\n*1670 – François de Franquetot de Coigny, French general (d. 1759)\n*1673 – Jean Bouhier, French jurist and scholar (d. 1746)\n*1687 – Sophia Dorothea of Hanover, queen consort of Frederick William I (d. 1757)\n*1693 – Malhar Rao Holkar, Indian nobleman (d. 1766)\n*1701 – Daniel Lorenz Salthenius, Swedish theologian (d. 1750)\n*1729 – Maria Louise Albertine (d. 1818)\n*1741 – Carlo Amoretti, Italian scientist (d. 1816)\n*1744 – Nicolas-Germain Léonard, French poet and novelist (d. 1793)\n*1750 – Caroline Herschel, German-English astronomer (d. 1848)\n*1751 – James Madison, American academic and politician, 4th President of the United States (d. 1836)\n*1753 – François Amédée Doppet, French general (d. 1799)\n*1760 – Johann Heinrich Meyer, Swiss painter and writer (d. 1832)\n*1766 – Jean-Frédéric Waldeck,  French antiquarian, cartographer, artist and explorer (d. 1875)\n*1771 – Antoine-Jean Gros, French painter (d. 1835)\n*1773 – Juan Ramón Balcarce, Argentinian general and politician, 6th Governor of Buenos Aires Province (d. 1836)\n*1774 – Matthew Flinders, English navigator and cartographer (d. 1814)\n*1789 – Francis Rawdon Chesney, English general and explorer (d. 1872)\n*  1789   – Georg Ohm, German physicist and mathematician (d. 1854)\n*1794 – Ami Boué, Austrian geologist and ethnographer (d. 1881)\n*1797 – Alaric Alexander Watts, English poet and journalist (d. 1864)\n*1799 – Anna Atkins, English botanist and photographer (d. 1871)\n*1800 – Emperor Ninkō of Japan (d. 1846)\n*1805 – Peter Ernst von Lasaulx, German philologist and politician (d. 1861)\n*1806 – Félix De Vigne, Belgian painter (d. 1862)\n*1813 – Gaëtan de Rochebouët, French prime minister (d. 1899)\n*1819 – José Paranhos, Brazilian politician (d. 1880)\n*1820 – Enrico Tamberlik, Italian tenor (d. 1889)\n*1821 – Eduard Heine, German mathematician and academic (d. 1881)\n*1822 – Rosa Bonheur, French painter and sculptor (d. 1899)\n*  1822   – John Pope, American general (d. 1892)\n*1823 – William Henry Monk, English organist and composer  (d. 1889)\n*1828 – Émile Deshayes de Marcère, French politician (d. 1918)\n*1834 – James Hector, Scottish geologist and surgeon (d. 1907)\n*1836 – Andrew Smith Hallidie, English-American engineer and businessman (d. 1900)\n*1839 – Sully Prudhomme, French poet and critic, Nobel Prize laureate (d. 1907)\n*  1839   – John Butler Yeats, Irish painter (d. 1922)\n*1840 – Shibusawa Eiichi, Japanese businessman (d. 1931)\n*  1840   – Georg von der Gabelentz, German linguist and sinologist (d. 1893)\n*1845 – Umegatani Tōtarō I, Japanese sumo wrestler, the 15th Yokozuna (d. 1928)\n*1846 – Gösta Mittag-Leffler, Swedish mathematician and academic (d. 1927)\n*  1846   – Rebecca Cole, American physician and social reformer (d. 1922)\n*  1846   – Jurgis Bielinis, Lithuanian book smuggler (d. 1918)\n*1848 – Axel Heiberg, Norwegian financier and diplomat (d. 1932)\n*1851 – Otto Bardenhewer, German patrologist (d. 1935)\n*  1851   – Martinus Beijerinck, Dutch microbiologist and botanist (d. 1931)\n*1856 – Napoléon, Prince Imperial of France (d. 1879)\n*1857 – Charles Harding Firth, English historian and academic (d. 1936)\n*1859 – Alexander Stepanovich Popov, Russian physicist and academic (d. 1906)\n*1865 – Patsy Donovan, Irish-American baseball player and manager (d. 1953)\n*1869 – Willy Burmester, German violinist (d. 1933)\n*1871 – Hans Merensky, South African geologist and philanthropist (d. 1951)\n*  1871   – Frantz Reichel, French rugby player and hurdler (d. 1932)\n*1874 – Frédéric François-Marsal, French prime minister (d. 1958)\n*1877 – Léo-Ernest Ouimet, Canadian director and producer (d. 1972)\n*1878 – Clemens August Graf von Galen, German cardinal (d. 1946)\n*  1878   – Paul Jouve, French painter (d. 1973)\n*1881 – Fannie Charles Dillon, American composer (d. 1947)\n*1882 – James Lightbody, American runner (d. 1953)\n*1883 – Ethel Anderson, Australian poet, author, and painter (d. 1958)\n*1884 – Eric P. Kelly, American journalist and author (d. 1960)\n*1885 – Giacomo Benvenuti, Italian composer and musicologist (d. 1943)\n*  1885   – Sydney Chaplin, English actor (d. 1965)\n*1886 – Herbert Lindström, Swedish tug of war player (d. 1951)\n*1887 – Emilio Lunghi, Italian runner (d. 1925)\n*  1887   – S. Stillman Berry, American marine zoologist (1984)\n*1889 – Reggie Walker, South African athlete (d. 1951)\n*1892 – César Vallejo, Peruvian poet, playwright, and journalist (d. 1938)\n*1895 – Ernest Labrousse, French historian (d. 1988)\n*1897 – Antonio Donghi, Italian painter (d. 1963)\n*  1897   – Conrad Nagel, American actor (d. 1970)\n*1900 – Cyril Hume, American novelist (d. 1966)\n*  1900 – Mencha Karnicheva, Macedonian revolutionary and assassin (d. 1964) \n*1901 – Alexis Chantraine, Belgian footballer (d. 1987)\n*1903 – Mike Mansfield, American politician and diplomat, 22nd United States Ambassador to Japan (d. 2001)\n*1906 – Francisco Ayala, Spanish sociologist, author, and translator (d. 2009)\n*  1906   – Maurice Turnbull, Welsh-English cricketer and rugby player (d. 1944)\n*  1906   – Henny Youngman, English-American violinist and comedian (d. 1998)\n*1908 – René Daumal, French author and poet (d. 1944)\n*  1908   – Ernest Rogez, French water polo player (d. 1986)\n*  1908   – Robert Rossen, American director, producer, and screenwriter (d. 1966)\n*1910 – Aladár Gerevich, Hungarian fencer (d. 1991)\n*  1910   – Iftikhar Ali Khan Pataudi, Indian-English cricketer and politician, 8th Nawab of Pataudi (d. 1952)\n*1911 – Pierre Harmel, Belgian lawyer and politician, 40th Prime Minister of Belgium (d. 2009)\n*  1911   – Josef Mengele, German physician and captain (d. 1979)\n*1912 – Pat Nixon, First Lady of the United States (d. 1993)\n*1913 – Rémy Raffalli, French soldier (d. 1952)\n*1915 – Kunihiko Kodaira, Japanese mathematician and academic (d. 1997)\n*1916 – Mercedes McCambridge, American actress (d. 2004)\n*  1916   – Tsutomu Yamaguchi, Japanese engineer and businessman (d. 2010)\n*1917 – Louis C. Wyman, American lawyer and politician (d. 2002)\n*1918 – Aldo van Eyck, Dutch architect (d. 1999)\n*  1918   – Frederick Reines, American physicist and academic, Nobel Prize laureate (d. 1998)\n*1920 – John Addison, English-American soldier and composer (d. 1998)\n*  1920   – Sid Fleischman, American author and screenwriter (d. 2010)\n*  1920   – Traudl Junge, German secretary (d. 2002)\n*  1920   – Leo McKern, Australian-English actor (d. 2002)\n*1922 – Harding Lemay, American screenwriter and playwright\n*1923 – Heinz Wallberg, German conductor (d. 2004)\n*1925 – Cornell Borchers, Lithuanian-German actress and singer (d. 2014)\n*  1925   – Mary Hinkson, American dancer and choreographer (d. 2014)\n*  1925   – Ervin Kassai, Hungarian basketball player and referee (d. 2012)\n*  1925   – Luis E. Miramontes, Mexican chemist and engineer (d. 2004)\n*1926 – Charles Goodell, American lawyer and politician (d. 1987)\n*  1926   – Jerry Lewis, American actor and comedian (d. 2017)\n*1927 – Vladimir Komarov, Russian pilot, engineer, and astronaut (d. 1967)\n*  1927   – Daniel Patrick Moynihan, American sociologist and politician, 12th United States Ambassador to the United Nations (d. 2003)\n*  1927   – Olga San Juan, American actress and dancer (d. 2009)\n*1928 – Wakanohana Kanji I, Japanese sumo wrestler, the 45th Yokozuna (d. 2010)\n*  1928   – Christa Ludwig, German soprano and actress\n*1929 – Betty Johnson, American singer\n*  1929   – Tihomir Novakov, Serbian-American physicist and academic (d. 2015)\n*  1929   – Nadja Tiller, Austrian actress\n*1930 – Tommy Flanagan, American pianist and composer (d. 2001)\n*1931 – Augusto Boal, Brazilian theatre director, writer and politician (d. 2009)\n*  1931   – Alan Heyman, American-South Korean musicologist and composer (d. 2014)\n*  1931   – Anthony Kenny, English philosopher and academic\n*  1931   – John Munro, Canadian lawyer and politician, 22nd Canadian Minister of Labour (d. 2003)\n*1932 – Don Blasingame, American baseball player and manager (d. 2005)\n*  1932   – Walter Cunningham, American colonel, pilot, and astronaut\n*  1932   – Kurt Diemberger, Austrian mountaineer and author\n*  1932   – Herbert Marx, Canadian politician \n*1933 – Keith Critchlow, English architect and academic, co-founded Temenos Academy\n*  1933   – Sanford I. Weill, American banker, financier, and philanthropist\n*1934 – Jean Cournoyer, Canadian politician\n*  1934   – Ray Hnatyshyn, Canadian lawyer and politician, 24th Governor General of Canada (d. 2002)\n*  1934   – Roger Norrington, English violinist and conductor\n*1935 – Teresa Berganza, Spanish soprano and actress\n*  1935   – Pepe Cáceres, Colombian bullfighter (d. 1987)\n*1936 – Raymond Vahan Damadian, Armenian-American inventor, invented the MRI\n*  1936   – Fred Neil, American folk singer-songwriter and guitarist (d. 2001)\n*1937 – David Frith, English historian, journalist, and author\n*  1937   – Attilio Nicora, Italian cardinal (d. 2017)\n*  1937   – Amos Tversky, Israeli-American psychologist and academic (d. 1996)\n*1939 – Carlos Bilardo, Argentinian footballer and manager\n*  1939   – Yvon Côté, Canadian teacher\n*1940 – Bernardo Bertolucci, Italian director and screenwriter\n*  1940   – Vagif Mustafazadeh, Azerbaijani pianist and composer (d. 1979)\n*  1940   – Jan Pronk, Dutch academic and politician, Dutch Ministry of Housing, Spatial Planning and the Environment\n*  1940   – Keith Rowe, English guitarist \n*1941 – Robert Guéï, Ivorian soldier and politician, 3rd President of Côte d'Ivoire (d. 2002)\n*  1941   – Chuck Woolery, American game show host and television personality\n*1942 – Roger Crozier, Canadian-American ice hockey player and coach (d. 1996)\n*  1942   – Gijs van Lennep, Dutch race car driver\n*  1942   – Jean-Pierre Schosteck, French politician\n*  1942   – James Soong, Chinese-Taiwanese politician, Governor of Taiwan Province\n*  1942   – Jerry Jeff Walker, American singer-songwriter and guitarist \n*1943 – Ursula Goodenough, American biologist, zoologist, and author\n*  1943   – Hans Heyer, German racing driver\n*  1943   – Álvaro de Soto, Peruvian diplomat\n*1944 – Andrew S. Tanenbaum, American computer scientist and academic\n*1946 – Sigmund Groven, Norwegian harmonica player and composer\n*  1946   – Mary Kaldor, English economist and academic\n*  1946   – J. Z. Knight, American New Age teacher and author\n*  1946   – Guesch Patti, French singer\n*1948 – Michael Owen Bruce, American singer-songwriter and guitarist \n*  1948   – Richard Desjardins, Canadian singer-songwriter and director\n*  1948   – Catherine Quéré, French politician\n*1949 – Erik Estrada, American actor \n*  1949   – Victor Garber, Canadian actor and singer\n*  1949   – Elliott Murphy, American-French singer-songwriter and journalist\n*1950 – Peter Forster, English bishop\n*  1950   – Kate Nelligan, Canadian actress\n*  1950   – Edhem Šljivo, Bosnian footballer \n*1951 – Ray Benson, American singer-songwriter, guitarist, and producer \n*  1951   – Abdelmajid Bourebbou,  Algerian footballer\n*  1951   – Oddvar Brå, Norwegian skier\n*  1951   – Joe DeLamielleure, American football player\n*  1951   – Alexandre Gonzalez, French long-distance runner\n*1953 – Claus Peter Flor, German conductor\n*  1953   – Isabelle Huppert, French actress\n*  1953   – Rainer Knaak, German chess player\n*  1953   – Richard Stallman, American computer scientist and programmer\n*1954 – David Heath, English politician\n*  1954   – Jimmy Nail, English singer-songwriter, guitarist, and actor\n*  1954   – Tim O'Brien, American singer-songwriter and guitarist \n*  1954   – Dav Whatmore, Sri Lankan-Australian cricketer and coach\n*  1954   – Nancy Wilson, American singer-songwriter, guitarist, producer, and actress \n*1955 – Svetlana Alexeeva, Russian ice dancer and coach\n*  1955   – Rimantas Astrauskas, Lithuanian physicist\n*  1955   – Bruno Barreto, Brazilian director, producer, and screenwriter\n*  1955   – Linda Lepomme, Belgian actress and singer\n*  1955   – Bob Ley, American sports anchor and reporter\n*  1955   – Andy Scott, Canadian politician (d. 2013)\n*  1955   – Jiro Watanabe, Japanese boxer\n*1956 – Ozzie Newsome, American football player and manager\n*  1956   – Clifton Powell, American actor, director, and producer\n*  1956   – Yoriko Shono, Japanese writer\n*  1956   – Eveline Widmer-Schlumpf, Swiss lawyer and politician\n*1958 – Phillip Wilcher, Australian pianist and composer\n*  1958   – Kate Worley, American author (d. 2004)\n*1959 – Michael J. Bloomfield, American astronaut\n*  1959   – Sebastian Currier, American composer and educator\n*  1959   – Greg Dyer, Australian cricketer\n*  1959   – Flavor Flav, American rapper and actor\n*  1959   – Charles Hudson, American baseball player \n*  1959   – Steve Marker, American musician\n*  1959   – Jens Stoltenberg, Norwegian economist and politician, 27th Prime Minister of Norway\n*1960 – John Hemming, English businessman and politician\n*  1960   – Duane Sutter, Canadian ice hockey player and coach\n*  1960   – Jenny Eclair, English comedian, actress and screenwriter\n*1961 – Brett Kenny, Australian rugby player and coach\n*  1961   – Todd McFarlane, Canadian author, illustrator, and businessman, founded McFarlane Toys\n*1962 – Franck Fréon, French race car driver\n*  1962   – Liliane Gaschet, French athlete \n*1963 – Jerome Flynn, English actor and singer\n*  1963   – Kevin Smith, New Zealand actor and singer (d. 2002)\n*1964 – Patty Griffin, American singer-songwriter \n*  1964   – Pascal Richard, Swiss racing cyclist\n*  1964   – Gore Verbinski, American director, producer, and screenwriter\n*1965 – Steve Armstrong, American wrestler\n*  1965   – Cindy Brown, basketball player\n*  1965   – Mark Carney, Canadian-English economist and banker\n*  1965   – Cristiana Reali, Italian-Brazilian actress\n*1967 – Tracy Bonham, American singer and violinist\n*  1967   – John Darnielle, American musician and novelist\n*  1967   – Lauren Graham, American actress and producer\n*  1967   – Ronnie McCoury, American bluegrass mandolin player, singer and songwriter\n*  1967   – Heidi Zurbriggen, Swiss alpine skier\n*1968 – Trevor Wilson, American basketball player and police officer\n*1969 – Judah Friedlander, American comedian and actor\n*  1969   – Ottis Gibson, Barbadian cricketer and coach\n*  1969   – Alina Ivanova, Russian athlete\n*  1969   – Evangelos Koronios, Greek basketball player and coach\n*1970 – Joakim Berg, Swedish singer-songwriter and guitarist \n*1971 – Franck Comba, French rugby player\n*  1971   – Alan Tudyk, American actor\n*1972 – Ismaïl Sghyr, French-Moroccan long-distance runner\n*1973 – Andrey Mizurov, Kazakhstani road bicycle racer\n*  1973   – Vonda Ward, American boxer\n*1974 – Georgios Anatolakis, Greek footballer and politician\n*  1974   – Anne Charrier, French actress\n*  1974   – Heath Streak, Zimbabwean cricketer\n*1975 – Luciano Castro, Argentine actor \n*  1975   – Sienna Guillory, English model and actress\n*  1975   – Lionel Torres, French archer\n*1976 – Blu Cantrell, American singer-songwriter and producer\n*  1976   – Leila Lejeune, French handballer \n*  1976   – Susanne Ljungskog, Swedish cyclist\n*  1976   – Abraham Núñez, Dominican baseball player\n*  1976   – Zhu Chen, Qatari chess Grandmaster\n*1977 – Mónica Cruz, Spanish actress and dancer\n*  1977   – Thomas Rupprath, German swimmer\n*1978 – Brooke Burns, American fashion model and actress\n*  1978   – Annett Renneberg, German actress and singer\n*1979 – Christina Liebherr, Swiss equestrian\n*  1979   – Rashad Moore, American football player\n*  1979   – Sébastien Ostertag, French handball player\n*  1979   – Leena Peisa, Finnish keyboard player and songwriter \n*  1979   – Andrei Stepanov, Estonian footballer\n*1980 – Todd Heap, American football player\n*  1980   – Felipe Reyes, Spanish basketball player\n*1981 – Andrew Bree, Irish swimmer\n*  1981   – Curtis Granderson, American baseball player\n*  1981   – Julien Mazet, French road bicycle racer\n*  1981   – Fabiana Murer, Brazilian pole vaulter\n*1982 – Miguel Comminges, Guadeloupean footballer \n*  1982   – Riley Cote, Canadian ice hockey player and coach\n*  1982   – Tommy Hansen, Czech actor\n*  1982   – Jesús Del Nero, Spanish road bicycle racer \n*  1982   – Brian Wilson, American baseball player\n*1983 – Stephen Drew, American baseball player\n*  1983   – Brandon League, American baseball player\n*  1983   – Nicolas Rousseau, French road bicycle racer \n*  1983   – Tramon Williams, American football player\n*1984 – Levi Brown, American football player\n*  1984   – Aisling Bea, Irish comedienne and actress\n*  1984   – Sharon Cherop, Kenyan long-distance runner\n*  1984   – Michael Ennis, Australian rugby player\n*  1984   – Hosea Gear, New Zealand rugby player\n*  1984   – Brandon Prust, Canadian ice hockey player\n*1985 – Teddy Atine-Venel, French athlete \n*  1985   – Eddy Lover, Panamanian singer-songwriter\n*  1985   – Aleksei Sokirskiy, Russian hammer thrower\n*1986 – Alexandra Daddario, American actress\n*  1986   – Toney Douglas, American basketball player\n*  1986   – Kenny Dykstra, American wrestler\n*  1986   – T. J. Jordan, American basketball player\n*  1986   – Boaz Solossa, Indonesian footballer\n*  1986   – Daisuke Takahashi, Japanese figure skater\n*1987 – Fabien Lemoine, French football player\n*1988 – Jessica Gregg, Canadian speed skater\n*  1988   – Patrick Herrmann, German footballer\n*1989 – Blake Griffin, American basketball player\n*  1989   – Jung So-min, Korean actress\n*  1989   – Magalie Pottier, French racing cyclist\n*  1989   – Theo Walcott, English footballer\n*1990 – Andre Young, basketball player\n*1991 – Reggie Bullock, American basketball player\n*  1991   – Wolfgang Van Halen, American bassist\n*1993 – George Ford, English rugby union player\n*  1993   – Marine Lorphelin, Miss France\n*1994 – Joel Embiid, Cameroonian basketball player\n*1995 – Inga Janulevičiūtė, Lithuanian figure skater\n*1997 – Florian Neuhaus, German football player\n\nDeaths\n\n* AD 37 – Tiberius, Roman emperor (b. 42 BC)\n* 455 – Valentinian III, Roman emperor (b. 419)\n*   455   – Heraclius, Roman courtier (primicerius sacri cubiculi )\n* 842 – Xiao Mian, chancellor of the Tang Dynasty\n* 933 – Takin al-Khazari, Egyptian commander and politician, Abbasid Governor of Egypt\n* 943 – Pi Guangye, Chinese official and chancellor (b. 877)\n*1021 – Heribert of Cologne, German archbishop and saint (b. 970)\n*1072 – Adalbert of Hamburg, German archbishop (b. 1000)\n*1181 – Henry I, Count of Champagne\n*1185 – Baldwin IV of Jerusalem (b. 1161)\n*1279 – Jeanne of Dammartin, Queen consort of Castile and León (b. 1216)\n*1322 – Humphrey de Bohun, 4th Earl of Hereford, English general and politician, Lord High Constable of England (b. 1276)\n*1405 – Margaret III, Countess of Flanders (b. 1350)\n*1410 – John Beaufort, 1st Earl of Somerset, French-English admiral and politician, Lord Warden of the Cinque Ports (b. 1373)\n*1457 – Ladislaus Hunyadi, Hungarian politician (b. 1433)\n*1485 – Anne Neville, queen of Richard III of England (b. 1456)\n*1559 – Anthony St. Leger, English-Irish politician Lord Deputy of Ireland (b. 1496)\n*1649 – Jean de Brébeuf, French-Canadian missionary and saint (b. 1593)\n*1679 – John Leverett, English general and politician, 19th Governor of the Massachusetts Bay Colony (b. 1616)\n*1721 – James Craggs the Elder, English politician, Postmaster General of the United Kingdom (b. 1657)\n*1736 – Giovanni Battista Pergolesi, Italian organist and composer (b. 1710)\n*1737 – Benjamin Wadsworth, American minister and academic (b. 1670)\n*1738 – George Bähr, German architect, designed the Dresden Frauenkirche (b. 1666)\n*1747 – Christian August, Prince of Anhalt-Zerbst (b. 1690)\n*1838 – Nathaniel Bowditch, American captain and mathematician (b. 1773)\n*1841 – Félix Savart, French physicist and psychologist (d. 1791)\n*1868 – David Wilmot, American politician, sponsor of Wilmot Proviso (b. 1814)\n*1884 – Art Croft, American baseball player (b. 1855)\n*1888 – Hippolyte Carnot, French politician (b. 1801)\n*1892 – Samuel F. Miller, American lawyer and politician (b. 1827)\n*1898 – Aubrey Beardsley, English author and illustrator (b. 1872)\n*1899 – Joseph Medill, American journalist and politician, 26th Mayor of Chicago (b. 1823)\n*1903 – Roy Bean, American lawyer and judge (b. 1825)\n*1912 – Max Burckhard, Austrian theater director (b. 1854)\n*1914 – Gaston Calmette, French journalist (b. 1858)\n*  1914   – Charles Albert Gobat, Swiss lawyer and politician, Nobel Prize laureate (b. 1843)\n*  1914   – John Murray, Scottish oceanographer, biologist, and limnologist (b. 1841)\n*1925 – August von Wassermann, German bacteriologist and hygienist (b. 1866)\n*1930 – Miguel Primo de Rivera, Spanish general and politician, Prime Minister of Spain (b. 1870)\n*1935 – John James Rickard Macleod, Scottish physician and physiologist, Nobel Prize laureate (b. 1876)\n*  1935   – Aron Nimzowitsch, Latvian-Danish chess player (b. 1886)\n*1936 – Marguerite Durand, French actress, journalist, and activist (b. 1864)\n*1937 – Alexander von Staël-Holstein, Estonian orientalist and sinologist (b. 1877)\n*1940 – Selma Lagerlöf, Swedish author and academic, Nobel Prize laureate (b. 1858)\n*1945 – Börries von Münchhausen, German poet (b. 1874)\n*1955 – Nicolas de Staël, French-Russian painter and illustrator (b. 1914)\n*1957 – Constantin Brâncuși, Romanian-French sculptor, painter, and photographer (b. 1876)\n*1958 – Leon Cadore, American baseball player (b. 1891)\n*1961 – Chen Geng, Chinese general and politician (b. 1903)\n*  1961   – Václav Talich, Czech violinist and conductor (b. 1883)\n*1963 – Laura Adams Armer, American author and photographer (b. 1874)\n*1965 – Alice Herz, German activist (b. 1882)\n*1967 – Thomas MacGreevy, Irish poet (b. 1893)\n*1968 – Mario Castelnuovo-Tedesco, Italian-American pianist and composer (b. 1895)\n*  1968   – Gunnar Ekelöf, Swedish poet and translator (b. 1907)\n*  1970   – Tammi Terrell, American singer (b. 1945)\n*1971 – Bebe Daniels, American actress (b. 1901)\n*  1971   – Thomas E. Dewey, American lawyer and politician, 47th Governor of New York (b. 1902)\n*1972 – Pie Traynor, American baseball player (b. 1898)\n*1975 – T-Bone Walker, American singer-songwriter and guitarist (b. 1910)\n*1977 – Kamal Jumblatt, Lebanese lawyer and politician (b. 1917)\n*1979 – Jean Monnet, French economist and politician (b. 1888)\n*1980 – Tamara de Lempicka, Polish-American painter (b. 1898)\n*1983 – Arthur Godfrey, American actor and television host (b. 1903)\n*  1983   – Fred Rose, Polish-Canadian politician (b. 1907)\n*1985 – Roger Sessions, American composer, critic, and educator (b. 1896)\n*  1985   – Eddie Shore, Canadian-American ice hockey player (b. 1902)\n*1988 – Mickey Thompson, American race car driver (b. 1928)\n*1990 – Ernst Bacon, American pianist, composer, and conductor (b. 1898)\n*1991 – Chris Austin, American country singer (b .1964)\n*  1991   – Jean Bellette, Australian artist (b. 1908)\n*1992 – Yves Rocard, French physicist and engineer (b. 1903)\n*1994 – Eric Show, American baseball player (b. 1956)\n*1998 – Derek Barton, English-American chemist and academic, Nobel Prize laureate (b. 1918)\n*  1998   – Esther Bubley, American photographer (b. 1921)\n*1999 – Gratien Gélinas, Canadian actor, director, and playwright (b. 1909)\n*2000 – Thomas Ferebee, American colonel and pilot (b. 1918)\n*  2000   – Pavel Prudnikau, Belarusian poet and author (b. 1911)\n*  2000   – Michael Starr, Canadian judge and politician, 16th Canadian Minister of Labour (b. 1910)\n*  2000   – Carlos Velázquez, Puerto Rican pitcher (b. 1948)\n*2001 – Bob Wollek, French race car driver (b. 1943)\n*2003 – Rachel Corrie, American activist (b. 1979)\n*  2003   – Ronald Ferguson, English captain, polo player, and manager (b. 1931)\n*2004 – Vilém Tauský, Czech conductor and composer (b. 1910)\n*2005 – Todd Bell, American football player (b. 1958)\n*  2005   – Ralph Erskine, English architect, designed The London Ark (b. 1914)\n*  2005   – Dick Radatz, American baseball player (b. 1937)\n*2007 – Manjural Islam Rana, Bangladeshi cricketer (b. 1984)\n*2008 – Bill Brown, Australian cricketer and soldier (b. 1912)\n*  2008   – Ivan Dixon, American actor, director, and producer (b. 1931)\n*  2008   – Gary Hart, American wrestler and manager (b. 1942)\n*2011 – Richard Wirthlin, American religious leader (b. 1931)\n*2012 – Donald E. Hillman, American colonel and pilot (b. 1918)\n*  2012   – Takaaki Yoshimoto, Japanese poet, philosopher, and critic (b. 1924)\n*2013 – Jamal Nazrul Islam, Bangladeshi physicist and cosmologist (b. 1939)\n*  2013   – José Alfredo Martínez de Hoz, Argentinian economist and politician, Minister of Economy of Argentina (b. 1925)\n*  2013   – Yadier Pedroso, Cuban pitcher (b. 1986)\n*  2013   – Ruchoma Shain, American-born teacher and author (b. 1914)\n*  2013   – Marina Solodkin, Russian-Israeli academic and politician (b. 1952)\n*  2013   – Frank Thornton, English actor (b. 1921)\n*2014 – Gary Bettenhausen, American race car driver (b. 1941)\n*  2014   – Donald Crothers, American chemist and academic (b. 1937)\n*  2014   – Yulisa Pat Amadu Maddy, Sierra Leonean author, poet, and playwright (b. 1936)\n*  2014   – Steve Moore, English author and illustrator (b. 1949)\n*  2014   – Alexander Pochinok, Russian economist and politician (b. 1958)\n*2015 – Jack Haley, American basketball player, coach, and sportscaster (b. 1964)\n*  2015   – Don Robertson, American pianist and composer (b. 1922)\n*2016 – Alexander Esenin-Volpin, Russian-American mathematician and poet (b. 1924)\n*  2016   – Frank Sinatra, Jr., American singer and actor (b. 1944)\n\nHolidays and observances\n\n*Christian feast day:\n**Abbán\n**Heribert of Cologne\n**March 16 (Eastern Orthodox liturgics)\n*Day of the Book Smugglers (Lithuania)\n*Latvian Legion Day (Latvia)\n*Saint Urho's Day (Finnish Americans and Finnish Canadians). March 16. http://en.wikipedia.org/?curid=19818."
  }
}
