{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6088",
  "eid" : "d9d27ea0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778445194,
  "textBody" : "Common Era or Current Era (CE) is a name for a calendar era widely used around the world today. The era preceding CE is known as before the Common or Current Era (BCE). The Current Era notation system can be used as an alternative to the Dionysian era system, which distinguishes eras as AD (', \"[the] year of [the] Lord\") and BC (\"before Christ\"). The two notation systems are numerically equivalent; thus \" CE\" corresponds to \"AD \" and \"400 BCE\" corresponds to \"400 BC\". Both notations refer to the Gregorian calendar (and its predecessor, the Julian calendar). The year-numbering system as used for the Gregorian calendar is the most widespread civil calendar system used in the world today.\n\nThe expression has been traced back to 1615, when it first appeared in a book by Johannes Kepler as the Latin usage ', and to 1635 in English as \"Vulgar Era\". The term \"Common Era\" can be found in English as early as 1708, and became more widely used in the mid-19th century by Jewish academics. In the later 20th century, the use of CE and BCE was popularized in academic and scientific publications, and more generally by authors and publishers wishing to emphasize secularism or sensitivity to non-Christians, by not explicitly referencing Jesus as \"Christ\" and Dominus (\"Lord\") through use of the abbreviation  \"AD\".\n\nHistory \n\nOrigins \n\nThe year numbering system used with Common Era notation was devised by the Christian monk Dionysius Exiguus in the year 525 to replace the Era of Martyrs system, because he did not wish to continue the memory of a tyrant who persecuted Christians. He attempted to number years from an initial reference date (\"epoch\"), an event he referred to as the Incarnation of Jesus.Doggett, L.E., (1992), [http://eclipse.gsfc.nasa.gov/SEhelp/calendars.html \"Calendars\"] in Seidelmann, P.K., The Explanatory Supplement to the Astronomical Almanac, Sausalito CA: University Science Books, 2.1 Dionysius labeled the column of the table in which he introduced the new era as \"Anni Domini Nostri Jesu Christi\".Pedersen, O., (1983), \"The Ecclesiastical Calendar and the Life of the Church\" in Coyne, G.V. et al. (Eds.) [http://articles.adsabs.harvard.edu//full/book/grc../1983//0000052.000.html The Gregorian Reform of the Calendar], Vatican Observatory, p. 52.\n\nNumbering years in this manner became more widespread in Europe with its usage by Bede in England in 731. Bede also introduced the practice of dating years before what he supposed was the year of birth of Jesus,Bede wrote of the Incarnation of Jesus, but treated it as synonymous with birth. Blackburn, B & Holford-Strevens, L, (2003), The Oxford Companion to the Year, Oxford University Press, 778. and the practice of not using a year zero. In 1422, Portugal became the last Western European country to switch to the system begun by Dionysius.\n\nVulgar Era \n\nThe term \"Common Era\" is traced back in English to its appearance as \"Vulgar Era\" to distinguish dates on the Ecclesiastic calendar from those of the regnal year, the year of reign of a sovereign, typically used in national law.\n\nThe first use of the Latin term vulgaris aerae discovered so far was in a 1615 book by Johannes Kepler. Kepler uses it again in a 1616 table of ephemerides,  and again in 1617.  * Translation of title (per 1635 English edition): New Ephemerids for the Celestiall Motions, for the Yeeres of the Vulgar Era 1617–1636 A 1635 English edition of that book has the title page in English – so far, the earliest-found usage of Vulgar Era in English.   A 1701 book edited by John LeClerc includes \"Before Christ according to the Vulgar Æra, 6\".  A 1716 book in English by Dean Humphrey Prideaux says, \"before the beginning of the vulgar æra, by which we now compute the years from his incarnation.\" Merriam Webster accepts the date of 1716, but does not give the source.  A 1796 book uses the term \"vulgar era of the nativity\". \n\nThe first so-far-discovered usage of \"Christian Era\" is as the Latin phrase aerae christianae on the title page of a 1584 theology book.  In 1649, the Latin phrase æræ Christianæ appeared in the title of an English almanac.  A 1652 ephemeris is the first instance so-far-found for English usage of \"Christian Era\". \n\nThe English phrase \"common Era\" appears at least as early as 1708,  and in a 1715 book on astronomy is used interchangeably with \"Christian Era\" and \"Vulgar Era\". Before Christ and Christian Era appear on the same page 252, while Vulgar Era appears on [https://books.google.com/books?id\nze8ehe65hwcC&pgRA2-PA250&dq\n%22Vulgar%22 page 250] A 1759 history book uses common æra in a generic sense, to refer to the common era of the Jews.  In this case, their refers to the Jews. The first-so-far found usage of the phrase \"before the common era\" is in a 1770 work that also uses common era and vulgar era as synonyms, in a translation of a book originally written in German.  The 1797 edition of the Encyclopædia Britannica uses the terms vulgar era and common era synonymously.     In 1835, in his book Living Oracles, Alexander Campbell, wrote: \"The vulgar Era, or Anno Domini; the fourth year of Jesus Christ, the first of which was but eight days\", and also refers to the common era as a synonym for vulgar era with \"the fact that our Lord was born on the 4th year before the vulgar era, called Anno Domini, thus making (for example) the 42d year from his birth to correspond with the 38th of the common era...\" The Catholic Encyclopedia (1909) in at least one article reports all three terms (Christian, Vulgar, Common Era) being commonly understood by the early 20th century.http://www.newadvent.org/cathen/03738a.htm#christian \"Foremost among these [various eras] is that which is now adopted by all civilized peoples and known as the Christian, Vulgar or Common Era, in the twentieth century of which we are now living\".\n\nThe phrase \"common era\", in lower case, also appeared in the 19th century in a generic sense, not necessarily to refer to the Christian Era, but to any system of dates in common use throughout a civilization. Thus, \"the common era of the Jews\",   \"the common era of the Mahometans\",  \"common era of the world\",  \"the common era of the foundation of Rome\".  When it did refer to the Christian Era, it was sometimes qualified, e.g., \"common era of the Incarnation\",  \"common era of the Nativity\",  or \"common era of the birth of Christ\". \n\nAn adapted translation of Common Era into pseudo-Latin as Era Vulgaris (in Latin this means Common Mistress)C.f. every good Latin dictionary, e.g., [http://www.perseus.tufts.edu/hopper/resolveform?typeexact&lookup\n&lang=la perseus.tufts.edu], [http://www.freedict.com/onldict/lat.html freedict.com], [http://en.pons.eu/translate/latin-german pons (English/German)], [http://de.pons.eu/deutsch-latein/ pons (German)] or [http://www.auxilium-online.net/wb/woerterbuch.php auxilium-online.net (German)] was adopted in the 20th century by some followers of Aleister Crowley, and thus the abbreviation \"e.v.\" or \"EV\" may sometimes be seen as a replacement for AD.\n\nHistory of the use of the CE/BCE abbreviation \n\nAlthough Jews have their own Hebrew calendar, they often use the Gregorian calendar.\n\nAs early as 1825, the abbreviation VE (for Vulgar Era) was in use among Jews to denote years in the Western calendar.[19 Sivan 5585 AM is June 5, 1825. VE is likely an abbreviation for Vulgar Era.]\n\nCommon Era notation has also been in use for Hebrew lessons for \"more than a century\". Some Jewish academics were already using the CE and BCE abbreviations by the mid-19th century, such as in 1856, when Rabbi and historian Morris Jacob Raphall used the abbreviation in his book Post-Biblical History of The Jews.Raphall, Morris Jacob (1856). Post-Biblical History of The Jews. Retrieved from https://books.google.com/books?id\nr7CbDH5hTe8C&printsecfrontcover&dq\nCE+BCE.\n\nIn the 200 years between 1808 and 2008 the ratio of usage of BCE to BC has increased by about 20% and CE to AD by about 50%, primarily since 1980.\n\nContemporary usage \n\nSome academics in the fields of theology, education and history have adopted CE and BCE notation, although there is some disagreement.See, for example, the Society for Historical Archaeology states in its more recent style guide \"Do not use C.E. (common era), B.P. (before present), or B.C.E.; convert these expressions to A.D. and B.C.\" (In section I 5 the Society explains how to use \"years B.P.\" in connection with radiocarbon ages.)  whereas the American Anthropological Association style guide takes a different approach calling for \"C.E.\" and \"B.C.E.\" \n\nMore visible uses of Common Era notation have recently surfaced at major museums in the English-speaking world. Furthermore, several style guides now prefer or mandate its usage.\nEven some style guides for Christian churches prefer its use: for example, the Episcopal Diocese Maryland Church News.\n\nIn the United States, the usage of the BCE/CE notation in textbooks is growing. Some publications have moved over to using it exclusively. For example, the 2007 World Almanac was the first edition to switch over to the BCE/CE usage, ending a 138-year usage of the traditional BC/AD dating notation. It is used by the College Board in its history tests, and by the Norton Anthology of English Literature. Others have taken a different approach. The US-based History Channel uses BCE/CE notation in articles on non-Christian religious topics such as Jerusalem and Judaism.;\n\nIn 2002, England and Wales introduced the BCE/CE notation system into the official school curriculum.\n\nIn June 2006, in the United States, the Kentucky State School Board reversed its decision to use BCE and CE in the state's new Program of Studies, leaving education of students about these concepts a matter of discretion at the local level.\n\nAlso in 2011, media reports suggested that the BC/AD notation in Australian school textbooks would be replaced by BCE/CE notation. The story became national news and drew opposition from some politicians and church leaders. Weeks after the story broke, the Australian Curriculum, Assessment and Reporting Authority denied the rumour and stated that the BC/AD notation would remain, with CE and BCE as an optional suggested learning activity.\n\nRationale \n\nSupport \n\nThe use of CE in Jewish scholarship was historically motivated by the desire to avoid the implicit \"Our Lord\" in the abbreviation AD. Although other aspects of dating systems are based in Christian origins, AD is a direct reference to Jesus as Lord.\n\nProponents of the Common Era notation assert that the use of BCE/CE shows sensitivity to those who use the same year numbering system as the one that originated with and is currently used by Christians, but who are not themselves Christian.\n\nFormer United Nations Secretary-General Kofi Annan, himself a Protestant, has argued:\n\n[T]he Christian calendar no longer belongs exclusively to Christians. People of all faiths have taken to using it simply as a matter of convenience. There is so much interaction between people of different faiths and cultures – different civilizations, if you like – that some shared way of reckoning time is a necessity. And so the Christian Era has become the Common Era.\n\nAdena K. Berkowitz, when arguing at the Supreme Court opted to use BCE and CE because \"Given the multicultural society that we live in, the traditional Jewish designations – B.C.E. and C.E. – cast a wider net of inclusion\" https://www.nytimes.com/1997/08/17/magazine/bc-ad-or-bce-ce.html|titleB.C./A.D. or B.C.E./C.E.? |author\nSafire, William |date=17 August 1997\n\nOpposition \n\nSome oppose the Common Era notation for explicitly religious reasons. Because the BC/AD notation is based on the traditional year of the conception or birth of Jesus, some Christians are offended by the removal of the reference to him in era notation. The Southern Baptist Convention supports retaining the BC/AD abbreviations.\n\nThere are also secular concerns. English language expert Kenneth G. Wilson speculated in his style guide that \"if we do end by casting aside the AD/BC convention, almost certainly some will argue that we ought to cast aside as well the conventional numbering system [that is, the method of numbering years] itself, given its Christian basis.\" The short lived French Republican Calendar, for example, began with the first year of the French First Republic and rejected the seven-day week (with its connections to the Book of Genesis) for a ten-day week.\nPriest and writer on interfaith issues Raimon Panikkar contends that using the designation BCE/CE is a \"return... to the most bigoted Christian colonialism\" towards non-Christians, who do not necessarily consider the time period following the beginning of the calendar to be a \"common era\".\n\nAccording to a Los Angeles Times report, it was a student's use of BCE/CE notation, inspired by its use within Wikipedia, which prompted the teacher and politician Andrew Schlafly to found Conservapedia, a cultural conservative wiki. One of its \"Conservapedia Commandments\" is that users must always apply BC/AD notation, since its sponsors perceive BCE/CE notation to \"deny the historical basis\" of the dating system.[http://www.conservapedia.com/Conservapedia:Commandments Conservapedia Commandments] at Conservapedia\n\nConventions in style guides \n\nThe abbreviation BCE, just as with BC, always follows the year number. Unlike AD, which traditionally precedes the year number, CE always follows the year number (if context requires that it be written at all). Thus, the current year is written as  in both notations (or, if further clarity is needed, as  CE, or as AD ), and the year that Socrates died is represented as 399 BCE (the same year that is represented by 399 BC in the BC/AD notation). The abbreviations are sometimes written with small capital letters, or with periods (e.g., \"B.C.E.\" or \"C.E.\"). Style guides for academic texts on religion generally prefer BCE/CE to BC/AD.SBL Handbook of Style Society of Biblical Literature 1999 \"8.1.2 ERAS – The preferred style is B.C.E. and C.E. (with periods). If you use A.D. and B.C., remember that A.D. precedes the date and B.C. follows it. (For the use of these abbreviations in titles, see § 7.1.3.2.)\"\n\nSimilar conventions in other languages \n\nSeveral languages other than English also have both religious and non-religious ways of identifying the era used in dates. In some communist states during the Cold War period, usage of non-religious notation was mandated.\n* In Angola, the abbreviations \"E.C.\" (\"Era Comum\", Common Era) and \"A.E.C.\" (\"Antes da Era Comum\", Before Common Era) are generally used.\n* In Arabic, بعد الميلاد (After the Birth) corresponds to CE, while قبل الميلاد (Before the Birth) corresponds to BCE. The \"Birth\" referenced is that of Jesus. This system is in widespread use in all Arab countries, but is accompanied by the Hijri system. Dates are often given in both in that order. In Saudi Arabia, however, the Hijri system is predominant.\n* In Brazil, the AD is common use, used as DC \"Depois de Cristo (After Christ)\" and BC as AC \"antes de Cristo\"\n* In the Chinese language, common era (公元, gong yuan) has been predominantly used to refer to the western calendar without any religious connotation.\n* In Czech, př.Kr. (před Kristem) and l.P. (léta Páně) were partially replaced (especially l.P., being in conflict with LP record, remaining mostly on signs and cover art, used similarly to est.) by př.n.l. and n.l., meaning před naším letopočtem and našeho letopočtu, literally \"before / of our year numbering\"). Slovak has the ending -om instead of -em and unaccented pred, allowing use of the same abbreviations. Slovak version of léta Páně is \"roku Pána\".\n* In Danish, the terms f.Kr. (før Kristus, before Christ) and e.Kr. (efter Kristus, after Christ) have traditionally been used. They are now in free variation with f.v.t. and e.v.t. (før/efter vor tidsregning, before/after our chronology).\n* In Dutch the terms v.C. or v.Chr. (voor Christus, before Christ) and n.C. or n.Chr. (na Christus, after Christ) have traditionally been used. There are alternatives v.g.j. and g.j. ([vóór] gangbare/gewone jaartelling, [before] conventional/ordinary chronology), v.o.j. and n.o.j. (vóór/na onze jaartelling, before/after our chronology) and v.d.g.j. and n.d.g.j. (vóór/na de gewone jaartelling, before/after the ordinary chronology), but there is still no generally accepted alternative for the Christian notation. The notation v.Chr./n.Chr. remains generally used by the media and scientists.\n* In Finland, the terms eKr. (ennen Kristusta, before Christ) and jKr. (jälkeen Kristuksen, after Christ) were largely used until the 1980s but have been mostly replaced during the last couple of decades with terms eaa. (ennen ajanlaskun alkua, before start of chronology) and jaa. (jälkeen ajanlaskun alun, after start of chronology).\n* In Germany, Jews in Berlin seem to have already been using \"(Before the) Common Era\" in the 18th century, while others like Moses Mendelssohn opposed this usage as it would hinder the integration of Jews into German society. The formulation seems to have persisted among German Jews in the 19th century in forms like vor der gewöhnlichen Zeitrechnung (before the common chronology).Allgemeine Zeitung des Judenthums. Ein unpartheiisches Organ für alles jüdische Interesse, II. Jahrgang, No. 60, Leipzig, 19. Mai 1838 (19 May 1838). See page 175 in [https://books.google.com/books?id\npwxFAAAAcAAJ Allgemeine Zeitung des Judenthums: Ein unpartheiisches Organ für alles jüdische Interesse in Betreff von Politik, Religion, Literatur, Geschichte, Sprachkunde und Belletristik, Volume 2] (Leipzig 1838)., Geschichte des Karäerthums von 900 bis 1575 der gewöhnlichen Zeitrechnung (Leipzig 1862–1869).\nIn 1938 Nazi Germany, the use of this convention was also prescribed by the National Socialist Teachers League.See page 149 in Weiße Blätter issue [http://www.monarchieforum.org/ARCHIV/WeisseBlaetter/MAI1938.pdf May 1938] \nHowever, it was soon discovered that many German Jews had been using the convention ever since the 18th century, and they found it ironic to see \"Aryans following Jewish example nearly 200 years later\".\nThe German Democratic Republic (1949–1990) introduced the convention of v. u. Z. (vor unserer Zeitrechnung, before our chronology) and u. Z. (unserer Zeitrechnung, of our chronology) instead of v. Chr. (vor Christus, before Christ) and n. Chr. (nach Christus/Christi Geburt, after Christ/the Nativity of Christ). The use of these terms persists in contemporary German to some extent, differing regionally and ideologically. In Jewish contexts mostly \"v. d. Z.\" (\"vor der Zeitenwende\") and \"n. d. Z.\" (\"nach der Zeitenwende\") is used.\n* In Hebrew, the most common term used to refer to BCE/CE is simply לספירה (according to the count) for CE, and לפני הספירה (before the count) for BCE. An alternative term, expressing an ideological (sometimes religious) approach aimed at distancing oneself from the source of the count, is למניינם (according to their count). The later is sometimes added after the former, especially in the case of BCE (e.g., שנת 150 לפני הספירה למנינם), due to technical linguistic reasons.\n* In Hungary, similarly to the Bulgarian case, i. e. (időszámításunk előtt, before our era) and i. sz. (időszámításunk szerint, according to our era) are still widely used instead of traditional Kr. e. (Krisztus előtt, Before Christ) and Kr. u. (Krisztus után, After Christ), which were unofficially reinstituted after the Communist period.\n* In Indonesia, the terms SM (Sebelum Masehi, before Masehi, from Arabic Masih, referring to Jesus) and M (Masehi, after Masehi) were generally used. The terms \"STU\" (\"SebelumTarikh Umum\") and \"TU\" (\"Tarikh Umum\") were used to translate \"BCE\" (\"Before Common Era\") and \"CE\" (\"Common Era\")\n* In Italy, e.v. (\"Era Volgare\" from Latin expression \"Aera Vulgaris\") and p.e.v. (\"Prima dell'Era Volgare\", before the vulgar era) may be used (both in lower case), but the historical A.C./D.C. (Avanti Cristo/Dopo Cristo, before Christ/after Christ) are much more frequent.\n* In Japanese, years reckoned by the Western calendar as opposed to the Japanese Imperial eras are indicated by, for example, , where  (seireki) literally means \"Western calendar\" which carries no religious connotation, aside from the fact that Christianity is a Western religion.  (kigenzen) is used to mean \"before the common era (BCE)\" \"AD\", and less commonly, \"CE\", are also occasionally seen, but the typical Japanese person would not care about the religious connotations.\n* In Korean, (, giwonjeon), which means \"preceding the [Western] era\", is used to indicate years BCE. (, seogi), \"Western era\", short for (, seoryeokgiwon), meaning \"[from] the origin year of the Western calendar\", is used to indicate years CE. Christians use  (juhu), meaning \"after [the birth of] the Lord\", as a shorthand calque of Anno Domini.\n* In Macedonian,  (p.n.e. – pred nasha era), meaning before our era, and  (n.e. – nasha era), meaning our era, are used the same way as BCE and CE, respectively.\n* In Poland the only term generally used is naszej ery/przed naszą erą (of our era/before our era). The terms przed Chrystusem/po Chrystusie (before Christ/after Christ) and roku Pańskiego (year of the Lord) are possible but almost never used in contemporary Poland.\n* In Serbia, the common and official terms are p.n.e. (\"pre nove ere\", Before the new era), and n.e. (\"nove ere\", new era).\n* In Romania, throughout most of the communist period, the preferred standard was to use the secularised î. e. n. (înaintea erei noastre, before our era) and e. n. (era noastră, our era). After the downfall of communism in the Romanian Revolution, the original convention using î. Hr. (înainte de Hristos, before Christ) and d. Hr. (după Hristos, after Christ) has become more widespread. Alternatively, î. Cr. and d. Cr. are used, mainly due to an alternative spelling of Hristos (Christ) as Cristos, the latter being preferred by the Roman Catholic and Protestant Churches.\n* In Russia, the terms до н.э. (до нашей эры, before our era) and н.э. (нашей эры, of our era) are often used. Their use was nearly universal during Soviet rule, and while their use in mass media is to some extent being mixed with their Christian equivalents (\"до рождества Христова\", before Christ's birth, and \"от рождества Христова\", from Christ's birth), the BCE/CE terms remain the strongly preferred version in scientific literature, business magazines and other serious texts.\n* In Spanish, Common forms used for \"BC\" are aC and a. de C. (for antes de Cristo, \"before Christ\"), with variations in punctuation and sometimes the use of J.C.(Jesucristo) instead of C. In scholarly writing, you may use AEC as the equivalent of the English \"BCE\", antes de la Era Común or Before the Common Era.\n* In Swedish the terms f.Kr. (före Kristus, before Christ) and e.Kr. (efter Kristus, after Christ) have traditionally been used. They are seldom replaced by f.v.t. and e.v.t. (före/enligt vår tidräkning, before/according to our chronology).\n* In Turkish, the terms M.Ö. (Milattan Önce, before the birth (of Jesus)) and M.S. (Milattan Sonra, after the birth (of Jesus)) are commonly used. İ.Ö. (İsa'dan Önce, before Jesus) and İ.S. (İsa'dan Sonra, after Jesus) can also be seen in academic writing.\n* In Welsh, OC can be expanded to equivalents of both AD (Oed Crist) and CE (Oes Cyffredin); for dates before the Common Era, CC (traditionally, Cyn Crist) is used exclusively, as Cyn yr Oes Cyffredin would abbreviate to a mild obscenity.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Common Era" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6088" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Common Era or Current Era (CE) is a name for a calendar era widely used around the world today. The era preceding CE is known as before the Common or Current Era (BCE). The Current Era notation system can be used as an alternative to the Dionysian era system, which distinguishes eras as AD (', \"[the] year of [the] Lord\") and BC (\"before Christ\"). The two notation systems are numerically equivalent; thus \" CE\" corresponds to \"AD \" and \"400 BCE\" corresponds to \"400 BC\". Both notations refer to the Gregorian calendar (and its predecessor, the Julian calendar). The year-numbering system as used for the Gregorian calendar is the most widespread civil calendar system used in the world today.\n\nThe expression has been traced back to 1615, when it first appeared in a book by Johannes Kepler as the Latin usage ', and to 1635 in English as \"Vulgar Era\". The term \"Common Era\" can be found in English as early as 1708, and became more widely used in the mid-19th century by Jewish academics. In the later 20th century, the use of CE and BCE was popularized in academic and scientific publications, and more generally by authors and publishers wishing to emphasize secularism or sensitivity to non-Christians, by not explicitly referencing Jesus as \"Christ\" and Dominus (\"Lord\") through use of the abbreviation  \"AD\".\n\nHistory \n\nOrigins \n\nThe year numbering system used with Common Era notation was devised by the Christian monk Dionysius Exiguus in the year 525 to replace the Era of Martyrs system, because he did not wish to continue the memory of a tyrant who persecuted Christians. He attempted to number years from an initial reference date (\"epoch\"), an event he referred to as the Incarnation of Jesus.Doggett, L.E., (1992), [http://eclipse.gsfc.nasa.gov/SEhelp/calendars.html \"Calendars\"] in Seidelmann, P.K., The Explanatory Supplement to the Astronomical Almanac, Sausalito CA: University Science Books, 2.1 Dionysius labeled the column of the table in which he introduced the new era as \"Anni Domini Nostri Jesu Christi\".Pedersen, O., (1983), \"The Ecclesiastical Calendar and the Life of the Church\" in Coyne, G.V. et al. (Eds.) [http://articles.adsabs.harvard.edu//full/book/grc../1983//0000052.000.html The Gregorian Reform of the Calendar], Vatican Observatory, p. 52.\n\nNumbering years in this manner became more widespread in Europe with its usage by Bede in England in 731. Bede also introduced the practice of dating years before what he supposed was the year of birth of Jesus,Bede wrote of the Incarnation of Jesus, but treated it as synonymous with birth. Blackburn, B & Holford-Strevens, L, (2003), The Oxford Companion to the Year, Oxford University Press, 778. and the practice of not using a year zero. In 1422, Portugal became the last Western European country to switch to the system begun by Dionysius.\n\nVulgar Era \n\nThe term \"Common Era\" is traced back in English to its appearance as \"Vulgar Era\" to distinguish dates on the Ecclesiastic calendar from those of the regnal year, the year of reign of a sovereign, typically used in national law.\n\nThe first use of the Latin term vulgaris aerae discovered so far was in a 1615 book by Johannes Kepler. Kepler uses it again in a 1616 table of ephemerides,  and again in 1617.  * Translation of title (per 1635 English edition): New Ephemerids for the Celestiall Motions, for the Yeeres of the Vulgar Era 1617–1636 A 1635 English edition of that book has the title page in English – so far, the earliest-found usage of Vulgar Era in English.   A 1701 book edited by John LeClerc includes \"Before Christ according to the Vulgar Æra, 6\".  A 1716 book in English by Dean Humphrey Prideaux says, \"before the beginning of the vulgar æra, by which we now compute the years from his incarnation.\" Merriam Webster accepts the date of 1716, but does not give the source.  A 1796 book uses the term \"vulgar era of the nativity\". \n\nThe first so-far-discovered usage of \"Christian Era\" is as the Latin phrase aerae christianae on the title page of a 1584 theology book.  In 1649, the Latin phrase æræ Christianæ appeared in the title of an English almanac.  A 1652 ephemeris is the first instance so-far-found for English usage of \"Christian Era\". \n\nThe English phrase \"common Era\" appears at least as early as 1708,  and in a 1715 book on astronomy is used interchangeably with \"Christian Era\" and \"Vulgar Era\". Before Christ and Christian Era appear on the same page 252, while Vulgar Era appears on [https://books.google.com/books?id\nze8ehe65hwcC&pgRA2-PA250&dq\n%22Vulgar%22 page 250] A 1759 history book uses common æra in a generic sense, to refer to the common era of the Jews.  In this case, their refers to the Jews. The first-so-far found usage of the phrase \"before the common era\" is in a 1770 work that also uses common era and vulgar era as synonyms, in a translation of a book originally written in German.  The 1797 edition of the Encyclopædia Britannica uses the terms vulgar era and common era synonymously.     In 1835, in his book Living Oracles, Alexander Campbell, wrote: \"The vulgar Era, or Anno Domini; the fourth year of Jesus Christ, the first of which was but eight days\", and also refers to the common era as a synonym for vulgar era with \"the fact that our Lord was born on the 4th year before the vulgar era, called Anno Domini, thus making (for example) the 42d year from his birth to correspond with the 38th of the common era...\" The Catholic Encyclopedia (1909) in at least one article reports all three terms (Christian, Vulgar, Common Era) being commonly understood by the early 20th century.http://www.newadvent.org/cathen/03738a.htm#christian \"Foremost among these [various eras] is that which is now adopted by all civilized peoples and known as the Christian, Vulgar or Common Era, in the twentieth century of which we are now living\".\n\nThe phrase \"common era\", in lower case, also appeared in the 19th century in a generic sense, not necessarily to refer to the Christian Era, but to any system of dates in common use throughout a civilization. Thus, \"the common era of the Jews\",   \"the common era of the Mahometans\",  \"common era of the world\",  \"the common era of the foundation of Rome\".  When it did refer to the Christian Era, it was sometimes qualified, e.g., \"common era of the Incarnation\",  \"common era of the Nativity\",  or \"common era of the birth of Christ\". \n\nAn adapted translation of Common Era into pseudo-Latin as Era Vulgaris (in Latin this means Common Mistress)C.f. every good Latin dictionary, e.g., [http://www.perseus.tufts.edu/hopper/resolveform?typeexact&lookup\n&lang=la perseus.tufts.edu], [http://www.freedict.com/onldict/lat.html freedict.com], [http://en.pons.eu/translate/latin-german pons (English/German)], [http://de.pons.eu/deutsch-latein/ pons (German)] or [http://www.auxilium-online.net/wb/woerterbuch.php auxilium-online.net (German)] was adopted in the 20th century by some followers of Aleister Crowley, and thus the abbreviation \"e.v.\" or \"EV\" may sometimes be seen as a replacement for AD.\n\nHistory of the use of the CE/BCE abbreviation \n\nAlthough Jews have their own Hebrew calendar, they often use the Gregorian calendar.\n\nAs early as 1825, the abbreviation VE (for Vulgar Era) was in use among Jews to denote years in the Western calendar.[19 Sivan 5585 AM is June 5, 1825. VE is likely an abbreviation for Vulgar Era.]\n\nCommon Era notation has also been in use for Hebrew lessons for \"more than a century\". Some Jewish academics were already using the CE and BCE abbreviations by the mid-19th century, such as in 1856, when Rabbi and historian Morris Jacob Raphall used the abbreviation in his book Post-Biblical History of The Jews.Raphall, Morris Jacob (1856). Post-Biblical History of The Jews. Retrieved from https://books.google.com/books?id\nr7CbDH5hTe8C&printsecfrontcover&dq\nCE+BCE.\n\nIn the 200 years between 1808 and 2008 the ratio of usage of BCE to BC has increased by about 20% and CE to AD by about 50%, primarily since 1980.\n\nContemporary usage \n\nSome academics in the fields of theology, education and history have adopted CE and BCE notation, although there is some disagreement.See, for example, the Society for Historical Archaeology states in its more recent style guide \"Do not use C.E. (common era), B.P. (before present), or B.C.E.; convert these expressions to A.D. and B.C.\" (In section I 5 the Society explains how to use \"years B.P.\" in connection with radiocarbon ages.)  whereas the American Anthropological Association style guide takes a different approach calling for \"C.E.\" and \"B.C.E.\" \n\nMore visible uses of Common Era notation have recently surfaced at major museums in the English-speaking world. Furthermore, several style guides now prefer or mandate its usage.\nEven some style guides for Christian churches prefer its use: for example, the Episcopal Diocese Maryland Church News.\n\nIn the United States, the usage of the BCE/CE notation in textbooks is growing. Some publications have moved over to using it exclusively. For example, the 2007 World Almanac was the first edition to switch over to the BCE/CE usage, ending a 138-year usage of the traditional BC/AD dating notation. It is used by the College Board in its history tests, and by the Norton Anthology of English Literature. Others have taken a different approach. The US-based History Channel uses BCE/CE notation in articles on non-Christian religious topics such as Jerusalem and Judaism.;\n\nIn 2002, England and Wales introduced the BCE/CE notation system into the official school curriculum.\n\nIn June 2006, in the United States, the Kentucky State School Board reversed its decision to use BCE and CE in the state's new Program of Studies, leaving education of students about these concepts a matter of discretion at the local level.\n\nAlso in 2011, media reports suggested that the BC/AD notation in Australian school textbooks would be replaced by BCE/CE notation. The story became national news and drew opposition from some politicians and church leaders. Weeks after the story broke, the Australian Curriculum, Assessment and Reporting Authority denied the rumour and stated that the BC/AD notation would remain, with CE and BCE as an optional suggested learning activity.\n\nRationale \n\nSupport \n\nThe use of CE in Jewish scholarship was historically motivated by the desire to avoid the implicit \"Our Lord\" in the abbreviation AD. Although other aspects of dating systems are based in Christian origins, AD is a direct reference to Jesus as Lord.\n\nProponents of the Common Era notation assert that the use of BCE/CE shows sensitivity to those who use the same year numbering system as the one that originated with and is currently used by Christians, but who are not themselves Christian.\n\nFormer United Nations Secretary-General Kofi Annan, himself a Protestant, has argued:\n\n[T]he Christian calendar no longer belongs exclusively to Christians. People of all faiths have taken to using it simply as a matter of convenience. There is so much interaction between people of different faiths and cultures – different civilizations, if you like – that some shared way of reckoning time is a necessity. And so the Christian Era has become the Common Era.\n\nAdena K. Berkowitz, when arguing at the Supreme Court opted to use BCE and CE because \"Given the multicultural society that we live in, the traditional Jewish designations – B.C.E. and C.E. – cast a wider net of inclusion\" https://www.nytimes.com/1997/08/17/magazine/bc-ad-or-bce-ce.html|titleB.C./A.D. or B.C.E./C.E.? |author\nSafire, William |date=17 August 1997\n\nOpposition \n\nSome oppose the Common Era notation for explicitly religious reasons. Because the BC/AD notation is based on the traditional year of the conception or birth of Jesus, some Christians are offended by the removal of the reference to him in era notation. The Southern Baptist Convention supports retaining the BC/AD abbreviations.\n\nThere are also secular concerns. English language expert Kenneth G. Wilson speculated in his style guide that \"if we do end by casting aside the AD/BC convention, almost certainly some will argue that we ought to cast aside as well the conventional numbering system [that is, the method of numbering years] itself, given its Christian basis.\" The short lived French Republican Calendar, for example, began with the first year of the French First Republic and rejected the seven-day week (with its connections to the Book of Genesis) for a ten-day week.\nPriest and writer on interfaith issues Raimon Panikkar contends that using the designation BCE/CE is a \"return... to the most bigoted Christian colonialism\" towards non-Christians, who do not necessarily consider the time period following the beginning of the calendar to be a \"common era\".\n\nAccording to a Los Angeles Times report, it was a student's use of BCE/CE notation, inspired by its use within Wikipedia, which prompted the teacher and politician Andrew Schlafly to found Conservapedia, a cultural conservative wiki. One of its \"Conservapedia Commandments\" is that users must always apply BC/AD notation, since its sponsors perceive BCE/CE notation to \"deny the historical basis\" of the dating system.[http://www.conservapedia.com/Conservapedia:Commandments Conservapedia Commandments] at Conservapedia\n\nConventions in style guides \n\nThe abbreviation BCE, just as with BC, always follows the year number. Unlike AD, which traditionally precedes the year number, CE always follows the year number (if context requires that it be written at all). Thus, the current year is written as  in both notations (or, if further clarity is needed, as  CE, or as AD ), and the year that Socrates died is represented as 399 BCE (the same year that is represented by 399 BC in the BC/AD notation). The abbreviations are sometimes written with small capital letters, or with periods (e.g., \"B.C.E.\" or \"C.E.\"). Style guides for academic texts on religion generally prefer BCE/CE to BC/AD.SBL Handbook of Style Society of Biblical Literature 1999 \"8.1.2 ERAS – The preferred style is B.C.E. and C.E. (with periods). If you use A.D. and B.C., remember that A.D. precedes the date and B.C. follows it. (For the use of these abbreviations in titles, see § 7.1.3.2.)\"\n\nSimilar conventions in other languages \n\nSeveral languages other than English also have both religious and non-religious ways of identifying the era used in dates. In some communist states during the Cold War period, usage of non-religious notation was mandated.\n* In Angola, the abbreviations \"E.C.\" (\"Era Comum\", Common Era) and \"A.E.C.\" (\"Antes da Era Comum\", Before Common Era) are generally used.\n* In Arabic, بعد الميلاد (After the Birth) corresponds to CE, while قبل الميلاد (Before the Birth) corresponds to BCE. The \"Birth\" referenced is that of Jesus. This system is in widespread use in all Arab countries, but is accompanied by the Hijri system. Dates are often given in both in that order. In Saudi Arabia, however, the Hijri system is predominant.\n* In Brazil, the AD is common use, used as DC \"Depois de Cristo (After Christ)\" and BC as AC \"antes de Cristo\"\n* In the Chinese language, common era (公元, gong yuan) has been predominantly used to refer to the western calendar without any religious connotation.\n* In Czech, př.Kr. (před Kristem) and l.P. (léta Páně) were partially replaced (especially l.P., being in conflict with LP record, remaining mostly on signs and cover art, used similarly to est.) by př.n.l. and n.l., meaning před naším letopočtem and našeho letopočtu, literally \"before / of our year numbering\"). Slovak has the ending -om instead of -em and unaccented pred, allowing use of the same abbreviations. Slovak version of léta Páně is \"roku Pána\".\n* In Danish, the terms f.Kr. (før Kristus, before Christ) and e.Kr. (efter Kristus, after Christ) have traditionally been used. They are now in free variation with f.v.t. and e.v.t. (før/efter vor tidsregning, before/after our chronology).\n* In Dutch the terms v.C. or v.Chr. (voor Christus, before Christ) and n.C. or n.Chr. (na Christus, after Christ) have traditionally been used. There are alternatives v.g.j. and g.j. ([vóór] gangbare/gewone jaartelling, [before] conventional/ordinary chronology), v.o.j. and n.o.j. (vóór/na onze jaartelling, before/after our chronology) and v.d.g.j. and n.d.g.j. (vóór/na de gewone jaartelling, before/after the ordinary chronology), but there is still no generally accepted alternative for the Christian notation. The notation v.Chr./n.Chr. remains generally used by the media and scientists.\n* In Finland, the terms eKr. (ennen Kristusta, before Christ) and jKr. (jälkeen Kristuksen, after Christ) were largely used until the 1980s but have been mostly replaced during the last couple of decades with terms eaa. (ennen ajanlaskun alkua, before start of chronology) and jaa. (jälkeen ajanlaskun alun, after start of chronology).\n* In Germany, Jews in Berlin seem to have already been using \"(Before the) Common Era\" in the 18th century, while others like Moses Mendelssohn opposed this usage as it would hinder the integration of Jews into German society. The formulation seems to have persisted among German Jews in the 19th century in forms like vor der gewöhnlichen Zeitrechnung (before the common chronology).Allgemeine Zeitung des Judenthums. Ein unpartheiisches Organ für alles jüdische Interesse, II. Jahrgang, No. 60, Leipzig, 19. Mai 1838 (19 May 1838). See page 175 in [https://books.google.com/books?id\npwxFAAAAcAAJ Allgemeine Zeitung des Judenthums: Ein unpartheiisches Organ für alles jüdische Interesse in Betreff von Politik, Religion, Literatur, Geschichte, Sprachkunde und Belletristik, Volume 2] (Leipzig 1838)., Geschichte des Karäerthums von 900 bis 1575 der gewöhnlichen Zeitrechnung (Leipzig 1862–1869).\nIn 1938 Nazi Germany, the use of this convention was also prescribed by the National Socialist Teachers League.See page 149 in Weiße Blätter issue [http://www.monarchieforum.org/ARCHIV/WeisseBlaetter/MAI1938.pdf May 1938] \nHowever, it was soon discovered that many German Jews had been using the convention ever since the 18th century, and they found it ironic to see \"Aryans following Jewish example nearly 200 years later\".\nThe German Democratic Republic (1949–1990) introduced the convention of v. u. Z. (vor unserer Zeitrechnung, before our chronology) and u. Z. (unserer Zeitrechnung, of our chronology) instead of v. Chr. (vor Christus, before Christ) and n. Chr. (nach Christus/Christi Geburt, after Christ/the Nativity of Christ). The use of these terms persists in contemporary German to some extent, differing regionally and ideologically. In Jewish contexts mostly \"v. d. Z.\" (\"vor der Zeitenwende\") and \"n. d. Z.\" (\"nach der Zeitenwende\") is used.\n* In Hebrew, the most common term used to refer to BCE/CE is simply לספירה (according to the count) for CE, and לפני הספירה (before the count) for BCE. An alternative term, expressing an ideological (sometimes religious) approach aimed at distancing oneself from the source of the count, is למניינם (according to their count). The later is sometimes added after the former, especially in the case of BCE (e.g., שנת 150 לפני הספירה למנינם), due to technical linguistic reasons.\n* In Hungary, similarly to the Bulgarian case, i. e. (időszámításunk előtt, before our era) and i. sz. (időszámításunk szerint, according to our era) are still widely used instead of traditional Kr. e. (Krisztus előtt, Before Christ) and Kr. u. (Krisztus után, After Christ), which were unofficially reinstituted after the Communist period.\n* In Indonesia, the terms SM (Sebelum Masehi, before Masehi, from Arabic Masih, referring to Jesus) and M (Masehi, after Masehi) were generally used. The terms \"STU\" (\"SebelumTarikh Umum\") and \"TU\" (\"Tarikh Umum\") were used to translate \"BCE\" (\"Before Common Era\") and \"CE\" (\"Common Era\")\n* In Italy, e.v. (\"Era Volgare\" from Latin expression \"Aera Vulgaris\") and p.e.v. (\"Prima dell'Era Volgare\", before the vulgar era) may be used (both in lower case), but the historical A.C./D.C. (Avanti Cristo/Dopo Cristo, before Christ/after Christ) are much more frequent.\n* In Japanese, years reckoned by the Western calendar as opposed to the Japanese Imperial eras are indicated by, for example, , where  (seireki) literally means \"Western calendar\" which carries no religious connotation, aside from the fact that Christianity is a Western religion.  (kigenzen) is used to mean \"before the common era (BCE)\" \"AD\", and less commonly, \"CE\", are also occasionally seen, but the typical Japanese person would not care about the religious connotations.\n* In Korean, (, giwonjeon), which means \"preceding the [Western] era\", is used to indicate years BCE. (, seogi), \"Western era\", short for (, seoryeokgiwon), meaning \"[from] the origin year of the Western calendar\", is used to indicate years CE. Christians use  (juhu), meaning \"after [the birth of] the Lord\", as a shorthand calque of Anno Domini.\n* In Macedonian,  (p.n.e. – pred nasha era), meaning before our era, and  (n.e. – nasha era), meaning our era, are used the same way as BCE and CE, respectively.\n* In Poland the only term generally used is naszej ery/przed naszą erą (of our era/before our era). The terms przed Chrystusem/po Chrystusie (before Christ/after Christ) and roku Pańskiego (year of the Lord) are possible but almost never used in contemporary Poland.\n* In Serbia, the common and official terms are p.n.e. (\"pre nove ere\", Before the new era), and n.e. (\"nove ere\", new era).\n* In Romania, throughout most of the communist period, the preferred standard was to use the secularised î. e. n. (înaintea erei noastre, before our era) and e. n. (era noastră, our era). After the downfall of communism in the Romanian Revolution, the original convention using î. Hr. (înainte de Hristos, before Christ) and d. Hr. (după Hristos, after Christ) has become more widespread. Alternatively, î. Cr. and d. Cr. are used, mainly due to an alternative spelling of Hristos (Christ) as Cristos, the latter being preferred by the Roman Catholic and Protestant Churches.\n* In Russia, the terms до н.э. (до нашей эры, before our era) and н.э. (нашей эры, of our era) are often used. Their use was nearly universal during Soviet rule, and while their use in mass media is to some extent being mixed with their Christian equivalents (\"до рождества Христова\", before Christ's birth, and \"от рождества Христова\", from Christ's birth), the BCE/CE terms remain the strongly preferred version in scientific literature, business magazines and other serious texts.\n* In Spanish, Common forms used for \"BC\" are aC and a. de C. (for antes de Cristo, \"before Christ\"), with variations in punctuation and sometimes the use of J.C.(Jesucristo) instead of C. In scholarly writing, you may use AEC as the equivalent of the English \"BCE\", antes de la Era Común or Before the Common Era.\n* In Swedish the terms f.Kr. (före Kristus, before Christ) and e.Kr. (efter Kristus, after Christ) have traditionally been used. They are seldom replaced by f.v.t. and e.v.t. (före/enligt vår tidräkning, before/according to our chronology).\n* In Turkish, the terms M.Ö. (Milattan Önce, before the birth (of Jesus)) and M.S. (Milattan Sonra, after the birth (of Jesus)) are commonly used. İ.Ö. (İsa'dan Önce, before Jesus) and İ.S. (İsa'dan Sonra, after Jesus) can also be seen in academic writing.\n* In Welsh, OC can be expanded to equivalents of both AD (Oed Crist) and CE (Oes Cyffredin); for dates before the Common Era, CC (traditionally, Cyn Crist) is used exclusively, as Cyn yr Oes Cyffredin would abbreviate to a mild obscenity. Common Era. http://en.wikipedia.org/?curid=6088."
  }
}
