{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9130",
  "eid" : "ec9cfb00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778476720,
  "textBody" : "Devo (, originally) is an American rock band that formed in 1973, consisting of members from Kent and Akron, Ohio. Their classic lineup consisted of two sets of brothers, the Mothersbaughs (Mark and Bob) and the Casales (Gerald and Bob), along with Alan Myers. The band had a No. 14 Billboard chart hit in 1980 with the single \"Whip It\" and has maintained a cult following throughout its existence.\n\nDevo's music and stage shows mingle kitsch science fiction themes, deadpan surrealist humor and mordantly satirical social commentary. Their often discordant pop songs feature unusual synthetic instrumentation and time signatures that have proven influential on subsequent popular music, particularly new wave, industrial, and alternative rock artists. Devo was also a pioneer of the music video, creating many memorable clips for the LaserDisc format, with \"Whip It\" getting heavy airplay in the early days of MTV.\n\nHistory\n\nThe name Devo comes from the concept of 'de-evolution'—the idea that instead of continuing to evolve, mankind has actually begun to regress, as evidenced by the dysfunction and herd mentality of American society.\" In the late 1960s, this idea was developed as a joke by Kent State University art students Gerald Casale and Bob Lewis, who created a number of satirical art pieces in a devolution vein. At this time, Casale had also performed with the local band 15-60-75 (The Numbers Band). They met Mark Mothersbaugh around 1970, a talented keyboardist who had been playing with the band Flossy Bobbitt. Mothersbaugh brought a more humorous feel to the band, introducing them to material like the pamphlet \"Jocko Homo Heavenbound\", which includes an illustration of a winged devil labelled \"D-EVOLUTION\" and would later inspire the song \"Jocko Homo\". The \"joke\" about de-evolution became serious following the Kent State shootings of May 4, 1970. This event would be cited multiple times as the impetus for forming the band Devo. Throughout the band's career, they would often be considered as a \"joke band\" by the music press.\n\nThe first form of Devo was the \"Sextet Devo\" which performed at the 1973 Kent State performing arts festival. It included Casale, Lewis and Mothersbaugh, as well as Gerald's brother Bob Casale on guitar, and friends Rod Reisman and Fred Weber on drums and vocals, respectively. This performance was filmed and a part was included on the home video The Complete Truth About De-Evolution. This lineup performed only once. Devo returned to perform in the Student Governance Center (featured prominently in the film) at the 1974 Creative Arts Festival with a lineup including the Casale brothers, Bob Lewis, Mark Mothersbaugh, and Jim Mothersbaugh on drums.\n\nThe band continued to perform, generally as a quartet, but with a fluid lineup including Mark's brothers Bob Mothersbaugh and Jim Mothersbaugh. Bob played electric guitar, and Jim provided percussion using a set of home-made electronic drums. Their first two music videos, \"Secret Agent Man\" and \"Jocko Homo\" featured on The Truth About De-Evolution, were filmed in Akron, and Cuyahoga Falls, Ohio, the hometown of most members. This lineup of Devo lasted until 1976 when Jim left the band. Bob Lewis would sometimes play guitar during this period. In concert, Devo would often perform in the guise of theatrical characters, such as Booji Boy and the Chinaman. Live concerts from this period were often confrontational, and would remain so until 1977. A recording of an early Devo performance from 1975 with the quartet lineup appears on DEVO Live: The Mongoloid Years, ending with the promoters unplugging Devo's equipment.\n\nFollowing Jim Mothersbaugh's departure, Bob Mothersbaugh found a new drummer, Alan Myers, who played on a conventional, acoustic drum kit. Casale re-recruited his brother Bob Casale, and the lineup of Devo remained the same for nearly ten years.\n\nDevo gained some fame in 1976 when the short film The Truth About De-Evolution directed by Chuck StatlerLiner notes to Devo, \"Mongoloid\" b/w \"Jocko Homo\". Booji Boy Records, 1977, which say \"'Jocko Homo' – from the soundtrack of 'In the Beginning Was the End...(the truth about De-Evoluation)' a film by Chuck Statler.\" (emphasis added) won a prize at the Ann Arbor Film Festival. This attracted the attention of David Bowie, who began work to get the band a recording contract with Warner Music Group. In 1977, Devo were asked by Neil Young to participate in the making of his film Human Highway. Released in 1982, the film featured the band as \"Nuclear garbagemen.\" The band members were asked to write their own parts and Mark Mothersbaugh scored and recorded much of the soundtrack, his first of many.\n\nIn March 1977, Devo released their first single \"Mongoloid\" b/w \"Jocko Homo\", the B-side of which came from the soundtrack to The Truth About De-Evolution, on their independent label Booji Boy. This was followed by a cover of the Rolling Stones' \"(I Can't Get No) Satisfaction\".\n\nIn 1978, the B Stiff EP was released by British independent label Stiff, which included the single \"Be Stiff\" plus two previous Booji Boy releases. \"Mechanical Man\", a 4 track 7\" EP of demos, an apparent bootleg but rumored to be put out by the band themselves, was also released that year.\n\nRecording contract\n\nRecommendations from David Bowie and Iggy Pop enabled Devo to secure a recording contract with Warner Bros. in 1978. After Bowie backed out of the business deal due to previous commitments, their first album, Q: Are We Not Men? A: We Are Devo! was produced by Brian Eno and featured re-recordings of their previous singles \"Mongoloid\" and \"(I Can't Get No) Satisfaction\". On October 14, 1978, Devo gained national exposure with an appearance on the late-night show Saturday Night Live, a week after the Rolling Stones, performing \"(I Can't Get No) Satisfaction\" and \"Jocko Homo\".\n\nAfter the band achieved this success, co-founder Bob Lewis asked for accreditation and compensation in 1978 for his contributions to the band. The band refused to negotiate, and sued Lewis in Los Angeles County Superior Court, seeking a declaratory judgment stating that Lewis had no rights to the name or theory of de-evolution. Lewis then filed an action in the United States District Court for the Northern District of Ohio, alleging theft of intellectual property. During discovery, Lewis produced articles, promotional materials, documentary evidence and an interview recorded at the Akron Art Museum following the premiere of In the Beginning was the End in which Mothersbaugh and other band members credited Lewis with developing the theory of de-evolution. The band quickly settled for an undisclosed sum.\n\nThe band followed up with Duty Now for the Future in 1979, which moved the band more towards electronic instrumentation. While not as successful as their first album, it did produce some fan favorites with the songs \"Blockhead\" and \"The Day My Baby Gave Me a Surprize\" , as well as a cover of the Johnny Rivers hit \"Secret Agent Man\". \"Secret Agent Man\" had been recorded first in 1974 for Devo's first film and performed live as early as 1976. In 1979, Devo traveled to Japan for the first time, and a live show from this tour was partially recorded. Devo appeared on Don Kirshner's Rock Concert in 1979, performing \"Blockhead\", \"Secret Agent Man\", \"Uncontrollable Urge\", and \"Mongoloid\". Also in 1979, Rhino—in conjunction with the LA radio station KROQ-FM—released Devotees, a tribute album. It contained a set of covers of Devo songs interspersed with renditions of popular songs in Devo's style.\n\nDevo actively embraced the parody religion Church of the SubGenius. In concert, Devo sometimes performed as their own opening act, pretending to be a Christian soft rock band called \"Dove (the Band of Love)\", which is an anagram of \"Devo\". They appeared as Dove in the 1980 televangelism spoof film Pray TV. They also recorded music, later released on the album E-Z Listening Disc (1987), with Muzak-style versions of their own songs to play before their concerts.\n\nDevo gained a new level of visibility with 1980's Freedom of Choice. This album included their best-known hit, \"Whip It\", which quickly became a Top 40 hit. The album moved to an almost completely electronic sound, with the exception of acoustic drums and Bob Mothersbaugh's guitar. The tour for Freedom of Choice was ambitious for the band, including dates in Japan, the United Kingdom, France, Germany, Italy, the Netherlands, and Canada. The band used a minimalist set including large custom light boxes which could be laid on their back to form a second, smaller stage during the second half of the set. Other popular songs from Freedom of Choice were \"Girl U Want\", the title-track, and \"Gates of Steel\". The band released popular music videos for \"Whip It\" and \"Girl U Want\". Devo made two appearances on the TV show Fridays in 1980, as well as on Don Kirshner's Rock Concert, American Bandstand, and other shows. The band members often wore red, terraced Energy dome hats as part of its stage outfit. The dome was first worn during the band's Freedom of Choice campaign of 1980. It reappeared in the 1981, 1982, and 1988 tours, as well as in most of their performances since 1997.\n\nIn August 1981, the band's DEV-O Live EP spent three weeks at the top of the Australian charts. In 1982, they toured Australia and appeared on the TV show Countdown. Devo enjoyed continued popularity in Australia, where the nationally broadcast 1970s–1980s pop TV show Countdown was one of the first programs in the world to broadcast their video clips. They were given consistent radio support by Sydney-based non-commercial rock station Double Jay (2JJ) and Brisbane-based independent community station Triple Zed (4ZZZ), two of the first rock stations outside America to play their recordings. The late-night music program Nightmoves aired The Truth About De-Evolution.\n\n1980s hits\n\nIn 1981, Devo contributed a cover of \"Working in the Coal Mine\", recorded during the Freedom of Choice sessions, to the film Heavy Metal. They offered the song to be used in the film when Warner Bros. refused to include it on the album. Warner then included it as an independent bonus single accompanying their 1981 release, New Traditionalists. For this album Devo wore self-described \"Utopian Boy Scout uniforms\" topped with a \"New Traditionalist Pomp\"—a plastic half-wig modeled on the hairstyle of John F. Kennedy. Among the singles from the album was \"Through Being Cool\", written as a reaction to their new-found fame from \"Whip It\" and seen as a response to new fans who had misinterpreted the message behind the hit song. The album's accompanying tour featured the band performing an intensely physical show with treadmills and a large Greek temple set. That same year they served as Toni Basil's backing band on Word of Mouth, her debut album, which included versions of three Devo songs, recorded with Basil singing lead.\n\nOh, No! It's Devo followed in 1982. Produced by Roy Thomas Baker, the album featured a darker, more sinister sound than its predecessors. According to Gerald Casale, the album's sound was inspired by reviewers alternately describing them as both \"fascists\" and \"clowns.\" The album's tour featured the band performing seven songs in front of a 12-foot high rear-projection screen with synchronized video, an image recreated using blue screen effects in the album's accompanying music videos. Devo also contributed two songs, \"Theme from Doctor Detroit\" and \"Luv-Luv\" to the 1983 Dan Aykroyd film Doctor Detroit, and produced a music video for \"Theme from Doctor Detroit\" featuring clips from the film with live action segments.\n\nDevo released their sixth album, Shout, in 1984 to poor reviews. The album has been criticized for its overuse of the Fairlight CMI digital sampling synthesizer and weak songwriting. However, the band's cover of the Jimi Hendrix song \"Are You Experienced?\" and the accompanying music video received some praise. Following the critical and commercial failure of Shout, Warner Bros. dropped Devo. Shortly after, claiming to feel creatively unfulfilled, Alan Myers left the band, causing the remaining band members to abandon the plans for a Shout video LP, as well as a tour. In the interim, Mark Mothersbaugh began composing music for the TV show Pee-wee's Playhouse and released an elaborately packaged solo cassette, Musik for Insomniaks, which was later expanded and released as two CDs in 1988.\n\nBreak-up\n\nIn 1987, Devo re-formed with former Sparks drummer David Kendrick to replace Myers. Their first project was a soundtrack for the flop horror film Slaughterhouse Rock, starring Toni Basil. The band released the album Total Devo in 1988, on Enigma Records. This album included two songs used in the Slaughterhouse Rock soundtrack. The song \"Baby Doll\" was used that same year in the comedy film Tapeheads, with newly recorded Swedish lyrics, and was credited to (and shown in a music video by) a fictitious Swedish band called Cube-Squared. Devo followed this up with a world tour, and released the live album Now It Can Be Told: DEVO at the Palace. However, Total Devo was not a commercial success and received poor critical reviews.\n\nIn 1989, members of Devo were involved in the project Visiting Kids, releasing a self-titled EP on the New Rose label in 1990. The band featured Mark's then-wife Nancye Ferguson, as well as David Kendrick, Bob Mothersbaugh, and Bob's daughter Alex Mothersbaugh. Their record was produced by Bob Casale and Mark Mothersbaugh, and Mark also co-wrote some of the songs. Visiting Kids appeared on the soundtrack to the film Rockula, as well as on the Late Show with David Letterman. A promotional video was filmed for the song \"Trilobites\".\n\nIn 1990, Smooth Noodle Maps, Devo's last album for twenty years, was released. It too was a critical and commercial failure which, along with its two singles \"Stuck in a Loop\" and \"Post Post-Modern Man\", hold the distinction of being Devo's worst-selling efforts; all failed to appear on the U.S. charts. Devo launched a concert tour in support of the album, but poor ticket sales and the bankruptcy and dissolution of Enigma Records, who was responsible for organizing and financing the tour, caused it to be cancelled part way through. They had a falling out and played one final show in March 1991 before breaking up. In an interview with Mark Mothersbaugh from excerpts on their 1996 computer game \"Devo Presents Adventures of the Smart Patrol, \"Around '88, '89, '90 maybe, we did our last tour in Europe, and it was kind of at that point, We were watching This Is Spinal Tap on the bus and said, 'Oh my God, that's our life.' And we just said, 'Things have to change.' So we kind of agreed from there that we wouldn't do live shows anymore.\" Around this time, members of Devo appeared in the film The Spirit of '76, except for Bob Mothersbaugh. Two albums of demo recordings from 1974–1977—Hardcore Devo: Volume One (1990) and Hardcore Devo: Volume Two (1991)—were released on Rykodisc, as well as an album of early live recordings, DEVO Live: The Mongoloid Years.\n\nFollowing the split, Mark Mothersbaugh established Mutato Muzika, a commercial music production studio, along with Bob Mothersbaugh and Bob Casale. Mothersbaugh meant to further a career as a composer, and the latter worked as an audio engineer. Mothersbaugh has had considerable success writing and producing music for television programs, including Pee-wee's Playhouse and  Rugrats, video games, cartoons, and films, where he worked alongside director Wes Anderson. David Kendrick also worked at Mutato for a period during the early 1990s. Gerald Casale began a career as a director of music videos and commercials, working with bands including Rush, Soundgarden, Silverchair and the Foo Fighters. In the wake of Devo's dissolution, Bob Mothersbaugh attempted to start a solo career with The Bob I Band, recording an album that was never released. The tapes for this are now lost, though a bootleg recording of the band in concert exists and can be obtained through the bootleg aggregator Booji Boy's Basement.\n\nWhile they did not release any studio albums during this period, Devo sporadically reconvened to recorded a number of songs for various films and compilations, including a cover of the Nine Inch Nails hit \"Head Like a Hole\" for the 1992 film Police Story 3: Super Cop and a new recording of \"Girl U Want\" on the soundtrack to the 1995 film Tank Girl.\n\nReunion and hiatus\n\nIn January 1996, Devo performed a reunion concert at the Sundance Film Festival in Park City, Utah. The band performed on part of the 1996 Lollapalooza tour in the rotating Mystery Spot. On these tours and most subsequent tours, Devo performed a set-list mostly composed of material from between 1978 and 1982, ignoring their Enigma Records-era material. Also in 1996, Devo released a multimedia CD-ROM adventure game, Adventures of the Smart Patrol with Inscape. The game was not a success, but the Lollapalooza tour was received well enough to allow Devo to return in 1997 as a headliner. Devo performed sporadically from 1997 onwards. Some of their songs were used in a video game Interstate '82 developed by Activision and released in 1999 (\"Modern Life\", \"Faster and Faster\", and \"One Dumb Thing\").\n\nIn 1999, under the name \"The Wipeouters\", Devo performed the theme song to the Nickelodeon animated series Rocket Power. In 2001, the Wipeouters released an album of surf rock material, titled P'Twaaang!!!.\n\nIn 2005, Devo recorded a new version of \"Whip It\" to be used in Swiffer television commercials, a decision they have said they regretted. During an interview with the Dallas Observer, Gerald Casale said, \"It's just aesthetically offensive. It's got everything a commercial that turns people off has.\" The song \"Beautiful World\" was also used in a re-recorded form for an ad for Target stores. Due to rights issues with their back catalog, Devo has re-recorded songs for films and ads.\n\nIn 2005, Gerald Casale announced his \"solo\" project, Jihad Jerry & the Evildoers (the Evildoers themselves including the other members of Devo), and released the first EP, Army Girls Gone Wild in 2006. A full-length album, Mine Is Not a Holy War, was released on September 12, 2006, after a several-month delay. It featured mostly new material, plus re-recordings of four obscure Devo songs: \"I Need a Chick\" and \"I Been Refused\" (from Hardcore Devo: Volume Two), \"Find Out\" (which appeared on the single and EP of \"Peek-a-Boo!\" in 1982), and \"Beehive\" (which was recorded by the band in 1974, at which point it was apparently abandoned with the exception of one appearance at a special show in 2001). Devo continued to tour actively in 2005 and 2006, unveiling a new stage show at appearances in October 2006, with the Jihad Jerry character performing \"Beautiful World\" as an encore.\n\nAlso in 2006, Devo worked on a project with Disney known as Devo 2.0. A band of child performers was assembled and re-recorded Devo songs. A quote from the Akron Beacon Journal stated, \"Devo recently finished a new project in cahoots with Disney called Devo 2.0, which features the band playing old songs and two new ones with vocals provided by children. Their debut album, a two disc CD/DVD combo entitled DEV2.0, was released on March 14, 2006. The lyrics of some of the songs were changed for family-friendly airplay, which has been claimed by the band to be a play on irony of the messages of their classic hits.\"\n\n In an April 2007 interview, Gerald Casale mentioned a tentative project for a biographical film about Devo's early days. According to Casale, a script was supposedly in development, called The Beginning Was the End. Devo played their first European tour since 1990 in the summer of 2007, including a performance at Festival Internacional de Benicàssim.\n\nRevival and new work\n\nIn December 2007, Devo released their first new single since 1990, \"Watch Us Work It\", which was featured in a commercial for Dell. The song features a sample drum track from the New Traditionalists song \"The Super Thing\". Casale said that the song was chosen from a batch that the band was working on, and that it was the closest the band had been to a new album. \n\nWhen Devo performed at SXSW in March 2009 the band presented a new stage show with synchronized video backdrops (similar to the 1982 tour), new costumes, and three new songs: \"Don't Shoot, I'm a Man!\", \"What We Do\", and \"Fresh\". The album, Something for Everybody was eventually released in June 2010, preceded by a 12\" single of \"Fresh\"/\"What We Do\". \n\nOn September 16, 2009, Warner Bros. and Devo announced a re-release of Q: Are We Not Men? A: We Are Devo! and Freedom of Choice, with a tour performing both albums.\n\nDevo was awarded the first Moog Innovator Award on October 29, 2010, during Moogfest 2010 in Asheville, North Carolina. The Moog Innovator Award has been said to celebrate \"pioneering artists whose genre-defying work exemplifies the bold, innovative spirit of Bob Moog\". Devo was scheduled to perform at Moogfest, but Bob Mothersbaugh severely injured his hand three days prior, and the band was forced to cancel. Mark Mothersbaugh and Gerald Casale collaborated with Austin, Texas, band The Octopus Project to perform \"Girl U Want\" and \"Beautiful World\" at the event instead. \n\nThe band split from Warner Bros in 2012 and launched a new \"post-Warner Brothers\" website that would offer \"new protective gear\" and \"unreleased material from the archives in vinyl disc format\".\"\n\nIn August 2012, the band released a single called \"Don't Roof Rack Me, Bro (Seamus Unleashed)\", dedicated to the Republican Party presidential candidate Mitt Romney's former pet dog Seamus. The title relates to the Mitt Romney dog incident, which occurred in 1983 when Romney traveled twelve hours with the dog in a crate on his car's roof rack. Casale has also mentioned plans to release a collection of demos from the sessions of Something for Everybody, with potential titles being Devo Opens the Vault, Gems from the Devo Dumpster, or Something Else for Everybody. The album was eventually titled Something Else For Everybody and was released on May 20, 2014.\n\nThe band toured the US and Canada in June and July 2014, playing ten dates consisting of their \"experimental music\" composed and recorded from 1974–1978. Planned as a 40th anniversary tour, this outing was billed as the \"Hardcore Devo\" tour. Partial proceeds for the ten shows went to support Bob Casale's family after his sudden death. The June 28 Oakland show was filmed and turned into the concert film Hardcore Devo Live!, released on Blu-ray, DVD, and Video on Demand on February 10, 2015, along with CD and double-vinyl audios. Following the Hardcore tour, Devo performed several more tours throughout late 2014, with former Elevator Drops guitarist Josh Hager (a.k.a. Garvy J) replacing Bob Casale. \n\nAs of 2017, a documentary about Devo begun in 2009, titled Are We Not Men? and directed by Tony Pemberton, is still in post-production.\n\nDeaths\n\nAlan Myers died of stomach cancer in Los Angeles, California, on June 24, 2013. He was 58. News reports at the time of his death incorrectly cited brain cancer as the cause.\n\nBob Casale died on February 17, 2014, at 61. According to his brother Gerald, it was a \"sudden death from conditions that led to heart failure.\"\n\nRobert Mothersbaugh, Sr., father of Mark, Bob, and Jim Mothersbaugh, who portrayed General Boy in various Devo films, died on May 22, 2016, according to the Mothersbaugh family.\n\nBand members\n\nCurrent members\n*Gerald Casale – bass guitar, vocals, bass synthesizer (1973–1991, 1996–present)\n*Mark Mothersbaugh – vocals, keyboards, guitar (1973–1991, 1996–present)\n*Bob Mothersbaugh – guitar, vocals (1974–1991, 1996–present)\n*Josh Freese – drums (1996–present)\n*Josh Hager – guitar, keyboards  (2014–present)\n\nFormer members\n*Bob Casale – guitar, keyboards, backing vocals (1973–1974, 1976–1991, 1996–2014; his death)\n*Bob Lewis – guitar (1973–1976)\n*Rod Reisman – drums (1973)\n*Fred Weber – vocals (1973)\n*Jim Mothersbaugh – electronic percussion (1974–1976)\n*Alan Myers – drums (1976–1986; died 2013)\n*David Kendrick – drums (1987–1991, 1996–2004)[A]\n*Jeff Friedl – drums (2008–14)[B]\n\nCurrent and former touring musicians\n*Neil Taylor – drums (2008)\n*Pete Parada – drums (2011)\n*Brian Applegate – keyboards, bass guitar (2014 Hardcore Tour)\n*Alex Casale – bass guitar (2014 Hardcore Tour)\n*Ed Marshall – bass guitar (2014 Hardcore Tour)\n\nTimeline\n\nImageSize = width:1000 height:auto barincrement:20\nPlotArea = left:130 bottom:140 top:10 right:20\nAlignbars = justify\nDateFormat = mm/dd/yyyy\nPeriod = from:01/01/1973 till:01/01/2018\nTimeAxis = orientation:horizontal format:yyyy\nLegend = orientation:vertical position:bottom columns:2\nScaleMajor = increment:2 start:1973\nScaleMinor = increment:1 start:1974\n\nColors =\n id:vocals value:red    legend:Vocals\n id:guitar value:green  legend:Guitar\n id:bass   value:blue   legend:Bass\n id:keys   value:purple legend:Keyboards\n id:drums  value:orange legend:Drums\n id:perc   value:claret legend:Electronic_percussion\n id:touring  value:yellow  legend:Tour_guest\n id:ccgb   value:pink   legend:General_Boy\n id:lines  value:black  legend:Studio_albums\n\nLineData =\n at:08/28/1978 color:black layer:back\n at:07/02/1979 color:black layer:back\n at:05/16/1980 color:black layer:back\n at:08/26/1981 color:black layer:back\n at:10/21/1982 color:black layer:back\n at:10/09/1984 color:black layer:back\n at:05/01/1988 color:black layer:back\n at:06/01/1990 color:black layer:back\n at:06/15/2010 color:black layer:back\n\nBarData =\n bar:Weber         text:\"Fred Weber\"\n bar:Lewis         text:\"Bob Lewis\"\n bar:Bcasale       text:\"Bob Casale\"\n bar:Bmothersbaugh text:\"Bob Mothersbaugh Jr.\"\n bar:Hager         text:\"Josh Hager\"\n bar:Gcasale       text:\"Gerald Casale\"\n bar:Mmothersbaugh text:\"Mark Mothersbaugh\"\n bar:Reisman       text:\"Rod Reisman\"\n bar:Jmothersbaugh text:\"Jim Mothersbaugh\"\n bar:Myers         text:\"Alan Myers\"\n bar:Kendrick      text:\"David Kendrick\" \n bar:Freese        text:\"Josh Freese\"\n bar:Friedl        text:\"Jeff Friedl\"\n bar:Rmothersbaugh text:\"Bob Mothersbaugh Sr.\"\n\nPlotData=\n width:11 textcolor:black align:left anchor:from shift:(11,-4)\n bar:Weber         from:01/04/1973 till:06/01/1974 color:vocals\n bar:Lewis         from:01/04/1973 till:06/01/1976 color:guitar\n bar:Bcasale       from:01/01/1973 till:06/01/1974 color:guitar\n bar:Bcasale       from:06/01/1976 till:02/01/1991 color:guitar\n bar:Bcasale       from:01/01/1996 till:02/17/2014 color:guitar\n bar:Bcasale       from:01/01/1973 till:06/01/1974 color:keys width:3\n bar:Bcasale       from:06/01/1976 till:02/01/1991 color:keys width:3\n bar:Bcasale       from:01/01/1996 till:02/17/2014 color:keys width:3\n bar:Bmothersbaugh from:06/01/1974 till:02/01/1991 color:guitar\n bar:Bmothersbaugh from:01/01/1996 till:end        color:guitar\n bar:Bmothersbaugh from:06/01/1974 till:02/01/1991 color:vocals width:3\n bar:Bmothersbaugh from:01/01/1996 till:end        color:vocals width:3\n bar:Hager         from:08/01/2014 till:end        color:guitar\n bar:Hager         from:08/01/2014 till:end        color:keys width:3\n bar:Mmothersbaugh from:01/01/1973 till:02/01/1991 color:keys\n bar:Mmothersbaugh from:01/01/1996 till:end        color:keys\n bar:Mmothersbaugh from:01/01/1973 till:02/01/1991 color:guitar width:7\n bar:Mmothersbaugh from:01/01/1996 till:end        color:guitar width:7\n bar:Mmothersbaugh from:01/01/1973 till:02/01/1991 color:vocals width:3\n bar:Mmothersbaugh from:01/01/1996 till:end        color:vocals width:3\n bar:Gcasale       from:01/01/1973 till:02/01/1991 color:bass\n bar:Gcasale       from:01/01/1973 till:02/01/1991 color:keys width:7\n bar:Gcasale       from:01/01/1973 till:02/01/1991 color:vocals width:3\n bar:Gcasale       from:01/01/1996 till:end        color:bass\n bar:Gcasale       from:01/01/1996 till:end        color:keys width:7\n bar:Gcasale       from:01/01/1996 till:end        color:vocals width:3\n bar:Reisman       from:01/01/1973 till:06/01/1974 color:drums\n bar:Jmothersbaugh from:06/01/1974 till:06/01/1976 color:perc\n bar:Myers         from:06/01/1976 till:01/01/1986 color:drums\n bar:Myers         from:05/01/1982 till:01/01/1986 color:perc width:3\n bar:Kendrick      from:01/01/1987 till:02/01/1991 color:drums\n bar:Kendrick      from:01/01/1996 till:07/22/2004 color:drums\n bar:Friedl        from:01/01/2008 till:01/01/2015 color:drums\n bar:Friedl        from:01/01/2008 till:01/01/2015 color:touring width:3\n bar:Freese        from:01/01/1996 till:end color:drums\n bar:Freese        from:01/01/1996 till:07/22/2004 color:touring width:3\n bar:Rmothersbaugh from:01/01/1973 till:02/01/1991 color:ccgb\n bar:Rmothersbaugh from:01/01/1996 till:05/22/2016 color:ccgb\n\nNotes\n\n*A^ David Kendrick performed with Devo at several 2002–2004 shows (including their tour of Japan (commemorated on the \"Devo – Live in the Land of the Rising Sun\" DVD) as well as the 2004 Nike Run Hit Wonder) due to the unavailability of Josh Freese. In addition, Kendrick also continued to play drums on all Devo studio tracks in the late 1990s and early 2000s. This would include \"It's All Good\", \"Are You Ready\", and \"Go Monkey Go\".\n*B^ Ashes Divide drummer Jeff Friedl (formerly of Eagles of Death Metal and Puscifer) performed with Devo on June 5, 2010, at the KROQ Weenie Roast in Los Angeles, and accompanied Devo on other selected dates between 2008 and 2013 due to Freese performing with Weezer. Friedl returned for several performances in late 2014 following the \"Hardcore Devo\" tour for similar reasons, and also played drums on a few tracks from the 2013 compilation album Something Else for Everybody.\n\nDiscography\n\nStudio albums\n\n* Q: Are We Not Men? A: We Are Devo! (1978)\n* Duty Now for the Future (1979)\n* Freedom of Choice (1980)\n* New Traditionalists (1981)\n* Oh, No! It's Devo (1982)\n* Shout (1984)\n* Total Devo (1988)\n* Smooth Noodle Maps (1990)\n* Something for Everybody (2010)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Devo" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9130" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Devo (, originally) is an American rock band that formed in 1973, consisting of members from Kent and Akron, Ohio. Their classic lineup consisted of two sets of brothers, the Mothersbaughs (Mark and Bob) and the Casales (Gerald and Bob), along with Alan Myers. The band had a No. 14 Billboard chart hit in 1980 with the single \"Whip It\" and has maintained a cult following throughout its existence.\n\nDevo's music and stage shows mingle kitsch science fiction themes, deadpan surrealist humor and mordantly satirical social commentary. Their often discordant pop songs feature unusual synthetic instrumentation and time signatures that have proven influential on subsequent popular music, particularly new wave, industrial, and alternative rock artists. Devo was also a pioneer of the music video, creating many memorable clips for the LaserDisc format, with \"Whip It\" getting heavy airplay in the early days of MTV.\n\nHistory\n\nThe name Devo comes from the concept of 'de-evolution'—the idea that instead of continuing to evolve, mankind has actually begun to regress, as evidenced by the dysfunction and herd mentality of American society.\" In the late 1960s, this idea was developed as a joke by Kent State University art students Gerald Casale and Bob Lewis, who created a number of satirical art pieces in a devolution vein. At this time, Casale had also performed with the local band 15-60-75 (The Numbers Band). They met Mark Mothersbaugh around 1970, a talented keyboardist who had been playing with the band Flossy Bobbitt. Mothersbaugh brought a more humorous feel to the band, introducing them to material like the pamphlet \"Jocko Homo Heavenbound\", which includes an illustration of a winged devil labelled \"D-EVOLUTION\" and would later inspire the song \"Jocko Homo\". The \"joke\" about de-evolution became serious following the Kent State shootings of May 4, 1970. This event would be cited multiple times as the impetus for forming the band Devo. Throughout the band's career, they would often be considered as a \"joke band\" by the music press.\n\nThe first form of Devo was the \"Sextet Devo\" which performed at the 1973 Kent State performing arts festival. It included Casale, Lewis and Mothersbaugh, as well as Gerald's brother Bob Casale on guitar, and friends Rod Reisman and Fred Weber on drums and vocals, respectively. This performance was filmed and a part was included on the home video The Complete Truth About De-Evolution. This lineup performed only once. Devo returned to perform in the Student Governance Center (featured prominently in the film) at the 1974 Creative Arts Festival with a lineup including the Casale brothers, Bob Lewis, Mark Mothersbaugh, and Jim Mothersbaugh on drums.\n\nThe band continued to perform, generally as a quartet, but with a fluid lineup including Mark's brothers Bob Mothersbaugh and Jim Mothersbaugh. Bob played electric guitar, and Jim provided percussion using a set of home-made electronic drums. Their first two music videos, \"Secret Agent Man\" and \"Jocko Homo\" featured on The Truth About De-Evolution, were filmed in Akron, and Cuyahoga Falls, Ohio, the hometown of most members. This lineup of Devo lasted until 1976 when Jim left the band. Bob Lewis would sometimes play guitar during this period. In concert, Devo would often perform in the guise of theatrical characters, such as Booji Boy and the Chinaman. Live concerts from this period were often confrontational, and would remain so until 1977. A recording of an early Devo performance from 1975 with the quartet lineup appears on DEVO Live: The Mongoloid Years, ending with the promoters unplugging Devo's equipment.\n\nFollowing Jim Mothersbaugh's departure, Bob Mothersbaugh found a new drummer, Alan Myers, who played on a conventional, acoustic drum kit. Casale re-recruited his brother Bob Casale, and the lineup of Devo remained the same for nearly ten years.\n\nDevo gained some fame in 1976 when the short film The Truth About De-Evolution directed by Chuck StatlerLiner notes to Devo, \"Mongoloid\" b/w \"Jocko Homo\". Booji Boy Records, 1977, which say \"'Jocko Homo' – from the soundtrack of 'In the Beginning Was the End...(the truth about De-Evoluation)' a film by Chuck Statler.\" (emphasis added) won a prize at the Ann Arbor Film Festival. This attracted the attention of David Bowie, who began work to get the band a recording contract with Warner Music Group. In 1977, Devo were asked by Neil Young to participate in the making of his film Human Highway. Released in 1982, the film featured the band as \"Nuclear garbagemen.\" The band members were asked to write their own parts and Mark Mothersbaugh scored and recorded much of the soundtrack, his first of many.\n\nIn March 1977, Devo released their first single \"Mongoloid\" b/w \"Jocko Homo\", the B-side of which came from the soundtrack to The Truth About De-Evolution, on their independent label Booji Boy. This was followed by a cover of the Rolling Stones' \"(I Can't Get No) Satisfaction\".\n\nIn 1978, the B Stiff EP was released by British independent label Stiff, which included the single \"Be Stiff\" plus two previous Booji Boy releases. \"Mechanical Man\", a 4 track 7\" EP of demos, an apparent bootleg but rumored to be put out by the band themselves, was also released that year.\n\nRecording contract\n\nRecommendations from David Bowie and Iggy Pop enabled Devo to secure a recording contract with Warner Bros. in 1978. After Bowie backed out of the business deal due to previous commitments, their first album, Q: Are We Not Men? A: We Are Devo! was produced by Brian Eno and featured re-recordings of their previous singles \"Mongoloid\" and \"(I Can't Get No) Satisfaction\". On October 14, 1978, Devo gained national exposure with an appearance on the late-night show Saturday Night Live, a week after the Rolling Stones, performing \"(I Can't Get No) Satisfaction\" and \"Jocko Homo\".\n\nAfter the band achieved this success, co-founder Bob Lewis asked for accreditation and compensation in 1978 for his contributions to the band. The band refused to negotiate, and sued Lewis in Los Angeles County Superior Court, seeking a declaratory judgment stating that Lewis had no rights to the name or theory of de-evolution. Lewis then filed an action in the United States District Court for the Northern District of Ohio, alleging theft of intellectual property. During discovery, Lewis produced articles, promotional materials, documentary evidence and an interview recorded at the Akron Art Museum following the premiere of In the Beginning was the End in which Mothersbaugh and other band members credited Lewis with developing the theory of de-evolution. The band quickly settled for an undisclosed sum.\n\nThe band followed up with Duty Now for the Future in 1979, which moved the band more towards electronic instrumentation. While not as successful as their first album, it did produce some fan favorites with the songs \"Blockhead\" and \"The Day My Baby Gave Me a Surprize\" , as well as a cover of the Johnny Rivers hit \"Secret Agent Man\". \"Secret Agent Man\" had been recorded first in 1974 for Devo's first film and performed live as early as 1976. In 1979, Devo traveled to Japan for the first time, and a live show from this tour was partially recorded. Devo appeared on Don Kirshner's Rock Concert in 1979, performing \"Blockhead\", \"Secret Agent Man\", \"Uncontrollable Urge\", and \"Mongoloid\". Also in 1979, Rhino—in conjunction with the LA radio station KROQ-FM—released Devotees, a tribute album. It contained a set of covers of Devo songs interspersed with renditions of popular songs in Devo's style.\n\nDevo actively embraced the parody religion Church of the SubGenius. In concert, Devo sometimes performed as their own opening act, pretending to be a Christian soft rock band called \"Dove (the Band of Love)\", which is an anagram of \"Devo\". They appeared as Dove in the 1980 televangelism spoof film Pray TV. They also recorded music, later released on the album E-Z Listening Disc (1987), with Muzak-style versions of their own songs to play before their concerts.\n\nDevo gained a new level of visibility with 1980's Freedom of Choice. This album included their best-known hit, \"Whip It\", which quickly became a Top 40 hit. The album moved to an almost completely electronic sound, with the exception of acoustic drums and Bob Mothersbaugh's guitar. The tour for Freedom of Choice was ambitious for the band, including dates in Japan, the United Kingdom, France, Germany, Italy, the Netherlands, and Canada. The band used a minimalist set including large custom light boxes which could be laid on their back to form a second, smaller stage during the second half of the set. Other popular songs from Freedom of Choice were \"Girl U Want\", the title-track, and \"Gates of Steel\". The band released popular music videos for \"Whip It\" and \"Girl U Want\". Devo made two appearances on the TV show Fridays in 1980, as well as on Don Kirshner's Rock Concert, American Bandstand, and other shows. The band members often wore red, terraced Energy dome hats as part of its stage outfit. The dome was first worn during the band's Freedom of Choice campaign of 1980. It reappeared in the 1981, 1982, and 1988 tours, as well as in most of their performances since 1997.\n\nIn August 1981, the band's DEV-O Live EP spent three weeks at the top of the Australian charts. In 1982, they toured Australia and appeared on the TV show Countdown. Devo enjoyed continued popularity in Australia, where the nationally broadcast 1970s–1980s pop TV show Countdown was one of the first programs in the world to broadcast their video clips. They were given consistent radio support by Sydney-based non-commercial rock station Double Jay (2JJ) and Brisbane-based independent community station Triple Zed (4ZZZ), two of the first rock stations outside America to play their recordings. The late-night music program Nightmoves aired The Truth About De-Evolution.\n\n1980s hits\n\nIn 1981, Devo contributed a cover of \"Working in the Coal Mine\", recorded during the Freedom of Choice sessions, to the film Heavy Metal. They offered the song to be used in the film when Warner Bros. refused to include it on the album. Warner then included it as an independent bonus single accompanying their 1981 release, New Traditionalists. For this album Devo wore self-described \"Utopian Boy Scout uniforms\" topped with a \"New Traditionalist Pomp\"—a plastic half-wig modeled on the hairstyle of John F. Kennedy. Among the singles from the album was \"Through Being Cool\", written as a reaction to their new-found fame from \"Whip It\" and seen as a response to new fans who had misinterpreted the message behind the hit song. The album's accompanying tour featured the band performing an intensely physical show with treadmills and a large Greek temple set. That same year they served as Toni Basil's backing band on Word of Mouth, her debut album, which included versions of three Devo songs, recorded with Basil singing lead.\n\nOh, No! It's Devo followed in 1982. Produced by Roy Thomas Baker, the album featured a darker, more sinister sound than its predecessors. According to Gerald Casale, the album's sound was inspired by reviewers alternately describing them as both \"fascists\" and \"clowns.\" The album's tour featured the band performing seven songs in front of a 12-foot high rear-projection screen with synchronized video, an image recreated using blue screen effects in the album's accompanying music videos. Devo also contributed two songs, \"Theme from Doctor Detroit\" and \"Luv-Luv\" to the 1983 Dan Aykroyd film Doctor Detroit, and produced a music video for \"Theme from Doctor Detroit\" featuring clips from the film with live action segments.\n\nDevo released their sixth album, Shout, in 1984 to poor reviews. The album has been criticized for its overuse of the Fairlight CMI digital sampling synthesizer and weak songwriting. However, the band's cover of the Jimi Hendrix song \"Are You Experienced?\" and the accompanying music video received some praise. Following the critical and commercial failure of Shout, Warner Bros. dropped Devo. Shortly after, claiming to feel creatively unfulfilled, Alan Myers left the band, causing the remaining band members to abandon the plans for a Shout video LP, as well as a tour. In the interim, Mark Mothersbaugh began composing music for the TV show Pee-wee's Playhouse and released an elaborately packaged solo cassette, Musik for Insomniaks, which was later expanded and released as two CDs in 1988.\n\nBreak-up\n\nIn 1987, Devo re-formed with former Sparks drummer David Kendrick to replace Myers. Their first project was a soundtrack for the flop horror film Slaughterhouse Rock, starring Toni Basil. The band released the album Total Devo in 1988, on Enigma Records. This album included two songs used in the Slaughterhouse Rock soundtrack. The song \"Baby Doll\" was used that same year in the comedy film Tapeheads, with newly recorded Swedish lyrics, and was credited to (and shown in a music video by) a fictitious Swedish band called Cube-Squared. Devo followed this up with a world tour, and released the live album Now It Can Be Told: DEVO at the Palace. However, Total Devo was not a commercial success and received poor critical reviews.\n\nIn 1989, members of Devo were involved in the project Visiting Kids, releasing a self-titled EP on the New Rose label in 1990. The band featured Mark's then-wife Nancye Ferguson, as well as David Kendrick, Bob Mothersbaugh, and Bob's daughter Alex Mothersbaugh. Their record was produced by Bob Casale and Mark Mothersbaugh, and Mark also co-wrote some of the songs. Visiting Kids appeared on the soundtrack to the film Rockula, as well as on the Late Show with David Letterman. A promotional video was filmed for the song \"Trilobites\".\n\nIn 1990, Smooth Noodle Maps, Devo's last album for twenty years, was released. It too was a critical and commercial failure which, along with its two singles \"Stuck in a Loop\" and \"Post Post-Modern Man\", hold the distinction of being Devo's worst-selling efforts; all failed to appear on the U.S. charts. Devo launched a concert tour in support of the album, but poor ticket sales and the bankruptcy and dissolution of Enigma Records, who was responsible for organizing and financing the tour, caused it to be cancelled part way through. They had a falling out and played one final show in March 1991 before breaking up. In an interview with Mark Mothersbaugh from excerpts on their 1996 computer game \"Devo Presents Adventures of the Smart Patrol, \"Around '88, '89, '90 maybe, we did our last tour in Europe, and it was kind of at that point, We were watching This Is Spinal Tap on the bus and said, 'Oh my God, that's our life.' And we just said, 'Things have to change.' So we kind of agreed from there that we wouldn't do live shows anymore.\" Around this time, members of Devo appeared in the film The Spirit of '76, except for Bob Mothersbaugh. Two albums of demo recordings from 1974–1977—Hardcore Devo: Volume One (1990) and Hardcore Devo: Volume Two (1991)—were released on Rykodisc, as well as an album of early live recordings, DEVO Live: The Mongoloid Years.\n\nFollowing the split, Mark Mothersbaugh established Mutato Muzika, a commercial music production studio, along with Bob Mothersbaugh and Bob Casale. Mothersbaugh meant to further a career as a composer, and the latter worked as an audio engineer. Mothersbaugh has had considerable success writing and producing music for television programs, including Pee-wee's Playhouse and  Rugrats, video games, cartoons, and films, where he worked alongside director Wes Anderson. David Kendrick also worked at Mutato for a period during the early 1990s. Gerald Casale began a career as a director of music videos and commercials, working with bands including Rush, Soundgarden, Silverchair and the Foo Fighters. In the wake of Devo's dissolution, Bob Mothersbaugh attempted to start a solo career with The Bob I Band, recording an album that was never released. The tapes for this are now lost, though a bootleg recording of the band in concert exists and can be obtained through the bootleg aggregator Booji Boy's Basement.\n\nWhile they did not release any studio albums during this period, Devo sporadically reconvened to recorded a number of songs for various films and compilations, including a cover of the Nine Inch Nails hit \"Head Like a Hole\" for the 1992 film Police Story 3: Super Cop and a new recording of \"Girl U Want\" on the soundtrack to the 1995 film Tank Girl.\n\nReunion and hiatus\n\nIn January 1996, Devo performed a reunion concert at the Sundance Film Festival in Park City, Utah. The band performed on part of the 1996 Lollapalooza tour in the rotating Mystery Spot. On these tours and most subsequent tours, Devo performed a set-list mostly composed of material from between 1978 and 1982, ignoring their Enigma Records-era material. Also in 1996, Devo released a multimedia CD-ROM adventure game, Adventures of the Smart Patrol with Inscape. The game was not a success, but the Lollapalooza tour was received well enough to allow Devo to return in 1997 as a headliner. Devo performed sporadically from 1997 onwards. Some of their songs were used in a video game Interstate '82 developed by Activision and released in 1999 (\"Modern Life\", \"Faster and Faster\", and \"One Dumb Thing\").\n\nIn 1999, under the name \"The Wipeouters\", Devo performed the theme song to the Nickelodeon animated series Rocket Power. In 2001, the Wipeouters released an album of surf rock material, titled P'Twaaang!!!.\n\nIn 2005, Devo recorded a new version of \"Whip It\" to be used in Swiffer television commercials, a decision they have said they regretted. During an interview with the Dallas Observer, Gerald Casale said, \"It's just aesthetically offensive. It's got everything a commercial that turns people off has.\" The song \"Beautiful World\" was also used in a re-recorded form for an ad for Target stores. Due to rights issues with their back catalog, Devo has re-recorded songs for films and ads.\n\nIn 2005, Gerald Casale announced his \"solo\" project, Jihad Jerry & the Evildoers (the Evildoers themselves including the other members of Devo), and released the first EP, Army Girls Gone Wild in 2006. A full-length album, Mine Is Not a Holy War, was released on September 12, 2006, after a several-month delay. It featured mostly new material, plus re-recordings of four obscure Devo songs: \"I Need a Chick\" and \"I Been Refused\" (from Hardcore Devo: Volume Two), \"Find Out\" (which appeared on the single and EP of \"Peek-a-Boo!\" in 1982), and \"Beehive\" (which was recorded by the band in 1974, at which point it was apparently abandoned with the exception of one appearance at a special show in 2001). Devo continued to tour actively in 2005 and 2006, unveiling a new stage show at appearances in October 2006, with the Jihad Jerry character performing \"Beautiful World\" as an encore.\n\nAlso in 2006, Devo worked on a project with Disney known as Devo 2.0. A band of child performers was assembled and re-recorded Devo songs. A quote from the Akron Beacon Journal stated, \"Devo recently finished a new project in cahoots with Disney called Devo 2.0, which features the band playing old songs and two new ones with vocals provided by children. Their debut album, a two disc CD/DVD combo entitled DEV2.0, was released on March 14, 2006. The lyrics of some of the songs were changed for family-friendly airplay, which has been claimed by the band to be a play on irony of the messages of their classic hits.\"\n\n In an April 2007 interview, Gerald Casale mentioned a tentative project for a biographical film about Devo's early days. According to Casale, a script was supposedly in development, called The Beginning Was the End. Devo played their first European tour since 1990 in the summer of 2007, including a performance at Festival Internacional de Benicàssim.\n\nRevival and new work\n\nIn December 2007, Devo released their first new single since 1990, \"Watch Us Work It\", which was featured in a commercial for Dell. The song features a sample drum track from the New Traditionalists song \"The Super Thing\". Casale said that the song was chosen from a batch that the band was working on, and that it was the closest the band had been to a new album. \n\nWhen Devo performed at SXSW in March 2009 the band presented a new stage show with synchronized video backdrops (similar to the 1982 tour), new costumes, and three new songs: \"Don't Shoot, I'm a Man!\", \"What We Do\", and \"Fresh\". The album, Something for Everybody was eventually released in June 2010, preceded by a 12\" single of \"Fresh\"/\"What We Do\". \n\nOn September 16, 2009, Warner Bros. and Devo announced a re-release of Q: Are We Not Men? A: We Are Devo! and Freedom of Choice, with a tour performing both albums.\n\nDevo was awarded the first Moog Innovator Award on October 29, 2010, during Moogfest 2010 in Asheville, North Carolina. The Moog Innovator Award has been said to celebrate \"pioneering artists whose genre-defying work exemplifies the bold, innovative spirit of Bob Moog\". Devo was scheduled to perform at Moogfest, but Bob Mothersbaugh severely injured his hand three days prior, and the band was forced to cancel. Mark Mothersbaugh and Gerald Casale collaborated with Austin, Texas, band The Octopus Project to perform \"Girl U Want\" and \"Beautiful World\" at the event instead. \n\nThe band split from Warner Bros in 2012 and launched a new \"post-Warner Brothers\" website that would offer \"new protective gear\" and \"unreleased material from the archives in vinyl disc format\".\"\n\nIn August 2012, the band released a single called \"Don't Roof Rack Me, Bro (Seamus Unleashed)\", dedicated to the Republican Party presidential candidate Mitt Romney's former pet dog Seamus. The title relates to the Mitt Romney dog incident, which occurred in 1983 when Romney traveled twelve hours with the dog in a crate on his car's roof rack. Casale has also mentioned plans to release a collection of demos from the sessions of Something for Everybody, with potential titles being Devo Opens the Vault, Gems from the Devo Dumpster, or Something Else for Everybody. The album was eventually titled Something Else For Everybody and was released on May 20, 2014.\n\nThe band toured the US and Canada in June and July 2014, playing ten dates consisting of their \"experimental music\" composed and recorded from 1974–1978. Planned as a 40th anniversary tour, this outing was billed as the \"Hardcore Devo\" tour. Partial proceeds for the ten shows went to support Bob Casale's family after his sudden death. The June 28 Oakland show was filmed and turned into the concert film Hardcore Devo Live!, released on Blu-ray, DVD, and Video on Demand on February 10, 2015, along with CD and double-vinyl audios. Following the Hardcore tour, Devo performed several more tours throughout late 2014, with former Elevator Drops guitarist Josh Hager (a.k.a. Garvy J) replacing Bob Casale. \n\nAs of 2017, a documentary about Devo begun in 2009, titled Are We Not Men? and directed by Tony Pemberton, is still in post-production.\n\nDeaths\n\nAlan Myers died of stomach cancer in Los Angeles, California, on June 24, 2013. He was 58. News reports at the time of his death incorrectly cited brain cancer as the cause.\n\nBob Casale died on February 17, 2014, at 61. According to his brother Gerald, it was a \"sudden death from conditions that led to heart failure.\"\n\nRobert Mothersbaugh, Sr., father of Mark, Bob, and Jim Mothersbaugh, who portrayed General Boy in various Devo films, died on May 22, 2016, according to the Mothersbaugh family.\n\nBand members\n\nCurrent members\n*Gerald Casale – bass guitar, vocals, bass synthesizer (1973–1991, 1996–present)\n*Mark Mothersbaugh – vocals, keyboards, guitar (1973–1991, 1996–present)\n*Bob Mothersbaugh – guitar, vocals (1974–1991, 1996–present)\n*Josh Freese – drums (1996–present)\n*Josh Hager – guitar, keyboards  (2014–present)\n\nFormer members\n*Bob Casale – guitar, keyboards, backing vocals (1973–1974, 1976–1991, 1996–2014; his death)\n*Bob Lewis – guitar (1973–1976)\n*Rod Reisman – drums (1973)\n*Fred Weber – vocals (1973)\n*Jim Mothersbaugh – electronic percussion (1974–1976)\n*Alan Myers – drums (1976–1986; died 2013)\n*David Kendrick – drums (1987–1991, 1996–2004)[A]\n*Jeff Friedl – drums (2008–14)[B]\n\nCurrent and former touring musicians\n*Neil Taylor – drums (2008)\n*Pete Parada – drums (2011)\n*Brian Applegate – keyboards, bass guitar (2014 Hardcore Tour)\n*Alex Casale – bass guitar (2014 Hardcore Tour)\n*Ed Marshall – bass guitar (2014 Hardcore Tour)\n\nTimeline\n\nImageSize = width:1000 height:auto barincrement:20\nPlotArea = left:130 bottom:140 top:10 right:20\nAlignbars = justify\nDateFormat = mm/dd/yyyy\nPeriod = from:01/01/1973 till:01/01/2018\nTimeAxis = orientation:horizontal format:yyyy\nLegend = orientation:vertical position:bottom columns:2\nScaleMajor = increment:2 start:1973\nScaleMinor = increment:1 start:1974\n\nColors =\n id:vocals value:red    legend:Vocals\n id:guitar value:green  legend:Guitar\n id:bass   value:blue   legend:Bass\n id:keys   value:purple legend:Keyboards\n id:drums  value:orange legend:Drums\n id:perc   value:claret legend:Electronic_percussion\n id:touring  value:yellow  legend:Tour_guest\n id:ccgb   value:pink   legend:General_Boy\n id:lines  value:black  legend:Studio_albums\n\nLineData =\n at:08/28/1978 color:black layer:back\n at:07/02/1979 color:black layer:back\n at:05/16/1980 color:black layer:back\n at:08/26/1981 color:black layer:back\n at:10/21/1982 color:black layer:back\n at:10/09/1984 color:black layer:back\n at:05/01/1988 color:black layer:back\n at:06/01/1990 color:black layer:back\n at:06/15/2010 color:black layer:back\n\nBarData =\n bar:Weber         text:\"Fred Weber\"\n bar:Lewis         text:\"Bob Lewis\"\n bar:Bcasale       text:\"Bob Casale\"\n bar:Bmothersbaugh text:\"Bob Mothersbaugh Jr.\"\n bar:Hager         text:\"Josh Hager\"\n bar:Gcasale       text:\"Gerald Casale\"\n bar:Mmothersbaugh text:\"Mark Mothersbaugh\"\n bar:Reisman       text:\"Rod Reisman\"\n bar:Jmothersbaugh text:\"Jim Mothersbaugh\"\n bar:Myers         text:\"Alan Myers\"\n bar:Kendrick      text:\"David Kendrick\" \n bar:Freese        text:\"Josh Freese\"\n bar:Friedl        text:\"Jeff Friedl\"\n bar:Rmothersbaugh text:\"Bob Mothersbaugh Sr.\"\n\nPlotData=\n width:11 textcolor:black align:left anchor:from shift:(11,-4)\n bar:Weber         from:01/04/1973 till:06/01/1974 color:vocals\n bar:Lewis         from:01/04/1973 till:06/01/1976 color:guitar\n bar:Bcasale       from:01/01/1973 till:06/01/1974 color:guitar\n bar:Bcasale       from:06/01/1976 till:02/01/1991 color:guitar\n bar:Bcasale       from:01/01/1996 till:02/17/2014 color:guitar\n bar:Bcasale       from:01/01/1973 till:06/01/1974 color:keys width:3\n bar:Bcasale       from:06/01/1976 till:02/01/1991 color:keys width:3\n bar:Bcasale       from:01/01/1996 till:02/17/2014 color:keys width:3\n bar:Bmothersbaugh from:06/01/1974 till:02/01/1991 color:guitar\n bar:Bmothersbaugh from:01/01/1996 till:end        color:guitar\n bar:Bmothersbaugh from:06/01/1974 till:02/01/1991 color:vocals width:3\n bar:Bmothersbaugh from:01/01/1996 till:end        color:vocals width:3\n bar:Hager         from:08/01/2014 till:end        color:guitar\n bar:Hager         from:08/01/2014 till:end        color:keys width:3\n bar:Mmothersbaugh from:01/01/1973 till:02/01/1991 color:keys\n bar:Mmothersbaugh from:01/01/1996 till:end        color:keys\n bar:Mmothersbaugh from:01/01/1973 till:02/01/1991 color:guitar width:7\n bar:Mmothersbaugh from:01/01/1996 till:end        color:guitar width:7\n bar:Mmothersbaugh from:01/01/1973 till:02/01/1991 color:vocals width:3\n bar:Mmothersbaugh from:01/01/1996 till:end        color:vocals width:3\n bar:Gcasale       from:01/01/1973 till:02/01/1991 color:bass\n bar:Gcasale       from:01/01/1973 till:02/01/1991 color:keys width:7\n bar:Gcasale       from:01/01/1973 till:02/01/1991 color:vocals width:3\n bar:Gcasale       from:01/01/1996 till:end        color:bass\n bar:Gcasale       from:01/01/1996 till:end        color:keys width:7\n bar:Gcasale       from:01/01/1996 till:end        color:vocals width:3\n bar:Reisman       from:01/01/1973 till:06/01/1974 color:drums\n bar:Jmothersbaugh from:06/01/1974 till:06/01/1976 color:perc\n bar:Myers         from:06/01/1976 till:01/01/1986 color:drums\n bar:Myers         from:05/01/1982 till:01/01/1986 color:perc width:3\n bar:Kendrick      from:01/01/1987 till:02/01/1991 color:drums\n bar:Kendrick      from:01/01/1996 till:07/22/2004 color:drums\n bar:Friedl        from:01/01/2008 till:01/01/2015 color:drums\n bar:Friedl        from:01/01/2008 till:01/01/2015 color:touring width:3\n bar:Freese        from:01/01/1996 till:end color:drums\n bar:Freese        from:01/01/1996 till:07/22/2004 color:touring width:3\n bar:Rmothersbaugh from:01/01/1973 till:02/01/1991 color:ccgb\n bar:Rmothersbaugh from:01/01/1996 till:05/22/2016 color:ccgb\n\nNotes\n\n*A^ David Kendrick performed with Devo at several 2002–2004 shows (including their tour of Japan (commemorated on the \"Devo – Live in the Land of the Rising Sun\" DVD) as well as the 2004 Nike Run Hit Wonder) due to the unavailability of Josh Freese. In addition, Kendrick also continued to play drums on all Devo studio tracks in the late 1990s and early 2000s. This would include \"It's All Good\", \"Are You Ready\", and \"Go Monkey Go\".\n*B^ Ashes Divide drummer Jeff Friedl (formerly of Eagles of Death Metal and Puscifer) performed with Devo on June 5, 2010, at the KROQ Weenie Roast in Los Angeles, and accompanied Devo on other selected dates between 2008 and 2013 due to Freese performing with Weezer. Friedl returned for several performances in late 2014 following the \"Hardcore Devo\" tour for similar reasons, and also played drums on a few tracks from the 2013 compilation album Something Else for Everybody.\n\nDiscography\n\nStudio albums\n\n* Q: Are We Not Men? A: We Are Devo! (1978)\n* Duty Now for the Future (1979)\n* Freedom of Choice (1980)\n* New Traditionalists (1981)\n* Oh, No! It's Devo (1982)\n* Shout (1984)\n* Total Devo (1988)\n* Smooth Noodle Maps (1990)\n* Something for Everybody (2010). Devo. http://en.wikipedia.org/?curid=9130."
  }
}
