{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16261",
  "eid" : "24fdf6c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778571308,
  "textBody" : "Juliana Hatfield (born July 27, 1967) is an American musician and singer-songwriter from the Boston area, formerly of the indie rock bands Blake Babies, The Juliana Hatfield Three, Some Girls, and The Lemonheads. She's best known for several singles released in the 1990s, including the alternative hit \"My Sister.\"\n\nHatfield has also performed and recorded as a solo artist and as one half of Minor Alps alongside Matthew Caws of Nada Surf. In December 2014, Paste Magazine named her cover of the song \"Needle in the Hay\" by Elliott Smith as number 10 in a list of the \"20 Best Cover Songs of 2014.\"\n\nIn 2014, she reformed The Juliana Hatfield Three, announcing the new album Whatever, My Love for 2015. In late December, Stereogum named the album \"one of their most anticipated albums of 2015,\" and on January 4, 2015, Consequence of Sound named it \"one of the 50 most anticipated albums of 2015.\" The band toured the US in February and March 2015 in support of the album.\n\nEarly life \n\nHatfield was born in Wiscasset, Maine, the daughter of Philip M. Hatfield, a radiologist, and Julie Hatfield, a former Boston Globe features, society, travel writer, and fashion critic who currently works as a freelance travel writer. Hatfield grew up in the Boston suburb of Duxbury. Although well known for the early 1990s hit, \"My Sister\", Hatfield has two brothers, but no sisters.\n\nHatfield's father claimed his family were descendants of the West Virginia Hatfields of the Hatfield–McCoy feud following the Civil War. Hatfield's father was a doctor who served in the Navy during the Vietnam War.\n\nHatfield went to Duxbury High School in Duxbury, Massachusetts. She then attended Boston University and studied at Berklee College of Music in Boston, Massachusetts.\n\nHatfield currently lives in Cambridge, Massachusetts and attends School of the Museum of Fine Arts, Boston.\n\nMusic career \n\nHatfield acquired a love of rock music during the 1970s, having been introduced by a babysitter to the music of the Los Angeles punk rock band X, which proved a life-changing experience. She was also attracted to the music of more mainstream artists like Olivia Newton-John and The Police.\n\nBlake Babies \n\nFollowing her graduation from Duxbury High School, Hatfield attended Boston University for a semester. She then transferred as a piano student to the Berklee College of Music in Boston, in the hope of finding a band with which to sing. There she soon met Freda Boner (now Freda Love) and John Strohm, forming the Blake Babies with them in 1986.\n\nThe band, with which she sang and played bass guitar (as well as some guitar and piano), was signed to North Carolina's Mammoth Records and received a fair amount of airplay on college radio through the early 1990s. The group toured the United States several times, performed in Europe, and made several music videos. Hatfield eventually earned a degree in songwriting from Berklee.\n\nAlthough Hatfield shared vocal duties with Strohm in the group, she quickly stood out due to her unique vocal quality; her somewhat thin, girlish voice gave the group a youthful, innocent sound that was nevertheless belied by often-caustic lyrics and a vocal delivery punctuated frequently by harsh, distorted screams (in live performances more so than on recordings). Although the group's early work was essentially punk-oriented, they quickly settled into a sunny, melodic, and slightly jangly pop style reminiscent in style of early R.E.M. and Neil Young. Hatfield and Strohm shared songwriting credits and often sang together in harmony or octaves, creating a memorable \"boy-girl\" sound.\n\nThe group formally disbanded in 1991 but, largely due to the persistent efforts of Freda, reunited briefly in late 1999, performing a few shows in 1999 and 2000 and embarking on one last U.S. tour in 2001.  Coinciding with the tour, the Blake Babies recorded and released a new album titled God Bless The Blake Babies which received strong reviews. The album featured new original songs as well as renditions of songs by Ben Lee and Madder Rose.  Frequent collaborator Evan Dando also made a guest appearance on the album.  After the tour, Hatfield released a Blake Babies EP titled Epilogue at her live shows featuring the band covering Fleetwood Mac, The Ramones and MC5.\n\nThe Lemonheads \n\nFollowing the breakup of the Blake Babies in 1991, Hatfield joined The Lemonheads to record their breakthrough album It's a Shame About Ray, playing bass and providing backing vocals.  She played and sang with the band on and off during the 1992–1993 period.  She did not appear on the band's cover of \"Mrs. Robinson\", which was included on reissues of It's a Shame About Ray, and was not an official band member listed on Come On Feel The Lemonheads, but did record some backing vocals for several tracks on that album.\n\nThe Juliana Hatfield Three \n\nFirst releases\n\nHatfield began her solo career following the Blake Babies' breakup in 1991, releasing her first solo album (Hey Babe) in 1992.  The album was one of the highest selling independent albums of 1992. Hatfield recruited a rhythm section consisting of former Moving Targets and Bullet LaVolta drummer Todd Phillips, and Thudpucker bassist Dean Fisher, and thus becoming The Juliana Hatfield Three.\n\nHatfield achieved alterna-rock stardom with the release of 1993's Become What You Are (recorded under the group name The Juliana Hatfield Three). Several songs from the album received regular airplay on major North American rock stations, with Hatfield's song \"My Sister\" becoming the biggest hit of her career, with a #1 placing on the Modern Rock Tracks chart, and the video becoming an MTV staple.\n\n\"My Sister\" was based on a real person: Hatfield's older brother's girlfriend, Meg Rafferty, who lived with the family while Hatfield was in high school. She enjoyed Rafferty's eclectic record collection. Rafferty also took Hatfield to see the Del Fuegos and the Violent Femmes, which inspired her to form a band.\n\n\"Spin the Bottle\" was used in the soundtrack of the Hollywood film Reality Bites (1994). Hatfield also made the cover of Spin magazine.\n\nHatfield was profiled in a number of girls' magazines at this time and addressed serious issues faced by young women in her songs and interviews. About this period she says: \"I was never comfortable with the attention. I thought it had come too soon. I hadn’t earned it yet.\" She gained notoriety in 1992 for saying that she was still a virgin in her mid-twenties in Interview magazine. In a 1994 interview for the magazine Vox, she said she was surprised by the effect 'outing' herself had: \"I think there are a lot of people out there who don't care about sex, but who you never hear from, so I thought I should say it. The magazine I did the interview for is full of beef-cake hunky guys and scantily-clad models, so I thought it would be really funny to say that I didn't care about sex in a magazine that's full of sex and beauty – but no one really got the joke.\"\n\nTouring and disbanding\n\nIn 1995, following the success of Become What You Are she released her follow-up album, Only Everything, in which she \"turned up the volume and the distortion and had a lot of fun\". One reviewer describes it as \"a fun, engaging pop album\". The album spawned another alternative radio hit for Hatfield in \"Universal Heartbeat\".  The video featured Hatfield as an overly demanding aerobics instructor.  Prior to the tour for Only Everything, Hatfield released Phillips and brought on Jason Sutter (American Hi-Fi, Chris Cornell, Jack Drag), as well as Ed Slanker (Thudpucker, Tinsel) on 2nd guitar, and Lisa Mednick on keyboards. Two weeks into the tour, Hatfield canceled the tour, which her publicist explained as due to \"nervous exhaustion,\" and took a month-long break.\n\nIn her memoir, Hatfield writes that in truth she was suffering from depression severe enough to the point of being suicidal. Hatfield disagreed with the decision not to be upfront about her depression. The drummer was, once again, replaced, this time by Phillips, and touring resumed with Jeff Buckley as the opening act.\n\nIn 1996, she traveled to Woodstock, New York where she recorded tracks for God's Foot, which was to be her fourth solo album (third if not counting Become What You Are, which was recorded with the Juliana Hatfield Three), intended for 1997 release. After three failed attempts to satisfy requests from Atlantic Records to come up with a \"single\" that the label could release, Juliana requested she be released from her contract. The label obliged, but kept the rights to the songs produced during these sessions (Atlantic had reportedly paid $180,000 to that point on the recordings). Two tracks – \"Mountains of Love\" and \"Fade Away\" – were eventually released on a greatest hits collection entitled Gold Stars, while still another, \"Can't Kill Myself,\" was available for download from Hatfield's official website. The remaining tracks have surfaced only as substandard bootleg versions (which do not meet Hatfield's approval) and she has rarely featured them in her subsequent live performances.\n\nIn 1997 Hatfield toured with the first Lilith Fair, a prominent all-female rock festival founded by singer Sarah McLachlan.\n\n2014: Reformation and Whatever, My Love\n\nIn 2014 The Juliana Hatfield Three was reformed after two decades of hiatus, and Hatfield, drummer Todd Philips, and bassist Dean Fisher began practicing new material for an album. The album marked the band's first release in twenty two years, since their LP Become What You Are in 1993. Stated Hatfield about the new album, \"We haven’t totally reinvented the wheel or anything,\" and that the tracks exhibit the \"stuff I am sort of known for, I guess. But I am a lot more confident now than I was then with the first album. And I had more fun recording this one.\" The twelve tracks for Whatever, My Love were recorded at Nuthouse Recording in Hoboken, New Jersey, with Beaujour and Hatfield co-producing the project.\n\nThe lead single from the album, \"If I Could,\" was released in December 2014, and was premiered in publications such as Rolling Stone.  That month the album was made available for pre-order on American Laundromat Records, with an announced release date for Whatever, My Love on February 17, 2015. The band announced they would tour the United States in support of the album throughout February, hitting cities on both coasts and the midwest, as well as venues such as the Bowery Ballroom in New York city  and The Roxy Theatre in Los Angeles in late March.\n\nIn late December 2014, Stereogum named the album \"one of their most anticipated albums of 2015,\" and on January 4, 2015, Consequence of Sound named it \"one of the 50 most anticipated albums of 2015.\" On January 9, 2015, Hatfield was featured at Nylon.com, who wrote that the upcoming album came off as \"unforced, and with its sly lyrics and mega-hooky coffeehouse-grunge aesthetic.\" The album's second single \"Ordinary Guy\" premiered on Consequence of Sound on January 14, 2015.\n\nSolo career \n\nFollowing the traumatic experiences surrounding God's Foot, and now freed from her major label obligations, Hatfield recorded a six-song EP for indie label Bar/None in 1997 titled Please Do Not Disturb. Produced by Hatfield herself, the album featured several different musicians, including drummer Todd Phillips, guitarists Ed Slanker and Mike Leahy, and new bass player Mikey Welsh (Weezer) among others.  The EP features a particularly tender song, \"Trying Not To Think About It,\" which is a tribute to the deceased musician Jeff Buckley, who was a friend of Hatfield's.\n\nAlmost as a reaction to the seemingly endless studio sessions surrounding God's Foot, Hatfield recorded the album Bed in 1998 in six days, about which she says on her website: \"It sounds as raw as I felt. It has no pretty sheen. The mistakes and unattractive parts were left in, not erased. Just like my career. Just like life.\"\n\nIn 2000, she released Beautiful Creature, an album which was among the most critically well-received of her career. This album left the rockier side of Hatfield's musical personality unexpressed, however, so at the same time she also recorded Juliana's Pony: Total System Failure with Zephan Courtney and Mikey Welsh, which she describes as \"a loud release of tension\", with \"lots of long sloppy guitar solos. And no love songs...a not-at-all attractive reaction to the ugly side of humanity, specifically American culture.\" The two albums were initially released in a set as a pair; however, Juliana's Pony: Total System Failure was received badly by the critics, who preferred the acoustic songwriting on Beautiful Creature. On Beautiful Creature, Hatfield worked with Austin-based musician Davíd Garza who co-produced much of the album.  Wally Gagel, a producer for Sebadoh and Tanya Donelly, helped Hatfield record her most electronica-influenced songs, \"Cool Rock Boy\" and \"Don't Rush Me\", which added texture to the otherwise acoustic album.\n\nHatfield released two simultaneous albums, \"Beautiful Creature\" and \"Total System Failure\" (Zoe/Rounder). Billboard described the first as \"a collection of plaintive demos\" and the other \"chock-a-block with punk guitar missives.\"\n\n2002 saw the release of Hatfield's first \"best-of\" album. The album, titled Gold Stars 1992–2002: The Juliana Hatfield Collection, featured the singles from her solo albums.  It also contained two of the songs from the previously unreleased God's Foot, a cover of Neil Young's \"Only Love Can Break Your Heart\", as well as four new recordings.\n\nIn 2004, Hatfield released In Exile Deo, which was arguably an attempt at a more commercial sound, with input from producers and engineers who'd worked with Pink and Avril Lavigne. Hatfield did, however, produce the album herself with David Leonard, receiving co-production credits on \"Jamie's in Town\" and the bright rocker \"Sunshine.\" The critics loved it, with a couple calling it her best work since the start of her solo career.\n\nYe Olde records \n\nBy contrast, the 2005 album Made in China was recorded in Bellows Falls, Vermont and Cambridge, Massachusetts, and was released on her own new record label, Ye Olde Records. The record had a much rawer feel, with Hatfield playing instruments accompanied by the band Unbusted and other contributors. For the first time, Hatfield also played drums on at least one track.\n\nJohn Doe of the band X described the disc as \"A frighteningly dark & beautiful record filled w/ stark, angular, truly brutal songs & guitars. This is surely a 'Woman Under the Influence', though I'm not sure of what.\" Reviews were mixed, with some liking the lo-fi sound, but others seeing it as slackness.\n\nThe release of Made in China started a trend where Hatfield licensed her music, selling it via her website and with a distribution deal through Red Eye.\n\nIn December 2005, Hatfield toured the United States with the band X, whom she idolized during her teenage years.\n\nIn 2006, Hatfield released her first live album. Titled The White Broken Line: Live Recordings, the album featured performances from her tour with X. This was Hatfield's third release for her record label.\n\nHatfield's 9th studio album, How to Walk Away, was released on August 19, 2008 on Ye Olde Records. The album's heartfelt subject on the break-up of a relationship resonated with critics, who gave the album largely positive reviews, with some hailing it as her best album since In Exile Deo.\n\nHatfield returned 2 years later as her 10th studio album Peace & Love was released on Ye Olde Records, February 16, 2010.  The album's composition, arrangement, performance, production, engineering and mixing was solely credited to Hatfield. The album received mixed reviews, with several complaining the album's low-key moody nature working against the potential of the songs.\n\nHatfield offered, [https://web.archive.org/web/20110717205509/http://www.julianahatfield.com/special.htm via her website], to write custom songs in order to fund a couple of projects; one of which was to release archive material. About halfway through the project Hatfield stated that it had \"completely re-energized and inspired\" her again.\n\nDuring October 2010 Hatfield and Evan Dando played two sell-out acoustic live shows together at The Mercury Lounge in New York. The following month the duo played sell out shows in Allston, a neighborhood of Boston. This tour was followed, in January 2011, by five dates on the American east coast; Hoboken, Brooklyn, Arlington, Milford and Philadelphia.\n\nPledgeMusic \n\nOn April 2011, Hatfield announced her intention to work on a new album via fan-funding platform website PledgeMusic, from which she asked for her fans to help fund the project in exchange for personal artwork and memorabilia ranging from posters, CDs, demos, one of Juliana's First Act guitars (used during the recording sessions) and even locks of her hair. The project also included donations for the Save a Sato foundation to which Hatfield is a major contributor. Fan response was enthusiastic, going over 400% from the original project cost. The album was originally going to be titled Speeches Delivered to Animals and Plants, in reference to a passage in the John Irving novel The World According to Garp, but later Hatfield herself changed it for the title There's Always Another Girl, in reference to a song in the album of the same name she'd written as a defense for Lindsay Lohan after watching her flop I Know Who Killed Me.\n\nThere's Always Another Girl was released on August 30, 2011, again independently on her Ye Olde Records label, though a downloadable version was made available to contributors a month before on July 27, which was Juliana's birthday. The album has received mostly positive reviews from critics.\n\nOn August 28, 2012, Juliana Hatfield released a covers record titled Juliana Hatfield on her Ye Olde Records label. The album features covers of songs originally performed by The Who, Liz Phair, Creedence Clearwater Revival, Ryan Adams, I Blame Coco, Led Zeppelin, and more.\n\nAs of July 2013, Juliana Hatfield has finished recording her thirteenth solo album, Wild Animals, with crowd-funding—for the third time—through PledgeMusic.\n\nIn December 2014, Paste Magazine named her track \"Needle in the Hay,\" an Elliott Smith cover, as No. 10 one of the \"20 Best Cover Songs of 2014.\" The review called the cover \"a more upbeat, approachable take on Smith’s disparate, wrought-iron classic. But even though it now employs bass, drums, tambourine and synth, the songs stays true to the sorrowful, tension-riddled original.\" Also that month, SPIN Magazine named the cover one of the \"40 Best 2014 Songs by 1994 Artists ,\" where it came it at No. 36. The review stated \"The tempo's a bit quicker, and she double-tracks herself for the song’s entirety. But the (tasteful) inclusion of chintzy drum programming and mellotron cleverly point to Smith's eventual creative direction.\"\n\nJuliana Hatfield is currently using PledgeMusic for a fourth time to raise funds for a new album by the recently reformed The Juliana Hatfield Three, consisting of Juliana Hatfield on guitar and vocals, Dean Fisher on bass, and Todd Philips on drums. The album will be a follow-up to 1993's Become What You Are. It is to be titled Whatever, My Love.\n\nIn 2015 Juliana Hatfield and Paul Westerberg announced that they have formed a new group, called the I Don't Cares.\n\nMusical style \n\nStyle and influences \n\nFrom her work with the Blake Babies to the present, Hatfield's output has been characterized by an alternation between heavy, rocking tunes and songs written in a gentler, more melodic or folk-oriented style.  Hatfield has stated that in the 1990s she tried smoking cigarettes for a short time in the hope of giving her voice a rougher quality, but eventually reconciled herself with her distinctive vocal instrument. A survey of her releases shows her voice to be remarkably agile, with little vibrato but capable of both forcefulness and sensitivity, making it well suited to the multitracked vocal harmonies that feature prominently on most of her albums.\n\nHatfield's musical influences are diverse, ranging from punk groups like X, The Stooges, and The Replacements to more folk-oriented rock artists like Neil Young, whose songs the Blake Babies frequently covered in live shows.  Her work has also cross-fertilized with some other contemporaneous indie rock bands such as Dinosaur Jr. and Lemonheads, whose musicians are also friends of Hatfield's.  From an early age, she has also had a special love for pretty-sounding pop music.  In a 1998 interview, she stated, \"I just always liked pop music and really good melodies and major chords. That's just the type of music that comes naturally to me\".[http://www.blakebabies.com/archive/jul_aquarian.htm]   In a 1993 interview in Melody Maker magazine, Hatfield stated that her enthusiasm for the music of the pop group Wilson Phillips apparently led, at least in part, to the breakup of the Blake Babies.\n\nLyrics \n\nA recurrent theme in her songs has been a skewering of figures in society that she finds ridiculous: self-important men (\"I'm Not Your Mother\"), groupies (\"Rider\"), fashion models (\"Supermodel\"), and men who make tragic fashion choices (\"Leather Pants\").  Other songs have dealt with more serious issues such as body image (\"Ugly\" and \"Feed Me\") as well as the failure to connect fully with other people or achieve meaningful and lasting relationships (\"How Would You Know\" and \"Perfection\"). Some of her songs deal more or less explicitly with her anger towards people she sees as not taking responsibility for their actions (\"Stay Awake\n\", several of the songs from the album \"Total System Failure\", notably \"The Victim\"). A few songs (\"Let's Blow it All,\" \"Give Me Some of That\") are more lighthearted in tone. Her quieter, more acoustic songs often deal with relationships (\"When You Loved Me\") and particular places (\"Trying Not to Think About It\"). Sometimes they have a wistful melancholy, a sense of struggling to carry on, trying to find some meaning in life (\"Backseat\", \"Feelin' Massachusetts\").  Since the mid-1990s songs such as \"Sellout\" have dealt in a more or less overtly sarcastic way with the demands the music industry places on artists (particularly female ones) in order to ensure their \"success.\"\n\nAlthough much of Hatfield's output is exuberant and hard-rocking, Hatfield nonetheless describes herself as very shy and somewhat of a loner, and has said that \"happy lyrics don't come naturally to me.\" She has also described her music and songwriting as a form of therapy, an outlet that helps her to overcome rough periods and depression.[http://www.blakebabies.com/archive/jul_globe0793.htm]  \n\nInstruments \n\nThe guitar is Hatfield's primary instrument. Her guitar playing often features alternate tunings, and her bass playing often uses double notes. Hatfield played bass on the Blake Babies albums Earwig and Sunburn as well as on The Lemonheads' It's a Shame About Ray. Since her work with the Blake Babies, she has generally assigned bass playing duties to band members or studio musicians. She has also played piano, electric piano, and organ on her releases. On her album Made in China (2005) she played drums.\n\nCollaborations \n\nHatfield has also performed with The Lemonheads, living for a time with Evan Dando in the college neighborhood of Allston in Boston, and contributed backing vocals to recordings by Belly, Giant Sand, Susanna Hoffs, Aimee Mann, and Mary Lou Lord. She teamed up with Dando in 1999 to record Gram Parsons's song \"$1,000 Wedding\" on the compilation, Return of the Grievous Angel: A Tribute to Gram Parsons.\n\nSome Girls \n\nIn 2001, she joined with Freda Love and Heidi Gluck (of The Pieces and The Only Children) to form the trio Some Girls, with which she performs in addition to her solo work; the group has toured the United States twice and has released two albums.  The trio is another outlet for Hatfield's more lighthearted material. Their first album, entitled Feel It, was released by Koch Records in 2003. The lead single \"Necessito\" is a funky affirmation of the power of music, sung in a mixture of English and Spanish. Some Girls' second album, Crushing Love, was released in July 2006.\n\nFrank Smith \n\nIn 2007 Hatfield signed the Boston (now Austin)-based band Frank Smith to her record label, Ye Olde Records.  Along with releasing their 2007 album Heavy Handed Peace and Love, Hatfield also recorded an EP with the band titled Sittin' in a Tree.  The EP, produced by Frank Smith's Aaron Sinclair, features banjos, pedal steel, and other instruments normally associated with country music.\n\nMinor Alps \n\nHatfield and Matthew Caws of Nada Surf formed a band called Minor Alps whose first album, Get There, was released October 29, 2013, on Barsuk Records.[http://hereandnow.wbur.org/2013/08/26/minor-alps-band \"Juliana Hatfield And Matthew Caws Unite As ‘Minor Alps’\"]. Here and Now, August 26, 2013.\n\nThe I Don't Cares \n\nHatfield and Paul Westerberg formed The I Don't Cares, releasing \"Wild Stab\" January 22, 2016, on Dry Wood Records.\n\nWriting and acting \n\nBeyond her musical accomplishments, Hatfield has also guest-starred on several television shows, including The Adventures of Pete & Pete as a lunch lady and on the cult classic My So-Called Life's Christmas episode as a deceased homeless girl who has become an angel.  During the mid-1990s she was a staple on MTV's 120 Minutes alternative music program, and she performed on the Late Show with David Letterman and Late Night with Conan O'Brien in 1995.\n\nOn March 25, 2008, Hatfield began her own blog through her website titled An Arm and A Leg. The blogs lasted about a year before being removed. Each week, or thereabouts, she'd revealed the influences behind one of her songs.\n\nHatfield briefly appeared on an episode of Space Ghost Coast to Coast named \"Surprise\", which aired on June 19, 1996. Instead of being interviewed, she simply said \"uhh\" and then was zapped by Zorak.\n\nHatfield released the book When I Grow Up: A Memoir on September 22, 2008.\n\nRadio and Podcast Appearances \n\nHatfield appeared on Ken Reid's TV Guidance Counselor podcast on April 7, 2017.\n\nDiscography \n\nSolo albums \n\n* Hey Babe (1992)\n* Only Everything (1995)\n* God's Foot (1996, not released – this was slated for a Spring 1997 release)\n* Bed (1998)\n* Beautiful Creature (2000)\n* Juliana's Pony: Total System Failure (2000)\n* In Exile Deo (2004)\n* Made in China (2005)\n* How to Walk Away (2008)\n* Peace & Love (2010)\n* There's Always Another Girl (2011)\n* Juliana Hatfield (2012)\n* Wild Animals (2013)\n* Pussycat (2017)\n* Juliana Hatfield Sings Olivia Newton-John (2018)\n\nThe Juliana Hatfield Three \n\n* Become What You Are (1993)\n* Whatever, My Love (2015)\n\nBlake Babies \n\n* Nicely, Nicely (1987)\n* Earwig (1989)\n* Sunburn (1990)\n* God Bless The Blake Babies (2001)\n\nSome Girls \n\n* Feel It (2003)\n* Crushing Love (2006)\n\nMinor Alps \n\n* Get There (2013)\n\nThe I Don't Cares \n\n* Wild Stab (2016)\n\nWorks or publications \n\n* Hatfield, Juliana (2008). When I Grow Up: A Memoir. Wiley Publishing. . 336 pp.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Juliana Hatfield" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16261" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Juliana Hatfield (born July 27, 1967) is an American musician and singer-songwriter from the Boston area, formerly of the indie rock bands Blake Babies, The Juliana Hatfield Three, Some Girls, and The Lemonheads. She's best known for several singles released in the 1990s, including the alternative hit \"My Sister.\"\n\nHatfield has also performed and recorded as a solo artist and as one half of Minor Alps alongside Matthew Caws of Nada Surf. In December 2014, Paste Magazine named her cover of the song \"Needle in the Hay\" by Elliott Smith as number 10 in a list of the \"20 Best Cover Songs of 2014.\"\n\nIn 2014, she reformed The Juliana Hatfield Three, announcing the new album Whatever, My Love for 2015. In late December, Stereogum named the album \"one of their most anticipated albums of 2015,\" and on January 4, 2015, Consequence of Sound named it \"one of the 50 most anticipated albums of 2015.\" The band toured the US in February and March 2015 in support of the album.\n\nEarly life \n\nHatfield was born in Wiscasset, Maine, the daughter of Philip M. Hatfield, a radiologist, and Julie Hatfield, a former Boston Globe features, society, travel writer, and fashion critic who currently works as a freelance travel writer. Hatfield grew up in the Boston suburb of Duxbury. Although well known for the early 1990s hit, \"My Sister\", Hatfield has two brothers, but no sisters.\n\nHatfield's father claimed his family were descendants of the West Virginia Hatfields of the Hatfield–McCoy feud following the Civil War. Hatfield's father was a doctor who served in the Navy during the Vietnam War.\n\nHatfield went to Duxbury High School in Duxbury, Massachusetts. She then attended Boston University and studied at Berklee College of Music in Boston, Massachusetts.\n\nHatfield currently lives in Cambridge, Massachusetts and attends School of the Museum of Fine Arts, Boston.\n\nMusic career \n\nHatfield acquired a love of rock music during the 1970s, having been introduced by a babysitter to the music of the Los Angeles punk rock band X, which proved a life-changing experience. She was also attracted to the music of more mainstream artists like Olivia Newton-John and The Police.\n\nBlake Babies \n\nFollowing her graduation from Duxbury High School, Hatfield attended Boston University for a semester. She then transferred as a piano student to the Berklee College of Music in Boston, in the hope of finding a band with which to sing. There she soon met Freda Boner (now Freda Love) and John Strohm, forming the Blake Babies with them in 1986.\n\nThe band, with which she sang and played bass guitar (as well as some guitar and piano), was signed to North Carolina's Mammoth Records and received a fair amount of airplay on college radio through the early 1990s. The group toured the United States several times, performed in Europe, and made several music videos. Hatfield eventually earned a degree in songwriting from Berklee.\n\nAlthough Hatfield shared vocal duties with Strohm in the group, she quickly stood out due to her unique vocal quality; her somewhat thin, girlish voice gave the group a youthful, innocent sound that was nevertheless belied by often-caustic lyrics and a vocal delivery punctuated frequently by harsh, distorted screams (in live performances more so than on recordings). Although the group's early work was essentially punk-oriented, they quickly settled into a sunny, melodic, and slightly jangly pop style reminiscent in style of early R.E.M. and Neil Young. Hatfield and Strohm shared songwriting credits and often sang together in harmony or octaves, creating a memorable \"boy-girl\" sound.\n\nThe group formally disbanded in 1991 but, largely due to the persistent efforts of Freda, reunited briefly in late 1999, performing a few shows in 1999 and 2000 and embarking on one last U.S. tour in 2001.  Coinciding with the tour, the Blake Babies recorded and released a new album titled God Bless The Blake Babies which received strong reviews. The album featured new original songs as well as renditions of songs by Ben Lee and Madder Rose.  Frequent collaborator Evan Dando also made a guest appearance on the album.  After the tour, Hatfield released a Blake Babies EP titled Epilogue at her live shows featuring the band covering Fleetwood Mac, The Ramones and MC5.\n\nThe Lemonheads \n\nFollowing the breakup of the Blake Babies in 1991, Hatfield joined The Lemonheads to record their breakthrough album It's a Shame About Ray, playing bass and providing backing vocals.  She played and sang with the band on and off during the 1992–1993 period.  She did not appear on the band's cover of \"Mrs. Robinson\", which was included on reissues of It's a Shame About Ray, and was not an official band member listed on Come On Feel The Lemonheads, but did record some backing vocals for several tracks on that album.\n\nThe Juliana Hatfield Three \n\nFirst releases\n\nHatfield began her solo career following the Blake Babies' breakup in 1991, releasing her first solo album (Hey Babe) in 1992.  The album was one of the highest selling independent albums of 1992. Hatfield recruited a rhythm section consisting of former Moving Targets and Bullet LaVolta drummer Todd Phillips, and Thudpucker bassist Dean Fisher, and thus becoming The Juliana Hatfield Three.\n\nHatfield achieved alterna-rock stardom with the release of 1993's Become What You Are (recorded under the group name The Juliana Hatfield Three). Several songs from the album received regular airplay on major North American rock stations, with Hatfield's song \"My Sister\" becoming the biggest hit of her career, with a #1 placing on the Modern Rock Tracks chart, and the video becoming an MTV staple.\n\n\"My Sister\" was based on a real person: Hatfield's older brother's girlfriend, Meg Rafferty, who lived with the family while Hatfield was in high school. She enjoyed Rafferty's eclectic record collection. Rafferty also took Hatfield to see the Del Fuegos and the Violent Femmes, which inspired her to form a band.\n\n\"Spin the Bottle\" was used in the soundtrack of the Hollywood film Reality Bites (1994). Hatfield also made the cover of Spin magazine.\n\nHatfield was profiled in a number of girls' magazines at this time and addressed serious issues faced by young women in her songs and interviews. About this period she says: \"I was never comfortable with the attention. I thought it had come too soon. I hadn’t earned it yet.\" She gained notoriety in 1992 for saying that she was still a virgin in her mid-twenties in Interview magazine. In a 1994 interview for the magazine Vox, she said she was surprised by the effect 'outing' herself had: \"I think there are a lot of people out there who don't care about sex, but who you never hear from, so I thought I should say it. The magazine I did the interview for is full of beef-cake hunky guys and scantily-clad models, so I thought it would be really funny to say that I didn't care about sex in a magazine that's full of sex and beauty – but no one really got the joke.\"\n\nTouring and disbanding\n\nIn 1995, following the success of Become What You Are she released her follow-up album, Only Everything, in which she \"turned up the volume and the distortion and had a lot of fun\". One reviewer describes it as \"a fun, engaging pop album\". The album spawned another alternative radio hit for Hatfield in \"Universal Heartbeat\".  The video featured Hatfield as an overly demanding aerobics instructor.  Prior to the tour for Only Everything, Hatfield released Phillips and brought on Jason Sutter (American Hi-Fi, Chris Cornell, Jack Drag), as well as Ed Slanker (Thudpucker, Tinsel) on 2nd guitar, and Lisa Mednick on keyboards. Two weeks into the tour, Hatfield canceled the tour, which her publicist explained as due to \"nervous exhaustion,\" and took a month-long break.\n\nIn her memoir, Hatfield writes that in truth she was suffering from depression severe enough to the point of being suicidal. Hatfield disagreed with the decision not to be upfront about her depression. The drummer was, once again, replaced, this time by Phillips, and touring resumed with Jeff Buckley as the opening act.\n\nIn 1996, she traveled to Woodstock, New York where she recorded tracks for God's Foot, which was to be her fourth solo album (third if not counting Become What You Are, which was recorded with the Juliana Hatfield Three), intended for 1997 release. After three failed attempts to satisfy requests from Atlantic Records to come up with a \"single\" that the label could release, Juliana requested she be released from her contract. The label obliged, but kept the rights to the songs produced during these sessions (Atlantic had reportedly paid $180,000 to that point on the recordings). Two tracks – \"Mountains of Love\" and \"Fade Away\" – were eventually released on a greatest hits collection entitled Gold Stars, while still another, \"Can't Kill Myself,\" was available for download from Hatfield's official website. The remaining tracks have surfaced only as substandard bootleg versions (which do not meet Hatfield's approval) and she has rarely featured them in her subsequent live performances.\n\nIn 1997 Hatfield toured with the first Lilith Fair, a prominent all-female rock festival founded by singer Sarah McLachlan.\n\n2014: Reformation and Whatever, My Love\n\nIn 2014 The Juliana Hatfield Three was reformed after two decades of hiatus, and Hatfield, drummer Todd Philips, and bassist Dean Fisher began practicing new material for an album. The album marked the band's first release in twenty two years, since their LP Become What You Are in 1993. Stated Hatfield about the new album, \"We haven’t totally reinvented the wheel or anything,\" and that the tracks exhibit the \"stuff I am sort of known for, I guess. But I am a lot more confident now than I was then with the first album. And I had more fun recording this one.\" The twelve tracks for Whatever, My Love were recorded at Nuthouse Recording in Hoboken, New Jersey, with Beaujour and Hatfield co-producing the project.\n\nThe lead single from the album, \"If I Could,\" was released in December 2014, and was premiered in publications such as Rolling Stone.  That month the album was made available for pre-order on American Laundromat Records, with an announced release date for Whatever, My Love on February 17, 2015. The band announced they would tour the United States in support of the album throughout February, hitting cities on both coasts and the midwest, as well as venues such as the Bowery Ballroom in New York city  and The Roxy Theatre in Los Angeles in late March.\n\nIn late December 2014, Stereogum named the album \"one of their most anticipated albums of 2015,\" and on January 4, 2015, Consequence of Sound named it \"one of the 50 most anticipated albums of 2015.\" On January 9, 2015, Hatfield was featured at Nylon.com, who wrote that the upcoming album came off as \"unforced, and with its sly lyrics and mega-hooky coffeehouse-grunge aesthetic.\" The album's second single \"Ordinary Guy\" premiered on Consequence of Sound on January 14, 2015.\n\nSolo career \n\nFollowing the traumatic experiences surrounding God's Foot, and now freed from her major label obligations, Hatfield recorded a six-song EP for indie label Bar/None in 1997 titled Please Do Not Disturb. Produced by Hatfield herself, the album featured several different musicians, including drummer Todd Phillips, guitarists Ed Slanker and Mike Leahy, and new bass player Mikey Welsh (Weezer) among others.  The EP features a particularly tender song, \"Trying Not To Think About It,\" which is a tribute to the deceased musician Jeff Buckley, who was a friend of Hatfield's.\n\nAlmost as a reaction to the seemingly endless studio sessions surrounding God's Foot, Hatfield recorded the album Bed in 1998 in six days, about which she says on her website: \"It sounds as raw as I felt. It has no pretty sheen. The mistakes and unattractive parts were left in, not erased. Just like my career. Just like life.\"\n\nIn 2000, she released Beautiful Creature, an album which was among the most critically well-received of her career. This album left the rockier side of Hatfield's musical personality unexpressed, however, so at the same time she also recorded Juliana's Pony: Total System Failure with Zephan Courtney and Mikey Welsh, which she describes as \"a loud release of tension\", with \"lots of long sloppy guitar solos. And no love songs...a not-at-all attractive reaction to the ugly side of humanity, specifically American culture.\" The two albums were initially released in a set as a pair; however, Juliana's Pony: Total System Failure was received badly by the critics, who preferred the acoustic songwriting on Beautiful Creature. On Beautiful Creature, Hatfield worked with Austin-based musician Davíd Garza who co-produced much of the album.  Wally Gagel, a producer for Sebadoh and Tanya Donelly, helped Hatfield record her most electronica-influenced songs, \"Cool Rock Boy\" and \"Don't Rush Me\", which added texture to the otherwise acoustic album.\n\nHatfield released two simultaneous albums, \"Beautiful Creature\" and \"Total System Failure\" (Zoe/Rounder). Billboard described the first as \"a collection of plaintive demos\" and the other \"chock-a-block with punk guitar missives.\"\n\n2002 saw the release of Hatfield's first \"best-of\" album. The album, titled Gold Stars 1992–2002: The Juliana Hatfield Collection, featured the singles from her solo albums.  It also contained two of the songs from the previously unreleased God's Foot, a cover of Neil Young's \"Only Love Can Break Your Heart\", as well as four new recordings.\n\nIn 2004, Hatfield released In Exile Deo, which was arguably an attempt at a more commercial sound, with input from producers and engineers who'd worked with Pink and Avril Lavigne. Hatfield did, however, produce the album herself with David Leonard, receiving co-production credits on \"Jamie's in Town\" and the bright rocker \"Sunshine.\" The critics loved it, with a couple calling it her best work since the start of her solo career.\n\nYe Olde records \n\nBy contrast, the 2005 album Made in China was recorded in Bellows Falls, Vermont and Cambridge, Massachusetts, and was released on her own new record label, Ye Olde Records. The record had a much rawer feel, with Hatfield playing instruments accompanied by the band Unbusted and other contributors. For the first time, Hatfield also played drums on at least one track.\n\nJohn Doe of the band X described the disc as \"A frighteningly dark & beautiful record filled w/ stark, angular, truly brutal songs & guitars. This is surely a 'Woman Under the Influence', though I'm not sure of what.\" Reviews were mixed, with some liking the lo-fi sound, but others seeing it as slackness.\n\nThe release of Made in China started a trend where Hatfield licensed her music, selling it via her website and with a distribution deal through Red Eye.\n\nIn December 2005, Hatfield toured the United States with the band X, whom she idolized during her teenage years.\n\nIn 2006, Hatfield released her first live album. Titled The White Broken Line: Live Recordings, the album featured performances from her tour with X. This was Hatfield's third release for her record label.\n\nHatfield's 9th studio album, How to Walk Away, was released on August 19, 2008 on Ye Olde Records. The album's heartfelt subject on the break-up of a relationship resonated with critics, who gave the album largely positive reviews, with some hailing it as her best album since In Exile Deo.\n\nHatfield returned 2 years later as her 10th studio album Peace & Love was released on Ye Olde Records, February 16, 2010.  The album's composition, arrangement, performance, production, engineering and mixing was solely credited to Hatfield. The album received mixed reviews, with several complaining the album's low-key moody nature working against the potential of the songs.\n\nHatfield offered, [https://web.archive.org/web/20110717205509/http://www.julianahatfield.com/special.htm via her website], to write custom songs in order to fund a couple of projects; one of which was to release archive material. About halfway through the project Hatfield stated that it had \"completely re-energized and inspired\" her again.\n\nDuring October 2010 Hatfield and Evan Dando played two sell-out acoustic live shows together at The Mercury Lounge in New York. The following month the duo played sell out shows in Allston, a neighborhood of Boston. This tour was followed, in January 2011, by five dates on the American east coast; Hoboken, Brooklyn, Arlington, Milford and Philadelphia.\n\nPledgeMusic \n\nOn April 2011, Hatfield announced her intention to work on a new album via fan-funding platform website PledgeMusic, from which she asked for her fans to help fund the project in exchange for personal artwork and memorabilia ranging from posters, CDs, demos, one of Juliana's First Act guitars (used during the recording sessions) and even locks of her hair. The project also included donations for the Save a Sato foundation to which Hatfield is a major contributor. Fan response was enthusiastic, going over 400% from the original project cost. The album was originally going to be titled Speeches Delivered to Animals and Plants, in reference to a passage in the John Irving novel The World According to Garp, but later Hatfield herself changed it for the title There's Always Another Girl, in reference to a song in the album of the same name she'd written as a defense for Lindsay Lohan after watching her flop I Know Who Killed Me.\n\nThere's Always Another Girl was released on August 30, 2011, again independently on her Ye Olde Records label, though a downloadable version was made available to contributors a month before on July 27, which was Juliana's birthday. The album has received mostly positive reviews from critics.\n\nOn August 28, 2012, Juliana Hatfield released a covers record titled Juliana Hatfield on her Ye Olde Records label. The album features covers of songs originally performed by The Who, Liz Phair, Creedence Clearwater Revival, Ryan Adams, I Blame Coco, Led Zeppelin, and more.\n\nAs of July 2013, Juliana Hatfield has finished recording her thirteenth solo album, Wild Animals, with crowd-funding—for the third time—through PledgeMusic.\n\nIn December 2014, Paste Magazine named her track \"Needle in the Hay,\" an Elliott Smith cover, as No. 10 one of the \"20 Best Cover Songs of 2014.\" The review called the cover \"a more upbeat, approachable take on Smith’s disparate, wrought-iron classic. But even though it now employs bass, drums, tambourine and synth, the songs stays true to the sorrowful, tension-riddled original.\" Also that month, SPIN Magazine named the cover one of the \"40 Best 2014 Songs by 1994 Artists ,\" where it came it at No. 36. The review stated \"The tempo's a bit quicker, and she double-tracks herself for the song’s entirety. But the (tasteful) inclusion of chintzy drum programming and mellotron cleverly point to Smith's eventual creative direction.\"\n\nJuliana Hatfield is currently using PledgeMusic for a fourth time to raise funds for a new album by the recently reformed The Juliana Hatfield Three, consisting of Juliana Hatfield on guitar and vocals, Dean Fisher on bass, and Todd Philips on drums. The album will be a follow-up to 1993's Become What You Are. It is to be titled Whatever, My Love.\n\nIn 2015 Juliana Hatfield and Paul Westerberg announced that they have formed a new group, called the I Don't Cares.\n\nMusical style \n\nStyle and influences \n\nFrom her work with the Blake Babies to the present, Hatfield's output has been characterized by an alternation between heavy, rocking tunes and songs written in a gentler, more melodic or folk-oriented style.  Hatfield has stated that in the 1990s she tried smoking cigarettes for a short time in the hope of giving her voice a rougher quality, but eventually reconciled herself with her distinctive vocal instrument. A survey of her releases shows her voice to be remarkably agile, with little vibrato but capable of both forcefulness and sensitivity, making it well suited to the multitracked vocal harmonies that feature prominently on most of her albums.\n\nHatfield's musical influences are diverse, ranging from punk groups like X, The Stooges, and The Replacements to more folk-oriented rock artists like Neil Young, whose songs the Blake Babies frequently covered in live shows.  Her work has also cross-fertilized with some other contemporaneous indie rock bands such as Dinosaur Jr. and Lemonheads, whose musicians are also friends of Hatfield's.  From an early age, she has also had a special love for pretty-sounding pop music.  In a 1998 interview, she stated, \"I just always liked pop music and really good melodies and major chords. That's just the type of music that comes naturally to me\".[http://www.blakebabies.com/archive/jul_aquarian.htm]   In a 1993 interview in Melody Maker magazine, Hatfield stated that her enthusiasm for the music of the pop group Wilson Phillips apparently led, at least in part, to the breakup of the Blake Babies.\n\nLyrics \n\nA recurrent theme in her songs has been a skewering of figures in society that she finds ridiculous: self-important men (\"I'm Not Your Mother\"), groupies (\"Rider\"), fashion models (\"Supermodel\"), and men who make tragic fashion choices (\"Leather Pants\").  Other songs have dealt with more serious issues such as body image (\"Ugly\" and \"Feed Me\") as well as the failure to connect fully with other people or achieve meaningful and lasting relationships (\"How Would You Know\" and \"Perfection\"). Some of her songs deal more or less explicitly with her anger towards people she sees as not taking responsibility for their actions (\"Stay Awake\n\", several of the songs from the album \"Total System Failure\", notably \"The Victim\"). A few songs (\"Let's Blow it All,\" \"Give Me Some of That\") are more lighthearted in tone. Her quieter, more acoustic songs often deal with relationships (\"When You Loved Me\") and particular places (\"Trying Not to Think About It\"). Sometimes they have a wistful melancholy, a sense of struggling to carry on, trying to find some meaning in life (\"Backseat\", \"Feelin' Massachusetts\").  Since the mid-1990s songs such as \"Sellout\" have dealt in a more or less overtly sarcastic way with the demands the music industry places on artists (particularly female ones) in order to ensure their \"success.\"\n\nAlthough much of Hatfield's output is exuberant and hard-rocking, Hatfield nonetheless describes herself as very shy and somewhat of a loner, and has said that \"happy lyrics don't come naturally to me.\" She has also described her music and songwriting as a form of therapy, an outlet that helps her to overcome rough periods and depression.[http://www.blakebabies.com/archive/jul_globe0793.htm]  \n\nInstruments \n\nThe guitar is Hatfield's primary instrument. Her guitar playing often features alternate tunings, and her bass playing often uses double notes. Hatfield played bass on the Blake Babies albums Earwig and Sunburn as well as on The Lemonheads' It's a Shame About Ray. Since her work with the Blake Babies, she has generally assigned bass playing duties to band members or studio musicians. She has also played piano, electric piano, and organ on her releases. On her album Made in China (2005) she played drums.\n\nCollaborations \n\nHatfield has also performed with The Lemonheads, living for a time with Evan Dando in the college neighborhood of Allston in Boston, and contributed backing vocals to recordings by Belly, Giant Sand, Susanna Hoffs, Aimee Mann, and Mary Lou Lord. She teamed up with Dando in 1999 to record Gram Parsons's song \"$1,000 Wedding\" on the compilation, Return of the Grievous Angel: A Tribute to Gram Parsons.\n\nSome Girls \n\nIn 2001, she joined with Freda Love and Heidi Gluck (of The Pieces and The Only Children) to form the trio Some Girls, with which she performs in addition to her solo work; the group has toured the United States twice and has released two albums.  The trio is another outlet for Hatfield's more lighthearted material. Their first album, entitled Feel It, was released by Koch Records in 2003. The lead single \"Necessito\" is a funky affirmation of the power of music, sung in a mixture of English and Spanish. Some Girls' second album, Crushing Love, was released in July 2006.\n\nFrank Smith \n\nIn 2007 Hatfield signed the Boston (now Austin)-based band Frank Smith to her record label, Ye Olde Records.  Along with releasing their 2007 album Heavy Handed Peace and Love, Hatfield also recorded an EP with the band titled Sittin' in a Tree.  The EP, produced by Frank Smith's Aaron Sinclair, features banjos, pedal steel, and other instruments normally associated with country music.\n\nMinor Alps \n\nHatfield and Matthew Caws of Nada Surf formed a band called Minor Alps whose first album, Get There, was released October 29, 2013, on Barsuk Records.[http://hereandnow.wbur.org/2013/08/26/minor-alps-band \"Juliana Hatfield And Matthew Caws Unite As ‘Minor Alps’\"]. Here and Now, August 26, 2013.\n\nThe I Don't Cares \n\nHatfield and Paul Westerberg formed The I Don't Cares, releasing \"Wild Stab\" January 22, 2016, on Dry Wood Records.\n\nWriting and acting \n\nBeyond her musical accomplishments, Hatfield has also guest-starred on several television shows, including The Adventures of Pete & Pete as a lunch lady and on the cult classic My So-Called Life's Christmas episode as a deceased homeless girl who has become an angel.  During the mid-1990s she was a staple on MTV's 120 Minutes alternative music program, and she performed on the Late Show with David Letterman and Late Night with Conan O'Brien in 1995.\n\nOn March 25, 2008, Hatfield began her own blog through her website titled An Arm and A Leg. The blogs lasted about a year before being removed. Each week, or thereabouts, she'd revealed the influences behind one of her songs.\n\nHatfield briefly appeared on an episode of Space Ghost Coast to Coast named \"Surprise\", which aired on June 19, 1996. Instead of being interviewed, she simply said \"uhh\" and then was zapped by Zorak.\n\nHatfield released the book When I Grow Up: A Memoir on September 22, 2008.\n\nRadio and Podcast Appearances \n\nHatfield appeared on Ken Reid's TV Guidance Counselor podcast on April 7, 2017.\n\nDiscography \n\nSolo albums \n\n* Hey Babe (1992)\n* Only Everything (1995)\n* God's Foot (1996, not released – this was slated for a Spring 1997 release)\n* Bed (1998)\n* Beautiful Creature (2000)\n* Juliana's Pony: Total System Failure (2000)\n* In Exile Deo (2004)\n* Made in China (2005)\n* How to Walk Away (2008)\n* Peace & Love (2010)\n* There's Always Another Girl (2011)\n* Juliana Hatfield (2012)\n* Wild Animals (2013)\n* Pussycat (2017)\n* Juliana Hatfield Sings Olivia Newton-John (2018)\n\nThe Juliana Hatfield Three \n\n* Become What You Are (1993)\n* Whatever, My Love (2015)\n\nBlake Babies \n\n* Nicely, Nicely (1987)\n* Earwig (1989)\n* Sunburn (1990)\n* God Bless The Blake Babies (2001)\n\nSome Girls \n\n* Feel It (2003)\n* Crushing Love (2006)\n\nMinor Alps \n\n* Get There (2013)\n\nThe I Don't Cares \n\n* Wild Stab (2016)\n\nWorks or publications \n\n* Hatfield, Juliana (2008). When I Grow Up: A Memoir. Wiley Publishing. . 336 pp. Juliana Hatfield. http://en.wikipedia.org/?curid=16261."
  }
}
