{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16647",
  "eid" : "27692a60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778575366,
  "textBody" : "The economy of Kazakhstan is the largest economy in Central Asia. It possesses enormous oil reserves as well as minerals and metals.  It also has considerable agricultural potential with its vast steppe lands accommodating both livestock and grain production, as well as developed space infrastructure, which took over all launches to the International Space Station from the Space Shuttle.  The mountains in the south are important for apples and walnuts; both species grow wild there. Kazakhstan's industrial sector rests on the extraction and processing of these natural resources and also on a relatively large machine building sector specializing in construction equipment, tractors, agricultural machinery, and some military items.\n\nThe breakup of the USSR and the collapse of demand for Kazakhstan's traditional heavy industry products have resulted in a sharp contraction of the economy since 1991, with the steepest annual decline occurring in 1994. In 1995-97 the pace of the government program of economic reform and privatization quickened, resulting in a substantial shifting of assets into the private sector. The December 1996 signing of the Caspian Pipeline Consortium agreement to build a new pipeline from western Kazakhstan's Tengiz Field to the Black Sea increases prospects for substantially larger oil exports in several years. Kazakhstan's economy turned downward in 1998 with a 2.5% decline in GDP growth due to slumping oil prices and the August financial crisis in Russia. A bright spot in 1999 was the recovery of international petroleum prices, which, combined with a well-timed tenge devaluation and a bumper grain harvest, pulled the economy out of recession.\n\nCurrent GDP per capita shrank by 26% in the Nineties. In the 2000s, Kazakhstan's economy grew sharply, aided by increased prices on world markets for Kazakhstan's leading exports—oil, metals and grain. GDP grew 9.6% in 2000, up from 1.7% in 1999. In 2006, extremely high GDP growth had been sustained, and grew by 10.6%.  Business with booming Russia and China, as well as neighboring Commonwealth of Independent States (CIS) nations have helped to propel this growth.  The increased economic growth also led to a turn-around in government finances, with the budget moving from a cash deficit of 3.7% of GDP in 1999 to 0.1% surplus in 2000. The country experienced a slowdown in economic growth from 2014 sparked by falling oil prices and the effects of the Ukrainian crisis[http://www.ft.com/intl/cms/s/0/c4a55aa6-dd04-11e3-b73c-00144feabdc0.html#axzz3mCiNSOzr Kazakhs battle to stave off chill blowing in from Russian steppe], Financial Times, 21 May 2014 The country's currency was devalued by 19% in 2004 and by 22% in 2015.\n\nIn 2015, the World Economic Forum compiled its Global Competitiveness Ranking ranking Kazakhstan 50th out of 144 countries. The ranking considers multiple macroeconomic and financial factors, such as market size, GDP, tax rates, infrastructure development, etc. In 2012, the World Economic Forum listed corruption as the biggest problem in doing business in the country,[https://books.google.com/books?idBU7uK583X8MC&pg\nPA112&lpgPA112&dq\nkazakhstan+corruption+ranking&sourcebl&ots\nZI50X8c9BL&sigTiPEPwdRpIq41eJ1a5PxX_GsgYs&hl\nen&saX&ved\n0CFcQ6AEwBTgKahUKEwib2f2FzYPIAhVmcHIKHePYBpE#vonepage&q\nkazakhstan%20corruption%20ranking&ffalse OECD Investment Policy Reviews], P112, OECD, 2012 while the World Bank listed Kazakhstan as a corruption hotspot, on a par with Angola, Bolivia, Kenya, Libya and Pakistan.[https://www.nytimes.com/2006/11/05/business/yourmoney/05giffen.html?pagewanted\nall Oil, Cash and Corruption], New York Times, 5 November 2006\n\nThe World Bank Vice President for Europe and Central Asia, Cyril Muller, visited Astana in January 2017, where he praised the country's progress made during the 25-year partnership with the World Bank. Muller also talked about Kazakhstan's improved positioning in the World Bank's Doing Business Report 2017, where Kazakhstan ranked 35th out of 190 countries worldwide.\n\nKazakhstan secured 2nd position in the Central and South Asia regional ranking of the 2015 Global Innovation Index (GII) released by World Intellectual Property Organization (WIPO) together with Cornell University and INSEAD France.\n\nKazakhstan is listed in the 2016 Bloomberg Innovation Index among the top 50 most innovative economies. Kazakhstan improved its position in the 2017 Bloomberg Innovation Index by 2 spots ranking 48th, with a total score of 45.56.\n\nMacro-economic trend\n\nIn the 2014 Economic Freedom Index published by The Heritage Foundation in Washington, DC, Kazakhstan has gained 22 points over the past 17 years, which is noted by the authors as among the 20 best improvements recorded by any country. Kazakhstan ranks 11th out of 42 countries in the Asia–Pacific region, and its overall score is above the world and regional averages.\n\nThis chart shows trends in the gross domestic product of Kazakhstan at market prices estimated by the International Monetary Fund, with figures in millions of Kazakhstani tenge.\n\nFor purchasing-power parity comparisons, the US Dollar is exchanged at 59.95 Tenges only. Mean wages comprised $6.93 per man-hour in 2009.\n\nKazakhstan has managed its monetary policy well. Its principal challenge in 2001 was to manage strong foreign-currency inflows without sparking inflation. Inflation had, in fact, stayed under control, registering 9.8% in 2000, and appeared likely to be under 10% in 2001. Because of its strong economic performance and financial health, Kazakhstan became the first former Soviet republic to repay all of its debt to the IMF by paying back $400 million in 2000; 7 years ahead of schedule. Overall foreign debt amounts to about $12.5 billion, $4 billion of it owed by the government. This amounts to 6.9% of GDP, well within manageable levels. Experts believe that Kazakhstan may soon be added to the MSCI Emerging Markets Index.\n\nThe upturn in economic growth, combined with the results of earlier reforms in taxation and in the financial sector, dramatically improved government finances from the 1998 budget deficit level of 4.2% of GDP to a slight surplus in 2000. Government tax-revenues grew from 16.4% of GDP in 1999 to 20.6% of GDP in 2000. In 2000, Kazakhstan adopted a new tax-code in an effort to consolidate these gains. Its strong financial position also allowed the government to reduce the value-added tax (VAT) from 20% to 16% and to reduce social (payroll) taxes as of July 2001. Kazakhstan's stronger budget-position and strong export-earnings earned it credit-rating upgrades from Moody's, S&P, and Fitch during 2001.\n\nKazakhstan instituted a pension reform program in 1998 that was partly based on the model of the Chilean pension system but included modifications. By July 2001, Kazakhstanis had contributed more than $1 billion to their own personal pension-accounts, mostly managed by the private sector. The National Bank oversees and regulates the pension funds. The pension funds' growing demand for quality investment outlets triggered rapid development of the debt-securities market. Pension-fund capital is being invested almost exclusively in corporate and government bonds, including Government of Kazakhstan Eurobonds. The Kazakhstani banking system is developing rapidly. Banking systems capitalization now exceeds $1 billion. The National Bank has introduced deposit insurance in its campaign to strengthen the banking sector. Several major foreign banks have branches in Kazakhstan, including The Royal Bank of Scotland Group, Citibank, and HSBC. Kazakhstan is also a member of the Economic Cooperation Organization (ECO).\n\nAccording to the Republic of Kazakhstan Agency for Statistics, in January–March 2010 production of GDP amounted to 3,881.6 billion tenge and an increase of 7.1%.\n\nEconomic growth and GDP \n\nKazakhstan's GDP grew 4.1% in real terms during the period from January to September 2014.\n\nKazakhstan's real GDP growth is projected to reach 4.3% in 2014, the main driving force of the economy in Kazakhstan in 2014 is the consumer sector; the consumption in Kazakhstan is mainly boosted by the retail lending.\n\nAccording to the Agency of Statistics of the Republic of Kazakhstan the Kazakhstan's GDP growth in the first quarter of 2014 was 3.8%.\n\nThe Government of Kazakhstan signed a Framework Partnership Agreement with IBRD, IFC, MIGA on May 1, 2014; according to this Agreement the World Bank will allocate $2.5 billion to Kazakhstan, for the diversification of the economy and reaching the sustainable development.\n\nAs of 2015, the World Bank classified Kazakhstan as an upper-middle-income country with GDP per capita of nearly US$10.5 thousand.\n\nForeign direct investment increased 30 percent in 2015 in Kazakhstan’s agricultural industry and 80 percent in the country’s petroleum products sector.\n\nIn 2016 Kazakhstan's economy started to recover from the crisis caused by low oil prices and the tenge devaluation. According to the Minister of National Economy of Kazakhstan, in nine months of 2016 the GDP growth reached 0.4%. Sectors of economy that experienced the highest growth included construction (6.9%), agriculture (4.9%), and transport sector (4.0%).\n\nSectors of economy\n\nPrimary\n\nEnergy\n\nKazakhstan is the leading country in the world for uranium production volumes with 35% of global production, and it has the world's second biggest uranium reserves after Australia.\n\nOil and gas\n\nOil and gas is the leading economic sector. In 2000, Kazakhstan produced 35,252,000 metric tons of oil (700,000 barrels per day), a 17.4% increase over 1999's 30,025,000 tons. It exported 28,883,000 tons of oil in 2000, up 38.8% from 20,813,000 tons in 1999. Production in 2001 has been growing at roughly 20%, on target to meet the government's forecast of 40,100,000 tons of oil (800,000 barrels per day). In 2000, production reached 11.5 km³ of natural gas, up from 8.2 km³ in 1999.\n\nKazakhstan has the potential to be a world-class oil exporter in the medium term. The landmark foreign investment in Kazakhstan is the TengizChevroil joint venture, owned 50% by ChevronTexaco, 25% by ExxonMobil, 20% by KazMunaiGas of Kazakhstan, and 5% by LukArco of Russia. The Karachaganak natural gas and gas condensate field is being developed by BG, Agip, ChevronTexaco, and Lukoil. The Agip-led Offshore Kazakhstan Consortium has discovered potentially huge Kashagan oil field in the northern Caspian. Kazakhstan's economic future is linked to oil and gas development. GDP growth will depend on the price of oil, as well as the ability to develop new deposits.\n\nMining\n\nKazakhstan is a leading producer of many mineral commodities, including salt, uranium, ferrochrome, titanium sponge, cadmium, potassium, magnesium, rhenium, copper, bauxite, gallium and zinc.\n\nIndustry\n\nMotor cars\n\nIn June 2014 the CKD (Complete Knock-Down) assembly of Toyota Fortuner was launched in Kostanay, Kazakhstan. The expected annual output makes around 3,000 cars: 250 a month.\n\nThe Kazakhstan's car industry was developing rapidly in 2014 producing $2 billion worth of products annually. By 2018 the car industry in Kazakhstan is expected to reach 190,000 cars per year.\n\nRail\n\nGE Transportation acquired 50% stake in Lokomotiv Kurastyru Zauyty in a joint venture with Kazakhstan's national railway company Temir Zholy.\n\nServices\n\nTechnology\n\nOn 22 December 2014 the World Bank approved an $88 million loan that would support Kazakhstan’s efforts to facilitate commercially and socially viable innovation in technology. The Fostering Productive Innovation Project aims to improve the country in areas that are able to foster and support technological innovation.\n\nRetail\n\nAccording to A.T. Kearney's 2015 Global Retail Development Index, Kazakhstan ranked 13 out of 30. In the 2016th Index, Kazakhstan ranked as the 4th best developing country for retail investments, scoring 56.5 out of 100. Kazakhstan's market attracted large international retailers, such as French retail chains Carrefour and Leroy Merlin, as well as food giants McDonald's and KFC.\n\nTourism \n\n*Tourism in Kazakhstan\n\nExternal trade and investment\n\nTrade\n\nSherin Suzhikova, Counselor of Kazakhstan's Chamber of Commerce and Industry and Chao yon-chuan, Secretary-General of the Taiwan External Trade Development Council, signed an agreement on 13 October 2006 in Taipei to improve economic relations through \"exchanges of market information and visits by trade professionals.\" TAITRA has an office in Almaty, Kazakhstan.http://english.www.gov.tw/TaiwanHeadlines/index.jsp?recordid\n25753&action=CNA\n\nIn 2006, North Dakota's then Lieutenant Governor Jack Dalrymple led an 18-member delegation of the North Dakota Trade Office representing seven North Dakota companies and Dickinson State University on a trip to Kazakhstan, Ukraine and Russia. North Dakota exports mostly machinery to Kazakhstan, the eighth largest destination for North Dakotan exports; machinery exports increased from $22,000 to $25 million between 2000 and 2005.\n\nThe percentage of high-tech exports (as a share of manufactured exports) from Kazakhstan have grown from just 4.46% in 1995 to 37.17% in 2014. One of the main factors that triggered this growth was the Technology Commercialization Project developed and implemented by the World Bank Group and the Kazakh Government. Through this project, 65 Kazakh tech startups received funding and training helping them get their innovations into markets.\n\nChina is Kazakhstan's important trade partner. In late March 2015 the two countries signed 33 deals worth $23.6 billion. The deals cover different industries, such as oil refining, cars, steel.\n\nDuring the press conference on July 20, 2015 Minister of Investment and Development of Kazakhstan said: \"As of today, we export about 850 types of goods. Kazakhstan is among the top-50 best exporting countries globally and takes the 49th place.\"\n\nForeign direct investment\n\nKazakhstan is the largest recipient of total and annual foreign direct investment of all CIS countries.\nThe OECD has recognized the strides the government has made in opening the country to international investment and in improving the policy framework for investment as part of their efforts to diversify the economy. In 2017 Kazakhstan was invited by OECD to become Adherent to the OECD Declaration on International Investment and Multinational Enterprises.  \n\nIn June 2014 Kazakhstan's President, Nursultan Nazarbayev, signed into law tax concessions to promote foreign investment, including a 10-year exemption from corporation tax, an 8-year exemption from property tax, and a 10-year freeze on most other taxes. Other measures include a refund on capital investments of up to 30 percent once a production facility is in operation. In order to attract investment, Kazakhstan lowered the tax burden for foreign investors. The corporate income tax rate dropped from 30% to 20%. The government also gradually reduced VAT from 16% in 2006 to 12% in 2009.\n\nAs of September 30, 2014, total foreign investment in Kazakhstan reached USD 211.5 billion. Of that total, net foreign Direct Investment constituted USD 129.3 billion, with portfolio and other investments comprising the remaining USD 82.2 billion.\n\nAs of July 2015, Kazakhstan attracted $16 billion in the manufacturing industry over the past five years, which is 2.5 times more than over the previous five years. Kazakhstan put into operation four hundred new products, such as car industry, railway engineering, manufacture of basic chemical products, uranium industry, the industry of rare earth metals. The volume of new enterprises amounted to 580 billion tenge.\n\nIn June 2015 – June 2016 the total number of enterprises owned by foreign investors in Kazakhstan increased by 2.3 percent and reached 9,000. 8,691 foreign companies operating in the Kazakhstan are small businesses.\n\nAs of the beginning of 2016, the World Bank invested over $6.8 billion in Kazakhstan since 1992. These funds were invested in development of roads and social infrastructure, increasing of competitiveness of SME's, education, healthcare, environment protection, etc.\n\nIn 2012, Kazakhstan conducted the first review of the OECD investment standards, which resulted in 12 recommendations on how to improve the investment climate of the country. After adopting Law on public - private partnership that extends the use of the mechanism and revising standards of intellectual property protection and the rules of attracting foreign labor, Kazakhstan started a second review of the OECD in 2016.\n\nAccording to Ministry of Investment and Development of Kazakhstan, as of May 2016, attraction of foreign investment in oil refining increased by 80%, food industry - 30%, in engineering - by 7 times. The Ministry also reported that there were 200 investment projects in country worth more than $40 billion.\n\nIn mid-2016 a group of companies led by Chevron announced a $36.8 billion investment in Kazakhstan's Tengiz oil field.\n\nIn the first quarter of 2016, Kazakhstan attracted $2.7 billion in foreign direct investment. The largest investor in the Kazakh economy is The Netherlands ($66 billion), followed by the United States ($26 billion) and Switzerland ($15 billion). According to the Chairman of Kazakhstan National Bank, a key factor triggering the increased inflow of foreign investment is implementation of the Nurly Zhol state program that provides for the creation of favorable conditions. As of September 2016, foreign investments in the Kazakh economy totaled $5.7 billion, which is 4,8% more than during the same period of the previous year.\n\nSummarizing 2016, Kazakhstan's Foreign Minister Erlan Idrissov noted that Kazakhstan attracted $20 billion of foreign direct investment during the year. The gross inflow of foreign direct investment in 2016 grew by 40% compared to 2015 and surpassed the previous record of 2008. The number of foreign businesses operating in Kazakhstan increased 25% in 2016 compared to 2015. The main recipients of foreign direct investment were the mining industry, geological exploration and processing. The top four investors include the Netherlands, the United States, Switzerland and France.\n\nKazakhstan introduced a visa-free regime for citizens of EAEU, OECD, Monaco, Malaysia, United Arab Emirates, and Singapore starting from 2017. The visa-free entry is expected to increase cooperation with investors and businesses of these countries.\n\nAgriculture is one of Kazakhstan's most important sectors where the country seeks to attract foreign investments to boost the competitiveness of this sector of economy. To that end, in 2017 KazAgro negotiated with the European Investment Bank (EIB) a €200 million loan for a period of 15 years.\n\nIntellectual property\n\nKazakhstan has legislatively addressed the issues of Legal Regulation of Intellectual Property, patent law, and copyright protections.\n\nPublic policy\n\nNew Economic Policy \"Nurly Zhol\"\n\nOn November 11, 2014 in his address to the nation for 2015 Nursultan Nazarbayev proclaimed Kazakhstan’s New Economic Policy – The Path to the Future (Nurly Zhol). The new economic policy implies massive state investment in infrastructure over the next several years. In the short term, the program \"Nurly Zhol\" will apply the anti-crisis measures to overcome the turbulence in the global economy. The long-term measures of the state program of infrastructure development will help to create a strong platform for new growth.\n\nKazakhstan has identified five priorities for modernization of the state and the economy to maintain competitiveness in the Fourth Industrial Revolution.\n\nDoing business in Kazakhstan\n\nKazakhstan was ranked 35th in the Ease of Doing Business report released by the World Bank Group in October 2016. In the previous rating Kazakhstan was on the 51st place. The report's methodology implies that higher rankings (a low numerical value) indicate better, usually simpler, regulations for businesses and stronger protections of property rights.\n\nThe Heritage Foundation, a Washington DC - based research center, ranked Kazakhstan 42nd in its Index of Economic Freedom 2017. Previous year, Kazakhstan ranked 69th. According to the Heritage Foundation, Kazakhstan's improved ranking in 2017 is explained by its \"beneficial structural reforms.\" \n\nKazakhstan aims to boost economy by attracting private investors interested in developing national companies. This is the main goal of privatization that is expected to decrease the share of public property to 15% of GDP. Such companies as Kazakhstan Railways, Samruk-Energo, Kazatomprom, Kaspost, KazMunayGas and Air Astana are expected to be sold through IPO.\n\nKazakhstan climbed from the 47th to the 32nd place in the 2017 IMD World Competitiveness ranking. The report evaluates business efficiency, public finance and domestic economy.\n\nSmall and medium-sized enterprises\n\nA new program to support small businesses was launched in Kazakhstan in February 2015. 2015 is expected to be a pilot period of the program. During that period the initiative will be focused on three major areas, notably agribusiness, machinery building and production of construction materials, and is to be further extended to other industries.\n\nAccording to the Global Entrepreneurship Monitor-2014, Kazakhstan has a very positive image of the entrepreneurs. Nearly 70 percent of the population sees entrepreneurship as a good choice for building a career and achieving a high status in the society. Kazakhstan can also boast one of the lowest closing index, according to the Global Entrepreneurship Monitor-2014, meaning that only 2.9% of entrepreneurs were forced to cease their business.\n\nAnother important business trend in Kazakhstan is the growing role of women in this field. Over 50% of entrepreneurs in Kazakhstan are women.\n\nIn May 2015 the European Bank for Reconstruction and Development (EBRD) and the government of Kazakhstan have signed three agreements to provide €41 million for technical cooperation projects, advisory support to small and medium-sized enterprises (SMEs) and a Women in Business program. This initiative demonstrates that Kazakhstan invests in developing women businesses and supports diversity in this field.\n\nIn 2016 the number of Kazakhstan's telecom start-ups increased by 10% compared to 2015. Around 9,400 small telecom companies are currently registered in the country.\n\n2014 and 2015 developments\n\nThe country experienced a slowdown in economic growth from 2014 sparked by falling oil prices and the effects of the Ukrainian crisis The country devalued its currency by 19% in February 2014.\"Tenge Fever\", The Economist, 22 February 2014 Another 22% devaluation occurred in August 2015.[https://www.nytimes.com/2015/08/21/business/international/kazakhstans-currency-plunges.html Kazakhstan's currency plunges], New York Times, 21 August 2015 Kazakhstan was ranked 52nd among 159 countries in the 2014 Economic Freedom of the World report published by Fraser Institute in September 2016. The country improved three spots compared to the previous year.\n\nDespite the slowdown in economic growth, the living wage per capita in Kazakhstan increased on average by 7.8% in April 2016 compared to April 2015.\n\nPrivatization 2016 - 2020\n\nIn December 2015, Kazakhstan Government approved new privatization plan for 2016 - 2020. It is a large-scale privatization program that continues the privatization of 2014 and includes 60 major state-owned companies. According to Kazakh Finance ministry, the state budget got 6.99 billion tenges ($20.6 million) from the deals reached within the 2014-2016 privatization program as of Sept. 20, 2016. Kazakhstan’s privatization program aims to reduce the state participation in the economy to 15 percent, which is the level set for countries of the Organization for Economic Cooperation and Development (OECD).\n\nOther information\n\nIn recent years a trade route has been established between Kazakhstan and the United States. It now makes up 54% of the World's salt imports and exports by volume (350,000 tonnes per year).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Economy of Kazakhstan" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16647" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The economy of Kazakhstan is the largest economy in Central Asia. It possesses enormous oil reserves as well as minerals and metals.  It also has considerable agricultural potential with its vast steppe lands accommodating both livestock and grain production, as well as developed space infrastructure, which took over all launches to the International Space Station from the Space Shuttle.  The mountains in the south are important for apples and walnuts; both species grow wild there. Kazakhstan's industrial sector rests on the extraction and processing of these natural resources and also on a relatively large machine building sector specializing in construction equipment, tractors, agricultural machinery, and some military items.\n\nThe breakup of the USSR and the collapse of demand for Kazakhstan's traditional heavy industry products have resulted in a sharp contraction of the economy since 1991, with the steepest annual decline occurring in 1994. In 1995-97 the pace of the government program of economic reform and privatization quickened, resulting in a substantial shifting of assets into the private sector. The December 1996 signing of the Caspian Pipeline Consortium agreement to build a new pipeline from western Kazakhstan's Tengiz Field to the Black Sea increases prospects for substantially larger oil exports in several years. Kazakhstan's economy turned downward in 1998 with a 2.5% decline in GDP growth due to slumping oil prices and the August financial crisis in Russia. A bright spot in 1999 was the recovery of international petroleum prices, which, combined with a well-timed tenge devaluation and a bumper grain harvest, pulled the economy out of recession.\n\nCurrent GDP per capita shrank by 26% in the Nineties. In the 2000s, Kazakhstan's economy grew sharply, aided by increased prices on world markets for Kazakhstan's leading exports—oil, metals and grain. GDP grew 9.6% in 2000, up from 1.7% in 1999. In 2006, extremely high GDP growth had been sustained, and grew by 10.6%.  Business with booming Russia and China, as well as neighboring Commonwealth of Independent States (CIS) nations have helped to propel this growth.  The increased economic growth also led to a turn-around in government finances, with the budget moving from a cash deficit of 3.7% of GDP in 1999 to 0.1% surplus in 2000. The country experienced a slowdown in economic growth from 2014 sparked by falling oil prices and the effects of the Ukrainian crisis[http://www.ft.com/intl/cms/s/0/c4a55aa6-dd04-11e3-b73c-00144feabdc0.html#axzz3mCiNSOzr Kazakhs battle to stave off chill blowing in from Russian steppe], Financial Times, 21 May 2014 The country's currency was devalued by 19% in 2004 and by 22% in 2015.\n\nIn 2015, the World Economic Forum compiled its Global Competitiveness Ranking ranking Kazakhstan 50th out of 144 countries. The ranking considers multiple macroeconomic and financial factors, such as market size, GDP, tax rates, infrastructure development, etc. In 2012, the World Economic Forum listed corruption as the biggest problem in doing business in the country,[https://books.google.com/books?idBU7uK583X8MC&pg\nPA112&lpgPA112&dq\nkazakhstan+corruption+ranking&sourcebl&ots\nZI50X8c9BL&sigTiPEPwdRpIq41eJ1a5PxX_GsgYs&hl\nen&saX&ved\n0CFcQ6AEwBTgKahUKEwib2f2FzYPIAhVmcHIKHePYBpE#vonepage&q\nkazakhstan%20corruption%20ranking&ffalse OECD Investment Policy Reviews], P112, OECD, 2012 while the World Bank listed Kazakhstan as a corruption hotspot, on a par with Angola, Bolivia, Kenya, Libya and Pakistan.[https://www.nytimes.com/2006/11/05/business/yourmoney/05giffen.html?pagewanted\nall Oil, Cash and Corruption], New York Times, 5 November 2006\n\nThe World Bank Vice President for Europe and Central Asia, Cyril Muller, visited Astana in January 2017, where he praised the country's progress made during the 25-year partnership with the World Bank. Muller also talked about Kazakhstan's improved positioning in the World Bank's Doing Business Report 2017, where Kazakhstan ranked 35th out of 190 countries worldwide.\n\nKazakhstan secured 2nd position in the Central and South Asia regional ranking of the 2015 Global Innovation Index (GII) released by World Intellectual Property Organization (WIPO) together with Cornell University and INSEAD France.\n\nKazakhstan is listed in the 2016 Bloomberg Innovation Index among the top 50 most innovative economies. Kazakhstan improved its position in the 2017 Bloomberg Innovation Index by 2 spots ranking 48th, with a total score of 45.56.\n\nMacro-economic trend\n\nIn the 2014 Economic Freedom Index published by The Heritage Foundation in Washington, DC, Kazakhstan has gained 22 points over the past 17 years, which is noted by the authors as among the 20 best improvements recorded by any country. Kazakhstan ranks 11th out of 42 countries in the Asia–Pacific region, and its overall score is above the world and regional averages.\n\nThis chart shows trends in the gross domestic product of Kazakhstan at market prices estimated by the International Monetary Fund, with figures in millions of Kazakhstani tenge.\n\nFor purchasing-power parity comparisons, the US Dollar is exchanged at 59.95 Tenges only. Mean wages comprised $6.93 per man-hour in 2009.\n\nKazakhstan has managed its monetary policy well. Its principal challenge in 2001 was to manage strong foreign-currency inflows without sparking inflation. Inflation had, in fact, stayed under control, registering 9.8% in 2000, and appeared likely to be under 10% in 2001. Because of its strong economic performance and financial health, Kazakhstan became the first former Soviet republic to repay all of its debt to the IMF by paying back $400 million in 2000; 7 years ahead of schedule. Overall foreign debt amounts to about $12.5 billion, $4 billion of it owed by the government. This amounts to 6.9% of GDP, well within manageable levels. Experts believe that Kazakhstan may soon be added to the MSCI Emerging Markets Index.\n\nThe upturn in economic growth, combined with the results of earlier reforms in taxation and in the financial sector, dramatically improved government finances from the 1998 budget deficit level of 4.2% of GDP to a slight surplus in 2000. Government tax-revenues grew from 16.4% of GDP in 1999 to 20.6% of GDP in 2000. In 2000, Kazakhstan adopted a new tax-code in an effort to consolidate these gains. Its strong financial position also allowed the government to reduce the value-added tax (VAT) from 20% to 16% and to reduce social (payroll) taxes as of July 2001. Kazakhstan's stronger budget-position and strong export-earnings earned it credit-rating upgrades from Moody's, S&P, and Fitch during 2001.\n\nKazakhstan instituted a pension reform program in 1998 that was partly based on the model of the Chilean pension system but included modifications. By July 2001, Kazakhstanis had contributed more than $1 billion to their own personal pension-accounts, mostly managed by the private sector. The National Bank oversees and regulates the pension funds. The pension funds' growing demand for quality investment outlets triggered rapid development of the debt-securities market. Pension-fund capital is being invested almost exclusively in corporate and government bonds, including Government of Kazakhstan Eurobonds. The Kazakhstani banking system is developing rapidly. Banking systems capitalization now exceeds $1 billion. The National Bank has introduced deposit insurance in its campaign to strengthen the banking sector. Several major foreign banks have branches in Kazakhstan, including The Royal Bank of Scotland Group, Citibank, and HSBC. Kazakhstan is also a member of the Economic Cooperation Organization (ECO).\n\nAccording to the Republic of Kazakhstan Agency for Statistics, in January–March 2010 production of GDP amounted to 3,881.6 billion tenge and an increase of 7.1%.\n\nEconomic growth and GDP \n\nKazakhstan's GDP grew 4.1% in real terms during the period from January to September 2014.\n\nKazakhstan's real GDP growth is projected to reach 4.3% in 2014, the main driving force of the economy in Kazakhstan in 2014 is the consumer sector; the consumption in Kazakhstan is mainly boosted by the retail lending.\n\nAccording to the Agency of Statistics of the Republic of Kazakhstan the Kazakhstan's GDP growth in the first quarter of 2014 was 3.8%.\n\nThe Government of Kazakhstan signed a Framework Partnership Agreement with IBRD, IFC, MIGA on May 1, 2014; according to this Agreement the World Bank will allocate $2.5 billion to Kazakhstan, for the diversification of the economy and reaching the sustainable development.\n\nAs of 2015, the World Bank classified Kazakhstan as an upper-middle-income country with GDP per capita of nearly US$10.5 thousand.\n\nForeign direct investment increased 30 percent in 2015 in Kazakhstan’s agricultural industry and 80 percent in the country’s petroleum products sector.\n\nIn 2016 Kazakhstan's economy started to recover from the crisis caused by low oil prices and the tenge devaluation. According to the Minister of National Economy of Kazakhstan, in nine months of 2016 the GDP growth reached 0.4%. Sectors of economy that experienced the highest growth included construction (6.9%), agriculture (4.9%), and transport sector (4.0%).\n\nSectors of economy\n\nPrimary\n\nEnergy\n\nKazakhstan is the leading country in the world for uranium production volumes with 35% of global production, and it has the world's second biggest uranium reserves after Australia.\n\nOil and gas\n\nOil and gas is the leading economic sector. In 2000, Kazakhstan produced 35,252,000 metric tons of oil (700,000 barrels per day), a 17.4% increase over 1999's 30,025,000 tons. It exported 28,883,000 tons of oil in 2000, up 38.8% from 20,813,000 tons in 1999. Production in 2001 has been growing at roughly 20%, on target to meet the government's forecast of 40,100,000 tons of oil (800,000 barrels per day). In 2000, production reached 11.5 km³ of natural gas, up from 8.2 km³ in 1999.\n\nKazakhstan has the potential to be a world-class oil exporter in the medium term. The landmark foreign investment in Kazakhstan is the TengizChevroil joint venture, owned 50% by ChevronTexaco, 25% by ExxonMobil, 20% by KazMunaiGas of Kazakhstan, and 5% by LukArco of Russia. The Karachaganak natural gas and gas condensate field is being developed by BG, Agip, ChevronTexaco, and Lukoil. The Agip-led Offshore Kazakhstan Consortium has discovered potentially huge Kashagan oil field in the northern Caspian. Kazakhstan's economic future is linked to oil and gas development. GDP growth will depend on the price of oil, as well as the ability to develop new deposits.\n\nMining\n\nKazakhstan is a leading producer of many mineral commodities, including salt, uranium, ferrochrome, titanium sponge, cadmium, potassium, magnesium, rhenium, copper, bauxite, gallium and zinc.\n\nIndustry\n\nMotor cars\n\nIn June 2014 the CKD (Complete Knock-Down) assembly of Toyota Fortuner was launched in Kostanay, Kazakhstan. The expected annual output makes around 3,000 cars: 250 a month.\n\nThe Kazakhstan's car industry was developing rapidly in 2014 producing $2 billion worth of products annually. By 2018 the car industry in Kazakhstan is expected to reach 190,000 cars per year.\n\nRail\n\nGE Transportation acquired 50% stake in Lokomotiv Kurastyru Zauyty in a joint venture with Kazakhstan's national railway company Temir Zholy.\n\nServices\n\nTechnology\n\nOn 22 December 2014 the World Bank approved an $88 million loan that would support Kazakhstan’s efforts to facilitate commercially and socially viable innovation in technology. The Fostering Productive Innovation Project aims to improve the country in areas that are able to foster and support technological innovation.\n\nRetail\n\nAccording to A.T. Kearney's 2015 Global Retail Development Index, Kazakhstan ranked 13 out of 30. In the 2016th Index, Kazakhstan ranked as the 4th best developing country for retail investments, scoring 56.5 out of 100. Kazakhstan's market attracted large international retailers, such as French retail chains Carrefour and Leroy Merlin, as well as food giants McDonald's and KFC.\n\nTourism \n\n*Tourism in Kazakhstan\n\nExternal trade and investment\n\nTrade\n\nSherin Suzhikova, Counselor of Kazakhstan's Chamber of Commerce and Industry and Chao yon-chuan, Secretary-General of the Taiwan External Trade Development Council, signed an agreement on 13 October 2006 in Taipei to improve economic relations through \"exchanges of market information and visits by trade professionals.\" TAITRA has an office in Almaty, Kazakhstan.http://english.www.gov.tw/TaiwanHeadlines/index.jsp?recordid\n25753&action=CNA\n\nIn 2006, North Dakota's then Lieutenant Governor Jack Dalrymple led an 18-member delegation of the North Dakota Trade Office representing seven North Dakota companies and Dickinson State University on a trip to Kazakhstan, Ukraine and Russia. North Dakota exports mostly machinery to Kazakhstan, the eighth largest destination for North Dakotan exports; machinery exports increased from $22,000 to $25 million between 2000 and 2005.\n\nThe percentage of high-tech exports (as a share of manufactured exports) from Kazakhstan have grown from just 4.46% in 1995 to 37.17% in 2014. One of the main factors that triggered this growth was the Technology Commercialization Project developed and implemented by the World Bank Group and the Kazakh Government. Through this project, 65 Kazakh tech startups received funding and training helping them get their innovations into markets.\n\nChina is Kazakhstan's important trade partner. In late March 2015 the two countries signed 33 deals worth $23.6 billion. The deals cover different industries, such as oil refining, cars, steel.\n\nDuring the press conference on July 20, 2015 Minister of Investment and Development of Kazakhstan said: \"As of today, we export about 850 types of goods. Kazakhstan is among the top-50 best exporting countries globally and takes the 49th place.\"\n\nForeign direct investment\n\nKazakhstan is the largest recipient of total and annual foreign direct investment of all CIS countries.\nThe OECD has recognized the strides the government has made in opening the country to international investment and in improving the policy framework for investment as part of their efforts to diversify the economy. In 2017 Kazakhstan was invited by OECD to become Adherent to the OECD Declaration on International Investment and Multinational Enterprises.  \n\nIn June 2014 Kazakhstan's President, Nursultan Nazarbayev, signed into law tax concessions to promote foreign investment, including a 10-year exemption from corporation tax, an 8-year exemption from property tax, and a 10-year freeze on most other taxes. Other measures include a refund on capital investments of up to 30 percent once a production facility is in operation. In order to attract investment, Kazakhstan lowered the tax burden for foreign investors. The corporate income tax rate dropped from 30% to 20%. The government also gradually reduced VAT from 16% in 2006 to 12% in 2009.\n\nAs of September 30, 2014, total foreign investment in Kazakhstan reached USD 211.5 billion. Of that total, net foreign Direct Investment constituted USD 129.3 billion, with portfolio and other investments comprising the remaining USD 82.2 billion.\n\nAs of July 2015, Kazakhstan attracted $16 billion in the manufacturing industry over the past five years, which is 2.5 times more than over the previous five years. Kazakhstan put into operation four hundred new products, such as car industry, railway engineering, manufacture of basic chemical products, uranium industry, the industry of rare earth metals. The volume of new enterprises amounted to 580 billion tenge.\n\nIn June 2015 – June 2016 the total number of enterprises owned by foreign investors in Kazakhstan increased by 2.3 percent and reached 9,000. 8,691 foreign companies operating in the Kazakhstan are small businesses.\n\nAs of the beginning of 2016, the World Bank invested over $6.8 billion in Kazakhstan since 1992. These funds were invested in development of roads and social infrastructure, increasing of competitiveness of SME's, education, healthcare, environment protection, etc.\n\nIn 2012, Kazakhstan conducted the first review of the OECD investment standards, which resulted in 12 recommendations on how to improve the investment climate of the country. After adopting Law on public - private partnership that extends the use of the mechanism and revising standards of intellectual property protection and the rules of attracting foreign labor, Kazakhstan started a second review of the OECD in 2016.\n\nAccording to Ministry of Investment and Development of Kazakhstan, as of May 2016, attraction of foreign investment in oil refining increased by 80%, food industry - 30%, in engineering - by 7 times. The Ministry also reported that there were 200 investment projects in country worth more than $40 billion.\n\nIn mid-2016 a group of companies led by Chevron announced a $36.8 billion investment in Kazakhstan's Tengiz oil field.\n\nIn the first quarter of 2016, Kazakhstan attracted $2.7 billion in foreign direct investment. The largest investor in the Kazakh economy is The Netherlands ($66 billion), followed by the United States ($26 billion) and Switzerland ($15 billion). According to the Chairman of Kazakhstan National Bank, a key factor triggering the increased inflow of foreign investment is implementation of the Nurly Zhol state program that provides for the creation of favorable conditions. As of September 2016, foreign investments in the Kazakh economy totaled $5.7 billion, which is 4,8% more than during the same period of the previous year.\n\nSummarizing 2016, Kazakhstan's Foreign Minister Erlan Idrissov noted that Kazakhstan attracted $20 billion of foreign direct investment during the year. The gross inflow of foreign direct investment in 2016 grew by 40% compared to 2015 and surpassed the previous record of 2008. The number of foreign businesses operating in Kazakhstan increased 25% in 2016 compared to 2015. The main recipients of foreign direct investment were the mining industry, geological exploration and processing. The top four investors include the Netherlands, the United States, Switzerland and France.\n\nKazakhstan introduced a visa-free regime for citizens of EAEU, OECD, Monaco, Malaysia, United Arab Emirates, and Singapore starting from 2017. The visa-free entry is expected to increase cooperation with investors and businesses of these countries.\n\nAgriculture is one of Kazakhstan's most important sectors where the country seeks to attract foreign investments to boost the competitiveness of this sector of economy. To that end, in 2017 KazAgro negotiated with the European Investment Bank (EIB) a €200 million loan for a period of 15 years.\n\nIntellectual property\n\nKazakhstan has legislatively addressed the issues of Legal Regulation of Intellectual Property, patent law, and copyright protections.\n\nPublic policy\n\nNew Economic Policy \"Nurly Zhol\"\n\nOn November 11, 2014 in his address to the nation for 2015 Nursultan Nazarbayev proclaimed Kazakhstan’s New Economic Policy – The Path to the Future (Nurly Zhol). The new economic policy implies massive state investment in infrastructure over the next several years. In the short term, the program \"Nurly Zhol\" will apply the anti-crisis measures to overcome the turbulence in the global economy. The long-term measures of the state program of infrastructure development will help to create a strong platform for new growth.\n\nKazakhstan has identified five priorities for modernization of the state and the economy to maintain competitiveness in the Fourth Industrial Revolution.\n\nDoing business in Kazakhstan\n\nKazakhstan was ranked 35th in the Ease of Doing Business report released by the World Bank Group in October 2016. In the previous rating Kazakhstan was on the 51st place. The report's methodology implies that higher rankings (a low numerical value) indicate better, usually simpler, regulations for businesses and stronger protections of property rights.\n\nThe Heritage Foundation, a Washington DC - based research center, ranked Kazakhstan 42nd in its Index of Economic Freedom 2017. Previous year, Kazakhstan ranked 69th. According to the Heritage Foundation, Kazakhstan's improved ranking in 2017 is explained by its \"beneficial structural reforms.\" \n\nKazakhstan aims to boost economy by attracting private investors interested in developing national companies. This is the main goal of privatization that is expected to decrease the share of public property to 15% of GDP. Such companies as Kazakhstan Railways, Samruk-Energo, Kazatomprom, Kaspost, KazMunayGas and Air Astana are expected to be sold through IPO.\n\nKazakhstan climbed from the 47th to the 32nd place in the 2017 IMD World Competitiveness ranking. The report evaluates business efficiency, public finance and domestic economy.\n\nSmall and medium-sized enterprises\n\nA new program to support small businesses was launched in Kazakhstan in February 2015. 2015 is expected to be a pilot period of the program. During that period the initiative will be focused on three major areas, notably agribusiness, machinery building and production of construction materials, and is to be further extended to other industries.\n\nAccording to the Global Entrepreneurship Monitor-2014, Kazakhstan has a very positive image of the entrepreneurs. Nearly 70 percent of the population sees entrepreneurship as a good choice for building a career and achieving a high status in the society. Kazakhstan can also boast one of the lowest closing index, according to the Global Entrepreneurship Monitor-2014, meaning that only 2.9% of entrepreneurs were forced to cease their business.\n\nAnother important business trend in Kazakhstan is the growing role of women in this field. Over 50% of entrepreneurs in Kazakhstan are women.\n\nIn May 2015 the European Bank for Reconstruction and Development (EBRD) and the government of Kazakhstan have signed three agreements to provide €41 million for technical cooperation projects, advisory support to small and medium-sized enterprises (SMEs) and a Women in Business program. This initiative demonstrates that Kazakhstan invests in developing women businesses and supports diversity in this field.\n\nIn 2016 the number of Kazakhstan's telecom start-ups increased by 10% compared to 2015. Around 9,400 small telecom companies are currently registered in the country.\n\n2014 and 2015 developments\n\nThe country experienced a slowdown in economic growth from 2014 sparked by falling oil prices and the effects of the Ukrainian crisis The country devalued its currency by 19% in February 2014.\"Tenge Fever\", The Economist, 22 February 2014 Another 22% devaluation occurred in August 2015.[https://www.nytimes.com/2015/08/21/business/international/kazakhstans-currency-plunges.html Kazakhstan's currency plunges], New York Times, 21 August 2015 Kazakhstan was ranked 52nd among 159 countries in the 2014 Economic Freedom of the World report published by Fraser Institute in September 2016. The country improved three spots compared to the previous year.\n\nDespite the slowdown in economic growth, the living wage per capita in Kazakhstan increased on average by 7.8% in April 2016 compared to April 2015.\n\nPrivatization 2016 - 2020\n\nIn December 2015, Kazakhstan Government approved new privatization plan for 2016 - 2020. It is a large-scale privatization program that continues the privatization of 2014 and includes 60 major state-owned companies. According to Kazakh Finance ministry, the state budget got 6.99 billion tenges ($20.6 million) from the deals reached within the 2014-2016 privatization program as of Sept. 20, 2016. Kazakhstan’s privatization program aims to reduce the state participation in the economy to 15 percent, which is the level set for countries of the Organization for Economic Cooperation and Development (OECD).\n\nOther information\n\nIn recent years a trade route has been established between Kazakhstan and the United States. It now makes up 54% of the World's salt imports and exports by volume (350,000 tonnes per year). Economy of Kazakhstan. http://en.wikipedia.org/?curid=16647."
  }
}
