{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16441",
  "eid" : "2617a420-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573154,
  "textBody" : "Julia Carolyn Child (born McWilliams; August 15, 1912 – August 13, 2004) was an American chef, author and television personality. She is recognized for bringing French cuisine to the American public with her debut cookbook, Mastering the Art of French Cooking, and her subsequent television programs, the most notable of which was The French Chef, which premiered in 1963.\n\nChildhood and education\n\nJulia Child was born Julia Carolyn McWilliams in 1912 Pasadena, California, the daughter of John McWilliams, Jr., a Princeton University graduate and prominent land manager, and his wife, the former Julia Carolyn (\"Caro\") Weston, a paper-company heiress whose father, Byron Curtis Weston, served as lieutenant governor of Massachusetts. Child was the eldest of three, followed by a brother, John McWilliams III, and sister, Dorothy Cousins.\n\nIn high school, Child was sent to the Katherine Branson School in Ross, California, which was at the time a boarding school. At six feet, two inches (1.88 m) tall, Child played tennis, golf, and basketball as a child and continued to play sports while attending Smith College, from which she graduated in 1934 with a major in History. A press release issued by Smith in 2004 states that her major was history.\n\nChild grew up with a cook who served her family. She did not observe or learn how to cook from the family's cook. Her grandmother from Illinois would make doughnuts and crullers. Child did not learn to cook until she met her would-be husband, Paul, who grew up in a family very interested in food.\n\nFollowing her graduation from college, Child moved to New York City, where she worked as a copywriter for the advertising department of W. & J. Sloane.\n\nWorld War II\n\nChild joined the Office of Strategic Services (OSS) after finding that she was too tall to enlist in the Women's Army Corps (WACs) or in the U.S. Navy's WAVES. She began her OSS career as a typist at its headquarters in Washington, but because of her education and experience soon was given a more responsible position as a top secret researcher working directly for the head of OSS, General William J. Donovan.  \n\nAs a research assistant in the Secret Intelligence division, she typed 10,000 names on white note cards to keep track of officers. For a year, she worked at the OSS Emergency Rescue Equipment Section (ERES) in Washington, D.C. as a file clerk and then as an assistant to developers of a shark repellent needed to ensure that sharks would not explode ordnance targeting German U-boats. In 1944, she was posted to Kandy, Ceylon (now Sri Lanka), where her responsibilities included \"registering, cataloging and channeling a great volume of highly classified communications\" for the OSS's clandestine stations in Asia. She was later posted to Kunming, China, where she received the Emblem of Meritorious Civilian Service as head of the Registry of the OSS Secretariat. When Child was asked to solve the problem of too many OSS underwater explosives being set off by curious sharks, \"Child's solution was to experiment with cooking various concoctions as a shark repellent,\" which were sprinkled in the water near the explosives and repelled sharks. Still in use today, the experimental shark repellent \"marked Child's first foray into the world of cooking...\" For her service, Child received an award that cited her many virtues, including her \"drive and inherent cheerfulness.\" As with other OSS records, her file was declassified in 2008; however, unlike other files, her complete file is available online. [https://research.archives.gov/description/2180661 ARC Identifier 2180661], [https://www.archives.gov/research/arc/topics/oss-personnel/ Office of Strategic Services Personnel Files from World War II]\n\nWhile in Kunming, she met Paul Cushing Child, also an OSS employee, and the two were married September 1, 1946, in Lumberville, Pennsylvania, later moving to Washington, D.C. A New Jersey native who had lived in Paris as an artist and poet, Paul was known for his sophisticated palate, and introduced his wife to fine cuisine. He joined the United States Foreign Service, and in 1948 the couple moved to Paris when the US State Department assigned Paul there as an exhibits officer with the United States Information Agency. The couple had no children.\n\nPost-war France\n\nChild repeatedly recalled her first meal in Rouen as a culinary revelation; once, she described the meal of oysters, sole meunière, and fine wine to The New York Times as \"an opening up of the soul and spirit for me.\" In Paris, she attended the famous Le Cordon Bleu cooking school and later studied privately with Max Bugnard and other master chefs. She joined the women's cooking club Le Cercle des Gourmettes, through which she met Simone Beck, who was writing a French cookbook for Americans with her friend Louisette Bertholle. Beck proposed that Child work with them, to make the book appeal to Americans. In 1951, Child, Beck, and Bertholle began to teach cooking to American women in Child's Paris kitchen, calling their informal school L'école des trois gourmandes (The School of the Three Food Lovers). For the next decade, as the Childs moved around Europe and finally to Cambridge, Massachusetts, the three researched and repeatedly tested recipes. Child translated the French into English, making the recipes detailed, interesting, and practical.\n\nIn 1963, the Childs built a home near the Provence town of Plascassier in the hills above Cannes on property belonging to co-author Simone Beck and her husband, Jean Fischbacher. The Childs named it \"La Pitchoune\", a Provençal word meaning \"the little one\" but over time the property was often affectionately referred to simply as \"La Peetch\".\n\nMedia career\n\nThe three would-be authors initially signed a contract with publisher Houghton Mifflin, which later rejected the manuscript for seeming too much like an encyclopedia. Finally, when it was first published in 1961 by Alfred A. Knopf, the 726-page Mastering the Art of French Cooking was a best-seller and received critical acclaim that derived in part from the American interest in French culture in the early 1960s. Lauded for its helpful illustrations and precise attention to detail, and for making fine cuisine accessible, the book is still in print and is considered a seminal culinary work. Following this success, Child wrote magazine articles and a regular column for The Boston Globe newspaper. She would go on to publish nearly twenty titles under her name and with others. Many, though not all, were related to her television shows. Her last book was the autobiographical My Life in France, published posthumously in 2006 and written with her grandnephew, Alex Prud'homme. The book recounts Child's life with her husband, Paul Child, in post-World War II France.\n\nThe French Chef and related books\n\nA 1962 appearance on a book review show on what was then the National Educational Television (NET) station of Boston, WGBH-TV (now a major Public Broadcasting Service station), led to the inception of her first television cooking show after viewers enjoyed her demonstration of how to cook an omelette. The French Chef had its debut on February 11, 1963, on WGBH and was immediately successful. The show ran nationally for ten years and won Peabody and Emmy Awards, including the first Emmy award for an educational program. Though she was not the first television cook, Child was the most widely seen. She attracted the broadest audience with her cheery enthusiasm, distinctively warbly voice, and unpatronizing and unaffected manner. In 1972, The French Chef became the first television program to be captioned for the deaf, even though this was done using the preliminary technology of open-captioning.\n\nChild's second book, The French Chef Cookbook, was a collection of the recipes she had demonstrated on the show. It was soon followed in 1971 by Mastering the Art of French Cooking, Volume Two, again in collaboration with Simone Beck, but not with Louisette Bertholle, with whom the professional relationship had ended. Child's fourth book, From Julia Child's Kitchen, was illustrated with her husband's photographs and documented the color series of The French Chef, as well as provided an extensive library of kitchen notes compiled by Child during the course of the show.\n\nImpact on American households \n\nJulia Child had a large impact on American households and housewives. Because of the technology in the 60s, the show was unedited, causing her blunders to appear in the final version and ultimately lend \"authenticity and approachability to television.\" Toby Miller. “Screening Food: French Cuisine and the Television Palate.” In French Food: On the Table, On the Page, and in French Culture. P. 224 According to Toby Miller in \"Screening Food: French Cuisine and the Television Palate,\" one mother he spoke to said that sometimes \"all that stood between me and insanity was hearty Julia Child\" because of Child's ability to soothe and transport her. In addition, Miller notes that Child's show began before the feminist movement of the 1960s, which meant that the issues housewives and women faced were somewhat ignored on television.Toby Miller. “Screening Food: French Cuisine and the Television Palate.” In French Food: On the Table, On the Page, and in French Culture. P. 226\n\nLater career\n\nIn the 1970s and 1980s, she was the star of numerous television programs, including Julia Child & Company, Julia Child & More Company and Dinner at Julia's. For the 1979 book Julia Child and More Company, she won a National Book Award in category Current Interest.\n[http://www.nationalbook.org/nba1980.html \"National Book Awards – 1980\"]. National Book Foundation. Retrieved 2012-03-09. There was a \"Contemporary\" or \"Current\" award category from 1972 to 1980. In 1981, she founded the American Institute of Wine & Food, with vintners Robert Mondavi and Richard Graff, and others, to \"advance the understanding, appreciation and quality of wine and food,\" a pursuit she had already begun with her books and television appearances. In 1989, she published what she considered her magnum opus, a book and instructional video series collectively entitled The Way To Cook.\n\nChild starred in four more series in the 1990s that featured guest chefs: Cooking with Master Chefs, In Julia's Kitchen with Master Chefs, Baking with Julia, and Julia Child & Jacques Pépin Cooking at Home. She collaborated with Jacques Pépin many times for television programs and cookbooks. All of Child's books during this time stemmed from the television series of the same names.\n\nChild's use of ingredients like butter and cream has been questioned by food critics and modern-day nutritionists. She addressed these criticisms throughout her career, predicting that a \"fanatical fear of food\" would take over the country's dining habits, and that focusing too much on nutrition takes the pleasure from enjoying food. In a 1990 interview, Child said, \"Everybody is overreacting. If fear of food continues, it will be the death of gastronomy in the United States. Fortunately, the French don't suffer from the same hysteria we do. We should enjoy food and have fun. It is one of the simplest and nicest pleasures in life.\"\n\n Julia Child's kitchen, designed by her husband, was the setting for three of her television shows. It is now on display at the National Museum of American History in Washington, D.C. Beginning with In Julia's Kitchen with Master Chefs, the Childs' home kitchen in Cambridge was fully transformed into a functional set, with TV-quality lighting, three cameras positioned to catch all angles in the room, and a massive center island with a gas stovetop on one side and an electric stovetop on the other, but leaving the rest of the Childs' appliances alone, including \"my wall oven with its squeaking door.\" This kitchen backdrop hosted nearly all of Child's 1990s television series.\n\nCriticism\n\nDespite Child's popularity with professional cooks and the American public, some writers have criticized Child's work. In The Taste of America, a compendium of American food written by John Hess and Karen Hess, the authors  claimed that Julia Child is partly responsible in a \"betrayal of original American ideals,\" causing American cuisine to deteriorate in quality and taste. According to the Hesses, Child performs this betrayal by recommending inferior commercial products as substitutes for the original ingredients, trying to make food more appealing to the Americans by making it sweet, and using the idea of \"Frenchness\" to give food value instead of its taste.\n\nLast years and death\n\nAfter the death of her beloved friend Simone Beck, Child relinquished La Pitchoune after a month long stay in June 1992 with her family, her niece, Phila, and close friend and biographer Noël Riley Fitch. She turned the keys over to Jean Fischbacher's sister, just as she and Paul had promised nearly 30 years earlier. Also in 1992, Julia spent five days in Sicily at the invitation of Regaleali Winery. American journalist Bob Spitz spent a brief time with Julia during that period while he was researching and writing his then working title, History of Eating and Cooking in America. In 1993, Child provided the voice of Dr. Bleeb in the animated film, We're Back! A Dinosaur's Story.\n\nSpitz took notes and made many recordings of his conversation with Child, and these later formed the basis of a secondary biography on Child, published August 7, 2012 (Knopf), five days before the centennial of her birthdate.[http://www.ctvnews.ca/entertainment/biography-reveals-insecurities-plagued-julia-child-1.913561 \"Biography reveals insecurities plagued Julia Child\"], CTV News, August 7, 2012 Paul Child, who was ten years older than his wife, died in 1994 after living in a nursing home for five years following a series of strokes in 1989.\n\nIn 2001, Child moved to a retirement community, donating her house and office to Smith College, which later sold the house.\n\nShe donated her kitchen, which her husband designed with high counters to accommodate her height, and which served as the set for three of her television series, to the National Museum of American History, where it is now on display. Her iconic copper pots and pans were on display at Copia in Napa, California, until August 2009 when they were reunited with her kitchen at the Smithsonian's National Museum of American History in Washington, D.C.\n\nIn 2000, Child received the French Legion of Honour and was elected a Fellow of the American Academy of Arts and Sciences in 2000. She was awarded the U.S. Presidential Medal of Freedom in 2003; she received honorary doctorates from Harvard University, Johnson & Wales University (1995), Smith College (her alma mater), Brown University (2000), and several other universities.\n\nOn August 13, 2004, Child died of kidney failure in Montecito, California, two days before\nher 92nd birthday. Her last meal was French onion soup. Child ended her last book, My Life in France, with \"... thinking back on it now reminds that the pleasures of the table, and of life, are infinite – toujours bon appétit!\"\n\nLegacy\n\nThe Julia Child Foundation\n\nIn 1995, Julia Child established The Julia Child Foundation for Gastronomy and Culinary Arts, a private charitable foundation to make grants to further her life's work. The Foundation, originally set up in Massachusetts, later moved to Santa Barbara, California, where it is now headquartered. Inactive until after Julia's death in 2004, the Foundation makes grants to other non-profits. The grants support primarily gastronomy, the culinary arts and the further development of the professional food world, all matters of paramount importance to Julia Child during her lifetime. The Foundation's website provides a dedicated page listing the names of grant recipients with a description of the organization and the grant provided by the Foundation. One of the grant recipients is Heritage Radio Network which covers the world of food, drink and agriculture.\n\nBeyond making grants, the Foundation was also established to protect Julia Child's legacy; it is the organization to approach to seek permission to use images of Julia Child and/or excerpts of her work. Many of these rights are jointly held with other organizations like her publishers and the Schlesinger Library at The Radcliffe Institute at Harvard University who may also need to be contacted. Recently, the Foundation has been more active in protecting these posthumous rights. Well known for her opposition to endorsements, the Foundation follows a similar policy regarding the use of Julia's name and image for commercial purposes.\n\nTributes and homages\n\nThe Julia Child rose, known in the UK as the \"Absolutely Fabulous\" rose, is a golden butter/gold floribunda rose named after Child.[https://www.nytimes.com/2007/06/22/arts/22rose.html?pagewanted\nall Romancing the Rose in Its Infinite Splendor], Glenn Collins, June 22, 2007, New York Times\n\nOn September 26, 2014, the US Postal Service issued 20 million copies of the \"Celebrity Chefs Forever\" stamp series, which featured portraits by Jason Seiler of five American chefs: Julia Child, Joyce Chen, James Beard, Edna Lewis, and Felipe Rojas-Lombardi.\n\nAwards and nominations\n\nAwards\n*1965: Peabody Award for Personal Award for The French Chef\n*1966: Emmy for Achievements in Educational Television- Individuals for The French Chef\n*1980: U.S. National Book Awards for Current Interest (hardcover) for Julia Child and More Company\n*1996: Daytime Emmy Award for Outstanding Service Show Host for In Julia's Kitchen with Master Chefs\n*2001: Daytime Emmy Award for Outstanding Service Show Host for Julia & Jacques Cooking at Home\n\nNominations\n*1972: Emmy for Special Classification of Outstanding Program and Individual Achievement – General Programming for The French Chef\n*1994: Emmy for Outstanding Informational Series for Cooking with Master Chefs\n*1997: Daytime Emmy Award for Outstanding Service Show Host for Baking with Julia\n*1999: Daytime Emmy Award for Outstanding Service Show Host for Baking with Julia\n*2000: Daytime Emmy Award for Outstanding Service Show Host for Julia & Jacques Cooking at Home\n\nIn popular culture\n\nChild was a favorite of audiences from the moment of her television debut on public television in 1963, and she was a familiar part of American culture and the subject of numerous references, including numerous parodies in television and radio programs and skits. Her great success on air may have been tied to her refreshingly pragmatic approach to the genre, \"I think you have to decide who your audience is. If you don’t pick your audience, you’re lost because you’re not really talking to anybody. My audience is people who like to cook, who want to really learn how to do it.\"\nIn 1996, Julia Child was ranked No. 46 on TV Guide's 50 Greatest TV Stars of All Time.\n\nIn music\n\n* The Bobs' 2013 song \"Julia's Too Tall\" (from the album Biographies) is an a cappella and rap retelling of Child's rise to prominence—including her early days working for the U.S. government as an intelligence research assistant (\"Her time was well spent / She got acknowledgement / She even helped develop shark repellent!\"). The title is a reference to her ineligibility for certain military service due to her height. (\"She's too tall to be a spy / But not too tall to bake a pie...\")\n* The YouTube series Epic Rap Battles of History featured Child (portrayed by Mamrie Hart) in a rap battle against Scottish celebrity chef Gordon Ramsay (portrayed by Lloyd \"EpicLLOYD\" Alquist) in the 2nd episode of its 5th season.\n\nOn stage\n\n* Jean Stapleton portrayed Child in a 1989 one-woman short musical play, Bon Appétit!, based on one of Child's televised cooking lessons. The title derived from her famous TV sign-off \"Bon appétit!\"\n\nIn film\n\n* In 1993, Child was the voice of Dr. Juliet Bleeb in the children's film We're Back! A Dinosaur's Story.\n* In the film Mrs. Doubtfire Robin Williams, disguised as a woman, viewed Julia Child's videos in order to learn how to cook to keep up appearances of being an excellent nanny.\n* See Julie/Julia below.\n* In the film The Money Pit, starring Tom Hanks, Child appears in a television clip.\n* In the film Don't Tell Mom the Babysitter's Dead, the character Kenny watches Julia Child on television to learn how to cook.\n* In the film Desperately Seeking Susan, starring Madonna and Rosanna Arquette, Rosanna Arquette's character watches Child while cooking dinner.\n\nIn print\n\n* In 1966, Child was featured on the cover of Time with the heading, \"Our Lady of the Ladle\".\n\nOn television\n\n* She was the inspiration for the character \"Julia Grownup\" on the Children's Television Workshop program, The Electric Company (1971–1977).\n* In a 1978 Saturday Night Live sketch (episode 74), she was parodied by Dan Aykroyd, who—as Julia Child—continued with a cooking show despite ludicrously profuse bleeding from a cut to his thumb, and eventually expired while advising, \"Save the liver.\" Child reportedly loved this sketch so much she showed it to friends at parties.\n* She was parodied on The Cosby Show in the 1984 episode \"Bon Jour Sondra\" by characters Cliff and Theo Huxtable.\n*She appeared in an episode of This Old House as designer of the kitchen. This Old House was launched in 1979 by Russell Morash, who helped create The French Chef with Julia Child.[https://www.amazon.com/This-Old-House-Dream-VHS/dp/B00000F0P4 This Old House: A Dream House] \n* In 1982, she was portrayed by John Candy in a sketch for Second City Television, \"Battle of the PBS Stars,\" in which she took part in a boxing match against fellow PBS star Mr. Rogers, who was parodied by Martin Short. She lost the match after a taking multiple blows to the head from Rogers' puppet King Friday.\n* In 2014, she was portrayed on Episode 5 of RuPaul's Drag Race (season 6) by Dan Donigan, known as Milk on the show, as part of the Snatch Game challenge.\n* In episode 9 of season 4 on Comedy Central's show Drunk History, Lyric Lewis gets drunk and tells a story through Julia Child's perspective first as a spy in World War Two \n\nJulie/Julia\n\nIn 2002, Child was the inspiration for \"The Julie/Julia Project,\" a popular cooking blog by Julie Powell that was the basis of Powell's bestselling book, Julie and Julia: 365 Days, 524 Recipes, 1 Tiny Apartment Kitchen, published in 2005, the year following Child's death. The paperback version of the book was retitled Julie and Julia: My Year of Cooking Dangerously. The blog and book, along with Child's own memoir My Life in France, in turn inspired the 2009 feature film Julie & Julia in which Meryl Streep portrayed Child. For her performance, Streep received an Academy Award for Best Actress nomination.\n\nChild is reported to have been unimpressed by Powell's blog, believing Powell's determination to cook every recipe in Mastering the Art of French Cooking in a year to be a stunt. Child's editor, Judith Jones, said in an interview: \n\nTwitch\n\nOn March 15, 2016, Twitch.tv started to stream Julia Child's show The French Chef. This event was in celebration of both the launch of the cooking section of Twitch.tv and the anniversary of Child's graduation from Le Cordon Bleu.\n\nWorks\n\nTelevision series\n\n* The French Chef (1963–1973)\n* Julia Child & Company (1978–1979)\n* Julia Child & More Company (1980–1982)\n* Dinner at Julia's (1983–1985)\n* The Way To Cook (1989) six one-hour videocassettes\n* A Birthday Party for Julia Child: Compliments to the Chef (1992)\n* Cooking with Master Chefs: Hosted by Julia Child (1993–1994) 16 episodes\n* Cooking In Concert: Julia Child & Jacques Pépin (1993)\n* In Julia's Kitchen with Master Chefs (1994–1996), 39 episodes\n* Cooking in Concert: Julia Child & Jacques Pepin (1995)\n* Baking with Julia (1996–1998) 39 episodes\n* Julia & Jacques Cooking at Home (1999–2000) 22 episodes\n* Julia Child's Kitchen Wisdom, (2000) two-hour special\n\nDVD releases\n\n* Julia Child's Kitchen Wisdom (2000)\n* Julia and Jacques: Cooking at Home (2003)\n* Julia Child: America's Favorite Chef (2004)\n* The French Chef: Volume One (2005)\n* The French Chef: Volume Two (2005)\n* Julia Child! The French Chef (2006)\n* The Way To Cook (2009)\n* Baking With Julia (2009)\n\nBooks\n\n* Mastering the Art of French Cooking (1961), with Simone Beck and Louisette Bertholle\n* The French Chef Cookbook (1968)—\n* Mastering the Art of French Cooking, Volume Two (1970), with Simone Beck—\n* From Julia Child's Kitchen (1975)—\n* Julia Child & Company (1978)—\n* Julia Child & More Company (1979)—\n* The Way To Cook (1989)—\n* Julia Child's Menu Cookbook (1991), one-volume edition of Julia Child & Company and Julia Child & More Company—\n* Cooking With Master Chefs (1993)—\n* In Julia's Kitchen with Master Chefs (1995)—\n* Baking with Julia (1996)—\n* Julia's Delicious Little Dinners (1998)—\n* Julia's Menus For Special Occasions (1998)—\n* Julia's Breakfasts, Lunches & Suppers (1999)—\n* Julia's Casual Dinners (1999)—\n* Julia and Jacques Cooking at Home (1999), with Jacques Pépin—\n* Julia's Kitchen Wisdom (2000)—\n* My Life in France (2006, posthumous), with Alex Prud'homme—\n* (collected in) American Food Writing: An Anthology with Classic Recipes, ed. Molly O'Neill (Library of America, 2007) \n\nBooks about Child\n\n* \n* \n* \n* \n* \n* \n* \n\nFilms about Child\n\n*Produced by WGBH, a one-hour feature documentary, Julia Child! America's Favorite Chef, was aired as the first episode of the 18th season of the PBS series American Masters (2004). The film combined archive footage of Child with current footage from those who influenced and were influenced by her life and work.\n*Julie & Julia (2009) is a film adapted by Nora Ephron from Child's memoir My Life in France and from Julie Powell's memoir. Meryl Streep played Child. The film won a Golden Globe Award for Best Actress in a Leading Role in a Musical or Comedy.\n*A film titled Primordial Soup With Julia Child was on display at the Smithsonian National Air and Space Museum's Life in the Universe gallery from 1976 until the gallery closed.\n*Keep On Cooking – Julia Child Remixed: A video produced for PBS by John D. Boswell as part of the PBS Icons Remixed series in commemoration of Child's 100th birthday. Child's voice is auto-tuned to a melody derived from vocal samples, with synchronized video clips from Child's various television series.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Julia Child" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16441" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Julia Carolyn Child (born McWilliams; August 15, 1912 – August 13, 2004) was an American chef, author and television personality. She is recognized for bringing French cuisine to the American public with her debut cookbook, Mastering the Art of French Cooking, and her subsequent television programs, the most notable of which was The French Chef, which premiered in 1963.\n\nChildhood and education\n\nJulia Child was born Julia Carolyn McWilliams in 1912 Pasadena, California, the daughter of John McWilliams, Jr., a Princeton University graduate and prominent land manager, and his wife, the former Julia Carolyn (\"Caro\") Weston, a paper-company heiress whose father, Byron Curtis Weston, served as lieutenant governor of Massachusetts. Child was the eldest of three, followed by a brother, John McWilliams III, and sister, Dorothy Cousins.\n\nIn high school, Child was sent to the Katherine Branson School in Ross, California, which was at the time a boarding school. At six feet, two inches (1.88 m) tall, Child played tennis, golf, and basketball as a child and continued to play sports while attending Smith College, from which she graduated in 1934 with a major in History. A press release issued by Smith in 2004 states that her major was history.\n\nChild grew up with a cook who served her family. She did not observe or learn how to cook from the family's cook. Her grandmother from Illinois would make doughnuts and crullers. Child did not learn to cook until she met her would-be husband, Paul, who grew up in a family very interested in food.\n\nFollowing her graduation from college, Child moved to New York City, where she worked as a copywriter for the advertising department of W. & J. Sloane.\n\nWorld War II\n\nChild joined the Office of Strategic Services (OSS) after finding that she was too tall to enlist in the Women's Army Corps (WACs) or in the U.S. Navy's WAVES. She began her OSS career as a typist at its headquarters in Washington, but because of her education and experience soon was given a more responsible position as a top secret researcher working directly for the head of OSS, General William J. Donovan.  \n\nAs a research assistant in the Secret Intelligence division, she typed 10,000 names on white note cards to keep track of officers. For a year, she worked at the OSS Emergency Rescue Equipment Section (ERES) in Washington, D.C. as a file clerk and then as an assistant to developers of a shark repellent needed to ensure that sharks would not explode ordnance targeting German U-boats. In 1944, she was posted to Kandy, Ceylon (now Sri Lanka), where her responsibilities included \"registering, cataloging and channeling a great volume of highly classified communications\" for the OSS's clandestine stations in Asia. She was later posted to Kunming, China, where she received the Emblem of Meritorious Civilian Service as head of the Registry of the OSS Secretariat. When Child was asked to solve the problem of too many OSS underwater explosives being set off by curious sharks, \"Child's solution was to experiment with cooking various concoctions as a shark repellent,\" which were sprinkled in the water near the explosives and repelled sharks. Still in use today, the experimental shark repellent \"marked Child's first foray into the world of cooking...\" For her service, Child received an award that cited her many virtues, including her \"drive and inherent cheerfulness.\" As with other OSS records, her file was declassified in 2008; however, unlike other files, her complete file is available online. [https://research.archives.gov/description/2180661 ARC Identifier 2180661], [https://www.archives.gov/research/arc/topics/oss-personnel/ Office of Strategic Services Personnel Files from World War II]\n\nWhile in Kunming, she met Paul Cushing Child, also an OSS employee, and the two were married September 1, 1946, in Lumberville, Pennsylvania, later moving to Washington, D.C. A New Jersey native who had lived in Paris as an artist and poet, Paul was known for his sophisticated palate, and introduced his wife to fine cuisine. He joined the United States Foreign Service, and in 1948 the couple moved to Paris when the US State Department assigned Paul there as an exhibits officer with the United States Information Agency. The couple had no children.\n\nPost-war France\n\nChild repeatedly recalled her first meal in Rouen as a culinary revelation; once, she described the meal of oysters, sole meunière, and fine wine to The New York Times as \"an opening up of the soul and spirit for me.\" In Paris, she attended the famous Le Cordon Bleu cooking school and later studied privately with Max Bugnard and other master chefs. She joined the women's cooking club Le Cercle des Gourmettes, through which she met Simone Beck, who was writing a French cookbook for Americans with her friend Louisette Bertholle. Beck proposed that Child work with them, to make the book appeal to Americans. In 1951, Child, Beck, and Bertholle began to teach cooking to American women in Child's Paris kitchen, calling their informal school L'école des trois gourmandes (The School of the Three Food Lovers). For the next decade, as the Childs moved around Europe and finally to Cambridge, Massachusetts, the three researched and repeatedly tested recipes. Child translated the French into English, making the recipes detailed, interesting, and practical.\n\nIn 1963, the Childs built a home near the Provence town of Plascassier in the hills above Cannes on property belonging to co-author Simone Beck and her husband, Jean Fischbacher. The Childs named it \"La Pitchoune\", a Provençal word meaning \"the little one\" but over time the property was often affectionately referred to simply as \"La Peetch\".\n\nMedia career\n\nThe three would-be authors initially signed a contract with publisher Houghton Mifflin, which later rejected the manuscript for seeming too much like an encyclopedia. Finally, when it was first published in 1961 by Alfred A. Knopf, the 726-page Mastering the Art of French Cooking was a best-seller and received critical acclaim that derived in part from the American interest in French culture in the early 1960s. Lauded for its helpful illustrations and precise attention to detail, and for making fine cuisine accessible, the book is still in print and is considered a seminal culinary work. Following this success, Child wrote magazine articles and a regular column for The Boston Globe newspaper. She would go on to publish nearly twenty titles under her name and with others. Many, though not all, were related to her television shows. Her last book was the autobiographical My Life in France, published posthumously in 2006 and written with her grandnephew, Alex Prud'homme. The book recounts Child's life with her husband, Paul Child, in post-World War II France.\n\nThe French Chef and related books\n\nA 1962 appearance on a book review show on what was then the National Educational Television (NET) station of Boston, WGBH-TV (now a major Public Broadcasting Service station), led to the inception of her first television cooking show after viewers enjoyed her demonstration of how to cook an omelette. The French Chef had its debut on February 11, 1963, on WGBH and was immediately successful. The show ran nationally for ten years and won Peabody and Emmy Awards, including the first Emmy award for an educational program. Though she was not the first television cook, Child was the most widely seen. She attracted the broadest audience with her cheery enthusiasm, distinctively warbly voice, and unpatronizing and unaffected manner. In 1972, The French Chef became the first television program to be captioned for the deaf, even though this was done using the preliminary technology of open-captioning.\n\nChild's second book, The French Chef Cookbook, was a collection of the recipes she had demonstrated on the show. It was soon followed in 1971 by Mastering the Art of French Cooking, Volume Two, again in collaboration with Simone Beck, but not with Louisette Bertholle, with whom the professional relationship had ended. Child's fourth book, From Julia Child's Kitchen, was illustrated with her husband's photographs and documented the color series of The French Chef, as well as provided an extensive library of kitchen notes compiled by Child during the course of the show.\n\nImpact on American households \n\nJulia Child had a large impact on American households and housewives. Because of the technology in the 60s, the show was unedited, causing her blunders to appear in the final version and ultimately lend \"authenticity and approachability to television.\" Toby Miller. “Screening Food: French Cuisine and the Television Palate.” In French Food: On the Table, On the Page, and in French Culture. P. 224 According to Toby Miller in \"Screening Food: French Cuisine and the Television Palate,\" one mother he spoke to said that sometimes \"all that stood between me and insanity was hearty Julia Child\" because of Child's ability to soothe and transport her. In addition, Miller notes that Child's show began before the feminist movement of the 1960s, which meant that the issues housewives and women faced were somewhat ignored on television.Toby Miller. “Screening Food: French Cuisine and the Television Palate.” In French Food: On the Table, On the Page, and in French Culture. P. 226\n\nLater career\n\nIn the 1970s and 1980s, she was the star of numerous television programs, including Julia Child & Company, Julia Child & More Company and Dinner at Julia's. For the 1979 book Julia Child and More Company, she won a National Book Award in category Current Interest.\n[http://www.nationalbook.org/nba1980.html \"National Book Awards – 1980\"]. National Book Foundation. Retrieved 2012-03-09. There was a \"Contemporary\" or \"Current\" award category from 1972 to 1980. In 1981, she founded the American Institute of Wine & Food, with vintners Robert Mondavi and Richard Graff, and others, to \"advance the understanding, appreciation and quality of wine and food,\" a pursuit she had already begun with her books and television appearances. In 1989, she published what she considered her magnum opus, a book and instructional video series collectively entitled The Way To Cook.\n\nChild starred in four more series in the 1990s that featured guest chefs: Cooking with Master Chefs, In Julia's Kitchen with Master Chefs, Baking with Julia, and Julia Child & Jacques Pépin Cooking at Home. She collaborated with Jacques Pépin many times for television programs and cookbooks. All of Child's books during this time stemmed from the television series of the same names.\n\nChild's use of ingredients like butter and cream has been questioned by food critics and modern-day nutritionists. She addressed these criticisms throughout her career, predicting that a \"fanatical fear of food\" would take over the country's dining habits, and that focusing too much on nutrition takes the pleasure from enjoying food. In a 1990 interview, Child said, \"Everybody is overreacting. If fear of food continues, it will be the death of gastronomy in the United States. Fortunately, the French don't suffer from the same hysteria we do. We should enjoy food and have fun. It is one of the simplest and nicest pleasures in life.\"\n\n Julia Child's kitchen, designed by her husband, was the setting for three of her television shows. It is now on display at the National Museum of American History in Washington, D.C. Beginning with In Julia's Kitchen with Master Chefs, the Childs' home kitchen in Cambridge was fully transformed into a functional set, with TV-quality lighting, three cameras positioned to catch all angles in the room, and a massive center island with a gas stovetop on one side and an electric stovetop on the other, but leaving the rest of the Childs' appliances alone, including \"my wall oven with its squeaking door.\" This kitchen backdrop hosted nearly all of Child's 1990s television series.\n\nCriticism\n\nDespite Child's popularity with professional cooks and the American public, some writers have criticized Child's work. In The Taste of America, a compendium of American food written by John Hess and Karen Hess, the authors  claimed that Julia Child is partly responsible in a \"betrayal of original American ideals,\" causing American cuisine to deteriorate in quality and taste. According to the Hesses, Child performs this betrayal by recommending inferior commercial products as substitutes for the original ingredients, trying to make food more appealing to the Americans by making it sweet, and using the idea of \"Frenchness\" to give food value instead of its taste.\n\nLast years and death\n\nAfter the death of her beloved friend Simone Beck, Child relinquished La Pitchoune after a month long stay in June 1992 with her family, her niece, Phila, and close friend and biographer Noël Riley Fitch. She turned the keys over to Jean Fischbacher's sister, just as she and Paul had promised nearly 30 years earlier. Also in 1992, Julia spent five days in Sicily at the invitation of Regaleali Winery. American journalist Bob Spitz spent a brief time with Julia during that period while he was researching and writing his then working title, History of Eating and Cooking in America. In 1993, Child provided the voice of Dr. Bleeb in the animated film, We're Back! A Dinosaur's Story.\n\nSpitz took notes and made many recordings of his conversation with Child, and these later formed the basis of a secondary biography on Child, published August 7, 2012 (Knopf), five days before the centennial of her birthdate.[http://www.ctvnews.ca/entertainment/biography-reveals-insecurities-plagued-julia-child-1.913561 \"Biography reveals insecurities plagued Julia Child\"], CTV News, August 7, 2012 Paul Child, who was ten years older than his wife, died in 1994 after living in a nursing home for five years following a series of strokes in 1989.\n\nIn 2001, Child moved to a retirement community, donating her house and office to Smith College, which later sold the house.\n\nShe donated her kitchen, which her husband designed with high counters to accommodate her height, and which served as the set for three of her television series, to the National Museum of American History, where it is now on display. Her iconic copper pots and pans were on display at Copia in Napa, California, until August 2009 when they were reunited with her kitchen at the Smithsonian's National Museum of American History in Washington, D.C.\n\nIn 2000, Child received the French Legion of Honour and was elected a Fellow of the American Academy of Arts and Sciences in 2000. She was awarded the U.S. Presidential Medal of Freedom in 2003; she received honorary doctorates from Harvard University, Johnson & Wales University (1995), Smith College (her alma mater), Brown University (2000), and several other universities.\n\nOn August 13, 2004, Child died of kidney failure in Montecito, California, two days before\nher 92nd birthday. Her last meal was French onion soup. Child ended her last book, My Life in France, with \"... thinking back on it now reminds that the pleasures of the table, and of life, are infinite – toujours bon appétit!\"\n\nLegacy\n\nThe Julia Child Foundation\n\nIn 1995, Julia Child established The Julia Child Foundation for Gastronomy and Culinary Arts, a private charitable foundation to make grants to further her life's work. The Foundation, originally set up in Massachusetts, later moved to Santa Barbara, California, where it is now headquartered. Inactive until after Julia's death in 2004, the Foundation makes grants to other non-profits. The grants support primarily gastronomy, the culinary arts and the further development of the professional food world, all matters of paramount importance to Julia Child during her lifetime. The Foundation's website provides a dedicated page listing the names of grant recipients with a description of the organization and the grant provided by the Foundation. One of the grant recipients is Heritage Radio Network which covers the world of food, drink and agriculture.\n\nBeyond making grants, the Foundation was also established to protect Julia Child's legacy; it is the organization to approach to seek permission to use images of Julia Child and/or excerpts of her work. Many of these rights are jointly held with other organizations like her publishers and the Schlesinger Library at The Radcliffe Institute at Harvard University who may also need to be contacted. Recently, the Foundation has been more active in protecting these posthumous rights. Well known for her opposition to endorsements, the Foundation follows a similar policy regarding the use of Julia's name and image for commercial purposes.\n\nTributes and homages\n\nThe Julia Child rose, known in the UK as the \"Absolutely Fabulous\" rose, is a golden butter/gold floribunda rose named after Child.[https://www.nytimes.com/2007/06/22/arts/22rose.html?pagewanted\nall Romancing the Rose in Its Infinite Splendor], Glenn Collins, June 22, 2007, New York Times\n\nOn September 26, 2014, the US Postal Service issued 20 million copies of the \"Celebrity Chefs Forever\" stamp series, which featured portraits by Jason Seiler of five American chefs: Julia Child, Joyce Chen, James Beard, Edna Lewis, and Felipe Rojas-Lombardi.\n\nAwards and nominations\n\nAwards\n*1965: Peabody Award for Personal Award for The French Chef\n*1966: Emmy for Achievements in Educational Television- Individuals for The French Chef\n*1980: U.S. National Book Awards for Current Interest (hardcover) for Julia Child and More Company\n*1996: Daytime Emmy Award for Outstanding Service Show Host for In Julia's Kitchen with Master Chefs\n*2001: Daytime Emmy Award for Outstanding Service Show Host for Julia & Jacques Cooking at Home\n\nNominations\n*1972: Emmy for Special Classification of Outstanding Program and Individual Achievement – General Programming for The French Chef\n*1994: Emmy for Outstanding Informational Series for Cooking with Master Chefs\n*1997: Daytime Emmy Award for Outstanding Service Show Host for Baking with Julia\n*1999: Daytime Emmy Award for Outstanding Service Show Host for Baking with Julia\n*2000: Daytime Emmy Award for Outstanding Service Show Host for Julia & Jacques Cooking at Home\n\nIn popular culture\n\nChild was a favorite of audiences from the moment of her television debut on public television in 1963, and she was a familiar part of American culture and the subject of numerous references, including numerous parodies in television and radio programs and skits. Her great success on air may have been tied to her refreshingly pragmatic approach to the genre, \"I think you have to decide who your audience is. If you don’t pick your audience, you’re lost because you’re not really talking to anybody. My audience is people who like to cook, who want to really learn how to do it.\"\nIn 1996, Julia Child was ranked No. 46 on TV Guide's 50 Greatest TV Stars of All Time.\n\nIn music\n\n* The Bobs' 2013 song \"Julia's Too Tall\" (from the album Biographies) is an a cappella and rap retelling of Child's rise to prominence—including her early days working for the U.S. government as an intelligence research assistant (\"Her time was well spent / She got acknowledgement / She even helped develop shark repellent!\"). The title is a reference to her ineligibility for certain military service due to her height. (\"She's too tall to be a spy / But not too tall to bake a pie...\")\n* The YouTube series Epic Rap Battles of History featured Child (portrayed by Mamrie Hart) in a rap battle against Scottish celebrity chef Gordon Ramsay (portrayed by Lloyd \"EpicLLOYD\" Alquist) in the 2nd episode of its 5th season.\n\nOn stage\n\n* Jean Stapleton portrayed Child in a 1989 one-woman short musical play, Bon Appétit!, based on one of Child's televised cooking lessons. The title derived from her famous TV sign-off \"Bon appétit!\"\n\nIn film\n\n* In 1993, Child was the voice of Dr. Juliet Bleeb in the children's film We're Back! A Dinosaur's Story.\n* In the film Mrs. Doubtfire Robin Williams, disguised as a woman, viewed Julia Child's videos in order to learn how to cook to keep up appearances of being an excellent nanny.\n* See Julie/Julia below.\n* In the film The Money Pit, starring Tom Hanks, Child appears in a television clip.\n* In the film Don't Tell Mom the Babysitter's Dead, the character Kenny watches Julia Child on television to learn how to cook.\n* In the film Desperately Seeking Susan, starring Madonna and Rosanna Arquette, Rosanna Arquette's character watches Child while cooking dinner.\n\nIn print\n\n* In 1966, Child was featured on the cover of Time with the heading, \"Our Lady of the Ladle\".\n\nOn television\n\n* She was the inspiration for the character \"Julia Grownup\" on the Children's Television Workshop program, The Electric Company (1971–1977).\n* In a 1978 Saturday Night Live sketch (episode 74), she was parodied by Dan Aykroyd, who—as Julia Child—continued with a cooking show despite ludicrously profuse bleeding from a cut to his thumb, and eventually expired while advising, \"Save the liver.\" Child reportedly loved this sketch so much she showed it to friends at parties.\n* She was parodied on The Cosby Show in the 1984 episode \"Bon Jour Sondra\" by characters Cliff and Theo Huxtable.\n*She appeared in an episode of This Old House as designer of the kitchen. This Old House was launched in 1979 by Russell Morash, who helped create The French Chef with Julia Child.[https://www.amazon.com/This-Old-House-Dream-VHS/dp/B00000F0P4 This Old House: A Dream House] \n* In 1982, she was portrayed by John Candy in a sketch for Second City Television, \"Battle of the PBS Stars,\" in which she took part in a boxing match against fellow PBS star Mr. Rogers, who was parodied by Martin Short. She lost the match after a taking multiple blows to the head from Rogers' puppet King Friday.\n* In 2014, she was portrayed on Episode 5 of RuPaul's Drag Race (season 6) by Dan Donigan, known as Milk on the show, as part of the Snatch Game challenge.\n* In episode 9 of season 4 on Comedy Central's show Drunk History, Lyric Lewis gets drunk and tells a story through Julia Child's perspective first as a spy in World War Two \n\nJulie/Julia\n\nIn 2002, Child was the inspiration for \"The Julie/Julia Project,\" a popular cooking blog by Julie Powell that was the basis of Powell's bestselling book, Julie and Julia: 365 Days, 524 Recipes, 1 Tiny Apartment Kitchen, published in 2005, the year following Child's death. The paperback version of the book was retitled Julie and Julia: My Year of Cooking Dangerously. The blog and book, along with Child's own memoir My Life in France, in turn inspired the 2009 feature film Julie & Julia in which Meryl Streep portrayed Child. For her performance, Streep received an Academy Award for Best Actress nomination.\n\nChild is reported to have been unimpressed by Powell's blog, believing Powell's determination to cook every recipe in Mastering the Art of French Cooking in a year to be a stunt. Child's editor, Judith Jones, said in an interview: \n\nTwitch\n\nOn March 15, 2016, Twitch.tv started to stream Julia Child's show The French Chef. This event was in celebration of both the launch of the cooking section of Twitch.tv and the anniversary of Child's graduation from Le Cordon Bleu.\n\nWorks\n\nTelevision series\n\n* The French Chef (1963–1973)\n* Julia Child & Company (1978–1979)\n* Julia Child & More Company (1980–1982)\n* Dinner at Julia's (1983–1985)\n* The Way To Cook (1989) six one-hour videocassettes\n* A Birthday Party for Julia Child: Compliments to the Chef (1992)\n* Cooking with Master Chefs: Hosted by Julia Child (1993–1994) 16 episodes\n* Cooking In Concert: Julia Child & Jacques Pépin (1993)\n* In Julia's Kitchen with Master Chefs (1994–1996), 39 episodes\n* Cooking in Concert: Julia Child & Jacques Pepin (1995)\n* Baking with Julia (1996–1998) 39 episodes\n* Julia & Jacques Cooking at Home (1999–2000) 22 episodes\n* Julia Child's Kitchen Wisdom, (2000) two-hour special\n\nDVD releases\n\n* Julia Child's Kitchen Wisdom (2000)\n* Julia and Jacques: Cooking at Home (2003)\n* Julia Child: America's Favorite Chef (2004)\n* The French Chef: Volume One (2005)\n* The French Chef: Volume Two (2005)\n* Julia Child! The French Chef (2006)\n* The Way To Cook (2009)\n* Baking With Julia (2009)\n\nBooks\n\n* Mastering the Art of French Cooking (1961), with Simone Beck and Louisette Bertholle\n* The French Chef Cookbook (1968)—\n* Mastering the Art of French Cooking, Volume Two (1970), with Simone Beck—\n* From Julia Child's Kitchen (1975)—\n* Julia Child & Company (1978)—\n* Julia Child & More Company (1979)—\n* The Way To Cook (1989)—\n* Julia Child's Menu Cookbook (1991), one-volume edition of Julia Child & Company and Julia Child & More Company—\n* Cooking With Master Chefs (1993)—\n* In Julia's Kitchen with Master Chefs (1995)—\n* Baking with Julia (1996)—\n* Julia's Delicious Little Dinners (1998)—\n* Julia's Menus For Special Occasions (1998)—\n* Julia's Breakfasts, Lunches & Suppers (1999)—\n* Julia's Casual Dinners (1999)—\n* Julia and Jacques Cooking at Home (1999), with Jacques Pépin—\n* Julia's Kitchen Wisdom (2000)—\n* My Life in France (2006, posthumous), with Alex Prud'homme—\n* (collected in) American Food Writing: An Anthology with Classic Recipes, ed. Molly O'Neill (Library of America, 2007) \n\nBooks about Child\n\n* \n* \n* \n* \n* \n* \n* \n\nFilms about Child\n\n*Produced by WGBH, a one-hour feature documentary, Julia Child! America's Favorite Chef, was aired as the first episode of the 18th season of the PBS series American Masters (2004). The film combined archive footage of Child with current footage from those who influenced and were influenced by her life and work.\n*Julie & Julia (2009) is a film adapted by Nora Ephron from Child's memoir My Life in France and from Julie Powell's memoir. Meryl Streep played Child. The film won a Golden Globe Award for Best Actress in a Leading Role in a Musical or Comedy.\n*A film titled Primordial Soup With Julia Child was on display at the Smithsonian National Air and Space Museum's Life in the Universe gallery from 1976 until the gallery closed.\n*Keep On Cooking – Julia Child Remixed: A video produced for PBS by John D. Boswell as part of the PBS Icons Remixed series in commemoration of Child's 100th birthday. Child's voice is auto-tuned to a melody derived from vocal samples, with synchronized video clips from Child's various television series. Julia Child. http://en.wikipedia.org/?curid=16441."
  }
}
