{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10404",
  "eid" : "f59a4fa0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778491802,
  "textBody" : "Esperanto speakers have their own culture, on top of being a \"gateway\" to the culture of the entire world (inherently more-so than most other dominant languages are). As examples, gufujoj exist, and Esperanto speakers will talk about what would normally be considered extremely touchy subjects without restraint (such as political talk or questions about racism), even if they wouldn't do this in their home country or another language they know.\n\nIn general, Esperanto culture places a huge focus on reading, education (especially of news, facts and languages from around the world), tolerance and acceptance (especially of people completely different from yourself). Esperanto speakers are also more prone to being against globalization and culture-washing or throwing away one's native language, meaning that while they want to be able to talk to people they also want those people to \"stay unique\".\n\nNative speakers \n\nNative Esperanto speakers are people who have acquired Esperanto as one of their native languages.  As of 1996, there were 350 or so attested cases of families with native Esperanto speakers.Corsetti, Renato (1996). [http://www.ingentaconnect.com/content/jbp/lplp/1996/00000020/00000003/art00004 A mother tongue spoken mainly by fathers]. Language Problems and Language Planning 20: 3, 263-73 Estimates from associations indicate that there are currently around 1,000 Esperanto-speaking families, involving perhaps 2,000 children.Corsetti, Pinto, & Tolomeo (2004) \"[http://www.ingentaconnect.com/content/jbp/lplp/2004/00000028/00000003/art00003 Regularizing the regular]: The phenomenon of overregularization in Esperanto-speaking children\", Language Problems and Language Planning, 28:261–282  In all known cases, speakers are natively bilingual, or multilingual, raised in both Esperanto and either the local national language or the native language of their parents. In all but a handful of cases, it was the father who used Esperanto with the child. In the majority of such families, the parents had the same native language, though in many the parents had different native languages, and only Esperanto in common.Benjamin Bergen (2001), \"[http://www.cogsci.ucsd.edu/~bkbergen/papers/NEJCL.pdf Nativization processes in L1 Esperanto]\", Journal of Child Language 28:575–595 doi:10.1017/S0305000901004779\n\nGufujo\n\nEsperanto speakers create a makeshift café (whether in a rented space or someone's home), using Esperanto coins or voucher-like items as well as real money to pay for food and drink. Live music, poetry reading, or literature reading are usual activities. This custom arose in 1995 in order to contrast with the more usual custom of after-convention partying at a bar.\n\nReligion\n\nEsperanto has had an influence on certain religious traditions (Oomoto, Bahá'í Faith, etc., see Esperanto and religion). While some Esperantists subscribe to these beliefs, they are not necessarily common, and are certainly not required or encouraged by any Esperanto groups.\n\nLiterature\n\nBooks that are translated to Esperanto are not usually internationally famous books, because everyone can already read those in another language that they know. For example, Natsume Sōseki's \"Kokoro\" does not exist but several Japanese crime novels, and several Icelandic novels, that have never been translated to English (or any other language) have been translated to Esperanto. One reason for this is that people are actually translating their favourite stories instead of the famous stories, and another is that it's simply cheaper and easier to get the rights to translate a small-time book compared to a famous one.\n\nThe first Harry Potter book, for example, was translated and the translator enquired about how to purchase translating rights so the book could be published, but J.K. Rowling refused to allow it to be published in Esperanto (despite Harry Potter being one of the most-translated books in the whole world). In lieu of physical books, the translation now exists as a free download on the internet.\n\nAs Esperanto speakers were persecuted throughout WWII (Esperanto was banned in Germany and the Soviet Union), and even today might be mocked by journalists and the average person, oppression and acceptance have become strong themes in Esperanto writing and conversation.\n\nThere are over 25,000 Esperanto books (originals and translations) as well as over a hundred regularly distributed Esperanto magazines. This is despite that Esperanto has only existed for around 100 years. In comparison, the entire literature of Iceland (a country created in the 900s, and with a population of around 320,000 people) totals to fewer than 50,000 books.http://blog.archive.org/2011/01/29/all-icelandic-literature-to-go-online/\n\nPasporta Servo\n\nMany speakers travel the world using the Pasporta Servo which is a free couchsurfing and homestay service combined, meaning that their trips are possible because they don't have to pay for lodging while at the same time they stay with people who speak a language they know fluently. Many people have commented that this is also a useful tool for actual immigrants, as Esperanto speakers are normally much friendlier  and more willing to see the immigrant as a \"human\" compared to the normal natives of the country. For example, it's suggested that an English speaker in Japan should make friends with Esperanto speakers instead, because the Esperanto speakers won't \"simply use the friendship as a way to get free English lessons\".\n\nWriting\n\nEsperanto was originally a language that one had to learn entirely through books, and even today most people live apart from each other and converse through the internet, so writing and reading are a big part of Esperanto culture. Most people have created or translated some sort of written work whether fiction or nonfiction, published or available to read online for free.\n\nPenpals have been popular since Esperanto's earliest days, as Esperanto was originally advertised as a language where you could \"send a letter with a message, short list of grammar rules and a dictionary to a complete stranger, and they'll be able to look up the words and write a coherent reply back\". Many people did indeed do this in order to recruit more Esperanto speakers.\n\nAt the time, in the early 1900s, there was no major world language that could be used \"anywhere\" and it was difficult to get accurate information about foreign countries. On top of that, things like stamp collecting were popular hobbies for children. In the modern day, most Esperanto speakers talk to each other through the internet — which is just the modern version of a penpal.\n\nMonato (\"month\") is a general news magazine \"like a genuinely international Time or Newsweek\", written by local correspondents.\n\nA magazine for the blind, Aŭroro, has been published since 1920 and in general, Esperanto hosts the largest Braille publications in the world — starting in the early 1900s Esperanto was taught in schools of the blind in Europe, and that is where the trend started.\n\nEsperanto is the magazine used by the World Esperanto Association to inform its members about everything happening in the Esperanto community.\n\nThere are many more magazines created by individual Esperanto clubs from towns in places such as from Japan and China.\n\nConventions\n\nMany people wear their country's traditional clothing to Esperanto conventions, whether or not they would ever wear it in their own country. Swedish people, for example, who usually never wear their traditional clothing in their own country, may still wear traditional clothing for any meeting involving Esperanto speakers.\n\nEvery year, the World Congress of Esperanto (), which is held in different countries around the world according to year (though it mostly takes place in Europe). Each convention draws in an average of 1500–3000 attendees, and the best-attended conferences are those held in Central or Eastern Europe (generally meaning Poland, Hungary etc.), as Esperanto is an option for fulfilling mandatory foreign-language requirements in Hungarian schools, and the creator of Esperanto came from Poland (see statistics at World Congress of Esperanto).\n\nPopular culture\n\nEsperanto music is usually done in the traditional style of a person's country, but \"international\" music (American pop music, rap music etc.) also exists. Many famous songs are translated to Esperanto as well, for example \"[https://www.youtube.com/watch?vDxvUi_MQ3kg La vie en rose]\" and \"[https://www.youtube.com/watch?v\n3yHQxqvdjro En el frente de Gandesa]\" (the links are to the Esperanto versions of the songs on YouTube).\n\nThere are currently radio broadcasts from China Radio International, Melbourne Ethnic Community Radio, Radio Habana Cuba, Radio Audizioni Italiane (Rai), Radio Polonia, Radio F.R.E.I. and Radio Vatican. Many more people have personal podcasts and vlogs.\n\nIn 1964, Jacques-Louis Mahé produced the first full-length feature film in Esperanto, entitled Angoroj. This was followed in 1965 by the first American Esperanto-production: Incubus, starring William Shatner. Incubus is, however, seen as a common, joke way of first introducing a person to Esperanto as none of the actors even knew how to pronounce Esperanto in the first place, the dialogue is strange and bad due to the scriptwriter not getting a second opinion before the filming was done, and the plot is confusing in general.\n\nInternacia Televido, an internet television channel, began broadcasting in November 2005. Australia is the hotspot of much of the organization behind Esperanto television.\n\nSeveral short films have been produced, and at times plays have been recorded \"for television\". , the Esperanto-language Wikipedia lists 14 films and 3 short films.\n\nIn 2011, Academy Award-nominated director Sam Green (The Weather Underground), released a new documentary about Esperanto titled [http://esperantodocumentary.com/ The Universal Language] (La Universala Lingvo.) This 30-minute film traces the history of Esperanto. It's known for having extremely good camera quality and filming sense, as well as being a good \"absolute introduction\" to what Esperanto is, but is criticized for being too short.\n\nMany more films, cartoons and documentaries that aren't Esperanto originals are simply subtitled in Esperanto and put up on YouTube. Some fan-dubs exist, especially of Disney songs and short scenes, and the quality mirrors that of what would come from any small country or a country \"unused to technology\" (such as Greenland, Russia, etc.).\n\nFood\n\nAs Esperanto speakers are from all over the world, and families whose children speak Esperanto natively usually have parents from two vastly different countries, recipes incorporating elements from different countries are naturally born. Traditional foods are also enjoyed in settings where a native wouldn't normally mix or eat them.\n\nOne cookbook is Internacie kuiri “Cooking Internationally” by Maria Becker-Meisberger, published by FEL (Flemish Esperanto League), Antwerp 1989, . Another is Manĝoj el sanigaj plantoj  “Meals from Healthy Vegetable Dishes” by Zlata Nanić, published by BIO-ZRNO, Zagreb 2002, .\n\nSome Esperanto periodicals, such as MONATO include recipes from time to time.\n\nZamenhof Day\n\nOn December 15 (L. L. Zamenhof's birthday), Esperanto speakers around the world celebrate Zamenhof Day, sometimes called Book Day. It's a common goal to have a book written in Esperanto published on or by that day, as Zamenhof was a strong advocate of the idea that in order to spread Esperanto around the world, its speakers need to create a large body of literature.\n\nThe poem La Espero is the Esperanto anthem, and most Esperanto speakers know it by heart. It's often sung at conventions. Whether or not one enjoys the lyrics, the song is in general something that ties all Esperanto speakers together — as it's been around since Esperanto's early days, is known at least in tune to every Esperanto speaker, and is a general tradition.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Esperanto culture" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10404" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Esperanto speakers have their own culture, on top of being a \"gateway\" to the culture of the entire world (inherently more-so than most other dominant languages are). As examples, gufujoj exist, and Esperanto speakers will talk about what would normally be considered extremely touchy subjects without restraint (such as political talk or questions about racism), even if they wouldn't do this in their home country or another language they know.\n\nIn general, Esperanto culture places a huge focus on reading, education (especially of news, facts and languages from around the world), tolerance and acceptance (especially of people completely different from yourself). Esperanto speakers are also more prone to being against globalization and culture-washing or throwing away one's native language, meaning that while they want to be able to talk to people they also want those people to \"stay unique\".\n\nNative speakers \n\nNative Esperanto speakers are people who have acquired Esperanto as one of their native languages.  As of 1996, there were 350 or so attested cases of families with native Esperanto speakers.Corsetti, Renato (1996). [http://www.ingentaconnect.com/content/jbp/lplp/1996/00000020/00000003/art00004 A mother tongue spoken mainly by fathers]. Language Problems and Language Planning 20: 3, 263-73 Estimates from associations indicate that there are currently around 1,000 Esperanto-speaking families, involving perhaps 2,000 children.Corsetti, Pinto, & Tolomeo (2004) \"[http://www.ingentaconnect.com/content/jbp/lplp/2004/00000028/00000003/art00003 Regularizing the regular]: The phenomenon of overregularization in Esperanto-speaking children\", Language Problems and Language Planning, 28:261–282  In all known cases, speakers are natively bilingual, or multilingual, raised in both Esperanto and either the local national language or the native language of their parents. In all but a handful of cases, it was the father who used Esperanto with the child. In the majority of such families, the parents had the same native language, though in many the parents had different native languages, and only Esperanto in common.Benjamin Bergen (2001), \"[http://www.cogsci.ucsd.edu/~bkbergen/papers/NEJCL.pdf Nativization processes in L1 Esperanto]\", Journal of Child Language 28:575–595 doi:10.1017/S0305000901004779\n\nGufujo\n\nEsperanto speakers create a makeshift café (whether in a rented space or someone's home), using Esperanto coins or voucher-like items as well as real money to pay for food and drink. Live music, poetry reading, or literature reading are usual activities. This custom arose in 1995 in order to contrast with the more usual custom of after-convention partying at a bar.\n\nReligion\n\nEsperanto has had an influence on certain religious traditions (Oomoto, Bahá'í Faith, etc., see Esperanto and religion). While some Esperantists subscribe to these beliefs, they are not necessarily common, and are certainly not required or encouraged by any Esperanto groups.\n\nLiterature\n\nBooks that are translated to Esperanto are not usually internationally famous books, because everyone can already read those in another language that they know. For example, Natsume Sōseki's \"Kokoro\" does not exist but several Japanese crime novels, and several Icelandic novels, that have never been translated to English (or any other language) have been translated to Esperanto. One reason for this is that people are actually translating their favourite stories instead of the famous stories, and another is that it's simply cheaper and easier to get the rights to translate a small-time book compared to a famous one.\n\nThe first Harry Potter book, for example, was translated and the translator enquired about how to purchase translating rights so the book could be published, but J.K. Rowling refused to allow it to be published in Esperanto (despite Harry Potter being one of the most-translated books in the whole world). In lieu of physical books, the translation now exists as a free download on the internet.\n\nAs Esperanto speakers were persecuted throughout WWII (Esperanto was banned in Germany and the Soviet Union), and even today might be mocked by journalists and the average person, oppression and acceptance have become strong themes in Esperanto writing and conversation.\n\nThere are over 25,000 Esperanto books (originals and translations) as well as over a hundred regularly distributed Esperanto magazines. This is despite that Esperanto has only existed for around 100 years. In comparison, the entire literature of Iceland (a country created in the 900s, and with a population of around 320,000 people) totals to fewer than 50,000 books.http://blog.archive.org/2011/01/29/all-icelandic-literature-to-go-online/\n\nPasporta Servo\n\nMany speakers travel the world using the Pasporta Servo which is a free couchsurfing and homestay service combined, meaning that their trips are possible because they don't have to pay for lodging while at the same time they stay with people who speak a language they know fluently. Many people have commented that this is also a useful tool for actual immigrants, as Esperanto speakers are normally much friendlier  and more willing to see the immigrant as a \"human\" compared to the normal natives of the country. For example, it's suggested that an English speaker in Japan should make friends with Esperanto speakers instead, because the Esperanto speakers won't \"simply use the friendship as a way to get free English lessons\".\n\nWriting\n\nEsperanto was originally a language that one had to learn entirely through books, and even today most people live apart from each other and converse through the internet, so writing and reading are a big part of Esperanto culture. Most people have created or translated some sort of written work whether fiction or nonfiction, published or available to read online for free.\n\nPenpals have been popular since Esperanto's earliest days, as Esperanto was originally advertised as a language where you could \"send a letter with a message, short list of grammar rules and a dictionary to a complete stranger, and they'll be able to look up the words and write a coherent reply back\". Many people did indeed do this in order to recruit more Esperanto speakers.\n\nAt the time, in the early 1900s, there was no major world language that could be used \"anywhere\" and it was difficult to get accurate information about foreign countries. On top of that, things like stamp collecting were popular hobbies for children. In the modern day, most Esperanto speakers talk to each other through the internet — which is just the modern version of a penpal.\n\nMonato (\"month\") is a general news magazine \"like a genuinely international Time or Newsweek\", written by local correspondents.\n\nA magazine for the blind, Aŭroro, has been published since 1920 and in general, Esperanto hosts the largest Braille publications in the world — starting in the early 1900s Esperanto was taught in schools of the blind in Europe, and that is where the trend started.\n\nEsperanto is the magazine used by the World Esperanto Association to inform its members about everything happening in the Esperanto community.\n\nThere are many more magazines created by individual Esperanto clubs from towns in places such as from Japan and China.\n\nConventions\n\nMany people wear their country's traditional clothing to Esperanto conventions, whether or not they would ever wear it in their own country. Swedish people, for example, who usually never wear their traditional clothing in their own country, may still wear traditional clothing for any meeting involving Esperanto speakers.\n\nEvery year, the World Congress of Esperanto (), which is held in different countries around the world according to year (though it mostly takes place in Europe). Each convention draws in an average of 1500–3000 attendees, and the best-attended conferences are those held in Central or Eastern Europe (generally meaning Poland, Hungary etc.), as Esperanto is an option for fulfilling mandatory foreign-language requirements in Hungarian schools, and the creator of Esperanto came from Poland (see statistics at World Congress of Esperanto).\n\nPopular culture\n\nEsperanto music is usually done in the traditional style of a person's country, but \"international\" music (American pop music, rap music etc.) also exists. Many famous songs are translated to Esperanto as well, for example \"[https://www.youtube.com/watch?vDxvUi_MQ3kg La vie en rose]\" and \"[https://www.youtube.com/watch?v\n3yHQxqvdjro En el frente de Gandesa]\" (the links are to the Esperanto versions of the songs on YouTube).\n\nThere are currently radio broadcasts from China Radio International, Melbourne Ethnic Community Radio, Radio Habana Cuba, Radio Audizioni Italiane (Rai), Radio Polonia, Radio F.R.E.I. and Radio Vatican. Many more people have personal podcasts and vlogs.\n\nIn 1964, Jacques-Louis Mahé produced the first full-length feature film in Esperanto, entitled Angoroj. This was followed in 1965 by the first American Esperanto-production: Incubus, starring William Shatner. Incubus is, however, seen as a common, joke way of first introducing a person to Esperanto as none of the actors even knew how to pronounce Esperanto in the first place, the dialogue is strange and bad due to the scriptwriter not getting a second opinion before the filming was done, and the plot is confusing in general.\n\nInternacia Televido, an internet television channel, began broadcasting in November 2005. Australia is the hotspot of much of the organization behind Esperanto television.\n\nSeveral short films have been produced, and at times plays have been recorded \"for television\". , the Esperanto-language Wikipedia lists 14 films and 3 short films.\n\nIn 2011, Academy Award-nominated director Sam Green (The Weather Underground), released a new documentary about Esperanto titled [http://esperantodocumentary.com/ The Universal Language] (La Universala Lingvo.) This 30-minute film traces the history of Esperanto. It's known for having extremely good camera quality and filming sense, as well as being a good \"absolute introduction\" to what Esperanto is, but is criticized for being too short.\n\nMany more films, cartoons and documentaries that aren't Esperanto originals are simply subtitled in Esperanto and put up on YouTube. Some fan-dubs exist, especially of Disney songs and short scenes, and the quality mirrors that of what would come from any small country or a country \"unused to technology\" (such as Greenland, Russia, etc.).\n\nFood\n\nAs Esperanto speakers are from all over the world, and families whose children speak Esperanto natively usually have parents from two vastly different countries, recipes incorporating elements from different countries are naturally born. Traditional foods are also enjoyed in settings where a native wouldn't normally mix or eat them.\n\nOne cookbook is Internacie kuiri “Cooking Internationally” by Maria Becker-Meisberger, published by FEL (Flemish Esperanto League), Antwerp 1989, . Another is Manĝoj el sanigaj plantoj  “Meals from Healthy Vegetable Dishes” by Zlata Nanić, published by BIO-ZRNO, Zagreb 2002, .\n\nSome Esperanto periodicals, such as MONATO include recipes from time to time.\n\nZamenhof Day\n\nOn December 15 (L. L. Zamenhof's birthday), Esperanto speakers around the world celebrate Zamenhof Day, sometimes called Book Day. It's a common goal to have a book written in Esperanto published on or by that day, as Zamenhof was a strong advocate of the idea that in order to spread Esperanto around the world, its speakers need to create a large body of literature.\n\nThe poem La Espero is the Esperanto anthem, and most Esperanto speakers know it by heart. It's often sung at conventions. Whether or not one enjoys the lyrics, the song is in general something that ties all Esperanto speakers together — as it's been around since Esperanto's early days, is known at least in tune to every Esperanto speaker, and is a general tradition. Esperanto culture. http://en.wikipedia.org/?curid=10404."
  }
}
