{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19354",
  "eid" : "3a217e50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606773,
  "textBody" : "Events\n\n*567 BC – Servius Tullius, the king of Rome, celebrates a triumph for his victory over the Etruscans.\n*240 BC – First recorded perihelion passage of Halley's Comet.\n*1085 – Alfonso VI of Castile takes Toledo, Spain, back from the Moors.\n*1420 – Henry the Navigator is appointed governor of the Order of Christ.\n*1521 – The Diet of Worms ends when Charles V, Holy Roman Emperor, issues the Edict of Worms, declaring Martin Luther an outlaw.\n*1644 – Ming general Wu Sangui forms an alliance with the invading Manchus and opens the gates of the Great Wall of China at Shanhaiguan pass, letting the Manchus through towards the capital Beijing.\n*1659 – Richard Cromwell resigns as Lord Protector of England following the restoration of the Long Parliament, beginning a second brief period of the republican government called the Commonwealth of England.\n*1660 – Charles II lands at Dover at the invitation of the Convention Parliament (England), which marks the end of the Cromwell-proclaimed Commonwealth of England, Scotland and Ireland and begins the Restoration (1660) of the British monarchy.\n*1738 – A treaty between Pennsylvania and Maryland ends the Conojocular War with settlement of a boundary dispute and exchange of prisoners.\n*1787 – The United States Constitutional Convention formally convenes in Philadelphia, when a quorum of seven states is secured.\n*1798 – United Irishmen Rebellion: Battle of Carlow begins; executions of suspected rebels at Carnew and at Dunlavin Green take place.\n*1809 – Chuquisaca Revolution: Patriot revolt in Chuquisaca (modern day Sucre) against the Spanish Empire, sparking the Latin American wars of independence.\n*1810 – May Revolution: Citizens of Buenos Aires expel Viceroy Baltasar Hidalgo de Cisneros during the May week, starting the Argentine War of Independence.\n*1819 – The Argentine Constitution of 1819 is promulgated.\n*1833 – The Chilean Constitution of 1833 is promulgated.\n*1837 – The Rebels of Lower Canada (Quebec) rebel against the British for governmental reforms.\n*1865 – In Mobile, Alabama, around 300 people are killed when an ordnance depot explodes.\n*1878 – Gilbert and Sullivan's comic opera H.M.S. Pinafore opens at the Opera Comique in London.\n*1895 – Playwright, poet, and novelist Oscar Wilde is convicted of \"committing acts of gross indecency with other male persons\" and sentenced to serve two years in prison.\n*  1895   – The Republic of Formosa is formed, with Tang Jingsong as its president.\n*1914 – The House of Commons of the United Kingdom passes the Home Rule Bill for devolution in Ireland.\n*1925 – Scopes Trial: John T. Scopes is indicted for teaching Charles Darwin's theory of evolution in Tennessee.\n*1926 – Sholom Schwartzbard assassinates Symon Petliura, the head of the government of the Ukrainian People's Republic, which is in government-in-exile in Paris.\n*1935 – Jesse Owens of Ohio State University breaks three world records and ties a fourth at the Big Ten Conference Track and Field Championships in Ann Arbor, Michigan.\n*1938 – Spanish Civil War: The bombing of Alicante kills 313 people.\n*1940 – World War II: The German 2nd Panzer Division captures the port of Boulogne-sur-Mer; the surrender of the last French and British troops marks the end of the Battle of Boulogne.\n*1946 – The parliament of Transjordan makes Abdullah I of Jordan their Emir.\n*1953 – Nuclear weapons testing: At the Nevada Test Site, the United States conducts its first and only nuclear artillery test.\n*  1953   – The first public television station in the United States officially begins broadcasting as KUHT from the campus of the University of Houston.\n*1955 – In the United States, a night-time F5 tornado strikes the small city of Udall, Kansas, killing 80 and injuring 273. It is the deadliest tornado to ever occur in the state and the 23rd deadliest in the U.S.\n*  1955   – First ascent of Kangchenjunga (8,586 m.), the third-highest mountain in the world, by a British expedition led by Charles Evans. Joe Brown and George Band reached the summit on May 25, followed by Norman Hardie and Tony Streather the next day.\n*1961 – Apollo program: U.S. President John F. Kennedy announces before a special joint session of the Congress his goal to initiate a project to put a \"man on the Moon\" before the end of the decade.\n*1963 – In Addis Ababa, Ethiopia, the Organisation of African Unity is established.\n*1966 – Explorer program: Explorer 32 launches.\n*1968 – The Gateway Arch in Saint Louis is dedicated.\n*1973 – , while participating in a NATO exercise and in order to protest against the dictatorship in Greece, anchored at Fiumicino, Italy, refusing to return to Greece.\n*1977 – Star Wars is released in theaters.\n*1977 – Chinese government removes a decade old ban on William Shakespeare's work, effectively ending the Cultural Revolution started in 1966.\n*1978 – The first bomb of a series of bombings orchestrated by the Unabomber detonates at Northwestern University resulting in minor injuries.\n*1979 – American Airlines Flight 191: In Chicago, a McDonnell Douglas DC-10 crashes during takeoff at O'Hare International Airport killing all 271 on board and two people on the ground.\n*1981 – In Riyadh, the Gulf Cooperation Council is created between Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates.\n*1982 – Falklands War: HMS Coventry is sunk by Argentine Air Force A-4 Skyhawks.\n*1985 – Bangladesh is hit by a tropical cyclone and storm surge, which kills approximately 10,000 people.\n*1986 – Hands Across America takes place.\n*1997 – A military coup in Sierra Leone replaces President Ahmad Tejan Kabbah with Major Johnny Paul Koromah.\n*1999 – The United States House of Representatives releases the Cox Report which details the People's Republic of China's nuclear espionage against the U.S. over the prior two decades.\n*2000 – Liberation Day of Lebanon. Israel withdraws its army from Lebanese territory (except for the disputed Shebaa farms zone) 22 years after its invasion in 1978.\n*2002 – China Airlines Flight 611 disintegrates in mid-air and crashes into the Taiwan Strait. All 225 people on board are killed.\n*2008 – NASA's Phoenix lander lands in Green Valley region of Mars to search for environments suitable for water and microbial life.\n*2009 – North Korea allegedly tests its second nuclear device. Following the nuclear test, Pyongyang also conducted several missile tests building tensions in the international community.\n*2011 – Oprah Winfrey airs her last show, ending her twenty-five-year run of The Oprah Winfrey Show.\n*2012 – The SpaceX Dragon became the first commercial spacecraft to successfully rendezvous with the International Space Station.\n*2013 – Suspected Maoist rebels kill at least 28 people and injure 32 others in an attack on a convoy of Indian National Congress politicians in Chhattisgarh, India.\n*  2013   – A gas cylinder explodes on a school bus in the Pakistani city of Gujrat, killing at least 18 people.\n\nBirths\n\n*1048 – Emperor Shenzong of Song (d. 1085)\n*1320 – Toghon Temür, Mongolian emperor (d. 1370)\n*1334 – Emperor Sukō of Japan (d. 1398)\n*1416 – Jakobus (\"James\"), Count of Lichtenburg (d. 1480)\n*1417 – Catherine of Cleves, Duchess consort regent of Guelders (d. 1479)\n*1550 – Camillus de Lellis, Italian saint and nurse (d. 1614)\n*1606 – Charles Garnier, French missionary and saint (d. 1649)\n*1661 – Claude Buffier, Polish-French historian and philosopher (d. 1737)\n*1713 – John Stuart, 3rd Earl of Bute, Scottish politician, Prime Minister of the United Kingdom (d. 1792)\n*1725 – Samuel Ward, American politician, 31st Governor of the Colony of Rhode Island (d. 1776)\n*1783 – Philip Pendleton Barbour, American farmer and politician, 12th Speaker of the United States House of Representatives (d. 1841)\n*1791 – Minh Mạng, Vietnamese emperor (d. 1841) \n*1803 – Edward Bulwer-Lytton, English author, playwright, and politician, Secretary of State for the Colonies (d. 1873)\n*  1803   – Ralph Waldo Emerson, American poet and philosopher (d. 1882)\n*1818 – Jacob Burckhardt, Swiss historian and academic (d. 1897)\n*1818 – Louise de Broglie, Countess d'Haussonville, French essayist and biographer (d. 1882)\n*1830 – Trebor Mai (né Robert Williams), Welsh poet (d. 1877)\n*1846 – Naim Frashëri, Albanian-Turkish poet and translator (d. 1900)\n*1848 – Johann Baptist Singenberger, Swiss composer, educator, and publisher (d. 1924)\n*1852 – William Muldoon, American wrestler and trainer (d. 1933)\n*1856 – Louis Franchet d'Espèrey, Algerian-French general (d. 1942)\n*1860 – James McKeen Cattell, American psychologist and academic (d. 1944)\n*1865 – John Mott, American evangelist and saint, Nobel Prize laureate (d. 1955)\n*  1865   – Pieter Zeeman, Dutch physicist and academic, Nobel Prize laureate (d. 1943)\n*1867 – Anders Peter Nielsen, Danish target shooter (d. 1950)\n*1869 – Robbie Ross, Canadian journalist and art critic (d. 1918)\n*1869 – Mathilde Verne, English pianist and educator (d. 1936)\n*1878 – Bill Robinson, American actor and dancer (d. 1949)\n*1879 – Max Aitken, Lord Beaverbrook, Canadian-English businessman and politician, Chancellor of the Duchy of Lancaster (d. 1964)\n*  1879   – William Stickney, American golfer (d. 1944)\n*1880 – Jean Alexandre Barré, French neurologist and academic (d. 1967)\n*1882 – Marie Doro, American actress (d. 1956)\n*1883 – Carl Johan Lind, Swedish hammer thrower (d. 1965)\n*1886 – Rash Behari Bose, Indian soldier and activist (d. 1945)\n*  1886   – Philip Murray, Scottish-American miner and labor leader (d. 1952)\n*1887 – Pio of Pietrelcina, Italian priest and saint (d. 1968)\n*1888 – Miles Malleson, English actor and screenwriter (d. 1969)\n*1889 – Günther Lütjens, German admiral (d. 1941)\n*  1889   – Igor Sikorsky, Russian-American aircraft designer, founded Sikorsky Aircraft (d. 1972)\n*1893 – Ernest \"Pop\" Stoneman, American country musician (d. 1968)\n*1897 – Alan Kippax, Australian cricketer (d. 1972)\n*  1897   – Gene Tunney, American boxer and soldier (d. 1978)\n*1898 – Bennett Cerf, American publisher and television game show panelist; co-founded Random House (d. 1971)\n*1899 – Kazi Nazrul Islam, Bengali poet, author, and flute player (d. 1976)\n*1900 – Alain Grandbois, Canadian poet and author (d. 1975)\n*1907 – U Nu, Burmese politician, 1st Prime Minister of Burma (d. 1995)\n*1908 – Theodore Roethke, American poet (d. 1963)\n*1909 – Alfred Kubel, German politician, 5th Prime Minister of Lower Saxony (d. 1999)\n*1912 – Dean Rockwell, American commander, wrestler, and coach (d. 2005)\n*1913 – Heinrich Bär, German colonel and pilot (d. 1957)\n*  1913   – Richard Dimbleby, English journalist and producer (d. 1965)\n*1916 – Brian Dickson, Canadian captain, lawyer, and politician, 15th Chief Justice of Canada (d. 1998)\n*  1916   – Giuseppe Tosi, Italian discus thrower (d. 1981)\n*1917 – Steve Cochran, American film, television and stage actor (d. 1965)\n*  1917   – Theodore Hesburgh, American priest, theologian, and academic (d. 2015)\n*1920 – Arthur Wint, Jamaican runner and diplomat (d. 1992)\n*1921 – Hal David, American songwriter and composer (d. 2012)\n*  1921   – Kitty Kallen, American singer (d. 2016)\n*  1921   – Jack Steinberger, German-Swiss physicist and academic, Nobel Prize laureate\n*1922 – Enrico Berlinguer, Italian politician (d. 1984)\n*1924 – István Nyers, French-Hungarian footballer (d. 2005)\n*1925 – Rosario Castellanos, Mexican poet and author (d. 1974)\n*  1925   – Jeanne Crain, American actress (d. 2003)\n*  1925   – Eldon Griffiths, English journalist and politician (d. 2014)\n*  1925   – Don Liddle, American baseball player (d. 2000)\n*  1925   – Claude Pinoteau, French film director and screenwriter (d. 2012)\n*1926 – Claude Akins, American actor (d. 1994)\n*  1926   – William Bowyer, English painter and academic (d. 2015)\n*  1926   – Phyllis Gotlieb, Canadian author and poet (d. 2009)\n*  1926   – David Wynne, English sculptor and painter (d. 2014)\n*1927 – Robert Ludlum, American soldier and author (d. 2001)\n*1927 – Norman Petty, American singer-songwriter, pianist, and producer (d. 1984)\n*1929 – Beverly Sills, American soprano and actress (d. 2007)\n*1931 – Herb Gray, Canadian lawyer and politician, 7th Deputy Prime Minister of Canada (d. 2014)\n*  1931   – Georgy Grechko, Russian engineer and astronaut\n*  1931   – Irwin Winkler, American director and producer\n*1932 – John Gregory Dunne, American novelist, screenwriter, and critic (d. 2003)\n*  1932   – K. C. Jones, American basketball player and coach\n*1933 – Sarah Marshall, English-American actress (d. 2014)\n*  1933   – Basdeo Panday, Trinidadian lawyer and politician, 5th Prime Minister of Trinidad and Tobago\n*  1933   – Ray Spencer, English footballer\n*  1933   – Jógvan Sundstein, Faroese accountant and politician, 7th Prime Minister of the Faroe Islands\n*1935 – John Ffowcs Williams, Welsh engineer and academic\n*  1935   – Cookie Gilchrist, American football player (d. 2011)\n*  1935   – W. P. Kinsella,  Canadian novelist and short story writer (d. 2016)\n*  1935   – Victoria Shaw, Australian-born American actress (d. 1988)\n*1936 – Tom T. Hall, American singer-songwriter and guitarist\n*  1936   – Rusi Surti, Indian cricketer (d. 2013)\n*1937 – Tom Phillips, English painter and academic\n*1938 – Raymond Carver, American short story writer and poet(d. 1988)\n*  1938   – Margaret Forster, English historian, author, and critic (d. 2016)\n*  1938   – Geoffrey Robinson, English businessman and politician\n*1939 – Dixie Carter, American actress and singer (d. 2010)\n*  1939   – Ian McKellen, English actor \n*1940 – Nobuyoshi Araki, Japanese photographer\n*1941 – Vladimir Voronin, Moldovan economist and politician, 3rd President of Moldova\n*1943 – Jessi Colter, American singer-songwriter and pianist\n*  1943   – John Palmer, English keyboard player \n*  1943   – Leslie Uggams, American actress and singer\n*1944 – Digby Anderson, English journalist and philosopher\n*  1944   – Pierre Bachelet, French singer-songwriter (d. 2005)\n*  1944   – Charlie Harper, English singer-songwriter and producer \n*  1944   – Robert MacPherson, American mathematician and academic\n*  1944   – Frank Oz, English-born American puppeteer, filmmaker, and actor\n*  1944   – Chris Ralston, English rugby player\n*1946 – Bill Adam, Scottish-Canadian race car driver\n*  1946   – David A. Hargrave, American game designer, created Arduin (d. 1988)\n*1947 – Karen Valentine, American actress\n*  1947   – Catherine G. Wolf, American psychologist and computer scientist\n*1948 – Bülent Arınç, Turkish lawyer and politician, Deputy Prime Minister of Turkey\n*  1948   – Marianne Elliott, Northern Irish historian, author, and academic \n*  1948   – Klaus Meine, German rock singer-songwriter\n*1949 – Jamaica Kincaid, Antiguan-American novelist, short story writer, and essayist\n*  1949   – Barry Windsor-Smith, English painter and illustrator\n*1950 – Robby Steinhardt, American rock violinist and singer \n*1951 – Bob Gale, American director, producer, and screenwriter\n*1952 – Jeffrey Bewkes, American businessman\n*  1952   – Nick Fotiu, American ice hockey player and coach\n*  1952   – David Jenkins, Trinidadian-Scottish runner\n*  1952   – Al Sarrantonio, American author and publisher\n*  1952   – Gordon H. Smith, American businessman and politician\n*1953 – Eve Ensler, American playwright and producer\n*  1953   – Daniel Passarella, Argentinian footballer, coach, and manager\n*  1953   – Stan Sakai, Japanese-American author and illustrator\n*  1953   – Gaetano Scirea, Italian footballer (d. 1989)\n*1954 – Murali, Indian actor, producer, and politician (d. 2009)\n*1955 – Alistair Burt, English lawyer and politician\n*1956 – Stavros Arnaoutakis, Greek politician\n*  1956   – Larry Hogan, American politician, 62nd Governor of Maryland\n*  1956   – David P. Sartor, American composer and conductor\n*1957 – Alastair Campbell, English journalist and author\n*  1957   – Edward Lee, American author\n*  1957   – Robert Picard, Canadian ice hockey player\n*1958 – Dorothy Straight, American children's author\n*  1958   – Paul Weller, English singer, songwriter and musician\n*1959 – Julian Clary, English comedian, actor, and author\n*  1959   – Manolis Kefalogiannis, Greek politician\n*  1959   – Rick Wamsley, Canadian ice hockey player and coach\n*1960 – Amy Klobuchar, American lawyer and politician\n*  1960   – Anthea Turner, English journalist and television host\n*1962 – Ric Nattress, Canadian ice hockey player, coach, and manager\n*1963 – George Hickenlooper, American director and producer (d. 2010)\n*  1963   – Mike Myers, Canadian-American actor, singer, producer, and screenwriter\n*1964 – David Shaw, Canadian-American ice hockey player\n*1965 – Yahya Jammeh, Gambian colonel and politician, President of the Gambia\n*1967 – Luc Nilis, Belgian footballer and manager\n*  1967   – Mark Rosewater, Head designer of Magic: the Gathering\n*1968 – Kendall Gill, American basketball player, boxer, and sportscaster\n*1969 – Glen Drover, Canadian guitarist and songwriter \n*  1969   – Anne Heche, American actress\n*  1969   – Stacy London, American journalist and author\n*1970 – Robert Croft, Welsh-English cricketer and sportscaster\n*  1970   – Jamie Kennedy, American actor, producer, and screenwriter\n*1971 – Stefano Baldini, Italian runner\n*  1971   – Marco Cappato, Italian politician\n*1972 – Karan Johar, Indian actor, director, producer, and screenwriter\n*  1972   – Octavia Spencer, American actress and author\n*1973 – Daz Dillinger, American rapper and producer \n*  1973   – Molly Sims, American model and actress\n*1974 – Dougie Freedman, Scottish footballer and manager\n*  1974   – Frank Klepacki, American drummer and composer \n*  1974   – Miguel Tejada, Dominican-American baseball player\n*1975 – Blaise Nkufo, Congolese-Swiss footballer\n*1976 – Stefan Holm, Swedish high jumper\n*  1976   – Cillian Murphy, Irish actor\n*  1976   – Erki Pütsep, Estonian cyclist\n*  1976   – Ethan Suplee, American actor\n*  1976   – Miguel Zepeda, Mexican footballer\n*1977 – Andre Anis, Estonian footballer\n*  1977   – Alberto Del Rio, Mexican-American mixed martial artist and wrestler\n*1978 – Adam Gontier, Canadian singer-songwriter and guitarist \n*1978 – Lee Jung-jin, South Korean actor\n*  1978   – Brian Urlacher, American football player\n*1979 – Carlos Bocanegra, American soccer player\n*  1979   – Sayed Moawad, Egyptian footballer\n*  1979   – Caroline Ouellette, Canadian ice hockey player and coach\n*  1979   – Sam Sodje, English-Nigerian footballer\n*  1979   – Jonny Wilkinson, English rugby player\n*  1979   – Chris Young, American baseball pitcher\n*1980 – Joe King, American singer-songwriter and guitarist \n*  1980   – David Navarro, Spanish footballer\n*1981 – Michalis Pelekanos, Greek basketball player\n*  1981   – Matt Utai, New Zealand rugby league player\n*1982 – Adam Boyd, English footballer\n*  1982   – Daniel Braaten, Norwegian footballer\n*  1982   – Ryan Gallant, American skateboarder\n*  1982   – Roger Guerreiro, Polish footballer\n*  1982   – Justin Hodges, Australian rugby league player\n*  1982   – Ezekiel Kemboi, Kenyan runner\n*  1982   – Jason Kubel, American baseball player\n*  1982   – Stacey Pensgen, American figure skater and meteorologist\n*  1982   – Luke Webster, Australian footballer\n*1983 – Aleksandr Petrov, Estonian ice hockey player\n*1984 – Luke Ball, Australian footballer\n*  1984   – Kyle Brodziak, Canadian ice hockey player\n*  1984   – A. J. Foyt IV, American race car driver\n*  1984   – Shawne Merriman, American football player\n*1985 – Luciana Abreu, Portuguese singer and actress \n*  1985   – Demba Ba, French footballer\n*  1985   – Gert Kams, Estonian footballer\n*  1985   – Roman Reigns, American football player and wrestler\n*1986 – Edewin Fanini, Brazilian footballer\n*  1986   – Yoan Gouffran, French footballer\n*  1986   – Neon Hitch, English singer-songwriter\n*  1986   – Takahiro Hōjō, Japanese actor and musician\n*  1986   – Geraint Thomas, Welsh cyclist\n*  1986   – Juri Ueno, Japanese actress\n*1987 – Timothy Derijck, Belgian footballer\n*  1987   – Yves De Winter, Belgian footballer\n*  1987   – Moritz Stehling, German footballer\n*  1987   – Kamil Stoch, Polish ski jumper\n*1988 – Dávid Škutka, Slovak footballer\n*1990 – Bo Dallas, American wrestler\n*  1990   – Nikita Filatov, Russian ice hockey player\n*1993 – James Porter, English cricketer\n*1994 – Matt Murray, Canadian ice hockey player\n*  1994   – Aly Raisman, American gymnast\n*1996 – David Pastrňák, Czech ice hockey player\n\nDeaths\n\n* 615 – Pope Boniface IV (b. 550)\n* 675 – Li Hong, Chinese prince (b. 652) \n* 709 – Aldhelm, English-Latin bishop, poet, and scholar (b. 639)\n* 735 – Bede, English monk, historian and scholar \n* 803 – Higbald of Lindisfarne, English bishop \n* 912 – Xue Yiju, chancellor of Later Liang \n* 916 – Flann Sinna, king of Meath\n* 939 – Yao Yanzhang, general of Chu\n* 986 – Abd al-Rahman al-Sufi, Muslim astronomer (b. 903)\n* 992 – Mieszko I of Poland (b. 935)\n*1085 – Pope Gregory VII (b. 1020)\n*1261 – Pope Alexander IV (b. 1185)\n*1452 – John Stafford, English archbishop and politician\n*1555 – Gemma Frisius, Dutch physician, mathematician, and cartographer (b. 1508)\n*  1555   – Henry II of Navarre (b. 1503)\n*1595 – Valens Acidalius, German poet and critic (b. 1567)\n*  1595   – Philip Neri, Italian priest and saint (b. 1515)\n*1607 – Mary Magdalene de' Pazzi, Italian Carmelite nun and mystic (b. 1566)\n*1632 – Adam Tanner, Austrian mathematician and philosopher (b. 1572)\n*1667 – Gustaf Bonde, Finnish-Swedish politician, 5th Lord High Treasurer of Sweden (b. 1620)\n*1681 – Pedro Calderón de la Barca, Spanish poet and playwright (b. 1600)\n*1741 – Daniel Ernst Jablonski, German bishop and theologian (b. 1660)\n*1786 – Peter III of Portugal (b. 1717)\n*1789 – Anders Dahl, Swedish botanist and physician (b. 1751)\n*1797 – John Griffin, 4th Baron Howard de Walden, English field marshal and politician, Lord Lieutenant of Essex (b. 1719)\n*1805 – William Paley, English priest and philosopher (b. 1743)\n*1848 – Annette von Droste-Hülshoff, German author and composer (b. 1797)\n*1849 – Benjamin D'Urban, English general and politician, Governor of British Guiana (b. 1777)\n*1895 – Ahmed Cevdet Pasha, Ottoman sociologist, historian, and jurist (b. 1822)\n*1899 – Rosa Bonheur, French painter and sculptor (b. 1822)\n*1912 – Austin Lane Crothers, American educator and politician, 46th Governor of Maryland (b. 1860)\n*1917 – Maksim Bahdanovič, Belarusian poet and critic (b. 1891)\n*1919 – Eliza Pollock, American archer (b. 1840)\n*  1919   – Madam C. J. Walker, American businesswoman and philanthropist, founded the Madame C.J. Walker Manufacturing Company (b. 1867)\n*1924 – Lyubov Popova, Russian painter and illustrator (b. 1889)\n*1926 – Symon Petliura, Ukrainian journalist and politician (b. 1879)\n*1927 – Payne Whitney, American businessman and philanthropist (b. 1876)\n*1930 – Randall Davidson, Scottish-English archbishop (b. 1848)\n*1934 – Gustav Holst, English trombonist, composer, and educator (b. 1874)\n*1937 – Henry Ossawa Tanner, American-French painter and illustrator (b. 1859)\n*1939 – Frank Watson Dyson, English astronomer and academic (b. 1868)\n*1942 – Emanuel Feuermann, Ukrainian-American cellist and educator (b. 1902)\n*1943 – Nils von Dardel, Swedish painter (b. 1888)\n*1948 – Witold Pilecki, Polish officer and Resistance leader (b. 1901)\n*1951 – Paula von Preradović, Croatian poet and author (b. 1887)\n*1954 – Robert Capa, Hungarian photographer and journalist (b. 1913)\n*1957 – Leo Goodwin, American swimmer, diver, and water polo player (b. 1883)\n*1968 – Georg von Küchler, German field marshal (b. 1881)\n*1970 – Tom Patey, Scottish mountaineer and author (b. 1932)\n*1977 – Yevgenia Ginzburg, Russian author (b. 1904)\n*1979 – Itzhak Bentov, Czech-Israeli engineer, mystic, and author (b. 1923)\n*  1979   – Amédée Gordini, Italian-born French racing driver and sports car manufacturer (b. 1899)\n*1981 – Ruby Payne-Scott, Australian physicist and astronomer (b. 1912)\n*  1981   – Fredric Warburg, English author and publisher (b. 1898)\n*1983 – Necip Fazıl Kısakürek, Turkish author, poet, and playwright (b. 1904)\n*  1983   – Idris of Libya (b. 1889)\n*  1983   – Jack Stewart, Canadian-American ice hockey player (b. 1917)\n*1986 – Chester Bowles, American journalist and politician, 22nd Under Secretary of State (b. 1901)\n*1990 – Vic Tayback, American actor (b. 1930)\n*1995 – Élie Bayol, French race car driver (b. 1914)\n*  1995   – Krešimir Ćosić, Croatian basketball player and coach, Naismith Basketball Hall of Famer 1996 (b. 1948)\n*  1995   – Dany Robin, French actress (b. 1927)\n*1996 – Renzo De Felice, Italian historian and author (b. 1929)\n*2003 – Sloan Wilson, American author and poet (b. 1920)\n*2004 – Roger Williams Straus, Jr., American publisher, co-founded Farrar, Straus and Giroux Publishing Company (b. 1917)\n*2005 – Sunil Dutt, Indian actor, director, producer, and politician (b. 1929)\n*  2005   – Robert Jankel, English businessman, founded Panther Westwinds (b. 1938)\n*  2005   – Graham Kennedy, Australian television host and actor (b. 1934)\n*  2005   – Ismail Merchant, Indian-born film producer and director (b. 1936)\n*  2005   – Zoran Mušič, Slovene painter and illustrator (b. 1909)\n*2007 – Charles Nelson Reilly, American actor, comedian, and director (b. 1931)\n*2008 – J. R. Simplot, American businessman, founded Simplot (b. 1909)\n*2009 – Haakon Lie, Norwegian politician (b. 1905)\n*2010 – Alexander Belostenny, Ukrainian basketball player (b. 1959)\n*  2010   – Michael H. Jordan, American businessman (b. 1936)\n*  2010   – Alan Hickinbotham, Australian footballer and coach (b. 1925)\n*  2010   – Gabriel Vargas, Mexican painter and illustrator (b. 1915)\n*  2010   – Jarvis Williams, American football player and coach (b. 1965) \n*2011 – Terry Jenner, Australian cricketer and coach (b. 1944)\n*2012 – William Hanley, American author and screenwriter (b. 1931)\n*  2012   – Peter D. Sieruta, American author and critic (b. 1958)\n*  2012   – Lou Watson, American basketball player and coach (b. 1924)\n*2013 – Mahendra Karma, Indian politician (b. 1950)\n*  2013   – Nand Kumar Patel, Indian politician (b. 1953)\n*2014 – David Allen, English cricketer (b. 1935)\n*  2014   – Marcel Côté, Canadian economist and politician (b. 1942)\n*  2014   – Wojciech Jaruzelski, Polish general and politician, 1st President of Poland (b. 1923)\n*  2014   – Herb Jeffries, American singer and actor (b. 1913)\n*  2014   – Toaripi Lauti, Tuvaluan educator and politician, 1st Prime Minister of Tuvalu (b. 1928)\n*  2014   – Matthew Saad Muhammad, American boxer and trainer (b. 1954)\n*2015 – George Braden, Canadian lawyer and politician, 2nd Premier of the Northwest Territories (b. 1949)\n*  2015   – Robert Lebel, Canadian bishop (b. 1924)\n\nHolidays and observances\n\n*Africa Day (African Union)\n*African Liberation Day (African Union, Rastafari)\n*Christian feast day:\n**Aldhelm\n**Bede\n**Gerard of Lunel\n**Mary Magdalene de Pazzi\n**Maximus (Mauxe) of Évreux\n**Pope Boniface IV\n**Pope Gregory VII\n**Pope Urban I\n**May 25 (Eastern Orthodox liturgics)\n*Day of Youth, celebrated on Josip Broz Tito's birthday (the former Socialist Federal Republic of Yugoslavia)\n*Earliest day on which Arbor Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Venezuela)\n*Earliest day on which Children's Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Hungary)\n*Earliest day on which Holiday of Saint Etchmiadzin can fall, while July 27 is the latest; celebrated on the 64th day after Easter. (Armenia)\n*Earliest day on which Memorial Day can fall, while May 31 is the latest; celebrated on the last Monday in May. (United States)\n*Earliest day on which Mother's Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Algeria, Dominican Republic, France (First Sunday of June, if Pentecost occurs on this day), Haiti, Mauritius, Morocco, Sweden, Tunisia)\n*Earliest day on which Turkmen Carpet Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Turkmenistan)\n*First National Government / National Day (Argentina)\n*Geek Pride Day (geek culture)\n*Independence Day, celebrates the independence of Jordan from the United Kingdom in 1946.\n*Last bell (Russia, post-Soviet countries)\n*Liberation Day (Lebanon)\n*National Missing Children's Day (United States), and its related observances:\n**International Missing Children's Day \n*National Tap Dance Day (United States)\n*Towel Day in honour of the work of the writer Douglas Adams",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 25" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19354" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*567 BC – Servius Tullius, the king of Rome, celebrates a triumph for his victory over the Etruscans.\n*240 BC – First recorded perihelion passage of Halley's Comet.\n*1085 – Alfonso VI of Castile takes Toledo, Spain, back from the Moors.\n*1420 – Henry the Navigator is appointed governor of the Order of Christ.\n*1521 – The Diet of Worms ends when Charles V, Holy Roman Emperor, issues the Edict of Worms, declaring Martin Luther an outlaw.\n*1644 – Ming general Wu Sangui forms an alliance with the invading Manchus and opens the gates of the Great Wall of China at Shanhaiguan pass, letting the Manchus through towards the capital Beijing.\n*1659 – Richard Cromwell resigns as Lord Protector of England following the restoration of the Long Parliament, beginning a second brief period of the republican government called the Commonwealth of England.\n*1660 – Charles II lands at Dover at the invitation of the Convention Parliament (England), which marks the end of the Cromwell-proclaimed Commonwealth of England, Scotland and Ireland and begins the Restoration (1660) of the British monarchy.\n*1738 – A treaty between Pennsylvania and Maryland ends the Conojocular War with settlement of a boundary dispute and exchange of prisoners.\n*1787 – The United States Constitutional Convention formally convenes in Philadelphia, when a quorum of seven states is secured.\n*1798 – United Irishmen Rebellion: Battle of Carlow begins; executions of suspected rebels at Carnew and at Dunlavin Green take place.\n*1809 – Chuquisaca Revolution: Patriot revolt in Chuquisaca (modern day Sucre) against the Spanish Empire, sparking the Latin American wars of independence.\n*1810 – May Revolution: Citizens of Buenos Aires expel Viceroy Baltasar Hidalgo de Cisneros during the May week, starting the Argentine War of Independence.\n*1819 – The Argentine Constitution of 1819 is promulgated.\n*1833 – The Chilean Constitution of 1833 is promulgated.\n*1837 – The Rebels of Lower Canada (Quebec) rebel against the British for governmental reforms.\n*1865 – In Mobile, Alabama, around 300 people are killed when an ordnance depot explodes.\n*1878 – Gilbert and Sullivan's comic opera H.M.S. Pinafore opens at the Opera Comique in London.\n*1895 – Playwright, poet, and novelist Oscar Wilde is convicted of \"committing acts of gross indecency with other male persons\" and sentenced to serve two years in prison.\n*  1895   – The Republic of Formosa is formed, with Tang Jingsong as its president.\n*1914 – The House of Commons of the United Kingdom passes the Home Rule Bill for devolution in Ireland.\n*1925 – Scopes Trial: John T. Scopes is indicted for teaching Charles Darwin's theory of evolution in Tennessee.\n*1926 – Sholom Schwartzbard assassinates Symon Petliura, the head of the government of the Ukrainian People's Republic, which is in government-in-exile in Paris.\n*1935 – Jesse Owens of Ohio State University breaks three world records and ties a fourth at the Big Ten Conference Track and Field Championships in Ann Arbor, Michigan.\n*1938 – Spanish Civil War: The bombing of Alicante kills 313 people.\n*1940 – World War II: The German 2nd Panzer Division captures the port of Boulogne-sur-Mer; the surrender of the last French and British troops marks the end of the Battle of Boulogne.\n*1946 – The parliament of Transjordan makes Abdullah I of Jordan their Emir.\n*1953 – Nuclear weapons testing: At the Nevada Test Site, the United States conducts its first and only nuclear artillery test.\n*  1953   – The first public television station in the United States officially begins broadcasting as KUHT from the campus of the University of Houston.\n*1955 – In the United States, a night-time F5 tornado strikes the small city of Udall, Kansas, killing 80 and injuring 273. It is the deadliest tornado to ever occur in the state and the 23rd deadliest in the U.S.\n*  1955   – First ascent of Kangchenjunga (8,586 m.), the third-highest mountain in the world, by a British expedition led by Charles Evans. Joe Brown and George Band reached the summit on May 25, followed by Norman Hardie and Tony Streather the next day.\n*1961 – Apollo program: U.S. President John F. Kennedy announces before a special joint session of the Congress his goal to initiate a project to put a \"man on the Moon\" before the end of the decade.\n*1963 – In Addis Ababa, Ethiopia, the Organisation of African Unity is established.\n*1966 – Explorer program: Explorer 32 launches.\n*1968 – The Gateway Arch in Saint Louis is dedicated.\n*1973 – , while participating in a NATO exercise and in order to protest against the dictatorship in Greece, anchored at Fiumicino, Italy, refusing to return to Greece.\n*1977 – Star Wars is released in theaters.\n*1977 – Chinese government removes a decade old ban on William Shakespeare's work, effectively ending the Cultural Revolution started in 1966.\n*1978 – The first bomb of a series of bombings orchestrated by the Unabomber detonates at Northwestern University resulting in minor injuries.\n*1979 – American Airlines Flight 191: In Chicago, a McDonnell Douglas DC-10 crashes during takeoff at O'Hare International Airport killing all 271 on board and two people on the ground.\n*1981 – In Riyadh, the Gulf Cooperation Council is created between Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates.\n*1982 – Falklands War: HMS Coventry is sunk by Argentine Air Force A-4 Skyhawks.\n*1985 – Bangladesh is hit by a tropical cyclone and storm surge, which kills approximately 10,000 people.\n*1986 – Hands Across America takes place.\n*1997 – A military coup in Sierra Leone replaces President Ahmad Tejan Kabbah with Major Johnny Paul Koromah.\n*1999 – The United States House of Representatives releases the Cox Report which details the People's Republic of China's nuclear espionage against the U.S. over the prior two decades.\n*2000 – Liberation Day of Lebanon. Israel withdraws its army from Lebanese territory (except for the disputed Shebaa farms zone) 22 years after its invasion in 1978.\n*2002 – China Airlines Flight 611 disintegrates in mid-air and crashes into the Taiwan Strait. All 225 people on board are killed.\n*2008 – NASA's Phoenix lander lands in Green Valley region of Mars to search for environments suitable for water and microbial life.\n*2009 – North Korea allegedly tests its second nuclear device. Following the nuclear test, Pyongyang also conducted several missile tests building tensions in the international community.\n*2011 – Oprah Winfrey airs her last show, ending her twenty-five-year run of The Oprah Winfrey Show.\n*2012 – The SpaceX Dragon became the first commercial spacecraft to successfully rendezvous with the International Space Station.\n*2013 – Suspected Maoist rebels kill at least 28 people and injure 32 others in an attack on a convoy of Indian National Congress politicians in Chhattisgarh, India.\n*  2013   – A gas cylinder explodes on a school bus in the Pakistani city of Gujrat, killing at least 18 people.\n\nBirths\n\n*1048 – Emperor Shenzong of Song (d. 1085)\n*1320 – Toghon Temür, Mongolian emperor (d. 1370)\n*1334 – Emperor Sukō of Japan (d. 1398)\n*1416 – Jakobus (\"James\"), Count of Lichtenburg (d. 1480)\n*1417 – Catherine of Cleves, Duchess consort regent of Guelders (d. 1479)\n*1550 – Camillus de Lellis, Italian saint and nurse (d. 1614)\n*1606 – Charles Garnier, French missionary and saint (d. 1649)\n*1661 – Claude Buffier, Polish-French historian and philosopher (d. 1737)\n*1713 – John Stuart, 3rd Earl of Bute, Scottish politician, Prime Minister of the United Kingdom (d. 1792)\n*1725 – Samuel Ward, American politician, 31st Governor of the Colony of Rhode Island (d. 1776)\n*1783 – Philip Pendleton Barbour, American farmer and politician, 12th Speaker of the United States House of Representatives (d. 1841)\n*1791 – Minh Mạng, Vietnamese emperor (d. 1841) \n*1803 – Edward Bulwer-Lytton, English author, playwright, and politician, Secretary of State for the Colonies (d. 1873)\n*  1803   – Ralph Waldo Emerson, American poet and philosopher (d. 1882)\n*1818 – Jacob Burckhardt, Swiss historian and academic (d. 1897)\n*1818 – Louise de Broglie, Countess d'Haussonville, French essayist and biographer (d. 1882)\n*1830 – Trebor Mai (né Robert Williams), Welsh poet (d. 1877)\n*1846 – Naim Frashëri, Albanian-Turkish poet and translator (d. 1900)\n*1848 – Johann Baptist Singenberger, Swiss composer, educator, and publisher (d. 1924)\n*1852 – William Muldoon, American wrestler and trainer (d. 1933)\n*1856 – Louis Franchet d'Espèrey, Algerian-French general (d. 1942)\n*1860 – James McKeen Cattell, American psychologist and academic (d. 1944)\n*1865 – John Mott, American evangelist and saint, Nobel Prize laureate (d. 1955)\n*  1865   – Pieter Zeeman, Dutch physicist and academic, Nobel Prize laureate (d. 1943)\n*1867 – Anders Peter Nielsen, Danish target shooter (d. 1950)\n*1869 – Robbie Ross, Canadian journalist and art critic (d. 1918)\n*1869 – Mathilde Verne, English pianist and educator (d. 1936)\n*1878 – Bill Robinson, American actor and dancer (d. 1949)\n*1879 – Max Aitken, Lord Beaverbrook, Canadian-English businessman and politician, Chancellor of the Duchy of Lancaster (d. 1964)\n*  1879   – William Stickney, American golfer (d. 1944)\n*1880 – Jean Alexandre Barré, French neurologist and academic (d. 1967)\n*1882 – Marie Doro, American actress (d. 1956)\n*1883 – Carl Johan Lind, Swedish hammer thrower (d. 1965)\n*1886 – Rash Behari Bose, Indian soldier and activist (d. 1945)\n*  1886   – Philip Murray, Scottish-American miner and labor leader (d. 1952)\n*1887 – Pio of Pietrelcina, Italian priest and saint (d. 1968)\n*1888 – Miles Malleson, English actor and screenwriter (d. 1969)\n*1889 – Günther Lütjens, German admiral (d. 1941)\n*  1889   – Igor Sikorsky, Russian-American aircraft designer, founded Sikorsky Aircraft (d. 1972)\n*1893 – Ernest \"Pop\" Stoneman, American country musician (d. 1968)\n*1897 – Alan Kippax, Australian cricketer (d. 1972)\n*  1897   – Gene Tunney, American boxer and soldier (d. 1978)\n*1898 – Bennett Cerf, American publisher and television game show panelist; co-founded Random House (d. 1971)\n*1899 – Kazi Nazrul Islam, Bengali poet, author, and flute player (d. 1976)\n*1900 – Alain Grandbois, Canadian poet and author (d. 1975)\n*1907 – U Nu, Burmese politician, 1st Prime Minister of Burma (d. 1995)\n*1908 – Theodore Roethke, American poet (d. 1963)\n*1909 – Alfred Kubel, German politician, 5th Prime Minister of Lower Saxony (d. 1999)\n*1912 – Dean Rockwell, American commander, wrestler, and coach (d. 2005)\n*1913 – Heinrich Bär, German colonel and pilot (d. 1957)\n*  1913   – Richard Dimbleby, English journalist and producer (d. 1965)\n*1916 – Brian Dickson, Canadian captain, lawyer, and politician, 15th Chief Justice of Canada (d. 1998)\n*  1916   – Giuseppe Tosi, Italian discus thrower (d. 1981)\n*1917 – Steve Cochran, American film, television and stage actor (d. 1965)\n*  1917   – Theodore Hesburgh, American priest, theologian, and academic (d. 2015)\n*1920 – Arthur Wint, Jamaican runner and diplomat (d. 1992)\n*1921 – Hal David, American songwriter and composer (d. 2012)\n*  1921   – Kitty Kallen, American singer (d. 2016)\n*  1921   – Jack Steinberger, German-Swiss physicist and academic, Nobel Prize laureate\n*1922 – Enrico Berlinguer, Italian politician (d. 1984)\n*1924 – István Nyers, French-Hungarian footballer (d. 2005)\n*1925 – Rosario Castellanos, Mexican poet and author (d. 1974)\n*  1925   – Jeanne Crain, American actress (d. 2003)\n*  1925   – Eldon Griffiths, English journalist and politician (d. 2014)\n*  1925   – Don Liddle, American baseball player (d. 2000)\n*  1925   – Claude Pinoteau, French film director and screenwriter (d. 2012)\n*1926 – Claude Akins, American actor (d. 1994)\n*  1926   – William Bowyer, English painter and academic (d. 2015)\n*  1926   – Phyllis Gotlieb, Canadian author and poet (d. 2009)\n*  1926   – David Wynne, English sculptor and painter (d. 2014)\n*1927 – Robert Ludlum, American soldier and author (d. 2001)\n*1927 – Norman Petty, American singer-songwriter, pianist, and producer (d. 1984)\n*1929 – Beverly Sills, American soprano and actress (d. 2007)\n*1931 – Herb Gray, Canadian lawyer and politician, 7th Deputy Prime Minister of Canada (d. 2014)\n*  1931   – Georgy Grechko, Russian engineer and astronaut\n*  1931   – Irwin Winkler, American director and producer\n*1932 – John Gregory Dunne, American novelist, screenwriter, and critic (d. 2003)\n*  1932   – K. C. Jones, American basketball player and coach\n*1933 – Sarah Marshall, English-American actress (d. 2014)\n*  1933   – Basdeo Panday, Trinidadian lawyer and politician, 5th Prime Minister of Trinidad and Tobago\n*  1933   – Ray Spencer, English footballer\n*  1933   – Jógvan Sundstein, Faroese accountant and politician, 7th Prime Minister of the Faroe Islands\n*1935 – John Ffowcs Williams, Welsh engineer and academic\n*  1935   – Cookie Gilchrist, American football player (d. 2011)\n*  1935   – W. P. Kinsella,  Canadian novelist and short story writer (d. 2016)\n*  1935   – Victoria Shaw, Australian-born American actress (d. 1988)\n*1936 – Tom T. Hall, American singer-songwriter and guitarist\n*  1936   – Rusi Surti, Indian cricketer (d. 2013)\n*1937 – Tom Phillips, English painter and academic\n*1938 – Raymond Carver, American short story writer and poet(d. 1988)\n*  1938   – Margaret Forster, English historian, author, and critic (d. 2016)\n*  1938   – Geoffrey Robinson, English businessman and politician\n*1939 – Dixie Carter, American actress and singer (d. 2010)\n*  1939   – Ian McKellen, English actor \n*1940 – Nobuyoshi Araki, Japanese photographer\n*1941 – Vladimir Voronin, Moldovan economist and politician, 3rd President of Moldova\n*1943 – Jessi Colter, American singer-songwriter and pianist\n*  1943   – John Palmer, English keyboard player \n*  1943   – Leslie Uggams, American actress and singer\n*1944 – Digby Anderson, English journalist and philosopher\n*  1944   – Pierre Bachelet, French singer-songwriter (d. 2005)\n*  1944   – Charlie Harper, English singer-songwriter and producer \n*  1944   – Robert MacPherson, American mathematician and academic\n*  1944   – Frank Oz, English-born American puppeteer, filmmaker, and actor\n*  1944   – Chris Ralston, English rugby player\n*1946 – Bill Adam, Scottish-Canadian race car driver\n*  1946   – David A. Hargrave, American game designer, created Arduin (d. 1988)\n*1947 – Karen Valentine, American actress\n*  1947   – Catherine G. Wolf, American psychologist and computer scientist\n*1948 – Bülent Arınç, Turkish lawyer and politician, Deputy Prime Minister of Turkey\n*  1948   – Marianne Elliott, Northern Irish historian, author, and academic \n*  1948   – Klaus Meine, German rock singer-songwriter\n*1949 – Jamaica Kincaid, Antiguan-American novelist, short story writer, and essayist\n*  1949   – Barry Windsor-Smith, English painter and illustrator\n*1950 – Robby Steinhardt, American rock violinist and singer \n*1951 – Bob Gale, American director, producer, and screenwriter\n*1952 – Jeffrey Bewkes, American businessman\n*  1952   – Nick Fotiu, American ice hockey player and coach\n*  1952   – David Jenkins, Trinidadian-Scottish runner\n*  1952   – Al Sarrantonio, American author and publisher\n*  1952   – Gordon H. Smith, American businessman and politician\n*1953 – Eve Ensler, American playwright and producer\n*  1953   – Daniel Passarella, Argentinian footballer, coach, and manager\n*  1953   – Stan Sakai, Japanese-American author and illustrator\n*  1953   – Gaetano Scirea, Italian footballer (d. 1989)\n*1954 – Murali, Indian actor, producer, and politician (d. 2009)\n*1955 – Alistair Burt, English lawyer and politician\n*1956 – Stavros Arnaoutakis, Greek politician\n*  1956   – Larry Hogan, American politician, 62nd Governor of Maryland\n*  1956   – David P. Sartor, American composer and conductor\n*1957 – Alastair Campbell, English journalist and author\n*  1957   – Edward Lee, American author\n*  1957   – Robert Picard, Canadian ice hockey player\n*1958 – Dorothy Straight, American children's author\n*  1958   – Paul Weller, English singer, songwriter and musician\n*1959 – Julian Clary, English comedian, actor, and author\n*  1959   – Manolis Kefalogiannis, Greek politician\n*  1959   – Rick Wamsley, Canadian ice hockey player and coach\n*1960 – Amy Klobuchar, American lawyer and politician\n*  1960   – Anthea Turner, English journalist and television host\n*1962 – Ric Nattress, Canadian ice hockey player, coach, and manager\n*1963 – George Hickenlooper, American director and producer (d. 2010)\n*  1963   – Mike Myers, Canadian-American actor, singer, producer, and screenwriter\n*1964 – David Shaw, Canadian-American ice hockey player\n*1965 – Yahya Jammeh, Gambian colonel and politician, President of the Gambia\n*1967 – Luc Nilis, Belgian footballer and manager\n*  1967   – Mark Rosewater, Head designer of Magic: the Gathering\n*1968 – Kendall Gill, American basketball player, boxer, and sportscaster\n*1969 – Glen Drover, Canadian guitarist and songwriter \n*  1969   – Anne Heche, American actress\n*  1969   – Stacy London, American journalist and author\n*1970 – Robert Croft, Welsh-English cricketer and sportscaster\n*  1970   – Jamie Kennedy, American actor, producer, and screenwriter\n*1971 – Stefano Baldini, Italian runner\n*  1971   – Marco Cappato, Italian politician\n*1972 – Karan Johar, Indian actor, director, producer, and screenwriter\n*  1972   – Octavia Spencer, American actress and author\n*1973 – Daz Dillinger, American rapper and producer \n*  1973   – Molly Sims, American model and actress\n*1974 – Dougie Freedman, Scottish footballer and manager\n*  1974   – Frank Klepacki, American drummer and composer \n*  1974   – Miguel Tejada, Dominican-American baseball player\n*1975 – Blaise Nkufo, Congolese-Swiss footballer\n*1976 – Stefan Holm, Swedish high jumper\n*  1976   – Cillian Murphy, Irish actor\n*  1976   – Erki Pütsep, Estonian cyclist\n*  1976   – Ethan Suplee, American actor\n*  1976   – Miguel Zepeda, Mexican footballer\n*1977 – Andre Anis, Estonian footballer\n*  1977   – Alberto Del Rio, Mexican-American mixed martial artist and wrestler\n*1978 – Adam Gontier, Canadian singer-songwriter and guitarist \n*1978 – Lee Jung-jin, South Korean actor\n*  1978   – Brian Urlacher, American football player\n*1979 – Carlos Bocanegra, American soccer player\n*  1979   – Sayed Moawad, Egyptian footballer\n*  1979   – Caroline Ouellette, Canadian ice hockey player and coach\n*  1979   – Sam Sodje, English-Nigerian footballer\n*  1979   – Jonny Wilkinson, English rugby player\n*  1979   – Chris Young, American baseball pitcher\n*1980 – Joe King, American singer-songwriter and guitarist \n*  1980   – David Navarro, Spanish footballer\n*1981 – Michalis Pelekanos, Greek basketball player\n*  1981   – Matt Utai, New Zealand rugby league player\n*1982 – Adam Boyd, English footballer\n*  1982   – Daniel Braaten, Norwegian footballer\n*  1982   – Ryan Gallant, American skateboarder\n*  1982   – Roger Guerreiro, Polish footballer\n*  1982   – Justin Hodges, Australian rugby league player\n*  1982   – Ezekiel Kemboi, Kenyan runner\n*  1982   – Jason Kubel, American baseball player\n*  1982   – Stacey Pensgen, American figure skater and meteorologist\n*  1982   – Luke Webster, Australian footballer\n*1983 – Aleksandr Petrov, Estonian ice hockey player\n*1984 – Luke Ball, Australian footballer\n*  1984   – Kyle Brodziak, Canadian ice hockey player\n*  1984   – A. J. Foyt IV, American race car driver\n*  1984   – Shawne Merriman, American football player\n*1985 – Luciana Abreu, Portuguese singer and actress \n*  1985   – Demba Ba, French footballer\n*  1985   – Gert Kams, Estonian footballer\n*  1985   – Roman Reigns, American football player and wrestler\n*1986 – Edewin Fanini, Brazilian footballer\n*  1986   – Yoan Gouffran, French footballer\n*  1986   – Neon Hitch, English singer-songwriter\n*  1986   – Takahiro Hōjō, Japanese actor and musician\n*  1986   – Geraint Thomas, Welsh cyclist\n*  1986   – Juri Ueno, Japanese actress\n*1987 – Timothy Derijck, Belgian footballer\n*  1987   – Yves De Winter, Belgian footballer\n*  1987   – Moritz Stehling, German footballer\n*  1987   – Kamil Stoch, Polish ski jumper\n*1988 – Dávid Škutka, Slovak footballer\n*1990 – Bo Dallas, American wrestler\n*  1990   – Nikita Filatov, Russian ice hockey player\n*1993 – James Porter, English cricketer\n*1994 – Matt Murray, Canadian ice hockey player\n*  1994   – Aly Raisman, American gymnast\n*1996 – David Pastrňák, Czech ice hockey player\n\nDeaths\n\n* 615 – Pope Boniface IV (b. 550)\n* 675 – Li Hong, Chinese prince (b. 652) \n* 709 – Aldhelm, English-Latin bishop, poet, and scholar (b. 639)\n* 735 – Bede, English monk, historian and scholar \n* 803 – Higbald of Lindisfarne, English bishop \n* 912 – Xue Yiju, chancellor of Later Liang \n* 916 – Flann Sinna, king of Meath\n* 939 – Yao Yanzhang, general of Chu\n* 986 – Abd al-Rahman al-Sufi, Muslim astronomer (b. 903)\n* 992 – Mieszko I of Poland (b. 935)\n*1085 – Pope Gregory VII (b. 1020)\n*1261 – Pope Alexander IV (b. 1185)\n*1452 – John Stafford, English archbishop and politician\n*1555 – Gemma Frisius, Dutch physician, mathematician, and cartographer (b. 1508)\n*  1555   – Henry II of Navarre (b. 1503)\n*1595 – Valens Acidalius, German poet and critic (b. 1567)\n*  1595   – Philip Neri, Italian priest and saint (b. 1515)\n*1607 – Mary Magdalene de' Pazzi, Italian Carmelite nun and mystic (b. 1566)\n*1632 – Adam Tanner, Austrian mathematician and philosopher (b. 1572)\n*1667 – Gustaf Bonde, Finnish-Swedish politician, 5th Lord High Treasurer of Sweden (b. 1620)\n*1681 – Pedro Calderón de la Barca, Spanish poet and playwright (b. 1600)\n*1741 – Daniel Ernst Jablonski, German bishop and theologian (b. 1660)\n*1786 – Peter III of Portugal (b. 1717)\n*1789 – Anders Dahl, Swedish botanist and physician (b. 1751)\n*1797 – John Griffin, 4th Baron Howard de Walden, English field marshal and politician, Lord Lieutenant of Essex (b. 1719)\n*1805 – William Paley, English priest and philosopher (b. 1743)\n*1848 – Annette von Droste-Hülshoff, German author and composer (b. 1797)\n*1849 – Benjamin D'Urban, English general and politician, Governor of British Guiana (b. 1777)\n*1895 – Ahmed Cevdet Pasha, Ottoman sociologist, historian, and jurist (b. 1822)\n*1899 – Rosa Bonheur, French painter and sculptor (b. 1822)\n*1912 – Austin Lane Crothers, American educator and politician, 46th Governor of Maryland (b. 1860)\n*1917 – Maksim Bahdanovič, Belarusian poet and critic (b. 1891)\n*1919 – Eliza Pollock, American archer (b. 1840)\n*  1919   – Madam C. J. Walker, American businesswoman and philanthropist, founded the Madame C.J. Walker Manufacturing Company (b. 1867)\n*1924 – Lyubov Popova, Russian painter and illustrator (b. 1889)\n*1926 – Symon Petliura, Ukrainian journalist and politician (b. 1879)\n*1927 – Payne Whitney, American businessman and philanthropist (b. 1876)\n*1930 – Randall Davidson, Scottish-English archbishop (b. 1848)\n*1934 – Gustav Holst, English trombonist, composer, and educator (b. 1874)\n*1937 – Henry Ossawa Tanner, American-French painter and illustrator (b. 1859)\n*1939 – Frank Watson Dyson, English astronomer and academic (b. 1868)\n*1942 – Emanuel Feuermann, Ukrainian-American cellist and educator (b. 1902)\n*1943 – Nils von Dardel, Swedish painter (b. 1888)\n*1948 – Witold Pilecki, Polish officer and Resistance leader (b. 1901)\n*1951 – Paula von Preradović, Croatian poet and author (b. 1887)\n*1954 – Robert Capa, Hungarian photographer and journalist (b. 1913)\n*1957 – Leo Goodwin, American swimmer, diver, and water polo player (b. 1883)\n*1968 – Georg von Küchler, German field marshal (b. 1881)\n*1970 – Tom Patey, Scottish mountaineer and author (b. 1932)\n*1977 – Yevgenia Ginzburg, Russian author (b. 1904)\n*1979 – Itzhak Bentov, Czech-Israeli engineer, mystic, and author (b. 1923)\n*  1979   – Amédée Gordini, Italian-born French racing driver and sports car manufacturer (b. 1899)\n*1981 – Ruby Payne-Scott, Australian physicist and astronomer (b. 1912)\n*  1981   – Fredric Warburg, English author and publisher (b. 1898)\n*1983 – Necip Fazıl Kısakürek, Turkish author, poet, and playwright (b. 1904)\n*  1983   – Idris of Libya (b. 1889)\n*  1983   – Jack Stewart, Canadian-American ice hockey player (b. 1917)\n*1986 – Chester Bowles, American journalist and politician, 22nd Under Secretary of State (b. 1901)\n*1990 – Vic Tayback, American actor (b. 1930)\n*1995 – Élie Bayol, French race car driver (b. 1914)\n*  1995   – Krešimir Ćosić, Croatian basketball player and coach, Naismith Basketball Hall of Famer 1996 (b. 1948)\n*  1995   – Dany Robin, French actress (b. 1927)\n*1996 – Renzo De Felice, Italian historian and author (b. 1929)\n*2003 – Sloan Wilson, American author and poet (b. 1920)\n*2004 – Roger Williams Straus, Jr., American publisher, co-founded Farrar, Straus and Giroux Publishing Company (b. 1917)\n*2005 – Sunil Dutt, Indian actor, director, producer, and politician (b. 1929)\n*  2005   – Robert Jankel, English businessman, founded Panther Westwinds (b. 1938)\n*  2005   – Graham Kennedy, Australian television host and actor (b. 1934)\n*  2005   – Ismail Merchant, Indian-born film producer and director (b. 1936)\n*  2005   – Zoran Mušič, Slovene painter and illustrator (b. 1909)\n*2007 – Charles Nelson Reilly, American actor, comedian, and director (b. 1931)\n*2008 – J. R. Simplot, American businessman, founded Simplot (b. 1909)\n*2009 – Haakon Lie, Norwegian politician (b. 1905)\n*2010 – Alexander Belostenny, Ukrainian basketball player (b. 1959)\n*  2010   – Michael H. Jordan, American businessman (b. 1936)\n*  2010   – Alan Hickinbotham, Australian footballer and coach (b. 1925)\n*  2010   – Gabriel Vargas, Mexican painter and illustrator (b. 1915)\n*  2010   – Jarvis Williams, American football player and coach (b. 1965) \n*2011 – Terry Jenner, Australian cricketer and coach (b. 1944)\n*2012 – William Hanley, American author and screenwriter (b. 1931)\n*  2012   – Peter D. Sieruta, American author and critic (b. 1958)\n*  2012   – Lou Watson, American basketball player and coach (b. 1924)\n*2013 – Mahendra Karma, Indian politician (b. 1950)\n*  2013   – Nand Kumar Patel, Indian politician (b. 1953)\n*2014 – David Allen, English cricketer (b. 1935)\n*  2014   – Marcel Côté, Canadian economist and politician (b. 1942)\n*  2014   – Wojciech Jaruzelski, Polish general and politician, 1st President of Poland (b. 1923)\n*  2014   – Herb Jeffries, American singer and actor (b. 1913)\n*  2014   – Toaripi Lauti, Tuvaluan educator and politician, 1st Prime Minister of Tuvalu (b. 1928)\n*  2014   – Matthew Saad Muhammad, American boxer and trainer (b. 1954)\n*2015 – George Braden, Canadian lawyer and politician, 2nd Premier of the Northwest Territories (b. 1949)\n*  2015   – Robert Lebel, Canadian bishop (b. 1924)\n\nHolidays and observances\n\n*Africa Day (African Union)\n*African Liberation Day (African Union, Rastafari)\n*Christian feast day:\n**Aldhelm\n**Bede\n**Gerard of Lunel\n**Mary Magdalene de Pazzi\n**Maximus (Mauxe) of Évreux\n**Pope Boniface IV\n**Pope Gregory VII\n**Pope Urban I\n**May 25 (Eastern Orthodox liturgics)\n*Day of Youth, celebrated on Josip Broz Tito's birthday (the former Socialist Federal Republic of Yugoslavia)\n*Earliest day on which Arbor Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Venezuela)\n*Earliest day on which Children's Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Hungary)\n*Earliest day on which Holiday of Saint Etchmiadzin can fall, while July 27 is the latest; celebrated on the 64th day after Easter. (Armenia)\n*Earliest day on which Memorial Day can fall, while May 31 is the latest; celebrated on the last Monday in May. (United States)\n*Earliest day on which Mother's Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Algeria, Dominican Republic, France (First Sunday of June, if Pentecost occurs on this day), Haiti, Mauritius, Morocco, Sweden, Tunisia)\n*Earliest day on which Turkmen Carpet Day can fall, while May 31 is the latest; celebrated on the last Sunday in May. (Turkmenistan)\n*First National Government / National Day (Argentina)\n*Geek Pride Day (geek culture)\n*Independence Day, celebrates the independence of Jordan from the United Kingdom in 1946.\n*Last bell (Russia, post-Soviet countries)\n*Liberation Day (Lebanon)\n*National Missing Children's Day (United States), and its related observances:\n**International Missing Children's Day \n*National Tap Dance Day (United States)\n*Towel Day in honour of the work of the writer Douglas Adams. May 25. http://en.wikipedia.org/?curid=19354."
  }
}
