{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19036",
  "eid" : "3731b160-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778601846,
  "textBody" : "The Mariana Trench or Marianas Trench is the deepest part of the world's oceans. It is located in the western Pacific Ocean, an average of 200 km to the east of the Mariana Islands, in the Western Pacific East of Philippines. It is a crescent-shaped scar in the Earth's crust, and measures about 2550 km long and 69 km wide on average. It reaches a maximum-known depth of 10994 m (± 40 m) at a small slot-shaped valley in its floor known as the Challenger Deep, at its southern end, although some unrepeated measurements place the deepest portion at 11034 m. For comparison: if Mount Everest were dropped into the trench at this point, its peak would still be over  underwater. In 2009, Marianas Trench was established as a United States National Monument.\n\nAt the bottom of the trench the water column above exerts a pressure of 1086  bar, more than 1,000 times the standard atmospheric pressure at sea level. At this pressure, the density of water is increased by 4.96%, so that 95 litres of water under the pressure of the Challenger Deep would contain the same mass as 100 litres at the surface. The temperature at the top  is 1 to.[http://www.infoplease.com/askeds/temperature-mariana-trench.html infoplease.com – The Temperature in the Mariana Trench], read 2012-05-13\n\nThe trench is not the part of the seafloor closest to the center of the Earth. This is because the Earth is not a perfect sphere; its radius is about 25 km less at the poles than at the equator.David R. Williams (17 November 2010).[http://nssdc.gsfc.nasa.gov/planetary/factsheet/earthfact.html Earth Fact Sheet]. National Space Science Data Center. Retrieved 23 March 2012. As a result, parts of the Arctic Ocean seabed are at least 13 km closer to the Earth's center than the Challenger Deep seafloor.\n\nXenophyophores have been found in the trench by Scripps Institution of Oceanography researchers at a record depth of  below the sea surface. On 17 March 2013, researchers from the Scottish Association for Marine Science reported data that suggested microbial life forms thrive within the trench.\n\nNames\n\nThe Mariana Trench is named for the nearby Mariana Islands (in turn named Las Marianas in honor of Spanish Queen Mariana of Austria, widow of Philip IV of Spain). The islands are part of the island arc that is formed on an over-riding plate, called the Mariana Plate (also named for the islands), on the western side of the trench.\n\nGeology\n\nThe Mariana Trench is part of the Izu-Bonin-Mariana subduction system that forms the boundary between two tectonic plates. In this system, the western edge of one plate, the Pacific Plate, is subducted (i.e., thrust) beneath the smaller Mariana Plate that lies to the west. Crustal material at the western edge of the Pacific Plate is some of the oldest oceanic crust on earth (up to 170 million years old), and is therefore cooler and more dense; hence its great height difference relative to the higher-riding (and younger) Mariana Plate. The deepest area at the plate boundary is the Mariana Trench proper.\n\nThe movement of the Pacific and Mariana plates is also indirectly responsible for the formation of the Mariana Islands. These volcanic islands are caused by Flux melting of the upper mantle due to release of water that is trapped in minerals of the subducted portion of the Pacific Plate.\n\nMeasurements\n\nThe trench was first sounded during the Challenger expedition in 1875, using a weighted rope, which recorded a depth of 4475 fathom. In 1877, a map was published called Tiefenkarte des Grossen Ozeans (\"Deep map of the Great Ocean\") by Petermann, which showed a Challenger Tief (\"Challenger deep\") at the location of that sounding. In 1899, USS Nero, a converted collier, recorded a depth of 5269 fathom.\n\nIn 1951, Challenger II surveyed the trench using echo sounding, a much more precise and vastly easier way to measure depth than the sounding equipment and drag lines used in the original expedition. During this survey, the deepest part of the trench was recorded when the Challenger II measured a depth of 5960 fathom at , known as the Challenger Deep.\n\nIn 1957, the Soviet vessel  reported a depth of 11034 m at a location dubbed the Mariana Hollow.\n\nIn 1962, the surface ship M.V. Spencer F. Baird recorded a maximum depth of 10915 m using precision depth gauges.\n\nIn 1984, the Japanese survey vessel Takuyō (拓洋) collected data from the Mariana Trench using a narrow, multi-beam echo sounder; it reported a maximum depth of 10924 m, also reported as 10920 m ±10 m. Remotely Operated Vehicle KAIKO reached the deepest area of the Mariana Trench and made the deepest diving record of 10911 m on March 24, 1995.[http://www.mhi.co.jp/technology/review/abstractj-32-6-427.html Development and Construction of Launcher System of 10000m‐Class Remotely Operated Vehicle KAIKO] Mitsubishi Heavy Industry\n\nDuring surveys carried out between 1997 and 2001, a spot was found along the Mariana Trench that had depth similar to that of the Challenger Deep, possibly even deeper. It was discovered while scientists from the Hawaii Institute of Geophysics and Planetology were completing a survey around Guam; they used a sonar mapping system towed behind the research ship to conduct the survey. This new spot was named the HMRG (Hawaii Mapping Research Group) Deep, after the group of scientists who discovered it.\n\nOn 1 June 2009, sonar mapping of the Challenger Deep by the Simrad EM120 sonar multibeam bathymetry system for deep water,  mapping aboard the RV Kilo Moana (mothership of the Nereus vehicle), indicated a spot with a depth of 10971 m. The sonar system uses phase and amplitude bottom detection, with an accuracy of better than 0.2% of water depth across the entire swath (implying that the depth figure is accurate to ± 22 m).\n\nIn 2011, it was announced at the American Geophysical Union Fall Meeting that a US Navy hydrographic ship equipped with a multibeam echosounder conducted a survey which mapped the entire trench to 100 m resolution. The mapping revealed the existence of four rocky outcrops thought to be former seamounts.\n\nThe Mariana Trench is a site chosen by researchers at Washington University and the Woods Hole Oceanographic Institution in 2012 for a seismic survey to investigate the subsurface water cycle. Using both ocean-bottom seismometers and hydrophones the scientists are able to map structures as deep as 60 miles beneath the surface.\n\nDescents\n\nFour descents have been achieved. The first was the manned descent by Swiss-designed, Italian-built, United States Navy-owned bathyscaphe Trieste which reached the bottom at 1:06 pm on 23 January 1960, with Don Walsh and Jacques Piccard on board. Iron shot was used for ballast, with gasoline for buoyancy. The onboard systems indicated a depth of 11,521 m (37,799 ft), but this was later revised to 10,916 m (35,814 ft). The depth was estimated from a conversion of pressure measured and calculations based on the water density from sea surface to seabed.\n\nThis was followed by the unmanned ROVs Kaikō in 1996 and Nereus in 2009. The first three expeditions directly measured very similar depths of . The fourth was made by Canadian film director James Cameron in 2012. On 26 March, he reached the bottom of the Mariana Trench in the submersible vessel Deepsea Challenger.\n\nIn July 2015, members of the National Oceanic and Atmospheric Administration, Oregon State University, and the Coast Guard submerged a hydrophone into the deepest part of the Mariana Trench, the Challenger Deep, never having deployed one past a mile. The titanium-shelled hydrophone was designed to withstand the immense pressure 7 miles under.Schneider, Kate (2016), “Eerie sounds from the bottom of the Earth”, News.com.au. Although researchers were unable to retrieve the hydrophone until November, the data capacity was full within the first 23 days. After months of analyzing the sounds, the experts were surprised to pick up natural and man-made sounds such as boats, earthquakes, a typhoon, and baleen whales. Due to the mission's success, the researchers announced plans to deploy a second hydrophone in 2017 for an extended period of time.\n\nPlanned descents\n\n, at least two other teams are planning piloted submarines to reach the bottom of the Mariana Trench. Triton Submarines, a Florida-based company that designs and manufactures private submarines, plans for a crew of three to take 120 minutes to reach the seabed. DOER Marine, a marine technology company based near San Francisco and set up in 1992, plans for a crew of two or three to take 90 minutes to reach the seabed.\n\nLife \n\nThe expedition conducted in 1960 claimed to have observed, with great surprise because of the high pressure, large creatures living at the bottom, such as a flatfish about  long, and shrimp. According to Piccard, \"The bottom appeared light and clear, a waste of firm diatomaceous ooze\". Many marine biologists are now skeptical of the supposed sighting of the flatfish, and it is suggested that the creature may instead have been a sea cucumber.[https://www.theguardian.com/environment/2011/jan/18/james-cameron-dives-deep-avatar \"James Cameron dives deep for Avatar\"], Guardian, 18 January 2011[http://www.nature.com/news/james-cameron-heads-into-the-abyss-1.10246 \"James Cameron heads into the abyss\"], Nature, 19 March 2012 During the second expedition, the unmanned vehicle Kaikō collected mud samples from the seabed. Tiny organisms were found to be living in those samples.\n\nIn July 2011, a research expedition deployed untethered landers, called dropcams, equipped with digital video and lights to explore this region of the deep sea.\nAmongst many other living organisms, some gigantic single-celled amoebas with a size of more than , belonging to the class of xenophyophores were observed. Xenophyophores are noteworthy for their size, their extreme abundance on the seafloor and their role as hosts for a variety of organisms.\n\nIn December 2014, a new species of snailfish was discovered at a depth of 8145 m, breaking the previous record for the deepest living fish seen on video.\n\nDuring the 2014 expedition, several new species were filmed including huge crustaceans known as supergiants. Deep-sea gigantism is the process where species grow larger than their shallow water relatives.\n\nIn May 2017 an unidentified type of snailfish was filmed at a depth of .\n\nPollution\n\nIn 2016, a research expedition looked at the chemical makeup of crustacean scavengers collected from a range of 7,841–10,250 metres within the trench. Within these organisms, the researchers found extremely elevated concentrations of PCBs, a chemical toxin banned for its environmental harm in the 1970s, concentrated at all depths within the sediment of the trench.\n\nPossible nuclear waste disposal site\n\nLike other oceanic trenches, the Mariana Trench has been proposed as a site for nuclear waste disposal, in the hope that tectonic plate subduction occurring at the site might eventually push the nuclear waste deep into the Earth's mantle, the second layer of the Earth. However, ocean dumping of nuclear waste is prohibited by international law. Furthermore, plate subduction zones are associated with very large megathrust earthquakes, the effects of which are unpredictable for the safety of long-term disposal of nuclear wastes within the hadopelagic ecosystem.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mariana Trench" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19036" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Mariana Trench or Marianas Trench is the deepest part of the world's oceans. It is located in the western Pacific Ocean, an average of 200 km to the east of the Mariana Islands, in the Western Pacific East of Philippines. It is a crescent-shaped scar in the Earth's crust, and measures about 2550 km long and 69 km wide on average. It reaches a maximum-known depth of 10994 m (± 40 m) at a small slot-shaped valley in its floor known as the Challenger Deep, at its southern end, although some unrepeated measurements place the deepest portion at 11034 m. For comparison: if Mount Everest were dropped into the trench at this point, its peak would still be over  underwater. In 2009, Marianas Trench was established as a United States National Monument.\n\nAt the bottom of the trench the water column above exerts a pressure of 1086  bar, more than 1,000 times the standard atmospheric pressure at sea level. At this pressure, the density of water is increased by 4.96%, so that 95 litres of water under the pressure of the Challenger Deep would contain the same mass as 100 litres at the surface. The temperature at the top  is 1 to.[http://www.infoplease.com/askeds/temperature-mariana-trench.html infoplease.com – The Temperature in the Mariana Trench], read 2012-05-13\n\nThe trench is not the part of the seafloor closest to the center of the Earth. This is because the Earth is not a perfect sphere; its radius is about 25 km less at the poles than at the equator.David R. Williams (17 November 2010).[http://nssdc.gsfc.nasa.gov/planetary/factsheet/earthfact.html Earth Fact Sheet]. National Space Science Data Center. Retrieved 23 March 2012. As a result, parts of the Arctic Ocean seabed are at least 13 km closer to the Earth's center than the Challenger Deep seafloor.\n\nXenophyophores have been found in the trench by Scripps Institution of Oceanography researchers at a record depth of  below the sea surface. On 17 March 2013, researchers from the Scottish Association for Marine Science reported data that suggested microbial life forms thrive within the trench.\n\nNames\n\nThe Mariana Trench is named for the nearby Mariana Islands (in turn named Las Marianas in honor of Spanish Queen Mariana of Austria, widow of Philip IV of Spain). The islands are part of the island arc that is formed on an over-riding plate, called the Mariana Plate (also named for the islands), on the western side of the trench.\n\nGeology\n\nThe Mariana Trench is part of the Izu-Bonin-Mariana subduction system that forms the boundary between two tectonic plates. In this system, the western edge of one plate, the Pacific Plate, is subducted (i.e., thrust) beneath the smaller Mariana Plate that lies to the west. Crustal material at the western edge of the Pacific Plate is some of the oldest oceanic crust on earth (up to 170 million years old), and is therefore cooler and more dense; hence its great height difference relative to the higher-riding (and younger) Mariana Plate. The deepest area at the plate boundary is the Mariana Trench proper.\n\nThe movement of the Pacific and Mariana plates is also indirectly responsible for the formation of the Mariana Islands. These volcanic islands are caused by Flux melting of the upper mantle due to release of water that is trapped in minerals of the subducted portion of the Pacific Plate.\n\nMeasurements\n\nThe trench was first sounded during the Challenger expedition in 1875, using a weighted rope, which recorded a depth of 4475 fathom. In 1877, a map was published called Tiefenkarte des Grossen Ozeans (\"Deep map of the Great Ocean\") by Petermann, which showed a Challenger Tief (\"Challenger deep\") at the location of that sounding. In 1899, USS Nero, a converted collier, recorded a depth of 5269 fathom.\n\nIn 1951, Challenger II surveyed the trench using echo sounding, a much more precise and vastly easier way to measure depth than the sounding equipment and drag lines used in the original expedition. During this survey, the deepest part of the trench was recorded when the Challenger II measured a depth of 5960 fathom at , known as the Challenger Deep.\n\nIn 1957, the Soviet vessel  reported a depth of 11034 m at a location dubbed the Mariana Hollow.\n\nIn 1962, the surface ship M.V. Spencer F. Baird recorded a maximum depth of 10915 m using precision depth gauges.\n\nIn 1984, the Japanese survey vessel Takuyō (拓洋) collected data from the Mariana Trench using a narrow, multi-beam echo sounder; it reported a maximum depth of 10924 m, also reported as 10920 m ±10 m. Remotely Operated Vehicle KAIKO reached the deepest area of the Mariana Trench and made the deepest diving record of 10911 m on March 24, 1995.[http://www.mhi.co.jp/technology/review/abstractj-32-6-427.html Development and Construction of Launcher System of 10000m‐Class Remotely Operated Vehicle KAIKO] Mitsubishi Heavy Industry\n\nDuring surveys carried out between 1997 and 2001, a spot was found along the Mariana Trench that had depth similar to that of the Challenger Deep, possibly even deeper. It was discovered while scientists from the Hawaii Institute of Geophysics and Planetology were completing a survey around Guam; they used a sonar mapping system towed behind the research ship to conduct the survey. This new spot was named the HMRG (Hawaii Mapping Research Group) Deep, after the group of scientists who discovered it.\n\nOn 1 June 2009, sonar mapping of the Challenger Deep by the Simrad EM120 sonar multibeam bathymetry system for deep water,  mapping aboard the RV Kilo Moana (mothership of the Nereus vehicle), indicated a spot with a depth of 10971 m. The sonar system uses phase and amplitude bottom detection, with an accuracy of better than 0.2% of water depth across the entire swath (implying that the depth figure is accurate to ± 22 m).\n\nIn 2011, it was announced at the American Geophysical Union Fall Meeting that a US Navy hydrographic ship equipped with a multibeam echosounder conducted a survey which mapped the entire trench to 100 m resolution. The mapping revealed the existence of four rocky outcrops thought to be former seamounts.\n\nThe Mariana Trench is a site chosen by researchers at Washington University and the Woods Hole Oceanographic Institution in 2012 for a seismic survey to investigate the subsurface water cycle. Using both ocean-bottom seismometers and hydrophones the scientists are able to map structures as deep as 60 miles beneath the surface.\n\nDescents\n\nFour descents have been achieved. The first was the manned descent by Swiss-designed, Italian-built, United States Navy-owned bathyscaphe Trieste which reached the bottom at 1:06 pm on 23 January 1960, with Don Walsh and Jacques Piccard on board. Iron shot was used for ballast, with gasoline for buoyancy. The onboard systems indicated a depth of 11,521 m (37,799 ft), but this was later revised to 10,916 m (35,814 ft). The depth was estimated from a conversion of pressure measured and calculations based on the water density from sea surface to seabed.\n\nThis was followed by the unmanned ROVs Kaikō in 1996 and Nereus in 2009. The first three expeditions directly measured very similar depths of . The fourth was made by Canadian film director James Cameron in 2012. On 26 March, he reached the bottom of the Mariana Trench in the submersible vessel Deepsea Challenger.\n\nIn July 2015, members of the National Oceanic and Atmospheric Administration, Oregon State University, and the Coast Guard submerged a hydrophone into the deepest part of the Mariana Trench, the Challenger Deep, never having deployed one past a mile. The titanium-shelled hydrophone was designed to withstand the immense pressure 7 miles under.Schneider, Kate (2016), “Eerie sounds from the bottom of the Earth”, News.com.au. Although researchers were unable to retrieve the hydrophone until November, the data capacity was full within the first 23 days. After months of analyzing the sounds, the experts were surprised to pick up natural and man-made sounds such as boats, earthquakes, a typhoon, and baleen whales. Due to the mission's success, the researchers announced plans to deploy a second hydrophone in 2017 for an extended period of time.\n\nPlanned descents\n\n, at least two other teams are planning piloted submarines to reach the bottom of the Mariana Trench. Triton Submarines, a Florida-based company that designs and manufactures private submarines, plans for a crew of three to take 120 minutes to reach the seabed. DOER Marine, a marine technology company based near San Francisco and set up in 1992, plans for a crew of two or three to take 90 minutes to reach the seabed.\n\nLife \n\nThe expedition conducted in 1960 claimed to have observed, with great surprise because of the high pressure, large creatures living at the bottom, such as a flatfish about  long, and shrimp. According to Piccard, \"The bottom appeared light and clear, a waste of firm diatomaceous ooze\". Many marine biologists are now skeptical of the supposed sighting of the flatfish, and it is suggested that the creature may instead have been a sea cucumber.[https://www.theguardian.com/environment/2011/jan/18/james-cameron-dives-deep-avatar \"James Cameron dives deep for Avatar\"], Guardian, 18 January 2011[http://www.nature.com/news/james-cameron-heads-into-the-abyss-1.10246 \"James Cameron heads into the abyss\"], Nature, 19 March 2012 During the second expedition, the unmanned vehicle Kaikō collected mud samples from the seabed. Tiny organisms were found to be living in those samples.\n\nIn July 2011, a research expedition deployed untethered landers, called dropcams, equipped with digital video and lights to explore this region of the deep sea.\nAmongst many other living organisms, some gigantic single-celled amoebas with a size of more than , belonging to the class of xenophyophores were observed. Xenophyophores are noteworthy for their size, their extreme abundance on the seafloor and their role as hosts for a variety of organisms.\n\nIn December 2014, a new species of snailfish was discovered at a depth of 8145 m, breaking the previous record for the deepest living fish seen on video.\n\nDuring the 2014 expedition, several new species were filmed including huge crustaceans known as supergiants. Deep-sea gigantism is the process where species grow larger than their shallow water relatives.\n\nIn May 2017 an unidentified type of snailfish was filmed at a depth of .\n\nPollution\n\nIn 2016, a research expedition looked at the chemical makeup of crustacean scavengers collected from a range of 7,841–10,250 metres within the trench. Within these organisms, the researchers found extremely elevated concentrations of PCBs, a chemical toxin banned for its environmental harm in the 1970s, concentrated at all depths within the sediment of the trench.\n\nPossible nuclear waste disposal site\n\nLike other oceanic trenches, the Mariana Trench has been proposed as a site for nuclear waste disposal, in the hope that tectonic plate subduction occurring at the site might eventually push the nuclear waste deep into the Earth's mantle, the second layer of the Earth. However, ocean dumping of nuclear waste is prohibited by international law. Furthermore, plate subduction zones are associated with very large megathrust earthquakes, the effects of which are unpredictable for the safety of long-term disposal of nuclear wastes within the hadopelagic ecosystem. Mariana Trench. http://en.wikipedia.org/?curid=19036."
  }
}
