{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17774",
  "eid" : "2e1aba40-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778586596,
  "textBody" : "This article is about the demographic features of the population of Lebanon, including population density, education level, health of the populace, economic status, religious affiliations and other aspects of the population.\n\nAbout 99% of the population of Lebanon includes numerous Muslim sects and Christian denominations. Because the matter of religious balance is a sensitive political issue, a national census has not been conducted since 1932, before the founding of the modern Lebanese state. Consequently, there is an absence of accurate data on the relative percentages of the population of the major religions and groups. The absence of data and comprehensive statistics concerns also concerns all other demographic studies unrelated to religious balance, due to the all but total inactivity of the concerned public agencies. The only recent (post-war) statistics available are estimates based on studies made by private organizations. There are from 8.6 to 14 million Lebanese and descendants of Lebanese worldwide.\n\nThe biggest study made after the independence on the Lebanese Population was made by the Central Administration of Statistics (in French: \"Administration Centrale de la Statistique\") under the direction of Robert Kasparian and Mgr. Grégoire Haddad's Social Movement: \"L'enquête par sondage sur la population active au Liban en 1970\"(in English: \"The survey on the active population in Lebanon in 1970\"). It was conducted on a sample of 130,000 individuals.\n\nEthnic groups\n\nLebanese\n\nEthnic background is an important factor in Lebanon. The country encompasses a great mix of cultural, religious, and ethnic groups which have been building up for more than 6,000 years. The Arabs invaded and occupied Phoenicia in the 7th century AD from Arabia. The predominant cultural backgrounds and ancestry of the Lebanese vary from Aramaean (Ancient Syria) to Canaanite (Phoenician), and Greek (Byzantine). Lebanese are overall genetically similar to the people of Cyprus and Malta and to the other modern Levantine populations, such as the Syrians, Israelis and Palestinians. The question of ethnic identity has come to revolve more around aspects of cultural self-identification more than descent. Religious affiliation has also become a substitute in some respects for ethnic affiliation.\n\nGenerally, the cultural and linguistic heritage of the Lebanese people is a blend of both indigenous Phoenician elements and the foreign cultures that have come to rule the land and its people over the course of thousands of years. Moreover, in a 2013 interview, the lead investigator, Pierre Zalloua, pointed out that genetic variation preceded religious variation and divisions: \"Lebanon already had well-differentiated communities with their own genetic peculiarities, but not significant differences, and religions came as layers of paint on top. There is no distinct pattern that shows that one community carries significantly more Phoenician than another\".\n\nReligious groups\n\nThe Lebanese Christians are some of the oldest Christians in the world, preceded only by the Coptic Christians of Kush (ancient Ethiopia) and Kemet (ancient Egypt). The Maronite Christians, belong to the West Syriac Rite. Their Liturgical language is the Syriac-Aramaic language. The Melkite Greek Catholics and the Greek Orthodox, tend to focus more on the Greco-Hellenistic heritage of the region from the days of the Byzantine Empire, and the fact that Greek was maintained as a liturgical language until very recently. Some Lebanese even claim partial descent from Crusader knights who ruled Lebanon for a couple of centuries during the Middle Ages, also backed by recent genetic studies which confirmed this among Lebanese people, especially in the north of the country that was under the Crusader County of Tripoli. This identification with non-Arab civilizations also exists in other religious communities, albeit not to the same extent.\n\nThe sectarian system\n\nLebanon's religious divisions are extremely complicated, and the country is made up by a multitude of religious groupings. The ecclesiastical and demographic patterns of the sects and denominations are complex. Divisions and rivalries between groups date back as far as 15 centuries, and still are a factor today. The pattern of settlement has changed little since the 7th century, but instances of civil strife and ethnic cleansing, most recently during the Lebanese Civil War, has brought some important changes to the religious map of the country. (See also History of Lebanon.)\n\nLebanon has by far the largest proportion of Christians of any Middle Eastern country, but both Christians and Muslims are sub-divided into many splinter sects and denominations. Population statistics are highly controversial. The various denominations and sects each have vested interests in inflating their own numbers. Shias, Sunnis, Maronites and Greek Orthodox (the four largest denominations) all often claim that their particular religious affiliation holds a majority in the country, adding up to over 150% of the total population, even before counting the other denominations. One of the rare things that most Lebanese religious leaders will agree on is to avoid a new general census, for fear that it could trigger a new round of denominational conflict. The last official census was performed in 1932.\n\nReligion has traditionally been of overriding importance in defining the Lebanese population. Dividing state power between the religious denominations and sects, and granting religious authorities judicial power, dates back to Ottoman times (the millet system). The practice was reinforced during French mandate, when Christian groups were granted privileges. This system of government, while partly intended as a compromise between sectarian demands, has caused tensions that still dominate Lebanese politics to this day.\n\nThe Christian population majority is believed to have ended in the early 1960s, but government leaders would agree to no change in the political power balance. This led to Muslim demands of increased representation, and the constant sectarian tension slid into violent conflict in 1958 (prompting U.S. intervention) and again in the grueling Lebanese Civil War, in 1975–90.\n\nThe balance of power has been slightly adjusted in the 1943 National Pact, an informal agreement struck at independence, in which positions of power were divided according to the 1932 census. The Sunni elite was then accorded more power, but Maronites continued to dominate the system. The sectarian balance was again adjusted towards the Muslim side but simultaneously further reinforced and legitimized. Shia Muslims (by now the second largest sect) then gained additional representation in the state apparatus, and the obligatory Christian-Muslim representation in Parliament was downgraded from a 6:5 to a 1:1 ratio. Christians of various denominations were then generally thought to constitute about 40% of the population, although often Muslim leaders would cite lower numbers, and some Christians would claim that they still held a majority of the population.\n\n18 recognized religious groups\n\nThe present Lebanese Constitution officially acknowledges 18 religious groups (see below). These have the right to handle family law according to their own courts and traditions, and they are the basic players in Lebanon's complex sectarian politics.\n\n* Alawite\n* Armenian Catholic\n* Armenian Orthodox\n* Assyrian Church of the East\n* Chaldean Catholic\n* Copts\n* Druze\n* Greek Orthodox\n* Isma'ili\n* Jewish\n* Latin Catholic\n* Maronite Catholic\n* Melkite Greek Catholic\n* Protestant\n* Sunni\n* Shia\n* Syriac Catholic\n* Syriac Orthodox\n\nReligious population statistics\n\nNote: stateless Palestinians and Syrians are not included in the statistics below since they do not hold Lebanese citizenship. The numbers only include the present population of Lebanon, and not the Lebanese diaspora.\n\nThe 1932 census stated that Christians made up 51% of the population. Maronites, largest among the Christian denomination and then largely in control of the state apparatus, accounted for 29% of the total resident population.\nA 2012 study conducted by Statistics Lebanon, a Beirut-based research firm, cited by the United States Department of State found that of Lebanon's population of approximately 4.3 million is estimated to be:\n\n* 54% Islam (Shia and Sunni, 27% each)\n* 40.5% Christian (21% Maronite, 8% Eastern Orthodox, 5% Melkite Catholic, 1% Protestant, 6% other Christian denominations non-native to Lebanon like Armenian Orthodox, Armenian Catholic, Syriac Orthodox, Syriac Catholic, Roman Catholic, Chaldean, Assyrian, and Copt)\n* 5.5% Druze (included within the Muslim group in the Lebanese Constitution.)\n\nThere is also a very small number of other religious minorities such as, Bahais, Buddhists, Hindus and Mormons.\n\nThe CIA World Factbook specifies that of those residing in Lebanon, 59.7% are Muslims (Sunni, Shia, Druze, Alawites, and Sufi) and 39% are Christians (mostly Maronites, Eastern Orthodox, Melkite Catholics, Protestant, Armenian Apostolic, Assyrian Church of the East, Syriac Orthodox, Chaldean Catholic, Syrian Catholic) and 1.3% \"Other\".\n\nMuslims\n\nAccording to the CIA World Factbook, the Muslim population is estimated at around 59.5% within the Lebanese territory and of the 8.6–14 million Lebanese diaspora is believed by some to be about 20% of the total population. Sectarian Breakdown:\n\n* The Shia Muslims are around 27%–29% of the total population. The Speaker of Parliament is always a Shi'a Muslim, as it is the only high post that Shi'as are eligible for. The Shiites are largely concentrated in northern and western Beqaa, Southern Lebanon and in the southern suburbs of Beirut.\n* The Sunni Muslims constitute also about 27%–29%  of the total population. Sunni notables traditionally held power in the Lebanese state together, and they are still the only sect eligible for the post of Prime Minister Sunnis are mostly concentrated in west Beirut, Tripoli, Sidon, Central and Western Beqaa, and Akkar in the north.\n* Other Muslim sects have a small presence, with the Isma'ilis and Alawites combined comprising less than 1% of the population and usually included among Lebanese Shia Muslims.\n\nChristians\n\nIt is estimated that the Christian population in Lebanon makes up about 40.5% within the Lebanese territory and of the 8.6–14 million Lebanese diaspora is believed by some to be about 80% of the total population. Sectarian Breakdown:\n\n* The Maronites are the largest of the Christian groups about 21% of the population of Lebanon. They have had a long and continuous association with the Roman Catholic Church, but have their own patriarch, liturgy, and customs. Traditionally they had good relations with the Western world, especially France and the Vatican.[http://www.asianews.it/news-en/Fr.-Samir:-Benedict-XVI’s-courage-carries-the-Churches-of-the-Middle-East-and-the-Arab-Spring-25780.html Fr. Samir: Benedict XVI’s courage carries the Churches of the Middle East and the Arab Spring] They traditionally dominated the Lebanese government. Their influence in later years has diminished, because of their relative decrease in numbers but also due to the Syrian occupation of Lebanon, which generally benefited Muslim communities, and was resisted by most Maronites. Today the Maronites are believed to compose about 21% of the population, scattered around the Lebanese countryside but with heavy concentrations on Mount Lebanon and in Beirut (Greater Beirut).\n* The second largest Christian group is the Eastern Orthodox that constitute at least 8% of the population. The church exists in many parts of the Arab world and Eastern Orthodox Christians have often been noted for pan-Arab or pan-Syrian leanings; it has had less dealings with Western countries than the Maronites. The Eastern Orthodox Lebanese Christians have a long and continuous association with Eastern Orthodox European countries like Greece, Cyprus, Russia, Ukraine, Bulgaria, Serbia and Romania. The Deputy Speaker of Parliament and the deputy Prime Minister are reserved for Eastern Orthodox Christians.\n* The Melkite Catholics are thought to constitute about 5% of the population.\n* The Protestants are thought to constitute about 1% of the population.\n* The remaining Christian churches are thought to constitute another 6% of the population (Roman Catholics, Armenian Apostolic, Armenian Catholic, Syriac Orthodox, Syriac Catholic, and Assyrians.)\n\nDruze\n\nThe Druze constitute 5% of the population and can be found primarily in Mount Lebanon and the Shouf District.\n\nOther religions\n\nOther religions account for only an estimated 0.3% of the population mainly foreign temporary workers, according to the CIA Factbook. There remains a very small Jewish population, traditionally centered in Beirut. It has been larger: most Jews left the country after  the Lebanese Civil War (1975–1990) as thousands of Lebanese did at that time.\n\nDiaspora\n\nApart from the four and a half million citizens of Lebanon proper, there is a sizeable Lebanese diaspora. There are more Lebanese people living outside of Lebanon (8.6-14 million), than within (4.3 million). The majority of the diaspora population consists of Lebanese Christians; however, there are some who are Muslim. They trace their origin to several waves of Christian emigration, starting with the exodus that followed the 1860 Lebanon conflict in Ottoman Syria.\n\nUnder the current Lebanese nationality law, diaspora Lebanese do not have an automatic right of return to Lebanon. Due to varying degrees of assimilation and high degree of interethnic marriages, most diaspora Lebanese have not passed on the Arabic language to their children, while still maintaining a Lebanese ethnic identity.\n\nMany Lebanese families are economically and politically prominent in several Latin American countries (in 2007 Mexican Carlos Slim Helú, son of Lebanese immigrants, was determined to be the wealthiest man in the World by Fortune Magazine), and make up a substantial portion of the Lebanese American community in the United States. The largest Lebanese diaspora is located in Brazil, where about 6–7 million people have Lebanese descent (see Lebanese Brazilian). In Argentina, there is also a large Lebanese diaspora of approximately 1.5 million people having Lebanese descent. (see Lebanese Argentine). In Canada, there is also a large Lebanese diaspora of approximately 250,000-500,000 people having Lebanese descent. (see Lebanese Canadians).\n\nThe large size of Lebanon's diaspora may be partly explained by the historical and cultural tradition of seafaring and traveling, which stretches back to Lebanon's ancient Phoenician origins and its role as a \"gateway\" of relations between Europe and the Middle East. It has been commonplace for Lebanese citizens to emigrate in search of economic prosperity. Furthermore, on several occasions in the last two centuries the Lebanese population has endured periods of ethnic cleansing and displacement (for example, 1840–60 and 1975–90). These factors have contributed to the geographical mobility of the Lebanese people.\n\nWhile under Syrian occupation, Beirut passed legislation which prevented second-generation Lebanese of the diaspora from automatically obtaining Lebanese citizenship. This has reinforced the émigré status of many diaspora Lebanese. There is currently a campaign by those Lebanese of the diaspora who already have Lebanese citizenship to attain the vote from abroad, which has been successfully passed in the Lebanese parliament and will be effective as of 2013 which is the next parliamentary elections. If suffrage was to be extended to these 1.2 million Lebanese émigré citizens, it would have a significant political effect, since as many as 80% of them are believed to be Christian.\n\nLebanese Civil War refugees and displaced persons\n\nWith no official figures available, it is estimated that 600,000–900,000 persons fled the country during the Lebanese Civil War (1975–90). Although some have since returned, this permanently disturbed Lebanese population growth and greatly complicated demographic statistics.\n\nAnother result of the war was a large number of internally displaced persons. This especially affected the southern Shia community, as Israeli invasion of southern Lebanon in 1978, 1982 and 1996 prompted waves of mass emigration, in addition to the continual strain of occupation and fighting between Israel and Hezbollah (mainly 1982 to 2000).\n\nMany Shias from Southern Lebanon resettled in the suburbs south of Beirut. After the war, the pace of Christian emigration accelerated, as many Christians felt discriminated against in a Lebanon under increasingly oppressive Syrian occupation.\n\nAccording to a UNDP study, as much as 10% of the Lebanese had a disability in 1990.[http://www.irinnews.org/node/195086 LEBANON: Disabled remain marginalized, study finds], IRIN. Accessed August 6, 2009. Other studies have pointed to the fact that this portion of society is highly marginalized due to the lack of educational and governmental support of their advancement.\n\nLanguages\n\nArabic is the official language. Lebanese Arabic is mostly spoken in non-official contexts. French & English are taught in many schools from a young age & spoken fluently. Armenian is taught & spoken as well.\n\nCIA World Factbook demographic statistics\n\nThe following demographic statistics are from the CIA World Factbook, unless otherwise indicated.\n* Population:\nTotal population: 5,882,562 (July 2014 est.)\n*::Lebanese nationals: 4,132,000 (July 2014 est.)\n*::Syrian refugees: 1,077,000 registered at the United Nations High Commissioner for Refugees (June 2014 est.)\n*::Palestinian refugees: 450,000 (May 2014 est.)\n* Age structure:\n* 0–14 years: 21.5% (male 487,930/female 464,678)\n* 15–64 years: 68% (male 1,370,628/female 1,466,173)\n* 65 years and over: 10.5% (male 173,073/female 200,619) (2010 est.)\n* Median age:\nTotal: 29.34 years\nMale: 27.28 years\nFemale: 31.43 years (2011 est.)\n* Population growth rate:\n1.04% (2005 est.)\n0.96% (2011 est.) according to CIA Factbook\n* Net migration rate:\n−4.43 migrant(s)/1,000 population (2011 est.)\n* Sex ratio: \nat birth: 1.05 male(s)/female\nunder 15 years: 1.04 male(s)/female\n15–64 years: 0.92 male(s)/female\n65 years and over: 0.83 male(s)/female\ntotal population: 0.94 male(s)/female (2005 est.)\n* Life expectancy at birth:\ntotal population: 79.82 years\nmale: 77.28 years\nfemale: 80.36 years (2010 est.)\n\nVital statistics\n\nUN estimates\n\nRegistered births and deaths \n\nImmigrants and ethnic groups\n\nThere are substantial numbers of immigrants from other Arab countries (mainly Palestine, Syria, Iraq and Egypt) and non-Arab-speaking Muslim countries. Also, recent years have seen an influx of people from Ethiopia and South East Asian countries such as Indonesia, the Philippines, Malaysia, Sri Lanka, as well as smaller numbers of other immigrant minorities, Colombians and Brazilians (of Lebanese descent themselves). Most of these are employed as guest workers in the same fashion as Syrians and Palestinians, and entered the country to search for employment in the post-war reconstruction of Lebanon. Apart from the Palestinians, there are approximately 180,000 stateless persons in Lebanon.\n\nArmenians, Jews and Iranians\n\nLebanese Armenians, Jews and Iranians form more distinct ethnic minorities, all of them in possession of a separate languages (Armenian, Hebrew, Persian) and a national home area (Armenia, Israel, Iran) outside of Lebanon. However, they total  5% of the population.\n\nFrench and Italians\n\nDuring the French Mandate of Lebanon, there was a fairly large French minority and a tiny Italian minority. Most of the French and Italian settlers left after Lebanese independence in 1943 and only 22,000 French Lebanese and 4,300 Italian Lebanese continue to live in Lebanon. The most important legacy of the French Mandate is the frequent use and knowledge of the French language by most of the educated Lebanese people.\n\nPalestinians\n\nAround 450,000 Palestinian refugees were registered in Lebanon with the UNRWA in 2014, who are refugees or descendants of refugees from the 1948 Arab–Israeli War. Some 53% live in 12 Palestine refugee camps, who \"suffer from serious problems\" such as poverty and overcrowding. Some of these may have emigrated during the civil war, but there are no reliable figures available. There are also a number of Palestinians who are not registered as UNRWA refugees, because they left earlier than 1948 or were not in need of material assistance. The exact number of Palestinians remain a subject of great dispute and the Lebanese government will not provide an estimate. A figure of 400,000 Palestinian refugees would mean that Palestinians constitute more than 10% of the resident population of Lebanon.\n\nPalestinians living in Lebanon are considered foreigners and are under the same restrictions on employment applied to other foreigners. Prior to 2010, they were under even more restrictive employment rules which permitted, other than work for the U.N., only the most menial employment. They are not allowed to attend public schools, own property, or make an enforceable will. Palestinian refugees, who constitute nearly a tenth of the country's population, have long been denied basic rights in Lebanon. They are not allowed to attend public schools, own property or pass on inheritances, measures Lebanon says it has adopted to preserve their right to return to their property in what constitutes Israel now.\n\nTheir presence is controversial, and resisted by large segments of the Christian population, who argue that the primarily Sunni Muslim Palestinians dilute Christian numbers. Many Shia Muslims also look unfavorably upon the Palestinian presence since the refugee camps have tended to be concentrated in their home areas. The Lebanese Sunnis, however, would be happy to see these Palestinians given the Lebanese nationality, thus increasing the Lebanese Sunni population by well over 10% and tipping the fragile electoral balance much in favor of the Sunnis. Late prime minister Rafiq Hariri —himself a Sunni— had hinted on more than one occasion on the inevitability of granting these refugees Lebanese citizenship. Thus far the refugees are Lebanese citizenship as well as many rights enjoyed by the rest of the population, and are confined to severely overcrowded refugee camps, in which construction rights are severely constricted.\n\nPalestinians may not work in a large number of professions, such as lawyers and doctors. However, after negotiations between Lebanese authorities and ministers from the Palestinian National Authority some professions for Palestinians were allowed (such as taxi driver and construction worker). The material situation of the Palestinian refugees in Lebanon is difficult, and they are believed to constitute the poorest community in Lebanon, as well as the poorest Palestinian community with the possible exception of Gaza Strip refugees. Their primary sources of income are UNRWA aid and menial labor sought in competition with Syrian guest workers.\n\nThe Palestinians are almost totally Sunni Muslim, though at some point Christians counted as high as 40% with Muslims at 60%. The numbers of Palestinian Christians has diminished in later years, as many have managed to leave Lebanon. During the Lebanese Civil War, Palestinian Christians sided with the rest of the Palestinian community, instead of allying with Lebanese Eastern Orthodox or other Christian communities.\n\n60,000 Palestinians have received Lebanese citizenship, including most Christian Palestinians.\n\nSyrians\n\nIn 1976, the then Syrian president Hafez al-Assad sent troops into Lebanon to fight PLO forces on behalf of Christian militias. This led to escalated fighting until a cease-fire agreement later that year that allowed for the stationing of Syrian troops within Lebanon. The Syrian presence in Lebanon quickly changed sides; soon after they entered Lebanon they had flip-flopped and began to fight the Christian nationalists in Lebanon they allegedly entered the country to protect. The Kateab Party and the Lebanese Forces under Bachir Gemayel strongly resisted the Syrians in Lebanon. In 1989, 40,000 Syrian troops remained in central and eastern Lebanon under the supervision of the Syrian government. Although, the Taif Accord, established in the same year, called for the removal of Syrian troops and transfer of arms to the Lebanese army, the Syrian Army remained in Lebanon until the Lebanese Cedar Revolution in 2005 to end the Syrian occupation of Lebanon.\n\nIn 1994, the Lebanese government under the pressure of the Syrian government, gave Lebanese passport to thousands of Syrians.\n\nThere are nearly 1.08 million registered Syrian refugees in Lebanon.\n\nAssyrians\n\nThere are an estimated 40,000 to 80,000 Iraqi Assyrian refugees in Lebanon. The vast majority of them are undocumented, with a large number having been deported or put in prison. They belong to various denominations, including the Assyrian Church of the East, Chaldean Catholic Church, and Syriac Catholic Church.\n\nIraqis\n\nDue to the US-led invasion of Iraq, Lebanon has received a mass influx of Iraqi refugees numbering at around 100,000. The vast majority of them are undocumented, with a large number having been deported or put in prison.\n\nKurds\n\nThere are an estimated 60,000 to 100,000 Kurdish refugees from Turkey and Syria within Lebanese territory. Many of them are undocumented. As of 2012, around 40% of all Kurds in Lebanon do not have Lebanese citizenship.\n\nTurks\n\nThe Turkish people began to migrate to Lebanon once the Ottoman sultan Selim I conquered the region in 1516. Turks were encouraged to stay in Lebanon by being rewarded with land and money.  This has seen a remaining legacy, as large amounts of ethnic Lebanese, mainly within the Sunni community, have a recent Turkish ancestor. Today the Turkish minority numbers approximately 80,000. Moreover, since the Syrian Civil War, approximately 125,000 to 150,000 Syrian Turkmen refugees arrived in Lebanon, and hence they now outnumber the long established Turkish minority who settled since the Ottoman era.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Demographics of Lebanon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17774" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "This article is about the demographic features of the population of Lebanon, including population density, education level, health of the populace, economic status, religious affiliations and other aspects of the population.\n\nAbout 99% of the population of Lebanon includes numerous Muslim sects and Christian denominations. Because the matter of religious balance is a sensitive political issue, a national census has not been conducted since 1932, before the founding of the modern Lebanese state. Consequently, there is an absence of accurate data on the relative percentages of the population of the major religions and groups. The absence of data and comprehensive statistics concerns also concerns all other demographic studies unrelated to religious balance, due to the all but total inactivity of the concerned public agencies. The only recent (post-war) statistics available are estimates based on studies made by private organizations. There are from 8.6 to 14 million Lebanese and descendants of Lebanese worldwide.\n\nThe biggest study made after the independence on the Lebanese Population was made by the Central Administration of Statistics (in French: \"Administration Centrale de la Statistique\") under the direction of Robert Kasparian and Mgr. Grégoire Haddad's Social Movement: \"L'enquête par sondage sur la population active au Liban en 1970\"(in English: \"The survey on the active population in Lebanon in 1970\"). It was conducted on a sample of 130,000 individuals.\n\nEthnic groups\n\nLebanese\n\nEthnic background is an important factor in Lebanon. The country encompasses a great mix of cultural, religious, and ethnic groups which have been building up for more than 6,000 years. The Arabs invaded and occupied Phoenicia in the 7th century AD from Arabia. The predominant cultural backgrounds and ancestry of the Lebanese vary from Aramaean (Ancient Syria) to Canaanite (Phoenician), and Greek (Byzantine). Lebanese are overall genetically similar to the people of Cyprus and Malta and to the other modern Levantine populations, such as the Syrians, Israelis and Palestinians. The question of ethnic identity has come to revolve more around aspects of cultural self-identification more than descent. Religious affiliation has also become a substitute in some respects for ethnic affiliation.\n\nGenerally, the cultural and linguistic heritage of the Lebanese people is a blend of both indigenous Phoenician elements and the foreign cultures that have come to rule the land and its people over the course of thousands of years. Moreover, in a 2013 interview, the lead investigator, Pierre Zalloua, pointed out that genetic variation preceded religious variation and divisions: \"Lebanon already had well-differentiated communities with their own genetic peculiarities, but not significant differences, and religions came as layers of paint on top. There is no distinct pattern that shows that one community carries significantly more Phoenician than another\".\n\nReligious groups\n\nThe Lebanese Christians are some of the oldest Christians in the world, preceded only by the Coptic Christians of Kush (ancient Ethiopia) and Kemet (ancient Egypt). The Maronite Christians, belong to the West Syriac Rite. Their Liturgical language is the Syriac-Aramaic language. The Melkite Greek Catholics and the Greek Orthodox, tend to focus more on the Greco-Hellenistic heritage of the region from the days of the Byzantine Empire, and the fact that Greek was maintained as a liturgical language until very recently. Some Lebanese even claim partial descent from Crusader knights who ruled Lebanon for a couple of centuries during the Middle Ages, also backed by recent genetic studies which confirmed this among Lebanese people, especially in the north of the country that was under the Crusader County of Tripoli. This identification with non-Arab civilizations also exists in other religious communities, albeit not to the same extent.\n\nThe sectarian system\n\nLebanon's religious divisions are extremely complicated, and the country is made up by a multitude of religious groupings. The ecclesiastical and demographic patterns of the sects and denominations are complex. Divisions and rivalries between groups date back as far as 15 centuries, and still are a factor today. The pattern of settlement has changed little since the 7th century, but instances of civil strife and ethnic cleansing, most recently during the Lebanese Civil War, has brought some important changes to the religious map of the country. (See also History of Lebanon.)\n\nLebanon has by far the largest proportion of Christians of any Middle Eastern country, but both Christians and Muslims are sub-divided into many splinter sects and denominations. Population statistics are highly controversial. The various denominations and sects each have vested interests in inflating their own numbers. Shias, Sunnis, Maronites and Greek Orthodox (the four largest denominations) all often claim that their particular religious affiliation holds a majority in the country, adding up to over 150% of the total population, even before counting the other denominations. One of the rare things that most Lebanese religious leaders will agree on is to avoid a new general census, for fear that it could trigger a new round of denominational conflict. The last official census was performed in 1932.\n\nReligion has traditionally been of overriding importance in defining the Lebanese population. Dividing state power between the religious denominations and sects, and granting religious authorities judicial power, dates back to Ottoman times (the millet system). The practice was reinforced during French mandate, when Christian groups were granted privileges. This system of government, while partly intended as a compromise between sectarian demands, has caused tensions that still dominate Lebanese politics to this day.\n\nThe Christian population majority is believed to have ended in the early 1960s, but government leaders would agree to no change in the political power balance. This led to Muslim demands of increased representation, and the constant sectarian tension slid into violent conflict in 1958 (prompting U.S. intervention) and again in the grueling Lebanese Civil War, in 1975–90.\n\nThe balance of power has been slightly adjusted in the 1943 National Pact, an informal agreement struck at independence, in which positions of power were divided according to the 1932 census. The Sunni elite was then accorded more power, but Maronites continued to dominate the system. The sectarian balance was again adjusted towards the Muslim side but simultaneously further reinforced and legitimized. Shia Muslims (by now the second largest sect) then gained additional representation in the state apparatus, and the obligatory Christian-Muslim representation in Parliament was downgraded from a 6:5 to a 1:1 ratio. Christians of various denominations were then generally thought to constitute about 40% of the population, although often Muslim leaders would cite lower numbers, and some Christians would claim that they still held a majority of the population.\n\n18 recognized religious groups\n\nThe present Lebanese Constitution officially acknowledges 18 religious groups (see below). These have the right to handle family law according to their own courts and traditions, and they are the basic players in Lebanon's complex sectarian politics.\n\n* Alawite\n* Armenian Catholic\n* Armenian Orthodox\n* Assyrian Church of the East\n* Chaldean Catholic\n* Copts\n* Druze\n* Greek Orthodox\n* Isma'ili\n* Jewish\n* Latin Catholic\n* Maronite Catholic\n* Melkite Greek Catholic\n* Protestant\n* Sunni\n* Shia\n* Syriac Catholic\n* Syriac Orthodox\n\nReligious population statistics\n\nNote: stateless Palestinians and Syrians are not included in the statistics below since they do not hold Lebanese citizenship. The numbers only include the present population of Lebanon, and not the Lebanese diaspora.\n\nThe 1932 census stated that Christians made up 51% of the population. Maronites, largest among the Christian denomination and then largely in control of the state apparatus, accounted for 29% of the total resident population.\nA 2012 study conducted by Statistics Lebanon, a Beirut-based research firm, cited by the United States Department of State found that of Lebanon's population of approximately 4.3 million is estimated to be:\n\n* 54% Islam (Shia and Sunni, 27% each)\n* 40.5% Christian (21% Maronite, 8% Eastern Orthodox, 5% Melkite Catholic, 1% Protestant, 6% other Christian denominations non-native to Lebanon like Armenian Orthodox, Armenian Catholic, Syriac Orthodox, Syriac Catholic, Roman Catholic, Chaldean, Assyrian, and Copt)\n* 5.5% Druze (included within the Muslim group in the Lebanese Constitution.)\n\nThere is also a very small number of other religious minorities such as, Bahais, Buddhists, Hindus and Mormons.\n\nThe CIA World Factbook specifies that of those residing in Lebanon, 59.7% are Muslims (Sunni, Shia, Druze, Alawites, and Sufi) and 39% are Christians (mostly Maronites, Eastern Orthodox, Melkite Catholics, Protestant, Armenian Apostolic, Assyrian Church of the East, Syriac Orthodox, Chaldean Catholic, Syrian Catholic) and 1.3% \"Other\".\n\nMuslims\n\nAccording to the CIA World Factbook, the Muslim population is estimated at around 59.5% within the Lebanese territory and of the 8.6–14 million Lebanese diaspora is believed by some to be about 20% of the total population. Sectarian Breakdown:\n\n* The Shia Muslims are around 27%–29% of the total population. The Speaker of Parliament is always a Shi'a Muslim, as it is the only high post that Shi'as are eligible for. The Shiites are largely concentrated in northern and western Beqaa, Southern Lebanon and in the southern suburbs of Beirut.\n* The Sunni Muslims constitute also about 27%–29%  of the total population. Sunni notables traditionally held power in the Lebanese state together, and they are still the only sect eligible for the post of Prime Minister Sunnis are mostly concentrated in west Beirut, Tripoli, Sidon, Central and Western Beqaa, and Akkar in the north.\n* Other Muslim sects have a small presence, with the Isma'ilis and Alawites combined comprising less than 1% of the population and usually included among Lebanese Shia Muslims.\n\nChristians\n\nIt is estimated that the Christian population in Lebanon makes up about 40.5% within the Lebanese territory and of the 8.6–14 million Lebanese diaspora is believed by some to be about 80% of the total population. Sectarian Breakdown:\n\n* The Maronites are the largest of the Christian groups about 21% of the population of Lebanon. They have had a long and continuous association with the Roman Catholic Church, but have their own patriarch, liturgy, and customs. Traditionally they had good relations with the Western world, especially France and the Vatican.[http://www.asianews.it/news-en/Fr.-Samir:-Benedict-XVI’s-courage-carries-the-Churches-of-the-Middle-East-and-the-Arab-Spring-25780.html Fr. Samir: Benedict XVI’s courage carries the Churches of the Middle East and the Arab Spring] They traditionally dominated the Lebanese government. Their influence in later years has diminished, because of their relative decrease in numbers but also due to the Syrian occupation of Lebanon, which generally benefited Muslim communities, and was resisted by most Maronites. Today the Maronites are believed to compose about 21% of the population, scattered around the Lebanese countryside but with heavy concentrations on Mount Lebanon and in Beirut (Greater Beirut).\n* The second largest Christian group is the Eastern Orthodox that constitute at least 8% of the population. The church exists in many parts of the Arab world and Eastern Orthodox Christians have often been noted for pan-Arab or pan-Syrian leanings; it has had less dealings with Western countries than the Maronites. The Eastern Orthodox Lebanese Christians have a long and continuous association with Eastern Orthodox European countries like Greece, Cyprus, Russia, Ukraine, Bulgaria, Serbia and Romania. The Deputy Speaker of Parliament and the deputy Prime Minister are reserved for Eastern Orthodox Christians.\n* The Melkite Catholics are thought to constitute about 5% of the population.\n* The Protestants are thought to constitute about 1% of the population.\n* The remaining Christian churches are thought to constitute another 6% of the population (Roman Catholics, Armenian Apostolic, Armenian Catholic, Syriac Orthodox, Syriac Catholic, and Assyrians.)\n\nDruze\n\nThe Druze constitute 5% of the population and can be found primarily in Mount Lebanon and the Shouf District.\n\nOther religions\n\nOther religions account for only an estimated 0.3% of the population mainly foreign temporary workers, according to the CIA Factbook. There remains a very small Jewish population, traditionally centered in Beirut. It has been larger: most Jews left the country after  the Lebanese Civil War (1975–1990) as thousands of Lebanese did at that time.\n\nDiaspora\n\nApart from the four and a half million citizens of Lebanon proper, there is a sizeable Lebanese diaspora. There are more Lebanese people living outside of Lebanon (8.6-14 million), than within (4.3 million). The majority of the diaspora population consists of Lebanese Christians; however, there are some who are Muslim. They trace their origin to several waves of Christian emigration, starting with the exodus that followed the 1860 Lebanon conflict in Ottoman Syria.\n\nUnder the current Lebanese nationality law, diaspora Lebanese do not have an automatic right of return to Lebanon. Due to varying degrees of assimilation and high degree of interethnic marriages, most diaspora Lebanese have not passed on the Arabic language to their children, while still maintaining a Lebanese ethnic identity.\n\nMany Lebanese families are economically and politically prominent in several Latin American countries (in 2007 Mexican Carlos Slim Helú, son of Lebanese immigrants, was determined to be the wealthiest man in the World by Fortune Magazine), and make up a substantial portion of the Lebanese American community in the United States. The largest Lebanese diaspora is located in Brazil, where about 6–7 million people have Lebanese descent (see Lebanese Brazilian). In Argentina, there is also a large Lebanese diaspora of approximately 1.5 million people having Lebanese descent. (see Lebanese Argentine). In Canada, there is also a large Lebanese diaspora of approximately 250,000-500,000 people having Lebanese descent. (see Lebanese Canadians).\n\nThe large size of Lebanon's diaspora may be partly explained by the historical and cultural tradition of seafaring and traveling, which stretches back to Lebanon's ancient Phoenician origins and its role as a \"gateway\" of relations between Europe and the Middle East. It has been commonplace for Lebanese citizens to emigrate in search of economic prosperity. Furthermore, on several occasions in the last two centuries the Lebanese population has endured periods of ethnic cleansing and displacement (for example, 1840–60 and 1975–90). These factors have contributed to the geographical mobility of the Lebanese people.\n\nWhile under Syrian occupation, Beirut passed legislation which prevented second-generation Lebanese of the diaspora from automatically obtaining Lebanese citizenship. This has reinforced the émigré status of many diaspora Lebanese. There is currently a campaign by those Lebanese of the diaspora who already have Lebanese citizenship to attain the vote from abroad, which has been successfully passed in the Lebanese parliament and will be effective as of 2013 which is the next parliamentary elections. If suffrage was to be extended to these 1.2 million Lebanese émigré citizens, it would have a significant political effect, since as many as 80% of them are believed to be Christian.\n\nLebanese Civil War refugees and displaced persons\n\nWith no official figures available, it is estimated that 600,000–900,000 persons fled the country during the Lebanese Civil War (1975–90). Although some have since returned, this permanently disturbed Lebanese population growth and greatly complicated demographic statistics.\n\nAnother result of the war was a large number of internally displaced persons. This especially affected the southern Shia community, as Israeli invasion of southern Lebanon in 1978, 1982 and 1996 prompted waves of mass emigration, in addition to the continual strain of occupation and fighting between Israel and Hezbollah (mainly 1982 to 2000).\n\nMany Shias from Southern Lebanon resettled in the suburbs south of Beirut. After the war, the pace of Christian emigration accelerated, as many Christians felt discriminated against in a Lebanon under increasingly oppressive Syrian occupation.\n\nAccording to a UNDP study, as much as 10% of the Lebanese had a disability in 1990.[http://www.irinnews.org/node/195086 LEBANON: Disabled remain marginalized, study finds], IRIN. Accessed August 6, 2009. Other studies have pointed to the fact that this portion of society is highly marginalized due to the lack of educational and governmental support of their advancement.\n\nLanguages\n\nArabic is the official language. Lebanese Arabic is mostly spoken in non-official contexts. French & English are taught in many schools from a young age & spoken fluently. Armenian is taught & spoken as well.\n\nCIA World Factbook demographic statistics\n\nThe following demographic statistics are from the CIA World Factbook, unless otherwise indicated.\n* Population:\nTotal population: 5,882,562 (July 2014 est.)\n*::Lebanese nationals: 4,132,000 (July 2014 est.)\n*::Syrian refugees: 1,077,000 registered at the United Nations High Commissioner for Refugees (June 2014 est.)\n*::Palestinian refugees: 450,000 (May 2014 est.)\n* Age structure:\n* 0–14 years: 21.5% (male 487,930/female 464,678)\n* 15–64 years: 68% (male 1,370,628/female 1,466,173)\n* 65 years and over: 10.5% (male 173,073/female 200,619) (2010 est.)\n* Median age:\nTotal: 29.34 years\nMale: 27.28 years\nFemale: 31.43 years (2011 est.)\n* Population growth rate:\n1.04% (2005 est.)\n0.96% (2011 est.) according to CIA Factbook\n* Net migration rate:\n−4.43 migrant(s)/1,000 population (2011 est.)\n* Sex ratio: \nat birth: 1.05 male(s)/female\nunder 15 years: 1.04 male(s)/female\n15–64 years: 0.92 male(s)/female\n65 years and over: 0.83 male(s)/female\ntotal population: 0.94 male(s)/female (2005 est.)\n* Life expectancy at birth:\ntotal population: 79.82 years\nmale: 77.28 years\nfemale: 80.36 years (2010 est.)\n\nVital statistics\n\nUN estimates\n\nRegistered births and deaths \n\nImmigrants and ethnic groups\n\nThere are substantial numbers of immigrants from other Arab countries (mainly Palestine, Syria, Iraq and Egypt) and non-Arab-speaking Muslim countries. Also, recent years have seen an influx of people from Ethiopia and South East Asian countries such as Indonesia, the Philippines, Malaysia, Sri Lanka, as well as smaller numbers of other immigrant minorities, Colombians and Brazilians (of Lebanese descent themselves). Most of these are employed as guest workers in the same fashion as Syrians and Palestinians, and entered the country to search for employment in the post-war reconstruction of Lebanon. Apart from the Palestinians, there are approximately 180,000 stateless persons in Lebanon.\n\nArmenians, Jews and Iranians\n\nLebanese Armenians, Jews and Iranians form more distinct ethnic minorities, all of them in possession of a separate languages (Armenian, Hebrew, Persian) and a national home area (Armenia, Israel, Iran) outside of Lebanon. However, they total  5% of the population.\n\nFrench and Italians\n\nDuring the French Mandate of Lebanon, there was a fairly large French minority and a tiny Italian minority. Most of the French and Italian settlers left after Lebanese independence in 1943 and only 22,000 French Lebanese and 4,300 Italian Lebanese continue to live in Lebanon. The most important legacy of the French Mandate is the frequent use and knowledge of the French language by most of the educated Lebanese people.\n\nPalestinians\n\nAround 450,000 Palestinian refugees were registered in Lebanon with the UNRWA in 2014, who are refugees or descendants of refugees from the 1948 Arab–Israeli War. Some 53% live in 12 Palestine refugee camps, who \"suffer from serious problems\" such as poverty and overcrowding. Some of these may have emigrated during the civil war, but there are no reliable figures available. There are also a number of Palestinians who are not registered as UNRWA refugees, because they left earlier than 1948 or were not in need of material assistance. The exact number of Palestinians remain a subject of great dispute and the Lebanese government will not provide an estimate. A figure of 400,000 Palestinian refugees would mean that Palestinians constitute more than 10% of the resident population of Lebanon.\n\nPalestinians living in Lebanon are considered foreigners and are under the same restrictions on employment applied to other foreigners. Prior to 2010, they were under even more restrictive employment rules which permitted, other than work for the U.N., only the most menial employment. They are not allowed to attend public schools, own property, or make an enforceable will. Palestinian refugees, who constitute nearly a tenth of the country's population, have long been denied basic rights in Lebanon. They are not allowed to attend public schools, own property or pass on inheritances, measures Lebanon says it has adopted to preserve their right to return to their property in what constitutes Israel now.\n\nTheir presence is controversial, and resisted by large segments of the Christian population, who argue that the primarily Sunni Muslim Palestinians dilute Christian numbers. Many Shia Muslims also look unfavorably upon the Palestinian presence since the refugee camps have tended to be concentrated in their home areas. The Lebanese Sunnis, however, would be happy to see these Palestinians given the Lebanese nationality, thus increasing the Lebanese Sunni population by well over 10% and tipping the fragile electoral balance much in favor of the Sunnis. Late prime minister Rafiq Hariri —himself a Sunni— had hinted on more than one occasion on the inevitability of granting these refugees Lebanese citizenship. Thus far the refugees are Lebanese citizenship as well as many rights enjoyed by the rest of the population, and are confined to severely overcrowded refugee camps, in which construction rights are severely constricted.\n\nPalestinians may not work in a large number of professions, such as lawyers and doctors. However, after negotiations between Lebanese authorities and ministers from the Palestinian National Authority some professions for Palestinians were allowed (such as taxi driver and construction worker). The material situation of the Palestinian refugees in Lebanon is difficult, and they are believed to constitute the poorest community in Lebanon, as well as the poorest Palestinian community with the possible exception of Gaza Strip refugees. Their primary sources of income are UNRWA aid and menial labor sought in competition with Syrian guest workers.\n\nThe Palestinians are almost totally Sunni Muslim, though at some point Christians counted as high as 40% with Muslims at 60%. The numbers of Palestinian Christians has diminished in later years, as many have managed to leave Lebanon. During the Lebanese Civil War, Palestinian Christians sided with the rest of the Palestinian community, instead of allying with Lebanese Eastern Orthodox or other Christian communities.\n\n60,000 Palestinians have received Lebanese citizenship, including most Christian Palestinians.\n\nSyrians\n\nIn 1976, the then Syrian president Hafez al-Assad sent troops into Lebanon to fight PLO forces on behalf of Christian militias. This led to escalated fighting until a cease-fire agreement later that year that allowed for the stationing of Syrian troops within Lebanon. The Syrian presence in Lebanon quickly changed sides; soon after they entered Lebanon they had flip-flopped and began to fight the Christian nationalists in Lebanon they allegedly entered the country to protect. The Kateab Party and the Lebanese Forces under Bachir Gemayel strongly resisted the Syrians in Lebanon. In 1989, 40,000 Syrian troops remained in central and eastern Lebanon under the supervision of the Syrian government. Although, the Taif Accord, established in the same year, called for the removal of Syrian troops and transfer of arms to the Lebanese army, the Syrian Army remained in Lebanon until the Lebanese Cedar Revolution in 2005 to end the Syrian occupation of Lebanon.\n\nIn 1994, the Lebanese government under the pressure of the Syrian government, gave Lebanese passport to thousands of Syrians.\n\nThere are nearly 1.08 million registered Syrian refugees in Lebanon.\n\nAssyrians\n\nThere are an estimated 40,000 to 80,000 Iraqi Assyrian refugees in Lebanon. The vast majority of them are undocumented, with a large number having been deported or put in prison. They belong to various denominations, including the Assyrian Church of the East, Chaldean Catholic Church, and Syriac Catholic Church.\n\nIraqis\n\nDue to the US-led invasion of Iraq, Lebanon has received a mass influx of Iraqi refugees numbering at around 100,000. The vast majority of them are undocumented, with a large number having been deported or put in prison.\n\nKurds\n\nThere are an estimated 60,000 to 100,000 Kurdish refugees from Turkey and Syria within Lebanese territory. Many of them are undocumented. As of 2012, around 40% of all Kurds in Lebanon do not have Lebanese citizenship.\n\nTurks\n\nThe Turkish people began to migrate to Lebanon once the Ottoman sultan Selim I conquered the region in 1516. Turks were encouraged to stay in Lebanon by being rewarded with land and money.  This has seen a remaining legacy, as large amounts of ethnic Lebanese, mainly within the Sunni community, have a recent Turkish ancestor. Today the Turkish minority numbers approximately 80,000. Moreover, since the Syrian Civil War, approximately 125,000 to 150,000 Syrian Turkmen refugees arrived in Lebanon, and hence they now outnumber the long established Turkish minority who settled since the Ottoman era.\n\nNotes. Demographics of Lebanon. http://en.wikipedia.org/?curid=17774."
  }
}
