{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3236",
  "eid" : "c4cfc580-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778409944,
  "textBody" : "Ansbach (;) is a city in the German state of Bavaria. It is the capital of the administrative region of Middle Franconia. Ansbach is 25 mi southwest of Nuremberg and 90 mi north of Munich, on the Fränkische Rezat (Rezat River), a tributary of the Main river. In 2004, its population was 40,723.\n\nDeveloped in the 8th century as a Benedictine monastery, it became the seat of the Hohenzollern family in 1331. In 1460, the Margraves of Brandenburg-Ansbach lived here. The city has a castle known as Margrafen–Schloss, built between 1704–1738. It was not badly damaged during the World Wars and hence retains its original historical baroque sheen.  Ansbach is now home to a US military base and to the Ansbach University of Applied Sciences.\n\nThe city has connections via autobahn A6 and highways B13 and B14. Ansbach station is on the Nürnberg–Crailsheim and Treuchtlingen–Würzburg railways and is the terminus of line S4 of the Nuremberg S-Bahn.\n\nName origin\n\nAnsbach was originally called Onoltesbach (about 790 AD), a term composed of three parts.\n\nThe individual word elements are \"Onold\" (the city founder's name), the Suffix \"-es\" (a possessive ending, like \"-'s\" in English) and the Old High German expression \"pah\" or \"bach\" (for brook). The name of the city has slightly changed throughout the centuries into Onoltespah (837 AD), Onoldesbach (1141 AD), Onoldsbach (1230 AD), Onelspach (1338 AD), Onsbach (1508 AD) and finally Ansbach (1732 AD).Wolf-Armin von Reitzenstein: [https://books.google.com/books?idCBTv-Jl3DkYC&printsec\nfrontcover&hlde#v\nonepage&q&f=false Lexikon fränkischer Ortsnamen] (eng: \"Lexicon to franconian toponymy\"), Verlag C. H. Beck, Munich 2009, . (in German)Heinz Bischof, Wilhelm Sturmfels: Unsere Ortsnamen. Im ABC erklärt nach Herkunft und Bedeutung (eng: \"Names of our towns. A Guide to name origins and significance\"), Dümmler Verlag, Rastatt 1961, (in German)\n\nIt was also formerly known as Anspach.\n\nHistory\n\nAccording to folklore, towards the end of the 7th century a group of Franconian peasants and their families went up into the wilderness to found a new settlement. Their leader Onold led them to an area called the \"Rezattal\" (Rezat valley). This is where they founded the \"Urhöfe\" (meaning the first farms: Knollenhof, Voggenhof and Rabenhof). Gradually more settlers, such as the \"Winden-Tribe\" came, and the farms grew into a small village. Many villages around Ansbach were founded by the \"Winden\" during that period (even today their settlements can easily identified by their names, like \"Meinhardszwinden\", \"Dautenwinden\" or \"Brodswinden\" for example).\nA Benedictine monastery was established there around 748 by the Frankish noble St Gumbertus. The adjoining village of Onoltesbach is first noticed as a proper town in 1221.Werner Bürger: Heimatgeschichte der Stadt Ansbach (eng: \"The history of Ansbach\"), Oldenburg Verlag, Munich 1990, (in German)\n\nThe counts of Öttingen ruled over Ansbach until the Hohenzollern burgrave of Nürnberg took over in 1331. The Hohenzollerns made Ansbach the seat of their dynasty until their acquisition of the Margraviate of Brandenburg in 1415. After the 1440 death of Frederick I, a cadet branch of the family established itself as the margraves of Ansbach. George the Pious introduced the Protestant Reformation to Ansbach in 1528, leading to the secularization of Gumbertus Abbey in 1563.\n\nThe Markgrafenschloß was built between 1704–1738. Its gardens continued to be a notable attraction into the 19th century. In 1791, the last margrave sold his realm to the Kingdom of Prussia. In 1796, the Duke of Zweibrücken, Maximilian Joseph — the future Bavarian king Max I Joseph — was exiled to Ansbach after Zweibrücken had been taken by the French. In Ansbach, Maximilian von Montgelas wrote an elaborate concept for the future political organization of Bavaria, which is known as the Ansbacher Mémoire. Napoleon forced Prussia to cede Ansbach and its principality to Bavaria in the Franco-Prussian treaty of alliance signed at Schönbrunn Palace on 15 December 1805 at the end of the Third Coalition. The act was confirmed by the 1815 Congress of Vienna; Prussia was compensated with the Bavarian duchy of Berg. Ansbach became the capital of the circle of Middle Franconia following the unification of Germany; at the time, it had a population of 12,635.\n\nJewish families were resident in Ansbach from at least the end of the 18th century. They set up a Jewish Cemetery in the Ruglaender Strasse, which was vandalised and razed under the Nazi regime in the Kristallnacht. It was repaired in 1946, but it was damaged several times more. A plaque on the wall of the cemetery commemorates these events. The Jewish Congregation built its synagogue at No 3 Rosenbadstrasse, but it too was damaged by the SA, though it was not burnt down for fear of damaging the neighbouring buildings. It serves today as a \"Symbolic House of God\". A plaque in the entrance serves as a memorial to the synagogue and to Jewish residents who were murdered during the Holocaust. In 1940, at least 500 patients were deported from the Heil- und Pflegeanstalt Ansbach [Ansbach Medical and Nursing Clinic] to the extermination facilities Sonnenstein and Hartheim which were disguised as psychiatric institutions, as part of the Action T4 euthanasia action. They were gassed there. At the clinic in Ansbach itself, around 50 intellectually disabled children were injected with the drug Luminal and killed that way. A plaque was erected in their memory in 1988 in the local hospital at No. 38 Feuchtwangerstrasse.\n\nDuring World War II, a subcamp of Flossenbürg concentration camp was located here.[http://www.tartanplace.com/tartanhistory/concentrationcamps.html Christine O'Keefe. Concentration Camps.] Also during the Second World War the Luftwaffe and Wehrmacht had bases here. The nearby airbase was the home station for the Stab & I/KG53 (Staff & 1st Group of Kampfgeschwader 53) operating 38 Heinkel He 111 bombers. On 1 September 1939 this unit was one of the many that participated in the attack on Poland that started the war. All of its bridges were destroyed during the course of the war. During the Western Allied invasion of Germany in April 1945, the airfield was seized by the United States Third Army, and used by the USAAF 354th Fighter Group which flew P-47 Thunderbolts from the aerodrome (designated ALG R-82) from late April until the German capitulation on 7 May 1945. At the end of the war, 19-year-old student Robert Limpert tried to get the town to surrender to the US Forces without a fight. He was betrayed by Hitler Youth and was hung from the portal of the City Hall by the city's military commander, Col. (Oberst) Ernst Meyer. Several memorials to his heroic deed have been erected over the years, despite opposition from some residents — in the Ludwigskirche, in the Gymnasium Carolinum and at No 6 Kronenstrasse. After the Second World War, Ansbach belonged to the American Zone. The American Military authorities established a displaced persons (DP) camp in what used to be a sanatorium in what is today the Strüth quarter.\n\nBachwoche Ansbach has been held in Ansbach since 1947. Since 1970, Ansbach has enlarged its municipal area by incorporating adjacent communities. Ansbach hosts several units of the U.S. armed forces, associated with German units under NATO. There are five separate U.S. installations: Shipton Kaserne, home to 412th Aviation Support Battalion, Katterbach Kaserne, formerly the home of the 1st Infantry Division's 4th Combat Aviation Brigade, which has been replaced by the 12th Combat Aviation Brigade as of 2006, as part of the 1st Infantry Division's return to Fort Riley, Kansas; Bismarck Kaserne, which functions as a satellite post to Katterbach, hosting their Post Theater, barracks, Von Steuben Community Center, Military Police, and other support agencies, Barton Barracks, home to the USAG Ansbach and Bleidorn Barracks, which has a library and housing, and Urlas, which hosts the Post Exchange as well as a housing area opened in 2010. Ansbach was also home to the headquarters of the 1st Armored Division (United States) from 1972 to the early 1990s.[https://web.archive.org/web/20100423213040/http://www.ridinthewave.com/thinkytees/1stArmorDivision.html A Summary History of the 1st Armored Division]\n\nOn 24 July 2016 a bomb was detonated in a restaurant in the city, killing only the bomber himself and injuring few people. The perpetrator was reported to be a Syrian refugee whose asylum application had been rejected but who had been given exceptional leave to remain until the security situation in Syria returned to a safe condition. Witnesses reported he had tried to enter a nearby music festival but had been turned away, before detonating his device outside a nearby wine bar.\n\nBoroughs\n\n*Eyb, part of Ansbach since 1 October 1970\n*Bernhardswinden, part of Ansbach since 1 July 1972\n*Brodswinden, part of Ansbach since 1 July 1972\n*Claffheim, part of Ansbach since 1 July 1972\n*Elpersdorf bei Ansbach, part of Ansbach since 1 July 1972\n*Hennenbach, part of Ansbach since 1 July 1972\n*Neuses bei Ansbach, part of Ansbach since 1 July 1972\n**Strüth\n**Wasserzell\n*Schalkhausen, part of Ansbach since 1 July 1972\n**Geisengrund\n**Dornberg\n**Neudorf\n**Steinersdorf\n\nLord Mayors\n\n* 1877–1905: Ludwig Keller (1839–1911) \n* 1905–1919: Ernst Rohmeder\n* 1919–1934: Wilhelm Borkholder (1886–1945)\n* 1934–1945: Richard Hänel (NSDAP) (1895-date of death unknown)\n* 1945: Hans Schregle (1890–1970), (SPD), introduced by the Office of Military Government, United States\n* 1945–1950: Ernst Körner (SPD)\n* 1950–1952: Friedrich Böhner\n* 1952–1957: Karl Burkhardt (CSU)\n* 1957–1971: Ludwig Schönecker (CSU)\n* 1971–1990: Ernst-Günther Zumach (CSU)\n* 1990–2008: Ralf Felber (SPD)\n* since May 2008: Carda Seidel (independent)\n\nSights\n\n* Castle of the Margraves of Brandenburg-Ansbach\n* Margrave museum\n* Kaspar Hauser Monument\n* St. Gumbertus and St. Johannis churches, both 15th century\n*Theater Ansbach\n* Ansbacher Kammerspiele\n* LOFT – projectspace for contemporary art\n\nClimate\n\nClimate in this area has mild differences between highs and lows, and there is adequate rainfall year-round.  The Köppen climate classification subtype for this climate is \"Cfb\" (Marine West Coast Climate/Oceanic climate).\n\nEconomy\n\nAround the time of the unification of Germany in 1871, the chief manufactures of Ansbach were woollen, cotton, and half-silk goods; earthenware; tobacco; cutlery; and playing cards. A considerable trade in grain, wool, and flax was also supported. By the onset of the First World War, it also produced machinery, toys, and embroidery.\n\nToday there is a large density of plastics industry in the City and rural districts around Ansbach.[http://www.wifoe-landkreis-ansbach.de/Kompetenzregion/Kompetenz-Kunststoff.htmlwebsite of the Ansbach economic forum] (in German)\n\nNotable people\n\n*Frederick I, Margrave of Brandenburg-Ansbach (1460–1536).\n*Albert of Prussia (1490–1568), Grand Master of the Teutonic Order and the first duke of Prussia.\n*In the late 16th century, the physician to margrave Georg Friedrich was the famous botanist, Leonhart Fuchs (1501–1566).\n*Ansbach was home of the astronomer Simon Marius (1573–1625), who observed Jupiter's moons from the castle's tower. Later he claimed to be the discoverer of the moons, which led to a dispute with the true discoverer, Galileo Galilei.\n*Johann Peter Uz (1720–1796), poet. \n*August von Platen-Hallermünde, poet.\n*Georges Oberhaeuser (1798–1868), optician.\n*Kaspar Hauser (1812–1833), lived in Ansbach from 1830 to 1833. He was stabbed (possibly self-inflicted) in the palace gardens.\n*Pinchas Kohn (1867–1941), was the last rabbi of Ansbach. He was the rabbinical advisor to the German occupying forces of Poland in the First World War and was also one of the founders of the World Agudath Israel movement.\n*Max Westenhöfer (1871–1957), pathologist, professor at the University of Berlin and the University of Chile.  Proposed the Aquatic ape hypothesis.\n*Herbert Blendinger, Violinist and composer was born in Ansbach in 1936.\n*Matthias Buchinger (1674–1740), a German artist, magician and illustrator, born without hands or legs.\n\nBorn in Ansbach\n\n* Manfred Ach, (born 1940), politician, from 1994 to 2008 Member of the Bavarian Parliament.\n* Wilhelm Adam, (1893–1978), Colonel General.\n* Caroline of Ansbach, (1683–1737), wife of King George II (UK).\n* Marcus Eliezer Bloch, (1723–1799), ichthyologist.\n* Eleonore Juliane von Brandenburg-Ansbach, (1663–1724), Princess of Brandenburg-Ansbach, by marriage Duchess of Württemberg-Winnental.\n* Elisabeth von Brandenburg-Ansbach, Princess of Brandenburg, by marriage Duchess of Württemberg.\n* Walter Brandmüller, (born 1929), theologian and church historian, president of the Pontifical Committee for Historical Sciences.\n*George H. Brickner, (1834–1904), U.S. Representative from Wisconsin.\n* Danilo Dittrich (born 1995), football player.\n\n* Theodor Escherich, (1857–1911), pediatrician and bacteriologist.\n* Hermann Fegelein, (1906–1945), General of the Waffen-SS, was married to the sister of Eva Braun.\n* Waldemar Fegelein, (1912–2000), officer in the Waffen-SS.\n* Ludwig von Förster, (1792–1863), architect: Ringstrasse, 3 synagogues (Vienna, Budapest).\n* Fritz Hommel, (1854–1936), orientalist.\n* Amélie Jakobovits (née Munk, 1928–2010), wife of Immanuel Jakobovits, Chief Rabbi of the United Kingdom\n* Alex King, basketball player.\n* Georg Christian Oeder, (1728–1791), pre-Linnean botanist.\n* John James Maximilian Oertel (1811–1882), born in Ansbach, was a Lutheran clergyman who later converted to Roman Catholicism and moved to the United States.\n* Sebastian Preiss, (born 1981), handball player.\n* Moritz Ritter von Spies (1805–1862), Bavarian Major General and War Minister.\n* Georg Ernst Stahl (1659–1734), chemist, physician and metallurgist.\n\nInternational relations\n\nAnsbach is twinned with:\n* Anglet, France\n* Bay City, Michigan\n* Fermo, Italy\n* Jingjiang, China\n\nIn popular culture\n\nIn the novel The Schirmer Inheritance (1953) by Eric Ambler (1909–1998), Sergeant Franz Schirmer of the Ansbach Dragoons is wounded in the battle of Preussisch-Eylau in 1807. He returns to Ansbach to settle but changes his name as he has been posted as a deserter. The bulk of the novel concerns efforts by an American law firm to trace his descendants to claim an inheritance.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ansbach" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3236" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ansbach (;) is a city in the German state of Bavaria. It is the capital of the administrative region of Middle Franconia. Ansbach is 25 mi southwest of Nuremberg and 90 mi north of Munich, on the Fränkische Rezat (Rezat River), a tributary of the Main river. In 2004, its population was 40,723.\n\nDeveloped in the 8th century as a Benedictine monastery, it became the seat of the Hohenzollern family in 1331. In 1460, the Margraves of Brandenburg-Ansbach lived here. The city has a castle known as Margrafen–Schloss, built between 1704–1738. It was not badly damaged during the World Wars and hence retains its original historical baroque sheen.  Ansbach is now home to a US military base and to the Ansbach University of Applied Sciences.\n\nThe city has connections via autobahn A6 and highways B13 and B14. Ansbach station is on the Nürnberg–Crailsheim and Treuchtlingen–Würzburg railways and is the terminus of line S4 of the Nuremberg S-Bahn.\n\nName origin\n\nAnsbach was originally called Onoltesbach (about 790 AD), a term composed of three parts.\n\nThe individual word elements are \"Onold\" (the city founder's name), the Suffix \"-es\" (a possessive ending, like \"-'s\" in English) and the Old High German expression \"pah\" or \"bach\" (for brook). The name of the city has slightly changed throughout the centuries into Onoltespah (837 AD), Onoldesbach (1141 AD), Onoldsbach (1230 AD), Onelspach (1338 AD), Onsbach (1508 AD) and finally Ansbach (1732 AD).Wolf-Armin von Reitzenstein: [https://books.google.com/books?idCBTv-Jl3DkYC&printsec\nfrontcover&hlde#v\nonepage&q&f=false Lexikon fränkischer Ortsnamen] (eng: \"Lexicon to franconian toponymy\"), Verlag C. H. Beck, Munich 2009, . (in German)Heinz Bischof, Wilhelm Sturmfels: Unsere Ortsnamen. Im ABC erklärt nach Herkunft und Bedeutung (eng: \"Names of our towns. A Guide to name origins and significance\"), Dümmler Verlag, Rastatt 1961, (in German)\n\nIt was also formerly known as Anspach.\n\nHistory\n\nAccording to folklore, towards the end of the 7th century a group of Franconian peasants and their families went up into the wilderness to found a new settlement. Their leader Onold led them to an area called the \"Rezattal\" (Rezat valley). This is where they founded the \"Urhöfe\" (meaning the first farms: Knollenhof, Voggenhof and Rabenhof). Gradually more settlers, such as the \"Winden-Tribe\" came, and the farms grew into a small village. Many villages around Ansbach were founded by the \"Winden\" during that period (even today their settlements can easily identified by their names, like \"Meinhardszwinden\", \"Dautenwinden\" or \"Brodswinden\" for example).\nA Benedictine monastery was established there around 748 by the Frankish noble St Gumbertus. The adjoining village of Onoltesbach is first noticed as a proper town in 1221.Werner Bürger: Heimatgeschichte der Stadt Ansbach (eng: \"The history of Ansbach\"), Oldenburg Verlag, Munich 1990, (in German)\n\nThe counts of Öttingen ruled over Ansbach until the Hohenzollern burgrave of Nürnberg took over in 1331. The Hohenzollerns made Ansbach the seat of their dynasty until their acquisition of the Margraviate of Brandenburg in 1415. After the 1440 death of Frederick I, a cadet branch of the family established itself as the margraves of Ansbach. George the Pious introduced the Protestant Reformation to Ansbach in 1528, leading to the secularization of Gumbertus Abbey in 1563.\n\nThe Markgrafenschloß was built between 1704–1738. Its gardens continued to be a notable attraction into the 19th century. In 1791, the last margrave sold his realm to the Kingdom of Prussia. In 1796, the Duke of Zweibrücken, Maximilian Joseph — the future Bavarian king Max I Joseph — was exiled to Ansbach after Zweibrücken had been taken by the French. In Ansbach, Maximilian von Montgelas wrote an elaborate concept for the future political organization of Bavaria, which is known as the Ansbacher Mémoire. Napoleon forced Prussia to cede Ansbach and its principality to Bavaria in the Franco-Prussian treaty of alliance signed at Schönbrunn Palace on 15 December 1805 at the end of the Third Coalition. The act was confirmed by the 1815 Congress of Vienna; Prussia was compensated with the Bavarian duchy of Berg. Ansbach became the capital of the circle of Middle Franconia following the unification of Germany; at the time, it had a population of 12,635.\n\nJewish families were resident in Ansbach from at least the end of the 18th century. They set up a Jewish Cemetery in the Ruglaender Strasse, which was vandalised and razed under the Nazi regime in the Kristallnacht. It was repaired in 1946, but it was damaged several times more. A plaque on the wall of the cemetery commemorates these events. The Jewish Congregation built its synagogue at No 3 Rosenbadstrasse, but it too was damaged by the SA, though it was not burnt down for fear of damaging the neighbouring buildings. It serves today as a \"Symbolic House of God\". A plaque in the entrance serves as a memorial to the synagogue and to Jewish residents who were murdered during the Holocaust. In 1940, at least 500 patients were deported from the Heil- und Pflegeanstalt Ansbach [Ansbach Medical and Nursing Clinic] to the extermination facilities Sonnenstein and Hartheim which were disguised as psychiatric institutions, as part of the Action T4 euthanasia action. They were gassed there. At the clinic in Ansbach itself, around 50 intellectually disabled children were injected with the drug Luminal and killed that way. A plaque was erected in their memory in 1988 in the local hospital at No. 38 Feuchtwangerstrasse.\n\nDuring World War II, a subcamp of Flossenbürg concentration camp was located here.[http://www.tartanplace.com/tartanhistory/concentrationcamps.html Christine O'Keefe. Concentration Camps.] Also during the Second World War the Luftwaffe and Wehrmacht had bases here. The nearby airbase was the home station for the Stab & I/KG53 (Staff & 1st Group of Kampfgeschwader 53) operating 38 Heinkel He 111 bombers. On 1 September 1939 this unit was one of the many that participated in the attack on Poland that started the war. All of its bridges were destroyed during the course of the war. During the Western Allied invasion of Germany in April 1945, the airfield was seized by the United States Third Army, and used by the USAAF 354th Fighter Group which flew P-47 Thunderbolts from the aerodrome (designated ALG R-82) from late April until the German capitulation on 7 May 1945. At the end of the war, 19-year-old student Robert Limpert tried to get the town to surrender to the US Forces without a fight. He was betrayed by Hitler Youth and was hung from the portal of the City Hall by the city's military commander, Col. (Oberst) Ernst Meyer. Several memorials to his heroic deed have been erected over the years, despite opposition from some residents — in the Ludwigskirche, in the Gymnasium Carolinum and at No 6 Kronenstrasse. After the Second World War, Ansbach belonged to the American Zone. The American Military authorities established a displaced persons (DP) camp in what used to be a sanatorium in what is today the Strüth quarter.\n\nBachwoche Ansbach has been held in Ansbach since 1947. Since 1970, Ansbach has enlarged its municipal area by incorporating adjacent communities. Ansbach hosts several units of the U.S. armed forces, associated with German units under NATO. There are five separate U.S. installations: Shipton Kaserne, home to 412th Aviation Support Battalion, Katterbach Kaserne, formerly the home of the 1st Infantry Division's 4th Combat Aviation Brigade, which has been replaced by the 12th Combat Aviation Brigade as of 2006, as part of the 1st Infantry Division's return to Fort Riley, Kansas; Bismarck Kaserne, which functions as a satellite post to Katterbach, hosting their Post Theater, barracks, Von Steuben Community Center, Military Police, and other support agencies, Barton Barracks, home to the USAG Ansbach and Bleidorn Barracks, which has a library and housing, and Urlas, which hosts the Post Exchange as well as a housing area opened in 2010. Ansbach was also home to the headquarters of the 1st Armored Division (United States) from 1972 to the early 1990s.[https://web.archive.org/web/20100423213040/http://www.ridinthewave.com/thinkytees/1stArmorDivision.html A Summary History of the 1st Armored Division]\n\nOn 24 July 2016 a bomb was detonated in a restaurant in the city, killing only the bomber himself and injuring few people. The perpetrator was reported to be a Syrian refugee whose asylum application had been rejected but who had been given exceptional leave to remain until the security situation in Syria returned to a safe condition. Witnesses reported he had tried to enter a nearby music festival but had been turned away, before detonating his device outside a nearby wine bar.\n\nBoroughs\n\n*Eyb, part of Ansbach since 1 October 1970\n*Bernhardswinden, part of Ansbach since 1 July 1972\n*Brodswinden, part of Ansbach since 1 July 1972\n*Claffheim, part of Ansbach since 1 July 1972\n*Elpersdorf bei Ansbach, part of Ansbach since 1 July 1972\n*Hennenbach, part of Ansbach since 1 July 1972\n*Neuses bei Ansbach, part of Ansbach since 1 July 1972\n**Strüth\n**Wasserzell\n*Schalkhausen, part of Ansbach since 1 July 1972\n**Geisengrund\n**Dornberg\n**Neudorf\n**Steinersdorf\n\nLord Mayors\n\n* 1877–1905: Ludwig Keller (1839–1911) \n* 1905–1919: Ernst Rohmeder\n* 1919–1934: Wilhelm Borkholder (1886–1945)\n* 1934–1945: Richard Hänel (NSDAP) (1895-date of death unknown)\n* 1945: Hans Schregle (1890–1970), (SPD), introduced by the Office of Military Government, United States\n* 1945–1950: Ernst Körner (SPD)\n* 1950–1952: Friedrich Böhner\n* 1952–1957: Karl Burkhardt (CSU)\n* 1957–1971: Ludwig Schönecker (CSU)\n* 1971–1990: Ernst-Günther Zumach (CSU)\n* 1990–2008: Ralf Felber (SPD)\n* since May 2008: Carda Seidel (independent)\n\nSights\n\n* Castle of the Margraves of Brandenburg-Ansbach\n* Margrave museum\n* Kaspar Hauser Monument\n* St. Gumbertus and St. Johannis churches, both 15th century\n*Theater Ansbach\n* Ansbacher Kammerspiele\n* LOFT – projectspace for contemporary art\n\nClimate\n\nClimate in this area has mild differences between highs and lows, and there is adequate rainfall year-round.  The Köppen climate classification subtype for this climate is \"Cfb\" (Marine West Coast Climate/Oceanic climate).\n\nEconomy\n\nAround the time of the unification of Germany in 1871, the chief manufactures of Ansbach were woollen, cotton, and half-silk goods; earthenware; tobacco; cutlery; and playing cards. A considerable trade in grain, wool, and flax was also supported. By the onset of the First World War, it also produced machinery, toys, and embroidery.\n\nToday there is a large density of plastics industry in the City and rural districts around Ansbach.[http://www.wifoe-landkreis-ansbach.de/Kompetenzregion/Kompetenz-Kunststoff.htmlwebsite of the Ansbach economic forum] (in German)\n\nNotable people\n\n*Frederick I, Margrave of Brandenburg-Ansbach (1460–1536).\n*Albert of Prussia (1490–1568), Grand Master of the Teutonic Order and the first duke of Prussia.\n*In the late 16th century, the physician to margrave Georg Friedrich was the famous botanist, Leonhart Fuchs (1501–1566).\n*Ansbach was home of the astronomer Simon Marius (1573–1625), who observed Jupiter's moons from the castle's tower. Later he claimed to be the discoverer of the moons, which led to a dispute with the true discoverer, Galileo Galilei.\n*Johann Peter Uz (1720–1796), poet. \n*August von Platen-Hallermünde, poet.\n*Georges Oberhaeuser (1798–1868), optician.\n*Kaspar Hauser (1812–1833), lived in Ansbach from 1830 to 1833. He was stabbed (possibly self-inflicted) in the palace gardens.\n*Pinchas Kohn (1867–1941), was the last rabbi of Ansbach. He was the rabbinical advisor to the German occupying forces of Poland in the First World War and was also one of the founders of the World Agudath Israel movement.\n*Max Westenhöfer (1871–1957), pathologist, professor at the University of Berlin and the University of Chile.  Proposed the Aquatic ape hypothesis.\n*Herbert Blendinger, Violinist and composer was born in Ansbach in 1936.\n*Matthias Buchinger (1674–1740), a German artist, magician and illustrator, born without hands or legs.\n\nBorn in Ansbach\n\n* Manfred Ach, (born 1940), politician, from 1994 to 2008 Member of the Bavarian Parliament.\n* Wilhelm Adam, (1893–1978), Colonel General.\n* Caroline of Ansbach, (1683–1737), wife of King George II (UK).\n* Marcus Eliezer Bloch, (1723–1799), ichthyologist.\n* Eleonore Juliane von Brandenburg-Ansbach, (1663–1724), Princess of Brandenburg-Ansbach, by marriage Duchess of Württemberg-Winnental.\n* Elisabeth von Brandenburg-Ansbach, Princess of Brandenburg, by marriage Duchess of Württemberg.\n* Walter Brandmüller, (born 1929), theologian and church historian, president of the Pontifical Committee for Historical Sciences.\n*George H. Brickner, (1834–1904), U.S. Representative from Wisconsin.\n* Danilo Dittrich (born 1995), football player.\n\n* Theodor Escherich, (1857–1911), pediatrician and bacteriologist.\n* Hermann Fegelein, (1906–1945), General of the Waffen-SS, was married to the sister of Eva Braun.\n* Waldemar Fegelein, (1912–2000), officer in the Waffen-SS.\n* Ludwig von Förster, (1792–1863), architect: Ringstrasse, 3 synagogues (Vienna, Budapest).\n* Fritz Hommel, (1854–1936), orientalist.\n* Amélie Jakobovits (née Munk, 1928–2010), wife of Immanuel Jakobovits, Chief Rabbi of the United Kingdom\n* Alex King, basketball player.\n* Georg Christian Oeder, (1728–1791), pre-Linnean botanist.\n* John James Maximilian Oertel (1811–1882), born in Ansbach, was a Lutheran clergyman who later converted to Roman Catholicism and moved to the United States.\n* Sebastian Preiss, (born 1981), handball player.\n* Moritz Ritter von Spies (1805–1862), Bavarian Major General and War Minister.\n* Georg Ernst Stahl (1659–1734), chemist, physician and metallurgist.\n\nInternational relations\n\nAnsbach is twinned with:\n* Anglet, France\n* Bay City, Michigan\n* Fermo, Italy\n* Jingjiang, China\n\nIn popular culture\n\nIn the novel The Schirmer Inheritance (1953) by Eric Ambler (1909–1998), Sergeant Franz Schirmer of the Ansbach Dragoons is wounded in the battle of Preussisch-Eylau in 1807. He returns to Ansbach to settle but changes his name as he has been posted as a deserter. The bulk of the novel concerns efforts by an American law firm to trace his descendants to claim an inheritance. Ansbach. http://en.wikipedia.org/?curid=3236."
  }
}
