{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17750",
  "eid" : "2dc212f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778586015,
  "textBody" : "Lübeck is a city in Schleswig-Holstein, northern Germany, and one of the major ports of Germany.  On the river Trave, it was the leading city of the Hanseatic League, and because of its extensive Brick Gothic architecture, it is listed by UNESCO as a World Heritage Site. In 2015, it had a population of 218,523.\n\nThe old part of Lübeck is on an island enclosed by the Trave. The Elbe–Lübeck Canal connects the Trave with the Elbe River. Another important river near the town centre is the Wakenitz. Autobahn 1 connects Lübeck with Hamburg and Denmark. Travemünde is a sea resort and ferry port on the coast of the Baltic Sea. Lübeck Hauptbahnhof links Lübeck to a number of railway lines, notably the line to Hamburg.\n\nHistory\n\nHumans settled in the area around what today is Lübeck after the last Ice Age ended about 9700 BCE. Several Neolithic dolmens can be found in the area.\n\nAround AD 700, Slavic peoples started moving into the eastern parts of Holstein, an area previously settled by Germanic inhabitants; the latter had moved on in the course of the Migration Period. Charlemagne (Holy Roman Emperor 800–814), whose efforts to Christianise the area were opposed by the Germanic Saxons, expelled many of the Saxons and brought in Polabian Slavs allies. Liubice (the place-name means \"lovely\") was founded on the banks of the River Trave about four kilometers (4 km) north of the present-day city-center of Lübeck. In the 10th century it became the most important settlement of the Obotrite confederacy and a castle was built. In 1128 the pagan Rani from Rügen razed Liubice.\n\nIn 1143 Adolf II, Count of Schauenburg and Holstein, founded the modern town as a German settlement on the river island of Bucu.  He built a new castle, first mentioned by the chronicler Helmold as existing in 1147.  Adolf had to cede the castle to the Duke of Saxony, Henry the Lion, in 1158.  After Henry's fall from power in 1181 the town became an Imperial city for eight years. Emperor Barbarossa (reigned 1152–1190) ordained that the city should have a ruling council of twenty members.  With the council dominated by merchants, pragmatic trade interests shaped Lübeck's politics for centuries.  The council survived into the 19th century.  The town and castle changed ownership for a period afterwards and formed part of the Duchy of Saxony until 1192, of the County of Holstein until 1217, and of the kingdom of Denmark until the Battle of Bornhöved in 1227.\n\nHanseatic city \n\nAround 1200 the port became the main point of departure for colonists leaving for the Baltic territories conquered by the Livonian Order and, later, by the Teutonic Order. In 1226 Emperor Frederick II elevated the town to the status of an Imperial Free City, by which it became the Free City of Lübeck.\n\nIn the 14th century Lübeck became the \"Queen of the Hanseatic League\", being by far the largest and most powerful member of that medieval trade organization. In 1375 Emperor Charles IV named Lübeck one of the five \"Glories of the Empire\", a title shared with Venice, Rome, Pisa and Florence.\n\nSeveral conflicts about trading privileges resulted in fighting between Lübeck (with the Hanseatic League) and Denmark and Norway – with varying outcome. While Lübeck and the Hanseatic League prevailed in conflicts in 1435 and 1512, Lübeck lost when it became involved in the Count's Feud, a civil war that raged in Denmark from 1534 to 1536. Lübeck also joined the pro-Lutheran Schmalkaldic League of the mid-16th century.\n\nAfter its defeat in the Count's Feud, Lübeck's power slowly declined. The city remained neutral in the Thirty Years' War of 1618–1648, but the combination of the devastation from the decades-long war and the new transatlantic orientation of European trade caused the Hanseatic League – and thus Lübeck with it – to decline in importance. However, even after the de facto disbanding of the Hanseatic League in 1669, Lübeck still remained an important trading town on the Baltic Sea.\n\nOld traditions, new challenges \n\nFranz Tunder was the organist in the Marienkirche.  It was part of the tradition in this Lutheran congregation that the organist would pass on the duty in a dynastic marriage.  In 1668 his daughter Anna Margarethe married the great Danish-German composer Dieterich Buxtehude, who was the organist at the Marienkirche in Lübeck until at least 1703.   Some of the greatest composers of the day came to the church to hear his renowned playing.\n\nIn the course of the war of the Fourth Coalition against Napoleon, troops under Bernadotte occupied the neutral Lübeck after a battle against Blücher on 6 November 1806. Under the Continental System, the State bank went into bankruptcy. In 1811 the French Empire formally annexed Lübeck as part of France; the anti-Napoleonic Allies liberated the area in 1813, and the Congress of Vienna of 1815 recognised Lübeck as an independent Free City.\n\nThe writer Thomas Mann was a member of the Mann family of Lübeck merchants. His well-known 1901 novel Buddenbrooks made readers in Germany (and later worldwide, through numerous translations) familiar with the manner of life and mores of the 19th Century Lübeck bourgeoisie.   .\n\nIn 1937 the Nazis passed the so-called Greater Hamburg Act, which merged the city of Lübeck with Prussia.\n\nDuring World War II (1939–1945), Lübeck became the first German city to suffer substantial Royal Air Force (RAF) bombing. The attack of 28 March 1942 created a firestorm that caused severe damage to the historic centre. This raid destroyed three of the main churches and large parts of the built-up area; the bells of St Marienkircke plunged to the stone floor.http://www.luebeck-tourism.de/discover/sights/churches-in-luebeck/st-marys.html  Germany operated a POW camp for officers, Oflag X-C, near the city from 1940 until April 1945. The British Second Army entered Lübeck on 2 May 1945 and occupied it without resistance.\n\nOn 3 May 1945 one of the biggest disasters in naval history occurred in the Bay of Lübeck when RAF bombers sank three ships: the SS Cap Arcona, the SS Deutschland, and the SS Thielbek – which, unknown to them, were packed with concentration camp inmates. About 7,000 people died.\n\nLübeck's population grew considerably – from about 150,000 in 1939 to more than 220,000 after the war – owing to an influx of ethnic German refugees expelled from the so-called former Eastern provinces of Germany in the Communist Bloc.  Lübeck remained part of Schleswig-Holstein after World War II (and consequently lay within West Germany).  It stood directly on what became the inner German border during the division of Germany into two states in the Cold War period.  South of the city, the border followed the path of the river Wakenitz, which separated the Germanys by less than 10 m in many parts.  The northernmost border-crossing was in Lübeck's district of Schlutup.  Lübeck spent decades restoring its historic city centre.  In 1987 UNESCO designated this area a World Heritage Site.\n\nLübeck became the scene of a notable art scandal in the 1950s. Lothar Malskat was hired to restore the medieval frescoes of the cathedral of the Marienkirche, which were discovered after the cathedral had been badly damaged during World War II.  Instead he painted new works which he passed off as restorations, fooling many experts.  Malskat later revealed the deception himself.  Günter Grass featured this incident in his 1986 novel The Rat.\n\n \nOn the night of 18 January 1996 a fire broke out in a home for foreign refugees, killing 10 people and severely injuring more than 30 others, mostly children.  Most of the shelter's inhabitants thought it was a racist attack, as they stated that they had encountered other overt hostility in the city.\"Brandspuren im Gesicht, Ermittlungen zur Lübecker Asylheim-Katastrophe\", Der Spiegel, 23/1996, 3 June 1996. The police and the local court were criticized at the time for ruling out racism as a possible motive before even beginning preliminary investigations.Hannoversche Allgemeine Zeitung, 5 March 2005 But by 2002, the courts found all the Germans involvedhttp://www.dokfest-muenchen.de/filme_view_web.php?fid275&lang\nen not guilty; the perpetrators have not been caught.In 2015 there was another fire at a refugee home, this time at Troglitz - http://www.Troglitz.panteres.com/2015/04/05/fire-in-refugee-home-troglitz-is-everywhere/\n\nIn April 2015, Lübeck hosted the G7 conference.http://www.spiegel.de/politik/ausland/g7-gipfel-in-luebeck-die-beschluesse-a-1028769.html\n\nDemographics\n\nIn 2015 the city had a population of 218,523. The largest ethnic minority groups are Turks, Central Europeans (Poles), Southern Europeans (mostly Greeks and Italians), Eastern Europeans (e.g. Russians), Arabs and several smaller groups. As in numerous other German cities, there is also a growing Afro-German community.  \nPopulation structure:\n\nMain sights\n\nBuildings\n\nMuch of the old town has kept a medieval appearance with old buildings and narrow streets. At one time the town could only be entered via any of four town gates, of which today two remain, the well-known Holstentor (1478) and the Burgtor (1444).\n\nThe old town centre is dominated by seven church steeples. The oldest are the Lübecker Dom (the city's cathedral) and the Marienkirche (Saint Mary's), both from the 13th and 14th centuries.\n\nBuilt in 1286, the Holy Spirit Hospital at Koberg is one of the oldest existing social institutions in the world and one of the most important buildings in the city. The Holy Spirit Hospital is in parts an old and nursing home. Historic parts can be visited.\n\nOther sights include:\n*the Lübecker Rathaus (Town Hall).\n*St. Catherine's Church, a church that belonged to a former monastery, now the Katharineum, a Latin school.\n*Thomas Mann's house.\n*Günter Grass' house.\n*Church of St Peter Petrikirche (Lübeck)\n*Church of St Lawrence, located on the site of a cemetery for people who died during the 16th century plague.\n*Church of St Jacob Lübecker Jakobikirche, 1334\n*Church of the Sacred Heart (Propsteikirche Herz Jesu)\n*Church of St Aegidien\n*the Salzspeicher, historic warehouses where salt delivered from Lüneburg awaited shipment to Baltic ports.\n\nLike many other places in Germany, Lübeck has a long tradition of a Christmas market in December, which includes the famous handicrafts market inside the Heiligen-Geist-Hospital (Hospital of the Holy Spirit), located at the northern end of Königstrasse.\n\nMuseums\n\nLübeck has many small museums, such as the St. Anne's Museum Quarter, Lübeck, the Behnhaus, the European Hansemuseum and the Holstentor. Lübeck Museum of Theatre Puppets is a privately run museum. Waterside attractions are a lightvessel that served Fehmarnbelt and the Lisa von Lübeck, a reconstruction of a Hanseatic 15th century caravel.\nThe marzipan museum in the second floor of Café Niederegger in Breite Strasse explains the history of marzipan, shows historical wood molds for the production of marzipan blocks and a group of historical figures made of marzipan.\n\nFood and drink\n\nLübeck is famous for its marzipan industry.  According to local legend, marzipan was first made in Lübeck, possibly in response either to a military siege of the city or a famine year. The story, perhaps apocryphal, is that the town ran out of all food except stored almonds and sugar, which were used to make loaves of marzipan \"bread\".  Others believe that marzipan was actually invented in Persia a few hundred years before Lübeck claims to have invented it.  The best known producer is Niederegger, which tourists often visit while in Lübeck, especially at Christmas time.\n\nThe Lübeck wine trade dates back to Hanseatic times. One Lübeck specialty is Rotspon (), wine made from grapes processed and fermented in France and transported in wooden barrels to Lübeck, where it is stored, aged and bottled.\n\nEducation\n\nLübeck has three universities, the University of Lübeck, the Lübeck Academy of Applied Sciences, and the Lübeck Academy of Music. The [http://www.gradschool.uni-luebeck.de Graduate School for Computing in Medicine and Life Sciences] is a central faculty of the University and was founded by the [http://www.dfg.de/en/research_funding/coordinated_programmes/excellence_initiative/ German Excellence Initiative].\nThe International School of New Media is an affiliated institute of the University.\n\nNotable people\n\n* Laurentius Surius (1522-1578), Carthusian monk and Hagiograph\n* August Hermann Francke (1663-1727), pedagogue, theologian, founded the Francke Foundations\n* Adam Brand (explorer), (before 1692-1746), German merchant and researcher\n* Christian Friedrich Heinecken (1721-1725), \"the infant scholar of Lübeck\", a child prodigy\n* Kurd von Schlözer (1822-1894), diplomat and historian\n* John Rugee (1827-1894), politician in Wisconsin, USA\n* Hermann von der Hude (1830-1908), architect\n* Gustav Radbruch (1878-1949), legal scholar and politician\n* Ephraim Carlebach (1879-1936), rabbi and founder of the Higher Israelite School in Leipzig\n* Friedrich Ranke (1882-1950), Germanist and ethnologist\n* Joseph Carlebach (1883-1942), rabbi, victim of the Holocaust\n* Hermann Pister (1885-1948), SS leader and commander of Buchenwald Concentration Camp\n* Walter Ewers (1892-1918), flying ace of WWI\n* Felix Carlebach (1911-2008), rabbi\n* Willy Brandt (1913-1992), politician, German chancellor (SPD)\n* Hans Blumenberg (1920-1996), philosopher\n* Björn Engholm (born 1939), politician (SPD)\n* Sandra Völker (born 1974), swimmer\n\nArt\n\n* Godfrey Kneller (1646-1723), court painter of several British monarchs\n* Catharina Elisabeth Heinecken (1683–1757), German artist and alchemist\n* Carl Heinrich von Heineken (1707–1791), German art historian\n* Friedrich Overbeck (1789-1869), painter and head of the Nazarenes\n* Gotthardt Kuehl (born 1850), painter\n* Maria Slavona (1865-1931), impressionist painter, sister of Cornelia Schorer\n* Erich Ponto (1884-1957), actor\n* Justus von Dohnányi (born 1960), actor\n* Jonas Nay (born 1990), actor\n\nMusic\n\n* Franz Tunder (1614-1667), organist and composer\n* Thomas Baltzar (around 1631-1663), violinist and composer\n* Dieterich Buxtehude, (c.1637-1707), composer and organist\n* Andreas Kneller (1649-1724), composer and organist\n* Friedrich Ludwig Æmilius Kunzen (1761-1817), composer\n\nScience\n\n* Joachim Jungius (1587-1657), mathematician, physicist and philosopher\n* Heinrich Meibom (1638-1700), medical expert, discovered the Meibomian gland\n* Hermann Fehling (1811-1885) chemist\n* Robert Christian Avé-Lallemant (1812-1884), physician and research traveler\n* Ernst Curtius, (1814-1896), classical archaeologist and historian\n* Friedrich Matthias Claudius (1822-1869), anatomist\n* Friedrich Matz (1843-1874), archaeologist \n\nWriting\n\n* Erasmus Finx (1627-1694), polyhistorian, author and church writer\n* Christian Adolph Overbeck (1755-1821), mayor and poet\n* Johann Bernhard Vermehren (1777-1803), romanticist and lecturer\n* Emanuel Geibel (1815-1884), poet\n* Gustav Falke (1853-1916), author\n* Heinrich Mann (1871-1950), novelist (Professor Unrat)\n* Thomas Mann (1875-1955), novelist, Nobel Prize for Literature in 1929\n* Günter Grass (1927-2015), author and artist; recipient of the 1999 Nobel Prize in Literature\n* Jörg Wontorra (born 1948), German sport journalist\n\nParts\n\nThe city of Lübeck is divided into 10 zones.  These again are arranged into altogether 35 urban districts. The 10 zones with their official numbers, their associated urban districts and the numbers of inhabitants of the quarters:\n\n*01 City centre (~ 12,000 Inhabitants)\n*02 St. Jürgen (~ 40,000 Inhabitants)\n** Hüxtertor / Mühlentor / Gärtnergasse, Strecknitz / Rothebek, Blankensee, Wulfsdorf, Beidendorf, Krummesse, Kronsforde, Niederbüssau, Vorrade, Schiereichenkoppel, Oberbüssau\n*03 Moisling (~ 10,000 Inhabitants)\n** Niendorf / Moorgarten, Reecke, Old-Moisling / Genin\n*04 Buntekuh (~ 10,000 Inhabitants)\n*05 St. Lorenz-South (~ 12,000 Inhabitants)\n*06 St. Lorenz-North (~ 40,000 Inhabitants)\n** Holstentor-North, Falkenfeld / Vorwerk / Teerhof, Großsteinrade / Schönböcken, Dornbreite / Krempelsdorf\n*07 St. Gertrud (~ 40,000 Inhabitants)\n** Burgtor / Stadtpark, Marli / Brandenbaum, Eichholz, Karlshof / Israelsdorf / Gothmund\n*08 Schlutup (~ 6,000 Inhabitants)\n*09 Kücknitz (~ 20,000 Inhabitants)\n** Dänischburg / Siems / Rangenberg / Wallberg, Herrenwyk, Alt-Kücknitz / Dummersdorf / Roter Hahn, Poeppendorf\n*10 Travemünde (~ 15,000 Inhabitants)\n** Ivendorf, Alt-Travemünde / Rönnau, Priwall, Teutendorf, Brodten\n\nThe industrial Lübeck-Herrenwyk area was until the beginning of the 1990s the location of a big metallurgical plant. The gas produced by this plant was used for making electricity in the Lübeck-Herrenwyk power station.  In 1992, the Lübeck-Herrenwyk power station was demolished after the bankruptcy and demolition of the metallurgical plant and since 1994 its site houses the static inverter plant of the HVDC Baltic Cable.\n\nInternational relations\n\nLübeck is twinned with:\n\nLubec, Maine, the easternmost town in the United States, is named after Lübeck.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lübeck" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17750" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Lübeck is a city in Schleswig-Holstein, northern Germany, and one of the major ports of Germany.  On the river Trave, it was the leading city of the Hanseatic League, and because of its extensive Brick Gothic architecture, it is listed by UNESCO as a World Heritage Site. In 2015, it had a population of 218,523.\n\nThe old part of Lübeck is on an island enclosed by the Trave. The Elbe–Lübeck Canal connects the Trave with the Elbe River. Another important river near the town centre is the Wakenitz. Autobahn 1 connects Lübeck with Hamburg and Denmark. Travemünde is a sea resort and ferry port on the coast of the Baltic Sea. Lübeck Hauptbahnhof links Lübeck to a number of railway lines, notably the line to Hamburg.\n\nHistory\n\nHumans settled in the area around what today is Lübeck after the last Ice Age ended about 9700 BCE. Several Neolithic dolmens can be found in the area.\n\nAround AD 700, Slavic peoples started moving into the eastern parts of Holstein, an area previously settled by Germanic inhabitants; the latter had moved on in the course of the Migration Period. Charlemagne (Holy Roman Emperor 800–814), whose efforts to Christianise the area were opposed by the Germanic Saxons, expelled many of the Saxons and brought in Polabian Slavs allies. Liubice (the place-name means \"lovely\") was founded on the banks of the River Trave about four kilometers (4 km) north of the present-day city-center of Lübeck. In the 10th century it became the most important settlement of the Obotrite confederacy and a castle was built. In 1128 the pagan Rani from Rügen razed Liubice.\n\nIn 1143 Adolf II, Count of Schauenburg and Holstein, founded the modern town as a German settlement on the river island of Bucu.  He built a new castle, first mentioned by the chronicler Helmold as existing in 1147.  Adolf had to cede the castle to the Duke of Saxony, Henry the Lion, in 1158.  After Henry's fall from power in 1181 the town became an Imperial city for eight years. Emperor Barbarossa (reigned 1152–1190) ordained that the city should have a ruling council of twenty members.  With the council dominated by merchants, pragmatic trade interests shaped Lübeck's politics for centuries.  The council survived into the 19th century.  The town and castle changed ownership for a period afterwards and formed part of the Duchy of Saxony until 1192, of the County of Holstein until 1217, and of the kingdom of Denmark until the Battle of Bornhöved in 1227.\n\nHanseatic city \n\nAround 1200 the port became the main point of departure for colonists leaving for the Baltic territories conquered by the Livonian Order and, later, by the Teutonic Order. In 1226 Emperor Frederick II elevated the town to the status of an Imperial Free City, by which it became the Free City of Lübeck.\n\nIn the 14th century Lübeck became the \"Queen of the Hanseatic League\", being by far the largest and most powerful member of that medieval trade organization. In 1375 Emperor Charles IV named Lübeck one of the five \"Glories of the Empire\", a title shared with Venice, Rome, Pisa and Florence.\n\nSeveral conflicts about trading privileges resulted in fighting between Lübeck (with the Hanseatic League) and Denmark and Norway – with varying outcome. While Lübeck and the Hanseatic League prevailed in conflicts in 1435 and 1512, Lübeck lost when it became involved in the Count's Feud, a civil war that raged in Denmark from 1534 to 1536. Lübeck also joined the pro-Lutheran Schmalkaldic League of the mid-16th century.\n\nAfter its defeat in the Count's Feud, Lübeck's power slowly declined. The city remained neutral in the Thirty Years' War of 1618–1648, but the combination of the devastation from the decades-long war and the new transatlantic orientation of European trade caused the Hanseatic League – and thus Lübeck with it – to decline in importance. However, even after the de facto disbanding of the Hanseatic League in 1669, Lübeck still remained an important trading town on the Baltic Sea.\n\nOld traditions, new challenges \n\nFranz Tunder was the organist in the Marienkirche.  It was part of the tradition in this Lutheran congregation that the organist would pass on the duty in a dynastic marriage.  In 1668 his daughter Anna Margarethe married the great Danish-German composer Dieterich Buxtehude, who was the organist at the Marienkirche in Lübeck until at least 1703.   Some of the greatest composers of the day came to the church to hear his renowned playing.\n\nIn the course of the war of the Fourth Coalition against Napoleon, troops under Bernadotte occupied the neutral Lübeck after a battle against Blücher on 6 November 1806. Under the Continental System, the State bank went into bankruptcy. In 1811 the French Empire formally annexed Lübeck as part of France; the anti-Napoleonic Allies liberated the area in 1813, and the Congress of Vienna of 1815 recognised Lübeck as an independent Free City.\n\nThe writer Thomas Mann was a member of the Mann family of Lübeck merchants. His well-known 1901 novel Buddenbrooks made readers in Germany (and later worldwide, through numerous translations) familiar with the manner of life and mores of the 19th Century Lübeck bourgeoisie.   .\n\nIn 1937 the Nazis passed the so-called Greater Hamburg Act, which merged the city of Lübeck with Prussia.\n\nDuring World War II (1939–1945), Lübeck became the first German city to suffer substantial Royal Air Force (RAF) bombing. The attack of 28 March 1942 created a firestorm that caused severe damage to the historic centre. This raid destroyed three of the main churches and large parts of the built-up area; the bells of St Marienkircke plunged to the stone floor.http://www.luebeck-tourism.de/discover/sights/churches-in-luebeck/st-marys.html  Germany operated a POW camp for officers, Oflag X-C, near the city from 1940 until April 1945. The British Second Army entered Lübeck on 2 May 1945 and occupied it without resistance.\n\nOn 3 May 1945 one of the biggest disasters in naval history occurred in the Bay of Lübeck when RAF bombers sank three ships: the SS Cap Arcona, the SS Deutschland, and the SS Thielbek – which, unknown to them, were packed with concentration camp inmates. About 7,000 people died.\n\nLübeck's population grew considerably – from about 150,000 in 1939 to more than 220,000 after the war – owing to an influx of ethnic German refugees expelled from the so-called former Eastern provinces of Germany in the Communist Bloc.  Lübeck remained part of Schleswig-Holstein after World War II (and consequently lay within West Germany).  It stood directly on what became the inner German border during the division of Germany into two states in the Cold War period.  South of the city, the border followed the path of the river Wakenitz, which separated the Germanys by less than 10 m in many parts.  The northernmost border-crossing was in Lübeck's district of Schlutup.  Lübeck spent decades restoring its historic city centre.  In 1987 UNESCO designated this area a World Heritage Site.\n\nLübeck became the scene of a notable art scandal in the 1950s. Lothar Malskat was hired to restore the medieval frescoes of the cathedral of the Marienkirche, which were discovered after the cathedral had been badly damaged during World War II.  Instead he painted new works which he passed off as restorations, fooling many experts.  Malskat later revealed the deception himself.  Günter Grass featured this incident in his 1986 novel The Rat.\n\n \nOn the night of 18 January 1996 a fire broke out in a home for foreign refugees, killing 10 people and severely injuring more than 30 others, mostly children.  Most of the shelter's inhabitants thought it was a racist attack, as they stated that they had encountered other overt hostility in the city.\"Brandspuren im Gesicht, Ermittlungen zur Lübecker Asylheim-Katastrophe\", Der Spiegel, 23/1996, 3 June 1996. The police and the local court were criticized at the time for ruling out racism as a possible motive before even beginning preliminary investigations.Hannoversche Allgemeine Zeitung, 5 March 2005 But by 2002, the courts found all the Germans involvedhttp://www.dokfest-muenchen.de/filme_view_web.php?fid275&lang\nen not guilty; the perpetrators have not been caught.In 2015 there was another fire at a refugee home, this time at Troglitz - http://www.Troglitz.panteres.com/2015/04/05/fire-in-refugee-home-troglitz-is-everywhere/\n\nIn April 2015, Lübeck hosted the G7 conference.http://www.spiegel.de/politik/ausland/g7-gipfel-in-luebeck-die-beschluesse-a-1028769.html\n\nDemographics\n\nIn 2015 the city had a population of 218,523. The largest ethnic minority groups are Turks, Central Europeans (Poles), Southern Europeans (mostly Greeks and Italians), Eastern Europeans (e.g. Russians), Arabs and several smaller groups. As in numerous other German cities, there is also a growing Afro-German community.  \nPopulation structure:\n\nMain sights\n\nBuildings\n\nMuch of the old town has kept a medieval appearance with old buildings and narrow streets. At one time the town could only be entered via any of four town gates, of which today two remain, the well-known Holstentor (1478) and the Burgtor (1444).\n\nThe old town centre is dominated by seven church steeples. The oldest are the Lübecker Dom (the city's cathedral) and the Marienkirche (Saint Mary's), both from the 13th and 14th centuries.\n\nBuilt in 1286, the Holy Spirit Hospital at Koberg is one of the oldest existing social institutions in the world and one of the most important buildings in the city. The Holy Spirit Hospital is in parts an old and nursing home. Historic parts can be visited.\n\nOther sights include:\n*the Lübecker Rathaus (Town Hall).\n*St. Catherine's Church, a church that belonged to a former monastery, now the Katharineum, a Latin school.\n*Thomas Mann's house.\n*Günter Grass' house.\n*Church of St Peter Petrikirche (Lübeck)\n*Church of St Lawrence, located on the site of a cemetery for people who died during the 16th century plague.\n*Church of St Jacob Lübecker Jakobikirche, 1334\n*Church of the Sacred Heart (Propsteikirche Herz Jesu)\n*Church of St Aegidien\n*the Salzspeicher, historic warehouses where salt delivered from Lüneburg awaited shipment to Baltic ports.\n\nLike many other places in Germany, Lübeck has a long tradition of a Christmas market in December, which includes the famous handicrafts market inside the Heiligen-Geist-Hospital (Hospital of the Holy Spirit), located at the northern end of Königstrasse.\n\nMuseums\n\nLübeck has many small museums, such as the St. Anne's Museum Quarter, Lübeck, the Behnhaus, the European Hansemuseum and the Holstentor. Lübeck Museum of Theatre Puppets is a privately run museum. Waterside attractions are a lightvessel that served Fehmarnbelt and the Lisa von Lübeck, a reconstruction of a Hanseatic 15th century caravel.\nThe marzipan museum in the second floor of Café Niederegger in Breite Strasse explains the history of marzipan, shows historical wood molds for the production of marzipan blocks and a group of historical figures made of marzipan.\n\nFood and drink\n\nLübeck is famous for its marzipan industry.  According to local legend, marzipan was first made in Lübeck, possibly in response either to a military siege of the city or a famine year. The story, perhaps apocryphal, is that the town ran out of all food except stored almonds and sugar, which were used to make loaves of marzipan \"bread\".  Others believe that marzipan was actually invented in Persia a few hundred years before Lübeck claims to have invented it.  The best known producer is Niederegger, which tourists often visit while in Lübeck, especially at Christmas time.\n\nThe Lübeck wine trade dates back to Hanseatic times. One Lübeck specialty is Rotspon (), wine made from grapes processed and fermented in France and transported in wooden barrels to Lübeck, where it is stored, aged and bottled.\n\nEducation\n\nLübeck has three universities, the University of Lübeck, the Lübeck Academy of Applied Sciences, and the Lübeck Academy of Music. The [http://www.gradschool.uni-luebeck.de Graduate School for Computing in Medicine and Life Sciences] is a central faculty of the University and was founded by the [http://www.dfg.de/en/research_funding/coordinated_programmes/excellence_initiative/ German Excellence Initiative].\nThe International School of New Media is an affiliated institute of the University.\n\nNotable people\n\n* Laurentius Surius (1522-1578), Carthusian monk and Hagiograph\n* August Hermann Francke (1663-1727), pedagogue, theologian, founded the Francke Foundations\n* Adam Brand (explorer), (before 1692-1746), German merchant and researcher\n* Christian Friedrich Heinecken (1721-1725), \"the infant scholar of Lübeck\", a child prodigy\n* Kurd von Schlözer (1822-1894), diplomat and historian\n* John Rugee (1827-1894), politician in Wisconsin, USA\n* Hermann von der Hude (1830-1908), architect\n* Gustav Radbruch (1878-1949), legal scholar and politician\n* Ephraim Carlebach (1879-1936), rabbi and founder of the Higher Israelite School in Leipzig\n* Friedrich Ranke (1882-1950), Germanist and ethnologist\n* Joseph Carlebach (1883-1942), rabbi, victim of the Holocaust\n* Hermann Pister (1885-1948), SS leader and commander of Buchenwald Concentration Camp\n* Walter Ewers (1892-1918), flying ace of WWI\n* Felix Carlebach (1911-2008), rabbi\n* Willy Brandt (1913-1992), politician, German chancellor (SPD)\n* Hans Blumenberg (1920-1996), philosopher\n* Björn Engholm (born 1939), politician (SPD)\n* Sandra Völker (born 1974), swimmer\n\nArt\n\n* Godfrey Kneller (1646-1723), court painter of several British monarchs\n* Catharina Elisabeth Heinecken (1683–1757), German artist and alchemist\n* Carl Heinrich von Heineken (1707–1791), German art historian\n* Friedrich Overbeck (1789-1869), painter and head of the Nazarenes\n* Gotthardt Kuehl (born 1850), painter\n* Maria Slavona (1865-1931), impressionist painter, sister of Cornelia Schorer\n* Erich Ponto (1884-1957), actor\n* Justus von Dohnányi (born 1960), actor\n* Jonas Nay (born 1990), actor\n\nMusic\n\n* Franz Tunder (1614-1667), organist and composer\n* Thomas Baltzar (around 1631-1663), violinist and composer\n* Dieterich Buxtehude, (c.1637-1707), composer and organist\n* Andreas Kneller (1649-1724), composer and organist\n* Friedrich Ludwig Æmilius Kunzen (1761-1817), composer\n\nScience\n\n* Joachim Jungius (1587-1657), mathematician, physicist and philosopher\n* Heinrich Meibom (1638-1700), medical expert, discovered the Meibomian gland\n* Hermann Fehling (1811-1885) chemist\n* Robert Christian Avé-Lallemant (1812-1884), physician and research traveler\n* Ernst Curtius, (1814-1896), classical archaeologist and historian\n* Friedrich Matthias Claudius (1822-1869), anatomist\n* Friedrich Matz (1843-1874), archaeologist \n\nWriting\n\n* Erasmus Finx (1627-1694), polyhistorian, author and church writer\n* Christian Adolph Overbeck (1755-1821), mayor and poet\n* Johann Bernhard Vermehren (1777-1803), romanticist and lecturer\n* Emanuel Geibel (1815-1884), poet\n* Gustav Falke (1853-1916), author\n* Heinrich Mann (1871-1950), novelist (Professor Unrat)\n* Thomas Mann (1875-1955), novelist, Nobel Prize for Literature in 1929\n* Günter Grass (1927-2015), author and artist; recipient of the 1999 Nobel Prize in Literature\n* Jörg Wontorra (born 1948), German sport journalist\n\nParts\n\nThe city of Lübeck is divided into 10 zones.  These again are arranged into altogether 35 urban districts. The 10 zones with their official numbers, their associated urban districts and the numbers of inhabitants of the quarters:\n\n*01 City centre (~ 12,000 Inhabitants)\n*02 St. Jürgen (~ 40,000 Inhabitants)\n** Hüxtertor / Mühlentor / Gärtnergasse, Strecknitz / Rothebek, Blankensee, Wulfsdorf, Beidendorf, Krummesse, Kronsforde, Niederbüssau, Vorrade, Schiereichenkoppel, Oberbüssau\n*03 Moisling (~ 10,000 Inhabitants)\n** Niendorf / Moorgarten, Reecke, Old-Moisling / Genin\n*04 Buntekuh (~ 10,000 Inhabitants)\n*05 St. Lorenz-South (~ 12,000 Inhabitants)\n*06 St. Lorenz-North (~ 40,000 Inhabitants)\n** Holstentor-North, Falkenfeld / Vorwerk / Teerhof, Großsteinrade / Schönböcken, Dornbreite / Krempelsdorf\n*07 St. Gertrud (~ 40,000 Inhabitants)\n** Burgtor / Stadtpark, Marli / Brandenbaum, Eichholz, Karlshof / Israelsdorf / Gothmund\n*08 Schlutup (~ 6,000 Inhabitants)\n*09 Kücknitz (~ 20,000 Inhabitants)\n** Dänischburg / Siems / Rangenberg / Wallberg, Herrenwyk, Alt-Kücknitz / Dummersdorf / Roter Hahn, Poeppendorf\n*10 Travemünde (~ 15,000 Inhabitants)\n** Ivendorf, Alt-Travemünde / Rönnau, Priwall, Teutendorf, Brodten\n\nThe industrial Lübeck-Herrenwyk area was until the beginning of the 1990s the location of a big metallurgical plant. The gas produced by this plant was used for making electricity in the Lübeck-Herrenwyk power station.  In 1992, the Lübeck-Herrenwyk power station was demolished after the bankruptcy and demolition of the metallurgical plant and since 1994 its site houses the static inverter plant of the HVDC Baltic Cable.\n\nInternational relations\n\nLübeck is twinned with:\n\nLubec, Maine, the easternmost town in the United States, is named after Lübeck. Lübeck. http://en.wikipedia.org/?curid=17750."
  }
}
