{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12274",
  "eid" : "015a1fa0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511514,
  "textBody" : "Henri René Albert Guy de Maupassant (;[http://dictionary.reference.com/browse/maupassant \"Maupassant\"]. Random House Webster's Unabridged Dictionary.; 5 August 1850 – 6 July 1893) was a French writer, remembered as a master of the short story form, and as a representative of the naturalist school of writers, who depicted human lives and destinies and social forces in disillusioned and often pessimistic terms.\n\nMaupassant was a protégé of Flaubert and his stories are characterized by economy of style and efficient, effortless dénouements (outcomes). Many are set during the Franco-Prussian War of the 1870s, describing the futility of war and the innocent civilians who, caught up in events beyond their control, are permanently changed by their experiences. He wrote some 300 short stories, six novels, three travel books, and one volume of verse. His first published story, \"Boule de Suif\" (\"Ball of Fat\", 1880), is often considered his masterpiece.\n\nBiography\n\nHenri-René-Albert-Guy de Maupassant was born 5 August 1850 at the Château de Miromesnil (Castle Miromesnil, near Dieppe in the Seine-Inférieure (now Seine-Maritime) department in France. He was the first son of Laure Le Poittevin and Gustave de Maupassant, both from prosperous bourgeois families. His mother urged his father when they married in 1846 to obtain the right to use the particule or form \"de Maupassant\" instead of \"Maupassant\" as his family name, in order to indicate noble birthAlain-Claude Gicquel, Maupassant, tel un météore, Le Castor Astral, 1993, p. 12}}. Gustave discovered a certain Jean-Baptiste Maupassant, conseiller-secrétaire to the King, who was ennobled in 1752Alain-Claude Gicquel, Maupassant, tel un météore, Le Castor Astral, 1993, p. 12}}. He then obtained from the Tribunal Civil of Rouen by decree dated 9 July 1846 the right to style himself \"de Maupassant\" instead of \"Maupassant\" and this was his surname at the birth of his son Guy in 1850Alain-Claude Gicquel, Maupassant, tel un météore, Le Castor Astral, 1993, p. 12}}. \n\nWhen Maupassant was 11 and his brother Hervé was five, his mother, an independent-minded woman, risked social disgrace to obtain a legal separation from her husband, who was violent towards her.\n\nAfter the separation, Laure Le Poittevin kept her two sons. With the father's absence, Maupassant's mother became the most influential figure in the young boy's life. She was an exceptionally well-read woman and was very fond of classical literature, particularly Shakespeare. Until the age of thirteen, Guy happily lived with his mother, at Étretat, in the Villa des Verguies, where, between the sea and the luxuriant countryside, he grew very fond of fishing and outdoor activities. At age thirteen, his mother next placed her two sons as day boarders in a private school, the Institution Leroy-Petit, in Rouen—the Institution Robineau of Maupassant's story La Question du Latin—for classical studies.Maupassant, Choix de Contes, Cambridge, p. viii, 1945 From his early education he retained a marked hostility to religion, and to judge from verses composed around this time he deplored the ecclesiastical atmosphere, its ritual and discipline. Finding the place to be unbearable, he finally got himself expelled in his next-to-last year.\n\nIn 1867, as he entered junior high school, Maupassant made acquaintance with Gustave Flaubert at Croisset at the insistence of his mother. Next year, in autumn, he was sent to the Lycée Pierre-Corneille in Rouen[http://lgcorneille-lyc.spip.ac-rouen.fr/spip.php?article6 Lycée Pierre Corneille de Rouen - History] where he proved a good scholar indulging in poetry and taking a prominent part in theatricals. In October 1868, at the age of 18, he saved the famous poet Algernon Charles Swinburne from drowning off the coast of Étretat.Clyde K. Hyder, Algernon Swinburne: The Critical Heritage, 1995, p. 185\n\nThe Franco-Prussian War broke out soon after his graduation from college in 1870; he enlisted as a volunteer. In 1871, he left Normandy and moved to Paris where he spent ten years as a clerk in the Navy Department. During this time his only recreation and relaxation was boating on the Seine on Sundays and holidays.\n\nGustave Flaubert took him under his protection and acted as a kind of literary guardian to him, guiding his debut in journalism and literature. At Flaubert's home, he met Émile Zola and the Russian novelist Ivan Turgenev, as well as many of the proponents of the realist and naturalist schools. He wrote and played himself in a comedy in 1875 (with the benediction of Flaubert), \"À la feuille de rose, maison turque\".\n\nIn 1878, he was transferred to the Ministry of Public Instruction and became a contributing editor to several leading newspapers such as Le Figaro, Gil Blas, Le Gaulois and l'Écho de Paris. He devoted his spare time to writing novels and short stories.\n\nIn 1880 he published what is considered his first masterpiece, \"Boule de Suif\", which met with instant and tremendous success. Flaubert characterized it as \"a masterpiece that will endure.\" This was Maupassant's first piece of short fiction set during the Franco-Prussian War, and was followed by short stories such as \"Deux Amis\", \"Mother Savage\", and \"Mademoiselle Fifi\".\n\nThe decade from 1880 to 1891 was the most fertile period of Maupassant's life. Made famous by his first short story, he worked methodically and produced two or sometimes four volumes annually. His talent and practical business sense made him wealthy.\n\nIn 1881 he published his first volume of short stories under the title of La Maison Tellier; it reached its twelfth edition within two years. In 1883 he finished his first novel, Une Vie (translated into English as A Woman's Life), 25,000 copies of which were sold in less than a year. His second novel Bel Ami, which came out in 1885, had thirty-seven printings in four months.\n\nHis editor, Havard, commissioned him to write more stories, and Maupassant continued to produce them efficiently and frequently. At this time he wrote what many consider to be his greatest novel, Pierre et Jean.\n\nWith a natural aversion to society, he loved retirement, solitude, and meditation. He traveled extensively in Algeria, Italy, England, Brittany, Sicily, Auvergne, and from each voyage brought back a new volume. He cruised on his private yacht Bel-Ami, named after his novel. This life did not prevent him from making friends among the literary celebrities of his day: Alexandre Dumas, fils had a paternal affection for him; at Aix-les-Bains he met Hippolyte Taine and became devoted to the philosopher-historian.\n\nFlaubert continued to act as his literary godfather. His friendship with the Goncourts was of short duration; his frank and practical nature reacted against the ambiance of gossip, scandal, duplicity, and invidious criticism that the two brothers had created around them in the guise of an 18th-century style salon.\n\nMaupassant was one of a fair number of 19th-century Parisians (including Charles Gounod, Alexandre Dumas, fils, and Charles Garnier) who did not care for the Eiffel Tower. He often ate lunch in the restaurant at its base, not out of preference for the food but because it was only there that he could avoid seeing its otherwise unavoidable profile.Barthes, Roland. The Eiffel Tower and Other Mythologies. Tr. Howard, Richard. Berkeley: University of California Press. . Page 1. He and forty-six other Parisian literary and artistic notables attached their names to an elaborately irate letter of protest against the tower's construction, written to the Minister of Public Works.\n\nMaupassant also wrote under several pseudonyms such as Joseph Prunier, Guy de Valmont, and Maufrigneuse (which he used from 1881 to 1885).\n\nIn his later years he developed a constant desire for solitude, an obsession for self-preservation, and a fear of death and paranoia of persecution caused by the syphilis he had contracted in his youth. It has been suggested that his brother, Hervé, also suffered from syphilis and the disease may have been congenital.http://www.bbc.co.uk/worldservice/arts/highlights/000808_maupassant.shtml On 2 January 1892, Maupassant tried to commit suicide by cutting his throat, and was committed to the private asylum of Esprit Blanche at Passy, in Paris, where he died 6 July 1893.\n\nGuy De Maupassant penned his own epitaph: \"I have coveted everything and taken pleasure in nothing.\" He is buried in Section 26 of the Montparnasse Cemetery, Paris.\n\nSignificance\n\nMaupassant is considered one of the fathers of the modern short story. He delighted in clever plotting, and served as a model for Somerset Maugham and O. Henry in this respect. One of his famous short stories, \"The Necklace\", was imitated with a twist by both Maugham (\"Mr Know-All\", \"A String of Beads\") and Henry James (\"Paste\").\n\nTaking his cue from Balzac, Maupassant wrote comfortably in both the high-Realist and fantastic modes; stories and novels such as \"L'Héritage\" and Bel-Ami aim to recreate Third Republic France in a realistic way, whereas many of the short stories (notably \"Le Horla\" and \"Qui sait?\") describe apparently supernatural phenomena.\n\nThe supernatural in Maupassant, however, is often implicitly a symptom of the protagonists' troubled minds; Maupassant was fascinated by the burgeoning discipline of psychiatry, and attended the public lectures of Jean-Martin Charcot between 1885 and 1886.Pierre Bayard, Maupassant, juste avant Freud (Paris: Minuit, 1998)\n\nLegacy\n\nLeo Tolstoy used Maupassant as the subject for one of his essays on art: The Works of Guy de Maupassant. His stories are only second to Shakespeare in their inspiration of movie adaptations with films ranging from Stagecoach, Citizen Kane, Oyuki the Virgin and Masculine Feminine.\n\nFriedrich Nietzsche's autobiography mentions him in the following text:\n\n\"I cannot at all conceive in which century of history one could haul together such inquisitive and at the same time delicate psychologists as one can in contemporary Paris: I can name as a sample – for their number is by no means small, ... or to pick out one of the stronger race, a genuine Latin to whom I am particularly attached, Guy de Maupassant.\"\n\nWilliam Saroyan wrote a short story about Maupassant in his 1971 book, Letters from 74 rue Taitbout or Don't Go But If You Must Say Hello To Everybody.\n\nIsaac Babel wrote a short story about him, “Guy de Maupassant.” It appears in The Collected Stories of Isaac Babel and in the story anthology You’ve Got To Read This: Contemporary American Writers Introduce Stories that Held Them in Awe.\n\nGene Roddenberry, in an early draft for The Questor Tapes, wrote a scene in which the android Questor employs Maupassant's theory that, \"the human female will open her mind to a man to whom she has opened other channels of communications.\" In the script Questor copulates with a woman to obtain information that she is reluctant to impart. Due to complaints from NBC executives, this part of the script was never filmed.[Quoted from the track \"The Questor Affair\" from the album Inside Star Trek.]\n\nMichel Drach directed and co-wrote a 1982 French biographical film: Guy de Maupassant. Claude Brasseur stars as the titular character.\n\nBibliography\n\nShort stories\n\n*A Country Excursion\n*A Coup d'État\n*A Coward\n*A Cremation\n*Abandoned\n*The Accent\n*After\n*Alexandre\n*All Over\n*Allouma\n*Ampanget\n*An Old Man\n*An Adventure in Paris\n*An Artifice\n*At Sea\n*Bed 29\n*Belhomme's Beast\n*Bertha\n*Beside Schopenhauer's Corpse\n*Boitelle\n*Châli\n*Coco\n*The Accursed Bread\n*The Adopted Son\n*The Apparition\n* The Artist\n*The Baroness\n*The Beggar\n*The Blind Man\n*\"Boule de Suif\" (Ball of Fat)\n*The Cake\n*The Capture of Walter Schnaffs\n*The Child\n*The Christening\n*Clair de Lune\n*Cleopatra in Paris\n*Clochette\n*A Cock Crowed\n*The Colonel's Ideas\n*The Confession\n*The Corsican Bandit\n*The Cripple\n*A Crisis\n*The Dead Girl (a.k.a. \"Was it a Dream?\")\n*Dead Woman's Secret\n*The Deaf Mute\n*Denis\n*The Devil\n*The Diamond Necklace\n*The Diary of a Madman\n*Discovery\n*The Dispenser of Holy Water\n*The Donkey\n*The Door\n*The Dowry\n*Dreams\n*The Drowned Man\n*The Drunkard\n*A Duel\n*The Effeminates\n*The Englishman of Etretat\n*Epiphany\n*The False Gems\n*A Family\n*A Family Affair\n*Farewell\n*The Farmer's Wife\n*Father Matthew\n*A Father's Confession\n*The Fishing Hole\n*Fascination\n*The Father\n*Father Milon\n*Fear\n*Femme Fatale \n*The First Snowfall\n*Florentine\n*Forbidden Fruit\n*Forgiveness\n*Found on a Drowned Man\n*Friend Joseph\n*Friend Patience\n*The Frontier\n*The Gamekeeper\n*A Ghost\n*Ghosts\n*The Grave\n*The Graveyard Sisterhood\n*The Hairpin\n*The Hand\n*Growing Old\n*Happiness\n*Hautot Senior and Hautot Junior\n*His Avenger\n*The Highway Man\n*\"The Horla, or Modern Ghosts\"\n*The Horrible\n*A Humble Drama\n*The Impolite Sex\n*In the Country\n*In the Spring\n*In the Wood\n*Indiscretion\n*The Inn\n*The Jewelry\n*Julie Romaine\n*The Kiss\n*The Lancer's Wife\n*Lasting Love\n*Legend of Mont St. Michel\n*The Legion of Honor\n*Lieutenant Lare's Marriage\n*The Little Cask\n*Little Louise Roque\n*A Lively Friend\n*The Log\n*Looking Back\n*The Love of Long Ago\n*Madame Baptiste\n*Madame Hermet\n*Madame Husson's Rosier\n*Madame Parisse\n*Madame Tellier's Establishment\n*Mademoiselle Cocotte\n*\"Mademoiselle Fifi\"\n*Mademoiselle Pearl\n*The Maison Tellier\n*The Magic Couch\n*Magnetism\n*The Man with the Pale Eyes\n*The Marquis de Fumerol\n*Marroca\n*Martine\n*The Mask\n*A Meeting\n*A Million (Un Million)\n*Minuet\n*Misti\n*Miss Harriet\n*The Model\n*Moiron\n*Monsieur Parent\n*Moonlight\n*The Moribund\n*Mother and Son\n*A Mother of Monsters\n*\"Mother Sauvage\"\n*The Mountain Pool\n*The Mustache\n*My Twenty-Five Days\n*My Uncle Jules\n*My Uncle Sosthenes\n*My Wife\n*The Necklace\n*A New Year's Gift\n*The Night: A Nightmare\n*No Quarter (French Le père Milon)\n*A Normandy Joke\n*Old Amable\n*Old Judas\n*The Old Man\n*Old Mongilet\n*On Horseback\n*On the River\n*On a Spring Evening\n*The Orphan\n*Our Friends The English\n*Our Letters\n*A Parricide\n*The Parrot\n*The Patron\n*The Penguin's Rock\n*\"The Piece of String\"\n*\"Pierrot\"\n*Pierre et Jean\n*The Port\n*A Portrait\n*The Prisoners\n*The Protector\n*Queen Hortense\n*A Queer Night in Paris\n*The Question of Latin\n*The Rabbit\n*A Recollection\n*Regret\n*The Relic\n*The Reward\n*Roger's Method\n*Roly-Poly (Boule de Suif)\n*The Rondoli Sisters\n*Rosalie Prudent\n*Rose\n*Rust\n*A Sale\n*Saint Anthony\n*The Shepherd's Leap\n*The Signal\n*Simon's Papa\n*The Snipe\n*The Son\n*Solitude\n*The Story of a Farm Girl\n*A Stroll\n*The Spasm\n*\"Suicides\"\n*Sundays of a Bourgeois\n*The Terror\n*The Test\n*That Costly Ride\n*That Pig of a Morin\n*Theodule Sabot's Confession\n*The Thief\n*Timbuctoo\n*Toine\n*Tombstones\n*Travelling\n*A Tress of Hair\n*The Trip of the Horla\n*\"Two Friends\"\n*Two Little Soldiers\n*The Umbrella\n*An Uncomfortable Bed\n*The Unknown\n*\"Useless Beauty\"\n*A Vagabond\n*A Vendetta\n*The Venus of Branzia\n*En Voyage\n*Waiter, a \"Bock\"\n*The Wardrobe\n*A Wedding Gift\n*Who Knows?\n*A Widow\n*The Will\n*The Wolf\n*The Wreck\n*The Wrong House\n*Yvette Samoris\n\nNovels\n\n* Une Vie (1883)\n* Bel-Ami (1885)\n* Mont-Oriol (1887)\n* Pierre et Jean (1888)\n* Fort comme la mort (1889)\n* Notre Cœur (1890)\n\nShort-story collections\n\n* Les Soirées de Médan (with Zola, Huysmans et al. Contains Boule de Suif by Maupassant) (1880)\n* La Maison Tellier (1881)\n* Mademoiselle Fifi (1883)\n* Contes de la Bécasse (1883)\n* Miss Harriet (1884)\n* Les Sœurs Rondoli (1884)\n* Clair de lune (1884) (contains \"Les Bijoux\")\n* Yvette (1884)\n* Contes du jour et de la nuit (1885) (contains \"La Parure\" or \"The Necklace\")\n* Monsieur Parent (1886)\n* La Petite Roque (1886)\n* Toine (1886)\n* Le Horla (1887)\n* Le Rosier de Madame Husson (1888)\n* La Main gauche (1889)\n* L'Inutile Beauté (1890)\n\nTravel writing\n\n* Au soleil (1884)\n* Sur l'eau (1888)\n* La Vie errante (1890)\n\nPoetry\n\n* Des Vers (1880) containing Nuit de Neige",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guy de Maupassant" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12274" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Henri René Albert Guy de Maupassant (;[http://dictionary.reference.com/browse/maupassant \"Maupassant\"]. Random House Webster's Unabridged Dictionary.; 5 August 1850 – 6 July 1893) was a French writer, remembered as a master of the short story form, and as a representative of the naturalist school of writers, who depicted human lives and destinies and social forces in disillusioned and often pessimistic terms.\n\nMaupassant was a protégé of Flaubert and his stories are characterized by economy of style and efficient, effortless dénouements (outcomes). Many are set during the Franco-Prussian War of the 1870s, describing the futility of war and the innocent civilians who, caught up in events beyond their control, are permanently changed by their experiences. He wrote some 300 short stories, six novels, three travel books, and one volume of verse. His first published story, \"Boule de Suif\" (\"Ball of Fat\", 1880), is often considered his masterpiece.\n\nBiography\n\nHenri-René-Albert-Guy de Maupassant was born 5 August 1850 at the Château de Miromesnil (Castle Miromesnil, near Dieppe in the Seine-Inférieure (now Seine-Maritime) department in France. He was the first son of Laure Le Poittevin and Gustave de Maupassant, both from prosperous bourgeois families. His mother urged his father when they married in 1846 to obtain the right to use the particule or form \"de Maupassant\" instead of \"Maupassant\" as his family name, in order to indicate noble birthAlain-Claude Gicquel, Maupassant, tel un météore, Le Castor Astral, 1993, p. 12}}. Gustave discovered a certain Jean-Baptiste Maupassant, conseiller-secrétaire to the King, who was ennobled in 1752Alain-Claude Gicquel, Maupassant, tel un météore, Le Castor Astral, 1993, p. 12}}. He then obtained from the Tribunal Civil of Rouen by decree dated 9 July 1846 the right to style himself \"de Maupassant\" instead of \"Maupassant\" and this was his surname at the birth of his son Guy in 1850Alain-Claude Gicquel, Maupassant, tel un météore, Le Castor Astral, 1993, p. 12}}. \n\nWhen Maupassant was 11 and his brother Hervé was five, his mother, an independent-minded woman, risked social disgrace to obtain a legal separation from her husband, who was violent towards her.\n\nAfter the separation, Laure Le Poittevin kept her two sons. With the father's absence, Maupassant's mother became the most influential figure in the young boy's life. She was an exceptionally well-read woman and was very fond of classical literature, particularly Shakespeare. Until the age of thirteen, Guy happily lived with his mother, at Étretat, in the Villa des Verguies, where, between the sea and the luxuriant countryside, he grew very fond of fishing and outdoor activities. At age thirteen, his mother next placed her two sons as day boarders in a private school, the Institution Leroy-Petit, in Rouen—the Institution Robineau of Maupassant's story La Question du Latin—for classical studies.Maupassant, Choix de Contes, Cambridge, p. viii, 1945 From his early education he retained a marked hostility to religion, and to judge from verses composed around this time he deplored the ecclesiastical atmosphere, its ritual and discipline. Finding the place to be unbearable, he finally got himself expelled in his next-to-last year.\n\nIn 1867, as he entered junior high school, Maupassant made acquaintance with Gustave Flaubert at Croisset at the insistence of his mother. Next year, in autumn, he was sent to the Lycée Pierre-Corneille in Rouen[http://lgcorneille-lyc.spip.ac-rouen.fr/spip.php?article6 Lycée Pierre Corneille de Rouen - History] where he proved a good scholar indulging in poetry and taking a prominent part in theatricals. In October 1868, at the age of 18, he saved the famous poet Algernon Charles Swinburne from drowning off the coast of Étretat.Clyde K. Hyder, Algernon Swinburne: The Critical Heritage, 1995, p. 185\n\nThe Franco-Prussian War broke out soon after his graduation from college in 1870; he enlisted as a volunteer. In 1871, he left Normandy and moved to Paris where he spent ten years as a clerk in the Navy Department. During this time his only recreation and relaxation was boating on the Seine on Sundays and holidays.\n\nGustave Flaubert took him under his protection and acted as a kind of literary guardian to him, guiding his debut in journalism and literature. At Flaubert's home, he met Émile Zola and the Russian novelist Ivan Turgenev, as well as many of the proponents of the realist and naturalist schools. He wrote and played himself in a comedy in 1875 (with the benediction of Flaubert), \"À la feuille de rose, maison turque\".\n\nIn 1878, he was transferred to the Ministry of Public Instruction and became a contributing editor to several leading newspapers such as Le Figaro, Gil Blas, Le Gaulois and l'Écho de Paris. He devoted his spare time to writing novels and short stories.\n\nIn 1880 he published what is considered his first masterpiece, \"Boule de Suif\", which met with instant and tremendous success. Flaubert characterized it as \"a masterpiece that will endure.\" This was Maupassant's first piece of short fiction set during the Franco-Prussian War, and was followed by short stories such as \"Deux Amis\", \"Mother Savage\", and \"Mademoiselle Fifi\".\n\nThe decade from 1880 to 1891 was the most fertile period of Maupassant's life. Made famous by his first short story, he worked methodically and produced two or sometimes four volumes annually. His talent and practical business sense made him wealthy.\n\nIn 1881 he published his first volume of short stories under the title of La Maison Tellier; it reached its twelfth edition within two years. In 1883 he finished his first novel, Une Vie (translated into English as A Woman's Life), 25,000 copies of which were sold in less than a year. His second novel Bel Ami, which came out in 1885, had thirty-seven printings in four months.\n\nHis editor, Havard, commissioned him to write more stories, and Maupassant continued to produce them efficiently and frequently. At this time he wrote what many consider to be his greatest novel, Pierre et Jean.\n\nWith a natural aversion to society, he loved retirement, solitude, and meditation. He traveled extensively in Algeria, Italy, England, Brittany, Sicily, Auvergne, and from each voyage brought back a new volume. He cruised on his private yacht Bel-Ami, named after his novel. This life did not prevent him from making friends among the literary celebrities of his day: Alexandre Dumas, fils had a paternal affection for him; at Aix-les-Bains he met Hippolyte Taine and became devoted to the philosopher-historian.\n\nFlaubert continued to act as his literary godfather. His friendship with the Goncourts was of short duration; his frank and practical nature reacted against the ambiance of gossip, scandal, duplicity, and invidious criticism that the two brothers had created around them in the guise of an 18th-century style salon.\n\nMaupassant was one of a fair number of 19th-century Parisians (including Charles Gounod, Alexandre Dumas, fils, and Charles Garnier) who did not care for the Eiffel Tower. He often ate lunch in the restaurant at its base, not out of preference for the food but because it was only there that he could avoid seeing its otherwise unavoidable profile.Barthes, Roland. The Eiffel Tower and Other Mythologies. Tr. Howard, Richard. Berkeley: University of California Press. . Page 1. He and forty-six other Parisian literary and artistic notables attached their names to an elaborately irate letter of protest against the tower's construction, written to the Minister of Public Works.\n\nMaupassant also wrote under several pseudonyms such as Joseph Prunier, Guy de Valmont, and Maufrigneuse (which he used from 1881 to 1885).\n\nIn his later years he developed a constant desire for solitude, an obsession for self-preservation, and a fear of death and paranoia of persecution caused by the syphilis he had contracted in his youth. It has been suggested that his brother, Hervé, also suffered from syphilis and the disease may have been congenital.http://www.bbc.co.uk/worldservice/arts/highlights/000808_maupassant.shtml On 2 January 1892, Maupassant tried to commit suicide by cutting his throat, and was committed to the private asylum of Esprit Blanche at Passy, in Paris, where he died 6 July 1893.\n\nGuy De Maupassant penned his own epitaph: \"I have coveted everything and taken pleasure in nothing.\" He is buried in Section 26 of the Montparnasse Cemetery, Paris.\n\nSignificance\n\nMaupassant is considered one of the fathers of the modern short story. He delighted in clever plotting, and served as a model for Somerset Maugham and O. Henry in this respect. One of his famous short stories, \"The Necklace\", was imitated with a twist by both Maugham (\"Mr Know-All\", \"A String of Beads\") and Henry James (\"Paste\").\n\nTaking his cue from Balzac, Maupassant wrote comfortably in both the high-Realist and fantastic modes; stories and novels such as \"L'Héritage\" and Bel-Ami aim to recreate Third Republic France in a realistic way, whereas many of the short stories (notably \"Le Horla\" and \"Qui sait?\") describe apparently supernatural phenomena.\n\nThe supernatural in Maupassant, however, is often implicitly a symptom of the protagonists' troubled minds; Maupassant was fascinated by the burgeoning discipline of psychiatry, and attended the public lectures of Jean-Martin Charcot between 1885 and 1886.Pierre Bayard, Maupassant, juste avant Freud (Paris: Minuit, 1998)\n\nLegacy\n\nLeo Tolstoy used Maupassant as the subject for one of his essays on art: The Works of Guy de Maupassant. His stories are only second to Shakespeare in their inspiration of movie adaptations with films ranging from Stagecoach, Citizen Kane, Oyuki the Virgin and Masculine Feminine.\n\nFriedrich Nietzsche's autobiography mentions him in the following text:\n\n\"I cannot at all conceive in which century of history one could haul together such inquisitive and at the same time delicate psychologists as one can in contemporary Paris: I can name as a sample – for their number is by no means small, ... or to pick out one of the stronger race, a genuine Latin to whom I am particularly attached, Guy de Maupassant.\"\n\nWilliam Saroyan wrote a short story about Maupassant in his 1971 book, Letters from 74 rue Taitbout or Don't Go But If You Must Say Hello To Everybody.\n\nIsaac Babel wrote a short story about him, “Guy de Maupassant.” It appears in The Collected Stories of Isaac Babel and in the story anthology You’ve Got To Read This: Contemporary American Writers Introduce Stories that Held Them in Awe.\n\nGene Roddenberry, in an early draft for The Questor Tapes, wrote a scene in which the android Questor employs Maupassant's theory that, \"the human female will open her mind to a man to whom she has opened other channels of communications.\" In the script Questor copulates with a woman to obtain information that she is reluctant to impart. Due to complaints from NBC executives, this part of the script was never filmed.[Quoted from the track \"The Questor Affair\" from the album Inside Star Trek.]\n\nMichel Drach directed and co-wrote a 1982 French biographical film: Guy de Maupassant. Claude Brasseur stars as the titular character.\n\nBibliography\n\nShort stories\n\n*A Country Excursion\n*A Coup d'État\n*A Coward\n*A Cremation\n*Abandoned\n*The Accent\n*After\n*Alexandre\n*All Over\n*Allouma\n*Ampanget\n*An Old Man\n*An Adventure in Paris\n*An Artifice\n*At Sea\n*Bed 29\n*Belhomme's Beast\n*Bertha\n*Beside Schopenhauer's Corpse\n*Boitelle\n*Châli\n*Coco\n*The Accursed Bread\n*The Adopted Son\n*The Apparition\n* The Artist\n*The Baroness\n*The Beggar\n*The Blind Man\n*\"Boule de Suif\" (Ball of Fat)\n*The Cake\n*The Capture of Walter Schnaffs\n*The Child\n*The Christening\n*Clair de Lune\n*Cleopatra in Paris\n*Clochette\n*A Cock Crowed\n*The Colonel's Ideas\n*The Confession\n*The Corsican Bandit\n*The Cripple\n*A Crisis\n*The Dead Girl (a.k.a. \"Was it a Dream?\")\n*Dead Woman's Secret\n*The Deaf Mute\n*Denis\n*The Devil\n*The Diamond Necklace\n*The Diary of a Madman\n*Discovery\n*The Dispenser of Holy Water\n*The Donkey\n*The Door\n*The Dowry\n*Dreams\n*The Drowned Man\n*The Drunkard\n*A Duel\n*The Effeminates\n*The Englishman of Etretat\n*Epiphany\n*The False Gems\n*A Family\n*A Family Affair\n*Farewell\n*The Farmer's Wife\n*Father Matthew\n*A Father's Confession\n*The Fishing Hole\n*Fascination\n*The Father\n*Father Milon\n*Fear\n*Femme Fatale \n*The First Snowfall\n*Florentine\n*Forbidden Fruit\n*Forgiveness\n*Found on a Drowned Man\n*Friend Joseph\n*Friend Patience\n*The Frontier\n*The Gamekeeper\n*A Ghost\n*Ghosts\n*The Grave\n*The Graveyard Sisterhood\n*The Hairpin\n*The Hand\n*Growing Old\n*Happiness\n*Hautot Senior and Hautot Junior\n*His Avenger\n*The Highway Man\n*\"The Horla, or Modern Ghosts\"\n*The Horrible\n*A Humble Drama\n*The Impolite Sex\n*In the Country\n*In the Spring\n*In the Wood\n*Indiscretion\n*The Inn\n*The Jewelry\n*Julie Romaine\n*The Kiss\n*The Lancer's Wife\n*Lasting Love\n*Legend of Mont St. Michel\n*The Legion of Honor\n*Lieutenant Lare's Marriage\n*The Little Cask\n*Little Louise Roque\n*A Lively Friend\n*The Log\n*Looking Back\n*The Love of Long Ago\n*Madame Baptiste\n*Madame Hermet\n*Madame Husson's Rosier\n*Madame Parisse\n*Madame Tellier's Establishment\n*Mademoiselle Cocotte\n*\"Mademoiselle Fifi\"\n*Mademoiselle Pearl\n*The Maison Tellier\n*The Magic Couch\n*Magnetism\n*The Man with the Pale Eyes\n*The Marquis de Fumerol\n*Marroca\n*Martine\n*The Mask\n*A Meeting\n*A Million (Un Million)\n*Minuet\n*Misti\n*Miss Harriet\n*The Model\n*Moiron\n*Monsieur Parent\n*Moonlight\n*The Moribund\n*Mother and Son\n*A Mother of Monsters\n*\"Mother Sauvage\"\n*The Mountain Pool\n*The Mustache\n*My Twenty-Five Days\n*My Uncle Jules\n*My Uncle Sosthenes\n*My Wife\n*The Necklace\n*A New Year's Gift\n*The Night: A Nightmare\n*No Quarter (French Le père Milon)\n*A Normandy Joke\n*Old Amable\n*Old Judas\n*The Old Man\n*Old Mongilet\n*On Horseback\n*On the River\n*On a Spring Evening\n*The Orphan\n*Our Friends The English\n*Our Letters\n*A Parricide\n*The Parrot\n*The Patron\n*The Penguin's Rock\n*\"The Piece of String\"\n*\"Pierrot\"\n*Pierre et Jean\n*The Port\n*A Portrait\n*The Prisoners\n*The Protector\n*Queen Hortense\n*A Queer Night in Paris\n*The Question of Latin\n*The Rabbit\n*A Recollection\n*Regret\n*The Relic\n*The Reward\n*Roger's Method\n*Roly-Poly (Boule de Suif)\n*The Rondoli Sisters\n*Rosalie Prudent\n*Rose\n*Rust\n*A Sale\n*Saint Anthony\n*The Shepherd's Leap\n*The Signal\n*Simon's Papa\n*The Snipe\n*The Son\n*Solitude\n*The Story of a Farm Girl\n*A Stroll\n*The Spasm\n*\"Suicides\"\n*Sundays of a Bourgeois\n*The Terror\n*The Test\n*That Costly Ride\n*That Pig of a Morin\n*Theodule Sabot's Confession\n*The Thief\n*Timbuctoo\n*Toine\n*Tombstones\n*Travelling\n*A Tress of Hair\n*The Trip of the Horla\n*\"Two Friends\"\n*Two Little Soldiers\n*The Umbrella\n*An Uncomfortable Bed\n*The Unknown\n*\"Useless Beauty\"\n*A Vagabond\n*A Vendetta\n*The Venus of Branzia\n*En Voyage\n*Waiter, a \"Bock\"\n*The Wardrobe\n*A Wedding Gift\n*Who Knows?\n*A Widow\n*The Will\n*The Wolf\n*The Wreck\n*The Wrong House\n*Yvette Samoris\n\nNovels\n\n* Une Vie (1883)\n* Bel-Ami (1885)\n* Mont-Oriol (1887)\n* Pierre et Jean (1888)\n* Fort comme la mort (1889)\n* Notre Cœur (1890)\n\nShort-story collections\n\n* Les Soirées de Médan (with Zola, Huysmans et al. Contains Boule de Suif by Maupassant) (1880)\n* La Maison Tellier (1881)\n* Mademoiselle Fifi (1883)\n* Contes de la Bécasse (1883)\n* Miss Harriet (1884)\n* Les Sœurs Rondoli (1884)\n* Clair de lune (1884) (contains \"Les Bijoux\")\n* Yvette (1884)\n* Contes du jour et de la nuit (1885) (contains \"La Parure\" or \"The Necklace\")\n* Monsieur Parent (1886)\n* La Petite Roque (1886)\n* Toine (1886)\n* Le Horla (1887)\n* Le Rosier de Madame Husson (1888)\n* La Main gauche (1889)\n* L'Inutile Beauté (1890)\n\nTravel writing\n\n* Au soleil (1884)\n* Sur l'eau (1888)\n* La Vie errante (1890)\n\nPoetry\n\n* Des Vers (1880) containing Nuit de Neige. Guy de Maupassant. http://en.wikipedia.org/?curid=12274."
  }
}
