{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16703",
  "eid" : "27b59cb0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778575867,
  "textBody" : "Kyrgyzstan favors close relations with other members of the Commonwealth of Independent States, particularly Kazakhstan and Russia.\n\nWhile Kyrgyzstan was initially determined to stay in the ruble zone, the stringent conditions set forth by the Russian Government prompted Kyrgyzstan to introduce its own currency, the som, in May 1993. Kyrgyzstan's withdrawal from the ruble zone was done with little prior notification and initially caused tensions in the region. Both Kazakhstan and Uzbekistan temporarily suspended trade, and Uzbekistan even introduced restrictions tantamount to economic sanctions. Both nations feared an influx of rubles and an increase in inflation. Uzbekistan and Kazakhstan's hostility toward Kyrgyzstan was short-lived, and the three nations signed an agreement in January 1994 creating an economic union. This led to the relaxation of border restrictions between the nations the following month. Kyrgyzstan also has contributed to the CIS peacekeeping forces in Tajikistan.\n\nTurkey has sought to capitalize on its cultural and ethnic links to the region and has found Kyrgyzstan receptive to cultivating bilateral relations. The Kyrgyz Republic also has experienced a dramatic increase in trade with the People's Republic of China, its southern neighbor. Kyrgyzstan has been active in furthering regional cooperation, such as joint military exercises with Uzbek and Kazakh troops.\n\nIn January 1999, a new OSCE office opened in Bishkek; on February 18, 2000 the OSCE announced that an additional office would open in Osh to assist Bishkek in carrying out its work. Kyrgyzstan is a member of the OSCE, the CIS, and the United Nations.\n\nIllegal drugs\n\nKyrgyzstan is a limited illicit cultivator of cannabis and opium poppy, mostly for CIS consumption. There is a limited government eradication program. Kyrgyzstan is used increasingly as a transshipment point for illicit drugs to Russia and Western Europe from Southwest Asia.\n\nNeighbors\n\nPeople's Republic of China\n\nAs of 1996, China-Kyrgyzstan relations were an area of substantial uncertainty for the government in Bishkek. The free-trade zone in Naryn attracted large numbers of Chinese businesspeople, who came to dominate most of the republic's import and export of small goods. Most of these trades are in barter conducted by ethnic Kyrgyz or Kazakhs who are Chinese citizens. The Kyrgyzstani government has expressed alarm over the numbers of Chinese who are moving into Naryn and other parts of Kyrgyzstan, but no preventive measures had been taken as of 1996.Martha Brill Olcott. \"Central Asian Neighbors\". [http://lcweb2.loc.gov/frd/cs/kgtoc.html Kyrgyzstan: a country study] (Glenn E. Curtis, editor). Library of Congress Federal Research Division (March 1996). This article incorporates text from this source, which is in the public domain.\n\nKazakhstan\n\nBilateral relationships between the countries are very strong and Kyrgyz and Kazakh are very close in terms of language, culture and religion. Kyrgyz-Kazakh relationships have always been friendly and economic and other formal unifications of two countries have been greeted with strong appreciation since the two nations have a lot in common.  On Apr. 26, 2007 Kazakhstan and Kyrgyzstan signed an agreement to create an \"International Supreme Council\". This historic event took place during an official visit of the Kazakh president to the Kyrgyzstan capital, Bishkek.[http://www.caucaz.com/home_eng/depeches.php?idp=1703 Central Asia: A Kyrgyz-Kazakh Step Towards Regional Union] This article incorporates text from this source, which is in the public domain.\n\nTajikistan\n\nKyrgyzstan-Tajikistan relations have been tense. Refugees and antigovernment fighters in Tajikistan have crossed into Kyrgyzstan several times, even taking hostages. Kyrgyzstan attempted to assist in brokering an agreement between contesting Tajikistani forces in October 1992 but without success. Askar Akayev later joined presidents Islam Karimov and Nursultan Nazarbayev in sending a joint intervention force to support Tajikistan's president Imomali Rahmonov against insurgents, but the Kyrgyzstani parliament delayed the mission of its small contingent for several months until late spring 1993. In mid-1995 Kyrgyzstani forces had the responsibility of sealing a small portion of the Tajikistan border near Panj from Tajikistani rebel forces.\n\nUzbekistan\n\nUzbekistan dominates southern Kyrgyzstan both economically and politically, based on the large Uzbek population in that region of Kyrgyzstan and on economic and geographic conditions. Much of Kyrgyzstan depends entirely on Uzbekistan for natural gas; on several occasions, Karimov has achieved political ends by shutting pipelines or by adjusting terms of delivery.  In a number of television appearances broadcast in the Osh and Jalal-Abad provinces of Kyrgyzstan, Karimov has addressed Akayev with considerable condescension; Akayev, in turn, has been highly deferential to his much stronger neighbor. Although Uzbekistan has not shown overt expansionist tendencies, the Kyrgyz government is acutely aware of the implications of Karimov's assertions that he is responsible for the well-being of all Uzbeks, regardless of their nation of residence.\n\nRest of world\n\nArgentina\n\nBoth countries established diplomatic relations on October 6, 1992[http://tratados.mrecic.gov.ar/tratado_ficha.php?id=3883]. \n\nArmenia\n\n* Both countries established diplomatic relations in January 1993 by protocol. \n* Armenia is represented in Kyrgyzstan through its embassy in Astana, Kazakhstan  and an honorary consulate in Bishkek. \n* Kyrgyzstan is represented in Armenia through its embassy in Moscow, Russia. \n* Both countries are members of the Commonwealth of Independent States, Collective Security Treaty Organization and Commonwealth of Independent States Free Trade Area.\n\nAustralia\n\nAustralia is represented in Kyrgyzstan by its embassy in Moscow. \n\nCanada\n\nBoth countries established diplomatic relations in 1992. \n\nChina\n\nBoth countries have a number of bilateral agreements. \n\nCroatia\n\n* Both countries established diplomatic relations on December 23, 1996. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nCyprus\n\n* Both countries established diplomatic relations on February 20, 1992[http://www.olc.gov.cy/olc/olc.nsf/all/482E93DA350A1C48C22575D700267945/$file/List%20of%20Kyrgyzstan.pdf?openelement]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nDominica\n\nBoth countries established diplomatic relations on October 18, 2016.\n\nEstonia\n\n* Both countries established diplomatic relations in 1996. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nGeorgia\n\n* Georgia is represented in Kyrgyzstan by its embassy in Astana. \n* Kyrgyzstan is represented in Georgia by its embassy in Baku[http://mfa.gov.ge/getattachment/MainNav/EmbassiesRepresentations/ForeignEmbassiesMissionsGeorgia/DIPLOMATIC-LIST_July.pdf.aspx]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nGreece\n\n* Both countries established diplomatic relations in 1992.  Greece is represented in Kyrgyzstan through its embassy in Almaty (Kazakhstan). Kyrgyzstan is represented in Greece through a non resident ambassador based in Bishkek (in the Foreign Ministry).  Kyrgyz consular representation in Greece is made by the Kazakh consulate in Athens.\n* On November 1, 2004, Kyrgyz President Askar Akayev made an official visit to Greece. A Foreign Ministry delegation from Greece visited Dushanbe for talks, and had meetings with Tajikistans Foreign Minister Zarifi and First Deputy Foreign Minister Youldashev in 2008. Foreign Minister Dora Bakoyannis met with Tajikistans Foreign Minister Zarifi during the 1st EU-Central Asia Forum on security issues in Paris in September 2008.\n* There are between 650 and 700 people of Greek descent living in Kyrgyzstan. However, the data of the General Secretariat For Greeks Abroad give an even lower number (50 people).\n* In 2004 Greece and Kyrgyzstan signed a bilateral agreement for air transports, tourism and diplomacy during Kyrgyz president Askar Akayev's visit to Greece.\n\nIndia\n\nSince the independence of Kyrgyz Republic on 31 August 1991, India was among the first to establish bilateral diplomatic relations on 18 March 1992; the resident Mission of India was set up in 1994. Political ties with the Kyrgyz Republic have been traditionally warm and friendly. The Kyrgyz leaderships have been largely supportive of India's stand on Kashmir and have welcomed the ongoing peace process. Kyrgyzstan also supports India’s bid for permanent seat at the United Nations Security Council and India’s role in the Shanghai Cooperation Organization (SCO). India also has strong educational ties with the country. The Defense Minister Omuraliyev was enthusiastic about the prospects of military cooperation in a radio interview with Free Europe in September 2013. \"Many are skeptical, thinking that Kyrgyzstan and India can't have mutual interests in military relations.... But we have had a very close partnership in the defense sphere.\" He specified foreign language (presumably English) training, military medicine and preparing for United Nations peacekeeping missions as specific areas of cooperation.\n\nIran\n\nIran–Kyrgyzstan relations are foreign and diplomatic relations between Kyrgyzstan and Iran. Bilateral relations between Iran and Kyrgyzstan are more or less even and somewhat relaxed. On September 12, 2013, Iran’s President Hassan Rouhani expressed political will to enhance relations with Kyrgyzstan and Kazakhstan.\n\nIsrael\n\nBoth countries established diplomatic relations in March 1992. \n\nJapan \n\nDiplomatic relations between Japan and Kyrgyzstan were established on 26 January 1992. Japan opened an embassy in Bishkek in January 2003, and Kyrgyzstan opened an embassy in Tokyo in April 2004.\n\nLatvia\n\n* Both countries established diplomatic relations on March 18, 1993. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nLesotho\n\nBoth countries established diplomatic relations on July 21, 2017.\n\nLithuania\n\n* Both countries established diplomatic relations on July 3, 1992[https://urm.lt/default/en/list-of-countries-with-which-lithuania-has-established-diplomatic-relations]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nMalaysia\n\nKyrgyzstan has an embassy in Kuala Lumpur, while Malaysia embassy in Tashkent is also accredited to Kyrgyzstan.\n\nMalta\n\n* Both countries established diplomatic relations on February 19, 1993[https://foreignaffairs.gov.mt/en/Treaties%20Series/Documents/Kyrgyzstan-%2019%20February%201993.pdf]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nMoldova\n\nBoth countries established diplomatic relations on June 4, 1992. \n\nPakistan\n\nRelations between the two countries were established on 20 December 1991 shortly after Kyrgyzstan became independent from the Soviet Union.\n\nRomania\n\n* Both countries established diplomatic relations on June 15, 1992. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nRussia\n\nWhereas the other Central Asian republics have sometimes complained of Russian interference, Kyrgyzstan has more often wished for more attention and support from Moscow than it has been able to obtain. For all the financial support that the world community has offered, Kyrgyzstan remains economically dependent on Russia, both directly and through Kazakhstan. In early 1995, Askar Akayev, the then President of Kyrgyzstan, attempted to sell Russian companies controlling shares in the republic's twenty-nine largest industrial plants, an offer that Russia refused.Martha Brill Olcott. \"Russia\". [http://lcweb2.loc.gov/frd/cs/kgtoc.html Kyrgyzstan: a country study] (Glenn E. Curtis, editor). Library of Congress Federal Research Division (March 1996). This article incorporates text from this source, which is in the public domain.\n\nSerbia\n\n* Both countries have established diplomatic relations in 1998. \n* In 2011, the total trade value amounted EUR 3,5 million.\n\nSolomon Islands\n\nBoth countries established diplomatic relations in December 2014. \n\nSouth Africa\n\nBoth countries established diplomatic relations in 1992. \n\nSouth Korea\n\nThe Republic of Korea and Kyrgyzstan have had official relations since 1992-1-31. On the sidelines of the 69th session of the UN General Assembly, Foreign Minister Yun Byung-se met with his Kyrgyz counterpart Yerlan Abdyldaev on September 26. In the meeting, the two diplomats discussed matters of mutual concern including ways to boost high-level exchanges to step up substantive cooperation and work together on the international stage. The two sides shared the view that their countries have seen their bilateral relations move forward in diverse fields since the visit of Kyrgyz President Almazbek Atambayev to the Republic of Korea in November 2013. The meeting resulted in an agreement to increase high-level exchanges in order to further enhance friendship and cooperation between the two countries.\n\nSwitzerland\n\nBoth countries established diplomatic relations in 1993. \n\nTurkey\n\nTurkey was the first country to recognize the independence of Kyrgyzstan on 16 December 1991. Diplomatic relations were established on 29 January 1992. The Turkish Embassy in Bishkek and the Kyrgyz Embassy in Ankara were opened in 1992. Turkish investments occupy the fifth place in the country. In 1997, Turkey and Kyrgyzstan signed \"The Eternal Friendship and Cooperation Agreement\".\n\nUnited States\n\nThe U.S. government provides humanitarian assistance, non-lethal military assistance, and assistance to support economic and political reforms. It also has supported the Kyrgyz Republic's requests for assistance from international organizations. \nThe United States helped the Kyrgyz Republic accede to the World Trade Organization (WTO) in December 1998. U.S. assistance aids the Kyrgyz Republic in implementing necessary economic, health sector, and educational reforms, and supports economic development and conflict resolution in the Fergana Valley. (See also American Chamber of Commerce in Kyrgyzstan.)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Kyrgyzstan" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16703" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kyrgyzstan favors close relations with other members of the Commonwealth of Independent States, particularly Kazakhstan and Russia.\n\nWhile Kyrgyzstan was initially determined to stay in the ruble zone, the stringent conditions set forth by the Russian Government prompted Kyrgyzstan to introduce its own currency, the som, in May 1993. Kyrgyzstan's withdrawal from the ruble zone was done with little prior notification and initially caused tensions in the region. Both Kazakhstan and Uzbekistan temporarily suspended trade, and Uzbekistan even introduced restrictions tantamount to economic sanctions. Both nations feared an influx of rubles and an increase in inflation. Uzbekistan and Kazakhstan's hostility toward Kyrgyzstan was short-lived, and the three nations signed an agreement in January 1994 creating an economic union. This led to the relaxation of border restrictions between the nations the following month. Kyrgyzstan also has contributed to the CIS peacekeeping forces in Tajikistan.\n\nTurkey has sought to capitalize on its cultural and ethnic links to the region and has found Kyrgyzstan receptive to cultivating bilateral relations. The Kyrgyz Republic also has experienced a dramatic increase in trade with the People's Republic of China, its southern neighbor. Kyrgyzstan has been active in furthering regional cooperation, such as joint military exercises with Uzbek and Kazakh troops.\n\nIn January 1999, a new OSCE office opened in Bishkek; on February 18, 2000 the OSCE announced that an additional office would open in Osh to assist Bishkek in carrying out its work. Kyrgyzstan is a member of the OSCE, the CIS, and the United Nations.\n\nIllegal drugs\n\nKyrgyzstan is a limited illicit cultivator of cannabis and opium poppy, mostly for CIS consumption. There is a limited government eradication program. Kyrgyzstan is used increasingly as a transshipment point for illicit drugs to Russia and Western Europe from Southwest Asia.\n\nNeighbors\n\nPeople's Republic of China\n\nAs of 1996, China-Kyrgyzstan relations were an area of substantial uncertainty for the government in Bishkek. The free-trade zone in Naryn attracted large numbers of Chinese businesspeople, who came to dominate most of the republic's import and export of small goods. Most of these trades are in barter conducted by ethnic Kyrgyz or Kazakhs who are Chinese citizens. The Kyrgyzstani government has expressed alarm over the numbers of Chinese who are moving into Naryn and other parts of Kyrgyzstan, but no preventive measures had been taken as of 1996.Martha Brill Olcott. \"Central Asian Neighbors\". [http://lcweb2.loc.gov/frd/cs/kgtoc.html Kyrgyzstan: a country study] (Glenn E. Curtis, editor). Library of Congress Federal Research Division (March 1996). This article incorporates text from this source, which is in the public domain.\n\nKazakhstan\n\nBilateral relationships between the countries are very strong and Kyrgyz and Kazakh are very close in terms of language, culture and religion. Kyrgyz-Kazakh relationships have always been friendly and economic and other formal unifications of two countries have been greeted with strong appreciation since the two nations have a lot in common.  On Apr. 26, 2007 Kazakhstan and Kyrgyzstan signed an agreement to create an \"International Supreme Council\". This historic event took place during an official visit of the Kazakh president to the Kyrgyzstan capital, Bishkek.[http://www.caucaz.com/home_eng/depeches.php?idp=1703 Central Asia: A Kyrgyz-Kazakh Step Towards Regional Union] This article incorporates text from this source, which is in the public domain.\n\nTajikistan\n\nKyrgyzstan-Tajikistan relations have been tense. Refugees and antigovernment fighters in Tajikistan have crossed into Kyrgyzstan several times, even taking hostages. Kyrgyzstan attempted to assist in brokering an agreement between contesting Tajikistani forces in October 1992 but without success. Askar Akayev later joined presidents Islam Karimov and Nursultan Nazarbayev in sending a joint intervention force to support Tajikistan's president Imomali Rahmonov against insurgents, but the Kyrgyzstani parliament delayed the mission of its small contingent for several months until late spring 1993. In mid-1995 Kyrgyzstani forces had the responsibility of sealing a small portion of the Tajikistan border near Panj from Tajikistani rebel forces.\n\nUzbekistan\n\nUzbekistan dominates southern Kyrgyzstan both economically and politically, based on the large Uzbek population in that region of Kyrgyzstan and on economic and geographic conditions. Much of Kyrgyzstan depends entirely on Uzbekistan for natural gas; on several occasions, Karimov has achieved political ends by shutting pipelines or by adjusting terms of delivery.  In a number of television appearances broadcast in the Osh and Jalal-Abad provinces of Kyrgyzstan, Karimov has addressed Akayev with considerable condescension; Akayev, in turn, has been highly deferential to his much stronger neighbor. Although Uzbekistan has not shown overt expansionist tendencies, the Kyrgyz government is acutely aware of the implications of Karimov's assertions that he is responsible for the well-being of all Uzbeks, regardless of their nation of residence.\n\nRest of world\n\nArgentina\n\nBoth countries established diplomatic relations on October 6, 1992[http://tratados.mrecic.gov.ar/tratado_ficha.php?id=3883]. \n\nArmenia\n\n* Both countries established diplomatic relations in January 1993 by protocol. \n* Armenia is represented in Kyrgyzstan through its embassy in Astana, Kazakhstan  and an honorary consulate in Bishkek. \n* Kyrgyzstan is represented in Armenia through its embassy in Moscow, Russia. \n* Both countries are members of the Commonwealth of Independent States, Collective Security Treaty Organization and Commonwealth of Independent States Free Trade Area.\n\nAustralia\n\nAustralia is represented in Kyrgyzstan by its embassy in Moscow. \n\nCanada\n\nBoth countries established diplomatic relations in 1992. \n\nChina\n\nBoth countries have a number of bilateral agreements. \n\nCroatia\n\n* Both countries established diplomatic relations on December 23, 1996. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nCyprus\n\n* Both countries established diplomatic relations on February 20, 1992[http://www.olc.gov.cy/olc/olc.nsf/all/482E93DA350A1C48C22575D700267945/$file/List%20of%20Kyrgyzstan.pdf?openelement]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nDominica\n\nBoth countries established diplomatic relations on October 18, 2016.\n\nEstonia\n\n* Both countries established diplomatic relations in 1996. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nGeorgia\n\n* Georgia is represented in Kyrgyzstan by its embassy in Astana. \n* Kyrgyzstan is represented in Georgia by its embassy in Baku[http://mfa.gov.ge/getattachment/MainNav/EmbassiesRepresentations/ForeignEmbassiesMissionsGeorgia/DIPLOMATIC-LIST_July.pdf.aspx]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nGreece\n\n* Both countries established diplomatic relations in 1992.  Greece is represented in Kyrgyzstan through its embassy in Almaty (Kazakhstan). Kyrgyzstan is represented in Greece through a non resident ambassador based in Bishkek (in the Foreign Ministry).  Kyrgyz consular representation in Greece is made by the Kazakh consulate in Athens.\n* On November 1, 2004, Kyrgyz President Askar Akayev made an official visit to Greece. A Foreign Ministry delegation from Greece visited Dushanbe for talks, and had meetings with Tajikistans Foreign Minister Zarifi and First Deputy Foreign Minister Youldashev in 2008. Foreign Minister Dora Bakoyannis met with Tajikistans Foreign Minister Zarifi during the 1st EU-Central Asia Forum on security issues in Paris in September 2008.\n* There are between 650 and 700 people of Greek descent living in Kyrgyzstan. However, the data of the General Secretariat For Greeks Abroad give an even lower number (50 people).\n* In 2004 Greece and Kyrgyzstan signed a bilateral agreement for air transports, tourism and diplomacy during Kyrgyz president Askar Akayev's visit to Greece.\n\nIndia\n\nSince the independence of Kyrgyz Republic on 31 August 1991, India was among the first to establish bilateral diplomatic relations on 18 March 1992; the resident Mission of India was set up in 1994. Political ties with the Kyrgyz Republic have been traditionally warm and friendly. The Kyrgyz leaderships have been largely supportive of India's stand on Kashmir and have welcomed the ongoing peace process. Kyrgyzstan also supports India’s bid for permanent seat at the United Nations Security Council and India’s role in the Shanghai Cooperation Organization (SCO). India also has strong educational ties with the country. The Defense Minister Omuraliyev was enthusiastic about the prospects of military cooperation in a radio interview with Free Europe in September 2013. \"Many are skeptical, thinking that Kyrgyzstan and India can't have mutual interests in military relations.... But we have had a very close partnership in the defense sphere.\" He specified foreign language (presumably English) training, military medicine and preparing for United Nations peacekeeping missions as specific areas of cooperation.\n\nIran\n\nIran–Kyrgyzstan relations are foreign and diplomatic relations between Kyrgyzstan and Iran. Bilateral relations between Iran and Kyrgyzstan are more or less even and somewhat relaxed. On September 12, 2013, Iran’s President Hassan Rouhani expressed political will to enhance relations with Kyrgyzstan and Kazakhstan.\n\nIsrael\n\nBoth countries established diplomatic relations in March 1992. \n\nJapan \n\nDiplomatic relations between Japan and Kyrgyzstan were established on 26 January 1992. Japan opened an embassy in Bishkek in January 2003, and Kyrgyzstan opened an embassy in Tokyo in April 2004.\n\nLatvia\n\n* Both countries established diplomatic relations on March 18, 1993. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nLesotho\n\nBoth countries established diplomatic relations on July 21, 2017.\n\nLithuania\n\n* Both countries established diplomatic relations on July 3, 1992[https://urm.lt/default/en/list-of-countries-with-which-lithuania-has-established-diplomatic-relations]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nMalaysia\n\nKyrgyzstan has an embassy in Kuala Lumpur, while Malaysia embassy in Tashkent is also accredited to Kyrgyzstan.\n\nMalta\n\n* Both countries established diplomatic relations on February 19, 1993[https://foreignaffairs.gov.mt/en/Treaties%20Series/Documents/Kyrgyzstan-%2019%20February%201993.pdf]. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nMoldova\n\nBoth countries established diplomatic relations on June 4, 1992. \n\nPakistan\n\nRelations between the two countries were established on 20 December 1991 shortly after Kyrgyzstan became independent from the Soviet Union.\n\nRomania\n\n* Both countries established diplomatic relations on June 15, 1992. \n* Both countries are full members of the Organization for Security and Co-operation in Europe.\n\nRussia\n\nWhereas the other Central Asian republics have sometimes complained of Russian interference, Kyrgyzstan has more often wished for more attention and support from Moscow than it has been able to obtain. For all the financial support that the world community has offered, Kyrgyzstan remains economically dependent on Russia, both directly and through Kazakhstan. In early 1995, Askar Akayev, the then President of Kyrgyzstan, attempted to sell Russian companies controlling shares in the republic's twenty-nine largest industrial plants, an offer that Russia refused.Martha Brill Olcott. \"Russia\". [http://lcweb2.loc.gov/frd/cs/kgtoc.html Kyrgyzstan: a country study] (Glenn E. Curtis, editor). Library of Congress Federal Research Division (March 1996). This article incorporates text from this source, which is in the public domain.\n\nSerbia\n\n* Both countries have established diplomatic relations in 1998. \n* In 2011, the total trade value amounted EUR 3,5 million.\n\nSolomon Islands\n\nBoth countries established diplomatic relations in December 2014. \n\nSouth Africa\n\nBoth countries established diplomatic relations in 1992. \n\nSouth Korea\n\nThe Republic of Korea and Kyrgyzstan have had official relations since 1992-1-31. On the sidelines of the 69th session of the UN General Assembly, Foreign Minister Yun Byung-se met with his Kyrgyz counterpart Yerlan Abdyldaev on September 26. In the meeting, the two diplomats discussed matters of mutual concern including ways to boost high-level exchanges to step up substantive cooperation and work together on the international stage. The two sides shared the view that their countries have seen their bilateral relations move forward in diverse fields since the visit of Kyrgyz President Almazbek Atambayev to the Republic of Korea in November 2013. The meeting resulted in an agreement to increase high-level exchanges in order to further enhance friendship and cooperation between the two countries.\n\nSwitzerland\n\nBoth countries established diplomatic relations in 1993. \n\nTurkey\n\nTurkey was the first country to recognize the independence of Kyrgyzstan on 16 December 1991. Diplomatic relations were established on 29 January 1992. The Turkish Embassy in Bishkek and the Kyrgyz Embassy in Ankara were opened in 1992. Turkish investments occupy the fifth place in the country. In 1997, Turkey and Kyrgyzstan signed \"The Eternal Friendship and Cooperation Agreement\".\n\nUnited States\n\nThe U.S. government provides humanitarian assistance, non-lethal military assistance, and assistance to support economic and political reforms. It also has supported the Kyrgyz Republic's requests for assistance from international organizations. \nThe United States helped the Kyrgyz Republic accede to the World Trade Organization (WTO) in December 1998. U.S. assistance aids the Kyrgyz Republic in implementing necessary economic, health sector, and educational reforms, and supports economic development and conflict resolution in the Fergana Valley. (See also American Chamber of Commerce in Kyrgyzstan.). Foreign relations of Kyrgyzstan. http://en.wikipedia.org/?curid=16703."
  }
}
