{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20297",
  "eid" : "4138add0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778618669,
  "textBody" : "The MOS Technology 6502 (typically \"sixty-five-oh-two\" or \"six-five-oh-two\") William Mensch and the moderator both pronounce the 6502 microprocessor as \"sixty-five-oh-two\". is an 8-bit microprocessor that was designed by a small team led by Chuck Peddle for MOS Technology. When it was introduced in 1975, the 6502 was, by a considerable margin, the least expensive microprocessor on the market. It initially sold for less than one-sixth the cost of competing designs from larger companies, such as Motorola and Intel, and caused rapid decreases in pricing across the entire processor market. Along with the Zilog Z80, it sparked a series of projects that resulted in the home computer revolution of the early 1980s.\n\nPopular home video game consoles and computers, such as the Atari 2600, Atari 8-bit family, Apple II, Nintendo Entertainment System, Commodore 64, and others, used the 6502 or variations of the basic design. Soon after the 6502's introduction, MOS Technology was purchased outright by Commodore International, who continued to sell the microprocessor and licenses to other manufacturers. In the early days of the 6502, it was second-sourced by Rockwell and Synertek, and later licensed to other companies. In its CMOS form, which was developed by the Western Design Center, the 6502 family continues to be widely used in embedded systems, with estimated production volumes in the hundreds of millions.\n\nHistory and use \n\nOrigins at Motorola \n\nThe 6502 was designed by many of the same engineers that had designed the Motorola 6800 microprocessor family. Motorola started the 6800 microprocessor project in 1971 with Tom Bennett as the main architect. The chip layout began in late 1972, the first 6800 chips were fabricated in February 1974 and the full family was officially released in November 1974.Motorola 6800 Oral History (2008), p. 9 John Buchanan was the designer of the 6800 chipBuchanan, John K., \"MOS DC Voltage booster circuit\", [http://www.google.com/patents?id\n2pk6AAAAEBAJ US Patent 3942047], issued March 2, 1976.Buchanan, John K., \"Chip topography for MOS integrated circuitry microprocessor chip\", [http://www.google.com/patents/about?id\n6OkAAAAAEBAJ US Patent 3987418], issued October 19, 1976. and Rod Orgill, who later did the 6501, assisted Buchanan with circuit analyses and chip layout.Motorola 6800 Oral History (2008), p. 8 Bill Mensch joined Motorola in June 1971 after graduating from the University of Arizona (at age 26).Mensch Oral History (1995) Mensch earned an Associate degree from Temple University in 1966 and then worked at Philco Ford as an electronics technician before attending the University of Arizona. His first assignment was helping define the peripheral ICs for the 6800 family and later he was the principal designer of the 6820 Peripheral Interface Adapter (PIA).Mensch, William D., \"Chip topography for MOS interface circuit\", [http://www.google.com/patents/about?id\nNTk4AAAAEBAJ US Patent 3968478], issued July 6, 1976. Motorola's engineers could run analog and digital simulations on an IBM 370-165 mainframe computer. All of the authors were with Motorola's Semiconductor Products Division. Bennett hired Chuck Peddle in 1973 to do architectural support work on the 6800 family products already in progress. Page 30. Bennett already was at work on what became the 6800. \"He hired me,\" Peddle says of Bennett, \"to do the architectural support work for the product he'd already started.\" … Peddle says. \"Motorola tried to kill it several times. Without Bennett, the 6800 would not have happened, and a lot of the industry would not have happened, either.\" He contributed in many areas, including the design of the 6850 ACIA (serial interface).Hepworth, Edward C., Rodney J. Means, Charles I. Peddle, \"Asynchronous Communication Interface Adaptor\", [http://www.google.com/patents/about?id\nvzAvAAAAEBAJ Patent 3975712], issued August 17, 1976. Note: Motorola typically listed inventors in alphabetical order.\n\nMotorola's target customers were established electronics companies such as Hewlett-Packard, Tektronix, TRW and Chrysler. Advertisement showing three embedded applications from TRW, HP and RUSCO. In May 1972, Motorola's engineers began visiting select customers and sharing the details of their proposed 8-bit microprocessor system with ROM, RAM, parallel and serial interfaces.Motorola 6800 Oral History (2008), p. 89 In early 1974, they provided engineering samples of the chips so that customers could prototype their designs. Motorola's \"total product family\" strategy did not focus on the price of the microprocessor, but on reducing the customer's total design cost. They offered development software on a timeshare computer, the \"EXORciser\" system debugging system, onsite training and field application engineer support. Motorola advertisement emphasizing their complete set of peripheral chips and development tools. This shorten the customers product design cycle.Motorola 6800 Oral History (2008) p. 18 Both Intel and Motorola had initially announced a $360 price for a single microprocessor. MC6800 microprocessor price was $360. The MC6850 asynchronous communications interface adaptor (ACIA) was slated for first quarter 1975 introduction. \"Shima implemented the 8080 in about a year and the new device was introduced in April 1974 for $360.\" (The IBM System/360 mainframe was a well known computer at the time.) The actual price for production quantities was much less. Motorola offered a design kit containing the 6800 with six support chips for $300. \"Distributors are being stocked with the M6800 family, and the division is also offering an introductory kit that includes the family's six initial parts, plus applications and programming manuals, for $300.\"\n\nPeddle, who would accompany the sales people on customer visits, found that customers were put off by the high cost of the microprocessor chips. To lower the price, the IC chip size would have to shrink so that more chips could be produced on each silicon wafer. This could be done by removing inessential features in the 6800 and using a newer fabrication technology, \"depletion-mode\" MOS transistors. Peddle and other team members started outlining the design of an improved feature, reduced size microprocessor. At that time, Motorola's new semiconductor fabrication facility in Austin, Texas was having difficulty producing MOS chips and mid 1974 was the beginning of a year-long recession in the semiconductor industry. Also, many of the Mesa, Arizona employees were displeased with the upcoming relocation to Austin.Bagnall (2010), p. 11. Peddle's new offer came at an opportune time for the 6800 developers. \"They didn't want to go to Austin, Texas,\" explains Mensch. Motorola Semiconductor Products Division's management was overwhelmed with problems and showed no interest in Peddle's low-cost microprocessor proposal. Chuck Peddle was frustrated with Motorola's management for missing this new opportunity. In a November 1975 interview, Motorola's Chairman, Robert Galvin, agreed. He said, \"We did not choose the right leaders in the Semiconductor Products division.\" The division was reorganized and the management replaced. New group vice-president John Welty said, \"The semiconductor sales organization lost its sensitivity to customer needs and couldn't make speedy decisions.\" Summary: Semiconductor Products split into two parts, integrated circuits and discrete components. Semiconductor losses for the last four quarters exceeded $30 million. The sales organization lost its sensitivity to customer needs, \"delays in responding to price cuts meant that customers bought elsewhere.\" Technical problems plagued IC production. The troubles are \"not in design, but in chip and die yields.\" Problems have been solved. The MC6800 microprocessor \"arrived in November 1974.\"\n\nPeddle began looking for a source of funding for this new project and found a small semiconductor company in Pennsylvania. In August 1974, Chuck Peddle, Bill Mensch, Rod Orgill, Harry Bawcum, Ray Hirt, Terry Holdt and Wil Mathys left Motorola to join MOS Technology. (Mike James joined later.) Of the seventeen chip designers and layout people on the 6800 team, seven left. There were 30 to 40 other marketers, application engineers and system engineers on the 6800 team.Motorola 6800 Oral History (2008), p. 13 That December, Gary Daniels transferred into the 6800 microprocessor group. Tom Bennett did not want to leave the Phoenix area so Daniels took over the microprocessor development in Austin. His first project was a \"depletion-mode\" version of the 6800; this cut the chip area nearly in half and doubled the speed. The faster parts were available in July 1976. This was followed by the 6802 which added 128 bytes of RAM and an on-chip clock oscillator circuit. Daniels, \"My first assignment was to lead a small team to redesign the 6800 MPU to make it more manufacturable and so that higher speed versions could be selected.\" \n\nMoving to MOS Technology \n\nMOS Technology was formed in 1969 by three executives from General Instrument, Mort Jaffe, Don McLaughlin, and John Pavinen, to produce metal-oxide-semiconductor (MOS) integrated circuits. Allen-Bradley, a supplier of electronic components and industrial controls, acquired a majority interest in 1970.Bagnall (2010), p. 13. The company designed and fabricated custom ICs for customers and had developed a line of calculator chips.\n\nOn August 19, 1974, the former Motorola employees moved into MOS Technology's headquarters at Valley Forge, Pennsylvania. The goal was to design and produce a low cost microprocessor for embedded applications and to target as wide as possible a customer base. This would be possible only if the microprocessor was low cost—and in the semiconductor business, chip size determined cost. The size goal required n-channel \"depletion-mode\" MOS transistors, a more advanced process than MOS Technology's calculator chips used. John Pavinen was able to have the fabrication process ready by June 1975.Bagnall (2010), p. 19 \"Paivinen promised Peddle he would have the n-channel process ready. He was true to his word.\" Chuck Peddle, Rod Orgill, and Wil Mathys designed the initial architecture of the new processors. There would be two microprocessors: the 6501 would plug into the same socket as the Motorola 6800, while the 6502 would work with 6800 family peripherals and have an on-chip clock oscillator. These processors would not run 6800 software because they had a different instruction set, different registers, and mostly different addressing modes.Stanford University, Silicon Genesis project: videotaped oral history interview of Willam Mensch A September 1975 article in EDN magazine gives this summary of the design:\n\nThe MOS Technology 650X family represents a conscious attempt of eight former Motorola employees who worked on the development of the 6800 system to put out a part that would replace and outperform the 6800, yet undersell it. With the benefit of hindsight gained on the 6800 project, the MOS Technology team headed by Chuck Peddle, made the following architectural changes in the Motorola CPU…\"\n\nThe second \"B\" accumulator was omitted. The 16-bit 6800 index register with an 8-bit offset in the instruction was replaced with two 8-bit index registers with an 8-bit or 16-bit offset. Three-state control was eliminated from the address bus outputs. A clock generator was included on the chip. The address bus was always active so the VMA (valid-memory address) output was eliminated. An \"8080-type\" RDY signal for single-cycle stepping was added.\n\nThe chip high level design had to be turned into drawings of transistors and interconnects. At MOS Technology, the \"layout\" was a very manual process done with color pencils and vellum paper. The layout consisted of thousands of polygon shapes on six different drawings; one for each layer of the semiconductor fabrication process. Rod Orgill was responsible for the 6501 design; he had assisted John Buchanan at Motorola on the 6800. Bill Mensch did the 6502; he was the designer of the 6820 Peripheral Interface Adapter (PIA) at Motorola. Harry Bawcom, Mike James and Sydney-Anne Holt helped with the layout.\n\nThe size goal for the 6502 chip was 153 x 168 mils (3.9 x 4.3 mm) or an area of 16.6 mm2. At that time the technical literature would state the length and width of each chip in \"mils\" (0.001 inch). A smaller chip area means more chips per silicon wafer and greater yield as defects are generally randomly but uniformly scattered across the wafer area. So the more chips per wafer, the smaller the ratio of defective chips to total wafer chips. The original 6800 chips were intended to be 180 x 180 mils but layout was completed at 212 x 212 mils (5.4 x 5.4 mm) or an area of 29.0 mm2.Motorola 6800 Oral History (2008), p. 10. The first 6502 chips were 168 x 183 mils (4.3 x 4.7 mm) or an area of 19.8 mm2. The Rotate Right instruction (ROR) did not work in the first silicon, so the instruction was temporarily omitted from the published documents, but the next iteration of the design shrank the chip and fixed the Rotate Right instruction, which was then included in revised documentation.The August 1975 datasheet had 55 instructions with no ROR, the May 1976 datasheet had the ROR and 56 instructions. :File:MCS650x Instruction Set.jpg\n\nIntroducing the 6501 and 6502\n\nMOS Technology's microprocessor introduction was quite different from the traditional months-long product launch. The first run of a new integrated circuit is normally used for internal testing and shared with select customers as \"engineering samples\". These chips often have a minor design defect or two that will be corrected before production begins. Chuck Peddle's goal was to sell the first run 6501 and 6502 chips to the attendees at the Wescon trade show in San Francisco beginning on September 16, 1975. Peddle was a very effective spokesman and the MOS Technology microprocessors were extensively covered in the trade press. One of the earliest was a full-page story on the MCS6501 and MCS6502 microprocessors in the July 24, 1975 issue of Electronics magazine. The article covers the 6501 and 6502 plus the 28 pin versions that would only address 4K of memory. It also covered future devices such as \"a design that Peddle calls a pseudo 16\". Stories also ran in EE Times (August 24, 1975), EDN (September 20, 1975), Electronic News (November 3, 1975), Byte (November 1975) Comparison of the 6502 and the 6800 microprocessors. Author visited MOS Technology in August 1975. and Microcomputer Digest (November 1975). Advertisements for the 6501 appeared in several publications the first week of August 1975. The 6501 would be for sale at Wescon for $20 each. In September 1975, the advertisements included both the 6501 and the 6502 microprocessors. The 6502 would cost only $25.\n\nWhen MOS Technology arrived at Wescon, they found that exhibitors could not sell anything on the show floor. They rented the MacArthur Suite at the St. Francis Hotel and directed customers there to purchase the processors. At the suite, the processors were stored in large jars to imply that the chips were in production and readily available. The customers did not know the bottom half of each jar contained non-functional chips.Bagnall (2010), pp. 33-35 The chips were $20 and $25 while the documentation package was an additional $10. Users were encouraged to make copies of the documents, an inexpensive way for MOS Technology to distribute product information. The processors were supposed to have 56 instructions, but the Rotate Right (ROR) instruction did not work correctly on these chips, so the preliminary data sheets listed just 55 instructions. The reviews in Byte and EDN noted the lack of the ROR instruction. The next revision of the layout fixed this problem and the May 1976 datasheet listed 56 instructions. Peddle wanted every interested engineer and hobbyist to have access to the chips and documentation; other semiconductor companies only wanted to deal with \"serious\" customers. For example, Signetics was introducing the 2650 microprocessor and its advertisements asked readers to write for information on their company letterhead.\n\nMotorola lawsuit \n\nThe 6501/6502 introduction in print and at Wescon was an enormous success. The downside was that the extensive press coverage got Motorola's attention. In October 1975, Motorola reduced the price of a single 6800 microprocessor from $175 to $69. The $300 system design kit was reduced to $150 and it now came with a printed circuit board. The quantity one price for the MC6800 was reduced from $175 to $69. The previous price for 50 to 99 units was $125. On November 3, 1975, Motorola sought an injunction in Federal Court to stop MOS Technology from making and selling microprocessor products. They also filed a lawsuit claiming patent infringement and misappropriation of trade secrets. Motorola claimed that seven former employees joined MOS Technology to create that company's microprocessor products.\"Motorola said last week it would seek an immediate injunction to stop MOS Technology Inc., Norristown, Pa., from making and selling microprocessor products, including its MCS6500.\" (This issue was published on November 7.)\n\nMotorola was a billion-dollar company with a plausible case and lawyers. On October 30, 1974, Motorola had filed numerous patent applications on the microprocessor family and was granted twenty-five patents. The first was in June 1976 and the second was to Bill Mensch on July 6, 1976 for the 6820 PIA chip layout. These patents covered the 6800 bus and how the peripheral chips interfaced with the microprocessor.Motorola was awarded the following US Patents on the 6800 microprocessor family: 3962682, 3968478, 3975712, 3979730, 3979732, 3987418, 4003028, 4004281, 4004283, 4006457, 4010448, 4016546, 4020472, 4030079, 4032896, 4037204, 4040035, 4069510, 4071887, 4086627, 4087855, 4090236, 4145751, 4218740, 4263650. Motorola began making transistors in 1950 and had a portfolio of semiconductor patents. Allen-Bradley decided not to fight this case and sold their interest in MOS Technology back to the founders. Four of the former Motorola engineers were named in the suit: Chuck Peddle, Will Mathys, Bill Mensch and Rod Orgill. All were named inventors in the 6800 patent applications. During the discovery process, Motorola found that one engineer, Mike James, had ignored Peddle's instructions and brought his 6800 design documents to MOS Technology.Bagnall (2010), p. 53–54. \"He [Mike James] had all his original work from the 6800 and hid it from Motorola… In March 1976, the now independent MOS Technology was running out of money and had to settle the case. They agreed to drop the 6501 processor, pay Motorola $200,000 and return the documents that Motorola contended were confidential. Both companies agreed to cross-license microprocessor patents. \"MOS Technology Inc. of Norristown, Pa. has agreed to withdraw its MCS6501 microprocessor from the market and to pay Motorola Inc. $200000 ...\" \"MOS Technology and eight former Motorola employees have given back, under court order documents that Motorola contends are confidential.\" \"…both companies have agreed to a cross license relating to patents in the microprocessor field.\" That May, Motorola dropped the price of a single 6800 microprocessor to $35. By November Commodore had acquired MOS Technology.Bagnall (2010), pp. 55-56\" Commodore International … is buying MOS Technology (Norristown, PA). This saves the six-year-old semiconductor house from impending disaster.\"\n\nComputers and games \n\nWith legal troubles behind them, MOS was still left with the problem of getting developers to try their processor, prompting Chuck Peddle to design the MDT-650 (\"microcomputer development terminal\") single-board computer. Another group inside the company designed the KIM-1, which was sold semi-complete and could be turned into a usable system with the addition of a 3rd party computer terminal and compact cassette drive. Much to their amazement, the KIM-1 sold well to hobbyists and tinkerers, as well as to the engineers to which it had been targeted. The related Rockwell AIM 65 control/training/development system also did well. The software in the AIM 65 was based on that in the MDT. Another roughly similar product was the Synertek SYM-1.\n\nOne of the first \"public\" uses for the design was the Apple I microcomputer, introduced in 1976. The 6502 was next used in the Commodore PET and the Apple II, both released in 1977. It was later used in the Atari 8-bit family and Acorn Atom home computers, the BBC Micro, Commodore VIC-20 and other designs both for home computers and business, such as Ohio Scientific and Oric. The 6510, a direct successor of the 6502 with a digital I/O port and a tri-state address bus, was the CPU utilized in the best-selling Commodore 64 home computer. Commodore's floppy disk drive, the 1541, had a processor of its own—it too was a 6502.\n\nAnother important use of the 6500 family was in video games. The first to make use of the processor design was the Atari VCS, later renamed the Atari 2600. The VCS used an offshoot of the 6502 called the 6507, which had fewer pins and, as a result, could address only 8 KB of memory. Millions of the Atari consoles would be sold, each with a MOS processor. Another significant use was by the Nintendo Entertainment System and Famicom. The 6502 used in the NES was a second source version by Ricoh, a partial system-on-a-chip, that lacked the binary-coded decimal mode but added 22 memory-mapped registers (and on-die hardware) for sound generation, joypad reading, and sprite list DMA. Called 2A03 in NTSC consoles and 2A07 in PAL consoles (the difference being the memory divider ratio and a lookup table for audio sample rates), this processor was produced exclusively for Nintendo.\n\nIn the 1980s, a popular electronics magazine Elektor/Elektuur used the processor in its microprocessor development board Junior Computer.\n\nFile:Apple iieb.jpg|Apple IIe\nFile:Commodore 2001 Series-IMG 0448b.jpg|Commodore PET\nFile:BBC Micro Front Restored.jpg|BBC Micro\nFile:Atari-2600-Console.jpg|Atari 2600\nFile:Atari-800-Computer-FL.jpg|Atari 800\nFile:Commodore-VIC-20-FL.jpg|Commodore VIC-20\nFile:C64c_system.jpg|Commodore 64\nFile:Nintendo-Famicom-Console-Set-FL.jpg|Family Computer\nFile:OSI Challenger 4P.jpg|Ohio Scientific Challenger 4P\nFile:Tamagotchi_0124_ubt.jpeg|Tamagotchi digital pethttps://www.kwartzlab.ca/2013/05/code-execution-tamagotchi/\n\nTechnical description\n\nThe 6502 is a little-endian 8-bit processor with a 16-bit address bus. The original versions were fabricated using an  process technology chip with an advertised die size of 153 x 168 mils (3.9 x 4.3 mm) or an area of 16.6 mm2.\n\nThe internal logic runs at the same speed as the external clock rate, but despite the slow clock speeds (typically in the neighborhood of 1 to 2 MHz), the 6502's performance was competitive with other contemporary CPUs using significantly faster clocks. This is partly due to a simplistic state machine implemented by combinatorial (clockless) logic to a greater extent than in many other designs; the two phase clock (supplying two synchronizations per cycle) can thereby control the whole machine-cycle directly. Typical instructions might take half as many cycles to complete on the 6502 than contemporary designs. Like most simple CPUs of the era, the dynamic NMOS 6502 chip is not sequenced by a microcode ROM but uses a PLA (which occupied about 15 percent of the chip area) for instruction decoding and sequencing. Like most eight-bit microprocessors, the chip does some limited overlapping of fetching and execution.\n\nThe low clock frequency moderated the speed requirement of memory and peripherals attached to the CPU, as only about 50 percent of the clock cycle was available for memory access (due to the asynchronous design, this percentage varied strongly among chip versions). This was critical at a time when affordable memory had access times in the range . The original NMOS 6502 was minimalistically engineered and efficiently manufactured and therefore cheap—an important factor in getting design wins in the very price-sensitive game console and home computer markets.\nLike its precursor, the Motorola 6800, the 6502 has very few registers. At the time the processor was designed, the number of transistors that could be economically put on a chip was very constrained (around a few thousand), so it made sense to rely on RAM instead of allocating expensive NMOS chip area for CPU registers. To this end, the CPU includes a 'zero-page' addressing mode that uses one address byte in the instruction instead of the two needed to address the full 64 KB of memory. This provides fast access to the first 256 bytes of RAM by using shorter instructions. Chuck Peddle has said in interviews that the specific intention was to allow these first 256 bytes of RAM to be used like registers.\n\nRegisters\n\nThe 6502's registers include one 8-bit accumulator register (A), two 8-bit index registers (X and Y), 7 processor status flag bits (P), an 8-bit stack pointer (S), and a 16-bit program counter (PC). The stack's address space is hardwired to memory page $01, i.e. the address range $0100–$01FF (256–511). Software access to the stack is done via four implied addressing mode instructions, whose functions are to push or pop (pull) the accumulator or the processor status register. The same stack is also used for subroutine calls via the JSR (Jump to Subroutine) and RTS (Return from Subroutine) instructions and for interrupt handling.\n\nAddressing\n\nThe chip uses the index and stack registers effectively with several addressing modes, including a fast \"direct page\" or \"zero page\" mode, similar to that found on the PDP-8, that accesses memory locations from addresses 0 to 255 with a single 8-bit address (saving the cycle normally required to fetch the high-order byte of the address)—code for the 6502 uses the zero page much as code for other processors would use registers. On some 6502-based microcomputers with an operating system, the OS uses most of zero page, leaving only a handful of locations for the user.\n\nAddressing modes also include implied (1 byte instructions); absolute (3 bytes); indexed absolute (3 bytes); indexed zero-page (2 bytes); relative (2 bytes); accumulator (1); indirect,x and indirect,y (2); and immediate (2). Absolute mode is a general-purpose mode. Branch instructions use a signed 8-bit offset relative to the instruction after the branch; the numerical range -128..127 therefore translates to 128 bytes backward and 127 bytes forward from the instruction following the branch (which is 126 bytes backward and 129 bytes forward from the start of the branch instruction). Accumulator mode uses the accumulator as an effective address, and does not need any operand data. Immediate mode uses an 8-bit literal operand.\n\nIndirect addressing\n\nThe indirect modes are useful for array processing and other looping. With the 5/6 cycle \"(indirect),y\" mode, the 8-bit Y register is added to a 16-bit base address read from zero page which is located by a single byte following the opcode. The Y register is therefore an index-register in the sense that it is used to hold an actual index (as opposed to the X register in the 6800 where a base address was directly stored and to which an immediate offset could be added). Incrementing the index register to walk the array byte-wise takes only two additional cycles. With the less frequently used \"(indirect,x)\" mode the effective address for the operation is found at the zero page address formed by adding the second byte of the instruction to the contents of the X register. Using the indexed modes, the zero page effectively acts as a set of up to 128 additional (though very slow) address registers.\n\nThe 6502 is capable of performing addition and subtraction in binary or binary coded decimal. Placing the CPU into BCD mode with the SED (set D flag) instruction results in decimal arithmetic, in which $99 + $01 would result in $00 and the carry (C) flag being set. In binary mode (CLD, clear D flag), the same operation would result in $9A and the carry flag being cleared. Other than Atari BASIC, BCD mode was seldom used in home computer applications.\n\nSee the Hello world! article for a simple but characteristic example of 6502 assembly language.\n\nDetailed behavior\n\nThe processor's non-maskable interrupt (NMI) input is edge sensitive, which means that the interrupt is triggered by the falling edge of the signal rather than its level. The implication of this feature is that a wired-OR interrupt circuit is not readily supported. However, this also prevents nested NMI interrupts from occurring until the hardware makes the NMI input inactive again, often under control of the NMI interrupt handler.\n\nThe simultaneous assertion of the NMI and IRQ (maskable) hardware interrupt lines causes IRQ to be ignored. However, if the IRQ line remains asserted after the servicing of the NMI, the processor will immediately respond to IRQ, as IRQ is level sensitive. Thus a sort of built-in interrupt priority was established in the 6502 design.\n\nThe \"Break\" flag of the processor is very different from the other flag bits. It has no flag setting, resetting, or testing instructions of its own, and is not affected by the PHP and PLP instructions. It exists only on the stack, where BRK and PHP always write a 1, while IRQ and NMI always write a 0.\n\nThe \"SO\" input pin, when asserted, will set the processor's overflow status bit (deasserting it does not clear the overflow bit, however). This can be used by a high-speed polling device driver, which can poll the hardware once in only three cycles by using a Branch-on-oVerflow-Clear (BVC) instruction that branches to itself. For example, the Commodore 1541 and other Commodore floppy disk drives use this technique to detect without delay whether the serializer is ready to accept or provide another byte of disk data. Obviously great care must be used in the device driver and the associated system design, as spurious assertion of the overflow bit could ruin arithmetic processing.\n\nAssembly language instructions\n\nA 6502 assembly language statement consists of a three-character instruction mnemonic, followed by an operand in the case of an instruction that takes an operand.  When assembled, the resulting machine code consists of a one-byte operation code (opcode), followed by a one- or two-byte operand, if the instruction was assembled with an operand, hence 6502 machine instructions vary in length from one to three bytes.[http://e-tradition.net/bytes/6502/6502_instruction_set.html 6502 Instruction Set].[http://www.6502.org/tutorials/6502opcodes.html NMOS 6502 Opcodes]. The operand is stored in the 6502's customary little-endian format. The 65C816, the 16-bit CMOS version of the 6502, also supports 24-bit addressing, which results in instructions being assembled with three-byte operands, also arranged in little-endian format.\n\nVariations and derivatives \n\nThere were several variants of the NMOS 6502:\n\n* The MOS Technology 6503 had reduced memory addressing capability (4 KB) and no RDY input, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).1982 MOS Technology Data Catalog (pdf obtained from bitsavers.org)\n* The MOS Technology 6504 had reduced memory addressing capability (8 KB), no NMI, and no RDY input, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6505 had reduced memory addressing capability (4 KB) and no NMI, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6506 had reduced memory addressing capability (4 KB), no NMI, and no RDY input, but all 3 clock pins of the 6502 (i.e. a 2-phase output clock), in a 28-pin DIP package (with the SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6507 had reduced memory addressing capability (8 KB) and no interrupts, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6508 has a built-in 8-bit input/output port and 256 bytes of internal static RAM.\n* The MOS Technology 6509 could address up to 1 MB of RAM as 16 banks of 64 kB and was used in the Commodore CBM-II series.\n* The MOS Technology 6510 has a built-in 6-bit programmable input/output port and was used in the Commodore 64.\n* The MOS Technology 6512 was a 6502 with a 2-phase clock input for an external clock oscillator, instead of an on-board clock oscillator.\n* The MOS Technology 6513 was a 6503 with a 2-phase clock input like the 6512.\n* The MOS Technology 6514 was a 6504 with a 2-phase clock input like the 6512.\n* The MOS Technology 6515 was a 6505 with a 2-phase clock input like the 6512.\n* The Ricoh 2A03 was a 6502 variant including an audio processing unit and lacking the BCD mode, used in the Nintendo Entertainment System.\n* The 6502B clocked at 1.79 MHz was used in early Atari 8-bit computers.\n* The 6502C (Sally) was a customized 6502 chip used in later Atari 8-bit computers. It has a HALT signal on pin 35 and a second R/W on pin 36 (these pin are N/C on a standard 6502).\n* The 65C02 is a CMOS version of the NMOS 6502 that was designed by Bill Mensch of the Western Design Center, featuring reduced power consumption, support for much higher clock speeds, new instructions, new addressing modes for some existing instructions, and correction of NMOS errata, such as the JMP ($xxFF) bug.\n* CSG 65CE02 was a CMOS derivative developed by the Commodore Semiconductor Group (CSG), formerly MOS Technology.\n* The Rockwell R65F11 (introduced in 1983) and the later R65F12 are enhanced versions of the 6502-based processor, also including on-chip zero-page RAM, on-chip Forth kernel ROM, a UART, etc.\nRandy M. Dumse.\n\"The R65F11 and F68K Single-Chip Forth Computers\".\n[http://www.forth.org/bournemouth/jfar/vol2/no1/article1.pdf]\n[http://soton.mpeforth.com/flag/jfar/vol2/no1/article1.pdf]\n1984.\n\nEd Schmauch.\n[http://www.forth.org/bournemouth/jfar/vol4/no2/article48.pdf \"A Computerized Corrosion Monitoring System\"].\n1986.\n\nLawrence P. Forsley.\n[https://books.google.com/books?id=Yx8YAQAAMAAJ \"Embedded systems: 1990 Rochester Forth Conference : June 12 - 16th, 1990 University of Rochester\"].\np. 51.\n\nRockwell.\n[http://www.smallestplcoftheworld.org/RSC-FORTH_User's_Manual.pdf \"RSC-Forth User's Manual\"].\n1983.\n\n* The GTE G65SC102 is software compatible with the 65C02, but has a slightly different pinout and oscillator circuit. The BBC Master Turbo included the 4 MHz version of this CPU on a coprocessor card, which could also be bought separately and added to the Master 128.\n* The Rockwell R65C00, R65C21, and R65C29 featured two enhanced CMOS 6502s in a single chip, and the R65C00 and R65C21 additionally contained 2 kB of mask-programmable ROM.https://archive.org/stream/bitsavers_rockwelldaDataBook_80778847/1985_Rockwell_Data_Book_djvu.txt\n\n6512, 6513, 6514, & 6515 \n\nThe MOS Technology 6512, 6513, 6514, and 6515 each rely on an external clock, instead of using an internal clock generator like the 650x (e.g. 6502). This was used to advantage in some designs where the clocks could be run asymmetrically, increasing overall CPU performance.\n\nThe 6512 was used in the BBC Micro B+64.\n\n16-bit derivatives \n\nThe Western Design Center designed and currently produces the W65C816S processor, a 16-bit, static-core successor to the 65C02, with greatly enhanced features. The W65C816S is a newer variant of the 65C816, which was the core of the Apple IIGS computer and was the basis of the Ricoh 5A22 processor that powered the popular Super Nintendo Entertainment System. The W65C816S incorporates minor improvements over the 65C816\nthat make the newer chip not an exact hardware-compatible replacement for the earlier one.  Currently available through electronics distributors as of November 2017, the W65C816S costs about US $8 (down to under US $6 in bulk) and is rated for 14 MHz operation.\n\nThe Western Design Center also designed and produced the 65C802, which was a 65C816 core with a 64 KB address space in a 65(C)02 pin-compatible package. The 65C802 could be retrofitted to a 6502 board and would function as a 65C02 on power-up, operating in \"emulation mode.\" As with the 65C816, a two-instruction sequence would switch the 65C802 to \"native mode\" operation, exposing its 16 bit accumulator and index registers, as well as other 65C816 enhanced features. The 65C802 was not widely used: new designs almost always were built around the 65C816, resulting in 65C802 production being discontinued. \n\n32-bit derivatives \n\nThe 65GZ032 designed by Gideon Zweijtzer is a VHDL source core that is 6502 compatible and extends the 8-bit CPU to a 32-bit design. It features pipelined RISC, new opcodes, access to  of linear memory, paged memory and a clock speed of \n\nExample code \n\nThe following 6502 assembly language source code is for a subroutine named TOLOWER, which copies a null-terminated character string from one location to another, converting upper case letter characters to lower case letters. The string being copied is the \"source\" and the string into which the converted source is stored is the \"destination.\"\n\nBugs and quirks\n\n*The earliest revisions of the 6502, such as those shipped with some KIM-1 computers, had a severe bug in the ROR (rotate right memory or accumulator) instruction. The operation of ROR in these chips is effectively an ASL instruction that does not affect the carry bit in the status register. MOS left the instruction out of chip documentation entirely because of the defect, promising that ROR would appear on 6502 chips starting in 1976. The vast majority of 6502 chips in existence today do not exhibit this bug.\n*The NMOS 6502 family has a variety of undocumented instructions, which vary from one chip manufacturer to the next. The 6502's instruction decoding is implemented in a hardwired logic array (similar to a programmable logic array) that is only defined for 151 of the 256 available opcodes. The remaining 105 trigger strange and occasionally hard-to-predict actions, such as crashing the processor, performing two valid instructions consecutively, performing strange mixtures of two instructions, or simply doing nothing at all. Eastern House Software developed the \"Trap65\", a device that plugged between the processor and its socket to convert (trap) unimplemented opcodes into BRK (software interrupt) instructions. Some programmers utilized this feature to extend the 6502's instruction set by providing functionality for the unimplemented opcodes with specially written software intercepted at the BRK instruction's 0xFFFE vector. All of the undefined opcodes have been replaced by NOP instructions in the 65C02, an enhanced CMOS version of the 6502, although with varying byte sizes and execution times. In the 65C802/65C816, all 256 opcodes perform defined operations.\n*The 6502's memory indirect jump instruction, JMP (), is partially broken. If  is hex xxFF (i.e., any word ending in FF), the processor will not jump to the address stored in xxFF and xxFF+1 as expected, but rather the one defined by xxFF and xx00 (for example, JMP ($10FF) would jump to the address stored in 10FF and 1000, instead of the one stored in 10FF and 1100). This defect continued through the entire NMOS line, but was corrected in the CMOS derivatives.\n*The NMOS 6502's indexed addressing across page boundaries will do an extra read of an invalid address. This characteristic may cause random issues by accessing hardware that acts on a read, such as clearing timer or IRQ flags, sending an I/O handshake, etc. This defect continued through the entire NMOS line, but was corrected in the CMOS derivatives, in which the processor does an extra read of the last instruction byte.\n*The 6502's read-modify-write instructions perform one read and two write cycles. First the unmodified data that was read is written back, and then the modified data is written. This characteristic may cause issues by twice accessing hardware that acts on a write. This anomaly continued through the entire NMOS line, but was fixed in the CMOS derivatives, in which the processor will do two reads and one write cycle. Good programming practice will generally avoid this problem by not executing read/modify/write instructions on hardware registers.\n*The N (result negative), V (sign bit overflow) and Z (result zero) status flags are generally meaningless when performing arithmetic operations while the processor is in BCD mode, as these flags reflect the binary, not BCD, result. This limitation was removed in the CMOS derivatives. Therefore, this feature may be used to distinguish a CMOS processor from an NMOS version.\n*If the processor happens to be in BCD mode when a hardware interrupt occurs it will not revert to binary mode. This characteristic could result in obscure bugs in the interrupt service routine if it fails to clear BCD mode before performing any arithmetic operations. For example, the Commodore 64's KERNAL did not correctly handle this processor characteristic, requiring that IRQs be disabled or re-vectored during BCD math operations. This issue was addressed in the CMOS derivatives as well.\n*The 6502 instruction set includes BRK (opcode $00), which is technically a software interrupt (similar in spirit to the SWI mnemonic of the 6800 and ARM processors). BRK is most often used to interrupt program execution and start a machine language monitor for testing and debugging during software development. BRK could also be used to route program execution using a simple jump table (analogous to the manner in which the 8086 and derivatives handle software interrupts by number). Unfortunately, if a hardware interrupt occurs at the same time the processor is fetching a BRK instruction, the NMOS version of the processor will fail to execute BRK and instead proceed as if only a hardware interrupt had occurred. This fault was corrected in the CMOS implementation of the processor.\n*When executing JSR (jump to subroutine) and RTS (return from subroutine) instructions, the return address pushed to the stack by JSR is that of the last byte of the JSR operand (that is, the most significant byte of the subroutine address), rather than the address of the following instruction. This is because the actual copy (from program counter to stack and then vice versa) takes place before the automatic increment of the program counter that occurs at the end of every instruction. This characteristic would go unnoticed unless the code examined the return address in order to retrieve parameters in the code stream (a 6502 programming idiom documented in the ProDOS 8 Technical Reference Manual). It remains a characteristic of 6502 derivatives to this day.\n\nAcceleration\n\nAs the 6502 is externally clocked, upgrading the speed involves more than dropping a faster chip into the processor socket; many other components also need to be modified. To meet user demand, a number of companies sold hardware to speed up those systems. These \"accelerators\" included a modicum of high-speed RAM and glue circuitry used to synchronize the faster processor with the computer's original RAM and its peripherals. For example, the Apple II floppy disk relied on software accessing the controller's I/O registers with critical timing; Apple II accelerators were therefore designed to fall back to 1 MHz during disk access. The first accelerators were circuit boards; some later accelerators (such as the Zip Chip) miniaturized the processor and support circuits to fit into a DIP package that was plug compatible with the original processor.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "MOS Technology 6502" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20297" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The MOS Technology 6502 (typically \"sixty-five-oh-two\" or \"six-five-oh-two\") William Mensch and the moderator both pronounce the 6502 microprocessor as \"sixty-five-oh-two\". is an 8-bit microprocessor that was designed by a small team led by Chuck Peddle for MOS Technology. When it was introduced in 1975, the 6502 was, by a considerable margin, the least expensive microprocessor on the market. It initially sold for less than one-sixth the cost of competing designs from larger companies, such as Motorola and Intel, and caused rapid decreases in pricing across the entire processor market. Along with the Zilog Z80, it sparked a series of projects that resulted in the home computer revolution of the early 1980s.\n\nPopular home video game consoles and computers, such as the Atari 2600, Atari 8-bit family, Apple II, Nintendo Entertainment System, Commodore 64, and others, used the 6502 or variations of the basic design. Soon after the 6502's introduction, MOS Technology was purchased outright by Commodore International, who continued to sell the microprocessor and licenses to other manufacturers. In the early days of the 6502, it was second-sourced by Rockwell and Synertek, and later licensed to other companies. In its CMOS form, which was developed by the Western Design Center, the 6502 family continues to be widely used in embedded systems, with estimated production volumes in the hundreds of millions.\n\nHistory and use \n\nOrigins at Motorola \n\nThe 6502 was designed by many of the same engineers that had designed the Motorola 6800 microprocessor family. Motorola started the 6800 microprocessor project in 1971 with Tom Bennett as the main architect. The chip layout began in late 1972, the first 6800 chips were fabricated in February 1974 and the full family was officially released in November 1974.Motorola 6800 Oral History (2008), p. 9 John Buchanan was the designer of the 6800 chipBuchanan, John K., \"MOS DC Voltage booster circuit\", [http://www.google.com/patents?id\n2pk6AAAAEBAJ US Patent 3942047], issued March 2, 1976.Buchanan, John K., \"Chip topography for MOS integrated circuitry microprocessor chip\", [http://www.google.com/patents/about?id\n6OkAAAAAEBAJ US Patent 3987418], issued October 19, 1976. and Rod Orgill, who later did the 6501, assisted Buchanan with circuit analyses and chip layout.Motorola 6800 Oral History (2008), p. 8 Bill Mensch joined Motorola in June 1971 after graduating from the University of Arizona (at age 26).Mensch Oral History (1995) Mensch earned an Associate degree from Temple University in 1966 and then worked at Philco Ford as an electronics technician before attending the University of Arizona. His first assignment was helping define the peripheral ICs for the 6800 family and later he was the principal designer of the 6820 Peripheral Interface Adapter (PIA).Mensch, William D., \"Chip topography for MOS interface circuit\", [http://www.google.com/patents/about?id\nNTk4AAAAEBAJ US Patent 3968478], issued July 6, 1976. Motorola's engineers could run analog and digital simulations on an IBM 370-165 mainframe computer. All of the authors were with Motorola's Semiconductor Products Division. Bennett hired Chuck Peddle in 1973 to do architectural support work on the 6800 family products already in progress. Page 30. Bennett already was at work on what became the 6800. \"He hired me,\" Peddle says of Bennett, \"to do the architectural support work for the product he'd already started.\" … Peddle says. \"Motorola tried to kill it several times. Without Bennett, the 6800 would not have happened, and a lot of the industry would not have happened, either.\" He contributed in many areas, including the design of the 6850 ACIA (serial interface).Hepworth, Edward C., Rodney J. Means, Charles I. Peddle, \"Asynchronous Communication Interface Adaptor\", [http://www.google.com/patents/about?id\nvzAvAAAAEBAJ Patent 3975712], issued August 17, 1976. Note: Motorola typically listed inventors in alphabetical order.\n\nMotorola's target customers were established electronics companies such as Hewlett-Packard, Tektronix, TRW and Chrysler. Advertisement showing three embedded applications from TRW, HP and RUSCO. In May 1972, Motorola's engineers began visiting select customers and sharing the details of their proposed 8-bit microprocessor system with ROM, RAM, parallel and serial interfaces.Motorola 6800 Oral History (2008), p. 89 In early 1974, they provided engineering samples of the chips so that customers could prototype their designs. Motorola's \"total product family\" strategy did not focus on the price of the microprocessor, but on reducing the customer's total design cost. They offered development software on a timeshare computer, the \"EXORciser\" system debugging system, onsite training and field application engineer support. Motorola advertisement emphasizing their complete set of peripheral chips and development tools. This shorten the customers product design cycle.Motorola 6800 Oral History (2008) p. 18 Both Intel and Motorola had initially announced a $360 price for a single microprocessor. MC6800 microprocessor price was $360. The MC6850 asynchronous communications interface adaptor (ACIA) was slated for first quarter 1975 introduction. \"Shima implemented the 8080 in about a year and the new device was introduced in April 1974 for $360.\" (The IBM System/360 mainframe was a well known computer at the time.) The actual price for production quantities was much less. Motorola offered a design kit containing the 6800 with six support chips for $300. \"Distributors are being stocked with the M6800 family, and the division is also offering an introductory kit that includes the family's six initial parts, plus applications and programming manuals, for $300.\"\n\nPeddle, who would accompany the sales people on customer visits, found that customers were put off by the high cost of the microprocessor chips. To lower the price, the IC chip size would have to shrink so that more chips could be produced on each silicon wafer. This could be done by removing inessential features in the 6800 and using a newer fabrication technology, \"depletion-mode\" MOS transistors. Peddle and other team members started outlining the design of an improved feature, reduced size microprocessor. At that time, Motorola's new semiconductor fabrication facility in Austin, Texas was having difficulty producing MOS chips and mid 1974 was the beginning of a year-long recession in the semiconductor industry. Also, many of the Mesa, Arizona employees were displeased with the upcoming relocation to Austin.Bagnall (2010), p. 11. Peddle's new offer came at an opportune time for the 6800 developers. \"They didn't want to go to Austin, Texas,\" explains Mensch. Motorola Semiconductor Products Division's management was overwhelmed with problems and showed no interest in Peddle's low-cost microprocessor proposal. Chuck Peddle was frustrated with Motorola's management for missing this new opportunity. In a November 1975 interview, Motorola's Chairman, Robert Galvin, agreed. He said, \"We did not choose the right leaders in the Semiconductor Products division.\" The division was reorganized and the management replaced. New group vice-president John Welty said, \"The semiconductor sales organization lost its sensitivity to customer needs and couldn't make speedy decisions.\" Summary: Semiconductor Products split into two parts, integrated circuits and discrete components. Semiconductor losses for the last four quarters exceeded $30 million. The sales organization lost its sensitivity to customer needs, \"delays in responding to price cuts meant that customers bought elsewhere.\" Technical problems plagued IC production. The troubles are \"not in design, but in chip and die yields.\" Problems have been solved. The MC6800 microprocessor \"arrived in November 1974.\"\n\nPeddle began looking for a source of funding for this new project and found a small semiconductor company in Pennsylvania. In August 1974, Chuck Peddle, Bill Mensch, Rod Orgill, Harry Bawcum, Ray Hirt, Terry Holdt and Wil Mathys left Motorola to join MOS Technology. (Mike James joined later.) Of the seventeen chip designers and layout people on the 6800 team, seven left. There were 30 to 40 other marketers, application engineers and system engineers on the 6800 team.Motorola 6800 Oral History (2008), p. 13 That December, Gary Daniels transferred into the 6800 microprocessor group. Tom Bennett did not want to leave the Phoenix area so Daniels took over the microprocessor development in Austin. His first project was a \"depletion-mode\" version of the 6800; this cut the chip area nearly in half and doubled the speed. The faster parts were available in July 1976. This was followed by the 6802 which added 128 bytes of RAM and an on-chip clock oscillator circuit. Daniels, \"My first assignment was to lead a small team to redesign the 6800 MPU to make it more manufacturable and so that higher speed versions could be selected.\" \n\nMoving to MOS Technology \n\nMOS Technology was formed in 1969 by three executives from General Instrument, Mort Jaffe, Don McLaughlin, and John Pavinen, to produce metal-oxide-semiconductor (MOS) integrated circuits. Allen-Bradley, a supplier of electronic components and industrial controls, acquired a majority interest in 1970.Bagnall (2010), p. 13. The company designed and fabricated custom ICs for customers and had developed a line of calculator chips.\n\nOn August 19, 1974, the former Motorola employees moved into MOS Technology's headquarters at Valley Forge, Pennsylvania. The goal was to design and produce a low cost microprocessor for embedded applications and to target as wide as possible a customer base. This would be possible only if the microprocessor was low cost—and in the semiconductor business, chip size determined cost. The size goal required n-channel \"depletion-mode\" MOS transistors, a more advanced process than MOS Technology's calculator chips used. John Pavinen was able to have the fabrication process ready by June 1975.Bagnall (2010), p. 19 \"Paivinen promised Peddle he would have the n-channel process ready. He was true to his word.\" Chuck Peddle, Rod Orgill, and Wil Mathys designed the initial architecture of the new processors. There would be two microprocessors: the 6501 would plug into the same socket as the Motorola 6800, while the 6502 would work with 6800 family peripherals and have an on-chip clock oscillator. These processors would not run 6800 software because they had a different instruction set, different registers, and mostly different addressing modes.Stanford University, Silicon Genesis project: videotaped oral history interview of Willam Mensch A September 1975 article in EDN magazine gives this summary of the design:\n\nThe MOS Technology 650X family represents a conscious attempt of eight former Motorola employees who worked on the development of the 6800 system to put out a part that would replace and outperform the 6800, yet undersell it. With the benefit of hindsight gained on the 6800 project, the MOS Technology team headed by Chuck Peddle, made the following architectural changes in the Motorola CPU…\"\n\nThe second \"B\" accumulator was omitted. The 16-bit 6800 index register with an 8-bit offset in the instruction was replaced with two 8-bit index registers with an 8-bit or 16-bit offset. Three-state control was eliminated from the address bus outputs. A clock generator was included on the chip. The address bus was always active so the VMA (valid-memory address) output was eliminated. An \"8080-type\" RDY signal for single-cycle stepping was added.\n\nThe chip high level design had to be turned into drawings of transistors and interconnects. At MOS Technology, the \"layout\" was a very manual process done with color pencils and vellum paper. The layout consisted of thousands of polygon shapes on six different drawings; one for each layer of the semiconductor fabrication process. Rod Orgill was responsible for the 6501 design; he had assisted John Buchanan at Motorola on the 6800. Bill Mensch did the 6502; he was the designer of the 6820 Peripheral Interface Adapter (PIA) at Motorola. Harry Bawcom, Mike James and Sydney-Anne Holt helped with the layout.\n\nThe size goal for the 6502 chip was 153 x 168 mils (3.9 x 4.3 mm) or an area of 16.6 mm2. At that time the technical literature would state the length and width of each chip in \"mils\" (0.001 inch). A smaller chip area means more chips per silicon wafer and greater yield as defects are generally randomly but uniformly scattered across the wafer area. So the more chips per wafer, the smaller the ratio of defective chips to total wafer chips. The original 6800 chips were intended to be 180 x 180 mils but layout was completed at 212 x 212 mils (5.4 x 5.4 mm) or an area of 29.0 mm2.Motorola 6800 Oral History (2008), p. 10. The first 6502 chips were 168 x 183 mils (4.3 x 4.7 mm) or an area of 19.8 mm2. The Rotate Right instruction (ROR) did not work in the first silicon, so the instruction was temporarily omitted from the published documents, but the next iteration of the design shrank the chip and fixed the Rotate Right instruction, which was then included in revised documentation.The August 1975 datasheet had 55 instructions with no ROR, the May 1976 datasheet had the ROR and 56 instructions. :File:MCS650x Instruction Set.jpg\n\nIntroducing the 6501 and 6502\n\nMOS Technology's microprocessor introduction was quite different from the traditional months-long product launch. The first run of a new integrated circuit is normally used for internal testing and shared with select customers as \"engineering samples\". These chips often have a minor design defect or two that will be corrected before production begins. Chuck Peddle's goal was to sell the first run 6501 and 6502 chips to the attendees at the Wescon trade show in San Francisco beginning on September 16, 1975. Peddle was a very effective spokesman and the MOS Technology microprocessors were extensively covered in the trade press. One of the earliest was a full-page story on the MCS6501 and MCS6502 microprocessors in the July 24, 1975 issue of Electronics magazine. The article covers the 6501 and 6502 plus the 28 pin versions that would only address 4K of memory. It also covered future devices such as \"a design that Peddle calls a pseudo 16\". Stories also ran in EE Times (August 24, 1975), EDN (September 20, 1975), Electronic News (November 3, 1975), Byte (November 1975) Comparison of the 6502 and the 6800 microprocessors. Author visited MOS Technology in August 1975. and Microcomputer Digest (November 1975). Advertisements for the 6501 appeared in several publications the first week of August 1975. The 6501 would be for sale at Wescon for $20 each. In September 1975, the advertisements included both the 6501 and the 6502 microprocessors. The 6502 would cost only $25.\n\nWhen MOS Technology arrived at Wescon, they found that exhibitors could not sell anything on the show floor. They rented the MacArthur Suite at the St. Francis Hotel and directed customers there to purchase the processors. At the suite, the processors were stored in large jars to imply that the chips were in production and readily available. The customers did not know the bottom half of each jar contained non-functional chips.Bagnall (2010), pp. 33-35 The chips were $20 and $25 while the documentation package was an additional $10. Users were encouraged to make copies of the documents, an inexpensive way for MOS Technology to distribute product information. The processors were supposed to have 56 instructions, but the Rotate Right (ROR) instruction did not work correctly on these chips, so the preliminary data sheets listed just 55 instructions. The reviews in Byte and EDN noted the lack of the ROR instruction. The next revision of the layout fixed this problem and the May 1976 datasheet listed 56 instructions. Peddle wanted every interested engineer and hobbyist to have access to the chips and documentation; other semiconductor companies only wanted to deal with \"serious\" customers. For example, Signetics was introducing the 2650 microprocessor and its advertisements asked readers to write for information on their company letterhead.\n\nMotorola lawsuit \n\nThe 6501/6502 introduction in print and at Wescon was an enormous success. The downside was that the extensive press coverage got Motorola's attention. In October 1975, Motorola reduced the price of a single 6800 microprocessor from $175 to $69. The $300 system design kit was reduced to $150 and it now came with a printed circuit board. The quantity one price for the MC6800 was reduced from $175 to $69. The previous price for 50 to 99 units was $125. On November 3, 1975, Motorola sought an injunction in Federal Court to stop MOS Technology from making and selling microprocessor products. They also filed a lawsuit claiming patent infringement and misappropriation of trade secrets. Motorola claimed that seven former employees joined MOS Technology to create that company's microprocessor products.\"Motorola said last week it would seek an immediate injunction to stop MOS Technology Inc., Norristown, Pa., from making and selling microprocessor products, including its MCS6500.\" (This issue was published on November 7.)\n\nMotorola was a billion-dollar company with a plausible case and lawyers. On October 30, 1974, Motorola had filed numerous patent applications on the microprocessor family and was granted twenty-five patents. The first was in June 1976 and the second was to Bill Mensch on July 6, 1976 for the 6820 PIA chip layout. These patents covered the 6800 bus and how the peripheral chips interfaced with the microprocessor.Motorola was awarded the following US Patents on the 6800 microprocessor family: 3962682, 3968478, 3975712, 3979730, 3979732, 3987418, 4003028, 4004281, 4004283, 4006457, 4010448, 4016546, 4020472, 4030079, 4032896, 4037204, 4040035, 4069510, 4071887, 4086627, 4087855, 4090236, 4145751, 4218740, 4263650. Motorola began making transistors in 1950 and had a portfolio of semiconductor patents. Allen-Bradley decided not to fight this case and sold their interest in MOS Technology back to the founders. Four of the former Motorola engineers were named in the suit: Chuck Peddle, Will Mathys, Bill Mensch and Rod Orgill. All were named inventors in the 6800 patent applications. During the discovery process, Motorola found that one engineer, Mike James, had ignored Peddle's instructions and brought his 6800 design documents to MOS Technology.Bagnall (2010), p. 53–54. \"He [Mike James] had all his original work from the 6800 and hid it from Motorola… In March 1976, the now independent MOS Technology was running out of money and had to settle the case. They agreed to drop the 6501 processor, pay Motorola $200,000 and return the documents that Motorola contended were confidential. Both companies agreed to cross-license microprocessor patents. \"MOS Technology Inc. of Norristown, Pa. has agreed to withdraw its MCS6501 microprocessor from the market and to pay Motorola Inc. $200000 ...\" \"MOS Technology and eight former Motorola employees have given back, under court order documents that Motorola contends are confidential.\" \"…both companies have agreed to a cross license relating to patents in the microprocessor field.\" That May, Motorola dropped the price of a single 6800 microprocessor to $35. By November Commodore had acquired MOS Technology.Bagnall (2010), pp. 55-56\" Commodore International … is buying MOS Technology (Norristown, PA). This saves the six-year-old semiconductor house from impending disaster.\"\n\nComputers and games \n\nWith legal troubles behind them, MOS was still left with the problem of getting developers to try their processor, prompting Chuck Peddle to design the MDT-650 (\"microcomputer development terminal\") single-board computer. Another group inside the company designed the KIM-1, which was sold semi-complete and could be turned into a usable system with the addition of a 3rd party computer terminal and compact cassette drive. Much to their amazement, the KIM-1 sold well to hobbyists and tinkerers, as well as to the engineers to which it had been targeted. The related Rockwell AIM 65 control/training/development system also did well. The software in the AIM 65 was based on that in the MDT. Another roughly similar product was the Synertek SYM-1.\n\nOne of the first \"public\" uses for the design was the Apple I microcomputer, introduced in 1976. The 6502 was next used in the Commodore PET and the Apple II, both released in 1977. It was later used in the Atari 8-bit family and Acorn Atom home computers, the BBC Micro, Commodore VIC-20 and other designs both for home computers and business, such as Ohio Scientific and Oric. The 6510, a direct successor of the 6502 with a digital I/O port and a tri-state address bus, was the CPU utilized in the best-selling Commodore 64 home computer. Commodore's floppy disk drive, the 1541, had a processor of its own—it too was a 6502.\n\nAnother important use of the 6500 family was in video games. The first to make use of the processor design was the Atari VCS, later renamed the Atari 2600. The VCS used an offshoot of the 6502 called the 6507, which had fewer pins and, as a result, could address only 8 KB of memory. Millions of the Atari consoles would be sold, each with a MOS processor. Another significant use was by the Nintendo Entertainment System and Famicom. The 6502 used in the NES was a second source version by Ricoh, a partial system-on-a-chip, that lacked the binary-coded decimal mode but added 22 memory-mapped registers (and on-die hardware) for sound generation, joypad reading, and sprite list DMA. Called 2A03 in NTSC consoles and 2A07 in PAL consoles (the difference being the memory divider ratio and a lookup table for audio sample rates), this processor was produced exclusively for Nintendo.\n\nIn the 1980s, a popular electronics magazine Elektor/Elektuur used the processor in its microprocessor development board Junior Computer.\n\nFile:Apple iieb.jpg|Apple IIe\nFile:Commodore 2001 Series-IMG 0448b.jpg|Commodore PET\nFile:BBC Micro Front Restored.jpg|BBC Micro\nFile:Atari-2600-Console.jpg|Atari 2600\nFile:Atari-800-Computer-FL.jpg|Atari 800\nFile:Commodore-VIC-20-FL.jpg|Commodore VIC-20\nFile:C64c_system.jpg|Commodore 64\nFile:Nintendo-Famicom-Console-Set-FL.jpg|Family Computer\nFile:OSI Challenger 4P.jpg|Ohio Scientific Challenger 4P\nFile:Tamagotchi_0124_ubt.jpeg|Tamagotchi digital pethttps://www.kwartzlab.ca/2013/05/code-execution-tamagotchi/\n\nTechnical description\n\nThe 6502 is a little-endian 8-bit processor with a 16-bit address bus. The original versions were fabricated using an  process technology chip with an advertised die size of 153 x 168 mils (3.9 x 4.3 mm) or an area of 16.6 mm2.\n\nThe internal logic runs at the same speed as the external clock rate, but despite the slow clock speeds (typically in the neighborhood of 1 to 2 MHz), the 6502's performance was competitive with other contemporary CPUs using significantly faster clocks. This is partly due to a simplistic state machine implemented by combinatorial (clockless) logic to a greater extent than in many other designs; the two phase clock (supplying two synchronizations per cycle) can thereby control the whole machine-cycle directly. Typical instructions might take half as many cycles to complete on the 6502 than contemporary designs. Like most simple CPUs of the era, the dynamic NMOS 6502 chip is not sequenced by a microcode ROM but uses a PLA (which occupied about 15 percent of the chip area) for instruction decoding and sequencing. Like most eight-bit microprocessors, the chip does some limited overlapping of fetching and execution.\n\nThe low clock frequency moderated the speed requirement of memory and peripherals attached to the CPU, as only about 50 percent of the clock cycle was available for memory access (due to the asynchronous design, this percentage varied strongly among chip versions). This was critical at a time when affordable memory had access times in the range . The original NMOS 6502 was minimalistically engineered and efficiently manufactured and therefore cheap—an important factor in getting design wins in the very price-sensitive game console and home computer markets.\nLike its precursor, the Motorola 6800, the 6502 has very few registers. At the time the processor was designed, the number of transistors that could be economically put on a chip was very constrained (around a few thousand), so it made sense to rely on RAM instead of allocating expensive NMOS chip area for CPU registers. To this end, the CPU includes a 'zero-page' addressing mode that uses one address byte in the instruction instead of the two needed to address the full 64 KB of memory. This provides fast access to the first 256 bytes of RAM by using shorter instructions. Chuck Peddle has said in interviews that the specific intention was to allow these first 256 bytes of RAM to be used like registers.\n\nRegisters\n\nThe 6502's registers include one 8-bit accumulator register (A), two 8-bit index registers (X and Y), 7 processor status flag bits (P), an 8-bit stack pointer (S), and a 16-bit program counter (PC). The stack's address space is hardwired to memory page $01, i.e. the address range $0100–$01FF (256–511). Software access to the stack is done via four implied addressing mode instructions, whose functions are to push or pop (pull) the accumulator or the processor status register. The same stack is also used for subroutine calls via the JSR (Jump to Subroutine) and RTS (Return from Subroutine) instructions and for interrupt handling.\n\nAddressing\n\nThe chip uses the index and stack registers effectively with several addressing modes, including a fast \"direct page\" or \"zero page\" mode, similar to that found on the PDP-8, that accesses memory locations from addresses 0 to 255 with a single 8-bit address (saving the cycle normally required to fetch the high-order byte of the address)—code for the 6502 uses the zero page much as code for other processors would use registers. On some 6502-based microcomputers with an operating system, the OS uses most of zero page, leaving only a handful of locations for the user.\n\nAddressing modes also include implied (1 byte instructions); absolute (3 bytes); indexed absolute (3 bytes); indexed zero-page (2 bytes); relative (2 bytes); accumulator (1); indirect,x and indirect,y (2); and immediate (2). Absolute mode is a general-purpose mode. Branch instructions use a signed 8-bit offset relative to the instruction after the branch; the numerical range -128..127 therefore translates to 128 bytes backward and 127 bytes forward from the instruction following the branch (which is 126 bytes backward and 129 bytes forward from the start of the branch instruction). Accumulator mode uses the accumulator as an effective address, and does not need any operand data. Immediate mode uses an 8-bit literal operand.\n\nIndirect addressing\n\nThe indirect modes are useful for array processing and other looping. With the 5/6 cycle \"(indirect),y\" mode, the 8-bit Y register is added to a 16-bit base address read from zero page which is located by a single byte following the opcode. The Y register is therefore an index-register in the sense that it is used to hold an actual index (as opposed to the X register in the 6800 where a base address was directly stored and to which an immediate offset could be added). Incrementing the index register to walk the array byte-wise takes only two additional cycles. With the less frequently used \"(indirect,x)\" mode the effective address for the operation is found at the zero page address formed by adding the second byte of the instruction to the contents of the X register. Using the indexed modes, the zero page effectively acts as a set of up to 128 additional (though very slow) address registers.\n\nThe 6502 is capable of performing addition and subtraction in binary or binary coded decimal. Placing the CPU into BCD mode with the SED (set D flag) instruction results in decimal arithmetic, in which $99 + $01 would result in $00 and the carry (C) flag being set. In binary mode (CLD, clear D flag), the same operation would result in $9A and the carry flag being cleared. Other than Atari BASIC, BCD mode was seldom used in home computer applications.\n\nSee the Hello world! article for a simple but characteristic example of 6502 assembly language.\n\nDetailed behavior\n\nThe processor's non-maskable interrupt (NMI) input is edge sensitive, which means that the interrupt is triggered by the falling edge of the signal rather than its level. The implication of this feature is that a wired-OR interrupt circuit is not readily supported. However, this also prevents nested NMI interrupts from occurring until the hardware makes the NMI input inactive again, often under control of the NMI interrupt handler.\n\nThe simultaneous assertion of the NMI and IRQ (maskable) hardware interrupt lines causes IRQ to be ignored. However, if the IRQ line remains asserted after the servicing of the NMI, the processor will immediately respond to IRQ, as IRQ is level sensitive. Thus a sort of built-in interrupt priority was established in the 6502 design.\n\nThe \"Break\" flag of the processor is very different from the other flag bits. It has no flag setting, resetting, or testing instructions of its own, and is not affected by the PHP and PLP instructions. It exists only on the stack, where BRK and PHP always write a 1, while IRQ and NMI always write a 0.\n\nThe \"SO\" input pin, when asserted, will set the processor's overflow status bit (deasserting it does not clear the overflow bit, however). This can be used by a high-speed polling device driver, which can poll the hardware once in only three cycles by using a Branch-on-oVerflow-Clear (BVC) instruction that branches to itself. For example, the Commodore 1541 and other Commodore floppy disk drives use this technique to detect without delay whether the serializer is ready to accept or provide another byte of disk data. Obviously great care must be used in the device driver and the associated system design, as spurious assertion of the overflow bit could ruin arithmetic processing.\n\nAssembly language instructions\n\nA 6502 assembly language statement consists of a three-character instruction mnemonic, followed by an operand in the case of an instruction that takes an operand.  When assembled, the resulting machine code consists of a one-byte operation code (opcode), followed by a one- or two-byte operand, if the instruction was assembled with an operand, hence 6502 machine instructions vary in length from one to three bytes.[http://e-tradition.net/bytes/6502/6502_instruction_set.html 6502 Instruction Set].[http://www.6502.org/tutorials/6502opcodes.html NMOS 6502 Opcodes]. The operand is stored in the 6502's customary little-endian format. The 65C816, the 16-bit CMOS version of the 6502, also supports 24-bit addressing, which results in instructions being assembled with three-byte operands, also arranged in little-endian format.\n\nVariations and derivatives \n\nThere were several variants of the NMOS 6502:\n\n* The MOS Technology 6503 had reduced memory addressing capability (4 KB) and no RDY input, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).1982 MOS Technology Data Catalog (pdf obtained from bitsavers.org)\n* The MOS Technology 6504 had reduced memory addressing capability (8 KB), no NMI, and no RDY input, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6505 had reduced memory addressing capability (4 KB) and no NMI, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6506 had reduced memory addressing capability (4 KB), no NMI, and no RDY input, but all 3 clock pins of the 6502 (i.e. a 2-phase output clock), in a 28-pin DIP package (with the SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6507 had reduced memory addressing capability (8 KB) and no interrupts, in a 28-pin DIP package (with the phase 1 (OUT), SYNC, redundant Vss, and S.O. pins of the 6502 also omitted).\n* The MOS Technology 6508 has a built-in 8-bit input/output port and 256 bytes of internal static RAM.\n* The MOS Technology 6509 could address up to 1 MB of RAM as 16 banks of 64 kB and was used in the Commodore CBM-II series.\n* The MOS Technology 6510 has a built-in 6-bit programmable input/output port and was used in the Commodore 64.\n* The MOS Technology 6512 was a 6502 with a 2-phase clock input for an external clock oscillator, instead of an on-board clock oscillator.\n* The MOS Technology 6513 was a 6503 with a 2-phase clock input like the 6512.\n* The MOS Technology 6514 was a 6504 with a 2-phase clock input like the 6512.\n* The MOS Technology 6515 was a 6505 with a 2-phase clock input like the 6512.\n* The Ricoh 2A03 was a 6502 variant including an audio processing unit and lacking the BCD mode, used in the Nintendo Entertainment System.\n* The 6502B clocked at 1.79 MHz was used in early Atari 8-bit computers.\n* The 6502C (Sally) was a customized 6502 chip used in later Atari 8-bit computers. It has a HALT signal on pin 35 and a second R/W on pin 36 (these pin are N/C on a standard 6502).\n* The 65C02 is a CMOS version of the NMOS 6502 that was designed by Bill Mensch of the Western Design Center, featuring reduced power consumption, support for much higher clock speeds, new instructions, new addressing modes for some existing instructions, and correction of NMOS errata, such as the JMP ($xxFF) bug.\n* CSG 65CE02 was a CMOS derivative developed by the Commodore Semiconductor Group (CSG), formerly MOS Technology.\n* The Rockwell R65F11 (introduced in 1983) and the later R65F12 are enhanced versions of the 6502-based processor, also including on-chip zero-page RAM, on-chip Forth kernel ROM, a UART, etc.\nRandy M. Dumse.\n\"The R65F11 and F68K Single-Chip Forth Computers\".\n[http://www.forth.org/bournemouth/jfar/vol2/no1/article1.pdf]\n[http://soton.mpeforth.com/flag/jfar/vol2/no1/article1.pdf]\n1984.\n\nEd Schmauch.\n[http://www.forth.org/bournemouth/jfar/vol4/no2/article48.pdf \"A Computerized Corrosion Monitoring System\"].\n1986.\n\nLawrence P. Forsley.\n[https://books.google.com/books?id=Yx8YAQAAMAAJ \"Embedded systems: 1990 Rochester Forth Conference : June 12 - 16th, 1990 University of Rochester\"].\np. 51.\n\nRockwell.\n[http://www.smallestplcoftheworld.org/RSC-FORTH_User's_Manual.pdf \"RSC-Forth User's Manual\"].\n1983.\n\n* The GTE G65SC102 is software compatible with the 65C02, but has a slightly different pinout and oscillator circuit. The BBC Master Turbo included the 4 MHz version of this CPU on a coprocessor card, which could also be bought separately and added to the Master 128.\n* The Rockwell R65C00, R65C21, and R65C29 featured two enhanced CMOS 6502s in a single chip, and the R65C00 and R65C21 additionally contained 2 kB of mask-programmable ROM.https://archive.org/stream/bitsavers_rockwelldaDataBook_80778847/1985_Rockwell_Data_Book_djvu.txt\n\n6512, 6513, 6514, & 6515 \n\nThe MOS Technology 6512, 6513, 6514, and 6515 each rely on an external clock, instead of using an internal clock generator like the 650x (e.g. 6502). This was used to advantage in some designs where the clocks could be run asymmetrically, increasing overall CPU performance.\n\nThe 6512 was used in the BBC Micro B+64.\n\n16-bit derivatives \n\nThe Western Design Center designed and currently produces the W65C816S processor, a 16-bit, static-core successor to the 65C02, with greatly enhanced features. The W65C816S is a newer variant of the 65C816, which was the core of the Apple IIGS computer and was the basis of the Ricoh 5A22 processor that powered the popular Super Nintendo Entertainment System. The W65C816S incorporates minor improvements over the 65C816\nthat make the newer chip not an exact hardware-compatible replacement for the earlier one.  Currently available through electronics distributors as of November 2017, the W65C816S costs about US $8 (down to under US $6 in bulk) and is rated for 14 MHz operation.\n\nThe Western Design Center also designed and produced the 65C802, which was a 65C816 core with a 64 KB address space in a 65(C)02 pin-compatible package. The 65C802 could be retrofitted to a 6502 board and would function as a 65C02 on power-up, operating in \"emulation mode.\" As with the 65C816, a two-instruction sequence would switch the 65C802 to \"native mode\" operation, exposing its 16 bit accumulator and index registers, as well as other 65C816 enhanced features. The 65C802 was not widely used: new designs almost always were built around the 65C816, resulting in 65C802 production being discontinued. \n\n32-bit derivatives \n\nThe 65GZ032 designed by Gideon Zweijtzer is a VHDL source core that is 6502 compatible and extends the 8-bit CPU to a 32-bit design. It features pipelined RISC, new opcodes, access to  of linear memory, paged memory and a clock speed of \n\nExample code \n\nThe following 6502 assembly language source code is for a subroutine named TOLOWER, which copies a null-terminated character string from one location to another, converting upper case letter characters to lower case letters. The string being copied is the \"source\" and the string into which the converted source is stored is the \"destination.\"\n\nBugs and quirks\n\n*The earliest revisions of the 6502, such as those shipped with some KIM-1 computers, had a severe bug in the ROR (rotate right memory or accumulator) instruction. The operation of ROR in these chips is effectively an ASL instruction that does not affect the carry bit in the status register. MOS left the instruction out of chip documentation entirely because of the defect, promising that ROR would appear on 6502 chips starting in 1976. The vast majority of 6502 chips in existence today do not exhibit this bug.\n*The NMOS 6502 family has a variety of undocumented instructions, which vary from one chip manufacturer to the next. The 6502's instruction decoding is implemented in a hardwired logic array (similar to a programmable logic array) that is only defined for 151 of the 256 available opcodes. The remaining 105 trigger strange and occasionally hard-to-predict actions, such as crashing the processor, performing two valid instructions consecutively, performing strange mixtures of two instructions, or simply doing nothing at all. Eastern House Software developed the \"Trap65\", a device that plugged between the processor and its socket to convert (trap) unimplemented opcodes into BRK (software interrupt) instructions. Some programmers utilized this feature to extend the 6502's instruction set by providing functionality for the unimplemented opcodes with specially written software intercepted at the BRK instruction's 0xFFFE vector. All of the undefined opcodes have been replaced by NOP instructions in the 65C02, an enhanced CMOS version of the 6502, although with varying byte sizes and execution times. In the 65C802/65C816, all 256 opcodes perform defined operations.\n*The 6502's memory indirect jump instruction, JMP (), is partially broken. If  is hex xxFF (i.e., any word ending in FF), the processor will not jump to the address stored in xxFF and xxFF+1 as expected, but rather the one defined by xxFF and xx00 (for example, JMP ($10FF) would jump to the address stored in 10FF and 1000, instead of the one stored in 10FF and 1100). This defect continued through the entire NMOS line, but was corrected in the CMOS derivatives.\n*The NMOS 6502's indexed addressing across page boundaries will do an extra read of an invalid address. This characteristic may cause random issues by accessing hardware that acts on a read, such as clearing timer or IRQ flags, sending an I/O handshake, etc. This defect continued through the entire NMOS line, but was corrected in the CMOS derivatives, in which the processor does an extra read of the last instruction byte.\n*The 6502's read-modify-write instructions perform one read and two write cycles. First the unmodified data that was read is written back, and then the modified data is written. This characteristic may cause issues by twice accessing hardware that acts on a write. This anomaly continued through the entire NMOS line, but was fixed in the CMOS derivatives, in which the processor will do two reads and one write cycle. Good programming practice will generally avoid this problem by not executing read/modify/write instructions on hardware registers.\n*The N (result negative), V (sign bit overflow) and Z (result zero) status flags are generally meaningless when performing arithmetic operations while the processor is in BCD mode, as these flags reflect the binary, not BCD, result. This limitation was removed in the CMOS derivatives. Therefore, this feature may be used to distinguish a CMOS processor from an NMOS version.\n*If the processor happens to be in BCD mode when a hardware interrupt occurs it will not revert to binary mode. This characteristic could result in obscure bugs in the interrupt service routine if it fails to clear BCD mode before performing any arithmetic operations. For example, the Commodore 64's KERNAL did not correctly handle this processor characteristic, requiring that IRQs be disabled or re-vectored during BCD math operations. This issue was addressed in the CMOS derivatives as well.\n*The 6502 instruction set includes BRK (opcode $00), which is technically a software interrupt (similar in spirit to the SWI mnemonic of the 6800 and ARM processors). BRK is most often used to interrupt program execution and start a machine language monitor for testing and debugging during software development. BRK could also be used to route program execution using a simple jump table (analogous to the manner in which the 8086 and derivatives handle software interrupts by number). Unfortunately, if a hardware interrupt occurs at the same time the processor is fetching a BRK instruction, the NMOS version of the processor will fail to execute BRK and instead proceed as if only a hardware interrupt had occurred. This fault was corrected in the CMOS implementation of the processor.\n*When executing JSR (jump to subroutine) and RTS (return from subroutine) instructions, the return address pushed to the stack by JSR is that of the last byte of the JSR operand (that is, the most significant byte of the subroutine address), rather than the address of the following instruction. This is because the actual copy (from program counter to stack and then vice versa) takes place before the automatic increment of the program counter that occurs at the end of every instruction. This characteristic would go unnoticed unless the code examined the return address in order to retrieve parameters in the code stream (a 6502 programming idiom documented in the ProDOS 8 Technical Reference Manual). It remains a characteristic of 6502 derivatives to this day.\n\nAcceleration\n\nAs the 6502 is externally clocked, upgrading the speed involves more than dropping a faster chip into the processor socket; many other components also need to be modified. To meet user demand, a number of companies sold hardware to speed up those systems. These \"accelerators\" included a modicum of high-speed RAM and glue circuitry used to synchronize the faster processor with the computer's original RAM and its peripherals. For example, the Apple II floppy disk relied on software accessing the controller's I/O registers with critical timing; Apple II accelerators were therefore designed to fall back to 1 MHz during disk access. The first accelerators were circuit boards; some later accelerators (such as the Zip Chip) miniaturized the processor and support circuits to fit into a DIP package that was plug compatible with the original processor. MOS Technology 6502. http://en.wikipedia.org/?curid=20297."
  }
}
