{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14700",
  "eid" : "172ad720-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778548114,
  "textBody" : "This article is about the demographic features of the population of Italy, including population density, ethnicity, education level, health of the populace, economic status, religious affiliations and other aspects of the population.\n\nItaly has 60,656,000 inhabitants according to the calculations current as of January 1, 2017 [http://www.istat.it/en/archive/180497] Its population density, at 201 PD/km2, is higher than that of most Western European countries. However the distribution of the population is widely uneven. The most densely populated areas are the Po Valley (that accounts for almost half of the national population) and the metropolitan areas of Rome and Naples, while vast regions such as the Alps and Apennines highlands, the plateaus of Basilicata and the island of Sardinia are very sparsely populated.\n\nThe population of Italy almost doubled during the twentieth century, but the pattern of growth was extremely uneven due to large-scale internal migration from the rural South to the industrial cities of the North, a phenomenon which happened as a consequence of the Italian economic miracle of the 1950-60s. In addition, after centuries of net emigration, from the 1980s Italy has experienced large-scale immigration for the first time in modern history. According to the Italian government, there were an estimated 5,000,073 foreign nationals resident in Italy.[http://www.istat.it/it/archivio/149003].\n\nHigh fertility and birth rates persisted until the 1970s, after which they started to dramatically decline, leading to rapid population aging. At the end of the first decade of the 21st century, one in five Italians was over 65 years old. However, as a result of the massive immigration of the last two decades, Italy has, in recent years, experienced a significant growth in birth rates. The total fertility rate has also climbed from an all-time low of 1.18 children per woman in 1995 to 1.41 in 2008.\n\nSince the 1984 Lateran Treaty agreement, Italy has no official religion. However, it recognizes the role the Catholic Church plays in Italian society. 87.8% of the population identify as Catholic, 5.8% as non-believers or atheists, 2.6% as Muslims, and 3.8% adhere to other religions.\n\nUrbanization\n\nAbout 68% of Italian population is classified as urban, a relatively low figure among developed countries. During the last two decades, Italy underwent a devolution process, that eventually led to the creation of administrative metropolitan areas, in order to give major cities and their metropolitan areas a provincial status (somehow similar to PRC's direct-controlled municipality).\n \nAccording to OECD, the largest conurbations are:\n* Milan – 7.4 million\n* Rome – 3.7 million\n* Naples – 3.1 million\n* Turin – 2.2 million\n\nEthnic groups\n\nItaly used to be a country of mass emigration from the late 19th century until the 1970s. Between 1898 and 1914, the peak years of Italian diaspora, approximately 750,000 Italians emigrated each year. Italian communities once thrived in the former African colonies of Eritrea (nearly 100,000 at the beginning of World War II), Somalia and Libya (150,000 Italians settled in Libya, constituting about 18% of the total population).[http://www.britannica.com/EBchecked/topic/339574/Libya/46562/Italian-colonization Libya – Italian colonization]. Britannica Online Encyclopedia. All of Libya's Italians were expelled from the North African country in 1970.[http://news.bbc.co.uk/2/hi/africa/4380360.stm Libya cuts ties to mark Italy era.]. BBC News. 27 October 2005. In addition, after the annexation of Istria in 1945, up to 350,000 ethnic Italians left Titoist Yugoslavia.[https://www.nytimes.com/1987/06/06/world/election-opens-old-wounds-in-trieste.html Election Opens Old Wounds In Trieste]. The New York Times. 6 June 1987. Today, large numbers of people with full or significant Italian ancestry are found in\nBrazil (25 million),[http://www.consultanazionaleemigrazione.it/itestero/Gli_italiani_in_Brasile.pdf Consulta Nazionale Emigrazione. Progetto ITENETs – “Gli italiani in Brasile”; pp. 11, 19]  . Retrieved 10 September 2008. Argentina (20 million), US (17.8 million), France (5 million),\"[https://books.google.com/books?idBLo2RqGdv_wC&pg\nPA143&dq&hlen#v\nonepage&q&f\nfalse The Cambridge survey of world migration]\". Robin Cohen (1995). Cambridge University Press. p. 143.  Venezuela (2 million),http://www.correodelorinoco.gob.ve/tema-dia/embajador-italia-caracas-asegura-que-sistema-electoral-venezolano-es-confiable/ \"...el diplomático calcula que 5% o 6% de la población venezolana actual tiene origen italiano.\"Santander Laya-Garrido, Alfonso. Los Italianos forjadores de la nacionalidad y del desarrollo economico en Venezuela. Editorial Vadell. Valencia, 1978 Uruguay (1.5 million), Canada (1.4 million),  and Australia (800,000).\n\nAs a result of the profound economic and social changes induced by postwar industrialization, including low birth rates, an aging population and thus a shrinking workforce, during the 1980s Italy became to attract rising flows of foreign immigrants. The present-day figure of about 5 million foreign residents, that make up some 9% of the total population, include 97,000 children born in Italy to foreign nationals (19% of total births in Italy) in 2014, but exclude foreign nationals who have subsequently acquired Italian nationality; this applied to 106,000 people in 2014. The official figures also exclude illegal immigrants, the so-called clandestini, whose numbers are very difficult to determine. In May 2008 The Boston Globe quoted an estimate of 670,000 for this group.Elisabeth Rosenthal, \"[http://www.boston.com/news/world/europe/articles/2008/05/16/italy_cracks_down_on_illegal_immigration/ Italy cracks down on illegal immigration]\". The Boston Globe. 16 May 2008. Since the fall of the Berlin Wall in 1989, and more recently, the 2004 and 2007 enlargements of the European Union, the main waves of migration came from the former socialist countries of Eastern Europe (especially Romania, Albania, Ukraine and Poland). The second most important area of immigration to Italy has always been the neighbouring North Africa (in particular, Morocco, Egypt and Tunisia), with soaring arrivals as a consequence of the Arab Spring. Furthermore, in recent years, growing migration fluxes from the Far East (notably, China\"[http://news.bbc.co.uk/2/hi/europe/6550725.stm Milan police in Chinatown clash]\". BBC News. 13 April 2007. and the Philippines) and Latin America (Ecuador, Peru) have been recorded. Currently, circa one million Romanians (around one tenth of them being Roma\"[http://www.ipsnews.net/news.asp?idnews=42404 EUROPE:  Home to Roma, And No Place for Them] \". IPS ipsnews.net.) are officially registered as living in Italy, representing thus the most important individual country of origin, followed by Albanians and Moroccans with about 500,000 people each. The number of unregistered Romanians is difficult to estimate, but the Balkan Investigative Reporting Network suggested that in 2007 that there might have been half a million or more. Overall, at the end of the 2000s the foreign born population of Italy was from: Europe (54%), Africa (22%), Asia (16%), the Americas (8%) and Oceania (0.06%). The distribution of immigrants is largely uneven in Italy: 84.9% of immigrants live in the northern and central parts of the country (the most economically developed areas), while only 15.1% live in the southern half of the peninsula.\n\nLanguages \n\nItaly's official language is Italian. Ethnologue has estimated that there are about 55 million speakers of the language in Italy and a further 6.7 million outside of the country.[http://www.ethnologue.com/show_language.asp?code\nita Ethnologue report for language code:ita (Italy)] - Gordon, Raymond G., Jr. (ed.), 2005. Ethnologue: Languages of the World, Fifteenth edition. Dallas, Tex.: SIL International. Online version However, between 120 and 150 million people use Italian as a second or cultural language, worldwide.[http://www.servinghistory.com/topics/Italian_language::sub::Geographic_Distribution Italian Language: Geographic Distribution] Discovery Media'.' Retrieved 2010-05-16.\n\nItalian, adopted by the state after the unification of Italy, is based on the Florentine variety of Tuscan and is somewhat intermediate between the Italo-Dalmatian languages and the Gallo-Romance languages. Its development was also influenced by the Germanic languages of the post-Roman invaders.\n\nItaly has numerous dialects spoken all over the country. However, the establishment of a national education system has led to decrease in variation in the languages spoken across the country. Standardisation was further expanded in the 1950s and 1960s thanks to economic growth and the rise of mass media and television (the state broadcaster RAI helped set a standard Italian).\n\nSeveral minority and regional languages are legally recognized and protected,[L.cost. 26 febbraio 1948, n. 4, Statuto speciale per la Valle d'Aosta; L.cost. 26 febbraio 1948, n. 5, Statuto speciale per il Trentino-Alto Adige; L.cost. 31 gennaio 1963, n. 1, Statuto speciale della Regione Friuli Venezia Giulia] and they have co-official status alongside Italian in various parts of the country. French is co-official in the Valle d’Aosta—although in fact Franco-Provencal is more commonly spoken there. German has the same status in the province of South Tyrol as, in some parts of that province and in parts of the neighbouring Trentino, does Ladin. Slovene and Friulian are officially recognised in the provinces of Trieste, Gorizia and Udine in Venezia Giulia. Sardinian language was recognized as co-official in Sardinia.\n\nIn these regions official documents are bilingual (trilingual in Ladin communities), or available upon request in either Italian or the co-official language. Traffic signs are also multilingual, except in the Valle d’Aosta where—with the exception of Aosta itself which has retained its Latin form in Italian as in English—French toponyms are generally used, attempts to Italianise them during the Fascist period having been abandoned. Education is possible in minority languages where such schools are operating.\n\nUNESCO and other authories recognize many other endangered languages, which are not protected by Italian government: Piedmontese, Venetian, Ligurian, Lombard, Emilian-Romagnolo, Neapolitan and Sicilian.\n\nHistorical data\n\nVital statistics since 1900B.R. Mitchell. European historical statistics, 1750-1975.http://unstats.un.org/unsd/demographic/products/dyb/dybsets/1948%20DYB.pdf United nations. Demographic Yearbook 1948 \n\nCurrent natural increase\n \n\n*Number of births from January–September 2016 =  351,074\n*Number of births from January–September 2017 =  339,282\n*Number of deaths from January–September 2016 =  455,989\n*Number of deaths from January–September 2017 =  489,095\n*Natural growth from January–September 2016 =  -104,915\n*Natural growth from January–September 2017 =  -149,813\n\nReligion \n\nRoman Catholicism is by far the largest religion in the country, although the Catholic Church is no longer officially the state religion. In 2006, 87.8% of Italy's population self-identified as Roman Catholic, although only about one-third of these described themselves as active members (36.8%).\n\nMost Italians believe in God, or a form of a spiritual life force. According to the most recent Eurobarometer Poll 2005:[http://ec.europa.eu/public_opinion/archives/ebs/ebs_225_report_en.pdf ReportDGResearchSocialValuesEN2.PDF]  74% of Italian citizens responded that 'they believe there is a God', 16% answered that 'they believe there is some sort of spirit or life force' and 6% answered that 'they do not believe there is any sort of spirit, God, or life force'. \nThere are no data collected through census.\n\nChristianity\n\nThe Italian Catholic Church is part of the global Roman Catholic Church, under the leadership of the Pope, curia in Rome, and the Conference of Italian Bishops. In addition to Italy, two other sovereign nations are included in Italian-based dioceses, San Marino and Vatican City. There are 225 dioceses in the Italian Catholic Church, see further in this article and in the article List of the Roman Catholic dioceses in Italy. Even though by law Vatican City is not part of Italy, it is in Rome, and along with Latin, Italian is the most spoken and second language of the Roman Curia.\n\nItaly has a rich Catholic culture, especially as numerous Catholic saints, martyrs and popes were Italian themselves. Roman Catholic art in Italy especially flourished during the Middle Ages, Renaissance and Baroque periods, with numerous Italian artists, such as Michelangelo, Leonardo da Vinci, Raphael, Caravaggio, Fra Angelico, Gian Lorenzo Bernini, Sandro Botticelli, Tintoretto, Titian, Raphael and Giotto. Roman Catholic architecture in Italy is equally as rich and impressive, with churches, basilicas and cathedrals such as St Peter's Basilica, Florence Cathedral and St Mark's Basilica. Roman Catholicism is the largest religion and denomination in Italy, with around 87.8% of Italians considering themselves Catholic. Italy is also home to the greatest number of cardinals in the world, and is the country with the greatest number of Roman Catholic churches per capita.\n\nEven though the main Christian denomination in Italy is Roman Catholicism, there are some minorities of Protestant, Waldensian, Eastern Orthodox and other Christian churches.\n\nIn the 20th century, Jehovah's Witnesses, Pentecostalism, non-denominational Evangelicalism, and Mormonism were the fastest-growing Protestant churches. Immigration from Western, Central, and Eastern Africa at the beginning of the 21st century has increased the size of Baptist, Anglican, Pentecostal and Evangelical communities in Italy, while immigration from Eastern Europe has produced large Eastern Orthodox communities.\n\nIn 2006, Protestants made up 2.1% of Italy's population, and members of Eastern Orthodox churches comprised 1.2% or more than 700,000 Eastern Orthodox Christians including 180,000 Greek Orthodox,[http://www.ortodossia.it/The%20Holy%20Orthodox%20Archdiocese%20of%20Italy%20ed%20Malta.htm The Holy Orthodox Archdiocese of Italy and Malta]  550,000 Pentecostals and Evangelists (0.8%), of whom 400,000 are members of the Assemblies of God, about 250,000 are Jehovah's Witnesses (0.4%), 30,000 Waldensians, [http://www.chiesavaldese.org/pages/storia/dove_viviamo.php Waldensian Evangelical Church]  25,000 Seventh-day Adventists, 22,000 Mormons, 15,000 Baptists (plus some 5,000 Free Baptists), 7,000 Lutherans, 4,000 Methodists (affiliated with the Waldensian Church).[http://www.oikoumene.org/en/member-churches/regions/europe/italy/evangelical-methodist-church-in-italy.html World Council of Churches] \n\nOther religions\n\nThe longest-established religious faith in Italy is Judaism, Jews having been present in Ancient Rome before the birth of Christ. Italy has seen many influential Italian-Jews, such as Luigi Luzzatti, who took office in 1910, Ernesto Nathan served as mayor of Rome from 1907 to 1913 and Shabbethai Donnolo (died 982). During the Holocaust, Italy took in many Jewish refugees from Nazi Germany. However, with the creation of the Nazi-backed puppet Italian Social Republic, about 15% of 48,000 Italian Jews were killed. This, together with the emigration that preceded and followed the Second World War, has left only a small community of around 45,000 Jews in Italy today.\n\nDue to immigration from around the world, there has been an increase in non-Christian religions. As of 2009, there were 1.0 million Muslims in Italy forming 1.6 percent of population; independent estimates put the Islamic population in Italy anywhere from 0.8 million to 1.5 million. Only 50,000 Italian Muslims hold Italian citizenship.\n\nThere are more than 200,000 followers of faith originating in the Indian subcontinent, including some 70,000 Sikhs with 22 gurdwaras across the country, 70,000 Hindus, and 50,000 Buddhists.[http://www.buddhismo.it/ente.htm Unione Buddhista Italiana - UBI: L'Ente]  There are an estimated some 4,900 Bahá'ís in Italy in 2005.\n\nDemographic statistics\n\nThe following demographic statistics are from Italy's Istituto Nazionale di Statistica  and Cia World Factbook.\n\nPopulation\n\n60,674,003  (Jan 2016 est.)\n\nAge structure\n\n0-14 years: 13.5% (men 4,056,156/women 3,814,070)\n15-64 years: 66.3% (men 19,530,696/women 18,981,084)\n65 years and over: 20.2% (men 4,903,762/women 6,840,444) (2010 est.)\n\nMedian age\n\nmen: 43.0 years\nwomen: 45.3 years (2013 est.)\n\ntotal: 44.2 years (2015 est.)\n\nPopulation growth rate\n\n0.03% (2016 est.)\n\nBirth rate\n\n8.94 births/1,000 population (2013 est.)\n\nDeath rate\n\n10.01 deaths/1,000 population (2013 est.)\n\nNet migration rate\n\n4.47 migrant(s)/1,000 population (2013 est.)\n\nUrbanization\n\nurban population: 68% of total population (2010)\nrate of urbanization: 0.5% annual rate of change (2010-15 est.)\n\nSex ratio\n\nat birth: 1.06 men(s)/women\nunder 15 years: 1.05 men(s)/women\n15-64 years: 1.02 men(s)/women\n65 years and over: 0.74 men(s)/women\ntotal population: 0.93 men(s)/women\n(2013 est.)\n\nMaternal mortality rate\n\n4.0 deaths/100,000 live births (2010)\n\nInfant mortality rate\n\ntotal:  3.33 deaths/1,000 live births\nmen:  3.54 deaths/1,000 live births\nwomen:  3.12 deaths/1,000 live births\n(2013 est.)\n\nLife expectancy at birth\n\ntotal population: 81.95 years \nmale: 79.32 years \nfemale: 84.73 years (2013)\n\nTotal fertility rate\n\n1.39 children born/woman (Italian citizens)\n1.91 children born/woman (Foreign citizens)\n1.39 children born/woman (total citizens) (2014)\n\nHealth expenditures\n\n9.5% of total GDP (2010)\n\nPhysicians density\n\n4.24 physicians/1,000 population (2008)\n\nHospital bed density\n\n3.6 beds/1,000 population (2009)\n\nHIV/AIDS\n\nAdult prevalence rate: 0.3% (2009 est.)\nPeople living with HIV/AIDS: 140,000 (2009 est.)\nDeaths: fewer than 1,000 (2009 est.)\n\nObesity – adult prevalence rate\n\n19.8% (2008)\n\nNationality\n\nnoun: Italian(s)\nadjective: Italian\n\nEthnic groups\n\nItalian: 92%, other European (mostly Romanian, Albanian, Ukrainian and others) 5%, North African (mostly Moroccan) 1.5%, others 2.5%.\n\nHistorically the ethnicity of the Italian people was mainly made of romanized autochthonous Italics and Gauls, with additions of Germanic populations (like Longobards) and -in very small amounts- of other bordering people (like Slovenes, Austrians, Albanians, etc..).\n\nReligions\n\nRoman Catholic: 90% (approximately; one half practicing), other Christians: 2%, Muslim: 2%, Atheist or Agnostic: 6%\n\nEducation expenditure\n\n4.7% of total GDP (2008)\n\nLiteracy\n\ndefinition: age 15 and over can read and write\ntotal population: 98.6%\nmale:\n(2003 est.)\n\nGenetics\n\nApproximately half of Italian males belong to the Y-DNA haplogroup R1b which is standard amongst most west European populations. According to data found through different sources, samples, and studies by Eurpedia,  the percentages of Y-dna haplogroups observed  were :\n\n*R1 (51.5% : 49% R1b and 2.5% R1a)\n*J (20% : 18% J2 and 2% J1)\n*E1b1b (11%)\n*G (7%)\n*I (6.5% : 2.5% I1, 3% I2 + I2a and 1% I2b)\n*T (4%)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Demographics of Italy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14700" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "This article is about the demographic features of the population of Italy, including population density, ethnicity, education level, health of the populace, economic status, religious affiliations and other aspects of the population.\n\nItaly has 60,656,000 inhabitants according to the calculations current as of January 1, 2017 [http://www.istat.it/en/archive/180497] Its population density, at 201 PD/km2, is higher than that of most Western European countries. However the distribution of the population is widely uneven. The most densely populated areas are the Po Valley (that accounts for almost half of the national population) and the metropolitan areas of Rome and Naples, while vast regions such as the Alps and Apennines highlands, the plateaus of Basilicata and the island of Sardinia are very sparsely populated.\n\nThe population of Italy almost doubled during the twentieth century, but the pattern of growth was extremely uneven due to large-scale internal migration from the rural South to the industrial cities of the North, a phenomenon which happened as a consequence of the Italian economic miracle of the 1950-60s. In addition, after centuries of net emigration, from the 1980s Italy has experienced large-scale immigration for the first time in modern history. According to the Italian government, there were an estimated 5,000,073 foreign nationals resident in Italy.[http://www.istat.it/it/archivio/149003].\n\nHigh fertility and birth rates persisted until the 1970s, after which they started to dramatically decline, leading to rapid population aging. At the end of the first decade of the 21st century, one in five Italians was over 65 years old. However, as a result of the massive immigration of the last two decades, Italy has, in recent years, experienced a significant growth in birth rates. The total fertility rate has also climbed from an all-time low of 1.18 children per woman in 1995 to 1.41 in 2008.\n\nSince the 1984 Lateran Treaty agreement, Italy has no official religion. However, it recognizes the role the Catholic Church plays in Italian society. 87.8% of the population identify as Catholic, 5.8% as non-believers or atheists, 2.6% as Muslims, and 3.8% adhere to other religions.\n\nUrbanization\n\nAbout 68% of Italian population is classified as urban, a relatively low figure among developed countries. During the last two decades, Italy underwent a devolution process, that eventually led to the creation of administrative metropolitan areas, in order to give major cities and their metropolitan areas a provincial status (somehow similar to PRC's direct-controlled municipality).\n \nAccording to OECD, the largest conurbations are:\n* Milan – 7.4 million\n* Rome – 3.7 million\n* Naples – 3.1 million\n* Turin – 2.2 million\n\nEthnic groups\n\nItaly used to be a country of mass emigration from the late 19th century until the 1970s. Between 1898 and 1914, the peak years of Italian diaspora, approximately 750,000 Italians emigrated each year. Italian communities once thrived in the former African colonies of Eritrea (nearly 100,000 at the beginning of World War II), Somalia and Libya (150,000 Italians settled in Libya, constituting about 18% of the total population).[http://www.britannica.com/EBchecked/topic/339574/Libya/46562/Italian-colonization Libya – Italian colonization]. Britannica Online Encyclopedia. All of Libya's Italians were expelled from the North African country in 1970.[http://news.bbc.co.uk/2/hi/africa/4380360.stm Libya cuts ties to mark Italy era.]. BBC News. 27 October 2005. In addition, after the annexation of Istria in 1945, up to 350,000 ethnic Italians left Titoist Yugoslavia.[https://www.nytimes.com/1987/06/06/world/election-opens-old-wounds-in-trieste.html Election Opens Old Wounds In Trieste]. The New York Times. 6 June 1987. Today, large numbers of people with full or significant Italian ancestry are found in\nBrazil (25 million),[http://www.consultanazionaleemigrazione.it/itestero/Gli_italiani_in_Brasile.pdf Consulta Nazionale Emigrazione. Progetto ITENETs – “Gli italiani in Brasile”; pp. 11, 19]  . Retrieved 10 September 2008. Argentina (20 million), US (17.8 million), France (5 million),\"[https://books.google.com/books?idBLo2RqGdv_wC&pg\nPA143&dq&hlen#v\nonepage&q&f\nfalse The Cambridge survey of world migration]\". Robin Cohen (1995). Cambridge University Press. p. 143.  Venezuela (2 million),http://www.correodelorinoco.gob.ve/tema-dia/embajador-italia-caracas-asegura-que-sistema-electoral-venezolano-es-confiable/ \"...el diplomático calcula que 5% o 6% de la población venezolana actual tiene origen italiano.\"Santander Laya-Garrido, Alfonso. Los Italianos forjadores de la nacionalidad y del desarrollo economico en Venezuela. Editorial Vadell. Valencia, 1978 Uruguay (1.5 million), Canada (1.4 million),  and Australia (800,000).\n\nAs a result of the profound economic and social changes induced by postwar industrialization, including low birth rates, an aging population and thus a shrinking workforce, during the 1980s Italy became to attract rising flows of foreign immigrants. The present-day figure of about 5 million foreign residents, that make up some 9% of the total population, include 97,000 children born in Italy to foreign nationals (19% of total births in Italy) in 2014, but exclude foreign nationals who have subsequently acquired Italian nationality; this applied to 106,000 people in 2014. The official figures also exclude illegal immigrants, the so-called clandestini, whose numbers are very difficult to determine. In May 2008 The Boston Globe quoted an estimate of 670,000 for this group.Elisabeth Rosenthal, \"[http://www.boston.com/news/world/europe/articles/2008/05/16/italy_cracks_down_on_illegal_immigration/ Italy cracks down on illegal immigration]\". The Boston Globe. 16 May 2008. Since the fall of the Berlin Wall in 1989, and more recently, the 2004 and 2007 enlargements of the European Union, the main waves of migration came from the former socialist countries of Eastern Europe (especially Romania, Albania, Ukraine and Poland). The second most important area of immigration to Italy has always been the neighbouring North Africa (in particular, Morocco, Egypt and Tunisia), with soaring arrivals as a consequence of the Arab Spring. Furthermore, in recent years, growing migration fluxes from the Far East (notably, China\"[http://news.bbc.co.uk/2/hi/europe/6550725.stm Milan police in Chinatown clash]\". BBC News. 13 April 2007. and the Philippines) and Latin America (Ecuador, Peru) have been recorded. Currently, circa one million Romanians (around one tenth of them being Roma\"[http://www.ipsnews.net/news.asp?idnews=42404 EUROPE:  Home to Roma, And No Place for Them] \". IPS ipsnews.net.) are officially registered as living in Italy, representing thus the most important individual country of origin, followed by Albanians and Moroccans with about 500,000 people each. The number of unregistered Romanians is difficult to estimate, but the Balkan Investigative Reporting Network suggested that in 2007 that there might have been half a million or more. Overall, at the end of the 2000s the foreign born population of Italy was from: Europe (54%), Africa (22%), Asia (16%), the Americas (8%) and Oceania (0.06%). The distribution of immigrants is largely uneven in Italy: 84.9% of immigrants live in the northern and central parts of the country (the most economically developed areas), while only 15.1% live in the southern half of the peninsula.\n\nLanguages \n\nItaly's official language is Italian. Ethnologue has estimated that there are about 55 million speakers of the language in Italy and a further 6.7 million outside of the country.[http://www.ethnologue.com/show_language.asp?code\nita Ethnologue report for language code:ita (Italy)] - Gordon, Raymond G., Jr. (ed.), 2005. Ethnologue: Languages of the World, Fifteenth edition. Dallas, Tex.: SIL International. Online version However, between 120 and 150 million people use Italian as a second or cultural language, worldwide.[http://www.servinghistory.com/topics/Italian_language::sub::Geographic_Distribution Italian Language: Geographic Distribution] Discovery Media'.' Retrieved 2010-05-16.\n\nItalian, adopted by the state after the unification of Italy, is based on the Florentine variety of Tuscan and is somewhat intermediate between the Italo-Dalmatian languages and the Gallo-Romance languages. Its development was also influenced by the Germanic languages of the post-Roman invaders.\n\nItaly has numerous dialects spoken all over the country. However, the establishment of a national education system has led to decrease in variation in the languages spoken across the country. Standardisation was further expanded in the 1950s and 1960s thanks to economic growth and the rise of mass media and television (the state broadcaster RAI helped set a standard Italian).\n\nSeveral minority and regional languages are legally recognized and protected,[L.cost. 26 febbraio 1948, n. 4, Statuto speciale per la Valle d'Aosta; L.cost. 26 febbraio 1948, n. 5, Statuto speciale per il Trentino-Alto Adige; L.cost. 31 gennaio 1963, n. 1, Statuto speciale della Regione Friuli Venezia Giulia] and they have co-official status alongside Italian in various parts of the country. French is co-official in the Valle d’Aosta—although in fact Franco-Provencal is more commonly spoken there. German has the same status in the province of South Tyrol as, in some parts of that province and in parts of the neighbouring Trentino, does Ladin. Slovene and Friulian are officially recognised in the provinces of Trieste, Gorizia and Udine in Venezia Giulia. Sardinian language was recognized as co-official in Sardinia.\n\nIn these regions official documents are bilingual (trilingual in Ladin communities), or available upon request in either Italian or the co-official language. Traffic signs are also multilingual, except in the Valle d’Aosta where—with the exception of Aosta itself which has retained its Latin form in Italian as in English—French toponyms are generally used, attempts to Italianise them during the Fascist period having been abandoned. Education is possible in minority languages where such schools are operating.\n\nUNESCO and other authories recognize many other endangered languages, which are not protected by Italian government: Piedmontese, Venetian, Ligurian, Lombard, Emilian-Romagnolo, Neapolitan and Sicilian.\n\nHistorical data\n\nVital statistics since 1900B.R. Mitchell. European historical statistics, 1750-1975.http://unstats.un.org/unsd/demographic/products/dyb/dybsets/1948%20DYB.pdf United nations. Demographic Yearbook 1948 \n\nCurrent natural increase\n \n\n*Number of births from January–September 2016 =  351,074\n*Number of births from January–September 2017 =  339,282\n*Number of deaths from January–September 2016 =  455,989\n*Number of deaths from January–September 2017 =  489,095\n*Natural growth from January–September 2016 =  -104,915\n*Natural growth from January–September 2017 =  -149,813\n\nReligion \n\nRoman Catholicism is by far the largest religion in the country, although the Catholic Church is no longer officially the state religion. In 2006, 87.8% of Italy's population self-identified as Roman Catholic, although only about one-third of these described themselves as active members (36.8%).\n\nMost Italians believe in God, or a form of a spiritual life force. According to the most recent Eurobarometer Poll 2005:[http://ec.europa.eu/public_opinion/archives/ebs/ebs_225_report_en.pdf ReportDGResearchSocialValuesEN2.PDF]  74% of Italian citizens responded that 'they believe there is a God', 16% answered that 'they believe there is some sort of spirit or life force' and 6% answered that 'they do not believe there is any sort of spirit, God, or life force'. \nThere are no data collected through census.\n\nChristianity\n\nThe Italian Catholic Church is part of the global Roman Catholic Church, under the leadership of the Pope, curia in Rome, and the Conference of Italian Bishops. In addition to Italy, two other sovereign nations are included in Italian-based dioceses, San Marino and Vatican City. There are 225 dioceses in the Italian Catholic Church, see further in this article and in the article List of the Roman Catholic dioceses in Italy. Even though by law Vatican City is not part of Italy, it is in Rome, and along with Latin, Italian is the most spoken and second language of the Roman Curia.\n\nItaly has a rich Catholic culture, especially as numerous Catholic saints, martyrs and popes were Italian themselves. Roman Catholic art in Italy especially flourished during the Middle Ages, Renaissance and Baroque periods, with numerous Italian artists, such as Michelangelo, Leonardo da Vinci, Raphael, Caravaggio, Fra Angelico, Gian Lorenzo Bernini, Sandro Botticelli, Tintoretto, Titian, Raphael and Giotto. Roman Catholic architecture in Italy is equally as rich and impressive, with churches, basilicas and cathedrals such as St Peter's Basilica, Florence Cathedral and St Mark's Basilica. Roman Catholicism is the largest religion and denomination in Italy, with around 87.8% of Italians considering themselves Catholic. Italy is also home to the greatest number of cardinals in the world, and is the country with the greatest number of Roman Catholic churches per capita.\n\nEven though the main Christian denomination in Italy is Roman Catholicism, there are some minorities of Protestant, Waldensian, Eastern Orthodox and other Christian churches.\n\nIn the 20th century, Jehovah's Witnesses, Pentecostalism, non-denominational Evangelicalism, and Mormonism were the fastest-growing Protestant churches. Immigration from Western, Central, and Eastern Africa at the beginning of the 21st century has increased the size of Baptist, Anglican, Pentecostal and Evangelical communities in Italy, while immigration from Eastern Europe has produced large Eastern Orthodox communities.\n\nIn 2006, Protestants made up 2.1% of Italy's population, and members of Eastern Orthodox churches comprised 1.2% or more than 700,000 Eastern Orthodox Christians including 180,000 Greek Orthodox,[http://www.ortodossia.it/The%20Holy%20Orthodox%20Archdiocese%20of%20Italy%20ed%20Malta.htm The Holy Orthodox Archdiocese of Italy and Malta]  550,000 Pentecostals and Evangelists (0.8%), of whom 400,000 are members of the Assemblies of God, about 250,000 are Jehovah's Witnesses (0.4%), 30,000 Waldensians, [http://www.chiesavaldese.org/pages/storia/dove_viviamo.php Waldensian Evangelical Church]  25,000 Seventh-day Adventists, 22,000 Mormons, 15,000 Baptists (plus some 5,000 Free Baptists), 7,000 Lutherans, 4,000 Methodists (affiliated with the Waldensian Church).[http://www.oikoumene.org/en/member-churches/regions/europe/italy/evangelical-methodist-church-in-italy.html World Council of Churches] \n\nOther religions\n\nThe longest-established religious faith in Italy is Judaism, Jews having been present in Ancient Rome before the birth of Christ. Italy has seen many influential Italian-Jews, such as Luigi Luzzatti, who took office in 1910, Ernesto Nathan served as mayor of Rome from 1907 to 1913 and Shabbethai Donnolo (died 982). During the Holocaust, Italy took in many Jewish refugees from Nazi Germany. However, with the creation of the Nazi-backed puppet Italian Social Republic, about 15% of 48,000 Italian Jews were killed. This, together with the emigration that preceded and followed the Second World War, has left only a small community of around 45,000 Jews in Italy today.\n\nDue to immigration from around the world, there has been an increase in non-Christian religions. As of 2009, there were 1.0 million Muslims in Italy forming 1.6 percent of population; independent estimates put the Islamic population in Italy anywhere from 0.8 million to 1.5 million. Only 50,000 Italian Muslims hold Italian citizenship.\n\nThere are more than 200,000 followers of faith originating in the Indian subcontinent, including some 70,000 Sikhs with 22 gurdwaras across the country, 70,000 Hindus, and 50,000 Buddhists.[http://www.buddhismo.it/ente.htm Unione Buddhista Italiana - UBI: L'Ente]  There are an estimated some 4,900 Bahá'ís in Italy in 2005.\n\nDemographic statistics\n\nThe following demographic statistics are from Italy's Istituto Nazionale di Statistica  and Cia World Factbook.\n\nPopulation\n\n60,674,003  (Jan 2016 est.)\n\nAge structure\n\n0-14 years: 13.5% (men 4,056,156/women 3,814,070)\n15-64 years: 66.3% (men 19,530,696/women 18,981,084)\n65 years and over: 20.2% (men 4,903,762/women 6,840,444) (2010 est.)\n\nMedian age\n\nmen: 43.0 years\nwomen: 45.3 years (2013 est.)\n\ntotal: 44.2 years (2015 est.)\n\nPopulation growth rate\n\n0.03% (2016 est.)\n\nBirth rate\n\n8.94 births/1,000 population (2013 est.)\n\nDeath rate\n\n10.01 deaths/1,000 population (2013 est.)\n\nNet migration rate\n\n4.47 migrant(s)/1,000 population (2013 est.)\n\nUrbanization\n\nurban population: 68% of total population (2010)\nrate of urbanization: 0.5% annual rate of change (2010-15 est.)\n\nSex ratio\n\nat birth: 1.06 men(s)/women\nunder 15 years: 1.05 men(s)/women\n15-64 years: 1.02 men(s)/women\n65 years and over: 0.74 men(s)/women\ntotal population: 0.93 men(s)/women\n(2013 est.)\n\nMaternal mortality rate\n\n4.0 deaths/100,000 live births (2010)\n\nInfant mortality rate\n\ntotal:  3.33 deaths/1,000 live births\nmen:  3.54 deaths/1,000 live births\nwomen:  3.12 deaths/1,000 live births\n(2013 est.)\n\nLife expectancy at birth\n\ntotal population: 81.95 years \nmale: 79.32 years \nfemale: 84.73 years (2013)\n\nTotal fertility rate\n\n1.39 children born/woman (Italian citizens)\n1.91 children born/woman (Foreign citizens)\n1.39 children born/woman (total citizens) (2014)\n\nHealth expenditures\n\n9.5% of total GDP (2010)\n\nPhysicians density\n\n4.24 physicians/1,000 population (2008)\n\nHospital bed density\n\n3.6 beds/1,000 population (2009)\n\nHIV/AIDS\n\nAdult prevalence rate: 0.3% (2009 est.)\nPeople living with HIV/AIDS: 140,000 (2009 est.)\nDeaths: fewer than 1,000 (2009 est.)\n\nObesity – adult prevalence rate\n\n19.8% (2008)\n\nNationality\n\nnoun: Italian(s)\nadjective: Italian\n\nEthnic groups\n\nItalian: 92%, other European (mostly Romanian, Albanian, Ukrainian and others) 5%, North African (mostly Moroccan) 1.5%, others 2.5%.\n\nHistorically the ethnicity of the Italian people was mainly made of romanized autochthonous Italics and Gauls, with additions of Germanic populations (like Longobards) and -in very small amounts- of other bordering people (like Slovenes, Austrians, Albanians, etc..).\n\nReligions\n\nRoman Catholic: 90% (approximately; one half practicing), other Christians: 2%, Muslim: 2%, Atheist or Agnostic: 6%\n\nEducation expenditure\n\n4.7% of total GDP (2008)\n\nLiteracy\n\ndefinition: age 15 and over can read and write\ntotal population: 98.6%\nmale:\n(2003 est.)\n\nGenetics\n\nApproximately half of Italian males belong to the Y-DNA haplogroup R1b which is standard amongst most west European populations. According to data found through different sources, samples, and studies by Eurpedia,  the percentages of Y-dna haplogroups observed  were :\n\n*R1 (51.5% : 49% R1b and 2.5% R1a)\n*J (20% : 18% J2 and 2% J1)\n*E1b1b (11%)\n*G (7%)\n*I (6.5% : 2.5% I1, 3% I2 + I2a and 1% I2b)\n*T (4%). Demographics of Italy. http://en.wikipedia.org/?curid=14700."
  }
}
