{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9119",
  "eid" : "ec924ca0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778476650,
  "textBody" : "The Distinguished Service Medal (DSM) is a military award of the United States Army that is presented to any person who, while serving in any capacity with the United States military, has distinguished himself by exceptionally meritorious service to the Government in a duty of great responsibility. The performance must be such as to merit recognition for service that is clearly exceptional. Exceptional performance of normal duty will not alone justify an award of this decoration.\n\nSeparate Distinguished Service Medals exist for the different branches of the military as well as a fifth version of the medal which is a senior award of the United States Department of Defense.  The Army version of the Distinguished Service Medal is typically referred to simply as the \"Distinguished Service Medal\" while the other branches of service use the service name as a prefix.\n\nFor service not related to actual war, the term \"duty of a great responsibility\" applies to a narrower range of positions than in time of war, and requires evidence of conspicuously significant achievement. However, justification of the award may accrue by virtue of exceptionally meritorious service in a succession of high positions of great importance.\n\nAwards may be made to persons other than members of the Armed Forces of the United States for wartime services only, and then only under exceptional circumstances, with the express approval of the President in each case.\n\nDescription\n\n*The Coat of Arms of the United States in Gold surrounded by a circle of Dark Blue enamel, 1 ½ inches in diameter, bearing the inscription \"FOR DISTINGUISHED SERVICE MCMXVIII\".\n*On the reverse is a scroll for the name of the recipient (which is to be engraved) upon a trophy of flags and weapons. The medal is suspended by a bar attached to the ribbon.\n\nRibbon\n\n*The ribbon is 1 3/8 inches wide and consists of the following stripes:\n#5/16 inch Scarlet 67111;\n#1/16 inch Ultramarine Blue 67118;\n#5/8 inch White 67101;\n#1/16 inch Ultramarine Blue;\n#5/16 inch Scarlet.\n\n*Additional awards of the Distinguished Service Medal are denoted by oak leaf clusters.\n\nCriteria\n\nThe Distinguished Service Medal is awarded to any person who, while serving in any capacity with the United States Army, has distinguished himself or herself by exceptionally meritorious service to the Government in a duty of great responsibility.\nThe performance must be such as to merit recognition for service which is clearly exceptional. Exceptional performance of normal duty will not alone justify an award of this decoration. For service not related to actual war, the term \"duty of a great responsibility\" applies to a narrower range of positions than in time of war and requires evidence of a conspicuously significant achievement. However, justification of the award may accrue by virtue of exceptionally meritorious service in a succession of high positions of great importance. Awards may be made to persons other than members of the Armed Forces of the United States for wartime services only, and only then under exceptional circumstances with the express approval of the President in each case.\n\nComponents\n\n*The following are authorized components of the Distinguished Service Medal and applicable specifications:\n#Decoration (regular size): MIL-D-3943/7.\n##NSN for decoration set: 8455-00-444-0007.\n##NSN for replacement medal is 8455-00-246-3830.\n#Decoration (miniature size): MIL-D-3943/7. NSN 8455-00-996-5008.\n#Ribbon: MIL-R-11589/52. NSN 8455-00-252-9922.\n#Lapel Button (metal replica of ribbon bar): MIL-L-11484/4. NSN 8455-00-253-0809.\n\nHistory of the Distinguished Service Medal\n\nThe Distinguished Service Medal was authorized by Presidential Order dated 01-02-1918, and confirmed by Congress on 07-09-1918. It was announced by War Department General Order No. 6, 1918-01-12, with the following information concerning the medal: \"A bronze medal of appropriate design and a ribbon to be worn in lieu thereof, to be awarded by the President to any person who, while serving in any capacity with the Army shall hereafter distinguish himself or herself, or who, since 04-06-1917, has distinguished himself or herself by exceptionally meritorious service to the Government in a duty of great responsibility in time of war or in connection with military operations against an armed enemy of the United States.\" The Act of Congress on 07-09-1918, recognized the need for different types and degrees of heroism and meritorious service and included such provisions for award criteria. The current statutory authorization for the Distinguished Service Medal is Title 10, United States Code, Section 3743.\n\nRecipients\n\n*Among the first awards of the Distinguished Service Medal for service in World War I, were those to the Commanding Officers of the Allied Armies:\n#Marshal Ferdinand Foch\n#Marshal Joseph Joffre,\n#General Philippe Petain of France,\n#General Louis Franchet d'Espèrey of France,\n#General Sir Arthur Currie of Canada,\n#General Sir John Monash of Australia,\n#Field Marshal Douglas Haig, 1st Earl Haig of Britain,\n#General Armando Diaz of Italy,\n#General Cyriaque Gillain of Belgium,\n#General John Joseph Pershing - United States\n#Field Marshal Živojin Mišić of Serbia\n\nMore than 2,000 awards were made during World War I, and by the time the United States entered World War II, approximately 2,800 awards had been made.  From July 1, 1941 to June 6, 1969, when the Army stopped publishing awards of the DSM in Department of the Army General Orders, over 2,800 further awards were made.George H. Apgar (1995), Awards of the US Army Distinguished Service Medal 1942-1969, Planchet Press\n\nPrior to World War II the DSM was the only decoration for non-combat service in the U.S. Army.  As a result, before World War II the DSM was awarded to a wider range of recipients than during and after World War II.  During World War I awards of the DSM to officers below the rank of brigadier general were fairly common but became rare once the Legion of Merit was established in 1942. \n\nUntil the first award of the Air Force Distinguished Service Medal in 1965, United States Air Force personnel received this award as well, as was the case with several other Army decorations until the Air Force fully established its own system of decorations.\n\nNotable recipients\n\nBecause the Army Distinguished Service Medal is principally awarded to general officers, a list of notable recipients would include nearly every general, and some admirals, since 1918, many of whom received multiple awards, as well as a few civilians and sergeants major prominent for their contributions to national defense.\n\nGeneral Martin Dempsey, former Chairman of the Joint Chiefs of Staff, has the record for the greatest number of awards received of the Army Distinguished Service Medal at six.  He also received three awards of the Defense Distinguished Service Medal as well as one award each of the Navy Distinguished Service Medal, the Air Force Distinguished Service Medal, and the Coast Guard Distinguished Service Medal, for a total of twelve Distinguished Service Medals. \n\nGenerals of the Army Douglas MacArthur and Dwight Eisenhower are tied with five awards each received of the Army Distinguished Service Medal.  They also each received one award of the Navy Distinguished Service Medal, for a total of six DSMs each.\n\nGeneral Norman Schwarzkopf received two awards of the Army DSM and one award each of the Defense DSM, Navy DSM, the Air Force DSM and the Coast Guard DSM, for a total of six DSMs.\n\nGeneral Lloyd Austin received four awards of the Army DSM and five awards of the Defense DSM for a total of nine DSMs.\n\nAmong notable recipients below flag rank are: X-1 test pilot Chuck Yeager and X-15 test pilot Robert M. White, who both received the DSM as U.S. Air Force majors; Air Force Major Rudolf Anderson, the U-2 pilot shot down during the Cuban Missile Crisis; director Frank Capra, decorated in 1945 as an Army colonel; actor James Stewart, decorated in 1945 as an Army Air Forces colonel (later Air Force Brigadier General); Colonel Wendell Fertig, who led Filipino guerrillas behind Japanese lines; Colonel (later Major General) John K. Singlaub, who led partisan forces in the Korean War; and Major Maude C. Davison, who led the \"Angels of Bataan and Corregidor\" during their imprisonment by the Japanese, and Colonel William S. Taylor, Program Manager Multiple Launch Rocket System. Among notable civilian recipients are Harry L. Hopkins, Robert S. McNamara and Henry L. Stimson.\n\nNotable American and foreign recipients include:\n\nUnited States Army\n\n*General of the Armies John J. Pershing - Commander of the American Expeditionary Force\n*General of the Army George C. Marshall - US Army Chief of Staff\n*General of the Army Douglas MacArthur - US Army Chief of Staff\n*General of the Army Dwight D. Eisenhower - NATO Supreme Allied Commander Europe\n*General of the Army Omar N. Bradley - Chairman of the Joint Chiefs of Staff\n*General Creighton Abrams - US Army Chief of Staff\n*General Tasker H. Bliss - US Army Chief of Staff\n*General Mark W. Clark - Commander of the United Nations Command in Korea\n*General J. Lawton Collins - US Army Chief of Staff\n*General Malin Craig - US Army Chief of Staff\n*General Martin E. Dempsey - Chairman of the Joint Chiefs of Staff\n*General Ann E. Dunwoody - First female US Army four star general\n*General Alexander Haig - NATO Supreme Allied Commander Europe\n*Brigadier General Anna Mae Hays - Chief of the United States Army Nurse Corps and first female US Army general\n*General John J. Hennessey - Commander in Chief of United States Readiness Command\n*General John L. Hines - US Army Chief of Staff\n*General Harold K. Johnson - US Army Chief of Staff\n*General Lyman L. Lemnitzer - NATO Supreme Allied Commander Europe\n*General Peyton C. March - US Army Chief of Staff\n*General Edward C. Meyer - US Army Chief of Staff\n*General George S. Patton - Commander of the 3rd Army\n*General Colin Powell - Chairman of the Joint Chiefs of Staff\n*General Matthew B. Ridgeway - US Army Chief of Staff\n*General Bernard Rogers - NATO Supreme Allied Commander Europe\n*General Norman Schwarzkopf - Commander of Operation Desert Storm\n*General John Shalikashvili - Chairman of the Joint Chiefs of Staff\n*General Joseph Stilwell - Commander of the China Burma India Theater\n*General Maxwell D. Taylor - US Army Chief of Staff\n*General James Van Fleet - Commander of 8th Army in Korea\n*General Jonathan Wainwright - Commander in the Philippines\n*General Walton Walker - Commander of the 8th Army in Korea\n*General William Westmoreland - US Army Chief of Staff\n*General Earle G. Wheeler - Chairman of the Joint Chiefs of Staff\n*Lieutenant General John B. Coulter - with 2 bronze oak leaf clusters in lieu of 2 subsequent awards of medal\n*Lieutenant General Keith M. Huber\n*Lieutenant General Kenneth W. Hunzeker\n*Lieutenant General Hunter Liggett\n*Lieutenant General Mark P. Hertling - Commanding General of US Army Europe\n*Lieutenant General Edward J. O'Neill - with 1 bronze oak leaf cluster in lieu of subsequent award of medal\n*Lieutenant General William Wilson Quinn - Chevalier of the French Legion of Honor\n*Major General Gladeon M. Barnes - Chief of Research and Engineering\n*Major General Chester V. Clifton - Military Aide to Presidents Kennedy and Johnson\n*Major General William Edward Cole - Commander 351st Field Artillery 1917-18\n*Major General William J. Donovan - Founder of the Office of Strategic Services\n*Major General Lawrence J. Fuller - Deputy Director of the Defense Intelligence Agency\n*Major General George W. Goethals - Engineer of the Panama Canal\n*Major General William C. Gorgas - Surgeon General of the Army\n*Major General Patrick J. Hurley\n*Major General Edward Mann Lewis\n*Major General Henry Balding Lewis\n*Major General Robert McGowan Littlejohn\n*Major General Mason M. Patrick\n*Major General N. Lee S. Price - first female selected for General while serving in Special Ops \n*Major General Arthur R. Wilson\n*Brigadier General Charles G. Dawes - Vice President of the United States\n*Brigadier General Frank T. Hines - Director of the Veterans Administration\n*Brigadier General Russell W. Volckmann\n*Colonel Frank Capra - Movie director (received as a Colonel, Army of the United States in WW II) \n*Colonel Harvey Williams Cushing - Neurosurgeon\n*Colonel Horatio B. Hackett - Assistant administrator of the Public Works Administration; noted architect and businessman; football official and player\n*Colonel Oveta Culp Hobby - Director of the Women's Army Corps during World War II.\n*Colonel Herbert H. Lehman - Governor of New York and United States Senator.\n*Colonel Floyd James Thompson - The longest held prisoner of war in American history.\n*Major David A. Reed - U.S. Senator for Pennsylvania, 1922, for service as a Major in Word War I.\n*Major Forsyth Wickes - Socialite, philanthropist and collector.\n*Chaplain Francis P. Duffy - Chaplain of the \"Fighting 69th\"\n*Major Herbert O. Yardley - Cryptologist\n*Grace Banker - Chief Operator of mobile for the American Expeditionary Forces\n\nUnited States Navy\n\n*Fleet Admiral Chester W. Nimitz - Chief of Naval Operations\n*Fleet Admiral William F. Halsey - Commander of the 3rd Fleet\n*Admiral Raymond A. Spruance - Commander of the 5th Fleet (later Ambassador to the Philippines)\n*Admiral William J. Crowe, Jr. - Chairman of the Joint Chiefs of Staff\n*Admiral William V. Pratt\n*Admiral Carlisle Trost - Chief of Naval Operations\n*Admiral Henry B. Wilson\n*Vice Admiral Robert L. Ghormley\n*Vice Admiral Henry Kent Hewitt (with oak leaf cluster)\n*Rear Admiral Hilary P. Jones\n*Rear Admiral Charles P. Plunkett\n\nUnited States Marine Corps\n\n*General Paul X. Kelley, USMC\n*General Vernon E. Megee, USMC \n* Major General Graves B. Erskine, USMC\n*Major General Smedley Butler, USMC\n*Major General John A. Lejeune, USMC\n\nUnited States Air Force\n\nNote - includes Army Air Service, Army Air Corps and Army Air Forces\n\n*General of the Air Force Hap Arnold - Commander of the Army Air Forces\n*General Jimmy Doolittle\n*General Edwin W. Rawlings\n*General Joseph McNarney\n*General Hoyt S. Vandenberg - Air Force Chief of Staff and Director of Central Intelligence\n*General George C. Kenney\n*General Curtis Lemay - Air Force Chief of Staff\n*General Carl Spaatz - Air Force Chief of Staff\n*General Michael E. Ryan\n*Lieutenant General Claire Lee Chennault (with oak leaf cluster) - Leader of the Flying Tigers\n*Major General Billy Mitchell, USAAC - Military air power prophet\n*Brigadier General Chuck Yeager - Legendary test pilot\n*Colonel Bernt Balchen, USAF - Legendary Norwegian-American pilot and arctic explorer.\n*Captain John Birch, USAAF - Missionary, guerilla leader and namesake of the John Birch Society\n\nCivilians\n\n*Bernard Baruch - Chairman, War Industries Board, 1918\n*Evangeline Booth - General of the Salvation Army\n*Jacqueline Cochran - Aviatrix and founder of the Women Airforce Service Pilots (WASPs)\n*Henry Pomeroy Davison - Director of the American Red Cross\n*Jane Delano - Founder of the American Red Cross Nursing Service\n*Harry Augustus Garfield - U.S. Fuel Administrator\n*Harry Hopkins - Presidential aide\n*Edward N. Hurley - Chairman, American Shipping Board\n*Robert McNamara - Secretary of Defense\n*Anna Howard Shaw - head of the Women's Committee of the United States Council of National Defense\n*Edward R. Stettinius - Director general of purchases for the War Department\n*John F. Stevens - Railway engineer\n*Henry L. Stimson - Secretary of War\n*Shawn M Carraher - Management Professor & Military Leadership Trainer GAO\n\nForeigners\n\n*Edmund Allenby, 1st Viscount Allenby, General (later Field Marshal), British Army\n*HM Albert I, King of Belgians\n*Alan Brooke, 1st Viscount Alanbrooke, Field Marshal, British Army\n*Pietro Badoglio, General, Italian Army\n*William Birdwood, 1st Baron Birdwood, General, British Indian Army (during secondment to Australian Army, later promoted to Field Marshal)\n*Julian Byng, 1st Viscount Byng of Vimy, General (later Field Marshal), British Army\n*Sir Winston Churchill KG, OM, PC, CH, FRS - British Minister of Munitions (later Prime Minister)\n*Harry Crerar, Lieutenant General, Canadian Army\n*Andrew Cunningham, 1st Viscount Cunningham of Hyndhope, Admiral of the Fleet, Royal Navy\n*Sir Arthur Currie, Lieutenant General, British Army, commanding Canadian Corps\n*Georges de Bazelaire, Major General, VII Army Corps of the French Army during World War I\n*Sir Francis de Guingand, Major General, British Army\n*Jean de Lattre de Tassigny, General, French Army (later a Marshal of France)\n*Sir Miles Dempsey, General, British Army\n*Sir John Dill, Field Marshal, British Army\n*Ferdinand Foch, Marshal of France, French Army\n*Douglas Haig, 1st Earl Haig, Field Marshal, British Army\n*Arthur T. Harris, Air Chief Marshal, Royal Air Force (later a Marshal of the Royal Air Force)\n*Chiang Kai-shek, General, Chinese Army\n*Charles Mangin, General, French Army\n*Paul Maistre, General, French Army\n*Sir Richard McCreery, General, British Army\n*Živojin Mišić, Field Marshal, Serbian Army\n*Sir John Monash, General, Australian Army\n*Bernard Montgomery, 1st Viscount Montgomery of Alamein, Field Marshal, British Army\n*Sir Frederick E. Morgan, Lieutenant General, British Army\n*Louis Mountbatten, 1st Earl Mountbatten of Burma, Admiral, Royal Navy (later Admiral of the Fleet)\n*Henri Petain, Marshal of France, French Army\n*Alexander Pokryshkin, Marshal of the Soviet Air Force\n*Charles Portal, 1st Viscount Portal of Hungerford, Marshal of the Royal Air Force\n*Sir William Robertson, 1st Baronet, Field Marshal, British Army\n*Frederick Sykes, Chief of the Air Staff (United Kingdom)\n*Arthur Tedder, 1st Baron Tedder, Air Chief Marshal, Royal Air Force (later Marshal of the Royal Air Force)\n*Sir Henry Worth Thornton, Major General, British Army (American born)\n*Gerald Trotter, Brigadier-General, British Army\n*Sir Thomas Andrew Alexander Montgomery-Cuninghame, 10th Baronet of Corsehill, Brevet Lieutenant Colonel, Military Attache, British Army\n*Maxime Weygand, General, French Army",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Distinguished Service Medal (U.S. Army)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9119" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Distinguished Service Medal (DSM) is a military award of the United States Army that is presented to any person who, while serving in any capacity with the United States military, has distinguished himself by exceptionally meritorious service to the Government in a duty of great responsibility. The performance must be such as to merit recognition for service that is clearly exceptional. Exceptional performance of normal duty will not alone justify an award of this decoration.\n\nSeparate Distinguished Service Medals exist for the different branches of the military as well as a fifth version of the medal which is a senior award of the United States Department of Defense.  The Army version of the Distinguished Service Medal is typically referred to simply as the \"Distinguished Service Medal\" while the other branches of service use the service name as a prefix.\n\nFor service not related to actual war, the term \"duty of a great responsibility\" applies to a narrower range of positions than in time of war, and requires evidence of conspicuously significant achievement. However, justification of the award may accrue by virtue of exceptionally meritorious service in a succession of high positions of great importance.\n\nAwards may be made to persons other than members of the Armed Forces of the United States for wartime services only, and then only under exceptional circumstances, with the express approval of the President in each case.\n\nDescription\n\n*The Coat of Arms of the United States in Gold surrounded by a circle of Dark Blue enamel, 1 ½ inches in diameter, bearing the inscription \"FOR DISTINGUISHED SERVICE MCMXVIII\".\n*On the reverse is a scroll for the name of the recipient (which is to be engraved) upon a trophy of flags and weapons. The medal is suspended by a bar attached to the ribbon.\n\nRibbon\n\n*The ribbon is 1 3/8 inches wide and consists of the following stripes:\n#5/16 inch Scarlet 67111;\n#1/16 inch Ultramarine Blue 67118;\n#5/8 inch White 67101;\n#1/16 inch Ultramarine Blue;\n#5/16 inch Scarlet.\n\n*Additional awards of the Distinguished Service Medal are denoted by oak leaf clusters.\n\nCriteria\n\nThe Distinguished Service Medal is awarded to any person who, while serving in any capacity with the United States Army, has distinguished himself or herself by exceptionally meritorious service to the Government in a duty of great responsibility.\nThe performance must be such as to merit recognition for service which is clearly exceptional. Exceptional performance of normal duty will not alone justify an award of this decoration. For service not related to actual war, the term \"duty of a great responsibility\" applies to a narrower range of positions than in time of war and requires evidence of a conspicuously significant achievement. However, justification of the award may accrue by virtue of exceptionally meritorious service in a succession of high positions of great importance. Awards may be made to persons other than members of the Armed Forces of the United States for wartime services only, and only then under exceptional circumstances with the express approval of the President in each case.\n\nComponents\n\n*The following are authorized components of the Distinguished Service Medal and applicable specifications:\n#Decoration (regular size): MIL-D-3943/7.\n##NSN for decoration set: 8455-00-444-0007.\n##NSN for replacement medal is 8455-00-246-3830.\n#Decoration (miniature size): MIL-D-3943/7. NSN 8455-00-996-5008.\n#Ribbon: MIL-R-11589/52. NSN 8455-00-252-9922.\n#Lapel Button (metal replica of ribbon bar): MIL-L-11484/4. NSN 8455-00-253-0809.\n\nHistory of the Distinguished Service Medal\n\nThe Distinguished Service Medal was authorized by Presidential Order dated 01-02-1918, and confirmed by Congress on 07-09-1918. It was announced by War Department General Order No. 6, 1918-01-12, with the following information concerning the medal: \"A bronze medal of appropriate design and a ribbon to be worn in lieu thereof, to be awarded by the President to any person who, while serving in any capacity with the Army shall hereafter distinguish himself or herself, or who, since 04-06-1917, has distinguished himself or herself by exceptionally meritorious service to the Government in a duty of great responsibility in time of war or in connection with military operations against an armed enemy of the United States.\" The Act of Congress on 07-09-1918, recognized the need for different types and degrees of heroism and meritorious service and included such provisions for award criteria. The current statutory authorization for the Distinguished Service Medal is Title 10, United States Code, Section 3743.\n\nRecipients\n\n*Among the first awards of the Distinguished Service Medal for service in World War I, were those to the Commanding Officers of the Allied Armies:\n#Marshal Ferdinand Foch\n#Marshal Joseph Joffre,\n#General Philippe Petain of France,\n#General Louis Franchet d'Espèrey of France,\n#General Sir Arthur Currie of Canada,\n#General Sir John Monash of Australia,\n#Field Marshal Douglas Haig, 1st Earl Haig of Britain,\n#General Armando Diaz of Italy,\n#General Cyriaque Gillain of Belgium,\n#General John Joseph Pershing - United States\n#Field Marshal Živojin Mišić of Serbia\n\nMore than 2,000 awards were made during World War I, and by the time the United States entered World War II, approximately 2,800 awards had been made.  From July 1, 1941 to June 6, 1969, when the Army stopped publishing awards of the DSM in Department of the Army General Orders, over 2,800 further awards were made.George H. Apgar (1995), Awards of the US Army Distinguished Service Medal 1942-1969, Planchet Press\n\nPrior to World War II the DSM was the only decoration for non-combat service in the U.S. Army.  As a result, before World War II the DSM was awarded to a wider range of recipients than during and after World War II.  During World War I awards of the DSM to officers below the rank of brigadier general were fairly common but became rare once the Legion of Merit was established in 1942. \n\nUntil the first award of the Air Force Distinguished Service Medal in 1965, United States Air Force personnel received this award as well, as was the case with several other Army decorations until the Air Force fully established its own system of decorations.\n\nNotable recipients\n\nBecause the Army Distinguished Service Medal is principally awarded to general officers, a list of notable recipients would include nearly every general, and some admirals, since 1918, many of whom received multiple awards, as well as a few civilians and sergeants major prominent for their contributions to national defense.\n\nGeneral Martin Dempsey, former Chairman of the Joint Chiefs of Staff, has the record for the greatest number of awards received of the Army Distinguished Service Medal at six.  He also received three awards of the Defense Distinguished Service Medal as well as one award each of the Navy Distinguished Service Medal, the Air Force Distinguished Service Medal, and the Coast Guard Distinguished Service Medal, for a total of twelve Distinguished Service Medals. \n\nGenerals of the Army Douglas MacArthur and Dwight Eisenhower are tied with five awards each received of the Army Distinguished Service Medal.  They also each received one award of the Navy Distinguished Service Medal, for a total of six DSMs each.\n\nGeneral Norman Schwarzkopf received two awards of the Army DSM and one award each of the Defense DSM, Navy DSM, the Air Force DSM and the Coast Guard DSM, for a total of six DSMs.\n\nGeneral Lloyd Austin received four awards of the Army DSM and five awards of the Defense DSM for a total of nine DSMs.\n\nAmong notable recipients below flag rank are: X-1 test pilot Chuck Yeager and X-15 test pilot Robert M. White, who both received the DSM as U.S. Air Force majors; Air Force Major Rudolf Anderson, the U-2 pilot shot down during the Cuban Missile Crisis; director Frank Capra, decorated in 1945 as an Army colonel; actor James Stewart, decorated in 1945 as an Army Air Forces colonel (later Air Force Brigadier General); Colonel Wendell Fertig, who led Filipino guerrillas behind Japanese lines; Colonel (later Major General) John K. Singlaub, who led partisan forces in the Korean War; and Major Maude C. Davison, who led the \"Angels of Bataan and Corregidor\" during their imprisonment by the Japanese, and Colonel William S. Taylor, Program Manager Multiple Launch Rocket System. Among notable civilian recipients are Harry L. Hopkins, Robert S. McNamara and Henry L. Stimson.\n\nNotable American and foreign recipients include:\n\nUnited States Army\n\n*General of the Armies John J. Pershing - Commander of the American Expeditionary Force\n*General of the Army George C. Marshall - US Army Chief of Staff\n*General of the Army Douglas MacArthur - US Army Chief of Staff\n*General of the Army Dwight D. Eisenhower - NATO Supreme Allied Commander Europe\n*General of the Army Omar N. Bradley - Chairman of the Joint Chiefs of Staff\n*General Creighton Abrams - US Army Chief of Staff\n*General Tasker H. Bliss - US Army Chief of Staff\n*General Mark W. Clark - Commander of the United Nations Command in Korea\n*General J. Lawton Collins - US Army Chief of Staff\n*General Malin Craig - US Army Chief of Staff\n*General Martin E. Dempsey - Chairman of the Joint Chiefs of Staff\n*General Ann E. Dunwoody - First female US Army four star general\n*General Alexander Haig - NATO Supreme Allied Commander Europe\n*Brigadier General Anna Mae Hays - Chief of the United States Army Nurse Corps and first female US Army general\n*General John J. Hennessey - Commander in Chief of United States Readiness Command\n*General John L. Hines - US Army Chief of Staff\n*General Harold K. Johnson - US Army Chief of Staff\n*General Lyman L. Lemnitzer - NATO Supreme Allied Commander Europe\n*General Peyton C. March - US Army Chief of Staff\n*General Edward C. Meyer - US Army Chief of Staff\n*General George S. Patton - Commander of the 3rd Army\n*General Colin Powell - Chairman of the Joint Chiefs of Staff\n*General Matthew B. Ridgeway - US Army Chief of Staff\n*General Bernard Rogers - NATO Supreme Allied Commander Europe\n*General Norman Schwarzkopf - Commander of Operation Desert Storm\n*General John Shalikashvili - Chairman of the Joint Chiefs of Staff\n*General Joseph Stilwell - Commander of the China Burma India Theater\n*General Maxwell D. Taylor - US Army Chief of Staff\n*General James Van Fleet - Commander of 8th Army in Korea\n*General Jonathan Wainwright - Commander in the Philippines\n*General Walton Walker - Commander of the 8th Army in Korea\n*General William Westmoreland - US Army Chief of Staff\n*General Earle G. Wheeler - Chairman of the Joint Chiefs of Staff\n*Lieutenant General John B. Coulter - with 2 bronze oak leaf clusters in lieu of 2 subsequent awards of medal\n*Lieutenant General Keith M. Huber\n*Lieutenant General Kenneth W. Hunzeker\n*Lieutenant General Hunter Liggett\n*Lieutenant General Mark P. Hertling - Commanding General of US Army Europe\n*Lieutenant General Edward J. O'Neill - with 1 bronze oak leaf cluster in lieu of subsequent award of medal\n*Lieutenant General William Wilson Quinn - Chevalier of the French Legion of Honor\n*Major General Gladeon M. Barnes - Chief of Research and Engineering\n*Major General Chester V. Clifton - Military Aide to Presidents Kennedy and Johnson\n*Major General William Edward Cole - Commander 351st Field Artillery 1917-18\n*Major General William J. Donovan - Founder of the Office of Strategic Services\n*Major General Lawrence J. Fuller - Deputy Director of the Defense Intelligence Agency\n*Major General George W. Goethals - Engineer of the Panama Canal\n*Major General William C. Gorgas - Surgeon General of the Army\n*Major General Patrick J. Hurley\n*Major General Edward Mann Lewis\n*Major General Henry Balding Lewis\n*Major General Robert McGowan Littlejohn\n*Major General Mason M. Patrick\n*Major General N. Lee S. Price - first female selected for General while serving in Special Ops \n*Major General Arthur R. Wilson\n*Brigadier General Charles G. Dawes - Vice President of the United States\n*Brigadier General Frank T. Hines - Director of the Veterans Administration\n*Brigadier General Russell W. Volckmann\n*Colonel Frank Capra - Movie director (received as a Colonel, Army of the United States in WW II) \n*Colonel Harvey Williams Cushing - Neurosurgeon\n*Colonel Horatio B. Hackett - Assistant administrator of the Public Works Administration; noted architect and businessman; football official and player\n*Colonel Oveta Culp Hobby - Director of the Women's Army Corps during World War II.\n*Colonel Herbert H. Lehman - Governor of New York and United States Senator.\n*Colonel Floyd James Thompson - The longest held prisoner of war in American history.\n*Major David A. Reed - U.S. Senator for Pennsylvania, 1922, for service as a Major in Word War I.\n*Major Forsyth Wickes - Socialite, philanthropist and collector.\n*Chaplain Francis P. Duffy - Chaplain of the \"Fighting 69th\"\n*Major Herbert O. Yardley - Cryptologist\n*Grace Banker - Chief Operator of mobile for the American Expeditionary Forces\n\nUnited States Navy\n\n*Fleet Admiral Chester W. Nimitz - Chief of Naval Operations\n*Fleet Admiral William F. Halsey - Commander of the 3rd Fleet\n*Admiral Raymond A. Spruance - Commander of the 5th Fleet (later Ambassador to the Philippines)\n*Admiral William J. Crowe, Jr. - Chairman of the Joint Chiefs of Staff\n*Admiral William V. Pratt\n*Admiral Carlisle Trost - Chief of Naval Operations\n*Admiral Henry B. Wilson\n*Vice Admiral Robert L. Ghormley\n*Vice Admiral Henry Kent Hewitt (with oak leaf cluster)\n*Rear Admiral Hilary P. Jones\n*Rear Admiral Charles P. Plunkett\n\nUnited States Marine Corps\n\n*General Paul X. Kelley, USMC\n*General Vernon E. Megee, USMC \n* Major General Graves B. Erskine, USMC\n*Major General Smedley Butler, USMC\n*Major General John A. Lejeune, USMC\n\nUnited States Air Force\n\nNote - includes Army Air Service, Army Air Corps and Army Air Forces\n\n*General of the Air Force Hap Arnold - Commander of the Army Air Forces\n*General Jimmy Doolittle\n*General Edwin W. Rawlings\n*General Joseph McNarney\n*General Hoyt S. Vandenberg - Air Force Chief of Staff and Director of Central Intelligence\n*General George C. Kenney\n*General Curtis Lemay - Air Force Chief of Staff\n*General Carl Spaatz - Air Force Chief of Staff\n*General Michael E. Ryan\n*Lieutenant General Claire Lee Chennault (with oak leaf cluster) - Leader of the Flying Tigers\n*Major General Billy Mitchell, USAAC - Military air power prophet\n*Brigadier General Chuck Yeager - Legendary test pilot\n*Colonel Bernt Balchen, USAF - Legendary Norwegian-American pilot and arctic explorer.\n*Captain John Birch, USAAF - Missionary, guerilla leader and namesake of the John Birch Society\n\nCivilians\n\n*Bernard Baruch - Chairman, War Industries Board, 1918\n*Evangeline Booth - General of the Salvation Army\n*Jacqueline Cochran - Aviatrix and founder of the Women Airforce Service Pilots (WASPs)\n*Henry Pomeroy Davison - Director of the American Red Cross\n*Jane Delano - Founder of the American Red Cross Nursing Service\n*Harry Augustus Garfield - U.S. Fuel Administrator\n*Harry Hopkins - Presidential aide\n*Edward N. Hurley - Chairman, American Shipping Board\n*Robert McNamara - Secretary of Defense\n*Anna Howard Shaw - head of the Women's Committee of the United States Council of National Defense\n*Edward R. Stettinius - Director general of purchases for the War Department\n*John F. Stevens - Railway engineer\n*Henry L. Stimson - Secretary of War\n*Shawn M Carraher - Management Professor & Military Leadership Trainer GAO\n\nForeigners\n\n*Edmund Allenby, 1st Viscount Allenby, General (later Field Marshal), British Army\n*HM Albert I, King of Belgians\n*Alan Brooke, 1st Viscount Alanbrooke, Field Marshal, British Army\n*Pietro Badoglio, General, Italian Army\n*William Birdwood, 1st Baron Birdwood, General, British Indian Army (during secondment to Australian Army, later promoted to Field Marshal)\n*Julian Byng, 1st Viscount Byng of Vimy, General (later Field Marshal), British Army\n*Sir Winston Churchill KG, OM, PC, CH, FRS - British Minister of Munitions (later Prime Minister)\n*Harry Crerar, Lieutenant General, Canadian Army\n*Andrew Cunningham, 1st Viscount Cunningham of Hyndhope, Admiral of the Fleet, Royal Navy\n*Sir Arthur Currie, Lieutenant General, British Army, commanding Canadian Corps\n*Georges de Bazelaire, Major General, VII Army Corps of the French Army during World War I\n*Sir Francis de Guingand, Major General, British Army\n*Jean de Lattre de Tassigny, General, French Army (later a Marshal of France)\n*Sir Miles Dempsey, General, British Army\n*Sir John Dill, Field Marshal, British Army\n*Ferdinand Foch, Marshal of France, French Army\n*Douglas Haig, 1st Earl Haig, Field Marshal, British Army\n*Arthur T. Harris, Air Chief Marshal, Royal Air Force (later a Marshal of the Royal Air Force)\n*Chiang Kai-shek, General, Chinese Army\n*Charles Mangin, General, French Army\n*Paul Maistre, General, French Army\n*Sir Richard McCreery, General, British Army\n*Živojin Mišić, Field Marshal, Serbian Army\n*Sir John Monash, General, Australian Army\n*Bernard Montgomery, 1st Viscount Montgomery of Alamein, Field Marshal, British Army\n*Sir Frederick E. Morgan, Lieutenant General, British Army\n*Louis Mountbatten, 1st Earl Mountbatten of Burma, Admiral, Royal Navy (later Admiral of the Fleet)\n*Henri Petain, Marshal of France, French Army\n*Alexander Pokryshkin, Marshal of the Soviet Air Force\n*Charles Portal, 1st Viscount Portal of Hungerford, Marshal of the Royal Air Force\n*Sir William Robertson, 1st Baronet, Field Marshal, British Army\n*Frederick Sykes, Chief of the Air Staff (United Kingdom)\n*Arthur Tedder, 1st Baron Tedder, Air Chief Marshal, Royal Air Force (later Marshal of the Royal Air Force)\n*Sir Henry Worth Thornton, Major General, British Army (American born)\n*Gerald Trotter, Brigadier-General, British Army\n*Sir Thomas Andrew Alexander Montgomery-Cuninghame, 10th Baronet of Corsehill, Brevet Lieutenant Colonel, Military Attache, British Army\n*Maxime Weygand, General, French Army. Distinguished Service Medal (U.S. Army). http://en.wikipedia.org/?curid=9119."
  }
}
