{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7901",
  "eid" : "e3f42f00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778462192,
  "textBody" : "The Baron Vladimir Harkonnen is a fictional character and antagonist from the Dune universe created by Frank Herbert. He is primarily featured in the 1965 novel Dune and is also a prominent character in the Prelude to Dune prequel trilogy (1999-2001) by Brian Herbert and Kevin J. Anderson. The character is brought back as a ghola in the Herbert/Anderson sequels which conclude the original series, Hunters of Dune (2006) and Sandworms of Dune (2007).\n\nConception\n\nFrank Herbert wanted a harsh-sounding name for the antagonists of his novel, Dune. Herbert came across the name \"Härkönen\" in a California telephone book and thought that it sounded \"Soviet\" (it is in fact Finnish), which touched a nerve with Cold War-era readers. In earlier drafts of his novel, the lead villain was called \"Valdemar Hoskanner\".Spice Planet by Brian Herbert and Kevin J. Anderson, based on an outline by Frank Herbert.  Published in The Road to Dune (Hodder & Stoughton, 2005)\n\nCharacteristics\n\nHerbert's \"Appendix IV: The Almanak en-Ashraf (Selected Excerpts of the Noble Houses)\" in Dune says of Harkonnen (in part):\n\nIn Dune, Herbert writes that the Baron possesses a \"basso voice\" and is so \"grossly and immensely fat\" that he requires anti-gravity devices known as suspensors to support his weight.From Dune: \"As [Baron Vladimir Harkonnen] emerged from the shadows, his figure took on dimension — grossly and immensely fat. And with subtle bulges beneath folds of his dark robes to reveal that all this fat was sustained partly by portable suspensors harnessed to his flesh. He might weigh two hundred Standard kilos in actuality, but his feet would carry no more than fifty of them.\"\n\nAs ruthless and cruel as he is intelligent and cunning, the Baron has a talent for manipulating others and exploiting their weaknesses. His sexual preference for young men is implied in Dune and Children of Dune.From Dune: \"I'll be in my sleeping chambers,\" the Baron said. \"Bring me that young fellow we bought on Gamont, the one with the lovely eyes. Drug him well. I don't feel like wrestling.\"From Dune: \"Why haven't you ever bought a Bene Gesserit, Uncle?\" Feyd-Rautha asked. \"With a Truthsayer at your side —\" \"You know my tastes!\" the Baron snapped.The Baron says to Feyd in Dune: \"This old fool saw through the shielded needle you'd planted in that slave boy's thigh. Right where I'd put my hand on it, eh?\" It is noted, however, that he \"once permitted himself to be seduced\" in the liaison which produced his secret daughter.Paul says to Jessica in Dune, \"And, mother mine, there's a thing you don't know and should — we are Harkonnens ... take my word for it. I've walked the future, I've looked at a record, I've seen a place, I have all the data. We're Harkonnens ... You're the Baron's own daughter,\" he said, and watched the way she pressed her hands to her mouth. \"The Baron sampled many pleasures in his youth, and once permitted himself to be seduced. But it was for the genetic purposes of the Bene Gesserit, by one of you.\"\n\nPlotlines \n\nDune \n\nAs Dune begins, a longstanding feud exists between the Harkonnens of Giedi Prime and the Atreides of Caladan. The Baron's intent to exterminate the Atreides line seems close to fruition as Duke Leto Atreides is lured to the desert planet Arrakis on the pretense of taking over the valuable melange operation there. The Baron has an agent in the Atreides household: Leto's own physician, the trusted Suk doctor Wellington Yueh. Though Suk Imperial Conditioning supposedly makes the subject incapable of inflicting harm, the Baron's twisted Mentat Piter De Vries notes:\n\nThe Baron has taken Yueh's wife Wanna prisoner, threatening her with interminable torture unless Yueh complies with his demands. Harkonnen also distracts Leto's Mentat Thufir Hawat from discovering Yueh by guiding Hawat toward another suspect: Leto's Bene Gesserit concubine Lady Jessica, of whom Hawat is already distrustful. The Atreides are soon attacked by Harkonnen forces (secretly supplemented by the seemingly unstoppable Imperial Sardaukar) as Yueh disables the protective shields around the Atreides palace on Arrakis. As instructed, Yueh takes Leto prisoner; however, desiring to slay the Baron, Yueh provides the captive Leto with a fake tooth filled with poisonous gas as a means of simultaneous assassination and suicide. De Vries kills Yueh but he also dies with Leto in the assassination attempt; however Harkonnen survives. The Baron then manipulates Hawat into his service, by convincing Hawat that Lady Jessica was the traitor and using Hawat's desire for revenge on Lady Jessica and the Emperor as motivation to assist House Harkonnen.\n\nLeto and Jessica's son Paul Atreides flee into the desert with Jessica, and both are presumed dead. Paul's prescience helps him determine the identity of Jessica's father, the \"maternal grandfather who cannot be named\" — the Baron himself. Over the next two years, Harkonnen learns that his nephews Glossu Rabban and Feyd-Rautha are conspiring against him to usurp his throne; he lets them continue to do so, reasoning that they have to somehow learn to organize a conspiracy. As punishment for a failed assassination attempt against him, Harkonnen forces Feyd to single-handedly slaughter all the female slaves who serve as Feyd's lovers. He explains that Feyd has to learn the price of failure.\n\nThe Baron's plan to assure Feyd's power is to install him as ruler of Arrakis after a period of tyrannical misrule by Rabban, making Feyd appear to be the savior of the people. However, a crisis on Arrakis begins when the mysterious Muad'Dib emerges as a leader of the native Fremen tribes against the rule of the Harkonnens. Eventually, a series of Fremen victories against Beast Rabban threaten to disrupt the trade of the spice. The Padishah Emperor Shaddam IV decides to intervene himself and arrives on Arrakis along with legions of Sardaukar forces.  Shaddam and the Baron are shocked to learn that Muad'Dib is, of course, a very-much-alive Paul Atreides. The Imperial forces fall prey to a surprise attack by the Fremen.  Part of the Fremen/Atreides strategy is to wait until a sandstorm shorts out the force field shields of the Harkonnen/Imperial transport ships, disable them with projectile weapons, and then attack with a vast assault force, using sandworms under cover of the severe weather to break the enemy lines.  The Sardaukar and Harkonnen forces are trapped on the planet, astonished at the sandworm mounts and vast numbers of their attackers. Their past ruthlessness gives them little hope of quarter from the enraged Fremen.\n\nRabban dies in the initial part of the battle; the Harkonnen army is massacred to the last man and almost all the Imperial Sardaukar are killed. Baron Harkonnen himself is poisoned with a gom jabbar by Paul's young sister Alia Atreides, his own granddaughter, and dies at the age of 83, with the latter also revealing her direct lineage to him just beforehand. Paul then kills Feyd in ritual combat. House Harkonnen's virtual extermination removes it as a galactic power, but Paul's ascension to the Imperial throne in Shaddam's place guarantees that Vladimir's descendants will long reign as the Imperial House Atreides.\n\nChildren of Dune \n\nAlia had been born with her ancestral memories in the womb, a circumstance the Bene Gesserit refer to as Abomination, because in their experience it is inevitable that the individual will become possessed by the personality of one of their ancestors. In Children of Dune, Alia falls victim to this prediction when she shares control of her body with the ego-memory of the Baron Harkonnen, and eventually falls under his power. Alia eventually commits suicide, realizing that Harkonnen's consciousness has surpassed her abilities to contain him.\n\nPrelude to Dune \n\nIn the Prelude to Dune prequel series by Brian Herbert and Anderson, it is established that Baron Vladimir Harkonnen is the son and heir of Dmitri Harkonnen and his wife Victoria. Harkonnen's father had been the head of House Harkonnen and ruled the planet Giedi Prime. Trained since youth as a possible successor,  Vladimir had been eventually chosen over his half-brother Abulurd (namesake of the original). Unhappy with his brother's doings, Abulurd eventually marries Emmi Rabban and renounces the family name and his rights to the title. Under the name Abulurd Rabban, he reigns as governor of the secondary Harkonnen planet Lankiveil. Abulurd and his wife have two sons: Glossu Rabban (later nicknamed \"Beast Rabban\" after he murders his own father) and Feyd-Rautha; Vladimir later adopts the boys back into House Harkonnen, and Feyd becomes his designated heir.\n\nThe Baron's most prominent political rival is Duke Leto Atreides; the Harkonnens and the Atreides have been bitter enemies for millennia, since the Battle of Corrin that ended the Butlerian Jihad. When Emperor Shaddam IV orchestrates a plot to destroy the \"Red Duke\" Leto, the Baron eagerly lends his aid.\n\nThe young Baron Vladimir is described as an exceedingly handsome man, possessing red hair and a near-perfect physique. The Bene Gesserit Reverend Mother Gaius Helen Mohiam is instructed by the Sisterhood to collect the genetic material of Baron Vladimir Harkonnen (through conception) for their breeding program.  As the Baron's homosexuality is something of an open secret, Mohiam blackmails him into having sexual relations with her and conceives his child.  When that daughter proves genetically undesirable, Mohiam kills her and returns to Harkonnen for a second try; at this point he drugs and viciously rapes her.  She exacts her retribution by infecting him with a rare, incurable disease that later causes his obesity.  Mohiam's second child with the Baron is Jessica.According to the authors, the revelation that Mohiam is Jessica's mother was pulled directly from Frank Herbert's working notes for the original Dune series. See: \n\nIn Dune: House Harkonnen, the deteriorating Baron at first walks with the assistance of a cane, then relies on belt-mounted suspensors to retain mobility. He consults numerous doctors in the expanse of time between the Dune: House Atreides and Dune: House Harkonnen, up to and including his future instrument Dr. Yueh, all of whom are ultimately no help.  To conceal this debilitation, he pretends that his obesity is due to intentional overindulgence, lest the Landsraad remove him from power. When he determines that Mohiam inflicted him with the disease, he attempts to coerce her into revealing the cure, but soon discovers that there is none.\n\nThe Baron, Duke Leto, and Jessica herself are unaware that Jessica is secretly the Baron's daughter or that he has even fathered one; in the year 10,176, the Baron's grandson Paul is born to Leto and Jessica.\n\nHunters of Dune \n\nIn Hunters of Dune (2006), the continuation of the original series by Brian Herbert and Kevin J. Anderson, the Baron is resurrected as a ghola (5,029 years after the death of Alia) by the Lost Tleilaxu Uxtal, acting on orders from the Face Dancer Khrone. Khrone intends to use the Baron ghola to manipulate a ghola of Paul Atreides, named Paolo. Khrone tries various torture techniques for three years to awaken the 12-year-old Baron's genetic memories; these methods fail due to the Baron's sadomasochistic nature. Khrone is successful when he imprisons the Baron in a sensory deprivation tank for a prolonged period; the Baron's memories of his former life return. Ironically, the reincarnated Baron is soon haunted by the voice of Alia in his mind; the source of this inner Alia is never explained.\n\nIn adaptations\n\nIn David Lynch's 1984 film, Baron Harkonnen was portrayed by Kenneth McMillan. In this characterization, he is grotesquely overweight, dressed in filthy garments and covered in large, black pustules which require constant draining and treatment. This version of the character is more overtly unstable than in the novel, screaming and laughing incoherently at any given moment and even drinking the blood of a servant after removing a \"heart plug.\" Diverging from the novel, after Alia pricks Harkonnen with the gom jabbar, she pushes him and sends him flying through a hole in the palace wall, to be devoured by a giant sandworm.\n\nBritish actor Ian McNeice's interpretation of the Baron in the 2000 Sci-Fi Channel miniseries Frank Herbert's Dune (and its sequel, 2003's Children of Dune) is, though dramatic, somewhat lighter, more eloquent and sane in comparison to Lynch's version, and therefore more consistent with the novel. Though the Baron still takes sadistic enjoyment in the suffering of others, he is portrayed as somewhat flamboyant, pompous, calculating and self-indulgent, with a tendency to speak in iambic pentameter when the mood strikes him.\n\nThough Herbert's novel Dune seems to describe Harkonnen's suspensor belt as simply enabling him to stand and walk upright rather than actually \"fly,\" both the 1984 film and the 2000 miniseries feature the Baron utilizing the suspensors to levitate off the ground and float through the air in a flying-like manner.  The later Prelude to Dune prequels also employ this floating ability. Herbert does, however, note Harkonnen floating slightly off the floor after he is killed.From Dune: \"He rolled sideways in his suspensors, a sagging mass of flesh supported inches off the floor with head lolling and mouth hanging open.\"\n\nOther media\n\nThe video game Emperor: Battle for Dune, whose in-game cut scenes are visually inspired by David Lynch's film, features a character named Baron Rakan Harkonnen, portrayed by Mike McShane. This Harkonnen is nearly identical to the film's version of Vladimir in both appearance (minus the belt-mounted suspensors) and personality, and also dies by poisoning.\n\nH. R. Giger's Harkonnen Capo Chair is a chair originally designed by the artist as set dressing for an unrealized 1970s adaptation of Dune by Alejandro Jodorowsky. \n\nNotes and references",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Vladimir Harkonnen" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7901" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Baron Vladimir Harkonnen is a fictional character and antagonist from the Dune universe created by Frank Herbert. He is primarily featured in the 1965 novel Dune and is also a prominent character in the Prelude to Dune prequel trilogy (1999-2001) by Brian Herbert and Kevin J. Anderson. The character is brought back as a ghola in the Herbert/Anderson sequels which conclude the original series, Hunters of Dune (2006) and Sandworms of Dune (2007).\n\nConception\n\nFrank Herbert wanted a harsh-sounding name for the antagonists of his novel, Dune. Herbert came across the name \"Härkönen\" in a California telephone book and thought that it sounded \"Soviet\" (it is in fact Finnish), which touched a nerve with Cold War-era readers. In earlier drafts of his novel, the lead villain was called \"Valdemar Hoskanner\".Spice Planet by Brian Herbert and Kevin J. Anderson, based on an outline by Frank Herbert.  Published in The Road to Dune (Hodder & Stoughton, 2005)\n\nCharacteristics\n\nHerbert's \"Appendix IV: The Almanak en-Ashraf (Selected Excerpts of the Noble Houses)\" in Dune says of Harkonnen (in part):\n\nIn Dune, Herbert writes that the Baron possesses a \"basso voice\" and is so \"grossly and immensely fat\" that he requires anti-gravity devices known as suspensors to support his weight.From Dune: \"As [Baron Vladimir Harkonnen] emerged from the shadows, his figure took on dimension — grossly and immensely fat. And with subtle bulges beneath folds of his dark robes to reveal that all this fat was sustained partly by portable suspensors harnessed to his flesh. He might weigh two hundred Standard kilos in actuality, but his feet would carry no more than fifty of them.\"\n\nAs ruthless and cruel as he is intelligent and cunning, the Baron has a talent for manipulating others and exploiting their weaknesses. His sexual preference for young men is implied in Dune and Children of Dune.From Dune: \"I'll be in my sleeping chambers,\" the Baron said. \"Bring me that young fellow we bought on Gamont, the one with the lovely eyes. Drug him well. I don't feel like wrestling.\"From Dune: \"Why haven't you ever bought a Bene Gesserit, Uncle?\" Feyd-Rautha asked. \"With a Truthsayer at your side —\" \"You know my tastes!\" the Baron snapped.The Baron says to Feyd in Dune: \"This old fool saw through the shielded needle you'd planted in that slave boy's thigh. Right where I'd put my hand on it, eh?\" It is noted, however, that he \"once permitted himself to be seduced\" in the liaison which produced his secret daughter.Paul says to Jessica in Dune, \"And, mother mine, there's a thing you don't know and should — we are Harkonnens ... take my word for it. I've walked the future, I've looked at a record, I've seen a place, I have all the data. We're Harkonnens ... You're the Baron's own daughter,\" he said, and watched the way she pressed her hands to her mouth. \"The Baron sampled many pleasures in his youth, and once permitted himself to be seduced. But it was for the genetic purposes of the Bene Gesserit, by one of you.\"\n\nPlotlines \n\nDune \n\nAs Dune begins, a longstanding feud exists between the Harkonnens of Giedi Prime and the Atreides of Caladan. The Baron's intent to exterminate the Atreides line seems close to fruition as Duke Leto Atreides is lured to the desert planet Arrakis on the pretense of taking over the valuable melange operation there. The Baron has an agent in the Atreides household: Leto's own physician, the trusted Suk doctor Wellington Yueh. Though Suk Imperial Conditioning supposedly makes the subject incapable of inflicting harm, the Baron's twisted Mentat Piter De Vries notes:\n\nThe Baron has taken Yueh's wife Wanna prisoner, threatening her with interminable torture unless Yueh complies with his demands. Harkonnen also distracts Leto's Mentat Thufir Hawat from discovering Yueh by guiding Hawat toward another suspect: Leto's Bene Gesserit concubine Lady Jessica, of whom Hawat is already distrustful. The Atreides are soon attacked by Harkonnen forces (secretly supplemented by the seemingly unstoppable Imperial Sardaukar) as Yueh disables the protective shields around the Atreides palace on Arrakis. As instructed, Yueh takes Leto prisoner; however, desiring to slay the Baron, Yueh provides the captive Leto with a fake tooth filled with poisonous gas as a means of simultaneous assassination and suicide. De Vries kills Yueh but he also dies with Leto in the assassination attempt; however Harkonnen survives. The Baron then manipulates Hawat into his service, by convincing Hawat that Lady Jessica was the traitor and using Hawat's desire for revenge on Lady Jessica and the Emperor as motivation to assist House Harkonnen.\n\nLeto and Jessica's son Paul Atreides flee into the desert with Jessica, and both are presumed dead. Paul's prescience helps him determine the identity of Jessica's father, the \"maternal grandfather who cannot be named\" — the Baron himself. Over the next two years, Harkonnen learns that his nephews Glossu Rabban and Feyd-Rautha are conspiring against him to usurp his throne; he lets them continue to do so, reasoning that they have to somehow learn to organize a conspiracy. As punishment for a failed assassination attempt against him, Harkonnen forces Feyd to single-handedly slaughter all the female slaves who serve as Feyd's lovers. He explains that Feyd has to learn the price of failure.\n\nThe Baron's plan to assure Feyd's power is to install him as ruler of Arrakis after a period of tyrannical misrule by Rabban, making Feyd appear to be the savior of the people. However, a crisis on Arrakis begins when the mysterious Muad'Dib emerges as a leader of the native Fremen tribes against the rule of the Harkonnens. Eventually, a series of Fremen victories against Beast Rabban threaten to disrupt the trade of the spice. The Padishah Emperor Shaddam IV decides to intervene himself and arrives on Arrakis along with legions of Sardaukar forces.  Shaddam and the Baron are shocked to learn that Muad'Dib is, of course, a very-much-alive Paul Atreides. The Imperial forces fall prey to a surprise attack by the Fremen.  Part of the Fremen/Atreides strategy is to wait until a sandstorm shorts out the force field shields of the Harkonnen/Imperial transport ships, disable them with projectile weapons, and then attack with a vast assault force, using sandworms under cover of the severe weather to break the enemy lines.  The Sardaukar and Harkonnen forces are trapped on the planet, astonished at the sandworm mounts and vast numbers of their attackers. Their past ruthlessness gives them little hope of quarter from the enraged Fremen.\n\nRabban dies in the initial part of the battle; the Harkonnen army is massacred to the last man and almost all the Imperial Sardaukar are killed. Baron Harkonnen himself is poisoned with a gom jabbar by Paul's young sister Alia Atreides, his own granddaughter, and dies at the age of 83, with the latter also revealing her direct lineage to him just beforehand. Paul then kills Feyd in ritual combat. House Harkonnen's virtual extermination removes it as a galactic power, but Paul's ascension to the Imperial throne in Shaddam's place guarantees that Vladimir's descendants will long reign as the Imperial House Atreides.\n\nChildren of Dune \n\nAlia had been born with her ancestral memories in the womb, a circumstance the Bene Gesserit refer to as Abomination, because in their experience it is inevitable that the individual will become possessed by the personality of one of their ancestors. In Children of Dune, Alia falls victim to this prediction when she shares control of her body with the ego-memory of the Baron Harkonnen, and eventually falls under his power. Alia eventually commits suicide, realizing that Harkonnen's consciousness has surpassed her abilities to contain him.\n\nPrelude to Dune \n\nIn the Prelude to Dune prequel series by Brian Herbert and Anderson, it is established that Baron Vladimir Harkonnen is the son and heir of Dmitri Harkonnen and his wife Victoria. Harkonnen's father had been the head of House Harkonnen and ruled the planet Giedi Prime. Trained since youth as a possible successor,  Vladimir had been eventually chosen over his half-brother Abulurd (namesake of the original). Unhappy with his brother's doings, Abulurd eventually marries Emmi Rabban and renounces the family name and his rights to the title. Under the name Abulurd Rabban, he reigns as governor of the secondary Harkonnen planet Lankiveil. Abulurd and his wife have two sons: Glossu Rabban (later nicknamed \"Beast Rabban\" after he murders his own father) and Feyd-Rautha; Vladimir later adopts the boys back into House Harkonnen, and Feyd becomes his designated heir.\n\nThe Baron's most prominent political rival is Duke Leto Atreides; the Harkonnens and the Atreides have been bitter enemies for millennia, since the Battle of Corrin that ended the Butlerian Jihad. When Emperor Shaddam IV orchestrates a plot to destroy the \"Red Duke\" Leto, the Baron eagerly lends his aid.\n\nThe young Baron Vladimir is described as an exceedingly handsome man, possessing red hair and a near-perfect physique. The Bene Gesserit Reverend Mother Gaius Helen Mohiam is instructed by the Sisterhood to collect the genetic material of Baron Vladimir Harkonnen (through conception) for their breeding program.  As the Baron's homosexuality is something of an open secret, Mohiam blackmails him into having sexual relations with her and conceives his child.  When that daughter proves genetically undesirable, Mohiam kills her and returns to Harkonnen for a second try; at this point he drugs and viciously rapes her.  She exacts her retribution by infecting him with a rare, incurable disease that later causes his obesity.  Mohiam's second child with the Baron is Jessica.According to the authors, the revelation that Mohiam is Jessica's mother was pulled directly from Frank Herbert's working notes for the original Dune series. See: \n\nIn Dune: House Harkonnen, the deteriorating Baron at first walks with the assistance of a cane, then relies on belt-mounted suspensors to retain mobility. He consults numerous doctors in the expanse of time between the Dune: House Atreides and Dune: House Harkonnen, up to and including his future instrument Dr. Yueh, all of whom are ultimately no help.  To conceal this debilitation, he pretends that his obesity is due to intentional overindulgence, lest the Landsraad remove him from power. When he determines that Mohiam inflicted him with the disease, he attempts to coerce her into revealing the cure, but soon discovers that there is none.\n\nThe Baron, Duke Leto, and Jessica herself are unaware that Jessica is secretly the Baron's daughter or that he has even fathered one; in the year 10,176, the Baron's grandson Paul is born to Leto and Jessica.\n\nHunters of Dune \n\nIn Hunters of Dune (2006), the continuation of the original series by Brian Herbert and Kevin J. Anderson, the Baron is resurrected as a ghola (5,029 years after the death of Alia) by the Lost Tleilaxu Uxtal, acting on orders from the Face Dancer Khrone. Khrone intends to use the Baron ghola to manipulate a ghola of Paul Atreides, named Paolo. Khrone tries various torture techniques for three years to awaken the 12-year-old Baron's genetic memories; these methods fail due to the Baron's sadomasochistic nature. Khrone is successful when he imprisons the Baron in a sensory deprivation tank for a prolonged period; the Baron's memories of his former life return. Ironically, the reincarnated Baron is soon haunted by the voice of Alia in his mind; the source of this inner Alia is never explained.\n\nIn adaptations\n\nIn David Lynch's 1984 film, Baron Harkonnen was portrayed by Kenneth McMillan. In this characterization, he is grotesquely overweight, dressed in filthy garments and covered in large, black pustules which require constant draining and treatment. This version of the character is more overtly unstable than in the novel, screaming and laughing incoherently at any given moment and even drinking the blood of a servant after removing a \"heart plug.\" Diverging from the novel, after Alia pricks Harkonnen with the gom jabbar, she pushes him and sends him flying through a hole in the palace wall, to be devoured by a giant sandworm.\n\nBritish actor Ian McNeice's interpretation of the Baron in the 2000 Sci-Fi Channel miniseries Frank Herbert's Dune (and its sequel, 2003's Children of Dune) is, though dramatic, somewhat lighter, more eloquent and sane in comparison to Lynch's version, and therefore more consistent with the novel. Though the Baron still takes sadistic enjoyment in the suffering of others, he is portrayed as somewhat flamboyant, pompous, calculating and self-indulgent, with a tendency to speak in iambic pentameter when the mood strikes him.\n\nThough Herbert's novel Dune seems to describe Harkonnen's suspensor belt as simply enabling him to stand and walk upright rather than actually \"fly,\" both the 1984 film and the 2000 miniseries feature the Baron utilizing the suspensors to levitate off the ground and float through the air in a flying-like manner.  The later Prelude to Dune prequels also employ this floating ability. Herbert does, however, note Harkonnen floating slightly off the floor after he is killed.From Dune: \"He rolled sideways in his suspensors, a sagging mass of flesh supported inches off the floor with head lolling and mouth hanging open.\"\n\nOther media\n\nThe video game Emperor: Battle for Dune, whose in-game cut scenes are visually inspired by David Lynch's film, features a character named Baron Rakan Harkonnen, portrayed by Mike McShane. This Harkonnen is nearly identical to the film's version of Vladimir in both appearance (minus the belt-mounted suspensors) and personality, and also dies by poisoning.\n\nH. R. Giger's Harkonnen Capo Chair is a chair originally designed by the artist as set dressing for an unrealized 1970s adaptation of Dune by Alejandro Jodorowsky. \n\nNotes and references. Vladimir Harkonnen. http://en.wikipedia.org/?curid=7901."
  }
}
