{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17454",
  "eid" : "2c333590-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778583401,
  "textBody" : "Kansas City is the largest city in Missouri, United States. According to the U.S. Census Bureau, the city had an estimated population of 481,420 in 2016, making it the 37th largest city by population in the United States. It is the central city of the Kansas City metropolitan area, which straddles the Kansas–Missouri border. Kansas City was founded in the 1830s as a Missouri River port at its confluence with the Kansas River coming in from the west. On June 1, 1850 the town of Kansas was incorporated; shortly after came the establishment of the Kansas Territory. Confusion between the two ensued and the name Kansas City was assigned to distinguish them soon after.\n\nSitting on Missouri's western border, with Downtown near the confluence of the Kansas and Missouri rivers, the modern city encompasses some , making it the 23rd largest city by total area in the United States. Most of the city lies within Jackson County, but portions spill into Clay, Cass, and Platte counties. Along with Independence, it serves as one of the two county seats for Jackson County. Major suburbs include the Missouri cities of Independence and Lee's Summit and the Kansas cities of Overland Park, Olathe, and Kansas City.\n\nThe city is composed of several neighborhoods, including the River Market District in the north, the 18th and Vine District in the east, and the Country Club Plaza in the south. Kansas City is also known for its cuisine (including its distinctive style of barbecue) and its craft breweries.\n\nHistory\n\nKansas City, Missouri was incorporated as a town on June 1, 1850, and as a city on March 28, 1853. The territory straddling the border between Missouri and Kansas at the confluence of the Kansas and Missouri rivers was considered a good place to build settlements.\n\nThe Antioch Christian Church, Dr. James Compton House, and Woodneath are listed on the National Register of Historic Places.\n\nExploration and settlement\n\nThe first documented European visitor to Kansas City was Étienne de Veniard, Sieur de Bourgmont, who was also the first European to explore the lower Missouri River. Criticized for his response to the Native American attack on Fort Détroit, he had deserted his post as fort commander and was avoiding French authorities. Bourgmont lived with a Native American wife in a village about 90 mi east near Brunswick, Missouri, where he illegally traded furs.\n\nTo clear his name, he wrote Exact Description of Louisiana, of Its Harbors, Lands and Rivers, and Names of the Indian Tribes That Occupy It, and the Commerce and Advantages to Be Derived Therefrom for the Establishment of a Colony in 1713 followed in 1714 by The Route to Be Taken to Ascend the Missouri River. In the documents, he describes the junction of the \"Grande Riv[ière] des Cansez\" and Missouri River, making him the first to adopt those names. French cartographer Guillaume Delisle used the descriptions to make the area's first reasonably accurate map.\n\nThe Spanish took over the region in the Treaty of Paris in 1763, but were not to play a major role other than taxing and licensing Missouri River ship traffic. The French continued their fur trade under Spanish license. The Chouteau family operated under Spanish license at St. Louis in the lower Missouri Valley as early as 1765 and in 1821 the Chouteaus reached Kansas City, where François Chouteau established Chouteau's Landing.\n\nAfter the 1804 Louisiana Purchase, Lewis and Clark visited the confluence of the Kansas and Missouri rivers, noting it was a good place to build a fort. In 1831, a group of Mormons from New York settled in what would become the city. They built the first school within Kansas City's current boundaries, but were forced out by mob violence in 1833 and their settlement remained vacant.\n\nIn 1833 John McCoy established West Port along the Santa Fe Trail, 3 mi away from the river. In 1834 McCoy established Westport Landing on a bend in the Missouri to serve as a landing point for West Port. Soon after, the Kansas Town Company, a group of investors, began to settle the area, taking their name from an English spelling of \"Cansez.\" In 1850, the landing area was incorporated as the Town of Kansas.\n\nBy that time, the Town of Kansas, Westport and nearby Independence, had become critical points in the United States' westward expansion. Three major trails – the Santa Fe, California, and Oregon – all passed through Jackson County.\n\nOn February 22, 1853, the City of Kansas was created with a newly elected mayor. It had an area of  and a population of 2,500. The boundary lines at that time extended from the middle of the Missouri River south to what is now Ninth Street, and from Bluff Street on the west to a point between Holmes Road and Charlotte Street on the east.\n\nAmerican Civil War\n\nThe Kansas City area was rife with animosity just prior to the U.S. Civil War. Kansas successfully petitioned the U.S. to enter the Union as a free state that did not allow slavery under the new doctrine of popular sovereignty. Missouri had many slaves, and slavery sympathizers crossed into Kansas to sway the state towards allowing slavery, at first by ballot box and then by bloodshed.\n\nDuring the Civil War, the city and its immediate surroundings were the focus of intense military activity. Although the First Battle of Independence in August 1862 resulted in a Confederate States Army victory, the Confederates were unable to leverage their win in any significant fashion, as Kansas City was occupied by Union troops and proved too heavily fortified to assault. The Second Battle of Independence, which occurred on October 21–22, 1864 as part of Sterling Price's Missouri expedition of 1864, also resulted in a Confederate triumph. Once again their victory proved hollow, as Price was decisively defeated in the pivotal Battle of Westport the next day, effectively ending Confederate efforts to regain Missouri.\n\nGeneral Thomas Ewing, in response to a successful raid on nearby Lawrence, Kansas, led by William Quantrill, issued General Order No. 11, forcing the eviction of residents in four western Missouri counties – including Jackson – except those living in the city and nearby communities and those whose allegiance to the Union was certified by Ewing.\n\nPost-Civil War\n\nAfter the Civil War, Kansas City grew rapidly, largely losing its Southern identity. The selection of the city over Leavenworth, Kansas, for the Hannibal & St. Joseph Railroad bridge over the Missouri River brought about significant growth. The population exploded after 1869, when the Hannibal Bridge, designed by Octave Chanute, opened. The boom prompted a name change to Kansas City in 1889, and the city limits to be extended south and east. Westport became part of Kansas City on December 2, 1897. In 1900, Kansas City was the 22nd largest city in the country, with a population of 163,752 residents.\n\nKansas City, guided by architect George Kessler, became a forefront example of the City Beautiful movement, offering a network of boulevards and parks.\n\nThe relocation of Union Station to its current location in 1914 and the opening of the Liberty Memorial in 1923 provided two of the city's most identifiable landmarks. Robert A. Long, president of the Liberty Memorial Association, was a driving force in the funding for construction. Long was a longtime resident and wealthy businessman. He built the R.A. Long Building for the Long-Bell Lumber Company, his home, Corinthian Hall (now the Kansas City Museum) and Longview Farm.\n\nFurther spurring Kansas City's growth was the opening of the innovative Country Club Plaza development by J.C. Nichols in 1925, as part of his Country Club District plan.\n\nPendergast era\n\nAt the start of the 20th century, political machines gained clout in the city, with the one led by Tom Pendergast dominating the city by 1925. Several important buildings and structures were built during this time, including the Kansas City City Hall and the Jackson County Courthouse. The machine fell in 1939 when Pendergast, riddled with health problems, pleaded guilty to tax evasion after long federal investigations. His biographers have summed up Pendergast's uniqueness:\nPendergast may bear comparison to various big-city bosses, but his open alliance with hardened criminals, his cynical subversion of the democratic process, his monarchistic style of living, his increasingly insatiable gambling habit, his grasping for a business empire, and his promotion of Kansas City as a wide-open town with every kind of vice imaginable, combined with his professed compassion for the poor and very real role as city builder, made him bigger than life, difficult to characterize.\n\nPost–World War II\n\nKansas City's suburban development began with a streetcar system in the early decades of the 20th century. The city's first suburbs were in the neighborhoods of Pendleton Heights and Quality Hill. After World War II, many relatively affluent residents left for suburbs in Johnson County, Kansas, and eastern Jackson County, Missouri. Many also went north of the Missouri River, where Kansas City had incorporated areas between the 1940s and 1970s.\n\nIn 1950, African Americans represented 12.2% of Kansas City's population. The sprawling characteristics of the city and its environs today mainly took shape after 1960s race riots. The assassination of Martin Luther King, Jr. was a catalyst for the 1968 Kansas City riot. At this time, slums were forming in the inner city, and many who could afford to do so, left for the suburbs and outer edges of the city. The post-World War II idea of suburbs and the \"American Dream\" also contributed to the sprawl of the area. The city's population continued to grow, but the inner city declined. The city's most populous ethnic group, non-Hispanic whites, declined from 89.5% in 1930 to 54.9% in 2010.\n\nIn 1940, the city had about 400,000 residents; by 2000, the same area was home to only about 180,000. From 1940 to 1960, the city more than doubled its physical size, while increasing its population by only about 75,000. By 1970, the city covered approximately 316 sqmi, more than five times its size in 1940.\n\nThe Hyatt Regency walkway collapse was a major disaster that occurred on July 17, 1981, killing 114 people and injuring more than 200 others during a tea dance. At the time, it was the deadliest structural collapse in US history.\n\n21st century\n\nDowntown Kansas City development\n\nIn the 21st century, the Kansas City area has undergone extensive redevelopment, with over $6 billion in improvements to the downtown area on the Missouri side. One of the main goals is to attract convention and tourist dollars, office workers, and residents to downtown KCMO. Among the projects include the redevelopment of the Power & Light District, located in the area surrounding the Power & Light Building (the former headquarters of the Kansas City Power & Light Company, which is now based in the district's northern end), into a retail and entertainment district; and the Sprint Center, an 18,500-seat arena that opened in the district in 2007, which was funded by a 2004 ballot initiative involving a tax on car rentals and hotels, and was designed to meet the stadium specifications for a possible future NBA or NHL franchise. Kemper Arena, which was replaced by Sprint Center, fell into disrepair and was sold to private developers. By 2017, the arena was being converted to a sports complex under the name Mosiac Arena. The Kauffman Performing Arts Center opened in 2011 providing a new, modern home to the KC Orchestra and Ballet. In 2015, an 800-room Hyatt Convention Center Hotel was announced for a site next to the Performance Arts Center & Bartle Hall. Construction is expected to start in early 2018 with Loews as the operator.\n\nFrom 2007 to 2017, downtown residential population in Kansas City quadrupled and continues to grow. The area has grown from almost 4,000 residents in the early 2000s to nearly 30,000 as of 2017. Kansas City's downtown ranks as the 6th-fastest growing downtown in America with the population expected to grow by over 40% by 2022. Conversions of office buildings such as the Power and Light Building, Commerce Bank Tower, and others into residential and hotel space has helped to fulfill the demand. New apartment complexes like One, Two, and Three Lights, River Market West, 503 Main, and others have begun to reshape Kansas City's skyline. Strong demand has led to occupancy rates in the high 90%'s.\n\nWhile the residential population of downtown has boomed, the office population has dropped significantly from the early 2000s to the mid 2010s. AMC and other top employers moved their operations to modern office buildings in the suburbs. High office vacancy plagued downtown, leading to the neglect of many office buildings. By the mid 2010s, many office buildings were converted to residential uses and the Class A vacancy rate plunged to 12% in 2017. Swiss Re, Virgin Mobile, AutoAlert, and others have begun to move operations to downtown Kansas City from the suburbs as well as expensive coastal cities.\n\nTransportation Developments\n\nThe area has seen additional development through various transportation projects, including improvements to the Grandview Triangle, which intersects Interstates 435 and 470, and U.S. Route 71, a thoroughfare long notorious for fatal accidents.\n\nIn July 2005, the Kansas City Area Transportation Authority (KCATA) launched Kansas City's first bus rapid transit line, the Metro Area Express (MAX), which links the River Market, Downtown, Union Station, Crown Center and the Country Club Plaza. The KCATA continues to expand MAX with additional routes on Prospect Ave, Troost Ave, and Independence Ave.\n\nIn 2013, construction began on a two-mile streetcar line in downtown Kansas City (funded by a $102 million ballot initiative that was passed in 2012) that runs between the River Market and Union Station, it began operation in May 2016. In 2017, voters approved the formation of a TDD to expand the streetcar line south 3.5 miles from Union Station to UMKC's Volker Campus. Additionally in 2017, the KC Port Authority began engineering studies for a Port Authority funded streetcar expansion north to Berkley Riverfront Park. City Wide, voter support for rail projects continues to grow with numerous light rail projects in the works.\n\nIn 2016, Jackson County, Missouri acquired unused rail lines as part of a long term commuter rail plan. For the time being, the line is being converted to a trail while county officials negotiate with railroads for access to tracks in Downtown Kansas City.\n\nOn November 7, 2017, Kansas City, Missouri voters overwhelmingly approved a new single terminal at Kansas City International Airport by a 75% to 25% margin. The New Single Terminal will replace the 3 existing \"Clover Leafs\" at KCI Airport and is expected to open in 2021.\n\nGeography\n\nThe city has an area of , of which,  is land and  is water. Bluffs overlook the rivers and river bottom areas. Kansas City proper is bowl-shaped and is surrounded to the north and south by glacier-carved limestone and bedrock cliffs. Kansas City is at the junction between the Dakota and Minnesota ice lobes during the maximum late Independence glaciation of the Pleistocene epoch. The Kansas and Missouri rivers cut wide valleys into the terrain when the glaciers melted and drained. A partially filled spillway valley crosses the central city. This valley is an eastward continuation of the Turkey Creek Valley. It is the closest major city to the geographic center of the contiguous United States, or \"Lower 48\".\n\nCityscape\n\nKansas City, Missouri, comprises more than 240[http://www.kcmo.org/planning/pdf/focus/Neighborhood_Assessment_Reports/neighborhoodtypes.pdf ]  neighborhoods, some with histories as independent cities or as the sites of major events.\n\nFile:Kansas City Skyline 2.JPG|View of Union Station and the Sprint Center\n\nArchitecture\n\nThe Nelson-Atkins Museum opened its Euro-Style Bloch addition in 2007, and the Safdie-designed Kauffman Center for the Performing Arts opened in 2011. The Power and Light Building is influenced by the Art Deco style and sports a glowing sky beacon. The new world headquarters of H&R Block is a 20-story all-glass oval bathed in a soft green light. The four industrial artworks atop the support towers of the Kansas City Convention Center (Bartle Hall) were once the subject of ridicule, but now define the night skyline near the new Sprint Center along with One Kansas City Place (Missouri's tallest office tower), the KCTV-Tower (Missouri's tallest freestanding structure) and the Liberty Memorial, a World War I memorial and museum that flaunts simulated flames and smoke billowing into the night skyline. It was designated as the National World War I Museum and Memorial in 2004 by the United States Congress. Kansas City is home to significant national and international architecture firms including ACI Boland, BNIM, 360 Architecture, HNTB, Populous. Frank Lloyd Wright designed two private residences and Community Christian Church there.\n\nKansas City hosts over 200 working fountains. Notable examples are on the Country Club Plaza. Designs range from French-inspired traditional to modern. Highlights include the Black Marble H&R Block fountain in front of Union Station, which features synchronized water jets; the Nichols Bronze Horses at the corner of Main and J.C. Nichols Parkway at the entrance to the Plaza Shopping District; and the fountain at Hallmark Cards World Headquarters in Crown Center.\n\nCity Market\n\nSince its inception in 1857, City Market has been one of the largest and most enduring public farmers' markets in the American Midwest, linking growers and small businesses to the community. More than 30 full-time merchants operate year-round and offer specialty foods, fresh meats and seafood, restaurants and cafes, floral, home accessories and more. The City Market is also home to the Arabia Steamboat Museum, which houses artifacts from a steamboat that sank near Kansas City in 1856.\n\nDowntown\n\nDowntown Kansas City is an area of  bounded by the Missouri River to the north, 31st Street to the south, Troost Avenue to the East, and State Line Road to the west. Areas near Downtown Kansas City include the 39th Street District, which is known as Restaurant Row, and features one of Kansas City's largest selections of independently owned restaurants and boutique shops. It is a center of literary and visual arts, and bohemian culture. Crown Center is the headquarters of Hallmark Cards and a major downtown shopping and entertainment complex. It is connected to Union Station by a series of covered walkways. The Country Club Plaza, or simply \"the Plaza\", is an upscale, outdoor shopping and entertainment district. It was the first suburban shopping district in the United States,[http://www.countryclubplaza.com/plaza.aspx?pgID=893 \"A walk through Kansas City history\"] , Country Club Plaza website (online) designed to accommodate shoppers arriving by automobile, and is surrounded by apartments and condominiums, including a number of high rise buildings. The associated Country Club District to the south includes the Sunset Hill and Brookside neighborhoods, and is traversed by Ward Parkway, a landscaped boulevard known for its statuary, fountains and large, historic homes. Kansas City's Union Station is home to Science City, restaurants, shopping, theaters, and the city's Amtrak facility.After years of neglect and seas of parking lots, Downtown Kansas City is undergoing a period of change with over $6 billion in development since 2000. Many residential properties recently have been or are under redevelopment in three surrounding warehouse loft districts and the Central Business District. The Power & Light District, a new, nine-block entertainment district comprising numerous restaurants, bars, and retail shops, was developed by the Cordish Company of Baltimore, Maryland. Its first tenant opened on November 9, 2007. It is anchored by the Sprint Center, a 19,000-seat sports and entertainment complex.http://www.sprintcenter.com/news/detail/sprint_center_announces_grand_opening_week_festivities\n\nClimate\n\nKansas City lies in the Midwestern United States, as well as near the geographic center of the country, at the confluence of the longest river in the country, the Missouri River, and the Kansas River (also known as the Kaw River). The city lies in the northern periphery of the humid subtropical zone. but is interchangeable with the humid continental climate due to roughly 104 air frosts on average per annum. The city is part of USDA plant hardiness zones 5b and 6a. In the center of North America, far removed from a significant body of water, there is significant potential for extreme hot and cold swings all year long. Unless otherwise stated, normal figures below are based on 1981–2010 data at Downtown Airport. The year's warmest month is July, with a 24-hour average temperature of . The summer months are hot and humid, with moist air riding up from the Gulf of Mexico, and high temperatures surpass 100 °F on 5.6 days of the year, and 90 °F on 47 days.\n The coldest month of the year is January, with an average temperature of . Winters are cold, with 22 days where the high temperature is at or below  and 2.5 nights with a low at or below 0 °F. The official record highest temperature is 113 °F, set on August 14, 1936 at Downtown Airport, while the official record lowest is , set on December 22 and 23, 1989. Normal seasonal snowfall is  at Downtown Airport and  at Kansas City International Airport. The average window for freezing temperatures is October 31 to April 4, while for measurable () snowfall, it is November 27 to March 16 as measured at Kansas City International Airport. Precipitation, both in frequency and total accumulation, shows a marked uptick in late spring and summer.\n\nKansas City is on the edge of the \"Tornado Alley\", a broad region where cold air from the Rocky Mountains in Canada collides with warm air from the Gulf of Mexico, leading to the formation of powerful storms, especially during the spring. A few areas of the Kansas City metropolitan area have had some severe outbreaks of tornadoes at different points in the past, including the Ruskin Heights tornado in 1957,[http://www.wdaftv4.com/almanac/watorndo.html Kansas City Tornado Almanac] , wdaftv4.com. Retrieved September 2006. and the May 2003 tornado outbreak sequence. The region can also fall victim to the sporadic ice storm during the winter months, such as the 2002 ice storm during which hundreds of thousands of residents lost power for days and (in some cases) weeks.[http://www.kansascity.com/mld/kansascity/news/special_packages/star_history/calamities_crime/12508862.htm KC powerless as icy barrage pummels the area, leaves behind disaster zone]. Retrieved September 10, 2006. Kansas City and its outlying areas are also subject to flooding, including the Great Floods of 1951 and 1993.\n\nDemographics\n\nAccording to the 2010 census, the racial composition of Kansas City was as follows:\n* White: 59.2% (non-Hispanic white: 54.9%)\n* Black or African American: 29.9%\n* Hispanic or Latino (of any race): 10.0%\n* Some other race: 4.5% (primarily Latino)\n* Two or more races: 3.2%\n* Asian: 2.5%\n* Native American: 0.5%\n* Native Hawaiian and other Pacific Islander: 0.2%\n\nKansas City has the second largest Sudanese and Somali populations in the United States. The Latino/Hispanic population of Kansas City, which is heavily Mexican and Central American, is spread throughout the metropolitan area, with some concentration in the northeast part of the city and southwest of downtown. The Asian population, mostly Southeast Asian, is partly concentrated within the northeast side to the Columbus Park neighborhood in the Greater Downtown area, a historical Italian American neighborhood, the UMKC area and in River Market, in northern Kansas City.\n\nThe Historic Kansas City boundary is roughly 58 sqmi and has a population density of about 5,000 people per sq. mi. It runs from the Missouri River to the north, 79th Street to the south, the Blue River to the east, and State Line Road to the west. During the 1960s and 1970s, Kansas City annexed large amounts of land, which are largely undeveloped to this day.\n\nBetween the 2000 and 2010 Census counts, the urban core of Kansas City continued to drop significantly in population. The areas of Greater Downtown in the center city, and sections near I-435 and I-470 in the south, and Highway 152 in the north are the only areas of Kansas City, Missouri, to have seen an increase in population, with the Northland seeing the greatest population growth.\n\nEconomy\n\nThe federal government is the largest employer in the Kansas City metro area. More than 146 federal agencies maintain a presence there. Kansas City is one of ten regional office cities for the US government.The Federal Workforce by the Numbers – Kansas City. Greater Kansas City Federal Executive Board. 2011. The Internal Revenue Service maintains a large service center in Kansas City that occupies nearly 1400000 sqft. It is one of only two sites to process paper returns. The IRS has approximately 2,700 full-time employees in Kansas City, growing to 4,000 during tax season. The General Services Administration has more than 800 employees. Most are at the Bannister Federal Complex in South Kansas City. The Bannister Complex is also home to the Kansas City Plant, which is a National Nuclear Security Administration facility operated by Honeywell. Honeywell employs nearly 2,700 at the Kansas City Plant, which produces and assembles 85% of the non-nuclear components of the United States nuclear bomb arsenal. The Social Security Administration has more than 1,700 employees in the Kansas City area, with more than 1,200 at its downtown Mid-America Program Service Center (MAMPSC). The United States Postal Service operates post offices in Kansas City. The Kansas City Main Post Office is at 300 West Pershing Road.\"[http://usps.whitepages.com/service/post_office/52521?p1&s\nMO&service_namepost_office&z\nKansas+City Post Office Location – Kansas City] .\" United States Postal Service. Retrieved on May 5, 2009.\n\nFord Motor Company operates a large manufacturing facility in Claycomo at the Ford Kansas City Assembly Plant, which builds the Ford F-150. The General Motors Fairfax Assembly Plant is in adjacent Kansas City, Kansas. Smith Electric Vehicles builds electric vehicles in the former TWA/American Airlines overhaul facility at Kansas City International Airport.\n\nOne of the largest US drug manufacturing plants is the Sanofi-Aventis plant in south Kansas City on a campus developed by Ewing Kauffman's Marion Laboratories. Of late, it has been developing academic and economic institutions related to animal health sciences, an effort most recently bolstered by the selection of Manhattan, Kansas, at one end of the[http://www.kansascity.com/105/story/921286.html Kansas City Star – Kansas Tops List for Biodefense Lab]  Kansas City Animal Health Corridor, as the site for the National Bio and Agro-Defense Facility, which researches animal diseases.\n\nNumerous agriculture companies operate out of the city. Dairy Farmers of America, the largest dairy co-op in the United States is located in northern Kansas City. Kansas City Board of Trade is the principal trading exchange for hard red winter wheat, the principal ingredient of bread. The National Association of Intercollegiate Athletics and The National Association of Basketball Coaches are based in Kansas City.\n\nThe business community is serviced by two major business magazines, the Kansas City Business Journal (published weekly) and Ingram's Magazine (published monthly), as well as other publications, including a local society journal, the Independent (published weekly).\n\nThe Kansas City Federal Reserve Bank built a new building that opened in 2008 near Union Station. Missouri is the only state to have two of the 12 Federal Reserve Bank headquarters (the second is in St. Louis). Kansas City's effort to get the bank was helped by former mayor James A. Reed, who as senator, broke a tie to pass the Federal Reserve Act.[http://stlouisfed.org/publications/foregone/chapter_three.htm A Foregone Conclusion: The Founding of the Federal Reserve Bank of St. Louis by James Neal Primm – stlouisfed.org – Retrieved January 1, 2007].\n\nThe national headquarters for the Veterans of Foreign Wars is headquartered just south of Downtown.\n\nWith a Gross Metropolitan Product of $41.68 billion in 2004, Kansas City's (Missouri side only) economy makes up 20.5% of Missouri's gross state product. In 2014, Kansas City was ranked #6 for real estate investment.Roberts, Rob.\" KC ranks among best places to own rental property.\" Kansas City Business Journal. February 2, 2014.\n\nThree international law firms, Lathrop & Gage, Stinson Leonard Street, and Shook, Hardy & Bacon are based in the city.\n\nHeadquarters\n\nThe following notable companies are headquartered in Kansas City, Missouri:\n\nTop employers\n\nAccording to the city's Fiscal Year 2014-15 Comprehensive Annual Financial Report, the top ten principal employers are as follows:\n\nCulture\n\nAbbreviations and nicknames\n\nKansas City is often abbreviated as KC (abbreviations often refer to the metropolitan area). It is officially nicknamed the \"City of Fountains\". The fountains at Kauffman Stadium, commissioned by original Kansas City Royals owner Ewing Kauffman, are the largest privately funded fountains in the world. The city has more boulevards than any other city except Paris and has been called \"Paris of the Plains\". Soccer's popularity, at both professional and youth levels, as well as Children's Mercy Park's popularity as a home stadium for the U.S. Men's National Team has to the appellation as the \" Soccer Capital of America\". Residents are known as Kansas Citians. The city is sometimes referred to as the \"Heart of America\", as it is near both the population center of the United States and the geographic center of the 48 contiguous states.\n\nPerforming arts\n\nThe Kansas City Repertory Theatre is the metropolitan area's top professional theatre company. The Starlight Theatre is an 8,105-seat outdoor theatre designed by Edward Delk. The Kansas City Symphony was founded by R. Crosby Kemper Jr. in 1982 to replace the defunct Kansas City Philharmonic, which was founded in 1933. The symphony performs at the Kauffman Center for the Performing Arts. Michael Stern is the symphony's music director and lead conductor. Lyric Opera of Kansas City, founded in 1958, performs at the Kauffman Center, offers one American contemporary opera production during its season, consisting of either four or five productions. The Civic Opera Theater of Kansas City performs at the downtown Folly Theater and at the UMKC Performing Arts Center. Every summer from mid-June to early July, The Heart of America Shakespeare Festival performs at Southmoreland Park near the Nelson-Atkins Museum; the festival was founded by Marilyn Strauss in 1993.\n\nThe Kansas City Ballet, founded in 1957 by Tatiana Dokoudovska, is a ballet troupe comprising 25 professional dancers and apprentices. Between 1986 and 2000, it combined with Dance St. Louis to form the State Ballet of Missouri, although it remained in Kansas City. From 1980 to 1995, the Ballet was run by dancer and choreographer Todd Bolender. Today, the Ballet offers an annual repertory split into three seasons, performing classical to contemporary ballets.Deborah Jowitt, [http://www.villagevoice.com/dance/0812,kansas-city-ballet-happy-fiftieth,381145,14.html Kansas City Ballet: Happy Fiftieth!] , The Village Voice, March 18, 2008 The Ballet also performs at the Kauffman Center. Kansas City is home to The Kansas City Chorale, a professional 24-voice chorus conducted by Charles Bruffy. The chorus performs an annual concert series and a concert in Phoenix each year with their sister choir, the Phoenix Chorale. The Chorale has made nine recordings (three with the Phoenix Chorale).\n\nKansas City jazz in the 1930s marked the transition from big bands to the bebop influence of the 1940s. The 1979 documentary The Last of the Blue Devils portrays this era in interviews and performances by local jazz notables. In the 1970s, Kansas City attempted to resurrect the glory of the jazz era in a family-friendly atmosphere. In the 1970s, an effort to open jazz clubs in the River Quay area of City Market along the Missouri ended in a gang war. Three of the new clubs were blown up in what ultimately ended Kansas City mob influence in Las Vegas casinos. The annual \"Kansas City Blues and Jazz Festival\" attracts top jazz stars and large out-of-town audiences. It was rated Kansas City's \"best festival.\" by Pitch.com.\n\nLive music venues are found throughout the city, with the highest concentration in the Westport entertainment district centered on Broadway and Westport Road near the Country Club Plaza, as well as the 18th & Vine area (jazz music). A variety of music genres can be heard and have originated there, including musicians Janelle Monáe, Puddle of Mudd, Isaac James, The Get Up Kids, Shiner, Flee The Seen, The Life and Times, Reggie and the Full Effect, Coalesce, The Casket Lottery, The Gadjits, The Rainmakers, Vedera, The Elders, Blackpool Lights, The Republic Tigers, Tech N9ne, Krizz Kaliko, Kutt Calhoun, Skatterman & Snug Brim, Mac Lethal, Ces Cru and Solè.\n\nIrish culture\n\nThe large community of Irish-Americans numbers over 50,000. The Irish were the first large immigrant group to settle in Kansas City and founded its first newspaper. The Irish community includes bands, dancers, newspapers, Irish stores and the Kansas City Irish Center at Drexel Hall in Midtown. The first book that detailed the history of the Irish in Kansas City was Missouri Irish: Irish Settlers on the American Frontier, published in 1984.\n\nCasinos\n\nMissouri voters approved riverboat casino gaming on the Missouri and Mississippi Rivers by referendum with a 63% majority on November 3, 1992. The first casino facility in the state opened in September 1994 in North Kansas City by Harrah's Entertainment (now Caesar's Entertainment). The combined revenues for four casinos exceeded $153 million per month in May 2008.[http://www.kansascity.com/business/story/663369.html The Kansas City Star, June 13, 2008: Missouri riverboat casinos' revenue increases in May.] The metropolitan area is home to six casinos: Ameristar Kansas City, Argosy Kansas City, Harrah's North Kansas City, Isle of Capri Kansas City, the 7th Street Casino (which opened in Kansas City, Kansas, in 2008) and Hollywood Casino (which opened in February 2012 in Kansas City, Kansas).\n\nCuisine\n\nKansas City is most famous for its steak and barbecue, along with the typical array of Southern cuisine. During the heyday of the Kansas City Stockyards, the city was known for its Kansas City steaks or Kansas City strip steaks. The most famous of its steakhouses is the Golden Ox in the Kansas City Live Stock Exchange in the West Bottoms stockyards. These stockyards were second only to those of Chicago in size, but they never recovered from the Great Flood of 1951 and eventually closed. Founded in 1938, Jess & Jim's Steakhouse in the Martin City neighborhood was also well known.\n\nThe Kansas City Strip cut of steak is similar to the New York Strip cut, and is sometimes referred to just as a strip steak. Along with Texas, Memphis, North and South Carolina, Kansas City is lauded as a \"world capital of barbecue.\" More than 90 barbecue restaurants operate in the metropolitan area. The American Royal each fall hosts what it claims is the world's biggest barbecue contest.\n\nClassic Kansas City-style barbecue was an inner-city phenomenon that evolved from the pit of Henry Perry from Memphis in the early 20th century and blossomed in the 18th and Vine neighborhood. Arthur Bryant's took over the Perry restaurant and added molasses to sweeten the recipe. In 1946 one of Perry's cooks opened Gates and Sons Bar-B-Q. The Gates recipe added even more molasses. Bryant's and Gates are the two definitive Kansas City barbecue restaurants. Both have only recently begun expanding outside of Kansas City. Fiorella's Jack Stack Barbecue is also well regarded. In 1977, Rich Davis, a psychiatrist, test-marketed his own concoction called K.C. Soul Style Barbecue Sauce. He renamed it KC Masterpiece, and in 1986, he sold the recipe to the Kingsford division of Clorox. Davis retained rights to operate restaurants using the name and sauce. In 2009, Kansas City appeared on Newsmax magazine's list of the \"Top 25 Most Uniquely American Cities and Towns,\" a piece written by CBS News travel editor Peter Greenberg. In determining his ranking, Greenberg cited the city's barbecue, among other factors.\n\nKansas City has several James Beard Award-winning/nominated chefs and restaurants. Winning chefs include Michael Smith, Celina Tio, Colby Garrelts, Debbie Gold, Jonathan Justus and Martin Heuser. A majority of the Beard Award-winning restaurants are in the Crossroads district, downtown and in Westport.\n\nPoints of interest\n\nSee List of points of interest in Kansas City, Missouri\n\nReligion\n\nThe proportion of Kansas City area residents with a known religious affiliation is 49.7%. The most common religious denominations in the area are:\n* None/No affiliation 50.3%\n* Catholic 12.82%\n* Other Christian 7.15%\n* Baptist (African American denominations) 6.72%\n* Baptist (Other) 6.46%\n* Methodist 5.87%\n* Pentecostal 2.60%\n* Latter-day Saint 2.48%\n* Lutheran 2.30%\n\nWalt Disney in Kansas City\n\nIn 1911, Elias Disney moved his family from Marceline to Kansas City. They lived in a new home with a garage built by Elias Disney, which became the location for Walt's very first animation, at 3028 Bellefontaine. In 1919, Walt Disney returned from France where he had served as a Red Cross Ambulance Driver in World War I. Walt started the first animation company Laugh-O-Gram Studio in Kansas City. Later, the company went bankrupt, Walt Disney moved to Hollywood, and started The Walt Disney Company on October 16, 1923.\n\nSports\n\nProfessional sports teams in Kansas City include the Kansas City Chiefs in the National Football League (NFL), the Kansas City Royals in Major League Baseball (MLB), Sporting Kansas City in Major League Soccer (MLS), and FC Kansas City in the National Women's Soccer League.\n\nProfessional football\n\nThe Chiefs – now a member of the NFL's American Football Conference (AFC) – started play in 1960 as the Dallas Texans and they moved to Kansas City in 1963. The team lost Super Bowl I to the Green Bay Packers. They came back in 1969 to become the last ever AFL champions and win Super Bowl IV against NFL champions Minnesota Vikings with a score of 23-7.\n\nProfessional baseball\n\nThe Athletics baseball franchise played in the city from 1955, after moving from Philadelphia, to 1967, when the team relocated to Oakland, California. The city's Major League Baseball franchise, the Royals, started play in 1969, and are the only major league sports franchise in Kansas City that has not relocated or changed its name. The Royals were the first American League expansion team to reach the playoffs, in 1976, to reach the World Series in 1980, and to win the World Series in 1985. The Royals returned to the World Series in 2014 and won in 2015.\n\nProfessional soccer\n\nThe Kansas City Wiz became a charter member of Major League Soccer in 1996. It was renamed the Kansas City Wizards in 1997. In 2011, the team was renamed Sporting Kansas City and moved to its new stadium Children's Mercy Park in Kansas City, Kansas. Sporting's reserve team, Swope Park Rangers, plays at Shawnee Mission District Stadium in Overland Park, Kansas. FC Kansas City began play in 2013 as an expansion team of the National Women's Soccer League; the team's home games are held at Swope Soccer Village.\n\nCollege athletics\n\nIn college athletics, Kansas City has lately been the home of the Big 12 College Basketball Tournaments. The men's tournament has been played at Sprint Center since March 2008. The women's tournament is played at Municipal Auditorium.\n\nIn addition to serving as the Chiefs' home stadium, Arrowhead Stadium serves as the venue for various intercollegiate football games. It has hosted the Big 12 Championship Game five times. On the last weekend in October, the MIAA Fall Classic rivalry game between Northwest Missouri State University and Pittsburg State University took place at the stadium.\n\nProfessional rugby\n\nKansas City is represented on the rugby pitch by the Kansas City Blues RFC, a former member of the Rugby Super League and a Division 1 club. The team works closely with Sporting Kansas City and splits home-games between Sporting's training pitch and Rockhurst University's stadium.\n\nFormer teams\n\nAlthough for a few short stints, Kansas City briefly had major league baseball teams, including the Kansas City Cowboys in the National League in 1886, a team of the same name in the then-major league American Association from 1888 to 1889, and the Kansas City Packers in the Federal League in 1914 and 1915, the city generally had to settle for minor league baseball until 1955. Before that year, the Kansas City Blues played in the high-level American Association minor league. In 1955, Kansas City became a major league city when the Philadelphia Athletics baseball franchise arrived in 1955. Following the 1967 season, the team relocated to Oakland, California.\n\nKansas City was also represented in the National Basketball Association by the Kansas City Kings (called the Kansas City-Omaha Kings from 1972 to 1975), when the former Cincinnati Royals moved to the Midwest. The team left Sacramento in 1985.\n\nIn 1974, the National Hockey League placed an expansion team in Kansas City called the Kansas City Scouts. The team moved to Denver in 1976, and today they are known as the New Jersey Devils.\n\nParks and boulevards\n\nKansas City has 132 mi of boulevards and parkways, 214 urban parks, 49 ornamental fountains, 152 ball diamonds, 10 community centers, 105 tennis courts, 5 golf courses, 5 museums and attractions, 30 pools, and 47 park shelters.[http://www.kcmo.org/parks/2008referencebook.pdf Parks & Recreation, 2008 Reference Book] [http://www.kcmo.org/parks.nsf/web/Aboutus Parks & Recreation, About Parks & Recreation]  These amenities are found across the city. Much of the system, designed by George E. Kessler, was constructed from 1893 to 1915.\n\nCliff Drive, in Kessler Park on the North Bluffs, is a designated State Scenic Byway. It extends  from The Paseo and Independence Avenue through Indian Mound on Gladstone Boulevard at Belmont Boulevard, with many historical points and architectural landmarks.\n\nWard Parkway, on the west side of the city near State Line Road, is lined by many of the city's largest and most elaborate homes.\n\nThe Paseo is a major north–south parkway that runs 19 mi through the center of the city beginning at Cliff Drive. It was modeled on the Paseo de la Reforma, a fashionable Mexico City boulevard.\n\nSwope Park is one of the nation's largest city parks, comprising 1805 acres, more than twice the size of New York City's Central Park.[http://www.kcmo.org/timeline.nsf/web/18960000?opendocument TimeLine 150]  It features a zoo, a woodland nature and wildlife rescue center, 2 golf courses, 2 lakes, an amphitheatre, a day-camp, and numerous picnic grounds. Hodge Park, in the Northland, covers 1029 acres (1.61 sq. mi.). This park includes the 80 acre Shoal Creek Living History Museum, a village of more than 20 historical buildings dating from 1807 to 1885. Berkely Riverfront Park, 955 acre on the banks of the Missouri River on the north edge of downtown, holds annual Independence Day celebrations and other festivals.\n\nA program went underway to replace many of the fast-growing sweetgum trees with hardwood varieties.[http://www.kcmo.org/planning/pdf/focus/NA_reports/triblen.pdf Focus Kansas City, Tri-Blenheim Neighbors United, report date: April 29, 2000] \n\nLaw and government\n\nCity government\n\nKansas City is home to the largest municipal government in the state of Missouri. The city has a council/manager form of government. The role of city manager has diminished over the years. The non-elective office of city manager was created following excesses during the Pendergast days. The mayor is the head of the Kansas City City Council, which has 12 members (one member for each district, plus one at large member per district). The mayor is the presiding member. Kansas City holds city elections in every fourth odd numbered year. The last citywide election was held in May 2015. The officials took office in August 2015 and will hold the position until 2019.\n\nPendergast was the most prominent leader during the machine politics days. The most nationally prominent Democrat associated with the machine was Harry S Truman, who became a Senator, Vice President and then President of the United States from 1945 to 1953. Kansas City is the seat of the United States District Court for the Western District of Missouri, one of two federal district courts in Missouri.  The United States District Court for the Eastern District of Missouri is in St. Louis. It also is the seat of the Western District of the Missouri Court of Appeals, one of three districts of that court (the Eastern District is in St. Louis and the Southern District is in Springfield).\n\nThe Mayor, City Council, and City Manager are listed below:\n\nNational political conventions\n\nKansas City hosted the 1900 Democratic National Convention, the 1928 Republican National Convention and the 1976 Republican National Convention. The urban core of Kansas City consistently votes Democratic in Presidential elections; however, on the state and local level Republicans often find success, especially in the Northland and other suburban areas of Kansas City.\n\nFederal representation\n\nKansas City is represented by three members of the United States House of Representatives:\n*Missouri's 4th congressional district – the southern portion of Kansas City in Cass County; represented by Vicky Hartzler (Republican)\n*Missouri's 5th congressional district – most of Kansas City proper in Jackson County, plus Independence and portions of Cass County; represented by Emanuel Cleaver (Democrat)\n*Missouri's 6th congressional district – all of Kansas City proper north of the Missouri River and plus suburbs in eastern Jackson County beyond Independence; represented by Sam Graves (Republican)\n\nCrime\n\nSome of the earliest organized violence in Kansas City erupted during the American Civil War. Shortly after the city's incorporation in 1850, so-called Bleeding Kansas erupted, affecting border ruffians and Jayhawkers. During the war, Union troops burned all occupied dwellings in Jackson County south of Brush Creek and east of Blue Creek to Independence in an attempt to halt raids into Kansas. After the war, the Kansas City Times turned outlaw Jesse James into a folk hero via its coverage. James was born in the Kansas City metro area at Kearney, Missouri, and notoriously robbed the Kansas City Fairgrounds at 12th Street and Campbell Avenue.\n\nIn the early 20th century under Pendergast, Kansas City became the country's \"most wide open town\". While this would give rise to Kansas City Jazz, it also led to the rise of the Kansas City mob (initially under Johnny Lazia), as well as the arrival of organized crime. In the 1970s, the Kansas City mob was involved in a gang war over control of the River Quay entertainment district, in which three buildings were bombed and several gangsters were killed. Police investigations gained after boss Nick Civella was recorded discussing gambling bets on Super Bowl IV (where the Kansas City Chiefs defeated the Minnesota Vikings). The war and investigation led to the end of mob control of the Stardust Casino, which was the basis for the film Casino (although the production minimizes the Kansas City connections).\n\nAs of November 2012, Kansas City ranked 18th on the Federal Bureau of Investigation (FBI)'s annual survey of crime rates for cities with populations over 100,000. Much of the city's violent crimes occur on the city's lower income East Side. Revitalizing the downtown and midtown areas has been fairly successful and now these areas have below average violent crime compared to major downtowns. According to a 2007 analysis by The Kansas City Star and the University of Missouri-Kansas City, downtown experienced the largest drop in crime of any neighborhood in the city during the 2000s.[http://www.downtownkc.org/content.aspx?pgID875&newsID\n579&exCompID=82 Downtown News] \n\nEducation\n\nColleges and universities\n\nMany universities, colleges, and seminaries are in the Kansas City metropolitan area, including:\n* University of Missouri–Kansas City − one of four schools in the University of Missouri system − serving more than 15,000 students\n* Rockhurst University − Jesuit university founded in 1910\n* Kansas City Art Institute − four-year college of fine arts and design founded in 1885\n* Kansas City University of Medicine and Biosciences − medical and graduate school founded in 1916\n* Avila University − Catholic university of the Sisters of St. Joseph of Carondelet\n* Park University − private institution established in 1875; Park University Graduate School is downtown\n* Baker University − multiple branches of the School of Professional and Graduate Studies\n* William Jewell College − private liberal arts institution founded in 1849\n* Metropolitan Community College (Kansas City) − a two-year college with multiple campuses in the suburban metropolitan area\n* Midwestern Baptist Theological Seminary − Southern Baptist Convention\n* Nazarene Theological Seminary − Church of the Nazarene\n* Calvary Bible College and Theological Seminary\n* Saint Paul School of Theology − Methodist\n\nPrimary and secondary schools\n\nKansas City is served by 16 school districts including 10 Public School Districts, with a significant portion being nationally ranked. There are also numerous private schools; Catholic schools in Kansas City are governed by the Diocese of Kansas City.\n\nThe following Public School Districts serve Kansas City:\n* Kansas City, MO School District\n* North Kansas City School District\n* Center School District\n* Hickman Mills C-1 School District\n* Grandview C-4 School District\n* Liberty School District\n* Park Hill School District\n* Platte County R-3 School District\n* Raytown C-2 School District\n* Lees Summit R-7 School District\n* Blue Springs R-4 School District\n* Independence School District\n* Fort Osage R-1 School District\n\nLibraries and archives\n\n* Linda Hall Library − internationally recognized independent library of science, engineering and technology, housing over one million volumes.\n* Mid-Continent Public Library − largest public library system in Missouri, and among the largest collections in America.\n* Kansas City Public Library − oldest library system in Kansas City.\n* University of Missouri-Kansas City Libraries − four collections: Leon E. Bloch Law Library and Miller Nichols Library, both on Volker Campus; and Health Sciences Library and Dental Library, both on Hospital Hill in Kansas City.\n* Rockhurst University Greenlease Library\n* [The Black Archives of Mid-America | http://blackarchives.org/] − research center of the African American experience in the central Midwest.\n* National Archives and Records Administration (NARA), Central Plains Region − one of 18 national records facilities, holding millions of archival records and microfilms for Iowa, Kansas, Missouri, and Nebraska in a new facility adjacent to Union Station, which was opened to the general public in 2008.\n\nMedia\n\nPrint media\n\nThe Kansas City Star is the area's primary newspaper. William Rockhill Nelson and his partner, Samuel Morss, first published the evening paper on September 18, 1880. The Star competed with the morning Kansas City Times before acquiring that publication in 1901. The \"Times\" name was discontinued in March 1990, when the morning paper was renamed the \"Star\".Harry Haskell, Boss-Busters and Sin Hounds: Kansas City and Its \"Star\" (Columbia: University of Missouri Press, 2007) \n\nWeekly newspapers include The Call (which is focused toward Kansas City's African-American community), the Kansas City Business Journal, The Pitch, Ink, and the bilingual publications Dos Mundos and KC Hispanic News.\n\nThe city is served by two major faith-oriented newspapers: The Kansas City Metro Voice, serving the Christian community, and the Kansas City Jewish Chronicle, serving the Jewish community. It also the headquarters of the National Catholic Reporter, an independent Catholic newspaper.\n\nBroadcast media\n\nThe Kansas City media market (ranked 32nd by Arbitron[http://www.arbitron.com/downloads/bluebook_sp08.pdf Arbitron, Inc., Spring '08 Blue Book, \"2008 Market Survey Schedule: All Markets,\"], p. 4 and 31st by Nielsen) includes 10 television stations, 30 FM and 21 AM radio stations. Kansas City broadcasting jobs have been a stepping stone for national television and radio personalities, notably Walter Cronkite and Mancow Muller.\n\nWDAF radio (610 AM, now at 106.5 FM; AM frequency now occupied by KCSP) signed on in 1927 as an affiliate of the NBC Red Network, under the ownership of The Star. In 1949, the Star signed on WDAF-TV as an affiliate of the NBC television network. The Star sold off the WDAF stations in 1957, following an antitrust investigation by the United States government (reportedly launched at Truman's behest, following a long-standing feud with the Star) over the newspaper's ownership of television and radio stations. KCMO radio (originally at 810 AM, now at 710 AM) signed on KCMO-TV (now KCTV) in 1953. The respective owners of WHB (then at 710 AM, now at 810 AM) and KMBC radio (980 AM, now KMBZ), Cook Paint and Varnish Company and the Midland Broadcasting Company, signed on WHB-TV/KMBC-TV as a time-share arrangement on VHF channel 9 in 1953; KMBC-TV took over channel 9 full-time in June 1954, after Cook Paint and Varnish purchased Midland Broadcasting's stations.\n\nThe major broadcast television networks have affiliates in the Kansas City market (covering 32 counties in northwestern Missouri, with the exception of counties in the far northwestern part of the state that are within the adjacent Saint Joseph market, and northeastern Kansas); including WDAF-TV 4 (Fox), KCTV 5 (CBS), KMBC-TV 9 (ABC), KCPT 19 (PBS), KCWE 29 (The CW), KSHB-TV 41 (NBC) and KSMO-TV 62 (MyNetworkTV). Other television stations in the market include Saint Joseph-based KTAJ-TV 16 (TBN), Kansas City, Kansas-based TV25.tv (consisting of three locally owned stations throughout northeast Kansas, led by KCKS-LD 25, affiliated with several digital multicast networks), Lawrence, Kansas-based KMCI-TV 38 (independent), Spanish-language station KUKC-LP 48 (Univision), and KPXE-TV 50 (Ion Television).\n\nFilm community\n\nKansas City has been a locale for film and television productions. Between 1931 and 1982 Kansas City was home to the Calvin Company, a large movie production company that specialized in promotional and sales short films and commercials for corporations, as well as educational films for schools and the government. Calvin was an important venue for Kansas City arts, training local filmmakers who went on to Hollywood careers and also employing local actors, most of whom earned their main income in fields such as radio and television announcing. Kansas City native Robert Altman directed movies at the Calvin Company, which led him to shoot his first feature film, The Delinquents, in Kansas City using many local players.\n\nThe 1983 television movie The Day After was filmed in Kansas City and Lawrence, Kansas. The 1990s film Truman, starring Gary Sinise, was filmed in the city. Other films shot in or around Kansas City include Article 99, Mr. & Mrs. Bridge, Kansas City, Paper Moon, In Cold Blood, Ninth Street, and Sometimes They Come Back (in and around nearby Liberty, Missouri). More recently, a scene in the controversial film Brüno was filmed in downtown Kansas City's historic Hotel Phillips.\n\nToday, Kansas City is home to an active independent film community. The Independent Filmmaker's Coalition is an organization dedicated to expanding and improving independent filmmaking in Kansas City. The city launched the KC Film Office in October 2014 with the goal of better marketing the city for prospective television shows and movies to be filmed there. The City Council passed several film tax incentives in February 2016 to take effect in May 2016; the KC Film Office is coordinating its efforts with the State of Missouri to reinstate film incentives on a statewide level.\n\nInfrastructure\n\nOriginally, Kansas City was the launching point for travelers on the Santa Fe, Oregon and California trails. Later, with the construction of the Hannibal Bridge across the Missouri River, it became the junction of 11 trunk railroads. More rail tonnage passes through the city than any other U.S. city. Trans World Airlines (TWA) located its headquarters in the city, and had ambitious plans to turn the city into an air hub.\n\nHighways\n\nMissouri and Kansas were the first states to start building interstates with Interstate 70. Interstate 435, which encircles the entire city, is the second longest beltway in the nation. (Interstate 275 around Cincinnati, Ohio is the longest.) The Kansas City metro area has more limited access highway lane-miles per capita than any other large US metro area, over 27% more than the second-place Dallas–Fort Worth metroplex, over 50% more than the average American metropolitan area. The Sierra Club blames the extensive freeway network for excessive sprawl and the decline of central Kansas City. On the other hand, the relatively uncongested road network contributes significantly to Kansas City's position as one of America's largest logistics hubs.[http://www.kcsmartport.com/sec_news/media/documents/ShippingCentral.pdf Kcsmartport.com] \n\nAirports\n\nKansas City International Airport was built to TWA's specifications to make a world hub. Its original passenger-friendly design placed each of its gates 100 ft from the street. Following the September 11, 2001, attacks, it required a costly overhaul to conform to the tighter security protocols. Charles B. Wheeler Downtown Airport was TWA's original headquarters and houses the Airline History Museum. It is still used for general aviation and airshows.\n\nPublic transportation\n\nLike most American cities, Kansas City's mass transit system was originally rail-based. From 1870 to 1957, Kansas City's streetcar system was among the top in the country, with over 300 mi of track at its peak. The rapid sprawl in the following years led this private system to be shut down.\n\nKCATA- RideKC\n\nOn December 28, 1965, the Kansas City Area Transportation Authority (KCATA) was formed via a bi-state compact created by the Missouri and Kansas legislatures. The compact gave the KCATA responsibility for planning, construction, owning and operating passenger transportation systems and facilities within the seven-county area.\n\nRideKC Bus and MAX\n\nIn July 2005, the KCATA launched Kansas City's first bus rapid transit line, the Metro Area Express (MAX). MAX links the River Market, Downtown, Union Station, Crown Center and the Country Club Plaza. This corridor employs over 150,000 workers. MAX operates and is marketed more like a rail system than a local bus line. A unique identity was created for MAX, including 13 modern diesel buses and easily identifiable \"stations\". MAX features (real-time GPS tracking of buses, available at every station), and stoplights automatically change in their favor if buses are behind schedule. In 2010, a second MAX line was added on Troost Avenue. The city is planning another MAX line down Prospect Avenue.\n\nRideKC Streetcar\n\nOn December 12, 2012, a ballot initiative to construct a $102 million, 2-mile (3200 m) modern streetcar line in downtown Kansas City was approved by local voters. The streetcar route runs along Main Street from the River Market to Union Station; it debuted on May 6, 2016. A new non-profit corporation made up of private sector stakeholders and city appointees – the Kansas City Streetcar Authority – operates and maintains the system. Unlike many similar systems around the U.S., no fare is to be charged initially. Residents within the proposed Transportation Development District are determining the fate of the KC Streetcar's southern extension through Midtown and the Plaza to UMKC. The Port Authority of Kansas City is also studying running an extension to Berkley Riverfront Park.\n\nRideKC Bridj\n\nIn 2015, the KCATA, Unified Government Transit, Johnson County Transit, and IndeBus (all separate metro services) began merging into one coordinated transit service for the Kansas City region, called RideKC. The buses and other transit options will be branded as: RideKC Bus, RideKC MAX, RideKC Streetcar, and RideKC Bridj. RideKC Bridj is a micro transit service partnership between Ford Bridj and KCATA that began on March 7, 2016. Users download the Bridj app and use the service much like a taxi service. The merger and full coordination is expected to be complete by 2019.\n\nWalkability\n\nA 2015 study by Walk Score ranked Kansas City as the 42nd most walkable out of the 50 largest U.S. cities. As a whole, the city has a score of 34 out of 100. However, several of the more densely populated neighborhoods have much higher scores: Westport has a score of 91; the Downtown Loop has a score of 85; the Crossroads scored 85; and the Plaza scored 83. Those ratings range from \"A Walker's Paradise\" to \"Very Walkable.\" In April 2017, voters approved an $800 million general obligation bond, part of which is designated for sidewalk repairs and creating complete-streets.\n\nSister cities\n\nKansas City has 14 sister cities:\n\nNotable people",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kansas City, Missouri" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17454" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kansas City is the largest city in Missouri, United States. According to the U.S. Census Bureau, the city had an estimated population of 481,420 in 2016, making it the 37th largest city by population in the United States. It is the central city of the Kansas City metropolitan area, which straddles the Kansas–Missouri border. Kansas City was founded in the 1830s as a Missouri River port at its confluence with the Kansas River coming in from the west. On June 1, 1850 the town of Kansas was incorporated; shortly after came the establishment of the Kansas Territory. Confusion between the two ensued and the name Kansas City was assigned to distinguish them soon after.\n\nSitting on Missouri's western border, with Downtown near the confluence of the Kansas and Missouri rivers, the modern city encompasses some , making it the 23rd largest city by total area in the United States. Most of the city lies within Jackson County, but portions spill into Clay, Cass, and Platte counties. Along with Independence, it serves as one of the two county seats for Jackson County. Major suburbs include the Missouri cities of Independence and Lee's Summit and the Kansas cities of Overland Park, Olathe, and Kansas City.\n\nThe city is composed of several neighborhoods, including the River Market District in the north, the 18th and Vine District in the east, and the Country Club Plaza in the south. Kansas City is also known for its cuisine (including its distinctive style of barbecue) and its craft breweries.\n\nHistory\n\nKansas City, Missouri was incorporated as a town on June 1, 1850, and as a city on March 28, 1853. The territory straddling the border between Missouri and Kansas at the confluence of the Kansas and Missouri rivers was considered a good place to build settlements.\n\nThe Antioch Christian Church, Dr. James Compton House, and Woodneath are listed on the National Register of Historic Places.\n\nExploration and settlement\n\nThe first documented European visitor to Kansas City was Étienne de Veniard, Sieur de Bourgmont, who was also the first European to explore the lower Missouri River. Criticized for his response to the Native American attack on Fort Détroit, he had deserted his post as fort commander and was avoiding French authorities. Bourgmont lived with a Native American wife in a village about 90 mi east near Brunswick, Missouri, where he illegally traded furs.\n\nTo clear his name, he wrote Exact Description of Louisiana, of Its Harbors, Lands and Rivers, and Names of the Indian Tribes That Occupy It, and the Commerce and Advantages to Be Derived Therefrom for the Establishment of a Colony in 1713 followed in 1714 by The Route to Be Taken to Ascend the Missouri River. In the documents, he describes the junction of the \"Grande Riv[ière] des Cansez\" and Missouri River, making him the first to adopt those names. French cartographer Guillaume Delisle used the descriptions to make the area's first reasonably accurate map.\n\nThe Spanish took over the region in the Treaty of Paris in 1763, but were not to play a major role other than taxing and licensing Missouri River ship traffic. The French continued their fur trade under Spanish license. The Chouteau family operated under Spanish license at St. Louis in the lower Missouri Valley as early as 1765 and in 1821 the Chouteaus reached Kansas City, where François Chouteau established Chouteau's Landing.\n\nAfter the 1804 Louisiana Purchase, Lewis and Clark visited the confluence of the Kansas and Missouri rivers, noting it was a good place to build a fort. In 1831, a group of Mormons from New York settled in what would become the city. They built the first school within Kansas City's current boundaries, but were forced out by mob violence in 1833 and their settlement remained vacant.\n\nIn 1833 John McCoy established West Port along the Santa Fe Trail, 3 mi away from the river. In 1834 McCoy established Westport Landing on a bend in the Missouri to serve as a landing point for West Port. Soon after, the Kansas Town Company, a group of investors, began to settle the area, taking their name from an English spelling of \"Cansez.\" In 1850, the landing area was incorporated as the Town of Kansas.\n\nBy that time, the Town of Kansas, Westport and nearby Independence, had become critical points in the United States' westward expansion. Three major trails – the Santa Fe, California, and Oregon – all passed through Jackson County.\n\nOn February 22, 1853, the City of Kansas was created with a newly elected mayor. It had an area of  and a population of 2,500. The boundary lines at that time extended from the middle of the Missouri River south to what is now Ninth Street, and from Bluff Street on the west to a point between Holmes Road and Charlotte Street on the east.\n\nAmerican Civil War\n\nThe Kansas City area was rife with animosity just prior to the U.S. Civil War. Kansas successfully petitioned the U.S. to enter the Union as a free state that did not allow slavery under the new doctrine of popular sovereignty. Missouri had many slaves, and slavery sympathizers crossed into Kansas to sway the state towards allowing slavery, at first by ballot box and then by bloodshed.\n\nDuring the Civil War, the city and its immediate surroundings were the focus of intense military activity. Although the First Battle of Independence in August 1862 resulted in a Confederate States Army victory, the Confederates were unable to leverage their win in any significant fashion, as Kansas City was occupied by Union troops and proved too heavily fortified to assault. The Second Battle of Independence, which occurred on October 21–22, 1864 as part of Sterling Price's Missouri expedition of 1864, also resulted in a Confederate triumph. Once again their victory proved hollow, as Price was decisively defeated in the pivotal Battle of Westport the next day, effectively ending Confederate efforts to regain Missouri.\n\nGeneral Thomas Ewing, in response to a successful raid on nearby Lawrence, Kansas, led by William Quantrill, issued General Order No. 11, forcing the eviction of residents in four western Missouri counties – including Jackson – except those living in the city and nearby communities and those whose allegiance to the Union was certified by Ewing.\n\nPost-Civil War\n\nAfter the Civil War, Kansas City grew rapidly, largely losing its Southern identity. The selection of the city over Leavenworth, Kansas, for the Hannibal & St. Joseph Railroad bridge over the Missouri River brought about significant growth. The population exploded after 1869, when the Hannibal Bridge, designed by Octave Chanute, opened. The boom prompted a name change to Kansas City in 1889, and the city limits to be extended south and east. Westport became part of Kansas City on December 2, 1897. In 1900, Kansas City was the 22nd largest city in the country, with a population of 163,752 residents.\n\nKansas City, guided by architect George Kessler, became a forefront example of the City Beautiful movement, offering a network of boulevards and parks.\n\nThe relocation of Union Station to its current location in 1914 and the opening of the Liberty Memorial in 1923 provided two of the city's most identifiable landmarks. Robert A. Long, president of the Liberty Memorial Association, was a driving force in the funding for construction. Long was a longtime resident and wealthy businessman. He built the R.A. Long Building for the Long-Bell Lumber Company, his home, Corinthian Hall (now the Kansas City Museum) and Longview Farm.\n\nFurther spurring Kansas City's growth was the opening of the innovative Country Club Plaza development by J.C. Nichols in 1925, as part of his Country Club District plan.\n\nPendergast era\n\nAt the start of the 20th century, political machines gained clout in the city, with the one led by Tom Pendergast dominating the city by 1925. Several important buildings and structures were built during this time, including the Kansas City City Hall and the Jackson County Courthouse. The machine fell in 1939 when Pendergast, riddled with health problems, pleaded guilty to tax evasion after long federal investigations. His biographers have summed up Pendergast's uniqueness:\nPendergast may bear comparison to various big-city bosses, but his open alliance with hardened criminals, his cynical subversion of the democratic process, his monarchistic style of living, his increasingly insatiable gambling habit, his grasping for a business empire, and his promotion of Kansas City as a wide-open town with every kind of vice imaginable, combined with his professed compassion for the poor and very real role as city builder, made him bigger than life, difficult to characterize.\n\nPost–World War II\n\nKansas City's suburban development began with a streetcar system in the early decades of the 20th century. The city's first suburbs were in the neighborhoods of Pendleton Heights and Quality Hill. After World War II, many relatively affluent residents left for suburbs in Johnson County, Kansas, and eastern Jackson County, Missouri. Many also went north of the Missouri River, where Kansas City had incorporated areas between the 1940s and 1970s.\n\nIn 1950, African Americans represented 12.2% of Kansas City's population. The sprawling characteristics of the city and its environs today mainly took shape after 1960s race riots. The assassination of Martin Luther King, Jr. was a catalyst for the 1968 Kansas City riot. At this time, slums were forming in the inner city, and many who could afford to do so, left for the suburbs and outer edges of the city. The post-World War II idea of suburbs and the \"American Dream\" also contributed to the sprawl of the area. The city's population continued to grow, but the inner city declined. The city's most populous ethnic group, non-Hispanic whites, declined from 89.5% in 1930 to 54.9% in 2010.\n\nIn 1940, the city had about 400,000 residents; by 2000, the same area was home to only about 180,000. From 1940 to 1960, the city more than doubled its physical size, while increasing its population by only about 75,000. By 1970, the city covered approximately 316 sqmi, more than five times its size in 1940.\n\nThe Hyatt Regency walkway collapse was a major disaster that occurred on July 17, 1981, killing 114 people and injuring more than 200 others during a tea dance. At the time, it was the deadliest structural collapse in US history.\n\n21st century\n\nDowntown Kansas City development\n\nIn the 21st century, the Kansas City area has undergone extensive redevelopment, with over $6 billion in improvements to the downtown area on the Missouri side. One of the main goals is to attract convention and tourist dollars, office workers, and residents to downtown KCMO. Among the projects include the redevelopment of the Power & Light District, located in the area surrounding the Power & Light Building (the former headquarters of the Kansas City Power & Light Company, which is now based in the district's northern end), into a retail and entertainment district; and the Sprint Center, an 18,500-seat arena that opened in the district in 2007, which was funded by a 2004 ballot initiative involving a tax on car rentals and hotels, and was designed to meet the stadium specifications for a possible future NBA or NHL franchise. Kemper Arena, which was replaced by Sprint Center, fell into disrepair and was sold to private developers. By 2017, the arena was being converted to a sports complex under the name Mosiac Arena. The Kauffman Performing Arts Center opened in 2011 providing a new, modern home to the KC Orchestra and Ballet. In 2015, an 800-room Hyatt Convention Center Hotel was announced for a site next to the Performance Arts Center & Bartle Hall. Construction is expected to start in early 2018 with Loews as the operator.\n\nFrom 2007 to 2017, downtown residential population in Kansas City quadrupled and continues to grow. The area has grown from almost 4,000 residents in the early 2000s to nearly 30,000 as of 2017. Kansas City's downtown ranks as the 6th-fastest growing downtown in America with the population expected to grow by over 40% by 2022. Conversions of office buildings such as the Power and Light Building, Commerce Bank Tower, and others into residential and hotel space has helped to fulfill the demand. New apartment complexes like One, Two, and Three Lights, River Market West, 503 Main, and others have begun to reshape Kansas City's skyline. Strong demand has led to occupancy rates in the high 90%'s.\n\nWhile the residential population of downtown has boomed, the office population has dropped significantly from the early 2000s to the mid 2010s. AMC and other top employers moved their operations to modern office buildings in the suburbs. High office vacancy plagued downtown, leading to the neglect of many office buildings. By the mid 2010s, many office buildings were converted to residential uses and the Class A vacancy rate plunged to 12% in 2017. Swiss Re, Virgin Mobile, AutoAlert, and others have begun to move operations to downtown Kansas City from the suburbs as well as expensive coastal cities.\n\nTransportation Developments\n\nThe area has seen additional development through various transportation projects, including improvements to the Grandview Triangle, which intersects Interstates 435 and 470, and U.S. Route 71, a thoroughfare long notorious for fatal accidents.\n\nIn July 2005, the Kansas City Area Transportation Authority (KCATA) launched Kansas City's first bus rapid transit line, the Metro Area Express (MAX), which links the River Market, Downtown, Union Station, Crown Center and the Country Club Plaza. The KCATA continues to expand MAX with additional routes on Prospect Ave, Troost Ave, and Independence Ave.\n\nIn 2013, construction began on a two-mile streetcar line in downtown Kansas City (funded by a $102 million ballot initiative that was passed in 2012) that runs between the River Market and Union Station, it began operation in May 2016. In 2017, voters approved the formation of a TDD to expand the streetcar line south 3.5 miles from Union Station to UMKC's Volker Campus. Additionally in 2017, the KC Port Authority began engineering studies for a Port Authority funded streetcar expansion north to Berkley Riverfront Park. City Wide, voter support for rail projects continues to grow with numerous light rail projects in the works.\n\nIn 2016, Jackson County, Missouri acquired unused rail lines as part of a long term commuter rail plan. For the time being, the line is being converted to a trail while county officials negotiate with railroads for access to tracks in Downtown Kansas City.\n\nOn November 7, 2017, Kansas City, Missouri voters overwhelmingly approved a new single terminal at Kansas City International Airport by a 75% to 25% margin. The New Single Terminal will replace the 3 existing \"Clover Leafs\" at KCI Airport and is expected to open in 2021.\n\nGeography\n\nThe city has an area of , of which,  is land and  is water. Bluffs overlook the rivers and river bottom areas. Kansas City proper is bowl-shaped and is surrounded to the north and south by glacier-carved limestone and bedrock cliffs. Kansas City is at the junction between the Dakota and Minnesota ice lobes during the maximum late Independence glaciation of the Pleistocene epoch. The Kansas and Missouri rivers cut wide valleys into the terrain when the glaciers melted and drained. A partially filled spillway valley crosses the central city. This valley is an eastward continuation of the Turkey Creek Valley. It is the closest major city to the geographic center of the contiguous United States, or \"Lower 48\".\n\nCityscape\n\nKansas City, Missouri, comprises more than 240[http://www.kcmo.org/planning/pdf/focus/Neighborhood_Assessment_Reports/neighborhoodtypes.pdf ]  neighborhoods, some with histories as independent cities or as the sites of major events.\n\nFile:Kansas City Skyline 2.JPG|View of Union Station and the Sprint Center\n\nArchitecture\n\nThe Nelson-Atkins Museum opened its Euro-Style Bloch addition in 2007, and the Safdie-designed Kauffman Center for the Performing Arts opened in 2011. The Power and Light Building is influenced by the Art Deco style and sports a glowing sky beacon. The new world headquarters of H&R Block is a 20-story all-glass oval bathed in a soft green light. The four industrial artworks atop the support towers of the Kansas City Convention Center (Bartle Hall) were once the subject of ridicule, but now define the night skyline near the new Sprint Center along with One Kansas City Place (Missouri's tallest office tower), the KCTV-Tower (Missouri's tallest freestanding structure) and the Liberty Memorial, a World War I memorial and museum that flaunts simulated flames and smoke billowing into the night skyline. It was designated as the National World War I Museum and Memorial in 2004 by the United States Congress. Kansas City is home to significant national and international architecture firms including ACI Boland, BNIM, 360 Architecture, HNTB, Populous. Frank Lloyd Wright designed two private residences and Community Christian Church there.\n\nKansas City hosts over 200 working fountains. Notable examples are on the Country Club Plaza. Designs range from French-inspired traditional to modern. Highlights include the Black Marble H&R Block fountain in front of Union Station, which features synchronized water jets; the Nichols Bronze Horses at the corner of Main and J.C. Nichols Parkway at the entrance to the Plaza Shopping District; and the fountain at Hallmark Cards World Headquarters in Crown Center.\n\nCity Market\n\nSince its inception in 1857, City Market has been one of the largest and most enduring public farmers' markets in the American Midwest, linking growers and small businesses to the community. More than 30 full-time merchants operate year-round and offer specialty foods, fresh meats and seafood, restaurants and cafes, floral, home accessories and more. The City Market is also home to the Arabia Steamboat Museum, which houses artifacts from a steamboat that sank near Kansas City in 1856.\n\nDowntown\n\nDowntown Kansas City is an area of  bounded by the Missouri River to the north, 31st Street to the south, Troost Avenue to the East, and State Line Road to the west. Areas near Downtown Kansas City include the 39th Street District, which is known as Restaurant Row, and features one of Kansas City's largest selections of independently owned restaurants and boutique shops. It is a center of literary and visual arts, and bohemian culture. Crown Center is the headquarters of Hallmark Cards and a major downtown shopping and entertainment complex. It is connected to Union Station by a series of covered walkways. The Country Club Plaza, or simply \"the Plaza\", is an upscale, outdoor shopping and entertainment district. It was the first suburban shopping district in the United States,[http://www.countryclubplaza.com/plaza.aspx?pgID=893 \"A walk through Kansas City history\"] , Country Club Plaza website (online) designed to accommodate shoppers arriving by automobile, and is surrounded by apartments and condominiums, including a number of high rise buildings. The associated Country Club District to the south includes the Sunset Hill and Brookside neighborhoods, and is traversed by Ward Parkway, a landscaped boulevard known for its statuary, fountains and large, historic homes. Kansas City's Union Station is home to Science City, restaurants, shopping, theaters, and the city's Amtrak facility.After years of neglect and seas of parking lots, Downtown Kansas City is undergoing a period of change with over $6 billion in development since 2000. Many residential properties recently have been or are under redevelopment in three surrounding warehouse loft districts and the Central Business District. The Power & Light District, a new, nine-block entertainment district comprising numerous restaurants, bars, and retail shops, was developed by the Cordish Company of Baltimore, Maryland. Its first tenant opened on November 9, 2007. It is anchored by the Sprint Center, a 19,000-seat sports and entertainment complex.http://www.sprintcenter.com/news/detail/sprint_center_announces_grand_opening_week_festivities\n\nClimate\n\nKansas City lies in the Midwestern United States, as well as near the geographic center of the country, at the confluence of the longest river in the country, the Missouri River, and the Kansas River (also known as the Kaw River). The city lies in the northern periphery of the humid subtropical zone. but is interchangeable with the humid continental climate due to roughly 104 air frosts on average per annum. The city is part of USDA plant hardiness zones 5b and 6a. In the center of North America, far removed from a significant body of water, there is significant potential for extreme hot and cold swings all year long. Unless otherwise stated, normal figures below are based on 1981–2010 data at Downtown Airport. The year's warmest month is July, with a 24-hour average temperature of . The summer months are hot and humid, with moist air riding up from the Gulf of Mexico, and high temperatures surpass 100 °F on 5.6 days of the year, and 90 °F on 47 days.\n The coldest month of the year is January, with an average temperature of . Winters are cold, with 22 days where the high temperature is at or below  and 2.5 nights with a low at or below 0 °F. The official record highest temperature is 113 °F, set on August 14, 1936 at Downtown Airport, while the official record lowest is , set on December 22 and 23, 1989. Normal seasonal snowfall is  at Downtown Airport and  at Kansas City International Airport. The average window for freezing temperatures is October 31 to April 4, while for measurable () snowfall, it is November 27 to March 16 as measured at Kansas City International Airport. Precipitation, both in frequency and total accumulation, shows a marked uptick in late spring and summer.\n\nKansas City is on the edge of the \"Tornado Alley\", a broad region where cold air from the Rocky Mountains in Canada collides with warm air from the Gulf of Mexico, leading to the formation of powerful storms, especially during the spring. A few areas of the Kansas City metropolitan area have had some severe outbreaks of tornadoes at different points in the past, including the Ruskin Heights tornado in 1957,[http://www.wdaftv4.com/almanac/watorndo.html Kansas City Tornado Almanac] , wdaftv4.com. Retrieved September 2006. and the May 2003 tornado outbreak sequence. The region can also fall victim to the sporadic ice storm during the winter months, such as the 2002 ice storm during which hundreds of thousands of residents lost power for days and (in some cases) weeks.[http://www.kansascity.com/mld/kansascity/news/special_packages/star_history/calamities_crime/12508862.htm KC powerless as icy barrage pummels the area, leaves behind disaster zone]. Retrieved September 10, 2006. Kansas City and its outlying areas are also subject to flooding, including the Great Floods of 1951 and 1993.\n\nDemographics\n\nAccording to the 2010 census, the racial composition of Kansas City was as follows:\n* White: 59.2% (non-Hispanic white: 54.9%)\n* Black or African American: 29.9%\n* Hispanic or Latino (of any race): 10.0%\n* Some other race: 4.5% (primarily Latino)\n* Two or more races: 3.2%\n* Asian: 2.5%\n* Native American: 0.5%\n* Native Hawaiian and other Pacific Islander: 0.2%\n\nKansas City has the second largest Sudanese and Somali populations in the United States. The Latino/Hispanic population of Kansas City, which is heavily Mexican and Central American, is spread throughout the metropolitan area, with some concentration in the northeast part of the city and southwest of downtown. The Asian population, mostly Southeast Asian, is partly concentrated within the northeast side to the Columbus Park neighborhood in the Greater Downtown area, a historical Italian American neighborhood, the UMKC area and in River Market, in northern Kansas City.\n\nThe Historic Kansas City boundary is roughly 58 sqmi and has a population density of about 5,000 people per sq. mi. It runs from the Missouri River to the north, 79th Street to the south, the Blue River to the east, and State Line Road to the west. During the 1960s and 1970s, Kansas City annexed large amounts of land, which are largely undeveloped to this day.\n\nBetween the 2000 and 2010 Census counts, the urban core of Kansas City continued to drop significantly in population. The areas of Greater Downtown in the center city, and sections near I-435 and I-470 in the south, and Highway 152 in the north are the only areas of Kansas City, Missouri, to have seen an increase in population, with the Northland seeing the greatest population growth.\n\nEconomy\n\nThe federal government is the largest employer in the Kansas City metro area. More than 146 federal agencies maintain a presence there. Kansas City is one of ten regional office cities for the US government.The Federal Workforce by the Numbers – Kansas City. Greater Kansas City Federal Executive Board. 2011. The Internal Revenue Service maintains a large service center in Kansas City that occupies nearly 1400000 sqft. It is one of only two sites to process paper returns. The IRS has approximately 2,700 full-time employees in Kansas City, growing to 4,000 during tax season. The General Services Administration has more than 800 employees. Most are at the Bannister Federal Complex in South Kansas City. The Bannister Complex is also home to the Kansas City Plant, which is a National Nuclear Security Administration facility operated by Honeywell. Honeywell employs nearly 2,700 at the Kansas City Plant, which produces and assembles 85% of the non-nuclear components of the United States nuclear bomb arsenal. The Social Security Administration has more than 1,700 employees in the Kansas City area, with more than 1,200 at its downtown Mid-America Program Service Center (MAMPSC). The United States Postal Service operates post offices in Kansas City. The Kansas City Main Post Office is at 300 West Pershing Road.\"[http://usps.whitepages.com/service/post_office/52521?p1&s\nMO&service_namepost_office&z\nKansas+City Post Office Location – Kansas City] .\" United States Postal Service. Retrieved on May 5, 2009.\n\nFord Motor Company operates a large manufacturing facility in Claycomo at the Ford Kansas City Assembly Plant, which builds the Ford F-150. The General Motors Fairfax Assembly Plant is in adjacent Kansas City, Kansas. Smith Electric Vehicles builds electric vehicles in the former TWA/American Airlines overhaul facility at Kansas City International Airport.\n\nOne of the largest US drug manufacturing plants is the Sanofi-Aventis plant in south Kansas City on a campus developed by Ewing Kauffman's Marion Laboratories. Of late, it has been developing academic and economic institutions related to animal health sciences, an effort most recently bolstered by the selection of Manhattan, Kansas, at one end of the[http://www.kansascity.com/105/story/921286.html Kansas City Star – Kansas Tops List for Biodefense Lab]  Kansas City Animal Health Corridor, as the site for the National Bio and Agro-Defense Facility, which researches animal diseases.\n\nNumerous agriculture companies operate out of the city. Dairy Farmers of America, the largest dairy co-op in the United States is located in northern Kansas City. Kansas City Board of Trade is the principal trading exchange for hard red winter wheat, the principal ingredient of bread. The National Association of Intercollegiate Athletics and The National Association of Basketball Coaches are based in Kansas City.\n\nThe business community is serviced by two major business magazines, the Kansas City Business Journal (published weekly) and Ingram's Magazine (published monthly), as well as other publications, including a local society journal, the Independent (published weekly).\n\nThe Kansas City Federal Reserve Bank built a new building that opened in 2008 near Union Station. Missouri is the only state to have two of the 12 Federal Reserve Bank headquarters (the second is in St. Louis). Kansas City's effort to get the bank was helped by former mayor James A. Reed, who as senator, broke a tie to pass the Federal Reserve Act.[http://stlouisfed.org/publications/foregone/chapter_three.htm A Foregone Conclusion: The Founding of the Federal Reserve Bank of St. Louis by James Neal Primm – stlouisfed.org – Retrieved January 1, 2007].\n\nThe national headquarters for the Veterans of Foreign Wars is headquartered just south of Downtown.\n\nWith a Gross Metropolitan Product of $41.68 billion in 2004, Kansas City's (Missouri side only) economy makes up 20.5% of Missouri's gross state product. In 2014, Kansas City was ranked #6 for real estate investment.Roberts, Rob.\" KC ranks among best places to own rental property.\" Kansas City Business Journal. February 2, 2014.\n\nThree international law firms, Lathrop & Gage, Stinson Leonard Street, and Shook, Hardy & Bacon are based in the city.\n\nHeadquarters\n\nThe following notable companies are headquartered in Kansas City, Missouri:\n\nTop employers\n\nAccording to the city's Fiscal Year 2014-15 Comprehensive Annual Financial Report, the top ten principal employers are as follows:\n\nCulture\n\nAbbreviations and nicknames\n\nKansas City is often abbreviated as KC (abbreviations often refer to the metropolitan area). It is officially nicknamed the \"City of Fountains\". The fountains at Kauffman Stadium, commissioned by original Kansas City Royals owner Ewing Kauffman, are the largest privately funded fountains in the world. The city has more boulevards than any other city except Paris and has been called \"Paris of the Plains\". Soccer's popularity, at both professional and youth levels, as well as Children's Mercy Park's popularity as a home stadium for the U.S. Men's National Team has to the appellation as the \" Soccer Capital of America\". Residents are known as Kansas Citians. The city is sometimes referred to as the \"Heart of America\", as it is near both the population center of the United States and the geographic center of the 48 contiguous states.\n\nPerforming arts\n\nThe Kansas City Repertory Theatre is the metropolitan area's top professional theatre company. The Starlight Theatre is an 8,105-seat outdoor theatre designed by Edward Delk. The Kansas City Symphony was founded by R. Crosby Kemper Jr. in 1982 to replace the defunct Kansas City Philharmonic, which was founded in 1933. The symphony performs at the Kauffman Center for the Performing Arts. Michael Stern is the symphony's music director and lead conductor. Lyric Opera of Kansas City, founded in 1958, performs at the Kauffman Center, offers one American contemporary opera production during its season, consisting of either four or five productions. The Civic Opera Theater of Kansas City performs at the downtown Folly Theater and at the UMKC Performing Arts Center. Every summer from mid-June to early July, The Heart of America Shakespeare Festival performs at Southmoreland Park near the Nelson-Atkins Museum; the festival was founded by Marilyn Strauss in 1993.\n\nThe Kansas City Ballet, founded in 1957 by Tatiana Dokoudovska, is a ballet troupe comprising 25 professional dancers and apprentices. Between 1986 and 2000, it combined with Dance St. Louis to form the State Ballet of Missouri, although it remained in Kansas City. From 1980 to 1995, the Ballet was run by dancer and choreographer Todd Bolender. Today, the Ballet offers an annual repertory split into three seasons, performing classical to contemporary ballets.Deborah Jowitt, [http://www.villagevoice.com/dance/0812,kansas-city-ballet-happy-fiftieth,381145,14.html Kansas City Ballet: Happy Fiftieth!] , The Village Voice, March 18, 2008 The Ballet also performs at the Kauffman Center. Kansas City is home to The Kansas City Chorale, a professional 24-voice chorus conducted by Charles Bruffy. The chorus performs an annual concert series and a concert in Phoenix each year with their sister choir, the Phoenix Chorale. The Chorale has made nine recordings (three with the Phoenix Chorale).\n\nKansas City jazz in the 1930s marked the transition from big bands to the bebop influence of the 1940s. The 1979 documentary The Last of the Blue Devils portrays this era in interviews and performances by local jazz notables. In the 1970s, Kansas City attempted to resurrect the glory of the jazz era in a family-friendly atmosphere. In the 1970s, an effort to open jazz clubs in the River Quay area of City Market along the Missouri ended in a gang war. Three of the new clubs were blown up in what ultimately ended Kansas City mob influence in Las Vegas casinos. The annual \"Kansas City Blues and Jazz Festival\" attracts top jazz stars and large out-of-town audiences. It was rated Kansas City's \"best festival.\" by Pitch.com.\n\nLive music venues are found throughout the city, with the highest concentration in the Westport entertainment district centered on Broadway and Westport Road near the Country Club Plaza, as well as the 18th & Vine area (jazz music). A variety of music genres can be heard and have originated there, including musicians Janelle Monáe, Puddle of Mudd, Isaac James, The Get Up Kids, Shiner, Flee The Seen, The Life and Times, Reggie and the Full Effect, Coalesce, The Casket Lottery, The Gadjits, The Rainmakers, Vedera, The Elders, Blackpool Lights, The Republic Tigers, Tech N9ne, Krizz Kaliko, Kutt Calhoun, Skatterman & Snug Brim, Mac Lethal, Ces Cru and Solè.\n\nIrish culture\n\nThe large community of Irish-Americans numbers over 50,000. The Irish were the first large immigrant group to settle in Kansas City and founded its first newspaper. The Irish community includes bands, dancers, newspapers, Irish stores and the Kansas City Irish Center at Drexel Hall in Midtown. The first book that detailed the history of the Irish in Kansas City was Missouri Irish: Irish Settlers on the American Frontier, published in 1984.\n\nCasinos\n\nMissouri voters approved riverboat casino gaming on the Missouri and Mississippi Rivers by referendum with a 63% majority on November 3, 1992. The first casino facility in the state opened in September 1994 in North Kansas City by Harrah's Entertainment (now Caesar's Entertainment). The combined revenues for four casinos exceeded $153 million per month in May 2008.[http://www.kansascity.com/business/story/663369.html The Kansas City Star, June 13, 2008: Missouri riverboat casinos' revenue increases in May.] The metropolitan area is home to six casinos: Ameristar Kansas City, Argosy Kansas City, Harrah's North Kansas City, Isle of Capri Kansas City, the 7th Street Casino (which opened in Kansas City, Kansas, in 2008) and Hollywood Casino (which opened in February 2012 in Kansas City, Kansas).\n\nCuisine\n\nKansas City is most famous for its steak and barbecue, along with the typical array of Southern cuisine. During the heyday of the Kansas City Stockyards, the city was known for its Kansas City steaks or Kansas City strip steaks. The most famous of its steakhouses is the Golden Ox in the Kansas City Live Stock Exchange in the West Bottoms stockyards. These stockyards were second only to those of Chicago in size, but they never recovered from the Great Flood of 1951 and eventually closed. Founded in 1938, Jess & Jim's Steakhouse in the Martin City neighborhood was also well known.\n\nThe Kansas City Strip cut of steak is similar to the New York Strip cut, and is sometimes referred to just as a strip steak. Along with Texas, Memphis, North and South Carolina, Kansas City is lauded as a \"world capital of barbecue.\" More than 90 barbecue restaurants operate in the metropolitan area. The American Royal each fall hosts what it claims is the world's biggest barbecue contest.\n\nClassic Kansas City-style barbecue was an inner-city phenomenon that evolved from the pit of Henry Perry from Memphis in the early 20th century and blossomed in the 18th and Vine neighborhood. Arthur Bryant's took over the Perry restaurant and added molasses to sweeten the recipe. In 1946 one of Perry's cooks opened Gates and Sons Bar-B-Q. The Gates recipe added even more molasses. Bryant's and Gates are the two definitive Kansas City barbecue restaurants. Both have only recently begun expanding outside of Kansas City. Fiorella's Jack Stack Barbecue is also well regarded. In 1977, Rich Davis, a psychiatrist, test-marketed his own concoction called K.C. Soul Style Barbecue Sauce. He renamed it KC Masterpiece, and in 1986, he sold the recipe to the Kingsford division of Clorox. Davis retained rights to operate restaurants using the name and sauce. In 2009, Kansas City appeared on Newsmax magazine's list of the \"Top 25 Most Uniquely American Cities and Towns,\" a piece written by CBS News travel editor Peter Greenberg. In determining his ranking, Greenberg cited the city's barbecue, among other factors.\n\nKansas City has several James Beard Award-winning/nominated chefs and restaurants. Winning chefs include Michael Smith, Celina Tio, Colby Garrelts, Debbie Gold, Jonathan Justus and Martin Heuser. A majority of the Beard Award-winning restaurants are in the Crossroads district, downtown and in Westport.\n\nPoints of interest\n\nSee List of points of interest in Kansas City, Missouri\n\nReligion\n\nThe proportion of Kansas City area residents with a known religious affiliation is 49.7%. The most common religious denominations in the area are:\n* None/No affiliation 50.3%\n* Catholic 12.82%\n* Other Christian 7.15%\n* Baptist (African American denominations) 6.72%\n* Baptist (Other) 6.46%\n* Methodist 5.87%\n* Pentecostal 2.60%\n* Latter-day Saint 2.48%\n* Lutheran 2.30%\n\nWalt Disney in Kansas City\n\nIn 1911, Elias Disney moved his family from Marceline to Kansas City. They lived in a new home with a garage built by Elias Disney, which became the location for Walt's very first animation, at 3028 Bellefontaine. In 1919, Walt Disney returned from France where he had served as a Red Cross Ambulance Driver in World War I. Walt started the first animation company Laugh-O-Gram Studio in Kansas City. Later, the company went bankrupt, Walt Disney moved to Hollywood, and started The Walt Disney Company on October 16, 1923.\n\nSports\n\nProfessional sports teams in Kansas City include the Kansas City Chiefs in the National Football League (NFL), the Kansas City Royals in Major League Baseball (MLB), Sporting Kansas City in Major League Soccer (MLS), and FC Kansas City in the National Women's Soccer League.\n\nProfessional football\n\nThe Chiefs – now a member of the NFL's American Football Conference (AFC) – started play in 1960 as the Dallas Texans and they moved to Kansas City in 1963. The team lost Super Bowl I to the Green Bay Packers. They came back in 1969 to become the last ever AFL champions and win Super Bowl IV against NFL champions Minnesota Vikings with a score of 23-7.\n\nProfessional baseball\n\nThe Athletics baseball franchise played in the city from 1955, after moving from Philadelphia, to 1967, when the team relocated to Oakland, California. The city's Major League Baseball franchise, the Royals, started play in 1969, and are the only major league sports franchise in Kansas City that has not relocated or changed its name. The Royals were the first American League expansion team to reach the playoffs, in 1976, to reach the World Series in 1980, and to win the World Series in 1985. The Royals returned to the World Series in 2014 and won in 2015.\n\nProfessional soccer\n\nThe Kansas City Wiz became a charter member of Major League Soccer in 1996. It was renamed the Kansas City Wizards in 1997. In 2011, the team was renamed Sporting Kansas City and moved to its new stadium Children's Mercy Park in Kansas City, Kansas. Sporting's reserve team, Swope Park Rangers, plays at Shawnee Mission District Stadium in Overland Park, Kansas. FC Kansas City began play in 2013 as an expansion team of the National Women's Soccer League; the team's home games are held at Swope Soccer Village.\n\nCollege athletics\n\nIn college athletics, Kansas City has lately been the home of the Big 12 College Basketball Tournaments. The men's tournament has been played at Sprint Center since March 2008. The women's tournament is played at Municipal Auditorium.\n\nIn addition to serving as the Chiefs' home stadium, Arrowhead Stadium serves as the venue for various intercollegiate football games. It has hosted the Big 12 Championship Game five times. On the last weekend in October, the MIAA Fall Classic rivalry game between Northwest Missouri State University and Pittsburg State University took place at the stadium.\n\nProfessional rugby\n\nKansas City is represented on the rugby pitch by the Kansas City Blues RFC, a former member of the Rugby Super League and a Division 1 club. The team works closely with Sporting Kansas City and splits home-games between Sporting's training pitch and Rockhurst University's stadium.\n\nFormer teams\n\nAlthough for a few short stints, Kansas City briefly had major league baseball teams, including the Kansas City Cowboys in the National League in 1886, a team of the same name in the then-major league American Association from 1888 to 1889, and the Kansas City Packers in the Federal League in 1914 and 1915, the city generally had to settle for minor league baseball until 1955. Before that year, the Kansas City Blues played in the high-level American Association minor league. In 1955, Kansas City became a major league city when the Philadelphia Athletics baseball franchise arrived in 1955. Following the 1967 season, the team relocated to Oakland, California.\n\nKansas City was also represented in the National Basketball Association by the Kansas City Kings (called the Kansas City-Omaha Kings from 1972 to 1975), when the former Cincinnati Royals moved to the Midwest. The team left Sacramento in 1985.\n\nIn 1974, the National Hockey League placed an expansion team in Kansas City called the Kansas City Scouts. The team moved to Denver in 1976, and today they are known as the New Jersey Devils.\n\nParks and boulevards\n\nKansas City has 132 mi of boulevards and parkways, 214 urban parks, 49 ornamental fountains, 152 ball diamonds, 10 community centers, 105 tennis courts, 5 golf courses, 5 museums and attractions, 30 pools, and 47 park shelters.[http://www.kcmo.org/parks/2008referencebook.pdf Parks & Recreation, 2008 Reference Book] [http://www.kcmo.org/parks.nsf/web/Aboutus Parks & Recreation, About Parks & Recreation]  These amenities are found across the city. Much of the system, designed by George E. Kessler, was constructed from 1893 to 1915.\n\nCliff Drive, in Kessler Park on the North Bluffs, is a designated State Scenic Byway. It extends  from The Paseo and Independence Avenue through Indian Mound on Gladstone Boulevard at Belmont Boulevard, with many historical points and architectural landmarks.\n\nWard Parkway, on the west side of the city near State Line Road, is lined by many of the city's largest and most elaborate homes.\n\nThe Paseo is a major north–south parkway that runs 19 mi through the center of the city beginning at Cliff Drive. It was modeled on the Paseo de la Reforma, a fashionable Mexico City boulevard.\n\nSwope Park is one of the nation's largest city parks, comprising 1805 acres, more than twice the size of New York City's Central Park.[http://www.kcmo.org/timeline.nsf/web/18960000?opendocument TimeLine 150]  It features a zoo, a woodland nature and wildlife rescue center, 2 golf courses, 2 lakes, an amphitheatre, a day-camp, and numerous picnic grounds. Hodge Park, in the Northland, covers 1029 acres (1.61 sq. mi.). This park includes the 80 acre Shoal Creek Living History Museum, a village of more than 20 historical buildings dating from 1807 to 1885. Berkely Riverfront Park, 955 acre on the banks of the Missouri River on the north edge of downtown, holds annual Independence Day celebrations and other festivals.\n\nA program went underway to replace many of the fast-growing sweetgum trees with hardwood varieties.[http://www.kcmo.org/planning/pdf/focus/NA_reports/triblen.pdf Focus Kansas City, Tri-Blenheim Neighbors United, report date: April 29, 2000] \n\nLaw and government\n\nCity government\n\nKansas City is home to the largest municipal government in the state of Missouri. The city has a council/manager form of government. The role of city manager has diminished over the years. The non-elective office of city manager was created following excesses during the Pendergast days. The mayor is the head of the Kansas City City Council, which has 12 members (one member for each district, plus one at large member per district). The mayor is the presiding member. Kansas City holds city elections in every fourth odd numbered year. The last citywide election was held in May 2015. The officials took office in August 2015 and will hold the position until 2019.\n\nPendergast was the most prominent leader during the machine politics days. The most nationally prominent Democrat associated with the machine was Harry S Truman, who became a Senator, Vice President and then President of the United States from 1945 to 1953. Kansas City is the seat of the United States District Court for the Western District of Missouri, one of two federal district courts in Missouri.  The United States District Court for the Eastern District of Missouri is in St. Louis. It also is the seat of the Western District of the Missouri Court of Appeals, one of three districts of that court (the Eastern District is in St. Louis and the Southern District is in Springfield).\n\nThe Mayor, City Council, and City Manager are listed below:\n\nNational political conventions\n\nKansas City hosted the 1900 Democratic National Convention, the 1928 Republican National Convention and the 1976 Republican National Convention. The urban core of Kansas City consistently votes Democratic in Presidential elections; however, on the state and local level Republicans often find success, especially in the Northland and other suburban areas of Kansas City.\n\nFederal representation\n\nKansas City is represented by three members of the United States House of Representatives:\n*Missouri's 4th congressional district – the southern portion of Kansas City in Cass County; represented by Vicky Hartzler (Republican)\n*Missouri's 5th congressional district – most of Kansas City proper in Jackson County, plus Independence and portions of Cass County; represented by Emanuel Cleaver (Democrat)\n*Missouri's 6th congressional district – all of Kansas City proper north of the Missouri River and plus suburbs in eastern Jackson County beyond Independence; represented by Sam Graves (Republican)\n\nCrime\n\nSome of the earliest organized violence in Kansas City erupted during the American Civil War. Shortly after the city's incorporation in 1850, so-called Bleeding Kansas erupted, affecting border ruffians and Jayhawkers. During the war, Union troops burned all occupied dwellings in Jackson County south of Brush Creek and east of Blue Creek to Independence in an attempt to halt raids into Kansas. After the war, the Kansas City Times turned outlaw Jesse James into a folk hero via its coverage. James was born in the Kansas City metro area at Kearney, Missouri, and notoriously robbed the Kansas City Fairgrounds at 12th Street and Campbell Avenue.\n\nIn the early 20th century under Pendergast, Kansas City became the country's \"most wide open town\". While this would give rise to Kansas City Jazz, it also led to the rise of the Kansas City mob (initially under Johnny Lazia), as well as the arrival of organized crime. In the 1970s, the Kansas City mob was involved in a gang war over control of the River Quay entertainment district, in which three buildings were bombed and several gangsters were killed. Police investigations gained after boss Nick Civella was recorded discussing gambling bets on Super Bowl IV (where the Kansas City Chiefs defeated the Minnesota Vikings). The war and investigation led to the end of mob control of the Stardust Casino, which was the basis for the film Casino (although the production minimizes the Kansas City connections).\n\nAs of November 2012, Kansas City ranked 18th on the Federal Bureau of Investigation (FBI)'s annual survey of crime rates for cities with populations over 100,000. Much of the city's violent crimes occur on the city's lower income East Side. Revitalizing the downtown and midtown areas has been fairly successful and now these areas have below average violent crime compared to major downtowns. According to a 2007 analysis by The Kansas City Star and the University of Missouri-Kansas City, downtown experienced the largest drop in crime of any neighborhood in the city during the 2000s.[http://www.downtownkc.org/content.aspx?pgID875&newsID\n579&exCompID=82 Downtown News] \n\nEducation\n\nColleges and universities\n\nMany universities, colleges, and seminaries are in the Kansas City metropolitan area, including:\n* University of Missouri–Kansas City − one of four schools in the University of Missouri system − serving more than 15,000 students\n* Rockhurst University − Jesuit university founded in 1910\n* Kansas City Art Institute − four-year college of fine arts and design founded in 1885\n* Kansas City University of Medicine and Biosciences − medical and graduate school founded in 1916\n* Avila University − Catholic university of the Sisters of St. Joseph of Carondelet\n* Park University − private institution established in 1875; Park University Graduate School is downtown\n* Baker University − multiple branches of the School of Professional and Graduate Studies\n* William Jewell College − private liberal arts institution founded in 1849\n* Metropolitan Community College (Kansas City) − a two-year college with multiple campuses in the suburban metropolitan area\n* Midwestern Baptist Theological Seminary − Southern Baptist Convention\n* Nazarene Theological Seminary − Church of the Nazarene\n* Calvary Bible College and Theological Seminary\n* Saint Paul School of Theology − Methodist\n\nPrimary and secondary schools\n\nKansas City is served by 16 school districts including 10 Public School Districts, with a significant portion being nationally ranked. There are also numerous private schools; Catholic schools in Kansas City are governed by the Diocese of Kansas City.\n\nThe following Public School Districts serve Kansas City:\n* Kansas City, MO School District\n* North Kansas City School District\n* Center School District\n* Hickman Mills C-1 School District\n* Grandview C-4 School District\n* Liberty School District\n* Park Hill School District\n* Platte County R-3 School District\n* Raytown C-2 School District\n* Lees Summit R-7 School District\n* Blue Springs R-4 School District\n* Independence School District\n* Fort Osage R-1 School District\n\nLibraries and archives\n\n* Linda Hall Library − internationally recognized independent library of science, engineering and technology, housing over one million volumes.\n* Mid-Continent Public Library − largest public library system in Missouri, and among the largest collections in America.\n* Kansas City Public Library − oldest library system in Kansas City.\n* University of Missouri-Kansas City Libraries − four collections: Leon E. Bloch Law Library and Miller Nichols Library, both on Volker Campus; and Health Sciences Library and Dental Library, both on Hospital Hill in Kansas City.\n* Rockhurst University Greenlease Library\n* [The Black Archives of Mid-America | http://blackarchives.org/] − research center of the African American experience in the central Midwest.\n* National Archives and Records Administration (NARA), Central Plains Region − one of 18 national records facilities, holding millions of archival records and microfilms for Iowa, Kansas, Missouri, and Nebraska in a new facility adjacent to Union Station, which was opened to the general public in 2008.\n\nMedia\n\nPrint media\n\nThe Kansas City Star is the area's primary newspaper. William Rockhill Nelson and his partner, Samuel Morss, first published the evening paper on September 18, 1880. The Star competed with the morning Kansas City Times before acquiring that publication in 1901. The \"Times\" name was discontinued in March 1990, when the morning paper was renamed the \"Star\".Harry Haskell, Boss-Busters and Sin Hounds: Kansas City and Its \"Star\" (Columbia: University of Missouri Press, 2007) \n\nWeekly newspapers include The Call (which is focused toward Kansas City's African-American community), the Kansas City Business Journal, The Pitch, Ink, and the bilingual publications Dos Mundos and KC Hispanic News.\n\nThe city is served by two major faith-oriented newspapers: The Kansas City Metro Voice, serving the Christian community, and the Kansas City Jewish Chronicle, serving the Jewish community. It also the headquarters of the National Catholic Reporter, an independent Catholic newspaper.\n\nBroadcast media\n\nThe Kansas City media market (ranked 32nd by Arbitron[http://www.arbitron.com/downloads/bluebook_sp08.pdf Arbitron, Inc., Spring '08 Blue Book, \"2008 Market Survey Schedule: All Markets,\"], p. 4 and 31st by Nielsen) includes 10 television stations, 30 FM and 21 AM radio stations. Kansas City broadcasting jobs have been a stepping stone for national television and radio personalities, notably Walter Cronkite and Mancow Muller.\n\nWDAF radio (610 AM, now at 106.5 FM; AM frequency now occupied by KCSP) signed on in 1927 as an affiliate of the NBC Red Network, under the ownership of The Star. In 1949, the Star signed on WDAF-TV as an affiliate of the NBC television network. The Star sold off the WDAF stations in 1957, following an antitrust investigation by the United States government (reportedly launched at Truman's behest, following a long-standing feud with the Star) over the newspaper's ownership of television and radio stations. KCMO radio (originally at 810 AM, now at 710 AM) signed on KCMO-TV (now KCTV) in 1953. The respective owners of WHB (then at 710 AM, now at 810 AM) and KMBC radio (980 AM, now KMBZ), Cook Paint and Varnish Company and the Midland Broadcasting Company, signed on WHB-TV/KMBC-TV as a time-share arrangement on VHF channel 9 in 1953; KMBC-TV took over channel 9 full-time in June 1954, after Cook Paint and Varnish purchased Midland Broadcasting's stations.\n\nThe major broadcast television networks have affiliates in the Kansas City market (covering 32 counties in northwestern Missouri, with the exception of counties in the far northwestern part of the state that are within the adjacent Saint Joseph market, and northeastern Kansas); including WDAF-TV 4 (Fox), KCTV 5 (CBS), KMBC-TV 9 (ABC), KCPT 19 (PBS), KCWE 29 (The CW), KSHB-TV 41 (NBC) and KSMO-TV 62 (MyNetworkTV). Other television stations in the market include Saint Joseph-based KTAJ-TV 16 (TBN), Kansas City, Kansas-based TV25.tv (consisting of three locally owned stations throughout northeast Kansas, led by KCKS-LD 25, affiliated with several digital multicast networks), Lawrence, Kansas-based KMCI-TV 38 (independent), Spanish-language station KUKC-LP 48 (Univision), and KPXE-TV 50 (Ion Television).\n\nFilm community\n\nKansas City has been a locale for film and television productions. Between 1931 and 1982 Kansas City was home to the Calvin Company, a large movie production company that specialized in promotional and sales short films and commercials for corporations, as well as educational films for schools and the government. Calvin was an important venue for Kansas City arts, training local filmmakers who went on to Hollywood careers and also employing local actors, most of whom earned their main income in fields such as radio and television announcing. Kansas City native Robert Altman directed movies at the Calvin Company, which led him to shoot his first feature film, The Delinquents, in Kansas City using many local players.\n\nThe 1983 television movie The Day After was filmed in Kansas City and Lawrence, Kansas. The 1990s film Truman, starring Gary Sinise, was filmed in the city. Other films shot in or around Kansas City include Article 99, Mr. & Mrs. Bridge, Kansas City, Paper Moon, In Cold Blood, Ninth Street, and Sometimes They Come Back (in and around nearby Liberty, Missouri). More recently, a scene in the controversial film Brüno was filmed in downtown Kansas City's historic Hotel Phillips.\n\nToday, Kansas City is home to an active independent film community. The Independent Filmmaker's Coalition is an organization dedicated to expanding and improving independent filmmaking in Kansas City. The city launched the KC Film Office in October 2014 with the goal of better marketing the city for prospective television shows and movies to be filmed there. The City Council passed several film tax incentives in February 2016 to take effect in May 2016; the KC Film Office is coordinating its efforts with the State of Missouri to reinstate film incentives on a statewide level.\n\nInfrastructure\n\nOriginally, Kansas City was the launching point for travelers on the Santa Fe, Oregon and California trails. Later, with the construction of the Hannibal Bridge across the Missouri River, it became the junction of 11 trunk railroads. More rail tonnage passes through the city than any other U.S. city. Trans World Airlines (TWA) located its headquarters in the city, and had ambitious plans to turn the city into an air hub.\n\nHighways\n\nMissouri and Kansas were the first states to start building interstates with Interstate 70. Interstate 435, which encircles the entire city, is the second longest beltway in the nation. (Interstate 275 around Cincinnati, Ohio is the longest.) The Kansas City metro area has more limited access highway lane-miles per capita than any other large US metro area, over 27% more than the second-place Dallas–Fort Worth metroplex, over 50% more than the average American metropolitan area. The Sierra Club blames the extensive freeway network for excessive sprawl and the decline of central Kansas City. On the other hand, the relatively uncongested road network contributes significantly to Kansas City's position as one of America's largest logistics hubs.[http://www.kcsmartport.com/sec_news/media/documents/ShippingCentral.pdf Kcsmartport.com] \n\nAirports\n\nKansas City International Airport was built to TWA's specifications to make a world hub. Its original passenger-friendly design placed each of its gates 100 ft from the street. Following the September 11, 2001, attacks, it required a costly overhaul to conform to the tighter security protocols. Charles B. Wheeler Downtown Airport was TWA's original headquarters and houses the Airline History Museum. It is still used for general aviation and airshows.\n\nPublic transportation\n\nLike most American cities, Kansas City's mass transit system was originally rail-based. From 1870 to 1957, Kansas City's streetcar system was among the top in the country, with over 300 mi of track at its peak. The rapid sprawl in the following years led this private system to be shut down.\n\nKCATA- RideKC\n\nOn December 28, 1965, the Kansas City Area Transportation Authority (KCATA) was formed via a bi-state compact created by the Missouri and Kansas legislatures. The compact gave the KCATA responsibility for planning, construction, owning and operating passenger transportation systems and facilities within the seven-county area.\n\nRideKC Bus and MAX\n\nIn July 2005, the KCATA launched Kansas City's first bus rapid transit line, the Metro Area Express (MAX). MAX links the River Market, Downtown, Union Station, Crown Center and the Country Club Plaza. This corridor employs over 150,000 workers. MAX operates and is marketed more like a rail system than a local bus line. A unique identity was created for MAX, including 13 modern diesel buses and easily identifiable \"stations\". MAX features (real-time GPS tracking of buses, available at every station), and stoplights automatically change in their favor if buses are behind schedule. In 2010, a second MAX line was added on Troost Avenue. The city is planning another MAX line down Prospect Avenue.\n\nRideKC Streetcar\n\nOn December 12, 2012, a ballot initiative to construct a $102 million, 2-mile (3200 m) modern streetcar line in downtown Kansas City was approved by local voters. The streetcar route runs along Main Street from the River Market to Union Station; it debuted on May 6, 2016. A new non-profit corporation made up of private sector stakeholders and city appointees – the Kansas City Streetcar Authority – operates and maintains the system. Unlike many similar systems around the U.S., no fare is to be charged initially. Residents within the proposed Transportation Development District are determining the fate of the KC Streetcar's southern extension through Midtown and the Plaza to UMKC. The Port Authority of Kansas City is also studying running an extension to Berkley Riverfront Park.\n\nRideKC Bridj\n\nIn 2015, the KCATA, Unified Government Transit, Johnson County Transit, and IndeBus (all separate metro services) began merging into one coordinated transit service for the Kansas City region, called RideKC. The buses and other transit options will be branded as: RideKC Bus, RideKC MAX, RideKC Streetcar, and RideKC Bridj. RideKC Bridj is a micro transit service partnership between Ford Bridj and KCATA that began on March 7, 2016. Users download the Bridj app and use the service much like a taxi service. The merger and full coordination is expected to be complete by 2019.\n\nWalkability\n\nA 2015 study by Walk Score ranked Kansas City as the 42nd most walkable out of the 50 largest U.S. cities. As a whole, the city has a score of 34 out of 100. However, several of the more densely populated neighborhoods have much higher scores: Westport has a score of 91; the Downtown Loop has a score of 85; the Crossroads scored 85; and the Plaza scored 83. Those ratings range from \"A Walker's Paradise\" to \"Very Walkable.\" In April 2017, voters approved an $800 million general obligation bond, part of which is designated for sidewalk repairs and creating complete-streets.\n\nSister cities\n\nKansas City has 14 sister cities:\n\nNotable people. Kansas City, Missouri. http://en.wikipedia.org/?curid=17454."
  }
}
