{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10951",
  "eid" : "f8a593d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778496909,
  "textBody" : "Fahrenheit 451 is a dystopian novel by American writer Ray Bradbury, published in 1953. It is regarded as one of his best works. The novel presents a future American society where books are outlawed and \"firemen\" burn any that are found. The book's tagline explains the title: \"Fahrenheit 451 – the temperature at which book paper catches fire, and burns...\" The lead character is a fireman named Montag who becomes disillusioned with the role of censoring works and destroying knowledge, eventually quitting his job and joining a resistance group who memorize and share the world's greatest literary and cultural works.\n\nThe novel has been the subject of interpretations focusing on the historical role of book burning in suppressing dissenting ideas. In a 1956 radio interview, Bradbury stated that he wrote Fahrenheit 451 because of his concerns at the time (during the McCarthy era) about the threat of book burning in the United States. In later years, he described the book as a commentary on how mass media reduces interest in reading literature.\n\nIn 1954, Fahrenheit 451 won the American Academy of Arts and Letters Award in Literature and the Commonwealth Club of California Gold Medal. It has since won the Prometheus \"Hall of Fame\" Award in 1984 and a 1954 \"Retro\" Hugo Award, one of only five Best Novel Retro Hugos ever given, in 2004. Bradbury was honored with a Spoken Word Grammy nomination for his 1976 audiobook version.\n\nAdaptations include François Truffaut's 1966 film adaptation of the novel and a 1982 BBC Radio dramatization. Bradbury published a stage play version in 1979 and helped develop a 1984 interactive fiction computer game titled Fahrenheit 451, and a collection of his short stories, A Pleasure to Burn.\n\nHBO is set to release a television film based on the novel in 2018.\n\nPlot summary\n\nFahrenheit 451 is set in an unspecified city (likely in the American Midwest) at an unspecified time in the futureDuring Captain Beatty's recounting of the history of the firemen to Montag, he says, \"Out of the nursery into the college and back to the nursery; there's your intellectual pattern for the past five centuries or more.\" The text is ambiguous regarding which century he is claiming began this pattern. One interpretation is that he means the 20th century, which would place the novel in at least the 24th century. \"The Fireman\" novella, which was expanded to become Fahrenheit 451, is set in October 2052. after the year 1960.In early editions of the book, Montag says, \"We've started and won two atomic wars since 1960\", in the first pages of The Sieve and the Sand. This sets a lower bound on the time setting. In later decades, some editions have changed this year to 1990 or 2022.\n\nThe novel is divided into three parts: \"The Hearth and the Salamander\", \"The Sieve and the Sand\", and \"Burning Bright\".\n\n\"The Hearth and the Salamander\"\n\nGuy Montag is a \"fireman\" employed to burn the possessions of those who read outlawed books. He is married and has no children. One fall night while returning from work, he meets his new neighbor, a teenage girl named Clarisse McClellan, whose free-thinking ideals and liberating spirit cause him to question his life and his own perceived happiness. Montag returns home to find that his wife Mildred has overdosed on sleeping pills, and he calls for medical attention. Two uncaring EMTs come over to pump Mildred's stomach, drain her poisoned blood, and fill her with new blood. After the EMTs leave to rescue another overdose victim, Montag watches over Mildred, watching the new blood fill her pallid cheeks. Montag then goes outside, overhearing Clarisse and her family talk about the way life is in this hedonistic, illiterate society. Montag's mind is bombarded with Clarisse's subversive thoughts and the memory of his wife's near-death. The next day, Montag finds Mildred in the kitchen, with no memory of what happened and talking incessantly about being hungry from an alleged hangover she has from a party she thought she attended last night. Over the next few days, Clarisse faithfully meets Montag as he walks home. She tells him about how her simple pleasures and interests make her an outcast among her peers and how she's forced to go to therapy for her behavior and thoughts. Montag looks forward to these meetings, and just as he begins to expect them, Clarisse goes absent. He senses something is wrong.\n\nIn the following days, while at work with the other firemen ransacking the book-filled house of an old woman before the inevitable burning, Montag steals a book before any of his coworkers notice. The woman refuses to leave her house and her books, choosing instead to light a match and burn herself alive. Montag returns home jarred by the woman's suicide. While getting ready for bed, he hides the stolen book under his pillow. Still shaken by the night's events, he attempts to make conversation with Mildred, starting by asking her when they first met and where. Mildred goes to answer, but immediately forgets. As she laughs off her ignorance and heads for the bathroom to take more sleeping pills, Montag realizes just how much Mildred's sleeping pill addiction, love of vapid, interactive entertainment, and fast, reckless driving has ruined her mind and their marriage. Later, as Mildred is sleeping, Montag wakes her up and asks her if she has seen or heard anything about Clarisse McClellan. Mildred initially brushes off the question until she finally reveals what happened: Clarisse's family moved away after Clarisse got hit by a speeding car and died four days ago. Dismayed by her failure to mention this earlier, Montag uneasily tries to fall asleep. Outside he suspects the presence of \"The Hound\", an eight-legged robotic dog-like creature that resides in the firehouse and aids the firemen.\n\nMontag awakens ill the next morning, with Mildred nagging him to get up and go to work. As Mildred tries to care for her husband (but finds herself more involved in the parlor wall entertainment in the next room), Montag suggests that maybe he should take a break from being a fireman after what happened last night. Mildred panics over the thought of losing the house and her parlor wall family and angrily blames the old woman who killed herself over her books for Montag's change of heart over his job. Captain Beatty, Montag's fire chief, personally visits Montag to see how he is doing. Sensing Montag's concerns, Beatty recounts how books lost their value and where the firemen fit in: over the course of several decades, people embraced new media (in this case, film and television), sports, and a quickening pace of life. Books were ruthlessly abridged or degraded to accommodate a short attention span while minority groups protested over the controversial, outdated content perceived to be found in literature (yet comic books, trade papers, and sex magazines were allowed to stay, as those fed into the population's want for mindless entertainment). The government took advantage of this by turning the firemen into officers of people's peace of mind. After an awkward encounter between Millie and Montag over the book hidden under Montag's pillow, Beatty is suspicious that Montag may have a book. Beatty casually adds a passing threat as he leaves, telling Montag that if a fireman had a book, he would be asked to burn it within the next 24 hours. If not, the other firemen would come and burn his house down for him. It's subtle, but the encounter leaves Montag shaken. He then decides to take action once and for all.\n\nAfter Beatty has left, Montag reveals to Mildred that, over the last year, he has accumulated a stash of books that he has kept hidden in their air-conditioning duct. In a panic, Mildred grabs a book and rushes to throw it in their kitchen incinerator. Montag subdues her and tells her that the two of them are going to read the books to see if they have value. If they do not, he promises the books will be burned, and all will return to normal.\n\n\"The Sieve and the Sand\"\n\nWhile Montag and Mildred are perusing the stolen books, a sniffing occurs at their front door. Montag recognizes it as The Hound while Mildred passes it off as a random dog. They resume their discussion once the sound ceases, but Mildred refuses to go along with it, questioning why she or anyone else should care about books. Montag goes on a rant about Mildred's suicide attempt, Clarisse's disappearance and death, the old woman who burned herself, and the constant din of bombers flying overhead and the imminent threat of war that goes ignored by the masses. He then states that maybe the books of the past have messages that can save society from its own destruction. The conversation is interrupted by a call from Mildred's friend, Mrs. Bowles, and they set up a date to watch the \"parlor walls\" (large televisions lining the walls of her living room) that night at Mildred's house.\n\nMontag, meanwhile, concedes that Mildred is a lost cause and he will need help to understand the books. Montag remembers an old man named Faber he once met in a park a year ago, an English professor before books were banned. He telephones Faber with questions about books, and Faber soon hangs up on him. Undeterred, Montag makes a subway trip to Faber's home along with a rare copy of the Bible, the book he stole at the woman's house. He tries to read it on the way, but gets distracted by a radio jingle for Denham's Dentifrice and nearly goes insane. Once he arrives at Faber's house, Montag forces the scared and reluctant Faber into helping him by methodically ripping pages from the Bible. Faber concedes and gives Montag a homemade ear-piece communicator so he can offer constant guidance.\n\nAfter Montag returns home, Mildred's friends, Mrs. Bowles and Mrs. Phelps, arrive to watch the \"parlor walls\". Not interested in this insipid entertainment, Montag turns off the walls and tries to engage the women in meaningful conversation, only for them to reveal just how indifferent, ignorant, and callous they are about the upcoming war, the thought of losing loved ones to death, their unruly children, and who they voted for in the last election. Enraged by their idiocy, Montag leaves momentarily and returns with a book of poetry. This confuses the women and alarms Faber, who is listening remotely. Mildred tries to dismiss Montag's actions as a tradition fireman do once a year: they find a book from the past and read it as a way to make fun of how silly the past is. Montag proceeds to recite the poem Dover Beach, causing Mrs. Phelps to cry. At the behest of Faber in the ear-piece, Montag burns the book. Mildred's friends leave in disgust, while Mildred locks herself in the bathroom and takes more sleeping pills.\n\nIn the aftermath of the parlor party, Montag hides his books in his backyard before returning to the firehouse late at night with just the stolen Bible. He finds Beatty playing cards with the other firemen. Montag hands Beatty a book to cover for the one he believes Beatty knows he stole the night before, which is unceremoniously tossed into the trash. Beatty tells Montag that he had a dream in which they fought endlessly by quoting books to each other. In describing the dream Beatty reveals that, despite his disillusionment, he was once an enthusiastic reader. A fire alarm sounds, and Beatty picks up the address from the dispatcher system. They drive in the firetruck recklessly to the destination. Montag is stunned when the truck arrives at his house.\n\n\"Burning Bright\"\n\nBeatty orders Montag to destroy his own house, telling him that his wife and her friends reported him after what happened the other night. Montag watches as Mildred walks out of the house, too traumatized about losing her parlor wall family to even acknowledge her husband's existence or the situation going on around her, and catches a taxi, never once looking back. Montag obeys the chief, destroying the home piece by piece with a flamethrower. As soon as he has incinerated the house, Beatty discovers Montag's ear-piece and plans to hunt down Faber. Montag threatens Beatty with the flamethrower and (after Beatty taunts him) burns his boss alive, and knocks his coworkers unconscious. As Montag escapes the scene, the firehouse's mechanical dog attacks him, managing to inject his leg with a tranquilizer. He destroys The Hound with the flamethrower and limps away.\n\nMontag runs through the city streets towards Faber's house. Faber urges him to make his way to the countryside and contact the exiled book-lovers who live there. He mentions he will be leaving on an early bus heading to St. Louis and that he and Montag can rendezvous there later. On Faber's television, they watch news reports of another mechanical hound being released, with news helicopters following it to create a public spectacle. After successfully wiping Montag's scent from around the house in hopes of deterring the hound, Montag leaves Faber's house. After an extended manhunt, he escapes by wading into a river and floating downstream.\n\nMontag leaves the river in the countryside, where he meets the exiled drifters, led by a man named Granger. They have each memorized books should the day come that society comes to an end, then rebuilds itself anew; this time, with the survivors learning to embrace the literature of the past. While learning the philosophy of the exiles, Montag and the group watch helplessly as bombers fly overhead and annihilate the city with nuclear weapons. While Faber would have left on the early bus, everyone else (including Mildred) was immediately killed. Montag and the group are injured and dirtied, but manage to survive the shock wave.\n\nThe following morning, Granger teaches Montag and the others about the legendary phoenix and its endless cycle of long life, death in flames, and rebirth. He adds that the phoenix must have some relationship to mankind, which constantly repeats its mistakes. Granger explains that man has something the phoenix does not: mankind can remember its mistakes and try never to repeat them. Granger then muses that a large factory of mirrors should be built, so that way people can take a long look at themselves and reflect on their lives. When the meal is over, the exiles return to the city to rebuild society.\n\nCharacters\n\n* Guy Montag is the protagonist and fireman who presents the dystopia through the eyes of a worker loyal to it, a man in conflict about it, and someone resolved to be free of it. Through most of the book, Montag lacks knowledge and believes what he hears.\n* Clarisse McClellan walks with Montag on his trips home and is one month short of her 17th birthday.Clarisse tells Montag she is \"seventeen and crazy\", later admitting that she will actually be seventeen \"next month\". She is an unusual sort of person in the bookless, hedonistic society: outgoing, naturally cheerful, unorthodox, and intuitive. She is unpopular among peers and disliked by teachers for asking \"why\" instead of \"how\" and focusing on nature rather than on technology. A few days after their first meeting, she disappears without any explanation; Mildred tells Montag (and Captain Beatty confirms) that Clarisse was hit by a speeding car and that her family left following her death. In the afterword of a later edition, Bradbury notes that the film adaptation changed the ending so that Clarisse (who, in the film, is now a 20-year-old school teacher who was fired for being unorthodox) was living with the exiles. Bradbury, far from being displeased by this, was so happy with the new ending that he wrote it into his later stage edition.\n* Mildred \"Millie\" Montag is Guy Montag's wife. She is addicted to sleeping pills, absorbed in the shallow dramas played on her \"parlor walls\" (flat-panel televisions), and indifferent to the oppressive society around her. She is described in the book as \"thin as a praying mantis from dieting, her hair burnt by chemicals to a brittle straw, and her flesh like white bacon.\" Despite her husband's attempts to break her from the spell society has on her, Mildred continues to be shallow and indifferent. After Montag scares her friends away by reading Dover Beach and unable to live with someone who has been hoarding books, Mildred betrays Montag by reporting him to the firemen and abandoning him.\n* Captain Beatty is Montag's boss. Once an avid reader, he has come to hate books due to their unpleasant content, and contradicting facts and opinions. In a scene written years later by Bradbury for the Fahrenheit 451 play, Beatty invites Montag to his house where he shows him walls of books left to molder on their shelves.\n* Stoneman and Black are Montag's coworkers at the firehouse. They do not have a large impact on the story and function to show the reader the contrast between the firemen who obediently do as they're told and someone like Montag, who formerly took pride in his job but subsequently realizes how damaging it is to society.\n* Faber is a former English professor. He has spent years regretting that he did not defend books when he saw the moves to ban them. Montag turns to him for guidance, remembering him from a chance meeting in a park sometime earlier. Faber at first refuses to help Montag, and later realizes Montag is only trying to learn about books, not destroy them. Bradbury notes in his afterword that Faber is part of the name of a German manufacturer of pencils, Faber-Castell.\n* Mrs. Ann Bowles and Mrs. Clara Phelps are Mildred's friends and representative of the anti-intellectual, hedonistic society presented in the novel. During a social visit to Montag's house, they brag about ignoring the bad things in their lives and have a cavalier attitude towards the upcoming war, their husbands, their children, and politics. Mrs. Phelps' husband Pete was called in to fight in the upcoming war (and believes that he'll be back in a week because of how quick the war will be) and thinks having children serves no purpose other than to ruin lives. Mrs. Bowles is a thrice married, single mother. Her first husband divorced her, her second died in a jet accident, and her third committed suicide by shooting himself in the head. She has two children who do not like or respect her due to her permissive, often negligent and abusive parenting; Mrs. Bowles brags that her kids beat her up, and she's glad she can hit back. When Montag reads Dover Beach to them, he strikes a chord in Mrs. Phelps, who starts crying over how hollow her life is. Mrs. Bowles chastises Montag for reading \"silly awful hurting words\".\n* Granger is the leader of a group of wandering intellectual exiles who memorize books in order to preserve their contents.\n\nTitle\n\nThe title refers to the temperature 451 F that Bradbury thought was the autoignition temperature of paper. Though this is popularly believed to be correct, scientists place the autoignition temperature at 424 – depending on the study and type of paper.\n\nHistorical context\n\nBradbury's lifelong passion for books began at an early age. As a frequent visitor to his local libraries in the 1920s and 1930s, he recalls being disappointed because they did not stock popular science fiction novels, like those of H. G. Wells', because, at the time, they were not deemed literary enough. Between this and learning about the destruction of the Library of Alexandria, a great impression was made on the young man about the vulnerability of books to censure and destruction. Later, as a teenager, Bradbury was horrified by the Nazi book burnings and later by Joseph Stalin's campaign of political repression, the \"Great Purge\", in which writers and poets, among many others, were arrested and often executed.\n\nAfter the 1945 conclusion of World War II, shortly after the atomic bombings of Hiroshima and Nagasaki, the United States focused its concern on the Soviet atomic bomb project and the expansion of communism. The House Un-American Activities Committee (HUAC), formed in 1938 to investigate American citizens and organizations suspected of having communist ties, held hearings in 1947 to investigate alleged communist influence in Hollywood movie-making. These hearings resulted in the blacklisting of the so-called \"Hollywood Ten\", a group of influential screenwriters and directors. This governmental interference in the affairs of artists and creative types greatly angered Bradbury. Bradbury was bitter and concerned about the workings of his government, and a late 1949 nighttime encounter with an overzealous police officer would inspire Bradbury to write \"The Pedestrian\", a short story which would go on to become \"The Fireman\" and then Fahrenheit 451. The rise of Senator Joseph McCarthy's hearings hostile to accused communists, starting in 1950 deepened Bradbury's contempt for government overreach.\n\nThe year HUAC began investigating Hollywood is often considered the beginning of the Cold War, as in March 1947, the Truman Doctrine was announced. By about 1950, the Cold War was in full swing, and the American public's fear of nuclear warfare and communist influence was at a feverish level. The stage was set for Bradbury to write the dramatic nuclear holocaust ending of Fahrenheit 451, exemplifying the type of scenario feared by many Americans of the time.\n\nBradbury's early life witnessed the Golden Age of Radio, while the transition to the Golden Age of Television began right around the time he started to work on the stories that would eventually lead to Fahrenheit 451. Bradbury saw these forms of media as a threat to the reading of books, indeed as a threat to society, as he believed they could act as a distraction from important affairs. This contempt for mass media and technology would express itself through Mildred and her friends and is an important theme in the book.\n\nWriting and development\n\nFahrenheit 451 developed out of a series of ideas Bradbury had visited in previously written stories. For many years, he tended to single out \"The Pedestrian\" in interviews and lectures as sort of a proto-Fahrenheit 451. In the Preface of his 2006 anthology Match to Flame: The Fictional Paths to Fahrenheit 451 he states that this is an oversimplification. The full genealogy of Fahrenheit 451 given in Match to Flame is involved. The following covers the most salient aspects.\n\nBetween 1947 and 1948, Bradbury wrote the short story \"Bright Phoenix\" (not published until the May 1963 issue of The Magazine of Fantasy & Science Fiction) about a librarian who confronts a book-burning \"Chief Censor\" named Jonathan Barnes.\n\nIn late 1949, Bradbury was stopped and questioned by a police officer while walking late one night. When asked \"What are you doing?\", Bradbury wisecracked, \"Putting one foot in front of another.\" This incident inspired Bradbury to write the 1951 short story \"The Pedestrian\".\"The Pedestrian\" would go on to be published in The Reporter magazine on August 7, 1951, that is, after the publication in February 1951 of its inspired work \"The Fireman\".\n\nIn The Pedestrian, Leonard Mead is harassed and detained by the city's remotely operated police cruiser (there's only one) for taking nighttime walks, something that has become extremely rare in this future-based setting: everybody else stays inside and watches television (\"viewing screens\"). Alone and without an alibi, Mead is taken to the \"Psychiatric Center for Research on Regressive Tendencies\" for his peculiar habit. Fahrenheit 451 would later echo this theme of an authoritarian society distracted by broadcast media.\n\nBradbury expanded the book-burning premise of \"Bright Phoenix\" and the totalitarian future of \"The Pedestrian\" into \"The Fireman\", a novella published in the February 1951 issue of Galaxy Science Fiction. \"The Fireman\" was written in the basement of UCLA's Powell Library on a typewriter that he rented for a fee of ten cents per half hour. The first draft was 25,000 words long and was completed in nine days.\n\nUrged by a publisher at Ballantine Books to double the length of his story to make a novel, Bradbury returned to the same typing room and expanded his work into Fahrenheit 451, again taking just nine days. The fixup was published by Ballantine in 1953.\n\nSupplementary material\n\nBradbury has supplemented the novel with various front and back matter, including a 1979 coda, a 1982 afterword, a 1993 foreword, and several introductions.\n\nPublication history\n\nThe first U.S. printing was a paperback version from October 1953 by The Ballantine Publishing Group. Shortly after the paperback, a hardback version was released that included a special edition of 200 signed and numbered copies bound in asbestos. These were technically collections because the novel was published with two short stories: The Playground and And the Rock Cried Out, which have been absent in later printings. A few months later, the novel was serialized in the March, April, and May 1954 issues of nascent Playboy magazine.\n\nExpurgation\n\nStarting in January 1967, Fahrenheit 451 was subject to expurgation by its publisher, Ballantine Books with the release of the \"Bal-Hi Edition\" aimed at high school students. Among the changes made by the publisher were the censorship of the words \"hell\", \"damn\", and \"abortion\"; the modification of seventy-five passages; and the changing of two episodes.\n\nIn the one case, a drunk man became a \"sick man\" while cleaning fluff out of a human navel became \"cleaning ears\" in the other. For a while both the censored and uncensored versions were available concurrently but by 1973 Ballantine was publishing only the censored version. This continued until 1979 when it came to Bradbury's attention:\n\nIn 1979, one of Bradbury's friends showed him an expurgated copy. Bradbury demanded that Ballantine Books withdraw that version and replace it with the original, and in 1980 the original version once again became available. In this reinstated work, in the Author's Afterword, Bradbury relates to the reader that it is not uncommon for a publisher to expurgate an author's work, but he asserts that he himself will not tolerate the practice of manuscript \"mutilation\".\n\nThe \"Bal-Hi\" editions are now referred to by the publisher as the \"Revised Bal-Hi\" editions.\n\nNon-print publications\n\nAn audiobook version read by Bradbury himself was released in 1976 and received a Spoken Word Grammy nomination. Another audiobook was released in 2005 narrated by Christopher Hurt. The e-book version was released in December 2011.\n\nReception\n\nIn 1954, Galaxy Science Fiction reviewer Groff Conklin placed the novel \"among the great works of the imagination written in English in the last decade or more.\" The Chicago Sunday Tribunes August Derleth described the book as \"a savage and shockingly savage prophetic view of one possible future way of life\", calling it \"compelling\" and praising Bradbury for his \"brilliant imagination\". Over half a century later, Sam Weller wrote, \"upon its publication, Fahrenheit 451 was hailed as a visionary work of social commentary.\" Today, Fahrenheit 451 is still viewed as an important cautionary tale against conformity and book burning.\n\nWhen the book was first published, there were those who did not find merit in the tale. Anthony Boucher and J. Francis McComas were less enthusiastic, faulting the book for being \"simply padded, occasionally with startlingly ingenious gimmickry, ... often with coruscating cascades of verbal brilliance [but] too often merely with words.\"\"Recommended Reading\", F&SF, December 1953, p. 105. Reviewing the book for Astounding Science Fiction, P. Schuyler Miller characterized the title piece as \"one of Bradbury's bitter, almost hysterical diatribes,\" while praising its \"emotional drive and compelling, nagging detail.\"\"The Reference Library\", Astounding Science Fiction, April 1954, pp. 145–46 Similarly, The New York Times was unimpressed with the novel and further accused Bradbury of developing a \"virulent hatred for many aspects of present-day culture, namely, such monstrosities as radio, TV, most movies, amateur and professional sports, automobiles, and other similar aberrations which he feels debase the bright simplicity of the thinking man's existence.\"\n\nCensorship/banning incidents\n\nIn the years since its publication, Fahrenheit 451 has occasionally been banned, censored, or redacted in some schools by parents and teaching staff either unaware of or indifferent to the inherent irony of such censorship. The following are some notable incidents:\n* In 1987, Fahrenheit 451 was given \"third tier\" status by the Bay County School Board in Panama City, Florida, under then-superintendent Leonard Hall's new three-tier classification system. Third tier was meant for books to be removed from the classroom for \"a lot of vulgarity\". After a resident class-action lawsuit, a media stir, and student protests, the school board abandoned their tier-based censorship system and approved all the currently used books.\n* In 1992, Venado Middle School in Irvine, California, gave copies of Fahrenheit 451 to students with all \"obscene\" words blacked out. Parents contacted the local media and succeeded in reinstalling the uncensored copies.\n* In 2006, parents of a 10th-grade high school student in Montgomery County, Texas, demanded the book be banned from their daughter's English class reading list. Their daughter was assigned the book during Banned Books Week, but stopped reading several pages in due to the offensive language and description of the burning of the Bible. In addition, the parents protested the violence, portrayal of Christians, and depictions of firemen in the novel.\n\nThemes\n\nDiscussions about Fahrenheit 451 often center on its story foremost as a warning against state-based censorship. Indeed, when Bradbury wrote the novel during the McCarthy era, he was concerned about censorship in the United States. During a radio interview in 1956, Bradbury said:I wrote this book at a time when I was worried about the way things were going in this country four years ago. Too many people were afraid of their shadows; there was a threat of book burning. Many of the books were being taken off the shelves at that time. And of course, things have changed a lot in four years. Things are going back in a very healthy direction. But at the time I wanted to do some sort of story where I could comment on what would happen to a country if we let ourselves go too far in this direction, where then all thinking stops, and the dragon swallows his tail, and we sort of vanish into a limbo and we destroy ourselves by this sort of action.\n\nAs time went by, Bradbury tended to dismiss censorship as a chief motivating factor for writing the story. Instead he usually claimed that the real messages of Fahrenheit 451 were about the dangers of an illiterate society infatuated with mass media and the threat of minority and special interest groups to books. In the late 1950s, Bradbury recounted:In writing the short novel Fahrenheit 451, I thought I was describing a world that might evolve in four or five decades. But only a few weeks ago, in Beverly Hills one night, a husband and wife passed me, walking their dog. I stood staring after them, absolutely stunned. The woman held in one hand a small cigarette-package-sized radio, its antenna quivering. From this sprang tiny copper wires which ended in a dainty cone plugged into her right ear. There she was, oblivious to man and dog, listening to far winds and whispers and soap-opera cries, sleep-walking, helped up and down curbs by a husband who might just as well not have been there. This was not fiction.Quoted by Kingsley Amis in New Maps of Hell: A Survey of Science Fiction (1960). Bradbury directly foretells this incident early in the work: \"And in her ears the little Seashells, the thimble radios tamped tight, and an electronic ocean of sound, of music and talk and music and talking coming in.\" p.12\n\nThis story echoes Mildred's \"Seashell ear-thimbles\" (i.e., a brand of in-ear headphones) that act as an emotional barrier between her and Montag. In a 2007 interview, Bradbury maintained that people misinterpret his book and that Fahrenheit 451 is really a statement on how mass media like television marginalizes the reading of literature. Regarding minorities, he wrote in his 1979 Coda:There is more than one way to burn a book. And the world is full of people running about with lit matches. Every minority, be it Baptist/Unitarian, Irish/Italian/Octogenarian/Zen Buddhist, Zionist/Seventh-day Adventist, Women's Lib/Republican, Mattachine/Four Square Gospel feels it has the will, the right, the duty to douse the kerosene, light the fuse. [...] Fire-Captain Beatty, in my novel Fahrenheit 451, described how the books were burned first by minorities, each ripping a page or a paragraph from this book, then that, until the day came when the books were empty and the minds shut and the libraries closed forever. [...] Only six weeks ago, I discovered that, over the years, some cubby-hole editors at Ballantine Books, fearful of contaminating the young, had, bit by bit, censored some seventy-five separate sections from the novel. Students, reading the novel, which, after all, deals with censorship and book-burning in the future, wrote to tell me of this exquisite irony. Judy-Lynn del Rey, one of the new Ballantine editors, is having the entire book reset and republished this summer with all the damns and hells back in place.\n\nBook-burning censorship, Bradbury would argue, was a side-effect of these two primary factors; this is consistent with Captain Beatty's speech to Montag about the history of the firemen. According to Bradbury, it is the people, not the state, who are the culprit in Fahrenheit 451. Nevertheless, the role on censorship, state-based or otherwise, is still perhaps the most frequent theme explored in the work.\n\nA variety of other themes in the novel besides censorship have been suggested. Two major themes are resistance to conformity and control of individuals via technology and mass media. Bradbury explores how the government is able to use mass media to influence society and suppress individualism through book burning. The characters Beatty and Faber point out the American population is to blame. Due to their constant desire for a simplistic, positive image, books must be suppressed. Beatty blames the minority groups, who would take offense to published works that displayed them in an unfavorable light. Faber went further to state that the American population simply stopped reading on their own. He notes that the book burnings themselves became a form of entertainment to the general public.\n\nPredictions for the future\n\nBradbury described himself as \"a preventor of futures, not a predictor of them.\" He did not believe that book burning was an inevitable part of the future; he wanted to warn against its development. In a later interview, when asked if he believes that teaching Fahrenheit 451 in schools will prevent his totalitarian vision of the future, Bradbury replied in the negative. Rather, he states that education must be at the kindergarten and first-grade level. If students are unable to read then, they will be unable to read Fahrenheit 451.\n\nIn terms of technology, Sam Weller notes that Bradbury \"predicted everything from flat-panel televisions to earbud headphones and twenty-four-hour banking machines.\"\n\nAdaptations\n\nPlayhouse 90 broadcast \"A Sound of Different Drummers\" on CBS in 1957, written by Robert Alan Aurthur. The play combined plot ideas from Fahrenheit 451 and Nineteen Eighty-Four. Bradbury sued and eventually won on appeal.\n\nA film adaptation written and directed by François Truffaut and starring Oskar Werner and Julie Christie was released in 1966.\n\nIn the late 1970s Bradbury adapted his book into a play. At least part of it was performed at the Colony Theatre in Los Angeles in 1979, but it was not in print until 1986 and the official world premiere was only in November 1988 by the Fort Wayne, Indiana Civic Theatre. The stage adaptation diverges considerably from the book and seems influenced by Truffaut's movie. For example, fire chief Beatty's character is fleshed out and is the wordiest role in the play. As in the movie, Clarisse does not simply disappear but in the finale meets up with Montag as a book character (she as Robert Louis Stevenson, he as Edgar Allan Poe).[http://home.wlv.ac.uk/~in5379/books/451_play.htm Fahrenheit 451 (play)], BradburyMedia; accessed September 17, 2016.\n\nBBC Radio produced a one-off dramatization of the novel in 1982 starring Michael Pennington. It was broadcast again on February 12, 2012, and April 7 and 8, 2013, on BBC Radio 4 Extra.\n\nIn 1984, the novel was adapted into a computer text adventure game of the same name by the software company Trillium.\n\nThe UK premiere of Bradbury's stage adaptation was not until 2003 in Nottingham, while it took until 2006 before the Godlight Theatre Company produced and performed its New York City premiere at 59E59 Theaters. After the completion of the New York run, the production then transferred to the Edinburgh Festival where it was a 2006 Edinburgh Festival Pick of the Fringe.\n\nThe Off-Broadway theatre The American Place Theatre presented a one man show adaptation of Fahrenheit 451 as a part of their 2008–2009 Literature to Life season.\n\nIn June 2009, a graphic novel edition of the book was published. Entitled Ray Bradbury's Fahrenheit 451: The Authorized Adaptation, the paperback graphic adaptation was illustrated by Tim Hamilton. The introduction in the novel is written by Bradbury.\n\nFahrenheit 451 inspired the Birmingham Repertory Theatre production Time Has Fallen Asleep in the Afternoon Sunshine, which was performed at the Birmingham Central Library in April 2012.\n\nA new film adaptation is in production for HBO, directed by Ramin Bahrani and starring Michael B. Jordan and Michael Shannon. Sofia Boutella, Lilly Singh, and Laura Harrier joined the cast in June 2017.\n\nCultural references\n\nMichael Moore's 2004 documentary Fahrenheit 9/11 refers to Bradbury's novel and the September 11 attacks, emphasized by the film's tagline \"The temperature where freedom burns\". The film takes a critical look at the presidency of George W. Bush, the War on Terror, and its coverage in the news media, and became the highest grossing documentary of all time. Bradbury was upset by what he considered the appropriation of his title, and wanted the film renamed.\n\nIn 2015, the Internet Engineering Steering Group approved the publication of An HTTP Status Code to Report Legal Obstacles, now RFC 7725, which specifies that websites forced to block resources for legal reasons should return a status code of 451 when users request those resources.\n\nCentigrade 232 is a poem by Robert Calvert, published in a 1977 book and released as an album in 2007. The title alludes to Fahrenheit 451 by its metric equivalent, \"signifying the writer destroying his rough drafts\".[http://www.aural-innovations.com/robertcalvert/works/calvertworks3.htm www.aural-innovations.com] – The works of Robert Calvert –  part III: 1976 – '78\n\nIn the book 14 of the Guardians of Ga'Hoole series by Kathryn Lasky, published in 2008, Braithe states that the name of the Place of Living Books, also called Brad, comes from an author's name : \"The author's full name is not known. We call him Ray Brad. We think it's only scraps of his name but what is important is that he wrote about book burning.\" thus referencing Fahrenheit 451.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fahrenheit 451" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10951" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Fahrenheit 451 is a dystopian novel by American writer Ray Bradbury, published in 1953. It is regarded as one of his best works. The novel presents a future American society where books are outlawed and \"firemen\" burn any that are found. The book's tagline explains the title: \"Fahrenheit 451 – the temperature at which book paper catches fire, and burns...\" The lead character is a fireman named Montag who becomes disillusioned with the role of censoring works and destroying knowledge, eventually quitting his job and joining a resistance group who memorize and share the world's greatest literary and cultural works.\n\nThe novel has been the subject of interpretations focusing on the historical role of book burning in suppressing dissenting ideas. In a 1956 radio interview, Bradbury stated that he wrote Fahrenheit 451 because of his concerns at the time (during the McCarthy era) about the threat of book burning in the United States. In later years, he described the book as a commentary on how mass media reduces interest in reading literature.\n\nIn 1954, Fahrenheit 451 won the American Academy of Arts and Letters Award in Literature and the Commonwealth Club of California Gold Medal. It has since won the Prometheus \"Hall of Fame\" Award in 1984 and a 1954 \"Retro\" Hugo Award, one of only five Best Novel Retro Hugos ever given, in 2004. Bradbury was honored with a Spoken Word Grammy nomination for his 1976 audiobook version.\n\nAdaptations include François Truffaut's 1966 film adaptation of the novel and a 1982 BBC Radio dramatization. Bradbury published a stage play version in 1979 and helped develop a 1984 interactive fiction computer game titled Fahrenheit 451, and a collection of his short stories, A Pleasure to Burn.\n\nHBO is set to release a television film based on the novel in 2018.\n\nPlot summary\n\nFahrenheit 451 is set in an unspecified city (likely in the American Midwest) at an unspecified time in the futureDuring Captain Beatty's recounting of the history of the firemen to Montag, he says, \"Out of the nursery into the college and back to the nursery; there's your intellectual pattern for the past five centuries or more.\" The text is ambiguous regarding which century he is claiming began this pattern. One interpretation is that he means the 20th century, which would place the novel in at least the 24th century. \"The Fireman\" novella, which was expanded to become Fahrenheit 451, is set in October 2052. after the year 1960.In early editions of the book, Montag says, \"We've started and won two atomic wars since 1960\", in the first pages of The Sieve and the Sand. This sets a lower bound on the time setting. In later decades, some editions have changed this year to 1990 or 2022.\n\nThe novel is divided into three parts: \"The Hearth and the Salamander\", \"The Sieve and the Sand\", and \"Burning Bright\".\n\n\"The Hearth and the Salamander\"\n\nGuy Montag is a \"fireman\" employed to burn the possessions of those who read outlawed books. He is married and has no children. One fall night while returning from work, he meets his new neighbor, a teenage girl named Clarisse McClellan, whose free-thinking ideals and liberating spirit cause him to question his life and his own perceived happiness. Montag returns home to find that his wife Mildred has overdosed on sleeping pills, and he calls for medical attention. Two uncaring EMTs come over to pump Mildred's stomach, drain her poisoned blood, and fill her with new blood. After the EMTs leave to rescue another overdose victim, Montag watches over Mildred, watching the new blood fill her pallid cheeks. Montag then goes outside, overhearing Clarisse and her family talk about the way life is in this hedonistic, illiterate society. Montag's mind is bombarded with Clarisse's subversive thoughts and the memory of his wife's near-death. The next day, Montag finds Mildred in the kitchen, with no memory of what happened and talking incessantly about being hungry from an alleged hangover she has from a party she thought she attended last night. Over the next few days, Clarisse faithfully meets Montag as he walks home. She tells him about how her simple pleasures and interests make her an outcast among her peers and how she's forced to go to therapy for her behavior and thoughts. Montag looks forward to these meetings, and just as he begins to expect them, Clarisse goes absent. He senses something is wrong.\n\nIn the following days, while at work with the other firemen ransacking the book-filled house of an old woman before the inevitable burning, Montag steals a book before any of his coworkers notice. The woman refuses to leave her house and her books, choosing instead to light a match and burn herself alive. Montag returns home jarred by the woman's suicide. While getting ready for bed, he hides the stolen book under his pillow. Still shaken by the night's events, he attempts to make conversation with Mildred, starting by asking her when they first met and where. Mildred goes to answer, but immediately forgets. As she laughs off her ignorance and heads for the bathroom to take more sleeping pills, Montag realizes just how much Mildred's sleeping pill addiction, love of vapid, interactive entertainment, and fast, reckless driving has ruined her mind and their marriage. Later, as Mildred is sleeping, Montag wakes her up and asks her if she has seen or heard anything about Clarisse McClellan. Mildred initially brushes off the question until she finally reveals what happened: Clarisse's family moved away after Clarisse got hit by a speeding car and died four days ago. Dismayed by her failure to mention this earlier, Montag uneasily tries to fall asleep. Outside he suspects the presence of \"The Hound\", an eight-legged robotic dog-like creature that resides in the firehouse and aids the firemen.\n\nMontag awakens ill the next morning, with Mildred nagging him to get up and go to work. As Mildred tries to care for her husband (but finds herself more involved in the parlor wall entertainment in the next room), Montag suggests that maybe he should take a break from being a fireman after what happened last night. Mildred panics over the thought of losing the house and her parlor wall family and angrily blames the old woman who killed herself over her books for Montag's change of heart over his job. Captain Beatty, Montag's fire chief, personally visits Montag to see how he is doing. Sensing Montag's concerns, Beatty recounts how books lost their value and where the firemen fit in: over the course of several decades, people embraced new media (in this case, film and television), sports, and a quickening pace of life. Books were ruthlessly abridged or degraded to accommodate a short attention span while minority groups protested over the controversial, outdated content perceived to be found in literature (yet comic books, trade papers, and sex magazines were allowed to stay, as those fed into the population's want for mindless entertainment). The government took advantage of this by turning the firemen into officers of people's peace of mind. After an awkward encounter between Millie and Montag over the book hidden under Montag's pillow, Beatty is suspicious that Montag may have a book. Beatty casually adds a passing threat as he leaves, telling Montag that if a fireman had a book, he would be asked to burn it within the next 24 hours. If not, the other firemen would come and burn his house down for him. It's subtle, but the encounter leaves Montag shaken. He then decides to take action once and for all.\n\nAfter Beatty has left, Montag reveals to Mildred that, over the last year, he has accumulated a stash of books that he has kept hidden in their air-conditioning duct. In a panic, Mildred grabs a book and rushes to throw it in their kitchen incinerator. Montag subdues her and tells her that the two of them are going to read the books to see if they have value. If they do not, he promises the books will be burned, and all will return to normal.\n\n\"The Sieve and the Sand\"\n\nWhile Montag and Mildred are perusing the stolen books, a sniffing occurs at their front door. Montag recognizes it as The Hound while Mildred passes it off as a random dog. They resume their discussion once the sound ceases, but Mildred refuses to go along with it, questioning why she or anyone else should care about books. Montag goes on a rant about Mildred's suicide attempt, Clarisse's disappearance and death, the old woman who burned herself, and the constant din of bombers flying overhead and the imminent threat of war that goes ignored by the masses. He then states that maybe the books of the past have messages that can save society from its own destruction. The conversation is interrupted by a call from Mildred's friend, Mrs. Bowles, and they set up a date to watch the \"parlor walls\" (large televisions lining the walls of her living room) that night at Mildred's house.\n\nMontag, meanwhile, concedes that Mildred is a lost cause and he will need help to understand the books. Montag remembers an old man named Faber he once met in a park a year ago, an English professor before books were banned. He telephones Faber with questions about books, and Faber soon hangs up on him. Undeterred, Montag makes a subway trip to Faber's home along with a rare copy of the Bible, the book he stole at the woman's house. He tries to read it on the way, but gets distracted by a radio jingle for Denham's Dentifrice and nearly goes insane. Once he arrives at Faber's house, Montag forces the scared and reluctant Faber into helping him by methodically ripping pages from the Bible. Faber concedes and gives Montag a homemade ear-piece communicator so he can offer constant guidance.\n\nAfter Montag returns home, Mildred's friends, Mrs. Bowles and Mrs. Phelps, arrive to watch the \"parlor walls\". Not interested in this insipid entertainment, Montag turns off the walls and tries to engage the women in meaningful conversation, only for them to reveal just how indifferent, ignorant, and callous they are about the upcoming war, the thought of losing loved ones to death, their unruly children, and who they voted for in the last election. Enraged by their idiocy, Montag leaves momentarily and returns with a book of poetry. This confuses the women and alarms Faber, who is listening remotely. Mildred tries to dismiss Montag's actions as a tradition fireman do once a year: they find a book from the past and read it as a way to make fun of how silly the past is. Montag proceeds to recite the poem Dover Beach, causing Mrs. Phelps to cry. At the behest of Faber in the ear-piece, Montag burns the book. Mildred's friends leave in disgust, while Mildred locks herself in the bathroom and takes more sleeping pills.\n\nIn the aftermath of the parlor party, Montag hides his books in his backyard before returning to the firehouse late at night with just the stolen Bible. He finds Beatty playing cards with the other firemen. Montag hands Beatty a book to cover for the one he believes Beatty knows he stole the night before, which is unceremoniously tossed into the trash. Beatty tells Montag that he had a dream in which they fought endlessly by quoting books to each other. In describing the dream Beatty reveals that, despite his disillusionment, he was once an enthusiastic reader. A fire alarm sounds, and Beatty picks up the address from the dispatcher system. They drive in the firetruck recklessly to the destination. Montag is stunned when the truck arrives at his house.\n\n\"Burning Bright\"\n\nBeatty orders Montag to destroy his own house, telling him that his wife and her friends reported him after what happened the other night. Montag watches as Mildred walks out of the house, too traumatized about losing her parlor wall family to even acknowledge her husband's existence or the situation going on around her, and catches a taxi, never once looking back. Montag obeys the chief, destroying the home piece by piece with a flamethrower. As soon as he has incinerated the house, Beatty discovers Montag's ear-piece and plans to hunt down Faber. Montag threatens Beatty with the flamethrower and (after Beatty taunts him) burns his boss alive, and knocks his coworkers unconscious. As Montag escapes the scene, the firehouse's mechanical dog attacks him, managing to inject his leg with a tranquilizer. He destroys The Hound with the flamethrower and limps away.\n\nMontag runs through the city streets towards Faber's house. Faber urges him to make his way to the countryside and contact the exiled book-lovers who live there. He mentions he will be leaving on an early bus heading to St. Louis and that he and Montag can rendezvous there later. On Faber's television, they watch news reports of another mechanical hound being released, with news helicopters following it to create a public spectacle. After successfully wiping Montag's scent from around the house in hopes of deterring the hound, Montag leaves Faber's house. After an extended manhunt, he escapes by wading into a river and floating downstream.\n\nMontag leaves the river in the countryside, where he meets the exiled drifters, led by a man named Granger. They have each memorized books should the day come that society comes to an end, then rebuilds itself anew; this time, with the survivors learning to embrace the literature of the past. While learning the philosophy of the exiles, Montag and the group watch helplessly as bombers fly overhead and annihilate the city with nuclear weapons. While Faber would have left on the early bus, everyone else (including Mildred) was immediately killed. Montag and the group are injured and dirtied, but manage to survive the shock wave.\n\nThe following morning, Granger teaches Montag and the others about the legendary phoenix and its endless cycle of long life, death in flames, and rebirth. He adds that the phoenix must have some relationship to mankind, which constantly repeats its mistakes. Granger explains that man has something the phoenix does not: mankind can remember its mistakes and try never to repeat them. Granger then muses that a large factory of mirrors should be built, so that way people can take a long look at themselves and reflect on their lives. When the meal is over, the exiles return to the city to rebuild society.\n\nCharacters\n\n* Guy Montag is the protagonist and fireman who presents the dystopia through the eyes of a worker loyal to it, a man in conflict about it, and someone resolved to be free of it. Through most of the book, Montag lacks knowledge and believes what he hears.\n* Clarisse McClellan walks with Montag on his trips home and is one month short of her 17th birthday.Clarisse tells Montag she is \"seventeen and crazy\", later admitting that she will actually be seventeen \"next month\". She is an unusual sort of person in the bookless, hedonistic society: outgoing, naturally cheerful, unorthodox, and intuitive. She is unpopular among peers and disliked by teachers for asking \"why\" instead of \"how\" and focusing on nature rather than on technology. A few days after their first meeting, she disappears without any explanation; Mildred tells Montag (and Captain Beatty confirms) that Clarisse was hit by a speeding car and that her family left following her death. In the afterword of a later edition, Bradbury notes that the film adaptation changed the ending so that Clarisse (who, in the film, is now a 20-year-old school teacher who was fired for being unorthodox) was living with the exiles. Bradbury, far from being displeased by this, was so happy with the new ending that he wrote it into his later stage edition.\n* Mildred \"Millie\" Montag is Guy Montag's wife. She is addicted to sleeping pills, absorbed in the shallow dramas played on her \"parlor walls\" (flat-panel televisions), and indifferent to the oppressive society around her. She is described in the book as \"thin as a praying mantis from dieting, her hair burnt by chemicals to a brittle straw, and her flesh like white bacon.\" Despite her husband's attempts to break her from the spell society has on her, Mildred continues to be shallow and indifferent. After Montag scares her friends away by reading Dover Beach and unable to live with someone who has been hoarding books, Mildred betrays Montag by reporting him to the firemen and abandoning him.\n* Captain Beatty is Montag's boss. Once an avid reader, he has come to hate books due to their unpleasant content, and contradicting facts and opinions. In a scene written years later by Bradbury for the Fahrenheit 451 play, Beatty invites Montag to his house where he shows him walls of books left to molder on their shelves.\n* Stoneman and Black are Montag's coworkers at the firehouse. They do not have a large impact on the story and function to show the reader the contrast between the firemen who obediently do as they're told and someone like Montag, who formerly took pride in his job but subsequently realizes how damaging it is to society.\n* Faber is a former English professor. He has spent years regretting that he did not defend books when he saw the moves to ban them. Montag turns to him for guidance, remembering him from a chance meeting in a park sometime earlier. Faber at first refuses to help Montag, and later realizes Montag is only trying to learn about books, not destroy them. Bradbury notes in his afterword that Faber is part of the name of a German manufacturer of pencils, Faber-Castell.\n* Mrs. Ann Bowles and Mrs. Clara Phelps are Mildred's friends and representative of the anti-intellectual, hedonistic society presented in the novel. During a social visit to Montag's house, they brag about ignoring the bad things in their lives and have a cavalier attitude towards the upcoming war, their husbands, their children, and politics. Mrs. Phelps' husband Pete was called in to fight in the upcoming war (and believes that he'll be back in a week because of how quick the war will be) and thinks having children serves no purpose other than to ruin lives. Mrs. Bowles is a thrice married, single mother. Her first husband divorced her, her second died in a jet accident, and her third committed suicide by shooting himself in the head. She has two children who do not like or respect her due to her permissive, often negligent and abusive parenting; Mrs. Bowles brags that her kids beat her up, and she's glad she can hit back. When Montag reads Dover Beach to them, he strikes a chord in Mrs. Phelps, who starts crying over how hollow her life is. Mrs. Bowles chastises Montag for reading \"silly awful hurting words\".\n* Granger is the leader of a group of wandering intellectual exiles who memorize books in order to preserve their contents.\n\nTitle\n\nThe title refers to the temperature 451 F that Bradbury thought was the autoignition temperature of paper. Though this is popularly believed to be correct, scientists place the autoignition temperature at 424 – depending on the study and type of paper.\n\nHistorical context\n\nBradbury's lifelong passion for books began at an early age. As a frequent visitor to his local libraries in the 1920s and 1930s, he recalls being disappointed because they did not stock popular science fiction novels, like those of H. G. Wells', because, at the time, they were not deemed literary enough. Between this and learning about the destruction of the Library of Alexandria, a great impression was made on the young man about the vulnerability of books to censure and destruction. Later, as a teenager, Bradbury was horrified by the Nazi book burnings and later by Joseph Stalin's campaign of political repression, the \"Great Purge\", in which writers and poets, among many others, were arrested and often executed.\n\nAfter the 1945 conclusion of World War II, shortly after the atomic bombings of Hiroshima and Nagasaki, the United States focused its concern on the Soviet atomic bomb project and the expansion of communism. The House Un-American Activities Committee (HUAC), formed in 1938 to investigate American citizens and organizations suspected of having communist ties, held hearings in 1947 to investigate alleged communist influence in Hollywood movie-making. These hearings resulted in the blacklisting of the so-called \"Hollywood Ten\", a group of influential screenwriters and directors. This governmental interference in the affairs of artists and creative types greatly angered Bradbury. Bradbury was bitter and concerned about the workings of his government, and a late 1949 nighttime encounter with an overzealous police officer would inspire Bradbury to write \"The Pedestrian\", a short story which would go on to become \"The Fireman\" and then Fahrenheit 451. The rise of Senator Joseph McCarthy's hearings hostile to accused communists, starting in 1950 deepened Bradbury's contempt for government overreach.\n\nThe year HUAC began investigating Hollywood is often considered the beginning of the Cold War, as in March 1947, the Truman Doctrine was announced. By about 1950, the Cold War was in full swing, and the American public's fear of nuclear warfare and communist influence was at a feverish level. The stage was set for Bradbury to write the dramatic nuclear holocaust ending of Fahrenheit 451, exemplifying the type of scenario feared by many Americans of the time.\n\nBradbury's early life witnessed the Golden Age of Radio, while the transition to the Golden Age of Television began right around the time he started to work on the stories that would eventually lead to Fahrenheit 451. Bradbury saw these forms of media as a threat to the reading of books, indeed as a threat to society, as he believed they could act as a distraction from important affairs. This contempt for mass media and technology would express itself through Mildred and her friends and is an important theme in the book.\n\nWriting and development\n\nFahrenheit 451 developed out of a series of ideas Bradbury had visited in previously written stories. For many years, he tended to single out \"The Pedestrian\" in interviews and lectures as sort of a proto-Fahrenheit 451. In the Preface of his 2006 anthology Match to Flame: The Fictional Paths to Fahrenheit 451 he states that this is an oversimplification. The full genealogy of Fahrenheit 451 given in Match to Flame is involved. The following covers the most salient aspects.\n\nBetween 1947 and 1948, Bradbury wrote the short story \"Bright Phoenix\" (not published until the May 1963 issue of The Magazine of Fantasy & Science Fiction) about a librarian who confronts a book-burning \"Chief Censor\" named Jonathan Barnes.\n\nIn late 1949, Bradbury was stopped and questioned by a police officer while walking late one night. When asked \"What are you doing?\", Bradbury wisecracked, \"Putting one foot in front of another.\" This incident inspired Bradbury to write the 1951 short story \"The Pedestrian\".\"The Pedestrian\" would go on to be published in The Reporter magazine on August 7, 1951, that is, after the publication in February 1951 of its inspired work \"The Fireman\".\n\nIn The Pedestrian, Leonard Mead is harassed and detained by the city's remotely operated police cruiser (there's only one) for taking nighttime walks, something that has become extremely rare in this future-based setting: everybody else stays inside and watches television (\"viewing screens\"). Alone and without an alibi, Mead is taken to the \"Psychiatric Center for Research on Regressive Tendencies\" for his peculiar habit. Fahrenheit 451 would later echo this theme of an authoritarian society distracted by broadcast media.\n\nBradbury expanded the book-burning premise of \"Bright Phoenix\" and the totalitarian future of \"The Pedestrian\" into \"The Fireman\", a novella published in the February 1951 issue of Galaxy Science Fiction. \"The Fireman\" was written in the basement of UCLA's Powell Library on a typewriter that he rented for a fee of ten cents per half hour. The first draft was 25,000 words long and was completed in nine days.\n\nUrged by a publisher at Ballantine Books to double the length of his story to make a novel, Bradbury returned to the same typing room and expanded his work into Fahrenheit 451, again taking just nine days. The fixup was published by Ballantine in 1953.\n\nSupplementary material\n\nBradbury has supplemented the novel with various front and back matter, including a 1979 coda, a 1982 afterword, a 1993 foreword, and several introductions.\n\nPublication history\n\nThe first U.S. printing was a paperback version from October 1953 by The Ballantine Publishing Group. Shortly after the paperback, a hardback version was released that included a special edition of 200 signed and numbered copies bound in asbestos. These were technically collections because the novel was published with two short stories: The Playground and And the Rock Cried Out, which have been absent in later printings. A few months later, the novel was serialized in the March, April, and May 1954 issues of nascent Playboy magazine.\n\nExpurgation\n\nStarting in January 1967, Fahrenheit 451 was subject to expurgation by its publisher, Ballantine Books with the release of the \"Bal-Hi Edition\" aimed at high school students. Among the changes made by the publisher were the censorship of the words \"hell\", \"damn\", and \"abortion\"; the modification of seventy-five passages; and the changing of two episodes.\n\nIn the one case, a drunk man became a \"sick man\" while cleaning fluff out of a human navel became \"cleaning ears\" in the other. For a while both the censored and uncensored versions were available concurrently but by 1973 Ballantine was publishing only the censored version. This continued until 1979 when it came to Bradbury's attention:\n\nIn 1979, one of Bradbury's friends showed him an expurgated copy. Bradbury demanded that Ballantine Books withdraw that version and replace it with the original, and in 1980 the original version once again became available. In this reinstated work, in the Author's Afterword, Bradbury relates to the reader that it is not uncommon for a publisher to expurgate an author's work, but he asserts that he himself will not tolerate the practice of manuscript \"mutilation\".\n\nThe \"Bal-Hi\" editions are now referred to by the publisher as the \"Revised Bal-Hi\" editions.\n\nNon-print publications\n\nAn audiobook version read by Bradbury himself was released in 1976 and received a Spoken Word Grammy nomination. Another audiobook was released in 2005 narrated by Christopher Hurt. The e-book version was released in December 2011.\n\nReception\n\nIn 1954, Galaxy Science Fiction reviewer Groff Conklin placed the novel \"among the great works of the imagination written in English in the last decade or more.\" The Chicago Sunday Tribunes August Derleth described the book as \"a savage and shockingly savage prophetic view of one possible future way of life\", calling it \"compelling\" and praising Bradbury for his \"brilliant imagination\". Over half a century later, Sam Weller wrote, \"upon its publication, Fahrenheit 451 was hailed as a visionary work of social commentary.\" Today, Fahrenheit 451 is still viewed as an important cautionary tale against conformity and book burning.\n\nWhen the book was first published, there were those who did not find merit in the tale. Anthony Boucher and J. Francis McComas were less enthusiastic, faulting the book for being \"simply padded, occasionally with startlingly ingenious gimmickry, ... often with coruscating cascades of verbal brilliance [but] too often merely with words.\"\"Recommended Reading\", F&SF, December 1953, p. 105. Reviewing the book for Astounding Science Fiction, P. Schuyler Miller characterized the title piece as \"one of Bradbury's bitter, almost hysterical diatribes,\" while praising its \"emotional drive and compelling, nagging detail.\"\"The Reference Library\", Astounding Science Fiction, April 1954, pp. 145–46 Similarly, The New York Times was unimpressed with the novel and further accused Bradbury of developing a \"virulent hatred for many aspects of present-day culture, namely, such monstrosities as radio, TV, most movies, amateur and professional sports, automobiles, and other similar aberrations which he feels debase the bright simplicity of the thinking man's existence.\"\n\nCensorship/banning incidents\n\nIn the years since its publication, Fahrenheit 451 has occasionally been banned, censored, or redacted in some schools by parents and teaching staff either unaware of or indifferent to the inherent irony of such censorship. The following are some notable incidents:\n* In 1987, Fahrenheit 451 was given \"third tier\" status by the Bay County School Board in Panama City, Florida, under then-superintendent Leonard Hall's new three-tier classification system. Third tier was meant for books to be removed from the classroom for \"a lot of vulgarity\". After a resident class-action lawsuit, a media stir, and student protests, the school board abandoned their tier-based censorship system and approved all the currently used books.\n* In 1992, Venado Middle School in Irvine, California, gave copies of Fahrenheit 451 to students with all \"obscene\" words blacked out. Parents contacted the local media and succeeded in reinstalling the uncensored copies.\n* In 2006, parents of a 10th-grade high school student in Montgomery County, Texas, demanded the book be banned from their daughter's English class reading list. Their daughter was assigned the book during Banned Books Week, but stopped reading several pages in due to the offensive language and description of the burning of the Bible. In addition, the parents protested the violence, portrayal of Christians, and depictions of firemen in the novel.\n\nThemes\n\nDiscussions about Fahrenheit 451 often center on its story foremost as a warning against state-based censorship. Indeed, when Bradbury wrote the novel during the McCarthy era, he was concerned about censorship in the United States. During a radio interview in 1956, Bradbury said:I wrote this book at a time when I was worried about the way things were going in this country four years ago. Too many people were afraid of their shadows; there was a threat of book burning. Many of the books were being taken off the shelves at that time. And of course, things have changed a lot in four years. Things are going back in a very healthy direction. But at the time I wanted to do some sort of story where I could comment on what would happen to a country if we let ourselves go too far in this direction, where then all thinking stops, and the dragon swallows his tail, and we sort of vanish into a limbo and we destroy ourselves by this sort of action.\n\nAs time went by, Bradbury tended to dismiss censorship as a chief motivating factor for writing the story. Instead he usually claimed that the real messages of Fahrenheit 451 were about the dangers of an illiterate society infatuated with mass media and the threat of minority and special interest groups to books. In the late 1950s, Bradbury recounted:In writing the short novel Fahrenheit 451, I thought I was describing a world that might evolve in four or five decades. But only a few weeks ago, in Beverly Hills one night, a husband and wife passed me, walking their dog. I stood staring after them, absolutely stunned. The woman held in one hand a small cigarette-package-sized radio, its antenna quivering. From this sprang tiny copper wires which ended in a dainty cone plugged into her right ear. There she was, oblivious to man and dog, listening to far winds and whispers and soap-opera cries, sleep-walking, helped up and down curbs by a husband who might just as well not have been there. This was not fiction.Quoted by Kingsley Amis in New Maps of Hell: A Survey of Science Fiction (1960). Bradbury directly foretells this incident early in the work: \"And in her ears the little Seashells, the thimble radios tamped tight, and an electronic ocean of sound, of music and talk and music and talking coming in.\" p.12\n\nThis story echoes Mildred's \"Seashell ear-thimbles\" (i.e., a brand of in-ear headphones) that act as an emotional barrier between her and Montag. In a 2007 interview, Bradbury maintained that people misinterpret his book and that Fahrenheit 451 is really a statement on how mass media like television marginalizes the reading of literature. Regarding minorities, he wrote in his 1979 Coda:There is more than one way to burn a book. And the world is full of people running about with lit matches. Every minority, be it Baptist/Unitarian, Irish/Italian/Octogenarian/Zen Buddhist, Zionist/Seventh-day Adventist, Women's Lib/Republican, Mattachine/Four Square Gospel feels it has the will, the right, the duty to douse the kerosene, light the fuse. [...] Fire-Captain Beatty, in my novel Fahrenheit 451, described how the books were burned first by minorities, each ripping a page or a paragraph from this book, then that, until the day came when the books were empty and the minds shut and the libraries closed forever. [...] Only six weeks ago, I discovered that, over the years, some cubby-hole editors at Ballantine Books, fearful of contaminating the young, had, bit by bit, censored some seventy-five separate sections from the novel. Students, reading the novel, which, after all, deals with censorship and book-burning in the future, wrote to tell me of this exquisite irony. Judy-Lynn del Rey, one of the new Ballantine editors, is having the entire book reset and republished this summer with all the damns and hells back in place.\n\nBook-burning censorship, Bradbury would argue, was a side-effect of these two primary factors; this is consistent with Captain Beatty's speech to Montag about the history of the firemen. According to Bradbury, it is the people, not the state, who are the culprit in Fahrenheit 451. Nevertheless, the role on censorship, state-based or otherwise, is still perhaps the most frequent theme explored in the work.\n\nA variety of other themes in the novel besides censorship have been suggested. Two major themes are resistance to conformity and control of individuals via technology and mass media. Bradbury explores how the government is able to use mass media to influence society and suppress individualism through book burning. The characters Beatty and Faber point out the American population is to blame. Due to their constant desire for a simplistic, positive image, books must be suppressed. Beatty blames the minority groups, who would take offense to published works that displayed them in an unfavorable light. Faber went further to state that the American population simply stopped reading on their own. He notes that the book burnings themselves became a form of entertainment to the general public.\n\nPredictions for the future\n\nBradbury described himself as \"a preventor of futures, not a predictor of them.\" He did not believe that book burning was an inevitable part of the future; he wanted to warn against its development. In a later interview, when asked if he believes that teaching Fahrenheit 451 in schools will prevent his totalitarian vision of the future, Bradbury replied in the negative. Rather, he states that education must be at the kindergarten and first-grade level. If students are unable to read then, they will be unable to read Fahrenheit 451.\n\nIn terms of technology, Sam Weller notes that Bradbury \"predicted everything from flat-panel televisions to earbud headphones and twenty-four-hour banking machines.\"\n\nAdaptations\n\nPlayhouse 90 broadcast \"A Sound of Different Drummers\" on CBS in 1957, written by Robert Alan Aurthur. The play combined plot ideas from Fahrenheit 451 and Nineteen Eighty-Four. Bradbury sued and eventually won on appeal.\n\nA film adaptation written and directed by François Truffaut and starring Oskar Werner and Julie Christie was released in 1966.\n\nIn the late 1970s Bradbury adapted his book into a play. At least part of it was performed at the Colony Theatre in Los Angeles in 1979, but it was not in print until 1986 and the official world premiere was only in November 1988 by the Fort Wayne, Indiana Civic Theatre. The stage adaptation diverges considerably from the book and seems influenced by Truffaut's movie. For example, fire chief Beatty's character is fleshed out and is the wordiest role in the play. As in the movie, Clarisse does not simply disappear but in the finale meets up with Montag as a book character (she as Robert Louis Stevenson, he as Edgar Allan Poe).[http://home.wlv.ac.uk/~in5379/books/451_play.htm Fahrenheit 451 (play)], BradburyMedia; accessed September 17, 2016.\n\nBBC Radio produced a one-off dramatization of the novel in 1982 starring Michael Pennington. It was broadcast again on February 12, 2012, and April 7 and 8, 2013, on BBC Radio 4 Extra.\n\nIn 1984, the novel was adapted into a computer text adventure game of the same name by the software company Trillium.\n\nThe UK premiere of Bradbury's stage adaptation was not until 2003 in Nottingham, while it took until 2006 before the Godlight Theatre Company produced and performed its New York City premiere at 59E59 Theaters. After the completion of the New York run, the production then transferred to the Edinburgh Festival where it was a 2006 Edinburgh Festival Pick of the Fringe.\n\nThe Off-Broadway theatre The American Place Theatre presented a one man show adaptation of Fahrenheit 451 as a part of their 2008–2009 Literature to Life season.\n\nIn June 2009, a graphic novel edition of the book was published. Entitled Ray Bradbury's Fahrenheit 451: The Authorized Adaptation, the paperback graphic adaptation was illustrated by Tim Hamilton. The introduction in the novel is written by Bradbury.\n\nFahrenheit 451 inspired the Birmingham Repertory Theatre production Time Has Fallen Asleep in the Afternoon Sunshine, which was performed at the Birmingham Central Library in April 2012.\n\nA new film adaptation is in production for HBO, directed by Ramin Bahrani and starring Michael B. Jordan and Michael Shannon. Sofia Boutella, Lilly Singh, and Laura Harrier joined the cast in June 2017.\n\nCultural references\n\nMichael Moore's 2004 documentary Fahrenheit 9/11 refers to Bradbury's novel and the September 11 attacks, emphasized by the film's tagline \"The temperature where freedom burns\". The film takes a critical look at the presidency of George W. Bush, the War on Terror, and its coverage in the news media, and became the highest grossing documentary of all time. Bradbury was upset by what he considered the appropriation of his title, and wanted the film renamed.\n\nIn 2015, the Internet Engineering Steering Group approved the publication of An HTTP Status Code to Report Legal Obstacles, now RFC 7725, which specifies that websites forced to block resources for legal reasons should return a status code of 451 when users request those resources.\n\nCentigrade 232 is a poem by Robert Calvert, published in a 1977 book and released as an album in 2007. The title alludes to Fahrenheit 451 by its metric equivalent, \"signifying the writer destroying his rough drafts\".[http://www.aural-innovations.com/robertcalvert/works/calvertworks3.htm www.aural-innovations.com] – The works of Robert Calvert –  part III: 1976 – '78\n\nIn the book 14 of the Guardians of Ga'Hoole series by Kathryn Lasky, published in 2008, Braithe states that the name of the Place of Living Books, also called Brad, comes from an author's name : \"The author's full name is not known. We call him Ray Brad. We think it's only scraps of his name but what is important is that he wrote about book burning.\" thus referencing Fahrenheit 451.\n\nNotes. Fahrenheit 451. http://en.wikipedia.org/?curid=10951."
  }
}
