{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8912",
  "eid" : "eb569850-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778474581,
  "textBody" : "The Drake equation is a probabilistic argument used to estimate the number of active, communicative extraterrestrial civilizations in the Milky Way galaxy.\nThe number of such civilizations , is assumed to be equal to the mathematical product of\n\nfor a combined expression of:\nN = R_* \\cdot f_\\mathrm{p} \\cdot n_\\mathrm{e} \\cdot f_\\mathrm{l} \\cdot f_\\mathrm{i} \\cdot f_\\mathrm{c} \\cdot L\nThe equation was written in 1961 by Frank Drake, not for purposes of quantifying the number of civilizations, but as a way to stimulate scientific dialogue at the first scientific meeting on the search for extraterrestrial intelligence (SETI). The equation summarizes the main concepts which scientists must contemplate when considering the question of other radio-communicative life.  It is more properly thought of as a Fermi problem rather than as a serious attempt to nail down a precise number.\n\nCriticism related to the Drake equation focuses not on the equation itself, but on the fact that the estimated values for several of its factors are highly conjectural, the combined effect being that the uncertainty associated with any derived value is so large that the equation cannot be used to draw firm conclusions.\n\nHistory\n\nIn September 1959, physicists Giuseppe Cocconi and Philip Morrison published an article in the journal Nature with the provocative title \"Searching for Interstellar Communications.\"\n\n \nCocconi and Morrison argued that radio telescopes had become sensitive enough to pick up transmissions that might be broadcast into space by civilizations orbiting other stars. Such messages, they suggested, might be transmitted at a wavelength of 21 cm (1,420.4 MHz). This is the wavelength of radio emission by neutral hydrogen, the most common element in the universe, and they reasoned that other intelligences might see this as a logical landmark in the radio spectrum.\n\nTwo months later, Harvard University astronomy professor Harlow Shapley speculated on the number of inhabited planets in the universe, saying \"The universe has 10 million, million, million suns (10 followed by 18 zeros) similar to our own. One in a million has planets around it. Only one in a million million has the right combination of chemicals, temperature, water, days and nights to support planetary life as we know it. This calculation arrives at the estimated figure of 100 million worlds where life has been forged by evolution.\"\n\nSeven months after Cocconi and Morrison published their article, Drake made the first systematic search for signals from extraterrestrial intelligent beings. Using the 25 m dish of the National Radio Astronomy Observatory in Green Bank, West Virginia, Drake monitored two nearby Sun-like stars: Epsilon Eridani and Tau Ceti. In this project, which he called Project Ozma, he slowly scanned frequencies close to the 21 cm wavelength for six hours per day from April to July 1960. The project was well designed, inexpensive, and simple by today's standards. It was also unsuccessful.\n\nSoon thereafter, Drake hosted a \"search for extraterrestrial intelligence\" meeting on detecting their radio signals. The meeting was held at the Green Bank facility in 1961. The equation that bears Drake's name arose out of his preparations for the meeting.\n\n As I planned the meeting, I realized a few day[s] ahead of time we needed an agenda. And so I wrote down all the things you needed to know to predict how hard it's going to be to detect extraterrestrial life. And looking at them it became pretty evident that if you multiplied all these together, you got a number, N, which is the number of detectable civilizations in our galaxy. This was aimed at the radio search, and not to search for primordial or primitive life forms.  —Frank Drake.\n\nThe ten attendees were conference organizer J. Peter Pearman, Frank Drake, Philip Morrison, businessman and radio amateur Dana Atchley, chemist Melvin Calvin, astronomer Su-Shu Huang, neuroscientist John C. Lilly, inventor Barney Oliver, astronomer Carl Sagan and radio-astronomer Otto Struve.\n These participants dubbed themselves \"The Order of the Dolphin\" (because of Lilly's work on dolphin communication), and commemorated their first meeting with a plaque at the observatory hall.\n\nEquation\n\nThe Drake equation is:\n\nN = R_* \\cdot f_\\mathrm{p} \\cdot n_\\mathrm{e} \\cdot f_\\mathrm{l} \\cdot f_\\mathrm{i} \\cdot f_\\mathrm{c} \\cdot L\n\nwhere:\n\n= the number of civilizations in our galaxy with which communication might be possible (i.e. which are on our current past light cone);\n\nand\n\n= the average rate of star formation in our galaxy\n= the fraction of those stars that have planets\n= the average number of planets that can potentially support life per star that has planets\n= the fraction of planets that could support life that actually develop life at some point\n= the fraction of planets with life that actually go on to develop intelligent life (civilizations)\n= the fraction of civilizations that develop a technology that releases detectable signs of their existence into space\nthe length of time for which such civilizations release detectable signals into space\n\nUsefulness\n\nThe Drake equation amounts to a summary of the factors affecting the likelihood that we might detect radio-communication from intelligent extraterrestrial life.\n The last four parameters, , , , and , are not known and are very difficult to estimate, with values ranging over many orders of magnitude (see criticism).  Therefore, the usefulness of the Drake equation is not in the solving, but rather in the contemplation of all the various concepts which scientists must incorporate when considering the question of life elsewhere, and gives the question of life elsewhere a basis for scientific analysis. The Drake equation is a statement that stimulates intellectual curiosity about the universe around us, for helping us to understand that life as we know it is the end product of a natural, cosmic evolution, and for helping us realize how much we are a part of that universe.  What the equation and the search for life has done is focus science on some of the other questions about life in the universe, specifically abiogenesis, the development of multi-cellular life and the development of intelligence itself.\n\nWithin the limits of our existing technology, any practical search for distant intelligent life must necessarily be a search for some manifestation of a distant technology. After about 50 years, the Drake equation is still of seminal importance because it is a 'road map' of what we need to learn in order to solve this fundamental existential question. It also formed the backbone of astrobiology as a science; although speculation is entertained to give context, astrobiology concerns itself primarily with hypotheses that fit firmly into existing scientific theories. Some 50 years of SETI have failed to find anything, even though radio telescopes, receiver techniques, and computational abilities have improved enormously since the early 1960s, but it has been discovered, at least, that our galaxy is not teeming with very powerful alien transmitters continuously broadcasting near the 21 cm hydrogen frequency. No one could say this in 1961.[http://www.astronomynow.com/news/n1004/SETI/ SETI: A celebration of the first 50 years]. Keith Cooper. Astronomy Now. 2000\n\nModifications\n\nAs many observers have pointed out, the Drake equation is a very simple model that does not include potentially relevant parameters,\n and many changes and modifications to the equation have been proposed.  One line of modification, for example, attempts to account for the uncertainty inherent in many of the terms.\n\nOthers note that the Drake equation ignores many concepts that might be relevant to the odds of contacting other civilizations.  For example, David Brin states: \"The Drake equation merely speaks of the number of sites at which ETIs spontaneously arise. The equation says nothing directly about the contact cross-section between an ETIS and contemporary human society\".\n  Because it is the contact cross-section that is of interest to the SETI community, many additional factors and modifications of the Drake equation have been proposed.\n\n;Colonization : It has been proposed to generalize the Drake equation to include additional effects of alien civilizations colonizing other star systems. Each original site expands with an expansion velocity , and establishes additional sites that survive for a lifetime .  The result is a more complex set of 3 equations.\n\n;Reappearance factor : The Drake equation may furthermore be multiplied by how many times an intelligent civilization may occur on planets where it has happened once. Even if an intelligent civilization reaches the end of its lifetime after, for example, 10,000 years, life may still prevail on the planet for billions of years, permitting the next civilization to evolve. Thus, several civilizations may come and go during the lifespan of one and the same planet. Thus, if  is the average number of times a new civilization reappears on the same planet where a previous civilization once has appeared and ended, then the total number of civilizations on such a planet would be , which is the actual reappearance factor added to the equation.\n\nThe factor depends on what generally is the cause of civilization extinction. If it is generally by temporary uninhabitability, for example a nuclear winter, then  may be relatively high. On the other hand, if it is generally by permanent uninhabitability, such as stellar evolution, then  may be almost zero. In the case of total life extinction, a similar factor may be applicable for , that is, how many times life may appear on a planet where it has appeared once.\n\n;METI factor : Alexander Zaitsev said that to be in a communicative phase and emit dedicated messages are not the same. For example, humans, although being in a communicative phase, are not a communicative civilization; we do not practise such activities as the purposeful and regular transmission of interstellar messages. For this reason, he suggested introducing the METI factor (messaging to extraterrestrial intelligence) to the classical Drake equation.\n He defined the factor as \"the fraction of communicative civilizations with clear and non-paranoid planetary consciousness\", or alternatively expressed, the fraction of communicative civilizations that actually engage in deliberate interstellar transmission.\n\nThe METI factor is somewhat misleading since active, purposeful transmission of messages by a civilization is not required for them to receive a broadcast sent by another that is seeking first contact. It is merely required they have capable and compatible receiver systems operational; however, this is a variable humans cannot accurately estimate.\n\n;Biogenic gases : Astronomer Sara Seager proposed a revised equation that focuses on the search for planets with biosignature gases. These gases are produced by living organisms that can accumulate in a planet atmosphere to levels that can be detected with remote space telescopes.[http://www.space.com/22648-drake-equation-alien-life-seager.html?cid=51463011558824 The Drake Equation Revisited: Interview with Planet Hunter Sara Seager] Devin Powell, Astrobiology Magazine  4 September 2013.\n\nThe Seager equation looks like this:\n:N \n N_* \\cdot F_\\mathrm{Q} \\cdot F_\\mathrm{HZ} \\cdot F_\\mathrm{O} \\cdot F_\\mathrm{L} \\cdot F_\\mathrm{S}\nwhere:\n\n: = the number of planets with detectable signs of life\n: = the number of stars observed\n: = the fraction of stars that are quiet\n: = the fraction of stars with rocky planets in the habitable zone\n: = the fraction of those planets that can be observed\n: = the fraction that have life\n: = the fraction on which life produces a detectable signature gas\n\nSeager stresses, “We’re not throwing out the Drake Equation, which is really a different topic,” explaining, “Since Drake came up with the equation, we have discovered thousands of exoplanets. We as a community have had our views revolutionized as to what could possibly be out there. And now we have a real question on our hands, one that’s not related to intelligent life: Can we detect any signs of life in any way in the very near future?”\n\nEstimates\n\nOriginal estimates\n\nThere is considerable disagreement on the values of these parameters, but the 'educated guesses' used by Drake and his colleagues in 1961 were:\n\n Note: This reference has a table of 1961 values, claimed to be taken from Drake & Sobel, but these differ from the book. \n*  = 1 yr−1 (1 star formed per year, on the average over the life of the galaxy; this was regarded as conservative)\n*  = 0.2 to 0.5 (one fifth to one half of all stars formed will have planets)\n*  = 1 to 5 (stars with planets will have between 1 and 5 planets capable of developing life)\n*  = 1 (100% of these planets will develop life)\n*  = 1 (100% of which will develop intelligent life)\n*  = 0.1 to 0.2 (10–20% of which will be able to communicate)\n*  = 1000 to 100,000,000 years (which will last somewhere between 1000 and 100,000,000 years)\n\nInserting the above minimum numbers into the equation gives a minimum N of 20 (see: Range of results). Inserting the maximum numbers gives a maximum of 50,000,000. Drake states that given the uncertainties, the original meeting concluded that , and there were probably between 1000 and 100,000,000 civilizations in the Milky Way galaxy.\n\nCurrent estimates\n\nThis section discusses and attempts to list the best current estimates for the parameters of the Drake equation.\n\nRate of star creation in our galaxy, \n\nLatest calculations from NASA and the European Space Agency indicate that the current rate of star formation in our galaxy is about  of material per year.\n To get the number of stars per year, this must account for the initial mass function (IMF) for stars, where the average new star mass is about . This gives a star formation rate of about 1.5–3 stars per year.\n\nFraction of those stars that have planets, \n\nRecent analysis of microlensing surveys has found that  may approach 1—that is, stars are orbited by planets as a rule, rather than the exception; and that there are one or more bound planets per Milky Way star.\n\nAverage number of planets per star having planets that might support life, \n\nIn November 2013, astronomers reported, based on Kepler space mission data, that there could be as many as 40 billion Earth-sized planets orbiting in the habitable zones of sun-like stars and red dwarf stars within the Milky Way Galaxy. 11 billion of these estimated planets may be orbiting sun-like stars. Since there are about 100 billion stars in the galaxy, this implies  is roughly 0.4. The nearest planet in the habitable zone may be as close as 12 light-years away, according to the scientists.\n\nThe consensus at the Green Bank meeting was that  had a minimum value between 3 and 5. Dutch astronomer Govert Schilling has opined that this is optimistic. Even if planets are in the habitable zone, the number of planets with the right proportion of elements is difficult to estimate. Brad Gibson, Yeshe Fenner, and Charley Lineweaver determined that about 10% of star systems in the Milky Way galaxy are hospitable to life, by having heavy elements, being far from supernovae and being stable for a sufficient time.\n\nThe discovery of numerous gas giants in close orbit with their stars has introduced doubt that life-supporting planets commonly survive the formation of their stellar systems. So-called hot Jupiters may migrate from distant orbits to near orbits, in the process disrupting the orbits of habitable planets.\n\nOn the other hand, the variety of star systems that might have habitable zones is not just limited to solar-type stars and Earth-sized planets. It is now estimated that even tidally locked planets close to red dwarf stars might have habitable zones,\n although the flaring behavior of these stars might argue against this. The possibility of life on moons of gas giants (such as Jupiter's moon Europa, or Saturn's moon Titan) adds further uncertainty to this figure.\n\nThe authors of the rare Earth hypothesis propose a number of additional constraints on habitability for planets, including being in galactic zones with suitably low radiation, high star metallicity, and low enough density to avoid excessive asteroid bombardment. They also propose that it is necessary to have a planetary system with large gas giants which provide bombardment protection without a hot Jupiter; and a planet with plate tectonics, a large moon that creates tidal pools, and moderate axial tilt to generate seasonal variation.\n\nFraction of the above that actually go on to develop life, \n\nGeological evidence from the Earth suggests that  may be high; life on Earth appears to have begun around the same time as favorable conditions arose, suggesting that abiogenesis may be relatively common once conditions are right. However, this evidence only looks at the Earth (a single model planet), and contains anthropic bias, as the planet of study was not chosen randomly, but by the living organisms that already inhabit it (ourselves). From a classical hypothesis testing standpoint, there are zero degrees of freedom, permitting no valid estimates to be made. If life were to be found on Mars that developed independently from life on Earth it would imply a value for  close to 1. While this would raise the degrees of freedom from zero to one, there would remain a great deal of uncertainty on any estimate due to the small sample size, and the chance they are not really independent.\n\nCountering this argument is that there is no evidence for abiogenesis occurring more than once on the Earth — that is, all terrestrial life stems from a common origin. If abiogenesis were more common it would be speculated to have occurred more than once on the Earth. Scientists have searched for this by looking for bacteria that are unrelated to other life on Earth, but none have been found yet.\n It is also possible that life arose more than once, but that other branches were out-competed, or died in mass extinctions, or were lost in other ways. Biochemists Francis Crick and Leslie Orgel laid special emphasis on this uncertainty: \"At the moment we have no means at all of knowing\" whether we are \"likely to be alone in the galaxy (Universe)\" or whether \"the galaxy may be pullulating with life of many different forms.\"\n As an alternative to abiogenesis on Earth, they proposed the hypothesis of directed panspermia, which states that Earth life began with \"microorganisms sent here deliberately by a technological society on another planet, by means of a special long-range unmanned spaceship\".\n\nFraction of the above that develops intelligent life, \n\nThis value remains particularly controversial. Those who favor a low value, such as the biologist Ernst Mayr, point out that of the billions of species that have existed on Earth, only one has become intelligent and from this, infer a tiny value for .\n Likewise, the Rare Earth hypothesis, notwithstanding their low value for  above, also think a low value for  dominates the analysis.Rare Earth, p. xviii.: \"We believe that life in the form of microbes or their equivalents is very common in the universe, perhaps more common than even Drake or Sagan envisioned. However, complex life – animals and higher plants – is likely to be far more rare than commonly assumed.\" Those who favor higher values note the generally increasing complexity of life over time, concluding that the appearance of intelligence is almost inevitable,\n\n implying an  approaching 1. Skeptics point out that the large spread of values in this factor and others make all estimates unreliable. (See Criticism).\n\nIn addition, while it appears that life developed soon after the formation of Earth, the Cambrian explosion, in which a large variety of multicellular life forms came into being, occurred a considerable amount of time after the formation of Earth, which suggests the possibility that special conditions were necessary. Some scenarios such as the snowball Earth or research into the extinction events have raised the possibility that life on Earth is relatively fragile. Research on any past life on Mars is relevant since a discovery that life did form on Mars but ceased to exist might raise our estimate of fl but would indicate that in half the known cases, intelligent life did not develop.\n\nEstimates of  have been affected by discoveries that the Solar System's orbit is circular in the galaxy, at such a distance that it remains out of the spiral arms for tens of millions of years (evading radiation from novae). Also, Earth's large moon may aid the evolution of life by stabilizing the planet's axis of rotation.\n\nFraction of the above revealing their existence via signal release into space, \n\nFor deliberate communication, the one example we have (the Earth) does not do much explicit communication, though there are some efforts covering only a tiny fraction of the stars that might look for our presence. (See Arecibo message, for example). There is considerable speculation why an extraterrestrial civilization might exist but choose not to communicate. However, deliberate communication is not required, and calculations indicate that current or near-future Earth-level technology might well be detectable to civilizations not too much more advanced than our own.\n By this standard, the Earth is a communicating civilization.\n\nAnother question is what percentage of civilizations in the galaxy are close enough for us to detect, assuming that they send out signals. For example, existing Earth radio telescopes could only detect Earth radio transmissions from roughly a light year away.\n\nLifetime of such a civilization wherein it communicates its signals into space, \n\nMichael Shermer estimated  as 420 years, based on the duration of sixty historical Earthly civilizations.\n Using 28 civilizations more recent than the Roman Empire, he calculates a figure of 304 years for \"modern\" civilizations. It could also be argued from Michael Shermer's results that the fall of most of these civilizations was followed by later civilizations that carried on the technologies, so it is doubtful that they are separate civilizations in the context of the Drake equation. In the expanded version, including reappearance number, this lack of specificity in defining single civilizations does not matter for the end result, since such a civilization turnover could be described as an increase in the reappearance number rather than increase in , stating that a civilization reappears in the form of the succeeding cultures. Furthermore, since none could communicate over interstellar space, the method of comparing with historical civilizations could be regarded as invalid.\n\nDavid Grinspoon has argued that once a civilization has developed enough, it might overcome all threats to its survival. It will then last for an indefinite period of time, making the value for  potentially billions of years. If this is the case, then he proposes that the Milky Way galaxy may have been steadily accumulating advanced civilizations since it formed.\n He proposes that the last factor  be replaced with , where  is the fraction of communicating civilizations become \"immortal\" (in the sense that they simply do not die out), and  representing the length of time during which this process has been going on. This has the advantage that  would be a relatively easy to discover number, as it would simply be some fraction of the age of the universe.\n\nIt has also been hypothesized that once a civilization has learned of a more advanced one, its longevity could increase because it can learn from the experiences of the other.\n\nThe astronomer Carl Sagan speculated that all of the terms, except for the lifetime of a civilization, are relatively high and the determining factor in whether there are large or small numbers of civilizations in the universe is the civilization lifetime, or in other words, the ability of technological civilizations to avoid self-destruction. In Sagan's case, the Drake equation was a strong motivating factor for his interest in environmental issues and his efforts to warn against the dangers of nuclear warfare.\n\nRange of results\n\nAs many skeptics have pointed out, the Drake equation can give a very wide range of values, depending on the assumptions,\"The value of  remains highly uncertain. Even if we had a perfect knowledge of the first two terms in the equation, there are still five remaining terms, each of which could be uncertain by factors of 1,000.\" from , or more informally, \"The Drake Equation can have any value from \"billions and billions\" to zero\", Michael Crichton, as quoted in , pp. 13 and the values used in portions of the Drake equation are not well-established. In particular, the result can be , meaning we are likely alone in the galaxy, or , implying there are many civilizations we might contact. One of the few points of wide agreement is that the presence of humanity implies a probability of intelligence arising of greater than zero.\n\nAs an example of a low estimate, combining NASA's star formation rates, the rare Earth hypothesis value of ,Rare Earth, page 270: \"When we take into account factors such as the abundance of planets and the location and lifetime of the habitable zone, the Drake Equation suggests that only between 1% and 0.001% of all stars might have planets with habitats similar to Earth. [...] If microbial life forms readily, then millions to hundreds of millions of planets in the galaxy have the potential for developing advanced life. (We expect that a much higher number will have microbial life.)\" Mayr's view on intelligence arising, Drake's view of communication, and Shermer's estimate of lifetime:\n, , , [Drake, above], and  years\ngives:\ni.e., suggesting that we are probably alone in this galaxy, and possibly in the observable universe.\n\nOn the other hand, with larger values for each of the parameters above, values of  can be derived that are greater than 1. The following higher values that have been proposed for each of the parameters:\n, , ,\n\n ,\n , [Drake, above], and  years\nUse of these parameters gives:\nMonte Carlo simulations of estimates of the Drake equation factors based on a stellar and planetary model of the Milky Way have resulted in the number of civilizations varying by a factor of 100.\n\nHas intelligent life ever existed?\n\nThe Drake equation can be modified to determine just how unlikely intelligent life must be, to give the result that Earth has the only intelligent life that has ever arisen, either in our galaxy or the universe as a whole. This simplifies the calculation by removing the lifetime and communication constraints. Since star and planets counts are known, this leaves the only unknown as the odds that a habitable planet ever develops intelligent life. For Earth to have the only civilization that has ever occurred in the universe, then the odds of any habitable planet ever developing such a civilization must be less than . Similarly, for Earth to host the only civilization in our galaxy for all time, the odds of a habitable zone planet ever hosting intelligent life must be less than  (about 1 in 60 billion). The figure for the universe implies that it is highly unlikely that Earth hosts the only intelligent life that has ever occurred. The figure for our galaxy suggests that other civilizations may have occurred or will likely occur in our galaxy.\n\nCriticism\n\nCriticism of the Drake equation follows mostly from the observation that several terms in the equation are largely or entirely based on conjecture.  Star formation rates are well-known, and the incidence of planets has a sound theoretical and observational basis, but the other terms in the equation become very speculative. The uncertainties revolve around our understanding of the evolution of life, intelligence, and civilization, not physics.  No statistical estimates are possible for some of the parameters, where only one example is known.  The net result is that the equation cannot be used to draw firm conclusions of any kind, and the resulting margin of error is huge, far beyond what some consider acceptable or meaningful.\n\nOne reply to such criticisms\n is that even though the Drake equation currently involves speculation about unmeasured parameters, it was intended as a way to stimulate dialogue on these topics. Then the focus becomes how to proceed experimentally. Indeed, Drake originally formulated the equation merely as an agenda for discussion at the Green Bank conference.\n \n\nFermi paradox\n\nThe pessimists' most telling argument in the SETI debate stems not from theory or conjecture but from an actual observation: the presumed lack of extraterrestrial contact. A civilization lasting for tens of millions of years might be able to travel anywhere in the galaxy, even at the slow speeds foreseeable with our own kind of technology.  Furthermore, no confirmed signs of intelligence elsewhere have been recognized as such, either in our galaxy or in the observable universe of 2 trillion galaxies. According to this line of thinking, the tendency to fill up all available territory seems to be a universal trait of living things, so the Earth should have already been colonized, or at least visited, but no evidence of this exists.  Hence Fermi's question \"Where is everybody?\".\n\nA large number of explanations have been proposed to explain this lack of contact; a book published in 2015 elaborated on 75 different explanations.\n In terms of the Drake Equation, the explanations can be divided into three classes:\n\n*Few intelligent civilizations ever arise.  This is an argument that at least one of the first few terms, , has a low value.  The most common suspect is , but explanations such as the rare Earth hypothesis argue that  is the small term.\n*Intelligent civilizations exist, but we see no evidence, meaning  is small.  Typical arguments include that civilizations are too far apart, it is too expensive to spread throughout the galaxy, civilizations broadcast signals for only a brief period of time, it is dangerous to communicate, and many others.\n*The lifetime of intelligent, communicative civilizations is short, meaning the value of  is small. Drake suggested that a large number of extraterrestrial civilizations would form, and he further speculated that the lack of evidence of such civilizations may be because technological civilizations tend to disappear rather quickly. Typical explanations include it is the nature of intelligent life to destroy itself, it is the nature of intelligent life to destroy others, they tend to experience a technological singularity, and others.\n\nThese lines of reasoning lead to the Great Filter hypothesis,\n which states that since there are no observed extraterrestrial civilizations, despite the vast number of stars, then some step in the process must be acting as a filter to reduce the final value. According to this view, either it is very difficult for intelligent life to arise, or the lifetime of such civilizations, or the period of time they reveal their existence, must be relatively short.\n\nIn fiction and popular culture\n\nThe equation was cited by Gene Roddenberry as supporting the multiplicity of inhabited planets shown on Star Trek, the television series he created. However, Roddenberry did not have the equation with him, and he was forced to \"invent\" it for his original proposal.The Making of Star Trek by Stephen E. Whitfield and Gene Roddenberry, Ballantine Books, N. Y., 1968 The invented equation created by Roddenberry is:\n:Ff^2 (MgE)-C^1 Ri^1 \\cdot M=L/So \nHowever, a number raised to the first power is merely the number itself.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Drake equation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8912" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Drake equation is a probabilistic argument used to estimate the number of active, communicative extraterrestrial civilizations in the Milky Way galaxy.\nThe number of such civilizations , is assumed to be equal to the mathematical product of\n\nfor a combined expression of:\nN = R_* \\cdot f_\\mathrm{p} \\cdot n_\\mathrm{e} \\cdot f_\\mathrm{l} \\cdot f_\\mathrm{i} \\cdot f_\\mathrm{c} \\cdot L\nThe equation was written in 1961 by Frank Drake, not for purposes of quantifying the number of civilizations, but as a way to stimulate scientific dialogue at the first scientific meeting on the search for extraterrestrial intelligence (SETI). The equation summarizes the main concepts which scientists must contemplate when considering the question of other radio-communicative life.  It is more properly thought of as a Fermi problem rather than as a serious attempt to nail down a precise number.\n\nCriticism related to the Drake equation focuses not on the equation itself, but on the fact that the estimated values for several of its factors are highly conjectural, the combined effect being that the uncertainty associated with any derived value is so large that the equation cannot be used to draw firm conclusions.\n\nHistory\n\nIn September 1959, physicists Giuseppe Cocconi and Philip Morrison published an article in the journal Nature with the provocative title \"Searching for Interstellar Communications.\"\n\n \nCocconi and Morrison argued that radio telescopes had become sensitive enough to pick up transmissions that might be broadcast into space by civilizations orbiting other stars. Such messages, they suggested, might be transmitted at a wavelength of 21 cm (1,420.4 MHz). This is the wavelength of radio emission by neutral hydrogen, the most common element in the universe, and they reasoned that other intelligences might see this as a logical landmark in the radio spectrum.\n\nTwo months later, Harvard University astronomy professor Harlow Shapley speculated on the number of inhabited planets in the universe, saying \"The universe has 10 million, million, million suns (10 followed by 18 zeros) similar to our own. One in a million has planets around it. Only one in a million million has the right combination of chemicals, temperature, water, days and nights to support planetary life as we know it. This calculation arrives at the estimated figure of 100 million worlds where life has been forged by evolution.\"\n\nSeven months after Cocconi and Morrison published their article, Drake made the first systematic search for signals from extraterrestrial intelligent beings. Using the 25 m dish of the National Radio Astronomy Observatory in Green Bank, West Virginia, Drake monitored two nearby Sun-like stars: Epsilon Eridani and Tau Ceti. In this project, which he called Project Ozma, he slowly scanned frequencies close to the 21 cm wavelength for six hours per day from April to July 1960. The project was well designed, inexpensive, and simple by today's standards. It was also unsuccessful.\n\nSoon thereafter, Drake hosted a \"search for extraterrestrial intelligence\" meeting on detecting their radio signals. The meeting was held at the Green Bank facility in 1961. The equation that bears Drake's name arose out of his preparations for the meeting.\n\n As I planned the meeting, I realized a few day[s] ahead of time we needed an agenda. And so I wrote down all the things you needed to know to predict how hard it's going to be to detect extraterrestrial life. And looking at them it became pretty evident that if you multiplied all these together, you got a number, N, which is the number of detectable civilizations in our galaxy. This was aimed at the radio search, and not to search for primordial or primitive life forms.  —Frank Drake.\n\nThe ten attendees were conference organizer J. Peter Pearman, Frank Drake, Philip Morrison, businessman and radio amateur Dana Atchley, chemist Melvin Calvin, astronomer Su-Shu Huang, neuroscientist John C. Lilly, inventor Barney Oliver, astronomer Carl Sagan and radio-astronomer Otto Struve.\n These participants dubbed themselves \"The Order of the Dolphin\" (because of Lilly's work on dolphin communication), and commemorated their first meeting with a plaque at the observatory hall.\n\nEquation\n\nThe Drake equation is:\n\nN = R_* \\cdot f_\\mathrm{p} \\cdot n_\\mathrm{e} \\cdot f_\\mathrm{l} \\cdot f_\\mathrm{i} \\cdot f_\\mathrm{c} \\cdot L\n\nwhere:\n\n= the number of civilizations in our galaxy with which communication might be possible (i.e. which are on our current past light cone);\n\nand\n\n= the average rate of star formation in our galaxy\n= the fraction of those stars that have planets\n= the average number of planets that can potentially support life per star that has planets\n= the fraction of planets that could support life that actually develop life at some point\n= the fraction of planets with life that actually go on to develop intelligent life (civilizations)\n= the fraction of civilizations that develop a technology that releases detectable signs of their existence into space\nthe length of time for which such civilizations release detectable signals into space\n\nUsefulness\n\nThe Drake equation amounts to a summary of the factors affecting the likelihood that we might detect radio-communication from intelligent extraterrestrial life.\n The last four parameters, , , , and , are not known and are very difficult to estimate, with values ranging over many orders of magnitude (see criticism).  Therefore, the usefulness of the Drake equation is not in the solving, but rather in the contemplation of all the various concepts which scientists must incorporate when considering the question of life elsewhere, and gives the question of life elsewhere a basis for scientific analysis. The Drake equation is a statement that stimulates intellectual curiosity about the universe around us, for helping us to understand that life as we know it is the end product of a natural, cosmic evolution, and for helping us realize how much we are a part of that universe.  What the equation and the search for life has done is focus science on some of the other questions about life in the universe, specifically abiogenesis, the development of multi-cellular life and the development of intelligence itself.\n\nWithin the limits of our existing technology, any practical search for distant intelligent life must necessarily be a search for some manifestation of a distant technology. After about 50 years, the Drake equation is still of seminal importance because it is a 'road map' of what we need to learn in order to solve this fundamental existential question. It also formed the backbone of astrobiology as a science; although speculation is entertained to give context, astrobiology concerns itself primarily with hypotheses that fit firmly into existing scientific theories. Some 50 years of SETI have failed to find anything, even though radio telescopes, receiver techniques, and computational abilities have improved enormously since the early 1960s, but it has been discovered, at least, that our galaxy is not teeming with very powerful alien transmitters continuously broadcasting near the 21 cm hydrogen frequency. No one could say this in 1961.[http://www.astronomynow.com/news/n1004/SETI/ SETI: A celebration of the first 50 years]. Keith Cooper. Astronomy Now. 2000\n\nModifications\n\nAs many observers have pointed out, the Drake equation is a very simple model that does not include potentially relevant parameters,\n and many changes and modifications to the equation have been proposed.  One line of modification, for example, attempts to account for the uncertainty inherent in many of the terms.\n\nOthers note that the Drake equation ignores many concepts that might be relevant to the odds of contacting other civilizations.  For example, David Brin states: \"The Drake equation merely speaks of the number of sites at which ETIs spontaneously arise. The equation says nothing directly about the contact cross-section between an ETIS and contemporary human society\".\n  Because it is the contact cross-section that is of interest to the SETI community, many additional factors and modifications of the Drake equation have been proposed.\n\n;Colonization : It has been proposed to generalize the Drake equation to include additional effects of alien civilizations colonizing other star systems. Each original site expands with an expansion velocity , and establishes additional sites that survive for a lifetime .  The result is a more complex set of 3 equations.\n\n;Reappearance factor : The Drake equation may furthermore be multiplied by how many times an intelligent civilization may occur on planets where it has happened once. Even if an intelligent civilization reaches the end of its lifetime after, for example, 10,000 years, life may still prevail on the planet for billions of years, permitting the next civilization to evolve. Thus, several civilizations may come and go during the lifespan of one and the same planet. Thus, if  is the average number of times a new civilization reappears on the same planet where a previous civilization once has appeared and ended, then the total number of civilizations on such a planet would be , which is the actual reappearance factor added to the equation.\n\nThe factor depends on what generally is the cause of civilization extinction. If it is generally by temporary uninhabitability, for example a nuclear winter, then  may be relatively high. On the other hand, if it is generally by permanent uninhabitability, such as stellar evolution, then  may be almost zero. In the case of total life extinction, a similar factor may be applicable for , that is, how many times life may appear on a planet where it has appeared once.\n\n;METI factor : Alexander Zaitsev said that to be in a communicative phase and emit dedicated messages are not the same. For example, humans, although being in a communicative phase, are not a communicative civilization; we do not practise such activities as the purposeful and regular transmission of interstellar messages. For this reason, he suggested introducing the METI factor (messaging to extraterrestrial intelligence) to the classical Drake equation.\n He defined the factor as \"the fraction of communicative civilizations with clear and non-paranoid planetary consciousness\", or alternatively expressed, the fraction of communicative civilizations that actually engage in deliberate interstellar transmission.\n\nThe METI factor is somewhat misleading since active, purposeful transmission of messages by a civilization is not required for them to receive a broadcast sent by another that is seeking first contact. It is merely required they have capable and compatible receiver systems operational; however, this is a variable humans cannot accurately estimate.\n\n;Biogenic gases : Astronomer Sara Seager proposed a revised equation that focuses on the search for planets with biosignature gases. These gases are produced by living organisms that can accumulate in a planet atmosphere to levels that can be detected with remote space telescopes.[http://www.space.com/22648-drake-equation-alien-life-seager.html?cid=51463011558824 The Drake Equation Revisited: Interview with Planet Hunter Sara Seager] Devin Powell, Astrobiology Magazine  4 September 2013.\n\nThe Seager equation looks like this:\n:N \n N_* \\cdot F_\\mathrm{Q} \\cdot F_\\mathrm{HZ} \\cdot F_\\mathrm{O} \\cdot F_\\mathrm{L} \\cdot F_\\mathrm{S}\nwhere:\n\n: = the number of planets with detectable signs of life\n: = the number of stars observed\n: = the fraction of stars that are quiet\n: = the fraction of stars with rocky planets in the habitable zone\n: = the fraction of those planets that can be observed\n: = the fraction that have life\n: = the fraction on which life produces a detectable signature gas\n\nSeager stresses, “We’re not throwing out the Drake Equation, which is really a different topic,” explaining, “Since Drake came up with the equation, we have discovered thousands of exoplanets. We as a community have had our views revolutionized as to what could possibly be out there. And now we have a real question on our hands, one that’s not related to intelligent life: Can we detect any signs of life in any way in the very near future?”\n\nEstimates\n\nOriginal estimates\n\nThere is considerable disagreement on the values of these parameters, but the 'educated guesses' used by Drake and his colleagues in 1961 were:\n\n Note: This reference has a table of 1961 values, claimed to be taken from Drake & Sobel, but these differ from the book. \n*  = 1 yr−1 (1 star formed per year, on the average over the life of the galaxy; this was regarded as conservative)\n*  = 0.2 to 0.5 (one fifth to one half of all stars formed will have planets)\n*  = 1 to 5 (stars with planets will have between 1 and 5 planets capable of developing life)\n*  = 1 (100% of these planets will develop life)\n*  = 1 (100% of which will develop intelligent life)\n*  = 0.1 to 0.2 (10–20% of which will be able to communicate)\n*  = 1000 to 100,000,000 years (which will last somewhere between 1000 and 100,000,000 years)\n\nInserting the above minimum numbers into the equation gives a minimum N of 20 (see: Range of results). Inserting the maximum numbers gives a maximum of 50,000,000. Drake states that given the uncertainties, the original meeting concluded that , and there were probably between 1000 and 100,000,000 civilizations in the Milky Way galaxy.\n\nCurrent estimates\n\nThis section discusses and attempts to list the best current estimates for the parameters of the Drake equation.\n\nRate of star creation in our galaxy, \n\nLatest calculations from NASA and the European Space Agency indicate that the current rate of star formation in our galaxy is about  of material per year.\n To get the number of stars per year, this must account for the initial mass function (IMF) for stars, where the average new star mass is about . This gives a star formation rate of about 1.5–3 stars per year.\n\nFraction of those stars that have planets, \n\nRecent analysis of microlensing surveys has found that  may approach 1—that is, stars are orbited by planets as a rule, rather than the exception; and that there are one or more bound planets per Milky Way star.\n\nAverage number of planets per star having planets that might support life, \n\nIn November 2013, astronomers reported, based on Kepler space mission data, that there could be as many as 40 billion Earth-sized planets orbiting in the habitable zones of sun-like stars and red dwarf stars within the Milky Way Galaxy. 11 billion of these estimated planets may be orbiting sun-like stars. Since there are about 100 billion stars in the galaxy, this implies  is roughly 0.4. The nearest planet in the habitable zone may be as close as 12 light-years away, according to the scientists.\n\nThe consensus at the Green Bank meeting was that  had a minimum value between 3 and 5. Dutch astronomer Govert Schilling has opined that this is optimistic. Even if planets are in the habitable zone, the number of planets with the right proportion of elements is difficult to estimate. Brad Gibson, Yeshe Fenner, and Charley Lineweaver determined that about 10% of star systems in the Milky Way galaxy are hospitable to life, by having heavy elements, being far from supernovae and being stable for a sufficient time.\n\nThe discovery of numerous gas giants in close orbit with their stars has introduced doubt that life-supporting planets commonly survive the formation of their stellar systems. So-called hot Jupiters may migrate from distant orbits to near orbits, in the process disrupting the orbits of habitable planets.\n\nOn the other hand, the variety of star systems that might have habitable zones is not just limited to solar-type stars and Earth-sized planets. It is now estimated that even tidally locked planets close to red dwarf stars might have habitable zones,\n although the flaring behavior of these stars might argue against this. The possibility of life on moons of gas giants (such as Jupiter's moon Europa, or Saturn's moon Titan) adds further uncertainty to this figure.\n\nThe authors of the rare Earth hypothesis propose a number of additional constraints on habitability for planets, including being in galactic zones with suitably low radiation, high star metallicity, and low enough density to avoid excessive asteroid bombardment. They also propose that it is necessary to have a planetary system with large gas giants which provide bombardment protection without a hot Jupiter; and a planet with plate tectonics, a large moon that creates tidal pools, and moderate axial tilt to generate seasonal variation.\n\nFraction of the above that actually go on to develop life, \n\nGeological evidence from the Earth suggests that  may be high; life on Earth appears to have begun around the same time as favorable conditions arose, suggesting that abiogenesis may be relatively common once conditions are right. However, this evidence only looks at the Earth (a single model planet), and contains anthropic bias, as the planet of study was not chosen randomly, but by the living organisms that already inhabit it (ourselves). From a classical hypothesis testing standpoint, there are zero degrees of freedom, permitting no valid estimates to be made. If life were to be found on Mars that developed independently from life on Earth it would imply a value for  close to 1. While this would raise the degrees of freedom from zero to one, there would remain a great deal of uncertainty on any estimate due to the small sample size, and the chance they are not really independent.\n\nCountering this argument is that there is no evidence for abiogenesis occurring more than once on the Earth — that is, all terrestrial life stems from a common origin. If abiogenesis were more common it would be speculated to have occurred more than once on the Earth. Scientists have searched for this by looking for bacteria that are unrelated to other life on Earth, but none have been found yet.\n It is also possible that life arose more than once, but that other branches were out-competed, or died in mass extinctions, or were lost in other ways. Biochemists Francis Crick and Leslie Orgel laid special emphasis on this uncertainty: \"At the moment we have no means at all of knowing\" whether we are \"likely to be alone in the galaxy (Universe)\" or whether \"the galaxy may be pullulating with life of many different forms.\"\n As an alternative to abiogenesis on Earth, they proposed the hypothesis of directed panspermia, which states that Earth life began with \"microorganisms sent here deliberately by a technological society on another planet, by means of a special long-range unmanned spaceship\".\n\nFraction of the above that develops intelligent life, \n\nThis value remains particularly controversial. Those who favor a low value, such as the biologist Ernst Mayr, point out that of the billions of species that have existed on Earth, only one has become intelligent and from this, infer a tiny value for .\n Likewise, the Rare Earth hypothesis, notwithstanding their low value for  above, also think a low value for  dominates the analysis.Rare Earth, p. xviii.: \"We believe that life in the form of microbes or their equivalents is very common in the universe, perhaps more common than even Drake or Sagan envisioned. However, complex life – animals and higher plants – is likely to be far more rare than commonly assumed.\" Those who favor higher values note the generally increasing complexity of life over time, concluding that the appearance of intelligence is almost inevitable,\n\n implying an  approaching 1. Skeptics point out that the large spread of values in this factor and others make all estimates unreliable. (See Criticism).\n\nIn addition, while it appears that life developed soon after the formation of Earth, the Cambrian explosion, in which a large variety of multicellular life forms came into being, occurred a considerable amount of time after the formation of Earth, which suggests the possibility that special conditions were necessary. Some scenarios such as the snowball Earth or research into the extinction events have raised the possibility that life on Earth is relatively fragile. Research on any past life on Mars is relevant since a discovery that life did form on Mars but ceased to exist might raise our estimate of fl but would indicate that in half the known cases, intelligent life did not develop.\n\nEstimates of  have been affected by discoveries that the Solar System's orbit is circular in the galaxy, at such a distance that it remains out of the spiral arms for tens of millions of years (evading radiation from novae). Also, Earth's large moon may aid the evolution of life by stabilizing the planet's axis of rotation.\n\nFraction of the above revealing their existence via signal release into space, \n\nFor deliberate communication, the one example we have (the Earth) does not do much explicit communication, though there are some efforts covering only a tiny fraction of the stars that might look for our presence. (See Arecibo message, for example). There is considerable speculation why an extraterrestrial civilization might exist but choose not to communicate. However, deliberate communication is not required, and calculations indicate that current or near-future Earth-level technology might well be detectable to civilizations not too much more advanced than our own.\n By this standard, the Earth is a communicating civilization.\n\nAnother question is what percentage of civilizations in the galaxy are close enough for us to detect, assuming that they send out signals. For example, existing Earth radio telescopes could only detect Earth radio transmissions from roughly a light year away.\n\nLifetime of such a civilization wherein it communicates its signals into space, \n\nMichael Shermer estimated  as 420 years, based on the duration of sixty historical Earthly civilizations.\n Using 28 civilizations more recent than the Roman Empire, he calculates a figure of 304 years for \"modern\" civilizations. It could also be argued from Michael Shermer's results that the fall of most of these civilizations was followed by later civilizations that carried on the technologies, so it is doubtful that they are separate civilizations in the context of the Drake equation. In the expanded version, including reappearance number, this lack of specificity in defining single civilizations does not matter for the end result, since such a civilization turnover could be described as an increase in the reappearance number rather than increase in , stating that a civilization reappears in the form of the succeeding cultures. Furthermore, since none could communicate over interstellar space, the method of comparing with historical civilizations could be regarded as invalid.\n\nDavid Grinspoon has argued that once a civilization has developed enough, it might overcome all threats to its survival. It will then last for an indefinite period of time, making the value for  potentially billions of years. If this is the case, then he proposes that the Milky Way galaxy may have been steadily accumulating advanced civilizations since it formed.\n He proposes that the last factor  be replaced with , where  is the fraction of communicating civilizations become \"immortal\" (in the sense that they simply do not die out), and  representing the length of time during which this process has been going on. This has the advantage that  would be a relatively easy to discover number, as it would simply be some fraction of the age of the universe.\n\nIt has also been hypothesized that once a civilization has learned of a more advanced one, its longevity could increase because it can learn from the experiences of the other.\n\nThe astronomer Carl Sagan speculated that all of the terms, except for the lifetime of a civilization, are relatively high and the determining factor in whether there are large or small numbers of civilizations in the universe is the civilization lifetime, or in other words, the ability of technological civilizations to avoid self-destruction. In Sagan's case, the Drake equation was a strong motivating factor for his interest in environmental issues and his efforts to warn against the dangers of nuclear warfare.\n\nRange of results\n\nAs many skeptics have pointed out, the Drake equation can give a very wide range of values, depending on the assumptions,\"The value of  remains highly uncertain. Even if we had a perfect knowledge of the first two terms in the equation, there are still five remaining terms, each of which could be uncertain by factors of 1,000.\" from , or more informally, \"The Drake Equation can have any value from \"billions and billions\" to zero\", Michael Crichton, as quoted in , pp. 13 and the values used in portions of the Drake equation are not well-established. In particular, the result can be , meaning we are likely alone in the galaxy, or , implying there are many civilizations we might contact. One of the few points of wide agreement is that the presence of humanity implies a probability of intelligence arising of greater than zero.\n\nAs an example of a low estimate, combining NASA's star formation rates, the rare Earth hypothesis value of ,Rare Earth, page 270: \"When we take into account factors such as the abundance of planets and the location and lifetime of the habitable zone, the Drake Equation suggests that only between 1% and 0.001% of all stars might have planets with habitats similar to Earth. [...] If microbial life forms readily, then millions to hundreds of millions of planets in the galaxy have the potential for developing advanced life. (We expect that a much higher number will have microbial life.)\" Mayr's view on intelligence arising, Drake's view of communication, and Shermer's estimate of lifetime:\n, , , [Drake, above], and  years\ngives:\ni.e., suggesting that we are probably alone in this galaxy, and possibly in the observable universe.\n\nOn the other hand, with larger values for each of the parameters above, values of  can be derived that are greater than 1. The following higher values that have been proposed for each of the parameters:\n, , ,\n\n ,\n , [Drake, above], and  years\nUse of these parameters gives:\nMonte Carlo simulations of estimates of the Drake equation factors based on a stellar and planetary model of the Milky Way have resulted in the number of civilizations varying by a factor of 100.\n\nHas intelligent life ever existed?\n\nThe Drake equation can be modified to determine just how unlikely intelligent life must be, to give the result that Earth has the only intelligent life that has ever arisen, either in our galaxy or the universe as a whole. This simplifies the calculation by removing the lifetime and communication constraints. Since star and planets counts are known, this leaves the only unknown as the odds that a habitable planet ever develops intelligent life. For Earth to have the only civilization that has ever occurred in the universe, then the odds of any habitable planet ever developing such a civilization must be less than . Similarly, for Earth to host the only civilization in our galaxy for all time, the odds of a habitable zone planet ever hosting intelligent life must be less than  (about 1 in 60 billion). The figure for the universe implies that it is highly unlikely that Earth hosts the only intelligent life that has ever occurred. The figure for our galaxy suggests that other civilizations may have occurred or will likely occur in our galaxy.\n\nCriticism\n\nCriticism of the Drake equation follows mostly from the observation that several terms in the equation are largely or entirely based on conjecture.  Star formation rates are well-known, and the incidence of planets has a sound theoretical and observational basis, but the other terms in the equation become very speculative. The uncertainties revolve around our understanding of the evolution of life, intelligence, and civilization, not physics.  No statistical estimates are possible for some of the parameters, where only one example is known.  The net result is that the equation cannot be used to draw firm conclusions of any kind, and the resulting margin of error is huge, far beyond what some consider acceptable or meaningful.\n\nOne reply to such criticisms\n is that even though the Drake equation currently involves speculation about unmeasured parameters, it was intended as a way to stimulate dialogue on these topics. Then the focus becomes how to proceed experimentally. Indeed, Drake originally formulated the equation merely as an agenda for discussion at the Green Bank conference.\n \n\nFermi paradox\n\nThe pessimists' most telling argument in the SETI debate stems not from theory or conjecture but from an actual observation: the presumed lack of extraterrestrial contact. A civilization lasting for tens of millions of years might be able to travel anywhere in the galaxy, even at the slow speeds foreseeable with our own kind of technology.  Furthermore, no confirmed signs of intelligence elsewhere have been recognized as such, either in our galaxy or in the observable universe of 2 trillion galaxies. According to this line of thinking, the tendency to fill up all available territory seems to be a universal trait of living things, so the Earth should have already been colonized, or at least visited, but no evidence of this exists.  Hence Fermi's question \"Where is everybody?\".\n\nA large number of explanations have been proposed to explain this lack of contact; a book published in 2015 elaborated on 75 different explanations.\n In terms of the Drake Equation, the explanations can be divided into three classes:\n\n*Few intelligent civilizations ever arise.  This is an argument that at least one of the first few terms, , has a low value.  The most common suspect is , but explanations such as the rare Earth hypothesis argue that  is the small term.\n*Intelligent civilizations exist, but we see no evidence, meaning  is small.  Typical arguments include that civilizations are too far apart, it is too expensive to spread throughout the galaxy, civilizations broadcast signals for only a brief period of time, it is dangerous to communicate, and many others.\n*The lifetime of intelligent, communicative civilizations is short, meaning the value of  is small. Drake suggested that a large number of extraterrestrial civilizations would form, and he further speculated that the lack of evidence of such civilizations may be because technological civilizations tend to disappear rather quickly. Typical explanations include it is the nature of intelligent life to destroy itself, it is the nature of intelligent life to destroy others, they tend to experience a technological singularity, and others.\n\nThese lines of reasoning lead to the Great Filter hypothesis,\n which states that since there are no observed extraterrestrial civilizations, despite the vast number of stars, then some step in the process must be acting as a filter to reduce the final value. According to this view, either it is very difficult for intelligent life to arise, or the lifetime of such civilizations, or the period of time they reveal their existence, must be relatively short.\n\nIn fiction and popular culture\n\nThe equation was cited by Gene Roddenberry as supporting the multiplicity of inhabited planets shown on Star Trek, the television series he created. However, Roddenberry did not have the equation with him, and he was forced to \"invent\" it for his original proposal.The Making of Star Trek by Stephen E. Whitfield and Gene Roddenberry, Ballantine Books, N. Y., 1968 The invented equation created by Roddenberry is:\n:Ff^2 (MgE)-C^1 Ri^1 \\cdot M=L/So \nHowever, a number raised to the first power is merely the number itself. Drake equation. http://en.wikipedia.org/?curid=8912."
  }
}
