{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15358",
  "eid" : "1b7997d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778555341,
  "textBody" : "The insanity defense, also known as the mental disorder defense, is a defense by excuse in a criminal case, arguing that the defendant is not responsible for his or her actions due to an episodic or persistent psychiatric disease at the time of the criminal act. This is contrasted with an excuse of provocation, in which defendant is responsible, but the responsibility is lessened due to a temporary mental state.Criminal Law - Cases and Materials, 7th ed. 2012, Wolters Kluwer Law & Business; John Kaplan, Robert Weisberg, Guyora Binder, , [https://law.stanford.edu/publications/criminal-law-cases-and-materials-7th-edition/] It is also contrasted with a finding that a defendant cannot stand trial in a criminal case because a mental disease prevents him or her from effectively assisting counsel, from a civil finding in trusts and estates where a will is nullified because it was made when a mental disorder prevented a testator from recognizing the natural objects of their bounty, and from involuntary civil commitment to a mental institution, when a person is found to be gravely disabled or to be a danger to himself or herself or to others.\n\nExemption from full criminal punishment on such grounds dates back to at least the Code of Hammurabi.Fletcher, G. (1998) Basic Concepts of Criminal Law. NY: Oxford Univ. Press. Legal definitions of insanity or mental disorder are varied, and include the M'Naghten Rule, the Durham rule, the 1953 British Royal Commission on Capital Punishment report, the ALI rule (American Legal Institute Model Penal Code rule), and other provisions, often relating to a lack of mens rea (\"guilty mind\"). In the criminal laws of Australia and Canada, statutory legislation enshrines the M'Naghten Rules, with the terms defense of mental disorder, defense of mental illness or not criminally responsible by reason of mental disorder employed. Being incapable of distinguishing right from wrong is one basis for being found to be legally insane as a criminal defense. It originated in the M'Naghten Rule, and has been reinterpreted and modernized through more recent cases, such as People v. Serravo.\n\nIn the United Kingdom, Ireland, and the United States, use of the defense is rare; however, since the Criminal Procedure (Insanity and Unfitness to Plead) Act 1991, insanity pleas have steadily increased in the UK.RD Mackay, BJ Mitchell, L Howe (2006) 'Yet more facts about the insanity defence' Criminal Law Review 399-411  Mitigating factors, including things not eligible for the insanity defense such as intoxicationAmerican Psychiatric Association: The Insanity Defense: Position Statement. Washington, DC: APA Document Reference No. 820002, 1982 (or, more frequently, diminished capacity), may lead to reduced charges or reduced sentences.\n\nThe defense is based on evaluations by forensic mental health professionals with the appropriate test according to the jurisdiction. Their testimony guides the jury, but they are not allowed to testify to the accused's criminal responsibility, as this is a matter for the jury to decide. Similarly, mental health practitioners are restrained from making a judgment on the issue of whether the defendant is or is not insane or what is known as the \"ultimate issue\".\n\nSome jurisdictions require the evaluation to address the defendant's ability to control their behavior at the time of the offense (the volitional limb). A defendant claiming the defense is pleading \"not guilty by reason of insanity\" (NGRI) or \"guilty but insane or mentally ill\" in some jurisdictions which, if successful, may result in the defendant being committed to a psychiatric facility for an indeterminate period.\n\nMitigating factors and diminished capacity\n\nThe United States Supreme Court (in Penry v. Lynaugh) and the United States Court of Appeals for the Fifth Circuit (in Bigby v. Dretke) have been clear in their decisions that jury instructions in death penalty cases that do not ask about mitigating factors regarding the defendant's mental health violate the defendant's Eighth Amendment rights, saying that the jury is to be instructed to consider mitigating factors when answering unrelated questions. This ruling suggests specific explanations to the jury are necessary to weigh mitigating factors.\n\nDiminished responsibility or diminished capacity can be employed as a mitigating factor or partial defense to crimes and, in the United States, is applicable to more circumstances than the insanity defense. The Homicide Act 1957 is the statutory basis for the defense of diminished responsibility in England and Wales, whereas in Scotland it is a product of case law. The number of findings of diminished responsibility has been matched by a fall in unfitness to plead and insanity findings (Walker, 1968). A plea of diminished capacity is different from a plea of insanity in that \"reason of insanity\" is a full defense while \"diminished capacity\" is merely a plea to a lesser crime.\n\nNon compos mentis\n\nNon compos mentis (Latin) is a legal term meaning \"not of sound mind\". Non compos mentis derives from the Latin non meaning \"not\", compos meaning \"having command\" or \"composed\", and mentis (genitive singular of mens), meaning \"of mind\". It is the direct opposite of Compos mentis (of a sound mind).\n\nAlthough typically used in law, this term can also be used metaphorically or figuratively; e.g. when one is in a confused state, intoxicated, or not of sound mind. The term may be applied when a determination of competency needs to be made by a physician for purposes of obtaining informed consent for treatments and, if necessary, assigning a surrogate to make health care decisions.  While the proper sphere for this determination is in a court of law, this is practically, and most frequently, made by physicians in the clinical setting.[http://content.nejm.org/cgi/content/full/357/18/1834 Assessment of Patients' Competence to Consent to Treatment]\n\nIn English law, the rule of non compos mentis was most commonly used when the defendant invoked religious or magical explanations for behaviour.\n\nWithdrawal or refusal of defense\n\nSeveral cases have ruled that persons found not guilty by reason of insanity may not withdraw the defense in a habeas petition to pursue an alternative, although there have been exceptions in other rulings. In State v. Connelly, 700 A.2d 694 (Conn. App. Ct. 1997), the petitioner who had originally been found not guilty by reason of insanity and committed for ten years to the jurisdiction of a Psychiatric Security Review Board, filed a pro se writ of habeas corpus and the court vacated his insanity acquittal. He was granted a new trial and found guilty of the original charges, receiving a prison sentence of 40 years.\n\nIn the landmark case of Frendak v. United States in 1979, the court ruled that the insanity defense cannot be imposed upon an unwilling defendant if an intelligent defendant voluntarily wishes to forgo the defense.\n\nPsychiatric treatments\n\nThose found to have been not guilty by reason of mental disorder or insanity are generally then required to undergo psychiatric treatment in a mental institution, except in the case of temporary insanity (see below).  In England and Wales, under the Criminal Procedure (Insanity and Unfitness to Plead) Act of 1991 (amended by the Domestic Violence, Crime and Victims Act, 2004 to remove the option of a guardianship order), the court can mandate a hospital order, a restriction order (where release from hospital requires the permission of the Home Secretary), a \"supervision and treatment\" order, or an absolute discharge. Unlike defendants who are found guilty of a crime, they are not institutionalized for a fixed period, but rather held in the institution until they are determined not to be a threat. Authorities making this decision tend to be cautious, and as a result, defendants can often be institutionalized for longer than they would have been incarcerated in prison.Kenber, Billy (4 June 2015) [http://times-deck.s3-eu-west-1.amazonaws.com/projects/2715518c875999308842e3455eda2fe3.html A plea for sanity] The Times, (Raymond Gregory, on the advice of his lawyer, pleaded insanity in 1971 to being asleep drunk on a building site in Washington DC, USA with a pen knife in his pocket. He was kept locked up for 39 years), Retrieved 4 June 2015\n\nIn Foucha v. Louisiana (1992) the Supreme Court of the United States ruled that a person could not be held \"indefinitely\".\n\nSo far, in the United States, those acquitted of a federal offense by reason of insanity have not been able to challenge their psychiatric confinement through a writ of habeas corpus or other remedies. In Archuleta v. Hedrick, 365 F.3d 644 (8th Cir. 2004), the U.S. Court of Appeals for the Eighth Circuit the court ruled persons found not guilty by reason of insanity and later want to challenge their confinement may not attack their initial successful insanity defense:\n\nIncompetency and mental illness\n\nAn important distinction to be made is the difference between competency and criminal responsibility.\n*The issue of competency is whether a defendant is able to adequately assist his attorney in preparing a defense, make informed decisions about trial strategy and whether to plead guilty or accept a plea agreement. This issue is dealt with in UK law as \"fitness to plead\".\n\nCompetency largely deals with the defendant's present condition, while criminal responsibility addresses the condition at the time the crime was committed.\n\nIn the United States, a trial in which the insanity defense is invoked typically involves the testimony of psychiatrists or psychologists who will, as expert witnesses, present opinions on the defendant's state of mind at the time of the offense.\n\nTherefore, a person whose mental disorder is not in dispute is determined to be sane if the court decides that despite a \"mental illness\" the defendant was responsible for the acts committed and will be treated in court as a normal defendant. If the person has a mental illness and it is determined that the mental illness interfered with the person's ability to determine right from wrong (and other associated criteria a jurisdiction may have) and if the person is willing to plead guilty or is proven guilty in a court of law, some jurisdictions have an alternative option known as either a Guilty but Mentally Ill (GBMI) or a Guilty but Insane verdict. The GBMI verdict is available as an alternative to, rather than in lieu of, a \"not guilty by reason of insanity\" verdict. Michigan (1975) was the first state to create a GBMI verdict, after two prisoners released after being found NGRI committed violent crimes within a year of release, one raping two women and the other killing his wife.\n\nTemporary insanity\n\nThe notion of temporary insanity argues that a defendant was insane during the commission of a crime, but they later regained their sanity after the criminal act was carried out. This legal defense is commonly used to defend individuals that have committed crimes of passion.  The defense was first used by U.S. Congressman Daniel Sickles of New York in 1859 after he had killed his wife's lover, Philip Barton Key. The defense was later used commonly during the 1940s and 1950s. Another 19th-century case was that of Charles J. Guiteau, who assassinated President James Garfield in 1881.  Guiteau's Case, 10 F.161 (1882).\n\nHistory\n\nThe concept of defense by insanity has existed since ancient Greece and Rome. However, in colonial America a delusional Dorothy Talbye was hanged in 1638 for murdering her daughter, as at the time Massachusetts's common law made no distinction between insanity (or mental illness) and criminal behavior. Edward II, under English Common law, declared that a person was insane if their mental capacity was no more than that of a \"wild beast\" (in the sense of a dumb animal, rather than being frenzied).  The first complete transcript of an insanity trial dates to 1724. It is likely that the insane, like those under 14, were spared trial by ordeal. When trial by jury replaced this, the jury members were expected to find the insane guilty but then refer the case to the King for a Royal Pardon. From 1500 onwards, juries could acquit the insane, and detention required a separate civil procedure (Walker, 1985). The Criminal Lunatics Act 1800, passed with retrospective effect following the acquittal of James Hadfield, mandated detention at the regent's pleasure (indefinitely) even for those who, although insane at the time of the offence, were now sane.\n\nThe M'Naghten Rules of 1843 were not a codification or definition of insanity but rather the responses of a panel of judges to hypothetical questions posed by Parliament in the wake of Daniel M'Naghten's acquittal for the homicide of Edward Drummond, whom he mistook for British Prime Minister Robert Peel. The rules define the defense as \"at the time of committing the act the party accused was labouring under such a defect of reason, from disease of the mind, as not to know the nature and quality of the act he was doing, or as not to know that what he was doing was wrong.\"  The key is that the defendant could not appreciate the nature of his actions during the commission of the crime. M'Naghten's Case, 8 Eng. Rep. 718 (1843).\n\nIn Ford v. Wainwright 477 U.S. 399 (1986), the US Supreme Court upheld the common law rule that the insane cannot be executed. It further stated that a person under the death penalty is entitled to a competency evaluation and to an evidentiary hearing in court on the question of his competency to be executed.\nIn Wainwright v. Greenfield, the Court ruled that it was fundamentally unfair for the prosecutor to comment during the court proceedings on the petitioner's silence invoked as a result of a Miranda warning. The prosecutor had argued that the respondent's silence after receiving Miranda warnings was evidence of his sanity.\n\nUnited States law\n\nIn the United States, variances in the insanity defense between states, and in the federal court system, are attributable to differences with respect to three key issues:\n#Availability: whether the jurisdiction allows a defendant to raise the insanity defense,\n#Definition: when the defense is available, what facts will support a finding of insanity, and\n#Burden of proof: whether the defendant has the duty of proving insanity or the prosecutor has the duty of disproving insanity, and by what standard of proof.\n\nAvailability\n\nIn the United States, a criminal defendant may plead insanity in federal court, and in the state courts of every state except for Idaho, Kansas, Montana, and Utah. However, defendants in states that disallow the insanity defense may still be able to demonstrate that a defendant was not capable of forming intent to commit a crime as a result of mental illness.\n\nDefinition\n\nEach state and the federal court system currently uses one of the following \"tests\" to define insanity for purposes of the insanity defense. Over its decades of use the definition of insanity has been modified by statute, with changes to the availability of the insanity defense, what constitutes legal insanity whether the prosecutor or defendant has the burden of proof, the standard of proof required at trial, trial procedures, and to commitment and release procedures for defendants who have been acquitted based on a finding of insanity.\n\nM'Naghten test\n\nThe guidelines for the M'Naghten Rules (1843) 10 C & F 200, state, inter alia, and evaluating the criminal responsibility for defendants claiming to be insane were settled in the British courts in the case of Daniel M'Naghten in 1843. M'Naghten was a Scottish woodcutter who killed the secretary to the prime minister, Edward Drummond, in a botched attempt to assassinate the prime minister himself. M'Naghten apparently believed that the prime minister was the architect of the myriad of personal and financial misfortunes that had befallen him. During his trial, nine witnesses testified to the fact that he was insane, and the jury acquitted him, finding him \"not guilty by reason of insanity.\"\n\nThe House of Lords asked the judges of the common law courts to answer five questions on insanity as a criminal defence,Carl Elliott, The rules of insanity: moral responsibility and the mentally ill offender, SUNY Press, 1996, , p.10Michael T. Molan, Mike Molan, Duncan Bloy, Denis Lanser, Modern criminal law (5 ed), Routledge Cavendish, 2003, , p.352 and the formulation that emerged from their review—that a defendant should not be held responsible for his actions only if, as a result of his mental disease or defect, he (i) did not know that his act would be wrong; or (ii) did not understand the nature and quality of his actions—became the basis of the law governing legal responsibility in cases of insanity in England. Under the rules, loss of control because of mental illness was no defense. The M'Naghten rule was embraced with almost no modification by American courts and legislatures for more than 100 years, until the mid-20th century.  M'Naghten's Case, 8 Eng. Rep. 718 (1843).\n\nDurham/New Hampshire test\n\nThe strict M'Naghten standard for the insanity defense was widely used until the 1950s and the case of Durham v. United States case. In the Durham case, the court ruled that a defendant is entitled to acquittal if the crime was the product of his mental illness (i.e., crime would not have been committed but for the disease). The test, also called the Product Test, is broader than either the M'Naghten test or the irresistible impulse test. The test has more lenient guidelines for the insanity defense, but it addressed the issue of convicting mentally ill defendants, which was allowed under the M'Naghten Rule.  M'Naghten's Case, 8 Eng.Rep. 718 (1843). However, the Durham standard drew much criticism because of its expansive definition of legal insanity.\n\nModel Penal Code test\n\nThe Model Penal Code, published by the American Law Institute, provides a standard for legal insanity that serves as a compromise between the strict M'Naghten Rule, the lenient Durham ruling, and the irresistible impulse test. Under the MPC standard, which represents the modern trend, a defendant is not responsible for criminal conduct \"if at the time of such conduct as a result of mental disease or defect he lacks substantial capacity either to appreciate the criminality of his conduct or to conform his conduct to the requirements of the law.\" The test thus takes into account both the cognitive and volitional capacity of insanity.\n\nFederal courts\n\nAfter the perpetrator of President Reagan's assassination attempt was found not guilty by reason of insanity, Congress passed the Insanity Defense Reform Act of 1984.  Under this act, the burden of proof was shifted from the prosecution to the defense and the standard of evidence in federal trials was increased from a preponderance of evidence to clear and convincing evidence.  The ALI test was discarded in favor of a new test that more closely resembled M'Naghten's.  Under this new test only perpetrators suffering from severe mental illnesses at the time of the crime could successfully employ the insanity defense.  The defendant's ability to control himself or herself was no longer a consideration.\n\nThe Act also curbed the scope of expert psychiatric testimony and adopted stricter procedures regarding the hospitalization and release of those found not guilty by reason of insanity.\n\nGuilty but mentally ill\n\nAs an alternative to the insanity defense, some jurisdictions permit a defendant to plead guilty but mentally ill. A defendant who is found guilty but mentally ill may be sentenced to mental health treatment, at the conclusion of which the defendant will serve the remainder of his or her sentence in the same manner as any other defendant.\n\nBurden of proof\n\nIn a majority of states, the burden of proving insanity is placed on the defendant, who must prove insanity by a preponderance of the evidence.\n\nIn a minority of states, the burden is placed on the prosecution, who must prove sanity beyond a reasonable doubt.\n\nIn federal court, and in Arizona, the burden is placed on the defendant, who must prove insanity by clear and convincing evidence.  See 18 U.S.C.S. Sec. 17(b); see also A.R.S. Sec. 13-502(C).\n\nControversy\n\nThe insanity plea is used in the U.S Criminal Justice System in less than 1% of all criminal cases. Little is known about the criminal justice system and the mentally ill:\n\nSome U.S. states have begun to ban the use of the insanity defense, and in 1994 the Supreme Court denied a petition of certiorari seeking review of a Montana Supreme Court case that upheld Montana's abolition of the defense.[https://www.washingtonpost.com/wp-srv/local/longterm/aron/scotus032994.htm Court: Insanity Defense Not a Right] Washington Post, March 29, 1994 Idaho, Kansas, and Utah have also banned the defense. However, a mentally ill defendant/patient can be found unfit to stand trial in these states. In 2001, the Nevada Supreme Court found that their state's abolition of the defense was unconstitutional as a violation of Federal due process.  In 2006, the Supreme Court decided Clark v. Arizona upheld Arizona's limitations on the insanity defense. In that same ruling, the Court noted \"We have never held that the Constitution mandates an insanity defense, nor have we held that the Constitution does not so require.\"\n\nThe insanity defense is also complicated because of the underlying differences in philosophy between psychiatrists/psychologists and legal professionals.  In the United States, a psychiatrist, psychologist or other mental health professional is often consulted as an expert witness in insanity cases, but the ultimate legal judgment of the defendant's sanity is determined by a jury, not by a psychologist.  In other words, psychologists provide testimony and professional opinion but are not ultimately responsible for answering legal questions.\n\nAustralian law\n\nIn Australia there are nine law units. All may have varying rules (see [https://web.archive.org/web/20130412231404/http://www.aija.org.au/ac03/papers/DavidGrace.rtf]). In South Australia, the Criminal Law Consolidation Act 1935 (SA) provides that:\n\n269C—Mental competence\n\nA person is mentally incompetent to commit an offence if, at the time of the conduct alleged to give rise to the offence, the person is suffering from a mental impairment and, in consequence of the mental impairment—\n(a) does not know the nature and quality of the conduct; or\n(b) does not know that the conduct is wrong; or\n(c) is unable to control the conduct.\n269H—Mental unfitness to stand trial\n\nA person is mentally unfit to stand trial on a charge of an offence if the person's mental processes are so disordered or impaired that the person is—\n(a) unable to understand, or to respond rationally to, the charge or the allegations on which the charge is based; or\n(b)  unable to exercise (or to give rational instructions about the exercise of) procedural rights (such as, for example, the right to challenge jurors); or\n(c)  unable to understand the nature of the proceedings, or to follow the evidence or the course of the proceedings.\n\nIn Victoria the current defence of mental impairment was introduced in the Crimes (Mental Impairment and Unfitness to be Tried) Act 1997 which replaced the common law defence of insanity and indefinite detention at the governor's pleasure with the following:\nthe accused was suffering from a mental impairment; and\nthe mental impairment affected the accused so he or she either did not understand the nature and quality of the conduct, or did not know that it was wrong.\nThese requirements are almost identical to the M'Naghten Rules, substituting \"mental impairment\" for \"disease of the mind\".M’Naghten's Case [1843-1860] ALL ER Rep 229; Bratty v Attorney-General for Northern Ireland [1963] UKHL 3 (03 October 1961) [http://www.bailii.org/uk/cases/UKHL/1961/3.html BAILII]\n\nIn New South Wales, the defence has been renamed the 'Defence of Mental Illness' in [http://www.austlii.edu.au/au/legis/nsw/consol_act/mhpa1990355/ Pt4 of the Mental Health (Forensic Provisions) Act 1990]. However, definitions of the defence are derived from M'Naghten's case and have not been codified. Whether a particular condition amounts to a disease of the mind is not a medical but a legal question to be decided in accordance with the ordinary rules of interpretation.R v Falconer (1990) 171 CLR 30 [http://www.austlii.edu.au/au/cases/cth/HCA/1990/49.html AustLII] This defence is an exception to the Woolmington v DPP (1935) Woolmington v DPP [1935] UKHL 1 'golden thread', as the party raising the issue of the defence of mental illness bears the burden of proving this defence on the balance of probabilities See [http://www.austlii.edu.au/au/cases/cth/HCA/1933/1.html R v Porter]. Generally, the defence will raise the issue of insanity. However, the prosecution can raise it in exceptional circumstances: R v Ayoub (1984). R v Ayoub (1984) 2 NSWLR 511\n\nAustralian cases have further qualified and explained the M'Naghten Rules. The NSW Supreme Court in held there are two limbs to the M'Naghten Rules, that the accused did not know what he was doing, or that the accused did not appreciate that what he was doing was morally wrong, in both cases the accused must be operating under a 'defect of reason, from a disease of the mind'.R v Jennings [2005] NSWSC 789 (Kirby J) (11 August 2005) [26] [http://www.austlii.edu.au/cgi-bin/sinodisp/au/cases/nsw/NSWSC/2005/789.html? Austlii]. The High Court in [http://www.austlii.edu.au/au/cases/cth/HCA/1933/1.html R v Porter] stated that the condition of the accused’s mind is relevant only at the time of the actus reus.R v Porter [1933] HCA 1 [http://www.austlii.edu.au/au/cases/cth/HCA/1933/1.html Austlii] In Woodbridge v The Queen the court stated that a symptom indicating a disease of the mind must be prone to recur and be the result of an underlying pathological infirmity.Woodbridge v The Queen (2010) 208 A Crim R 503, 531 (Davies J) A ‘defect of reason’ is the inability to think rationally and pertains to incapacity to reason, rather than having unsound ideas or difficulty with such a task. Examples of disease of the mind include Arteriosclerosis (considered so because the hardening of the arteries affects the mind. See \" See also.R v Cheatham [2000] NSWCCA 282 [http://www.austlii.edu.au/au/cases/nsw/NSWCCA/2000/282.html Austlii]\n\nCanadian law\n\nCriminal Code provisions\n\nThe defence of mental disorder is codified in section 16 of the Criminal Code which states, in part:\n16. (1) No person is criminally responsible for an act committed or an omission made while suffering from a mental disorder that rendered the person incapable of appreciating the nature and quality of the act or omission or of knowing that it was wrong. \n\nTo establish a claim of mental disorder the party raising the issue must show on a balance of probabilities first that the person who committed the act was suffering from a \"disease of the mind\", and second, that at the time of the offence they were either 1) unable to appreciate the \"nature and quality\" of the act, or 2) did not know it was \"wrong\".\n\nThe meaning of the word \"wrong\" was determined in the Supreme Court case of R. v. Chaulk Case citation#Canada|[1990] 3 S.C.R. which held that \"wrong\" was NOT restricted to \"legally wrong\" but to \"morally wrong\" as well.\n\nPost-verdict conditions\n\nThe current legislative scheme was created by the Parliament of Canada after the previous scheme was found unconstitutional by the Supreme Court of Canada in R. v. Swain.  The new provisions also replaced the old insanity defense with the current mental disorder defence.\n\nOnce a person is found not criminally responsible (\"NCR\"), he or she will have a hearing by a Review Board within 45 days (90 days if the court extends the delay). A Review Board is established under Part XX.1 of the Criminal Code and is composed of at least three members, a person who is a judge or eligible to be a judge, a psychiatrist and another expert in a relevant field, such as social work, criminology or psychology. Parties at a Review Board hearing are usually the accused, the Crown and the hospital responsible for the supervision or assessment of the accused. A Review Board is responsible for both accused persons found NCR or accused persons found unfit to stand trial on account of mental disorder. A Review Board dealing with an NCR offender must consider two questions: whether the accused is a \"significant threat to the safety of the public\" and, if so, what the \"least onerous and least restrictive\" restrictions on the liberty of the accused should be in order to mitigate such a threat. Proceedings before a Review Board are inquisitorial rather than adversarial. Often the Review Board will be active in conducting an inquiry. Where the Review Board is unable to conclude that the accused is a significant threat to the safety of the public, the review board must grant the accused an absolute discharge, an order essentially terminating the jurisdiction of the criminal law over the accused. Otherwise the Review Board must order that the accused be either discharged subject to conditions or detained in a hospital, both subject to conditions. The conditions imposed must be the least onerous and least restrictive necessary to mitigate any danger the accused may pose to others.\n\nSince the Review Board is empowered under criminal law powers under s. 91(27) of the Constitution Act, 1867 the sole justification for its jurisdiction is public safety. Therefore, the nature of the inquiry is the danger the accused may pose to the public safety rather than whether the accused is \"cured.\" For instance, many \"sick\" accused persons are discharged absolutely on the basis that they are not a danger to the public while many \"sane\" accused are detained on the basis that they are dangerous. Moreover, the notion of \"significant threat to the safety of the public\" is a \"criminal threat.\" This means that the Review Board must find that the threat posed by the accused is of a criminal nature.\n\nWhile proceedings before a Review Board are less formal than in court, there are many procedural safe-guards available to the accused given the potential indefinite nature of Part XX.1. Any party may appeal against the decision of a Review Board.\n\nIn 1992 when the new mental disorder provisions were enacted, Parliament included \"capping\" provisions which were to be enacted at a later date. These capping provisions limited the jurisdiction of a Review Board over an accused based on the maximum potential sentence had the accused been convicted (e.g. there would be a cap of 5 years if the maximum penalty for the index offence is 5 years). However, these provisions were never proclaimed into force and were subsequently repealed.\n\nA Review Board must hold a hearing every 12 months (unless extended to 24 months) until the accused is discharged absolutely.\n\nAccused unfit to stand trial\n\nThe issue of mental disorder may also come into play before a trial even begins, if the accused's mental state prevents the accused from being able to appreciate the nature of a trial and to conduct a defence.\n\nAn accused who is found to be unfit to stand trial is subject to the jurisdiction a Review Board. While the considerations are essentially the same, there are a few provisions which apply only to unfit accused. A Review Board must determine whether the accused is fit to stand trial. Regardless of the determination, the Review Board must then determine what conditions should be imposed on the accused, considering both the protection of the public and the maintenance of the fitness of the accused (or conditions which would render the accused fit). Previously an absolute discharge was unavailable to an unfit accused. However, in R. v. Demers, the Supreme Court of Canada struck down the provision restricting the availability of an absolute discharge to an accused person who is deemed both \"permanently unfit\" and not a significant threat to the safety of the public. Presently a Review Board may recommend a judicial stay of proceedings in the event that it finds the accused both \"permanently unfit\" and non-dangerous. The decision is left to the court having jurisdiction over the accused.\n\nAn additional requirement for an unfit accused is the holding of a \"prima facie case\" hearing every two years. The Crown must demonstrate to the court having jurisdiction over the accused that it still has sufficient evidence to try the accused. If the Crown fails to meet this burden then the accused is discharged and proceedings are terminated. The nature of the hearing is virtually identical to that of a preliminary hearing.\n\nScottish law\n\nThe Scottish Law Commission, in its Discussion Paper No 122 on Insanity and Diminished Responsibility (2003), pp. 16/18, confirms that the law has not substantially changed from the position stated in Hume's Commentaries:\nWe may next attend to the case of those unfortunate persons, who have plead the miserable defense of idiocy or insanity. Which condition, if it is not an assumed or imperfect, but a genuine and thorough insanity, and is proved by the testimony of intelligent witnesses, makes the act like that of an infant, and equally bestows the privilege of an entire exemption from any manner of pain; Cum alterum innocentia concilii tuetur, alterum fati infelicitas excusat. I say, where the insanity is absolute, and is duly proved: For if reason and humanity enforce the plea in these circumstances, it is no less necessary to observe a caution and reserve in applying the law, as shall hinder it from being understood, that there is any privilege in a case of mere weakness of intellect, or a strange and moody humor, or a crazy and capricious or irritable temper. In none of these situations does or can the law excuse the offender. Because such constitutions are not exclusive of a competent understanding of the true state of the circumstances in which the deed is done, nor of the subsistence of some steady and evil passion, grounded in those circumstances, and directed to a certain object. To serve the purpose of a defense in law, the disorder must therefore amount to an absolute alienation of reason, ut continua mentis alienatione, omni intellectu careat - such a disease as deprives the patient of the knowledge of the true aspect and position of things about him - hinders him from distinguishing friend from foe - and gives him up to the impulse of his own distempered fancy.\nThe phrase \"absolute alienation of reason\" is still regarded as at the core of the defense in the modern law (see HM Advocate v Kidd (1960) JC 61 and Brennan v HM Advocate (1977)\n\nNordic countries\n\nIn the Nordic countries, insanity is not a defense; instead, it is the responsibility of the court system as such to consider whether the accused may have been psychotic or suffering from other severe mental defects when perpetrating the criminal act. This explains why, in Norway, the court considered the sanity of Anders Behring Breivik, even if he himself declared to be sane.\n\nRules differ between Nordic countries.\n\nIn Sweden, psychotic perpetrators are seen as accountable, but the sanction is to forensic mental care.\n\nIn Denmark and Norway, psychotic perpetrators are declared guilty, but not punished. Instead of prison, they are sentenced to mandatory treatment. Still, important differences exist between Norway and Denmark.\n\nIn Norway, §44 of the penal code states specifically that \"a person who at the time of the crime was insane or unconscious is not punished\".\n\nIn Denmark, §16 of the penal code states that \"Persons, who, at the time of the act, were irresponsible owing to mental illness or similar conditions or\nto a pronounced mental deficiency, are not punishable\". This means that in Denmark, 'insanity' is a legal term rather than a medical term and that the court retains the authority to decide whether an accused person is irresponsible or not.\n\nIn Finland, punishments can only be administered if the accused is compos mentis, of sound mind; not if the accused is insane (syyntakeeton, literally \"unable to guarantee [shoulder the responsibility of] guilt\"). Thus, an insane defendant may be found guilty based on the facts and his actions just as a sane defendant, but the insanity will only affect the punishment. The definition of insanity is similar to the M'Naught criterion above: \"the accused is insane, if during the act, due to a mental illness, profound mental retardation or a severe disruption of mental health or consciousness, he cannot understand the actual nature of his act or its illegality, or that his ability to control his behavior is critically weakened\". If an accused is suspected to be insane, the court must consult the National Institute for Health and Welfare (THL), which is obliged to place the accused in involuntary commitment if he is found insane. The offender receives no judicial punishment; he becomes a patient under the jurisdiction of THL, and must be released immediately once the conditions of involuntary commitment are no longer fulfilled. Diminished responsibility is also available, resulting in lighter sentences.\n\nUsage and success rate\n\nThis increased coverage gives the impression that the defense is widely used, but this is not the case. According to an eight-state study, the insanity defense is used in less than 1% of all court cases and, when used, has only a 26% success rate.  Of those cases that were successful, 90% of the defendants had been previously diagnosed with mental illness.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Insanity defense" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15358" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The insanity defense, also known as the mental disorder defense, is a defense by excuse in a criminal case, arguing that the defendant is not responsible for his or her actions due to an episodic or persistent psychiatric disease at the time of the criminal act. This is contrasted with an excuse of provocation, in which defendant is responsible, but the responsibility is lessened due to a temporary mental state.Criminal Law - Cases and Materials, 7th ed. 2012, Wolters Kluwer Law & Business; John Kaplan, Robert Weisberg, Guyora Binder, , [https://law.stanford.edu/publications/criminal-law-cases-and-materials-7th-edition/] It is also contrasted with a finding that a defendant cannot stand trial in a criminal case because a mental disease prevents him or her from effectively assisting counsel, from a civil finding in trusts and estates where a will is nullified because it was made when a mental disorder prevented a testator from recognizing the natural objects of their bounty, and from involuntary civil commitment to a mental institution, when a person is found to be gravely disabled or to be a danger to himself or herself or to others.\n\nExemption from full criminal punishment on such grounds dates back to at least the Code of Hammurabi.Fletcher, G. (1998) Basic Concepts of Criminal Law. NY: Oxford Univ. Press. Legal definitions of insanity or mental disorder are varied, and include the M'Naghten Rule, the Durham rule, the 1953 British Royal Commission on Capital Punishment report, the ALI rule (American Legal Institute Model Penal Code rule), and other provisions, often relating to a lack of mens rea (\"guilty mind\"). In the criminal laws of Australia and Canada, statutory legislation enshrines the M'Naghten Rules, with the terms defense of mental disorder, defense of mental illness or not criminally responsible by reason of mental disorder employed. Being incapable of distinguishing right from wrong is one basis for being found to be legally insane as a criminal defense. It originated in the M'Naghten Rule, and has been reinterpreted and modernized through more recent cases, such as People v. Serravo.\n\nIn the United Kingdom, Ireland, and the United States, use of the defense is rare; however, since the Criminal Procedure (Insanity and Unfitness to Plead) Act 1991, insanity pleas have steadily increased in the UK.RD Mackay, BJ Mitchell, L Howe (2006) 'Yet more facts about the insanity defence' Criminal Law Review 399-411  Mitigating factors, including things not eligible for the insanity defense such as intoxicationAmerican Psychiatric Association: The Insanity Defense: Position Statement. Washington, DC: APA Document Reference No. 820002, 1982 (or, more frequently, diminished capacity), may lead to reduced charges or reduced sentences.\n\nThe defense is based on evaluations by forensic mental health professionals with the appropriate test according to the jurisdiction. Their testimony guides the jury, but they are not allowed to testify to the accused's criminal responsibility, as this is a matter for the jury to decide. Similarly, mental health practitioners are restrained from making a judgment on the issue of whether the defendant is or is not insane or what is known as the \"ultimate issue\".\n\nSome jurisdictions require the evaluation to address the defendant's ability to control their behavior at the time of the offense (the volitional limb). A defendant claiming the defense is pleading \"not guilty by reason of insanity\" (NGRI) or \"guilty but insane or mentally ill\" in some jurisdictions which, if successful, may result in the defendant being committed to a psychiatric facility for an indeterminate period.\n\nMitigating factors and diminished capacity\n\nThe United States Supreme Court (in Penry v. Lynaugh) and the United States Court of Appeals for the Fifth Circuit (in Bigby v. Dretke) have been clear in their decisions that jury instructions in death penalty cases that do not ask about mitigating factors regarding the defendant's mental health violate the defendant's Eighth Amendment rights, saying that the jury is to be instructed to consider mitigating factors when answering unrelated questions. This ruling suggests specific explanations to the jury are necessary to weigh mitigating factors.\n\nDiminished responsibility or diminished capacity can be employed as a mitigating factor or partial defense to crimes and, in the United States, is applicable to more circumstances than the insanity defense. The Homicide Act 1957 is the statutory basis for the defense of diminished responsibility in England and Wales, whereas in Scotland it is a product of case law. The number of findings of diminished responsibility has been matched by a fall in unfitness to plead and insanity findings (Walker, 1968). A plea of diminished capacity is different from a plea of insanity in that \"reason of insanity\" is a full defense while \"diminished capacity\" is merely a plea to a lesser crime.\n\nNon compos mentis\n\nNon compos mentis (Latin) is a legal term meaning \"not of sound mind\". Non compos mentis derives from the Latin non meaning \"not\", compos meaning \"having command\" or \"composed\", and mentis (genitive singular of mens), meaning \"of mind\". It is the direct opposite of Compos mentis (of a sound mind).\n\nAlthough typically used in law, this term can also be used metaphorically or figuratively; e.g. when one is in a confused state, intoxicated, or not of sound mind. The term may be applied when a determination of competency needs to be made by a physician for purposes of obtaining informed consent for treatments and, if necessary, assigning a surrogate to make health care decisions.  While the proper sphere for this determination is in a court of law, this is practically, and most frequently, made by physicians in the clinical setting.[http://content.nejm.org/cgi/content/full/357/18/1834 Assessment of Patients' Competence to Consent to Treatment]\n\nIn English law, the rule of non compos mentis was most commonly used when the defendant invoked religious or magical explanations for behaviour.\n\nWithdrawal or refusal of defense\n\nSeveral cases have ruled that persons found not guilty by reason of insanity may not withdraw the defense in a habeas petition to pursue an alternative, although there have been exceptions in other rulings. In State v. Connelly, 700 A.2d 694 (Conn. App. Ct. 1997), the petitioner who had originally been found not guilty by reason of insanity and committed for ten years to the jurisdiction of a Psychiatric Security Review Board, filed a pro se writ of habeas corpus and the court vacated his insanity acquittal. He was granted a new trial and found guilty of the original charges, receiving a prison sentence of 40 years.\n\nIn the landmark case of Frendak v. United States in 1979, the court ruled that the insanity defense cannot be imposed upon an unwilling defendant if an intelligent defendant voluntarily wishes to forgo the defense.\n\nPsychiatric treatments\n\nThose found to have been not guilty by reason of mental disorder or insanity are generally then required to undergo psychiatric treatment in a mental institution, except in the case of temporary insanity (see below).  In England and Wales, under the Criminal Procedure (Insanity and Unfitness to Plead) Act of 1991 (amended by the Domestic Violence, Crime and Victims Act, 2004 to remove the option of a guardianship order), the court can mandate a hospital order, a restriction order (where release from hospital requires the permission of the Home Secretary), a \"supervision and treatment\" order, or an absolute discharge. Unlike defendants who are found guilty of a crime, they are not institutionalized for a fixed period, but rather held in the institution until they are determined not to be a threat. Authorities making this decision tend to be cautious, and as a result, defendants can often be institutionalized for longer than they would have been incarcerated in prison.Kenber, Billy (4 June 2015) [http://times-deck.s3-eu-west-1.amazonaws.com/projects/2715518c875999308842e3455eda2fe3.html A plea for sanity] The Times, (Raymond Gregory, on the advice of his lawyer, pleaded insanity in 1971 to being asleep drunk on a building site in Washington DC, USA with a pen knife in his pocket. He was kept locked up for 39 years), Retrieved 4 June 2015\n\nIn Foucha v. Louisiana (1992) the Supreme Court of the United States ruled that a person could not be held \"indefinitely\".\n\nSo far, in the United States, those acquitted of a federal offense by reason of insanity have not been able to challenge their psychiatric confinement through a writ of habeas corpus or other remedies. In Archuleta v. Hedrick, 365 F.3d 644 (8th Cir. 2004), the U.S. Court of Appeals for the Eighth Circuit the court ruled persons found not guilty by reason of insanity and later want to challenge their confinement may not attack their initial successful insanity defense:\n\nIncompetency and mental illness\n\nAn important distinction to be made is the difference between competency and criminal responsibility.\n*The issue of competency is whether a defendant is able to adequately assist his attorney in preparing a defense, make informed decisions about trial strategy and whether to plead guilty or accept a plea agreement. This issue is dealt with in UK law as \"fitness to plead\".\n\nCompetency largely deals with the defendant's present condition, while criminal responsibility addresses the condition at the time the crime was committed.\n\nIn the United States, a trial in which the insanity defense is invoked typically involves the testimony of psychiatrists or psychologists who will, as expert witnesses, present opinions on the defendant's state of mind at the time of the offense.\n\nTherefore, a person whose mental disorder is not in dispute is determined to be sane if the court decides that despite a \"mental illness\" the defendant was responsible for the acts committed and will be treated in court as a normal defendant. If the person has a mental illness and it is determined that the mental illness interfered with the person's ability to determine right from wrong (and other associated criteria a jurisdiction may have) and if the person is willing to plead guilty or is proven guilty in a court of law, some jurisdictions have an alternative option known as either a Guilty but Mentally Ill (GBMI) or a Guilty but Insane verdict. The GBMI verdict is available as an alternative to, rather than in lieu of, a \"not guilty by reason of insanity\" verdict. Michigan (1975) was the first state to create a GBMI verdict, after two prisoners released after being found NGRI committed violent crimes within a year of release, one raping two women and the other killing his wife.\n\nTemporary insanity\n\nThe notion of temporary insanity argues that a defendant was insane during the commission of a crime, but they later regained their sanity after the criminal act was carried out. This legal defense is commonly used to defend individuals that have committed crimes of passion.  The defense was first used by U.S. Congressman Daniel Sickles of New York in 1859 after he had killed his wife's lover, Philip Barton Key. The defense was later used commonly during the 1940s and 1950s. Another 19th-century case was that of Charles J. Guiteau, who assassinated President James Garfield in 1881.  Guiteau's Case, 10 F.161 (1882).\n\nHistory\n\nThe concept of defense by insanity has existed since ancient Greece and Rome. However, in colonial America a delusional Dorothy Talbye was hanged in 1638 for murdering her daughter, as at the time Massachusetts's common law made no distinction between insanity (or mental illness) and criminal behavior. Edward II, under English Common law, declared that a person was insane if their mental capacity was no more than that of a \"wild beast\" (in the sense of a dumb animal, rather than being frenzied).  The first complete transcript of an insanity trial dates to 1724. It is likely that the insane, like those under 14, were spared trial by ordeal. When trial by jury replaced this, the jury members were expected to find the insane guilty but then refer the case to the King for a Royal Pardon. From 1500 onwards, juries could acquit the insane, and detention required a separate civil procedure (Walker, 1985). The Criminal Lunatics Act 1800, passed with retrospective effect following the acquittal of James Hadfield, mandated detention at the regent's pleasure (indefinitely) even for those who, although insane at the time of the offence, were now sane.\n\nThe M'Naghten Rules of 1843 were not a codification or definition of insanity but rather the responses of a panel of judges to hypothetical questions posed by Parliament in the wake of Daniel M'Naghten's acquittal for the homicide of Edward Drummond, whom he mistook for British Prime Minister Robert Peel. The rules define the defense as \"at the time of committing the act the party accused was labouring under such a defect of reason, from disease of the mind, as not to know the nature and quality of the act he was doing, or as not to know that what he was doing was wrong.\"  The key is that the defendant could not appreciate the nature of his actions during the commission of the crime. M'Naghten's Case, 8 Eng. Rep. 718 (1843).\n\nIn Ford v. Wainwright 477 U.S. 399 (1986), the US Supreme Court upheld the common law rule that the insane cannot be executed. It further stated that a person under the death penalty is entitled to a competency evaluation and to an evidentiary hearing in court on the question of his competency to be executed.\nIn Wainwright v. Greenfield, the Court ruled that it was fundamentally unfair for the prosecutor to comment during the court proceedings on the petitioner's silence invoked as a result of a Miranda warning. The prosecutor had argued that the respondent's silence after receiving Miranda warnings was evidence of his sanity.\n\nUnited States law\n\nIn the United States, variances in the insanity defense between states, and in the federal court system, are attributable to differences with respect to three key issues:\n#Availability: whether the jurisdiction allows a defendant to raise the insanity defense,\n#Definition: when the defense is available, what facts will support a finding of insanity, and\n#Burden of proof: whether the defendant has the duty of proving insanity or the prosecutor has the duty of disproving insanity, and by what standard of proof.\n\nAvailability\n\nIn the United States, a criminal defendant may plead insanity in federal court, and in the state courts of every state except for Idaho, Kansas, Montana, and Utah. However, defendants in states that disallow the insanity defense may still be able to demonstrate that a defendant was not capable of forming intent to commit a crime as a result of mental illness.\n\nDefinition\n\nEach state and the federal court system currently uses one of the following \"tests\" to define insanity for purposes of the insanity defense. Over its decades of use the definition of insanity has been modified by statute, with changes to the availability of the insanity defense, what constitutes legal insanity whether the prosecutor or defendant has the burden of proof, the standard of proof required at trial, trial procedures, and to commitment and release procedures for defendants who have been acquitted based on a finding of insanity.\n\nM'Naghten test\n\nThe guidelines for the M'Naghten Rules (1843) 10 C & F 200, state, inter alia, and evaluating the criminal responsibility for defendants claiming to be insane were settled in the British courts in the case of Daniel M'Naghten in 1843. M'Naghten was a Scottish woodcutter who killed the secretary to the prime minister, Edward Drummond, in a botched attempt to assassinate the prime minister himself. M'Naghten apparently believed that the prime minister was the architect of the myriad of personal and financial misfortunes that had befallen him. During his trial, nine witnesses testified to the fact that he was insane, and the jury acquitted him, finding him \"not guilty by reason of insanity.\"\n\nThe House of Lords asked the judges of the common law courts to answer five questions on insanity as a criminal defence,Carl Elliott, The rules of insanity: moral responsibility and the mentally ill offender, SUNY Press, 1996, , p.10Michael T. Molan, Mike Molan, Duncan Bloy, Denis Lanser, Modern criminal law (5 ed), Routledge Cavendish, 2003, , p.352 and the formulation that emerged from their review—that a defendant should not be held responsible for his actions only if, as a result of his mental disease or defect, he (i) did not know that his act would be wrong; or (ii) did not understand the nature and quality of his actions—became the basis of the law governing legal responsibility in cases of insanity in England. Under the rules, loss of control because of mental illness was no defense. The M'Naghten rule was embraced with almost no modification by American courts and legislatures for more than 100 years, until the mid-20th century.  M'Naghten's Case, 8 Eng. Rep. 718 (1843).\n\nDurham/New Hampshire test\n\nThe strict M'Naghten standard for the insanity defense was widely used until the 1950s and the case of Durham v. United States case. In the Durham case, the court ruled that a defendant is entitled to acquittal if the crime was the product of his mental illness (i.e., crime would not have been committed but for the disease). The test, also called the Product Test, is broader than either the M'Naghten test or the irresistible impulse test. The test has more lenient guidelines for the insanity defense, but it addressed the issue of convicting mentally ill defendants, which was allowed under the M'Naghten Rule.  M'Naghten's Case, 8 Eng.Rep. 718 (1843). However, the Durham standard drew much criticism because of its expansive definition of legal insanity.\n\nModel Penal Code test\n\nThe Model Penal Code, published by the American Law Institute, provides a standard for legal insanity that serves as a compromise between the strict M'Naghten Rule, the lenient Durham ruling, and the irresistible impulse test. Under the MPC standard, which represents the modern trend, a defendant is not responsible for criminal conduct \"if at the time of such conduct as a result of mental disease or defect he lacks substantial capacity either to appreciate the criminality of his conduct or to conform his conduct to the requirements of the law.\" The test thus takes into account both the cognitive and volitional capacity of insanity.\n\nFederal courts\n\nAfter the perpetrator of President Reagan's assassination attempt was found not guilty by reason of insanity, Congress passed the Insanity Defense Reform Act of 1984.  Under this act, the burden of proof was shifted from the prosecution to the defense and the standard of evidence in federal trials was increased from a preponderance of evidence to clear and convincing evidence.  The ALI test was discarded in favor of a new test that more closely resembled M'Naghten's.  Under this new test only perpetrators suffering from severe mental illnesses at the time of the crime could successfully employ the insanity defense.  The defendant's ability to control himself or herself was no longer a consideration.\n\nThe Act also curbed the scope of expert psychiatric testimony and adopted stricter procedures regarding the hospitalization and release of those found not guilty by reason of insanity.\n\nGuilty but mentally ill\n\nAs an alternative to the insanity defense, some jurisdictions permit a defendant to plead guilty but mentally ill. A defendant who is found guilty but mentally ill may be sentenced to mental health treatment, at the conclusion of which the defendant will serve the remainder of his or her sentence in the same manner as any other defendant.\n\nBurden of proof\n\nIn a majority of states, the burden of proving insanity is placed on the defendant, who must prove insanity by a preponderance of the evidence.\n\nIn a minority of states, the burden is placed on the prosecution, who must prove sanity beyond a reasonable doubt.\n\nIn federal court, and in Arizona, the burden is placed on the defendant, who must prove insanity by clear and convincing evidence.  See 18 U.S.C.S. Sec. 17(b); see also A.R.S. Sec. 13-502(C).\n\nControversy\n\nThe insanity plea is used in the U.S Criminal Justice System in less than 1% of all criminal cases. Little is known about the criminal justice system and the mentally ill:\n\nSome U.S. states have begun to ban the use of the insanity defense, and in 1994 the Supreme Court denied a petition of certiorari seeking review of a Montana Supreme Court case that upheld Montana's abolition of the defense.[https://www.washingtonpost.com/wp-srv/local/longterm/aron/scotus032994.htm Court: Insanity Defense Not a Right] Washington Post, March 29, 1994 Idaho, Kansas, and Utah have also banned the defense. However, a mentally ill defendant/patient can be found unfit to stand trial in these states. In 2001, the Nevada Supreme Court found that their state's abolition of the defense was unconstitutional as a violation of Federal due process.  In 2006, the Supreme Court decided Clark v. Arizona upheld Arizona's limitations on the insanity defense. In that same ruling, the Court noted \"We have never held that the Constitution mandates an insanity defense, nor have we held that the Constitution does not so require.\"\n\nThe insanity defense is also complicated because of the underlying differences in philosophy between psychiatrists/psychologists and legal professionals.  In the United States, a psychiatrist, psychologist or other mental health professional is often consulted as an expert witness in insanity cases, but the ultimate legal judgment of the defendant's sanity is determined by a jury, not by a psychologist.  In other words, psychologists provide testimony and professional opinion but are not ultimately responsible for answering legal questions.\n\nAustralian law\n\nIn Australia there are nine law units. All may have varying rules (see [https://web.archive.org/web/20130412231404/http://www.aija.org.au/ac03/papers/DavidGrace.rtf]). In South Australia, the Criminal Law Consolidation Act 1935 (SA) provides that:\n\n269C—Mental competence\n\nA person is mentally incompetent to commit an offence if, at the time of the conduct alleged to give rise to the offence, the person is suffering from a mental impairment and, in consequence of the mental impairment—\n(a) does not know the nature and quality of the conduct; or\n(b) does not know that the conduct is wrong; or\n(c) is unable to control the conduct.\n269H—Mental unfitness to stand trial\n\nA person is mentally unfit to stand trial on a charge of an offence if the person's mental processes are so disordered or impaired that the person is—\n(a) unable to understand, or to respond rationally to, the charge or the allegations on which the charge is based; or\n(b)  unable to exercise (or to give rational instructions about the exercise of) procedural rights (such as, for example, the right to challenge jurors); or\n(c)  unable to understand the nature of the proceedings, or to follow the evidence or the course of the proceedings.\n\nIn Victoria the current defence of mental impairment was introduced in the Crimes (Mental Impairment and Unfitness to be Tried) Act 1997 which replaced the common law defence of insanity and indefinite detention at the governor's pleasure with the following:\nthe accused was suffering from a mental impairment; and\nthe mental impairment affected the accused so he or she either did not understand the nature and quality of the conduct, or did not know that it was wrong.\nThese requirements are almost identical to the M'Naghten Rules, substituting \"mental impairment\" for \"disease of the mind\".M’Naghten's Case [1843-1860] ALL ER Rep 229; Bratty v Attorney-General for Northern Ireland [1963] UKHL 3 (03 October 1961) [http://www.bailii.org/uk/cases/UKHL/1961/3.html BAILII]\n\nIn New South Wales, the defence has been renamed the 'Defence of Mental Illness' in [http://www.austlii.edu.au/au/legis/nsw/consol_act/mhpa1990355/ Pt4 of the Mental Health (Forensic Provisions) Act 1990]. However, definitions of the defence are derived from M'Naghten's case and have not been codified. Whether a particular condition amounts to a disease of the mind is not a medical but a legal question to be decided in accordance with the ordinary rules of interpretation.R v Falconer (1990) 171 CLR 30 [http://www.austlii.edu.au/au/cases/cth/HCA/1990/49.html AustLII] This defence is an exception to the Woolmington v DPP (1935) Woolmington v DPP [1935] UKHL 1 'golden thread', as the party raising the issue of the defence of mental illness bears the burden of proving this defence on the balance of probabilities See [http://www.austlii.edu.au/au/cases/cth/HCA/1933/1.html R v Porter]. Generally, the defence will raise the issue of insanity. However, the prosecution can raise it in exceptional circumstances: R v Ayoub (1984). R v Ayoub (1984) 2 NSWLR 511\n\nAustralian cases have further qualified and explained the M'Naghten Rules. The NSW Supreme Court in held there are two limbs to the M'Naghten Rules, that the accused did not know what he was doing, or that the accused did not appreciate that what he was doing was morally wrong, in both cases the accused must be operating under a 'defect of reason, from a disease of the mind'.R v Jennings [2005] NSWSC 789 (Kirby J) (11 August 2005) [26] [http://www.austlii.edu.au/cgi-bin/sinodisp/au/cases/nsw/NSWSC/2005/789.html? Austlii]. The High Court in [http://www.austlii.edu.au/au/cases/cth/HCA/1933/1.html R v Porter] stated that the condition of the accused’s mind is relevant only at the time of the actus reus.R v Porter [1933] HCA 1 [http://www.austlii.edu.au/au/cases/cth/HCA/1933/1.html Austlii] In Woodbridge v The Queen the court stated that a symptom indicating a disease of the mind must be prone to recur and be the result of an underlying pathological infirmity.Woodbridge v The Queen (2010) 208 A Crim R 503, 531 (Davies J) A ‘defect of reason’ is the inability to think rationally and pertains to incapacity to reason, rather than having unsound ideas or difficulty with such a task. Examples of disease of the mind include Arteriosclerosis (considered so because the hardening of the arteries affects the mind. See \" See also.R v Cheatham [2000] NSWCCA 282 [http://www.austlii.edu.au/au/cases/nsw/NSWCCA/2000/282.html Austlii]\n\nCanadian law\n\nCriminal Code provisions\n\nThe defence of mental disorder is codified in section 16 of the Criminal Code which states, in part:\n16. (1) No person is criminally responsible for an act committed or an omission made while suffering from a mental disorder that rendered the person incapable of appreciating the nature and quality of the act or omission or of knowing that it was wrong. \n\nTo establish a claim of mental disorder the party raising the issue must show on a balance of probabilities first that the person who committed the act was suffering from a \"disease of the mind\", and second, that at the time of the offence they were either 1) unable to appreciate the \"nature and quality\" of the act, or 2) did not know it was \"wrong\".\n\nThe meaning of the word \"wrong\" was determined in the Supreme Court case of R. v. Chaulk Case citation#Canada|[1990] 3 S.C.R. which held that \"wrong\" was NOT restricted to \"legally wrong\" but to \"morally wrong\" as well.\n\nPost-verdict conditions\n\nThe current legislative scheme was created by the Parliament of Canada after the previous scheme was found unconstitutional by the Supreme Court of Canada in R. v. Swain.  The new provisions also replaced the old insanity defense with the current mental disorder defence.\n\nOnce a person is found not criminally responsible (\"NCR\"), he or she will have a hearing by a Review Board within 45 days (90 days if the court extends the delay). A Review Board is established under Part XX.1 of the Criminal Code and is composed of at least three members, a person who is a judge or eligible to be a judge, a psychiatrist and another expert in a relevant field, such as social work, criminology or psychology. Parties at a Review Board hearing are usually the accused, the Crown and the hospital responsible for the supervision or assessment of the accused. A Review Board is responsible for both accused persons found NCR or accused persons found unfit to stand trial on account of mental disorder. A Review Board dealing with an NCR offender must consider two questions: whether the accused is a \"significant threat to the safety of the public\" and, if so, what the \"least onerous and least restrictive\" restrictions on the liberty of the accused should be in order to mitigate such a threat. Proceedings before a Review Board are inquisitorial rather than adversarial. Often the Review Board will be active in conducting an inquiry. Where the Review Board is unable to conclude that the accused is a significant threat to the safety of the public, the review board must grant the accused an absolute discharge, an order essentially terminating the jurisdiction of the criminal law over the accused. Otherwise the Review Board must order that the accused be either discharged subject to conditions or detained in a hospital, both subject to conditions. The conditions imposed must be the least onerous and least restrictive necessary to mitigate any danger the accused may pose to others.\n\nSince the Review Board is empowered under criminal law powers under s. 91(27) of the Constitution Act, 1867 the sole justification for its jurisdiction is public safety. Therefore, the nature of the inquiry is the danger the accused may pose to the public safety rather than whether the accused is \"cured.\" For instance, many \"sick\" accused persons are discharged absolutely on the basis that they are not a danger to the public while many \"sane\" accused are detained on the basis that they are dangerous. Moreover, the notion of \"significant threat to the safety of the public\" is a \"criminal threat.\" This means that the Review Board must find that the threat posed by the accused is of a criminal nature.\n\nWhile proceedings before a Review Board are less formal than in court, there are many procedural safe-guards available to the accused given the potential indefinite nature of Part XX.1. Any party may appeal against the decision of a Review Board.\n\nIn 1992 when the new mental disorder provisions were enacted, Parliament included \"capping\" provisions which were to be enacted at a later date. These capping provisions limited the jurisdiction of a Review Board over an accused based on the maximum potential sentence had the accused been convicted (e.g. there would be a cap of 5 years if the maximum penalty for the index offence is 5 years). However, these provisions were never proclaimed into force and were subsequently repealed.\n\nA Review Board must hold a hearing every 12 months (unless extended to 24 months) until the accused is discharged absolutely.\n\nAccused unfit to stand trial\n\nThe issue of mental disorder may also come into play before a trial even begins, if the accused's mental state prevents the accused from being able to appreciate the nature of a trial and to conduct a defence.\n\nAn accused who is found to be unfit to stand trial is subject to the jurisdiction a Review Board. While the considerations are essentially the same, there are a few provisions which apply only to unfit accused. A Review Board must determine whether the accused is fit to stand trial. Regardless of the determination, the Review Board must then determine what conditions should be imposed on the accused, considering both the protection of the public and the maintenance of the fitness of the accused (or conditions which would render the accused fit). Previously an absolute discharge was unavailable to an unfit accused. However, in R. v. Demers, the Supreme Court of Canada struck down the provision restricting the availability of an absolute discharge to an accused person who is deemed both \"permanently unfit\" and not a significant threat to the safety of the public. Presently a Review Board may recommend a judicial stay of proceedings in the event that it finds the accused both \"permanently unfit\" and non-dangerous. The decision is left to the court having jurisdiction over the accused.\n\nAn additional requirement for an unfit accused is the holding of a \"prima facie case\" hearing every two years. The Crown must demonstrate to the court having jurisdiction over the accused that it still has sufficient evidence to try the accused. If the Crown fails to meet this burden then the accused is discharged and proceedings are terminated. The nature of the hearing is virtually identical to that of a preliminary hearing.\n\nScottish law\n\nThe Scottish Law Commission, in its Discussion Paper No 122 on Insanity and Diminished Responsibility (2003), pp. 16/18, confirms that the law has not substantially changed from the position stated in Hume's Commentaries:\nWe may next attend to the case of those unfortunate persons, who have plead the miserable defense of idiocy or insanity. Which condition, if it is not an assumed or imperfect, but a genuine and thorough insanity, and is proved by the testimony of intelligent witnesses, makes the act like that of an infant, and equally bestows the privilege of an entire exemption from any manner of pain; Cum alterum innocentia concilii tuetur, alterum fati infelicitas excusat. I say, where the insanity is absolute, and is duly proved: For if reason and humanity enforce the plea in these circumstances, it is no less necessary to observe a caution and reserve in applying the law, as shall hinder it from being understood, that there is any privilege in a case of mere weakness of intellect, or a strange and moody humor, or a crazy and capricious or irritable temper. In none of these situations does or can the law excuse the offender. Because such constitutions are not exclusive of a competent understanding of the true state of the circumstances in which the deed is done, nor of the subsistence of some steady and evil passion, grounded in those circumstances, and directed to a certain object. To serve the purpose of a defense in law, the disorder must therefore amount to an absolute alienation of reason, ut continua mentis alienatione, omni intellectu careat - such a disease as deprives the patient of the knowledge of the true aspect and position of things about him - hinders him from distinguishing friend from foe - and gives him up to the impulse of his own distempered fancy.\nThe phrase \"absolute alienation of reason\" is still regarded as at the core of the defense in the modern law (see HM Advocate v Kidd (1960) JC 61 and Brennan v HM Advocate (1977)\n\nNordic countries\n\nIn the Nordic countries, insanity is not a defense; instead, it is the responsibility of the court system as such to consider whether the accused may have been psychotic or suffering from other severe mental defects when perpetrating the criminal act. This explains why, in Norway, the court considered the sanity of Anders Behring Breivik, even if he himself declared to be sane.\n\nRules differ between Nordic countries.\n\nIn Sweden, psychotic perpetrators are seen as accountable, but the sanction is to forensic mental care.\n\nIn Denmark and Norway, psychotic perpetrators are declared guilty, but not punished. Instead of prison, they are sentenced to mandatory treatment. Still, important differences exist between Norway and Denmark.\n\nIn Norway, §44 of the penal code states specifically that \"a person who at the time of the crime was insane or unconscious is not punished\".\n\nIn Denmark, §16 of the penal code states that \"Persons, who, at the time of the act, were irresponsible owing to mental illness or similar conditions or\nto a pronounced mental deficiency, are not punishable\". This means that in Denmark, 'insanity' is a legal term rather than a medical term and that the court retains the authority to decide whether an accused person is irresponsible or not.\n\nIn Finland, punishments can only be administered if the accused is compos mentis, of sound mind; not if the accused is insane (syyntakeeton, literally \"unable to guarantee [shoulder the responsibility of] guilt\"). Thus, an insane defendant may be found guilty based on the facts and his actions just as a sane defendant, but the insanity will only affect the punishment. The definition of insanity is similar to the M'Naught criterion above: \"the accused is insane, if during the act, due to a mental illness, profound mental retardation or a severe disruption of mental health or consciousness, he cannot understand the actual nature of his act or its illegality, or that his ability to control his behavior is critically weakened\". If an accused is suspected to be insane, the court must consult the National Institute for Health and Welfare (THL), which is obliged to place the accused in involuntary commitment if he is found insane. The offender receives no judicial punishment; he becomes a patient under the jurisdiction of THL, and must be released immediately once the conditions of involuntary commitment are no longer fulfilled. Diminished responsibility is also available, resulting in lighter sentences.\n\nUsage and success rate\n\nThis increased coverage gives the impression that the defense is widely used, but this is not the case. According to an eight-state study, the insanity defense is used in less than 1% of all court cases and, when used, has only a 26% success rate.  Of those cases that were successful, 90% of the defendants had been previously diagnosed with mental illness. Insanity defense. http://en.wikipedia.org/?curid=15358."
  }
}
