{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3332",
  "eid" : "c5083aa0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778410314,
  "textBody" : "Ballroom dance is a set of partner dances, which are enjoyed both socially and competitively around the world. Because of its performance and entertainment aspects, ballroom dance is also widely enjoyed on stage, film, and television.\n\nBallroom dance may refer, at its widest definition, to almost any type of partner dancing as recreation. However, with the emergence of dancesport in modern times, the term has become narrower in scope, and traditionally refers to the five International Standard and five International Latin style dances (see dance categories below). The two styles, while differing in technique, rhythm and costumes, exemplify core elements of ballroom dancing such as control and cohesiveness. Developed in England,Franks A.H. 1963. Social dance: a short history. Routledge & Kegan Paul, London. the two styles are now regulated by the World Dance Council (WDC) and the World DanceSport Federation (WDSF). In the United States, two additional variations are popular: American Smooth and American Rhythm, which combine elements of the Standard and Latin styles with influences from other dance traditions.\n\nThere are also a number of historical dances, and local or national dances, which may be danced in ballrooms or salons. Sequence dancing, in pairs or other formations, is still a popular style of ballroom dance.Silvester, Victor 1980. Old Time and sequence dancing. Barrie and Jenkins, London.\n\nDefinitions and history \n\nThe term 'ballroom dancing' is derived from the word ball which in turn originates from the Latin word ballare which means 'to dance' (a ball-room being a large room specially designed for such dances). In times past, ballroom dancing was social dancing for the privileged, leaving folk dancing for the lower classes. These boundaries have become blurred. The definition of ballroom dance also depends on the era: balls have featured popular dances of the day such as the Minuet, Quadrille, Polonaise, Polka, Mazurka, and others, which are now considered to be historical dances.\n\nEarly Modern Age \n\nThe first authoritative knowledge of the earliest ballroom dances was recorded toward the end of the 16th century, when Jehan Tabourot, under the pen name \"Thoinot-Arbeau\", published in 1588 his Orchésographie, a study of late 16th-century French renaissance social dance. Among the dances described were the solemn basse danse, the livelier branle, pavane, and the galliarde which Shakespeare called the \"cinq pace\" as it was made of five steps.\n\nIn 1650 the Minuet, originally a peasant dance of Poitou, was introduced into Paris and set to music by Jean-Baptiste Lully and danced by the King Louis XIV in public, and would continue to dominate ballroom from that time until the close of the 18th century.\n\nToward the latter half of the 17th century, Louis XIV founded his 'Académie Royale de Musique et de Danse', where specific rules for the execution of every dance and the \"five positions\" of the feet were formulated for the first time by members of the Académie. Eventually, the first definite cleavage between ballet and ballroom came when professional dancers appeared in the ballets, and the ballets left the Court and went to the stage. Ballet technique such as the turned out positions of the feet, however, lingered for over two centuries and past the end of the Victoria era.\n\n19th century\n\nThe waltz with its modern hold took root in England in about 1812; in 1819 Carl Maria von Weber wrote Invitation to the Dance, which marked the adoption of the waltz form into the sphere of absolute music. The dance was initially met with tremendous opposition due to the semblance of impropriety associated with the closed hold, though the stance gradually softened.Silvester, Victor 1993. Modern Ballroom Dancing; rev. ed. London: Stanley Paul. (1st edition: London: H. Jenkins, 1927) In the 1840s several new dances made their appearance in the ballroom, including the Polka, Mazurka, and the Schottische. In the meantime a strong tendency emerged to drop all 'decorative' steps such as entrechats and ronds de jambes that had found a place in the Quadrilles and other dances.\n\nEarly 20th century \n\nModern ballroom dance has its roots early in the 20th century, when several different things happened more or less at the same time. The first was a movement away from the sequence dances towards dances where the couples moved independently. This had been pre-figured by the waltz, which had already made this transition. The second was a wave of popular music, such as jazz. Since dance is to a large extent tied to music, this led to a burst of newly invented dances. There were many dance crazes in the period 1910–1930.\n\nThe third event was a concerted effort to transform some of the dance crazes into dances which could be taught to a wider dance public in the US and Europe. Here Vernon and Irene Castle were important, and so was a generation of English dancers in the 1920s, including Josephine Bradley and Victor Silvester. These professionals analysed, codified, published and taught a number of standard dances. It was essential, if popular dance was to flourish, for dancers to have some basic movements they could confidently perform with any partner they might meet. Here the huge Arthur Murray organisation in America, and the dance societies in England, such as the Imperial Society of Teachers of Dancing, were highly influential. Finally, much of this happened during and after a period of World War, and the effect of such a conflict in dissolving older social customs was considerable.Richardson P.J S. 1948. The history of English ballroom dancing (1900–1945). London: Jenkins\n\nLater, in the 1930s, the on-screen dance pairing of Fred Astaire and Ginger Rogers influenced all forms of dance in the USA and elsewhere. Although both actors had separate careers, their filmed dance sequences together, which included portrayals of the Castles, have reached iconic status. Much of Astaire and Rogers' work portrayed social dancing, although the performances were highly choreographed (often by Astaire or Hermes Pan), and meticulously staged and rehearsed.\n\nCompetitive dancing \n\nCompetitions, sometimes referred to as dancesport, range from world championships, regulated by the World Dance Council (WDC), to less advanced dancers at various proficiency levels. Most competitions are divided into professional and amateur, though in the USA pro-am competitions typically accompany professional competitions.[http://www.unitedstatesdancechampionships.com/ USDC] The International Olympic Committee now recognizes competitive ballroom dance.[http://www.idsf.net/index.tpl?id=30 Certificate of Olympic recognition of WDSF]  It has recognized another body, the World DanceSport Federation (WDSF), as the sole representative body for dancesport in the Olympic Games. However, it seems doubtful that dance will be included in the Olympic Games, especially in light of efforts to reduce the number of participating sports.\n\nBallroom dance competitions are regulated by each country in its own way. There are about 30 countries which compete regularly in international competitions. There are another 20 or so countries which have membership of the WDC and/or the WDSF, but whose dancers rarely appear in international competitions.Complete listings of affiliations are given in the programmes of the major competitions. In Britain there is the British Dance Council, which grants national and regional championship titles, such as the British Ballroom Championships, the British Sequence Championships and the United Kingdom Championships. In the United States, the member branches of the WDC (National Dance Council of America) and the WDSF (USA Dance) both grant national and regional championship titles.http://www.unitedstatesdancechampionships.com/  USDChttp://www.usadancenationals.com/ USA Dance Nationals\n\nBallroom dancing competitions in the former USSR also included the Soviet Ballroom dances, or Soviet Programme. Australian New Vogue is danced both competitively and socially. In competition there are 15 recognised New Vogue dances, which are performed by the competitors in sequence. These dance forms are not recognised internationally, neither are the US variations such as American Smooth, and Rhythm. Such variations in dance and competition methods are attempts to meets perceived needs in the local market-place.\n\nInternationally, the Blackpool Dance Festival, hosted annually at Blackpool, England, is considered the most prestigious event a dancesport competitor can attend.\n\nFormation dance is another style of competitive dance recognised by the IDSF. In this style, multiple dancers (usually in couples and typically up to 16 dancers at one time) compete on the same team, moving in and out of various formations while dancing.\n\nElements of competition \n\nIn competitive ballroom, dancers are judged by diverse criteria such as poise, the hold or frame, posture, musicality and expression, timing, body alignment and shape, floor craft, foot and leg action, and presentation. Judging in a performance-oriented sport is inevitably subjective in nature, and controversy and complaints by competitors over judging placements are not uncommon. The scorekeepers—called scrutineers—will tally the total number recalls accumulated by each couple through each round until the finals, when the Skating system is used to place each couple by ordinals, typically 1–6, though the number of couples in the final may vary. Sometimes, up to 8 couples may be present on the floor during the finals.\n\nCompetitors dance at different levels based on their ability and experience. The levels are split into two categories, syllabus and open. The syllabus levels are newcomer/pre-bronze, bronze, silver, and gold—with gold the highest syllabus level and newcomer the lowest. In these levels, moves are restricted to those written in syllabus, and illegal moves can lead to disqualification. Each level, bronze, silver, and gold, has different moves on their syllabus, increasing in difficulty. There are three levels in the open category; novice, pre-champ, and champ in increasing order of skill. At those levels, dancers no longer have restrictions on their moves, so complex routines are more common.\n\nMedal evaluations \n\nMedal evaluations for amateurs enable dancers' individual abilities to be recognized according to conventional standards. In medal evaluations, which are run by bodies such as the Imperial Society of Teachers of Dancing (ISTD) and the United Kingdom Alliance (UKA), each dancer performs two or more dances in a certain genre in front of a judge. Genres such as Modern Ballroom or Latin are the most popular. Societies such as the ISTD and UKA also offer medal tests on other dance styles (such as Country & Western, Rock 'n Roll or Tap). In some North American examinations, levels include Newcomer, Bronze, Silver, Gold, Novice, Pre-championship, and Championship; each level may be further subdivided into either two or four separate sections.\n\nCollegiate Ballroom \n\nThere is a part of the ballroom world dedicated to college students. These chapters are typically clubs or teams that have an interest in ballroom dancing. Teams hold fundraisers, social events, and ballroom dance lessons. Ballroom dance teams' goals are to have fun and learn to dance well. There is a strong focus on finding a compatible dance partner and bonding with teammates. There is also a competitive side to collegiate ballroom - collegiate teams often hold competitions and invite other teams to participate. These competitions are often run with many of the same rules are regular amateur competitions as outlined above, but are usually organized entirely by collegiate teams. Examples include the MIT Open Ballroom Dance Competition, Purdue Ballroom Classic and the Harvard Invitational.\n\nDances \n\n\"Ballroom dance\" refers most often to the ten dances of International Ballroom (or Standard) and International Latin, though the term is also often used interchangeably with the five International Ballroom dances.. Sequence dancing, which is danced predominantly in the United Kingdom, and its development New Vogue in Australia and New Zealand, are also sometimes included as a type of Ballroom dancing.\n\nIn the United States and Canada, the American Style (American Smooth and American Rhythm) also exists. The dance technique used for both International and American styles is similar, but International Ballroom allows only closed dance positions, whereas American Smooth allows closed, open and separated dance movements. In addition, different sets of dance figures are usually taught for the two styles. International Latin and American Rhythm have different styling, and have different dance figures in their respective syllabi.\n\nOther dances sometimes placed under the umbrella \"ballroom dance\" include Nightclub Dances such as Lindy Hop, West Coast Swing, Nightclub Two Step, Hustle, Salsa, and Merengue.\nThe categorization of dances as \"ballroom dances\" has always been fluid, with new dances or folk dances being added to or removed from the ballroom repertoire from time to time, so no list of subcategories or dances is any more than a description of current practices. There are other dances historically accepted as ballroom dances, and are revived via the Vintage dance movement.\n\nIn Europe, Latin Swing dances include Argentine Tango, Mambo, Lindy Hop, Swing Boogie (sometimes also known as Nostalgic Boogie), and Disco Fox. One example of this is the subcategory of Cajun dances that originated in Acadiana, with branches reaching both coasts of the United States.\n\nBallroom/Smooth dances are normally danced to Western music (often from the mid-twentieth century), and couples dance counter-clockwise around a rectangular floor following the line of dance. In competitions, competitors are costumed as would be appropriate for a white tie affair, with full gowns for the ladies and bow tie and tail coats for the men; though in American Smooth it is now conventional for the men to abandon the tailsuit in favor of shorter tuxedos, vests, and other creative outfits.\n\nLatin/Rhythm dances are commonly danced to contemporary Latin American music and (in case of Jive) Western music. With the exception of a few traveling dances like Samba and Paso Doble, couples do not follow the line of dance but perform their routines more or less in one spot. In competitions, the women are often dressed in short-skirted Latin outfits while the men are outfitted in tight-fitting shirts and pants, the goal being to emphasize the dancers' leg action and body movements.\n\nCompetitive dances \n\nStandard/Smooth\n\nWaltz \n\nWaltz began as a country folk dance in Austria and Bavaria in the 1600s. In the early 1800s it was introduced in England. It was the first dance where a man held a woman close to his body. When performing the dance the upper body is kept to the left throughout all figures, woman's body leaves the right side of the man while the head is extended to follow the elbow. Figures with rotation have little rise. Sway is also used on the second step to make the step longer and also to slow down the momentum by bringing feet together. Waltz is performed for both International Standard and American Smooth.\n\nViennese Waltz \n\nViennese waltz originated in Provence area in France in 1559, and is recognized as the oldest of all ballroom dances. It was introduced in England as German waltz in 1812 and became popular throughout the 19th century by the music of Josef and Johann Strauss. It is often referred to as the classic “old-school” ballroom.Viennese Waltz music is quite fast. Slight shaping of the body moves towards the inside of the turn and shaping forward and up to lengthen the opposite side from direction. Reverse turn is used to travel down long side and is overturned. While natural turn is used to travel short side and is underturned to go around the corners. Viennese waltz is performed for both International Standard and American Smooth.\n\nTango \n\nTango originated in Buenos Aires in the late 1800s. Modern Argentine tango is danced in both open and closed embraces which focuses on the male leader and the women moving in harmony of the tango’s passionate charging music. The tango’s technique is like walking to the music while keeping feet grounded and allowing ankles and knees to brush against one another during each step taken. Body weight is kept over the toes and the connection is held between the man and women in the hips.\n\nBallroom tango, however, is a dance with a far more open frame, often utilising strong and staccato movements. It is ballroom tango, rather than Argentine tango that is performed in international competition.\n\nFoxtrot \n\nThe foxtrot is a true American dance, credited by a vaudeville performer Harry Fox in 1914. Fox was rapidly trotting step to ragtime music ( an original form of jazz). The dance was originally named as the “Fox’s trot”.The foxtrot can be danced at slow, medium, or fast tempos depending on the speed of the jazz or big band music. The partners are facing one another and frame rotates from one side to another, changing direction after a measure. The dance is flat, with no rise and fall like the waltz. The walking steps are taken as slow for the two beats per steps and quick for one beat per step. Foxtrot is performed for both International Standard and American Smooth.\n\nQuick step \n\nThe quickstep is an English dance and was invented in the 1920s as a combination of faster tempo of foxtrot and the Charleston. It is a fast moving dance so men are allowed to close their feet and the couples move in short syncopated steps. Quick step includes the walks, runs, chasses and turns, of the original foxtrot dance, with some other fast figures such as locks, hops, and skips can be added. Quick step is performed as an International Standard dance.\n\nLatin/Rhythm\n\nSamba \n\nSamba is the national dance of Brazil. The rhythm of samba and its name originated from West African slaves. In 1905, samba became known to the rest of the countries during an exhibition in Paris. Eventually in 1940s, samba was introduced in America due to a movie star named Carmen Miranda. The modern ballroom samba dance differs compared to the traditional Brazilian samba as it was modified as a partner dance. Samba is danced with a slight bounce which is created through the bending and straightening the knee. Samba is performed as an International Latin dance.\n\nCha-Cha \n\nThe cha-cha was originally called the “cha-cha-cha.” The term came from Haiti and resembled the sound the bells made when rubbed. It was evolved from the rumba and mambo in the 1950s. Since mambo music was quite fast and difficult for some to dance to, a Cuban composer Enrique Jorrin slowed the music down and cha-cha was established.Cha-cha is a very flirtatious dance with many hip rotations and partners synchronizing their movements. The dance includes bending and straightening of the knee giving it a touch of Cuban motion. Cha-cha is performed for both International Latin and American Rhythm.\n\nRumba \n\nRumba is known to be the most romantic and passionate of all dances. In the early 1920s, the dance came to the United States from Cuba and became a popular cabaret dance during prohibition. Rumba is very polyrhythmic and complex. It includes Cuban motions through knee-strengthening, figure- eight hip rotation and swiveling foot action. An important characteristic of rumba is the powerful and direct lead achieved through the ball of the foot. Rumba is performed for both International Latin and American Rhythm.\n\nPaso doble \n\nThe paso doble originated from Spain and its dramatic bullfights. The dance is mostly performed only in competitions and rarely socially due to many choreographic rules. The man plays the role of the matador while the women take the role of the matador’s cape, the bull, or even the matador too. The chassez cape refers to the man using the woman to turn her as if she is the cape and the apel is when man stomps his foot to get the bull's attention. Paso double is performed as an International Latin dance.\n\nJive \n\nThe jive is part of the swing dance group and is a very lively variation of the jitterbug. Jive originated from African American clubs in the early 1940s. During World War II, American soldiers introduced the jive in England where it was adapted to today's competitive jive. In jive, the male leads the dance while the women encourage the men to ask them to dance. It is danced to big band music and some technique is taken from salsa, swing and tango. Jive is performed as an International Latin dance.\n\nEast Coast swing \n\nSwing in 1927 was originally named the Lindy Hop named by Shorty George Snowden. There have been 40 different versions documented over the years, most common is the East Coast swing which is performed in the American Smooth (or American Rhythm) only in the U.S. or Canada. The East Coast swing was established by Arthur Murray and others only shortly after World War II.Swing music is very lively and upbeat and can be danced to jazz or big band music. The swing dancing is a style with lots of bounce and energy. Swing also includes many spins and underarm turns. East Coast swing is performed as an American Rhythm dance.\n\nBolero \n\nThe original version of bolero was created by Sebastian Cerezo in Cadiz, Spain during the 18th century. However, the bolero performed now was modified in Cuba a century later. The dance represents the couple falling in love. Bolero is a combination of many dances and is danced to Spanish vocals with fine percussion beat. It is like a slow salsa with contra-body moment of tango, patterns of rumba and rise and fall technique and personality of waltz and foxtrot. Bolero can be dance in a close hold or singly and then coming back together. Bolero is performed as an American Rhythm dance.\n\nMambo \n\nMambo originated from Cuba but the name came from Haiti. Mambo music was first written in late 1930s by a Cuban composer. Eventually in the late 1940s, a musician named Perez Prado invented the dance mambo. Perez introduced the dance from Havana to Mexico, and making its way up to New York. Mambo is performed as an American Rhythm dance.\n\nDance style classification \n\n International Style competition dances \n\nAccording to World Dance Council.\n\nStandard\n\nWaltz:\n28 bars per minute, 3/4 time, also known as Slow Waltz or English Waltz depending on locality\n\nTango:\n32 bars per minute, 2/4 time\n\nViennese Waltz:\n60 bars per minute, 3/4 time.\nOn the European continent, the Viennese waltz is known simply as waltz, while the waltz is recognized as English waltz or Slow Waltz.\n\nFoxtrot:\n28 bars per minute, 4/4 time\n\nQuickstep:\n50 bars per minute, 4/4 time\n\nLatin\n\nSamba:\n48 bars per minute, 4/4 time\n\nCha-cha-cha:\n30 bars per minute, 4/4 time\n\nRumba:\n24 bars per minute, 4/4 time\n\nPaso Doble:\n56 bars per minute, 2/4 time\n\nJive:\n42 bars per minute, 4/4 time\n\nAmerican Style competition dances (only in the U.S. & Canada) \n\nSmooth\n\nWaltz:\n28–30 bars per minute\n30–32 bars per minute for Bronze\n\nTango:\n30 bars per minute\n30–32 bars per minute for Bronze\n\nFoxtrot:\n30 bars per minute\n32–34 bars per minute for Bronze\n\nViennese Waltz:\n53–54 bars per minute\n54 bars per minute for Bronze\n\nRhythm\n\nCha Cha:\n30 bars per minute\n\nRumba:\n30–32 bars per minute\n32–36 bars per minute for Bronze\n\nEast Coast Swing:\n36 bars per minute\n34–36 bars per minute for Bronze\n\nBolero:\n24 bars per minute\n24–26 bars per minute for Bronze\n\nMambo:\n47 bars per minute\n48–51 bars per minute for Bronze\n\nOthers \n\nHistorical/Vintage Ballroom dance:\nWaltz – Polka – Schottische – Tango – One-Step – Foxtrot – Peabody\n\nOther dances occasionally categorized as ballroom:\n\nNightclub\nNightclub Two-step – Hustle – Modern Jive / LeRoc / Ceroc – and the whole swing variety: West Coast Swing / East Coast Swing/ Lindy Hop (always included in the \"Rhythm-Swing\" category) / Carolina Shag / Collegiate Shag / Balboa / Blues – Fusion\n\nLatin nightclub\nSalsa – Cumbia – Mambo – Merengue – Porro – Cha cha – Bachata\n\nAfrican nightclub\nKizomba – Semba – Zouk\n\nBrazilian Dances\nForró – Pagode – Samba de Gafieira – Lambada - Zouk\n\nCountry/Western\nC/W Polka – C/W Cha-cha – C/W Two-step – C/W Waltz\n\nCajun dances\nCajun One Step or Cajun Jig – Cajun Two Step – Zydeco – Cajun Waltz – Cajun Jitterbug\n\nMusette dances\nJava – musette-waltz – musette-tango – musette-paso-doble\n\nOther\nArgentine tango – New Vogue",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ballroom dance" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3332" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ballroom dance is a set of partner dances, which are enjoyed both socially and competitively around the world. Because of its performance and entertainment aspects, ballroom dance is also widely enjoyed on stage, film, and television.\n\nBallroom dance may refer, at its widest definition, to almost any type of partner dancing as recreation. However, with the emergence of dancesport in modern times, the term has become narrower in scope, and traditionally refers to the five International Standard and five International Latin style dances (see dance categories below). The two styles, while differing in technique, rhythm and costumes, exemplify core elements of ballroom dancing such as control and cohesiveness. Developed in England,Franks A.H. 1963. Social dance: a short history. Routledge & Kegan Paul, London. the two styles are now regulated by the World Dance Council (WDC) and the World DanceSport Federation (WDSF). In the United States, two additional variations are popular: American Smooth and American Rhythm, which combine elements of the Standard and Latin styles with influences from other dance traditions.\n\nThere are also a number of historical dances, and local or national dances, which may be danced in ballrooms or salons. Sequence dancing, in pairs or other formations, is still a popular style of ballroom dance.Silvester, Victor 1980. Old Time and sequence dancing. Barrie and Jenkins, London.\n\nDefinitions and history \n\nThe term 'ballroom dancing' is derived from the word ball which in turn originates from the Latin word ballare which means 'to dance' (a ball-room being a large room specially designed for such dances). In times past, ballroom dancing was social dancing for the privileged, leaving folk dancing for the lower classes. These boundaries have become blurred. The definition of ballroom dance also depends on the era: balls have featured popular dances of the day such as the Minuet, Quadrille, Polonaise, Polka, Mazurka, and others, which are now considered to be historical dances.\n\nEarly Modern Age \n\nThe first authoritative knowledge of the earliest ballroom dances was recorded toward the end of the 16th century, when Jehan Tabourot, under the pen name \"Thoinot-Arbeau\", published in 1588 his Orchésographie, a study of late 16th-century French renaissance social dance. Among the dances described were the solemn basse danse, the livelier branle, pavane, and the galliarde which Shakespeare called the \"cinq pace\" as it was made of five steps.\n\nIn 1650 the Minuet, originally a peasant dance of Poitou, was introduced into Paris and set to music by Jean-Baptiste Lully and danced by the King Louis XIV in public, and would continue to dominate ballroom from that time until the close of the 18th century.\n\nToward the latter half of the 17th century, Louis XIV founded his 'Académie Royale de Musique et de Danse', where specific rules for the execution of every dance and the \"five positions\" of the feet were formulated for the first time by members of the Académie. Eventually, the first definite cleavage between ballet and ballroom came when professional dancers appeared in the ballets, and the ballets left the Court and went to the stage. Ballet technique such as the turned out positions of the feet, however, lingered for over two centuries and past the end of the Victoria era.\n\n19th century\n\nThe waltz with its modern hold took root in England in about 1812; in 1819 Carl Maria von Weber wrote Invitation to the Dance, which marked the adoption of the waltz form into the sphere of absolute music. The dance was initially met with tremendous opposition due to the semblance of impropriety associated with the closed hold, though the stance gradually softened.Silvester, Victor 1993. Modern Ballroom Dancing; rev. ed. London: Stanley Paul. (1st edition: London: H. Jenkins, 1927) In the 1840s several new dances made their appearance in the ballroom, including the Polka, Mazurka, and the Schottische. In the meantime a strong tendency emerged to drop all 'decorative' steps such as entrechats and ronds de jambes that had found a place in the Quadrilles and other dances.\n\nEarly 20th century \n\nModern ballroom dance has its roots early in the 20th century, when several different things happened more or less at the same time. The first was a movement away from the sequence dances towards dances where the couples moved independently. This had been pre-figured by the waltz, which had already made this transition. The second was a wave of popular music, such as jazz. Since dance is to a large extent tied to music, this led to a burst of newly invented dances. There were many dance crazes in the period 1910–1930.\n\nThe third event was a concerted effort to transform some of the dance crazes into dances which could be taught to a wider dance public in the US and Europe. Here Vernon and Irene Castle were important, and so was a generation of English dancers in the 1920s, including Josephine Bradley and Victor Silvester. These professionals analysed, codified, published and taught a number of standard dances. It was essential, if popular dance was to flourish, for dancers to have some basic movements they could confidently perform with any partner they might meet. Here the huge Arthur Murray organisation in America, and the dance societies in England, such as the Imperial Society of Teachers of Dancing, were highly influential. Finally, much of this happened during and after a period of World War, and the effect of such a conflict in dissolving older social customs was considerable.Richardson P.J S. 1948. The history of English ballroom dancing (1900–1945). London: Jenkins\n\nLater, in the 1930s, the on-screen dance pairing of Fred Astaire and Ginger Rogers influenced all forms of dance in the USA and elsewhere. Although both actors had separate careers, their filmed dance sequences together, which included portrayals of the Castles, have reached iconic status. Much of Astaire and Rogers' work portrayed social dancing, although the performances were highly choreographed (often by Astaire or Hermes Pan), and meticulously staged and rehearsed.\n\nCompetitive dancing \n\nCompetitions, sometimes referred to as dancesport, range from world championships, regulated by the World Dance Council (WDC), to less advanced dancers at various proficiency levels. Most competitions are divided into professional and amateur, though in the USA pro-am competitions typically accompany professional competitions.[http://www.unitedstatesdancechampionships.com/ USDC] The International Olympic Committee now recognizes competitive ballroom dance.[http://www.idsf.net/index.tpl?id=30 Certificate of Olympic recognition of WDSF]  It has recognized another body, the World DanceSport Federation (WDSF), as the sole representative body for dancesport in the Olympic Games. However, it seems doubtful that dance will be included in the Olympic Games, especially in light of efforts to reduce the number of participating sports.\n\nBallroom dance competitions are regulated by each country in its own way. There are about 30 countries which compete regularly in international competitions. There are another 20 or so countries which have membership of the WDC and/or the WDSF, but whose dancers rarely appear in international competitions.Complete listings of affiliations are given in the programmes of the major competitions. In Britain there is the British Dance Council, which grants national and regional championship titles, such as the British Ballroom Championships, the British Sequence Championships and the United Kingdom Championships. In the United States, the member branches of the WDC (National Dance Council of America) and the WDSF (USA Dance) both grant national and regional championship titles.http://www.unitedstatesdancechampionships.com/  USDChttp://www.usadancenationals.com/ USA Dance Nationals\n\nBallroom dancing competitions in the former USSR also included the Soviet Ballroom dances, or Soviet Programme. Australian New Vogue is danced both competitively and socially. In competition there are 15 recognised New Vogue dances, which are performed by the competitors in sequence. These dance forms are not recognised internationally, neither are the US variations such as American Smooth, and Rhythm. Such variations in dance and competition methods are attempts to meets perceived needs in the local market-place.\n\nInternationally, the Blackpool Dance Festival, hosted annually at Blackpool, England, is considered the most prestigious event a dancesport competitor can attend.\n\nFormation dance is another style of competitive dance recognised by the IDSF. In this style, multiple dancers (usually in couples and typically up to 16 dancers at one time) compete on the same team, moving in and out of various formations while dancing.\n\nElements of competition \n\nIn competitive ballroom, dancers are judged by diverse criteria such as poise, the hold or frame, posture, musicality and expression, timing, body alignment and shape, floor craft, foot and leg action, and presentation. Judging in a performance-oriented sport is inevitably subjective in nature, and controversy and complaints by competitors over judging placements are not uncommon. The scorekeepers—called scrutineers—will tally the total number recalls accumulated by each couple through each round until the finals, when the Skating system is used to place each couple by ordinals, typically 1–6, though the number of couples in the final may vary. Sometimes, up to 8 couples may be present on the floor during the finals.\n\nCompetitors dance at different levels based on their ability and experience. The levels are split into two categories, syllabus and open. The syllabus levels are newcomer/pre-bronze, bronze, silver, and gold—with gold the highest syllabus level and newcomer the lowest. In these levels, moves are restricted to those written in syllabus, and illegal moves can lead to disqualification. Each level, bronze, silver, and gold, has different moves on their syllabus, increasing in difficulty. There are three levels in the open category; novice, pre-champ, and champ in increasing order of skill. At those levels, dancers no longer have restrictions on their moves, so complex routines are more common.\n\nMedal evaluations \n\nMedal evaluations for amateurs enable dancers' individual abilities to be recognized according to conventional standards. In medal evaluations, which are run by bodies such as the Imperial Society of Teachers of Dancing (ISTD) and the United Kingdom Alliance (UKA), each dancer performs two or more dances in a certain genre in front of a judge. Genres such as Modern Ballroom or Latin are the most popular. Societies such as the ISTD and UKA also offer medal tests on other dance styles (such as Country & Western, Rock 'n Roll or Tap). In some North American examinations, levels include Newcomer, Bronze, Silver, Gold, Novice, Pre-championship, and Championship; each level may be further subdivided into either two or four separate sections.\n\nCollegiate Ballroom \n\nThere is a part of the ballroom world dedicated to college students. These chapters are typically clubs or teams that have an interest in ballroom dancing. Teams hold fundraisers, social events, and ballroom dance lessons. Ballroom dance teams' goals are to have fun and learn to dance well. There is a strong focus on finding a compatible dance partner and bonding with teammates. There is also a competitive side to collegiate ballroom - collegiate teams often hold competitions and invite other teams to participate. These competitions are often run with many of the same rules are regular amateur competitions as outlined above, but are usually organized entirely by collegiate teams. Examples include the MIT Open Ballroom Dance Competition, Purdue Ballroom Classic and the Harvard Invitational.\n\nDances \n\n\"Ballroom dance\" refers most often to the ten dances of International Ballroom (or Standard) and International Latin, though the term is also often used interchangeably with the five International Ballroom dances.. Sequence dancing, which is danced predominantly in the United Kingdom, and its development New Vogue in Australia and New Zealand, are also sometimes included as a type of Ballroom dancing.\n\nIn the United States and Canada, the American Style (American Smooth and American Rhythm) also exists. The dance technique used for both International and American styles is similar, but International Ballroom allows only closed dance positions, whereas American Smooth allows closed, open and separated dance movements. In addition, different sets of dance figures are usually taught for the two styles. International Latin and American Rhythm have different styling, and have different dance figures in their respective syllabi.\n\nOther dances sometimes placed under the umbrella \"ballroom dance\" include Nightclub Dances such as Lindy Hop, West Coast Swing, Nightclub Two Step, Hustle, Salsa, and Merengue.\nThe categorization of dances as \"ballroom dances\" has always been fluid, with new dances or folk dances being added to or removed from the ballroom repertoire from time to time, so no list of subcategories or dances is any more than a description of current practices. There are other dances historically accepted as ballroom dances, and are revived via the Vintage dance movement.\n\nIn Europe, Latin Swing dances include Argentine Tango, Mambo, Lindy Hop, Swing Boogie (sometimes also known as Nostalgic Boogie), and Disco Fox. One example of this is the subcategory of Cajun dances that originated in Acadiana, with branches reaching both coasts of the United States.\n\nBallroom/Smooth dances are normally danced to Western music (often from the mid-twentieth century), and couples dance counter-clockwise around a rectangular floor following the line of dance. In competitions, competitors are costumed as would be appropriate for a white tie affair, with full gowns for the ladies and bow tie and tail coats for the men; though in American Smooth it is now conventional for the men to abandon the tailsuit in favor of shorter tuxedos, vests, and other creative outfits.\n\nLatin/Rhythm dances are commonly danced to contemporary Latin American music and (in case of Jive) Western music. With the exception of a few traveling dances like Samba and Paso Doble, couples do not follow the line of dance but perform their routines more or less in one spot. In competitions, the women are often dressed in short-skirted Latin outfits while the men are outfitted in tight-fitting shirts and pants, the goal being to emphasize the dancers' leg action and body movements.\n\nCompetitive dances \n\nStandard/Smooth\n\nWaltz \n\nWaltz began as a country folk dance in Austria and Bavaria in the 1600s. In the early 1800s it was introduced in England. It was the first dance where a man held a woman close to his body. When performing the dance the upper body is kept to the left throughout all figures, woman's body leaves the right side of the man while the head is extended to follow the elbow. Figures with rotation have little rise. Sway is also used on the second step to make the step longer and also to slow down the momentum by bringing feet together. Waltz is performed for both International Standard and American Smooth.\n\nViennese Waltz \n\nViennese waltz originated in Provence area in France in 1559, and is recognized as the oldest of all ballroom dances. It was introduced in England as German waltz in 1812 and became popular throughout the 19th century by the music of Josef and Johann Strauss. It is often referred to as the classic “old-school” ballroom.Viennese Waltz music is quite fast. Slight shaping of the body moves towards the inside of the turn and shaping forward and up to lengthen the opposite side from direction. Reverse turn is used to travel down long side and is overturned. While natural turn is used to travel short side and is underturned to go around the corners. Viennese waltz is performed for both International Standard and American Smooth.\n\nTango \n\nTango originated in Buenos Aires in the late 1800s. Modern Argentine tango is danced in both open and closed embraces which focuses on the male leader and the women moving in harmony of the tango’s passionate charging music. The tango’s technique is like walking to the music while keeping feet grounded and allowing ankles and knees to brush against one another during each step taken. Body weight is kept over the toes and the connection is held between the man and women in the hips.\n\nBallroom tango, however, is a dance with a far more open frame, often utilising strong and staccato movements. It is ballroom tango, rather than Argentine tango that is performed in international competition.\n\nFoxtrot \n\nThe foxtrot is a true American dance, credited by a vaudeville performer Harry Fox in 1914. Fox was rapidly trotting step to ragtime music ( an original form of jazz). The dance was originally named as the “Fox’s trot”.The foxtrot can be danced at slow, medium, or fast tempos depending on the speed of the jazz or big band music. The partners are facing one another and frame rotates from one side to another, changing direction after a measure. The dance is flat, with no rise and fall like the waltz. The walking steps are taken as slow for the two beats per steps and quick for one beat per step. Foxtrot is performed for both International Standard and American Smooth.\n\nQuick step \n\nThe quickstep is an English dance and was invented in the 1920s as a combination of faster tempo of foxtrot and the Charleston. It is a fast moving dance so men are allowed to close their feet and the couples move in short syncopated steps. Quick step includes the walks, runs, chasses and turns, of the original foxtrot dance, with some other fast figures such as locks, hops, and skips can be added. Quick step is performed as an International Standard dance.\n\nLatin/Rhythm\n\nSamba \n\nSamba is the national dance of Brazil. The rhythm of samba and its name originated from West African slaves. In 1905, samba became known to the rest of the countries during an exhibition in Paris. Eventually in 1940s, samba was introduced in America due to a movie star named Carmen Miranda. The modern ballroom samba dance differs compared to the traditional Brazilian samba as it was modified as a partner dance. Samba is danced with a slight bounce which is created through the bending and straightening the knee. Samba is performed as an International Latin dance.\n\nCha-Cha \n\nThe cha-cha was originally called the “cha-cha-cha.” The term came from Haiti and resembled the sound the bells made when rubbed. It was evolved from the rumba and mambo in the 1950s. Since mambo music was quite fast and difficult for some to dance to, a Cuban composer Enrique Jorrin slowed the music down and cha-cha was established.Cha-cha is a very flirtatious dance with many hip rotations and partners synchronizing their movements. The dance includes bending and straightening of the knee giving it a touch of Cuban motion. Cha-cha is performed for both International Latin and American Rhythm.\n\nRumba \n\nRumba is known to be the most romantic and passionate of all dances. In the early 1920s, the dance came to the United States from Cuba and became a popular cabaret dance during prohibition. Rumba is very polyrhythmic and complex. It includes Cuban motions through knee-strengthening, figure- eight hip rotation and swiveling foot action. An important characteristic of rumba is the powerful and direct lead achieved through the ball of the foot. Rumba is performed for both International Latin and American Rhythm.\n\nPaso doble \n\nThe paso doble originated from Spain and its dramatic bullfights. The dance is mostly performed only in competitions and rarely socially due to many choreographic rules. The man plays the role of the matador while the women take the role of the matador’s cape, the bull, or even the matador too. The chassez cape refers to the man using the woman to turn her as if she is the cape and the apel is when man stomps his foot to get the bull's attention. Paso double is performed as an International Latin dance.\n\nJive \n\nThe jive is part of the swing dance group and is a very lively variation of the jitterbug. Jive originated from African American clubs in the early 1940s. During World War II, American soldiers introduced the jive in England where it was adapted to today's competitive jive. In jive, the male leads the dance while the women encourage the men to ask them to dance. It is danced to big band music and some technique is taken from salsa, swing and tango. Jive is performed as an International Latin dance.\n\nEast Coast swing \n\nSwing in 1927 was originally named the Lindy Hop named by Shorty George Snowden. There have been 40 different versions documented over the years, most common is the East Coast swing which is performed in the American Smooth (or American Rhythm) only in the U.S. or Canada. The East Coast swing was established by Arthur Murray and others only shortly after World War II.Swing music is very lively and upbeat and can be danced to jazz or big band music. The swing dancing is a style with lots of bounce and energy. Swing also includes many spins and underarm turns. East Coast swing is performed as an American Rhythm dance.\n\nBolero \n\nThe original version of bolero was created by Sebastian Cerezo in Cadiz, Spain during the 18th century. However, the bolero performed now was modified in Cuba a century later. The dance represents the couple falling in love. Bolero is a combination of many dances and is danced to Spanish vocals with fine percussion beat. It is like a slow salsa with contra-body moment of tango, patterns of rumba and rise and fall technique and personality of waltz and foxtrot. Bolero can be dance in a close hold or singly and then coming back together. Bolero is performed as an American Rhythm dance.\n\nMambo \n\nMambo originated from Cuba but the name came from Haiti. Mambo music was first written in late 1930s by a Cuban composer. Eventually in the late 1940s, a musician named Perez Prado invented the dance mambo. Perez introduced the dance from Havana to Mexico, and making its way up to New York. Mambo is performed as an American Rhythm dance.\n\nDance style classification \n\n International Style competition dances \n\nAccording to World Dance Council.\n\nStandard\n\nWaltz:\n28 bars per minute, 3/4 time, also known as Slow Waltz or English Waltz depending on locality\n\nTango:\n32 bars per minute, 2/4 time\n\nViennese Waltz:\n60 bars per minute, 3/4 time.\nOn the European continent, the Viennese waltz is known simply as waltz, while the waltz is recognized as English waltz or Slow Waltz.\n\nFoxtrot:\n28 bars per minute, 4/4 time\n\nQuickstep:\n50 bars per minute, 4/4 time\n\nLatin\n\nSamba:\n48 bars per minute, 4/4 time\n\nCha-cha-cha:\n30 bars per minute, 4/4 time\n\nRumba:\n24 bars per minute, 4/4 time\n\nPaso Doble:\n56 bars per minute, 2/4 time\n\nJive:\n42 bars per minute, 4/4 time\n\nAmerican Style competition dances (only in the U.S. & Canada) \n\nSmooth\n\nWaltz:\n28–30 bars per minute\n30–32 bars per minute for Bronze\n\nTango:\n30 bars per minute\n30–32 bars per minute for Bronze\n\nFoxtrot:\n30 bars per minute\n32–34 bars per minute for Bronze\n\nViennese Waltz:\n53–54 bars per minute\n54 bars per minute for Bronze\n\nRhythm\n\nCha Cha:\n30 bars per minute\n\nRumba:\n30–32 bars per minute\n32–36 bars per minute for Bronze\n\nEast Coast Swing:\n36 bars per minute\n34–36 bars per minute for Bronze\n\nBolero:\n24 bars per minute\n24–26 bars per minute for Bronze\n\nMambo:\n47 bars per minute\n48–51 bars per minute for Bronze\n\nOthers \n\nHistorical/Vintage Ballroom dance:\nWaltz – Polka – Schottische – Tango – One-Step – Foxtrot – Peabody\n\nOther dances occasionally categorized as ballroom:\n\nNightclub\nNightclub Two-step – Hustle – Modern Jive / LeRoc / Ceroc – and the whole swing variety: West Coast Swing / East Coast Swing/ Lindy Hop (always included in the \"Rhythm-Swing\" category) / Carolina Shag / Collegiate Shag / Balboa / Blues – Fusion\n\nLatin nightclub\nSalsa – Cumbia – Mambo – Merengue – Porro – Cha cha – Bachata\n\nAfrican nightclub\nKizomba – Semba – Zouk\n\nBrazilian Dances\nForró – Pagode – Samba de Gafieira – Lambada - Zouk\n\nCountry/Western\nC/W Polka – C/W Cha-cha – C/W Two-step – C/W Waltz\n\nCajun dances\nCajun One Step or Cajun Jig – Cajun Two Step – Zydeco – Cajun Waltz – Cajun Jitterbug\n\nMusette dances\nJava – musette-waltz – musette-tango – musette-paso-doble\n\nOther\nArgentine tango – New Vogue. Ballroom dance. http://en.wikipedia.org/?curid=3332."
  }
}
