{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1967",
  "eid" : "bce4cb40-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778396660,
  "textBody" : "Apollo 12 was the sixth manned flight in the United States Apollo program and the second to land on the Moon. It was launched on November 14, 1969, from the Kennedy Space Center, Florida, four months after Apollo 11. Mission commander Charles \"Pete\" Conrad and Lunar Module Pilot Alan L. Bean performed just over one day and seven hours of lunar surface activity while Command Module Pilot Richard F. Gordon remained in lunar orbit. The landing site for the mission was located in the southeastern portion of the Ocean of Storms.\n\nUnlike the first landing on Apollo 11, Conrad and Bean achieved a precise landing at their expected location, the site of the Surveyor 3 unmanned probe, which had landed on April 20, 1967. They carried the first color television camera to the lunar surface on an Apollo flight, but transmission was lost after Bean accidentally destroyed the camera by pointing it at the Sun. On one of two moonwalks, they visited the Surveyor and removed some parts for return to Earth. The mission ended on November 24 with a successful splashdown.\n\nCrew\n\nBackup crew\n\nSupport crew\n\n*Gerald P. Carr\n*Edward G. Gibson\n*Paul J. Weitz\n\nFlight directors\n\n*Gerry Griffin, Gold team\n*Pete Frank, Orange team\n*Cliff Charlesworth, Green team\n*Milton Windler, Maroon team\n\nMission parameters\n\n*Landing Site: W\n\nLM–CSM docking\n\n*Undocked: November 19, 1969 – 04:16:02 UTC\n*Redocked: November 20, 1969 – 17:58:20 UTC\n\nExtravehicular Activities (EVAs)\n\nEVA 1 start: November 19, 1969, 11:32:35 UTC\n\n* Conrad — EVA 1\n*Stepped onto Moon: 11:44:22 UTC\n*LM ingress: 15:27:17 UTC\n* Bean — EVA 1\n*Stepped onto Moon: 12:13:50 UTC\n*LM ingress: 15:14:18 UTC\n\nEVA 1 end: November 19, 15:28:38 UTC\n\n*Duration: 3 hours, 56 minutes, 03 seconds\n\nEVA 2 start: November 20, 1969, 03:54:45 UTC\n\n* Conrad — EVA 2\n*Stepped onto Moon: 03:59:00 UTC\n*LM ingress: 07:42:00 UTC\n* Bean — EVA 2\n*Stepped onto Moon: 04:06:00 UTC\n*LM ingress: 07:30:00 UTC\n\nEVA 2 end: November 20, 07:44:00 UTC\n\n*Duration: 3 hours, 49 minutes, 15 seconds\n\nMission highlights\n\nLaunch and transfer\n\nApollo 12 launched on schedule from Kennedy Space Center, during a rainstorm. It was the first rocket launch attended by an incumbent US president, Richard Nixon. Thirty-six-and-a-half seconds after lift-off, the vehicle triggered a lightning discharge through itself and down to the Earth through the Saturn's ionized plume. Protective circuits on the fuel cells in the Service Module (SM) falsely detected overloads and took all three fuel cells offline, along with much of the Command/Service Module (CSM) instrumentation. A second strike at 52 seconds after launch knocked out the \"8-ball\" attitude indicator. The telemetry stream at Mission Control was garbled. However, the vehicle continued to fly correctly; the strikes had not affected the Saturn V Instrument Unit.\n\nThe loss of all three fuel cells put the CSM entirely on batteries, which were unable to maintain normal 75-ampere launch loads on the 28-volt DC bus. One of the AC inverters dropped offline. These power supply problems lit nearly every warning light on the control panel and caused much of the instrumentation to malfunction.\n\nElectrical, Environmental and Consumables Manager (EECOM) John Aaron remembered the telemetry failure pattern from an earlier test when a power supply malfunctioned in the CSM Signal Conditioning Electronics (SCE), which converted raw signals from instrumentation to standard voltages for the spacecraft instrument displays and telemetry encoders. Chapter 5.\n\nAaron made a call, \"Try SCE to aux,\" which switched the SCE to a backup power supply. The switch was fairly obscure, and neither Flight Director Gerald Griffin, CAPCOM Gerald Carr, nor Mission Commander Pete Conrad immediately recognized it. Lunar Module Pilot Alan Bean, flying in the right seat as the spacecraft systems engineer, remembered the SCE switch from a training incident a year earlier when the same failure had been simulated. Aaron's quick thinking and Bean's memory saved what could have been an aborted mission, and earned Aaron the reputation of a \"steely-eyed missile man\". Bean put the fuel cells back on line, and with telemetry restored, the launch continued successfully. Once in Earth parking orbit, the crew carefully checked out their spacecraft before re-igniting the S-IVB third stage for trans-lunar injection. The lightning strikes had caused no serious permanent damage.\n\nInitially, it was feared that the lightning strike could have caused the Command Module's (CM) parachute mechanism to prematurely fire, disabling the explosive bolts that open the parachute compartment to deploy them. If they were indeed disabled, the Command Module would have crashed uncontrollably into the Pacific Ocean and killed the crew instantly. Since there was no way to figure out whether or not this was the case, ground controllers decided not to tell the astronauts about the possibility. The parachutes deployed and functioned normally at the end of the mission.\n\nAfter Lunar Module (LM) separation, the S-IVB was intended to fly into solar orbit. The S-IVB auxiliary propulsion system was fired, and the remaining propellants vented to slow it down to fly past the Moon's trailing edge (the Apollo spacecraft always approached the Moon's leading edge). The Moon's gravity would then slingshot the stage into solar orbit. However, a small error in the state vector in the Saturn's guidance system caused the S-IVB to fly past the Moon at too high an altitude to achieve Earth escape velocity. It remained in a semi-stable Earth orbit after passing the Moon on November 18, 1969. It finally escaped Earth orbit in 1971 but was briefly recaptured in Earth orbit 31 years later. It was discovered by amateur astronomer Bill Yeung who gave it the temporary designation J002E3 before it was determined to be an artificial object.\n\nMoon landing\n\nThe Apollo 12 mission landed on November 19, 1969, on an area of the Ocean of Storms (Latin Oceanus Procellarum) that had been visited earlier by several unmanned missions (Luna 5, Surveyor 3, and Ranger 7). The International Astronomical Union, recognizing this, christened this region Mare Cognitum (Known Sea). The Lunar coordinates of the landing site were 3.01239° S latitude, 23.42157° W longitude. The landing site would thereafter be listed as Statio Cognitum on lunar maps. Conrad and Bean did not formally name their landing site, though Conrad nicknamed the intended touchdown area \"Pete's Parking Lot\".\n\nThe second lunar landing was an exercise in precision targeting, which would be needed for future Apollo missions. Most of the descent was automatic, with manual control assumed by Conrad during the final few hundred feet of descent. Unlike Apollo 11, where Neil Armstrong had to use the manual control to direct his lander downrange of the computer's target which was strewn with boulders, Apollo 12 succeeded in landing at its intended target – within walking distance of the Surveyor 3 probe, which had landed on the Moon in April 1967.Chaikin 1995 This was the first – and, to date, only – occasion in which humans have \"caught up\" to a probe sent to land on another world.\n\nConrad actually landed Intrepid 580 ft short of \"Pete's Parking Lot\", because it looked rougher during final approach than anticipated, and was a little under 1180 ft from Surveyor 3, a distance that was chosen to eliminate the possibility of lunar dust (being kicked up by Intrepid's descent engine during landing) from covering Surveyor 3. But the actual touchdown point–approximately 600 ft  from Surveyor 3–did cause high velocity sandblasting of the probe. It was later determined that the sandblasting removed more dust than it delivered onto the Surveyor, because the probe was covered by a thin layer that gave it a tan hue as observed by the astronauts, and every portion of the surface exposed to the direct sandblasting was lightened back toward the original white color through the removal of lunar dust.\n\nEVAs\n\nWhen Conrad, who was somewhat shorter than Neil Armstrong, stepped onto the lunar surface, his first words were \"Whoopie! Man, that may have been a small one for Neil, but that's a long one for me.\" This was not an off-the-cuff remark: Conrad had made a  bet with reporter Oriana Fallaci he would say these words, after she had queried whether NASA had instructed Neil Armstrong what to say as he stepped onto the Moon. Conrad later said he was never able to collect the money.Chaikin 1995, p. 261\n\nTo improve the quality of television pictures from the Moon, a color camera was carried on Apollo 12 (unlike the monochrome camera that was used on Apollo 11). Unfortunately, when Bean carried the camera to the place near the Lunar Module where it was to be set up, he inadvertently pointed it directly into the Sun, destroying the Secondary Electron Conduction (SEC) tube. Television coverage of this mission was thus terminated almost immediately. Note at 109:57:55. See also: Apollo TV camera.\n\nApollo 12 successfully landed within walking distance of the Surveyor 3 probe. Conrad and Bean removed pieces of the probe to be taken back to Earth for analysis. It is claimed that the common bacterium Streptococcus mitis was found to have accidentally contaminated the spacecraft's camera prior to launch and survived dormant in this harsh environment for two and a half years. However, this finding has since been disputed: see Reports of Streptococcus mitis on the Moon.\n\nAstronauts Conrad and Bean also collected rocks and set up equipment that took measurements of the Moon's seismicity, solar wind flux and magnetic field, and relayed the measurements to Earth. The instruments were part of the first complete nuclear-powered ALSEP station set up by astronauts on the Moon to relay long-term data from the lunar surface. The instruments on Apollo 11 were not as extensive or designed to operate long term. The astronauts also took photographs, although by accident Bean left several rolls of exposed film on the lunar surface. Meanwhile, Gordon, on board the Yankee Clipper in lunar orbit, took multi-spectral photographs of the surface.\n\nThe lunar plaque attached to the descent stage of Intrepid is unique in that unlike the other plaques, it (a) did not have a depiction of the Earth, and (b) it was textured differently: The other plaques had black lettering on polished stainless steel while the Apollo 12 plaque had the lettering in polished stainless steel while the background was brushed flat.\n\nReturn\n\nIntrepid's ascent stage was dropped (per normal procedures) after Conrad and Bean rejoined Gordon in orbit. It impacted the Moon on November 20, 1969, at . The seismometers the astronauts had left on the lunar surface registered the vibrations for more than an hour.\n\nThe crew stayed an extra day in lunar orbit taking photographs, for a total lunar surface stay of 31 and a half hours and a total time in lunar orbit of eighty-nine hours.\n\nOn the return flight to Earth after leaving lunar orbit, the crew of Apollo 12 witnessed (and photographed) a solar eclipse, though this one was of the Earth eclipsing the Sun.\n\nSplashdown\n\nYankee Clipper returned to Earth on November 24, 1969 at 20:58 UTC (3:58pm EST, 10:58am HST), in the Pacific Ocean, approximately 500 nautical miles (800 km) east of American Samoa. During splashdown, a 16 mm film camera dislodged from storage and struck Bean in the forehead, rendering him briefly unconscious. He suffered a mild concussion and needed six stitches.  After recovery by , they were flown to Pago Pago International Airport in Tafuna for a reception, before being flown on a C-141 cargo plane to Honolulu.\n\nStunts and mementos\n\n*Alan Bean smuggled a camera-shutter self-timer device on to the mission with the intent of taking a photograph with himself, Pete Conrad and the Surveyor 3 probe in the frame. As the timer was not part of their standard equipment, such an image would have thrown post-mission photo analysts into confusion over how the photo was taken. However, the self-timer was misplaced during the extra-vehicular activity (EVA) and the plan was never executed.\n*As one of the many pranks pulled during the friendly rivalry between the all-Navy prime crew and the all-Air Force backup crew, the Apollo 12 backup crew managed to insert into the astronauts' lunar checklist (attached to the wrists of Conrad's and Bean's space suits) reduced-sized pictures of Playboy Playmates, surprising Conrad and Bean when they looked through the checklist flip-book during their first EVA. The [http://www.hq.nasa.gov/alsj/ Apollo Lunar Surface Journal website] contains a PDF file with the photocopies of their cuff checklists showing these photos. Appearing in Conrad's checklist were Angela Dorian, Miss September 1967 (with the caption \"SEEN ANY INTERESTING HILLS & VALLEYS ?\") and Reagan Wilson, Miss October 1967 (\"PREFERRED TETHER PARTNER,\" referring to a special procedure that would require the sharing of life support resources). The photos in Bean's cuff checklist were of Cynthia Myers, Miss December 1968 (\"DON'T FORGET – DESCRIBE THE PROTUBERANCES\") and Leslie Bianchini, Miss January 1969 (\"SURVEY – HER ACTIVITY,\" in pun of Surveyor). The backup crew who did this later flew to the Moon themselves on Apollo 15. At the back of Conrad's checklist they had also prepared two pages of complex geological terminology, added as a joke to give him the option to sound to Mission Control like he was as skilled as a professional career geologist. The third crewmember orbiting the Moon was not left out of the Playboy prank, as a November 1969 calendar featuring DeDe Lind, Miss August 1967, had been stowed in a locker that Dick Gordon found while his crewmates were on the lunar surface. In 2011, he put this calendar up for auction. Its value was estimated by RR Auction at . While the Command Module Pilot calendar was in full color, the lunar checklists carried black & white photocopies (although these were dramatized in From the Earth to the Moon as full color photos in the checklists).\n* Artist Forrest \"Frosty\" Myers claims to have installed the art piece Moon Museum on \"a leg of the Intrepid landing module with the help of an unnamed engineer at the Grumman Corporation after attempts to move the project forward through NASA's official channels were unsuccessful.\"\n* Alan Bean left a memento on the Moon: his silver astronaut pin. This pin signified an astronaut who completed training but had not yet flown in space; he had worn it for six years. He was to get a gold astronaut pin for successfully completing the mission after the flight and felt he wouldn't need the silver pin thereafter. Tossing his pin into a lunar crater extended the common tradition among military pilots to ceremonially dispose of their originally awarded flight wings.\n\nMission insignia \n\nThe Apollo 12 mission patch shows the crew's navy background; all three astronauts at the time of the mission were U.S. Navy commanders. It features a clipper ship arriving at the Moon, representing the Command Module Yankee Clipper. The ship trails fire, and flies the flag of the United States. The mission name APOLLO XII and the crew names are on a wide gold border, with a small blue trim. Blue and gold are traditional U.S. Navy colors. The patch has four stars on it — one each for the three astronauts who flew the mission and one for Clifton Williams, a U.S. Marine Corps aviator and astronaut who was killed on October 5, 1967, after a mechanical failure caused the controls of his T-38 trainer to stop responding, resulting in a crash. He trained with Conrad and Gordon as part of the backup crew for what would be the Apollo 9 mission, and would have been assigned as Lunar Module Pilot for Apollo 12.\n\nSpacecraft location\n\nThe Apollo 12 Command Module Yankee Clipper is on display at the Virginia Air and Space Center in Hampton, Virginia.\n\nIn 2002, astronomers thought they might have discovered another moon orbiting Earth, which they designated J002E3, that turned out to be the S-IVB third stage of the Apollo 12 Saturn V rocket.\n\nThe Lunar Module Intrepid impacted the Moon November 20, 1969 at 22:17:17.7 UT (5:17 PM EST) . In 2009, the Lunar Reconnaissance Orbiter (LRO) photographed the Apollo 12 landing site. The Intrepid Lunar Module descent stage, experiment package (ALSEP), Surveyor 3 spacecraft, and astronaut footpaths are all visible. In 2011, the LRO returned to the landing site at a lower altitude to take higher resolution photographs.\n\nDepiction in media\n\nPortions of the Apollo 12 mission are dramatized in the miniseries From the Earth to the Moon episode entitled \"That's All There Is\". Conrad, Gordon, and Bean were portrayed by Paul McCrane, Tom Verica, and Dave Foley, respectively. Conrad had been portrayed by a different actor, Peter Scolari, in the first episode.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Apollo 12" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1967" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Apollo 12 was the sixth manned flight in the United States Apollo program and the second to land on the Moon. It was launched on November 14, 1969, from the Kennedy Space Center, Florida, four months after Apollo 11. Mission commander Charles \"Pete\" Conrad and Lunar Module Pilot Alan L. Bean performed just over one day and seven hours of lunar surface activity while Command Module Pilot Richard F. Gordon remained in lunar orbit. The landing site for the mission was located in the southeastern portion of the Ocean of Storms.\n\nUnlike the first landing on Apollo 11, Conrad and Bean achieved a precise landing at their expected location, the site of the Surveyor 3 unmanned probe, which had landed on April 20, 1967. They carried the first color television camera to the lunar surface on an Apollo flight, but transmission was lost after Bean accidentally destroyed the camera by pointing it at the Sun. On one of two moonwalks, they visited the Surveyor and removed some parts for return to Earth. The mission ended on November 24 with a successful splashdown.\n\nCrew\n\nBackup crew\n\nSupport crew\n\n*Gerald P. Carr\n*Edward G. Gibson\n*Paul J. Weitz\n\nFlight directors\n\n*Gerry Griffin, Gold team\n*Pete Frank, Orange team\n*Cliff Charlesworth, Green team\n*Milton Windler, Maroon team\n\nMission parameters\n\n*Landing Site: W\n\nLM–CSM docking\n\n*Undocked: November 19, 1969 – 04:16:02 UTC\n*Redocked: November 20, 1969 – 17:58:20 UTC\n\nExtravehicular Activities (EVAs)\n\nEVA 1 start: November 19, 1969, 11:32:35 UTC\n\n* Conrad — EVA 1\n*Stepped onto Moon: 11:44:22 UTC\n*LM ingress: 15:27:17 UTC\n* Bean — EVA 1\n*Stepped onto Moon: 12:13:50 UTC\n*LM ingress: 15:14:18 UTC\n\nEVA 1 end: November 19, 15:28:38 UTC\n\n*Duration: 3 hours, 56 minutes, 03 seconds\n\nEVA 2 start: November 20, 1969, 03:54:45 UTC\n\n* Conrad — EVA 2\n*Stepped onto Moon: 03:59:00 UTC\n*LM ingress: 07:42:00 UTC\n* Bean — EVA 2\n*Stepped onto Moon: 04:06:00 UTC\n*LM ingress: 07:30:00 UTC\n\nEVA 2 end: November 20, 07:44:00 UTC\n\n*Duration: 3 hours, 49 minutes, 15 seconds\n\nMission highlights\n\nLaunch and transfer\n\nApollo 12 launched on schedule from Kennedy Space Center, during a rainstorm. It was the first rocket launch attended by an incumbent US president, Richard Nixon. Thirty-six-and-a-half seconds after lift-off, the vehicle triggered a lightning discharge through itself and down to the Earth through the Saturn's ionized plume. Protective circuits on the fuel cells in the Service Module (SM) falsely detected overloads and took all three fuel cells offline, along with much of the Command/Service Module (CSM) instrumentation. A second strike at 52 seconds after launch knocked out the \"8-ball\" attitude indicator. The telemetry stream at Mission Control was garbled. However, the vehicle continued to fly correctly; the strikes had not affected the Saturn V Instrument Unit.\n\nThe loss of all three fuel cells put the CSM entirely on batteries, which were unable to maintain normal 75-ampere launch loads on the 28-volt DC bus. One of the AC inverters dropped offline. These power supply problems lit nearly every warning light on the control panel and caused much of the instrumentation to malfunction.\n\nElectrical, Environmental and Consumables Manager (EECOM) John Aaron remembered the telemetry failure pattern from an earlier test when a power supply malfunctioned in the CSM Signal Conditioning Electronics (SCE), which converted raw signals from instrumentation to standard voltages for the spacecraft instrument displays and telemetry encoders. Chapter 5.\n\nAaron made a call, \"Try SCE to aux,\" which switched the SCE to a backup power supply. The switch was fairly obscure, and neither Flight Director Gerald Griffin, CAPCOM Gerald Carr, nor Mission Commander Pete Conrad immediately recognized it. Lunar Module Pilot Alan Bean, flying in the right seat as the spacecraft systems engineer, remembered the SCE switch from a training incident a year earlier when the same failure had been simulated. Aaron's quick thinking and Bean's memory saved what could have been an aborted mission, and earned Aaron the reputation of a \"steely-eyed missile man\". Bean put the fuel cells back on line, and with telemetry restored, the launch continued successfully. Once in Earth parking orbit, the crew carefully checked out their spacecraft before re-igniting the S-IVB third stage for trans-lunar injection. The lightning strikes had caused no serious permanent damage.\n\nInitially, it was feared that the lightning strike could have caused the Command Module's (CM) parachute mechanism to prematurely fire, disabling the explosive bolts that open the parachute compartment to deploy them. If they were indeed disabled, the Command Module would have crashed uncontrollably into the Pacific Ocean and killed the crew instantly. Since there was no way to figure out whether or not this was the case, ground controllers decided not to tell the astronauts about the possibility. The parachutes deployed and functioned normally at the end of the mission.\n\nAfter Lunar Module (LM) separation, the S-IVB was intended to fly into solar orbit. The S-IVB auxiliary propulsion system was fired, and the remaining propellants vented to slow it down to fly past the Moon's trailing edge (the Apollo spacecraft always approached the Moon's leading edge). The Moon's gravity would then slingshot the stage into solar orbit. However, a small error in the state vector in the Saturn's guidance system caused the S-IVB to fly past the Moon at too high an altitude to achieve Earth escape velocity. It remained in a semi-stable Earth orbit after passing the Moon on November 18, 1969. It finally escaped Earth orbit in 1971 but was briefly recaptured in Earth orbit 31 years later. It was discovered by amateur astronomer Bill Yeung who gave it the temporary designation J002E3 before it was determined to be an artificial object.\n\nMoon landing\n\nThe Apollo 12 mission landed on November 19, 1969, on an area of the Ocean of Storms (Latin Oceanus Procellarum) that had been visited earlier by several unmanned missions (Luna 5, Surveyor 3, and Ranger 7). The International Astronomical Union, recognizing this, christened this region Mare Cognitum (Known Sea). The Lunar coordinates of the landing site were 3.01239° S latitude, 23.42157° W longitude. The landing site would thereafter be listed as Statio Cognitum on lunar maps. Conrad and Bean did not formally name their landing site, though Conrad nicknamed the intended touchdown area \"Pete's Parking Lot\".\n\nThe second lunar landing was an exercise in precision targeting, which would be needed for future Apollo missions. Most of the descent was automatic, with manual control assumed by Conrad during the final few hundred feet of descent. Unlike Apollo 11, where Neil Armstrong had to use the manual control to direct his lander downrange of the computer's target which was strewn with boulders, Apollo 12 succeeded in landing at its intended target – within walking distance of the Surveyor 3 probe, which had landed on the Moon in April 1967.Chaikin 1995 This was the first – and, to date, only – occasion in which humans have \"caught up\" to a probe sent to land on another world.\n\nConrad actually landed Intrepid 580 ft short of \"Pete's Parking Lot\", because it looked rougher during final approach than anticipated, and was a little under 1180 ft from Surveyor 3, a distance that was chosen to eliminate the possibility of lunar dust (being kicked up by Intrepid's descent engine during landing) from covering Surveyor 3. But the actual touchdown point–approximately 600 ft  from Surveyor 3–did cause high velocity sandblasting of the probe. It was later determined that the sandblasting removed more dust than it delivered onto the Surveyor, because the probe was covered by a thin layer that gave it a tan hue as observed by the astronauts, and every portion of the surface exposed to the direct sandblasting was lightened back toward the original white color through the removal of lunar dust.\n\nEVAs\n\nWhen Conrad, who was somewhat shorter than Neil Armstrong, stepped onto the lunar surface, his first words were \"Whoopie! Man, that may have been a small one for Neil, but that's a long one for me.\" This was not an off-the-cuff remark: Conrad had made a  bet with reporter Oriana Fallaci he would say these words, after she had queried whether NASA had instructed Neil Armstrong what to say as he stepped onto the Moon. Conrad later said he was never able to collect the money.Chaikin 1995, p. 261\n\nTo improve the quality of television pictures from the Moon, a color camera was carried on Apollo 12 (unlike the monochrome camera that was used on Apollo 11). Unfortunately, when Bean carried the camera to the place near the Lunar Module where it was to be set up, he inadvertently pointed it directly into the Sun, destroying the Secondary Electron Conduction (SEC) tube. Television coverage of this mission was thus terminated almost immediately. Note at 109:57:55. See also: Apollo TV camera.\n\nApollo 12 successfully landed within walking distance of the Surveyor 3 probe. Conrad and Bean removed pieces of the probe to be taken back to Earth for analysis. It is claimed that the common bacterium Streptococcus mitis was found to have accidentally contaminated the spacecraft's camera prior to launch and survived dormant in this harsh environment for two and a half years. However, this finding has since been disputed: see Reports of Streptococcus mitis on the Moon.\n\nAstronauts Conrad and Bean also collected rocks and set up equipment that took measurements of the Moon's seismicity, solar wind flux and magnetic field, and relayed the measurements to Earth. The instruments were part of the first complete nuclear-powered ALSEP station set up by astronauts on the Moon to relay long-term data from the lunar surface. The instruments on Apollo 11 were not as extensive or designed to operate long term. The astronauts also took photographs, although by accident Bean left several rolls of exposed film on the lunar surface. Meanwhile, Gordon, on board the Yankee Clipper in lunar orbit, took multi-spectral photographs of the surface.\n\nThe lunar plaque attached to the descent stage of Intrepid is unique in that unlike the other plaques, it (a) did not have a depiction of the Earth, and (b) it was textured differently: The other plaques had black lettering on polished stainless steel while the Apollo 12 plaque had the lettering in polished stainless steel while the background was brushed flat.\n\nReturn\n\nIntrepid's ascent stage was dropped (per normal procedures) after Conrad and Bean rejoined Gordon in orbit. It impacted the Moon on November 20, 1969, at . The seismometers the astronauts had left on the lunar surface registered the vibrations for more than an hour.\n\nThe crew stayed an extra day in lunar orbit taking photographs, for a total lunar surface stay of 31 and a half hours and a total time in lunar orbit of eighty-nine hours.\n\nOn the return flight to Earth after leaving lunar orbit, the crew of Apollo 12 witnessed (and photographed) a solar eclipse, though this one was of the Earth eclipsing the Sun.\n\nSplashdown\n\nYankee Clipper returned to Earth on November 24, 1969 at 20:58 UTC (3:58pm EST, 10:58am HST), in the Pacific Ocean, approximately 500 nautical miles (800 km) east of American Samoa. During splashdown, a 16 mm film camera dislodged from storage and struck Bean in the forehead, rendering him briefly unconscious. He suffered a mild concussion and needed six stitches.  After recovery by , they were flown to Pago Pago International Airport in Tafuna for a reception, before being flown on a C-141 cargo plane to Honolulu.\n\nStunts and mementos\n\n*Alan Bean smuggled a camera-shutter self-timer device on to the mission with the intent of taking a photograph with himself, Pete Conrad and the Surveyor 3 probe in the frame. As the timer was not part of their standard equipment, such an image would have thrown post-mission photo analysts into confusion over how the photo was taken. However, the self-timer was misplaced during the extra-vehicular activity (EVA) and the plan was never executed.\n*As one of the many pranks pulled during the friendly rivalry between the all-Navy prime crew and the all-Air Force backup crew, the Apollo 12 backup crew managed to insert into the astronauts' lunar checklist (attached to the wrists of Conrad's and Bean's space suits) reduced-sized pictures of Playboy Playmates, surprising Conrad and Bean when they looked through the checklist flip-book during their first EVA. The [http://www.hq.nasa.gov/alsj/ Apollo Lunar Surface Journal website] contains a PDF file with the photocopies of their cuff checklists showing these photos. Appearing in Conrad's checklist were Angela Dorian, Miss September 1967 (with the caption \"SEEN ANY INTERESTING HILLS & VALLEYS ?\") and Reagan Wilson, Miss October 1967 (\"PREFERRED TETHER PARTNER,\" referring to a special procedure that would require the sharing of life support resources). The photos in Bean's cuff checklist were of Cynthia Myers, Miss December 1968 (\"DON'T FORGET – DESCRIBE THE PROTUBERANCES\") and Leslie Bianchini, Miss January 1969 (\"SURVEY – HER ACTIVITY,\" in pun of Surveyor). The backup crew who did this later flew to the Moon themselves on Apollo 15. At the back of Conrad's checklist they had also prepared two pages of complex geological terminology, added as a joke to give him the option to sound to Mission Control like he was as skilled as a professional career geologist. The third crewmember orbiting the Moon was not left out of the Playboy prank, as a November 1969 calendar featuring DeDe Lind, Miss August 1967, had been stowed in a locker that Dick Gordon found while his crewmates were on the lunar surface. In 2011, he put this calendar up for auction. Its value was estimated by RR Auction at . While the Command Module Pilot calendar was in full color, the lunar checklists carried black & white photocopies (although these were dramatized in From the Earth to the Moon as full color photos in the checklists).\n* Artist Forrest \"Frosty\" Myers claims to have installed the art piece Moon Museum on \"a leg of the Intrepid landing module with the help of an unnamed engineer at the Grumman Corporation after attempts to move the project forward through NASA's official channels were unsuccessful.\"\n* Alan Bean left a memento on the Moon: his silver astronaut pin. This pin signified an astronaut who completed training but had not yet flown in space; he had worn it for six years. He was to get a gold astronaut pin for successfully completing the mission after the flight and felt he wouldn't need the silver pin thereafter. Tossing his pin into a lunar crater extended the common tradition among military pilots to ceremonially dispose of their originally awarded flight wings.\n\nMission insignia \n\nThe Apollo 12 mission patch shows the crew's navy background; all three astronauts at the time of the mission were U.S. Navy commanders. It features a clipper ship arriving at the Moon, representing the Command Module Yankee Clipper. The ship trails fire, and flies the flag of the United States. The mission name APOLLO XII and the crew names are on a wide gold border, with a small blue trim. Blue and gold are traditional U.S. Navy colors. The patch has four stars on it — one each for the three astronauts who flew the mission and one for Clifton Williams, a U.S. Marine Corps aviator and astronaut who was killed on October 5, 1967, after a mechanical failure caused the controls of his T-38 trainer to stop responding, resulting in a crash. He trained with Conrad and Gordon as part of the backup crew for what would be the Apollo 9 mission, and would have been assigned as Lunar Module Pilot for Apollo 12.\n\nSpacecraft location\n\nThe Apollo 12 Command Module Yankee Clipper is on display at the Virginia Air and Space Center in Hampton, Virginia.\n\nIn 2002, astronomers thought they might have discovered another moon orbiting Earth, which they designated J002E3, that turned out to be the S-IVB third stage of the Apollo 12 Saturn V rocket.\n\nThe Lunar Module Intrepid impacted the Moon November 20, 1969 at 22:17:17.7 UT (5:17 PM EST) . In 2009, the Lunar Reconnaissance Orbiter (LRO) photographed the Apollo 12 landing site. The Intrepid Lunar Module descent stage, experiment package (ALSEP), Surveyor 3 spacecraft, and astronaut footpaths are all visible. In 2011, the LRO returned to the landing site at a lower altitude to take higher resolution photographs.\n\nDepiction in media\n\nPortions of the Apollo 12 mission are dramatized in the miniseries From the Earth to the Moon episode entitled \"That's All There Is\". Conrad, Gordon, and Bean were portrayed by Paul McCrane, Tom Verica, and Dave Foley, respectively. Conrad had been portrayed by a different actor, Peter Scolari, in the first episode. Apollo 12. http://en.wikipedia.org/?curid=1967."
  }
}
