{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5248",
  "eid" : "d36ec0a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778434474,
  "textBody" : "The Cold War (1947–1953) is the period within the Cold War from the Truman Doctrine in 1947 to the conclusion of the Korean War in 1953. The Cold War emerged in Europe a few years after the successful US-USSR-UK coalition won World War II in Europe, and extended to 1989-91. \n\nSome conflicts between the West and the USSR appeared earlier. In 1945-46 the US and UK strongly protested Soviet political takeover efforts in Eastern Europe, while the hunt for Soviet spies made the tensions more visible.  However historians emphasize the decisive break between the US-UK and the USSR came in 1947-48 over such issues as the Truman Doctrine, the Marshall Plan and the Berlin Blockade, followed by the formation of NATO in 1949.The Cold War took place worldwide, but it had a partially different timing  outside Europe.\n\nCreation of the Eastern Bloc\n\nDuring World War II, the Soviet Union annexed several countries as Soviet Socialist Republics within the Union of Soviet Socialist Republics. Most of those countries had been ceded to it by the secret agreement portion of the Molotov-Ribbentrop Pact with Nazi Germany.Encyclopædia Britannica, German-Soviet Nonaggression Pact, 2008[http://www.fordham.edu/halsall/mod/1939pact.html Text of the Nazi-Soviet Non-Aggression Pact], executed August 23, 1939   These later annexed territories include Eastern Poland (incorporated into two different SSRs), Latvia (became Latvian SSR),Senn, Alfred Erich, Lithuania 1940 : revolution from above, Amsterdam, New York, Rodopi, 2007  Estonia (became Estonian SSR), Lithuania (became Lithuanian SSR), part of eastern Finland (became part of the Karelo-Finnish SSR)Kennedy-Pipe, Caroline, Stalin's Cold War, New York: Manchester University Press, 1995,  and northern Romania (became the Moldavian SSR).\n\nSeveral of the other countries it occupied that were not directly annexed into the Soviet Union became Soviet satellite states.  In East Germany after local election losses, a forced merger of political parties in the Socialist Unity Party (\"SED\"), followed by elections in 1946 where political opponents were oppressed. In the non-USSR annexed portion of Poland, less than a third of Poland's population voted in favor of massive communist land reforms and industry nationalizationsCurp, David, A Clean Sweep?: The Politics of Ethnic Cleansing in Western Poland, 1945–1960, Boydell & Brewer, 2006, , pages 66–69 in a policies referendum known as \"3 times YES\" (3 razy TAK; 3xTAK), whereupon a second vote rigged election was held to get the desired result.Tom Buchanan, Europe's Troubled Peace, 1945–2000: 1945–2000, Blackwell Publishing, 2005, , [https://books.google.com/books?vid\nISBN0631221638&idzeqdrL3Wzy8C&pg\nRA1-PA84&lpgRA1-PA84&ots\nsdtzUrdhbs&dqPolish+referendum+1946+falsified&sig\n5einoBUu1HWsfCzOoauJcrxCTvg Google Print, p.84][http://www.poloniatoday.com/history13.htm A brief history of Poland: Chapter 13: The Post-War Years, 1945–1990] . Polonia Today Online. Retrieved on 28 March 2007.[http://www.britannica.com/eb/article-28216 \"Poland.\"] Encyclopædia Britannica. 2007. Encyclopædia Britannica Online. Retrieved on 7 April 2007 Fraudulent Polish elections held in January 1947 resulted in Poland's official transformation to the People's Republic of Poland.\n\nThe List of World Leaders at the Beginning of these Years are as follows:\n\n1947- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Chiang Kai-shek (Allied China)\n\n1948- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Chiang Kai-shek (Allied China)\n\n1949- Clement Attlee (UK): Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Chiang Kai-shek (Allied China)\n\n1950- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\n1951- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\n1952- Winston Churchill (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\n1953- Winston Churchill (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\nIn Hungary, when the Soviets installed a communist government, Mátyás Rákosi was appointed General Secretary of the Hungarian Communist Party,Sugar, Peter F., Peter Hanak and Tibor Frank, A History of Hungary, Indiana University Press, 1994, , page 375-77 which began one of the harshest dictatorships in EuropeGranville, Johanna, The First Domino: International Decision Making during the Hungarian Crisis of 1956, Texas A&M University Press, 2004. Gati, Charles, Failed Illusions: Moscow, Washington, Budapest, and the 1956 Hungarian Revolt, Stanford University Press, 2006 , page 9-12 under the People's Republic of Hungary.  In Bulgaria, toward the end of World War II, the Soviet Union crossed the border and created the conditions for a communist coup d'état on the following night. The Soviet military commander in Sofia assumed supreme authority, and the communists whom he instructed, including Kimon Georgiev (who was not a communist himself, but a member of the elitarian political organization \"Zveno\", working together with the communists), took full control of domestic politics in the People's Republic of Bulgaria.\n\nWith Soviet backing, the Communist Party of Czechoslovakia assumed undisputed control over the government of Czechoslovakia in the Czechoslovak coup d'état of 1948, ushering in a dictatorship.  In the Romanian general election elections of 1946, the Romanian Communist Party (PCR) employed widespread intimidation tactics and electoral fraud to obtain 80 percent of the vote and, thereafter, eliminated the role of the centrist parties and forced mergers, the result of which was that, by 1948, most non-Communist politicians were either executed, in exile or in prison. In the December 1945 Albanian election, the only effective ballot choices were those of the communist Democratic Front (Albania), led by Enver Hoxha.  In 1946, Albania was declared the People's Republic of Albania.\n\nInitially, Stalin directed systems in the Eastern Bloc countries that rejected Western institutional characteristics of market economies, democratic governance (dubbed \"bourgeois democracy\" in Soviet parlance) and the rule of law subduing discretional intervention by the state. They were economically communist and depended upon the Soviet Union for significant amounts of materials.  While in the first five years following World War II, massive emigration from these states to the West occurred, restrictions implemented thereafter stopped most East-West migration, except that under limited bilateral and other agreements.\n\nContainment\n\nThe immediate post-1945 period may have been the historical high point for the popularity of communist ideology. The burdens the Red Army and the Soviet Union endured had earned it massive respect which, had it been fully exploited by Joseph Stalin, had a good chance of resulting in a communist Europe. Communist parties achieved a significant popularity in such nations as China, Greece, Iran, and the Republic of Mahabad. Communist parties had already come to power in Romania, Bulgaria, Albania, and Yugoslavia. The United Kingdom and the United States were concerned that electoral victories by communist parties in any of these countries could lead to sweeping economic and political change in Western Europe.\n\nMorgenthau and Marshall Plans\n\nHaving lost 27 million people in the war, the Soviet Union was determined to destroy Germany's capacity for another war, and pushed for such in wartime conferences. The resulting Morgenthau plan policy foresaw returning Germany to a pastoral state without heavy industry. Because of the increasing costs of food imports to avoid mass-starvation in Germany, and with the danger of losing the entire nation to communism, the U.S. government abandoned the Morgenthau plan in September 1946 with Secretary of State James F. Byrnes' speech Restatement of Policy on Germany.John Gimbel [https://www.jstor.org/stable/2147827 \"On the Implementation of the Potsdam Agreement: An Essay on U.S. Postwar German Policy\"] Political Science Quarterly, Vol. 87, No. 2. (Jun., 1972), pp. 242–269.\n\nIn January 1947, Truman appointed General George Marshall as Secretary of State, and enacted JCS 1779, which decreed that an orderly and prosperous Europe requires the economic contributions of a stable and productive Germany.\" The directive comported with the view of  General Lucius D. Clay and the Joint Chief of Staff over growing communist influence in Germany, as well as of the failure of the rest of the European economy to recover without the German industrial base on which it previously had been dependent. Administration officials met with Soviet Foreign Minister Vyacheslav Molotov and others to press for an economically self-sufficient Germany, including a detailed accounting of the industrial plants, goods and infrastructure already removed by the Soviets. After six weeks of negotiations, Molotov refused the demands and the talks were adjourned. Marshall was particularly discouraged after personally meeting with Stalin, who expressed little interest in a solution to German economic problems. The United States concluded that a solution could not wait any longer.  In a June 5, 1947 speech,Marshall, George C, The Marshal Plan Speech, June 5, 1947 comporting with the Truman Doctrine, Marshall announced a comprehensive program of American assistance to all European countries wanting to participate, including the Soviet Union and those of Eastern Europe, called the Marshall Plan.\n\nFearing American political, cultural and economic penetration, Stalin eventually forbade Soviet Eastern bloc countries of the newly formed Cominform from accepting Marshall Plan aid. In Czechoslovakia, that required a Soviet-backed Czechoslovak coup d'état of 1948,Airbridge to Berlin, \"Eye of the Storm\" chapter   the brutality of which shocked Western powers more than any event so far and set in a motion a brief scare that war would occur and swept away the last vestiges of opposition to the Marshall Plan in the United States Congress.\n\nThe Greek Civil War and the Truman Doctrine\n\nBoth East and West regarded Greece as a nation well within the sphere of influence of Britain. Stalin had respected the \"percentages agreement\" with Winston Churchill to not intervene, but Yugoslavia and Albania defied the USSR's advice and sent supplies during the Greek Civil War to the army of the Communist Party of Greece, the DSE (Democratic Army of Greece). The UK had given aid to the royalist Greek forces and ELAS leaders who, failing to realize that there would be no Soviet aid and having boycotted the elections, were at a disadvantaged position. However, by 1947, the near-bankrupt British government could no longer maintain its massive overseas commitments. In addition to granting independence to India and handing back the Palestinian Mandate to the United Nations, the British government decided to withdraw from both Greece and nearby Turkey. This would have left the two nations, in particular Greece, on the brink of a communist-led revolution.\n\nNotified that British aid to Greece and Turkey would end in less than six weeks, and already hostile towards and suspicious of Soviet intentions, because of their reluctance to withdraw from Iran, the Truman administration decided that additional action was necessary.  With Congress solidly in Republican hands, and with isolationist sentiment strong among the U.S. public, Truman adopted an ideological approach. In a meeting with congressional leaders, the argument of \"apples in a barrel infected by one rotten one\" was used to convince them of the significance in supporting Greece and Turkey. It was to become the \"domino theory\". On the morning of March 12, 1947, President Harry S. Truman appeared before Congress to ask for $400 million of aid to Greece and Turkey. Calling on congressional approval for the United States to \"support free peoples who are resisting attempted subjugation by armed minorities or by outside pressures,\" or in short a policy of \"containment\", Truman articulated a presentation of the ideological struggle that became known as the \"Truman Doctrine.\" Although based on a simplistic analysis of internal strife in Greece and Turkey, it became the single dominating influence over U.S. policy until at least the Vietnam War.\n\nTruman's speech had a tremendous effect. The anti-communist feelings that had just begun to hatch in the U.S. were given a great boost, and a silenced Congress voted overwhelmingly in approval of aid. The United States would not withdraw back to the Western Hemisphere as it had after World War I. From then on, the U.S. actively engaged any communist threats anywhere in the globe under the ostensible causes of \"freedom\", \"democracy\" and \"human rights.\" The U.S. brandished its role as the leader of the \"free world.\" Meanwhile, the Soviet Union brandished its position as the leader of the \"progressive\" and \"anti-imperialist\" camp.\n\nNazi-Soviet relations and Falsifiers of History\n\nRelations further deteriorated when, in January 1948, the U.S. State Department also published a collection of documents titled Nazi-Soviet Relations, 1939–1941: Documents from the Archives of The German Foreign Office, which contained documents recovered from the Foreign Office of Nazi Germany revealing Soviet conversations with Germany regarding the Molotov-Ribbentrop Pact, including its secret protocol dividing eastern Europe, the 1939 German-Soviet Commercial Agreement, and discussions of the Soviet Union potentially becoming the fourth Axis Power.\n\nIn response, one month later, the Soviet Union published Falsifiers of History, a Stalin edited and partially re-written book attacking the West. The book did not attempt to directly counter or deal with the documents published in Nazi-Soviet Relations and rather, focused upon Western culpability for the outbreak of war in 1939. It argues that \"Western powers\" aided Nazi rearmament and aggression, including that American bankers and industrialists provided capital for the growth of German war industries, while deliberately encouraging Hitler to expand eastward.  The book also included the claim that, during the Pact's operation, Stalin rejected Hitler's offer to share in a division of the world, without mentioning the Soviet offers to join the Axis.  Historical studies, official accounts, memoirs and textbooks published in the Soviet Union used that depiction of events until the Soviet Union's dissolution.\n\nBerlin Blockade\n\nAfter the Marshall Plan, the introduction of a new currency to Western Germany to replace the debased Reichsmark and massive electoral losses for communist parties in 1946, in June 1948, the Soviet Union cut off surface road access to Berlin.  On the day of the Berlin Blockade, a Soviet representative told the other occupying powers  \"We are warning both you and the population of Berlin that we shall apply economic and administrative sanctions that will lead to circulation in Berlin exclusively of the currency of the Soviet occupation zone.\"\n\nThereafter, street and water communications were severed, rail and barge traffic was stopped and the Soviets initially stopped supplying food to the civilian population in the non-Soviet sectors of Berlin.  Because Berlin was located within the Soviet-occupied zone of Germany and the other occupying powers had previously relied on Soviet good will for access to Berlin, the only available methods of supplying the city were three limited air corridors.\n\nBy February 1948, because of massive post-war military cuts, the entire United States army had been reduced to 552,000 men.  Military forces in non-Soviet Berlin sectors totaled only 8,973 Americans, 7,606 British and 6,100 French.  Soviet military forces in the Soviet sector that surrounded Berlin totaled one and a half million men. The two United States regiments in Berlin would have provided little resistance against a Soviet attack. Believing that Britain, France and the United States had little option other than to acquiesce, the Soviet Military Administration in Germany celebrated the beginning of the blockade. Thereafter, a massive aerial supply campaign of food, water and other goods was initiated by the United States, Britain, France and other countries.MAC and the Legacy of the Berlin Airlift The Soviets derided \"the futile attempts of the Americans to save face and to maintain their untenable position in Berlin.\"[http://www.indianamilitary.org/ATTERBURYAAF/History/BerlinAirlift.html Fifty years ago, a massive airlift into Berlin showed the Soviets that a post-WW II blockade would not work], C.V. Glines   The success of the airlift eventually caused the Soviets to lift their blockade in May 1949.\n\nTito-Stalin Split\n\nAfter disagreements between Yugoslavian leader Josip Broz Tito and the Soviet Union regarding Greece and the People's Republic of Albania, a Tito–Stalin Split occurred, followed by Yugoslavia being expelled from the Cominform in June 1948 and a brief failed Soviet putsch in Belgrade.  The split created two separate communist forces in Europe.  A vehement campaign against \"Titoism\" was immediately started in the Eastern Bloc, describing agents of both the West and Tito in all places engaging in subversive activity. This resulted in the persecution of many major party cadres, including those in East Germany.\n\nNATO\n\nThe United States joined Britain, France, Canada, Denmark, Portugal, Norway, Belgium, Iceland, Luxembourg, Italy, and the Netherlands in 1949 to form the North Atlantic Treaty Organization (NATO), the United States' first \"entangling\" European alliance in 170 years. West Germany, Spain, Greece, and Turkey would later join this alliance. The Eastern leaders retaliated against these steps by integrating the economies of their nations in Comecon, their version of the Marshall Plan; exploding the first Soviet atomic device in 1949; signing an alliance with People's Republic of China in February 1950; and forming the Warsaw Pact, Eastern Europe's counterpart to NATO, in 1955. The Soviet Union, Albania, Czechoslovakia, Hungary, East Germany, Bulgaria, Romania, and Poland founded this military alliance.\n\nNSC-68\n\nU.S. officials quickly moved to escalate and expand \"containment.\" In a secret 1950 document, NSC-68, they proposed to strengthen their alliance systems, quadruple defense spending, and embark on an elaborate propaganda campaign to convince the U.S. public to fight this costly cold war. Truman ordered the development of a hydrogen bomb. In early 1950, the U.S. took its first efforts to oppose communist forces in Vietnam; planned to form a West German army, and prepared proposals for a peace treaty with Japan that would guarantee long-term U.S. military bases there.\n\nOutside Europe\n\nThe Cold War took place worldwide, but it had a partially different timing and trajectory outside Europe.Odd Arne Westad, The Cold War: A World History (Penguin UK, 2017)  pp2-7.\n\nIn Africa, decolonization took place first; it was largely accomplished in the 1950s. The main rivals then sought bases of support in the new national political alignments.James H. Meriwether, “Endangering the Security of the Free World: Africa, the United States, and the Cold War,” New England Journal of History, 64 (Fall 2007), 90–101.   In Latin America, the first major confrontation took place in Guatemala in 1954.  When the new Castro government of Cuba turned to Soviets support in 1960, Cuba became the center of the anti-American Cold War forces, supported by the Soviet Union.Richard H. Immerman, \"Guatemala as Cold War History,\" Political Science Quarterly 95#3 (1980-81): 629-653. [https://www.jstor.org/stable/2150608 online]  Lester Langley, ed. The United States, Cuba, and the Cold War; American Failure Or Communist Conspiracy? (1970) \nChinese Civil War\n\nAs Japan collapsed in 1945 the civil war resumed in China between the Kuomintang (KMT) led by Generalissimo Chiang Kai-shek and the Communist Party of China led by Mao Zedong. The USSR had signed a Treaty of Friendship with the Kuomintang in 1945 and disavowed support for the Chinese Communists. The outcome was closely fought, with the Communists finally prevailing with superior military tactics. Although the Nationalists had an advantage in numbers of men and weapons, initially controlled a much larger territory and population than their adversaries, and enjoyed considerable international support, they were exhausted by the long war with Japan and the attendant internal responsibilities. In addition, the Chinese Communists were able to fill the political vacuum left in Manchuria after Soviet forces withdrew from the area and thus gained China's prime industrial base. The Chinese Communists were able to fight their way from the north and northeast, and virtually all of mainland China was taken by the end of 1949. On October 1, 1949, Mao Zedong proclaimed the People's Republic of China (PRC). Chiang Kai-shek and 600,000 Nationalist troops and 2 million refugees, predominantly from the government and business community, fled from the mainland to the island of Taiwan. In December 1949, Chiang proclaimed Taipei the temporary capital of the Republic of China (ROC) and continued to assert his government as the sole legitimate authority in China.\n\nThe continued hostility between the Communists on the mainland and the Nationalists on Taiwan continued throughout the Cold War. Though the United States refused to aide Chiang Kai-shek in his hope to \"recover the mainland,\" it continued supporting the Republic of China with military supplies and expertise to prevent Taiwan from falling into PRC hands. Through the support of the Western bloc (most Western countries continued to recognize the ROC as the sole legitimate government of China), the Republic of China on Taiwan retained China's seat in the United Nations until 1971.\n\nKorean War\n\nIn early 1950, the United States made its first commitment to form a peace treaty with Japan that would guarantee long-term U.S. military bases. Some observers (including George Kennan) believed that the Japanese treaty led Stalin to approve a plan to invade U.S.-supported South Korea on June 25, 1950. Korea had been divided at the end of World War II along the 38th parallel into Soviet and U.S. occupation zones, in which a communist government was installed in the North by the Soviets, and an elected government in the South came to power after UN-supervised elections in 1948.\n\nIn June 1950, Kim Il-sung's North Korean People's Army invaded South Korea.  Fearing that communist Korea under a Kim Il Sung dictatorship could threaten Japan  and foster other communist movements in Asia, Truman committed U.S. forces and obtained help from the United Nations to counter the North Korean invasion. The Soviets boycotted UN Security Council meetings while protesting the Council's failure to seat the People's Republic of China and, thus, did not veto the Council's approval of UN action to oppose the North Korean invasion. A joint UN force of personnel from South Korea, the United States, Britain, Turkey, Canada, Australia, France, the Philippines, the Netherlands, Belgium, New Zealand and other countries joined to stop the invasion.Fehrenbach, T. R., This Kind of War: The Classic Korean War History, Brassey's, 2001, , page 305  After a Chinese invasion to assist the North Koreans, fighting stabilized along the 38th parallel, which had separated the Koreas. Truman faced a hostile China, a Sino-Soviet partnership, and a defense budget that had quadrupled in eighteen months.\n\nThe Korean Armistice Agreement was signed in July 1953 after the death of Stalin, who had been insisting that the North Koreans continue fighting.  In North Korea, Kim Il-sung created a highly centralized and brutal dictatorship, according himself unlimited power and generating a formidable cult of personality.Oberdorfer, Don, The two Koreas: a contemporary history, Basic Books, 2001, , page 10-11No, Kum-Sok and  J. Roger Osterholm, A MiG-15 to Freedom: Memoir of the Wartime North Korean Defector who First Delivered the Secret Fighter Jet to the Americans in 1953, McFarland, 1996, \n\nHydrogen bomb\n\nA hydrogen bomb—which produced nuclear fusion instead of nuclear fission—was first tested by the United States in November 1952 and the Soviet Union in August 1953.  Such bombs were first deployed in the 1960s.\n\nCulture and media\n\nFear of a nuclear war spurred the production of public safety films by the United States federal government's Civil Defense branch that demonstrated ways on protecting oneself from a Soviet nuclear attack.  The 1951 children's film Duck and Cover is a prime example.\n\nGeorge Orwell's classic dystopia Nineteen Eighty-Four was published in 1949. The novel explores life in an imagined future world where a totalitarian government has achieved terrifying levels of power and control. With Nineteen Eighty-Four, Orwell taps into the anti-communist fears that would continue to haunt so many in the West for decades to come. In a Cold War setting his descriptions could hardly fail to evoke comparison to Soviet communism and the seeming willingness of Stalin and his successors to control those within the Soviet bloc by whatever means necessary. Orwell's famous allegory of totalitarian rule, Animal Farm, published in 1945, provoked similar anti-communist sentiments.\n\nSignificant documents\n\nThe Cold War generated innumerable documents.  The texts of 171 documents appear in The Encyclopedia of the Cold War (2008).Priscilla Mary Roberts, ed., The Encyclopedia of the Cold War:  A Political, Social, and Military History: Volume 5: Documents (2008).  isbn 978-1-85109-701-2 \n*Baruch Plan: 1946. A proposal by the U.S. to the United Nations Atomic Energy Commission (UNAEC) to a) extend between all nations the exchange of basic scientific information for peaceful ends; b) implement control of atomic  energy to the extent necessary to ensure its use only for peaceful purposes; c) eliminate from national armaments atomic weapons and all other major weapons adaptable to mass destruction; and d) establish effective safeguards by way of inspection and other means to protect complying States against the hazards of violations and evasions. When the Soviet Union was the only member state which refused to sign, the U.S. embarked on a massive nuclear weapons testing, development, and deployment program.\n*The Long Telegram and The \"X Article\", 1946–1947. Formally titled \"The Sources of Soviet Conduct\". The article describes the concepts that became the foundation of United States Cold War policy and was published in Foreign Affairs in 1947. The article was an expansion of a well-circulated top secret State Department cable called the X Article and became famous for setting forth the doctrine of containment. Though the article was signed pseudonymously by \"X,\" it was well known at the time that the true author was George F. Kennan, the deputy chief of mission of the United States to the Soviet Union from 1944 to 1946, under ambassador W. Averell Harriman.\n*NSC-68: April 14, 1950. A classified report written and issued by the United States National Security Council. The report outlined the National Security Strategy of the United States for that time and provided a comprehensive analysis of the capabilities of the Soviet Union and of the United States from military, economic, political, and psychological standpoints. NSC-68's principal thesis was that the Soviet Union intended to become the single dominant world power. The report argued that the Soviet Union had a systematic strategy aimed at the spread of communism across the entire world, and it recommended that the United States government adopt a policy of containment to stop the further spread of Soviet power. NSC-68 outlined a drastic foreign policy shift from defensive to active containment and advocated aggressive military preparedness. NSC-68 shaped government actions in the Cold War for the next 20 years and has subsequently been labeled the \"blueprint\" for the Cold War.\n*Speech by James F. Byrnes,  United States Secretary of State \"Restatement of Policy on Germany\" Stuttgart September 6, 1946.  Also known as the \"Speech of hope,\" it set the tone of future U.S. policy as it repudiated the Morgenthau Plan economic policies and gave the Germans hope for the future. The Western powers worst fear was that the poverty and hunger would drive the Germans to communism. General Lucius Clay stated \"There is no choice between being a communist on 1,500 calories a day and a believer in democracy on a thousand\". The speech was also seen as a stand against the Soviet Union because it stated the firm intention of the United States to maintain a military presence in Europe indefinitely. But the heart of the message was as Byrnes stated a month later \"The nub of our program was to win the German people ... it was a battle between us and Russia over minds\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cold War (1947–1953)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5248" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Cold War (1947–1953) is the period within the Cold War from the Truman Doctrine in 1947 to the conclusion of the Korean War in 1953. The Cold War emerged in Europe a few years after the successful US-USSR-UK coalition won World War II in Europe, and extended to 1989-91. \n\nSome conflicts between the West and the USSR appeared earlier. In 1945-46 the US and UK strongly protested Soviet political takeover efforts in Eastern Europe, while the hunt for Soviet spies made the tensions more visible.  However historians emphasize the decisive break between the US-UK and the USSR came in 1947-48 over such issues as the Truman Doctrine, the Marshall Plan and the Berlin Blockade, followed by the formation of NATO in 1949.The Cold War took place worldwide, but it had a partially different timing  outside Europe.\n\nCreation of the Eastern Bloc\n\nDuring World War II, the Soviet Union annexed several countries as Soviet Socialist Republics within the Union of Soviet Socialist Republics. Most of those countries had been ceded to it by the secret agreement portion of the Molotov-Ribbentrop Pact with Nazi Germany.Encyclopædia Britannica, German-Soviet Nonaggression Pact, 2008[http://www.fordham.edu/halsall/mod/1939pact.html Text of the Nazi-Soviet Non-Aggression Pact], executed August 23, 1939   These later annexed territories include Eastern Poland (incorporated into two different SSRs), Latvia (became Latvian SSR),Senn, Alfred Erich, Lithuania 1940 : revolution from above, Amsterdam, New York, Rodopi, 2007  Estonia (became Estonian SSR), Lithuania (became Lithuanian SSR), part of eastern Finland (became part of the Karelo-Finnish SSR)Kennedy-Pipe, Caroline, Stalin's Cold War, New York: Manchester University Press, 1995,  and northern Romania (became the Moldavian SSR).\n\nSeveral of the other countries it occupied that were not directly annexed into the Soviet Union became Soviet satellite states.  In East Germany after local election losses, a forced merger of political parties in the Socialist Unity Party (\"SED\"), followed by elections in 1946 where political opponents were oppressed. In the non-USSR annexed portion of Poland, less than a third of Poland's population voted in favor of massive communist land reforms and industry nationalizationsCurp, David, A Clean Sweep?: The Politics of Ethnic Cleansing in Western Poland, 1945–1960, Boydell & Brewer, 2006, , pages 66–69 in a policies referendum known as \"3 times YES\" (3 razy TAK; 3xTAK), whereupon a second vote rigged election was held to get the desired result.Tom Buchanan, Europe's Troubled Peace, 1945–2000: 1945–2000, Blackwell Publishing, 2005, , [https://books.google.com/books?vid\nISBN0631221638&idzeqdrL3Wzy8C&pg\nRA1-PA84&lpgRA1-PA84&ots\nsdtzUrdhbs&dqPolish+referendum+1946+falsified&sig\n5einoBUu1HWsfCzOoauJcrxCTvg Google Print, p.84][http://www.poloniatoday.com/history13.htm A brief history of Poland: Chapter 13: The Post-War Years, 1945–1990] . Polonia Today Online. Retrieved on 28 March 2007.[http://www.britannica.com/eb/article-28216 \"Poland.\"] Encyclopædia Britannica. 2007. Encyclopædia Britannica Online. Retrieved on 7 April 2007 Fraudulent Polish elections held in January 1947 resulted in Poland's official transformation to the People's Republic of Poland.\n\nThe List of World Leaders at the Beginning of these Years are as follows:\n\n1947- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Chiang Kai-shek (Allied China)\n\n1948- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Chiang Kai-shek (Allied China)\n\n1949- Clement Attlee (UK): Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Chiang Kai-shek (Allied China)\n\n1950- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\n1951- Clement Attlee (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\n1952- Winston Churchill (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\n1953- Winston Churchill (UK); Harry Truman (US); Vincent Auriol (France); Joseph Stalin (USSR); Mao Zedong (China)\n\nIn Hungary, when the Soviets installed a communist government, Mátyás Rákosi was appointed General Secretary of the Hungarian Communist Party,Sugar, Peter F., Peter Hanak and Tibor Frank, A History of Hungary, Indiana University Press, 1994, , page 375-77 which began one of the harshest dictatorships in EuropeGranville, Johanna, The First Domino: International Decision Making during the Hungarian Crisis of 1956, Texas A&M University Press, 2004. Gati, Charles, Failed Illusions: Moscow, Washington, Budapest, and the 1956 Hungarian Revolt, Stanford University Press, 2006 , page 9-12 under the People's Republic of Hungary.  In Bulgaria, toward the end of World War II, the Soviet Union crossed the border and created the conditions for a communist coup d'état on the following night. The Soviet military commander in Sofia assumed supreme authority, and the communists whom he instructed, including Kimon Georgiev (who was not a communist himself, but a member of the elitarian political organization \"Zveno\", working together with the communists), took full control of domestic politics in the People's Republic of Bulgaria.\n\nWith Soviet backing, the Communist Party of Czechoslovakia assumed undisputed control over the government of Czechoslovakia in the Czechoslovak coup d'état of 1948, ushering in a dictatorship.  In the Romanian general election elections of 1946, the Romanian Communist Party (PCR) employed widespread intimidation tactics and electoral fraud to obtain 80 percent of the vote and, thereafter, eliminated the role of the centrist parties and forced mergers, the result of which was that, by 1948, most non-Communist politicians were either executed, in exile or in prison. In the December 1945 Albanian election, the only effective ballot choices were those of the communist Democratic Front (Albania), led by Enver Hoxha.  In 1946, Albania was declared the People's Republic of Albania.\n\nInitially, Stalin directed systems in the Eastern Bloc countries that rejected Western institutional characteristics of market economies, democratic governance (dubbed \"bourgeois democracy\" in Soviet parlance) and the rule of law subduing discretional intervention by the state. They were economically communist and depended upon the Soviet Union for significant amounts of materials.  While in the first five years following World War II, massive emigration from these states to the West occurred, restrictions implemented thereafter stopped most East-West migration, except that under limited bilateral and other agreements.\n\nContainment\n\nThe immediate post-1945 period may have been the historical high point for the popularity of communist ideology. The burdens the Red Army and the Soviet Union endured had earned it massive respect which, had it been fully exploited by Joseph Stalin, had a good chance of resulting in a communist Europe. Communist parties achieved a significant popularity in such nations as China, Greece, Iran, and the Republic of Mahabad. Communist parties had already come to power in Romania, Bulgaria, Albania, and Yugoslavia. The United Kingdom and the United States were concerned that electoral victories by communist parties in any of these countries could lead to sweeping economic and political change in Western Europe.\n\nMorgenthau and Marshall Plans\n\nHaving lost 27 million people in the war, the Soviet Union was determined to destroy Germany's capacity for another war, and pushed for such in wartime conferences. The resulting Morgenthau plan policy foresaw returning Germany to a pastoral state without heavy industry. Because of the increasing costs of food imports to avoid mass-starvation in Germany, and with the danger of losing the entire nation to communism, the U.S. government abandoned the Morgenthau plan in September 1946 with Secretary of State James F. Byrnes' speech Restatement of Policy on Germany.John Gimbel [https://www.jstor.org/stable/2147827 \"On the Implementation of the Potsdam Agreement: An Essay on U.S. Postwar German Policy\"] Political Science Quarterly, Vol. 87, No. 2. (Jun., 1972), pp. 242–269.\n\nIn January 1947, Truman appointed General George Marshall as Secretary of State, and enacted JCS 1779, which decreed that an orderly and prosperous Europe requires the economic contributions of a stable and productive Germany.\" The directive comported with the view of  General Lucius D. Clay and the Joint Chief of Staff over growing communist influence in Germany, as well as of the failure of the rest of the European economy to recover without the German industrial base on which it previously had been dependent. Administration officials met with Soviet Foreign Minister Vyacheslav Molotov and others to press for an economically self-sufficient Germany, including a detailed accounting of the industrial plants, goods and infrastructure already removed by the Soviets. After six weeks of negotiations, Molotov refused the demands and the talks were adjourned. Marshall was particularly discouraged after personally meeting with Stalin, who expressed little interest in a solution to German economic problems. The United States concluded that a solution could not wait any longer.  In a June 5, 1947 speech,Marshall, George C, The Marshal Plan Speech, June 5, 1947 comporting with the Truman Doctrine, Marshall announced a comprehensive program of American assistance to all European countries wanting to participate, including the Soviet Union and those of Eastern Europe, called the Marshall Plan.\n\nFearing American political, cultural and economic penetration, Stalin eventually forbade Soviet Eastern bloc countries of the newly formed Cominform from accepting Marshall Plan aid. In Czechoslovakia, that required a Soviet-backed Czechoslovak coup d'état of 1948,Airbridge to Berlin, \"Eye of the Storm\" chapter   the brutality of which shocked Western powers more than any event so far and set in a motion a brief scare that war would occur and swept away the last vestiges of opposition to the Marshall Plan in the United States Congress.\n\nThe Greek Civil War and the Truman Doctrine\n\nBoth East and West regarded Greece as a nation well within the sphere of influence of Britain. Stalin had respected the \"percentages agreement\" with Winston Churchill to not intervene, but Yugoslavia and Albania defied the USSR's advice and sent supplies during the Greek Civil War to the army of the Communist Party of Greece, the DSE (Democratic Army of Greece). The UK had given aid to the royalist Greek forces and ELAS leaders who, failing to realize that there would be no Soviet aid and having boycotted the elections, were at a disadvantaged position. However, by 1947, the near-bankrupt British government could no longer maintain its massive overseas commitments. In addition to granting independence to India and handing back the Palestinian Mandate to the United Nations, the British government decided to withdraw from both Greece and nearby Turkey. This would have left the two nations, in particular Greece, on the brink of a communist-led revolution.\n\nNotified that British aid to Greece and Turkey would end in less than six weeks, and already hostile towards and suspicious of Soviet intentions, because of their reluctance to withdraw from Iran, the Truman administration decided that additional action was necessary.  With Congress solidly in Republican hands, and with isolationist sentiment strong among the U.S. public, Truman adopted an ideological approach. In a meeting with congressional leaders, the argument of \"apples in a barrel infected by one rotten one\" was used to convince them of the significance in supporting Greece and Turkey. It was to become the \"domino theory\". On the morning of March 12, 1947, President Harry S. Truman appeared before Congress to ask for $400 million of aid to Greece and Turkey. Calling on congressional approval for the United States to \"support free peoples who are resisting attempted subjugation by armed minorities or by outside pressures,\" or in short a policy of \"containment\", Truman articulated a presentation of the ideological struggle that became known as the \"Truman Doctrine.\" Although based on a simplistic analysis of internal strife in Greece and Turkey, it became the single dominating influence over U.S. policy until at least the Vietnam War.\n\nTruman's speech had a tremendous effect. The anti-communist feelings that had just begun to hatch in the U.S. were given a great boost, and a silenced Congress voted overwhelmingly in approval of aid. The United States would not withdraw back to the Western Hemisphere as it had after World War I. From then on, the U.S. actively engaged any communist threats anywhere in the globe under the ostensible causes of \"freedom\", \"democracy\" and \"human rights.\" The U.S. brandished its role as the leader of the \"free world.\" Meanwhile, the Soviet Union brandished its position as the leader of the \"progressive\" and \"anti-imperialist\" camp.\n\nNazi-Soviet relations and Falsifiers of History\n\nRelations further deteriorated when, in January 1948, the U.S. State Department also published a collection of documents titled Nazi-Soviet Relations, 1939–1941: Documents from the Archives of The German Foreign Office, which contained documents recovered from the Foreign Office of Nazi Germany revealing Soviet conversations with Germany regarding the Molotov-Ribbentrop Pact, including its secret protocol dividing eastern Europe, the 1939 German-Soviet Commercial Agreement, and discussions of the Soviet Union potentially becoming the fourth Axis Power.\n\nIn response, one month later, the Soviet Union published Falsifiers of History, a Stalin edited and partially re-written book attacking the West. The book did not attempt to directly counter or deal with the documents published in Nazi-Soviet Relations and rather, focused upon Western culpability for the outbreak of war in 1939. It argues that \"Western powers\" aided Nazi rearmament and aggression, including that American bankers and industrialists provided capital for the growth of German war industries, while deliberately encouraging Hitler to expand eastward.  The book also included the claim that, during the Pact's operation, Stalin rejected Hitler's offer to share in a division of the world, without mentioning the Soviet offers to join the Axis.  Historical studies, official accounts, memoirs and textbooks published in the Soviet Union used that depiction of events until the Soviet Union's dissolution.\n\nBerlin Blockade\n\nAfter the Marshall Plan, the introduction of a new currency to Western Germany to replace the debased Reichsmark and massive electoral losses for communist parties in 1946, in June 1948, the Soviet Union cut off surface road access to Berlin.  On the day of the Berlin Blockade, a Soviet representative told the other occupying powers  \"We are warning both you and the population of Berlin that we shall apply economic and administrative sanctions that will lead to circulation in Berlin exclusively of the currency of the Soviet occupation zone.\"\n\nThereafter, street and water communications were severed, rail and barge traffic was stopped and the Soviets initially stopped supplying food to the civilian population in the non-Soviet sectors of Berlin.  Because Berlin was located within the Soviet-occupied zone of Germany and the other occupying powers had previously relied on Soviet good will for access to Berlin, the only available methods of supplying the city were three limited air corridors.\n\nBy February 1948, because of massive post-war military cuts, the entire United States army had been reduced to 552,000 men.  Military forces in non-Soviet Berlin sectors totaled only 8,973 Americans, 7,606 British and 6,100 French.  Soviet military forces in the Soviet sector that surrounded Berlin totaled one and a half million men. The two United States regiments in Berlin would have provided little resistance against a Soviet attack. Believing that Britain, France and the United States had little option other than to acquiesce, the Soviet Military Administration in Germany celebrated the beginning of the blockade. Thereafter, a massive aerial supply campaign of food, water and other goods was initiated by the United States, Britain, France and other countries.MAC and the Legacy of the Berlin Airlift The Soviets derided \"the futile attempts of the Americans to save face and to maintain their untenable position in Berlin.\"[http://www.indianamilitary.org/ATTERBURYAAF/History/BerlinAirlift.html Fifty years ago, a massive airlift into Berlin showed the Soviets that a post-WW II blockade would not work], C.V. Glines   The success of the airlift eventually caused the Soviets to lift their blockade in May 1949.\n\nTito-Stalin Split\n\nAfter disagreements between Yugoslavian leader Josip Broz Tito and the Soviet Union regarding Greece and the People's Republic of Albania, a Tito–Stalin Split occurred, followed by Yugoslavia being expelled from the Cominform in June 1948 and a brief failed Soviet putsch in Belgrade.  The split created two separate communist forces in Europe.  A vehement campaign against \"Titoism\" was immediately started in the Eastern Bloc, describing agents of both the West and Tito in all places engaging in subversive activity. This resulted in the persecution of many major party cadres, including those in East Germany.\n\nNATO\n\nThe United States joined Britain, France, Canada, Denmark, Portugal, Norway, Belgium, Iceland, Luxembourg, Italy, and the Netherlands in 1949 to form the North Atlantic Treaty Organization (NATO), the United States' first \"entangling\" European alliance in 170 years. West Germany, Spain, Greece, and Turkey would later join this alliance. The Eastern leaders retaliated against these steps by integrating the economies of their nations in Comecon, their version of the Marshall Plan; exploding the first Soviet atomic device in 1949; signing an alliance with People's Republic of China in February 1950; and forming the Warsaw Pact, Eastern Europe's counterpart to NATO, in 1955. The Soviet Union, Albania, Czechoslovakia, Hungary, East Germany, Bulgaria, Romania, and Poland founded this military alliance.\n\nNSC-68\n\nU.S. officials quickly moved to escalate and expand \"containment.\" In a secret 1950 document, NSC-68, they proposed to strengthen their alliance systems, quadruple defense spending, and embark on an elaborate propaganda campaign to convince the U.S. public to fight this costly cold war. Truman ordered the development of a hydrogen bomb. In early 1950, the U.S. took its first efforts to oppose communist forces in Vietnam; planned to form a West German army, and prepared proposals for a peace treaty with Japan that would guarantee long-term U.S. military bases there.\n\nOutside Europe\n\nThe Cold War took place worldwide, but it had a partially different timing and trajectory outside Europe.Odd Arne Westad, The Cold War: A World History (Penguin UK, 2017)  pp2-7.\n\nIn Africa, decolonization took place first; it was largely accomplished in the 1950s. The main rivals then sought bases of support in the new national political alignments.James H. Meriwether, “Endangering the Security of the Free World: Africa, the United States, and the Cold War,” New England Journal of History, 64 (Fall 2007), 90–101.   In Latin America, the first major confrontation took place in Guatemala in 1954.  When the new Castro government of Cuba turned to Soviets support in 1960, Cuba became the center of the anti-American Cold War forces, supported by the Soviet Union.Richard H. Immerman, \"Guatemala as Cold War History,\" Political Science Quarterly 95#3 (1980-81): 629-653. [https://www.jstor.org/stable/2150608 online]  Lester Langley, ed. The United States, Cuba, and the Cold War; American Failure Or Communist Conspiracy? (1970) \nChinese Civil War\n\nAs Japan collapsed in 1945 the civil war resumed in China between the Kuomintang (KMT) led by Generalissimo Chiang Kai-shek and the Communist Party of China led by Mao Zedong. The USSR had signed a Treaty of Friendship with the Kuomintang in 1945 and disavowed support for the Chinese Communists. The outcome was closely fought, with the Communists finally prevailing with superior military tactics. Although the Nationalists had an advantage in numbers of men and weapons, initially controlled a much larger territory and population than their adversaries, and enjoyed considerable international support, they were exhausted by the long war with Japan and the attendant internal responsibilities. In addition, the Chinese Communists were able to fill the political vacuum left in Manchuria after Soviet forces withdrew from the area and thus gained China's prime industrial base. The Chinese Communists were able to fight their way from the north and northeast, and virtually all of mainland China was taken by the end of 1949. On October 1, 1949, Mao Zedong proclaimed the People's Republic of China (PRC). Chiang Kai-shek and 600,000 Nationalist troops and 2 million refugees, predominantly from the government and business community, fled from the mainland to the island of Taiwan. In December 1949, Chiang proclaimed Taipei the temporary capital of the Republic of China (ROC) and continued to assert his government as the sole legitimate authority in China.\n\nThe continued hostility between the Communists on the mainland and the Nationalists on Taiwan continued throughout the Cold War. Though the United States refused to aide Chiang Kai-shek in his hope to \"recover the mainland,\" it continued supporting the Republic of China with military supplies and expertise to prevent Taiwan from falling into PRC hands. Through the support of the Western bloc (most Western countries continued to recognize the ROC as the sole legitimate government of China), the Republic of China on Taiwan retained China's seat in the United Nations until 1971.\n\nKorean War\n\nIn early 1950, the United States made its first commitment to form a peace treaty with Japan that would guarantee long-term U.S. military bases. Some observers (including George Kennan) believed that the Japanese treaty led Stalin to approve a plan to invade U.S.-supported South Korea on June 25, 1950. Korea had been divided at the end of World War II along the 38th parallel into Soviet and U.S. occupation zones, in which a communist government was installed in the North by the Soviets, and an elected government in the South came to power after UN-supervised elections in 1948.\n\nIn June 1950, Kim Il-sung's North Korean People's Army invaded South Korea.  Fearing that communist Korea under a Kim Il Sung dictatorship could threaten Japan  and foster other communist movements in Asia, Truman committed U.S. forces and obtained help from the United Nations to counter the North Korean invasion. The Soviets boycotted UN Security Council meetings while protesting the Council's failure to seat the People's Republic of China and, thus, did not veto the Council's approval of UN action to oppose the North Korean invasion. A joint UN force of personnel from South Korea, the United States, Britain, Turkey, Canada, Australia, France, the Philippines, the Netherlands, Belgium, New Zealand and other countries joined to stop the invasion.Fehrenbach, T. R., This Kind of War: The Classic Korean War History, Brassey's, 2001, , page 305  After a Chinese invasion to assist the North Koreans, fighting stabilized along the 38th parallel, which had separated the Koreas. Truman faced a hostile China, a Sino-Soviet partnership, and a defense budget that had quadrupled in eighteen months.\n\nThe Korean Armistice Agreement was signed in July 1953 after the death of Stalin, who had been insisting that the North Koreans continue fighting.  In North Korea, Kim Il-sung created a highly centralized and brutal dictatorship, according himself unlimited power and generating a formidable cult of personality.Oberdorfer, Don, The two Koreas: a contemporary history, Basic Books, 2001, , page 10-11No, Kum-Sok and  J. Roger Osterholm, A MiG-15 to Freedom: Memoir of the Wartime North Korean Defector who First Delivered the Secret Fighter Jet to the Americans in 1953, McFarland, 1996, \n\nHydrogen bomb\n\nA hydrogen bomb—which produced nuclear fusion instead of nuclear fission—was first tested by the United States in November 1952 and the Soviet Union in August 1953.  Such bombs were first deployed in the 1960s.\n\nCulture and media\n\nFear of a nuclear war spurred the production of public safety films by the United States federal government's Civil Defense branch that demonstrated ways on protecting oneself from a Soviet nuclear attack.  The 1951 children's film Duck and Cover is a prime example.\n\nGeorge Orwell's classic dystopia Nineteen Eighty-Four was published in 1949. The novel explores life in an imagined future world where a totalitarian government has achieved terrifying levels of power and control. With Nineteen Eighty-Four, Orwell taps into the anti-communist fears that would continue to haunt so many in the West for decades to come. In a Cold War setting his descriptions could hardly fail to evoke comparison to Soviet communism and the seeming willingness of Stalin and his successors to control those within the Soviet bloc by whatever means necessary. Orwell's famous allegory of totalitarian rule, Animal Farm, published in 1945, provoked similar anti-communist sentiments.\n\nSignificant documents\n\nThe Cold War generated innumerable documents.  The texts of 171 documents appear in The Encyclopedia of the Cold War (2008).Priscilla Mary Roberts, ed., The Encyclopedia of the Cold War:  A Political, Social, and Military History: Volume 5: Documents (2008).  isbn 978-1-85109-701-2 \n*Baruch Plan: 1946. A proposal by the U.S. to the United Nations Atomic Energy Commission (UNAEC) to a) extend between all nations the exchange of basic scientific information for peaceful ends; b) implement control of atomic  energy to the extent necessary to ensure its use only for peaceful purposes; c) eliminate from national armaments atomic weapons and all other major weapons adaptable to mass destruction; and d) establish effective safeguards by way of inspection and other means to protect complying States against the hazards of violations and evasions. When the Soviet Union was the only member state which refused to sign, the U.S. embarked on a massive nuclear weapons testing, development, and deployment program.\n*The Long Telegram and The \"X Article\", 1946–1947. Formally titled \"The Sources of Soviet Conduct\". The article describes the concepts that became the foundation of United States Cold War policy and was published in Foreign Affairs in 1947. The article was an expansion of a well-circulated top secret State Department cable called the X Article and became famous for setting forth the doctrine of containment. Though the article was signed pseudonymously by \"X,\" it was well known at the time that the true author was George F. Kennan, the deputy chief of mission of the United States to the Soviet Union from 1944 to 1946, under ambassador W. Averell Harriman.\n*NSC-68: April 14, 1950. A classified report written and issued by the United States National Security Council. The report outlined the National Security Strategy of the United States for that time and provided a comprehensive analysis of the capabilities of the Soviet Union and of the United States from military, economic, political, and psychological standpoints. NSC-68's principal thesis was that the Soviet Union intended to become the single dominant world power. The report argued that the Soviet Union had a systematic strategy aimed at the spread of communism across the entire world, and it recommended that the United States government adopt a policy of containment to stop the further spread of Soviet power. NSC-68 outlined a drastic foreign policy shift from defensive to active containment and advocated aggressive military preparedness. NSC-68 shaped government actions in the Cold War for the next 20 years and has subsequently been labeled the \"blueprint\" for the Cold War.\n*Speech by James F. Byrnes,  United States Secretary of State \"Restatement of Policy on Germany\" Stuttgart September 6, 1946.  Also known as the \"Speech of hope,\" it set the tone of future U.S. policy as it repudiated the Morgenthau Plan economic policies and gave the Germans hope for the future. The Western powers worst fear was that the poverty and hunger would drive the Germans to communism. General Lucius Clay stated \"There is no choice between being a communist on 1,500 calories a day and a believer in democracy on a thousand\". The speech was also seen as a stand against the Soviet Union because it stated the firm intention of the United States to maintain a military presence in Europe indefinitely. But the heart of the message was as Byrnes stated a month later \"The nub of our program was to win the German people ... it was a battle between us and Russia over minds\". Cold War (1947–1953). http://en.wikipedia.org/?curid=5248."
  }
}
