{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4503",
  "eid" : "ce756810-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778426129,
  "textBody" : "The Battle of Poitiers was fought on 19 September 1356 in Nouaillé, near the city of Poitiers in Aquitaine, western France. An army of English, Welsh, Breton and Gascon troops, many of them veterans of Crécy, led by Edward, the Black Prince, defeated a larger French and allied army led by King John II of France, leading to the capture of the king, his son, and much of the French nobility.\n\nPoitiers was the second major English victory of the Edwardian phase of the Hundred Years' War. Poitiers was fought ten years after the Battle of Crécy (the first major victory), and about half a century before the third, the Battle of Agincourt (1415).\n\nThe effect of the defeat on France was catastrophic, leaving the country in the hands of the Dauphin Charles. Charles faced populist revolts across the kingdom in the wake of the battle, which had destroyed the prestige of the French upper-class. The Edwardian phase of the war would end four years later in 1360, on favourable terms for England.\n\nThe town and battle were often referred to as Poictiers in contemporaneous recordings, a name commemorated in several warships of the Royal Navy.\n\nCampaign background \n\nFollowing the death of Charles IV of France in 1328, Philip, Count of Valois, had been crowned as his successor, over his closest male relative and legal successor, Edward III of England. Edward had been reluctant to pay homage to Philip in his role as Duke of Aquitaine, resulting in Philip confiscating these lands in 1337, precipitating war between the two nations. Three years later, Edward declared himself King of France. The war had begun well for the English. They had achieved naval domination early in the war at the Battle of Sluys in 1340,Henri de Wailly. Introduction by Emmanuel Bourassin, Crecy 1346: Anatomy of a Battle (Blandford Press, Poole, Dorset 1987) p. 10 inflicted a severe defeat on the French army at Crécy in 1346, and captured Calais in 1347.\n\nIn the late 1340s and early 1350s, the Black Death decimated the population of Western Europe, bringing all significant efforts in campaigning to a halt, one such victim being Philip VI of France himself. In 1355, Edward III laid out plans for a second major campaign. His eldest son, Edward, the Black Prince, now an experienced soldier following the Crécy campaign, landed at Bordeaux in Aquitaine, leading his army on a march through southern France to Carcassonne. Unable to take the heavily fortified settlement, Edward withdrew to Bordeaux. In early 1356, the Duke of Lancaster led an army through Normandy, while Edward led his army on a great chevauchée from Bordeaux on 8 August 1356.William W. Lace, The Hundred Years' War , 1/1994\n\nEdward's forces met little resistance, sacking numerous settlements, until they reached the Loire River at Tours. They were unable to take the castle or burn the town due to a heavy rainstorm. This delay allowed King John II to attempt to pin down and destroy Edward's army. John, who had been besieging Breteuil in Normandy, organised the bulk of his army at Chartres to the north of Tours. In order to increase the speed of his army's march, he dismissed between 15,000 and 20,000 of his lower quality infantry, just as Edward turned back to Bordeaux.Jonathan Sumption, The Hundred Years' War: Vol. 2: Trial by Fire (London: Faber, 2001), pp. 223, 227–228 The French rode hard and cut in front of the English army, crossing the bridge over the Vienne at Chauvigny.  Learning of this, the Black Prince quickly moved his army south.  Historians disagree over whether the outnumbered English commander was seeking battle or trying to avoid it.  In any case, after preliminary maneuvers and failed negotiations for a truce, the two armies faced off, both ready for battle, near Poitiers on Monday, 19 September 1356.\n\nBattle \n\nPreparations \n\nEdward arrayed his army in a defensive posture among the hedges and orchards of the area, in front of the forest of Nouallie. He deployed his front line of longbowmen behind a particularly prominent thick hedge, through which the road ran at right angles. The Earl of Douglas, commanding the Scottish division in the French army, advised King John that the attack should be delivered on foot, with horses being particularly vulnerable to English arrows. John heeded this advice, leaving its baggage behind and forming up on foot in front of the English.\n\nEnglish army \n\nThe English army was led by Edward, the Black Prince, primarily comprised of English and Welsh troops, though there was a large contingent of Gascon and Breton soldiers with the army. Edward's army consisted of approximately 2,000 longbowmen, 3,000 men-at-arms and a force of 1,000 Gascon infantry.\n\nLike the earlier engagement at Crécy, the power of the English army lay in the longbow, a tall, thick self-bow made of yew. Longbows had demonstrated their effectiveness against massed infantry and cavalry in several battles, such as Falkirk in 1298, Halidon Hill in 1333 and Crécy ten years prior, in 1346. Poitiers was the second of three major English victories of the Hundred Years' War attributed to the longbow, though its effectiveness against armoured French knights and men-at-arms has been disputed.Strickland & Hardy 2005, pp. 272–278Kaiser 2003\n\nGeoffrey the Baker wrote that the English archers under the earl of Salisbury \"made their arrows prevail over the [French] knights' armor,\"Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 147 (\"coegerunt sagittas armis militaribus prevalere\") ( but the bowmen on the other flank, under Warwick, were initially ineffective against the mounted French men-at-arms who enjoyed the double protection of steel plate armor and large leather shields. Once Warwick's archers redeployed to a position where they could hit the unarmored sides and backs of the horses, however, they quickly routed the cavalry force opposing them.  The archers were also unquestionably effective against common infantry, who did not have the wealth to afford plate armour.D. Green, The Battle of Poitiers 1356, (Tempus Publishing, Charleston, S.C., 2002)Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 304\n\nThe English army was an experienced force; many archers were veterans of the earlier Battle of Crécy, and two of the key commanders, Sir John Chandos, and Captal de Buch were both experienced soldiers. The English army's divisions were led by Edward, the Black Prince, the Earl of Warwick, the Earl of Salisbury, Sir John Chandos and Captal de Buch.\n\nFrench army \n\nThe French army was led by John II of France, and was largely comprised of native French soldiers, though there was a contingent of German knights, and a large force of Scottish soldiers.  The latter force was led by the Earl of Douglas and fought in the King's own division.William F. Skene, John of Fordun’s Chronicle of the Scottish Nation, (Edinburgh Edmonston and Douglas 1872), p. 365 The French army at the battle comprised approximately 8,000 men-at-arms and 3,000 common infantry, though John had made the decision to leave behind the vast majority of his infantry, numbering up to 20,000, in order to overtake and force the English to battle.\n\nThe French army was arrayed in three \"battles\" or divisions; the vanguard was led by the Dauphin Charles, the second by the Duke of Orléans, while the third, the largest, was led by the King himself.\n\nNegotiations \n\nPrior to the battle, the local prelate, Cardinal Hélie de Talleyrand-Périgord attempted to broker a truce between the two sides, as recorded in the writings of the English commander, Sir John Chandos.Mildred K. Pope; Eleanor C. Lodge, Life of the Black Prince by the Herald of Sir John Chandos (Oxford, UK Clarendon Press 1910), p. 857 Attending the conference on the French side was John II of France, the Count of Tankerville, the Archbishop of Sens and Jean de Talaru. Representing the English was the Earl of Warwick, the Earl of Suffolk, Bartholomew de Burghersh, James Audley and Sir John Chandos. The English offered to hand over all of the war booty they had taken on their raids throughout France, as well as a seven-year truce. John, who believed his force could easily overwhelm the English, declined their proposal. John's counter suggestion that the Black Prince and his army should surrender was flatly rejected.\n\nFighting begins \n\nAt the start of the battle, the English removed their baggage train from the field, prompting a hasty French assault, believing that what they saw was the English retreating. The fighting began with a charge by a forlorn hope of 300 German knights, led by Jean de Clermont. The attack was a disaster, with many of the knights shot down or killed by English soldiery. According to Froissart, the English archers then shot their bows at the massed French infantry. The Dauphin's division reached the English line. Exhausted by a long march in heavy equipment and harassed by the hail of arrows, the division was repulsed after approximately two hours of combat.[http://home.eckerd.edu/~oberhot/poitiers.htm Battle of Poitiers]\n\nThe retreating vanguard collided with the advancing division of the Duke of Orléans, throwing the French army into chaos. Seeing the Dauphin's troops falling back, Orléans' division fell back in confusion. The third, and strongest, division led by the King advanced forth, and the two withdrawing divisions coalesced and resumed their advance against the English. Believing that the retreat of the first two French divisions marked the withdrawal of the French, Edward had ordered a force under Captal de Buch to pursue. Sir John Chandos urged the Prince to launch this force upon the main body of the French army under the King. Seizing upon this idea, Edward ordered all his men-at-arms and knights to mount for the charge, while de Buch's men, already mounted, were instructed to advance around the French left flank and rear. This section reflects the traditional narrative of the battle, which relies to a substantial extent on the chronicle of Jean Froissart.  For an alternative narrative based on the assumption that Froissart's narrative is not reliable, see Clifford J. Rogers, [https://www.academia.edu/34425406/The_Battle_of_Poitiers_1356_English_Version_ \"The Battle of Poitiers, 1356\"] (English-language version of  “La batalla de Poitiers (1356),” Desperta  Ferro. Revista de historia militar y política. Antigua y medieval 38 (2016), 28-38)\n\nCapture of King John II \n\nAs the French advanced, the English launched their charge. Stunned by the attack, the impetus carried the English and Gascon forces right into the French line. Simultaneously, de Buch's mobile reserve of mounted troops fell upon the French left flank and rear. Fearful of encirclement, the cohesion of the French army disintegrated as many soldiers attempted to flee the field. Low on arrows, the English and Welsh archers abandoned their bows and ran forward to join the melée. Around this time, King John and his son, Philip the Bold, found themselves surrounded. As written by Froissart, an exiled French knight fighting with the English, Sir Denis Morbeke of Artois approached the king, requesting the King's surrender. The King is said to have replied, \"To whom shall I yield me? Where is my cousin the Prince of Wales? If I might see him, I would speak with him\". Denis replied; \"Sir, he is not here; but yield you to me and I shall bring you to him\". The king handed him his right gauntlet, saying; \"I yield me to you\".Chronicle and romance : Froissart, Malory, Holinshed. With introd. notes and illustrations ([c1910]) The Chronicle of Froissart, translated by Lord Berners, edited by G.C. Macaulay (N.Y. Collier & Son 1910) out of copyright p. 53\n\nFollowing the surrender of the King and his son Philip, the French army had broken up and left the field, ending the battle.\n\nAftermath \n\nFollowing the battle, Edward resumed his march back to the English stronghold at Bordeaux. Jean de Venette, a Carmelite friar, vividly describes the chaos that ensued following the battle. The demise of the French nobility at the battle, only ten years from the catastrophe at Crécy, threw the kingdom into chaos. The realm was left in the hands of the Dauphin Charles, who faced popular rebellion across the kingdom in the wake of the defeat. Jean writes that the French nobles brutally repressed the rebellions, robbing, despoiling and pillaging the peasants' goods. Mercenary companies hired by both sides added to the destruction, who plundered the peasants and churches.Jean Birdsall, Richard A. Newhall, The Chronicles of Jean de Venette  (Columbia University Press 1953) p. 6\n\nCharles, to the misery of the French peasantry, began to raise additional funds to pay for the ransom of his father, and to continue the war effort. Capitalising on the discontent in France, King Edward assembled his army at Calais in 1359 and led his army on a campaign against Rheims. Unable to take Rheims or the French capital, Paris, Edward moved his army to Chartres. Later, the Dauphin Charles offered to open negotiations, and Edward agreed.\n\nThe Treaty of Brétigny was ratified on 24 October 1360, ending the Edwardian phase of the Hundred Years' War. In it, Edward agreed to renounce his claims to the French throne, in exchange for full sovereign rights over an expanded Aquitaine and Calais, essentially restoring the former Angevin Empire.\n\nNobles and men-at-arms present \n\nEnglish \n\nFroissart states these men fought with the Black Prince:\nThomas de Beauchamp, 11th Earl of Warwick\nWilliam de Ufford, 2nd Earl of Suffolk\nWilliam de Montacute, 2nd Earl of Salisbury\nJohn de Vere, 7th Earl of Oxford\nReginald de Cobham, 1st Baron Cobham\nEdward le Despencer, 1st Baron le Despencer\nLord James Audley\nLord Peter Audley\nLord Berkeley\nLord Basset\nLord Warin\nLord Delaware\nLord Manne\nLord Willoughby\nLord Bartholomew de Burghersh\nLord of Felton\nLord Richard of Pembroke\nLord Stephen of Cosington\nLord Bradetane\nLord of Pommiers\nLord of Languiran\nCaptal of Buch\nLord John the 69th of Caumont\nLord de Lesparre\nLord of Rauzan\nLord of Condon\nLord of Montferrand\nLord of Landiras\nLord Soudic of Latrau\nLord Eustace d'Aubrecicourt\nLord John of Ghistelles\nLord Daniel Pasele\nLord Denis of AmpostaJohn Bourchier; G. C. Macaulay, Chronicles of Froissart, New York: Macmillan and Co., Ltd., 1948, p. 123\nEdward le Despencer, 1st Baron le DespencerDavid Nicolle, Graham Turner, Poitiers 1356: The Capture of a King (U.K. Osprey Publishing, 2004), p. 10\nSir Thomas Felton fought not only at Poitiers but also at the Battle of Crécy.\nOne of the chief commanders at both Crécy and Poitiers was John de Vere, Earl of Oxford, mentioned above.Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 248\n\nAnother account states that John of Ghistelles perished at the Battle of Crécy so there is some ambiguity as to this individual.\n\nFrench \n\nFroissart states these men fought with King John II:\nDauphin Charles\nDuke of Anjou\nDuke of Berry\nPhilip the Bold - captured\nEarl of Douglas\nGeoffroi de Charny, carrier of the Oriflamme - killed\nDuke of Bourbon - killed\nCount of Brienne and Constable of France - killed\nJean de Clermont, Marshal of France - killed\nArnoul d'Audrehem, Marshal of France - captured\nCount of Eu - wounded and captured\nCount of Marche and Ponthieu - captured\nCount of Étampes - captured\nCount of Tancarville - captured\nRenaud de Trie, Count of Dammartin - captured\nCount of Joinville - captured\nGuillaume de Melun, Archbishop of Sens - capturedJohn Bourchier; G. C. Macaulay, Chronicles of Froissart, (New York Macmillan and Co., Ltd. 1948), p. 120John Bourchier; G. C. Macaulay, Chronicles of Froissart, (New York Macmillan and Co., Ltd. 1948), pp. 104–106Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 297",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Battle of Poitiers" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4503" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Battle of Poitiers was fought on 19 September 1356 in Nouaillé, near the city of Poitiers in Aquitaine, western France. An army of English, Welsh, Breton and Gascon troops, many of them veterans of Crécy, led by Edward, the Black Prince, defeated a larger French and allied army led by King John II of France, leading to the capture of the king, his son, and much of the French nobility.\n\nPoitiers was the second major English victory of the Edwardian phase of the Hundred Years' War. Poitiers was fought ten years after the Battle of Crécy (the first major victory), and about half a century before the third, the Battle of Agincourt (1415).\n\nThe effect of the defeat on France was catastrophic, leaving the country in the hands of the Dauphin Charles. Charles faced populist revolts across the kingdom in the wake of the battle, which had destroyed the prestige of the French upper-class. The Edwardian phase of the war would end four years later in 1360, on favourable terms for England.\n\nThe town and battle were often referred to as Poictiers in contemporaneous recordings, a name commemorated in several warships of the Royal Navy.\n\nCampaign background \n\nFollowing the death of Charles IV of France in 1328, Philip, Count of Valois, had been crowned as his successor, over his closest male relative and legal successor, Edward III of England. Edward had been reluctant to pay homage to Philip in his role as Duke of Aquitaine, resulting in Philip confiscating these lands in 1337, precipitating war between the two nations. Three years later, Edward declared himself King of France. The war had begun well for the English. They had achieved naval domination early in the war at the Battle of Sluys in 1340,Henri de Wailly. Introduction by Emmanuel Bourassin, Crecy 1346: Anatomy of a Battle (Blandford Press, Poole, Dorset 1987) p. 10 inflicted a severe defeat on the French army at Crécy in 1346, and captured Calais in 1347.\n\nIn the late 1340s and early 1350s, the Black Death decimated the population of Western Europe, bringing all significant efforts in campaigning to a halt, one such victim being Philip VI of France himself. In 1355, Edward III laid out plans for a second major campaign. His eldest son, Edward, the Black Prince, now an experienced soldier following the Crécy campaign, landed at Bordeaux in Aquitaine, leading his army on a march through southern France to Carcassonne. Unable to take the heavily fortified settlement, Edward withdrew to Bordeaux. In early 1356, the Duke of Lancaster led an army through Normandy, while Edward led his army on a great chevauchée from Bordeaux on 8 August 1356.William W. Lace, The Hundred Years' War , 1/1994\n\nEdward's forces met little resistance, sacking numerous settlements, until they reached the Loire River at Tours. They were unable to take the castle or burn the town due to a heavy rainstorm. This delay allowed King John II to attempt to pin down and destroy Edward's army. John, who had been besieging Breteuil in Normandy, organised the bulk of his army at Chartres to the north of Tours. In order to increase the speed of his army's march, he dismissed between 15,000 and 20,000 of his lower quality infantry, just as Edward turned back to Bordeaux.Jonathan Sumption, The Hundred Years' War: Vol. 2: Trial by Fire (London: Faber, 2001), pp. 223, 227–228 The French rode hard and cut in front of the English army, crossing the bridge over the Vienne at Chauvigny.  Learning of this, the Black Prince quickly moved his army south.  Historians disagree over whether the outnumbered English commander was seeking battle or trying to avoid it.  In any case, after preliminary maneuvers and failed negotiations for a truce, the two armies faced off, both ready for battle, near Poitiers on Monday, 19 September 1356.\n\nBattle \n\nPreparations \n\nEdward arrayed his army in a defensive posture among the hedges and orchards of the area, in front of the forest of Nouallie. He deployed his front line of longbowmen behind a particularly prominent thick hedge, through which the road ran at right angles. The Earl of Douglas, commanding the Scottish division in the French army, advised King John that the attack should be delivered on foot, with horses being particularly vulnerable to English arrows. John heeded this advice, leaving its baggage behind and forming up on foot in front of the English.\n\nEnglish army \n\nThe English army was led by Edward, the Black Prince, primarily comprised of English and Welsh troops, though there was a large contingent of Gascon and Breton soldiers with the army. Edward's army consisted of approximately 2,000 longbowmen, 3,000 men-at-arms and a force of 1,000 Gascon infantry.\n\nLike the earlier engagement at Crécy, the power of the English army lay in the longbow, a tall, thick self-bow made of yew. Longbows had demonstrated their effectiveness against massed infantry and cavalry in several battles, such as Falkirk in 1298, Halidon Hill in 1333 and Crécy ten years prior, in 1346. Poitiers was the second of three major English victories of the Hundred Years' War attributed to the longbow, though its effectiveness against armoured French knights and men-at-arms has been disputed.Strickland & Hardy 2005, pp. 272–278Kaiser 2003\n\nGeoffrey the Baker wrote that the English archers under the earl of Salisbury \"made their arrows prevail over the [French] knights' armor,\"Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 147 (\"coegerunt sagittas armis militaribus prevalere\") ( but the bowmen on the other flank, under Warwick, were initially ineffective against the mounted French men-at-arms who enjoyed the double protection of steel plate armor and large leather shields. Once Warwick's archers redeployed to a position where they could hit the unarmored sides and backs of the horses, however, they quickly routed the cavalry force opposing them.  The archers were also unquestionably effective against common infantry, who did not have the wealth to afford plate armour.D. Green, The Battle of Poitiers 1356, (Tempus Publishing, Charleston, S.C., 2002)Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 304\n\nThe English army was an experienced force; many archers were veterans of the earlier Battle of Crécy, and two of the key commanders, Sir John Chandos, and Captal de Buch were both experienced soldiers. The English army's divisions were led by Edward, the Black Prince, the Earl of Warwick, the Earl of Salisbury, Sir John Chandos and Captal de Buch.\n\nFrench army \n\nThe French army was led by John II of France, and was largely comprised of native French soldiers, though there was a contingent of German knights, and a large force of Scottish soldiers.  The latter force was led by the Earl of Douglas and fought in the King's own division.William F. Skene, John of Fordun’s Chronicle of the Scottish Nation, (Edinburgh Edmonston and Douglas 1872), p. 365 The French army at the battle comprised approximately 8,000 men-at-arms and 3,000 common infantry, though John had made the decision to leave behind the vast majority of his infantry, numbering up to 20,000, in order to overtake and force the English to battle.\n\nThe French army was arrayed in three \"battles\" or divisions; the vanguard was led by the Dauphin Charles, the second by the Duke of Orléans, while the third, the largest, was led by the King himself.\n\nNegotiations \n\nPrior to the battle, the local prelate, Cardinal Hélie de Talleyrand-Périgord attempted to broker a truce between the two sides, as recorded in the writings of the English commander, Sir John Chandos.Mildred K. Pope; Eleanor C. Lodge, Life of the Black Prince by the Herald of Sir John Chandos (Oxford, UK Clarendon Press 1910), p. 857 Attending the conference on the French side was John II of France, the Count of Tankerville, the Archbishop of Sens and Jean de Talaru. Representing the English was the Earl of Warwick, the Earl of Suffolk, Bartholomew de Burghersh, James Audley and Sir John Chandos. The English offered to hand over all of the war booty they had taken on their raids throughout France, as well as a seven-year truce. John, who believed his force could easily overwhelm the English, declined their proposal. John's counter suggestion that the Black Prince and his army should surrender was flatly rejected.\n\nFighting begins \n\nAt the start of the battle, the English removed their baggage train from the field, prompting a hasty French assault, believing that what they saw was the English retreating. The fighting began with a charge by a forlorn hope of 300 German knights, led by Jean de Clermont. The attack was a disaster, with many of the knights shot down or killed by English soldiery. According to Froissart, the English archers then shot their bows at the massed French infantry. The Dauphin's division reached the English line. Exhausted by a long march in heavy equipment and harassed by the hail of arrows, the division was repulsed after approximately two hours of combat.[http://home.eckerd.edu/~oberhot/poitiers.htm Battle of Poitiers]\n\nThe retreating vanguard collided with the advancing division of the Duke of Orléans, throwing the French army into chaos. Seeing the Dauphin's troops falling back, Orléans' division fell back in confusion. The third, and strongest, division led by the King advanced forth, and the two withdrawing divisions coalesced and resumed their advance against the English. Believing that the retreat of the first two French divisions marked the withdrawal of the French, Edward had ordered a force under Captal de Buch to pursue. Sir John Chandos urged the Prince to launch this force upon the main body of the French army under the King. Seizing upon this idea, Edward ordered all his men-at-arms and knights to mount for the charge, while de Buch's men, already mounted, were instructed to advance around the French left flank and rear. This section reflects the traditional narrative of the battle, which relies to a substantial extent on the chronicle of Jean Froissart.  For an alternative narrative based on the assumption that Froissart's narrative is not reliable, see Clifford J. Rogers, [https://www.academia.edu/34425406/The_Battle_of_Poitiers_1356_English_Version_ \"The Battle of Poitiers, 1356\"] (English-language version of  “La batalla de Poitiers (1356),” Desperta  Ferro. Revista de historia militar y política. Antigua y medieval 38 (2016), 28-38)\n\nCapture of King John II \n\nAs the French advanced, the English launched their charge. Stunned by the attack, the impetus carried the English and Gascon forces right into the French line. Simultaneously, de Buch's mobile reserve of mounted troops fell upon the French left flank and rear. Fearful of encirclement, the cohesion of the French army disintegrated as many soldiers attempted to flee the field. Low on arrows, the English and Welsh archers abandoned their bows and ran forward to join the melée. Around this time, King John and his son, Philip the Bold, found themselves surrounded. As written by Froissart, an exiled French knight fighting with the English, Sir Denis Morbeke of Artois approached the king, requesting the King's surrender. The King is said to have replied, \"To whom shall I yield me? Where is my cousin the Prince of Wales? If I might see him, I would speak with him\". Denis replied; \"Sir, he is not here; but yield you to me and I shall bring you to him\". The king handed him his right gauntlet, saying; \"I yield me to you\".Chronicle and romance : Froissart, Malory, Holinshed. With introd. notes and illustrations ([c1910]) The Chronicle of Froissart, translated by Lord Berners, edited by G.C. Macaulay (N.Y. Collier & Son 1910) out of copyright p. 53\n\nFollowing the surrender of the King and his son Philip, the French army had broken up and left the field, ending the battle.\n\nAftermath \n\nFollowing the battle, Edward resumed his march back to the English stronghold at Bordeaux. Jean de Venette, a Carmelite friar, vividly describes the chaos that ensued following the battle. The demise of the French nobility at the battle, only ten years from the catastrophe at Crécy, threw the kingdom into chaos. The realm was left in the hands of the Dauphin Charles, who faced popular rebellion across the kingdom in the wake of the defeat. Jean writes that the French nobles brutally repressed the rebellions, robbing, despoiling and pillaging the peasants' goods. Mercenary companies hired by both sides added to the destruction, who plundered the peasants and churches.Jean Birdsall, Richard A. Newhall, The Chronicles of Jean de Venette  (Columbia University Press 1953) p. 6\n\nCharles, to the misery of the French peasantry, began to raise additional funds to pay for the ransom of his father, and to continue the war effort. Capitalising on the discontent in France, King Edward assembled his army at Calais in 1359 and led his army on a campaign against Rheims. Unable to take Rheims or the French capital, Paris, Edward moved his army to Chartres. Later, the Dauphin Charles offered to open negotiations, and Edward agreed.\n\nThe Treaty of Brétigny was ratified on 24 October 1360, ending the Edwardian phase of the Hundred Years' War. In it, Edward agreed to renounce his claims to the French throne, in exchange for full sovereign rights over an expanded Aquitaine and Calais, essentially restoring the former Angevin Empire.\n\nNobles and men-at-arms present \n\nEnglish \n\nFroissart states these men fought with the Black Prince:\nThomas de Beauchamp, 11th Earl of Warwick\nWilliam de Ufford, 2nd Earl of Suffolk\nWilliam de Montacute, 2nd Earl of Salisbury\nJohn de Vere, 7th Earl of Oxford\nReginald de Cobham, 1st Baron Cobham\nEdward le Despencer, 1st Baron le Despencer\nLord James Audley\nLord Peter Audley\nLord Berkeley\nLord Basset\nLord Warin\nLord Delaware\nLord Manne\nLord Willoughby\nLord Bartholomew de Burghersh\nLord of Felton\nLord Richard of Pembroke\nLord Stephen of Cosington\nLord Bradetane\nLord of Pommiers\nLord of Languiran\nCaptal of Buch\nLord John the 69th of Caumont\nLord de Lesparre\nLord of Rauzan\nLord of Condon\nLord of Montferrand\nLord of Landiras\nLord Soudic of Latrau\nLord Eustace d'Aubrecicourt\nLord John of Ghistelles\nLord Daniel Pasele\nLord Denis of AmpostaJohn Bourchier; G. C. Macaulay, Chronicles of Froissart, New York: Macmillan and Co., Ltd., 1948, p. 123\nEdward le Despencer, 1st Baron le DespencerDavid Nicolle, Graham Turner, Poitiers 1356: The Capture of a King (U.K. Osprey Publishing, 2004), p. 10\nSir Thomas Felton fought not only at Poitiers but also at the Battle of Crécy.\nOne of the chief commanders at both Crécy and Poitiers was John de Vere, Earl of Oxford, mentioned above.Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 248\n\nAnother account states that John of Ghistelles perished at the Battle of Crécy so there is some ambiguity as to this individual.\n\nFrench \n\nFroissart states these men fought with King John II:\nDauphin Charles\nDuke of Anjou\nDuke of Berry\nPhilip the Bold - captured\nEarl of Douglas\nGeoffroi de Charny, carrier of the Oriflamme - killed\nDuke of Bourbon - killed\nCount of Brienne and Constable of France - killed\nJean de Clermont, Marshal of France - killed\nArnoul d'Audrehem, Marshal of France - captured\nCount of Eu - wounded and captured\nCount of Marche and Ponthieu - captured\nCount of Étampes - captured\nCount of Tancarville - captured\nRenaud de Trie, Count of Dammartin - captured\nCount of Joinville - captured\nGuillaume de Melun, Archbishop of Sens - capturedJohn Bourchier; G. C. Macaulay, Chronicles of Froissart, (New York Macmillan and Co., Ltd. 1948), p. 120John Bourchier; G. C. Macaulay, Chronicles of Froissart, (New York Macmillan and Co., Ltd. 1948), pp. 104–106Edward Maunde Thompson, Chronicle of Geoffrey le Baker, (Oxford at the Clarendon Press 1889) p. 297. Battle of Poitiers. http://en.wikipedia.org/?curid=4503."
  }
}
