{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12905",
  "eid" : "0570b950-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778518373,
  "textBody" : "The goth subculture adopts dark fashion elements such as black clothing, dyed black hair, dark eyeliner, black fingernails, and black period-styled clothingEric Lipton [http://www.lettuce.org/clipGoff.htm Disturbed Shooters Weren't True Goth] from the Chicago Tribune, 27 April 1999 and a focus on gothic rock and a range of other music genres. The goth subculture began in England during the early 1980s where it was developed from the gothic rock scene, itself an offshoot of the post-punk genre. Notable post-punk groups that presaged that genre include Siouxsie and the Banshees, Joy Division and Bauhaus. The goth subculture has survived much longer than others of the same era, and has continued to diversify and spread throughout the world. Its imagery and cultural proclivities indicate influences from the 19th century Gothic literature and gothic horror films.\n\nThe goth subculture has associated tastes in music, aesthetics, and fashion. The music of the goth subculture encompasses a number of different styles, including gothic rock, industrial, deathrock, post-punk, darkwave, ethereal wave and neoclassical. Styles of dress within the subculture range from deathrock, punk and Victorian styles, or combinations of the above, most often with dark attire (often black), pale face makeup and black hair. The scene continues to draw interest from a large audience decades after its emergence.  In Western Europe, there are large annual festivals, mainly in Germany.\n\nMusic\n\nOrigins and development\n\nThe term \"gothic rock\" was coined in 1967, by music critic John Stickney to describe a meeting he had with Jim Morrison in a dimly lit wine-cellar which he called \"the perfect room to honor the Gothic rock of the Doors\". Posted at  That same year, Velvet Underground with a track like \"All Tomorrow's Parties\", created a kind of \"mesmerizing gothic-rock masterpiece\" according to music historian Kurt Loder. In the late 1970s, the \"gothic\" adjective was used to describe the atmosphere of post-punk bands like Siouxsie and the Banshees, Magazine, and Joy Division. In a live review about a Siouxsie and the Banshees' concert in July 1978, critic Nick Kent wrote that concerning their music, \"parallels and comparisons can now be drawn with gothic rock architects like the Doors and, certainly, early Velvet Underground\". In March 1979, in his review of Magazine's second album Secondhand Daylight, Kent noted that there was \"a new austere sense of authority\" in the music, with a \"dank neo-Gothic sound\". Later that year, the term was also used by Joy Division's manager, Tony Wilson on 15 September in an interview for the BBC TV programme's Something Else: Wilson described Joy Division as \"gothic\" compared to the pop mainstream, right before a live performance of the band. The term was later applied to \"newer bands such as Bauhaus who had arrived in the wake of Joy Division and Siouxsie and the Banshees\". Bauhaus's first single issued in 1979, \"Bela Lugosi's Dead\", is generally credited as the starting point of the gothic rock genre.\n\nIn 1979, Sounds described Joy Division as \"Gothic\" and \"theatrical\". In February 1980, Melody Maker qualified the same band as \"masters of this Gothic gloom\". Critic Jon Savage would later say that their singer Ian Curtis wrote \"the definitive Northern Gothic statement\". However, it was not until the early-1980s that gothic rock became a coherent music subgenre within post-punk, and that followers of these bands started to come together as a distinctly recognizable movement. They may have taken the \"goth\" mantle from a 1981 article published in UK rock weekly Sounds: \"The face of Punk Gothique\", written by Steve Keaton. In a text about the audience of UK Decay, Keaton asked: \"Could this be the coming of Punk Gothique? With Bauhaus flying in on similar wings could it be the next big thing?\" In July 1982, the opening of the Batcave in London's Soho provided a prominent meeting point for the emerging scene, which would be briefly labelled \"positive punk\" by the NME in a special issue with a front cover in early 1983. The term \"Batcaver\" was then used to describe old-school goths.\n\nIndependent from the British scene, in the late 1970s and early 1980s in California, deathrock developed as a distinct branch of American punk rock, with acts such as Christian Death and 45 Grave.\n\nGothic genre\n\nThe bands that defined and embraced the gothic rock genre included Bauhaus,  early Adam and the Ants, the Cure, the Birthday Party, Southern Death Cult, Specimen, Sex Gang Children, UK Decay, Virgin Prunes, Killing Joke, and the Damned. Near the peak of this first generation of the gothic scene in 1983, The Face Paul Rambali recalled that there were \"several strong Gothic characteristics\" in the music of Joy Division. In 1984, Joy Division's bassist Peter Hook named Play Dead as one of their heirs: \"If you listen to a band like Play Dead, who I really like, Joy Division played the same stuff that Play Dead are playing. They're similar.\"\n\nBy the mid-1980s, bands began proliferating and became increasingly popular, including the Sisters of Mercy, the Mission (known as the Mission UK in the US), Alien Sex Fiend, the March Violets, Xmal Deutschland, the Membranes, and Fields of Nephilim. Record labels like Factory, 4AD and Beggars Banquet released much of this music in Europe, and through a vibrant import music market in the US, the subculture grew, especially in New York and Los Angeles, California, where many nightclubs featured \"gothic/industrial\" nights. The popularity of 4AD bands resulted in the creation of a similar US label, Projekt, which produces what was colloquially termed ethereal wave, a subgenre of dark wave music.\n\nThe 1990s saw further growth for some 1980s bands and the emergence of many new acts, as well as new goth-centric U.S. record labels such as Cleopatra Records, among others. According to Dave Simpson of The Guardian, \"in the 90s, goths all but disappeared as dance music became the dominant youth cult\". As a result, the goth \"movement went underground and mistaken for cyber goth, Shock rock, Industrial metal, Gothic metal, Medieval folk metal and the latest subgenre, horror punk\". Marilyn Manson was seen as a \"goth-shock icon\" by Spin.\n\nArt: historical and cultural influences\n\nThe Goth subculture of the 1980s drew inspiration from a variety of sources. Some of them were modern or contemporary, others were centuries-old or ancient. Michael Bibby and Lauren M. E. Goodlad liken the subculture to a bricolage. Among the music subcultures that influenced it were Punk, New wave, and Glam. But it also drew inspiration from B movies, Gothic literature, horror films, vampire cults, Neo-noir science fiction films such as Ridley Scott's Blade Runner, and traditional mythology. Among the mythologies that proved influential in Goth were Celtic mythology, Christian mythology, Egyptian mythology, and various traditions of Paganism.\n\nThe figures that the movement counted among its historic canon of ancestors were equally diverse. They included the Pre-Raphaelite Brotherhood, Friedrich Nietzsche (1844‒1900), Comte de Lautréamont (1846‒1870), Salvador Dalí (1904‒1989) and Jean-Paul Sartre (1905‒1980). Writers that have had a significant influence on the movement also represent a diverse canon. They include Ann Radcliffe (1764‒1823), John William Polidori (1795‒1821), Edgar Allan Poe (1809‒1849), Sheridan Le Fanu (1814-1873), Bram Stoker (1847‒1912), Oscar Wilde (1854‒1900), H. P. Lovecraft (1890‒1937), Anne Rice (1941‒), William Gibson (1948‒), Ian McEwan (1948‒), Storm Constantine (1956‒), and Poppy Z. Brite (1967‒).\n\n18th and 19th centuries\n\nGothic literature is a genre of fiction that combines romance and dark elements to produce mystery, suspense, terror, horror and the supernatural. According to David H. Richter, settings were framed to take place at \"…ruinous castles, gloomy churchyards, claustrophobic monasteries, and lonely mountain roads\". Typical characters consisted of the cruel parent, sinister priest, courageous victor, and the helpless heroine, along with supernatural figures such as demons, vampires, ghosts, and monsters. Often, the plot focused on characters ill-fated, internally conflicted, and innocently victimized by harassing malicious figures. In addition to the dismal plot focuses, the literary tradition of the gothic was to also focus on individual characters that were gradually going insane.\n\nEnglish author Horace Walpole, with his 1764 novel The Castle of Otranto is one of the first writers who explored this genre. The American Revolutionary War-era \"American Gothic\" story of the Headless Horseman, immortalized in \"The Legend of Sleepy Hollow\" (published in 1820) by Washington Irving, marked the arrival in the New World of dark, romantic storytelling. The tale was composed by Irving while he was living in England, and was based on popular tales told by colonial Dutch settlers of the Hudson Valley, New York. The story would be adapted to film in 1922, in 1949 as the animated The Adventures of Ichabod and Mr. Toad,\"The American Film Institute, catalog of motion pictures, Volume 1, Part 1, Feature films 1941-1950, The Adventures of Ichabod and Mr Toad\" and again in 1999.\n\nThroughout the evolution of the goth subculture, classic romantic, Gothic and horror literature has played a significant role. E. T. A. Hoffmann (1776–1822), Edgar Allan Poe \"Severin admits his band (Siouxsie and the Banshees) pored over gothic literature - Edgar Allan Poe and Charles Baudelaire\". (1809–1849), Charles Baudelaire (1821–1867), H. P. Lovecraft (1890–1937), and other tragic and romantic writers have become as emblematic of the subculture as the use of dark eyeliner or dressing in black. Baudelaire, in fact, in his preface to Les Fleurs du mal (Flowers of Evil) penned lines that could serve as a sort of goth malediction:\n\nC'est l'Ennui! —l'œil chargé d'un pleur involontaire,\nIl rêve d'échafauds en fumant son houka.\nTu le connais, lecteur, ce monstre délicat,\n—Hypocrite lecteur,—mon semblable,—mon frère!\n\nIt is Boredom! — an eye brimming with an involuntary tear,\nHe dreams of the gallows while smoking his water-pipe.\nYou know him, reader, this delicate monster,\n—Hypocrite reader,—my twin,—my brother!\n\nVisual art influences\n\nThe gothic subculture has influenced different artists—not only musicians—but also painters and photographers. In particular their work is based on mystic, morbid and romantic motifs. In photography and painting the spectrum varies from erotic artwork to romantic images of vampires or ghosts. There is a marked preference for dark colours and sentiments, similar to Gothic fiction. At the end of the 19th century, painters like John Everett Millais and John Ruskin invented a new kind of Gothic.\n\n20th century influences\n\nSome people credit the band Bauhaus' first single \"Bela Lugosi's Dead\", released in August 1979, with the start of goth subculture.\n\n21st century\n\nThe British sitcom, The IT Crowd featured a recurring goth character named Richmond Avenal, played by Noel Fielding. Fielding said in an interview that he himself had been a goth at age fifteen and that he had a series of goth girlfriends. This was the first time he dabbled in makeup. Fielding said that he loved his girlfriends dressing him up.[https://www.theguardian.com/culture/2013/feb/01/noel-fielding-interview Noel Fielding: rocking a new look]. The Guardian. Author - Simon Hattenstone. Published 1 February 2013. Retrieved 28 July 2017.\n\nCharacteristics of the scene\n\nIcons\n\nNotable examples of goth icons include several bandleaders: Siouxsie Sioux, of Siouxsie and the Banshees; Robert Smith, of The Cure; Peter Murphy, of Bauhaus; Rozz Williams, of Christian Death; Ian Curtis, of Joy Division; and Dave Vanian, of The Damned. Some members of Bauhaus were, themselves, fine art students or active artists. Nick Cave was dubbed as \"the grand lord of gothic lushness\". Nico is also a notable icon of goth fashion and music, with pioneering records like The Marble Index and Desertshore and the persona she adopted after their release.\n\nFashion\n\nGothic fashion is stereotyped as conspicuously dark, eerie, mysterious, complex and exotic. Goth fashion can be recognized by its stark black clothing. Typical gothic fashion includes dyed black hair, dark eyeliner, black fingernails and black period-styled clothing; goths may or may not have piercings. Styles are often borrowed from the Elizabethan, Victorian or medieval period and often express pagan, occult or other religious imagery.\n\nTed Polhemus described goth fashion as a \"profusion of black velvets, lace, fishnets and leather tinged with scarlet or purple, accessorized with tightly laced corsets, gloves, precarious stilettos and silver jewelry depicting religious or occult themes\". Cited in . Researcher Maxim W. Furek stated that \"Goth is a revolt against the slick fashions of the 1970s disco era and a protest against the colourful pastels and extravagance of the 1980s. Black hair, dark clothing and pale complexions provide the basic look of the Goth Dresser. One can paradoxically argue that the Goth look is one of deliberate overstatement as just a casual look at the heavy emphasis on dark flowing capes, ruffled cuffs, pale makeup and dyed hair demonstrate a modern-day version of late-Victorian excess\". Gothic fashion may also feature silver jewelry.\n\nThe New York Times noted: \"The costumes and ornaments are a glamorous cover for the genre's somber themes. In the world of Goth, nature itself lurks as a malign protagonist, causing flesh to rot, rivers to flood, monuments to crumble and women to turn into slatterns, their hair streaming and lipstick askew\". Present-day fashion designers such as John Paul Gaultier, Alexander McQueen, and John Galliano have also been described as practising \"haute goth\".\n\nFilms\n\nSome of the early gothic rock and deathrock artists adopted traditional horror film images and drew on horror film soundtracks for inspiration. Their audiences responded by adopting appropriate dress and props. Use of standard horror film props like swirling smoke, rubber bats, and cobwebs featured as gothic club décor from the beginning in The Batcave. Such references in bands' music and images were originally tongue-in-cheek, but as time went on, bands and members of the subculture took the connection more seriously. As a result, morbid, supernatural and occult themes became more noticeably serious in the subculture. The interconnection between horror and goth was highlighted in its early days by The Hunger, a 1983 vampire film starring David Bowie, Catherine Deneuve and Susan Sarandon. The film featured gothic rock group Bauhaus performing Bela Lugosi's Dead in a nightclub. Tim Burton created a storybook atmosphere filled with darkness and shadow in some of his films like Beetlejuice (1988), Batman (1989), Edward Scissorhands (1990), and the stop motion films The Nightmare Before Christmas (1993), which was produced/co-written by Burton, and Corpse Bride (2005), which he co-produced.\n\nAs the subculture became well-established, the connection between goth and horror fiction became almost a cliché, with goths quite likely to appear as characters in horror novels and film. For example, The Craft, The Crow, The Matrix and Underworld film series drew directly on goth music and style. The dark comedies Beetlejuice, The Faculty, American Beauty, Wedding Crashers and a few episodes of the animated TV show South Park portray or parody the goth subculture. In South Park, several of the fictional schoolchildren are depicted as goths. The goth kids on the show are depicted as finding it annoying to be confused with the Hot Topic \"vampire\" kids from the episode \"The Ungroundable\" in season 12.Modell, Josh (2008-11-19). \"The Ungroundable\". The A.V. Club.Fickett, Travis (2008-11-20). \"IGN: The Ungroundable Review\". IGN. News Corporation. Retrieved 2008-11-23. and even more frustrating to be compared with emo kids. The goth kids are usually depicted listening to goth music, writing or reading Gothic poetry, drinking coffee, flipping their hair and smoking.Modell, Josh (2008-11-19). \"The Ungroundable\". The A.V. Club.\n\nBooks and magazines\n\nA prominent American literary influence on the gothic scene was provided by Anne Rice's re-imagining of the vampire in 1976. In The Vampire Chronicles, Rice's characters were depicted as self-tormentors who struggled with alienation, loneliness, and the human condition. Not only did the characters torment themselves, but they also depicted a surreal world that focused on uncovering its splendor. These Chronicles assumed goth attitudes, but they were not intentionally created to represent the gothic subculture. Their romance, beauty, and erotic appeal attracted\nmany goth readers, making her works popular from the 1980s through the 1990s. While Goth has embraced Vampire literature both in its 19th-century form and in its later incarnations, Rice's postmodern take on the vampire mythos has had a \"special resonance\" in the subculture. Her vampire novels feature intense emotions, period clothing, and \"cultured decadence\". Her vampires are socially alienated monsters, but they are also stunningly attractive. Rice's goth readers tend to envision themselves in much the same terms and view characters like Lestat de Lioncourt as role models.\n\nThe re-imagining of the vampire continued with the release of Poppy Z. Brite's book Lost Souls in October 1992. Despite the fact that Brite's first novel was criticized by some mainstream sources for allegedly \"lack[ing] a moral center: neither terrifyingly malevolent supernatural creatures nor (like Anne Rice's protagonists) tortured souls torn between good and evil, these vampires simply add blood-drinking to the amoral panoply of drug abuse, problem drinking and empty sex practiced by their human counterparts\", many of these so-called \"human counterparts\" identified with the teen angst and goth music references therein, keeping the book in print. Upon release of a special 10th anniversary edition of Lost Souls, Publishers Weekly—the same periodical that criticized the novel's \"amorality\" a decade prior—deemed it a \"modern horror classic\" and acknowledged that Brite established a \"cult audience\".\n\nNeil Gaiman's graphic novel series The Sandman influenced goths with characters like the dark, brooding Dream and his sister Death. The 2002 release 21st Century Goth by Mick Mercer, an author, noted music journalist and leading historian of gothic rock,Blu [http://www.starvox.net/intview/mm.htm Interview with Mick Mercer] Starvox.netKyshah Hell [http://www.morbidoutlook.com/lifestyle/articles/2002_06_mickmercer.html Interview with Mick Mercer] Morbidoutlook.com[http://www.brokenanklebooks.com/AuthorsMercer.htm Mick Mercer]  Broken Ankle Books explored the modern state of the goth scene around the world, including South America, Japan, and mainland Asia. His previous 1997 release, Hex Files: The Goth Bible, similarly took an international look at the subculture.\n\nIn the US, Propaganda was a gothic subculture magazine founded in 1982. In Italy, Ver Sacrum covers the Italian goth scene, including fashion, sexuality, music, art and literature. Some magazines, such as the now-defunct Dark Realms[http://www.monolithgraphics.com/darkrealms.html Dark Realms] and Goth Is Dead included goth fiction and poetry. Other magazines cover fashion (e.g., Gothic Beauty); music (e.g., Severance) or culture and lifestyle (e.g., Althaus e-zine).\n\nGraphic art\n\nVisual contemporary graphic artists with this aesthetic include Gerald Brom, Luis Royo, Dave McKean, Trevor Brown, Victoria Francés, as well as illustrators Edward Gorey, Charles Addams, Lorin Morgan-Richards, and James O'Barr. H. R. Giger of Switzerland is one of the first graphic artists to make serious contributions to the gothic/industrial look of much of modern cinema with his work on the 1979 film Alien by Ridley Scott. The artwork of Polish surrealist painter Zdzisław Beksiński is often described as gothic. British artist Anne Sudworth published a book on gothic art in 2007.\n\nEvents\n\nThe goth scene continues to exist in the 2010s. In Western Europe, there are large annual festivals mainly in Germany, including Wave-Gotik-Treffen (Leipzig) and M'era Luna (Hildesheim), both annually attracting tens of thousands of attendees. The Lumous Gothic Festival (more commonly known as Lumous) is the largest festival dedicated to the goth subculture in Finland and the northernmost gothic festival in the world. The Ukrainian festival \"Deti Nochi: Chorna Rada\" (Children of the night) is the biggest gothic event in Ukraine. Goth events like \"Ghoul School\" and \"Release the Bats\" promote deathrock and are attended by fans from many countries, and events such as the Drop Dead Festival in the US attract attendees from over 30 countries. The Whitby Goth Weekend is a twice-yearly goth music festival in Whitby, North Yorkshire, England. In the US, events such as Bats Day in the Fun Park celebrate the culture, as well as the Goth Cruise, and the Gothic Cruise.\n\nInterior design \n\nIn the 1980s, goths decorated their walls and ceiling with black fabrics and accessories like rosaries, crosses and plastic roses. Black furniture and cemetery-related objects like candlesticks, death lanterns and skulls. In the 1990s the interior design approach of the 1980s was replaced by a less macabre style.\n\nSociology\n\nGender and sexuality\n\nSince the late 1970s, the UK goth scene refused \"traditional standards of sexual propriety\" and accepted and celebrated \"unusual, bizarre or deviant sexual practices\". In the 2000s, many members \"... claim overlapping memberships in the queer, polyamorous, bondage-discipline/sadomasochism, and pagan communities\".\n\nWomen in the goth scene tend to be more independent: The \"... [s]cene's celebration of active sexuality\" enables goth women \"... to resist mainstream notions of passive femininity\". They have an \"active sexuality\" approach which creates \"gender egalitarianism\" within the scene, as it \"allows them to engage in sexual play with multiple partners while sidestepping most of the stigma and dangers that women who engage in such behavior\" outside the scene frequently incur, while continuing to \"... see themselves as strong\".\n\nMen dress up in androgynous way: \"... Men 'gender blend,' wearing makeup and skirts\". In contrast, the \"... women are dressed in sexy feminine outfits\" that are \"... highly sexualized\" and which often combine \"... corsets with short skirts and fishnet stockings\". Androgyny is common among the scene: \"... androgyny in Goth subcultural style often disguises or even functions to reinforce conventional gender roles\". It was only \"valorised\" for male goths, who adopt a \"feminine\" appearance, including \"make-up, skirts and feminine accessories\" to \"enhance masculinity\" and facilitate traditional heterosexual courting roles.\n\nIdentity\n\nWhile goth is \"considered a music-based scene\", \"... to be Goth implies much more than shared musical tastes; it is ... an 'aesthetic,' a particular way of seeing and of being seen\". Observers have raised the issue of to what degree individuals are truly members of the goth subculture. On one end of the spectrum is the \"Uber goth\", a person who is described as seeking a pallor so much that he or she applies \"... as much white foundation and white powder as possible\". On the other end of the spectrum another writer terms \"poseurs\": \"goth wannabes, usually young kids going through a goth phase who do not hold to goth sensibilities but want to be part of the goth crowd..\". It has been said that a \"mall goth\" is a teen who dresses in a goth style and spends time in malls with a Hot Topic store, but who does not know much about the goth subculture or its music, thus making him or her a poseur. In one case, even a well-known performer has been labelled with the pejorative term: a \"number of goths, especially those who belonged to this subculture before the late-1980s, reject Marilyn Manson as a poseur who undermines the true meaning of goth\".\n\nMedia and academic commentary\n\nThe BBC described academic research that indicated that goths are \"refined and sensitive, keen on poetry and books, not big on drugs or anti-social behaviour\". Teens often stay in the subculture \"into their adult life\", and they are likely to become well-educated and enter professions such as medicine or law. The subculture carries on appealing to teenagers who are looking for meaning and for identity. The scene teaches teens that there are difficult aspects to life that you \"have to make an attempt to understand\" or explain.\n\nThe Guardian reported that a \"glue binding the [goth] scene together was drug use\"; however, in the scene, drug use was varied. Goth is one of the few subculture movements that is not associated with a single drug, in the way that the Hippie subculture is associated with cannabis and the Mod subculture is associated with amphetamines. A 2006 study of young goths found that those with higher levels of goth identification had higher drug use.\n\nMedia perceptions on violence and self-harm\n\nThe goth scene is often described as non-violent. However, two non peer-reviewed studies by the A.S.H.A. concluded a higher than average propensity toward violence, and for one of the papers, self-harm, within the goth subculture.\n\nSchool shootings\n\nIn the weeks following the 1999 Columbine High School massacre, media reports about the teen gunmen, Harris and Klebold, portrayed them as part of a gothic cult. An increased suspicion of goth subculture subsequently manifested in the media. This led to a moral panic over teen involvement in goth subculture and a number of other activities, such as violent video games. Harris and Klebold had initially been thought to be members of \"The Trenchcoat Mafia\"; an informal club within Columbine High School. Later, such characterizations were considered incorrect.\n\nMedia reported that the gunman in the 2006 Dawson College shooting in Montreal, Quebec, Kimveer Singh Gill, was interested in goth subculture.14 September 2006. [http://www.side-line.com/news_comments.php?id\n17308_0_2_0_C Shooting by Canadian trench coat killer affects industrial / goth scene] Side-line.com. Retrieved on 13 March 2007. Gill's self-professed love of Goth culture was the topic of media interest, and it was widely reported that the word \"Goth\", in Gill's writings, was a reference to the alternative industrial and goth subculture rather than a reference to gothic rock music. Gill, who committed suicide after the attack, wrote in his online journal: \"I'm so sick of hearing about jocks and preps making life hard for the goths and others who look different, or are different\". Gill described himself in his profile on Vampirefreaks.com as \"... Trench ... the Angel of Death\" and he stated that \"Metal and Goth kick ass\".[http://www.cbc.ca/canada/story/2006/09/14/gunman-shooting.html CBC News: Montreal gunman called himself 'angel of death'] An image gallery on Gill's Vampirefreaks.com blog had photos of him pointing a gun at the camera or wearing a long black trench coat.[http://www.canada.com/topics/news/features/dawsonshooting/story.html?id689b60e6-7ded-447c-b9b9-3d6ff521107b&k\n89135 canada.com]  \n\nMick Mercer stated that Gill was \"not a Goth. Never a Goth. The bands he listed as his chosen form of ear-bashing were relentlessly metal and standard grunge, rock and goth metal, with some industrial presence\". Mercer stated that \"Kimveer Gill listened to metal\", \"He had nothing whatsoever to do with Goth\" and further commented \"I realise that like many Neos [neophyte], Kimveer Gill may even have believed he somehow was a Goth, because they're [Neophytes] only really noted for spectacularly missing the point\".Mick Mercer [http://mickmercer.liejournal.com/672571.html Mick Mercer talks about Kimveer Gill] mickmercer.livejournal.com\n\nPrejudice and violence directed at goths\n\nIn part because of public misunderstanding surrounding gothic aesthetics, people in the goth subculture sometimes suffer prejudice, discrimination, and intolerance. As is the case with members of various other subcultures and alternative lifestyles, outsiders sometimes marginalize goths, either by intention or by accident. Actress Christina Hendricks talked of being bullied as a goth in school and how difficult it was for her to deal with societal pressure: \"Kids can be pretty judgmental about people who are different. But instead of breaking down and conforming, I stood firm. That is also probably why I was unhappy. My mother was mortified and kept telling me how horrible and ugly I looked. Strangers would walk by with a look of shock on their face, so I never felt pretty. I just always felt awkward\".http://www.telegraph.co.uk/news/celebritynews/9088143/Christina-Hendricks-I-was-bullied-at-school-for-being-a-goth.html Prejudice moves people into circles of bonding where they share these similar experiences and are accepted. Young goths have to define themselves and learn beauty is an aspect of cultural relativism.\n\nOn 11 August 2007, a couple walking through Stubbylee Park in Bacup, Lancashire, England were attacked by a group of teenagers because they were goths. Sophie Lancaster subsequently died from her injuries. On 29 April 2008, two teens, Ryan Herbert and Brendan Harris, were convicted for the murder of Lancaster and given life sentences; three others were given lesser sentences for the assault on her boyfriend Robert Maltby. In delivering the sentence, Judge Anthony Russell stated, \"This was a hate crime against these completely harmless people targeted because their appearance was different to yours\". He went on to defend the goth community, calling goths \"perfectly peaceful, law-abiding people who pose no threat to anybody\". Judge Russell added that he \"recognised it as a hate crime without Parliament having to tell him to do so and had included that view in his sentencing\". Despite this ruling, a bill to add discrimination based on subculture affiliation to the definition of hate crime in British law was not presented to parliament.\n\nIn 2013, police in Manchester announced they would be treating attacks on members of alternative subcultures, like goths, the same as they do for attacks based on race, religion, and sexual orientation.\n\nSelf-harm study\n\nA study published on the British Medical Journal concluded that \"identification as belonging to the Goth subculture [at some point in their lives] was the best predictor of self harm and attempted suicide [among young teens]\", and that it was most possibly due to a selection mechanism (persons that wanted to harm themselves later identified as goths, thus raising the percentage of those persons who identify as goths). According to The Guardian, some goth teens are at more likely to harm themselves or attempt suicide. A medical journal study of 1,300 Scottish schoolchildren until their teen years found that the 53% of the goth teens had attempted to harm themselves and 47% had attempted suicide. The study found that the \"correlation was stronger than any other predictor\".Polly Curtis and John Carvel. \"Teen goths more prone to suicide, study shows\". The Guardian, Friday 14 April 2006 The study was based on a sample of 15 teenagers who identified as goths, of which 8 had self-harmed by any method, 7 had self-harmed by cutting, scratching or scoring, and 7 had attempted suicide.\n\nThe authors held that most self-harm by teens was done before joining the subculture, and that joining the subculture would actually protect them and help them deal with distress in their lives. The authors insisted on the study being based on small numbers and on the need of replication to confirm the results. The study was criticized for using only a small sample of goth teens and not taking into account other influences and differences between types of goths; by taking a study from a larger number of people.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Goth subculture" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12905" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The goth subculture adopts dark fashion elements such as black clothing, dyed black hair, dark eyeliner, black fingernails, and black period-styled clothingEric Lipton [http://www.lettuce.org/clipGoff.htm Disturbed Shooters Weren't True Goth] from the Chicago Tribune, 27 April 1999 and a focus on gothic rock and a range of other music genres. The goth subculture began in England during the early 1980s where it was developed from the gothic rock scene, itself an offshoot of the post-punk genre. Notable post-punk groups that presaged that genre include Siouxsie and the Banshees, Joy Division and Bauhaus. The goth subculture has survived much longer than others of the same era, and has continued to diversify and spread throughout the world. Its imagery and cultural proclivities indicate influences from the 19th century Gothic literature and gothic horror films.\n\nThe goth subculture has associated tastes in music, aesthetics, and fashion. The music of the goth subculture encompasses a number of different styles, including gothic rock, industrial, deathrock, post-punk, darkwave, ethereal wave and neoclassical. Styles of dress within the subculture range from deathrock, punk and Victorian styles, or combinations of the above, most often with dark attire (often black), pale face makeup and black hair. The scene continues to draw interest from a large audience decades after its emergence.  In Western Europe, there are large annual festivals, mainly in Germany.\n\nMusic\n\nOrigins and development\n\nThe term \"gothic rock\" was coined in 1967, by music critic John Stickney to describe a meeting he had with Jim Morrison in a dimly lit wine-cellar which he called \"the perfect room to honor the Gothic rock of the Doors\". Posted at  That same year, Velvet Underground with a track like \"All Tomorrow's Parties\", created a kind of \"mesmerizing gothic-rock masterpiece\" according to music historian Kurt Loder. In the late 1970s, the \"gothic\" adjective was used to describe the atmosphere of post-punk bands like Siouxsie and the Banshees, Magazine, and Joy Division. In a live review about a Siouxsie and the Banshees' concert in July 1978, critic Nick Kent wrote that concerning their music, \"parallels and comparisons can now be drawn with gothic rock architects like the Doors and, certainly, early Velvet Underground\". In March 1979, in his review of Magazine's second album Secondhand Daylight, Kent noted that there was \"a new austere sense of authority\" in the music, with a \"dank neo-Gothic sound\". Later that year, the term was also used by Joy Division's manager, Tony Wilson on 15 September in an interview for the BBC TV programme's Something Else: Wilson described Joy Division as \"gothic\" compared to the pop mainstream, right before a live performance of the band. The term was later applied to \"newer bands such as Bauhaus who had arrived in the wake of Joy Division and Siouxsie and the Banshees\". Bauhaus's first single issued in 1979, \"Bela Lugosi's Dead\", is generally credited as the starting point of the gothic rock genre.\n\nIn 1979, Sounds described Joy Division as \"Gothic\" and \"theatrical\". In February 1980, Melody Maker qualified the same band as \"masters of this Gothic gloom\". Critic Jon Savage would later say that their singer Ian Curtis wrote \"the definitive Northern Gothic statement\". However, it was not until the early-1980s that gothic rock became a coherent music subgenre within post-punk, and that followers of these bands started to come together as a distinctly recognizable movement. They may have taken the \"goth\" mantle from a 1981 article published in UK rock weekly Sounds: \"The face of Punk Gothique\", written by Steve Keaton. In a text about the audience of UK Decay, Keaton asked: \"Could this be the coming of Punk Gothique? With Bauhaus flying in on similar wings could it be the next big thing?\" In July 1982, the opening of the Batcave in London's Soho provided a prominent meeting point for the emerging scene, which would be briefly labelled \"positive punk\" by the NME in a special issue with a front cover in early 1983. The term \"Batcaver\" was then used to describe old-school goths.\n\nIndependent from the British scene, in the late 1970s and early 1980s in California, deathrock developed as a distinct branch of American punk rock, with acts such as Christian Death and 45 Grave.\n\nGothic genre\n\nThe bands that defined and embraced the gothic rock genre included Bauhaus,  early Adam and the Ants, the Cure, the Birthday Party, Southern Death Cult, Specimen, Sex Gang Children, UK Decay, Virgin Prunes, Killing Joke, and the Damned. Near the peak of this first generation of the gothic scene in 1983, The Face Paul Rambali recalled that there were \"several strong Gothic characteristics\" in the music of Joy Division. In 1984, Joy Division's bassist Peter Hook named Play Dead as one of their heirs: \"If you listen to a band like Play Dead, who I really like, Joy Division played the same stuff that Play Dead are playing. They're similar.\"\n\nBy the mid-1980s, bands began proliferating and became increasingly popular, including the Sisters of Mercy, the Mission (known as the Mission UK in the US), Alien Sex Fiend, the March Violets, Xmal Deutschland, the Membranes, and Fields of Nephilim. Record labels like Factory, 4AD and Beggars Banquet released much of this music in Europe, and through a vibrant import music market in the US, the subculture grew, especially in New York and Los Angeles, California, where many nightclubs featured \"gothic/industrial\" nights. The popularity of 4AD bands resulted in the creation of a similar US label, Projekt, which produces what was colloquially termed ethereal wave, a subgenre of dark wave music.\n\nThe 1990s saw further growth for some 1980s bands and the emergence of many new acts, as well as new goth-centric U.S. record labels such as Cleopatra Records, among others. According to Dave Simpson of The Guardian, \"in the 90s, goths all but disappeared as dance music became the dominant youth cult\". As a result, the goth \"movement went underground and mistaken for cyber goth, Shock rock, Industrial metal, Gothic metal, Medieval folk metal and the latest subgenre, horror punk\". Marilyn Manson was seen as a \"goth-shock icon\" by Spin.\n\nArt: historical and cultural influences\n\nThe Goth subculture of the 1980s drew inspiration from a variety of sources. Some of them were modern or contemporary, others were centuries-old or ancient. Michael Bibby and Lauren M. E. Goodlad liken the subculture to a bricolage. Among the music subcultures that influenced it were Punk, New wave, and Glam. But it also drew inspiration from B movies, Gothic literature, horror films, vampire cults, Neo-noir science fiction films such as Ridley Scott's Blade Runner, and traditional mythology. Among the mythologies that proved influential in Goth were Celtic mythology, Christian mythology, Egyptian mythology, and various traditions of Paganism.\n\nThe figures that the movement counted among its historic canon of ancestors were equally diverse. They included the Pre-Raphaelite Brotherhood, Friedrich Nietzsche (1844‒1900), Comte de Lautréamont (1846‒1870), Salvador Dalí (1904‒1989) and Jean-Paul Sartre (1905‒1980). Writers that have had a significant influence on the movement also represent a diverse canon. They include Ann Radcliffe (1764‒1823), John William Polidori (1795‒1821), Edgar Allan Poe (1809‒1849), Sheridan Le Fanu (1814-1873), Bram Stoker (1847‒1912), Oscar Wilde (1854‒1900), H. P. Lovecraft (1890‒1937), Anne Rice (1941‒), William Gibson (1948‒), Ian McEwan (1948‒), Storm Constantine (1956‒), and Poppy Z. Brite (1967‒).\n\n18th and 19th centuries\n\nGothic literature is a genre of fiction that combines romance and dark elements to produce mystery, suspense, terror, horror and the supernatural. According to David H. Richter, settings were framed to take place at \"…ruinous castles, gloomy churchyards, claustrophobic monasteries, and lonely mountain roads\". Typical characters consisted of the cruel parent, sinister priest, courageous victor, and the helpless heroine, along with supernatural figures such as demons, vampires, ghosts, and monsters. Often, the plot focused on characters ill-fated, internally conflicted, and innocently victimized by harassing malicious figures. In addition to the dismal plot focuses, the literary tradition of the gothic was to also focus on individual characters that were gradually going insane.\n\nEnglish author Horace Walpole, with his 1764 novel The Castle of Otranto is one of the first writers who explored this genre. The American Revolutionary War-era \"American Gothic\" story of the Headless Horseman, immortalized in \"The Legend of Sleepy Hollow\" (published in 1820) by Washington Irving, marked the arrival in the New World of dark, romantic storytelling. The tale was composed by Irving while he was living in England, and was based on popular tales told by colonial Dutch settlers of the Hudson Valley, New York. The story would be adapted to film in 1922, in 1949 as the animated The Adventures of Ichabod and Mr. Toad,\"The American Film Institute, catalog of motion pictures, Volume 1, Part 1, Feature films 1941-1950, The Adventures of Ichabod and Mr Toad\" and again in 1999.\n\nThroughout the evolution of the goth subculture, classic romantic, Gothic and horror literature has played a significant role. E. T. A. Hoffmann (1776–1822), Edgar Allan Poe \"Severin admits his band (Siouxsie and the Banshees) pored over gothic literature - Edgar Allan Poe and Charles Baudelaire\". (1809–1849), Charles Baudelaire (1821–1867), H. P. Lovecraft (1890–1937), and other tragic and romantic writers have become as emblematic of the subculture as the use of dark eyeliner or dressing in black. Baudelaire, in fact, in his preface to Les Fleurs du mal (Flowers of Evil) penned lines that could serve as a sort of goth malediction:\n\nC'est l'Ennui! —l'œil chargé d'un pleur involontaire,\nIl rêve d'échafauds en fumant son houka.\nTu le connais, lecteur, ce monstre délicat,\n—Hypocrite lecteur,—mon semblable,—mon frère!\n\nIt is Boredom! — an eye brimming with an involuntary tear,\nHe dreams of the gallows while smoking his water-pipe.\nYou know him, reader, this delicate monster,\n—Hypocrite reader,—my twin,—my brother!\n\nVisual art influences\n\nThe gothic subculture has influenced different artists—not only musicians—but also painters and photographers. In particular their work is based on mystic, morbid and romantic motifs. In photography and painting the spectrum varies from erotic artwork to romantic images of vampires or ghosts. There is a marked preference for dark colours and sentiments, similar to Gothic fiction. At the end of the 19th century, painters like John Everett Millais and John Ruskin invented a new kind of Gothic.\n\n20th century influences\n\nSome people credit the band Bauhaus' first single \"Bela Lugosi's Dead\", released in August 1979, with the start of goth subculture.\n\n21st century\n\nThe British sitcom, The IT Crowd featured a recurring goth character named Richmond Avenal, played by Noel Fielding. Fielding said in an interview that he himself had been a goth at age fifteen and that he had a series of goth girlfriends. This was the first time he dabbled in makeup. Fielding said that he loved his girlfriends dressing him up.[https://www.theguardian.com/culture/2013/feb/01/noel-fielding-interview Noel Fielding: rocking a new look]. The Guardian. Author - Simon Hattenstone. Published 1 February 2013. Retrieved 28 July 2017.\n\nCharacteristics of the scene\n\nIcons\n\nNotable examples of goth icons include several bandleaders: Siouxsie Sioux, of Siouxsie and the Banshees; Robert Smith, of The Cure; Peter Murphy, of Bauhaus; Rozz Williams, of Christian Death; Ian Curtis, of Joy Division; and Dave Vanian, of The Damned. Some members of Bauhaus were, themselves, fine art students or active artists. Nick Cave was dubbed as \"the grand lord of gothic lushness\". Nico is also a notable icon of goth fashion and music, with pioneering records like The Marble Index and Desertshore and the persona she adopted after their release.\n\nFashion\n\nGothic fashion is stereotyped as conspicuously dark, eerie, mysterious, complex and exotic. Goth fashion can be recognized by its stark black clothing. Typical gothic fashion includes dyed black hair, dark eyeliner, black fingernails and black period-styled clothing; goths may or may not have piercings. Styles are often borrowed from the Elizabethan, Victorian or medieval period and often express pagan, occult or other religious imagery.\n\nTed Polhemus described goth fashion as a \"profusion of black velvets, lace, fishnets and leather tinged with scarlet or purple, accessorized with tightly laced corsets, gloves, precarious stilettos and silver jewelry depicting religious or occult themes\". Cited in . Researcher Maxim W. Furek stated that \"Goth is a revolt against the slick fashions of the 1970s disco era and a protest against the colourful pastels and extravagance of the 1980s. Black hair, dark clothing and pale complexions provide the basic look of the Goth Dresser. One can paradoxically argue that the Goth look is one of deliberate overstatement as just a casual look at the heavy emphasis on dark flowing capes, ruffled cuffs, pale makeup and dyed hair demonstrate a modern-day version of late-Victorian excess\". Gothic fashion may also feature silver jewelry.\n\nThe New York Times noted: \"The costumes and ornaments are a glamorous cover for the genre's somber themes. In the world of Goth, nature itself lurks as a malign protagonist, causing flesh to rot, rivers to flood, monuments to crumble and women to turn into slatterns, their hair streaming and lipstick askew\". Present-day fashion designers such as John Paul Gaultier, Alexander McQueen, and John Galliano have also been described as practising \"haute goth\".\n\nFilms\n\nSome of the early gothic rock and deathrock artists adopted traditional horror film images and drew on horror film soundtracks for inspiration. Their audiences responded by adopting appropriate dress and props. Use of standard horror film props like swirling smoke, rubber bats, and cobwebs featured as gothic club décor from the beginning in The Batcave. Such references in bands' music and images were originally tongue-in-cheek, but as time went on, bands and members of the subculture took the connection more seriously. As a result, morbid, supernatural and occult themes became more noticeably serious in the subculture. The interconnection between horror and goth was highlighted in its early days by The Hunger, a 1983 vampire film starring David Bowie, Catherine Deneuve and Susan Sarandon. The film featured gothic rock group Bauhaus performing Bela Lugosi's Dead in a nightclub. Tim Burton created a storybook atmosphere filled with darkness and shadow in some of his films like Beetlejuice (1988), Batman (1989), Edward Scissorhands (1990), and the stop motion films The Nightmare Before Christmas (1993), which was produced/co-written by Burton, and Corpse Bride (2005), which he co-produced.\n\nAs the subculture became well-established, the connection between goth and horror fiction became almost a cliché, with goths quite likely to appear as characters in horror novels and film. For example, The Craft, The Crow, The Matrix and Underworld film series drew directly on goth music and style. The dark comedies Beetlejuice, The Faculty, American Beauty, Wedding Crashers and a few episodes of the animated TV show South Park portray or parody the goth subculture. In South Park, several of the fictional schoolchildren are depicted as goths. The goth kids on the show are depicted as finding it annoying to be confused with the Hot Topic \"vampire\" kids from the episode \"The Ungroundable\" in season 12.Modell, Josh (2008-11-19). \"The Ungroundable\". The A.V. Club.Fickett, Travis (2008-11-20). \"IGN: The Ungroundable Review\". IGN. News Corporation. Retrieved 2008-11-23. and even more frustrating to be compared with emo kids. The goth kids are usually depicted listening to goth music, writing or reading Gothic poetry, drinking coffee, flipping their hair and smoking.Modell, Josh (2008-11-19). \"The Ungroundable\". The A.V. Club.\n\nBooks and magazines\n\nA prominent American literary influence on the gothic scene was provided by Anne Rice's re-imagining of the vampire in 1976. In The Vampire Chronicles, Rice's characters were depicted as self-tormentors who struggled with alienation, loneliness, and the human condition. Not only did the characters torment themselves, but they also depicted a surreal world that focused on uncovering its splendor. These Chronicles assumed goth attitudes, but they were not intentionally created to represent the gothic subculture. Their romance, beauty, and erotic appeal attracted\nmany goth readers, making her works popular from the 1980s through the 1990s. While Goth has embraced Vampire literature both in its 19th-century form and in its later incarnations, Rice's postmodern take on the vampire mythos has had a \"special resonance\" in the subculture. Her vampire novels feature intense emotions, period clothing, and \"cultured decadence\". Her vampires are socially alienated monsters, but they are also stunningly attractive. Rice's goth readers tend to envision themselves in much the same terms and view characters like Lestat de Lioncourt as role models.\n\nThe re-imagining of the vampire continued with the release of Poppy Z. Brite's book Lost Souls in October 1992. Despite the fact that Brite's first novel was criticized by some mainstream sources for allegedly \"lack[ing] a moral center: neither terrifyingly malevolent supernatural creatures nor (like Anne Rice's protagonists) tortured souls torn between good and evil, these vampires simply add blood-drinking to the amoral panoply of drug abuse, problem drinking and empty sex practiced by their human counterparts\", many of these so-called \"human counterparts\" identified with the teen angst and goth music references therein, keeping the book in print. Upon release of a special 10th anniversary edition of Lost Souls, Publishers Weekly—the same periodical that criticized the novel's \"amorality\" a decade prior—deemed it a \"modern horror classic\" and acknowledged that Brite established a \"cult audience\".\n\nNeil Gaiman's graphic novel series The Sandman influenced goths with characters like the dark, brooding Dream and his sister Death. The 2002 release 21st Century Goth by Mick Mercer, an author, noted music journalist and leading historian of gothic rock,Blu [http://www.starvox.net/intview/mm.htm Interview with Mick Mercer] Starvox.netKyshah Hell [http://www.morbidoutlook.com/lifestyle/articles/2002_06_mickmercer.html Interview with Mick Mercer] Morbidoutlook.com[http://www.brokenanklebooks.com/AuthorsMercer.htm Mick Mercer]  Broken Ankle Books explored the modern state of the goth scene around the world, including South America, Japan, and mainland Asia. His previous 1997 release, Hex Files: The Goth Bible, similarly took an international look at the subculture.\n\nIn the US, Propaganda was a gothic subculture magazine founded in 1982. In Italy, Ver Sacrum covers the Italian goth scene, including fashion, sexuality, music, art and literature. Some magazines, such as the now-defunct Dark Realms[http://www.monolithgraphics.com/darkrealms.html Dark Realms] and Goth Is Dead included goth fiction and poetry. Other magazines cover fashion (e.g., Gothic Beauty); music (e.g., Severance) or culture and lifestyle (e.g., Althaus e-zine).\n\nGraphic art\n\nVisual contemporary graphic artists with this aesthetic include Gerald Brom, Luis Royo, Dave McKean, Trevor Brown, Victoria Francés, as well as illustrators Edward Gorey, Charles Addams, Lorin Morgan-Richards, and James O'Barr. H. R. Giger of Switzerland is one of the first graphic artists to make serious contributions to the gothic/industrial look of much of modern cinema with his work on the 1979 film Alien by Ridley Scott. The artwork of Polish surrealist painter Zdzisław Beksiński is often described as gothic. British artist Anne Sudworth published a book on gothic art in 2007.\n\nEvents\n\nThe goth scene continues to exist in the 2010s. In Western Europe, there are large annual festivals mainly in Germany, including Wave-Gotik-Treffen (Leipzig) and M'era Luna (Hildesheim), both annually attracting tens of thousands of attendees. The Lumous Gothic Festival (more commonly known as Lumous) is the largest festival dedicated to the goth subculture in Finland and the northernmost gothic festival in the world. The Ukrainian festival \"Deti Nochi: Chorna Rada\" (Children of the night) is the biggest gothic event in Ukraine. Goth events like \"Ghoul School\" and \"Release the Bats\" promote deathrock and are attended by fans from many countries, and events such as the Drop Dead Festival in the US attract attendees from over 30 countries. The Whitby Goth Weekend is a twice-yearly goth music festival in Whitby, North Yorkshire, England. In the US, events such as Bats Day in the Fun Park celebrate the culture, as well as the Goth Cruise, and the Gothic Cruise.\n\nInterior design \n\nIn the 1980s, goths decorated their walls and ceiling with black fabrics and accessories like rosaries, crosses and plastic roses. Black furniture and cemetery-related objects like candlesticks, death lanterns and skulls. In the 1990s the interior design approach of the 1980s was replaced by a less macabre style.\n\nSociology\n\nGender and sexuality\n\nSince the late 1970s, the UK goth scene refused \"traditional standards of sexual propriety\" and accepted and celebrated \"unusual, bizarre or deviant sexual practices\". In the 2000s, many members \"... claim overlapping memberships in the queer, polyamorous, bondage-discipline/sadomasochism, and pagan communities\".\n\nWomen in the goth scene tend to be more independent: The \"... [s]cene's celebration of active sexuality\" enables goth women \"... to resist mainstream notions of passive femininity\". They have an \"active sexuality\" approach which creates \"gender egalitarianism\" within the scene, as it \"allows them to engage in sexual play with multiple partners while sidestepping most of the stigma and dangers that women who engage in such behavior\" outside the scene frequently incur, while continuing to \"... see themselves as strong\".\n\nMen dress up in androgynous way: \"... Men 'gender blend,' wearing makeup and skirts\". In contrast, the \"... women are dressed in sexy feminine outfits\" that are \"... highly sexualized\" and which often combine \"... corsets with short skirts and fishnet stockings\". Androgyny is common among the scene: \"... androgyny in Goth subcultural style often disguises or even functions to reinforce conventional gender roles\". It was only \"valorised\" for male goths, who adopt a \"feminine\" appearance, including \"make-up, skirts and feminine accessories\" to \"enhance masculinity\" and facilitate traditional heterosexual courting roles.\n\nIdentity\n\nWhile goth is \"considered a music-based scene\", \"... to be Goth implies much more than shared musical tastes; it is ... an 'aesthetic,' a particular way of seeing and of being seen\". Observers have raised the issue of to what degree individuals are truly members of the goth subculture. On one end of the spectrum is the \"Uber goth\", a person who is described as seeking a pallor so much that he or she applies \"... as much white foundation and white powder as possible\". On the other end of the spectrum another writer terms \"poseurs\": \"goth wannabes, usually young kids going through a goth phase who do not hold to goth sensibilities but want to be part of the goth crowd..\". It has been said that a \"mall goth\" is a teen who dresses in a goth style and spends time in malls with a Hot Topic store, but who does not know much about the goth subculture or its music, thus making him or her a poseur. In one case, even a well-known performer has been labelled with the pejorative term: a \"number of goths, especially those who belonged to this subculture before the late-1980s, reject Marilyn Manson as a poseur who undermines the true meaning of goth\".\n\nMedia and academic commentary\n\nThe BBC described academic research that indicated that goths are \"refined and sensitive, keen on poetry and books, not big on drugs or anti-social behaviour\". Teens often stay in the subculture \"into their adult life\", and they are likely to become well-educated and enter professions such as medicine or law. The subculture carries on appealing to teenagers who are looking for meaning and for identity. The scene teaches teens that there are difficult aspects to life that you \"have to make an attempt to understand\" or explain.\n\nThe Guardian reported that a \"glue binding the [goth] scene together was drug use\"; however, in the scene, drug use was varied. Goth is one of the few subculture movements that is not associated with a single drug, in the way that the Hippie subculture is associated with cannabis and the Mod subculture is associated with amphetamines. A 2006 study of young goths found that those with higher levels of goth identification had higher drug use.\n\nMedia perceptions on violence and self-harm\n\nThe goth scene is often described as non-violent. However, two non peer-reviewed studies by the A.S.H.A. concluded a higher than average propensity toward violence, and for one of the papers, self-harm, within the goth subculture.\n\nSchool shootings\n\nIn the weeks following the 1999 Columbine High School massacre, media reports about the teen gunmen, Harris and Klebold, portrayed them as part of a gothic cult. An increased suspicion of goth subculture subsequently manifested in the media. This led to a moral panic over teen involvement in goth subculture and a number of other activities, such as violent video games. Harris and Klebold had initially been thought to be members of \"The Trenchcoat Mafia\"; an informal club within Columbine High School. Later, such characterizations were considered incorrect.\n\nMedia reported that the gunman in the 2006 Dawson College shooting in Montreal, Quebec, Kimveer Singh Gill, was interested in goth subculture.14 September 2006. [http://www.side-line.com/news_comments.php?id\n17308_0_2_0_C Shooting by Canadian trench coat killer affects industrial / goth scene] Side-line.com. Retrieved on 13 March 2007. Gill's self-professed love of Goth culture was the topic of media interest, and it was widely reported that the word \"Goth\", in Gill's writings, was a reference to the alternative industrial and goth subculture rather than a reference to gothic rock music. Gill, who committed suicide after the attack, wrote in his online journal: \"I'm so sick of hearing about jocks and preps making life hard for the goths and others who look different, or are different\". Gill described himself in his profile on Vampirefreaks.com as \"... Trench ... the Angel of Death\" and he stated that \"Metal and Goth kick ass\".[http://www.cbc.ca/canada/story/2006/09/14/gunman-shooting.html CBC News: Montreal gunman called himself 'angel of death'] An image gallery on Gill's Vampirefreaks.com blog had photos of him pointing a gun at the camera or wearing a long black trench coat.[http://www.canada.com/topics/news/features/dawsonshooting/story.html?id689b60e6-7ded-447c-b9b9-3d6ff521107b&k\n89135 canada.com]  \n\nMick Mercer stated that Gill was \"not a Goth. Never a Goth. The bands he listed as his chosen form of ear-bashing were relentlessly metal and standard grunge, rock and goth metal, with some industrial presence\". Mercer stated that \"Kimveer Gill listened to metal\", \"He had nothing whatsoever to do with Goth\" and further commented \"I realise that like many Neos [neophyte], Kimveer Gill may even have believed he somehow was a Goth, because they're [Neophytes] only really noted for spectacularly missing the point\".Mick Mercer [http://mickmercer.liejournal.com/672571.html Mick Mercer talks about Kimveer Gill] mickmercer.livejournal.com\n\nPrejudice and violence directed at goths\n\nIn part because of public misunderstanding surrounding gothic aesthetics, people in the goth subculture sometimes suffer prejudice, discrimination, and intolerance. As is the case with members of various other subcultures and alternative lifestyles, outsiders sometimes marginalize goths, either by intention or by accident. Actress Christina Hendricks talked of being bullied as a goth in school and how difficult it was for her to deal with societal pressure: \"Kids can be pretty judgmental about people who are different. But instead of breaking down and conforming, I stood firm. That is also probably why I was unhappy. My mother was mortified and kept telling me how horrible and ugly I looked. Strangers would walk by with a look of shock on their face, so I never felt pretty. I just always felt awkward\".http://www.telegraph.co.uk/news/celebritynews/9088143/Christina-Hendricks-I-was-bullied-at-school-for-being-a-goth.html Prejudice moves people into circles of bonding where they share these similar experiences and are accepted. Young goths have to define themselves and learn beauty is an aspect of cultural relativism.\n\nOn 11 August 2007, a couple walking through Stubbylee Park in Bacup, Lancashire, England were attacked by a group of teenagers because they were goths. Sophie Lancaster subsequently died from her injuries. On 29 April 2008, two teens, Ryan Herbert and Brendan Harris, were convicted for the murder of Lancaster and given life sentences; three others were given lesser sentences for the assault on her boyfriend Robert Maltby. In delivering the sentence, Judge Anthony Russell stated, \"This was a hate crime against these completely harmless people targeted because their appearance was different to yours\". He went on to defend the goth community, calling goths \"perfectly peaceful, law-abiding people who pose no threat to anybody\". Judge Russell added that he \"recognised it as a hate crime without Parliament having to tell him to do so and had included that view in his sentencing\". Despite this ruling, a bill to add discrimination based on subculture affiliation to the definition of hate crime in British law was not presented to parliament.\n\nIn 2013, police in Manchester announced they would be treating attacks on members of alternative subcultures, like goths, the same as they do for attacks based on race, religion, and sexual orientation.\n\nSelf-harm study\n\nA study published on the British Medical Journal concluded that \"identification as belonging to the Goth subculture [at some point in their lives] was the best predictor of self harm and attempted suicide [among young teens]\", and that it was most possibly due to a selection mechanism (persons that wanted to harm themselves later identified as goths, thus raising the percentage of those persons who identify as goths). According to The Guardian, some goth teens are at more likely to harm themselves or attempt suicide. A medical journal study of 1,300 Scottish schoolchildren until their teen years found that the 53% of the goth teens had attempted to harm themselves and 47% had attempted suicide. The study found that the \"correlation was stronger than any other predictor\".Polly Curtis and John Carvel. \"Teen goths more prone to suicide, study shows\". The Guardian, Friday 14 April 2006 The study was based on a sample of 15 teenagers who identified as goths, of which 8 had self-harmed by any method, 7 had self-harmed by cutting, scratching or scoring, and 7 had attempted suicide.\n\nThe authors held that most self-harm by teens was done before joining the subculture, and that joining the subculture would actually protect them and help them deal with distress in their lives. The authors insisted on the study being based on small numbers and on the need of replication to confirm the results. The study was criticized for using only a small sample of goth teens and not taking into account other influences and differences between types of goths; by taking a study from a larger number of people. Goth subculture. http://en.wikipedia.org/?curid=12905."
  }
}
