{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4687",
  "eid" : "cfd916c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778428460,
  "textBody" : "Balochistan (Balochi, Pashto, , ,) is one of the four provinces of Pakistan, and largest province in terms of land area, forming the southwestern region of the country. Its provincial capital and largest city is Quetta. It has borders with Punjab and the Federally Administered Tribal Areas to the northeast, Sindh to the east and southeast, the Arabian Sea to the south, Iran to the west and Afghanistan to the north and northwest.\n\nThe main ethnic groups in the province are the Baloch people and the Pashtuns, who constitute 52% and 36% of the population respectively, according to the preliminary 2011 census; the remaining 12% comprises smaller communities of Brahui, Hazaras, Sindhis, Punjabis and other settlers such as the Uzbeks and Turkmens. The name Balochistan means \"the land of the Baloch\" in many regional languages. Largely underdeveloped, its provincial economy is dominated by natural resources, especially its natural gas fields, estimated to have sufficient capacity to supply Pakistan's demands over the medium to long term. Aside from Quetta, a further area of major economic importance is Gwadar Port on the Arabian Sea.\n\nBalochistan is noted for its unique culture and extremely dry desert climate. Baloch people practice Islam and are predominantly Sunni, similar to the rest of Pakistan.\n\nHistory\n\nEarly history\n\nBalochistan occupies the very southeastern-most portion of the Iranian Plateau, the setting for the earliest known farming settlements in the pre-Indus Valley Civilisation era, the earliest of which was Mehrgarh, dated at 7000 BC, within the province. Balochistan marked the westernmost extent of the Civilisation. Centuries before the arrival of Islam in the 7th Century, parts of Balochistan was ruled by the Paratarajas, an Indo-Scythian dynasty. At certain times, the Kushans also held political sway in parts of Balochistan.\n\nA theory of the origin of the Baloch people, the largest ethnic group in the region, is that they are of Median descent,M. Longworth Dames, Balochi Folklore, Folklore, Vol. 13, No. 3 (29 Sep. 1902), pp. 252–274 and are a Kurdish group that has absorbed Dravidian genes and cultural traits, primarily from Brahui people.\n\nArrival of Islam\n\nIn 654, Abdulrehman ibn Samrah, governor of Sistan and the newly emerged Rashidun caliphate at the expense of Sassanid Persia and the Byzantine Empire, sent an Islamic army to crush a revolt in Zaranj, which is now in southern Afghanistan. After conquering Zaranj, a column of the army pushed north, conquering Kabul and Ghazni, in the Hindu Kush mountain range, while another column moved through Quetta District in north-western Balochistan and conquered the area up to the ancient cities of Dawar and Qandabil (Bolan).Tabqat ibn Saad, Vol. 8, p. 471 It is documented that the major settlements, falling within today's province, became in 654 controlled by the Rashidun caliphate, except for the well-defended mountain town of QaiQan which is now Kalat.\n\nDuring the caliphate of Ali, revolt broke out in southern Balochistan's Makran region.  In 663, during the reign of Umayyad Caliph Muawiyah I his Muslim rule lost control of north-eastern Balochistan and Kalat when Haris ibn Marah and a large part of his army died in battle against a revolt in Kalat.Tarikh al Khulfa, Vol. 1, pp. 214–215, 229\n\nPre-Modern Era\n\nIn the 15th century, Mir Chakar Khan Rind became the first Sirdar of Afghan and Pakistani Balochistan, he was a close aide of the Timurid ruler Humayun, and was succeeded by the Khanate of Kalat, which owed allegiance to the Mughal Empire, and later Nader Shah won the allegiance of the rulers of eastern Balochistan, he ceded Kalhora, one of the Sindh territories of Sibi-Kachi to the Khanate of Kalat.[https://urdukhabrain.pk/2018/01/01/urdu-news-11685 urdukhabrain.pk] [http://www.iranica.com/newsite/index.isc?Article=http://www.iranica.com/newsite/articles/unicode/v3f6/v3f6a030.html Iranica.com]  Ahmad Shah Durrani, founder of the Afghan Empire, also won the allegiance of that area's rulers. Most of the area would eventually revert to local Baloch control – after Afghan rule, many Baloch fought during the Third Battle of Panipat.\n\nBritish Era\n\nDuring the period of the British Raj from the fall of the Durrani Empire in 1823 four Princely States were recognised and reinforced in Balochistan: Makran, Kharan, Las Bela and Kalat. In 1876, Robert Sandeman negotiated the Treaty of Kalat, which brought the Khan's territories, including Kharan, Makran, and Las Bela, under British protection even though they remained independent Princely states. After the Second Afghan War was ended by the Treaty of Gandamak in May 1879, the Afghan Emir ceded the districts of Quetta, Pishin, Harnai, Sibi and Thal Chotiali to British control. On 1 April 1883, the British took control of the Bolan Pass, south-east of Quetta, from the Khan of Kalat. In 1887, small additional areas of Balochistan were declared British territory. In 1893, Sir Mortimer Durand negotiated an agreement with the Amir of Afghanistan, Abdur Rahman Khan, to fix the Durand Line running from Chitral to Balochistan as the boundary between the Emirate of Afghanistan and British-controlled areas. Two devastating earthquakes occurred in Balochistan during British colonial rule: the 1935 Quetta earthquake, which devastated Quetta, and the 1945 Balochistan earthquake with its epicentre in the Makran region.\n\nAfter independence\n\nBalochistan contained a Chief Commissioner's province and four princely states under the British Raj. The province's Shahi Jirga and the non-official members of the Quetta Municipality opted for Pakistan unanimously on 29 June 1947. Three of the princely states, Makran, Las Bela and Kharan, acceded to Pakistan in 1947 after independence. But the ruler of the fourth princely state, the Khan of Kalat, Ahmad Yar Khan, who used to call Jinnah his 'father', declared Kalat's independence as this was one of the options given to all of the 535 princely states by British Prime Minister Clement Attlee.\n\nKalat finally acceded to Pakistan on March 27, 1948 after the 'strange help' of All India Radio and a period of negotiations and bureaucratic tactics used by Pakistan. The signing of the Instrument of Accession by Ahmad Yar Khan, led his brother, Prince Abdul Karim, to revolt against his brother's decision in July 1948. Princes Agha Abdul Karim Baloch and Muhammad Rahim, refused to lay down arms, leading the Dosht-e Jhalawan in unconventional attacks on the army until 1950. The Princes fought a lone battle without support from the rest of Balochistan. Jinnah and his successors allowed Yar Khan to retain his title until the province's dissolution in 1955.\n\nInsurgencies by Baloch nationalists took place in 1948, 1958–59, 1962–63 and 1973–77 – with a new and reportedly stronger ongoing insurgency by autonomy-seeking Baloch groups beginning in 2003. While most Baloch support the demand for autonomy, the majority are not interested in seceding from Pakistan.[https://www.thenews.com.pk/archive/print/624446-37pc-baloch-favour-independence-uk-survey 37pc Baloch favour independence: UK survey\"] . www.thenews.com.pk. Retrieved 2017-03-07.\n\nAt a press conference on 8 June 2015 in Quetta, Home Minister Sarfraz Bugti accused India's prime minister Narendra Modi of openly supporting terrorism. Bugti implicated India's Research and Analysis Wing (RAW) of being responsible for recent attacks at military bases in Smangli and Khalid, and for subverting the China-Pakistan Economic Corridor (CPEC) agreement.\n\nGeography\n\nBalochistan is situated in the southwest of Pakistan and covers an area of . It is Pakistan's largest province by area, constituting 44% of Pakistan's total land mass. The province is bordered by Afghanistan to the north and north-west, Iran to the south-west, Punjab and Sindh, and Khyber Pakhtunkhwa and the Federally Administered Tribal Areas to the north-east. To the south lies the Arabian Sea. Balochistan is located on the south-eastern part of the Iranian plateau. It borders the geopolitical regions of the Middle East and Southwest Asia, Central Asia and South Asia. Balochistan lies at the mouth of the Strait of Hormuz and provides the shortest route from seaports to Central Asia. Its geographical location has placed the otherwise desolate region in the scope of competing global interests for all of recorded history.\n\nThe capital city Quetta is located in a densely populated portion of the Sulaiman Mountains in the north-east of the province. It is situated in a river valley near the Bolan Pass, which has been used as the route of choice from the coast to Central Asia, entering through Afghanistan's Kandahar region. The British and other historic empires have crossed the region to invade Afghanistan by this route.Bolan Pass – Encyclopædia Britannica Eleventh Edition\n\nBalochistan is rich in exhaustible and renewable resources; it is the second major supplier of natural gas in Pakistan. The province's renewable and human resource potential has not been systematically measured or exploited due to pressures from within and without Pakistan. Local inhabitants have chosen to live in towns and have relied on sustainable water sources for thousands of years.\n\nClimate\n\nThe climate of the upper highlands is characterised by very cold winters and hot summers. In the lower highlands, winters vary from extremely cold in northern districts Ziarat, Quetta, Kalat, Muslim Baagh and Khanozai to milder conditions closer to the Makran coast. Winters are mild on the plains, with temperature never falling below freezing point. Summers are hot and dry, especially in the arid zones of Chagai and Kharan districts. The plains are also very hot in summer, with temperatures reaching 50 C.The record highest temperature, 53 C, was recorded in Sibi on 26 May 2010,[http://www.pakmet.com.pk/latest%20news/Latest%20News.html Pakmet.com.pk]  exceeding the previous record, 52 C. Other hot areas include Turbat and Dalbandin. The desert climate is characterised by hot and very arid conditions. Occasionally, strong windstorms make these areas very inhospitable.\n\nEconomy\n\nThe economy of Balochistan is largely based upon the production of natural gas, coal and other minerals.\n\nBalochistan has been called a \"neglected province where a majority of population lacks amenities\". Since the mid-1970s the province's share of Pakistan's GDP has dropped from 4.9 to 3.7%,Jetly, Rajsree. \"Resurgence of the Baluch Movement in Pakistan: Emerging Perspectives and Challenges,\" in Jetly, Rajshree. ed. Pakistan in Regional and Global Politics (New York: Routledge, 2009): 215. and as of 2007 it had the highest poverty rate and infant and maternal mortality rate, and the lowest literacy rate in the country,Baloch, Sanaullah. \"The Baloch Conflict: Towards a Lasting Peace,\" Pakistan Security Research Unit, No. 7 (March 2007): 5–6. factors some allege have contributed to the insurgency. However, in 7th NFC awards Punjab province and Federal contributed to increase Baluchistan share more than its entitled population based share. In Balochistan poverty is increasing. In 2001–2002 poverty incidences was at 48% and by 2005–2006 was at 50.9%.\n\nThough the province remains largely underdeveloped, several major development projects, including the construction of a new deep sea port at the strategically important town of Gwadar, are in progress in Balochistan. The port is projected to be the hub of an energy and trade corridor to and from China and the Central Asian republics. The Mirani Dam on the Dasht River, 50 km west of Turbat in the Makran Division, is being built to provide water to expand agricultural land use by 35000 km2 where it would otherwise be unsustainable. In the district Lasbela there is an oil refinery owned by Byco International Incorporated (BII), which is capable of processing 120,000 barrels of oil per day. A power station is located adjacent to the refinery. Several cement plants and a marble factory are also located there. One of the world's largest ship breaking yards is located on the coast.\n\nNatural resource extraction\n\nBalochistan's share of Pakistan's national income has historically ranged between 3.7% to 4.9%. Since 1972, Balochistan's gross income has grown in size by 2.7 times.[http://siteresources.worldbank.org/PAKISTANEXTN/Resources/293051-1241610364594/6097548-1257441952102/balochistaneconomicreportvol2.pdf Siterresources.worldbank.org]  Outside Quetta, the resource extraction infrastructure of the province is gradually developing but still lags far behind other parts of Pakistan.\n\nThe agreements for royalty rights and ownership of mineral rights were reached during a period of unprecedented natural disasters, economic, social, political, and cultural unrest in Pakistan. The negotiations were widely considered to be insufficiently transparent.\n\nGovernment and politics\n\nIn common with the other provinces of Pakistan, Balochistan has a parliamentary form of government. The ceremonial head of the province is the Governor, who is appointed by the President of Pakistan on the advice of the provincial Chief Minister. The Chief Minister, the province's chief executive, is normally the leader of the largest political party or alliance of parties in the provincial assembly.\n\nThe unicameral Provincial Assembly of Balochistan comprises 65 seats of which 11 are reserved for women and 3 reserved for non-Muslims. The judicial branch of government is carried out by the Balochistan High Court, which is based in Quetta and headed by a Chief Justice.\n\nBesides dominant Pakistan-wide political parties (such as the Pakistan Muslim League (N) and the Pakistan Peoples Party), Balochistan nationalist parties (such as the National Party and the Balochistan National Party) have been prominent in the province.\n\nLaw and order \n\nIn order to implement Closed Border Policy, Frontier Corps was raised by British in 1870 to perform the border security duties along the Indo-Afghan Buffer Zone, having its HQ in Peshawar, NWFP. 5  Corps, i.e. Zhob Militia, Pishin Scouts, Chagai Militia, Kalat Scouts and Sibi Scouts were deployed in Balochistan as border security and internal security force. FC Balochistan was formally raised in Mar 1974, comprising seven units: 5 units in situ, 2 new units Maiwand Rifles, Mekran Scouts and 1  Training Center at Loralai. In 1977, 4 more units, Ghazaband Scouts, Loralai Scouts, Bhambore Rifles and Kharan Rifles were raised. In the wake of 9/11, Bolan Scouts was raised at Muslim Bagh along Pak- Afghan Border, bringing the total to 12  Corps. The additional raising was undertaken in year 2005–06 to further strengthen the security arrangements. In this package 2 x Sector Headquarters, 3  Corps and 4 x Mortar Batteries were raised. To meet the training requirements of this sizeable force, FC Battle School was raised at Beleli in year 2006. To cater for the growing requirement of complex border and Internal Security operations, on 1 July 2007, a Special Operations Wing (SOW), IAC Squadron and Tank Regiment were also raised from within own resources. Sui Rifles was raised in March 2011.\n\nAdministration\n\nFor administrative purposes, the province is divided into six Divisions – Kalat, Makran, Nasirabad, Quetta, Sibi and Zhob. This divisional level was abolished in 2000, but restored after the 2008 election. Each Division is under an appointed Commissioner. The six Divisions are further subdivided into 34 districts:\n\nDemographics\n\nBalochistan's population density is low due to the mountainous terrain and scarcity of water. In March 2012, preliminary census figures showed that the population of Balochistan had reached 13,162,222, not including the districts of Khuzdar, Kech and Panjgur, a 139.3% increase from 5,501,164 in 1998, representing 6.85% of Pakistan's total population. This was the largest increase in population by any province of Pakistan during that time period. Official estimates of Balochistan's population grew from approximately 7.45 million in 2003 to 7.8 million in 2005.[http://siteresources.worldbank.org/PAKISTANEXTN/Resources/293051-1241610364594/6097548-1257441952102/balochistaneconomicreportvol2.pdf Pakistan Balochistan Economic Report: From Periphery to Core (In Two Volumes) – Volume II: Full Report.]  The World Bank. May 2008. \"The Balochistan population totalled 4.5 million in 1981/82 and 7.8 million in 2004/05...\" \"NIPS estimates that Balochistan's population growth will slow down to 1.3 percent by 2025...\" According to the 1998 Census, Balochistan had a total population of 6,565,885 of which most (6,484,006) were Muslims. There were also Hindu and Christian minorities in the province. The 1998 Census recorded that the Hindu population in the province was approximately 39,000 (including the Scheduled Castes). There was also a Christian minority of 26,462 individuals in the province.\n\nEthnolinguistic groups\n\nAccording to the Ethnologue, households whose primary language is Makrani constitutes 13%, Rukhshani 10%, and Sulemani 7% of the population. Pashto is also spoken by around 30% of the population and 13% of households speak Brahui. The remaining 18% of the population speaks various languages, including Lasi, Urdu, Punjabi, Hazargi, Sindhi, Saraiki, Dehvari, Dari, Tajik, Hindko, Uzbik, and Hindki.\n\nIn the Lasbela District, the majority of the population speaks Lasi.\n\nThe 2005 census concerning Afghans in Pakistan showed that a total of 769,268Afghanistan Research and Evaluation Unit (AREU), Afghans in Quetta. Settlements, Livelihoods, Support Networks and Cross-Border Linkages, January 2006, available at: http://www.unhcr.org/refworld/docid/47c3f3c412.html [accessed 7 January 2013] Afghan refugees were temporarily staying in Balochistan. However, there are probably fewer Afghans living in Balochistan today as many refugees repatriated in 2013. As of 2015, there are only 327,778 registered Afghan refugees according to the UNHCR.\n\nGallery\n\nFile:Buzi Pass.jpg|Princess of Hope along the N10\nFile:Quetta Railway Station - 40311.jpg|Quetta Railway Station\nFile:Ormara West Beach.jpg|Ormara beach, west side of the city",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Balochistan, Pakistan" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4687" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Balochistan (Balochi, Pashto, , ,) is one of the four provinces of Pakistan, and largest province in terms of land area, forming the southwestern region of the country. Its provincial capital and largest city is Quetta. It has borders with Punjab and the Federally Administered Tribal Areas to the northeast, Sindh to the east and southeast, the Arabian Sea to the south, Iran to the west and Afghanistan to the north and northwest.\n\nThe main ethnic groups in the province are the Baloch people and the Pashtuns, who constitute 52% and 36% of the population respectively, according to the preliminary 2011 census; the remaining 12% comprises smaller communities of Brahui, Hazaras, Sindhis, Punjabis and other settlers such as the Uzbeks and Turkmens. The name Balochistan means \"the land of the Baloch\" in many regional languages. Largely underdeveloped, its provincial economy is dominated by natural resources, especially its natural gas fields, estimated to have sufficient capacity to supply Pakistan's demands over the medium to long term. Aside from Quetta, a further area of major economic importance is Gwadar Port on the Arabian Sea.\n\nBalochistan is noted for its unique culture and extremely dry desert climate. Baloch people practice Islam and are predominantly Sunni, similar to the rest of Pakistan.\n\nHistory\n\nEarly history\n\nBalochistan occupies the very southeastern-most portion of the Iranian Plateau, the setting for the earliest known farming settlements in the pre-Indus Valley Civilisation era, the earliest of which was Mehrgarh, dated at 7000 BC, within the province. Balochistan marked the westernmost extent of the Civilisation. Centuries before the arrival of Islam in the 7th Century, parts of Balochistan was ruled by the Paratarajas, an Indo-Scythian dynasty. At certain times, the Kushans also held political sway in parts of Balochistan.\n\nA theory of the origin of the Baloch people, the largest ethnic group in the region, is that they are of Median descent,M. Longworth Dames, Balochi Folklore, Folklore, Vol. 13, No. 3 (29 Sep. 1902), pp. 252–274 and are a Kurdish group that has absorbed Dravidian genes and cultural traits, primarily from Brahui people.\n\nArrival of Islam\n\nIn 654, Abdulrehman ibn Samrah, governor of Sistan and the newly emerged Rashidun caliphate at the expense of Sassanid Persia and the Byzantine Empire, sent an Islamic army to crush a revolt in Zaranj, which is now in southern Afghanistan. After conquering Zaranj, a column of the army pushed north, conquering Kabul and Ghazni, in the Hindu Kush mountain range, while another column moved through Quetta District in north-western Balochistan and conquered the area up to the ancient cities of Dawar and Qandabil (Bolan).Tabqat ibn Saad, Vol. 8, p. 471 It is documented that the major settlements, falling within today's province, became in 654 controlled by the Rashidun caliphate, except for the well-defended mountain town of QaiQan which is now Kalat.\n\nDuring the caliphate of Ali, revolt broke out in southern Balochistan's Makran region.  In 663, during the reign of Umayyad Caliph Muawiyah I his Muslim rule lost control of north-eastern Balochistan and Kalat when Haris ibn Marah and a large part of his army died in battle against a revolt in Kalat.Tarikh al Khulfa, Vol. 1, pp. 214–215, 229\n\nPre-Modern Era\n\nIn the 15th century, Mir Chakar Khan Rind became the first Sirdar of Afghan and Pakistani Balochistan, he was a close aide of the Timurid ruler Humayun, and was succeeded by the Khanate of Kalat, which owed allegiance to the Mughal Empire, and later Nader Shah won the allegiance of the rulers of eastern Balochistan, he ceded Kalhora, one of the Sindh territories of Sibi-Kachi to the Khanate of Kalat.[https://urdukhabrain.pk/2018/01/01/urdu-news-11685 urdukhabrain.pk] [http://www.iranica.com/newsite/index.isc?Article=http://www.iranica.com/newsite/articles/unicode/v3f6/v3f6a030.html Iranica.com]  Ahmad Shah Durrani, founder of the Afghan Empire, also won the allegiance of that area's rulers. Most of the area would eventually revert to local Baloch control – after Afghan rule, many Baloch fought during the Third Battle of Panipat.\n\nBritish Era\n\nDuring the period of the British Raj from the fall of the Durrani Empire in 1823 four Princely States were recognised and reinforced in Balochistan: Makran, Kharan, Las Bela and Kalat. In 1876, Robert Sandeman negotiated the Treaty of Kalat, which brought the Khan's territories, including Kharan, Makran, and Las Bela, under British protection even though they remained independent Princely states. After the Second Afghan War was ended by the Treaty of Gandamak in May 1879, the Afghan Emir ceded the districts of Quetta, Pishin, Harnai, Sibi and Thal Chotiali to British control. On 1 April 1883, the British took control of the Bolan Pass, south-east of Quetta, from the Khan of Kalat. In 1887, small additional areas of Balochistan were declared British territory. In 1893, Sir Mortimer Durand negotiated an agreement with the Amir of Afghanistan, Abdur Rahman Khan, to fix the Durand Line running from Chitral to Balochistan as the boundary between the Emirate of Afghanistan and British-controlled areas. Two devastating earthquakes occurred in Balochistan during British colonial rule: the 1935 Quetta earthquake, which devastated Quetta, and the 1945 Balochistan earthquake with its epicentre in the Makran region.\n\nAfter independence\n\nBalochistan contained a Chief Commissioner's province and four princely states under the British Raj. The province's Shahi Jirga and the non-official members of the Quetta Municipality opted for Pakistan unanimously on 29 June 1947. Three of the princely states, Makran, Las Bela and Kharan, acceded to Pakistan in 1947 after independence. But the ruler of the fourth princely state, the Khan of Kalat, Ahmad Yar Khan, who used to call Jinnah his 'father', declared Kalat's independence as this was one of the options given to all of the 535 princely states by British Prime Minister Clement Attlee.\n\nKalat finally acceded to Pakistan on March 27, 1948 after the 'strange help' of All India Radio and a period of negotiations and bureaucratic tactics used by Pakistan. The signing of the Instrument of Accession by Ahmad Yar Khan, led his brother, Prince Abdul Karim, to revolt against his brother's decision in July 1948. Princes Agha Abdul Karim Baloch and Muhammad Rahim, refused to lay down arms, leading the Dosht-e Jhalawan in unconventional attacks on the army until 1950. The Princes fought a lone battle without support from the rest of Balochistan. Jinnah and his successors allowed Yar Khan to retain his title until the province's dissolution in 1955.\n\nInsurgencies by Baloch nationalists took place in 1948, 1958–59, 1962–63 and 1973–77 – with a new and reportedly stronger ongoing insurgency by autonomy-seeking Baloch groups beginning in 2003. While most Baloch support the demand for autonomy, the majority are not interested in seceding from Pakistan.[https://www.thenews.com.pk/archive/print/624446-37pc-baloch-favour-independence-uk-survey 37pc Baloch favour independence: UK survey\"] . www.thenews.com.pk. Retrieved 2017-03-07.\n\nAt a press conference on 8 June 2015 in Quetta, Home Minister Sarfraz Bugti accused India's prime minister Narendra Modi of openly supporting terrorism. Bugti implicated India's Research and Analysis Wing (RAW) of being responsible for recent attacks at military bases in Smangli and Khalid, and for subverting the China-Pakistan Economic Corridor (CPEC) agreement.\n\nGeography\n\nBalochistan is situated in the southwest of Pakistan and covers an area of . It is Pakistan's largest province by area, constituting 44% of Pakistan's total land mass. The province is bordered by Afghanistan to the north and north-west, Iran to the south-west, Punjab and Sindh, and Khyber Pakhtunkhwa and the Federally Administered Tribal Areas to the north-east. To the south lies the Arabian Sea. Balochistan is located on the south-eastern part of the Iranian plateau. It borders the geopolitical regions of the Middle East and Southwest Asia, Central Asia and South Asia. Balochistan lies at the mouth of the Strait of Hormuz and provides the shortest route from seaports to Central Asia. Its geographical location has placed the otherwise desolate region in the scope of competing global interests for all of recorded history.\n\nThe capital city Quetta is located in a densely populated portion of the Sulaiman Mountains in the north-east of the province. It is situated in a river valley near the Bolan Pass, which has been used as the route of choice from the coast to Central Asia, entering through Afghanistan's Kandahar region. The British and other historic empires have crossed the region to invade Afghanistan by this route.Bolan Pass – Encyclopædia Britannica Eleventh Edition\n\nBalochistan is rich in exhaustible and renewable resources; it is the second major supplier of natural gas in Pakistan. The province's renewable and human resource potential has not been systematically measured or exploited due to pressures from within and without Pakistan. Local inhabitants have chosen to live in towns and have relied on sustainable water sources for thousands of years.\n\nClimate\n\nThe climate of the upper highlands is characterised by very cold winters and hot summers. In the lower highlands, winters vary from extremely cold in northern districts Ziarat, Quetta, Kalat, Muslim Baagh and Khanozai to milder conditions closer to the Makran coast. Winters are mild on the plains, with temperature never falling below freezing point. Summers are hot and dry, especially in the arid zones of Chagai and Kharan districts. The plains are also very hot in summer, with temperatures reaching 50 C.The record highest temperature, 53 C, was recorded in Sibi on 26 May 2010,[http://www.pakmet.com.pk/latest%20news/Latest%20News.html Pakmet.com.pk]  exceeding the previous record, 52 C. Other hot areas include Turbat and Dalbandin. The desert climate is characterised by hot and very arid conditions. Occasionally, strong windstorms make these areas very inhospitable.\n\nEconomy\n\nThe economy of Balochistan is largely based upon the production of natural gas, coal and other minerals.\n\nBalochistan has been called a \"neglected province where a majority of population lacks amenities\". Since the mid-1970s the province's share of Pakistan's GDP has dropped from 4.9 to 3.7%,Jetly, Rajsree. \"Resurgence of the Baluch Movement in Pakistan: Emerging Perspectives and Challenges,\" in Jetly, Rajshree. ed. Pakistan in Regional and Global Politics (New York: Routledge, 2009): 215. and as of 2007 it had the highest poverty rate and infant and maternal mortality rate, and the lowest literacy rate in the country,Baloch, Sanaullah. \"The Baloch Conflict: Towards a Lasting Peace,\" Pakistan Security Research Unit, No. 7 (March 2007): 5–6. factors some allege have contributed to the insurgency. However, in 7th NFC awards Punjab province and Federal contributed to increase Baluchistan share more than its entitled population based share. In Balochistan poverty is increasing. In 2001–2002 poverty incidences was at 48% and by 2005–2006 was at 50.9%.\n\nThough the province remains largely underdeveloped, several major development projects, including the construction of a new deep sea port at the strategically important town of Gwadar, are in progress in Balochistan. The port is projected to be the hub of an energy and trade corridor to and from China and the Central Asian republics. The Mirani Dam on the Dasht River, 50 km west of Turbat in the Makran Division, is being built to provide water to expand agricultural land use by 35000 km2 where it would otherwise be unsustainable. In the district Lasbela there is an oil refinery owned by Byco International Incorporated (BII), which is capable of processing 120,000 barrels of oil per day. A power station is located adjacent to the refinery. Several cement plants and a marble factory are also located there. One of the world's largest ship breaking yards is located on the coast.\n\nNatural resource extraction\n\nBalochistan's share of Pakistan's national income has historically ranged between 3.7% to 4.9%. Since 1972, Balochistan's gross income has grown in size by 2.7 times.[http://siteresources.worldbank.org/PAKISTANEXTN/Resources/293051-1241610364594/6097548-1257441952102/balochistaneconomicreportvol2.pdf Siterresources.worldbank.org]  Outside Quetta, the resource extraction infrastructure of the province is gradually developing but still lags far behind other parts of Pakistan.\n\nThe agreements for royalty rights and ownership of mineral rights were reached during a period of unprecedented natural disasters, economic, social, political, and cultural unrest in Pakistan. The negotiations were widely considered to be insufficiently transparent.\n\nGovernment and politics\n\nIn common with the other provinces of Pakistan, Balochistan has a parliamentary form of government. The ceremonial head of the province is the Governor, who is appointed by the President of Pakistan on the advice of the provincial Chief Minister. The Chief Minister, the province's chief executive, is normally the leader of the largest political party or alliance of parties in the provincial assembly.\n\nThe unicameral Provincial Assembly of Balochistan comprises 65 seats of which 11 are reserved for women and 3 reserved for non-Muslims. The judicial branch of government is carried out by the Balochistan High Court, which is based in Quetta and headed by a Chief Justice.\n\nBesides dominant Pakistan-wide political parties (such as the Pakistan Muslim League (N) and the Pakistan Peoples Party), Balochistan nationalist parties (such as the National Party and the Balochistan National Party) have been prominent in the province.\n\nLaw and order \n\nIn order to implement Closed Border Policy, Frontier Corps was raised by British in 1870 to perform the border security duties along the Indo-Afghan Buffer Zone, having its HQ in Peshawar, NWFP. 5  Corps, i.e. Zhob Militia, Pishin Scouts, Chagai Militia, Kalat Scouts and Sibi Scouts were deployed in Balochistan as border security and internal security force. FC Balochistan was formally raised in Mar 1974, comprising seven units: 5 units in situ, 2 new units Maiwand Rifles, Mekran Scouts and 1  Training Center at Loralai. In 1977, 4 more units, Ghazaband Scouts, Loralai Scouts, Bhambore Rifles and Kharan Rifles were raised. In the wake of 9/11, Bolan Scouts was raised at Muslim Bagh along Pak- Afghan Border, bringing the total to 12  Corps. The additional raising was undertaken in year 2005–06 to further strengthen the security arrangements. In this package 2 x Sector Headquarters, 3  Corps and 4 x Mortar Batteries were raised. To meet the training requirements of this sizeable force, FC Battle School was raised at Beleli in year 2006. To cater for the growing requirement of complex border and Internal Security operations, on 1 July 2007, a Special Operations Wing (SOW), IAC Squadron and Tank Regiment were also raised from within own resources. Sui Rifles was raised in March 2011.\n\nAdministration\n\nFor administrative purposes, the province is divided into six Divisions – Kalat, Makran, Nasirabad, Quetta, Sibi and Zhob. This divisional level was abolished in 2000, but restored after the 2008 election. Each Division is under an appointed Commissioner. The six Divisions are further subdivided into 34 districts:\n\nDemographics\n\nBalochistan's population density is low due to the mountainous terrain and scarcity of water. In March 2012, preliminary census figures showed that the population of Balochistan had reached 13,162,222, not including the districts of Khuzdar, Kech and Panjgur, a 139.3% increase from 5,501,164 in 1998, representing 6.85% of Pakistan's total population. This was the largest increase in population by any province of Pakistan during that time period. Official estimates of Balochistan's population grew from approximately 7.45 million in 2003 to 7.8 million in 2005.[http://siteresources.worldbank.org/PAKISTANEXTN/Resources/293051-1241610364594/6097548-1257441952102/balochistaneconomicreportvol2.pdf Pakistan Balochistan Economic Report: From Periphery to Core (In Two Volumes) – Volume II: Full Report.]  The World Bank. May 2008. \"The Balochistan population totalled 4.5 million in 1981/82 and 7.8 million in 2004/05...\" \"NIPS estimates that Balochistan's population growth will slow down to 1.3 percent by 2025...\" According to the 1998 Census, Balochistan had a total population of 6,565,885 of which most (6,484,006) were Muslims. There were also Hindu and Christian minorities in the province. The 1998 Census recorded that the Hindu population in the province was approximately 39,000 (including the Scheduled Castes). There was also a Christian minority of 26,462 individuals in the province.\n\nEthnolinguistic groups\n\nAccording to the Ethnologue, households whose primary language is Makrani constitutes 13%, Rukhshani 10%, and Sulemani 7% of the population. Pashto is also spoken by around 30% of the population and 13% of households speak Brahui. The remaining 18% of the population speaks various languages, including Lasi, Urdu, Punjabi, Hazargi, Sindhi, Saraiki, Dehvari, Dari, Tajik, Hindko, Uzbik, and Hindki.\n\nIn the Lasbela District, the majority of the population speaks Lasi.\n\nThe 2005 census concerning Afghans in Pakistan showed that a total of 769,268Afghanistan Research and Evaluation Unit (AREU), Afghans in Quetta. Settlements, Livelihoods, Support Networks and Cross-Border Linkages, January 2006, available at: http://www.unhcr.org/refworld/docid/47c3f3c412.html [accessed 7 January 2013] Afghan refugees were temporarily staying in Balochistan. However, there are probably fewer Afghans living in Balochistan today as many refugees repatriated in 2013. As of 2015, there are only 327,778 registered Afghan refugees according to the UNHCR.\n\nGallery\n\nFile:Buzi Pass.jpg|Princess of Hope along the N10\nFile:Quetta Railway Station - 40311.jpg|Quetta Railway Station\nFile:Ormara West Beach.jpg|Ormara beach, west side of the city. Balochistan, Pakistan. http://en.wikipedia.org/?curid=4687."
  }
}
