{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1366",
  "eid" : "b998ad80-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778391128,
  "textBody" : "Amethyst is a violet variety of quartz often used in jewelry. \n\nThe name comes from the Koine Greek ἀμέθυστος amethystos from ἀ- a-, \"not\" and μεθύσκω methysko / μεθύω methyo, \"intoxicate\", a reference to the belief that the stone protected its owner from drunkenness. The ancient Greeks wore amethyst and carved drinking vessels from it in the belief that it would prevent intoxication. \n\nIt is one of several forms of quartz. Amethyst is a semiprecious stone and is the traditional birthstone for February.\n\nStructure\n\nAmethyst is a purple variety of quartz (SiO2) and owes its violet color to irradiation, iron impurities (in some cases in conjunction with transition element impurities), and the presence of trace elements, which result in complex crystal lattice substitutions.Norman N. Greenwood and Alan Earnshaw (1997). Chemistry of the Elements (2nd ed.). Butterworth–Heinemann. .Michael O'Donoghue (2006), Gems, Butterworth-Heinemann, 6th ed.  The hardness of the mineral is the same as quartz, thus it is suitable for use in jewelry.\n\nHue and tone\n\nAmethyst occurs in primary hues from a light pinkish violet to a deep purple. Amethyst may exhibit one or both secondary hues, red and blue. The best varieties of amethyst can be found in Siberia, Sri Lanka, Brazil and the far East. The ideal grade is called \"Deep Siberian\" and has a primary purple hue of around 75–80%, with 15–20% blue and (depending on the light source) red secondary hues.Richard W. Wise (2005), Secrets of the Gem Trade; The Connoisseur's Guide to Precious Gemstones, Brunswick House Press, Lenox, Mass.,  Green quartz is sometimes incorrectly called green amethyst, which is a misnomer and not an appropriate name for the material, the proper terminology being prasiolite. Other names for green quartz are vermarine or lime citrine.\n\nOf very variable intensity, the color of amethyst is often laid out in stripes parallel to the final faces of the crystal. One aspect in the art of lapidary involves correctly cutting the stone to place the color in a way that makes the tone of the finished gem homogeneous. Often, the fact that sometimes only a thin surface layer of violet color is present in the stone or that the color is not homogeneous makes for a difficult cutting.\n\nThe color of amethyst has been demonstrated to result from substitution by irradiation of trivalent iron (Fe3+) for silicon in the structure, in the presence of trace elements of large ionic radius, and, to a certain extent, the amethyst color can naturally result from displacement of transition elements even if the iron concentration is low. Natural amethyst is dichroic in reddish violet and bluish violet, but when heated, turns yellow-orange, yellow-brown, or dark brownish and may resemble citrine,[http://www.mindat.org/min-198.html Amethyst]. Mindat.org but loses its dichroism, unlike genuine citrine. When partially heated, amethyst can result in ametrine.\n\nAmethyst can fade in tone if overexposed to light sources and can be artificially darkened with adequate irradiation.\n\nHistory\n\nAmethyst was used as a gemstone by the ancient Egyptians and was largely employed in antiquity for intaglio engraved gems.Augosto Castellani (famous Italian 19th century jeweler) (1871), [https://books.google.com/books?id\nBwEYAAAAYAAJ&printsec=frontcover Gems, Notes and Extracts], p. 34, London, Bell and Daldy, .\n\nThe Greeks believed amethyst gems could prevent intoxication,Marcell N. Smith (1913), [http://www.farlang.com/gemstones/smith-diamonds-pearls-stones/page_087 Diamonds, Pearls and Precious Stones] Griffith Stillings Press, Boston, Mass., p. 74 while medieval European soldiers wore amethyst amulets as protection in battle in the belief that amethysts heal people and keep them cool-headed.George Frederick Kunz (1913), [http://www.farlang.com/gemstones/kunz-curious-lore-stones/page_077 Curious Lore of Precious Stones], Lippincott Company, Philadelphia & London, p. 77 Beads of amethyst were found in Anglo-Saxon graves in England.Michael Lapidge (ed.) (2000), [https://books.google.com/books?id\nf65VUNvxQjkC&pgPA261& The Blackwell Encyclopaedia of Anglo-Saxon England], p. 261, . Anglican bishops wear an episcopal ring often set with an amethyst, an allusion to the description of the Apostles as \"not drunk\" at Pentecost in Acts 2:15.\n\nA large geode, or \"amethyst-grotto\", from near Santa Cruz in southern Brazil was presented at a 1902 exhibition in Düsseldorf, Germany.\n\nIn the 19th century, the color of amethyst was attributed to the presence of manganese. However, since it can be greatly altered and even discharged by heat, the color was believed by some authorities to be from an organic source. Ferric thiocyanate has been suggested, and sulfur was said to have been detected in the mineral.\n\nSynthetic amethyst\n\nSynthetic (laboratory-grown) amethyst is produced by a synthesis method called hydrothermal growth, which grows the crystals inside a high-pressure autoclave.\n\nSynthetic amethyst is made to imitate the best quality amethyst. Its chemical and physical properties are the same to that of natural amethyst and it can not be differentiated with absolute certainty without advanced gemmological testing (which is often cost-prohibitive). There is one test based on \"Brazil law twinning\" (a form of quartz twinning where right and left hand quartz structures are combined in a single crystal) which can be used to identify synthetic amethyst rather easily. It is possible to synthesize twinned amethyst, but this type is not available in large quantities in the market.\n\nSingle-crystal quartz is very desirable in the industry, particularly for keeping the regular vibrations necessary for quartz movements in watches and clocks, which is where a lot of synthetic quartz is used.\n\nTreated amethyst is produced by gamma ray, X-ray or electron beam irradiation of clear quartz (rock crystal) which has been first doped with ferric impurities. On exposure to heat, the irradiation effects can be partially cancelled and amethyst generally becomes yellow or even green, and much of the citrine, cairngorm, or yellow quartz of jewelry is said to be merely \"burnt amethyst\".\n\nCultural history\n\nAncient Greece\n\nThe Greek word \"amethystos\" may be translated as \"not drunken\", from Greek a-, \"not\" + methustos, \"intoxicated\". Amethyst was considered to be a strong antidote against drunkenness,See, for example:\n*  The earliest reference to amethyst as a symbol of sobriety is in a poem by Asclepiades of Samos (born ~320 BCE). See:  \"XXX. Kleopatra's Ring\" in:  Edward Storer, trans., The Windflowers of Asklepiades and the Poems of Poseidippos (London, England:  Egoist Press, 1920), [https://archive.org/stream/cu31924026460844#page/n17/mode/1up page 14].\n*  An epigram by \"Plato the Younger\" also mentions amethyst in connection with drinking:  \"The stone is an amethyst; but I, the tipler Dionysus, say, \"Let it either persuade me to be sober, or let it learn to get drunk.\"  See:  George Burges et al., The Greek Anthology, … (London, England:  George Bell and Sons, 1881), [https://books.google.com/books?idFDgRAAAAIAAJ&pg\nPA369 p. 369].\n*  Pliny says about amethysts:  \"The falsehoods of the magicians would persuade us that these stones are preventive of inebriety, and that it is from this that they have derived their name.\"  See:  [http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.02.0137%3Abook%3D37%3Achapter%3D40 Chapter 40] of Book 37 of Pliny the Elder's The Natural History. which is why wine goblets were often carved from it. In his poem \"L'Amethyste, ou les Amours de Bacchus et d'Amethyste\" (Amethyst or the loves of Bacchus and Amethyste), the French poet Remy Belleau (1528–1577) invented a myth in which Bacchus, the god of intoxication, of wine, and grapes was pursuing a maiden named Amethyste, who refused his affections. Amethyste prayed to the gods to remain chaste, a prayer which the chaste goddess Diana answered, transforming her into a white stone. Humbled by Amethyste's desire to remain chaste, Bacchus poured wine over the stone as an offering, dyeing the crystals purple.The \"myth\" of Amethyste and Bacchus was invented by the French poet Remy Belleau (1528–1577). See:  \"L'Amethyste, ou les Amours de Bacchus et d'Amethyste\" from Belleau's collection of poems \"Les Amours et Nouveaux Eschanges des Pierres Precieuses:  Vertus & Proprietez d'icelles\" (The loves and new transformations of the precious stones: their virtues and properties), which was published in:  Remy Belleau, Les Amours et Nouveaux Eschanges des Pierres Precieuses … (Paris, France:  Mamert Patisson, 1576), [http://gallica.bnf.fr/ark:/12148/bpt6k522648/f21.image pp. 4–6].\n\nVariations of the story include that Dionysus had been insulted by a mortal and swore to slay the next mortal who crossed his path, creating fierce tigers to carry out his wrath. The mortal turned out to be a beautiful young woman, Amethystos, who was on her way to pay tribute to Artemis. Her life was spared by Artemis, who transformed the maiden into a statue of pure crystalline quartz to protect her from the brutal claws. Dionysus wept tears of wine in remorse for his action at the sight of the beautiful statue. The god's tears then stained the quartz purple.[http://gemstone.org/gem-by-gem/english/amethyst.html The amethyst], Gemstone.org\n\nThis myth and its variations are not found in classical sources. However, the titan Rhea does present Dionysus with an amethyst stone to preserve the wine-drinker's sanity in historical text.Nonnus, Dionysiaca, 12. 380\n\nOther cultural associations\n\nTibetans consider amethyst sacred to the Buddha and make prayer beads from it.Tropical Gemstones, by Carol Clark p.52 Amethyst is considered the birthstone of February.[https://www.americangemsociety.org/february-birthstones February Birthstone | Amethyst]. Americangemsociety.org (2016-01-12). Retrieved on 2016-02-04. In the Middle Ages, it was considered a symbol of royalty and used to decorate English regalia. In the Old World, amethyst was considered one of the Cardinal gems, in that it was one of the five gemstones considered precious above all others, until large deposits were found in Brazil.\n\nGeographic distribution\n\nAmethyst is produced in abundance from the state of Minas Gerais in Brazil where it occurs in large geodes within volcanic rocks. Many of the hollow agates of southwestern Brazil and Uruguay contain a crop of amethyst crystals in the interior. Artigas, Uruguay and neighboring Brazilian state Rio Grande do Sul are large world producers exceeding in quantity Minas Gerais, as well as Mato Grosso, Espirito Santo, Bahia, and Ceará states, all amethyst producers of importance in Brazil.\n\nIt is also found and mined in South Korea. The largest opencast amethyst vein in the world is in Maissau, Lower Austria. Much fine amethyst comes from Russia, especially from near Mursinka in the Ekaterinburg district, where it occurs in drusy cavities in granitic rocks. Many localities in south India yield amethyst. One of the largest global amethyst producers is Zambia in southern Africa with an annual production of about 1000 tons.\n\nAmethyst occurs at many localities in the United States. Among these may be mentioned: the Mazatzal Mountain region in Gila and Maricopa Counties, Arizona; Red Feather Lakes, near Ft Collins, Colorado; Amethyst Mountain, Texas; Yellowstone National Park; Delaware County, Pennsylvania; Haywood County, North Carolina; Deer Hill and Stow, Maine and in the Lake Superior region of Minnesota, Wisconsin and Michigan. Amethyst is relatively common in the Canadian provinces of Ontario and  Nova Scotia. The largest amethyst mine in North America is located in Thunder Bay, Ontario.\n  Amethyst is the official state gemstone of South Carolina.  Several South Carolina amethysts are on display at the Smithsonian Museum of Natural History.[http://www.sciway.net/facts/sc-state-gemstone-amethyst.html South Carolina State Gemstone - Amethyst]. Sciway.net (1969-06-24). Retrieved on 2016-02-04.\n\nValue\n\nUp until the 18th century, amethyst was included in the cardinal, or most valuable, gemstones (along with diamond, sapphire, ruby, and emerald). However, since the discovery of extensive deposits in locations such as Brazil, it has lost most of its value.\n\nCollectors look for depth of color, possibly with red flashes if cut conventionally. As amethyst is readily available in large structures the value of the gem is not primarily defined by carat weight; this is different to most gemstones where the carat weight exponentially increases the value of the stone. The biggest factor in the value of amethyst is the color displayed.\n\nThe highest grade amethyst (called \"Deep Russian\") is exceptionally rare and therefore, when one is found, its value is dependent on the demand of collectors. It is, however, still orders of magnitude lower than the highest grade sapphires or rubies (padparadscha sapphire or \"pigeon's blood\" ruby).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Amethyst" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1366" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Amethyst is a violet variety of quartz often used in jewelry. \n\nThe name comes from the Koine Greek ἀμέθυστος amethystos from ἀ- a-, \"not\" and μεθύσκω methysko / μεθύω methyo, \"intoxicate\", a reference to the belief that the stone protected its owner from drunkenness. The ancient Greeks wore amethyst and carved drinking vessels from it in the belief that it would prevent intoxication. \n\nIt is one of several forms of quartz. Amethyst is a semiprecious stone and is the traditional birthstone for February.\n\nStructure\n\nAmethyst is a purple variety of quartz (SiO2) and owes its violet color to irradiation, iron impurities (in some cases in conjunction with transition element impurities), and the presence of trace elements, which result in complex crystal lattice substitutions.Norman N. Greenwood and Alan Earnshaw (1997). Chemistry of the Elements (2nd ed.). Butterworth–Heinemann. .Michael O'Donoghue (2006), Gems, Butterworth-Heinemann, 6th ed.  The hardness of the mineral is the same as quartz, thus it is suitable for use in jewelry.\n\nHue and tone\n\nAmethyst occurs in primary hues from a light pinkish violet to a deep purple. Amethyst may exhibit one or both secondary hues, red and blue. The best varieties of amethyst can be found in Siberia, Sri Lanka, Brazil and the far East. The ideal grade is called \"Deep Siberian\" and has a primary purple hue of around 75–80%, with 15–20% blue and (depending on the light source) red secondary hues.Richard W. Wise (2005), Secrets of the Gem Trade; The Connoisseur's Guide to Precious Gemstones, Brunswick House Press, Lenox, Mass.,  Green quartz is sometimes incorrectly called green amethyst, which is a misnomer and not an appropriate name for the material, the proper terminology being prasiolite. Other names for green quartz are vermarine or lime citrine.\n\nOf very variable intensity, the color of amethyst is often laid out in stripes parallel to the final faces of the crystal. One aspect in the art of lapidary involves correctly cutting the stone to place the color in a way that makes the tone of the finished gem homogeneous. Often, the fact that sometimes only a thin surface layer of violet color is present in the stone or that the color is not homogeneous makes for a difficult cutting.\n\nThe color of amethyst has been demonstrated to result from substitution by irradiation of trivalent iron (Fe3+) for silicon in the structure, in the presence of trace elements of large ionic radius, and, to a certain extent, the amethyst color can naturally result from displacement of transition elements even if the iron concentration is low. Natural amethyst is dichroic in reddish violet and bluish violet, but when heated, turns yellow-orange, yellow-brown, or dark brownish and may resemble citrine,[http://www.mindat.org/min-198.html Amethyst]. Mindat.org but loses its dichroism, unlike genuine citrine. When partially heated, amethyst can result in ametrine.\n\nAmethyst can fade in tone if overexposed to light sources and can be artificially darkened with adequate irradiation.\n\nHistory\n\nAmethyst was used as a gemstone by the ancient Egyptians and was largely employed in antiquity for intaglio engraved gems.Augosto Castellani (famous Italian 19th century jeweler) (1871), [https://books.google.com/books?id\nBwEYAAAAYAAJ&printsec=frontcover Gems, Notes and Extracts], p. 34, London, Bell and Daldy, .\n\nThe Greeks believed amethyst gems could prevent intoxication,Marcell N. Smith (1913), [http://www.farlang.com/gemstones/smith-diamonds-pearls-stones/page_087 Diamonds, Pearls and Precious Stones] Griffith Stillings Press, Boston, Mass., p. 74 while medieval European soldiers wore amethyst amulets as protection in battle in the belief that amethysts heal people and keep them cool-headed.George Frederick Kunz (1913), [http://www.farlang.com/gemstones/kunz-curious-lore-stones/page_077 Curious Lore of Precious Stones], Lippincott Company, Philadelphia & London, p. 77 Beads of amethyst were found in Anglo-Saxon graves in England.Michael Lapidge (ed.) (2000), [https://books.google.com/books?id\nf65VUNvxQjkC&pgPA261& The Blackwell Encyclopaedia of Anglo-Saxon England], p. 261, . Anglican bishops wear an episcopal ring often set with an amethyst, an allusion to the description of the Apostles as \"not drunk\" at Pentecost in Acts 2:15.\n\nA large geode, or \"amethyst-grotto\", from near Santa Cruz in southern Brazil was presented at a 1902 exhibition in Düsseldorf, Germany.\n\nIn the 19th century, the color of amethyst was attributed to the presence of manganese. However, since it can be greatly altered and even discharged by heat, the color was believed by some authorities to be from an organic source. Ferric thiocyanate has been suggested, and sulfur was said to have been detected in the mineral.\n\nSynthetic amethyst\n\nSynthetic (laboratory-grown) amethyst is produced by a synthesis method called hydrothermal growth, which grows the crystals inside a high-pressure autoclave.\n\nSynthetic amethyst is made to imitate the best quality amethyst. Its chemical and physical properties are the same to that of natural amethyst and it can not be differentiated with absolute certainty without advanced gemmological testing (which is often cost-prohibitive). There is one test based on \"Brazil law twinning\" (a form of quartz twinning where right and left hand quartz structures are combined in a single crystal) which can be used to identify synthetic amethyst rather easily. It is possible to synthesize twinned amethyst, but this type is not available in large quantities in the market.\n\nSingle-crystal quartz is very desirable in the industry, particularly for keeping the regular vibrations necessary for quartz movements in watches and clocks, which is where a lot of synthetic quartz is used.\n\nTreated amethyst is produced by gamma ray, X-ray or electron beam irradiation of clear quartz (rock crystal) which has been first doped with ferric impurities. On exposure to heat, the irradiation effects can be partially cancelled and amethyst generally becomes yellow or even green, and much of the citrine, cairngorm, or yellow quartz of jewelry is said to be merely \"burnt amethyst\".\n\nCultural history\n\nAncient Greece\n\nThe Greek word \"amethystos\" may be translated as \"not drunken\", from Greek a-, \"not\" + methustos, \"intoxicated\". Amethyst was considered to be a strong antidote against drunkenness,See, for example:\n*  The earliest reference to amethyst as a symbol of sobriety is in a poem by Asclepiades of Samos (born ~320 BCE). See:  \"XXX. Kleopatra's Ring\" in:  Edward Storer, trans., The Windflowers of Asklepiades and the Poems of Poseidippos (London, England:  Egoist Press, 1920), [https://archive.org/stream/cu31924026460844#page/n17/mode/1up page 14].\n*  An epigram by \"Plato the Younger\" also mentions amethyst in connection with drinking:  \"The stone is an amethyst; but I, the tipler Dionysus, say, \"Let it either persuade me to be sober, or let it learn to get drunk.\"  See:  George Burges et al., The Greek Anthology, … (London, England:  George Bell and Sons, 1881), [https://books.google.com/books?idFDgRAAAAIAAJ&pg\nPA369 p. 369].\n*  Pliny says about amethysts:  \"The falsehoods of the magicians would persuade us that these stones are preventive of inebriety, and that it is from this that they have derived their name.\"  See:  [http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.02.0137%3Abook%3D37%3Achapter%3D40 Chapter 40] of Book 37 of Pliny the Elder's The Natural History. which is why wine goblets were often carved from it. In his poem \"L'Amethyste, ou les Amours de Bacchus et d'Amethyste\" (Amethyst or the loves of Bacchus and Amethyste), the French poet Remy Belleau (1528–1577) invented a myth in which Bacchus, the god of intoxication, of wine, and grapes was pursuing a maiden named Amethyste, who refused his affections. Amethyste prayed to the gods to remain chaste, a prayer which the chaste goddess Diana answered, transforming her into a white stone. Humbled by Amethyste's desire to remain chaste, Bacchus poured wine over the stone as an offering, dyeing the crystals purple.The \"myth\" of Amethyste and Bacchus was invented by the French poet Remy Belleau (1528–1577). See:  \"L'Amethyste, ou les Amours de Bacchus et d'Amethyste\" from Belleau's collection of poems \"Les Amours et Nouveaux Eschanges des Pierres Precieuses:  Vertus & Proprietez d'icelles\" (The loves and new transformations of the precious stones: their virtues and properties), which was published in:  Remy Belleau, Les Amours et Nouveaux Eschanges des Pierres Precieuses … (Paris, France:  Mamert Patisson, 1576), [http://gallica.bnf.fr/ark:/12148/bpt6k522648/f21.image pp. 4–6].\n\nVariations of the story include that Dionysus had been insulted by a mortal and swore to slay the next mortal who crossed his path, creating fierce tigers to carry out his wrath. The mortal turned out to be a beautiful young woman, Amethystos, who was on her way to pay tribute to Artemis. Her life was spared by Artemis, who transformed the maiden into a statue of pure crystalline quartz to protect her from the brutal claws. Dionysus wept tears of wine in remorse for his action at the sight of the beautiful statue. The god's tears then stained the quartz purple.[http://gemstone.org/gem-by-gem/english/amethyst.html The amethyst], Gemstone.org\n\nThis myth and its variations are not found in classical sources. However, the titan Rhea does present Dionysus with an amethyst stone to preserve the wine-drinker's sanity in historical text.Nonnus, Dionysiaca, 12. 380\n\nOther cultural associations\n\nTibetans consider amethyst sacred to the Buddha and make prayer beads from it.Tropical Gemstones, by Carol Clark p.52 Amethyst is considered the birthstone of February.[https://www.americangemsociety.org/february-birthstones February Birthstone | Amethyst]. Americangemsociety.org (2016-01-12). Retrieved on 2016-02-04. In the Middle Ages, it was considered a symbol of royalty and used to decorate English regalia. In the Old World, amethyst was considered one of the Cardinal gems, in that it was one of the five gemstones considered precious above all others, until large deposits were found in Brazil.\n\nGeographic distribution\n\nAmethyst is produced in abundance from the state of Minas Gerais in Brazil where it occurs in large geodes within volcanic rocks. Many of the hollow agates of southwestern Brazil and Uruguay contain a crop of amethyst crystals in the interior. Artigas, Uruguay and neighboring Brazilian state Rio Grande do Sul are large world producers exceeding in quantity Minas Gerais, as well as Mato Grosso, Espirito Santo, Bahia, and Ceará states, all amethyst producers of importance in Brazil.\n\nIt is also found and mined in South Korea. The largest opencast amethyst vein in the world is in Maissau, Lower Austria. Much fine amethyst comes from Russia, especially from near Mursinka in the Ekaterinburg district, where it occurs in drusy cavities in granitic rocks. Many localities in south India yield amethyst. One of the largest global amethyst producers is Zambia in southern Africa with an annual production of about 1000 tons.\n\nAmethyst occurs at many localities in the United States. Among these may be mentioned: the Mazatzal Mountain region in Gila and Maricopa Counties, Arizona; Red Feather Lakes, near Ft Collins, Colorado; Amethyst Mountain, Texas; Yellowstone National Park; Delaware County, Pennsylvania; Haywood County, North Carolina; Deer Hill and Stow, Maine and in the Lake Superior region of Minnesota, Wisconsin and Michigan. Amethyst is relatively common in the Canadian provinces of Ontario and  Nova Scotia. The largest amethyst mine in North America is located in Thunder Bay, Ontario.\n  Amethyst is the official state gemstone of South Carolina.  Several South Carolina amethysts are on display at the Smithsonian Museum of Natural History.[http://www.sciway.net/facts/sc-state-gemstone-amethyst.html South Carolina State Gemstone - Amethyst]. Sciway.net (1969-06-24). Retrieved on 2016-02-04.\n\nValue\n\nUp until the 18th century, amethyst was included in the cardinal, or most valuable, gemstones (along with diamond, sapphire, ruby, and emerald). However, since the discovery of extensive deposits in locations such as Brazil, it has lost most of its value.\n\nCollectors look for depth of color, possibly with red flashes if cut conventionally. As amethyst is readily available in large structures the value of the gem is not primarily defined by carat weight; this is different to most gemstones where the carat weight exponentially increases the value of the stone. The biggest factor in the value of amethyst is the color displayed.\n\nThe highest grade amethyst (called \"Deep Russian\") is exceptionally rare and therefore, when one is found, its value is dependent on the demand of collectors. It is, however, still orders of magnitude lower than the highest grade sapphires or rubies (padparadscha sapphire or \"pigeon's blood\" ruby). Amethyst. http://en.wikipedia.org/?curid=1366."
  }
}
