{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5197",
  "eid" : "d2ca1c30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778433395,
  "textBody" : "Transportation in Canada, the world's second-largest country in total area, is dedicated to having an efficient, high-capacity multimodal transport spanning often vast distances between natural resource extraction sites, agricultural and urban areas. Canada's transportation system includes more than 1400000 km of roads, 10 major international airports, 300 smaller airports, 72093 km of functioning railway track, and more than 300 commercial ports and harbours that provide access to the Pacific, Atlantic and Arctic oceans as well as the Great Lakes and the St. Lawrence Seaway. In 2005, the transportation sector made up 4.2% of Canada's GDP, compared to 3.7% for Canada's mining and oil and gas extraction industries.\n\nTransport Canada oversees and regulates most aspects of transportation within federal jurisdiction, including interprovincial transport. This primarily includes rail, air and maritime transportation. Transport Canada is under the direction of the federal government's Minister of Transport. The Transportation Safety Board of Canada is responsible for maintaining transportation safety in Canada by investigating accidents and making safety recommendations.\n\nRoads\n\nThere is a total of 1042300 km of roads in Canada, of which 415600 km are paved, including 17000 km of expressways (the third-longest in the world, behind the Interstate Highway System of the United States and the China's National Trunk Highway System). As of 2008, 626700 km were unpaved.\n\nIn 2009, there were 20,706,616 road vehicles registered in Canada, of which 96% were vehicles under , 2.4% were vehicles between  tonnes and 1.6% were 15 t or greater. These vehicles travelled a total of 333.29 billion kilometres, of which 303.6 billion was for vehicles under , 8.3 billion was for vehicles between  and 21.4 billion was for vehicles over 15 t. For the  trucks, 88.9% of vehicle-kilometres were intra-province trips, 4.9% were inter-province, 2.8% were between Canada and the US and 3.4% made outside of Canada. For trucks over 15 t, 59.1% of vehicle-kilometres were intra-province trips, 20% inter-province trips, 13.8% Canada-US trips and 7.1% trips made outside of Canada.\n\nCanada's vehicles consumed a total of  of gasoline and  of diesel. Trucking generated 35% of the total GDP from transport, compared to 25% for rail, water and air combined (the remainder being generated by the industry's transit, pipeline, scenic and support activities). Hence roads are the dominant means of passenger and freight transport in Canada.\n\nRoads and highways were managed by provincial and municipal authorities until construction of the Northwest Highway System (the Alaska Highway) and the Trans-Canada Highway project initiation. The Alaska Highway of 1942 was constructed during World War II for military purposes connecting Fort St. John, British Columbia with Fairbanks, Alaska. The transcontinental highway, a joint national and provincial expenditure, was begun in 1949 under the initiation of the Trans Canada Highway Act on December 10, 1949. The 7821 km highway was completed in 1962 at a total expenditure of $1.4 billion.\n\nInternationally, Canada has road links with both the lower 48 US states and Alaska. The Ministry of Transportation maintains the road network in Ontario and also employs Ministry of Transport Enforcement Officers for the purpose of administering the Canada Transportation Act and related regulations. The Department of Transportation in New Brunswick performs a similar task in that province as well.\n\nRegulations enacted in regards to Canada highways are the 1971 Motor Vehicle Safety Act and the 1990 Highway Traffic Act\n\nThe safety of Canada's roads is moderately good by international standards, and is improving both in terms of accidents per head of population and per billion vehicle kilometers.\n\nAir transport\n\nAir transportation made up 9% of the transport sector's GDP generation in 2005. Canada's largest air carrier and its flag carrier is Air Canada, which had 34 million customers in 2006 and, as of April 2010, operates 363 aircraft (including Air Canada Jazz).[http://wwwapps2.tc.gc.ca/Saf-Sec-Sur/2/ccarcs/aspscripts/en/quicksearch.asp Transport Canada listing of aircraft owned by Air Canada and Air Canada Jazz] (enter Air Canada (226 aircraft), Jazz Air LP (137 aircraft), Canadian Helicopters or Westjet in the box titled \"Owner Name\") CHC Helicopter, the largest commercial helicopter operator in the world, is second with 142 aircraft and WestJet, a low-cost carrier formed in 1996, is third with 100 aircraft. Canada's airline industry saw significant change following the signing of the US-Canada open skies agreement in 1995, when the marketplace became less regulated and more competitive.\n\nThe Canadian Transportation Agency employs transportation enforcement officers to maintain aircraft safety standards, and conduct periodic aircraft inspections, of all air carriers. The Canadian Air Transport Security Authority is charged with the responsibility for the security of air traffic within Canada. In 1994 the National Airports Policy was enacted\n\nPrincipal airports\n\nOf over 1,800 registered Canadian aerodromes, certified airports, heliports, and floatplane bases, 26 are specially designated under Canada's National Airports System (NAS): these include all airports that handle 200,000 or more passengers each year, as well as the principal airport serving each federal, provincial, and territorial capital. However, since the introduction of the policy only one, Iqaluit Airport, has been added and no airports have been removed despite dropping below 200,000 passengers. The Government of Canada, with the exception of the three territorial capitals, retains ownership of these airports and leases them to local authorities. The next tier consists of 64 regional/local airports formerly owned by the federal government, most of which have now been transferred to other owners (most often to municipalities).\n\nBelow is a table of Canada's ten biggest airports by passenger traffic in 2011.[http://www.aci-na.org/content/airport-traffic-reports Airports Council International Reports 2011]\n\nRailways\n\nIn 2007, Canada had a total of 72212 km of freight and passenger railway, of which 31 km is electrified. While intercity passenger transportation by rail is now very limited, freight transport by rail remains common. Total revenues of rail services in 2006 was $10.4 billion, of which only 2.8% was from passenger services. The Canadian National and Canadian Pacific Railway are Canada's two major freight railway companies, each having operations throughout North America. In 2007, 357 billion tonne-kilometres of freight were transported by rail, and 4.33 million passengers travelled 1.44 billion passenger-kilometres (an almost negligible amount compared to the 491 billion passenger-kilometres made in light road vehicles). 34,281 people were employed by the rail industry in the same year.\n\nNationwide passenger services are provided by the federal crown corporation Via Rail. Three Canadian cities have commuter rail services: in the Montreal area by AMT, in the Toronto area by GO Transit, and in the Vancouver area by West Coast Express. Smaller railways such as Ontario Northland, Rocky Mountaineer, and Algoma Central also run passenger trains to remote rural areas.\n\nIn Canada railways are served by standard gauge, , rails. See also track gauge in Canada.\n\nCanada has railway links with the lower 48 US States, but no connection with Alaska other than a train ferry service from Prince Rupert, British Columbia, although a line has been proposed. There are no other international rail connections.\n\nWaterways\n\nIn 2005, 139.2 million tonnes of cargo was loaded and unloaded at Canadian ports. The Port of Vancouver is the busiest port in Canada, moving 68 million tonnes or 15% of Canada's total in domestic and international shipping in 2003.\n\nTransport Canada oversees most of the regulatory functions related to marine registration, safety of large vessel, and port pilotage duties. Many of Canada's port facilities are in the process of being divested from federal responsibility to other agencies or municipalities.\n\nInland waterways comprise 3000 km, including the St. Lawrence Seaway. Transport Canada enforces acts and regulations governing water transportation and safety.\n\nFerry services\n\n*Passenger ferry service\n:Vancouver Island to the mainland\n:several Sunshine Coast communities to the mainland and to Alaska.\n:Internationally to St. Pierre and Miquelon\n*Automobile ferry service\n:Nova Scotia to Newfoundland and Labrador,\n:Quebec to Newfoundland across the Strait of Belle Isle\n:Labrador and the island of Newfoundland.\n:Chandler to the Magdalen Islands, Quebec\n:Prince Edward Island to the Magdalen Islands, Quebec\n:Prince Edward Island to Nova Scotia\n:Digby, Nova Scotia, to Saint John, New Brunswick\n*Train ferry service\n:British Columbia to Alaska or Washington state.\n\nCanals\n\nThe St. Lawrence waterway was at one time the world's greatest inland water navigation system. The main route canals of Canada are those of the St. Lawrence River and the Great Lakes. The others are subsidiary canals.\n* St. Lawrence Seaway\n* Welland Canal\n* Soo Locks\n* Trent-Severn Waterway\n* Rideau Canal\n\nPorts and harbours\n\nThe National Harbours Board administered Halifax, Saint John, Chicoutimi, Trois-Rivières, Churchill, and Vancouver until 1983. At one time, over 300 harbours across Canada were supervised by the Department of Transport.  A program of divestiture was implemented around the turn of the millennium, and as of 2014, 493 of the 549 sites identified for divestiture in 1995 have been sold or otherwise transferred,[http://actionplan.gc.ca/en/initiative/strengthening-canadas-port-system actionplan.gc.ca: \"Strengthening Canada’s Port System\"] as indicated by a DoT list.[http://www.tc.gc.ca/eng/programs/ports-deproclamationnotice2%281%29-1111.htm tc.gc.ca: \"Deproclamation Notice Subsection 2(1)\"] The government maintains an active divestiture programme,[http://www.tc.gc.ca/eng/programs/ports-menu-1127.htm tc.gc.ca: \"Port Programs\"] and after divestiture Transport Canada oversees only 17 Canada Port Authorities for the 17 largest shipping ports.[https://web.archive.org/web/20090303202248/http://www.tc.gc.ca/programs/ports/index.htm tc.gc.ca: \"Ports\"], archive.org 3 March 2009\n\nWest coast\n\n*Victoria, British Columbia\n*Vancouver, British Columbia\n*New Westminster, British Columbia\n*Prince Rupert, British Columbia\n\nEast coast\n\n*Halifax, Nova Scotia\n*Saint John, New Brunswick\n*St. John's, Newfoundland and Labrador\n*Sept-Îles, Quebec\n*Sydney, Nova Scotia\n*Botwood, Newfoundland and Labrador\n\nNorthern and central\n\n*Bécancour, Quebec\n*Churchill, Manitoba\n*Hamilton, Ontario\n*Montreal, Quebec\n*Quebec City, Quebec\n*Trois-Rivières, Quebec\n*Thunder Bay, Ontario\n*Toronto, Ontario\n*Windsor, Ontario\n\nMerchant marine\n\nCanada's merchant marine comprised a total of 173 ships ( or over)  or  at the end of 2007.\n\nPipelines\n\nPipelines are part of the energy extraction and transportation network of Canada and are used to transport natural gas, natural gas liquids, crude oil, synthetic crude and other petroleum based products. Canada has 23564 km of pipeline for transportation of crude and refined oil, and 74980 km for liquefied petroleum gas.\n\nPublic transit\n\nMost Canadian cities have public transport, if only a bus system. Three Canadian cities have rapid transit systems, four have light rail systems, and three have commuter rail systems (see below). In 2006, 11% of Canadians used public transportation to get to work. This compares to 80.0% that got to work using a car (72.3% by driving, 7.7% as a passenger), 6.4% that walked and 1.3% that rode a bike.\n\nRapid transit systems\n\nThere are three rapid transit systems operating in Canada: the Montreal Metro, the Toronto subway, and the Vancouver SkyTrain.\n\nThere is also an Airport Circulator, the LINK Train, at Toronto Pearson International Airport. It operates 24 hours a day, 7 days a week and is wheelchair-accessible. It is free of cost.\n\nLight rail systems\n\nThree cities have light rail systems—the Calgary CTrain, the Edmonton Light Rail Transit, and the O-Train in Ottawa—and Toronto has an extensive streetcar system.\n\nCommuter train systems\n\nCommuter trains serve the cities and surrounding areas of Montreal, Toronto and Vancouver:\n\nHistory\n\nThe standard history covers the French regime, fur traders, the canals, and early roads, and gives extensive attention to the railways.G.P. de T. Glazebrook, A history of transportation in Canada (1938; reprinted 1969)\n\nEuropean contact\n\nAboriginal peoples in Canada walked. They also used  canoes, kayaks, umiaks and Bull Boats, in addition to the snowshoe, toboggan and sled in winter. They had no wheeled vehicles, and no animals larger than dogs.\n\nEuropeans adopted canoes as they pushed deeper into the continent's interior, and were thus able to travel via the waterways that fed from the St. Lawrence River and Hudson Bay.[http://www.collectionscanada.ca/virtual-vault/ Virtual Vault], an online exhibition of Canadian historical art at Library and Archives Canada\n\nIn the 19th century and early 20th century transportation relied on harnessing oxen to Red River ox carts or horse to waggon. Maritime transportation was via manual labour such as canoe or wind on sail. Water or land travel speeds was approximately 8 to.\n\nSettlement was along river routes. Agricultural commodities were perishable, and trade centres were within 50 km. Rural areas centred around villages, and they were approximately 10 km apart. The advent of steam railways and steamships connected resources and markets of vast distances in the late 19th century. Railways also connected city centres, in such a way that the traveller went by sleeper, railway hotel, to the cities. Crossing the country by train took four or five days, as it still does by car. People generally lived within 5 mi of the downtown core thus the train could be used for inter-city travel and the tram for commuting.\n\nThe advent of the interstate or Trans-Canada Highway in Canada in 1963 established ribbon development, truck stops, and industrial corridors along throughways.\n\nEvolution\n\nThe Federal Department of Transport (established 2 November 1936) supervised railways, canals, harbours, marine and shipping, civil aviation, radio and meteorology. The Transportation Act of 1938 and the amended Railway Act, placed control and regulation of carriers in the hands of the Board of Transport commissioners for Canada. The Royal Commission on Transportation was formed 29 December 1948, to examine transportation services to all areas of Canada to eliminate economic or geographic disadvantages. The Commission also reviewed the Railway Act to provide uniform yet competitive freight-rates.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Transportation in Canada" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5197" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Transportation in Canada, the world's second-largest country in total area, is dedicated to having an efficient, high-capacity multimodal transport spanning often vast distances between natural resource extraction sites, agricultural and urban areas. Canada's transportation system includes more than 1400000 km of roads, 10 major international airports, 300 smaller airports, 72093 km of functioning railway track, and more than 300 commercial ports and harbours that provide access to the Pacific, Atlantic and Arctic oceans as well as the Great Lakes and the St. Lawrence Seaway. In 2005, the transportation sector made up 4.2% of Canada's GDP, compared to 3.7% for Canada's mining and oil and gas extraction industries.\n\nTransport Canada oversees and regulates most aspects of transportation within federal jurisdiction, including interprovincial transport. This primarily includes rail, air and maritime transportation. Transport Canada is under the direction of the federal government's Minister of Transport. The Transportation Safety Board of Canada is responsible for maintaining transportation safety in Canada by investigating accidents and making safety recommendations.\n\nRoads\n\nThere is a total of 1042300 km of roads in Canada, of which 415600 km are paved, including 17000 km of expressways (the third-longest in the world, behind the Interstate Highway System of the United States and the China's National Trunk Highway System). As of 2008, 626700 km were unpaved.\n\nIn 2009, there were 20,706,616 road vehicles registered in Canada, of which 96% were vehicles under , 2.4% were vehicles between  tonnes and 1.6% were 15 t or greater. These vehicles travelled a total of 333.29 billion kilometres, of which 303.6 billion was for vehicles under , 8.3 billion was for vehicles between  and 21.4 billion was for vehicles over 15 t. For the  trucks, 88.9% of vehicle-kilometres were intra-province trips, 4.9% were inter-province, 2.8% were between Canada and the US and 3.4% made outside of Canada. For trucks over 15 t, 59.1% of vehicle-kilometres were intra-province trips, 20% inter-province trips, 13.8% Canada-US trips and 7.1% trips made outside of Canada.\n\nCanada's vehicles consumed a total of  of gasoline and  of diesel. Trucking generated 35% of the total GDP from transport, compared to 25% for rail, water and air combined (the remainder being generated by the industry's transit, pipeline, scenic and support activities). Hence roads are the dominant means of passenger and freight transport in Canada.\n\nRoads and highways were managed by provincial and municipal authorities until construction of the Northwest Highway System (the Alaska Highway) and the Trans-Canada Highway project initiation. The Alaska Highway of 1942 was constructed during World War II for military purposes connecting Fort St. John, British Columbia with Fairbanks, Alaska. The transcontinental highway, a joint national and provincial expenditure, was begun in 1949 under the initiation of the Trans Canada Highway Act on December 10, 1949. The 7821 km highway was completed in 1962 at a total expenditure of $1.4 billion.\n\nInternationally, Canada has road links with both the lower 48 US states and Alaska. The Ministry of Transportation maintains the road network in Ontario and also employs Ministry of Transport Enforcement Officers for the purpose of administering the Canada Transportation Act and related regulations. The Department of Transportation in New Brunswick performs a similar task in that province as well.\n\nRegulations enacted in regards to Canada highways are the 1971 Motor Vehicle Safety Act and the 1990 Highway Traffic Act\n\nThe safety of Canada's roads is moderately good by international standards, and is improving both in terms of accidents per head of population and per billion vehicle kilometers.\n\nAir transport\n\nAir transportation made up 9% of the transport sector's GDP generation in 2005. Canada's largest air carrier and its flag carrier is Air Canada, which had 34 million customers in 2006 and, as of April 2010, operates 363 aircraft (including Air Canada Jazz).[http://wwwapps2.tc.gc.ca/Saf-Sec-Sur/2/ccarcs/aspscripts/en/quicksearch.asp Transport Canada listing of aircraft owned by Air Canada and Air Canada Jazz] (enter Air Canada (226 aircraft), Jazz Air LP (137 aircraft), Canadian Helicopters or Westjet in the box titled \"Owner Name\") CHC Helicopter, the largest commercial helicopter operator in the world, is second with 142 aircraft and WestJet, a low-cost carrier formed in 1996, is third with 100 aircraft. Canada's airline industry saw significant change following the signing of the US-Canada open skies agreement in 1995, when the marketplace became less regulated and more competitive.\n\nThe Canadian Transportation Agency employs transportation enforcement officers to maintain aircraft safety standards, and conduct periodic aircraft inspections, of all air carriers. The Canadian Air Transport Security Authority is charged with the responsibility for the security of air traffic within Canada. In 1994 the National Airports Policy was enacted\n\nPrincipal airports\n\nOf over 1,800 registered Canadian aerodromes, certified airports, heliports, and floatplane bases, 26 are specially designated under Canada's National Airports System (NAS): these include all airports that handle 200,000 or more passengers each year, as well as the principal airport serving each federal, provincial, and territorial capital. However, since the introduction of the policy only one, Iqaluit Airport, has been added and no airports have been removed despite dropping below 200,000 passengers. The Government of Canada, with the exception of the three territorial capitals, retains ownership of these airports and leases them to local authorities. The next tier consists of 64 regional/local airports formerly owned by the federal government, most of which have now been transferred to other owners (most often to municipalities).\n\nBelow is a table of Canada's ten biggest airports by passenger traffic in 2011.[http://www.aci-na.org/content/airport-traffic-reports Airports Council International Reports 2011]\n\nRailways\n\nIn 2007, Canada had a total of 72212 km of freight and passenger railway, of which 31 km is electrified. While intercity passenger transportation by rail is now very limited, freight transport by rail remains common. Total revenues of rail services in 2006 was $10.4 billion, of which only 2.8% was from passenger services. The Canadian National and Canadian Pacific Railway are Canada's two major freight railway companies, each having operations throughout North America. In 2007, 357 billion tonne-kilometres of freight were transported by rail, and 4.33 million passengers travelled 1.44 billion passenger-kilometres (an almost negligible amount compared to the 491 billion passenger-kilometres made in light road vehicles). 34,281 people were employed by the rail industry in the same year.\n\nNationwide passenger services are provided by the federal crown corporation Via Rail. Three Canadian cities have commuter rail services: in the Montreal area by AMT, in the Toronto area by GO Transit, and in the Vancouver area by West Coast Express. Smaller railways such as Ontario Northland, Rocky Mountaineer, and Algoma Central also run passenger trains to remote rural areas.\n\nIn Canada railways are served by standard gauge, , rails. See also track gauge in Canada.\n\nCanada has railway links with the lower 48 US States, but no connection with Alaska other than a train ferry service from Prince Rupert, British Columbia, although a line has been proposed. There are no other international rail connections.\n\nWaterways\n\nIn 2005, 139.2 million tonnes of cargo was loaded and unloaded at Canadian ports. The Port of Vancouver is the busiest port in Canada, moving 68 million tonnes or 15% of Canada's total in domestic and international shipping in 2003.\n\nTransport Canada oversees most of the regulatory functions related to marine registration, safety of large vessel, and port pilotage duties. Many of Canada's port facilities are in the process of being divested from federal responsibility to other agencies or municipalities.\n\nInland waterways comprise 3000 km, including the St. Lawrence Seaway. Transport Canada enforces acts and regulations governing water transportation and safety.\n\nFerry services\n\n*Passenger ferry service\n:Vancouver Island to the mainland\n:several Sunshine Coast communities to the mainland and to Alaska.\n:Internationally to St. Pierre and Miquelon\n*Automobile ferry service\n:Nova Scotia to Newfoundland and Labrador,\n:Quebec to Newfoundland across the Strait of Belle Isle\n:Labrador and the island of Newfoundland.\n:Chandler to the Magdalen Islands, Quebec\n:Prince Edward Island to the Magdalen Islands, Quebec\n:Prince Edward Island to Nova Scotia\n:Digby, Nova Scotia, to Saint John, New Brunswick\n*Train ferry service\n:British Columbia to Alaska or Washington state.\n\nCanals\n\nThe St. Lawrence waterway was at one time the world's greatest inland water navigation system. The main route canals of Canada are those of the St. Lawrence River and the Great Lakes. The others are subsidiary canals.\n* St. Lawrence Seaway\n* Welland Canal\n* Soo Locks\n* Trent-Severn Waterway\n* Rideau Canal\n\nPorts and harbours\n\nThe National Harbours Board administered Halifax, Saint John, Chicoutimi, Trois-Rivières, Churchill, and Vancouver until 1983. At one time, over 300 harbours across Canada were supervised by the Department of Transport.  A program of divestiture was implemented around the turn of the millennium, and as of 2014, 493 of the 549 sites identified for divestiture in 1995 have been sold or otherwise transferred,[http://actionplan.gc.ca/en/initiative/strengthening-canadas-port-system actionplan.gc.ca: \"Strengthening Canada’s Port System\"] as indicated by a DoT list.[http://www.tc.gc.ca/eng/programs/ports-deproclamationnotice2%281%29-1111.htm tc.gc.ca: \"Deproclamation Notice Subsection 2(1)\"] The government maintains an active divestiture programme,[http://www.tc.gc.ca/eng/programs/ports-menu-1127.htm tc.gc.ca: \"Port Programs\"] and after divestiture Transport Canada oversees only 17 Canada Port Authorities for the 17 largest shipping ports.[https://web.archive.org/web/20090303202248/http://www.tc.gc.ca/programs/ports/index.htm tc.gc.ca: \"Ports\"], archive.org 3 March 2009\n\nWest coast\n\n*Victoria, British Columbia\n*Vancouver, British Columbia\n*New Westminster, British Columbia\n*Prince Rupert, British Columbia\n\nEast coast\n\n*Halifax, Nova Scotia\n*Saint John, New Brunswick\n*St. John's, Newfoundland and Labrador\n*Sept-Îles, Quebec\n*Sydney, Nova Scotia\n*Botwood, Newfoundland and Labrador\n\nNorthern and central\n\n*Bécancour, Quebec\n*Churchill, Manitoba\n*Hamilton, Ontario\n*Montreal, Quebec\n*Quebec City, Quebec\n*Trois-Rivières, Quebec\n*Thunder Bay, Ontario\n*Toronto, Ontario\n*Windsor, Ontario\n\nMerchant marine\n\nCanada's merchant marine comprised a total of 173 ships ( or over)  or  at the end of 2007.\n\nPipelines\n\nPipelines are part of the energy extraction and transportation network of Canada and are used to transport natural gas, natural gas liquids, crude oil, synthetic crude and other petroleum based products. Canada has 23564 km of pipeline for transportation of crude and refined oil, and 74980 km for liquefied petroleum gas.\n\nPublic transit\n\nMost Canadian cities have public transport, if only a bus system. Three Canadian cities have rapid transit systems, four have light rail systems, and three have commuter rail systems (see below). In 2006, 11% of Canadians used public transportation to get to work. This compares to 80.0% that got to work using a car (72.3% by driving, 7.7% as a passenger), 6.4% that walked and 1.3% that rode a bike.\n\nRapid transit systems\n\nThere are three rapid transit systems operating in Canada: the Montreal Metro, the Toronto subway, and the Vancouver SkyTrain.\n\nThere is also an Airport Circulator, the LINK Train, at Toronto Pearson International Airport. It operates 24 hours a day, 7 days a week and is wheelchair-accessible. It is free of cost.\n\nLight rail systems\n\nThree cities have light rail systems—the Calgary CTrain, the Edmonton Light Rail Transit, and the O-Train in Ottawa—and Toronto has an extensive streetcar system.\n\nCommuter train systems\n\nCommuter trains serve the cities and surrounding areas of Montreal, Toronto and Vancouver:\n\nHistory\n\nThe standard history covers the French regime, fur traders, the canals, and early roads, and gives extensive attention to the railways.G.P. de T. Glazebrook, A history of transportation in Canada (1938; reprinted 1969)\n\nEuropean contact\n\nAboriginal peoples in Canada walked. They also used  canoes, kayaks, umiaks and Bull Boats, in addition to the snowshoe, toboggan and sled in winter. They had no wheeled vehicles, and no animals larger than dogs.\n\nEuropeans adopted canoes as they pushed deeper into the continent's interior, and were thus able to travel via the waterways that fed from the St. Lawrence River and Hudson Bay.[http://www.collectionscanada.ca/virtual-vault/ Virtual Vault], an online exhibition of Canadian historical art at Library and Archives Canada\n\nIn the 19th century and early 20th century transportation relied on harnessing oxen to Red River ox carts or horse to waggon. Maritime transportation was via manual labour such as canoe or wind on sail. Water or land travel speeds was approximately 8 to.\n\nSettlement was along river routes. Agricultural commodities were perishable, and trade centres were within 50 km. Rural areas centred around villages, and they were approximately 10 km apart. The advent of steam railways and steamships connected resources and markets of vast distances in the late 19th century. Railways also connected city centres, in such a way that the traveller went by sleeper, railway hotel, to the cities. Crossing the country by train took four or five days, as it still does by car. People generally lived within 5 mi of the downtown core thus the train could be used for inter-city travel and the tram for commuting.\n\nThe advent of the interstate or Trans-Canada Highway in Canada in 1963 established ribbon development, truck stops, and industrial corridors along throughways.\n\nEvolution\n\nThe Federal Department of Transport (established 2 November 1936) supervised railways, canals, harbours, marine and shipping, civil aviation, radio and meteorology. The Transportation Act of 1938 and the amended Railway Act, placed control and regulation of carriers in the hands of the Board of Transport commissioners for Canada. The Royal Commission on Transportation was formed 29 December 1948, to examine transportation services to all areas of Canada to eliminate economic or geographic disadvantages. The Commission also reviewed the Railway Act to provide uniform yet competitive freight-rates.\n\nNotes. Transportation in Canada. http://en.wikipedia.org/?curid=5197."
  }
}
