{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15949",
  "eid" : "220ca330-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778566371,
  "textBody" : "James Benjamin Blish ( – ) was an American science fiction and fantasy writer. He is most well known for his novel Cities in Flight, and his series of Star Trek novelizations written with his wife, J. A. Lawrence. He is credited with creating the term gas giant to refer to large planetary bodies.\n\nBlish was a member of the Futurians. His first published stories appeared in Super Science Stories and Amazing Stories.\n\nBlish wrote literary criticism of science fiction using the pen-name William Atheling, Jr. His other pen names include: Donald Laverty, John MacDougal, Arthur Lloyd Merlyn.\n\nEarly life \n\nBlish was born on  at East Orange, New Jersey. While in high school, Blish self-published a fanzine using a hectograph, called The Planeteer. The fanzine ran for six issues. Blish attended meetings of the Futurian Science Fiction Society in New York City, during this period.\n\nFuturian members Damon Knight and C. M. Kornsbluth became close friends, however, Blish's relationship with other members were often bitter. A personal target was fellow member Judith Merrill, whom he would debate politics with. Merrill would frequently dismiss Blish's self-description of being a \"paper fascist\". She wrote in Better to Have Loved (), \"Of course [Blish] was not fascist, antisemitic, or any of those terrible things, but every time he used the phrase, I saw red.\"\n\nBlish studied microbiology at Rutgers University, graduating in 1942. He was drafted into Army service, and he served briefly as a medical laboratory technician. The United States Army discharged him for refusing orders to clean a grease trap in 1944. Following discharge, Blish entered Columbia University as a masters student of zoology. He did not complete the program, opting to write fiction full-time.\n\nIn 1947, he married Virginia Kidd, a fellow Futurian. They divorced in 1963. Blish then married artist J. A. Lawrence in 1968, moving to England that same year.\n\nFrom 1962 to 1968, Blish worked for the Tobacco Institute, as a writer and critic. Much of his work for the institute went uncredited, however, his work for the institute has been characterized as delusional and normalizing of \"one of the least healthy habits imaginable\".\n\nBlish died on 30 July 1975 from complications related to lung cancer. He was buried in Holywell Cemetery, Oxford. The Bodleian Library at Oxford is the custodian of Blish's papers. The library also has a complete catalog of Blish's published works.\n\nCareer \n\nThroughout the 1940s, Blish published most of his stories in the few pulp magazines still in circulation. His first story was sold to, fellow Futurian, Frederik Pohl for Super Science Stories (), called \"Emergency Refueling\". Other stories were published intermittently, but with little circulation. Blish's \"Chaos, Co-Ordinated\", co-written with Robert A. W. Lowndes, was sold to Astounding Science Fiction, appearing in the  issue, earning Blish national circulation for the first time.\n\nPantropy (1942–56) \n\nBlish was what Andrew Litpack called a \"practical writer\". He would revisit, revise, and often expand on previously written stories. An example is \"Sunken Universe\" published in Super Science Stories in 1942. The story reappeared in Galaxy Science Fiction as \"Surface Tension\", in an altered form in 1952. The premise emphasised Blish's understanding of microbiology, and featured microscopic humans engineered to live on a hostile planet's shallow pools of water. The story proved to be among Blish's more popular, and was anthologized in The Science Fiction Hall of Fame, Volume One, 1929–1964, edited by Robert Silverberg.\n\nThe world of microscopic humans continued in \"The Thing in the Attic\" in 1954, and \"Watershed\" the following year. The fourth entry, \"A Time to Survive\", was published by The Magazine of Fantasy & Science Fiction in 1957. The stories were collected, edited together, and released as the fixup The Seedling Stars (1956) from Gnome Press. John Clute said of all of Blish's \"deeply felt work\" explored \"confronting the Faustian (or Frankensteinian) man\".\n\nCities in Flight (1950–58) \n\nThe Encyclopedia of Science Fiction explains that it was not until the 1950s, and the Okie sequence of stories beginning their run, \"did it become clear [Blish] would become a [science fiction] writer of unusual depth\". The stories were loosely based on the Okie migration following the Dust Bowl of the 1930s, and were influenced by Oswald Spengler's two part Der Untergang des Abendlandes (The Decline of the West).\n\nThe stories detail the life of the Okies, humans who migrate throughout space looking for work in vast city-ships, powered by spindizzies, a kind of faster-than-light engine. The premise and plot reflected Blish's feelings on the state of western civilization, and his personal politics. The first two stories, \"Okie\", and \"Bindlestiff\", were published in 1950, by Astounding. \"Sargasso of Lost Cities\" appeared in Two Complete Science-Adventure Books in . \"Earthman, Come Home\" followed a few months later, published by Astounding. In 1955, Blish collected the four stories together into an omnibus titled Earthman, Come Home, published by Putman.\n\nMore stories followed: In 1956, They Shall Have Stars, which edited together \"Bridge\" and \"At Death’s End\", and in 1958, Blish released The Triumph of Time. Four years later, he published a new Okies novel, A Life for the Stars. The Okies sequence was edited together and published as Cities In Flight ().\n\nClute notes, \"the brilliance of Cities in Flight does not lie in the assemblage of its parts, but in the momentum of the ideas embodied in it (albeit sometimes obscurely).\"\n\nAfter Such Knowledge (1958–71) \n\nBlish continued to rework older stories, and did so for one of his best known works, A Case of Conscience (1958). The novel originated a novella, originally published in an issue of If, in 1953. The story follows a Jesuit priest, Ramon Ruiz-Sanchez, who visits the planet Lithia as a technical member of an expedition. While on the planet they discover a race of bipedal reptilians that have perfected morality in what Ruiz-Sanchez says is \"the absence of God\", and theological complications ensue. The book is one of the first major works in the genre to explore religion and its implications. It was the first of a series including Doctor Mirabilis (1964), the three-part Black Easter; Or, Faust Aleph-Null (1967), and The Day After Judgment (1971). The latter two were collected as The Devil's Day (1980). An omnibus of all four entries in the series was released by Legend in 1991, titled After Such Knowledge.\n\nA Case of Conscience won the 1959 Hugo Award for Best Novel, and was collected as part of Library of America’s omnibus American Science Fiction: Five Classic Novels 1956-1958.\n\nStar Trek (1967–77)\n\nBlish was commissioned by Bantam Books to adapt episodes of Star Trek. The adapted short stories were generally based on draft scripts, and contained differing plot elements, and situations present in the aired television episodes.\n\nThe stories were collected into twelve volumes, and published as a title series of the same name from 1967 to 1977. The adaptations were largely written by Blish, however, his declining health during this period proved problematic. His wife, J. A. Lawrence, wrote a number of installments, however, her work remained uncredited until the final volume, Star Trek 12 released after Blish's death in 1977.\n\nThe original novel based on the televisions series, Spock Must Die! (1970), was also written by Blish, and he planned to release more. According to Lawrence, two episodes featuring popular character Harry Mudd, \"I, Mudd\" and \"Mudd's Women\", were held back by Blish for adaptation to be included in the follow-up to Spock Must Die!. However, Blish died before a novel could be completed. Lawrence did eventually adapt the two episodes, as Mudd's Angels (1978), which included an original novella Business, as Usual, During Altercations by Lawrence.\n\nBlish credited his financial stability later in life to the Star Trek commission, and the advance he received for Spock Must Die!.\n\nLiterary criticism and legacy \n\nBlish was among the first literary critics of science fiction, and he judged works in the genre by the standards applied to \"serious\" literature. He took to task his fellow authors for deficiencies, such as bad grammar and a misunderstanding of scientific concepts, and the magazine editors, who accepted and published such material without editorial intervention. His critiques were published in \"fanzines\" in the 1950s under the pseudonym William Atheling, Jr.\n\nThe essays were collected in The Issue at Hand (1964) and More Issues at Hand (1970). Reviewing The Issue at Hand, Algis Budrys said that Atheling had, along with Damon Knight, \"transformed the reviewer's trade in this field\". He described persona of Atheling as \"acidulous, assertive, categorical, conscientious and occasionally idiosyncratic\".\n\nBlish was a fan of the works of James Branch Cabell, and for a time edited Kalki, the journal of the Cabell Society.\n\nIn his works of science fiction, James Blish developed many ideas and terms which have influenced other writers and on occasion have been adopted more widely, such as faster than light communication via the dirac computer, introduced in the short story \"Beep\" (1954). The dirac is comparable to other to Ursula K. Le Guin's ansible.\n\nBlish is also credited with coining the term gas giant, in the story \"Solar Plexus\" as it appeared in the anthology Beyond Human Ken, edited by Judith Merril. The story was originally published in 1941, but did not contain the term. Blish reworked the story, change the description of a large magnetic field to \"a magnetic field of some strength nearby, one that didn't belong to the invisible gas giant revolving half a million miles away\".\n\nHonors, awards and recognition \n\nThe British Science Fiction Foundation inaugurated the James Blish Award for science fiction criticism in 1977, recognizing Brian W. Aldiss. The Science Fiction and Fantasy Hall of Fame inducted him in 2002.\n\nAwards and nominations \n\n* 1959 Hugo Award for Best Novel, for A Case of Conscience.\n* 1965 Nebula Award nomination for Best Novelette, for \"The Shipwrecked Hotel\", with Norman L. Knight.\n* 1968 Nebula Award nomination for Best Novel, for Black Easter.\n* 1970 Hugo Award nomination for Best Novella, for We All Die Naked.\n* 1970 Nebula Award nomination for Best Novella, for A Style in Treason.\n\nPosthumous Awards and nominations \n\n* 2001 [1951] Retro-Hugo Award nomination for Best Novelette, for \"Okie\".\n* 2004 [1954] Retro-Hugo Award for Best Novella, for A Case of Conscience.\n* 2004 [1954] Retro-Hugo Award for Best Novelette, for \"Earthman, Come Home\".\n\nGuest of Honor \n\n* 1960 Guest of Honor, 18th World Science Fiction Convention. \n* 1970 Guest of Honor, Scicon 70.\n\nBibliography \n\nBlish's work was released by a variety of publishers in the United Kingdom and the United States, often with variations between editions and different titles. Blish also expanded and re-released his older work on several occasions. His work continued to be published after his death.\n\nThe Bodleian Library's [http://www.bodley.ox.ac.uk/dept/scwmss/wmss/online/modern/blish/blish.html catalog] of Blish's works, and  are the sources for this bibliography.\n\nNote: Very few of Blish's first editions were assigned ISBN numbers.\n\nShort fiction and novellas (1935–86) \n\nNovels published in complete form, or serialized, in fiction magazines are included for completeness, and to avoid confusion.\n\nᵝ Novelette, ᵅ Novella, ᵞ Novel.\n\nThe Planeteer (1935–36) \n\n* \"Neptunian Refuge\" ().\n* \"Mad Vision\" ().\n* \"Pursuit into Nowhere\" ().\n* \"Threat from Copernicus\" ().\n* \"Trail of the Comet\" ().\n* \"Bat-Shadow Shroud\" ().\n\nSuper Science Stories (1940) \n\n* \"Emergency Refueling\" ().\n* \"Bequest of the Angel\" ().\n* \"Sunken Universe\" ().↳ Rewritten as \"Surface Tension\" ().\n\nStirring Science Stories (1941) \n\n* \"Citadel of Thought\" ().\n* \"Callistan Cabal\" ().\n\nScience Fiction Quarterly (1941) \n\n* \"Weapon Out of Time\" ().\n* \"When Anteros Came\" ().\n\nCosmic Stories (1941) \n\n* \"Phoenix Planet\"ᵝ ().\n* \"The Real Thrill\" ().\n\nFuture (1941–53) \n\n* \"The Topaz Gate\"ᵝ ().\n* \"The Solar Comedy\" ().\n* \"The Air Whale\" ().\n* \"Struggle in the Womb\" ().\n* \"The Secret People\"ᵝ ().\n* \"Elixir\" ().\n* \"Testament of Andros\"ᵝ ().\n\nAstonishing Stories (1941) \n\n* \"Solar Plexus\" ().\n\nSuper Science and Fantastic Stories (1944) \n\n* \"The Bounding Crown\"ᵝ ().\n\nScience*Fiction (1946) \n\n* \"Knell\", as by Arthur Lloyd Merlyn ().\n\nAstounding Science Fiction (1946–57) \n\n* \"Chaos, Co-Ordinated\"ᵝ as by John MacDougal, with Robert A. W. Lowndes ().\n* \"[https://archive.org/stream/Astounding_v42n02_1948-10_cape1736#page/n141/mode/2up Tiger Ride]\" with Damon Knight ().\n* \"Okie\"ᵝ ().\n* \"Bindlestiff\"ᵝ ().\n* \"Bridge\"ᵝ ().\n* \"Earthman, Come Home\"ᵝ ().\n* \"At Death's End\"ᵝ ().\n* \"One-Shot\" ().\n* \"Tomb Tapper\"ᵝ ().\n* Get Out of My Skyᵅ ().↳ Included in Get out of My Sky Panther ed. ().\n\nStartling Stories (1948) \n\n* \"Mistake Inside\" ().\n\nPlanet Stories (1948—51) \n\n* \"Against the Stone Beasts\"ᵝ ().\n* \"Blackout in Cygni\" ()\n\nThrilling Wonder Stories (1948–50) \n\n* \"No Winter, No Summer\" as by Donald Laverty, with Damon Knight ().\n* \"The Weakness of RVOG\"ᵝ ().↳ Expanded in VOR ().\n* \"The Box\" ().\n* \"The Homesteader\" ().\n* Let the Finder Bewareᵅ ().\n* \"There Shall Be No Darkness\"ᵝ ().↳ Included in Get Out of My Sky Panther ed. ().\n\nJungle Stories (1948) \n\n* \"Serpent's Fetish\" ().\n\nFantastic Story Quarterly (1950) \n\n* \"The Bore\" ().\n\nImagination (1951) \n\n* \"The Void Is My Coffin\" ().\n\nTwo Complete Science-Adventure Books (1951) \n\n* The Warriors of Dayᵞ ().\n* Sargasso of Lost Citiesᵅ ().\n\nOther Worlds Science Stores (1952) \n\n* \"Nightride and Sunrise\"ᵝ with Jerome Bixby ().\n\nGalaxy Science Fiction (1952–70) \n\n* \"Surface Tension\"ᵝ ()↳ Collected in The Seedling Stars ().\n* \"Beep\"ᵝ ().↳ Expanded in The Quincunx of Time (1973).\n* \"The Writing of the Rat\" ().\n* \"The Genius Heap\" ().\n* \"On the Wall of the Lodge\"ᵝ with Virginia Kidd ().\n* \"The Shipwrecked Hotel\"ᵝ with Norman L. Knight, ().↳ Expanded in A Torrent of Faces ().\n* \"The Piper of Dis\"ᵝ with Norman L. Knight, ().↳ Expanded in A Torrent of Faces ().\n* \"Our Binary Brothers\" ().\n* \"The City That Was the World\"ᵝ ().\n* \"A Style in Treason\"ᵝ ().\n* The Day After Judgmentᵞ ().↳ Collected in The Devil's Day ().\n* \"Darkside Crossing\"ᵝ ().\n* \"The Glitch\" ().\n* \"The Art of the Sneeze\" ().\n\nDynamic Science Fiction (1953) \n\n* \"Turn of a Century\" ().\n* The Duplicated Manᵞ with Robert A. W. Lowndes ().\n\nWorlds of If (1953–68) \n\n* A Case of Conscienceᵅ ().↳ Expanded in A Case of Conscience ().\n* \"The Thing in the Attic\"ᵝ ().↳ Collected in The Seedling Stars ().\n* \"Watershed\" ().↳ Collected in The Seedling Stars ().\n* \"To Pay the Piper\" ().\n* Welcome to Marsᵞ ().\n* Black Easterᵞ ().↳ Collected in The Devil's Day ().\n* \"Now That Man Is Gone\" ().\n\nStar Science Fiction Stories (1953) \n\n* \"F.Y.I.\" ().\n\nThe Magazine of Science Fiction and Fantasy (1953–80) \n\n* \"First Strike\" ().\n* \"The Book of Your Life\" ().\n* \"With Malice to Come (3 vignettes)\" ().\n* \"A Time to Survive\"ᵝ ().↳ Collected in The Seedling Stars Signet ed. ().\n* \"This Earth of Hours\"ᵝ ().\n* \"The Masks\" ().\n* \"The Oath\" ().\n* \"Who's in Charge Here?\" ().\n* \"No Jokes on Mars\" ().\n* Midsummer Centuryᵅ ().\n\nFantastic Universe (1955) \n\n* \"Translation\" ().\n\nInfinity Science Fiction (1955–57) \n\n* \"King of the Hill\" ().\n* \"Sponge Dive\" ().\n* \"Detour to the Stars\" ().\n* \"Nor Iron Bars\"ᵝ ().↳ Expanded in Galactic Cluster ().\n\nScience Fiction Storyes (1956) \n\n* \"A Work of Art\" ().\n\nScience Fiction Adventures (1957) \n\n* Two Worlds in Perilᵅ ().\n\nAmazing Stories (1960–61) \n\n* … And All the Stars a Stageᵞ ().\n* \"And Some Were Savages\" ().\n* \"A Dusk of Idols\"ᵝ ().\n\nImpulse (1966) \n\n* \"A Hero's Life\"ᵝ ().\n\nAnalog (1967–68) \n\n* \"To Love Another\" ().↳ Expanded in A Torrent of Faces ().\n* \"Skysign\"ᵝ with Norman L. Knight, ().\n\nPenthouse (1972) \n\n* \"A Light to Fight by\" ().\n\nFantasy Book (1986) \n\n* \"The White Empire\" ().\n\nAnthologized short fiction (1952–2008) \n\n* Beanstalk,ᵅ Future Tense (), ed. Kendell Foster Crossen. Greenberger. ↳ Expanded in Titan's Daughter (). \n* \"Common Time\", Shadows of Tomorrow (), ed. Frederik Pohl. Permabooks #P236. \n* \"A Matter of Energy\", The Best from Fantasy and Science Fiction, Fifth Series (), ed. Anthony Boucher. Doubleday. \n* \"Nor Iron Bars\"ᵝ (expanded), Galactic Cluster (), ed. James Blish. Signet #S1719. \n* \"The Abattoir Effect\", So Close to Home (), ed. James Blish. Ballantine Books #465K. \n* \"None So Blind\", Anywhen (), ed. James Blish. Doubleday. \n* \"How Beautiful With Banners\", Orbit 1 (), ed. Damon Knight. Whiting & Wheaton. \n* \"We All Die Naked\", Three for Tomorrow (), ed. uncredited. Meredith Press. \n* \"More Light\", Alchemy and Academe(), ed. Anne McCaffrey. Doubleday. \n* \"Statistician's Day\", Science Against Man (), ed. Anthony Cheetham. Avon #V2374. \n* \"Getting Along\",ᵝ Again, Dangerous Visions (), ed. Harlan Ellison. Doubleday. \n* \"A True Bill: A Chancel Drama in One Act\",ᵝ Ten Tomorrows (), ed. Roger Elwood. Fawcett Gold Medal #M2820. \n* \"The Price of a Drink\", The Beserkers (), ed. Roger Eldwood. Trident . \n* \"Making Waves\", Works of Art (). NESFA Press .\n\nNovels (1952–90) \n\n* Jack of Eagles (). Greenberg. \n* The Frozen Year (). Ballantine Books #197. ↳ Also released as Fallen Star (). Faber & Faber. \n* VOR (). Avon #T-238. \n* The Duplicated Man (). Avalon Books. \n* A Torrent of Faces (), with Norman L. Knight. Doubleday. \n* The Warriors Day (). Lancer Books #73-580. \n* The Star Dwellers (). G. P. Putnam's Sons. \n* Titan's Daughter (). Berkley Medallion #G507. \n* The Night Shapes (). Ballantine Books #F647. \n* Mission to the Heart Stars (). Faber & Faber. \n* Welcome to Marz (). G. P. Putnam's Sons. \n* The Vanished Jet (). Weybright and Talley. \n* … And All the Stars a Stage (). Doubleday. \n* Midsummer Century (). Doubleday. Included in Midsummer Century Daw ed. (). \n* The Quincunx of Time (). Dell #07244.\n\nCities in Flight series (1955–62) \n\n* Earthman, Come Home (). G. P. Putnam's Sons. \n* They Shall Have Stars (). Faber & Faber. \n* The Triumph of Time (). Avon #T-279. ↳ Also released as A Class of Cymbals (). Faber & Faber. \n* A Life for the Stars (). G. P. Putnam's Sons.\n\nAfter Such Knowledge series (1958–90) \n\n* A Case of Conscience (). Ballantine Books #256. \n* Doctor Mirabilis (). Faber & Faber #55198. \n* The Devil's Day (). Baen .\n\nCollections (1957–2009) \n\n* The Seedling Stars (). Gnome Press. \n* The Seedling Stars (). Signet #S1622. \n* Best Science Fiction Stories of James Blish (). Faber & Faber. \n* Midsummer Century (). Daw #UQ1094. \n* The Best of James Blish (). Ballantine/Del Ray . ↳ Also released as The Testament of Andros (). Arrow Books . \n* Get Out of My Sky (). Panther . \n* A Work of Art and Other Stories (). Severn House . \n* With All Love: Selected Poems (). Anamnesis Press . \n* A Dusk of Idols and Other Stories (). Severn House . \n* In This World, or Another (). Five Star . \n* Works of Art (). NESFA Press . \n* Flights of Eagles (). NESFA Press .\n\nAnthologies (1959–70) \n\n* Galactic Cluster (). Signet #S1719. \n* So Close to Home (). Ballantine Books #465K. \n* New Dreams This Morning (). Ballantine Books #U233. \n* Anywhen (). Doubleday. \n* Nebula Award Stories Five (). Doubleday.\n\nNonfiction (1964–87) \n\n* The Issue at Hand (), as by William Atheling, Jr. Advent Publishers. \n* More Issues at Hand (), as by William Atheling, Jr. Advent Publishers . \n* The Tale That Wags the God (). Advent Publishers .\n\nStar Trek (1967–77) \n\n* Star Trek (). Bantam Books #F3459. \n* Star Trek 2 (). Bantam Books #F3439. \n* Star Trek 3 (). Bantam Books #F4371. \n* Spock Must Die! (). Bantam Books #H5515. \n* Star Trek 4 (). Bantam Books #S7009. \n* Star Trek 5 (). Bantam Books #S7300. \n* Star Trek 6 (). Bantam Books #S7364. \n* Star Trek 7 (). Bantam Books #S7480. \n* Star Trek 8 (). Bantam Books #SP7550. \n* Star Trek 9 (). Bantam Books #SP7808. \n* Star Trek 10 (). Bantam Books #SP8401. \n* Star Trek 11 (). Bantam Books #Q8717. ↳ Also released as The Day of the Dove (). Spectra . \n* Star Trek 12 (), with J. A. Lawrence. Bantam Books .\n\nOmnibuses (1970–2013) \n\n* Cities in Flight (). Avon #W187. \n* After Such Knowledge (). Legend ). \n* The Seedling Stars / Galactic Cluster (). Signet . \n* Black Easter / The Day After Judgement / The Seedling Stars () .",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "James Blish" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15949" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "James Benjamin Blish ( – ) was an American science fiction and fantasy writer. He is most well known for his novel Cities in Flight, and his series of Star Trek novelizations written with his wife, J. A. Lawrence. He is credited with creating the term gas giant to refer to large planetary bodies.\n\nBlish was a member of the Futurians. His first published stories appeared in Super Science Stories and Amazing Stories.\n\nBlish wrote literary criticism of science fiction using the pen-name William Atheling, Jr. His other pen names include: Donald Laverty, John MacDougal, Arthur Lloyd Merlyn.\n\nEarly life \n\nBlish was born on  at East Orange, New Jersey. While in high school, Blish self-published a fanzine using a hectograph, called The Planeteer. The fanzine ran for six issues. Blish attended meetings of the Futurian Science Fiction Society in New York City, during this period.\n\nFuturian members Damon Knight and C. M. Kornsbluth became close friends, however, Blish's relationship with other members were often bitter. A personal target was fellow member Judith Merrill, whom he would debate politics with. Merrill would frequently dismiss Blish's self-description of being a \"paper fascist\". She wrote in Better to Have Loved (), \"Of course [Blish] was not fascist, antisemitic, or any of those terrible things, but every time he used the phrase, I saw red.\"\n\nBlish studied microbiology at Rutgers University, graduating in 1942. He was drafted into Army service, and he served briefly as a medical laboratory technician. The United States Army discharged him for refusing orders to clean a grease trap in 1944. Following discharge, Blish entered Columbia University as a masters student of zoology. He did not complete the program, opting to write fiction full-time.\n\nIn 1947, he married Virginia Kidd, a fellow Futurian. They divorced in 1963. Blish then married artist J. A. Lawrence in 1968, moving to England that same year.\n\nFrom 1962 to 1968, Blish worked for the Tobacco Institute, as a writer and critic. Much of his work for the institute went uncredited, however, his work for the institute has been characterized as delusional and normalizing of \"one of the least healthy habits imaginable\".\n\nBlish died on 30 July 1975 from complications related to lung cancer. He was buried in Holywell Cemetery, Oxford. The Bodleian Library at Oxford is the custodian of Blish's papers. The library also has a complete catalog of Blish's published works.\n\nCareer \n\nThroughout the 1940s, Blish published most of his stories in the few pulp magazines still in circulation. His first story was sold to, fellow Futurian, Frederik Pohl for Super Science Stories (), called \"Emergency Refueling\". Other stories were published intermittently, but with little circulation. Blish's \"Chaos, Co-Ordinated\", co-written with Robert A. W. Lowndes, was sold to Astounding Science Fiction, appearing in the  issue, earning Blish national circulation for the first time.\n\nPantropy (1942–56) \n\nBlish was what Andrew Litpack called a \"practical writer\". He would revisit, revise, and often expand on previously written stories. An example is \"Sunken Universe\" published in Super Science Stories in 1942. The story reappeared in Galaxy Science Fiction as \"Surface Tension\", in an altered form in 1952. The premise emphasised Blish's understanding of microbiology, and featured microscopic humans engineered to live on a hostile planet's shallow pools of water. The story proved to be among Blish's more popular, and was anthologized in The Science Fiction Hall of Fame, Volume One, 1929–1964, edited by Robert Silverberg.\n\nThe world of microscopic humans continued in \"The Thing in the Attic\" in 1954, and \"Watershed\" the following year. The fourth entry, \"A Time to Survive\", was published by The Magazine of Fantasy & Science Fiction in 1957. The stories were collected, edited together, and released as the fixup The Seedling Stars (1956) from Gnome Press. John Clute said of all of Blish's \"deeply felt work\" explored \"confronting the Faustian (or Frankensteinian) man\".\n\nCities in Flight (1950–58) \n\nThe Encyclopedia of Science Fiction explains that it was not until the 1950s, and the Okie sequence of stories beginning their run, \"did it become clear [Blish] would become a [science fiction] writer of unusual depth\". The stories were loosely based on the Okie migration following the Dust Bowl of the 1930s, and were influenced by Oswald Spengler's two part Der Untergang des Abendlandes (The Decline of the West).\n\nThe stories detail the life of the Okies, humans who migrate throughout space looking for work in vast city-ships, powered by spindizzies, a kind of faster-than-light engine. The premise and plot reflected Blish's feelings on the state of western civilization, and his personal politics. The first two stories, \"Okie\", and \"Bindlestiff\", were published in 1950, by Astounding. \"Sargasso of Lost Cities\" appeared in Two Complete Science-Adventure Books in . \"Earthman, Come Home\" followed a few months later, published by Astounding. In 1955, Blish collected the four stories together into an omnibus titled Earthman, Come Home, published by Putman.\n\nMore stories followed: In 1956, They Shall Have Stars, which edited together \"Bridge\" and \"At Death’s End\", and in 1958, Blish released The Triumph of Time. Four years later, he published a new Okies novel, A Life for the Stars. The Okies sequence was edited together and published as Cities In Flight ().\n\nClute notes, \"the brilliance of Cities in Flight does not lie in the assemblage of its parts, but in the momentum of the ideas embodied in it (albeit sometimes obscurely).\"\n\nAfter Such Knowledge (1958–71) \n\nBlish continued to rework older stories, and did so for one of his best known works, A Case of Conscience (1958). The novel originated a novella, originally published in an issue of If, in 1953. The story follows a Jesuit priest, Ramon Ruiz-Sanchez, who visits the planet Lithia as a technical member of an expedition. While on the planet they discover a race of bipedal reptilians that have perfected morality in what Ruiz-Sanchez says is \"the absence of God\", and theological complications ensue. The book is one of the first major works in the genre to explore religion and its implications. It was the first of a series including Doctor Mirabilis (1964), the three-part Black Easter; Or, Faust Aleph-Null (1967), and The Day After Judgment (1971). The latter two were collected as The Devil's Day (1980). An omnibus of all four entries in the series was released by Legend in 1991, titled After Such Knowledge.\n\nA Case of Conscience won the 1959 Hugo Award for Best Novel, and was collected as part of Library of America’s omnibus American Science Fiction: Five Classic Novels 1956-1958.\n\nStar Trek (1967–77)\n\nBlish was commissioned by Bantam Books to adapt episodes of Star Trek. The adapted short stories were generally based on draft scripts, and contained differing plot elements, and situations present in the aired television episodes.\n\nThe stories were collected into twelve volumes, and published as a title series of the same name from 1967 to 1977. The adaptations were largely written by Blish, however, his declining health during this period proved problematic. His wife, J. A. Lawrence, wrote a number of installments, however, her work remained uncredited until the final volume, Star Trek 12 released after Blish's death in 1977.\n\nThe original novel based on the televisions series, Spock Must Die! (1970), was also written by Blish, and he planned to release more. According to Lawrence, two episodes featuring popular character Harry Mudd, \"I, Mudd\" and \"Mudd's Women\", were held back by Blish for adaptation to be included in the follow-up to Spock Must Die!. However, Blish died before a novel could be completed. Lawrence did eventually adapt the two episodes, as Mudd's Angels (1978), which included an original novella Business, as Usual, During Altercations by Lawrence.\n\nBlish credited his financial stability later in life to the Star Trek commission, and the advance he received for Spock Must Die!.\n\nLiterary criticism and legacy \n\nBlish was among the first literary critics of science fiction, and he judged works in the genre by the standards applied to \"serious\" literature. He took to task his fellow authors for deficiencies, such as bad grammar and a misunderstanding of scientific concepts, and the magazine editors, who accepted and published such material without editorial intervention. His critiques were published in \"fanzines\" in the 1950s under the pseudonym William Atheling, Jr.\n\nThe essays were collected in The Issue at Hand (1964) and More Issues at Hand (1970). Reviewing The Issue at Hand, Algis Budrys said that Atheling had, along with Damon Knight, \"transformed the reviewer's trade in this field\". He described persona of Atheling as \"acidulous, assertive, categorical, conscientious and occasionally idiosyncratic\".\n\nBlish was a fan of the works of James Branch Cabell, and for a time edited Kalki, the journal of the Cabell Society.\n\nIn his works of science fiction, James Blish developed many ideas and terms which have influenced other writers and on occasion have been adopted more widely, such as faster than light communication via the dirac computer, introduced in the short story \"Beep\" (1954). The dirac is comparable to other to Ursula K. Le Guin's ansible.\n\nBlish is also credited with coining the term gas giant, in the story \"Solar Plexus\" as it appeared in the anthology Beyond Human Ken, edited by Judith Merril. The story was originally published in 1941, but did not contain the term. Blish reworked the story, change the description of a large magnetic field to \"a magnetic field of some strength nearby, one that didn't belong to the invisible gas giant revolving half a million miles away\".\n\nHonors, awards and recognition \n\nThe British Science Fiction Foundation inaugurated the James Blish Award for science fiction criticism in 1977, recognizing Brian W. Aldiss. The Science Fiction and Fantasy Hall of Fame inducted him in 2002.\n\nAwards and nominations \n\n* 1959 Hugo Award for Best Novel, for A Case of Conscience.\n* 1965 Nebula Award nomination for Best Novelette, for \"The Shipwrecked Hotel\", with Norman L. Knight.\n* 1968 Nebula Award nomination for Best Novel, for Black Easter.\n* 1970 Hugo Award nomination for Best Novella, for We All Die Naked.\n* 1970 Nebula Award nomination for Best Novella, for A Style in Treason.\n\nPosthumous Awards and nominations \n\n* 2001 [1951] Retro-Hugo Award nomination for Best Novelette, for \"Okie\".\n* 2004 [1954] Retro-Hugo Award for Best Novella, for A Case of Conscience.\n* 2004 [1954] Retro-Hugo Award for Best Novelette, for \"Earthman, Come Home\".\n\nGuest of Honor \n\n* 1960 Guest of Honor, 18th World Science Fiction Convention. \n* 1970 Guest of Honor, Scicon 70.\n\nBibliography \n\nBlish's work was released by a variety of publishers in the United Kingdom and the United States, often with variations between editions and different titles. Blish also expanded and re-released his older work on several occasions. His work continued to be published after his death.\n\nThe Bodleian Library's [http://www.bodley.ox.ac.uk/dept/scwmss/wmss/online/modern/blish/blish.html catalog] of Blish's works, and  are the sources for this bibliography.\n\nNote: Very few of Blish's first editions were assigned ISBN numbers.\n\nShort fiction and novellas (1935–86) \n\nNovels published in complete form, or serialized, in fiction magazines are included for completeness, and to avoid confusion.\n\nᵝ Novelette, ᵅ Novella, ᵞ Novel.\n\nThe Planeteer (1935–36) \n\n* \"Neptunian Refuge\" ().\n* \"Mad Vision\" ().\n* \"Pursuit into Nowhere\" ().\n* \"Threat from Copernicus\" ().\n* \"Trail of the Comet\" ().\n* \"Bat-Shadow Shroud\" ().\n\nSuper Science Stories (1940) \n\n* \"Emergency Refueling\" ().\n* \"Bequest of the Angel\" ().\n* \"Sunken Universe\" ().↳ Rewritten as \"Surface Tension\" ().\n\nStirring Science Stories (1941) \n\n* \"Citadel of Thought\" ().\n* \"Callistan Cabal\" ().\n\nScience Fiction Quarterly (1941) \n\n* \"Weapon Out of Time\" ().\n* \"When Anteros Came\" ().\n\nCosmic Stories (1941) \n\n* \"Phoenix Planet\"ᵝ ().\n* \"The Real Thrill\" ().\n\nFuture (1941–53) \n\n* \"The Topaz Gate\"ᵝ ().\n* \"The Solar Comedy\" ().\n* \"The Air Whale\" ().\n* \"Struggle in the Womb\" ().\n* \"The Secret People\"ᵝ ().\n* \"Elixir\" ().\n* \"Testament of Andros\"ᵝ ().\n\nAstonishing Stories (1941) \n\n* \"Solar Plexus\" ().\n\nSuper Science and Fantastic Stories (1944) \n\n* \"The Bounding Crown\"ᵝ ().\n\nScience*Fiction (1946) \n\n* \"Knell\", as by Arthur Lloyd Merlyn ().\n\nAstounding Science Fiction (1946–57) \n\n* \"Chaos, Co-Ordinated\"ᵝ as by John MacDougal, with Robert A. W. Lowndes ().\n* \"[https://archive.org/stream/Astounding_v42n02_1948-10_cape1736#page/n141/mode/2up Tiger Ride]\" with Damon Knight ().\n* \"Okie\"ᵝ ().\n* \"Bindlestiff\"ᵝ ().\n* \"Bridge\"ᵝ ().\n* \"Earthman, Come Home\"ᵝ ().\n* \"At Death's End\"ᵝ ().\n* \"One-Shot\" ().\n* \"Tomb Tapper\"ᵝ ().\n* Get Out of My Skyᵅ ().↳ Included in Get out of My Sky Panther ed. ().\n\nStartling Stories (1948) \n\n* \"Mistake Inside\" ().\n\nPlanet Stories (1948—51) \n\n* \"Against the Stone Beasts\"ᵝ ().\n* \"Blackout in Cygni\" ()\n\nThrilling Wonder Stories (1948–50) \n\n* \"No Winter, No Summer\" as by Donald Laverty, with Damon Knight ().\n* \"The Weakness of RVOG\"ᵝ ().↳ Expanded in VOR ().\n* \"The Box\" ().\n* \"The Homesteader\" ().\n* Let the Finder Bewareᵅ ().\n* \"There Shall Be No Darkness\"ᵝ ().↳ Included in Get Out of My Sky Panther ed. ().\n\nJungle Stories (1948) \n\n* \"Serpent's Fetish\" ().\n\nFantastic Story Quarterly (1950) \n\n* \"The Bore\" ().\n\nImagination (1951) \n\n* \"The Void Is My Coffin\" ().\n\nTwo Complete Science-Adventure Books (1951) \n\n* The Warriors of Dayᵞ ().\n* Sargasso of Lost Citiesᵅ ().\n\nOther Worlds Science Stores (1952) \n\n* \"Nightride and Sunrise\"ᵝ with Jerome Bixby ().\n\nGalaxy Science Fiction (1952–70) \n\n* \"Surface Tension\"ᵝ ()↳ Collected in The Seedling Stars ().\n* \"Beep\"ᵝ ().↳ Expanded in The Quincunx of Time (1973).\n* \"The Writing of the Rat\" ().\n* \"The Genius Heap\" ().\n* \"On the Wall of the Lodge\"ᵝ with Virginia Kidd ().\n* \"The Shipwrecked Hotel\"ᵝ with Norman L. Knight, ().↳ Expanded in A Torrent of Faces ().\n* \"The Piper of Dis\"ᵝ with Norman L. Knight, ().↳ Expanded in A Torrent of Faces ().\n* \"Our Binary Brothers\" ().\n* \"The City That Was the World\"ᵝ ().\n* \"A Style in Treason\"ᵝ ().\n* The Day After Judgmentᵞ ().↳ Collected in The Devil's Day ().\n* \"Darkside Crossing\"ᵝ ().\n* \"The Glitch\" ().\n* \"The Art of the Sneeze\" ().\n\nDynamic Science Fiction (1953) \n\n* \"Turn of a Century\" ().\n* The Duplicated Manᵞ with Robert A. W. Lowndes ().\n\nWorlds of If (1953–68) \n\n* A Case of Conscienceᵅ ().↳ Expanded in A Case of Conscience ().\n* \"The Thing in the Attic\"ᵝ ().↳ Collected in The Seedling Stars ().\n* \"Watershed\" ().↳ Collected in The Seedling Stars ().\n* \"To Pay the Piper\" ().\n* Welcome to Marsᵞ ().\n* Black Easterᵞ ().↳ Collected in The Devil's Day ().\n* \"Now That Man Is Gone\" ().\n\nStar Science Fiction Stories (1953) \n\n* \"F.Y.I.\" ().\n\nThe Magazine of Science Fiction and Fantasy (1953–80) \n\n* \"First Strike\" ().\n* \"The Book of Your Life\" ().\n* \"With Malice to Come (3 vignettes)\" ().\n* \"A Time to Survive\"ᵝ ().↳ Collected in The Seedling Stars Signet ed. ().\n* \"This Earth of Hours\"ᵝ ().\n* \"The Masks\" ().\n* \"The Oath\" ().\n* \"Who's in Charge Here?\" ().\n* \"No Jokes on Mars\" ().\n* Midsummer Centuryᵅ ().\n\nFantastic Universe (1955) \n\n* \"Translation\" ().\n\nInfinity Science Fiction (1955–57) \n\n* \"King of the Hill\" ().\n* \"Sponge Dive\" ().\n* \"Detour to the Stars\" ().\n* \"Nor Iron Bars\"ᵝ ().↳ Expanded in Galactic Cluster ().\n\nScience Fiction Storyes (1956) \n\n* \"A Work of Art\" ().\n\nScience Fiction Adventures (1957) \n\n* Two Worlds in Perilᵅ ().\n\nAmazing Stories (1960–61) \n\n* … And All the Stars a Stageᵞ ().\n* \"And Some Were Savages\" ().\n* \"A Dusk of Idols\"ᵝ ().\n\nImpulse (1966) \n\n* \"A Hero's Life\"ᵝ ().\n\nAnalog (1967–68) \n\n* \"To Love Another\" ().↳ Expanded in A Torrent of Faces ().\n* \"Skysign\"ᵝ with Norman L. Knight, ().\n\nPenthouse (1972) \n\n* \"A Light to Fight by\" ().\n\nFantasy Book (1986) \n\n* \"The White Empire\" ().\n\nAnthologized short fiction (1952–2008) \n\n* Beanstalk,ᵅ Future Tense (), ed. Kendell Foster Crossen. Greenberger. ↳ Expanded in Titan's Daughter (). \n* \"Common Time\", Shadows of Tomorrow (), ed. Frederik Pohl. Permabooks #P236. \n* \"A Matter of Energy\", The Best from Fantasy and Science Fiction, Fifth Series (), ed. Anthony Boucher. Doubleday. \n* \"Nor Iron Bars\"ᵝ (expanded), Galactic Cluster (), ed. James Blish. Signet #S1719. \n* \"The Abattoir Effect\", So Close to Home (), ed. James Blish. Ballantine Books #465K. \n* \"None So Blind\", Anywhen (), ed. James Blish. Doubleday. \n* \"How Beautiful With Banners\", Orbit 1 (), ed. Damon Knight. Whiting & Wheaton. \n* \"We All Die Naked\", Three for Tomorrow (), ed. uncredited. Meredith Press. \n* \"More Light\", Alchemy and Academe(), ed. Anne McCaffrey. Doubleday. \n* \"Statistician's Day\", Science Against Man (), ed. Anthony Cheetham. Avon #V2374. \n* \"Getting Along\",ᵝ Again, Dangerous Visions (), ed. Harlan Ellison. Doubleday. \n* \"A True Bill: A Chancel Drama in One Act\",ᵝ Ten Tomorrows (), ed. Roger Elwood. Fawcett Gold Medal #M2820. \n* \"The Price of a Drink\", The Beserkers (), ed. Roger Eldwood. Trident . \n* \"Making Waves\", Works of Art (). NESFA Press .\n\nNovels (1952–90) \n\n* Jack of Eagles (). Greenberg. \n* The Frozen Year (). Ballantine Books #197. ↳ Also released as Fallen Star (). Faber & Faber. \n* VOR (). Avon #T-238. \n* The Duplicated Man (). Avalon Books. \n* A Torrent of Faces (), with Norman L. Knight. Doubleday. \n* The Warriors Day (). Lancer Books #73-580. \n* The Star Dwellers (). G. P. Putnam's Sons. \n* Titan's Daughter (). Berkley Medallion #G507. \n* The Night Shapes (). Ballantine Books #F647. \n* Mission to the Heart Stars (). Faber & Faber. \n* Welcome to Marz (). G. P. Putnam's Sons. \n* The Vanished Jet (). Weybright and Talley. \n* … And All the Stars a Stage (). Doubleday. \n* Midsummer Century (). Doubleday. Included in Midsummer Century Daw ed. (). \n* The Quincunx of Time (). Dell #07244.\n\nCities in Flight series (1955–62) \n\n* Earthman, Come Home (). G. P. Putnam's Sons. \n* They Shall Have Stars (). Faber & Faber. \n* The Triumph of Time (). Avon #T-279. ↳ Also released as A Class of Cymbals (). Faber & Faber. \n* A Life for the Stars (). G. P. Putnam's Sons.\n\nAfter Such Knowledge series (1958–90) \n\n* A Case of Conscience (). Ballantine Books #256. \n* Doctor Mirabilis (). Faber & Faber #55198. \n* The Devil's Day (). Baen .\n\nCollections (1957–2009) \n\n* The Seedling Stars (). Gnome Press. \n* The Seedling Stars (). Signet #S1622. \n* Best Science Fiction Stories of James Blish (). Faber & Faber. \n* Midsummer Century (). Daw #UQ1094. \n* The Best of James Blish (). Ballantine/Del Ray . ↳ Also released as The Testament of Andros (). Arrow Books . \n* Get Out of My Sky (). Panther . \n* A Work of Art and Other Stories (). Severn House . \n* With All Love: Selected Poems (). Anamnesis Press . \n* A Dusk of Idols and Other Stories (). Severn House . \n* In This World, or Another (). Five Star . \n* Works of Art (). NESFA Press . \n* Flights of Eagles (). NESFA Press .\n\nAnthologies (1959–70) \n\n* Galactic Cluster (). Signet #S1719. \n* So Close to Home (). Ballantine Books #465K. \n* New Dreams This Morning (). Ballantine Books #U233. \n* Anywhen (). Doubleday. \n* Nebula Award Stories Five (). Doubleday.\n\nNonfiction (1964–87) \n\n* The Issue at Hand (), as by William Atheling, Jr. Advent Publishers. \n* More Issues at Hand (), as by William Atheling, Jr. Advent Publishers . \n* The Tale That Wags the God (). Advent Publishers .\n\nStar Trek (1967–77) \n\n* Star Trek (). Bantam Books #F3459. \n* Star Trek 2 (). Bantam Books #F3439. \n* Star Trek 3 (). Bantam Books #F4371. \n* Spock Must Die! (). Bantam Books #H5515. \n* Star Trek 4 (). Bantam Books #S7009. \n* Star Trek 5 (). Bantam Books #S7300. \n* Star Trek 6 (). Bantam Books #S7364. \n* Star Trek 7 (). Bantam Books #S7480. \n* Star Trek 8 (). Bantam Books #SP7550. \n* Star Trek 9 (). Bantam Books #SP7808. \n* Star Trek 10 (). Bantam Books #SP8401. \n* Star Trek 11 (). Bantam Books #Q8717. ↳ Also released as The Day of the Dove (). Spectra . \n* Star Trek 12 (), with J. A. Lawrence. Bantam Books .\n\nOmnibuses (1970–2013) \n\n* Cities in Flight (). Avon #W187. \n* After Such Knowledge (). Legend ). \n* The Seedling Stars / Galactic Cluster (). Signet . \n* Black Easter / The Day After Judgement / The Seedling Stars () . James Blish. http://en.wikipedia.org/?curid=15949."
  }
}
