{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18943",
  "eid" : "3664c470-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778600503,
  "textBody" : "Married... with Children is an American television sitcom that aired on Fox, created by Michael G. Moye and Ron Leavitt. Originally broadcast from April 5, 1987 to June 9, 1997, it is the longest-lasting live-action sitcom on Fox, and the first to be broadcast in the network's primetime programming slot.\n\nThe show follows the lives of Al Bundy, a once glorious high school football player turned hard-luck women's shoe salesman; his obnoxious wife, Peggy; their attractive, promiscuous, and clueless daughter, Kelly; and their girl-crazy, wisecracking son, Bud. Their neighbors are the upwardly mobile Steve Rhoades and his feminist wife Marcy, who later gets remarried to Jefferson D'Arcy, a white-collar criminal who becomes her \"trophy husband\" and Al's sidekick. Most storylines involve Al's schemes being foiled by his own cartoonish dim wit and bad luck.\n\nThe series comprises 259 episodes and 11 seasons. Its theme song is \"Love and Marriage\" by Sammy Cahn and Jimmy Van Heusen, performed by Frank Sinatra from the 1955 television production Our Town.\n\nThe first two seasons of the series were videotaped at ABC Television Center in Hollywood. From season three to season eight, the show was taped at Sunset Gower Studios in Hollywood, and the remaining three seasons were taped at Sony Pictures Studios in Culver City. The series was produced by Embassy Communications during its first season and half of its second season and the remaining seasons by ELP Communications under the studio Columbia Pictures Television.\n\nIn 2008, the show placed number 94 on Entertainment Weekly \"New TV Classics\" list.\n\nCast and characters\n\n*1 David Garrison left the show during season four, but returned in four episodes as a special guest.\n\n* Al Bundy (Ed O'Neill)—the misanthropic head of the Bundy household; afflicted by the \"Bundy curse\" that consigns him to an unrewarding career selling women's shoes and a life with a family that mocks and disrespects him, but who still enjoys the simple things in life. He constantly attempts to relive his high-school Big Man On Campus days, when he was the \"All State Quarterback\". His most noted achievement was having scored four touchdowns in a single game for Polk High. His favorite things in life are the local nudie bar, his collection of \"BigUns\" magazine, his television, his Dodge car with almost 1 million miles on the odometer, and a television show called \"Psycho Dad.\" Despite his family's contempt for him, and his for them, Al is always ready to defend Bundy honor (often with his fists), and he is fiercely protective of daughter Kelly, his \"little girl\" who rarely had a boyfriend Al didn't beat up.\n* Peggy Bundy (Katey Sagal)—Al's wife who is always on his case about money and refuses to clean or cook. She is a lazy, big-haired redhead who spends most of her time parked in front of the TV watching talk shows such as Oprah or robbing Al blind to go shopping; a famously inattentive mother and nagging wife who uses every opportunity to humiliate Al about his job, his meager earnings, and even sexual abilities. Her big taste for things like clothes and male strippers have run Al into debt on numerous occasions. A recurring joke in the series is Al's regret of having married Peggy in the first place; the union was forced on him at shotgun-point. Peggy's best friend is Marcy, with whom she occasionally conspires against Al. Her family is a stereotypical backwoods clan of degenerates whom she often forces the other Bundys to endure, especially her morbidly obese mother whom Al finds intolerable.\n* Kelly Bundy (Christina Applegate)—the Bundys' firstborn; a stereotypical dumb blonde who is often derided as promiscuous and dates men who get under Al's skin to the point of him physically assaulting them. Her stupidity manifests in many ways, from forgetting ideas on the spot to mispronouncing or misspelling simple words. Like her mother, she is quick to steal Al's money for expensive things. Her favorite hobby is belittling her lonely and sexless brother, though she stands up for him against anyone outside the family.\n* Bud Bundy (David Faustino)—the younger Bundy offspring, and the most intelligent family member; the first Bundy to attend college. His awkwardness and preoccupation with sex leads to inevitable failures with women. To improve his success with girls, Bud often uses his alternate persona, \"Grandmaster B,\" a bad-boy rapper from New York City. When using the \"Grandmaster B\" persona, Bud usually wears dark sunglasses and a backward Los Angeles Raiders hat. His mistreatment at the hands of Kelly is returned in kind, making jokes at her expense regarding her promiscuity and stupidity, and tricking her into mixing up TV shows with novels; but when she is in a legitimate bind, Bud will stand up for her, much like Kelly does for him under similar circumstances.\n* Marcy Rhoades D'Arcy (Amanda Bearse)—the Bundys' next-door neighbor; Peggy's best friend and Al's nemesis; an educated banker, but also a feminist and environmentalist who often protests Al's schemes with his NO MA'AM (National Organization of Men Against Amazonian Masterhood) group. Ironically, she is just as chauvinistic as Al and the founder and leader of an anti-man support group called \"FANG\" (Feminists Against Neanderthal Guys). Despite her political correctness and structured life, Marcy harbors a dark, somewhat sexually deviant side, which comes up when she reminisces over events in her past. Al is repulsed by Marcy and frequently belittles her, likening her to a chicken, and mockingly confusing her for an adolescent male. At the outset of the show, Marcy is married to Steve Rhoades. After Steve is written off the show during the fourth season, he is replaced by Jefferson D'Arcy.\n* Steve Rhoades (David Garrison) is Marcy's first husband, a nerdy banker who is dragged into Al's schemes, such as going to strip clubs, chasing after girls, watching sports when Marcy disapproves, and reading pornographic magazines. Steve's most prized possession is his Mercedes Benz, which he does not even let Marcy drive. Growing increasingly tired of Marcy's controlling behavior, Steve eventually leaves her during the fourth season to become a forest ranger at Yosemite National Park. He comes back in \"The Egg and I\" to try and reclaim his old life with Marcy, but finds trouble with Jefferson. Steve later has another job as the chancellor of Bud's college, after blackmailing the previous one he worked under as a chauffeur.\n* Jefferson D'Arcy (Ted McGinley), a pretty-boy scam artist to whom Marcy wakes up one morning and discovers she is married. Unlike Steve, Jefferson is an unemployed, lazy dimwit who takes advantage of Marcy. When he gets caught, he distracts her by working his pretty-boy charm and resorting to sexual bartering. Steve and Jefferson do not like each other for personal reasons. In several episodes, Jefferson is implied to have had a past life as a former spy/CIA operative.\n\nIt is never explained how Peggy was able to go to high school in Chicago when she lived in Wisconsin. While the audience is aware that Al's father died years ago, his mother's whereabouts are never mentioned or acknowledged.\n\nRecurring characters\n\n* Buck (portrayed by Buck Bundy, originally named \"Mike\", voiced by Cheech Marin, Kevin Curran, and Kim Weiskopf)The Bundys' wisecracking dog, that insults his family and is punished upon his death by being reincarnated as Lucky, the dog the Bundys acquire to replace Buck.\n\n* Gary (portrayed by Janet Carroll), owner of the women's shoe store where Al works. Appeared in 7 episodes from 1994 to 1997.\n\nFox broadcast history\n\nOn April 22, 2012, Fox reaired the series premiere in commemoration of its 25th anniversary.\n\nEpisodes\n\nDuring its 11-season run on the Fox network, Married ... with Children aired 258 episodes. A 259th episode, \"I'll See You in Court\" from season 3, never aired on Fox (see below), but premiered on FX and has since been included on DVD and in syndication packages. The episode counts in the chart below include it. Three specials also aired following the series' cancellation, including a cast reunion.\n\nNielsen ratings\n\nDespite the show's enduring popularity and fanbase, Married ... with Children was never a huge ratings success. Part of the reason was the fact that Fox, being a new startup network, did not have the affiliate base of the Big Three television networks, thus preventing the series from reaching the entire country. In an interview for a special commemorating the series' 20-year anniversary in 2007, Katey Sagal stated that part of the problem the series faced was that many areas of the country were able to get Fox only through low-quality UHF channels well into the early 1990s, while some areas of the country did not receive the new network at all, a problem not largely rectified until the 1994 United States broadcast TV realignment which brought the NFC football rights to the network, and beyond, as the network maintained a national cable channel to carry the network in very small markets over cable as late as 2006.\n\nAnother problem lay in the fact that many of the newly developed series on Fox were unsuccessful, which kept the network from building a popular lineup to draw in a larger audience. In its original airing debut, Married ... with Children was part of a Sunday lineup that competed with the popular Murder, She Wrote and Sunday-night movie on CBS. Fellow freshman series included The Garry Shandling Show, Duet, and The Tracey Ullman Show, which were canceled in 1988, 1989, and 1990 respectively. The success of The Simpsons, which debuted on The Tracey Ullman Show in 1987, helped draw some viewers over to Fox, allowing Married ... with Children to sneak into the top 50 of television shows for seasons 3 through 9 doing its best overall rating at number 8 for its third and tenth season. Although these ratings were somewhat small in comparison with the other three networks, they were good enough for Fox to keep renewing the show.\n\nRatings data for some seasons courtesy of TVTango.com.\n*1986–1987 Season 1: #142\n*1987–1988 Season 2: #116 (4.70 rating)\n*1988–1989 Season 3: #48 (10.45 rating)\n*1989–1990 Season 4: #50 (10.12 rating)\n*1990–1991 Season 5: #30 (13.00 rating)\n*1991–1992 Season 6: #29 (13.36 rating)\n*1992–1993 Season 7: #37 (11.97 rating)\n*1993–1994 Season 8: #46 (10.77 rating)\n*1994–1995 Season 9: #49 (10.10 rating)\n*1995–1996 Season 10: #56 (9.20 rating)\n*1996–1997 Season 11: #63 (8.70 rating)\n\nControversy\n\nIn 1989, Terry Rakolta, from Bloomfield Hills, Michigan, led a boycott of the show after viewing the episode \"Her Cups Runneth Over\". Offended by the images of an old man wearing a woman's garter and stockings, the scene where Steve touches the pasties of a mannequin dressed in S&M gear, a homosexual man wearing a tiara on his head (and Al's line \"...and they wonder why we call them 'queens'\"), and a half-nude woman who takes off her bra in front of Al (and is shown with her arms covering her bare chest in the next shot), Rakolta began a letter-writing campaign to advertisers, demanding they boycott the show.\n\nAfter advertisers began dropping their support for the show and while Rakolta made several appearances on television talk shows demanding the show's cancellation, Fox executives refused to air the episode titled \"I'll See You in Court\". This episode would become known as the \"Lost Episode\" and was aired on FX on June 18, 2002, with some parts cut. The episode was packaged with the rest of the third season in the January 2005 DVD release (and in the first volume of the Married ... With Children Most Outrageous Episode DVD set) with the parts cut from syndication restored.\n\nIronically, viewers' curiosity over the boycott and over the show itself led to a drastic ratings boost in an example of the Streisand Effect, which Rakolta has since acknowledged. She has been referenced twice on the show: \"Rock and Roll Girl\", when a newscaster mentioned the city Bloomfield Hills, and \"No Pot to Pease In\", when a television show was made about the Bundy family and then was cancelled because (according to Marcy) \"some woman in Michigan didn't like it\".\n\nThe conservative Parents Television Council named Married... with Children the worst show of both the 1995–96 and 1996–97 television seasons in its first two years in operation. In 1996, the organization called the show the \"crudest comedy on prime time television...peppered with lewd punch lines about sex, masturbation, the gay lifestyle, and the lead character's fondness for pornographic magazines and strip clubs.\"\n\nA book discussing the creation of \"Married. . . with Children,\" the controversy around it and the aftermath of that controversy, as well as telling the entire behind-the-scenes story of the show, was released in 2017 by Bear Manor Media. The book is written by Denise Noe who interviewed David Garrison, E.E. Bell, dog trainer Steven Ritt, and others who worked on the show for the book.\n\nHome releases\n\nSony Pictures Home Entertainment has released all eleven seasons of Married... with Children on DVD in Regions 1, 2, & 4. On December 12, 2010, Sony released a complete series set on DVD in Region 1.\n\nIn December 2007, the Big Bundy Box—a special collection box with all seasons plus new interviews with Sagal and David Faustino—was released. This boxset was released in Australia (Region 4) on November 23, 2009.\n\nThe Sony DVD box sets from season 3 onward do not feature the original \"Love and Marriage\" theme song in the opening sequence. This was done because Sony was unable to obtain the licensing rights to the song for later sets. Despite this, the end credits on the DVDs for season 3 still include a credit for \"Love and Marriage.\"\n\nOn August 27, 2013, it was announced that Mill Creek Entertainment had acquired the home media rights to various television series from the Sony Pictures library including Married... with Children with the original theme song \"Love and Marriage\" sung by Frank Sinatra. They have subsequently re-released the 11 seasons on DVD.[http://tvshowsondvd.com/news/Married-Children-Seasons-9-and-10/20894 Gotta Wait for 'Seasons 9 and 10'? NO MA'AM! They're Scheduled for May][http://tvshowsondvd.com/news/Married-Children-Season-11-and-The-Complete-Series/21033 Bundy... OUT! 'Season 11' Scheduled, Along with 'The Complete Series'] A complete series DVD set was re-released on July 7, 2015.\n\nMerchandise\n\nBooks\n\n*Pig Out With Peg - Secrets from the Bundy Family Kitchen, Avon Books, November 1990, \n*Bundyisms - The Wit and Wisdom of America's Last Family, Boulevard Books, May 1997, \n\nComic books\n\nMarried... with Children was adapted into a comic book series by NOW Comics in 1990.\n\nToys\n\nBoard game\n\n*Married With Children: Act Like...Think Like...Be Like a...Bundy, 1990, Galoob\n\nAction figures\n\nTwo series (10 in all) of 8\" action figures were produced by Classic TV Toys in 2005 and 2006.\n\nInternational remakes\n\n;Armenia\nAn Armenian remake was made in 2016, called The Azizyans. The Azizyans is an Armenian sitcom television series developed by Robert Martirosyan and Van Grigoryan. The series premiered on Armenia TV on October 31, 2016. However, the series were not available to the public until Armenia TV started airing the sitcom from October 10, 2017.  The series takes place in Yerevan, Armenia. The Azizyans sitcom is starred by Hayk Marutyan. He embodies the character of Garnik Azizyan – a clothes store seller, who is the only one working in the family. Mrs.Ruzan Azizyan is lazy enough to perform the duties of a housewife. The problems of the father of the family don’t bother his 3 children – his daughter, who is internet-addicted and is active in all social networks; his unemployed eldest son, who is a complete loser, and his youngest son, who is a schoolboy. The roles in this sitcom, created for family watching, are played by Ani Lupe, Satenik Hazaryan, Ishkhan Gharibyan, Suren Arustamyan and other popular Armenian actors. The project is directed by Arman Marutyan. In the second season of the sitcom, the Azizyan family continues to survive thanks to the meager salary of Garnik. The wife of Garnik - Ruzan, remains in the status of a housewife, without even thinking about finding a job. The elder son of Garnik and Ruzan - Azat, continues to look for a new job, a young man appears in the life of Marie, who is trying to win the girl's heart. Their younger son Levon, continues to live his own life and does not understand what he has in common with this family. And their neighbors Irina and Alik continue to be friends with the family, which Azizyans do not quite approve. The only bright spot in the life of the family is their house, which Garnik inherited from his grandfather. \n\n;Argentina\nAn Argentine remake was made in 2005, called Casados con Hijos. The series was also shown by local channels in Uruguay, Paraguay, and Peru. Only two seasons were made (2005 and 2006), but it is still aired Monday through Friday at 2pm and Saturday at 11.30 pm by Telefe.\n\nThe character names are: José \"Pepe\" Argento (based on Al, played by Guillermo Francella), Mónica \"Moni\" Argento (based on Peggy, played by Florencia Peña), Paola Argento (based on Kelly, played by Luisana Lopilato), Alfio \"Coqui\" Argento (based on Bud, played by Darío Lopilato), Dardo and María Elena Fuseneco (based on Marcy and Jefferson D'Arcy, played by Marcelo de Bellis and Érica Rivas).\n\n;Brazil\nIn Brazil Rede Bandeirantes made a remake in 1999 with the name A Guerra dos Pintos (The War of The Pintos). 52 episodes were recorded but only 22 aired before cancelation.\n\n;Bulgaria\nIn Bulgaria a remake is airing from March 26, 2012 with the name Женени с деца в България (Zheneni s detsa v Bulgaria) (Married with children in Bulgaria).\n\n;Croatia\nIn Croatia a remake called Bračne vode was broadcast from September 2008 until November 2009 on Nova TV channel. The characters based on the Bundys were called Zvonimir, Sunčica, Kristina and Boris Bandić while the ones based on Marcy and Steve were called Marica and Ivan Kumarica.\n\n;Germany\nIn Germany, the 1992 remake Hilfe, meine Familie spinnt, broadcast in the prime time, reached double the audience than the original (broadcast in the early fringe time). This, however, was not enough to maintain the series, so it was cancelled after one season.:de:Eine schrecklich nette Familie#Verschiedenes  The remake used the exact translated scripts of the original series (which already substituted localised humour and in-jokes for incomprehensible references to American TV shows not shown in Germany, as well as some totally different jokes) and just renamed place and person names according to the new setting.:de:Hilfe, meine Familie spinnt \n\n' was aired from March to December 1993 for 26 episodes. \n\n;Hungary\nIn 2006, Hungarian TV network TV2 purchased the license rights including scripts and hired the original producers from Sony Pictures for a remake show placed in Hungarian environment. It was entitled ':hu:Egy rém rendes család Budapesten  (in English: Married with children in Budapest, loan translation: A gruesomely decent family in Budapest). The main story began with the new family called the Bándis inherit an outskirt house from their American relatives the Bundys. They filmed a whole season of 26 episodes, all of them being remade versions of the plots of the original first seasons. It was the highest budget sitcom ever made in Hungary. First it was aired on Tuesday nights, but was beaten by a new season of ER, then placed to Wednesday nights. The remake lost its viewers, but stayed on the air due to the contract between Sony and TV2.[http://index.hu/kultur/media/bundy7904/ Index.hu] [http://index.hu/kultur/media/mc5808/ Index.hu] [http://index.hu/kultur/media/rem486/ Index.hu] \n\n;Russia\n\nThe Original Married... With Children ran on TV-6 Russia in the late 1990s and early 2000s (before closing channel) in prime-time basis, broadcasting the episodes from seasons 1–10. The show later aired on DTV and Domashniy TV. However, for unknown reasons, most episodes from season 11 were not shown. A Russian adaptation, titled  Happy Together (Schastlivy Vmeste; Happy Together), is now airing on TNT channel across the country.\n\nThe character names are: Gena Bukin (based on Al, played by Viktor Loginov), Dasha Bukina (based on Peggy, played by Natalya Bochkareva), Sveta Bukina (based on Kelly, played by Darya Sagalova), Roma Bukin (based on Bud, played by Alexander Yakin), Elena and Anatoliy Poleno (based on Marcy and Jefferson D'Arcy, played by Yulia Zaharova and Pavel Savinkov), Evgeniy Stepanov (based on Steve Rhoades, played by Aleksey Sekirin), Sema Bukin (based on Seven, played by Ilya Butkovskiy), Baron Bukin (based on Buck and Lucky, played by Bayra).\n\n;UK\n\nITV had been screening the original Married... With Children since 1988. In 1996, the UK production company Central Television and Columbia Pictures Television (Columbia TriStar Central Productions) produced UK version called Married for Life, which lasted for one series with seven episodes.\n\nSpin-offs\n\nTop of the Heap was a sitcom starring Matt LeBlanc. The show was about Vinnie Verducci (played by LeBlanc) and his father Charlie (played by Joseph Bologna) always trying get rich quick schemes. The Verduccis were introduced in an earlier episode where Vinnie dated Kelly Bundy, and Charlie was introduced as an old friend of Al Bundy's. The end of the pilot episode shows Al breaking into their apartment and stealing their TV to replace the one he lost betting on Vinnie in a boxing match. However, the show didn't last long and was ultimately cancelled. It had its own spin-off/sequel called Vinnie & Bobby a year later, which was also cancelled.\n\nAlso, an attempt was made to make a spin-off out of David Garrison's Steve Rhoades character which took place on Bud's Trumaine University called Radio Free Trumaine where Garrison played the Dean. Enemies was another spin-off, but played to be a spoof on the TV series, Friends.\n\nOn September 11, 2014, it was announced that a spin-off was in the works, centered on the character of Bud Bundy.\n\nMentions in other media\n\nIn the 2001 film Donnie Darko, the eponymous protagonist mentions the series while under hypnosis, confessing he has recurring erotic fantasies involving Christina Applegate.\n\nU.S. syndication and international airings\n\nDistributed by Columbia Pictures Television Distribution (now Sony Pictures Television Distribution), Married... with Children debuted in off-network syndication in the fall of 1991. The series later began airing on cable on FX from September 1998 until 2007. In June 2002, FX became the first television network to air the controversial, previously banned episode \"I'll See You in Court\", albeit in an edited format. The fully uncensored version of \"I'll See You in Court\" can only be seen on the DVD release Married... with Children: The Most Outrageous Episodes Volume 1 and the Mill Creek Entertainment complete series collection. The version found on the Third Season DVD set under Sony is the edited-for-TV version. In 2008, the Spike network reportedly paid US$12 million for broadcast rights to every episode including the unedited version of the infamous episode, \"I'll See You in Court\".[http://www.variety.com/article/VR1117983581.html?categoryid14&cs\n1&nid=2562 'Married' set for Spike run]. Variety, April 6, 2008.\n\nThe series started airing on Spike TV on September 29, 2008 with a weeklong marathon. TBS also began airing the show shortly after, acquiring the show in fall 2008 to run in the early morning hours, it runs for two to three hours (on rare occasions four or five) on TBS during the early morning hours (depending on the length of overnight programming). TV Land picked up the rights to broadcast the show from its MTV Networks sister Spike in August 2009. Comedy Central began airing the show on February 8, 2010; Comedy Central acquired rights to air the series from TV Land, who in turn, had earlier acquired the rights to the series from Spike, though Comedy Central dropped the rights to the series in April 2010. Spike picked up the rights to series again, and began airing the series for the second time on July 10, 2010, airing on weekend mornings only. All three cable channels are owned by Viacom. The comedy began airing on Nick at Nite on July 6, 2011. MTV2 added the series on March 21, 2012 and VH1 Classic began airing the series on April 9, 2012. The series has aired on a total of seven MTV Networks owned cable networks since 2008. It airs on Antenna TV, Ion Television and TBS.\n\nMarried...with Children has also been a ratings success in other countries around the world.\n\nLocations\n\nThe opening footage comprises views of Chicago, opening with a shot of Buckingham Fountain in Grant Park. The aerial downtown shot was taken from the Lake Shore Drive section north of the Loop. The expressway entrance shot was taken from the 1983 movie National Lampoon's Vacation featuring the Griswolds' green family truckster with a northeastward view of the Dan Ryan/Stevenson junction southwest of the Loop. Both the downtown view and the highway entrance shot were omitted from Season 4 onwards, but the remaining fountain shot included an \"In Stereo Where Available\" note. Non-English versions might differ, e.g. the dubbed German version always includes the expressway shot.\n\nIn Pop Culture\n\n* Forensic Files http://articles.latimes.com/1995-12-12/news/mn-13043_1_sexual-assault Linda Sobek had an audition for Married with Children the day that she was murdered by Charles Rathbun.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Married... with Children" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18943" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Married... with Children is an American television sitcom that aired on Fox, created by Michael G. Moye and Ron Leavitt. Originally broadcast from April 5, 1987 to June 9, 1997, it is the longest-lasting live-action sitcom on Fox, and the first to be broadcast in the network's primetime programming slot.\n\nThe show follows the lives of Al Bundy, a once glorious high school football player turned hard-luck women's shoe salesman; his obnoxious wife, Peggy; their attractive, promiscuous, and clueless daughter, Kelly; and their girl-crazy, wisecracking son, Bud. Their neighbors are the upwardly mobile Steve Rhoades and his feminist wife Marcy, who later gets remarried to Jefferson D'Arcy, a white-collar criminal who becomes her \"trophy husband\" and Al's sidekick. Most storylines involve Al's schemes being foiled by his own cartoonish dim wit and bad luck.\n\nThe series comprises 259 episodes and 11 seasons. Its theme song is \"Love and Marriage\" by Sammy Cahn and Jimmy Van Heusen, performed by Frank Sinatra from the 1955 television production Our Town.\n\nThe first two seasons of the series were videotaped at ABC Television Center in Hollywood. From season three to season eight, the show was taped at Sunset Gower Studios in Hollywood, and the remaining three seasons were taped at Sony Pictures Studios in Culver City. The series was produced by Embassy Communications during its first season and half of its second season and the remaining seasons by ELP Communications under the studio Columbia Pictures Television.\n\nIn 2008, the show placed number 94 on Entertainment Weekly \"New TV Classics\" list.\n\nCast and characters\n\n*1 David Garrison left the show during season four, but returned in four episodes as a special guest.\n\n* Al Bundy (Ed O'Neill)—the misanthropic head of the Bundy household; afflicted by the \"Bundy curse\" that consigns him to an unrewarding career selling women's shoes and a life with a family that mocks and disrespects him, but who still enjoys the simple things in life. He constantly attempts to relive his high-school Big Man On Campus days, when he was the \"All State Quarterback\". His most noted achievement was having scored four touchdowns in a single game for Polk High. His favorite things in life are the local nudie bar, his collection of \"BigUns\" magazine, his television, his Dodge car with almost 1 million miles on the odometer, and a television show called \"Psycho Dad.\" Despite his family's contempt for him, and his for them, Al is always ready to defend Bundy honor (often with his fists), and he is fiercely protective of daughter Kelly, his \"little girl\" who rarely had a boyfriend Al didn't beat up.\n* Peggy Bundy (Katey Sagal)—Al's wife who is always on his case about money and refuses to clean or cook. She is a lazy, big-haired redhead who spends most of her time parked in front of the TV watching talk shows such as Oprah or robbing Al blind to go shopping; a famously inattentive mother and nagging wife who uses every opportunity to humiliate Al about his job, his meager earnings, and even sexual abilities. Her big taste for things like clothes and male strippers have run Al into debt on numerous occasions. A recurring joke in the series is Al's regret of having married Peggy in the first place; the union was forced on him at shotgun-point. Peggy's best friend is Marcy, with whom she occasionally conspires against Al. Her family is a stereotypical backwoods clan of degenerates whom she often forces the other Bundys to endure, especially her morbidly obese mother whom Al finds intolerable.\n* Kelly Bundy (Christina Applegate)—the Bundys' firstborn; a stereotypical dumb blonde who is often derided as promiscuous and dates men who get under Al's skin to the point of him physically assaulting them. Her stupidity manifests in many ways, from forgetting ideas on the spot to mispronouncing or misspelling simple words. Like her mother, she is quick to steal Al's money for expensive things. Her favorite hobby is belittling her lonely and sexless brother, though she stands up for him against anyone outside the family.\n* Bud Bundy (David Faustino)—the younger Bundy offspring, and the most intelligent family member; the first Bundy to attend college. His awkwardness and preoccupation with sex leads to inevitable failures with women. To improve his success with girls, Bud often uses his alternate persona, \"Grandmaster B,\" a bad-boy rapper from New York City. When using the \"Grandmaster B\" persona, Bud usually wears dark sunglasses and a backward Los Angeles Raiders hat. His mistreatment at the hands of Kelly is returned in kind, making jokes at her expense regarding her promiscuity and stupidity, and tricking her into mixing up TV shows with novels; but when she is in a legitimate bind, Bud will stand up for her, much like Kelly does for him under similar circumstances.\n* Marcy Rhoades D'Arcy (Amanda Bearse)—the Bundys' next-door neighbor; Peggy's best friend and Al's nemesis; an educated banker, but also a feminist and environmentalist who often protests Al's schemes with his NO MA'AM (National Organization of Men Against Amazonian Masterhood) group. Ironically, she is just as chauvinistic as Al and the founder and leader of an anti-man support group called \"FANG\" (Feminists Against Neanderthal Guys). Despite her political correctness and structured life, Marcy harbors a dark, somewhat sexually deviant side, which comes up when she reminisces over events in her past. Al is repulsed by Marcy and frequently belittles her, likening her to a chicken, and mockingly confusing her for an adolescent male. At the outset of the show, Marcy is married to Steve Rhoades. After Steve is written off the show during the fourth season, he is replaced by Jefferson D'Arcy.\n* Steve Rhoades (David Garrison) is Marcy's first husband, a nerdy banker who is dragged into Al's schemes, such as going to strip clubs, chasing after girls, watching sports when Marcy disapproves, and reading pornographic magazines. Steve's most prized possession is his Mercedes Benz, which he does not even let Marcy drive. Growing increasingly tired of Marcy's controlling behavior, Steve eventually leaves her during the fourth season to become a forest ranger at Yosemite National Park. He comes back in \"The Egg and I\" to try and reclaim his old life with Marcy, but finds trouble with Jefferson. Steve later has another job as the chancellor of Bud's college, after blackmailing the previous one he worked under as a chauffeur.\n* Jefferson D'Arcy (Ted McGinley), a pretty-boy scam artist to whom Marcy wakes up one morning and discovers she is married. Unlike Steve, Jefferson is an unemployed, lazy dimwit who takes advantage of Marcy. When he gets caught, he distracts her by working his pretty-boy charm and resorting to sexual bartering. Steve and Jefferson do not like each other for personal reasons. In several episodes, Jefferson is implied to have had a past life as a former spy/CIA operative.\n\nIt is never explained how Peggy was able to go to high school in Chicago when she lived in Wisconsin. While the audience is aware that Al's father died years ago, his mother's whereabouts are never mentioned or acknowledged.\n\nRecurring characters\n\n* Buck (portrayed by Buck Bundy, originally named \"Mike\", voiced by Cheech Marin, Kevin Curran, and Kim Weiskopf)The Bundys' wisecracking dog, that insults his family and is punished upon his death by being reincarnated as Lucky, the dog the Bundys acquire to replace Buck.\n\n* Gary (portrayed by Janet Carroll), owner of the women's shoe store where Al works. Appeared in 7 episodes from 1994 to 1997.\n\nFox broadcast history\n\nOn April 22, 2012, Fox reaired the series premiere in commemoration of its 25th anniversary.\n\nEpisodes\n\nDuring its 11-season run on the Fox network, Married ... with Children aired 258 episodes. A 259th episode, \"I'll See You in Court\" from season 3, never aired on Fox (see below), but premiered on FX and has since been included on DVD and in syndication packages. The episode counts in the chart below include it. Three specials also aired following the series' cancellation, including a cast reunion.\n\nNielsen ratings\n\nDespite the show's enduring popularity and fanbase, Married ... with Children was never a huge ratings success. Part of the reason was the fact that Fox, being a new startup network, did not have the affiliate base of the Big Three television networks, thus preventing the series from reaching the entire country. In an interview for a special commemorating the series' 20-year anniversary in 2007, Katey Sagal stated that part of the problem the series faced was that many areas of the country were able to get Fox only through low-quality UHF channels well into the early 1990s, while some areas of the country did not receive the new network at all, a problem not largely rectified until the 1994 United States broadcast TV realignment which brought the NFC football rights to the network, and beyond, as the network maintained a national cable channel to carry the network in very small markets over cable as late as 2006.\n\nAnother problem lay in the fact that many of the newly developed series on Fox were unsuccessful, which kept the network from building a popular lineup to draw in a larger audience. In its original airing debut, Married ... with Children was part of a Sunday lineup that competed with the popular Murder, She Wrote and Sunday-night movie on CBS. Fellow freshman series included The Garry Shandling Show, Duet, and The Tracey Ullman Show, which were canceled in 1988, 1989, and 1990 respectively. The success of The Simpsons, which debuted on The Tracey Ullman Show in 1987, helped draw some viewers over to Fox, allowing Married ... with Children to sneak into the top 50 of television shows for seasons 3 through 9 doing its best overall rating at number 8 for its third and tenth season. Although these ratings were somewhat small in comparison with the other three networks, they were good enough for Fox to keep renewing the show.\n\nRatings data for some seasons courtesy of TVTango.com.\n*1986–1987 Season 1: #142\n*1987–1988 Season 2: #116 (4.70 rating)\n*1988–1989 Season 3: #48 (10.45 rating)\n*1989–1990 Season 4: #50 (10.12 rating)\n*1990–1991 Season 5: #30 (13.00 rating)\n*1991–1992 Season 6: #29 (13.36 rating)\n*1992–1993 Season 7: #37 (11.97 rating)\n*1993–1994 Season 8: #46 (10.77 rating)\n*1994–1995 Season 9: #49 (10.10 rating)\n*1995–1996 Season 10: #56 (9.20 rating)\n*1996–1997 Season 11: #63 (8.70 rating)\n\nControversy\n\nIn 1989, Terry Rakolta, from Bloomfield Hills, Michigan, led a boycott of the show after viewing the episode \"Her Cups Runneth Over\". Offended by the images of an old man wearing a woman's garter and stockings, the scene where Steve touches the pasties of a mannequin dressed in S&M gear, a homosexual man wearing a tiara on his head (and Al's line \"...and they wonder why we call them 'queens'\"), and a half-nude woman who takes off her bra in front of Al (and is shown with her arms covering her bare chest in the next shot), Rakolta began a letter-writing campaign to advertisers, demanding they boycott the show.\n\nAfter advertisers began dropping their support for the show and while Rakolta made several appearances on television talk shows demanding the show's cancellation, Fox executives refused to air the episode titled \"I'll See You in Court\". This episode would become known as the \"Lost Episode\" and was aired on FX on June 18, 2002, with some parts cut. The episode was packaged with the rest of the third season in the January 2005 DVD release (and in the first volume of the Married ... With Children Most Outrageous Episode DVD set) with the parts cut from syndication restored.\n\nIronically, viewers' curiosity over the boycott and over the show itself led to a drastic ratings boost in an example of the Streisand Effect, which Rakolta has since acknowledged. She has been referenced twice on the show: \"Rock and Roll Girl\", when a newscaster mentioned the city Bloomfield Hills, and \"No Pot to Pease In\", when a television show was made about the Bundy family and then was cancelled because (according to Marcy) \"some woman in Michigan didn't like it\".\n\nThe conservative Parents Television Council named Married... with Children the worst show of both the 1995–96 and 1996–97 television seasons in its first two years in operation. In 1996, the organization called the show the \"crudest comedy on prime time television...peppered with lewd punch lines about sex, masturbation, the gay lifestyle, and the lead character's fondness for pornographic magazines and strip clubs.\"\n\nA book discussing the creation of \"Married. . . with Children,\" the controversy around it and the aftermath of that controversy, as well as telling the entire behind-the-scenes story of the show, was released in 2017 by Bear Manor Media. The book is written by Denise Noe who interviewed David Garrison, E.E. Bell, dog trainer Steven Ritt, and others who worked on the show for the book.\n\nHome releases\n\nSony Pictures Home Entertainment has released all eleven seasons of Married... with Children on DVD in Regions 1, 2, & 4. On December 12, 2010, Sony released a complete series set on DVD in Region 1.\n\nIn December 2007, the Big Bundy Box—a special collection box with all seasons plus new interviews with Sagal and David Faustino—was released. This boxset was released in Australia (Region 4) on November 23, 2009.\n\nThe Sony DVD box sets from season 3 onward do not feature the original \"Love and Marriage\" theme song in the opening sequence. This was done because Sony was unable to obtain the licensing rights to the song for later sets. Despite this, the end credits on the DVDs for season 3 still include a credit for \"Love and Marriage.\"\n\nOn August 27, 2013, it was announced that Mill Creek Entertainment had acquired the home media rights to various television series from the Sony Pictures library including Married... with Children with the original theme song \"Love and Marriage\" sung by Frank Sinatra. They have subsequently re-released the 11 seasons on DVD.[http://tvshowsondvd.com/news/Married-Children-Seasons-9-and-10/20894 Gotta Wait for 'Seasons 9 and 10'? NO MA'AM! They're Scheduled for May][http://tvshowsondvd.com/news/Married-Children-Season-11-and-The-Complete-Series/21033 Bundy... OUT! 'Season 11' Scheduled, Along with 'The Complete Series'] A complete series DVD set was re-released on July 7, 2015.\n\nMerchandise\n\nBooks\n\n*Pig Out With Peg - Secrets from the Bundy Family Kitchen, Avon Books, November 1990, \n*Bundyisms - The Wit and Wisdom of America's Last Family, Boulevard Books, May 1997, \n\nComic books\n\nMarried... with Children was adapted into a comic book series by NOW Comics in 1990.\n\nToys\n\nBoard game\n\n*Married With Children: Act Like...Think Like...Be Like a...Bundy, 1990, Galoob\n\nAction figures\n\nTwo series (10 in all) of 8\" action figures were produced by Classic TV Toys in 2005 and 2006.\n\nInternational remakes\n\n;Armenia\nAn Armenian remake was made in 2016, called The Azizyans. The Azizyans is an Armenian sitcom television series developed by Robert Martirosyan and Van Grigoryan. The series premiered on Armenia TV on October 31, 2016. However, the series were not available to the public until Armenia TV started airing the sitcom from October 10, 2017.  The series takes place in Yerevan, Armenia. The Azizyans sitcom is starred by Hayk Marutyan. He embodies the character of Garnik Azizyan – a clothes store seller, who is the only one working in the family. Mrs.Ruzan Azizyan is lazy enough to perform the duties of a housewife. The problems of the father of the family don’t bother his 3 children – his daughter, who is internet-addicted and is active in all social networks; his unemployed eldest son, who is a complete loser, and his youngest son, who is a schoolboy. The roles in this sitcom, created for family watching, are played by Ani Lupe, Satenik Hazaryan, Ishkhan Gharibyan, Suren Arustamyan and other popular Armenian actors. The project is directed by Arman Marutyan. In the second season of the sitcom, the Azizyan family continues to survive thanks to the meager salary of Garnik. The wife of Garnik - Ruzan, remains in the status of a housewife, without even thinking about finding a job. The elder son of Garnik and Ruzan - Azat, continues to look for a new job, a young man appears in the life of Marie, who is trying to win the girl's heart. Their younger son Levon, continues to live his own life and does not understand what he has in common with this family. And their neighbors Irina and Alik continue to be friends with the family, which Azizyans do not quite approve. The only bright spot in the life of the family is their house, which Garnik inherited from his grandfather. \n\n;Argentina\nAn Argentine remake was made in 2005, called Casados con Hijos. The series was also shown by local channels in Uruguay, Paraguay, and Peru. Only two seasons were made (2005 and 2006), but it is still aired Monday through Friday at 2pm and Saturday at 11.30 pm by Telefe.\n\nThe character names are: José \"Pepe\" Argento (based on Al, played by Guillermo Francella), Mónica \"Moni\" Argento (based on Peggy, played by Florencia Peña), Paola Argento (based on Kelly, played by Luisana Lopilato), Alfio \"Coqui\" Argento (based on Bud, played by Darío Lopilato), Dardo and María Elena Fuseneco (based on Marcy and Jefferson D'Arcy, played by Marcelo de Bellis and Érica Rivas).\n\n;Brazil\nIn Brazil Rede Bandeirantes made a remake in 1999 with the name A Guerra dos Pintos (The War of The Pintos). 52 episodes were recorded but only 22 aired before cancelation.\n\n;Bulgaria\nIn Bulgaria a remake is airing from March 26, 2012 with the name Женени с деца в България (Zheneni s detsa v Bulgaria) (Married with children in Bulgaria).\n\n;Croatia\nIn Croatia a remake called Bračne vode was broadcast from September 2008 until November 2009 on Nova TV channel. The characters based on the Bundys were called Zvonimir, Sunčica, Kristina and Boris Bandić while the ones based on Marcy and Steve were called Marica and Ivan Kumarica.\n\n;Germany\nIn Germany, the 1992 remake Hilfe, meine Familie spinnt, broadcast in the prime time, reached double the audience than the original (broadcast in the early fringe time). This, however, was not enough to maintain the series, so it was cancelled after one season.:de:Eine schrecklich nette Familie#Verschiedenes  The remake used the exact translated scripts of the original series (which already substituted localised humour and in-jokes for incomprehensible references to American TV shows not shown in Germany, as well as some totally different jokes) and just renamed place and person names according to the new setting.:de:Hilfe, meine Familie spinnt \n\n' was aired from March to December 1993 for 26 episodes. \n\n;Hungary\nIn 2006, Hungarian TV network TV2 purchased the license rights including scripts and hired the original producers from Sony Pictures for a remake show placed in Hungarian environment. It was entitled ':hu:Egy rém rendes család Budapesten  (in English: Married with children in Budapest, loan translation: A gruesomely decent family in Budapest). The main story began with the new family called the Bándis inherit an outskirt house from their American relatives the Bundys. They filmed a whole season of 26 episodes, all of them being remade versions of the plots of the original first seasons. It was the highest budget sitcom ever made in Hungary. First it was aired on Tuesday nights, but was beaten by a new season of ER, then placed to Wednesday nights. The remake lost its viewers, but stayed on the air due to the contract between Sony and TV2.[http://index.hu/kultur/media/bundy7904/ Index.hu] [http://index.hu/kultur/media/mc5808/ Index.hu] [http://index.hu/kultur/media/rem486/ Index.hu] \n\n;Russia\n\nThe Original Married... With Children ran on TV-6 Russia in the late 1990s and early 2000s (before closing channel) in prime-time basis, broadcasting the episodes from seasons 1–10. The show later aired on DTV and Domashniy TV. However, for unknown reasons, most episodes from season 11 were not shown. A Russian adaptation, titled  Happy Together (Schastlivy Vmeste; Happy Together), is now airing on TNT channel across the country.\n\nThe character names are: Gena Bukin (based on Al, played by Viktor Loginov), Dasha Bukina (based on Peggy, played by Natalya Bochkareva), Sveta Bukina (based on Kelly, played by Darya Sagalova), Roma Bukin (based on Bud, played by Alexander Yakin), Elena and Anatoliy Poleno (based on Marcy and Jefferson D'Arcy, played by Yulia Zaharova and Pavel Savinkov), Evgeniy Stepanov (based on Steve Rhoades, played by Aleksey Sekirin), Sema Bukin (based on Seven, played by Ilya Butkovskiy), Baron Bukin (based on Buck and Lucky, played by Bayra).\n\n;UK\n\nITV had been screening the original Married... With Children since 1988. In 1996, the UK production company Central Television and Columbia Pictures Television (Columbia TriStar Central Productions) produced UK version called Married for Life, which lasted for one series with seven episodes.\n\nSpin-offs\n\nTop of the Heap was a sitcom starring Matt LeBlanc. The show was about Vinnie Verducci (played by LeBlanc) and his father Charlie (played by Joseph Bologna) always trying get rich quick schemes. The Verduccis were introduced in an earlier episode where Vinnie dated Kelly Bundy, and Charlie was introduced as an old friend of Al Bundy's. The end of the pilot episode shows Al breaking into their apartment and stealing their TV to replace the one he lost betting on Vinnie in a boxing match. However, the show didn't last long and was ultimately cancelled. It had its own spin-off/sequel called Vinnie & Bobby a year later, which was also cancelled.\n\nAlso, an attempt was made to make a spin-off out of David Garrison's Steve Rhoades character which took place on Bud's Trumaine University called Radio Free Trumaine where Garrison played the Dean. Enemies was another spin-off, but played to be a spoof on the TV series, Friends.\n\nOn September 11, 2014, it was announced that a spin-off was in the works, centered on the character of Bud Bundy.\n\nMentions in other media\n\nIn the 2001 film Donnie Darko, the eponymous protagonist mentions the series while under hypnosis, confessing he has recurring erotic fantasies involving Christina Applegate.\n\nU.S. syndication and international airings\n\nDistributed by Columbia Pictures Television Distribution (now Sony Pictures Television Distribution), Married... with Children debuted in off-network syndication in the fall of 1991. The series later began airing on cable on FX from September 1998 until 2007. In June 2002, FX became the first television network to air the controversial, previously banned episode \"I'll See You in Court\", albeit in an edited format. The fully uncensored version of \"I'll See You in Court\" can only be seen on the DVD release Married... with Children: The Most Outrageous Episodes Volume 1 and the Mill Creek Entertainment complete series collection. The version found on the Third Season DVD set under Sony is the edited-for-TV version. In 2008, the Spike network reportedly paid US$12 million for broadcast rights to every episode including the unedited version of the infamous episode, \"I'll See You in Court\".[http://www.variety.com/article/VR1117983581.html?categoryid14&cs\n1&nid=2562 'Married' set for Spike run]. Variety, April 6, 2008.\n\nThe series started airing on Spike TV on September 29, 2008 with a weeklong marathon. TBS also began airing the show shortly after, acquiring the show in fall 2008 to run in the early morning hours, it runs for two to three hours (on rare occasions four or five) on TBS during the early morning hours (depending on the length of overnight programming). TV Land picked up the rights to broadcast the show from its MTV Networks sister Spike in August 2009. Comedy Central began airing the show on February 8, 2010; Comedy Central acquired rights to air the series from TV Land, who in turn, had earlier acquired the rights to the series from Spike, though Comedy Central dropped the rights to the series in April 2010. Spike picked up the rights to series again, and began airing the series for the second time on July 10, 2010, airing on weekend mornings only. All three cable channels are owned by Viacom. The comedy began airing on Nick at Nite on July 6, 2011. MTV2 added the series on March 21, 2012 and VH1 Classic began airing the series on April 9, 2012. The series has aired on a total of seven MTV Networks owned cable networks since 2008. It airs on Antenna TV, Ion Television and TBS.\n\nMarried...with Children has also been a ratings success in other countries around the world.\n\nLocations\n\nThe opening footage comprises views of Chicago, opening with a shot of Buckingham Fountain in Grant Park. The aerial downtown shot was taken from the Lake Shore Drive section north of the Loop. The expressway entrance shot was taken from the 1983 movie National Lampoon's Vacation featuring the Griswolds' green family truckster with a northeastward view of the Dan Ryan/Stevenson junction southwest of the Loop. Both the downtown view and the highway entrance shot were omitted from Season 4 onwards, but the remaining fountain shot included an \"In Stereo Where Available\" note. Non-English versions might differ, e.g. the dubbed German version always includes the expressway shot.\n\nIn Pop Culture\n\n* Forensic Files http://articles.latimes.com/1995-12-12/news/mn-13043_1_sexual-assault Linda Sobek had an audition for Married with Children the day that she was murdered by Charles Rathbun. Married... with Children. http://en.wikipedia.org/?curid=18943."
  }
}
