{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4188",
  "eid" : "cbcfc380-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778421688,
  "textBody" : "Brion Gysin  (19 January 1916 – 13 July 1986) was a painter, writer, sound poet, and performance artist born in Taplow, Buckinghamshire.\n\nHe is best known for his discovery of the cut-up technique, used by his friend, the novelist William S. Burroughs. With the engineer Ian Sommerville he invented the Dreamachine, a flicker device designed as an art object to be viewed with the eyes closed. It was in painting and drawing, however, that Gysin devoted his greatest efforts, creating calligraphic works inspired by the cursive Japanese \"grass\" script and Arabic script. Burroughs later stated that \"Brion Gysin was the only man I ever respected.\"Burroughs, William. \"Introduction.\" in Man from Nowhere: Storming the Citadels of Enlightenment with William Burroughs and Brion Gysin. Ambrose, Joe, Frank Rynne, Terry Wilson. Dublin: Sublimin, 1992, n.p.\n\nBiography \n\nEarly years\n\nJohn Clifford Brian Gysin was born at the Canadian military hospital in the grounds of Cliveden, Taplow, England. His mother, Stella Margaret Martin, was a Canadian from Deseronto, Ontario. His father, Leonard Gysin, a captain with the Canadian Expeditionary Force, was killed in action eight months after his son's birth. Stella returned to Canada and settled in Edmonton, Alberta where her son became \"the only Catholic day-boy at an Anglican boarding school\".Cf. John Geiger's biographical essay on Gysin titled, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, ed. José Férez Kuri (London: Thames & Hudson, 2003), p. 201. Graduating at fifteen, Gysin was sent to Downside School in Stratton-on-the-Fosse, near Bath, Somerset in England, a prestigious college run by the Benedictines and known as \"the Eton of Catholic public schools\". Despite, or because of, attending a Catholic school, Gysin became an atheist.\n\nSurrealism\n\nIn 1934, he moved to Paris to study La Civilisation Française, an open course given at the Sorbonne where he made literary and artistic contacts through Marie Berthe Aurenche, Max Ernst's second wife.Cf. John Geiger, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, p. 204. He joined the Surrealist Group and began frequenting Valentine Hugo, Leonor Fini, Salvador Dalí, Picasso and Dora Maar. A year later, he had his first exhibition at the Galerie Quatre Chemins in Paris with Ernst, Picasso, Hans Arp, Hans Bellmer, Victor Brauner, Giorgio de Chirico, Dalí, Marcel Duchamp, René Magritte, Man Ray and Yves Tanguy. On the day of the preview, however, he was expelled from the Surrealist Group by André Breton, who ordered the poet Paul Éluard to take down his pictures. Gysin was 19 years old. His biographer, John Geiger, suggests the arbitrary expulsion \"had the effect of a curse. Years later, he blamed other failures on the Breton incident. It gave rise to conspiracy theories about the powerful interests who seek control of the art world. He gave various explanations for the expulsion, the more elaborate involving 'insubordination' or lèse majesté towards Breton\".\n\nAfter World War II\n\nAfter serving in the U.S. army during World War II, Gysin published a biography of Josiah \"Uncle Tom\" Henson titled, To Master, a Long Goodnight: The History of Slavery in Canada (1946). A gifted draughtsman, he took an 18-month course learning the Japanese language (including calligraphy) that would greatly influence his artwork. In 1949, he was among the first Fulbright Fellows. His goal: to research the history of slavery at the University of Bordeaux and in the Archivo de Indias in Seville, Spain, a project that he later abandoned. He moved to Tangier, Morocco after visiting the city with novelist and composer Paul Bowles in 1950. In 1952/3 he met the travel writer and sexual adventurer Anne Cumming and they remained friends until his death.Richard Davenport-Hines, ‘Cumming, (Felicity) Anne (1917–1993)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Oct 2009 [http://www.oxforddnb.com/view/article/51816, accessed 11 April 2017]\n\nMorocco and the Beat Hotel\n\nIn 1954 in Tangier, Gysin opened a restaurant called The 1001 Nights, with his friend Mohamed Hamri, who was the cook. Gysin hired the Master Musicians of Jajouka from the village of Jajouka to perform alongside entertainment that included acrobats, a dancing boy and fire eaters.Greene, Michelle, The Dream at the End of the World, (New York, 1991), p. 123, p. 201Geiger, John, Nothing is True, Everything is Permitted: the Life of Brion Gysin, (New York, 2005), p. 103 The musicians performed there for an international clientele that included William S. Burroughs. Gysin lost the business in 1958,In his essay \"Cut-Ups: A Project for Disastrous Success,\" Gysin explains that \"on January 5, 1958, I lost the business over a signature given to a friendly American couple who 'wanted to help me out.' I was out with the shirt on my back.\" in A Williams Burroughs Reader, ed. John Calder (London: Picador, 1982), p. 276. and the restaurant closed permanently. That same year, Gysin returned to Paris, taking lodgings in a flophouse located at 9 rue Gît-le-Coeur that would become famous as the Beat Hotel. Working on a drawing, he discovered a Dada technique by accident:\n\nWilliam Burroughs and I first went into techniques of writing, together, back in room No. 15 of the Beat Hotel during the cold Paris spring of 1958... Burroughs was more intent on Scotch-taping his photos together into one great continuum on the wall, where scenes faded and slipped into one another, than occupied with editing the monster manuscript... Naked Lunch appeared and Burroughs disappeared. He kicked his habit with Apomorphine and flew off to London to see Dr Dent, who had first turned him on to the cure. While cutting a mount for a drawing in room No. 15, I sliced through a pile of newspapers with my Stanley blade and thought of what I had said to Burroughs some six months earlier about the necessity for turning painters' techniques directly into writing. I picked up the raw words and began to piece together texts that later appeared as \"First Cut-Ups\" in  Minutes to Go (Two Cities, Paris 1960).Brion Gysin: Cut-Ups: A Project for Disastrous Success, published in Evergreen Review and much later in [Brion Gysin] Let the Mice In, Something Else Press, West Clover 1973; also in the A Williams Burroughs Reader, John Calder (editor), Picador, London 1982, p. 272.\n\nWhen Burroughs returned from London in September 1959, Gysin not only shared his discovery with his friend but the new techniques he had developed for it. Burroughs then put the techniques to use while completing Naked Lunch and the experiment dramatically changed the landscape of American literature. Gysin helped Burroughs with the editing of several of his novels including Interzone, and wrote a script for a film version of Naked Lunch, which was never produced. The pair collaborated on a large manuscript for Grove Press titled The Third Mind but it was determined that it would be impractical to publish it as originally envisioned. The book later published under that title incorporates little of this material. Interviewed for The Guardian in 1997, Burroughs explained that Gysin was \"the only man that I've ever respected in my life. I've admired people, I've liked them, but he's the only man I've ever respected.\" The Guardian, January 18, 1997. In 1969, Gysin completed his finest novel, The Process, a work judged by critic Robert Palmer as \"a classic of 20th century modernism\".From Palmer's forward to the novel published by The Overlook Press in 1987.\n\nA consummate innovator, Gysin altered the cut-up technique to produce what he called permutation poems in which a single phrase was repeated several times with the words rearranged in a different order with each reiteration. An example of this is \"I don't dig work, man/Man, work I don't dig.\"  Many of these permutations were derived using a random sequence generator in an early computer program written by Ian Sommerville. Commissioned by the BBC in 1960 to produce material for broadcast, Gysin's results included \"Pistol Poem\", which was created by recording a gun firing at different distances and then splicing the sounds. That year, the piece was subsequently used as a theme for the Paris performance of Le Domaine Poetique, a showcase for experimental works by people like Gysin, François Dufrêne, Bernard Heidsieck, and Henri Chopin.\n\nWith Sommerville, he built the Dreamachine in 1961. Described as \"the first art object to be seen with the eyes closed\",Quoted on coverflap of Tuning in to the Multimedia Age. the flicker device uses alpha waves in the 8-16 Hz range to produce a change of consciousness in receptive viewers.\n\nLater years\n\nIn 1985 Gysin was made an American Commander of the French Ordre des Arts et des Lettres. He'd begun to work extensively with noted jazz soprano saxophonist Steve Lacy. They recorded an album in 1986 with French musician Ramuntcho Matta, featuring Gysin singing/rapping his own texts, with performances by Lacy, Don Cherry, Elli Medeiros, Lizzy Mercier Descloux and more. The album was reissued on CD in 1993 by Crammed Discs, under the title Self-Portrait Jumping.\n\nOn July 13, 1986 Brion Gysin died of lung cancer. Anne Cumming arranged his funeral and for his ashes to be scattered at the Caves of Hercules in Morocco. An obituary by Robert Palmer published in The New York Times described him as a man who \"threw off the sort of ideas that ordinary artists would parlay into a lifetime career, great clumps of ideas, as casually as a locomotive throws off sparks\".Cf. John Geiger, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, p. 227. Later that year a heavily edited version of his novel, The Last Museum, was published posthumously by Faber & Faber (London) and by Grove Press (New York).\n\nAs a joke, Gysin had contributed a recipe for marijuana fudge to a cookbook by Alice B. Toklas; it was unintentionally included for publication, becoming famous under the name Alice B. Toklas brownies.Biographer John Geiger writes that Gysin's restaurant, The 1001 Nights provided him \"with an entrée into Tangiers society. His Moroccan culinary delights even merited an entry in Alice B. Toklas's famous cookbook, with a recipe for hashish fudge. Toklas, however, had no idea what the mysterious ingredient - cannabis - was, protesting later 'of course I didn't know the Latin name'.\" Cf. John Geiger, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, p. 213.\n\nBurroughs on the Gysin cut-up\n\nIn a 1966 interview by Conrad Knickerbocker for The Paris Review, William S. Burroughs explained that Brion Gysin was, to his knowledge, \"the first to create cut-ups\".\n\nINTERVIEWER: How did you become interested in the cut-up technique?\n\nBURROUGHS: A friend, Brion Gysin, an American poet and painter, who has lived in Europe for thirty years, was, as far as I know, the first to create cut-ups. His cut-up poem, Minutes to Go, was broadcast by the BBC and later published in a pamphlet. I was in Paris in the summer of 1960; this was after the publication there of Naked Lunch. I became interested in the possibilities of this technique, and I began experimenting myself. Of course, when you think of it, The Waste Land was the first great cut-up collage, and Tristan Tzara had done a bit along the same lines. Dos Passos used the same idea in 'The Camera Eye' sequences in USA. I felt I had been working toward the same goal; thus it was a major revelation to me when I actually saw it being done.Knickerbocker, Conrad, Burroughs, Williams S., 'The Paris Review Interview with William S. Burroughs' in A Williams Burroughs Reader, ed. John Calder (London: Picador, 1982), p. 263.\n\nInfluence\n\nAccording to José Férez Kuri, author of Brion Gysin: Tuning in to the Multimedia Age (2003) and co-curator of a major retrospective of the artist's work at The Edmonton Art Gallery in 1998, Gysin's wide range of \"radical ideas would become a source of inspiration for artists of the Beat Generation, as well as for their successors (among them David Bowie, Mick Jagger, Keith Haring, and Laurie Anderson)\".Kuri, Tuning in to the Multimedia Age, coverflap.  Other artists include Genesis P-Orridge, John Zorn (as displayed on the 2013's Dreamachines album) and Brian Jones.\n\nSelected bibliography\n\nGysin is the subject of John Geiger's biography, Nothing Is True Everything Is Permitted: The Life of Brion Gysin, and features in Chapel of Extreme Experience: A Short History of Stroboscopic Light and the Dream Machine, also by Geiger. Man From Nowhere: Storming the Citadels of Enlightenment with William Burroughs and Brion Gysin, a biographical study of Burroughs and Gysin with a collection of homages to Gysin, was authored by Joe Ambrose, Frank Rynne, and Terry Wilson with contributions by Marianne Faithfull, John Cale, William S. Burroughs, John Giorno, Stanley Booth, Bill Laswell, Mohamed Hamri, Keith Haring and Paul Bowles. A monograph on Gysin was published in 2003 by Thames and Hudson.\n\nWorks\n\nProse\n*To Master, A Long Goodnight: The History of Slavery in Canada (1946)\n* Minutes to Go (1960)\n*The Exterminator (1960)\n*The Process (1969)\n*Brion Gysin Let The Mice In (1973)\n*The Third Mind (1978)\n*Here To Go: Planet R-101 (first published 1982)\n*Stories (1984)\n*The Last Museum (1985)\n\nRadio\n*Pistol Poem (1960)\n*Permutations (1960)\n*I Am (1960)\n* No Poets (1962)\n* Junk is No Good Baby (1962)\n\nCinema\n*Scenario to Naked Lunch (1973)\nMusic\n*Songs (with Steve Lacy) (rec. 1981)\n*Junk (1985)\n*Self-Portrait Jumping (with Ramuntcho Matta, Don Cherry, Steve Lacy) (1993)\nPainting\n*Les deux faux interlocuteurs, Gradiva Rediviva Zoe Bertgang, and Signe dans le paysage (Surrealist ink drawings, 1935)\n*Sahara Sand (1958)\n*The Songs of Marrakech (1959)\n*Unit II pink, Unit III yellow, Unit IV orange, Unit V blue (1961)\n*Francis in the Beat Hotel (1962)\n*For a Stained-Glass Window in Rheims (1963)\n*Roller Poem (1971)\n*Calligraffiti of Fire (1986)\n\nSources \n\nPrint\n\nPrimary sources\n\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nSecondary sources\n\n*Kuri, José Férez, ed. Brion Gysin: Tuning in to the Multimedia Age. London: Thames & Hudson,  2003.  \n*Geiger, John. Nothing Is True Everything Is Permitted: The Life of Brion Gysin. Disinformation Company, 2005. \n*Geiger, John. Chapel of Extreme Experience: A Short History of Stroboscopic Light and the Dream Machine. Soft Skull Press, 2003.\n*Ambrose, Joe, Frank Rynne, and Terry Wilson. Man From Nowhere: Storming the Citadels of Enlightenment with William Burroughs and Brion Gysin. Williamsburg: Autonomedia, 1992\n*Vale, V. William Burroughs, Brion Gysin, Throbbing Gristle. San Francisco: V/Search, 1982.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Brion Gysin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4188" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Brion Gysin  (19 January 1916 – 13 July 1986) was a painter, writer, sound poet, and performance artist born in Taplow, Buckinghamshire.\n\nHe is best known for his discovery of the cut-up technique, used by his friend, the novelist William S. Burroughs. With the engineer Ian Sommerville he invented the Dreamachine, a flicker device designed as an art object to be viewed with the eyes closed. It was in painting and drawing, however, that Gysin devoted his greatest efforts, creating calligraphic works inspired by the cursive Japanese \"grass\" script and Arabic script. Burroughs later stated that \"Brion Gysin was the only man I ever respected.\"Burroughs, William. \"Introduction.\" in Man from Nowhere: Storming the Citadels of Enlightenment with William Burroughs and Brion Gysin. Ambrose, Joe, Frank Rynne, Terry Wilson. Dublin: Sublimin, 1992, n.p.\n\nBiography \n\nEarly years\n\nJohn Clifford Brian Gysin was born at the Canadian military hospital in the grounds of Cliveden, Taplow, England. His mother, Stella Margaret Martin, was a Canadian from Deseronto, Ontario. His father, Leonard Gysin, a captain with the Canadian Expeditionary Force, was killed in action eight months after his son's birth. Stella returned to Canada and settled in Edmonton, Alberta where her son became \"the only Catholic day-boy at an Anglican boarding school\".Cf. John Geiger's biographical essay on Gysin titled, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, ed. José Férez Kuri (London: Thames & Hudson, 2003), p. 201. Graduating at fifteen, Gysin was sent to Downside School in Stratton-on-the-Fosse, near Bath, Somerset in England, a prestigious college run by the Benedictines and known as \"the Eton of Catholic public schools\". Despite, or because of, attending a Catholic school, Gysin became an atheist.\n\nSurrealism\n\nIn 1934, he moved to Paris to study La Civilisation Française, an open course given at the Sorbonne where he made literary and artistic contacts through Marie Berthe Aurenche, Max Ernst's second wife.Cf. John Geiger, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, p. 204. He joined the Surrealist Group and began frequenting Valentine Hugo, Leonor Fini, Salvador Dalí, Picasso and Dora Maar. A year later, he had his first exhibition at the Galerie Quatre Chemins in Paris with Ernst, Picasso, Hans Arp, Hans Bellmer, Victor Brauner, Giorgio de Chirico, Dalí, Marcel Duchamp, René Magritte, Man Ray and Yves Tanguy. On the day of the preview, however, he was expelled from the Surrealist Group by André Breton, who ordered the poet Paul Éluard to take down his pictures. Gysin was 19 years old. His biographer, John Geiger, suggests the arbitrary expulsion \"had the effect of a curse. Years later, he blamed other failures on the Breton incident. It gave rise to conspiracy theories about the powerful interests who seek control of the art world. He gave various explanations for the expulsion, the more elaborate involving 'insubordination' or lèse majesté towards Breton\".\n\nAfter World War II\n\nAfter serving in the U.S. army during World War II, Gysin published a biography of Josiah \"Uncle Tom\" Henson titled, To Master, a Long Goodnight: The History of Slavery in Canada (1946). A gifted draughtsman, he took an 18-month course learning the Japanese language (including calligraphy) that would greatly influence his artwork. In 1949, he was among the first Fulbright Fellows. His goal: to research the history of slavery at the University of Bordeaux and in the Archivo de Indias in Seville, Spain, a project that he later abandoned. He moved to Tangier, Morocco after visiting the city with novelist and composer Paul Bowles in 1950. In 1952/3 he met the travel writer and sexual adventurer Anne Cumming and they remained friends until his death.Richard Davenport-Hines, ‘Cumming, (Felicity) Anne (1917–1993)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Oct 2009 [http://www.oxforddnb.com/view/article/51816, accessed 11 April 2017]\n\nMorocco and the Beat Hotel\n\nIn 1954 in Tangier, Gysin opened a restaurant called The 1001 Nights, with his friend Mohamed Hamri, who was the cook. Gysin hired the Master Musicians of Jajouka from the village of Jajouka to perform alongside entertainment that included acrobats, a dancing boy and fire eaters.Greene, Michelle, The Dream at the End of the World, (New York, 1991), p. 123, p. 201Geiger, John, Nothing is True, Everything is Permitted: the Life of Brion Gysin, (New York, 2005), p. 103 The musicians performed there for an international clientele that included William S. Burroughs. Gysin lost the business in 1958,In his essay \"Cut-Ups: A Project for Disastrous Success,\" Gysin explains that \"on January 5, 1958, I lost the business over a signature given to a friendly American couple who 'wanted to help me out.' I was out with the shirt on my back.\" in A Williams Burroughs Reader, ed. John Calder (London: Picador, 1982), p. 276. and the restaurant closed permanently. That same year, Gysin returned to Paris, taking lodgings in a flophouse located at 9 rue Gît-le-Coeur that would become famous as the Beat Hotel. Working on a drawing, he discovered a Dada technique by accident:\n\nWilliam Burroughs and I first went into techniques of writing, together, back in room No. 15 of the Beat Hotel during the cold Paris spring of 1958... Burroughs was more intent on Scotch-taping his photos together into one great continuum on the wall, where scenes faded and slipped into one another, than occupied with editing the monster manuscript... Naked Lunch appeared and Burroughs disappeared. He kicked his habit with Apomorphine and flew off to London to see Dr Dent, who had first turned him on to the cure. While cutting a mount for a drawing in room No. 15, I sliced through a pile of newspapers with my Stanley blade and thought of what I had said to Burroughs some six months earlier about the necessity for turning painters' techniques directly into writing. I picked up the raw words and began to piece together texts that later appeared as \"First Cut-Ups\" in  Minutes to Go (Two Cities, Paris 1960).Brion Gysin: Cut-Ups: A Project for Disastrous Success, published in Evergreen Review and much later in [Brion Gysin] Let the Mice In, Something Else Press, West Clover 1973; also in the A Williams Burroughs Reader, John Calder (editor), Picador, London 1982, p. 272.\n\nWhen Burroughs returned from London in September 1959, Gysin not only shared his discovery with his friend but the new techniques he had developed for it. Burroughs then put the techniques to use while completing Naked Lunch and the experiment dramatically changed the landscape of American literature. Gysin helped Burroughs with the editing of several of his novels including Interzone, and wrote a script for a film version of Naked Lunch, which was never produced. The pair collaborated on a large manuscript for Grove Press titled The Third Mind but it was determined that it would be impractical to publish it as originally envisioned. The book later published under that title incorporates little of this material. Interviewed for The Guardian in 1997, Burroughs explained that Gysin was \"the only man that I've ever respected in my life. I've admired people, I've liked them, but he's the only man I've ever respected.\" The Guardian, January 18, 1997. In 1969, Gysin completed his finest novel, The Process, a work judged by critic Robert Palmer as \"a classic of 20th century modernism\".From Palmer's forward to the novel published by The Overlook Press in 1987.\n\nA consummate innovator, Gysin altered the cut-up technique to produce what he called permutation poems in which a single phrase was repeated several times with the words rearranged in a different order with each reiteration. An example of this is \"I don't dig work, man/Man, work I don't dig.\"  Many of these permutations were derived using a random sequence generator in an early computer program written by Ian Sommerville. Commissioned by the BBC in 1960 to produce material for broadcast, Gysin's results included \"Pistol Poem\", which was created by recording a gun firing at different distances and then splicing the sounds. That year, the piece was subsequently used as a theme for the Paris performance of Le Domaine Poetique, a showcase for experimental works by people like Gysin, François Dufrêne, Bernard Heidsieck, and Henri Chopin.\n\nWith Sommerville, he built the Dreamachine in 1961. Described as \"the first art object to be seen with the eyes closed\",Quoted on coverflap of Tuning in to the Multimedia Age. the flicker device uses alpha waves in the 8-16 Hz range to produce a change of consciousness in receptive viewers.\n\nLater years\n\nIn 1985 Gysin was made an American Commander of the French Ordre des Arts et des Lettres. He'd begun to work extensively with noted jazz soprano saxophonist Steve Lacy. They recorded an album in 1986 with French musician Ramuntcho Matta, featuring Gysin singing/rapping his own texts, with performances by Lacy, Don Cherry, Elli Medeiros, Lizzy Mercier Descloux and more. The album was reissued on CD in 1993 by Crammed Discs, under the title Self-Portrait Jumping.\n\nOn July 13, 1986 Brion Gysin died of lung cancer. Anne Cumming arranged his funeral and for his ashes to be scattered at the Caves of Hercules in Morocco. An obituary by Robert Palmer published in The New York Times described him as a man who \"threw off the sort of ideas that ordinary artists would parlay into a lifetime career, great clumps of ideas, as casually as a locomotive throws off sparks\".Cf. John Geiger, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, p. 227. Later that year a heavily edited version of his novel, The Last Museum, was published posthumously by Faber & Faber (London) and by Grove Press (New York).\n\nAs a joke, Gysin had contributed a recipe for marijuana fudge to a cookbook by Alice B. Toklas; it was unintentionally included for publication, becoming famous under the name Alice B. Toklas brownies.Biographer John Geiger writes that Gysin's restaurant, The 1001 Nights provided him \"with an entrée into Tangiers society. His Moroccan culinary delights even merited an entry in Alice B. Toklas's famous cookbook, with a recipe for hashish fudge. Toklas, however, had no idea what the mysterious ingredient - cannabis - was, protesting later 'of course I didn't know the Latin name'.\" Cf. John Geiger, 'Brion Gysin: His Life and Times' in Brion Gysin: Tuning into the Multimedia Age, p. 213.\n\nBurroughs on the Gysin cut-up\n\nIn a 1966 interview by Conrad Knickerbocker for The Paris Review, William S. Burroughs explained that Brion Gysin was, to his knowledge, \"the first to create cut-ups\".\n\nINTERVIEWER: How did you become interested in the cut-up technique?\n\nBURROUGHS: A friend, Brion Gysin, an American poet and painter, who has lived in Europe for thirty years, was, as far as I know, the first to create cut-ups. His cut-up poem, Minutes to Go, was broadcast by the BBC and later published in a pamphlet. I was in Paris in the summer of 1960; this was after the publication there of Naked Lunch. I became interested in the possibilities of this technique, and I began experimenting myself. Of course, when you think of it, The Waste Land was the first great cut-up collage, and Tristan Tzara had done a bit along the same lines. Dos Passos used the same idea in 'The Camera Eye' sequences in USA. I felt I had been working toward the same goal; thus it was a major revelation to me when I actually saw it being done.Knickerbocker, Conrad, Burroughs, Williams S., 'The Paris Review Interview with William S. Burroughs' in A Williams Burroughs Reader, ed. John Calder (London: Picador, 1982), p. 263.\n\nInfluence\n\nAccording to José Férez Kuri, author of Brion Gysin: Tuning in to the Multimedia Age (2003) and co-curator of a major retrospective of the artist's work at The Edmonton Art Gallery in 1998, Gysin's wide range of \"radical ideas would become a source of inspiration for artists of the Beat Generation, as well as for their successors (among them David Bowie, Mick Jagger, Keith Haring, and Laurie Anderson)\".Kuri, Tuning in to the Multimedia Age, coverflap.  Other artists include Genesis P-Orridge, John Zorn (as displayed on the 2013's Dreamachines album) and Brian Jones.\n\nSelected bibliography\n\nGysin is the subject of John Geiger's biography, Nothing Is True Everything Is Permitted: The Life of Brion Gysin, and features in Chapel of Extreme Experience: A Short History of Stroboscopic Light and the Dream Machine, also by Geiger. Man From Nowhere: Storming the Citadels of Enlightenment with William Burroughs and Brion Gysin, a biographical study of Burroughs and Gysin with a collection of homages to Gysin, was authored by Joe Ambrose, Frank Rynne, and Terry Wilson with contributions by Marianne Faithfull, John Cale, William S. Burroughs, John Giorno, Stanley Booth, Bill Laswell, Mohamed Hamri, Keith Haring and Paul Bowles. A monograph on Gysin was published in 2003 by Thames and Hudson.\n\nWorks\n\nProse\n*To Master, A Long Goodnight: The History of Slavery in Canada (1946)\n* Minutes to Go (1960)\n*The Exterminator (1960)\n*The Process (1969)\n*Brion Gysin Let The Mice In (1973)\n*The Third Mind (1978)\n*Here To Go: Planet R-101 (first published 1982)\n*Stories (1984)\n*The Last Museum (1985)\n\nRadio\n*Pistol Poem (1960)\n*Permutations (1960)\n*I Am (1960)\n* No Poets (1962)\n* Junk is No Good Baby (1962)\n\nCinema\n*Scenario to Naked Lunch (1973)\nMusic\n*Songs (with Steve Lacy) (rec. 1981)\n*Junk (1985)\n*Self-Portrait Jumping (with Ramuntcho Matta, Don Cherry, Steve Lacy) (1993)\nPainting\n*Les deux faux interlocuteurs, Gradiva Rediviva Zoe Bertgang, and Signe dans le paysage (Surrealist ink drawings, 1935)\n*Sahara Sand (1958)\n*The Songs of Marrakech (1959)\n*Unit II pink, Unit III yellow, Unit IV orange, Unit V blue (1961)\n*Francis in the Beat Hotel (1962)\n*For a Stained-Glass Window in Rheims (1963)\n*Roller Poem (1971)\n*Calligraffiti of Fire (1986)\n\nSources \n\nPrint\n\nPrimary sources\n\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nSecondary sources\n\n*Kuri, José Férez, ed. Brion Gysin: Tuning in to the Multimedia Age. London: Thames & Hudson,  2003.  \n*Geiger, John. Nothing Is True Everything Is Permitted: The Life of Brion Gysin. Disinformation Company, 2005. \n*Geiger, John. Chapel of Extreme Experience: A Short History of Stroboscopic Light and the Dream Machine. Soft Skull Press, 2003.\n*Ambrose, Joe, Frank Rynne, and Terry Wilson. Man From Nowhere: Storming the Citadels of Enlightenment with William Burroughs and Brion Gysin. Williamsburg: Autonomedia, 1992\n*Vale, V. William Burroughs, Brion Gysin, Throbbing Gristle. San Francisco: V/Search, 1982. Brion Gysin. http://en.wikipedia.org/?curid=4188."
  }
}
