{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12691",
  "eid" : "043b6da0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778516346,
  "textBody" : "The Geography of Albania is defined by its location. Albania is a small predominantly mountainous country in Southeastern Europe, on facing the Adriatic and Ionian Seas within the Mediterranean Sea. About 20% of the country's territory consist of coastal plains, while the remaining by a mass of high rugged mountain ranges. Albania covers a territory of 28748 km2, making it the 145th largest country in the world. It lies mostly between latitudes 42° and 39° N, and longitudes 21° and 19° E. The country shares borders with Montenegro in the northwest, Kosovo in the northeast, Macedonia in the east and Greece in the south. It's coastline length on the Adriatic and the Ionian Seas is 476 km. The lowlands of the west face the Adriatic Sea and the strategically important Strait of Otranto, which puts less than 72 km of water between Albania and the heel of the Italian coast.\n\nTopographically, the country encompasses coastal plains in the west to the Albanian Alps in the north, the Sharr Mountains in the northeast, Skanderbeg Mountains in the center, Korab Mountains in the east, Pindus Mountains in the southeast and Ceraunian Mountains in the southwest along the Albanian Riviera. The hydrographic network of Albania includes several of the largest and most ancient bodies of freshwater in Southern Europe. Lake Shkodër is located on the border between Albania and Montenegro, with an area that seasonally can vary between 370 km2 to 600 km2. However, the Lake Ohrid is the deepest lake 288 m in the Balkans, the ancient lake in Europe and one of the most ancient in the world.. \n\nAlbania is distinguished for its rich biological diversity. Due to its climatic, hydrological, geological and topographical conditions, Albania is host to 30% of the entire flora and 42% of fauna of Europe. There are 799 Albanian protected areas covering a surface of 5,216.96 square kilometres. These include 2 strict nature reserves, 14 national parks, 1 marine park, 8 archaeological parks, 750 natural monuments, 22 habitat/species management areas, 5 protected landscapes, 4 protected landscapes, 4 managed resources areas and 4 ramsar wetlands. The national parks covers a surface area of  or roughly 13.65% of the overall territory.[http://www.mjedisi.gov.al/files/userfiles/Biodiversiteti/ZM&PK-Pershkrim.pdf Përshkrimi i Rrjetit aktual të zonave të mbrojtura] \n\nThe northern border is 287 km long, of them 173 km are with Montenegro and 114 km with Kosovo. In the north and the northeast mountainous sections, the border connects high points and follows mountain ridges through the largely inaccessible Albanian Alps. For the most part, there is no natural boundary from the highlands to the Adriatics, although Lake of Shkodër and a portion of the Buna River south of it were used to mark the northwest border with Montenegro. The eastern border with the Republic of Macedonia is 151 km long. The frontier runs from the Dibër valley in the east; to the north it is the Korab mountain range, containing Mount Korab at 2764 m above the Adriatic the highest point in both countries, through the Elbasan County, crosses the Lake of Ohrid and ends at the Lake of Prespa in the Korçë County. In addition to the Mount Korab, it is the highest mountain of the European Green Belt. The southern and southeastern border with Greece is 282 km. The Gramos mountain range forms the border with Greece. The western border 446 km is maritime and encompasses the Albanian Adriatic Sea Coast from Buna River in the north near the city of Shkodër up to the Bay of Vlorë and the Albanian Riviera, where the Ionian Sea to the border with Greece.\n\nIn 2016, Albania had a population of 2.87 million (1,46 million males and 1,42 million females), ranking 136th in the world by population. The population density was 101 inhabitants per square kilometre. The overall life expectancy in Albania at birth is 78 years. The total fertility rate of 1.80 children per mother is one of the lowest in the world. In 2016, the population of Albania was about 2,89 million, comprising 1,447 million male and 1,443 female persons. There were 38,003 live births and 20,737 deaths in Albania. The natural increase of the population was positive, as the number of births exceeded the number of deaths by 17,266. Due to external migration, the population declined by 18,307. The total dependency ratio of population in Albania is 46.8 %.\n\nTerritory \n\nWith a surface of , Albania is placed along the eastern part of the Adriatic Sea and the Ionian Sea inside the Mediterranean Sea. It has a length of borders about 1094 km, 657 km of which are terrestrial, 316 km of shore border, 48 km river borders and 73 km of lake borders. Inland water surface is 1350 km², composed by natural lakes 325 km², coastal lagoons 130 km², artificial lakes 174 km² and rivers 721 km. Except the coastline, all Albanian borders are artificial. They were established at the 1912-1913 Conference London. The country was occupied by several forces during first World War, but the 1913 boundaries were essentially reaffirmed by the victorious states in 1921. Division of the lake district among three states required that each of them have a share of the lowlands in the vicinity. Such an artificial distribution, once made, necessarily affected the borderlines to the north and south. The border that runs generally north from the lakes, although it follows the ridges of the eastern highlands, stays sixteen to 32 km west of the watershed divide. Due to negotiators at the Conference of London declined to use the watershed divide as the northeast boundary of the new state of Albania, the Albanian population of Kosovo was incorporated into Serbia.\n\nWestern Lowlands \n \n\nAdriatic Coast \n\nAlbania's Adriatic Sea Coast is 274 km long and covers most of the western bound of Albania, stretching from the mouth of Buna River close to Lake Shkodër in the north down to Vlora Bay in the south, whereas the Ionian Sea and Albanian Riviera begins. Almost 74% is coastal lowland marked by sandy beaches, river mouth deposits and marshlands. The coastline offers wide and long sandy beaches with capes, bays and lagoons. The shores are largely alluvial or terraced, built by the quaternary deposits of the Drin, Mat, Ishëm, Seman, Shkumbin, Erzen, and Vjosa Rivers. The sediments which has been discharged by Shkumbin, Seman and Vjosa has formed up the Myzeqe Plain with Karavasta and Narta in the immediate proximity of the sea. From Durrës to Bay of Vlorë, the coastline is relative low with no rocky shores related to the vast Myzeqe Plain. \n\nThe largest Albanian cities on the Adriatic Sea Coast are Durrës, Shëngjin and Vlorë. The country has 10 islands on the Adriatic Sea, with Sazan and Kunë, being larger than one square kilometres. Sazan is strategically located between the Strait of Otranto and the entrance to the Bay of Vlorë; it is the country's westernmost point. The climate is not Mediterranean but rather subtropical on account of its warm winters and hot summers. The climate and vegetation resemble those of the south of Crete, Tunisia and even parts of Egypt.\n\nIonian Coast \n\nThe Ionian Sea Coast is 172 km long, extending from Bay of Vlorë until the border with Greece. Although, most of the coastline represents the renowned Albanian Riviera. The Ionian littoral is represented western edge of the Maja e Çikës anticline in Ionian tectonic zone. 80% of the Ionian litoral is rocky high coast. The mountains along the coast rises up to approximately 2045 m. The Ceraunian Mountains extend nearly 100 km along the Albanian Riviera in a north-west direction from the Albanian-Greek border to the Llogara Pass, on the eastern shore of Strait of Otranto. In addition, the Llogara Pass 1027 m divides the mountains into a western and an eastern range. \n\nThe coastline continues down along the coast through the villages of Borsh, Dhermi, Himara, Qeparo, and Piqeras, and ends at Lukovë. Sarandë is ahead with Vlorë, the largest city along the Albanian Ionian coastline. It is also home to 2 islands, with Ksamil being the largest with an area of , followed by the rocky Tongo Island.\n\nNorthern Mountain Range \n \n\nAlbanian Alps \n \n   \n\n \n\nThe composition of the great tectonic units reflects the history of the formation of the Albanian Alps. They are the southernmost geological continuation of the Dinaric Alps, forming a section of the Alpine-Himalayan orogenic belt, which extend from the Atlantic Ocean to the Himalaya Mountains. The Albanian Alps extend more than 64 km from Lake Shkodër along the border with Montenegro in the southwest, towards to Kosovo in the northeast. Albania encompasses the significant portion of the Alps with a surface area of 2240 km². The ice ages had relatively little direct geologic influence on the Albanian Alps. No permanent ice caps existed, and there is a little evidence of extensive glaciation. Further, the southernmost glaciers in Europe were recently discovered on the Albanian portion of the Alps.\n\nMaja Jezercë is the highest mountain of the Dinaric Alps with an altitude of 2694 m above the Adriatic. However, it is the second highest mountain in Albania. Other high mountains within the Albanian Alps includes Maja Radohimës 2570 m, Maja Kollatës 2554 m, Maja Gjallica 2489 m, Maja Bogiçaj 2405 m, Maja Koritnik 2393 m, Maja Shkëlzen 2404 m and Maja e Thatë 2404 m.\n\nThe Albanian Alps are home to many important rivers of Western Balkans. The main drainage basins of the Alps are those of the Drin and Danube Rivers. Rivers on the Alps fall roughly into two categories, those that flow into the Lim and those that enter the White Drin and meet the Black Drin downstream at the Drin confluence. However, Drin dominates, draining most of the Alps with its tributaries and when measured from the source of the White Drin to the mouth of the Drin near Lezhë. But not all of the Drin flows near or parallel to the Alps. One Drin tributary is the Valbona River, which drains into the Adriatic Sea, and its eastern tributary the Gashi River.\n\nCentral Mountain Range \n \n\nKorab Mountains \n\n  \n\nThe Korab Mountains are the most defining feature of eastern Albania. They stretch in north-south direction along the tripoint of Albania, Macedonia and Kosovo up to Lake Ohrid. The mountain chain is part of the inner Albanides within the Dinarido-Albanido-Hellenides organic belt. The composition of the mountains is of mainly with Paleozoic limestones and dolomites, including numerous fossils. Located about 2000 m above the Adriatic, the mountains are characterized by an extremely fragmented, rugged alpine landscape hosting a great diversity of ecosystems and biodiversity. The Mount Korab is the highest summit on the range as well one of the highest in the Balkans standing at 2764 m. \n\nOther high mountains are Maja Gjallica 2489 m, Maja Koritnik 2393 m, Maja e Pikellimes 2392 m, Mali i Gramës 2345 m and Maja e Velivarit 2375 m. \n\nKorab is renowned for its 39 glacial lakes situated between 2300 m elevation above the Adriatic with Gramë Lake being the largest and the deepest.\n\nSouthern Mountain Range \n \n\nCeraunian Mountains \n\n \n\nThe Ceraunian Mountains, a coastal mountain range in southwestern Albania, stretches about 100 km one the Ionian Sea from Sarandë in south-east-northwest direction along the Albanian Riviera Orikum. The relief is varied, with many mountain passes, canyons, gorges, hills and other landforms. The mountains are characterized by housing Black pines, Bulgarian firs, Bosnian pines and Ash trees. The mountain chain is home to many large mammals, including brown bears, grey wolves, lynx, golden eagles and others. The highest point on the chain is Maja e Çikës, that rises to an elevation of 2045 m above the Adriatic. From the peak, there is a magnificent view of the Albanian Riviera, the northern Ionian Islands as well as the Italian coast of Apulia and Otranto. The section has wide and long beaches, with a number of bays and headlands. \n\nStreching until the Llogara Pass at 1027 m, the mountain chain gets separated into the Ceraunians in the west and the Akroceraunians (or Reza e Kanalit) in the east within the Karaburun Peninsula. The villages of Palasë, Dhërmi, Vuno, Himarë, Qeparo, Borsh, Pilur, Kudhës and Ilias are located on the Ceraunian range. The Llogara National Park covers an area of 10100 m² and\n\nKaraburun Peninsula \n \n \n\nThe Karaburun Peninsula is situated at the eastern side of Strait of Otranto, where the Adriatic Sea meets the Ionian Sea. Its area is 62 km², having a length of 16 km, and a width of only 5 km. The Mesokanali is the narrow channel, that separates the peninsula from the Sazan Island. Geologically, it is made up of carbonic limestone, dating back to the Mesozoic period, while in the northwestern it is composed of terrigenous sediment. Furthermore, these formations have been continuously under the effect of Karst and are exploited as marble. The relief of the peninsula comprises a number of hills with a average altitude of about 800 m above the Adriatic. The highest summits are Maja e\nIlqës 733 m, Maja e Flamurit 826 m and Maja Çadëri 839 m. \n\nThe coastal landscape is characterized by a rough relief, that dips vertically into the Ionian Sea, it features several solitary peaks, large canyons, bays, caves and gulfs. Examples of typicall landforms include Gjipe Canyon, Gjiri i Arushës, Gjiri i Dafinës, Gjiri i Gramës and so on. The geological evolution has formed also capes such as Haxhi Aliu, Galloveci and Kepi i Gjuhëzës, and other of 20 caves along the entire shoreline.\n\nThe climate is mediterranean, having hot summers and generally warm to cool, dry winters. Due to its climatic, hydrological and geological conditions, the area is characterized by its unique flora and fauna. Most of the territory consists of forests and is relatively well preserved, it include many types of trees, such as Mediterranean oak, Manna ash, Kermes oak and Field maple.\n\nTopography and Hydrography \n\n \n\nIn the relatively small territory, Albania has extensive lowlands, plains, hills, low and high mountains, many valleys, caves and deep gorges. Albania is predominantly mountainous country with an average elevation of about 708 m of which mountains occupy about two thirds of the territory. Most of the mountains were formed during the Jurassic and Cenozoic periods. From north to south, the largest mountain ranges are the Albanian Alps, Korab Mountains, Skanderbeg Mountains, Ceraunian Mountains and Pindus Mountains. The Albanian Alps in the north, Skanderbeg Mountains in the center and Ceraunian Mountains in the south, separates the interior of Albania from the coastal plain. Along the Western Lowlands there is a alluvial plain that extends from southern Vlorë across the Albanian Adriatic mainland coast to Lake Shkodër on the Albanian and Montenegrin borders. The Albanian Adriatic coast is characterized by numerous lagoons and wetlands, while the Albanian Ionian coast rises steeply to the Ceraunian Mountains. \n\nBiogeographically, Albania falls within the Alpine and Mediterranean Basin. The Albanian Mediterranean Basin is home to 68 percent of Albania's population.  Albania belongs to the Dinarides that forms the southern section of the Alpide belt, extending south from the Southern Alps in Central Europe along the east coast of the Adriatic and Ionian Seas towards the Aegean Sea. The Albanian Alps are the southernmost section of the Dinaric Alps, \n \n\nThe territory of Albania covers about 65% of a total water area of . River mouths and deltas, lagoons, abandoned riverbeds, marsh labyrinths, sandy or rocky beaches, dunes covered with vegetation, dense forests represents the littoral of Albania. Albania has around 247 natural lakes, mostly of karstic or glacial origin. It's largest lakes are Shkodër in the northwest, Ohrid, Prespa and Small Prespa in the southeast and Butrint in the southwest. Albania is also home to many lagoons, such as Karavasta, Patoku, Narta, Kunë-Vain and Butrint.\n\nThe northern, central and southern mountain ranges divide Albania into nearly equal drainage systems. It has a dense network of about 152 rivers and streams, forming at least 10 large rivers flowing from east to west, mainly discharging towards the Adriatic sea. The rivers of Albania are characterized by a high flow rate. There are two catchment basins such as the Adriatic Sea and the Ionian Sea basins. The eight rivers are the Drin 285 km, Vjosë\n192 km, Shkumbin 181 km, Mat 115 km, Erzen 108 km, Seman 85 km, Ishëm 74 km, and the Buna 74 km.\n\nNearly all of the precipitation that falls on Albania, drains into the rivers and reaches the coast on the west without even leaving the country. In the north, only one small stream escapes Albania. In the south, an even smaller rivulet drains into Greece. Due to the topographical divide is east of the border with the Republic of Macedonia. An extensive portion of the basin of the White Drin, basin is in the Dukagjin region, across the northeastern border with Kosovo. The Lake of Ohrid, Lake of Prespa and the Small Lake of Prespa on the southeast, as well as the streams that flow into them, drain into the Black Drin. The watershed divide in the south also dips nearly 75 km into Greece at one point. Several tributaries of the Vjosa River rise in that area.\n\nThe longest river located in the Albanian territory is the Drin, with a length of 285 km and a catchment area of 5957 km2. It is fed by melting snows from the northern Albanian Alps and the eastern Korab Mountains and by the more evenly distributed seasonal precipitation of that area. Its flow does not have the extreme variations characteristic of nearly all other rivers in Albania. As it collects from the Adriatic portion of Kosovo's watersheds and the Lake Prespa and Small Prespa Lake drains to the Lake Ohrid along an underground stream, its total basin encompasses about 15540 km2. The Seman and Vjosa Rivers are the only other rivers that are longer than 160 km and having basins larger than 2600 km2.\n\nClimate and Biodiversity\n\nConsidering its relatively small area, Albania has variable and complex climate. The country's diverse regions has a remarkable range of microclimates, with the weather system on the coasts contrasting with that prevailing in the interior. However, the weather in Albania varies from the north to the south and the west to the east. Albania occupies The climate ranges from Temperate climate on the coasts to Continental climate in the interior. The warmest areas of the country are at the coasts, which are characterized by a Mediterranean climate (Csa, Csb and Cfa) as defined by the Köppen climate classification. The highlands experiences a Oceanic climate. Winters in Albania are characteristically mild and wet while summers are warm and dry. The northern areas of country such as the Albanian Alps experiences Subarctic climate with frequently very cold winters, and short, mild summers. \n\nThe lowlands of Albania have mild winters, averaging about 7 °C. The summer temperatures average 32 °C, however, humidity is low. In the southern lowlands specifically the areas on the Ionian sea, temperatures average about 5 °C in the winter and 30 °C during the summer. \n\nAlthough a small territory, Albania can be subdivided between a number of ecoregions, due to its climatic, hydrological, geological and topographical conditions, which makes the country one of the richest in Europe in terms of biodiversity. 30% of the entire flora and 42% of fauna in Europe is found in the country. Albania is part of the Boreal Kingdom specifically, part of the Illyrian province of the Circumboreal Region within the Boreal kingdom. The country is divided into four ecoregions, among them are the Illyrian deciduous forests, Dinaric Alpine mixed forests, Balkan mixed forests and Pindus Mountains mixed forests. Further, Biomes in Albania include Temperate broadleaf and mixed forest and Mediterranean forests, woodlands, and scrub, forming part of the Palearctic ecozone. Within the country's territory, there are 799 protected areas covering a surface of 5,216.96 square kilometres.[http://www.mjedisi.gov.al/files/userfiles/Biodiversiteti/ZM&PK-Pershkrim.pdf Përshkrimi i Rrjetit aktual të zonave të mbrojtura]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Geography of Albania" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12691" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Geography of Albania is defined by its location. Albania is a small predominantly mountainous country in Southeastern Europe, on facing the Adriatic and Ionian Seas within the Mediterranean Sea. About 20% of the country's territory consist of coastal plains, while the remaining by a mass of high rugged mountain ranges. Albania covers a territory of 28748 km2, making it the 145th largest country in the world. It lies mostly between latitudes 42° and 39° N, and longitudes 21° and 19° E. The country shares borders with Montenegro in the northwest, Kosovo in the northeast, Macedonia in the east and Greece in the south. It's coastline length on the Adriatic and the Ionian Seas is 476 km. The lowlands of the west face the Adriatic Sea and the strategically important Strait of Otranto, which puts less than 72 km of water between Albania and the heel of the Italian coast.\n\nTopographically, the country encompasses coastal plains in the west to the Albanian Alps in the north, the Sharr Mountains in the northeast, Skanderbeg Mountains in the center, Korab Mountains in the east, Pindus Mountains in the southeast and Ceraunian Mountains in the southwest along the Albanian Riviera. The hydrographic network of Albania includes several of the largest and most ancient bodies of freshwater in Southern Europe. Lake Shkodër is located on the border between Albania and Montenegro, with an area that seasonally can vary between 370 km2 to 600 km2. However, the Lake Ohrid is the deepest lake 288 m in the Balkans, the ancient lake in Europe and one of the most ancient in the world.. \n\nAlbania is distinguished for its rich biological diversity. Due to its climatic, hydrological, geological and topographical conditions, Albania is host to 30% of the entire flora and 42% of fauna of Europe. There are 799 Albanian protected areas covering a surface of 5,216.96 square kilometres. These include 2 strict nature reserves, 14 national parks, 1 marine park, 8 archaeological parks, 750 natural monuments, 22 habitat/species management areas, 5 protected landscapes, 4 protected landscapes, 4 managed resources areas and 4 ramsar wetlands. The national parks covers a surface area of  or roughly 13.65% of the overall territory.[http://www.mjedisi.gov.al/files/userfiles/Biodiversiteti/ZM&PK-Pershkrim.pdf Përshkrimi i Rrjetit aktual të zonave të mbrojtura] \n\nThe northern border is 287 km long, of them 173 km are with Montenegro and 114 km with Kosovo. In the north and the northeast mountainous sections, the border connects high points and follows mountain ridges through the largely inaccessible Albanian Alps. For the most part, there is no natural boundary from the highlands to the Adriatics, although Lake of Shkodër and a portion of the Buna River south of it were used to mark the northwest border with Montenegro. The eastern border with the Republic of Macedonia is 151 km long. The frontier runs from the Dibër valley in the east; to the north it is the Korab mountain range, containing Mount Korab at 2764 m above the Adriatic the highest point in both countries, through the Elbasan County, crosses the Lake of Ohrid and ends at the Lake of Prespa in the Korçë County. In addition to the Mount Korab, it is the highest mountain of the European Green Belt. The southern and southeastern border with Greece is 282 km. The Gramos mountain range forms the border with Greece. The western border 446 km is maritime and encompasses the Albanian Adriatic Sea Coast from Buna River in the north near the city of Shkodër up to the Bay of Vlorë and the Albanian Riviera, where the Ionian Sea to the border with Greece.\n\nIn 2016, Albania had a population of 2.87 million (1,46 million males and 1,42 million females), ranking 136th in the world by population. The population density was 101 inhabitants per square kilometre. The overall life expectancy in Albania at birth is 78 years. The total fertility rate of 1.80 children per mother is one of the lowest in the world. In 2016, the population of Albania was about 2,89 million, comprising 1,447 million male and 1,443 female persons. There were 38,003 live births and 20,737 deaths in Albania. The natural increase of the population was positive, as the number of births exceeded the number of deaths by 17,266. Due to external migration, the population declined by 18,307. The total dependency ratio of population in Albania is 46.8 %.\n\nTerritory \n\nWith a surface of , Albania is placed along the eastern part of the Adriatic Sea and the Ionian Sea inside the Mediterranean Sea. It has a length of borders about 1094 km, 657 km of which are terrestrial, 316 km of shore border, 48 km river borders and 73 km of lake borders. Inland water surface is 1350 km², composed by natural lakes 325 km², coastal lagoons 130 km², artificial lakes 174 km² and rivers 721 km. Except the coastline, all Albanian borders are artificial. They were established at the 1912-1913 Conference London. The country was occupied by several forces during first World War, but the 1913 boundaries were essentially reaffirmed by the victorious states in 1921. Division of the lake district among three states required that each of them have a share of the lowlands in the vicinity. Such an artificial distribution, once made, necessarily affected the borderlines to the north and south. The border that runs generally north from the lakes, although it follows the ridges of the eastern highlands, stays sixteen to 32 km west of the watershed divide. Due to negotiators at the Conference of London declined to use the watershed divide as the northeast boundary of the new state of Albania, the Albanian population of Kosovo was incorporated into Serbia.\n\nWestern Lowlands \n \n\nAdriatic Coast \n\nAlbania's Adriatic Sea Coast is 274 km long and covers most of the western bound of Albania, stretching from the mouth of Buna River close to Lake Shkodër in the north down to Vlora Bay in the south, whereas the Ionian Sea and Albanian Riviera begins. Almost 74% is coastal lowland marked by sandy beaches, river mouth deposits and marshlands. The coastline offers wide and long sandy beaches with capes, bays and lagoons. The shores are largely alluvial or terraced, built by the quaternary deposits of the Drin, Mat, Ishëm, Seman, Shkumbin, Erzen, and Vjosa Rivers. The sediments which has been discharged by Shkumbin, Seman and Vjosa has formed up the Myzeqe Plain with Karavasta and Narta in the immediate proximity of the sea. From Durrës to Bay of Vlorë, the coastline is relative low with no rocky shores related to the vast Myzeqe Plain. \n\nThe largest Albanian cities on the Adriatic Sea Coast are Durrës, Shëngjin and Vlorë. The country has 10 islands on the Adriatic Sea, with Sazan and Kunë, being larger than one square kilometres. Sazan is strategically located between the Strait of Otranto and the entrance to the Bay of Vlorë; it is the country's westernmost point. The climate is not Mediterranean but rather subtropical on account of its warm winters and hot summers. The climate and vegetation resemble those of the south of Crete, Tunisia and even parts of Egypt.\n\nIonian Coast \n\nThe Ionian Sea Coast is 172 km long, extending from Bay of Vlorë until the border with Greece. Although, most of the coastline represents the renowned Albanian Riviera. The Ionian littoral is represented western edge of the Maja e Çikës anticline in Ionian tectonic zone. 80% of the Ionian litoral is rocky high coast. The mountains along the coast rises up to approximately 2045 m. The Ceraunian Mountains extend nearly 100 km along the Albanian Riviera in a north-west direction from the Albanian-Greek border to the Llogara Pass, on the eastern shore of Strait of Otranto. In addition, the Llogara Pass 1027 m divides the mountains into a western and an eastern range. \n\nThe coastline continues down along the coast through the villages of Borsh, Dhermi, Himara, Qeparo, and Piqeras, and ends at Lukovë. Sarandë is ahead with Vlorë, the largest city along the Albanian Ionian coastline. It is also home to 2 islands, with Ksamil being the largest with an area of , followed by the rocky Tongo Island.\n\nNorthern Mountain Range \n \n\nAlbanian Alps \n \n   \n\n \n\nThe composition of the great tectonic units reflects the history of the formation of the Albanian Alps. They are the southernmost geological continuation of the Dinaric Alps, forming a section of the Alpine-Himalayan orogenic belt, which extend from the Atlantic Ocean to the Himalaya Mountains. The Albanian Alps extend more than 64 km from Lake Shkodër along the border with Montenegro in the southwest, towards to Kosovo in the northeast. Albania encompasses the significant portion of the Alps with a surface area of 2240 km². The ice ages had relatively little direct geologic influence on the Albanian Alps. No permanent ice caps existed, and there is a little evidence of extensive glaciation. Further, the southernmost glaciers in Europe were recently discovered on the Albanian portion of the Alps.\n\nMaja Jezercë is the highest mountain of the Dinaric Alps with an altitude of 2694 m above the Adriatic. However, it is the second highest mountain in Albania. Other high mountains within the Albanian Alps includes Maja Radohimës 2570 m, Maja Kollatës 2554 m, Maja Gjallica 2489 m, Maja Bogiçaj 2405 m, Maja Koritnik 2393 m, Maja Shkëlzen 2404 m and Maja e Thatë 2404 m.\n\nThe Albanian Alps are home to many important rivers of Western Balkans. The main drainage basins of the Alps are those of the Drin and Danube Rivers. Rivers on the Alps fall roughly into two categories, those that flow into the Lim and those that enter the White Drin and meet the Black Drin downstream at the Drin confluence. However, Drin dominates, draining most of the Alps with its tributaries and when measured from the source of the White Drin to the mouth of the Drin near Lezhë. But not all of the Drin flows near or parallel to the Alps. One Drin tributary is the Valbona River, which drains into the Adriatic Sea, and its eastern tributary the Gashi River.\n\nCentral Mountain Range \n \n\nKorab Mountains \n\n  \n\nThe Korab Mountains are the most defining feature of eastern Albania. They stretch in north-south direction along the tripoint of Albania, Macedonia and Kosovo up to Lake Ohrid. The mountain chain is part of the inner Albanides within the Dinarido-Albanido-Hellenides organic belt. The composition of the mountains is of mainly with Paleozoic limestones and dolomites, including numerous fossils. Located about 2000 m above the Adriatic, the mountains are characterized by an extremely fragmented, rugged alpine landscape hosting a great diversity of ecosystems and biodiversity. The Mount Korab is the highest summit on the range as well one of the highest in the Balkans standing at 2764 m. \n\nOther high mountains are Maja Gjallica 2489 m, Maja Koritnik 2393 m, Maja e Pikellimes 2392 m, Mali i Gramës 2345 m and Maja e Velivarit 2375 m. \n\nKorab is renowned for its 39 glacial lakes situated between 2300 m elevation above the Adriatic with Gramë Lake being the largest and the deepest.\n\nSouthern Mountain Range \n \n\nCeraunian Mountains \n\n \n\nThe Ceraunian Mountains, a coastal mountain range in southwestern Albania, stretches about 100 km one the Ionian Sea from Sarandë in south-east-northwest direction along the Albanian Riviera Orikum. The relief is varied, with many mountain passes, canyons, gorges, hills and other landforms. The mountains are characterized by housing Black pines, Bulgarian firs, Bosnian pines and Ash trees. The mountain chain is home to many large mammals, including brown bears, grey wolves, lynx, golden eagles and others. The highest point on the chain is Maja e Çikës, that rises to an elevation of 2045 m above the Adriatic. From the peak, there is a magnificent view of the Albanian Riviera, the northern Ionian Islands as well as the Italian coast of Apulia and Otranto. The section has wide and long beaches, with a number of bays and headlands. \n\nStreching until the Llogara Pass at 1027 m, the mountain chain gets separated into the Ceraunians in the west and the Akroceraunians (or Reza e Kanalit) in the east within the Karaburun Peninsula. The villages of Palasë, Dhërmi, Vuno, Himarë, Qeparo, Borsh, Pilur, Kudhës and Ilias are located on the Ceraunian range. The Llogara National Park covers an area of 10100 m² and\n\nKaraburun Peninsula \n \n \n\nThe Karaburun Peninsula is situated at the eastern side of Strait of Otranto, where the Adriatic Sea meets the Ionian Sea. Its area is 62 km², having a length of 16 km, and a width of only 5 km. The Mesokanali is the narrow channel, that separates the peninsula from the Sazan Island. Geologically, it is made up of carbonic limestone, dating back to the Mesozoic period, while in the northwestern it is composed of terrigenous sediment. Furthermore, these formations have been continuously under the effect of Karst and are exploited as marble. The relief of the peninsula comprises a number of hills with a average altitude of about 800 m above the Adriatic. The highest summits are Maja e\nIlqës 733 m, Maja e Flamurit 826 m and Maja Çadëri 839 m. \n\nThe coastal landscape is characterized by a rough relief, that dips vertically into the Ionian Sea, it features several solitary peaks, large canyons, bays, caves and gulfs. Examples of typicall landforms include Gjipe Canyon, Gjiri i Arushës, Gjiri i Dafinës, Gjiri i Gramës and so on. The geological evolution has formed also capes such as Haxhi Aliu, Galloveci and Kepi i Gjuhëzës, and other of 20 caves along the entire shoreline.\n\nThe climate is mediterranean, having hot summers and generally warm to cool, dry winters. Due to its climatic, hydrological and geological conditions, the area is characterized by its unique flora and fauna. Most of the territory consists of forests and is relatively well preserved, it include many types of trees, such as Mediterranean oak, Manna ash, Kermes oak and Field maple.\n\nTopography and Hydrography \n\n \n\nIn the relatively small territory, Albania has extensive lowlands, plains, hills, low and high mountains, many valleys, caves and deep gorges. Albania is predominantly mountainous country with an average elevation of about 708 m of which mountains occupy about two thirds of the territory. Most of the mountains were formed during the Jurassic and Cenozoic periods. From north to south, the largest mountain ranges are the Albanian Alps, Korab Mountains, Skanderbeg Mountains, Ceraunian Mountains and Pindus Mountains. The Albanian Alps in the north, Skanderbeg Mountains in the center and Ceraunian Mountains in the south, separates the interior of Albania from the coastal plain. Along the Western Lowlands there is a alluvial plain that extends from southern Vlorë across the Albanian Adriatic mainland coast to Lake Shkodër on the Albanian and Montenegrin borders. The Albanian Adriatic coast is characterized by numerous lagoons and wetlands, while the Albanian Ionian coast rises steeply to the Ceraunian Mountains. \n\nBiogeographically, Albania falls within the Alpine and Mediterranean Basin. The Albanian Mediterranean Basin is home to 68 percent of Albania's population.  Albania belongs to the Dinarides that forms the southern section of the Alpide belt, extending south from the Southern Alps in Central Europe along the east coast of the Adriatic and Ionian Seas towards the Aegean Sea. The Albanian Alps are the southernmost section of the Dinaric Alps, \n \n\nThe territory of Albania covers about 65% of a total water area of . River mouths and deltas, lagoons, abandoned riverbeds, marsh labyrinths, sandy or rocky beaches, dunes covered with vegetation, dense forests represents the littoral of Albania. Albania has around 247 natural lakes, mostly of karstic or glacial origin. It's largest lakes are Shkodër in the northwest, Ohrid, Prespa and Small Prespa in the southeast and Butrint in the southwest. Albania is also home to many lagoons, such as Karavasta, Patoku, Narta, Kunë-Vain and Butrint.\n\nThe northern, central and southern mountain ranges divide Albania into nearly equal drainage systems. It has a dense network of about 152 rivers and streams, forming at least 10 large rivers flowing from east to west, mainly discharging towards the Adriatic sea. The rivers of Albania are characterized by a high flow rate. There are two catchment basins such as the Adriatic Sea and the Ionian Sea basins. The eight rivers are the Drin 285 km, Vjosë\n192 km, Shkumbin 181 km, Mat 115 km, Erzen 108 km, Seman 85 km, Ishëm 74 km, and the Buna 74 km.\n\nNearly all of the precipitation that falls on Albania, drains into the rivers and reaches the coast on the west without even leaving the country. In the north, only one small stream escapes Albania. In the south, an even smaller rivulet drains into Greece. Due to the topographical divide is east of the border with the Republic of Macedonia. An extensive portion of the basin of the White Drin, basin is in the Dukagjin region, across the northeastern border with Kosovo. The Lake of Ohrid, Lake of Prespa and the Small Lake of Prespa on the southeast, as well as the streams that flow into them, drain into the Black Drin. The watershed divide in the south also dips nearly 75 km into Greece at one point. Several tributaries of the Vjosa River rise in that area.\n\nThe longest river located in the Albanian territory is the Drin, with a length of 285 km and a catchment area of 5957 km2. It is fed by melting snows from the northern Albanian Alps and the eastern Korab Mountains and by the more evenly distributed seasonal precipitation of that area. Its flow does not have the extreme variations characteristic of nearly all other rivers in Albania. As it collects from the Adriatic portion of Kosovo's watersheds and the Lake Prespa and Small Prespa Lake drains to the Lake Ohrid along an underground stream, its total basin encompasses about 15540 km2. The Seman and Vjosa Rivers are the only other rivers that are longer than 160 km and having basins larger than 2600 km2.\n\nClimate and Biodiversity\n\nConsidering its relatively small area, Albania has variable and complex climate. The country's diverse regions has a remarkable range of microclimates, with the weather system on the coasts contrasting with that prevailing in the interior. However, the weather in Albania varies from the north to the south and the west to the east. Albania occupies The climate ranges from Temperate climate on the coasts to Continental climate in the interior. The warmest areas of the country are at the coasts, which are characterized by a Mediterranean climate (Csa, Csb and Cfa) as defined by the Köppen climate classification. The highlands experiences a Oceanic climate. Winters in Albania are characteristically mild and wet while summers are warm and dry. The northern areas of country such as the Albanian Alps experiences Subarctic climate with frequently very cold winters, and short, mild summers. \n\nThe lowlands of Albania have mild winters, averaging about 7 °C. The summer temperatures average 32 °C, however, humidity is low. In the southern lowlands specifically the areas on the Ionian sea, temperatures average about 5 °C in the winter and 30 °C during the summer. \n\nAlthough a small territory, Albania can be subdivided between a number of ecoregions, due to its climatic, hydrological, geological and topographical conditions, which makes the country one of the richest in Europe in terms of biodiversity. 30% of the entire flora and 42% of fauna in Europe is found in the country. Albania is part of the Boreal Kingdom specifically, part of the Illyrian province of the Circumboreal Region within the Boreal kingdom. The country is divided into four ecoregions, among them are the Illyrian deciduous forests, Dinaric Alpine mixed forests, Balkan mixed forests and Pindus Mountains mixed forests. Further, Biomes in Albania include Temperate broadleaf and mixed forest and Mediterranean forests, woodlands, and scrub, forming part of the Palearctic ecozone. Within the country's territory, there are 799 protected areas covering a surface of 5,216.96 square kilometres.[http://www.mjedisi.gov.al/files/userfiles/Biodiversiteti/ZM&PK-Pershkrim.pdf Përshkrimi i Rrjetit aktual të zonave të mbrojtura]. Geography of Albania. http://en.wikipedia.org/?curid=12691."
  }
}
