{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16938",
  "eid" : "29c6a260-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778579334,
  "textBody" : "Kaolinite is a clay mineral, part of the group of industrial minerals, with the chemical composition Al2Si2O5(OH)4. It is a layered silicate mineral, with one tetrahedral sheet of silica (SiO4) linked through oxygen atoms to one octahedral sheet of alumina (AlO6) octahedra. Rocks that are rich in kaolinite are known as kaolin or china clay.\n\nThe name \"kaolin\" is derived from \"Gaoling\" (), a Chinese village near Jingdezhen in southeastern China's Jiangxi Province. The name entered English in 1727 from the French version of the word: kaolin, following Francois Xavier d'Entrecolles's reports from Jingdezhen.\n\nKaolinite has a low shrink–swell capacity and a low cation-exchange capacity (1–15 meq/100 g). It is a soft, earthy, usually white, mineral (dioctahedral phyllosilicate clay), produced by the chemical weathering of aluminium silicate minerals like feldspar. In many parts of the world it is colored pink-orange-red by iron oxide, giving it a distinct rust hue. Lighter concentrations yield white, yellow, or light orange colors. Alternating layers are sometimes found, as at Providence Canyon State Park in Georgia, United States. Commercial grades of kaolin are supplied and transported as dry powder, semi-dry noodle or as liquid slurry.\n\nChemistry\n\nNotation\n\nThe chemical formula for kaolinite as used in mineralogy is Al2Si2O5(OH)4, however, in ceramics applications the formula is typically written in terms of oxides, thus the formula for kaolinite is Al2O3·2SiO2·2H2O.Handbook of Inorganic Compounds, Dale L. Perry, Taylor & Francis, 2011, \n\nStructural transformations\n\nKaolinite group clays undergo a series of phase transformations upon thermal treatment in air at atmospheric pressure.\n\nDrying\n\nBelow 100 C, exposure to dry air will slowly remove liquid water from the kaolin. The end-state for this transformation is referred to as \"leather dry\". Between 100 °C and about 550 C, any remaining liquid water is expelled from kaolinite. The end state for this transformation is referred to as \"bone dry\". Throughout this temperature range, the expulsion of water is reversible: if the kaolin is exposed to liquid water, it will be reabsorbed and disintegrate into its fine particulate form. Subsequent transformations are not reversible, and represent permanent chemical changes.\nMetakaolin\n\nEndothermic dehydration of kaolinite begins at 550–600 °C producing disordered metakaolin, but continuous hydroxyl loss is observed up to 900 C. Although historically there was much disagreement concerning the nature of the metakaolin phase, extensive research has led to a general consensus that metakaolin is not a simple mixture of amorphous silica (SiO2) and alumina (Al2O3), but rather a complex amorphous structure that retains some longer-range order (but not strictly crystalline) due to stacking of its hexagonal layers. \nAl2Si2O5(OH)4 →  Al2Si2O7 + 2 H2O.\n\nSpinel\n\nFurther heating to 925–950 °C converts metakaolin to an aluminium-silicon spinel which is sometimes also referred to as a gamma-alumina type structure:\n2 Al2Si2O7 → Si3Al4O12 + SiO2.\n\nPlatelet mullite\n\nUpon calcination above 1050 °C, the spinel phase nucleates and transforms to platelet mullite and highly crystalline cristobalite:\n3 Si3Al4O12 → 2 (3 Al2O3 + 2 SiO2) + 5 SiO2.\n\nNeedle mullite\n\nFinally, at 1400 °C the \"needle\" form of mullite appears, offering substantial increases in structural strength and heat resistance. This is a structural but not chemical transformation. See stoneware for more information on this form.\n\nOccurrence\n\nKaolinite is one of the most common minerals; it is mined, as kaolin, in Malaysia, Pakistan, Vietnam, Brazil, Bulgaria, France, United Kingdom, Iran, Germany, India, Australia, Korea, the People's Republic of China, the Czech Republic, Spain, South Africa, and the United States.\n\nMantles of kaolinitic saprolite are common in Western and Northern Europe. The ages of these mantles are Mesozoic to Early Cenozoic.   \n\nKaolinite clay occurs in abundance in soils that have formed from the chemical weathering of rocks in hot, moist climates—for example in tropical rainforest areas. Comparing soils along a gradient towards progressively cooler or drier climates, the proportion of kaolinite decreases, while the proportion of other clay minerals such as illite (in cooler climates) or smectite (in drier climates) increases. Such climatically-related differences in clay mineral content are often used to infer changes in climates in the geological past, where ancient soils have been buried and preserved. \n\nIn the Institut National pour l'Etude Agronomique au Congo Belge (INEAC) classification system, soils in which the clay fraction is predominantly kaolinite are called kaolisol (from kaolin and soil).\n\nIn the US, the main kaolin deposits are found in central Georgia, on a stretch of the Atlantic Seaboard fall line between Augusta and Macon. The deposits were formed between the late Cretaceous and early Paleogene, about 100 million to 45 million years ago, in sediments derived from weathered igneous and metakaolin rocks. Kaolin production in the US during 2011 was 5.5 million tonnes.\n\nDuring the Paleocene–Eocene Thermal Maximum sediments were enriched with kaolinite from a detrital source due to denudation.\n\nSynthesis and genesis\n\nDifficulties are encountered when trying to explain kaolinite formation under atmospheric conditions by extrapolation of thermodynamic data from the more successful high-temperature syntheses (as for example Meijer and Van der Plas, 1980Meijer, E. L. and Plas, L. van der (1980): Relative stabilities of soil minerals.  Mededelingen Landbouwhogeschool Wageningen, vol.80, no.16, 18 p. have pointed out).  La Iglesia and Van Oosterwijk-Gastuche (1978)Iglesia, A. La and Van Oosterwyck-Gastuche, M. C. (1978): Kaolinite synthesis. I. Crystallization conditions at low temperatures and calculation of thermodynamic equilibria. Application to laboratory and field observations.  Clays and Clay Minerals, vol.26, pp.397-408 thought that the conditions under which kaolinite will nucleate can be deduced from stability diagrams based as these are on dissolution data. Because of a lack of convincing results in their own experiments, La Iglesia and Van Oosterwijk-Gastuche (1978) had to conclude, however, that there were other, still unknown, factors involved in the low-temperature nucleation of kaolinite. Because of the observed very slow crystallization rates of kaolinite from solution at room temperature Fripiat and Herbillon (1971) postulated the existence of high activation energies in the low-temperature nucleation of kaolinite.\n\nAt high temperatures, equilibrium thermodynamic models appear to be satisfactory for the description of kaolinite dissolution and nucleation, because the thermal energy suffices to overcome the energy barriers involved in the nucleation process. The importance of syntheses at ambient temperature and atmospheric pressure towards the understanding of the mechanism involved in the nucleation of clay minerals lies in overcoming these energy barriers. As indicated by Caillère and Hénin (1962)Caillère, S. and Hénin, S. (1962): Vues ensemble sur le problème de la synthèse des minéraux phylliteux à basse température.  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.31-43. the processes involved will have to be studied in well-defined experiments, because it is virtually impossible to isolate the factors involved by mere deduction from complex natural physico-chemical systems such as the soil environment.\nFripiat and Herbillon (1971),Fripiat, J. J. and Herbillon, A. J. (1971): Formation and transformations of clay minerals in tropical soils.  pp.15-24, in: Soils and tropical weathering, Proceedings Bandung Symposium November 1969, Natural Resources Research, XI.  Unesco, Paris, 149 p. in a review on the formation of kaolinite, raised the fundamental question how a disordered material (i.e., the amorphous fraction of tropical soils) could ever be transformed into a corresponding ordered structure. This transformation seems to take place in soils without major changes in the environment, in a relatively short period of time and at ambient temperature (and pressure).\n\nLow-temperature synthesis of clay minerals (with kaolinite as an example) has several aspects. In the first place the silicic acid to be supplied to the growing crystal must be in a monomeric form, i.e., silica should be present in very dilute solution (Caillère et al., 1957;Caillère, S.; Hénin, S. and Esquevin, J. (1957): Synthèse des minéraux argileux. Étude des réactions du silicate de sodium et des cations. Bulletin du Groupe Français des Argiles, no.9. Caillère and Hénin, 1962; Wey and Siffert, 1962;Wey, R. and Siffert, B. (1961): Réactions de la silice monomoléculaire en solutions avec les ions Al3+ et Mg2+ .  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.11-23. Millot, 1970Millot, G. (1970): Geology of clays.  Springer Verlag, New York, 429 p.). In order to prevent the formation of amorphous silica gels precipitating from supersaturated solutions without reacting with the aluminium or magnesium cations to form crystalline silicates, the silicic acid must be present in concentrations below the maximum solubility of amorphous silica. The principle behind this prerequisite can be found in structural chemistry: “Since the polysilicate ions are not of uniform size, they cannot arrange themselves along with the metal ions into a regular crystal lattice” (Iler, 1955, p. 182Iler, R. K. (1955): The colloid chemistry of silica and silicates.  Cornell Univ. Press, Ithaca, N.Y., 324 p.).\n\nThe second aspect of the low-temperature synthesis of kaolinite is that the aluminium cations must be hexacoordinated with respect to oxygen (Caillère and Hénin, 1947;Caillère, S. and Hénin, S. (1947): Formation d’une phyllite du type kaolinique par traitement d’une montmorillonite.  Comptes Rendus des Séances de l’Académie des Sciences (Paris), vol.224, pp.53-55. Caillère et al., 1953;Caillère, S.; Hénin, S. and Esquevin, J. (1953): Recherches sur la synthèse des minéraux argileux.  Bulletin de la Societé Française de Minéralogie, vol.76, pp.300-314. Hénin and Robichet, 1955Hénin, S. and Robichet, O. (1954): Résultats obtenus au cours de nouveaux essais de synthèse des minéraux argileux.  Bulletin de la Groupe Française des Argiles, vol.6, pp.19-22.). Gastuche et al. (1962),Gastuche, M. C.; Fripiat, J. J. and DeKimpe, C. (1962): La genèse des minéraux argileux de la famille du kaolin. I. – Aspect colloidal.  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.57-65. as well as Caillère and Hénin (1962) have concluded, that only in those instances when the aluminium hydroxide is in the form of gibbsite, kaolinite can ever be formed. If not, the precipitate formed will be a “mixed alumino-silicic gel” (as Millot, 1970, p. 343 put it). If this would be the only requirement, large amounts of kaolinite could be harvested simply by adding gibbsite powder to a silica solution. Undoubtedly a marked degree of sorption of the silica in solution by the gibbsite surfaces will take place, but, as stated before, mere adsorption does not create the layer lattice typical of kaolinite crystals.\n\nThe third aspect is that these two initial components must be incorporated into one and the same mixed crystal with a layer structure. From the following equation (as given by Gastuche and DeKimpe, 1962)Gastuche, M. C. and DeKimpe, C. (1962): La genèse des minéraux argileux de la famille du kaolin. II. Aspect cristallin. Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.75-88. for kaolinite formation\n:  2 Al(OH)3  + 2  H4SiO4  →  Si2O5.2 Al(OH)3  +  5 H2O\nit can be seen, that five molecules of water must be removed from the reaction for every molecule of kaolinite formed. Field evidence illustrating the importance of the removal of water from the kaolinite reaction has been supplied by Gastuche and DeKimpe (1962). While studying soil formation on a basaltic rock in Kivu (Zaïre), Gastuche and DeKimpe noted how the occurrence of kaolinite depended on the \"degrée de drainage\" of the area involved. A clear distinction was found between areas with good drainage (i.e., areas with a marked difference between wet and dry seasons) and those areas with poor drainage (i.e., perennially swampy areas). Only in the areas with distinct seasonal alternations between wet and dry conditions kaolinite was found. The possible significance of alternating wet and dry conditions on the transition of allophane into kaolinite has been stressed by Tamura and Jackson (1953).Tamura, T. and Jackson, M. L. (1953): Structural and energy relationships in the formation of iron and aluminium oxides, hydroxides, and silicates.  Science, vol.117, pp.381-383. The role of alternations between wetting and drying on the formation of kaolinite has also been noted by Moore (1964).Moore, L. R. (1964): The in situ formation and development of some kaolinite macrocystals.  Clay Minerals Bulletin, vol.5, pp.338-351.\n\nLaboratory syntheses\n\nSyntheses of kaolinite at high temperatures (more than 100 C) are relatively well known. There are for example the syntheses of Van Nieuwenberg and Pieters (1928);Nieuwenburg, C. J. van and Pieters, H. A. J. (1929): Studies on hydrated aluminium silicates. I. The rehydration of metakaolin and the synthesis of kaolin.  Recueils des Travaux Chimiques de Pays-Bas, vol.48, pp.27-36. Noll (1934);Noll, W. (1934): Hydrothermale Synthese des Kaolins. Tschermaks Mineralogische und Petrographische Mitteilungen, vol.45, pp.175-190. Noll (1936);Noll, W. (1936): Über die Bildungsbedingungen von Kaolin, Montmorillonit, Sericit, Pyrophyllit und Analcim. Tschermaks Mineralogische und Petrographische Mitteilungen, vol.48, pp.210-247. Norton (1939);Norton, F. H. (1939): Hydrothermal formation of clay minerals in the laboratory.  American Mineralogist, vol.24, pp.1-17. Roy and Osborn (1954);Roy, R. and Osborn, E. F. (1954): The system alumina – silica – water.  American Mineralogist, vol.39, pp.853-885. Roy (1961);Roy, R. (1962): The preparation and properties of synthetic clay minerals.  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.83-98. Hawkins and Roy (1962);Hawkins, D. B and Roy, R. (1962): Electrolytic synthesis of kaolinite under hydrothermal conditions. Journal of the American Ceramic Society, vol.45, pp.507-508. Tomura et al. (1985);Tomura, S.; Shibasaki, Y.; Mizuta, H. and Kitamura, M. (1985): Growth conditions and genesis of spherical and platy kaolinite.  Clays and Clay Minerals, vol.33, pp.200-206. Satokawa et al. (1994)Satokawa, S.; Osaki, Y.; Samejima, S.; Miyawaki, R.; Tomura, S.; Shibasaki, Y. and Sugahara, Y. (1994): Effects of the structure of silica-alumina gel on the hydrothermal synthesis of kaolinite.  Clays and Clay Minerals, vol.42, pp.288-297. and Huertas et al. (1999).Huertas, F. J.; Fiore, S.; Huertas, F. and Linares, J. (1999): Experimental study of the hydrothermal formation of kaolinite.  Chemical Geology, vol.156, pp.171-190.\nRelatively few low-temperature syntheses have become known (cf. Brindley and DeKimpe (1961);Brindley, G. W. and DeKimpe, C. (1961): Attempted low-temperature syntheses of kaolin minerals.  Nature, vol.190, p.254. DeKimpe (1969);DeKimpe, C. R. (1969): Crystallization of kaolinite at low temperature from an alumina-silicic gel.  Clays and Clay Minerals, vol.17, pp.37-38. Bogatyrev et al. (1997)Bogatyrev, B. A.; Mateeva, L. A.; Zhukov, V. V. and Magazina, L. O. (1997): Low-temperature synthesis of kaolinite and halloysite on the gibbsite – silicic acid solution system.  Transactions (Doklady) of the Russian Academy of Sciences / Earth science sections, vol.353 A, pp.403-405.).\n\nLaboratory syntheses of kaolinite at room temperature and atmospheric pressure have been described by DeKimpe et al. (1961).DeKimpe, C. R.; Gastuche, M. C. and Brindley, G. W. (1961): Ionic coordination in alumino-silicic acids in relation to clay mineral formation.   American Mineralogist, vol.46, pp.1370-1381.  From those tests the role of periodicity becomes convincingly clear. For DeKimpe et al. (1961) had used daily additions of alumina (as AlCl3. 6 H2O) and silica (in the form of ethyl silicate) during at least two months. In addition adjustments of the pH took place every day by way of adding either hydrochloric acid or sodium hydroxide. Such daily additions of Si and Al to the solution in combination with the daily titrations with hydrochloric acid or sodium hydroxide during at least 60 days will have introduced the necessary element of periodicity. \nOnly now the actual role of what has been described as the “aging” (Alterung) of amorphous alumino-silicates (as for example Harder, 1978Harder, H. (1978): Synthesen von Tonmineralen unter spezieller Berücksichtigung festländischer Bedingungen. Schriftenreihe für geologische Wissenschaften (Berlin), vol.11, pp.51-78.  had noted) can be fully understood. For time as such is not bringing about any change in a closed system at equilibrium, but a series of alternations, of periodically changing conditions (by definition taking place in an open system), will bring about the low-temperature formation of more and more of the stable phase kaolinite instead of (ill-defined) amorphous alumino-silicates.\n\nUses\n\nThe main use of the mineral kaolinite (about 50% of the time) is the production of paper; its use ensures the gloss on some grades of coated paper.\n\nKaolin is also known for its capabilities to induce and accelerate blood clotting. In April 2008 the US Naval Medical Research Institute announced the successful use of a kaolinite-derived aluminosilicate infusion in traditional gauze, known commercially as QuikClot Combat Gauze, which is still the hemostat of choice for all branches of the US military.\n\nKaolin is used (or was used in the past):\n* in ceramics (it is the main component of porcelain)\n* in toothpaste\n* as a light diffusing material in white incandescent light bulbs\n* in cosmetics\n* in 'pre-work' skin protection and barrier creams \n* in paint to extend the titanium dioxide (TiO2) white pigment and modify gloss levels\n* for modifying the properties of rubber upon vulcanization\n* in adhesives to modify rheology\n* in organic farming as a spray applied to crops to deter insect damage, and in the case of apples, to prevent sun scald\n* as whitewash in traditional stone masonry homes in Nepal (the most common method is to paint the upper part with white kaolin clay and the middle with red clay; the red clay may extend to the bottom, or the bottom may be painted black)\n* as a filler in Edison Diamond Discs[http://www.gracyk.com/diamonddisc.shtml Edison Diamond Disc information]\n* as an indicator in radiological dating since kaolinite can contain very small traces of uranium and thorium\n* to soothe an upset stomach, similar to the way parrots (and later, humans) in South America originally used it (more recently, industrially-produced kaolinite preparations were common for treatment of diarrhea; the most common of these was kaopectate, which abandoned the use of kaolin in favor of attapulgite and then (in the United States) bismuth subsalicylate (the active ingredient in Pepto-Bismol))\n* for facial masks or soap ( known as \"White Clay\"), being especially useful in Ayurveda based herbal packs for Acne prone skin.[http://www.gennybeaute.com/2009/01/25/secrets-et-rituels-des-femmes-camerounaises/ \"Secrets et rituels des femmes camerounaises.\"] (Secrets and rituals of women in Cameroon) at Gennybeauté.com  Useful in Ayurveda based herbal packs for Acne prone skin.[http://www.holistichealthherbalist.com/white-kaolin-clay/][http://www.wildturmeric.net/2015/03/top-5-uses-benefits-of-kaolin-china-clay-for-skin-health-hair.html][http://essentialoils.co.za/face-pack.htm]\n* as adsorbents in water and wastewater treatment\n* to induce blood clotting in diagnostic procedures, e.g. Kaolin clotting time\n* In its altered metakaolin form, as a pozzolan; when added to a concrete mix, metakaolin accelerates the hydration of Portland cement and takes part in the pozzolanic reaction with the portlandite formed in the hydration of the main cement minerals (e.g. alite).\n* In its altered metakaolin form, as a base component for geopolymer compounds\n\nGeophagy\n\nKaolin is eaten for health or to suppress hunger,Franklin Kamtche. [http://www.quotidienlejour.com/double-page-/reportage/504-balengou-autour-des-mines \"Balengou : autour des mines.\"] (Balengou: around the mines) Le Jour. 12 January 2010.   a practice known as geophagy. Consumption is greater among women, especially during pregnancy.Gerald N. Callahan. [https://www.cdc.gov/ncidod/EID/vol9no8/03-0033.htm \"Eating Dirt.\"] Emerging Infectious Diseases. 9.8 (August 2003). This practice has also been observed within a small population of African-American women in the Southern United States, especially Georgia.R. Kevin Grigsby [http://www.georgiaencyclopedia.org/nge/Article.jsp?idh-2669 \"Clay Eating.\"] New Georgia Encyclopedia. 3 February 2004. There, the kaolin is called white dirt, chalk or white clay.\n\nSafety \n\nPeople can be exposed to kaolin in the workplace by breathing in the powder or from skin or eye contact.\n\nUnited States\n\nThe Occupational Safety and Health Administration (OSHA) has set the legal limit (permissible exposure limit) for kaolin exposure in the workplace as 15 mg/m3 total exposure and 5 mg/m3 respiratory exposure over an 8-hour workday. The National Institute for Occupational Safety and Health (NIOSH) has set a recommended exposure limit (REL) of 10 mg/m3 total exposure TWA 5 mg/m3 respiratory exposure over an 8-hour workday.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kaolinite" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16938" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kaolinite is a clay mineral, part of the group of industrial minerals, with the chemical composition Al2Si2O5(OH)4. It is a layered silicate mineral, with one tetrahedral sheet of silica (SiO4) linked through oxygen atoms to one octahedral sheet of alumina (AlO6) octahedra. Rocks that are rich in kaolinite are known as kaolin or china clay.\n\nThe name \"kaolin\" is derived from \"Gaoling\" (), a Chinese village near Jingdezhen in southeastern China's Jiangxi Province. The name entered English in 1727 from the French version of the word: kaolin, following Francois Xavier d'Entrecolles's reports from Jingdezhen.\n\nKaolinite has a low shrink–swell capacity and a low cation-exchange capacity (1–15 meq/100 g). It is a soft, earthy, usually white, mineral (dioctahedral phyllosilicate clay), produced by the chemical weathering of aluminium silicate minerals like feldspar. In many parts of the world it is colored pink-orange-red by iron oxide, giving it a distinct rust hue. Lighter concentrations yield white, yellow, or light orange colors. Alternating layers are sometimes found, as at Providence Canyon State Park in Georgia, United States. Commercial grades of kaolin are supplied and transported as dry powder, semi-dry noodle or as liquid slurry.\n\nChemistry\n\nNotation\n\nThe chemical formula for kaolinite as used in mineralogy is Al2Si2O5(OH)4, however, in ceramics applications the formula is typically written in terms of oxides, thus the formula for kaolinite is Al2O3·2SiO2·2H2O.Handbook of Inorganic Compounds, Dale L. Perry, Taylor & Francis, 2011, \n\nStructural transformations\n\nKaolinite group clays undergo a series of phase transformations upon thermal treatment in air at atmospheric pressure.\n\nDrying\n\nBelow 100 C, exposure to dry air will slowly remove liquid water from the kaolin. The end-state for this transformation is referred to as \"leather dry\". Between 100 °C and about 550 C, any remaining liquid water is expelled from kaolinite. The end state for this transformation is referred to as \"bone dry\". Throughout this temperature range, the expulsion of water is reversible: if the kaolin is exposed to liquid water, it will be reabsorbed and disintegrate into its fine particulate form. Subsequent transformations are not reversible, and represent permanent chemical changes.\nMetakaolin\n\nEndothermic dehydration of kaolinite begins at 550–600 °C producing disordered metakaolin, but continuous hydroxyl loss is observed up to 900 C. Although historically there was much disagreement concerning the nature of the metakaolin phase, extensive research has led to a general consensus that metakaolin is not a simple mixture of amorphous silica (SiO2) and alumina (Al2O3), but rather a complex amorphous structure that retains some longer-range order (but not strictly crystalline) due to stacking of its hexagonal layers. \nAl2Si2O5(OH)4 →  Al2Si2O7 + 2 H2O.\n\nSpinel\n\nFurther heating to 925–950 °C converts metakaolin to an aluminium-silicon spinel which is sometimes also referred to as a gamma-alumina type structure:\n2 Al2Si2O7 → Si3Al4O12 + SiO2.\n\nPlatelet mullite\n\nUpon calcination above 1050 °C, the spinel phase nucleates and transforms to platelet mullite and highly crystalline cristobalite:\n3 Si3Al4O12 → 2 (3 Al2O3 + 2 SiO2) + 5 SiO2.\n\nNeedle mullite\n\nFinally, at 1400 °C the \"needle\" form of mullite appears, offering substantial increases in structural strength and heat resistance. This is a structural but not chemical transformation. See stoneware for more information on this form.\n\nOccurrence\n\nKaolinite is one of the most common minerals; it is mined, as kaolin, in Malaysia, Pakistan, Vietnam, Brazil, Bulgaria, France, United Kingdom, Iran, Germany, India, Australia, Korea, the People's Republic of China, the Czech Republic, Spain, South Africa, and the United States.\n\nMantles of kaolinitic saprolite are common in Western and Northern Europe. The ages of these mantles are Mesozoic to Early Cenozoic.   \n\nKaolinite clay occurs in abundance in soils that have formed from the chemical weathering of rocks in hot, moist climates—for example in tropical rainforest areas. Comparing soils along a gradient towards progressively cooler or drier climates, the proportion of kaolinite decreases, while the proportion of other clay minerals such as illite (in cooler climates) or smectite (in drier climates) increases. Such climatically-related differences in clay mineral content are often used to infer changes in climates in the geological past, where ancient soils have been buried and preserved. \n\nIn the Institut National pour l'Etude Agronomique au Congo Belge (INEAC) classification system, soils in which the clay fraction is predominantly kaolinite are called kaolisol (from kaolin and soil).\n\nIn the US, the main kaolin deposits are found in central Georgia, on a stretch of the Atlantic Seaboard fall line between Augusta and Macon. The deposits were formed between the late Cretaceous and early Paleogene, about 100 million to 45 million years ago, in sediments derived from weathered igneous and metakaolin rocks. Kaolin production in the US during 2011 was 5.5 million tonnes.\n\nDuring the Paleocene–Eocene Thermal Maximum sediments were enriched with kaolinite from a detrital source due to denudation.\n\nSynthesis and genesis\n\nDifficulties are encountered when trying to explain kaolinite formation under atmospheric conditions by extrapolation of thermodynamic data from the more successful high-temperature syntheses (as for example Meijer and Van der Plas, 1980Meijer, E. L. and Plas, L. van der (1980): Relative stabilities of soil minerals.  Mededelingen Landbouwhogeschool Wageningen, vol.80, no.16, 18 p. have pointed out).  La Iglesia and Van Oosterwijk-Gastuche (1978)Iglesia, A. La and Van Oosterwyck-Gastuche, M. C. (1978): Kaolinite synthesis. I. Crystallization conditions at low temperatures and calculation of thermodynamic equilibria. Application to laboratory and field observations.  Clays and Clay Minerals, vol.26, pp.397-408 thought that the conditions under which kaolinite will nucleate can be deduced from stability diagrams based as these are on dissolution data. Because of a lack of convincing results in their own experiments, La Iglesia and Van Oosterwijk-Gastuche (1978) had to conclude, however, that there were other, still unknown, factors involved in the low-temperature nucleation of kaolinite. Because of the observed very slow crystallization rates of kaolinite from solution at room temperature Fripiat and Herbillon (1971) postulated the existence of high activation energies in the low-temperature nucleation of kaolinite.\n\nAt high temperatures, equilibrium thermodynamic models appear to be satisfactory for the description of kaolinite dissolution and nucleation, because the thermal energy suffices to overcome the energy barriers involved in the nucleation process. The importance of syntheses at ambient temperature and atmospheric pressure towards the understanding of the mechanism involved in the nucleation of clay minerals lies in overcoming these energy barriers. As indicated by Caillère and Hénin (1962)Caillère, S. and Hénin, S. (1962): Vues ensemble sur le problème de la synthèse des minéraux phylliteux à basse température.  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.31-43. the processes involved will have to be studied in well-defined experiments, because it is virtually impossible to isolate the factors involved by mere deduction from complex natural physico-chemical systems such as the soil environment.\nFripiat and Herbillon (1971),Fripiat, J. J. and Herbillon, A. J. (1971): Formation and transformations of clay minerals in tropical soils.  pp.15-24, in: Soils and tropical weathering, Proceedings Bandung Symposium November 1969, Natural Resources Research, XI.  Unesco, Paris, 149 p. in a review on the formation of kaolinite, raised the fundamental question how a disordered material (i.e., the amorphous fraction of tropical soils) could ever be transformed into a corresponding ordered structure. This transformation seems to take place in soils without major changes in the environment, in a relatively short period of time and at ambient temperature (and pressure).\n\nLow-temperature synthesis of clay minerals (with kaolinite as an example) has several aspects. In the first place the silicic acid to be supplied to the growing crystal must be in a monomeric form, i.e., silica should be present in very dilute solution (Caillère et al., 1957;Caillère, S.; Hénin, S. and Esquevin, J. (1957): Synthèse des minéraux argileux. Étude des réactions du silicate de sodium et des cations. Bulletin du Groupe Français des Argiles, no.9. Caillère and Hénin, 1962; Wey and Siffert, 1962;Wey, R. and Siffert, B. (1961): Réactions de la silice monomoléculaire en solutions avec les ions Al3+ et Mg2+ .  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.11-23. Millot, 1970Millot, G. (1970): Geology of clays.  Springer Verlag, New York, 429 p.). In order to prevent the formation of amorphous silica gels precipitating from supersaturated solutions without reacting with the aluminium or magnesium cations to form crystalline silicates, the silicic acid must be present in concentrations below the maximum solubility of amorphous silica. The principle behind this prerequisite can be found in structural chemistry: “Since the polysilicate ions are not of uniform size, they cannot arrange themselves along with the metal ions into a regular crystal lattice” (Iler, 1955, p. 182Iler, R. K. (1955): The colloid chemistry of silica and silicates.  Cornell Univ. Press, Ithaca, N.Y., 324 p.).\n\nThe second aspect of the low-temperature synthesis of kaolinite is that the aluminium cations must be hexacoordinated with respect to oxygen (Caillère and Hénin, 1947;Caillère, S. and Hénin, S. (1947): Formation d’une phyllite du type kaolinique par traitement d’une montmorillonite.  Comptes Rendus des Séances de l’Académie des Sciences (Paris), vol.224, pp.53-55. Caillère et al., 1953;Caillère, S.; Hénin, S. and Esquevin, J. (1953): Recherches sur la synthèse des minéraux argileux.  Bulletin de la Societé Française de Minéralogie, vol.76, pp.300-314. Hénin and Robichet, 1955Hénin, S. and Robichet, O. (1954): Résultats obtenus au cours de nouveaux essais de synthèse des minéraux argileux.  Bulletin de la Groupe Française des Argiles, vol.6, pp.19-22.). Gastuche et al. (1962),Gastuche, M. C.; Fripiat, J. J. and DeKimpe, C. (1962): La genèse des minéraux argileux de la famille du kaolin. I. – Aspect colloidal.  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.57-65. as well as Caillère and Hénin (1962) have concluded, that only in those instances when the aluminium hydroxide is in the form of gibbsite, kaolinite can ever be formed. If not, the precipitate formed will be a “mixed alumino-silicic gel” (as Millot, 1970, p. 343 put it). If this would be the only requirement, large amounts of kaolinite could be harvested simply by adding gibbsite powder to a silica solution. Undoubtedly a marked degree of sorption of the silica in solution by the gibbsite surfaces will take place, but, as stated before, mere adsorption does not create the layer lattice typical of kaolinite crystals.\n\nThe third aspect is that these two initial components must be incorporated into one and the same mixed crystal with a layer structure. From the following equation (as given by Gastuche and DeKimpe, 1962)Gastuche, M. C. and DeKimpe, C. (1962): La genèse des minéraux argileux de la famille du kaolin. II. Aspect cristallin. Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.75-88. for kaolinite formation\n:  2 Al(OH)3  + 2  H4SiO4  →  Si2O5.2 Al(OH)3  +  5 H2O\nit can be seen, that five molecules of water must be removed from the reaction for every molecule of kaolinite formed. Field evidence illustrating the importance of the removal of water from the kaolinite reaction has been supplied by Gastuche and DeKimpe (1962). While studying soil formation on a basaltic rock in Kivu (Zaïre), Gastuche and DeKimpe noted how the occurrence of kaolinite depended on the \"degrée de drainage\" of the area involved. A clear distinction was found between areas with good drainage (i.e., areas with a marked difference between wet and dry seasons) and those areas with poor drainage (i.e., perennially swampy areas). Only in the areas with distinct seasonal alternations between wet and dry conditions kaolinite was found. The possible significance of alternating wet and dry conditions on the transition of allophane into kaolinite has been stressed by Tamura and Jackson (1953).Tamura, T. and Jackson, M. L. (1953): Structural and energy relationships in the formation of iron and aluminium oxides, hydroxides, and silicates.  Science, vol.117, pp.381-383. The role of alternations between wetting and drying on the formation of kaolinite has also been noted by Moore (1964).Moore, L. R. (1964): The in situ formation and development of some kaolinite macrocystals.  Clay Minerals Bulletin, vol.5, pp.338-351.\n\nLaboratory syntheses\n\nSyntheses of kaolinite at high temperatures (more than 100 C) are relatively well known. There are for example the syntheses of Van Nieuwenberg and Pieters (1928);Nieuwenburg, C. J. van and Pieters, H. A. J. (1929): Studies on hydrated aluminium silicates. I. The rehydration of metakaolin and the synthesis of kaolin.  Recueils des Travaux Chimiques de Pays-Bas, vol.48, pp.27-36. Noll (1934);Noll, W. (1934): Hydrothermale Synthese des Kaolins. Tschermaks Mineralogische und Petrographische Mitteilungen, vol.45, pp.175-190. Noll (1936);Noll, W. (1936): Über die Bildungsbedingungen von Kaolin, Montmorillonit, Sericit, Pyrophyllit und Analcim. Tschermaks Mineralogische und Petrographische Mitteilungen, vol.48, pp.210-247. Norton (1939);Norton, F. H. (1939): Hydrothermal formation of clay minerals in the laboratory.  American Mineralogist, vol.24, pp.1-17. Roy and Osborn (1954);Roy, R. and Osborn, E. F. (1954): The system alumina – silica – water.  American Mineralogist, vol.39, pp.853-885. Roy (1961);Roy, R. (1962): The preparation and properties of synthetic clay minerals.  Colloques Internationaux No.105, Centre National des Recherches Scientifiques, pp.83-98. Hawkins and Roy (1962);Hawkins, D. B and Roy, R. (1962): Electrolytic synthesis of kaolinite under hydrothermal conditions. Journal of the American Ceramic Society, vol.45, pp.507-508. Tomura et al. (1985);Tomura, S.; Shibasaki, Y.; Mizuta, H. and Kitamura, M. (1985): Growth conditions and genesis of spherical and platy kaolinite.  Clays and Clay Minerals, vol.33, pp.200-206. Satokawa et al. (1994)Satokawa, S.; Osaki, Y.; Samejima, S.; Miyawaki, R.; Tomura, S.; Shibasaki, Y. and Sugahara, Y. (1994): Effects of the structure of silica-alumina gel on the hydrothermal synthesis of kaolinite.  Clays and Clay Minerals, vol.42, pp.288-297. and Huertas et al. (1999).Huertas, F. J.; Fiore, S.; Huertas, F. and Linares, J. (1999): Experimental study of the hydrothermal formation of kaolinite.  Chemical Geology, vol.156, pp.171-190.\nRelatively few low-temperature syntheses have become known (cf. Brindley and DeKimpe (1961);Brindley, G. W. and DeKimpe, C. (1961): Attempted low-temperature syntheses of kaolin minerals.  Nature, vol.190, p.254. DeKimpe (1969);DeKimpe, C. R. (1969): Crystallization of kaolinite at low temperature from an alumina-silicic gel.  Clays and Clay Minerals, vol.17, pp.37-38. Bogatyrev et al. (1997)Bogatyrev, B. A.; Mateeva, L. A.; Zhukov, V. V. and Magazina, L. O. (1997): Low-temperature synthesis of kaolinite and halloysite on the gibbsite – silicic acid solution system.  Transactions (Doklady) of the Russian Academy of Sciences / Earth science sections, vol.353 A, pp.403-405.).\n\nLaboratory syntheses of kaolinite at room temperature and atmospheric pressure have been described by DeKimpe et al. (1961).DeKimpe, C. R.; Gastuche, M. C. and Brindley, G. W. (1961): Ionic coordination in alumino-silicic acids in relation to clay mineral formation.   American Mineralogist, vol.46, pp.1370-1381.  From those tests the role of periodicity becomes convincingly clear. For DeKimpe et al. (1961) had used daily additions of alumina (as AlCl3. 6 H2O) and silica (in the form of ethyl silicate) during at least two months. In addition adjustments of the pH took place every day by way of adding either hydrochloric acid or sodium hydroxide. Such daily additions of Si and Al to the solution in combination with the daily titrations with hydrochloric acid or sodium hydroxide during at least 60 days will have introduced the necessary element of periodicity. \nOnly now the actual role of what has been described as the “aging” (Alterung) of amorphous alumino-silicates (as for example Harder, 1978Harder, H. (1978): Synthesen von Tonmineralen unter spezieller Berücksichtigung festländischer Bedingungen. Schriftenreihe für geologische Wissenschaften (Berlin), vol.11, pp.51-78.  had noted) can be fully understood. For time as such is not bringing about any change in a closed system at equilibrium, but a series of alternations, of periodically changing conditions (by definition taking place in an open system), will bring about the low-temperature formation of more and more of the stable phase kaolinite instead of (ill-defined) amorphous alumino-silicates.\n\nUses\n\nThe main use of the mineral kaolinite (about 50% of the time) is the production of paper; its use ensures the gloss on some grades of coated paper.\n\nKaolin is also known for its capabilities to induce and accelerate blood clotting. In April 2008 the US Naval Medical Research Institute announced the successful use of a kaolinite-derived aluminosilicate infusion in traditional gauze, known commercially as QuikClot Combat Gauze, which is still the hemostat of choice for all branches of the US military.\n\nKaolin is used (or was used in the past):\n* in ceramics (it is the main component of porcelain)\n* in toothpaste\n* as a light diffusing material in white incandescent light bulbs\n* in cosmetics\n* in 'pre-work' skin protection and barrier creams \n* in paint to extend the titanium dioxide (TiO2) white pigment and modify gloss levels\n* for modifying the properties of rubber upon vulcanization\n* in adhesives to modify rheology\n* in organic farming as a spray applied to crops to deter insect damage, and in the case of apples, to prevent sun scald\n* as whitewash in traditional stone masonry homes in Nepal (the most common method is to paint the upper part with white kaolin clay and the middle with red clay; the red clay may extend to the bottom, or the bottom may be painted black)\n* as a filler in Edison Diamond Discs[http://www.gracyk.com/diamonddisc.shtml Edison Diamond Disc information]\n* as an indicator in radiological dating since kaolinite can contain very small traces of uranium and thorium\n* to soothe an upset stomach, similar to the way parrots (and later, humans) in South America originally used it (more recently, industrially-produced kaolinite preparations were common for treatment of diarrhea; the most common of these was kaopectate, which abandoned the use of kaolin in favor of attapulgite and then (in the United States) bismuth subsalicylate (the active ingredient in Pepto-Bismol))\n* for facial masks or soap ( known as \"White Clay\"), being especially useful in Ayurveda based herbal packs for Acne prone skin.[http://www.gennybeaute.com/2009/01/25/secrets-et-rituels-des-femmes-camerounaises/ \"Secrets et rituels des femmes camerounaises.\"] (Secrets and rituals of women in Cameroon) at Gennybeauté.com  Useful in Ayurveda based herbal packs for Acne prone skin.[http://www.holistichealthherbalist.com/white-kaolin-clay/][http://www.wildturmeric.net/2015/03/top-5-uses-benefits-of-kaolin-china-clay-for-skin-health-hair.html][http://essentialoils.co.za/face-pack.htm]\n* as adsorbents in water and wastewater treatment\n* to induce blood clotting in diagnostic procedures, e.g. Kaolin clotting time\n* In its altered metakaolin form, as a pozzolan; when added to a concrete mix, metakaolin accelerates the hydration of Portland cement and takes part in the pozzolanic reaction with the portlandite formed in the hydration of the main cement minerals (e.g. alite).\n* In its altered metakaolin form, as a base component for geopolymer compounds\n\nGeophagy\n\nKaolin is eaten for health or to suppress hunger,Franklin Kamtche. [http://www.quotidienlejour.com/double-page-/reportage/504-balengou-autour-des-mines \"Balengou : autour des mines.\"] (Balengou: around the mines) Le Jour. 12 January 2010.   a practice known as geophagy. Consumption is greater among women, especially during pregnancy.Gerald N. Callahan. [https://www.cdc.gov/ncidod/EID/vol9no8/03-0033.htm \"Eating Dirt.\"] Emerging Infectious Diseases. 9.8 (August 2003). This practice has also been observed within a small population of African-American women in the Southern United States, especially Georgia.R. Kevin Grigsby [http://www.georgiaencyclopedia.org/nge/Article.jsp?idh-2669 \"Clay Eating.\"] New Georgia Encyclopedia. 3 February 2004. There, the kaolin is called white dirt, chalk or white clay.\n\nSafety \n\nPeople can be exposed to kaolin in the workplace by breathing in the powder or from skin or eye contact.\n\nUnited States\n\nThe Occupational Safety and Health Administration (OSHA) has set the legal limit (permissible exposure limit) for kaolin exposure in the workplace as 15 mg/m3 total exposure and 5 mg/m3 respiratory exposure over an 8-hour workday. The National Institute for Occupational Safety and Health (NIOSH) has set a recommended exposure limit (REL) of 10 mg/m3 total exposure TWA 5 mg/m3 respiratory exposure over an 8-hour workday. Kaolinite. http://en.wikipedia.org/?curid=16938."
  }
}
