{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19348",
  "eid" : "3a0ce4e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606638,
  "textBody" : "Events\n\n* 475 BC  – Roman consul Publius Valerius Poplicola celebrates a Roman triumph for his victory over Veii and the Sabines. \n* 305 – Diocletian and Maximian retire from the office of Roman emperor.\n* 524 – King Sigismund of Burgundy is executed at Orléans after an 8-year reign and is succeeded by his brother Godomar.\n* 880 – The Nea Ekklesia is inaugurated in Constantinople, setting the model for all later cross-in-square Orthodox churches.\n*1169 – Norman mercenaries land at Bannow Bay in Leinster, marking the beginning of the Norman invasion of Ireland.\n*1328 – Wars of Scottish Independence end: By the Treaty of Edinburgh–Northampton the Kingdom of England recognises the Kingdom of Scotland as an independent state.\n*1455 – Battle of Arkinholm, Royal forces end the Black Douglas hegemony in Scotland.\n*1576 – Stephen Báthory, the reigning Prince of Transylvania, marries Anna Jagiellon and they become co-rulers of the Polish–Lithuanian Commonwealth.\n*1707 – The Act of Union joins the Kingdom of England and Kingdom of Scotland to form the Kingdom of Great Britain.\n*1753 – Publication of Species Plantarum by Linnaeus, and the formal start date of plant taxonomy adopted by the International Code of Botanical Nomenclature.\n*1759 – Josiah Wedgwood founds the Wedgwood pottery company in Great Britain.\n*1776 – Establishment of the Illuminati in Ingolstadt (Upper Bavaria), by Jesuit-taught Adam Weishaupt.\n*1778 – American Revolution: The Battle of Crooked Billet begins in Hatboro, Pennsylvania.\n*1785 – Kamehameha I, the king of Hawaii, defeats Kalanikūpule and establishes the Kingdom of Hawaii.\n*1786 – In Vienna, Austria, Mozart's opera The Marriage of Figaro is performed for the first time.\n*1794 – War of the Pyrenees: The Battle of Boulou ends, in which French forces defeat the Spanish and regain nearly all the land they lost to Spain in 1793.\n*1820 – Execution of the Cato Street Conspirators\n*1840 – The Penny Black, the first official adhesive postage stamp, is issued in the United Kingdom.\n*1844 – Hong Kong Police Force, the world's second modern police force and Asia's first, is established.\n*1846 – The few remaining Mormons left in Nauvoo, Illinois, formally dedicate the Nauvoo Temple.\n*1851 – Queen Victoria opens The Great Exhibition at The Crystal Palace in London.\n*1856 – The Province of Isabela was created in the Philippines in honor of Queen Isabela II.\n*1862 – American Civil War: The Union Army completes its capture of New Orleans.\n*1863 – American Civil War: The Battle of Chancellorsville begins.\n*1865 – The Empire of Brazil, Argentina, and Uruguay sign the Treaty of the Triple Alliance.\n*1866 – The Memphis Race Riots begin. In three days time, 46 blacks and two whites were killed. Reports of the atrocities influenced passage of the Fourteenth Amendment to the United States Constitution.\n*1869 – The Folies Bergère opens in Paris.\n*1875 – Alexandra Palace reopens after being burned down in a fire in 1873.\n*1884 – Proclamation of the demand for eight-hour workday in the United States.\n*  1884   – Moses Fleetwood Walker becomes the first black person to play in a professional baseball game in the United States.\n*1885 – The original Chicago Board of Trade Building opens for business.\n*1886 – Rallies are held throughout the United States demanding the eight-hour work day, culminating in the Haymarket affair in Chicago, in commemoration of which May 1 is celebrated as International Workers' Day in many countries.\n*1893 – The World's Columbian Exposition opens in Chicago.\n*1894 – Coxey's Army, the first significant American protest march, arrives in Washington, D.C.\n*1898 – Spanish–American War: Battle of Manila Bay: The United States Navy destroys the Spanish Pacific fleet in the first major battle of the war.\n*1900 – The Scofield Mine disaster kills over 200 men in Scofield, Utah in what is to date the fifth-worst mining accident in United States history.\n*1915 – The  departs from New York City on her 202nd, and final, crossing of the North Atlantic. Six days later, the ship is torpedoed off the coast of Ireland with the loss of 1,198 lives.\n*1919 – German troops enter Munich to squash the Bavarian Soviet Republic.\n*1925 – The All-China Federation of Trade Unions is officially founded. Today it is the largest trade union in the world, with 134 million members.\n*1927 – The Union Labor Life Insurance Company is founded by the American Federation of Labor.\n*1929 – The 7.2  Kopet Dag earthquake shakes the Iran–Turkmenistan border region with a maximum Mercalli intensity of IX (Violent), killing up to 3,800 and injuring 1,121.\n*1930 – The dwarf planet Pluto is officially named.\n*1931 – The Empire State Building is dedicated in New York City.\n*1941 – World War II: German forces launch a major attack on Tobruk.\n*1944 – World War II: Two hundred Communist prisoners are shot by the Germans at Kaisariani, Athens in reprisal for the killing of General Franz Krech by partisans at Molaoi.\n*1945 – World War II: A German newsreader officially announces that Adolf Hitler has \"fallen at his command post in the Reich Chancellery fighting to the last breath against Bolshevism and for Germany\". The Soviet flag is raised over the Reich Chancellery, by order of Stalin.\n*  1945   – World War II: Nazi propaganda minister Joseph Goebbels and his wife Magda commit suicide in the Reich Garden outside the Führerbunker. Their children are also killed by having cyanide pills inserted into their mouths by their mother, Magda.\n*  1945   – World War II: Forces of the Soviet Red Army liberate Allied prisoners of war imprisoned at Stalag Luft I near Barth, Germany.\n*  1945   – World War II: Up to 2,500 people die in a mass suicide in Demmin following the advance of the Red Army.\n*  1945   – World War II: Yugoslav Partisans liberate Trieste.\n*1946 – Start of three-year Pilbara strike of Indigenous Australians.\n*  1946   – The Paris Peace Conference concludes that the islands of the Dodecanese should be returned to Greece by Italy.\n*1947 – Portella della Ginestra massacre against May Day celebrations in Sicily by the bandit and separatist leader Salvatore Giuliano where 11 persons are killed and 33 wounded.\n*1950 – Guam is organized as a United States commonwealth.\n*1956 – The polio vaccine developed by Jonas Salk is made available to the public.\n*  1956   – A doctor in Japan reports an \"epidemic of an unknown disease of the central nervous system\", marking the official discovery of Minamata disease.\n*1957 – Thirty-four people are killed when a Vickers Viking airliner crashes in Hampshire, England.\n*1960 – Formation of the western Indian states of Gujarat and Maharashtra; also known as \"Maharashtra Day\".\n*  1960   – Cold War: U-2 incident: Francis Gary Powers, in a Lockheed U-2 spyplane, is shot down over the Sverdlovsk Oblast, Soviet Union, sparking a diplomatic crisis.\n*1961 – The Prime Minister of Cuba, Fidel Castro, proclaims Cuba a socialist nation and abolishes elections.\n*1965 – Battle of Dong-Yin, a naval conflict between ROC and PRC, takes place.\n*1970 – Protests erupt following the announcement by Richard Nixon that American and South Vietnamese forces would attack Vietnamese communists in a Cambodian Campaign.\n*1971 – Amtrak (the National Railroad Passenger Corporation) takes over operation of U.S. passenger rail service.\n*1974 – The Argentine terrorist organization Montoneros is expelled from Plaza de Mayo by president Juan Perón.\n*1977 – Thirty-six people are killed in Taksim Square, Istanbul, during the Labour Day celebrations.\n*1978 – Japan's Naomi Uemura, travelling by dog sled, becomes the first person to reach the North Pole alone.\n*1982 – Operation Black Buck: The Royal Air Force attacks the Argentine Air Force during Falklands War.\n*1983 – The Sydney Entertainment Centre is opened.\n*1987 – Pope John Paul II beatifies Edith Stein, a Jewish-born Carmelite nun who was gassed in the Nazi concentration camp at Auschwitz.\n*1989 – Disney-MGM Studios opens at Walt Disney World near Orlando, Florida, United States.\n*1990 – The former Philippine Episcopal Church (supervised by the Episcopal Church of the United States of America) is granted full autonomy and raised to the status of an Autocephalous Anglican Province and renamed the Episcopal Church in the Philippines.\n*1993 – Dingiri Banda Wijetunga became president of Sri Lanka automatically after killing of R Premadasa in LTTE bomb explosion\n*1994 – Three-time Formula One world champion Ayrton Senna is killed in an accident whilst leading the San Marino Grand Prix at Imola.\n*1995 – Croatian War of Independence: Croatian forces launch Operation Flash.\n*1999 – The body of British climber George Mallory is found on Mount Everest, 75 years after his disappearance in 1924.\n*  1999   – SpongeBob SquarePants premieres on Nickelodeon after the 1999 Kids' Choice Awards.\n*2001 – Philippine President Gloria Macapagal Arroyo declares the existence of \"a state of rebellion\", hours after thousands of supporters of her arrested predecessor, Joseph Estrada, storm towards the presidential palace at the height of the EDSA III rebellion.\n*2002 – OpenOffice.org released version 1.0, the first stable version of the software.\n*2003 – Invasion of Iraq: In what becomes known as the \"Mission Accomplished\" speech, on board the  (off the coast of California), U.S. President George W. Bush declares that \"major combat operations in Iraq have ended\".\n*2004 – Cyprus, Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia join the European Union, celebrated at the residence of the Irish President in Dublin.\n*2009 – Same-sex marriage is legalized in Sweden.\n*2011 – War on Terror: Al-Qaeda leader Osama bin Laden is shot and killed by U.S. Navy seals.\n*2011 – Pope John Paul II is beatified by his successor, Pope Benedict XVI.\n\nBirths\n\n*1218 – John I, Count of Hainaut (d. 1257)\n*  1218   – Rudolf I of Germany (d. 1291)\n*1225 – Jean de Joinville, French historian and author (d. 1317)\n*1238 – Magnus Lagabøte, king of Norway (d. 1280)\n*1285 – Edmund FitzAlan, 9th Earl of Arundel, English politician (d. 1326)\n*1326 – Rinchinbal Khan, Mongolian emperor (d. 1332)\n*1488 – Sidonie of Bavaria, eldest daughter of Duke Albrecht IV of Bavaria-Munich (d. 1505)\n*1527 – Johannes Stadius, German astronomer, astrologer, mathematician (d. 1579)\n*1545 – Franciscus Junius, French theologian (d. 1602)\n*1579 – Wolphert Gerretse, Dutch-American farmer, co-founded New Netherland (d. 1662)\n*1582 – Marco da Gagliano, Italian composer (d. 1643)\n*1585 – Sophia Olelkovich Radziwill, Belarusian saint (d. 1612)\n*1591 – Johann Adam Schall von Bell, German missionary and astronomer (d. 1666)\n*1594 – John Haynes, English-American politician, 1st Governor of the Colony of Connecticut (d. 1653)\n*1602 – William Lilly, English astrologer (d. 1681)\n*1672 – Joseph Addison, English essayist, poet, playwright, and politician (d. 1719)\n*1730 – Joshua Rowley, English admiral (d. 1790)\n*1735 – Jan Hendrik van Kinsbergen, Dutch admiral and philanthropist (d. 1819)\n*1751 – Judith Sargent Murray, American poet and playwright (d. 1820)\n*1764 – Benjamin Henry Latrobe, English-American architect, designed the United States Capitol (d. 1820)\n*1769 – Arthur Wellesley, 1st Duke of Wellington, Irish-English field marshal and politician, Prime Minister of the United Kingdom (d. 1852)\n*1803 – James Clarence Mangan, Irish poet and author (d. 1849)\n*1821 – Henry Ayers, English-Australian politician, 8th Premier of South Australia (d. 1897)\n*1824 – Alexander William Williamson, English chemist and academic (d. 1904)\n*1825 – Johann Jakob Balmer, Swiss mathematician and physicist (d. 1898)\n*  1825   – George Inness, American painter and educator (d. 1894)\n*1827 – Jules Breton, French painter (d. 1906)\n*1829 – José de Alencar, Brazilian author and playwright (d. 1877)\n*  1829   – Frederick Sandys, English painter and illustrator (d. 1904)\n*1830 – Guido Gezelle, Belgian priest and poet (d. 1899)\n*1831 – Emily Stowe, Canadian physician and activist (d. 1903)\n*1847 – Henry Demarest Lloyd, American journalist and politician (d. 1903)\n*1848 – Adelsteen Normann, Norwegian painter (d. 1919)\n*1850 – Prince Arthur, Duke of Connaught and Strathearn (d. 1942)\n*1851 – Laza Lazarević, Serbian psychiatrist and neurologist (d. 1891)\n*1852 – Calamity Jane, American frontierswoman and professional scout (d. 1903)\n*  1852   – Santiago Ramón y Cajal, Spanish neuroscientist and pathologist, Nobel Prize laureate (d. 1934)\n*1853 – Jacob Mikhailovich Gordin, Jewish Ukrainian-American journalist, actor, and playwright (d. 1909)\n*1855 – Cecilia Beaux, American painter and academic (d. 1942)\n*1857 – Theo van Gogh, Dutch art dealer (d. 1891)\n*1859 – Jacqueline Comerre-Paton, French painter and sculptor (d. 1955)\n*1862 – Marcel Prévost, French novelist and playwright (d. 1941)\n*1864 – Anna Jarvis, American founder of Mother's Day (d. 1948)\n*1871 – Seakle Greijdanus, Dutch theologian and scholar (d. 1948)\n*  1871   – Emiliano Chamorro Vargas, President of Nicaragua (d. 1966)\n*1872 – Hugo Alfvén, Swedish composer, conductor, violinist, and painter (d. 1960)\n*  1872   – Sidónio Pais, Portuguese soldier and politician, 4th President of Portugal (d. 1918)\n*1874 – Romaine Brooks, American-French painter and illustrator (d. 1970)\n*  1874   – Paul Van Asbroeck, Belgian target shooter (d. 1959)\n*1875 – Dave Hall, American runner (d. 1972)\n*1881 – Pierre Teilhard de Chardin, French priest, palaeontologist, and philosopher (d. 1955)\n*1884 – Francis Curzon, 5th Earl Howe, English race car driver and politician (d. 1964)\n*1885 – Clément Pansaers, Belgian poet (d. 1922)\n*  1885   – Ralph Stackpole, American sculptor and painter (d. 1973)\n*1887 – Alan Cunningham, Anglo-Irish general and diplomat, High Commissioners for Palestine and Transjordan (d. 1983)\n*1891 – Lillian Estelle Fisher, American historian of Spanish  America (d. 1988)\n*1895 – Nikolai Yezhov, Soviet secret police official, head of the NKVD (d. 1940)\n*1896 – Herbert Backe, German agronomist and politician (d. 1947)\n*  1896   – Mark W. Clark, American general (d. 1984)\n*  1896   – J. Lawton Collins, American general (d. 1987)\n*1898 – Alfred Schmidt, Estonian weightlifter (d. 1972)\n*1900 – Ignazio Silone, Italian journalist and politician (d. 1978)\n*  1900   – Aleksander Wat, Polish poet and writer (d. 1967)\n*1901 – Sterling Allen Brown, American poet, academic, and critic (d. 1989)\n*  1901   – Heinz Eric Roemheld, American pianist, composer, and conductor (d. 1985)\n*  1901   – Antal Szerb, Hungarian scholar and author (d. 1945)\n*1905 – Henry Koster, German-American director, producer, and screenwriter (d. 1988)\n*1906 – Horst Schumann, German SS officer and physician (d. 1983)\n*1907 – Hayes Alvis, American bassist (d. 1972)\n*  1907   – Kate Smith, American singer and actress (d. 1986)\n*1908 – Giovannino Guareschi, Italian journalist and author (d. 1968)\n*  1908   – Morris Kline, American mathematician and academic (d. 1992)\n*1909 – Endel Puusepp, Estonian-Soviet military pilot and politician (d. 1996)\n*  1909   – Yiannis Ritsos, Greek poet and playwright (d. 1990) \n*1910 – Behice Boran, Turkish sociologist and politician (d. 1987)\n*  1910   – Raya Dunayevskaya, Ukrainian-American philosopher and activist (d. 1987)\n*  1910   – Dirk Andries Flentrop, Dutch organ builder (d. 2003)\n*  1910   – J. Allen Hynek, American astronomer and ufologist (d. 1986)\n*  1910   – Nejdet Sançar, Turkish literature teacher (d. 1975)\n*1911 – Wilfred Watson, English-Canadian poet, playwright and educator (d. 1998)\n*1912 – Otto Kretschmer, Polish-German admiral (d. 1998)\n*1913 – Louis Nye, American actor (d. 2005)\n*  1913   – Walter Susskind, Czech-English pianist, conductor, and educator (d. 1980)\n*1914 – Jaap van der Poll, Dutch javelin thrower (d. 2010)\n*1915 – Hanns Martin Schleyer, German businessman (d. 1977)\n*1916 – Antoni Bazaniak, Polish sprint canoeist (d. 1979)\n*  1916   – Glenn Ford, Canadian-American actor and producer (d. 2006)\n*1917 – John Beradino, American baseball player and actor (d. 1996)\n*  1917   – Ulric Cross, Trinidadian navigator, judge, and diplomat (d. 2013)\n*  1917   – Danielle Darrieux, French actress and singer (d. 2017)\n*  1917   – Ahron Soloveichik, Russian rabbi and scholar (d. 2001)\n*1918 – Gersh Budker, Ukrainian-Russian physicist and academic (d. 1977)\n*  1918   – Jack Paar, American comedian, author and talk show host (d. 2004)\n*1919 – Manna Dey, Indian singer and composer (d. 2013) \n*  1919   – Mohammed Karim Lamrani, Moroccan businessman and politician, 7th Prime Minister of Morocco\n*  1919   – Dan O'Herlihy, Irish-American actor (d. 2005)\n*1921 – Vladimir Colin, Romanian journalist and author (d. 1991)\n*1922 – Alastair Gillespie, Canadian scholar and politician\n*1923 – Joseph Heller, American novelist, short story writer, and playwright (d. 1999)\n*  1923   – Antônio Maria Mucciolo, Italian-Brazilian archbishop (d. 2012)\n*  1923   – Marcel Rayman, Polish soldier (d. 1944)\n*1924 – Evelyn Boyd Granville, American mathematician, computer scientist, and academic\n*  1924   – Karel Kachyňa, Czech director and screenwriter (d. 2004)\n*  1924   – Terry Southern, American novelist, essayist, and screenwriter (d. 1995)\n*1925 – Chuck Bednarik, American lieutenant and football player (d. 2015)\n*  1925   – Scott Carpenter, American commander, pilot, and astronaut (d. 2013)\n*  1925   – Sardar Fazlul Karim, Bangladeshi philosopher, scholar, and academic (d. 2014)\n*1926 – Peter Lax, Hungarian-American mathematician and academic\n*1927 – Gary Bertini, Israeli conductor and composer (d. 2005)\n*  1927   – Laura Betti, Italian actress (d. 2004)\n*  1927   – Albert Zafy, Malagasy politician, 3rd President of Madagascar (d. 2017)\n*1927 – Bernard Vukas, Yugoslav-Croatian footballer (d. 1983)\n*1928 – Sonny James, American singer-songwriter and guitarist (d. 2016)\n*  1928   – Delfim Netto, Brazilian economist\n*1929 – Ralf Dahrendorf, German-English sociologist and politician (d. 2009)\n*  1929   – Sonny Ramadhin, Trinidadian cricketer\n*1930 – Little Walter Jacobs, American blues harp player and singer (d. 1968)\n*1930 – Ollie Matson, American sprinter and football player (d. 2011)\n*1931 – Naim Attallah, Palestinian author and publisher\n*1932 – Sandy Woodward, English admiral (d. 2013)\n*1934 – Cuauhtémoc Cárdenas, Mexican politician\n*  1934   – Shirley Horn, American singer and pianist (d. 2005)\n*  1934   – Phillip King, Tunisian-English sculptor\n*1936 – Danièle Huillet, French filmmaker (d. 2006)\n*  1936   – Hans E. Wallman, Swedish director, producer, and composer (d. 2014)\n*1937 – Una Stubbs, English actress and dancer\n*1939 – Judy Collins, American singer-songwriter and guitarist\n*  1939   – Wilhelmina Cooper, Dutch model (d. 1980)\n*  1939   – Victor Davies, Canadian pianist, composer, and conductor\n*1943 – Vassal Gadoengin, Nauruan politician (d. 2004)\n*  1943   – Joe Walsh, Irish politician, Minister for Agriculture, Food and the Marine (d. 2014)\n*1944 – Suresh Kalmadi, Indian businessman and politician\n*1945 – Rita Coolidge, American singer-songwriter\n*  1945   – Carson Whitsett, American keyboard player, songwriter, and producer (d. 2007)\n*1946 – Joanna Lumley, English actress, voice-over artist, author, and activist\n*  1946   – John Woo, Hong Kong director, producer, and screenwriter\n*1947 – Jacob Bekenstein, Mexican-born Israeli-American theoretical physicist (d. 2015)\n*  1947   – Sergio Infante, Chilean-Swedish poet and author\n*1948 – Györgyi Balogh, Hungarian sprinter\n*  1948   – Patricia Hill Collins, American sociologist and scholar\n*1949 – Jim Clench, Canadian bass player (d. 2010)\n*  1949   – Tim Hodgkinson, English saxophonist, clarinet player, and composer\n*  1949   – Paul Teutul, Sr., American motorcycle designer, co-founded Orange County Choppers\n*1950 – Dann Florek, American actor and director\n*  1950   – Danny McGrain, Scottish footballer and coach\n*1951 – Gordon Greenidge, Barbadian cricketer and coach\n*  1951   – Geoff Lees, English race car driver\n*  1951   – Sally Mann, American photographer\n*1952 – Richard Blundell, English economist and academic\n*  1952   – Kim Lewison, English lawyer and judge\n*  1952   – Peter Smith, Malaysian-born English academic and judge\n*1953 – Glen Ballard, American songwriter and producer\n*1954 – Ray Parker, Jr., American singer-songwriter, guitarist, and producer \n*  1954   – Joel Rosenberg, Canadian-American author and activist (d. 2011)\n*1955 – Alex Cunningham, Scottish politician\n*  1955   – Martin O'Donnell, American composer\n*  1955   – Ray Searage, American baseball player and coach\n*1956 – Phil Foglio, American illustrator\n*1957 – Rick Darling, Australian cricketer\n*  1957   – Uberto Pasolini, Italian banker, director, and producer\n*1959 – Yasmina Reza, French actress and playwright\n*  1959   – Lawrence Seeff, South African cricketer and basket weaver\n*1960 – Steve Cauthen, American jockey and sportscaster\n*1961 – Clint Malarchuk, Canadian ice hockey player and coach \n*  1961   – Marilyn Milian, American judge \n*  1961   – Vasiliy Sidorenko, Russian hammer thrower\n*1962 – Maia Morgenstern, Romanian actress\n*  1962   – Ted Sundquist, American football player, coach, and manager\n*1964 – Yvonne van Gennip, Dutch speed skater\n*1966 – Olaf Thon, German footballer and manager \n*1967 – Tim McGraw, American singer-songwriter and actor\n*1968 – Oliver Bierhoff, German footballer and manager\n*  1968   – D'arcy Wretzky, American bass player and singer (Smashing Pumpkins)\n*1969 – Wes Anderson, American director, producer, and screenwriter\n*  1969   – Billy Owens, American basketball player\n*1970 – Bernard Butler, English singer-songwriter, guitarist, and producer \n*1971 – Ethan Albright, American football player \n*  1971   – Stuart Appleby, Australian golfer\n*  1971   – Kim Grant, South African tennis player\n*  1971   – Artur Kohutek, Polish hurdler and soldier\n*  1971   – Ajith Kumar, Indian actor, F2 Racer\n*1972 – Ramzi bin al-Shibh, Yemeni terrorist\n*  1972   – Julie Benz, American actress\n*1973 – Oliver Neuville, German footballer\n*1975 – Austin Croshere, American basketball player and sportscaster\n*  1975   – Marc-Vivien Foé, Cameroonian footballer (d. 2003)\n*  1975   – Nina Hossain, English journalist \n*  1975   – Alexey Smertin, Russian footballer\n*1976 – Patricia Stokkers, Dutch swimmer \n*1977 – Vera Lischka, Austrian swimmer and politician\n*1978 – James Badge Dale, American actor\n*1979 – Mauro Bergamasco, Italian rugby player\n*  1979   – Roman Lyashenko, Russian ice hockey player (d. 2003)\n*1980 – Marvin Cabrera, Mexican footballer\n*  1980   – Rob Davison, Canadian ice hockey player and coach\n*  1980   – Jan Heylen, Belgian race car driver\n*  1980   – Jay Reatard, American singer-songwriter and guitarist (d. 2010)\n*1981 – Manny Acosta, Panamanian baseball player\n*  1981   – Derek Asamoah, Ghanaian footballer\n*  1981   – Alexander Hleb, Belarusian footballer\n*  1981   – Wes Welker, American football player\n*1982 – Jamie Dornan, Northern Irish model and actor\n*  1982   – Mark Farren, Irish footballer (d. 2016)\n*  1982   – Katya Zamolodchikova, American drag queen\n*  1982   – Tommy Robredo, Spanish tennis player\n*1983 – Alain Bernard, French swimmer\n*  1983   – Human Tornado, American wrestler\n*1984 – David Backes, American ice hockey player\n*  1984   – Patrick Eaves, American ice hockey player\n*  1984   – Alexander Farnerud, Swedish footballer\n*  1984   – Keiichiro Koyama, Japanese singer and actor \n*  1984   – Víctor Montaño, Colombian footballer\n*  1984   – Mark Seaby, Australian footballer\n*1985 – Shahriar Nafees, Bangladeshi cricketer\n*1986 – Christian Benítez, Ecuadorian footballer (d. 2013)\n*  1986   – Adam Casey, Australian footballer\n*  1986   – Jesse Klaver, Dutch politician\n*  1986   – Lee Chang-min, South Korean singer (2AM)\n*  1986   – Brent Stanton, Australian footballer\n*1987 – Leonardo Bonucci, Italian footballer\n*  1987   – Amir Johnson, American basketball player\n*  1987   – Shahar Pe'er, Israeli tennis player\n*1989 – Alejandro Arribas, Spanish footballer\n*  1989   – Poļina Jeļizarova, Latvian runner\n*1990 – Uriel Álvarez, Mexican footballer \n*  1990   – Diego Contento, German footballer\n*  1990   – Scooter Gennett, American baseball player\n*1991 – Bartosz Salamon, Polish footballer\n*1992 – Bradley Roby, American football player\n*  1992   – Matěj Vydra, Czech footballer\n*1993 – Jean-Christophe Bahebeck, French footballer\n*1994 – Wallace, Brazilian footballer\n*1996 – Christopher J. Alexis Jr., Grenadian road cyclist\n*2003 – Lizzy Greene, American actress\n\nDeaths\n\n* 408 – Arcadius, Byzantine emperor (b. 337)\n* 558 – Marcouf, missionary and saint\n* 908 – Wang Zongji, Chinese prince and pretender\n*1118 – Matilda of Scotland (b. 1080)\n*1171 – Diarmait Mac Murchada, King of Leinster (b. 1110)\n*1187 – Roger de Moulins, Grand Master of the Knights Hospitaller\n*1255 – Walter de Gray, English prelate and statesman\n*1277 – Stefan Uroš I of Serbia (b. 1223)\n*1278 – William II of Villehardouin\n*1308 – Albert I of Germany (b. 1255)\n*1539 – Isabella of Portugal (b. 1503)\n*1555 – Pope Marcellus II (b. 1501)\n*1572 – Pope Pius V (b. 1504)\n*1668 – Frans Luycx, Flemish painter (b. 1604)\n*1731 – Johann Ludwig Bach, German violinist and composer (b. 1677)\n*1738 – Charles Howard, 3rd Earl of Carlisle, English politician, First Lord of the Treasury (b. 1669)\n*1772 – Gottfried Achenwall, Polish-German historian, economist, and jurist (b. 1719)\n*1813 – Jean-Baptiste Bessières, French general (b. 1768)\n*1838 – Antoine Louis Dugès, French obstetrician and naturalist (b. 1797)\n*1856 – John Wilbur, American minister and theologian (b. 1774)\n*1873 – David Livingstone, Scottish-English missionary and explorer (b. 1813)\n*1899 – Ludwig Büchner, German physiologist and physician (b. 1824)\n*1904 – Antonín Dvořák, Czech composer and academic (b. 1841)\n*1913 – John Barclay Armstrong, American lieutenant (b. 1850)\n*1920 – Princess Margaret of Connaught (b. 1882)\n*1935 – Henri Pélissier, French cyclist (b. 1889)\n*1943 – Johan Oscar Smith, Norwegian religious leader, founded the Brunstad Christian Church (b. 1871)\n*1945 – Joseph Goebbels, German lawyer and politician, Chancellor of Germany (b. 1897)\n*  1945   – Magda Goebbels, German wife of Joseph Goebbels (b. 1901)\n*1953 – Everett Shinn, American painter and illustrator (b. 1876)\n*1956 – LeRoy Samse, American pole vaulter (b. 1883)\n*1960 – Charles Holden, English architect, designed the Bristol Central Library (b. 1875)\n*1963 – Lope K. Santos, Filipino lawyer and politician (b. 1879)\n*1965 – Spike Jones, American singer and bandleader (b. 1911)\n*1968 – Jack Adams, Canadian-American ice hockey player, coach, and manager (b. 1895)\n*  1968   – Harold Nicolson, English author and politician (b. 1886)\n*1970 – Yi Un, Korean prince (b. 1897)\n*1973 – Asger Jorn, Danish painter and sculptor (b. 1914)\n*1976 – T. R. M. Howard, American surgeon and activist (b. 1908)\n*  1976   – Alexandros Panagoulis, Greek poet and politician (b. 1939)\n*1978 – Aram Khachaturian, Georgian-Armenian composer and conductor (b. 1903)\n*1982 – William Primrose, Scottish viola player and educator (b. 1903)\n*1984 – Jüri Lossmann, Estonian-Swedish runner (b. 1891)\n*1985 – Denise Robins, English journalist and author (b. 1897)\n*1986 – Hugo Peretti, American songwriter and producer (b. 1916)\n*1988 – Ben Lexcen, Australian sailor and architect (b. 1936)\n*1989 – Sally Kirkland, American journalist (b. 1912)\n*  1989   – V. M. Panchalingam, Sri Lankan civil servant (b. 1930)\n*  1989   – Patrice Tardif, Canadian farmer and politician (b. 1904)\n*1990 – Sergio Franchi, Italian-American tenor and actor (b. 1926)\n*1991 – Richard Thorpe, American director and screenwriter (b. 1896)\n*1993 – Pierre Bérégovoy, French metallurgist and politician, Prime Minister of France (b. 1925)\n*  1993   – Ranasinghe Premadasa, Sri Lankan politician, 3rd President of Sri Lanka (b. 1924)\n*1994 – Ayrton Senna, Brazilian race car driver (b. 1960)\n*1995 – Antonio Salemme, Italian-American painter (b. 1892)\n*1997 – Fernand Dumont, Canadian sociologist, philosopher, and poet (b. 1927)\n*1998 – Eldridge Cleaver, American author and activist (b. 1935)\n*2000 – Steve Reeves, American bodybuilder and actor (b. 1926)\n*2002 – Ebrahim Al-Arrayedh, Indian poet and author (b. 1908) \n*2003 – Miss Elizabeth, American wrestler and manager (b. 1960)\n*  2003   – Wim van Est, Dutch cyclist (b. 1923)\n*2005 – Kenneth Clark, American psychologist and academic (b. 1914)\n*2008 – Anthony Mamo, Maltese judge and politician, 1st President of Malta (b. 1909)\n*  2008   – Philipp von Boeselager, German soldier and economist (b. 1917)\n*2010 – Helen Wagner, American actress (b. 1918)\n*2011 – Henry Cooper, English boxer (b. 1934)\n*  2011   – Ted Lowe, English sportscaster (b. 1920)\n\n*2012 – James Kinley, Canadian engineer and politician, 29th Lieutenant Governor of Nova Scotia (b. 1925)\n*  2012   – Mordechai Virshubski, German-Israeli lawyer and politician (b. 1930)\n*2013 – Chris Kelly, American rapper  (b. 1978)\n*  2013   – Pierre Pleimelding, French footballer and manager (b. 1952)\n*2014 – Adamu Atta, Nigerian lawyer and politician, 5th Governor of Kwara State (b. 1927)\n*  2014   – Radhia Cousot, Tunisian-American computer scientist and academic (b. 1947)\n*  2014   – Assi Dayan, Israeli actor, director, and screenwriter (b. 1945)\n*  2014   – Juan de Dios Castillo, Mexican footballer and coach (b. 1951)\n*2015 – Geoff Duke, English-Manx motorcycle racer (b. 1923)\n*  2015   – Vafa Guluzade, Azerbaijani political scientist, academic, and diplomat (b. 1940)\n*  2015   – María Elena Velasco, Mexican actress, singer, director, and screenwriter (b. 1940)\n*  2015   – Grace Lee Whitney, American actress (b. 1930)\n\nHolidays and observances\n\n* Christian feast day:\n** Andeolus\n** Augustin Schoeffler, Jean-Louis Bonnard (part of Vietnamese Martyrs)\n** Benedict of Szkalka\n** Brioc\n** James the Less (Anglican Communion)\n** Joseph the Worker (Roman Catholic)\n** Blessed Klymentiy Sheptytsky (Ukrainian Greek Catholic Church \n** Marcouf\n** Philip the Apostle (Anglican Communion, Lutheran Church)\n** Richard Pampuri\n** Sigismund of Burgundy\n** Walpurga (canonization)\n** May 1 (Eastern Orthodox liturgics)\n* Earliest day on which Mother's Day can fall, while May 7 is the latest; celebrated on the first Monday in May. (Samoa)\n* Earliest day on which Mother's Day can fall, while May 7 is the latest; celebrated on the first Sunday in May. (Hong Kong, Hungary, Lithuania, Mozambique, Portugal, Spain, Romania)\n* Earliest day on which National Day of Prayer can fall, while May 7 is the latest; celebrated on the first Thursday in May. (United States)\n* Earliest day on which World Asthma Day can fall, while May 7 is the latest; celebrated on the first Tuesday in May. (International)\n* Armed Forces Day (Mauritania)\n* Constitution Day (Argentina, Latvia, Marshall Islands)\n* Commemoration of the states of Maharashtra and Gujarat following the foundation of Samyukta Maharashtra Samiti (India):\n** Gujarat Day\n** Maharashtra Day\n* International Sunflower Guerrilla Gardening Day \n* Lei Day (Hawaii)\n* International Workers' Day or Labour Day (International), and its related observances:\n** Earliest day on which Labour Day can fall, while May 7 is the latest; celebrated on the first Monday of May. (Barbados, Dominica)\n** Law Day (United States), formerly intended to counterbalance the celebration of Labour Day. (United States)\n** Loyalty Day, formerly intended to counterbalance the celebration of Labour Day. (United States)\n* May Day (beginning of Summer) observances in the Northern hemisphere (see April 30):\n** Beltane (Ireland, Scotland, Isle of Man, Celtic neopagans and Wiccans in the Northern hemisphere)\n** Earliest day on which Beltane can fall, while May 7 is the latest; celebrated on the first Monday in May. (Ireland, Scotland)\n**Calan Mai (Wales)\n*Samhain (Celtic neopagans and Wiccans in the Southern Hemisphere)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 1" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19348" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 475 BC  – Roman consul Publius Valerius Poplicola celebrates a Roman triumph for his victory over Veii and the Sabines. \n* 305 – Diocletian and Maximian retire from the office of Roman emperor.\n* 524 – King Sigismund of Burgundy is executed at Orléans after an 8-year reign and is succeeded by his brother Godomar.\n* 880 – The Nea Ekklesia is inaugurated in Constantinople, setting the model for all later cross-in-square Orthodox churches.\n*1169 – Norman mercenaries land at Bannow Bay in Leinster, marking the beginning of the Norman invasion of Ireland.\n*1328 – Wars of Scottish Independence end: By the Treaty of Edinburgh–Northampton the Kingdom of England recognises the Kingdom of Scotland as an independent state.\n*1455 – Battle of Arkinholm, Royal forces end the Black Douglas hegemony in Scotland.\n*1576 – Stephen Báthory, the reigning Prince of Transylvania, marries Anna Jagiellon and they become co-rulers of the Polish–Lithuanian Commonwealth.\n*1707 – The Act of Union joins the Kingdom of England and Kingdom of Scotland to form the Kingdom of Great Britain.\n*1753 – Publication of Species Plantarum by Linnaeus, and the formal start date of plant taxonomy adopted by the International Code of Botanical Nomenclature.\n*1759 – Josiah Wedgwood founds the Wedgwood pottery company in Great Britain.\n*1776 – Establishment of the Illuminati in Ingolstadt (Upper Bavaria), by Jesuit-taught Adam Weishaupt.\n*1778 – American Revolution: The Battle of Crooked Billet begins in Hatboro, Pennsylvania.\n*1785 – Kamehameha I, the king of Hawaii, defeats Kalanikūpule and establishes the Kingdom of Hawaii.\n*1786 – In Vienna, Austria, Mozart's opera The Marriage of Figaro is performed for the first time.\n*1794 – War of the Pyrenees: The Battle of Boulou ends, in which French forces defeat the Spanish and regain nearly all the land they lost to Spain in 1793.\n*1820 – Execution of the Cato Street Conspirators\n*1840 – The Penny Black, the first official adhesive postage stamp, is issued in the United Kingdom.\n*1844 – Hong Kong Police Force, the world's second modern police force and Asia's first, is established.\n*1846 – The few remaining Mormons left in Nauvoo, Illinois, formally dedicate the Nauvoo Temple.\n*1851 – Queen Victoria opens The Great Exhibition at The Crystal Palace in London.\n*1856 – The Province of Isabela was created in the Philippines in honor of Queen Isabela II.\n*1862 – American Civil War: The Union Army completes its capture of New Orleans.\n*1863 – American Civil War: The Battle of Chancellorsville begins.\n*1865 – The Empire of Brazil, Argentina, and Uruguay sign the Treaty of the Triple Alliance.\n*1866 – The Memphis Race Riots begin. In three days time, 46 blacks and two whites were killed. Reports of the atrocities influenced passage of the Fourteenth Amendment to the United States Constitution.\n*1869 – The Folies Bergère opens in Paris.\n*1875 – Alexandra Palace reopens after being burned down in a fire in 1873.\n*1884 – Proclamation of the demand for eight-hour workday in the United States.\n*  1884   – Moses Fleetwood Walker becomes the first black person to play in a professional baseball game in the United States.\n*1885 – The original Chicago Board of Trade Building opens for business.\n*1886 – Rallies are held throughout the United States demanding the eight-hour work day, culminating in the Haymarket affair in Chicago, in commemoration of which May 1 is celebrated as International Workers' Day in many countries.\n*1893 – The World's Columbian Exposition opens in Chicago.\n*1894 – Coxey's Army, the first significant American protest march, arrives in Washington, D.C.\n*1898 – Spanish–American War: Battle of Manila Bay: The United States Navy destroys the Spanish Pacific fleet in the first major battle of the war.\n*1900 – The Scofield Mine disaster kills over 200 men in Scofield, Utah in what is to date the fifth-worst mining accident in United States history.\n*1915 – The  departs from New York City on her 202nd, and final, crossing of the North Atlantic. Six days later, the ship is torpedoed off the coast of Ireland with the loss of 1,198 lives.\n*1919 – German troops enter Munich to squash the Bavarian Soviet Republic.\n*1925 – The All-China Federation of Trade Unions is officially founded. Today it is the largest trade union in the world, with 134 million members.\n*1927 – The Union Labor Life Insurance Company is founded by the American Federation of Labor.\n*1929 – The 7.2  Kopet Dag earthquake shakes the Iran–Turkmenistan border region with a maximum Mercalli intensity of IX (Violent), killing up to 3,800 and injuring 1,121.\n*1930 – The dwarf planet Pluto is officially named.\n*1931 – The Empire State Building is dedicated in New York City.\n*1941 – World War II: German forces launch a major attack on Tobruk.\n*1944 – World War II: Two hundred Communist prisoners are shot by the Germans at Kaisariani, Athens in reprisal for the killing of General Franz Krech by partisans at Molaoi.\n*1945 – World War II: A German newsreader officially announces that Adolf Hitler has \"fallen at his command post in the Reich Chancellery fighting to the last breath against Bolshevism and for Germany\". The Soviet flag is raised over the Reich Chancellery, by order of Stalin.\n*  1945   – World War II: Nazi propaganda minister Joseph Goebbels and his wife Magda commit suicide in the Reich Garden outside the Führerbunker. Their children are also killed by having cyanide pills inserted into their mouths by their mother, Magda.\n*  1945   – World War II: Forces of the Soviet Red Army liberate Allied prisoners of war imprisoned at Stalag Luft I near Barth, Germany.\n*  1945   – World War II: Up to 2,500 people die in a mass suicide in Demmin following the advance of the Red Army.\n*  1945   – World War II: Yugoslav Partisans liberate Trieste.\n*1946 – Start of three-year Pilbara strike of Indigenous Australians.\n*  1946   – The Paris Peace Conference concludes that the islands of the Dodecanese should be returned to Greece by Italy.\n*1947 – Portella della Ginestra massacre against May Day celebrations in Sicily by the bandit and separatist leader Salvatore Giuliano where 11 persons are killed and 33 wounded.\n*1950 – Guam is organized as a United States commonwealth.\n*1956 – The polio vaccine developed by Jonas Salk is made available to the public.\n*  1956   – A doctor in Japan reports an \"epidemic of an unknown disease of the central nervous system\", marking the official discovery of Minamata disease.\n*1957 – Thirty-four people are killed when a Vickers Viking airliner crashes in Hampshire, England.\n*1960 – Formation of the western Indian states of Gujarat and Maharashtra; also known as \"Maharashtra Day\".\n*  1960   – Cold War: U-2 incident: Francis Gary Powers, in a Lockheed U-2 spyplane, is shot down over the Sverdlovsk Oblast, Soviet Union, sparking a diplomatic crisis.\n*1961 – The Prime Minister of Cuba, Fidel Castro, proclaims Cuba a socialist nation and abolishes elections.\n*1965 – Battle of Dong-Yin, a naval conflict between ROC and PRC, takes place.\n*1970 – Protests erupt following the announcement by Richard Nixon that American and South Vietnamese forces would attack Vietnamese communists in a Cambodian Campaign.\n*1971 – Amtrak (the National Railroad Passenger Corporation) takes over operation of U.S. passenger rail service.\n*1974 – The Argentine terrorist organization Montoneros is expelled from Plaza de Mayo by president Juan Perón.\n*1977 – Thirty-six people are killed in Taksim Square, Istanbul, during the Labour Day celebrations.\n*1978 – Japan's Naomi Uemura, travelling by dog sled, becomes the first person to reach the North Pole alone.\n*1982 – Operation Black Buck: The Royal Air Force attacks the Argentine Air Force during Falklands War.\n*1983 – The Sydney Entertainment Centre is opened.\n*1987 – Pope John Paul II beatifies Edith Stein, a Jewish-born Carmelite nun who was gassed in the Nazi concentration camp at Auschwitz.\n*1989 – Disney-MGM Studios opens at Walt Disney World near Orlando, Florida, United States.\n*1990 – The former Philippine Episcopal Church (supervised by the Episcopal Church of the United States of America) is granted full autonomy and raised to the status of an Autocephalous Anglican Province and renamed the Episcopal Church in the Philippines.\n*1993 – Dingiri Banda Wijetunga became president of Sri Lanka automatically after killing of R Premadasa in LTTE bomb explosion\n*1994 – Three-time Formula One world champion Ayrton Senna is killed in an accident whilst leading the San Marino Grand Prix at Imola.\n*1995 – Croatian War of Independence: Croatian forces launch Operation Flash.\n*1999 – The body of British climber George Mallory is found on Mount Everest, 75 years after his disappearance in 1924.\n*  1999   – SpongeBob SquarePants premieres on Nickelodeon after the 1999 Kids' Choice Awards.\n*2001 – Philippine President Gloria Macapagal Arroyo declares the existence of \"a state of rebellion\", hours after thousands of supporters of her arrested predecessor, Joseph Estrada, storm towards the presidential palace at the height of the EDSA III rebellion.\n*2002 – OpenOffice.org released version 1.0, the first stable version of the software.\n*2003 – Invasion of Iraq: In what becomes known as the \"Mission Accomplished\" speech, on board the  (off the coast of California), U.S. President George W. Bush declares that \"major combat operations in Iraq have ended\".\n*2004 – Cyprus, Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia join the European Union, celebrated at the residence of the Irish President in Dublin.\n*2009 – Same-sex marriage is legalized in Sweden.\n*2011 – War on Terror: Al-Qaeda leader Osama bin Laden is shot and killed by U.S. Navy seals.\n*2011 – Pope John Paul II is beatified by his successor, Pope Benedict XVI.\n\nBirths\n\n*1218 – John I, Count of Hainaut (d. 1257)\n*  1218   – Rudolf I of Germany (d. 1291)\n*1225 – Jean de Joinville, French historian and author (d. 1317)\n*1238 – Magnus Lagabøte, king of Norway (d. 1280)\n*1285 – Edmund FitzAlan, 9th Earl of Arundel, English politician (d. 1326)\n*1326 – Rinchinbal Khan, Mongolian emperor (d. 1332)\n*1488 – Sidonie of Bavaria, eldest daughter of Duke Albrecht IV of Bavaria-Munich (d. 1505)\n*1527 – Johannes Stadius, German astronomer, astrologer, mathematician (d. 1579)\n*1545 – Franciscus Junius, French theologian (d. 1602)\n*1579 – Wolphert Gerretse, Dutch-American farmer, co-founded New Netherland (d. 1662)\n*1582 – Marco da Gagliano, Italian composer (d. 1643)\n*1585 – Sophia Olelkovich Radziwill, Belarusian saint (d. 1612)\n*1591 – Johann Adam Schall von Bell, German missionary and astronomer (d. 1666)\n*1594 – John Haynes, English-American politician, 1st Governor of the Colony of Connecticut (d. 1653)\n*1602 – William Lilly, English astrologer (d. 1681)\n*1672 – Joseph Addison, English essayist, poet, playwright, and politician (d. 1719)\n*1730 – Joshua Rowley, English admiral (d. 1790)\n*1735 – Jan Hendrik van Kinsbergen, Dutch admiral and philanthropist (d. 1819)\n*1751 – Judith Sargent Murray, American poet and playwright (d. 1820)\n*1764 – Benjamin Henry Latrobe, English-American architect, designed the United States Capitol (d. 1820)\n*1769 – Arthur Wellesley, 1st Duke of Wellington, Irish-English field marshal and politician, Prime Minister of the United Kingdom (d. 1852)\n*1803 – James Clarence Mangan, Irish poet and author (d. 1849)\n*1821 – Henry Ayers, English-Australian politician, 8th Premier of South Australia (d. 1897)\n*1824 – Alexander William Williamson, English chemist and academic (d. 1904)\n*1825 – Johann Jakob Balmer, Swiss mathematician and physicist (d. 1898)\n*  1825   – George Inness, American painter and educator (d. 1894)\n*1827 – Jules Breton, French painter (d. 1906)\n*1829 – José de Alencar, Brazilian author and playwright (d. 1877)\n*  1829   – Frederick Sandys, English painter and illustrator (d. 1904)\n*1830 – Guido Gezelle, Belgian priest and poet (d. 1899)\n*1831 – Emily Stowe, Canadian physician and activist (d. 1903)\n*1847 – Henry Demarest Lloyd, American journalist and politician (d. 1903)\n*1848 – Adelsteen Normann, Norwegian painter (d. 1919)\n*1850 – Prince Arthur, Duke of Connaught and Strathearn (d. 1942)\n*1851 – Laza Lazarević, Serbian psychiatrist and neurologist (d. 1891)\n*1852 – Calamity Jane, American frontierswoman and professional scout (d. 1903)\n*  1852   – Santiago Ramón y Cajal, Spanish neuroscientist and pathologist, Nobel Prize laureate (d. 1934)\n*1853 – Jacob Mikhailovich Gordin, Jewish Ukrainian-American journalist, actor, and playwright (d. 1909)\n*1855 – Cecilia Beaux, American painter and academic (d. 1942)\n*1857 – Theo van Gogh, Dutch art dealer (d. 1891)\n*1859 – Jacqueline Comerre-Paton, French painter and sculptor (d. 1955)\n*1862 – Marcel Prévost, French novelist and playwright (d. 1941)\n*1864 – Anna Jarvis, American founder of Mother's Day (d. 1948)\n*1871 – Seakle Greijdanus, Dutch theologian and scholar (d. 1948)\n*  1871   – Emiliano Chamorro Vargas, President of Nicaragua (d. 1966)\n*1872 – Hugo Alfvén, Swedish composer, conductor, violinist, and painter (d. 1960)\n*  1872   – Sidónio Pais, Portuguese soldier and politician, 4th President of Portugal (d. 1918)\n*1874 – Romaine Brooks, American-French painter and illustrator (d. 1970)\n*  1874   – Paul Van Asbroeck, Belgian target shooter (d. 1959)\n*1875 – Dave Hall, American runner (d. 1972)\n*1881 – Pierre Teilhard de Chardin, French priest, palaeontologist, and philosopher (d. 1955)\n*1884 – Francis Curzon, 5th Earl Howe, English race car driver and politician (d. 1964)\n*1885 – Clément Pansaers, Belgian poet (d. 1922)\n*  1885   – Ralph Stackpole, American sculptor and painter (d. 1973)\n*1887 – Alan Cunningham, Anglo-Irish general and diplomat, High Commissioners for Palestine and Transjordan (d. 1983)\n*1891 – Lillian Estelle Fisher, American historian of Spanish  America (d. 1988)\n*1895 – Nikolai Yezhov, Soviet secret police official, head of the NKVD (d. 1940)\n*1896 – Herbert Backe, German agronomist and politician (d. 1947)\n*  1896   – Mark W. Clark, American general (d. 1984)\n*  1896   – J. Lawton Collins, American general (d. 1987)\n*1898 – Alfred Schmidt, Estonian weightlifter (d. 1972)\n*1900 – Ignazio Silone, Italian journalist and politician (d. 1978)\n*  1900   – Aleksander Wat, Polish poet and writer (d. 1967)\n*1901 – Sterling Allen Brown, American poet, academic, and critic (d. 1989)\n*  1901   – Heinz Eric Roemheld, American pianist, composer, and conductor (d. 1985)\n*  1901   – Antal Szerb, Hungarian scholar and author (d. 1945)\n*1905 – Henry Koster, German-American director, producer, and screenwriter (d. 1988)\n*1906 – Horst Schumann, German SS officer and physician (d. 1983)\n*1907 – Hayes Alvis, American bassist (d. 1972)\n*  1907   – Kate Smith, American singer and actress (d. 1986)\n*1908 – Giovannino Guareschi, Italian journalist and author (d. 1968)\n*  1908   – Morris Kline, American mathematician and academic (d. 1992)\n*1909 – Endel Puusepp, Estonian-Soviet military pilot and politician (d. 1996)\n*  1909   – Yiannis Ritsos, Greek poet and playwright (d. 1990) \n*1910 – Behice Boran, Turkish sociologist and politician (d. 1987)\n*  1910   – Raya Dunayevskaya, Ukrainian-American philosopher and activist (d. 1987)\n*  1910   – Dirk Andries Flentrop, Dutch organ builder (d. 2003)\n*  1910   – J. Allen Hynek, American astronomer and ufologist (d. 1986)\n*  1910   – Nejdet Sançar, Turkish literature teacher (d. 1975)\n*1911 – Wilfred Watson, English-Canadian poet, playwright and educator (d. 1998)\n*1912 – Otto Kretschmer, Polish-German admiral (d. 1998)\n*1913 – Louis Nye, American actor (d. 2005)\n*  1913   – Walter Susskind, Czech-English pianist, conductor, and educator (d. 1980)\n*1914 – Jaap van der Poll, Dutch javelin thrower (d. 2010)\n*1915 – Hanns Martin Schleyer, German businessman (d. 1977)\n*1916 – Antoni Bazaniak, Polish sprint canoeist (d. 1979)\n*  1916   – Glenn Ford, Canadian-American actor and producer (d. 2006)\n*1917 – John Beradino, American baseball player and actor (d. 1996)\n*  1917   – Ulric Cross, Trinidadian navigator, judge, and diplomat (d. 2013)\n*  1917   – Danielle Darrieux, French actress and singer (d. 2017)\n*  1917   – Ahron Soloveichik, Russian rabbi and scholar (d. 2001)\n*1918 – Gersh Budker, Ukrainian-Russian physicist and academic (d. 1977)\n*  1918   – Jack Paar, American comedian, author and talk show host (d. 2004)\n*1919 – Manna Dey, Indian singer and composer (d. 2013) \n*  1919   – Mohammed Karim Lamrani, Moroccan businessman and politician, 7th Prime Minister of Morocco\n*  1919   – Dan O'Herlihy, Irish-American actor (d. 2005)\n*1921 – Vladimir Colin, Romanian journalist and author (d. 1991)\n*1922 – Alastair Gillespie, Canadian scholar and politician\n*1923 – Joseph Heller, American novelist, short story writer, and playwright (d. 1999)\n*  1923   – Antônio Maria Mucciolo, Italian-Brazilian archbishop (d. 2012)\n*  1923   – Marcel Rayman, Polish soldier (d. 1944)\n*1924 – Evelyn Boyd Granville, American mathematician, computer scientist, and academic\n*  1924   – Karel Kachyňa, Czech director and screenwriter (d. 2004)\n*  1924   – Terry Southern, American novelist, essayist, and screenwriter (d. 1995)\n*1925 – Chuck Bednarik, American lieutenant and football player (d. 2015)\n*  1925   – Scott Carpenter, American commander, pilot, and astronaut (d. 2013)\n*  1925   – Sardar Fazlul Karim, Bangladeshi philosopher, scholar, and academic (d. 2014)\n*1926 – Peter Lax, Hungarian-American mathematician and academic\n*1927 – Gary Bertini, Israeli conductor and composer (d. 2005)\n*  1927   – Laura Betti, Italian actress (d. 2004)\n*  1927   – Albert Zafy, Malagasy politician, 3rd President of Madagascar (d. 2017)\n*1927 – Bernard Vukas, Yugoslav-Croatian footballer (d. 1983)\n*1928 – Sonny James, American singer-songwriter and guitarist (d. 2016)\n*  1928   – Delfim Netto, Brazilian economist\n*1929 – Ralf Dahrendorf, German-English sociologist and politician (d. 2009)\n*  1929   – Sonny Ramadhin, Trinidadian cricketer\n*1930 – Little Walter Jacobs, American blues harp player and singer (d. 1968)\n*1930 – Ollie Matson, American sprinter and football player (d. 2011)\n*1931 – Naim Attallah, Palestinian author and publisher\n*1932 – Sandy Woodward, English admiral (d. 2013)\n*1934 – Cuauhtémoc Cárdenas, Mexican politician\n*  1934   – Shirley Horn, American singer and pianist (d. 2005)\n*  1934   – Phillip King, Tunisian-English sculptor\n*1936 – Danièle Huillet, French filmmaker (d. 2006)\n*  1936   – Hans E. Wallman, Swedish director, producer, and composer (d. 2014)\n*1937 – Una Stubbs, English actress and dancer\n*1939 – Judy Collins, American singer-songwriter and guitarist\n*  1939   – Wilhelmina Cooper, Dutch model (d. 1980)\n*  1939   – Victor Davies, Canadian pianist, composer, and conductor\n*1943 – Vassal Gadoengin, Nauruan politician (d. 2004)\n*  1943   – Joe Walsh, Irish politician, Minister for Agriculture, Food and the Marine (d. 2014)\n*1944 – Suresh Kalmadi, Indian businessman and politician\n*1945 – Rita Coolidge, American singer-songwriter\n*  1945   – Carson Whitsett, American keyboard player, songwriter, and producer (d. 2007)\n*1946 – Joanna Lumley, English actress, voice-over artist, author, and activist\n*  1946   – John Woo, Hong Kong director, producer, and screenwriter\n*1947 – Jacob Bekenstein, Mexican-born Israeli-American theoretical physicist (d. 2015)\n*  1947   – Sergio Infante, Chilean-Swedish poet and author\n*1948 – Györgyi Balogh, Hungarian sprinter\n*  1948   – Patricia Hill Collins, American sociologist and scholar\n*1949 – Jim Clench, Canadian bass player (d. 2010)\n*  1949   – Tim Hodgkinson, English saxophonist, clarinet player, and composer\n*  1949   – Paul Teutul, Sr., American motorcycle designer, co-founded Orange County Choppers\n*1950 – Dann Florek, American actor and director\n*  1950   – Danny McGrain, Scottish footballer and coach\n*1951 – Gordon Greenidge, Barbadian cricketer and coach\n*  1951   – Geoff Lees, English race car driver\n*  1951   – Sally Mann, American photographer\n*1952 – Richard Blundell, English economist and academic\n*  1952   – Kim Lewison, English lawyer and judge\n*  1952   – Peter Smith, Malaysian-born English academic and judge\n*1953 – Glen Ballard, American songwriter and producer\n*1954 – Ray Parker, Jr., American singer-songwriter, guitarist, and producer \n*  1954   – Joel Rosenberg, Canadian-American author and activist (d. 2011)\n*1955 – Alex Cunningham, Scottish politician\n*  1955   – Martin O'Donnell, American composer\n*  1955   – Ray Searage, American baseball player and coach\n*1956 – Phil Foglio, American illustrator\n*1957 – Rick Darling, Australian cricketer\n*  1957   – Uberto Pasolini, Italian banker, director, and producer\n*1959 – Yasmina Reza, French actress and playwright\n*  1959   – Lawrence Seeff, South African cricketer and basket weaver\n*1960 – Steve Cauthen, American jockey and sportscaster\n*1961 – Clint Malarchuk, Canadian ice hockey player and coach \n*  1961   – Marilyn Milian, American judge \n*  1961   – Vasiliy Sidorenko, Russian hammer thrower\n*1962 – Maia Morgenstern, Romanian actress\n*  1962   – Ted Sundquist, American football player, coach, and manager\n*1964 – Yvonne van Gennip, Dutch speed skater\n*1966 – Olaf Thon, German footballer and manager \n*1967 – Tim McGraw, American singer-songwriter and actor\n*1968 – Oliver Bierhoff, German footballer and manager\n*  1968   – D'arcy Wretzky, American bass player and singer (Smashing Pumpkins)\n*1969 – Wes Anderson, American director, producer, and screenwriter\n*  1969   – Billy Owens, American basketball player\n*1970 – Bernard Butler, English singer-songwriter, guitarist, and producer \n*1971 – Ethan Albright, American football player \n*  1971   – Stuart Appleby, Australian golfer\n*  1971   – Kim Grant, South African tennis player\n*  1971   – Artur Kohutek, Polish hurdler and soldier\n*  1971   – Ajith Kumar, Indian actor, F2 Racer\n*1972 – Ramzi bin al-Shibh, Yemeni terrorist\n*  1972   – Julie Benz, American actress\n*1973 – Oliver Neuville, German footballer\n*1975 – Austin Croshere, American basketball player and sportscaster\n*  1975   – Marc-Vivien Foé, Cameroonian footballer (d. 2003)\n*  1975   – Nina Hossain, English journalist \n*  1975   – Alexey Smertin, Russian footballer\n*1976 – Patricia Stokkers, Dutch swimmer \n*1977 – Vera Lischka, Austrian swimmer and politician\n*1978 – James Badge Dale, American actor\n*1979 – Mauro Bergamasco, Italian rugby player\n*  1979   – Roman Lyashenko, Russian ice hockey player (d. 2003)\n*1980 – Marvin Cabrera, Mexican footballer\n*  1980   – Rob Davison, Canadian ice hockey player and coach\n*  1980   – Jan Heylen, Belgian race car driver\n*  1980   – Jay Reatard, American singer-songwriter and guitarist (d. 2010)\n*1981 – Manny Acosta, Panamanian baseball player\n*  1981   – Derek Asamoah, Ghanaian footballer\n*  1981   – Alexander Hleb, Belarusian footballer\n*  1981   – Wes Welker, American football player\n*1982 – Jamie Dornan, Northern Irish model and actor\n*  1982   – Mark Farren, Irish footballer (d. 2016)\n*  1982   – Katya Zamolodchikova, American drag queen\n*  1982   – Tommy Robredo, Spanish tennis player\n*1983 – Alain Bernard, French swimmer\n*  1983   – Human Tornado, American wrestler\n*1984 – David Backes, American ice hockey player\n*  1984   – Patrick Eaves, American ice hockey player\n*  1984   – Alexander Farnerud, Swedish footballer\n*  1984   – Keiichiro Koyama, Japanese singer and actor \n*  1984   – Víctor Montaño, Colombian footballer\n*  1984   – Mark Seaby, Australian footballer\n*1985 – Shahriar Nafees, Bangladeshi cricketer\n*1986 – Christian Benítez, Ecuadorian footballer (d. 2013)\n*  1986   – Adam Casey, Australian footballer\n*  1986   – Jesse Klaver, Dutch politician\n*  1986   – Lee Chang-min, South Korean singer (2AM)\n*  1986   – Brent Stanton, Australian footballer\n*1987 – Leonardo Bonucci, Italian footballer\n*  1987   – Amir Johnson, American basketball player\n*  1987   – Shahar Pe'er, Israeli tennis player\n*1989 – Alejandro Arribas, Spanish footballer\n*  1989   – Poļina Jeļizarova, Latvian runner\n*1990 – Uriel Álvarez, Mexican footballer \n*  1990   – Diego Contento, German footballer\n*  1990   – Scooter Gennett, American baseball player\n*1991 – Bartosz Salamon, Polish footballer\n*1992 – Bradley Roby, American football player\n*  1992   – Matěj Vydra, Czech footballer\n*1993 – Jean-Christophe Bahebeck, French footballer\n*1994 – Wallace, Brazilian footballer\n*1996 – Christopher J. Alexis Jr., Grenadian road cyclist\n*2003 – Lizzy Greene, American actress\n\nDeaths\n\n* 408 – Arcadius, Byzantine emperor (b. 337)\n* 558 – Marcouf, missionary and saint\n* 908 – Wang Zongji, Chinese prince and pretender\n*1118 – Matilda of Scotland (b. 1080)\n*1171 – Diarmait Mac Murchada, King of Leinster (b. 1110)\n*1187 – Roger de Moulins, Grand Master of the Knights Hospitaller\n*1255 – Walter de Gray, English prelate and statesman\n*1277 – Stefan Uroš I of Serbia (b. 1223)\n*1278 – William II of Villehardouin\n*1308 – Albert I of Germany (b. 1255)\n*1539 – Isabella of Portugal (b. 1503)\n*1555 – Pope Marcellus II (b. 1501)\n*1572 – Pope Pius V (b. 1504)\n*1668 – Frans Luycx, Flemish painter (b. 1604)\n*1731 – Johann Ludwig Bach, German violinist and composer (b. 1677)\n*1738 – Charles Howard, 3rd Earl of Carlisle, English politician, First Lord of the Treasury (b. 1669)\n*1772 – Gottfried Achenwall, Polish-German historian, economist, and jurist (b. 1719)\n*1813 – Jean-Baptiste Bessières, French general (b. 1768)\n*1838 – Antoine Louis Dugès, French obstetrician and naturalist (b. 1797)\n*1856 – John Wilbur, American minister and theologian (b. 1774)\n*1873 – David Livingstone, Scottish-English missionary and explorer (b. 1813)\n*1899 – Ludwig Büchner, German physiologist and physician (b. 1824)\n*1904 – Antonín Dvořák, Czech composer and academic (b. 1841)\n*1913 – John Barclay Armstrong, American lieutenant (b. 1850)\n*1920 – Princess Margaret of Connaught (b. 1882)\n*1935 – Henri Pélissier, French cyclist (b. 1889)\n*1943 – Johan Oscar Smith, Norwegian religious leader, founded the Brunstad Christian Church (b. 1871)\n*1945 – Joseph Goebbels, German lawyer and politician, Chancellor of Germany (b. 1897)\n*  1945   – Magda Goebbels, German wife of Joseph Goebbels (b. 1901)\n*1953 – Everett Shinn, American painter and illustrator (b. 1876)\n*1956 – LeRoy Samse, American pole vaulter (b. 1883)\n*1960 – Charles Holden, English architect, designed the Bristol Central Library (b. 1875)\n*1963 – Lope K. Santos, Filipino lawyer and politician (b. 1879)\n*1965 – Spike Jones, American singer and bandleader (b. 1911)\n*1968 – Jack Adams, Canadian-American ice hockey player, coach, and manager (b. 1895)\n*  1968   – Harold Nicolson, English author and politician (b. 1886)\n*1970 – Yi Un, Korean prince (b. 1897)\n*1973 – Asger Jorn, Danish painter and sculptor (b. 1914)\n*1976 – T. R. M. Howard, American surgeon and activist (b. 1908)\n*  1976   – Alexandros Panagoulis, Greek poet and politician (b. 1939)\n*1978 – Aram Khachaturian, Georgian-Armenian composer and conductor (b. 1903)\n*1982 – William Primrose, Scottish viola player and educator (b. 1903)\n*1984 – Jüri Lossmann, Estonian-Swedish runner (b. 1891)\n*1985 – Denise Robins, English journalist and author (b. 1897)\n*1986 – Hugo Peretti, American songwriter and producer (b. 1916)\n*1988 – Ben Lexcen, Australian sailor and architect (b. 1936)\n*1989 – Sally Kirkland, American journalist (b. 1912)\n*  1989   – V. M. Panchalingam, Sri Lankan civil servant (b. 1930)\n*  1989   – Patrice Tardif, Canadian farmer and politician (b. 1904)\n*1990 – Sergio Franchi, Italian-American tenor and actor (b. 1926)\n*1991 – Richard Thorpe, American director and screenwriter (b. 1896)\n*1993 – Pierre Bérégovoy, French metallurgist and politician, Prime Minister of France (b. 1925)\n*  1993   – Ranasinghe Premadasa, Sri Lankan politician, 3rd President of Sri Lanka (b. 1924)\n*1994 – Ayrton Senna, Brazilian race car driver (b. 1960)\n*1995 – Antonio Salemme, Italian-American painter (b. 1892)\n*1997 – Fernand Dumont, Canadian sociologist, philosopher, and poet (b. 1927)\n*1998 – Eldridge Cleaver, American author and activist (b. 1935)\n*2000 – Steve Reeves, American bodybuilder and actor (b. 1926)\n*2002 – Ebrahim Al-Arrayedh, Indian poet and author (b. 1908) \n*2003 – Miss Elizabeth, American wrestler and manager (b. 1960)\n*  2003   – Wim van Est, Dutch cyclist (b. 1923)\n*2005 – Kenneth Clark, American psychologist and academic (b. 1914)\n*2008 – Anthony Mamo, Maltese judge and politician, 1st President of Malta (b. 1909)\n*  2008   – Philipp von Boeselager, German soldier and economist (b. 1917)\n*2010 – Helen Wagner, American actress (b. 1918)\n*2011 – Henry Cooper, English boxer (b. 1934)\n*  2011   – Ted Lowe, English sportscaster (b. 1920)\n\n*2012 – James Kinley, Canadian engineer and politician, 29th Lieutenant Governor of Nova Scotia (b. 1925)\n*  2012   – Mordechai Virshubski, German-Israeli lawyer and politician (b. 1930)\n*2013 – Chris Kelly, American rapper  (b. 1978)\n*  2013   – Pierre Pleimelding, French footballer and manager (b. 1952)\n*2014 – Adamu Atta, Nigerian lawyer and politician, 5th Governor of Kwara State (b. 1927)\n*  2014   – Radhia Cousot, Tunisian-American computer scientist and academic (b. 1947)\n*  2014   – Assi Dayan, Israeli actor, director, and screenwriter (b. 1945)\n*  2014   – Juan de Dios Castillo, Mexican footballer and coach (b. 1951)\n*2015 – Geoff Duke, English-Manx motorcycle racer (b. 1923)\n*  2015   – Vafa Guluzade, Azerbaijani political scientist, academic, and diplomat (b. 1940)\n*  2015   – María Elena Velasco, Mexican actress, singer, director, and screenwriter (b. 1940)\n*  2015   – Grace Lee Whitney, American actress (b. 1930)\n\nHolidays and observances\n\n* Christian feast day:\n** Andeolus\n** Augustin Schoeffler, Jean-Louis Bonnard (part of Vietnamese Martyrs)\n** Benedict of Szkalka\n** Brioc\n** James the Less (Anglican Communion)\n** Joseph the Worker (Roman Catholic)\n** Blessed Klymentiy Sheptytsky (Ukrainian Greek Catholic Church \n** Marcouf\n** Philip the Apostle (Anglican Communion, Lutheran Church)\n** Richard Pampuri\n** Sigismund of Burgundy\n** Walpurga (canonization)\n** May 1 (Eastern Orthodox liturgics)\n* Earliest day on which Mother's Day can fall, while May 7 is the latest; celebrated on the first Monday in May. (Samoa)\n* Earliest day on which Mother's Day can fall, while May 7 is the latest; celebrated on the first Sunday in May. (Hong Kong, Hungary, Lithuania, Mozambique, Portugal, Spain, Romania)\n* Earliest day on which National Day of Prayer can fall, while May 7 is the latest; celebrated on the first Thursday in May. (United States)\n* Earliest day on which World Asthma Day can fall, while May 7 is the latest; celebrated on the first Tuesday in May. (International)\n* Armed Forces Day (Mauritania)\n* Constitution Day (Argentina, Latvia, Marshall Islands)\n* Commemoration of the states of Maharashtra and Gujarat following the foundation of Samyukta Maharashtra Samiti (India):\n** Gujarat Day\n** Maharashtra Day\n* International Sunflower Guerrilla Gardening Day \n* Lei Day (Hawaii)\n* International Workers' Day or Labour Day (International), and its related observances:\n** Earliest day on which Labour Day can fall, while May 7 is the latest; celebrated on the first Monday of May. (Barbados, Dominica)\n** Law Day (United States), formerly intended to counterbalance the celebration of Labour Day. (United States)\n** Loyalty Day, formerly intended to counterbalance the celebration of Labour Day. (United States)\n* May Day (beginning of Summer) observances in the Northern hemisphere (see April 30):\n** Beltane (Ireland, Scotland, Isle of Man, Celtic neopagans and Wiccans in the Northern hemisphere)\n** Earliest day on which Beltane can fall, while May 7 is the latest; celebrated on the first Monday in May. (Ireland, Scotland)\n**Calan Mai (Wales)\n*Samhain (Celtic neopagans and Wiccans in the Southern Hemisphere). May 1. http://en.wikipedia.org/?curid=19348."
  }
}
