{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15077",
  "eid" : "19e31950-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778552677,
  "textBody" : "An indoor rower, or rowing machine, is a machine used to simulate the action of watercraft rowing for the purpose of exercise or training for rowing. Indoor rowing has become established as a sport in its own right. The term also refers to a participant in this sport.\n\nModern indoor rowers are often known as ergometers (colloquially erg or ergo), an ergometer being a device which measures the amount of work performed. The indoor rower is calibrated to measure the amount of energy the rower is using through their use of the equipment.\n\nHistory\n\n \nChabrias, an Athenian admiral of the 4th century BC, introduced the first rowing machines as supplemental military training devices. \"To train inexperienced oarsmen, Chabrias built wooden rowing frames on shore where beginners could learn technique and timing before they went on board ship.\" John R. Hale, \"Lords of the Sea: The Epic Story of the Athenian Navy and the Birth of Democracy\"\n\nEarly rowing machines are known to have existed from the mid-1800s, a US patent being issued to W.B. Curtis in 1872 for a particular hydraulic based damper design. Machines using linear pneumatic resistance were common around 1900—one of the most popular was the Narragansett hydraulic rower, manufactured in Rhode Island from around 1900–1960. However they did not simulate actual rowing very accurately nor measure power output.\n\nIn the 1950s and 1960s, coaches in many countries began using specially made rowing machines for training and improved power measurement. One original design incorporated a large, heavy, solid iron flywheel with a mechanical friction brake, developed by John Harrison of Leichhardt Rowing Club in Sydney, later to become a professor of mechanical engineering at the University of New South Wales. Harrison, a dual Australian champion beach sprinter who went on to row in the coxless four at the 1956 Melbourne Olympics, had been introduced to rowing after a chance meeting with one of the fathers of modern athletic physiological training and testing, and the coach of the Leichhardt Guinea Pigs, Professor Frank Cotton. Professor Cotton had produced a rudimentary friction-based machine for evaluating potential rowers by exhausting them, without any pretence of accurately measuring power output. Harrison realised the importance of using a small braking area with a non-absorbent braking material, combined with a large flywheel. The advantage of this design (produced by Ted Curtain Engineering, Curtain being a fellow Guinea Pig) was the virtual elimination of factors able to interfere with accurate results—for instance ambient humidity or temperature. The Harrison-Cotton machine represents the very first piece of equipment able to accurately quantify human power output; power calculation within an accuracy range as achieved by his machine of less than 1% remains an impressive result today. The friction brake was adjusted according to a rower's weight to give an accurate appraisal of boat-moving ability (drag on a boat is proportional to weight). Inferior copies of Harrison's machine were produced in several countries utilising a smaller flywheel and leather straps—unfortunately the leather straps were sensitive to humidity, and the relatively large braking area made results far less accurate than Harrison's machine. The weight correction factor tended to make them unpopular among rowers of the time. Harrison, arguably the father of modern athletic power evaluation, died in February 2012.\n\nIn the 1970s, the Gjessing-Nilson ergometer from Norway used a friction brake mechanism with industrial strapping applied over the broad rim of the flywheel. Weights hanging from the strap ensured that an adjustable and predictable friction could be calculated. The cord from the handle mechanism ran over a helical pulley with varying radius, thereby adjusting the gearing and speed of the handle in a similar way to the changing mechanical gearing of the oar through the stroke, derived from changes in oar angle and other factors. This machine was for many years the internationally accepted standard for measurement.\n\nThe first air resistance ergometers were introduced around 1980 by Repco.\n\nThe Concept2 ergometer was introduced in 1980 by the Dreissigacker brothers. The first, the Model A, was a fixed-frame sliding-seat design using a bicycle wheel with fins attached for air resistance. The Model B, introduced in 1986, introduced a solid cast flywheel (now enclosed by a cage) and the first digital performance monitor, which proved revolutionary. This machine's capability of accurate calibration combined with easy transportability spawned the sport of competitive indoor rowing, and revolutionised training and selection procedures for watercraft rowing. The later Models C (1993) and D (2003) became some of the best-selling fitness equipment pieces of all time.\n\nDesign summary\n\nAll rowing-machine designs consist of an energy damper or braking mechanism connected to a chain and/or handle. A foot stretcher (where rowers places their feet) is attached to the same mounting as the energy damper. Most include a rail which either the seat or the mechanism slide upon. Different machines have a variety of layouts and damping mechanisms, each of which have certain advantages and disadvantages.\n\nMachines with a digital display calculate the user's power by measuring the speed of the flywheel during the stroke and then recording the rate at which it decelerates during the recovery. Using this and the known moment of inertia of the flywheel, the computer is able to calculate speed, power, distance and energy usage. Some ergometers can be connected to a personal computer using software, and data on individual exercise sessions can be collected and analysed. In addition, some software packages allows users to connect multiple ergometers either directly or over the internet for virtual races and workouts.\n\nMotion type\n\nThere are three possible designs to allow the foot stretcher (with flywheel) and handle to move relatively nearer and apart from each other.\n\nThe first option is the most common, with the foot stretcher and flywheel both fixed, with only the seat sliding on a rail. This is generally analogous to the seat sliding on rails in the boat. Commonly called a 'Fixed head' ergometer.\n\nThe second option is where both the seat and the foot stretcher slide on a rail. This is analogous to both the seat sliding on the boat, and the boat sliding relative to the rower, on the water. The relative movement of seat and flywheel are similar to the result of the rower moving at steadier average speed while the boat's speed varies much more relative to the rower. Commonly called a 'Floating head' ergometer.\n\nThe third option has the seat fixed. Only the foot stretcher slides backward and away from the rower.\n\nIn addition, some indoor rowers include a pivoting handle or handles (as opposed to a simple chain) in order to more completely simulate the action of rowing or sculling. Such machines are known as \"rowing simulators\".\n\nDamper type\n\nPiston resistance comes from hydraulic cylinders that are attached to the handles of the rowing machine. The length of the rower handles on this class of rower is typically adjustable, however, during the row the handle length is fixed which in turn fixes the trajectory that the hands must take on the stroke and return, thus making the stroke less accurate than is possible on the other types of resistance models where it is possible to emulate the difference in hand height on the stroke and return. Furthermore, many models in this class have a fixed seat position that eliminates the leg drive which is the foundation of competitive on water rowing technique. Because of the compact size of the pistons and mechanical simplicity of design, these models are typically not as large or as expensive as the others types.\n\nBraked flywheel resistance models comprise magnetic, air and water resistance rowers. These machines are mechanically similar since all three types use a handle connected to a flywheel by rope, chain, or strap to provide resistance to the user – the types differ only in braking mechanism. Because the handle is attached to the resistance source by rope or similarly flexible media, the trajectory of the hands in the vertical plane is free making it possible for the rower to emulate the hand height difference between the stroke and the return. Most of these models have the characteristic sliding seat typical of competitive on-the-water boats.\n\nMagnetic resistance models control resistance by means of electromagnets that engage a mechanical brake with the flywheel. The magnetic braking system is quieter than the other braked flywheel types. The braking resistance is adjustable and energy can be accurately measured on this type of rower. The drawback of this type of resistance mechanism is that the resistance is constant; rowers using air or water resistance more accurately simulate actual rowing, where the resistance increases the harder the handle is pulled.\n\nAir resistance models use fanlike air-fins on the flywheel to provide the flywheel braking needed to generate resistance. As the flywheel is spun faster, the air resistance increases. A vent can be used to adjust the airflow to the air fins and thus increase or decrease the resistance. The energy dissipated can be accurately calculated given the known moment of inertia of the flywheel and a tachometer to measure the deceleration of the flywheel. Air resistance rowing machines are most often used by sport rowers (particularly during the off season and inclement weather) and competitive indoor rowers.\n\nWater resistance models consist of a paddle revolving in an enclosed tank of water. The mass and drag of the moving water creates the resistance. Proponents claim that this approach results in a more realistic action than possible with air or magnetic type machines.\n\nRowing machines with monitors calculate performance using an algorithm unique to the individual manufacturer; it will be affected by the type of resistance used and other factors.\n\nExercise\n\nIndoor rowing primarily works the cardiovascular systems with typical workouts consisting of steady pieces of 20–40 minutes, although the standard trial distance for record attempts is 2000 m, which can take from five and a half minutes (best elite rowers) to nine minutes or more. Like other forms of cardio focused exercise, interval training is also commonly used in indoor rowing. While cardio-focused, rowing also stresses many muscle groups throughout the body anaerobically, thus rowing is often referred to as a strength-endurance sport.\n\nUnlike high impact exercises, which can damage knees and the connective tissues of the lower body, rowing's most common injury site is the lower back. Proper technique is a necessity for staying injury free, with a focus on both mechanics and breathing, as correct rhythm, exhaling on the drive and inhaling on the recovery, is a stabilizing force for the upper body. Non-rowers commonly overemphasize the muscles of the upper body, while correct technique uses the large muscle of the thighs to drive much of the stroke. Also, good technique requires that the angle of the upper body is never too far forward, nor too far back, both of which jeopardize the lower back and compression injuries on the knees and hip flexor muscles.\n\nIn addition to the high levels of fitness attained, rowing is an intense calorie-burning exercise.  Although rowers with less ability and training will burn fewer calories, the ergometer is an excellent tool for use in a weight-loss program.\n\nThe standard measurement of speed on an ergometer is generally known as the \"split\", or the amount of time in minutes and seconds required to travel 500 m at the current pace — a split of 2:00 represents a speed of two minutes per 500 metres, or about . The split does not necessarily correspond to how many strokes the rower takes (the \"rating\") since strokes can vary in power.\n\nErgometer testing\n\nErgometer tests are used by rowing coaches to evaluate rowers and is part of athlete selection for many senior and junior national rowing teams. During a test, rowers will row a set distance and try to clock the fastest time possible, or a set time and try to row the longest distance possible. The most common distances for erg tests are 2000, 5000, 6000 or 10000 metres. The most common times for erg tests are 3 min, 5 min, 20 min, 30 min, and 1 hour. Results of these tests are an objective measure of an athlete's fitness; however, weight, technique and team coordination also impact performance in a boat, thus assembling a crew based purely on erg scores is not an optimal strategy. In fact it is not unheard of for teams that are considerably faster on the ergometer to be beaten on the water.\n\nRowing technique\n\nRowing technique on the erg broadly follows the same pattern as that of a normal rowing stroke on water, but with minor modifications: it is not necessary to \"tap down\" at the finish, since there are no blades to extract from water; but many who also row on water do this anyway. Sometimes an exaggerated finish, pulling the hands further up the chest than would be possible on water, is used.\n\nRowing on an ergometer requires four basics phases to complete one stroke; the catch, the drive, the finish and the recovery. The catch is the initial part of the stroke. The drive is where the power from the rower is generated while the finish is the final part of the stroke. Then, the recovery is the initial phase to begin taking a new stroke. The phases repeat until a time duration or a distance is completed.\n\nCatch\n\nKnees are bent with the shins in a vertical position. The back should be roughly parallel to the thigh without hyperflexion (leaning forward too far). The arms and shoulders should be extended forward and relaxed. The arms should be level.\n\nDrive\n\nThe drive is initiated by the extension of the legs; the body remains in the catch posture at this point of the drive. As the legs continue to full extension, the rower engages the core to begin the motion of the body levering backward, adding to the work of the legs. When the legs are flat, the rower begins to pull the handle toward the chest with their arms while keeping their arms straight and parallel to the floor.\n\nFinish (or release)\n\nThe legs are at full extension and flat. The shoulders are slightly behind the pelvis, and the arms are in full contraction with the elbows bent and hands against the chest below the nipples. The back of the rower is still maintained in an upright posture and wrists should be flat.\n\nRecovery\n\nThe recovery is a slow slide back to the initial part of the stroke, it gives the rower time to recover from the previous stroke. During the recovery the actions are in reverse order of the drive. The arms are fully extended so that they are straight. The torso is engaged to move forward back over the pelvis. Weight transfers from the back of the seat to the front of the seat at this time. When the hands come over the knees, the legs contract back towards the foot stretcher. Slowly the back becomes more parallel to the thighs until the recovery becomes the catch.\n\nCompetitions\n\nA large number of indoor rowing competitions are held all over the world, including the indoor rowing world championships (also known as CRASH-B Sprints) held in Boston, Massachusetts, United States in February and the British Indoor Rowing Championships held in Birmingham, England in November; both are rowed on Concept2s. The core event for most competitions is the individual 2000-m; less common are the mile (e.g., Evesham), the 2500-m (e.g., Basingstoke—also the original distance of the CRASH-B Sprints). Many competitions also include a sprint event (100m-500m) and sometimes team relay events. The machines used are consistent although the resistance may be adjusted. The resistance adjustment does not affect the energy measurement so a result on one machine can be fairly compared with results on other machines regardless of resistance level.\n\nMost competitions are organized into categories based on sex, age, and weight class. While the fastest times are generally achieved by rowers between 20 and 40 years old, teenagers and rowers over 90 are common at competitions. There is a nexus between performance on-water and performance on the ergometer, with open events at the World Championships often being dominated by elite on-water rowers. Former men's Olympic single scull champions Pertti Karppinen and Rob Waddell and five-time Gold Medalist Sir Steven Redgrave have all won world championships or set world records in indoor rowing.\n\nIn addition to live venue competitions, many erg racers compete by internet, either offline by posting scores to challenges, or live online races facilitated by computer connection. Online Challenges sponsored by Concept2 include the annual ultra-rowing challenge, the Virtual Team Challenge.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Indoor rower" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15077" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An indoor rower, or rowing machine, is a machine used to simulate the action of watercraft rowing for the purpose of exercise or training for rowing. Indoor rowing has become established as a sport in its own right. The term also refers to a participant in this sport.\n\nModern indoor rowers are often known as ergometers (colloquially erg or ergo), an ergometer being a device which measures the amount of work performed. The indoor rower is calibrated to measure the amount of energy the rower is using through their use of the equipment.\n\nHistory\n\n \nChabrias, an Athenian admiral of the 4th century BC, introduced the first rowing machines as supplemental military training devices. \"To train inexperienced oarsmen, Chabrias built wooden rowing frames on shore where beginners could learn technique and timing before they went on board ship.\" John R. Hale, \"Lords of the Sea: The Epic Story of the Athenian Navy and the Birth of Democracy\"\n\nEarly rowing machines are known to have existed from the mid-1800s, a US patent being issued to W.B. Curtis in 1872 for a particular hydraulic based damper design. Machines using linear pneumatic resistance were common around 1900—one of the most popular was the Narragansett hydraulic rower, manufactured in Rhode Island from around 1900–1960. However they did not simulate actual rowing very accurately nor measure power output.\n\nIn the 1950s and 1960s, coaches in many countries began using specially made rowing machines for training and improved power measurement. One original design incorporated a large, heavy, solid iron flywheel with a mechanical friction brake, developed by John Harrison of Leichhardt Rowing Club in Sydney, later to become a professor of mechanical engineering at the University of New South Wales. Harrison, a dual Australian champion beach sprinter who went on to row in the coxless four at the 1956 Melbourne Olympics, had been introduced to rowing after a chance meeting with one of the fathers of modern athletic physiological training and testing, and the coach of the Leichhardt Guinea Pigs, Professor Frank Cotton. Professor Cotton had produced a rudimentary friction-based machine for evaluating potential rowers by exhausting them, without any pretence of accurately measuring power output. Harrison realised the importance of using a small braking area with a non-absorbent braking material, combined with a large flywheel. The advantage of this design (produced by Ted Curtain Engineering, Curtain being a fellow Guinea Pig) was the virtual elimination of factors able to interfere with accurate results—for instance ambient humidity or temperature. The Harrison-Cotton machine represents the very first piece of equipment able to accurately quantify human power output; power calculation within an accuracy range as achieved by his machine of less than 1% remains an impressive result today. The friction brake was adjusted according to a rower's weight to give an accurate appraisal of boat-moving ability (drag on a boat is proportional to weight). Inferior copies of Harrison's machine were produced in several countries utilising a smaller flywheel and leather straps—unfortunately the leather straps were sensitive to humidity, and the relatively large braking area made results far less accurate than Harrison's machine. The weight correction factor tended to make them unpopular among rowers of the time. Harrison, arguably the father of modern athletic power evaluation, died in February 2012.\n\nIn the 1970s, the Gjessing-Nilson ergometer from Norway used a friction brake mechanism with industrial strapping applied over the broad rim of the flywheel. Weights hanging from the strap ensured that an adjustable and predictable friction could be calculated. The cord from the handle mechanism ran over a helical pulley with varying radius, thereby adjusting the gearing and speed of the handle in a similar way to the changing mechanical gearing of the oar through the stroke, derived from changes in oar angle and other factors. This machine was for many years the internationally accepted standard for measurement.\n\nThe first air resistance ergometers were introduced around 1980 by Repco.\n\nThe Concept2 ergometer was introduced in 1980 by the Dreissigacker brothers. The first, the Model A, was a fixed-frame sliding-seat design using a bicycle wheel with fins attached for air resistance. The Model B, introduced in 1986, introduced a solid cast flywheel (now enclosed by a cage) and the first digital performance monitor, which proved revolutionary. This machine's capability of accurate calibration combined with easy transportability spawned the sport of competitive indoor rowing, and revolutionised training and selection procedures for watercraft rowing. The later Models C (1993) and D (2003) became some of the best-selling fitness equipment pieces of all time.\n\nDesign summary\n\nAll rowing-machine designs consist of an energy damper or braking mechanism connected to a chain and/or handle. A foot stretcher (where rowers places their feet) is attached to the same mounting as the energy damper. Most include a rail which either the seat or the mechanism slide upon. Different machines have a variety of layouts and damping mechanisms, each of which have certain advantages and disadvantages.\n\nMachines with a digital display calculate the user's power by measuring the speed of the flywheel during the stroke and then recording the rate at which it decelerates during the recovery. Using this and the known moment of inertia of the flywheel, the computer is able to calculate speed, power, distance and energy usage. Some ergometers can be connected to a personal computer using software, and data on individual exercise sessions can be collected and analysed. In addition, some software packages allows users to connect multiple ergometers either directly or over the internet for virtual races and workouts.\n\nMotion type\n\nThere are three possible designs to allow the foot stretcher (with flywheel) and handle to move relatively nearer and apart from each other.\n\nThe first option is the most common, with the foot stretcher and flywheel both fixed, with only the seat sliding on a rail. This is generally analogous to the seat sliding on rails in the boat. Commonly called a 'Fixed head' ergometer.\n\nThe second option is where both the seat and the foot stretcher slide on a rail. This is analogous to both the seat sliding on the boat, and the boat sliding relative to the rower, on the water. The relative movement of seat and flywheel are similar to the result of the rower moving at steadier average speed while the boat's speed varies much more relative to the rower. Commonly called a 'Floating head' ergometer.\n\nThe third option has the seat fixed. Only the foot stretcher slides backward and away from the rower.\n\nIn addition, some indoor rowers include a pivoting handle or handles (as opposed to a simple chain) in order to more completely simulate the action of rowing or sculling. Such machines are known as \"rowing simulators\".\n\nDamper type\n\nPiston resistance comes from hydraulic cylinders that are attached to the handles of the rowing machine. The length of the rower handles on this class of rower is typically adjustable, however, during the row the handle length is fixed which in turn fixes the trajectory that the hands must take on the stroke and return, thus making the stroke less accurate than is possible on the other types of resistance models where it is possible to emulate the difference in hand height on the stroke and return. Furthermore, many models in this class have a fixed seat position that eliminates the leg drive which is the foundation of competitive on water rowing technique. Because of the compact size of the pistons and mechanical simplicity of design, these models are typically not as large or as expensive as the others types.\n\nBraked flywheel resistance models comprise magnetic, air and water resistance rowers. These machines are mechanically similar since all three types use a handle connected to a flywheel by rope, chain, or strap to provide resistance to the user – the types differ only in braking mechanism. Because the handle is attached to the resistance source by rope or similarly flexible media, the trajectory of the hands in the vertical plane is free making it possible for the rower to emulate the hand height difference between the stroke and the return. Most of these models have the characteristic sliding seat typical of competitive on-the-water boats.\n\nMagnetic resistance models control resistance by means of electromagnets that engage a mechanical brake with the flywheel. The magnetic braking system is quieter than the other braked flywheel types. The braking resistance is adjustable and energy can be accurately measured on this type of rower. The drawback of this type of resistance mechanism is that the resistance is constant; rowers using air or water resistance more accurately simulate actual rowing, where the resistance increases the harder the handle is pulled.\n\nAir resistance models use fanlike air-fins on the flywheel to provide the flywheel braking needed to generate resistance. As the flywheel is spun faster, the air resistance increases. A vent can be used to adjust the airflow to the air fins and thus increase or decrease the resistance. The energy dissipated can be accurately calculated given the known moment of inertia of the flywheel and a tachometer to measure the deceleration of the flywheel. Air resistance rowing machines are most often used by sport rowers (particularly during the off season and inclement weather) and competitive indoor rowers.\n\nWater resistance models consist of a paddle revolving in an enclosed tank of water. The mass and drag of the moving water creates the resistance. Proponents claim that this approach results in a more realistic action than possible with air or magnetic type machines.\n\nRowing machines with monitors calculate performance using an algorithm unique to the individual manufacturer; it will be affected by the type of resistance used and other factors.\n\nExercise\n\nIndoor rowing primarily works the cardiovascular systems with typical workouts consisting of steady pieces of 20–40 minutes, although the standard trial distance for record attempts is 2000 m, which can take from five and a half minutes (best elite rowers) to nine minutes or more. Like other forms of cardio focused exercise, interval training is also commonly used in indoor rowing. While cardio-focused, rowing also stresses many muscle groups throughout the body anaerobically, thus rowing is often referred to as a strength-endurance sport.\n\nUnlike high impact exercises, which can damage knees and the connective tissues of the lower body, rowing's most common injury site is the lower back. Proper technique is a necessity for staying injury free, with a focus on both mechanics and breathing, as correct rhythm, exhaling on the drive and inhaling on the recovery, is a stabilizing force for the upper body. Non-rowers commonly overemphasize the muscles of the upper body, while correct technique uses the large muscle of the thighs to drive much of the stroke. Also, good technique requires that the angle of the upper body is never too far forward, nor too far back, both of which jeopardize the lower back and compression injuries on the knees and hip flexor muscles.\n\nIn addition to the high levels of fitness attained, rowing is an intense calorie-burning exercise.  Although rowers with less ability and training will burn fewer calories, the ergometer is an excellent tool for use in a weight-loss program.\n\nThe standard measurement of speed on an ergometer is generally known as the \"split\", or the amount of time in minutes and seconds required to travel 500 m at the current pace — a split of 2:00 represents a speed of two minutes per 500 metres, or about . The split does not necessarily correspond to how many strokes the rower takes (the \"rating\") since strokes can vary in power.\n\nErgometer testing\n\nErgometer tests are used by rowing coaches to evaluate rowers and is part of athlete selection for many senior and junior national rowing teams. During a test, rowers will row a set distance and try to clock the fastest time possible, or a set time and try to row the longest distance possible. The most common distances for erg tests are 2000, 5000, 6000 or 10000 metres. The most common times for erg tests are 3 min, 5 min, 20 min, 30 min, and 1 hour. Results of these tests are an objective measure of an athlete's fitness; however, weight, technique and team coordination also impact performance in a boat, thus assembling a crew based purely on erg scores is not an optimal strategy. In fact it is not unheard of for teams that are considerably faster on the ergometer to be beaten on the water.\n\nRowing technique\n\nRowing technique on the erg broadly follows the same pattern as that of a normal rowing stroke on water, but with minor modifications: it is not necessary to \"tap down\" at the finish, since there are no blades to extract from water; but many who also row on water do this anyway. Sometimes an exaggerated finish, pulling the hands further up the chest than would be possible on water, is used.\n\nRowing on an ergometer requires four basics phases to complete one stroke; the catch, the drive, the finish and the recovery. The catch is the initial part of the stroke. The drive is where the power from the rower is generated while the finish is the final part of the stroke. Then, the recovery is the initial phase to begin taking a new stroke. The phases repeat until a time duration or a distance is completed.\n\nCatch\n\nKnees are bent with the shins in a vertical position. The back should be roughly parallel to the thigh without hyperflexion (leaning forward too far). The arms and shoulders should be extended forward and relaxed. The arms should be level.\n\nDrive\n\nThe drive is initiated by the extension of the legs; the body remains in the catch posture at this point of the drive. As the legs continue to full extension, the rower engages the core to begin the motion of the body levering backward, adding to the work of the legs. When the legs are flat, the rower begins to pull the handle toward the chest with their arms while keeping their arms straight and parallel to the floor.\n\nFinish (or release)\n\nThe legs are at full extension and flat. The shoulders are slightly behind the pelvis, and the arms are in full contraction with the elbows bent and hands against the chest below the nipples. The back of the rower is still maintained in an upright posture and wrists should be flat.\n\nRecovery\n\nThe recovery is a slow slide back to the initial part of the stroke, it gives the rower time to recover from the previous stroke. During the recovery the actions are in reverse order of the drive. The arms are fully extended so that they are straight. The torso is engaged to move forward back over the pelvis. Weight transfers from the back of the seat to the front of the seat at this time. When the hands come over the knees, the legs contract back towards the foot stretcher. Slowly the back becomes more parallel to the thighs until the recovery becomes the catch.\n\nCompetitions\n\nA large number of indoor rowing competitions are held all over the world, including the indoor rowing world championships (also known as CRASH-B Sprints) held in Boston, Massachusetts, United States in February and the British Indoor Rowing Championships held in Birmingham, England in November; both are rowed on Concept2s. The core event for most competitions is the individual 2000-m; less common are the mile (e.g., Evesham), the 2500-m (e.g., Basingstoke—also the original distance of the CRASH-B Sprints). Many competitions also include a sprint event (100m-500m) and sometimes team relay events. The machines used are consistent although the resistance may be adjusted. The resistance adjustment does not affect the energy measurement so a result on one machine can be fairly compared with results on other machines regardless of resistance level.\n\nMost competitions are organized into categories based on sex, age, and weight class. While the fastest times are generally achieved by rowers between 20 and 40 years old, teenagers and rowers over 90 are common at competitions. There is a nexus between performance on-water and performance on the ergometer, with open events at the World Championships often being dominated by elite on-water rowers. Former men's Olympic single scull champions Pertti Karppinen and Rob Waddell and five-time Gold Medalist Sir Steven Redgrave have all won world championships or set world records in indoor rowing.\n\nIn addition to live venue competitions, many erg racers compete by internet, either offline by posting scores to challenges, or live online races facilitated by computer connection. Online Challenges sponsored by Concept2 include the annual ultra-rowing challenge, the Virtual Team Challenge. Indoor rower. http://en.wikipedia.org/?curid=15077."
  }
}
