{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7786",
  "eid" : "e3658390-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778461257,
  "textBody" : "The Challenger Deep is the deepest known point in the Earth's seabed hydrosphere, with a depth of 10898 to by direct measurement from submersibles, and slightly more by sonar bathymetry. It is in the Pacific Ocean, at the southern end of the Mariana Trench near the Mariana Islands group. The Challenger Deep is a relatively small slot-shaped depression in the bottom of a considerably larger crescent-shaped oceanic trench, which itself is an unusually deep feature in the ocean floor. Its bottom is about 7 mi long and 1 mi wide, with gently sloping sides. The closest land to the Challenger Deep is Fais Island (one of the outer islands of Yap), 287 km southwest, and Guam, 304 km to the northeast. It is located in the ocean territory of the Federated States of Micronesia,  from its border with ocean territory associated with Guam.The Colbert Report, airdate: 2012 April 12, interview with James Cameron\n\nThe depression is named after the British Royal Navy survey ship HMS Challenger, whose expedition of 1872–1876 made the first recordings of its depth. According to the August 2011 version of the GEBCO Gazetteer of Undersea Feature Names, the location and depth of the Challenger Deep are  and 10920 m ±10 m.\n\nJune 2009 sonar mapping of the Challenger Deep by the Simrad EM120 (sonar multibeam bathymetry system for 300–11,000 m deep water mapping) aboard the RV Kilo Moana indicated a depth of 10971 m. The sonar system uses phase and amplitude bottom detection, with a precision of 0.2% to 0.5% of water depth; this is an error of about 22 to at this depth. Further soundings made by the US Center for Coastal & Ocean Mapping in October 2010 are in agreement with this figure, preliminarily placing the deepest part of the Challenger Deep at 10994 m, with an estimated vertical uncertainty of ±40 m. A 2014 study concludes that with the best of 2010 multibeam echosounder technologies a depth uncertainty of ±25 m (95% confidence level) on 9 degrees of freedom and a positional uncertainty of ±20 to (2drms) remain and the location of the deepest depth recorded in the 2010 mapping is 10984 m at  ().\n\nOnly four descents have ever been achieved. The first descent by any vehicle was by the manned bathyscaphe Trieste in 1960. This was followed by the unmanned ROVs Kaikō in 1995 and Nereus in 2009. In March 2012 a manned solo descent was made by the deep-submergence vehicle Deepsea Challenger.\nThese expeditions measured very similar depths of 10898 to.\n\nHistory of depth mapping from the surface\n\nOver many years, the search for the point of maximum depth has involved many different vessels.\n\n*The HMS Challenger expedition (December 1872 – May 1876) first sounded the depths now known as the Challenger Deep. This first sounding was made on 23 March 1875 at station 225. The reported depth was 4475 fathom at , based on two separate soundings.\n*A 1912 book, The Depths of the Ocean by Sir John Murray, records the depth of the Challenger Deep as 31614 ft, reporting the sounding taken by the converted navy collier USS Nero in 1899. Murray was one of the expedition scientists.[http://www.19thcenturyscience.org/HMSC/HMSC-Reports/1912-Murray/htm/doc131.html Page 131] of Murray's book refers to the Challenger Deep.\n*In 1951, about 75 years after its original discovery, the entire Mariana Trench was surveyed by a second Royal Navy vessel, captained by George Stephen Ritchie (later Rear Admiral Ritchie); this vessel was also named HMS Challenger, after the original expedition ship. This survey recorded the deepest part of the trench using echo sounding, a more precise and easier way to measure depth than the sounding equipment and drag lines used in the original expedition.  A depth of 5960 fathom was measured at .\n\n*The maximum surveyed depth of the Challenger Deep was reported in 1957 by the Soviet Research vessel  recording a spot 11034 m ±50 m deep at . It was dubbed the Mariana Hollow and is listed in many reference sources, including the Encyclopædia Britannica, articles in National Geographic[http://news.nationalgeographic.com/news/2005/02/0203_050203_deepest.html \"Life Is Found Thriving at Ocean's Deepest Point\"], National Geographic News, 3 February 2005 and on maps. The pressure at this depth is approximately 1,099 times that at the surface, or 111 MPa.\n*In 1959, the US Navy research vessel RV Stranger using bomb-sounding surveyed a maximum depth of 10915 m ±10 m at .\n*In 1962, the US Navy research vessel RV Spencer F. Baird using a frequency-controlled  depth recorder surveyed a maximum depth of 10915 m ±10 m at .\n*In 1975 and 1980, the US Navy research vessel RV Thomas Washington using a precision depth recorder with satellite positioning surveyed a maximum depth of 10915 m ±10 m at .\n*In 1984, the survey vessel Takuyo from the Hydrographic Department of Japan, used a narrow, multibeam echo sounder to take a measurement of 10924 m  ±10 m at .\n\n*In 1998, a regional bathymetric survey of the Challenger Deep was conducted by the Deep Sea Research Vessel RV Kairei, from the Japan Agency for Marine-Earth Science and Technology, using a SeaBeam 2112 multibeam echosounder. The regional bathymetric map made from the data obtained in 1998 shows that the greatest depths in the eastern, central, and western depressions are 10922 m  ±74 m, 10898 m  ±62 m, and 10908 m  ±36 m, respectively, making the eastern depression the deepest of the three.\n*In 1999 and 2002, the RV Kairei revisited the Challenger Deep. The cross track survey in the 1999 RV Kairei cruise shows that the greatest depths in the eastern, central, and western depressions are 10920 m  ±10 m, 10894 m  ±14 m, and 10907 m  ±13 m, respectively, which supports the results of the 1998 survey. The detailed grid survey in 2002 showed that the deepest site is located in the eastern part of the eastern depression around , with a depth of 10920 m  ±5 m, about 290 m southeast of the deepest site determined by the survey vessel Takuyo in 1984 and about 240 m east of the deepest place determined by the 1998 RV Kairei survey.\n*On 1 June 2009, sonar mapping of the Challenger Deep by the Kongsberg Simrad EM 120 sonar multibeam bathymetry system for deep water (300 – 11,000 metres) mapping aboard the RV Kilo Moana (mothership of the Nereus underwater vehicle) indicated a depth of 10971 m. The sonar system uses phase and amplitude bottom detection, which is capable of an accuracy of 0.2% to 0.5% of water depth across the entire swath.[http://www.kongsberg-simrad.de/pdf/faecherlot_em120_eng_broch.pdf EM 120 sonar multibeam bathymetry system brochure] In 2014 the multibeam bathymetry data of this sonar mapping have yet to be publicly released, so the data are not available for comparisons with other soundings.\n*On 7 October 2010, further sonar mapping of the Challenger Deep area was conducted by the US Center for Coastal & Ocean Mapping/Joint Hydrographic Center (CCOM/JHC) aboard the USNS Sumner (T-AGS-61). The results were reported in December 2011 at the annual American Geophysical Union fall meeting. Using a Kongsberg Maritime EM 122 multibeam echosounder system coupled to positioning equipment that can determine latitude and longitude up to 50 cm accuracy, from thousands of individual soundings around the deepest part the CCOM/JHC team preliminary determined that the Challenger Deep has a maximum depth of 10994 m at , with an estimated vertical uncertainty of ±40 m at 2 standard deviations (≈ 95.4%) confidence level.  A secondary deep with a depth of 10951 m was located at approximately  to the east at  in the Mariana Trench.[http://www.km.kongsberg.com/ks/web/nokbg0240.nsf/AllWeb/01FB0F22974EA50FC125715E002B2143?OpenDocument EM 122 Multibeam echosounder][http://www.km.kongsberg.com/ks/web/nokbg0397.nsf/AllWeb/E016DF00EBFC2964C12571B1003F9DDA/$file/306105aa_em122ds_lr.pdf?OpenElement EM 122 sonar multibeam bathymetry system brochure][http://www.ldeo.columbia.edu/res/pi/MB-System/formatdoc/EM_Datagram_Formats_RevP.pdf?OpenElement Instruction manual EM Series (EM 120 & EM 122) Multibeam echo sounders] \n\nIn 2014, a study was conducted regarding the determination of the depth and location of the Challenger Deep based on data collected previous to and during the 2010 sonar mapping of the Mariana Trench with a Kongsberg Maritime EM 122 multibeam echosounder system aboard the USNS Sumner (T-AGS-61). This study by James. V. Gardner et al. of the Center for Coastal & Ocean Mapping-Joint Hydrographic Center (CCOM/JHC), Chase Ocean Engineering Laboratory of the University of New Hampshire splits the measurement attempt history into three main groups: early single-beam echo sounders (1950s - 1970's), early multibeam echo sounders (1980s - 21st century), and modern (i.e., post-GPS, high-resolution) multibeam echo sounders. Taking uncertainties in depth measurements and position estimation into account the raw data of the 2010 bathymetry of the Challenger Deep vicinity consisting of 2,051,371 soundings from eight survey lines was analyzed. The study concludes that with the best of 2010 multibeam echosounder technologies after the analysis a depth uncertainty of ±25 m (95% confidence level) on 9 degrees of freedom and a positional uncertainty of ±20 to (2drms) remain and the location of the deepest depth recorded in the 2010 mapping is 10984 m at . The depth measurement uncertainty is a composite of measured uncertainties in the spatial variations in sound-speed through the water volume, the ray-tracing and bottom-detection algorithms of the multibeam system, the accuracies and calibration of the motion sensor and navigation systems, estimates of spherical spreading, attenuation throughout the water volume, and so forth.\n\nThe 2009 and 2010 maximal depths were not confirmed by the series of dives Nereus made to the bottom during an expedition in May–June 2009. The direct descent measurements by the four expeditions which have reported from the bottom, have fixed depths in a narrow range from 10,916 m (Trieste) to 10,911 m (Kaikō), to 10,902 m (Nereus) to 10,898 m (Deepsea Challenger) Although an attempt was made to correlate locations, it could not be absolutely certain that Nereus (or the other descents) reached exactly the same points found to be maximally deep by the sonar/echo sounders of previous mapping expeditions, even though one of these echo soundings was made by Nereus mothership.\n\nDescents\n\nManned descents\n\nTrieste\n\nOn 23 January 1960, the Swiss-designed Trieste, originally built in Italy and acquired by the U.S. Navy, descended to the ocean floor in the trench manned by Jacques Piccard (who co-designed the submersible along with his father, Auguste Piccard) and USN Lieutenant Don Walsh. Their crew compartment was inside a spherical pressure vessel, which was a heavy-duty replacement (of the Italian original) built by Krupp Steel Works of Essen, Germany. Their descent took almost five hours and the two men spent barely twenty minutes on the ocean floor before undertaking the three-hour-and-fifteen-minute ascent. Their early departure from the ocean floor was due to their concern over a crack in the outer window caused by the temperature differences during their descent. The measured depth at the bottom was measured with a manometer at 10916 m ±5 m.\n\nDeepsea Challenger \n\nOn 26 March 2012 (local time), Canadian film director James Cameron made a solo manned descent in the DSV Deepsea Challenger to the bottom of the Challenger Deep.\nAt approximately 05:15 ChST on 26 March (19:15 UTC on 25 March), the descent began.\nAt 07:52 ChST (21:52 UTC), Deepsea Challenger arrived at the bottom. The descent lasted 2 hours and 36 minutes and the recorded depth was  when Deepsea Challenger touched down.\nCameron had planned to spend about six hours near the ocean floor exploring but decided to start the ascent to the surface after only 2 hours and 34 minutes.  The time on the bottom was shortened because a hydraulic fluid leak in the lines controlling the manipulator arm obscured the visibility out the only viewing port.  It also caused the loss of the submersible's starboard thrusters.  At around 12:00 ChST (02:00 UTC on 26 March), the Deepsea Challenger website says the sub resurfaced after a 90-minute ascent, although Paul Allen's tweets indicate the ascent took only about 67 minutes.\nDuring a post-dive press conference Cameron said: \"I landed on a very soft, almost gelatinous flat plain. Once I got my bearings, I drove across it for quite a distance ... and finally worked my way up the slope.\" The whole time, Cameron said, he didn't see any fish, or any living creatures more than an inch (2.54 cm) long: \"The only free swimmers I saw were small amphipods\"—shrimplike bottom-feeders.\n\nPlanned manned descents\n\nSeveral other manned expeditions are planned. These include:\n*Triton Submarines, a Florida-based company that designs and manufactures private submarines, whose vehicle, Triton 36000/3, will carry a crew of three to the seabed in 120 minutes;\n*Virgin Oceanic, sponsored by Richard Branson's Virgin Group, is developing a submersible designed by Graham Hawkes, DeepFlight Challenger,Virgin Oceanic, [http://www.virginoceanic.com/team/operations-team/ Operations Team]  (Retrieved 25 March 2012) with which the solo pilot will take 140 minutes to reach the seabed;\n* DOER Marine, a San Francisco Bay Area based marine technology company established in 1992, that is developing a vehicle, Deepsearch (and Ocean Explorer HOV Unlimited), with some support from Google's Eric Schmidt with which a crew of two or three will take 90 minutes to reach the seabed, as the program Deep Search.\n\nUnmanned descents\n\nKaikō\n\nOn 24 March 1995, the Japanese robotic deep-sea probe Kaikō broke the depth record for unmanned probes when it reached close to the surveyed bottom of the Challenger Deep. Created by the Japan Agency for Marine-Earth Science and Technology (JAMSTEC), it was one of the few unmanned deep-sea probes in operation that could dive deeper than 6000 m. The manometer measured depth of 10911 m ±3 m at  for the Challenger Deep is believed to be the most accurate measurement taken yet. Kaikō also collected sediment cores containing marine organisms from the bottom of the deep. Kaikō made many unmanned descents to the Mariana Trench during three expeditions in 1995, 1996 and 1998. The greatest depth measured by Kaikō in 1996 was 10898 m at  and in 1998 10907 m at . It was lost at sea off Shikoku Island during Typhoon Chan-Hom on 29 May 2003.\n\nABISMO\n\nOn 3 June 2008, the Japanese robotic deep-sea probe ABISMO (Automatic Bottom Inspection and Sampling Mobile) reached the bottom of the Mariana Trench about 150 km east of the Challenger Deep and collected core samples of the deep sea sediment and water samples of the water column. Created by the Japan Agency for Marine-Earth Science and Technology (JAMSTEC), it was the only unmanned deep-sea probe in use that could dive deeper than 10000 m after that of Nereus. During ABISMOs deepest Mariana Trench dive its manometer measured a depth of 10258 m ±3 mhttp://www.jamstec.go.jp/e/about/press_release/20080616/ “ABISMO\", Automatic Bottom Inspection and Sampling Mobile, Succeeds in World’s First Multiple Vertical Sampling from Mid-ocean, Sea Floor and Sub-seafloor over Depth of 10,000 m in Mariana Trench June 16, 2008 Japan Agency for Marine-Earth Science and Technology\n\nNereus\n\nOn 31 May 2009 the United States sent the Nereus hybrid remotely operated vehicle (HROV) to the Challenger Deep. Nereus thus became the first vehicle to reach the Mariana Trench since 1998 and the deepest-diving vehicle then in operation. Project manager and developer Andy Bowen heralded the achievement as \"the start of a new era in ocean exploration\". Nereus, unlike Kaikō, did not need to be powered or controlled by a cable connected to a ship on the ocean surface.\n\nNereus spent over 10 hours at the bottom of the Challenger Deep and measured a depth of 10902 m at , while sending live video and data back to its mothership RV Kilo Moana at the surface and collecting geological and biological samples from the Challenger Deep bottom with its manipulator arm for further scientific analysis.\n\nThe Nereus was operated by the Woods Hole Oceanographic Institution. It was lost on May 10, 2014.http://www.bbc.com/news/science-environment-27374326\n\nHaidou-1\n\nOn 23 May 2016 the Chinese submersible Haidou-1 dove to a depth of 10767 m in the Mariana Trench. This autonomous and remotely operated vehicle has a design depth of 11000 m.[http://www.chinadailyasia.com/nation/2016-08/23/content_15483551.html Nitrogen experiment among breakthroughs, by Zhao Xinying, Tuesday, August 23, 2016]\n\nLifeforms\n\nThe Summary Report of the HMS Challenger expedition lists radiolaria from the two dredged samples taken when the Challenger Deep was first discovered.[http://www.19thcenturyscience.org/HMSC/HMSC-Reports/1895-Summary/htm/doc878.html],  entry on 23 March 1875. These (Nassellaria and Spumellaria) were reported in the Report on Radiolaria (1887)[http://www.19thcenturyscience.org/HMSC/HMSC-Reports/Zool-40/README.htm], Report on the Radiolaria collected by H.M.S. Challenger\nby Ernst Haeckel. written by Ernst Haeckel.\n\nOn their 1960 descent, the crew of the Trieste noted that the floor consisted of diatomaceous ooze and reported observing \"some type of flatfish\" lying on the seabed.[http://www.americanheritage.com/articles/magazine/it/1992/1/1992_1_28.shtml \"To the bottom of the sea\"] , T. A. Heppenheimer, AmericanHeritage.com\n\nMany marine biologists are now skeptical of this supposed sighting, and it is suggested that the creature may instead have been a sea cucumber.[https://www.theguardian.com/environment/2011/jan/18/james-cameron-dives-deep-avatar \"James Cameron dives deep for Avatar\"], Guardian, 18 January 2011[http://www.nature.com/news/james-cameron-heads-into-the-abyss-1.10246 \"James Cameron heads into the abyss\"], Nature, 19 March 2012 The video camera on board the Kaiko probe spotted a sea cucumber, a scale worm and a shrimp at the bottom.[https://www.newscientist.com/article/mg15220548.100-mission-to-marianas--if-mount-everest-was-dropped-into-the-worlds-deepest-trench-it-woulddrown-kaiko-hit-bottom----and-came-back-to-tell-the-tale.html \"Mission to Marianas\"], New Scientist, 2 November 1996[http://www.time.com/time/magazine/article/0,9171,983295-6,00.html \"The last frontier\"], Time, 14 August 1995 At the bottom of the Challenger deep, the Nereus probe spotted one polychaete worm (a multi-legged predator) about an inch long.[http://ns.gov.gu/geography.html Accessed 8 Oct 2009]   Geography of the ocean floor near Guam with some notes on exploration of the Challenger Deep.\n\nAn analysis of the sediment samples collected by Kaiko found large numbers of simple organisms at 10900 m. While similar lifeforms have been known to exist in shallower ocean trenches (> 7,000 m) and on the abyssal plain, the lifeforms discovered in the Challenger Deep possibly represent taxa distinct from those in shallower ecosystems.\n\nMost of the organisms collected were simple, soft-shelled foraminifera (432 species according to National Geographic), with four of the others representing species of the complex, multi-chambered genera Leptohalysis and Reophax. Eighty-five percent of the specimens were organic, soft-shelled allogromiids, which is unusual compared to samples of sediment-dwelling organisms from other deep-sea environments, where the percentage of organic-walled foraminifera ranges from 5% to 20%. As small organisms with hard, calcareous shells have trouble growing at extreme depths because of the high solubility of calcium carbonate in the pressurized water, scientists theorize that the preponderance of soft-shelled organisms in the Challenger Deep may have resulted from the typical biosphere present when the Challenger Deep was shallower than it is now. Over the course of six to nine million years, as the Challenger Deep grew to its present depth, many of the species present in the sediment died out or were unable to adapt to the increasing water pressure and changing environment. The species that survived the change in depth were the ancestors of the Challenger Deep's current denizens.\n\nOn 17 March 2013, researchers reported data that suggested microbial life forms thrive in the Challenger Deep. Other researchers reported related studies that microbes thrive inside rocks up to 1900 ft below the sea floor under 8500 ft of ocean off the coast of the northwestern United States. According to one of the researchers, \"You can find microbes everywhere — they're extremely adaptable to conditions, and survive wherever they are.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Challenger Deep" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7786" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Challenger Deep is the deepest known point in the Earth's seabed hydrosphere, with a depth of 10898 to by direct measurement from submersibles, and slightly more by sonar bathymetry. It is in the Pacific Ocean, at the southern end of the Mariana Trench near the Mariana Islands group. The Challenger Deep is a relatively small slot-shaped depression in the bottom of a considerably larger crescent-shaped oceanic trench, which itself is an unusually deep feature in the ocean floor. Its bottom is about 7 mi long and 1 mi wide, with gently sloping sides. The closest land to the Challenger Deep is Fais Island (one of the outer islands of Yap), 287 km southwest, and Guam, 304 km to the northeast. It is located in the ocean territory of the Federated States of Micronesia,  from its border with ocean territory associated with Guam.The Colbert Report, airdate: 2012 April 12, interview with James Cameron\n\nThe depression is named after the British Royal Navy survey ship HMS Challenger, whose expedition of 1872–1876 made the first recordings of its depth. According to the August 2011 version of the GEBCO Gazetteer of Undersea Feature Names, the location and depth of the Challenger Deep are  and 10920 m ±10 m.\n\nJune 2009 sonar mapping of the Challenger Deep by the Simrad EM120 (sonar multibeam bathymetry system for 300–11,000 m deep water mapping) aboard the RV Kilo Moana indicated a depth of 10971 m. The sonar system uses phase and amplitude bottom detection, with a precision of 0.2% to 0.5% of water depth; this is an error of about 22 to at this depth. Further soundings made by the US Center for Coastal & Ocean Mapping in October 2010 are in agreement with this figure, preliminarily placing the deepest part of the Challenger Deep at 10994 m, with an estimated vertical uncertainty of ±40 m. A 2014 study concludes that with the best of 2010 multibeam echosounder technologies a depth uncertainty of ±25 m (95% confidence level) on 9 degrees of freedom and a positional uncertainty of ±20 to (2drms) remain and the location of the deepest depth recorded in the 2010 mapping is 10984 m at  ().\n\nOnly four descents have ever been achieved. The first descent by any vehicle was by the manned bathyscaphe Trieste in 1960. This was followed by the unmanned ROVs Kaikō in 1995 and Nereus in 2009. In March 2012 a manned solo descent was made by the deep-submergence vehicle Deepsea Challenger.\nThese expeditions measured very similar depths of 10898 to.\n\nHistory of depth mapping from the surface\n\nOver many years, the search for the point of maximum depth has involved many different vessels.\n\n*The HMS Challenger expedition (December 1872 – May 1876) first sounded the depths now known as the Challenger Deep. This first sounding was made on 23 March 1875 at station 225. The reported depth was 4475 fathom at , based on two separate soundings.\n*A 1912 book, The Depths of the Ocean by Sir John Murray, records the depth of the Challenger Deep as 31614 ft, reporting the sounding taken by the converted navy collier USS Nero in 1899. Murray was one of the expedition scientists.[http://www.19thcenturyscience.org/HMSC/HMSC-Reports/1912-Murray/htm/doc131.html Page 131] of Murray's book refers to the Challenger Deep.\n*In 1951, about 75 years after its original discovery, the entire Mariana Trench was surveyed by a second Royal Navy vessel, captained by George Stephen Ritchie (later Rear Admiral Ritchie); this vessel was also named HMS Challenger, after the original expedition ship. This survey recorded the deepest part of the trench using echo sounding, a more precise and easier way to measure depth than the sounding equipment and drag lines used in the original expedition.  A depth of 5960 fathom was measured at .\n\n*The maximum surveyed depth of the Challenger Deep was reported in 1957 by the Soviet Research vessel  recording a spot 11034 m ±50 m deep at . It was dubbed the Mariana Hollow and is listed in many reference sources, including the Encyclopædia Britannica, articles in National Geographic[http://news.nationalgeographic.com/news/2005/02/0203_050203_deepest.html \"Life Is Found Thriving at Ocean's Deepest Point\"], National Geographic News, 3 February 2005 and on maps. The pressure at this depth is approximately 1,099 times that at the surface, or 111 MPa.\n*In 1959, the US Navy research vessel RV Stranger using bomb-sounding surveyed a maximum depth of 10915 m ±10 m at .\n*In 1962, the US Navy research vessel RV Spencer F. Baird using a frequency-controlled  depth recorder surveyed a maximum depth of 10915 m ±10 m at .\n*In 1975 and 1980, the US Navy research vessel RV Thomas Washington using a precision depth recorder with satellite positioning surveyed a maximum depth of 10915 m ±10 m at .\n*In 1984, the survey vessel Takuyo from the Hydrographic Department of Japan, used a narrow, multibeam echo sounder to take a measurement of 10924 m  ±10 m at .\n\n*In 1998, a regional bathymetric survey of the Challenger Deep was conducted by the Deep Sea Research Vessel RV Kairei, from the Japan Agency for Marine-Earth Science and Technology, using a SeaBeam 2112 multibeam echosounder. The regional bathymetric map made from the data obtained in 1998 shows that the greatest depths in the eastern, central, and western depressions are 10922 m  ±74 m, 10898 m  ±62 m, and 10908 m  ±36 m, respectively, making the eastern depression the deepest of the three.\n*In 1999 and 2002, the RV Kairei revisited the Challenger Deep. The cross track survey in the 1999 RV Kairei cruise shows that the greatest depths in the eastern, central, and western depressions are 10920 m  ±10 m, 10894 m  ±14 m, and 10907 m  ±13 m, respectively, which supports the results of the 1998 survey. The detailed grid survey in 2002 showed that the deepest site is located in the eastern part of the eastern depression around , with a depth of 10920 m  ±5 m, about 290 m southeast of the deepest site determined by the survey vessel Takuyo in 1984 and about 240 m east of the deepest place determined by the 1998 RV Kairei survey.\n*On 1 June 2009, sonar mapping of the Challenger Deep by the Kongsberg Simrad EM 120 sonar multibeam bathymetry system for deep water (300 – 11,000 metres) mapping aboard the RV Kilo Moana (mothership of the Nereus underwater vehicle) indicated a depth of 10971 m. The sonar system uses phase and amplitude bottom detection, which is capable of an accuracy of 0.2% to 0.5% of water depth across the entire swath.[http://www.kongsberg-simrad.de/pdf/faecherlot_em120_eng_broch.pdf EM 120 sonar multibeam bathymetry system brochure] In 2014 the multibeam bathymetry data of this sonar mapping have yet to be publicly released, so the data are not available for comparisons with other soundings.\n*On 7 October 2010, further sonar mapping of the Challenger Deep area was conducted by the US Center for Coastal & Ocean Mapping/Joint Hydrographic Center (CCOM/JHC) aboard the USNS Sumner (T-AGS-61). The results were reported in December 2011 at the annual American Geophysical Union fall meeting. Using a Kongsberg Maritime EM 122 multibeam echosounder system coupled to positioning equipment that can determine latitude and longitude up to 50 cm accuracy, from thousands of individual soundings around the deepest part the CCOM/JHC team preliminary determined that the Challenger Deep has a maximum depth of 10994 m at , with an estimated vertical uncertainty of ±40 m at 2 standard deviations (≈ 95.4%) confidence level.  A secondary deep with a depth of 10951 m was located at approximately  to the east at  in the Mariana Trench.[http://www.km.kongsberg.com/ks/web/nokbg0240.nsf/AllWeb/01FB0F22974EA50FC125715E002B2143?OpenDocument EM 122 Multibeam echosounder][http://www.km.kongsberg.com/ks/web/nokbg0397.nsf/AllWeb/E016DF00EBFC2964C12571B1003F9DDA/$file/306105aa_em122ds_lr.pdf?OpenElement EM 122 sonar multibeam bathymetry system brochure][http://www.ldeo.columbia.edu/res/pi/MB-System/formatdoc/EM_Datagram_Formats_RevP.pdf?OpenElement Instruction manual EM Series (EM 120 & EM 122) Multibeam echo sounders] \n\nIn 2014, a study was conducted regarding the determination of the depth and location of the Challenger Deep based on data collected previous to and during the 2010 sonar mapping of the Mariana Trench with a Kongsberg Maritime EM 122 multibeam echosounder system aboard the USNS Sumner (T-AGS-61). This study by James. V. Gardner et al. of the Center for Coastal & Ocean Mapping-Joint Hydrographic Center (CCOM/JHC), Chase Ocean Engineering Laboratory of the University of New Hampshire splits the measurement attempt history into three main groups: early single-beam echo sounders (1950s - 1970's), early multibeam echo sounders (1980s - 21st century), and modern (i.e., post-GPS, high-resolution) multibeam echo sounders. Taking uncertainties in depth measurements and position estimation into account the raw data of the 2010 bathymetry of the Challenger Deep vicinity consisting of 2,051,371 soundings from eight survey lines was analyzed. The study concludes that with the best of 2010 multibeam echosounder technologies after the analysis a depth uncertainty of ±25 m (95% confidence level) on 9 degrees of freedom and a positional uncertainty of ±20 to (2drms) remain and the location of the deepest depth recorded in the 2010 mapping is 10984 m at . The depth measurement uncertainty is a composite of measured uncertainties in the spatial variations in sound-speed through the water volume, the ray-tracing and bottom-detection algorithms of the multibeam system, the accuracies and calibration of the motion sensor and navigation systems, estimates of spherical spreading, attenuation throughout the water volume, and so forth.\n\nThe 2009 and 2010 maximal depths were not confirmed by the series of dives Nereus made to the bottom during an expedition in May–June 2009. The direct descent measurements by the four expeditions which have reported from the bottom, have fixed depths in a narrow range from 10,916 m (Trieste) to 10,911 m (Kaikō), to 10,902 m (Nereus) to 10,898 m (Deepsea Challenger) Although an attempt was made to correlate locations, it could not be absolutely certain that Nereus (or the other descents) reached exactly the same points found to be maximally deep by the sonar/echo sounders of previous mapping expeditions, even though one of these echo soundings was made by Nereus mothership.\n\nDescents\n\nManned descents\n\nTrieste\n\nOn 23 January 1960, the Swiss-designed Trieste, originally built in Italy and acquired by the U.S. Navy, descended to the ocean floor in the trench manned by Jacques Piccard (who co-designed the submersible along with his father, Auguste Piccard) and USN Lieutenant Don Walsh. Their crew compartment was inside a spherical pressure vessel, which was a heavy-duty replacement (of the Italian original) built by Krupp Steel Works of Essen, Germany. Their descent took almost five hours and the two men spent barely twenty minutes on the ocean floor before undertaking the three-hour-and-fifteen-minute ascent. Their early departure from the ocean floor was due to their concern over a crack in the outer window caused by the temperature differences during their descent. The measured depth at the bottom was measured with a manometer at 10916 m ±5 m.\n\nDeepsea Challenger \n\nOn 26 March 2012 (local time), Canadian film director James Cameron made a solo manned descent in the DSV Deepsea Challenger to the bottom of the Challenger Deep.\nAt approximately 05:15 ChST on 26 March (19:15 UTC on 25 March), the descent began.\nAt 07:52 ChST (21:52 UTC), Deepsea Challenger arrived at the bottom. The descent lasted 2 hours and 36 minutes and the recorded depth was  when Deepsea Challenger touched down.\nCameron had planned to spend about six hours near the ocean floor exploring but decided to start the ascent to the surface after only 2 hours and 34 minutes.  The time on the bottom was shortened because a hydraulic fluid leak in the lines controlling the manipulator arm obscured the visibility out the only viewing port.  It also caused the loss of the submersible's starboard thrusters.  At around 12:00 ChST (02:00 UTC on 26 March), the Deepsea Challenger website says the sub resurfaced after a 90-minute ascent, although Paul Allen's tweets indicate the ascent took only about 67 minutes.\nDuring a post-dive press conference Cameron said: \"I landed on a very soft, almost gelatinous flat plain. Once I got my bearings, I drove across it for quite a distance ... and finally worked my way up the slope.\" The whole time, Cameron said, he didn't see any fish, or any living creatures more than an inch (2.54 cm) long: \"The only free swimmers I saw were small amphipods\"—shrimplike bottom-feeders.\n\nPlanned manned descents\n\nSeveral other manned expeditions are planned. These include:\n*Triton Submarines, a Florida-based company that designs and manufactures private submarines, whose vehicle, Triton 36000/3, will carry a crew of three to the seabed in 120 minutes;\n*Virgin Oceanic, sponsored by Richard Branson's Virgin Group, is developing a submersible designed by Graham Hawkes, DeepFlight Challenger,Virgin Oceanic, [http://www.virginoceanic.com/team/operations-team/ Operations Team]  (Retrieved 25 March 2012) with which the solo pilot will take 140 minutes to reach the seabed;\n* DOER Marine, a San Francisco Bay Area based marine technology company established in 1992, that is developing a vehicle, Deepsearch (and Ocean Explorer HOV Unlimited), with some support from Google's Eric Schmidt with which a crew of two or three will take 90 minutes to reach the seabed, as the program Deep Search.\n\nUnmanned descents\n\nKaikō\n\nOn 24 March 1995, the Japanese robotic deep-sea probe Kaikō broke the depth record for unmanned probes when it reached close to the surveyed bottom of the Challenger Deep. Created by the Japan Agency for Marine-Earth Science and Technology (JAMSTEC), it was one of the few unmanned deep-sea probes in operation that could dive deeper than 6000 m. The manometer measured depth of 10911 m ±3 m at  for the Challenger Deep is believed to be the most accurate measurement taken yet. Kaikō also collected sediment cores containing marine organisms from the bottom of the deep. Kaikō made many unmanned descents to the Mariana Trench during three expeditions in 1995, 1996 and 1998. The greatest depth measured by Kaikō in 1996 was 10898 m at  and in 1998 10907 m at . It was lost at sea off Shikoku Island during Typhoon Chan-Hom on 29 May 2003.\n\nABISMO\n\nOn 3 June 2008, the Japanese robotic deep-sea probe ABISMO (Automatic Bottom Inspection and Sampling Mobile) reached the bottom of the Mariana Trench about 150 km east of the Challenger Deep and collected core samples of the deep sea sediment and water samples of the water column. Created by the Japan Agency for Marine-Earth Science and Technology (JAMSTEC), it was the only unmanned deep-sea probe in use that could dive deeper than 10000 m after that of Nereus. During ABISMOs deepest Mariana Trench dive its manometer measured a depth of 10258 m ±3 mhttp://www.jamstec.go.jp/e/about/press_release/20080616/ “ABISMO\", Automatic Bottom Inspection and Sampling Mobile, Succeeds in World’s First Multiple Vertical Sampling from Mid-ocean, Sea Floor and Sub-seafloor over Depth of 10,000 m in Mariana Trench June 16, 2008 Japan Agency for Marine-Earth Science and Technology\n\nNereus\n\nOn 31 May 2009 the United States sent the Nereus hybrid remotely operated vehicle (HROV) to the Challenger Deep. Nereus thus became the first vehicle to reach the Mariana Trench since 1998 and the deepest-diving vehicle then in operation. Project manager and developer Andy Bowen heralded the achievement as \"the start of a new era in ocean exploration\". Nereus, unlike Kaikō, did not need to be powered or controlled by a cable connected to a ship on the ocean surface.\n\nNereus spent over 10 hours at the bottom of the Challenger Deep and measured a depth of 10902 m at , while sending live video and data back to its mothership RV Kilo Moana at the surface and collecting geological and biological samples from the Challenger Deep bottom with its manipulator arm for further scientific analysis.\n\nThe Nereus was operated by the Woods Hole Oceanographic Institution. It was lost on May 10, 2014.http://www.bbc.com/news/science-environment-27374326\n\nHaidou-1\n\nOn 23 May 2016 the Chinese submersible Haidou-1 dove to a depth of 10767 m in the Mariana Trench. This autonomous and remotely operated vehicle has a design depth of 11000 m.[http://www.chinadailyasia.com/nation/2016-08/23/content_15483551.html Nitrogen experiment among breakthroughs, by Zhao Xinying, Tuesday, August 23, 2016]\n\nLifeforms\n\nThe Summary Report of the HMS Challenger expedition lists radiolaria from the two dredged samples taken when the Challenger Deep was first discovered.[http://www.19thcenturyscience.org/HMSC/HMSC-Reports/1895-Summary/htm/doc878.html],  entry on 23 March 1875. These (Nassellaria and Spumellaria) were reported in the Report on Radiolaria (1887)[http://www.19thcenturyscience.org/HMSC/HMSC-Reports/Zool-40/README.htm], Report on the Radiolaria collected by H.M.S. Challenger\nby Ernst Haeckel. written by Ernst Haeckel.\n\nOn their 1960 descent, the crew of the Trieste noted that the floor consisted of diatomaceous ooze and reported observing \"some type of flatfish\" lying on the seabed.[http://www.americanheritage.com/articles/magazine/it/1992/1/1992_1_28.shtml \"To the bottom of the sea\"] , T. A. Heppenheimer, AmericanHeritage.com\n\nMany marine biologists are now skeptical of this supposed sighting, and it is suggested that the creature may instead have been a sea cucumber.[https://www.theguardian.com/environment/2011/jan/18/james-cameron-dives-deep-avatar \"James Cameron dives deep for Avatar\"], Guardian, 18 January 2011[http://www.nature.com/news/james-cameron-heads-into-the-abyss-1.10246 \"James Cameron heads into the abyss\"], Nature, 19 March 2012 The video camera on board the Kaiko probe spotted a sea cucumber, a scale worm and a shrimp at the bottom.[https://www.newscientist.com/article/mg15220548.100-mission-to-marianas--if-mount-everest-was-dropped-into-the-worlds-deepest-trench-it-woulddrown-kaiko-hit-bottom----and-came-back-to-tell-the-tale.html \"Mission to Marianas\"], New Scientist, 2 November 1996[http://www.time.com/time/magazine/article/0,9171,983295-6,00.html \"The last frontier\"], Time, 14 August 1995 At the bottom of the Challenger deep, the Nereus probe spotted one polychaete worm (a multi-legged predator) about an inch long.[http://ns.gov.gu/geography.html Accessed 8 Oct 2009]   Geography of the ocean floor near Guam with some notes on exploration of the Challenger Deep.\n\nAn analysis of the sediment samples collected by Kaiko found large numbers of simple organisms at 10900 m. While similar lifeforms have been known to exist in shallower ocean trenches (> 7,000 m) and on the abyssal plain, the lifeforms discovered in the Challenger Deep possibly represent taxa distinct from those in shallower ecosystems.\n\nMost of the organisms collected were simple, soft-shelled foraminifera (432 species according to National Geographic), with four of the others representing species of the complex, multi-chambered genera Leptohalysis and Reophax. Eighty-five percent of the specimens were organic, soft-shelled allogromiids, which is unusual compared to samples of sediment-dwelling organisms from other deep-sea environments, where the percentage of organic-walled foraminifera ranges from 5% to 20%. As small organisms with hard, calcareous shells have trouble growing at extreme depths because of the high solubility of calcium carbonate in the pressurized water, scientists theorize that the preponderance of soft-shelled organisms in the Challenger Deep may have resulted from the typical biosphere present when the Challenger Deep was shallower than it is now. Over the course of six to nine million years, as the Challenger Deep grew to its present depth, many of the species present in the sediment died out or were unable to adapt to the increasing water pressure and changing environment. The species that survived the change in depth were the ancestors of the Challenger Deep's current denizens.\n\nOn 17 March 2013, researchers reported data that suggested microbial life forms thrive in the Challenger Deep. Other researchers reported related studies that microbes thrive inside rocks up to 1900 ft below the sea floor under 8500 ft of ocean off the coast of the northwestern United States. According to one of the researchers, \"You can find microbes everywhere — they're extremely adaptable to conditions, and survive wherever they are.\". Challenger Deep. http://en.wikipedia.org/?curid=7786."
  }
}
