{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6068",
  "eid" : "d9ccd950-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778445157,
  "textBody" : "Common Lisp (CL) is a dialect of the Lisp programming language, published in ANSI standard document ANSI INCITS 226-1994 (R2004) (formerly X3.226-1994 (R1999)).Quoted from cover of cited standard.  ANSI INCITS 226-1994 (R2004), for sale on standard's [http://webstore.ansi.org/RecordDetail.aspx?sku=ANSI+INCITS+226-1994+(R2004) document page]. The Common Lisp HyperSpec, a hyperlinked HTML version, has been derived from the ANSI Common Lisp standard.[http://www.lispworks.com/documentation/HyperSpec/Front/Help.htm#Authorship Authorship of the Common Lisp HyperSpec]\n\nThe Common Lisp language was developed as a standardized and improved successor of Maclisp. By the early 1980s several groups were already at work on diverse successors to MacLisp: Lisp Machine Lisp (aka ZetaLisp), Spice Lisp, NIL and S-1 Lisp. Common Lisp sought to unify, standardise, and extend the features of these MacLisp dialects. Common Lisp is not an implementation, but rather a language specification.[http://www.lispworks.com/documentation/HyperSpec/Body/01_ab.htm Common Lisp HyperSpec 1.1.2 History] Several implementations of the Common Lisp standard are available, including free and open-source software and proprietary products.[http://common-lisp.net/~dlw/LispSurvey.html Common Lisp Implementations: A Survey]\nCommon Lisp is a general-purpose, multi-paradigm programming language. It supports a combination of procedural, functional, and object-oriented programming paradigms. As a dynamic programming language, it facilitates evolutionary and incremental software development, with iterative compilation into efficient run-time programs. This incremental development is often done interactively without interrupting the running application.\n\nIt also supports optional type annotation and casting, which can be added as necessary at the later profiling and optimization stages, to permit the compiler to generate more efficient code. For instance, fixnum can hold an unboxed integer in a range supported by the hardware and implementation, permitting more efficient arithmetic than on big integers or arbitrary precision types.  Similarly, the compiler can be told on a per-module or per-function basis which type safety level is wanted, using optimize declarations.\n\nCommon Lisp includes CLOS, an object system that supports multimethods and method combinations. It is often implemented with a Metaobject Protocol.\n\nCommon Lisp is extensible through standard features such as Lisp macros (code transformations) and reader macros (input parsers for characters).\n\nCommon Lisp provides some backwards compatibility to Maclisp and to John McCarthy's original Lisp. This allows older Lisp software to be ported to Common Lisp.\n\nHistory\n\nWork on Common Lisp started in 1981 after an initiative by ARPA manager Bob Engelmore to develop a single community standard Lisp dialect.[http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/doc/history/cl.txt Roots of \"Yu-Shiang Lisp\", Mail from Jon L White, 1982] Much of the initial language design was done via electronic mail.[http://cl-su-ai.lisp.se/maillist.html ARPANET Common Lisp mailing list, starting in 1981][http://ccs.mit.edu/papers/CCSWP150.html Knee-jerk Anti-LOOPism and other E-mail Phenomena: Oral, Written, and Electronic Patterns in Computer-Mediated Communication, JoAnne Yates and Wanda J. Orlikowski., 1993]  In 1982, Guy L. Steele, Jr. gave the first overview of Common Lisp at the 1982 ACM Symposium on LISP and functional programming.[http://dl.acm.org/citation.cfm?doid=800068.802140 An overview of COMMON LISP, Guy L. Steele, Jr.. LFP '82 Proceedings of the 1982 ACM symposium on LISP and functional programming Pages 98-107]\n\nThe first language documentation was published 1984 as Common Lisp the Language, first edition. A second edition, published in 1990, incorporated many changes to the language, made during the ANSI Common Lisp standardization process. The final ANSI Common Lisp standard then was published in 1994. Since then no update to the standard has been published. Various extensions and improvements to Common Lisp (examples are Unicode, Concurrency, CLOS-based IO) have been provided by implementations and libraries (many available via Quicklisp).\n\nSyntax\n\nCommon Lisp is a dialect of Lisp; it uses S-expressions to denote both code and data structure. Function calls, macro forms and special forms are written as lists, with the name of the operator first, as in these examples:\n\n (+ 2 2)           ; adds 2 and 2, yielding 4. The function's name is '+'. Lisp has no operators as such.\n\n (defvar *x*)      ; Ensures that a variable *x* exists,\n                   ; without giving it a value. The asterisks are part of\n                   ; the name, by convention denoting a special (global) variable. \n                   ; The symbol *x* is also hereby endowed with the property that\n                   ; subsequent bindings of it are dynamic, rather than lexical.\n (setf *x* 42.1)   ; sets the variable *x* to the floating-point value 42.1\n\n ;; Define a function that squares a number:\n (defun square (x)\n   (* x x))\n\n ;; Execute the function:\n (square 3)        ; Returns 9\n\n ;; the 'let' construct creates a scope for local variables. Here\n ;; the variable 'a' is bound to 6 and the variable 'b' is bound\n ;; to 4. Inside the 'let' is a 'body', where the last computed value is returned.\n ;; Here the result of adding a and b is returned from the 'let' expression.\n ;; The variables a and b have lexical scope, unless the symbols have been\n ;; marked as special variables (for instance by a prior DEFVAR).\n (let ((a 6)\n       (b 4))\n   (+ a b))        ; returns 10\n\nData types\n\nCommon Lisp has many data types.\n\nScalar types\n\nNumber types include integers, ratios, floating-point numbers, and complex numbers. Common Lisp uses bignums to represent numerical values of arbitrary size and precision. The ratio type represents fractions exactly, a facility not available in many languages. Common Lisp automatically coerces numeric values among these types as appropriate.\n\nThe Common Lisp character type is not limited to ASCII characters. Most modern implementations allow Unicode characters.\n\nThe symbol type is common to Lisp languages, but largely unknown outside them. A symbol is a unique, named data object with several parts: name, value, function, property list and package. Of these, value cell and function cell are the most important. Symbols in Lisp are often used similarly to identifiers in other languages: to hold the value of a variable; however there are many other uses. Normally, when a symbol is evaluated, its value is returned. Some symbols evaluate to themselves, for example all symbols in the keyword package are self-evaluating. Boolean values in Common Lisp are represented by the self-evaluating symbols T and NIL. Common Lisp has namespaces for symbols, called 'packages'.\n\nA number of functions are available for rounding scalar numeric values in various ways. The function round rounds the argument to the nearest integer, with halfway cases rounded to the even integer. The functions truncate, floor, and ceiling round towards zero, down, or up respectively.  All these functions return the discarded fractional part as a secondary value. For example, (floor -2.5) yields -3, 0.5; (ceiling -2.5)  yields -2, -0.5; (round 2.5) yields 2, 0.5; and (round 3.5) yields 4, -0.5.\n\nData structures\n\nSequence types in Common Lisp include lists, vectors, bit-vectors, and strings. There are many operations that can work on any sequence type.\n\nAs in almost all other Lisp dialects, lists in Common Lisp are composed of conses, sometimes called cons cells or pairs. A cons is a data structure with two slots, called its car and cdr. A list is a linked chain of conses or the empty list. Each cons's car refers to a member of the list (possibly another list). Each cons's cdr refers to the next cons—except for the last cons in a list, whose cdr refers to the nil value. Conses can also easily be used to implement trees and other complex data structures; though it is usually advised to use structure or class instances instead. It is also possible to create circular data structures with conses.\n\nCommon Lisp supports multidimensional arrays, and can dynamically resize adjustable arrays if required. Multidimensional arrays can be used for matrix mathematics. A vector is a one-dimensional array. Arrays can carry any type as members (even mixed types in the same array) or can be specialized to contain a specific type of members, as in a vector of bits. Usually only a few types are supported. Many implementations can optimize array functions when the array used is type-specialized. Two type-specialized array types are standard: a string is a vector of characters, while a bit-vector is a vector of bits.\n\nHash tables store associations between data objects. Any object may be used as key or value. Hash tables are automatically resized as needed.\n\nPackages are collections of symbols, used chiefly to separate the parts of a program into namespaces. A package may export some symbols, marking them as part of a public interface. Packages can use other packages.\n\nStructures, similar in use to C structs and Pascal records, represent arbitrary complex data structures with any number and type of fields (called slots). Structures allow single-inheritance.\n\nClasses are similar to structures, but offer more dynamic features and multiple-inheritance. (See CLOS). Classes have been added late to Common Lisp and there is some conceptual overlap with structures. Objects created of classes are called Instances. A special case are Generic Functions. Generic Functions are both functions and instances.\n\nFunctions\n\nCommon Lisp supports first-class functions.  For instance, it is possible to write functions that take other functions as arguments or return functions as well.  This makes it possible to describe very general operations.\n\nThe Common Lisp library relies heavily on such higher-order functions. For example, the sort function takes a relational operator as an argument and key function as an optional keyword argument. This can be used not only to sort any type of data, but also to sort data structures according to a key.\n\n ;; Sorts the list using the > and )   ; Returns (6 5 4 3 2 1)\n (sort (list 5 2 6 3 1 4) #'\n\n ;; Sorts the list according to the first element of each sub-list.\n (sort (list '(9 A) '(3 B) '(4 C)) #'\n\nThe evaluation model for functions is very simple.  When the evaluator encounters a form (f a1 a2...) then it presumes that the symbol named f is one of the following:\n\n# A special operator (easily checked against a fixed list)\n# A macro operator (must have been defined previously)\n# The name of a function (default), which may either be a symbol, or a sub-form beginning with the symbol lambda.\n\nIf f is the name of a function, then the arguments a1, a2, ..., an are evaluated in left-to-right order, and the function is found and invoked with those values supplied as parameters.\n\nDefining functions\n\nThe macro defun defines functions where a function definition gives the name of the function, the names of any arguments, and a function body:\n\n (defun square (x)\n   (* x x))\n\nFunction definitions may include compiler directives, known as declarations, which provide hints to the compiler about optimization settings or the data types of arguments. They may also include documentation strings (docstrings), which the Lisp system may use to provide interactive documentation:\n\n (defun square (x)\n   \"Calculates the square of the single-float x.\"\n   (declare (single-float x) (optimize (speed 3) (debug 0) (safety 1)))\n   (the single-float (* x x)))\n\nAnonymous functions (function literals) are defined using lambda expressions, e.g. (lambda (x) (* x x)) for a function that squares its argument. Lisp programming style frequently uses higher-order functions for which it is useful to provide anonymous functions as arguments.\n\nLocal functions can be defined with flet and labels.\n\n (flet ((square (x)\n          (* x x)))\n   (square 3))\n\nThere are a number of other operators related to the definition and manipulation of functions. For instance, a function may be compiled with the compile operator. (Some Lisp systems run functions using an interpreter by default unless instructed to compile; others compile every function).\n\nDefining generic functions and methods\n\nThe macro defgeneric defines generic functions.\nThe macro defmethod defines methods. Generic functions are a collection of methods.\n\nMethods can specialize their parameters over CLOS standard classes, system classes, structure classes or objects. For many types there are corresponding system classes.\n\nWhen a generic function is called, multiple-dispatch will determine the effective method to use.\n\n (defgeneric add (a b))\n\n (defmethod add ((a number) (b number))\n    (+ a b))\n\n (defmethod add ((a vector) (b number))\n    (map 'vector (lambda (n) (+ n b)) a))\n\n (defmethod add ((a vector) (b vector))\n    (map 'vector #'+ a b))\n\n(defmethod add ((a string) (b string))\n  (concatenate 'string a b) )\n\n (add 2 3)                   ; returns 5\n (add #(1 2 3 4) 7)          ; returns #(8 9 10 11)\n (add #(1 2 3 4) #(4 3 2 1)) ; returns #(5 5 5 5)\n (add \"COMMON \" \"LISP\")      ; returns \"COMMON LISP\"\n\nGeneric Functions are also a first class data type. There are many more features to Generic Functions and Methods than described above.\n\nThe function namespace\n\nThe namespace for function names is separate from the namespace for data variables. This is a key difference between Common Lisp and Scheme. For Common Lisp, operators that define names in the function namespace include defun, flet, labels, defmethod and defgeneric.\n\nTo pass a function by name as an argument to another function, one must use the function special operator, commonly abbreviated as #'. The first sort example above refers to the function named by the symbol > in the function namespace, with the code #'>. Conversely, to call a function passed in such a way, one would use the funcall operator on the argument.\n\nScheme's evaluation model is simpler: there is only one namespace, and all positions in the form are evaluated (in any order) -- not just the arguments. Code written in one dialect is therefore sometimes confusing to programmers more experienced in the other. For instance, many Common Lisp programmers like to use descriptive variable names such as list or string which could cause problems in Scheme, as they would locally shadow function names.\n\nWhether a separate namespace for functions is an advantage is a source of contention in the Lisp community. It is usually referred to as the Lisp-1 vs. Lisp-2 debate. Lisp-1 refers to Scheme's model and Lisp-2 refers to Common Lisp's model. These names were coined in a 1988 paper by Richard P. Gabriel and Kent Pitman, which extensively compares the two approaches.\n\nMultiple return values\n\nCommon Lisp supports the concept of multiple values, where any expression always has a single primary value, but it might also have any number of secondary values, which might be received and inspected by interested callers. This concept is distinct from returning a list value, as the secondary values are fully optional, and passed via a dedicated side channel. This means that callers may remain entirely unaware of the secondary values being there if they have no need for them, and it makes it convenient to use the mechanism for communicating information that is sometimes useful, but not always necessary. For example,\n\n* The TRUNCATE function rounds the given number to an integer towards zero. However, it also returns a remainder as a secondary value, making it very easy to determine what value was truncated. It also supports an optional divisor parameter, which can be used to perform Euclidean division trivially:\n\n(let ((x 1266778)\n      (y 458))\n  (multiple-value-bind (quotient remainder)\n      (truncate x y)\n    (format nil \"~A divided by ~A is ~A remainder ~A\" x y quotient remainder)))\n\n;;;; => \"1266778 divided by 458 is 2765 remainder 408\"\n\n* GETHASH returns the value of a key in an associative map, or the default value otherwise, and a secondary boolean indicating whether the value was found. Thus code which does not care about whether the value was found or provided as the default can simply use it as-is, but when such distinction is important, it might inspect the secondary boolean and react appropriately. Both use cases are supported by the same call and neither is unnecessarily burdened or constrained by the other. Having this feature at the language level removes the need to check for the existence of the key or compare it to null as would be done in other languages.\n\n(defun get-answer (library)\n  (gethash 'answer library 42))\n\n(defun the-answer-1 (library)\n  (format nil \"The answer is ~A\" (get-answer library)))\n;;;; Returns \"The answer is 42\" if ANSWER not present in LIBRARY\n\n(defun the-answer-2 (library)\n  (multiple-value-bind (answer sure-p)\n      (get-answer library)\n    (if (not sure-p)\n        \"I don't know\"\n     (format nil \"The answer is ~A\" answer))))\n;;;; Returns \"I don't know\" if ANSWER not present in LIBRARY\n\nMultiple values are supported by a handful of standard forms, most common of which are the MULTIPLE-VALUE-BIND special form for accessing secondary values and VALUES for returning multiple values:\n\n(defun magic-eight-ball ()\n  \"Return an outlook prediction, with the probability as a secondary value\"\n  (values \"Outlook good\" (random 1.0)))\n\n;;;; => \"Outlook good\"\n;;;; => 0.3187\n\nOther types\n\nOther data types in Common Lisp include:\n\n*Pathnames represent files and directories in the filesystem. The Common Lisp pathname facility is more general than most operating systems' file naming conventions, making Lisp programs' access to files broadly portable across diverse systems.\n*Input and output streams represent sources and sinks of binary or textual data, such as the terminal or open files.\n*Common Lisp has a built-in pseudo-random number generator (PRNG). Random state objects represent reusable sources of pseudo-random numbers, allowing the user to seed the PRNG or cause it to replay a sequence.\n*Conditions are a type used to represent errors, exceptions, and other \"interesting\" events to which a program may respond.\n*Classes are first-class objects, and are themselves instances of classes called metaobject classes (metaclasses for short).\n*Readtables are a type of object which control how Common Lisp's reader parses the text of source code.  By controlling which readtable is in use when code is read in, the programmer can change or extend the language's syntax.\n\nScope\n\nLike programs in many other programming languages, Common Lisp programs make use of names to refer to variables, functions, and many other kinds of entities. Named references are subject to scope.\n\nThe association between a name and the entity which the name refers to is called a binding.\n\nScope refers to the set of circumstances in which a name is determined to have a particular binding.\n\nDeterminers of scope\n\nThe circumstances which determine scope in Common Lisp include:\n\n* the location of a reference within an expression. If it's the leftmost position of a compound, it refers to a special operator or a macro or function binding, otherwise to a variable binding or something else.\n* the kind of expression in which the reference takes place. For instance, (go x) means transfer control to label x, whereas (print x) refers to the variable x. Both scopes of x can be active in the same region of program text, since tagbody labels are in a separate namespace from variable names. A special form or macro form has complete control over the meanings of all symbols in its syntax. For instance, in (defclass x (a b) ()), a class definition, the (a b) is a list of base classes, so these names are looked up in the space of class names, and x isn't a reference to an existing binding, but the name of a new class being derived from a and b. These facts emerge purely from the semantics of defclass. The only generic fact about this expression is that defclass refers to a macro binding; everything else is up to defclass.\n* the location of the reference within the program text. For instance, if a reference to variable x is enclosed in a binding construct such as a let which defines a binding for x, then the reference is in the scope created by that binding.\n* for a variable reference, whether or not a variable symbol has been, locally or globally, declared special. This determines whether the reference is resolved within a lexical environment, or within a dynamic environment.\n* the specific instance of the environment in which the reference is resolved. An environment is a run-time dictionary which maps symbols to bindings. Each kind of reference uses its own kind of environment. References to lexical variables are resolved in a lexical environment, et cetera. More than one environment can be associated with the same reference. For instance, thanks to recursion or the use of multiple threads, multiple activations of the same function can exist at the same time. These activations share the same program text, but each has its own lexical environment instance.\n\nTo understand what a symbol refers to, the Common Lisp programmer must know what kind of reference is being expressed, what kind of scope it uses if it is a variable reference (dynamic versus lexical scope), and also the run-time situation: in what environment is the reference resolved, where was the binding introduced into the environment, et cetera.\n\nKinds of environment\n\nGlobal\n\nSome environments in Lisp are globally pervasive. For instance, if a new type is defined, it is known everywhere thereafter. References to that type look it up in this global environment.\n\nDynamic\n\nOne type of environment in Common Lisp is the dynamic environment. Bindings established in this environment have dynamic extent, which means that a binding is established at the start of the execution of some construct, such as a let block, and disappears when that construct finishes executing: its lifetime is tied to the dynamic activation and deactivation of a block. However, a dynamic binding is not just visible within that block; it is also visible to all functions invoked from that block.  This type of visibility is known as indefinite scope. Bindings which exhibit dynamic extent (lifetime tied to the activation and deactivation of a block) and indefinite scope  (visible to all functions which are called from that block) are said to have dynamic scope.\n\nCommon Lisp has support for dynamically scoped variables, which are also called special variables.  Certain other kinds of bindings are necessarily dynamically scoped also, such as restarts and catch tags.  Function bindings cannot be dynamically scoped using flet (which only provides lexically scoped function bindings), but function objects (a first-level object in Common Lisp) can be assigned to dynamically scoped variables, bound using let in dynamic scope, then called using funcall or APPLY.\n\nDynamic scope is extremely useful because it adds referential clarity and discipline to global variables. Global variables are frowned upon in computer science as potential sources of error, because they can give rise to ad-hoc, covert channels of communication among modules that lead to unwanted, surprising interactions.\n\nIn Common Lisp, a special variable which has only a top-level binding behaves just like a global variable in other programming languages. A new value can be stored into it, and that value simply replaces what is in the top-level binding. Careless replacement of the value of a global variable is at the heart of bugs caused by use of global variables. However, another way to work with a special variable is to give it a new, local binding within an expression. This is sometimes referred to as \"rebinding\" the variable. Binding a dynamically scoped variable temporarily creates a new memory location for that variable, and associates the name with that location. While that binding is in effect, all references to that variable refer to the new binding; the previous binding is hidden. When execution of the binding expression terminates, the temporary memory location is gone, and the old binding is revealed, with the original value intact. Of course, multiple dynamic bindings for the same variable can be nested.\n\nIn Common Lisp implementations which support multithreading, dynamic scopes are specific to each thread of execution. Thus special variables serve as an abstraction for thread local storage. If one thread rebinds a special variable, this rebinding has no effect on that variable in other threads. The value stored in a binding can only be retrieved by the thread which created that binding. If each thread binds some special variable *x*, then *x* behaves like thread-local storage. Among threads which do not rebind *x*, it behaves like an ordinary global: all of these threads refer to the same top-level binding of *x*.\n\nDynamic variables can be used to extend the execution context with additional context information which is implicitly passed from function to function without having to appear as an extra function parameter. This is especially useful when the control transfer has to pass through layers of unrelated code, which simply cannot be extended with extra parameters to pass the additional data. A situation like this usually calls for a global variable. That global variable must be saved and restored, so that the scheme doesn't break under recursion: dynamic variable rebinding takes care of this. And that variable must be made thread-local (or else a big mutex must be used) so the scheme doesn't break under threads: dynamic scope implementations can take care of this also.\n\nIn the Common Lisp library, there are many standard special variables. For instance, all standard I/O streams are stored in the top-level bindings of well-known special variables. The standard output stream is stored in *standard-output*.\n\nSuppose a function foo writes to standard output:\n\n  (defun foo ()\n    (format t \"Hello, world\"))\n\nTo capture its output in a character string, *standard-output* can be bound to a string stream and called:\n\n  (with-output-to-string (*standard-output*)\n    (foo))\n\n  -> \"Hello, world\" ; gathered output returned as a string\n\nLexical\n\nCommon Lisp supports lexical environments. Formally, the bindings in a lexical environment have lexical scope and may have either indefinite extent or dynamic extent, depending on the type of namespace. Lexical scope means that visibility is physically restricted to the block in which the binding is established. References which are not textually (i.e. lexically) embedded in that block simply do not see that binding.\n\nThe tags in a TAGBODY have lexical scope. The expression (GO X) is erroneous if it is not actually embedded in a TAGBODY which contains a label X. However, the label bindings disappear when the TAGBODY terminates its execution, because they have dynamic extent. If that block of code is re-entered by the invocation of a lexical closure, it is invalid for the body of that closure to try to transfer control to a tag via GO:\n\n  (defvar *stashed*) ;; will hold a function\n\n  (tagbody\n    (setf *stashed* (lambda () (go some-label)))\n    (go end-label) ;; skip the (print \"Hello\")\n   some-label\n    (print \"Hello\")\n   end-label)\n  -> NIL\n\nWhen the TAGBODY is executed, it first evaluates the setf form which stores a function in the special variable *stashed*. Then the (go end-label) transfers control to end-label, skipping the code (print \"Hello\"). Since end-label is at the end of the tagbody, the tagbody terminates, yielding NIL. Suppose that the previously remembered function is now called:\n\n  (funcall *stashed*) ;; Error!\n\nThis situation is erroneous. One implementation's response is an error condition containing the message, \"GO: tagbody for tag SOME-LABEL has already been left\". The function tried to evaluate (go some-label), which is lexically embedded in the tagbody, and resolves to the label. However, the tagbody isn't executing (its extent has ended), and so the control transfer cannot take place.\n\nLocal function bindings in Lisp have lexical scope, and variable bindings also have lexical scope by default. By contrast with GO labels, both of these have indefinite extent. When a lexical function or variable binding is established, that binding continues to exist for as long as references to it are possible, even after the construct which established that binding has terminated. References to lexical variables and functions after the termination of their establishing construct are possible thanks to lexical closures.\n\nLexical binding is the default binding mode for Common Lisp variables. For an individual symbol, it can be switched to dynamic scope, either by a local declaration, by a global declaration. The latter may occur implicitly through the use of a construct like DEFVAR or DEFPARAMETER. It is an important convention in Common Lisp programming that special (i.e. dynamically scoped) variables have names which begin and end with an asterisk sigil * in what is called the “earmuff convention”.[http://letoverlambda.com/index.cl/guest/chap2.html Chapter 2] of Let Over Lambda If adhered to, this convention effectively creates a separate namespace for special variables, so that variables intended to be lexical are not accidentally made special.\n\nLexical scope is useful for several reasons.\n\nFirstly, references to variables and functions can be compiled to efficient machine code, because the run-time environment structure is relatively simple. In many cases it can be optimized to stack storage, so opening and closing lexical scopes has minimal overhead. Even in cases where full closures must be generated, access to the closure's environment is still efficient; typically each variable becomes an offset into a vector of bindings, and so a variable reference becomes a simple load or store instruction with a base-plus-offset addressing mode.\n\nSecondly, lexical scope (combined with indefinite extent) gives rise to the lexical closure, which in turn creates a whole paradigm of programming centered around the use of functions being first-class objects, which is at the root of functional programming.\n\nThirdly, perhaps most importantly, even if lexical closures are not exploited, the use of lexical scope isolates program modules from unwanted interactions. Due to their restricted visibility, lexical variables are private. If one module A binds a lexical variable X, and calls another module B, references to X in B will not accidentally resolve to the X bound in A. B simply has no access to X. For situations in which disciplined interactions through a variable are desirable, Common Lisp provides special variables. Special variables allow for a module A to set up a binding for a variable X which is visible to another module B, called from A. Being able to do this is an advantage, and being able to prevent it from happening is also an advantage; consequently, Common Lisp supports both lexical and dynamic scope.\n\nMacros\n\nA macro in Lisp superficially resembles a function in usage. However, rather than representing an expression which is evaluated, it represents a transformation of the program source code. The macro gets the source it surrounds as arguments, binds them to its parameters and computes a new source form. This new form can also use a macro. The macro expansion is repeated until the new source form does not use a macro. The final computed form is the source code executed at runtime.\n\nTypical uses of macros in Lisp:\n\n* new control structures (example: looping constructs, branching constructs)\n* scoping and binding constructs\n* simplified syntax for complex and repeated source code\n* top-level defining forms with compile-time side-effects\n* data-driven programming\n* embedded domain specific languages (examples: SQL, HTML, Prolog)\n* implicit finalization forms\n\nVarious standard Common Lisp features also need to be implemented as macros, such as:\n\n* the standard setf abstraction, to allow custom compile-time expansions of assignment/access operators\n* with-accessors, with-slots, with-open-file and other similar WITH macros\n* Depending on implementation, if or cond is a macro built on the other, the special operator; when and unless consist of macros\n* The powerful loop domain-specific language\n\nMacros are defined by the defmacro macro. The special operator macrolet allows the definition of local (lexically scoped) macros. It is also possible to define macros for symbols using define-symbol-macro and symbol-macrolet.\n\nPaul Graham's book On Lisp describes the use of macros in Common Lisp in detail.  Doug Hoyte's book Let Over Lambda extends the discussion on macros, claiming \"Macros are the single greatest advantage that lisp has as a programming language and the single greatest advantage of any programming language.\"  Hoyte provides several examples of iterative development of macros.\n\nExample using a macro to define a new control structure\n\nMacros allow Lisp programmers to create new syntactic forms in the language. One typical use is to create new control structures. The example macro provides an until looping construct. The syntax is:\n\n(until test form*)\n\nThe macro definition for until:\n\n(defmacro until (test &body body)\n  (let ((start-tag (gensym \"START\"))\n        (end-tag   (gensym \"END\")))\n    `(tagbody ,start-tag\n              (when ,test (go ,end-tag))\n              (progn ,@body)\n              (go ,start-tag)\n              ,end-tag)))\n\ntagbody is a primitive Common Lisp special operator which provides the ability to name tags and use the go form to jump to those tags. The backquote ` provides a notation that provides code templates, where the value of forms preceded with a comma are filled in. Forms preceded with comma and at-sign are spliced in. The tagbody form tests the end condition. If the condition is true, it jumps to the end tag. Otherwise the provided body code is executed and then it jumps to the start tag.\n\nAn example form using above until macro:\n\n(until (= (random 10) 0)\n  (write-line \"Hello\"))\n\nThe code can be expanded using the function macroexpand-1. The expansion for above example looks like this:\n\n(TAGBODY\n #:START1136\n (WHEN (ZEROP (RANDOM 10))\n   (GO #:END1137))\n (PROGN (WRITE-LINE \"hello\"))\n (GO #:START1136)\n #:END1137)\n\nDuring macro expansion the value of the variable test is (= (random 10) 0) and the value of the variable body is ((write-line \"Hello\")). The body is a list of forms.\n\nSymbols are usually automatically upcased. The expansion uses the TAGBODY with two labels. The symbols for these labels are computed by GENSYM and are not interned in any package. Two go forms use these tags to jump to. Since tagbody is a primitive operator in Common Lisp (and not a macro), it will not be expanded into something else. The expanded form uses the when macro, which also will be expanded. Fully expanding a source form is called code walking.\n\nIn the fully expanded (walked) form, the when form is replaced by the primitive if:\n\n(TAGBODY\n #:START1136\n (IF (ZEROP (RANDOM 10))\n     (PROGN (GO #:END1137))\n   NIL)\n (PROGN (WRITE-LINE \"hello\"))\n (GO #:START1136))\n #:END1137)\n\nAll macros must be expanded before the source code containing them can be evaluated or compiled normally.  Macros can be considered functions that accept and return S-expressions - similar to abstract syntax trees, but not limited to those. These functions are invoked before the evaluator or compiler to produce the final source code.\nMacros are written in normal Common Lisp, and may use any Common Lisp (or third-party) operator available.\n\nVariable capture and shadowing\n\nCommon Lisp macros are capable of what is commonly called variable capture, where symbols in the macro-expansion body coincide with those in the calling context, allowing the programmer to create macros wherein various symbols have special meaning. The term variable capture is somewhat misleading, because all namespaces are vulnerable to unwanted capture, including the operator and function namespace, the tagbody label namespace, catch tag, condition handler and restart namespaces.\n\nVariable capture can introduce software defects. This happens in one of the following two ways:\n\n* In the first way, a macro expansion can inadvertently make a symbolic reference which the macro writer assumed will resolve in a global namespace, but the code where the macro is expanded happens to provide a local, shadowing definition which steals that reference. Let this be referred to as type 1 capture.\n* The second way, type 2 capture, is just the opposite: some of the arguments of the macro are pieces of code supplied by the macro caller, and those pieces of code are written such that they make references to surrounding bindings. However, the macro inserts these pieces of code into an expansion which defines its own bindings that accidentally captures some of these references.\n\nThe Scheme dialect of Lisp provides a macro-writing system which provides the referential transparency that eliminates both types of capture problem. This type of macro system is sometimes called \"hygienic\", in particular by its proponents (who regard macro systems which do not automatically solve this problem as unhygienic). \n\nIn Common Lisp, macro hygiene is ensured one of two different ways.\n\nOne approach is to use gensyms: guaranteed-unique symbols which can be used in a macro-expansion without threat of capture. The use of gensyms in a macro definition is a manual chore, but macros can be written which simplify the instantiation and use of gensyms.  Gensyms solve type 2 capture easily, but they are not applicable to type 1 capture in the same way, because the macro expansion cannot rename the interfering symbols in the surrounding code which capture its references. Gensyms could be used to provide stable aliases for the global symbols which the macro expansion needs. The macro expansion would use these secret aliases rather than the well-known names, so redefinition of the well-known names would have no ill effect on the macro.\n\nAnother approach is to use packages. A macro defined in its own package can simply use internal symbols in that package in its expansion. The use of packages deals with type 1 and type 2 capture.\n\nHowever, packages don't solve the type 1 capture of references to standard Common Lisp functions and operators. The reason is that the use of packages to solve capture problems revolves around the use of private symbols (symbols in one package, which are not imported into, or otherwise made visible in other packages).  Whereas the Common Lisp library symbols are external, and frequently imported into or made visible in user-defined packages.\n\nThe following is an example of unwanted capture in the operator namespace, occurring in the expansion of a macro:\n\n ;; expansion of UNTIL makes liberal use of DO\n (defmacro until (expression &body body)\n   `(do () (,expression) ,@body))\n\n ;; macrolet establishes lexical operator binding for DO\n (macrolet ((do (...) ... something else ...))\n   (until (= (random 10) 0) (write-line \"Hello\")))\n\nThe until macro will expand into a form which calls do which is intended to refer to the standard Common Lisp macro do. However, in this context, do may have a completely different meaning, so until may not work properly.\n\nCommon Lisp solves the problem of the shadowing of standard operators and functions by forbidding their redefinition. Because it redefines the standard operator do, the preceding is actually a fragment of non-conforming Common Lisp, which allows implementations to diagnose and reject it.\n\nCondition system\n\nThe condition system is responsible for exception handling in Common Lisp. It provides conditions, handlers and restarts. Conditions are objects describing an exceptional situation (for example an error). If a condition is signaled, the Common Lisp system searches for a handler for this condition type and calls the handler. The handler can now search for restarts and use one of these restarts to automatically repair the current problem, using information such as the condition type and any relevant information provided as part of the condition object, and call the appropriate restart function.\n\nThese restarts, if unhandled by code, can be presented to users (as part of a user interface, that of a debugger for example), so that the user can select and invoke one of the available restarts. Since the condition handler is called in the context of the error (without unwinding the stack), full error recovery is possible in many cases, where other exception handling systems would have already terminated the current routine. The debugger itself can also be customized or replaced using the *debugger-hook* dynamic variable. Code found within unwind-protect forms such as finalizers will also be executed as appropriate despite the exception.\n\nIn the following example (using Symbolics Genera) the user tries to open a file in a Lisp function test called from the Read-Eval-Print-LOOP (REPL), when the file does not exist. The Lisp system presents four restarts. The user selects the Retry OPEN using a different pathname restart and enters a different pathname (lispm-init.lisp instead of lispm-int.lisp). The user code does not contain any error handling code. The whole error handling and restart code is provided by the Lisp system, which can handle and repair the error without terminating the user code.\n\nCommand: (test \">zippy>lispm-int.lisp\")\n\nError: The file was not found.\n       For lispm:>zippy>lispm-int.lisp.newest\n\nLMFS:OPEN-LOCAL-LMFS-1\n   Arg 0: #P\"lispm:>zippy>lispm-int.lisp.newest\"\n\ns-A, : Retry OPEN of lispm:>zippy>lispm-int.lisp.newest\ns-B:           Retry OPEN using a different pathname\ns-C, :  Return to Lisp Top Level in a TELNET server\ns-D:           Restart process TELNET terminal\n\n-> Retry OPEN using a different pathname\nUse what pathname instead [default lispm:>zippy>lispm-int.lisp.newest]:\n   lispm:>zippy>lispm-init.lisp.newest\n\n...the program continues\n\nCommon Lisp Object System (CLOS)\n\nCommon Lisp includes a toolkit for object-oriented programming, the Common Lisp Object System or CLOS, which is one of the most powerful object systems available in any language. For example, Peter Norvig explains how many Design Patterns are simpler to implement in a dynamic language with the features of CLOS (Multiple Inheritance, Mixins, Multimethods, Metaclasses, Method combinations, etc.).[http://norvig.com/design-patterns/ppframe.htm Peter Norvig, Design Patterns in Dynamic Programming]\nSeveral extensions to Common Lisp for object-oriented programming have been proposed to be included into the ANSI Common Lisp standard, but eventually CLOS was adopted as the standard object-system for Common Lisp. CLOS is a dynamic object system with multiple dispatch and multiple inheritance, and differs radically from the OOP facilities found in static languages such as C++ or Java. As a dynamic object system, CLOS allows changes at runtime to generic functions and classes. Methods can be added and removed, classes can be added and redefined, objects can be updated for class changes and the class of objects can be changed.\n\nCLOS has been integrated into ANSI Common Lisp. Generic Functions can be used like normal functions and are a first-class data type. Every CLOS class is integrated into the Common Lisp type system. Many Common Lisp types have a corresponding class. There is more potential use of CLOS for Common Lisp. The specification does not say whether conditions are implemented with CLOS. Pathnames and streams could be implemented with CLOS. These further usage possibilities of CLOS for ANSI Common Lisp are not part of the standard. Actual Common Lisp implementations are using CLOS for pathnames, streams, input/output, conditions, the implementation of CLOS itself and more.\n\nCompiler and interpreter\n\nSeveral implementations of earlier Lisp dialects provided both an interpreter and a compiler. Unfortunately often the semantics were different. These earlier Lisps implemented lexical scoping in the compiler and dynamic scoping in the interpreter. Common Lisp requires that both the interpreter and compiler use lexical scoping by default. The Common Lisp standard describes both the semantics of the interpreter and a compiler. The compiler can be called using the function compile for individual functions and using the function compile-file for files. Common Lisp allows type declarations and provides ways to influence the compiler code generation policy. For the latter various optimization qualities can be given values between 0 (not important) and 3 (most important): speed, space, safety, debug and compilation-speed.\n\nThere is also a function to evaluate Lisp code: eval. eval takes code as pre-parsed s-expressions and not, like in some other languages, as text strings. This way code can be constructed with the usual Lisp functions for constructing lists and symbols and then this code can be evaluated with the function eval. Several Common Lisp implementations (like Clozure CL and SBCL) are implementing eval using their compiler. This way code is compiled, even though it is evaluated using the function eval.\n\nThe file compiler is invoked using the function compile-file.  The generated file with compiled code is called a fasl (from fast load) file. These fasl files and also source code files can be loaded with the function load into a running Common Lisp system. Depending on the implementation, the file compiler generates byte-code (for example for the Java Virtual Machine), C language code (which then is compiled with a C compiler) or, directly, native code.\n\nCommon Lisp implementations can be used interactively, even though the code gets fully compiled. The idea of an Interpreted language thus does not apply for interactive Common Lisp.\n\nThe language makes distinction between read-time, compile-time, load-time and run-time, and allows user code to also make this distinction to perform the wanted type of processing at the wanted step.\n\nSome special operators are provided to especially suit interactive development; for instance, defvar will only assign a value to its provided variable if it wasn't already bound, while defparameter will always perform the assignment. This distinction is useful when interactively evaluating, compiling and loading code in a live image.\n\nSome features are also provided to help writing compilers and interpreters. Symbols consist of first-level objects and are directly manipulable by user code.  The progv special operator allows to create lexical bindings programmatically, while packages are also manipulable. The Lisp compiler is available at runtime to compile files or individual functions. These make it easy to use Lisp as an intermediate compiler or interpreter for another language.\n\nCode examples\n\nBirthday paradox\n\nThe following program calculates the smallest number of people in a room for whom the probability of completely unique birthdays is less than 50% (the birthday paradox, where for 1 person the probability is obviously 100%, for 2 it is 364/365, etc.). The answer is 23.\n\n;;  By convention, constants in Common Lisp are enclosed with + characters.\n(defconstant +year-size+ 365)\n\n(defun birthday-paradox (probability number-of-people)\n  (let ((new-probability (* (/ (- +year-size+ number-of-people)\n                               +year-size+)\n                            probability)))\n    (if (\n\nCalling the example function using the REPL (Read Eval Print Loop):\n\nCL-USER > (birthday-paradox 1.0 1)\n23\n\nSorting a list of person objects\n\nWe define a class person and a method for displaying the name and age of a person.\nNext we define a group of persons as a list of person objects.\nThen we iterate over the sorted list.\n\n(defclass person ()\n  ((name :initarg :name :accessor person-name)\n   (age  :initarg :age  :accessor person-age))\n  (:documentation \"The class PERSON with slots NAME and AGE.\"))\n\n(defmethod display ((object person) stream)\n  \"Displaying a PERSON object to an output stream.\"\n  (with-slots (name age) object\n    (format stream \"~a (~a)\" name age)))\n\n(defparameter *group*\n  (list (make-instance 'person :name \"Bob\"   :age 33)\n        (make-instance 'person :name \"Chris\" :age 16)\n        (make-instance 'person :name \"Ash\"   :age 23))\n  \"A list of PERSON objects.\")\n\n(dolist (person (sort (copy-list *group*)\n                      #'>\n                      :key #'person-age))\n  (display person *standard-output*)\n  (terpri))\n\nIt prints the three names with descending age.\n\nBob (33)\nAsh (23)\nChris (16)\n\nExponentiating by squaring\n\nUse of the LOOP macro is demonstrated:\n\n(defun power (x n)\n  (loop with result = 1\n        while (plusp n)\n        when (oddp n) do (setf result (* result x))\n        do (setf x (* x x)\n                 n (truncate n 2))\n        finally (return result)))\n\nExample use:\n\nCL-USER > (power 2 200)\n1606938044258990275541962092341162602522202993782792835301376\n\nCompare with the built in exponentiation:\n\nCL-USER > (= (expt 2 200) (power 2 200))\nT\n\nFind the list of available shells\n\nWITH-OPEN-FILE is a macro that opens a file and provides a stream. When the form is returning, the file is automatically closed. FUNCALL calls a function object. The LOOP collects all lines that match the predicate.\n\n(defun list-matching-lines (file predicate)\n  \"Returns a list of lines in file, for which the predicate applied to\n the line returns T.\"\n  (with-open-file (stream file)\n    (loop for line = (read-line stream nil nil)\n          while line\n          when (funcall predicate line)\n          collect it)))\n\nThe function AVAILABLE-SHELLS calls above function LIST-MATCHING-LINES with a pathname and an anonymous function as the predicate. The predicate returns the pathname of a shell or NIL (if the string is not the filename of a shell).\n\n(defun available-shells (&optional (file #p\"/etc/shells\"))\n  (list-matching-lines\n   file\n   (lambda (line)\n     (and (plusp (length line))\n          (char= (char line 0) #\\/)\n          (pathname\n           (string-right-trim '(#\\space #\\tab) line))))))\n\nExample results (on Mac OS X 10.6):\n\nCL-USER > (available-shells)\n(#P\"/bin/bash\" #P\"/bin/csh\" #P\"/bin/ksh\" #P\"/bin/sh\" #P\"/bin/tcsh\" #P\"/bin/zsh\")\n\nComparison with other Lisps\n\nCommon Lisp is most frequently compared with, and contrasted to, Scheme—if only because they are the two most popular Lisp dialects. Scheme predates CL, and comes not only from the same Lisp tradition but from some of the same engineers—Guy L. Steele, with whom Gerald Jay Sussman designed Scheme, chaired the standards committee for Common Lisp.\n\nCommon Lisp is a general-purpose programming language, in contrast to Lisp variants such as Emacs Lisp and AutoLISP which are extension languages embedded in particular products (GNU Emacs and AutoCAD). Unlike many earlier Lisps, Common Lisp (like Scheme) uses lexical variable scope by default for both interpreted and compiled code.\n\nMost of the Lisp systems whose designs contributed to Common Lisp—such as ZetaLisp and Franz Lisp—used dynamically scoped variables in their interpreters and lexically scoped variables in their compilers. Scheme introduced the sole use of lexically scoped variables to Lisp; an inspiration from ALGOL 68 which was widely recognized as a good idea. CL supports dynamically scoped variables as well, but they must be explicitly declared as \"special\". There are no differences in scoping between ANSI CL interpreters and compilers.\n\nCommon Lisp is sometimes termed a Lisp-2 and Scheme a Lisp-1, referring to CL's use of separate namespaces for functions and variables. (In fact, CL has many namespaces, such as those for go tags, block names, and loop keywords). There is a long-standing controversy between CL and Scheme advocates over the tradeoffs involved in multiple namespaces. In Scheme, it is (broadly) necessary to avoid giving variables names which clash with functions; Scheme functions frequently have arguments named lis, lst, or lyst so as not to conflict with the system function list. However, in CL it is necessary to explicitly refer to the function namespace when passing a function as an argument—which is also a common occurrence, as in the sort example above.\n\nCL also differs from Scheme in its handling of boolean values. Scheme uses the special values #t and #f to represent truth and falsity. CL follows the older Lisp convention of using the symbols T and NIL, with NIL standing also for the empty list. In CL, any non-NIL value is treated as true by conditionals, such as if, whereas in Scheme all non-#f values are treated as true. These conventions allow some operators in both languages to serve both as predicates (answering a boolean-valued question) and as returning a useful value for further computation, but in Scheme the value '() which is equivalent to NIL in Common Lisp evaluates to true in a boolean expression.\n\nLastly, the Scheme standards documents require tail-call optimization, which the CL standard does not. Most CL implementations do offer tail-call optimization, although often only when the programmer uses an optimization directive. Nonetheless, common CL coding style does not favor the ubiquitous use of recursion that Scheme style prefers—what a Scheme programmer would express with tail recursion, a CL user would usually express with an iterative expression in do, dolist, loop, or (more recently) with the iterate package.\n\nImplementations\n\nSee the Category Common Lisp implementations.\n\nCommon Lisp is defined by a specification (like Ada and C) rather than by one implementation (like Perl before version 6). There are many implementations, and the standard details areas in which they may validly differ.\n\nIn addition, implementations tend to come with extensions, which provide functionality not covered in the standard:\n\n* Interactive Top-Level (REPL)\n* Garbage Collection\n* Debugger, Stepper and Inspector\n* Weak data structures (hash tables)\n* Extensible sequences\n* Extensible LOOP\n* Environment access\n* CLOS Meta-object Protocol\n* CLOS based extensible streams\n* CLOS based Condition System\n* Network streams\n* Persistent CLOS\n* Unicode support\n* Foreign-Language Interface (often to C)\n* Operating System interface\n* Java Interface\n* Threads and Multiprocessing\n* Application delivery (applications, dynamic libraries)\n* Saving of images\n\nFree and open-source software libraries have been created to support extensions to Common Lisp in a portable way, and are most notably found in the repositories of the [http://common-lisp.net/ Common-Lisp.net] and [http://clocc.sourceforge.net/ Common Lisp Open Code Collection] projects.\n\nCommon Lisp implementations may use any mix of native code compilation, byte code compilation or interpretation. Common Lisp has been designed to support incremental compilers, file compilers and block compilers. Standard declarations to optimize compilation (such as function inlining or type specialization) are proposed in the language specification. Most Common Lisp implementations compile source code to native machine code. Some implementations can create (optimized) stand-alone applications. Others compile to interpreted bytecode, which is less efficient than native code, but eases binary-code portability. There are also compilers that compile Common Lisp code to C code. The misconception that Lisp is a purely interpreted language is most likely because Lisp environments provide an interactive prompt and that code is compiled one-by-one, in an incremental way. With Common Lisp incremental compilation is widely used.\n\nSome Unix-based implementations (CLISP, SBCL) can be used as a scripting language; that is, invoked by the system transparently in the way that a Perl or Unix shell interpreter is.[http://clisp.cons.org/impnotes/quickstart.html#quickstart-unix CLISP as a scripting language under Unix]\n\nList of implementations\n\nCommercial implementations\n\n; Allegro Common Lisp: for Microsoft Windows, FreeBSD, Linux, Apple macOS and various UNIX variants. Allegro CL provides an Integrated Development Environment (IDE) (for Windows and Linux) and extensive capabilities for application delivery.\n; Liquid Common Lisp: formerly called Lucid Common Lisp. Only maintenance, no new releases.\n; LispWorks: for Microsoft Windows, FreeBSD, Linux, Apple macOS, iOS, Android and various UNIX variants. LispWorks provides an Integrated Development Environment (IDE) (available for all platforms, but not for iOS and Android) and extensive capabilities for application delivery.\n; mocl: for iOS, Android and macOS.\n; Open Genera: for DEC Alpha.\n; Scieneer Common Lisp: which is designed for high-performance scientific computing.\n\nFreely redistributable implementations\n\n; Armed Bear Common Lisp (ABCL) : A CL implementation that runs on the Java Virtual Machine. It includes a compiler to Java byte code, and allows access to Java libraries from CL. It was formerly just a component of the Armed Bear J Editor.\n; CLISP: A bytecode-compiling implementation, portable and runs on a number of Unix and Unix-like systems (including macOS), as well as Microsoft Windows and several other systems.\n; Clozure CL (CCL) : Originally a free and open-source fork of Macintosh Common Lisp. As that history implies, CCL was written for the Macintosh, but Clozure CL now runs on macOS, FreeBSD, Linux, Solaris and Windows. 32 and 64 bit x86 ports are supported on each platform. Additionally there are Power PC ports for Mac OS and Linux. CCL was previously known as OpenMCL, but that name is no longer used, to avoid confusion with the open source version of Macintosh Common Lisp.\n; CMUCL: Originally from Carnegie Mellon University, now maintained as free and open-source software by a group of volunteers. CMUCL uses a fast native-code compiler. It is available on Linux and BSD for Intel x86; Linux for Alpha; macOS for Intel x86 and PowerPC; and Solaris, IRIX, and HP-UX on their native platforms.\n; Corman Common Lisp: for Microsoft Windows. In January 2015 Corman Lisp has been published under MIT license.\n; Embeddable Common Lisp (ECL) : ECL includes a bytecode interpreter and compiler. It can also compile Lisp code to machine code via a C compiler. ECL then compiles Lisp code to C, compiles the C code with a C compiler and can then load the resulting machine code. It is also possible to embed ECL in C programs, and C code into Common Lisp programs.\n; GNU Common Lisp (GCL) : The GNU Project's Lisp compiler. Not yet fully ANSI-compliant, GCL is however the implementation of choice for several large projects including the mathematical tools Maxima, AXIOM and (historically) ACL2. GCL runs on Linux under eleven different architectures, and also under Windows, Solaris, and FreeBSD.\n; Macintosh Common Lisp (MCL) : Version 5.2 for Apple Macintosh computers with a PowerPC processor running Mac OS X is open source. RMCL (based on MCL 5.2) runs on Intel-based Apple Macintosh computers using the Rosetta binary translator from Apple.\n; ManKai Common Lisp (MKCL) : A branch of ECL. MKCL emphasises reliability, stability and overall code quality through a heavily reworked, natively multi-threaded, runtime system. On Linux, MKCL features a fully POSIX compliant runtime system.\n; Movitz: Implements a Lisp environment for x86 computers without relying on any underlying OS.\n; Poplog: Poplog implements a version of CL, with POP-11, and optionally Prolog, and Standard ML (SML), allowing mixed language programming. For all, the implementation language is POP-11, which is compiled incrementally. It also has an integrated Emacs-like editor that communicates with the compiler.\n; Steel Bank Common Lisp (SBCL) : A branch from CMUCL. \"Broadly speaking, SBCL is distinguished from CMU CL by a greater emphasis on maintainability.\" SBCL runs on the platforms CMUCL does, except HP/UX; in addition, it runs on Linux for AMD64, PowerPC, SPARC, MIPS, Windows x86 and has experimental support for running on Windows AMD64. SBCL does not use an interpreter by default; all expressions are compiled to native code unless the user switches the interpreter on. The SBCL compiler generates fast native code according to a previous version of The Computer Language Benchmarks Game.[https://web.archive.org/web/20130520184339/http://benchmarksgame.alioth.debian.org/u32q/benchmark.php?testall&lang\nall SBCL ranks above other dynamic language implementations in the 'Computer Language Benchmark Game']\n; Ufasoft Common Lisp: port of CLISP for windows platform with core written in C++.\n\nOther implementations\n\n; Austin Kyoto Common Lisp : an evolution of Kyoto Common Lisp by Bill Schelter\n; Butterfly Common Lisp : an implementation written in Scheme for the BBN Butterfly multi-processor computer[https://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/impl/bbn/0.html BBN Butterfly Common Lisp at the CMU AI Repository][http://www.aaai.org/Papers/AAAI/1987/AAAI87-001.pdf  Recent Developments in Butterfly Lisp, 1987, AAAI Proceedings]\n; CLICC : a Common Lisp to C compiler[http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.38.1282 CLICC - A New Approach to the Compilation of Common Lisp Programs to C, by O. Burkart , W. Goerigk , H. Knutzen, 1992]\n; CLOE : Common Lisp for PCs by Symbolics\n; Codemist Common Lisp : used for the commercial version of the computer algebra system Axiom[http://lisp.codemist.co.uk Codemist Common Lisp][http://www.axiom-developer.org/axiom-website/bookvol4.pdf Axiom, the 30 year horizon, page 43]\n; ExperCommon Lisp : an early implementation for the Apple Macintosh by ExperTelligence\n; Golden Common Lisp: an implementation for the PC by GoldHill Inc.[http://www.goldhill-inc.com/developer.html Golden Common Lisp Developer]Golden Common LISP: A Hands-On Approach, David J. Steele, June 2000 by Addison Wesley Publishing Company\n; Ibuki Common Lisp : a commercialized version of Kyoto Common Lisp\n; Kyoto Common Lisp: the first Common Lisp compiler that used C as a target language. GCL, ECL and MKCL originate from this Common Lisp implementation.\n; L : a small version of Common Lisp for embedded systems developed by IS Robotics, now iRobot[http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.2.1953 L, A Common Lisp for Embedded Systems (1995)]\n; Lisp Machines (from Symbolics, TI[http://bitsavers.trailing-edge.com/pdf/ti/explorer/2549830-0001A_PgmgConcepts.pdf TI Explorer Programming Concepts][http://bitsavers.trailing-edge.com/pdf/ti/explorer/2243201-0001_LispRef.pdf TI Explorer Lisp Reference] and Xerox[http://bitsavers.trailing-edge.com/pdf/xerox/interlisp-d/198809_Medley_1.0/400006_Lisp_Release_Notes_Medley_Release_1.0_Sep88.pdf Medley Lisp Release Notes]): provided implementations of Common Lisp in addition to their native Lisp dialect (Lisp Machine Lisp or Interlisp). CLOS was also available. Symbolics provides an enhanced version Common Lisp.[http://bitsavers.trailing-edge.com/pdf/symbolics/software/open_genera/Symbolics_Common_Lisp_Dictionary.pdf Symbolics Common Lisp Dictionary][http://bitsavers.trailing-edge.com/pdf/symbolics/software/open_genera/Symbolics_Common_Lisp_Language_Concepts.pdf Symbolics Common Lisp Language Concepts][http://bitsavers.trailing-edge.com/pdf/symbolics/software/open_genera/Symbolics_Common_Lisp_Programming_Constructs.pdf Symbolics Common Lisp Programming Constructs]\n; Procyon Common Lisp : an implementation for Windows and Mac OS, used by Franz for their Windows port of Allegro CL\n; Star Sapphire Common LISP : an implementation for the PC\n; SubL: a variant of Common Lisp used for the implementation of the Cyc knowledge-based system[http://www.cyc.com/documentation/subl-reference/ SubL reference]\n; Top Level Common Lisp : an early implementation for concurrent execution[http://www.softwarepreservation.org/projects/LISP/toplevel Top Level Common Lisp Information at the Computer History Museum]\n; WCL : a shared library implementation[http://dl.acm.org/citation.cfm?id=141560 WCL: Delivering efficient Common Lisp applications under Unix , Proceedings of the 1992 ACM conference on LISP and functional programming], Pages 260-269[http://pgc.com/commonlisp/ WCL 3.0 - Embeddable Common Lisp for Linux,   by Wade Hennessey] \n; Vax Common Lisp: Digital Equipment Corporation's implementation that ran on VAX systems running VMS or ULTRIX\n; XLISP : an implementation written by David Betz[https://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/impl/xlisp/0.html XLISP page at the CMU AI Repository]\n\nApplications\n\nSee the Category Common Lisp software.\n\nCommon Lisp is used to develop research applications (often in Artificial Intelligence), for rapid development of prototypes or for deployed applications.\n\nCommon Lisp is used in many commercial applications, including the Yahoo! Store web-commerce site, which originally involved Paul Graham and was later rewritten in C++ and Perl.\"In January 2003, Yahoo released a new version of the editor written in C++ and Perl. It's hard to say whether the program is no longer written in Lisp, though, because to translate this program into C++ they literally had to write a Lisp interpreter: the source files of all the page-generating templates are still, as far as I know, Lisp code.\" Paul Graham, [http://www.paulgraham.com/avg.html Beating the Averages] Other notable examples include:\n\n* ACT-R, a cognitive architecture used in a large number of research projects.\n* Authorizer's Assistant,[http://www.aaai.org/Papers/IAAI/1989/IAAI89-031.pdf Authorizer's Assistant][http://www.prenhall.com/divisions/bp/app/alter/student/useful/ch9amex.html American Express Authorizer's Assistant]  a large rule-based system used by American Express, analyzing credit requests.\n* Cyc, a long running project with the aim to create a knowledge-based system that provides a huge amount of common sense knowledge\n* The Dynamic Analysis and Replanning Tool (DART), which is said to alone have paid back during the years from 1991 to 1995 for all thirty years of DARPA investments in AI research.\n* Gensym G2, a real-time expert system and business rules engine (BRE)[http://www.gensym.com/platforms/g2-standard/ Real-time Application Development]. Gensym. Retrieved on 2016-08-16.\n* [http://www.genworks.com Genworks GDL], based on the open-source [https://github.com/genworks/gendl Gendl] kernel.\n* The development environment for the Jak and Daxter video game series, developed by Naughty Dog.\n* ITA Software's low fare search engine, used by travel websites such as Orbitz and Kayak.com and airlines such as American Airlines, Continental Airlines and US Airways.\n* Mirai, a 3d graphics suite. It was used to animate the face of Gollum in the movie Lord of the Rings: The Two Towers.\n* Prototype Verification System (PVS), a mechanized environment for formal specification and verification.\n* PWGL is a sophisticated visual programming environment based on Common Lisp, used in Computer assisted composition and sound synthesis.[http://www2.siba.fi/PWGL/ PWGL - Home]. . Retrieved on 2013-07-17. \n* SPIKE, a scheduling system for earth or space based observatories and satellites, notably the Hubble Space Telescope.[http://www.stsci.edu/resources/software_hardware/spike/ Spike Planning and Scheduling System]. Stsci.edu. Retrieved on 2013-07-17.\n\nThere also exist open-source applications written in Common Lisp, such as:\n\n* ACL2, a full-featured automated theorem prover for an applicative variant of Common Lisp.\n* Axiom, a sophisticated computer algebra system.\n* Maxima, a sophisticated computer algebra system.\n* OpenMusic is an object-oriented visual programming environment based on Common Lisp, used in Computer assisted composition.\n* Stumpwm, a tiling, keyboard driven X11 Window Manager written entirely in Common Lisp.\n\nLibraries\n\nSince 2011 Zach Beane, with support of the Common Lisp Foundation, maintains the Quicklisp library manager. It allows easy access to several hundred libraries written in Common Lisp.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Common Lisp" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6068" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Common Lisp (CL) is a dialect of the Lisp programming language, published in ANSI standard document ANSI INCITS 226-1994 (R2004) (formerly X3.226-1994 (R1999)).Quoted from cover of cited standard.  ANSI INCITS 226-1994 (R2004), for sale on standard's [http://webstore.ansi.org/RecordDetail.aspx?sku=ANSI+INCITS+226-1994+(R2004) document page]. The Common Lisp HyperSpec, a hyperlinked HTML version, has been derived from the ANSI Common Lisp standard.[http://www.lispworks.com/documentation/HyperSpec/Front/Help.htm#Authorship Authorship of the Common Lisp HyperSpec]\n\nThe Common Lisp language was developed as a standardized and improved successor of Maclisp. By the early 1980s several groups were already at work on diverse successors to MacLisp: Lisp Machine Lisp (aka ZetaLisp), Spice Lisp, NIL and S-1 Lisp. Common Lisp sought to unify, standardise, and extend the features of these MacLisp dialects. Common Lisp is not an implementation, but rather a language specification.[http://www.lispworks.com/documentation/HyperSpec/Body/01_ab.htm Common Lisp HyperSpec 1.1.2 History] Several implementations of the Common Lisp standard are available, including free and open-source software and proprietary products.[http://common-lisp.net/~dlw/LispSurvey.html Common Lisp Implementations: A Survey]\nCommon Lisp is a general-purpose, multi-paradigm programming language. It supports a combination of procedural, functional, and object-oriented programming paradigms. As a dynamic programming language, it facilitates evolutionary and incremental software development, with iterative compilation into efficient run-time programs. This incremental development is often done interactively without interrupting the running application.\n\nIt also supports optional type annotation and casting, which can be added as necessary at the later profiling and optimization stages, to permit the compiler to generate more efficient code. For instance, fixnum can hold an unboxed integer in a range supported by the hardware and implementation, permitting more efficient arithmetic than on big integers or arbitrary precision types.  Similarly, the compiler can be told on a per-module or per-function basis which type safety level is wanted, using optimize declarations.\n\nCommon Lisp includes CLOS, an object system that supports multimethods and method combinations. It is often implemented with a Metaobject Protocol.\n\nCommon Lisp is extensible through standard features such as Lisp macros (code transformations) and reader macros (input parsers for characters).\n\nCommon Lisp provides some backwards compatibility to Maclisp and to John McCarthy's original Lisp. This allows older Lisp software to be ported to Common Lisp.\n\nHistory\n\nWork on Common Lisp started in 1981 after an initiative by ARPA manager Bob Engelmore to develop a single community standard Lisp dialect.[http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/doc/history/cl.txt Roots of \"Yu-Shiang Lisp\", Mail from Jon L White, 1982] Much of the initial language design was done via electronic mail.[http://cl-su-ai.lisp.se/maillist.html ARPANET Common Lisp mailing list, starting in 1981][http://ccs.mit.edu/papers/CCSWP150.html Knee-jerk Anti-LOOPism and other E-mail Phenomena: Oral, Written, and Electronic Patterns in Computer-Mediated Communication, JoAnne Yates and Wanda J. Orlikowski., 1993]  In 1982, Guy L. Steele, Jr. gave the first overview of Common Lisp at the 1982 ACM Symposium on LISP and functional programming.[http://dl.acm.org/citation.cfm?doid=800068.802140 An overview of COMMON LISP, Guy L. Steele, Jr.. LFP '82 Proceedings of the 1982 ACM symposium on LISP and functional programming Pages 98-107]\n\nThe first language documentation was published 1984 as Common Lisp the Language, first edition. A second edition, published in 1990, incorporated many changes to the language, made during the ANSI Common Lisp standardization process. The final ANSI Common Lisp standard then was published in 1994. Since then no update to the standard has been published. Various extensions and improvements to Common Lisp (examples are Unicode, Concurrency, CLOS-based IO) have been provided by implementations and libraries (many available via Quicklisp).\n\nSyntax\n\nCommon Lisp is a dialect of Lisp; it uses S-expressions to denote both code and data structure. Function calls, macro forms and special forms are written as lists, with the name of the operator first, as in these examples:\n\n (+ 2 2)           ; adds 2 and 2, yielding 4. The function's name is '+'. Lisp has no operators as such.\n\n (defvar *x*)      ; Ensures that a variable *x* exists,\n                   ; without giving it a value. The asterisks are part of\n                   ; the name, by convention denoting a special (global) variable. \n                   ; The symbol *x* is also hereby endowed with the property that\n                   ; subsequent bindings of it are dynamic, rather than lexical.\n (setf *x* 42.1)   ; sets the variable *x* to the floating-point value 42.1\n\n ;; Define a function that squares a number:\n (defun square (x)\n   (* x x))\n\n ;; Execute the function:\n (square 3)        ; Returns 9\n\n ;; the 'let' construct creates a scope for local variables. Here\n ;; the variable 'a' is bound to 6 and the variable 'b' is bound\n ;; to 4. Inside the 'let' is a 'body', where the last computed value is returned.\n ;; Here the result of adding a and b is returned from the 'let' expression.\n ;; The variables a and b have lexical scope, unless the symbols have been\n ;; marked as special variables (for instance by a prior DEFVAR).\n (let ((a 6)\n       (b 4))\n   (+ a b))        ; returns 10\n\nData types\n\nCommon Lisp has many data types.\n\nScalar types\n\nNumber types include integers, ratios, floating-point numbers, and complex numbers. Common Lisp uses bignums to represent numerical values of arbitrary size and precision. The ratio type represents fractions exactly, a facility not available in many languages. Common Lisp automatically coerces numeric values among these types as appropriate.\n\nThe Common Lisp character type is not limited to ASCII characters. Most modern implementations allow Unicode characters.\n\nThe symbol type is common to Lisp languages, but largely unknown outside them. A symbol is a unique, named data object with several parts: name, value, function, property list and package. Of these, value cell and function cell are the most important. Symbols in Lisp are often used similarly to identifiers in other languages: to hold the value of a variable; however there are many other uses. Normally, when a symbol is evaluated, its value is returned. Some symbols evaluate to themselves, for example all symbols in the keyword package are self-evaluating. Boolean values in Common Lisp are represented by the self-evaluating symbols T and NIL. Common Lisp has namespaces for symbols, called 'packages'.\n\nA number of functions are available for rounding scalar numeric values in various ways. The function round rounds the argument to the nearest integer, with halfway cases rounded to the even integer. The functions truncate, floor, and ceiling round towards zero, down, or up respectively.  All these functions return the discarded fractional part as a secondary value. For example, (floor -2.5) yields -3, 0.5; (ceiling -2.5)  yields -2, -0.5; (round 2.5) yields 2, 0.5; and (round 3.5) yields 4, -0.5.\n\nData structures\n\nSequence types in Common Lisp include lists, vectors, bit-vectors, and strings. There are many operations that can work on any sequence type.\n\nAs in almost all other Lisp dialects, lists in Common Lisp are composed of conses, sometimes called cons cells or pairs. A cons is a data structure with two slots, called its car and cdr. A list is a linked chain of conses or the empty list. Each cons's car refers to a member of the list (possibly another list). Each cons's cdr refers to the next cons—except for the last cons in a list, whose cdr refers to the nil value. Conses can also easily be used to implement trees and other complex data structures; though it is usually advised to use structure or class instances instead. It is also possible to create circular data structures with conses.\n\nCommon Lisp supports multidimensional arrays, and can dynamically resize adjustable arrays if required. Multidimensional arrays can be used for matrix mathematics. A vector is a one-dimensional array. Arrays can carry any type as members (even mixed types in the same array) or can be specialized to contain a specific type of members, as in a vector of bits. Usually only a few types are supported. Many implementations can optimize array functions when the array used is type-specialized. Two type-specialized array types are standard: a string is a vector of characters, while a bit-vector is a vector of bits.\n\nHash tables store associations between data objects. Any object may be used as key or value. Hash tables are automatically resized as needed.\n\nPackages are collections of symbols, used chiefly to separate the parts of a program into namespaces. A package may export some symbols, marking them as part of a public interface. Packages can use other packages.\n\nStructures, similar in use to C structs and Pascal records, represent arbitrary complex data structures with any number and type of fields (called slots). Structures allow single-inheritance.\n\nClasses are similar to structures, but offer more dynamic features and multiple-inheritance. (See CLOS). Classes have been added late to Common Lisp and there is some conceptual overlap with structures. Objects created of classes are called Instances. A special case are Generic Functions. Generic Functions are both functions and instances.\n\nFunctions\n\nCommon Lisp supports first-class functions.  For instance, it is possible to write functions that take other functions as arguments or return functions as well.  This makes it possible to describe very general operations.\n\nThe Common Lisp library relies heavily on such higher-order functions. For example, the sort function takes a relational operator as an argument and key function as an optional keyword argument. This can be used not only to sort any type of data, but also to sort data structures according to a key.\n\n ;; Sorts the list using the > and )   ; Returns (6 5 4 3 2 1)\n (sort (list 5 2 6 3 1 4) #'\n\n ;; Sorts the list according to the first element of each sub-list.\n (sort (list '(9 A) '(3 B) '(4 C)) #'\n\nThe evaluation model for functions is very simple.  When the evaluator encounters a form (f a1 a2...) then it presumes that the symbol named f is one of the following:\n\n# A special operator (easily checked against a fixed list)\n# A macro operator (must have been defined previously)\n# The name of a function (default), which may either be a symbol, or a sub-form beginning with the symbol lambda.\n\nIf f is the name of a function, then the arguments a1, a2, ..., an are evaluated in left-to-right order, and the function is found and invoked with those values supplied as parameters.\n\nDefining functions\n\nThe macro defun defines functions where a function definition gives the name of the function, the names of any arguments, and a function body:\n\n (defun square (x)\n   (* x x))\n\nFunction definitions may include compiler directives, known as declarations, which provide hints to the compiler about optimization settings or the data types of arguments. They may also include documentation strings (docstrings), which the Lisp system may use to provide interactive documentation:\n\n (defun square (x)\n   \"Calculates the square of the single-float x.\"\n   (declare (single-float x) (optimize (speed 3) (debug 0) (safety 1)))\n   (the single-float (* x x)))\n\nAnonymous functions (function literals) are defined using lambda expressions, e.g. (lambda (x) (* x x)) for a function that squares its argument. Lisp programming style frequently uses higher-order functions for which it is useful to provide anonymous functions as arguments.\n\nLocal functions can be defined with flet and labels.\n\n (flet ((square (x)\n          (* x x)))\n   (square 3))\n\nThere are a number of other operators related to the definition and manipulation of functions. For instance, a function may be compiled with the compile operator. (Some Lisp systems run functions using an interpreter by default unless instructed to compile; others compile every function).\n\nDefining generic functions and methods\n\nThe macro defgeneric defines generic functions.\nThe macro defmethod defines methods. Generic functions are a collection of methods.\n\nMethods can specialize their parameters over CLOS standard classes, system classes, structure classes or objects. For many types there are corresponding system classes.\n\nWhen a generic function is called, multiple-dispatch will determine the effective method to use.\n\n (defgeneric add (a b))\n\n (defmethod add ((a number) (b number))\n    (+ a b))\n\n (defmethod add ((a vector) (b number))\n    (map 'vector (lambda (n) (+ n b)) a))\n\n (defmethod add ((a vector) (b vector))\n    (map 'vector #'+ a b))\n\n(defmethod add ((a string) (b string))\n  (concatenate 'string a b) )\n\n (add 2 3)                   ; returns 5\n (add #(1 2 3 4) 7)          ; returns #(8 9 10 11)\n (add #(1 2 3 4) #(4 3 2 1)) ; returns #(5 5 5 5)\n (add \"COMMON \" \"LISP\")      ; returns \"COMMON LISP\"\n\nGeneric Functions are also a first class data type. There are many more features to Generic Functions and Methods than described above.\n\nThe function namespace\n\nThe namespace for function names is separate from the namespace for data variables. This is a key difference between Common Lisp and Scheme. For Common Lisp, operators that define names in the function namespace include defun, flet, labels, defmethod and defgeneric.\n\nTo pass a function by name as an argument to another function, one must use the function special operator, commonly abbreviated as #'. The first sort example above refers to the function named by the symbol > in the function namespace, with the code #'>. Conversely, to call a function passed in such a way, one would use the funcall operator on the argument.\n\nScheme's evaluation model is simpler: there is only one namespace, and all positions in the form are evaluated (in any order) -- not just the arguments. Code written in one dialect is therefore sometimes confusing to programmers more experienced in the other. For instance, many Common Lisp programmers like to use descriptive variable names such as list or string which could cause problems in Scheme, as they would locally shadow function names.\n\nWhether a separate namespace for functions is an advantage is a source of contention in the Lisp community. It is usually referred to as the Lisp-1 vs. Lisp-2 debate. Lisp-1 refers to Scheme's model and Lisp-2 refers to Common Lisp's model. These names were coined in a 1988 paper by Richard P. Gabriel and Kent Pitman, which extensively compares the two approaches.\n\nMultiple return values\n\nCommon Lisp supports the concept of multiple values, where any expression always has a single primary value, but it might also have any number of secondary values, which might be received and inspected by interested callers. This concept is distinct from returning a list value, as the secondary values are fully optional, and passed via a dedicated side channel. This means that callers may remain entirely unaware of the secondary values being there if they have no need for them, and it makes it convenient to use the mechanism for communicating information that is sometimes useful, but not always necessary. For example,\n\n* The TRUNCATE function rounds the given number to an integer towards zero. However, it also returns a remainder as a secondary value, making it very easy to determine what value was truncated. It also supports an optional divisor parameter, which can be used to perform Euclidean division trivially:\n\n(let ((x 1266778)\n      (y 458))\n  (multiple-value-bind (quotient remainder)\n      (truncate x y)\n    (format nil \"~A divided by ~A is ~A remainder ~A\" x y quotient remainder)))\n\n;;;; => \"1266778 divided by 458 is 2765 remainder 408\"\n\n* GETHASH returns the value of a key in an associative map, or the default value otherwise, and a secondary boolean indicating whether the value was found. Thus code which does not care about whether the value was found or provided as the default can simply use it as-is, but when such distinction is important, it might inspect the secondary boolean and react appropriately. Both use cases are supported by the same call and neither is unnecessarily burdened or constrained by the other. Having this feature at the language level removes the need to check for the existence of the key or compare it to null as would be done in other languages.\n\n(defun get-answer (library)\n  (gethash 'answer library 42))\n\n(defun the-answer-1 (library)\n  (format nil \"The answer is ~A\" (get-answer library)))\n;;;; Returns \"The answer is 42\" if ANSWER not present in LIBRARY\n\n(defun the-answer-2 (library)\n  (multiple-value-bind (answer sure-p)\n      (get-answer library)\n    (if (not sure-p)\n        \"I don't know\"\n     (format nil \"The answer is ~A\" answer))))\n;;;; Returns \"I don't know\" if ANSWER not present in LIBRARY\n\nMultiple values are supported by a handful of standard forms, most common of which are the MULTIPLE-VALUE-BIND special form for accessing secondary values and VALUES for returning multiple values:\n\n(defun magic-eight-ball ()\n  \"Return an outlook prediction, with the probability as a secondary value\"\n  (values \"Outlook good\" (random 1.0)))\n\n;;;; => \"Outlook good\"\n;;;; => 0.3187\n\nOther types\n\nOther data types in Common Lisp include:\n\n*Pathnames represent files and directories in the filesystem. The Common Lisp pathname facility is more general than most operating systems' file naming conventions, making Lisp programs' access to files broadly portable across diverse systems.\n*Input and output streams represent sources and sinks of binary or textual data, such as the terminal or open files.\n*Common Lisp has a built-in pseudo-random number generator (PRNG). Random state objects represent reusable sources of pseudo-random numbers, allowing the user to seed the PRNG or cause it to replay a sequence.\n*Conditions are a type used to represent errors, exceptions, and other \"interesting\" events to which a program may respond.\n*Classes are first-class objects, and are themselves instances of classes called metaobject classes (metaclasses for short).\n*Readtables are a type of object which control how Common Lisp's reader parses the text of source code.  By controlling which readtable is in use when code is read in, the programmer can change or extend the language's syntax.\n\nScope\n\nLike programs in many other programming languages, Common Lisp programs make use of names to refer to variables, functions, and many other kinds of entities. Named references are subject to scope.\n\nThe association between a name and the entity which the name refers to is called a binding.\n\nScope refers to the set of circumstances in which a name is determined to have a particular binding.\n\nDeterminers of scope\n\nThe circumstances which determine scope in Common Lisp include:\n\n* the location of a reference within an expression. If it's the leftmost position of a compound, it refers to a special operator or a macro or function binding, otherwise to a variable binding or something else.\n* the kind of expression in which the reference takes place. For instance, (go x) means transfer control to label x, whereas (print x) refers to the variable x. Both scopes of x can be active in the same region of program text, since tagbody labels are in a separate namespace from variable names. A special form or macro form has complete control over the meanings of all symbols in its syntax. For instance, in (defclass x (a b) ()), a class definition, the (a b) is a list of base classes, so these names are looked up in the space of class names, and x isn't a reference to an existing binding, but the name of a new class being derived from a and b. These facts emerge purely from the semantics of defclass. The only generic fact about this expression is that defclass refers to a macro binding; everything else is up to defclass.\n* the location of the reference within the program text. For instance, if a reference to variable x is enclosed in a binding construct such as a let which defines a binding for x, then the reference is in the scope created by that binding.\n* for a variable reference, whether or not a variable symbol has been, locally or globally, declared special. This determines whether the reference is resolved within a lexical environment, or within a dynamic environment.\n* the specific instance of the environment in which the reference is resolved. An environment is a run-time dictionary which maps symbols to bindings. Each kind of reference uses its own kind of environment. References to lexical variables are resolved in a lexical environment, et cetera. More than one environment can be associated with the same reference. For instance, thanks to recursion or the use of multiple threads, multiple activations of the same function can exist at the same time. These activations share the same program text, but each has its own lexical environment instance.\n\nTo understand what a symbol refers to, the Common Lisp programmer must know what kind of reference is being expressed, what kind of scope it uses if it is a variable reference (dynamic versus lexical scope), and also the run-time situation: in what environment is the reference resolved, where was the binding introduced into the environment, et cetera.\n\nKinds of environment\n\nGlobal\n\nSome environments in Lisp are globally pervasive. For instance, if a new type is defined, it is known everywhere thereafter. References to that type look it up in this global environment.\n\nDynamic\n\nOne type of environment in Common Lisp is the dynamic environment. Bindings established in this environment have dynamic extent, which means that a binding is established at the start of the execution of some construct, such as a let block, and disappears when that construct finishes executing: its lifetime is tied to the dynamic activation and deactivation of a block. However, a dynamic binding is not just visible within that block; it is also visible to all functions invoked from that block.  This type of visibility is known as indefinite scope. Bindings which exhibit dynamic extent (lifetime tied to the activation and deactivation of a block) and indefinite scope  (visible to all functions which are called from that block) are said to have dynamic scope.\n\nCommon Lisp has support for dynamically scoped variables, which are also called special variables.  Certain other kinds of bindings are necessarily dynamically scoped also, such as restarts and catch tags.  Function bindings cannot be dynamically scoped using flet (which only provides lexically scoped function bindings), but function objects (a first-level object in Common Lisp) can be assigned to dynamically scoped variables, bound using let in dynamic scope, then called using funcall or APPLY.\n\nDynamic scope is extremely useful because it adds referential clarity and discipline to global variables. Global variables are frowned upon in computer science as potential sources of error, because they can give rise to ad-hoc, covert channels of communication among modules that lead to unwanted, surprising interactions.\n\nIn Common Lisp, a special variable which has only a top-level binding behaves just like a global variable in other programming languages. A new value can be stored into it, and that value simply replaces what is in the top-level binding. Careless replacement of the value of a global variable is at the heart of bugs caused by use of global variables. However, another way to work with a special variable is to give it a new, local binding within an expression. This is sometimes referred to as \"rebinding\" the variable. Binding a dynamically scoped variable temporarily creates a new memory location for that variable, and associates the name with that location. While that binding is in effect, all references to that variable refer to the new binding; the previous binding is hidden. When execution of the binding expression terminates, the temporary memory location is gone, and the old binding is revealed, with the original value intact. Of course, multiple dynamic bindings for the same variable can be nested.\n\nIn Common Lisp implementations which support multithreading, dynamic scopes are specific to each thread of execution. Thus special variables serve as an abstraction for thread local storage. If one thread rebinds a special variable, this rebinding has no effect on that variable in other threads. The value stored in a binding can only be retrieved by the thread which created that binding. If each thread binds some special variable *x*, then *x* behaves like thread-local storage. Among threads which do not rebind *x*, it behaves like an ordinary global: all of these threads refer to the same top-level binding of *x*.\n\nDynamic variables can be used to extend the execution context with additional context information which is implicitly passed from function to function without having to appear as an extra function parameter. This is especially useful when the control transfer has to pass through layers of unrelated code, which simply cannot be extended with extra parameters to pass the additional data. A situation like this usually calls for a global variable. That global variable must be saved and restored, so that the scheme doesn't break under recursion: dynamic variable rebinding takes care of this. And that variable must be made thread-local (or else a big mutex must be used) so the scheme doesn't break under threads: dynamic scope implementations can take care of this also.\n\nIn the Common Lisp library, there are many standard special variables. For instance, all standard I/O streams are stored in the top-level bindings of well-known special variables. The standard output stream is stored in *standard-output*.\n\nSuppose a function foo writes to standard output:\n\n  (defun foo ()\n    (format t \"Hello, world\"))\n\nTo capture its output in a character string, *standard-output* can be bound to a string stream and called:\n\n  (with-output-to-string (*standard-output*)\n    (foo))\n\n  -> \"Hello, world\" ; gathered output returned as a string\n\nLexical\n\nCommon Lisp supports lexical environments. Formally, the bindings in a lexical environment have lexical scope and may have either indefinite extent or dynamic extent, depending on the type of namespace. Lexical scope means that visibility is physically restricted to the block in which the binding is established. References which are not textually (i.e. lexically) embedded in that block simply do not see that binding.\n\nThe tags in a TAGBODY have lexical scope. The expression (GO X) is erroneous if it is not actually embedded in a TAGBODY which contains a label X. However, the label bindings disappear when the TAGBODY terminates its execution, because they have dynamic extent. If that block of code is re-entered by the invocation of a lexical closure, it is invalid for the body of that closure to try to transfer control to a tag via GO:\n\n  (defvar *stashed*) ;; will hold a function\n\n  (tagbody\n    (setf *stashed* (lambda () (go some-label)))\n    (go end-label) ;; skip the (print \"Hello\")\n   some-label\n    (print \"Hello\")\n   end-label)\n  -> NIL\n\nWhen the TAGBODY is executed, it first evaluates the setf form which stores a function in the special variable *stashed*. Then the (go end-label) transfers control to end-label, skipping the code (print \"Hello\"). Since end-label is at the end of the tagbody, the tagbody terminates, yielding NIL. Suppose that the previously remembered function is now called:\n\n  (funcall *stashed*) ;; Error!\n\nThis situation is erroneous. One implementation's response is an error condition containing the message, \"GO: tagbody for tag SOME-LABEL has already been left\". The function tried to evaluate (go some-label), which is lexically embedded in the tagbody, and resolves to the label. However, the tagbody isn't executing (its extent has ended), and so the control transfer cannot take place.\n\nLocal function bindings in Lisp have lexical scope, and variable bindings also have lexical scope by default. By contrast with GO labels, both of these have indefinite extent. When a lexical function or variable binding is established, that binding continues to exist for as long as references to it are possible, even after the construct which established that binding has terminated. References to lexical variables and functions after the termination of their establishing construct are possible thanks to lexical closures.\n\nLexical binding is the default binding mode for Common Lisp variables. For an individual symbol, it can be switched to dynamic scope, either by a local declaration, by a global declaration. The latter may occur implicitly through the use of a construct like DEFVAR or DEFPARAMETER. It is an important convention in Common Lisp programming that special (i.e. dynamically scoped) variables have names which begin and end with an asterisk sigil * in what is called the “earmuff convention”.[http://letoverlambda.com/index.cl/guest/chap2.html Chapter 2] of Let Over Lambda If adhered to, this convention effectively creates a separate namespace for special variables, so that variables intended to be lexical are not accidentally made special.\n\nLexical scope is useful for several reasons.\n\nFirstly, references to variables and functions can be compiled to efficient machine code, because the run-time environment structure is relatively simple. In many cases it can be optimized to stack storage, so opening and closing lexical scopes has minimal overhead. Even in cases where full closures must be generated, access to the closure's environment is still efficient; typically each variable becomes an offset into a vector of bindings, and so a variable reference becomes a simple load or store instruction with a base-plus-offset addressing mode.\n\nSecondly, lexical scope (combined with indefinite extent) gives rise to the lexical closure, which in turn creates a whole paradigm of programming centered around the use of functions being first-class objects, which is at the root of functional programming.\n\nThirdly, perhaps most importantly, even if lexical closures are not exploited, the use of lexical scope isolates program modules from unwanted interactions. Due to their restricted visibility, lexical variables are private. If one module A binds a lexical variable X, and calls another module B, references to X in B will not accidentally resolve to the X bound in A. B simply has no access to X. For situations in which disciplined interactions through a variable are desirable, Common Lisp provides special variables. Special variables allow for a module A to set up a binding for a variable X which is visible to another module B, called from A. Being able to do this is an advantage, and being able to prevent it from happening is also an advantage; consequently, Common Lisp supports both lexical and dynamic scope.\n\nMacros\n\nA macro in Lisp superficially resembles a function in usage. However, rather than representing an expression which is evaluated, it represents a transformation of the program source code. The macro gets the source it surrounds as arguments, binds them to its parameters and computes a new source form. This new form can also use a macro. The macro expansion is repeated until the new source form does not use a macro. The final computed form is the source code executed at runtime.\n\nTypical uses of macros in Lisp:\n\n* new control structures (example: looping constructs, branching constructs)\n* scoping and binding constructs\n* simplified syntax for complex and repeated source code\n* top-level defining forms with compile-time side-effects\n* data-driven programming\n* embedded domain specific languages (examples: SQL, HTML, Prolog)\n* implicit finalization forms\n\nVarious standard Common Lisp features also need to be implemented as macros, such as:\n\n* the standard setf abstraction, to allow custom compile-time expansions of assignment/access operators\n* with-accessors, with-slots, with-open-file and other similar WITH macros\n* Depending on implementation, if or cond is a macro built on the other, the special operator; when and unless consist of macros\n* The powerful loop domain-specific language\n\nMacros are defined by the defmacro macro. The special operator macrolet allows the definition of local (lexically scoped) macros. It is also possible to define macros for symbols using define-symbol-macro and symbol-macrolet.\n\nPaul Graham's book On Lisp describes the use of macros in Common Lisp in detail.  Doug Hoyte's book Let Over Lambda extends the discussion on macros, claiming \"Macros are the single greatest advantage that lisp has as a programming language and the single greatest advantage of any programming language.\"  Hoyte provides several examples of iterative development of macros.\n\nExample using a macro to define a new control structure\n\nMacros allow Lisp programmers to create new syntactic forms in the language. One typical use is to create new control structures. The example macro provides an until looping construct. The syntax is:\n\n(until test form*)\n\nThe macro definition for until:\n\n(defmacro until (test &body body)\n  (let ((start-tag (gensym \"START\"))\n        (end-tag   (gensym \"END\")))\n    `(tagbody ,start-tag\n              (when ,test (go ,end-tag))\n              (progn ,@body)\n              (go ,start-tag)\n              ,end-tag)))\n\ntagbody is a primitive Common Lisp special operator which provides the ability to name tags and use the go form to jump to those tags. The backquote ` provides a notation that provides code templates, where the value of forms preceded with a comma are filled in. Forms preceded with comma and at-sign are spliced in. The tagbody form tests the end condition. If the condition is true, it jumps to the end tag. Otherwise the provided body code is executed and then it jumps to the start tag.\n\nAn example form using above until macro:\n\n(until (= (random 10) 0)\n  (write-line \"Hello\"))\n\nThe code can be expanded using the function macroexpand-1. The expansion for above example looks like this:\n\n(TAGBODY\n #:START1136\n (WHEN (ZEROP (RANDOM 10))\n   (GO #:END1137))\n (PROGN (WRITE-LINE \"hello\"))\n (GO #:START1136)\n #:END1137)\n\nDuring macro expansion the value of the variable test is (= (random 10) 0) and the value of the variable body is ((write-line \"Hello\")). The body is a list of forms.\n\nSymbols are usually automatically upcased. The expansion uses the TAGBODY with two labels. The symbols for these labels are computed by GENSYM and are not interned in any package. Two go forms use these tags to jump to. Since tagbody is a primitive operator in Common Lisp (and not a macro), it will not be expanded into something else. The expanded form uses the when macro, which also will be expanded. Fully expanding a source form is called code walking.\n\nIn the fully expanded (walked) form, the when form is replaced by the primitive if:\n\n(TAGBODY\n #:START1136\n (IF (ZEROP (RANDOM 10))\n     (PROGN (GO #:END1137))\n   NIL)\n (PROGN (WRITE-LINE \"hello\"))\n (GO #:START1136))\n #:END1137)\n\nAll macros must be expanded before the source code containing them can be evaluated or compiled normally.  Macros can be considered functions that accept and return S-expressions - similar to abstract syntax trees, but not limited to those. These functions are invoked before the evaluator or compiler to produce the final source code.\nMacros are written in normal Common Lisp, and may use any Common Lisp (or third-party) operator available.\n\nVariable capture and shadowing\n\nCommon Lisp macros are capable of what is commonly called variable capture, where symbols in the macro-expansion body coincide with those in the calling context, allowing the programmer to create macros wherein various symbols have special meaning. The term variable capture is somewhat misleading, because all namespaces are vulnerable to unwanted capture, including the operator and function namespace, the tagbody label namespace, catch tag, condition handler and restart namespaces.\n\nVariable capture can introduce software defects. This happens in one of the following two ways:\n\n* In the first way, a macro expansion can inadvertently make a symbolic reference which the macro writer assumed will resolve in a global namespace, but the code where the macro is expanded happens to provide a local, shadowing definition which steals that reference. Let this be referred to as type 1 capture.\n* The second way, type 2 capture, is just the opposite: some of the arguments of the macro are pieces of code supplied by the macro caller, and those pieces of code are written such that they make references to surrounding bindings. However, the macro inserts these pieces of code into an expansion which defines its own bindings that accidentally captures some of these references.\n\nThe Scheme dialect of Lisp provides a macro-writing system which provides the referential transparency that eliminates both types of capture problem. This type of macro system is sometimes called \"hygienic\", in particular by its proponents (who regard macro systems which do not automatically solve this problem as unhygienic). \n\nIn Common Lisp, macro hygiene is ensured one of two different ways.\n\nOne approach is to use gensyms: guaranteed-unique symbols which can be used in a macro-expansion without threat of capture. The use of gensyms in a macro definition is a manual chore, but macros can be written which simplify the instantiation and use of gensyms.  Gensyms solve type 2 capture easily, but they are not applicable to type 1 capture in the same way, because the macro expansion cannot rename the interfering symbols in the surrounding code which capture its references. Gensyms could be used to provide stable aliases for the global symbols which the macro expansion needs. The macro expansion would use these secret aliases rather than the well-known names, so redefinition of the well-known names would have no ill effect on the macro.\n\nAnother approach is to use packages. A macro defined in its own package can simply use internal symbols in that package in its expansion. The use of packages deals with type 1 and type 2 capture.\n\nHowever, packages don't solve the type 1 capture of references to standard Common Lisp functions and operators. The reason is that the use of packages to solve capture problems revolves around the use of private symbols (symbols in one package, which are not imported into, or otherwise made visible in other packages).  Whereas the Common Lisp library symbols are external, and frequently imported into or made visible in user-defined packages.\n\nThe following is an example of unwanted capture in the operator namespace, occurring in the expansion of a macro:\n\n ;; expansion of UNTIL makes liberal use of DO\n (defmacro until (expression &body body)\n   `(do () (,expression) ,@body))\n\n ;; macrolet establishes lexical operator binding for DO\n (macrolet ((do (...) ... something else ...))\n   (until (= (random 10) 0) (write-line \"Hello\")))\n\nThe until macro will expand into a form which calls do which is intended to refer to the standard Common Lisp macro do. However, in this context, do may have a completely different meaning, so until may not work properly.\n\nCommon Lisp solves the problem of the shadowing of standard operators and functions by forbidding their redefinition. Because it redefines the standard operator do, the preceding is actually a fragment of non-conforming Common Lisp, which allows implementations to diagnose and reject it.\n\nCondition system\n\nThe condition system is responsible for exception handling in Common Lisp. It provides conditions, handlers and restarts. Conditions are objects describing an exceptional situation (for example an error). If a condition is signaled, the Common Lisp system searches for a handler for this condition type and calls the handler. The handler can now search for restarts and use one of these restarts to automatically repair the current problem, using information such as the condition type and any relevant information provided as part of the condition object, and call the appropriate restart function.\n\nThese restarts, if unhandled by code, can be presented to users (as part of a user interface, that of a debugger for example), so that the user can select and invoke one of the available restarts. Since the condition handler is called in the context of the error (without unwinding the stack), full error recovery is possible in many cases, where other exception handling systems would have already terminated the current routine. The debugger itself can also be customized or replaced using the *debugger-hook* dynamic variable. Code found within unwind-protect forms such as finalizers will also be executed as appropriate despite the exception.\n\nIn the following example (using Symbolics Genera) the user tries to open a file in a Lisp function test called from the Read-Eval-Print-LOOP (REPL), when the file does not exist. The Lisp system presents four restarts. The user selects the Retry OPEN using a different pathname restart and enters a different pathname (lispm-init.lisp instead of lispm-int.lisp). The user code does not contain any error handling code. The whole error handling and restart code is provided by the Lisp system, which can handle and repair the error without terminating the user code.\n\nCommand: (test \">zippy>lispm-int.lisp\")\n\nError: The file was not found.\n       For lispm:>zippy>lispm-int.lisp.newest\n\nLMFS:OPEN-LOCAL-LMFS-1\n   Arg 0: #P\"lispm:>zippy>lispm-int.lisp.newest\"\n\ns-A, : Retry OPEN of lispm:>zippy>lispm-int.lisp.newest\ns-B:           Retry OPEN using a different pathname\ns-C, :  Return to Lisp Top Level in a TELNET server\ns-D:           Restart process TELNET terminal\n\n-> Retry OPEN using a different pathname\nUse what pathname instead [default lispm:>zippy>lispm-int.lisp.newest]:\n   lispm:>zippy>lispm-init.lisp.newest\n\n...the program continues\n\nCommon Lisp Object System (CLOS)\n\nCommon Lisp includes a toolkit for object-oriented programming, the Common Lisp Object System or CLOS, which is one of the most powerful object systems available in any language. For example, Peter Norvig explains how many Design Patterns are simpler to implement in a dynamic language with the features of CLOS (Multiple Inheritance, Mixins, Multimethods, Metaclasses, Method combinations, etc.).[http://norvig.com/design-patterns/ppframe.htm Peter Norvig, Design Patterns in Dynamic Programming]\nSeveral extensions to Common Lisp for object-oriented programming have been proposed to be included into the ANSI Common Lisp standard, but eventually CLOS was adopted as the standard object-system for Common Lisp. CLOS is a dynamic object system with multiple dispatch and multiple inheritance, and differs radically from the OOP facilities found in static languages such as C++ or Java. As a dynamic object system, CLOS allows changes at runtime to generic functions and classes. Methods can be added and removed, classes can be added and redefined, objects can be updated for class changes and the class of objects can be changed.\n\nCLOS has been integrated into ANSI Common Lisp. Generic Functions can be used like normal functions and are a first-class data type. Every CLOS class is integrated into the Common Lisp type system. Many Common Lisp types have a corresponding class. There is more potential use of CLOS for Common Lisp. The specification does not say whether conditions are implemented with CLOS. Pathnames and streams could be implemented with CLOS. These further usage possibilities of CLOS for ANSI Common Lisp are not part of the standard. Actual Common Lisp implementations are using CLOS for pathnames, streams, input/output, conditions, the implementation of CLOS itself and more.\n\nCompiler and interpreter\n\nSeveral implementations of earlier Lisp dialects provided both an interpreter and a compiler. Unfortunately often the semantics were different. These earlier Lisps implemented lexical scoping in the compiler and dynamic scoping in the interpreter. Common Lisp requires that both the interpreter and compiler use lexical scoping by default. The Common Lisp standard describes both the semantics of the interpreter and a compiler. The compiler can be called using the function compile for individual functions and using the function compile-file for files. Common Lisp allows type declarations and provides ways to influence the compiler code generation policy. For the latter various optimization qualities can be given values between 0 (not important) and 3 (most important): speed, space, safety, debug and compilation-speed.\n\nThere is also a function to evaluate Lisp code: eval. eval takes code as pre-parsed s-expressions and not, like in some other languages, as text strings. This way code can be constructed with the usual Lisp functions for constructing lists and symbols and then this code can be evaluated with the function eval. Several Common Lisp implementations (like Clozure CL and SBCL) are implementing eval using their compiler. This way code is compiled, even though it is evaluated using the function eval.\n\nThe file compiler is invoked using the function compile-file.  The generated file with compiled code is called a fasl (from fast load) file. These fasl files and also source code files can be loaded with the function load into a running Common Lisp system. Depending on the implementation, the file compiler generates byte-code (for example for the Java Virtual Machine), C language code (which then is compiled with a C compiler) or, directly, native code.\n\nCommon Lisp implementations can be used interactively, even though the code gets fully compiled. The idea of an Interpreted language thus does not apply for interactive Common Lisp.\n\nThe language makes distinction between read-time, compile-time, load-time and run-time, and allows user code to also make this distinction to perform the wanted type of processing at the wanted step.\n\nSome special operators are provided to especially suit interactive development; for instance, defvar will only assign a value to its provided variable if it wasn't already bound, while defparameter will always perform the assignment. This distinction is useful when interactively evaluating, compiling and loading code in a live image.\n\nSome features are also provided to help writing compilers and interpreters. Symbols consist of first-level objects and are directly manipulable by user code.  The progv special operator allows to create lexical bindings programmatically, while packages are also manipulable. The Lisp compiler is available at runtime to compile files or individual functions. These make it easy to use Lisp as an intermediate compiler or interpreter for another language.\n\nCode examples\n\nBirthday paradox\n\nThe following program calculates the smallest number of people in a room for whom the probability of completely unique birthdays is less than 50% (the birthday paradox, where for 1 person the probability is obviously 100%, for 2 it is 364/365, etc.). The answer is 23.\n\n;;  By convention, constants in Common Lisp are enclosed with + characters.\n(defconstant +year-size+ 365)\n\n(defun birthday-paradox (probability number-of-people)\n  (let ((new-probability (* (/ (- +year-size+ number-of-people)\n                               +year-size+)\n                            probability)))\n    (if (\n\nCalling the example function using the REPL (Read Eval Print Loop):\n\nCL-USER > (birthday-paradox 1.0 1)\n23\n\nSorting a list of person objects\n\nWe define a class person and a method for displaying the name and age of a person.\nNext we define a group of persons as a list of person objects.\nThen we iterate over the sorted list.\n\n(defclass person ()\n  ((name :initarg :name :accessor person-name)\n   (age  :initarg :age  :accessor person-age))\n  (:documentation \"The class PERSON with slots NAME and AGE.\"))\n\n(defmethod display ((object person) stream)\n  \"Displaying a PERSON object to an output stream.\"\n  (with-slots (name age) object\n    (format stream \"~a (~a)\" name age)))\n\n(defparameter *group*\n  (list (make-instance 'person :name \"Bob\"   :age 33)\n        (make-instance 'person :name \"Chris\" :age 16)\n        (make-instance 'person :name \"Ash\"   :age 23))\n  \"A list of PERSON objects.\")\n\n(dolist (person (sort (copy-list *group*)\n                      #'>\n                      :key #'person-age))\n  (display person *standard-output*)\n  (terpri))\n\nIt prints the three names with descending age.\n\nBob (33)\nAsh (23)\nChris (16)\n\nExponentiating by squaring\n\nUse of the LOOP macro is demonstrated:\n\n(defun power (x n)\n  (loop with result = 1\n        while (plusp n)\n        when (oddp n) do (setf result (* result x))\n        do (setf x (* x x)\n                 n (truncate n 2))\n        finally (return result)))\n\nExample use:\n\nCL-USER > (power 2 200)\n1606938044258990275541962092341162602522202993782792835301376\n\nCompare with the built in exponentiation:\n\nCL-USER > (= (expt 2 200) (power 2 200))\nT\n\nFind the list of available shells\n\nWITH-OPEN-FILE is a macro that opens a file and provides a stream. When the form is returning, the file is automatically closed. FUNCALL calls a function object. The LOOP collects all lines that match the predicate.\n\n(defun list-matching-lines (file predicate)\n  \"Returns a list of lines in file, for which the predicate applied to\n the line returns T.\"\n  (with-open-file (stream file)\n    (loop for line = (read-line stream nil nil)\n          while line\n          when (funcall predicate line)\n          collect it)))\n\nThe function AVAILABLE-SHELLS calls above function LIST-MATCHING-LINES with a pathname and an anonymous function as the predicate. The predicate returns the pathname of a shell or NIL (if the string is not the filename of a shell).\n\n(defun available-shells (&optional (file #p\"/etc/shells\"))\n  (list-matching-lines\n   file\n   (lambda (line)\n     (and (plusp (length line))\n          (char= (char line 0) #\\/)\n          (pathname\n           (string-right-trim '(#\\space #\\tab) line))))))\n\nExample results (on Mac OS X 10.6):\n\nCL-USER > (available-shells)\n(#P\"/bin/bash\" #P\"/bin/csh\" #P\"/bin/ksh\" #P\"/bin/sh\" #P\"/bin/tcsh\" #P\"/bin/zsh\")\n\nComparison with other Lisps\n\nCommon Lisp is most frequently compared with, and contrasted to, Scheme—if only because they are the two most popular Lisp dialects. Scheme predates CL, and comes not only from the same Lisp tradition but from some of the same engineers—Guy L. Steele, with whom Gerald Jay Sussman designed Scheme, chaired the standards committee for Common Lisp.\n\nCommon Lisp is a general-purpose programming language, in contrast to Lisp variants such as Emacs Lisp and AutoLISP which are extension languages embedded in particular products (GNU Emacs and AutoCAD). Unlike many earlier Lisps, Common Lisp (like Scheme) uses lexical variable scope by default for both interpreted and compiled code.\n\nMost of the Lisp systems whose designs contributed to Common Lisp—such as ZetaLisp and Franz Lisp—used dynamically scoped variables in their interpreters and lexically scoped variables in their compilers. Scheme introduced the sole use of lexically scoped variables to Lisp; an inspiration from ALGOL 68 which was widely recognized as a good idea. CL supports dynamically scoped variables as well, but they must be explicitly declared as \"special\". There are no differences in scoping between ANSI CL interpreters and compilers.\n\nCommon Lisp is sometimes termed a Lisp-2 and Scheme a Lisp-1, referring to CL's use of separate namespaces for functions and variables. (In fact, CL has many namespaces, such as those for go tags, block names, and loop keywords). There is a long-standing controversy between CL and Scheme advocates over the tradeoffs involved in multiple namespaces. In Scheme, it is (broadly) necessary to avoid giving variables names which clash with functions; Scheme functions frequently have arguments named lis, lst, or lyst so as not to conflict with the system function list. However, in CL it is necessary to explicitly refer to the function namespace when passing a function as an argument—which is also a common occurrence, as in the sort example above.\n\nCL also differs from Scheme in its handling of boolean values. Scheme uses the special values #t and #f to represent truth and falsity. CL follows the older Lisp convention of using the symbols T and NIL, with NIL standing also for the empty list. In CL, any non-NIL value is treated as true by conditionals, such as if, whereas in Scheme all non-#f values are treated as true. These conventions allow some operators in both languages to serve both as predicates (answering a boolean-valued question) and as returning a useful value for further computation, but in Scheme the value '() which is equivalent to NIL in Common Lisp evaluates to true in a boolean expression.\n\nLastly, the Scheme standards documents require tail-call optimization, which the CL standard does not. Most CL implementations do offer tail-call optimization, although often only when the programmer uses an optimization directive. Nonetheless, common CL coding style does not favor the ubiquitous use of recursion that Scheme style prefers—what a Scheme programmer would express with tail recursion, a CL user would usually express with an iterative expression in do, dolist, loop, or (more recently) with the iterate package.\n\nImplementations\n\nSee the Category Common Lisp implementations.\n\nCommon Lisp is defined by a specification (like Ada and C) rather than by one implementation (like Perl before version 6). There are many implementations, and the standard details areas in which they may validly differ.\n\nIn addition, implementations tend to come with extensions, which provide functionality not covered in the standard:\n\n* Interactive Top-Level (REPL)\n* Garbage Collection\n* Debugger, Stepper and Inspector\n* Weak data structures (hash tables)\n* Extensible sequences\n* Extensible LOOP\n* Environment access\n* CLOS Meta-object Protocol\n* CLOS based extensible streams\n* CLOS based Condition System\n* Network streams\n* Persistent CLOS\n* Unicode support\n* Foreign-Language Interface (often to C)\n* Operating System interface\n* Java Interface\n* Threads and Multiprocessing\n* Application delivery (applications, dynamic libraries)\n* Saving of images\n\nFree and open-source software libraries have been created to support extensions to Common Lisp in a portable way, and are most notably found in the repositories of the [http://common-lisp.net/ Common-Lisp.net] and [http://clocc.sourceforge.net/ Common Lisp Open Code Collection] projects.\n\nCommon Lisp implementations may use any mix of native code compilation, byte code compilation or interpretation. Common Lisp has been designed to support incremental compilers, file compilers and block compilers. Standard declarations to optimize compilation (such as function inlining or type specialization) are proposed in the language specification. Most Common Lisp implementations compile source code to native machine code. Some implementations can create (optimized) stand-alone applications. Others compile to interpreted bytecode, which is less efficient than native code, but eases binary-code portability. There are also compilers that compile Common Lisp code to C code. The misconception that Lisp is a purely interpreted language is most likely because Lisp environments provide an interactive prompt and that code is compiled one-by-one, in an incremental way. With Common Lisp incremental compilation is widely used.\n\nSome Unix-based implementations (CLISP, SBCL) can be used as a scripting language; that is, invoked by the system transparently in the way that a Perl or Unix shell interpreter is.[http://clisp.cons.org/impnotes/quickstart.html#quickstart-unix CLISP as a scripting language under Unix]\n\nList of implementations\n\nCommercial implementations\n\n; Allegro Common Lisp: for Microsoft Windows, FreeBSD, Linux, Apple macOS and various UNIX variants. Allegro CL provides an Integrated Development Environment (IDE) (for Windows and Linux) and extensive capabilities for application delivery.\n; Liquid Common Lisp: formerly called Lucid Common Lisp. Only maintenance, no new releases.\n; LispWorks: for Microsoft Windows, FreeBSD, Linux, Apple macOS, iOS, Android and various UNIX variants. LispWorks provides an Integrated Development Environment (IDE) (available for all platforms, but not for iOS and Android) and extensive capabilities for application delivery.\n; mocl: for iOS, Android and macOS.\n; Open Genera: for DEC Alpha.\n; Scieneer Common Lisp: which is designed for high-performance scientific computing.\n\nFreely redistributable implementations\n\n; Armed Bear Common Lisp (ABCL) : A CL implementation that runs on the Java Virtual Machine. It includes a compiler to Java byte code, and allows access to Java libraries from CL. It was formerly just a component of the Armed Bear J Editor.\n; CLISP: A bytecode-compiling implementation, portable and runs on a number of Unix and Unix-like systems (including macOS), as well as Microsoft Windows and several other systems.\n; Clozure CL (CCL) : Originally a free and open-source fork of Macintosh Common Lisp. As that history implies, CCL was written for the Macintosh, but Clozure CL now runs on macOS, FreeBSD, Linux, Solaris and Windows. 32 and 64 bit x86 ports are supported on each platform. Additionally there are Power PC ports for Mac OS and Linux. CCL was previously known as OpenMCL, but that name is no longer used, to avoid confusion with the open source version of Macintosh Common Lisp.\n; CMUCL: Originally from Carnegie Mellon University, now maintained as free and open-source software by a group of volunteers. CMUCL uses a fast native-code compiler. It is available on Linux and BSD for Intel x86; Linux for Alpha; macOS for Intel x86 and PowerPC; and Solaris, IRIX, and HP-UX on their native platforms.\n; Corman Common Lisp: for Microsoft Windows. In January 2015 Corman Lisp has been published under MIT license.\n; Embeddable Common Lisp (ECL) : ECL includes a bytecode interpreter and compiler. It can also compile Lisp code to machine code via a C compiler. ECL then compiles Lisp code to C, compiles the C code with a C compiler and can then load the resulting machine code. It is also possible to embed ECL in C programs, and C code into Common Lisp programs.\n; GNU Common Lisp (GCL) : The GNU Project's Lisp compiler. Not yet fully ANSI-compliant, GCL is however the implementation of choice for several large projects including the mathematical tools Maxima, AXIOM and (historically) ACL2. GCL runs on Linux under eleven different architectures, and also under Windows, Solaris, and FreeBSD.\n; Macintosh Common Lisp (MCL) : Version 5.2 for Apple Macintosh computers with a PowerPC processor running Mac OS X is open source. RMCL (based on MCL 5.2) runs on Intel-based Apple Macintosh computers using the Rosetta binary translator from Apple.\n; ManKai Common Lisp (MKCL) : A branch of ECL. MKCL emphasises reliability, stability and overall code quality through a heavily reworked, natively multi-threaded, runtime system. On Linux, MKCL features a fully POSIX compliant runtime system.\n; Movitz: Implements a Lisp environment for x86 computers without relying on any underlying OS.\n; Poplog: Poplog implements a version of CL, with POP-11, and optionally Prolog, and Standard ML (SML), allowing mixed language programming. For all, the implementation language is POP-11, which is compiled incrementally. It also has an integrated Emacs-like editor that communicates with the compiler.\n; Steel Bank Common Lisp (SBCL) : A branch from CMUCL. \"Broadly speaking, SBCL is distinguished from CMU CL by a greater emphasis on maintainability.\" SBCL runs on the platforms CMUCL does, except HP/UX; in addition, it runs on Linux for AMD64, PowerPC, SPARC, MIPS, Windows x86 and has experimental support for running on Windows AMD64. SBCL does not use an interpreter by default; all expressions are compiled to native code unless the user switches the interpreter on. The SBCL compiler generates fast native code according to a previous version of The Computer Language Benchmarks Game.[https://web.archive.org/web/20130520184339/http://benchmarksgame.alioth.debian.org/u32q/benchmark.php?testall&lang\nall SBCL ranks above other dynamic language implementations in the 'Computer Language Benchmark Game']\n; Ufasoft Common Lisp: port of CLISP for windows platform with core written in C++.\n\nOther implementations\n\n; Austin Kyoto Common Lisp : an evolution of Kyoto Common Lisp by Bill Schelter\n; Butterfly Common Lisp : an implementation written in Scheme for the BBN Butterfly multi-processor computer[https://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/impl/bbn/0.html BBN Butterfly Common Lisp at the CMU AI Repository][http://www.aaai.org/Papers/AAAI/1987/AAAI87-001.pdf  Recent Developments in Butterfly Lisp, 1987, AAAI Proceedings]\n; CLICC : a Common Lisp to C compiler[http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.38.1282 CLICC - A New Approach to the Compilation of Common Lisp Programs to C, by O. Burkart , W. Goerigk , H. Knutzen, 1992]\n; CLOE : Common Lisp for PCs by Symbolics\n; Codemist Common Lisp : used for the commercial version of the computer algebra system Axiom[http://lisp.codemist.co.uk Codemist Common Lisp][http://www.axiom-developer.org/axiom-website/bookvol4.pdf Axiom, the 30 year horizon, page 43]\n; ExperCommon Lisp : an early implementation for the Apple Macintosh by ExperTelligence\n; Golden Common Lisp: an implementation for the PC by GoldHill Inc.[http://www.goldhill-inc.com/developer.html Golden Common Lisp Developer]Golden Common LISP: A Hands-On Approach, David J. Steele, June 2000 by Addison Wesley Publishing Company\n; Ibuki Common Lisp : a commercialized version of Kyoto Common Lisp\n; Kyoto Common Lisp: the first Common Lisp compiler that used C as a target language. GCL, ECL and MKCL originate from this Common Lisp implementation.\n; L : a small version of Common Lisp for embedded systems developed by IS Robotics, now iRobot[http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.2.1953 L, A Common Lisp for Embedded Systems (1995)]\n; Lisp Machines (from Symbolics, TI[http://bitsavers.trailing-edge.com/pdf/ti/explorer/2549830-0001A_PgmgConcepts.pdf TI Explorer Programming Concepts][http://bitsavers.trailing-edge.com/pdf/ti/explorer/2243201-0001_LispRef.pdf TI Explorer Lisp Reference] and Xerox[http://bitsavers.trailing-edge.com/pdf/xerox/interlisp-d/198809_Medley_1.0/400006_Lisp_Release_Notes_Medley_Release_1.0_Sep88.pdf Medley Lisp Release Notes]): provided implementations of Common Lisp in addition to their native Lisp dialect (Lisp Machine Lisp or Interlisp). CLOS was also available. Symbolics provides an enhanced version Common Lisp.[http://bitsavers.trailing-edge.com/pdf/symbolics/software/open_genera/Symbolics_Common_Lisp_Dictionary.pdf Symbolics Common Lisp Dictionary][http://bitsavers.trailing-edge.com/pdf/symbolics/software/open_genera/Symbolics_Common_Lisp_Language_Concepts.pdf Symbolics Common Lisp Language Concepts][http://bitsavers.trailing-edge.com/pdf/symbolics/software/open_genera/Symbolics_Common_Lisp_Programming_Constructs.pdf Symbolics Common Lisp Programming Constructs]\n; Procyon Common Lisp : an implementation for Windows and Mac OS, used by Franz for their Windows port of Allegro CL\n; Star Sapphire Common LISP : an implementation for the PC\n; SubL: a variant of Common Lisp used for the implementation of the Cyc knowledge-based system[http://www.cyc.com/documentation/subl-reference/ SubL reference]\n; Top Level Common Lisp : an early implementation for concurrent execution[http://www.softwarepreservation.org/projects/LISP/toplevel Top Level Common Lisp Information at the Computer History Museum]\n; WCL : a shared library implementation[http://dl.acm.org/citation.cfm?id=141560 WCL: Delivering efficient Common Lisp applications under Unix , Proceedings of the 1992 ACM conference on LISP and functional programming], Pages 260-269[http://pgc.com/commonlisp/ WCL 3.0 - Embeddable Common Lisp for Linux,   by Wade Hennessey] \n; Vax Common Lisp: Digital Equipment Corporation's implementation that ran on VAX systems running VMS or ULTRIX\n; XLISP : an implementation written by David Betz[https://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/impl/xlisp/0.html XLISP page at the CMU AI Repository]\n\nApplications\n\nSee the Category Common Lisp software.\n\nCommon Lisp is used to develop research applications (often in Artificial Intelligence), for rapid development of prototypes or for deployed applications.\n\nCommon Lisp is used in many commercial applications, including the Yahoo! Store web-commerce site, which originally involved Paul Graham and was later rewritten in C++ and Perl.\"In January 2003, Yahoo released a new version of the editor written in C++ and Perl. It's hard to say whether the program is no longer written in Lisp, though, because to translate this program into C++ they literally had to write a Lisp interpreter: the source files of all the page-generating templates are still, as far as I know, Lisp code.\" Paul Graham, [http://www.paulgraham.com/avg.html Beating the Averages] Other notable examples include:\n\n* ACT-R, a cognitive architecture used in a large number of research projects.\n* Authorizer's Assistant,[http://www.aaai.org/Papers/IAAI/1989/IAAI89-031.pdf Authorizer's Assistant][http://www.prenhall.com/divisions/bp/app/alter/student/useful/ch9amex.html American Express Authorizer's Assistant]  a large rule-based system used by American Express, analyzing credit requests.\n* Cyc, a long running project with the aim to create a knowledge-based system that provides a huge amount of common sense knowledge\n* The Dynamic Analysis and Replanning Tool (DART), which is said to alone have paid back during the years from 1991 to 1995 for all thirty years of DARPA investments in AI research.\n* Gensym G2, a real-time expert system and business rules engine (BRE)[http://www.gensym.com/platforms/g2-standard/ Real-time Application Development]. Gensym. Retrieved on 2016-08-16.\n* [http://www.genworks.com Genworks GDL], based on the open-source [https://github.com/genworks/gendl Gendl] kernel.\n* The development environment for the Jak and Daxter video game series, developed by Naughty Dog.\n* ITA Software's low fare search engine, used by travel websites such as Orbitz and Kayak.com and airlines such as American Airlines, Continental Airlines and US Airways.\n* Mirai, a 3d graphics suite. It was used to animate the face of Gollum in the movie Lord of the Rings: The Two Towers.\n* Prototype Verification System (PVS), a mechanized environment for formal specification and verification.\n* PWGL is a sophisticated visual programming environment based on Common Lisp, used in Computer assisted composition and sound synthesis.[http://www2.siba.fi/PWGL/ PWGL - Home]. . Retrieved on 2013-07-17. \n* SPIKE, a scheduling system for earth or space based observatories and satellites, notably the Hubble Space Telescope.[http://www.stsci.edu/resources/software_hardware/spike/ Spike Planning and Scheduling System]. Stsci.edu. Retrieved on 2013-07-17.\n\nThere also exist open-source applications written in Common Lisp, such as:\n\n* ACL2, a full-featured automated theorem prover for an applicative variant of Common Lisp.\n* Axiom, a sophisticated computer algebra system.\n* Maxima, a sophisticated computer algebra system.\n* OpenMusic is an object-oriented visual programming environment based on Common Lisp, used in Computer assisted composition.\n* Stumpwm, a tiling, keyboard driven X11 Window Manager written entirely in Common Lisp.\n\nLibraries\n\nSince 2011 Zach Beane, with support of the Common Lisp Foundation, maintains the Quicklisp library manager. It allows easy access to several hundred libraries written in Common Lisp. Common Lisp. http://en.wikipedia.org/?curid=6068."
  }
}
