{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16768",
  "eid" : "283a3600-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778576736,
  "textBody" : "Kevin Spacey Fowler,  (born July 26, 1959) is an American actor, producer, and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for the midlife crisis-themed drama American Beauty (1999).\n\nHis other starring roles have included the comedy-drama film Swimming with Sharks (1994), the psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001), the musical biopic Beyond the Sea (2004), the superhero film Superman Returns (2006), and the action film Baby Driver (2017).\n\nIn Broadway theatre, Spacey won a Tony Award in 1991 for his role in Lost in Yonkers. In 2017, he hosted the 71st Tony Awards. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. From 2013 to 2017, Spacey played Frank Underwood in the Netflix political drama series House of Cards. For his role as Underwood, he has won a Golden Globe Award for Best Actor – Television Series Drama and two consecutive Screen Actors Guild Awards for Outstanding Performance by a Male Actor in a Drama Series.\n\nIn October 2017 Spacey was accused by actor Anthony Rapp of making a sexual advance toward him when Rapp was 14. Shortly after, numerous other men alleged that Spacey had sexually harassed or assaulted them. As a result, Netflix cut all ties with him, shelved his film Gore and removed him from the cast of the last season of House of Cards. He was to appear in Ridley Scott's film All the Money in the World but all his scenes were cut from the film and Christopher Plummer replaced him in reshoots.\n\nEarly life\n\nSpacey was born in South Orange, New Jersey, to Kathleen Ann (née Knutson), a secretary, and Thomas Geoffrey Fowler, a technical writer and data consultant.Staff writer (1990), [https://books.google.co.uk/books?id92bJlWbPeKMC&dq\nisbn+9780837911106&focussearchwithinvolume&q\nKevin+Spacey Fowler, Kevin Spacey]\", in  He has an older brother, Randy Fowler, who is a limo driver and Rod Stewart impersonator in Boise, Idaho, and a sister, Julie Ann Fowler Keir, an office worker. His family relocated to Southern California when Spacey was four years old. Randy Fowler (from whom Spacey is estranged) has stated that their father, whom he described as a racist \"Nazi supporter\", was sexually and physically abusive, and that Spacey had shut down emotionally and become \"very sly and smart\" to avoid whippings.\n\nSpacey attended Northridge Military Academy, Canoga Park High School in the 10th and 11th grades. He graduated co-valedictorian (along with Mare Winningham) of the class of 1977 of Chatsworth High School in Chatsworth, California. At Chatsworth, Spacey starred in the school's senior production of The Sound of Music, playing the part of Captain Georg von Trapp with Winningham as Maria von Trapp. He started using his middle name \"Spacey\", which is also his paternal grandmother's maiden name.\n\nSpacey had tried to succeed as a comedian for several years before attending the Juilliard School in New York City, as a member of Group 12, where he studied dramaStated on Inside the Actors Studio, 2000 between 1979 and 1981. During this time period, he performed stand-up comedy in bowling alley talent contests.\n\nCareer\n\n1981–1999\n\nSpacey's first professional stage appearance was as a spear carrier in a New York Shakespeare Festival performance of Henry VI, Part 1 in 1981. The following year, he made his first Broadway appearance, as Oswald in a production of Henrik Ibsen's Ghosts, starring Liv Ullmann. Then he portrayed Philinte in Molière's The Misanthrope. In 1984, he appeared in a production of David Rabe's Hurlyburly, in which he rotated through each of the male parts (he would later play Mickey in the film version). Next came Anton Chekhov's The Seagull. In 1986, he appeared in a production of Sleuth in a New Jersey dinner theatre.\n\nHis prominence as a stage actor began in 1986, when he was cast opposite Jack Lemmon, Peter Gallagher and Bethel Leslie as Jamie, the eldest Tyrone son in Jonathan Miller's lauded production of Eugene O'Neill's Long Day's Journey into Night. Lemmon in particular would become a mentor to him and was invited, along with Spacey's high school drama teacher, to be present when Spacey received his star on the Hollywood Walk of Fame in 1999. He made his first major television appearance in the second-season premiere of Crime Story, playing a Kennedy-esque American senator. Although his interest soon turned to film, Spacey remained actively involved in the live theater community. In 1991, he won a Tony Award for his portrayal of Uncle Louie in Neil Simon's Broadway hit Lost in Yonkers. Spacey's father was unconvinced that Spacey could make a career for himself as an actor, and did not change his mind until Spacey became well-known.\n\nSome of Spacey's early roles include a widowed eccentric millionaire on L.A. Law, the television miniseries The Murder of Mary Phagan (1988), opposite Lemmon, and the comedy See No Evil, Hear No Evil (1989). He earned a fan base after playing the criminally insane arms dealer Mel Profitt on the television series Wiseguy. He quickly developed a reputation as a character actor, and was cast in bigger roles, including one-half of a bickering Connecticut couple in the dark comedy film The Ref (1994), a malicious Hollywood studio boss in the satire Swimming with Sharks, and the malevolent office manager in the ensemble film Glengarry Glen Ross (1992), gaining him positive notices by critics. His performance as the enigmatic criminal Verbal Kint in 1995's The Usual Suspects won him the Academy Award for Best Supporting Actor.\n\nSpacey appeared in the 1995 thriller film Seven, making a sudden entrance late in the film as the serial killer John Doe after going unmentioned in the film's advertisements and opening credits. His work in Seven, The Usual Suspects, and Outbreak earned him Best Supporting Actor honors at the 1995 Society of Texas Film Critics Awards. He remarked in 2013: \"I think people just like me evil for some reason. They want me to be a son of a bitch.\"\nSpacey played an egomaniacal district attorney in A Time to Kill (1996), and founded Trigger Street Productions in 1997, with the purpose of producing and developing entertainment across various media. He made his directorial debut with the film Albino Alligator (1996). The film was a failure at the box office, grossing $339,379 with a budget of $6 million, but critics praised Spacey's direction. He also voiced Hopper in the animated film A Bug's Life (1998).\n\n2000–2010\n\nSpacey won universal praise and an Academy Award for Best Actor for his role as a depressed suburban father who re-evaluates his life in 1999's American Beauty; the same year, he was honored with a star on the Hollywood Walk of Fame. Spacey won the Laurence Olivier Award for Best Actor and earned another Tony nomination in 1999 for The Iceman Cometh. In 2001, Spacey co-hosted, with Judi Dench, the Unite for the Future Gala, a UK fundraiser for the British victims of 9/11 and Médecins Sans Frontières at London's Old Vic Theatre, produced by Harvey Goldsmith and Dominic Madden.\n\nHe played a physically and emotionally scarred grade school teacher in Pay It Forward (2000), a patient in a mental institution who may or may not be an alien in K-Pax (2001), and singer Bobby Darin in Beyond the Sea (2004). The latter was a lifelong dream project for Spacey, who took on co-writing, directing, co-producing, and starring duties in the biography/musical about Darin's life, career, and relationship with actress Sandra Dee. Facing little interest for backing in the United States, Spacey went to the United Kingdom and Germany for funding. Almost all of the film was made in Berlin. Spacey provided his own vocals on the Beyond the Sea soundtrack and appeared in several tribute concerts around the time of the film's release. He received mostly positive reviews for his singing, as well as a Golden Globe nomination for his performance. However, reviewers criticized the age disparity between Spacey and Darin, noting that Spacey was too old to convincingly portray Darin, particularly during the early stages of the singer's life depicted in the film.\n\nSpacey hosted Saturday Night Live twice: first in 1997 with musical guest Beck and special guests Michael Palin and John Cleese from Monty Python's Flying Circus, and again in May 2006 with musical guest Nelly Furtado. In 2006, Spacey played Lex Luthor in the Bryan Singer superhero film Superman Returns. He was to return for its 2009 sequel, but the series was instead rebooted with 2013 film Man of Steel.\n\nSpacey also appeared in Edison, which received a direct-to-video release in 2006. In 2008, he played an MIT lecturer in the film 21. The film is based on Ben Mezrich's best seller Bringing Down the House: The Inside Story of Six MIT Students Who Took Vegas for Millions, a story of student MIT card-counters who used mathematical probability to aid them in card games such as blackjack. In early 2010, Spacey went to China to star in writer-director Dayyan Eng's black comedy film Inseparable, becoming the first Hollywood actor to star in a fully Chinese-funded film.\n\nIn September 2006, Spacey said that he intended to take up British citizenship when it is offered to him. When asked about the UK's referendum on whether or not to leave the European Union in 2016, Spacey replied \"I appreciate you asking me the question, but I am not a British citizen, I am a resident of Great Britain. And I have never in my 12 years ever gotten involved in politics in Great Britain. I think it's inappropriate for me as a, really as a guest, in Great Britain, so I'll leave that to the British people.\" On June 16, 2016, Spacey was awarded an honorary knighthood for his services to theatre. The honor, Knight Commander of the Order of the British Empire, was given at Clarence House by Prince Charles. While Spacey will be permitted to add the post-nominal letters, KBE, to his name, as a non-British citizen the award is honorary and he will not be able to style himself as \"Sir Kevin\". Spacey had previously been awarded the lesser rank of honorary Commander of the Order of the British Empire for services to drama in 2010.\n\nSpacey is well known in Hollywood for his impressions. When he appeared on Inside the Actors Studio, he imitated (at host James Lipton's request) James Stewart, Johnny Carson, Katharine Hepburn, Clint Eastwood, John Gielgud, Marlon Brando, Christopher Walken, Al Pacino, and Jack Lemmon. As a young actor in New York City, he used his skill to pretend to be Carson's son to obtain free theater tickets and enter Studio 54.\n\nCapitol/EMI's album Forever Cool (2007) features two duets with Spacey and an earlier recording of Dean Martin: \"Ain't That a Kick in the Head\" and \"King of the Road\". In December 2007, Spacey cohosted the Nobel Peace Prize Concert along with Uma Thurman.\n\n2011–2017\n\nSpacey is a patron of the Shakespeare Schools Festival, a charity that enables school children across the UK to perform Shakespeare in professional theatres. He also sits on the board of directors of the Motion Picture and Television Fund.\n\nOn March 18, 2011, it was announced that Spacey was cast as Frank Underwood in the Netflix series House of Cards. He was nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series at the 65th Primetime Emmy Awards in 2013 becoming the first lead actor to be Primetime Emmy nominated from a web television series. He went on to win the Golden Globe award for Best Actor in a Television Series Drama at the 72nd Golden Globe Awards and Screen Actors Guild nomination for Outstanding Performance by a Male Actor in a Drama Series at the 21st Screen Actors Guild Awards for his season 2 performance.\n\nIn July 2011, Spacey co-starred in the black comedy film Horrible Bosses, which grossed over $209.6 million at the box office. He executive produced the biographical survival thriller film Captain Phillips in 2013, which was nominated for the Academy Award for Best Picture.\n\nSpacey portrayed founder and president of the private military corporation Atlas Corporation, Jonathan Irons, in the 2014 video game Call of Duty: Advanced Warfare through motion capture. Spacey starred as President Richard Nixon in the comedy-drama Elvis & Nixon (2016). The film is based on the meeting that took place between Nixon and singer Elvis Presley (Michael Shannon) in December 1970 wherein Presley requested Nixon swear him in as an undercover agent in the Bureau of Narcotics and Dangerous Drugs. He next starred in the comedy film Nine Lives, as a man trapped in the body of a cat. The film was released on August 5, 2016.\n\nIn March 2017, it was announced that Spacey would portray J. Paul Getty in Ridley Scott's All the Money in the World. He shot his role in the film in 10 days over the summer of 2017. However, due to the sexual assault allegations against Spacey, the company announced on November 8, 2017 that all of his footage would be excised, and Christopher Plummer would replace Spacey as Getty in re-shoots. In spite of the very tight schedule, TriStar Pictures completed the new version of the film in time for a December 25 release.\n\nPositions held outside of acting\n\nArtistic director of the Old Vic\n\nIn February 2003, Spacey announced that he was returning to London to become the artistic director of the Old Vic, one of the city's oldest theatres. Appearing at a press conference with Judi Dench and Elton John, he promised both to appear on stage and to bring in big-name talent. Spacey undertook to remain in the post for a full ten years. The Old Vic Theatre Company staged shows eight months out of the year. Spacey's first season started in September 2004, and opened with the British premiere of the play Cloaca by Maria Goos, directed by Spacey, which opened to mixed reviews. In the 2005 season, Spacey made his UK Shakespearean debut, to good notices, in the title role of Richard II directed by Trevor Nunn.\n\nIn mid-2006, Spacey said that he was having the time of his life working at the Old Vic; at that point in his career, he said, he was \"trying to do things now that are much bigger and outside himself\". He performed in productions of National Anthems by Dennis McIntyre, and The Philadelphia Story by Philip Barry in which he played C.K. Dexter Haven, the Cary Grant role in the film version. Critics applauded Spacey for taking on the management of a theatre, but noted that while his acting was impressive, his skills and judgment as a producer/manager had yet to develop.\n\nIn the 2006 season, Spacey suffered a major setback with a production of Arthur Miller's Resurrection Blues, directed by Robert Altman. Despite an all-star cast (including Matthew Modine and future House of Cards co-star Neve Campbell) and the pedigree of Miller's script, Spacey's decision to lure Altman to the stage proved disastrous: after a fraught rehearsal period, the play opened to a critical panning, and closed after only a few weeks. Later in the year, Spacey starred in Eugene O'Neill's A Moon for the Misbegotten, along with Colm Meaney and Eve Best. The play received excellent reviews for Spacey and Best, and was transferred to Broadway in 2007. For the spring part of the 2007–08 season, Jeff Goldblum and Laura Michelle Kelly joined Spacey as the three characters in David Mamet's 1988 play Speed-the-Plow.\n\nIn 2009, he directed the premiere of Joe Sutton's Complicit, with Richard Dreyfuss, David Suchet and Elizabeth McGovern. Later that year, Trevor Nunn directed Spacey in a revival of Inherit the Wind. Spacey played defense lawyer Henry Drummond, a role that was made famous by Spencer Tracy in the 1960 film of the same name.\n\nSam Mendes directed Spacey in a Shakespeare's Richard III; Spacey played the title role. The show began in June 2011, commencing a worldwide tour culminating in New York in early 2012. In March 2014, it was announced that Spacey would star in a one-man play at the Old Vic to celebrate his 10 years as artistic director. He took on the part of Clarence Darrow in the play.\n\nWithdrawn chairmanship of Relativity Media\n\nIn January 2016 it was announced that Relativity Media, which was just emerging from Chapter 11 bankruptcy, had acquired Trigger Street Productions and that Spacey would become chairman of Relativity Studios whilst Dana Brunetti would become the studio's president. Spacey called the move \"an incredible opportunity to make great entertainment\" and said he considered it the \"next evolution in my career\". However, when the paperwork for the studio was filed for the court it emerged that Spacey had opted out of assuming the chairmanship of the studios, and by the end of 2016 Brunetti had also left Relativity whilst both remained Executive Producers on House of Cards and Manifesto.\n\nPolitical views and activism\n\nSpacey's political views have been described as left-leaning and mirroring some of those possessed by his fictional character in House of Cards. Spacey is a Democrat and a friend of President Bill Clinton. Having met the former U.S. President before his presidency began, Spacey once described Clinton as \"one of a shining light\" in the political process. He additionally made a cameo appearance in the short film President Clinton: Final Days, a light-hearted political satire produced by the Clinton administration for the White House Correspondents Dinner.\n\nSpacey met Venezuelan president Hugo Chávez in September 2007, and never spoke to the press about their encounter. During the trip, he donated money to the Venezuelan film studio Villa del Cine.\n\nIn March 2011 – following Belarusian president Alexander Lukashenko's crackdown on the Belarusian democracy movement – Spacey joined Jude Law on the street in a protest against Lukashenko's regime.\n\nIn 2018, Earl Blue, owner of the security company VIP Protective Services, accused Spacey of using racial slurs against his predominately African-American staff when they were hired on the House of Cards set in 2012.\n\nSexual misconduct allegations\n\nOn October 29, 2017, actor Anthony Rapp alleged that Spacey, apparently drunk, made a sexual advance toward him in 1986, when Rapp was 14. Spacey stated through Twitter that he did not remember the encounter, but that he owed Rapp \"the sincerest apology for what would have been deeply inappropriate drunken behavior\" if he had behaved as asserted.\n\nFifteen others came forward alleging similar abuse, including journalist Heather Unruh (who alleged that Spacey sexually assaulted her son), Norwegian author and Royal Family member Ari Behn, filmmaker Tony Montana, actor Roberto Cavazos, Richard Dreyfuss' son Harry, and eight people who worked on House of Cards. An anonymous man alleged that he had an extended sexual relationship with Spacey in 1983, when he was 14 and Spacey was 24; the man said that the relationship ended with Spacey attempting to rape him. The Guardian was contacted by \"a number of people\" who worked at the Old Vic, where Spacey was artistic director for 11 years, alleging he \"groped and behaved in an inappropriate way with young men at the time\". On November 16, the Old Vic confirmed that it had received 20 testimonies of alleged inappropriate behavior by Spacey, with three stating they contacted the police. In December, Spacey's Usual Suspects costar Gabriel Byrne revealed that production on that film was shut down for two days because Spacey made unwanted sexual advances toward a younger actor.\n\nIn the midst of the allegations, filming of the sixth and final season of House of Cards was suspended. The show had been due to end in 2018. The season was shortened from 13 to 8 episodes and Spacey was removed from the cast. A Gore Vidal biopic starring Spacey, Gore, set to be distributed by Netflix, was canceled; Netflix went on to sever all ties with him. Spacey was due to appear in Ridley Scott's biographical film All the Money in the World as industrialist J. Paul Getty; however, his scenes were cut and Christopher Plummer replaced him as Getty in reshoots. The International Academy of Television Arts and Sciences reversed its decision to honor Spacey with the 2017 International Emmy Founders Award.\n\nOn November 1, Spacey stated that he would be seeking \"evaluation and treatment\" for his behavior. The following day, Variety reported that the actor's publicist Staci Wolfe and talent agency CAA were ending their relationships with him.\n\nPersonal life\n\nIn 1999, reports suggested Spacey was dating a script supervisor named Dianne Dreyer, with their relationship possibly dating back as far as 1992. In 2000, Spacey brought Dreyer to the Academy Awards; during the acceptance speech for his Best Actor award, Spacey stated, \"Dianne, thank you for teaching me about caring about the right things, and I love you.\"\n\nAn article in The Sunday Times Magazine in 1999 stated that Spacey's \"love affair with acting, and the absence of a visible partner in the life of an attractive 40-year-old, has resulted in Esquire magazine asserting two years ago that he must be gay.\" He responded to the rumors by telling Playboy and other interviewers that he was not gay, and telling Lesley White of The Sunday Times:I chose for a long time not to answer these questions because of the manner in which they were asked, and because I was never talking to someone I trusted, so why should I? Recently I chose to participate because it's a little hard on the people I love.In 2007, Gotham magazine quoted Spacey saying:I've never believed in pimping my personal life out for publicity. Although I might be interested in doing it, I will never do it. People can gossip all they want; they can speculate all they want. I just happened to believe that there's a separation between the public life and the private life. Everybody has the right to a private life no matter what their professions are.\n\nSpacey came out as gay in October 2017 when he apologized to Anthony Rapp, disclosing that \"I have had relationships with both men and women. I have loved and had romantic encounters with men throughout my life, and I choose now to live as a gay man.\" His decision to come out via his statement was criticized by prominent members of the gay community, including Billy Eichner, George Takei and Wanda Sykes, as an attempt to change the subject from Rapp's accusation, for using his own drunkenness as an excuse, and for implying a connection between being gay and sexually assaulting a child.\n\nFilmography\n\nDiscography\n\nAlbums\n\n* Beyond the Sea: Original Motion Picture Soundtrack (2004)\n\nSingles\n\n* That Old Black Magic (1997)From the Midnight in the Garden of Good and Evil soundtrack\n\nLive performances\n\n* \"Mind Games\" – Come Together: A Night for John Lennon's Words and Music – October 2, 2001, Radio City Music Hall",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kevin Spacey" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16768" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kevin Spacey Fowler,  (born July 26, 1959) is an American actor, producer, and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for the midlife crisis-themed drama American Beauty (1999).\n\nHis other starring roles have included the comedy-drama film Swimming with Sharks (1994), the psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001), the musical biopic Beyond the Sea (2004), the superhero film Superman Returns (2006), and the action film Baby Driver (2017).\n\nIn Broadway theatre, Spacey won a Tony Award in 1991 for his role in Lost in Yonkers. In 2017, he hosted the 71st Tony Awards. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. From 2013 to 2017, Spacey played Frank Underwood in the Netflix political drama series House of Cards. For his role as Underwood, he has won a Golden Globe Award for Best Actor – Television Series Drama and two consecutive Screen Actors Guild Awards for Outstanding Performance by a Male Actor in a Drama Series.\n\nIn October 2017 Spacey was accused by actor Anthony Rapp of making a sexual advance toward him when Rapp was 14. Shortly after, numerous other men alleged that Spacey had sexually harassed or assaulted them. As a result, Netflix cut all ties with him, shelved his film Gore and removed him from the cast of the last season of House of Cards. He was to appear in Ridley Scott's film All the Money in the World but all his scenes were cut from the film and Christopher Plummer replaced him in reshoots.\n\nEarly life\n\nSpacey was born in South Orange, New Jersey, to Kathleen Ann (née Knutson), a secretary, and Thomas Geoffrey Fowler, a technical writer and data consultant.Staff writer (1990), [https://books.google.co.uk/books?id92bJlWbPeKMC&dq\nisbn+9780837911106&focussearchwithinvolume&q\nKevin+Spacey Fowler, Kevin Spacey]\", in  He has an older brother, Randy Fowler, who is a limo driver and Rod Stewart impersonator in Boise, Idaho, and a sister, Julie Ann Fowler Keir, an office worker. His family relocated to Southern California when Spacey was four years old. Randy Fowler (from whom Spacey is estranged) has stated that their father, whom he described as a racist \"Nazi supporter\", was sexually and physically abusive, and that Spacey had shut down emotionally and become \"very sly and smart\" to avoid whippings.\n\nSpacey attended Northridge Military Academy, Canoga Park High School in the 10th and 11th grades. He graduated co-valedictorian (along with Mare Winningham) of the class of 1977 of Chatsworth High School in Chatsworth, California. At Chatsworth, Spacey starred in the school's senior production of The Sound of Music, playing the part of Captain Georg von Trapp with Winningham as Maria von Trapp. He started using his middle name \"Spacey\", which is also his paternal grandmother's maiden name.\n\nSpacey had tried to succeed as a comedian for several years before attending the Juilliard School in New York City, as a member of Group 12, where he studied dramaStated on Inside the Actors Studio, 2000 between 1979 and 1981. During this time period, he performed stand-up comedy in bowling alley talent contests.\n\nCareer\n\n1981–1999\n\nSpacey's first professional stage appearance was as a spear carrier in a New York Shakespeare Festival performance of Henry VI, Part 1 in 1981. The following year, he made his first Broadway appearance, as Oswald in a production of Henrik Ibsen's Ghosts, starring Liv Ullmann. Then he portrayed Philinte in Molière's The Misanthrope. In 1984, he appeared in a production of David Rabe's Hurlyburly, in which he rotated through each of the male parts (he would later play Mickey in the film version). Next came Anton Chekhov's The Seagull. In 1986, he appeared in a production of Sleuth in a New Jersey dinner theatre.\n\nHis prominence as a stage actor began in 1986, when he was cast opposite Jack Lemmon, Peter Gallagher and Bethel Leslie as Jamie, the eldest Tyrone son in Jonathan Miller's lauded production of Eugene O'Neill's Long Day's Journey into Night. Lemmon in particular would become a mentor to him and was invited, along with Spacey's high school drama teacher, to be present when Spacey received his star on the Hollywood Walk of Fame in 1999. He made his first major television appearance in the second-season premiere of Crime Story, playing a Kennedy-esque American senator. Although his interest soon turned to film, Spacey remained actively involved in the live theater community. In 1991, he won a Tony Award for his portrayal of Uncle Louie in Neil Simon's Broadway hit Lost in Yonkers. Spacey's father was unconvinced that Spacey could make a career for himself as an actor, and did not change his mind until Spacey became well-known.\n\nSome of Spacey's early roles include a widowed eccentric millionaire on L.A. Law, the television miniseries The Murder of Mary Phagan (1988), opposite Lemmon, and the comedy See No Evil, Hear No Evil (1989). He earned a fan base after playing the criminally insane arms dealer Mel Profitt on the television series Wiseguy. He quickly developed a reputation as a character actor, and was cast in bigger roles, including one-half of a bickering Connecticut couple in the dark comedy film The Ref (1994), a malicious Hollywood studio boss in the satire Swimming with Sharks, and the malevolent office manager in the ensemble film Glengarry Glen Ross (1992), gaining him positive notices by critics. His performance as the enigmatic criminal Verbal Kint in 1995's The Usual Suspects won him the Academy Award for Best Supporting Actor.\n\nSpacey appeared in the 1995 thriller film Seven, making a sudden entrance late in the film as the serial killer John Doe after going unmentioned in the film's advertisements and opening credits. His work in Seven, The Usual Suspects, and Outbreak earned him Best Supporting Actor honors at the 1995 Society of Texas Film Critics Awards. He remarked in 2013: \"I think people just like me evil for some reason. They want me to be a son of a bitch.\"\nSpacey played an egomaniacal district attorney in A Time to Kill (1996), and founded Trigger Street Productions in 1997, with the purpose of producing and developing entertainment across various media. He made his directorial debut with the film Albino Alligator (1996). The film was a failure at the box office, grossing $339,379 with a budget of $6 million, but critics praised Spacey's direction. He also voiced Hopper in the animated film A Bug's Life (1998).\n\n2000–2010\n\nSpacey won universal praise and an Academy Award for Best Actor for his role as a depressed suburban father who re-evaluates his life in 1999's American Beauty; the same year, he was honored with a star on the Hollywood Walk of Fame. Spacey won the Laurence Olivier Award for Best Actor and earned another Tony nomination in 1999 for The Iceman Cometh. In 2001, Spacey co-hosted, with Judi Dench, the Unite for the Future Gala, a UK fundraiser for the British victims of 9/11 and Médecins Sans Frontières at London's Old Vic Theatre, produced by Harvey Goldsmith and Dominic Madden.\n\nHe played a physically and emotionally scarred grade school teacher in Pay It Forward (2000), a patient in a mental institution who may or may not be an alien in K-Pax (2001), and singer Bobby Darin in Beyond the Sea (2004). The latter was a lifelong dream project for Spacey, who took on co-writing, directing, co-producing, and starring duties in the biography/musical about Darin's life, career, and relationship with actress Sandra Dee. Facing little interest for backing in the United States, Spacey went to the United Kingdom and Germany for funding. Almost all of the film was made in Berlin. Spacey provided his own vocals on the Beyond the Sea soundtrack and appeared in several tribute concerts around the time of the film's release. He received mostly positive reviews for his singing, as well as a Golden Globe nomination for his performance. However, reviewers criticized the age disparity between Spacey and Darin, noting that Spacey was too old to convincingly portray Darin, particularly during the early stages of the singer's life depicted in the film.\n\nSpacey hosted Saturday Night Live twice: first in 1997 with musical guest Beck and special guests Michael Palin and John Cleese from Monty Python's Flying Circus, and again in May 2006 with musical guest Nelly Furtado. In 2006, Spacey played Lex Luthor in the Bryan Singer superhero film Superman Returns. He was to return for its 2009 sequel, but the series was instead rebooted with 2013 film Man of Steel.\n\nSpacey also appeared in Edison, which received a direct-to-video release in 2006. In 2008, he played an MIT lecturer in the film 21. The film is based on Ben Mezrich's best seller Bringing Down the House: The Inside Story of Six MIT Students Who Took Vegas for Millions, a story of student MIT card-counters who used mathematical probability to aid them in card games such as blackjack. In early 2010, Spacey went to China to star in writer-director Dayyan Eng's black comedy film Inseparable, becoming the first Hollywood actor to star in a fully Chinese-funded film.\n\nIn September 2006, Spacey said that he intended to take up British citizenship when it is offered to him. When asked about the UK's referendum on whether or not to leave the European Union in 2016, Spacey replied \"I appreciate you asking me the question, but I am not a British citizen, I am a resident of Great Britain. And I have never in my 12 years ever gotten involved in politics in Great Britain. I think it's inappropriate for me as a, really as a guest, in Great Britain, so I'll leave that to the British people.\" On June 16, 2016, Spacey was awarded an honorary knighthood for his services to theatre. The honor, Knight Commander of the Order of the British Empire, was given at Clarence House by Prince Charles. While Spacey will be permitted to add the post-nominal letters, KBE, to his name, as a non-British citizen the award is honorary and he will not be able to style himself as \"Sir Kevin\". Spacey had previously been awarded the lesser rank of honorary Commander of the Order of the British Empire for services to drama in 2010.\n\nSpacey is well known in Hollywood for his impressions. When he appeared on Inside the Actors Studio, he imitated (at host James Lipton's request) James Stewart, Johnny Carson, Katharine Hepburn, Clint Eastwood, John Gielgud, Marlon Brando, Christopher Walken, Al Pacino, and Jack Lemmon. As a young actor in New York City, he used his skill to pretend to be Carson's son to obtain free theater tickets and enter Studio 54.\n\nCapitol/EMI's album Forever Cool (2007) features two duets with Spacey and an earlier recording of Dean Martin: \"Ain't That a Kick in the Head\" and \"King of the Road\". In December 2007, Spacey cohosted the Nobel Peace Prize Concert along with Uma Thurman.\n\n2011–2017\n\nSpacey is a patron of the Shakespeare Schools Festival, a charity that enables school children across the UK to perform Shakespeare in professional theatres. He also sits on the board of directors of the Motion Picture and Television Fund.\n\nOn March 18, 2011, it was announced that Spacey was cast as Frank Underwood in the Netflix series House of Cards. He was nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series at the 65th Primetime Emmy Awards in 2013 becoming the first lead actor to be Primetime Emmy nominated from a web television series. He went on to win the Golden Globe award for Best Actor in a Television Series Drama at the 72nd Golden Globe Awards and Screen Actors Guild nomination for Outstanding Performance by a Male Actor in a Drama Series at the 21st Screen Actors Guild Awards for his season 2 performance.\n\nIn July 2011, Spacey co-starred in the black comedy film Horrible Bosses, which grossed over $209.6 million at the box office. He executive produced the biographical survival thriller film Captain Phillips in 2013, which was nominated for the Academy Award for Best Picture.\n\nSpacey portrayed founder and president of the private military corporation Atlas Corporation, Jonathan Irons, in the 2014 video game Call of Duty: Advanced Warfare through motion capture. Spacey starred as President Richard Nixon in the comedy-drama Elvis & Nixon (2016). The film is based on the meeting that took place between Nixon and singer Elvis Presley (Michael Shannon) in December 1970 wherein Presley requested Nixon swear him in as an undercover agent in the Bureau of Narcotics and Dangerous Drugs. He next starred in the comedy film Nine Lives, as a man trapped in the body of a cat. The film was released on August 5, 2016.\n\nIn March 2017, it was announced that Spacey would portray J. Paul Getty in Ridley Scott's All the Money in the World. He shot his role in the film in 10 days over the summer of 2017. However, due to the sexual assault allegations against Spacey, the company announced on November 8, 2017 that all of his footage would be excised, and Christopher Plummer would replace Spacey as Getty in re-shoots. In spite of the very tight schedule, TriStar Pictures completed the new version of the film in time for a December 25 release.\n\nPositions held outside of acting\n\nArtistic director of the Old Vic\n\nIn February 2003, Spacey announced that he was returning to London to become the artistic director of the Old Vic, one of the city's oldest theatres. Appearing at a press conference with Judi Dench and Elton John, he promised both to appear on stage and to bring in big-name talent. Spacey undertook to remain in the post for a full ten years. The Old Vic Theatre Company staged shows eight months out of the year. Spacey's first season started in September 2004, and opened with the British premiere of the play Cloaca by Maria Goos, directed by Spacey, which opened to mixed reviews. In the 2005 season, Spacey made his UK Shakespearean debut, to good notices, in the title role of Richard II directed by Trevor Nunn.\n\nIn mid-2006, Spacey said that he was having the time of his life working at the Old Vic; at that point in his career, he said, he was \"trying to do things now that are much bigger and outside himself\". He performed in productions of National Anthems by Dennis McIntyre, and The Philadelphia Story by Philip Barry in which he played C.K. Dexter Haven, the Cary Grant role in the film version. Critics applauded Spacey for taking on the management of a theatre, but noted that while his acting was impressive, his skills and judgment as a producer/manager had yet to develop.\n\nIn the 2006 season, Spacey suffered a major setback with a production of Arthur Miller's Resurrection Blues, directed by Robert Altman. Despite an all-star cast (including Matthew Modine and future House of Cards co-star Neve Campbell) and the pedigree of Miller's script, Spacey's decision to lure Altman to the stage proved disastrous: after a fraught rehearsal period, the play opened to a critical panning, and closed after only a few weeks. Later in the year, Spacey starred in Eugene O'Neill's A Moon for the Misbegotten, along with Colm Meaney and Eve Best. The play received excellent reviews for Spacey and Best, and was transferred to Broadway in 2007. For the spring part of the 2007–08 season, Jeff Goldblum and Laura Michelle Kelly joined Spacey as the three characters in David Mamet's 1988 play Speed-the-Plow.\n\nIn 2009, he directed the premiere of Joe Sutton's Complicit, with Richard Dreyfuss, David Suchet and Elizabeth McGovern. Later that year, Trevor Nunn directed Spacey in a revival of Inherit the Wind. Spacey played defense lawyer Henry Drummond, a role that was made famous by Spencer Tracy in the 1960 film of the same name.\n\nSam Mendes directed Spacey in a Shakespeare's Richard III; Spacey played the title role. The show began in June 2011, commencing a worldwide tour culminating in New York in early 2012. In March 2014, it was announced that Spacey would star in a one-man play at the Old Vic to celebrate his 10 years as artistic director. He took on the part of Clarence Darrow in the play.\n\nWithdrawn chairmanship of Relativity Media\n\nIn January 2016 it was announced that Relativity Media, which was just emerging from Chapter 11 bankruptcy, had acquired Trigger Street Productions and that Spacey would become chairman of Relativity Studios whilst Dana Brunetti would become the studio's president. Spacey called the move \"an incredible opportunity to make great entertainment\" and said he considered it the \"next evolution in my career\". However, when the paperwork for the studio was filed for the court it emerged that Spacey had opted out of assuming the chairmanship of the studios, and by the end of 2016 Brunetti had also left Relativity whilst both remained Executive Producers on House of Cards and Manifesto.\n\nPolitical views and activism\n\nSpacey's political views have been described as left-leaning and mirroring some of those possessed by his fictional character in House of Cards. Spacey is a Democrat and a friend of President Bill Clinton. Having met the former U.S. President before his presidency began, Spacey once described Clinton as \"one of a shining light\" in the political process. He additionally made a cameo appearance in the short film President Clinton: Final Days, a light-hearted political satire produced by the Clinton administration for the White House Correspondents Dinner.\n\nSpacey met Venezuelan president Hugo Chávez in September 2007, and never spoke to the press about their encounter. During the trip, he donated money to the Venezuelan film studio Villa del Cine.\n\nIn March 2011 – following Belarusian president Alexander Lukashenko's crackdown on the Belarusian democracy movement – Spacey joined Jude Law on the street in a protest against Lukashenko's regime.\n\nIn 2018, Earl Blue, owner of the security company VIP Protective Services, accused Spacey of using racial slurs against his predominately African-American staff when they were hired on the House of Cards set in 2012.\n\nSexual misconduct allegations\n\nOn October 29, 2017, actor Anthony Rapp alleged that Spacey, apparently drunk, made a sexual advance toward him in 1986, when Rapp was 14. Spacey stated through Twitter that he did not remember the encounter, but that he owed Rapp \"the sincerest apology for what would have been deeply inappropriate drunken behavior\" if he had behaved as asserted.\n\nFifteen others came forward alleging similar abuse, including journalist Heather Unruh (who alleged that Spacey sexually assaulted her son), Norwegian author and Royal Family member Ari Behn, filmmaker Tony Montana, actor Roberto Cavazos, Richard Dreyfuss' son Harry, and eight people who worked on House of Cards. An anonymous man alleged that he had an extended sexual relationship with Spacey in 1983, when he was 14 and Spacey was 24; the man said that the relationship ended with Spacey attempting to rape him. The Guardian was contacted by \"a number of people\" who worked at the Old Vic, where Spacey was artistic director for 11 years, alleging he \"groped and behaved in an inappropriate way with young men at the time\". On November 16, the Old Vic confirmed that it had received 20 testimonies of alleged inappropriate behavior by Spacey, with three stating they contacted the police. In December, Spacey's Usual Suspects costar Gabriel Byrne revealed that production on that film was shut down for two days because Spacey made unwanted sexual advances toward a younger actor.\n\nIn the midst of the allegations, filming of the sixth and final season of House of Cards was suspended. The show had been due to end in 2018. The season was shortened from 13 to 8 episodes and Spacey was removed from the cast. A Gore Vidal biopic starring Spacey, Gore, set to be distributed by Netflix, was canceled; Netflix went on to sever all ties with him. Spacey was due to appear in Ridley Scott's biographical film All the Money in the World as industrialist J. Paul Getty; however, his scenes were cut and Christopher Plummer replaced him as Getty in reshoots. The International Academy of Television Arts and Sciences reversed its decision to honor Spacey with the 2017 International Emmy Founders Award.\n\nOn November 1, Spacey stated that he would be seeking \"evaluation and treatment\" for his behavior. The following day, Variety reported that the actor's publicist Staci Wolfe and talent agency CAA were ending their relationships with him.\n\nPersonal life\n\nIn 1999, reports suggested Spacey was dating a script supervisor named Dianne Dreyer, with their relationship possibly dating back as far as 1992. In 2000, Spacey brought Dreyer to the Academy Awards; during the acceptance speech for his Best Actor award, Spacey stated, \"Dianne, thank you for teaching me about caring about the right things, and I love you.\"\n\nAn article in The Sunday Times Magazine in 1999 stated that Spacey's \"love affair with acting, and the absence of a visible partner in the life of an attractive 40-year-old, has resulted in Esquire magazine asserting two years ago that he must be gay.\" He responded to the rumors by telling Playboy and other interviewers that he was not gay, and telling Lesley White of The Sunday Times:I chose for a long time not to answer these questions because of the manner in which they were asked, and because I was never talking to someone I trusted, so why should I? Recently I chose to participate because it's a little hard on the people I love.In 2007, Gotham magazine quoted Spacey saying:I've never believed in pimping my personal life out for publicity. Although I might be interested in doing it, I will never do it. People can gossip all they want; they can speculate all they want. I just happened to believe that there's a separation between the public life and the private life. Everybody has the right to a private life no matter what their professions are.\n\nSpacey came out as gay in October 2017 when he apologized to Anthony Rapp, disclosing that \"I have had relationships with both men and women. I have loved and had romantic encounters with men throughout my life, and I choose now to live as a gay man.\" His decision to come out via his statement was criticized by prominent members of the gay community, including Billy Eichner, George Takei and Wanda Sykes, as an attempt to change the subject from Rapp's accusation, for using his own drunkenness as an excuse, and for implying a connection between being gay and sexually assaulting a child.\n\nFilmography\n\nDiscography\n\nAlbums\n\n* Beyond the Sea: Original Motion Picture Soundtrack (2004)\n\nSingles\n\n* That Old Black Magic (1997)From the Midnight in the Garden of Good and Evil soundtrack\n\nLive performances\n\n* \"Mind Games\" – Come Together: A Night for John Lennon's Words and Music – October 2, 2001, Radio City Music Hall. Kevin Spacey. http://en.wikipedia.org/?curid=16768."
  }
}
