{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4293",
  "eid" : "cc7615a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778422778,
  "textBody" : "The Baltimore Ravens are a professional American football team based in Baltimore, Maryland. The Ravens compete in the AFC North division of the National Football League. The team plays its home games at M&T Bank Stadium and is headquartered in Owings Mills.\n\nThe Ravens were established in 1996, when Art Modell, who was then the owner of the Cleveland Browns, announced plans to relocate the franchise from Cleveland to Baltimore. As part of a settlement between the league and the city of Cleveland, Modell was required to leave the Browns' history and records in Cleveland for a replacement team and replacement personnel that would take control in 1999. In return, he was allowed to take his own personnel and team to Baltimore, where such personnel would then form an expansion team.\n\nThe Ravens have been one of the more successful franchises since their inception, having qualified for the NFL playoffs ten times since 2000, with two Super Bowl victories (Super Bowl XXXV and Super Bowl XLVII), two AFC Championship titles (2000 and 2012), 15 playoff victories, four AFC Championship game appearances (2000, 2008, 2011 and 2012), four AFC North division titles (2003, 2006, 2011 and 2012), and are currently the only team in the NFL to hold a perfect record in multiple Super Bowl and Thanksgiving Day appearances. The Ravens organization has been led by general manager Ozzie Newsome since 1996, and has had three head coaches: Ted Marchibroda, Brian Billick, and John Harbaugh. With a record-breaking defensive unit in their 2000 season, the team established a reputation for relying on strong defensive play, led by players like middle linebacker Ray Lewis, who, until his retirement, was considered the \"face of the franchise.\" The team is owned by Steve Bisciotti and valued at $1.5 billion, making the Ravens the 24th-most valuable sports franchise in the world.\n\nHistory\n\nTeam name\n\nThe name \"Ravens\" was inspired by Edgar Allan Poe's poem The Raven. Chosen in a fan contest that drew 33,288 voters, the allusion honors Poe, who spent the early part of his career in Baltimore and is buried there. As the Baltimore Sun reported at the time, fans also \"liked the tie-in with the other birds in town, the Orioles, and found it easy to visualize a tough, menacing black bird.\"\n\nBackground\n\nAfter the controversial relocation of the Colts to Indianapolis, several attempts were made to bring an NFL team back to Baltimore.  In 1993, ahead of the 1995 league expansion, the city was considered a favorite, behind only St. Louis, to be granted one of two new franchises.  League officials and team owners feared litigation due to conflicts between rival bidding groups if St. Louis was awarded a franchise, and in October Charlotte, North Carolina was the first city chosen.  Several weeks later, Baltimore's bid for a franchise—dubbed the Baltimore Bombers, in honor of the locally produced Martin B-26 Marauder bomber—had three ownership groups in place and a state financial package which included a proposed $200 million, rent-free stadium and permission to charge up to $80 million in personal seat license fees.  Baltimore, however, was unexpectedly passed over in favor of Jacksonville, Florida, despite Jacksonville's minor TV market status and that the city had withdrawn from contention in the summer, only to return with then-Commissioner Paul Tagliabue's urging.  Although league officials denied that any city had been favored, it was reported that Taglibue and his longtime friend Washington Redskins owner Jack Kent Cooke had lobbied against Baltimore due to its proximity to Washington, D.C., and that Taglibue had used the initial committee voting system to prevent the entire league ownership from voting on Baltimore's bid.  This led to public outrage and the Baltimore Sun describing Taglibue as having an \"Anybody But Baltimore\" policy.  Maryland governor William Donald Schaefer said afterward that Taglibue had led him on, praising Baltimore and the proposed owners while working behind-the-scenes to oppose Baltimore's bid.\n\nBy May 1994, Baltimore Orioles owner Peter Angelos had gathered a new group of investors, including author Tom Clancy, to bid on teams whose owners had expressed interest in relocating.  Angelos found a potential partner in Georgia Frontiere, who was open to moving the Los Angeles Rams to Baltimore.  Jack Kent Cooke opposed the move, intending to build the Redskins' new stadium in Laurel, Maryland, close enough to Baltimore to cool outside interest in bringing in a new franchise.  This led to heated arguments between Cooke and Angelos, who accused Cooke of being a \"carpetbagger.\"  The league eventually persuaded Rams team president John Shaw to relocate to St. Louis instead, leading to a league-wide rumor that Tagliabue was again steering interest away from Baltimore, a claim which Tagliabue denied.  In response to anger in Baltimore, including Governor Schaefer's threat to announce over the loudspeakers Tagliabue's exact location in Camden Yards any time he attended a Baltimore Orioles game, Tagliabue remarked of Baltimore's financial package: \"Maybe (Baltimore) can open another museum with that money.\"  Following this, Angelos made an unsuccessful $200 million bid to bring the Tampa Bay Buccaneers to Baltimore.\n\nHaving failed to obtain a franchise via the expansion, the city, despite having \"misgivings,\" turned to the possibility of obtaining the Cleveland Browns, whose owner Art Modell was financially struggling and at odds with the city of Cleveland over needed improvements to the team's stadium.\n\nNew expansion team\n\nEnticed by Baltimore's available funds for a first-class stadium and a promised yearly operating subsidy of $25 million, Modell announced on November 6, 1995 his intention to relocate the team from Cleveland to Baltimore the following year.  The resulting controversy ended when representatives of Cleveland and the NFL reached a settlement on February 8, 1996. Tagliabue promised the city of Cleveland that an NFL team would be located in Cleveland, either through relocation or expansion, \"no later than 1999\". Additionally, the agreement stipulated that the Browns' name, colors, uniform design and franchise records would remain in Cleveland. The franchise history includes Browns club records and connections with Pro Football Hall of Fame players. Modell's Baltimore team, while retaining all current player contracts, would, for purposes of team history, appear as an expansion team, a new franchise.Morgan, Jon. [http://www.baltimoresun.com/sports/football/bal-modell020996,1,1050941.story \"Deal clears NFL path to Baltimore\"], The Baltimore Sun, February 9, 1996. Not all players, staff or front office would make the move to Baltimore, however.\n\nAfter relocation, Modell hired Ted Marchibroda as the head coach for his new team in Baltimore. Marchibroda was already well known because of his work as head coach of the Baltimore Colts during the 1970s and the Indianapolis Colts during the early 1990s. Ozzie Newsome, the Browns' tight end for many seasons, joined Modell in Baltimore as director of football operations. He was later promoted to vice-president/general manager.\n\nThe home stadium for the Ravens first two seasons was Baltimore's Memorial Stadium, home field of the Baltimore Colts and Baltimore Stallions years before. The Ravens moved to their own new stadium next to Camden Yards in 1998. Raven Stadium would subsequently wear the names PSI Net Stadium and then M&T Bank Stadium.\n\nThe early years and Ted Marchibroda era (1996–1998)\n\n1996\n\nIn the 1996 NFL Draft, the Ravens, with two picks in the first round, drafted offensive tackle Jonathan Ogden at No. 4 overall and linebacker Ray Lewis at No. 26 overall. Both Ogden and Lewis went on to play for the Ravens for their entire professional careers and were both inducted into the Pro Football Hall of Fame.\n\nThe 1996 Ravens won their opening game against the Oakland Raiders, but finished the season 4–12 despite receiver Michael Jackson leading the league with 14 touchdown catches.\n\n1997\n\nThe 1997 Ravens started 3–1. Peter Boulware, a rookie defender from Florida State, recorded 11.5 sacks and was named AFC Defensive Rookie of the Year. The team finished 6–9–1. On October 26, the team made its first trip to Landover, Maryland to play their new regional rivals, the Washington Redskins, for the first time in the regular season, at the new Jack Kent Cooke Stadium (replacing the still-standing RFK Stadium in Washington, D.C.). The Ravens won the game 20–17.\n\n1998\n\nQuarterback Vinny Testaverde left for the New York Jets before the 1998 season, and was replaced by former Indianapolis Colt Jim Harbaugh, and later Eric Zeier. Cornerback Rod Woodson joined the team after a successful stint with the Pittsburgh Steelers, and Priest Holmes started getting the first playing time of his career and ran for 1,000 yards.\n\nThe Ravens finished 1998 with a 6–10 record. On November 29, the Ravens welcomed the Colts back to Baltimore for the first time in 15 years. Amidst a shower of negative cheers towards the Colts, the Ravens, with Jim Harbaugh at quarterback, won 38–31.\n\nBrian Billick era and first Super Bowl victory (1999–2007)\n\n1999\n\nThree consecutive losing seasons under Marchibroda led to a change in the head coach. Brian Billick took over as head coach in 1999. Billick had been offensive coordinator for the record-setting Minnesota Vikings the season before. Quarterback Tony Banks came to Baltimore from the St. Louis Rams and had the best season of his career with 17 touchdown passes and an 81.2 pass rating. He was joined by receiver Qadry Ismail, who posted a 1,000-yard season. The Ravens initially struggled with a record of 4–7 but managed to finish with an 8–8 record.\n\nDue to continual financial hardships for the organization, the NFL took an unusual move and directed Modell to initiate the sale of his franchise. On March 27, 2000, NFL owners approved the sale of 49% of the Ravens to Steve Bisciotti. In the deal, Bisciotti had an option to purchase the remaining 51% for $325 million in 2004 from Art Modell. On April 9, 2004 the NFL approved Steve Bisciotti's purchase of the majority stake in the club.\n\n2000: Super Bowl XXXV champions\n\nBanks shared playing time in the 2000 regular season with Trent Dilfer. Both players put up decent numbers (and a 1,364-yard rushing season by rookie Jamal Lewis helped too) but the defense became the team's hallmark and bailed a struggling offense out in many instances through the season. Ray Lewis was named Defensive Player of the Year. Two of his defensive teammates, Sam Adams and Rod Woodson, made the Pro Bowl. Baltimore's season started strong with a 5–1 record. But the team struggled through mid-season, at one point going five games without scoring an offensive touchdown. The team regrouped and won each of their last seven games, finishing 12–4 and making the playoffs for the first time.\n\nDuring the 2000 season, the Ravens defense broke two notable NFL records. They held opposing teams to 165 total points, surpassing the 1985 Chicago Bears mark of 198 points for a 16-game season as well as surpassing the 1986 Chicago Bears mark of 187 points for a 16-game season, which at that time was the current NFL record.\n\nSince the divisional rival Tennessee Titans had a record of 13–3, the Ravens had to play in the wild card round. They dominated the Denver Broncos 21–3 in their first game. In the divisional playoff, they went on the road to Tennessee. With the score tied 10–10 in the fourth quarter, an Al Del Greco field goal attempt was blocked and returned for a touchdown by Anthony Mitchell, and a Ray Lewis interception return for a score put the game squarely in Baltimore's favor. The 24–10 win put the Ravens in the AFC Championship against the Oakland Raiders. The game was rarely in doubt. Shannon Sharpe's 96-yard touchdown catch early in the second quarter followed by an injury to Raiders quarterback Rich Gannon were crucial as the Ravens won easily, 16–3.\n\nBaltimore then went to Tampa for Super Bowl XXXV against the New York Giants. The game was also dominated by the Ravens. They recorded four sacks and forced five turnovers, one of which was a Kerry Collins interception returned for a touchdown by Duane Starks. The Giants' only score was a Ron Dixon kickoff return for another touchdown; however, the Ravens immediately countered with a return by Jermaine Lewis. The Ravens became champions with a 34–7 win, becoming only the third wild card team to win a Super Bowl championship.\n\n2001\n\nIn 2001, the Ravens attempted to defend their title with Elvis Grbac as their new starting quarterback, but a season-ending injury to Jamal Lewis on the first day of training camp and poor offensive performances stymied the team. After a 3–3 start, the Ravens defeated the Minnesota Vikings in the final week to clinch a wild card berth at 10–6. In the first round the Ravens showed flashes of their previous year with a 20–3 win over the Miami Dolphins, in which the team forced three turnovers and out-gained the Dolphins 347 yards to 151. In the divisional playoff the Ravens played the Pittsburgh Steelers. Three interceptions by Grbac ended the Ravens' season, as they lost 27–10.\n\n2002\n\nBaltimore ran into salary cap problems entering the 2002 season and was forced to part with a number of impact players. In the NFL Draft, the team selected Ed Reed with the 24th overall pick. Reed would go on to become one of the best safeties in NFL history, making nine Pro Bowls until leaving the Ravens for the Houston Texans in 2013. Despite low expectations, the Ravens stayed somewhat competitive in 2002 until a losing streak in December eliminated any chances of a post-season berth. Their final record that year was 7–9.\n\n2003\n\nIn 2003, the Ravens drafted their new quarterback, Kyle Boller, but he was injured midway through the season and was replaced by Anthony Wright. Jamal Lewis ran for 2,066 yards (including a record 295 yards in one game against the Cleveland Browns on September 14). With a 10–6 record, Baltimore won their first AFC North division title. Their first playoff game, at home against the Tennessee Titans, went back and forth, with the Ravens being held to only 54 yards total rushing. The Titans won 20–17 on a late field goal, and Baltimore's season ended early.\n\nRay Lewis was also named Defensive Player of the year for the second time in his career.\n\nIn April 2003, Art Modell sold 49% of the team to Steve Bisciotti, a local businessman who had made his fortune in the temporary staffing field. After the season, Art Modell sold his remaining 51% ownership to Bisciotti, ending over 40 years of tenure as an NFL franchise owner.\n\n2004\n\nThe Ravens did not make the playoffs in 2004 and finished the season with a record of 9–7 with Kyle Boller spending the season at QB. They did get good play from veteran corner Deion Sanders and third year safety Ed Reed, who won the NFL Defensive Player of the Year award. They were also the only team to defeat the 15–1 Pittsburgh Steelers in the regular season.\n\n2005\n\nIn the 2005 offseason the Ravens looked to augment their receiving corps (which was second-worst in the NFL in 2004) by signing Derrick Mason from the Titans and drafting star Oklahoma wide receiver Mark Clayton in the first round of the 2005 NFL Draft. However, the Ravens ended their season 6–10, but defeated the Green Bay Packers 48–3 on Monday Night Football and the Super Bowl champion Steelers.\n\n2006\n\nThe 2006 Baltimore Ravens season began with the team trying to improve on their 6–10 record of 2005. The Ravens, for the first time in franchise history, started 4–0, under the leadership of former Titans quarterback Steve McNair.\n\nThe Ravens lost two straight games mid-season on offensive troubles, prompting coach Billick to drop their offensive coordinator Jim Fassel in their week seven bye. After the bye, and with Billick calling the offense, Baltimore would record a five-game win streak before losing to the Cincinnati Bengals in week 13.\n\nStill ranked second overall to first-place San Diego Chargers, the Ravens continued on. They defeated the Kansas City Chiefs, and held the defending Super Bowl champion Pittsburgh Steelers to only one touchdown at Heinz Field, allowing the Ravens to clinch the AFC North.\n\nThe Ravens ended the regular season with a franchise-best 13–3 record. Baltimore had secured the AFC North title, the No. 2 AFC playoff seed, and clinched a 1st-round bye by season's end. The Ravens were slated to face the Indianapolis Colts in the second round of the playoffs, in the first meeting of the two teams in the playoffs. Many Baltimore and Indianapolis fans saw this historic meeting as a sort of \"Judgment Day\" with the new team of Baltimore facing the old team of Baltimore (the former Baltimore Colts having left Baltimore under questionable circumstances in 1984). Both Indianapolis and Baltimore were held to scoring only field goals as the two defenses slugged it out all over M&T Bank Stadium. McNair threw two costly interceptions, including one at the 1-yard line. The eventual Super Bowl champion Colts won 15–6, ending Baltimore's season.\n\n2007\n\nAfter a stellar 2006 season, the Ravens hoped to improve upon their 13–3 record but injuries and poor play plagued the team. The Ravens finished the 2007 season in the AFC North cellar with a disappointing 5–11 record. A humiliating 22–16 overtime loss to the previously winless Miami Dolphins on December 16 ultimately led to Billick's dismissal on New Year's Eve, one day after the end of the regular season. He was replaced by John Harbaugh, the special teams coach of the Philadelphia Eagles and the older brother of former Ravens quarterback Jim Harbaugh (1998).\n\nJohn Harbaugh/Joe Flacco era; second Super Bowl (2008–present)\n\n2008: Arrival of John Harbaugh, Flacco, and Ray Rice\n\nWith rookies at head coach (John Harbaugh) and quarterback (Joe Flacco), the Ravens entered the 2008 campaign with lots of uncertainty. Baltimore smartly recovered in 2008, winning eleven games and achieving a wild card spot in the postseason. On the strength of four interceptions, one resulting in an Ed Reed touchdown, the Ravens began its postseason run by winning a rematch over Miami 27–9 at Dolphin Stadium on January 4, 2009 in a wild-card game.[http://sports.espn.go.com/nfl/recap?gameId290104015&campaign\nrss&sourceESPNHeadlines \"Pennington throws four interceptions in loss,\" The Associated Press, Sunday, January 4, 2009.] Six days later, they advanced to the AFC Championship Game by avenging a Week 5 loss to the Titans 13–10 at LP Field on a Matt Stover field goal with 53 seconds left in regulation time.[http://sports.espn.go.com/nfl/recap?gameId\n290110010&campaignrss&source\nESPNHeadlines] \"Stover's FG with 53 seconds left boots Ravens into AFC Championship Game\". The Ravens fell one victory short of Super Bowl XLIII by losing to the Steelers 23–14 at Heinz Field on January 18, 2009.[http://sports.espn.go.com/nfl/recap?gameId=290118023 \"Polamalu's INT return secures Steelers' Super Bowl berth,\" The Associated Press, Sunday, January 18, 2009.]\n\n2009\n\nIn 2009, the Ravens won their first three matches, then lost the next three, including a close match in Minnesota. The rest of the season was an uneven string of wins and losses, which included a home victory over Pittsburgh in overtime followed by a Monday Night loss in Green Bay. That game was notable for the huge number of penalties committed, costing a total of 310 yards, and almost tying with the record set by Tampa Bay and Seattle in 1976. Afterwards, the Ravens easily crushed the Lions and Bears, giving up less than ten points in both games. The next match was against the Steelers, where Baltimore lost a close one before beating the Raiders to end the season. With a record of 9–7, the team finished second in the division and gained another wild card. Moving into the playoffs, they overwhelmed the Patriots; nevertheless they did not reach the AFC Championship because they were routed 20–3 by the Colts in the divisional round a week later.\n\n2010\n\nBaltimore managed to beat the Jets 10–9 on the 2010 opener, but then lost a poorly-played game against Cincinnati the following week. The Ravens rebounded against the other two division teams, beating Cleveland 24–17 in Week 3 and then Pittsburgh 17–14 in Week 4. The Ravens scored a fine win (31–17) at home against Denver in Week 5. After an overtime loss to New England, they narrowly avoided losing at home to the winless Bills. Next, the Ravens hosted Miami and won 26–10, breaking that team's 4–0 road streak. On Thursday Night, the team headed to Atlanta and lost 26–21 in a game that had some criticizing the officiating. The Ravens finished the season 12–4, second in the division due to a tiebreaker with Pittsburgh, and earning a wild card spot. Baltimore headed to Kansas City and crushed the unprepared Chiefs 34–7, but once again were knocked from the playoffs by Pittsburgh in a hard-fought battle.\n\n2011\n\nThe Ravens hosted their arch-enemy in Week 1 of the 2011 season. On a hot, humid day in M&T Bank Stadium, crowd noise and multiple Steelers mistakes allowed Baltimore to crush them with three touchdowns 35–7. The frustrated Pittsburgh players also committed several costly penalties. Thus, the Ravens had gained their first ever victory over the Steelers with Ben Roethlisberger playing and avenged themselves of repeated regular and postseason losses in the series.\n\nBut in Week 2, the Ravens collapsed in Tennessee and lost 26–13. They rebounded by routing the Rams in Week 3 and then overpowering the Jets 34–17 in Week 4.\nWeek 5, the Ravens had a bye week, following a game against the Texans. But in Week 7, Baltimore had a stunning MNF upset loss in Jacksonville as they were held to one touchdown in a 12–7 loss. Their final scoring drive failed as Joe Flacco threw an interception in the closing seconds of the game.\n\nAfter beating the Cincinnati Bengals in Week 17 of the regular season, the Ravens advanced to the playoffs as the Number 2 seed in the AFC with a record of 12-4.  They gained the distinction of AFC North Champions over Pittsburgh (12-4) due to a tie breaker.\n\nRavens' Lee Evans was stripped of a 14-yard touchdown pass by the Patriots Sterling Moore with 22 seconds left and Ravens kicker Billy Cundiff pushed a 32-yard field goal attempt wide left on fourth down as the Patriots held on to beat the Ravens 23-20 during the AFC championship game and advance to Super Bowl XLVI.\n\n2012: Ray Lewis' final season and 2nd Super Bowl\n\nThe Ravens' attempt to convert Joe Flacco into a pocket passer remained a work in progress as the 2012 season began. Terrell Suggs suffered a tendon injury during an off-season basketball game and was unable to play for at least several weeks. In the opener on September 10, Baltimore routed Cincinnati 44-13. After this easy win, the team headed to Philadelphia. The Eagles had struggled during their Week 1 match in Cleveland and were not expected to win, but a bizarre game ensued thanks to the NFL facing another lockout mess, this one involving the league's referees, who were replaced by ex-college officials. The replacement officials were widely criticized throughout the league.  This game featured multiple questionable calls that went against the Ravens, perhaps costing them the game 24-23.\n\nReturning home for a primetime rematch of the AFC Championship, another bizarre game ensued. New England picked apart the Baltimore defense (which was considerably weakened without Terrell Suggs and some other players lost over the off-season) for the first half. Trouble began early in the game when a streaker ran out onto the field and had to be tackled by security, and accelerated when, at 2:18 in the 4th quarter, the referees made a holding call on RG Marshal Yanda. Enraged fans repeatedly chanted an obscenity at this penalty. The Ravens finally drove downfield and on the last play of the game, Justin Tucker kicked a 27-yard field goal to win the game 31-30, capping off a second intense and controversially-officiated game in a row for the Ravens.\n\nThe Ravens would win the AFC North with a 10-6 record, but finished 4th in the AFC playoff seeding, and thus had to play a wild-card game. After defeating the Indianapolis Colts 24-9 at home (the final home game of Ray Lewis), the Ravens traveled to Denver to play against the top seeded Broncos. In a very back-and-forth contest, the Ravens pulled out a 38-35 victory in double overtime. They then won their 2nd AFC championship by coming back from a 13-7 halftime deficit to defeat the New England Patriots once again, 28-13.\n\nThe Ravens played the Super Bowl XLVII on February 3, 2013, against the San Francisco 49ers. Baltimore built a 28–6 lead early in the third quarter before a partial power outage in the Superdome suspended play for 34 minutes (earning the game the added nickname of the Blackout Bowl). After play resumed, San Francisco scored 17 unanswered third-quarter points to cut the Ravens' lead, 28–23, and continued to chip away in the fourth quarter. With the Ravens leading late in the game, 34–29, the 49ers advanced to the Baltimore 7-yard line just before the two-minute warning but turned the ball over on downs. The Ravens then took an intentional safety in the waning moments of the game to preserve the victory. Baltimore quarterback Joe Flacco, who completed 22 of 33 passes for 287 yards and three touchdowns, was named Super Bowl MVP.\n\n2013\n\nComing off as the defending Super Bowl champions, this was the first year in franchise history for the team without Ray Lewis. The Ravens started out 3-2, and started the 2-0 Houston Texans 14-loss streak by shutting them 30-9 in Week 3. However, the Ravens lost their next 3 games, losing to the Green Bay Packers and Pittsburgh Steelers in last-minute field goals and were shut out in an attempt to tie the game against the Cleveland Browns 18-24.\n\nAfter winning and losing their next game, the Baltimore Ravens came out 4-6, but managed winning their next four games in dominating the Jets 19-3 in Baltimore, a Steelers win 20-22 during Thanksgiving, a booming ending in Baltimore against the Vikings 29-26, and a 18-16 win at Detroit, including Justin Tucker's 61-yard game-winning field goal. The Ravens were 8-6, with the 6th seed, but after losing their next two games, and the San Diego Chargers winning their next two to clinch the 6th seed, the Ravens finished 8-8 and missed the playoffs for the first time since 2007.\n\n2014\n\nOn January 27, 2014, the Ravens hired former Houston Texans head coach Gary Kubiak to be their new offensive coordinator after Jim Caldwell accepted the new available head coaching job with the Detroit Lions. On February 15, 2014, star running back Ray Rice and his fiancée Janay Palmer were arrested and charged with assault after a physical altercation at Revel Casino in Atlantic City, New Jersey. Celebrity news website TMZ posted a video of Rice dragging Palmer's body out of an elevator after apparently knocking her out. For the incident, Rice was initially suspended for the first two games of the 2014 NFL season on July 25, 2014, which led to widespread criticism of the NFL.\n\nIn Week 1, on September 7, the Baltimore Ravens lost to the Cincinnati Bengals, 23-16. The next day, on September 8, 2014, TMZ released additional footage from an elevator camera showing Rice punching Palmer. The Baltimore Ravens terminated Rice's contract as a result, and was later indefinitely suspended by the NFL. Although starting out 0-1 for two straight seasons and having received unwanted media attention for the Ray Rice incident, on September 11, 2014, the Ravens rallied back and beat the Pittsburgh Steelers 26-6, to improve to 1-1. In Week 12, the Ravens traveled down for an interconference battle with the New Orleans Saints, which the Ravens won 34-27, reaching a 4-0 sweep of the NFC south. In Week 16, the Ravens traveled to Houston to take on the Texans. In one of Joe Flacco's worst performances, the offense sputtered against the Houston defense and Flacco threw three interceptions, falling to the Texans 25-13. With their playoff chances and season hanging in the balance, the Ravens took on the Browns in Week 17 at home. After three quarters had gone by and down 10-3, Joe Flacco led the Ravens on a comeback scoring 17 unanswered points, winning 20-10. With the win, and the Kansas City Chiefs defeating the San Diego Chargers, the Ravens clinched their sixth playoff berth in seven seasons, and the first since winning Super Bowl XLVII.\n\nIn the wildcard playoff game, the Ravens won 30-17 against their divisional rivals, the Pittsburgh Steelers, at Heinz Field. In the next game in the Divisional round, the Ravens faced the New England Patriots. Despite a strong offensive effort and having a 14-point lead twice in the game, the Ravens were defeated by the Patriots 35-31, ending their season.\n\n2015\n\nThe 2015 season marked 20 seasons of the franchise's existence, competing in the NFL which the franchise have recognized with a special badge being worn on their uniforms during the 2015 NFL season.\nAfter coming up just short against the Patriots in the playoffs, the Ravens were picked by some to win the AFC and even the Super Bowl.  However, they lost key players such as Joe Flacco, Justin Forsett, Terrell Suggs, Steve Smith Sr., and Eugene Monroe to season-ending injuries.  Injuries and their inability to win close games early in the season led to the first losing season in the John Harbaugh-Flacco era.\n\n2016\n\nThe 2016 Ravens improved on their 5–11 record from 2015, finishing 8–8, but failed to qualify the playoffs for the second straight year. They were eliminated from playoff contention after their Week 16 loss to their division rivals, the Steelers. This was the first time the Ravens missed the playoffs in consecutive seasons since 2004–2005, as well as the first in the Harbaugh/Flacco era.\n\n2017\n\nThe Ravens improved upon their 8-8 record in 2016 by one win, finishing the season 9-7 and missing the playoffs for the third year in a row. This marked the first time the Ravens failed to make the playoffs in three straight seasons since the team's first three years of existence (1996-1998). The Ravens suffered a heartbreaking loss at home to the Cincinnati Bengals in the final game of the season that prevented them from earning a playoff berth.\n\nRivalries\n\nPittsburgh Steelers\n\nBy far the team's biggest rival is the Pittsburgh Steelers. Pittsburgh and Baltimore are separated by a less-than-5-hour drive along Interstate 70. Both teams are known for their hard-hitting physical style of play. They play twice a year in the AFC North, and have met four times in the playoffs. Games between these two teams usually come down to the wire as most within the last 5 years have come down to 3 points or less.\nThe rivalry is considered one of the most significant and intense in the NFL today.\n\nIndianapolis Colts\n\nAlthough the Steelers rivalry is based on mutual respect and antagonism for each other, the Ravens' rivalry with the Indianapolis Colts is fueled by the fans' animosity towards the organization, not contention between the players. This is due to the fact that the then-Colts owner, Robert Irsay, under the threat of eminent domain from the city of Baltimore, was forced to sneak the Colts out of Baltimore in the middle of the night to take them to Indianapolis. During Ravens home games the scoreboard lists the away team simply as \"Away\" or \"Indy\" rather than the team name that is traditionally used for the visiting opponent. The PA announcer will also refer to the Colts as the Indianapolis Professional Football Team; although on January 6, 2013 the scoreboard at the playoff game between the Baltimore Ravens and Indianapolis Colts at M&T Bank Stadium listed the away team as \"Colts\". The Indianapolis Colts hold an all-time 9–4 advantage over the Baltimore Ravens, including a 2–1 advantage in the playoffs.\n\nOther AFC North  rivals\n\nThe Ravens also have divisional rivalries with the Cleveland Browns and Cincinnati Bengals.\n\nThe reactivated Cleveland Browns and their fans maintain a hatred of Baltimore's team due to its move from Cleveland. The rivalry with the Browns has been very one-sided; Baltimore holds an advantage of 27-9 against Cleveland.\n\nThe rivalry with Cincinnati has been closer, with the Ravens leading the all-time series 22-21 as of Week 3 of the 2017 NFL Season.\n\nNew England Patriots\n\nThe Ravens first met the New England Patriots in 1996, but the rivalry truly started in 2007 when the Ravens suffered a bitter 27–24 loss in the Patriots quest for perfection. The rivalry began to escalate in 2009 when the Patriots beat the Ravens 27–21 in a game that involved a confrontation between Patriots quarterback Tom Brady and Ravens linebacker Terrell Suggs. Both players would go on to take verbal shots at each other through the media after the game.  The Ravens faced the Patriots in a 2009 AFC wild card playoff game and won 33–14; the Ravens ran the ball for more than 250 yards.\n\nThe Ravens faced the Patriots in Week 6 of the 2010 season; the Ravens ended up losing 23–20 in overtime; the game caused controversy due to a hit to the helmet of tight end Todd Heap by Patriots safety Brandon Meriweather.Ryan Hudson, [http://boston.sbnation.com/new-england-patriots/2010/10/19/1761235/brandon-meriweather-shit-todd-heap-nfl-helmet-concussion Brandon Meriweather Says Hit On Todd Heap Was 'Split-Second Decision'], SB Nation. Retrieved October 28, 2012.\n\nThe Ravens played the Patriots for the third consecutive season, in the 2011 AFC championship game in which the Ravens lost 23–20.  The rivalry reached a new level of friction with this, the second career playoff game between the two clubs.  The Ravens clawed to a 20–16 lead in the fourth quarter but Patriots quarterback Tom Brady dove into the end zone to make the score 23–20 with around 11 minutes remaining; this proved to be the winning touchdown. On the Ravens last possession of the game, quarterback Joe Flacco threw a pass to wide receiver Lee Evans in the corner of the end zone which looked to be the game-winning touchdown, before a last second strip by Sterling Moore forced the ball from the hands of Evans, forcing the game to be decided on a last-minute field goal by Ravens placekicker Billy Cundiff. With eleven seconds remaining on the clock, the kicker missed the 32-yard field goal attempt by a very wide margin, allowing the Patriots to kill the clock on their way to Super Bowl XLVI.\n\nThe Ravens' first regular-season win over the Patriots came on September 23, 2012.  The game was emotional as receiver Torrey Smith was competing following the death of his brother in a motorcycle accident just the night before. Smith caught two touchdowns in a back and forth game; the Ravens erased a 13–0 deficit in the first half and led 14–13, but the Patriots scored at the end of the second quarter for a 20–14 lead. The lead changed twice in the third quarter and the Patriots led 30–21 in the fourth, but the Ravens scored on Smith's second touchdown catch. The Ravens were stopped on fourth down but the Patriots had to punt; in the final two minutes a pass interference penalty on Devin McCourty put the ball at the Patriots 7-yard line; new Ravens kicker Justin Tucker booted a 27-yard field goal on the final play; the ball sailed directly over the upright and was ruled good; the quality of officiating by replacement referees caused controversy as Bill Belichick angrily reached for one of the referees as they were leaving the field, leading to a $50,000 fine later that week.\n\nThe two teams met again on January 20, 2013 in the AFC Championship, where the Ravens won 28–13. The Patriots led at halftime, 13–7, but the Ravens' defense gave up no points in the second half. It was the first time ever that Tom Brady lost a game at home after leading at halftime, and the first time a road team beat the Patriots in the AFC Championship.\n\nOn December 22, 2013 the teams met again, this rematch of the AFC championship game was a mismatch from the outset. New England took a 17-0 lead early in the second quarter and never let up behind a defense that forced four turnovers and had four sacks. New England would go on to win the game 41-7.\n\nOn January 10, 2015, the two teams would meet in the Divisional Round of the playoffs. Unlike the previous meeting, the Ravens put up a strong offensive performance, leading by 14 points twice in the game. However, Tom Brady would bring the Patriots back by attacking the Ravens vulnerable secondary and taking a 35-31 lead late in the 4th quarter. Joe Flacco would drive to the Patriots side of the field with under two minutes to play in regulation. However, a key interception by Flacco due to a misplay on the ball by Torrey Smith essentially sealed the game in the Patriots favor to send them to the AFC Championship.\n\nLogo controversy\n\nThe team's first helmet logo, used from 1996 through 1998, featured raven wings outspread from a shield displaying a letter B framed by the word Ravens overhead and a cross bottony underneath. The US Fourth Circuit Court of Appeals affirmed a jury verdict that the logo infringed on a copyright retained by Frederick E. Bouchat, an amateur artist and security guard in Maryland, but that he was entitled to only three dollars in damages from the NFL.\n\nBouchat had submitted his design to the Maryland Stadium Authority by fax after learning that Baltimore was to acquire an NFL team. He was not credited for the design when the logo was announced. Bouchat sued the team, claiming to be the designer of the emblem; representatives of the team asserted that the image had been designed independently. The court ruled in favor of Bouchat, noting that team owner Modell had access to Bouchat's work. Bouchat's fax had gone to John Moag, the Maryland Stadium Authority chairman, whose office was located in the same building as Modell's. Bouchat ultimately was not awarded monetary compensation in the damages phase of the case.Bouchat v. Balt. Ravens Football Club, 346 F.3d 514, 519 (4th Cir. 2003), cert. denied 541 U.S. 1042 (2004) (\"The damages trial was conducted over a period of six days, from July 17 to 24, 2002. On July 23, 2002, at the close of the evidence, the jury was asked to decide whether the Defendants had proven, by a preponderance of the evidence, that the Non-Excluded Merchandise Revenues were attributable entirely to factors other than the Defendants' infringement of Bouchat's copyright. If the jury found that they were not, then it was charged to decide the percentage of the Non-Excluded Merchandise Revenues attributable to factors other than the infringement. After a full day of deliberations, the jury answered the first question in the affirmative, thereby denying Bouchat any monetary recovery.\")\n\nThe Baltimore Sun ran a poll showing three designs for new helmet logos. Fans participating in the poll expressed a preference for a raven's head in profile over other designs. Art Modell announced that he would honor this preference but still wanted a letter B to appear somewhere in the design. The new Ravens logo featured a raven's head in profile with the letter superimposed. The secondary logo is a shield that honors Baltimore's history of heraldry. Alternating Calvert and Crossland emblems (seen also in the flag of Maryland and the flag of Baltimore) are interlocked with stylized letters B and R.\n\nUniforms\n\nThe design of the Ravens uniform has remained essentially unchanged since the team's inaugural season in 1996. Art Modell admitted to ESPN's Roy Firestone that the Ravens' colors, introduced in early 1996, were inspired by the Northwestern Wildcats 1995 dream season. Helmets are black with purple \"talon\" stripes rising from the facemask to the crown. Players normally wear purple jerseys at home and white jerseys on the road. In 1996 the team wore black pants with a single large white stripe for all games. At home games the combination of black pants with purple jersey made the Ravens the first NFL team to wear dark colors head to calf. A number of NFL teams have since donned the look, beginning with the all-black home uniform worn in three games by the 2001 New Orleans Saints.\n\nIn 1997 the Ravens opted for a more classic NFL look with white pants sporting stripes in purple and black, along with the jerseys sporting a different font for the uniform numbers. The white pants were worn with both home and road jerseys. The road uniform (white pants with white jerseys) was worn by the Ravens in Super Bowl XXXV, at the end of the 2000 NFL season.\n\nIn the 2002 season the Ravens began the practice of wearing white jerseys for the home opener and, occasionally, other early games in the season that have a 1:00 kickoff. Since John Harbaugh became the head coach in 2008, the Ravens have also worn their white jerseys at home for preseason games.\n\nIn November 2004 the team introduced an alternate uniform design featuring black jerseys and solid black pants with black socks. The all-black uniform was first worn for a home game against the Cleveland Browns, entitled \"Pitch Black\" night, that resulted in a Ravens win. The uniform has since been worn for select prime-time national game broadcasts and other games of significance.\n\nThe Ravens began wearing black pants again with the white jersey in 2008. On December 7, 2008, during a Sunday Night Football game against the Washington Redskins, the Ravens introduced a new combination of black jersey with white pants. It was believed to be due to the fact that John Harbaugh doesn't like the \"blackout\" look. However, on December 19, 2010, the Ravens wore their black jerseys and black pants in a 30–24 victory over the New Orleans Saints.\n\nOn December 5, 2010, the Ravens reverted to the black pants with the purple jerseys versus the Pittsburgh Steelers during NBC's Sunday Night Football telecast.  The Ravens lost to the Steelers 13–10. They wore the same look again for their game against the Cleveland Browns on December 24, 2011, and they won, 20–14. They wore this combination a third time against the Houston Texans on January 15, 2012 in the AFC Divisional playoff. They won 20–13. They would again wear this combination on January 6, 2013, during the AFC Wild Card playoff and what turned out to be Ray Lewis' final home game, where they defeated the Indianapolis Colts 24-9.\n\nFrom their inaugural season until 2006, the Ravens wore white cleats with their uniforms; they switched to black cleats in 2007.\n\nOn December 20, 2015, the team unexpectedly debuted gold pants for the first time, wearing them with their regular purple jerseys against the Kansas City Chiefs. Although gold is an official accent color of the Ravens, the pants got an overwhelmingly negative response on social media by both Ravens fans and fans of other NFL teams, with some comparisons being made to the rival Pittsburgh Steelers' pants, and mustard.\n\nMarching band\n\nThe team marching band is called Baltimore's Marching Ravens. They began as the Colts' marching band and have operated continuously from September 7, 1947 to the present. They helped campaign for football to return to Baltimore after the Colts moved. Because they stayed in Baltimore after the Colts left, the band is nicknamed \"the band that would not die\" and were the subject of an episode of ESPN's 30 for 30. The Washington Redskins are the only other NFL team that currently has a marching band.\n\nPlayers of note\n\nCurrent roster\n\n| style=\"text-align:center;\"|Note: The following lists players who officially played for the Ravens. For other Hall of Famers, players whose numbers were retired, and players who played for the Baltimore Colts, see Indianapolis Colts. Bold number notes player inducted as a Raven. For Cleveland Browns players, including those in the Hall of Fame and those whose numbers were retired, see Cleveland Browns\n|}\n\nPro Football Hall of Fame\n\nRetired numbers\n\nThe Ravens do not officially have retired numbers. However, the number 19 is not issued out of respect for Baltimore Colts quarterback Johnny Unitas, except for quarterback Scott Mitchell in his lone season in Baltimore in 1999. In addition, numbers 75, 52, and 20, in honor of Jonathan Ogden, Ray Lewis, and Ed Reed respectively, have not been issued since those players' retirements from football. The number 3 has been in very limited circulation (offseason only) in respect to former kicker Matt Stover.\n\nRing of Honor\n\nThe Ravens have a \"Ring of Honor\" which is on permanent display encircling the field of M&T Bank Stadium. The ring currently honors the following, including 8 former members of the Baltimore Colts. Bold Numbers are those whose numbers have not been issued or reissued after a player's time in Baltimore:\n\nKey/Legend\n\nFirst round draft picks\n\nThe Baltimore Ravens had their first draft in 1996, where they selected offensive lineman from UCLA and current NFL Hall of Famer, and 11-time Pro-Bowler Jonathan Ogden. Along with their pick in the next year's draft, this was the highest first-round draft pick that the Ravens have had. They also selected Ray Lewis with the 26th pick. In both 1996 and 2000, the Ravens had two first-round draft picks. However, in 2004 they had none. In their history, the Ravens have drafted 4 offensive linemen, 3 linebackers, 2 wide receivers, 2 cornerbacks, 2 quarterbacks, a running back, tight end, safety, and defensive tackle. The Ravens have 56 combined Pro-Bowl appearances from their first-round draft picks.\n\nTeam records\n\nPassing \n\n+ min. 500 attempts, # \n min. 100 attempts, ∗ = minimum 15 attempts,\n\nRushing \n\n∗ minimum 15 attempts, # \n min. 100 attempts, + = min. 500 attempts\n\nReceiving \n\n∗ minimum 4 receptions, # \n min. 20 receptions, + = min. 200 receptions\n\nOther \n\nReturns \n\nKicking \n\nDefense \n\nExceptional Performances \n\nOther Career Records \n\n*Most Tackles: Ray Lewis, 1,573 (1996–2012)\n*Most Forced Fumbles: Terrell Suggs, 28 (2003–present)\n*Longest Field Goal Made: Justin Tucker, 61 yards (2012–present)\n\nAll records as of February 9, 2017 per Pro-Football Reference.com\n\nHead coaches\n\nCurrent staff\n\nBroadcast media\n\nThe Ravens' flagship radio stations are WIYY (98 Rock) and WBAL 1090 AM, with Gerry Sandusky (WBAL-TV Sports Anchor since 1988) as the play-by-play announcer and analysts Stan White (Baltimore Colts LB 1972–1979) and Qadry Ismail (Baltimore Ravens WR 1999–2001).\n\nThe team's flagship station is WBAL-TV, which broadcasts pre-season games and team programming throughout the season. The programming is syndicated to WJLA-TV in Washington, WGAL in the Harrisburg–Lebanon–York–Lancaster, Pennsylvania market, and until 2017, was carried through the remainder of the team's region by CSN Mid-Atlantic. In January 2017, the Ravens announced that it had cut ties with CSN Mid-Atlantic, as the network was cutting back on its day-to-day coverage of other teams in the region in order to focus more extensively on the Washington Capitals and Wizards—whose games are broadcast by CSN Mid-Atlantic, and whose owner holds a stake in the network. The team announced that it would seek a new partner; until 2010, these rights were held by MASN.\n\nRavens regular season games are typically broadcast by WJZ-TV as part of CBS's rights to the AFC, but games may occasionally be broadcast on WBAL (Sunday Night Football and simulcasts of games on cable) or WBFF-TV.\n\nRadio",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Baltimore Ravens" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4293" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Baltimore Ravens are a professional American football team based in Baltimore, Maryland. The Ravens compete in the AFC North division of the National Football League. The team plays its home games at M&T Bank Stadium and is headquartered in Owings Mills.\n\nThe Ravens were established in 1996, when Art Modell, who was then the owner of the Cleveland Browns, announced plans to relocate the franchise from Cleveland to Baltimore. As part of a settlement between the league and the city of Cleveland, Modell was required to leave the Browns' history and records in Cleveland for a replacement team and replacement personnel that would take control in 1999. In return, he was allowed to take his own personnel and team to Baltimore, where such personnel would then form an expansion team.\n\nThe Ravens have been one of the more successful franchises since their inception, having qualified for the NFL playoffs ten times since 2000, with two Super Bowl victories (Super Bowl XXXV and Super Bowl XLVII), two AFC Championship titles (2000 and 2012), 15 playoff victories, four AFC Championship game appearances (2000, 2008, 2011 and 2012), four AFC North division titles (2003, 2006, 2011 and 2012), and are currently the only team in the NFL to hold a perfect record in multiple Super Bowl and Thanksgiving Day appearances. The Ravens organization has been led by general manager Ozzie Newsome since 1996, and has had three head coaches: Ted Marchibroda, Brian Billick, and John Harbaugh. With a record-breaking defensive unit in their 2000 season, the team established a reputation for relying on strong defensive play, led by players like middle linebacker Ray Lewis, who, until his retirement, was considered the \"face of the franchise.\" The team is owned by Steve Bisciotti and valued at $1.5 billion, making the Ravens the 24th-most valuable sports franchise in the world.\n\nHistory\n\nTeam name\n\nThe name \"Ravens\" was inspired by Edgar Allan Poe's poem The Raven. Chosen in a fan contest that drew 33,288 voters, the allusion honors Poe, who spent the early part of his career in Baltimore and is buried there. As the Baltimore Sun reported at the time, fans also \"liked the tie-in with the other birds in town, the Orioles, and found it easy to visualize a tough, menacing black bird.\"\n\nBackground\n\nAfter the controversial relocation of the Colts to Indianapolis, several attempts were made to bring an NFL team back to Baltimore.  In 1993, ahead of the 1995 league expansion, the city was considered a favorite, behind only St. Louis, to be granted one of two new franchises.  League officials and team owners feared litigation due to conflicts between rival bidding groups if St. Louis was awarded a franchise, and in October Charlotte, North Carolina was the first city chosen.  Several weeks later, Baltimore's bid for a franchise—dubbed the Baltimore Bombers, in honor of the locally produced Martin B-26 Marauder bomber—had three ownership groups in place and a state financial package which included a proposed $200 million, rent-free stadium and permission to charge up to $80 million in personal seat license fees.  Baltimore, however, was unexpectedly passed over in favor of Jacksonville, Florida, despite Jacksonville's minor TV market status and that the city had withdrawn from contention in the summer, only to return with then-Commissioner Paul Tagliabue's urging.  Although league officials denied that any city had been favored, it was reported that Taglibue and his longtime friend Washington Redskins owner Jack Kent Cooke had lobbied against Baltimore due to its proximity to Washington, D.C., and that Taglibue had used the initial committee voting system to prevent the entire league ownership from voting on Baltimore's bid.  This led to public outrage and the Baltimore Sun describing Taglibue as having an \"Anybody But Baltimore\" policy.  Maryland governor William Donald Schaefer said afterward that Taglibue had led him on, praising Baltimore and the proposed owners while working behind-the-scenes to oppose Baltimore's bid.\n\nBy May 1994, Baltimore Orioles owner Peter Angelos had gathered a new group of investors, including author Tom Clancy, to bid on teams whose owners had expressed interest in relocating.  Angelos found a potential partner in Georgia Frontiere, who was open to moving the Los Angeles Rams to Baltimore.  Jack Kent Cooke opposed the move, intending to build the Redskins' new stadium in Laurel, Maryland, close enough to Baltimore to cool outside interest in bringing in a new franchise.  This led to heated arguments between Cooke and Angelos, who accused Cooke of being a \"carpetbagger.\"  The league eventually persuaded Rams team president John Shaw to relocate to St. Louis instead, leading to a league-wide rumor that Tagliabue was again steering interest away from Baltimore, a claim which Tagliabue denied.  In response to anger in Baltimore, including Governor Schaefer's threat to announce over the loudspeakers Tagliabue's exact location in Camden Yards any time he attended a Baltimore Orioles game, Tagliabue remarked of Baltimore's financial package: \"Maybe (Baltimore) can open another museum with that money.\"  Following this, Angelos made an unsuccessful $200 million bid to bring the Tampa Bay Buccaneers to Baltimore.\n\nHaving failed to obtain a franchise via the expansion, the city, despite having \"misgivings,\" turned to the possibility of obtaining the Cleveland Browns, whose owner Art Modell was financially struggling and at odds with the city of Cleveland over needed improvements to the team's stadium.\n\nNew expansion team\n\nEnticed by Baltimore's available funds for a first-class stadium and a promised yearly operating subsidy of $25 million, Modell announced on November 6, 1995 his intention to relocate the team from Cleveland to Baltimore the following year.  The resulting controversy ended when representatives of Cleveland and the NFL reached a settlement on February 8, 1996. Tagliabue promised the city of Cleveland that an NFL team would be located in Cleveland, either through relocation or expansion, \"no later than 1999\". Additionally, the agreement stipulated that the Browns' name, colors, uniform design and franchise records would remain in Cleveland. The franchise history includes Browns club records and connections with Pro Football Hall of Fame players. Modell's Baltimore team, while retaining all current player contracts, would, for purposes of team history, appear as an expansion team, a new franchise.Morgan, Jon. [http://www.baltimoresun.com/sports/football/bal-modell020996,1,1050941.story \"Deal clears NFL path to Baltimore\"], The Baltimore Sun, February 9, 1996. Not all players, staff or front office would make the move to Baltimore, however.\n\nAfter relocation, Modell hired Ted Marchibroda as the head coach for his new team in Baltimore. Marchibroda was already well known because of his work as head coach of the Baltimore Colts during the 1970s and the Indianapolis Colts during the early 1990s. Ozzie Newsome, the Browns' tight end for many seasons, joined Modell in Baltimore as director of football operations. He was later promoted to vice-president/general manager.\n\nThe home stadium for the Ravens first two seasons was Baltimore's Memorial Stadium, home field of the Baltimore Colts and Baltimore Stallions years before. The Ravens moved to their own new stadium next to Camden Yards in 1998. Raven Stadium would subsequently wear the names PSI Net Stadium and then M&T Bank Stadium.\n\nThe early years and Ted Marchibroda era (1996–1998)\n\n1996\n\nIn the 1996 NFL Draft, the Ravens, with two picks in the first round, drafted offensive tackle Jonathan Ogden at No. 4 overall and linebacker Ray Lewis at No. 26 overall. Both Ogden and Lewis went on to play for the Ravens for their entire professional careers and were both inducted into the Pro Football Hall of Fame.\n\nThe 1996 Ravens won their opening game against the Oakland Raiders, but finished the season 4–12 despite receiver Michael Jackson leading the league with 14 touchdown catches.\n\n1997\n\nThe 1997 Ravens started 3–1. Peter Boulware, a rookie defender from Florida State, recorded 11.5 sacks and was named AFC Defensive Rookie of the Year. The team finished 6–9–1. On October 26, the team made its first trip to Landover, Maryland to play their new regional rivals, the Washington Redskins, for the first time in the regular season, at the new Jack Kent Cooke Stadium (replacing the still-standing RFK Stadium in Washington, D.C.). The Ravens won the game 20–17.\n\n1998\n\nQuarterback Vinny Testaverde left for the New York Jets before the 1998 season, and was replaced by former Indianapolis Colt Jim Harbaugh, and later Eric Zeier. Cornerback Rod Woodson joined the team after a successful stint with the Pittsburgh Steelers, and Priest Holmes started getting the first playing time of his career and ran for 1,000 yards.\n\nThe Ravens finished 1998 with a 6–10 record. On November 29, the Ravens welcomed the Colts back to Baltimore for the first time in 15 years. Amidst a shower of negative cheers towards the Colts, the Ravens, with Jim Harbaugh at quarterback, won 38–31.\n\nBrian Billick era and first Super Bowl victory (1999–2007)\n\n1999\n\nThree consecutive losing seasons under Marchibroda led to a change in the head coach. Brian Billick took over as head coach in 1999. Billick had been offensive coordinator for the record-setting Minnesota Vikings the season before. Quarterback Tony Banks came to Baltimore from the St. Louis Rams and had the best season of his career with 17 touchdown passes and an 81.2 pass rating. He was joined by receiver Qadry Ismail, who posted a 1,000-yard season. The Ravens initially struggled with a record of 4–7 but managed to finish with an 8–8 record.\n\nDue to continual financial hardships for the organization, the NFL took an unusual move and directed Modell to initiate the sale of his franchise. On March 27, 2000, NFL owners approved the sale of 49% of the Ravens to Steve Bisciotti. In the deal, Bisciotti had an option to purchase the remaining 51% for $325 million in 2004 from Art Modell. On April 9, 2004 the NFL approved Steve Bisciotti's purchase of the majority stake in the club.\n\n2000: Super Bowl XXXV champions\n\nBanks shared playing time in the 2000 regular season with Trent Dilfer. Both players put up decent numbers (and a 1,364-yard rushing season by rookie Jamal Lewis helped too) but the defense became the team's hallmark and bailed a struggling offense out in many instances through the season. Ray Lewis was named Defensive Player of the Year. Two of his defensive teammates, Sam Adams and Rod Woodson, made the Pro Bowl. Baltimore's season started strong with a 5–1 record. But the team struggled through mid-season, at one point going five games without scoring an offensive touchdown. The team regrouped and won each of their last seven games, finishing 12–4 and making the playoffs for the first time.\n\nDuring the 2000 season, the Ravens defense broke two notable NFL records. They held opposing teams to 165 total points, surpassing the 1985 Chicago Bears mark of 198 points for a 16-game season as well as surpassing the 1986 Chicago Bears mark of 187 points for a 16-game season, which at that time was the current NFL record.\n\nSince the divisional rival Tennessee Titans had a record of 13–3, the Ravens had to play in the wild card round. They dominated the Denver Broncos 21–3 in their first game. In the divisional playoff, they went on the road to Tennessee. With the score tied 10–10 in the fourth quarter, an Al Del Greco field goal attempt was blocked and returned for a touchdown by Anthony Mitchell, and a Ray Lewis interception return for a score put the game squarely in Baltimore's favor. The 24–10 win put the Ravens in the AFC Championship against the Oakland Raiders. The game was rarely in doubt. Shannon Sharpe's 96-yard touchdown catch early in the second quarter followed by an injury to Raiders quarterback Rich Gannon were crucial as the Ravens won easily, 16–3.\n\nBaltimore then went to Tampa for Super Bowl XXXV against the New York Giants. The game was also dominated by the Ravens. They recorded four sacks and forced five turnovers, one of which was a Kerry Collins interception returned for a touchdown by Duane Starks. The Giants' only score was a Ron Dixon kickoff return for another touchdown; however, the Ravens immediately countered with a return by Jermaine Lewis. The Ravens became champions with a 34–7 win, becoming only the third wild card team to win a Super Bowl championship.\n\n2001\n\nIn 2001, the Ravens attempted to defend their title with Elvis Grbac as their new starting quarterback, but a season-ending injury to Jamal Lewis on the first day of training camp and poor offensive performances stymied the team. After a 3–3 start, the Ravens defeated the Minnesota Vikings in the final week to clinch a wild card berth at 10–6. In the first round the Ravens showed flashes of their previous year with a 20–3 win over the Miami Dolphins, in which the team forced three turnovers and out-gained the Dolphins 347 yards to 151. In the divisional playoff the Ravens played the Pittsburgh Steelers. Three interceptions by Grbac ended the Ravens' season, as they lost 27–10.\n\n2002\n\nBaltimore ran into salary cap problems entering the 2002 season and was forced to part with a number of impact players. In the NFL Draft, the team selected Ed Reed with the 24th overall pick. Reed would go on to become one of the best safeties in NFL history, making nine Pro Bowls until leaving the Ravens for the Houston Texans in 2013. Despite low expectations, the Ravens stayed somewhat competitive in 2002 until a losing streak in December eliminated any chances of a post-season berth. Their final record that year was 7–9.\n\n2003\n\nIn 2003, the Ravens drafted their new quarterback, Kyle Boller, but he was injured midway through the season and was replaced by Anthony Wright. Jamal Lewis ran for 2,066 yards (including a record 295 yards in one game against the Cleveland Browns on September 14). With a 10–6 record, Baltimore won their first AFC North division title. Their first playoff game, at home against the Tennessee Titans, went back and forth, with the Ravens being held to only 54 yards total rushing. The Titans won 20–17 on a late field goal, and Baltimore's season ended early.\n\nRay Lewis was also named Defensive Player of the year for the second time in his career.\n\nIn April 2003, Art Modell sold 49% of the team to Steve Bisciotti, a local businessman who had made his fortune in the temporary staffing field. After the season, Art Modell sold his remaining 51% ownership to Bisciotti, ending over 40 years of tenure as an NFL franchise owner.\n\n2004\n\nThe Ravens did not make the playoffs in 2004 and finished the season with a record of 9–7 with Kyle Boller spending the season at QB. They did get good play from veteran corner Deion Sanders and third year safety Ed Reed, who won the NFL Defensive Player of the Year award. They were also the only team to defeat the 15–1 Pittsburgh Steelers in the regular season.\n\n2005\n\nIn the 2005 offseason the Ravens looked to augment their receiving corps (which was second-worst in the NFL in 2004) by signing Derrick Mason from the Titans and drafting star Oklahoma wide receiver Mark Clayton in the first round of the 2005 NFL Draft. However, the Ravens ended their season 6–10, but defeated the Green Bay Packers 48–3 on Monday Night Football and the Super Bowl champion Steelers.\n\n2006\n\nThe 2006 Baltimore Ravens season began with the team trying to improve on their 6–10 record of 2005. The Ravens, for the first time in franchise history, started 4–0, under the leadership of former Titans quarterback Steve McNair.\n\nThe Ravens lost two straight games mid-season on offensive troubles, prompting coach Billick to drop their offensive coordinator Jim Fassel in their week seven bye. After the bye, and with Billick calling the offense, Baltimore would record a five-game win streak before losing to the Cincinnati Bengals in week 13.\n\nStill ranked second overall to first-place San Diego Chargers, the Ravens continued on. They defeated the Kansas City Chiefs, and held the defending Super Bowl champion Pittsburgh Steelers to only one touchdown at Heinz Field, allowing the Ravens to clinch the AFC North.\n\nThe Ravens ended the regular season with a franchise-best 13–3 record. Baltimore had secured the AFC North title, the No. 2 AFC playoff seed, and clinched a 1st-round bye by season's end. The Ravens were slated to face the Indianapolis Colts in the second round of the playoffs, in the first meeting of the two teams in the playoffs. Many Baltimore and Indianapolis fans saw this historic meeting as a sort of \"Judgment Day\" with the new team of Baltimore facing the old team of Baltimore (the former Baltimore Colts having left Baltimore under questionable circumstances in 1984). Both Indianapolis and Baltimore were held to scoring only field goals as the two defenses slugged it out all over M&T Bank Stadium. McNair threw two costly interceptions, including one at the 1-yard line. The eventual Super Bowl champion Colts won 15–6, ending Baltimore's season.\n\n2007\n\nAfter a stellar 2006 season, the Ravens hoped to improve upon their 13–3 record but injuries and poor play plagued the team. The Ravens finished the 2007 season in the AFC North cellar with a disappointing 5–11 record. A humiliating 22–16 overtime loss to the previously winless Miami Dolphins on December 16 ultimately led to Billick's dismissal on New Year's Eve, one day after the end of the regular season. He was replaced by John Harbaugh, the special teams coach of the Philadelphia Eagles and the older brother of former Ravens quarterback Jim Harbaugh (1998).\n\nJohn Harbaugh/Joe Flacco era; second Super Bowl (2008–present)\n\n2008: Arrival of John Harbaugh, Flacco, and Ray Rice\n\nWith rookies at head coach (John Harbaugh) and quarterback (Joe Flacco), the Ravens entered the 2008 campaign with lots of uncertainty. Baltimore smartly recovered in 2008, winning eleven games and achieving a wild card spot in the postseason. On the strength of four interceptions, one resulting in an Ed Reed touchdown, the Ravens began its postseason run by winning a rematch over Miami 27–9 at Dolphin Stadium on January 4, 2009 in a wild-card game.[http://sports.espn.go.com/nfl/recap?gameId290104015&campaign\nrss&sourceESPNHeadlines \"Pennington throws four interceptions in loss,\" The Associated Press, Sunday, January 4, 2009.] Six days later, they advanced to the AFC Championship Game by avenging a Week 5 loss to the Titans 13–10 at LP Field on a Matt Stover field goal with 53 seconds left in regulation time.[http://sports.espn.go.com/nfl/recap?gameId\n290110010&campaignrss&source\nESPNHeadlines] \"Stover's FG with 53 seconds left boots Ravens into AFC Championship Game\". The Ravens fell one victory short of Super Bowl XLIII by losing to the Steelers 23–14 at Heinz Field on January 18, 2009.[http://sports.espn.go.com/nfl/recap?gameId=290118023 \"Polamalu's INT return secures Steelers' Super Bowl berth,\" The Associated Press, Sunday, January 18, 2009.]\n\n2009\n\nIn 2009, the Ravens won their first three matches, then lost the next three, including a close match in Minnesota. The rest of the season was an uneven string of wins and losses, which included a home victory over Pittsburgh in overtime followed by a Monday Night loss in Green Bay. That game was notable for the huge number of penalties committed, costing a total of 310 yards, and almost tying with the record set by Tampa Bay and Seattle in 1976. Afterwards, the Ravens easily crushed the Lions and Bears, giving up less than ten points in both games. The next match was against the Steelers, where Baltimore lost a close one before beating the Raiders to end the season. With a record of 9–7, the team finished second in the division and gained another wild card. Moving into the playoffs, they overwhelmed the Patriots; nevertheless they did not reach the AFC Championship because they were routed 20–3 by the Colts in the divisional round a week later.\n\n2010\n\nBaltimore managed to beat the Jets 10–9 on the 2010 opener, but then lost a poorly-played game against Cincinnati the following week. The Ravens rebounded against the other two division teams, beating Cleveland 24–17 in Week 3 and then Pittsburgh 17–14 in Week 4. The Ravens scored a fine win (31–17) at home against Denver in Week 5. After an overtime loss to New England, they narrowly avoided losing at home to the winless Bills. Next, the Ravens hosted Miami and won 26–10, breaking that team's 4–0 road streak. On Thursday Night, the team headed to Atlanta and lost 26–21 in a game that had some criticizing the officiating. The Ravens finished the season 12–4, second in the division due to a tiebreaker with Pittsburgh, and earning a wild card spot. Baltimore headed to Kansas City and crushed the unprepared Chiefs 34–7, but once again were knocked from the playoffs by Pittsburgh in a hard-fought battle.\n\n2011\n\nThe Ravens hosted their arch-enemy in Week 1 of the 2011 season. On a hot, humid day in M&T Bank Stadium, crowd noise and multiple Steelers mistakes allowed Baltimore to crush them with three touchdowns 35–7. The frustrated Pittsburgh players also committed several costly penalties. Thus, the Ravens had gained their first ever victory over the Steelers with Ben Roethlisberger playing and avenged themselves of repeated regular and postseason losses in the series.\n\nBut in Week 2, the Ravens collapsed in Tennessee and lost 26–13. They rebounded by routing the Rams in Week 3 and then overpowering the Jets 34–17 in Week 4.\nWeek 5, the Ravens had a bye week, following a game against the Texans. But in Week 7, Baltimore had a stunning MNF upset loss in Jacksonville as they were held to one touchdown in a 12–7 loss. Their final scoring drive failed as Joe Flacco threw an interception in the closing seconds of the game.\n\nAfter beating the Cincinnati Bengals in Week 17 of the regular season, the Ravens advanced to the playoffs as the Number 2 seed in the AFC with a record of 12-4.  They gained the distinction of AFC North Champions over Pittsburgh (12-4) due to a tie breaker.\n\nRavens' Lee Evans was stripped of a 14-yard touchdown pass by the Patriots Sterling Moore with 22 seconds left and Ravens kicker Billy Cundiff pushed a 32-yard field goal attempt wide left on fourth down as the Patriots held on to beat the Ravens 23-20 during the AFC championship game and advance to Super Bowl XLVI.\n\n2012: Ray Lewis' final season and 2nd Super Bowl\n\nThe Ravens' attempt to convert Joe Flacco into a pocket passer remained a work in progress as the 2012 season began. Terrell Suggs suffered a tendon injury during an off-season basketball game and was unable to play for at least several weeks. In the opener on September 10, Baltimore routed Cincinnati 44-13. After this easy win, the team headed to Philadelphia. The Eagles had struggled during their Week 1 match in Cleveland and were not expected to win, but a bizarre game ensued thanks to the NFL facing another lockout mess, this one involving the league's referees, who were replaced by ex-college officials. The replacement officials were widely criticized throughout the league.  This game featured multiple questionable calls that went against the Ravens, perhaps costing them the game 24-23.\n\nReturning home for a primetime rematch of the AFC Championship, another bizarre game ensued. New England picked apart the Baltimore defense (which was considerably weakened without Terrell Suggs and some other players lost over the off-season) for the first half. Trouble began early in the game when a streaker ran out onto the field and had to be tackled by security, and accelerated when, at 2:18 in the 4th quarter, the referees made a holding call on RG Marshal Yanda. Enraged fans repeatedly chanted an obscenity at this penalty. The Ravens finally drove downfield and on the last play of the game, Justin Tucker kicked a 27-yard field goal to win the game 31-30, capping off a second intense and controversially-officiated game in a row for the Ravens.\n\nThe Ravens would win the AFC North with a 10-6 record, but finished 4th in the AFC playoff seeding, and thus had to play a wild-card game. After defeating the Indianapolis Colts 24-9 at home (the final home game of Ray Lewis), the Ravens traveled to Denver to play against the top seeded Broncos. In a very back-and-forth contest, the Ravens pulled out a 38-35 victory in double overtime. They then won their 2nd AFC championship by coming back from a 13-7 halftime deficit to defeat the New England Patriots once again, 28-13.\n\nThe Ravens played the Super Bowl XLVII on February 3, 2013, against the San Francisco 49ers. Baltimore built a 28–6 lead early in the third quarter before a partial power outage in the Superdome suspended play for 34 minutes (earning the game the added nickname of the Blackout Bowl). After play resumed, San Francisco scored 17 unanswered third-quarter points to cut the Ravens' lead, 28–23, and continued to chip away in the fourth quarter. With the Ravens leading late in the game, 34–29, the 49ers advanced to the Baltimore 7-yard line just before the two-minute warning but turned the ball over on downs. The Ravens then took an intentional safety in the waning moments of the game to preserve the victory. Baltimore quarterback Joe Flacco, who completed 22 of 33 passes for 287 yards and three touchdowns, was named Super Bowl MVP.\n\n2013\n\nComing off as the defending Super Bowl champions, this was the first year in franchise history for the team without Ray Lewis. The Ravens started out 3-2, and started the 2-0 Houston Texans 14-loss streak by shutting them 30-9 in Week 3. However, the Ravens lost their next 3 games, losing to the Green Bay Packers and Pittsburgh Steelers in last-minute field goals and were shut out in an attempt to tie the game against the Cleveland Browns 18-24.\n\nAfter winning and losing their next game, the Baltimore Ravens came out 4-6, but managed winning their next four games in dominating the Jets 19-3 in Baltimore, a Steelers win 20-22 during Thanksgiving, a booming ending in Baltimore against the Vikings 29-26, and a 18-16 win at Detroit, including Justin Tucker's 61-yard game-winning field goal. The Ravens were 8-6, with the 6th seed, but after losing their next two games, and the San Diego Chargers winning their next two to clinch the 6th seed, the Ravens finished 8-8 and missed the playoffs for the first time since 2007.\n\n2014\n\nOn January 27, 2014, the Ravens hired former Houston Texans head coach Gary Kubiak to be their new offensive coordinator after Jim Caldwell accepted the new available head coaching job with the Detroit Lions. On February 15, 2014, star running back Ray Rice and his fiancée Janay Palmer were arrested and charged with assault after a physical altercation at Revel Casino in Atlantic City, New Jersey. Celebrity news website TMZ posted a video of Rice dragging Palmer's body out of an elevator after apparently knocking her out. For the incident, Rice was initially suspended for the first two games of the 2014 NFL season on July 25, 2014, which led to widespread criticism of the NFL.\n\nIn Week 1, on September 7, the Baltimore Ravens lost to the Cincinnati Bengals, 23-16. The next day, on September 8, 2014, TMZ released additional footage from an elevator camera showing Rice punching Palmer. The Baltimore Ravens terminated Rice's contract as a result, and was later indefinitely suspended by the NFL. Although starting out 0-1 for two straight seasons and having received unwanted media attention for the Ray Rice incident, on September 11, 2014, the Ravens rallied back and beat the Pittsburgh Steelers 26-6, to improve to 1-1. In Week 12, the Ravens traveled down for an interconference battle with the New Orleans Saints, which the Ravens won 34-27, reaching a 4-0 sweep of the NFC south. In Week 16, the Ravens traveled to Houston to take on the Texans. In one of Joe Flacco's worst performances, the offense sputtered against the Houston defense and Flacco threw three interceptions, falling to the Texans 25-13. With their playoff chances and season hanging in the balance, the Ravens took on the Browns in Week 17 at home. After three quarters had gone by and down 10-3, Joe Flacco led the Ravens on a comeback scoring 17 unanswered points, winning 20-10. With the win, and the Kansas City Chiefs defeating the San Diego Chargers, the Ravens clinched their sixth playoff berth in seven seasons, and the first since winning Super Bowl XLVII.\n\nIn the wildcard playoff game, the Ravens won 30-17 against their divisional rivals, the Pittsburgh Steelers, at Heinz Field. In the next game in the Divisional round, the Ravens faced the New England Patriots. Despite a strong offensive effort and having a 14-point lead twice in the game, the Ravens were defeated by the Patriots 35-31, ending their season.\n\n2015\n\nThe 2015 season marked 20 seasons of the franchise's existence, competing in the NFL which the franchise have recognized with a special badge being worn on their uniforms during the 2015 NFL season.\nAfter coming up just short against the Patriots in the playoffs, the Ravens were picked by some to win the AFC and even the Super Bowl.  However, they lost key players such as Joe Flacco, Justin Forsett, Terrell Suggs, Steve Smith Sr., and Eugene Monroe to season-ending injuries.  Injuries and their inability to win close games early in the season led to the first losing season in the John Harbaugh-Flacco era.\n\n2016\n\nThe 2016 Ravens improved on their 5–11 record from 2015, finishing 8–8, but failed to qualify the playoffs for the second straight year. They were eliminated from playoff contention after their Week 16 loss to their division rivals, the Steelers. This was the first time the Ravens missed the playoffs in consecutive seasons since 2004–2005, as well as the first in the Harbaugh/Flacco era.\n\n2017\n\nThe Ravens improved upon their 8-8 record in 2016 by one win, finishing the season 9-7 and missing the playoffs for the third year in a row. This marked the first time the Ravens failed to make the playoffs in three straight seasons since the team's first three years of existence (1996-1998). The Ravens suffered a heartbreaking loss at home to the Cincinnati Bengals in the final game of the season that prevented them from earning a playoff berth.\n\nRivalries\n\nPittsburgh Steelers\n\nBy far the team's biggest rival is the Pittsburgh Steelers. Pittsburgh and Baltimore are separated by a less-than-5-hour drive along Interstate 70. Both teams are known for their hard-hitting physical style of play. They play twice a year in the AFC North, and have met four times in the playoffs. Games between these two teams usually come down to the wire as most within the last 5 years have come down to 3 points or less.\nThe rivalry is considered one of the most significant and intense in the NFL today.\n\nIndianapolis Colts\n\nAlthough the Steelers rivalry is based on mutual respect and antagonism for each other, the Ravens' rivalry with the Indianapolis Colts is fueled by the fans' animosity towards the organization, not contention between the players. This is due to the fact that the then-Colts owner, Robert Irsay, under the threat of eminent domain from the city of Baltimore, was forced to sneak the Colts out of Baltimore in the middle of the night to take them to Indianapolis. During Ravens home games the scoreboard lists the away team simply as \"Away\" or \"Indy\" rather than the team name that is traditionally used for the visiting opponent. The PA announcer will also refer to the Colts as the Indianapolis Professional Football Team; although on January 6, 2013 the scoreboard at the playoff game between the Baltimore Ravens and Indianapolis Colts at M&T Bank Stadium listed the away team as \"Colts\". The Indianapolis Colts hold an all-time 9–4 advantage over the Baltimore Ravens, including a 2–1 advantage in the playoffs.\n\nOther AFC North  rivals\n\nThe Ravens also have divisional rivalries with the Cleveland Browns and Cincinnati Bengals.\n\nThe reactivated Cleveland Browns and their fans maintain a hatred of Baltimore's team due to its move from Cleveland. The rivalry with the Browns has been very one-sided; Baltimore holds an advantage of 27-9 against Cleveland.\n\nThe rivalry with Cincinnati has been closer, with the Ravens leading the all-time series 22-21 as of Week 3 of the 2017 NFL Season.\n\nNew England Patriots\n\nThe Ravens first met the New England Patriots in 1996, but the rivalry truly started in 2007 when the Ravens suffered a bitter 27–24 loss in the Patriots quest for perfection. The rivalry began to escalate in 2009 when the Patriots beat the Ravens 27–21 in a game that involved a confrontation between Patriots quarterback Tom Brady and Ravens linebacker Terrell Suggs. Both players would go on to take verbal shots at each other through the media after the game.  The Ravens faced the Patriots in a 2009 AFC wild card playoff game and won 33–14; the Ravens ran the ball for more than 250 yards.\n\nThe Ravens faced the Patriots in Week 6 of the 2010 season; the Ravens ended up losing 23–20 in overtime; the game caused controversy due to a hit to the helmet of tight end Todd Heap by Patriots safety Brandon Meriweather.Ryan Hudson, [http://boston.sbnation.com/new-england-patriots/2010/10/19/1761235/brandon-meriweather-shit-todd-heap-nfl-helmet-concussion Brandon Meriweather Says Hit On Todd Heap Was 'Split-Second Decision'], SB Nation. Retrieved October 28, 2012.\n\nThe Ravens played the Patriots for the third consecutive season, in the 2011 AFC championship game in which the Ravens lost 23–20.  The rivalry reached a new level of friction with this, the second career playoff game between the two clubs.  The Ravens clawed to a 20–16 lead in the fourth quarter but Patriots quarterback Tom Brady dove into the end zone to make the score 23–20 with around 11 minutes remaining; this proved to be the winning touchdown. On the Ravens last possession of the game, quarterback Joe Flacco threw a pass to wide receiver Lee Evans in the corner of the end zone which looked to be the game-winning touchdown, before a last second strip by Sterling Moore forced the ball from the hands of Evans, forcing the game to be decided on a last-minute field goal by Ravens placekicker Billy Cundiff. With eleven seconds remaining on the clock, the kicker missed the 32-yard field goal attempt by a very wide margin, allowing the Patriots to kill the clock on their way to Super Bowl XLVI.\n\nThe Ravens' first regular-season win over the Patriots came on September 23, 2012.  The game was emotional as receiver Torrey Smith was competing following the death of his brother in a motorcycle accident just the night before. Smith caught two touchdowns in a back and forth game; the Ravens erased a 13–0 deficit in the first half and led 14–13, but the Patriots scored at the end of the second quarter for a 20–14 lead. The lead changed twice in the third quarter and the Patriots led 30–21 in the fourth, but the Ravens scored on Smith's second touchdown catch. The Ravens were stopped on fourth down but the Patriots had to punt; in the final two minutes a pass interference penalty on Devin McCourty put the ball at the Patriots 7-yard line; new Ravens kicker Justin Tucker booted a 27-yard field goal on the final play; the ball sailed directly over the upright and was ruled good; the quality of officiating by replacement referees caused controversy as Bill Belichick angrily reached for one of the referees as they were leaving the field, leading to a $50,000 fine later that week.\n\nThe two teams met again on January 20, 2013 in the AFC Championship, where the Ravens won 28–13. The Patriots led at halftime, 13–7, but the Ravens' defense gave up no points in the second half. It was the first time ever that Tom Brady lost a game at home after leading at halftime, and the first time a road team beat the Patriots in the AFC Championship.\n\nOn December 22, 2013 the teams met again, this rematch of the AFC championship game was a mismatch from the outset. New England took a 17-0 lead early in the second quarter and never let up behind a defense that forced four turnovers and had four sacks. New England would go on to win the game 41-7.\n\nOn January 10, 2015, the two teams would meet in the Divisional Round of the playoffs. Unlike the previous meeting, the Ravens put up a strong offensive performance, leading by 14 points twice in the game. However, Tom Brady would bring the Patriots back by attacking the Ravens vulnerable secondary and taking a 35-31 lead late in the 4th quarter. Joe Flacco would drive to the Patriots side of the field with under two minutes to play in regulation. However, a key interception by Flacco due to a misplay on the ball by Torrey Smith essentially sealed the game in the Patriots favor to send them to the AFC Championship.\n\nLogo controversy\n\nThe team's first helmet logo, used from 1996 through 1998, featured raven wings outspread from a shield displaying a letter B framed by the word Ravens overhead and a cross bottony underneath. The US Fourth Circuit Court of Appeals affirmed a jury verdict that the logo infringed on a copyright retained by Frederick E. Bouchat, an amateur artist and security guard in Maryland, but that he was entitled to only three dollars in damages from the NFL.\n\nBouchat had submitted his design to the Maryland Stadium Authority by fax after learning that Baltimore was to acquire an NFL team. He was not credited for the design when the logo was announced. Bouchat sued the team, claiming to be the designer of the emblem; representatives of the team asserted that the image had been designed independently. The court ruled in favor of Bouchat, noting that team owner Modell had access to Bouchat's work. Bouchat's fax had gone to John Moag, the Maryland Stadium Authority chairman, whose office was located in the same building as Modell's. Bouchat ultimately was not awarded monetary compensation in the damages phase of the case.Bouchat v. Balt. Ravens Football Club, 346 F.3d 514, 519 (4th Cir. 2003), cert. denied 541 U.S. 1042 (2004) (\"The damages trial was conducted over a period of six days, from July 17 to 24, 2002. On July 23, 2002, at the close of the evidence, the jury was asked to decide whether the Defendants had proven, by a preponderance of the evidence, that the Non-Excluded Merchandise Revenues were attributable entirely to factors other than the Defendants' infringement of Bouchat's copyright. If the jury found that they were not, then it was charged to decide the percentage of the Non-Excluded Merchandise Revenues attributable to factors other than the infringement. After a full day of deliberations, the jury answered the first question in the affirmative, thereby denying Bouchat any monetary recovery.\")\n\nThe Baltimore Sun ran a poll showing three designs for new helmet logos. Fans participating in the poll expressed a preference for a raven's head in profile over other designs. Art Modell announced that he would honor this preference but still wanted a letter B to appear somewhere in the design. The new Ravens logo featured a raven's head in profile with the letter superimposed. The secondary logo is a shield that honors Baltimore's history of heraldry. Alternating Calvert and Crossland emblems (seen also in the flag of Maryland and the flag of Baltimore) are interlocked with stylized letters B and R.\n\nUniforms\n\nThe design of the Ravens uniform has remained essentially unchanged since the team's inaugural season in 1996. Art Modell admitted to ESPN's Roy Firestone that the Ravens' colors, introduced in early 1996, were inspired by the Northwestern Wildcats 1995 dream season. Helmets are black with purple \"talon\" stripes rising from the facemask to the crown. Players normally wear purple jerseys at home and white jerseys on the road. In 1996 the team wore black pants with a single large white stripe for all games. At home games the combination of black pants with purple jersey made the Ravens the first NFL team to wear dark colors head to calf. A number of NFL teams have since donned the look, beginning with the all-black home uniform worn in three games by the 2001 New Orleans Saints.\n\nIn 1997 the Ravens opted for a more classic NFL look with white pants sporting stripes in purple and black, along with the jerseys sporting a different font for the uniform numbers. The white pants were worn with both home and road jerseys. The road uniform (white pants with white jerseys) was worn by the Ravens in Super Bowl XXXV, at the end of the 2000 NFL season.\n\nIn the 2002 season the Ravens began the practice of wearing white jerseys for the home opener and, occasionally, other early games in the season that have a 1:00 kickoff. Since John Harbaugh became the head coach in 2008, the Ravens have also worn their white jerseys at home for preseason games.\n\nIn November 2004 the team introduced an alternate uniform design featuring black jerseys and solid black pants with black socks. The all-black uniform was first worn for a home game against the Cleveland Browns, entitled \"Pitch Black\" night, that resulted in a Ravens win. The uniform has since been worn for select prime-time national game broadcasts and other games of significance.\n\nThe Ravens began wearing black pants again with the white jersey in 2008. On December 7, 2008, during a Sunday Night Football game against the Washington Redskins, the Ravens introduced a new combination of black jersey with white pants. It was believed to be due to the fact that John Harbaugh doesn't like the \"blackout\" look. However, on December 19, 2010, the Ravens wore their black jerseys and black pants in a 30–24 victory over the New Orleans Saints.\n\nOn December 5, 2010, the Ravens reverted to the black pants with the purple jerseys versus the Pittsburgh Steelers during NBC's Sunday Night Football telecast.  The Ravens lost to the Steelers 13–10. They wore the same look again for their game against the Cleveland Browns on December 24, 2011, and they won, 20–14. They wore this combination a third time against the Houston Texans on January 15, 2012 in the AFC Divisional playoff. They won 20–13. They would again wear this combination on January 6, 2013, during the AFC Wild Card playoff and what turned out to be Ray Lewis' final home game, where they defeated the Indianapolis Colts 24-9.\n\nFrom their inaugural season until 2006, the Ravens wore white cleats with their uniforms; they switched to black cleats in 2007.\n\nOn December 20, 2015, the team unexpectedly debuted gold pants for the first time, wearing them with their regular purple jerseys against the Kansas City Chiefs. Although gold is an official accent color of the Ravens, the pants got an overwhelmingly negative response on social media by both Ravens fans and fans of other NFL teams, with some comparisons being made to the rival Pittsburgh Steelers' pants, and mustard.\n\nMarching band\n\nThe team marching band is called Baltimore's Marching Ravens. They began as the Colts' marching band and have operated continuously from September 7, 1947 to the present. They helped campaign for football to return to Baltimore after the Colts moved. Because they stayed in Baltimore after the Colts left, the band is nicknamed \"the band that would not die\" and were the subject of an episode of ESPN's 30 for 30. The Washington Redskins are the only other NFL team that currently has a marching band.\n\nPlayers of note\n\nCurrent roster\n\n| style=\"text-align:center;\"|Note: The following lists players who officially played for the Ravens. For other Hall of Famers, players whose numbers were retired, and players who played for the Baltimore Colts, see Indianapolis Colts. Bold number notes player inducted as a Raven. For Cleveland Browns players, including those in the Hall of Fame and those whose numbers were retired, see Cleveland Browns\n|}\n\nPro Football Hall of Fame\n\nRetired numbers\n\nThe Ravens do not officially have retired numbers. However, the number 19 is not issued out of respect for Baltimore Colts quarterback Johnny Unitas, except for quarterback Scott Mitchell in his lone season in Baltimore in 1999. In addition, numbers 75, 52, and 20, in honor of Jonathan Ogden, Ray Lewis, and Ed Reed respectively, have not been issued since those players' retirements from football. The number 3 has been in very limited circulation (offseason only) in respect to former kicker Matt Stover.\n\nRing of Honor\n\nThe Ravens have a \"Ring of Honor\" which is on permanent display encircling the field of M&T Bank Stadium. The ring currently honors the following, including 8 former members of the Baltimore Colts. Bold Numbers are those whose numbers have not been issued or reissued after a player's time in Baltimore:\n\nKey/Legend\n\nFirst round draft picks\n\nThe Baltimore Ravens had their first draft in 1996, where they selected offensive lineman from UCLA and current NFL Hall of Famer, and 11-time Pro-Bowler Jonathan Ogden. Along with their pick in the next year's draft, this was the highest first-round draft pick that the Ravens have had. They also selected Ray Lewis with the 26th pick. In both 1996 and 2000, the Ravens had two first-round draft picks. However, in 2004 they had none. In their history, the Ravens have drafted 4 offensive linemen, 3 linebackers, 2 wide receivers, 2 cornerbacks, 2 quarterbacks, a running back, tight end, safety, and defensive tackle. The Ravens have 56 combined Pro-Bowl appearances from their first-round draft picks.\n\nTeam records\n\nPassing \n\n+ min. 500 attempts, # \n min. 100 attempts, ∗ = minimum 15 attempts,\n\nRushing \n\n∗ minimum 15 attempts, # \n min. 100 attempts, + = min. 500 attempts\n\nReceiving \n\n∗ minimum 4 receptions, # \n min. 20 receptions, + = min. 200 receptions\n\nOther \n\nReturns \n\nKicking \n\nDefense \n\nExceptional Performances \n\nOther Career Records \n\n*Most Tackles: Ray Lewis, 1,573 (1996–2012)\n*Most Forced Fumbles: Terrell Suggs, 28 (2003–present)\n*Longest Field Goal Made: Justin Tucker, 61 yards (2012–present)\n\nAll records as of February 9, 2017 per Pro-Football Reference.com\n\nHead coaches\n\nCurrent staff\n\nBroadcast media\n\nThe Ravens' flagship radio stations are WIYY (98 Rock) and WBAL 1090 AM, with Gerry Sandusky (WBAL-TV Sports Anchor since 1988) as the play-by-play announcer and analysts Stan White (Baltimore Colts LB 1972–1979) and Qadry Ismail (Baltimore Ravens WR 1999–2001).\n\nThe team's flagship station is WBAL-TV, which broadcasts pre-season games and team programming throughout the season. The programming is syndicated to WJLA-TV in Washington, WGAL in the Harrisburg–Lebanon–York–Lancaster, Pennsylvania market, and until 2017, was carried through the remainder of the team's region by CSN Mid-Atlantic. In January 2017, the Ravens announced that it had cut ties with CSN Mid-Atlantic, as the network was cutting back on its day-to-day coverage of other teams in the region in order to focus more extensively on the Washington Capitals and Wizards—whose games are broadcast by CSN Mid-Atlantic, and whose owner holds a stake in the network. The team announced that it would seek a new partner; until 2010, these rights were held by MASN.\n\nRavens regular season games are typically broadcast by WJZ-TV as part of CBS's rights to the AFC, but games may occasionally be broadcast on WBAL (Sunday Night Football and simulcasts of games on cable) or WBFF-TV.\n\nRadio. Baltimore Ravens. http://en.wikipedia.org/?curid=4293."
  }
}
