{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18434",
  "eid" : "32e5d6e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778594638,
  "textBody" : "Huddie William Ledbetter (January 20, 1888 – December 6, 1949) was an American folk and blues musician notable for his strong vocals, virtuosity on the twelve-string guitar, and the folk standards he introduced. He is best known as Lead Belly. Though many releases credit him as \"Leadbelly\", he himself wrote it as \"Lead Belly\", which is also the spelling on his tombstone and the spelling used by the Lead Belly Foundation.\n\nLead Belly usually played a twelve-string guitar, but he also played the piano, mandolin, harmonica, violin, and \"windjammer\" (diatonic accordion). In some of his recordings he sang while clapping his hands or stomping his foot.\n\nLead Belly's songs covered a wide range, including gospel music; blues about women, liquor, prison life, and racism; and folk songs about cowboys, prison, work, sailors, cattle herding, and dancing. He also wrote songs about people in the news, such as Franklin D. Roosevelt, Adolf Hitler, Jean Harlow, Jack Johnson, the Scottsboro Boys and Howard Hughes.\n\nLead Belly was inducted into the Rock and Roll Hall of Fame in 1988 and the Louisiana Music Hall of Fame in 2008.\n\nBiography\n\nEarly life \n\nLead Belly was born Huddie William Ledbetter on the Jeter Plantation near Mooringsport, Louisiana, on January 20, 1888 or 1889 (generally accepted to be the former). The 1900 United States Census lists \"Hudy Ledbetter\" as 12 years old, born January 1888, and the 1910 and 1930 censuses also give his age as corresponding to a birth in 1888. The 1940 census lists his age as 51, with information supplied by wife Martha. However, in April 1942, when Ledbetter filled out his World War II draft registration, he gave his birth date as January 23, 1889, and his birthplace as Freeport, Louisiana (\"Shreveport\"). His grave marker bears the date given on his draft registration.\n \nLedbetter was the younger of two children born to Wesley Ledbetter and Sallie Brown. The pronunciation of his name is purported to be \"HYEW-dee\" or \"HUGH-dee.\" He can be heard pronouncing his name as \"HUH-dee\" on the track \"Boll Weevil,\" from the Smithsonian Folkways album Lead Belly Sings for Children. His parents had cohabited for several years, but they legally married on February 26, 1888. When Huddie was five years old, the family settled in Bowie County, Texas.\n\nBy 1903, Huddie was already a \"musicianer\", a singer and guitarist of some note. He performed for nearby Shreveport audiences in St. Paul's Bottoms, a notorious red-light district there. He began to develop his own style of music after exposure to various musical influences on Shreveport's Fannin Street, a row of saloons, brothels, and dance halls in the Bottoms, now referred to as Ledbetter Heights.\n\nThe 1910 census of Harrison County, Texas, shows \"Hudy\" Ledbetter living next door to his parents with his first wife, Aletha \"Lethe\" Henderson. Aletha is registered as age 19 and married one year. Others say she was 15 when they married in 1908. It was in Texas that Ledbetter received his first instrument, an accordion from his uncle Terrell. By his early twenties, having fathered at least two children, Ledbetter left home to make his living as a guitarist and occasional laborer.\n\nInfluenced by the sinking of the Titanic in April 1912, Ledbetter wrote the song \"The Titanic\", his first composed on the twelve-string guitar, which later became his signature instrument. Initially played when performing with Blind Lemon Jefferson (1897–1929) in and around Dallas, Texas, the song is about champion African-American boxer Jack Johnson's being denied passage on the Titanic. Johnson had in fact been denied passage on a ship for being black, but it was not the Titanic. Still, the song includes the lyric \"Jack Johnson tried to get on board. The Captain, he says, 'I ain't haulin' no coal!' Fare thee, Titanic! Fare thee well!\" Ledbetter later noted he had to leave out this passage when playing in front of white audiences.Lead Belly's Last Sessions, disc 2, track 15, \"The Titanic\". Smithsonian Folkways.\n\nPrison years\n\n In 1915, he was convicted of carrying a pistol and sentenced to time on the Harrison County chain gang.  He escaped, finding work in nearby Bowie County under the assumed name of Walter Boyd.  In January 1918 he was imprisoned at the Imperial Farm (now Central Unit)Perkinson, Robert (2010). Texas Tough: The Rise of America's Prison Empire. Metropolitan Books. [https://books.google.com/books?id\nHOxmcfIopugC&pgPA184&lpg\nPA184&dqLead+Belly+%22Imperial+Farm%22#v\nonepage&qLead%20Belly%20%22Imperial%20Farm%22&f\nfalse 184]. . in Sugar Land, Texas, after killing one of his relatives, Will Stafford, in a fight over a woman.  While there he may have first heard the traditional prison song \"Midnight Special\".Lomax, Alan, ed. Folk Song USA. New American Library. In 1925 he was pardoned and released after writing a song to Governor Pat Morris Neff seeking his freedom, having served the minimum seven years of a 7-to-35-year sentence. Combined with his good behavior, which included entertaining the guards and fellow prisoners, his appeal to Neff's strong religious beliefs proved sufficient. It was a testament to his persuasive powers, as Neff had run for governor on a pledge not to issue pardons (the only recourse for prisoners, since in most Southern prisons there was no provision for parole). According to Charles K. Wolfe and Kip Lornell in their book The Life and Legend of Leadbelly (1999), Neff had regularly brought guests to the prison on Sunday picnics to hear Ledbetter perform.\n\nIn 1930, Ledbetter was sentenced to Louisiana's Angola Prison Farm after a summary trial for attempted homicide for stabbing a white man in a fight. He was \"discovered\" there three years later during a visit by folklorists John Lomax and his son Alan Lomax.\n\nDeeply impressed by Ledbetter's vibrant tenor and extensive repertoire, the Lomaxes recorded him in 1933 on portable aluminum disc recording equipment for the Library of Congress. They returned with new and better equipment in July 1934, recording hundreds of his songs. On August 1, Ledbetter was released after having again served nearly all of his minimum sentence, following a petition the Lomaxes had taken to Louisiana Governor Oscar K. Allen at his urgent request. It was on the other side of a recording of his signature song, \"Goodnight Irene.\"\n\nA prison official later wrote to John Lomax denying that Ledbetter's singing had anything to do with his release from Angola (state prison records confirm he was eligible for early release due to good behavior). However, both Ledbetter and the Lomaxes believed that the record they had taken to the governor had hastened his release from prison.\n\nThe nickname \"Lead Belly\"\n\nThere are several conflicting stories about how Ledbetter acquired the nickname \"Lead Belly\", but he probably acquired it while in prison. Some claim his fellow inmates called him \"Lead Belly\" as a play on his family name and his physical toughness. It is recounted that during his second prison term, another inmate stabbed him in the neck (leaving him with a fearsome scar he subsequently covered with a bandana); Ledbetter nearly killed his attacker with his own knife. Others say he earned the name after being wounded in the stomach with buckshot.The Mudcat Cafe. [http://www.mudcat.org/huddie.cfm Leadbelly – King of the 12 String Guitar]  Retrieved on January 30, 2007 Another theory is that the name refers to his ability to drink moonshine, the homemade liquor which Southern farmers, black and white, made to supplement their incomes. Blues singer Big Bill Broonzy thought it came from a supposed tendency to lay about as if \"with a stomach weighted down by lead\" in the shade when the chain gang was supposed to be working. Or it may be simply a corruption of his last name pronounced with a Southern accent. Whatever its origin, he adopted the nickname as a pseudonym while performing.\n\nLife after prison\n\nWhen Lead Belly was released from prison, the United States was deep in the Great Depression, and jobs were very scarce. In September 1934, in need of regular work in order to avoid cancellation of his release from prison, Lead Belly asked John Lomax to take him on as a driver. For three months he assisted the 67-year-old in his folk song collecting around the South. (Alan Lomax was ill and did not accompany his father on this trip.)\n\nIn December Lead Belly participated in a \"smoker\" (group sing) at a Modern Language Association meeting at Bryn Mawr College in Pennsylvania, where the senior Lomax had a prior lecturing engagement. He was written up in the press as a convict who had sung his way out of prison. On New Year's Day, 1935, the pair arrived in New York City, where Lomax was scheduled to meet with his publisher, Macmillan, about a new collection of folk songs. The newspapers were eager to write about the \"singing convict,\" and Time magazine made one of its first March of Time newsreels about him. Lead Belly attained fame (although not fortune).\n\nThe following week, he began recording for the American Record Corporation, but these recordings achieved little commercial success. He recorded over 40 sides for ARC (intended to be released on their Banner, Melotone, Oriole, Perfect, and Romeo labels and their short-lived Paramount series), but only five sides were actually issued. Part of the reason for the poor sales may have been that ARC released only his blues songs rather than the folk songs for which he would later become better known. Lead Belly continued to struggle financially. Like many performers, what income he made during his career would come from touring, not from record sales.\n\nIn February 1935, he married his girlfriend, Martha Promise, who came north from Louisiana to join him.\n\nThe month of February was spent recording his repertoire and those of other African Americans and interviews about his life with Alan Lomax for their forthcoming book, Negro Folk Songs As Sung by Lead Belly (1936). Concert appearances were slow to materialize. In March 1935, Lead Belly accompanied John Lomax on a previously scheduled two-week lecture tour of colleges and universities in the Northeast, culminating at Harvard.\n\nAt the end of the month, John Lomax decided he could no longer work with Lead Belly and gave him and Martha money to go back to Louisiana by bus. He gave Martha the money her husband had earned during three months of performing, but in installments, on the pretext Lead Belly would spend it all on drinking if given a lump sum. From Louisiana, Lead Belly successfully sued Lomax for both the full amount and release from his management contract. The quarrel was bitter, with hard feelings on both sides. Curiously, in the midst of the legal wrangling, Lead Belly wrote to Lomax proposing they team up again, but it was not to be. Further, the book about Lead Belly published by the Lomaxes in the fall of the following year proved a commercial failure.\n\nIn January 1936, Lead Belly returned to New York on his own, without John Lomax, in an attempted comeback. He performed twice a day at Harlem's Apollo Theater during the Easter season in a live dramatic recreation of the March of Time newsreel (itself a recreation) about his prison encounter with John Lomax, where he had worn stripes, though by this time he was no longer associated with Lomax.\n\nLife magazine ran a three-page article titled \"Lead Belly: Bad Nigger Makes Good Minstrel\" in its issue of April 19, 1937. It included a full-page, color (rare in those days) picture of him sitting on grain sacks playing his guitar and singing. Also included was a striking picture of Martha Promise (identified in the article as his manager); photos showing Lead Belly's hands playing the guitar (with the caption \"these hands once killed a man\"); Texas Governor Pat M. Neff; and the \"ramshackle\" Texas State Penitentiary. The article attributes both of his pardons to his singing of his petitions to the governors, who were so moved that they pardoned him. The text of the article ends with \"he... may well be on the brink of a new and prosperous period.\"\n\nLead Belly failed to stir the enthusiasm of Harlem audiences. Instead, he attained success playing at concerts and benefits for an audience of leftist folk music aficionados. He developed his own style of singing and explaining his repertoire in the context of Southern black culture, having learned from his participation in Lomax's college lectures. He was especially successful with his repertoire of children's game songs (as a younger man in Louisiana he had sung regularly at children's birthday parties in the black community). He was written about as a heroic figure by the black novelist Richard Wright, then a member of the Communist Party, in the columns of the Daily Worker, of which Wright was the Harlem editor. The two men became personal friends, though some say Lead Belly himself was apolitical and if anything was a supporter of Wendell Willkie, the centrist Republican candidate for President, for whom he wrote a campaign song. However, he also wrote the song \"Bourgeois Blues\", which has radical or left-wing lyrics.\n\nIn 1939, Lead Belly was back in jail for assault after stabbing a man in a fight in Manhattan. Alan Lomax, then 24, took him under his wing and helped raise money for his legal expenses, dropping out of graduate school to do so. After his release (in 1940–41), Lead Belly appeared as a regular on Alan Lomax and Nicholas Ray's groundbreaking CBS radio show Back Where I Come From, broadcast nationwide. He also appeared in nightclubs with Josh White, becoming a fixture in New York City's surging folk music scene and befriending the likes of Sonny Terry, Brownie McGhee, Woody Guthrie, and a young Pete Seeger, all fellow performers on Back Where I Come From. During the first half of the decade, he recorded for RCA, the Library of Congress, and Moe Asch (future founder of Folkways Records) and in 1944 went to California, where he recorded strong sessions for Capitol Records. He lodged with a studio guitar player on Merrywood Drive in Laurel Canyon.\n\nLead Belly was the first American country blues musician to achieve success in Europe.\n\nIn 1949, Lead Belly had a regular radio show, Folk Songs of America, broadcast on station WNYC in New York, on Henrietta Yurchenco's show on Sunday nights. Later in the year he began his first European tour with a trip to France, but fell ill before its completion and was diagnosed with amyotrophic lateral sclerosis (ALS), or Lou Gehrig's disease (a motor neuron disease). His final concert was at the University of Texas at Austin in a tribute to his former mentor, John Lomax, who had died the previous year. Martha also performed at that concert, singing spirituals with her husband.\n\nLead Belly died later that year in New York City and was buried in the Shiloh Baptist Church cemetery, in Mooringsport, Louisiana, 8 mi west of Blanchard, in Caddo Parish. He is honored with a statue across from the Caddo Parish Courthouse, in Shreveport.\n\nTechnique\n\nLead Belly styled himself \"King of the Twelve-String Guitar,\" and despite his use of other instruments like the accordion, the most enduring image of Lead Belly as a performer is wielding his unusually large Stella twelve-string. This guitar had a slightly longer scale length than a standard guitar, slotted tuners, ladder bracing, and a trapeze-style tailpiece to resist bridge lifting.\n\nLead Belly played with finger picks much of the time, using a thumb pick to provide a walking bass line and occasionally to strum. This technique, combined with low tunings and heavy strings, gives many of his recordings a piano-like sound. Lead Belly's tuning is debated, but it seems to be a down-tuned variant of standard tuning; it is likely that he tuned his guitar strings relative to one another, so that the actual notes shifted as the strings wore. Lead Belly's playing style was popularized by Pete Seeger, who adopted the twelve-string guitar in the 1950s and released an instructional LP and book using Lead Belly as an exemplar of technique.\n\nIn some of the recordings in which Lead Belly accompanied himself, he would make an unusual type of grunt between his verses, best described as \"Haah!\"; \"Looky Looky Yonder,\" \"Take This Hammer,\" \"Linin' Track\" and \"Julie Ann Johnson\" feature this unusual vocalization. In \"Take This Hammer,\" Lead Belly explained, \"Every time the men say, 'Haah,' the hammer falls. The hammer rings, and we swing, and we sing.\" . Retrieved January 30, 2008. The \"haah\" sound can be heard in work chants sung by Southern railroad section workers, \"gandy dancers,\" in which it was used to coordinate work crews as they laid and maintained tracks.\n\nLegacy\n\nLead Belly's work has been widely covered by subsequent musical acts, including Bob Dylan, Brian Wilson, Johnny Rivers (\"Midnight Special\"), Delaney Davidson, Tom Russell, Lonnie Donegan, Bryan Ferry (\"Goodnight, Irene\"), the Beach Boys (\"Cotton Fields\"), Creedence Clearwater Revival (\"Midnight Special\", \"Cotton Fields\"), Elvis Presley, ABBA, Pete Seeger, the Weavers, Harry Belafonte, Frank Sinatra, Nat King Cole, the Animals, Jay Farrar, Johnny Cash, Tom Petty, Dr. John, Ry Cooder, Davy Graham, Maria Muldaur, Rory Block, Grateful Dead, Gene Autry, Odetta, Billy Childish (who named his son Huddie), Mungo Jerry, Paul King, Van Morrison, Michelle Shocked, Tom Waits (\"Goodnight, Irene\"), Scott H. Biram, Ron Sexsmith, British Sea Power, Rod Stewart, Ernest Tubb, Nick Cave and the Bad Seeds, Ram Jam, Spiderbait (\"Black Betty\"), Blind Willies (\"In the Pines\"), the White Stripes (\"Boll Weevil\"), the Fall, Hole, Smog, Old Crow Medicine Show, Meat Loaf, Ministry, Raffi, Rasputina, Rory Gallagher (\"Out on the Western Plains\"), the Sensational Alex Harvey Band, Deer Tick, Hugh Laurie, X, Bill Frisell, Koerner, Ray & Glover, Red Hot Chili Peppers, Nirvana (\"Where Did You Sleep Last Night\"), Meat Puppets, Mark Lanegan, WZRD (\"Where Did You Sleep Last Night\"), Keith Richards, Phil Lee (\"I Got Stripes\"), and Aerosmith (\"Line 'Em\").\n\nIn 1976, a biopic entitled Leadbelly was released, directed by Gordon Parks and featuring Roger E. Mosley as Lead Belly.\n\nModern rock audiences often owe their familiarity with Lead Belly to Nirvana's performance of \"Where Did You Sleep Last Night\" on a televised concert later released as MTV Unplugged in New York.  Singer-guitarist Kurt Cobain refers to his attempt to convince David Geffen to purchase Lead Belly's guitar for him in an interval before the song is played (connecting the song with Lead Belly in a way that is more tangible than the liner notes where Lead Belly appears on other albums).  In his notebooks, Cobain listed Lead Belly's Last Session Vol. 1  as one of the 50 albums most influential in the formation of Nirvana's sound.\n\nDiscography\n\nVictor Records\n\n*The Midnight Special and Other Southern Prison Songs\n\nThe Library of Congress recordings\n\nThe Library of Congress recordings, made by John and Alan Lomax from 1934 to 1943, were released in a six-volume series by Rounder Records:\n\n* Midnight Special (1991)\n* Gwine Dig a Hole to Put the Devil In (1991)\n* Let It Shine on Me (1991)\n* The Titanic (1994)\n* Nobody Knows the Trouble I've Seen (1994)\n* Go Down Old Hannah (1995)\n\nFolkways recordings\n\nThe Folkways recordings, done for Moses Asch from 1941 to 1947, were released in a three-volume series by Smithsonian Folkways:\n\n* Where Did You Sleep Last Night, Lead Belly Legacy, Vol. 1 (1996)\n* Bourgeois Blues, Lead Belly Legacy, Vol. 2 (1997)\n* Shout On, Lead Belly Legacy, Vol. 3 (1998)\n\nSmithsonian Folkways has released several other collections of his recordings:\n\n* Leadbelly Sings Folk Songs (1989)\n* Lead Belly's Last Sessions (4-CD box set, 1994), recorded late 1948 in New York City;[http://www.discogs.com/release/2877274 Leadbelly's Last Sessions, vol. 1]. Folkways Records (FP 241) U.S. his only commercial recordings on magnetic tape\n* Lead Belly Sings for Children (1999), including the 1960 Folkways album Negro Folk Songs for Young People in its entirety; five of the six tracks from the 1941 album Play Parties in Song and Dance as Sung by Lead Belly, recorded for Moses Asch; other songs recorded for Asch from 1941 to 1948; and one previously unreleased track, a radio broadcast of \"Take This Hammer\"\n* Folkways: The Original Vision, Woody Guthrie and Lead Belly (2004), expanded version of the 1989 compilation\n* Lead Belly: The Smithsonian Folkways Collection (2015)[http://www.discogs.com/release/6711938 The Smithsonian Folkways Collection, 2015 remastered compilation]. Smithsonian Folkways Recordings (SFW 40201) U.S.\n\nLive recordings\n\n* Leadbelly Recorded in Concert, University of Texas, Austin, June 15, 1949 (1973, Playboy Records PB 119)\n\nOther compilations\n\n* Huddie Ledbetter's Best (1989, BGO Records), containing recordings made for Capitol Records in 1944 in California\n* King of the 12-String Guitar (1991, Sony/Legacy Records), a collection of blues songs and prison ballads recorded in 1935 in New York City for the American Record Company, including previously unreleased alternate takes\n* Private Party November 21, 1948 (2000, Document Records), containing Lead Belly's intimate performance at a private party in late 1948 in Minneapolis\n* Take This Hammer, When the Sun Goes Down series, vol. 5 (2003, RCA Victor/Bluebird Jazz), CD collection of all 26 songs Lead Belly recorded for Victor Records in 1940, half of which feature the Golden Gate Jubilee Quartet (a 1968 LP released by RCA Victor included about half of these recordings)\n* A Leadbelly Memorial, Vol II (1963, Stinson Records, SLP 19), red vinyl pressing\n* The Definitive Lead Belly (2008, Not Now Music), a 50-song retrospective on two CDs\n\nReferences and notes\n\nSources\n\n* White, Gary; Stuart, David; Aviva, Elyn (2001). Music in Our World. p. 196. .\n* Lornell, Kip; Wolfe, Charles (1999). The Life and Legend of Leadbelly. Da Capo Press.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lead Belly" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18434" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Huddie William Ledbetter (January 20, 1888 – December 6, 1949) was an American folk and blues musician notable for his strong vocals, virtuosity on the twelve-string guitar, and the folk standards he introduced. He is best known as Lead Belly. Though many releases credit him as \"Leadbelly\", he himself wrote it as \"Lead Belly\", which is also the spelling on his tombstone and the spelling used by the Lead Belly Foundation.\n\nLead Belly usually played a twelve-string guitar, but he also played the piano, mandolin, harmonica, violin, and \"windjammer\" (diatonic accordion). In some of his recordings he sang while clapping his hands or stomping his foot.\n\nLead Belly's songs covered a wide range, including gospel music; blues about women, liquor, prison life, and racism; and folk songs about cowboys, prison, work, sailors, cattle herding, and dancing. He also wrote songs about people in the news, such as Franklin D. Roosevelt, Adolf Hitler, Jean Harlow, Jack Johnson, the Scottsboro Boys and Howard Hughes.\n\nLead Belly was inducted into the Rock and Roll Hall of Fame in 1988 and the Louisiana Music Hall of Fame in 2008.\n\nBiography\n\nEarly life \n\nLead Belly was born Huddie William Ledbetter on the Jeter Plantation near Mooringsport, Louisiana, on January 20, 1888 or 1889 (generally accepted to be the former). The 1900 United States Census lists \"Hudy Ledbetter\" as 12 years old, born January 1888, and the 1910 and 1930 censuses also give his age as corresponding to a birth in 1888. The 1940 census lists his age as 51, with information supplied by wife Martha. However, in April 1942, when Ledbetter filled out his World War II draft registration, he gave his birth date as January 23, 1889, and his birthplace as Freeport, Louisiana (\"Shreveport\"). His grave marker bears the date given on his draft registration.\n \nLedbetter was the younger of two children born to Wesley Ledbetter and Sallie Brown. The pronunciation of his name is purported to be \"HYEW-dee\" or \"HUGH-dee.\" He can be heard pronouncing his name as \"HUH-dee\" on the track \"Boll Weevil,\" from the Smithsonian Folkways album Lead Belly Sings for Children. His parents had cohabited for several years, but they legally married on February 26, 1888. When Huddie was five years old, the family settled in Bowie County, Texas.\n\nBy 1903, Huddie was already a \"musicianer\", a singer and guitarist of some note. He performed for nearby Shreveport audiences in St. Paul's Bottoms, a notorious red-light district there. He began to develop his own style of music after exposure to various musical influences on Shreveport's Fannin Street, a row of saloons, brothels, and dance halls in the Bottoms, now referred to as Ledbetter Heights.\n\nThe 1910 census of Harrison County, Texas, shows \"Hudy\" Ledbetter living next door to his parents with his first wife, Aletha \"Lethe\" Henderson. Aletha is registered as age 19 and married one year. Others say she was 15 when they married in 1908. It was in Texas that Ledbetter received his first instrument, an accordion from his uncle Terrell. By his early twenties, having fathered at least two children, Ledbetter left home to make his living as a guitarist and occasional laborer.\n\nInfluenced by the sinking of the Titanic in April 1912, Ledbetter wrote the song \"The Titanic\", his first composed on the twelve-string guitar, which later became his signature instrument. Initially played when performing with Blind Lemon Jefferson (1897–1929) in and around Dallas, Texas, the song is about champion African-American boxer Jack Johnson's being denied passage on the Titanic. Johnson had in fact been denied passage on a ship for being black, but it was not the Titanic. Still, the song includes the lyric \"Jack Johnson tried to get on board. The Captain, he says, 'I ain't haulin' no coal!' Fare thee, Titanic! Fare thee well!\" Ledbetter later noted he had to leave out this passage when playing in front of white audiences.Lead Belly's Last Sessions, disc 2, track 15, \"The Titanic\". Smithsonian Folkways.\n\nPrison years\n\n In 1915, he was convicted of carrying a pistol and sentenced to time on the Harrison County chain gang.  He escaped, finding work in nearby Bowie County under the assumed name of Walter Boyd.  In January 1918 he was imprisoned at the Imperial Farm (now Central Unit)Perkinson, Robert (2010). Texas Tough: The Rise of America's Prison Empire. Metropolitan Books. [https://books.google.com/books?id\nHOxmcfIopugC&pgPA184&lpg\nPA184&dqLead+Belly+%22Imperial+Farm%22#v\nonepage&qLead%20Belly%20%22Imperial%20Farm%22&f\nfalse 184]. . in Sugar Land, Texas, after killing one of his relatives, Will Stafford, in a fight over a woman.  While there he may have first heard the traditional prison song \"Midnight Special\".Lomax, Alan, ed. Folk Song USA. New American Library. In 1925 he was pardoned and released after writing a song to Governor Pat Morris Neff seeking his freedom, having served the minimum seven years of a 7-to-35-year sentence. Combined with his good behavior, which included entertaining the guards and fellow prisoners, his appeal to Neff's strong religious beliefs proved sufficient. It was a testament to his persuasive powers, as Neff had run for governor on a pledge not to issue pardons (the only recourse for prisoners, since in most Southern prisons there was no provision for parole). According to Charles K. Wolfe and Kip Lornell in their book The Life and Legend of Leadbelly (1999), Neff had regularly brought guests to the prison on Sunday picnics to hear Ledbetter perform.\n\nIn 1930, Ledbetter was sentenced to Louisiana's Angola Prison Farm after a summary trial for attempted homicide for stabbing a white man in a fight. He was \"discovered\" there three years later during a visit by folklorists John Lomax and his son Alan Lomax.\n\nDeeply impressed by Ledbetter's vibrant tenor and extensive repertoire, the Lomaxes recorded him in 1933 on portable aluminum disc recording equipment for the Library of Congress. They returned with new and better equipment in July 1934, recording hundreds of his songs. On August 1, Ledbetter was released after having again served nearly all of his minimum sentence, following a petition the Lomaxes had taken to Louisiana Governor Oscar K. Allen at his urgent request. It was on the other side of a recording of his signature song, \"Goodnight Irene.\"\n\nA prison official later wrote to John Lomax denying that Ledbetter's singing had anything to do with his release from Angola (state prison records confirm he was eligible for early release due to good behavior). However, both Ledbetter and the Lomaxes believed that the record they had taken to the governor had hastened his release from prison.\n\nThe nickname \"Lead Belly\"\n\nThere are several conflicting stories about how Ledbetter acquired the nickname \"Lead Belly\", but he probably acquired it while in prison. Some claim his fellow inmates called him \"Lead Belly\" as a play on his family name and his physical toughness. It is recounted that during his second prison term, another inmate stabbed him in the neck (leaving him with a fearsome scar he subsequently covered with a bandana); Ledbetter nearly killed his attacker with his own knife. Others say he earned the name after being wounded in the stomach with buckshot.The Mudcat Cafe. [http://www.mudcat.org/huddie.cfm Leadbelly – King of the 12 String Guitar]  Retrieved on January 30, 2007 Another theory is that the name refers to his ability to drink moonshine, the homemade liquor which Southern farmers, black and white, made to supplement their incomes. Blues singer Big Bill Broonzy thought it came from a supposed tendency to lay about as if \"with a stomach weighted down by lead\" in the shade when the chain gang was supposed to be working. Or it may be simply a corruption of his last name pronounced with a Southern accent. Whatever its origin, he adopted the nickname as a pseudonym while performing.\n\nLife after prison\n\nWhen Lead Belly was released from prison, the United States was deep in the Great Depression, and jobs were very scarce. In September 1934, in need of regular work in order to avoid cancellation of his release from prison, Lead Belly asked John Lomax to take him on as a driver. For three months he assisted the 67-year-old in his folk song collecting around the South. (Alan Lomax was ill and did not accompany his father on this trip.)\n\nIn December Lead Belly participated in a \"smoker\" (group sing) at a Modern Language Association meeting at Bryn Mawr College in Pennsylvania, where the senior Lomax had a prior lecturing engagement. He was written up in the press as a convict who had sung his way out of prison. On New Year's Day, 1935, the pair arrived in New York City, where Lomax was scheduled to meet with his publisher, Macmillan, about a new collection of folk songs. The newspapers were eager to write about the \"singing convict,\" and Time magazine made one of its first March of Time newsreels about him. Lead Belly attained fame (although not fortune).\n\nThe following week, he began recording for the American Record Corporation, but these recordings achieved little commercial success. He recorded over 40 sides for ARC (intended to be released on their Banner, Melotone, Oriole, Perfect, and Romeo labels and their short-lived Paramount series), but only five sides were actually issued. Part of the reason for the poor sales may have been that ARC released only his blues songs rather than the folk songs for which he would later become better known. Lead Belly continued to struggle financially. Like many performers, what income he made during his career would come from touring, not from record sales.\n\nIn February 1935, he married his girlfriend, Martha Promise, who came north from Louisiana to join him.\n\nThe month of February was spent recording his repertoire and those of other African Americans and interviews about his life with Alan Lomax for their forthcoming book, Negro Folk Songs As Sung by Lead Belly (1936). Concert appearances were slow to materialize. In March 1935, Lead Belly accompanied John Lomax on a previously scheduled two-week lecture tour of colleges and universities in the Northeast, culminating at Harvard.\n\nAt the end of the month, John Lomax decided he could no longer work with Lead Belly and gave him and Martha money to go back to Louisiana by bus. He gave Martha the money her husband had earned during three months of performing, but in installments, on the pretext Lead Belly would spend it all on drinking if given a lump sum. From Louisiana, Lead Belly successfully sued Lomax for both the full amount and release from his management contract. The quarrel was bitter, with hard feelings on both sides. Curiously, in the midst of the legal wrangling, Lead Belly wrote to Lomax proposing they team up again, but it was not to be. Further, the book about Lead Belly published by the Lomaxes in the fall of the following year proved a commercial failure.\n\nIn January 1936, Lead Belly returned to New York on his own, without John Lomax, in an attempted comeback. He performed twice a day at Harlem's Apollo Theater during the Easter season in a live dramatic recreation of the March of Time newsreel (itself a recreation) about his prison encounter with John Lomax, where he had worn stripes, though by this time he was no longer associated with Lomax.\n\nLife magazine ran a three-page article titled \"Lead Belly: Bad Nigger Makes Good Minstrel\" in its issue of April 19, 1937. It included a full-page, color (rare in those days) picture of him sitting on grain sacks playing his guitar and singing. Also included was a striking picture of Martha Promise (identified in the article as his manager); photos showing Lead Belly's hands playing the guitar (with the caption \"these hands once killed a man\"); Texas Governor Pat M. Neff; and the \"ramshackle\" Texas State Penitentiary. The article attributes both of his pardons to his singing of his petitions to the governors, who were so moved that they pardoned him. The text of the article ends with \"he... may well be on the brink of a new and prosperous period.\"\n\nLead Belly failed to stir the enthusiasm of Harlem audiences. Instead, he attained success playing at concerts and benefits for an audience of leftist folk music aficionados. He developed his own style of singing and explaining his repertoire in the context of Southern black culture, having learned from his participation in Lomax's college lectures. He was especially successful with his repertoire of children's game songs (as a younger man in Louisiana he had sung regularly at children's birthday parties in the black community). He was written about as a heroic figure by the black novelist Richard Wright, then a member of the Communist Party, in the columns of the Daily Worker, of which Wright was the Harlem editor. The two men became personal friends, though some say Lead Belly himself was apolitical and if anything was a supporter of Wendell Willkie, the centrist Republican candidate for President, for whom he wrote a campaign song. However, he also wrote the song \"Bourgeois Blues\", which has radical or left-wing lyrics.\n\nIn 1939, Lead Belly was back in jail for assault after stabbing a man in a fight in Manhattan. Alan Lomax, then 24, took him under his wing and helped raise money for his legal expenses, dropping out of graduate school to do so. After his release (in 1940–41), Lead Belly appeared as a regular on Alan Lomax and Nicholas Ray's groundbreaking CBS radio show Back Where I Come From, broadcast nationwide. He also appeared in nightclubs with Josh White, becoming a fixture in New York City's surging folk music scene and befriending the likes of Sonny Terry, Brownie McGhee, Woody Guthrie, and a young Pete Seeger, all fellow performers on Back Where I Come From. During the first half of the decade, he recorded for RCA, the Library of Congress, and Moe Asch (future founder of Folkways Records) and in 1944 went to California, where he recorded strong sessions for Capitol Records. He lodged with a studio guitar player on Merrywood Drive in Laurel Canyon.\n\nLead Belly was the first American country blues musician to achieve success in Europe.\n\nIn 1949, Lead Belly had a regular radio show, Folk Songs of America, broadcast on station WNYC in New York, on Henrietta Yurchenco's show on Sunday nights. Later in the year he began his first European tour with a trip to France, but fell ill before its completion and was diagnosed with amyotrophic lateral sclerosis (ALS), or Lou Gehrig's disease (a motor neuron disease). His final concert was at the University of Texas at Austin in a tribute to his former mentor, John Lomax, who had died the previous year. Martha also performed at that concert, singing spirituals with her husband.\n\nLead Belly died later that year in New York City and was buried in the Shiloh Baptist Church cemetery, in Mooringsport, Louisiana, 8 mi west of Blanchard, in Caddo Parish. He is honored with a statue across from the Caddo Parish Courthouse, in Shreveport.\n\nTechnique\n\nLead Belly styled himself \"King of the Twelve-String Guitar,\" and despite his use of other instruments like the accordion, the most enduring image of Lead Belly as a performer is wielding his unusually large Stella twelve-string. This guitar had a slightly longer scale length than a standard guitar, slotted tuners, ladder bracing, and a trapeze-style tailpiece to resist bridge lifting.\n\nLead Belly played with finger picks much of the time, using a thumb pick to provide a walking bass line and occasionally to strum. This technique, combined with low tunings and heavy strings, gives many of his recordings a piano-like sound. Lead Belly's tuning is debated, but it seems to be a down-tuned variant of standard tuning; it is likely that he tuned his guitar strings relative to one another, so that the actual notes shifted as the strings wore. Lead Belly's playing style was popularized by Pete Seeger, who adopted the twelve-string guitar in the 1950s and released an instructional LP and book using Lead Belly as an exemplar of technique.\n\nIn some of the recordings in which Lead Belly accompanied himself, he would make an unusual type of grunt between his verses, best described as \"Haah!\"; \"Looky Looky Yonder,\" \"Take This Hammer,\" \"Linin' Track\" and \"Julie Ann Johnson\" feature this unusual vocalization. In \"Take This Hammer,\" Lead Belly explained, \"Every time the men say, 'Haah,' the hammer falls. The hammer rings, and we swing, and we sing.\" . Retrieved January 30, 2008. The \"haah\" sound can be heard in work chants sung by Southern railroad section workers, \"gandy dancers,\" in which it was used to coordinate work crews as they laid and maintained tracks.\n\nLegacy\n\nLead Belly's work has been widely covered by subsequent musical acts, including Bob Dylan, Brian Wilson, Johnny Rivers (\"Midnight Special\"), Delaney Davidson, Tom Russell, Lonnie Donegan, Bryan Ferry (\"Goodnight, Irene\"), the Beach Boys (\"Cotton Fields\"), Creedence Clearwater Revival (\"Midnight Special\", \"Cotton Fields\"), Elvis Presley, ABBA, Pete Seeger, the Weavers, Harry Belafonte, Frank Sinatra, Nat King Cole, the Animals, Jay Farrar, Johnny Cash, Tom Petty, Dr. John, Ry Cooder, Davy Graham, Maria Muldaur, Rory Block, Grateful Dead, Gene Autry, Odetta, Billy Childish (who named his son Huddie), Mungo Jerry, Paul King, Van Morrison, Michelle Shocked, Tom Waits (\"Goodnight, Irene\"), Scott H. Biram, Ron Sexsmith, British Sea Power, Rod Stewart, Ernest Tubb, Nick Cave and the Bad Seeds, Ram Jam, Spiderbait (\"Black Betty\"), Blind Willies (\"In the Pines\"), the White Stripes (\"Boll Weevil\"), the Fall, Hole, Smog, Old Crow Medicine Show, Meat Loaf, Ministry, Raffi, Rasputina, Rory Gallagher (\"Out on the Western Plains\"), the Sensational Alex Harvey Band, Deer Tick, Hugh Laurie, X, Bill Frisell, Koerner, Ray & Glover, Red Hot Chili Peppers, Nirvana (\"Where Did You Sleep Last Night\"), Meat Puppets, Mark Lanegan, WZRD (\"Where Did You Sleep Last Night\"), Keith Richards, Phil Lee (\"I Got Stripes\"), and Aerosmith (\"Line 'Em\").\n\nIn 1976, a biopic entitled Leadbelly was released, directed by Gordon Parks and featuring Roger E. Mosley as Lead Belly.\n\nModern rock audiences often owe their familiarity with Lead Belly to Nirvana's performance of \"Where Did You Sleep Last Night\" on a televised concert later released as MTV Unplugged in New York.  Singer-guitarist Kurt Cobain refers to his attempt to convince David Geffen to purchase Lead Belly's guitar for him in an interval before the song is played (connecting the song with Lead Belly in a way that is more tangible than the liner notes where Lead Belly appears on other albums).  In his notebooks, Cobain listed Lead Belly's Last Session Vol. 1  as one of the 50 albums most influential in the formation of Nirvana's sound.\n\nDiscography\n\nVictor Records\n\n*The Midnight Special and Other Southern Prison Songs\n\nThe Library of Congress recordings\n\nThe Library of Congress recordings, made by John and Alan Lomax from 1934 to 1943, were released in a six-volume series by Rounder Records:\n\n* Midnight Special (1991)\n* Gwine Dig a Hole to Put the Devil In (1991)\n* Let It Shine on Me (1991)\n* The Titanic (1994)\n* Nobody Knows the Trouble I've Seen (1994)\n* Go Down Old Hannah (1995)\n\nFolkways recordings\n\nThe Folkways recordings, done for Moses Asch from 1941 to 1947, were released in a three-volume series by Smithsonian Folkways:\n\n* Where Did You Sleep Last Night, Lead Belly Legacy, Vol. 1 (1996)\n* Bourgeois Blues, Lead Belly Legacy, Vol. 2 (1997)\n* Shout On, Lead Belly Legacy, Vol. 3 (1998)\n\nSmithsonian Folkways has released several other collections of his recordings:\n\n* Leadbelly Sings Folk Songs (1989)\n* Lead Belly's Last Sessions (4-CD box set, 1994), recorded late 1948 in New York City;[http://www.discogs.com/release/2877274 Leadbelly's Last Sessions, vol. 1]. Folkways Records (FP 241) U.S. his only commercial recordings on magnetic tape\n* Lead Belly Sings for Children (1999), including the 1960 Folkways album Negro Folk Songs for Young People in its entirety; five of the six tracks from the 1941 album Play Parties in Song and Dance as Sung by Lead Belly, recorded for Moses Asch; other songs recorded for Asch from 1941 to 1948; and one previously unreleased track, a radio broadcast of \"Take This Hammer\"\n* Folkways: The Original Vision, Woody Guthrie and Lead Belly (2004), expanded version of the 1989 compilation\n* Lead Belly: The Smithsonian Folkways Collection (2015)[http://www.discogs.com/release/6711938 The Smithsonian Folkways Collection, 2015 remastered compilation]. Smithsonian Folkways Recordings (SFW 40201) U.S.\n\nLive recordings\n\n* Leadbelly Recorded in Concert, University of Texas, Austin, June 15, 1949 (1973, Playboy Records PB 119)\n\nOther compilations\n\n* Huddie Ledbetter's Best (1989, BGO Records), containing recordings made for Capitol Records in 1944 in California\n* King of the 12-String Guitar (1991, Sony/Legacy Records), a collection of blues songs and prison ballads recorded in 1935 in New York City for the American Record Company, including previously unreleased alternate takes\n* Private Party November 21, 1948 (2000, Document Records), containing Lead Belly's intimate performance at a private party in late 1948 in Minneapolis\n* Take This Hammer, When the Sun Goes Down series, vol. 5 (2003, RCA Victor/Bluebird Jazz), CD collection of all 26 songs Lead Belly recorded for Victor Records in 1940, half of which feature the Golden Gate Jubilee Quartet (a 1968 LP released by RCA Victor included about half of these recordings)\n* A Leadbelly Memorial, Vol II (1963, Stinson Records, SLP 19), red vinyl pressing\n* The Definitive Lead Belly (2008, Not Now Music), a 50-song retrospective on two CDs\n\nReferences and notes\n\nSources\n\n* White, Gary; Stuart, David; Aviva, Elyn (2001). Music in Our World. p. 196. .\n* Lornell, Kip; Wolfe, Charles (1999). The Life and Legend of Leadbelly. Da Capo Press. Lead Belly. http://en.wikipedia.org/?curid=18434."
  }
}
