{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8960",
  "eid" : "eb937a40-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778474980,
  "textBody" : "Deprogramming refers to measures that claim to assist a person who holds a controversial belief system in changing those beliefs and abandon allegiance to the religious, political, economic, or social group associated with the belief system.Encyclopedia of religion, Volume 4 , Lindsay Jones, Macmillan Reference USA, 2005, pages 2291-2293Children held hostage: dealing with programmed and brainwashed children, American Bar Association archive publications, Authors Stanley S. Clawar, Brynne V. Rivlin, American Bar Association. Section of Family Law Publisher Section of Family Law, American Bar Association, 1991 , , pages 142-144 The dictionary definition of deprogramming is \"to free\" or \"to retrain\" someone from specific beliefs. Some controversial methods and practices of self-identified \"deprogrammers\" have involved kidnapping, false imprisonment, and coercion, which have sometimes resulted in criminal convictions of the deprogrammers. Some deprogramming regimens are designed for individuals taken against their will, which has led to controversies over freedom of religion, kidnapping, and civil rights, as well as the violence which is sometimes involved.\n\nBackground\n\nAs a technique, the deprogramming that has been practiced over the last half century has been typically commissioned by relatives, often parents of adult offspring, who objected to the subject's membership in an organization or group. It has been compared to exorcisms in both methodology and manifestation, and the process sometimes has been performed with tacit support of law enforcement and judicial officials.Bromley, David Melton, J. Gordon 2002. Cults, Religion, and Violence. West Nyack, NY, USA: Cambridge University Press.  In response to a burgeoning number of new religious movements in the 1970s in the United States, the \"father of deprogramming\", Ted Patrick, introduced many of these techniques to a wider audience as a means to combat cults.Chryssides, G.D. and B.E. Zeller. 2014. The Bloomsbury Companion to New Religious Movements: BLOOMSBURY PUBLISHING. Since then, deprogrammings have been carried out \"by the thousands\".James T Richardson \"Reflexivity and objectivity in the study of controversial new religions  Religion Vol. 21, Iss. 4, 1991 For example, various atrocity stories served as justification for deprogramming of Unification Church members in the USA.Kurtz, Lester R. Gods in the Global Village: The World's Religions in Sociological Perspective 2007, Pine Forge Press, , page 228\n\nAs a technique for encouraging people to disassociate with groups with whom they have as consenting adults chosen to associate, deprogramming is a controversial practice. Even some cult critics have denounced it on legal and ethical grounds.Langone, Michael D., and Paul R. Martin. \"Viewpoint: Deprogramming, Exit Counseling, and Ethics: Clarifying the Confusion.\" Christian Research Institute Journal (30 June 1994) [Winter 1993]: page 46 (Retrieved 26 April 2014) Similar actions, when done without force, have been referred to as \"exit counseling\". \nSometimes the word deprogramming is used in a wider (and/or ironic or humorous sense), to mean the freeing of someone (often oneself) from any previously uncritically assimilated idea. According to Carol Giambalvo, \"exit cousellors are usually former cult members themselves\".\n\nVarious academics have commented on the practice. For example, as defined by James T. Richardson, UNLV Professor of Sociology and Judicial Studies and Director of the Grant Sawyer Center for Justice Studies, deprogramming is a \"private, self-help process whereby participants in unpopular new religious movements (NRMs) were forcibly removed from the group, incarcerated, and put through radical resocialization processes that were supposed to result in their agreeing to leave the group.\" Law professor Douglas Laycock, author of Religious Liberty: The free exercise clause, wrote:\n\nBeginning in the 1970s, many parents responded to the initial conversion with \"deprogramming.\" The essence of deprogramming was to physically abduct the convert, isolate him and physically restrain him, and barrage him with continuous arguments and attacks against his new religion, threatening to hold him forever until he agreed to leave it.Laycock, D. 2011. Religious Liberty: The free exercise clause. W.B. Eerdmans Publishing Company. https://books.google.com/books?id=bEiwxUad97IC.\n\nLawyer John LeMoult, writing in a law review journal, described such practices as the person subject to deprogramming being \"seized, held against his will, subjected to mental, emotional, and even physical pressures until he renounces his beliefs\", and compared this power to that of Nazis over their prisoners. Legal scholar Dean M. Kelley called deprogramming \"protracted spiritual gang-rape\".Dean Kelley, \"Deprogramming and Religious Liberty\", Civil Liberties Review 23 (July/August 1977)\n\nProcedures \n\nThere has never been a standard procedure among deprogrammers; descriptions in anecdotal reports, studies, and interviews with former deprogrammers vary greatly. Deprogrammers generally operate on the presumption that the people they are paid to extract from religious organizations are victims of mind control (or brainwashing). Books written by deprogrammers and exit counselors say that the most essential part of freeing the mind of a person is to convince the subject that he or she had been under the mental control of others.\n\nTed Patrick, one of the pioneers of deprogramming, used a confrontational method, enlisting psychiatrists and psychologists to assist him in the deprogramming process.24 T. Marshall L. Rev. 359 (1998-1999) Holy Wars: Involuntary Deprogramming as a Weapon against Cults; McAllister, Shawn Patrick was tried and convicted of multiple felonies related to kidnapping and unlawful imprisonment of deprogramming subjects.Price, Polly J. Regulation of religious proselytism in the United States. Brigham Young University Law Review. 2001 537-574.\n\nSylvia Buford, an associate of Ted Patrick who has assisted him on many deprogrammings, described five stages of deprogramming:(Stoner, C., & Parke, J. (1977). All God's children: The cult experience - salvation or slavery? Radrior, PA: Chilton )\n#Discredit the figure of authority: the cult leader\n#Present contradictions (ideology versus reality): \"How can he preach love when he exploits people?\" is an example.\n#The breaking point: When a subject begins to listen to the deprogrammer; when reality begins to take precedence over ideology.\n#Self-expression: When the subject begins to open up and voice gripes against the cult.\n#Identification and transference: when the subject begins to identify with the deprogrammers, starts to think as an opponent of the cult rather than as a member.\n\nViolence \n\nThe deprogramming accounts vary widely regarding the use of force, with the most dramatic accounts coming from deprogrammed people who returned to the group.\n\nSteven Hassan in his book Releasing the Bonds spoke against coercive deprogramming methods using force or threats.\n\nThe deprogramming case observed by Dubrow-Eichel did not include any violence.\n\nSociologist Eileen Barker wrote in [http://www.cesnur.org/2001/london2001/barker.htm Watching for Violence]:\n\"Although deprogramming has become less violent in the course of time ... Numerous testimonies by those who were subjected to a deprogramming describe how they were threatened with a gun, beaten, denied sleep and food and/or sexually assaulted. But one does not have to rely on the victims for stories of violence: Ted Patrick, one of the most notorious deprogrammers used by CAGs (who has spent several terms in prison for his exploits) openly boasts about some of the violence he employed; in November 1987, Cyril Vosper, a Committee member of the British cult-awareness group, FAIR, was convicted in Munich of \"causing bodily harm\" in the course of one of his many deprogramming attempts; and a number of similar convictions are on record for prominent members of CAGs elsewhere.\"\n\nIn Colombrito vs. Kelly, the Court accepted the definition of deprogramming by J. Le Moult published in 1978 in the Fordham Law Review:\n\"Deprogrammers are people who, at the request of a parent or other close relative, will have a member of a religious sect seized, then hold him against his will and subject him to mental, emotional, and even physical pressures until he renounces his religious beliefs. Deprogrammers usually work for a fee, which may easily run as high as $25,000. The deprogramming process begins with abduction. Often strong men muscle the subject into a car and take him to a place where he is cut off from everyone but his captors. He may be held against his will for upward of three weeks. Frequently, however, the initial deprogramming only last a few days. The subject's sleep is limited and he is told that he will not be released until his beliefs meet his captors' approval. Members of the deprogramming group, as well as members of the family, come into the room where the victim is held and barrage him with questions and denunciations until he recants his newly found religion \"\n\nDeprogrammer Carol Giambalvo writes in the 1998 text \"Deprogramming to Thought Reform Consultation\":\n\"It was believed that the hold of the brainwashing over the cognitive processes of a cult member needed to be broken – or \"snapped\" as some termed it – by means that would shock or frighten the cultist into thinking again. For that reason in some cases cult leader's pictures were burned or there were highly confrontational interactions between deprogrammers and cultist. What was often sought was an emotional response to the information, the shock, the fear, and the confrontation. There are horror stories – promoted most vehemently by the cults themselves – about restraint, beatings, and even rape. And we have to admit that we have met former members who have related to us their deprogramming experience – several of handcuffs, weapons wielded and sexual abuse. But thankfully, these are in the minority – and in our minds, never justified. Nevertheless, deprogramming helped to free many individuals held captive to destructive cults at a time when other alternatives did not seem viable.\"Giambalvo, Carol (November 1998). [http://www.csj.org/studyindex/studyintervention/study_deprog_threfrmconsult.htm Deprogramming to Thought Reform Consultation\"]. International Cultic Studies Association. Retrieved January 28, 2018.\n\nEffectiveness and harm\n\nAlan W. Gomes (chairman of the department of theology at Talbot School of Theology, Biola University) in his 2009 book Unmasking the Cults reports:\n  \nWhile advocates of the deprogramming position have claimed high rates of success, studies show that natural attrition rates actually are higher than the success rate achieved through deprogramming.Gomes, Alan W., Unmasking the Cults,\nZondervan Guide to Cults and Religious Movements, Zondervan, 2009\n, \n\nThe Dialog Center International (DCI) a major Christian counter-cult organization founded in 1973 by a Danish professor of missiology and ecumenical theology, Dr. Johannes Aagaard[http://www.cesnur.org/2007/aagaard.htm Obituary, 23 March 2007] rejects deprogramming, believing that it is counterproductive, ineffective, and can harm the relationship between a cult member and concerned family members.Exploring New Religions, George D. Chryssides, Continuum International Publishing Group, 2001, ,  , pages 353-254\n\nProfessor of psychiatry Saul Levine suggests that it is doubtful that deprogramming helps many people and goes on to say that it actually causes harm to the victim by very nature of the deprogramming. For deprogramming to work, the victim must be convinced that they joined a religious group against their will. They then must renounce responsibility and accept that in some mysterious way that their minds were controlled. It is Levine's professional opinion that once deprogrammed, a person would never be certain that they were really doing what they want. He states that deprogramming destroys a person's identity and is likely to create permanent anxiety about freedom of choice and leave the deprogrammed subject dependent upon the guidance and advice of others. \"Fundamentally deprogramming denies choice and creates dependency.  It robs people of their sense of responsibility.  Instead of encouraging people to accept that they made a mistake, it encourages people to deny their actions and blame others.\"Understanding Cults and New Age Religions, by Irving Hexham, Karla Poewe, and J. I. Packer\n\nGovernment\n\nDeprogramming activities often fall outside of the law. Government agencies have at times been aware and have taken part in deprogramming to enforce official views of \"correct\" beliefs and behaviors.  This can involve \"vigorous, even violent, efforts to dissuade people from participating in groups deemed unacceptable to the government\" and have been \"given legal sanction by the passage of laws that make illegal the activities or even the beliefs\nof the unpopular movement or group being targeted\".\n\nControversy and related issues\n\nIn the United States, from the mid-1970s and throughout the 1980s mind control was a widely accepted theory in public opinion, and the vast majority of newspaper and magazine accounts of deprogrammings assumed that recruits' relatives were well justified to seek conservatorships and to hire deprogrammers. It took nearly 20 years for public opinion to shift.\n\nOne aspect that gradually became disturbing from a civil rights point of view, was that relatives would use deception or other ethically questionable methods—even kidnapping—to get the recruit into deprogrammers' hands, without allowing the person any recourse to a lawyer or psychiatrist of their own choosing. Previously, there would be a sanity hearing first, and only then a commitment to an asylum or involuntary therapy. But with deprogramming, judges routinely granted parents legal authority over their adult children without a hearing.\n\nOne of main objections raised to deprogramming (as well as to exit counseling) is the contention that they begin with a false premise. Lawyers for some groups who have lost members due to deprogramming, as well as some civil libertarians, sociologists and psychologists, argue that it is not the religious groups but rather the deprogrammers who are the ones who deceive and manipulate people.\n\nDavid Bromley and Anson Shupe wrote:\n\nA number of factors contributed to the cessation of deprogramming:\n\nSome of the deprogrammed adults sued the deprogrammers or the relatives who had hired them.  Also in 1987, psychologist Margaret Singer became unusable as an expert witness after the American Psychological Association (APA) rejected her Deceptive and Indirect Methods of Persuasion and Control (DIMPAC) report.[https://books.google.com/books?id\ngmcjPkrGTQ8C&lpgPA54&ots\n335cDzpa_5&dq%22May%2011%2C%201987%22%20dimpac&pg\nPA54#vonepage&q\n%22May%2011,%201987%22%20dimpac&f=false May 11, 1987, APA MEMORANDUM]\n\nThe American Civil Liberties Union published a statement in 1977 which said:\n\nIn the 1980s in the United States, namely in New York (Deprogramming Bill, 1981), Kansas (Deprogramming Bill, 1982), and Nebraska (conservatorship legislation for 1985), lawmakers unsuccessfully attempted to legalize involuntary deprogramming.\n\nRev. Sun Myung Moon, founder of the Unification Church (many of whose members were targets of deprogramming) issued this statement in 1983:\n\nDuring the 1990s, deprogrammer Rick Ross was sued by Jason Scott, a former member of a Pentecostal group called the Life Tabernacle Church, after an unsuccessful deprogramming attempt. In 1995, the jury awarded Scott $875,000 in compensatory damages and $2,500,000 in punitive damages against Ross, which were later settled for $5,000 and 200 hours of services. More significantly, the jury also found that the leading anti-cult group known as the Cult Awareness Network was a co-conspirator in the crime and fined CAN $1,000,000 in punitive damages, forcing the group into bankruptcy.[http://www.cesnur.org/2001/CAN/02/01.htm Scott vs. Ross, Workman, Simpson.] Retrieved May 31, 2007. This case is often seen as effectively closing the door on the practice of involuntary deprogramming in the United States.\n\nReferral and kickback system\n\nAnti-cult groups play a central role in maintaining the underground network of communications, referrals, transportation, and housing necessary for continued deprogramming.\nDavis, D. and B. Hankins. 2003. New Religious Movements and Religious Liberty in America: Baylor University Press.\n\nGroups such as the Cult Awareness Network operated a referral scheme (NARDEC) in which they would refer people to deprogrammers in return for a 'kickback' in the form of a donation or as a commission.Shupe, A. and S.E. Darnell. 2011. Agents of Discord: Deprogramming, Pseudo-Science, and the American Anticult Movement: Transaction Publishers. Deprogrammers such as Rick Ross, Steven Hassan and Carol Giambalvo were amongst the CAN referred deprogrammers.\"The Cult Awareness Network and the Anticult Movement: Implications for NRMs in America\" (with Susan E. Darnell and Kendrick Moxon) in New Religious Movements and Religious Liberty in America. edited by Derek H. Davis and Barry Hankins. Waco: J.M.Dawson Institute of Church-State Studies and Baylor University Press, 2002. \n\nVictims\n\nIn 1974, Kathy Crampton—whose abduction and deprogramming were televised nationally—went back to the Love Family group several days after her apparently successful deprogramming. Patrick was charged with kidnapping, but acquitted with the reasoning: \"[w]here parents are, as here, of the reasonable and intelligent belief that they were not physically capable of recapturing their daughter from existing, imminent danger, then the defense of necessity transfers or transposes to the constituted agent, the person who acts upon their belief under such conditions. Here that agent is the Defendant Ted Patrick.\" (District Court of the United States 1974: 79; New York Times 1974).\n\nIn 1980, Susan Wirth, a 35-year-old teacher living in San Francisco, was abducted by her parents to be deprogrammed in reaction to her leftist political views and activities.  Patrick was paid $27,000 to carry out the deprogramming, which involved handcuffing her to a bed for two weeks and denying her food.Stephen Garrard Postpage, Inquiries in bioethics, 1993, Georgetwon University Press, , , page 71  She was later released and after returning to San Francisco spoke out against deprogramming but declined to press legal charges against her parents.\"Feared kidnapped, she reconciles with mother\", Merced Sun-Star, July 29, 1980\n\nIn 1980, Patrick was convicted of conspiracy, kidnapping, and false imprisonment for abducting and attempting to deprogram Roberta McElfish, a 26-year-old Tucson waitress. Patrick was sentenced to one year in prison and fined $5,000.\n\nIn 1981, Stephanie Riethmiller, who lived in Ohio, was kidnapped by deprogrammers hired by her parents to end her lesbian relationship. She was held against her will and repeatedly raped. After her release she filed civil charges against her parents and the deprogrammers, which were dismissed in a trial that generated some controversy in the media.Violence Against Lesbians and Gay Men, \nGary David Comstock, Columbia University Press (April 15, 1995)\n\n. page 201\n\nIn 1990, Patrick attempted to deprogram Elma Miller, an Amish woman who had joined a liberal sect. He was hired by her husband to return her to him and the Amish church. Criminal charges of conspiracy were filed against Miller's husband, brother, and two others but were later dropped on her request to the prosecuting attorney.Amish Woman Charges Deprogramming, Pittsburg Press, November 30, 1990, page 8Amish Woman Asks Prosecutor to Drop Charges on Kidnapping, Madison Courier, December 8, 1990, page 3\n\nDuring the 1990s, Rick Ross, a noted cult intervention advocate who took part in a number of deprogramming sessions, was sued by Jason Scott, a former member of a Pentecostalist group called the Life Tabernacle Church (part of United Pentecostal Church International), after an unsuccessful coercive deprogramming. The jury awarded Scott $875,000 in compensatory damages and $1,000,000 in punitive damages against the Cult Awareness Network (CAN), and $2,500,000 against Ross (later settled for $5,000 and 200 hours of services \"as an expert consultant and intervention specialist\").\n\nExit counseling\n\nDeprogramming and exit counseling, sometimes seen as one and the same, are distinct approaches to convincing a person to leave a cult. Some people blur the distinctions on purpose: some practitioners do so to avoid criticism; some opponents do so to intensify it.\n\nProponents of the distinction, however, state that deprogramming entails coercion and confinement, while exit counseling assures the subject of the freedom to leave at any time. Deprogramming typically costs $10,000 or more, mainly because of the expense of a security team. Exit counseling typically costs $2,000 to $4,000, including expenses, for a three- to five-day intervention, although cases requiring extensive research of little-known groups can cost much more (estimated in 1993). Deprogramming, especially when it fails, entails considerable legal and psychological risk (for example, a permanent alienation of the subject from his or her family). The psychological and legal risks in exit counseling are significantly reduced. Although deprogrammers do prepare families for the process, exit counselors tend to work with them directly, expecting those requesting the intervention to contribute more to the process; that is, exit counseling requires that families establish a reasonable and respectful level of communication with their loved one before the program itself can begin. Because deprogramming relies on coercion, which is illegal except in the case of conservatorship and is generally viewed as unethical, deprogrammers' critiques of the unethical practices of cults tend to be less credibility to the subject than the arguments of exit counselors.[http://www.iclnet.org/pub/resources/text/cri/cri-jrnl/web/crj0121a.html]\n\nSteven Hassan, author of the book Combatting Cult Mind Control, states that he took part in a number of deprogrammings in the late 1970s, and has spoken out against them since 1980.[http://www.freedomofmind.com/stevehassan/refuting/ Refuting the Disinformation Attacks Put Forth by Destructive Cults and their Agents], by Steven Hassan Hassan states that he has not participated in any deprogrammings since then, although on page 114 of Combatting, Hassan states that deprogrammings should be kept as a last resort if all other attempts fail to transform the individual. Hassan is one of the major proponents of exit counseling as a form of intercession, and he refers to his method as \"strategic intervention therapy\".\n\nIn popular culture\n\n* Faults, a 2014 drama movie about deprogramming\n* Holy Smoke!, a 1999 movie based on the book with the same name\n* Split Image, a 1982 movie about deprogramming \n* Deprogrammed, a 2015 Canadian documentary[http://www.eyesteelfilm.com/deprogrammed Deprogrammed]. EyeSteelFilm. 2015 (Montreal). Retrieved January 2018.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Deprogramming" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8960" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Deprogramming refers to measures that claim to assist a person who holds a controversial belief system in changing those beliefs and abandon allegiance to the religious, political, economic, or social group associated with the belief system.Encyclopedia of religion, Volume 4 , Lindsay Jones, Macmillan Reference USA, 2005, pages 2291-2293Children held hostage: dealing with programmed and brainwashed children, American Bar Association archive publications, Authors Stanley S. Clawar, Brynne V. Rivlin, American Bar Association. Section of Family Law Publisher Section of Family Law, American Bar Association, 1991 , , pages 142-144 The dictionary definition of deprogramming is \"to free\" or \"to retrain\" someone from specific beliefs. Some controversial methods and practices of self-identified \"deprogrammers\" have involved kidnapping, false imprisonment, and coercion, which have sometimes resulted in criminal convictions of the deprogrammers. Some deprogramming regimens are designed for individuals taken against their will, which has led to controversies over freedom of religion, kidnapping, and civil rights, as well as the violence which is sometimes involved.\n\nBackground\n\nAs a technique, the deprogramming that has been practiced over the last half century has been typically commissioned by relatives, often parents of adult offspring, who objected to the subject's membership in an organization or group. It has been compared to exorcisms in both methodology and manifestation, and the process sometimes has been performed with tacit support of law enforcement and judicial officials.Bromley, David Melton, J. Gordon 2002. Cults, Religion, and Violence. West Nyack, NY, USA: Cambridge University Press.  In response to a burgeoning number of new religious movements in the 1970s in the United States, the \"father of deprogramming\", Ted Patrick, introduced many of these techniques to a wider audience as a means to combat cults.Chryssides, G.D. and B.E. Zeller. 2014. The Bloomsbury Companion to New Religious Movements: BLOOMSBURY PUBLISHING. Since then, deprogrammings have been carried out \"by the thousands\".James T Richardson \"Reflexivity and objectivity in the study of controversial new religions  Religion Vol. 21, Iss. 4, 1991 For example, various atrocity stories served as justification for deprogramming of Unification Church members in the USA.Kurtz, Lester R. Gods in the Global Village: The World's Religions in Sociological Perspective 2007, Pine Forge Press, , page 228\n\nAs a technique for encouraging people to disassociate with groups with whom they have as consenting adults chosen to associate, deprogramming is a controversial practice. Even some cult critics have denounced it on legal and ethical grounds.Langone, Michael D., and Paul R. Martin. \"Viewpoint: Deprogramming, Exit Counseling, and Ethics: Clarifying the Confusion.\" Christian Research Institute Journal (30 June 1994) [Winter 1993]: page 46 (Retrieved 26 April 2014) Similar actions, when done without force, have been referred to as \"exit counseling\". \nSometimes the word deprogramming is used in a wider (and/or ironic or humorous sense), to mean the freeing of someone (often oneself) from any previously uncritically assimilated idea. According to Carol Giambalvo, \"exit cousellors are usually former cult members themselves\".\n\nVarious academics have commented on the practice. For example, as defined by James T. Richardson, UNLV Professor of Sociology and Judicial Studies and Director of the Grant Sawyer Center for Justice Studies, deprogramming is a \"private, self-help process whereby participants in unpopular new religious movements (NRMs) were forcibly removed from the group, incarcerated, and put through radical resocialization processes that were supposed to result in their agreeing to leave the group.\" Law professor Douglas Laycock, author of Religious Liberty: The free exercise clause, wrote:\n\nBeginning in the 1970s, many parents responded to the initial conversion with \"deprogramming.\" The essence of deprogramming was to physically abduct the convert, isolate him and physically restrain him, and barrage him with continuous arguments and attacks against his new religion, threatening to hold him forever until he agreed to leave it.Laycock, D. 2011. Religious Liberty: The free exercise clause. W.B. Eerdmans Publishing Company. https://books.google.com/books?id=bEiwxUad97IC.\n\nLawyer John LeMoult, writing in a law review journal, described such practices as the person subject to deprogramming being \"seized, held against his will, subjected to mental, emotional, and even physical pressures until he renounces his beliefs\", and compared this power to that of Nazis over their prisoners. Legal scholar Dean M. Kelley called deprogramming \"protracted spiritual gang-rape\".Dean Kelley, \"Deprogramming and Religious Liberty\", Civil Liberties Review 23 (July/August 1977)\n\nProcedures \n\nThere has never been a standard procedure among deprogrammers; descriptions in anecdotal reports, studies, and interviews with former deprogrammers vary greatly. Deprogrammers generally operate on the presumption that the people they are paid to extract from religious organizations are victims of mind control (or brainwashing). Books written by deprogrammers and exit counselors say that the most essential part of freeing the mind of a person is to convince the subject that he or she had been under the mental control of others.\n\nTed Patrick, one of the pioneers of deprogramming, used a confrontational method, enlisting psychiatrists and psychologists to assist him in the deprogramming process.24 T. Marshall L. Rev. 359 (1998-1999) Holy Wars: Involuntary Deprogramming as a Weapon against Cults; McAllister, Shawn Patrick was tried and convicted of multiple felonies related to kidnapping and unlawful imprisonment of deprogramming subjects.Price, Polly J. Regulation of religious proselytism in the United States. Brigham Young University Law Review. 2001 537-574.\n\nSylvia Buford, an associate of Ted Patrick who has assisted him on many deprogrammings, described five stages of deprogramming:(Stoner, C., & Parke, J. (1977). All God's children: The cult experience - salvation or slavery? Radrior, PA: Chilton )\n#Discredit the figure of authority: the cult leader\n#Present contradictions (ideology versus reality): \"How can he preach love when he exploits people?\" is an example.\n#The breaking point: When a subject begins to listen to the deprogrammer; when reality begins to take precedence over ideology.\n#Self-expression: When the subject begins to open up and voice gripes against the cult.\n#Identification and transference: when the subject begins to identify with the deprogrammers, starts to think as an opponent of the cult rather than as a member.\n\nViolence \n\nThe deprogramming accounts vary widely regarding the use of force, with the most dramatic accounts coming from deprogrammed people who returned to the group.\n\nSteven Hassan in his book Releasing the Bonds spoke against coercive deprogramming methods using force or threats.\n\nThe deprogramming case observed by Dubrow-Eichel did not include any violence.\n\nSociologist Eileen Barker wrote in [http://www.cesnur.org/2001/london2001/barker.htm Watching for Violence]:\n\"Although deprogramming has become less violent in the course of time ... Numerous testimonies by those who were subjected to a deprogramming describe how they were threatened with a gun, beaten, denied sleep and food and/or sexually assaulted. But one does not have to rely on the victims for stories of violence: Ted Patrick, one of the most notorious deprogrammers used by CAGs (who has spent several terms in prison for his exploits) openly boasts about some of the violence he employed; in November 1987, Cyril Vosper, a Committee member of the British cult-awareness group, FAIR, was convicted in Munich of \"causing bodily harm\" in the course of one of his many deprogramming attempts; and a number of similar convictions are on record for prominent members of CAGs elsewhere.\"\n\nIn Colombrito vs. Kelly, the Court accepted the definition of deprogramming by J. Le Moult published in 1978 in the Fordham Law Review:\n\"Deprogrammers are people who, at the request of a parent or other close relative, will have a member of a religious sect seized, then hold him against his will and subject him to mental, emotional, and even physical pressures until he renounces his religious beliefs. Deprogrammers usually work for a fee, which may easily run as high as $25,000. The deprogramming process begins with abduction. Often strong men muscle the subject into a car and take him to a place where he is cut off from everyone but his captors. He may be held against his will for upward of three weeks. Frequently, however, the initial deprogramming only last a few days. The subject's sleep is limited and he is told that he will not be released until his beliefs meet his captors' approval. Members of the deprogramming group, as well as members of the family, come into the room where the victim is held and barrage him with questions and denunciations until he recants his newly found religion \"\n\nDeprogrammer Carol Giambalvo writes in the 1998 text \"Deprogramming to Thought Reform Consultation\":\n\"It was believed that the hold of the brainwashing over the cognitive processes of a cult member needed to be broken – or \"snapped\" as some termed it – by means that would shock or frighten the cultist into thinking again. For that reason in some cases cult leader's pictures were burned or there were highly confrontational interactions between deprogrammers and cultist. What was often sought was an emotional response to the information, the shock, the fear, and the confrontation. There are horror stories – promoted most vehemently by the cults themselves – about restraint, beatings, and even rape. And we have to admit that we have met former members who have related to us their deprogramming experience – several of handcuffs, weapons wielded and sexual abuse. But thankfully, these are in the minority – and in our minds, never justified. Nevertheless, deprogramming helped to free many individuals held captive to destructive cults at a time when other alternatives did not seem viable.\"Giambalvo, Carol (November 1998). [http://www.csj.org/studyindex/studyintervention/study_deprog_threfrmconsult.htm Deprogramming to Thought Reform Consultation\"]. International Cultic Studies Association. Retrieved January 28, 2018.\n\nEffectiveness and harm\n\nAlan W. Gomes (chairman of the department of theology at Talbot School of Theology, Biola University) in his 2009 book Unmasking the Cults reports:\n  \nWhile advocates of the deprogramming position have claimed high rates of success, studies show that natural attrition rates actually are higher than the success rate achieved through deprogramming.Gomes, Alan W., Unmasking the Cults,\nZondervan Guide to Cults and Religious Movements, Zondervan, 2009\n, \n\nThe Dialog Center International (DCI) a major Christian counter-cult organization founded in 1973 by a Danish professor of missiology and ecumenical theology, Dr. Johannes Aagaard[http://www.cesnur.org/2007/aagaard.htm Obituary, 23 March 2007] rejects deprogramming, believing that it is counterproductive, ineffective, and can harm the relationship between a cult member and concerned family members.Exploring New Religions, George D. Chryssides, Continuum International Publishing Group, 2001, ,  , pages 353-254\n\nProfessor of psychiatry Saul Levine suggests that it is doubtful that deprogramming helps many people and goes on to say that it actually causes harm to the victim by very nature of the deprogramming. For deprogramming to work, the victim must be convinced that they joined a religious group against their will. They then must renounce responsibility and accept that in some mysterious way that their minds were controlled. It is Levine's professional opinion that once deprogrammed, a person would never be certain that they were really doing what they want. He states that deprogramming destroys a person's identity and is likely to create permanent anxiety about freedom of choice and leave the deprogrammed subject dependent upon the guidance and advice of others. \"Fundamentally deprogramming denies choice and creates dependency.  It robs people of their sense of responsibility.  Instead of encouraging people to accept that they made a mistake, it encourages people to deny their actions and blame others.\"Understanding Cults and New Age Religions, by Irving Hexham, Karla Poewe, and J. I. Packer\n\nGovernment\n\nDeprogramming activities often fall outside of the law. Government agencies have at times been aware and have taken part in deprogramming to enforce official views of \"correct\" beliefs and behaviors.  This can involve \"vigorous, even violent, efforts to dissuade people from participating in groups deemed unacceptable to the government\" and have been \"given legal sanction by the passage of laws that make illegal the activities or even the beliefs\nof the unpopular movement or group being targeted\".\n\nControversy and related issues\n\nIn the United States, from the mid-1970s and throughout the 1980s mind control was a widely accepted theory in public opinion, and the vast majority of newspaper and magazine accounts of deprogrammings assumed that recruits' relatives were well justified to seek conservatorships and to hire deprogrammers. It took nearly 20 years for public opinion to shift.\n\nOne aspect that gradually became disturbing from a civil rights point of view, was that relatives would use deception or other ethically questionable methods—even kidnapping—to get the recruit into deprogrammers' hands, without allowing the person any recourse to a lawyer or psychiatrist of their own choosing. Previously, there would be a sanity hearing first, and only then a commitment to an asylum or involuntary therapy. But with deprogramming, judges routinely granted parents legal authority over their adult children without a hearing.\n\nOne of main objections raised to deprogramming (as well as to exit counseling) is the contention that they begin with a false premise. Lawyers for some groups who have lost members due to deprogramming, as well as some civil libertarians, sociologists and psychologists, argue that it is not the religious groups but rather the deprogrammers who are the ones who deceive and manipulate people.\n\nDavid Bromley and Anson Shupe wrote:\n\nA number of factors contributed to the cessation of deprogramming:\n\nSome of the deprogrammed adults sued the deprogrammers or the relatives who had hired them.  Also in 1987, psychologist Margaret Singer became unusable as an expert witness after the American Psychological Association (APA) rejected her Deceptive and Indirect Methods of Persuasion and Control (DIMPAC) report.[https://books.google.com/books?id\ngmcjPkrGTQ8C&lpgPA54&ots\n335cDzpa_5&dq%22May%2011%2C%201987%22%20dimpac&pg\nPA54#vonepage&q\n%22May%2011,%201987%22%20dimpac&f=false May 11, 1987, APA MEMORANDUM]\n\nThe American Civil Liberties Union published a statement in 1977 which said:\n\nIn the 1980s in the United States, namely in New York (Deprogramming Bill, 1981), Kansas (Deprogramming Bill, 1982), and Nebraska (conservatorship legislation for 1985), lawmakers unsuccessfully attempted to legalize involuntary deprogramming.\n\nRev. Sun Myung Moon, founder of the Unification Church (many of whose members were targets of deprogramming) issued this statement in 1983:\n\nDuring the 1990s, deprogrammer Rick Ross was sued by Jason Scott, a former member of a Pentecostal group called the Life Tabernacle Church, after an unsuccessful deprogramming attempt. In 1995, the jury awarded Scott $875,000 in compensatory damages and $2,500,000 in punitive damages against Ross, which were later settled for $5,000 and 200 hours of services. More significantly, the jury also found that the leading anti-cult group known as the Cult Awareness Network was a co-conspirator in the crime and fined CAN $1,000,000 in punitive damages, forcing the group into bankruptcy.[http://www.cesnur.org/2001/CAN/02/01.htm Scott vs. Ross, Workman, Simpson.] Retrieved May 31, 2007. This case is often seen as effectively closing the door on the practice of involuntary deprogramming in the United States.\n\nReferral and kickback system\n\nAnti-cult groups play a central role in maintaining the underground network of communications, referrals, transportation, and housing necessary for continued deprogramming.\nDavis, D. and B. Hankins. 2003. New Religious Movements and Religious Liberty in America: Baylor University Press.\n\nGroups such as the Cult Awareness Network operated a referral scheme (NARDEC) in which they would refer people to deprogrammers in return for a 'kickback' in the form of a donation or as a commission.Shupe, A. and S.E. Darnell. 2011. Agents of Discord: Deprogramming, Pseudo-Science, and the American Anticult Movement: Transaction Publishers. Deprogrammers such as Rick Ross, Steven Hassan and Carol Giambalvo were amongst the CAN referred deprogrammers.\"The Cult Awareness Network and the Anticult Movement: Implications for NRMs in America\" (with Susan E. Darnell and Kendrick Moxon) in New Religious Movements and Religious Liberty in America. edited by Derek H. Davis and Barry Hankins. Waco: J.M.Dawson Institute of Church-State Studies and Baylor University Press, 2002. \n\nVictims\n\nIn 1974, Kathy Crampton—whose abduction and deprogramming were televised nationally—went back to the Love Family group several days after her apparently successful deprogramming. Patrick was charged with kidnapping, but acquitted with the reasoning: \"[w]here parents are, as here, of the reasonable and intelligent belief that they were not physically capable of recapturing their daughter from existing, imminent danger, then the defense of necessity transfers or transposes to the constituted agent, the person who acts upon their belief under such conditions. Here that agent is the Defendant Ted Patrick.\" (District Court of the United States 1974: 79; New York Times 1974).\n\nIn 1980, Susan Wirth, a 35-year-old teacher living in San Francisco, was abducted by her parents to be deprogrammed in reaction to her leftist political views and activities.  Patrick was paid $27,000 to carry out the deprogramming, which involved handcuffing her to a bed for two weeks and denying her food.Stephen Garrard Postpage, Inquiries in bioethics, 1993, Georgetwon University Press, , , page 71  She was later released and after returning to San Francisco spoke out against deprogramming but declined to press legal charges against her parents.\"Feared kidnapped, she reconciles with mother\", Merced Sun-Star, July 29, 1980\n\nIn 1980, Patrick was convicted of conspiracy, kidnapping, and false imprisonment for abducting and attempting to deprogram Roberta McElfish, a 26-year-old Tucson waitress. Patrick was sentenced to one year in prison and fined $5,000.\n\nIn 1981, Stephanie Riethmiller, who lived in Ohio, was kidnapped by deprogrammers hired by her parents to end her lesbian relationship. She was held against her will and repeatedly raped. After her release she filed civil charges against her parents and the deprogrammers, which were dismissed in a trial that generated some controversy in the media.Violence Against Lesbians and Gay Men, \nGary David Comstock, Columbia University Press (April 15, 1995)\n\n. page 201\n\nIn 1990, Patrick attempted to deprogram Elma Miller, an Amish woman who had joined a liberal sect. He was hired by her husband to return her to him and the Amish church. Criminal charges of conspiracy were filed against Miller's husband, brother, and two others but were later dropped on her request to the prosecuting attorney.Amish Woman Charges Deprogramming, Pittsburg Press, November 30, 1990, page 8Amish Woman Asks Prosecutor to Drop Charges on Kidnapping, Madison Courier, December 8, 1990, page 3\n\nDuring the 1990s, Rick Ross, a noted cult intervention advocate who took part in a number of deprogramming sessions, was sued by Jason Scott, a former member of a Pentecostalist group called the Life Tabernacle Church (part of United Pentecostal Church International), after an unsuccessful coercive deprogramming. The jury awarded Scott $875,000 in compensatory damages and $1,000,000 in punitive damages against the Cult Awareness Network (CAN), and $2,500,000 against Ross (later settled for $5,000 and 200 hours of services \"as an expert consultant and intervention specialist\").\n\nExit counseling\n\nDeprogramming and exit counseling, sometimes seen as one and the same, are distinct approaches to convincing a person to leave a cult. Some people blur the distinctions on purpose: some practitioners do so to avoid criticism; some opponents do so to intensify it.\n\nProponents of the distinction, however, state that deprogramming entails coercion and confinement, while exit counseling assures the subject of the freedom to leave at any time. Deprogramming typically costs $10,000 or more, mainly because of the expense of a security team. Exit counseling typically costs $2,000 to $4,000, including expenses, for a three- to five-day intervention, although cases requiring extensive research of little-known groups can cost much more (estimated in 1993). Deprogramming, especially when it fails, entails considerable legal and psychological risk (for example, a permanent alienation of the subject from his or her family). The psychological and legal risks in exit counseling are significantly reduced. Although deprogrammers do prepare families for the process, exit counselors tend to work with them directly, expecting those requesting the intervention to contribute more to the process; that is, exit counseling requires that families establish a reasonable and respectful level of communication with their loved one before the program itself can begin. Because deprogramming relies on coercion, which is illegal except in the case of conservatorship and is generally viewed as unethical, deprogrammers' critiques of the unethical practices of cults tend to be less credibility to the subject than the arguments of exit counselors.[http://www.iclnet.org/pub/resources/text/cri/cri-jrnl/web/crj0121a.html]\n\nSteven Hassan, author of the book Combatting Cult Mind Control, states that he took part in a number of deprogrammings in the late 1970s, and has spoken out against them since 1980.[http://www.freedomofmind.com/stevehassan/refuting/ Refuting the Disinformation Attacks Put Forth by Destructive Cults and their Agents], by Steven Hassan Hassan states that he has not participated in any deprogrammings since then, although on page 114 of Combatting, Hassan states that deprogrammings should be kept as a last resort if all other attempts fail to transform the individual. Hassan is one of the major proponents of exit counseling as a form of intercession, and he refers to his method as \"strategic intervention therapy\".\n\nIn popular culture\n\n* Faults, a 2014 drama movie about deprogramming\n* Holy Smoke!, a 1999 movie based on the book with the same name\n* Split Image, a 1982 movie about deprogramming \n* Deprogrammed, a 2015 Canadian documentary[http://www.eyesteelfilm.com/deprogrammed Deprogrammed]. EyeSteelFilm. 2015 (Montreal). Retrieved January 2018. Deprogramming. http://en.wikipedia.org/?curid=8960."
  }
}
