{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2328",
  "eid" : "bf7a6a40-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778400996,
  "textBody" : "Ayahuasca (,),  iowaska, or yagé, is an entheogenic brew made out of Banisteriopsis caapi vine and other ingredients. The brew is used as a traditional spiritual medicine in ceremonies among the Indigenous peoples of the Amazon basin.\n\nIt has been reported that some psychoactive effects can be felt from consuming the ayahuasca vine alone. The hallucinogen DMT will be digested in the stomach and remain inactive without the inclusion of a monoamine oxidase inhibitor (MAOI) such as Banisteriopsis caapi. Therefore, a combination of both a MAOI-containing plant and DMT-containing substance is necessary for full hallucinogenic effects.  The resulting brew is known by a number of different names (see below).\n\nNomenclature \n\nAyahuasca is known by many names throughout Northern South America and Brazil.\n\nAyahuasca is the hispanicized style spelling of a word in the Quechua languages, which are spoken in the Andean states of Ecuador, Bolivia, Peru, and Colombia. Speakers of Quechua languages or of the Aymara language may prefer the spelling ayawaska. This word refers both to the liana Banisteriopsis caapi, and to the brew prepared from it. In the Quechua languages, aya means \"spirit, soul\", \"corpse, dead body\", and waska means \"rope\" and \"woody vine\", \"liana\".Teofilo Laime Ajacopa, Diccionario Bilingüe Iskay simipi yuyayk'ancha, La Paz, 2007 (Quechua-Spanish dictionary) The word ayahuasca has been variously translated as \"liana of the soul\", \"liana of the dead\", and \"spirit liana\".[http://www.cairn.info/revue-psychotropes-2002-1-page-79.htm Ayahuasca : une synthèse interdisciplinaire]. . Psychotropes 1/2002 (Vol. 8), p. 79-113. .\n\nIn Brazil, the brew and the liana are informally called either caapi or cipó; the latter is the Portuguese word for liana (or woody climbing vine). In the União do Vegetal of Brazil, an organised spiritual tradition in which people drink ayahuasca, the brew is prepared exclusively from B. caapi and P. viridis. Adherents of União do Vegetal call this brew hoasca or vegetal.\n\nThe Achuar people and Shuar people of Ecuador and Peru call it natem, whereas the Sharanahua peoples of Peru call it shori.\n\nHistory \n\nIn the 16th century, Christian missionaries from Spain and Portugal first encountered indigenous South Americans using ayahuasca; their earliest reports described it as \"the work of the devil\".Reichel-Dolmatoff 1975, p. 48 as cited in Soibelman 1995, p. 14.  In the 20th century, the active chemical constituent of B. caapi was named telepathine, but it was found to be identical to a chemical already isolated from Peganum harmala and was given the name harmaline.  Beat writer William Burroughs read a paper by Richard Evans Schultes on the subject and while traveling through South America in the early 1950s sought out yagé in the hopes that it could relieve or cure opiate addiction (see The Yage Letters). Ayahuasca became more widely known when the McKenna brothers published their experience in the Amazon in True Hallucinations.  Dennis McKenna later studied pharmacology, botany, and chemistry of ayahuasca and oo-koo-he, which became the subject of his master's thesis.\n\nRichard Evans Schultes allowed for Claudio Naranjo to make a special journey by canoe up the Amazon River to study yage with the South American Indians. He brought back samples of this drug and published the first scientific description of the effects of its active alkaloids.\n\nIn Brazil, a number of modern religious movements based on the use of ayahuasca have emerged, the most famous of them being Santo Daime and the União do Vegetal (or UDV), usually in an animistic context that may be shamanistic or, more often (as with Santo Daime and the UDV), integrated with Christianity. Both Santo Daime and União do Vegetal now have members and churches throughout the world.  Similarly, the US and Europe have started to see new religious groups develop in relation to increased ayahuasca use.  Some Westerners have teamed up with shamans in the Amazon rainforest regions, forming ayahuasca healing retreats that claim to be able to cure mental and physical illness and allow communication with the spirit world.\n\nIn recent years, the brew has been popularized by Wade Davis (One River), English novelist Martin Goodman in I Was Carlos Castaneda,https://www.theguardian.com/books/2005/mar/19/featuresreviews.guardianreview3 Chilean novelist Isabel Allende, writer Kira Salak, author Jeremy Narby (The Cosmic Serpent), author Jay Griffiths (\"Wild: An Elemental Journey\"), American novelist Steven Peck, and radio personality Robin Quivers. It was also key to the plot of Season 18, Episode 18, \"Spellbound\" of Law & Order: Special Victims Unit.[https://allthingslawandorder.blogspot.com/2017/05/law-order-svu-spellbound-recap-review.html]\n\nPreparation \n\nSections of Banisteriopsis caapi vine are macerated and boiled alone or with leaves from any of a number of other plants, including Psychotria viridis (chacruna) or Diplopterys cabrerana (also known as chaliponga and chacropanga). The resulting brew may contain the powerful psychedelic drug DMT and MAO inhibiting harmala alkaloids, which are necessary to make the DMT orally active. The traditional making of ayahuasca follows a ritual process that requires the user to pick the lower chacruna leaf at sunrise then say a prayer. The vine must be \"cleaned meticulously with wooden spoons\" and pounded \"with wooden mallets until it's fibre.\" \n\nBrews can also be made with no DMT-containing plants; Psychotria viridis being substituted by plants such as Justicia pectoralis, Brugmansia, or sacred tobacco, also known as mapacho (Nicotiana rustica), or sometimes left out with no replacement. This brew varies radically from one batch to the next, both in potency and psychoactive effect, based mainly on the skill of the shaman or brewer, as well as other admixtures sometimes added and the intent of the ceremony.  Natural variations in plant alkaloid content and profiles also affect the final concentration of alkaloids in the brew, and the physical act of cooking may also serve to modify the alkaloid profile of harmala alkaloids.\n\nTraditional usage \n\nAyahuasca is used largely as a treasured sacrament.  People who work with ayahuasca in non-traditional contexts often align themselves with the philosophies and cosmologies associated with ayahuasca shamanism, as practiced among indigenous peoples like the Urarina of the Peruvian Amazon. While non-native users know of the spiritual applications of ayahuasca, a less well-known traditional usage focuses on the medicinal properties of ayahuasca. When used for its medicinal purposes, ayahuasca affects the human consciousness for less than six hours, beginning half an hour after consumption and peaking after two hours. Ayahuasca also has cardiovascular effects, moderately increasing  heart rate and diastolic blood pressure. In some cases, individuals experience significant psychological stress during the experience. It is for this reason that extreme caution should be taken with those who may be at risk of heart disease.\n\nThe psychedelic effects of ayahuasca include visual and auditory stimulation, the mixing of sensory modalities, and psychological introspection that may lead to great elation, fear, or illumination. Its purgative properties are important (known as la purga or \"the purge\"). The intense vomiting and occasional diarrhea it induces can clear the body of worms and other tropical parasites, and harmala alkaloids themselves have been shown to be anthelmintic.  Thus, this action is twofold; a direct action on the parasites by these harmala alkaloids (particularly harmine in ayahuasca) works to kill the parasites, and parasites are expelled through the increased intestinal motility that is caused by these alkaloids.\n\nDietary taboos are often associated with the use of ayahuasca. In the rainforest, these tend towards the purification of one's self – abstaining from spicy and heavily-seasoned foods, excess fat, salt, caffeine, acidic foods (such as citrus) and sex before, after, or during a ceremony. A diet low in foods containing tyramine has been recommended, as the speculative interaction of tyramine and MAOIs could lead to a hypertensive crisis. However, evidence indicates that harmala alkaloids act only on MAO-A, in a reversible way similar to moclobemide (an antidepressant that does not require dietary restrictions). Dietary restrictions are not used by the highly urban Brazilian ayahuasca church União do Vegetal, suggesting the risk is much lower than perceived and probably non-existent.\n\nRole of shamans \n\nShamans and experienced users of ayahuasca advise against consuming ayahuasca when not in the presence of one or several well-trained shamans.\n\nIn some areas, there are purported brujos (Spanish for 'Sorcerers') who masquerade as real shamans and who entice tourists to drink ayahuasca in their presence. Shamans believe one of the purposes for this is to steal one's energy and/or power, of which they believe every person has a limited stockpile.\n\nTraditional brew \n\nTraditional ayahuasca brews are usually made with Banisteriopsis caapi as an MAOI, although dimethyltryptamine sources and other admixtures vary from region to region.  There are several varieties of caapi, often known as different \"colors\", with varying effects, potencies, and uses.\n\nDMT admixtures:\n* Psychotria viridis (Chacruna)Rätsch, Christian (2005), pp. 704-708. The Encyclopedia of Psychoactive Plants: Ethnopharmacology and Its Applications. Rochester, Vermont: Park Street Press, 1998.  – leaves\n* Diplopterys cabrerana (Chaliponga, Chagropanga, Banisteriopsis rusbyana) – leaves\n* Psychotria carthagenensis (Amyruca) – leaves\n\nOther common admixtures:\n* Justicia pectoralis\n* Brugmansia (Toé)\n* Nicotiana rustica (Mapacho, variety of tobacco)\n* Ilex guayusa, a relative of yerba mate\n\nCommon admixtures with their associated ceremonial values and spirits:\n\n*Ayahuma bark: Dead head tree. Provides protection and is used in healing susto (soul loss from spiritual fright or trauma). \n*Capirona bark: Provides cleansing and protection. It is noted for its smooth bark, white flowers, and hard wood. \n*Chullachaki caspi bark (Brysonima christianeae): Provides cleansing to the physical body. Used to transcend physical body ailments.\n*Lopuna blanca bark: Provides protection. \n*Punga amarilla bark: Yellow Punga. Provides protection. Used to pull or draw out negative spirits or energies. \n*Remo caspi bark: Oar Tree. Used to move dense or dark energies.\n*Wyra (huaira) caspi bark (Cedrelinga catanaeformis): Air Tree. Used to create purging, transcend gastro/intestinal ailments, calm the mind, and bring tranquility. \n*Shiwawaku bark: Brings purple medicine to the ceremony. \n*Uchu sanango: Head of the sanango plants. \n*Huacapurana: Giant tree of the Amazon with very hard bark.\n\nNon-traditional usage \n\nIn the late 20th century, the practice of ayahuasca drinking began spreading to Europe, North America and elsewhere. The first ayahuasca churches, affiliated with the Brazilian Santo Daime, were established in the Netherlands. A legal case was filed against two of the Church's leaders, Hans Bogers (one of the original founders of the Dutch Santo Daime community) and Geraldine Fijneman (the head of the Amsterdam Santo Daime community). Bogers and Fijneman were charged with distributing a controlled substance (DMT); however, the prosecution was unable to prove that the use of ayahuasca by members of the Santo Daime constituted a sufficient threat to public health and order such that it warranted denying their rights to religious freedom under ECHR Article 9. The 2001 verdict of the Amsterdam district court is an important precedent. Since then groups that are not affiliated to the Santo Daime have used ayahuasca, and a number of different \"styles\" have been developed, including non-religious approaches.\n\nAyahuasca analogues \n\nIn modern Europe and North America, ayahuasca analogs are often prepared using non-traditional plants which contain the same alkaloids. For example, seeds of the Syrian rue plant can be used as a substitute for the ayahuasca vine, and the DMT-rich Mimosa hostilis is used in place of chacruna. Australia has several indigenous plants which are popular among modern ayahuasqueros there, such as various DMT-rich species of Acacia.\n\nThe name \"ayahuasca\" specifically refers to a botanical decoction that contains Banisteriopsis caapi. A synthetic version, known as pharmahuasca, is a combination of an appropriate MAOI and typically DMT. In this usage, the DMT is generally considered the main psychoactive active ingredient, while the MAOI merely preserves the psychoactivity of orally ingested DMT, which would otherwise be destroyed in the gut before it could be absorbed in the body. In contrast, traditionally among Amazonian tribes, the B.Caapi vine is considered to be the \"spirit\" of ayahuasca, the gatekeeper, and guide to the otherworldly realms.\n\nBrews similar to ayahuasca may be prepared using several plants not traditionally used in South America:\n\nDMT admixtures:\n* Acacia maidenii (Maiden's Wattle) *not all plants are \"active strains,\"  meaning some plants will have very little DMT and others larger amounts, Acacia phlebophylla, and other Acacias, most commonly employed in Australia – bark\n* Acacia obtusifolia Has a similar range to Acacia maidenii – bark\n* Anadenanthera peregrina, A. colubrina, A. excelsa, A. macrocarpa\n* Mimosa hostilis (Jurema) – root bark – not traditionally employed with ayahuasca by any existing cultures, though likely it was in the past  . Popular in Europe and North America.\n\nMAOI admixtures:\n* Harmal (Peganum harmala, Syrian rue) – seeds\n* Passion flower  \n* synthetic MAOIs, especially RIMAs\n\nChemistry and pharmacology \n\nHarmala alkaloids are MAO-inhibiting beta-carbolines. The three most studied harmala alkaloids in the B. caapi vine are harmine, harmaline and tetrahydroharmine. Harmine and harmaline are selective and reversible inhibitors of monoamine oxidase A (MAO-A), while tetrahydroharmine is a weak serotonin reuptake inhibitor (SRI).\n\nThis inhibition of MAO-A allows DMT to diffuse unmetabolized past the membranes in the stomach and small intestine, and eventually cross the blood–brain barrier (which, by itself, requires no MAO-A inhibition) to activate receptor sites in the brain. Without RIMAs or the non-selective, nonreversible monoamine oxidase inhibition by drugs like phenelzine and tranylcypromine, DMT would be oxidized (and thus rendered biologically inactive) by monoamine oxidase enzymes in the digestive tract.RIBA, J. Human Pharmacology of Ayahuasca. Doctoral Thesis: Universitat Autònoma de Barcelona, 2003.\n\nIndividual polymorphisms in the  cytochrome P450-2D6 enzyme affect the ability of individuals to metabolize harmine. Some natural tolerance to habitual use of ayahuasca (roughly once weekly) may develop through upregulation of the serotonergic system. A phase 1 pharmacokinetic study on ayahuasca (as Hoasca) with 15 volunteers was conducted in 1993, during the Hoasca Project. A review of the Hoasca Project has been published.\n\nEffects \n\nPeople who have consumed ayahuasca report having spiritual revelations regarding their purpose on earth, the true nature of the universe as well as deep insight into how to be the best person they possibly can. This is viewed by many as a spiritual awakening and what is often described as a rebirth.  In addition, it is often reported that individuals feel they gain access to higher spiritual dimensions and make contact with various spiritual or extra-dimensional beings who can act as guides or healers.\n\nAuthor Don Jose Campos claims that people may experience profound positive life changes subsequent to consuming ayahuasca.  Vomiting can follow ayahuasca ingestion; this purging is considered by many shamans and experienced users of ayahuasca to be an essential part of the experience, as it represents the release of negative energy and emotions built up over the course of one's life. Others report purging in the form of nausea, diarrhea, and hot/cold flashes.\n\nThe ingestion of ayahuasca can also cause significant, but temporary, emotional and psychological distress. Excessive use can lead to serotonin syndrome, with symptoms such as tremors, diarrhea, autonomic instability, hyperthermia, sweating, muscle spasms and possible death. Long-term negative effects are not known. A few deaths due to participation in the consumption of ayahuasca have been reported. Some of the deaths may have been due to unscreened preexisting heart conditions, interaction with drugs, such as antidepressants, recreational drugs, caffeine, or nicotine, or any of the various additional plants that are frequently added to brews.\n\nResearch developed by the Beckley Foundation suggests ayahuasca intake can lead to significant increases in mindfulness abilities and that ayahuasca can promote neurogenesis (the growth of new brain cells) in vitro.\n\nLegal status \n\nInternationally, DMT is a Schedule I drug under the Convention on Psychotropic Substances. The Commentary on the Convention on Psychotropic Substances notes, however, that the plants containing it are not subject to international control:\n\nThe cultivation of plants from which psychotropic substances are obtained is not controlled by the Vienna Convention. . . . Neither the crown (fruit, mescal button) of the Peyote cactus nor the roots of the plant Mimosa hostilis nor Psilocybe mushrooms themselves are included in Schedule 1, but only their respective principals, mescaline, DMT, and psilocin.\n\nA fax from the Secretary of the International Narcotics Control Board (INCB) to the Netherlands Ministry of Public Health sent in 2001 goes on to state that \"Consequently, preparations (e.g. decoctions) made of these plants, including ayahuasca, are not under international control and, therefore, not subject to any of the articles of the 1971 Convention.\"\n\nDespite the INCB's 2001 affirmation that ayahuasca is not subject to drug control by international convention, in its 2010 Annual Report the Board recommended that governments consider controlling (i.e. criminalizing) ayahuasca at the national level. This recommendation by the INCB has been criticized as an attempt by the Board to overstep its legitimate mandate and as establishing a reason for governments to violate the human rights (i.e., religious freedom) of ceremonial ayahuasca drinkers.\n\nThe legal status in the United States of DMT-containing plants is somewhat questionable. Ayahuasca plants and preparations are legal, as they contain no scheduled chemicals. However, brews made using DMT containing plants are illegal since DMT is a Schedule I drug.  That said, some people are challenging this, using arguments similar to those used by peyotist religious sects, such as the Native American Church. A court case allowing the União do Vegetal to import and use the tea for religious purposes in the United States, Gonzales v. O Centro Espirita Beneficente Uniao do Vegetal, was heard by the U.S. Supreme Court on November 1, 2005; the decision, released February 21, 2006, allows the UDV to use the tea in its ceremonies pursuant to the Religious Freedom Restoration Act. In a similar case an Ashland, Oregon-based Santo Daime church sued for their right to import and consume ayahuasca tea.  In March 2009, U.S. District Court Judge Panner ruled in favor of the Santo Daime, acknowledging its protection from prosecution under the Religious Freedom Restoration Act.\n\nReligious use in Brazil was legalized after two official inquiries into the tea in the mid-1980s, which concluded that ayahuasca is not a recreational drug and has valid spiritual uses.More on the legal status of ayahuasca can be found in the Erowid vault on the [http://www.erowid.org/chemicals/ayahuasca/ayahuasca_law.shtml legality of ayahuasca].\n\nIn France, Santo Daime won a court case allowing them to use the tea in early 2005; however, they were not allowed an exception for religious purposes, but rather for the simple reason that they did not perform chemical extractions to end up with pure DMT and harmala and the plants used were not scheduled.[https://web.archive.org/web/20060510000632/http://www.santodaime.it/Library/LAW/Francia/courdapeldeparis05_france.pdf Cour d'appel de Paris, 10ème chambre, section B,  dossier n° 04/01888.  Arrêt du 13 janvier 2005] Court of Appeal of Paris, 10th Chamber, Section B, File No. 04/01888. Judgement of 13 January 2005  Four months after the court victory, the common ingredients of ayahuasca as well as harmala were declared stupéfiants, or narcotic schedule I substances, making the tea and its ingredients illegal to use or possess.JO, 2005-05-03. [http://www.legifrance.gouv.fr/jopdf/common/jo_pdf.jsp?numJO0&dateJO\n20050503&numTexte18&pageDebut\n07636&pageFin=07636 Arrêté du 20 avril 2005 modifiant l'arrêté du 22 février 1990 fixant la liste des substances classées comme stupéfiants (PDF)] [Decree of 20 April 2005 amending the decree of 22 February 1990 establishing the list of substances scheduled as narcotics].\n\nIntellectual property issues \n\nAyahuasca has also stirred debate regarding intellectual property protection of traditional knowledge. In 1986 the US Patent and Trademarks Office allowed the granting of a patent on the ayahuasca vine B. Caapi. It allowed this patent based on the assumption that ayahuasca's properties had not been previously described in writing. Several public interest groups, including the Coordinating Body of Indigenous Organizations of the Amazon Basin (COICA) and the Coalition for Amazonian Peoples and Their Environment (Amazon Coalition) objected. In 1999 they brought a legal challenge to this patent which had granted a private US citizen \"ownership\" of the knowledge of a plant that is well-known and sacred to many indigenous peoples of the Amazon, and used by them in religious and healing ceremonies.\n\nLater that year the PTO issued a decision rejecting the patent, on the basis that the petitioners' arguments that the plant was not \"distinctive or novel\" were valid. However, the decision did not acknowledge the argument that the plant's religious or cultural values prohibited a patent. In 2001, after an appeal by the patent holder, the US Patent Office reinstated the patent. The law at the time did not allow a third party such as COICA to participate in that part of the reexamination process. The patent, held by US entrepreneur Loren Miller, expired in 2003.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ayahuasca" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2328" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ayahuasca (,),  iowaska, or yagé, is an entheogenic brew made out of Banisteriopsis caapi vine and other ingredients. The brew is used as a traditional spiritual medicine in ceremonies among the Indigenous peoples of the Amazon basin.\n\nIt has been reported that some psychoactive effects can be felt from consuming the ayahuasca vine alone. The hallucinogen DMT will be digested in the stomach and remain inactive without the inclusion of a monoamine oxidase inhibitor (MAOI) such as Banisteriopsis caapi. Therefore, a combination of both a MAOI-containing plant and DMT-containing substance is necessary for full hallucinogenic effects.  The resulting brew is known by a number of different names (see below).\n\nNomenclature \n\nAyahuasca is known by many names throughout Northern South America and Brazil.\n\nAyahuasca is the hispanicized style spelling of a word in the Quechua languages, which are spoken in the Andean states of Ecuador, Bolivia, Peru, and Colombia. Speakers of Quechua languages or of the Aymara language may prefer the spelling ayawaska. This word refers both to the liana Banisteriopsis caapi, and to the brew prepared from it. In the Quechua languages, aya means \"spirit, soul\", \"corpse, dead body\", and waska means \"rope\" and \"woody vine\", \"liana\".Teofilo Laime Ajacopa, Diccionario Bilingüe Iskay simipi yuyayk'ancha, La Paz, 2007 (Quechua-Spanish dictionary) The word ayahuasca has been variously translated as \"liana of the soul\", \"liana of the dead\", and \"spirit liana\".[http://www.cairn.info/revue-psychotropes-2002-1-page-79.htm Ayahuasca : une synthèse interdisciplinaire]. . Psychotropes 1/2002 (Vol. 8), p. 79-113. .\n\nIn Brazil, the brew and the liana are informally called either caapi or cipó; the latter is the Portuguese word for liana (or woody climbing vine). In the União do Vegetal of Brazil, an organised spiritual tradition in which people drink ayahuasca, the brew is prepared exclusively from B. caapi and P. viridis. Adherents of União do Vegetal call this brew hoasca or vegetal.\n\nThe Achuar people and Shuar people of Ecuador and Peru call it natem, whereas the Sharanahua peoples of Peru call it shori.\n\nHistory \n\nIn the 16th century, Christian missionaries from Spain and Portugal first encountered indigenous South Americans using ayahuasca; their earliest reports described it as \"the work of the devil\".Reichel-Dolmatoff 1975, p. 48 as cited in Soibelman 1995, p. 14.  In the 20th century, the active chemical constituent of B. caapi was named telepathine, but it was found to be identical to a chemical already isolated from Peganum harmala and was given the name harmaline.  Beat writer William Burroughs read a paper by Richard Evans Schultes on the subject and while traveling through South America in the early 1950s sought out yagé in the hopes that it could relieve or cure opiate addiction (see The Yage Letters). Ayahuasca became more widely known when the McKenna brothers published their experience in the Amazon in True Hallucinations.  Dennis McKenna later studied pharmacology, botany, and chemistry of ayahuasca and oo-koo-he, which became the subject of his master's thesis.\n\nRichard Evans Schultes allowed for Claudio Naranjo to make a special journey by canoe up the Amazon River to study yage with the South American Indians. He brought back samples of this drug and published the first scientific description of the effects of its active alkaloids.\n\nIn Brazil, a number of modern religious movements based on the use of ayahuasca have emerged, the most famous of them being Santo Daime and the União do Vegetal (or UDV), usually in an animistic context that may be shamanistic or, more often (as with Santo Daime and the UDV), integrated with Christianity. Both Santo Daime and União do Vegetal now have members and churches throughout the world.  Similarly, the US and Europe have started to see new religious groups develop in relation to increased ayahuasca use.  Some Westerners have teamed up with shamans in the Amazon rainforest regions, forming ayahuasca healing retreats that claim to be able to cure mental and physical illness and allow communication with the spirit world.\n\nIn recent years, the brew has been popularized by Wade Davis (One River), English novelist Martin Goodman in I Was Carlos Castaneda,https://www.theguardian.com/books/2005/mar/19/featuresreviews.guardianreview3 Chilean novelist Isabel Allende, writer Kira Salak, author Jeremy Narby (The Cosmic Serpent), author Jay Griffiths (\"Wild: An Elemental Journey\"), American novelist Steven Peck, and radio personality Robin Quivers. It was also key to the plot of Season 18, Episode 18, \"Spellbound\" of Law & Order: Special Victims Unit.[https://allthingslawandorder.blogspot.com/2017/05/law-order-svu-spellbound-recap-review.html]\n\nPreparation \n\nSections of Banisteriopsis caapi vine are macerated and boiled alone or with leaves from any of a number of other plants, including Psychotria viridis (chacruna) or Diplopterys cabrerana (also known as chaliponga and chacropanga). The resulting brew may contain the powerful psychedelic drug DMT and MAO inhibiting harmala alkaloids, which are necessary to make the DMT orally active. The traditional making of ayahuasca follows a ritual process that requires the user to pick the lower chacruna leaf at sunrise then say a prayer. The vine must be \"cleaned meticulously with wooden spoons\" and pounded \"with wooden mallets until it's fibre.\" \n\nBrews can also be made with no DMT-containing plants; Psychotria viridis being substituted by plants such as Justicia pectoralis, Brugmansia, or sacred tobacco, also known as mapacho (Nicotiana rustica), or sometimes left out with no replacement. This brew varies radically from one batch to the next, both in potency and psychoactive effect, based mainly on the skill of the shaman or brewer, as well as other admixtures sometimes added and the intent of the ceremony.  Natural variations in plant alkaloid content and profiles also affect the final concentration of alkaloids in the brew, and the physical act of cooking may also serve to modify the alkaloid profile of harmala alkaloids.\n\nTraditional usage \n\nAyahuasca is used largely as a treasured sacrament.  People who work with ayahuasca in non-traditional contexts often align themselves with the philosophies and cosmologies associated with ayahuasca shamanism, as practiced among indigenous peoples like the Urarina of the Peruvian Amazon. While non-native users know of the spiritual applications of ayahuasca, a less well-known traditional usage focuses on the medicinal properties of ayahuasca. When used for its medicinal purposes, ayahuasca affects the human consciousness for less than six hours, beginning half an hour after consumption and peaking after two hours. Ayahuasca also has cardiovascular effects, moderately increasing  heart rate and diastolic blood pressure. In some cases, individuals experience significant psychological stress during the experience. It is for this reason that extreme caution should be taken with those who may be at risk of heart disease.\n\nThe psychedelic effects of ayahuasca include visual and auditory stimulation, the mixing of sensory modalities, and psychological introspection that may lead to great elation, fear, or illumination. Its purgative properties are important (known as la purga or \"the purge\"). The intense vomiting and occasional diarrhea it induces can clear the body of worms and other tropical parasites, and harmala alkaloids themselves have been shown to be anthelmintic.  Thus, this action is twofold; a direct action on the parasites by these harmala alkaloids (particularly harmine in ayahuasca) works to kill the parasites, and parasites are expelled through the increased intestinal motility that is caused by these alkaloids.\n\nDietary taboos are often associated with the use of ayahuasca. In the rainforest, these tend towards the purification of one's self – abstaining from spicy and heavily-seasoned foods, excess fat, salt, caffeine, acidic foods (such as citrus) and sex before, after, or during a ceremony. A diet low in foods containing tyramine has been recommended, as the speculative interaction of tyramine and MAOIs could lead to a hypertensive crisis. However, evidence indicates that harmala alkaloids act only on MAO-A, in a reversible way similar to moclobemide (an antidepressant that does not require dietary restrictions). Dietary restrictions are not used by the highly urban Brazilian ayahuasca church União do Vegetal, suggesting the risk is much lower than perceived and probably non-existent.\n\nRole of shamans \n\nShamans and experienced users of ayahuasca advise against consuming ayahuasca when not in the presence of one or several well-trained shamans.\n\nIn some areas, there are purported brujos (Spanish for 'Sorcerers') who masquerade as real shamans and who entice tourists to drink ayahuasca in their presence. Shamans believe one of the purposes for this is to steal one's energy and/or power, of which they believe every person has a limited stockpile.\n\nTraditional brew \n\nTraditional ayahuasca brews are usually made with Banisteriopsis caapi as an MAOI, although dimethyltryptamine sources and other admixtures vary from region to region.  There are several varieties of caapi, often known as different \"colors\", with varying effects, potencies, and uses.\n\nDMT admixtures:\n* Psychotria viridis (Chacruna)Rätsch, Christian (2005), pp. 704-708. The Encyclopedia of Psychoactive Plants: Ethnopharmacology and Its Applications. Rochester, Vermont: Park Street Press, 1998.  – leaves\n* Diplopterys cabrerana (Chaliponga, Chagropanga, Banisteriopsis rusbyana) – leaves\n* Psychotria carthagenensis (Amyruca) – leaves\n\nOther common admixtures:\n* Justicia pectoralis\n* Brugmansia (Toé)\n* Nicotiana rustica (Mapacho, variety of tobacco)\n* Ilex guayusa, a relative of yerba mate\n\nCommon admixtures with their associated ceremonial values and spirits:\n\n*Ayahuma bark: Dead head tree. Provides protection and is used in healing susto (soul loss from spiritual fright or trauma). \n*Capirona bark: Provides cleansing and protection. It is noted for its smooth bark, white flowers, and hard wood. \n*Chullachaki caspi bark (Brysonima christianeae): Provides cleansing to the physical body. Used to transcend physical body ailments.\n*Lopuna blanca bark: Provides protection. \n*Punga amarilla bark: Yellow Punga. Provides protection. Used to pull or draw out negative spirits or energies. \n*Remo caspi bark: Oar Tree. Used to move dense or dark energies.\n*Wyra (huaira) caspi bark (Cedrelinga catanaeformis): Air Tree. Used to create purging, transcend gastro/intestinal ailments, calm the mind, and bring tranquility. \n*Shiwawaku bark: Brings purple medicine to the ceremony. \n*Uchu sanango: Head of the sanango plants. \n*Huacapurana: Giant tree of the Amazon with very hard bark.\n\nNon-traditional usage \n\nIn the late 20th century, the practice of ayahuasca drinking began spreading to Europe, North America and elsewhere. The first ayahuasca churches, affiliated with the Brazilian Santo Daime, were established in the Netherlands. A legal case was filed against two of the Church's leaders, Hans Bogers (one of the original founders of the Dutch Santo Daime community) and Geraldine Fijneman (the head of the Amsterdam Santo Daime community). Bogers and Fijneman were charged with distributing a controlled substance (DMT); however, the prosecution was unable to prove that the use of ayahuasca by members of the Santo Daime constituted a sufficient threat to public health and order such that it warranted denying their rights to religious freedom under ECHR Article 9. The 2001 verdict of the Amsterdam district court is an important precedent. Since then groups that are not affiliated to the Santo Daime have used ayahuasca, and a number of different \"styles\" have been developed, including non-religious approaches.\n\nAyahuasca analogues \n\nIn modern Europe and North America, ayahuasca analogs are often prepared using non-traditional plants which contain the same alkaloids. For example, seeds of the Syrian rue plant can be used as a substitute for the ayahuasca vine, and the DMT-rich Mimosa hostilis is used in place of chacruna. Australia has several indigenous plants which are popular among modern ayahuasqueros there, such as various DMT-rich species of Acacia.\n\nThe name \"ayahuasca\" specifically refers to a botanical decoction that contains Banisteriopsis caapi. A synthetic version, known as pharmahuasca, is a combination of an appropriate MAOI and typically DMT. In this usage, the DMT is generally considered the main psychoactive active ingredient, while the MAOI merely preserves the psychoactivity of orally ingested DMT, which would otherwise be destroyed in the gut before it could be absorbed in the body. In contrast, traditionally among Amazonian tribes, the B.Caapi vine is considered to be the \"spirit\" of ayahuasca, the gatekeeper, and guide to the otherworldly realms.\n\nBrews similar to ayahuasca may be prepared using several plants not traditionally used in South America:\n\nDMT admixtures:\n* Acacia maidenii (Maiden's Wattle) *not all plants are \"active strains,\"  meaning some plants will have very little DMT and others larger amounts, Acacia phlebophylla, and other Acacias, most commonly employed in Australia – bark\n* Acacia obtusifolia Has a similar range to Acacia maidenii – bark\n* Anadenanthera peregrina, A. colubrina, A. excelsa, A. macrocarpa\n* Mimosa hostilis (Jurema) – root bark – not traditionally employed with ayahuasca by any existing cultures, though likely it was in the past  . Popular in Europe and North America.\n\nMAOI admixtures:\n* Harmal (Peganum harmala, Syrian rue) – seeds\n* Passion flower  \n* synthetic MAOIs, especially RIMAs\n\nChemistry and pharmacology \n\nHarmala alkaloids are MAO-inhibiting beta-carbolines. The three most studied harmala alkaloids in the B. caapi vine are harmine, harmaline and tetrahydroharmine. Harmine and harmaline are selective and reversible inhibitors of monoamine oxidase A (MAO-A), while tetrahydroharmine is a weak serotonin reuptake inhibitor (SRI).\n\nThis inhibition of MAO-A allows DMT to diffuse unmetabolized past the membranes in the stomach and small intestine, and eventually cross the blood–brain barrier (which, by itself, requires no MAO-A inhibition) to activate receptor sites in the brain. Without RIMAs or the non-selective, nonreversible monoamine oxidase inhibition by drugs like phenelzine and tranylcypromine, DMT would be oxidized (and thus rendered biologically inactive) by monoamine oxidase enzymes in the digestive tract.RIBA, J. Human Pharmacology of Ayahuasca. Doctoral Thesis: Universitat Autònoma de Barcelona, 2003.\n\nIndividual polymorphisms in the  cytochrome P450-2D6 enzyme affect the ability of individuals to metabolize harmine. Some natural tolerance to habitual use of ayahuasca (roughly once weekly) may develop through upregulation of the serotonergic system. A phase 1 pharmacokinetic study on ayahuasca (as Hoasca) with 15 volunteers was conducted in 1993, during the Hoasca Project. A review of the Hoasca Project has been published.\n\nEffects \n\nPeople who have consumed ayahuasca report having spiritual revelations regarding their purpose on earth, the true nature of the universe as well as deep insight into how to be the best person they possibly can. This is viewed by many as a spiritual awakening and what is often described as a rebirth.  In addition, it is often reported that individuals feel they gain access to higher spiritual dimensions and make contact with various spiritual or extra-dimensional beings who can act as guides or healers.\n\nAuthor Don Jose Campos claims that people may experience profound positive life changes subsequent to consuming ayahuasca.  Vomiting can follow ayahuasca ingestion; this purging is considered by many shamans and experienced users of ayahuasca to be an essential part of the experience, as it represents the release of negative energy and emotions built up over the course of one's life. Others report purging in the form of nausea, diarrhea, and hot/cold flashes.\n\nThe ingestion of ayahuasca can also cause significant, but temporary, emotional and psychological distress. Excessive use can lead to serotonin syndrome, with symptoms such as tremors, diarrhea, autonomic instability, hyperthermia, sweating, muscle spasms and possible death. Long-term negative effects are not known. A few deaths due to participation in the consumption of ayahuasca have been reported. Some of the deaths may have been due to unscreened preexisting heart conditions, interaction with drugs, such as antidepressants, recreational drugs, caffeine, or nicotine, or any of the various additional plants that are frequently added to brews.\n\nResearch developed by the Beckley Foundation suggests ayahuasca intake can lead to significant increases in mindfulness abilities and that ayahuasca can promote neurogenesis (the growth of new brain cells) in vitro.\n\nLegal status \n\nInternationally, DMT is a Schedule I drug under the Convention on Psychotropic Substances. The Commentary on the Convention on Psychotropic Substances notes, however, that the plants containing it are not subject to international control:\n\nThe cultivation of plants from which psychotropic substances are obtained is not controlled by the Vienna Convention. . . . Neither the crown (fruit, mescal button) of the Peyote cactus nor the roots of the plant Mimosa hostilis nor Psilocybe mushrooms themselves are included in Schedule 1, but only their respective principals, mescaline, DMT, and psilocin.\n\nA fax from the Secretary of the International Narcotics Control Board (INCB) to the Netherlands Ministry of Public Health sent in 2001 goes on to state that \"Consequently, preparations (e.g. decoctions) made of these plants, including ayahuasca, are not under international control and, therefore, not subject to any of the articles of the 1971 Convention.\"\n\nDespite the INCB's 2001 affirmation that ayahuasca is not subject to drug control by international convention, in its 2010 Annual Report the Board recommended that governments consider controlling (i.e. criminalizing) ayahuasca at the national level. This recommendation by the INCB has been criticized as an attempt by the Board to overstep its legitimate mandate and as establishing a reason for governments to violate the human rights (i.e., religious freedom) of ceremonial ayahuasca drinkers.\n\nThe legal status in the United States of DMT-containing plants is somewhat questionable. Ayahuasca plants and preparations are legal, as they contain no scheduled chemicals. However, brews made using DMT containing plants are illegal since DMT is a Schedule I drug.  That said, some people are challenging this, using arguments similar to those used by peyotist religious sects, such as the Native American Church. A court case allowing the União do Vegetal to import and use the tea for religious purposes in the United States, Gonzales v. O Centro Espirita Beneficente Uniao do Vegetal, was heard by the U.S. Supreme Court on November 1, 2005; the decision, released February 21, 2006, allows the UDV to use the tea in its ceremonies pursuant to the Religious Freedom Restoration Act. In a similar case an Ashland, Oregon-based Santo Daime church sued for their right to import and consume ayahuasca tea.  In March 2009, U.S. District Court Judge Panner ruled in favor of the Santo Daime, acknowledging its protection from prosecution under the Religious Freedom Restoration Act.\n\nReligious use in Brazil was legalized after two official inquiries into the tea in the mid-1980s, which concluded that ayahuasca is not a recreational drug and has valid spiritual uses.More on the legal status of ayahuasca can be found in the Erowid vault on the [http://www.erowid.org/chemicals/ayahuasca/ayahuasca_law.shtml legality of ayahuasca].\n\nIn France, Santo Daime won a court case allowing them to use the tea in early 2005; however, they were not allowed an exception for religious purposes, but rather for the simple reason that they did not perform chemical extractions to end up with pure DMT and harmala and the plants used were not scheduled.[https://web.archive.org/web/20060510000632/http://www.santodaime.it/Library/LAW/Francia/courdapeldeparis05_france.pdf Cour d'appel de Paris, 10ème chambre, section B,  dossier n° 04/01888.  Arrêt du 13 janvier 2005] Court of Appeal of Paris, 10th Chamber, Section B, File No. 04/01888. Judgement of 13 January 2005  Four months after the court victory, the common ingredients of ayahuasca as well as harmala were declared stupéfiants, or narcotic schedule I substances, making the tea and its ingredients illegal to use or possess.JO, 2005-05-03. [http://www.legifrance.gouv.fr/jopdf/common/jo_pdf.jsp?numJO0&dateJO\n20050503&numTexte18&pageDebut\n07636&pageFin=07636 Arrêté du 20 avril 2005 modifiant l'arrêté du 22 février 1990 fixant la liste des substances classées comme stupéfiants (PDF)] [Decree of 20 April 2005 amending the decree of 22 February 1990 establishing the list of substances scheduled as narcotics].\n\nIntellectual property issues \n\nAyahuasca has also stirred debate regarding intellectual property protection of traditional knowledge. In 1986 the US Patent and Trademarks Office allowed the granting of a patent on the ayahuasca vine B. Caapi. It allowed this patent based on the assumption that ayahuasca's properties had not been previously described in writing. Several public interest groups, including the Coordinating Body of Indigenous Organizations of the Amazon Basin (COICA) and the Coalition for Amazonian Peoples and Their Environment (Amazon Coalition) objected. In 1999 they brought a legal challenge to this patent which had granted a private US citizen \"ownership\" of the knowledge of a plant that is well-known and sacred to many indigenous peoples of the Amazon, and used by them in religious and healing ceremonies.\n\nLater that year the PTO issued a decision rejecting the patent, on the basis that the petitioners' arguments that the plant was not \"distinctive or novel\" were valid. However, the decision did not acknowledge the argument that the plant's religious or cultural values prohibited a patent. In 2001, after an appeal by the patent holder, the US Patent Office reinstated the patent. The law at the time did not allow a third party such as COICA to participate in that part of the reexamination process. The patent, held by US entrepreneur Loren Miller, expired in 2003. Ayahuasca. http://en.wikipedia.org/?curid=2328."
  }
}
