{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16275",
  "eid" : "2529c1b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778571595,
  "textBody" : "Jakarta (,), officially the Special Capital Region of Jakarta, is the capital and largest city of Indonesia, which was formerly known as Batavia during Dutch East Indies and Sunda Kelapa during Sunda Kingdom. Located on the northwest coast of the world's most populous island of Java, Jakarta is the centre of economics, culture and politics of Indonesia, with a population of 10,075,310 . Greater Jakarta metropolitan area, which is known as Jabodetabek (a name formed by combining the initial syllables of Jakarta, Bogor, Depok, Tangerang and Bekasi), is the second largest urban agglomeration and 2nd largest city area in the world after Tokyo, with a population of 30,214,303 inhabitants  census.http://www.citypopulation.de/php/indonesia-jawa-admin.php Jakarta's business opportunities, as well as its potential to offer a higher standard of living, attract migrants from all over the Indonesian archipelago, making it a melting pot of many communities and cultures.Markus Taylor, Tales from the Big Durian, 2009 Jakarta is officially a province with special capital region status, yet is commonly referred to as a city. The Jakarta provincial government administers five administrative cities and one administrative regency.\n\nEstablished in the fourth century as Sunda Kelapa, the city became an important trading port for the Kingdom of Sunda. It was the de facto capital of the Dutch East Indies, and was known as Batavia at that time. The city is currently the seat of the ASEAN Secretariat as well as important financial institutions such as the Bank of Indonesia, the Indonesia Stock Exchange, and the corporate headquarters of numerous Indonesian companies and multinational corporations. As of 2017, six of Forbes Global 2000 companies have headquarters in the city. The city is also home for two Fortune 500 companies in 2016.Four Unicorn start up operates from their head office in Jakarta.\n\nJakarta is listed as an Alpha Global City in the 2016 report of Globalization and World Cities Research Network (GaWC). Based on the global metro monitor by the Brookings Institution, in 2014, the GDP of Jakarta was estimated at US$321.3 billion and economic growth was ranked 34th among the world's 200 largest cities. Jakarta has grown more rapidly than Kuala Lumpur, Bangkok and Beijing.\n\nMajor challenges for Jakarta among others are rapid urban growth that led to overpopulation and ecological breakdown, gridlock traffic and congestion, poverty and inequality, and flooding. The Indonesian capital is sinking up to 17 cm (6.7 inches) per year, which, coupled with the rising of sea level, has made the city prone to flooding.\n\nHistory\n\nNames and etymology\n\nJakarta has been home to multiple settlements along with their respective names: \n*Sunda Kelapa (397–1527), \n*Jayakarta (1527–1619), \n*Batavia (1619–1949), \n*Djakarta (1949–1972), and \n*Jakarta (1972–present).\n\nIts current name derives from the word Jayakarta. The origins of this word can be traced to the Old Javanese and ultimately to the Sanskrit language; जय jaya (victorious) and कृत krta (accomplished, acquired), thus \"Jayakarta\" translates as \"victorious deed\", \"complete act\", or \"complete victory\".\n\nJakarta is nicknamed the Big Durian, the thorny strongly-odored fruit native to the region, as the city is seen as the Indonesian equivalent of the US city of New York (the Big Apple). In the colonial era, the city was also known as Koningin van het Oosten (Queen of the Orient), initially in the 17th century for the urban beauty of downtown Batavia's canals, mansions and ordered city layout. Kampen, N.F. van (1831). Geschiedenis der Nederlanders buiten Europa, p. 291. Haarlem: De Erven François Bohn. After expanding to the south in the 19th century, this nickname came to be more associated with the suburbs (e.g. Menteng and the area around Merdeka Square), with their wide lanes, many green spaces and villas. \"Batavia zoals het weent en lacht\", (17 October 1939), Het Nieuws van den Dag voor Nederlandsch-Indië, p. 6\n\nPre-colonial era\n\nThe area in and around modern Jakarta was part of the fourth century Sundanese kingdom of Tarumanagara, one of the oldest Hindu kingdoms in Indonesia. Following the decline of Tarumanagara, its territories, including the Jakarta area, became part of the Hindu Kingdom of Sunda. From 7th to early 13th century port of Sunda was within the sphere of influence of the Srivijaya maritime empire. According to the Chinese source, Chu-fan-chi, written circa 1225, Chou Ju-kua reported in the early 13th century Srivijaya still ruled Sumatra, the Malay peninsula and western Java (Sunda). The source reports the port of Sunda as strategic and thriving, pepper from Sunda being among the best in quality. The people worked in agriculture and their houses were built on wooden piles. The harbour area became known as Sunda Kelapa (Sundanese: ᮞᮥᮔ᮪ᮓ ᮊᮜᮕ) and by the fourteenth century, it was a major trading port for the Sunda kingdom.\n\nThe first European fleet, four Portuguese ships from Malacca, arrived in 1513 when the Portuguese were looking for a route for spices. The Hindu Kingdom of Sunda made an alliance treaty with Portugal by allowing the Portuguese to build a port in 1522 to defend against the rising power of the Islamic Sultanate of Demak from central Java. In 1527, Fatahillah, a Javanese general from Demak attacked and conquered Sunda Kelapa, driving out the Portuguese. Sunda Kelapa was renamed Jayakarta, and became a fiefdom of the Sultanate of Banten which became a major Southeast Asia trading centre.\n\nThrough the relationship with Prince Jayawikarta from the Sultanate of Banten, Dutch ships arrived in Jayakarta in 1596. In 1602, the English East India Company's first voyage, commanded by Sir James Lancaster, arrived in Aceh and sailed on to Banten where they were allowed to build a trading post. This site became the centre of English trade in Indonesia until 1682.\n\nJayawikarta is thought to have made trading connections with the English merchants, rivals of the Dutch, by allowing them to build houses directly across from the Dutch buildings in 1615.\n\nColonial era\n\nWhen relations between Prince Jayawikarta and the Dutch deteriorated, Jayawikarta's soldiers attacked the Dutch fortress. Prince Jayawikarta's army and the English were defeated by the Dutch, in part owing to the timely arrival of Jan Pieterszoon Coen (J.P. Coen). The Dutch burned the English fort, and forced the English to retreat on their ships. The victory consolidated Dutch power and in 1619 they renamed the city Batavia.\nCommercial opportunities in the capital of the Dutch colony attracted Indonesian and especially Chinese and Arab immigrants. This sudden population increase created burdens on the city. Tensions grew as the colonial government tried to restrict Chinese migration through deportations. Following a revolt, 5,000 Chinese were massacred by the Dutch and natives on 9 October 1740 and the following year, Chinese inhabitants were moved to Glodok outside the city walls. At the beginning of the nineteenth century, around 400 Arabs and Moors lived in Batavia, a number which changed little during the following decades. Among the commodities traded, fabrics, especially imported cotton, batik and clothing worn by Arab communities.P. Nas, Jakarta-Batavia: Socio-cultural Essays, 2000\n\nThe city began to expand further south as epidemics in 1835 and 1870 caused more people to move away from the port. The Koningsplein, now Merdeka Square was completed in 1818, the housing park of Menteng was started in 1913, and Kebayoran Baru was the last Dutch-built residential area. By 1930 Batavia had more than 500,000 inhabitants,[http://countrystudies.us/indonesia/13.htm Colonial Economy and Society, 1870–1940]. Source: U.S. Library of Congress. including 37,067 Europeans.\n\nAfter World War II, the city of Batavia was renamed \"Jakarta\" (a short form of Jayakarta) by the Indonesian nationalists after achieving independence from the Dutch in 1949.\n\nIndependence era\n\nFollowing World War II, Indonesian Republicans withdrew from Allied-occupied Jakarta during their fight for Indonesian independence and established their capital in Yogyakarta. In 1950, once independence was secured, Jakarta was once again made the national capital. Indonesia's founding president, Sukarno, envisaged Jakarta as a great international city, and instigated large government-funded projects with openly nationalistic and modernist architecture. Projects included a clover-leaf highway, a major boulevard (Jalan MH Thamrin-Sudirman), monuments such as The National Monument, Hotel Indonesia, a shopping centre, and a new parliament building. In October 1965, Jakarta was the site of an abortive coup attempt in which 6 top generals were killed, precipitating a violent anti-communist purge in which half-a million people were killed, including many ethnic Chinese,\"[http://news.bbc.co.uk/1/hi/world/analysis/51981.stm Why ethnic Chinese are afraid]\". BBC News. 12 February 1998. and the beginning of Suharto's New Order. A monument stands where the generals' bodies were dumped.\n\nIn 1966, Jakarta was declared a \"special capital region\" (daerah khusus ibukota), thus gaining a status approximately equivalent to that of a province. Lieutenant General Ali Sadikin served as Governor from the mid-1960s commencement of the \"New Order\" through to 1977; he rehabilitated roads and bridges, encouraged the arts, built several hospitals, and a large number of new schools. He also cleared out slum dwellers for new development projects—some for the benefit of the Suharto family—and tried to eliminate rickshaws and ban street vendors. He began control of migration to the city to stem overcrowding and poverty.\n Foreign investment contributed to a real estate boom which changed the face of the city.\n\nThe boom ended with the 1997/98 East Asian Economic crisis putting Jakarta at the centre of violence, protest, and political manoeuvring. After 32 years in power, support for President Suharto began to wane. Tensions reached a peak when four students were shot dead at Trisakti University by security forces; four days of riots and violence ensued that killed an estimated 1,200, and destroyed or damaged 6,000 buildings. Much of the rioting targeted Chinese Indonesians.[http://www.businessweek.com/2000/00_41/b3702149.htm Wages of Hatred] . Michael Shari. Business Week. Suharto resigned as president, and Jakarta has remained the focal point of democratic change in Indonesia. Jemaah Islamiah-connected bombings occurred almost annually in the city between 2000 and 2005, with another bombing in 2009.\n\nAdministration\n\nGovernment\n\nThe name and status, as well as the governing system of Jakarta, has changed throughout its history. On March 5, 1942, the Japanese wrested Batavia from Dutch control and the city was named Jakarta (, in accordance with the special status that was assigned to the city). After the collapse of Japan, Indonesian nationalists declared independence on August 17, 1945,  and the government of Jakarta City was changed into the Jakarta National Administration in September, 1945. After the war, the Dutch name Batavia was internationally recognized until full Indonesian independence was achieved on December 27, 1949 and Jakarta was officially proclaimed the national capital of Indonesia.\n\nThis first government was led by a Mayor until the end of 1960, when the office was changed to that of a Governor. The last mayor of Jakarta was Sudiro, until he was replaced by Dr Sumarno as governor of the province. Based on Act No. 5 of 1974 relating to the Fundamentals of Regional Government, Jakarta was confirmed as the capital of Indonesia and one of Indonesia's 26 provinces in 1974 at that time. In August 2007, Jakarta held its first ever election to choose a governor, whereas previously the city's governors were elected by members of DPRD. The poll was part of a country-wide decentralisation drive, allowing for direct local elections in several areas.\n\nAt present, Jakarta is administratively equal to a province with special status as the capital of Indonesia. The executive heads of Jakarta are a Governor (instead of a mayor) and a Deputy Governor. As a province, the official name of Jakarta is Daerah Khusus Ibukota Jakarta ('Special Capital City District of Jakarta'), which is abbreviated to DKI Jakarta. The legislative branch of Jakarta is the People's regional representative council (DPRD). The Governor, Deputy Governor and 106 members of the DPRD, are all elected by direct election procedures.\n\nThe executive governance of Jakarta consists of five Administrative City/Kota Administratif, each headed by a Mayor – and one Administrative Regency/Kabupaten Administratif headed by a Regent/Bupati. Unlike other cities and regencies in Indonesia where the mayor or regent are elected by the people, Jakarta's mayors and regent are chosen by the Governor of Jakarta. Each city and regency is again divided into administrative districts.\n\nPolda Metro Jaya maintains the law, security and order of Jakarta. It is led by a Regional Chief of police Kapolda, who holds the rank of Inspector General of Police.\n\nMunicipal finances\n\nThe Jakarta provincial government, like all other provincial governments in Indonesia, relies on transfers from the central government for the bulk of budget income. Local (non-central government) sources of revenue are incomes from various taxes such as vehicle ownership and vehicle transfer fees among others.'Taxpayer money for the city', The Jakarta Post, 16 July 2011. The ability of the regional government to respond to the many problems of Jakarta is constrained by extremely limited finances. In 2013 the total budget available to the Jakarta regional government was approved at around Rp 50 trillion (about $US 5.2 billion), equivalent to around $US 380 per citizen. Priority areas of spending were listed as education, transport, flood control measures, environment programs, and various types of social spending (such as health and housing).Sita W. Dewi, '[http://www.thejakartapost.com/news/2013/01/29/council-approves-city-budget-2013-higher-proposed.html Council approves city budget for 2013, higher than proposed'], The Jakarta Post, 29 January 2013.\n\nIn recent years, the Jakarta provincial government has consistently run a surplus of between 15–20% of total planned spending, largely because of delays in procurement procedures and other inefficiencies in the spending process.Sita W. Dewi, '[http://www.thejakartapost.com/news/2013/12/09/jokowi-spends-less-provides-more-foke-say-observers.html Jokowi spends less, provides more than Foke, say observers'], The Jakarta Post, 9 December 2013. Regular underspending is a matter of frequent public comment but the legal and administrative blockages that cause the underspending problem seem very difficult to overcome.\n\nIndonesian Statistics Bureau: Jakarta in Figures[http://jakarta.bps.go.id/flip/jda2013/#/122/ Jakarta in Figures] \n\nAdministrative divisions of Jakarta\n\nJakarta consists of five Kota Administratif (Administrative cities/municipalities), each headed by a mayor – and a Kabupaten Administratif (Administrative regency). Each city and regency is again divided into districts/Kecamatan. The administrative cities/municipalities of Jakarta are:\n\n* Central Jakarta (Jakarta Pusat) is Jakarta's smallest city and home to most of Jakarta's administrative and political centre. It is divided into 8 administrative districts. It is characterised by large parks and Dutch colonial buildings. Landmarks include the National Monument (Monas), Istiqlal Mosque, Jakarta Cathedral, and museums.\n* West Jakarta (Jakarta Barat) has the highest concentration of small-scale industries in Jakarta. This city has 8 districts. The area includes Jakarta's Chinatown and Dutch colonial landmarks such as the Chinese Langgam building and Toko Merah. West Jakarta contains part of Jakarta Old Town.\n* South Jakarta (Jakarta Selatan), originally planned as a satellite city, is now the location of large upscale shopping centres and affluent residential areas. South Jakarta is again divided into 10 territorial districts. Jakarta Selatan functions as Jakarta's ground water buffer, but recently the green belt areas are threatened by new developments. Much of the CBD area of Jakarta is concentrated in Setiabudi, South Jakarta, bordering the Tanah Abang/Sudirman area of Central Jakarta.\n* East Jakarta (Jakarta Timur) territory is characterised by several industrial sectors. Also located in East Jakarta are Taman Mini Indonesia Indah and Halim Perdanakusuma International Airport. This city has 10 districts/kecamatan. \n* North Jakarta (Jakarta Utara) is the only city in Jakarta that is bounded by the sea (Java Sea). It is the location of the Tanjung Priok. Large-scale and medium-scale industries are concentrated in North Jakarta. North Jakarta contains part of Jakarta Old Town, formerly known as Batavia since the 17th century, and was the centre of VOC trade activity in Dutch East Indies. Also located in North Jakarta is Ancol Dreamland (Taman Impian Jaya Ancol), currently the largest integrated tourism area in South East Asia. North Jakarta is divided into 6 districts.\n\nThe only administrative regency (kabupaten) of Jakarta is:\n\n* Thousand Islands (Kepulauan Seribu), formerly a district within the city of North Jakarta, is a collection of 105 small islands located on the Java Sea. It has of high conservation value because of its unique and special ecosystems. Marine tourism, such as diving, water bicycling, and wind surfing, are the primary touristic activities in this territory. The main mode of transportation between the islands are speed boats or small ferries.\n\nGeography\n\nDKI Jakarta covers an area of 699.5 square kilometers, which is ranked 33rd among the provinces of Indonesia. Greater Jakarta metropolitan area has an area of 6,392 square kilometers, which extends into two of the bordering provinces of West Java and Banten. The Greater Jakarta area includes 3 bordering regencies (Bekasi Regency, Tangerang Regency and Bogor Regency) and five adjacent cities (Bogor, Depok, Bekasi, Tangerang and South Tangerang).\n\nTopography\n\nJakarta is situated on the northwest coast of Java, at the mouth of the Ciliwung River on Jakarta Bay, which is an inlet of the Java Sea. The northern part of Jakarta is plain land, some areas of which are below sea level and subject to frequent flooding. The southern parts of the city are hilly. It is one of only two Asian capital cities located in the southern hemisphere (the other is Dili, capital of Timor Leste). Officially, the area of the Jakarta Special District is 662 km2 of land area and 6977 km2 of sea area.Based on Governor Decree 2007, No. 171. taken from Statistics DKI Jakarta Provincial Office, Jakarta in Figures, 2008, BPS, the province of DKI Jakarta The Thousand Islands, which are administratively a part of Jakarta, are located in Jakarta Bay, north of the city.\n\nJakarta lies in a low and flat Alluvial plain, ranging from  with an average elevation of 8 m above sea level with historically extensive swampy areas. 40% of Jakarta, particularly the northern areas, is below sea level, while the southern parts are comparatively hilly. Thirteen rivers flow through Jakarta. They are: Ciliwung River, Kalibaru, Pesanggrahan, Cipinang, Angke River, Maja, Mookervart, Krukut, Buaran, West Tarum, Cakung, Petukangan, Sunter River and Grogol River. These rivers flow from the Puncak highlands to the south of the city, then across the city northwards towards the Java Sea. The Ciliwung River divides the city into the western and eastern districts.\n\nAll these rivers, combined with the wet season rains and insufficient drainage due to clogging, make Jakarta prone to flooding. Moreover, Jakarta is sinking about 5 to each year, even up to 20 cm in the northern coastal areas. To help cope with the threat from the sea, the Netherlands will give $4 million for a feasibility study to build a dike around Jakarta Bay. The ring dike will be equipped with a pumping system and retention areas to defend against seawater. Additionally, the dike will function as a toll road. The project will be built by 2025.[http://www.thejakartapost.com/news/2011/07/27/dutch-study-new-dike-jakarta-bay.html Dutch to study new dike for Jakarta Bay | The Jakarta Post] In January 2014, Central Government agreed to build 2 dams in Ciawi, Bogor and a  tunnel from Ciliwung River to Cisadane River to ease Jakarta floods. Construction costs will be paid for by the central government, but land acquisitions are the responsibility of the Jakarta Authority. Nowadays, an , with capacity 60 m3 per second, underground water tunnel between Ciliwung River and the East Flood Canal is being worked on to ease the Ciliwung River overflows.\n\nClimate\n\nJakarta has a tropical monsoon climate (Am) according to the Köppen climate classification system. The wet season in Jakarta covers the majority of the year, running from October through May. The remaining four months (June through September) constitute the city's drier season (each of these 4 months has an average monthly rainfall of less than 100 mm). Located in the western part of Java, Jakarta's wet season rainfall peak is January and February with average monthly rainfall of , and its dry season low point is August with a monthly average of .\n\nParks\n\nIn June 2011, Jakarta had only 10.5% green open spaces (Ruang Terbuka Hijau) and this has grown to 13.94% public green open spaces. Public parks are included in public green open spaces. By 2030, the administration also hope there is 16% private green open spaces. In a goal to develop a child friendly city and to provide green open spaces for citizens, Jakarta administration has targeted to build 300 Child Friendly Integrated Public Space (, abbreviated RPTRA) by 2017,  which is a public space in the form of green open spaces or parks equipped with playground, games, library, lactation room, and other facilities to serve the interests of communities around with CCTV surveillance.[http://news.detik.com/berita/2951941/mengenal-lebih-jauh-rptra-taman-multifungsi-di-sudut-sudut-ibu-kota Mengenal Lebih Jauh RPTRA, Taman Multifungsi di Sudut-Sudut Ibukota.] dari situs Detik[http://www.beritajakarta.com/read/10668/2017_DKI_Targetkan_Bangun_300_RPTRA#.VumTbBJ96u4 2017, DKI Targetkan Bangun 300 RPTRA.] dari situs Berita Jakarta\n*Merdeka Square () is an almost 1 km2 field housing the symbol of Jakarta, Monas or Monumen Nasional (National Monument) and is the largest city square in the world. The square was created by Dutch Governor-General Herman Willem Daendels (1810) and was originally named Koningsplein (King's Square). On 10 January 1993, President Soeharto started the beautification of the square. Several features including a deer park and 33 trees that represent the 33 provinces of Indonesia were added.\n*Lapangan Banteng (Buffalo Field) is located in Central Jakarta near Istiqlal Mosque, Jakarta Cathedral, and Jakarta Central Post Office. It is about 4.5 hectares. Initially it was called Waterlooplein and functioned as the ceremonial square during the Netherlands East Indies colonial period. A number of colonial monuments and memorials erected on the square during the colonial period were demolished during the Sukarno era. The most notable monument in the square is the Monumen Pembebasan Irian Barat (Monument of the Liberation of West Irian). During the 1970s and 1980s the park was used as a bus terminal. In 1993 the park was turned into a public space again. It has become a recreation place for people and is occasionally also used as an exhibition place or for other events. 'Jakarta Flona' (Flora dan Fauna), a flower and decoration plants and pet exhibition, is held in this park around August annually.\n\n*Taman Mini Indonesia Indah (Miniature Park of Indonesia), in East Jakarta, has 10 mini parks.\n*Suropati Park is located in Menteng, Central Jakarta. The park is surrounded by several Dutch colonial buildings. Taman Suropati was known as Burgemeester Bisschopplein during the Dutch colonial time. The park is circular shaped with a surface area of . There are several modern statues in the park made by artists of ASEAN countries, which contributes to the nickname of the park Taman persahabatan seniman ASEAN ('Park of the ASEAN artists friendship'). \n*Menteng Park and the Situ Lembang pond - Menteng Park was built on the site of the former Persija football stadium.\n*Kalijodo Park is the newest park in the city at Penjaringan subdistrict, with  of land area besides the Krendang River which formally opened on 22 February 2017. The park is open 24 hours as a green open space (RTH) and child-friendly integrated public space (RPTRA) and has international-standard skateboard facilities. It is expected that the park can function as an iconic tourist location.\n*Muara Angke Wildlife Sanctuary and Angke Kapuk Nature Tourism Park at Penjaringan in North Jakarta.\n*Ragunan Zoo is located in Pasar Minggu, South Jakarta. It is the third oldest zoo in the world and is the second largest zoo in the world with the most diverse animal and plant populations.\n*Setu Babakan is a 32 hectare lake surrounded by Betawi cultural village, located at Jagakarsa, South Jakarta. \n*Ancol Dreamland is the largest integrated tourism area in South East Asia at present. It is located along the bay, at Ancol in North Jakarta.\n*Taman Waduk Pluit/Pluit Lake park at Pluit, North Jakarta, \n*Honda Park at Tebet, South Jakarta\n*Taman Langsat and Taman Ayodya in South Jakarta\n\nDemography\n\nPopulation\n\nSince 1950, Jakarta has attracted people from all parts of Java and other Indonesian islands. The flood of migrants came to Jakarta for economic reasons as Jakarta offered the hope of employment. The 1961 census showed only 51% of the city's population was actually born in Jakarta.Cybriwsky and Ford, City profile – Jakarta, 2001 Between 1961 and 1980, the population of Jakarta doubled and during the period 1980–1990, the city's population grew annually by 3.7%.archive.unu.edu [http://archive.unu.edu/unupress/unupbooks/uu11ee/uu11ee15.htm Jabotabek, the Jakarta metropolitan area]\n\nThe 2010 census counted some 9.58 million people, well above all government estimates.[http://www.thejakartapost.com/news/2010/08/28/after-census-city-plans-95-million.html \"After census city plans for 9.6 million\"]. Jakarta Pos According to the government's 'Jakarta in Figures' document, the population stood at 10,187,595 in 2011 and 9,761,407 in 2012.[http://jakarta.bps.go.id/flip/jda2013/#/144/ Jakarta in Figures, page 83]  As per 2014, the population stood at 10,075,310 people. The area of DKI Jakarta is 664 km2, suggesting a population density of 15,174 people/km2.[http://sti-india-uttoolkit.adb.org/mod2/se3/005_5.html BRT – CASE STUDY 5 – Annex 5 Case Studies and Lessons – Module 2: Bus Rapid Transit (BRT): Toolkit for Feasibility Studies]. Sti-india-uttoolkit.adb.org. Retrieved 12 June 2011. Inwards immigration tended to negate the effect of family planning programs. The population has risen from 4.5 million in 1970 doubled to 9.5 million in 2010, counting only its legal residents. While the population of Greater Jakarta (Jabodetabek Region) has risen from 8.2 million in 1970 jumping to 28.5 million in 2010.Puslitbang Ekonomi dan Pembangunan, Perubahan Pemanfaatan Tanah di Jabotabek, Jakarta: Lembaga Ilmu Pengetahuan Indonesia, 1998 As per 2014, the population of Greater Jakarta was 30,326,103, accounting for 11% of Indonesia's overall population.http://www.thejakartapost.com [http://www.thejakartapost.com/news/2011/03/26/population-growth-greater-jakarta-and-its-impact.html#sthash.bynCViBO.dpuf Population growth of Greater Jakarta and its impact] The gender ratio was 102.8 (males per 100 females) in 2010http://www.knoema.com [http://knoema.com/atlas/Indonesia/Jakarta-Special-City-District/Sex-Ratio Jakarta (Special City District) – Sex Ratio] and 101.3 in 2014.\n\nEthnicity and language\n\nJakarta is a pluralistic and religiously diverse city. As of 2000, 35.16%  of the city's population are Javanese, 27.65% Betawi, 15.27% Sundanese, 5.53% Chinese, 3.61% Batak, 3.18% Minangkabau and 1.62% Malays.Indonesia's Population: Ethnicity and Religion in a Changing Political Landscape. Institute of Southeast Asian Studies. 2003.  And as of 2010 Census, 36.17%  of the city's population are Javanese, 28.29% Betawi, 14.61% Sundanese, 6.62% Chinese, 3.42% Batak, 2.85% Minangkabau, 0.96% Malays and others 7.08%.\n\nThe 'Betawi' (Orang Betawi, or 'people of Batavia') are the descendants of the people living in and around Batavia, and are recognised as an ethnic group from around the 18th–19th century. The Betawi people are mostly descended from various Southeast-Asian ethnic groups brought or attracted to Batavia to meet labour needs, and include people from different parts of Indonesia.The Betawi – due to their diverse origins – play a major role concerning ethnic and national identity in contemporary Jakarta; see Knörr, Jacqueline: Kreolität und postkoloniale Gesellschaft. Integration und Differenzierung in Jakarta, Campus Verlag: Frankfurt a.M. & New York, 2007,  Betawi people are a creole ethnic group that came from various parts of Indonesia and intermarried with Chinese, Arabs, and Europeans.Rogelio Sáenz, David G. Embrick, Néstor P. Rodríguez; The International Handbook of the Demography of Race and Ethnicity, 2015 Nowadays, most Betawi form a minority in the city; most of them live in the fringe areas of Jakarta and there are hardly any Betawi-dominated areas in central Jakarta.Alessandra Iyer, Indonesian Performing Arts: Tradition and Transition, 2001\n\nThere has been a significant Chinese community in Jakarta for many centuries. Jakarta is home to the largest population of Chinese on Java island. The Chinese in Jakarta traditionally reside around old urban areas, such as Pinangsia, Pluit and Glodok (Jakarta Chinatown) areas. They also can be found in the old Chinatowns of Senen and Jatinegara. Officially, they make up 5.53% of the Jakarta population, although this number may be under-reported.\n\nThe Sumatran people of the city are very diverse. According to 2010 Census, there were roughly 346,000 Batak, 305,000 Minangkabau and 155,000 Malays. The Batak and Minangkabau are spread throughout the city. The Batak ethnic group has increased in ranking, from eighth in 1930 to fifth in 2000. Toba Batak is the largest sub-ethnic Batak group in Jakarta.Anthony Reid, Imperial Alchemy: Nationalism and Political Identity in Southeast Asia, 2010 Beside the Chinese, Minangkabau people also as merchants, peddlers, and artisans, in addition to working in white collar professions: doctors, teachers, and journalists.Board of Editors, Contributions to Southeast Asian Ethnography, 1987Mochtar Naim, Merantau: Causes and Effects of Minangkabau Voluntary Migration, 1971\n\nBahasa Indonesia is the official as well as the spoken language of Jakarta. English is used widely as second language, while a number of elderly people can speak Dutch. Each of the ethnic groups use their mother language at home, such as Betawi language, Javanese, Sundanese, Madurese, Batak, Minangkabau, and Chinese. Betawi language is distinct from those of the Sundanese or Javanese, forming itself as a language island in the surrounding area. The language is mostly based on the East Malay dialect and enriched by loan words from Dutch, Portuguese, Sundanese, Javanese, Minangkabau, Chinese, and Arabic. Nowadays, the Jakarta dialect (Bahasa Jakarta), used as a street language by people in Jakarta, is loosely based on the Betawi language.\n\nReligion\n\nAs of the 2010 census the population of Jakarta was 85.36% Muslim, 7.53% Protestant, 3.30% Buddhist, 3.15% Roman Catholic, 0.21% Hindu, and 0.06% Confucianist. The majority of Jakartans are Sunni Muslims.\n\nMost pesantrens in Jakarta are affiliated with the traditionalist Nahdlatul Ulama organisations.Pemerintah Provinsi Daerah Khusus Ibukota Jakarta, Ensiklopedi Jakarta: Culture & Heritage, Vol. 1, Dinas Kebudayaan dan Permuseuman, 2005 The modernist organisations mostly catered to a socioeconomic class of educated urban elites and merchant traders. They gave priority to education, social welfare programs and religious propagation activities.Donald Porter, Managing Politics and Islam in Indonesia, 2002 Many Islamic organisations have headquarters in Jakarta, such as Nahdlatul Ulama, Indonesian Ulema Council, Muhammadiyah, Jaringan Islam Liberal, and Front Pembela Islam.\n\nBased on data from Jakarta Central Bureau of Statistics 17 July 2017, shows that the population of Jakarta who embraced Islam is 83.43%, then Protestant 8.63%, Catholic 4.0%, Buddhist 3.74%, Hindu 0.19%, and Confucianist 0.01%, include Folk religion 231 people.\n\nRoman Catholics have a Metropolitan see there, for the Archdiocese of Jakarta, whose province including two suffragans Western Java.\n\nCulture\n\nAs the economic and political capital of Indonesia with so many different languages and ethnic groups, it is difficult to describe or define a common culture for Jakarta, as the city attracts many native immigrants, from the vast and diverse Indonesian archipelago, who also bring their various languages, dialects, foods and customs. This diversity of origins and languages leads to differences in regard to religion, traditions and linguistics. However ethnic Betawi are considered as the indigenous people of Jakarta.\n\nArts and festivals\n\nThe Betawi culture is distinct from those of the Sundanese or Javanese, forming itself as a language island in the surrounding area. Betawi arts have a low profile in Jakarta, and most Betawi have moved to the suburbs of Jakarta, displaced by new migrants. It is easier to find Java or Minang-based wedding ceremonies rather than Betawi weddings in Jakarta. It is easier to find Javanese Gamelan instead of Tanjidor (a mixture between Betawi and Portuguese music), Marawis (a mixture between Betawi and Yemeni music) or Gambang Kromong (a mixture between Betawi and Chinese music). The Chinese also influenced Betawi culture, such as the popularity of Chinese cakes and sweets, firecrackers, to Betawi wedding attire that demonstrates Chinese and Arab influences.\n\nHowever, some festivals such as the Jalan Jaksa Festival or Kemang Festival include efforts to preserve Betawi arts by inviting artists to give performances. Jakarta has several performing art centres, such as the classical concert hall Aula Simfonia Jakarta in Kemayoran, Taman Ismail Marzuki (TIM) art centre in Cikini, Gedung Kesenian Jakarta near Pasar Baru, Balai Sarbini in the Plaza Semanggi area, Bentara Budaya Jakarta in Palmerah area, Pasar Seni (Art Market) in Ancol, and traditional Indonesian art performances at the pavilions of some provinces in Taman Mini Indonesia Indah. Traditional music is often found at high-class hotels, including Wayang and Gamelan performances. Javanese Wayang Orang performances can be found at Wayang Orang Bharata theatre near Senen bus terminal. As the country's largest city and capital, Jakarta has lured much national and regional talent who hope to find a greater audience and more opportunities for success.\n\nJakarta hosts several prestigious art and culture festivals, and exhibitions, such as the annual Jakarta International Film Festival (JiFFest), Jakarta International Java Jazz Festival, Djakarta Warehouse Project, Jakarta Fashion Week, Jakarta Fashion & Food Festival (JFFF), Jakarta Fair, Indonesia Creative Products and Jakarta Arts and Crafts exhibition. Flona Jakarta is a flora-and-fauna exhibition, held annually in August at Lapangan Banteng Park, featuring flowers, plant nurseries, and pets. Jakarta Fair is held annually from mid-June to mid-July to celebrate the anniversary of the city and is largely centred around a trade fair. However, this month-long fair also features entertainment, including arts and music performances by local musicians. Jakarta International Java Jazz Festival (JJF) is one of the largest jazz festivals in the world and arguably the biggest in the Southern hemisphere. The annual jazz festival is held every early March and was designed to be one of the largest jazz festivals globally.\n\nSeveral foreign art and culture centres are also established in Jakarta, and mainly serve to promote culture and language through learning centres, libraries, and art galleries. Among these foreign art and cultural centres are China Confucius Institute, Netherlands Erasmus Huis, UK British Council, France Alliance Française, Germany Goethe-Institut, Japan Foundation, and India Jawaharlal Nehru Indian Cultural Center.\n\nFile:Mangga Dua Jakarta's Chinatown.jpg|Chinese paifang in Mangga Dua, Central Jakarta\nFile:Keong Emas.jpg|The Golden Snail IMAX theatre at Taman Mini Indonesia Indah\nFile:Teater Jakarta Taman Ismail Marzuki.JPG|Taman Ismail Marzuki, Central Jakarta\nFile:Gambir Expo Jakarta Fair.JPG|Jakarta Fair\n\nCuisine\n\nAs the capital, all varieties of Indonesian cuisine have a presence in Jakarta. The local cuisine of Jakarta is the Betawi cuisine, which reflects various foreign culinary traditions that have influenced the inhabitants of Jakarta for centuries. Betawi cuisine is heavily influenced by Malay-Chinese Peranakan cuisine, Sundanese and Javanese cuisine, which is also influenced by Indian, Arabic and European cuisines. One of the most popular local dishes of Betwai cuisine is Soto Betawi which is prepared from chunks of beef and offal in rich and spicy cow's milk or coconut milk broth. Other popular Betawi dishes include soto kaki, nasi uduk, kerak telor (spicy omelette), nasi ulam, asinan, ketoprak, rujak and gado-gado Betawi (salad in peanut sauce).\n\nJakarta has a vast range of food available at hundreds of eating venues and food courts located all over the city, from modest street-side warung foodstalls and kaki lima (five legs) travelling vendors to high-end fine dining restaurants. Since Jakarta is regarded as the 'melting-pot' and a miniature version of Indonesia, many traditional foods from far-flung regions in Indonesia can be found in Jakarta. For example, traditional Padang restaurants and low-budget Warteg (Warung Tegal) foodstalls are ubiquitous in the capital. Other popular street foods include nasi goreng (fried rice), sate (skewered meats), pecel lele (fried catfish), bakso (meatballs), bakpau (Chinese bun) and siomay (fish dumplings).\n\nJalan Sabang, Jalan Sidoarjo, Jalan Kendal at Menteng area, Kota Tua, Blok S, Blok M, Jalan Tebet are all popular destinations for street-food lovers. While Menteng, Kemang, Jalan Senopati, Kuningan, Senayan and Pantai Indah Kapuk, Kelapa Gading areas have trendy restaurants, cafe and bars. From rooftop bar to glamorous lounge, Jakarta has plenty of bars, cafes and clubs. From old town of Batavia with Indonesia’s Dutch colonial past to the fashionable Menteng district, the city has hive of live music venues and exclusive restaurants.\nLenggang Jakarta is a food court area built with a concept of culinary and cultural centre, accommodating small traders and street vendors with toilet, free WiFi facility and non-cash payment system.[http://travel.detik.com/read/2015/06/29/140837/2955101/1519/lenggang-jakarta-tempat-nongkrong-baru-di-monas Lenggang Jakarta Tempat Nongkrong Baru di Monas.] Detik This place is unique as most of the Indonesian food's are available within a single compound. At present there are two such food courts at Monas and Kemayoran area. TransJakarta operates free tour buses on every Saturday from 5PM to 11 PM to some of the most popular culinary destinations in Central Jakarta.Chinese street-food is plentifully available at Jalan Pangeran, Manga Besar and Petak Sembilan in the old Jakarta area, while Little Tokyo area of Blok M has many Japanese style restaurants and bars.\n\nNext to a myriad of Indonesian food and regional specialties from all over Indonesia, foreign food is also represented: Chinese, Japanese, Korean, Thai, Indian, American, French, Mediterranean cuisine's like Turkish, Italian, Middle-Eastern cuisine, and modern fusion food can all be found in Jakarta.\n\nMuseums\n\nThere are in total 142 museums in Jakarta. The museums in Jakarta cluster around the Central Jakarta Merdeka Square area, Jakarta Old Town, and Taman Mini Indonesia Indah.\n\nThe Jakarta Old Town contains museums that are former institutional buildings of Colonial Batavia. Some of these museums are: Jakarta History Museum (former City Hall of Batavia), Wayang Museum (Puppet Museum) (former Church of Batavia), the Fine Art and Ceramic Museum (former Court House of Justice of Batavia), the Maritime Museum (former Sunda Kelapa warehouse), Bank Indonesia Museum (former Javasche Bank), and Bank Mandiri Museum (former Nederlandsche Handels Maatschappij).\n\nSeveral museums clustered in central Jakarta around the Merdeka Square area include: National Museum of Indonesia which also known as Gedung Gajah (the Elephant Building), Monumen Nasional (National Monument), Istiqlal Islamic Museum in Istiqlal Mosque, and Jakarta Cathedral Museum on the second floor of Jakarta Cathedral. Also in the central Jakarta area is the Taman Prasasti Museum (former cemetery of Batavia), and Textile Museum in Tanah Abang area.\n\nThe recreational area of Taman Mini Indonesia Indah in East Jakarta contains fourteen museums, such as Indonesia Museum, Purna Bhakti Pertiwi Museum, Asmat Museum, Bayt al-Qur'an Islamic Museum, Pusaka (heirloom) Museum, and other science-based museum such as Research & Technology Information Centre, Komodo Indonesian Fauna Museum, Insect Museum, Petrol and Gas Museum, plus the Transportation Museum. Other museums are Satria Mandala Military Museum, Museum Sumpah Pemuda, and Lubang Buaya (Crocodile Well).\n\nMedia\n\nJakarta has numerous newspaper publications, television and radio stations. Several newspapers, including daily, business, and digital papers, are based in Jakarta. Daily newspapers include Kompas, Koran Tempo, Media Indonesia, Republika, Suara Pembaruan, Seputar Indonesia, Suara Karya, Sinar Harapan, Indo Pos, Jurnal Nasional, and Harian Pelita. English language newspapers are also published daily, for example The Jakarta Post and The Jakarta Globe. Chinese language newspapers are Indonesia Shang Bao (印尼商报), Harian Indonesia (印尼星洲日报), and Guo Ji Ri Bao (国际日报). The only Japanese language newspaper is The Daily Jakarta Shimbun (じゃかるた新聞). Jakarta has also the daily newspapers segment such as Pos Kota, Warta Kota, Koran Jakarta, Berita Kota for local readers; Bisnis Indonesia, Investor Daily, Kontan, Harian Neraca (business news) as well as Top Skor and Soccer (sport news).\n\nJakarta are the headquarters for Indonesia's state media public government stations, TVRI as well as private national television include Metro TV, tvOne, Kompas TV, Trans TV, Trans 7, RCTI, MNC, SCTV, Global TV, Indosiar, ANTV, RTV and NET..  Jakarta has also the local television channels such as Jak TV, O Channel, Elshinta TV, and DAAI TV Indonesia. The city is home to the country's main pay television service. The wide range of cable channels available includes First Media and TelkomVision. Satellite television (DTH) has yet to gain mass acceptance in Jakarta. Prominent DTH entertainment services are Indovision, Okevision, Yes TV, Transvision, and Aora TV. Many TV stations are analogue PAL, but some are now converting to digital signals using DVB-T2 following a government plan to digital television migration.[http://www.tvdigital.kominfo.go.id/berita/2-siaran-tv-digital.html TV Digital Indonesia – Siaran TV Digital]\n\nThere are seventy five radio stations in Jakarta, with fifty two broadcasting on the FM band, and twenty three radio stations broadcasting on the AM band.\n\nEconomy\n\nIndonesia is the largest economy of ASEAN and Jakarta is the economic nerve centre of Indonesian archipelago. The city generated about one-sixth of Indonesian GDP in 2008.Yukon Huang, Alessandro Magnoli Bocchi; Reshaping Economic Geography in East Asia, 2009 Nominal GDP of DKI Jakarta was US$483.8 billion in 2016, which is about 17.5% of the nominal GDP of Indonesia.\n Jakarta ranked 67th in Global Financial Centres Index 21 published by Z/Yen. The city ranks higher at 62 in Global Financial Centres Index 22, published in September, 2017. Jakarta ranked at 41 in Global Power City Index by The Mori Memorial Foundation in 2017.EIU’s recent survey ranked Jakarta at 8th among 45 cities in the world with the highest confidence in the environment for digital transformation, beating London, Madrid, New York, as well as its closest neighbor, Singapore.  \n\nJakarta's economy depends highly on service sectors, banking, trading, financial, and manufacturing. Most of industries in Jakarta include electronics, automotive, chemicals, mechanical engineering and biomedical sciences manufacturing. Head office of Bank Indonesia and Indonesia Stock Exchange located in the city. Most of the SOE like Pertamina, PLN, PGN, Angkasa Pura, BULOG, Telkomsel, Waskita operate from their head offices in the city. Also major Indonesian conglomerates maintains head office in Jakarta. Important conglomerates which have corporate office in the city are, Salim Group, Sinar Mas Group, Astra International, Lippo Group, Bakrie Group, Ciputra Group, Agung Podomoro Group, Unilever Indonesia, Djarum, Gudang Garam, Kompas Gramedia, Lion Air, Sriwijaya Air, MedcoEnergi, MNC, Trans Corp  and many more.\n\nThe economic growth of Jakarta in 2007 was 6.44% up from 5.95% the previous year, with the growth in the transportation and communication (15.25%), construction (7.81%) and trade, hotel and restaurant sectors (6.88%). In 2007, GRDP (Gross Regional Domestic Product) was Rp. 566 trillion (around $US 56 billion). The largest contributions to GRDP were by finance, ownership and business services (29%); trade, hotel and restaurant sector (20%), and manufacturing industry sector (16%). In 2007, the increase in per capita GRDP of DKI Jakarta inhabitants was 11.6% compared to the previous year Both GRDP by at current market price and GRDP by at 2000 constant price in 2007 for the Municipality of Central Jakarta, which was Rp 146 million and Rp 81 million, was higher than other municipalities in Jakarta. Last data update was on 2014 by end of year Jakarta have a GRDP (Gross Regional Domestic Product) was Rp. 1,761.407 trillion (around USD 148.53 billion) with economic growth above 6% per year since 2009. In 2014, per capita GRDP of DKI Jakarta inhabitants was Rp 174.87 million or USD 14,727. In 2015, GDP per capita in the city was estimated Rp 194.87 million or US$14,570.\n\nThe Wealth Report 2015 by Knight Frank reported that there were 24 individuals in Indonesia in 2014 with wealth at least one billion US Dollar and 18 of them live in the capital Jakarta. The cost of living in the city continues to rise. Both land price and rents has become expensive. Mercer’s 2017 Cost of Living Survey ranked Jakarta as 88th costliest city in the world for expatriate employees living. Industrial development and the construction of new housing are usually undertaken on the outskirts, while commerce and banking remain concentrated in the city centre.http://www.britannica.com [http://www.britannica.com/place/Jakarta Jakarta] Jakarta has a bustling luxury property market. The investment in the property sector, including offices, commercial buildings, new town development, and high rise apartments and hotels grew substantially. Knight Frank, a global real estate consultancy based in London, reported in 2014 that Jakarta offered the highest return on high-end property investment in the world in 2013, citing supply shortage and a sharply depreciated currency as reasons.Josua Gantan (13 February 2013). \"[http://www.thejakartaglobe.com/news/jakarta/jakarta-the-luxury-property-capital-of-the-world/ Jakarta: The Luxury Property Capital of the World\"], The Jakarta Globe, Retrieved 27 May 2014\n\nShopping\n\nJakarta has numerous shopping malls and markets. With a total of 550 hectares, Jakarta has the world's largest shopping mall floor area within a single city. The annual \"Jakarta Great Sale\" is held every year in June and July to celebrate Jakarta's anniversary, with about 73 participating shopping centres in 2012.\n\nMalls such as Plaza Indonesia, Grand Indonesia Shopping Town, Plaza Senayan, Senayan City and Pacific Place provide luxury brands, while Mall Taman Anggrek, Pondok Indah Mall, Mal Kelapa Gading, Central Park Jakarta, Bay Walk Mall and Ciputra World Jakarta have high-street brands such as Topshop, Uniqlo and Zara.\n\nDepartment stores in Senayan City, Supermall Karawaci and Lippo Mall Kemang Village use the Debenhams brand under licence, while the Japanese Sogo department store has about seven stores in various shopping malls in the city.http://sogo.co.id/stores/ Seibu flagship store is located in Grand Indonesia Shopping Town, and French luxury department store, Galeries Lafayette opened its doors for the first time in South East Asia in Pacific Place.\n\nInternationally known luxury brands such as Louis Vuitton, Bulgari, Chanel, Gucci, Christian Louboutin, Balenciaga, and Giorgio Armani can be found in Jakarta's luxury shopping malls. The Satrio-Casablanca corridor, 3.5-kilometre street is a new shopping belt in Jakarta.Kompas.com [http://properti.kompas.com/read/2009/03/20/06102484/Jalan.Satrio.Dijadikan.Shopping.Belt.Jakarta Jalan Satrio Dijadikan \"Shopping Belt\" Jakarta] Many multistorey shopping centres are located here, such as Kuningan City, Mal Ambassador, Kota Kasablanka, and Lotte Shopping Avenue.\n\nTraditional markets include Blok M, Tanah Abang, Senen, Pasar Baru, Glodok, Mangga Dua, Cempaka Mas, and Jatinegara. In Jakarta there are also markets that sell specific collectable items, such as antique goods in Surabaya Street and gemstones in Rawabening Market.\n\nTourism\n\nThough Jakarta has been named the most popular location as per tag stories and ranked 8th most posted among the cities in the world in 2017 on image sharing site Instagram,  the city is not a top international tourist destination till date unlike other neighboring Southeast Asian cities like Singapore, Kuala Lumpur and Bangkok. Most of the visitors attracted to Jakarta are domestic tourists from all over Indonesia.  Jakarta ranked as the fifth fastest growing destination among 132 cities according to MasterCard Global Destination Cities Index published in September, 2017. Those who were visiting, 59.1% for business, while the other 40.9% were visiting for leisure. According to Euromonitor International’s latest Top 100 City Destinations Ranking, Jakarta ranked at 83 with more than 3.5 million international tourists visited in a year, which is 48.5% higher in comparison to previous year.\n\nAs the gateway of Indonesia, Jakarta often serves as the stop-over for foreign visitors on their way to Indonesian popular tourist destinations such as Bali, Lombok and Yogyakarta. Jakarta is trying to attract more international tourist by MICE tourism, by arranging increasing numbers of conventions.  Slowly but steadily and gradually tourism contributes a growing amount of income to the city. In 2012, the tourism sector contributed 2.6 trillion rupiah (US$268.5 million) to the city's total direct income of 17.83 trillion rupiah (US$1.45 billion), 17.9% increase from the previous year 2011. Tourism stakeholders are expecting greater marketing of the Jakarta as a tourism destination.\n\nThe popular heritage tourism attractions are in Kota and around Merdeka square. Kota is the centre of old Jakarta, with its Maritime Museum, Kota Intan drawbridge, Gereja Sion, Wayang Museum, Stadhuis Batavia, Fine Art and Ceramic Museum, Toko Merah, Bank Indonesia Museum, Bank Mandiri Museum, Jakarta Kota Station, and Glodok (Jakarta Chinatown). In the old ports of Sunda Kelapa, the tall masted pinisi ship still sails. The Jakarta Cathedral with neo-gothic architecture in Central Jakarta also attracted architecture enthusiast. Kota Tua was named the most-visited destination in Indonesia in 2017 by image-sharing platform Instagram.\n\nOther than monuments, landmarks, and museums around Merdeka square and Jakarta Old Town, tourist attractions of the city include Thousand Islands, Taman Mini Indonesia Indah, Setu Babakan, Ragunan Zoo, Sunda Kelapa old port and the Ancol Dreamland complex on Jakarta Bay, including Dunia Fantasi (Fantasy World) theme park, Sea World, Atlantis Water Adventure, and Gelanggang Samudra. Thousand Islands, which is north to the coast of the city and in Java Sea is also a popular tourist destination.\n\nMost of the renowned international hotel chains have presence in the city. Jalan Jaksa and surrounding area is popular among backpackers for cheaper accommodation, travel agencies, second-hand bookstores, money changers, laundries, pubs, etc., while Kemang is a favorite suburb for expats living.\n\nInfrastructure\n\nRoad\n\nA structured road network had been developed in the early 19th century as a part of the Java Great Post Road by former Governor-General Daendels, which connects most major cities throughout Java. During the following decades, the road network was expanded to a great extent, although it could not keep up with the rapidly increasing numbers of motorised vehicles, resulting in highly congested traffic.\n\nA notable feature of Jakarta's present road system is the toll road network. Composed of an inner and outer ring road and five toll roads radiating outwards, the network provides inner as well as outer city connections. Jakarta Outer Ring Road 2 is an under-construction toll road encircling greater Jakarta area, parallel with Jakarta Outer Ring Road (JORR 1).\n\nThe five radiating toll roads are:\n*Prof. Dr. Sedyatmo Toll Road linking to Soekarno–Hatta International Airport\n*Jakarta–Tangerang Toll Road linking to Tangerang and further to Merak in the west\n*Jakarta–Serpong Toll Road linking to Serpong\n*Jagorawi Toll Road linking to Bogor and Ciawi in the south\n*Jakarta–Cikampek Toll Road linking to Bekasi and Cikampek in the east\n\nThroughout the years, several attempts have been made to reduce traffic congestion on Jakarta's main arteries. Implemented solutions include a 'three-in-one' rush-hour law, during which cars with fewer than three passengers are prohibited from driving on the main avenues. Another example is the ban on trucks passing main avenues during the day. In 2016, 'odd-even' policy was introduced which designated cars with either odd or even-numbered registration plates on a particular day. This aims to function as a transitional measure to alleviate traffic congestion until the future introduction of Electronic Road Pricing which would be more effective.\n\nWater supply\n\nTwo private companies, PALYJA and Aetra, provide piped water supply in the western and eastern half of Jakarta respectively under 25-year concession contracts signed in 1998. A public asset holding company called PAM Jaya owns the infrastructure. 80% of the water distributed in Jakarta comes through the West Tarum Canal system from Jatiluhur reservoir on the Citarum River 70 km southeast of the city. Water supply had been privatised by government of then President Suharto in 1998 to the French company Suez Environnement and the British company Thames Water International. Both foreign companies subsequently sold their concessions to Indonesian companies. Customer growth in the 7 first years of the concessions had been lower than before, despite substantial inflation-adjusted tariff increases during this period. In 2005 tariffs were frozen, leading the private water companies to cut down on investments.\n\nAccording to PALYJA in its western half of the concession the service coverage ratio increased substantially from 34% in 1998 to 59% in 2007 and 65% in 2010. According to data by the Jakarta Water Supply Regulatory Body, access in the eastern half of the city served by PTJ increased from about 57% in 1998 to about 67% in 2004, but stagnated after that. However, other sources cite much lower access figures for piped water supply to houses, excluding access provided through public hydrants: One study estimated access as low as 25% in 2005, while another source estimates it to be as low as 18.5% in 2011. Those without access to piped water supply get water mostly from wells that are often salty and polluted with bacteria. As of 2017, according to the Ministry of Energy and Mineral Resources, Jakarta has a crisis of clean water.\n\nHealthcare\n\nIndonesia’s healthcare system is lagging behind than neighboring countries, such as Singapore, Malaysia or Thailand, but capital Jakarta does have many of the country’s best-equipped private and public facilities. In January 2014, the Indonesian government launched Jaminan Kesehatan Nasional (JKN), a scheme to implement universal health care in Indonesia. It is expected that the entire population will be covered in 2019.http://www.csmonitor.com/World/Asia-Pacific/2014/0310/Indonesia-launches-world-s-largest-health-insurance-system\n\nHospitals in Jakarta are of a very good standard, however, they are in high demand and thus often overcrowded. There are many government run specialized hospitals as well as community hospitals Puskesmas in Jakarta. Private hospitals and clinics are the best option for healthcare services in Jakarta. Private healthcare sector has seen significant changes during last few years, as Indonesian government began allowing foreign investment in the private sector in 2010. While there are some private facilities that are run by nonprofit or religious organizations, most are for profit. There are many hospital chains with branches operating in the city, such as Siloam, Mayapada, Mitra Keluarga, Medika, Medistra, Hermina and many others.\n\nTransportation\n\nAs a metropolitan area of about 30 million people with limited rapid transit system Jakarta is strained by transportation problems. The city suffers a lack of urban public transport services due to prioritised development of road networks, which were mostly designed to accommodate private vehicles. According to the National Development Planning Agency, or Bappenas, traffic congestion in Greater Jakarta wastes about $7.4 billion each year due to the high number of motorcycles and cars on the roads. As of 2015, about 1.4 million commuters travel into the city centre from the outskirts of Jakarta. Based on the survey, 58 percent of these commuters use motorcycles, 12.8 percent use cars and only 27 percent use public transportation. In 2004, a study was undertaken to prepare a master-plan for an integrated public transport system within Greater Jakarta, which revealed the mode of transport among city dwellers.[Technical Report Table 1.3.2 of the Study on Integrated Transportation Master Plan for Jabodetabek (SITRAMP), undertaken by Pacific Consultants International and ALMEC Corporation on behalf of the Indonesian National Development Planning Agency (BAPPENAS) and the Japan International Cooperation Agency (JICA), 2004],Technical Report Tables 1.3.2 of the Study on Integrated Transportation Master Plan for Jabodetabek (SITRAMP), undertaken by Pacific Consultants International and ALMEC Corporation on behalf of the Indonesian National Development Planning Agency (BAPPENAS) and the Japan International Cooperation Agency (JICA), 2004.https://sustainabledevelopment.un.org/content/dsd/susdevtopics/sdt_pdfs/meetings2010/egm0310/presentation_Rini.pdf The city's 9.5% average annual growth rate of motorized vehicles far exceeds the 0.01% increase in road length between 2005 and 2010. As of 2010, public transportation in Jakarta serves only 56% of commuter trips.\n\nRoad transport\n\nElectronic road pricing\n\nDue to the city's acute gridlock, the Jakarta administration has decided to implement electronic toll collection in 10 districts: Tanah Abang, Menteng, Setiabudi, Tebet, Matraman, Senen, Gambir, Tambora, Sawah Besar and Taman Sari. The ERP was planned to be implemented in the three-in-one zone and along Jl. Rasuna Said in Kuningan by the first quarter of 2014, although by September 2016 the plan has not started. Vehicles passing through the ERP areas will be charged Rp 21,072.\n\nBus service\n\nThere are many bus terminals in the city, from where buses operate on numerous routes to connect neighborhoods within the city limit, to other areas of Greater Jakarta area and to cities across the island of Java. The biggest of the bus terminal is Pulo Gebang Bus Terminal, which is arguably the largest of its kind in Southeast Asia. Besides TransJakarta, other private owned bus systems like Kopaja, MetroMini, Mayasari Bakti and APTB also provide important services for Jakarta commuters with numerous routes throughout the city. Since January 2013, Jakarta Government has integrated Kopaja AC buses with TransJakarta feeder bus routes. For the future, Metromini AC bus it is also possible to enter TransJakarta bus lanes to enhance integrated bus rapid transit system.\n\nTraditional transports\n\n*Becak: In 1966, an estimated 160 thousand pedicabs (becak) operated in the city; as much as 15% of Jakarta's total workforce was engaged in becak driving. In 1971, becak were banned from major roads, and shortly thereafter the government attempted a total ban, which substantially reduced their numbers but did not eliminate them. A campaign to eliminate them succeeded in 1990 and 1991, but during the economic crisis of 1998, some returned amid less effective government attempts to control them.Azuma, Yoshifumi (2003). Urban peasants: beca drivers in Jakarta. Jakarta: Pustaka Sinar Harapan.\n*Auto rickshaw: Bajaj auto rikshaw provide local transportation in the back streets of some parts of the city. From the early 1940s to 1991 they were a common form of local transportation in the city.\n*Microbus: Angkot microbuses also play a major role in road transport of Jakarta. They operates in numerous routes to connect neighbourhoods of the city.\n\nTaxi Cabs\n\nPlenty of taxi cabs are available in the city. Many companies operate & maintain pools of different model of cars in own their brands. App-based taxi services also have wide presence.\n\nMotorcycle taxi/ojek\n\nAlthough ojeks are not an official form of public transport, they can be found throughout Indonesia and in Jakarta. They are especially useful when navigating crowded urban roads, narrow alleyways, heavy traffic and cramped locations that larger vehicles cannot reach.\n\nCity tour\n\nSince February 2014, the Jakarta Government provides free double-decker bus tours that offers sightseeing in Central Jakarta. The tourists can catch the double-decker bus — free of charge, in several designated bus stops in front of city's points of interest. The buses' route covers tourist attractions, such as Monas, Istiqlal Mosque, the Cathedral, National Museum, Sarinah, and Plaza Indonesia, as well as Grand Indonesia shopping centres. As 2016, there are 18 double-decker buses in Jakarta, and the service is expanded to include Kota Tua in the north and Gelora Bung Karno Stadium in Senayan area in the south, via Sudirman avenue.\n\nRail\n\nLong-distance railways and local tram services were first introduced during the Dutch colonial era. While the trams were replaced with buses in the post-colonial era, long-distance railways continued to connect the city to its neighbouring regions as well as cities throughout the island of Java. Main terminus for long distance train services are Gambir and Pasar Senen.  A commuter rail system KRL Jabodetabek connects areas within Greater Jakarta.  Major rail stations of commter line are Jakarta Kota, Jatinegara, Tanah Abang, Duri, Pasar Senen, Manggarai and Sudirman. High-speed railways are planned connecting Jakarta-Bandung and Jakarta-Surabaya.\n\nHigh speed rail \n\nThe first high-speed rail to connect Jakarta with Bandung is currently under construction which is expected to start operation in 2019. The contract was awarded to China. Both Japan and China contested as a potential contractor, but it was awarded to China mainly because of their proposal did not require Indonesian fiscal spending or government debt guarantees. The project cost was estimated to be US$5.5 billion. China Development Bank will fund 75 percent of the project. A joint venture company  PT Kereta Cepat Indonesia-China has formed by China Railway Group Limited (CREC) with a consortium of Indonesia's state-owned enterprises (SOEs) led by PT Wijaya Karya Tbk to develop the project.\n\nAnother project to upgrade of existing Jakarta-Surabaya route to high speed rail is undertaken in 2016. Priority was given to Japan this time who had been one of the biggest investors to Indonesia. The route is supposed to finish construction in 2019.\n\nRapid transit\n\nAt present rapid transit in Greater Jakarta consists of a BRT TransJakarta and commuter rail, KRL Jabodetabek and Soekarno-Hatta Airport Rail Link. Other transit systems, those are now being under construction are Jakarta MRT and Jakarta LRT, which are expected to be operational by 2018.\n\nBus rapid transit\n\nThe TransJakarta bus rapid transit service (known as Busway) was developed in the context of development reforms (or reformasi) and used Bogota's TransMilenio system as a model. Jakarta's first busway line, from Blok M to Jakarta Kota opened in January 2004 and as of 14 February 2013, twelve out of fifteen corridors are in use. TransJakarta has the world's longest bus rapid transit routes (210 km in length). So far TransJakarta serves total 80 routes (corridor, cross route & feeder route) at the end of 2016. Transjakarta owned more than 1,500 buses in the first three months of 2017 and targets to have 3,000 buses by the end of the year.\n\nCommuter rail\n\nKRL Jabodetabek or commonly known as Commuterline is a commuter rail system which serves commuters in Jakarta, Bogor, Depok, Tangerang, South Tangerang, and Bekasi. The commuter system was started in 2000. The number of passengers in 2014 reached 208 million, rising from 158 million in the previous year. About 280 million commuters used KRL Jabodetabek in the year of 2016. KRL Jabotabek serves all municipalities in Jakarta excluding the Thousand Islands, as well as Greater Jakarta region. Though during rush hours, the number of passengers greatly exceeds the system's capacity, and crowding is common. Currently KRL Jabotabek is the only rail-based transit system in Jakarta, as the mass rapid transit and light rail transit are still under construction.\n\nJakarta MRT\n\nAfter a long planning process by the government regarding the development of a mass rapid transit system in Indonesia's capital, the Jakarta Mass Rapid Transit infrastructure is currently under construction, with a north–south line between Kota and Lebak Bulus; and an east–west line, which will connect to the north–south line at Sawah Besar station. The Jakarta MRT will be a combination of subways and elevated rails. Preparation work started in April 2012,[http://www.thejakartapost.com/news/2012/04/28/preparation-work-mrt-begins.html Preparation work for MRT begins | The Jakarta Post] and groundbreaking was done in October 2013, with the first, 15.2 km-long line between Hotel Indonesia and Lebak Bulus scheduled to be operational by 2018, and the north–south line MRT network is scheduled to be operational by 2020. The total length of the network when complete will be approximately . The Jakarta city government decided on a rail-based system because of its ability to carry large numbers of people quickly and cheaply. , the mass rapid transit system has an investment of nearly US $1.7 billion to ease the capital's traffic issue in the coming years, including the construction of a subway.\n\nJakarta LRT\n\nPreviously there had been plans to build a monorail system and part of it was already under construction, but the project stalled in 2004 due to lack of funding. The monorail project was relaunched in 2013 and the groundbreaking was done in October 2013. However the project cancelled in January 2015, due to disagreements between the Jakarta administration and PT Jakarta Monorail over the monorail's route. By mid 2015, this project is finally abandoned by Jakarta Government and being replaced by light rail transit system.\n\nThe light rail transit (LRT) project was launched to replace the previously abandoned monorail project. Jakarta Light Rail Transit groundbreaking ceremony was held on 9 September 2015, with the first phase of the construction will connect Cibubur in East Jakarta with Dukuh Atas in downtown Central Jakarta, passing through Cawang intersection. This phase will be  long, which include 18 stations, and expected to be operated by the first half of 2018, prior to the 2018 Asian Games.\n\nSoekarno-Hatta Airport Rail Link\n\nThis is a commuter train service connecting the Soekarno-Hatta International Airport to the city centre. Another express train service is now under planning stage to connect Soekarno-Hatta International Airport with Halim Perdanakusuma Airport. Completion of this line is expected to be in 2019 at the earliest.\n\nAir\n\nSoekarno–Hatta International Airport (CGK) is the main airport serving the Greater Jakarta area. The airport is named after the first President of Indonesia, Soekarno, and the first Vice President of Indonesia, Mohammad Hatta. The airport is often called Cengkareng airport or Soetta by Indonesians. The airport's IATA code, CGK, originates from the name of the Cengkareng locality, Tangerang, Banten, although the location of this airport is located outside of the city, it is used as a gate out by the Jakartans and citizen of the surrounding areas, therefore at the main gate of the airport, there is an inscription \"Jakarta Airports\". Soekarno–Hatta International Airport was ranked as 8th busiest airport in the world by Airports Council International in 2013. Today the airport is running over capacity. After T3 Soekarno-Hatta Airport expansion has finished in May 2016, the total capacity of three terminals become 43 million passengers a year. T1 and T2 also will be revitalised, so all the three terminals finally will accommodate 67 million passengers a year.\n\nA second airport, Halim Perdanakusuma Airport (HLP) serves domestic flight of low cost airline, private and VIP/presidential flights. Other airports in the Jakarta metropolitan area include Pondok Cabe Airport and an airfield on Pulau Panjang, part of the Thousand Island archipelago (Kepulauan Seribu).\n\nWaterway\n\nSea\n\nJakarta's main seaport Port of Tanjung Priok serves many ferry connections to different parts of Indonesia. Port of Tanjung Priok is Indonesia's busiest port, and the 21st busiest port in the world in 2013, handling over 6.59 million TEUs.http://www.worldshipping.org [http://www.worldshipping.org/about-the-industry/global-trade/top-50-world-container-ports Top 50 world container ports] To boost the port capacity, two-phase \"New Tanjung Priok\" extension project is currently ongoing. When fully operational in 2023, it will triple existing annual capacity.\n\nThe port is also an important employer in the area, with more than 18,000 employees who provide services to more than 18,000 ships every year. The Port of Tanjung Priok has 20 terminals: general cargo, multipurpose terminal, scraps terminal, passenger terminal, dry bulk terminal, liquid bulk terminal, oil terminal, chemicals terminal and three container terminals, 76 berths, a quay length of , a total storage area of  and a storage capacity of 401,468 tonnes.[http://www.priokport.co.id/index.php?langeng&mod\nfasilitas&smod=pokok Port of Jakarta facilities]\n\nIn December 2011, Muara Angke Port was renovated for Rp 130 billion ($14.4 million) in a 3 hectare area. Muara Angke Port would then be used as a public port to Thousand Islands (Indonesia), while Marina Ancol Port would be used as a tourist port.\n\nRiver\n\nOn 6 June 2007, the city administration introduced the Waterway (officially Angkutan Sungai), a new river boat service along the Ciliwung River. However, because of the large amount of floating garbage which kept jamming the propeller, it is no longer in service. The varying water levels during the dry and wet seasons were also a contributing factor to the close-down.\n\nCityscape\n\nArchitecture\n\nJakarta has architecturally significant buildings in a wide range of styles spanning distinct historical and cultural periods. Architectural styles reflect Malay, Javanese, Arabic, Chinese and Dutch influences. The external influence gives a role in forming the architecture of the Betawi house. The houses were built of nangka wood (Artocarpus integrifolia) and comprised three rooms. The shape of the roof is reminiscent of the traditional Javanese joglo. There are six hundred  registered cultural heritage buildings in Jakarta.\n\nColonial buildings and structures in Jakarta include those that were constructed during the Dutch colonial period of Indonesia. The dominant styles of the Dutch colonial period can be divided into three periods: the Dutch Golden Age (17th to late 18th century), the transitional style period (late 18th century – 19th century), and Dutch modernism (20th century). Dutch colonial architecture in Jakarta is apparent in buildings such as houses or villas, churches, civic buildings, and offices, mostly concentrated in the Jakarta Old Town and Central Jakarta. Architects such as J.C. Schultze and Eduard Cuypers designed some significant buildings in Jakarta. Works of Schultze includes Jakarta Art Building, the Indonesia Supreme Court Building and Ministry of Finance Building, while Cuypers designed Bank Indonesia Museum and Bank Mandiri Museum.\n\nAt the early 20th century, most of the buildings in the Jakarta were built in Neo Renaissance style of Europe. By the 1920s, the architectural taste have begun to shift in favour of rationalism and modernist movement, particularly there was increasing art deco architecture. The elite suburbs Menteng, developed during the 1910s, was the city's first attempt at creating an ideal and healthy housing area for the middle class. The original houses had a longitudinal organisation of space, as well as overhanging eaves, large windows and open ventilation, all practical features for a tropical climate with a hint of modern art deco. It was developed by the private real estate company N.V. de Bouwploeg, established by P.A.J. Moojen.\n\nAfter independence, the process of nation building in Indonesia and demolishing the memory of Dutch colonialism was as important as the symbolic building of arterials, monuments, government buildings during the Sukarno era. The National Monument in Jakarta, designed by Sukarno, is Indonesia's beacon nationalism. In the early 1960s, Jakarta with Soviet Union funding providing infrastructure development for highways and super-scale cultural monuments as well as Senayan Sports Stadium. The parliament building features a hyperbolic shaped roof reminiscent of German rationalist and Corbusian design concepts. In 1996, Wisma 46 soars to height of 262 m with forty eight stories and its nib shaped top celebrates technology and symbolises stereoscopy.\n\nThe urban construction booms have continued in the 21st century and are shaping skylines in Jakarta. Golden Triangle of Jakarta is one of the fastest evolving CBD in Asia-Pacific region.  According to CTBUH and Emporis, there are 88 skyscrapers that reaches or exceeds the height of 150 m in Jakarta, which puts the city at the top 10 of world rankings. It has more buildings taller than 500 feet (150 m) than any other Southeast Asia's cities as well as southern hemisphere. At present Gama Tower with 310 meters tip height is the tallest building in Jakarta.\n\nLandmarks\n\nMost of Jakarta's landmarks, monuments and statues were built during the Sukarno era beginning in the 1960s, then completed in the Suharto era, while some originated in the colonial Dutch East Indies period.\n\nThe most famous Jakarta's landmark that become the symbol of the city is the 132 m obelisk of National Monument (Monumen Nasional or Monas) right in the centre of Merdeka Square. On its southwest corner stands a Mahabharata themed Arjuna Wijaya chariot statue and fountain. Further south through Jalan M.H. Thamrin, one of the main avenue of Jakarta, the Selamat Datang monument stands on the fountain in the centre of Hotel Indonesia roundabout. Other landmarks include the Istiqlal Mosque, the Jakarta Cathedral and Immanuel Church. The former Batavia Stadhuis, Sunda Kelapa port in Jakarta Old Town is also the city's landmark. Gama Tower building at Jalan H.R. Rasuna Said, South Jakarta is currently the tallest building in Indonesia.\n\nSome of statues and monuments in Jakarta are nationalist, such as the West Irian Liberation monument, Youth statue and Dirgantara statue. Several Indonesian national heroes are commemorated in statues, such as Diponegoro and Kartini statues in Merdeka Square, Sudirman and Thamrin statues located in each respectable avenues, also Sukarno and Hatta statues in Proclamation Monument also on the entrance of Soekarno–Hatta International Airport.\n\nSports\n\nJakarta was host of the 1962 Asian Games and will host the upcoming 2018 Asian Games, co-hosted by Palembang. Jakarta also hosted the regional-scale Southeast Asian Games in 1979, 1987, 1997, and 2011 where it serves as supporting city for Palembang. Gelora Bung Karno Stadium, located in Central Jakarta, hosted the group stage, quarterfinal and final of 2007 AFC Asian Cup along with Malaysia, Thailand and Vietnam.\n\nJakarta's most popular home football club is Persija, which plays its matches in their home stadium at Bung Karno Stadium. The home match of Persija often draws its large fanbase – The Jak, usually clad in Persija's typical orange kit – to watch the match in the main stadium. The large number of spectators flocking to the main stadium usually worsen the traffic congestion in Jakarta. Another football team in Jakarta is Persitara who compete in Liga Indonesia Premier Division and play its games in Kamal Muara Stadium. Kamal, North Jakarta.\n\nThe biggest stadium in Jakarta is Gelora Bung Karno Stadium, with a capacity of 88,083 seats. The Senayan sports complex has several sport venues, including the Bung Karno football stadium, Madya Stadium, Istora Senayan, aquatic arena, baseball field, basketball court, badminton court, a shooting range, several indoor and outdoor tennis court and a golf driving range. The Senayan complex was built in 1959 to accommodate the Asian Games in 1962. For basketball, the Kelapa Gading Sport Mall in Kelapa Gading, North Jakarta, with a capacity of 7,000 seats, is the home arena of the Indonesian national basketball team. The BritAma Arena serves as playground for Satria Muda Pertamina Jakarta, 2017 Runner-up of the Indonesian Basketball League.\n\nThe Jakarta Car-free Days are held weekly on Sunday on the main avenues of the city, Jalan Sudirman and Jalan Thamrin, from 6 am to 11 am. The briefer Car-Free Day which lasts from only 6 am to 9 am is held on every other Sunday. The event invites local pedestrians to do sports and exercise and have their activities on the streets that are normally full of cars and traffic. Along the road from the Senayan traffic circle on Jalan Sudirman, South Jakarta, to the \"Selamat Datang\" Monument at the Hotel Indonesia traffic circle on Jalan Thamrin, all the way north to the National Monument in Central Jakarta, cars are cleared out for pedestrians. Morning gymnastics, calisthenics and aerobic exercises, futsal games, jogging, bicycling, skateboarding, badminton, karate, on-street library, and musical performances take over the roads and the main parks in Jakarta.\n\nJakarta Marathon is said to be the \"biggest running event of Indonesia\". It is recognised by AIMS and IAAF. First established in 2013 to promote Jakarta as sports tourism city. In 2015 edition of marathon, more than 15,000 runners from 53 countries were participated.\n\nEducation\n\nJakarta is home to a number of universities, of which the University of Indonesia (UI) is the largest and oldest tertiary-level educational institution in Indonesia. It is a public institution with campuses in Salemba (central Jakarta) and in Depok to the south of Jakarta. Aside from the University of Indonesia, the three other public universities in Jakarta are: Syarif Hidayatullah State Islamic University Jakarta, the [http://www.unj.ac.id/ State University of Jakarta] (UNJ) and the [http://www.upnvj.ac.id/id.html University of Pembangunan Nasional \"Veteran\" Jakarta] (UPN \"Veteran\" Jakarta). Some major private universities in Jakarta are: Trisakti University, The Christian University of Indonesia, Mercu Buana University, Tarumanagara University, Atma Jaya Catholic University of Indonesia, Pelita Harapan University, [https://binus.ac.id/ Bina Nusantara University], [http://www.jayabaya.ac.id/ Jayabaya University], and [http://www.univpancasila.ac.id/ Pancasila University].\n\nSTOVIA (School tot Opleiding van Indische Artsen) was the first high school in Jakarta, established in 1851. As the largest city and the capital, Jakarta houses many students from around Indonesia, many of whom reside in dormitories or home-stay residences. For basic education, there are a variety of primary and secondary schools, tagged with public (national), private (national and bi-lingual national plus) and international schools. Four of the major international schools located in Jakarta are the Gandhi Memorial International School, [http://www.iics.sch.id/ IPEKA International Christian School], Jakarta Intercultural School and the British School Jakarta. Other international schools include the Jakarta International Korean School, Bina Bangsa School, [https://www.jms.sch.id/ Jakarta International Multicultural School], Australian International School, [http://nzis.school.nz/ New Zealand International School], Singapore International School, and Sekolah Pelita Harapan.\n\nInternational relations\n\nAs the capital city of Indonesia, Jakarta host numbers of embassies of foreign countries that has established diplomatic relations with Indonesia. Jakarta also serves as the seat of Association of Southeast Asian Nations (ASEAN) Secretariat; numbers of foreign countries has appointed their embassies also serving as the representative and mission for ASEAN, thus making Jakarta as the diplomatic capital of ASEAN.\n\nJakarta is also a member of the Asian Network of Major Cities 21 and the C40 Cities Climate Leadership Group.\n\nTwin towns – Sister cities\n\nJakarta signed sister city agreements with other cities, one of them is Casablanca, Morocco's largest city, that have signed sister city agreement on 21 September 1990. To promote friendship between two cities, Jalan Casablanca, a main avenue famous for its shopping and business centres in South Jakarta, was named after Jakarta's Moroccan sister city. Currently there is no street in Casablanca named after Jakarta, however on the other hand in Rabat, Morocco's capital city, an avenue was named after Sukarno, Indonesia's first president, to commemorate his visit in 1960 also as a token of friendship.\n\nAlso within sister cities co-operation, Jakarta has established partnership with Rotterdam of the Netherlands, especially on integrated urban water management, including capacity building and knowledge exchange. This co-operation is mainly because Jakarta and Rotterdam are dealing with similar problems; both cities lies in low-lying flat plain prone of flooding. Plus some of their areas lies below sea level, making an urban drainage system involving canals, dams and pumps is vital for both city. Jakarta seeks to learn from Rotterdam's expertise and experiences on water management.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jakarta" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16275" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jakarta (,), officially the Special Capital Region of Jakarta, is the capital and largest city of Indonesia, which was formerly known as Batavia during Dutch East Indies and Sunda Kelapa during Sunda Kingdom. Located on the northwest coast of the world's most populous island of Java, Jakarta is the centre of economics, culture and politics of Indonesia, with a population of 10,075,310 . Greater Jakarta metropolitan area, which is known as Jabodetabek (a name formed by combining the initial syllables of Jakarta, Bogor, Depok, Tangerang and Bekasi), is the second largest urban agglomeration and 2nd largest city area in the world after Tokyo, with a population of 30,214,303 inhabitants  census.http://www.citypopulation.de/php/indonesia-jawa-admin.php Jakarta's business opportunities, as well as its potential to offer a higher standard of living, attract migrants from all over the Indonesian archipelago, making it a melting pot of many communities and cultures.Markus Taylor, Tales from the Big Durian, 2009 Jakarta is officially a province with special capital region status, yet is commonly referred to as a city. The Jakarta provincial government administers five administrative cities and one administrative regency.\n\nEstablished in the fourth century as Sunda Kelapa, the city became an important trading port for the Kingdom of Sunda. It was the de facto capital of the Dutch East Indies, and was known as Batavia at that time. The city is currently the seat of the ASEAN Secretariat as well as important financial institutions such as the Bank of Indonesia, the Indonesia Stock Exchange, and the corporate headquarters of numerous Indonesian companies and multinational corporations. As of 2017, six of Forbes Global 2000 companies have headquarters in the city. The city is also home for two Fortune 500 companies in 2016.Four Unicorn start up operates from their head office in Jakarta.\n\nJakarta is listed as an Alpha Global City in the 2016 report of Globalization and World Cities Research Network (GaWC). Based on the global metro monitor by the Brookings Institution, in 2014, the GDP of Jakarta was estimated at US$321.3 billion and economic growth was ranked 34th among the world's 200 largest cities. Jakarta has grown more rapidly than Kuala Lumpur, Bangkok and Beijing.\n\nMajor challenges for Jakarta among others are rapid urban growth that led to overpopulation and ecological breakdown, gridlock traffic and congestion, poverty and inequality, and flooding. The Indonesian capital is sinking up to 17 cm (6.7 inches) per year, which, coupled with the rising of sea level, has made the city prone to flooding.\n\nHistory\n\nNames and etymology\n\nJakarta has been home to multiple settlements along with their respective names: \n*Sunda Kelapa (397–1527), \n*Jayakarta (1527–1619), \n*Batavia (1619–1949), \n*Djakarta (1949–1972), and \n*Jakarta (1972–present).\n\nIts current name derives from the word Jayakarta. The origins of this word can be traced to the Old Javanese and ultimately to the Sanskrit language; जय jaya (victorious) and कृत krta (accomplished, acquired), thus \"Jayakarta\" translates as \"victorious deed\", \"complete act\", or \"complete victory\".\n\nJakarta is nicknamed the Big Durian, the thorny strongly-odored fruit native to the region, as the city is seen as the Indonesian equivalent of the US city of New York (the Big Apple). In the colonial era, the city was also known as Koningin van het Oosten (Queen of the Orient), initially in the 17th century for the urban beauty of downtown Batavia's canals, mansions and ordered city layout. Kampen, N.F. van (1831). Geschiedenis der Nederlanders buiten Europa, p. 291. Haarlem: De Erven François Bohn. After expanding to the south in the 19th century, this nickname came to be more associated with the suburbs (e.g. Menteng and the area around Merdeka Square), with their wide lanes, many green spaces and villas. \"Batavia zoals het weent en lacht\", (17 October 1939), Het Nieuws van den Dag voor Nederlandsch-Indië, p. 6\n\nPre-colonial era\n\nThe area in and around modern Jakarta was part of the fourth century Sundanese kingdom of Tarumanagara, one of the oldest Hindu kingdoms in Indonesia. Following the decline of Tarumanagara, its territories, including the Jakarta area, became part of the Hindu Kingdom of Sunda. From 7th to early 13th century port of Sunda was within the sphere of influence of the Srivijaya maritime empire. According to the Chinese source, Chu-fan-chi, written circa 1225, Chou Ju-kua reported in the early 13th century Srivijaya still ruled Sumatra, the Malay peninsula and western Java (Sunda). The source reports the port of Sunda as strategic and thriving, pepper from Sunda being among the best in quality. The people worked in agriculture and their houses were built on wooden piles. The harbour area became known as Sunda Kelapa (Sundanese: ᮞᮥᮔ᮪ᮓ ᮊᮜᮕ) and by the fourteenth century, it was a major trading port for the Sunda kingdom.\n\nThe first European fleet, four Portuguese ships from Malacca, arrived in 1513 when the Portuguese were looking for a route for spices. The Hindu Kingdom of Sunda made an alliance treaty with Portugal by allowing the Portuguese to build a port in 1522 to defend against the rising power of the Islamic Sultanate of Demak from central Java. In 1527, Fatahillah, a Javanese general from Demak attacked and conquered Sunda Kelapa, driving out the Portuguese. Sunda Kelapa was renamed Jayakarta, and became a fiefdom of the Sultanate of Banten which became a major Southeast Asia trading centre.\n\nThrough the relationship with Prince Jayawikarta from the Sultanate of Banten, Dutch ships arrived in Jayakarta in 1596. In 1602, the English East India Company's first voyage, commanded by Sir James Lancaster, arrived in Aceh and sailed on to Banten where they were allowed to build a trading post. This site became the centre of English trade in Indonesia until 1682.\n\nJayawikarta is thought to have made trading connections with the English merchants, rivals of the Dutch, by allowing them to build houses directly across from the Dutch buildings in 1615.\n\nColonial era\n\nWhen relations between Prince Jayawikarta and the Dutch deteriorated, Jayawikarta's soldiers attacked the Dutch fortress. Prince Jayawikarta's army and the English were defeated by the Dutch, in part owing to the timely arrival of Jan Pieterszoon Coen (J.P. Coen). The Dutch burned the English fort, and forced the English to retreat on their ships. The victory consolidated Dutch power and in 1619 they renamed the city Batavia.\nCommercial opportunities in the capital of the Dutch colony attracted Indonesian and especially Chinese and Arab immigrants. This sudden population increase created burdens on the city. Tensions grew as the colonial government tried to restrict Chinese migration through deportations. Following a revolt, 5,000 Chinese were massacred by the Dutch and natives on 9 October 1740 and the following year, Chinese inhabitants were moved to Glodok outside the city walls. At the beginning of the nineteenth century, around 400 Arabs and Moors lived in Batavia, a number which changed little during the following decades. Among the commodities traded, fabrics, especially imported cotton, batik and clothing worn by Arab communities.P. Nas, Jakarta-Batavia: Socio-cultural Essays, 2000\n\nThe city began to expand further south as epidemics in 1835 and 1870 caused more people to move away from the port. The Koningsplein, now Merdeka Square was completed in 1818, the housing park of Menteng was started in 1913, and Kebayoran Baru was the last Dutch-built residential area. By 1930 Batavia had more than 500,000 inhabitants,[http://countrystudies.us/indonesia/13.htm Colonial Economy and Society, 1870–1940]. Source: U.S. Library of Congress. including 37,067 Europeans.\n\nAfter World War II, the city of Batavia was renamed \"Jakarta\" (a short form of Jayakarta) by the Indonesian nationalists after achieving independence from the Dutch in 1949.\n\nIndependence era\n\nFollowing World War II, Indonesian Republicans withdrew from Allied-occupied Jakarta during their fight for Indonesian independence and established their capital in Yogyakarta. In 1950, once independence was secured, Jakarta was once again made the national capital. Indonesia's founding president, Sukarno, envisaged Jakarta as a great international city, and instigated large government-funded projects with openly nationalistic and modernist architecture. Projects included a clover-leaf highway, a major boulevard (Jalan MH Thamrin-Sudirman), monuments such as The National Monument, Hotel Indonesia, a shopping centre, and a new parliament building. In October 1965, Jakarta was the site of an abortive coup attempt in which 6 top generals were killed, precipitating a violent anti-communist purge in which half-a million people were killed, including many ethnic Chinese,\"[http://news.bbc.co.uk/1/hi/world/analysis/51981.stm Why ethnic Chinese are afraid]\". BBC News. 12 February 1998. and the beginning of Suharto's New Order. A monument stands where the generals' bodies were dumped.\n\nIn 1966, Jakarta was declared a \"special capital region\" (daerah khusus ibukota), thus gaining a status approximately equivalent to that of a province. Lieutenant General Ali Sadikin served as Governor from the mid-1960s commencement of the \"New Order\" through to 1977; he rehabilitated roads and bridges, encouraged the arts, built several hospitals, and a large number of new schools. He also cleared out slum dwellers for new development projects—some for the benefit of the Suharto family—and tried to eliminate rickshaws and ban street vendors. He began control of migration to the city to stem overcrowding and poverty.\n Foreign investment contributed to a real estate boom which changed the face of the city.\n\nThe boom ended with the 1997/98 East Asian Economic crisis putting Jakarta at the centre of violence, protest, and political manoeuvring. After 32 years in power, support for President Suharto began to wane. Tensions reached a peak when four students were shot dead at Trisakti University by security forces; four days of riots and violence ensued that killed an estimated 1,200, and destroyed or damaged 6,000 buildings. Much of the rioting targeted Chinese Indonesians.[http://www.businessweek.com/2000/00_41/b3702149.htm Wages of Hatred] . Michael Shari. Business Week. Suharto resigned as president, and Jakarta has remained the focal point of democratic change in Indonesia. Jemaah Islamiah-connected bombings occurred almost annually in the city between 2000 and 2005, with another bombing in 2009.\n\nAdministration\n\nGovernment\n\nThe name and status, as well as the governing system of Jakarta, has changed throughout its history. On March 5, 1942, the Japanese wrested Batavia from Dutch control and the city was named Jakarta (, in accordance with the special status that was assigned to the city). After the collapse of Japan, Indonesian nationalists declared independence on August 17, 1945,  and the government of Jakarta City was changed into the Jakarta National Administration in September, 1945. After the war, the Dutch name Batavia was internationally recognized until full Indonesian independence was achieved on December 27, 1949 and Jakarta was officially proclaimed the national capital of Indonesia.\n\nThis first government was led by a Mayor until the end of 1960, when the office was changed to that of a Governor. The last mayor of Jakarta was Sudiro, until he was replaced by Dr Sumarno as governor of the province. Based on Act No. 5 of 1974 relating to the Fundamentals of Regional Government, Jakarta was confirmed as the capital of Indonesia and one of Indonesia's 26 provinces in 1974 at that time. In August 2007, Jakarta held its first ever election to choose a governor, whereas previously the city's governors were elected by members of DPRD. The poll was part of a country-wide decentralisation drive, allowing for direct local elections in several areas.\n\nAt present, Jakarta is administratively equal to a province with special status as the capital of Indonesia. The executive heads of Jakarta are a Governor (instead of a mayor) and a Deputy Governor. As a province, the official name of Jakarta is Daerah Khusus Ibukota Jakarta ('Special Capital City District of Jakarta'), which is abbreviated to DKI Jakarta. The legislative branch of Jakarta is the People's regional representative council (DPRD). The Governor, Deputy Governor and 106 members of the DPRD, are all elected by direct election procedures.\n\nThe executive governance of Jakarta consists of five Administrative City/Kota Administratif, each headed by a Mayor – and one Administrative Regency/Kabupaten Administratif headed by a Regent/Bupati. Unlike other cities and regencies in Indonesia where the mayor or regent are elected by the people, Jakarta's mayors and regent are chosen by the Governor of Jakarta. Each city and regency is again divided into administrative districts.\n\nPolda Metro Jaya maintains the law, security and order of Jakarta. It is led by a Regional Chief of police Kapolda, who holds the rank of Inspector General of Police.\n\nMunicipal finances\n\nThe Jakarta provincial government, like all other provincial governments in Indonesia, relies on transfers from the central government for the bulk of budget income. Local (non-central government) sources of revenue are incomes from various taxes such as vehicle ownership and vehicle transfer fees among others.'Taxpayer money for the city', The Jakarta Post, 16 July 2011. The ability of the regional government to respond to the many problems of Jakarta is constrained by extremely limited finances. In 2013 the total budget available to the Jakarta regional government was approved at around Rp 50 trillion (about $US 5.2 billion), equivalent to around $US 380 per citizen. Priority areas of spending were listed as education, transport, flood control measures, environment programs, and various types of social spending (such as health and housing).Sita W. Dewi, '[http://www.thejakartapost.com/news/2013/01/29/council-approves-city-budget-2013-higher-proposed.html Council approves city budget for 2013, higher than proposed'], The Jakarta Post, 29 January 2013.\n\nIn recent years, the Jakarta provincial government has consistently run a surplus of between 15–20% of total planned spending, largely because of delays in procurement procedures and other inefficiencies in the spending process.Sita W. Dewi, '[http://www.thejakartapost.com/news/2013/12/09/jokowi-spends-less-provides-more-foke-say-observers.html Jokowi spends less, provides more than Foke, say observers'], The Jakarta Post, 9 December 2013. Regular underspending is a matter of frequent public comment but the legal and administrative blockages that cause the underspending problem seem very difficult to overcome.\n\nIndonesian Statistics Bureau: Jakarta in Figures[http://jakarta.bps.go.id/flip/jda2013/#/122/ Jakarta in Figures] \n\nAdministrative divisions of Jakarta\n\nJakarta consists of five Kota Administratif (Administrative cities/municipalities), each headed by a mayor – and a Kabupaten Administratif (Administrative regency). Each city and regency is again divided into districts/Kecamatan. The administrative cities/municipalities of Jakarta are:\n\n* Central Jakarta (Jakarta Pusat) is Jakarta's smallest city and home to most of Jakarta's administrative and political centre. It is divided into 8 administrative districts. It is characterised by large parks and Dutch colonial buildings. Landmarks include the National Monument (Monas), Istiqlal Mosque, Jakarta Cathedral, and museums.\n* West Jakarta (Jakarta Barat) has the highest concentration of small-scale industries in Jakarta. This city has 8 districts. The area includes Jakarta's Chinatown and Dutch colonial landmarks such as the Chinese Langgam building and Toko Merah. West Jakarta contains part of Jakarta Old Town.\n* South Jakarta (Jakarta Selatan), originally planned as a satellite city, is now the location of large upscale shopping centres and affluent residential areas. South Jakarta is again divided into 10 territorial districts. Jakarta Selatan functions as Jakarta's ground water buffer, but recently the green belt areas are threatened by new developments. Much of the CBD area of Jakarta is concentrated in Setiabudi, South Jakarta, bordering the Tanah Abang/Sudirman area of Central Jakarta.\n* East Jakarta (Jakarta Timur) territory is characterised by several industrial sectors. Also located in East Jakarta are Taman Mini Indonesia Indah and Halim Perdanakusuma International Airport. This city has 10 districts/kecamatan. \n* North Jakarta (Jakarta Utara) is the only city in Jakarta that is bounded by the sea (Java Sea). It is the location of the Tanjung Priok. Large-scale and medium-scale industries are concentrated in North Jakarta. North Jakarta contains part of Jakarta Old Town, formerly known as Batavia since the 17th century, and was the centre of VOC trade activity in Dutch East Indies. Also located in North Jakarta is Ancol Dreamland (Taman Impian Jaya Ancol), currently the largest integrated tourism area in South East Asia. North Jakarta is divided into 6 districts.\n\nThe only administrative regency (kabupaten) of Jakarta is:\n\n* Thousand Islands (Kepulauan Seribu), formerly a district within the city of North Jakarta, is a collection of 105 small islands located on the Java Sea. It has of high conservation value because of its unique and special ecosystems. Marine tourism, such as diving, water bicycling, and wind surfing, are the primary touristic activities in this territory. The main mode of transportation between the islands are speed boats or small ferries.\n\nGeography\n\nDKI Jakarta covers an area of 699.5 square kilometers, which is ranked 33rd among the provinces of Indonesia. Greater Jakarta metropolitan area has an area of 6,392 square kilometers, which extends into two of the bordering provinces of West Java and Banten. The Greater Jakarta area includes 3 bordering regencies (Bekasi Regency, Tangerang Regency and Bogor Regency) and five adjacent cities (Bogor, Depok, Bekasi, Tangerang and South Tangerang).\n\nTopography\n\nJakarta is situated on the northwest coast of Java, at the mouth of the Ciliwung River on Jakarta Bay, which is an inlet of the Java Sea. The northern part of Jakarta is plain land, some areas of which are below sea level and subject to frequent flooding. The southern parts of the city are hilly. It is one of only two Asian capital cities located in the southern hemisphere (the other is Dili, capital of Timor Leste). Officially, the area of the Jakarta Special District is 662 km2 of land area and 6977 km2 of sea area.Based on Governor Decree 2007, No. 171. taken from Statistics DKI Jakarta Provincial Office, Jakarta in Figures, 2008, BPS, the province of DKI Jakarta The Thousand Islands, which are administratively a part of Jakarta, are located in Jakarta Bay, north of the city.\n\nJakarta lies in a low and flat Alluvial plain, ranging from  with an average elevation of 8 m above sea level with historically extensive swampy areas. 40% of Jakarta, particularly the northern areas, is below sea level, while the southern parts are comparatively hilly. Thirteen rivers flow through Jakarta. They are: Ciliwung River, Kalibaru, Pesanggrahan, Cipinang, Angke River, Maja, Mookervart, Krukut, Buaran, West Tarum, Cakung, Petukangan, Sunter River and Grogol River. These rivers flow from the Puncak highlands to the south of the city, then across the city northwards towards the Java Sea. The Ciliwung River divides the city into the western and eastern districts.\n\nAll these rivers, combined with the wet season rains and insufficient drainage due to clogging, make Jakarta prone to flooding. Moreover, Jakarta is sinking about 5 to each year, even up to 20 cm in the northern coastal areas. To help cope with the threat from the sea, the Netherlands will give $4 million for a feasibility study to build a dike around Jakarta Bay. The ring dike will be equipped with a pumping system and retention areas to defend against seawater. Additionally, the dike will function as a toll road. The project will be built by 2025.[http://www.thejakartapost.com/news/2011/07/27/dutch-study-new-dike-jakarta-bay.html Dutch to study new dike for Jakarta Bay | The Jakarta Post] In January 2014, Central Government agreed to build 2 dams in Ciawi, Bogor and a  tunnel from Ciliwung River to Cisadane River to ease Jakarta floods. Construction costs will be paid for by the central government, but land acquisitions are the responsibility of the Jakarta Authority. Nowadays, an , with capacity 60 m3 per second, underground water tunnel between Ciliwung River and the East Flood Canal is being worked on to ease the Ciliwung River overflows.\n\nClimate\n\nJakarta has a tropical monsoon climate (Am) according to the Köppen climate classification system. The wet season in Jakarta covers the majority of the year, running from October through May. The remaining four months (June through September) constitute the city's drier season (each of these 4 months has an average monthly rainfall of less than 100 mm). Located in the western part of Java, Jakarta's wet season rainfall peak is January and February with average monthly rainfall of , and its dry season low point is August with a monthly average of .\n\nParks\n\nIn June 2011, Jakarta had only 10.5% green open spaces (Ruang Terbuka Hijau) and this has grown to 13.94% public green open spaces. Public parks are included in public green open spaces. By 2030, the administration also hope there is 16% private green open spaces. In a goal to develop a child friendly city and to provide green open spaces for citizens, Jakarta administration has targeted to build 300 Child Friendly Integrated Public Space (, abbreviated RPTRA) by 2017,  which is a public space in the form of green open spaces or parks equipped with playground, games, library, lactation room, and other facilities to serve the interests of communities around with CCTV surveillance.[http://news.detik.com/berita/2951941/mengenal-lebih-jauh-rptra-taman-multifungsi-di-sudut-sudut-ibu-kota Mengenal Lebih Jauh RPTRA, Taman Multifungsi di Sudut-Sudut Ibukota.] dari situs Detik[http://www.beritajakarta.com/read/10668/2017_DKI_Targetkan_Bangun_300_RPTRA#.VumTbBJ96u4 2017, DKI Targetkan Bangun 300 RPTRA.] dari situs Berita Jakarta\n*Merdeka Square () is an almost 1 km2 field housing the symbol of Jakarta, Monas or Monumen Nasional (National Monument) and is the largest city square in the world. The square was created by Dutch Governor-General Herman Willem Daendels (1810) and was originally named Koningsplein (King's Square). On 10 January 1993, President Soeharto started the beautification of the square. Several features including a deer park and 33 trees that represent the 33 provinces of Indonesia were added.\n*Lapangan Banteng (Buffalo Field) is located in Central Jakarta near Istiqlal Mosque, Jakarta Cathedral, and Jakarta Central Post Office. It is about 4.5 hectares. Initially it was called Waterlooplein and functioned as the ceremonial square during the Netherlands East Indies colonial period. A number of colonial monuments and memorials erected on the square during the colonial period were demolished during the Sukarno era. The most notable monument in the square is the Monumen Pembebasan Irian Barat (Monument of the Liberation of West Irian). During the 1970s and 1980s the park was used as a bus terminal. In 1993 the park was turned into a public space again. It has become a recreation place for people and is occasionally also used as an exhibition place or for other events. 'Jakarta Flona' (Flora dan Fauna), a flower and decoration plants and pet exhibition, is held in this park around August annually.\n\n*Taman Mini Indonesia Indah (Miniature Park of Indonesia), in East Jakarta, has 10 mini parks.\n*Suropati Park is located in Menteng, Central Jakarta. The park is surrounded by several Dutch colonial buildings. Taman Suropati was known as Burgemeester Bisschopplein during the Dutch colonial time. The park is circular shaped with a surface area of . There are several modern statues in the park made by artists of ASEAN countries, which contributes to the nickname of the park Taman persahabatan seniman ASEAN ('Park of the ASEAN artists friendship'). \n*Menteng Park and the Situ Lembang pond - Menteng Park was built on the site of the former Persija football stadium.\n*Kalijodo Park is the newest park in the city at Penjaringan subdistrict, with  of land area besides the Krendang River which formally opened on 22 February 2017. The park is open 24 hours as a green open space (RTH) and child-friendly integrated public space (RPTRA) and has international-standard skateboard facilities. It is expected that the park can function as an iconic tourist location.\n*Muara Angke Wildlife Sanctuary and Angke Kapuk Nature Tourism Park at Penjaringan in North Jakarta.\n*Ragunan Zoo is located in Pasar Minggu, South Jakarta. It is the third oldest zoo in the world and is the second largest zoo in the world with the most diverse animal and plant populations.\n*Setu Babakan is a 32 hectare lake surrounded by Betawi cultural village, located at Jagakarsa, South Jakarta. \n*Ancol Dreamland is the largest integrated tourism area in South East Asia at present. It is located along the bay, at Ancol in North Jakarta.\n*Taman Waduk Pluit/Pluit Lake park at Pluit, North Jakarta, \n*Honda Park at Tebet, South Jakarta\n*Taman Langsat and Taman Ayodya in South Jakarta\n\nDemography\n\nPopulation\n\nSince 1950, Jakarta has attracted people from all parts of Java and other Indonesian islands. The flood of migrants came to Jakarta for economic reasons as Jakarta offered the hope of employment. The 1961 census showed only 51% of the city's population was actually born in Jakarta.Cybriwsky and Ford, City profile – Jakarta, 2001 Between 1961 and 1980, the population of Jakarta doubled and during the period 1980–1990, the city's population grew annually by 3.7%.archive.unu.edu [http://archive.unu.edu/unupress/unupbooks/uu11ee/uu11ee15.htm Jabotabek, the Jakarta metropolitan area]\n\nThe 2010 census counted some 9.58 million people, well above all government estimates.[http://www.thejakartapost.com/news/2010/08/28/after-census-city-plans-95-million.html \"After census city plans for 9.6 million\"]. Jakarta Pos According to the government's 'Jakarta in Figures' document, the population stood at 10,187,595 in 2011 and 9,761,407 in 2012.[http://jakarta.bps.go.id/flip/jda2013/#/144/ Jakarta in Figures, page 83]  As per 2014, the population stood at 10,075,310 people. The area of DKI Jakarta is 664 km2, suggesting a population density of 15,174 people/km2.[http://sti-india-uttoolkit.adb.org/mod2/se3/005_5.html BRT – CASE STUDY 5 – Annex 5 Case Studies and Lessons – Module 2: Bus Rapid Transit (BRT): Toolkit for Feasibility Studies]. Sti-india-uttoolkit.adb.org. Retrieved 12 June 2011. Inwards immigration tended to negate the effect of family planning programs. The population has risen from 4.5 million in 1970 doubled to 9.5 million in 2010, counting only its legal residents. While the population of Greater Jakarta (Jabodetabek Region) has risen from 8.2 million in 1970 jumping to 28.5 million in 2010.Puslitbang Ekonomi dan Pembangunan, Perubahan Pemanfaatan Tanah di Jabotabek, Jakarta: Lembaga Ilmu Pengetahuan Indonesia, 1998 As per 2014, the population of Greater Jakarta was 30,326,103, accounting for 11% of Indonesia's overall population.http://www.thejakartapost.com [http://www.thejakartapost.com/news/2011/03/26/population-growth-greater-jakarta-and-its-impact.html#sthash.bynCViBO.dpuf Population growth of Greater Jakarta and its impact] The gender ratio was 102.8 (males per 100 females) in 2010http://www.knoema.com [http://knoema.com/atlas/Indonesia/Jakarta-Special-City-District/Sex-Ratio Jakarta (Special City District) – Sex Ratio] and 101.3 in 2014.\n\nEthnicity and language\n\nJakarta is a pluralistic and religiously diverse city. As of 2000, 35.16%  of the city's population are Javanese, 27.65% Betawi, 15.27% Sundanese, 5.53% Chinese, 3.61% Batak, 3.18% Minangkabau and 1.62% Malays.Indonesia's Population: Ethnicity and Religion in a Changing Political Landscape. Institute of Southeast Asian Studies. 2003.  And as of 2010 Census, 36.17%  of the city's population are Javanese, 28.29% Betawi, 14.61% Sundanese, 6.62% Chinese, 3.42% Batak, 2.85% Minangkabau, 0.96% Malays and others 7.08%.\n\nThe 'Betawi' (Orang Betawi, or 'people of Batavia') are the descendants of the people living in and around Batavia, and are recognised as an ethnic group from around the 18th–19th century. The Betawi people are mostly descended from various Southeast-Asian ethnic groups brought or attracted to Batavia to meet labour needs, and include people from different parts of Indonesia.The Betawi – due to their diverse origins – play a major role concerning ethnic and national identity in contemporary Jakarta; see Knörr, Jacqueline: Kreolität und postkoloniale Gesellschaft. Integration und Differenzierung in Jakarta, Campus Verlag: Frankfurt a.M. & New York, 2007,  Betawi people are a creole ethnic group that came from various parts of Indonesia and intermarried with Chinese, Arabs, and Europeans.Rogelio Sáenz, David G. Embrick, Néstor P. Rodríguez; The International Handbook of the Demography of Race and Ethnicity, 2015 Nowadays, most Betawi form a minority in the city; most of them live in the fringe areas of Jakarta and there are hardly any Betawi-dominated areas in central Jakarta.Alessandra Iyer, Indonesian Performing Arts: Tradition and Transition, 2001\n\nThere has been a significant Chinese community in Jakarta for many centuries. Jakarta is home to the largest population of Chinese on Java island. The Chinese in Jakarta traditionally reside around old urban areas, such as Pinangsia, Pluit and Glodok (Jakarta Chinatown) areas. They also can be found in the old Chinatowns of Senen and Jatinegara. Officially, they make up 5.53% of the Jakarta population, although this number may be under-reported.\n\nThe Sumatran people of the city are very diverse. According to 2010 Census, there were roughly 346,000 Batak, 305,000 Minangkabau and 155,000 Malays. The Batak and Minangkabau are spread throughout the city. The Batak ethnic group has increased in ranking, from eighth in 1930 to fifth in 2000. Toba Batak is the largest sub-ethnic Batak group in Jakarta.Anthony Reid, Imperial Alchemy: Nationalism and Political Identity in Southeast Asia, 2010 Beside the Chinese, Minangkabau people also as merchants, peddlers, and artisans, in addition to working in white collar professions: doctors, teachers, and journalists.Board of Editors, Contributions to Southeast Asian Ethnography, 1987Mochtar Naim, Merantau: Causes and Effects of Minangkabau Voluntary Migration, 1971\n\nBahasa Indonesia is the official as well as the spoken language of Jakarta. English is used widely as second language, while a number of elderly people can speak Dutch. Each of the ethnic groups use their mother language at home, such as Betawi language, Javanese, Sundanese, Madurese, Batak, Minangkabau, and Chinese. Betawi language is distinct from those of the Sundanese or Javanese, forming itself as a language island in the surrounding area. The language is mostly based on the East Malay dialect and enriched by loan words from Dutch, Portuguese, Sundanese, Javanese, Minangkabau, Chinese, and Arabic. Nowadays, the Jakarta dialect (Bahasa Jakarta), used as a street language by people in Jakarta, is loosely based on the Betawi language.\n\nReligion\n\nAs of the 2010 census the population of Jakarta was 85.36% Muslim, 7.53% Protestant, 3.30% Buddhist, 3.15% Roman Catholic, 0.21% Hindu, and 0.06% Confucianist. The majority of Jakartans are Sunni Muslims.\n\nMost pesantrens in Jakarta are affiliated with the traditionalist Nahdlatul Ulama organisations.Pemerintah Provinsi Daerah Khusus Ibukota Jakarta, Ensiklopedi Jakarta: Culture & Heritage, Vol. 1, Dinas Kebudayaan dan Permuseuman, 2005 The modernist organisations mostly catered to a socioeconomic class of educated urban elites and merchant traders. They gave priority to education, social welfare programs and religious propagation activities.Donald Porter, Managing Politics and Islam in Indonesia, 2002 Many Islamic organisations have headquarters in Jakarta, such as Nahdlatul Ulama, Indonesian Ulema Council, Muhammadiyah, Jaringan Islam Liberal, and Front Pembela Islam.\n\nBased on data from Jakarta Central Bureau of Statistics 17 July 2017, shows that the population of Jakarta who embraced Islam is 83.43%, then Protestant 8.63%, Catholic 4.0%, Buddhist 3.74%, Hindu 0.19%, and Confucianist 0.01%, include Folk religion 231 people.\n\nRoman Catholics have a Metropolitan see there, for the Archdiocese of Jakarta, whose province including two suffragans Western Java.\n\nCulture\n\nAs the economic and political capital of Indonesia with so many different languages and ethnic groups, it is difficult to describe or define a common culture for Jakarta, as the city attracts many native immigrants, from the vast and diverse Indonesian archipelago, who also bring their various languages, dialects, foods and customs. This diversity of origins and languages leads to differences in regard to religion, traditions and linguistics. However ethnic Betawi are considered as the indigenous people of Jakarta.\n\nArts and festivals\n\nThe Betawi culture is distinct from those of the Sundanese or Javanese, forming itself as a language island in the surrounding area. Betawi arts have a low profile in Jakarta, and most Betawi have moved to the suburbs of Jakarta, displaced by new migrants. It is easier to find Java or Minang-based wedding ceremonies rather than Betawi weddings in Jakarta. It is easier to find Javanese Gamelan instead of Tanjidor (a mixture between Betawi and Portuguese music), Marawis (a mixture between Betawi and Yemeni music) or Gambang Kromong (a mixture between Betawi and Chinese music). The Chinese also influenced Betawi culture, such as the popularity of Chinese cakes and sweets, firecrackers, to Betawi wedding attire that demonstrates Chinese and Arab influences.\n\nHowever, some festivals such as the Jalan Jaksa Festival or Kemang Festival include efforts to preserve Betawi arts by inviting artists to give performances. Jakarta has several performing art centres, such as the classical concert hall Aula Simfonia Jakarta in Kemayoran, Taman Ismail Marzuki (TIM) art centre in Cikini, Gedung Kesenian Jakarta near Pasar Baru, Balai Sarbini in the Plaza Semanggi area, Bentara Budaya Jakarta in Palmerah area, Pasar Seni (Art Market) in Ancol, and traditional Indonesian art performances at the pavilions of some provinces in Taman Mini Indonesia Indah. Traditional music is often found at high-class hotels, including Wayang and Gamelan performances. Javanese Wayang Orang performances can be found at Wayang Orang Bharata theatre near Senen bus terminal. As the country's largest city and capital, Jakarta has lured much national and regional talent who hope to find a greater audience and more opportunities for success.\n\nJakarta hosts several prestigious art and culture festivals, and exhibitions, such as the annual Jakarta International Film Festival (JiFFest), Jakarta International Java Jazz Festival, Djakarta Warehouse Project, Jakarta Fashion Week, Jakarta Fashion & Food Festival (JFFF), Jakarta Fair, Indonesia Creative Products and Jakarta Arts and Crafts exhibition. Flona Jakarta is a flora-and-fauna exhibition, held annually in August at Lapangan Banteng Park, featuring flowers, plant nurseries, and pets. Jakarta Fair is held annually from mid-June to mid-July to celebrate the anniversary of the city and is largely centred around a trade fair. However, this month-long fair also features entertainment, including arts and music performances by local musicians. Jakarta International Java Jazz Festival (JJF) is one of the largest jazz festivals in the world and arguably the biggest in the Southern hemisphere. The annual jazz festival is held every early March and was designed to be one of the largest jazz festivals globally.\n\nSeveral foreign art and culture centres are also established in Jakarta, and mainly serve to promote culture and language through learning centres, libraries, and art galleries. Among these foreign art and cultural centres are China Confucius Institute, Netherlands Erasmus Huis, UK British Council, France Alliance Française, Germany Goethe-Institut, Japan Foundation, and India Jawaharlal Nehru Indian Cultural Center.\n\nFile:Mangga Dua Jakarta's Chinatown.jpg|Chinese paifang in Mangga Dua, Central Jakarta\nFile:Keong Emas.jpg|The Golden Snail IMAX theatre at Taman Mini Indonesia Indah\nFile:Teater Jakarta Taman Ismail Marzuki.JPG|Taman Ismail Marzuki, Central Jakarta\nFile:Gambir Expo Jakarta Fair.JPG|Jakarta Fair\n\nCuisine\n\nAs the capital, all varieties of Indonesian cuisine have a presence in Jakarta. The local cuisine of Jakarta is the Betawi cuisine, which reflects various foreign culinary traditions that have influenced the inhabitants of Jakarta for centuries. Betawi cuisine is heavily influenced by Malay-Chinese Peranakan cuisine, Sundanese and Javanese cuisine, which is also influenced by Indian, Arabic and European cuisines. One of the most popular local dishes of Betwai cuisine is Soto Betawi which is prepared from chunks of beef and offal in rich and spicy cow's milk or coconut milk broth. Other popular Betawi dishes include soto kaki, nasi uduk, kerak telor (spicy omelette), nasi ulam, asinan, ketoprak, rujak and gado-gado Betawi (salad in peanut sauce).\n\nJakarta has a vast range of food available at hundreds of eating venues and food courts located all over the city, from modest street-side warung foodstalls and kaki lima (five legs) travelling vendors to high-end fine dining restaurants. Since Jakarta is regarded as the 'melting-pot' and a miniature version of Indonesia, many traditional foods from far-flung regions in Indonesia can be found in Jakarta. For example, traditional Padang restaurants and low-budget Warteg (Warung Tegal) foodstalls are ubiquitous in the capital. Other popular street foods include nasi goreng (fried rice), sate (skewered meats), pecel lele (fried catfish), bakso (meatballs), bakpau (Chinese bun) and siomay (fish dumplings).\n\nJalan Sabang, Jalan Sidoarjo, Jalan Kendal at Menteng area, Kota Tua, Blok S, Blok M, Jalan Tebet are all popular destinations for street-food lovers. While Menteng, Kemang, Jalan Senopati, Kuningan, Senayan and Pantai Indah Kapuk, Kelapa Gading areas have trendy restaurants, cafe and bars. From rooftop bar to glamorous lounge, Jakarta has plenty of bars, cafes and clubs. From old town of Batavia with Indonesia’s Dutch colonial past to the fashionable Menteng district, the city has hive of live music venues and exclusive restaurants.\nLenggang Jakarta is a food court area built with a concept of culinary and cultural centre, accommodating small traders and street vendors with toilet, free WiFi facility and non-cash payment system.[http://travel.detik.com/read/2015/06/29/140837/2955101/1519/lenggang-jakarta-tempat-nongkrong-baru-di-monas Lenggang Jakarta Tempat Nongkrong Baru di Monas.] Detik This place is unique as most of the Indonesian food's are available within a single compound. At present there are two such food courts at Monas and Kemayoran area. TransJakarta operates free tour buses on every Saturday from 5PM to 11 PM to some of the most popular culinary destinations in Central Jakarta.Chinese street-food is plentifully available at Jalan Pangeran, Manga Besar and Petak Sembilan in the old Jakarta area, while Little Tokyo area of Blok M has many Japanese style restaurants and bars.\n\nNext to a myriad of Indonesian food and regional specialties from all over Indonesia, foreign food is also represented: Chinese, Japanese, Korean, Thai, Indian, American, French, Mediterranean cuisine's like Turkish, Italian, Middle-Eastern cuisine, and modern fusion food can all be found in Jakarta.\n\nMuseums\n\nThere are in total 142 museums in Jakarta. The museums in Jakarta cluster around the Central Jakarta Merdeka Square area, Jakarta Old Town, and Taman Mini Indonesia Indah.\n\nThe Jakarta Old Town contains museums that are former institutional buildings of Colonial Batavia. Some of these museums are: Jakarta History Museum (former City Hall of Batavia), Wayang Museum (Puppet Museum) (former Church of Batavia), the Fine Art and Ceramic Museum (former Court House of Justice of Batavia), the Maritime Museum (former Sunda Kelapa warehouse), Bank Indonesia Museum (former Javasche Bank), and Bank Mandiri Museum (former Nederlandsche Handels Maatschappij).\n\nSeveral museums clustered in central Jakarta around the Merdeka Square area include: National Museum of Indonesia which also known as Gedung Gajah (the Elephant Building), Monumen Nasional (National Monument), Istiqlal Islamic Museum in Istiqlal Mosque, and Jakarta Cathedral Museum on the second floor of Jakarta Cathedral. Also in the central Jakarta area is the Taman Prasasti Museum (former cemetery of Batavia), and Textile Museum in Tanah Abang area.\n\nThe recreational area of Taman Mini Indonesia Indah in East Jakarta contains fourteen museums, such as Indonesia Museum, Purna Bhakti Pertiwi Museum, Asmat Museum, Bayt al-Qur'an Islamic Museum, Pusaka (heirloom) Museum, and other science-based museum such as Research & Technology Information Centre, Komodo Indonesian Fauna Museum, Insect Museum, Petrol and Gas Museum, plus the Transportation Museum. Other museums are Satria Mandala Military Museum, Museum Sumpah Pemuda, and Lubang Buaya (Crocodile Well).\n\nMedia\n\nJakarta has numerous newspaper publications, television and radio stations. Several newspapers, including daily, business, and digital papers, are based in Jakarta. Daily newspapers include Kompas, Koran Tempo, Media Indonesia, Republika, Suara Pembaruan, Seputar Indonesia, Suara Karya, Sinar Harapan, Indo Pos, Jurnal Nasional, and Harian Pelita. English language newspapers are also published daily, for example The Jakarta Post and The Jakarta Globe. Chinese language newspapers are Indonesia Shang Bao (印尼商报), Harian Indonesia (印尼星洲日报), and Guo Ji Ri Bao (国际日报). The only Japanese language newspaper is The Daily Jakarta Shimbun (じゃかるた新聞). Jakarta has also the daily newspapers segment such as Pos Kota, Warta Kota, Koran Jakarta, Berita Kota for local readers; Bisnis Indonesia, Investor Daily, Kontan, Harian Neraca (business news) as well as Top Skor and Soccer (sport news).\n\nJakarta are the headquarters for Indonesia's state media public government stations, TVRI as well as private national television include Metro TV, tvOne, Kompas TV, Trans TV, Trans 7, RCTI, MNC, SCTV, Global TV, Indosiar, ANTV, RTV and NET..  Jakarta has also the local television channels such as Jak TV, O Channel, Elshinta TV, and DAAI TV Indonesia. The city is home to the country's main pay television service. The wide range of cable channels available includes First Media and TelkomVision. Satellite television (DTH) has yet to gain mass acceptance in Jakarta. Prominent DTH entertainment services are Indovision, Okevision, Yes TV, Transvision, and Aora TV. Many TV stations are analogue PAL, but some are now converting to digital signals using DVB-T2 following a government plan to digital television migration.[http://www.tvdigital.kominfo.go.id/berita/2-siaran-tv-digital.html TV Digital Indonesia – Siaran TV Digital]\n\nThere are seventy five radio stations in Jakarta, with fifty two broadcasting on the FM band, and twenty three radio stations broadcasting on the AM band.\n\nEconomy\n\nIndonesia is the largest economy of ASEAN and Jakarta is the economic nerve centre of Indonesian archipelago. The city generated about one-sixth of Indonesian GDP in 2008.Yukon Huang, Alessandro Magnoli Bocchi; Reshaping Economic Geography in East Asia, 2009 Nominal GDP of DKI Jakarta was US$483.8 billion in 2016, which is about 17.5% of the nominal GDP of Indonesia.\n Jakarta ranked 67th in Global Financial Centres Index 21 published by Z/Yen. The city ranks higher at 62 in Global Financial Centres Index 22, published in September, 2017. Jakarta ranked at 41 in Global Power City Index by The Mori Memorial Foundation in 2017.EIU’s recent survey ranked Jakarta at 8th among 45 cities in the world with the highest confidence in the environment for digital transformation, beating London, Madrid, New York, as well as its closest neighbor, Singapore.  \n\nJakarta's economy depends highly on service sectors, banking, trading, financial, and manufacturing. Most of industries in Jakarta include electronics, automotive, chemicals, mechanical engineering and biomedical sciences manufacturing. Head office of Bank Indonesia and Indonesia Stock Exchange located in the city. Most of the SOE like Pertamina, PLN, PGN, Angkasa Pura, BULOG, Telkomsel, Waskita operate from their head offices in the city. Also major Indonesian conglomerates maintains head office in Jakarta. Important conglomerates which have corporate office in the city are, Salim Group, Sinar Mas Group, Astra International, Lippo Group, Bakrie Group, Ciputra Group, Agung Podomoro Group, Unilever Indonesia, Djarum, Gudang Garam, Kompas Gramedia, Lion Air, Sriwijaya Air, MedcoEnergi, MNC, Trans Corp  and many more.\n\nThe economic growth of Jakarta in 2007 was 6.44% up from 5.95% the previous year, with the growth in the transportation and communication (15.25%), construction (7.81%) and trade, hotel and restaurant sectors (6.88%). In 2007, GRDP (Gross Regional Domestic Product) was Rp. 566 trillion (around $US 56 billion). The largest contributions to GRDP were by finance, ownership and business services (29%); trade, hotel and restaurant sector (20%), and manufacturing industry sector (16%). In 2007, the increase in per capita GRDP of DKI Jakarta inhabitants was 11.6% compared to the previous year Both GRDP by at current market price and GRDP by at 2000 constant price in 2007 for the Municipality of Central Jakarta, which was Rp 146 million and Rp 81 million, was higher than other municipalities in Jakarta. Last data update was on 2014 by end of year Jakarta have a GRDP (Gross Regional Domestic Product) was Rp. 1,761.407 trillion (around USD 148.53 billion) with economic growth above 6% per year since 2009. In 2014, per capita GRDP of DKI Jakarta inhabitants was Rp 174.87 million or USD 14,727. In 2015, GDP per capita in the city was estimated Rp 194.87 million or US$14,570.\n\nThe Wealth Report 2015 by Knight Frank reported that there were 24 individuals in Indonesia in 2014 with wealth at least one billion US Dollar and 18 of them live in the capital Jakarta. The cost of living in the city continues to rise. Both land price and rents has become expensive. Mercer’s 2017 Cost of Living Survey ranked Jakarta as 88th costliest city in the world for expatriate employees living. Industrial development and the construction of new housing are usually undertaken on the outskirts, while commerce and banking remain concentrated in the city centre.http://www.britannica.com [http://www.britannica.com/place/Jakarta Jakarta] Jakarta has a bustling luxury property market. The investment in the property sector, including offices, commercial buildings, new town development, and high rise apartments and hotels grew substantially. Knight Frank, a global real estate consultancy based in London, reported in 2014 that Jakarta offered the highest return on high-end property investment in the world in 2013, citing supply shortage and a sharply depreciated currency as reasons.Josua Gantan (13 February 2013). \"[http://www.thejakartaglobe.com/news/jakarta/jakarta-the-luxury-property-capital-of-the-world/ Jakarta: The Luxury Property Capital of the World\"], The Jakarta Globe, Retrieved 27 May 2014\n\nShopping\n\nJakarta has numerous shopping malls and markets. With a total of 550 hectares, Jakarta has the world's largest shopping mall floor area within a single city. The annual \"Jakarta Great Sale\" is held every year in June and July to celebrate Jakarta's anniversary, with about 73 participating shopping centres in 2012.\n\nMalls such as Plaza Indonesia, Grand Indonesia Shopping Town, Plaza Senayan, Senayan City and Pacific Place provide luxury brands, while Mall Taman Anggrek, Pondok Indah Mall, Mal Kelapa Gading, Central Park Jakarta, Bay Walk Mall and Ciputra World Jakarta have high-street brands such as Topshop, Uniqlo and Zara.\n\nDepartment stores in Senayan City, Supermall Karawaci and Lippo Mall Kemang Village use the Debenhams brand under licence, while the Japanese Sogo department store has about seven stores in various shopping malls in the city.http://sogo.co.id/stores/ Seibu flagship store is located in Grand Indonesia Shopping Town, and French luxury department store, Galeries Lafayette opened its doors for the first time in South East Asia in Pacific Place.\n\nInternationally known luxury brands such as Louis Vuitton, Bulgari, Chanel, Gucci, Christian Louboutin, Balenciaga, and Giorgio Armani can be found in Jakarta's luxury shopping malls. The Satrio-Casablanca corridor, 3.5-kilometre street is a new shopping belt in Jakarta.Kompas.com [http://properti.kompas.com/read/2009/03/20/06102484/Jalan.Satrio.Dijadikan.Shopping.Belt.Jakarta Jalan Satrio Dijadikan \"Shopping Belt\" Jakarta] Many multistorey shopping centres are located here, such as Kuningan City, Mal Ambassador, Kota Kasablanka, and Lotte Shopping Avenue.\n\nTraditional markets include Blok M, Tanah Abang, Senen, Pasar Baru, Glodok, Mangga Dua, Cempaka Mas, and Jatinegara. In Jakarta there are also markets that sell specific collectable items, such as antique goods in Surabaya Street and gemstones in Rawabening Market.\n\nTourism\n\nThough Jakarta has been named the most popular location as per tag stories and ranked 8th most posted among the cities in the world in 2017 on image sharing site Instagram,  the city is not a top international tourist destination till date unlike other neighboring Southeast Asian cities like Singapore, Kuala Lumpur and Bangkok. Most of the visitors attracted to Jakarta are domestic tourists from all over Indonesia.  Jakarta ranked as the fifth fastest growing destination among 132 cities according to MasterCard Global Destination Cities Index published in September, 2017. Those who were visiting, 59.1% for business, while the other 40.9% were visiting for leisure. According to Euromonitor International’s latest Top 100 City Destinations Ranking, Jakarta ranked at 83 with more than 3.5 million international tourists visited in a year, which is 48.5% higher in comparison to previous year.\n\nAs the gateway of Indonesia, Jakarta often serves as the stop-over for foreign visitors on their way to Indonesian popular tourist destinations such as Bali, Lombok and Yogyakarta. Jakarta is trying to attract more international tourist by MICE tourism, by arranging increasing numbers of conventions.  Slowly but steadily and gradually tourism contributes a growing amount of income to the city. In 2012, the tourism sector contributed 2.6 trillion rupiah (US$268.5 million) to the city's total direct income of 17.83 trillion rupiah (US$1.45 billion), 17.9% increase from the previous year 2011. Tourism stakeholders are expecting greater marketing of the Jakarta as a tourism destination.\n\nThe popular heritage tourism attractions are in Kota and around Merdeka square. Kota is the centre of old Jakarta, with its Maritime Museum, Kota Intan drawbridge, Gereja Sion, Wayang Museum, Stadhuis Batavia, Fine Art and Ceramic Museum, Toko Merah, Bank Indonesia Museum, Bank Mandiri Museum, Jakarta Kota Station, and Glodok (Jakarta Chinatown). In the old ports of Sunda Kelapa, the tall masted pinisi ship still sails. The Jakarta Cathedral with neo-gothic architecture in Central Jakarta also attracted architecture enthusiast. Kota Tua was named the most-visited destination in Indonesia in 2017 by image-sharing platform Instagram.\n\nOther than monuments, landmarks, and museums around Merdeka square and Jakarta Old Town, tourist attractions of the city include Thousand Islands, Taman Mini Indonesia Indah, Setu Babakan, Ragunan Zoo, Sunda Kelapa old port and the Ancol Dreamland complex on Jakarta Bay, including Dunia Fantasi (Fantasy World) theme park, Sea World, Atlantis Water Adventure, and Gelanggang Samudra. Thousand Islands, which is north to the coast of the city and in Java Sea is also a popular tourist destination.\n\nMost of the renowned international hotel chains have presence in the city. Jalan Jaksa and surrounding area is popular among backpackers for cheaper accommodation, travel agencies, second-hand bookstores, money changers, laundries, pubs, etc., while Kemang is a favorite suburb for expats living.\n\nInfrastructure\n\nRoad\n\nA structured road network had been developed in the early 19th century as a part of the Java Great Post Road by former Governor-General Daendels, which connects most major cities throughout Java. During the following decades, the road network was expanded to a great extent, although it could not keep up with the rapidly increasing numbers of motorised vehicles, resulting in highly congested traffic.\n\nA notable feature of Jakarta's present road system is the toll road network. Composed of an inner and outer ring road and five toll roads radiating outwards, the network provides inner as well as outer city connections. Jakarta Outer Ring Road 2 is an under-construction toll road encircling greater Jakarta area, parallel with Jakarta Outer Ring Road (JORR 1).\n\nThe five radiating toll roads are:\n*Prof. Dr. Sedyatmo Toll Road linking to Soekarno–Hatta International Airport\n*Jakarta–Tangerang Toll Road linking to Tangerang and further to Merak in the west\n*Jakarta–Serpong Toll Road linking to Serpong\n*Jagorawi Toll Road linking to Bogor and Ciawi in the south\n*Jakarta–Cikampek Toll Road linking to Bekasi and Cikampek in the east\n\nThroughout the years, several attempts have been made to reduce traffic congestion on Jakarta's main arteries. Implemented solutions include a 'three-in-one' rush-hour law, during which cars with fewer than three passengers are prohibited from driving on the main avenues. Another example is the ban on trucks passing main avenues during the day. In 2016, 'odd-even' policy was introduced which designated cars with either odd or even-numbered registration plates on a particular day. This aims to function as a transitional measure to alleviate traffic congestion until the future introduction of Electronic Road Pricing which would be more effective.\n\nWater supply\n\nTwo private companies, PALYJA and Aetra, provide piped water supply in the western and eastern half of Jakarta respectively under 25-year concession contracts signed in 1998. A public asset holding company called PAM Jaya owns the infrastructure. 80% of the water distributed in Jakarta comes through the West Tarum Canal system from Jatiluhur reservoir on the Citarum River 70 km southeast of the city. Water supply had been privatised by government of then President Suharto in 1998 to the French company Suez Environnement and the British company Thames Water International. Both foreign companies subsequently sold their concessions to Indonesian companies. Customer growth in the 7 first years of the concessions had been lower than before, despite substantial inflation-adjusted tariff increases during this period. In 2005 tariffs were frozen, leading the private water companies to cut down on investments.\n\nAccording to PALYJA in its western half of the concession the service coverage ratio increased substantially from 34% in 1998 to 59% in 2007 and 65% in 2010. According to data by the Jakarta Water Supply Regulatory Body, access in the eastern half of the city served by PTJ increased from about 57% in 1998 to about 67% in 2004, but stagnated after that. However, other sources cite much lower access figures for piped water supply to houses, excluding access provided through public hydrants: One study estimated access as low as 25% in 2005, while another source estimates it to be as low as 18.5% in 2011. Those without access to piped water supply get water mostly from wells that are often salty and polluted with bacteria. As of 2017, according to the Ministry of Energy and Mineral Resources, Jakarta has a crisis of clean water.\n\nHealthcare\n\nIndonesia’s healthcare system is lagging behind than neighboring countries, such as Singapore, Malaysia or Thailand, but capital Jakarta does have many of the country’s best-equipped private and public facilities. In January 2014, the Indonesian government launched Jaminan Kesehatan Nasional (JKN), a scheme to implement universal health care in Indonesia. It is expected that the entire population will be covered in 2019.http://www.csmonitor.com/World/Asia-Pacific/2014/0310/Indonesia-launches-world-s-largest-health-insurance-system\n\nHospitals in Jakarta are of a very good standard, however, they are in high demand and thus often overcrowded. There are many government run specialized hospitals as well as community hospitals Puskesmas in Jakarta. Private hospitals and clinics are the best option for healthcare services in Jakarta. Private healthcare sector has seen significant changes during last few years, as Indonesian government began allowing foreign investment in the private sector in 2010. While there are some private facilities that are run by nonprofit or religious organizations, most are for profit. There are many hospital chains with branches operating in the city, such as Siloam, Mayapada, Mitra Keluarga, Medika, Medistra, Hermina and many others.\n\nTransportation\n\nAs a metropolitan area of about 30 million people with limited rapid transit system Jakarta is strained by transportation problems. The city suffers a lack of urban public transport services due to prioritised development of road networks, which were mostly designed to accommodate private vehicles. According to the National Development Planning Agency, or Bappenas, traffic congestion in Greater Jakarta wastes about $7.4 billion each year due to the high number of motorcycles and cars on the roads. As of 2015, about 1.4 million commuters travel into the city centre from the outskirts of Jakarta. Based on the survey, 58 percent of these commuters use motorcycles, 12.8 percent use cars and only 27 percent use public transportation. In 2004, a study was undertaken to prepare a master-plan for an integrated public transport system within Greater Jakarta, which revealed the mode of transport among city dwellers.[Technical Report Table 1.3.2 of the Study on Integrated Transportation Master Plan for Jabodetabek (SITRAMP), undertaken by Pacific Consultants International and ALMEC Corporation on behalf of the Indonesian National Development Planning Agency (BAPPENAS) and the Japan International Cooperation Agency (JICA), 2004],Technical Report Tables 1.3.2 of the Study on Integrated Transportation Master Plan for Jabodetabek (SITRAMP), undertaken by Pacific Consultants International and ALMEC Corporation on behalf of the Indonesian National Development Planning Agency (BAPPENAS) and the Japan International Cooperation Agency (JICA), 2004.https://sustainabledevelopment.un.org/content/dsd/susdevtopics/sdt_pdfs/meetings2010/egm0310/presentation_Rini.pdf The city's 9.5% average annual growth rate of motorized vehicles far exceeds the 0.01% increase in road length between 2005 and 2010. As of 2010, public transportation in Jakarta serves only 56% of commuter trips.\n\nRoad transport\n\nElectronic road pricing\n\nDue to the city's acute gridlock, the Jakarta administration has decided to implement electronic toll collection in 10 districts: Tanah Abang, Menteng, Setiabudi, Tebet, Matraman, Senen, Gambir, Tambora, Sawah Besar and Taman Sari. The ERP was planned to be implemented in the three-in-one zone and along Jl. Rasuna Said in Kuningan by the first quarter of 2014, although by September 2016 the plan has not started. Vehicles passing through the ERP areas will be charged Rp 21,072.\n\nBus service\n\nThere are many bus terminals in the city, from where buses operate on numerous routes to connect neighborhoods within the city limit, to other areas of Greater Jakarta area and to cities across the island of Java. The biggest of the bus terminal is Pulo Gebang Bus Terminal, which is arguably the largest of its kind in Southeast Asia. Besides TransJakarta, other private owned bus systems like Kopaja, MetroMini, Mayasari Bakti and APTB also provide important services for Jakarta commuters with numerous routes throughout the city. Since January 2013, Jakarta Government has integrated Kopaja AC buses with TransJakarta feeder bus routes. For the future, Metromini AC bus it is also possible to enter TransJakarta bus lanes to enhance integrated bus rapid transit system.\n\nTraditional transports\n\n*Becak: In 1966, an estimated 160 thousand pedicabs (becak) operated in the city; as much as 15% of Jakarta's total workforce was engaged in becak driving. In 1971, becak were banned from major roads, and shortly thereafter the government attempted a total ban, which substantially reduced their numbers but did not eliminate them. A campaign to eliminate them succeeded in 1990 and 1991, but during the economic crisis of 1998, some returned amid less effective government attempts to control them.Azuma, Yoshifumi (2003). Urban peasants: beca drivers in Jakarta. Jakarta: Pustaka Sinar Harapan.\n*Auto rickshaw: Bajaj auto rikshaw provide local transportation in the back streets of some parts of the city. From the early 1940s to 1991 they were a common form of local transportation in the city.\n*Microbus: Angkot microbuses also play a major role in road transport of Jakarta. They operates in numerous routes to connect neighbourhoods of the city.\n\nTaxi Cabs\n\nPlenty of taxi cabs are available in the city. Many companies operate & maintain pools of different model of cars in own their brands. App-based taxi services also have wide presence.\n\nMotorcycle taxi/ojek\n\nAlthough ojeks are not an official form of public transport, they can be found throughout Indonesia and in Jakarta. They are especially useful when navigating crowded urban roads, narrow alleyways, heavy traffic and cramped locations that larger vehicles cannot reach.\n\nCity tour\n\nSince February 2014, the Jakarta Government provides free double-decker bus tours that offers sightseeing in Central Jakarta. The tourists can catch the double-decker bus — free of charge, in several designated bus stops in front of city's points of interest. The buses' route covers tourist attractions, such as Monas, Istiqlal Mosque, the Cathedral, National Museum, Sarinah, and Plaza Indonesia, as well as Grand Indonesia shopping centres. As 2016, there are 18 double-decker buses in Jakarta, and the service is expanded to include Kota Tua in the north and Gelora Bung Karno Stadium in Senayan area in the south, via Sudirman avenue.\n\nRail\n\nLong-distance railways and local tram services were first introduced during the Dutch colonial era. While the trams were replaced with buses in the post-colonial era, long-distance railways continued to connect the city to its neighbouring regions as well as cities throughout the island of Java. Main terminus for long distance train services are Gambir and Pasar Senen.  A commuter rail system KRL Jabodetabek connects areas within Greater Jakarta.  Major rail stations of commter line are Jakarta Kota, Jatinegara, Tanah Abang, Duri, Pasar Senen, Manggarai and Sudirman. High-speed railways are planned connecting Jakarta-Bandung and Jakarta-Surabaya.\n\nHigh speed rail \n\nThe first high-speed rail to connect Jakarta with Bandung is currently under construction which is expected to start operation in 2019. The contract was awarded to China. Both Japan and China contested as a potential contractor, but it was awarded to China mainly because of their proposal did not require Indonesian fiscal spending or government debt guarantees. The project cost was estimated to be US$5.5 billion. China Development Bank will fund 75 percent of the project. A joint venture company  PT Kereta Cepat Indonesia-China has formed by China Railway Group Limited (CREC) with a consortium of Indonesia's state-owned enterprises (SOEs) led by PT Wijaya Karya Tbk to develop the project.\n\nAnother project to upgrade of existing Jakarta-Surabaya route to high speed rail is undertaken in 2016. Priority was given to Japan this time who had been one of the biggest investors to Indonesia. The route is supposed to finish construction in 2019.\n\nRapid transit\n\nAt present rapid transit in Greater Jakarta consists of a BRT TransJakarta and commuter rail, KRL Jabodetabek and Soekarno-Hatta Airport Rail Link. Other transit systems, those are now being under construction are Jakarta MRT and Jakarta LRT, which are expected to be operational by 2018.\n\nBus rapid transit\n\nThe TransJakarta bus rapid transit service (known as Busway) was developed in the context of development reforms (or reformasi) and used Bogota's TransMilenio system as a model. Jakarta's first busway line, from Blok M to Jakarta Kota opened in January 2004 and as of 14 February 2013, twelve out of fifteen corridors are in use. TransJakarta has the world's longest bus rapid transit routes (210 km in length). So far TransJakarta serves total 80 routes (corridor, cross route & feeder route) at the end of 2016. Transjakarta owned more than 1,500 buses in the first three months of 2017 and targets to have 3,000 buses by the end of the year.\n\nCommuter rail\n\nKRL Jabodetabek or commonly known as Commuterline is a commuter rail system which serves commuters in Jakarta, Bogor, Depok, Tangerang, South Tangerang, and Bekasi. The commuter system was started in 2000. The number of passengers in 2014 reached 208 million, rising from 158 million in the previous year. About 280 million commuters used KRL Jabodetabek in the year of 2016. KRL Jabotabek serves all municipalities in Jakarta excluding the Thousand Islands, as well as Greater Jakarta region. Though during rush hours, the number of passengers greatly exceeds the system's capacity, and crowding is common. Currently KRL Jabotabek is the only rail-based transit system in Jakarta, as the mass rapid transit and light rail transit are still under construction.\n\nJakarta MRT\n\nAfter a long planning process by the government regarding the development of a mass rapid transit system in Indonesia's capital, the Jakarta Mass Rapid Transit infrastructure is currently under construction, with a north–south line between Kota and Lebak Bulus; and an east–west line, which will connect to the north–south line at Sawah Besar station. The Jakarta MRT will be a combination of subways and elevated rails. Preparation work started in April 2012,[http://www.thejakartapost.com/news/2012/04/28/preparation-work-mrt-begins.html Preparation work for MRT begins | The Jakarta Post] and groundbreaking was done in October 2013, with the first, 15.2 km-long line between Hotel Indonesia and Lebak Bulus scheduled to be operational by 2018, and the north–south line MRT network is scheduled to be operational by 2020. The total length of the network when complete will be approximately . The Jakarta city government decided on a rail-based system because of its ability to carry large numbers of people quickly and cheaply. , the mass rapid transit system has an investment of nearly US $1.7 billion to ease the capital's traffic issue in the coming years, including the construction of a subway.\n\nJakarta LRT\n\nPreviously there had been plans to build a monorail system and part of it was already under construction, but the project stalled in 2004 due to lack of funding. The monorail project was relaunched in 2013 and the groundbreaking was done in October 2013. However the project cancelled in January 2015, due to disagreements between the Jakarta administration and PT Jakarta Monorail over the monorail's route. By mid 2015, this project is finally abandoned by Jakarta Government and being replaced by light rail transit system.\n\nThe light rail transit (LRT) project was launched to replace the previously abandoned monorail project. Jakarta Light Rail Transit groundbreaking ceremony was held on 9 September 2015, with the first phase of the construction will connect Cibubur in East Jakarta with Dukuh Atas in downtown Central Jakarta, passing through Cawang intersection. This phase will be  long, which include 18 stations, and expected to be operated by the first half of 2018, prior to the 2018 Asian Games.\n\nSoekarno-Hatta Airport Rail Link\n\nThis is a commuter train service connecting the Soekarno-Hatta International Airport to the city centre. Another express train service is now under planning stage to connect Soekarno-Hatta International Airport with Halim Perdanakusuma Airport. Completion of this line is expected to be in 2019 at the earliest.\n\nAir\n\nSoekarno–Hatta International Airport (CGK) is the main airport serving the Greater Jakarta area. The airport is named after the first President of Indonesia, Soekarno, and the first Vice President of Indonesia, Mohammad Hatta. The airport is often called Cengkareng airport or Soetta by Indonesians. The airport's IATA code, CGK, originates from the name of the Cengkareng locality, Tangerang, Banten, although the location of this airport is located outside of the city, it is used as a gate out by the Jakartans and citizen of the surrounding areas, therefore at the main gate of the airport, there is an inscription \"Jakarta Airports\". Soekarno–Hatta International Airport was ranked as 8th busiest airport in the world by Airports Council International in 2013. Today the airport is running over capacity. After T3 Soekarno-Hatta Airport expansion has finished in May 2016, the total capacity of three terminals become 43 million passengers a year. T1 and T2 also will be revitalised, so all the three terminals finally will accommodate 67 million passengers a year.\n\nA second airport, Halim Perdanakusuma Airport (HLP) serves domestic flight of low cost airline, private and VIP/presidential flights. Other airports in the Jakarta metropolitan area include Pondok Cabe Airport and an airfield on Pulau Panjang, part of the Thousand Island archipelago (Kepulauan Seribu).\n\nWaterway\n\nSea\n\nJakarta's main seaport Port of Tanjung Priok serves many ferry connections to different parts of Indonesia. Port of Tanjung Priok is Indonesia's busiest port, and the 21st busiest port in the world in 2013, handling over 6.59 million TEUs.http://www.worldshipping.org [http://www.worldshipping.org/about-the-industry/global-trade/top-50-world-container-ports Top 50 world container ports] To boost the port capacity, two-phase \"New Tanjung Priok\" extension project is currently ongoing. When fully operational in 2023, it will triple existing annual capacity.\n\nThe port is also an important employer in the area, with more than 18,000 employees who provide services to more than 18,000 ships every year. The Port of Tanjung Priok has 20 terminals: general cargo, multipurpose terminal, scraps terminal, passenger terminal, dry bulk terminal, liquid bulk terminal, oil terminal, chemicals terminal and three container terminals, 76 berths, a quay length of , a total storage area of  and a storage capacity of 401,468 tonnes.[http://www.priokport.co.id/index.php?langeng&mod\nfasilitas&smod=pokok Port of Jakarta facilities]\n\nIn December 2011, Muara Angke Port was renovated for Rp 130 billion ($14.4 million) in a 3 hectare area. Muara Angke Port would then be used as a public port to Thousand Islands (Indonesia), while Marina Ancol Port would be used as a tourist port.\n\nRiver\n\nOn 6 June 2007, the city administration introduced the Waterway (officially Angkutan Sungai), a new river boat service along the Ciliwung River. However, because of the large amount of floating garbage which kept jamming the propeller, it is no longer in service. The varying water levels during the dry and wet seasons were also a contributing factor to the close-down.\n\nCityscape\n\nArchitecture\n\nJakarta has architecturally significant buildings in a wide range of styles spanning distinct historical and cultural periods. Architectural styles reflect Malay, Javanese, Arabic, Chinese and Dutch influences. The external influence gives a role in forming the architecture of the Betawi house. The houses were built of nangka wood (Artocarpus integrifolia) and comprised three rooms. The shape of the roof is reminiscent of the traditional Javanese joglo. There are six hundred  registered cultural heritage buildings in Jakarta.\n\nColonial buildings and structures in Jakarta include those that were constructed during the Dutch colonial period of Indonesia. The dominant styles of the Dutch colonial period can be divided into three periods: the Dutch Golden Age (17th to late 18th century), the transitional style period (late 18th century – 19th century), and Dutch modernism (20th century). Dutch colonial architecture in Jakarta is apparent in buildings such as houses or villas, churches, civic buildings, and offices, mostly concentrated in the Jakarta Old Town and Central Jakarta. Architects such as J.C. Schultze and Eduard Cuypers designed some significant buildings in Jakarta. Works of Schultze includes Jakarta Art Building, the Indonesia Supreme Court Building and Ministry of Finance Building, while Cuypers designed Bank Indonesia Museum and Bank Mandiri Museum.\n\nAt the early 20th century, most of the buildings in the Jakarta were built in Neo Renaissance style of Europe. By the 1920s, the architectural taste have begun to shift in favour of rationalism and modernist movement, particularly there was increasing art deco architecture. The elite suburbs Menteng, developed during the 1910s, was the city's first attempt at creating an ideal and healthy housing area for the middle class. The original houses had a longitudinal organisation of space, as well as overhanging eaves, large windows and open ventilation, all practical features for a tropical climate with a hint of modern art deco. It was developed by the private real estate company N.V. de Bouwploeg, established by P.A.J. Moojen.\n\nAfter independence, the process of nation building in Indonesia and demolishing the memory of Dutch colonialism was as important as the symbolic building of arterials, monuments, government buildings during the Sukarno era. The National Monument in Jakarta, designed by Sukarno, is Indonesia's beacon nationalism. In the early 1960s, Jakarta with Soviet Union funding providing infrastructure development for highways and super-scale cultural monuments as well as Senayan Sports Stadium. The parliament building features a hyperbolic shaped roof reminiscent of German rationalist and Corbusian design concepts. In 1996, Wisma 46 soars to height of 262 m with forty eight stories and its nib shaped top celebrates technology and symbolises stereoscopy.\n\nThe urban construction booms have continued in the 21st century and are shaping skylines in Jakarta. Golden Triangle of Jakarta is one of the fastest evolving CBD in Asia-Pacific region.  According to CTBUH and Emporis, there are 88 skyscrapers that reaches or exceeds the height of 150 m in Jakarta, which puts the city at the top 10 of world rankings. It has more buildings taller than 500 feet (150 m) than any other Southeast Asia's cities as well as southern hemisphere. At present Gama Tower with 310 meters tip height is the tallest building in Jakarta.\n\nLandmarks\n\nMost of Jakarta's landmarks, monuments and statues were built during the Sukarno era beginning in the 1960s, then completed in the Suharto era, while some originated in the colonial Dutch East Indies period.\n\nThe most famous Jakarta's landmark that become the symbol of the city is the 132 m obelisk of National Monument (Monumen Nasional or Monas) right in the centre of Merdeka Square. On its southwest corner stands a Mahabharata themed Arjuna Wijaya chariot statue and fountain. Further south through Jalan M.H. Thamrin, one of the main avenue of Jakarta, the Selamat Datang monument stands on the fountain in the centre of Hotel Indonesia roundabout. Other landmarks include the Istiqlal Mosque, the Jakarta Cathedral and Immanuel Church. The former Batavia Stadhuis, Sunda Kelapa port in Jakarta Old Town is also the city's landmark. Gama Tower building at Jalan H.R. Rasuna Said, South Jakarta is currently the tallest building in Indonesia.\n\nSome of statues and monuments in Jakarta are nationalist, such as the West Irian Liberation monument, Youth statue and Dirgantara statue. Several Indonesian national heroes are commemorated in statues, such as Diponegoro and Kartini statues in Merdeka Square, Sudirman and Thamrin statues located in each respectable avenues, also Sukarno and Hatta statues in Proclamation Monument also on the entrance of Soekarno–Hatta International Airport.\n\nSports\n\nJakarta was host of the 1962 Asian Games and will host the upcoming 2018 Asian Games, co-hosted by Palembang. Jakarta also hosted the regional-scale Southeast Asian Games in 1979, 1987, 1997, and 2011 where it serves as supporting city for Palembang. Gelora Bung Karno Stadium, located in Central Jakarta, hosted the group stage, quarterfinal and final of 2007 AFC Asian Cup along with Malaysia, Thailand and Vietnam.\n\nJakarta's most popular home football club is Persija, which plays its matches in their home stadium at Bung Karno Stadium. The home match of Persija often draws its large fanbase – The Jak, usually clad in Persija's typical orange kit – to watch the match in the main stadium. The large number of spectators flocking to the main stadium usually worsen the traffic congestion in Jakarta. Another football team in Jakarta is Persitara who compete in Liga Indonesia Premier Division and play its games in Kamal Muara Stadium. Kamal, North Jakarta.\n\nThe biggest stadium in Jakarta is Gelora Bung Karno Stadium, with a capacity of 88,083 seats. The Senayan sports complex has several sport venues, including the Bung Karno football stadium, Madya Stadium, Istora Senayan, aquatic arena, baseball field, basketball court, badminton court, a shooting range, several indoor and outdoor tennis court and a golf driving range. The Senayan complex was built in 1959 to accommodate the Asian Games in 1962. For basketball, the Kelapa Gading Sport Mall in Kelapa Gading, North Jakarta, with a capacity of 7,000 seats, is the home arena of the Indonesian national basketball team. The BritAma Arena serves as playground for Satria Muda Pertamina Jakarta, 2017 Runner-up of the Indonesian Basketball League.\n\nThe Jakarta Car-free Days are held weekly on Sunday on the main avenues of the city, Jalan Sudirman and Jalan Thamrin, from 6 am to 11 am. The briefer Car-Free Day which lasts from only 6 am to 9 am is held on every other Sunday. The event invites local pedestrians to do sports and exercise and have their activities on the streets that are normally full of cars and traffic. Along the road from the Senayan traffic circle on Jalan Sudirman, South Jakarta, to the \"Selamat Datang\" Monument at the Hotel Indonesia traffic circle on Jalan Thamrin, all the way north to the National Monument in Central Jakarta, cars are cleared out for pedestrians. Morning gymnastics, calisthenics and aerobic exercises, futsal games, jogging, bicycling, skateboarding, badminton, karate, on-street library, and musical performances take over the roads and the main parks in Jakarta.\n\nJakarta Marathon is said to be the \"biggest running event of Indonesia\". It is recognised by AIMS and IAAF. First established in 2013 to promote Jakarta as sports tourism city. In 2015 edition of marathon, more than 15,000 runners from 53 countries were participated.\n\nEducation\n\nJakarta is home to a number of universities, of which the University of Indonesia (UI) is the largest and oldest tertiary-level educational institution in Indonesia. It is a public institution with campuses in Salemba (central Jakarta) and in Depok to the south of Jakarta. Aside from the University of Indonesia, the three other public universities in Jakarta are: Syarif Hidayatullah State Islamic University Jakarta, the [http://www.unj.ac.id/ State University of Jakarta] (UNJ) and the [http://www.upnvj.ac.id/id.html University of Pembangunan Nasional \"Veteran\" Jakarta] (UPN \"Veteran\" Jakarta). Some major private universities in Jakarta are: Trisakti University, The Christian University of Indonesia, Mercu Buana University, Tarumanagara University, Atma Jaya Catholic University of Indonesia, Pelita Harapan University, [https://binus.ac.id/ Bina Nusantara University], [http://www.jayabaya.ac.id/ Jayabaya University], and [http://www.univpancasila.ac.id/ Pancasila University].\n\nSTOVIA (School tot Opleiding van Indische Artsen) was the first high school in Jakarta, established in 1851. As the largest city and the capital, Jakarta houses many students from around Indonesia, many of whom reside in dormitories or home-stay residences. For basic education, there are a variety of primary and secondary schools, tagged with public (national), private (national and bi-lingual national plus) and international schools. Four of the major international schools located in Jakarta are the Gandhi Memorial International School, [http://www.iics.sch.id/ IPEKA International Christian School], Jakarta Intercultural School and the British School Jakarta. Other international schools include the Jakarta International Korean School, Bina Bangsa School, [https://www.jms.sch.id/ Jakarta International Multicultural School], Australian International School, [http://nzis.school.nz/ New Zealand International School], Singapore International School, and Sekolah Pelita Harapan.\n\nInternational relations\n\nAs the capital city of Indonesia, Jakarta host numbers of embassies of foreign countries that has established diplomatic relations with Indonesia. Jakarta also serves as the seat of Association of Southeast Asian Nations (ASEAN) Secretariat; numbers of foreign countries has appointed their embassies also serving as the representative and mission for ASEAN, thus making Jakarta as the diplomatic capital of ASEAN.\n\nJakarta is also a member of the Asian Network of Major Cities 21 and the C40 Cities Climate Leadership Group.\n\nTwin towns – Sister cities\n\nJakarta signed sister city agreements with other cities, one of them is Casablanca, Morocco's largest city, that have signed sister city agreement on 21 September 1990. To promote friendship between two cities, Jalan Casablanca, a main avenue famous for its shopping and business centres in South Jakarta, was named after Jakarta's Moroccan sister city. Currently there is no street in Casablanca named after Jakarta, however on the other hand in Rabat, Morocco's capital city, an avenue was named after Sukarno, Indonesia's first president, to commemorate his visit in 1960 also as a token of friendship.\n\nAlso within sister cities co-operation, Jakarta has established partnership with Rotterdam of the Netherlands, especially on integrated urban water management, including capacity building and knowledge exchange. This co-operation is mainly because Jakarta and Rotterdam are dealing with similar problems; both cities lies in low-lying flat plain prone of flooding. Plus some of their areas lies below sea level, making an urban drainage system involving canals, dams and pumps is vital for both city. Jakarta seeks to learn from Rotterdam's expertise and experiences on water management. Jakarta. http://en.wikipedia.org/?curid=16275."
  }
}
