{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10517",
  "eid" : "f5fa22e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778492430,
  "textBody" : "In microeconomics, economies of scale are the cost advantages that  enterprises obtain due to their scale of operation (typically measured by amount of output produced), with cost per unit of output decreasing with increasing scale.\n\nEconomies of scale apply to a variety of organizational and business situations and at various levels, such as a business or manufacturing unit, plant or an entire enterprise. When average costs start falling as output increases, then economies of scale are occurring. \nSome economies of scale, such as capital cost of manufacturing facilities and friction loss of transportation and industrial equipment, have a physical or engineering basis.\n\nAnother source of scale economies is the possibility of purchasing inputs at a lower per-unit cost when they are purchased in large quantities.\n\nThe economic concept dates back to Adam Smith and the idea of obtaining larger production returns through the use of division of labor. Diseconomies of scale are the opposite.\n\nEconomies of scale often have limits, such as passing the optimum design point where costs per additional unit begin to increase.  Common limits include exceeding the nearby raw material supply, such as wood in the lumber, pulp and paper industry. A common limit for low cost per unit weight commodities is saturating the regional market, thus having to ship product uneconomical distances. Other limits include using energy less efficiently or having a higher defect rate.\n\nLarge producers are usually efficient at long runs of a product grade (a commodity) and find it costly to switch grades frequently.  They will therefore avoid specialty grades even though they have higher margins.  Often smaller (usually older) manufacturing facilities remain viable by changing from commodity grade production to specialty products.Manufacture of specialty grades by small scale producers is a common practice in steel, paper and many commodity industries today.  See various industry trade publications.\n\nOverview\n\nThe simple meaning of economies of scale is doing things more efficiently with increasing size or speed of operation.\n\n  Economies of scale often rely on fixed cost which are constant and don't vary with output, and variable costs which can be effected with the amount of output.  In wholesale and retail distribution, increasing the speed of operations, such as order fulfillment, lowers the cost of both fixed and working capital.  Other common sources of economies of scale are purchasing (bulk buying of materials through long-term contracts), managerial (increasing the specialization of managers), financial (obtaining lower-interest charges when borrowing from banks and having access to a greater range of financial instruments), marketing (spreading the cost of advertising over a greater range of output in media markets), and technological (taking advantage of returns to scale in the production function). Each of these factors reduces the long run average costs (LRAC) of production by shifting the short-run average total cost (SRATC) curve down and to the right.\n\nEconomies of the scale is a practical concept that may explain real world phenomena such as patterns of international trade or the number of firms in a market. The exploitation of economies of scale helps explain why companies grow large in some industries. It is also a justification for free trade policies, since some economies of scale may require a larger market than is possible within a particular country—for example, it would not be efficient for Liechtenstein to have its own car maker, if they only sold to their local market. A lone car maker may be profitable, but even more so if they exported cars to global markets in addition to selling to the local market. Economies of scale also play a role in a \"natural monopoly\". There is a distinction between two types of economies of scale: internal and external. An industry that exhibits an internal economy of scale is one where the costs of production falls when the number of firms in the industry drops, but the remaining firms increase their production to match previous levels. Conversely, an industry exhibits an external economy of scale when costs drop due to the introduction of more firms, thus allowing for more efficient use of specialized services and machinery. \n\nThe management thinker and translator of the Toyota Production System for service, Professor John Seddon, argues that attempting to create economies by increasing scale is powered by myth in the service sector. Instead, he believes that economies will come from improving the flow of a service, from first receipt of a customer’s demand to the eventual satisfaction of that demand. In trying to manage and reduce unit costs, firms often raise total costs by creating failure demand. Seddon claims that arguments for economy of scale are a mix of a) the plausibly obvious and b) a little hard data, brought together to produce two broad assertions, for which there is little hard factual evidence.\n\nPhysical and engineering basis\n\nSome of the economies of scale recognized in engineering have a physical basis, such as the square-cube law, by which the surface of a vessel increases by the square of the dimensions while the volume increases by the cube.  This law has a direct effect on the capital cost of such things as buildings, factories, pipelines, ships and airplanes.See various estimating guides, such as Means.  Also see various engineering economics texts related to plant design and construction, etc.\n\nIn structural engineering, the strength of beams increases with the cube of the thickness.\n\nDrag loss of vehicles like aircraft or ships generally increases less than proportional with increasing cargo volume, although the physical details can be quite complicated. Therefore, making them larger usually results in less fuel consumption per ton of cargo at a given speed.\n\nHeat losses from industrial processes vary per unit of volume for pipes, tanks and other vessels in a relationship somewhat similar to the square-cube law.The relationship is rather complex.  See engineering texts on heat transfer.\n\nCapital and operating cost\n\nOverall costs of capital projects are known to be subject to economies of scale.  A crude estimate is that if the capital cost for a given sized piece of equipment is known, changing the size will change the capital cost by the 0.6 power of the capacity ratio (the point six power rule).In practice, capital cost estimates are prepared from specifications, budget grade vendor pricing for equipment, general arrangement drawings and materials take-offs from the drawings.  This information is then used in cost formulas to arrive at a final detailed estimate.\n\nIn estimating capital cost, it typically requires an insignificant amount of labor, and possibly not much more in materials, to install a larger capacity electrical wire or pipe having significantly greater capacity.See various estimating guides that publish tables of tasks commonly encountered in building trades with estimates of labor hours and costs per hour for the trade, often with regional pricing.\n\nThe cost of a unit of capacity of many types of equipment, such as electric motors, centrifugal pumps, diesel and gasoline engines, decreases as size increases.  Also, the efficiency increases with size.See various engineering handbooks and manufacturers data.\n\nCrew size and other operating costs for ships, trains and airplanes\n\nOperating crew size for ships, airplanes, trains, etc., does not increase in direct proportion to capacity.\n  (Operating crew consists of pilots, co-pilots, navigators, etc. and does not include passenger service personnel.)  Many aircraft models were significantly lengthened or \"stretched\" to increase payload.\n\nMany manufacturing facilities, especially those making bulk materials like chemicals, refined petroleum products, cement and paper, have labor requirements that are not greatly influenced by changes in plant capacity.  This is because labor requirements of automated processes tend to be based on the complexity of the operation rather than production rate, and many manufacturing facilities have nearly the same basic number of processing steps and pieces of equipment, regardless of production capacity.\n\nEconomical use of byproducts\n\nKarl Marx noted that large scale manufacturing allowed economical use of products that would otherwise be waste.  Marx cited the chemical industry as an example, which today along with petrochemicals, remains highly dependent on turning various residual reactant streams into salable products.  In the pulp and paper industry it is economical to burn bark and fine wood particles to produce process steam and to recover the spent pulping chemicals for conversion back to a usable form.\n\nEconomies of scale and returns to scale\n\nEconomies of scale is related to and can easily be confused with the theoretical economic notion of returns to scale.  Where economies of scale refer to a firm's costs, returns to scale describe the relationship between inputs and outputs in a long-run (all inputs variable) production function. A production function has constant returns to scale if increasing all inputs by some proportion results in output increasing by that same proportion. Returns are decreasing if, say, doubling inputs results in less than double the output, and increasing if more than double the output.  If a mathematical function is used to represent the production function, and if that production function is homogeneous, returns to scale are represented by the degree of homogeneity of the function.  Homogeneous production functions with constant returns to scale are first degree homogeneous, increasing returns to scale are represented by degrees of homogeneity greater than one, and decreasing returns to scale by degrees of homogeneity less than one.\n\nIf the firm is a perfect competitor in all input markets, and thus the per-unit prices of all its inputs are unaffected by how much of the inputs the firm purchases, then it can be shown that at a particular level of output, the firm has economies of scale if and only if it has increasing returns to scale, has diseconomies of scale if and only if it has decreasing returns to scale, and has neither economies nor diseconomies of scale if it has constant returns to scale.  In this case, with perfect competition in the output market the long-run equilibrium will involve all firms operating at the minimum point of their long-run average cost curves (i.e., at the borderline between economies and diseconomies of scale).\n\nIf, however, the firm is not a perfect competitor in the input markets, then the above conclusions are modified.  For example, if there are increasing returns to scale in some range of output levels, but the firm is so big in one or more input markets that increasing its purchases of an input drives up the input's per-unit cost, then the firm could have diseconomies of scale in that range of output levels.  Conversely, if the firm is able to get bulk discounts of an input, then it could have economies of scale in some range of output levels even if it has decreasing returns in production in that output range.\n\nThe literature assumed that due to the competitive nature of reverse auctions, and in order to compensate for lower prices and lower margins, suppliers seek higher volumes to maintain or increase the total revenue. Buyers, in turn, benefit from the lower transaction costs and economies of scale that result from larger volumes. In part as a result, numerous studies have indicated that the procurement volume must be sufficiently high to provide sufficient profits to attract enough suppliers, and provide buyers with enough savings to cover their additional costs.\n\nHowever, surprisingly enough, Shalev and Asbjornsen found, in their research based on 139 reverse auctions conducted in the public sector by public sector buyers, that the higher auction volume, or economies of scale, did not lead to better success of the auction. They found that auction volume did not correlate with competition, nor with the number of bidders, suggesting that auction volume does not promote additional competition. They noted, however, that their data included a wide range of products, and the degree of competition in each market varied significantly, and offer that further research on this issue should be conducted to determine whether these findings remain the same when purchasing the same product for both small and high volumes. Keeping competitive factors constant, increasing auction volume may further increase competition.\n\nDistributional consequences \n\nIn his 1844 Economic and Philosophic Manuscripts, Karl Marx observes that economies of scale have historically been associated with increasing concentration of private wealth, and have been used to justify such concentration. Marx points out that concentrated private ownership of large-scale economic enterprises is a historically contingent fact, and not essential to the nature of such enterprises. In the case of agriculture, for example, Marx calls attention to the sophistical nature of the arguments used to justify the system of concentrated ownership of land:\n\nAs for large landed property, its defenders have always sophistically identified the economic advantages offered by large-scale agriculture with large-scale landed property, as if it were not precisely as a result of the abolition of property that this advantage, for one thing, received its greatest possible extension, and, for another, only then would be of social benefit.Karl Marx, Economic and Philosophic Manuscripts of 1844, M. Milligan, trans. (1988), p. 65-66\n\nInstead of concentrated private ownership of land, Marx recommends that economies of scale should instead be realized by associations:\n\nAssociation, applied to land, shares the economic advantage of large-scale landed property, and first brings to realization the original tendency inherent in land-division, namely, equality. In the same way association re-establishes, now on a rational basis, no longer mediated by serfdom, overlordship and the silly mysticism of property, the intimate ties of man with the earth, for the earth ceases to be an object of huckstering, and through free labor and free enjoyment becomes once more a true personal property of man.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Economies of scale" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10517" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In microeconomics, economies of scale are the cost advantages that  enterprises obtain due to their scale of operation (typically measured by amount of output produced), with cost per unit of output decreasing with increasing scale.\n\nEconomies of scale apply to a variety of organizational and business situations and at various levels, such as a business or manufacturing unit, plant or an entire enterprise. When average costs start falling as output increases, then economies of scale are occurring. \nSome economies of scale, such as capital cost of manufacturing facilities and friction loss of transportation and industrial equipment, have a physical or engineering basis.\n\nAnother source of scale economies is the possibility of purchasing inputs at a lower per-unit cost when they are purchased in large quantities.\n\nThe economic concept dates back to Adam Smith and the idea of obtaining larger production returns through the use of division of labor. Diseconomies of scale are the opposite.\n\nEconomies of scale often have limits, such as passing the optimum design point where costs per additional unit begin to increase.  Common limits include exceeding the nearby raw material supply, such as wood in the lumber, pulp and paper industry. A common limit for low cost per unit weight commodities is saturating the regional market, thus having to ship product uneconomical distances. Other limits include using energy less efficiently or having a higher defect rate.\n\nLarge producers are usually efficient at long runs of a product grade (a commodity) and find it costly to switch grades frequently.  They will therefore avoid specialty grades even though they have higher margins.  Often smaller (usually older) manufacturing facilities remain viable by changing from commodity grade production to specialty products.Manufacture of specialty grades by small scale producers is a common practice in steel, paper and many commodity industries today.  See various industry trade publications.\n\nOverview\n\nThe simple meaning of economies of scale is doing things more efficiently with increasing size or speed of operation.\n\n  Economies of scale often rely on fixed cost which are constant and don't vary with output, and variable costs which can be effected with the amount of output.  In wholesale and retail distribution, increasing the speed of operations, such as order fulfillment, lowers the cost of both fixed and working capital.  Other common sources of economies of scale are purchasing (bulk buying of materials through long-term contracts), managerial (increasing the specialization of managers), financial (obtaining lower-interest charges when borrowing from banks and having access to a greater range of financial instruments), marketing (spreading the cost of advertising over a greater range of output in media markets), and technological (taking advantage of returns to scale in the production function). Each of these factors reduces the long run average costs (LRAC) of production by shifting the short-run average total cost (SRATC) curve down and to the right.\n\nEconomies of the scale is a practical concept that may explain real world phenomena such as patterns of international trade or the number of firms in a market. The exploitation of economies of scale helps explain why companies grow large in some industries. It is also a justification for free trade policies, since some economies of scale may require a larger market than is possible within a particular country—for example, it would not be efficient for Liechtenstein to have its own car maker, if they only sold to their local market. A lone car maker may be profitable, but even more so if they exported cars to global markets in addition to selling to the local market. Economies of scale also play a role in a \"natural monopoly\". There is a distinction between two types of economies of scale: internal and external. An industry that exhibits an internal economy of scale is one where the costs of production falls when the number of firms in the industry drops, but the remaining firms increase their production to match previous levels. Conversely, an industry exhibits an external economy of scale when costs drop due to the introduction of more firms, thus allowing for more efficient use of specialized services and machinery. \n\nThe management thinker and translator of the Toyota Production System for service, Professor John Seddon, argues that attempting to create economies by increasing scale is powered by myth in the service sector. Instead, he believes that economies will come from improving the flow of a service, from first receipt of a customer’s demand to the eventual satisfaction of that demand. In trying to manage and reduce unit costs, firms often raise total costs by creating failure demand. Seddon claims that arguments for economy of scale are a mix of a) the plausibly obvious and b) a little hard data, brought together to produce two broad assertions, for which there is little hard factual evidence.\n\nPhysical and engineering basis\n\nSome of the economies of scale recognized in engineering have a physical basis, such as the square-cube law, by which the surface of a vessel increases by the square of the dimensions while the volume increases by the cube.  This law has a direct effect on the capital cost of such things as buildings, factories, pipelines, ships and airplanes.See various estimating guides, such as Means.  Also see various engineering economics texts related to plant design and construction, etc.\n\nIn structural engineering, the strength of beams increases with the cube of the thickness.\n\nDrag loss of vehicles like aircraft or ships generally increases less than proportional with increasing cargo volume, although the physical details can be quite complicated. Therefore, making them larger usually results in less fuel consumption per ton of cargo at a given speed.\n\nHeat losses from industrial processes vary per unit of volume for pipes, tanks and other vessels in a relationship somewhat similar to the square-cube law.The relationship is rather complex.  See engineering texts on heat transfer.\n\nCapital and operating cost\n\nOverall costs of capital projects are known to be subject to economies of scale.  A crude estimate is that if the capital cost for a given sized piece of equipment is known, changing the size will change the capital cost by the 0.6 power of the capacity ratio (the point six power rule).In practice, capital cost estimates are prepared from specifications, budget grade vendor pricing for equipment, general arrangement drawings and materials take-offs from the drawings.  This information is then used in cost formulas to arrive at a final detailed estimate.\n\nIn estimating capital cost, it typically requires an insignificant amount of labor, and possibly not much more in materials, to install a larger capacity electrical wire or pipe having significantly greater capacity.See various estimating guides that publish tables of tasks commonly encountered in building trades with estimates of labor hours and costs per hour for the trade, often with regional pricing.\n\nThe cost of a unit of capacity of many types of equipment, such as electric motors, centrifugal pumps, diesel and gasoline engines, decreases as size increases.  Also, the efficiency increases with size.See various engineering handbooks and manufacturers data.\n\nCrew size and other operating costs for ships, trains and airplanes\n\nOperating crew size for ships, airplanes, trains, etc., does not increase in direct proportion to capacity.\n  (Operating crew consists of pilots, co-pilots, navigators, etc. and does not include passenger service personnel.)  Many aircraft models were significantly lengthened or \"stretched\" to increase payload.\n\nMany manufacturing facilities, especially those making bulk materials like chemicals, refined petroleum products, cement and paper, have labor requirements that are not greatly influenced by changes in plant capacity.  This is because labor requirements of automated processes tend to be based on the complexity of the operation rather than production rate, and many manufacturing facilities have nearly the same basic number of processing steps and pieces of equipment, regardless of production capacity.\n\nEconomical use of byproducts\n\nKarl Marx noted that large scale manufacturing allowed economical use of products that would otherwise be waste.  Marx cited the chemical industry as an example, which today along with petrochemicals, remains highly dependent on turning various residual reactant streams into salable products.  In the pulp and paper industry it is economical to burn bark and fine wood particles to produce process steam and to recover the spent pulping chemicals for conversion back to a usable form.\n\nEconomies of scale and returns to scale\n\nEconomies of scale is related to and can easily be confused with the theoretical economic notion of returns to scale.  Where economies of scale refer to a firm's costs, returns to scale describe the relationship between inputs and outputs in a long-run (all inputs variable) production function. A production function has constant returns to scale if increasing all inputs by some proportion results in output increasing by that same proportion. Returns are decreasing if, say, doubling inputs results in less than double the output, and increasing if more than double the output.  If a mathematical function is used to represent the production function, and if that production function is homogeneous, returns to scale are represented by the degree of homogeneity of the function.  Homogeneous production functions with constant returns to scale are first degree homogeneous, increasing returns to scale are represented by degrees of homogeneity greater than one, and decreasing returns to scale by degrees of homogeneity less than one.\n\nIf the firm is a perfect competitor in all input markets, and thus the per-unit prices of all its inputs are unaffected by how much of the inputs the firm purchases, then it can be shown that at a particular level of output, the firm has economies of scale if and only if it has increasing returns to scale, has diseconomies of scale if and only if it has decreasing returns to scale, and has neither economies nor diseconomies of scale if it has constant returns to scale.  In this case, with perfect competition in the output market the long-run equilibrium will involve all firms operating at the minimum point of their long-run average cost curves (i.e., at the borderline between economies and diseconomies of scale).\n\nIf, however, the firm is not a perfect competitor in the input markets, then the above conclusions are modified.  For example, if there are increasing returns to scale in some range of output levels, but the firm is so big in one or more input markets that increasing its purchases of an input drives up the input's per-unit cost, then the firm could have diseconomies of scale in that range of output levels.  Conversely, if the firm is able to get bulk discounts of an input, then it could have economies of scale in some range of output levels even if it has decreasing returns in production in that output range.\n\nThe literature assumed that due to the competitive nature of reverse auctions, and in order to compensate for lower prices and lower margins, suppliers seek higher volumes to maintain or increase the total revenue. Buyers, in turn, benefit from the lower transaction costs and economies of scale that result from larger volumes. In part as a result, numerous studies have indicated that the procurement volume must be sufficiently high to provide sufficient profits to attract enough suppliers, and provide buyers with enough savings to cover their additional costs.\n\nHowever, surprisingly enough, Shalev and Asbjornsen found, in their research based on 139 reverse auctions conducted in the public sector by public sector buyers, that the higher auction volume, or economies of scale, did not lead to better success of the auction. They found that auction volume did not correlate with competition, nor with the number of bidders, suggesting that auction volume does not promote additional competition. They noted, however, that their data included a wide range of products, and the degree of competition in each market varied significantly, and offer that further research on this issue should be conducted to determine whether these findings remain the same when purchasing the same product for both small and high volumes. Keeping competitive factors constant, increasing auction volume may further increase competition.\n\nDistributional consequences \n\nIn his 1844 Economic and Philosophic Manuscripts, Karl Marx observes that economies of scale have historically been associated with increasing concentration of private wealth, and have been used to justify such concentration. Marx points out that concentrated private ownership of large-scale economic enterprises is a historically contingent fact, and not essential to the nature of such enterprises. In the case of agriculture, for example, Marx calls attention to the sophistical nature of the arguments used to justify the system of concentrated ownership of land:\n\nAs for large landed property, its defenders have always sophistically identified the economic advantages offered by large-scale agriculture with large-scale landed property, as if it were not precisely as a result of the abolition of property that this advantage, for one thing, received its greatest possible extension, and, for another, only then would be of social benefit.Karl Marx, Economic and Philosophic Manuscripts of 1844, M. Milligan, trans. (1988), p. 65-66\n\nInstead of concentrated private ownership of land, Marx recommends that economies of scale should instead be realized by associations:\n\nAssociation, applied to land, shares the economic advantage of large-scale landed property, and first brings to realization the original tendency inherent in land-division, namely, equality. In the same way association re-establishes, now on a rational basis, no longer mediated by serfdom, overlordship and the silly mysticism of property, the intimate ties of man with the earth, for the earth ceases to be an object of huckstering, and through free labor and free enjoyment becomes once more a true personal property of man. Economies of scale. http://en.wikipedia.org/?curid=10517."
  }
}
