{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15496",
  "eid" : "1cb43ab0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778557403,
  "textBody" : "Serie A, also called Serie A TIM due to sponsorship by TIM, is a professional league competition for football clubs located at the top of the Italian football league system and the winner is awarded the Coppa Campioni d'Italia. It has been operating for over eighty years since the 1929–30 season. It had been organized by Lega Calcio until 2010, when the Lega Serie A was created for the 2010–11 season.\n\nSerie A is regarded as one of the best football leagues in the world and it is often depicted as the most tactical national league.[http://www.sportfive.com/index.php?id=1182 The Big Five Leagues] Serie A is the world's second-strongest national league according to IFFHS and has produced the highest number of European Cup finalists: Italian clubs have reached the final of the competition on a record 27 different occasions, winning the title 12 times. Serie A is ranked third among European leagues according to UEFA's league coefficient, behind La Liga, the Premier League and ahead of the Bundesliga and the Ligue 1, which is based on the performance of Italian clubs in the Champions League and the Europa League during the last five years. Serie A led the UEFA ranking from 1986 to 1988 and from 1990 to 1999.\n\nIn its current format, the Italian Football Championship was revised from having regional and interregional rounds, to a single-tier league from the 1929–30 season onwards. The championship titles won prior to 1929 are officially recognised by FIGC with the same weighting as titles that were subsequently awarded. However, the 1945–46 season, when the league was played over two geographical groups due to the ravages of WWII, is not statistically considered, even if its title is fully official. All the winning teams are recognised with the title of Campione d'Italia (\"Champion of Italy\"), which is ratified by the Lega Serie A before the start of the next edition of the championship.\n\nThe league hosts three of the world's most famous clubs as Juventus, Milan and Internazionale, all founding members of the G-14, a group which represented the largest and most prestigious European football clubs since 2000 to 2008, being the first two cited also founding members of its successive organisation, European Club Association (ECA). More players have won the coveted Ballon d'Or award while playing at a Serie A club than any other league in the world – although Spain's La Liga has the highest total number of Ballon d'Or winners including the FIFA Ballon d'Or. Juventus, Italy's most successful club of the 20th century and the most successful Italian team, is tied for fourth in Europe and eighth in the world with the most official international titles.Fourth most successful European club for confederation and FIFA competitions won with 11 titles. Fourth most successful club in Europe for confederation club competition titles won (11), cf.  The club is also the only one in the world to have won all possible official confederation competitions. Milan is joint third club for official international titles won in the world, with 18. Internazionale, following their achievements in the 2009–10 season, became the first Italian team to have achieved a treble. Juventus, Milan and Inter, along with Roma, Fiorentina, Lazio and Napoli, are known as the Seven Sisters of Italian football.[http://m.diariodelweb.it/calcio/articolo/?nid20150822_347049 Serie A al via: le sette sorelle sono tornate]In the 1990s, when the term originated, Parma was seen as one the Seven Sisters and Napoli was not included\n\nSerie A is one of the most storied leagues in the history of football. Of the 100 greatest footballers in history chosen by FourFourTwo magazine in 2017, 42 players have played in Serie A, more than any other league in the world.\n\nFormat\n\nFor most of Serie A's history, there were 16 or 18 clubs competing at the top level. Since 2004–05, however, there have been 20 clubs altogether. One season (1947–48) was played with 21 teams for political reasons. Below is a complete record of how many teams played in each season throughout the league's history;\n* 18 clubs: 1929–1934\n* 16 clubs: 1934–1943\n* 20 clubs: 1946–1947\n* 21 clubs: 1947–1948\n* 20 clubs: 1948–1952\n* 18 clubs: 1952–1967\n* 16 clubs: 1967–1988\n* 18 clubs: 1988–2004\n* 20 clubs: 2004–present\n\nDuring the season, which runs from August to May, each club plays each of the other teams twice; once at home and once away, totalling 38 games for each team by the end of the season. Thus, in Italian football a true round-robin format is used. In the first half of the season, called the andata, each team plays once against each league opponent, for a total of 19 games. In the second half of the season, called the ritorno, the teams play in exactly the same order that they did in the first half of the season, the only difference being that home and away situations are switched. Since the 1994–95 season, teams are awarded three points for a win, one point for a draw and no points for a loss.\n\nSince Italy is currently rated fourth in Europe in terms of club football ratings, the top three teams in the Serie A qualify for the UEFA Champions League (from the 2011–12 season). The top two teams qualify directly to the group phase, while the third-placed team enters the competition at the playoff qualifying round and must win a two-legged knockout tie in order to enter the group phase. Teams finishing fourth and fifth qualify for the UEFA Europa League tournament. A third UEFA Europa League spot is reserved for the winner of the Coppa Italia. If the Coppa Italia champion already qualified for European football by finishing among the top five teams in Serie A, the sixth-ranked team in Serie A is awarded the UEFA Europa League spot. The three lowest-placed teams are relegated to Serie B.\n\nFrom 2005–06 season if 2 or more teams are tied in points (for every place), the deciding tie-breakers are follows:\n\n# Head-to-head records (results and points)\n# Goal difference of head-to-head games\n# Goal difference overall\n# Higher number of goals scored\n# Draw\n\nUntil 2004–05 season, a playoff would be used to determine the champions, European spots or relegation, if the two teams were tied on points. Any play-off was held after the end of regular season. The last championship playoff occurred in the 1963-64 season when Bologna and Inter both finished on 54 points. Bologna won the play-off 2-0.\n\nSerie A clubs\n\nFor more details see List of Italian Football Championship clubs\nPrior to 1929, many clubs competed in the top level of Italian football as the earlier rounds were competed up to 1922 on a regional basis then interregional up to 1929. Below is a list of Serie A clubs who have competed in the competition when it has been a league format (66 in total).\n\n2017–18 members\n\nSeasons in Serie A\n\nThere are 67 teams that have taken part in 86 Serie A championships in a single round that was played from the 1929–30 season until the 2017–18 season. The teams in bold compete in Serie A currently. Internazionale is the only team that has played Serie A football in every season.\n\nHistory\n\nSerie A, as it is structured today, began during the 1929–30 season. From 1898 to 1922, the competition was organised into regional groups. Because of ever growing teams attending regional championships, the Italian Football Federation (FIGC) split the CCI (Italian Football Confederation) in 1921. When CCI teams rejoined the FIGC created two interregional divisions renaming Categories into Divisions and splitting FIGC sections into two North-South leagues. In 1926, due to internal crises, the FIGC changed internal settings, adding southern teams to the national division, ultimately leading to the 1929–30 final settlement. No title was awarded in 1927 after Torino were stripped of the championship by the FIGC. Torino were declared champions in the 1948–49 season following a plane crash near the end of the season in which the entire team was killed.\n\nThe Serie A Championship title is often referred to as the scudetto (\"small shield\") because since the 1924–25 season, the winning team will bear a small coat of arms with the Italian tricolour on their strip in the following season. The most successful club is Juventus with 33 championships, followed by both Milan and Internazionale, with 18 championships apiece. From the 2004–05 season onwards, an actual trophy was awarded to club on the pitch after the last turn of the championship. The trophy, called the Coppa Campioni d'Italia, has officially been used since the 1960–61 season, but between 1961 and 2004 was consigned to the winning clubs at the head office of the Lega Nazionale Professionisti.\n\nIn April 2009, Serie A announced a split from Serie B. Nineteen of the twenty clubs voted in favour of the move in an argument over television rights; the relegation-threatened Lecce had voted against the decision. Maurizio Beretta, the former head of Italy's employers' association, became president of the new league.\n\nIn April 2016, it was announced that Serie A was selected by the International Football Association Board to test video replays, which were initially private for the 2016–17 season, allowing them to become a live pilot phase, with replay assistance implemented in the 2017–18 season. On the decision, FIGC President Carlo Tavecchio said, \"We were among the first supporters of using technology on the pitch and we believe we have everything required to offer our contribution to this important experiment.\"\n\nTelevision rights\n\nIn the past, individual clubs competing in the league had the rights to sell their broadcast rights to specific channels throughout Italy, unlike in most other European countries. Currently, the two broadcasters in Italy are the satellite broadcaster Sky Italia and terrestrial broadcaster Mediaset Premium for its own pay television networks; RAI is allowed to broadcast only highlights (in exclusive from 13:30 to 22:30 CET).\nThis is a list of television rights in Italy (until 2009–10):\n* Sky Italia (all matches)\n* Mediaset Premium (all matches of Milan, Inter, Juventus, Lazio, Roma, Napoli and matches in house and guests of the above teams of Genoa, Atalanta, Chievo, Bari)\n* RAI (highlights)\n\nFor the 2010–11 and 2011–12 seasons, Serie A clubs negotiating club TV rights collectively rather than individually for the first time since 1998–99. The domestic rights for those two seasons were sold for  billion to Sky Italia.\n\nInternational\n\nGlobal rights for the 2010–11 and 2011–12 seasons were sold for  million to MP & Silva.\n\nIn countries and territories outside of Italy, the league is broadcast on:\n\nIn the 1990s, Serie A was at its most popular in the United Kingdom when it was shown on Channel 4, although it has actually appeared on more UK channels than any other league, rarely staying in one place for long since 2002. Serie A has appeared in the UK on BSB Sports Channel (1990–91), Sky Sports (1991–92), Channel 4 (1992–2002), Eurosport (2002–04), Setanta Sports and Bravo (2004–07), Channel 5 (2007–08), ESPN (2009–13) and BT Sport (since 2013).\n\nChampions\n\nBold indicates clubs which will play in the 2017–18 Serie A.\n\n* The overall first places of Juventus are 34: 33 victories of the championship and 1 scudetto revoked in 2004–05.\n* The overall first places of Torino are 8: 7 victories of the championship and 1 scudetto revoked in 1926–27.\n* The overall first places of Genoa are 8: the scudetto won in 1914–15 was assigned to the club with the 1st/2nd place final unplayed.\n* A decoration was awarded to Spezia in 2002 by the FIGC for the 1944 wartime championship. However, the FIGC has stated that it cannot be considered as a scudetto.\n\nBy city \n\nBy region \n\nRecords\n\nPlayers\n\nNon-EU players\n\nUnlike La Liga, which imposed a quota on the number of non-EU players on each club, Serie A clubs could sign as many non-EU players as available on domestic transfer.\n\nDuring the 1980s and 1990s, most Serie A clubs signed a large number of players from foreign nations (both EU and non-EU members). Notable foreign players to play in Serie A during this era included England internationals Paul Gascoigne and David Platt, France's Michel Platini and Laurent Blanc, Lothar Matthäus and Jürgen Klinsmann from Germany, Dutchmen Ruud Gullit and Dennis Bergkamp, and Argentina's Diego Maradona.\n\nBut since the 2003–04 season, a quota has been imposed on each of the clubs limiting the number of non-EU, non-EFTA and non-Swiss players who may be signed from abroad each season, following provisional measures introduced in the 2002–03 season, which allowed Serie A and B clubs to sign only one non-EU player in the 2002 summer transfer window.\n\nIn the middle of the 2000–01 season, the old quota system was abolished, which no longer limited each team to having more than five non-EU players and using no more than three in each match. Concurrent with the abolishment of the quota, the FIGC had investigated footballers that used fake passports. Alberto and Warley, Alejandro Da Silva and Jorginho Paulista of Udinese; Fábio Júnior and Gustavo Bartelt of Roma; Dida of Milan; Álvaro Recoba of Inter; Thomas Job, Francis Zé, Jean Ondoa of Sampdoria; and Jeda and Dede of Vicenza were all banned in July 2001 for lengths ranging from six months to one year. However, most of the bans were subsequently reduced.\n\nThe number of non-EU players was reduced from 265 in 2002–03 season to 166 in 2006–07 season. It also included players who received EU status after their respective countries joined the EU (see 2004 and 2007 enlargement), which made players such as Adrian Mutu, Valeri Bojinov, Marek Jankulovski and Marius Stankevičius EU players.\n\nThe rule underwent minor changes in August 2004, June 2005, June 2006. and June 2007.\n\nSince the 2008–09 season, three quotas have been awarded to clubs that do not have non-EU players in their squad (previously only newly promoted clubs could have three quotas); clubs that have one non-EU player have two quotas. Those clubs that have two non-EU players, are awarded one quota and one conditional quota, which is awarded after: 1) Transferred 1 non-EU player abroad, or 2) Release 1 non-EU player as free agent, or 3) A non-EU player received EU nationality. Clubs with three or more non-EU players, have two conditional quotas, but releasing two non-EU players as free agent, will only have one quota instead of two. Serie B and Lega Pro clubs cannot sign non-EU player from abroad, except those followed the club promoted from Serie D.\n\nLarge clubs with many foreigners usually borrow quotas from other clubs that have few foreigners or no foreigners in order to sign more non-EU players. For example, Adrian Mutu joined Juventus via Livorno in 2005, as at the time Romania was not a member of the EU. Other examples include Júlio César, Victor Obinna and Maxwell, who joined Internazionale from Chievo (first two) and Empoli respectively.\n\nOn 2 July 2010, the above conditional quota reduced back to one, though if a team did not have any non-EU players, that team could still sign up to three non-EU players. In 2011 the signing quota reverted to two.\n\nHomegrown players\n\nSerie A also imposed Homegrown players rule, a modification of Homegrown Player Rule (UEFA). Unlike UEFA, Serie A at first did not cap the number of players in first team squad at 25, meaning the club could employ more foreigners by increasing the size of the squad. However, a cap of 25 (under-21 players were excluded) was introduced to 2015–16 season (in 2015–16 season, squad simply require 8 homegrown players but not require 4 of them from their own youth team). In the 2016–17 season, the FIGC sanctioned Sassuolo for fielding ineligible player, Antonino Ragusa. Although the club did not exceed the capacity of 21 players that were not from their own youth team (only Domenico Berardi was eligible as youth product of their own) as well as under 21 of age (born 1995 or after, of which four players were eligible) in their 24-men call-up, It was reported that on Lega Serie A side the squad list was not updated.\n\nIn 2015–16 season, the following quota was announced.\n\nFIFA World Players of the Year\n\n*  Lothar Matthäus: 1991 (Internazionale)\n*  Marco van Basten: 1992 (Milan)\n*  Roberto Baggio: 1993 (Juventus)\n*  George Weah: 1995 (Milan2)\n*  Ronaldo: 19972 and 20021 (Internazionale)\n*  Zinedine Zidane: 1998, 2000 (Juventus)\n*  Pavel Nedvěd: 2003 (Juventus)\n*  Fabio Cannavaro: 2006 (Juventus1)\n*  Kaká: 2007 (Milan)\n\n1Player was a member of the club for the first half of the calendar year (The second part of a finished season - January to May)\n2Player was a member of the club for the second half of the calendar year (The first part of a new season - August to December)\n\nOfficial match ball\n\n* 2007–2008: Nike T90 Aerow II\n* 2008–2009: Nike T90 Omni\n* 2009–2010: Nike T90 Ascente\n* 2010–2011: Nike T90 Tracer\n* 2011–2012: Nike Seitiro\n* 2012–2013: Nike Maxim\n* 2013–2014: Nike Incyte\n* 2014–present: Nike Ordem\n\nKick-off times\n\nUntil 1993, Serie A matches were all played at the same time, on Sunday afternoon at 2:30 p.m. or 4:30 p.m. (depending on the number of hours of daylight). For the 1993–94 season, Lega Calcio made a notable change: a deferred match, scheduled for Sunday evening at 8:30 p.m. (8:45 p.m. from 2009–10) was made possible. This format was changed again in 1999–2000, due to the emergence of pay television in Italian football:\n\n* Saturday: two matches, the first at 6 p.m and the second at 8:45;\n* Sunday: most of a matchday begins at 3 p.m, while a deferred match is still possible.\n\nIn 2004, due to the presence of 20 teams, it also became possible to play in midweek: on Wednesday evening, with some matches on Tuesday and others on Thursday (at 8:45). In 2010, a \"lunch match\" was introduced: a match played on Sunday at 12:30. Finally, for a few weeks, matches can be played on Friday or on Monday (in the evenings).In 2003, UEFA allowed its federations to change the Kick-off times of matches depending upon the weather: for example in August, matches can be put back at 6 or 7 p.m (instead of 3) in case of warm weather. Likewise, in winter, matches can be at 5 or 6 (rather than 8:45).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Serie A" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15496" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Serie A, also called Serie A TIM due to sponsorship by TIM, is a professional league competition for football clubs located at the top of the Italian football league system and the winner is awarded the Coppa Campioni d'Italia. It has been operating for over eighty years since the 1929–30 season. It had been organized by Lega Calcio until 2010, when the Lega Serie A was created for the 2010–11 season.\n\nSerie A is regarded as one of the best football leagues in the world and it is often depicted as the most tactical national league.[http://www.sportfive.com/index.php?id=1182 The Big Five Leagues] Serie A is the world's second-strongest national league according to IFFHS and has produced the highest number of European Cup finalists: Italian clubs have reached the final of the competition on a record 27 different occasions, winning the title 12 times. Serie A is ranked third among European leagues according to UEFA's league coefficient, behind La Liga, the Premier League and ahead of the Bundesliga and the Ligue 1, which is based on the performance of Italian clubs in the Champions League and the Europa League during the last five years. Serie A led the UEFA ranking from 1986 to 1988 and from 1990 to 1999.\n\nIn its current format, the Italian Football Championship was revised from having regional and interregional rounds, to a single-tier league from the 1929–30 season onwards. The championship titles won prior to 1929 are officially recognised by FIGC with the same weighting as titles that were subsequently awarded. However, the 1945–46 season, when the league was played over two geographical groups due to the ravages of WWII, is not statistically considered, even if its title is fully official. All the winning teams are recognised with the title of Campione d'Italia (\"Champion of Italy\"), which is ratified by the Lega Serie A before the start of the next edition of the championship.\n\nThe league hosts three of the world's most famous clubs as Juventus, Milan and Internazionale, all founding members of the G-14, a group which represented the largest and most prestigious European football clubs since 2000 to 2008, being the first two cited also founding members of its successive organisation, European Club Association (ECA). More players have won the coveted Ballon d'Or award while playing at a Serie A club than any other league in the world – although Spain's La Liga has the highest total number of Ballon d'Or winners including the FIFA Ballon d'Or. Juventus, Italy's most successful club of the 20th century and the most successful Italian team, is tied for fourth in Europe and eighth in the world with the most official international titles.Fourth most successful European club for confederation and FIFA competitions won with 11 titles. Fourth most successful club in Europe for confederation club competition titles won (11), cf.  The club is also the only one in the world to have won all possible official confederation competitions. Milan is joint third club for official international titles won in the world, with 18. Internazionale, following their achievements in the 2009–10 season, became the first Italian team to have achieved a treble. Juventus, Milan and Inter, along with Roma, Fiorentina, Lazio and Napoli, are known as the Seven Sisters of Italian football.[http://m.diariodelweb.it/calcio/articolo/?nid20150822_347049 Serie A al via: le sette sorelle sono tornate]In the 1990s, when the term originated, Parma was seen as one the Seven Sisters and Napoli was not included\n\nSerie A is one of the most storied leagues in the history of football. Of the 100 greatest footballers in history chosen by FourFourTwo magazine in 2017, 42 players have played in Serie A, more than any other league in the world.\n\nFormat\n\nFor most of Serie A's history, there were 16 or 18 clubs competing at the top level. Since 2004–05, however, there have been 20 clubs altogether. One season (1947–48) was played with 21 teams for political reasons. Below is a complete record of how many teams played in each season throughout the league's history;\n* 18 clubs: 1929–1934\n* 16 clubs: 1934–1943\n* 20 clubs: 1946–1947\n* 21 clubs: 1947–1948\n* 20 clubs: 1948–1952\n* 18 clubs: 1952–1967\n* 16 clubs: 1967–1988\n* 18 clubs: 1988–2004\n* 20 clubs: 2004–present\n\nDuring the season, which runs from August to May, each club plays each of the other teams twice; once at home and once away, totalling 38 games for each team by the end of the season. Thus, in Italian football a true round-robin format is used. In the first half of the season, called the andata, each team plays once against each league opponent, for a total of 19 games. In the second half of the season, called the ritorno, the teams play in exactly the same order that they did in the first half of the season, the only difference being that home and away situations are switched. Since the 1994–95 season, teams are awarded three points for a win, one point for a draw and no points for a loss.\n\nSince Italy is currently rated fourth in Europe in terms of club football ratings, the top three teams in the Serie A qualify for the UEFA Champions League (from the 2011–12 season). The top two teams qualify directly to the group phase, while the third-placed team enters the competition at the playoff qualifying round and must win a two-legged knockout tie in order to enter the group phase. Teams finishing fourth and fifth qualify for the UEFA Europa League tournament. A third UEFA Europa League spot is reserved for the winner of the Coppa Italia. If the Coppa Italia champion already qualified for European football by finishing among the top five teams in Serie A, the sixth-ranked team in Serie A is awarded the UEFA Europa League spot. The three lowest-placed teams are relegated to Serie B.\n\nFrom 2005–06 season if 2 or more teams are tied in points (for every place), the deciding tie-breakers are follows:\n\n# Head-to-head records (results and points)\n# Goal difference of head-to-head games\n# Goal difference overall\n# Higher number of goals scored\n# Draw\n\nUntil 2004–05 season, a playoff would be used to determine the champions, European spots or relegation, if the two teams were tied on points. Any play-off was held after the end of regular season. The last championship playoff occurred in the 1963-64 season when Bologna and Inter both finished on 54 points. Bologna won the play-off 2-0.\n\nSerie A clubs\n\nFor more details see List of Italian Football Championship clubs\nPrior to 1929, many clubs competed in the top level of Italian football as the earlier rounds were competed up to 1922 on a regional basis then interregional up to 1929. Below is a list of Serie A clubs who have competed in the competition when it has been a league format (66 in total).\n\n2017–18 members\n\nSeasons in Serie A\n\nThere are 67 teams that have taken part in 86 Serie A championships in a single round that was played from the 1929–30 season until the 2017–18 season. The teams in bold compete in Serie A currently. Internazionale is the only team that has played Serie A football in every season.\n\nHistory\n\nSerie A, as it is structured today, began during the 1929–30 season. From 1898 to 1922, the competition was organised into regional groups. Because of ever growing teams attending regional championships, the Italian Football Federation (FIGC) split the CCI (Italian Football Confederation) in 1921. When CCI teams rejoined the FIGC created two interregional divisions renaming Categories into Divisions and splitting FIGC sections into two North-South leagues. In 1926, due to internal crises, the FIGC changed internal settings, adding southern teams to the national division, ultimately leading to the 1929–30 final settlement. No title was awarded in 1927 after Torino were stripped of the championship by the FIGC. Torino were declared champions in the 1948–49 season following a plane crash near the end of the season in which the entire team was killed.\n\nThe Serie A Championship title is often referred to as the scudetto (\"small shield\") because since the 1924–25 season, the winning team will bear a small coat of arms with the Italian tricolour on their strip in the following season. The most successful club is Juventus with 33 championships, followed by both Milan and Internazionale, with 18 championships apiece. From the 2004–05 season onwards, an actual trophy was awarded to club on the pitch after the last turn of the championship. The trophy, called the Coppa Campioni d'Italia, has officially been used since the 1960–61 season, but between 1961 and 2004 was consigned to the winning clubs at the head office of the Lega Nazionale Professionisti.\n\nIn April 2009, Serie A announced a split from Serie B. Nineteen of the twenty clubs voted in favour of the move in an argument over television rights; the relegation-threatened Lecce had voted against the decision. Maurizio Beretta, the former head of Italy's employers' association, became president of the new league.\n\nIn April 2016, it was announced that Serie A was selected by the International Football Association Board to test video replays, which were initially private for the 2016–17 season, allowing them to become a live pilot phase, with replay assistance implemented in the 2017–18 season. On the decision, FIGC President Carlo Tavecchio said, \"We were among the first supporters of using technology on the pitch and we believe we have everything required to offer our contribution to this important experiment.\"\n\nTelevision rights\n\nIn the past, individual clubs competing in the league had the rights to sell their broadcast rights to specific channels throughout Italy, unlike in most other European countries. Currently, the two broadcasters in Italy are the satellite broadcaster Sky Italia and terrestrial broadcaster Mediaset Premium for its own pay television networks; RAI is allowed to broadcast only highlights (in exclusive from 13:30 to 22:30 CET).\nThis is a list of television rights in Italy (until 2009–10):\n* Sky Italia (all matches)\n* Mediaset Premium (all matches of Milan, Inter, Juventus, Lazio, Roma, Napoli and matches in house and guests of the above teams of Genoa, Atalanta, Chievo, Bari)\n* RAI (highlights)\n\nFor the 2010–11 and 2011–12 seasons, Serie A clubs negotiating club TV rights collectively rather than individually for the first time since 1998–99. The domestic rights for those two seasons were sold for  billion to Sky Italia.\n\nInternational\n\nGlobal rights for the 2010–11 and 2011–12 seasons were sold for  million to MP & Silva.\n\nIn countries and territories outside of Italy, the league is broadcast on:\n\nIn the 1990s, Serie A was at its most popular in the United Kingdom when it was shown on Channel 4, although it has actually appeared on more UK channels than any other league, rarely staying in one place for long since 2002. Serie A has appeared in the UK on BSB Sports Channel (1990–91), Sky Sports (1991–92), Channel 4 (1992–2002), Eurosport (2002–04), Setanta Sports and Bravo (2004–07), Channel 5 (2007–08), ESPN (2009–13) and BT Sport (since 2013).\n\nChampions\n\nBold indicates clubs which will play in the 2017–18 Serie A.\n\n* The overall first places of Juventus are 34: 33 victories of the championship and 1 scudetto revoked in 2004–05.\n* The overall first places of Torino are 8: 7 victories of the championship and 1 scudetto revoked in 1926–27.\n* The overall first places of Genoa are 8: the scudetto won in 1914–15 was assigned to the club with the 1st/2nd place final unplayed.\n* A decoration was awarded to Spezia in 2002 by the FIGC for the 1944 wartime championship. However, the FIGC has stated that it cannot be considered as a scudetto.\n\nBy city \n\nBy region \n\nRecords\n\nPlayers\n\nNon-EU players\n\nUnlike La Liga, which imposed a quota on the number of non-EU players on each club, Serie A clubs could sign as many non-EU players as available on domestic transfer.\n\nDuring the 1980s and 1990s, most Serie A clubs signed a large number of players from foreign nations (both EU and non-EU members). Notable foreign players to play in Serie A during this era included England internationals Paul Gascoigne and David Platt, France's Michel Platini and Laurent Blanc, Lothar Matthäus and Jürgen Klinsmann from Germany, Dutchmen Ruud Gullit and Dennis Bergkamp, and Argentina's Diego Maradona.\n\nBut since the 2003–04 season, a quota has been imposed on each of the clubs limiting the number of non-EU, non-EFTA and non-Swiss players who may be signed from abroad each season, following provisional measures introduced in the 2002–03 season, which allowed Serie A and B clubs to sign only one non-EU player in the 2002 summer transfer window.\n\nIn the middle of the 2000–01 season, the old quota system was abolished, which no longer limited each team to having more than five non-EU players and using no more than three in each match. Concurrent with the abolishment of the quota, the FIGC had investigated footballers that used fake passports. Alberto and Warley, Alejandro Da Silva and Jorginho Paulista of Udinese; Fábio Júnior and Gustavo Bartelt of Roma; Dida of Milan; Álvaro Recoba of Inter; Thomas Job, Francis Zé, Jean Ondoa of Sampdoria; and Jeda and Dede of Vicenza were all banned in July 2001 for lengths ranging from six months to one year. However, most of the bans were subsequently reduced.\n\nThe number of non-EU players was reduced from 265 in 2002–03 season to 166 in 2006–07 season. It also included players who received EU status after their respective countries joined the EU (see 2004 and 2007 enlargement), which made players such as Adrian Mutu, Valeri Bojinov, Marek Jankulovski and Marius Stankevičius EU players.\n\nThe rule underwent minor changes in August 2004, June 2005, June 2006. and June 2007.\n\nSince the 2008–09 season, three quotas have been awarded to clubs that do not have non-EU players in their squad (previously only newly promoted clubs could have three quotas); clubs that have one non-EU player have two quotas. Those clubs that have two non-EU players, are awarded one quota and one conditional quota, which is awarded after: 1) Transferred 1 non-EU player abroad, or 2) Release 1 non-EU player as free agent, or 3) A non-EU player received EU nationality. Clubs with three or more non-EU players, have two conditional quotas, but releasing two non-EU players as free agent, will only have one quota instead of two. Serie B and Lega Pro clubs cannot sign non-EU player from abroad, except those followed the club promoted from Serie D.\n\nLarge clubs with many foreigners usually borrow quotas from other clubs that have few foreigners or no foreigners in order to sign more non-EU players. For example, Adrian Mutu joined Juventus via Livorno in 2005, as at the time Romania was not a member of the EU. Other examples include Júlio César, Victor Obinna and Maxwell, who joined Internazionale from Chievo (first two) and Empoli respectively.\n\nOn 2 July 2010, the above conditional quota reduced back to one, though if a team did not have any non-EU players, that team could still sign up to three non-EU players. In 2011 the signing quota reverted to two.\n\nHomegrown players\n\nSerie A also imposed Homegrown players rule, a modification of Homegrown Player Rule (UEFA). Unlike UEFA, Serie A at first did not cap the number of players in first team squad at 25, meaning the club could employ more foreigners by increasing the size of the squad. However, a cap of 25 (under-21 players were excluded) was introduced to 2015–16 season (in 2015–16 season, squad simply require 8 homegrown players but not require 4 of them from their own youth team). In the 2016–17 season, the FIGC sanctioned Sassuolo for fielding ineligible player, Antonino Ragusa. Although the club did not exceed the capacity of 21 players that were not from their own youth team (only Domenico Berardi was eligible as youth product of their own) as well as under 21 of age (born 1995 or after, of which four players were eligible) in their 24-men call-up, It was reported that on Lega Serie A side the squad list was not updated.\n\nIn 2015–16 season, the following quota was announced.\n\nFIFA World Players of the Year\n\n*  Lothar Matthäus: 1991 (Internazionale)\n*  Marco van Basten: 1992 (Milan)\n*  Roberto Baggio: 1993 (Juventus)\n*  George Weah: 1995 (Milan2)\n*  Ronaldo: 19972 and 20021 (Internazionale)\n*  Zinedine Zidane: 1998, 2000 (Juventus)\n*  Pavel Nedvěd: 2003 (Juventus)\n*  Fabio Cannavaro: 2006 (Juventus1)\n*  Kaká: 2007 (Milan)\n\n1Player was a member of the club for the first half of the calendar year (The second part of a finished season - January to May)\n2Player was a member of the club for the second half of the calendar year (The first part of a new season - August to December)\n\nOfficial match ball\n\n* 2007–2008: Nike T90 Aerow II\n* 2008–2009: Nike T90 Omni\n* 2009–2010: Nike T90 Ascente\n* 2010–2011: Nike T90 Tracer\n* 2011–2012: Nike Seitiro\n* 2012–2013: Nike Maxim\n* 2013–2014: Nike Incyte\n* 2014–present: Nike Ordem\n\nKick-off times\n\nUntil 1993, Serie A matches were all played at the same time, on Sunday afternoon at 2:30 p.m. or 4:30 p.m. (depending on the number of hours of daylight). For the 1993–94 season, Lega Calcio made a notable change: a deferred match, scheduled for Sunday evening at 8:30 p.m. (8:45 p.m. from 2009–10) was made possible. This format was changed again in 1999–2000, due to the emergence of pay television in Italian football:\n\n* Saturday: two matches, the first at 6 p.m and the second at 8:45;\n* Sunday: most of a matchday begins at 3 p.m, while a deferred match is still possible.\n\nIn 2004, due to the presence of 20 teams, it also became possible to play in midweek: on Wednesday evening, with some matches on Tuesday and others on Thursday (at 8:45). In 2010, a \"lunch match\" was introduced: a match played on Sunday at 12:30. Finally, for a few weeks, matches can be played on Friday or on Monday (in the evenings).In 2003, UEFA allowed its federations to change the Kick-off times of matches depending upon the weather: for example in August, matches can be put back at 6 or 7 p.m (instead of 3) in case of warm weather. Likewise, in winter, matches can be at 5 or 6 (rather than 8:45). Serie A. http://en.wikipedia.org/?curid=15496."
  }
}
