{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1259",
  "eid" : "b925c770-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778390375,
  "textBody" : "Events\n\n*AD 8 – Roman Empire general Tiberius defeats the Dalmatae on the river Bosna\n*AD 70 – Fires resulting from the destruction of the Second Temple are extinguished. \n* 435 – Deposed Ecumenical Patriarch of Constantinople Nestorius, considered the originator of Nestorianism, is exiled by Roman Emperor Theodosius II to a monastery in Egypt.\n* 881 – Battle of Saucourt-en-Vimeu: Louis III of France defeats the Vikings, an event celebrated in the poem Ludwigslied.\n* 908 – Battle of Eisenach: An invading Hungarian force defeats an East Frankish army under Duke Burchard of Thuringia.\n*1031 – Olaf II of Norway is canonized as Saint Olaf by Grimketel, the English Bishop of Selsey.\n*1057 – Frederik van Lotharingen elected as first Belgian Pope Stephen IX. \n*1342 – The Siege of Algeciras commences during the Spanish Reconquista.\n*1492 – Christopher Columbus sets sail from Palos de la Frontera, Spain.\n*1527 – The first known letter from North America is sent by John Rut while at St. John's, Newfoundland.\n*1601 – Long War: Austria captures Transylvania in the Battle of Goroszló.\n*1645 – Thirty Years' War: The Second Battle of Nördlingen sees French forces defeating those of the Holy Roman Empire.\n*1678 – Robert LaSalle builds the Le Griffon, the first known ship built on the Great Lakes.\n*1778 – The theatre La Scala in Milan is inaugurated with the première of Antonio Salieri's Europa riconosciuta.\n*1795 – Treaty of Greenville is signed, ending the Northwest Indian War in the Ohio Country.\n*1811 – First ascent of Jungfrau, third highest summit in the Bernese Alps by brothers Johann Rudolf and Hieronymus Meyer.\n*1852 – Harvard University wins the first Boat Race between Yale University and Harvard. The race is also the first American intercollegiate athletic event\n*1859 – The American Dental Association is founded in Niagara Falls, New York.\n*1900 – The Firestone Tire and Rubber Company is founded.\n*1903 – Macedonian rebels in Kruševo proclaim the Kruševo Republic, which exists only for ten days before Ottoman Turks lay waste to the town.\n*1907 – Judge Kenesaw Mountain Landis fines Standard Oil of Indiana a record $29.4 million for illegal rebating to freight carriers; the conviction and fine are later reversed on appeal.\n*1914 – World War I: Germany declares war against France, while Romania declares its neutrality.\n*1921 – Major League Baseball Commissioner Kenesaw Mountain Landis confirms the ban of the eight Chicago Black Sox, the day after they were acquitted by a Chicago court.\n*1936 – Jesse Owens wins the 100 metre dash, defeating Ralph Metcalfe, at the Berlin Olympics.\n*  1936   – A fire wipes out Kursha-2 in the Meshchera Lowlands, Ryazan Oblast, Russia, killing 1,200 and leaving only 20 survivors.\n*1940 – World War II: Italian forces begin the invasion of British Somaliland.\n*1946 – Santa Claus Land, the world's first themed amusement park, opens in Santa Claus, Indiana, United States.\n*1948 – Whittaker Chambers accuses Alger Hiss of being a communist and a spy for the Soviet Union.\n*1949 – The Basketball Association of America and the National Basketball League finalize the merger, that would create the National Basketball Association\n*1958 – US Nuclear submarine, Nautiluss, the first submarine to complete a submerged transit of the North Pole.\n*1959 – Portugal's state police force PIDE fires upon striking workers in Bissau, Portuguese Guinea, killing over 50 people.\n*1960 – Niger gains independence from France.\n*1972 – The United States Senate ratifies the Anti-Ballistic Missile Treaty.\n*1975 – A privately chartered Boeing 707 strikes a mountain peak and crashes near Agadir, Morocco, killing 188.\n*1977 – Tandy Corporation announces the TRS-80, one of the world's first mass-produced personal computers.\n*1981 – Senegalese opposition parties, under the leadership of Mamadou Dia, launch the Antiimperialist Action Front – Suxxali Reew Mi.\n* 1997 – Oued El-Had and Mezouara massacre in Algeria: A total of 116 villagers killed, 40 in Oued El-Had and 76 in Mezouara.\n*2004 – The pedestal of the Statue of Liberty reopens after being closed since the September 11 attacks.\n*2005 – President of Mauritania Maaouya Ould Sid'Ahmed Taya is overthrown in a military coup while attending the funeral of King Fahd in Saudi Arabia.\n*2007 – Former Deputy Director of the Chilean secret police Raúl Iturriaga is captured after having been on the run following a conviction for kidnapping.\n*2010 – Widespread rioting erupts in Karachi, Pakistan, after the assassination of a local politician, leaving at least 85 dead and at least 17 billion Pakistani rupees (US$200 million) in damage.\n*2014 – A 6.1 magnitude earthquake kills at least 617 people and injures more than 2,400 in Yunnan, China.\n\nBirths\n\n*1486 – Imperia Cognati, Italian courtesan (d. 1512)\n*1491 – Maria of Jülich-Berg, German noblewoman (d. 1543)\n*1509 – Étienne Dolet, French scholar and translator (d. 1546)\n*1622 – Wolfgang Julius, Count of Hohenlohe-Neuenstein, German field marshal (d. 1698)\n*1692 – John Henley, English minister and poet (d. 1759)\n*1734 – Naungdawgyi, Burmese king (d. 1763)\n*1766 – Aaron Chorin, Hungarian rabbi and author (d. 1844)\n*1770 – Frederick William III of Prussia (d. 1840)\n*1803 – Joseph Paxton, English gardener and architect, designed The Crystal Palace (d. 1865)\n*1808 – Hamilton Fish, American lawyer and politician, 26th United States Secretary of State (d. 1893)\n*1811 – Elisha Otis, American businessman, founded the Otis Elevator Company (d. 1861)\n*1817 – Archduke Albrecht, Duke of Teschen (d. 1895)\n*1823 – Thomas Francis Meagher, Irish-American revolutionary and military leader, territorial governor of Montana (d. 1867)\n*1832 – Ivan Zajc, Croatian composer, conductor, and director (d. 1914)\n*1840 – John Bigham, 1st Viscount Mersey, English jurist and politician (d. 1929)\n*1850 – Reginald Heber Roe, English-Australian swimmer, tennis player, and academic (d. 1926)\n*1856 – Alfred Deakin, Australian lawyer and politician, 2nd Prime Minister of Australia (d. 1919)\n*1860 – William Kennedy Dickson, French-Scottish actor, director, and producer (d. 1935)\n*1863 – Géza Gárdonyi, Hungarian author and journalist (d. 1922)\n*1867 – Stanley Baldwin, English businessman and politician, Prime Minister of the United Kingdom (d. 1947)\n*1871 – Vernon Louis Parrington, American historian and scholar (d. 1929)\n*1872 – Haakon VII of Norway (d. 1957)\n*1886 – Maithili Sharan Gupt, Indian poet and playwright (d. 1964)\n*1887 – Rupert Brooke,  English poet (d. 1915) \n*1890 – Konstantin Melnikov, Russian architect, designed the Rusakov Workers' Club (d. 1974)\n*1894 – Harry Heilmann, American baseball player and sportscaster (d. 1951)\n*1895 – Allen Bathurst, Lord Apsley, English politician (d. 1942)\n*1896 – Ralph Horween, American football player and coach (d. 1997)\n*1899 – Louis Chiron, Monacan race car driver (d. 1979)\n*1900 – Ernie Pyle, American soldier and journalist (d. 1945)\n*  1900   – John T. Scopes, American educator (d. 1970)\n*1901 – John C. Stennis, American lawyer and politician (d. 1995)\n*  1901   – Stefan Wyszyński, Polish cardinal (d. 1981)\n*1902 – Regina Jonas, German rabbi (d. 1944)\n*  1902   – David Buttolph, American film composer (d. 1983)\n*1903 – Habib Bourguiba, Tunisian journalist and politician, 1st President of the Republic of Tunisia (d. 2000)\n*1904 – Dolores del Río, Mexican actress (d. 1983)\n*  1904   – Clifford D. Simak, American journalist and author (d. 1988)\n*1905 – Franz König, Austrian cardinal (d. 2004)\n*1907 – Lawrence Brown, American trombonist and composer (d. 1988)\n*  1907   – Ernesto Geisel, Brazilian general and politician, 29th President of Brazil (d. 1996)\n*  1907   – Yang Shangkun, Chinese politician, and 4th President of China (d.1998)\n*1909 – Walter Van Tilburg Clark, American author and educator (d. 1971)\n*1911 – Alex McCrindle, Scottish actor and producer (d. 1990)\n*1912 – Fritz Hellwig, German politician (d. 2017)\n*1913 – Mel Tolkin, Ukrainian-American screenwriter and producer (d. 2007)\n*1916 – Shakeel Badayuni, Indian poet and songwriter (d. 1970)\n*  1916   – José Manuel Moreno, Argentinian footballer and manager (d. 1978)\n*1917 – Les Elgart, American trumpet player and bandleader (d. 1995)\n*1918 – James MacGregor Burns, American historian, political scientist, and author (d. 2014)\n*  1918   – Sidney Gottlieb, American chemist and theorist (d. 1999)\n*  1918   – Larry Haines, American actor (d. 2008)\n*  1918   – Eddie Jefferson, American singer-songwriter (d. 1979)\n*1920 – Norman Dewis, English test driver and engineer \n*  1920   – Max Fatchen, Australian journalist and author (d. 2012)\n*  1920   – P. D. James, English author (d. 2014)\n*  1920   – Charlie Shavers, American trumpet player and composer (d. 1971)\n*  1920   – Elmar Tampõld, Estonian-Canadian architect (d. 2013)\n*1921 – Richard Adler, American composer and producer (d. 2012)\n*  1921   – Marilyn Maxwell, American actress (d. 1972)\n*1922 – John Eisenhower, American historian, general, and diplomat, 45th United States Ambassador to Belgium (d. 2013)\n*1923 – Jean Hagen, American actress (d. 1977)\n*  1923   – Pope Shenouda III of Alexandria (d. 2012)\n*1924 – Leon Uris, American soldier and author (d. 2003)\n*1925 – Marv Levy, American-Canadian football player, coach, and manager\n*1926 – Rona Anderson, Scottish-English actress (d. 2013)\n*  1926   – Tony Bennett, American singer and actor\n*  1926   – Anthony Sampson, English journalist and author (d. 2004)\n*  1926   – Gordon Scott, American actor (d. 2007)\n*1928 – Cécile Aubry, French actress, director, and screenwriter (d. 2010)\n*  1928   – Henning Moritzen, Danish actor (d. 2012)\n*1930 – James Komack, American actor, director, producer, and screenwriter (d. 1997)\n*1933 – Pat Crawford, Australian cricketer (d. 2009)\n*1934 – Haystacks Calhoun, American wrestler and actor (d. 1989)\n*  1934   – Michael Chapman, English bassoon player (d. 2005)\n*  1934   – Jonas Savimbi, Angolan general, founded UNITA (d. 2002)\n*1935 – John Erman, American actor, director, and producer\n*  1935   – Georgy Shonin, Ukrainian-Russian general, pilot, and astronaut (d. 1997)\n*  1935   – Vic Vogel, Canadian pianist, composer, and bandleader\n*1936 – Jerry G. Bishop, American radio and television host (d. 2013)\n*  1936   – Edward Petherbridge, English actor \n*1937 – Steven Berkoff, English actor, director, and playwright\n*  1937   – Roland Burris, American lawyer and politician, 39th Illinois Attorney General\n*  1937   – Tom Georgeson, English actor\n*  1937   – Duncan Sharpe, Pakistani-Australian cricketer\n*1938 – Terry Wogan, Irish-English radio and television host (d. 2016)\n*1939 – Jimmie Nicol, English drummer \n*  1939   – Apoorva Sengupta, Indian general and cricketer\n*1940 – Lance Alworth, American football player\n*  1940   – Martin Sheen, American actor and producer\n*  1940   – James Tyler, American guitarist and songwriter (d. 2010)\n*1941 – Beverly Lee, American singer\n*  1941   – Martha Stewart, American businesswoman, publisher, and author, founded Martha Stewart Living Omnimedia\n*1943 – Béla Bollobás, Hungarian-English mathematician and academic\n*  1943   – Princess Christina, Mrs. Magnuson of Sweden\n*  1943   – Steven Millhauser, American novelist and short story writer\n*1944 – Nino Bravo, Spanish singer (d. 1973)\n*1945 – Eamon Dunphy, Irish footballer and journalist\n*1946 – Robert Ayling, English businessman\n*  1946   – Jack Straw, English lawyer and politician, Shadow Deputy Prime Minister of the United Kingdom\n*  1946   – Syreeta Wright, American singer-songwriter (d. 2004)\n*  1946   – John York, American bass player, songwriter, and producer \n*1947 – Ralph Wright, English footballer\n*1948 – Jean-Pierre Raffarin, French lawyer and politician, 166th Prime Minister of France\n*1949 – Philip Casnoff, American actor and director\n*  1949   – B. B. Dickerson, American bass player and songwriter \n*  1949   – Sue Slipman, English politician\n*1950 – Linda Howard, American author\n*  1950   – John Landis, American actor, director, producer, and screenwriter\n*  1950   – Jo Marie Payton, American actress and singer\n*  1950   – Ernesto Samper, Colombian economist and politician, 29th President of Colombia\n*1951 – Marcel Dionne, Canadian ice hockey player\n*  1951   – Jay North, American actor\n*1952 – Osvaldo Ardiles, Argentinian footballer and manager\n*1953 – Ian Bairnson, Scottish saxophonist and keyboard player\n*  1953   – Marlene Dumas, South African painter\n*1954 – Michael Arthur, English physician and academic\n*  1954   – Gary Peters, English footballer and manager\n*1956 – Kirk Brandon, English singer-songwriter and guitarist \n*  1956   – Todd Christensen, American football player and sportscaster (d. 2013)\n*  1956   – Dave Cloud, American singer-songwriter and actor (d. 2015)\n*  1956   – Balwinder Sandhu, Indian cricketer and coach\n*1957 – Bodo Rudwaleit, German footballer and manager\n*  1957   – Kate Wilkinson, New Zealand lawyer and politician, 11th New Zealand Minister of Conservation\n*1958 – Lindsey Hilsum, English journalist and author\n*  1958   – Ana Kokkinos, Australian director and screenwriter\n*1959 – Martin Atkins, English drummer and producer \n*  1959   – Mike Gminski, American basketball player and sportscaster\n*  1959   – John C. McGinley, American actor and producer\n*  1959   – Koichi Tanaka, Japanese chemist and engineer, Nobel Prize laureate\n*1960 – Tim Mayotte, American tennis player and coach\n*  1960   – Gopal Sharma, Indian cricketer\n*1961 – Molly Hagan, American actress\n*  1961   – Nick Harvey, English politician, Minister of State for the Armed Forces\n*  1961   – Lee Rocker, American bassist \n*1963 – Frano Botica, New Zealand rugby player and coach\n*  1963   – James Hetfield, American singer-songwriter and guitarist \n*  1963   – David Knox, Australian rugby player\n*  1963   – Ed Roland, American singer-songwriter, guitarist, and producer \n*  1963   – Lisa Ann Walter, American actress, producer, and screenwriter\n*  1963   – Isaiah Washington, American actor and producer\n*1964 – Lucky Dube, South African singer and keyboard player (d. 2007)\n*  1964   – Nate McMillan, American basketball player and coach\n*  1964   – Kevin Sumlin, American football player and coach\n*  1964   – Abhisit Vejjajiva, English-Thai economist and politician, 27th Prime Minister of Thailand\n*1966 – Brent Butt, Canadian actor, producer, and screenwriter\n*  1966   – Gizz Butt, English singer-songwriter and guitarist \n*  1966   – Eric Esch, American wrestler, boxer, and mixed martial artist\n*1967 – Mathieu Kassovitz, French actor, director, producer, and screenwriter, founded MNP Entreprise\n*  1967   – Skin, English singer and guitarist \n*1968 – Rod Beck, American baseball player (d. 2007)\n*1969 – Doug Overton, American basketball player and coach\n*1970 – Stephen Carpenter, American guitarist and songwriter\n*  1970   – Gina G, Australian singer-songwriter \n*  1970   – Masahiro Sakurai, Japanese video game designer\n*1971 – Forbes Johnston, Scottish footballer (d. 2007)\n*  1971   – DJ Spinderella, American DJ, rapper, producer, and actress \n*1972 – Sandis Ozoliņš, Latvian ice hockey player and politician\n*1973 – Jay Cutler, American bodybuilder\n*  1973   – Nikos Dabizas, Greek footballer\n*  1973   – Chris Murphy, American politician, junior senator of Connecticut\n*1975 – Wael Gomaa, Egyptian footballer\n*  1975   – Argyro Strataki, Greek heptathlete\n*1976 – Troy Glaus, American baseball player\n*1977 – Tom Brady, American football player \n*  1977   – Justin Lehr, American baseball player\n*  1977   – Óscar Pereiro, Spanish cyclist and footballer\n*1978 – Joi Chua, Singaporean singer-songwriter and actress\n*  1978   – Mariusz Jop, Polish footballer\n*  1978   – Jenny Tinmouth, English motorcycle racer\n*  1978   – Dimitrios Zografakis, Greek footballer\n*1979 – Evangeline Lilly, Canadian model and actress\n*1980 – Nadia Ali, Libyan-American singer-songwriter \n*  1980   – Dominic Moore, Canadian ice hockey player\n*  1980   – Tony Pashos, American football player\n*  1980   – Brandan Schieppati, American singer-songwriter and guitarist \n*  1980   – Hannah Simone, Canadian television host and actress\n*1981 – Fikirte Addis, Ethiopian fashion designer\n*  1981   – Travis Bowyer, American baseball player\n*  1981   – Pablo Ibáñez, Spanish footballer\n*1982 – Kaspar Kokk, Estonian skier\n*  1982   – Jesse Lumsden, Canadian bobsledder and football player\n*  1982   – Damien Sandow, American wrestler\n*1983 – Ryan Carter, American ice hockey player\n*  1983   – Mark Reynolds, American baseball player\n*1984 – Yasin Avcı, Turkish footballer\n*  1984   – Sunil Chhetri, Indian footballer\n*  1984   – Matt Joyce, American baseball player\n*  1984   – Ryan Lochte, American swimmer\n*  1984   – Chris Maurer, American singer and bass player \n*1985 – Brent Kutzle, American bass player and producer \n*  1985   – Ats Purje, Estonian footballer\n*  1985   – Sonny Bill Williams, New Zealand rugby player and boxer\n*1986 – Charlotte Casiraghi, Monégasque journalist, co-founded Ever Manifesto\n*  1986   – Darya Domracheva, Belarusian biathlete\n*1987 – Kim Hyung-jun, South Korean singer and dancer  \n*  1987   – Chris McQueen, Australian-English rugby league player\n*1988 – Denny Cardin, Italian footballer\n*  1988   – Leigh Tiffin, American football player\n*1989 – Jules Bianchi, French race car driver (d. 2015)\n*  1989   – Sam Hutchinson, English footballer\n*  1989   – Tyrod Taylor, American football player\n*  1989   – Nick Viergever, Dutch footballer\n*1992 – Gamze Bulut, Turkish runner\n*  1992   – Gesa Felicitas Krause, German runner\n*  1992   – Diāna Marcinkēviča, Latvian tennis player\n*  1992   – Aljon Mariano, Filipino basketball player\n*  1992   – Lum Rexhepi, Finnish footballer\n*1993 – Ola Abidogun, English sprinter\n*  1993   – Yurina Kumai, Japanese singer \n*1994 – Manaia Cherrington, New Zealand rugby league player\n*  1994   – Todd Gurley, American football player\n*1995 – Victoria Kan, Russian tennis player\n*1999 – Yoo Yeon-jung, South Korean singer\n\nDeaths\n\n* 908 – Burchard, Duke of Thuringia\n*   908   – Egino, Duke of Thuringia\n*   908   – Rudolf I, bishop of Würzburg\n* 925 – Cao, Chinese empress dowager\n* 979 – Thietmar, Margrave of Meissen\n*1003 – At-Ta'i, the Abbasid Caliph of Baghdad\n*1355 – Bartholomew de Burghersh, 1st Baron Burghersh\n*1460 – James II of Scotland (b. 1430)\n*1527 – Scaramuccia Trivulzio, Italian cardinal\n*1530 – Francesco Ferruccio, Florentine captain (b. 1489)\n*1546 – Antonio da Sangallo the Younger, Italian architect, designed the Apostolic Palace (b. 1484)\n*  1546   – Étienne Dolet, French scholar and translator (b. 1509)\n*1604 – Bernardino de Mendoza, Spanish commander and diplomat (b. 1540)\n*1621 – Guillaume du Vair, French lawyer and author (b. 1556)\n*1712 – Joshua Barnes, English historian and scholar (b. 1654)\n*1720 – Anthonie Heinsius, Dutch politician (b. 1641)\n*1721 – Grinling Gibbons, Dutch-English sculptor and woodcarver (b. 1648)\n*1761 – Johann Matthias Gesner, German scholar and academic (b. 1691)\n*1773 – Stanisław Konarski, Polish poet and playwright (b. 1700)\n*1780 – Étienne Bonnot de Condillac, French epistemiologist and philosopher (b. 1715)\n*1792 – Richard Arkwright, English engineer and businessman (b. 1732)\n*1797 – Jeffery Amherst, 1st Baron Amherst, English field marshal and politician, Colonial Governor of Virginia (b. 1717)\n*1805 – Christopher Anstey, English author and poet (b. 1724)\n*1835 – Wenzel Müller, Austrian composer and conductor (b. 1767)\n*1839 – Dorothea von Schlegel, German author and translator (b. 1763)\n*1857 – Eugène Sue, French author and politician (b. 1804)\n*1866 – Gábor Klauzál, Hungarian politician, Hungarian Minister of Agriculture (b. 1804)\n*1867 – Philipp August Böckh, German historian and scholar (b. 1785)\n*1877 – William B. Ogden, American businessman and politician, 1st Mayor of Chicago (b. 1805)\n*1879 – Joseph Severn, English painter (b. 1793)\n*1894 – George Inness, American painter (b. 1825)\n*1913 – William Lyne, Australian politician, 13th Premier of New South Wales (b. 1844)\n*1916 – Roger Casement, Irish poet and activist (b. 1864)\n*1917 – Ferdinand Georg Frobenius, German mathematician and academic (b. 1849)\n*1920 – Peeter Süda, Estonian organist and composer (b. 1883)\n*1922 – Ture Malmgren, Swedish journalist and politician (b. 1851)\n*1924 – Joseph Conrad, Polish-born British novelist (b. 1857)\n*1925 – William Bruce, Australian cricketer (b. 1864)\n*1929 – Emile Berliner, German-American inventor and businessman, invented the phonograph  (b. 1851)\n*  1929   – Thorstein Veblen, American economist and sociologist (b. 1857)\n*1936 – Konstantin Konik, Estonian surgeon and politician, 19th Estonian Minister of Education (b. 1873)\n*1942 – Richard Willstätter, German-Swiss chemist and academic, Nobel Prize laureate (b. 1872)\n*1949 – Ignotus, Hungarian poet and author (b. 1869)\n*1954 – Colette, French novelist and journalist (b. 1873)\n*1958 – Peter Collins, English race car driver (b. 1931)\n*1959 – Herb Byrne, Australian footballer (b. 1887)\n*1961 – Hilda Rix Nicholas, Australian artist (b. 1884)\n*1964 – Flannery O'Connor, American short story writer and novelist (b. 1925)\n*1966 – Lenny Bruce, American comedian, actor, and screenwriter (b. 1925) \n*1968 – Konstantin Rokossovsky, Marshal of the Soviet Union during World War II (b. 1896)\n*1969 – Alexander Mair, Australian politician, 26th Premier of New South Wales (b. 1889)\n*1972 – Giannis Papaioannou, Turkish-Greek composer (b. 1913)\n*1973 – Richard Marshall, American general (b. 1895)\n*1974 – Edgar Johan Kuusik, Estonian architect and interior designer (b. 1888)\n*1975 – Andreas Embirikos, Greek poet and photographer (b. 1901)\n*1977 – Makarios III, Cypriot archbishop and politician, 1st President of the Republic of Cyprus (b. 1913)\n*  1977   – Alfred Lunt, American actor and director (b. 1892)\n*1979 – Bertil Ohlin, Swedish economist and politician, Nobel Prize laureate (b. 1899)\n*  1979   – Angelos Terzakis, Greek author and playwright (b. 1907)\n*1983 – Carolyn Jones, American actress (b. 1930)\n*1995 – Ida Lupino, English-American actress and director (b. 1918)\n*  1995   – Edward Whittemore, American soldier and author (b. 1933)\n*1996 – Jørgen Garde, Danish admiral (b. 1939)\n*1997 – Pietro Rizzuto, Italian-Canadian lawyer and politician (b. 1934)\n*1998 – Alfred Schnittke, Russian composer and journalist (b. 1934)\n*1999 – Rod Ansell, Australian hunter (b. 1953)\n*  1999   – Byron Farwell, American historian and author (b. 1921)\n*2000 – Joann Lõssov, Estonian basketball player and coach (b. 1921)\n*2001 – Christopher Hewett, English actor and director (b. 1922)\n*2003 – Roger Voudouris, American singer-songwriter and guitarist (b. 1954)\n*2004 – Henri Cartier-Bresson, French photographer and painter (b. 1908)\n*2005 – Françoise d'Eaubonne, French author and poet (b. 1920)\n*2006 – Arthur Lee, American singer-songwriter, guitarist, and producer (b. 1945)\n*  2006   – Elisabeth Schwarzkopf, German-English soprano and actress (b. 1915)\n*2007 – John Gardner, English author (b. 1926)\n*  2007   – Peter Thorup, Danish singer-songwriter, guitarist, and producer (b. 1948)\n*2008 – Skip Caray, American sportscaster (b. 1939)\n*  2008   – Erik Darling, American singer-songwriter (b. 1933)\n*  2008   – Aleksandr Solzhenitsyn, Russian novelist, dramatist and historian, Nobel Prize laureate  (b. 1918)\n*2009 – Nikolaos Makarezos, Greek soldier and politician, Deputy Prime Minister of Greece (b. 1919)\n*2010 – Bobby Hebb, American singer-songwriter (b. 1938)\n*2011 – William Sleator, American author (b. 1945)\n*  2011   – Bubba Smith, American football player and actor (b. 1945)\n*2012 – Frank Evans, American baseball player, coach, and manager (b. 1921)\n*  2012   – Martin Fleischmann, Czech-English chemist and academic (b. 1927)\n*  2012   – Paul McCracken, American economist and academic (b. 1915)\n*  2012   – John Pritchard, American basketball player (b. 1927)\n*2013 – John Coombs, English-Monacan race car driver and businessman (b. 1922)\n*  2013   – Jack English Hightower, American lawyer and politician (b. 1926)\n*  2013   – Jack Hynes, Scottish-American soccer player and manager (b. 1920)\n*2014 – Miangul Aurangzeb, Pakistani captain and politician, 19th Governor of Khyber Pakhtunkhwa (b. 1928) \n*  2014   – Edward Clancy, Australian cardinal (b. 1923)\n*  2014   – Dorothy Salisbury Davis, American author (b. 1916)\n*  2014   – Kenny Drew, Jr., American pianist and composer (b. 1958)\n*  2014   – Lydia Yu-Jose, Filipino political scientist and academic (b. 1944)\n*2015 – Robert Conquest, English-American historian, poet, and academic (b. 1917)\n*  2015   – Mel Farr, American football player and businessman (b. 1944) \n*  2015   – Coleen Gray, American actress (b. 1922)\n*  2015   – Margot Loyola, Chilean singer-songwriter and guitarist (b. 1918)\n*  2015   – Johanna Quandt, German businesswoman (b. 1926)\n*  2015   – Jef Murray, Australian artist and author (b. 1960)\n\nHolidays and observances\n\n* Anniversary of the Killing of Pidjiguiti (Guinea-Bissau)\n* Armed Forces Day (Equatorial Guinea)\n* Christian feast day:\n** George Freeman Bragg, W. E. B. Du Bois (Episcopal Church)\n** Lydia of Thyatira\n** Myrrhbearers (Lutheran Church)\n** Nicodemus\n** Olaf II of Norway (Translation of the relic)\n** Stephen (Discovery of the relic)\n** Waltheof of Melrose\n** August 3 (Eastern Orthodox liturgics)\n* Flag Day (Venezuela)\n* Independence Day, celebrates the independence of Niger from France in 1960.\n**Arbor Day (Niger) \n* National Guard Day (Venezuela)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 3" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1259" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*AD 8 – Roman Empire general Tiberius defeats the Dalmatae on the river Bosna\n*AD 70 – Fires resulting from the destruction of the Second Temple are extinguished. \n* 435 – Deposed Ecumenical Patriarch of Constantinople Nestorius, considered the originator of Nestorianism, is exiled by Roman Emperor Theodosius II to a monastery in Egypt.\n* 881 – Battle of Saucourt-en-Vimeu: Louis III of France defeats the Vikings, an event celebrated in the poem Ludwigslied.\n* 908 – Battle of Eisenach: An invading Hungarian force defeats an East Frankish army under Duke Burchard of Thuringia.\n*1031 – Olaf II of Norway is canonized as Saint Olaf by Grimketel, the English Bishop of Selsey.\n*1057 – Frederik van Lotharingen elected as first Belgian Pope Stephen IX. \n*1342 – The Siege of Algeciras commences during the Spanish Reconquista.\n*1492 – Christopher Columbus sets sail from Palos de la Frontera, Spain.\n*1527 – The first known letter from North America is sent by John Rut while at St. John's, Newfoundland.\n*1601 – Long War: Austria captures Transylvania in the Battle of Goroszló.\n*1645 – Thirty Years' War: The Second Battle of Nördlingen sees French forces defeating those of the Holy Roman Empire.\n*1678 – Robert LaSalle builds the Le Griffon, the first known ship built on the Great Lakes.\n*1778 – The theatre La Scala in Milan is inaugurated with the première of Antonio Salieri's Europa riconosciuta.\n*1795 – Treaty of Greenville is signed, ending the Northwest Indian War in the Ohio Country.\n*1811 – First ascent of Jungfrau, third highest summit in the Bernese Alps by brothers Johann Rudolf and Hieronymus Meyer.\n*1852 – Harvard University wins the first Boat Race between Yale University and Harvard. The race is also the first American intercollegiate athletic event\n*1859 – The American Dental Association is founded in Niagara Falls, New York.\n*1900 – The Firestone Tire and Rubber Company is founded.\n*1903 – Macedonian rebels in Kruševo proclaim the Kruševo Republic, which exists only for ten days before Ottoman Turks lay waste to the town.\n*1907 – Judge Kenesaw Mountain Landis fines Standard Oil of Indiana a record $29.4 million for illegal rebating to freight carriers; the conviction and fine are later reversed on appeal.\n*1914 – World War I: Germany declares war against France, while Romania declares its neutrality.\n*1921 – Major League Baseball Commissioner Kenesaw Mountain Landis confirms the ban of the eight Chicago Black Sox, the day after they were acquitted by a Chicago court.\n*1936 – Jesse Owens wins the 100 metre dash, defeating Ralph Metcalfe, at the Berlin Olympics.\n*  1936   – A fire wipes out Kursha-2 in the Meshchera Lowlands, Ryazan Oblast, Russia, killing 1,200 and leaving only 20 survivors.\n*1940 – World War II: Italian forces begin the invasion of British Somaliland.\n*1946 – Santa Claus Land, the world's first themed amusement park, opens in Santa Claus, Indiana, United States.\n*1948 – Whittaker Chambers accuses Alger Hiss of being a communist and a spy for the Soviet Union.\n*1949 – The Basketball Association of America and the National Basketball League finalize the merger, that would create the National Basketball Association\n*1958 – US Nuclear submarine, Nautiluss, the first submarine to complete a submerged transit of the North Pole.\n*1959 – Portugal's state police force PIDE fires upon striking workers in Bissau, Portuguese Guinea, killing over 50 people.\n*1960 – Niger gains independence from France.\n*1972 – The United States Senate ratifies the Anti-Ballistic Missile Treaty.\n*1975 – A privately chartered Boeing 707 strikes a mountain peak and crashes near Agadir, Morocco, killing 188.\n*1977 – Tandy Corporation announces the TRS-80, one of the world's first mass-produced personal computers.\n*1981 – Senegalese opposition parties, under the leadership of Mamadou Dia, launch the Antiimperialist Action Front – Suxxali Reew Mi.\n* 1997 – Oued El-Had and Mezouara massacre in Algeria: A total of 116 villagers killed, 40 in Oued El-Had and 76 in Mezouara.\n*2004 – The pedestal of the Statue of Liberty reopens after being closed since the September 11 attacks.\n*2005 – President of Mauritania Maaouya Ould Sid'Ahmed Taya is overthrown in a military coup while attending the funeral of King Fahd in Saudi Arabia.\n*2007 – Former Deputy Director of the Chilean secret police Raúl Iturriaga is captured after having been on the run following a conviction for kidnapping.\n*2010 – Widespread rioting erupts in Karachi, Pakistan, after the assassination of a local politician, leaving at least 85 dead and at least 17 billion Pakistani rupees (US$200 million) in damage.\n*2014 – A 6.1 magnitude earthquake kills at least 617 people and injures more than 2,400 in Yunnan, China.\n\nBirths\n\n*1486 – Imperia Cognati, Italian courtesan (d. 1512)\n*1491 – Maria of Jülich-Berg, German noblewoman (d. 1543)\n*1509 – Étienne Dolet, French scholar and translator (d. 1546)\n*1622 – Wolfgang Julius, Count of Hohenlohe-Neuenstein, German field marshal (d. 1698)\n*1692 – John Henley, English minister and poet (d. 1759)\n*1734 – Naungdawgyi, Burmese king (d. 1763)\n*1766 – Aaron Chorin, Hungarian rabbi and author (d. 1844)\n*1770 – Frederick William III of Prussia (d. 1840)\n*1803 – Joseph Paxton, English gardener and architect, designed The Crystal Palace (d. 1865)\n*1808 – Hamilton Fish, American lawyer and politician, 26th United States Secretary of State (d. 1893)\n*1811 – Elisha Otis, American businessman, founded the Otis Elevator Company (d. 1861)\n*1817 – Archduke Albrecht, Duke of Teschen (d. 1895)\n*1823 – Thomas Francis Meagher, Irish-American revolutionary and military leader, territorial governor of Montana (d. 1867)\n*1832 – Ivan Zajc, Croatian composer, conductor, and director (d. 1914)\n*1840 – John Bigham, 1st Viscount Mersey, English jurist and politician (d. 1929)\n*1850 – Reginald Heber Roe, English-Australian swimmer, tennis player, and academic (d. 1926)\n*1856 – Alfred Deakin, Australian lawyer and politician, 2nd Prime Minister of Australia (d. 1919)\n*1860 – William Kennedy Dickson, French-Scottish actor, director, and producer (d. 1935)\n*1863 – Géza Gárdonyi, Hungarian author and journalist (d. 1922)\n*1867 – Stanley Baldwin, English businessman and politician, Prime Minister of the United Kingdom (d. 1947)\n*1871 – Vernon Louis Parrington, American historian and scholar (d. 1929)\n*1872 – Haakon VII of Norway (d. 1957)\n*1886 – Maithili Sharan Gupt, Indian poet and playwright (d. 1964)\n*1887 – Rupert Brooke,  English poet (d. 1915) \n*1890 – Konstantin Melnikov, Russian architect, designed the Rusakov Workers' Club (d. 1974)\n*1894 – Harry Heilmann, American baseball player and sportscaster (d. 1951)\n*1895 – Allen Bathurst, Lord Apsley, English politician (d. 1942)\n*1896 – Ralph Horween, American football player and coach (d. 1997)\n*1899 – Louis Chiron, Monacan race car driver (d. 1979)\n*1900 – Ernie Pyle, American soldier and journalist (d. 1945)\n*  1900   – John T. Scopes, American educator (d. 1970)\n*1901 – John C. Stennis, American lawyer and politician (d. 1995)\n*  1901   – Stefan Wyszyński, Polish cardinal (d. 1981)\n*1902 – Regina Jonas, German rabbi (d. 1944)\n*  1902   – David Buttolph, American film composer (d. 1983)\n*1903 – Habib Bourguiba, Tunisian journalist and politician, 1st President of the Republic of Tunisia (d. 2000)\n*1904 – Dolores del Río, Mexican actress (d. 1983)\n*  1904   – Clifford D. Simak, American journalist and author (d. 1988)\n*1905 – Franz König, Austrian cardinal (d. 2004)\n*1907 – Lawrence Brown, American trombonist and composer (d. 1988)\n*  1907   – Ernesto Geisel, Brazilian general and politician, 29th President of Brazil (d. 1996)\n*  1907   – Yang Shangkun, Chinese politician, and 4th President of China (d.1998)\n*1909 – Walter Van Tilburg Clark, American author and educator (d. 1971)\n*1911 – Alex McCrindle, Scottish actor and producer (d. 1990)\n*1912 – Fritz Hellwig, German politician (d. 2017)\n*1913 – Mel Tolkin, Ukrainian-American screenwriter and producer (d. 2007)\n*1916 – Shakeel Badayuni, Indian poet and songwriter (d. 1970)\n*  1916   – José Manuel Moreno, Argentinian footballer and manager (d. 1978)\n*1917 – Les Elgart, American trumpet player and bandleader (d. 1995)\n*1918 – James MacGregor Burns, American historian, political scientist, and author (d. 2014)\n*  1918   – Sidney Gottlieb, American chemist and theorist (d. 1999)\n*  1918   – Larry Haines, American actor (d. 2008)\n*  1918   – Eddie Jefferson, American singer-songwriter (d. 1979)\n*1920 – Norman Dewis, English test driver and engineer \n*  1920   – Max Fatchen, Australian journalist and author (d. 2012)\n*  1920   – P. D. James, English author (d. 2014)\n*  1920   – Charlie Shavers, American trumpet player and composer (d. 1971)\n*  1920   – Elmar Tampõld, Estonian-Canadian architect (d. 2013)\n*1921 – Richard Adler, American composer and producer (d. 2012)\n*  1921   – Marilyn Maxwell, American actress (d. 1972)\n*1922 – John Eisenhower, American historian, general, and diplomat, 45th United States Ambassador to Belgium (d. 2013)\n*1923 – Jean Hagen, American actress (d. 1977)\n*  1923   – Pope Shenouda III of Alexandria (d. 2012)\n*1924 – Leon Uris, American soldier and author (d. 2003)\n*1925 – Marv Levy, American-Canadian football player, coach, and manager\n*1926 – Rona Anderson, Scottish-English actress (d. 2013)\n*  1926   – Tony Bennett, American singer and actor\n*  1926   – Anthony Sampson, English journalist and author (d. 2004)\n*  1926   – Gordon Scott, American actor (d. 2007)\n*1928 – Cécile Aubry, French actress, director, and screenwriter (d. 2010)\n*  1928   – Henning Moritzen, Danish actor (d. 2012)\n*1930 – James Komack, American actor, director, producer, and screenwriter (d. 1997)\n*1933 – Pat Crawford, Australian cricketer (d. 2009)\n*1934 – Haystacks Calhoun, American wrestler and actor (d. 1989)\n*  1934   – Michael Chapman, English bassoon player (d. 2005)\n*  1934   – Jonas Savimbi, Angolan general, founded UNITA (d. 2002)\n*1935 – John Erman, American actor, director, and producer\n*  1935   – Georgy Shonin, Ukrainian-Russian general, pilot, and astronaut (d. 1997)\n*  1935   – Vic Vogel, Canadian pianist, composer, and bandleader\n*1936 – Jerry G. Bishop, American radio and television host (d. 2013)\n*  1936   – Edward Petherbridge, English actor \n*1937 – Steven Berkoff, English actor, director, and playwright\n*  1937   – Roland Burris, American lawyer and politician, 39th Illinois Attorney General\n*  1937   – Tom Georgeson, English actor\n*  1937   – Duncan Sharpe, Pakistani-Australian cricketer\n*1938 – Terry Wogan, Irish-English radio and television host (d. 2016)\n*1939 – Jimmie Nicol, English drummer \n*  1939   – Apoorva Sengupta, Indian general and cricketer\n*1940 – Lance Alworth, American football player\n*  1940   – Martin Sheen, American actor and producer\n*  1940   – James Tyler, American guitarist and songwriter (d. 2010)\n*1941 – Beverly Lee, American singer\n*  1941   – Martha Stewart, American businesswoman, publisher, and author, founded Martha Stewart Living Omnimedia\n*1943 – Béla Bollobás, Hungarian-English mathematician and academic\n*  1943   – Princess Christina, Mrs. Magnuson of Sweden\n*  1943   – Steven Millhauser, American novelist and short story writer\n*1944 – Nino Bravo, Spanish singer (d. 1973)\n*1945 – Eamon Dunphy, Irish footballer and journalist\n*1946 – Robert Ayling, English businessman\n*  1946   – Jack Straw, English lawyer and politician, Shadow Deputy Prime Minister of the United Kingdom\n*  1946   – Syreeta Wright, American singer-songwriter (d. 2004)\n*  1946   – John York, American bass player, songwriter, and producer \n*1947 – Ralph Wright, English footballer\n*1948 – Jean-Pierre Raffarin, French lawyer and politician, 166th Prime Minister of France\n*1949 – Philip Casnoff, American actor and director\n*  1949   – B. B. Dickerson, American bass player and songwriter \n*  1949   – Sue Slipman, English politician\n*1950 – Linda Howard, American author\n*  1950   – John Landis, American actor, director, producer, and screenwriter\n*  1950   – Jo Marie Payton, American actress and singer\n*  1950   – Ernesto Samper, Colombian economist and politician, 29th President of Colombia\n*1951 – Marcel Dionne, Canadian ice hockey player\n*  1951   – Jay North, American actor\n*1952 – Osvaldo Ardiles, Argentinian footballer and manager\n*1953 – Ian Bairnson, Scottish saxophonist and keyboard player\n*  1953   – Marlene Dumas, South African painter\n*1954 – Michael Arthur, English physician and academic\n*  1954   – Gary Peters, English footballer and manager\n*1956 – Kirk Brandon, English singer-songwriter and guitarist \n*  1956   – Todd Christensen, American football player and sportscaster (d. 2013)\n*  1956   – Dave Cloud, American singer-songwriter and actor (d. 2015)\n*  1956   – Balwinder Sandhu, Indian cricketer and coach\n*1957 – Bodo Rudwaleit, German footballer and manager\n*  1957   – Kate Wilkinson, New Zealand lawyer and politician, 11th New Zealand Minister of Conservation\n*1958 – Lindsey Hilsum, English journalist and author\n*  1958   – Ana Kokkinos, Australian director and screenwriter\n*1959 – Martin Atkins, English drummer and producer \n*  1959   – Mike Gminski, American basketball player and sportscaster\n*  1959   – John C. McGinley, American actor and producer\n*  1959   – Koichi Tanaka, Japanese chemist and engineer, Nobel Prize laureate\n*1960 – Tim Mayotte, American tennis player and coach\n*  1960   – Gopal Sharma, Indian cricketer\n*1961 – Molly Hagan, American actress\n*  1961   – Nick Harvey, English politician, Minister of State for the Armed Forces\n*  1961   – Lee Rocker, American bassist \n*1963 – Frano Botica, New Zealand rugby player and coach\n*  1963   – James Hetfield, American singer-songwriter and guitarist \n*  1963   – David Knox, Australian rugby player\n*  1963   – Ed Roland, American singer-songwriter, guitarist, and producer \n*  1963   – Lisa Ann Walter, American actress, producer, and screenwriter\n*  1963   – Isaiah Washington, American actor and producer\n*1964 – Lucky Dube, South African singer and keyboard player (d. 2007)\n*  1964   – Nate McMillan, American basketball player and coach\n*  1964   – Kevin Sumlin, American football player and coach\n*  1964   – Abhisit Vejjajiva, English-Thai economist and politician, 27th Prime Minister of Thailand\n*1966 – Brent Butt, Canadian actor, producer, and screenwriter\n*  1966   – Gizz Butt, English singer-songwriter and guitarist \n*  1966   – Eric Esch, American wrestler, boxer, and mixed martial artist\n*1967 – Mathieu Kassovitz, French actor, director, producer, and screenwriter, founded MNP Entreprise\n*  1967   – Skin, English singer and guitarist \n*1968 – Rod Beck, American baseball player (d. 2007)\n*1969 – Doug Overton, American basketball player and coach\n*1970 – Stephen Carpenter, American guitarist and songwriter\n*  1970   – Gina G, Australian singer-songwriter \n*  1970   – Masahiro Sakurai, Japanese video game designer\n*1971 – Forbes Johnston, Scottish footballer (d. 2007)\n*  1971   – DJ Spinderella, American DJ, rapper, producer, and actress \n*1972 – Sandis Ozoliņš, Latvian ice hockey player and politician\n*1973 – Jay Cutler, American bodybuilder\n*  1973   – Nikos Dabizas, Greek footballer\n*  1973   – Chris Murphy, American politician, junior senator of Connecticut\n*1975 – Wael Gomaa, Egyptian footballer\n*  1975   – Argyro Strataki, Greek heptathlete\n*1976 – Troy Glaus, American baseball player\n*1977 – Tom Brady, American football player \n*  1977   – Justin Lehr, American baseball player\n*  1977   – Óscar Pereiro, Spanish cyclist and footballer\n*1978 – Joi Chua, Singaporean singer-songwriter and actress\n*  1978   – Mariusz Jop, Polish footballer\n*  1978   – Jenny Tinmouth, English motorcycle racer\n*  1978   – Dimitrios Zografakis, Greek footballer\n*1979 – Evangeline Lilly, Canadian model and actress\n*1980 – Nadia Ali, Libyan-American singer-songwriter \n*  1980   – Dominic Moore, Canadian ice hockey player\n*  1980   – Tony Pashos, American football player\n*  1980   – Brandan Schieppati, American singer-songwriter and guitarist \n*  1980   – Hannah Simone, Canadian television host and actress\n*1981 – Fikirte Addis, Ethiopian fashion designer\n*  1981   – Travis Bowyer, American baseball player\n*  1981   – Pablo Ibáñez, Spanish footballer\n*1982 – Kaspar Kokk, Estonian skier\n*  1982   – Jesse Lumsden, Canadian bobsledder and football player\n*  1982   – Damien Sandow, American wrestler\n*1983 – Ryan Carter, American ice hockey player\n*  1983   – Mark Reynolds, American baseball player\n*1984 – Yasin Avcı, Turkish footballer\n*  1984   – Sunil Chhetri, Indian footballer\n*  1984   – Matt Joyce, American baseball player\n*  1984   – Ryan Lochte, American swimmer\n*  1984   – Chris Maurer, American singer and bass player \n*1985 – Brent Kutzle, American bass player and producer \n*  1985   – Ats Purje, Estonian footballer\n*  1985   – Sonny Bill Williams, New Zealand rugby player and boxer\n*1986 – Charlotte Casiraghi, Monégasque journalist, co-founded Ever Manifesto\n*  1986   – Darya Domracheva, Belarusian biathlete\n*1987 – Kim Hyung-jun, South Korean singer and dancer  \n*  1987   – Chris McQueen, Australian-English rugby league player\n*1988 – Denny Cardin, Italian footballer\n*  1988   – Leigh Tiffin, American football player\n*1989 – Jules Bianchi, French race car driver (d. 2015)\n*  1989   – Sam Hutchinson, English footballer\n*  1989   – Tyrod Taylor, American football player\n*  1989   – Nick Viergever, Dutch footballer\n*1992 – Gamze Bulut, Turkish runner\n*  1992   – Gesa Felicitas Krause, German runner\n*  1992   – Diāna Marcinkēviča, Latvian tennis player\n*  1992   – Aljon Mariano, Filipino basketball player\n*  1992   – Lum Rexhepi, Finnish footballer\n*1993 – Ola Abidogun, English sprinter\n*  1993   – Yurina Kumai, Japanese singer \n*1994 – Manaia Cherrington, New Zealand rugby league player\n*  1994   – Todd Gurley, American football player\n*1995 – Victoria Kan, Russian tennis player\n*1999 – Yoo Yeon-jung, South Korean singer\n\nDeaths\n\n* 908 – Burchard, Duke of Thuringia\n*   908   – Egino, Duke of Thuringia\n*   908   – Rudolf I, bishop of Würzburg\n* 925 – Cao, Chinese empress dowager\n* 979 – Thietmar, Margrave of Meissen\n*1003 – At-Ta'i, the Abbasid Caliph of Baghdad\n*1355 – Bartholomew de Burghersh, 1st Baron Burghersh\n*1460 – James II of Scotland (b. 1430)\n*1527 – Scaramuccia Trivulzio, Italian cardinal\n*1530 – Francesco Ferruccio, Florentine captain (b. 1489)\n*1546 – Antonio da Sangallo the Younger, Italian architect, designed the Apostolic Palace (b. 1484)\n*  1546   – Étienne Dolet, French scholar and translator (b. 1509)\n*1604 – Bernardino de Mendoza, Spanish commander and diplomat (b. 1540)\n*1621 – Guillaume du Vair, French lawyer and author (b. 1556)\n*1712 – Joshua Barnes, English historian and scholar (b. 1654)\n*1720 – Anthonie Heinsius, Dutch politician (b. 1641)\n*1721 – Grinling Gibbons, Dutch-English sculptor and woodcarver (b. 1648)\n*1761 – Johann Matthias Gesner, German scholar and academic (b. 1691)\n*1773 – Stanisław Konarski, Polish poet and playwright (b. 1700)\n*1780 – Étienne Bonnot de Condillac, French epistemiologist and philosopher (b. 1715)\n*1792 – Richard Arkwright, English engineer and businessman (b. 1732)\n*1797 – Jeffery Amherst, 1st Baron Amherst, English field marshal and politician, Colonial Governor of Virginia (b. 1717)\n*1805 – Christopher Anstey, English author and poet (b. 1724)\n*1835 – Wenzel Müller, Austrian composer and conductor (b. 1767)\n*1839 – Dorothea von Schlegel, German author and translator (b. 1763)\n*1857 – Eugène Sue, French author and politician (b. 1804)\n*1866 – Gábor Klauzál, Hungarian politician, Hungarian Minister of Agriculture (b. 1804)\n*1867 – Philipp August Böckh, German historian and scholar (b. 1785)\n*1877 – William B. Ogden, American businessman and politician, 1st Mayor of Chicago (b. 1805)\n*1879 – Joseph Severn, English painter (b. 1793)\n*1894 – George Inness, American painter (b. 1825)\n*1913 – William Lyne, Australian politician, 13th Premier of New South Wales (b. 1844)\n*1916 – Roger Casement, Irish poet and activist (b. 1864)\n*1917 – Ferdinand Georg Frobenius, German mathematician and academic (b. 1849)\n*1920 – Peeter Süda, Estonian organist and composer (b. 1883)\n*1922 – Ture Malmgren, Swedish journalist and politician (b. 1851)\n*1924 – Joseph Conrad, Polish-born British novelist (b. 1857)\n*1925 – William Bruce, Australian cricketer (b. 1864)\n*1929 – Emile Berliner, German-American inventor and businessman, invented the phonograph  (b. 1851)\n*  1929   – Thorstein Veblen, American economist and sociologist (b. 1857)\n*1936 – Konstantin Konik, Estonian surgeon and politician, 19th Estonian Minister of Education (b. 1873)\n*1942 – Richard Willstätter, German-Swiss chemist and academic, Nobel Prize laureate (b. 1872)\n*1949 – Ignotus, Hungarian poet and author (b. 1869)\n*1954 – Colette, French novelist and journalist (b. 1873)\n*1958 – Peter Collins, English race car driver (b. 1931)\n*1959 – Herb Byrne, Australian footballer (b. 1887)\n*1961 – Hilda Rix Nicholas, Australian artist (b. 1884)\n*1964 – Flannery O'Connor, American short story writer and novelist (b. 1925)\n*1966 – Lenny Bruce, American comedian, actor, and screenwriter (b. 1925) \n*1968 – Konstantin Rokossovsky, Marshal of the Soviet Union during World War II (b. 1896)\n*1969 – Alexander Mair, Australian politician, 26th Premier of New South Wales (b. 1889)\n*1972 – Giannis Papaioannou, Turkish-Greek composer (b. 1913)\n*1973 – Richard Marshall, American general (b. 1895)\n*1974 – Edgar Johan Kuusik, Estonian architect and interior designer (b. 1888)\n*1975 – Andreas Embirikos, Greek poet and photographer (b. 1901)\n*1977 – Makarios III, Cypriot archbishop and politician, 1st President of the Republic of Cyprus (b. 1913)\n*  1977   – Alfred Lunt, American actor and director (b. 1892)\n*1979 – Bertil Ohlin, Swedish economist and politician, Nobel Prize laureate (b. 1899)\n*  1979   – Angelos Terzakis, Greek author and playwright (b. 1907)\n*1983 – Carolyn Jones, American actress (b. 1930)\n*1995 – Ida Lupino, English-American actress and director (b. 1918)\n*  1995   – Edward Whittemore, American soldier and author (b. 1933)\n*1996 – Jørgen Garde, Danish admiral (b. 1939)\n*1997 – Pietro Rizzuto, Italian-Canadian lawyer and politician (b. 1934)\n*1998 – Alfred Schnittke, Russian composer and journalist (b. 1934)\n*1999 – Rod Ansell, Australian hunter (b. 1953)\n*  1999   – Byron Farwell, American historian and author (b. 1921)\n*2000 – Joann Lõssov, Estonian basketball player and coach (b. 1921)\n*2001 – Christopher Hewett, English actor and director (b. 1922)\n*2003 – Roger Voudouris, American singer-songwriter and guitarist (b. 1954)\n*2004 – Henri Cartier-Bresson, French photographer and painter (b. 1908)\n*2005 – Françoise d'Eaubonne, French author and poet (b. 1920)\n*2006 – Arthur Lee, American singer-songwriter, guitarist, and producer (b. 1945)\n*  2006   – Elisabeth Schwarzkopf, German-English soprano and actress (b. 1915)\n*2007 – John Gardner, English author (b. 1926)\n*  2007   – Peter Thorup, Danish singer-songwriter, guitarist, and producer (b. 1948)\n*2008 – Skip Caray, American sportscaster (b. 1939)\n*  2008   – Erik Darling, American singer-songwriter (b. 1933)\n*  2008   – Aleksandr Solzhenitsyn, Russian novelist, dramatist and historian, Nobel Prize laureate  (b. 1918)\n*2009 – Nikolaos Makarezos, Greek soldier and politician, Deputy Prime Minister of Greece (b. 1919)\n*2010 – Bobby Hebb, American singer-songwriter (b. 1938)\n*2011 – William Sleator, American author (b. 1945)\n*  2011   – Bubba Smith, American football player and actor (b. 1945)\n*2012 – Frank Evans, American baseball player, coach, and manager (b. 1921)\n*  2012   – Martin Fleischmann, Czech-English chemist and academic (b. 1927)\n*  2012   – Paul McCracken, American economist and academic (b. 1915)\n*  2012   – John Pritchard, American basketball player (b. 1927)\n*2013 – John Coombs, English-Monacan race car driver and businessman (b. 1922)\n*  2013   – Jack English Hightower, American lawyer and politician (b. 1926)\n*  2013   – Jack Hynes, Scottish-American soccer player and manager (b. 1920)\n*2014 – Miangul Aurangzeb, Pakistani captain and politician, 19th Governor of Khyber Pakhtunkhwa (b. 1928) \n*  2014   – Edward Clancy, Australian cardinal (b. 1923)\n*  2014   – Dorothy Salisbury Davis, American author (b. 1916)\n*  2014   – Kenny Drew, Jr., American pianist and composer (b. 1958)\n*  2014   – Lydia Yu-Jose, Filipino political scientist and academic (b. 1944)\n*2015 – Robert Conquest, English-American historian, poet, and academic (b. 1917)\n*  2015   – Mel Farr, American football player and businessman (b. 1944) \n*  2015   – Coleen Gray, American actress (b. 1922)\n*  2015   – Margot Loyola, Chilean singer-songwriter and guitarist (b. 1918)\n*  2015   – Johanna Quandt, German businesswoman (b. 1926)\n*  2015   – Jef Murray, Australian artist and author (b. 1960)\n\nHolidays and observances\n\n* Anniversary of the Killing of Pidjiguiti (Guinea-Bissau)\n* Armed Forces Day (Equatorial Guinea)\n* Christian feast day:\n** George Freeman Bragg, W. E. B. Du Bois (Episcopal Church)\n** Lydia of Thyatira\n** Myrrhbearers (Lutheran Church)\n** Nicodemus\n** Olaf II of Norway (Translation of the relic)\n** Stephen (Discovery of the relic)\n** Waltheof of Melrose\n** August 3 (Eastern Orthodox liturgics)\n* Flag Day (Venezuela)\n* Independence Day, celebrates the independence of Niger from France in 1960.\n**Arbor Day (Niger) \n* National Guard Day (Venezuela). August 3. http://en.wikipedia.org/?curid=1259."
  }
}
