{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3292",
  "eid" : "c4fb6960-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778410230,
  "textBody" : "Brass is a metallic  alloy that is made of copper and zinc. The proportions of zinc and copper can vary to create different types of brass alloys with varying mechanical and electrical properties.Engineering Designer 30(3): 6–9, May–July 2004 It is a substitutional alloy: atoms of the two constituents may replace each other within the same crystal structure.\n\nIn contrast, bronze is an alloy of copper and tin.Machinery Handbook, Industrial Press Inc, New York, Edition 24, p. 501 Both bronze and brass may include small proportions of a range of other elements including arsenic, lead, phosphorus, aluminium, manganese, and silicon. The distinction is largely historical. Modern practice in museums and archaeology increasingly avoids both terms for historical objects in favour of the all-embracing \"copper alloy\".The British Museum collection database \"scope note\" on \"copper alloy\", \"brass\" and \"bronze\" reads, \"The term copper alloy should be searched for full retrievals on objects made of bronze or brass. This is because bronze and brass have at times been used interchangeably in the old documentation, and copper alloy is the Broad Term of both. In addition, the public may refer to certain collections by their popular name, such as 'The Benin Bronzes' most of which are actually made of brass\".[https://www.britishmuseum.org/research/search_the_collection_database/term_details.aspx?scopeTypeTerms&scopeId\n18864 British Museum, \"Scope Note\" for \"copper alloy\"]. Britishmuseum.org. Retrieved on 2014-05-26.\n\nBrass is used for decoration for its bright gold-like appearance; for applications where low friction is required such as locks, gears, bearings, doorknobs, ammunition casings and valves; for plumbing and electrical applications; and extensively in brass musical instruments such as horns and bells where a combination of high workability (historically with hand tools) and durability is desired. It is also used in zippers. Brass is often used in situations in which it is important that sparks not be struck, such as in fittings and tools used near flammable or explosive materials.[http://www.ccohs.ca/oshanswers/safety_haz/hand_tools/nonsparking.html OSH Answers: Non-sparking tools]. Ccohs.ca (2011-06-02). Retrieved on 2011-12-09.\n\nProperties\n\nBrass has higher malleability than bronze or zinc. The relatively low melting point of brass (, depending on composition) and its flow characteristics make it a relatively easy material to cast. By varying the proportions of copper and zinc, the properties of the brass can be changed, allowing hard and soft brasses. The density of brass is .\n\nToday, almost 90% of all brass alloys are recycled. Because brass is not ferromagnetic, it can be separated from ferrous scrap by passing the scrap near a powerful magnet. Brass scrap is collected and transported to the foundry where it is melted and recast into billets. Billets are heated and extruded into the desired form and size.  The general softness of brass means that it can often be machined without the use of cutting fluid, though there are exceptions to this.\n\nAluminium makes brass stronger and more corrosion-resistant. Aluminium also causes a highly beneficial hard layer of aluminium oxide (Al2O3) to be formed on the surface that is thin, transparent and self-healing. Tin has a similar effect and finds its use especially in seawater applications (naval brasses). Combinations of iron, aluminium, silicon and manganese make brass wear and tear resistant.\n\nLead content\n\nTo enhance the machinability of brass, lead is often added in concentrations of around 2%. Since lead has a lower melting point than the other constituents of the brass, it tends to migrate towards the grain boundaries in the form of globules as it cools from casting. The pattern the globules form on the surface of the brass increases the available lead surface area which in turn affects the degree of leaching. In addition, cutting operations can smear the lead globules over the surface. These effects can lead to significant lead leaching from brasses of comparatively low lead content.\n\nSilicon is an alternative to lead; however, when silicon is used in a brass alloy, the scrap must never be mixed with leaded brass scrap because of contamination and safety problems.[https://www.chasebrass.com/productline/index_greendot.jsp Chase Brass & Copper Company, Inc] . Chasebrass.com. Retrieved on 2011-12-09.\n\nIn October 1999 the California State Attorney General sued 13 key manufacturers and distributors over lead content. In laboratory tests, state researchers found the average brass key, new or old, exceeded the California Proposition 65 limits by an average factor of 19, assuming handling twice a day.[http://ag.ca.gov/newsalerts/print_release.php?id\n529 News & Alerts – California Dept. of Justice – Office of the Attorney General], October 12, 1999 In April 2001 manufacturers agreed to reduce lead content to 1.5%, or face a requirement to warn consumers about lead content. Keys plated with other metals are not affected by the settlement, and may continue to use brass alloys with higher percentage of lead content.[http://ag.ca.gov/newsalerts/print_release.php?id=1077 News & Alerts – California Dept. of Justice – Office of the Attorney General], April 27, 2001San Francisco Superior Court, People v. Ilco Unican Corp., et a. (No. 307102) and Mateel Environmental Justice Foundation v. Ilco Unican Corp., et al. (No. 305765)\n\nAlso in California, lead-free materials must be used for \"each component that comes into contact with the wetted surface of pipes and pipe fittings, plumbing fittings and fixtures.\" On January 1, 2010, the maximum amount of lead in \"lead-free brass\" in California was reduced from 4% to 0.25% lead. The common practice of using pipes for electrical grounding is discouraged, as it accelerates lead corrosion.[http://info.sen.ca.gov/pub/05-06/bill/asm/ab_1951-2000/ab_1953_cfa_20060818_134053_sen_floor.html AB 1953 Assembly Bill – Bill Analysis] . Info.sen.ca.gov. Retrieved on 2011-12-09.[http://www.dtsc.ca.gov/PollutionPrevention/upload/Lead-in-Plumbing-Fact-Sheet.pdf Requirements for Low Lead Plumbing Products in California], Fact Sheet, Department of Toxic Substances Control, State of California, February 2009\n\nCorrosion-resistant brass for harsh environments\n\n \n\n The so-called dezincification resistant (DZR or DR) brasses, sometimes referred to as CR (corrosion resistant) brasses, are used where there is a large corrosion risk and where normal brasses do not meet the standards. Applications with high water temperatures, chlorides present, or deviating water qualities (soft water) play a role. DZR-brass is excellent in water boiler systems. This brass alloy must be produced with great care, with special attention placed on a balanced composition and proper production temperatures and parameters to avoid long-term failures.\n\nUse in musical instruments\n\nThe high malleability and workability, relatively good resistance to corrosion, and traditionally attributed acoustic properties of brass, have made it the usual metal of choice for construction of musical instruments whose acoustic resonators consist of long, relatively narrow tubing, often folded or coiled for compactness; silver and its alloys, and even gold, have been used for the same reasons, but brass is the most economical choice. Collectively known as brass instruments, these include the trombone, tuba, trumpet, cornet, baritone horn, euphonium, tenor horn, and French horn, and many other \"horns\", many in variously-sized families, such as the saxhorns. Other wind instruments may be constructed of brass or other metals, and indeed most modern student-model flutes and piccolos are made of some variety of brass, usually a cupronickel alloy similar to nickel silver/German silver. Clarinets, especially low clarinets such as the contrabass and subcontrabass, are sometimes made of metal because of limited supplies of the dense, fine-grained tropical hardwoods traditionally preferred for smaller woodwinds. For the same reason, some low clarinets, bassoons and contrabassoons feature a hybrid construction, with long, straight sections of wood, and curved joints, neck, and/or bell of metal.The use of metal also avoids the risks of exposing wooden instruments to changes in temperature or humidity, which can cause sudden cracking. Even though the saxophones and sarrusaphones are classified as woodwind instruments, they are normally made of brass for similar reasons, and because their wide, conical bores and thin-walled bodies are more easily and efficiently made by forming sheet metal than by machining wood.\n\nThe keywork of most modern woodwinds, including wooden-bodied instruments, is also usually made of an alloy such as Nickel Silver/German Silver. Such alloys are stiffer and more durable than the brass used to construct the instrument bodies, but still workable with simple hand tools -- a boon to quick repairs. The mouthpieces of both brass instruments and, less commonly, woodwind instruments are often made of brass, among other metals, as well.\n\nNext to the brass instruments, the most notable use of brass in music is in various percussion instruments, most notably cymbals, gongs, and orchestral (tubular) bells (large \"church\" bells are normally made of bronze). Small handbells and \"jingle bells\" are also commonly made of brass.\n\nThe harmonica is a free reed aerophone, also often made from brass. In organ pipes of the reed family, brass strips (called tongues) are used as the reeds, which beat against the shallot (or beat \"through\" the shallot in the case of a \"free\" reed). Although not part of the brass section, snare drums are also sometimes made of brass. Some parts on electric guitars are also made from brass, especially inertia blocks on tremolo systems for its tonal properties, and for string nuts and saddles for both tonal properties and its low friction.\n\nGermicidal and antimicrobial applications\n\nThe bactericidal properties of brass have been observed for centuries, particularly in marine environments where it prevents biofouling. Depending upon the type and concentration of pathogens and the medium they are in, brass kills these microorganisms within a few minutes to hours of contact.\n\nA large number of independent studies confirm this antimicrobial effect, even against antibiotic-resistant bacteria such as MRSA and VRSA. The mechanisms of antimicrobial action by copper and its alloys, including brass, are a subject of intense and ongoing investigation.\n\nSeason cracking\n\nBrass is susceptible to stress corrosion cracking, especially from ammonia or substances containing or releasing ammonia. The problem is sometimes known as season cracking after it was first discovered in brass cartridges used for rifle ammunition during the 1920s in the British Indian Army. The problem was caused by high residual stresses from cold forming of the cases during manufacture, together with chemical attack from traces of ammonia in the atmosphere. The cartridges were stored in stables and the ammonia concentration rose during the hot summer months, thus initiating brittle cracks. The problem was resolved by annealing the cases, and storing the cartridges elsewhere.\n\nBrass types\n\nHistory\n\nAlthough forms of brass have been in use since prehistory,Thornton, C. P. (2007) [http://www.safarmer.com/Indo-Eurasian/Brass2007.pdf \"Of brass and bronze in prehistoric southwest Asia\"] in La Niece, S. Hook, D. and Craddock, P.T. (eds.) Metals and mines: Studies in archaeometallurgy London: Archetype Publications.  its true nature as a copper-zinc alloy was not understood until the post medieval period because the zinc vapor which reacted with copper to make brass was not recognised as a metal.de Ruette, M. (1995) \"From Contrefei and Speauter to Zinc: The development of the understanding of the nature of zinc and brass in Post Medieval Europe\" in Hook, D.R. and Gaimster, D.R.M (eds) Trade and Discovery: The Scientific Study of Artefacts from Post Medieval Europe and Beyond London: British Museum Occasional Papers 109 The King James Bible makes many references to \"brass\".Cruden's Complete Concordance p. 55 The Shakespearean English form of the word 'brass' can mean any bronze alloy, or copper, rather than the strict modern definition of brass.  The earliest brasses may have been natural alloys made by smelting zinc-rich copper ores.Craddock, P.T. and Eckstein, K (2003) \"Production of Brass in Antiquity by Direct Reduction\" in Craddock, P.T. and Lang, J. (eds) Mining and Metal Production Through the Ages London: British Museum pp. 226–7 By the Roman period brass was being deliberately produced from metallic copper and zinc minerals using the cementation process, and variations on this method continued until the mid-19th century.Rehren and Martinon Torres 2008, pp. 170–5 It was eventually replaced by speltering, the direct alloying of copper and zinc metal which was introduced to Europe in the 16th century.\n\nEarly copper zinc alloys\n\nIn West Asia and the Eastern Mediterranean early copper zinc alloys are now known in small numbers from a number of third millennium BC sites in the Aegean, Iraq, the United Arab Emirates, Kalmykia, Turkmenistan and Georgia and from 2nd Millennium BC sites in West India, Uzbekistan, Iran, Syria, Iraq and Canaan.Thornton 2007, pp. 189–201 However, isolated examples of copper-zinc alloys are known in China from as early as the 5th Millennium BC.\n\nThe compositions of these early \"brass\" objects are highly variable and most have zinc contents of between 5% and 15% wt which is lower than in brass produced by cementation.Craddock and Eckstein 2003 p. 217 These may be \"natural alloys\" manufactured by smelting zinc rich copper ores in redox conditions. Many have similar tin contents to contemporary bronze artefacts and it is possible that some copper-zinc alloys were accidental and perhaps not even distinguished from copper. However the large number of copper-zinc alloys now known suggests that at least some were deliberately manufactured and many have zinc contents of more than 12% wt which would have resulted in a distinctive golden color.Thornton, C.P and Ehlers, C.B. (2003) \"Early Brass in the ancient Near East\" in IAMS Newsletter 23 pp. 27–36\n\nBy the 8th–7th century BC Assyrian cuneiform tablets mention the exploitation of the \"copper of the mountains\" and this may refer to \"natural\" brass.Bayley 1990, p. 8 \"Oreikhalkon\" (mountain copper), the Ancient Greek translation of this term, was later adapted to the Latin aurichalcum meaning \"golden copper\" which became the standard term for brass.Rehren and Martinon Torres 2008, p. 169 In the 4th century BC Plato knew orichalkos as rare and nearly as valuable as gold and Pliny describes how aurichalcum had come from Cypriot ore deposits which had been exhausted by the 1st century AD.Pliny the Elder Historia Naturalis XXXIV 2 X-ray fluorescence analysis of 39 orichalcum ingots recovered from a 2,600-year-old shipwreck off Sicily found them to be an alloy made with 75–80 percent copper, 15–20 percent zinc and small percentages of nickel, lead and iron.\n\nBrass making in the Roman world\n\nDuring the later part of first millennium BC the use of brass spread across a wide geographical area from Britain and Spain in the west to Iran, and India in the east.Craddock and Eckstein 2003, pp. 216–7 This seems to have been encouraged by exports and influence from the Middle East and eastern Mediterranean where deliberate production of brass from metallic copper and zinc ores had been introduced.Craddock and Eckstein 2003, p. 217 The 4th century BC writer Theopompus, quoted by Strabo, describes how heating earth from Andeira in Turkey produced \"droplets of false silver\", probably metallic zinc, which could be used to turn copper into oreichalkos.Bayley 1990, p. 9 In the 1st century BC the Greek Dioscorides seems to have recognised a link between zinc minerals and brass describing how Cadmia (zinc oxide) was found on the walls of furnaces used to heat either zinc ore or copper and explaining that it can then be used to make brass.Craddock and Eckstein 2003, pp. 222–4. Bayley 1990, p. 10.\n\nBy the first century BC brass was available in sufficient supply to use as coinage in Phrygia and Bithynia, and after the Augustan currency reform of 23 BC it was also used to make Roman dupondii and sestertii. The uniform use of brass for coinage and military equipment across the Roman world may indicate a degree of state involvement in the industry,Bayley 1990, p. 21 and brass even seems to have been deliberately boycotted by Jewish communities in Palestine because of its association with Roman authority.\n \nBrass was produced by the cementation process where copper and zinc ore are heated together until zinc vapor is produced which reacts with the copper. There is good archaeological evidence for this process and crucibles used to produce brass by cementation have been found on Roman period sites including Xanten and Nidda in Germany, Lyon in FranceRehren and Martinon Torres 2008, pp. 170–1 and at a number of sites in Britain.Bayley 1990 They vary in size from tiny acorn sized to large amphorae like vessels but all have elevated levels of zinc on the interior and are lidded. They show no signs of slag or metal prills suggesting that zinc minerals were heated to produce zinc vapor which reacted with metallic copper in a solid state reaction. The fabric of these crucibles is porous, probably designed to prevent a buildup of pressure, and many have small holes in the lids which may be designed to release pressure or to add additional zinc minerals near the end of the process. Dioscorides mentioned that zinc minerals were used for both the working and finishing of brass, perhaps suggesting secondary additions.Craddock and Eckstein 2003, p. 224\n\nBrass made during the early Roman period seems to have varied between 20% to 28% wt zinc.Craddock and Eckstein 2003, 224 The high content of zinc in coinage and brass objects declined after the first century AD and it has been suggested that this reflects zinc loss during recycling and thus an interruption in the production of new brass.Caley 1964 However it is now thought this was probably a deliberate change in composition and overall the use of brass increases over this period making up around 40% of all copper alloys used in the Roman world by the 4th century AD.Craddock 1978, p. 14\n\nBrass making in the medieval period\n\nLittle is known about the production of brass during the centuries immediately after the collapse of the Roman Empire. Disruption in the trade of tin for bronze from Western Europe may have contributed to the increasing popularity of brass in the east and by the 6th–7th centuries AD over 90% of copper alloy artefacts from Egypt were made of brass.Craddock, P.T. La Niece, S.C and Hook, D. (1990) \"Brass in the Medieval Islamic World\" in Craddock, P.T. (ed.) 2000 Years of Zinc and Brass London: British Museum p. 73 However other alloys such as low tin bronze were also used and they vary depending on local cultural attitudes, the purpose of the metal and access to zinc, especially between the Islamic and Byzantine world. Conversely the use of true brass seems to have declined in Western Europe during this period in favour of gunmetals and other mixed alloysBayley 1990, p. 22 but by about 1000 brass artefacts are found in Scandinavian graves in Scotland, brass was being used in the manufacture of coins in NorthumbriaGilmore, G.R. and Metcalf, D.M (1980) \"The alloy of the Northumbrian coinage in the mid-ninth century\" in Metcalf, D and Oddy, W. Metallurgy in Numismatics 1 pp. 83–98 and there is archaeological and historical evidence for the production of calamine brass in GermanyRehren 1999 and The Low Countries,Day 1990, pp. 123–150 areas rich in calamine ore.\n\nThese places would remain important centres of brass making throughout the medieval period,Day 1990, pp. 124–33 especially Dinant.  Brass objects are still collectively known as dinanterie in French.  The baptismal font at St Bartholomew's Church, Liège in modern Belgium (before 1117) is an outstanding masterpiece of Romanesque brass casting, though also often described as bronze.  The metal of the early 12th-century Gloucester Candlestick is unusual even by medieval standards in being a mixture of copper, zinc, tin, lead, nickel, iron, antimony and arsenic with an unusually large amount of silver, ranging from 22.5% in the base to 5.76% in the pan below the candle.  The proportions of this mixture may suggest that the candlestick was made from a hoard of old coins, probably Late Roman.Noel Stratford, pp. 232, 245, in Zarnecki, George and others; English Romanesque Art, 1066–1200, 1984, Arts Council of Great Britain,   Latten is a term for decorative borders and similar objects cut from sheet metal, whether of brass or bronze.  Aquamaniles were typically made in brass in both the European and Islamic worlds.\n\nThe cementation process continued to be used but literary sources from both Europe and the Islamic world seem to describe variants of a higher temperature liquid process which took place in open-topped crucibles.Craddock and Eckstein 2003, pp. 224–5 Islamic cementation seems to have used zinc oxide known as tutiya or tutty rather than zinc ores for brass-making, resulting in a metal with lower iron impurities.Craddock et al. 1990, 78 A number of Islamic writers and the 13th century Italian Marco Polo describe how this was obtained by sublimation from zinc ores and condensed onto clay or iron bars, archaeological examples of which have been identified at Kush in Iran.Craddock et al. 1990, pp. 73–6 It could then be used for brass making or medicinal purposes. In 10th century Yemen al-Hamdani described how spreading al-iglimiya, probably zinc oxide, onto the surface of molten copper produced tutiya vapor which then reacted with the metal.Craddock et al. 1990, p. 75 The 13th century Iranian writer al-Kashani describes a more complex process whereby tutiya was mixed with raisins and gently roasted before being added to the surface of the molten metal. A temporary lid was added at this point presumably to minimise the escape of zinc vapor.Craddock et al. 1990, p. 76\n\nIn Europe a similar liquid process in open-topped crucibles took place which was probably less efficient than the Roman process and the use of the term tutty by Albertus Magnus in the 13th century suggests influence from Islamic technology.Rehren, T (1999) \"The same...but different: A juxtaposition of Roman and Medieval brass making in Europe\" in Young, S.M.M. (ed.) Metals in antiquity Oxford: Archaeopress pp. 252–7 The 12th century German monk Theophilus described how preheated crucibles were one sixth filled with powdered calamine and charcoal then topped up with copper and charcoal before being melted, stirred then filled again. The final product was cast, then again melted with calamine. It has been suggested that this second melting may have taken place at a lower temperature to allow more zinc to be absorbed.Craddock and Eckstein 2003, 226 Albertus Magnus noted that the \"power\" of both calamine and tutty could evaporate and described how the addition of powdered glass could create a film to bind it to the metal.Rehren and Martinon Torres 2008, pp. 176–8 \nGerman brass making crucibles are known from Dortmund dating to the 10th century AD and from Soest and Schwerte in Westphalia dating to around the 13th century confirm Theophilus' account, as they are open-topped, although ceramic discs from Soest may have served as loose lids which may have been used to reduce zinc evaporation, and have slag on the interior resulting from a liquid process.Rehren and Martinon Torres 2008, pp. 173–5\n\nBrass in Africa\n\nSome of the most famous objects in African art are the lost wax castings of West Africa, mostly from what is now Nigeria, produced first by the Kingdom of Ife and then the Benin Empire.  Though normally described as \"bronzes\", the Benin Bronzes, now mostly in the British Museum and other Western collections, and the large portrait heads such as the Bronze Head from Ife of \"heavily leaded zinc-brass\" and the Bronze Head of Queen Idia, both also British Museum, are better described as brass, though of variable compositions.[https://www.britishmuseum.org/research/collection_online/collection_object_details.aspx?objectId=618380 \"The Ife Head\"] on the British Museum collection database. Accessed 26 May 2014  Work in brass or bronze continued to be important in Benin art and other West African traditions such as Akan goldweights, where the metal was regarded as a more valuable material than in Europe.\n\nBrass making in Renaissance and post-medieval Europe\n\nThe Renaissance saw important changes to both the theory and practice of brassmaking in Europe. By the 15th century there is evidence for the renewed use of lidded cementation crucibles at Zwickau in Germany.Martinon Torres and Rehren 2002, pp. 95–111 These large crucibles were capable of producing c.20 kg of brass.Martinon Torres and Rehren 2002, pp. 105–6 There are traces of slag and pieces of metal on the interior. Their irregular composition suggesting that this was a lower temperature not entirely liquid process.Martinon Torres and Rehren 2002, p. 103 The crucible lids had small holes which were blocked with clay plugs near the end of the process presumably to maximise zinc absorption in the final stages.Martinon Torres and Rehren 2002, p. 104 Triangular crucibles were then used to melt the brass for casting.Martinon Torres and Rehren 2002, p. 100\n\n16th-century technical writers such as Biringuccio, Ercker and Agricola described a variety of cementation brass making techniques and came closer to understanding the true nature of the process noting that copper became heavier as it changed to brass and that it became more golden as additional calamine was added.Martinon Torres and Rehren 2008, 181–2, de Ruette 1995 Zinc metal was also becoming more commonplace By 1513 metallic zinc ingots from India and China were arriving in London and pellets of zinc condensed in furnace flues at the Rammelsberg in Germany were exploited for cementation brass making from around 1550.de Ruette 1995, 198\n\nEventually it was discovered that metallic zinc could be alloyed with copper to make brass; a process known as spelteringCraddock and Eckstein 2003, 228 and by 1657 the German chemist Johann Glauber had recognised that calamine was \"nothing else but unmeltable zinc\" and that zinc was a \"half ripe metal.\"de Ruette 1995, 198–9 However some earlier high zinc, low iron brasses such as the 1530 Wightman brass memorial plaque from England may have been made by alloying copper with zinc and include traces of cadmium similar to those found in some zinc ingots from China.\n \nHowever the cementation process was not abandoned and as late as the early 19th century there are descriptions of solid-state cementation in a domed furnace at around 900–950 °C and lasting up to 10 hours.Craddock and Eckstein 2003, 226–7. The European brass industry continued to flourish into the post medieval period buoyed by innovations such as the 16th century introduction of water powered hammers for the production of battery wares.Day 1990, p. 131 By 1559 the Germany city of Aachen alone was capable of producing 300,000 cwt of brass per year. After several false starts during the 16th and 17th centuries the brass industry was also established in England taking advantage of abundant supplies of cheap copper smelted in the new coal fired reverberatory furnace.Day 1991, pp. 135–44 In 1723 Bristol brass maker Nehemiah Champion patented the use of granulated copper, produced by pouring molten metal into cold water.Day 1990, p. 138 This increased the surface area of the copper helping it react and zinc contents of up to 33% wt were reported using this new technique.Craddock and Eckstein 2003, p. 227\n\nIn 1738 Nehemiah's son William Champion patented a technique for the first industrial scale distillation of metallic zinc known as distillation per descencum or \"the English process.\"Day 1991, pp. 179–81 This local zinc was used in speltering and allowed greater control over the zinc content of brass and the production of high-zinc copper alloys which would have been difficult or impossible to produce using cementation, for use in expensive objects such as scientific instruments, clocks, brass buttons and costume jewellery.Day 1991, p. 183 However Champion continued to use the cheaper calamine cementation method to produce lower-zinc brass and the archaeological remains of bee-hive shaped cementation furnaces have been identified at his works at Warmley. By the mid-to-late 18th century developments in cheaper zinc distillation such as John-Jaques Dony's horizontal furnaces in Belgium and the reduction of tariffs on zincDay 1991, pp. 186–9 as well as demand for corrosion-resistant high zinc alloys increased the popularity of speltering and as a result cementation was largely abandoned by the mid-19th century.Day 1991, pp. 192–3, Craddock and Eckstein 2003, p. 228",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Brass" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3292" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Brass is a metallic  alloy that is made of copper and zinc. The proportions of zinc and copper can vary to create different types of brass alloys with varying mechanical and electrical properties.Engineering Designer 30(3): 6–9, May–July 2004 It is a substitutional alloy: atoms of the two constituents may replace each other within the same crystal structure.\n\nIn contrast, bronze is an alloy of copper and tin.Machinery Handbook, Industrial Press Inc, New York, Edition 24, p. 501 Both bronze and brass may include small proportions of a range of other elements including arsenic, lead, phosphorus, aluminium, manganese, and silicon. The distinction is largely historical. Modern practice in museums and archaeology increasingly avoids both terms for historical objects in favour of the all-embracing \"copper alloy\".The British Museum collection database \"scope note\" on \"copper alloy\", \"brass\" and \"bronze\" reads, \"The term copper alloy should be searched for full retrievals on objects made of bronze or brass. This is because bronze and brass have at times been used interchangeably in the old documentation, and copper alloy is the Broad Term of both. In addition, the public may refer to certain collections by their popular name, such as 'The Benin Bronzes' most of which are actually made of brass\".[https://www.britishmuseum.org/research/search_the_collection_database/term_details.aspx?scopeTypeTerms&scopeId\n18864 British Museum, \"Scope Note\" for \"copper alloy\"]. Britishmuseum.org. Retrieved on 2014-05-26.\n\nBrass is used for decoration for its bright gold-like appearance; for applications where low friction is required such as locks, gears, bearings, doorknobs, ammunition casings and valves; for plumbing and electrical applications; and extensively in brass musical instruments such as horns and bells where a combination of high workability (historically with hand tools) and durability is desired. It is also used in zippers. Brass is often used in situations in which it is important that sparks not be struck, such as in fittings and tools used near flammable or explosive materials.[http://www.ccohs.ca/oshanswers/safety_haz/hand_tools/nonsparking.html OSH Answers: Non-sparking tools]. Ccohs.ca (2011-06-02). Retrieved on 2011-12-09.\n\nProperties\n\nBrass has higher malleability than bronze or zinc. The relatively low melting point of brass (, depending on composition) and its flow characteristics make it a relatively easy material to cast. By varying the proportions of copper and zinc, the properties of the brass can be changed, allowing hard and soft brasses. The density of brass is .\n\nToday, almost 90% of all brass alloys are recycled. Because brass is not ferromagnetic, it can be separated from ferrous scrap by passing the scrap near a powerful magnet. Brass scrap is collected and transported to the foundry where it is melted and recast into billets. Billets are heated and extruded into the desired form and size.  The general softness of brass means that it can often be machined without the use of cutting fluid, though there are exceptions to this.\n\nAluminium makes brass stronger and more corrosion-resistant. Aluminium also causes a highly beneficial hard layer of aluminium oxide (Al2O3) to be formed on the surface that is thin, transparent and self-healing. Tin has a similar effect and finds its use especially in seawater applications (naval brasses). Combinations of iron, aluminium, silicon and manganese make brass wear and tear resistant.\n\nLead content\n\nTo enhance the machinability of brass, lead is often added in concentrations of around 2%. Since lead has a lower melting point than the other constituents of the brass, it tends to migrate towards the grain boundaries in the form of globules as it cools from casting. The pattern the globules form on the surface of the brass increases the available lead surface area which in turn affects the degree of leaching. In addition, cutting operations can smear the lead globules over the surface. These effects can lead to significant lead leaching from brasses of comparatively low lead content.\n\nSilicon is an alternative to lead; however, when silicon is used in a brass alloy, the scrap must never be mixed with leaded brass scrap because of contamination and safety problems.[https://www.chasebrass.com/productline/index_greendot.jsp Chase Brass & Copper Company, Inc] . Chasebrass.com. Retrieved on 2011-12-09.\n\nIn October 1999 the California State Attorney General sued 13 key manufacturers and distributors over lead content. In laboratory tests, state researchers found the average brass key, new or old, exceeded the California Proposition 65 limits by an average factor of 19, assuming handling twice a day.[http://ag.ca.gov/newsalerts/print_release.php?id\n529 News & Alerts – California Dept. of Justice – Office of the Attorney General], October 12, 1999 In April 2001 manufacturers agreed to reduce lead content to 1.5%, or face a requirement to warn consumers about lead content. Keys plated with other metals are not affected by the settlement, and may continue to use brass alloys with higher percentage of lead content.[http://ag.ca.gov/newsalerts/print_release.php?id=1077 News & Alerts – California Dept. of Justice – Office of the Attorney General], April 27, 2001San Francisco Superior Court, People v. Ilco Unican Corp., et a. (No. 307102) and Mateel Environmental Justice Foundation v. Ilco Unican Corp., et al. (No. 305765)\n\nAlso in California, lead-free materials must be used for \"each component that comes into contact with the wetted surface of pipes and pipe fittings, plumbing fittings and fixtures.\" On January 1, 2010, the maximum amount of lead in \"lead-free brass\" in California was reduced from 4% to 0.25% lead. The common practice of using pipes for electrical grounding is discouraged, as it accelerates lead corrosion.[http://info.sen.ca.gov/pub/05-06/bill/asm/ab_1951-2000/ab_1953_cfa_20060818_134053_sen_floor.html AB 1953 Assembly Bill – Bill Analysis] . Info.sen.ca.gov. Retrieved on 2011-12-09.[http://www.dtsc.ca.gov/PollutionPrevention/upload/Lead-in-Plumbing-Fact-Sheet.pdf Requirements for Low Lead Plumbing Products in California], Fact Sheet, Department of Toxic Substances Control, State of California, February 2009\n\nCorrosion-resistant brass for harsh environments\n\n \n\n The so-called dezincification resistant (DZR or DR) brasses, sometimes referred to as CR (corrosion resistant) brasses, are used where there is a large corrosion risk and where normal brasses do not meet the standards. Applications with high water temperatures, chlorides present, or deviating water qualities (soft water) play a role. DZR-brass is excellent in water boiler systems. This brass alloy must be produced with great care, with special attention placed on a balanced composition and proper production temperatures and parameters to avoid long-term failures.\n\nUse in musical instruments\n\nThe high malleability and workability, relatively good resistance to corrosion, and traditionally attributed acoustic properties of brass, have made it the usual metal of choice for construction of musical instruments whose acoustic resonators consist of long, relatively narrow tubing, often folded or coiled for compactness; silver and its alloys, and even gold, have been used for the same reasons, but brass is the most economical choice. Collectively known as brass instruments, these include the trombone, tuba, trumpet, cornet, baritone horn, euphonium, tenor horn, and French horn, and many other \"horns\", many in variously-sized families, such as the saxhorns. Other wind instruments may be constructed of brass or other metals, and indeed most modern student-model flutes and piccolos are made of some variety of brass, usually a cupronickel alloy similar to nickel silver/German silver. Clarinets, especially low clarinets such as the contrabass and subcontrabass, are sometimes made of metal because of limited supplies of the dense, fine-grained tropical hardwoods traditionally preferred for smaller woodwinds. For the same reason, some low clarinets, bassoons and contrabassoons feature a hybrid construction, with long, straight sections of wood, and curved joints, neck, and/or bell of metal.The use of metal also avoids the risks of exposing wooden instruments to changes in temperature or humidity, which can cause sudden cracking. Even though the saxophones and sarrusaphones are classified as woodwind instruments, they are normally made of brass for similar reasons, and because their wide, conical bores and thin-walled bodies are more easily and efficiently made by forming sheet metal than by machining wood.\n\nThe keywork of most modern woodwinds, including wooden-bodied instruments, is also usually made of an alloy such as Nickel Silver/German Silver. Such alloys are stiffer and more durable than the brass used to construct the instrument bodies, but still workable with simple hand tools -- a boon to quick repairs. The mouthpieces of both brass instruments and, less commonly, woodwind instruments are often made of brass, among other metals, as well.\n\nNext to the brass instruments, the most notable use of brass in music is in various percussion instruments, most notably cymbals, gongs, and orchestral (tubular) bells (large \"church\" bells are normally made of bronze). Small handbells and \"jingle bells\" are also commonly made of brass.\n\nThe harmonica is a free reed aerophone, also often made from brass. In organ pipes of the reed family, brass strips (called tongues) are used as the reeds, which beat against the shallot (or beat \"through\" the shallot in the case of a \"free\" reed). Although not part of the brass section, snare drums are also sometimes made of brass. Some parts on electric guitars are also made from brass, especially inertia blocks on tremolo systems for its tonal properties, and for string nuts and saddles for both tonal properties and its low friction.\n\nGermicidal and antimicrobial applications\n\nThe bactericidal properties of brass have been observed for centuries, particularly in marine environments where it prevents biofouling. Depending upon the type and concentration of pathogens and the medium they are in, brass kills these microorganisms within a few minutes to hours of contact.\n\nA large number of independent studies confirm this antimicrobial effect, even against antibiotic-resistant bacteria such as MRSA and VRSA. The mechanisms of antimicrobial action by copper and its alloys, including brass, are a subject of intense and ongoing investigation.\n\nSeason cracking\n\nBrass is susceptible to stress corrosion cracking, especially from ammonia or substances containing or releasing ammonia. The problem is sometimes known as season cracking after it was first discovered in brass cartridges used for rifle ammunition during the 1920s in the British Indian Army. The problem was caused by high residual stresses from cold forming of the cases during manufacture, together with chemical attack from traces of ammonia in the atmosphere. The cartridges were stored in stables and the ammonia concentration rose during the hot summer months, thus initiating brittle cracks. The problem was resolved by annealing the cases, and storing the cartridges elsewhere.\n\nBrass types\n\nHistory\n\nAlthough forms of brass have been in use since prehistory,Thornton, C. P. (2007) [http://www.safarmer.com/Indo-Eurasian/Brass2007.pdf \"Of brass and bronze in prehistoric southwest Asia\"] in La Niece, S. Hook, D. and Craddock, P.T. (eds.) Metals and mines: Studies in archaeometallurgy London: Archetype Publications.  its true nature as a copper-zinc alloy was not understood until the post medieval period because the zinc vapor which reacted with copper to make brass was not recognised as a metal.de Ruette, M. (1995) \"From Contrefei and Speauter to Zinc: The development of the understanding of the nature of zinc and brass in Post Medieval Europe\" in Hook, D.R. and Gaimster, D.R.M (eds) Trade and Discovery: The Scientific Study of Artefacts from Post Medieval Europe and Beyond London: British Museum Occasional Papers 109 The King James Bible makes many references to \"brass\".Cruden's Complete Concordance p. 55 The Shakespearean English form of the word 'brass' can mean any bronze alloy, or copper, rather than the strict modern definition of brass.  The earliest brasses may have been natural alloys made by smelting zinc-rich copper ores.Craddock, P.T. and Eckstein, K (2003) \"Production of Brass in Antiquity by Direct Reduction\" in Craddock, P.T. and Lang, J. (eds) Mining and Metal Production Through the Ages London: British Museum pp. 226–7 By the Roman period brass was being deliberately produced from metallic copper and zinc minerals using the cementation process, and variations on this method continued until the mid-19th century.Rehren and Martinon Torres 2008, pp. 170–5 It was eventually replaced by speltering, the direct alloying of copper and zinc metal which was introduced to Europe in the 16th century.\n\nEarly copper zinc alloys\n\nIn West Asia and the Eastern Mediterranean early copper zinc alloys are now known in small numbers from a number of third millennium BC sites in the Aegean, Iraq, the United Arab Emirates, Kalmykia, Turkmenistan and Georgia and from 2nd Millennium BC sites in West India, Uzbekistan, Iran, Syria, Iraq and Canaan.Thornton 2007, pp. 189–201 However, isolated examples of copper-zinc alloys are known in China from as early as the 5th Millennium BC.\n\nThe compositions of these early \"brass\" objects are highly variable and most have zinc contents of between 5% and 15% wt which is lower than in brass produced by cementation.Craddock and Eckstein 2003 p. 217 These may be \"natural alloys\" manufactured by smelting zinc rich copper ores in redox conditions. Many have similar tin contents to contemporary bronze artefacts and it is possible that some copper-zinc alloys were accidental and perhaps not even distinguished from copper. However the large number of copper-zinc alloys now known suggests that at least some were deliberately manufactured and many have zinc contents of more than 12% wt which would have resulted in a distinctive golden color.Thornton, C.P and Ehlers, C.B. (2003) \"Early Brass in the ancient Near East\" in IAMS Newsletter 23 pp. 27–36\n\nBy the 8th–7th century BC Assyrian cuneiform tablets mention the exploitation of the \"copper of the mountains\" and this may refer to \"natural\" brass.Bayley 1990, p. 8 \"Oreikhalkon\" (mountain copper), the Ancient Greek translation of this term, was later adapted to the Latin aurichalcum meaning \"golden copper\" which became the standard term for brass.Rehren and Martinon Torres 2008, p. 169 In the 4th century BC Plato knew orichalkos as rare and nearly as valuable as gold and Pliny describes how aurichalcum had come from Cypriot ore deposits which had been exhausted by the 1st century AD.Pliny the Elder Historia Naturalis XXXIV 2 X-ray fluorescence analysis of 39 orichalcum ingots recovered from a 2,600-year-old shipwreck off Sicily found them to be an alloy made with 75–80 percent copper, 15–20 percent zinc and small percentages of nickel, lead and iron.\n\nBrass making in the Roman world\n\nDuring the later part of first millennium BC the use of brass spread across a wide geographical area from Britain and Spain in the west to Iran, and India in the east.Craddock and Eckstein 2003, pp. 216–7 This seems to have been encouraged by exports and influence from the Middle East and eastern Mediterranean where deliberate production of brass from metallic copper and zinc ores had been introduced.Craddock and Eckstein 2003, p. 217 The 4th century BC writer Theopompus, quoted by Strabo, describes how heating earth from Andeira in Turkey produced \"droplets of false silver\", probably metallic zinc, which could be used to turn copper into oreichalkos.Bayley 1990, p. 9 In the 1st century BC the Greek Dioscorides seems to have recognised a link between zinc minerals and brass describing how Cadmia (zinc oxide) was found on the walls of furnaces used to heat either zinc ore or copper and explaining that it can then be used to make brass.Craddock and Eckstein 2003, pp. 222–4. Bayley 1990, p. 10.\n\nBy the first century BC brass was available in sufficient supply to use as coinage in Phrygia and Bithynia, and after the Augustan currency reform of 23 BC it was also used to make Roman dupondii and sestertii. The uniform use of brass for coinage and military equipment across the Roman world may indicate a degree of state involvement in the industry,Bayley 1990, p. 21 and brass even seems to have been deliberately boycotted by Jewish communities in Palestine because of its association with Roman authority.\n \nBrass was produced by the cementation process where copper and zinc ore are heated together until zinc vapor is produced which reacts with the copper. There is good archaeological evidence for this process and crucibles used to produce brass by cementation have been found on Roman period sites including Xanten and Nidda in Germany, Lyon in FranceRehren and Martinon Torres 2008, pp. 170–1 and at a number of sites in Britain.Bayley 1990 They vary in size from tiny acorn sized to large amphorae like vessels but all have elevated levels of zinc on the interior and are lidded. They show no signs of slag or metal prills suggesting that zinc minerals were heated to produce zinc vapor which reacted with metallic copper in a solid state reaction. The fabric of these crucibles is porous, probably designed to prevent a buildup of pressure, and many have small holes in the lids which may be designed to release pressure or to add additional zinc minerals near the end of the process. Dioscorides mentioned that zinc minerals were used for both the working and finishing of brass, perhaps suggesting secondary additions.Craddock and Eckstein 2003, p. 224\n\nBrass made during the early Roman period seems to have varied between 20% to 28% wt zinc.Craddock and Eckstein 2003, 224 The high content of zinc in coinage and brass objects declined after the first century AD and it has been suggested that this reflects zinc loss during recycling and thus an interruption in the production of new brass.Caley 1964 However it is now thought this was probably a deliberate change in composition and overall the use of brass increases over this period making up around 40% of all copper alloys used in the Roman world by the 4th century AD.Craddock 1978, p. 14\n\nBrass making in the medieval period\n\nLittle is known about the production of brass during the centuries immediately after the collapse of the Roman Empire. Disruption in the trade of tin for bronze from Western Europe may have contributed to the increasing popularity of brass in the east and by the 6th–7th centuries AD over 90% of copper alloy artefacts from Egypt were made of brass.Craddock, P.T. La Niece, S.C and Hook, D. (1990) \"Brass in the Medieval Islamic World\" in Craddock, P.T. (ed.) 2000 Years of Zinc and Brass London: British Museum p. 73 However other alloys such as low tin bronze were also used and they vary depending on local cultural attitudes, the purpose of the metal and access to zinc, especially between the Islamic and Byzantine world. Conversely the use of true brass seems to have declined in Western Europe during this period in favour of gunmetals and other mixed alloysBayley 1990, p. 22 but by about 1000 brass artefacts are found in Scandinavian graves in Scotland, brass was being used in the manufacture of coins in NorthumbriaGilmore, G.R. and Metcalf, D.M (1980) \"The alloy of the Northumbrian coinage in the mid-ninth century\" in Metcalf, D and Oddy, W. Metallurgy in Numismatics 1 pp. 83–98 and there is archaeological and historical evidence for the production of calamine brass in GermanyRehren 1999 and The Low Countries,Day 1990, pp. 123–150 areas rich in calamine ore.\n\nThese places would remain important centres of brass making throughout the medieval period,Day 1990, pp. 124–33 especially Dinant.  Brass objects are still collectively known as dinanterie in French.  The baptismal font at St Bartholomew's Church, Liège in modern Belgium (before 1117) is an outstanding masterpiece of Romanesque brass casting, though also often described as bronze.  The metal of the early 12th-century Gloucester Candlestick is unusual even by medieval standards in being a mixture of copper, zinc, tin, lead, nickel, iron, antimony and arsenic with an unusually large amount of silver, ranging from 22.5% in the base to 5.76% in the pan below the candle.  The proportions of this mixture may suggest that the candlestick was made from a hoard of old coins, probably Late Roman.Noel Stratford, pp. 232, 245, in Zarnecki, George and others; English Romanesque Art, 1066–1200, 1984, Arts Council of Great Britain,   Latten is a term for decorative borders and similar objects cut from sheet metal, whether of brass or bronze.  Aquamaniles were typically made in brass in both the European and Islamic worlds.\n\nThe cementation process continued to be used but literary sources from both Europe and the Islamic world seem to describe variants of a higher temperature liquid process which took place in open-topped crucibles.Craddock and Eckstein 2003, pp. 224–5 Islamic cementation seems to have used zinc oxide known as tutiya or tutty rather than zinc ores for brass-making, resulting in a metal with lower iron impurities.Craddock et al. 1990, 78 A number of Islamic writers and the 13th century Italian Marco Polo describe how this was obtained by sublimation from zinc ores and condensed onto clay or iron bars, archaeological examples of which have been identified at Kush in Iran.Craddock et al. 1990, pp. 73–6 It could then be used for brass making or medicinal purposes. In 10th century Yemen al-Hamdani described how spreading al-iglimiya, probably zinc oxide, onto the surface of molten copper produced tutiya vapor which then reacted with the metal.Craddock et al. 1990, p. 75 The 13th century Iranian writer al-Kashani describes a more complex process whereby tutiya was mixed with raisins and gently roasted before being added to the surface of the molten metal. A temporary lid was added at this point presumably to minimise the escape of zinc vapor.Craddock et al. 1990, p. 76\n\nIn Europe a similar liquid process in open-topped crucibles took place which was probably less efficient than the Roman process and the use of the term tutty by Albertus Magnus in the 13th century suggests influence from Islamic technology.Rehren, T (1999) \"The same...but different: A juxtaposition of Roman and Medieval brass making in Europe\" in Young, S.M.M. (ed.) Metals in antiquity Oxford: Archaeopress pp. 252–7 The 12th century German monk Theophilus described how preheated crucibles were one sixth filled with powdered calamine and charcoal then topped up with copper and charcoal before being melted, stirred then filled again. The final product was cast, then again melted with calamine. It has been suggested that this second melting may have taken place at a lower temperature to allow more zinc to be absorbed.Craddock and Eckstein 2003, 226 Albertus Magnus noted that the \"power\" of both calamine and tutty could evaporate and described how the addition of powdered glass could create a film to bind it to the metal.Rehren and Martinon Torres 2008, pp. 176–8 \nGerman brass making crucibles are known from Dortmund dating to the 10th century AD and from Soest and Schwerte in Westphalia dating to around the 13th century confirm Theophilus' account, as they are open-topped, although ceramic discs from Soest may have served as loose lids which may have been used to reduce zinc evaporation, and have slag on the interior resulting from a liquid process.Rehren and Martinon Torres 2008, pp. 173–5\n\nBrass in Africa\n\nSome of the most famous objects in African art are the lost wax castings of West Africa, mostly from what is now Nigeria, produced first by the Kingdom of Ife and then the Benin Empire.  Though normally described as \"bronzes\", the Benin Bronzes, now mostly in the British Museum and other Western collections, and the large portrait heads such as the Bronze Head from Ife of \"heavily leaded zinc-brass\" and the Bronze Head of Queen Idia, both also British Museum, are better described as brass, though of variable compositions.[https://www.britishmuseum.org/research/collection_online/collection_object_details.aspx?objectId=618380 \"The Ife Head\"] on the British Museum collection database. Accessed 26 May 2014  Work in brass or bronze continued to be important in Benin art and other West African traditions such as Akan goldweights, where the metal was regarded as a more valuable material than in Europe.\n\nBrass making in Renaissance and post-medieval Europe\n\nThe Renaissance saw important changes to both the theory and practice of brassmaking in Europe. By the 15th century there is evidence for the renewed use of lidded cementation crucibles at Zwickau in Germany.Martinon Torres and Rehren 2002, pp. 95–111 These large crucibles were capable of producing c.20 kg of brass.Martinon Torres and Rehren 2002, pp. 105–6 There are traces of slag and pieces of metal on the interior. Their irregular composition suggesting that this was a lower temperature not entirely liquid process.Martinon Torres and Rehren 2002, p. 103 The crucible lids had small holes which were blocked with clay plugs near the end of the process presumably to maximise zinc absorption in the final stages.Martinon Torres and Rehren 2002, p. 104 Triangular crucibles were then used to melt the brass for casting.Martinon Torres and Rehren 2002, p. 100\n\n16th-century technical writers such as Biringuccio, Ercker and Agricola described a variety of cementation brass making techniques and came closer to understanding the true nature of the process noting that copper became heavier as it changed to brass and that it became more golden as additional calamine was added.Martinon Torres and Rehren 2008, 181–2, de Ruette 1995 Zinc metal was also becoming more commonplace By 1513 metallic zinc ingots from India and China were arriving in London and pellets of zinc condensed in furnace flues at the Rammelsberg in Germany were exploited for cementation brass making from around 1550.de Ruette 1995, 198\n\nEventually it was discovered that metallic zinc could be alloyed with copper to make brass; a process known as spelteringCraddock and Eckstein 2003, 228 and by 1657 the German chemist Johann Glauber had recognised that calamine was \"nothing else but unmeltable zinc\" and that zinc was a \"half ripe metal.\"de Ruette 1995, 198–9 However some earlier high zinc, low iron brasses such as the 1530 Wightman brass memorial plaque from England may have been made by alloying copper with zinc and include traces of cadmium similar to those found in some zinc ingots from China.\n \nHowever the cementation process was not abandoned and as late as the early 19th century there are descriptions of solid-state cementation in a domed furnace at around 900–950 °C and lasting up to 10 hours.Craddock and Eckstein 2003, 226–7. The European brass industry continued to flourish into the post medieval period buoyed by innovations such as the 16th century introduction of water powered hammers for the production of battery wares.Day 1990, p. 131 By 1559 the Germany city of Aachen alone was capable of producing 300,000 cwt of brass per year. After several false starts during the 16th and 17th centuries the brass industry was also established in England taking advantage of abundant supplies of cheap copper smelted in the new coal fired reverberatory furnace.Day 1991, pp. 135–44 In 1723 Bristol brass maker Nehemiah Champion patented the use of granulated copper, produced by pouring molten metal into cold water.Day 1990, p. 138 This increased the surface area of the copper helping it react and zinc contents of up to 33% wt were reported using this new technique.Craddock and Eckstein 2003, p. 227\n\nIn 1738 Nehemiah's son William Champion patented a technique for the first industrial scale distillation of metallic zinc known as distillation per descencum or \"the English process.\"Day 1991, pp. 179–81 This local zinc was used in speltering and allowed greater control over the zinc content of brass and the production of high-zinc copper alloys which would have been difficult or impossible to produce using cementation, for use in expensive objects such as scientific instruments, clocks, brass buttons and costume jewellery.Day 1991, p. 183 However Champion continued to use the cheaper calamine cementation method to produce lower-zinc brass and the archaeological remains of bee-hive shaped cementation furnaces have been identified at his works at Warmley. By the mid-to-late 18th century developments in cheaper zinc distillation such as John-Jaques Dony's horizontal furnaces in Belgium and the reduction of tariffs on zincDay 1991, pp. 186–9 as well as demand for corrosion-resistant high zinc alloys increased the popularity of speltering and as a result cementation was largely abandoned by the mid-19th century.Day 1991, pp. 192–3, Craddock and Eckstein 2003, p. 228. Brass. http://en.wikipedia.org/?curid=3292."
  }
}
