{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9248",
  "eid" : "ed44acb0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778477819,
  "textBody" : "Esperanto ( or;  ) is a constructed international auxiliary language. With an estimated two million speakers worldwide, it is the most widely spoken constructed language in the world. The Polish-Jewish ophthalmologist L. L. Zamenhof published the first book detailing Esperanto, , in Warsaw on . The name of Esperanto derives from ' (' translates as \"one who hopes\"), the pseudonym under which Zamenhof published Unua Libro.\n\nOverview\n\nZamenhof had three goals, as he wrote in Unua Libro:\n# \"To render the study of the language so easy as to make its acquisition mere play to the learner.\"\"After half an hour I could speak more Esperanto than Japanese, I had studied during four years in secondary school\" – Richard Delamore. In: \"Kiel la esperantistoj povas denove avangardi?\", Kontakto 277 (2017:1), p. 20, TEJO\n# \"To enable the learner to make direct use of his knowledge with persons of any nationality, whether the language be universally accepted or not; in other words, the language is to be directly a means of international communication.\"\n# \"To find some means of overcoming the natural indifference of mankind, and disposing them, in the quickest manner possible, and en masse, to learn and use the proposed language as a living one, and not only in last extremities, and with the key at hand.\"L.L.Zamenhof. [http://www.genekeyes.com/Dr_Esperanto.html International Language]. Warsaw. 1887\n\nAccording to the database Ethnologue (published by the Summer Institute of Linguistics), up to two million people worldwide, to varying degrees, speak Esperanto, including about 1000 to 2000 native speakers who learned Esperanto from birth. The Universal Esperanto Association has more than 5500 members in 120 countries. Its usage is highest in Europe, East Asia, and South America.. ' is one of the most popular online learning platforms for Esperanto and reported 150,000 registered users in 2013, and sees between 150,000 and 200,000 visitors each month. With about  articles, Esperanto Wikipedia is the 32nd-largest Wikipedia as measured by the number of articles, and is the largest Wikipedia in a constructed language. On 22 February 2012, Google Translate added Esperanto as its 64th language. On 28 May 2015, the language learning platform Duolingo launched an Esperanto course for English speakers. On 26 October 2016, the course for Spanish speakers appeared on the same platform. , over one million users have started to learn Esperanto on Duolingo.\n\nThe first World Congress of Esperanto was organized in Boulogne-sur-Mer (France) in 1905. Since then, congresses have been held in various countries every year, with the exceptions of years during the World Wars. Although no country has adopted Esperanto officially, Esperantujo is the collective name given to places where it is spoken.\n\nEsperanto was recommended by the French Academy of Sciences in 1921 and recognized by UNESCO in 1954, which recommended in 1985 that international non-governmental organizations use Esperanto.\n\nEsperanto PEN Centro is the official branch of Esperanto writers in PEN International.\n\nEsperanto is currently the language of instruction of the International Academy of Sciences in San Marino.\n\nHistory \n\nCreation \n\nEsperanto was created in the late 1870s and early 1880s by L. L. Zamenhof, a Polish-Jewish ophthalmologist from Białystok, then part of the Russian Empire, but now part of Poland. According to Zamenhof, he created the language to reduce the \"time and labour we spend in learning foreign tongues\" and to foster harmony between people from different countries: \"Were there but an international language, all translations would be made into it alone ... and all nations would be united in a common brotherhood.\" His feelings and the situation in Białystok may be gleaned from an extract from his letter to Nikolai Borovko:The letter is quoted in [http://www.u-matthias.de/latino/latin_en.htm Esperanto: The New Latin for the Church and for Ecumenism], by Ulrich Matthias. Translation from Esperanto by Mike Leon and Maire Mullarney\n\nAbout his goals Zamenhof wrote that he wants mankind to \"learn and use\", \"en masse\", \"the proposed language as a living one\". The goal for Esperanto to become a general world language was not the only goal of Zamenhof; he also wanted to \"enable the learner to make direct use of his knowledge with persons of any nationality, whether the language be universally accepted or not; in other words, the language is to be directly a means of international communication.\"\n\nAfter some ten years of development, which Zamenhof spent translating literature into Esperanto as well as writing original prose and verse, the first book of Esperanto grammar was published in Warsaw on 26 July 1887. The number of speakers grew rapidly over the next few decades, at first primarily in the Russian Empire and Central Europe, then in other parts of Europe, the Americas, China, and Japan. In the early years, speakers of Esperanto kept in contact primarily through correspondence and periodicals, but in 1905 the first world congress of Esperanto speakers was held in Boulogne-sur-Mer, France. Since then world congresses have been held in different countries every year, except during the two World Wars. Since the Second World War, they have been attended by an average of more than 2000 people and up to 6000 people.\n\nZamenhof's name for the language was simply ' (\"International Language\"). Facsimile of the title page of the First Book in English, 1889. \n\nLater history \n\nThe autonomous territory of Neutral Moresnet, between what is today Belgium and Germany, had a sizable proportion of Esperanto-speakers among its small and multiethnic population. There was a proposal to make Esperanto its official language.\n\nHowever, neither Belgium nor Prussia (now within Germany) had ever surrendered its original claim to it. Around 1900, Germany in particular was taking a more aggressive stance towards the territory and was accused of sabotage and of obstructing the administrative process in order to force the issue. It was the First World War, however, that was the catalyst that brought about the end of neutrality. On 4 August 1914, Germany invaded Belgium, leaving Moresnet at first \"an oasis in a desert of destruction\".Musgrave, George Clarke. Under Four Flags for France, 1918, p. 8 In 1915, the territory was annexed by the Kingdom of Prussia, without international recognition.\n\nAfter the Great War, there was a proposal for the League of Nations to accept Esperanto as their working language, following a report by Nitobe Inazō, an official delegate of League of Nations during the 13th World Congress of Esperanto in Prague. Ten delegates accepted the proposal with only one voice against, the French delegate, Gabriel Hanotaux. Hanotaux did not like how the French language was losing its position as the international language and saw Esperanto as a threat, effectively wielding his veto power to block the decision. However, two years later, the League recommended that its member states include Esperanto in their educational curricula. For this reason, many people see the 1920s as the heyday of the Esperanto movement. Anarchism as a political movement was very supportive during this time of anationalism as well as of the Esperanto language.[http://www.nodo50.org/esperanto/anarkiismo.htm \"ESPERANTO KAJ ANARKIISMO\" by Will Firth]\n\nEsperanto attracted the suspicion of many states. The situation was especially pronounced in Nazi Germany, Francoist Spain up until the 1950s, and in the Soviet Union from 1937 to 1956.\n\nIn Nazi Germany, there was a motivation to forbid Esperanto because Zamenhof was Jewish, and due to the internationalist nature of Esperanto, which was perceived as \"Bolshevist\". In his work, Mein Kampf, Adolf Hitler specifically mentioned Esperanto as an example of a language that could be used by an international Jewish conspiracy once they achieved world domination. Esperantists were killed during the Holocaust, with Zamenhof's family in particular singled out for being killed. The efforts of a minority of Esperantists to expel Jewish colleagues and align themselves with the Reich were futile and Esperanto was legally forbidden in 1935. Esperantists in German concentration camps taught the language to fellow prisoners, telling guards they were teaching Italian, the language of one of Germany's Axis allies.\n\nIn Imperial Japan, the left-wing of the Japanese Esperanto movement was forbidden, but its leaders were careful enough not to give the impression to the government that the Esperantists were socialist revolutionaries, which proved a successful strategy.\n\nAfter the October Revolution of 1917, Esperanto was given a measure of government support by the new workers' states in the former Russian Empire and later by the Soviet Union government, with the Soviet Esperanto Association being established as an officially recognized organization. In his biography on Joseph Stalin, Leon Trotsky mentions that Stalin had studied Esperanto. However, in 1937, at the height of the Great Purge, Stalin completely reversed the Soviet government's policies on Esperanto; many Esperanto speakers were executed, exiled or held in captivity in the Gulag labour camps. Quite often the accusation was: \"You are an active member of an international spy organisation which hides itself under the name of 'Association of Soviet Esperantists' on the territory of the Soviet Union.\" Until the end of the Stalin era it was dangerous to use Esperanto in the Soviet Union despite the fact that it was never officially forbidden to speak Esperanto.Ulrich Lins: Die gefährliche Sprache. Die Verfolgung der Esperantisten unter Hitler und Stalin. Bleicher: Gerlingen, 1988, p. 220 and elsewhere. \n\nFascist Italy allowed the use of Esperanto, finding its phonology similar to that of Italian and publishing some tourist material in the language.\n\nDuring and after the Spanish Civil War, Francoist Spain forbade anarchists, socialists and Catalan nationalists for many years, among whom the use of Esperanto was extensive, but in the 1950s the Esperanto movement was tolerated again.\n\nOfficial use \n\nEsperanto has not been a secondary official language of any recognized country, but it entered the education system of several countries such as HungaryMichael Byram and Adelheid Hu: Routledge Encyclopedia of Language Teaching and Learning. 2nd edition. Taylor and Francis, Hoboken 2013, , page 229. and China.\n\nThere were plans at the beginning of the 20th century to establish Neutral Moresnet as the world's first Esperanto state. In addition, the self-proclaimed artificial island micronation of Rose Island used Esperanto as its official language in 1968, and another micronation, the extant Republic of Molossia, uses Esperanto as an official language alongside English.\n\nThe Chinese government has used Esperanto since 2001 for daily news on china.org.cn. China also uses Esperanto in China Radio International and for the internet magazine El Popola Ĉinio.\n\nThe Vatican Radio has an Esperanto version of its website.h\n\nThe US Army has published military phrase books in Esperanto, to be used from the 1950s until the 1970s in war games by mock enemy forces.\n\nEsperanto is the working language of several non-profit international organizations such as the ', a left-wing cultural association which has  members in over 85 countries. There is also Education@Internet, which has developed from an Esperanto organization; most others are specifically Esperanto organizations. The largest of these, the Universal Esperanto Association, has an official consultative relationship with the United Nations and UNESCO, which recognized Esperanto as a medium for international understanding in 1954. [http://unesdoc.unesco.org/images/0016/001607/160782eb.pdf Report on the international petition in favour of Esperanto], Unesco, 1st June 1954. The World Esperanto Association has collaborated in 2017 with Unesco to deliver an [http://uea.org/pdf/Unesko-Kuriero_1-2017.pdf Esperanto translation] its magazine Unesco Courier (Unesko Kuriero en Esperanto).\n\nEsperanto is also the first language of teaching and administration of one university, the International Academy of Sciences San Marino.\n\nIn the summer of 1924, the American Radio Relay League adopted Esperanto as its official international auxiliary language, and hoped that the language would be used by radio amateurs in international communications, but its actual use for radio communications was negligible.\n\nAll the personal documents issued by the World Service Authority, including the World Passport, are written in Esperanto, together with English, French, Spanish, Russian, Arabic, and Chinese.\n\nAchievement of its creator's goals\n\nZamenhof's goal to \"enable the learner to make direct use of his knowledge with persons of any nationality, whether the language be universally accepted or not\", as he wrote in 1887, has been achieved as the language is currently spoken by people living in more than one hundred countries.\n\nOn the other hand, one common criticism made is that Esperanto has failed to live up to the hopes of its creator, who dreamed of it becoming a universal second language.Saul Levin, 1993. \"Can an Artificial Language Be More than a Hobby? The Linguistic and Sociological Obstacles\". In Ian Richmond (ed.) Aspects of internationalism: language & culture.The Christian Century, 1930, 47:846 In this regard it has to be noted that Zamenhof was well aware that it may take much time, maybe even many centuries, to get this hope into reality. In his speech at the World Esperanto Congress in Cambridge in 1907 he said, \"we hope that earlier or later, maybe after many centuries, on a neutral language foundation, understanding one each other, the nations will build ... a big family circle.\"\"(...) [http://www.steloj.de/esperanto/paroloj/kongr3a.html ni esperas, ke pli aŭ malpli frue, eble post multaj jarcentoj],\nSur neŭtrala lingva fundamento,\nKomprenante unu la alian,\nLa popoloj faros en konsento\nUnu grandan rondon familian.\" L. L. Zamenhof. Kongresaj paroladoj. Jekaterinburg (Ruslanda Esperantisto). 1995, p. 23–24\n\nLinguistic properties \n\nAlphabet \n\nThe Esperanto alphabet is based on the Latin script, using a one-sound-one-letter principle, except for [d͡z]. It includes six letters with diacritics: ĉ, ĝ, ĥ, ĵ, ŝ (with circumflex), and ŭ (with breve). The alphabet does not include the letters q, w, x, or y, which are only used when writing unassimilated foreign terms or proper names.\n\nThe 28-letter alphabet is:\n\nAll unaccented letters are pronounced approximately as in the IPA, with the exception of c. Esperanto j and c are used in a way familiar to speakers of many European languages, but which is largely unfamiliar to English speakers: j has a y sound [j~i̯], as in yellow and boy, and c has a ts sound [t͡s], as in hits or the zz in pizza.These letters occasionally have these values in English as well, for example the j in hallelujah, Jarlsberg, or Jägermeister, and the c in the name of composer Penderecki, Czech president Václav Havel, or the mineral letovicite. The accented letters are a bit like h-digraphs in English: Ĉ is pronounced like English ch, and ŝ like sh. Ĝ is the g in gem, ĵ a zh sound, as in fusion or French Jacques, and the rare ĥ is like the German , Scottish Gaelic, Scots and Scottish Standard English loch, or how Scouse people sometimes pronounce the 'k' in book and 'ck' in chicken.\n\nWriting diacritics \n\nEven with the widespread adoption of Unicode, the letters with diacritics (found in the \"Latin-Extended A\" section of the Unicode Standard) can cause problems with printing and computing, because they are not found on most physical keyboards and are left out of certain fonts.\n\nThere are two principal workarounds to this problem, which substitute digraphs for the accented letters. Zamenhof, the inventor of Esperanto, created an \"h-convention\", which replaces ĉ, ĝ, ĥ, ĵ, ŝ, and ŭ with ch, gh, hh, jh, sh, and u, respectively. If used in a database, a program in principle could not determine whether to render, for example, ch as c followed by h or as ĉ, and would fail to render, for example, the word ' properly. A more recent \"x-convention\" has gained ground since the advent of computing. This system replaces each diacritic with an x (not part of the Esperanto alphabet) after the letter, producing the six digraphs cx, gx, hx, jx, sx, and ux.\n\nThere are computer keyboard layouts that support the Esperanto alphabet, and some systems use software that automatically replaces x- or h-convention digraphs with the corresponding diacritic letters (for example, Amiketo and Tajpi are keyboard layouts which support the Esperanto alphabet for [http://www012.upp.so-net.ne.jp/klivo/amiketo/ Windows], [http://www012.upp.so-net.ne.jp/klivo/amiketo/makamiketo.html Mac OS X], and [http://www012.upp.so-net.ne.jp/klivo/amiketo/linamiketo.html Linux] for Microsoft Windows, Mac OS X, and Linux,  for Windows Phone, and Gboard and AnySoftKeyboard for Android).\n\nCriticisms are made of the letters with circumflex diacritics, which some find odd or cumbersome, along with their being invented specifically for Esperanto rather than borrowed from existing languages; as well as being arguably unnecessary, as for example with the use of ĥ instead of x and ŭ instead of w.\n\nClassification \n\nThe phonology, grammar, vocabulary, and semantics are based on the Indo-European languages spoken in Europe. The sound inventory is essentially Slavic, as is much of the semantics, whereas the vocabulary derives primarily from the Romance languages, with a lesser contribution from Germanic languages and minor contributions from Slavic languages and Greek. Pragmatics and other aspects of the language not specified by Zamenhof's original documents were influenced by the native languages of early authors, primarily Russian, Polish, German, and French. Paul Wexler proposes that Esperanto is relexified Yiddish, which he claims is in turn a relexified Slavic language,\n though this model is not accepted by mainstream academics.Bernard Spolsky,[https://books.google.com/books?id\n5Xk9AwAAQBAJ&pg=PA157 The Languages of the Jews: A Sociolinguistic History,] Cambridge University Press, 2014 pp.157,180ff. p.183\n\nEsperanto has been described as \"a language lexically predominantly Romanic, morphologically intensively agglutinative, and to a certain degree isolating in character\". Typologically, Esperanto has prepositions and a pragmatic word order that by default is subject–verb–object. Adjectives can be freely placed before or after the nouns they modify, though placing them before the noun is more common. New words are formed through extensive prefixing and suffixing.\n\nGrammar \n\nEsperanto words are mostly derived by stringing together roots, grammatical endings, and at times prefixes and suffixes. This process is regular, so that people can create new words as they speak and be understood. Compound words are formed with a modifier-first, head-final order, as in English (compare \"birdsong\" and \"songbird,\" and likewise, ' and '). Speakers may optionally insert an o between the words in a compound noun if placing them together directly without the o would make the resulting word hard to say or understand.\n\nThe different parts of speech are marked by their own suffixes: all common nouns end in ', all adjectives in ', all derived adverbs in ', and all verbs in one of six tense and mood suffixes, such as the present tense '. Nouns and adjectives have two cases: nominative for grammatical subjects and in general, and accusative for direct objects and (after a preposition) to indicate direction of movement.\n\nSingular nouns used as grammatical subjects end in ', plural subject nouns in ' (pronounced [oi̯] like English \"oy\"). Singular direct object forms end in ', and plural direct objects with the combination ' ([oi̯n]; rhymes with \"coin\"): ' indicates that the word is a noun, ' indicates the plural, and ' indicates the accusative (direct object) case. Adjectives agree with their nouns; their endings are singular subject ' ([a]; rhymes with \"ha!\"), plural subject ' ([ai̯], pronounced \"eye\"), singular object ', and plural object ' ([ai̯n]; rhymes with \"fine\").\n\nThe suffix ', besides indicating the direct object, is used to indicate movement and a few other things as well.\n\nThe six verb inflections consist of three tenses and three moods. They are present tense ', future tense ', past tense ', infinitive mood ', conditional mood ' and jussive mood ' (used for wishes and commands). Verbs are not marked for person or number. Thus, ' means \"to sing\", ' means \"I sing\", ' means \"you sing\", and ' means \"they sing\".\n\nWord order is comparatively free. Adjectives may precede or follow nouns; subjects, verbs and objects may occur in any order. However, the article ' \"the\", demonstratives such as ' \"that\" and prepositions (such as ' \"at\") must come before their related nouns. Similarly, the negative ' \"not\" and conjunctions such as ' \"and\" and ' \"that\" must precede the phrase or clause that they introduce. In copular (A = B) clauses, word order is just as important as in English: \"people are animals\" is distinguished from \"animals are people\".\n\nLiving language \n\nThe Hungarian Academy of Sciences has found that Esperanto fulfills all the requirements of a living language. \n\nNeutrality\n\nOrigin\n\nThe vocabulary, orthography, phonology, and semantics, are all thoroughly European. The vocabulary, for example, draws about two-thirds from Romance and one-third from Germanic languages; the syntax is Romance; and the phonology and semantics are Slavic. The grammar is arguably more European than not, but Claude Piron among others argues that the derivation system is not particularly European, though the inflection is.Le Defi des Langues by Claude Piron. Harmattan, 1994.\n\nGender\n\nEsperanto is frequently accused of being inherently sexist, because the default form of some nouns is masculine while a derived form is used for the feminine, which is said to retain traces of the male-dominated society of late 19th-century Europe of which Esperanto is a product.[http://bertilow.com/pmeg/gramatiko/o-vortoj/seksa_signifo.html Bertilo] (in Esperanto)[http://parracomumangi.altervista.org/Domande.htm] (in Italian) Some masculine nouns, primarily titles and kin terms, such as sinjoro \"Mr, sir\" vs. sinjorino \"Ms, lady\" and patro \"father\" vs. patrino \"mother\". In addition, nouns that denote persons and whose definitions are not explicitly male are often assumed to be male unless explicitly made female, such as doktoro, a PhD doctor (male or unspecified) versus doktorino, a female PhD. This is analogous to the situation with the English suffix -ess, as in baron/baroness, waiter/waitress etc. Esperanto pronouns are similar. As in English, li \"he\" may be used generically, whereas ŝi \"she\" is always female.Kalocsay & Waringhien, Plena analiza gramatiko (1985:73)\n\nPhonology \n\nEsperanto has 23 consonants, five vowels, and two semivowels that combine with the vowels to form six diphthongs. (The consonant and semivowel are both written j, and the uncommon consonant is written with the digraph dz,Kalocsay & Waringhien (1985) ', § 17, 22 which is the only consonant that doesn't have its own letter.) Tone is not used to distinguish meanings of words. Stress is always on the second-last vowel in fully Esperanto words unless a final vowel ' is elided, which occurs mostly in poetry. For example, ' \"family\" is, with the stress on the second i, but when the word is used without the final  (), the stress remains on the second ':.\n\nConsonants \n\nThe 23 consonants are:\n\nThe sound is usually an alveolar trill, but can also be a velar trill, a velar fricative, and an alveolar approximant. Many other forms such an alveolar tap are done and accepted in practice. The is normally pronounced like English v, but may be pronounced (between English v and w) or, depending on the language background of the speaker. A semivowel normally occurs only in diphthongs after the vowels and, not as a consonant. Common, if debated, assimilation includes the pronunciation of ' as and ' as.\n\nA large number of consonant clusters can occur, up to three in initial position (as in ', \"strange\") and four in medial position (as in ', \"teach\"). Final clusters are uncommon except in foreign names, poetic elision of final , and a very few basic words such as ' \"hundred\" and ' \"after\".\n\nVowels \n\nEsperanto has the five vowels found in such languages as  Spanish, Swahili, Modern Hebrew, and Modern Greek.\n\nThere are also two semivowels, and, which combine with the monophthongs to form six falling diphthongs: , , , , , and '.\n\nSince there are only five vowels, a good deal of variation in pronunciation is tolerated. For instance, e commonly ranges from (French ') to (French '). These details often depend on the speaker's native language. A glottal stop may occur between adjacent vowels in some people's speech, especially when the two vowels are the same, as in ' \"hero\" ( or) and ' \"great-grandfather\" ( or).\n\nSample text \n\nThe following short extract gives an idea of the character of Esperanto.Maire Mullarney Everyone's Own Language, p147, Nitobe Press, Channel Islands, 1999 (Pronunciation is covered above; the Esperanto letter j is pronounced like English y.)\n* Esperanto:\n«»\n* English translation:\nIn many places in China, there were temples of the dragon-king. During times of drought, people would pray in the temples that the dragon-king would give rain to the human world. At that time the dragon was a symbol of the supernatural creature. Later on, it became the ancestor of the highest rulers and symbolised the absolute authority of a feudal emperor. The emperor claimed to be the son of the dragon. All of his personal possessions carried the name \"dragon\" and were decorated with various dragon figures. Now dragon decorations can be seen everywhere in China and legends about dragons circulate.\n\nSimple phrases \n\nBelow are listed some useful Esperanto words and phrases along with IPA transcriptions:\n\nVocabulary \n\nThe core vocabulary of Esperanto was defined by ', published by Zamenhof in 1887. This book listed 900 roots; these could be expanded into tens of thousands of words using prefixes, suffixes, and compounding. In 1894, Zamenhof published the first Esperanto dictionary, ', which had a larger set of roots. The rules of the language allowed speakers to borrow new roots as needed; it was recommended, however, that speakers use most international forms and then derive related meanings from these.\n\nSince then, many words have been borrowed, primarily (but not solely) from the European languages. Not all proposed borrowings become widespread, but many do, especially technical and scientific terms. Terms for everyday use, on the other hand, are more likely to be derived from existing roots; ' \"computer\", for instance, is formed from the verb ' \"compute\" and the suffix ' \"tool\". Words are also calqued; that is, words acquire new meanings based on usage in other languages. For example, the word ' \"mouse\" has acquired the meaning of a computer mouse from its usage in English. Esperanto speakers often debate about whether a particular borrowing is justified or whether meaning can be expressed by deriving from or extending the meaning of existing words.\n\nSome compounds and formed words in Esperanto are not entirely straightforward; for example, ', literally \"give out\", means \"publish\", paralleling the usage of certain European languages (such as German). In addition, the suffix -um- has no defined meaning; words using the suffix must be learned separately (such as ' \"to the right\" and ' \"clockwise\").\n\nThere are not many idiomatic or slang words in Esperanto, as these forms of speech tend to make international communication difficult—working against Esperanto's main goal.\n\nInstead of derivations of Esperanto roots, new roots are taken from European languages in the endeavor to create an international language.', Claude Piron. Vienna: , 1989. ' \"The language wants to be elegant, not elephantine.\"\n\nEducation \n\nEsperanto speakers learn the language through self-directed study, online tutorials, and correspondence courses taught by volunteers. More recently, free teaching websites, like ' and ', are available.\n\nEsperanto instruction is rarely available at schools, including four primary schools in a pilot project under the supervision of the University of Manchester, and by one count at a few universities. However, outside China and Hungary, these mostly involve informal arrangements rather than dedicated departments or state sponsorship. Eötvös Loránd University in Budapest had a department of Interlinguistics and Esperanto from 1966 to 2004, after which time instruction moved to vocational colleges; there are state examinations for Esperanto instructors. Additionally, Adam Mickiewicz University in Poland offers a diploma in Interlinguistics. The Senate of Brazil passed a bill in 2009 that would make Esperanto an optional part of the curriculum in public schools, although mandatory if there is demand for it.  the bill is still under consideration by the Chamber of Deputies.\n\nVarious educators have estimated that Esperanto can be learned in anywhere from one quarter to one twentieth the amount of time required for other languages. Claude Piron, an Esperanto-Activist and Chinese–English–Russian–Spanish translator for the United Nations, argued that Esperanto is far more intuitive than many ethnic languages: \"Esperanto relies entirely on innate reflexes [and] differs from all other languages in that you can always trust your natural tendency to generalize patterns.... The same neuropsychological law [—called by] Jean Piaget generalizing assimilation—applies to word formation as well as to grammar.\"Piron, Claude: [http://www.claude-piron.ch/hidden-perverse-effects.html \"The hidden perverse effect of the current system of international communication\"], published lecture notes\n\nThe Institute of Cybernetic Pedagogy at Paderborn (Germany) has compared the length of study time it takes natively French-speaking high-school students to obtain comparable 'standard' levels in Esperanto, English, German, and Italian.Flochon, Bruno, 2000, «  », in Gauthier, Guy (ed.) ' 4e trim. 48: 89–95. Cited in François Grin,  (French) The results were:\n* 2,000 hours studying German \n* 1,500 hours studying English \n* 1,000 hours studying Italian (or any other Romance language) \n* 150 hours studying Esperanto.\n\nThird-language acquisition \n\nFour primary schools in Britain, with 230 pupils, are currently following a course in \"propaedeutic Esperanto\"—that is, instruction in Esperanto to raise language awareness and accelerate subsequent learning of foreign languages—under the supervision of the University of Manchester. As they put it,\nMany schools used to teach children the recorder, not to produce a nation of recorder players, but as a preparation for learning other instruments. [We teach] Esperanto, not to produce a nation of Esperanto-speakers, but as a preparation for learning other languages.\nStudies have been conducted in New Zealand,Report: Article in ', volume I, p.436, on the pedagogic value of Esperanto. United States,Report: Christian Rudmick, The Wellesley College Danish-Esperanto experiment.Report: Edward Thorndike, Language Learning. Bureau of Publications of Teachers College, 1933. [http://www.interlingua.org/ Interlingua.org]Helen S. Eaton, \"The Educational Value of an Artificial Language.\" The Modern Language Journal, #12, pp. 87–94 (1927). [http://www.blackwellpublishing.com/mlj/newsearchres.asp?contenttypeAA&topic\nArtificial%20Language&searchtypeadv Blackwellpublishing.com] Germany,Protocols of the annual November meetings in Paderborn \"\" (Working conference: Interlinguistics in Science and Education), which can be obtained from the Institute of Pedagogic Cybernetics in Paderborn. Also in the works by Frank, Lobin, Geisler, and Meder. Italy and Australia. The results of these studies were favorable and demonstrated that studying Esperanto before another foreign language expedites the acquisition of the other, natural language. This appears to be because learning subsequent foreign languages is easier than learning one's first foreign language, whereas the use of a grammatically simple and culturally flexible auxiliary language like Esperanto lessens the first-language learning hurdle. In one study,Williams, N. (1965) 'A language teaching experiment', Canadian Modern Language Review 22.1: 26–28 a group of European secondary school students studied Esperanto for one year, then French for three years, and ended up with a significantly better command of French than a control group, who studied French for all four years.\n\nCommunity \n\nGeography and demography \n\nEsperanto is by far the most widely spoken constructed language in the world. Speakers are most numerous in Europe and East Asia, especially in urban areas, where they often form Esperanto clubs.Sikosek, Ziko M. ' (\"Esperanto without Myths\"). Second edition. Antwerp: Flandra Esperanto-Ligo, 2003. Esperanto is particularly prevalent in the northern and central countries of Europe; in China, Korea, Japan, and Iran within Asia; in Brazil, Argentina, and Mexico in the Americas; and in Togo in Africa.\n\nCountering a common criticism against Esperanto, the statistician Svend Nielsen has found there to be no significant correlation between the number of Esperanto speakers and similarity of a given national mother language to Esperanto. He concludes that Esperanto tends to be more popular in countries that are rich, with widespread Internet access and that tend to contribute more to science and culture. Linguistic diversity within a country was found to have a slight inverse correlation with Esperanto popularity.\n\nNumber of speakers \n\nAn estimate of the number of Esperanto speakers was made by Sidney S. Culbert, a retired psychology professor at the University of Washington and a longtime Esperantist, who tracked down and tested Esperanto speakers in sample areas in dozens of countries over a period of twenty years. Culbert concluded that between one and two million people speak Esperanto at Foreign Service Level 3, \"professionally proficient\" (able to communicate moderately complex ideas without hesitation, and to follow speeches, radio broadcasts, etc.).Culbert, Sidney S. [http://www.panix.com/~dwolff/docs/ Three letters about his method for estimating the number of Esperanto speakers], scanned and HTMLized by David Wolff Culbert's estimate was not made for Esperanto alone, but formed part of his listing of estimates for all languages of more than one million speakers, published annually in the World Almanac and Book of Facts. Culbert's most detailed account of his methodology is found in a 1989 letter to David Wolff. Since Culbert never published detailed intermediate results for particular countries and regions, it is difficult to independently gauge the accuracy of his results.\n\nIn the Almanac, his estimates for numbers of language speakers were rounded to the nearest million, thus the number for Esperanto speakers is shown as two million. This latter figure appears in Ethnologue. Assuming that this figure is accurate, that means that about 0.03% of the world's population speak the language. Although it is not Zamenhof's goal of a universal language, it still represents a level of popularity unmatched by any other constructed language.\n\nMarcus Sikosek (now Ziko van Dijk) has challenged this figure of 1.6 million as exaggerated. He estimated that even if Esperanto speakers were evenly distributed, assuming one million Esperanto speakers worldwide would lead one to expect about 180 in the city of Cologne. Van Dijk finds only 30 fluent speakers in that city, and similarly smaller-than-expected figures in several other places thought to have a larger-than-average concentration of Esperanto speakers. He also notes that there are a total of about 20,000 members of the various Esperanto organizations (other estimates are higher). Though there are undoubtedly many Esperanto speakers who are not members of any Esperanto organization, he thinks it unlikely that there are fifty times more speakers than organization members.\n\nFinnish linguist Jouko Lindstedt, an expert on native-born Esperanto speakers, presented the following schemeLindstedt, Jouko. \"Re: \" (posting). [http://www.helsinki.fi/~jslindst/denask-l.html DENASK-L@helsinki.fi], 22 April 1996. to show the overall proportions of language capabilities within the Esperanto community:\n* 1,000 have Esperanto as their native language.\n* 10,000 speak it fluently.\n* 100,000 can use it actively.\n* One million understand a large amount passively.\n* Ten million have studied it to some extent at some time.\n\nIn 2017, doctoral student Svend Nielsen has estimated around 63.000 Esperanto speakers worldwide, taking into account association memberships, user-generated data from Esperanto websites and census statistics. This number, however, was disputed by statistician Sten Johansson, who questioned the reliability of the source data and highlighted a wide margin of error, the latter point with which Nielsen agrees. Both have stated, however, that this new number is likely more realistic than some earlier projections.\n\nIn the absence of Dr. Culbert's detailed sampling data, or any other census data, it is impossible to state the number of speakers with certainty. According to the website of the World Esperanto Association:\nNumbers of textbooks sold and membership of local societies put \"the number of people with some knowledge of the language in the hundreds of thousands and possibly millions\".\n\nNative speakers \n\nNative Esperanto speakers, , have learned the language from birth from Esperanto-speaking parents. This usually happens when Esperanto is the chief or only common language in an international family, but sometimes occurs in a family of devoted Esperantists. The 15th edition of Ethnologue cited estimates that there were 200 to 2000 native speakers in 1996, but these figures were removed from the 16th and 17th editions.\nAs of 1996, there were approximately 350 attested cases of families with native Esperanto speakers.Corsetti, Renato (1996). A mother tongue spoken mainly by fathers. Language Problems and Language Planning 20: 3, 263–73\n\nCulture \n\nEsperantists can access an international culture, including a large body of original as well as translated literature. There are more than 25,000 Esperanto books, both originals and translations, as well as several regularly distributed Esperanto magazines. In 2013 a museum about Esperanto opened in China. Esperantists use the language for free accommodations with Esperantists in 92 countries using the  or to develop pen pals through '.\n\nEvery year, Esperantists meet for the World Congress of Esperanto ().Ziko van Dijk. '. Rotterdam: UEA, 2005.\n\nHistorically, much Esperanto music, such as ', has been in various folk traditions. There is also a variety of classical and semi-classical choral music, both original and translated, as well as large ensemble music that includes voices singing Esperanto texts. Lou Harrison, who incorporated styles and instruments from many world cultures in his music, used Esperanto titles and/or texts in several of his works, most notably ' (1973). David Gaines used Esperanto poems as well as an excerpt from a speech by Dr. Zamenhof for his Symphony No. One (Esperanto) for mezzo-soprano and orchestra (1994–98). He wrote original Esperanto text for his ' (I Can Cry No Longer) for unaccompanied SATB choir (1994).\n\nThere are also shared traditions, such as Zamenhof Day, and shared behaviour patterns. Esperantists speak primarily in Esperanto at international Esperanto meetings.\n\nDetractors of Esperanto occasionally criticize it as \"having no culture\". Proponents, such as Prof. Humphrey Tonkin of the University of Hartford, observe that Esperanto is \"culturally neutral by design, as it was intended to be a facilitator between cultures, not to be the carrier of any one national culture\". The late Scottish Esperanto author William Auld wrote extensively on the subject, arguing that Esperanto is \"the expression of a common human culture, unencumbered by national frontiers. Thus it is considered a culture on its own.\"Auld, William. ' (\"The Esperanto Phenomenon\"). Rotterdam: , 1988.\n\nNoted authors in Esperanto \n\nSome authors of works in Esperanto are:\n\nPopular culture \n\nEsperanto has been used in a number of films and novels. Typically, this is done either to add the exotic flavour of a foreign language without representing any particular ethnicity, or to avoid going to the trouble of inventing a new language. The Charlie Chaplin film The Great Dictator (1940) showed Jewish ghetto shop signs in Esperanto. Two full-length feature films have been produced with dialogue entirely in Esperanto: , in 1964, and Incubus, a 1965 B-movie horror film which is also notable for starring William Shatner shortly before he began working on Star Trek.\n\nA language school teaching \"Entrenationo\" (representing a satire on Esperanto) is featured in Graham Greene's novel The Confidential Agent, which was made into a film starring Charles Boyer and Lauren Bacall (1945). Other amateur productions have been made, such as a dramatization of the novel ' (Gerda Has Disappeared). In Stamboul Train, Greene used Esperanto as the language on signs at the main train station in Budapest. A number of mainstream films in national languages have used Esperanto in some way.\n\nEsperanto is used as the universal language in the far future of Harry Harrison's Stainless Steel Rat and Deathworld stories. Poul Anderson's story \"High Treason\" takes place in a future where Earth became united politically but was still divided into many languages and cultures, and Esperanto became the language of its space armed forces, fighting wars with various extraterrestrial races. Esperanto is said to be the official language of all the peoples of Phillip Jose Farmer's \"Riverworld\" series.\n\nThe opening song to the popular video game Final Fantasy XI, \"\", was written in Esperanto. It was the first game in the series that was played online, and would have players from both Japan and North America (official European support was added after the North American launch) playing together on the same servers, using an auto-translate tool to communicate. The composer, Nobuo Uematsu, felt that Esperanto was a good language to symbolize worldwide unity.\n\nIn the geek fiction novel \"Off to Be the Wizard\", Esperanto is programmed as the language that triggers all of the wizard's spells. Philip, Martin's teacher, explains that this is because \"no one really speaks Esperanto and it's easy to learn\".\n\nEsperanto is also found in the comic book series Saga as the language Blue, spoken by the inhabitants of Wreath. It is rendered in blue-colored text. Blue is generally only spoken by inhabitants of Wreath, while most other cultures use a universal language that appears to be simply named \"Language.\" Some Wreath inhabitants use translator rings to communicate with those who don't speak Blue. Magic seems to be activated via the linguistic medium of blue.\n\nIn the television show Red Dwarf, which begins in the late 22nd century, crewman Arnold Rimmer constantly spends his time trying to learn Esperanto and failing, even compared to his bunkmate Dave Lister who only maintains a casual interest. Additionally many of the signs around the ship Red Dwarf are written in both English and Esperanto. The novel Infinity Welcomes Careful Drivers states that, although not required, it is widely expected that officers in the Space Corps be fluent in the language, hence Rimmer's interest.\n\nScience \n\nIn 1921 the French Academy of Sciences recommended using Esperanto for international scientific communication. A few scientists and mathematicians, such as Maurice Fréchet (mathematics), John C. Wells (linguistics), Helmar Frank (pedagogy and cybernetics), and Nobel laureate Reinhard Selten (economics) have published part of their work in Esperanto. Frank and Selten were among the founders of the International Academy of Sciences in San Marino, sometimes called the \"Esperanto University\", where Esperanto is the primary language of teaching and administration.\n\nA message in Esperanto was recorded and included in Voyager 1s Golden Record.\n\nCommerce and trade \n\nEsperanto business groups have been active for many years. The French Chamber of Commerce did research in the 1920s and reported in The New York Times in 1921 that Esperanto seemed to be the best business language.\n\nGoals of the movement \n\nZamenhof had three goals, as he wrote already in 1887: to create an easy language, to create a language ready to use \"whether the language be universally accepted or not\" and to find some means to get many people learn the language. So Zamenhof's intention was not only to create an easy-to-learn language to foster international understanding as a general language, but also to create a language for immediate use by a (small) language community. Esperanto was to serve as an international auxiliary language, that is, as a universal second language, not to replace ethnic languages. This goal was widely shared among Esperanto speakers in the early decades of the movement. Later, Esperanto speakers began to see the language and the culture that had grown up around it as ends in themselves, even if Esperanto is never adopted by the United Nations or other international organizations.\n\nEsperanto speakers who want to see Esperanto adopted officially or on a large scale worldwide are commonly called ', from ', meaning \"final victory\". It has to be noted that there are two kinds of \"finvenkismo\"–\"desubismo\" and \"desuprismo\"; the first aims to spread Esperanto between ordinary people (\"desube\", from below) aiming to form a steadily growing community of Esperanto speakers. The second aims to act from above (\"desupre\"), beginning with politicians. Zamenhof considered the first way to have a better perspective, as \"for such affairs as ours, governments come with their approval and help usually only, when everything is already completely finished\".\"[http://www.steloj.de/esperanto/paroloj/kongr6a.html La celo, por kiu ni laboras, povas esti atingita per du vojoj]: aŭ per laborado de homoj privataj, t.e. de la popolaj amasoj, aŭ per dekreto de la registaroj. Plej kredeble nia afero estos atingita per la vojo unua, ĉar al tia afero, kiel nia, la registaroj venas kun sia sankcio kaj helpo ordinare nur tiam, kiam ĉio estas jam tute preta.\" L. L. Zamenhof. Speech in Washington. 1910\n\nThose who focus on the intrinsic value of the language are commonly called ', from Rauma, Finland, where a declaration on the short-term improbability of the \"\" and the value of Esperanto culture was made at the International Youth Congress in 1980. However the \"Manifesto de Raŭmo\" clearly mentions the intention to further spread the language: \"We want to spread Esperanto to put into effect its positive values more and more, step by step\".\"Ni celas disvastigi Esperanton por pli kaj pli, iom post iom realigi ĝiajn pozitivajn valorojn\". [http://www.esperantio.net/index.php?id\n10 Manifesto de Raŭmo]\n\nIn 1996 the Prague Manifesto was adopted at the annual congress of the World Esperanto Association (UEA); it was subscribed by individual participants and later by other Esperanto speakers.\n\nSymbols and flags \n\nThe earliest flag, and the one most commonly used today, features a green five-pointed star against a white canton, upon a field of green. It was proposed to Zamenhof by Irishman Richard Geoghegan, author of the first Esperanto textbook for English speakers, in 1887. The flag was approved in 1905 by delegates to the first conference of Esperantists at Boulogne-sur-Mer. A version with an \"\" superimposed over the green star is sometimes seen. Other variants include that for Christian Esperantists, with a white Christian cross superimposed upon the green star, and that for Leftists, with the color of the field changed from green to red.\n\nIn 1987, a second flag design was chosen in a contest organized by the UEA celebrating the first centennial of the language. It featured a white background with two stylised curved \"E\"s facing each other. Dubbed the \"\" (jubilee symbol), it attracted criticism from some Esperantists, who dubbed it the \"\" (melon) because of the design's elliptical shape. It is still in use, though to a lesser degree than the traditional symbol, known as the \"\" (green star).\n\nPolitics \n\nEsperanto has been placed in many proposed political situations. The most popular of these is the Europe–Democracy–Esperanto, which aims to establish Esperanto as the official language of the European Union. Grin's Report, published in 2005 by François Grin, found that the use of English as the lingua franca within the European Union costs billions annually and significantly benefits English-speaking countries financially. The report considered a scenario where Esperanto would be the lingua franca, and found that it would have many advantages, particularly economically speaking, as well as ideologically.\n\nRussian Esperanto writer Nikolai Nekrasov was arrested during the Stalinist repressions of the late 1930s, accused of being \"an organizer and leader of a fascist, espionage, terrorist organization of Esperantists\", and executed on 4 October 1938. Another Esperanto writer Vladimir Varankin was executed on 3 October 1938.\n\nReligion \n\nEsperanto has served an important role in several religions, such as Oomoto from Japan and the Bahá'í Faith from Iran, and has been encouraged by others, like some Spiritist movements.\n\nOomoto \n\nThe Oomoto religion encourages the use of Esperanto among its followers and includes Zamenhof as one of its deified spirits.\n\nBahá'í Faith \n\nThe Bahá'í Faith encourages the use of an auxiliary international language. The Baha'i's believe that it will not be the language of the future, although it has great potential in this role, as it has not been chosen by the people. `Abdu'l-Bahá praised the ideal of Esperanto, and there was an affinity between Esperantists and Bahá'ís during the late 19th century and early 20th century.\n\nOn February 12, 1913, `Abdu'l-Bahá gave a talk to the Paris Esperanto Society,\n\nNow, praise be to God that Dr. Zamenhof has invented the Esperanto language. It has all the potential qualities of becoming the international means of communication. All of us must be grateful and thankful to him for this noble effort; for in this way he has served his fellowmen well. With untiring effort and self-sacrifice on the part of its devotees Esperanto will become universal. Therefore every one of us must study this language and spread it as far as possible so that day by day it may receive a broader recognition, be accepted by all nations and governments of the world, and become a part of the curriculum in all the public schools. I hope that Esperanto will be adopted as the language of all the future international conferences and congresses, so that all people need acquire only two languages—one their own tongue and the other the international language. Then perfect union will be established between all the people of the world. Consider how difficult it is today to communicate with various nations. If one studies fifty languages one may yet travel through a country and not know the language. Therefore I hope that you will make the utmost effort, so that this language of Esperanto may be widely spread\n\nLidia Zamenhof, daughter of L. L. Zamenhof, became a Bahá'í around 1925. James Ferdinand Morton, Jr., an early member of the Bahá'í Faith in Greater Boston, was vice-president of the Esperanto League for North America. Ehsan Yarshater, the founding editor of Encyclopædia Iranica, notes how as a child in Iran he learned Esperanto and that when his mother was visiting Haifa on a Bahá'í pilgrimage he wrote her a letter in Persian as well as Esperanto. At the request of 'Abdu’l-Baha, Agnes Baldwin Alexander became an early advocate of Esperanto and used it to spread the Bahá’í teachings at meetings and conferences in Japan.\n\nToday there exists an active sub-community of Bahá'í Esperantists and various volumes of Bahá'í literature have been translated into Esperanto. In 1973, the Bahá'í Esperanto-League for active Bahá'í supporters of Esperanto was founded.\n\nSpiritism \n\nIn 1908, spiritist Camilo Chaigneau wrote an article named \"Spiritism and Esperanto\" in the periodic La Vie d'Outre-Tombe recommending the use of Esperanto in a \"central magazine\" for all spiritists and esperantists. Esperanto then became actively promoted by spiritists, at least in Brazil, initially by Ismael Gomes Braga and František Lorenz; the latter is known in Brazil as Francisco Valdomiro Lorenz, and was a pioneer of both spiritist and Esperantist movements in this country. [http://www.espirito.org.br/portal/artigos/geae/o-esp-e-o-esperanto.html O Espiritismo e o Esperanto (Spiritism and Esperanto)]\n\nThe Brazilian Spiritist Federation publishes Esperanto coursebooks, translations of Spiritism's basic books, and encourages Spiritists to become Esperantists.\n\nBible translations \n\nThe first translation of the Bible into Esperanto was a translation of the Tanakh or Old Testament done by L. L. Zamenhof. The translation was reviewed and compared with other languages' translations by a group of British clergy and scholars before its publication at the British and Foreign Bible Society in 1910. In 1926 this was published along with a New Testament translation, in an edition commonly called the \"\". In the 1960s, the ' tried to organize a new, ecumenical Esperanto Bible version. Since then, the Dutch Remonstrant pastor Gerrit Berveling has translated the Deuterocanonical or apocryphal books in addition to new translations of the Gospels, some of the New Testament epistles, and some books of the Tanakh or Old Testament. These have been published in various separate booklets, or serialized in ', but the Deuterocanonical books have appeared in recent editions of the Londona Biblio.\n\nChristianity \n\nChristian Esperanto organizations include two that were formed early in the history of Esperanto:\n* 1910—The International Union of Catholic Esperantists. Two Roman Catholic popes, John Paul II and Benedict XVI, have regularly used Esperanto in their multilingual ' blessings at Easter and Christmas each year since Easter 1994.\n* 1911—The International League of Christian Esperantists.\n\nIndividual churches using Esperanto include:\n* The Quaker [http://www.noos.ch/kes/index.php?pg2&lg\nen Esperanto Society], with activities as described in an issue of \"The Friend\"\n* 1910—First Christadelphian publications in Esperanto.Botten J. The Captive Conscience 2002 p.110 re. Esperanto speaking Christadelphians in Tsarist Russia.\n* There are instances of Christian apologists and teachers who use Esperanto as a medium. Nigerian pastor Bayo Afolaranmi's \"\" (spiritual food) Yahoo mailing list, for example, has hosted weekly messages since 2003.\nChick Publications, publisher of Protestant fundamentalist themed evangelistic tracts, has published a number of comic book style tracts by Jack T. Chick translated into Esperanto, including \"This Was Your Life!\" (\"\")\n\nMormons \n\nThe Book of Mormon has been partially translated into Esperanto, although the translation has not been officially endorsed by The Church of Jesus Christ of Latter-day Saints.\n\nIslam \n\nAyatollah Khomeini of Iran called on Muslims to learn Esperanto and praised its use as a medium for better understanding among peoples of different religious backgrounds. After he suggested that Esperanto replace English as an international lingua franca, it began to be used in the seminaries of Qom. An Esperanto translation of the Qur'an was published by the state shortly thereafter.\n\nModifications \n\nThough Esperanto itself has changed little since the publication of the ' (Foundation of Esperanto), a number of reform projects have been proposed over the years, starting with Zamenhof's proposals in 1894 and  in 1907. Several later constructed languages, such as Universal, were based on Esperanto.\n\nIn modern times, attempts have been made to eliminate perceived sexism in the language, such as Riism.\n\nEponymous entities \n\nThere are some geographical and astronomical features named after Esperanto, or after its creator L. L. Zamenhof. These include Esperanto Island in Zed Islands off Livingston Island, and the asteroids 1421 Esperanto and 1462 Zamenhof discovered by Finnish astronomer and Esperantist Yrjö Väisälä.\n\nCritics \n\nThe lack of dedicated government support for Esperanto means that replacing English as the global link language is rather limited. The spread of a language depends on economics, global politics, and a good support system backed with state support.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Esperanto" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9248" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Esperanto ( or;  ) is a constructed international auxiliary language. With an estimated two million speakers worldwide, it is the most widely spoken constructed language in the world. The Polish-Jewish ophthalmologist L. L. Zamenhof published the first book detailing Esperanto, , in Warsaw on . The name of Esperanto derives from ' (' translates as \"one who hopes\"), the pseudonym under which Zamenhof published Unua Libro.\n\nOverview\n\nZamenhof had three goals, as he wrote in Unua Libro:\n# \"To render the study of the language so easy as to make its acquisition mere play to the learner.\"\"After half an hour I could speak more Esperanto than Japanese, I had studied during four years in secondary school\" – Richard Delamore. In: \"Kiel la esperantistoj povas denove avangardi?\", Kontakto 277 (2017:1), p. 20, TEJO\n# \"To enable the learner to make direct use of his knowledge with persons of any nationality, whether the language be universally accepted or not; in other words, the language is to be directly a means of international communication.\"\n# \"To find some means of overcoming the natural indifference of mankind, and disposing them, in the quickest manner possible, and en masse, to learn and use the proposed language as a living one, and not only in last extremities, and with the key at hand.\"L.L.Zamenhof. [http://www.genekeyes.com/Dr_Esperanto.html International Language]. Warsaw. 1887\n\nAccording to the database Ethnologue (published by the Summer Institute of Linguistics), up to two million people worldwide, to varying degrees, speak Esperanto, including about 1000 to 2000 native speakers who learned Esperanto from birth. The Universal Esperanto Association has more than 5500 members in 120 countries. Its usage is highest in Europe, East Asia, and South America.. ' is one of the most popular online learning platforms for Esperanto and reported 150,000 registered users in 2013, and sees between 150,000 and 200,000 visitors each month. With about  articles, Esperanto Wikipedia is the 32nd-largest Wikipedia as measured by the number of articles, and is the largest Wikipedia in a constructed language. On 22 February 2012, Google Translate added Esperanto as its 64th language. On 28 May 2015, the language learning platform Duolingo launched an Esperanto course for English speakers. On 26 October 2016, the course for Spanish speakers appeared on the same platform. , over one million users have started to learn Esperanto on Duolingo.\n\nThe first World Congress of Esperanto was organized in Boulogne-sur-Mer (France) in 1905. Since then, congresses have been held in various countries every year, with the exceptions of years during the World Wars. Although no country has adopted Esperanto officially, Esperantujo is the collective name given to places where it is spoken.\n\nEsperanto was recommended by the French Academy of Sciences in 1921 and recognized by UNESCO in 1954, which recommended in 1985 that international non-governmental organizations use Esperanto.\n\nEsperanto PEN Centro is the official branch of Esperanto writers in PEN International.\n\nEsperanto is currently the language of instruction of the International Academy of Sciences in San Marino.\n\nHistory \n\nCreation \n\nEsperanto was created in the late 1870s and early 1880s by L. L. Zamenhof, a Polish-Jewish ophthalmologist from Białystok, then part of the Russian Empire, but now part of Poland. According to Zamenhof, he created the language to reduce the \"time and labour we spend in learning foreign tongues\" and to foster harmony between people from different countries: \"Were there but an international language, all translations would be made into it alone ... and all nations would be united in a common brotherhood.\" His feelings and the situation in Białystok may be gleaned from an extract from his letter to Nikolai Borovko:The letter is quoted in [http://www.u-matthias.de/latino/latin_en.htm Esperanto: The New Latin for the Church and for Ecumenism], by Ulrich Matthias. Translation from Esperanto by Mike Leon and Maire Mullarney\n\nAbout his goals Zamenhof wrote that he wants mankind to \"learn and use\", \"en masse\", \"the proposed language as a living one\". The goal for Esperanto to become a general world language was not the only goal of Zamenhof; he also wanted to \"enable the learner to make direct use of his knowledge with persons of any nationality, whether the language be universally accepted or not; in other words, the language is to be directly a means of international communication.\"\n\nAfter some ten years of development, which Zamenhof spent translating literature into Esperanto as well as writing original prose and verse, the first book of Esperanto grammar was published in Warsaw on 26 July 1887. The number of speakers grew rapidly over the next few decades, at first primarily in the Russian Empire and Central Europe, then in other parts of Europe, the Americas, China, and Japan. In the early years, speakers of Esperanto kept in contact primarily through correspondence and periodicals, but in 1905 the first world congress of Esperanto speakers was held in Boulogne-sur-Mer, France. Since then world congresses have been held in different countries every year, except during the two World Wars. Since the Second World War, they have been attended by an average of more than 2000 people and up to 6000 people.\n\nZamenhof's name for the language was simply ' (\"International Language\"). Facsimile of the title page of the First Book in English, 1889. \n\nLater history \n\nThe autonomous territory of Neutral Moresnet, between what is today Belgium and Germany, had a sizable proportion of Esperanto-speakers among its small and multiethnic population. There was a proposal to make Esperanto its official language.\n\nHowever, neither Belgium nor Prussia (now within Germany) had ever surrendered its original claim to it. Around 1900, Germany in particular was taking a more aggressive stance towards the territory and was accused of sabotage and of obstructing the administrative process in order to force the issue. It was the First World War, however, that was the catalyst that brought about the end of neutrality. On 4 August 1914, Germany invaded Belgium, leaving Moresnet at first \"an oasis in a desert of destruction\".Musgrave, George Clarke. Under Four Flags for France, 1918, p. 8 In 1915, the territory was annexed by the Kingdom of Prussia, without international recognition.\n\nAfter the Great War, there was a proposal for the League of Nations to accept Esperanto as their working language, following a report by Nitobe Inazō, an official delegate of League of Nations during the 13th World Congress of Esperanto in Prague. Ten delegates accepted the proposal with only one voice against, the French delegate, Gabriel Hanotaux. Hanotaux did not like how the French language was losing its position as the international language and saw Esperanto as a threat, effectively wielding his veto power to block the decision. However, two years later, the League recommended that its member states include Esperanto in their educational curricula. For this reason, many people see the 1920s as the heyday of the Esperanto movement. Anarchism as a political movement was very supportive during this time of anationalism as well as of the Esperanto language.[http://www.nodo50.org/esperanto/anarkiismo.htm \"ESPERANTO KAJ ANARKIISMO\" by Will Firth]\n\nEsperanto attracted the suspicion of many states. The situation was especially pronounced in Nazi Germany, Francoist Spain up until the 1950s, and in the Soviet Union from 1937 to 1956.\n\nIn Nazi Germany, there was a motivation to forbid Esperanto because Zamenhof was Jewish, and due to the internationalist nature of Esperanto, which was perceived as \"Bolshevist\". In his work, Mein Kampf, Adolf Hitler specifically mentioned Esperanto as an example of a language that could be used by an international Jewish conspiracy once they achieved world domination. Esperantists were killed during the Holocaust, with Zamenhof's family in particular singled out for being killed. The efforts of a minority of Esperantists to expel Jewish colleagues and align themselves with the Reich were futile and Esperanto was legally forbidden in 1935. Esperantists in German concentration camps taught the language to fellow prisoners, telling guards they were teaching Italian, the language of one of Germany's Axis allies.\n\nIn Imperial Japan, the left-wing of the Japanese Esperanto movement was forbidden, but its leaders were careful enough not to give the impression to the government that the Esperantists were socialist revolutionaries, which proved a successful strategy.\n\nAfter the October Revolution of 1917, Esperanto was given a measure of government support by the new workers' states in the former Russian Empire and later by the Soviet Union government, with the Soviet Esperanto Association being established as an officially recognized organization. In his biography on Joseph Stalin, Leon Trotsky mentions that Stalin had studied Esperanto. However, in 1937, at the height of the Great Purge, Stalin completely reversed the Soviet government's policies on Esperanto; many Esperanto speakers were executed, exiled or held in captivity in the Gulag labour camps. Quite often the accusation was: \"You are an active member of an international spy organisation which hides itself under the name of 'Association of Soviet Esperantists' on the territory of the Soviet Union.\" Until the end of the Stalin era it was dangerous to use Esperanto in the Soviet Union despite the fact that it was never officially forbidden to speak Esperanto.Ulrich Lins: Die gefährliche Sprache. Die Verfolgung der Esperantisten unter Hitler und Stalin. Bleicher: Gerlingen, 1988, p. 220 and elsewhere. \n\nFascist Italy allowed the use of Esperanto, finding its phonology similar to that of Italian and publishing some tourist material in the language.\n\nDuring and after the Spanish Civil War, Francoist Spain forbade anarchists, socialists and Catalan nationalists for many years, among whom the use of Esperanto was extensive, but in the 1950s the Esperanto movement was tolerated again.\n\nOfficial use \n\nEsperanto has not been a secondary official language of any recognized country, but it entered the education system of several countries such as HungaryMichael Byram and Adelheid Hu: Routledge Encyclopedia of Language Teaching and Learning. 2nd edition. Taylor and Francis, Hoboken 2013, , page 229. and China.\n\nThere were plans at the beginning of the 20th century to establish Neutral Moresnet as the world's first Esperanto state. In addition, the self-proclaimed artificial island micronation of Rose Island used Esperanto as its official language in 1968, and another micronation, the extant Republic of Molossia, uses Esperanto as an official language alongside English.\n\nThe Chinese government has used Esperanto since 2001 for daily news on china.org.cn. China also uses Esperanto in China Radio International and for the internet magazine El Popola Ĉinio.\n\nThe Vatican Radio has an Esperanto version of its website.h\n\nThe US Army has published military phrase books in Esperanto, to be used from the 1950s until the 1970s in war games by mock enemy forces.\n\nEsperanto is the working language of several non-profit international organizations such as the ', a left-wing cultural association which has  members in over 85 countries. There is also Education@Internet, which has developed from an Esperanto organization; most others are specifically Esperanto organizations. The largest of these, the Universal Esperanto Association, has an official consultative relationship with the United Nations and UNESCO, which recognized Esperanto as a medium for international understanding in 1954. [http://unesdoc.unesco.org/images/0016/001607/160782eb.pdf Report on the international petition in favour of Esperanto], Unesco, 1st June 1954. The World Esperanto Association has collaborated in 2017 with Unesco to deliver an [http://uea.org/pdf/Unesko-Kuriero_1-2017.pdf Esperanto translation] its magazine Unesco Courier (Unesko Kuriero en Esperanto).\n\nEsperanto is also the first language of teaching and administration of one university, the International Academy of Sciences San Marino.\n\nIn the summer of 1924, the American Radio Relay League adopted Esperanto as its official international auxiliary language, and hoped that the language would be used by radio amateurs in international communications, but its actual use for radio communications was negligible.\n\nAll the personal documents issued by the World Service Authority, including the World Passport, are written in Esperanto, together with English, French, Spanish, Russian, Arabic, and Chinese.\n\nAchievement of its creator's goals\n\nZamenhof's goal to \"enable the learner to make direct use of his knowledge with persons of any nationality, whether the language be universally accepted or not\", as he wrote in 1887, has been achieved as the language is currently spoken by people living in more than one hundred countries.\n\nOn the other hand, one common criticism made is that Esperanto has failed to live up to the hopes of its creator, who dreamed of it becoming a universal second language.Saul Levin, 1993. \"Can an Artificial Language Be More than a Hobby? The Linguistic and Sociological Obstacles\". In Ian Richmond (ed.) Aspects of internationalism: language & culture.The Christian Century, 1930, 47:846 In this regard it has to be noted that Zamenhof was well aware that it may take much time, maybe even many centuries, to get this hope into reality. In his speech at the World Esperanto Congress in Cambridge in 1907 he said, \"we hope that earlier or later, maybe after many centuries, on a neutral language foundation, understanding one each other, the nations will build ... a big family circle.\"\"(...) [http://www.steloj.de/esperanto/paroloj/kongr3a.html ni esperas, ke pli aŭ malpli frue, eble post multaj jarcentoj],\nSur neŭtrala lingva fundamento,\nKomprenante unu la alian,\nLa popoloj faros en konsento\nUnu grandan rondon familian.\" L. L. Zamenhof. Kongresaj paroladoj. Jekaterinburg (Ruslanda Esperantisto). 1995, p. 23–24\n\nLinguistic properties \n\nAlphabet \n\nThe Esperanto alphabet is based on the Latin script, using a one-sound-one-letter principle, except for [d͡z]. It includes six letters with diacritics: ĉ, ĝ, ĥ, ĵ, ŝ (with circumflex), and ŭ (with breve). The alphabet does not include the letters q, w, x, or y, which are only used when writing unassimilated foreign terms or proper names.\n\nThe 28-letter alphabet is:\n\nAll unaccented letters are pronounced approximately as in the IPA, with the exception of c. Esperanto j and c are used in a way familiar to speakers of many European languages, but which is largely unfamiliar to English speakers: j has a y sound [j~i̯], as in yellow and boy, and c has a ts sound [t͡s], as in hits or the zz in pizza.These letters occasionally have these values in English as well, for example the j in hallelujah, Jarlsberg, or Jägermeister, and the c in the name of composer Penderecki, Czech president Václav Havel, or the mineral letovicite. The accented letters are a bit like h-digraphs in English: Ĉ is pronounced like English ch, and ŝ like sh. Ĝ is the g in gem, ĵ a zh sound, as in fusion or French Jacques, and the rare ĥ is like the German , Scottish Gaelic, Scots and Scottish Standard English loch, or how Scouse people sometimes pronounce the 'k' in book and 'ck' in chicken.\n\nWriting diacritics \n\nEven with the widespread adoption of Unicode, the letters with diacritics (found in the \"Latin-Extended A\" section of the Unicode Standard) can cause problems with printing and computing, because they are not found on most physical keyboards and are left out of certain fonts.\n\nThere are two principal workarounds to this problem, which substitute digraphs for the accented letters. Zamenhof, the inventor of Esperanto, created an \"h-convention\", which replaces ĉ, ĝ, ĥ, ĵ, ŝ, and ŭ with ch, gh, hh, jh, sh, and u, respectively. If used in a database, a program in principle could not determine whether to render, for example, ch as c followed by h or as ĉ, and would fail to render, for example, the word ' properly. A more recent \"x-convention\" has gained ground since the advent of computing. This system replaces each diacritic with an x (not part of the Esperanto alphabet) after the letter, producing the six digraphs cx, gx, hx, jx, sx, and ux.\n\nThere are computer keyboard layouts that support the Esperanto alphabet, and some systems use software that automatically replaces x- or h-convention digraphs with the corresponding diacritic letters (for example, Amiketo and Tajpi are keyboard layouts which support the Esperanto alphabet for [http://www012.upp.so-net.ne.jp/klivo/amiketo/ Windows], [http://www012.upp.so-net.ne.jp/klivo/amiketo/makamiketo.html Mac OS X], and [http://www012.upp.so-net.ne.jp/klivo/amiketo/linamiketo.html Linux] for Microsoft Windows, Mac OS X, and Linux,  for Windows Phone, and Gboard and AnySoftKeyboard for Android).\n\nCriticisms are made of the letters with circumflex diacritics, which some find odd or cumbersome, along with their being invented specifically for Esperanto rather than borrowed from existing languages; as well as being arguably unnecessary, as for example with the use of ĥ instead of x and ŭ instead of w.\n\nClassification \n\nThe phonology, grammar, vocabulary, and semantics are based on the Indo-European languages spoken in Europe. The sound inventory is essentially Slavic, as is much of the semantics, whereas the vocabulary derives primarily from the Romance languages, with a lesser contribution from Germanic languages and minor contributions from Slavic languages and Greek. Pragmatics and other aspects of the language not specified by Zamenhof's original documents were influenced by the native languages of early authors, primarily Russian, Polish, German, and French. Paul Wexler proposes that Esperanto is relexified Yiddish, which he claims is in turn a relexified Slavic language,\n though this model is not accepted by mainstream academics.Bernard Spolsky,[https://books.google.com/books?id\n5Xk9AwAAQBAJ&pg=PA157 The Languages of the Jews: A Sociolinguistic History,] Cambridge University Press, 2014 pp.157,180ff. p.183\n\nEsperanto has been described as \"a language lexically predominantly Romanic, morphologically intensively agglutinative, and to a certain degree isolating in character\". Typologically, Esperanto has prepositions and a pragmatic word order that by default is subject–verb–object. Adjectives can be freely placed before or after the nouns they modify, though placing them before the noun is more common. New words are formed through extensive prefixing and suffixing.\n\nGrammar \n\nEsperanto words are mostly derived by stringing together roots, grammatical endings, and at times prefixes and suffixes. This process is regular, so that people can create new words as they speak and be understood. Compound words are formed with a modifier-first, head-final order, as in English (compare \"birdsong\" and \"songbird,\" and likewise, ' and '). Speakers may optionally insert an o between the words in a compound noun if placing them together directly without the o would make the resulting word hard to say or understand.\n\nThe different parts of speech are marked by their own suffixes: all common nouns end in ', all adjectives in ', all derived adverbs in ', and all verbs in one of six tense and mood suffixes, such as the present tense '. Nouns and adjectives have two cases: nominative for grammatical subjects and in general, and accusative for direct objects and (after a preposition) to indicate direction of movement.\n\nSingular nouns used as grammatical subjects end in ', plural subject nouns in ' (pronounced [oi̯] like English \"oy\"). Singular direct object forms end in ', and plural direct objects with the combination ' ([oi̯n]; rhymes with \"coin\"): ' indicates that the word is a noun, ' indicates the plural, and ' indicates the accusative (direct object) case. Adjectives agree with their nouns; their endings are singular subject ' ([a]; rhymes with \"ha!\"), plural subject ' ([ai̯], pronounced \"eye\"), singular object ', and plural object ' ([ai̯n]; rhymes with \"fine\").\n\nThe suffix ', besides indicating the direct object, is used to indicate movement and a few other things as well.\n\nThe six verb inflections consist of three tenses and three moods. They are present tense ', future tense ', past tense ', infinitive mood ', conditional mood ' and jussive mood ' (used for wishes and commands). Verbs are not marked for person or number. Thus, ' means \"to sing\", ' means \"I sing\", ' means \"you sing\", and ' means \"they sing\".\n\nWord order is comparatively free. Adjectives may precede or follow nouns; subjects, verbs and objects may occur in any order. However, the article ' \"the\", demonstratives such as ' \"that\" and prepositions (such as ' \"at\") must come before their related nouns. Similarly, the negative ' \"not\" and conjunctions such as ' \"and\" and ' \"that\" must precede the phrase or clause that they introduce. In copular (A = B) clauses, word order is just as important as in English: \"people are animals\" is distinguished from \"animals are people\".\n\nLiving language \n\nThe Hungarian Academy of Sciences has found that Esperanto fulfills all the requirements of a living language. \n\nNeutrality\n\nOrigin\n\nThe vocabulary, orthography, phonology, and semantics, are all thoroughly European. The vocabulary, for example, draws about two-thirds from Romance and one-third from Germanic languages; the syntax is Romance; and the phonology and semantics are Slavic. The grammar is arguably more European than not, but Claude Piron among others argues that the derivation system is not particularly European, though the inflection is.Le Defi des Langues by Claude Piron. Harmattan, 1994.\n\nGender\n\nEsperanto is frequently accused of being inherently sexist, because the default form of some nouns is masculine while a derived form is used for the feminine, which is said to retain traces of the male-dominated society of late 19th-century Europe of which Esperanto is a product.[http://bertilow.com/pmeg/gramatiko/o-vortoj/seksa_signifo.html Bertilo] (in Esperanto)[http://parracomumangi.altervista.org/Domande.htm] (in Italian) Some masculine nouns, primarily titles and kin terms, such as sinjoro \"Mr, sir\" vs. sinjorino \"Ms, lady\" and patro \"father\" vs. patrino \"mother\". In addition, nouns that denote persons and whose definitions are not explicitly male are often assumed to be male unless explicitly made female, such as doktoro, a PhD doctor (male or unspecified) versus doktorino, a female PhD. This is analogous to the situation with the English suffix -ess, as in baron/baroness, waiter/waitress etc. Esperanto pronouns are similar. As in English, li \"he\" may be used generically, whereas ŝi \"she\" is always female.Kalocsay & Waringhien, Plena analiza gramatiko (1985:73)\n\nPhonology \n\nEsperanto has 23 consonants, five vowels, and two semivowels that combine with the vowels to form six diphthongs. (The consonant and semivowel are both written j, and the uncommon consonant is written with the digraph dz,Kalocsay & Waringhien (1985) ', § 17, 22 which is the only consonant that doesn't have its own letter.) Tone is not used to distinguish meanings of words. Stress is always on the second-last vowel in fully Esperanto words unless a final vowel ' is elided, which occurs mostly in poetry. For example, ' \"family\" is, with the stress on the second i, but when the word is used without the final  (), the stress remains on the second ':.\n\nConsonants \n\nThe 23 consonants are:\n\nThe sound is usually an alveolar trill, but can also be a velar trill, a velar fricative, and an alveolar approximant. Many other forms such an alveolar tap are done and accepted in practice. The is normally pronounced like English v, but may be pronounced (between English v and w) or, depending on the language background of the speaker. A semivowel normally occurs only in diphthongs after the vowels and, not as a consonant. Common, if debated, assimilation includes the pronunciation of ' as and ' as.\n\nA large number of consonant clusters can occur, up to three in initial position (as in ', \"strange\") and four in medial position (as in ', \"teach\"). Final clusters are uncommon except in foreign names, poetic elision of final , and a very few basic words such as ' \"hundred\" and ' \"after\".\n\nVowels \n\nEsperanto has the five vowels found in such languages as  Spanish, Swahili, Modern Hebrew, and Modern Greek.\n\nThere are also two semivowels, and, which combine with the monophthongs to form six falling diphthongs: , , , , , and '.\n\nSince there are only five vowels, a good deal of variation in pronunciation is tolerated. For instance, e commonly ranges from (French ') to (French '). These details often depend on the speaker's native language. A glottal stop may occur between adjacent vowels in some people's speech, especially when the two vowels are the same, as in ' \"hero\" ( or) and ' \"great-grandfather\" ( or).\n\nSample text \n\nThe following short extract gives an idea of the character of Esperanto.Maire Mullarney Everyone's Own Language, p147, Nitobe Press, Channel Islands, 1999 (Pronunciation is covered above; the Esperanto letter j is pronounced like English y.)\n* Esperanto:\n«»\n* English translation:\nIn many places in China, there were temples of the dragon-king. During times of drought, people would pray in the temples that the dragon-king would give rain to the human world. At that time the dragon was a symbol of the supernatural creature. Later on, it became the ancestor of the highest rulers and symbolised the absolute authority of a feudal emperor. The emperor claimed to be the son of the dragon. All of his personal possessions carried the name \"dragon\" and were decorated with various dragon figures. Now dragon decorations can be seen everywhere in China and legends about dragons circulate.\n\nSimple phrases \n\nBelow are listed some useful Esperanto words and phrases along with IPA transcriptions:\n\nVocabulary \n\nThe core vocabulary of Esperanto was defined by ', published by Zamenhof in 1887. This book listed 900 roots; these could be expanded into tens of thousands of words using prefixes, suffixes, and compounding. In 1894, Zamenhof published the first Esperanto dictionary, ', which had a larger set of roots. The rules of the language allowed speakers to borrow new roots as needed; it was recommended, however, that speakers use most international forms and then derive related meanings from these.\n\nSince then, many words have been borrowed, primarily (but not solely) from the European languages. Not all proposed borrowings become widespread, but many do, especially technical and scientific terms. Terms for everyday use, on the other hand, are more likely to be derived from existing roots; ' \"computer\", for instance, is formed from the verb ' \"compute\" and the suffix ' \"tool\". Words are also calqued; that is, words acquire new meanings based on usage in other languages. For example, the word ' \"mouse\" has acquired the meaning of a computer mouse from its usage in English. Esperanto speakers often debate about whether a particular borrowing is justified or whether meaning can be expressed by deriving from or extending the meaning of existing words.\n\nSome compounds and formed words in Esperanto are not entirely straightforward; for example, ', literally \"give out\", means \"publish\", paralleling the usage of certain European languages (such as German). In addition, the suffix -um- has no defined meaning; words using the suffix must be learned separately (such as ' \"to the right\" and ' \"clockwise\").\n\nThere are not many idiomatic or slang words in Esperanto, as these forms of speech tend to make international communication difficult—working against Esperanto's main goal.\n\nInstead of derivations of Esperanto roots, new roots are taken from European languages in the endeavor to create an international language.', Claude Piron. Vienna: , 1989. ' \"The language wants to be elegant, not elephantine.\"\n\nEducation \n\nEsperanto speakers learn the language through self-directed study, online tutorials, and correspondence courses taught by volunteers. More recently, free teaching websites, like ' and ', are available.\n\nEsperanto instruction is rarely available at schools, including four primary schools in a pilot project under the supervision of the University of Manchester, and by one count at a few universities. However, outside China and Hungary, these mostly involve informal arrangements rather than dedicated departments or state sponsorship. Eötvös Loránd University in Budapest had a department of Interlinguistics and Esperanto from 1966 to 2004, after which time instruction moved to vocational colleges; there are state examinations for Esperanto instructors. Additionally, Adam Mickiewicz University in Poland offers a diploma in Interlinguistics. The Senate of Brazil passed a bill in 2009 that would make Esperanto an optional part of the curriculum in public schools, although mandatory if there is demand for it.  the bill is still under consideration by the Chamber of Deputies.\n\nVarious educators have estimated that Esperanto can be learned in anywhere from one quarter to one twentieth the amount of time required for other languages. Claude Piron, an Esperanto-Activist and Chinese–English–Russian–Spanish translator for the United Nations, argued that Esperanto is far more intuitive than many ethnic languages: \"Esperanto relies entirely on innate reflexes [and] differs from all other languages in that you can always trust your natural tendency to generalize patterns.... The same neuropsychological law [—called by] Jean Piaget generalizing assimilation—applies to word formation as well as to grammar.\"Piron, Claude: [http://www.claude-piron.ch/hidden-perverse-effects.html \"The hidden perverse effect of the current system of international communication\"], published lecture notes\n\nThe Institute of Cybernetic Pedagogy at Paderborn (Germany) has compared the length of study time it takes natively French-speaking high-school students to obtain comparable 'standard' levels in Esperanto, English, German, and Italian.Flochon, Bruno, 2000, «  », in Gauthier, Guy (ed.) ' 4e trim. 48: 89–95. Cited in François Grin,  (French) The results were:\n* 2,000 hours studying German \n* 1,500 hours studying English \n* 1,000 hours studying Italian (or any other Romance language) \n* 150 hours studying Esperanto.\n\nThird-language acquisition \n\nFour primary schools in Britain, with 230 pupils, are currently following a course in \"propaedeutic Esperanto\"—that is, instruction in Esperanto to raise language awareness and accelerate subsequent learning of foreign languages—under the supervision of the University of Manchester. As they put it,\nMany schools used to teach children the recorder, not to produce a nation of recorder players, but as a preparation for learning other instruments. [We teach] Esperanto, not to produce a nation of Esperanto-speakers, but as a preparation for learning other languages.\nStudies have been conducted in New Zealand,Report: Article in ', volume I, p.436, on the pedagogic value of Esperanto. United States,Report: Christian Rudmick, The Wellesley College Danish-Esperanto experiment.Report: Edward Thorndike, Language Learning. Bureau of Publications of Teachers College, 1933. [http://www.interlingua.org/ Interlingua.org]Helen S. Eaton, \"The Educational Value of an Artificial Language.\" The Modern Language Journal, #12, pp. 87–94 (1927). [http://www.blackwellpublishing.com/mlj/newsearchres.asp?contenttypeAA&topic\nArtificial%20Language&searchtypeadv Blackwellpublishing.com] Germany,Protocols of the annual November meetings in Paderborn \"\" (Working conference: Interlinguistics in Science and Education), which can be obtained from the Institute of Pedagogic Cybernetics in Paderborn. Also in the works by Frank, Lobin, Geisler, and Meder. Italy and Australia. The results of these studies were favorable and demonstrated that studying Esperanto before another foreign language expedites the acquisition of the other, natural language. This appears to be because learning subsequent foreign languages is easier than learning one's first foreign language, whereas the use of a grammatically simple and culturally flexible auxiliary language like Esperanto lessens the first-language learning hurdle. In one study,Williams, N. (1965) 'A language teaching experiment', Canadian Modern Language Review 22.1: 26–28 a group of European secondary school students studied Esperanto for one year, then French for three years, and ended up with a significantly better command of French than a control group, who studied French for all four years.\n\nCommunity \n\nGeography and demography \n\nEsperanto is by far the most widely spoken constructed language in the world. Speakers are most numerous in Europe and East Asia, especially in urban areas, where they often form Esperanto clubs.Sikosek, Ziko M. ' (\"Esperanto without Myths\"). Second edition. Antwerp: Flandra Esperanto-Ligo, 2003. Esperanto is particularly prevalent in the northern and central countries of Europe; in China, Korea, Japan, and Iran within Asia; in Brazil, Argentina, and Mexico in the Americas; and in Togo in Africa.\n\nCountering a common criticism against Esperanto, the statistician Svend Nielsen has found there to be no significant correlation between the number of Esperanto speakers and similarity of a given national mother language to Esperanto. He concludes that Esperanto tends to be more popular in countries that are rich, with widespread Internet access and that tend to contribute more to science and culture. Linguistic diversity within a country was found to have a slight inverse correlation with Esperanto popularity.\n\nNumber of speakers \n\nAn estimate of the number of Esperanto speakers was made by Sidney S. Culbert, a retired psychology professor at the University of Washington and a longtime Esperantist, who tracked down and tested Esperanto speakers in sample areas in dozens of countries over a period of twenty years. Culbert concluded that between one and two million people speak Esperanto at Foreign Service Level 3, \"professionally proficient\" (able to communicate moderately complex ideas without hesitation, and to follow speeches, radio broadcasts, etc.).Culbert, Sidney S. [http://www.panix.com/~dwolff/docs/ Three letters about his method for estimating the number of Esperanto speakers], scanned and HTMLized by David Wolff Culbert's estimate was not made for Esperanto alone, but formed part of his listing of estimates for all languages of more than one million speakers, published annually in the World Almanac and Book of Facts. Culbert's most detailed account of his methodology is found in a 1989 letter to David Wolff. Since Culbert never published detailed intermediate results for particular countries and regions, it is difficult to independently gauge the accuracy of his results.\n\nIn the Almanac, his estimates for numbers of language speakers were rounded to the nearest million, thus the number for Esperanto speakers is shown as two million. This latter figure appears in Ethnologue. Assuming that this figure is accurate, that means that about 0.03% of the world's population speak the language. Although it is not Zamenhof's goal of a universal language, it still represents a level of popularity unmatched by any other constructed language.\n\nMarcus Sikosek (now Ziko van Dijk) has challenged this figure of 1.6 million as exaggerated. He estimated that even if Esperanto speakers were evenly distributed, assuming one million Esperanto speakers worldwide would lead one to expect about 180 in the city of Cologne. Van Dijk finds only 30 fluent speakers in that city, and similarly smaller-than-expected figures in several other places thought to have a larger-than-average concentration of Esperanto speakers. He also notes that there are a total of about 20,000 members of the various Esperanto organizations (other estimates are higher). Though there are undoubtedly many Esperanto speakers who are not members of any Esperanto organization, he thinks it unlikely that there are fifty times more speakers than organization members.\n\nFinnish linguist Jouko Lindstedt, an expert on native-born Esperanto speakers, presented the following schemeLindstedt, Jouko. \"Re: \" (posting). [http://www.helsinki.fi/~jslindst/denask-l.html DENASK-L@helsinki.fi], 22 April 1996. to show the overall proportions of language capabilities within the Esperanto community:\n* 1,000 have Esperanto as their native language.\n* 10,000 speak it fluently.\n* 100,000 can use it actively.\n* One million understand a large amount passively.\n* Ten million have studied it to some extent at some time.\n\nIn 2017, doctoral student Svend Nielsen has estimated around 63.000 Esperanto speakers worldwide, taking into account association memberships, user-generated data from Esperanto websites and census statistics. This number, however, was disputed by statistician Sten Johansson, who questioned the reliability of the source data and highlighted a wide margin of error, the latter point with which Nielsen agrees. Both have stated, however, that this new number is likely more realistic than some earlier projections.\n\nIn the absence of Dr. Culbert's detailed sampling data, or any other census data, it is impossible to state the number of speakers with certainty. According to the website of the World Esperanto Association:\nNumbers of textbooks sold and membership of local societies put \"the number of people with some knowledge of the language in the hundreds of thousands and possibly millions\".\n\nNative speakers \n\nNative Esperanto speakers, , have learned the language from birth from Esperanto-speaking parents. This usually happens when Esperanto is the chief or only common language in an international family, but sometimes occurs in a family of devoted Esperantists. The 15th edition of Ethnologue cited estimates that there were 200 to 2000 native speakers in 1996, but these figures were removed from the 16th and 17th editions.\nAs of 1996, there were approximately 350 attested cases of families with native Esperanto speakers.Corsetti, Renato (1996). A mother tongue spoken mainly by fathers. Language Problems and Language Planning 20: 3, 263–73\n\nCulture \n\nEsperantists can access an international culture, including a large body of original as well as translated literature. There are more than 25,000 Esperanto books, both originals and translations, as well as several regularly distributed Esperanto magazines. In 2013 a museum about Esperanto opened in China. Esperantists use the language for free accommodations with Esperantists in 92 countries using the  or to develop pen pals through '.\n\nEvery year, Esperantists meet for the World Congress of Esperanto ().Ziko van Dijk. '. Rotterdam: UEA, 2005.\n\nHistorically, much Esperanto music, such as ', has been in various folk traditions. There is also a variety of classical and semi-classical choral music, both original and translated, as well as large ensemble music that includes voices singing Esperanto texts. Lou Harrison, who incorporated styles and instruments from many world cultures in his music, used Esperanto titles and/or texts in several of his works, most notably ' (1973). David Gaines used Esperanto poems as well as an excerpt from a speech by Dr. Zamenhof for his Symphony No. One (Esperanto) for mezzo-soprano and orchestra (1994–98). He wrote original Esperanto text for his ' (I Can Cry No Longer) for unaccompanied SATB choir (1994).\n\nThere are also shared traditions, such as Zamenhof Day, and shared behaviour patterns. Esperantists speak primarily in Esperanto at international Esperanto meetings.\n\nDetractors of Esperanto occasionally criticize it as \"having no culture\". Proponents, such as Prof. Humphrey Tonkin of the University of Hartford, observe that Esperanto is \"culturally neutral by design, as it was intended to be a facilitator between cultures, not to be the carrier of any one national culture\". The late Scottish Esperanto author William Auld wrote extensively on the subject, arguing that Esperanto is \"the expression of a common human culture, unencumbered by national frontiers. Thus it is considered a culture on its own.\"Auld, William. ' (\"The Esperanto Phenomenon\"). Rotterdam: , 1988.\n\nNoted authors in Esperanto \n\nSome authors of works in Esperanto are:\n\nPopular culture \n\nEsperanto has been used in a number of films and novels. Typically, this is done either to add the exotic flavour of a foreign language without representing any particular ethnicity, or to avoid going to the trouble of inventing a new language. The Charlie Chaplin film The Great Dictator (1940) showed Jewish ghetto shop signs in Esperanto. Two full-length feature films have been produced with dialogue entirely in Esperanto: , in 1964, and Incubus, a 1965 B-movie horror film which is also notable for starring William Shatner shortly before he began working on Star Trek.\n\nA language school teaching \"Entrenationo\" (representing a satire on Esperanto) is featured in Graham Greene's novel The Confidential Agent, which was made into a film starring Charles Boyer and Lauren Bacall (1945). Other amateur productions have been made, such as a dramatization of the novel ' (Gerda Has Disappeared). In Stamboul Train, Greene used Esperanto as the language on signs at the main train station in Budapest. A number of mainstream films in national languages have used Esperanto in some way.\n\nEsperanto is used as the universal language in the far future of Harry Harrison's Stainless Steel Rat and Deathworld stories. Poul Anderson's story \"High Treason\" takes place in a future where Earth became united politically but was still divided into many languages and cultures, and Esperanto became the language of its space armed forces, fighting wars with various extraterrestrial races. Esperanto is said to be the official language of all the peoples of Phillip Jose Farmer's \"Riverworld\" series.\n\nThe opening song to the popular video game Final Fantasy XI, \"\", was written in Esperanto. It was the first game in the series that was played online, and would have players from both Japan and North America (official European support was added after the North American launch) playing together on the same servers, using an auto-translate tool to communicate. The composer, Nobuo Uematsu, felt that Esperanto was a good language to symbolize worldwide unity.\n\nIn the geek fiction novel \"Off to Be the Wizard\", Esperanto is programmed as the language that triggers all of the wizard's spells. Philip, Martin's teacher, explains that this is because \"no one really speaks Esperanto and it's easy to learn\".\n\nEsperanto is also found in the comic book series Saga as the language Blue, spoken by the inhabitants of Wreath. It is rendered in blue-colored text. Blue is generally only spoken by inhabitants of Wreath, while most other cultures use a universal language that appears to be simply named \"Language.\" Some Wreath inhabitants use translator rings to communicate with those who don't speak Blue. Magic seems to be activated via the linguistic medium of blue.\n\nIn the television show Red Dwarf, which begins in the late 22nd century, crewman Arnold Rimmer constantly spends his time trying to learn Esperanto and failing, even compared to his bunkmate Dave Lister who only maintains a casual interest. Additionally many of the signs around the ship Red Dwarf are written in both English and Esperanto. The novel Infinity Welcomes Careful Drivers states that, although not required, it is widely expected that officers in the Space Corps be fluent in the language, hence Rimmer's interest.\n\nScience \n\nIn 1921 the French Academy of Sciences recommended using Esperanto for international scientific communication. A few scientists and mathematicians, such as Maurice Fréchet (mathematics), John C. Wells (linguistics), Helmar Frank (pedagogy and cybernetics), and Nobel laureate Reinhard Selten (economics) have published part of their work in Esperanto. Frank and Selten were among the founders of the International Academy of Sciences in San Marino, sometimes called the \"Esperanto University\", where Esperanto is the primary language of teaching and administration.\n\nA message in Esperanto was recorded and included in Voyager 1s Golden Record.\n\nCommerce and trade \n\nEsperanto business groups have been active for many years. The French Chamber of Commerce did research in the 1920s and reported in The New York Times in 1921 that Esperanto seemed to be the best business language.\n\nGoals of the movement \n\nZamenhof had three goals, as he wrote already in 1887: to create an easy language, to create a language ready to use \"whether the language be universally accepted or not\" and to find some means to get many people learn the language. So Zamenhof's intention was not only to create an easy-to-learn language to foster international understanding as a general language, but also to create a language for immediate use by a (small) language community. Esperanto was to serve as an international auxiliary language, that is, as a universal second language, not to replace ethnic languages. This goal was widely shared among Esperanto speakers in the early decades of the movement. Later, Esperanto speakers began to see the language and the culture that had grown up around it as ends in themselves, even if Esperanto is never adopted by the United Nations or other international organizations.\n\nEsperanto speakers who want to see Esperanto adopted officially or on a large scale worldwide are commonly called ', from ', meaning \"final victory\". It has to be noted that there are two kinds of \"finvenkismo\"–\"desubismo\" and \"desuprismo\"; the first aims to spread Esperanto between ordinary people (\"desube\", from below) aiming to form a steadily growing community of Esperanto speakers. The second aims to act from above (\"desupre\"), beginning with politicians. Zamenhof considered the first way to have a better perspective, as \"for such affairs as ours, governments come with their approval and help usually only, when everything is already completely finished\".\"[http://www.steloj.de/esperanto/paroloj/kongr6a.html La celo, por kiu ni laboras, povas esti atingita per du vojoj]: aŭ per laborado de homoj privataj, t.e. de la popolaj amasoj, aŭ per dekreto de la registaroj. Plej kredeble nia afero estos atingita per la vojo unua, ĉar al tia afero, kiel nia, la registaroj venas kun sia sankcio kaj helpo ordinare nur tiam, kiam ĉio estas jam tute preta.\" L. L. Zamenhof. Speech in Washington. 1910\n\nThose who focus on the intrinsic value of the language are commonly called ', from Rauma, Finland, where a declaration on the short-term improbability of the \"\" and the value of Esperanto culture was made at the International Youth Congress in 1980. However the \"Manifesto de Raŭmo\" clearly mentions the intention to further spread the language: \"We want to spread Esperanto to put into effect its positive values more and more, step by step\".\"Ni celas disvastigi Esperanton por pli kaj pli, iom post iom realigi ĝiajn pozitivajn valorojn\". [http://www.esperantio.net/index.php?id\n10 Manifesto de Raŭmo]\n\nIn 1996 the Prague Manifesto was adopted at the annual congress of the World Esperanto Association (UEA); it was subscribed by individual participants and later by other Esperanto speakers.\n\nSymbols and flags \n\nThe earliest flag, and the one most commonly used today, features a green five-pointed star against a white canton, upon a field of green. It was proposed to Zamenhof by Irishman Richard Geoghegan, author of the first Esperanto textbook for English speakers, in 1887. The flag was approved in 1905 by delegates to the first conference of Esperantists at Boulogne-sur-Mer. A version with an \"\" superimposed over the green star is sometimes seen. Other variants include that for Christian Esperantists, with a white Christian cross superimposed upon the green star, and that for Leftists, with the color of the field changed from green to red.\n\nIn 1987, a second flag design was chosen in a contest organized by the UEA celebrating the first centennial of the language. It featured a white background with two stylised curved \"E\"s facing each other. Dubbed the \"\" (jubilee symbol), it attracted criticism from some Esperantists, who dubbed it the \"\" (melon) because of the design's elliptical shape. It is still in use, though to a lesser degree than the traditional symbol, known as the \"\" (green star).\n\nPolitics \n\nEsperanto has been placed in many proposed political situations. The most popular of these is the Europe–Democracy–Esperanto, which aims to establish Esperanto as the official language of the European Union. Grin's Report, published in 2005 by François Grin, found that the use of English as the lingua franca within the European Union costs billions annually and significantly benefits English-speaking countries financially. The report considered a scenario where Esperanto would be the lingua franca, and found that it would have many advantages, particularly economically speaking, as well as ideologically.\n\nRussian Esperanto writer Nikolai Nekrasov was arrested during the Stalinist repressions of the late 1930s, accused of being \"an organizer and leader of a fascist, espionage, terrorist organization of Esperantists\", and executed on 4 October 1938. Another Esperanto writer Vladimir Varankin was executed on 3 October 1938.\n\nReligion \n\nEsperanto has served an important role in several religions, such as Oomoto from Japan and the Bahá'í Faith from Iran, and has been encouraged by others, like some Spiritist movements.\n\nOomoto \n\nThe Oomoto religion encourages the use of Esperanto among its followers and includes Zamenhof as one of its deified spirits.\n\nBahá'í Faith \n\nThe Bahá'í Faith encourages the use of an auxiliary international language. The Baha'i's believe that it will not be the language of the future, although it has great potential in this role, as it has not been chosen by the people. `Abdu'l-Bahá praised the ideal of Esperanto, and there was an affinity between Esperantists and Bahá'ís during the late 19th century and early 20th century.\n\nOn February 12, 1913, `Abdu'l-Bahá gave a talk to the Paris Esperanto Society,\n\nNow, praise be to God that Dr. Zamenhof has invented the Esperanto language. It has all the potential qualities of becoming the international means of communication. All of us must be grateful and thankful to him for this noble effort; for in this way he has served his fellowmen well. With untiring effort and self-sacrifice on the part of its devotees Esperanto will become universal. Therefore every one of us must study this language and spread it as far as possible so that day by day it may receive a broader recognition, be accepted by all nations and governments of the world, and become a part of the curriculum in all the public schools. I hope that Esperanto will be adopted as the language of all the future international conferences and congresses, so that all people need acquire only two languages—one their own tongue and the other the international language. Then perfect union will be established between all the people of the world. Consider how difficult it is today to communicate with various nations. If one studies fifty languages one may yet travel through a country and not know the language. Therefore I hope that you will make the utmost effort, so that this language of Esperanto may be widely spread\n\nLidia Zamenhof, daughter of L. L. Zamenhof, became a Bahá'í around 1925. James Ferdinand Morton, Jr., an early member of the Bahá'í Faith in Greater Boston, was vice-president of the Esperanto League for North America. Ehsan Yarshater, the founding editor of Encyclopædia Iranica, notes how as a child in Iran he learned Esperanto and that when his mother was visiting Haifa on a Bahá'í pilgrimage he wrote her a letter in Persian as well as Esperanto. At the request of 'Abdu’l-Baha, Agnes Baldwin Alexander became an early advocate of Esperanto and used it to spread the Bahá’í teachings at meetings and conferences in Japan.\n\nToday there exists an active sub-community of Bahá'í Esperantists and various volumes of Bahá'í literature have been translated into Esperanto. In 1973, the Bahá'í Esperanto-League for active Bahá'í supporters of Esperanto was founded.\n\nSpiritism \n\nIn 1908, spiritist Camilo Chaigneau wrote an article named \"Spiritism and Esperanto\" in the periodic La Vie d'Outre-Tombe recommending the use of Esperanto in a \"central magazine\" for all spiritists and esperantists. Esperanto then became actively promoted by spiritists, at least in Brazil, initially by Ismael Gomes Braga and František Lorenz; the latter is known in Brazil as Francisco Valdomiro Lorenz, and was a pioneer of both spiritist and Esperantist movements in this country. [http://www.espirito.org.br/portal/artigos/geae/o-esp-e-o-esperanto.html O Espiritismo e o Esperanto (Spiritism and Esperanto)]\n\nThe Brazilian Spiritist Federation publishes Esperanto coursebooks, translations of Spiritism's basic books, and encourages Spiritists to become Esperantists.\n\nBible translations \n\nThe first translation of the Bible into Esperanto was a translation of the Tanakh or Old Testament done by L. L. Zamenhof. The translation was reviewed and compared with other languages' translations by a group of British clergy and scholars before its publication at the British and Foreign Bible Society in 1910. In 1926 this was published along with a New Testament translation, in an edition commonly called the \"\". In the 1960s, the ' tried to organize a new, ecumenical Esperanto Bible version. Since then, the Dutch Remonstrant pastor Gerrit Berveling has translated the Deuterocanonical or apocryphal books in addition to new translations of the Gospels, some of the New Testament epistles, and some books of the Tanakh or Old Testament. These have been published in various separate booklets, or serialized in ', but the Deuterocanonical books have appeared in recent editions of the Londona Biblio.\n\nChristianity \n\nChristian Esperanto organizations include two that were formed early in the history of Esperanto:\n* 1910—The International Union of Catholic Esperantists. Two Roman Catholic popes, John Paul II and Benedict XVI, have regularly used Esperanto in their multilingual ' blessings at Easter and Christmas each year since Easter 1994.\n* 1911—The International League of Christian Esperantists.\n\nIndividual churches using Esperanto include:\n* The Quaker [http://www.noos.ch/kes/index.php?pg2&lg\nen Esperanto Society], with activities as described in an issue of \"The Friend\"\n* 1910—First Christadelphian publications in Esperanto.Botten J. The Captive Conscience 2002 p.110 re. Esperanto speaking Christadelphians in Tsarist Russia.\n* There are instances of Christian apologists and teachers who use Esperanto as a medium. Nigerian pastor Bayo Afolaranmi's \"\" (spiritual food) Yahoo mailing list, for example, has hosted weekly messages since 2003.\nChick Publications, publisher of Protestant fundamentalist themed evangelistic tracts, has published a number of comic book style tracts by Jack T. Chick translated into Esperanto, including \"This Was Your Life!\" (\"\")\n\nMormons \n\nThe Book of Mormon has been partially translated into Esperanto, although the translation has not been officially endorsed by The Church of Jesus Christ of Latter-day Saints.\n\nIslam \n\nAyatollah Khomeini of Iran called on Muslims to learn Esperanto and praised its use as a medium for better understanding among peoples of different religious backgrounds. After he suggested that Esperanto replace English as an international lingua franca, it began to be used in the seminaries of Qom. An Esperanto translation of the Qur'an was published by the state shortly thereafter.\n\nModifications \n\nThough Esperanto itself has changed little since the publication of the ' (Foundation of Esperanto), a number of reform projects have been proposed over the years, starting with Zamenhof's proposals in 1894 and  in 1907. Several later constructed languages, such as Universal, were based on Esperanto.\n\nIn modern times, attempts have been made to eliminate perceived sexism in the language, such as Riism.\n\nEponymous entities \n\nThere are some geographical and astronomical features named after Esperanto, or after its creator L. L. Zamenhof. These include Esperanto Island in Zed Islands off Livingston Island, and the asteroids 1421 Esperanto and 1462 Zamenhof discovered by Finnish astronomer and Esperantist Yrjö Väisälä.\n\nCritics \n\nThe lack of dedicated government support for Esperanto means that replacing English as the global link language is rather limited. The spread of a language depends on economics, global politics, and a good support system backed with state support. Esperanto. http://en.wikipedia.org/?curid=9248."
  }
}
