{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15864",
  "eid" : "1f68ac50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778561941,
  "textBody" : "Events\n\n* 218 – Battle of Antioch: With the support of the Syrian legions, Elagabalus defeats the forces of emperor Macrinus. He flees, but is captured near Chalcedon and later executed in Cappadocia.\n* 632 – Muhammad, Islamic prophet, dies in Medina. \n* 793 – Vikings raid the abbey at Lindisfarne in Northumbria, commonly accepted as the beginning of Norse activity in the British Isles.\n*1042 – Edward the Confessor becomes King of England, one of the last Anglo-Saxon kings of England.\n*1191 – Richard I arrives in Acre, beginning his crusade.\n*1405 – Richard le Scrope, the Archbishop of York, and Thomas Mowbray, Earl of Norfolk, are executed in York on Henry IV's orders.\n*1776 – American Revolutionary War: American attackers are driven back at the Battle of Trois-Rivières.\n*1783 – Laki, a volcano in Iceland, begins an eight-month eruption which kills over 9,000 people and starts a seven-year famine.\n*1789 – James Madison introduces twelve proposed amendments to the United States Constitution in Congress.\n*1794 – Robespierre inaugurates the French Revolution's new state religion, the Cult of the Supreme Being, with large organized festivals all across France.\n*1856 – A group of 194 Pitcairn Islanders, descendants of the mutineers of , arrives at Norfolk Island, commencing the Third Settlement of the Island.\n*1861 – American Civil War: Tennessee secedes from the Union.\n*1862 – American Civil War: Battle of Cross Keys: Confederate forces under General Stonewall Jackson save the Army of Northern Virginia from a Union assault on the James Peninsula led by General George B. McClellan.\n*1867 – Coronation of Franz Joseph as King of Hungary following the Austro-Hungarian compromise (Ausgleich).\n*1887 – Herman Hollerith applies for US patent #395,781 for the 'Art of Compiling Statistics', which was his punched card calculator.\n*1906 – Theodore Roosevelt signs the Antiquities Act into law, authorizing the President to restrict the use of certain parcels of public land with historical or conservation value.\n*1912 – Carl Laemmle incorporates Universal Pictures.\n*1918 – A solar eclipse is observed at Baker City, Oregon by scientists and an artist hired by the United States Navy.\n*1928 – Second Northern Expedition: The National Revolutionary Army captures Peking, whose name is changed to Beijing (\"Northern Capital\").\n*1929 – Margaret Bondfield is appointed Minister of Labour. She is the first woman appointed to the Cabinet of the United Kingdom.\n*1940 – World War II: The completion of Operation Alphabet, the evacuation of Allied forces from Narvik at the end of the Norwegian Campaign.\n*1941 – World War II: The Allies commence the Syria–Lebanon Campaign against the possessions of Vichy France in the Levant.\n*1942 – World War II: The Japanese imperial submarines I-21 and I-24 shell the Australian cities of Sydney and Newcastle.\n*1949 – Helen Keller, Dorothy Parker, Danny Kaye, Fredric March, John Garfield, Paul Muni and Edward G. Robinson are named in an FBI report as Communist Party members.\n*  1949   – George Orwell's Nineteen Eighty-Four is published.\n*1953 – An F5 tornado hits Beecher, Michigan, killing 116, injuring 844, and destroying 340 homes.\n*  1953   – The United States Supreme Court rules that restaurants in Washington, D.C. cannot refuse to serve black patrons.\n*1959 – The  and United States Postal Service attempt the delivery of mail via Missile Mail.\n*1966 – An F-104 Starfighter collides with XB-70 Valkyrie prototype no. 2, destroying both aircraft during a photo shoot near Edwards Air Force Base. Joseph A. Walker, a NASA test pilot, and Carl Cross, a United States Air Force test pilot, are both killed.\n*  1966   – Topeka, Kansas, is devastated by a tornado that registers as an \"F5\" on the Fujita scale: The first to exceed US$100 million in damages. Sixteen people are killed, hundreds more injured, and thousands of homes damaged or destroyed.\n*  1966   – The National Football League and American Football League announced a merger effective in 1970.\n*1967 – Six-Day War: The USS Liberty incident occurs, killing 34 and wounding 171.\n*1972 – Vietnam War: Nine-year-old Phan Thị Kim Phúc is burned by napalm, an event captured by Associated Press photographer Nick Ut moments later while the young girl is seen running down a road, in what would become an iconic, Pulitzer Prize-winning photo.\n*1982 – Bluff Cove Air Attacks during the Falklands War:  Fifty-six British servicemen are killed by an Argentine air attack on two landing ships, RFA Sir Galahad and .\n*1984 – Homosexuality is declared legal in the Australian state of New South Wales.\n*1987 – New Zealand's Labour government establishes a national nuclear-free zone under the New Zealand Nuclear Free Zone, Disarmament, and Arms Control Act 1987.\n*1992 – The first World Oceans Day is celebrated, coinciding with the Earth Summit held in Rio de Janeiro, Brazil.\n*1995 – Downed U.S. Air Force pilot Captain Scott O'Grady is rescued by U.S. Marines in Bosnia.\n*2001 – Mamoru Takuma kills eight and injures 15 in a mass stabbing at an elementary school in the Osaka Prefecture of Japan.\n*2004 – The first Venus Transit in well over a century takes place, the previous one being in 1882.\n*2007 – Newcastle, New South Wales, Australia, is hit by the State's worst storms and flooding in 30 years resulting in the death of nine people and the grounding of a trade ship, the .\n*2008 – At least 37 miners go missing after an explosion in an Ukrainian coal mine causes it to collapse.\n*  2008   – At least seven people are killed and ten injured in a stabbing spree in Tokyo, Japan.\n*2009 – Two American journalists are found guilty of illegally entering North Korea and sentenced to 12 years of penal labour.\n*2014 – At least 28 people are killed in an attack at Jinnah International Airport, Karachi, Pakistan.\n*2017 – YouTuber Randy Stair aka Andrew Blaze shoots and kills three of his Weis Markets coworkers as well as himself in a Columbine-inspired attack after releasing his manifesto in the form of several files and videos involving his flash animation series based on a minor character from Nickolodeon's Danny Phantom cartoon.\n\nBirths\n\n* 862 – Emperor Xizong of Tang (d. 888)\n*1236 – Violant of Aragon, queen consort of Castile and León (d. 1301)\n*1332 – Cangrande II della Scala, Lord of Verona (d. 1359)\n*1508 – Primož Trubar, Slovenian Protestant reformer (d. 1586)\n*1552 – Gabriello Chiabrera, Italian poet and author (d. 1638)\n*1593 – George I Rákóczi, prince of Transylvania (d. 1648)\n*1625 – Giovanni Domenico Cassini, Italian-French mathematician and astronomer (d. 1712)\n*1671 – Tomaso Albinoni, Italian violinist and composer (d. 1751)\n*1717 – John Collins, American lawyer and politician, 3rd Governor of Rhode Island (d. 1795)\n*1724 – John Smeaton, English engineer, designed the Coldstream Bridge and Perth Bridge (d. 1794)\n*1745 – Caspar Wessel, Norwegian-Danish mathematician and cartographer (d. 1818)\n*1757 – Ercole Consalvi, Italian cardinal (d. 1824)\n*1788 – Charles A. Wickliffe, American politician, 14th Governor of Kentucky (d. 1869)\n*1810 – Robert Schumann, German composer and critic (d. 1856)\n*1829 – John Everett Millais, English painter and illustrator (d. 1896)\n*1831 – Thomas J. Higgins, Canadian-American sergeant, Medal of Honor recipient (d. 1917)\n*1842 – John Q. A. Brackett, American lawyer and politician, 36th Governor of Massachusetts (d. 1918)\n*1851 – Jacques-Arsène d'Arsonval, French physician and physicist (d. 1940)\n*1852 – Guido Banti, Italian physician and pathologist (d. 1925)\n*1854 – Douglas Cameron, Canadian politician, 8th Lieutenant Governor of Manitoba (d. 1921)\n*1855 – George Charles Haité, English painter and illustrator (d. 1924)\n*1859 – Smith Wigglesworth, English evangelist (d. 1947)\n*1860 – Alicia Boole Stott, Irish-English mathematician and theorist (d. 1940)\n*1867 – Frank Lloyd Wright, American architect, designed the Price Tower and Fallingwater (d. 1959)\n*1868 – Robert Robinson Taylor, American architect (d. 1942)\n*1872 – Jan Frans De Boever, Belgian painter and illustrator (d. 1949)\n*1875 – Ernst Enno, Estonian poet and author (d. 1934)\n*1876 – Alexandre Tuffère, Greek-French triple jumper (d. 1958)\n*1885 – Karl Genzken, German physician (d. 1957)\n*1891 – William Funnell, Australian public servant (d. 1962)\n*1893 – Ernst Marcus, German zoologist (d. 1968)\n*  1893   – Gaby Morlay, French actress (d. 1964)\n*1894 – Erwin Schulhoff, Czech composer and pianist (d. 1942)\n*1895 – Santiago Bernabéu Yeste, Spanish footballer and manager (d. 1978)\n*1897 – John G. Bennett, English mathematician and technologist (d. 1974)\n*1899 – Eugène Lapierre, Canadian organist, composer and arts administrator (d. 1970)\n*1900 – Lena Baker, African-American maid executed for capital murder, later pardoned posthumously (d. 1945) \n*1903 – Ralph Yarborough, American colonel and politician (d. 1996)\n*  1903   – Marguerite Yourcenar, Belgian-French author and poet (d. 1987)\n*1910 – C. C. Beck, American illustrator (d. 1989)\n*  1910   – John W. Campbell, American journalist and author (d. 1971)\n*  1910   – Fernand Fonssagrives, French-American photographer, sculptor, and painter (d. 2003)\n*1911 – Edmundo Rivero, Argentinian singer-songwriter (d. 1986)\n*1912 – Wilhelmina Barns-Graham, British abstract painter (d. 2004)\n*1912 – Maurice Bellemare, Canadian lawyer and politician (d. 1989)\n*  1912   – Harry Holtzman, American painter (d. 1987)\n*1915 – Kayyar Kinhanna Rai, Indian journalist, author, and poet (d. 2015)\n*1916 – Francis Crick, English biologist, biophysicist, and neuroscientist, Nobel Prize laureate (d. 2004)\n*  1916   – Luigi Comencini, Italian director and screenwriter (d. 2007)\n*  1916   – Richard Pousette-Dart, American painter and educator (d. 1992)\n*1917 – Byron White, American football player and judge (d. 2002)\n*1918 – George Edward Hughes, Irish-New Zealand philosopher and logician (d. 1994)\n*  1918   – Robert Preston, American captain, actor, and singer (d. 1987)\n*  1918   – John D. Roberts, American chemist and academic (d. 2016)\n*  1918   – John H. Ross, American captain and pilot (d. 2013)\n*1919 – John R. Deane, Jr., American general (d. 2013)\n*1920 – Gwen Harwood, Australian poet and playwright (d. 1995)\n*1921 – Gordon McLendon, American broadcaster and businessman (d. 1986)\n*  1921   – Olga Nardone, American actress (d. 2010)\n*  1921   – LeRoy Neiman, American soldier and painter (d. 2012)\n*  1921   – Alexis Smith, Canadian-born American actress and singer (d. 1993)\n*  1921   – Suharto, Indonesian soldier and politician, 2nd President of Indonesia (d. 2008)\n*1924 – Billie Dawe, Canadian ice hockey player and manager (d. 2013)\n*  1924   – Kenneth Waltz, American political scientist and academic (d. 2013)\n*1925 – Barbara Bush, American wife of George H. W. Bush, 41st First Lady of the United States\n*1927 – Jerry Stiller, American actor, comedian and producer\n*1929 – Nada Inada, Japanese psychiatrist and author (d. 2013)\n*1930 – Robert Aumann, German-American mathematician and economist, Nobel Prize laureate\n*  1930   – Marcel Léger, Canadian lawyer and politician (d. 1993)\n*1931 – James Goldstone, American director and screenwriter (d. 1999)\n*  1931   – Dana Wynter, British actress (d. 2011)\n*1932 – Ray Illingworth, English cricketer and sportscaster\n*  1932   – Ian Kirkwood, Lord Kirkwood, Scottish lawyer and judge (d. 2017)\n*1933 – Rommie Loudd, American football player and coach (d. 1998)\n*  1933   – Joan Rivers, American comedian, actress, and television host (d. 2014)\n*  1933   – Robert Stevens, English lawyer and academic\n*1934 – Millicent Martin, English actress and singer\n*1935 – Molade Okoya-Thomas, Nigerian businessman and philanthropist (d. 2015)\n*1936 – James Darren, American actor\n*  1936   – Kenneth G. Wilson, American physicist and academic, Nobel Prize laureate (d. 2013)\n*1937 – Gillian Clarke, Welsh poet and playwright\n*1938 – Angelo Amato, Italian cardinal\n*1939 – Herb Adderley, American football player\n*1940 – Nancy Sinatra, American singer and actress\n*1941 – Robert Bradford, Northern Irish politician and activist (d. 1981)\n*  1941   – George Pell, Australian cardinal\n*1942 – Nikos Konstantopoulos, Greek politician, Greek Minister of the Interior\n*  1942   – Doug Mountjoy, Welsh snooker player\n*1943 – Colin Baker, English actor\n*  1943   – William Calley, American lieutenant\n*  1943   – Willie Davenport, American colonel and hurdler (d. 2002)\n*  1943   – Peter Eggert, German footballer and manager\n*  1943   – Pierre-André Fournier, Roman Catholic archbishop (d. 2015)\n*1944 – Mark Belanger, American baseball player (d. 1998)\n*  1944   – Marc Ouellet, Canadian cardinal \n*  1944   – Boz Scaggs, American singer-songwriter and guitarist \n*1945 – Steven Fromholz, American singer-songwriter, producer, and poet (d. 2014)\n*  1945   – Derek Underwood, English cricketer\n*1946 – Graham Henry, New Zealand rugby player and coach\n*1947 – Annie Haslam, English singer-songwriter and painter \n*  1947   – Sara Paretsky, American author\n*  1947   – Eric F. Wieschaus, American biologist, geneticist, and academic Nobel Prize laureate\n*1949 – Emanuel Ax, Polish-American pianist and educator\n*  1949   – Hildegard Falck, German runner\n*1950 – Kathy Baker, American actress\n*  1950   – Sônia Braga, Brazilian actress and producer\n*1951 – Tony Rice, American guitarist and songwriter \n*  1951   – Bonnie Tyler, Welsh singer-songwriter\n*1953 – Billy Hayes, English union leader\n*  1953   – Sandy Nairne, English historian and curator\n*  1953   – Ivo Sanader, Croatian historian and politician, 8th Prime Minister of Croatia\n*  1953   – Olav Stedje, Norwegian singer-songwriter\n*1954 – Greg Ginn, American punk rock guitarist, singer, and songwriter (Black Flag)\n*  1954   – Kiril of Varna, Bulgarian metropolitan (d. 2013)\n*  1954   – Sergei Storchak, Ukrainian-Russian politician\n*1955 – Tim Berners-Lee, English computer scientist, best known as the inventor of the World Wide Web\n*  1955   – José Antonio Camacho, Spanish footballer and manager\n*  1955   – Griffin Dunne, American actor, director, and producer\n*1956 – Udo Bullmann, German politician\n*  1956   – Jonathan Potter, English psychologist, sociolinguist, and academic\n*1957 – Scott Adams, American author and illustrator\n*  1957   – Don Robinson, American baseball player and politician\n*  1957   – Sonja Vectomov, Czech/Finnish sculptor\n*1958 – Louise Richardson, Irish political scientist and academic\n*  1958   – Keenen Ivory Wayans, American actor, director, and screenwriter\n*1959 – Mohsen Kadivar, Iranian philosopher\n*1960 – Mick Hucknall, English singer-songwriter \n*  1960   – Terje Gewelt, Norwegian bassist\n*  1960   – Thomas Steen, Swedish ice hockey player and coach\n*1962 – John Gibbons, American baseball player and manager\n*  1962   – Andreas Keim, German footballer\n*  1962   – Nick Rhodes, English keyboard player and producer \n*1963 – Karen Kingsbury, American journalist and author\n*  1963   – Antoaneta Todorova, Bulgarian javelin thrower\n*1964 – Butch Reynolds, American runner and coach\n*1965 – Kevin Farley, American screenwriter\n*  1965   – Rob Pilatus, German model, dancer and singer (Milli Vanilli) (d. 1998)\n*1966 – Julianna Margulies, American actress\n*  1966   – Doris Pearson, English singer-songwriter and choreographer \n*1967 – Russell E. Morris, Professor of Materials Chemistry at the University of St Andrews\n*1968 – Rob Ray, Canadian ice hockey player and sportscaster\n*1969 – David Barnhill, Australian rugby league player and coach\n*  1969   – J. P. Manoux, American actor\n*  1969   – Marcos Siega, American director and producer\n*1970 – Gabrielle Giffords, American businesswoman and politician\n*  1970   – Kwame Kilpatrick, American educator and politician, 68th Mayor of Detroit\n*  1970   – Steve Renouf, Australian rugby league player and sportscaster\n*  1970   – Troy Vincent, American football player\n*1971 – Mark Feuerstein, American actor, director, and producer\n*1972 – Christian Mayrleb, Austrian footballer\n*1973 – Lexa Doig, Canadian model and actress\n*  1973   – Bryant Reeves, American basketball player\n*1974 – Pål Arne Fagernes, Norwegian javelin thrower (d. 2003)\n*  1974   – Lauren Burns, Australian taekwondo practitioner \n*  1974   – Alma Lepina, Latvian figure skater\n*1975 – Emm Gryner, Canadian singer-songwriter\n*  1975   – Bryan McCabe, Canadian-American ice hockey player\n*  1975   – Mark Ricciuto, Australian footballer and sportscaster\n*  1975   – Shilpa Shetty, Indian actress and producer\n*1976 – Lindsay Davenport, American tennis player and coach\n*  1976   – Kenji Johjima, Japanese baseball player\n*  1976   – Catherine McKinnell, English lawyer and politician\n*1977 – Kanye West, American rapper, producer, director, and fashion designer \n*1978 – Eun Ji-won, South Korean rapper, dancer, and producer \n*  1978   – Maria Menounos, American television journalist\n*1979 – Alexei Kozlov, Estonian figure skater\n*  1979   – Pete Orr, Canadian-American baseball player\n*  1979   – Derek Trucks, American guitarist and songwriter \n*  1979   – Adine Wilson, New Zealand netball player\n*  1979   – Rob Holliday, American singer-songwriter and bass player \n*  1979   – İpek Şenoğlu, Turkish tennis player\n*1980 – Gustavo Manduca, Brazilian footballer\n*  1980   – Jamie Spencer, Irish jockey\n*1981 – Alex Band, American singer-songwriter, guitarist, and producer\n*  1981   – Matteo Meneghello, Italian race car driver\n*  1981   – Sara Watkins, American singer-songwriter and fiddler \n*1982 – Matteo Barbini, Italian rugby player\n*  1982   – Michael Cammalleri, Canadian ice hockey player\n*  1982   – Dickson Etuhu, Nigerian footballer\n*  1982   – Irina Lăzăreanu, Romanian-Canadian model and singer\n*  1982   – Nadia Petrova, Russian tennis player\n*1983 – Gaines Adams, American football player (d. 2010)\n*  1983   – Kim Clijsters, Belgian tennis player\n*  1983   – Pantelis Kapetanos, Greek footballer\n*  1983   – Coby Karl, American basketball player\n*1984 – Javier Mascherano, Argentinian footballer\n*1985 – Alexandre Despatie, Canadian diver\n*1986 – Patrick Kaleta, American ice hockey player\n*  1986   – Andrej Sekera, Slovak ice hockey player\n*1987 – Coralie Balmy, French swimmer \n*  1987   – Issiar Dia, Senegalese footballer\n*1989 – Timea Bacsinszky, Swiss tennis player\n*  1989   – Mitchell Schwartz, American football player\n*1990 – Todd Barclay, New Zealand politician\n*  1990   – Mickey Bushell, English wheelchair racer\n*1992 – Sebá, Brazilian footballer\n*1996 – Doğanay Kılıç, Turkish footballer\n*1997 – Jeļena Ostapenko, Latvian tennis player\n*2004 – Francesca Capaldi, American actress\n\nDeaths\n\n* 632 – Muhammad, the central figure of Islam, widely regarded as its founder (b. 570/571)\n* 696 – Chlodulf, bishop of Metz (or 697)\n* 951 – Zhao Ying, Chinese chancellor (b. 885)\n*1042 – Harthacnut, English-Danish king (b. 1018)\n*1154 – William of York, English archbishop and saint\n*1290 – Beatrice Portinari, object of Dante Alighieri's adoration (b. 1266)\n*1376 – Edward, the Black Prince, English son of Edward III of England (b. 1330)\n*1383 – Thomas de Ros, 4th Baron de Ros, English politician (b. 1338)\n*1384 – Kan'ami, Japanese actor and playwright (b. 1333)\n*1405 – Richard le Scrope, Archbishop of York (b. c.1350)\n*  1405   – Thomas de Mowbray, 4th Earl of Norfolk (b. 1385)\n*1476 – George Neville, English archbishop and academic (b. 1432)\n*1492 – Elizabeth Woodville, Queen consort of England (b. 1437)\n*1501 – George Gordon, 2nd Earl of Huntly, Earl of Huntly and Lord Chancellor of Scotland (b. 1440)\n*1505 – Hongzhi Emperor of China (b. 1470)\n*1600 – Edward Fortunatus, German nobleman (b. 1565)\n*1611 – Jean Bertaut, French bishop and poet (b. 1552)\n*1612 – Hans Leo Hassler, German organist and composer (b. 1562)\n*1621 – Anne de Xainctonge, French saint, founded the Society of the Sisters of Saint Ursula of the Blessed Virgin (b. 1567)\n*1628 – Rudolph Goclenius, German lexicographer and philosopher (b. 1547)\n*1651 – Tokugawa Iemitsu, Japanese shogun (b. 1604)\n*1714 – Sophia of Hanover (b. 1630)\n*1716 – Johann Wilhelm, Elector Palatine, German son of Landgravine Elisabeth Amalie of Hesse-Darmstadt (b. 1658)\n*1727 – August Hermann Francke, German-Lutheran pietist, philanthropist, and scholar (b. 1663)\n*1768 – Johann Joachim Winckelmann, German archaeologist and scholar (b. 1717)\n*1771 – George Montagu-Dunk, 2nd Earl of Halifax, English politician, Lord Lieutenant of Ireland (b. 1716)\n*1795 – Louis XVII of France (b. 1785)\n*1809 – Thomas Paine, English-American theorist and author (b. 1737)\n*1831 – Sarah Siddons, Welsh actress (b. 1755)\n*1835 – Gian Domenico Romagnosi, Italian economist and jurist (b. 1761)\n*1845 – Andrew Jackson, American general, judge, and politician, 7th President of the United States (b. 1767) \n*1846 – Rodolphe Töpffer, Swiss teacher, author, painter, cartoonist, and caricaturist (b. 1799)\n*1857 – Douglas William Jerrold, English journalist and playwright (b. 1803)\n*1874 – Cochise, American tribal chief (b. 1805)\n*1876 – George Sand, French author and playwright (b. 1804)\n*1885 – Ignace Bourget, Canadian bishop (b. 1799)\n*1889 – Gerard Manley Hopkins, English poet (b. 1844)\n*1899 – Mary of the Divine Heart, German nun and saint (b. 1863)\n*1924 – Andrew Irvine, English mountaineer and explorer (b. 1902)\n*  1924   – George Mallory, English lieutenant and mountaineer (b. 1886)\n*1929 – Bliss Carman, Canadian-American poet and playwright (b. 1861)\n*1945 – Karl Hanke, Polish-German soldier and politician (b. 1903)\n*1951 – Eugène Fiset, Canadian physician, general, and politician, 18th Lieutenant Governor of Quebec (b. 1874)\n*  1951   – Oswald Pohl, German SS officer (b. 1892)\n*1956 – Marie Laurencin, French painter and sculptor (b. 1883)\n*1959 – Leslie Johnson, English race car driver (b. 1912)\n*1965 – Edmondo Rossoni, Italian politician (b. 1884)\n*1966 – Anton Melik, Slovenian geographer and academic (b. 1890)\n*1968 – Elizabeth Enright, American author and illustrator (b. 1909)\n*  1968   – Ludovico Scarfiotti, Italian race car driver (b. 1933)\n*1969 – Arunachalam Mahadeva, Sri Lankan politician and diplomat (b. 1885)\n*  1969   – Robert Taylor, American actor and singer (b. 1911)\n*1970 – Abraham Maslow, American psychologist and academic (b. 1908)\n*1971 – J.I. Rodale, American author and playwright (b. 1898)\n*1976 – Thorleif Schjelderup-Ebbe, Norwegian zoologist and psychologist (b. 1894)\n*1982 – Satchel Paige, American baseball player and coach (b. 1906)\n*1984 – Gordon Jacob, English composer and academic (b. 1895)\n*1987 – Alexander Iolas, Egyptian-American art collector (b. 1907)\n*1997 – George Turner, Australian author and critic (b. 1916)\n*  1997   – Karen Wetterhahn, American chemist and academic (b. 1948)\n*1998 – Sani Abacha, Nigerian general and politician, 10th President of Nigeria (b. 1943)\n*  1998   – Maria Reiche, German mathematician and archaeologist (b. 1903)\n*2000 – Jeff MacNelly, American cartoonist (b. 1948)\n*2001 – Alex de Renzy, American director and producer (b. 1935)\n*2004 – Charles Hyder, American astrophysicist and academic (b. 1930)\n*2004 – Mack Jones, American baseball player (b. 1938)\n*2006 – Jaxon, American illustrator and publisher, co-founded Rip Off Press (b. 1941)\n*  2006   – Matta El Meskeen, Egyptian monk, theologian, and author (b. 1919)\n*2008 – Šaban Bajramović, Serbian singer-songwriter (b. 1936)\n*2009 – Omar Bongo, Gabonese captain and politician, President of Gabon (b. 1935)\n*2010 – Crispian St. Peters, English singer-songwriter (b. 1939)\n*2012 – Pete Brennan, American basketball player (b. 1936)\n*  2012   – Charles E. M. Pearce, New Zealand-Australian mathematician and academic (b. 1940)\n*  2012   – Ghassan Tueni, Lebanese journalist, academic, and politician (b. 1926)\n*2013 – Paul Cellucci, American soldier and politician, 69th Governor of Massachusetts (b. 1948)\n*  2013   – Yoram Kaniuk,  Israeli painter, journalist, and critic (b. 1930)\n*  2013   – Taufiq Kiemas, Indonesian politician, 5th First Spouse of Indonesia (b. 1942)\n*2014 – Alexander Imich, Polish-American chemist, parapsychologist, and academic (b. 1903)\n*  2014   – Yoshihito, Prince Katsura of Japan (b. 1948)\n*2015 – Chea Sim, Cambodian commander and politician (b. 1932)\n\nHolidays and observances\n\n* Christian feast day:\n** Blessed Mariam Thresia Chiramel Mankidiyan\n** Blessed Mary of the Divine Heart (Droste zu Vischering)\n** Chlodulf of Metz\n** Jacques Berthieu, S.J.\n** Jadwiga (Hedwig) of Poland\n** Medard\n** Melania the Elder\n** Roland Allen (Episcopal Church (USA))\n** Thomas Ken (Church of England)\n** William of York\n** June 8 (Eastern Orthodox liturgics)\n* Earliest day on which Queen's Birthday can fall, while June 14 is the latest; celebrated on the second Monday in June. (Australia, except Western Australia and Queensland)\n* Bounty Day (Norfolk Island)\n* Caribbean American HIV/AIDS Awareness Day\n* Engineer's Day (Peru)\n* Pranav Sivakumar Day (Illinois, United States)\n* Primož Trubar Day (Slovenia)\n* World Brain Tumor Day\n* World Oceans Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "June 8" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15864" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 218 – Battle of Antioch: With the support of the Syrian legions, Elagabalus defeats the forces of emperor Macrinus. He flees, but is captured near Chalcedon and later executed in Cappadocia.\n* 632 – Muhammad, Islamic prophet, dies in Medina. \n* 793 – Vikings raid the abbey at Lindisfarne in Northumbria, commonly accepted as the beginning of Norse activity in the British Isles.\n*1042 – Edward the Confessor becomes King of England, one of the last Anglo-Saxon kings of England.\n*1191 – Richard I arrives in Acre, beginning his crusade.\n*1405 – Richard le Scrope, the Archbishop of York, and Thomas Mowbray, Earl of Norfolk, are executed in York on Henry IV's orders.\n*1776 – American Revolutionary War: American attackers are driven back at the Battle of Trois-Rivières.\n*1783 – Laki, a volcano in Iceland, begins an eight-month eruption which kills over 9,000 people and starts a seven-year famine.\n*1789 – James Madison introduces twelve proposed amendments to the United States Constitution in Congress.\n*1794 – Robespierre inaugurates the French Revolution's new state religion, the Cult of the Supreme Being, with large organized festivals all across France.\n*1856 – A group of 194 Pitcairn Islanders, descendants of the mutineers of , arrives at Norfolk Island, commencing the Third Settlement of the Island.\n*1861 – American Civil War: Tennessee secedes from the Union.\n*1862 – American Civil War: Battle of Cross Keys: Confederate forces under General Stonewall Jackson save the Army of Northern Virginia from a Union assault on the James Peninsula led by General George B. McClellan.\n*1867 – Coronation of Franz Joseph as King of Hungary following the Austro-Hungarian compromise (Ausgleich).\n*1887 – Herman Hollerith applies for US patent #395,781 for the 'Art of Compiling Statistics', which was his punched card calculator.\n*1906 – Theodore Roosevelt signs the Antiquities Act into law, authorizing the President to restrict the use of certain parcels of public land with historical or conservation value.\n*1912 – Carl Laemmle incorporates Universal Pictures.\n*1918 – A solar eclipse is observed at Baker City, Oregon by scientists and an artist hired by the United States Navy.\n*1928 – Second Northern Expedition: The National Revolutionary Army captures Peking, whose name is changed to Beijing (\"Northern Capital\").\n*1929 – Margaret Bondfield is appointed Minister of Labour. She is the first woman appointed to the Cabinet of the United Kingdom.\n*1940 – World War II: The completion of Operation Alphabet, the evacuation of Allied forces from Narvik at the end of the Norwegian Campaign.\n*1941 – World War II: The Allies commence the Syria–Lebanon Campaign against the possessions of Vichy France in the Levant.\n*1942 – World War II: The Japanese imperial submarines I-21 and I-24 shell the Australian cities of Sydney and Newcastle.\n*1949 – Helen Keller, Dorothy Parker, Danny Kaye, Fredric March, John Garfield, Paul Muni and Edward G. Robinson are named in an FBI report as Communist Party members.\n*  1949   – George Orwell's Nineteen Eighty-Four is published.\n*1953 – An F5 tornado hits Beecher, Michigan, killing 116, injuring 844, and destroying 340 homes.\n*  1953   – The United States Supreme Court rules that restaurants in Washington, D.C. cannot refuse to serve black patrons.\n*1959 – The  and United States Postal Service attempt the delivery of mail via Missile Mail.\n*1966 – An F-104 Starfighter collides with XB-70 Valkyrie prototype no. 2, destroying both aircraft during a photo shoot near Edwards Air Force Base. Joseph A. Walker, a NASA test pilot, and Carl Cross, a United States Air Force test pilot, are both killed.\n*  1966   – Topeka, Kansas, is devastated by a tornado that registers as an \"F5\" on the Fujita scale: The first to exceed US$100 million in damages. Sixteen people are killed, hundreds more injured, and thousands of homes damaged or destroyed.\n*  1966   – The National Football League and American Football League announced a merger effective in 1970.\n*1967 – Six-Day War: The USS Liberty incident occurs, killing 34 and wounding 171.\n*1972 – Vietnam War: Nine-year-old Phan Thị Kim Phúc is burned by napalm, an event captured by Associated Press photographer Nick Ut moments later while the young girl is seen running down a road, in what would become an iconic, Pulitzer Prize-winning photo.\n*1982 – Bluff Cove Air Attacks during the Falklands War:  Fifty-six British servicemen are killed by an Argentine air attack on two landing ships, RFA Sir Galahad and .\n*1984 – Homosexuality is declared legal in the Australian state of New South Wales.\n*1987 – New Zealand's Labour government establishes a national nuclear-free zone under the New Zealand Nuclear Free Zone, Disarmament, and Arms Control Act 1987.\n*1992 – The first World Oceans Day is celebrated, coinciding with the Earth Summit held in Rio de Janeiro, Brazil.\n*1995 – Downed U.S. Air Force pilot Captain Scott O'Grady is rescued by U.S. Marines in Bosnia.\n*2001 – Mamoru Takuma kills eight and injures 15 in a mass stabbing at an elementary school in the Osaka Prefecture of Japan.\n*2004 – The first Venus Transit in well over a century takes place, the previous one being in 1882.\n*2007 – Newcastle, New South Wales, Australia, is hit by the State's worst storms and flooding in 30 years resulting in the death of nine people and the grounding of a trade ship, the .\n*2008 – At least 37 miners go missing after an explosion in an Ukrainian coal mine causes it to collapse.\n*  2008   – At least seven people are killed and ten injured in a stabbing spree in Tokyo, Japan.\n*2009 – Two American journalists are found guilty of illegally entering North Korea and sentenced to 12 years of penal labour.\n*2014 – At least 28 people are killed in an attack at Jinnah International Airport, Karachi, Pakistan.\n*2017 – YouTuber Randy Stair aka Andrew Blaze shoots and kills three of his Weis Markets coworkers as well as himself in a Columbine-inspired attack after releasing his manifesto in the form of several files and videos involving his flash animation series based on a minor character from Nickolodeon's Danny Phantom cartoon.\n\nBirths\n\n* 862 – Emperor Xizong of Tang (d. 888)\n*1236 – Violant of Aragon, queen consort of Castile and León (d. 1301)\n*1332 – Cangrande II della Scala, Lord of Verona (d. 1359)\n*1508 – Primož Trubar, Slovenian Protestant reformer (d. 1586)\n*1552 – Gabriello Chiabrera, Italian poet and author (d. 1638)\n*1593 – George I Rákóczi, prince of Transylvania (d. 1648)\n*1625 – Giovanni Domenico Cassini, Italian-French mathematician and astronomer (d. 1712)\n*1671 – Tomaso Albinoni, Italian violinist and composer (d. 1751)\n*1717 – John Collins, American lawyer and politician, 3rd Governor of Rhode Island (d. 1795)\n*1724 – John Smeaton, English engineer, designed the Coldstream Bridge and Perth Bridge (d. 1794)\n*1745 – Caspar Wessel, Norwegian-Danish mathematician and cartographer (d. 1818)\n*1757 – Ercole Consalvi, Italian cardinal (d. 1824)\n*1788 – Charles A. Wickliffe, American politician, 14th Governor of Kentucky (d. 1869)\n*1810 – Robert Schumann, German composer and critic (d. 1856)\n*1829 – John Everett Millais, English painter and illustrator (d. 1896)\n*1831 – Thomas J. Higgins, Canadian-American sergeant, Medal of Honor recipient (d. 1917)\n*1842 – John Q. A. Brackett, American lawyer and politician, 36th Governor of Massachusetts (d. 1918)\n*1851 – Jacques-Arsène d'Arsonval, French physician and physicist (d. 1940)\n*1852 – Guido Banti, Italian physician and pathologist (d. 1925)\n*1854 – Douglas Cameron, Canadian politician, 8th Lieutenant Governor of Manitoba (d. 1921)\n*1855 – George Charles Haité, English painter and illustrator (d. 1924)\n*1859 – Smith Wigglesworth, English evangelist (d. 1947)\n*1860 – Alicia Boole Stott, Irish-English mathematician and theorist (d. 1940)\n*1867 – Frank Lloyd Wright, American architect, designed the Price Tower and Fallingwater (d. 1959)\n*1868 – Robert Robinson Taylor, American architect (d. 1942)\n*1872 – Jan Frans De Boever, Belgian painter and illustrator (d. 1949)\n*1875 – Ernst Enno, Estonian poet and author (d. 1934)\n*1876 – Alexandre Tuffère, Greek-French triple jumper (d. 1958)\n*1885 – Karl Genzken, German physician (d. 1957)\n*1891 – William Funnell, Australian public servant (d. 1962)\n*1893 – Ernst Marcus, German zoologist (d. 1968)\n*  1893   – Gaby Morlay, French actress (d. 1964)\n*1894 – Erwin Schulhoff, Czech composer and pianist (d. 1942)\n*1895 – Santiago Bernabéu Yeste, Spanish footballer and manager (d. 1978)\n*1897 – John G. Bennett, English mathematician and technologist (d. 1974)\n*1899 – Eugène Lapierre, Canadian organist, composer and arts administrator (d. 1970)\n*1900 – Lena Baker, African-American maid executed for capital murder, later pardoned posthumously (d. 1945) \n*1903 – Ralph Yarborough, American colonel and politician (d. 1996)\n*  1903   – Marguerite Yourcenar, Belgian-French author and poet (d. 1987)\n*1910 – C. C. Beck, American illustrator (d. 1989)\n*  1910   – John W. Campbell, American journalist and author (d. 1971)\n*  1910   – Fernand Fonssagrives, French-American photographer, sculptor, and painter (d. 2003)\n*1911 – Edmundo Rivero, Argentinian singer-songwriter (d. 1986)\n*1912 – Wilhelmina Barns-Graham, British abstract painter (d. 2004)\n*1912 – Maurice Bellemare, Canadian lawyer and politician (d. 1989)\n*  1912   – Harry Holtzman, American painter (d. 1987)\n*1915 – Kayyar Kinhanna Rai, Indian journalist, author, and poet (d. 2015)\n*1916 – Francis Crick, English biologist, biophysicist, and neuroscientist, Nobel Prize laureate (d. 2004)\n*  1916   – Luigi Comencini, Italian director and screenwriter (d. 2007)\n*  1916   – Richard Pousette-Dart, American painter and educator (d. 1992)\n*1917 – Byron White, American football player and judge (d. 2002)\n*1918 – George Edward Hughes, Irish-New Zealand philosopher and logician (d. 1994)\n*  1918   – Robert Preston, American captain, actor, and singer (d. 1987)\n*  1918   – John D. Roberts, American chemist and academic (d. 2016)\n*  1918   – John H. Ross, American captain and pilot (d. 2013)\n*1919 – John R. Deane, Jr., American general (d. 2013)\n*1920 – Gwen Harwood, Australian poet and playwright (d. 1995)\n*1921 – Gordon McLendon, American broadcaster and businessman (d. 1986)\n*  1921   – Olga Nardone, American actress (d. 2010)\n*  1921   – LeRoy Neiman, American soldier and painter (d. 2012)\n*  1921   – Alexis Smith, Canadian-born American actress and singer (d. 1993)\n*  1921   – Suharto, Indonesian soldier and politician, 2nd President of Indonesia (d. 2008)\n*1924 – Billie Dawe, Canadian ice hockey player and manager (d. 2013)\n*  1924   – Kenneth Waltz, American political scientist and academic (d. 2013)\n*1925 – Barbara Bush, American wife of George H. W. Bush, 41st First Lady of the United States\n*1927 – Jerry Stiller, American actor, comedian and producer\n*1929 – Nada Inada, Japanese psychiatrist and author (d. 2013)\n*1930 – Robert Aumann, German-American mathematician and economist, Nobel Prize laureate\n*  1930   – Marcel Léger, Canadian lawyer and politician (d. 1993)\n*1931 – James Goldstone, American director and screenwriter (d. 1999)\n*  1931   – Dana Wynter, British actress (d. 2011)\n*1932 – Ray Illingworth, English cricketer and sportscaster\n*  1932   – Ian Kirkwood, Lord Kirkwood, Scottish lawyer and judge (d. 2017)\n*1933 – Rommie Loudd, American football player and coach (d. 1998)\n*  1933   – Joan Rivers, American comedian, actress, and television host (d. 2014)\n*  1933   – Robert Stevens, English lawyer and academic\n*1934 – Millicent Martin, English actress and singer\n*1935 – Molade Okoya-Thomas, Nigerian businessman and philanthropist (d. 2015)\n*1936 – James Darren, American actor\n*  1936   – Kenneth G. Wilson, American physicist and academic, Nobel Prize laureate (d. 2013)\n*1937 – Gillian Clarke, Welsh poet and playwright\n*1938 – Angelo Amato, Italian cardinal\n*1939 – Herb Adderley, American football player\n*1940 – Nancy Sinatra, American singer and actress\n*1941 – Robert Bradford, Northern Irish politician and activist (d. 1981)\n*  1941   – George Pell, Australian cardinal\n*1942 – Nikos Konstantopoulos, Greek politician, Greek Minister of the Interior\n*  1942   – Doug Mountjoy, Welsh snooker player\n*1943 – Colin Baker, English actor\n*  1943   – William Calley, American lieutenant\n*  1943   – Willie Davenport, American colonel and hurdler (d. 2002)\n*  1943   – Peter Eggert, German footballer and manager\n*  1943   – Pierre-André Fournier, Roman Catholic archbishop (d. 2015)\n*1944 – Mark Belanger, American baseball player (d. 1998)\n*  1944   – Marc Ouellet, Canadian cardinal \n*  1944   – Boz Scaggs, American singer-songwriter and guitarist \n*1945 – Steven Fromholz, American singer-songwriter, producer, and poet (d. 2014)\n*  1945   – Derek Underwood, English cricketer\n*1946 – Graham Henry, New Zealand rugby player and coach\n*1947 – Annie Haslam, English singer-songwriter and painter \n*  1947   – Sara Paretsky, American author\n*  1947   – Eric F. Wieschaus, American biologist, geneticist, and academic Nobel Prize laureate\n*1949 – Emanuel Ax, Polish-American pianist and educator\n*  1949   – Hildegard Falck, German runner\n*1950 – Kathy Baker, American actress\n*  1950   – Sônia Braga, Brazilian actress and producer\n*1951 – Tony Rice, American guitarist and songwriter \n*  1951   – Bonnie Tyler, Welsh singer-songwriter\n*1953 – Billy Hayes, English union leader\n*  1953   – Sandy Nairne, English historian and curator\n*  1953   – Ivo Sanader, Croatian historian and politician, 8th Prime Minister of Croatia\n*  1953   – Olav Stedje, Norwegian singer-songwriter\n*1954 – Greg Ginn, American punk rock guitarist, singer, and songwriter (Black Flag)\n*  1954   – Kiril of Varna, Bulgarian metropolitan (d. 2013)\n*  1954   – Sergei Storchak, Ukrainian-Russian politician\n*1955 – Tim Berners-Lee, English computer scientist, best known as the inventor of the World Wide Web\n*  1955   – José Antonio Camacho, Spanish footballer and manager\n*  1955   – Griffin Dunne, American actor, director, and producer\n*1956 – Udo Bullmann, German politician\n*  1956   – Jonathan Potter, English psychologist, sociolinguist, and academic\n*1957 – Scott Adams, American author and illustrator\n*  1957   – Don Robinson, American baseball player and politician\n*  1957   – Sonja Vectomov, Czech/Finnish sculptor\n*1958 – Louise Richardson, Irish political scientist and academic\n*  1958   – Keenen Ivory Wayans, American actor, director, and screenwriter\n*1959 – Mohsen Kadivar, Iranian philosopher\n*1960 – Mick Hucknall, English singer-songwriter \n*  1960   – Terje Gewelt, Norwegian bassist\n*  1960   – Thomas Steen, Swedish ice hockey player and coach\n*1962 – John Gibbons, American baseball player and manager\n*  1962   – Andreas Keim, German footballer\n*  1962   – Nick Rhodes, English keyboard player and producer \n*1963 – Karen Kingsbury, American journalist and author\n*  1963   – Antoaneta Todorova, Bulgarian javelin thrower\n*1964 – Butch Reynolds, American runner and coach\n*1965 – Kevin Farley, American screenwriter\n*  1965   – Rob Pilatus, German model, dancer and singer (Milli Vanilli) (d. 1998)\n*1966 – Julianna Margulies, American actress\n*  1966   – Doris Pearson, English singer-songwriter and choreographer \n*1967 – Russell E. Morris, Professor of Materials Chemistry at the University of St Andrews\n*1968 – Rob Ray, Canadian ice hockey player and sportscaster\n*1969 – David Barnhill, Australian rugby league player and coach\n*  1969   – J. P. Manoux, American actor\n*  1969   – Marcos Siega, American director and producer\n*1970 – Gabrielle Giffords, American businesswoman and politician\n*  1970   – Kwame Kilpatrick, American educator and politician, 68th Mayor of Detroit\n*  1970   – Steve Renouf, Australian rugby league player and sportscaster\n*  1970   – Troy Vincent, American football player\n*1971 – Mark Feuerstein, American actor, director, and producer\n*1972 – Christian Mayrleb, Austrian footballer\n*1973 – Lexa Doig, Canadian model and actress\n*  1973   – Bryant Reeves, American basketball player\n*1974 – Pål Arne Fagernes, Norwegian javelin thrower (d. 2003)\n*  1974   – Lauren Burns, Australian taekwondo practitioner \n*  1974   – Alma Lepina, Latvian figure skater\n*1975 – Emm Gryner, Canadian singer-songwriter\n*  1975   – Bryan McCabe, Canadian-American ice hockey player\n*  1975   – Mark Ricciuto, Australian footballer and sportscaster\n*  1975   – Shilpa Shetty, Indian actress and producer\n*1976 – Lindsay Davenport, American tennis player and coach\n*  1976   – Kenji Johjima, Japanese baseball player\n*  1976   – Catherine McKinnell, English lawyer and politician\n*1977 – Kanye West, American rapper, producer, director, and fashion designer \n*1978 – Eun Ji-won, South Korean rapper, dancer, and producer \n*  1978   – Maria Menounos, American television journalist\n*1979 – Alexei Kozlov, Estonian figure skater\n*  1979   – Pete Orr, Canadian-American baseball player\n*  1979   – Derek Trucks, American guitarist and songwriter \n*  1979   – Adine Wilson, New Zealand netball player\n*  1979   – Rob Holliday, American singer-songwriter and bass player \n*  1979   – İpek Şenoğlu, Turkish tennis player\n*1980 – Gustavo Manduca, Brazilian footballer\n*  1980   – Jamie Spencer, Irish jockey\n*1981 – Alex Band, American singer-songwriter, guitarist, and producer\n*  1981   – Matteo Meneghello, Italian race car driver\n*  1981   – Sara Watkins, American singer-songwriter and fiddler \n*1982 – Matteo Barbini, Italian rugby player\n*  1982   – Michael Cammalleri, Canadian ice hockey player\n*  1982   – Dickson Etuhu, Nigerian footballer\n*  1982   – Irina Lăzăreanu, Romanian-Canadian model and singer\n*  1982   – Nadia Petrova, Russian tennis player\n*1983 – Gaines Adams, American football player (d. 2010)\n*  1983   – Kim Clijsters, Belgian tennis player\n*  1983   – Pantelis Kapetanos, Greek footballer\n*  1983   – Coby Karl, American basketball player\n*1984 – Javier Mascherano, Argentinian footballer\n*1985 – Alexandre Despatie, Canadian diver\n*1986 – Patrick Kaleta, American ice hockey player\n*  1986   – Andrej Sekera, Slovak ice hockey player\n*1987 – Coralie Balmy, French swimmer \n*  1987   – Issiar Dia, Senegalese footballer\n*1989 – Timea Bacsinszky, Swiss tennis player\n*  1989   – Mitchell Schwartz, American football player\n*1990 – Todd Barclay, New Zealand politician\n*  1990   – Mickey Bushell, English wheelchair racer\n*1992 – Sebá, Brazilian footballer\n*1996 – Doğanay Kılıç, Turkish footballer\n*1997 – Jeļena Ostapenko, Latvian tennis player\n*2004 – Francesca Capaldi, American actress\n\nDeaths\n\n* 632 – Muhammad, the central figure of Islam, widely regarded as its founder (b. 570/571)\n* 696 – Chlodulf, bishop of Metz (or 697)\n* 951 – Zhao Ying, Chinese chancellor (b. 885)\n*1042 – Harthacnut, English-Danish king (b. 1018)\n*1154 – William of York, English archbishop and saint\n*1290 – Beatrice Portinari, object of Dante Alighieri's adoration (b. 1266)\n*1376 – Edward, the Black Prince, English son of Edward III of England (b. 1330)\n*1383 – Thomas de Ros, 4th Baron de Ros, English politician (b. 1338)\n*1384 – Kan'ami, Japanese actor and playwright (b. 1333)\n*1405 – Richard le Scrope, Archbishop of York (b. c.1350)\n*  1405   – Thomas de Mowbray, 4th Earl of Norfolk (b. 1385)\n*1476 – George Neville, English archbishop and academic (b. 1432)\n*1492 – Elizabeth Woodville, Queen consort of England (b. 1437)\n*1501 – George Gordon, 2nd Earl of Huntly, Earl of Huntly and Lord Chancellor of Scotland (b. 1440)\n*1505 – Hongzhi Emperor of China (b. 1470)\n*1600 – Edward Fortunatus, German nobleman (b. 1565)\n*1611 – Jean Bertaut, French bishop and poet (b. 1552)\n*1612 – Hans Leo Hassler, German organist and composer (b. 1562)\n*1621 – Anne de Xainctonge, French saint, founded the Society of the Sisters of Saint Ursula of the Blessed Virgin (b. 1567)\n*1628 – Rudolph Goclenius, German lexicographer and philosopher (b. 1547)\n*1651 – Tokugawa Iemitsu, Japanese shogun (b. 1604)\n*1714 – Sophia of Hanover (b. 1630)\n*1716 – Johann Wilhelm, Elector Palatine, German son of Landgravine Elisabeth Amalie of Hesse-Darmstadt (b. 1658)\n*1727 – August Hermann Francke, German-Lutheran pietist, philanthropist, and scholar (b. 1663)\n*1768 – Johann Joachim Winckelmann, German archaeologist and scholar (b. 1717)\n*1771 – George Montagu-Dunk, 2nd Earl of Halifax, English politician, Lord Lieutenant of Ireland (b. 1716)\n*1795 – Louis XVII of France (b. 1785)\n*1809 – Thomas Paine, English-American theorist and author (b. 1737)\n*1831 – Sarah Siddons, Welsh actress (b. 1755)\n*1835 – Gian Domenico Romagnosi, Italian economist and jurist (b. 1761)\n*1845 – Andrew Jackson, American general, judge, and politician, 7th President of the United States (b. 1767) \n*1846 – Rodolphe Töpffer, Swiss teacher, author, painter, cartoonist, and caricaturist (b. 1799)\n*1857 – Douglas William Jerrold, English journalist and playwright (b. 1803)\n*1874 – Cochise, American tribal chief (b. 1805)\n*1876 – George Sand, French author and playwright (b. 1804)\n*1885 – Ignace Bourget, Canadian bishop (b. 1799)\n*1889 – Gerard Manley Hopkins, English poet (b. 1844)\n*1899 – Mary of the Divine Heart, German nun and saint (b. 1863)\n*1924 – Andrew Irvine, English mountaineer and explorer (b. 1902)\n*  1924   – George Mallory, English lieutenant and mountaineer (b. 1886)\n*1929 – Bliss Carman, Canadian-American poet and playwright (b. 1861)\n*1945 – Karl Hanke, Polish-German soldier and politician (b. 1903)\n*1951 – Eugène Fiset, Canadian physician, general, and politician, 18th Lieutenant Governor of Quebec (b. 1874)\n*  1951   – Oswald Pohl, German SS officer (b. 1892)\n*1956 – Marie Laurencin, French painter and sculptor (b. 1883)\n*1959 – Leslie Johnson, English race car driver (b. 1912)\n*1965 – Edmondo Rossoni, Italian politician (b. 1884)\n*1966 – Anton Melik, Slovenian geographer and academic (b. 1890)\n*1968 – Elizabeth Enright, American author and illustrator (b. 1909)\n*  1968   – Ludovico Scarfiotti, Italian race car driver (b. 1933)\n*1969 – Arunachalam Mahadeva, Sri Lankan politician and diplomat (b. 1885)\n*  1969   – Robert Taylor, American actor and singer (b. 1911)\n*1970 – Abraham Maslow, American psychologist and academic (b. 1908)\n*1971 – J.I. Rodale, American author and playwright (b. 1898)\n*1976 – Thorleif Schjelderup-Ebbe, Norwegian zoologist and psychologist (b. 1894)\n*1982 – Satchel Paige, American baseball player and coach (b. 1906)\n*1984 – Gordon Jacob, English composer and academic (b. 1895)\n*1987 – Alexander Iolas, Egyptian-American art collector (b. 1907)\n*1997 – George Turner, Australian author and critic (b. 1916)\n*  1997   – Karen Wetterhahn, American chemist and academic (b. 1948)\n*1998 – Sani Abacha, Nigerian general and politician, 10th President of Nigeria (b. 1943)\n*  1998   – Maria Reiche, German mathematician and archaeologist (b. 1903)\n*2000 – Jeff MacNelly, American cartoonist (b. 1948)\n*2001 – Alex de Renzy, American director and producer (b. 1935)\n*2004 – Charles Hyder, American astrophysicist and academic (b. 1930)\n*2004 – Mack Jones, American baseball player (b. 1938)\n*2006 – Jaxon, American illustrator and publisher, co-founded Rip Off Press (b. 1941)\n*  2006   – Matta El Meskeen, Egyptian monk, theologian, and author (b. 1919)\n*2008 – Šaban Bajramović, Serbian singer-songwriter (b. 1936)\n*2009 – Omar Bongo, Gabonese captain and politician, President of Gabon (b. 1935)\n*2010 – Crispian St. Peters, English singer-songwriter (b. 1939)\n*2012 – Pete Brennan, American basketball player (b. 1936)\n*  2012   – Charles E. M. Pearce, New Zealand-Australian mathematician and academic (b. 1940)\n*  2012   – Ghassan Tueni, Lebanese journalist, academic, and politician (b. 1926)\n*2013 – Paul Cellucci, American soldier and politician, 69th Governor of Massachusetts (b. 1948)\n*  2013   – Yoram Kaniuk,  Israeli painter, journalist, and critic (b. 1930)\n*  2013   – Taufiq Kiemas, Indonesian politician, 5th First Spouse of Indonesia (b. 1942)\n*2014 – Alexander Imich, Polish-American chemist, parapsychologist, and academic (b. 1903)\n*  2014   – Yoshihito, Prince Katsura of Japan (b. 1948)\n*2015 – Chea Sim, Cambodian commander and politician (b. 1932)\n\nHolidays and observances\n\n* Christian feast day:\n** Blessed Mariam Thresia Chiramel Mankidiyan\n** Blessed Mary of the Divine Heart (Droste zu Vischering)\n** Chlodulf of Metz\n** Jacques Berthieu, S.J.\n** Jadwiga (Hedwig) of Poland\n** Medard\n** Melania the Elder\n** Roland Allen (Episcopal Church (USA))\n** Thomas Ken (Church of England)\n** William of York\n** June 8 (Eastern Orthodox liturgics)\n* Earliest day on which Queen's Birthday can fall, while June 14 is the latest; celebrated on the second Monday in June. (Australia, except Western Australia and Queensland)\n* Bounty Day (Norfolk Island)\n* Caribbean American HIV/AIDS Awareness Day\n* Engineer's Day (Peru)\n* Pranav Sivakumar Day (Illinois, United States)\n* Primož Trubar Day (Slovenia)\n* World Brain Tumor Day\n* World Oceans Day. June 8. http://en.wikipedia.org/?curid=15864."
  }
}
