{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12123",
  "eid" : "00803a60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778510086,
  "textBody" : "The economy of Greenland can be characterized as small, mixed and vulnerable. Greenland's economy consists of a big public sector and comprehensive foreign trade. This has resulted in an economy with periods of strong growth, considerable inflation, unemployment problems and extreme dependence on capital inflow from Denmark and on outside, mainly Danish, skilled labor.\n\nGDP per capita is close to the average for European economies, but the economy is critically dependent upon substantial support from the Danish government, which supplies about half the revenues of the home rule government, which in turn employs 10,307 Greenlanders StatBank Greenland. \"[http://bank.stat.gl/pxweb/en/Greenland/Greenland__AR__AR30/ARXBFB1.px/table/tableViewLayout1/?rxid=10a372f7-5557-44a2-9c36-36b27fa4ddb0 Main employment for permanent residents by time, industry, gender, age, place of residence, place of birth and inventory]\". Accessed 19 Jan 2017. out of 25,620 currently in employment (2015). Unemployment nonetheless remains high, with the rest of the economy dependent upon demand for exports of shrimp and fish.\n\nHistorical development\n\nExcept for an abortive royal colony established under Major Claus Paarss between 1728 and 1730, colonial Greenland was administered by companies under royal charter until 1908. Hans Egede's Hope Colony was organized under the auspices of the Bergen Greenland Company prior to its bankruptcy in 1727; it was succeeded by the merchant Jacob Severin (1733–1749), the General Trade Company (Det almindelige Handelskompagni; 1749–1774), and finally the Royal Greenland Trading Department (KGH; 1776–1908).\n\nEarly hopes of mineral or agricultural wealth were dashed, and open trade proved a failure owing to other nations' better quality, lower priced goods and hostility.Marquardt, Ole. \"[https://books.google.com/books?id\nFZQcjsSitEcC&pgPA149 Change and Continuity in Denmark's Greenland Policy]\" in The Oldenburg Monarchy: An Underestimated Empire?. Verlag Ludwig (Kiel), 2006. Kale, lettuce, and other vegetables were successfully introduced, but repeated attempts to cultivate wheat or clover failed throughout Greenland, limiting the ability to raise European livestock.Del, Anden. \"[http://www.ilisimatusarfik.gl/Portals/0/Ekstern/Generelt/Dokumenter/Gr%C3%B8nland%20som%20del%20af%20den%20bibelske%20fort%C3%A6lling%20-%20Ph.d.-afhandling.pdf Grønland som del af den bibelske fortælling – en 1700-tals studie] \" [\"Greenland as Part of the Biblical Narrative a Study of the 18th-Century\"].  After government-funded whaling failed, the KGH eventually settled on maintaining the native Greenlanders in their traditional pursuits of hunting and whaling and enforced a monopoly on trade between them and Europe. Repeated attempts to open trade were opposed on both commercial and humanitarian grounds, although minor reforms in the 1850s and 60s lowered the prices charged to the natives for \"luxuries\" like sugar and coffee; transferred more of the KGH's profits to local communities; and granted the important Ivigtut cryolite concession to a separate company.\n\nDuring the years before World War I, the KGH's independence was curtailed and the company folded into the Ministry of the Interior. Climate change, apparent since the 1920s, disrupted traditional Kalaallit life as the milder weather reduced the island's seal populations but filled the waters offshore with cod.Nielsen, Finn. \"[http://pubs.aina.ucalgary.ca/arctic/Arctic4-1-12.pdf Planned reforms in Greenland\". Arctic, Vol. 4, No. 1 (May 1951), pp. 12–17.] After World War II, reforms were finally enacted by the Danish Greenland Commission composed of Greenland Provincial Council members and Danish economists. The report outlined a program to end the KGH model and establish a modern welfare state on the Danish model and supported by Denmark. The KGH monopolies were ended in 1950; Greenland was made an equal part of the Danish Kingdom in 1953 and Home Rule granted in 1979.\n\nThe KGH had long opposed urbanization of the Kalaallit Greenlanders, but during the 1950s and 1960s the Danish government introduced an urbanization and modernization program aimed at consolidating existing settlements. The program was intended to reduce costs, improve access to education and health care, and provide workers for modernized cod fisheries, which were growing rapidly at the time. The program faced a number of problems including the collapse of the fisheries and the shoddy construction of many of the buildings, particularly the infamous Blok P, and produced a number of problems of its own, including continuing unemployment and alcoholism.\n\nGreenland left the European Economic Community in February 1985, principally due to EEC policies on fishing and sealskin. Most EU laws do not apply to Greenland; however, owing to its connection with Denmark, Greenland continues to enjoy preferential access to EU markets. In the same year, Greenland exercised its new control over the Royal Greenland Trading Company to reestablish it as KNI. Over the next few decades, divisions of the conglomerate were slowly spun off and competition within the Greenlandic economy somewhat increased.\n\nFollowing the closure of the Maarmorilik lead and zinc mine in 1990 and the collapse of the cod fisheries amid colder ocean currents, Greenland faced foreign trade deficits and a shrinking economy, but it has been growing since 1993.\n\nSectors of the economy\n\nThe Greenland economy is extremely dependent on exports of fish and on support from the Danish Government, which supplies about half of government revenues. The public sector, including publicly owned enterprises and the municipalities, plays the dominant role in the economy.\n\nGovernance\n\nThe largest employers in Greenland are the various levels of administration, including the central government in Denmark, the Greenland Home Rule Government, and the municipalities. Most of these positions are in the capital Nuuk.Government of Greenland. \"[http://uk.nanoq.gl/Emner/About/Resources_and_industry.aspx About Greenland: Resources and Industry] \". Accessed 30 Apr 2012. In addition to this direct employment, the government heavily subsidizes other major employers in other areas of the economy, including Great Greenland's sealskin purchases, Pilersuisoq's rural stores, and some of Air Greenland and Royal Arctic's regional routes.\n\nFishing industry\n\nThe second-largest sector by employment is Greenland's fishing industry. The commercial fishing fleet consists of approximately 5,000 dinghies, 300 cutters, and 25 trawlers. While cod was formerly the main catch, today the industry centers on cold-water shrimp and Greenland halibut.\n\nThe fish processing industry is almost entirely centered on Royal Greenland, the world's largest retailer of cold-water shrimp.\n\nHunting and whaling\n\nWhaling and seal hunting were once traditional mainstays of Greenland's economy. Greenlanders still kill an estimated 170,000 seals a year and 175 whales a year,[http://www.iwcoffice.org/conservation/table_permit.htm Catches under Permit]. Iwcoffice.org. Retrieved on 2011-10-11.[http://www.iwcoffice.org/conservation/table_objection.htm Catches under Objection]. Iwcoffice.org. Retrieved on 2011-10-11. ranking them second and third in the world respectively. Both whaling and sealing have become controversial, limiting the potential market for their products. As such, the only seal tannery in the country Great Greenland in Qaqortoq is heavily subsidized by the government to maintain the livelihood of smaller communities which are economically dependent on the hunt.Hovelsrud-Broda, Grete K. \"[https://books.google.com/books?idbdQyaVRqzakC&pg\nPA101&lpg=PA101 Contemporary Seal Hunting Households Trade Bans and Subsidies]\" in At the Interface: The Household and Beyond: Monographs in Economic Anthropology, Vol. 15. Univ. Press of America, 1999.\n\nReindeer or caribou are found in the northwest of the island, while muskoxen are found in the northeast and at Kangerlussuaq. Because the muskoxen's natural range favors the protected Northeast Greenland National Park, it is a less common object of hunting than in the past. Polar bear and reindeer hunting in Greenland still occur but are regulated to avoid endangering the populations.\n\nRetail\n\nApproximately half of total sales are conducted by KNI, the state-owned successor to the Royal Greenland Trade Department; its rural sales division Pilersuisoq; or its daughter company which has been purchased by the Danish Dagrofa Pisiffik. The third major chain is the Brugsen association of cooperatives.KNI. \"[http://www.brugsen.gl/omos.html Om os] \" [\"About us\"]. Accessed 1 May 2012. \n\nMining\n\nIvigtut used to be the world's premier source of natural cryolite, an important mineral in aluminum extraction, but the commercially viable reserves were depleted in the 1980s. Similarly, deposits of coal, diamonds, and many metals including silver, nickel, platinum, copper, molybdenum, iron, niobium, tantalum, uranium, and rare earths are known to exist, but not yet in commercially viable deposits. Greenland's Bureau of Minerals and Petroleum is working to promote Greenland as an attractive destination for prospectors. Improvements in technology and increases in mineral prices have led to some mines being reopened, such as the lead and zinc mine at Maarmorilik and the gold mine at Nalunaq.\n\nGreenland is expected to be one of the world’s next great mining frontiers as global warming starts to uncover precious metals from the frozen surroundings. Substantial volumes of minerals are now within reach of geological land mapping technologies, according to research conducted by GlobalData, a natural resources business intelligence provider.\n\nEnergy\n\nWhile the Greenland Home Rule Government has primary sovereignty over mineral deposits on the mainland,Treaty. 2008. oil resources are within the domain of the Danish exclusive economic zone. Nonetheless, prospecting takes place under the auspices of NUNAOIL, a partnership between the two governments. Some geologists believe Greenland has some of the world's largest remaining oil resources:[http://www.cphpost.dk/get/106762.html Overlooking the world's largest island], The Copenhagen Post, 17 April 2008 in 2001, the U.S. Geological Survey found that the waters off north-eastern Greenland (north and south of the Arctic Circle) could contain up to 110 Goilbbl of oil, and in 2010 the British petrochemical company Cairns Oil reported \"the first firm indications\" of commercially viable oil deposits. Nonetheless, all six wells drilled since the 1970s have been dry.\n\nGreenland has offered eight license blocks for tender along its west coast by Baffin Bay. Seven of those blocks have been bid for by a combination of multinational oil companies and NUNAOIL. Companies that have participated successfully in the previous license rounds and have formed a partnership for the licenses with NUNAOIL areDONG Energy, Chevron, ExxonMobil, Husky Energy, and Cairn Energy. The area available known as the West Disko licensing round is of interest due to its relative accessibility compared to other Arctic basins, as the area remains largely free of ice and contains a number of promising geological leads and prospects from the Paleocene era.\n\nCoal used to be mined at Qullissat but this has been suspended.\n\nElectricity generation is controlled by the state-owned Nukissiorfiit. It is distributed at 220V and 50 Hz and sockets of Danish type K are used. Electricity has historically been generated by oil or diesel power plants, even though there is a large surplus of potential hydropower. Because of rising oil prices, there is a program to build hydro power plants. Since the success of the 1993 Buksefjord dam, whose distribution path to Nuuk includes the Ameralik Span the long-term policy of the Greenland government is to produce the island's electricity from renewable domestic sources. A third turbine at Buksefjord brought its capacity up to 45 MW in 2008; in 2007, a second, 7.2MW dam was constructed at Qorlortorsuaq; and in 2010, a third, 15MW dam was constructed at Sisimiut. There is a plan for an Aluminium smelter plant, which requires a very large (600-750 MW) hydropower plant.http://www.aluminium.gl/en Domestic heating is provided by electricity at locations where there is a hydro power plant.\n\nTourism\n\nTourism is limited by the short summers and high costs. Access is almost exclusively by air, mainly from Denmark and Iceland. Some tourists arrive by cruise ship (but they don't spend much locally, since the ship provides accommodation and meals). There have been tests with direct flights from the US East Coast from 2007 to 2008, but these were discontinued.\nThe state-owned tourism agency Visit Greenland has the web address [http://Greenland.com Greenland.com].Visit Greenland. \"[http://www.greenland.com/en/corporate/om-visit-greenland.aspx About Visit Greenland]\". Accessed 1 May 2012.\n\nAgriculture and forestry\n\nAgriculture is of little importance in the economy but climate change in southern Greenland, the growing season averages about three weeks longer than a decade ago has enabled expanded production of existing crops. At present, local production accounts for 10% of potatoes consumption in Greenland, but that is projected to grow to 15% by 2020. Similarly, it has enabled new crops like apples, strawberries, broccoli, cauliflower, cabbage, and carrots to be grown and for the cultivated areas of the country to be extended although even now only about 1% of Greenland is considered arable. Expanded production is subsidized by the government through purchase guarantees by the state-owned Neqi A/S grocery store chain.\n\nThe only forest in Greenland is in the Qinngua Valley near Nanortalik. It is protected and not used for forestry.\n\nAnimal husbandry\n\nAnimal husbandry consists mainly of sheep farming, with free-grazing flocks. Modern sheep farming methods were introduced in the early 20th century, with the first farm built in 1906. The farms provide meat for local consumption and wool mainly for export. Some 20,000 lambs are slaughtered annually in Narsaq by the state-owned Neqi A/S. The lack of private land ownership rights on Greenland forces farmers to jointly agree to terms of land usage. In the south, there is also a small cattle farm.[http://dk.vintage.nanoq.gl/Emner/Erhverv/Erhvervsomraader/Landbrug/~/media/69BA2DAEC7B34A89B84B93921ADEFFDF.ashx Oversigt over får, lam, kvæg, heste og høns fordelt på kommuner – data fra husdyrtælling hos fåreholdere i år 2007, stk.][http://www.johs-pedersen.dk/greenland.htm Første køer i 100 år til Grønland]\n\nReindeer herding has been introduced to Greenland in waves since 1952. Supervision by Scandinavian Sami ended in 1978 and subsequent results were dismal. Repeated attempts in mid-west Greenland in the 1980s and the 1990s failed due to the immobility of the herds, which destroyed their forage. In 1998, the remaining herd was sold to the Nuuk municipality and removed through hunting. At that point, only one Greenlander was still a deerherd; the rest about 20 people were still hired Norwegian Sami. Although the conclusion was drawn that reindeer herding was incompatible with the local culture, the southern herds continue to prosper. In 2008, there was still a strong herd at the Isortoq Reindeer Station maintained by the Icelander Stefán Magnússon and Norwegian Ole Kristiansen.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Economy of Greenland" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12123" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The economy of Greenland can be characterized as small, mixed and vulnerable. Greenland's economy consists of a big public sector and comprehensive foreign trade. This has resulted in an economy with periods of strong growth, considerable inflation, unemployment problems and extreme dependence on capital inflow from Denmark and on outside, mainly Danish, skilled labor.\n\nGDP per capita is close to the average for European economies, but the economy is critically dependent upon substantial support from the Danish government, which supplies about half the revenues of the home rule government, which in turn employs 10,307 Greenlanders StatBank Greenland. \"[http://bank.stat.gl/pxweb/en/Greenland/Greenland__AR__AR30/ARXBFB1.px/table/tableViewLayout1/?rxid=10a372f7-5557-44a2-9c36-36b27fa4ddb0 Main employment for permanent residents by time, industry, gender, age, place of residence, place of birth and inventory]\". Accessed 19 Jan 2017. out of 25,620 currently in employment (2015). Unemployment nonetheless remains high, with the rest of the economy dependent upon demand for exports of shrimp and fish.\n\nHistorical development\n\nExcept for an abortive royal colony established under Major Claus Paarss between 1728 and 1730, colonial Greenland was administered by companies under royal charter until 1908. Hans Egede's Hope Colony was organized under the auspices of the Bergen Greenland Company prior to its bankruptcy in 1727; it was succeeded by the merchant Jacob Severin (1733–1749), the General Trade Company (Det almindelige Handelskompagni; 1749–1774), and finally the Royal Greenland Trading Department (KGH; 1776–1908).\n\nEarly hopes of mineral or agricultural wealth were dashed, and open trade proved a failure owing to other nations' better quality, lower priced goods and hostility.Marquardt, Ole. \"[https://books.google.com/books?id\nFZQcjsSitEcC&pgPA149 Change and Continuity in Denmark's Greenland Policy]\" in The Oldenburg Monarchy: An Underestimated Empire?. Verlag Ludwig (Kiel), 2006. Kale, lettuce, and other vegetables were successfully introduced, but repeated attempts to cultivate wheat or clover failed throughout Greenland, limiting the ability to raise European livestock.Del, Anden. \"[http://www.ilisimatusarfik.gl/Portals/0/Ekstern/Generelt/Dokumenter/Gr%C3%B8nland%20som%20del%20af%20den%20bibelske%20fort%C3%A6lling%20-%20Ph.d.-afhandling.pdf Grønland som del af den bibelske fortælling – en 1700-tals studie] \" [\"Greenland as Part of the Biblical Narrative a Study of the 18th-Century\"].  After government-funded whaling failed, the KGH eventually settled on maintaining the native Greenlanders in their traditional pursuits of hunting and whaling and enforced a monopoly on trade between them and Europe. Repeated attempts to open trade were opposed on both commercial and humanitarian grounds, although minor reforms in the 1850s and 60s lowered the prices charged to the natives for \"luxuries\" like sugar and coffee; transferred more of the KGH's profits to local communities; and granted the important Ivigtut cryolite concession to a separate company.\n\nDuring the years before World War I, the KGH's independence was curtailed and the company folded into the Ministry of the Interior. Climate change, apparent since the 1920s, disrupted traditional Kalaallit life as the milder weather reduced the island's seal populations but filled the waters offshore with cod.Nielsen, Finn. \"[http://pubs.aina.ucalgary.ca/arctic/Arctic4-1-12.pdf Planned reforms in Greenland\". Arctic, Vol. 4, No. 1 (May 1951), pp. 12–17.] After World War II, reforms were finally enacted by the Danish Greenland Commission composed of Greenland Provincial Council members and Danish economists. The report outlined a program to end the KGH model and establish a modern welfare state on the Danish model and supported by Denmark. The KGH monopolies were ended in 1950; Greenland was made an equal part of the Danish Kingdom in 1953 and Home Rule granted in 1979.\n\nThe KGH had long opposed urbanization of the Kalaallit Greenlanders, but during the 1950s and 1960s the Danish government introduced an urbanization and modernization program aimed at consolidating existing settlements. The program was intended to reduce costs, improve access to education and health care, and provide workers for modernized cod fisheries, which were growing rapidly at the time. The program faced a number of problems including the collapse of the fisheries and the shoddy construction of many of the buildings, particularly the infamous Blok P, and produced a number of problems of its own, including continuing unemployment and alcoholism.\n\nGreenland left the European Economic Community in February 1985, principally due to EEC policies on fishing and sealskin. Most EU laws do not apply to Greenland; however, owing to its connection with Denmark, Greenland continues to enjoy preferential access to EU markets. In the same year, Greenland exercised its new control over the Royal Greenland Trading Company to reestablish it as KNI. Over the next few decades, divisions of the conglomerate were slowly spun off and competition within the Greenlandic economy somewhat increased.\n\nFollowing the closure of the Maarmorilik lead and zinc mine in 1990 and the collapse of the cod fisheries amid colder ocean currents, Greenland faced foreign trade deficits and a shrinking economy, but it has been growing since 1993.\n\nSectors of the economy\n\nThe Greenland economy is extremely dependent on exports of fish and on support from the Danish Government, which supplies about half of government revenues. The public sector, including publicly owned enterprises and the municipalities, plays the dominant role in the economy.\n\nGovernance\n\nThe largest employers in Greenland are the various levels of administration, including the central government in Denmark, the Greenland Home Rule Government, and the municipalities. Most of these positions are in the capital Nuuk.Government of Greenland. \"[http://uk.nanoq.gl/Emner/About/Resources_and_industry.aspx About Greenland: Resources and Industry] \". Accessed 30 Apr 2012. In addition to this direct employment, the government heavily subsidizes other major employers in other areas of the economy, including Great Greenland's sealskin purchases, Pilersuisoq's rural stores, and some of Air Greenland and Royal Arctic's regional routes.\n\nFishing industry\n\nThe second-largest sector by employment is Greenland's fishing industry. The commercial fishing fleet consists of approximately 5,000 dinghies, 300 cutters, and 25 trawlers. While cod was formerly the main catch, today the industry centers on cold-water shrimp and Greenland halibut.\n\nThe fish processing industry is almost entirely centered on Royal Greenland, the world's largest retailer of cold-water shrimp.\n\nHunting and whaling\n\nWhaling and seal hunting were once traditional mainstays of Greenland's economy. Greenlanders still kill an estimated 170,000 seals a year and 175 whales a year,[http://www.iwcoffice.org/conservation/table_permit.htm Catches under Permit]. Iwcoffice.org. Retrieved on 2011-10-11.[http://www.iwcoffice.org/conservation/table_objection.htm Catches under Objection]. Iwcoffice.org. Retrieved on 2011-10-11. ranking them second and third in the world respectively. Both whaling and sealing have become controversial, limiting the potential market for their products. As such, the only seal tannery in the country Great Greenland in Qaqortoq is heavily subsidized by the government to maintain the livelihood of smaller communities which are economically dependent on the hunt.Hovelsrud-Broda, Grete K. \"[https://books.google.com/books?idbdQyaVRqzakC&pg\nPA101&lpg=PA101 Contemporary Seal Hunting Households Trade Bans and Subsidies]\" in At the Interface: The Household and Beyond: Monographs in Economic Anthropology, Vol. 15. Univ. Press of America, 1999.\n\nReindeer or caribou are found in the northwest of the island, while muskoxen are found in the northeast and at Kangerlussuaq. Because the muskoxen's natural range favors the protected Northeast Greenland National Park, it is a less common object of hunting than in the past. Polar bear and reindeer hunting in Greenland still occur but are regulated to avoid endangering the populations.\n\nRetail\n\nApproximately half of total sales are conducted by KNI, the state-owned successor to the Royal Greenland Trade Department; its rural sales division Pilersuisoq; or its daughter company which has been purchased by the Danish Dagrofa Pisiffik. The third major chain is the Brugsen association of cooperatives.KNI. \"[http://www.brugsen.gl/omos.html Om os] \" [\"About us\"]. Accessed 1 May 2012. \n\nMining\n\nIvigtut used to be the world's premier source of natural cryolite, an important mineral in aluminum extraction, but the commercially viable reserves were depleted in the 1980s. Similarly, deposits of coal, diamonds, and many metals including silver, nickel, platinum, copper, molybdenum, iron, niobium, tantalum, uranium, and rare earths are known to exist, but not yet in commercially viable deposits. Greenland's Bureau of Minerals and Petroleum is working to promote Greenland as an attractive destination for prospectors. Improvements in technology and increases in mineral prices have led to some mines being reopened, such as the lead and zinc mine at Maarmorilik and the gold mine at Nalunaq.\n\nGreenland is expected to be one of the world’s next great mining frontiers as global warming starts to uncover precious metals from the frozen surroundings. Substantial volumes of minerals are now within reach of geological land mapping technologies, according to research conducted by GlobalData, a natural resources business intelligence provider.\n\nEnergy\n\nWhile the Greenland Home Rule Government has primary sovereignty over mineral deposits on the mainland,Treaty. 2008. oil resources are within the domain of the Danish exclusive economic zone. Nonetheless, prospecting takes place under the auspices of NUNAOIL, a partnership between the two governments. Some geologists believe Greenland has some of the world's largest remaining oil resources:[http://www.cphpost.dk/get/106762.html Overlooking the world's largest island], The Copenhagen Post, 17 April 2008 in 2001, the U.S. Geological Survey found that the waters off north-eastern Greenland (north and south of the Arctic Circle) could contain up to 110 Goilbbl of oil, and in 2010 the British petrochemical company Cairns Oil reported \"the first firm indications\" of commercially viable oil deposits. Nonetheless, all six wells drilled since the 1970s have been dry.\n\nGreenland has offered eight license blocks for tender along its west coast by Baffin Bay. Seven of those blocks have been bid for by a combination of multinational oil companies and NUNAOIL. Companies that have participated successfully in the previous license rounds and have formed a partnership for the licenses with NUNAOIL areDONG Energy, Chevron, ExxonMobil, Husky Energy, and Cairn Energy. The area available known as the West Disko licensing round is of interest due to its relative accessibility compared to other Arctic basins, as the area remains largely free of ice and contains a number of promising geological leads and prospects from the Paleocene era.\n\nCoal used to be mined at Qullissat but this has been suspended.\n\nElectricity generation is controlled by the state-owned Nukissiorfiit. It is distributed at 220V and 50 Hz and sockets of Danish type K are used. Electricity has historically been generated by oil or diesel power plants, even though there is a large surplus of potential hydropower. Because of rising oil prices, there is a program to build hydro power plants. Since the success of the 1993 Buksefjord dam, whose distribution path to Nuuk includes the Ameralik Span the long-term policy of the Greenland government is to produce the island's electricity from renewable domestic sources. A third turbine at Buksefjord brought its capacity up to 45 MW in 2008; in 2007, a second, 7.2MW dam was constructed at Qorlortorsuaq; and in 2010, a third, 15MW dam was constructed at Sisimiut. There is a plan for an Aluminium smelter plant, which requires a very large (600-750 MW) hydropower plant.http://www.aluminium.gl/en Domestic heating is provided by electricity at locations where there is a hydro power plant.\n\nTourism\n\nTourism is limited by the short summers and high costs. Access is almost exclusively by air, mainly from Denmark and Iceland. Some tourists arrive by cruise ship (but they don't spend much locally, since the ship provides accommodation and meals). There have been tests with direct flights from the US East Coast from 2007 to 2008, but these were discontinued.\nThe state-owned tourism agency Visit Greenland has the web address [http://Greenland.com Greenland.com].Visit Greenland. \"[http://www.greenland.com/en/corporate/om-visit-greenland.aspx About Visit Greenland]\". Accessed 1 May 2012.\n\nAgriculture and forestry\n\nAgriculture is of little importance in the economy but climate change in southern Greenland, the growing season averages about three weeks longer than a decade ago has enabled expanded production of existing crops. At present, local production accounts for 10% of potatoes consumption in Greenland, but that is projected to grow to 15% by 2020. Similarly, it has enabled new crops like apples, strawberries, broccoli, cauliflower, cabbage, and carrots to be grown and for the cultivated areas of the country to be extended although even now only about 1% of Greenland is considered arable. Expanded production is subsidized by the government through purchase guarantees by the state-owned Neqi A/S grocery store chain.\n\nThe only forest in Greenland is in the Qinngua Valley near Nanortalik. It is protected and not used for forestry.\n\nAnimal husbandry\n\nAnimal husbandry consists mainly of sheep farming, with free-grazing flocks. Modern sheep farming methods were introduced in the early 20th century, with the first farm built in 1906. The farms provide meat for local consumption and wool mainly for export. Some 20,000 lambs are slaughtered annually in Narsaq by the state-owned Neqi A/S. The lack of private land ownership rights on Greenland forces farmers to jointly agree to terms of land usage. In the south, there is also a small cattle farm.[http://dk.vintage.nanoq.gl/Emner/Erhverv/Erhvervsomraader/Landbrug/~/media/69BA2DAEC7B34A89B84B93921ADEFFDF.ashx Oversigt over får, lam, kvæg, heste og høns fordelt på kommuner – data fra husdyrtælling hos fåreholdere i år 2007, stk.][http://www.johs-pedersen.dk/greenland.htm Første køer i 100 år til Grønland]\n\nReindeer herding has been introduced to Greenland in waves since 1952. Supervision by Scandinavian Sami ended in 1978 and subsequent results were dismal. Repeated attempts in mid-west Greenland in the 1980s and the 1990s failed due to the immobility of the herds, which destroyed their forage. In 1998, the remaining herd was sold to the Nuuk municipality and removed through hunting. At that point, only one Greenlander was still a deerherd; the rest about 20 people were still hired Norwegian Sami. Although the conclusion was drawn that reindeer herding was incompatible with the local culture, the southern herds continue to prosper. In 2008, there was still a strong herd at the Isortoq Reindeer Station maintained by the Icelander Stefán Magnússon and Norwegian Ole Kristiansen. Economy of Greenland. http://en.wikipedia.org/?curid=12123."
  }
}
