{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20210",
  "eid" : "40d7f030-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778618035,
  "textBody" : "Events\n\n* 1400 – The Trần dynasty of Vietnam is deposed, after one hundred and seventy-five years of rule, by Hồ Quý Ly, a court official.\n* 1540 – Waltham Abbey is surrendered to King Henry VIII of England; the last religious community to be closed during the Dissolution of the Monasteries.\n* 1568 – The Peace of Longjumeau is signed, ending the second phase of the French Wars of Religion.\n* 1708 – James Francis Edward Stuart lands at the Firth of Forth.\n* 1775 – American Revolutionary War: Patrick Henry delivers his speech – \"Give me liberty, or give me death!\" – at St. John's Episcopal Church, Richmond, Virginia.\n* 1801 – Tsar Paul I of Russia is struck with a sword, then strangled, and finally trampled to death inside his bedroom at St. Michael's Castle.\n* 1806 – After traveling through the Louisiana Purchase and reaching the Pacific Ocean, explorers Lewis and Clark and their \"Corps of Discovery\" begin their arduous journey home.\n* 1821 – Greek War of Independence: Battle and fall of city of Kalamata.\n* 1848 – The ship John Wickliffe arrives at Port Chalmers carrying the first Scottish settlers for Dunedin, New Zealand. Otago province is founded.\n* 1857 – Elisha Otis's first elevator is installed at 488 Broadway New York City.\n* 1862 – The First Battle of Kernstown, Virginia, marks the start of Stonewall Jackson's Valley Campaign. Although a Confederate defeat, the engagement distracts Federal efforts to capture Richmond.\n* 1868 – The University of California is founded in Oakland, California when the Organic Act is signed into law.\n* 1879 – War of the Pacific: The Battle of Topáter, the first battle of the war is fought between Chile and the joint forces of Bolivia and Peru.\n* 1885 – Sino-French War: Chinese victory in the Battle of Phu Lam Tao near Hưng Hóa, northern Vietnam.\n* 1888 – In England, The Football League, the world's oldest professional association football league, meets for the first time.\n* 1889 – The Ahmadiyya Muslim Community is established by Mirza Ghulam Ahmad in Qadian, British India.\n* 1901 – Emilio Aguinaldo, only President of the First Philippine Republic, was captured at Palanan, Isabela by the forces of General Frederick Funston.\n* 1905 – Eleftherios Venizelos calls for Crete's union with Greece, and begins what is to be known as the Theriso revolt.\n* 1909 – Theodore Roosevelt leaves New York for a post-presidency safari in Africa. The trip is sponsored by the Smithsonian Institution and National Geographic Society.\n* 1918 – First World War: On the third day of the German Spring Offensive, the 10th Battalion of the Royal West Kent Regiment is annihilated with many of the men becoming prisoners of war\n* 1919 – In Milan, Italy, Benito Mussolini founds his Fascist political movement.\n* 1931 – Bhagat Singh, Shivaram Rajguru and Sukhdev Thapar are hanged for the killing of a deputy superintendent of police during the Indian struggle for independence.\n* 1933 – The Reichstag passes the Enabling Act of 1933, making Adolf Hitler dictator of Germany.\n* 1935 – Signing of the Constitution of the Commonwealth of the Philippines.\n* 1939 – The Hungarian air force attacks the headquarters of the Slovak air force in Spišská Nová Ves, killing 13 people and beginning the Slovak–Hungarian War.\n* 1940 – The Lahore Resolution (Qarardad-e-Pakistan or Qarardad-e-Lahore) is put forward at the Annual General Convention of the All-India Muslim League.\n* 1956 – Pakistan becomes the first Islamic republic in the world. (Republic Day in Pakistan)\n* 1965 – NASA launches Gemini 3, the United States' first two-man space flight (crew: Gus Grissom and John Young).\n* 1977 – The first of The Nixon Interviews (12 will be recorded over four weeks) are videotaped with British journalist David Frost interviewing former United States President Richard Nixon about the Watergate scandal and the Nixon tapes.\n* 1978 – The first UNIFIL troops arrived in Lebanon for peacekeeping mission along the Blue Line.\n* 1980 – Archbishop Óscar Romero of El Salvador gives his famous speech appealing to men of the El Salvadoran armed forces to stop killing the Salvadorans.\n* 1982 – Guatemala's government, headed by Fernando Romeo Lucas García is overthrown in a military coup by right-wing General Efraín Ríos Montt.\n* 1983 – Strategic Defense Initiative: President Ronald Reagan makes his initial proposal to develop technology to intercept enemy missiles.\n* 1991 – The Revolutionary United Front, with support from the special forces of Charles Taylor's National Patriotic Front of Liberia, invades Sierra Leone in an attempt to overthrow Joseph Saidu Momoh, sparking a gruesome 11-year Sierra Leone Civil War.\n* 1994 – At an election rally in Tijuana, Mexican presidential candidate Luis Donaldo Colosio is assassinated by Mario Aburto Martínez.\n*  1994   – A United States Air Force (USAF) F-16 aircraft collides with a USAF C-130 at Pope Air Force Base and then crashes, killing 24 United States Army soldiers on the ground. This later became known as the Green Ramp disaster.\n* 1994    – Aeroflot Flight 593 crashed into the Kuznetsk Alatau mountain, Kemerovo Oblast, Russia, killing 75.\n* 1996 – Taiwan holds its first direct elections and chooses Lee Teng-hui as President.\n* 1999 – Gunmen assassinate Paraguay's Vice President Luis María Argaña.\n* 2001 – The Russian Mir space station is disposed of, breaking up in the atmosphere before falling into the southern Pacific Ocean near Fiji.\n* 2003 – Battle of Nasiriyah, first major conflict during the invasion of Iraq.\n* 2008 – Official opening of Rajiv Gandhi International Airport in Hyderabad, India \n* 2009 – FedEx Express Flight 80: A McDonnell Douglas MD-11 flying from Guangzhou, China crashes at Tokyo's Narita International Airport, killing both the captain and the co-pilot.\n\nBirths\n\n* 1338 – Emperor Go-Kōgon of Japan (d. 1374)\n* 1430 – Margaret of Anjou (d. 1482)\n* 1514 – Lorenzino de' Medici, Italian writer and assassin (d. 1548)\n* 1599 – Thomas Selle, German composer (d. 1663)\n* 1643 – Mary of Jesus de León y Delgado, Spanish Dominican lay sister and mystic (d. 1731)\n* 1699 – John Bartram, American botanist and explorer (d. 1777)\n* 1732 – Princess Marie Adélaïde of France (d. 1800)\n* 1749 – Pierre-Simon Laplace, French mathematician and astronomer (d. 1827)\n* 1750 – Johannes Matthias Sperger, Austrian bassist and composer (d. 1812)\n* 1754 – Jurij Vega, Slovene mathematician, physicist and artillery officer (d. 1802)\n* 1769 – Augustin Daniel Belliard, French general and diplomat (d. 1832)\n*  1769   – William Smith, English geologist and cartographer (d. 1839)\n* 1823 – Schuyler Colfax, American journalist and politician, 17th Vice President of the United States (d. 1885)\n* 1826 – Ludwig Minkus, Jewish-Austrian violinist and composer (d. 1917)\n* 1834 – Julius Reubke, German pianist and composer (d. 1858)\n* 1838 – Marie Adam-Doerrer, Swiss women's rights activist and unionist. (d. 1908)\n* 1842 – Friedrich Amelung, Estonian-German historian, businessman and composer (d. 1909)\n*  1842   – Susan Jane Cunningham, American mathematician (d. 1921)\n* 1858 – Ludwig Quidde, German activist and politician, Nobel Prize laureate (d. 1941)\n* 1862 – Nathaniel Reed, American criminal (d. 1950)\n* 1868 – Dietrich Eckart, German journalist and politician (d. 1923)\n* 1869 – Emilio Aguinaldo, Filipino general and politician, 1st President of the Philippines (d. 1964)\n*  1869   – Calouste Gulbenkian, Turkish-Armenian businessman and philanthropist (d. 1955)\n* 1872 – Michael Joseph Savage, Australian-New Zealand union leader and politician, 23rd Prime Minister of New Zealand (d. 1940)\n* 1874 – Grantley Goulding, English hurdler (d. 1947)\n*  1874   – J. C. Leyendecker, German-American painter and illustrator (d. 1951)\n* 1876 – Ziya Gökalp, Turkish sociologist, poet and activist (d. 1924)\n*  1876   – Thakin Kodaw Hmaing, Burmese poet, writer and political leader (d. 1964)\n* 1878 – Franz Schreker, Austrian composer and conductor (d. 1934)\n* 1880 – Heikki Ritavuori, Finnish lawyer and politician, Finnish Minister of the Interior (d. 1922)\n* 1881 – Lacey Hearn, American sprinter (d. 1969)\n*  1881   – Roger Martin du Gard, French novelist and paleographer, Nobel Prize laureate (d. 1958)\n*  1881   – Hermann Staudinger, German chemist and academic, Nobel Prize laureate (d. 1965)\n* 1882 – Emmy Noether, Jewish German-American mathematician, physicist and academic (d. 1935)\n* 1884 – Joseph Boxhall, English sailor (d. 1967)\n* 1885 – Platt Adams, American jumper and politician (d. 1961)\n* 1886 – Frank Irons, American long jumper (d. 1942)\n* 1887 – Josef Čapek, Czech painter and poet (d. 1945)\n*  1887   – Rudolf Kinau, German author (d. 1975)\n*  1887   – Juan Gris, Spanish painter and sculptor (d. 1927)\n*  1887   – Sidney Hillman, Lithuanian-born American labor leader (d. 1946)\n* 1891 – Po Kya, Burmese author and educationist (d. 1942)\n* 1893 – Cedric Gibbons, Irish-born American art director and production designer (d. 1960)\n*  1893   – Gopalswamy Doraiswamy Naidu, Indian engineer and businessman (d. 1974)\n* 1894 – Arthur Grimsdell, English footballer and cricketer (d. 1963)\n* 1895 – Encarnacion Alzona, Filipino historian and educator (d. 2001)\n*  1895   – Dane Rudhyar, French-American astrologer, author and composer (d. 1985)\n* 1898 – Louis Adamic, Slovenian-American author, translator and politician (d. 1951)\n*  1898   – Madeleine de Bourbon-Busset, Duchess of Parma (d. 1984)\n* 1899 – Dora Gerson, German actress and singer (d. 1943)\n* 1900 – Erich Fromm, German psychologist and sociologist (d. 1980)\n* 1901 – Bon Maharaja, Indian guru and religious writer (d. 1982)\n* 1903 – Frank Sargeson, New Zealand's foremost short story writers (d. 1982)\n* 1905 – Lale Andersen, German chanson singer-songwriter (d. 1972)\n* 1906 – Joan Crawford, American film actress (d. 1977)\n* 1907 – Daniel Bovet, Swiss-Italian pharmacologist and academic, Nobel Prize laureate (d. 1992)\n* 1909 – Charles Werner, American cartoonist (d. 1997)\n* 1910 – Jerry Cornes, English runner, colonial and educator (d. 2001)\n*  1910   – Akira Kurosawa, Japanese director, producer and screenwriter (d. 1998)\n* 1912 – Eleanor Cameron, Canadian-American author and critic (d. 1996)\n*  1912   – Neil McCorkell, Anglo-South African cricketer and coach (d. 2013)\n*  1912   – Wernher von Braun, German-American physicist and engineer (d. 1977)\n* 1913 – Abidin Dino, Turko-French painter and illustrator (d. 1993)\n* 1914 – Milbourne Christopher, American magician and author (d. 1984)\n* 1915 – Mary Innes-Ker, Duchess of Roxburghe (d. 2014)\n*  1915   – Vasily Zaytsev, Russian captain (d. 1991)\n* 1917 – Harry Cranbrook Allen, English historian (d. 1998)\n* 1918 – Stanley Armour Dunham, American sergeant (d. 1992)\n*  1918   – Helene Hale, American politician (d. 2013)\n* 1919 – Carl Graffunder, American architect and educator (d. 2013)\n* 1920 – Neal Edward Smith, American pilot, lawyer and politician\n*  1920   – Tetsuharu Kawakami, Japanese baseball player and manager (d. 2013)\n* 1921 – Donald Campbell, English racing driver (d. 1967)\n*  1921   – Peter Lawler, Australian public servant (d. 2017)\n* 1922 – Marty Allen, American comedian and actor (d. 2018)\n*  1922   – Ugo Tognazzi, Italian actor (d. 1990)\n* 1923 – Angelo Ingrassia, American soldier and judge (d. 2013)\n* 1924 – Rodney Mims Cook, Sr., American lieutenant and politician (d. 2013)\n*  1924   – Bette Nesmith Graham, American inventor, invented Liquid Paper (d. 1980)\n*  1924   – Olga Kennard, English crystallographer and academic\n*  1924   – John Madin, English architect (d. 2012)\n* 1925 – David Watkin, English cinematographer (d. 2008)\n* 1929 – Roger Bannister, English runner, neurologist and academic\n*  1929   – Michael Manser, English architect and engineer (d. 2016)\n* 1931 – Yevgeny Grishin, Russian speed skater (d. 2005)\n*  1931   – Viktor Korchnoi, Russian chess player and author (d. 2016)\n*  1931   – Yevdokiya Mekshilo, Russian skier (d. 2013)\n* 1932 – Don Marshall, Canadian ice hockey player\n* 1933 – Norman Bailey, Anglo-American opera singer and educator\n*  1933   – Philip Zimbardo, American psychologist and academic\n* 1934 – Ludvig Faddeev, Russian mathematician and physicist\n*  1934   – Mark Rydell, American actor, director and producer\n* 1935 – Barry Cryer, English comedian, actor and screenwriter\n* 1936 – Jannis Kounellis, Greek painter and sculptor\n* 1937 – Craig Breedlove, American racing driver\n*  1937   – Tony Burton, American actor, comedian, boxer and American football player (d. 2016)\n*  1937   – Robert Gallo, American physician and academic\n* 1938 – Jon Finlayson, Australian actor and screenwriter (d. 2012)\n* 1939 – Robin Herd, English engineer and businessman\n*  1939   – Terry Paine, English footballer\n* 1942 – Michael Haneke, Austrian director, producer and screenwriter\n*  1942   – Jimmy Miller, American record producer and musician (d. 1994) \n*  1942   – Walter Rodney, Guyanese historian, scholar and activist (d. 1980)\n* 1943 – Andrew Crockett, Scottish-English economist and banker (d. 2012)\n*  1943   – Lee May, American baseball player and coach\n*  1943   – Sharon Presley, American author and academic\n*  1943   – Nils-Aslak Valkeapää, Finnish singer, author and director (d. 2001)\n* 1944 – B. P. Gavrilov, Russian rugby player (d. 2006)\n*  1944   – Tony McPhee, English singer-songwriter and guitarist \n*  1944   – Michael Nyman, English composer of minimalist music and pianist\n* 1945 – Franco Battiato, Italian singer-songwriter and director\n*  1945   – David Grisman, American mandolin player and composer \n* 1946 – Alan Bleasdale, English screenwriter and producer\n* 1947 – Elizabeth Ann Scarborough, American author\n* 1948 – Wasim Bari, Pakistani cricketer\n*  1948   – Marie Malavoy, German-Canadian educator and politician\n* 1949 – Ric Ocasek, American singer-songwriter, guitarist and producer \n* 1950 – Corinne Cléry, French actress\n*  1950   – Phil Lanzon, English keyboard player and songwriter \n*  1950   – Ahdaf Soueif, Egyptian author and translator\n* 1951 – Ron Jaworski, American football player and sportscaster\n*  1951   – Adrian Reynard, English businessman, founded Reynard Motorsport\n* 1952 – Francesco Clemente, Italian painter and illustrator\n*  1952   – Kent Lambert, New Zealand rugby player \n*  1952   – Kim Stanley Robinson, American author\n*  1952   – Rex Tillerson, American businessman, engineer and diplomat; 69th United States Secretary of State\n* 1953 – Bo Díaz, Venezuelan baseball player (d. 1990)\n*  1953   – Chaka Khan, American singer-songwriter \n*  1953   – Kiran Mazumdar-Shaw, Indian zoologist and businesswoman\n* 1954 – Geno Auriemma, Italian-American basketball player and coach\n*  1954   – Kenneth Cole, American fashion designer, founded Kenneth Cole Productions\n* 1955 – Moses Malone, American basketball player and sportscaster (d. 2015)\n* 1956 – José Manuel Barroso, Portuguese academic and politician, 115th Prime Minister of Portugal\n*  1956   – Andrew Mitchell, English soldier and politician, Secretary of State for International Development\n*  1956   – Jeremy Wade, English biologist and author\n* 1957 – Lucio Gutiérrez, Ecuadorian politician, 52nd President of Ecuador\n*  1957   – Robbie James, Welsh footballer and manager (d. 1998)\n*  1957   – Amanda Plummer, American actress\n* 1958 – Etienne De Wilde, Belgian cyclist\n*  1958   – Bengt-Åke Gustafsson, Swedish ice hockey player and coach\n*  1958   – Hugh Grant, Scottish business executive\n* 1959 – Catherine Keener, American actress \n* 1960 – Nicol Stephen, Baron Stephen, Scottish lawyer and politician, 2nd Deputy First Minister of Scotland\n* 1961 – Roger Crisp, English philosopher and academic\n*  1961   – Craig Green, New Zealand rugby player\n*  1961   – Helmi Johannes, Indonesian journalist and producer\n* 1962 – Steve Redgrave, English rower\n* 1963 – Míchel, Spanish footballer and manager\n*  1963   – Juan Ramón López Caro, Spanish footballer and manager\n*  1963   – Ana Fidelia Quirot, Cuban runner\n* 1964 – Hope Davis, American actress \n*  1965   – Gary Whitehead, American poet and painter\n* 1966 – Lorenzo Daniel, American sprinter\n*  1966   – Vasilis Vouzas, Greek footballer and manager\n* 1968 – Damon Albarn, English singer-songwriter, producer and actor\n*  1968   – Mike Atherton, English cricketer and journalist\n*  1968   – Mitch Cullin, American author\n*  1968   – Fernando Hierro, Spanish footballer and manager\n*  1968   – Pierre Palmade, French actor and screenwriter\n* 1971 – Yasmeen Ghauri, Canadian model\n*  1971   – Gail Porter, Scottish model and television host\n*  1971   – Alexander Selivanov, Russian ice hockey player\n*  1971   – Hiroyoshi Tenzan, Japanese wrestler\n* 1972 – Jonas Björkman, Swedish-Monégasque tennis player and coach\n*  1972   – Joe Calzaghe, Welsh boxer\n*  1972   – Judith Godrèche, French actress and author\n* 1973 – Jerzy Dudek, Polish footballer\n*  1973   – Wim Eyckmans, Belgian racing driver\n*  1973   – Jason Kidd, American basketball player and coach\n* 1974 – Randall Park, American actor, director and screenwriter\n* 1975 – Burak Gürpınar, Turkish drummer \n* 1976 – Jayson Blair, American journalist and author\n*  1976   – Chris Hoy, Scottish cyclist and racing driver\n*  1976   – Smriti Irani, Indian actress, producer and politician, Indian Minister of Human Resource Development\n*  1976   – Dougie Lampkin, English motorcycle racer\n*  1976   – Michelle Monaghan, American actress\n*  1976   – Jeremy Newberry, American football player\n*  1976   – Joel Peralta, Dominican baseball player\n*  1976   – Keri Russell, American actress \n*  1976   – Ricardo Zonta, Brazilian racing driver\n* 1977 – Miklos Perlus, Canadian actor and screenwriter\n* 1978 – Simon Gärdenfors, Swedish illustrator\n*  1978   – Walter Samuel, Argentinian footballer\n* 1979 – Mark Buehrle, American baseball player\n*  1979   – Donncha O'Callaghan, Irish rugby player\n* 1980 – Russell Howard, English comedian\n* 1981 – Erin Crocker, American racing driver\n*  1981   – Tony Peña, Jr., Dominican baseball player\n*  1981   – Shelley Rudman, English bobsledder\n*  1981   – Giuseppe Sculli, Italian footballer\n* 1982 – José Contreras Arrau, Chilean footballer\n*  1982   – Andrea Musacco, Italian footballer\n*  1982   – Evgeni Striganov, Estonian ice dancer\n* 1983 – Hakan Balta, Turkish footballer\n*  1983   – Mo Farah, Somali-English runner\n*  1983   – Sascha Riether, German footballer\n*  1983   – Jerome Thomas, English footballer\n* 1984 – Ryan Araña, Filipino basketball player\n* 1984    – Brandon Marshall, American football player\n* 1985 – Maurice Jones-Drew, American football player\n*  1985   – Bethanie Mattek-Sands, American tennis player\n* 1986 – Patrick Bordeleau, Canadian ice hockey player\n*  1986   – Andrea Dovizioso, Italian motorcycle racer\n*  1986   – Brett Eldredge, American singer-songwriter and guitarist\n*  1986   – Kangana Ranaut, Indian actress\n* 1987 – Alan Toovey, Australian footballer\n* 1988 – Dellin Betances, American baseball player\n*  1988   – Jason Kenny, English cyclist\n*  1988   – Michal Neuvirth, Czech ice hockey player\n* 1989 – Nikola Gulan, Serbian footballer\n*  1989   – Luis Fernando Silva, Mexican footballer\n*  1989   – Ayesha Curry, Canadian-American chef, author and television personality\n* 1990 – Jaime Alguersuari, Spanish racing driver\n*  1990   – Robert Zickert, German footballer\n* 1991 – Gregg Wylde, Scottish footballer\n* 1992 – Tolga Ciğerci, German-Turkish footballer\n*  1992   – Morgan Evans, Welsh rugby league player\n*  1992   – Kyrie Irving, Australian-American basketball player\n* 1993 – Kyle Lovett, Australian rugby league player\n*  1993   – Aytaç Kara, Turkish footballer\n* 1994 – Nick Powell, English footballer\n* 1995 – Kevin Kauber, Estonian footballer\n*  1995   – Jan Lisiecki, Canadian pianist\n*  1995   – Ozan Tufan, Turkish footballer\n\nDeaths\n\n* 851 – Zhou Chi, Chinese historian and politician (b. 793)\n* 1022 – Emperor Zhenzong of China (b. 968)\n* 1103 – Eudes I, Duke of Burgundy (b. 1058)\n* 1361 – Henry of Grosmont, 1st Duke of Lancaster, English politician, Lord High Steward of England (b. 1310)\n* 1369 – Peter of Castile (b. 1334)\n* 1483 – Yolande, Duchess of Lorraine (b. 1428)\n* 1548 – Itagaki Nobukata, Japanese samurai (b. 1489)\n* 1555 – Pope Julius III (b. 1487)\n* 1559 – Gelawdewos, Ethiopian emperor (b. 1521)\n* 1593 – Henry Barrowe, English Puritan and separatist (b. 1550)\n* 1596 – Henry Unton, English diplomat (b. 1557)\n* 1606 – Justus Lipsius, Flemish philologist and scholar (b. 1547)\n* 1618 – James Hamilton, 1st Earl of Abercorn, Scottish police officer and politician (b. 1575)\n* 1629 – Francis Fane, 1st Earl of Westmorland (b. c. 1580)\n* 1675 – Anthoni van Noordt, Dutch organist and composer (b. 1619)\n* 1680 – Nicolas Fouquet, French politician (b. 1615)\n* 1742 – Jean-Baptiste Dubos, French historian and author (b. 1670)\n* 1747 – Claude Alexandre de Bonneval, French general (b. 1675)\n* 1748 – Johann Gottfried Walther, German organist and composer (b. 1684)\n* 1754 – Johann Jakob Wettstein, Swiss theologian and critic (b. 1693)\n* 1783 – Charles Carroll, English barrister and politician (b. 1723)\n* 1801 – Paul I of Russia (b. 1754)\n* 1842 – Stendhal, French novelist (b. 1783)\n* 1884 – Henry C. Lord, American businessman (b. 1824)\n* 1910 – Nadar, French photographer, journalist, and author (b. 1820)\n* 1914 – Rafqa Pietra Choboq Ar-Rayès, Lebanese saint (b. 1832)\n* 1923 – Hovhannes Tumanyan Armenian poet and author (b. 1869)\n* 1927 – Paul César Helleu, French painter and etcher (b. 1859)\n* 1931 – Shivaram Rajguru, Indian activist (b. 1908)\n*  1931   – Bhagat Singh, Indian activist (b. 1907)\n*  1931   – Sukhdev Thapar, Indian activist (b. 1907)\n* 1953 – Raoul Dufy, French painter and illustrator (b. 1877)\n*  1953   – Oskar Luts, Estonian author and playwright (b. 1887)\n* 1955 – Arthur Bernardes, Brazilian politician, 12th President of Brazil (b. 1875)\n* 1960 – Franklin Pierce Adams, American journalist and author (b. 1881)\n*  1960   – Said Nursî, Kurdish theologian and scholar (b. 1878)\n* 1961 – Albert Bloch, American painter and educator (b. 1882)\n*  1961   – Jack Russell, English cricketer (b. 1887)\n* 1963 – Thoralf Skolem, Norwegian mathematician and logician (b. 1887)\n* 1964 – Peter Lorre, American actor (b. 1904)\n* 1965 – Mae Murray, American actress, dancer, producer, and screenwriter (b. 1889)\n* 1968 – Edwin O'Connor, American journalist and author (b. 1918)\n* 1972 – Cristóbal Balenciaga, Spanish fashion designer, founded Balenciaga (b. 1895)\n* 1978 – Haim Ernst Wertheimer, Israeli biochemist and academic (b. 1893)\n* 1979 – Ted Anderson, English footballer (b. 1911)\n* 1980 – Arthur Melvin Okun, American economist and academic (b. 1928)\n* 1981 – Beatrice Tinsley, English-New Zealand astronomer and cosmologist (b. 1941)\n* 1981 – Mike Hailwood, English motorcyclist (b. 1940)\n* 1985 – Richard Beeching, Baron Beeching, English physicist and engineer (b. 1913)\n*  1985   – Peter Charanis, Greek-American scholar and educator (b. 1908)\n* 1987 – Olev Roomet, Estonian singer and violinist (b. 1901)\n* 1990 – John Dexter, English director and producer (b. 1925)\n* 1991 – Parkash Singh, Indian soldier, Victoria Cross recipient (b. 1913)\n* 1992 – Friedrich Hayek, Austrian-German economist, philosopher, and academic, Nobel Prize laureate (b. 1899)\n*  1992   – Ron Lapointe, Canadian ice hockey player and coach (b. 1949)\n* 1994 – Luis Donaldo Colosio, Mexican economist and politician (b. 1950)\n*  1994   – Giulietta Masina, Italian actress (b. 1921)\n* 1995 – Davie Cooper, Scottish footballer and coach (b. 1956)\n* 1999 – Luis María Argaña, Paraguayan judge and politician, Vice President of Paraguay (b. 1932)\n*  1999   – Osmond Borradaile, Canadian director and cinematographer (b. 1898)\n* 2001 – Rowland Evans, American journalist (b. 1921)\n* 2001 – Margaret Jones, British archaeologist (b. 1916)\n*  2001   – Robert Laxalt, American author (b. 1923)\n*  2001   – David McTaggart, Canadian badminton player and environmentalist (b. 1932)\n* 2002 – Eileen Farrell, American soprano (b. 1920)\n*  2002   – Ben Hollioake, Australian-English cricketer (b. 1977)\n* 2003 – Fritz Spiegl, Austrian-English flute player and journalist (b. 1926)\n* 2004 – Rupert Hamer, Australian soldier, lawyer, and politician, 39th Premier of Victoria (b. 1916)\n* 2006 – David B. Bleak, American sergeant, Medal of Honor recipient (b. 1932)\n*  2006   – Desmond Doss, American soldier, Medal of Honor recipient (b. 1919)\n*  2006   – Cindy Walker, American singer-songwriter and dancer (b. 1918)\n* 2007 – Paul Cohen, American mathematician and theorist (b. 1934)\n*  2007   – Eric Medlen, American race car driver (b. 1973)\n* 2008 – Vaino Vahing, Estonian psychiatrist, author, and playwright (b. 1940)\n* 2009 – Ghukas Chubaryan, Armenian sculptor (b. 1923)\n*  2009   – Raúl Macías, Mexican boxer and trainer (b. 1934)\n* 2011 – Jean Bartik, American computer scientist and engineer (b. 1924)\n*  2011   – Elizabeth Taylor, American-British actress, socialite and humanitarian (b. 1932)\n* 2012 – Abdullahi Yusuf Ahmed, Somalian politician, President of Somalia (b. 1934)\n*  2012   – Jim Duffy, American animator, director, and producer (b. 1937)\n*  2012   – Naji Talib, Iraqi politician, 52nd Prime Minister of Iraq (b. 1917)\n*  2012   – Lonnie Wright, American basketball and football player (b. 1945)\n* 2013 – Boris Berezovsky, Russian-born Soviet-British mathematician and businessman (b. 1946)\n*  2013   – Onofre Corpuz, Filipino economist, historian, and academic (b. 1926)\n*  2013   – Virgil Trucks, American baseball player and coach (b. 1917)\n*  2013   – Joe Weider, Canadian-American bodybuilder and publisher, co-founded the International Federation of BodyBuilding & Fitness (b. 1919)\n* 2014 – Dave Brockie, Canadian-American singer-songwriter and bass player (b. 1963)\n*  2014   – Jaroslav Šerých, Czech painter and illustrator (b. 1928)\n*  2014   – Adolfo Suárez, Spanish lawyer and politician, 1st Prime Minister of Spain (b. 1932)\n* 2015 – Gian Vittorio Baldi, Italian director, producer, and screenwriter (b. 1930)\n*  2015   – Lee Kuan Yew, Singaporean lawyer and politician, 1st Prime Minister of Singapore (b. 1923)\n*  2015   – Bobby Lowther, American basketball player and lieutenant (b. 1923)\n*  2015   – Lil' Chris, English singer-songwriter, actor, and television personality (b. 1990)\n* 2016 – Joe Garagiola, Sr., American baseball player and sportscaster (b. 1926)\n*  2016   – Ken Howard, American actor (b. 1944)\n\nHolidays and observances\n\n* Christian feast day:\n** Rafqa Pietra Choboq Ar-Rayès (Maronite Church)\n** Turibius of Mogrovejo\n** March 23 (Eastern Orthodox liturgics)\n* Day of Hungarian-Polish Friendship (Hungary and Poland)\n* Day of the Sea (Bolivia)\n* Earliest day on which Easter Monday can fall, while April 26 is the latest; celebrated on Monday after Easter. (Western Christianity)\n** Family Day (South Africa)\n** Śmigus-Dyngus ((Poland, Ukraine), Polish diaspora communities)\n* Ministry of Environment and Natural Resources Day (Azerbaijan)\n* Pakistan Day (Pakistan)\n* Promised Messiah Day (Ahmadiyya)\n* World Meteorological Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 23" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20210" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 1400 – The Trần dynasty of Vietnam is deposed, after one hundred and seventy-five years of rule, by Hồ Quý Ly, a court official.\n* 1540 – Waltham Abbey is surrendered to King Henry VIII of England; the last religious community to be closed during the Dissolution of the Monasteries.\n* 1568 – The Peace of Longjumeau is signed, ending the second phase of the French Wars of Religion.\n* 1708 – James Francis Edward Stuart lands at the Firth of Forth.\n* 1775 – American Revolutionary War: Patrick Henry delivers his speech – \"Give me liberty, or give me death!\" – at St. John's Episcopal Church, Richmond, Virginia.\n* 1801 – Tsar Paul I of Russia is struck with a sword, then strangled, and finally trampled to death inside his bedroom at St. Michael's Castle.\n* 1806 – After traveling through the Louisiana Purchase and reaching the Pacific Ocean, explorers Lewis and Clark and their \"Corps of Discovery\" begin their arduous journey home.\n* 1821 – Greek War of Independence: Battle and fall of city of Kalamata.\n* 1848 – The ship John Wickliffe arrives at Port Chalmers carrying the first Scottish settlers for Dunedin, New Zealand. Otago province is founded.\n* 1857 – Elisha Otis's first elevator is installed at 488 Broadway New York City.\n* 1862 – The First Battle of Kernstown, Virginia, marks the start of Stonewall Jackson's Valley Campaign. Although a Confederate defeat, the engagement distracts Federal efforts to capture Richmond.\n* 1868 – The University of California is founded in Oakland, California when the Organic Act is signed into law.\n* 1879 – War of the Pacific: The Battle of Topáter, the first battle of the war is fought between Chile and the joint forces of Bolivia and Peru.\n* 1885 – Sino-French War: Chinese victory in the Battle of Phu Lam Tao near Hưng Hóa, northern Vietnam.\n* 1888 – In England, The Football League, the world's oldest professional association football league, meets for the first time.\n* 1889 – The Ahmadiyya Muslim Community is established by Mirza Ghulam Ahmad in Qadian, British India.\n* 1901 – Emilio Aguinaldo, only President of the First Philippine Republic, was captured at Palanan, Isabela by the forces of General Frederick Funston.\n* 1905 – Eleftherios Venizelos calls for Crete's union with Greece, and begins what is to be known as the Theriso revolt.\n* 1909 – Theodore Roosevelt leaves New York for a post-presidency safari in Africa. The trip is sponsored by the Smithsonian Institution and National Geographic Society.\n* 1918 – First World War: On the third day of the German Spring Offensive, the 10th Battalion of the Royal West Kent Regiment is annihilated with many of the men becoming prisoners of war\n* 1919 – In Milan, Italy, Benito Mussolini founds his Fascist political movement.\n* 1931 – Bhagat Singh, Shivaram Rajguru and Sukhdev Thapar are hanged for the killing of a deputy superintendent of police during the Indian struggle for independence.\n* 1933 – The Reichstag passes the Enabling Act of 1933, making Adolf Hitler dictator of Germany.\n* 1935 – Signing of the Constitution of the Commonwealth of the Philippines.\n* 1939 – The Hungarian air force attacks the headquarters of the Slovak air force in Spišská Nová Ves, killing 13 people and beginning the Slovak–Hungarian War.\n* 1940 – The Lahore Resolution (Qarardad-e-Pakistan or Qarardad-e-Lahore) is put forward at the Annual General Convention of the All-India Muslim League.\n* 1956 – Pakistan becomes the first Islamic republic in the world. (Republic Day in Pakistan)\n* 1965 – NASA launches Gemini 3, the United States' first two-man space flight (crew: Gus Grissom and John Young).\n* 1977 – The first of The Nixon Interviews (12 will be recorded over four weeks) are videotaped with British journalist David Frost interviewing former United States President Richard Nixon about the Watergate scandal and the Nixon tapes.\n* 1978 – The first UNIFIL troops arrived in Lebanon for peacekeeping mission along the Blue Line.\n* 1980 – Archbishop Óscar Romero of El Salvador gives his famous speech appealing to men of the El Salvadoran armed forces to stop killing the Salvadorans.\n* 1982 – Guatemala's government, headed by Fernando Romeo Lucas García is overthrown in a military coup by right-wing General Efraín Ríos Montt.\n* 1983 – Strategic Defense Initiative: President Ronald Reagan makes his initial proposal to develop technology to intercept enemy missiles.\n* 1991 – The Revolutionary United Front, with support from the special forces of Charles Taylor's National Patriotic Front of Liberia, invades Sierra Leone in an attempt to overthrow Joseph Saidu Momoh, sparking a gruesome 11-year Sierra Leone Civil War.\n* 1994 – At an election rally in Tijuana, Mexican presidential candidate Luis Donaldo Colosio is assassinated by Mario Aburto Martínez.\n*  1994   – A United States Air Force (USAF) F-16 aircraft collides with a USAF C-130 at Pope Air Force Base and then crashes, killing 24 United States Army soldiers on the ground. This later became known as the Green Ramp disaster.\n* 1994    – Aeroflot Flight 593 crashed into the Kuznetsk Alatau mountain, Kemerovo Oblast, Russia, killing 75.\n* 1996 – Taiwan holds its first direct elections and chooses Lee Teng-hui as President.\n* 1999 – Gunmen assassinate Paraguay's Vice President Luis María Argaña.\n* 2001 – The Russian Mir space station is disposed of, breaking up in the atmosphere before falling into the southern Pacific Ocean near Fiji.\n* 2003 – Battle of Nasiriyah, first major conflict during the invasion of Iraq.\n* 2008 – Official opening of Rajiv Gandhi International Airport in Hyderabad, India \n* 2009 – FedEx Express Flight 80: A McDonnell Douglas MD-11 flying from Guangzhou, China crashes at Tokyo's Narita International Airport, killing both the captain and the co-pilot.\n\nBirths\n\n* 1338 – Emperor Go-Kōgon of Japan (d. 1374)\n* 1430 – Margaret of Anjou (d. 1482)\n* 1514 – Lorenzino de' Medici, Italian writer and assassin (d. 1548)\n* 1599 – Thomas Selle, German composer (d. 1663)\n* 1643 – Mary of Jesus de León y Delgado, Spanish Dominican lay sister and mystic (d. 1731)\n* 1699 – John Bartram, American botanist and explorer (d. 1777)\n* 1732 – Princess Marie Adélaïde of France (d. 1800)\n* 1749 – Pierre-Simon Laplace, French mathematician and astronomer (d. 1827)\n* 1750 – Johannes Matthias Sperger, Austrian bassist and composer (d. 1812)\n* 1754 – Jurij Vega, Slovene mathematician, physicist and artillery officer (d. 1802)\n* 1769 – Augustin Daniel Belliard, French general and diplomat (d. 1832)\n*  1769   – William Smith, English geologist and cartographer (d. 1839)\n* 1823 – Schuyler Colfax, American journalist and politician, 17th Vice President of the United States (d. 1885)\n* 1826 – Ludwig Minkus, Jewish-Austrian violinist and composer (d. 1917)\n* 1834 – Julius Reubke, German pianist and composer (d. 1858)\n* 1838 – Marie Adam-Doerrer, Swiss women's rights activist and unionist. (d. 1908)\n* 1842 – Friedrich Amelung, Estonian-German historian, businessman and composer (d. 1909)\n*  1842   – Susan Jane Cunningham, American mathematician (d. 1921)\n* 1858 – Ludwig Quidde, German activist and politician, Nobel Prize laureate (d. 1941)\n* 1862 – Nathaniel Reed, American criminal (d. 1950)\n* 1868 – Dietrich Eckart, German journalist and politician (d. 1923)\n* 1869 – Emilio Aguinaldo, Filipino general and politician, 1st President of the Philippines (d. 1964)\n*  1869   – Calouste Gulbenkian, Turkish-Armenian businessman and philanthropist (d. 1955)\n* 1872 – Michael Joseph Savage, Australian-New Zealand union leader and politician, 23rd Prime Minister of New Zealand (d. 1940)\n* 1874 – Grantley Goulding, English hurdler (d. 1947)\n*  1874   – J. C. Leyendecker, German-American painter and illustrator (d. 1951)\n* 1876 – Ziya Gökalp, Turkish sociologist, poet and activist (d. 1924)\n*  1876   – Thakin Kodaw Hmaing, Burmese poet, writer and political leader (d. 1964)\n* 1878 – Franz Schreker, Austrian composer and conductor (d. 1934)\n* 1880 – Heikki Ritavuori, Finnish lawyer and politician, Finnish Minister of the Interior (d. 1922)\n* 1881 – Lacey Hearn, American sprinter (d. 1969)\n*  1881   – Roger Martin du Gard, French novelist and paleographer, Nobel Prize laureate (d. 1958)\n*  1881   – Hermann Staudinger, German chemist and academic, Nobel Prize laureate (d. 1965)\n* 1882 – Emmy Noether, Jewish German-American mathematician, physicist and academic (d. 1935)\n* 1884 – Joseph Boxhall, English sailor (d. 1967)\n* 1885 – Platt Adams, American jumper and politician (d. 1961)\n* 1886 – Frank Irons, American long jumper (d. 1942)\n* 1887 – Josef Čapek, Czech painter and poet (d. 1945)\n*  1887   – Rudolf Kinau, German author (d. 1975)\n*  1887   – Juan Gris, Spanish painter and sculptor (d. 1927)\n*  1887   – Sidney Hillman, Lithuanian-born American labor leader (d. 1946)\n* 1891 – Po Kya, Burmese author and educationist (d. 1942)\n* 1893 – Cedric Gibbons, Irish-born American art director and production designer (d. 1960)\n*  1893   – Gopalswamy Doraiswamy Naidu, Indian engineer and businessman (d. 1974)\n* 1894 – Arthur Grimsdell, English footballer and cricketer (d. 1963)\n* 1895 – Encarnacion Alzona, Filipino historian and educator (d. 2001)\n*  1895   – Dane Rudhyar, French-American astrologer, author and composer (d. 1985)\n* 1898 – Louis Adamic, Slovenian-American author, translator and politician (d. 1951)\n*  1898   – Madeleine de Bourbon-Busset, Duchess of Parma (d. 1984)\n* 1899 – Dora Gerson, German actress and singer (d. 1943)\n* 1900 – Erich Fromm, German psychologist and sociologist (d. 1980)\n* 1901 – Bon Maharaja, Indian guru and religious writer (d. 1982)\n* 1903 – Frank Sargeson, New Zealand's foremost short story writers (d. 1982)\n* 1905 – Lale Andersen, German chanson singer-songwriter (d. 1972)\n* 1906 – Joan Crawford, American film actress (d. 1977)\n* 1907 – Daniel Bovet, Swiss-Italian pharmacologist and academic, Nobel Prize laureate (d. 1992)\n* 1909 – Charles Werner, American cartoonist (d. 1997)\n* 1910 – Jerry Cornes, English runner, colonial and educator (d. 2001)\n*  1910   – Akira Kurosawa, Japanese director, producer and screenwriter (d. 1998)\n* 1912 – Eleanor Cameron, Canadian-American author and critic (d. 1996)\n*  1912   – Neil McCorkell, Anglo-South African cricketer and coach (d. 2013)\n*  1912   – Wernher von Braun, German-American physicist and engineer (d. 1977)\n* 1913 – Abidin Dino, Turko-French painter and illustrator (d. 1993)\n* 1914 – Milbourne Christopher, American magician and author (d. 1984)\n* 1915 – Mary Innes-Ker, Duchess of Roxburghe (d. 2014)\n*  1915   – Vasily Zaytsev, Russian captain (d. 1991)\n* 1917 – Harry Cranbrook Allen, English historian (d. 1998)\n* 1918 – Stanley Armour Dunham, American sergeant (d. 1992)\n*  1918   – Helene Hale, American politician (d. 2013)\n* 1919 – Carl Graffunder, American architect and educator (d. 2013)\n* 1920 – Neal Edward Smith, American pilot, lawyer and politician\n*  1920   – Tetsuharu Kawakami, Japanese baseball player and manager (d. 2013)\n* 1921 – Donald Campbell, English racing driver (d. 1967)\n*  1921   – Peter Lawler, Australian public servant (d. 2017)\n* 1922 – Marty Allen, American comedian and actor (d. 2018)\n*  1922   – Ugo Tognazzi, Italian actor (d. 1990)\n* 1923 – Angelo Ingrassia, American soldier and judge (d. 2013)\n* 1924 – Rodney Mims Cook, Sr., American lieutenant and politician (d. 2013)\n*  1924   – Bette Nesmith Graham, American inventor, invented Liquid Paper (d. 1980)\n*  1924   – Olga Kennard, English crystallographer and academic\n*  1924   – John Madin, English architect (d. 2012)\n* 1925 – David Watkin, English cinematographer (d. 2008)\n* 1929 – Roger Bannister, English runner, neurologist and academic\n*  1929   – Michael Manser, English architect and engineer (d. 2016)\n* 1931 – Yevgeny Grishin, Russian speed skater (d. 2005)\n*  1931   – Viktor Korchnoi, Russian chess player and author (d. 2016)\n*  1931   – Yevdokiya Mekshilo, Russian skier (d. 2013)\n* 1932 – Don Marshall, Canadian ice hockey player\n* 1933 – Norman Bailey, Anglo-American opera singer and educator\n*  1933   – Philip Zimbardo, American psychologist and academic\n* 1934 – Ludvig Faddeev, Russian mathematician and physicist\n*  1934   – Mark Rydell, American actor, director and producer\n* 1935 – Barry Cryer, English comedian, actor and screenwriter\n* 1936 – Jannis Kounellis, Greek painter and sculptor\n* 1937 – Craig Breedlove, American racing driver\n*  1937   – Tony Burton, American actor, comedian, boxer and American football player (d. 2016)\n*  1937   – Robert Gallo, American physician and academic\n* 1938 – Jon Finlayson, Australian actor and screenwriter (d. 2012)\n* 1939 – Robin Herd, English engineer and businessman\n*  1939   – Terry Paine, English footballer\n* 1942 – Michael Haneke, Austrian director, producer and screenwriter\n*  1942   – Jimmy Miller, American record producer and musician (d. 1994) \n*  1942   – Walter Rodney, Guyanese historian, scholar and activist (d. 1980)\n* 1943 – Andrew Crockett, Scottish-English economist and banker (d. 2012)\n*  1943   – Lee May, American baseball player and coach\n*  1943   – Sharon Presley, American author and academic\n*  1943   – Nils-Aslak Valkeapää, Finnish singer, author and director (d. 2001)\n* 1944 – B. P. Gavrilov, Russian rugby player (d. 2006)\n*  1944   – Tony McPhee, English singer-songwriter and guitarist \n*  1944   – Michael Nyman, English composer of minimalist music and pianist\n* 1945 – Franco Battiato, Italian singer-songwriter and director\n*  1945   – David Grisman, American mandolin player and composer \n* 1946 – Alan Bleasdale, English screenwriter and producer\n* 1947 – Elizabeth Ann Scarborough, American author\n* 1948 – Wasim Bari, Pakistani cricketer\n*  1948   – Marie Malavoy, German-Canadian educator and politician\n* 1949 – Ric Ocasek, American singer-songwriter, guitarist and producer \n* 1950 – Corinne Cléry, French actress\n*  1950   – Phil Lanzon, English keyboard player and songwriter \n*  1950   – Ahdaf Soueif, Egyptian author and translator\n* 1951 – Ron Jaworski, American football player and sportscaster\n*  1951   – Adrian Reynard, English businessman, founded Reynard Motorsport\n* 1952 – Francesco Clemente, Italian painter and illustrator\n*  1952   – Kent Lambert, New Zealand rugby player \n*  1952   – Kim Stanley Robinson, American author\n*  1952   – Rex Tillerson, American businessman, engineer and diplomat; 69th United States Secretary of State\n* 1953 – Bo Díaz, Venezuelan baseball player (d. 1990)\n*  1953   – Chaka Khan, American singer-songwriter \n*  1953   – Kiran Mazumdar-Shaw, Indian zoologist and businesswoman\n* 1954 – Geno Auriemma, Italian-American basketball player and coach\n*  1954   – Kenneth Cole, American fashion designer, founded Kenneth Cole Productions\n* 1955 – Moses Malone, American basketball player and sportscaster (d. 2015)\n* 1956 – José Manuel Barroso, Portuguese academic and politician, 115th Prime Minister of Portugal\n*  1956   – Andrew Mitchell, English soldier and politician, Secretary of State for International Development\n*  1956   – Jeremy Wade, English biologist and author\n* 1957 – Lucio Gutiérrez, Ecuadorian politician, 52nd President of Ecuador\n*  1957   – Robbie James, Welsh footballer and manager (d. 1998)\n*  1957   – Amanda Plummer, American actress\n* 1958 – Etienne De Wilde, Belgian cyclist\n*  1958   – Bengt-Åke Gustafsson, Swedish ice hockey player and coach\n*  1958   – Hugh Grant, Scottish business executive\n* 1959 – Catherine Keener, American actress \n* 1960 – Nicol Stephen, Baron Stephen, Scottish lawyer and politician, 2nd Deputy First Minister of Scotland\n* 1961 – Roger Crisp, English philosopher and academic\n*  1961   – Craig Green, New Zealand rugby player\n*  1961   – Helmi Johannes, Indonesian journalist and producer\n* 1962 – Steve Redgrave, English rower\n* 1963 – Míchel, Spanish footballer and manager\n*  1963   – Juan Ramón López Caro, Spanish footballer and manager\n*  1963   – Ana Fidelia Quirot, Cuban runner\n* 1964 – Hope Davis, American actress \n*  1965   – Gary Whitehead, American poet and painter\n* 1966 – Lorenzo Daniel, American sprinter\n*  1966   – Vasilis Vouzas, Greek footballer and manager\n* 1968 – Damon Albarn, English singer-songwriter, producer and actor\n*  1968   – Mike Atherton, English cricketer and journalist\n*  1968   – Mitch Cullin, American author\n*  1968   – Fernando Hierro, Spanish footballer and manager\n*  1968   – Pierre Palmade, French actor and screenwriter\n* 1971 – Yasmeen Ghauri, Canadian model\n*  1971   – Gail Porter, Scottish model and television host\n*  1971   – Alexander Selivanov, Russian ice hockey player\n*  1971   – Hiroyoshi Tenzan, Japanese wrestler\n* 1972 – Jonas Björkman, Swedish-Monégasque tennis player and coach\n*  1972   – Joe Calzaghe, Welsh boxer\n*  1972   – Judith Godrèche, French actress and author\n* 1973 – Jerzy Dudek, Polish footballer\n*  1973   – Wim Eyckmans, Belgian racing driver\n*  1973   – Jason Kidd, American basketball player and coach\n* 1974 – Randall Park, American actor, director and screenwriter\n* 1975 – Burak Gürpınar, Turkish drummer \n* 1976 – Jayson Blair, American journalist and author\n*  1976   – Chris Hoy, Scottish cyclist and racing driver\n*  1976   – Smriti Irani, Indian actress, producer and politician, Indian Minister of Human Resource Development\n*  1976   – Dougie Lampkin, English motorcycle racer\n*  1976   – Michelle Monaghan, American actress\n*  1976   – Jeremy Newberry, American football player\n*  1976   – Joel Peralta, Dominican baseball player\n*  1976   – Keri Russell, American actress \n*  1976   – Ricardo Zonta, Brazilian racing driver\n* 1977 – Miklos Perlus, Canadian actor and screenwriter\n* 1978 – Simon Gärdenfors, Swedish illustrator\n*  1978   – Walter Samuel, Argentinian footballer\n* 1979 – Mark Buehrle, American baseball player\n*  1979   – Donncha O'Callaghan, Irish rugby player\n* 1980 – Russell Howard, English comedian\n* 1981 – Erin Crocker, American racing driver\n*  1981   – Tony Peña, Jr., Dominican baseball player\n*  1981   – Shelley Rudman, English bobsledder\n*  1981   – Giuseppe Sculli, Italian footballer\n* 1982 – José Contreras Arrau, Chilean footballer\n*  1982   – Andrea Musacco, Italian footballer\n*  1982   – Evgeni Striganov, Estonian ice dancer\n* 1983 – Hakan Balta, Turkish footballer\n*  1983   – Mo Farah, Somali-English runner\n*  1983   – Sascha Riether, German footballer\n*  1983   – Jerome Thomas, English footballer\n* 1984 – Ryan Araña, Filipino basketball player\n* 1984    – Brandon Marshall, American football player\n* 1985 – Maurice Jones-Drew, American football player\n*  1985   – Bethanie Mattek-Sands, American tennis player\n* 1986 – Patrick Bordeleau, Canadian ice hockey player\n*  1986   – Andrea Dovizioso, Italian motorcycle racer\n*  1986   – Brett Eldredge, American singer-songwriter and guitarist\n*  1986   – Kangana Ranaut, Indian actress\n* 1987 – Alan Toovey, Australian footballer\n* 1988 – Dellin Betances, American baseball player\n*  1988   – Jason Kenny, English cyclist\n*  1988   – Michal Neuvirth, Czech ice hockey player\n* 1989 – Nikola Gulan, Serbian footballer\n*  1989   – Luis Fernando Silva, Mexican footballer\n*  1989   – Ayesha Curry, Canadian-American chef, author and television personality\n* 1990 – Jaime Alguersuari, Spanish racing driver\n*  1990   – Robert Zickert, German footballer\n* 1991 – Gregg Wylde, Scottish footballer\n* 1992 – Tolga Ciğerci, German-Turkish footballer\n*  1992   – Morgan Evans, Welsh rugby league player\n*  1992   – Kyrie Irving, Australian-American basketball player\n* 1993 – Kyle Lovett, Australian rugby league player\n*  1993   – Aytaç Kara, Turkish footballer\n* 1994 – Nick Powell, English footballer\n* 1995 – Kevin Kauber, Estonian footballer\n*  1995   – Jan Lisiecki, Canadian pianist\n*  1995   – Ozan Tufan, Turkish footballer\n\nDeaths\n\n* 851 – Zhou Chi, Chinese historian and politician (b. 793)\n* 1022 – Emperor Zhenzong of China (b. 968)\n* 1103 – Eudes I, Duke of Burgundy (b. 1058)\n* 1361 – Henry of Grosmont, 1st Duke of Lancaster, English politician, Lord High Steward of England (b. 1310)\n* 1369 – Peter of Castile (b. 1334)\n* 1483 – Yolande, Duchess of Lorraine (b. 1428)\n* 1548 – Itagaki Nobukata, Japanese samurai (b. 1489)\n* 1555 – Pope Julius III (b. 1487)\n* 1559 – Gelawdewos, Ethiopian emperor (b. 1521)\n* 1593 – Henry Barrowe, English Puritan and separatist (b. 1550)\n* 1596 – Henry Unton, English diplomat (b. 1557)\n* 1606 – Justus Lipsius, Flemish philologist and scholar (b. 1547)\n* 1618 – James Hamilton, 1st Earl of Abercorn, Scottish police officer and politician (b. 1575)\n* 1629 – Francis Fane, 1st Earl of Westmorland (b. c. 1580)\n* 1675 – Anthoni van Noordt, Dutch organist and composer (b. 1619)\n* 1680 – Nicolas Fouquet, French politician (b. 1615)\n* 1742 – Jean-Baptiste Dubos, French historian and author (b. 1670)\n* 1747 – Claude Alexandre de Bonneval, French general (b. 1675)\n* 1748 – Johann Gottfried Walther, German organist and composer (b. 1684)\n* 1754 – Johann Jakob Wettstein, Swiss theologian and critic (b. 1693)\n* 1783 – Charles Carroll, English barrister and politician (b. 1723)\n* 1801 – Paul I of Russia (b. 1754)\n* 1842 – Stendhal, French novelist (b. 1783)\n* 1884 – Henry C. Lord, American businessman (b. 1824)\n* 1910 – Nadar, French photographer, journalist, and author (b. 1820)\n* 1914 – Rafqa Pietra Choboq Ar-Rayès, Lebanese saint (b. 1832)\n* 1923 – Hovhannes Tumanyan Armenian poet and author (b. 1869)\n* 1927 – Paul César Helleu, French painter and etcher (b. 1859)\n* 1931 – Shivaram Rajguru, Indian activist (b. 1908)\n*  1931   – Bhagat Singh, Indian activist (b. 1907)\n*  1931   – Sukhdev Thapar, Indian activist (b. 1907)\n* 1953 – Raoul Dufy, French painter and illustrator (b. 1877)\n*  1953   – Oskar Luts, Estonian author and playwright (b. 1887)\n* 1955 – Arthur Bernardes, Brazilian politician, 12th President of Brazil (b. 1875)\n* 1960 – Franklin Pierce Adams, American journalist and author (b. 1881)\n*  1960   – Said Nursî, Kurdish theologian and scholar (b. 1878)\n* 1961 – Albert Bloch, American painter and educator (b. 1882)\n*  1961   – Jack Russell, English cricketer (b. 1887)\n* 1963 – Thoralf Skolem, Norwegian mathematician and logician (b. 1887)\n* 1964 – Peter Lorre, American actor (b. 1904)\n* 1965 – Mae Murray, American actress, dancer, producer, and screenwriter (b. 1889)\n* 1968 – Edwin O'Connor, American journalist and author (b. 1918)\n* 1972 – Cristóbal Balenciaga, Spanish fashion designer, founded Balenciaga (b. 1895)\n* 1978 – Haim Ernst Wertheimer, Israeli biochemist and academic (b. 1893)\n* 1979 – Ted Anderson, English footballer (b. 1911)\n* 1980 – Arthur Melvin Okun, American economist and academic (b. 1928)\n* 1981 – Beatrice Tinsley, English-New Zealand astronomer and cosmologist (b. 1941)\n* 1981 – Mike Hailwood, English motorcyclist (b. 1940)\n* 1985 – Richard Beeching, Baron Beeching, English physicist and engineer (b. 1913)\n*  1985   – Peter Charanis, Greek-American scholar and educator (b. 1908)\n* 1987 – Olev Roomet, Estonian singer and violinist (b. 1901)\n* 1990 – John Dexter, English director and producer (b. 1925)\n* 1991 – Parkash Singh, Indian soldier, Victoria Cross recipient (b. 1913)\n* 1992 – Friedrich Hayek, Austrian-German economist, philosopher, and academic, Nobel Prize laureate (b. 1899)\n*  1992   – Ron Lapointe, Canadian ice hockey player and coach (b. 1949)\n* 1994 – Luis Donaldo Colosio, Mexican economist and politician (b. 1950)\n*  1994   – Giulietta Masina, Italian actress (b. 1921)\n* 1995 – Davie Cooper, Scottish footballer and coach (b. 1956)\n* 1999 – Luis María Argaña, Paraguayan judge and politician, Vice President of Paraguay (b. 1932)\n*  1999   – Osmond Borradaile, Canadian director and cinematographer (b. 1898)\n* 2001 – Rowland Evans, American journalist (b. 1921)\n* 2001 – Margaret Jones, British archaeologist (b. 1916)\n*  2001   – Robert Laxalt, American author (b. 1923)\n*  2001   – David McTaggart, Canadian badminton player and environmentalist (b. 1932)\n* 2002 – Eileen Farrell, American soprano (b. 1920)\n*  2002   – Ben Hollioake, Australian-English cricketer (b. 1977)\n* 2003 – Fritz Spiegl, Austrian-English flute player and journalist (b. 1926)\n* 2004 – Rupert Hamer, Australian soldier, lawyer, and politician, 39th Premier of Victoria (b. 1916)\n* 2006 – David B. Bleak, American sergeant, Medal of Honor recipient (b. 1932)\n*  2006   – Desmond Doss, American soldier, Medal of Honor recipient (b. 1919)\n*  2006   – Cindy Walker, American singer-songwriter and dancer (b. 1918)\n* 2007 – Paul Cohen, American mathematician and theorist (b. 1934)\n*  2007   – Eric Medlen, American race car driver (b. 1973)\n* 2008 – Vaino Vahing, Estonian psychiatrist, author, and playwright (b. 1940)\n* 2009 – Ghukas Chubaryan, Armenian sculptor (b. 1923)\n*  2009   – Raúl Macías, Mexican boxer and trainer (b. 1934)\n* 2011 – Jean Bartik, American computer scientist and engineer (b. 1924)\n*  2011   – Elizabeth Taylor, American-British actress, socialite and humanitarian (b. 1932)\n* 2012 – Abdullahi Yusuf Ahmed, Somalian politician, President of Somalia (b. 1934)\n*  2012   – Jim Duffy, American animator, director, and producer (b. 1937)\n*  2012   – Naji Talib, Iraqi politician, 52nd Prime Minister of Iraq (b. 1917)\n*  2012   – Lonnie Wright, American basketball and football player (b. 1945)\n* 2013 – Boris Berezovsky, Russian-born Soviet-British mathematician and businessman (b. 1946)\n*  2013   – Onofre Corpuz, Filipino economist, historian, and academic (b. 1926)\n*  2013   – Virgil Trucks, American baseball player and coach (b. 1917)\n*  2013   – Joe Weider, Canadian-American bodybuilder and publisher, co-founded the International Federation of BodyBuilding & Fitness (b. 1919)\n* 2014 – Dave Brockie, Canadian-American singer-songwriter and bass player (b. 1963)\n*  2014   – Jaroslav Šerých, Czech painter and illustrator (b. 1928)\n*  2014   – Adolfo Suárez, Spanish lawyer and politician, 1st Prime Minister of Spain (b. 1932)\n* 2015 – Gian Vittorio Baldi, Italian director, producer, and screenwriter (b. 1930)\n*  2015   – Lee Kuan Yew, Singaporean lawyer and politician, 1st Prime Minister of Singapore (b. 1923)\n*  2015   – Bobby Lowther, American basketball player and lieutenant (b. 1923)\n*  2015   – Lil' Chris, English singer-songwriter, actor, and television personality (b. 1990)\n* 2016 – Joe Garagiola, Sr., American baseball player and sportscaster (b. 1926)\n*  2016   – Ken Howard, American actor (b. 1944)\n\nHolidays and observances\n\n* Christian feast day:\n** Rafqa Pietra Choboq Ar-Rayès (Maronite Church)\n** Turibius of Mogrovejo\n** March 23 (Eastern Orthodox liturgics)\n* Day of Hungarian-Polish Friendship (Hungary and Poland)\n* Day of the Sea (Bolivia)\n* Earliest day on which Easter Monday can fall, while April 26 is the latest; celebrated on Monday after Easter. (Western Christianity)\n** Family Day (South Africa)\n** Śmigus-Dyngus ((Poland, Ukraine), Polish diaspora communities)\n* Ministry of Environment and Natural Resources Day (Azerbaijan)\n* Pakistan Day (Pakistan)\n* Promised Messiah Day (Ahmadiyya)\n* World Meteorological Day. March 23. http://en.wikipedia.org/?curid=20210."
  }
}
