{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10313",
  "eid" : "f5025560-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778490806,
  "textBody" : "Edward Osborne Wilson (born June 10, 1929), usually cited as E. O. Wilson, is an American biologist, researcher, theorist, naturalist and author. His biological specialty is myrmecology, the study of ants, on which he has been called the world's leading expert.\n\nWilson has been called \"the father of sociobiology\" and \"the father of biodiversity\", his environmental advocacy, and his secular-humanist and deist ideas pertaining to religious and ethical matters. Among his greatest contributions to ecological theory is the theory of island biogeography, which he developed in collaboration with the mathematical ecologist Robert MacArthur, which was the foundation of the development of conservation area design, as well as the unified neutral theory of biodiversity of Stephen Hubbell.\n\nWilson is (2014) the Pellegrino University Research Professor, Emeritus in Entomology for the Department of Organismic and Evolutionary Biology at Harvard University, a lecturer at Duke University, and a Fellow of the Committee for Skeptical Inquiry. He is a Humanist Laureate of the International Academy of Humanism. He is a two-time winner of the Pulitzer Prize for General Nonfiction (for On Human Nature in 1979, and The Ants in 1991) and a New York Times bestseller for The Social Conquest of Earth, Letters to a Young Scientist, and The Meaning of Human Existence.\n\nEarly life\n\nWilson was born in Birmingham, Alabama. According to his autobiography Naturalist, he grew up mostly around Washington, D.C. and in the countryside around Mobile, Alabama.Edward O. Wilson – Naturalist, Island Press; (April 24, 2006),  From an early age, he was interested in natural history. His parents, Edward and Inez Wilson, divorced when he was seven. The young naturalist grew up in several cities and towns, moving around with his father and his stepmother.\n\nIn the same year that his parents divorced, Wilson blinded himself in one eye in a fishing accident. He suffered for hours, but he continued fishing. He did not complain because he was anxious to stay outdoors. He did not seek medical treatment. Several months later, his right pupil clouded over with a cataract. He was admitted to Pensacola Hospital to have the lens removed. Wilson writes, in his autobiography, that the \"surgery was a terrifying [19th] century ordeal\". Wilson was left with full sight in his left eye, with a vision of 20/10. The 20/10 vision prompted him to focus on \"little things\": \"I noticed butterflies and ants more than other kids did, and took an interest in them automatically.\"\n\nAlthough he had lost his stereoscopic vision, he could still see fine print and the hairs on the bodies of small insects. His reduced ability to observe mammals and birds led him to concentrate on insects.\n\nAt nine, Wilson undertook his first expeditions at the Rock Creek Park in Washington, DC. He began to collect insects and he gained a passion for butterflies. He would capture them using nets made with brooms, coat hangers, and cheesecloth bags. Going on these expeditions led to Wilson's fascination with ants. He describes in his autobiography how one day he pulled the bark of a rotting tree away and discovered citronella ants underneath. The worker ants he found were \"short, fat, brilliant yellow, and emitted a strong lemony odor\". Wilson said the event left a \"vivid and lasting impression on [him]\". He also earned the Eagle Scout award and served as Nature Director of his Boy Scout summer camp. At the age of 18, intent on becoming an entomologist, he began by collecting flies, but the shortage of insect pins caused by World War II caused him to switch to ants, which could be stored in vials. With the encouragement of Marion R. Smith, a myrmecologist from the National Museum of Natural History in Washington, Wilson began a survey of all the ants of Alabama. This study led him to report the first colony of fire ants in the US, near the port of Mobile.first-hand account, Smithsonian Institution talk, April 22, 2010\n\nEducation\n\nConcerned that he might not be able to afford to go to a university, Wilson tried to enlist in the United States Army. He planned to earn U.S. government financial support for his education, but failed the Army medical examination due to his impaired eyesight. Wilson was able to afford to enroll in the University of Alabama after all, earning his B.S. and M.S. degrees in biology there in 1950. In 1952 he transferred to Harvard University.\n \nAppointed to the Harvard Society of Fellows, he could travel on overseas expeditions, collecting ant species of Cuba and Mexico and travel the South Pacific, including Australia, New Guinea, Fiji, New Caledonia and Sri Lanka. In 1955, he received his Ph.D. and married Irene Kelley.\n\nCareer\n\nFrom 1956 until 1996 Wilson was part of the faculty of Harvard. \nHe began as an ant taxonomist and worked on understanding their evolution, how they developed into new species by escaping environmental disadvantages and moving into new habitats. He developed a theory of the \"taxon cycle\".\n\nHe collaborated with mathematician William Bossert, and discovered the chemical nature of ant communication, via pheromones. In the 1960s he collaborated with mathematician and ecologist Robert MacArthur. Together, they tested the theory of species equilibrium on a tiny island in the Florida Keys. He eradicated all insect species and observed the re-population by new species. A book The Theory of Island Biogeography about this experiment became a standard ecology text.\n\nIn 1971, he published the book The Insect Societies about the biology of social insects like ants, bees, wasps and termites. In 1973, Wilson was appointed 'Curator of Insects' at the Museum of Comparative Zoology. In 1975, he published the book Sociobiology: The New Synthesis applying his theories of insect behavior to vertebrates, and in the last chapter, humans. He speculated that evolved and inherited tendencies were responsible for hierarchical social organisation among humans. In 1978 he published On Human Nature, which dealt with the role of biology in the evolution of human culture and won a Pulitzer Prize for General Nonfiction.\n\nIn 1981 after collaborating with Charles Lumsden, he published Genes, Mind and Culture, a theory of gene-culture coevolution. In 1990 he published The Ants, co-written with Bert Hölldobler, his second Pulitzer Prize for General Nonfiction.\n\nIn the 1990s, he published The Diversity of Life (1992) an autobiography, Naturalist (1994), and Consilience: The Unity of Knowledge (1998) about the unity of the natural and social sciences.\n\nRetirement\n\nIn 1996, Wilson officially retired from Harvard University, where he continues to hold the positions of Professor Emeritus and Honorary Curator in Entomology. He founded the E.O. Wilson Biodiversity Foundation, which finances the PEN/E. O. Wilson Literary Science Writing Award and is an \"independent foundation\" at the Nicholas School of the Environment, Duke University. Wilson became a special lecturer at Duke University as part of the agreement.\n\nWilson has published 14 books during the new millennium: The Future of Life, 2002, \nPheidole in the New World: A Dominant, Hyperdiverse Ant Genus, 2003, \nFrom So Simple a Beginning: Darwin's Four Great Books, 2005, \nThe Creation: An Appeal to Save Life on Earth, September 2006, \nNature Revealed: Selected Writings 1949–2006, \nThe Superorganism: The Beauty, Elegance, and Strangeness of Insect Societies, 2009,\nAnthill: A Novel April 2010, \nKingdom of Ants: Jose Celestino Mutis and the Dawn of Natural History in the New World, 2010,\nThe Leafcutter Ants: Civilization by Instinct, 2011, \nThe Social Conquest of Earth, 2012,\nHalf-Earth: Our Planet's Fight for Life, 2016.\n\nHe published 3 books in 2014 alone: Letters to a Young Scientist, \nA Window on Eternity: A Biologist's Walk Through Gorongosa National Park, and\nThe Meaning of Human Existence.\n\nHe and his wife Irene reside in Lexington, Massachusetts. His daughter, Catherine, and her husband Jonathan, reside in nearby Stow, Massachusetts.\n\nWork\n\nSociobiology: The New Synthesis, 1975\n\nWilson used sociobiology and evolutionary principles to explain the behavior of social insects and then to understand the social behavior of other animals, including humans, thus established sociobiology as a new scientific field. He argued that all animal behavior, including that of humans, is the product of heredity, environmental stimuli, and past experiences, and that free will is an illusion. He has referred to the biological basis of behaviour as the \"genetic leash\".E. O. Wilson, Consilience: The Unity of Knowledge, New York, Knopf, 1998. The sociobiological view is that all animal social behavior is governed by epigenetic rules worked out by the laws of evolution. This theory and research proved to be seminal, controversial, and influential.Wolfe, Tom (1996). Sorry, But Your Soul Just Died. Vol. 158, Issue 13, Forbes\n\nWilson has argued that the unit of selection is a gene, the basic element of heredity. The target of selection is normally the individual who carries an ensemble of genes of certain kinds. With regard to the use of kin selection in explaining the behavior of eusocial insects, the \"new view that I'm proposing is that it was group selection all along, an idea first roughly formulated by Darwin.\"\n\nSociobiological research was at the time particularly controversial with regard to its application to humans. The theory established a scientific argument for rejecting the common doctrine of tabula rasa, which holds that human beings are born without any innate mental content and that culture functions to increase human knowledge and aid in survival and success. In the final chapter of the book Sociobiology Wilson argues that the human mind is shaped as much by genetic inheritance as it is by culture if not more. There are, Wilson suggests in the chapter, limits on just how much influence social and environmental factors can have in altering human behavior.Wilson, E. O. Sociobiology. Harvard. Chapter 27.\n\nReception\n\nSociobiology was initially met with substantial criticism. Several of Wilson's colleagues at Harvard, such as Richard Lewontin and Stephen Jay Gould, were strongly opposed to his ideas regarding sociobiology. Gould, Lewontin, and others from the Sociobiology Study Group from the Boston area wrote \"Against 'Sociobiology'\" in an open letter criticizing Wilson's \"deterministic view of human society and human action\".Allen, Elizabeth, et al. (1975). [http://www.nybooks.com/articles/9017?sess\n305fe41afae729849e1e7eb4b004bb81 \"Against 'Sociobiology'\".] [letter] New York Review of Books 22 (Nov. 13): 182, 184–186. Although attributed to members of the Sociobiology Study Group, it seems that Lewontin was the main author. In a 2011 interview, Wilson said, \"I believe Gould was a charlatan. I believe that he was ... seeking reputation and credibility as a scientist and writer, and he did it consistently by distorting what other scientists were saying and devising arguments based upon that distortion.\"\n\nMarshall Sahlins's 1976 work The Use and Abuse of Biology was a direct criticism of Wilson's theories.\n\nThere was also political opposition. Sociobiology re-ignited the nature and nurture debate. Wilson was accused of racism, misogyny, and sympathy to eugenics. In one incident in November 1978, his lecture was attacked by the International Committee Against Racism, a front group of the Marxist Progressive Labor Party, where one member poured a pitcher of water on Wilson's head and chanted \"Wilson, you're all wet\" at an AAAS conference. Wilson later spoke of the incident as a source of pride: \"I believe...I was the only scientist in modern times to be physically attacked for an idea.\"\n\nObjections from evangelical Christians included those of Paul E. Rothrock in 1987: \"... sociobiology has the potential of becoming a religion of scientific materialism.\"[http://www.asa3.org/asa/PSCF/1987/PSCF6-87Rothrock.html Mythology of Scientific Materialism.] Paul E. Rothrock and Mary Ellen Rothrock, PSCF 39 (June 1987): 87-93\nPhilosopher Mary Midgley encountered Sociobiology in the process of writing Beast and Man (1996)  and significantly rewrote the book to offer a critique of Wilson's views. Midgley praised the book for the study of animal behavior, clarity, scholarship, and encyclopedic scope, but extensively critiqued Wilson for conceptual confusion, scientism, and anthropomorphism of genetics.\n\nThe book and its reception were mentioned in Jonathan Haidt’s book The Righteous Mind.Haidt 2012, p. 37-38.\n\nOn Human Nature, 1978\n\nWilson wrote in his 1978 book On Human Nature, \"The evolutionary epic is probably the best myth we will ever have.\" Wilson's use of the word \"myth\" provides people with meaningful placement in time celebrating shared heritage. Wilson's fame prompted use of the morphed phrase epic of evolution. The book won the Pulitzer Prize in 2011.\n\nThe Ants, 1990\n\nWilson, along with Bert Hölldobler, carried out a systematic study of ants and ant behavior, culminating in the 1990 encyclopedic work The Ants. Because much self-sacrificing behavior on the part of individual ants can be explained on the basis of their genetic interests in the survival of the sisters, with whom they share 75% of their genes (though the actual case is some species' queens mate with multiple males and therefore some workers in a colony would only be 25% related), Wilson argued for a sociobiological explanation for all social behavior on the model of the behavior of the social insects.\n\nWilson has said in reference to ants \"Karl Marx was right, socialism works, it is just that he had the wrong species\". He meant that while ants and other eusocial species appear to live in communist-like societies, they only do so because they are forced to do so from their basic biology, as they lack reproductive independence: worker ants, being sterile, need their ant-queen in order to survive as a colony and a species, and individual ants cannot reproduce without a queen and are thus forced to live in centralised societies. Humans, however, do possess reproductive independence so they can give birth to offspring without the need of a \"queen\", and in fact humans enjoy their maximum level of Darwinian fitness only when they look after themselves and their offspring, while finding innovative ways to use the societies they live in for their own benefit.\n\nConsilience, 1998\n\nIn his 1998 book Consilience: The Unity of Knowledge, Wilson discussed methods that have been used to unite the sciences, and might be able to unite the sciences with the humanities. Wilson used the term \"consilience\" to describe the synthesis of knowledge from different specialized fields of human endeavor. He defined human nature as a collection of epigenetic rules, the genetic patterns of mental development. He argued that culture and rituals are products, not parts, of human nature. He said art is not part of human nature, but our appreciation of art is. He suggested that concepts such as art appreciation, fear of snakes, or the incest taboo (Westermarck effect) could be studied by scientific methods of the natural sciences and be part of interdisciplinary research.\n\nThe book was mentioned in Jonathan Haidt’s book The Righteous Mind.\n\nSpiritual and political beliefs\n\nScientific humanism\n\nWilson coined the phrase scientific humanism as \"the only worldview compatible with science's growing knowledge of the real world and the laws of nature\".in Harvard Magazine December 2005 p 33. Wilson argued that it is best suited to improve the human condition. In 2003, he was one of the signers of the Humanist Manifesto.\n\nGod and religion\n\nIn a New Scientist interview published on 21 January 2015, Wilson said that \"Religion 'is dragging us down' and must be eliminated 'for the sake of human progress, and \"So I would say that for the sake of human progress, the best thing we could possibly do would be to diminish, to the point of eliminating, religious faiths.\"\nOn the question of God, Wilson has described his position as provisional deismThe Creation and explicitly denied the label of \"atheist\", preferring \"agnostic\". He has explained his faith as a trajectory away from traditional beliefs: \"I drifted away from the church, not definitively agnostic or atheistic, just Baptist & Christian no more.\" Wilson argues that the belief in God and rituals of religion are products of evolution.Human Nature He argues that they should not be rejected or dismissed, but further investigated by science to better understand their significance to human nature. In his book The Creation, Wilson suggests that scientists ought to \"offer the hand of friendship\" to religious leaders and build an alliance with them, stating that \"Science and religion are two of the most potent forces on Earth and they should come together to save the creation.\"[http://www.news.harvard.edu/gazette/2006/06.15/03-biodiversity.html Naturalist E.O. Wilson is optimistic]  Harvard Gazette June 15, 2006\n\nWilson made an appeal to the religious community on the lecture circuit at Midland College, Texas, for example, and that \"the appeal received a 'massive reply'\", that a covenant had been written and that a \"partnership will work to a substantial degree as time goes on\".[http://www.mywesttexas.com/articles/2009/09/18/news/top_stories/doc4ab31071978e4063758641.txt Scientist says there is hope to save planet]  mywesttexas.com, September 18, 2009\n\nEcology\n\nWilson has said that, if he could start his life over he would work in microbial ecology, when discussing the reinvigoration of his original fields of study since the 1960s. He studied the mass extinctions of the 20th century and their relationship to modern society, and in 1998 argued for an ecological approach at the Capitol:\n\nWilson has been part of the international conservation movement, as a consultant to Columbia University's Earth Institute, as a director of the American Museum of Natural History, Conservation International, The Nature Conservancy and the World Wildlife Fund.\n\nUnderstanding the scale of the extinction crisis has led him to advocate for forest protection, including the \"Act to Save America's Forests\", first introduced in 1998, until 2008, but never passed. The Forests Now Declaration calls for new markets-based mechanisms to protect tropical forests. In 2014, Wilson called for setting aside 50% of the earth's surface for other species to thrive in as the only possible strategy to solve the extinction crisis.\n\nAwards and honors\n\nWilson's scientific and conservation honors include:\n\n* Member, National Academy of Sciences, 1969\n* U.S. National Medal of Science, 1976\n* Leidy Award, 1979, from the Academy of Natural Sciences of Philadelphia\n* Pulitzer Prize for On Human Nature, 1979 https://www.as.ua.edu/2012/09/01/legendary-biologist-and-pulitzer-prize-winner-e-o-wilson-visits-ua-as-scholar-in-residence/\n* Tyler Prize for Environmental Achievement, 1984\n* ECI Prize, International Ecology Institute, terrestrial ecology, 1987\n*Honorary doctorate from the Faculty of Mathematics and Science at Uppsala University, Sweden, 1987http://www.uu.se/en/about-uu/traditions/prizes/honorary-doctorates/\n*  Academy of Achievement Golden Plate Award, 1988\n* Crafoord Prize, 1990, a prize awarded by the Royal Swedish Academy of Sciences http://www.crafoordprize.se/search/sitesearch.4.2f692b3510dbfce339680003867.html?querywilson&x\n30&y=7\n* Pulitzer Prize for The Ants (with Bert Hölldobler), 1991\n* International Prize for Biology, 1993\n* Carl Sagan Award for Public Understanding of Science, 1994\n* The National Audubon Society's Audubon Medal, 1995\n* Time Magazines 25 Most Influential People in America, 1995\n* Benjamin Franklin Medal for Distinguished Achievement in the Sciences of the American Philosophical Society, 1998.\n* American Humanist Association's 1999 Humanist of the Year\n* Lewis Thomas Prize for Writing about Science, 2000\n* Nierenberg Prize, 2001\n* Distinguished Eagle Scout Award 2004\n* Dauphin Island Sea Lab christened its newest research vessel the R/V E.O. Wilson in 2005.\n* Linnean Tercentenary Silver Medal, 2006\n* Addison Emery Verrill Medal from the Peabody Museum of Natural History, 2007\n* TED Prize 2007[http://www.ted.com/tedprize/winners2007.cfm ]  given yearly to honor a maximum of three individuals who have shown that they can, in some way, positively impact life on this planet.\n* XIX Premi Internacional Catalunya 2007\n* Member of the World Knowledge Dialogue Honorary Board, and Scientist in Residence for the 2008 symposium organized in Crans-Montana (Switzerland).\n* Distinguished Lecturer, University of Iowa, 2008–2009\n* E.O. Wilson Biophilia Center on Nokuse Plantation in Walton County, Florida 2009 video\n* Explorers Club Medal, 2009\n* 2010 BBVA Frontiers of Knowledge Award in the Ecology and Conservation Biology Category\n* Thomas Jefferson Medal in Architecture, 2010\n* 2010 Heartland Prize for fiction for his first novel Anthill: A Novel\n* EarthSky Science Communicator of the Year, 2010\n\nMain works\n\n* , coauthored with William Brown Jr.; paper honored in 1986 as a Science Citation Classic, i.e., as one of the most frequently cited scientific papers of all time.\n* The Theory of Island Biogeography, 1967, Princeton University Press (2001 reprint), , with Robert H. MacArthur\n* The Insect Societies, 1971, Harvard University Press, \n* Sociobiology: The New Synthesis 1975, Harvard University Press, (Twenty-fifth Anniversary Edition, 2000 )\n* On Human Nature, 1979, Harvard University Press, , winner of the 1979 Pulitzer Prize for General Nonfiction.\n* Genes, Mind and Culture: The Coevolutionary Process, 1981, Harvard University Press, \n* Promethean Fire: Reflections on the Origin of Mind, 1983, Harvard University Press, \n* Biophilia, 1984, Harvard University Press, \n* Success and Dominance in Ecosystems: The Case of the Social Insects, 1990, Inter-Research, \n* The Ants, 1990, Harvard University Press, , Winner of the 1991 Pulitzer Prize, with Bert Hölldobler\n* The Diversity of Life, 1992, Harvard University Press, , The Diversity of Life: Special Edition, \n* The Biophilia Hypothesis, 1993, Shearwater Books, , with Stephen R. Kellert\n* Journey to the Ants: A Story of Scientific Exploration, 1994, Harvard University Press, , with Bert Hölldobler\n* Naturalist, 1994, Shearwater Books, \n* In Search of Nature, 1996, Shearwater Books, , with Laura Simonds Southworth\n* Consilience: The Unity of Knowledge, 1998, Knopf, \n* The Future of Life, 2002, Knopf, \n* Pheidole in the New World: A Dominant, Hyperdiverse Ant Genus, 2003, Harvard University Press, \n* From So Simple a Beginning: Darwin's Four Great Books. 2005, W. W. Norton.\n* The Creation: An Appeal to Save Life on Earth, September 2006, W. W. Norton & Company, Inc. \n* Nature Revealed: Selected Writings 1949–2006, \n* The Superorganism: The Beauty, Elegance, and Strangeness of Insect Societies, 2009, W.W. Norton & Company, Inc. , with Bert Hölldobler\n* Anthill: A Novel, April 2010, W. W. Norton & Company, Inc. \n* Kingdom of Ants: Jose Celestino Mutis and the Dawn of Natural History in the New World, 2010, Johns Hopkins University Press, Baltimore, with José María Gómez Durán\n* The Leafcutter Ants: Civilization by Instinct, 2011, W.W. Norton & Company, Inc. , with Bert Hölldobler\n* The Social Conquest of Earth, 2012, Liveright Publishing Corporation, New York, \n* Letters to a Young Scientist, 2014, Liveright, \n* A Window on Eternity: A Biologist's Walk Through Gorongosa National Park, 2014, Simon & Schuster, \n* The Meaning of Human Existence, 2014, Liveright, \n* Half-Earth, 2016, Liveright, \n* The Origins of Creativity, 2017, Liveright, \n\nEdited works\n\n* From So Simple a Beginning: Darwin's Four Great Books, edited with introductions by Edward O. Wilson (2010 W.W. Norton)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "E. O. Wilson" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10313" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Edward Osborne Wilson (born June 10, 1929), usually cited as E. O. Wilson, is an American biologist, researcher, theorist, naturalist and author. His biological specialty is myrmecology, the study of ants, on which he has been called the world's leading expert.\n\nWilson has been called \"the father of sociobiology\" and \"the father of biodiversity\", his environmental advocacy, and his secular-humanist and deist ideas pertaining to religious and ethical matters. Among his greatest contributions to ecological theory is the theory of island biogeography, which he developed in collaboration with the mathematical ecologist Robert MacArthur, which was the foundation of the development of conservation area design, as well as the unified neutral theory of biodiversity of Stephen Hubbell.\n\nWilson is (2014) the Pellegrino University Research Professor, Emeritus in Entomology for the Department of Organismic and Evolutionary Biology at Harvard University, a lecturer at Duke University, and a Fellow of the Committee for Skeptical Inquiry. He is a Humanist Laureate of the International Academy of Humanism. He is a two-time winner of the Pulitzer Prize for General Nonfiction (for On Human Nature in 1979, and The Ants in 1991) and a New York Times bestseller for The Social Conquest of Earth, Letters to a Young Scientist, and The Meaning of Human Existence.\n\nEarly life\n\nWilson was born in Birmingham, Alabama. According to his autobiography Naturalist, he grew up mostly around Washington, D.C. and in the countryside around Mobile, Alabama.Edward O. Wilson – Naturalist, Island Press; (April 24, 2006),  From an early age, he was interested in natural history. His parents, Edward and Inez Wilson, divorced when he was seven. The young naturalist grew up in several cities and towns, moving around with his father and his stepmother.\n\nIn the same year that his parents divorced, Wilson blinded himself in one eye in a fishing accident. He suffered for hours, but he continued fishing. He did not complain because he was anxious to stay outdoors. He did not seek medical treatment. Several months later, his right pupil clouded over with a cataract. He was admitted to Pensacola Hospital to have the lens removed. Wilson writes, in his autobiography, that the \"surgery was a terrifying [19th] century ordeal\". Wilson was left with full sight in his left eye, with a vision of 20/10. The 20/10 vision prompted him to focus on \"little things\": \"I noticed butterflies and ants more than other kids did, and took an interest in them automatically.\"\n\nAlthough he had lost his stereoscopic vision, he could still see fine print and the hairs on the bodies of small insects. His reduced ability to observe mammals and birds led him to concentrate on insects.\n\nAt nine, Wilson undertook his first expeditions at the Rock Creek Park in Washington, DC. He began to collect insects and he gained a passion for butterflies. He would capture them using nets made with brooms, coat hangers, and cheesecloth bags. Going on these expeditions led to Wilson's fascination with ants. He describes in his autobiography how one day he pulled the bark of a rotting tree away and discovered citronella ants underneath. The worker ants he found were \"short, fat, brilliant yellow, and emitted a strong lemony odor\". Wilson said the event left a \"vivid and lasting impression on [him]\". He also earned the Eagle Scout award and served as Nature Director of his Boy Scout summer camp. At the age of 18, intent on becoming an entomologist, he began by collecting flies, but the shortage of insect pins caused by World War II caused him to switch to ants, which could be stored in vials. With the encouragement of Marion R. Smith, a myrmecologist from the National Museum of Natural History in Washington, Wilson began a survey of all the ants of Alabama. This study led him to report the first colony of fire ants in the US, near the port of Mobile.first-hand account, Smithsonian Institution talk, April 22, 2010\n\nEducation\n\nConcerned that he might not be able to afford to go to a university, Wilson tried to enlist in the United States Army. He planned to earn U.S. government financial support for his education, but failed the Army medical examination due to his impaired eyesight. Wilson was able to afford to enroll in the University of Alabama after all, earning his B.S. and M.S. degrees in biology there in 1950. In 1952 he transferred to Harvard University.\n \nAppointed to the Harvard Society of Fellows, he could travel on overseas expeditions, collecting ant species of Cuba and Mexico and travel the South Pacific, including Australia, New Guinea, Fiji, New Caledonia and Sri Lanka. In 1955, he received his Ph.D. and married Irene Kelley.\n\nCareer\n\nFrom 1956 until 1996 Wilson was part of the faculty of Harvard. \nHe began as an ant taxonomist and worked on understanding their evolution, how they developed into new species by escaping environmental disadvantages and moving into new habitats. He developed a theory of the \"taxon cycle\".\n\nHe collaborated with mathematician William Bossert, and discovered the chemical nature of ant communication, via pheromones. In the 1960s he collaborated with mathematician and ecologist Robert MacArthur. Together, they tested the theory of species equilibrium on a tiny island in the Florida Keys. He eradicated all insect species and observed the re-population by new species. A book The Theory of Island Biogeography about this experiment became a standard ecology text.\n\nIn 1971, he published the book The Insect Societies about the biology of social insects like ants, bees, wasps and termites. In 1973, Wilson was appointed 'Curator of Insects' at the Museum of Comparative Zoology. In 1975, he published the book Sociobiology: The New Synthesis applying his theories of insect behavior to vertebrates, and in the last chapter, humans. He speculated that evolved and inherited tendencies were responsible for hierarchical social organisation among humans. In 1978 he published On Human Nature, which dealt with the role of biology in the evolution of human culture and won a Pulitzer Prize for General Nonfiction.\n\nIn 1981 after collaborating with Charles Lumsden, he published Genes, Mind and Culture, a theory of gene-culture coevolution. In 1990 he published The Ants, co-written with Bert Hölldobler, his second Pulitzer Prize for General Nonfiction.\n\nIn the 1990s, he published The Diversity of Life (1992) an autobiography, Naturalist (1994), and Consilience: The Unity of Knowledge (1998) about the unity of the natural and social sciences.\n\nRetirement\n\nIn 1996, Wilson officially retired from Harvard University, where he continues to hold the positions of Professor Emeritus and Honorary Curator in Entomology. He founded the E.O. Wilson Biodiversity Foundation, which finances the PEN/E. O. Wilson Literary Science Writing Award and is an \"independent foundation\" at the Nicholas School of the Environment, Duke University. Wilson became a special lecturer at Duke University as part of the agreement.\n\nWilson has published 14 books during the new millennium: The Future of Life, 2002, \nPheidole in the New World: A Dominant, Hyperdiverse Ant Genus, 2003, \nFrom So Simple a Beginning: Darwin's Four Great Books, 2005, \nThe Creation: An Appeal to Save Life on Earth, September 2006, \nNature Revealed: Selected Writings 1949–2006, \nThe Superorganism: The Beauty, Elegance, and Strangeness of Insect Societies, 2009,\nAnthill: A Novel April 2010, \nKingdom of Ants: Jose Celestino Mutis and the Dawn of Natural History in the New World, 2010,\nThe Leafcutter Ants: Civilization by Instinct, 2011, \nThe Social Conquest of Earth, 2012,\nHalf-Earth: Our Planet's Fight for Life, 2016.\n\nHe published 3 books in 2014 alone: Letters to a Young Scientist, \nA Window on Eternity: A Biologist's Walk Through Gorongosa National Park, and\nThe Meaning of Human Existence.\n\nHe and his wife Irene reside in Lexington, Massachusetts. His daughter, Catherine, and her husband Jonathan, reside in nearby Stow, Massachusetts.\n\nWork\n\nSociobiology: The New Synthesis, 1975\n\nWilson used sociobiology and evolutionary principles to explain the behavior of social insects and then to understand the social behavior of other animals, including humans, thus established sociobiology as a new scientific field. He argued that all animal behavior, including that of humans, is the product of heredity, environmental stimuli, and past experiences, and that free will is an illusion. He has referred to the biological basis of behaviour as the \"genetic leash\".E. O. Wilson, Consilience: The Unity of Knowledge, New York, Knopf, 1998. The sociobiological view is that all animal social behavior is governed by epigenetic rules worked out by the laws of evolution. This theory and research proved to be seminal, controversial, and influential.Wolfe, Tom (1996). Sorry, But Your Soul Just Died. Vol. 158, Issue 13, Forbes\n\nWilson has argued that the unit of selection is a gene, the basic element of heredity. The target of selection is normally the individual who carries an ensemble of genes of certain kinds. With regard to the use of kin selection in explaining the behavior of eusocial insects, the \"new view that I'm proposing is that it was group selection all along, an idea first roughly formulated by Darwin.\"\n\nSociobiological research was at the time particularly controversial with regard to its application to humans. The theory established a scientific argument for rejecting the common doctrine of tabula rasa, which holds that human beings are born without any innate mental content and that culture functions to increase human knowledge and aid in survival and success. In the final chapter of the book Sociobiology Wilson argues that the human mind is shaped as much by genetic inheritance as it is by culture if not more. There are, Wilson suggests in the chapter, limits on just how much influence social and environmental factors can have in altering human behavior.Wilson, E. O. Sociobiology. Harvard. Chapter 27.\n\nReception\n\nSociobiology was initially met with substantial criticism. Several of Wilson's colleagues at Harvard, such as Richard Lewontin and Stephen Jay Gould, were strongly opposed to his ideas regarding sociobiology. Gould, Lewontin, and others from the Sociobiology Study Group from the Boston area wrote \"Against 'Sociobiology'\" in an open letter criticizing Wilson's \"deterministic view of human society and human action\".Allen, Elizabeth, et al. (1975). [http://www.nybooks.com/articles/9017?sess\n305fe41afae729849e1e7eb4b004bb81 \"Against 'Sociobiology'\".] [letter] New York Review of Books 22 (Nov. 13): 182, 184–186. Although attributed to members of the Sociobiology Study Group, it seems that Lewontin was the main author. In a 2011 interview, Wilson said, \"I believe Gould was a charlatan. I believe that he was ... seeking reputation and credibility as a scientist and writer, and he did it consistently by distorting what other scientists were saying and devising arguments based upon that distortion.\"\n\nMarshall Sahlins's 1976 work The Use and Abuse of Biology was a direct criticism of Wilson's theories.\n\nThere was also political opposition. Sociobiology re-ignited the nature and nurture debate. Wilson was accused of racism, misogyny, and sympathy to eugenics. In one incident in November 1978, his lecture was attacked by the International Committee Against Racism, a front group of the Marxist Progressive Labor Party, where one member poured a pitcher of water on Wilson's head and chanted \"Wilson, you're all wet\" at an AAAS conference. Wilson later spoke of the incident as a source of pride: \"I believe...I was the only scientist in modern times to be physically attacked for an idea.\"\n\nObjections from evangelical Christians included those of Paul E. Rothrock in 1987: \"... sociobiology has the potential of becoming a religion of scientific materialism.\"[http://www.asa3.org/asa/PSCF/1987/PSCF6-87Rothrock.html Mythology of Scientific Materialism.] Paul E. Rothrock and Mary Ellen Rothrock, PSCF 39 (June 1987): 87-93\nPhilosopher Mary Midgley encountered Sociobiology in the process of writing Beast and Man (1996)  and significantly rewrote the book to offer a critique of Wilson's views. Midgley praised the book for the study of animal behavior, clarity, scholarship, and encyclopedic scope, but extensively critiqued Wilson for conceptual confusion, scientism, and anthropomorphism of genetics.\n\nThe book and its reception were mentioned in Jonathan Haidt’s book The Righteous Mind.Haidt 2012, p. 37-38.\n\nOn Human Nature, 1978\n\nWilson wrote in his 1978 book On Human Nature, \"The evolutionary epic is probably the best myth we will ever have.\" Wilson's use of the word \"myth\" provides people with meaningful placement in time celebrating shared heritage. Wilson's fame prompted use of the morphed phrase epic of evolution. The book won the Pulitzer Prize in 2011.\n\nThe Ants, 1990\n\nWilson, along with Bert Hölldobler, carried out a systematic study of ants and ant behavior, culminating in the 1990 encyclopedic work The Ants. Because much self-sacrificing behavior on the part of individual ants can be explained on the basis of their genetic interests in the survival of the sisters, with whom they share 75% of their genes (though the actual case is some species' queens mate with multiple males and therefore some workers in a colony would only be 25% related), Wilson argued for a sociobiological explanation for all social behavior on the model of the behavior of the social insects.\n\nWilson has said in reference to ants \"Karl Marx was right, socialism works, it is just that he had the wrong species\". He meant that while ants and other eusocial species appear to live in communist-like societies, they only do so because they are forced to do so from their basic biology, as they lack reproductive independence: worker ants, being sterile, need their ant-queen in order to survive as a colony and a species, and individual ants cannot reproduce without a queen and are thus forced to live in centralised societies. Humans, however, do possess reproductive independence so they can give birth to offspring without the need of a \"queen\", and in fact humans enjoy their maximum level of Darwinian fitness only when they look after themselves and their offspring, while finding innovative ways to use the societies they live in for their own benefit.\n\nConsilience, 1998\n\nIn his 1998 book Consilience: The Unity of Knowledge, Wilson discussed methods that have been used to unite the sciences, and might be able to unite the sciences with the humanities. Wilson used the term \"consilience\" to describe the synthesis of knowledge from different specialized fields of human endeavor. He defined human nature as a collection of epigenetic rules, the genetic patterns of mental development. He argued that culture and rituals are products, not parts, of human nature. He said art is not part of human nature, but our appreciation of art is. He suggested that concepts such as art appreciation, fear of snakes, or the incest taboo (Westermarck effect) could be studied by scientific methods of the natural sciences and be part of interdisciplinary research.\n\nThe book was mentioned in Jonathan Haidt’s book The Righteous Mind.\n\nSpiritual and political beliefs\n\nScientific humanism\n\nWilson coined the phrase scientific humanism as \"the only worldview compatible with science's growing knowledge of the real world and the laws of nature\".in Harvard Magazine December 2005 p 33. Wilson argued that it is best suited to improve the human condition. In 2003, he was one of the signers of the Humanist Manifesto.\n\nGod and religion\n\nIn a New Scientist interview published on 21 January 2015, Wilson said that \"Religion 'is dragging us down' and must be eliminated 'for the sake of human progress, and \"So I would say that for the sake of human progress, the best thing we could possibly do would be to diminish, to the point of eliminating, religious faiths.\"\nOn the question of God, Wilson has described his position as provisional deismThe Creation and explicitly denied the label of \"atheist\", preferring \"agnostic\". He has explained his faith as a trajectory away from traditional beliefs: \"I drifted away from the church, not definitively agnostic or atheistic, just Baptist & Christian no more.\" Wilson argues that the belief in God and rituals of religion are products of evolution.Human Nature He argues that they should not be rejected or dismissed, but further investigated by science to better understand their significance to human nature. In his book The Creation, Wilson suggests that scientists ought to \"offer the hand of friendship\" to religious leaders and build an alliance with them, stating that \"Science and religion are two of the most potent forces on Earth and they should come together to save the creation.\"[http://www.news.harvard.edu/gazette/2006/06.15/03-biodiversity.html Naturalist E.O. Wilson is optimistic]  Harvard Gazette June 15, 2006\n\nWilson made an appeal to the religious community on the lecture circuit at Midland College, Texas, for example, and that \"the appeal received a 'massive reply'\", that a covenant had been written and that a \"partnership will work to a substantial degree as time goes on\".[http://www.mywesttexas.com/articles/2009/09/18/news/top_stories/doc4ab31071978e4063758641.txt Scientist says there is hope to save planet]  mywesttexas.com, September 18, 2009\n\nEcology\n\nWilson has said that, if he could start his life over he would work in microbial ecology, when discussing the reinvigoration of his original fields of study since the 1960s. He studied the mass extinctions of the 20th century and their relationship to modern society, and in 1998 argued for an ecological approach at the Capitol:\n\nWilson has been part of the international conservation movement, as a consultant to Columbia University's Earth Institute, as a director of the American Museum of Natural History, Conservation International, The Nature Conservancy and the World Wildlife Fund.\n\nUnderstanding the scale of the extinction crisis has led him to advocate for forest protection, including the \"Act to Save America's Forests\", first introduced in 1998, until 2008, but never passed. The Forests Now Declaration calls for new markets-based mechanisms to protect tropical forests. In 2014, Wilson called for setting aside 50% of the earth's surface for other species to thrive in as the only possible strategy to solve the extinction crisis.\n\nAwards and honors\n\nWilson's scientific and conservation honors include:\n\n* Member, National Academy of Sciences, 1969\n* U.S. National Medal of Science, 1976\n* Leidy Award, 1979, from the Academy of Natural Sciences of Philadelphia\n* Pulitzer Prize for On Human Nature, 1979 https://www.as.ua.edu/2012/09/01/legendary-biologist-and-pulitzer-prize-winner-e-o-wilson-visits-ua-as-scholar-in-residence/\n* Tyler Prize for Environmental Achievement, 1984\n* ECI Prize, International Ecology Institute, terrestrial ecology, 1987\n*Honorary doctorate from the Faculty of Mathematics and Science at Uppsala University, Sweden, 1987http://www.uu.se/en/about-uu/traditions/prizes/honorary-doctorates/\n*  Academy of Achievement Golden Plate Award, 1988\n* Crafoord Prize, 1990, a prize awarded by the Royal Swedish Academy of Sciences http://www.crafoordprize.se/search/sitesearch.4.2f692b3510dbfce339680003867.html?querywilson&x\n30&y=7\n* Pulitzer Prize for The Ants (with Bert Hölldobler), 1991\n* International Prize for Biology, 1993\n* Carl Sagan Award for Public Understanding of Science, 1994\n* The National Audubon Society's Audubon Medal, 1995\n* Time Magazines 25 Most Influential People in America, 1995\n* Benjamin Franklin Medal for Distinguished Achievement in the Sciences of the American Philosophical Society, 1998.\n* American Humanist Association's 1999 Humanist of the Year\n* Lewis Thomas Prize for Writing about Science, 2000\n* Nierenberg Prize, 2001\n* Distinguished Eagle Scout Award 2004\n* Dauphin Island Sea Lab christened its newest research vessel the R/V E.O. Wilson in 2005.\n* Linnean Tercentenary Silver Medal, 2006\n* Addison Emery Verrill Medal from the Peabody Museum of Natural History, 2007\n* TED Prize 2007[http://www.ted.com/tedprize/winners2007.cfm ]  given yearly to honor a maximum of three individuals who have shown that they can, in some way, positively impact life on this planet.\n* XIX Premi Internacional Catalunya 2007\n* Member of the World Knowledge Dialogue Honorary Board, and Scientist in Residence for the 2008 symposium organized in Crans-Montana (Switzerland).\n* Distinguished Lecturer, University of Iowa, 2008–2009\n* E.O. Wilson Biophilia Center on Nokuse Plantation in Walton County, Florida 2009 video\n* Explorers Club Medal, 2009\n* 2010 BBVA Frontiers of Knowledge Award in the Ecology and Conservation Biology Category\n* Thomas Jefferson Medal in Architecture, 2010\n* 2010 Heartland Prize for fiction for his first novel Anthill: A Novel\n* EarthSky Science Communicator of the Year, 2010\n\nMain works\n\n* , coauthored with William Brown Jr.; paper honored in 1986 as a Science Citation Classic, i.e., as one of the most frequently cited scientific papers of all time.\n* The Theory of Island Biogeography, 1967, Princeton University Press (2001 reprint), , with Robert H. MacArthur\n* The Insect Societies, 1971, Harvard University Press, \n* Sociobiology: The New Synthesis 1975, Harvard University Press, (Twenty-fifth Anniversary Edition, 2000 )\n* On Human Nature, 1979, Harvard University Press, , winner of the 1979 Pulitzer Prize for General Nonfiction.\n* Genes, Mind and Culture: The Coevolutionary Process, 1981, Harvard University Press, \n* Promethean Fire: Reflections on the Origin of Mind, 1983, Harvard University Press, \n* Biophilia, 1984, Harvard University Press, \n* Success and Dominance in Ecosystems: The Case of the Social Insects, 1990, Inter-Research, \n* The Ants, 1990, Harvard University Press, , Winner of the 1991 Pulitzer Prize, with Bert Hölldobler\n* The Diversity of Life, 1992, Harvard University Press, , The Diversity of Life: Special Edition, \n* The Biophilia Hypothesis, 1993, Shearwater Books, , with Stephen R. Kellert\n* Journey to the Ants: A Story of Scientific Exploration, 1994, Harvard University Press, , with Bert Hölldobler\n* Naturalist, 1994, Shearwater Books, \n* In Search of Nature, 1996, Shearwater Books, , with Laura Simonds Southworth\n* Consilience: The Unity of Knowledge, 1998, Knopf, \n* The Future of Life, 2002, Knopf, \n* Pheidole in the New World: A Dominant, Hyperdiverse Ant Genus, 2003, Harvard University Press, \n* From So Simple a Beginning: Darwin's Four Great Books. 2005, W. W. Norton.\n* The Creation: An Appeal to Save Life on Earth, September 2006, W. W. Norton & Company, Inc. \n* Nature Revealed: Selected Writings 1949–2006, \n* The Superorganism: The Beauty, Elegance, and Strangeness of Insect Societies, 2009, W.W. Norton & Company, Inc. , with Bert Hölldobler\n* Anthill: A Novel, April 2010, W. W. Norton & Company, Inc. \n* Kingdom of Ants: Jose Celestino Mutis and the Dawn of Natural History in the New World, 2010, Johns Hopkins University Press, Baltimore, with José María Gómez Durán\n* The Leafcutter Ants: Civilization by Instinct, 2011, W.W. Norton & Company, Inc. , with Bert Hölldobler\n* The Social Conquest of Earth, 2012, Liveright Publishing Corporation, New York, \n* Letters to a Young Scientist, 2014, Liveright, \n* A Window on Eternity: A Biologist's Walk Through Gorongosa National Park, 2014, Simon & Schuster, \n* The Meaning of Human Existence, 2014, Liveright, \n* Half-Earth, 2016, Liveright, \n* The Origins of Creativity, 2017, Liveright, \n\nEdited works\n\n* From So Simple a Beginning: Darwin's Four Great Books, edited with introductions by Edward O. Wilson (2010 W.W. Norton). E. O. Wilson. http://en.wikipedia.org/?curid=10313."
  }
}
