{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15794",
  "eid" : "1ea7a640-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778560676,
  "textBody" : "Events\n\n* 913 – Emperor Alexander III dies of exhaustion while playing the game tzykanion (Byzantine name for polo). He is succeeded by his 8-year-old nephew Constantine VII.\n*1513 – Italian Wars: Battle of Novara. Swiss troops defeat the French under Louis II de la Trémoille, forcing the French to abandon Milan. Duke Massimiliano Sforza is restored.\n*1523 – Gustav Vasa, the Swedish regent, is elected King of Sweden, marking a symbolic end to the Kalmar Union. This is the Swedish national day.\n*1586 – Francis Drake's forces raid St. Augustine in Spanish Florida.\n*1644 – The Qing dynasty Manchu forces led by the Shunzhi Emperor capture Beijing during the collapse of the Ming dynasty. \n*1654 – Queen Christina abdicates the Swedish throne and is succeeded by her cousin Charles X Gustav.\n*1674 – Shivaji, founder of the Maratha Empire, is crowned.\n*1749 – The Conspiracy of the Slaves in Malta is discovered.\n*1762 – Seven Years' War: British forces begin a siege of Havana, Cuba, and temporarily capture the city in the Battle of Havana. \n*1808 – Napoleon's brother, Joseph Bonaparte, is crowned King of Spain.\n*1809 – Sweden promulgates a new Constitution, which restores political power to the Riksdag of the Estates after 20 years of enlightened absolutism. At the same time, Charles XIII is elected to succeed Gustav IV Adolf as King of Sweden.\n*1813 – War of 1812: Battle of Stoney Creek: A British force of 700 under John Vincent defeats an American force twice its size under William Winder and John Chandler.\n*1822 – Alexis St. Martin is accidentally shot in the stomach, leading to William Beaumont's studies on digestion.\n*1832 – The June Rebellion in Paris is put down by the National Guard.\n*1844 – The Young Men's Christian Association (YMCA) is founded in London.\n*1844 – The Glaciarium, the world's first mechanically frozen ice rink, opens.\n*1857 – Sophia of Nassau marries the future King Oscar II of Sweden–Norway.\n*1859 – Australia: Queensland is established as a separate colony from New South Wales (Queensland Day).\n*1862 – American Civil War: Battle of Memphis: Union forces capture Memphis, Tennessee, from the Confederates.\n*1882 – More than 100,000 inhabitants of Bombay are supposedly killed in the so-called 'Bombay Cyclone of 1882', but this has proved a hoax and did not happen.\n*  1882   – The Shewan forces of Menelik II of Ethiopia defeat the Gojjame army in the Battle of Embabo. The Shewans capture Negus Tekle Haymanot of Gojjam, and their victory leads to a Shewan hegemony over the territories south of the Abay River.\n*1889 – The Great Seattle Fire destroys all of downtown Seattle.\n*1892 – The Chicago \"L\" elevated rail system begins operation.\n*1894 – Governor Davis H. Waite orders the Colorado state militia to protect and support the miners engaged in the Cripple Creek miners' strike.\n*1909 – French troops capture Abéché (in modern-day Chad) and install a puppet sultan in the Ouaddai Empire.\n*1912 – The eruption of Novarupta in Alaska begins. It is the largest volcanic eruption of the 20th century.\n*1918 – World War I: Battle of Belleau Wood: The U.S. Marine Corps suffers its worst single day's casualties while attempting to recapture the wood at Château-Thierry.\n*1919 – The Republic of Prekmurje ends.\n*1921 – Southwark Bridge in London is opened to traffic by King George V and Queen Mary.\n*1932 – The Revenue Act of 1932 is enacted, creating the first gas tax in the United States, at a rate of 1 cent per US gallon (¢/L) sold.\n*1933 – The first drive-in theater opens in Camden, New Jersey, United States.\n*1934 – New Deal: The U.S. President Franklin D. Roosevelt signs the Securities Exchange Act of 1934 into law, establishing the U.S. Securities and Exchange Commission.\n*1939 – Judge Joseph Force Crater, known as the \"Missingest Man in New York\", is declared legally dead.\n*1942 – World War II: Battle of Midway. U.S. Navy dive bombers sink the Japanese cruiser Mikuma and four Japanese carriers.\n*1944 –  World War II: The Battle of Normandy begins. D-Day, code named Operation Overlord, commences with the landing of 155,000 Allied troops on the beaches of Normandy in France. The allied soldiers quickly break through the Atlantic Wall and push inland in the largest amphibious military operation in history.\n*1946 – The Basketball Association of America is founded in New York City; the BAA was the precursor to the modern National Basketball Association\n*1954 – The grand opening of the sculpture of Yuriy Dolgorukiy took place in Moscow. This statue is one of the main monuments of Moscow.\n*1964 – Under a temporary order, the rocket launches at Cuxhaven, Germany are terminated. They never resume.\n*1968 – Assassination of Robert F. Kennedy: Robert F. Kennedy,  Democratic Party senator from New York and brother of 35th President John F. Kennedy, dies from gunshot wounds inflicted on June 5.\n*1971 – Soyuz program: Soyuz 11 is launched.\n*  1971   – A midair collision between a Hughes Airwest Douglas DC-9 jetliner and a United States Marine Corps McDonnell Douglas F-4 Phantom II jet fighter near Duarte, California, claims 50 lives.\n*  1971   – Vietnam War: The Battle of Long Khanh between Australian and Vietnamese communist forces begins.\n*1974 – A new Instrument of Government is promulgated making Sweden a parliamentary monarchy.\n*1981 – Bihar train disaster: A passenger train travelling between Mansi and Saharsa, India, jumps the tracks at a bridge crossing the Bagmati River. The government places the official death toll at 268 plus another 300 missing; however, it is generally believed that the death toll is closer to 1,000.\n*1982 – The Lebanon War begins. Forces under Israeli Defense Minister Ariel Sharon invade southern Lebanon during Operation Peace for the Galilee, eventually reaching as far north as the capital Beirut.\n*1985 – The grave of \"Wolfgang Gerhard\" is opened in Embu, Brazil; the exhumed remains are later proven to be those of Josef Mengele, Auschwitz's \"Angel of Death\"; Mengele is thought to have drowned while swimming in February 1979.\n*1993 – Mongolia holds its first direct presidential elections.\n*2002 – Eastern Mediterranean event. A near-Earth asteroid estimated at ten meters in diameter explodes over the Mediterranean Sea between Greece and Libya. The resulting explosion is estimated to have a force of 26 kilotons, slightly more powerful than the Nagasaki atomic bomb.\n*2004 – Tamil is established as a \"classical language\" by the President of India, Dr A. P. J. Abdul Kalam, in a joint sitting of the two houses of the Indian Parliament.\n*2005 – In Gonzales v. Raich, the United States Supreme Court upholds a federal law banning cannabis, including medical marijuana.\n\nBirths\n\n*1236 – Wen Tianxiang, Chinese general and scholar (d. 1283)\n*1243 – Alix of Brittany, Dame de Pontarcy; Breton noble (d. 1288)\n*1296 – Władysław of Legnica (d. 1352)\n*1436 – Regiomontanus, German mathematician, astronomer, and bishop (d. 1476)\n*1519 – Andrea Cesalpino, Italian philosopher, physician, and botanist (d. 1603)\n*1539 – Catherine Vasa, Regent of East Frisia (d. 1610)\n*1553 – Bernardino Baldi, Italian mathematician and author (d. 1617)\n*1556 – Edward la Zouche, 11th Baron Zouche, English politician and diplomat (d. 1625)\n*1576 – Giovanni Diodati, Swiss-Italian minister, theologian, and academic (d. 1649)\n*1580 – Godefroy Wendelin, Belgian astronomer and author (d. 1667)\n*1584 – Yuan Chonghuan, politician, military general and writer (d. 1630)\n*1599 – Diego Velázquez, Spanish painter and educator (d. 1660)\n*1606 – Pierre Corneille, French playwright and producer (d. 1684)\n*1622 – Claude-Jean Allouez, French-American missionary and explorer (d. 1689)\n*1646 – Hortense Mancini, favourite Italian niece of Cardinal Mazarin (d. 1699)\n*1661 – Giacomo Antonio Perti, Italian composer and educator (d. 1756)\n*1699 – Johann Georg Estor, German historian and theorist (d. 1773)\n*1714 – Joseph I of Portugal (d. 1777)\n*1735 – Anton Schweitzer, German composer (d. 1787)\n*1755 – Nathan Hale, American soldier (d. 1776)\n*1756 – John Trumbull, American soldier and painter (d. 1843)\n*1772 – Maria Theresa of Naples and Sicily (d. 1807)\n*1799 – Alexander Pushkin, Russian author and poet (d. 1837)\n*1807 – Thiệu Trị, Vietnamese emperor (d. 1847)\n*1810 – Friedrich Wilhelm Schneidewin, German philologist and scholar (d. 1856)\n*1829 – Honinbo Shusaku, Japanese Go player (d. 1862)\n*1841 – Eliza Orzeszkowa, Polish author and publisher (d. 1910)\n*1844 – Konstantin Savitsky, Russian painter and academic (d. 1905)\n*1850 – Karl Ferdinand Braun, German-American physicist and academic, Nobel Prize laureate (d. 1918)\n*1857 – Aleksandr Lyapunov, Russian mathematician and physicist (d. 1918)\n*1862 – Henry Newbolt, English historian, author, and poet (d. 1938)\n*1867 – David T. Abercrombie, American surveyor and businessman, founded Abercrombie & Fitch (d. 1931)\n*1868 – Robert Falcon Scott, English sailor and explorer (d. 1912)\n*1872 – Alix of Hesse, German princess and Russian empress (d.1918)\n*1875 – Thomas Mann, German author and critic, Nobel Prize laureate (d. 1955)\n*1878 – Vincent de Moro-Giafferi, French lawyer and politician (d. 1956)\n*1884 – Jock Hutchison, Scottish-American golfer (d. 1977)\n*1890 – Ted Lewis, American singer, clarinet player, and bandleader (d. 1971)\n*1891 – Masti Venkatesha Iyengar, Indian author and academic (d. 1986)\n*  1891   – Erich Marcks, German general (d. 1944)\n*1896 – Henry Allingham, English soldier (d. 2009)\n*  1896   – Italo Balbo, Italian air marshal and politician (d. 1940)\n*1898 – Walter Abel, American actor (d. 1987)\n*  1898   – Jacobus Johannes Fouché, South African politician, 2nd State President of South Africa (d. 1980)\n*  1898   – Ninette de Valois, English ballerina, choreographer, and director (d. 2001)\n*1900 – Manfred Sakel, Ukrainian-American psychiatrist and physician (d. 1957)\n*1901 – Jan Struther, English author and hymnwriter (d. 1953)\n*  1901   – Sukarno, Indonesian engineer and politician, 1st President of Indonesia (d. 1970)\n*1902 – Jimmie Lunceford, American saxophonist and bandleader (d. 1947)\n*1903 – Aram Khachaturian, Armenian composer and conductor (d. 1978)\n*1903 – Bakht Singh, Indian evangelist, well-known bible teacher and preacher  (d. 2000)\n*1906 – Max August Zorn, German mathematician and academic (d. 1993)\n*1907 – Bill Dickey, American baseball player and manager (d. 1993)\n*  1907   – Robin Humphreys, British scholar of Latin America (d. 1999)\n*1908 – Giovanni Bracco, Italian race car driver (d. 1968)\n*1909 – Isaiah Berlin, Latvian-English historian and philosopher (d. 1997)\n*1913 – Carlo L. Golino, Italian-American author, critic, and academic (d. 1991)\n*1915 – Vincent Persichetti, American pianist and composer (d. 1987)\n*1916 – Hamani Diori, Nigerien academic and politician, 1st President of Niger (d. 1989)\n*1917 – Kirk Kerkorian, American businessman, founded the Tracinda Corporation (d. 2015)\n*1918 – Edwin G. Krebs, American biochemist and academic, Nobel Prize laureate (d. 2009)\n*1919 – Peter Carington, 6th Baron Carrington, English captain and politician, 6th Secretary General of NATO\n*1923 – V. C. Andrews, American author, illustrator, and painter (d. 1986)\n*  1923   – Jean Pouliot, Canadian broadcaster (d. 2004)\n*1925 – Maxine Kumin, American poet and author (d. 2014)\n*  1925   – Frank Chee Willeto, American soldier and politician, 4th Vice President of the Navajo Nation (d. 2013)\n*1926 – Torsten Andersson, Swedish painter and illustrator (d. 2009)\n*  1926   – Erdal İnönü, Turkish physicist and politician, Prime Minister of Turkey (d. 2007)\n*  1926   – Klaus Tennstedt, German conductor (d. 1998)\n*1929 – Sunil Dutt, Indian actor, director, producer, and politician (d. 2005)\n*1930 – Frank Tyson, English-Australian cricketer, coach, and journalist (d. 2015)\n*1932 – David Scott, American colonel, engineer, and astronaut\n*  1932   – Billie Whitelaw, English actress (d. 2014)\n*1933 – Eli Broad, American businessman and philanthropist, co-founded KB Home\n*  1933   – Heinrich Rohrer, Swiss physicist and academic, Nobel Prize laureate (d. 2013)\n*1934 – Albert II of Belgium\n*1935 – Jon Henricks, Australian swimmer\n*1936 – Mompati Merafhe, Botswana general and politician, Vice-President of Botswana (d. 2015)\n*  1936   – D. Ramanaidu, Indian actor, director, and producer, founded Suresh Productions (d. 2015)\n*  1936   – Levi Stubbs, American singer (d. 2008)\n*1938 – Prince Luiz of Orléans-Braganza\n*  1938   – Ryuchi Matsuda, Japanese martial artist and author (d. 2013)\n*1939 – Louis Andriessen, Dutch pianist and composer\n*  1939   – Gary U.S. Bonds, American singer-songwriter\n*  1939   – Eddie Giacomin, Canadian-American ice hockey player, coach, and sportscaster\n*1940 – Kumar Bhattacharyya, Baron Bhattacharyya, Indian-English engineer and academic\n*  1940   – Tiger Lance, South African cricketer (d. 2010)\n*  1940   – Willie John McBride, Northern Irish rugby player, coach, and manager\n*1941 – Alexander Cockburn, Scottish-American journalist and author (d. 2012)\n*1943 – José de Jesús Gudiño Pelayo, Mexican lawyer and jurist (d. 2010)\n*  1943   – Asif Iqbal, Indian-Pakistani cricketer\n*  1943   – Richard Smalley, American chemist and academic, Nobel Prize laureate (d. 2005)\n*  1943   – Joe Stampley, American country music singer-songwriter\n*1944 – Monty Alexander, Jamaican pianist \n*  1944   – Edgar Froese, Russian-German keyboard player and songwriter (d. 2015)\n*  1944   – Phillip Allen Sharp, American geneticist and biologist, Nobel Prize laureate\n*  1944   – Tommie Smith, American runner and football player\n*1945 – David Dukes, American actor (d. 2000)\n*  1945   – Nikolai Velikov, Russian figure skater and coach\n*1946 – Tony Levin, American bass player and songwriter \n*1947 – David Blunkett, English academic and politician, Secretary of State for Education\n*  1947   – Robert Englund, American actor\n*  1947   – Ada Kok, Dutch swimmer\n*1948 – Arlene Harris, American entrepreneur, inventor, investor and policy advocate\n*1949 – Ioannis Matzourakis, Greek footballer and manager \n*  1949   – Holly Near, American folk singer-songwriter\n*1950 – Chantal Akerman, Belgian actress, director, and producer (d. 2015)\n*1951 – Marietta Giannakou, Greek psychiatrist and politician, Greek Minister of Health\n*  1951   – Noritake Takahara, Japanese race car driver\n*  1951   – Dwight Twilley, American rock singer-songwriter, guitarist, and pianist\n*1952 – Yukihiro Takahashi, Japanese drummer, producer, and actor\n*1953 – Dimitris Avramopoulos, Greek lieutenant and politician, Greek Minister for National Defence\n*1954 – Harvey Fierstein, American actor and playwright\n*  1954   – Allan Hewson, New Zealand rugby player\n*  1954   – Urve Tiidus, Estonian journalist and politician, 8th Estonian Minister of Culture\n*  1954   – Władysław Żmuda, Polish footballer and manager\n*1955 – Sandra Bernhard, American actress and comedian\n*  1955   – Sam Simon, American director, producer, and screenwriter (d. 2015)\n*  1955   – Suresh Bhardwaj, Indian stage designer, director and theatre teacher (d. 2016)\n*  1955   – Lee Smolin, American theoretical physicist\n*1956 – Björn Borg, Swedish tennis player and fashion designer\n*  1956   – Dave Cusack, English footballer and manager\n*  1956   – Marco Minniti, Italian politician, Italian Minister of the Interior\n*1957 – Mike Gatting, English cricketer, coach, and sportscaster\n*  1957   – Balanadarajah Iyer, Sri Lankan poet and activist (d. 2004)\n*  1957   – Christian Rach, German chef and author\n*1959 – Jimmy Jam, American keyboard player, songwriter, and producer \n*  1959   – Andrey Prokofyev, Russian sprinter and hurdler (d. 1989)\n*  1959   – David Schultz, American wrestler (d. 1996)\n*1960 – Steve Vai, American singer-songwriter, guitarist, and producer \n*1961 – Tom Araya, Chilean-American singer-songwriter and bass player \n*  1961   – Nir Brand, Israeli composer and conductor\n*1962 – Grant Fox, New Zealand rugby player and sportscaster\n*1963 – Eric Cantor, American lawyer and politician\n*  1963   – Vincent Collet, French former professional basketball player\n*  1963   – Wolfgang Drechsler, German scholar, author, and academic\n*  1963   – Jason Isaacs, English actor \n*  1963   – Ahmed Johnson, American football player, wrestler, and actor\n*  1963   – Dariusz Kubicki, Polish footballer and coach\n*1964 – Jay Bentley, American singer and bass player \n*1965 – Cam Neely, Canadian ice hockey player and actor\n*  1965   – Megumi Ogata, Japanese voice actress and singer\n*1967 – Max Casella, American actor\n*  1967   – Paul Giamatti, American actor \n*1968 – François Avard, Canadian author and screenwriter\n*1969 – Erik Prince, American soldier and businessman, co-founded Academi\n*  1969   – Fernando Redondo, Argentinian footballer\n*1970 – Evgeni Berzin, Russian cyclist\n*  1970   – Richard Di Natale, Australian politician\n*  1970   – Albert Ferrer, Spanish footballer and coach\n*  1970   – Sunil Joshi, Indian cricketer\n*  1970   – James Shaffer, American guitarist, songwriter, and producer\n*1972 – Noriaki Kasai, Japanese ski jumper\n*  1972   – Natalie Morales, American television journalist and anchor  \n*1973 – Patrick Rothfuss, American author and academic\n*1974 – Uncle Kracker (Matthew Shafer), American singer-songwriter and guitarist\n*  1974   – Guillaume Musso, French novelist\n*1975 – Niklas Sundström, Swedish ice hockey player\n*1976 – Emilie-Claire Barlow, Canadian singer and actress\n*  1976   – Geoff Rowley, English skateboarder and businessman\n*1977 – David Connolly, English-Irish footballer\n*  1977   – Mark Ellis, American baseball player\n*1978 – Carl Barât, English singer-songwriter\n*1981 – Luke Burt, Australian rugby league player \n*1982 – Marian Oprea, Romanian triple jumper\n*1983 – Michael Krohn-Dehli, Danish footballer\n*  1983   – Joe Rokocoko, Fijian-New Zealand rugby player\n*1985 – Drew Galloway, Scottish wrestler\n*  1985   – Martyn Irvine, Northern Irish cyclist\n*  1985   – Sebastian Larsson, Swedish footballer\n*  1985   – Nikolay Varbanov, Bulgarian basketball player\n*1986 – Junichi Tazawa, Japanese-American baseball player\n*1987 – Niklas Hjalmarsson, Swedish ice hockey player\n*  1987   – Rory Kostjasyn, Australian-Irish rugby league player\n*  1987   – Rubin Okotie, Austrian footballer\n*1988 – Maria Alyokhina, Russian singer and activist \n*  1988   – Ryan Brathwaite, Barbadian hurdler\n*  1988   – Israel Dagg, New Zealand rugby player\n*1989 – Paula Brancati, Canadian actress \n*  1989   – Darcy Lussick, Australian rugby league player \n*  1989   – Paweł Wojciechowski, Polish pole vaulter\n*1990 – Raisa Andriana, Indonesian singer and actress\n*  1990   – Vid Belec, Slovenian footballer\n*  1990   – Anthony Rendon, American baseball player\n*1992 – DeAndre Hopkins, American football player\n*  1992   – Hyuna, South Korean singer-songwriter, dancer, and model \n*1993 – Vic Mensa, American rapper \n*1994 – Jake Mamo, Australian rugby league player\n*1995 – Julian Green, American footballer\n\nDeaths\n\n* 184 – Qiao Xuan, Chinese official (b. 110)\n* 863 – Abu Musa Utamish, Muslim vizier \n* 913 – Alexander III, Byzantine emperor (b. 870)\n*1097 – Agnes of Aquitaine, Queen of Aragon and Navarre\n*1134 – Norbert of Xanten, German bishop and saint (b. 1060)\n*1217 – Henry I, King of Castile and Toledo (b. 1204)\n*1237 – John of Scotland, Earl of Huntingdon\n*1251 – William III of Dampierre, Count of Flanders\n*1252 – Robert Passelewe, Bishop of Chichester\n*1333 – William Donn de Burgh, 3rd Earl of Ulster (b. 1312)\n*1393 – Emperor Go-En'yū of Japan (b. 1359)\n*1480 – Vecchietta, Italian painter, sculptor, and architect (b. 1412)\n*1511  – Ahmad ibn Abi Jum'ah, Islamic scholar, author of the Oran fatwa\n*1548 – João de Castro, Portuguese soldier and politician, Governor of Portuguese India (b. 1500)\n*1561 – Ridolfo Ghirlandaio, Italian painter (b. 1483)\n*1583 – Nakagawa Kiyohide, Japanese daimyo (b. 1556)\n*1659 – Nadira Banu Begum, Mughal princess (b. 1618)\n*1661 – Martino Martini, Italian Jesuit missionary (b. 1614)\n*1730 – Alain Emmanuel de Coëtlogon, French general (b. 1646)\n*1740 – Alexander Spotswood, Moroccan-American colonial and politician, Lieutenant Governor of Virginia (b. 1676)\n*1784 – Joan van der Capellen tot den Pol, Dutch politician (b. 1741)\n*1799 – Patrick Henry, American lawyer and politician, 1st Governor of Virginia (b. 1736)\n*1813 – Alexandre-Théodore Brongniart, French architect, designed the Hôtel de Mademoiselle de Condé (b. 1739)\n*  1813   – Antonio Cachia, Maltese architect, engineer and archaeologist (b. 1739)\n*1832 – Jeremy Bentham, English jurist and philosopher (b. 1748)\n*1840 – Marcellin Champagnat, French priest and saint, founded the Marist Brothers (b. 1789)\n*1843 – Friedrich Hölderlin, German poet and author (b. 1770)\n*1861 – Camillo Benso, Count of Cavour, Italian politician, 1st Prime Minister of Italy (b. 1810)\n*1862 – Turner Ashby, American colonel (b. 1828)\n*1865 – William Quantrill, American captain (b. 1837)\n*1878 – Robert Stirling, Scottish minister and engineer, invented the stirling engine (b. 1790)\n*1881 – Henri Vieuxtemps, Belgian violinist and composer (b. 1820)\n*1883 – Ciprian Porumbescu, Ukrainian-Romanian composer and poet (b. 1853)\n*1891 – John A. Macdonald, Scottish-Canadian lawyer and politician, 1st Prime Minister of Canada (b. 1815)\n*1916 – Yuan Shikai, Chinese general and politician, 2nd President of the Republic of China (b. 1859)\n*1922 – Lillian Russell, American actress and singer (b. 1860)\n*1924 – William Pirrie, 1st Viscount Pirrie, Irish businessman and politician, Lord Mayor of Belfast (b. 1847) \n*1934 – Julije Kempf, Croatian historian and author (b. 1864)\n*1935 – Julian Byng, 1st Viscount Byng of Vimy, English field marshal and politician, 12th Governor-General of Canada (b. 1862)\n*1941 – Louis Chevrolet, Swiss-American race car driver and businessman, founded Chevrolet and Frontenac Motor Corporation (b. 1878)\n*1943 – Pandelis Pouliopoulos, Greek politician (b. 1900)\n*1946 – Gerhart Hauptmann, German novelist, poet, and playwright, Nobel Prize laureate (b. 1862)\n*1947 – James Agate, English author and critic (b. 1877)\n*1948 – Louis Lumière, French director, producer, and screenwriter (b. 1864)\n*1951 – Olive Tell, American actress (b. 1894)\n*1954 – Fritz Kasparek, Austrian mountaineer and author (b. 1910)\n*1955 – Max Meldrum, Scottish-Australian painter and educator (b. 1875)\n*1961 – Carl Jung, Swiss psychiatrist and psychotherapist (b. 1875)\n*1962 – Yves Klein, French painter (b. 1928)\n*  1962   – Tom Phillis, Australian motorcycle racer (b. 1934)\n*1963 – William Baziotes, American painter and academic (b. 1912)\n*1968 – Randolph Churchill, English journalist and politician (b. 1911)\n*  1968   – Robert F. Kennedy, American soldier, lawyer, and politician, 64th United States Attorney General (b. 1925)\n*  1968   – Kâzım Özalp, Turkish general and politician, 3rd Turkish Minister of National Defence (b. 1880)\n*1975 – Larry Blyden, American actor (b. 1925)\n*1976 – J. Paul Getty, American businessman, founded the Getty Oil Company (b. 1892)\n*1979 – Jack Haley, American actor (b. 1897)\n*1980 – Ruth Aarons, American table tennis player and manager (b. 1918)\n*1982 – Kenneth Rexroth, American poet and academic (b. 1905)\n*1983 – Hans Leip, German author, poet, and playwright (b. 1893)\n*1984 – A. Bertram Chandler, English-Australian soldier and author (b. 1912)\n*1991 – Stan Getz, American saxophonist (b. 1927)\n*1994 – Barry Sullivan, American actor (b. 1912)\n*1996 – George Davis Snell, American geneticist and immunologist, Nobel Prize laureate (b. 1903)\n*1997 – Magda Gabor, Hungarian-American actress and socialite (b. 1915)\n*2000 – Frédéric Dard, French author and screenwriter (b. 1921)\n*2001 – Suzanne Schiffman, French screenwriter and director (b. 1939)\n*2003 – Ken Grimwood, American author (b. 1944)\n*  2003   – Dave Rowberry, English singer-songwriter and pianist  (b. 1940)\n*2005 – Anne Bancroft, American actress (b. 1931)\n*  2005   – Dana Elcar, American actor (b. 1927)\n*2006 – Arnold Newman, American photographer and educator (b. 1918)\n*  2006   – Billy Preston, American singer-songwriter, pianist, and actor (b. 1946)\n*  2006   – Camille Sandorfy, Hungarian-Canadian chemist and academic (b. 1920)\n*2009 – Jean Dausset, French-Spanish immunologist and academic, Nobel Prize laureate (b. 1916)\n*  2009   – Jim Owens, American football player and coach (b. 1927)\n*2010 – Marvin Isley, American singer-songwriter and bass player (b. 1953)\n*2012 – Vladimir Krutov, Russian ice hockey player (b. 1960)\n*  2012   – Manuel Preciado Rebolledo, Spanish footballer and coach (b. 1957)\n*  2012   – Mykola Volosyanko, Ukrainian footballer and manager (b. 1972)\n*2013 – Jerome Karle, American chemist and academic, Nobel Prize laureate (b. 1918)\n*  2013   – Eugen Merzbacher, German-American physicist and academic (b. 1921)\n*  2013   – Tom Sharpe, English-Spanish author and academic (b. 1928)\n*  2013   – Esther Williams, American swimmer and actress (b. 1921)\n*2014 – Ado Bayero, Nigerian politician and diplomat (b. 1930)\n*  2014   – Eric Hill, English-American author and illustrator (b. 1927)\n*  2014   – Lorna Wing, English psychiatrist and physician (b. 1928)\n*2015 – Pierre Brice, French actor (b. 1929)\n*  2015   – Vincent Bugliosi, American lawyer and author (b. 1934)\n*  2015   – Ronnie Gilbert, American singer-songwriter (b. 1926)\n*  2015   – Ludvík Vaculík, Czech journalist and author (b. 1926)\n*2016 – Viktor Korchnoi, Russian chess player (b. 1931)\n*  2016   – Peter Shaffer, English playwright and screenwriter (b. 1926)\n\nHolidays and observances\n\n*Christian feast day:\n**Claude the Thaumaturge\n**Gottschalk\n**Ini Kopuria (Church of England, Episcopal Church, Anglican Church of Melanesia)\n**Marcellin Champagnat\n**Norbert of Xanten\n**June 6 (Eastern Orthodox liturgics)\n*Engineer's Day (Taiwan)\n*Korean Children’s Union Foundation Day  (North Korea)\n*Memorial Day (South Korea)\n*National Day, marks the end of the Danish-ruled Kalmar Union. (Sweden)\n*National Huntington's Disease Awareness Day (United States)\n*Normandy landings of the Allied Expeditionary Forces (D-Day), a.k.a. Operation Neptune, part of Operation Overlord (1944)\n*Queensland Day (Queensland)\n*Teachers' Day (Bolivia)\n*UN Russian Language Day (United Nations)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "June 6" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15794" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 913 – Emperor Alexander III dies of exhaustion while playing the game tzykanion (Byzantine name for polo). He is succeeded by his 8-year-old nephew Constantine VII.\n*1513 – Italian Wars: Battle of Novara. Swiss troops defeat the French under Louis II de la Trémoille, forcing the French to abandon Milan. Duke Massimiliano Sforza is restored.\n*1523 – Gustav Vasa, the Swedish regent, is elected King of Sweden, marking a symbolic end to the Kalmar Union. This is the Swedish national day.\n*1586 – Francis Drake's forces raid St. Augustine in Spanish Florida.\n*1644 – The Qing dynasty Manchu forces led by the Shunzhi Emperor capture Beijing during the collapse of the Ming dynasty. \n*1654 – Queen Christina abdicates the Swedish throne and is succeeded by her cousin Charles X Gustav.\n*1674 – Shivaji, founder of the Maratha Empire, is crowned.\n*1749 – The Conspiracy of the Slaves in Malta is discovered.\n*1762 – Seven Years' War: British forces begin a siege of Havana, Cuba, and temporarily capture the city in the Battle of Havana. \n*1808 – Napoleon's brother, Joseph Bonaparte, is crowned King of Spain.\n*1809 – Sweden promulgates a new Constitution, which restores political power to the Riksdag of the Estates after 20 years of enlightened absolutism. At the same time, Charles XIII is elected to succeed Gustav IV Adolf as King of Sweden.\n*1813 – War of 1812: Battle of Stoney Creek: A British force of 700 under John Vincent defeats an American force twice its size under William Winder and John Chandler.\n*1822 – Alexis St. Martin is accidentally shot in the stomach, leading to William Beaumont's studies on digestion.\n*1832 – The June Rebellion in Paris is put down by the National Guard.\n*1844 – The Young Men's Christian Association (YMCA) is founded in London.\n*1844 – The Glaciarium, the world's first mechanically frozen ice rink, opens.\n*1857 – Sophia of Nassau marries the future King Oscar II of Sweden–Norway.\n*1859 – Australia: Queensland is established as a separate colony from New South Wales (Queensland Day).\n*1862 – American Civil War: Battle of Memphis: Union forces capture Memphis, Tennessee, from the Confederates.\n*1882 – More than 100,000 inhabitants of Bombay are supposedly killed in the so-called 'Bombay Cyclone of 1882', but this has proved a hoax and did not happen.\n*  1882   – The Shewan forces of Menelik II of Ethiopia defeat the Gojjame army in the Battle of Embabo. The Shewans capture Negus Tekle Haymanot of Gojjam, and their victory leads to a Shewan hegemony over the territories south of the Abay River.\n*1889 – The Great Seattle Fire destroys all of downtown Seattle.\n*1892 – The Chicago \"L\" elevated rail system begins operation.\n*1894 – Governor Davis H. Waite orders the Colorado state militia to protect and support the miners engaged in the Cripple Creek miners' strike.\n*1909 – French troops capture Abéché (in modern-day Chad) and install a puppet sultan in the Ouaddai Empire.\n*1912 – The eruption of Novarupta in Alaska begins. It is the largest volcanic eruption of the 20th century.\n*1918 – World War I: Battle of Belleau Wood: The U.S. Marine Corps suffers its worst single day's casualties while attempting to recapture the wood at Château-Thierry.\n*1919 – The Republic of Prekmurje ends.\n*1921 – Southwark Bridge in London is opened to traffic by King George V and Queen Mary.\n*1932 – The Revenue Act of 1932 is enacted, creating the first gas tax in the United States, at a rate of 1 cent per US gallon (¢/L) sold.\n*1933 – The first drive-in theater opens in Camden, New Jersey, United States.\n*1934 – New Deal: The U.S. President Franklin D. Roosevelt signs the Securities Exchange Act of 1934 into law, establishing the U.S. Securities and Exchange Commission.\n*1939 – Judge Joseph Force Crater, known as the \"Missingest Man in New York\", is declared legally dead.\n*1942 – World War II: Battle of Midway. U.S. Navy dive bombers sink the Japanese cruiser Mikuma and four Japanese carriers.\n*1944 –  World War II: The Battle of Normandy begins. D-Day, code named Operation Overlord, commences with the landing of 155,000 Allied troops on the beaches of Normandy in France. The allied soldiers quickly break through the Atlantic Wall and push inland in the largest amphibious military operation in history.\n*1946 – The Basketball Association of America is founded in New York City; the BAA was the precursor to the modern National Basketball Association\n*1954 – The grand opening of the sculpture of Yuriy Dolgorukiy took place in Moscow. This statue is one of the main monuments of Moscow.\n*1964 – Under a temporary order, the rocket launches at Cuxhaven, Germany are terminated. They never resume.\n*1968 – Assassination of Robert F. Kennedy: Robert F. Kennedy,  Democratic Party senator from New York and brother of 35th President John F. Kennedy, dies from gunshot wounds inflicted on June 5.\n*1971 – Soyuz program: Soyuz 11 is launched.\n*  1971   – A midair collision between a Hughes Airwest Douglas DC-9 jetliner and a United States Marine Corps McDonnell Douglas F-4 Phantom II jet fighter near Duarte, California, claims 50 lives.\n*  1971   – Vietnam War: The Battle of Long Khanh between Australian and Vietnamese communist forces begins.\n*1974 – A new Instrument of Government is promulgated making Sweden a parliamentary monarchy.\n*1981 – Bihar train disaster: A passenger train travelling between Mansi and Saharsa, India, jumps the tracks at a bridge crossing the Bagmati River. The government places the official death toll at 268 plus another 300 missing; however, it is generally believed that the death toll is closer to 1,000.\n*1982 – The Lebanon War begins. Forces under Israeli Defense Minister Ariel Sharon invade southern Lebanon during Operation Peace for the Galilee, eventually reaching as far north as the capital Beirut.\n*1985 – The grave of \"Wolfgang Gerhard\" is opened in Embu, Brazil; the exhumed remains are later proven to be those of Josef Mengele, Auschwitz's \"Angel of Death\"; Mengele is thought to have drowned while swimming in February 1979.\n*1993 – Mongolia holds its first direct presidential elections.\n*2002 – Eastern Mediterranean event. A near-Earth asteroid estimated at ten meters in diameter explodes over the Mediterranean Sea between Greece and Libya. The resulting explosion is estimated to have a force of 26 kilotons, slightly more powerful than the Nagasaki atomic bomb.\n*2004 – Tamil is established as a \"classical language\" by the President of India, Dr A. P. J. Abdul Kalam, in a joint sitting of the two houses of the Indian Parliament.\n*2005 – In Gonzales v. Raich, the United States Supreme Court upholds a federal law banning cannabis, including medical marijuana.\n\nBirths\n\n*1236 – Wen Tianxiang, Chinese general and scholar (d. 1283)\n*1243 – Alix of Brittany, Dame de Pontarcy; Breton noble (d. 1288)\n*1296 – Władysław of Legnica (d. 1352)\n*1436 – Regiomontanus, German mathematician, astronomer, and bishop (d. 1476)\n*1519 – Andrea Cesalpino, Italian philosopher, physician, and botanist (d. 1603)\n*1539 – Catherine Vasa, Regent of East Frisia (d. 1610)\n*1553 – Bernardino Baldi, Italian mathematician and author (d. 1617)\n*1556 – Edward la Zouche, 11th Baron Zouche, English politician and diplomat (d. 1625)\n*1576 – Giovanni Diodati, Swiss-Italian minister, theologian, and academic (d. 1649)\n*1580 – Godefroy Wendelin, Belgian astronomer and author (d. 1667)\n*1584 – Yuan Chonghuan, politician, military general and writer (d. 1630)\n*1599 – Diego Velázquez, Spanish painter and educator (d. 1660)\n*1606 – Pierre Corneille, French playwright and producer (d. 1684)\n*1622 – Claude-Jean Allouez, French-American missionary and explorer (d. 1689)\n*1646 – Hortense Mancini, favourite Italian niece of Cardinal Mazarin (d. 1699)\n*1661 – Giacomo Antonio Perti, Italian composer and educator (d. 1756)\n*1699 – Johann Georg Estor, German historian and theorist (d. 1773)\n*1714 – Joseph I of Portugal (d. 1777)\n*1735 – Anton Schweitzer, German composer (d. 1787)\n*1755 – Nathan Hale, American soldier (d. 1776)\n*1756 – John Trumbull, American soldier and painter (d. 1843)\n*1772 – Maria Theresa of Naples and Sicily (d. 1807)\n*1799 – Alexander Pushkin, Russian author and poet (d. 1837)\n*1807 – Thiệu Trị, Vietnamese emperor (d. 1847)\n*1810 – Friedrich Wilhelm Schneidewin, German philologist and scholar (d. 1856)\n*1829 – Honinbo Shusaku, Japanese Go player (d. 1862)\n*1841 – Eliza Orzeszkowa, Polish author and publisher (d. 1910)\n*1844 – Konstantin Savitsky, Russian painter and academic (d. 1905)\n*1850 – Karl Ferdinand Braun, German-American physicist and academic, Nobel Prize laureate (d. 1918)\n*1857 – Aleksandr Lyapunov, Russian mathematician and physicist (d. 1918)\n*1862 – Henry Newbolt, English historian, author, and poet (d. 1938)\n*1867 – David T. Abercrombie, American surveyor and businessman, founded Abercrombie & Fitch (d. 1931)\n*1868 – Robert Falcon Scott, English sailor and explorer (d. 1912)\n*1872 – Alix of Hesse, German princess and Russian empress (d.1918)\n*1875 – Thomas Mann, German author and critic, Nobel Prize laureate (d. 1955)\n*1878 – Vincent de Moro-Giafferi, French lawyer and politician (d. 1956)\n*1884 – Jock Hutchison, Scottish-American golfer (d. 1977)\n*1890 – Ted Lewis, American singer, clarinet player, and bandleader (d. 1971)\n*1891 – Masti Venkatesha Iyengar, Indian author and academic (d. 1986)\n*  1891   – Erich Marcks, German general (d. 1944)\n*1896 – Henry Allingham, English soldier (d. 2009)\n*  1896   – Italo Balbo, Italian air marshal and politician (d. 1940)\n*1898 – Walter Abel, American actor (d. 1987)\n*  1898   – Jacobus Johannes Fouché, South African politician, 2nd State President of South Africa (d. 1980)\n*  1898   – Ninette de Valois, English ballerina, choreographer, and director (d. 2001)\n*1900 – Manfred Sakel, Ukrainian-American psychiatrist and physician (d. 1957)\n*1901 – Jan Struther, English author and hymnwriter (d. 1953)\n*  1901   – Sukarno, Indonesian engineer and politician, 1st President of Indonesia (d. 1970)\n*1902 – Jimmie Lunceford, American saxophonist and bandleader (d. 1947)\n*1903 – Aram Khachaturian, Armenian composer and conductor (d. 1978)\n*1903 – Bakht Singh, Indian evangelist, well-known bible teacher and preacher  (d. 2000)\n*1906 – Max August Zorn, German mathematician and academic (d. 1993)\n*1907 – Bill Dickey, American baseball player and manager (d. 1993)\n*  1907   – Robin Humphreys, British scholar of Latin America (d. 1999)\n*1908 – Giovanni Bracco, Italian race car driver (d. 1968)\n*1909 – Isaiah Berlin, Latvian-English historian and philosopher (d. 1997)\n*1913 – Carlo L. Golino, Italian-American author, critic, and academic (d. 1991)\n*1915 – Vincent Persichetti, American pianist and composer (d. 1987)\n*1916 – Hamani Diori, Nigerien academic and politician, 1st President of Niger (d. 1989)\n*1917 – Kirk Kerkorian, American businessman, founded the Tracinda Corporation (d. 2015)\n*1918 – Edwin G. Krebs, American biochemist and academic, Nobel Prize laureate (d. 2009)\n*1919 – Peter Carington, 6th Baron Carrington, English captain and politician, 6th Secretary General of NATO\n*1923 – V. C. Andrews, American author, illustrator, and painter (d. 1986)\n*  1923   – Jean Pouliot, Canadian broadcaster (d. 2004)\n*1925 – Maxine Kumin, American poet and author (d. 2014)\n*  1925   – Frank Chee Willeto, American soldier and politician, 4th Vice President of the Navajo Nation (d. 2013)\n*1926 – Torsten Andersson, Swedish painter and illustrator (d. 2009)\n*  1926   – Erdal İnönü, Turkish physicist and politician, Prime Minister of Turkey (d. 2007)\n*  1926   – Klaus Tennstedt, German conductor (d. 1998)\n*1929 – Sunil Dutt, Indian actor, director, producer, and politician (d. 2005)\n*1930 – Frank Tyson, English-Australian cricketer, coach, and journalist (d. 2015)\n*1932 – David Scott, American colonel, engineer, and astronaut\n*  1932   – Billie Whitelaw, English actress (d. 2014)\n*1933 – Eli Broad, American businessman and philanthropist, co-founded KB Home\n*  1933   – Heinrich Rohrer, Swiss physicist and academic, Nobel Prize laureate (d. 2013)\n*1934 – Albert II of Belgium\n*1935 – Jon Henricks, Australian swimmer\n*1936 – Mompati Merafhe, Botswana general and politician, Vice-President of Botswana (d. 2015)\n*  1936   – D. Ramanaidu, Indian actor, director, and producer, founded Suresh Productions (d. 2015)\n*  1936   – Levi Stubbs, American singer (d. 2008)\n*1938 – Prince Luiz of Orléans-Braganza\n*  1938   – Ryuchi Matsuda, Japanese martial artist and author (d. 2013)\n*1939 – Louis Andriessen, Dutch pianist and composer\n*  1939   – Gary U.S. Bonds, American singer-songwriter\n*  1939   – Eddie Giacomin, Canadian-American ice hockey player, coach, and sportscaster\n*1940 – Kumar Bhattacharyya, Baron Bhattacharyya, Indian-English engineer and academic\n*  1940   – Tiger Lance, South African cricketer (d. 2010)\n*  1940   – Willie John McBride, Northern Irish rugby player, coach, and manager\n*1941 – Alexander Cockburn, Scottish-American journalist and author (d. 2012)\n*1943 – José de Jesús Gudiño Pelayo, Mexican lawyer and jurist (d. 2010)\n*  1943   – Asif Iqbal, Indian-Pakistani cricketer\n*  1943   – Richard Smalley, American chemist and academic, Nobel Prize laureate (d. 2005)\n*  1943   – Joe Stampley, American country music singer-songwriter\n*1944 – Monty Alexander, Jamaican pianist \n*  1944   – Edgar Froese, Russian-German keyboard player and songwriter (d. 2015)\n*  1944   – Phillip Allen Sharp, American geneticist and biologist, Nobel Prize laureate\n*  1944   – Tommie Smith, American runner and football player\n*1945 – David Dukes, American actor (d. 2000)\n*  1945   – Nikolai Velikov, Russian figure skater and coach\n*1946 – Tony Levin, American bass player and songwriter \n*1947 – David Blunkett, English academic and politician, Secretary of State for Education\n*  1947   – Robert Englund, American actor\n*  1947   – Ada Kok, Dutch swimmer\n*1948 – Arlene Harris, American entrepreneur, inventor, investor and policy advocate\n*1949 – Ioannis Matzourakis, Greek footballer and manager \n*  1949   – Holly Near, American folk singer-songwriter\n*1950 – Chantal Akerman, Belgian actress, director, and producer (d. 2015)\n*1951 – Marietta Giannakou, Greek psychiatrist and politician, Greek Minister of Health\n*  1951   – Noritake Takahara, Japanese race car driver\n*  1951   – Dwight Twilley, American rock singer-songwriter, guitarist, and pianist\n*1952 – Yukihiro Takahashi, Japanese drummer, producer, and actor\n*1953 – Dimitris Avramopoulos, Greek lieutenant and politician, Greek Minister for National Defence\n*1954 – Harvey Fierstein, American actor and playwright\n*  1954   – Allan Hewson, New Zealand rugby player\n*  1954   – Urve Tiidus, Estonian journalist and politician, 8th Estonian Minister of Culture\n*  1954   – Władysław Żmuda, Polish footballer and manager\n*1955 – Sandra Bernhard, American actress and comedian\n*  1955   – Sam Simon, American director, producer, and screenwriter (d. 2015)\n*  1955   – Suresh Bhardwaj, Indian stage designer, director and theatre teacher (d. 2016)\n*  1955   – Lee Smolin, American theoretical physicist\n*1956 – Björn Borg, Swedish tennis player and fashion designer\n*  1956   – Dave Cusack, English footballer and manager\n*  1956   – Marco Minniti, Italian politician, Italian Minister of the Interior\n*1957 – Mike Gatting, English cricketer, coach, and sportscaster\n*  1957   – Balanadarajah Iyer, Sri Lankan poet and activist (d. 2004)\n*  1957   – Christian Rach, German chef and author\n*1959 – Jimmy Jam, American keyboard player, songwriter, and producer \n*  1959   – Andrey Prokofyev, Russian sprinter and hurdler (d. 1989)\n*  1959   – David Schultz, American wrestler (d. 1996)\n*1960 – Steve Vai, American singer-songwriter, guitarist, and producer \n*1961 – Tom Araya, Chilean-American singer-songwriter and bass player \n*  1961   – Nir Brand, Israeli composer and conductor\n*1962 – Grant Fox, New Zealand rugby player and sportscaster\n*1963 – Eric Cantor, American lawyer and politician\n*  1963   – Vincent Collet, French former professional basketball player\n*  1963   – Wolfgang Drechsler, German scholar, author, and academic\n*  1963   – Jason Isaacs, English actor \n*  1963   – Ahmed Johnson, American football player, wrestler, and actor\n*  1963   – Dariusz Kubicki, Polish footballer and coach\n*1964 – Jay Bentley, American singer and bass player \n*1965 – Cam Neely, Canadian ice hockey player and actor\n*  1965   – Megumi Ogata, Japanese voice actress and singer\n*1967 – Max Casella, American actor\n*  1967   – Paul Giamatti, American actor \n*1968 – François Avard, Canadian author and screenwriter\n*1969 – Erik Prince, American soldier and businessman, co-founded Academi\n*  1969   – Fernando Redondo, Argentinian footballer\n*1970 – Evgeni Berzin, Russian cyclist\n*  1970   – Richard Di Natale, Australian politician\n*  1970   – Albert Ferrer, Spanish footballer and coach\n*  1970   – Sunil Joshi, Indian cricketer\n*  1970   – James Shaffer, American guitarist, songwriter, and producer\n*1972 – Noriaki Kasai, Japanese ski jumper\n*  1972   – Natalie Morales, American television journalist and anchor  \n*1973 – Patrick Rothfuss, American author and academic\n*1974 – Uncle Kracker (Matthew Shafer), American singer-songwriter and guitarist\n*  1974   – Guillaume Musso, French novelist\n*1975 – Niklas Sundström, Swedish ice hockey player\n*1976 – Emilie-Claire Barlow, Canadian singer and actress\n*  1976   – Geoff Rowley, English skateboarder and businessman\n*1977 – David Connolly, English-Irish footballer\n*  1977   – Mark Ellis, American baseball player\n*1978 – Carl Barât, English singer-songwriter\n*1981 – Luke Burt, Australian rugby league player \n*1982 – Marian Oprea, Romanian triple jumper\n*1983 – Michael Krohn-Dehli, Danish footballer\n*  1983   – Joe Rokocoko, Fijian-New Zealand rugby player\n*1985 – Drew Galloway, Scottish wrestler\n*  1985   – Martyn Irvine, Northern Irish cyclist\n*  1985   – Sebastian Larsson, Swedish footballer\n*  1985   – Nikolay Varbanov, Bulgarian basketball player\n*1986 – Junichi Tazawa, Japanese-American baseball player\n*1987 – Niklas Hjalmarsson, Swedish ice hockey player\n*  1987   – Rory Kostjasyn, Australian-Irish rugby league player\n*  1987   – Rubin Okotie, Austrian footballer\n*1988 – Maria Alyokhina, Russian singer and activist \n*  1988   – Ryan Brathwaite, Barbadian hurdler\n*  1988   – Israel Dagg, New Zealand rugby player\n*1989 – Paula Brancati, Canadian actress \n*  1989   – Darcy Lussick, Australian rugby league player \n*  1989   – Paweł Wojciechowski, Polish pole vaulter\n*1990 – Raisa Andriana, Indonesian singer and actress\n*  1990   – Vid Belec, Slovenian footballer\n*  1990   – Anthony Rendon, American baseball player\n*1992 – DeAndre Hopkins, American football player\n*  1992   – Hyuna, South Korean singer-songwriter, dancer, and model \n*1993 – Vic Mensa, American rapper \n*1994 – Jake Mamo, Australian rugby league player\n*1995 – Julian Green, American footballer\n\nDeaths\n\n* 184 – Qiao Xuan, Chinese official (b. 110)\n* 863 – Abu Musa Utamish, Muslim vizier \n* 913 – Alexander III, Byzantine emperor (b. 870)\n*1097 – Agnes of Aquitaine, Queen of Aragon and Navarre\n*1134 – Norbert of Xanten, German bishop and saint (b. 1060)\n*1217 – Henry I, King of Castile and Toledo (b. 1204)\n*1237 – John of Scotland, Earl of Huntingdon\n*1251 – William III of Dampierre, Count of Flanders\n*1252 – Robert Passelewe, Bishop of Chichester\n*1333 – William Donn de Burgh, 3rd Earl of Ulster (b. 1312)\n*1393 – Emperor Go-En'yū of Japan (b. 1359)\n*1480 – Vecchietta, Italian painter, sculptor, and architect (b. 1412)\n*1511  – Ahmad ibn Abi Jum'ah, Islamic scholar, author of the Oran fatwa\n*1548 – João de Castro, Portuguese soldier and politician, Governor of Portuguese India (b. 1500)\n*1561 – Ridolfo Ghirlandaio, Italian painter (b. 1483)\n*1583 – Nakagawa Kiyohide, Japanese daimyo (b. 1556)\n*1659 – Nadira Banu Begum, Mughal princess (b. 1618)\n*1661 – Martino Martini, Italian Jesuit missionary (b. 1614)\n*1730 – Alain Emmanuel de Coëtlogon, French general (b. 1646)\n*1740 – Alexander Spotswood, Moroccan-American colonial and politician, Lieutenant Governor of Virginia (b. 1676)\n*1784 – Joan van der Capellen tot den Pol, Dutch politician (b. 1741)\n*1799 – Patrick Henry, American lawyer and politician, 1st Governor of Virginia (b. 1736)\n*1813 – Alexandre-Théodore Brongniart, French architect, designed the Hôtel de Mademoiselle de Condé (b. 1739)\n*  1813   – Antonio Cachia, Maltese architect, engineer and archaeologist (b. 1739)\n*1832 – Jeremy Bentham, English jurist and philosopher (b. 1748)\n*1840 – Marcellin Champagnat, French priest and saint, founded the Marist Brothers (b. 1789)\n*1843 – Friedrich Hölderlin, German poet and author (b. 1770)\n*1861 – Camillo Benso, Count of Cavour, Italian politician, 1st Prime Minister of Italy (b. 1810)\n*1862 – Turner Ashby, American colonel (b. 1828)\n*1865 – William Quantrill, American captain (b. 1837)\n*1878 – Robert Stirling, Scottish minister and engineer, invented the stirling engine (b. 1790)\n*1881 – Henri Vieuxtemps, Belgian violinist and composer (b. 1820)\n*1883 – Ciprian Porumbescu, Ukrainian-Romanian composer and poet (b. 1853)\n*1891 – John A. Macdonald, Scottish-Canadian lawyer and politician, 1st Prime Minister of Canada (b. 1815)\n*1916 – Yuan Shikai, Chinese general and politician, 2nd President of the Republic of China (b. 1859)\n*1922 – Lillian Russell, American actress and singer (b. 1860)\n*1924 – William Pirrie, 1st Viscount Pirrie, Irish businessman and politician, Lord Mayor of Belfast (b. 1847) \n*1934 – Julije Kempf, Croatian historian and author (b. 1864)\n*1935 – Julian Byng, 1st Viscount Byng of Vimy, English field marshal and politician, 12th Governor-General of Canada (b. 1862)\n*1941 – Louis Chevrolet, Swiss-American race car driver and businessman, founded Chevrolet and Frontenac Motor Corporation (b. 1878)\n*1943 – Pandelis Pouliopoulos, Greek politician (b. 1900)\n*1946 – Gerhart Hauptmann, German novelist, poet, and playwright, Nobel Prize laureate (b. 1862)\n*1947 – James Agate, English author and critic (b. 1877)\n*1948 – Louis Lumière, French director, producer, and screenwriter (b. 1864)\n*1951 – Olive Tell, American actress (b. 1894)\n*1954 – Fritz Kasparek, Austrian mountaineer and author (b. 1910)\n*1955 – Max Meldrum, Scottish-Australian painter and educator (b. 1875)\n*1961 – Carl Jung, Swiss psychiatrist and psychotherapist (b. 1875)\n*1962 – Yves Klein, French painter (b. 1928)\n*  1962   – Tom Phillis, Australian motorcycle racer (b. 1934)\n*1963 – William Baziotes, American painter and academic (b. 1912)\n*1968 – Randolph Churchill, English journalist and politician (b. 1911)\n*  1968   – Robert F. Kennedy, American soldier, lawyer, and politician, 64th United States Attorney General (b. 1925)\n*  1968   – Kâzım Özalp, Turkish general and politician, 3rd Turkish Minister of National Defence (b. 1880)\n*1975 – Larry Blyden, American actor (b. 1925)\n*1976 – J. Paul Getty, American businessman, founded the Getty Oil Company (b. 1892)\n*1979 – Jack Haley, American actor (b. 1897)\n*1980 – Ruth Aarons, American table tennis player and manager (b. 1918)\n*1982 – Kenneth Rexroth, American poet and academic (b. 1905)\n*1983 – Hans Leip, German author, poet, and playwright (b. 1893)\n*1984 – A. Bertram Chandler, English-Australian soldier and author (b. 1912)\n*1991 – Stan Getz, American saxophonist (b. 1927)\n*1994 – Barry Sullivan, American actor (b. 1912)\n*1996 – George Davis Snell, American geneticist and immunologist, Nobel Prize laureate (b. 1903)\n*1997 – Magda Gabor, Hungarian-American actress and socialite (b. 1915)\n*2000 – Frédéric Dard, French author and screenwriter (b. 1921)\n*2001 – Suzanne Schiffman, French screenwriter and director (b. 1939)\n*2003 – Ken Grimwood, American author (b. 1944)\n*  2003   – Dave Rowberry, English singer-songwriter and pianist  (b. 1940)\n*2005 – Anne Bancroft, American actress (b. 1931)\n*  2005   – Dana Elcar, American actor (b. 1927)\n*2006 – Arnold Newman, American photographer and educator (b. 1918)\n*  2006   – Billy Preston, American singer-songwriter, pianist, and actor (b. 1946)\n*  2006   – Camille Sandorfy, Hungarian-Canadian chemist and academic (b. 1920)\n*2009 – Jean Dausset, French-Spanish immunologist and academic, Nobel Prize laureate (b. 1916)\n*  2009   – Jim Owens, American football player and coach (b. 1927)\n*2010 – Marvin Isley, American singer-songwriter and bass player (b. 1953)\n*2012 – Vladimir Krutov, Russian ice hockey player (b. 1960)\n*  2012   – Manuel Preciado Rebolledo, Spanish footballer and coach (b. 1957)\n*  2012   – Mykola Volosyanko, Ukrainian footballer and manager (b. 1972)\n*2013 – Jerome Karle, American chemist and academic, Nobel Prize laureate (b. 1918)\n*  2013   – Eugen Merzbacher, German-American physicist and academic (b. 1921)\n*  2013   – Tom Sharpe, English-Spanish author and academic (b. 1928)\n*  2013   – Esther Williams, American swimmer and actress (b. 1921)\n*2014 – Ado Bayero, Nigerian politician and diplomat (b. 1930)\n*  2014   – Eric Hill, English-American author and illustrator (b. 1927)\n*  2014   – Lorna Wing, English psychiatrist and physician (b. 1928)\n*2015 – Pierre Brice, French actor (b. 1929)\n*  2015   – Vincent Bugliosi, American lawyer and author (b. 1934)\n*  2015   – Ronnie Gilbert, American singer-songwriter (b. 1926)\n*  2015   – Ludvík Vaculík, Czech journalist and author (b. 1926)\n*2016 – Viktor Korchnoi, Russian chess player (b. 1931)\n*  2016   – Peter Shaffer, English playwright and screenwriter (b. 1926)\n\nHolidays and observances\n\n*Christian feast day:\n**Claude the Thaumaturge\n**Gottschalk\n**Ini Kopuria (Church of England, Episcopal Church, Anglican Church of Melanesia)\n**Marcellin Champagnat\n**Norbert of Xanten\n**June 6 (Eastern Orthodox liturgics)\n*Engineer's Day (Taiwan)\n*Korean Children’s Union Foundation Day  (North Korea)\n*Memorial Day (South Korea)\n*National Day, marks the end of the Danish-ruled Kalmar Union. (Sweden)\n*National Huntington's Disease Awareness Day (United States)\n*Normandy landings of the Allied Expeditionary Forces (D-Day), a.k.a. Operation Neptune, part of Operation Overlord (1944)\n*Queensland Day (Queensland)\n*Teachers' Day (Bolivia)\n*UN Russian Language Day (United Nations). June 6. http://en.wikipedia.org/?curid=15794."
  }
}
