{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14688",
  "eid" : "171c3120-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778548018,
  "textBody" : "The demographic features of Israel are monitored by the Israel Central Bureau of Statistics. The State of Israel has a population of approximately 8,793,000 inhabitants as of end-2017. Some 74.6% percent are Jews of all backgrounds (about 6,556,000 individuals), 20.9% are Arab of any religion other than Jewish (about 1,837,000 individuals), while the remaining 4.5% (about 400,000 individuals) are defined as \"others\" including persons of Jewish ancestry deemed non-Jewish by religious law and persons of non-Jewish ancestry who are family members of Jewish immigrants (neither of which are registered at the Ministry of Interior as Jews), Christian non-Arabs, Muslim non-Arabs, and all other residents who have neither an ethnic nor religious classification.\n\nIsrael's annual population growth rate stood at 2.0% in 2015, more than three times faster than the OECD average of around 0.6%. With an average of three children per woman, Israel also has the highest fertility rate in the OECD by a considerable margin, and much higher than the OECD average of 1.7\n\nGenerally, population trends in Israel reflect distinct patterns of three sub-groups: Non-Haredi Jews (around 63.3% of the population), Haredi Jews (11.7%), and Arabs (20.7%).http://www.cbs.gov.il/publications/tec27.pdf Over the past decade, the Muslim annual population growth has fallen significantly, from around 3% to less than 2.2% by 2013,[http://www.cbs.gov.il/reader/shnaton/templ_shnaton_e.html?num_tabst02_01&CYear\n2013 Statistical Abstract of Israel 2013 - No. 64 Subject 2 - Table No. 1] while the overall Jewish growth rate rose from around 1.4% to 1.7%, primarily due to the expanding Orthodox Jewish sector.https://www.un.org/esa/population/publications/completingfertility/RevisedFriedlanderpaper.PDF\n\nDefinition\n\nThe territory of Israel can be defined in a number of ways as a result of a complex and unresolved political situation (see table below). For example, whilst the Israel Central Bureau of Statistics defines the area of Israel to include the annexed East Jerusalem and Golan Heights, and to exclude the militarily controlled regions of the West Bank, the CBS defines the population of Israel to also include Israeli settlers living in the Area C of West Bank and the Muslim residents of East Jerusalem and Area C, who have Israeli residency or citizenship.\n\nCities\n\nWithin Israel's system of local government, an urban municipality can be granted a city council by the Israeli Interior Ministry when its population exceeds 20,000. The term \"city\" does not generally refer to local councils or urban agglomerations, even though a defined city often contains only a small portion of an urban area or metropolitan area's population.\n\nEthnic and religious groups\n\nThe most prominent ethnic and religious groups, who live in Israel at present and who are Israeli citizens or nationals, are as follows:\n\nJews\n\nAccording to Israel's Central Bureau of Statistics, in 2008, of Israel's 7.3 million people, 75.6 percent were Jews of any background. Among them, 70.3 percent were Sabras (born in Israel), mostly second- or third-generation Israelis, and the rest are olim (Jewish immigrants to Israel)—20.5 percent from Europe and the Americas, and 9.2 percent from Asia and Africa, including the Arab countries.\n\nThe paternal lineage of the Jewish population of Israel as of 2015 is as follows:\n\nAtheism\n\nThe 2009 survey by the Guttman Center found the following distribution:\n* Believing in the existence of God – 80%\n* Not believing in the existence of God – 20%\n\nFertility rates between secular and religious Jewish groups also differ significantly.\n\nArabs\n\nArab citizens of Israel are those Arab residents of Mandatory Palestine, who remained within Israel's borders following the 1948 Arab-Israeli War, and the establishment of the state of Israel. It is including those born within the state borders subsequent to this time, as well as those who had left during the establishment of the state (or their descendants), who have since re-entered by means accepted as lawful residence by the Israeli state (primarily family reunifications).\n\nIn 2006, the official number of Arab residents in Israel was 1,413,500 people, about 20 percent of Israel’s population. This figure includes 209,000 Arabs (14% of the Israeli Arab population) in East Jerusalem, also counted in the Palestinian statistics, although 98 percent of East Jerusalem Palestinians have either Israeli residency or Israeli citizenship.\n\nArab Muslims\n\nMost Arab citizens of Israel are Muslim, particularly of the Sunni branch of Islam. A small minority are Ahmadiyya sect and there are also some Alawites (affiliated with Shia Islam) of Ghajar with Israeli citizenship. As of 2008, Arab citizens of Israel comprised just over 20 percent of the country's total population. About 82.6 percent of the Arab population in Israel was Sunni Muslim (with a very small minority of Shia), another 9 percent was Druze, and around 9 percent was Christian (mostly Eastern Orthodox and Catholic denominations).\n\nBedouin\n\nThe Arab Muslim citizens of Israel include also the Bedouins, who are divided into two main groups: the Bedouin in the north of Israel, who live in villages and towns for the most part, and the Bedouin in the Negev, who include half-nomadic and inhabitants of towns and Unrecognized villages. According to the Israeli Ministry of Foreign Affairs, as of 1999, 110,000 Bedouins live in the Negev, 50,000 in the Galilee and 10,000 in the central region of Israel. The vast majority of Arab Bedouins of Israel practice Sunni Islam.\n\nAhmadiyya\n\nThe Ahmadiyya community was first established in the region in the 1920s, in what was then Mandatory Palestine. Israel is the only country in the Middle East, where Ahmadi Muslims can openly practice their faith, which is not recognized as part of Islam by most Sunni and Shi'a denominations. As such, Kababir, a neighbourhood on Mount Carmel in Haifa, Israel, acts as the Middle East headquarters of the Community. It is unknown how many Israeli Ahmadis there are, although it is estimated there are about 2,200 Ahmadis in Kababir alone.\n\nArab Christians\n\nThere is a significant Arab Christian minority from various denominations, numbering 122,000 — a majority of Christians in Israel.\n\nCopts\n\nSome 1,000 Israeli citizens belong to the Coptic community, originated in Egypt.\n\nDruze\n\nThe Arab citizens of Israel include also the Druze who were numbered at an estimated 129,800 at the end of 2011. All of the Druze living in what was then British Mandate Palestine became Israeli citizens after the declaration of the State of Israel. Though a few individuals identify themselves as \"Palestinian Druze\", the vast majority of Druze do not consider themselves to be 'Palestinian', and consider their Israeli identity stronger than their Arab identity. Druze serve prominently in the Israel Defense Forces, and are represented in mainstream Israeli politics and business as well, unlike Muslim Arabs who are not required to and generally choose not to serve in the Israeli army.\n\nSyriac Christians\n\nArameans\n\nIn 2014, Israel has decided to recognize the Aramaic community within its borders as a national minority, allowing some of the Christians in Israel to be registered as \"Aramean\" instead of \"Arab\".[http://www.israelnationalnews.com/News/Flash.aspx/304458] As of October 2014, some 600 Israelis requested to be registered as Arameans, with several thousand eligible for the status - mostly members of the Maronite community.\n\nThe Maronite Christian community in Israel of around 7,000 resides mostly in the Galilee, with a presence in Haifa, Nazareth and Jerusalem. It is largely composed of families that lived in Upper Galilee in villages such as Jish long before the establishment of Israel in 1948. In the year 2000, the community was joined by a group of Lebanese SLA militia members and their families, who fled Lebanon after 2000 withdrawal of IDF from South Lebanon.\n\nAssyrians\n\nThere are around 1,000 Assyrians living in Israel, mostly in Jerusalem and Nazareth. Assyrians are an Aramaic speaking, Eastern Rite Christian minority who are descended from the ancient Mesopotamians. The old Syriac Orthodox monastery of Saint Mark lies in Jerusalem. Other than followers of the Syriac Orthodox Church, there are also followers of the Assyrian Church of the East and the Chaldean Catholic Church living in Israel.\n\nOther citizens\n\nSamaritans\n\nThe Samaritans are an ethnoreligious group of the Levant. Ancestrally, they claim descent from a group of Israelite inhabitants who have connections to ancient Samaria from the beginning of the Babylonian Exile up to the beginning of the Common Era. 2007 population estimates show that 712 Samaritans live half in Holon, Israel and half at Mount Gerizim in the West Bank. The Holon community holds Israeli citizenship, while the Gerizim community resides at an Israeli controlled enclave, holding dual Israeli-Palestinian citizenship.\n\nArmenians\n\nAbout 4,000 Armenians reside in Israel mostly in Jerusalem (including in the Armenian Quarter), but also in Tel Aviv, Haifa and Jaffa. Armenians have a Patriarchate in Jerusalem and churches in Jerusalem, Haifa and Jaffa. Although Armenians of Old Jerusalem have Israeli identity cards, they are officially holders of Jordanian passports.Joyce M. Davis. [http://www.cnewa.org/default.aspx?ID548&pagetypeID\n4&sitecodeHQ&pageno\n3 Jerusalem’s Armenian Quarter]. Catholic Near East Welfare Association.\n\nCircassians\n\nIn Israel, there are also a few thousand Circassians, living mostly in Kfar Kama (2,000) and Reyhaniye (1,000). These two villages were a part of a greater group of Circassian villages around the Golan Heights. The Circassians in Israel enjoy, like Druzes, a status aparte. Male Circassians (at their leader's request) are mandated for military service, while females are not.\n\nPeople from post-Soviet states\n\nEthnic Russians, Ukrainians, and Belorussians, immigrants from the former Soviet Union, who were eligible to emigrate due to having, or being married to somebody who has, at least one Jewish grandparent and thus qualified for Israeli citizenship under the revised Law of Return. A number of these immigrants also belong to various ethnic groups from the Former Soviet Union such as Armenians, Georgians, Azeris, Uzbeks, Moldovans, Tatars, among others. Some of them, having Jewish father or grandfather identify as Jews, but being non-Jewish by Halakha (Jewish religion law), they are not recognized formally as Jews by state. Most of them are in the mainstream of Israel culture and are called \"expanded Jewish population\". In addition, a certain number of former Soviet citizens, primarily women of Russian and Ukrainian ethnicity, emigrated to Israel, after marrying Muslim or Christian Arab citizens of Israel, who went to study in the former Soviet Union in the 1970s and 1980s.\n\nFinns\n\nAlthough most people of Finnish origin in Israel are Finnish Jews who immigrated to Israel, and their descendants, a small number of Finnish Christians moved to Israel in the 1940s before the independence and gained citizenship following independence. For the most part, many of the original Finnish settlers intermarried with the other communities in the country, and therefore remain very small in number. A Moshav shitufi near Jerusalem named Yad HaShmona, meaning the \"Memorial for the Eight\", was established in 1971 by a group of Finnish Christian-Israelis, although today, most members are Israeli, and are predominantly Hebrew speakers, and the moshav has become a center of so-called \"Messianic Jews\".\n\nBaha'is\n\nThe Baha'i population in Israel can be divided into several groups. The most senior group of Israeli Baha'is consists of those who are employed or have some other role in the pilgrimage sites. These Baha'is number between six hundred to seven hundred and primarily reside in either Acre or Haifa.Nechemia Meyers (1995). \"Peace to all nations - Baha'is Establish Israel's Second Holy Mountain\". The World & I. Retrieved Mar 5, 2015Donald H. Harrison (April 3, 1998). \"The Fourth Faith\". Jewish Sightseeing (Haifa, Israel). Retrieved Mar 5, 2015 A fluctuating segment of Baha'is consists of pilgrims.World Religions in America: An Introduction - Page 264, Jacob Neusner - 2003 The number of self-identified Baha'i Israeli citizens has been estimated at 14,000 in 2000.David B. Barrett, World Christian Encyclopedia (2001)Global Institutions of Religion, page 88, Katherine Marshall - 2013\n\nVietnamese\n\nThe number of Vietnamese people in Israel and their descendants is estimated at 150 to 200.[http://www.timesofisrael.com/35-years-on-where-are-israels-vietnamese-refugees/] Most of them came to Israel in between 1976–1979, after prime minister Menachem Begin authorized their admission to Israel and granted them political asylum. The Vietnamese people living in Israel are Israeli citizens who also serve in the Israel Defense Forces. Today, the majority of the community lives in the Gush Dan area in the center of Tel Aviv, but also a few dozen Vietnamese-Israelis or Israelis of Vietnamese origin live in Haifa, Jerusalem, and Ofakim.\n\nAfrican Hebrew Israelites of Jerusalem\n\nThe African Hebrew Israelite Nation of Jerusalem is a small spiritual group of African Americans, whose members believe they are descended from the Ten Lost Tribes of Israel. With a population of over 5,000, most members live in their own community in Dimona, Israel, with additional families in Arad, Mitzpe Ramon, and the Tiberias area. At least some of them consider themselves to be Jewish, but mainstream scholarship does not consider them to be of Israelite but of subsaharan African origin. Their ancestors were African Americans who after several years in Liberia migrated to Israel in the late 1960s and demanded that Israel give them citizenship in the state. When Israel refused, they relinquished their United States citizenship and de facto became stateless. After some deliberation, the Israeli government granted them citizenship. The African Hebrew Israelites, like the Haredim and most Israeli Arabs, are not required to serve in the military; however, some do so, and they do receive social benefits from the state, including free health care. Most believe in a kind of Paleo-Judaism based on the Torah without the Oral Laws; however, at least one member of the community underwent a conversion to Orthodox Judaism.\n\nNaturalized foreign workers\n\nSome naturalized foreign workers and their children born in Israel, predominantly from the Philippines, Nepal, Nigeria, Senegal, Romania, China, Cyprus, Turkey, Thailand, and South America (mainly Colombia).\n\nNon-citizens\n\nAfrican migrants\n\nThe number and status of African refugees in Israel is disputed and controversial, but it is estimated that at least 70,000 refugees mainly from Eritrea, Sudan, South Sudan, Ethiopia, and the Ivory Coast reside and work in Israel. A count in late 2011 published in Ynet pointed out the number only in Tel Aviv is 40,000, which represents 10 percent of the city's population. The vast majority is living at the southern parts of the city. There is a significant population in the southern Israeli cities of Eilat, Arad, and Beersheba.\n\nForeign workers\n\nThere are around 300,000 foreign workers, residing in Israel under temporary work visas, including Palestinians. Most of those foreign workers engage in agriculture and construction. The main groups of those foreign workers include the Chinese, Thai, Filipinos, Nigerians, Romanians, and Latin Americans.\n\nOther refugees\n\nApproximately 100–200 refugees from Bosnia, Kosovo, Iraqi Kurdistan, and North Korea were absorbed in Israel as refugees. Most of them were also given Israeli resident status, and currently reside in Israel.[https://www.independent.co.uk/news/world/middle-east/israel-taking-in-aleppo-refugees-syria-war-assad-regime-evacuation-a7489116.html] As of 2006, some 200 ethnic Kurdish refugees from Turkey resided in Israel as illegal immigrants, fleeing the Turkey-PKK conflict. [http://news.walla.co.il/item/967428]\n\nLanguages\n\nDue to its immigrant nature, Israel is one of the most multicultural and multilingual societies in the world. Hebrew and Arabic are the official languages in the country, while English and Russian are the two most widely spoken non-official languages. A certain degree of English is spoken widely, and is the language of choice for many Israeli businesses. Courses of Hebrew and English language are mandatory in the Israeli school system, and most schools offer either Arabic, French, Spanish, German, Italian, or Russian.\n\nReligion\n\nAccording to a 2010 Israel Central Bureau of Statistics study of Israelis aged over 18, 8% of Israeli Jews define themselves as Haredim (or ultra-Orthodox); an additional 12% are \"religious\" (non-Haredi Orthodox, also known as: dati leumi/national-religious or religious Zionist); 13% consider themselves \"religious-traditionalists\" (mostly adhering to Jewish Halakha); 25% are \"non-religious traditionalists\" (only partly respecting the Jewish Halakha), and 43% are \"secular\". Among the seculars, 53% say they believe in God. Due to the higher birth rate of religious and traditionalists over seculars, their share among the overall population is growing as time passes.\n\nWhile the ultra-Orthodox, or Haredim, represented only 5% of Israel's population in 1990, they are expected to represent more than one-fifth of Israel's Jewish population by 2028.\n\nEducation\n\nEducation between ages 5 and 15 is compulsory. It is not free, but it is subsidized by the government, individual organizations (such as the Beit Yaakov System), or a combination. Parents are expected to participate in courses as well. The school system is organized into kindergartens, 6-year primary schools, and either 6-year secondary schools or 3-year junior secondary schools + 3-year senior secondary schools (depending on region), after which a comprehensive examination is offered for university admissions.\n\nPolicy\n\nAs Israel's continued existence as a Jewish state relies upon maintenance of a Jewish demographic majority, Israeli demographers, politicians, and bureaucrats have treated Jewish population growth promotion as a central question in their research and policymaking. Non-Jewish population growth and immigration is regarded as a threat to the Jewish demographic majority, and to Israel's security, as detailed in the Koenig Memorandum.\n\nIsrael is the thirty-fourth most-densely crowded country in the world. In an academic article, Jewish National Fund Board member Daniel Orenstein, argues that, as elsewhere, overpopulation is a stressor on the environment in Israel; he shows that environmentalists have conspicuously failed to consider the impact of population on the environment, and argues that overpopulation in Israel has not been appropriately addressed for ideological reasons.Daniel Orenstein and Steven Hamburg.[http://www.watsoninstitute.org/news_detail.cfm?id=383 \"The JNF's Assault on the Negev\"]; The Jerusalem Report, 28 November 2005\n\nCitizenship and Entry Law\n\nThe Citizenship and Entry into Israel Law (Temporary Order) 5763 was first passed on 31 July 2003, and has since been extended until 31 July 2008. The law places age restrictions for the automatic granting of Israeli citizenship and residency permits to spouses of Israeli citizens, such that spouses who are inhabitants of the West Bank and Gaza Strip are ineligible. On 8 May 2005, the Israeli ministerial committee for issues of legislation once again amended the Citizenship and Entry into Israel Law, to restrict citizenship and residence in Israel only to Palestinian men over the age of 35, and Palestinian women over the age of 25. Those in favor of the law say the law not only limits the possibility of the entrance of terrorists into Israel, but, as Ze'ev Boim asserts, allows Israel \"to maintain the state's democratic nature, but also its Jewish nature\" (i. e., its Jewish demographic majority). Critics, including the United Nations Committee on the Elimination of Racial Discrimination, say the law disproportionately affects Arab citizens of Israel, since Arabs in Israel are far more likely to have spouses from the West Bank and Gaza Strip than other Israeli citizens.\n\nIn the constitutional challenges to the Citizenship and Entry to Israel Law, the state, represented by the Attorney General, insisted that security was the only objective behind the law. The state also added that even if the law was intended to achieve demographic objectives, it is still in conformity with Israel's Jewish and democratic definition, and thus constitutional. In a 2012 ruling by the Supreme Court on the issue, some of the judges on the panel discussed demography, and were inclined to accept that demography is a legitimate consideration in devising family reunification policies that violate the right to family life.Mazen Masri, \"Love Suspended: Demography, Comparative Law and Palestinian Couples in the Israeli Supreme Court\", Social & Legal Studies (2013) 22(3) 309-334. Available at SSRN: http://ssrn.com/abstract=2330291\n\nSoviet immigration\n\nDuring the 1970s about 163,000 people of Jewish descent immigrated to Israel from the USSR.\n\nLater Ariel Sharon, in his capacity as Minister of Housing & Construction and member of the Ministerial Committee for Immigration & Absorption, launched an unprecedented large-scale construction effort to accommodate the new Russian population in Israel so as to facilitate their smooth integration and encourage further Jewish immigration as an ongoing means of increasing the Jewish population of Israel. Between 1989 and 2006, about 979,000 Jews emigrated from the former Soviet Union to Israel.\n\nStatistics\n\nTotal population\n\n* 8,793,000\n\nNote: includes over 200,000 Israelis and 250,000 Arabs in East Jerusalem, about 421,400 Jewish settlers on the West Bank (Judea and Samaria), and about 42,000 in the Golan Heights (July 2007 est.). Does not include Arab populations in the West Bank and Gaza Strip. Does not include 222,000 foreigners living in the country.[http://cbs.gov.il/reader/newhodaot/hodaa_template.html?hodaa=200914192 הודעות לעיתונות]. Cbs.gov.il. Retrieved on 8 September 2011.\n\nAge structure\n\nTotal:\n* 0–14 years: 28.0%\n* 15–64 years: 62.1%\n* 65 years and over: 9.9%\n\nJews:\n* 0–14 years: 25.5%\n* 15–64 years: 63.1%\n* 65 years and over: 11.4%\n\nArab:\n* 0–14 years: 37.5%\n* 15–64 years: 58.6%\n* 65 years and over: 3.9% (2010 est.)\n\nMedian age\n\n* Total: 29.7\n* Jewish: 31.6\n* Arab: 21.1\n\nThe Jewish median age in Jerusalem district and the West Bank are 24.9 and 19.7, respectively, and both account for 16% of the Jewish population, but 24% of 0–4 year olds. The lowest median age in Israel, and one of the lowest in the world, is found in two of the West Bank's biggest Jewish cities: Modiin Ilit (11), Beitar Ilit (11) followed by Bedouin towns in the Negev (15.2).\n\nPopulation growth rate\n\n* 2.0% (2016)\n\nDuring the 1990s, the Jewish population growth rate was about 3% per year, as a result of massive immigration to Israel, primarily from the republics of the former Soviet Union. There is also a very high population growth rate among certain Jewish groups, especially adherents of Orthodox Judaism. The growth rate of the Arab population in Israel is 2.2%, while the growth rate of the Jewish population in Israel is 1.7%. The growth rate of the Arab population has slowed from 3.8% in 1999 to 2.2% in 2013, and for the Jewish population, the growth rate declined from 2.7% to its lowest rate of 1.4% in 2005, before picking up since then to 1.7%.\n\nBirth rate\n\nIV/2016-III/2017\n\n* Total: 21.3 births/1,000 population \n* Jews and others: 20.5 births/1,000 population\n* Muslims: 24.6 births/1,000 population\n* Christians: 14.4 births/1,000 population\n* Druze: 17.3 births/1,000 population\n\nBirths, in absolute numbers, by mother's religionhttp://www.cbs.gov.il/publications18/yarhon1217/pdf/c1.pdfhttp://www.cbs.gov.il/reader/cw_usr_view_SHTML?ID=964\n\nCurrent natural population growth\n\n*Births from January–November 2016 = Jewish: 122,476; Muslim: 34,529; Christian: 2,398; Druze: 2,276; Others: 4,044; Total: 165,723\n*Births from January–November 2017 = Jewish: 122,393; Muslim: 34,977; Christian: 2,260; Druze: 2,156; Others: 3,890; Total: 165,676\n\nBetween the mid-1980s and 2000, the fertility rate in the Muslim sector was stable at 4.6–4.7 children per woman; after 2001, a gradual decline became evident, reaching 3.51 children per woman in 2011. By point of comparison, in 2011, there was a rising fertility rate of 2.98 children among the Jewish population.\n\nBirths and deaths http://unstats.un.org/unsd/demographic/products/dyb/dyb2.htm\n\nStructure of the population  \n\nStructure of the population (01.07.2012) (Estimates) :\n\nDeath rate\n\n* 5.3 deaths/1,000 population (2015 est.)\n\nThere were a total of 38,666 deaths in 2006. (39,026 in 2005 & 37,688 in 2000). Of this 33,568 were Jews (34,031 in 2005 & 33,421 in 2000). 3,078 were Muslims (2,968 in 2005 & 2,683 in 2000). 360 were Druze (363 in 2005 & 305 in 2000). 712 were Christian (686 in 2005 & 666 in 2000).\n\nNet migration rate\n\n* 1.81 migrant(s)/1,000 population (2013 est.)\n\nThere were a total of 26,500 immigrants who made Aliyah to Israel in 2014: 11,430 from the Former Soviet Union, 7,000 from France, 3,470 from the United States, 620 from the United Kingdom, 620 from Colombia, 400 from Canada, 340 from Italy, 300 from Brazil, 297 from Argentina, 240 from Belgium, 232 from Eastern Europe (including 126 from Hungary), 200 from Australia and New Zealand, 190 from South Africa, 120 from Germany, 76 from Mexico, 70 from Venezuela, 58 from Uruguay, and 52 from Chile.\n\nEmigration\n\nFor many years definitive data on Israeli emigration was unavailable.Henry Kamm. \"Israeli emigration inspires anger and fear;\" New York Times 4 January 1981 In The Israeli Diaspora sociologist Stephen J. Gold maintains that calculation of Jewish emigration has been a contentious issue, explaining, \"Since Zionism, the philosophy that underlies the existence of the Jewish state, calls for return home of the world's Jews, the opposite movement—Israelis leaving the Jewish state to reside elsewhere—clearly presents an ideological and demographic problem.\"Stephen J. Gold. The Israeli Diaspora; Routledge 2002, p.8\n\nIn the past several decades, emigration (yerida) has seen a considerable increase. From 1990 to 2005, 230,000 Israelis left the country; a large proportion of these departures included people who initially immigrated to Israel and then reversed their course (48% of all post-1990 departures and even 60% of 2003 and 2004 departures were former immigrants to Israel). 8% of Jewish immigrants in the post-1990 period left Israel, while 15% of non-Jewish immigrants did. In 2005 alone, 21,500 Israelis left the country and had not yet returned at the end of 2006; among them 73% were Jews, 5% Arabs, and 22% \"Others\" (mostly non-Jewish immigrants, with Jewish ancestry, from USSR). At the same time, 10,500 Israelis came back to Israel after over one year abroad; 84% were Jews, 9% Others, and 7% Arabs.[http://cbs.gov.il/reader/newhodaot/hodaa_template.html?hodaa=200701153 ICBS 2005 departures and returns]. Cbs.gov.il. Retrieved on 8 September 2011.\n\nAccording to the Israel Central Bureau of Statistics, as of 2005, 650,000 Israelis had left the country for over one year and not returned. Of them, 530,000 are still alive today. This number does not include the children born overseas. It should also be noted that Israeli law grants citizenship only to the first generation of children born to Israeli emigrants.\n\nDensity\n\nGeographic deployment:\n* Central District: 24% (1,649,800)\n* Tel Aviv District: 17% (1,190,000)\n* Northern District: 17% (1,185,400)\n* Southern District: 14% (1,002,400)\n* Haifa District: 12% (858,000)\n* Jerusalem District: 12% (851,400)\n* Judea and Samaria Area (Israelis only): 5.1% (407,100) (2015)\n\nSex ratio\n\n* At birth: 1.05 male(s)/female\n* Under 15 years: 1.05 male(s)/female\n* 15–64 years: 1.03 male(s)/female\n* 65 years and over: 0.78 male(s)/female\n* Total population: 1.01 male(s)/female (2011 est.)\n\nMaternal mortality rate\n\n* 7 deaths/100,000 live births (2010)\n\nInfant mortality rate\n\n* Total: 4.03 deaths/1,000 live births\n* Male: 4.20 deaths/1,000 live births\n* Female: 3.84 deaths/1,000 live births (2013 est.)\n\nLife expectancy at birth\n\n* Total population: 81.17 years\n* Male: 79.7 years\n* Female: 83.6 years (2011)\n\nBetween 1990 and 2011, life expectancy at birth increased by 5 years for women (both Jews and Arabs), 5.4 years for Jewish men, and 3.2 years for Arab men.\n\nTotal fertility rate\n\n* 3.13 children born/woman (2016)\n\nJewish total fertility rate increased by 10.2% during 1998–2009, and was recorded at 2.90 during 2009. During the same time period, Arab TFR decreased by 20.5%. Muslim TFR was measured at 3.73 for 2009. During 2000, the Arab TFR in Jerusalem (4.43) was higher than that of the Jews residing there (3.79). But as of 2009, Jewish TFR in Jerusalem was measured higher than the Arab TFR (2010: 4.26 vs 3.85, 2009: 4.16 vs 3.87). TFR for Arab residents in the West Bank was measured at 2.91 in 2013, while that for the Jewish residents was reported at 5.10 children per woman.\n\nThe ethnic group with highest recorded TFR is the Bedouin of Negev. Their TFR was reported at 10.06 in 1998, and 5.73 in 2009. TFR is also very high among Haredi Jews. For Ashkenazi Haredim, the TFR rose from 6.91 in 1980 to 8.51 in 1996. The figure for 2008 is estimated to be even higher. TFR for Sephardi/Mizrahi Haredim rose from 4.57 in 1980 to 6.57 in 1996.\n\nHealth expenditures\n\n* 7.6% of total GDP (2010)\n\nPhysicians density\n\n* 3.63 physicians/1,000 population (2007)\n\nHospital bed density\n\n* 3.5 beds/1,000 population (2010)\n\nHIV/AIDS – adult prevalence rate\n\n* 0.2% (2009 est.)\n\nObesity – adult prevalence rate\n\n* 26% of women and 40% of men are overweight. In both genders, obesity rate is 15% (as of 2011).[http://www1.cbs.gov.il/www/statistical/mw2013_e.pdf Statistilite 133 - Women & Men in Israel - 1990-2011] , on cbs.gov.il\n\nEducation expenditures\n\n* 5.9% of total GDP (2009)\n\nLiteracy\n\nAge 15 and over can read and write (2011 estimate):\n* Total population: 97.8%\n* Male: 98.7%\n* Female: 96.8%\n\nFuture projections\n\nIn June 2013, the Central Bureau of Statistics released a demographic report, projecting that Israel's population would grow to 11.4 million by 2035, with the Jewish population numbering 8.3 million, or 73% of the population, and the Arab population at 2.6 million, or 23%. This includes some 2.3 million Muslims (20% of the population), 185,000 Druze, and 152,000 Christians. The report predicts that the Israeli population growth rate will decline to 1.4% annually, with growth in the Muslim population remaining higher than the Jewish population until 2035, at which point the Jewish population will begin growing the fastest.[http://www.haaretz.com/news/national/peering-into-the-crystal-ball-how-israel-will-look-statistically-in-2035.premium-1.532152 Peering into the crystal ball: How Israel will look, statistically, in 2035] – Haaretz\n\nIn 2017, the Central Bureau of Statistics projected that Israel's population would rise to about 18 million by 2059, including 14.4 million Jews and 3.6 million Arabs. Of the Jewish population, about 5.25 million would be ultra-Orthodox Jews. Overall, the forecast projected that 49% of the population would be either ultra-Orthodox Jews (29%) and Arabs (20%).http://www.timesofisrael.com/half-of-israel-to-be-arab-ultra-orthodox-by-2059-projections/ It also projected a population of 20 million in 2065.http://www.jpost.com/Israel-News/Report-Israels-population-to-reach-20-million-by-2065-492429\n\nOther forecasts project that Israel could have a population as high as 23 million, or even 36 million, by 2050.http://www.haaretz.com/israel-news/1.783515",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Demographics of Israel" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14688" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The demographic features of Israel are monitored by the Israel Central Bureau of Statistics. The State of Israel has a population of approximately 8,793,000 inhabitants as of end-2017. Some 74.6% percent are Jews of all backgrounds (about 6,556,000 individuals), 20.9% are Arab of any religion other than Jewish (about 1,837,000 individuals), while the remaining 4.5% (about 400,000 individuals) are defined as \"others\" including persons of Jewish ancestry deemed non-Jewish by religious law and persons of non-Jewish ancestry who are family members of Jewish immigrants (neither of which are registered at the Ministry of Interior as Jews), Christian non-Arabs, Muslim non-Arabs, and all other residents who have neither an ethnic nor religious classification.\n\nIsrael's annual population growth rate stood at 2.0% in 2015, more than three times faster than the OECD average of around 0.6%. With an average of three children per woman, Israel also has the highest fertility rate in the OECD by a considerable margin, and much higher than the OECD average of 1.7\n\nGenerally, population trends in Israel reflect distinct patterns of three sub-groups: Non-Haredi Jews (around 63.3% of the population), Haredi Jews (11.7%), and Arabs (20.7%).http://www.cbs.gov.il/publications/tec27.pdf Over the past decade, the Muslim annual population growth has fallen significantly, from around 3% to less than 2.2% by 2013,[http://www.cbs.gov.il/reader/shnaton/templ_shnaton_e.html?num_tabst02_01&CYear\n2013 Statistical Abstract of Israel 2013 - No. 64 Subject 2 - Table No. 1] while the overall Jewish growth rate rose from around 1.4% to 1.7%, primarily due to the expanding Orthodox Jewish sector.https://www.un.org/esa/population/publications/completingfertility/RevisedFriedlanderpaper.PDF\n\nDefinition\n\nThe territory of Israel can be defined in a number of ways as a result of a complex and unresolved political situation (see table below). For example, whilst the Israel Central Bureau of Statistics defines the area of Israel to include the annexed East Jerusalem and Golan Heights, and to exclude the militarily controlled regions of the West Bank, the CBS defines the population of Israel to also include Israeli settlers living in the Area C of West Bank and the Muslim residents of East Jerusalem and Area C, who have Israeli residency or citizenship.\n\nCities\n\nWithin Israel's system of local government, an urban municipality can be granted a city council by the Israeli Interior Ministry when its population exceeds 20,000. The term \"city\" does not generally refer to local councils or urban agglomerations, even though a defined city often contains only a small portion of an urban area or metropolitan area's population.\n\nEthnic and religious groups\n\nThe most prominent ethnic and religious groups, who live in Israel at present and who are Israeli citizens or nationals, are as follows:\n\nJews\n\nAccording to Israel's Central Bureau of Statistics, in 2008, of Israel's 7.3 million people, 75.6 percent were Jews of any background. Among them, 70.3 percent were Sabras (born in Israel), mostly second- or third-generation Israelis, and the rest are olim (Jewish immigrants to Israel)—20.5 percent from Europe and the Americas, and 9.2 percent from Asia and Africa, including the Arab countries.\n\nThe paternal lineage of the Jewish population of Israel as of 2015 is as follows:\n\nAtheism\n\nThe 2009 survey by the Guttman Center found the following distribution:\n* Believing in the existence of God – 80%\n* Not believing in the existence of God – 20%\n\nFertility rates between secular and religious Jewish groups also differ significantly.\n\nArabs\n\nArab citizens of Israel are those Arab residents of Mandatory Palestine, who remained within Israel's borders following the 1948 Arab-Israeli War, and the establishment of the state of Israel. It is including those born within the state borders subsequent to this time, as well as those who had left during the establishment of the state (or their descendants), who have since re-entered by means accepted as lawful residence by the Israeli state (primarily family reunifications).\n\nIn 2006, the official number of Arab residents in Israel was 1,413,500 people, about 20 percent of Israel’s population. This figure includes 209,000 Arabs (14% of the Israeli Arab population) in East Jerusalem, also counted in the Palestinian statistics, although 98 percent of East Jerusalem Palestinians have either Israeli residency or Israeli citizenship.\n\nArab Muslims\n\nMost Arab citizens of Israel are Muslim, particularly of the Sunni branch of Islam. A small minority are Ahmadiyya sect and there are also some Alawites (affiliated with Shia Islam) of Ghajar with Israeli citizenship. As of 2008, Arab citizens of Israel comprised just over 20 percent of the country's total population. About 82.6 percent of the Arab population in Israel was Sunni Muslim (with a very small minority of Shia), another 9 percent was Druze, and around 9 percent was Christian (mostly Eastern Orthodox and Catholic denominations).\n\nBedouin\n\nThe Arab Muslim citizens of Israel include also the Bedouins, who are divided into two main groups: the Bedouin in the north of Israel, who live in villages and towns for the most part, and the Bedouin in the Negev, who include half-nomadic and inhabitants of towns and Unrecognized villages. According to the Israeli Ministry of Foreign Affairs, as of 1999, 110,000 Bedouins live in the Negev, 50,000 in the Galilee and 10,000 in the central region of Israel. The vast majority of Arab Bedouins of Israel practice Sunni Islam.\n\nAhmadiyya\n\nThe Ahmadiyya community was first established in the region in the 1920s, in what was then Mandatory Palestine. Israel is the only country in the Middle East, where Ahmadi Muslims can openly practice their faith, which is not recognized as part of Islam by most Sunni and Shi'a denominations. As such, Kababir, a neighbourhood on Mount Carmel in Haifa, Israel, acts as the Middle East headquarters of the Community. It is unknown how many Israeli Ahmadis there are, although it is estimated there are about 2,200 Ahmadis in Kababir alone.\n\nArab Christians\n\nThere is a significant Arab Christian minority from various denominations, numbering 122,000 — a majority of Christians in Israel.\n\nCopts\n\nSome 1,000 Israeli citizens belong to the Coptic community, originated in Egypt.\n\nDruze\n\nThe Arab citizens of Israel include also the Druze who were numbered at an estimated 129,800 at the end of 2011. All of the Druze living in what was then British Mandate Palestine became Israeli citizens after the declaration of the State of Israel. Though a few individuals identify themselves as \"Palestinian Druze\", the vast majority of Druze do not consider themselves to be 'Palestinian', and consider their Israeli identity stronger than their Arab identity. Druze serve prominently in the Israel Defense Forces, and are represented in mainstream Israeli politics and business as well, unlike Muslim Arabs who are not required to and generally choose not to serve in the Israeli army.\n\nSyriac Christians\n\nArameans\n\nIn 2014, Israel has decided to recognize the Aramaic community within its borders as a national minority, allowing some of the Christians in Israel to be registered as \"Aramean\" instead of \"Arab\".[http://www.israelnationalnews.com/News/Flash.aspx/304458] As of October 2014, some 600 Israelis requested to be registered as Arameans, with several thousand eligible for the status - mostly members of the Maronite community.\n\nThe Maronite Christian community in Israel of around 7,000 resides mostly in the Galilee, with a presence in Haifa, Nazareth and Jerusalem. It is largely composed of families that lived in Upper Galilee in villages such as Jish long before the establishment of Israel in 1948. In the year 2000, the community was joined by a group of Lebanese SLA militia members and their families, who fled Lebanon after 2000 withdrawal of IDF from South Lebanon.\n\nAssyrians\n\nThere are around 1,000 Assyrians living in Israel, mostly in Jerusalem and Nazareth. Assyrians are an Aramaic speaking, Eastern Rite Christian minority who are descended from the ancient Mesopotamians. The old Syriac Orthodox monastery of Saint Mark lies in Jerusalem. Other than followers of the Syriac Orthodox Church, there are also followers of the Assyrian Church of the East and the Chaldean Catholic Church living in Israel.\n\nOther citizens\n\nSamaritans\n\nThe Samaritans are an ethnoreligious group of the Levant. Ancestrally, they claim descent from a group of Israelite inhabitants who have connections to ancient Samaria from the beginning of the Babylonian Exile up to the beginning of the Common Era. 2007 population estimates show that 712 Samaritans live half in Holon, Israel and half at Mount Gerizim in the West Bank. The Holon community holds Israeli citizenship, while the Gerizim community resides at an Israeli controlled enclave, holding dual Israeli-Palestinian citizenship.\n\nArmenians\n\nAbout 4,000 Armenians reside in Israel mostly in Jerusalem (including in the Armenian Quarter), but also in Tel Aviv, Haifa and Jaffa. Armenians have a Patriarchate in Jerusalem and churches in Jerusalem, Haifa and Jaffa. Although Armenians of Old Jerusalem have Israeli identity cards, they are officially holders of Jordanian passports.Joyce M. Davis. [http://www.cnewa.org/default.aspx?ID548&pagetypeID\n4&sitecodeHQ&pageno\n3 Jerusalem’s Armenian Quarter]. Catholic Near East Welfare Association.\n\nCircassians\n\nIn Israel, there are also a few thousand Circassians, living mostly in Kfar Kama (2,000) and Reyhaniye (1,000). These two villages were a part of a greater group of Circassian villages around the Golan Heights. The Circassians in Israel enjoy, like Druzes, a status aparte. Male Circassians (at their leader's request) are mandated for military service, while females are not.\n\nPeople from post-Soviet states\n\nEthnic Russians, Ukrainians, and Belorussians, immigrants from the former Soviet Union, who were eligible to emigrate due to having, or being married to somebody who has, at least one Jewish grandparent and thus qualified for Israeli citizenship under the revised Law of Return. A number of these immigrants also belong to various ethnic groups from the Former Soviet Union such as Armenians, Georgians, Azeris, Uzbeks, Moldovans, Tatars, among others. Some of them, having Jewish father or grandfather identify as Jews, but being non-Jewish by Halakha (Jewish religion law), they are not recognized formally as Jews by state. Most of them are in the mainstream of Israel culture and are called \"expanded Jewish population\". In addition, a certain number of former Soviet citizens, primarily women of Russian and Ukrainian ethnicity, emigrated to Israel, after marrying Muslim or Christian Arab citizens of Israel, who went to study in the former Soviet Union in the 1970s and 1980s.\n\nFinns\n\nAlthough most people of Finnish origin in Israel are Finnish Jews who immigrated to Israel, and their descendants, a small number of Finnish Christians moved to Israel in the 1940s before the independence and gained citizenship following independence. For the most part, many of the original Finnish settlers intermarried with the other communities in the country, and therefore remain very small in number. A Moshav shitufi near Jerusalem named Yad HaShmona, meaning the \"Memorial for the Eight\", was established in 1971 by a group of Finnish Christian-Israelis, although today, most members are Israeli, and are predominantly Hebrew speakers, and the moshav has become a center of so-called \"Messianic Jews\".\n\nBaha'is\n\nThe Baha'i population in Israel can be divided into several groups. The most senior group of Israeli Baha'is consists of those who are employed or have some other role in the pilgrimage sites. These Baha'is number between six hundred to seven hundred and primarily reside in either Acre or Haifa.Nechemia Meyers (1995). \"Peace to all nations - Baha'is Establish Israel's Second Holy Mountain\". The World & I. Retrieved Mar 5, 2015Donald H. Harrison (April 3, 1998). \"The Fourth Faith\". Jewish Sightseeing (Haifa, Israel). Retrieved Mar 5, 2015 A fluctuating segment of Baha'is consists of pilgrims.World Religions in America: An Introduction - Page 264, Jacob Neusner - 2003 The number of self-identified Baha'i Israeli citizens has been estimated at 14,000 in 2000.David B. Barrett, World Christian Encyclopedia (2001)Global Institutions of Religion, page 88, Katherine Marshall - 2013\n\nVietnamese\n\nThe number of Vietnamese people in Israel and their descendants is estimated at 150 to 200.[http://www.timesofisrael.com/35-years-on-where-are-israels-vietnamese-refugees/] Most of them came to Israel in between 1976–1979, after prime minister Menachem Begin authorized their admission to Israel and granted them political asylum. The Vietnamese people living in Israel are Israeli citizens who also serve in the Israel Defense Forces. Today, the majority of the community lives in the Gush Dan area in the center of Tel Aviv, but also a few dozen Vietnamese-Israelis or Israelis of Vietnamese origin live in Haifa, Jerusalem, and Ofakim.\n\nAfrican Hebrew Israelites of Jerusalem\n\nThe African Hebrew Israelite Nation of Jerusalem is a small spiritual group of African Americans, whose members believe they are descended from the Ten Lost Tribes of Israel. With a population of over 5,000, most members live in their own community in Dimona, Israel, with additional families in Arad, Mitzpe Ramon, and the Tiberias area. At least some of them consider themselves to be Jewish, but mainstream scholarship does not consider them to be of Israelite but of subsaharan African origin. Their ancestors were African Americans who after several years in Liberia migrated to Israel in the late 1960s and demanded that Israel give them citizenship in the state. When Israel refused, they relinquished their United States citizenship and de facto became stateless. After some deliberation, the Israeli government granted them citizenship. The African Hebrew Israelites, like the Haredim and most Israeli Arabs, are not required to serve in the military; however, some do so, and they do receive social benefits from the state, including free health care. Most believe in a kind of Paleo-Judaism based on the Torah without the Oral Laws; however, at least one member of the community underwent a conversion to Orthodox Judaism.\n\nNaturalized foreign workers\n\nSome naturalized foreign workers and their children born in Israel, predominantly from the Philippines, Nepal, Nigeria, Senegal, Romania, China, Cyprus, Turkey, Thailand, and South America (mainly Colombia).\n\nNon-citizens\n\nAfrican migrants\n\nThe number and status of African refugees in Israel is disputed and controversial, but it is estimated that at least 70,000 refugees mainly from Eritrea, Sudan, South Sudan, Ethiopia, and the Ivory Coast reside and work in Israel. A count in late 2011 published in Ynet pointed out the number only in Tel Aviv is 40,000, which represents 10 percent of the city's population. The vast majority is living at the southern parts of the city. There is a significant population in the southern Israeli cities of Eilat, Arad, and Beersheba.\n\nForeign workers\n\nThere are around 300,000 foreign workers, residing in Israel under temporary work visas, including Palestinians. Most of those foreign workers engage in agriculture and construction. The main groups of those foreign workers include the Chinese, Thai, Filipinos, Nigerians, Romanians, and Latin Americans.\n\nOther refugees\n\nApproximately 100–200 refugees from Bosnia, Kosovo, Iraqi Kurdistan, and North Korea were absorbed in Israel as refugees. Most of them were also given Israeli resident status, and currently reside in Israel.[https://www.independent.co.uk/news/world/middle-east/israel-taking-in-aleppo-refugees-syria-war-assad-regime-evacuation-a7489116.html] As of 2006, some 200 ethnic Kurdish refugees from Turkey resided in Israel as illegal immigrants, fleeing the Turkey-PKK conflict. [http://news.walla.co.il/item/967428]\n\nLanguages\n\nDue to its immigrant nature, Israel is one of the most multicultural and multilingual societies in the world. Hebrew and Arabic are the official languages in the country, while English and Russian are the two most widely spoken non-official languages. A certain degree of English is spoken widely, and is the language of choice for many Israeli businesses. Courses of Hebrew and English language are mandatory in the Israeli school system, and most schools offer either Arabic, French, Spanish, German, Italian, or Russian.\n\nReligion\n\nAccording to a 2010 Israel Central Bureau of Statistics study of Israelis aged over 18, 8% of Israeli Jews define themselves as Haredim (or ultra-Orthodox); an additional 12% are \"religious\" (non-Haredi Orthodox, also known as: dati leumi/national-religious or religious Zionist); 13% consider themselves \"religious-traditionalists\" (mostly adhering to Jewish Halakha); 25% are \"non-religious traditionalists\" (only partly respecting the Jewish Halakha), and 43% are \"secular\". Among the seculars, 53% say they believe in God. Due to the higher birth rate of religious and traditionalists over seculars, their share among the overall population is growing as time passes.\n\nWhile the ultra-Orthodox, or Haredim, represented only 5% of Israel's population in 1990, they are expected to represent more than one-fifth of Israel's Jewish population by 2028.\n\nEducation\n\nEducation between ages 5 and 15 is compulsory. It is not free, but it is subsidized by the government, individual organizations (such as the Beit Yaakov System), or a combination. Parents are expected to participate in courses as well. The school system is organized into kindergartens, 6-year primary schools, and either 6-year secondary schools or 3-year junior secondary schools + 3-year senior secondary schools (depending on region), after which a comprehensive examination is offered for university admissions.\n\nPolicy\n\nAs Israel's continued existence as a Jewish state relies upon maintenance of a Jewish demographic majority, Israeli demographers, politicians, and bureaucrats have treated Jewish population growth promotion as a central question in their research and policymaking. Non-Jewish population growth and immigration is regarded as a threat to the Jewish demographic majority, and to Israel's security, as detailed in the Koenig Memorandum.\n\nIsrael is the thirty-fourth most-densely crowded country in the world. In an academic article, Jewish National Fund Board member Daniel Orenstein, argues that, as elsewhere, overpopulation is a stressor on the environment in Israel; he shows that environmentalists have conspicuously failed to consider the impact of population on the environment, and argues that overpopulation in Israel has not been appropriately addressed for ideological reasons.Daniel Orenstein and Steven Hamburg.[http://www.watsoninstitute.org/news_detail.cfm?id=383 \"The JNF's Assault on the Negev\"]; The Jerusalem Report, 28 November 2005\n\nCitizenship and Entry Law\n\nThe Citizenship and Entry into Israel Law (Temporary Order) 5763 was first passed on 31 July 2003, and has since been extended until 31 July 2008. The law places age restrictions for the automatic granting of Israeli citizenship and residency permits to spouses of Israeli citizens, such that spouses who are inhabitants of the West Bank and Gaza Strip are ineligible. On 8 May 2005, the Israeli ministerial committee for issues of legislation once again amended the Citizenship and Entry into Israel Law, to restrict citizenship and residence in Israel only to Palestinian men over the age of 35, and Palestinian women over the age of 25. Those in favor of the law say the law not only limits the possibility of the entrance of terrorists into Israel, but, as Ze'ev Boim asserts, allows Israel \"to maintain the state's democratic nature, but also its Jewish nature\" (i. e., its Jewish demographic majority). Critics, including the United Nations Committee on the Elimination of Racial Discrimination, say the law disproportionately affects Arab citizens of Israel, since Arabs in Israel are far more likely to have spouses from the West Bank and Gaza Strip than other Israeli citizens.\n\nIn the constitutional challenges to the Citizenship and Entry to Israel Law, the state, represented by the Attorney General, insisted that security was the only objective behind the law. The state also added that even if the law was intended to achieve demographic objectives, it is still in conformity with Israel's Jewish and democratic definition, and thus constitutional. In a 2012 ruling by the Supreme Court on the issue, some of the judges on the panel discussed demography, and were inclined to accept that demography is a legitimate consideration in devising family reunification policies that violate the right to family life.Mazen Masri, \"Love Suspended: Demography, Comparative Law and Palestinian Couples in the Israeli Supreme Court\", Social & Legal Studies (2013) 22(3) 309-334. Available at SSRN: http://ssrn.com/abstract=2330291\n\nSoviet immigration\n\nDuring the 1970s about 163,000 people of Jewish descent immigrated to Israel from the USSR.\n\nLater Ariel Sharon, in his capacity as Minister of Housing & Construction and member of the Ministerial Committee for Immigration & Absorption, launched an unprecedented large-scale construction effort to accommodate the new Russian population in Israel so as to facilitate their smooth integration and encourage further Jewish immigration as an ongoing means of increasing the Jewish population of Israel. Between 1989 and 2006, about 979,000 Jews emigrated from the former Soviet Union to Israel.\n\nStatistics\n\nTotal population\n\n* 8,793,000\n\nNote: includes over 200,000 Israelis and 250,000 Arabs in East Jerusalem, about 421,400 Jewish settlers on the West Bank (Judea and Samaria), and about 42,000 in the Golan Heights (July 2007 est.). Does not include Arab populations in the West Bank and Gaza Strip. Does not include 222,000 foreigners living in the country.[http://cbs.gov.il/reader/newhodaot/hodaa_template.html?hodaa=200914192 הודעות לעיתונות]. Cbs.gov.il. Retrieved on 8 September 2011.\n\nAge structure\n\nTotal:\n* 0–14 years: 28.0%\n* 15–64 years: 62.1%\n* 65 years and over: 9.9%\n\nJews:\n* 0–14 years: 25.5%\n* 15–64 years: 63.1%\n* 65 years and over: 11.4%\n\nArab:\n* 0–14 years: 37.5%\n* 15–64 years: 58.6%\n* 65 years and over: 3.9% (2010 est.)\n\nMedian age\n\n* Total: 29.7\n* Jewish: 31.6\n* Arab: 21.1\n\nThe Jewish median age in Jerusalem district and the West Bank are 24.9 and 19.7, respectively, and both account for 16% of the Jewish population, but 24% of 0–4 year olds. The lowest median age in Israel, and one of the lowest in the world, is found in two of the West Bank's biggest Jewish cities: Modiin Ilit (11), Beitar Ilit (11) followed by Bedouin towns in the Negev (15.2).\n\nPopulation growth rate\n\n* 2.0% (2016)\n\nDuring the 1990s, the Jewish population growth rate was about 3% per year, as a result of massive immigration to Israel, primarily from the republics of the former Soviet Union. There is also a very high population growth rate among certain Jewish groups, especially adherents of Orthodox Judaism. The growth rate of the Arab population in Israel is 2.2%, while the growth rate of the Jewish population in Israel is 1.7%. The growth rate of the Arab population has slowed from 3.8% in 1999 to 2.2% in 2013, and for the Jewish population, the growth rate declined from 2.7% to its lowest rate of 1.4% in 2005, before picking up since then to 1.7%.\n\nBirth rate\n\nIV/2016-III/2017\n\n* Total: 21.3 births/1,000 population \n* Jews and others: 20.5 births/1,000 population\n* Muslims: 24.6 births/1,000 population\n* Christians: 14.4 births/1,000 population\n* Druze: 17.3 births/1,000 population\n\nBirths, in absolute numbers, by mother's religionhttp://www.cbs.gov.il/publications18/yarhon1217/pdf/c1.pdfhttp://www.cbs.gov.il/reader/cw_usr_view_SHTML?ID=964\n\nCurrent natural population growth\n\n*Births from January–November 2016 = Jewish: 122,476; Muslim: 34,529; Christian: 2,398; Druze: 2,276; Others: 4,044; Total: 165,723\n*Births from January–November 2017 = Jewish: 122,393; Muslim: 34,977; Christian: 2,260; Druze: 2,156; Others: 3,890; Total: 165,676\n\nBetween the mid-1980s and 2000, the fertility rate in the Muslim sector was stable at 4.6–4.7 children per woman; after 2001, a gradual decline became evident, reaching 3.51 children per woman in 2011. By point of comparison, in 2011, there was a rising fertility rate of 2.98 children among the Jewish population.\n\nBirths and deaths http://unstats.un.org/unsd/demographic/products/dyb/dyb2.htm\n\nStructure of the population  \n\nStructure of the population (01.07.2012) (Estimates) :\n\nDeath rate\n\n* 5.3 deaths/1,000 population (2015 est.)\n\nThere were a total of 38,666 deaths in 2006. (39,026 in 2005 & 37,688 in 2000). Of this 33,568 were Jews (34,031 in 2005 & 33,421 in 2000). 3,078 were Muslims (2,968 in 2005 & 2,683 in 2000). 360 were Druze (363 in 2005 & 305 in 2000). 712 were Christian (686 in 2005 & 666 in 2000).\n\nNet migration rate\n\n* 1.81 migrant(s)/1,000 population (2013 est.)\n\nThere were a total of 26,500 immigrants who made Aliyah to Israel in 2014: 11,430 from the Former Soviet Union, 7,000 from France, 3,470 from the United States, 620 from the United Kingdom, 620 from Colombia, 400 from Canada, 340 from Italy, 300 from Brazil, 297 from Argentina, 240 from Belgium, 232 from Eastern Europe (including 126 from Hungary), 200 from Australia and New Zealand, 190 from South Africa, 120 from Germany, 76 from Mexico, 70 from Venezuela, 58 from Uruguay, and 52 from Chile.\n\nEmigration\n\nFor many years definitive data on Israeli emigration was unavailable.Henry Kamm. \"Israeli emigration inspires anger and fear;\" New York Times 4 January 1981 In The Israeli Diaspora sociologist Stephen J. Gold maintains that calculation of Jewish emigration has been a contentious issue, explaining, \"Since Zionism, the philosophy that underlies the existence of the Jewish state, calls for return home of the world's Jews, the opposite movement—Israelis leaving the Jewish state to reside elsewhere—clearly presents an ideological and demographic problem.\"Stephen J. Gold. The Israeli Diaspora; Routledge 2002, p.8\n\nIn the past several decades, emigration (yerida) has seen a considerable increase. From 1990 to 2005, 230,000 Israelis left the country; a large proportion of these departures included people who initially immigrated to Israel and then reversed their course (48% of all post-1990 departures and even 60% of 2003 and 2004 departures were former immigrants to Israel). 8% of Jewish immigrants in the post-1990 period left Israel, while 15% of non-Jewish immigrants did. In 2005 alone, 21,500 Israelis left the country and had not yet returned at the end of 2006; among them 73% were Jews, 5% Arabs, and 22% \"Others\" (mostly non-Jewish immigrants, with Jewish ancestry, from USSR). At the same time, 10,500 Israelis came back to Israel after over one year abroad; 84% were Jews, 9% Others, and 7% Arabs.[http://cbs.gov.il/reader/newhodaot/hodaa_template.html?hodaa=200701153 ICBS 2005 departures and returns]. Cbs.gov.il. Retrieved on 8 September 2011.\n\nAccording to the Israel Central Bureau of Statistics, as of 2005, 650,000 Israelis had left the country for over one year and not returned. Of them, 530,000 are still alive today. This number does not include the children born overseas. It should also be noted that Israeli law grants citizenship only to the first generation of children born to Israeli emigrants.\n\nDensity\n\nGeographic deployment:\n* Central District: 24% (1,649,800)\n* Tel Aviv District: 17% (1,190,000)\n* Northern District: 17% (1,185,400)\n* Southern District: 14% (1,002,400)\n* Haifa District: 12% (858,000)\n* Jerusalem District: 12% (851,400)\n* Judea and Samaria Area (Israelis only): 5.1% (407,100) (2015)\n\nSex ratio\n\n* At birth: 1.05 male(s)/female\n* Under 15 years: 1.05 male(s)/female\n* 15–64 years: 1.03 male(s)/female\n* 65 years and over: 0.78 male(s)/female\n* Total population: 1.01 male(s)/female (2011 est.)\n\nMaternal mortality rate\n\n* 7 deaths/100,000 live births (2010)\n\nInfant mortality rate\n\n* Total: 4.03 deaths/1,000 live births\n* Male: 4.20 deaths/1,000 live births\n* Female: 3.84 deaths/1,000 live births (2013 est.)\n\nLife expectancy at birth\n\n* Total population: 81.17 years\n* Male: 79.7 years\n* Female: 83.6 years (2011)\n\nBetween 1990 and 2011, life expectancy at birth increased by 5 years for women (both Jews and Arabs), 5.4 years for Jewish men, and 3.2 years for Arab men.\n\nTotal fertility rate\n\n* 3.13 children born/woman (2016)\n\nJewish total fertility rate increased by 10.2% during 1998–2009, and was recorded at 2.90 during 2009. During the same time period, Arab TFR decreased by 20.5%. Muslim TFR was measured at 3.73 for 2009. During 2000, the Arab TFR in Jerusalem (4.43) was higher than that of the Jews residing there (3.79). But as of 2009, Jewish TFR in Jerusalem was measured higher than the Arab TFR (2010: 4.26 vs 3.85, 2009: 4.16 vs 3.87). TFR for Arab residents in the West Bank was measured at 2.91 in 2013, while that for the Jewish residents was reported at 5.10 children per woman.\n\nThe ethnic group with highest recorded TFR is the Bedouin of Negev. Their TFR was reported at 10.06 in 1998, and 5.73 in 2009. TFR is also very high among Haredi Jews. For Ashkenazi Haredim, the TFR rose from 6.91 in 1980 to 8.51 in 1996. The figure for 2008 is estimated to be even higher. TFR for Sephardi/Mizrahi Haredim rose from 4.57 in 1980 to 6.57 in 1996.\n\nHealth expenditures\n\n* 7.6% of total GDP (2010)\n\nPhysicians density\n\n* 3.63 physicians/1,000 population (2007)\n\nHospital bed density\n\n* 3.5 beds/1,000 population (2010)\n\nHIV/AIDS – adult prevalence rate\n\n* 0.2% (2009 est.)\n\nObesity – adult prevalence rate\n\n* 26% of women and 40% of men are overweight. In both genders, obesity rate is 15% (as of 2011).[http://www1.cbs.gov.il/www/statistical/mw2013_e.pdf Statistilite 133 - Women & Men in Israel - 1990-2011] , on cbs.gov.il\n\nEducation expenditures\n\n* 5.9% of total GDP (2009)\n\nLiteracy\n\nAge 15 and over can read and write (2011 estimate):\n* Total population: 97.8%\n* Male: 98.7%\n* Female: 96.8%\n\nFuture projections\n\nIn June 2013, the Central Bureau of Statistics released a demographic report, projecting that Israel's population would grow to 11.4 million by 2035, with the Jewish population numbering 8.3 million, or 73% of the population, and the Arab population at 2.6 million, or 23%. This includes some 2.3 million Muslims (20% of the population), 185,000 Druze, and 152,000 Christians. The report predicts that the Israeli population growth rate will decline to 1.4% annually, with growth in the Muslim population remaining higher than the Jewish population until 2035, at which point the Jewish population will begin growing the fastest.[http://www.haaretz.com/news/national/peering-into-the-crystal-ball-how-israel-will-look-statistically-in-2035.premium-1.532152 Peering into the crystal ball: How Israel will look, statistically, in 2035] – Haaretz\n\nIn 2017, the Central Bureau of Statistics projected that Israel's population would rise to about 18 million by 2059, including 14.4 million Jews and 3.6 million Arabs. Of the Jewish population, about 5.25 million would be ultra-Orthodox Jews. Overall, the forecast projected that 49% of the population would be either ultra-Orthodox Jews (29%) and Arabs (20%).http://www.timesofisrael.com/half-of-israel-to-be-arab-ultra-orthodox-by-2059-projections/ It also projected a population of 20 million in 2065.http://www.jpost.com/Israel-News/Report-Israels-population-to-reach-20-million-by-2065-492429\n\nOther forecasts project that Israel could have a population as high as 23 million, or even 36 million, by 2050.http://www.haaretz.com/israel-news/1.783515. Demographics of Israel. http://en.wikipedia.org/?curid=14688."
  }
}
