{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13967",
  "eid" : "10807330-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778536931,
  "textBody" : "Habakkuk ( or; ; also spelled Habacuc) was a prophet in the Hebrew Bible. He is the author of the Book of Habakkuk, the eighth of the collected twelve minor prophets.\n\nLife\n\nAlmost nothing is known about Habakkuk, aside from what few facts are stated within the book of the Bible bearing his name, or those inferences that may be drawn from that book. His name appears in the Bible only in Habakkuk 1:1 and 3:1, with no biographical details provided other than his title \"the prophet.\" Even the origin of his name is uncertain.\n\nFor almost every other prophet, more information is given, such as the name of the prophet's hometown, his occupation, or information concerning his parentage or tribe. For Habakkuk, however, there is no reliable account of any of these. Although his home is not identified, scholars conclude that Habakkuk lived in Jerusalem at the time he wrote his prophecy. Further analysis has provided an approximate date for his prophecy and possibilities concerning his activities and background.\n\nBeyond the Bible, considerable conjecture has been put forward over the centuries in the form of Christian and Rabbinic tradition, but such accounts are dismissed by modern scholars as speculative and apocryphal.\n\nBiblical account\n\nBecause the book of Habakkuk consists of five oracles about the Chaldeans (Babylonians), and the Chaldean rise to power is dated circa 612 BC, it is assumed he was active about that time, making him an early contemporary of Jeremiah and Zephaniah. Jewish sources, however, do not group him with those two prophets, who are often placed together, so it is possible that he was slightly earlier than the pair.\n\nBecause the final chapter of his book is a song, it is sometimes assumed that he was a member of the tribe of Levi, which served as musicians in Solomon's Temple.\n\nName\n\nThe name Habakkuk, or Habacuc, appears in the Hebrew Bible only in Habakkuk 1:1 and 3:1. In the Masoretic Text, it is written in  (Standard Ḥavaqquq Tiberian Ḥăḇaqqûq). This name does not occur elsewhere. The Septuagint transcribes his name into Greek as  (Ambakoum), and the Vulgate transcribes it into Latin as Abacuc.\n\nThe etymology of the name is not clear, and its form has no parallel in Hebrew. The name is possibly related to the Akkadian khabbaququ, the name of a fragrant plant, or the Hebrew root , meaning \"embrace\".\n\nTradition\n\nHabakkuk appears in Bel and the Dragon, which is part of the deuterocanonical Additions to Daniel. Verses 33–39 state that Habakkuk is in Judea and after making some stew, he's told by the angel of the Lord to take the stew to Daniel, who is in Babylon in the lion's den. After proclaiming he is unaware of both the den and Babylon, the angel transports Habakkuk to the lion's den. Habakkuk gives Daniel the food to sustain him, and is immediately taken back to \"his own place\".\n\nHabakkuk is also mentioned in Lives of the Prophets, which also notes his time in Babylon.\n\nAccording to the Zohar (Volume 1, page 8b) Habakkuk is the boy born to the Shunamite woman through Elisha's blessing:\n\n() And he said, About this season, according to the time of life, thou shalt embrace ( – hoveket, therefore Habakkuk) a son. And she said, Nay, my lord, [thou] man of God, do not lie unto thine handmaid.\n\nWorks\n\nThe only work attributed to Habakkuk is the short book of the Bible that bears his name. The book of Habbakuk consists of five oracles about the Chaldeans (Babylonians) and a song of praise to God.\n\nThe style of the book has been praised by many scholars, suggesting that its author was a man of great literary talent.  The entire book follows the structure of a chiasmus in which parallelism of thought is used to bracket sections of the text.\n\nHabakkuk is unusual among the prophets in that he openly questions the working of God (1:3a, 1:13b). In the first part of the first chapter, the Prophet sees the injustice among his people and asks why God does not take action: \"1:2 Yahweh, how long will I cry, and you will not hear? I cry out to you 'Violence!' and will you not save?\" (World English Bible).\n\nTombs\n\nThe final resting place of Habakkuk has been claimed at multiple locations. The fifth-century Christian historian Sozomen claimed that the relics of Habakkuk were found at Cela, when God revealed their location to Zebennus, bishop of Eleutheropolis, in a dream.  Currently, one location in Israel and one in Iran lay claim to being the burial site of the prophet.\n\nTomb in Israel\n\nThe burial place of Habakkuk is identified by Jewish tradition as a hillside in the Upper Galilee region of northern Israel, close to the villages Kadarim and Hukok, about six miles southwest of Safed and twelve miles north of Mount Tabor. A small stone building, erected during the 20th century, protects the tomb. Tradition dating as early as the 12th century AD holds that Habakkuk's tomb is at this location, but the tomb may also be of a local sheikh of Yaquq, a name related to the biblical place named \"Hukkok\" (mentioned in ), whose pronunciation and spelling in Hebrew are close to \"Habakkuk\". Archaeological findings in this location include several burial places dated to the Second Temple period.\n\nPersian shrine\n\nA mausoleum southeast of the city of Tuyserkan in the west of Iran is also believed to be Habakkuk's burial place. It is protected by Iran's Cultural Heritage, Handcrafts and Tourism Organization. The Organization's guide to the Hamadan Province states that Habakkuk was believed to be a guardian to Solomon's Temple, and that he was captured by the Babylonians and remained in their prison for some years. After being freed by Cyrus the Great, he went to Ecbatana and remained there until he died, and was buried somewhere nearby, in what is today Tuyserkan. Habakkuk is called both Habaghugh and Hayaghugh by the Muslim locals.\n\nThe surrounding shrine may date to the period of the Seljuq Empire (11–12th century); it consists of an octagonal wall and conical dome. Underneath the shrine is a hidden basement with three floors. In the center of the shrine's courtyard is the grave where Habakkuk is said to be buried. A stone upon the grave is inscribed in both Hebrew and Persian stating that the prophet's father was Shioua Lovit, and his mother was Lesho Namit. Both Muslims and Jews visit it to pay their respects.\n\nChristian commemoration\n\nOn the Eastern Orthodox liturgical calendar, his feast day is December 2. In the Roman Catholic Church, the twelve minor prophets are read in the Roman Breviary during the fourth and fifth weeks of November, which are the last two weeks of the liturgical year, and his feast day is January 15. This day is also celebrated as his feast by the Greek Orthodox Church. In 2011, he was commemorated with the other Minor Prophets in the calendar of saints of the Armenian Apostolic Church on February 8.\n\nHabakkuk has also been commemorated in sculpture. In 1435, the Florentine artist Donatello created a sculpture of the prophet for the bell tower of Florence. This statue, nicknamed Zuccone (\"Big Pumpkin\") because of the shape of the head, now resides in the Museo dell'Opera del Duomo. The Basilica of Santa Maria del Popolo in Rome contains a Baroque sculpture of Habakkuk by the 17th-century artist Bernini. Between 1800 and 1805, the Brazilian sculptor Aleijadinho completed a soapstone sculpture of Habakkuk as part of his Twelve Prophets. The figures are arranged around the forecourt and monumental stairway in front of the Santuário do Bom Jesus do Matosinhos at Congonhas.\n\nIslam\n\nAlthough the Quran only mentions around twenty-five prophets by name, and alludes to a few others, it has been a cardinal doctrine of Islam that many more prophets were sent by God who are not mentioned in the scripture.Cf. Qur'an 16:36 Thus, Muslims have traditionally had no problem accepting those other Hebrew prophets not mentioned in the Quran or hadith as legitimate prophets of God, especially as the Quran itself states: \"Surely We sent down the Torah (to Moses), wherein is guidance and light; thereby the Prophets (who followed him), who had surrendered themselves, gave judgment for those who were Jewish, as did the masters and the rabbis, following such portion of God's Book as they were given to keep and were witnesses to,\"Qur'an 5:44, cf. Arberry translation. with this passage having often been interpreted by Muslims to include within the phrase \"prophets\" an allusion to all the prophetic figures of the Jewish scriptural portion of the nevi'im, that is to say all the prophets of Israel after Moses and Aaron. Thus, Islamic authors have often alluded to Habakkuk as a prophet in their works,Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVII-XLVIIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), pp. 269-270Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 381, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, pp. 389-390See Walid Saleh (tr. and intro.), In Defense of the Bible: A Critical Edition and an Introduction to Al-Biqai's Bible Treatise (Islamic History and Civilization: Studies and Texts) (Leiden: Brill, 2008), et passim and followed the pronunciation of his name with the traditional salutations of peace bestowed by Muslims onto prophets after the utterance of their names.Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 381, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, pp. 389-390\n\nSome medieval Muslim scholars even provided commentaries on the biblical Book of Habakkuk, with the primary purpose of showing that the prophet had predicted the coming of Muhammad in Habakkuk 3:2–6, in a manner akin to the earlier Christian tradition of seeing in the book's prophecies allusions to the advent of Christ.Lejla Demiri, Muslim Exegesis of the Bible in Medieval Cairo (Leiden: Brill, 2013), p. 47 For example, the medieval exegete Najm al-Dīn al-Ṭūfī (d. 716 AH/1316 CE) provided a commentary on select verses from the book of Habakkuk, saying the prophet's words \"for his rays become light\" (Habakkuk 3:4) alluded to the spread of Islam;Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 381, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391 that his words \"his glory comes to town, his power appears in his courts\" (Habakkuk 3:4) referred to Muhammad's stay in the town of Yathrib and the help he received there from the ansar;Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 382, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391 and that his words \"death goes before him\" (Habakkuk 3:5) was a prophecy about the fear of the Muslim armies during the military campaigns of Muhammad and his companions.Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 383, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391 Likewise, Habakkuk 3:5–6 also received similar commentaries from medieval Islamic thinkers.Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 383, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391\n\nThe famous and revered Persian Islamic scholar and polymath Ibn Qutaybah, who served as a judge during the Abbasid Caliphate, said of the prophet Habakkuk: \"Among the words of Habakkuk, who prophesied in the days of Daniel, Habakkuk says: 'God came from Teman, and the holy one from the mountains of Paran and the earth was filled with the sanctification of the praiseworthy one (aḥmad, which is a name of Muhammad in Islam), and with his right hand he exercised power over the earth and the necks of the nations,'\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVII-XLVIIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 which has been interpreted by scholars to be a clear allusion to Habakkuk 3:3-4.Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 Elsewhere, the same scholar glossed Habakkuk 3:4, 15 as follows: \"The earth shines with his light, and his horses launched into the sea,\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 again interpreting the prophecy to be an allusion to the coming of Muhammad.Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 264 One further prophecy of Habakkuk which Ibn Qutaybah cited, from extra-canonical Hebraic literature, was \"You shall be exceedingly filled in your bows ... o Praised One (muḥammad),\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 which he read as being \"a clear statement of ... [Muhammad's] name ... [and] his characteristics.\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 This final prophecy attributed to Habakkuk was also referred to by later scholars like Ibn al-Jawzi and Ibn Qayyim al-Jawziyyah.Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269, note 4A. Mingana (tr.) of Ali Tabari's The Book of Religion and Empire (London: Bernard Quaritch Limited, 1922), p. 119.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Habakkuk" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13967" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Habakkuk ( or; ; also spelled Habacuc) was a prophet in the Hebrew Bible. He is the author of the Book of Habakkuk, the eighth of the collected twelve minor prophets.\n\nLife\n\nAlmost nothing is known about Habakkuk, aside from what few facts are stated within the book of the Bible bearing his name, or those inferences that may be drawn from that book. His name appears in the Bible only in Habakkuk 1:1 and 3:1, with no biographical details provided other than his title \"the prophet.\" Even the origin of his name is uncertain.\n\nFor almost every other prophet, more information is given, such as the name of the prophet's hometown, his occupation, or information concerning his parentage or tribe. For Habakkuk, however, there is no reliable account of any of these. Although his home is not identified, scholars conclude that Habakkuk lived in Jerusalem at the time he wrote his prophecy. Further analysis has provided an approximate date for his prophecy and possibilities concerning his activities and background.\n\nBeyond the Bible, considerable conjecture has been put forward over the centuries in the form of Christian and Rabbinic tradition, but such accounts are dismissed by modern scholars as speculative and apocryphal.\n\nBiblical account\n\nBecause the book of Habakkuk consists of five oracles about the Chaldeans (Babylonians), and the Chaldean rise to power is dated circa 612 BC, it is assumed he was active about that time, making him an early contemporary of Jeremiah and Zephaniah. Jewish sources, however, do not group him with those two prophets, who are often placed together, so it is possible that he was slightly earlier than the pair.\n\nBecause the final chapter of his book is a song, it is sometimes assumed that he was a member of the tribe of Levi, which served as musicians in Solomon's Temple.\n\nName\n\nThe name Habakkuk, or Habacuc, appears in the Hebrew Bible only in Habakkuk 1:1 and 3:1. In the Masoretic Text, it is written in  (Standard Ḥavaqquq Tiberian Ḥăḇaqqûq). This name does not occur elsewhere. The Septuagint transcribes his name into Greek as  (Ambakoum), and the Vulgate transcribes it into Latin as Abacuc.\n\nThe etymology of the name is not clear, and its form has no parallel in Hebrew. The name is possibly related to the Akkadian khabbaququ, the name of a fragrant plant, or the Hebrew root , meaning \"embrace\".\n\nTradition\n\nHabakkuk appears in Bel and the Dragon, which is part of the deuterocanonical Additions to Daniel. Verses 33–39 state that Habakkuk is in Judea and after making some stew, he's told by the angel of the Lord to take the stew to Daniel, who is in Babylon in the lion's den. After proclaiming he is unaware of both the den and Babylon, the angel transports Habakkuk to the lion's den. Habakkuk gives Daniel the food to sustain him, and is immediately taken back to \"his own place\".\n\nHabakkuk is also mentioned in Lives of the Prophets, which also notes his time in Babylon.\n\nAccording to the Zohar (Volume 1, page 8b) Habakkuk is the boy born to the Shunamite woman through Elisha's blessing:\n\n() And he said, About this season, according to the time of life, thou shalt embrace ( – hoveket, therefore Habakkuk) a son. And she said, Nay, my lord, [thou] man of God, do not lie unto thine handmaid.\n\nWorks\n\nThe only work attributed to Habakkuk is the short book of the Bible that bears his name. The book of Habbakuk consists of five oracles about the Chaldeans (Babylonians) and a song of praise to God.\n\nThe style of the book has been praised by many scholars, suggesting that its author was a man of great literary talent.  The entire book follows the structure of a chiasmus in which parallelism of thought is used to bracket sections of the text.\n\nHabakkuk is unusual among the prophets in that he openly questions the working of God (1:3a, 1:13b). In the first part of the first chapter, the Prophet sees the injustice among his people and asks why God does not take action: \"1:2 Yahweh, how long will I cry, and you will not hear? I cry out to you 'Violence!' and will you not save?\" (World English Bible).\n\nTombs\n\nThe final resting place of Habakkuk has been claimed at multiple locations. The fifth-century Christian historian Sozomen claimed that the relics of Habakkuk were found at Cela, when God revealed their location to Zebennus, bishop of Eleutheropolis, in a dream.  Currently, one location in Israel and one in Iran lay claim to being the burial site of the prophet.\n\nTomb in Israel\n\nThe burial place of Habakkuk is identified by Jewish tradition as a hillside in the Upper Galilee region of northern Israel, close to the villages Kadarim and Hukok, about six miles southwest of Safed and twelve miles north of Mount Tabor. A small stone building, erected during the 20th century, protects the tomb. Tradition dating as early as the 12th century AD holds that Habakkuk's tomb is at this location, but the tomb may also be of a local sheikh of Yaquq, a name related to the biblical place named \"Hukkok\" (mentioned in ), whose pronunciation and spelling in Hebrew are close to \"Habakkuk\". Archaeological findings in this location include several burial places dated to the Second Temple period.\n\nPersian shrine\n\nA mausoleum southeast of the city of Tuyserkan in the west of Iran is also believed to be Habakkuk's burial place. It is protected by Iran's Cultural Heritage, Handcrafts and Tourism Organization. The Organization's guide to the Hamadan Province states that Habakkuk was believed to be a guardian to Solomon's Temple, and that he was captured by the Babylonians and remained in their prison for some years. After being freed by Cyrus the Great, he went to Ecbatana and remained there until he died, and was buried somewhere nearby, in what is today Tuyserkan. Habakkuk is called both Habaghugh and Hayaghugh by the Muslim locals.\n\nThe surrounding shrine may date to the period of the Seljuq Empire (11–12th century); it consists of an octagonal wall and conical dome. Underneath the shrine is a hidden basement with three floors. In the center of the shrine's courtyard is the grave where Habakkuk is said to be buried. A stone upon the grave is inscribed in both Hebrew and Persian stating that the prophet's father was Shioua Lovit, and his mother was Lesho Namit. Both Muslims and Jews visit it to pay their respects.\n\nChristian commemoration\n\nOn the Eastern Orthodox liturgical calendar, his feast day is December 2. In the Roman Catholic Church, the twelve minor prophets are read in the Roman Breviary during the fourth and fifth weeks of November, which are the last two weeks of the liturgical year, and his feast day is January 15. This day is also celebrated as his feast by the Greek Orthodox Church. In 2011, he was commemorated with the other Minor Prophets in the calendar of saints of the Armenian Apostolic Church on February 8.\n\nHabakkuk has also been commemorated in sculpture. In 1435, the Florentine artist Donatello created a sculpture of the prophet for the bell tower of Florence. This statue, nicknamed Zuccone (\"Big Pumpkin\") because of the shape of the head, now resides in the Museo dell'Opera del Duomo. The Basilica of Santa Maria del Popolo in Rome contains a Baroque sculpture of Habakkuk by the 17th-century artist Bernini. Between 1800 and 1805, the Brazilian sculptor Aleijadinho completed a soapstone sculpture of Habakkuk as part of his Twelve Prophets. The figures are arranged around the forecourt and monumental stairway in front of the Santuário do Bom Jesus do Matosinhos at Congonhas.\n\nIslam\n\nAlthough the Quran only mentions around twenty-five prophets by name, and alludes to a few others, it has been a cardinal doctrine of Islam that many more prophets were sent by God who are not mentioned in the scripture.Cf. Qur'an 16:36 Thus, Muslims have traditionally had no problem accepting those other Hebrew prophets not mentioned in the Quran or hadith as legitimate prophets of God, especially as the Quran itself states: \"Surely We sent down the Torah (to Moses), wherein is guidance and light; thereby the Prophets (who followed him), who had surrendered themselves, gave judgment for those who were Jewish, as did the masters and the rabbis, following such portion of God's Book as they were given to keep and were witnesses to,\"Qur'an 5:44, cf. Arberry translation. with this passage having often been interpreted by Muslims to include within the phrase \"prophets\" an allusion to all the prophetic figures of the Jewish scriptural portion of the nevi'im, that is to say all the prophets of Israel after Moses and Aaron. Thus, Islamic authors have often alluded to Habakkuk as a prophet in their works,Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVII-XLVIIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), pp. 269-270Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 381, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, pp. 389-390See Walid Saleh (tr. and intro.), In Defense of the Bible: A Critical Edition and an Introduction to Al-Biqai's Bible Treatise (Islamic History and Civilization: Studies and Texts) (Leiden: Brill, 2008), et passim and followed the pronunciation of his name with the traditional salutations of peace bestowed by Muslims onto prophets after the utterance of their names.Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 381, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, pp. 389-390\n\nSome medieval Muslim scholars even provided commentaries on the biblical Book of Habakkuk, with the primary purpose of showing that the prophet had predicted the coming of Muhammad in Habakkuk 3:2–6, in a manner akin to the earlier Christian tradition of seeing in the book's prophecies allusions to the advent of Christ.Lejla Demiri, Muslim Exegesis of the Bible in Medieval Cairo (Leiden: Brill, 2013), p. 47 For example, the medieval exegete Najm al-Dīn al-Ṭūfī (d. 716 AH/1316 CE) provided a commentary on select verses from the book of Habakkuk, saying the prophet's words \"for his rays become light\" (Habakkuk 3:4) alluded to the spread of Islam;Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 381, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391 that his words \"his glory comes to town, his power appears in his courts\" (Habakkuk 3:4) referred to Muhammad's stay in the town of Yathrib and the help he received there from the ansar;Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 382, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391 and that his words \"death goes before him\" (Habakkuk 3:5) was a prophecy about the fear of the Muslim armies during the military campaigns of Muhammad and his companions.Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 383, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391 Likewise, Habakkuk 3:5–6 also received similar commentaries from medieval Islamic thinkers.Najm al-Dīn al-Ṭūfī, al-Ta‘līq ‘alā al-Anājīl al-arba‘a wa-al-ta‘līq ‘alā al-Tawrāh wa-‘alā ghayrihā min kutub al-anbiyā’, 383, tr. Demiri, Muslim Exegesis of the Bible in Medieval Cairo, p. 391\n\nThe famous and revered Persian Islamic scholar and polymath Ibn Qutaybah, who served as a judge during the Abbasid Caliphate, said of the prophet Habakkuk: \"Among the words of Habakkuk, who prophesied in the days of Daniel, Habakkuk says: 'God came from Teman, and the holy one from the mountains of Paran and the earth was filled with the sanctification of the praiseworthy one (aḥmad, which is a name of Muhammad in Islam), and with his right hand he exercised power over the earth and the necks of the nations,'\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVII-XLVIIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 which has been interpreted by scholars to be a clear allusion to Habakkuk 3:3-4.Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 Elsewhere, the same scholar glossed Habakkuk 3:4, 15 as follows: \"The earth shines with his light, and his horses launched into the sea,\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 again interpreting the prophecy to be an allusion to the coming of Muhammad.Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 264 One further prophecy of Habakkuk which Ibn Qutaybah cited, from extra-canonical Hebraic literature, was \"You shall be exceedingly filled in your bows ... o Praised One (muḥammad),\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 which he read as being \"a clear statement of ... [Muhammad's] name ... [and] his characteristics.\"Ibn Qutaybah, Dalā'il al-Nubuwwa, XLVIII, cited in Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269 This final prophecy attributed to Habakkuk was also referred to by later scholars like Ibn al-Jawzi and Ibn Qayyim al-Jawziyyah.Camilla Adang, Muslim Writers on Judaism and the Hebrew Bible (Leiden: Brill, 1996), p. 269, note 4A. Mingana (tr.) of Ali Tabari's The Book of Religion and Empire (London: Bernard Quaritch Limited, 1922), p. 119. Habakkuk. http://en.wikipedia.org/?curid=13967."
  }
}
