{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1497",
  "eid" : "ba2b2980-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778392088,
  "textBody" : "Events\n\n*295 BC – The first temple to Venus, the Roman goddess of love, beauty and fertility, is dedicated by Quintus Fabius Maximus Gurges during the Third Samnite War.\n*43 BC – Gaius Julius Caesar Octavianus, later known as Augustus, compels the Roman Senate to elect him Consul.\n*947 – Abu Yazid, a Kharijite rebel leader, is defeated and killed in the Hodna Mountains in modern-day Algeria by Fatimid forces.\n*1153 – Baldwin III of Jerusalem takes control of the Kingdom of Jerusalem from his mother Melisende, and also captures Ascalon.\n* 1459- Pope Pius II becomes the 211th Pope.\n*1504 – In Ireland, the Hiberno-Norman de Burghs (Burkes) and Anglo-Norman Fitzgeralds fight in the Battle of Knockdoe.\n*1561 – Mary, Queen of Scots, who was 18 years old, returns to Scotland after spending 13 years in France.\n*1612 – The \"Samlesbury witches\", three women from the Lancashire village of Samlesbury, England, are put on trial, accused of practicing witchcraft, one of the most famous witch trials in British history.\n*1666 – Second Anglo-Dutch War: Rear Admiral Robert Holmes leads a raid on the Dutch island of Terschelling, destroying 150 merchant ships, an act later known as \"Holmes's Bonfire\".\n*1692 – Salem witch trials: In Salem, Province of Massachusetts Bay, five people, one woman and four men, including a clergyman, are executed after being convicted of witchcraft.\n*1745 – Prince Charles Edward Stuart raises his standard in Glenfinnan: The start of the Second Jacobite Rebellion, known as \"the 45\".\n*  1745   – Ottoman–Persian War: In the Battle of Kars, the Ottoman army is routed by Persian forces led by Nader Shah.\n*1759 – Battle of Lagos Naval battle during the Seven Years' War between Great Britain and France.\n*1772 – Gustav III of Sweden stages a coup d'état, in which he assumes power and enacts a new constitution that divides power between the Riksdag and the King.\n*1782 – American Revolutionary War: Battle of Blue Licks: The last major engagement of the war, almost ten months after the surrender of the British commander Charles Cornwallis following the Siege of Yorktown.\n*1812 – War of 1812: American frigate  defeats the British frigate  off the coast of Nova Scotia, Canada earning the nickname \"Old Ironsides\".\n*1813 – Gervasio Antonio de Posadas joins Argentina's Second Triumvirate.\n*1839 – The French government announces that Louis Daguerre's photographic process is a gift \"free to the world\".\n*1848 – California Gold Rush: The New York Herald breaks the news to the East Coast of the United States of the gold rush in California (although the rush started in January).\n*1854 – The First Sioux War begins when United States Army soldiers kill Lakota chief Conquering Bear and in return are massacred.\n*1861 – First ascent of Weisshorn, fifth highest summit in the Alps.\n*1862 – American Indian Wars: During an uprising in Minnesota, Lakota warriors decide not to attack heavily defended Fort Ridgely and instead turn to the settlement of New Ulm, killing white settlers along the way.\n*1909 – The first automobile race at the Indianapolis Motor Speedway.\n*1919 – Afghanistan gains full independence from the United Kingdom.\n*1927 – Patriarch Sergius of Moscow proclaims the declaration of loyalty of the Russian Orthodox Church to the Soviet Union.\n*1934 – The first All-American Soap Box Derby is held in Dayton, Ohio.\n*  1934   – The German referendum of 1934 approves Hitler's appointment as head of state with the title of Führer.\n*1940 – First flight of the B-25 Mitchell medium bomber.\n*1942 – World War II: Operation Jubilee: The 2nd Canadian Infantry Division leads an amphibious assault by allied forces on Dieppe, France and fails, many Canadians are killed or captured. The operation was intended to develop and try new amphibious landing tactics for the coming full invasion in Normandy.\n*1944 – World War II: Liberation of Paris: Paris, France rises against German occupation with the help of Allied troops.\n*1945 – August Revolution: Viet Minh led by Ho Chi Minh take power in Hanoi, Vietnam.\n*1953 – Cold War: The CIA and MI6 help to overthrow the government of Mohammad Mosaddegh in Iran and reinstate the Shah Mohammad Reza Pahlavi.\n*1955 – In the Northeast United States, severe flooding caused by Hurricane Diane, claims 200 lives.\n*1960 – Cold War: In Moscow, Russia, Soviet Union, downed American U-2 pilot Francis Gary Powers is sentenced to ten years imprisonment by the Soviet Union for espionage.\n*  1960   – Sputnik program: Korabl-Sputnik 2: The Soviet Union launches the satellite with the dogs Belka and Strelka, 40 mice, two rats and a variety of plants.\n* 1964 – Syncom 3, the first geostationary communication satellite, was launched.\n*1965 – Japanese prime minister Eisaku Satō becomes the first post-World War II sitting prime minister to visit Okinawa Prefecture.\n*1978 – In Iran, Cinema Rex fire caused more than 400 deaths.\n*1980 – Saudia Flight 163, a Lockheed L-1011 TriStar burns after making an emergency landing at King Khalid International Airport in Riyadh, Saudi Arabia, killing 301 people.\n*1981 – Gulf of Sidra Incident: United States fighters intercept and shoot down two Libyan Sukhoi Su-22 fighter jets over the Gulf of Sidra.\n*1987 – Hungerford massacre: In the United Kingdom, Michael Ryan kills sixteen people with a semi-automatic rifle and then commits suicide.\n*1989 – Polish president Wojciech Jaruzelski nominates Solidarity activist Tadeusz Mazowiecki to be the first non-communist prime minister in 42 years.\n*  1989   – Several hundred East Germans cross the frontier between Hungary and Austria during the Pan-European Picnic, part of the events that began the process of the Fall of the Berlin Wall.\n*1991 – Dissolution of the Soviet Union, August Coup: Soviet President Mikhail Gorbachev is placed under house arrest while on holiday in the town of Foros, Ukraine.\n*1999 – In Belgrade, Yugoslavia, tens of thousands of Serbians rally to demand the resignation of Federal Republic of Yugoslavia President Slobodan Milošević.\n*2002 – Khankala Mi-26 crash: A Russian Mil Mi-26 helicopter carrying troops is hit by a Chechen missile outside Grozny, killing 118 soldiers.\n*2003 – A car-bomb attack on United Nations headquarters in Iraq kills the agency's top envoy Sérgio Vieira de Mello and 21 other employees.\n*  2003   – A suicide attack on a bus in Jerusalem, Israel, planned by Hamas, kills 23 Israelis, seven of them children, in the Shmuel HaNavi bus bombing.\n*2005 – The first-ever joint military exercise between Russia and China, called Peace Mission 2005 begins.\n*2009 – A series of bombings in Baghdad, Iraq, kills 101 and injures 565 others.\n*2010 – Operation Iraqi Freedom ends, with the last of the United States brigade combat teams crossing the border to Kuwait.\n*2013 – The Dhamara Ghat train accident kills at least 37 people in the Indian state of Bihar.\n\nBirths\n\n* 232 – Marcus Aurelius Probus, Roman emperor (d. 282)\n*1342 – Catherine of Bohemia (d. 1395)\n*1398 – Íñigo López de Mendoza, 1st Marquis of Santillana, Spanish poet and politician (d. 1458)\n*1557 – Frederick I, Duke of Württemberg (d. 1608)\n*1570 – Salamone Rossi, Italian violinist and composer (d. 1630)\n*1583 – Daišan, Manchu politician (d. 1648)\n*1590 – Henry Rich, 1st Earl of Holland, English soldier and politician, Lord Lieutenant of Berkshire (d. 1649)\n*1596 – Elizabeth Stuart, Queen of Bohemia (d. 1662)\n*1621 – Gerbrand van den Eeckhout, Dutch painter, etcher, and poet (d. 1674)\n*1631 – John Dryden, English writer (d. 1700)\n*1646 – John Flamsteed, English astronomer and academic (d. 1719)\n*1686 – Eustace Budgell, English journalist and politician (d. 1737)\n*1689 – Samuel Richardson, English author and publisher (d. 1761)\n*1711 – Edward Boscawen, English admiral and politician (d. 1761)\n*1719 – Charles-François de Broglie, marquis de Ruffec, French soldier and diplomat (d. 1791)\n*1743 – Madame du Barry, French mistress of Louis XV of France (d. 1793)\n*1777 – Francis I of the Two Sicilies (d. 1830)\n*1819 – Julius van Zuylen van Nijevelt, Luxembourger-Dutch politician, Prime Minister of the Netherlands (d. 1894)\n*1830 – Julius Lothar Meyer, German chemist (d. 1895) \n*1835 – Tom Wills, Australian cricketer and pioneer of Australian rules football (d. 1880)\n*1843 – C. I. Scofield, American minister and theologian (d. 1921)\n*1846 – Luis Martín, Spanish religious leader, 24th Superior General of the Society of Jesus (d. 1906)\n*1848 – Gustave Caillebotte, French painter and engineer (d. 1894)\n*1849 – Joaquim Nabuco, Brazilian politician and diplomat (d. 1910)\n*1853 – Aleksei Brusilov, Russian general (d. 1926)\n*1870 – Bernard Baruch, American businessman and philanthropist (d. 1965)\n*1871 – Orville Wright, American engineer and pilot, co-founded the Wright Company (d. 1948)\n*1872 – Albert C. Campbell, American popular music singer (d. 1947)\n*1873 – Fred Stone, American actor and producer (d. 1959)\n*1878 – Manuel L. Quezon, Filipino soldier, lawyer, and politician, 2nd President of the Philippines (d. 1944)\n*1881 – George Enescu, Romanian violinist, pianist, composer, and conductor (d. 1955)\n*1881 – George Shepherd, 1st Baron Shepherd (d. 1954)\n*1883 – Coco Chanel, French fashion designer, founded the Chanel Company (d. 1971)\n*  1883   – José Mendes Cabeçadas, Portuguese admiral and politician, 9th President of Portugal (d. 1965)\n*1887 – S. Satyamurti, Indian lawyer and politician (d. 1943)\n*1895 – C. Suntharalingam, Sri Lankan lawyer, academic, and politician (d. 1985)\n*1899 – Colleen Moore, American actress (d. 1988)\n*1900 – Gontran de Poncins, French author and adventurer (d. 1962)\n*  1900   – Gilbert Ryle, English philosopher, author, and academic (d. 1976)\n*  1900   – Dorothy Burr Thompson, American archaeologist and art historian (d. 2001)\n*1902 – Ogden Nash, American poet (d. 1971)\n*1903 – James Gould Cozzens, American novelist and short story writer (d. 1978)\n*1904 – Maurice Wilks, English engineer and businessman (d. 1963)\n*1906 – Philo Farnsworth, American inventor, invented the Fusor (d. 1971)\n*1907 – Hazari Prasad Dwivedi, Indian historian, author, and scholar (d. 1979)\n*  1907   – Thruston Ballard Morton, American soldier and politician (d. 1982)\n*1909 – Ronald King, New Zealand rugby player (d. 1988)\n*1910 – Quentin Bell, English historian and author (d. 1996)\n*1911 – Anna Terruwe, Dutch psychiatrist and author (d. 2004)\n*1913 – John Argyris, Greek engineer and academic (d. 2004)\n*  1913   – Peter Kemp, Indian-English soldier and author (d. 1993)\n*  1913   – Richard Simmons, American actor (d. 2003)\n*1914 – Lajos Baróti, Hungarian footballer and manager (d. 2005)\n*  1914   – Fumio Hayasaka, Japanese composer (d. 1955)\n*1915 – Ring Lardner, Jr., American journalist and screenwriter (d. 2000)\n*  1915   – Alfred Rouleau, Canadian businessman (d. 1985)\n*1916 – Dennis Poore, English race car driver and businessman (d. 1987)\n*1918 – Jimmy Rowles, American singer-songwriter and pianist (d. 1996)\n*1919 – Malcolm Forbes, American publisher and politician (d. 1990)\n*1921 – Gene Roddenberry, American screenwriter and producer (d. 1991)\n*1924 – Willard Boyle, Canadian physicist and academic, Nobel Prize laureate (d. 2011)\n*1925 – Claude Gauvreau, Canadian poet and playwright (d. 1971)\n*1926 – Angus Scrimm, American actor and author (d. 2016)\n*1928 – Bernard Levin, English journalist, author, and broadcaster (d. 2004)\n*1929 – Bill Foster, American basketball player and coach (d. 2016)\n*  1929   – Ion N. Petrovici, Romanian-German neurologist and academic\n*1930 – Frank McCourt, American author and educator (d. 2009)\n*1931 – Bill Shoemaker, American jockey and author (d. 2003)\n*1932 – Thomas P. Salmon, American lawyer and politician, 75th Governor of Vermont\n*  1932   – Banharn Silpa-archa, Thai politician, Prime Minister (1995–1996) (d. 2016)\n*1933 – Bettina Cirone, American model and photographer\n*  1933   – David Hopwood, English microbiologist and geneticist\n*  1933   – Debra Paget, American actress \n*1934 – David Durenberger, American soldier, lawyer, and politician\n*  1934   – Renée Richards, American tennis player and ophthalmologist\n*1935 – Bobby Richardson, American baseball player and coach\n*1936 – Richard McBrien, American priest, theologian, and academic (d. 2015)\n*1937 – Richard Ingrams, English journalist, founded The Oldie\n*  1937   – William Motzing, American composer and conductor (d. 2014)\n*1938 – Diana Muldaur, American actress\n*  1938   – Nelly Vuksic, Argentine conductor and musician\n*1939 – Ginger Baker, English drummer and songwriter\n*1940 – Roger Cook, English songwriter, singer, and producer\n*  1940   – Johnny Nash, American singer-songwriter\n*  1940   – Jill St. John, American model and actress\n*1941 – Mihalis Papagiannakis, Greek educator and politician (d. 2009)\n*1942 – Fred Thompson, American actor, lawyer, and politician (d. 2015)\n*1943 – Don Fardon, English pop singer\n*  1943   – Sid Going, New Zealand rugby player\n*  1943   – Billy J. Kramer, English pop singer\n*1944 – Jack Canfield, American author\n*  1944   – Bodil Malmsten, Swedish author and poet\n*  1944   – Eddy Raven, American country music singer-songwriter\n*  1944   – Charles Wang, Chinese-American businessman and philanthropist, co-founded Computer Associates International\n*1945 – Dennis Eichhorn, American author and illustrator (d. 2015)\n*  1945   – Charles Wellesley, 9th Duke of Wellington, English politician\n*  1945   – Ian Gillan, English singer-songwriter (Deep Purple and Black Sabbath)\n*1946 – Charles Bolden, American general and astronaut\n*  1946   – Bill Clinton, American lawyer and politician, 42nd President of the United States\n*  1946   – Dawn Steel, American film producer (d. 1997)\n*1947 – Dave Dutton, English actor and screenwriter\n*  1947   – Terry Hoeppner, American football player and coach (d. 2007)\n*  1947   – Gerard Schwarz, American conductor and director\n*  1947   – Anuška Ferligoj, Slovenian mathematician\n*1948 – Robert Hughes, Australian actor\n*  1948   – Elliot Lurie, American singer-songwriter and guitarist\n*  1948   – Gerald McRaney, American actor, director, and producer\n*  1948   – Christy O'Connor Jnr, Irish golfer and architect (d. 2016)\n*1949 – Michael Nazir-Ali, Pakistani-English bishop\n*1950 – Graeme Beard, Australian cricketer\n*  1950   – Jennie Bond, English journalist and author\n*1951 – John Deacon, English bass player and songwriter \n*  1951   – Gustavo Santaolalla, Argentinian singer-songwriter, guitarist, and producer \n*1952 – Jonathan Frakes, American actor and director\n*1953 – Mary Matalin, American political consultant\n*1954 – Oscar Larrauri, Argentinian race car driver\n*1955 – Mary-Anne Fahey, Australian actress\n*  1955   – Peter Gallagher, American actor\n*  1955   – Patricia Scotland, Baroness Scotland of Asthal, Dominica-born English lawyer and politician, Attorney General for England and Wales\n*  1955   – Ned Yost, American baseball player and manager\n*1956 – Adam Arkin, American actor, director, and producer\n*  1956   – José Rubén Zamora, Guatemalan journalist\n*1957 – Paul-Jan Bakker, Dutch cricketer\n*  1957   – Gary Chapman, American contemporary Christian music singer-songwriter and guitarist \n*  1957   – Martin Donovan, American actor and director\n*  1957   – Ian Gould, English cricketer and umpire\n*  1957   – Cesare Prandelli, Italian footballer and manager\n*  1957   – Christine Soetewey, Belgian high jumper\n*  1957   – Gerda Verburg, Dutch trade union leader and politician, Dutch Minister of Agriculture\n*1958 – Gary Gaetti, American baseball player, coach, and manager\n*  1958   – Anthony Muñoz, American football player and sportscaster\n*  1958   – Brendan Nelson, Australian physician and politician, 47th Minister for Defence for Australia\n*  1958   – Rick Snyder, American politician and businessman, 48th Governor of Michigan\n*  1958   – Darryl Sutter, Canadian ice hockey player and coach\n*1959 – Ricky Pierce, American basketball player\n*1960 – Morten Andersen, Danish-American football player\n*  1960   – Ron Darling, American baseball player and sportscaster\n*1961 – Jonathan Coe, English author and academic\n*1963 – John Stamos, American actor\n*  1963   – Joey Tempest, Swedish rock singer-songwriter and musician (Europe)\n*1965 – Kevin Dillon, American actor\n*  1965   – Kyra Sedgwick, American actress and producer\n*  1965   – Hemant Birje, Indian actor\n*1966 – Lee Ann Womack, American singer-songwriter\n*  1967   – Khandro Rinpoche, Indian spiritual leader\n*1969 – Nate Dogg, American rapper (d. 2011)\n*  1969   – Matthew Perry, American actor, producer, and screenwriter\n*  1969   – Kazuyoshi Tatsunami, Japanese baseball player and coach\n*  1969   – Clay Walker, American singer-songwriter and guitarist\n*1970 – Jeff Tam, American baseball player\n*1971 – Mary Joe Fernández, Dominican-American tennis player and coach\n*  1971   – João Vieira Pinto, Portuguese footballer\n*1972 – Roberto Abbondanzieri, Argentinian footballer and manager\n*  1972   – Chihiro Yonekura, Japanese singer-songwriter\n*1973 – Carl Bulfin, New Zealand cricketer\n*  1973   – Marco Materazzi, Italian footballer and manager\n*1974 – Anja Knippel, German runner\n*  1974   – Andy Neate, English racing driver \n*1975 – Chynna Clugston, American illustrator\n*1976 – Régine Chassagne, Canadian singer-songwriter \n*  1976   – Stephan Schmidt, German footballer and manager\n*1977 – Iban Mayo, Spanish cyclist\n*1978 – Chris Capuano, American baseball player\n*1978 – Qais Al Khonji, Omani entrepreneur\n*1979 – Dave Douglas, American singer-songwriter and drummer \n*  1979   – Oumar Kondé, Swiss footballer\n*1980 – Darius Campbell, Scottish singer-songwriter, guitarist, and actor\n*  1980   – Jun Jin, South Korean singer \n*  1980   – Paul Parry, Welsh footballer\n*  1980   – Michael Todd, American bass player \n*1981 – Nick Kennedy, English rugby player\n*  1981   – Percy Watson, American football player and wrestler\n*1982 – J. J. Hardy, American baseball player\n*  1982   – Kevin Rans, Belgian pole vaulter\n*1983 – Mike Conway, English race car driver\n*  1983   – Missy Higgins, Australian singer-songwriter\n*  1983   – John McCargo, American football player\n*1984 – Simon Bird, English actor and screenwriter\n*  1984   – Alessandro Matri, Italian footballer\n*  1984   – Ryan Taylor, English footballer\n*1985 – David A. Gregory, American actor\n*  1985   – Gavin Cooper, Australian rugby league player\n*  1985   – Lindsey Jacobellis, American snowboarder\n*1986 – Sotiris Balafas, Greek footballer\n*  1986  – Saori Kimura, Japanese volleyball player\n*  1986  – Christina Perri,  American singer and songwriter\n*1987 – Nick Driebergen, Dutch swimmer\n*  1987   – Nico Hülkenberg, German race car driver\n*  1987   – Anaïs Lameche, French-Swedish singer \n*  1987   – Richard Stearman, English footballer\n*1988 – Hoodie Allen, American rapper\n*  1988   – Kirk Cousins, American football player\n*  1988   – Veronica Roth, American author\n*  1989   – Romeo Miller, American basketball player, rapper, actor\n*1990 – Danny Galbraith, Scottish footballer\n*1994 – Guadalupe Pérez Rojas, Argentinian tennis player\n*  1994   – Nafissatou Thiam, Belgian pentathlete\n*1995 – Dylan Phythian, Australian rugby league player\n*1996 – Hsu Ching-wen, Taiwanese tennis player\n\nDeaths\n\n* AD 14 – Augustus, Roman emperor (b. 63 BC)\n* 780 – Credan, English abbot and saint\n* 911 – Al-Hadi ila'l-Haqq Yahya, Arab religious and political leader (b. 859)\n* 947 – Abu Yazid, Kharijite rebel leader (b. 873)\n* 998 – Fujiwara no Sukemasa, Japanese noble, statesman and calligrapher (b. 944)\n*1072 – Hawise, Duchess of Brittany  (b. 1037)\n*1085 – Al-Juwayni , Muslim scholar and imam (b. 1028)\n*1186 – Geoffrey II, Duke of Brittany (b. 1158)\n*1245 – Ramon Berenguer IV, Count of Provence (b. 1195)\n*1284 – Alphonso, Earl of Chester (b. 1273)\n*1297 – Louis of Toulouse, French bishop and saint (b. 1274)\n*1457 – Andrea del Castagno, Italian painter (b. 1421)\n*1470 – Richard Olivier de Longueil, French cardinal (b. 1406)\n*1493 – Frederick III, Holy Roman Emperor (b. 1415)\n*1506 – King Alexander Jagiellon of Poland (b. 1461)\n*1580 – Andrea Palladio, Italian architect, designed the Church of San Giorgio Maggiore and Il Redentore (b. 1508)\n*1646 – Alexander Henderson, Scottish theologian and academic (b. 1583)\n*1654 – Yom-Tov Lipmann Heller, Bohemian rabbi (b. 1579)\n*1662 – Blaise Pascal, French mathematician, physicist, and philosopher (b. 1623)\n*1680 – Jean Eudes, French priest, founded the Congregation of Jesus and Mary (b. 1601)\n*1691 – Köprülü Fazıl Mustafa Pasha, Ottoman commander and politician, 117th Grand Vizier of the Ottoman Empire (b. 1637)\n*1702 – Anthony Grey, 11th Earl of Kent, English politician (b. 1645)\n*1753 – Johann Balthasar Neumann, German engineer and architect, designed Basilica of the Fourteen Holy Helpers (b. 1687)\n*1808 – Fredrik Henrik af Chapman, Swedish admiral and shipbuilder (b. 1721)\n*1822 – Jean Baptiste Joseph Delambre, French mathematician and astronomer (b. 1749)\n*1883 – Jeremiah S. Black, American lawyer and politician, 24th United States Attorney General (b. 1810)\n*1889 – Auguste Villiers de l'Isle-Adam, French author, poet, and playwright (b. 1838)\n*1900 – Jean-Baptiste Accolay, Belgian violinist, composer, and conductor (b. 1833)\n*1914 – Franz Xavier Wernz, German religious leader, 25th Superior General of the Society of Jesus (b. 1844)\n*1915 – Tevfik Fikret, Turkish poet and educator (b. 1867)\n*1923 – Vilfredo Pareto, Italian sociologist and economist (b. 1845)\n*1928 – Stephanos Skouloudis, Greek banker and diplomat, 97th Prime Minister of Greece (b. 1838)\n*1929 – Sergei Diaghilev, Russian critic and producer, founded Ballets Russes (b. 1872)\n*1932 – Louis Anquetin, French painter (b. 1861)\n*1936 – Federico García Lorca, Spanish poet, playwright, and director (b. 1898)\n*1942 – Harald Kaarmann, Estonian footballer (b. 1901)\n*1945 – Tomás Burgos, Chilean philanthropist (b. 1875)\n*1950 – Giovanni Giorgi, Italian physicist and engineer (b. 1871)\n*1954 – Alcide De Gasperi, Italian journalist and politician, 30th Prime Minister of Italy (b. 1881)\n*1957 – David Bomberg, English soldier and painter (b. 1890)\n*1967 – Hugo Gernsback, Luxembourg-born American author and publisher (b. 1884)\n*  1967   – Isaac Deutscher, Polish-English journalist and historian (b. 1907)\n*1968 – George Gamow, Ukrainian-American physicist and cosmologist (b. 1904)\n*1970 – Paweł Jasienica, Polish soldier and historian (b. 1909)\n*1975 – Mark Donohue, American race car driver and engineer (b. 1937)\n*1976 – Alastair Sim, Scottish-English actor (b. 1900)\n*  1976   – Ken Wadsworth, New Zealand cricketer (b. 1946)\n*1977 – Aleksander Kreek, Estonian shot putter and discus thrower (b. 1914)\n*  1977   – Groucho Marx, American comedian and actor (b. 1890)\n*1980 – Otto Frank, German-Swiss businessman, father of Anne Frank (b. 1889)\n*1981 – Jessie Matthews, English actress, singer, and dancer (b. 1907)\n*1982 – August Neo, Estonian wrestler (b. 1908)\n*1986 – Hermione Baddeley, English actress (b. 1906)\n*1993 – Utpal Dutt, Bangladeshi actor, director, and playwright (b. 1929)\n*1994 – Linus Pauling, American chemist and biologist, Nobel Prize laureate (b. 1901)\n*1995 – Pierre Schaeffer, French composer and musicologist (b. 1910)\n*2000 – Bineshwar Brahma, Indian poet, author, and educator (b. 1948)\n*  2000   – Theodore Trautwein, American lawyer and judge (b. 1920)\n*2001 – Donald Woods, South African journalist and activist (b. 1933)\n*2003 – Carlos Roberto Reina, Honduran lawyer and politician, President of Honduras (b. 1926)\n*  2003   – Sérgio Vieira de Mello, Brazilian diplomat (b. 1948)\n*2005 – Mo Mowlam, English academic and politician, Chancellor of the Duchy of Lancaster (b. 1949)\n*2008 – Levy Mwanawasa, Zambian lawyer and politician, 3rd President of Zambia (b. 1948)\n*2009 – Don Hewitt, American television producer, created 60 Minutes (b. 1922)\n*2011 – Raúl Ruiz, Chilean director and producer (b. 1941)\n*2012 – Donal Henahan, American journalist and critic (b. 1921)\n*  2012   – Ivar Iversen, Norwegian canoe racer (b. 1914)\n*  2012   – Tony Scott, English-American director and producer (b. 1944)\n*  2012   – Edmund Skellings, American poet and academic (b. 1932)\n*2013 – Musa'id bin Abdulaziz Al Saud, Saudi Arabian prince (b. 1923)\n*  2013   – Russell S. Doughten, American director and producer (b. 1927)\n*  2013   – Abdul Rahim Hatif, Afghan politician, 8th President of Afghanistan (b. 1926)\n*  2013   – Donna Hightower, American singer-songwriter (b. 1926)\n*2014 – Samih al-Qasim, Palestinian poet and journalist (b. 1939)\n*  2014   – Simin Behbahani, Iranian poet and activist (b. 1927)\n*  2014   – James Foley, American photographer and journalist (b. 1973)\n*  2014   – Candida Lycett Green, Anglo-Irish journalist and author (b. 1942)\n*2015 – George Houser, American minister and activist (b. 1916)\n*  2015   – Sanat Mehta, Indian activist and politician (b. 1935)\n*2016 – Jack Riley, American actor and voice artist (b. 1935)\n\nHolidays and observances\n\n*Afghan Independence Day, commemorates the Treaty of Rawalpindi in 1919, granting independence from Britain (Afghanistan)\n*August Revolution Commemoration Day (Vietnam)\n*Birthday of Crown Princess Mette-Marit (Norway)\n*Christian Feast Day:\n**Bernardo Tolomei\n**Ezequiél Moreno y Díaz\n**Feast of the Transfiguration (Julian calendar), and its related observances:\n***Buhe (Ethiopian Orthodox Tewahedo Church)\n***Saviour's Transfiguration, popularly known as the \"Apples Feast\" (Russian Orthodox Church and Georgian Orthodox Church)\n**Jean-Eudes de Mézeray\n**Louis of Toulouse\n**Magnus of Anagni\n**Magnus of Avignon\n**Sebaldus\n**August 19 (Eastern Orthodox liturgics)\n*Manuel Luis Quezón Day (Quezon City and other places in the Philippines named after Manuel L. Quezon)\n*National Aviation Day (United States)\n*World Humanitarian Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 19" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1497" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*295 BC – The first temple to Venus, the Roman goddess of love, beauty and fertility, is dedicated by Quintus Fabius Maximus Gurges during the Third Samnite War.\n*43 BC – Gaius Julius Caesar Octavianus, later known as Augustus, compels the Roman Senate to elect him Consul.\n*947 – Abu Yazid, a Kharijite rebel leader, is defeated and killed in the Hodna Mountains in modern-day Algeria by Fatimid forces.\n*1153 – Baldwin III of Jerusalem takes control of the Kingdom of Jerusalem from his mother Melisende, and also captures Ascalon.\n* 1459- Pope Pius II becomes the 211th Pope.\n*1504 – In Ireland, the Hiberno-Norman de Burghs (Burkes) and Anglo-Norman Fitzgeralds fight in the Battle of Knockdoe.\n*1561 – Mary, Queen of Scots, who was 18 years old, returns to Scotland after spending 13 years in France.\n*1612 – The \"Samlesbury witches\", three women from the Lancashire village of Samlesbury, England, are put on trial, accused of practicing witchcraft, one of the most famous witch trials in British history.\n*1666 – Second Anglo-Dutch War: Rear Admiral Robert Holmes leads a raid on the Dutch island of Terschelling, destroying 150 merchant ships, an act later known as \"Holmes's Bonfire\".\n*1692 – Salem witch trials: In Salem, Province of Massachusetts Bay, five people, one woman and four men, including a clergyman, are executed after being convicted of witchcraft.\n*1745 – Prince Charles Edward Stuart raises his standard in Glenfinnan: The start of the Second Jacobite Rebellion, known as \"the 45\".\n*  1745   – Ottoman–Persian War: In the Battle of Kars, the Ottoman army is routed by Persian forces led by Nader Shah.\n*1759 – Battle of Lagos Naval battle during the Seven Years' War between Great Britain and France.\n*1772 – Gustav III of Sweden stages a coup d'état, in which he assumes power and enacts a new constitution that divides power between the Riksdag and the King.\n*1782 – American Revolutionary War: Battle of Blue Licks: The last major engagement of the war, almost ten months after the surrender of the British commander Charles Cornwallis following the Siege of Yorktown.\n*1812 – War of 1812: American frigate  defeats the British frigate  off the coast of Nova Scotia, Canada earning the nickname \"Old Ironsides\".\n*1813 – Gervasio Antonio de Posadas joins Argentina's Second Triumvirate.\n*1839 – The French government announces that Louis Daguerre's photographic process is a gift \"free to the world\".\n*1848 – California Gold Rush: The New York Herald breaks the news to the East Coast of the United States of the gold rush in California (although the rush started in January).\n*1854 – The First Sioux War begins when United States Army soldiers kill Lakota chief Conquering Bear and in return are massacred.\n*1861 – First ascent of Weisshorn, fifth highest summit in the Alps.\n*1862 – American Indian Wars: During an uprising in Minnesota, Lakota warriors decide not to attack heavily defended Fort Ridgely and instead turn to the settlement of New Ulm, killing white settlers along the way.\n*1909 – The first automobile race at the Indianapolis Motor Speedway.\n*1919 – Afghanistan gains full independence from the United Kingdom.\n*1927 – Patriarch Sergius of Moscow proclaims the declaration of loyalty of the Russian Orthodox Church to the Soviet Union.\n*1934 – The first All-American Soap Box Derby is held in Dayton, Ohio.\n*  1934   – The German referendum of 1934 approves Hitler's appointment as head of state with the title of Führer.\n*1940 – First flight of the B-25 Mitchell medium bomber.\n*1942 – World War II: Operation Jubilee: The 2nd Canadian Infantry Division leads an amphibious assault by allied forces on Dieppe, France and fails, many Canadians are killed or captured. The operation was intended to develop and try new amphibious landing tactics for the coming full invasion in Normandy.\n*1944 – World War II: Liberation of Paris: Paris, France rises against German occupation with the help of Allied troops.\n*1945 – August Revolution: Viet Minh led by Ho Chi Minh take power in Hanoi, Vietnam.\n*1953 – Cold War: The CIA and MI6 help to overthrow the government of Mohammad Mosaddegh in Iran and reinstate the Shah Mohammad Reza Pahlavi.\n*1955 – In the Northeast United States, severe flooding caused by Hurricane Diane, claims 200 lives.\n*1960 – Cold War: In Moscow, Russia, Soviet Union, downed American U-2 pilot Francis Gary Powers is sentenced to ten years imprisonment by the Soviet Union for espionage.\n*  1960   – Sputnik program: Korabl-Sputnik 2: The Soviet Union launches the satellite with the dogs Belka and Strelka, 40 mice, two rats and a variety of plants.\n* 1964 – Syncom 3, the first geostationary communication satellite, was launched.\n*1965 – Japanese prime minister Eisaku Satō becomes the first post-World War II sitting prime minister to visit Okinawa Prefecture.\n*1978 – In Iran, Cinema Rex fire caused more than 400 deaths.\n*1980 – Saudia Flight 163, a Lockheed L-1011 TriStar burns after making an emergency landing at King Khalid International Airport in Riyadh, Saudi Arabia, killing 301 people.\n*1981 – Gulf of Sidra Incident: United States fighters intercept and shoot down two Libyan Sukhoi Su-22 fighter jets over the Gulf of Sidra.\n*1987 – Hungerford massacre: In the United Kingdom, Michael Ryan kills sixteen people with a semi-automatic rifle and then commits suicide.\n*1989 – Polish president Wojciech Jaruzelski nominates Solidarity activist Tadeusz Mazowiecki to be the first non-communist prime minister in 42 years.\n*  1989   – Several hundred East Germans cross the frontier between Hungary and Austria during the Pan-European Picnic, part of the events that began the process of the Fall of the Berlin Wall.\n*1991 – Dissolution of the Soviet Union, August Coup: Soviet President Mikhail Gorbachev is placed under house arrest while on holiday in the town of Foros, Ukraine.\n*1999 – In Belgrade, Yugoslavia, tens of thousands of Serbians rally to demand the resignation of Federal Republic of Yugoslavia President Slobodan Milošević.\n*2002 – Khankala Mi-26 crash: A Russian Mil Mi-26 helicopter carrying troops is hit by a Chechen missile outside Grozny, killing 118 soldiers.\n*2003 – A car-bomb attack on United Nations headquarters in Iraq kills the agency's top envoy Sérgio Vieira de Mello and 21 other employees.\n*  2003   – A suicide attack on a bus in Jerusalem, Israel, planned by Hamas, kills 23 Israelis, seven of them children, in the Shmuel HaNavi bus bombing.\n*2005 – The first-ever joint military exercise between Russia and China, called Peace Mission 2005 begins.\n*2009 – A series of bombings in Baghdad, Iraq, kills 101 and injures 565 others.\n*2010 – Operation Iraqi Freedom ends, with the last of the United States brigade combat teams crossing the border to Kuwait.\n*2013 – The Dhamara Ghat train accident kills at least 37 people in the Indian state of Bihar.\n\nBirths\n\n* 232 – Marcus Aurelius Probus, Roman emperor (d. 282)\n*1342 – Catherine of Bohemia (d. 1395)\n*1398 – Íñigo López de Mendoza, 1st Marquis of Santillana, Spanish poet and politician (d. 1458)\n*1557 – Frederick I, Duke of Württemberg (d. 1608)\n*1570 – Salamone Rossi, Italian violinist and composer (d. 1630)\n*1583 – Daišan, Manchu politician (d. 1648)\n*1590 – Henry Rich, 1st Earl of Holland, English soldier and politician, Lord Lieutenant of Berkshire (d. 1649)\n*1596 – Elizabeth Stuart, Queen of Bohemia (d. 1662)\n*1621 – Gerbrand van den Eeckhout, Dutch painter, etcher, and poet (d. 1674)\n*1631 – John Dryden, English writer (d. 1700)\n*1646 – John Flamsteed, English astronomer and academic (d. 1719)\n*1686 – Eustace Budgell, English journalist and politician (d. 1737)\n*1689 – Samuel Richardson, English author and publisher (d. 1761)\n*1711 – Edward Boscawen, English admiral and politician (d. 1761)\n*1719 – Charles-François de Broglie, marquis de Ruffec, French soldier and diplomat (d. 1791)\n*1743 – Madame du Barry, French mistress of Louis XV of France (d. 1793)\n*1777 – Francis I of the Two Sicilies (d. 1830)\n*1819 – Julius van Zuylen van Nijevelt, Luxembourger-Dutch politician, Prime Minister of the Netherlands (d. 1894)\n*1830 – Julius Lothar Meyer, German chemist (d. 1895) \n*1835 – Tom Wills, Australian cricketer and pioneer of Australian rules football (d. 1880)\n*1843 – C. I. Scofield, American minister and theologian (d. 1921)\n*1846 – Luis Martín, Spanish religious leader, 24th Superior General of the Society of Jesus (d. 1906)\n*1848 – Gustave Caillebotte, French painter and engineer (d. 1894)\n*1849 – Joaquim Nabuco, Brazilian politician and diplomat (d. 1910)\n*1853 – Aleksei Brusilov, Russian general (d. 1926)\n*1870 – Bernard Baruch, American businessman and philanthropist (d. 1965)\n*1871 – Orville Wright, American engineer and pilot, co-founded the Wright Company (d. 1948)\n*1872 – Albert C. Campbell, American popular music singer (d. 1947)\n*1873 – Fred Stone, American actor and producer (d. 1959)\n*1878 – Manuel L. Quezon, Filipino soldier, lawyer, and politician, 2nd President of the Philippines (d. 1944)\n*1881 – George Enescu, Romanian violinist, pianist, composer, and conductor (d. 1955)\n*1881 – George Shepherd, 1st Baron Shepherd (d. 1954)\n*1883 – Coco Chanel, French fashion designer, founded the Chanel Company (d. 1971)\n*  1883   – José Mendes Cabeçadas, Portuguese admiral and politician, 9th President of Portugal (d. 1965)\n*1887 – S. Satyamurti, Indian lawyer and politician (d. 1943)\n*1895 – C. Suntharalingam, Sri Lankan lawyer, academic, and politician (d. 1985)\n*1899 – Colleen Moore, American actress (d. 1988)\n*1900 – Gontran de Poncins, French author and adventurer (d. 1962)\n*  1900   – Gilbert Ryle, English philosopher, author, and academic (d. 1976)\n*  1900   – Dorothy Burr Thompson, American archaeologist and art historian (d. 2001)\n*1902 – Ogden Nash, American poet (d. 1971)\n*1903 – James Gould Cozzens, American novelist and short story writer (d. 1978)\n*1904 – Maurice Wilks, English engineer and businessman (d. 1963)\n*1906 – Philo Farnsworth, American inventor, invented the Fusor (d. 1971)\n*1907 – Hazari Prasad Dwivedi, Indian historian, author, and scholar (d. 1979)\n*  1907   – Thruston Ballard Morton, American soldier and politician (d. 1982)\n*1909 – Ronald King, New Zealand rugby player (d. 1988)\n*1910 – Quentin Bell, English historian and author (d. 1996)\n*1911 – Anna Terruwe, Dutch psychiatrist and author (d. 2004)\n*1913 – John Argyris, Greek engineer and academic (d. 2004)\n*  1913   – Peter Kemp, Indian-English soldier and author (d. 1993)\n*  1913   – Richard Simmons, American actor (d. 2003)\n*1914 – Lajos Baróti, Hungarian footballer and manager (d. 2005)\n*  1914   – Fumio Hayasaka, Japanese composer (d. 1955)\n*1915 – Ring Lardner, Jr., American journalist and screenwriter (d. 2000)\n*  1915   – Alfred Rouleau, Canadian businessman (d. 1985)\n*1916 – Dennis Poore, English race car driver and businessman (d. 1987)\n*1918 – Jimmy Rowles, American singer-songwriter and pianist (d. 1996)\n*1919 – Malcolm Forbes, American publisher and politician (d. 1990)\n*1921 – Gene Roddenberry, American screenwriter and producer (d. 1991)\n*1924 – Willard Boyle, Canadian physicist and academic, Nobel Prize laureate (d. 2011)\n*1925 – Claude Gauvreau, Canadian poet and playwright (d. 1971)\n*1926 – Angus Scrimm, American actor and author (d. 2016)\n*1928 – Bernard Levin, English journalist, author, and broadcaster (d. 2004)\n*1929 – Bill Foster, American basketball player and coach (d. 2016)\n*  1929   – Ion N. Petrovici, Romanian-German neurologist and academic\n*1930 – Frank McCourt, American author and educator (d. 2009)\n*1931 – Bill Shoemaker, American jockey and author (d. 2003)\n*1932 – Thomas P. Salmon, American lawyer and politician, 75th Governor of Vermont\n*  1932   – Banharn Silpa-archa, Thai politician, Prime Minister (1995–1996) (d. 2016)\n*1933 – Bettina Cirone, American model and photographer\n*  1933   – David Hopwood, English microbiologist and geneticist\n*  1933   – Debra Paget, American actress \n*1934 – David Durenberger, American soldier, lawyer, and politician\n*  1934   – Renée Richards, American tennis player and ophthalmologist\n*1935 – Bobby Richardson, American baseball player and coach\n*1936 – Richard McBrien, American priest, theologian, and academic (d. 2015)\n*1937 – Richard Ingrams, English journalist, founded The Oldie\n*  1937   – William Motzing, American composer and conductor (d. 2014)\n*1938 – Diana Muldaur, American actress\n*  1938   – Nelly Vuksic, Argentine conductor and musician\n*1939 – Ginger Baker, English drummer and songwriter\n*1940 – Roger Cook, English songwriter, singer, and producer\n*  1940   – Johnny Nash, American singer-songwriter\n*  1940   – Jill St. John, American model and actress\n*1941 – Mihalis Papagiannakis, Greek educator and politician (d. 2009)\n*1942 – Fred Thompson, American actor, lawyer, and politician (d. 2015)\n*1943 – Don Fardon, English pop singer\n*  1943   – Sid Going, New Zealand rugby player\n*  1943   – Billy J. Kramer, English pop singer\n*1944 – Jack Canfield, American author\n*  1944   – Bodil Malmsten, Swedish author and poet\n*  1944   – Eddy Raven, American country music singer-songwriter\n*  1944   – Charles Wang, Chinese-American businessman and philanthropist, co-founded Computer Associates International\n*1945 – Dennis Eichhorn, American author and illustrator (d. 2015)\n*  1945   – Charles Wellesley, 9th Duke of Wellington, English politician\n*  1945   – Ian Gillan, English singer-songwriter (Deep Purple and Black Sabbath)\n*1946 – Charles Bolden, American general and astronaut\n*  1946   – Bill Clinton, American lawyer and politician, 42nd President of the United States\n*  1946   – Dawn Steel, American film producer (d. 1997)\n*1947 – Dave Dutton, English actor and screenwriter\n*  1947   – Terry Hoeppner, American football player and coach (d. 2007)\n*  1947   – Gerard Schwarz, American conductor and director\n*  1947   – Anuška Ferligoj, Slovenian mathematician\n*1948 – Robert Hughes, Australian actor\n*  1948   – Elliot Lurie, American singer-songwriter and guitarist\n*  1948   – Gerald McRaney, American actor, director, and producer\n*  1948   – Christy O'Connor Jnr, Irish golfer and architect (d. 2016)\n*1949 – Michael Nazir-Ali, Pakistani-English bishop\n*1950 – Graeme Beard, Australian cricketer\n*  1950   – Jennie Bond, English journalist and author\n*1951 – John Deacon, English bass player and songwriter \n*  1951   – Gustavo Santaolalla, Argentinian singer-songwriter, guitarist, and producer \n*1952 – Jonathan Frakes, American actor and director\n*1953 – Mary Matalin, American political consultant\n*1954 – Oscar Larrauri, Argentinian race car driver\n*1955 – Mary-Anne Fahey, Australian actress\n*  1955   – Peter Gallagher, American actor\n*  1955   – Patricia Scotland, Baroness Scotland of Asthal, Dominica-born English lawyer and politician, Attorney General for England and Wales\n*  1955   – Ned Yost, American baseball player and manager\n*1956 – Adam Arkin, American actor, director, and producer\n*  1956   – José Rubén Zamora, Guatemalan journalist\n*1957 – Paul-Jan Bakker, Dutch cricketer\n*  1957   – Gary Chapman, American contemporary Christian music singer-songwriter and guitarist \n*  1957   – Martin Donovan, American actor and director\n*  1957   – Ian Gould, English cricketer and umpire\n*  1957   – Cesare Prandelli, Italian footballer and manager\n*  1957   – Christine Soetewey, Belgian high jumper\n*  1957   – Gerda Verburg, Dutch trade union leader and politician, Dutch Minister of Agriculture\n*1958 – Gary Gaetti, American baseball player, coach, and manager\n*  1958   – Anthony Muñoz, American football player and sportscaster\n*  1958   – Brendan Nelson, Australian physician and politician, 47th Minister for Defence for Australia\n*  1958   – Rick Snyder, American politician and businessman, 48th Governor of Michigan\n*  1958   – Darryl Sutter, Canadian ice hockey player and coach\n*1959 – Ricky Pierce, American basketball player\n*1960 – Morten Andersen, Danish-American football player\n*  1960   – Ron Darling, American baseball player and sportscaster\n*1961 – Jonathan Coe, English author and academic\n*1963 – John Stamos, American actor\n*  1963   – Joey Tempest, Swedish rock singer-songwriter and musician (Europe)\n*1965 – Kevin Dillon, American actor\n*  1965   – Kyra Sedgwick, American actress and producer\n*  1965   – Hemant Birje, Indian actor\n*1966 – Lee Ann Womack, American singer-songwriter\n*  1967   – Khandro Rinpoche, Indian spiritual leader\n*1969 – Nate Dogg, American rapper (d. 2011)\n*  1969   – Matthew Perry, American actor, producer, and screenwriter\n*  1969   – Kazuyoshi Tatsunami, Japanese baseball player and coach\n*  1969   – Clay Walker, American singer-songwriter and guitarist\n*1970 – Jeff Tam, American baseball player\n*1971 – Mary Joe Fernández, Dominican-American tennis player and coach\n*  1971   – João Vieira Pinto, Portuguese footballer\n*1972 – Roberto Abbondanzieri, Argentinian footballer and manager\n*  1972   – Chihiro Yonekura, Japanese singer-songwriter\n*1973 – Carl Bulfin, New Zealand cricketer\n*  1973   – Marco Materazzi, Italian footballer and manager\n*1974 – Anja Knippel, German runner\n*  1974   – Andy Neate, English racing driver \n*1975 – Chynna Clugston, American illustrator\n*1976 – Régine Chassagne, Canadian singer-songwriter \n*  1976   – Stephan Schmidt, German footballer and manager\n*1977 – Iban Mayo, Spanish cyclist\n*1978 – Chris Capuano, American baseball player\n*1978 – Qais Al Khonji, Omani entrepreneur\n*1979 – Dave Douglas, American singer-songwriter and drummer \n*  1979   – Oumar Kondé, Swiss footballer\n*1980 – Darius Campbell, Scottish singer-songwriter, guitarist, and actor\n*  1980   – Jun Jin, South Korean singer \n*  1980   – Paul Parry, Welsh footballer\n*  1980   – Michael Todd, American bass player \n*1981 – Nick Kennedy, English rugby player\n*  1981   – Percy Watson, American football player and wrestler\n*1982 – J. J. Hardy, American baseball player\n*  1982   – Kevin Rans, Belgian pole vaulter\n*1983 – Mike Conway, English race car driver\n*  1983   – Missy Higgins, Australian singer-songwriter\n*  1983   – John McCargo, American football player\n*1984 – Simon Bird, English actor and screenwriter\n*  1984   – Alessandro Matri, Italian footballer\n*  1984   – Ryan Taylor, English footballer\n*1985 – David A. Gregory, American actor\n*  1985   – Gavin Cooper, Australian rugby league player\n*  1985   – Lindsey Jacobellis, American snowboarder\n*1986 – Sotiris Balafas, Greek footballer\n*  1986  – Saori Kimura, Japanese volleyball player\n*  1986  – Christina Perri,  American singer and songwriter\n*1987 – Nick Driebergen, Dutch swimmer\n*  1987   – Nico Hülkenberg, German race car driver\n*  1987   – Anaïs Lameche, French-Swedish singer \n*  1987   – Richard Stearman, English footballer\n*1988 – Hoodie Allen, American rapper\n*  1988   – Kirk Cousins, American football player\n*  1988   – Veronica Roth, American author\n*  1989   – Romeo Miller, American basketball player, rapper, actor\n*1990 – Danny Galbraith, Scottish footballer\n*1994 – Guadalupe Pérez Rojas, Argentinian tennis player\n*  1994   – Nafissatou Thiam, Belgian pentathlete\n*1995 – Dylan Phythian, Australian rugby league player\n*1996 – Hsu Ching-wen, Taiwanese tennis player\n\nDeaths\n\n* AD 14 – Augustus, Roman emperor (b. 63 BC)\n* 780 – Credan, English abbot and saint\n* 911 – Al-Hadi ila'l-Haqq Yahya, Arab religious and political leader (b. 859)\n* 947 – Abu Yazid, Kharijite rebel leader (b. 873)\n* 998 – Fujiwara no Sukemasa, Japanese noble, statesman and calligrapher (b. 944)\n*1072 – Hawise, Duchess of Brittany  (b. 1037)\n*1085 – Al-Juwayni , Muslim scholar and imam (b. 1028)\n*1186 – Geoffrey II, Duke of Brittany (b. 1158)\n*1245 – Ramon Berenguer IV, Count of Provence (b. 1195)\n*1284 – Alphonso, Earl of Chester (b. 1273)\n*1297 – Louis of Toulouse, French bishop and saint (b. 1274)\n*1457 – Andrea del Castagno, Italian painter (b. 1421)\n*1470 – Richard Olivier de Longueil, French cardinal (b. 1406)\n*1493 – Frederick III, Holy Roman Emperor (b. 1415)\n*1506 – King Alexander Jagiellon of Poland (b. 1461)\n*1580 – Andrea Palladio, Italian architect, designed the Church of San Giorgio Maggiore and Il Redentore (b. 1508)\n*1646 – Alexander Henderson, Scottish theologian and academic (b. 1583)\n*1654 – Yom-Tov Lipmann Heller, Bohemian rabbi (b. 1579)\n*1662 – Blaise Pascal, French mathematician, physicist, and philosopher (b. 1623)\n*1680 – Jean Eudes, French priest, founded the Congregation of Jesus and Mary (b. 1601)\n*1691 – Köprülü Fazıl Mustafa Pasha, Ottoman commander and politician, 117th Grand Vizier of the Ottoman Empire (b. 1637)\n*1702 – Anthony Grey, 11th Earl of Kent, English politician (b. 1645)\n*1753 – Johann Balthasar Neumann, German engineer and architect, designed Basilica of the Fourteen Holy Helpers (b. 1687)\n*1808 – Fredrik Henrik af Chapman, Swedish admiral and shipbuilder (b. 1721)\n*1822 – Jean Baptiste Joseph Delambre, French mathematician and astronomer (b. 1749)\n*1883 – Jeremiah S. Black, American lawyer and politician, 24th United States Attorney General (b. 1810)\n*1889 – Auguste Villiers de l'Isle-Adam, French author, poet, and playwright (b. 1838)\n*1900 – Jean-Baptiste Accolay, Belgian violinist, composer, and conductor (b. 1833)\n*1914 – Franz Xavier Wernz, German religious leader, 25th Superior General of the Society of Jesus (b. 1844)\n*1915 – Tevfik Fikret, Turkish poet and educator (b. 1867)\n*1923 – Vilfredo Pareto, Italian sociologist and economist (b. 1845)\n*1928 – Stephanos Skouloudis, Greek banker and diplomat, 97th Prime Minister of Greece (b. 1838)\n*1929 – Sergei Diaghilev, Russian critic and producer, founded Ballets Russes (b. 1872)\n*1932 – Louis Anquetin, French painter (b. 1861)\n*1936 – Federico García Lorca, Spanish poet, playwright, and director (b. 1898)\n*1942 – Harald Kaarmann, Estonian footballer (b. 1901)\n*1945 – Tomás Burgos, Chilean philanthropist (b. 1875)\n*1950 – Giovanni Giorgi, Italian physicist and engineer (b. 1871)\n*1954 – Alcide De Gasperi, Italian journalist and politician, 30th Prime Minister of Italy (b. 1881)\n*1957 – David Bomberg, English soldier and painter (b. 1890)\n*1967 – Hugo Gernsback, Luxembourg-born American author and publisher (b. 1884)\n*  1967   – Isaac Deutscher, Polish-English journalist and historian (b. 1907)\n*1968 – George Gamow, Ukrainian-American physicist and cosmologist (b. 1904)\n*1970 – Paweł Jasienica, Polish soldier and historian (b. 1909)\n*1975 – Mark Donohue, American race car driver and engineer (b. 1937)\n*1976 – Alastair Sim, Scottish-English actor (b. 1900)\n*  1976   – Ken Wadsworth, New Zealand cricketer (b. 1946)\n*1977 – Aleksander Kreek, Estonian shot putter and discus thrower (b. 1914)\n*  1977   – Groucho Marx, American comedian and actor (b. 1890)\n*1980 – Otto Frank, German-Swiss businessman, father of Anne Frank (b. 1889)\n*1981 – Jessie Matthews, English actress, singer, and dancer (b. 1907)\n*1982 – August Neo, Estonian wrestler (b. 1908)\n*1986 – Hermione Baddeley, English actress (b. 1906)\n*1993 – Utpal Dutt, Bangladeshi actor, director, and playwright (b. 1929)\n*1994 – Linus Pauling, American chemist and biologist, Nobel Prize laureate (b. 1901)\n*1995 – Pierre Schaeffer, French composer and musicologist (b. 1910)\n*2000 – Bineshwar Brahma, Indian poet, author, and educator (b. 1948)\n*  2000   – Theodore Trautwein, American lawyer and judge (b. 1920)\n*2001 – Donald Woods, South African journalist and activist (b. 1933)\n*2003 – Carlos Roberto Reina, Honduran lawyer and politician, President of Honduras (b. 1926)\n*  2003   – Sérgio Vieira de Mello, Brazilian diplomat (b. 1948)\n*2005 – Mo Mowlam, English academic and politician, Chancellor of the Duchy of Lancaster (b. 1949)\n*2008 – Levy Mwanawasa, Zambian lawyer and politician, 3rd President of Zambia (b. 1948)\n*2009 – Don Hewitt, American television producer, created 60 Minutes (b. 1922)\n*2011 – Raúl Ruiz, Chilean director and producer (b. 1941)\n*2012 – Donal Henahan, American journalist and critic (b. 1921)\n*  2012   – Ivar Iversen, Norwegian canoe racer (b. 1914)\n*  2012   – Tony Scott, English-American director and producer (b. 1944)\n*  2012   – Edmund Skellings, American poet and academic (b. 1932)\n*2013 – Musa'id bin Abdulaziz Al Saud, Saudi Arabian prince (b. 1923)\n*  2013   – Russell S. Doughten, American director and producer (b. 1927)\n*  2013   – Abdul Rahim Hatif, Afghan politician, 8th President of Afghanistan (b. 1926)\n*  2013   – Donna Hightower, American singer-songwriter (b. 1926)\n*2014 – Samih al-Qasim, Palestinian poet and journalist (b. 1939)\n*  2014   – Simin Behbahani, Iranian poet and activist (b. 1927)\n*  2014   – James Foley, American photographer and journalist (b. 1973)\n*  2014   – Candida Lycett Green, Anglo-Irish journalist and author (b. 1942)\n*2015 – George Houser, American minister and activist (b. 1916)\n*  2015   – Sanat Mehta, Indian activist and politician (b. 1935)\n*2016 – Jack Riley, American actor and voice artist (b. 1935)\n\nHolidays and observances\n\n*Afghan Independence Day, commemorates the Treaty of Rawalpindi in 1919, granting independence from Britain (Afghanistan)\n*August Revolution Commemoration Day (Vietnam)\n*Birthday of Crown Princess Mette-Marit (Norway)\n*Christian Feast Day:\n**Bernardo Tolomei\n**Ezequiél Moreno y Díaz\n**Feast of the Transfiguration (Julian calendar), and its related observances:\n***Buhe (Ethiopian Orthodox Tewahedo Church)\n***Saviour's Transfiguration, popularly known as the \"Apples Feast\" (Russian Orthodox Church and Georgian Orthodox Church)\n**Jean-Eudes de Mézeray\n**Louis of Toulouse\n**Magnus of Anagni\n**Magnus of Avignon\n**Sebaldus\n**August 19 (Eastern Orthodox liturgics)\n*Manuel Luis Quezón Day (Quezon City and other places in the Philippines named after Manuel L. Quezon)\n*National Aviation Day (United States)\n*World Humanitarian Day. August 19. http://en.wikipedia.org/?curid=1497."
  }
}
