{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16818",
  "eid" : "28ce5fb0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778577707,
  "textBody" : "The kora is a 21-string lute-bridge-harp used extensively in West Africa.[http://www.asza.com/ikora.shtml http://asza.com]\n\nDescription\n\nA kora is a Mandinka harp built from a large calabash cut in half and covered with cow skin to make a resonator with a long hardwood neck. The skin is supported by two handles that run under it.  It  supports a notched double free-standing bridge.  It doesn't fit into any one category of musical instruments, but rather several, and must be classified as a \"double-bridge-harp-lute\". The strings run in two divided ranks, making it a double harp. They do not end in a soundboard but are held in notches on a bridge, making it a bridge harp. They originate from a string arm or neck and cross a bridge directly supported by a resonating chamber, making it a lute too.\n\nThe sound of a kora resembles that of a harp, though when played in the traditional style, it bears a closer resemblance to flamenco and Delta blues guitar techniques of both hands to pluck the strings in polyrhythmic patterns (using the remaining fingers to secure the instrument by holding the hand posts on either side of the strings). Ostinato riffs (\"Kumbengo\") and improvised solo runs (\"Birimintingo\") are played at the same time by skilled players.\n\nKora players have traditionally come from griot families (also from the Mandinka nationalities) who are traditional historians, genealogists and storytellers who pass their skills on to their descendants. The instrument is played in Guinea, Guinea-Bissau, Mali, Senegal, Burkina Faso and the Gambia. A traditional kora player is called a Jali, similar to a \"bard\" or oral historian. Most West African musicians prefer the term \"jali\" to \"griot\", which is the French word.\n\nTraditional koras feature 21 strings, eleven played by the left hand and ten by the right. Modern koras made in the Casamance region of southern Senegal sometimes feature additional bass strings, adding up to four strings to the traditional 21. Strings were traditionally made from thin strips of hide, for example antelope skin - now most strings are made from harp strings or nylon fishing line, sometimes plaited together to create thicker strings.\n\nA vital accessory in the past was the nyenyemo, a leaf-shaped plate of tin or brass with wire loops threaded around the edge. Clamped to the bridge, it produced sympathetic sounds, serving as an amplifier since the sound carried well in the open air. In today's environment players usually prefer or need an electric pickup. http://www.oxfordmusiconline.com/subscriber/article/grove/music/15371?qkora&search\nquick&pos1&_start\n1#firsthit\n\nBy moving leather tuning rings up and down the neck, a kora player can retune the instrument into one of four seven-note scales. These scales are close in tuning to western major, minor and Lydian modes.[http://www.coraconnection.com/pages/TuningKora.html http://www.coraconnection.com/][http://www.thekoraworkshop.co.uk/kora-tuning-help-silaba.html http://www.thekoraworkshop.co.uk/]\n\nHistory\n\nIbn Battuta did mention that the women who accompanied Dugha to perform were carrying bows that they plucked. He didn't mention the number of strings, but this clearly shows the existence of harp instruments in 14th century Mali and could be the earliest written reference to the kora. The kora is designed like a bow with a gourd but Ibn Battuta did not go into detail about these instruments. The earliest European reference to the kora in Western literature is in Travels in Interior Districts of Africa (1799) by the Scottish        \nMungo Park. The most likely scenario, based on Mandinka oral tradition, suggests that the origins of the kora may ultimately be linked with Jali Mady Fouling Cissoko, some time after the founding of Kaabu in the 16th century.[http://perso.orange.fr/laurent.berte/Html/origines2.htm]\n\nThe kora is mentioned in the Senegalese national anthem \"Pincez Tous vos Koras, Frappez les Balafons\".\n\nNowadays, increasingly, koras are made with guitar machine heads instead of the traditional leather rings. The advantage is that they are much easier to tune. The disadvantage is that this design limits the pitch of the instrument because string lengths are more fixed and lighter strings are needed to lift it much more than a tone.  Learning to tune a traditional kora is arguably as difficult as learning to play it, and many tourists who are entranced by the sound while in West Africa buy koras and then find themselves unable to keep it in tune once they are home, relegating it to the status of ornament. Koras can be converted to replace the leather rings with machine heads. Wooden pegs and harp pegs are also used, but both can still cause tuning problems in damper climates unless made with great skill.\n \n\nIn the late 20th century, a 25-string model of the kora was developed, though it has been adopted by only a few players, primarily in the region of Casamance, in southern Senegal. Some kora players such as Seckou Keita have double necked koras, allowing them to switch from one tuning to another within seconds, giving them increased flexibility.\n\nThe French Benedictine monks of the Keur Moussa Abbey in Senegal (who possibly were the first to introduce guitar machine heads instead of leather rings in the late seventies) conceived a method based on scores to teach the instrument. Brother Dominique Catta, choirmaster of the Keur Moussa Abbey,[http://www.abbaye-keur-moussa.org Keur Moussa web site] was the first Western composer who wrote for the kora (solo pieces as well as duets with Western instruments).Lumière Radieuse - Keur Moussa, Art et Musique, 2007; Sénégal, Messe & Chants Au Monastère De Keur Moussa, Arion, 2010.\n\nAn electric instrument modeled on the kora (but made primarily of metal) called the gravikord was invented in the late 20th century by instrument builder and musician Robert Grawi. It has 24 strings but is tuned and played differently than the kora. Another instrument, the Gravi-kora, a 21 string electro-acoustic instrument, was later developed by Robert Grawi especially for kora players who wanted a modern instrument. Its playing and tuning are the same as the traditional kora.The gravi-kora in the Gravikord web site : http://www.gravikord.com/instrument.html#gravikord The gravi-kora has been adopted by kora players such as Daniel Berkman,Calabash Moon, Magnatune, 2005 ; Heartstrings, Magnatune, 2009. [https://www.youtube.com/watch?v=uRdNBQCjQq8 Video (Daniel Berkman on Gravikord, 1998) ] Jacques Burtin,Le Chant de la Forêt (The Song of the Forest), suite for kora, gravi-kora, flute and viola, Bayard Musique, 2008. [http://vimeo.com/16879519 Video (Gravi-kora improvisation by Jacques Burtin, 2010) ] and Foday Musa Suso, who featured it in recordings with jazz innovator Herbie Hancock,Village Life, Columbia, 1985 ; Jazz Africa, Polydor, 1987. with his band Mandingo, and on Suso's New World Power album.New World Power, produced by Bill Laswell and Foday Musa Suso, Island Records, 1990.\n\nScores \n\nThe kora music being part of the oral tradition, its music was not written until the 20th century. The ethnomusicologists were the only ones to note some traditional airs in the normal grand staff method using the G clef and the F clef.\n\nNowadays, kora scores are written on a single G clef, following the Keur Moussa notation system. This notation system was created for the kora in the late 1970s by Brother Dominique Catta, a monk of the Keur Moussa Monastery (Senegal). The seven low notes that should be written on the F clef are replaced by Arabic or Roman numerals and written on the G clef.\n\nWhile griots still compose in the traditional way (without writing scores), some Western musicians began to write partitures for the kora and adopted the Keur Moussa notation system at the beginning of the 1980s. More than 200 scores have already been written for kora solo or kora and Western instruments. Two notable Western composers for the kora are Brother Dominique CattaSelected scores of Brother Dominique Catta : Banehu Len, Suite n°1 for koras, 1983 ; Fleuves d'Eau Vive, Suite n°2 for koras and chant, 1986; Du Désert, d'ici et d'ailleurs, Airs de kora, 1988 ; Banehu Len II, Suite n°3 for kora and flute, 1990 ; Psautier rythmé de Keur Moussa, 150 Psalms with kora accompaniment, 1996 (all scores published by the Keur Moussa Monastery). The influential Méthode progressive pour airs de kora (Progressive Method for kora learning), by Brother Dominique Catta, was published in 1987 by the Monastery Keur Moussa. and Jacques BurtinSelected scores of Jacques Burtin : Une Rosée de Lumière, Nine pieces for kora, Monastère de Keur Moussa, 1988; Le Chant intérieur / The Inner Song, Pieces and suites for kora, Editions Studio SM, Paris, 1996 ; Joies soudaines, Works for kora 1988-2010, Marie-Chantal Froment Editor, Le Mans, 2010 (France), who wrote most of these scores, though composers like Carole OuelletFour scores of Carole Ouellet have been published in Du Désert, d'ici et d'ailleurs (Monastère de Keur Moussa, 1988). Her other compositions have been recorded along with Brother Catta's works. See discography. (Canada), Brother Grégoire PhilippeQuand renaît le matin, Prelude for 3 koras and a kora player, by Brother Grégoire Philippe, has been published in 1991 by the Monastery of Keur Moussa. (Monastère de Keur Moussa) and Sister Claire Marie LedouxSister Claire Marie Ledoux composed pieces for solo kora and songs accompanied by the kora. They can be heard in the CD Une Rosée de Lumière - Saint François et Sainte Claire d'Assise, by Jacques Burtin and Sister Claire Marie Ledoux, Studio SM, 1997. (France) contributed with original works.\n\nDerek Gripper (Cape Town, South Africa) has transcribed a number of West African kora compositions, by Toumani Diabaté and others, for performance on western-style classical guitar, and has performed some of these transcriptions on two recordings and in concert from 2012 through the present (2017).\n\nBibliography\n\n* Eric Charry, Mande Music : Traditional and Modern Music of the Maninka and Mandinka of Western Africa, University of Chicago Press, 2000.\n* Ousmane Sow Huchard, La kora : objet-témoin de la civilisation manding : essai d'analyse organologique d'une harpe-luth africaine, Presses universitaires de Dakar, Dakar, 2000.\n\nSelected discography \n\nAfrican composers (oral tradition)\n\n* Mali: cordes anciennes (\"Mali: Ancient Strings\"), Sidiki Diabaté and Djelimadi Sissoko, Buda Music, 2000. First published in 1970, this CD was the first album totally devoted to the kora. Sidiki Diabaté was the father of Toumani Diabaté, and Djelimadi Sissoko was the father of Ballaké Sissoko. They both recorded New Ancient Strings - Nouvelles Cordes Anciennes in 1999 (Hannibal), as a tribute to their fathers.\n* Gambie : l'art de la kora, Jali Nyama Suso, edited by Roderic Knight, Ocora, 1996. First published in 1972, this CD is also a historical recording.\n* Jali Kunda - Griots of West Africa & Beyond, Ellipsis Arts, 1996. A book and a CD edited by Foday Musa Suso, produced by Bill Laswell. Photographs by Daniel Lainé. A journey through traditional kora music and three original meetings: kora and piano (\"Spring Waterfall\" by Foday Musa Suso and Philip Glass); kora and synthesizers (\"Lanmbasy Dub'\", with Bill Laswell, bass, and Jeff Bova, synthesizers); kora and saxophone (\"Samma\", a duet with jazz saxophonist Pharoah Sanders).\n* The Mandé Variations, Toumani Diabaté, World Circuit, 2008. Twenty years after his first CD, Kaira (Hannibal, 1988) - the first CD ever recorded with solo kora pieces without any song, Toumani Diabate alternates traditional pieces on a kora with leather rings and his own creations with a special tuning on a kora with wooden pegs.\n\nWestern composers (written music)\n\n* Quand renaît le matin, Abbaye de Keur Moussa, Art et Musique, 2007. First published in 1991, this album gathers pieces composed and performed by Brother Dominique Catta and Carole Ouellet: solo kora pieces, songs with kora accompaniment and a Concerto for flute and three koras. There is also a piece composed by Brother Grégoire for three koras differently tuned played by one musician.\n* Le Jour des Merveilles, Jacques Burtin, 3-CD Box Set, Bayard Musique, 2009. Pieces for solo kora, duets with cello, viola, guitar and koto, suites for flute, guitar and three koras.\n\nNotable kora players\n\n* Toumani Diabaté (Mali)Toumani Diabate web site  - [http://vimeo.com/channels/kora#10038625 Video (Toumani Diabate playing Cantelowes at El Real Acazar, Sevilla, Spain)]\n* Sekou Kouyate (Guinea)\n* Soriba Kouyate (Senegal)\n* Carlinhos Antunes (Brazil)\n* Sidiki Diabaté (Mali)\n* Mamadou Sidiki Diabaté (Mali)\n* Prince Diabaté (Guinea, France, United States)\n* Amadou Bansang Jobarteh (Gambia)\n* Foday Musa Suso (Gambia, United States), recorded with Herbie Hancock\n* Jali Nyama Suso (Gambia)\n* Ablaye Cissoko (Senegal)[http://www.myspace.com/cissokogoetze][http://www.griotmovie.com]\n* Lamine Cissokho (Senegal, Sweden, Austria)\n* Lamin Kuyateh (Gambia)\n* Tasana Camara (Guinea)[http://tasanacamara.blogharbor.com/]\n* Lankandia Cissoko (Senegal)[http://www.iasorecords.com/cissoko-griot.cfm]\n* Zoumana Diarra (Mali)http://www.zoudiarra.com/index_uk.php?land=engels\n* Mamadou Diabaté (Mali)\n* Djeli Moussa Diawara also known as Jali Musa Jawara (Guinea, now playing a 32-stringed Kora)\n* Tunde Jegede (Nigeria/United Kingdom)\n* Sona Jobarteh (Gambia/United Kingdom, female kora player)\n* Sanjally Jobarteh (Gambia/Norway)\n* Seckou Keita (United Kingdom)[http://www.seckoukeita.com]\n* Adam Doughty (United Kingdom) [http://www.thekoraworkshop.co.uk/adam_doughty.html]\n* Josh Doughty (United Kingdom) \n* Bai Konte (Gambia)\n* Djimo Kouyate (Senegal, 1946–2004)\n* Kadialy Kouyaté (Senegal/UK)\n* Kandia Kouyaté (Mali)\n* Moussa Kouyate (Mali)\n* N'Faly Kouyate (Guinea)\n* Toumany Kouyate (Senegal) - singer and musician for O (Cirque du Soleil) in Las Vegas.\n* Jaliba Kuyateh (Gambia)\n* Ida Verstraten (Netherlands)http://www.korafola.com\n* Jacques Burtin (France)Jacques Burtin web site [http://www.jacquesburtin.com] - [http://vimeo.com/7204318 Video (Jacques Burtin playing Ballade de l'île d'Yeu)]\n* Kurtis Lamkin (United States)\n* Brother Dominique Catta (France, Senegal)[http://www.abbaye-keur-moussa.org]\n* Chris Marolf (United States)\n* Kane Mathis (United States)[http://aokora.wordpress.com/about-2/]\n* Sean Gaskell (United States)[http://www.seangaskell.com]\n* Alagi Mbye (Gambia)[http://www.rootsworld.com/africa/mbye.html]\n* William Parker (United States)\n* Justin Perkins (United States)\n* Gabriel Bass  (United States)\n* Lamin Saho (Gambia)[http://www.laminsaho.tk]\n* Ballaké Sissoko (Mali)\n* Mansour Seck (Senegal)\n* Youssoupha Sidibe (Senegal)\n* Yerko Fuenzalida (Chile)[http://www.yerko.info]\n* Mamadou Susso (Gambia)\n* Papa Susso (Gambia)\n* Daniel Berkman (United States)[http://magnatune.com/artists/berkman Daniel Berkman web site]\n* Yann Tambour (as Thee Stranded Horse, Isle of Sark):fr:Yann Tambour\n* [http://coraconnection.com David Gilden] (United States)[http://www.coraconnection.com/pages/DavesBio.html]\n* John Hughes (United States)[http://www.johnhughesarts.com]\n* José Galissa (Portugal)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kora (instrument)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16818" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The kora is a 21-string lute-bridge-harp used extensively in West Africa.[http://www.asza.com/ikora.shtml http://asza.com]\n\nDescription\n\nA kora is a Mandinka harp built from a large calabash cut in half and covered with cow skin to make a resonator with a long hardwood neck. The skin is supported by two handles that run under it.  It  supports a notched double free-standing bridge.  It doesn't fit into any one category of musical instruments, but rather several, and must be classified as a \"double-bridge-harp-lute\". The strings run in two divided ranks, making it a double harp. They do not end in a soundboard but are held in notches on a bridge, making it a bridge harp. They originate from a string arm or neck and cross a bridge directly supported by a resonating chamber, making it a lute too.\n\nThe sound of a kora resembles that of a harp, though when played in the traditional style, it bears a closer resemblance to flamenco and Delta blues guitar techniques of both hands to pluck the strings in polyrhythmic patterns (using the remaining fingers to secure the instrument by holding the hand posts on either side of the strings). Ostinato riffs (\"Kumbengo\") and improvised solo runs (\"Birimintingo\") are played at the same time by skilled players.\n\nKora players have traditionally come from griot families (also from the Mandinka nationalities) who are traditional historians, genealogists and storytellers who pass their skills on to their descendants. The instrument is played in Guinea, Guinea-Bissau, Mali, Senegal, Burkina Faso and the Gambia. A traditional kora player is called a Jali, similar to a \"bard\" or oral historian. Most West African musicians prefer the term \"jali\" to \"griot\", which is the French word.\n\nTraditional koras feature 21 strings, eleven played by the left hand and ten by the right. Modern koras made in the Casamance region of southern Senegal sometimes feature additional bass strings, adding up to four strings to the traditional 21. Strings were traditionally made from thin strips of hide, for example antelope skin - now most strings are made from harp strings or nylon fishing line, sometimes plaited together to create thicker strings.\n\nA vital accessory in the past was the nyenyemo, a leaf-shaped plate of tin or brass with wire loops threaded around the edge. Clamped to the bridge, it produced sympathetic sounds, serving as an amplifier since the sound carried well in the open air. In today's environment players usually prefer or need an electric pickup. http://www.oxfordmusiconline.com/subscriber/article/grove/music/15371?qkora&search\nquick&pos1&_start\n1#firsthit\n\nBy moving leather tuning rings up and down the neck, a kora player can retune the instrument into one of four seven-note scales. These scales are close in tuning to western major, minor and Lydian modes.[http://www.coraconnection.com/pages/TuningKora.html http://www.coraconnection.com/][http://www.thekoraworkshop.co.uk/kora-tuning-help-silaba.html http://www.thekoraworkshop.co.uk/]\n\nHistory\n\nIbn Battuta did mention that the women who accompanied Dugha to perform were carrying bows that they plucked. He didn't mention the number of strings, but this clearly shows the existence of harp instruments in 14th century Mali and could be the earliest written reference to the kora. The kora is designed like a bow with a gourd but Ibn Battuta did not go into detail about these instruments. The earliest European reference to the kora in Western literature is in Travels in Interior Districts of Africa (1799) by the Scottish        \nMungo Park. The most likely scenario, based on Mandinka oral tradition, suggests that the origins of the kora may ultimately be linked with Jali Mady Fouling Cissoko, some time after the founding of Kaabu in the 16th century.[http://perso.orange.fr/laurent.berte/Html/origines2.htm]\n\nThe kora is mentioned in the Senegalese national anthem \"Pincez Tous vos Koras, Frappez les Balafons\".\n\nNowadays, increasingly, koras are made with guitar machine heads instead of the traditional leather rings. The advantage is that they are much easier to tune. The disadvantage is that this design limits the pitch of the instrument because string lengths are more fixed and lighter strings are needed to lift it much more than a tone.  Learning to tune a traditional kora is arguably as difficult as learning to play it, and many tourists who are entranced by the sound while in West Africa buy koras and then find themselves unable to keep it in tune once they are home, relegating it to the status of ornament. Koras can be converted to replace the leather rings with machine heads. Wooden pegs and harp pegs are also used, but both can still cause tuning problems in damper climates unless made with great skill.\n \n\nIn the late 20th century, a 25-string model of the kora was developed, though it has been adopted by only a few players, primarily in the region of Casamance, in southern Senegal. Some kora players such as Seckou Keita have double necked koras, allowing them to switch from one tuning to another within seconds, giving them increased flexibility.\n\nThe French Benedictine monks of the Keur Moussa Abbey in Senegal (who possibly were the first to introduce guitar machine heads instead of leather rings in the late seventies) conceived a method based on scores to teach the instrument. Brother Dominique Catta, choirmaster of the Keur Moussa Abbey,[http://www.abbaye-keur-moussa.org Keur Moussa web site] was the first Western composer who wrote for the kora (solo pieces as well as duets with Western instruments).Lumière Radieuse - Keur Moussa, Art et Musique, 2007; Sénégal, Messe & Chants Au Monastère De Keur Moussa, Arion, 2010.\n\nAn electric instrument modeled on the kora (but made primarily of metal) called the gravikord was invented in the late 20th century by instrument builder and musician Robert Grawi. It has 24 strings but is tuned and played differently than the kora. Another instrument, the Gravi-kora, a 21 string electro-acoustic instrument, was later developed by Robert Grawi especially for kora players who wanted a modern instrument. Its playing and tuning are the same as the traditional kora.The gravi-kora in the Gravikord web site : http://www.gravikord.com/instrument.html#gravikord The gravi-kora has been adopted by kora players such as Daniel Berkman,Calabash Moon, Magnatune, 2005 ; Heartstrings, Magnatune, 2009. [https://www.youtube.com/watch?v=uRdNBQCjQq8 Video (Daniel Berkman on Gravikord, 1998) ] Jacques Burtin,Le Chant de la Forêt (The Song of the Forest), suite for kora, gravi-kora, flute and viola, Bayard Musique, 2008. [http://vimeo.com/16879519 Video (Gravi-kora improvisation by Jacques Burtin, 2010) ] and Foday Musa Suso, who featured it in recordings with jazz innovator Herbie Hancock,Village Life, Columbia, 1985 ; Jazz Africa, Polydor, 1987. with his band Mandingo, and on Suso's New World Power album.New World Power, produced by Bill Laswell and Foday Musa Suso, Island Records, 1990.\n\nScores \n\nThe kora music being part of the oral tradition, its music was not written until the 20th century. The ethnomusicologists were the only ones to note some traditional airs in the normal grand staff method using the G clef and the F clef.\n\nNowadays, kora scores are written on a single G clef, following the Keur Moussa notation system. This notation system was created for the kora in the late 1970s by Brother Dominique Catta, a monk of the Keur Moussa Monastery (Senegal). The seven low notes that should be written on the F clef are replaced by Arabic or Roman numerals and written on the G clef.\n\nWhile griots still compose in the traditional way (without writing scores), some Western musicians began to write partitures for the kora and adopted the Keur Moussa notation system at the beginning of the 1980s. More than 200 scores have already been written for kora solo or kora and Western instruments. Two notable Western composers for the kora are Brother Dominique CattaSelected scores of Brother Dominique Catta : Banehu Len, Suite n°1 for koras, 1983 ; Fleuves d'Eau Vive, Suite n°2 for koras and chant, 1986; Du Désert, d'ici et d'ailleurs, Airs de kora, 1988 ; Banehu Len II, Suite n°3 for kora and flute, 1990 ; Psautier rythmé de Keur Moussa, 150 Psalms with kora accompaniment, 1996 (all scores published by the Keur Moussa Monastery). The influential Méthode progressive pour airs de kora (Progressive Method for kora learning), by Brother Dominique Catta, was published in 1987 by the Monastery Keur Moussa. and Jacques BurtinSelected scores of Jacques Burtin : Une Rosée de Lumière, Nine pieces for kora, Monastère de Keur Moussa, 1988; Le Chant intérieur / The Inner Song, Pieces and suites for kora, Editions Studio SM, Paris, 1996 ; Joies soudaines, Works for kora 1988-2010, Marie-Chantal Froment Editor, Le Mans, 2010 (France), who wrote most of these scores, though composers like Carole OuelletFour scores of Carole Ouellet have been published in Du Désert, d'ici et d'ailleurs (Monastère de Keur Moussa, 1988). Her other compositions have been recorded along with Brother Catta's works. See discography. (Canada), Brother Grégoire PhilippeQuand renaît le matin, Prelude for 3 koras and a kora player, by Brother Grégoire Philippe, has been published in 1991 by the Monastery of Keur Moussa. (Monastère de Keur Moussa) and Sister Claire Marie LedouxSister Claire Marie Ledoux composed pieces for solo kora and songs accompanied by the kora. They can be heard in the CD Une Rosée de Lumière - Saint François et Sainte Claire d'Assise, by Jacques Burtin and Sister Claire Marie Ledoux, Studio SM, 1997. (France) contributed with original works.\n\nDerek Gripper (Cape Town, South Africa) has transcribed a number of West African kora compositions, by Toumani Diabaté and others, for performance on western-style classical guitar, and has performed some of these transcriptions on two recordings and in concert from 2012 through the present (2017).\n\nBibliography\n\n* Eric Charry, Mande Music : Traditional and Modern Music of the Maninka and Mandinka of Western Africa, University of Chicago Press, 2000.\n* Ousmane Sow Huchard, La kora : objet-témoin de la civilisation manding : essai d'analyse organologique d'une harpe-luth africaine, Presses universitaires de Dakar, Dakar, 2000.\n\nSelected discography \n\nAfrican composers (oral tradition)\n\n* Mali: cordes anciennes (\"Mali: Ancient Strings\"), Sidiki Diabaté and Djelimadi Sissoko, Buda Music, 2000. First published in 1970, this CD was the first album totally devoted to the kora. Sidiki Diabaté was the father of Toumani Diabaté, and Djelimadi Sissoko was the father of Ballaké Sissoko. They both recorded New Ancient Strings - Nouvelles Cordes Anciennes in 1999 (Hannibal), as a tribute to their fathers.\n* Gambie : l'art de la kora, Jali Nyama Suso, edited by Roderic Knight, Ocora, 1996. First published in 1972, this CD is also a historical recording.\n* Jali Kunda - Griots of West Africa & Beyond, Ellipsis Arts, 1996. A book and a CD edited by Foday Musa Suso, produced by Bill Laswell. Photographs by Daniel Lainé. A journey through traditional kora music and three original meetings: kora and piano (\"Spring Waterfall\" by Foday Musa Suso and Philip Glass); kora and synthesizers (\"Lanmbasy Dub'\", with Bill Laswell, bass, and Jeff Bova, synthesizers); kora and saxophone (\"Samma\", a duet with jazz saxophonist Pharoah Sanders).\n* The Mandé Variations, Toumani Diabaté, World Circuit, 2008. Twenty years after his first CD, Kaira (Hannibal, 1988) - the first CD ever recorded with solo kora pieces without any song, Toumani Diabate alternates traditional pieces on a kora with leather rings and his own creations with a special tuning on a kora with wooden pegs.\n\nWestern composers (written music)\n\n* Quand renaît le matin, Abbaye de Keur Moussa, Art et Musique, 2007. First published in 1991, this album gathers pieces composed and performed by Brother Dominique Catta and Carole Ouellet: solo kora pieces, songs with kora accompaniment and a Concerto for flute and three koras. There is also a piece composed by Brother Grégoire for three koras differently tuned played by one musician.\n* Le Jour des Merveilles, Jacques Burtin, 3-CD Box Set, Bayard Musique, 2009. Pieces for solo kora, duets with cello, viola, guitar and koto, suites for flute, guitar and three koras.\n\nNotable kora players\n\n* Toumani Diabaté (Mali)Toumani Diabate web site  - [http://vimeo.com/channels/kora#10038625 Video (Toumani Diabate playing Cantelowes at El Real Acazar, Sevilla, Spain)]\n* Sekou Kouyate (Guinea)\n* Soriba Kouyate (Senegal)\n* Carlinhos Antunes (Brazil)\n* Sidiki Diabaté (Mali)\n* Mamadou Sidiki Diabaté (Mali)\n* Prince Diabaté (Guinea, France, United States)\n* Amadou Bansang Jobarteh (Gambia)\n* Foday Musa Suso (Gambia, United States), recorded with Herbie Hancock\n* Jali Nyama Suso (Gambia)\n* Ablaye Cissoko (Senegal)[http://www.myspace.com/cissokogoetze][http://www.griotmovie.com]\n* Lamine Cissokho (Senegal, Sweden, Austria)\n* Lamin Kuyateh (Gambia)\n* Tasana Camara (Guinea)[http://tasanacamara.blogharbor.com/]\n* Lankandia Cissoko (Senegal)[http://www.iasorecords.com/cissoko-griot.cfm]\n* Zoumana Diarra (Mali)http://www.zoudiarra.com/index_uk.php?land=engels\n* Mamadou Diabaté (Mali)\n* Djeli Moussa Diawara also known as Jali Musa Jawara (Guinea, now playing a 32-stringed Kora)\n* Tunde Jegede (Nigeria/United Kingdom)\n* Sona Jobarteh (Gambia/United Kingdom, female kora player)\n* Sanjally Jobarteh (Gambia/Norway)\n* Seckou Keita (United Kingdom)[http://www.seckoukeita.com]\n* Adam Doughty (United Kingdom) [http://www.thekoraworkshop.co.uk/adam_doughty.html]\n* Josh Doughty (United Kingdom) \n* Bai Konte (Gambia)\n* Djimo Kouyate (Senegal, 1946–2004)\n* Kadialy Kouyaté (Senegal/UK)\n* Kandia Kouyaté (Mali)\n* Moussa Kouyate (Mali)\n* N'Faly Kouyate (Guinea)\n* Toumany Kouyate (Senegal) - singer and musician for O (Cirque du Soleil) in Las Vegas.\n* Jaliba Kuyateh (Gambia)\n* Ida Verstraten (Netherlands)http://www.korafola.com\n* Jacques Burtin (France)Jacques Burtin web site [http://www.jacquesburtin.com] - [http://vimeo.com/7204318 Video (Jacques Burtin playing Ballade de l'île d'Yeu)]\n* Kurtis Lamkin (United States)\n* Brother Dominique Catta (France, Senegal)[http://www.abbaye-keur-moussa.org]\n* Chris Marolf (United States)\n* Kane Mathis (United States)[http://aokora.wordpress.com/about-2/]\n* Sean Gaskell (United States)[http://www.seangaskell.com]\n* Alagi Mbye (Gambia)[http://www.rootsworld.com/africa/mbye.html]\n* William Parker (United States)\n* Justin Perkins (United States)\n* Gabriel Bass  (United States)\n* Lamin Saho (Gambia)[http://www.laminsaho.tk]\n* Ballaké Sissoko (Mali)\n* Mansour Seck (Senegal)\n* Youssoupha Sidibe (Senegal)\n* Yerko Fuenzalida (Chile)[http://www.yerko.info]\n* Mamadou Susso (Gambia)\n* Papa Susso (Gambia)\n* Daniel Berkman (United States)[http://magnatune.com/artists/berkman Daniel Berkman web site]\n* Yann Tambour (as Thee Stranded Horse, Isle of Sark):fr:Yann Tambour\n* [http://coraconnection.com David Gilden] (United States)[http://www.coraconnection.com/pages/DavesBio.html]\n* John Hughes (United States)[http://www.johnhughesarts.com]\n* José Galissa (Portugal). Kora (instrument). http://en.wikipedia.org/?curid=16818."
  }
}
