{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5163",
  "eid" : "d26a21e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778432766,
  "textBody" : "The World Factbook (; also known as the CIA World Factbook) is a reference resource produced by the Central Intelligence Agency (CIA) with almanac-style information about the countries of the world. The official print version is available from the National Technical Information Service and the Government Printing Office. Other companies—such as Skyhorse Publishing—also print a paper edition. The Factbook is available in the form of a website that is partially updated every week. It is also available for download for use off-line. It provides a two- to three-page summary of the demographics, geography, communications, government, economy, and military of each of 267 international entities including U.S.-recognized countries, dependencies, and other areas in the world.\n\nThe World Factbook is prepared by the CIA for the use of U.S. government officials, and its style, format, coverage, and content are primarily designed to meet their requirements. However, it is frequently used as a resource for academic research papers and news articles. As a work of the U.S. government, it is in the public domain in the United States.\n\nSources \n\nIn researching the Factbook, the CIA uses the sources listed below. Other public and private sources are also consulted.\n\n*Antarctic Information Program (National Science Foundation)\n*Armed Forces Medical Intelligence Center (Department of Defense)\n*Bureau of the Census (Department of Commerce)\n*Bureau of Labor Statistics (Department of Labor)\n*Council of Managers of National Antarctic Programs\n*Defense Intelligence Agency (Department of Defense)\n*Department of Energy\n*Department of State\n*Fish and Wildlife Service (Department of the Interior)\n*Maritime Administration (Department of Transportation)\n*National Geospatial-Intelligence Agency (Department of Defense)\n*Naval Facilities Engineering Command (Department of Defense)\n*Office of Insular Affairs (Department of the Interior)\n*Office of Naval Intelligence (Department of Defense)\n*Oil & Gas Journal\n*United States Board on Geographic Names (Department of the Interior)\n*United States Transportation Command (Department of Defense)\n\nCopyright \n\nBecause the Factbook is in the public domain, people are free under United States law to redistribute it or parts of it in any way that they like, without permission of the CIA. However, the CIA requests that it be cited when the Factbook is used. Copying the official seal of the CIA without permission is prohibited by U.S. federal law—specifically, the Central Intelligence Agency Act of 1949 ().\n\nFrequency of updates and availability \n\nBefore November 2001 The World Factbook website was updated yearly; from 2004 to 2010 it was updated every two weeks; since 2010 it has been updated weekly. Generally, information currently available as of January 1 of the current year is used in preparing the Factbook.\n\nGovernment edition of the Factbook \n\nThe first, classified, edition of Factbook was published in August 1962, and the first unclassified version in June 1971. The World Factbook was first available to the public in print in 1975. In 2008 the CIA discontinued printing the Factbook themselves, instead turning printing responsibilities over to the Government Printing Office. This happened due to a CIA decision to \"focus Factbook resources\" on the online edition. The Factbook has been on the World Wide Web since October 1994.Miller, Jill Young. \"CIA puts data on the internet.\"  Fort Lauderdale Sun-Sentinel 12 December 1994. The web version gets an average of 6 million visits per month; it can also be downloaded. The official printed version is sold by the Government Printing Office and National Technical Information Service.  In past years, the Factbook was available on CD-ROM, microfiche, magnetic tape, and floppy disk.\n\nReprints and older editions online \n\nMany Internet sites use information and images from the CIA World Factbook. Several publishers, including Grand River Books, Potomac Books (formerly known as Brassey's Inc.), and Skyhorse Publishing have re-published the Factbook in recent years.\n\nEntities listed \n\nAs of July 2011, The World Factbook consists of 267 entities. These entities can be divided into categories. They are:\n\n; Independent countries: This category has independent countries, which the CIA defines as people \"politically organized into a sovereign state with a definite territory\". In this category, there are 195 entities.\n; Others: The Other category is a list of other places set apart from the list of independent countries. Currently there are two: Taiwan and the European Union.\n; Dependencies and Areas of Special Sovereignty: This category is a list of places affiliated with another country. They may be subdivided into categories using the country they are affiliated with:\n*Australia: six entities\n*China: two entities\n*Denmark: two entities\n*France: eight entities\n*Netherlands: three entities\n*New Zealand: three entities\n*Norway: three entities\n*United Kingdom: seventeen entities\n*United States: fourteen entities\n; Miscellaneous: This category is for Antarctica and places in dispute. There are six entities.\n; Other entities: This category is for the World and the oceans. There are five oceans and the World (the World entry is intended as a summary of the other entries).\n\nTerritorial issues and controversies \n\nPolitical \n\n; Areas not covered\nSpecific regions within a country or areas in dispute among countries, such as Kashmir, are not covered, but other areas of the world whose status is disputed, such as the Spratly Islands, have entries. Subnational areas of countries (such as U.S. states or the Canadian provinces and territories) are not included in the Factbook. Instead, users looking for information about subnational areas are referred to \"a comprehensive encyclopedia\" for their reference needs. This criterion was invoked in the 2007 and 2011 (Archived by WebCite at\nhttps://www.webcitation.org/5xpDpGjbr) editions with the decision to drop the entries for French Guiana, Guadeloupe, Martinique, Mayotte, and Reunion. They were dropped because besides being overseas departments, they were now overseas regions, and an integral part of France.\n\n; Kashmir\nMaps depicting Kashmir have the Indo-Pakistani border drawn at the Line of Control, but the region of Kashmir administered by China drawn in hash marks.\n\n; Northern Cyprus\nNorthern Cyprus, which the U.S. considers part of the Republic of Cyprus, is not given a separate entry because \"territorial occupations/annexations not recognized by the United States Government are not shown on U.S. Government maps.\"\n\n; Taiwan/Republic of China\nThe name \"Republic of China\" is not listed as Taiwan's official name under the \"Government\" section,  due to U.S. acknowledgement of Beijing's One-China policy according to which there is one China and Taiwan is a part of it. The name \"Republic of China\" was briefly added on January 27, 2005, but has since been changed back to \"none\". Of the Factbooks two maps of China, one highlights the island of Taiwan highlighted as part of the country while the other does not. (See also: Political status of Taiwan, Legal status of Taiwan)\n\n; Disputed South China Sea Islands\nThe Paracel Islands and Spratly Islands, subjects of territorial disputes, have entries in the Factbook where they are not listed as the territory of any one nation. The disputed claims to the islands are discussed in the entries.\n\n; Burma/Myanmar\nThe U.S. does not recognize the renaming of Burma by its ruling military junta to Myanmar and thus keeps its entry for the country under the Burma name.\n\n; Republic of Macedonia\nThe Republic of Macedonia is entered as Macedonia, the name used in its first entry in the Factbook upon independence in 1992. In the 1994 edition, the name of the entry was changed to the Former Yugoslav Republic of Macedonia, as it is recognised by the United Nations (pending resolution of the Macedonia naming dispute). For the next decade, this was the name the nation was listed under. Finally, in the 2004 edition of the Factbook, the name of the entry was changed back to Macedonia, following a November 2004 U.S. decision to refer to the country using this name.\n\n; European Union\nOn December 16, 2004, the CIA added an entry for the European Union (EU) for the first time. The \"What's New\" section of the 2005 Factbook states: \"The European Union continues to accrue more nation-like characteristics for itself and so a separate listing was deemed appropriate.\"\n\n; United States Pacific Island Wildlife Refuges and Iles Eparses\nIn the 2006 edition of The World Factbook, the entries for Baker Island, Howland Island, Jarvis Island, Kingman Reef, Johnston Atoll, Palmyra Atoll and the Midway Islands were merged into a new United States Pacific Island Wildlife Refuges entry. The old entries for each individual insular area remain as redirects on the Factbook website.For an example of a redirect, see what happens with the [https://web.archive.org/web/20060407074318/http://www.cia.gov/cia/publications/factbook/geos/kq.html profile] for Kingman Reef. On September 7, 2006, the CIA also merged the entries for Bassas da India, Europa Island, the Glorioso Islands, Juan de Nova Island, and Tromelin Island into a new  Iles Eparses entry. As with the new United States Pacific Island Wildlife Refuges entry, the old entries for these five islands remained as redirects on the website.For an example of a redirect, see what happens with the [http://www.umsl.edu/services/govdocs/wofact2007/geos/ju.html profile] for Juan de Nova Island (mirror). On July 19, 2007, the Iles Eparses entry and redirects for each island were dropped due to the group becoming a district of the French Southern and Antarctic Lands in February.\n\n; Serbia and Montenegro/Yugoslavia\nThe Socialist Federal Republic of Yugoslavia (SFRY) broke apart in 1991. The following year, it was replaced in the Factbook with entries for each of its former constituent republics. In doing this, the CIA listed the Federal Republic of Yugoslavia (FRY), proclaimed in 1992, as Serbia and Montenegro, as the U.S. did not recognize the union between the two republics. This was done in accordance with a May 21, 1992, decision by the U.S. not to recognize any of the former Yugoslav republics as successor states to the recently dissolved SFRY.\n\nThese views were made clear in a disclaimer printed in the Factbook: \"Serbia and Montenegro have asserted the formation of a joint independent state, but this entity has not been recognized as a state by the United States.\" Montenegro and Serbia were treated separately in the Factbook data, as can be seen on the map.For an example, see the profile for the FRY in the [https://web.archive.org/web/19991109042835/http://www.cia.gov/cia/publications/factbook/sr.html 1999 World Factbook]. In October 2000, Slobodan Milošević was forced out of office after a disputed election. This event led to democratic elections and U.S. diplomatic recognition. The 2001 edition of the Factbook thus referred to the state as Yugoslavia. On March 14, 2002, an agreement was signed to transform the FRY into a loose state union called Serbia and Montenegro; it took effect on February 4, 2003. The name of the Yugoslavia entity was altered in the Factbook the month after the change.\n\n; Kosovo\nOn February 28, 2008, the CIA added an entry for Kosovo, which declared independence on February 17 of the same year. Before this, Kosovo was excluded in the Factbook. Kosovo is the subject of a territorial dispute; Serbia continues to claim Kosovo as part of its own sovereign territory. Kosovo's independence has been  out of  United Nations member states, including the United States.\n\n; East Timor/Timor-Leste\nOn July 19, 2007, the entry for East Timor was renamed Timor-Leste following a decision of the United States Board on Geographic Names (BGN).\n\nFactual \n\nThe Factbook is full of usually minor errors, inaccuracies, and out-of-date information, which are often repeated elsewhere due to the Factbooks widespread use as a reference. For example, Albania was until recently, described in the Factbook as 70% Muslim, 20% Eastern Orthodox, and 10% Roman Catholic, which was based on a survey conducted in 1939, before World War II; numerous surveys conducted since the fall of the Communist regime since 1990 have given quite different figures. Another example is Singapore, which the Factbook states has a total fertility rate of 0.78 children per woman, despite figures in Statistics Singapore which state that the rate has been about 1.2–1.3 children per woman for at least the past several years, and it is unclear when, or even whether, it ever dropped as low as 0.78.[http://www.singstat.gov.sg/statistics/latest_data.html#14 Statistics Singapore – Latest Data]. Singstat.gov.sg. Retrieved on 2014-04-28. This low and inaccurate value then gets cited in news articles which state that Singapore has the world's lowest fertility, or at least use the figure for its shock value. Another serious problem is that the Factbook never cites its sources, making verification of the information it presents difficult if not impossible.\n\nIn June 2009, National Public Radio (NPR), relying on information obtained from the CIA World Factbook, put the number of Israeli Jews living in settlements in the West Bank and Israeli-annexed East Jerusalem at 250,000. However, a better estimate, based on State Department and Israeli sources put the figure at about 500,000. NPR then issued a correction. Chuck Holmes, foreign editor for NPR Digital, said, \"I'm surprised and displeased, and it makes me wonder what other information is out-of-date or incorrect in the CIA World Factbook.\"\n\nScholars have acknowledged that some entries in the Factbook are out of date.Richard Collin & Pamela L. Martin. [https://books.google.com/books?id-vSlx-_Z408C&pg\nPA41#vonepage&q&f\nfalse An Introduction to World Politics: Conflict and Consensus on a Small Planet] (Rowman & Littlefield, 2013), p. 41.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "The World Factbook" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5163" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The World Factbook (; also known as the CIA World Factbook) is a reference resource produced by the Central Intelligence Agency (CIA) with almanac-style information about the countries of the world. The official print version is available from the National Technical Information Service and the Government Printing Office. Other companies—such as Skyhorse Publishing—also print a paper edition. The Factbook is available in the form of a website that is partially updated every week. It is also available for download for use off-line. It provides a two- to three-page summary of the demographics, geography, communications, government, economy, and military of each of 267 international entities including U.S.-recognized countries, dependencies, and other areas in the world.\n\nThe World Factbook is prepared by the CIA for the use of U.S. government officials, and its style, format, coverage, and content are primarily designed to meet their requirements. However, it is frequently used as a resource for academic research papers and news articles. As a work of the U.S. government, it is in the public domain in the United States.\n\nSources \n\nIn researching the Factbook, the CIA uses the sources listed below. Other public and private sources are also consulted.\n\n*Antarctic Information Program (National Science Foundation)\n*Armed Forces Medical Intelligence Center (Department of Defense)\n*Bureau of the Census (Department of Commerce)\n*Bureau of Labor Statistics (Department of Labor)\n*Council of Managers of National Antarctic Programs\n*Defense Intelligence Agency (Department of Defense)\n*Department of Energy\n*Department of State\n*Fish and Wildlife Service (Department of the Interior)\n*Maritime Administration (Department of Transportation)\n*National Geospatial-Intelligence Agency (Department of Defense)\n*Naval Facilities Engineering Command (Department of Defense)\n*Office of Insular Affairs (Department of the Interior)\n*Office of Naval Intelligence (Department of Defense)\n*Oil & Gas Journal\n*United States Board on Geographic Names (Department of the Interior)\n*United States Transportation Command (Department of Defense)\n\nCopyright \n\nBecause the Factbook is in the public domain, people are free under United States law to redistribute it or parts of it in any way that they like, without permission of the CIA. However, the CIA requests that it be cited when the Factbook is used. Copying the official seal of the CIA without permission is prohibited by U.S. federal law—specifically, the Central Intelligence Agency Act of 1949 ().\n\nFrequency of updates and availability \n\nBefore November 2001 The World Factbook website was updated yearly; from 2004 to 2010 it was updated every two weeks; since 2010 it has been updated weekly. Generally, information currently available as of January 1 of the current year is used in preparing the Factbook.\n\nGovernment edition of the Factbook \n\nThe first, classified, edition of Factbook was published in August 1962, and the first unclassified version in June 1971. The World Factbook was first available to the public in print in 1975. In 2008 the CIA discontinued printing the Factbook themselves, instead turning printing responsibilities over to the Government Printing Office. This happened due to a CIA decision to \"focus Factbook resources\" on the online edition. The Factbook has been on the World Wide Web since October 1994.Miller, Jill Young. \"CIA puts data on the internet.\"  Fort Lauderdale Sun-Sentinel 12 December 1994. The web version gets an average of 6 million visits per month; it can also be downloaded. The official printed version is sold by the Government Printing Office and National Technical Information Service.  In past years, the Factbook was available on CD-ROM, microfiche, magnetic tape, and floppy disk.\n\nReprints and older editions online \n\nMany Internet sites use information and images from the CIA World Factbook. Several publishers, including Grand River Books, Potomac Books (formerly known as Brassey's Inc.), and Skyhorse Publishing have re-published the Factbook in recent years.\n\nEntities listed \n\nAs of July 2011, The World Factbook consists of 267 entities. These entities can be divided into categories. They are:\n\n; Independent countries: This category has independent countries, which the CIA defines as people \"politically organized into a sovereign state with a definite territory\". In this category, there are 195 entities.\n; Others: The Other category is a list of other places set apart from the list of independent countries. Currently there are two: Taiwan and the European Union.\n; Dependencies and Areas of Special Sovereignty: This category is a list of places affiliated with another country. They may be subdivided into categories using the country they are affiliated with:\n*Australia: six entities\n*China: two entities\n*Denmark: two entities\n*France: eight entities\n*Netherlands: three entities\n*New Zealand: three entities\n*Norway: three entities\n*United Kingdom: seventeen entities\n*United States: fourteen entities\n; Miscellaneous: This category is for Antarctica and places in dispute. There are six entities.\n; Other entities: This category is for the World and the oceans. There are five oceans and the World (the World entry is intended as a summary of the other entries).\n\nTerritorial issues and controversies \n\nPolitical \n\n; Areas not covered\nSpecific regions within a country or areas in dispute among countries, such as Kashmir, are not covered, but other areas of the world whose status is disputed, such as the Spratly Islands, have entries. Subnational areas of countries (such as U.S. states or the Canadian provinces and territories) are not included in the Factbook. Instead, users looking for information about subnational areas are referred to \"a comprehensive encyclopedia\" for their reference needs. This criterion was invoked in the 2007 and 2011 (Archived by WebCite at\nhttps://www.webcitation.org/5xpDpGjbr) editions with the decision to drop the entries for French Guiana, Guadeloupe, Martinique, Mayotte, and Reunion. They were dropped because besides being overseas departments, they were now overseas regions, and an integral part of France.\n\n; Kashmir\nMaps depicting Kashmir have the Indo-Pakistani border drawn at the Line of Control, but the region of Kashmir administered by China drawn in hash marks.\n\n; Northern Cyprus\nNorthern Cyprus, which the U.S. considers part of the Republic of Cyprus, is not given a separate entry because \"territorial occupations/annexations not recognized by the United States Government are not shown on U.S. Government maps.\"\n\n; Taiwan/Republic of China\nThe name \"Republic of China\" is not listed as Taiwan's official name under the \"Government\" section,  due to U.S. acknowledgement of Beijing's One-China policy according to which there is one China and Taiwan is a part of it. The name \"Republic of China\" was briefly added on January 27, 2005, but has since been changed back to \"none\". Of the Factbooks two maps of China, one highlights the island of Taiwan highlighted as part of the country while the other does not. (See also: Political status of Taiwan, Legal status of Taiwan)\n\n; Disputed South China Sea Islands\nThe Paracel Islands and Spratly Islands, subjects of territorial disputes, have entries in the Factbook where they are not listed as the territory of any one nation. The disputed claims to the islands are discussed in the entries.\n\n; Burma/Myanmar\nThe U.S. does not recognize the renaming of Burma by its ruling military junta to Myanmar and thus keeps its entry for the country under the Burma name.\n\n; Republic of Macedonia\nThe Republic of Macedonia is entered as Macedonia, the name used in its first entry in the Factbook upon independence in 1992. In the 1994 edition, the name of the entry was changed to the Former Yugoslav Republic of Macedonia, as it is recognised by the United Nations (pending resolution of the Macedonia naming dispute). For the next decade, this was the name the nation was listed under. Finally, in the 2004 edition of the Factbook, the name of the entry was changed back to Macedonia, following a November 2004 U.S. decision to refer to the country using this name.\n\n; European Union\nOn December 16, 2004, the CIA added an entry for the European Union (EU) for the first time. The \"What's New\" section of the 2005 Factbook states: \"The European Union continues to accrue more nation-like characteristics for itself and so a separate listing was deemed appropriate.\"\n\n; United States Pacific Island Wildlife Refuges and Iles Eparses\nIn the 2006 edition of The World Factbook, the entries for Baker Island, Howland Island, Jarvis Island, Kingman Reef, Johnston Atoll, Palmyra Atoll and the Midway Islands were merged into a new United States Pacific Island Wildlife Refuges entry. The old entries for each individual insular area remain as redirects on the Factbook website.For an example of a redirect, see what happens with the [https://web.archive.org/web/20060407074318/http://www.cia.gov/cia/publications/factbook/geos/kq.html profile] for Kingman Reef. On September 7, 2006, the CIA also merged the entries for Bassas da India, Europa Island, the Glorioso Islands, Juan de Nova Island, and Tromelin Island into a new  Iles Eparses entry. As with the new United States Pacific Island Wildlife Refuges entry, the old entries for these five islands remained as redirects on the website.For an example of a redirect, see what happens with the [http://www.umsl.edu/services/govdocs/wofact2007/geos/ju.html profile] for Juan de Nova Island (mirror). On July 19, 2007, the Iles Eparses entry and redirects for each island were dropped due to the group becoming a district of the French Southern and Antarctic Lands in February.\n\n; Serbia and Montenegro/Yugoslavia\nThe Socialist Federal Republic of Yugoslavia (SFRY) broke apart in 1991. The following year, it was replaced in the Factbook with entries for each of its former constituent republics. In doing this, the CIA listed the Federal Republic of Yugoslavia (FRY), proclaimed in 1992, as Serbia and Montenegro, as the U.S. did not recognize the union between the two republics. This was done in accordance with a May 21, 1992, decision by the U.S. not to recognize any of the former Yugoslav republics as successor states to the recently dissolved SFRY.\n\nThese views were made clear in a disclaimer printed in the Factbook: \"Serbia and Montenegro have asserted the formation of a joint independent state, but this entity has not been recognized as a state by the United States.\" Montenegro and Serbia were treated separately in the Factbook data, as can be seen on the map.For an example, see the profile for the FRY in the [https://web.archive.org/web/19991109042835/http://www.cia.gov/cia/publications/factbook/sr.html 1999 World Factbook]. In October 2000, Slobodan Milošević was forced out of office after a disputed election. This event led to democratic elections and U.S. diplomatic recognition. The 2001 edition of the Factbook thus referred to the state as Yugoslavia. On March 14, 2002, an agreement was signed to transform the FRY into a loose state union called Serbia and Montenegro; it took effect on February 4, 2003. The name of the Yugoslavia entity was altered in the Factbook the month after the change.\n\n; Kosovo\nOn February 28, 2008, the CIA added an entry for Kosovo, which declared independence on February 17 of the same year. Before this, Kosovo was excluded in the Factbook. Kosovo is the subject of a territorial dispute; Serbia continues to claim Kosovo as part of its own sovereign territory. Kosovo's independence has been  out of  United Nations member states, including the United States.\n\n; East Timor/Timor-Leste\nOn July 19, 2007, the entry for East Timor was renamed Timor-Leste following a decision of the United States Board on Geographic Names (BGN).\n\nFactual \n\nThe Factbook is full of usually minor errors, inaccuracies, and out-of-date information, which are often repeated elsewhere due to the Factbooks widespread use as a reference. For example, Albania was until recently, described in the Factbook as 70% Muslim, 20% Eastern Orthodox, and 10% Roman Catholic, which was based on a survey conducted in 1939, before World War II; numerous surveys conducted since the fall of the Communist regime since 1990 have given quite different figures. Another example is Singapore, which the Factbook states has a total fertility rate of 0.78 children per woman, despite figures in Statistics Singapore which state that the rate has been about 1.2–1.3 children per woman for at least the past several years, and it is unclear when, or even whether, it ever dropped as low as 0.78.[http://www.singstat.gov.sg/statistics/latest_data.html#14 Statistics Singapore – Latest Data]. Singstat.gov.sg. Retrieved on 2014-04-28. This low and inaccurate value then gets cited in news articles which state that Singapore has the world's lowest fertility, or at least use the figure for its shock value. Another serious problem is that the Factbook never cites its sources, making verification of the information it presents difficult if not impossible.\n\nIn June 2009, National Public Radio (NPR), relying on information obtained from the CIA World Factbook, put the number of Israeli Jews living in settlements in the West Bank and Israeli-annexed East Jerusalem at 250,000. However, a better estimate, based on State Department and Israeli sources put the figure at about 500,000. NPR then issued a correction. Chuck Holmes, foreign editor for NPR Digital, said, \"I'm surprised and displeased, and it makes me wonder what other information is out-of-date or incorrect in the CIA World Factbook.\"\n\nScholars have acknowledged that some entries in the Factbook are out of date.Richard Collin & Pamela L. Martin. [https://books.google.com/books?id-vSlx-_Z408C&pg\nPA41#vonepage&q&f\nfalse An Introduction to World Politics: Conflict and Consensus on a Small Planet] (Rowman & Littlefield, 2013), p. 41. The World Factbook. http://en.wikipedia.org/?curid=5163."
  }
}
