{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11719",
  "eid" : "fd5e8800-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778504832,
  "textBody" : "The Grumman F-14 Tomcat is an American supersonic, twin-engine, two-seat, variable-sweep wing fighter aircraft. The Tomcat was developed for the United States Navy's Naval Fighter Experimental (VFX) program after the collapse of the F-111B project. The F-14 was the first of the American teen-series fighters, which were designed incorporating air combat experience against MiG fighters during the Vietnam War.\n\nThe F-14 first flew in December 1970 and made its first deployment in 1974 with the U.S. Navy aboard , replacing the McDonnell Douglas F-4 Phantom II. The F-14 served as the U.S. Navy's primary maritime air superiority fighter, fleet defense interceptor, and tactical aerial reconnaissance platform into the 1990s. The Low Altitude Navigation and Targeting Infrared for Night (LANTIRN) pod system were added in the 1990s and the Tomcat began performing precision ground-attack missions.\n\nIn the 1980s F-14s were used as land-based interceptors by the Islamic Republic of Iran Air Force during the Iran–Iraq War, where they saw combat against Iraqi warplanes. Iranian F-14s reportedly shot down at least 160 Iraqi aircraft during the war, while only 12 to 16 Tomcats were lost; at least half of these losses were due to accidents.Cooper, Tom and Farzad Bishop. Iranian F-14 Tomcat Units in Combat, p. 84. Oxford: Osprey Publishing, 2004. .\n\nThe Tomcat was retired from the U.S. Navy's active fleet on 22 September 2006, having been supplanted by the Boeing F/A-18E/F Super Hornet.[http://www.foxnews.com/story/0,2933,215219,00.html \"Navy's 'Top Gun' Tomcat Fighter Jet Makes Ceremonial Final Flight.\"] Associated Press, 22 September 2006. Retrieved: 17 July 2008. The F-14 remains in service with the Iranian Air Force, having been exported to Iran in 1976.\n\nDevelopment\n\nBackground\n\nBeginning in the late 1950s, the U.S. Navy sought a long-range, high-endurance interceptor to defend its carrier battle groups against long-range anti-ship missiles launched from the jet bombers and submarines of the Soviet Union. The U.S. Navy needed a Fleet Air Defense (FAD) aircraft with a more powerful radar and longer range missiles than the F-4 Phantom II carried to intercept both enemy bombers and missiles.Thomason 1998, pp. 3–5. The Navy was directed to participate in the Tactical Fighter Experimental (TFX) program with the U.S. Air Force by Secretary of Defense Robert McNamara. McNamara wanted \"joint\" solutions to service aircraft needs to reduce development costs, and had already directed the Air Force to buy the F-4 Phantom II, which was developed for the Navy and Marine Corps.Dwyer, Larry. [http://www.aviation-history.com/mcdonnell/f4.html \"The McDonnell F-4 Phantom II.\"] aviation-history.com, 31 March 2010. Retrieved: 24 March 2012. The Navy strenuously opposed the TFX as it feared compromises necessary for the Air Force's need for a low-level attack aircraft would adversely impact the aircraft's performance as a fighter.\n\nWeight and performance issues plagued the U.S. Navy F-111B variant for TFX and would not be resolved to the Navy's satisfaction. The F-111 manufacturer General Dynamics partnered with Grumman on the Navy F-111B. With the F-111B program in distress, Grumman began studying improvements and alternatives. In 1966, the Navy awarded Grumman a contract to begin studying advanced fighter designs. Grumman narrowed down these designs to its 303 design.Spick 2000, pp. 71–72.  Vice Admiral Thomas F. Connolly, Deputy Chief of Naval Operations for Air Warfare, took the developmental F-111A variant for a flight and discovered that it had difficulty going supersonic and had poor carrier landing characteristics. He later testified before Congress about his concerns against the official Department of the Navy position and, in May 1968, Congress stopped funding for the F-111B, allowing the Navy to pursue an answer tailored to its requirements.Thomas. Robert Mcg. Jr: [https://www.nytimes.com/1996/06/09/us/thomas-connolly-86-top-gun-admiral-dies.html Thomas Connolly, 86, Top-Gun Admiral, Dies], New York Times, 9 June 1996. The name \"Tomcat\" was partially chosen to pay tribute to Admiral Connolly, as the nickname \"Tom's Cat\" had already been widely used by the manufacturer, although the name also followed the Grumman tradition of naming its fighter aircraft after felines.Marrett 2006, p. 18.\n\nVFX\n\nThe F-111B had been designed for the long-range Fleet Air Defense (FAD) interceptor role, but not for new requirements for air combat based on the experience of American aircraft against agile MiG fighters over Vietnam. The Navy studied the need for VFAX, an additional fighter that was more agile than the F-4 Phantom for air-combat and ground-attack roles.Spangenberg, George. [https://web.archive.org/web/20120204215346/http://www.georgespangenberg.com/vf15.htm \"Spangenberg Fighter Study Dilemma.\"] georgespangenberg.com. Retrieved: 24 March 2012. Grumman continued work on its 303 design and offered it to the Navy in 1967, which led to fighter studies by the Navy. The company continued to refine the design into 1968.\n\nIn July 1968, the Naval Air Systems Command (NAVAIR) issued a request for proposals (RFP) for the Naval Fighter Experimental (VFX) program. VFX called for a tandem two-seat, twin-engined air-to-air fighter with a maximum speed of Mach 2.2.  It would also have a built-in M61 Vulcan cannon and a secondary close air support role. The VFX's air-to-air missiles would be either six AIM-54 Phoenix or a combination of six AIM-7 Sparrow and four AIM-9 Sidewinder missiles. Bids were received from General Dynamics, Grumman, Ling-Temco-Vought, McDonnell Douglas and North American Rockwell;Spick 1985, pp. 9–10. four bids incorporated variable-geometry wings.Woolridge, Capt. E.T., ed. Into the Jet Age: Conflict and Change in Naval Aviation 1945–1975, an Oral History. Annapolis, Maryland: Naval Institute Press, 1995. .\n\nMcDonnell Douglas and Grumman were selected as finalists in December 1968. Grumman was selected for the contract award in January 1969.Spick 2000, p. 74.  Grumman's design reused the TF30 engines from the F-111B, though the Navy planned on replacing them with the Pratt & Whitney F401-400 engines under development for the Navy, along with the related Pratt & Whitney F100 for the USAF.Spick 2000, p. 112. Though lighter than the F-111B, it was still the largest and heaviest U.S. fighter to fly from an aircraft carrier, a consequence of the requirement to carry the large AWG-9 radar and AIM-54 Phoenix missiles (from the F-111B) and an internal fuel load of 16000 lb.Gunston and Spick 1983, p. 112.\n\nUpon winning the contract for the F-14, Grumman greatly expanded its Calverton, Long Island, New York facility for evaluating the aircraft. Much of the testing, including the first of many compressor stalls and multiple ejections, took place over Long Island Sound. In order to save time and forestall interference from Secretary McNamara, the Navy skipped the prototype phase and jumped directly to full-scale development; the Air Force took a similar approach with its F-15.Jenkins, Dennis R. F/A-18 Hornet: A Navy Success Story. New York: McGraw-Hill, 2000. . The F-14 first flew on 21 December 1970, just 22 months after Grumman was awarded the contract, and reached initial operational capability (IOC) in 1973. The United States Marine Corps was initially interested in the F-14 as an F-4 Phantom II replacement; going so far as to send officers to Fighter Squadron One Twenty-Four (VF-124) to train as instructors. The Marine Corps pulled out of any procurement when the development of the stores' management system for ground attack munitions was not pursued. An air-to-ground capability was not developed until the 1990s.\n\nFiring trials involved launches against simulated targets of various types, from cruise missiles to high-flying bombers. AIM-54 Phoenix missile testing from the F-14 began in April 1972.  The longest single Phoenix launch was successful against a target at a range of 110 nmi in April 1973. Another unusual test was made on 22 November 1973, when six missiles were fired within 38 seconds at Mach 0.78 and 24800 ft; four scored direct hits.Spick 2000, pp. 110–111.\n\nImprovements and changes\n\nWith time, the early versions of all the missiles were replaced by more advanced versions, especially with the move to full solid-state electronics that allowed better reliability, better ECCM and more space for the rocket engine. So the early arrangement of the AIM-54A Phoenix active-radar air-to-air missile, the AIM-7E-2 Sparrow Semi-active radar homing air-to-air missile, and the AIM-9J Sidewinder heat-seeking air-to-air missile was replaced in the 1980s with the B (1983) and C (1986) version of the Phoenix, the F (1977), M (1982), P (1987 or later) for Sparrows, and with the Sidewinder, L (1979) and M (1982). Within these versions, there are several improved batches (for example, Phoenix AIM-54C++).\n\nThe Tactical Airborne Reconnaissance Pod System (TARPS) was developed in the late 1970s for the F-14. Approximately 65 F-14As and all F-14Ds were modified to carry the pod. TARPS was primarily controlled by the Radar Intercept Officer (RIO) via an extra display for observing reconnaissance data. The \"TARPS Digital (TARPS-DI)\" was a 1996 upgrade featuring a digital camera. The digital camera was further updated beginning in 1998 with the \"TARPS Completely Digital (TARPS-CD)\" configuration that also provided real-time transmission of imagery.\n\nSome of the F-14A aircraft underwent engine upgrades to the GE F110-400 in 1987. These upgraded Tomcats were redesignated F-14A+, which was later changed to F-14B in 1991.Anft, Torsent. [http://www.anft.net/f-14/f14-serial.htm \"F-14 Bureau Numbers.\"] Home of M.A.T.S. Retrieved: 30 September 2006. The F-14D variant was developed at the same time; it included the GE F110-400 engines with newer digital avionics systems such as a glass cockpit, and compatibility with the Link 16 secure datalink.Friedman, Norman. \"F-14.\" The Naval Institute Guide to World Naval Weapon Systems, Fifth edition. Annapolis MD: Naval Institute Press, 2006. . The Digital Flight Control System (DFCS) notably improved the F-14's handling qualities when flying at a high angle of attack or in air combat maneuvering.[http://www.globalsecurity.org/military/systems/aircraft/f-14-upgrades.htm \"F-14 upgrades.\"] globalsecurity.org. Retrieved: 24 March 2012.\n\nWhile the F-14 had been developed as a lightweight alternative to the 80000 lb F-111B, the F-14 was still the heaviest and most expensive fighter of its time. VFAX was revived in the 1970s as a lower cost solution to replacing the Navy and Marine Corps's fleets of F-4s, and A-7s. VFAX was directed to review the fighters in the USAF Light Weight Fighter competition, which led to the development of the F/A-18 Hornet as roughly a midsize fighter and attack aircraft.  In 1994, Congress would reject Grumman proposals to the Navy to upgrade the Tomcat beyond the D model (such as the Super Tomcat 21, the cheaper QuickStrike version, and the more advanced Attack Super Tomcat 21).Donald 2004, pp. 13, 15.\n\nGround attack upgrades\n\nIn the 1990s, with the pending retirement of the A-6 Intruder, the F-14 air-to-ground program was resurrected. Trials with live bombs had been carried out in the 1980s; the F-14 was cleared to use basic iron bombs in 1992. In Operation Desert Storm, most air-to-ground missions were left to A-7, A-6 Intruder and F/A-18 Hornet squadrons, while the F-14 focused on air defense operations. Following Desert Storm, F-14As and F-14Bs underwent upgrades to avionics and cockpit displays to enable the use of precision munitions, enhance defensive systems, and apply structural improvements. The new avionics were comparable with the F-14D; upgraded aircraft were designated F-14A (Upgrade) and F-14B (Upgrade) respectively.Donald, David. \"Northrop Grumman F-14 Tomcat, U.S. Navy today\". Warplanes of the Fleet. London: AIRtime Publishing Inc, 2004. .\n\nBy 1994, Grumman and the Navy were proposing ambitious plans for Tomcat upgrades to plug the gap between the retirement of the A-6 and the F/A-18E/F Super Hornet entering service. However, the upgrades would have taken too long to implement to meet the gap, and were priced in the billions; Congress considered this too expensive for an interim solution. A quick, inexpensive upgrade using the Low Altitude Navigation and Targeting Infrared for Night (LANTIRN) targeting pod was devised. The LANTIRN pod provided the F-14 with a forward-looking infrared (FLIR) camera for night operations and a laser target designator to direct laser-guided bombs (LGB).Gobel, Greg. [https://web.archive.org/web/20070214074428/http://www.vectorsite.net/avtomcat_2.html#m1#m1 \"Bombcat / Tomcat In Service 1992:2005\".] Vectorsite.net, 1 November 2006. Retrieved: 8 December 2009. Although LANTIRN is traditionally a two-pod system, an AN/AAQ-13 navigation pod with terrain-following radar and a wide-angle FLIR, along with an AN/AAQ-14 targeting pod with a steerable FLIR and a laser target designator, the decision was made to only use the targeting pod. The Tomcat's LANTIRN pod was altered and improved over the baseline configuration, such as a Global Positioning System / Inertial Navigation System (GPS-INS) capability to allow an F-14 to accurately locate itself. The pod was carried on the right wing glove pylon.\n\nThe LANTIRN pod did not require changes to the F-14's own system software, but the pod was designed to operate on a MIL-STD-1553B bus not present on the F-14A or B.  Consequently, Martin Marietta specially developed an interface card for LANTIRN. The Radar Intercept Officer (RIO) would receive pod imagery on a 10-inch Programmable Tactical Information Display (PTID) or another Multi-Function Display in the F-14Pike, John. [http://www.globalsecurity.org/military/systems/aircraft/f-14-design.htm \"F-14 Tomcat Systems.\"] GlobalSecurity.org. Retrieved: 19 December 2010.[http://www.globalsecurity.org/military/library/policy/navy/ntsp/f-14-a.htm \"Approved Navy Training System Plan for the F-14A, F-14B, and F-14D Aircraft (N88-NTSP-A-50-8511B/A)\"]. globalsecurity.org rear cockpit and guided LGBs using a new hand controller installed on the right side console. Initially, the hand controller replaced the RIO's TARPS control panel, meaning a Tomcat configured for LANTIRN could not carry TARPS and the reverse, but eventually a workaround was later developed to allow a Tomcat to carry LANTIRN or TARPS as needed.\n\nAn upgraded LANTIRN named \"LANTIRN 40K\" for operations up to 40000 ft was introduced in 2001, followed by Tomcat Tactical Targeting (T3) and Fast Tactical Imagery (FTI), to provide precise target coordinate determination and ability to transmit images in-flight. Tomcats also added the ability to carry the GBU-38 Joint Direct Attack Munition (JDAM) in 2003, giving it the option of a variety of LGB and GPS-guided weapons. Some F-14Ds were upgraded in 2005 with a ROVER III Full Motion Video (FMV) downlink, a system that transmits real-time images from the aircraft's sensors to the laptop of Forward Air Controller (FAC) on the ground.\n\nDesign\n\nOverview\n\nThe F-14 Tomcat was designed as both an air superiority fighter and a long-range naval interceptor,Spangenberg, George. [https://web.archive.org/web/20120204214816/http://www.georgespangenberg.com/vf1.htm \"Brief History and Background of the F-14, 1955–1970.\"] George Spangenberg Oral History. Retrieved: 23 December 2009.Spangenberg, George.[https://web.archive.org/web/20120204215330/http://www.georgespangenberg.com/vf2.htm \"Exhibit VF-2.\"] George Spangenberg Oral History, 8 February 1965. Retrieved: 23 December 2009.Spangenberg, George. [https://web.archive.org/web/20120206140205/http://www.georgespangenberg.com/vf10.htm \"Statement of Mr. G.A. Spangenberg before the Senate Armed Services Subcommittee, June 1973.\"] George Spangenberg Oral History. Retrieved: 23 December 2009. which enabled it to both serve as escort attack aircraft when armed with Sparrow missiles and fleet air defense loitering interceptor role when armed with Phoenix missiles. The F-14 was designed with a two-seat cockpit with a bubble canopy which affords all-around visibility aiding aircrew in air-to-air combat. It features variable geometry wings that swing automatically during flight. For high-speed intercept, they are swept back and they swing forward for lower speed flight. It was designed to improve on the F-4 Phantom's air combat performance in most respects.\n\nThe F-14's fuselage and wings allow it to climb faster than the F-4, while the twin-tail arrangement offers better stability. The F-14 is equipped with an internal 20 mm M61 Vulcan Gatling cannon mounted on the left side (unlike the Phantom, which was not equipped with an internal gun in the US Navy), and can carry AIM-54 Phoenix, AIM-7 Sparrow, and AIM-9 Sidewinder anti-aircraft missiles. The twin engines are housed in widely spaced nacelles. The flat area of the fuselage between the nacelles is used to contain fuel and avionics systems, such as the wing-sweep mechanism and flight controls, as well as weaponry since the wings were not used for carrying ordnance. By itself, the fuselage provides approximately 40 to 60 percent of the F-14's aerodynamic lifting surface depending on the wing sweep position.Pike, John. [http://www.globalsecurity.org/military/systems/aircraft/f-14-design.htm \"F-14 Tomcat Design.\"] GlobalSecurity.org. Retrieved: 5 April 2012. The lifting body characteristics of the fuselage allowed one F-14 to safely land after suffering a mid-air collision that sheared off more than half of the plane's right wing in 1991.Leone, Dario. [http://theaviationist.com/2013/11/06/f-14-damaged/ \"F-14 Tomcat could land on carrier with missing radome, damaged wing\"] theaviationist.com. Retrieved: 10 March 2016\n\nVariable-geometry wings and aerodynamic design\n\nThe F-14's wing sweep can be varied between 20° and 68° in flight,Dorr 1991, p. 50. and can be automatically controlled by the Central Air Data Computer, which maintains wing sweep at the optimum lift-to-drag ratio as the Mach number varies; pilots can manually override the system if desired. When parked, the wings can be \"overswept\" to 75° to overlap the horizontal stabilizers to save deck space aboard carriers. In an emergency, the F-14 can land with the wings fully swept to 68°, although this presents a significant safety hazard due to greatly increased stall speed. Such an aircraft would typically be diverted from an aircraft carrier to a land base if an incident did occur. The F-14 has flown safely with an asymmetrical wing-sweep during testing, and was deemed able to land aboard a carrier if needed in an emergency.[http://www.f-14association.com/tales/the-story-of-f-14a-aircraft-no-3-buno-157982.html \"F-14A, Aircraft No. 3, BuNo. 157982.\"] F-14 Association. Retrieved: 10 March 2016. The wing pivot points were significantly spaced far apart. This had two benefits. The first was that weaponry could be fitted on a pylon on the fixed wing glove, liberating the wings from having swiveling pylons fitted, a feature which had proven to add significant drag on the F-111B. Since less of the total lifting area was variable, the centre of lift moved less as the wings moved reducing trim drag at high speed. When the wing was swept back, its thickness-to-chord-ratio decreased which allowed the aircraft to satisfy the mach 2.4 top speed required by the U.S. Navy. The body of the aircraft contributed significantly to overall lift and so the Tomcat possessed a lower wing loading than its wing area would suggest. When carrying four Phoenix missiles or other heavy stores between the engines this advantage was lost and maneuverability was reduced in those configurations.\n\nAilerons are not fitted, with roll control being provided by wing-mounted spoilers at low speed (which are disabled if the sweep angle exceeds 57°), and by differential operation of the all-moving tailerons at high speed. Full-span slats and flaps are used to increase lift both for landing and combat, with slats being set at 17° for landing and 7° for combat, while flaps are set at 35° for landing and 10° for combat. An air bag filled up the space occupied by the swept-back wing when the wing was in the forward position and a flexible fairing on top of the wing smoothed out the shape transition between the fuselage and top wing area. The twin tail layout helps in maneuvers at high angle of attack (AoA) while reducing the height of the aircraft to fit within the limited roof clearance of hangars aboard aircraft carriers.\nTwo triangular shaped retractable surfaces, called glove vanes, were originally mounted in the forward part of the wing glove, and could be automatically extended by the flight control system at high Mach numbers. They were used to generate additional lift (force) ahead of the aircraft's center of gravity, thus helping to compensate for mach tuck at supersonic speeds. Automatically deployed at above Mach 1.4, they allowed the F-14 to pull 7.5 g at Mach 2 and could be manually extended with wings swept full aft. They were later disabled, however, owing to their additional weight and complexity. The air brakes consist of top-and-bottom extendable surfaces at the rearmost portion of the fuselage, between the engine nacelles. The bottom surface is split into left and right halves, the tailhook hangs between the two halves, an arrangement sometimes called the \"castor tail\".Sgarlato 1988, pp. 40–46.\n\nEngines and structure\n\nThe F-14 was initially equipped with two Pratt & Whitney TF30 (or JTF10A) augmented turbofan engines, each rated at 20,900 lb (93 kN) of thrust, which enabled the aircraft to attain a maximum speed of Mach 2.34. The F-14 would normally fly at a cruising speed for reduced fuel consumption, which was important for conducting lengthy patrol missions.Laurence K. Loftin, Jr. [http://www.hq.nasa.gov/pao/History/SP-468/ch10-3.htm \"Part II: The Jet Age, Chapter 10: Technology of the Jet Airplane, Turbojet and Turbofan Systems.\"] Quest for Performance: The Evolution of Modern Aircraft, 29 February 2009. Retrieved: 29 January 2009. Both of the engine's rectangular air intake ramps were equipped with movable ramps and bleed doors to meet the airflow requirements of the engine but prevent dangerous shockwaves from entering. De Laval nozzles were also fitted to the engine's exhaust.\n\nThe performance of the TF30 engine became an object of criticism. John Lehman, Secretary of the Navy in the 1980s, told the U.S. Congress that the TF30/F-14 combination was \"probably the worst engine/airframe mismatch we have had in years\" and that the TF30 was \"a terrible engine\"; 28% of all F-14 accidents were attributed to the engine. A high frequency of turbine blade failures led to the reinforcement of the entire engine bay to limit damage from such failures. The engines also had proved to be extremely prone to compressor stalls, which could easily result in loss of control, severe yaw oscillations, and could lead to an unrecoverable flat spin. At specific altitudes, exhaust produced by missile launches could cause an engine compressor stall.  This led to the development of a bleed system that temporarily blocks the frontal intake ramp and reduces engine power during missile launch. With the TF30, the F-14's overall thrust-to-weight ratio at maximum takeoff weight is around 0.56, considerably less than the F-15A's ratio of 0.85; when fitted with the General Electric F110 engine, an improved thrust-to-weight ratio of 0.73 at maximum weight and 0.88 at normal takeoff weight was achieved.Spick 2000, p. 81. Despite having large differences in thrust, the F-14A, F-14B, and later F-14D with the newer GE F-110 engines were rated at the same top speed.NATOPS F-14B/F-14D flight manuals\n\nThe wings had a two-spar structure with integral fuel tanks. Around 25% of the structure is made of titanium, including the wing box, wing pivots, and upper and lower wing skins;Baugher, Joe. [http://www.joebaugher.com/navy_fighters/f14_2.html \"Grumman F-14A Tomcat.\"] Joe Baugher's Encyclopedia of American Military Aircraft, 13 February 2000. Retrieved: 6 May 2010. this is a light, rigid, and strong material and electron beam welding was used in the construction of the titanium parts.\n\nThe landing gear was very robust, in order to withstand catapult launches (takeoffs) and recoveries (landings) needed for carrier operations. It comprised a double nosewheel and widely spaced single main wheels. There were no hardpoints on the sweeping parts of the wings, and so all the armament is fitted on the belly between the air intake ramps and on pylons under the wing gloves.  Internal fuel capacity is 2400 gal: 290 gal in each wing, 690 gal in a series of tanks aft of the cockpit, and a further 457 gal in two feeder tanks. It can carry two 267 gal external drop tanks under the engine intake ramps. There is also an air-to-air refueling probe, which folds into the starboard nose.[http://www.globalsecurity.org/military/library/policy/navy/nrtc/14313.htm \"NAVEDTRA No: 14313, Aviation Ordanceman.\"] globalsecurity.org. Retrieved: 8 April 2011.\n\nAvionics and flight controls\n\nThe cockpit has two seats, arranged in tandem, outfitted with Martin-Baker GRU-7A rocket-propelled ejection seats, rated from zero altitude and zero airspeed up to 450 knots.Dorr 1991, p. 51. The canopy is spacious, and fitted with four mirrors to effectively provide all-round visibility. Only the pilot has flight controls; the flight instruments themselves are of a hybrid analog-digital nature. The cockpit also features a head-up display (HUD) to show primarily navigational information; several other avionics systems such as communications and direction-finders are integrated into the AWG-9 radar's display. A significant feature of the F-14 was its Central Air Data Computer (CADC), designed by Garrett AiResearch, that formed the onboard integrated flight control system. It used a MOSFET-based Large-Scale Integration chipset, the MP944, making it the first microprocessor in history.Holt, Ray M. [http://firstmicroprocessor.com/ \"The F-14A 'Tom Cat' Microprocessor.\"] firstmicroprocessor.com, 23 February 2009. Retrieved: 8 December 2009.\n\nThe aircraft's large nose contains a two-person crew and several bulky avionics systems. The main element is the Hughes AN/AWG-9 X band radar; the antenna is a 36 in-wide planar array, and has integrated Identification friend or foe antennas. The AWG-9 has several search and tracking modes, such as Track while scan (TWS), Range-While-Search (RWS), Pulse-Doppler Single-Target Track (PDSTT), and Jam Angle Track (JAT); a maximum of 24 targets can be tracked simultaneously, and six can be engaged in TWS mode up to around 60 mi. Cruise missiles are also possible targets with the AWG-9, which can lock onto and track small objects even at low altitude when in Pulse-Doppler mode. For the F-14D, the AWG-9 was replaced by the upgraded APG-71 radar.  The Joint Tactical Information Distribution System (JTIDS)/Link 16 for data communications was added later on.[http://www.rand.org/pubs/monograph_reports/MR1235.html \"Interoperability: A Continuing Challenge in Coalition Air Operations.\"] RAND Monograph Report. pp. 108, 111. Retrieved: 16 November 2010.\n\nThe F-14 also features electronic countermeasures (ECM) and radar warning receiver (RWR) systems, chaff/flare dispensers, fighter-to-fighter data link, and a precise inertial navigation system. The early navigation system was inertial-based, point-of-origin coordinates were programmed into a navigation computer and gyroscopes would track the aircraft's every motion to calculate distance and direction from that starting point. Global Positioning System later was integrated to provide more precise navigation and redundancy in case either system failed. The chaff/flare dispensers were located on the underside of the fuselage and on the tail. The RWR system consisted of several antennas on the aircraft's fuselage, which could roughly calculate both direction and distance of enemy radar users; it could also differentiate between search radar, tracking radar, and missile-homing radar.[http://www.fas.org/man/dod-101/sys/ac/equip/an-alr-67.htm \"AN/ALR-67(V)3 Advanced Special Receiver.\"] Federation of American Scientists. Retrieved: 29 December 2009.\n\nFeatured in the sensor suite was the AN/ALR-23, an Infra-red search and track sensor using indium antimonide detectors, mounted under the nose; however this was replaced by an optical system, Northrop's AAX-1, also designated TCS (TV Camera Set). The AAX-1 helped pilots visually identify and track aircraft, up to a range of 60 mi for large aircraft. The radar and the AAX-1 were linked, allowing the one detector to follow the direction of the other. A dual infrared/optical detection system was adopted on the later F-14D.\n\nArmament\n\nThe F-14 was designed to combat highly maneuverable aircraft as well as the Soviet anti-ship cruise missile and bomber (Tupolev Tu-16, Tupolev Tu-22, Tupolev Tu-22M) threats. The Tomcat was to be a platform for the AIM-54 Phoenix, but unlike the canceled F-111B, it could also engage medium- and short-range threats with other weapons. The F-14 was an air superiority fighter, not just a long-range interceptor aircraft.  Over 6700 kg of stores could be carried for combat missions on several hardpoints under the fuselage and under the wings. Commonly, this meant a maximum of two–four Phoenixes or Sparrows on the belly stations, two Phoenixes/Sparrows on the wing hardpoints, and two Sidewinders on the wing hardpoints. The F-14 was also fitted with an internal 20 mm M61 Vulcan Gatling-type cannon.\n\nOperationally, the capability to hold up to six Phoenix missiles was never used, although early testing was conducted; there was never a threat requirement to engage six hostile targets simultaneously and the load was too heavy to safely recover aboard an aircraft carrier in the event that the missiles were not fired. During the height of Cold War operations in the late 1970s and 1980s, the typical weapon loadout on carrier-deployed F-14s was usually only one AIM-54 Phoenix, augmented by two AIM-9 Sidewinders, two AIM-7 Sparrow IIIs, a full loadout of 20 mm ammunition and two drop tanks. The Phoenix missile was used twice in combat by the U.S. Navy, both over Iraq in 1999,Rausa, Zeno. [https://web.archive.org/web/20090405151051/http://findarticles.com/p/articles/mi_qa3834/is_199907/ai_n8861814/pg_4/ Vinson/CVW-11 \"Vinson/CVW-11 report.\"] Wings of Gold, Summer 1999. Retrieved: 8 December 2009.Holmes 2005, pp. 16, 17. but the missiles did not score any kills.\n\nIran made use of the Phoenix system, claiming several kills with it during the 1980–1988 Iran–Iraq War.  Iran tried to use other missiles on the Tomcat.  It attempted to integrate the Russian R-27R \"Alamo\" BVR missile, but was apparently unsuccessful.\n\nOperational history\n\nUnited States Navy\n\nThe F-14 began replacing the F-4 Phantom II in U.S. Navy service starting in September 1974 with squadrons VF-1 \"Wolfpack\" and VF-2 \"Bounty Hunters\" aboard  and participated in the American withdrawal from Saigon. The F-14 had its first kills in U.S. Navy service on 19 August 1981 over the Gulf of Sidra in what is known as the Gulf of Sidra incident. In that engagement, two F-14s from VF-41 Black Aces were engaged by two Libyan Su-22 \"Fitters\". The F-14s evaded the short range heat seeking AA-2 \"Atoll\" missile and returned fire, downing both Libyan aircraft. U.S. Navy F-14s once again were pitted against Libyan aircraft on 4 January 1989, when two F-14s from VF-32 shot down two Libyan MiG-23 \"Floggers\" over the Gulf of Sidra in a second Gulf of Sidra incident.\n\nIts first sustained combat use was as a photo reconnaissance platform. The Tomcat was selected to inherit the reconnaissance mission upon the departure of the dedicated RA-5C Vigilante and RF-8G Crusaders from the fleet. A large pod called the Tactical Airborne Reconnaissance Pod System (TARPS) was developed and fielded on the Tomcat in 1981. With the retirement of the last RF-8G Crusaders in 1982, TARPS F-14s became the U.S. Navy's primary tactical reconnaissance system.Baugher, Joe. [http://www.joebaugher.com/navy_fighters/f14_7.html \"TARPS Pod for F-14.\"] F-14 Tomcat, 13 February 2000. Retrieved: 6 May 2010. One of two Tomcat squadrons per airwing was designated as a TARPS unit and received 3 TARPS capable aircraft and training for 4 TARPS aircrews.\n\nWhile the Tomcat was being used by Iran in combat against Iraq in its intended air superiority mission in the early 1980s, the U.S. Navy found itself flying regular daily combat missions over Lebanon to photograph activity in the Bekaa Valley. At the time, the Tomcat had been thought too large and vulnerable to be used over land, but the need for imagery was so great that Tomcat aircrews developed high-speed medium altitude tactics to deal with considerable AAA and SA-7 SAM threat in the Bekaa area. The first exposure of a Navy Tomcat to an SA-2 missile was over Somalia in April 1983 when a local battery was unaware of two Tomcats scheduled for a TARPS mission in a prelude to an upcoming international exercise in the vicinity of Berbera. An SA-2 was fired at the second Tomcat while conducting 10,000-ft mapping profile at max conserve setting. The Tomcat aircrews spotted the missile launch and dove for the deck thereby evading it without damage. The unexpected demand for combat TARPS laid the way for high altitude sensors such as the KA-93 Long Range Optics (LOROP) to be rapidly procured for the Tomcat as well as an Expanded Chaff Adapter (ECA) to be incorporated in an AIM-54 Phoenix Rail. Commercial \"Fuzz buster\" type radar detectors were also procured and mounted in pairs in the forward cockpit as a stop gap solution to detect SAM radars such as the SA-6. The ultimate solution was an upgrade to the ALR-67 then being developed, but it would not be ready until the advent of the F-14A+ later in the 1980s.\n\nThe participation of the F-14 in the 1991 Operation Desert Storm consisted of Combat Air Patrol (CAP) over the Red Sea and the Persian Gulf and overland missions consisting of strike escort and reconnaissance. Until the waning days of Desert Storm, in-country air superiority was tasked to USAF F-15 Eagles due to the way the Air Tasking Orders (ATO) delegated primary overland CAP stations to the F-15 Eagle. The governing Rules of Engagement (ROE) also dictated a strict Identification Friend or Foe (IFF) requirement when employing Beyond Visual Range weapons such as the AIM-7 Sparrow and particularly the AIM-54 Phoenix. This hampered the Tomcat from using its most powerful weapon. Furthermore, the powerful emissions from the AWG-9 radar are detectable at great range with a radar warning receiver. Iraqi fighters routinely retreated as soon as the Tomcats \"lit them up\" with the AWG-9.Gillcrest 1994, p. 168.[http://www.simhq.com/_air/fixedwing_archive/Snodgrass.zip \"Capt. Dale \"Snort\" Snodgrass, USN (Ret.) Interview by John Sponauer\"]. (30 August 2000). SimHQ. Retrieved: 26 November 2010. The U.S. Navy suffered its only F-14 loss from enemy action on 21 January 1991 when BuNo 161430, an F-14A upgraded to an F-14A+, from VF-103 was shot down by an SA-2 surface-to-air missile while on an escort mission near Al Asad airbase in Iraq. Both crews survived ejection with the pilot being rescued by USAF Special Operation Forces and the RIO being captured by Iraqi troops as a POW until the end of the war.Baugher, Joe. [http://www.joebaugher.com/navy_serials/thirdseries21.html \"F-14.\"] U.S. Navy and U.S. Marine Corps BuNos, 30 September 2006. Retrieved: 6 May 2010. The F-14 also achieved its final kill in US service, a Mi-8 \"Hip\" helicopter, with an AIM-9 Sidewinder.\n\nIn 1995, F-14s from VF-14 and VF-41 participated in Operation Deliberate Force as well as Operation Allied Force in 1999, and in 1998, VF-32 and VF-213 participated in Operation Desert Fox. On 15 February 2001, the Joint Direct Attack Munition or JDAM was added to the Tomcat's arsenal. On 7 October 2001, F-14s would lead some of the first strikes into Afghanistan marking the start of Operation Enduring Freedom and the first F-14 drop of a JDAM occurred on 11 March 2002. F-14s from VF-2, VF-31, VF-32, VF-154, and VF-213 would also participate in Operation Iraqi Freedom. The F-14Ds of VF-2, VF-31, and VF-213 obtained JDAM capability in March 2003.[http://www.news.navy.mil/search/display.asp?story_id\n6431 \"U.S. Navy's F-14D Tomcats Gain JDAM Capability.\"]  Navy Newsstand (United States Navy), 21 March 2003. Retrieved: 20 January 2007. On 10 December 2005, the F-14Ds of VF-31 and VF-213 were upgraded with a ROVER III downlink for transmitting images to a ground Forward Air Controller (FAC).[http://www.news.navy.mil/search/display.asp?story_id\n21377 \"ROVER System Revolutionizes F-14's Ground Support Capability.\"]  Navy Newsstand (United States Navy), 14 December 2005. Retrieved: 20 January 2007.  The Navy decided to retire the F-14 with the F/A-18E/F Super Hornet filling the roles of fleet defense and strike formerly filled by the F-14.\n\nThe last American F-14 combat mission was completed on 8 February 2006, when a pair of Tomcats landed aboard  after one dropped a bomb over Iraq. During their final deployment with Theodore Roosevelt, VF-31 and VF-213 collectively completed 1,163 combat sorties totaling 6,876 flight hours, and dropped 9500 lb of ordnance during reconnaissance, surveillance, and close air support missions in support of Operation Iraqi Freedom.Murphy, Stephen. [http://www.news.navy.mil/search/display.asp?story_id22325 \"TR Traps Last Tomcat from Combat Mission.\"]  Navy Newsstand, 15 February 2006. Retrieved: 20 January 2007. USS Theodore Roosevelt launched an F-14D, of VF-31, for the last time on 28 July 2006; piloted by Lt. Blake Coleman and Lt. Cmdr Dave Lauderbaugh as RIO.[http://www.navy.mil/view_single.asp?id\n37561 \"Final launch of the F-14 Tomcat.\"] navy.mil. Retrieved: 8 December 2009. The last two F-14 squadrons, the VF-31 Tomcatters, and the VF-213 Black Lions conducted their last fly-in at Naval Air Station Oceana on 10 March 2006.[http://www.news.navy.mil/search/display.asp?story_id=22637 \"Squadron Homecoming Marks End of Era for Tomcats\".]  U.S. Navy, 10 March 2006. Retrieved: 20 January 2007.\n\nThe official final flight retirement ceremony was on 22 September 2006 at Naval Air Station Oceana and was flown by Lt. Cmdr. Chris Richard and Lt. Mike Petronis as RIO in a backup F-14 after the primary aircraft experienced mechanical problems.Tiernan, Bill. [http://content.hamptonroads.com/story.cfm?story\n111479&ran132499 \"F-14's Final Flight.\"]  Virginian-Pilot, 23 September 2006.Vanden Brook, Tom. [https://www.usatoday.com/news/nation/2006-09-22-F14-tomcat_x.htm \"Navy retires F-14, the Coolest of Cold Warriors\".] USA Today, 22 September 2006. Retrieved: 20 January 2007. The actual last flight of an F-14 in U.S. service took place 4 October 2006, when an F-14D of VF-31 was ferried from NAS Oceana to Republic Airport on Long Island, New York. The remaining intact F-14 aircraft in the U.S. were flown to and stored at the 309th Aerospace Maintenance and Regeneration Group \"Boneyard\", at Davis-Monthan Air Force Base, Arizona; in 2007 the U.S. Navy announced plans to shred the remaining F-14s to prevent any components from being acquired by Iran.[http://deseretnews.com/dn/view/0,1249,680195918,00.html \"Pentagon shreds F-14s to keep parts from enemies.\"] AP, 2 July 2007. Retrieved: 8 December 2009. In August 2009, the 309th AMARG stated that the last aircraft were taken to HVF West, Tucson, Arizona for shredding. At that time only 11 F-14s remained in desert storage.\n\nIran\n\nThe sole foreign customer for the Tomcat was the Imperial Iranian Air Force, during the reign of the last Shah (King) of Iran, Mohammad Reza Pahlavi. In the early 1970s, the Imperial Iranian Air Force (IIAF) was searching for an advanced fighter, specifically one capable of intercepting Soviet MiG-25 reconnaissance flights. After a visit of U.S. President Richard Nixon to Iran in 1972, during which Iran was offered the latest in American military technology, the IIAF narrowed its choice between the F-14 Tomcat or the McDonnell Douglas F-15 Eagle. Grumman Corporation arranged a competitive demonstration of the Eagle against the Tomcat before the Shah, and in January 1974, Iran ordered 30 F-14s and 424 AIM-54 Phoenix missiles, initiating Project Persian King, worth US$300 million. A few months later, this order was increased to a total of 80 Tomcats and 714 Phoenix missiles as well as spare parts and replacement engines for 10 years, complete armament package, and support infrastructure (including construction of the Khatami Air Base near Isfahan).\n\nThe first F-14 arrived in January 1976, modified only by the removal of classified avionics components, but fitted with the TF-30-414 engines. The following year 12 more were delivered. Meanwhile, training of the first groups of Iranian crews by the U.S. Navy was underway in the US; one of these conducted a successful shoot-down with a Phoenix missile of a target drone flying at 50000 ft.\n\nFollowing the overthrow of the Shah in 1979, the air force was renamed the Islamic Republic of Iran Air Force (IRIAF) and the post-revolution interim government of Iran canceled most Western arms orders. In 1980, an Iranian F-14 shot down an Iraqi Mil Mi-25 helicopter for its first air-to-air kill during the Iran–Iraq War (1980–1988).Cooper, Tom. [http://www.airspacemag.com/military-aviation/persiancats.html Persian Cats: How Iranian air crews, cut off from U.S. technical support, used the F-14 against Iraqi attackers.\"] Air & Space Magazine, November 2006. Retrieved: 24 March 2012. According to research by Tom Cooper, Iranian F-14s scored at least 50 air-to-air victories in the first six months of the war against Iraqi MiG-21s, MiG-23s, and some Su-20s/22s. During the same period, only one Iranian F-14 suffered damage after being hit by a nearby MiG-21 when it exploded.\n\nIranian Tomcats were originally used as an early-warning platform assisting other less-sophisticated aircraft with targeting and defense. They were also crucial to the defense of areas deemed vital by the Iranian government, such as oil terminals on Kharg Island and industrial infrastructure in the capital Tehran. Many of these patrols had the support of Boeing 707-3J9C in-flight refueling tankers. As fighting escalated between 1982 and 1986, the F-14s gradually became more involved in the battle. They performed well, but their primary role was to intimidate the Iraqi Air Force and avoid heavy engagement to protect the fleet's numbers. Their presence was often enough to drive away opposing Iraqi fighters. The precision and effectiveness of the Tomcat's AWG-9 weapons system and AIM-54A Phoenix long-range air-to-air missiles enabled the F-14 to maintain air superiority.\n\nBy 1987, the Iraqis had suffered heavy losses and were forced to find a solution to level the battlefield. They obtained Mirage F.1EQ-6 fighters from France in 1988, armed with Super530D and Magic Mk.2 air-to-air missiles. The Mirage F.1 fighters were eventually responsible for three confirmed F-14 kills. The IRIAF attempted to keep 60 F-14s operational throughout the war, but reports indicate this number was reduced to 30 by 1986 with only half fully mission-capable.Cooper, Tom and Farzad Bishop. Iranian F-14 Tomcat Units in Combat, p. 70. Oxford: Osprey Publishing, 2004. .\n\nThe combat record of IRIAF F-14s is disputed. Western sources estimates four or five kills, while Iranian claims 35–45 kills.  Cooper and Bishop states that Iranian F-14s shot down at least 160 Iraqi aircraft during the Iran–Iraq War, including 58 MiG-23s, 33 Mirage F1s, 23 MiG-21s, 23 Su-20s/22s, nine MiG-25s, five Tu-22s, two MiG-27s, one Mil Mi-24, one Dassault Mirage 5, one B-6D, one Aérospatiale Super Frelon, and two unidentified aircraft. Despite the circumstances the F-14s and their crews faced during the war against Iraq – lacking support from AWACS, AEW aircraft, and Ground Control Intercept (GCI) – the F-14 proved to be successful in combat. It achieved this in the midst of a confrontation with an enemy that was constantly upgrading its capabilities and receiving support from three major countries – France, the US, and the USSR. Part of the success is attributed to the resilient Iranian economy and IRIAF personnel.\n\nWhile Iraq's army claimed it shot down more than 70 F-14s, the Foreign Broadcast Information System in Washington DC estimated that Iran lost 12 to 16 during the war. Cooper writes only three F-14 were shot down by Iraqis and four by Iranian surface-to-air missiles (SAM). Two Tomcats were lost in unknown circumstances during the battle, and seven crashed due to technical failure or accidents.Cooper and Bishop, p. 84. During the war, the Iranian Air Force F-14s suffered 9 confirmed losses, one lost due to engine stall, one in unknown conditions, two by Iranian Hawk SAMs, two by MIG-23s and three were shot down by Mirage F-1EQs. There are also unconfirmed reports of the downing of 10 more Tomcats.http://www.ejection-history.org.uk/country-by-country/Iran_F-14_.htm\n\nOn 31 August 1986, an Iranian F-14A armed with at least one AIM-54A missile defected to Iraq. In addition, one or more of Iran's F-14A was delivered to the Soviet Union in exchange for technical assistance; at least one of its crew defected to the Soviet Union.\"F-14 Tomcat interceptors in Iran\". Ivanov, Grigoriy, 2003\n\nIran had an estimated 44 F-14s in 2009 according to Combat Aircraft.Cooper, Tom and Liam Devlin. \"Iranian Air Power Combat Aircraft\". Combat Aircraft, Vol. 9 No. 6, January 2009. Aviation Week estimated it had 19 operational F-14s in January 2013,\"World Military Aircraft Inventory\". 2013 Aerospace Source Book. Aviation Week and Space Technology, 2013. and Flight Global estimated that 28 were in service in 2014.\n\nIn January 2007, the U.S. Department of Defense announced that sales of spare F-14 parts would be suspended over concerns of the parts ending up in Iran.[http://news.bbc.co.uk/1/hi/world/middle_east/6315957.stm \"US halts sale of F-14 jet parts.\"] BBC News. Retrieved: 8 December 2009. In July 2007, the remaining American F-14s were shredded to ensure that any parts could not be acquired. In 2010, Iran requested that the U.S. deliver the 80th F-14 it had purchased in 1974, but delivery was denied after the Islamic Revolution.[http://www.tehrantimes.com/Index_view.asp?code\n224172 \"Iranian Air Force seeks return of F-14 bombers from U.S.\"] Tehran TimesParsons, Gary. [http://www.airforcesmonthly.com/view_news.asp?ID=2378 \"Iran wants its F-14 back.\"]  AirForces Monthly, 5 August 2010. In October 2010, an Iranian Air Force commander claimed that the country overhauls and optimizes different types of military aircraft, mentioning that Air Force has installed Iran-made radar systems on the F-14.[http://www.highbeam.com/doc/1G1-255136166.html \"Iranian Air Force Equips F-14 Fighter Jets with Hi-Tech Radars.\"] FARS News Agency, Iran, 5 January 2011. Retrieved: 9 September 2012.\n\nOn 26 January 2012, an Iranian F-14 crashed three minutes after takeoff. Both crew members were killed.[https://web.archive.org/web/20120128065039/http://www.washingtonpost.com/world/middle-east/iranian-f-14-fighter-jet-crashes-in-countrys-south-both-pilot-and-co-pilot-killed/2012/01/26/gIQAhzESSQ_story.html \"Iranian F-14 fighter jet crashes in country's south, both pilot and co-pilot killed.\"] Washington Post, 26 January 2012. Retrieved: 24 March 2012.\n\nIn November 2015, Iranian F-14s had been reported flying escort for Russian Tu-95 bombers on air strikes in Syria against the Islamic State of Iraq and the Levant.[http://foxtrotalpha.jalopnik.com/new-video-of-f-14-tomcat-escorts-and-cruise-missiles-as-1743807778 \"New Video Of F-14 Tomcat Escorts And Cruise Missiles As Russia Steps Up Syria Offensive\"]. foxtrotalpha.jalopnik.com, 20 November 2015. Retrieved: 21 November 2015.\n\nVariants\n\nA total of 712 F-14s were built[http://www.anft.net/f-14/f14-serial.htm \"F-14 Bureau Numbers.\"] anft.net. Retrieved: 8 December 2009. from 1969 to 1991.Anft, Torsten. [http://www.anft.net/f-14/grumman-gmp.htm \"Grumman Memorial Park.\"] Home of M.A.T.S. Retrieved: 28 December 2006. F-14 assembly and test flights were performed at Grumman's plant in Calverton on Long Island, New York. Grumman facility at nearby Bethpage, New York was directly involved in F-14 manufacturing and was home to its engineers. The airframes were partially assembled in Bethpage and then shipped to Calverton for final assembly. Various tests were also performed at the Bethpage Plant. Over 160 of the U.S. aircraft were destroyed in accidents.Anft, Torsent. [http://www.anft.net/f-14/f14-serial-date.htm \"F-14 Crashes sorted by Date.\"] Home of M.A.T.S. Retrieved: 1 January 2008.\n\nF-14A\n\nThe F-14A was the initial two-seat, twin-engine, all-weather interceptor fighter variant for the U.S. Navy. It first flew on 21 December 1970. The first 12 F-14As were prototype versionsSpick 2000, pp. 75–79. (sometimes called YF-14As). Modifications late in its service life added precision strike munitions to its armament. The U.S. Navy received 478 F-14A aircraft and 79 were received by Iran. The final 102 F-14As were delivered with improved Pratt & Whitney TF30-P-414A engines.[http://www.globalsecurity.org/military/systems/aircraft/f-14-variants.htm \"F-14 Tomcat variants\".] GlobalSecurity.org. Retrieved: 20 September 2006. Additionally, an 80th F-14A was manufactured for Iran, but was delivered to the U.S. Navy.\n\nF-14B\n\nThe F-14 received its first of many major upgrades in March 1987 with the F-14A Plus (or F-14A+). The F-14A's TF30 engine was replaced with the improved GE F110-GE-400 engine. The F-14A+ also received the state-of-the-art ALR-67 Radar Homing and Warning (RHAW) system. Much of the avionics, as well as, the AWG-9 radar were retained. The F-14A+ was later redesignated F-14B on 1 May 1991. A total of 38 new aircraft were manufactured and 48 F-14A were upgraded into B variants.\n\nThe TF30 had been plagued from the start with susceptibility to compressor stalls at high AoA and during rapid throttle transients or above 30000 ft. The F110-GE-400 engine provided a significant increase in thrust, producing 23400 lbf with afterburner at sea level, which rose to 30200 lbf at Mach 0.9.NAVAIR 01-F-14AAD-1A F-14D NATOPS FLIGHT MANUAL January 2004 PART 1 CH-2 Section 2.2 \"Engine\" pg \"2–9\". The increased thrust gave the Tomcat a better than 1:1 thrust-to-weight ratio at low fuel quantities. The basic engine thrust without afterburner was powerful enough for carrier launches, further increasing safety. Another benefit was allowing the Tomcat to cruise comfortably above 30000 ft, which increased its range and survivability.  The F-14B arrived in time to participate in Desert Storm.\n\nIn the late 1990s, 67 F-14Bs were upgraded to extend airframe life and improve offensive and defensive avionics systems. The modified aircraft became known as F-14B Upgrade.\n\nF-14D\n\nThe final variant of the F-14 was the F-14D Super Tomcat. The F-14D variant was first delivered in 1991. The original TF-30 engines were replaced with General Electric F110-400 engines, similar to the F-14B. The F-14D also included newer digital avionics systems including a glass cockpit and replaced the AWG-9 with the newer AN/APG-71 radar. Other systems included the Airborne Self Protection Jammer (ASPJ), Joint Tactical Information Distribution System (JTIDS), SJU-17(V) Naval Aircrew Common Ejection Seats (NACES), and Infra-red search and track (IRST).[https://web.archive.org/web/20100504214359/http://www.lockheedmartin.com/news/press_releases/2010/MFC_042810_LM_DevelopingF-15C_IRST.html \"Developing F-15C.\"] Lockheed Martin Press Release, 28 April 2010.\n\nThe GE F110-400 engine provided increased thrust and additional endurance to extend range or to stay on station much longer. In the overland attack role this gave the F-14D 60 percent more striking range or one-third more time on station. The Rate of climb was increased by 61 percent. The F110's increased thrust allowed almost all carrier launches to be made in military (dry) power. While this did result in fuel savings, the main reason not to use afterburner during carrier launches was that if an engine failed the F110's thrust in full afterburner would produce a yawing moment too abruptly for the pilot to correct. Thus the launch of an F-14D with afterburner was rare, while the F-14A required full afterburner unless very lightly loaded.\n\nAlthough the F-14D was to be the definitive version of the Tomcat, not all fleet units received the D variant. In 1989, Secretary of Defense Dick Cheney refused to approve the purchase of any more F-14D model aircraft for $50 million each and pushed for a $25 million modernization of the F-14 fleet instead. Congress decided not to shut production down and funded 55 aircraft as part of a compromise. A total of 37 new aircraft were completed, and 18 F-14A models were upgraded to D-models, designated F-14D(R) for a rebuild. An upgrade to the F-14D's computer software to allow AIM-120 AMRAAM missile capability was planned but was later terminated.\n\nWhile upgrades had kept the F-14 competitive with modern fighter aircraft technology, Cheney called the F-14 1960s technology. Despite an appeal from the Secretary of the Navy for at least 132 F-14Ds and some aggressive proposals from Grumman for a replacement,Jenkins 1997, p. 30. Cheney planned to replace the F-14 with a fighter that was not manufactured by Grumman. Cheney called the F-14 a \"jobs program\", and when the F-14 was canceled, an estimated 80,000 jobs of Grumman employees, subcontractors, or support personnel were affected.Saul, Stephanie. \"Cheney Aims Barrage at F-14D Calls keeping jet a jobs program.\" Newsday Washington Bureau, 24 August 1989, p. 6. Starting in 2005, some F-14Ds received the ROVER III upgrade.\n\nProjected variants\n\nThe first F-14B was to be an improved version of the F-14A with more powerful \"Advanced Technology Engine\" F401 turbofans.  The F-14C was a projected variant of this initial F-14B with advanced multi-mission avionics.Spick 2000, p. 75.  Grumman also offered an interceptor version of the F-14B in response to the U.S. Air Force's Improved Manned Interceptor Program to replace the Convair F-106 Delta Dart as an Aerospace Defense Command interceptor in the 1970s.  The F-14B program was terminated in April 1974.Isham, Marty. U.S. Air Force Interceptors: A Military Photo Logbook 1946–1979. North Branch, Minnesota: Specialty Press Publications, 2010. .\n\nGrumman proposed a few improved Super Tomcat versions. The first was the Quickstrike, which was an F-14D with navigational and targeting pods, additional attach points for weapons, and added ground attack capabilities to its radar. The Quickstrike was to fill the role of the A-6 Intruder after it was retired. This was not considered enough of an improvement by Congress, so the company shifted to the Super Tomcat 21 proposed design. The Super Tomcat 21 was a proposed lower cost alternative to the Navy Advanced Tactical Fighter (NATF). The Grumman design would have the same shape and body as the Tomcat, and an upgraded AN/APG-71 radar. New GE F110-129 engines were to provide a supercruise speed of Mach 1.3 and featured thrust vectoring nozzles. The version would have increased fuel capacity and modified control surfaces for improved takeoffs and lower landing approach speed. The Attack Super Tomcat 21 version was the last Super Tomcat proposed design. It added even more fuel capacity, more improvements to control surfaces, and possibly an active electronically scanned array (AESA) radar from the canceled A-12 attack aircraft.\n\nThe last \"Tomcat\" variant was the ASF-14 (Advanced Strike Fighter-14), Grumman's replacement for the NATF concept. By all accounts, it would not be even remotely related to the previous Tomcats save in appearance, incorporating the new technology and design know-how from the Advanced Tactical Fighter (ATF) and Advanced Tactical Aircraft (ATA) programs. The ASF-14 would have been a new-build aircraft; however, its projected capabilities were not that much better than that of the (A)ST-21 variants.[http://anft.net/f-14/f14-history-f14x.htm \"F-14 History.\"] anft.net. Retrieved: 16 November 2010. In the end, the Attack Super Tomcat was considered to be too costly. The Navy decided to pursue the cheaper F/A-18E/F Super Hornet to fill the fighter-attack role.Donald 2004, pp. 9–11.\n\nOperators\n\n;\n* Islamic Republic of Iran Air Force\n** 72nd TFS: F-14A, 1976–1985\n** 73rd TFS: F-14A, 1977–1985\n** 81st TFS: F-14A, 1977–present\n** 82nd TFS: F-14A, 1978–present\n** 83rd Tomcat Flight School: F-14A, 1978–1979\n** 83rd TFS: F-14A, renamed former 62nd TFSTaghvaee, Babak. Aviation News Monthly, UK: Key Publishing, March 2012.\n\nFormer operators\n\n;\n* United States Navy operated F-14 from 1974 to 2006\n** Navy Fighter Weapons School (TOPGUN) (Merged with Strike University (Strike U) to form Naval Strike and Air Warfare Center (NSAWC) 1996)\n*** VF-126 Bandits (Disestablished 1 April 1994)\n** VF-1 Wolfpack (Disestablished 30 September 1993)\n** VF-2 Bounty Hunters (Pacific Fleet through 1996, Atlantic Fleet 1996–2003, Pacific Fleet 2003–present; redesignated VFA-2 with F/A-18F, 1 July 2003)\n** VF-11 Red Rippers (Redesignated to VFA-11 with F/A-18F, May 2005)\n** VF-14 Tophatters (Redesignated VFA-14 with F/A-18E, 1 December 2001, and transferred to Pacific Fleet, 2002)\n** VF-21 Freelancers (Disestablished 31 January 1996)\n** VF-24 Fighting Renegades (Disestablished 20 August 1996)\n** VF-31 Tomcatters (Redesignated VFA-31 with F/A-18E, October 2006)\n** VF-32 Swordsmen (Redesignated VFA-32 with F/A-18F, 1 October 2005)\n** VF-33 Starfighters (Disestablished 1 October 1993)\n** VF-41 Black Aces (Redesignated VFA-41 with F/A-18F, 1 December 2001)\n** VF-51 Screaming Eagles (Disestablished 31 March 1995)\n** VF-74 Bedevilers (Disestablished 30 April 1994)\n** VF-84 Jolly Rogers (Disestablished 1 October 1995; squadron heritage and nickname transferred to VF-103)\n** VF-102 Diamondbacks (Redesignated VFA-102 with F/A-18F, 1 May 2002, and transferred to Pacific Fleet)\n** VF-103 Sluggers/Jolly Rogers (Redesignated VFA-103 with F/A-18F, 1 May 2005)\n** VF-111 Sundowners (Disestablished 31 March 1995; squadron heritage and nickname adopted by VFC-111)\n** VF-114 Aardvarks (Disestablished 30 April 1993)\n** VF-142 Ghostriders (Disestablished 30 April 1995)\n** VF-143 Pukin' Dogs (Redesignated VFA-143 with F/A-18E, early 2005)\n** VF-154 Black Knights (Redesignated VFA-154 with F/A-18F, 1 October 2003)\n** VF-191 Satan's Kittens (Disestablished 30 April 1988)\n** VF-194 Red Lightnings (Disestablished 30 April 1988)\n** VF-211 Fighting Checkmates (Pacific Fleet through 1996, then transferred to Atlantic Fleet; redesignated VFA-211 with F/A-18F, 1 October 2004)\n** VF-213 Black Lions (Pacific Fleet through 1996, then transferred to Atlantic Fleet; redesignated VFA-213 with F/A-18F, May 2006)\n* Naval Air Systems Command Test and Evaluation Squadrons\n** VX-4 Evaluators (Disestablished 30 September 1994 and merged into VX-5 to form VX-9)\n** VX-9 Vampires (Currently operates F/A-18C/D/E/F, EA-18G, F-35C, EA-6B, AV-8B, AH-1 and UH-1)\n** VX-23 Salty Dogs (Currently operates F/A-18A+/B/C/D/E/F, EA-6B, EA-18G, F-35C and T-45)\n** VX-30 Bloodhounds (Currently operates P-3, C-130, S-3)\n* Fleet Replacement Squadrons\n** VF-101 Grim Reapers; Atlantic Fleet, then sole single-site, F-14 FRS (Disestablished 15 September 2005; squadron heritage and nickname adopted by a recently established unit, designated VFA-101, which is currently the sole F-35C Fleet Replacement Squadron in May 2012)[http://www.navy.mil/submit/display.asp?story_id=66309 Navy's Newest Squadron Prepares for New F-35 Fighters]. Navy.mil. Retrieved on 2013-08-16.\n** VF-124 Gunfighters; Pacific Fleet F-14 FRS\n***(Disestablished 30 September 1994)\n* Naval Air Force Reserve Squadrons\n** VF-201 Hunters (Redesignated VFA-201 and reequipped with F/A-18A+ on 1 January 1999; disestablished 30 June 2007)\n** VF-202 Superheats (Disestablished 31 December 1994)\n** VF-301 Devil's Disciples (Disestablished 11 September 1994)\n** VF-302 Stallions (Disestablished 11 September 1994)\n* Naval Air Force Reserve Squadron Augmentation Units (SAUs)\n** VF-1285 Fighting Fubijars (Disestablished September 1994);[http://www.anft.net/f-14/f14-squadron-vf1285.htm \"VF-1285.\"] anft.net. Retrieved: 8 December 2009. augmented VF-301 and VF-302\n** VF-1485 Americans (Disestablished September 1994);[http://www.anft.net/f-14/f14-squadron-vf1485.htm \"VF-1485.\"] anft.net. Retrieved: 8 December 2009. augmented VF-124\n** VF-1486 Fighting Hobos (Disestablished September 2005);[http://www.anft.net/f-14/f14-squadron-vf1486.htm \"VF-1486.\"] anft.net. Retrieved: 8 December 2009. augmented VF-101\n\nAircraft on display\n\nNotable F-14s preserved at museums and military installations include:\n;Bureau Number (BuNo) – Model – Location – Significance\n;F-14A\n*157982 – Cradle of Aviation Museum, Garden City, New York. Prototype #3 Nonstructural demonstration testbed.[http://www.cradleofaviation.org/history/permanent_exhibits/jet_gallery/grumman_f-14a_tomcat.html \"F-14 Tomcat/157982.\"]  Cradle of Aviation Museum. Retrieved: 10 December 2015.\n*157984 – National Naval Aviation Museum, Naval Air Station Pensacola, Florida. Fifth F-14 manufactured and one of the prototypes used in flight testing. Mounted on pedestal at entrance to museum.[http://www.navalaviationmuseum.org/attractions/aircraft-exhibits/item/?item\nf-14a_tomcat \"F-14 Tomcat/157984.\"] National Naval Aviation Museum. Retrieved: 10 December 2015.\n*157988 – NAS Oceana Air Park, Virginia.[http://warbirdregistry.org/jetregistry/f14-157988.html \"F-14 Tomcat/157988.\"] Warbird Registry. Retrieved: 27 March 2013.\n*157990 – March Field Air Museum, Riverside, California.[https://web.archive.org/web/20141020165530/http://www.marchfield.org/aircraft-exhibits/aircraft/yf-14a-tomcat-grumman/ \"F-14 Tomcat/157990.\"] March Field Air Museum. Retrieved: 10 December 2015.\n*158617 – Veterans of Foreign Wars (VFW) Post 7293, Whitehall, Pennsylvania.\n*158623 – Naval Base Ventura County, NAS Point Mugu, California. Pedestal mount at Front Gate Airpark.[http://aerialvisuals.ca/LocationDossier.php?Serial=1857 \"F-14 Tomcat/158623.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*158627 – Hickory Aviation Museum, Hickory, NC.\n*158978 – USS Midway Museum, San Diego, California.[http://www.midway.org/Aircraft-Museum \"F-14 Tomcat/158978.\"] USS Midway Museum. Retrieved: 27 March 2013.\n*158985 – Yanks Air Museum, Chino, California.[https://yanksair.com/Products/64/70/Grumman-G-303-Tomcat-F-14A/ \"F-14 Tomcat/158985.\"] Yanks Air Museum. Retrieved: 27 March 2013.\n*158998 – Air Victory Museum, Lumberton, New Jersey.[http://www.airvictorymuseum.org/html/displays.html \"F-14 Tomcat/158998.\"] Air Victory Museum. Retrieved: 27 Match 2013.\n*158999 – Naval Air Station Joint Reserve Base Fort Worth (former Carswell AFB), Fort Worth, Texas.[http://aerialvisuals.ca/LocationDossier.php?Serial=3764 \"F-14 Tomcat/158999.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159025 – Patriot's Point Naval and Maritime Museum, Charleston, South Carolina.[http://www.patriotspoint.org/pdf/aircraft/f-14a_tomcat.pdf \"F-14 Tomcat/159025.\"] Patriot's Point Maritime and Naval Museum. Retrieved: 27 March 2013.\n*159445 – Naval Station Norfolk (former Naval Air Station Norfolk) East Gate Airpark, Virginia.[http://warbirdregistry.org/jetregistry/f14-159445.html \"F-14 Tomcat/159445.\"] Warbird Registry. Retrieved: 27 March 2013.\n*159448 – Naval Inventory Control Point, Pennsylvania.[http://aerialvisuals.ca/LocationDossier.php?Serial=3559 \"F-14 Tomcat/159448.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159455 – NAS Patuxent River, Lexington Park, Maryland. Former VX-23 flight test squadron aircraft.[http://aerialvisuals.ca/LocationDossier.php?Serial=2732 \"F-14 Tomcat/159455.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159600 – Fort Worth Aviation Museum, Fort Worth, Texas[http://vmap.wikispaces.com/F-14D+Tomcat \"F-14 Tomcat/159600.\"]  Fort Worth Aviation Museum. Retrieved: 1 April 2015.\n*159620 – NAF El Centro, California.[http://aerialvisuals.ca/LocationDossier.php?Serial=1768 \"F-14 Tomcat/159620.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159626 – Naval Strike and Air Warfare Center, Naval Air Station Fallon, Nevada.[http://aerialvisuals.ca/LocationDossier.php?Serial=3023 \"F-14 Tomcat/159626.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159631 – San Diego Aerospace Museum, San Diego, California.[http://aerialvisuals.ca/AirframeDossier.php?Serial=477 \"F-14 Tomcat/159631.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159829 – Wings Over the Rockies Air and Space Museum, former Lowry AFB, Denver, Colorado. From VF-211, later used for aircraft maintenance training by Naval Air Reserve Center Denver at Buckley AFB.[https://web.archive.org/web/20150317054351/http://wingsmuseum.org/f14-tomcat/ \"F-14 Tomcat/159829.\"] Wings Over the Rockies Air & Space Museum. Retrieved: 10 December 2015.\n*159830 – Western Museum of Flight, Torrance, California.[http://www.wmof.com/f14a.htm \"F-14 Tomcat/159830.\"] Western Museum of Flight. Retrieved: 27 March 2013.\n*159848 – Tillamook Air Museum, Tillamook, Oregon.[http://www.tillamookair.com/grumman-f-14a-tomcat \"F-14 Tomcat/159848.\"] Tillamook Air Museum. Retrieved: 10 December 2015.\n*159853 – Defense Supply Center Richmond, Richmond, Virginia.[http://aerialvisuals.ca/LocationDossier.php?Serial=3955 \"F-14 Tomcat/159853.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159856 – Naval Air Facility El Centro, California.[http://www.warbirdregistry.org/jetregistry/f14-159856.html \"F-14 Tomcat/159856.\"] Warbird Registry. Retrieved: 27 March 2013.\n*160382 – Museum of Flight, Tukwila, Washington. VF-84 \"Jolly Rogers\" AJ202. Stationed on the USS Nimitz. This aircraft, as well as several other F-14As from the famous \"Jolly Rogers\" squadron, appear in the 1980 film The Final Countdown which was filmed on board the USS Nimitz. On loan from the National Museum of Naval Aviation at Pensacola, Florida.[http://www.museumofflight.org/aircraft/grumman-f-14a-tomcat \"F-14 Tomcat/160382.\"] Museum of Flight. Retrieved: 27 March 2013.\n*160386 – Great Lakes Naval Training Center, Great Lakes NAS, Chicago, Illinois.[http://aerialvisuals.ca/LocationDossier.php?Serial=2382 \"F-14 Tomcat/160386.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160391 – Texas Air Museum, Lubbock, Texas.[http://www.thetexasairmuseum.org/aircraft/staticaircraft/F-14/ \"F-14 Tomcat/160391.\"] Texas Air Museum. Retrieved: 27 March 2013,\n*160395 – Air Zoo, Kalamazoo, Michigan.[http://www.airzoo.org/page.php?page_id=210 \"F-14 Tomcat/160395.\"] Air Zoo. Retrieved: 28 March 2013.\n*160401 – Fleet Area Control and Surveillance Facility Virginia Capes (FACSFAC VACAPES), Naval Air Station Oceana, Virginia.[http://aerialvisuals.ca/LocationDossier.php?Serial=9610 \"F-14 Tomcat/160401.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160403 – American Airpower Heritage Museum, Midland, Texas.[http://airpowermuseum.org/?pagecms/index&cms_page\n85 \"F-14 Tomcat/160403.\"] Air Power Museum. Retrieved: 28 March 2013 It is one of the aircraft involved in 1981 Gulf of Sidra incident.\n*160411 – Empire State Aerosciences Museum, Glenville, New York.[http://www.esam.org/ \"F-14 Tomcat/160441.\"] Empire State Aeroscience Museum. Retrieved: 29 March 2013.\n*160658 – NAES Lakehurst, New Jersey.[http://aerialvisuals.ca/LocationDossier.php?Serial=3062 \"F-14 Tomcat/160658.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160661 – U.S. Space and Rocket Center's Aviation Challenge facility in Huntsville, Alabama.[http://aerialvisuals.ca/LocationDossier.php?Serial=1552 \"F-14 Tomcat/160661.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160666 – Western Aerospace Museum, Oakland, California. Originally delivered to VF-111 in 1978, subsequently reassigned to NAVAIR test duties, permanently modified for development of follow-on avionics and weapons systems.[http://oaklandaviationmuseum.org/aircraft_3.html \"F-14 Tomcat/160666.\"] Oakland Aviation Museum. Retrieved: 28 March 2013.\n*160684 – Pima Air and Space Museum, adjacent to Davis-Monthan AFB, Tucson, Arizona. Repainted in its original markings as \"NL 211\" of VF-111 aboard USS KITTY HAWK (CV-63), as this particular aircraft appeared in its initial operational squadron service, c. 1978–1981.[http://www.pimaair.org/aircraft-by-name/item/grumman-f-14a-tomcat \"F-14 Tomcat/160684.\"] Pima Air & Space Museum. Retrieved: 10 December 2015.\n*160694 – USS Lexington Museum, Corpus Christi, Texas. Painted with Hi-Vis markings of VF-103 \"Jolly Rogers\". Aircraft is on loan from the National Museum of Naval Aviation at NAS Pensacola, Florida.[http://usslexington.com/aircraft/f-14-tomcat/ \"F-14 Tomcat/160694.\"] USS Lexington Museum. Retrieved: 28 March 2013.  Used in the film Top  Gun.\n*160889 – Pacific Coast Air Museum at Charles M. Schulz Sonoma County Airport, Santa Rosa, California.[http://www.pacificcoastairmuseum.org/aircraft/F14ATomcat.asp \"F-14 Tomcat/160889.\"] Pacific Coast Air Museum. Retrieved: 28 March 2013.\n*160898 – Palm Springs Air Museum, Palm Springs, California.[https://web.archive.org/web/20151031001630/http://palmspringsairmuseum.org/aircraft-2/ \"F-14 Tomcat/160898.\"] Palm Springs Air Museum. Retrieved: 10 December 2015.\n*160902 – Grumman Memorial Park, Calverton, New York.[http://aerialvisuals.ca/LocationDossier.php?Serial=3170 \"F-14 Tomcat/160902.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160903 – Mid-America Air Museum, Liberal Mid-America Regional Airport, Liberal, Kansas.[http://aerialvisuals.ca/LocationDossier.php?Serial=2614 \"F-14 Tomcat/160903.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160909 – Dobbins Air Reserve Base, Atlanta, Georgia.[http://aerialvisuals.ca/LocationDossier.php?Serial=2235 \"F-14 Tomcat/160909.\"] aerialvisuals.ca. Retrieved: 27 March 2013.\n*160914 – Willmar Municipal Airport, Wilmar, Minnesota[http://aerialvisuals.ca/LocationDossier.php?Serial=4275 \"F-14 Tomcat/160914.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n* 160925 - on display at Eisenhower Park, WaKeeney, Kansas [http://www.wakeeney.org/tour/f-14-tomcat-fighter-jet ]\n*161134 – Valiant Air Command Warbird Museum, Space Coast Regional Airport, Titusville, Florida.[http://www.valiantaircommand.com/#!static-collection/cee5 \"F-14 Tomcat/161134.\"] Valiant Air Command Warbird Museum. Retrieved: 10 December 2015.\n*161598 – Tulsa Air and Space Museum, Tulsa, Oklahoma. It has VF-41 \"Black Aces\" markings.[http://www.tulsaairandspacemuseum.org/ \"F-14 Tomcat/161598.\"] Tulsa Air and Space Museum. Retrieved: 10 December 2015.\n*161860 Aviation Museum of Kentucky\n*162591 – Quonset Air Museum, Quonset State Airport (former Naval Air Station Quonset Point), North Kingstown, Rhode Island.[https://web.archive.org/web/20140129023711/http://www.quonsetairmuseum.com/index.php?page=exhibitions#prettyPhoto \"F-14 Tomcat/162591.\"] Quonset Air Museum. Retrieved: 10 December 2015. Museum closed in 2016 due to damage from a snowstorm the previous year.\n*162592 – Ronald Reagan Presidential Library, Simi Valley, California.[http://aerialvisuals.ca/LocationDossier.php?Serial=1988 \"F-14 Tomcat/162592.\"] aerialvisuals.ca Retrieved: 1 July 2015.\n*162608 – Southern Museum of Flight, Birmingham, Alabama.[http://aerialvisuals.ca/LocationDossier.php?Serial=1525 \"F-14 Tomcat/162608.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*162689 – , USS Hornet Museum, former Naval Air Station Alameda, Alameda, California.[https://web.archive.org/web/20081226153447/http://www.uss-hornet.org/exhibits/aircraft/jet/tomcat.shtml \"F-14 Tomcat/162689.\"] USS Hornet Museum. Retrieved: 28 March 2013.\n*162694 – MAPS Air Museum, North Canton, Ohio.[https://sites.google.com/a/mapsairmuseum.org/f-14-tomcat/home \"F-14 Tomcat/162694.\"] MAPS Air Museum. Retrieved: 28 March 2013.\n*162710 – National Naval Aviation Museum, Naval Air Station Pensacola, Florida.[http://www.navalaviationmuseum.org/attractions/aircraft-exhibits/item/?item=f-14a_tomcat_flightline \"F-14 Tomcat/162710.\"] National Naval Aviation Museum. Retrieved: 10 December 2015.\n;F-14B\n*157986 – , Intrepid Sea-Air-Space Museum, Manhattan, New York. 7th Tomcat built, retained as research and development airframe.[http://www.intrepidmuseum.org/AircraftCollection.aspx \"F-14 Tomcat/157986.\"] USS Intrepid Museum. Retrieved: 10 December 2015.\n*161605 – Wings of Eagles Discovery Center/National Warplane Museum, Horseheads, New York.[http://www.wingsofeagles.com/?page_id=535 \"F-14 Tomcat/161605.\"] Wings of Eagles Discovery Center. Retrieved: 28 March 2013.\n*161615 – Combat Air Museum, Topeka, Kansas.[http://combatairmuseum.org/aircraft/grummanF14A.html \"F-14 Tomcat/161615.\"] Combat Air Museum. Retrieved: 28 March 2013.\n*161620 – Selfridge Military Air Museum, Selfridge Air National Guard Base, Mount Clemens, Michigan.[http://www.selfridgeairmuseum.org/F-14A.htm \"F-14 Tomcat/161620.\"] Selfridge Military Air Museum. Retrieved: 10 December 2015.\n*161623 – Patuxent River Naval Air Museum, Naval Air Station Patuxent River, Lexington Park, Maryland. It is a former VX-23 flight test squadron aircraft.[https://web.archive.org/web/20110130150933/http://paxmuseum.com/page/aircraft-1 \"F-14 Tomcat/161623.\"] Patuxent River Naval Air Museum. Retrieved: 28 March 2013.\n*162912 – Grissom Air Museum, Grissom Air Reserve Base (former Grissom AFB), Indiana.[http://www.grissomairmuseum.com/gallery/fighters/plane-11 \"F-14 Tomcat/162912.\"] Grissom Air Museum. Retrieved: 28 March 2013.\n*162916 – Veterans of Foreign Wars (VFW) Post 8896 – Richard R. Gross Post, East Berlin, Pennsylvania.[http://aerialvisuals.ca/LocationDossier.php?Serial=3531 \"F-14 Tomcat/162916.\"] aerialvisuals.ca. Retrieved: 9 December 2015.\n*162926 – New England Air Museum, Windsor Locks, Connecticut.[http://neam.org/index.php?optioncom_content&view\narticle&id=90 \"F-14 Tomcat/162926.\"] New England Air Museum. Retrieved: 28 March 2013.\n*162911 – Estrella Warbird Museum, Paso Robles, California. \n;F-14D(R)\n*159600 – OV-10 Bronco Museum, Fort Worth, Texas. On loan from the National Museum of Naval Aviation, NAS Pensacola, Florida. Nicknamed \"Christine\", it was the longest-serving F-14 Tomcat in U.S. Navy. Remanufactured from F-14A to F-14D(R) configuration, it was originally built in 1976 and made the final combat deployment/cruise of the F-14 in 2006.[http://vmapaircraft.weebly.com/f-14d-tomcat.html \"F-14 Tomcat/159600.\"] OV-10 Bronco Museum. Retrieved: 10 December 2015.\n*159610 – Smithsonian National Air & Space Museum, Steven F. Udvar-Hazy Center, Chantilly, Virginia. This F-14 was one of those involved in the second Gulf of Sidra incident.[https://web.archive.org/web/20120522101842/http://airandspace.si.edu/collections/artifact.cfm?id=A20040156000 \"F-14 Tomcat/159610.\"] NASM. Retrieved: 27 March 2013.\n*159619 – Florida Air Museum at Sun 'n Fun, Lakeland Linder Regional Airport, Lakeland, Florida.[http://aerialvisuals.ca/LocationDossier.php?Serial=2157 \"F-14 Tomcat/159619.\"] aerialvisuals.ca. Retrieved: 9 December 2015.\n*161159 – National Naval Aviation Museum, Naval Air Station Pensacola, Florida.  Completed the last combat flight and the last combat carrier arrested landing (trap) by a U.S. Navy F-14.[http://www.navalaviationmuseum.org/attractions/aircraft-exhibits/item/?item=f-14d_tomcat \"F-14 Tomcat/157984.\"] National Naval Aviation Museum.  Retrieved: 10 December 2015.\n*161163 – Prairie Aviation Museum, Bloomington, Illinois. Depot Level Conversion performed September 1991. Retired as MODEX 205 of Fighter Squadron 213 (VF-213), Black Lions.[http://prairieaviationmuseum.org/exhibits/aircraft/grumman-f-14d-tomcat/ \"F-14 Tomcat/161163.\"] Prairie Aviation Museum. Retrieved: 28 March 2013.\n*161166 – Carolinas Aviation Museum, Charlotte, North Carolina.[http://www.carolinasaviation.org/military/grumman-f-14d-tomcat \"F-14 Tomcat/161166.\"] Carolinas Aviation Museum. Retrieved: 29 Marc 2013.\n*162595 – Naval Test Wing Atlantic, Naval Air Station Patuxent River, Maryland.[http://aerialvisuals.ca/LocationDossier.php?Serial=2732 \"F-14 Tomcat/162595.\"] aerialvisuals.ca. Retrieved: 9 December 2015.\n;F-14D\n*163893 – main gate, Arnold Engineering and Development Center, Arnold AFB, Tennessee.[http://aerialvisuals.ca/LocationDossier.php?Serial=3654 \"F-14 Tomcat/163893.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*163897 – Aerospace Museum of California, McClellan Airfield (former McClellan AFB and current Coast Guard Air Station Sacramento), Sacramento, California.[http://www.aerospaceca.org/grumman-f-14d-tomcat/ \"F-14 Tomcat/163897.\"]  Aerospace Museum of California. Retrieved: 28 March 2013.\n*163902 – Hickory Aviation Museum at Hickory Regional Airport, Hickory, North Carolina.  VF-31 Tomcatters aircraft Modex number 107; flew the F-14 retirement ceremony with LCDR Chris Richard and LT Mike Petronis at the controls.[https://web.archive.org/web/20150818121909/http://hickoryaviationmuseum.org/Assets/GrummanF-14D-Tomcat_LB_02.png \"F-14 Tomcat/163902.\"] Hickory Aviation Museum. Retrieved: 10 December 2015.\n*163904 – Pacific Aviation Museum, Ford Island, Joint Base Pearl Harbor-Hickam, Hawaii.[http://www.pacificaviationmuseum.org/aircraft/F14D/ \"F-14 Tomcat/163904.\"] Pacific Aviation Museum. Retrieved: 10 December 2015.\n*164342 – Wings Over Miami, Miami, Florida.[http://www.wingsovermiami.com/exhibits/ \"F-14 Tomcat/164342.\"] Wings Over Miami Air Museum. Retrieved: 28 March 2013.\n*164343 – Evergreen Aviation Museum, McMinnville, Oregon.[http://www.evergreenmuseum.org/the-museum/aircraft-exhibits/military-aircrafts/ \"F-14 Tomcat/164343.\"] Evergreen Aviation Museum. Retrieved: 29 March 2013.\n*164346 – Virginia Aviation Museum, Richmond, Virginia. On loan from National Museum of Naval Aviation, Pensacola, Florida. Last Tomcat to operationally trap aboard a U.S. Navy aircraft carrier.[https://web.archive.org/web/20130617170406/http://www.vam.smv.org/militaryaircraft.html \"F-14 Tomcat/164346.\"] Virginia Aviation Museum. Retrieved: 28 March 2013.\n*164350 – Joe Davies Heritage Airpark at Palmdale Plant 42, Palmdale, California.[http://aerialvisuals.ca/LocationDossier.php?Serial=1868 \"F-14 Tomcat/164350.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*164601 – Castle Air Museum at former Castle AFB, Atwater, California.[http://www.castleairmuseum.org/grummanf14d \"F-14 Tomcat/164601.\"]  Castle Air Museum. Retrieved: 10 December 2015.\n*164603 – Grumman Headquarters, Bethpage, New York. Felix 101 from VF-31 is the last Tomcat to fly in U.S. Navy service. Final flight was from NAS Oceana, Virginia to the American Airpower Museum at Republic Airport Long Island, New York on 4 October 2006 where it was displayed for a year and a half before being moved to Grumman Plant 25.[http://aerialvisuals.ca/LocationDossier.php?Serial=6403 \"F-14 Tomcat/164603.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*164604 – NAS Oceana Memorial Park, Naval Air Station Oceana, Virginia. Last F-14 manufactured, assigned to VX-4, later VX-9, at Naval Air Station Point Mugu, California during its operational service and used the callsign \"Vandy 1\".[http://aerialvisuals.ca/LocationDossier.php?Serial=3969 \"F-14 Tomcat/164604.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*Painted with Jolly Roger design at – Cape May Aviation Museum, Cape May, New Jersey 08204\n\nSpecifications (F-14D)\n\nTomcat logo\n\nThe Tomcat logo design came when Grumman's Director of Presentation Services, Dick Milligan, and one of his artists, Grumman employee Jim Rodriguez, were asked for a logo by Grumman's Director of Business Development and former Blue Angels #5 pilot, Norm Gandia. Per Rodriguez, \"He asked me to draw a lifelike Tomcat wearing boxing gloves and trunks sporting a six-shooter on his left side; where the guns are located on the F-14, along with two tails.\"  The Cat was drawn up after a tabby cat was sourced and used for photographs, and named \"Tom\".  The logo has gone through many variations, including one for the then–Imperial Iranian Air Force F-14, called \"Ali-cat\".  The accompanying slogan \"Anytime Baby!\" was developed by Norm Gandia as a challenge to the U.S. Air Force's McDonnell Douglas F-15 Eagle.[http://www.grummanpark.org/content/tomcat-logo The Tomcat Logo | Grumman Memorial Park]. Grummanpark.org. Retrieved on 2013-08-16.\n\nNotable appearances in media\n\nThe F-14 Tomcat most notably appeared in the 1986 action film Top Gun. It also featured prominently in the film The Final Countdown.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Grumman F-14 Tomcat" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11719" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Grumman F-14 Tomcat is an American supersonic, twin-engine, two-seat, variable-sweep wing fighter aircraft. The Tomcat was developed for the United States Navy's Naval Fighter Experimental (VFX) program after the collapse of the F-111B project. The F-14 was the first of the American teen-series fighters, which were designed incorporating air combat experience against MiG fighters during the Vietnam War.\n\nThe F-14 first flew in December 1970 and made its first deployment in 1974 with the U.S. Navy aboard , replacing the McDonnell Douglas F-4 Phantom II. The F-14 served as the U.S. Navy's primary maritime air superiority fighter, fleet defense interceptor, and tactical aerial reconnaissance platform into the 1990s. The Low Altitude Navigation and Targeting Infrared for Night (LANTIRN) pod system were added in the 1990s and the Tomcat began performing precision ground-attack missions.\n\nIn the 1980s F-14s were used as land-based interceptors by the Islamic Republic of Iran Air Force during the Iran–Iraq War, where they saw combat against Iraqi warplanes. Iranian F-14s reportedly shot down at least 160 Iraqi aircraft during the war, while only 12 to 16 Tomcats were lost; at least half of these losses were due to accidents.Cooper, Tom and Farzad Bishop. Iranian F-14 Tomcat Units in Combat, p. 84. Oxford: Osprey Publishing, 2004. .\n\nThe Tomcat was retired from the U.S. Navy's active fleet on 22 September 2006, having been supplanted by the Boeing F/A-18E/F Super Hornet.[http://www.foxnews.com/story/0,2933,215219,00.html \"Navy's 'Top Gun' Tomcat Fighter Jet Makes Ceremonial Final Flight.\"] Associated Press, 22 September 2006. Retrieved: 17 July 2008. The F-14 remains in service with the Iranian Air Force, having been exported to Iran in 1976.\n\nDevelopment\n\nBackground\n\nBeginning in the late 1950s, the U.S. Navy sought a long-range, high-endurance interceptor to defend its carrier battle groups against long-range anti-ship missiles launched from the jet bombers and submarines of the Soviet Union. The U.S. Navy needed a Fleet Air Defense (FAD) aircraft with a more powerful radar and longer range missiles than the F-4 Phantom II carried to intercept both enemy bombers and missiles.Thomason 1998, pp. 3–5. The Navy was directed to participate in the Tactical Fighter Experimental (TFX) program with the U.S. Air Force by Secretary of Defense Robert McNamara. McNamara wanted \"joint\" solutions to service aircraft needs to reduce development costs, and had already directed the Air Force to buy the F-4 Phantom II, which was developed for the Navy and Marine Corps.Dwyer, Larry. [http://www.aviation-history.com/mcdonnell/f4.html \"The McDonnell F-4 Phantom II.\"] aviation-history.com, 31 March 2010. Retrieved: 24 March 2012. The Navy strenuously opposed the TFX as it feared compromises necessary for the Air Force's need for a low-level attack aircraft would adversely impact the aircraft's performance as a fighter.\n\nWeight and performance issues plagued the U.S. Navy F-111B variant for TFX and would not be resolved to the Navy's satisfaction. The F-111 manufacturer General Dynamics partnered with Grumman on the Navy F-111B. With the F-111B program in distress, Grumman began studying improvements and alternatives. In 1966, the Navy awarded Grumman a contract to begin studying advanced fighter designs. Grumman narrowed down these designs to its 303 design.Spick 2000, pp. 71–72.  Vice Admiral Thomas F. Connolly, Deputy Chief of Naval Operations for Air Warfare, took the developmental F-111A variant for a flight and discovered that it had difficulty going supersonic and had poor carrier landing characteristics. He later testified before Congress about his concerns against the official Department of the Navy position and, in May 1968, Congress stopped funding for the F-111B, allowing the Navy to pursue an answer tailored to its requirements.Thomas. Robert Mcg. Jr: [https://www.nytimes.com/1996/06/09/us/thomas-connolly-86-top-gun-admiral-dies.html Thomas Connolly, 86, Top-Gun Admiral, Dies], New York Times, 9 June 1996. The name \"Tomcat\" was partially chosen to pay tribute to Admiral Connolly, as the nickname \"Tom's Cat\" had already been widely used by the manufacturer, although the name also followed the Grumman tradition of naming its fighter aircraft after felines.Marrett 2006, p. 18.\n\nVFX\n\nThe F-111B had been designed for the long-range Fleet Air Defense (FAD) interceptor role, but not for new requirements for air combat based on the experience of American aircraft against agile MiG fighters over Vietnam. The Navy studied the need for VFAX, an additional fighter that was more agile than the F-4 Phantom for air-combat and ground-attack roles.Spangenberg, George. [https://web.archive.org/web/20120204215346/http://www.georgespangenberg.com/vf15.htm \"Spangenberg Fighter Study Dilemma.\"] georgespangenberg.com. Retrieved: 24 March 2012. Grumman continued work on its 303 design and offered it to the Navy in 1967, which led to fighter studies by the Navy. The company continued to refine the design into 1968.\n\nIn July 1968, the Naval Air Systems Command (NAVAIR) issued a request for proposals (RFP) for the Naval Fighter Experimental (VFX) program. VFX called for a tandem two-seat, twin-engined air-to-air fighter with a maximum speed of Mach 2.2.  It would also have a built-in M61 Vulcan cannon and a secondary close air support role. The VFX's air-to-air missiles would be either six AIM-54 Phoenix or a combination of six AIM-7 Sparrow and four AIM-9 Sidewinder missiles. Bids were received from General Dynamics, Grumman, Ling-Temco-Vought, McDonnell Douglas and North American Rockwell;Spick 1985, pp. 9–10. four bids incorporated variable-geometry wings.Woolridge, Capt. E.T., ed. Into the Jet Age: Conflict and Change in Naval Aviation 1945–1975, an Oral History. Annapolis, Maryland: Naval Institute Press, 1995. .\n\nMcDonnell Douglas and Grumman were selected as finalists in December 1968. Grumman was selected for the contract award in January 1969.Spick 2000, p. 74.  Grumman's design reused the TF30 engines from the F-111B, though the Navy planned on replacing them with the Pratt & Whitney F401-400 engines under development for the Navy, along with the related Pratt & Whitney F100 for the USAF.Spick 2000, p. 112. Though lighter than the F-111B, it was still the largest and heaviest U.S. fighter to fly from an aircraft carrier, a consequence of the requirement to carry the large AWG-9 radar and AIM-54 Phoenix missiles (from the F-111B) and an internal fuel load of 16000 lb.Gunston and Spick 1983, p. 112.\n\nUpon winning the contract for the F-14, Grumman greatly expanded its Calverton, Long Island, New York facility for evaluating the aircraft. Much of the testing, including the first of many compressor stalls and multiple ejections, took place over Long Island Sound. In order to save time and forestall interference from Secretary McNamara, the Navy skipped the prototype phase and jumped directly to full-scale development; the Air Force took a similar approach with its F-15.Jenkins, Dennis R. F/A-18 Hornet: A Navy Success Story. New York: McGraw-Hill, 2000. . The F-14 first flew on 21 December 1970, just 22 months after Grumman was awarded the contract, and reached initial operational capability (IOC) in 1973. The United States Marine Corps was initially interested in the F-14 as an F-4 Phantom II replacement; going so far as to send officers to Fighter Squadron One Twenty-Four (VF-124) to train as instructors. The Marine Corps pulled out of any procurement when the development of the stores' management system for ground attack munitions was not pursued. An air-to-ground capability was not developed until the 1990s.\n\nFiring trials involved launches against simulated targets of various types, from cruise missiles to high-flying bombers. AIM-54 Phoenix missile testing from the F-14 began in April 1972.  The longest single Phoenix launch was successful against a target at a range of 110 nmi in April 1973. Another unusual test was made on 22 November 1973, when six missiles were fired within 38 seconds at Mach 0.78 and 24800 ft; four scored direct hits.Spick 2000, pp. 110–111.\n\nImprovements and changes\n\nWith time, the early versions of all the missiles were replaced by more advanced versions, especially with the move to full solid-state electronics that allowed better reliability, better ECCM and more space for the rocket engine. So the early arrangement of the AIM-54A Phoenix active-radar air-to-air missile, the AIM-7E-2 Sparrow Semi-active radar homing air-to-air missile, and the AIM-9J Sidewinder heat-seeking air-to-air missile was replaced in the 1980s with the B (1983) and C (1986) version of the Phoenix, the F (1977), M (1982), P (1987 or later) for Sparrows, and with the Sidewinder, L (1979) and M (1982). Within these versions, there are several improved batches (for example, Phoenix AIM-54C++).\n\nThe Tactical Airborne Reconnaissance Pod System (TARPS) was developed in the late 1970s for the F-14. Approximately 65 F-14As and all F-14Ds were modified to carry the pod. TARPS was primarily controlled by the Radar Intercept Officer (RIO) via an extra display for observing reconnaissance data. The \"TARPS Digital (TARPS-DI)\" was a 1996 upgrade featuring a digital camera. The digital camera was further updated beginning in 1998 with the \"TARPS Completely Digital (TARPS-CD)\" configuration that also provided real-time transmission of imagery.\n\nSome of the F-14A aircraft underwent engine upgrades to the GE F110-400 in 1987. These upgraded Tomcats were redesignated F-14A+, which was later changed to F-14B in 1991.Anft, Torsent. [http://www.anft.net/f-14/f14-serial.htm \"F-14 Bureau Numbers.\"] Home of M.A.T.S. Retrieved: 30 September 2006. The F-14D variant was developed at the same time; it included the GE F110-400 engines with newer digital avionics systems such as a glass cockpit, and compatibility with the Link 16 secure datalink.Friedman, Norman. \"F-14.\" The Naval Institute Guide to World Naval Weapon Systems, Fifth edition. Annapolis MD: Naval Institute Press, 2006. . The Digital Flight Control System (DFCS) notably improved the F-14's handling qualities when flying at a high angle of attack or in air combat maneuvering.[http://www.globalsecurity.org/military/systems/aircraft/f-14-upgrades.htm \"F-14 upgrades.\"] globalsecurity.org. Retrieved: 24 March 2012.\n\nWhile the F-14 had been developed as a lightweight alternative to the 80000 lb F-111B, the F-14 was still the heaviest and most expensive fighter of its time. VFAX was revived in the 1970s as a lower cost solution to replacing the Navy and Marine Corps's fleets of F-4s, and A-7s. VFAX was directed to review the fighters in the USAF Light Weight Fighter competition, which led to the development of the F/A-18 Hornet as roughly a midsize fighter and attack aircraft.  In 1994, Congress would reject Grumman proposals to the Navy to upgrade the Tomcat beyond the D model (such as the Super Tomcat 21, the cheaper QuickStrike version, and the more advanced Attack Super Tomcat 21).Donald 2004, pp. 13, 15.\n\nGround attack upgrades\n\nIn the 1990s, with the pending retirement of the A-6 Intruder, the F-14 air-to-ground program was resurrected. Trials with live bombs had been carried out in the 1980s; the F-14 was cleared to use basic iron bombs in 1992. In Operation Desert Storm, most air-to-ground missions were left to A-7, A-6 Intruder and F/A-18 Hornet squadrons, while the F-14 focused on air defense operations. Following Desert Storm, F-14As and F-14Bs underwent upgrades to avionics and cockpit displays to enable the use of precision munitions, enhance defensive systems, and apply structural improvements. The new avionics were comparable with the F-14D; upgraded aircraft were designated F-14A (Upgrade) and F-14B (Upgrade) respectively.Donald, David. \"Northrop Grumman F-14 Tomcat, U.S. Navy today\". Warplanes of the Fleet. London: AIRtime Publishing Inc, 2004. .\n\nBy 1994, Grumman and the Navy were proposing ambitious plans for Tomcat upgrades to plug the gap between the retirement of the A-6 and the F/A-18E/F Super Hornet entering service. However, the upgrades would have taken too long to implement to meet the gap, and were priced in the billions; Congress considered this too expensive for an interim solution. A quick, inexpensive upgrade using the Low Altitude Navigation and Targeting Infrared for Night (LANTIRN) targeting pod was devised. The LANTIRN pod provided the F-14 with a forward-looking infrared (FLIR) camera for night operations and a laser target designator to direct laser-guided bombs (LGB).Gobel, Greg. [https://web.archive.org/web/20070214074428/http://www.vectorsite.net/avtomcat_2.html#m1#m1 \"Bombcat / Tomcat In Service 1992:2005\".] Vectorsite.net, 1 November 2006. Retrieved: 8 December 2009. Although LANTIRN is traditionally a two-pod system, an AN/AAQ-13 navigation pod with terrain-following radar and a wide-angle FLIR, along with an AN/AAQ-14 targeting pod with a steerable FLIR and a laser target designator, the decision was made to only use the targeting pod. The Tomcat's LANTIRN pod was altered and improved over the baseline configuration, such as a Global Positioning System / Inertial Navigation System (GPS-INS) capability to allow an F-14 to accurately locate itself. The pod was carried on the right wing glove pylon.\n\nThe LANTIRN pod did not require changes to the F-14's own system software, but the pod was designed to operate on a MIL-STD-1553B bus not present on the F-14A or B.  Consequently, Martin Marietta specially developed an interface card for LANTIRN. The Radar Intercept Officer (RIO) would receive pod imagery on a 10-inch Programmable Tactical Information Display (PTID) or another Multi-Function Display in the F-14Pike, John. [http://www.globalsecurity.org/military/systems/aircraft/f-14-design.htm \"F-14 Tomcat Systems.\"] GlobalSecurity.org. Retrieved: 19 December 2010.[http://www.globalsecurity.org/military/library/policy/navy/ntsp/f-14-a.htm \"Approved Navy Training System Plan for the F-14A, F-14B, and F-14D Aircraft (N88-NTSP-A-50-8511B/A)\"]. globalsecurity.org rear cockpit and guided LGBs using a new hand controller installed on the right side console. Initially, the hand controller replaced the RIO's TARPS control panel, meaning a Tomcat configured for LANTIRN could not carry TARPS and the reverse, but eventually a workaround was later developed to allow a Tomcat to carry LANTIRN or TARPS as needed.\n\nAn upgraded LANTIRN named \"LANTIRN 40K\" for operations up to 40000 ft was introduced in 2001, followed by Tomcat Tactical Targeting (T3) and Fast Tactical Imagery (FTI), to provide precise target coordinate determination and ability to transmit images in-flight. Tomcats also added the ability to carry the GBU-38 Joint Direct Attack Munition (JDAM) in 2003, giving it the option of a variety of LGB and GPS-guided weapons. Some F-14Ds were upgraded in 2005 with a ROVER III Full Motion Video (FMV) downlink, a system that transmits real-time images from the aircraft's sensors to the laptop of Forward Air Controller (FAC) on the ground.\n\nDesign\n\nOverview\n\nThe F-14 Tomcat was designed as both an air superiority fighter and a long-range naval interceptor,Spangenberg, George. [https://web.archive.org/web/20120204214816/http://www.georgespangenberg.com/vf1.htm \"Brief History and Background of the F-14, 1955–1970.\"] George Spangenberg Oral History. Retrieved: 23 December 2009.Spangenberg, George.[https://web.archive.org/web/20120204215330/http://www.georgespangenberg.com/vf2.htm \"Exhibit VF-2.\"] George Spangenberg Oral History, 8 February 1965. Retrieved: 23 December 2009.Spangenberg, George. [https://web.archive.org/web/20120206140205/http://www.georgespangenberg.com/vf10.htm \"Statement of Mr. G.A. Spangenberg before the Senate Armed Services Subcommittee, June 1973.\"] George Spangenberg Oral History. Retrieved: 23 December 2009. which enabled it to both serve as escort attack aircraft when armed with Sparrow missiles and fleet air defense loitering interceptor role when armed with Phoenix missiles. The F-14 was designed with a two-seat cockpit with a bubble canopy which affords all-around visibility aiding aircrew in air-to-air combat. It features variable geometry wings that swing automatically during flight. For high-speed intercept, they are swept back and they swing forward for lower speed flight. It was designed to improve on the F-4 Phantom's air combat performance in most respects.\n\nThe F-14's fuselage and wings allow it to climb faster than the F-4, while the twin-tail arrangement offers better stability. The F-14 is equipped with an internal 20 mm M61 Vulcan Gatling cannon mounted on the left side (unlike the Phantom, which was not equipped with an internal gun in the US Navy), and can carry AIM-54 Phoenix, AIM-7 Sparrow, and AIM-9 Sidewinder anti-aircraft missiles. The twin engines are housed in widely spaced nacelles. The flat area of the fuselage between the nacelles is used to contain fuel and avionics systems, such as the wing-sweep mechanism and flight controls, as well as weaponry since the wings were not used for carrying ordnance. By itself, the fuselage provides approximately 40 to 60 percent of the F-14's aerodynamic lifting surface depending on the wing sweep position.Pike, John. [http://www.globalsecurity.org/military/systems/aircraft/f-14-design.htm \"F-14 Tomcat Design.\"] GlobalSecurity.org. Retrieved: 5 April 2012. The lifting body characteristics of the fuselage allowed one F-14 to safely land after suffering a mid-air collision that sheared off more than half of the plane's right wing in 1991.Leone, Dario. [http://theaviationist.com/2013/11/06/f-14-damaged/ \"F-14 Tomcat could land on carrier with missing radome, damaged wing\"] theaviationist.com. Retrieved: 10 March 2016\n\nVariable-geometry wings and aerodynamic design\n\nThe F-14's wing sweep can be varied between 20° and 68° in flight,Dorr 1991, p. 50. and can be automatically controlled by the Central Air Data Computer, which maintains wing sweep at the optimum lift-to-drag ratio as the Mach number varies; pilots can manually override the system if desired. When parked, the wings can be \"overswept\" to 75° to overlap the horizontal stabilizers to save deck space aboard carriers. In an emergency, the F-14 can land with the wings fully swept to 68°, although this presents a significant safety hazard due to greatly increased stall speed. Such an aircraft would typically be diverted from an aircraft carrier to a land base if an incident did occur. The F-14 has flown safely with an asymmetrical wing-sweep during testing, and was deemed able to land aboard a carrier if needed in an emergency.[http://www.f-14association.com/tales/the-story-of-f-14a-aircraft-no-3-buno-157982.html \"F-14A, Aircraft No. 3, BuNo. 157982.\"] F-14 Association. Retrieved: 10 March 2016. The wing pivot points were significantly spaced far apart. This had two benefits. The first was that weaponry could be fitted on a pylon on the fixed wing glove, liberating the wings from having swiveling pylons fitted, a feature which had proven to add significant drag on the F-111B. Since less of the total lifting area was variable, the centre of lift moved less as the wings moved reducing trim drag at high speed. When the wing was swept back, its thickness-to-chord-ratio decreased which allowed the aircraft to satisfy the mach 2.4 top speed required by the U.S. Navy. The body of the aircraft contributed significantly to overall lift and so the Tomcat possessed a lower wing loading than its wing area would suggest. When carrying four Phoenix missiles or other heavy stores between the engines this advantage was lost and maneuverability was reduced in those configurations.\n\nAilerons are not fitted, with roll control being provided by wing-mounted spoilers at low speed (which are disabled if the sweep angle exceeds 57°), and by differential operation of the all-moving tailerons at high speed. Full-span slats and flaps are used to increase lift both for landing and combat, with slats being set at 17° for landing and 7° for combat, while flaps are set at 35° for landing and 10° for combat. An air bag filled up the space occupied by the swept-back wing when the wing was in the forward position and a flexible fairing on top of the wing smoothed out the shape transition between the fuselage and top wing area. The twin tail layout helps in maneuvers at high angle of attack (AoA) while reducing the height of the aircraft to fit within the limited roof clearance of hangars aboard aircraft carriers.\nTwo triangular shaped retractable surfaces, called glove vanes, were originally mounted in the forward part of the wing glove, and could be automatically extended by the flight control system at high Mach numbers. They were used to generate additional lift (force) ahead of the aircraft's center of gravity, thus helping to compensate for mach tuck at supersonic speeds. Automatically deployed at above Mach 1.4, they allowed the F-14 to pull 7.5 g at Mach 2 and could be manually extended with wings swept full aft. They were later disabled, however, owing to their additional weight and complexity. The air brakes consist of top-and-bottom extendable surfaces at the rearmost portion of the fuselage, between the engine nacelles. The bottom surface is split into left and right halves, the tailhook hangs between the two halves, an arrangement sometimes called the \"castor tail\".Sgarlato 1988, pp. 40–46.\n\nEngines and structure\n\nThe F-14 was initially equipped with two Pratt & Whitney TF30 (or JTF10A) augmented turbofan engines, each rated at 20,900 lb (93 kN) of thrust, which enabled the aircraft to attain a maximum speed of Mach 2.34. The F-14 would normally fly at a cruising speed for reduced fuel consumption, which was important for conducting lengthy patrol missions.Laurence K. Loftin, Jr. [http://www.hq.nasa.gov/pao/History/SP-468/ch10-3.htm \"Part II: The Jet Age, Chapter 10: Technology of the Jet Airplane, Turbojet and Turbofan Systems.\"] Quest for Performance: The Evolution of Modern Aircraft, 29 February 2009. Retrieved: 29 January 2009. Both of the engine's rectangular air intake ramps were equipped with movable ramps and bleed doors to meet the airflow requirements of the engine but prevent dangerous shockwaves from entering. De Laval nozzles were also fitted to the engine's exhaust.\n\nThe performance of the TF30 engine became an object of criticism. John Lehman, Secretary of the Navy in the 1980s, told the U.S. Congress that the TF30/F-14 combination was \"probably the worst engine/airframe mismatch we have had in years\" and that the TF30 was \"a terrible engine\"; 28% of all F-14 accidents were attributed to the engine. A high frequency of turbine blade failures led to the reinforcement of the entire engine bay to limit damage from such failures. The engines also had proved to be extremely prone to compressor stalls, which could easily result in loss of control, severe yaw oscillations, and could lead to an unrecoverable flat spin. At specific altitudes, exhaust produced by missile launches could cause an engine compressor stall.  This led to the development of a bleed system that temporarily blocks the frontal intake ramp and reduces engine power during missile launch. With the TF30, the F-14's overall thrust-to-weight ratio at maximum takeoff weight is around 0.56, considerably less than the F-15A's ratio of 0.85; when fitted with the General Electric F110 engine, an improved thrust-to-weight ratio of 0.73 at maximum weight and 0.88 at normal takeoff weight was achieved.Spick 2000, p. 81. Despite having large differences in thrust, the F-14A, F-14B, and later F-14D with the newer GE F-110 engines were rated at the same top speed.NATOPS F-14B/F-14D flight manuals\n\nThe wings had a two-spar structure with integral fuel tanks. Around 25% of the structure is made of titanium, including the wing box, wing pivots, and upper and lower wing skins;Baugher, Joe. [http://www.joebaugher.com/navy_fighters/f14_2.html \"Grumman F-14A Tomcat.\"] Joe Baugher's Encyclopedia of American Military Aircraft, 13 February 2000. Retrieved: 6 May 2010. this is a light, rigid, and strong material and electron beam welding was used in the construction of the titanium parts.\n\nThe landing gear was very robust, in order to withstand catapult launches (takeoffs) and recoveries (landings) needed for carrier operations. It comprised a double nosewheel and widely spaced single main wheels. There were no hardpoints on the sweeping parts of the wings, and so all the armament is fitted on the belly between the air intake ramps and on pylons under the wing gloves.  Internal fuel capacity is 2400 gal: 290 gal in each wing, 690 gal in a series of tanks aft of the cockpit, and a further 457 gal in two feeder tanks. It can carry two 267 gal external drop tanks under the engine intake ramps. There is also an air-to-air refueling probe, which folds into the starboard nose.[http://www.globalsecurity.org/military/library/policy/navy/nrtc/14313.htm \"NAVEDTRA No: 14313, Aviation Ordanceman.\"] globalsecurity.org. Retrieved: 8 April 2011.\n\nAvionics and flight controls\n\nThe cockpit has two seats, arranged in tandem, outfitted with Martin-Baker GRU-7A rocket-propelled ejection seats, rated from zero altitude and zero airspeed up to 450 knots.Dorr 1991, p. 51. The canopy is spacious, and fitted with four mirrors to effectively provide all-round visibility. Only the pilot has flight controls; the flight instruments themselves are of a hybrid analog-digital nature. The cockpit also features a head-up display (HUD) to show primarily navigational information; several other avionics systems such as communications and direction-finders are integrated into the AWG-9 radar's display. A significant feature of the F-14 was its Central Air Data Computer (CADC), designed by Garrett AiResearch, that formed the onboard integrated flight control system. It used a MOSFET-based Large-Scale Integration chipset, the MP944, making it the first microprocessor in history.Holt, Ray M. [http://firstmicroprocessor.com/ \"The F-14A 'Tom Cat' Microprocessor.\"] firstmicroprocessor.com, 23 February 2009. Retrieved: 8 December 2009.\n\nThe aircraft's large nose contains a two-person crew and several bulky avionics systems. The main element is the Hughes AN/AWG-9 X band radar; the antenna is a 36 in-wide planar array, and has integrated Identification friend or foe antennas. The AWG-9 has several search and tracking modes, such as Track while scan (TWS), Range-While-Search (RWS), Pulse-Doppler Single-Target Track (PDSTT), and Jam Angle Track (JAT); a maximum of 24 targets can be tracked simultaneously, and six can be engaged in TWS mode up to around 60 mi. Cruise missiles are also possible targets with the AWG-9, which can lock onto and track small objects even at low altitude when in Pulse-Doppler mode. For the F-14D, the AWG-9 was replaced by the upgraded APG-71 radar.  The Joint Tactical Information Distribution System (JTIDS)/Link 16 for data communications was added later on.[http://www.rand.org/pubs/monograph_reports/MR1235.html \"Interoperability: A Continuing Challenge in Coalition Air Operations.\"] RAND Monograph Report. pp. 108, 111. Retrieved: 16 November 2010.\n\nThe F-14 also features electronic countermeasures (ECM) and radar warning receiver (RWR) systems, chaff/flare dispensers, fighter-to-fighter data link, and a precise inertial navigation system. The early navigation system was inertial-based, point-of-origin coordinates were programmed into a navigation computer and gyroscopes would track the aircraft's every motion to calculate distance and direction from that starting point. Global Positioning System later was integrated to provide more precise navigation and redundancy in case either system failed. The chaff/flare dispensers were located on the underside of the fuselage and on the tail. The RWR system consisted of several antennas on the aircraft's fuselage, which could roughly calculate both direction and distance of enemy radar users; it could also differentiate between search radar, tracking radar, and missile-homing radar.[http://www.fas.org/man/dod-101/sys/ac/equip/an-alr-67.htm \"AN/ALR-67(V)3 Advanced Special Receiver.\"] Federation of American Scientists. Retrieved: 29 December 2009.\n\nFeatured in the sensor suite was the AN/ALR-23, an Infra-red search and track sensor using indium antimonide detectors, mounted under the nose; however this was replaced by an optical system, Northrop's AAX-1, also designated TCS (TV Camera Set). The AAX-1 helped pilots visually identify and track aircraft, up to a range of 60 mi for large aircraft. The radar and the AAX-1 were linked, allowing the one detector to follow the direction of the other. A dual infrared/optical detection system was adopted on the later F-14D.\n\nArmament\n\nThe F-14 was designed to combat highly maneuverable aircraft as well as the Soviet anti-ship cruise missile and bomber (Tupolev Tu-16, Tupolev Tu-22, Tupolev Tu-22M) threats. The Tomcat was to be a platform for the AIM-54 Phoenix, but unlike the canceled F-111B, it could also engage medium- and short-range threats with other weapons. The F-14 was an air superiority fighter, not just a long-range interceptor aircraft.  Over 6700 kg of stores could be carried for combat missions on several hardpoints under the fuselage and under the wings. Commonly, this meant a maximum of two–four Phoenixes or Sparrows on the belly stations, two Phoenixes/Sparrows on the wing hardpoints, and two Sidewinders on the wing hardpoints. The F-14 was also fitted with an internal 20 mm M61 Vulcan Gatling-type cannon.\n\nOperationally, the capability to hold up to six Phoenix missiles was never used, although early testing was conducted; there was never a threat requirement to engage six hostile targets simultaneously and the load was too heavy to safely recover aboard an aircraft carrier in the event that the missiles were not fired. During the height of Cold War operations in the late 1970s and 1980s, the typical weapon loadout on carrier-deployed F-14s was usually only one AIM-54 Phoenix, augmented by two AIM-9 Sidewinders, two AIM-7 Sparrow IIIs, a full loadout of 20 mm ammunition and two drop tanks. The Phoenix missile was used twice in combat by the U.S. Navy, both over Iraq in 1999,Rausa, Zeno. [https://web.archive.org/web/20090405151051/http://findarticles.com/p/articles/mi_qa3834/is_199907/ai_n8861814/pg_4/ Vinson/CVW-11 \"Vinson/CVW-11 report.\"] Wings of Gold, Summer 1999. Retrieved: 8 December 2009.Holmes 2005, pp. 16, 17. but the missiles did not score any kills.\n\nIran made use of the Phoenix system, claiming several kills with it during the 1980–1988 Iran–Iraq War.  Iran tried to use other missiles on the Tomcat.  It attempted to integrate the Russian R-27R \"Alamo\" BVR missile, but was apparently unsuccessful.\n\nOperational history\n\nUnited States Navy\n\nThe F-14 began replacing the F-4 Phantom II in U.S. Navy service starting in September 1974 with squadrons VF-1 \"Wolfpack\" and VF-2 \"Bounty Hunters\" aboard  and participated in the American withdrawal from Saigon. The F-14 had its first kills in U.S. Navy service on 19 August 1981 over the Gulf of Sidra in what is known as the Gulf of Sidra incident. In that engagement, two F-14s from VF-41 Black Aces were engaged by two Libyan Su-22 \"Fitters\". The F-14s evaded the short range heat seeking AA-2 \"Atoll\" missile and returned fire, downing both Libyan aircraft. U.S. Navy F-14s once again were pitted against Libyan aircraft on 4 January 1989, when two F-14s from VF-32 shot down two Libyan MiG-23 \"Floggers\" over the Gulf of Sidra in a second Gulf of Sidra incident.\n\nIts first sustained combat use was as a photo reconnaissance platform. The Tomcat was selected to inherit the reconnaissance mission upon the departure of the dedicated RA-5C Vigilante and RF-8G Crusaders from the fleet. A large pod called the Tactical Airborne Reconnaissance Pod System (TARPS) was developed and fielded on the Tomcat in 1981. With the retirement of the last RF-8G Crusaders in 1982, TARPS F-14s became the U.S. Navy's primary tactical reconnaissance system.Baugher, Joe. [http://www.joebaugher.com/navy_fighters/f14_7.html \"TARPS Pod for F-14.\"] F-14 Tomcat, 13 February 2000. Retrieved: 6 May 2010. One of two Tomcat squadrons per airwing was designated as a TARPS unit and received 3 TARPS capable aircraft and training for 4 TARPS aircrews.\n\nWhile the Tomcat was being used by Iran in combat against Iraq in its intended air superiority mission in the early 1980s, the U.S. Navy found itself flying regular daily combat missions over Lebanon to photograph activity in the Bekaa Valley. At the time, the Tomcat had been thought too large and vulnerable to be used over land, but the need for imagery was so great that Tomcat aircrews developed high-speed medium altitude tactics to deal with considerable AAA and SA-7 SAM threat in the Bekaa area. The first exposure of a Navy Tomcat to an SA-2 missile was over Somalia in April 1983 when a local battery was unaware of two Tomcats scheduled for a TARPS mission in a prelude to an upcoming international exercise in the vicinity of Berbera. An SA-2 was fired at the second Tomcat while conducting 10,000-ft mapping profile at max conserve setting. The Tomcat aircrews spotted the missile launch and dove for the deck thereby evading it without damage. The unexpected demand for combat TARPS laid the way for high altitude sensors such as the KA-93 Long Range Optics (LOROP) to be rapidly procured for the Tomcat as well as an Expanded Chaff Adapter (ECA) to be incorporated in an AIM-54 Phoenix Rail. Commercial \"Fuzz buster\" type radar detectors were also procured and mounted in pairs in the forward cockpit as a stop gap solution to detect SAM radars such as the SA-6. The ultimate solution was an upgrade to the ALR-67 then being developed, but it would not be ready until the advent of the F-14A+ later in the 1980s.\n\nThe participation of the F-14 in the 1991 Operation Desert Storm consisted of Combat Air Patrol (CAP) over the Red Sea and the Persian Gulf and overland missions consisting of strike escort and reconnaissance. Until the waning days of Desert Storm, in-country air superiority was tasked to USAF F-15 Eagles due to the way the Air Tasking Orders (ATO) delegated primary overland CAP stations to the F-15 Eagle. The governing Rules of Engagement (ROE) also dictated a strict Identification Friend or Foe (IFF) requirement when employing Beyond Visual Range weapons such as the AIM-7 Sparrow and particularly the AIM-54 Phoenix. This hampered the Tomcat from using its most powerful weapon. Furthermore, the powerful emissions from the AWG-9 radar are detectable at great range with a radar warning receiver. Iraqi fighters routinely retreated as soon as the Tomcats \"lit them up\" with the AWG-9.Gillcrest 1994, p. 168.[http://www.simhq.com/_air/fixedwing_archive/Snodgrass.zip \"Capt. Dale \"Snort\" Snodgrass, USN (Ret.) Interview by John Sponauer\"]. (30 August 2000). SimHQ. Retrieved: 26 November 2010. The U.S. Navy suffered its only F-14 loss from enemy action on 21 January 1991 when BuNo 161430, an F-14A upgraded to an F-14A+, from VF-103 was shot down by an SA-2 surface-to-air missile while on an escort mission near Al Asad airbase in Iraq. Both crews survived ejection with the pilot being rescued by USAF Special Operation Forces and the RIO being captured by Iraqi troops as a POW until the end of the war.Baugher, Joe. [http://www.joebaugher.com/navy_serials/thirdseries21.html \"F-14.\"] U.S. Navy and U.S. Marine Corps BuNos, 30 September 2006. Retrieved: 6 May 2010. The F-14 also achieved its final kill in US service, a Mi-8 \"Hip\" helicopter, with an AIM-9 Sidewinder.\n\nIn 1995, F-14s from VF-14 and VF-41 participated in Operation Deliberate Force as well as Operation Allied Force in 1999, and in 1998, VF-32 and VF-213 participated in Operation Desert Fox. On 15 February 2001, the Joint Direct Attack Munition or JDAM was added to the Tomcat's arsenal. On 7 October 2001, F-14s would lead some of the first strikes into Afghanistan marking the start of Operation Enduring Freedom and the first F-14 drop of a JDAM occurred on 11 March 2002. F-14s from VF-2, VF-31, VF-32, VF-154, and VF-213 would also participate in Operation Iraqi Freedom. The F-14Ds of VF-2, VF-31, and VF-213 obtained JDAM capability in March 2003.[http://www.news.navy.mil/search/display.asp?story_id\n6431 \"U.S. Navy's F-14D Tomcats Gain JDAM Capability.\"]  Navy Newsstand (United States Navy), 21 March 2003. Retrieved: 20 January 2007. On 10 December 2005, the F-14Ds of VF-31 and VF-213 were upgraded with a ROVER III downlink for transmitting images to a ground Forward Air Controller (FAC).[http://www.news.navy.mil/search/display.asp?story_id\n21377 \"ROVER System Revolutionizes F-14's Ground Support Capability.\"]  Navy Newsstand (United States Navy), 14 December 2005. Retrieved: 20 January 2007.  The Navy decided to retire the F-14 with the F/A-18E/F Super Hornet filling the roles of fleet defense and strike formerly filled by the F-14.\n\nThe last American F-14 combat mission was completed on 8 February 2006, when a pair of Tomcats landed aboard  after one dropped a bomb over Iraq. During their final deployment with Theodore Roosevelt, VF-31 and VF-213 collectively completed 1,163 combat sorties totaling 6,876 flight hours, and dropped 9500 lb of ordnance during reconnaissance, surveillance, and close air support missions in support of Operation Iraqi Freedom.Murphy, Stephen. [http://www.news.navy.mil/search/display.asp?story_id22325 \"TR Traps Last Tomcat from Combat Mission.\"]  Navy Newsstand, 15 February 2006. Retrieved: 20 January 2007. USS Theodore Roosevelt launched an F-14D, of VF-31, for the last time on 28 July 2006; piloted by Lt. Blake Coleman and Lt. Cmdr Dave Lauderbaugh as RIO.[http://www.navy.mil/view_single.asp?id\n37561 \"Final launch of the F-14 Tomcat.\"] navy.mil. Retrieved: 8 December 2009. The last two F-14 squadrons, the VF-31 Tomcatters, and the VF-213 Black Lions conducted their last fly-in at Naval Air Station Oceana on 10 March 2006.[http://www.news.navy.mil/search/display.asp?story_id=22637 \"Squadron Homecoming Marks End of Era for Tomcats\".]  U.S. Navy, 10 March 2006. Retrieved: 20 January 2007.\n\nThe official final flight retirement ceremony was on 22 September 2006 at Naval Air Station Oceana and was flown by Lt. Cmdr. Chris Richard and Lt. Mike Petronis as RIO in a backup F-14 after the primary aircraft experienced mechanical problems.Tiernan, Bill. [http://content.hamptonroads.com/story.cfm?story\n111479&ran132499 \"F-14's Final Flight.\"]  Virginian-Pilot, 23 September 2006.Vanden Brook, Tom. [https://www.usatoday.com/news/nation/2006-09-22-F14-tomcat_x.htm \"Navy retires F-14, the Coolest of Cold Warriors\".] USA Today, 22 September 2006. Retrieved: 20 January 2007. The actual last flight of an F-14 in U.S. service took place 4 October 2006, when an F-14D of VF-31 was ferried from NAS Oceana to Republic Airport on Long Island, New York. The remaining intact F-14 aircraft in the U.S. were flown to and stored at the 309th Aerospace Maintenance and Regeneration Group \"Boneyard\", at Davis-Monthan Air Force Base, Arizona; in 2007 the U.S. Navy announced plans to shred the remaining F-14s to prevent any components from being acquired by Iran.[http://deseretnews.com/dn/view/0,1249,680195918,00.html \"Pentagon shreds F-14s to keep parts from enemies.\"] AP, 2 July 2007. Retrieved: 8 December 2009. In August 2009, the 309th AMARG stated that the last aircraft were taken to HVF West, Tucson, Arizona for shredding. At that time only 11 F-14s remained in desert storage.\n\nIran\n\nThe sole foreign customer for the Tomcat was the Imperial Iranian Air Force, during the reign of the last Shah (King) of Iran, Mohammad Reza Pahlavi. In the early 1970s, the Imperial Iranian Air Force (IIAF) was searching for an advanced fighter, specifically one capable of intercepting Soviet MiG-25 reconnaissance flights. After a visit of U.S. President Richard Nixon to Iran in 1972, during which Iran was offered the latest in American military technology, the IIAF narrowed its choice between the F-14 Tomcat or the McDonnell Douglas F-15 Eagle. Grumman Corporation arranged a competitive demonstration of the Eagle against the Tomcat before the Shah, and in January 1974, Iran ordered 30 F-14s and 424 AIM-54 Phoenix missiles, initiating Project Persian King, worth US$300 million. A few months later, this order was increased to a total of 80 Tomcats and 714 Phoenix missiles as well as spare parts and replacement engines for 10 years, complete armament package, and support infrastructure (including construction of the Khatami Air Base near Isfahan).\n\nThe first F-14 arrived in January 1976, modified only by the removal of classified avionics components, but fitted with the TF-30-414 engines. The following year 12 more were delivered. Meanwhile, training of the first groups of Iranian crews by the U.S. Navy was underway in the US; one of these conducted a successful shoot-down with a Phoenix missile of a target drone flying at 50000 ft.\n\nFollowing the overthrow of the Shah in 1979, the air force was renamed the Islamic Republic of Iran Air Force (IRIAF) and the post-revolution interim government of Iran canceled most Western arms orders. In 1980, an Iranian F-14 shot down an Iraqi Mil Mi-25 helicopter for its first air-to-air kill during the Iran–Iraq War (1980–1988).Cooper, Tom. [http://www.airspacemag.com/military-aviation/persiancats.html Persian Cats: How Iranian air crews, cut off from U.S. technical support, used the F-14 against Iraqi attackers.\"] Air & Space Magazine, November 2006. Retrieved: 24 March 2012. According to research by Tom Cooper, Iranian F-14s scored at least 50 air-to-air victories in the first six months of the war against Iraqi MiG-21s, MiG-23s, and some Su-20s/22s. During the same period, only one Iranian F-14 suffered damage after being hit by a nearby MiG-21 when it exploded.\n\nIranian Tomcats were originally used as an early-warning platform assisting other less-sophisticated aircraft with targeting and defense. They were also crucial to the defense of areas deemed vital by the Iranian government, such as oil terminals on Kharg Island and industrial infrastructure in the capital Tehran. Many of these patrols had the support of Boeing 707-3J9C in-flight refueling tankers. As fighting escalated between 1982 and 1986, the F-14s gradually became more involved in the battle. They performed well, but their primary role was to intimidate the Iraqi Air Force and avoid heavy engagement to protect the fleet's numbers. Their presence was often enough to drive away opposing Iraqi fighters. The precision and effectiveness of the Tomcat's AWG-9 weapons system and AIM-54A Phoenix long-range air-to-air missiles enabled the F-14 to maintain air superiority.\n\nBy 1987, the Iraqis had suffered heavy losses and were forced to find a solution to level the battlefield. They obtained Mirage F.1EQ-6 fighters from France in 1988, armed with Super530D and Magic Mk.2 air-to-air missiles. The Mirage F.1 fighters were eventually responsible for three confirmed F-14 kills. The IRIAF attempted to keep 60 F-14s operational throughout the war, but reports indicate this number was reduced to 30 by 1986 with only half fully mission-capable.Cooper, Tom and Farzad Bishop. Iranian F-14 Tomcat Units in Combat, p. 70. Oxford: Osprey Publishing, 2004. .\n\nThe combat record of IRIAF F-14s is disputed. Western sources estimates four or five kills, while Iranian claims 35–45 kills.  Cooper and Bishop states that Iranian F-14s shot down at least 160 Iraqi aircraft during the Iran–Iraq War, including 58 MiG-23s, 33 Mirage F1s, 23 MiG-21s, 23 Su-20s/22s, nine MiG-25s, five Tu-22s, two MiG-27s, one Mil Mi-24, one Dassault Mirage 5, one B-6D, one Aérospatiale Super Frelon, and two unidentified aircraft. Despite the circumstances the F-14s and their crews faced during the war against Iraq – lacking support from AWACS, AEW aircraft, and Ground Control Intercept (GCI) – the F-14 proved to be successful in combat. It achieved this in the midst of a confrontation with an enemy that was constantly upgrading its capabilities and receiving support from three major countries – France, the US, and the USSR. Part of the success is attributed to the resilient Iranian economy and IRIAF personnel.\n\nWhile Iraq's army claimed it shot down more than 70 F-14s, the Foreign Broadcast Information System in Washington DC estimated that Iran lost 12 to 16 during the war. Cooper writes only three F-14 were shot down by Iraqis and four by Iranian surface-to-air missiles (SAM). Two Tomcats were lost in unknown circumstances during the battle, and seven crashed due to technical failure or accidents.Cooper and Bishop, p. 84. During the war, the Iranian Air Force F-14s suffered 9 confirmed losses, one lost due to engine stall, one in unknown conditions, two by Iranian Hawk SAMs, two by MIG-23s and three were shot down by Mirage F-1EQs. There are also unconfirmed reports of the downing of 10 more Tomcats.http://www.ejection-history.org.uk/country-by-country/Iran_F-14_.htm\n\nOn 31 August 1986, an Iranian F-14A armed with at least one AIM-54A missile defected to Iraq. In addition, one or more of Iran's F-14A was delivered to the Soviet Union in exchange for technical assistance; at least one of its crew defected to the Soviet Union.\"F-14 Tomcat interceptors in Iran\". Ivanov, Grigoriy, 2003\n\nIran had an estimated 44 F-14s in 2009 according to Combat Aircraft.Cooper, Tom and Liam Devlin. \"Iranian Air Power Combat Aircraft\". Combat Aircraft, Vol. 9 No. 6, January 2009. Aviation Week estimated it had 19 operational F-14s in January 2013,\"World Military Aircraft Inventory\". 2013 Aerospace Source Book. Aviation Week and Space Technology, 2013. and Flight Global estimated that 28 were in service in 2014.\n\nIn January 2007, the U.S. Department of Defense announced that sales of spare F-14 parts would be suspended over concerns of the parts ending up in Iran.[http://news.bbc.co.uk/1/hi/world/middle_east/6315957.stm \"US halts sale of F-14 jet parts.\"] BBC News. Retrieved: 8 December 2009. In July 2007, the remaining American F-14s were shredded to ensure that any parts could not be acquired. In 2010, Iran requested that the U.S. deliver the 80th F-14 it had purchased in 1974, but delivery was denied after the Islamic Revolution.[http://www.tehrantimes.com/Index_view.asp?code\n224172 \"Iranian Air Force seeks return of F-14 bombers from U.S.\"] Tehran TimesParsons, Gary. [http://www.airforcesmonthly.com/view_news.asp?ID=2378 \"Iran wants its F-14 back.\"]  AirForces Monthly, 5 August 2010. In October 2010, an Iranian Air Force commander claimed that the country overhauls and optimizes different types of military aircraft, mentioning that Air Force has installed Iran-made radar systems on the F-14.[http://www.highbeam.com/doc/1G1-255136166.html \"Iranian Air Force Equips F-14 Fighter Jets with Hi-Tech Radars.\"] FARS News Agency, Iran, 5 January 2011. Retrieved: 9 September 2012.\n\nOn 26 January 2012, an Iranian F-14 crashed three minutes after takeoff. Both crew members were killed.[https://web.archive.org/web/20120128065039/http://www.washingtonpost.com/world/middle-east/iranian-f-14-fighter-jet-crashes-in-countrys-south-both-pilot-and-co-pilot-killed/2012/01/26/gIQAhzESSQ_story.html \"Iranian F-14 fighter jet crashes in country's south, both pilot and co-pilot killed.\"] Washington Post, 26 January 2012. Retrieved: 24 March 2012.\n\nIn November 2015, Iranian F-14s had been reported flying escort for Russian Tu-95 bombers on air strikes in Syria against the Islamic State of Iraq and the Levant.[http://foxtrotalpha.jalopnik.com/new-video-of-f-14-tomcat-escorts-and-cruise-missiles-as-1743807778 \"New Video Of F-14 Tomcat Escorts And Cruise Missiles As Russia Steps Up Syria Offensive\"]. foxtrotalpha.jalopnik.com, 20 November 2015. Retrieved: 21 November 2015.\n\nVariants\n\nA total of 712 F-14s were built[http://www.anft.net/f-14/f14-serial.htm \"F-14 Bureau Numbers.\"] anft.net. Retrieved: 8 December 2009. from 1969 to 1991.Anft, Torsten. [http://www.anft.net/f-14/grumman-gmp.htm \"Grumman Memorial Park.\"] Home of M.A.T.S. Retrieved: 28 December 2006. F-14 assembly and test flights were performed at Grumman's plant in Calverton on Long Island, New York. Grumman facility at nearby Bethpage, New York was directly involved in F-14 manufacturing and was home to its engineers. The airframes were partially assembled in Bethpage and then shipped to Calverton for final assembly. Various tests were also performed at the Bethpage Plant. Over 160 of the U.S. aircraft were destroyed in accidents.Anft, Torsent. [http://www.anft.net/f-14/f14-serial-date.htm \"F-14 Crashes sorted by Date.\"] Home of M.A.T.S. Retrieved: 1 January 2008.\n\nF-14A\n\nThe F-14A was the initial two-seat, twin-engine, all-weather interceptor fighter variant for the U.S. Navy. It first flew on 21 December 1970. The first 12 F-14As were prototype versionsSpick 2000, pp. 75–79. (sometimes called YF-14As). Modifications late in its service life added precision strike munitions to its armament. The U.S. Navy received 478 F-14A aircraft and 79 were received by Iran. The final 102 F-14As were delivered with improved Pratt & Whitney TF30-P-414A engines.[http://www.globalsecurity.org/military/systems/aircraft/f-14-variants.htm \"F-14 Tomcat variants\".] GlobalSecurity.org. Retrieved: 20 September 2006. Additionally, an 80th F-14A was manufactured for Iran, but was delivered to the U.S. Navy.\n\nF-14B\n\nThe F-14 received its first of many major upgrades in March 1987 with the F-14A Plus (or F-14A+). The F-14A's TF30 engine was replaced with the improved GE F110-GE-400 engine. The F-14A+ also received the state-of-the-art ALR-67 Radar Homing and Warning (RHAW) system. Much of the avionics, as well as, the AWG-9 radar were retained. The F-14A+ was later redesignated F-14B on 1 May 1991. A total of 38 new aircraft were manufactured and 48 F-14A were upgraded into B variants.\n\nThe TF30 had been plagued from the start with susceptibility to compressor stalls at high AoA and during rapid throttle transients or above 30000 ft. The F110-GE-400 engine provided a significant increase in thrust, producing 23400 lbf with afterburner at sea level, which rose to 30200 lbf at Mach 0.9.NAVAIR 01-F-14AAD-1A F-14D NATOPS FLIGHT MANUAL January 2004 PART 1 CH-2 Section 2.2 \"Engine\" pg \"2–9\". The increased thrust gave the Tomcat a better than 1:1 thrust-to-weight ratio at low fuel quantities. The basic engine thrust without afterburner was powerful enough for carrier launches, further increasing safety. Another benefit was allowing the Tomcat to cruise comfortably above 30000 ft, which increased its range and survivability.  The F-14B arrived in time to participate in Desert Storm.\n\nIn the late 1990s, 67 F-14Bs were upgraded to extend airframe life and improve offensive and defensive avionics systems. The modified aircraft became known as F-14B Upgrade.\n\nF-14D\n\nThe final variant of the F-14 was the F-14D Super Tomcat. The F-14D variant was first delivered in 1991. The original TF-30 engines were replaced with General Electric F110-400 engines, similar to the F-14B. The F-14D also included newer digital avionics systems including a glass cockpit and replaced the AWG-9 with the newer AN/APG-71 radar. Other systems included the Airborne Self Protection Jammer (ASPJ), Joint Tactical Information Distribution System (JTIDS), SJU-17(V) Naval Aircrew Common Ejection Seats (NACES), and Infra-red search and track (IRST).[https://web.archive.org/web/20100504214359/http://www.lockheedmartin.com/news/press_releases/2010/MFC_042810_LM_DevelopingF-15C_IRST.html \"Developing F-15C.\"] Lockheed Martin Press Release, 28 April 2010.\n\nThe GE F110-400 engine provided increased thrust and additional endurance to extend range or to stay on station much longer. In the overland attack role this gave the F-14D 60 percent more striking range or one-third more time on station. The Rate of climb was increased by 61 percent. The F110's increased thrust allowed almost all carrier launches to be made in military (dry) power. While this did result in fuel savings, the main reason not to use afterburner during carrier launches was that if an engine failed the F110's thrust in full afterburner would produce a yawing moment too abruptly for the pilot to correct. Thus the launch of an F-14D with afterburner was rare, while the F-14A required full afterburner unless very lightly loaded.\n\nAlthough the F-14D was to be the definitive version of the Tomcat, not all fleet units received the D variant. In 1989, Secretary of Defense Dick Cheney refused to approve the purchase of any more F-14D model aircraft for $50 million each and pushed for a $25 million modernization of the F-14 fleet instead. Congress decided not to shut production down and funded 55 aircraft as part of a compromise. A total of 37 new aircraft were completed, and 18 F-14A models were upgraded to D-models, designated F-14D(R) for a rebuild. An upgrade to the F-14D's computer software to allow AIM-120 AMRAAM missile capability was planned but was later terminated.\n\nWhile upgrades had kept the F-14 competitive with modern fighter aircraft technology, Cheney called the F-14 1960s technology. Despite an appeal from the Secretary of the Navy for at least 132 F-14Ds and some aggressive proposals from Grumman for a replacement,Jenkins 1997, p. 30. Cheney planned to replace the F-14 with a fighter that was not manufactured by Grumman. Cheney called the F-14 a \"jobs program\", and when the F-14 was canceled, an estimated 80,000 jobs of Grumman employees, subcontractors, or support personnel were affected.Saul, Stephanie. \"Cheney Aims Barrage at F-14D Calls keeping jet a jobs program.\" Newsday Washington Bureau, 24 August 1989, p. 6. Starting in 2005, some F-14Ds received the ROVER III upgrade.\n\nProjected variants\n\nThe first F-14B was to be an improved version of the F-14A with more powerful \"Advanced Technology Engine\" F401 turbofans.  The F-14C was a projected variant of this initial F-14B with advanced multi-mission avionics.Spick 2000, p. 75.  Grumman also offered an interceptor version of the F-14B in response to the U.S. Air Force's Improved Manned Interceptor Program to replace the Convair F-106 Delta Dart as an Aerospace Defense Command interceptor in the 1970s.  The F-14B program was terminated in April 1974.Isham, Marty. U.S. Air Force Interceptors: A Military Photo Logbook 1946–1979. North Branch, Minnesota: Specialty Press Publications, 2010. .\n\nGrumman proposed a few improved Super Tomcat versions. The first was the Quickstrike, which was an F-14D with navigational and targeting pods, additional attach points for weapons, and added ground attack capabilities to its radar. The Quickstrike was to fill the role of the A-6 Intruder after it was retired. This was not considered enough of an improvement by Congress, so the company shifted to the Super Tomcat 21 proposed design. The Super Tomcat 21 was a proposed lower cost alternative to the Navy Advanced Tactical Fighter (NATF). The Grumman design would have the same shape and body as the Tomcat, and an upgraded AN/APG-71 radar. New GE F110-129 engines were to provide a supercruise speed of Mach 1.3 and featured thrust vectoring nozzles. The version would have increased fuel capacity and modified control surfaces for improved takeoffs and lower landing approach speed. The Attack Super Tomcat 21 version was the last Super Tomcat proposed design. It added even more fuel capacity, more improvements to control surfaces, and possibly an active electronically scanned array (AESA) radar from the canceled A-12 attack aircraft.\n\nThe last \"Tomcat\" variant was the ASF-14 (Advanced Strike Fighter-14), Grumman's replacement for the NATF concept. By all accounts, it would not be even remotely related to the previous Tomcats save in appearance, incorporating the new technology and design know-how from the Advanced Tactical Fighter (ATF) and Advanced Tactical Aircraft (ATA) programs. The ASF-14 would have been a new-build aircraft; however, its projected capabilities were not that much better than that of the (A)ST-21 variants.[http://anft.net/f-14/f14-history-f14x.htm \"F-14 History.\"] anft.net. Retrieved: 16 November 2010. In the end, the Attack Super Tomcat was considered to be too costly. The Navy decided to pursue the cheaper F/A-18E/F Super Hornet to fill the fighter-attack role.Donald 2004, pp. 9–11.\n\nOperators\n\n;\n* Islamic Republic of Iran Air Force\n** 72nd TFS: F-14A, 1976–1985\n** 73rd TFS: F-14A, 1977–1985\n** 81st TFS: F-14A, 1977–present\n** 82nd TFS: F-14A, 1978–present\n** 83rd Tomcat Flight School: F-14A, 1978–1979\n** 83rd TFS: F-14A, renamed former 62nd TFSTaghvaee, Babak. Aviation News Monthly, UK: Key Publishing, March 2012.\n\nFormer operators\n\n;\n* United States Navy operated F-14 from 1974 to 2006\n** Navy Fighter Weapons School (TOPGUN) (Merged with Strike University (Strike U) to form Naval Strike and Air Warfare Center (NSAWC) 1996)\n*** VF-126 Bandits (Disestablished 1 April 1994)\n** VF-1 Wolfpack (Disestablished 30 September 1993)\n** VF-2 Bounty Hunters (Pacific Fleet through 1996, Atlantic Fleet 1996–2003, Pacific Fleet 2003–present; redesignated VFA-2 with F/A-18F, 1 July 2003)\n** VF-11 Red Rippers (Redesignated to VFA-11 with F/A-18F, May 2005)\n** VF-14 Tophatters (Redesignated VFA-14 with F/A-18E, 1 December 2001, and transferred to Pacific Fleet, 2002)\n** VF-21 Freelancers (Disestablished 31 January 1996)\n** VF-24 Fighting Renegades (Disestablished 20 August 1996)\n** VF-31 Tomcatters (Redesignated VFA-31 with F/A-18E, October 2006)\n** VF-32 Swordsmen (Redesignated VFA-32 with F/A-18F, 1 October 2005)\n** VF-33 Starfighters (Disestablished 1 October 1993)\n** VF-41 Black Aces (Redesignated VFA-41 with F/A-18F, 1 December 2001)\n** VF-51 Screaming Eagles (Disestablished 31 March 1995)\n** VF-74 Bedevilers (Disestablished 30 April 1994)\n** VF-84 Jolly Rogers (Disestablished 1 October 1995; squadron heritage and nickname transferred to VF-103)\n** VF-102 Diamondbacks (Redesignated VFA-102 with F/A-18F, 1 May 2002, and transferred to Pacific Fleet)\n** VF-103 Sluggers/Jolly Rogers (Redesignated VFA-103 with F/A-18F, 1 May 2005)\n** VF-111 Sundowners (Disestablished 31 March 1995; squadron heritage and nickname adopted by VFC-111)\n** VF-114 Aardvarks (Disestablished 30 April 1993)\n** VF-142 Ghostriders (Disestablished 30 April 1995)\n** VF-143 Pukin' Dogs (Redesignated VFA-143 with F/A-18E, early 2005)\n** VF-154 Black Knights (Redesignated VFA-154 with F/A-18F, 1 October 2003)\n** VF-191 Satan's Kittens (Disestablished 30 April 1988)\n** VF-194 Red Lightnings (Disestablished 30 April 1988)\n** VF-211 Fighting Checkmates (Pacific Fleet through 1996, then transferred to Atlantic Fleet; redesignated VFA-211 with F/A-18F, 1 October 2004)\n** VF-213 Black Lions (Pacific Fleet through 1996, then transferred to Atlantic Fleet; redesignated VFA-213 with F/A-18F, May 2006)\n* Naval Air Systems Command Test and Evaluation Squadrons\n** VX-4 Evaluators (Disestablished 30 September 1994 and merged into VX-5 to form VX-9)\n** VX-9 Vampires (Currently operates F/A-18C/D/E/F, EA-18G, F-35C, EA-6B, AV-8B, AH-1 and UH-1)\n** VX-23 Salty Dogs (Currently operates F/A-18A+/B/C/D/E/F, EA-6B, EA-18G, F-35C and T-45)\n** VX-30 Bloodhounds (Currently operates P-3, C-130, S-3)\n* Fleet Replacement Squadrons\n** VF-101 Grim Reapers; Atlantic Fleet, then sole single-site, F-14 FRS (Disestablished 15 September 2005; squadron heritage and nickname adopted by a recently established unit, designated VFA-101, which is currently the sole F-35C Fleet Replacement Squadron in May 2012)[http://www.navy.mil/submit/display.asp?story_id=66309 Navy's Newest Squadron Prepares for New F-35 Fighters]. Navy.mil. Retrieved on 2013-08-16.\n** VF-124 Gunfighters; Pacific Fleet F-14 FRS\n***(Disestablished 30 September 1994)\n* Naval Air Force Reserve Squadrons\n** VF-201 Hunters (Redesignated VFA-201 and reequipped with F/A-18A+ on 1 January 1999; disestablished 30 June 2007)\n** VF-202 Superheats (Disestablished 31 December 1994)\n** VF-301 Devil's Disciples (Disestablished 11 September 1994)\n** VF-302 Stallions (Disestablished 11 September 1994)\n* Naval Air Force Reserve Squadron Augmentation Units (SAUs)\n** VF-1285 Fighting Fubijars (Disestablished September 1994);[http://www.anft.net/f-14/f14-squadron-vf1285.htm \"VF-1285.\"] anft.net. Retrieved: 8 December 2009. augmented VF-301 and VF-302\n** VF-1485 Americans (Disestablished September 1994);[http://www.anft.net/f-14/f14-squadron-vf1485.htm \"VF-1485.\"] anft.net. Retrieved: 8 December 2009. augmented VF-124\n** VF-1486 Fighting Hobos (Disestablished September 2005);[http://www.anft.net/f-14/f14-squadron-vf1486.htm \"VF-1486.\"] anft.net. Retrieved: 8 December 2009. augmented VF-101\n\nAircraft on display\n\nNotable F-14s preserved at museums and military installations include:\n;Bureau Number (BuNo) – Model – Location – Significance\n;F-14A\n*157982 – Cradle of Aviation Museum, Garden City, New York. Prototype #3 Nonstructural demonstration testbed.[http://www.cradleofaviation.org/history/permanent_exhibits/jet_gallery/grumman_f-14a_tomcat.html \"F-14 Tomcat/157982.\"]  Cradle of Aviation Museum. Retrieved: 10 December 2015.\n*157984 – National Naval Aviation Museum, Naval Air Station Pensacola, Florida. Fifth F-14 manufactured and one of the prototypes used in flight testing. Mounted on pedestal at entrance to museum.[http://www.navalaviationmuseum.org/attractions/aircraft-exhibits/item/?item\nf-14a_tomcat \"F-14 Tomcat/157984.\"] National Naval Aviation Museum. Retrieved: 10 December 2015.\n*157988 – NAS Oceana Air Park, Virginia.[http://warbirdregistry.org/jetregistry/f14-157988.html \"F-14 Tomcat/157988.\"] Warbird Registry. Retrieved: 27 March 2013.\n*157990 – March Field Air Museum, Riverside, California.[https://web.archive.org/web/20141020165530/http://www.marchfield.org/aircraft-exhibits/aircraft/yf-14a-tomcat-grumman/ \"F-14 Tomcat/157990.\"] March Field Air Museum. Retrieved: 10 December 2015.\n*158617 – Veterans of Foreign Wars (VFW) Post 7293, Whitehall, Pennsylvania.\n*158623 – Naval Base Ventura County, NAS Point Mugu, California. Pedestal mount at Front Gate Airpark.[http://aerialvisuals.ca/LocationDossier.php?Serial=1857 \"F-14 Tomcat/158623.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*158627 – Hickory Aviation Museum, Hickory, NC.\n*158978 – USS Midway Museum, San Diego, California.[http://www.midway.org/Aircraft-Museum \"F-14 Tomcat/158978.\"] USS Midway Museum. Retrieved: 27 March 2013.\n*158985 – Yanks Air Museum, Chino, California.[https://yanksair.com/Products/64/70/Grumman-G-303-Tomcat-F-14A/ \"F-14 Tomcat/158985.\"] Yanks Air Museum. Retrieved: 27 March 2013.\n*158998 – Air Victory Museum, Lumberton, New Jersey.[http://www.airvictorymuseum.org/html/displays.html \"F-14 Tomcat/158998.\"] Air Victory Museum. Retrieved: 27 Match 2013.\n*158999 – Naval Air Station Joint Reserve Base Fort Worth (former Carswell AFB), Fort Worth, Texas.[http://aerialvisuals.ca/LocationDossier.php?Serial=3764 \"F-14 Tomcat/158999.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159025 – Patriot's Point Naval and Maritime Museum, Charleston, South Carolina.[http://www.patriotspoint.org/pdf/aircraft/f-14a_tomcat.pdf \"F-14 Tomcat/159025.\"] Patriot's Point Maritime and Naval Museum. Retrieved: 27 March 2013.\n*159445 – Naval Station Norfolk (former Naval Air Station Norfolk) East Gate Airpark, Virginia.[http://warbirdregistry.org/jetregistry/f14-159445.html \"F-14 Tomcat/159445.\"] Warbird Registry. Retrieved: 27 March 2013.\n*159448 – Naval Inventory Control Point, Pennsylvania.[http://aerialvisuals.ca/LocationDossier.php?Serial=3559 \"F-14 Tomcat/159448.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159455 – NAS Patuxent River, Lexington Park, Maryland. Former VX-23 flight test squadron aircraft.[http://aerialvisuals.ca/LocationDossier.php?Serial=2732 \"F-14 Tomcat/159455.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159600 – Fort Worth Aviation Museum, Fort Worth, Texas[http://vmap.wikispaces.com/F-14D+Tomcat \"F-14 Tomcat/159600.\"]  Fort Worth Aviation Museum. Retrieved: 1 April 2015.\n*159620 – NAF El Centro, California.[http://aerialvisuals.ca/LocationDossier.php?Serial=1768 \"F-14 Tomcat/159620.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159626 – Naval Strike and Air Warfare Center, Naval Air Station Fallon, Nevada.[http://aerialvisuals.ca/LocationDossier.php?Serial=3023 \"F-14 Tomcat/159626.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159631 – San Diego Aerospace Museum, San Diego, California.[http://aerialvisuals.ca/AirframeDossier.php?Serial=477 \"F-14 Tomcat/159631.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159829 – Wings Over the Rockies Air and Space Museum, former Lowry AFB, Denver, Colorado. From VF-211, later used for aircraft maintenance training by Naval Air Reserve Center Denver at Buckley AFB.[https://web.archive.org/web/20150317054351/http://wingsmuseum.org/f14-tomcat/ \"F-14 Tomcat/159829.\"] Wings Over the Rockies Air & Space Museum. Retrieved: 10 December 2015.\n*159830 – Western Museum of Flight, Torrance, California.[http://www.wmof.com/f14a.htm \"F-14 Tomcat/159830.\"] Western Museum of Flight. Retrieved: 27 March 2013.\n*159848 – Tillamook Air Museum, Tillamook, Oregon.[http://www.tillamookair.com/grumman-f-14a-tomcat \"F-14 Tomcat/159848.\"] Tillamook Air Museum. Retrieved: 10 December 2015.\n*159853 – Defense Supply Center Richmond, Richmond, Virginia.[http://aerialvisuals.ca/LocationDossier.php?Serial=3955 \"F-14 Tomcat/159853.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*159856 – Naval Air Facility El Centro, California.[http://www.warbirdregistry.org/jetregistry/f14-159856.html \"F-14 Tomcat/159856.\"] Warbird Registry. Retrieved: 27 March 2013.\n*160382 – Museum of Flight, Tukwila, Washington. VF-84 \"Jolly Rogers\" AJ202. Stationed on the USS Nimitz. This aircraft, as well as several other F-14As from the famous \"Jolly Rogers\" squadron, appear in the 1980 film The Final Countdown which was filmed on board the USS Nimitz. On loan from the National Museum of Naval Aviation at Pensacola, Florida.[http://www.museumofflight.org/aircraft/grumman-f-14a-tomcat \"F-14 Tomcat/160382.\"] Museum of Flight. Retrieved: 27 March 2013.\n*160386 – Great Lakes Naval Training Center, Great Lakes NAS, Chicago, Illinois.[http://aerialvisuals.ca/LocationDossier.php?Serial=2382 \"F-14 Tomcat/160386.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160391 – Texas Air Museum, Lubbock, Texas.[http://www.thetexasairmuseum.org/aircraft/staticaircraft/F-14/ \"F-14 Tomcat/160391.\"] Texas Air Museum. Retrieved: 27 March 2013,\n*160395 – Air Zoo, Kalamazoo, Michigan.[http://www.airzoo.org/page.php?page_id=210 \"F-14 Tomcat/160395.\"] Air Zoo. Retrieved: 28 March 2013.\n*160401 – Fleet Area Control and Surveillance Facility Virginia Capes (FACSFAC VACAPES), Naval Air Station Oceana, Virginia.[http://aerialvisuals.ca/LocationDossier.php?Serial=9610 \"F-14 Tomcat/160401.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160403 – American Airpower Heritage Museum, Midland, Texas.[http://airpowermuseum.org/?pagecms/index&cms_page\n85 \"F-14 Tomcat/160403.\"] Air Power Museum. Retrieved: 28 March 2013 It is one of the aircraft involved in 1981 Gulf of Sidra incident.\n*160411 – Empire State Aerosciences Museum, Glenville, New York.[http://www.esam.org/ \"F-14 Tomcat/160441.\"] Empire State Aeroscience Museum. Retrieved: 29 March 2013.\n*160658 – NAES Lakehurst, New Jersey.[http://aerialvisuals.ca/LocationDossier.php?Serial=3062 \"F-14 Tomcat/160658.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160661 – U.S. Space and Rocket Center's Aviation Challenge facility in Huntsville, Alabama.[http://aerialvisuals.ca/LocationDossier.php?Serial=1552 \"F-14 Tomcat/160661.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160666 – Western Aerospace Museum, Oakland, California. Originally delivered to VF-111 in 1978, subsequently reassigned to NAVAIR test duties, permanently modified for development of follow-on avionics and weapons systems.[http://oaklandaviationmuseum.org/aircraft_3.html \"F-14 Tomcat/160666.\"] Oakland Aviation Museum. Retrieved: 28 March 2013.\n*160684 – Pima Air and Space Museum, adjacent to Davis-Monthan AFB, Tucson, Arizona. Repainted in its original markings as \"NL 211\" of VF-111 aboard USS KITTY HAWK (CV-63), as this particular aircraft appeared in its initial operational squadron service, c. 1978–1981.[http://www.pimaair.org/aircraft-by-name/item/grumman-f-14a-tomcat \"F-14 Tomcat/160684.\"] Pima Air & Space Museum. Retrieved: 10 December 2015.\n*160694 – USS Lexington Museum, Corpus Christi, Texas. Painted with Hi-Vis markings of VF-103 \"Jolly Rogers\". Aircraft is on loan from the National Museum of Naval Aviation at NAS Pensacola, Florida.[http://usslexington.com/aircraft/f-14-tomcat/ \"F-14 Tomcat/160694.\"] USS Lexington Museum. Retrieved: 28 March 2013.  Used in the film Top  Gun.\n*160889 – Pacific Coast Air Museum at Charles M. Schulz Sonoma County Airport, Santa Rosa, California.[http://www.pacificcoastairmuseum.org/aircraft/F14ATomcat.asp \"F-14 Tomcat/160889.\"] Pacific Coast Air Museum. Retrieved: 28 March 2013.\n*160898 – Palm Springs Air Museum, Palm Springs, California.[https://web.archive.org/web/20151031001630/http://palmspringsairmuseum.org/aircraft-2/ \"F-14 Tomcat/160898.\"] Palm Springs Air Museum. Retrieved: 10 December 2015.\n*160902 – Grumman Memorial Park, Calverton, New York.[http://aerialvisuals.ca/LocationDossier.php?Serial=3170 \"F-14 Tomcat/160902.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160903 – Mid-America Air Museum, Liberal Mid-America Regional Airport, Liberal, Kansas.[http://aerialvisuals.ca/LocationDossier.php?Serial=2614 \"F-14 Tomcat/160903.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*160909 – Dobbins Air Reserve Base, Atlanta, Georgia.[http://aerialvisuals.ca/LocationDossier.php?Serial=2235 \"F-14 Tomcat/160909.\"] aerialvisuals.ca. Retrieved: 27 March 2013.\n*160914 – Willmar Municipal Airport, Wilmar, Minnesota[http://aerialvisuals.ca/LocationDossier.php?Serial=4275 \"F-14 Tomcat/160914.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n* 160925 - on display at Eisenhower Park, WaKeeney, Kansas [http://www.wakeeney.org/tour/f-14-tomcat-fighter-jet ]\n*161134 – Valiant Air Command Warbird Museum, Space Coast Regional Airport, Titusville, Florida.[http://www.valiantaircommand.com/#!static-collection/cee5 \"F-14 Tomcat/161134.\"] Valiant Air Command Warbird Museum. Retrieved: 10 December 2015.\n*161598 – Tulsa Air and Space Museum, Tulsa, Oklahoma. It has VF-41 \"Black Aces\" markings.[http://www.tulsaairandspacemuseum.org/ \"F-14 Tomcat/161598.\"] Tulsa Air and Space Museum. Retrieved: 10 December 2015.\n*161860 Aviation Museum of Kentucky\n*162591 – Quonset Air Museum, Quonset State Airport (former Naval Air Station Quonset Point), North Kingstown, Rhode Island.[https://web.archive.org/web/20140129023711/http://www.quonsetairmuseum.com/index.php?page=exhibitions#prettyPhoto \"F-14 Tomcat/162591.\"] Quonset Air Museum. Retrieved: 10 December 2015. Museum closed in 2016 due to damage from a snowstorm the previous year.\n*162592 – Ronald Reagan Presidential Library, Simi Valley, California.[http://aerialvisuals.ca/LocationDossier.php?Serial=1988 \"F-14 Tomcat/162592.\"] aerialvisuals.ca Retrieved: 1 July 2015.\n*162608 – Southern Museum of Flight, Birmingham, Alabama.[http://aerialvisuals.ca/LocationDossier.php?Serial=1525 \"F-14 Tomcat/162608.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*162689 – , USS Hornet Museum, former Naval Air Station Alameda, Alameda, California.[https://web.archive.org/web/20081226153447/http://www.uss-hornet.org/exhibits/aircraft/jet/tomcat.shtml \"F-14 Tomcat/162689.\"] USS Hornet Museum. Retrieved: 28 March 2013.\n*162694 – MAPS Air Museum, North Canton, Ohio.[https://sites.google.com/a/mapsairmuseum.org/f-14-tomcat/home \"F-14 Tomcat/162694.\"] MAPS Air Museum. Retrieved: 28 March 2013.\n*162710 – National Naval Aviation Museum, Naval Air Station Pensacola, Florida.[http://www.navalaviationmuseum.org/attractions/aircraft-exhibits/item/?item=f-14a_tomcat_flightline \"F-14 Tomcat/162710.\"] National Naval Aviation Museum. Retrieved: 10 December 2015.\n;F-14B\n*157986 – , Intrepid Sea-Air-Space Museum, Manhattan, New York. 7th Tomcat built, retained as research and development airframe.[http://www.intrepidmuseum.org/AircraftCollection.aspx \"F-14 Tomcat/157986.\"] USS Intrepid Museum. Retrieved: 10 December 2015.\n*161605 – Wings of Eagles Discovery Center/National Warplane Museum, Horseheads, New York.[http://www.wingsofeagles.com/?page_id=535 \"F-14 Tomcat/161605.\"] Wings of Eagles Discovery Center. Retrieved: 28 March 2013.\n*161615 – Combat Air Museum, Topeka, Kansas.[http://combatairmuseum.org/aircraft/grummanF14A.html \"F-14 Tomcat/161615.\"] Combat Air Museum. Retrieved: 28 March 2013.\n*161620 – Selfridge Military Air Museum, Selfridge Air National Guard Base, Mount Clemens, Michigan.[http://www.selfridgeairmuseum.org/F-14A.htm \"F-14 Tomcat/161620.\"] Selfridge Military Air Museum. Retrieved: 10 December 2015.\n*161623 – Patuxent River Naval Air Museum, Naval Air Station Patuxent River, Lexington Park, Maryland. It is a former VX-23 flight test squadron aircraft.[https://web.archive.org/web/20110130150933/http://paxmuseum.com/page/aircraft-1 \"F-14 Tomcat/161623.\"] Patuxent River Naval Air Museum. Retrieved: 28 March 2013.\n*162912 – Grissom Air Museum, Grissom Air Reserve Base (former Grissom AFB), Indiana.[http://www.grissomairmuseum.com/gallery/fighters/plane-11 \"F-14 Tomcat/162912.\"] Grissom Air Museum. Retrieved: 28 March 2013.\n*162916 – Veterans of Foreign Wars (VFW) Post 8896 – Richard R. Gross Post, East Berlin, Pennsylvania.[http://aerialvisuals.ca/LocationDossier.php?Serial=3531 \"F-14 Tomcat/162916.\"] aerialvisuals.ca. Retrieved: 9 December 2015.\n*162926 – New England Air Museum, Windsor Locks, Connecticut.[http://neam.org/index.php?optioncom_content&view\narticle&id=90 \"F-14 Tomcat/162926.\"] New England Air Museum. Retrieved: 28 March 2013.\n*162911 – Estrella Warbird Museum, Paso Robles, California. \n;F-14D(R)\n*159600 – OV-10 Bronco Museum, Fort Worth, Texas. On loan from the National Museum of Naval Aviation, NAS Pensacola, Florida. Nicknamed \"Christine\", it was the longest-serving F-14 Tomcat in U.S. Navy. Remanufactured from F-14A to F-14D(R) configuration, it was originally built in 1976 and made the final combat deployment/cruise of the F-14 in 2006.[http://vmapaircraft.weebly.com/f-14d-tomcat.html \"F-14 Tomcat/159600.\"] OV-10 Bronco Museum. Retrieved: 10 December 2015.\n*159610 – Smithsonian National Air & Space Museum, Steven F. Udvar-Hazy Center, Chantilly, Virginia. This F-14 was one of those involved in the second Gulf of Sidra incident.[https://web.archive.org/web/20120522101842/http://airandspace.si.edu/collections/artifact.cfm?id=A20040156000 \"F-14 Tomcat/159610.\"] NASM. Retrieved: 27 March 2013.\n*159619 – Florida Air Museum at Sun 'n Fun, Lakeland Linder Regional Airport, Lakeland, Florida.[http://aerialvisuals.ca/LocationDossier.php?Serial=2157 \"F-14 Tomcat/159619.\"] aerialvisuals.ca. Retrieved: 9 December 2015.\n*161159 – National Naval Aviation Museum, Naval Air Station Pensacola, Florida.  Completed the last combat flight and the last combat carrier arrested landing (trap) by a U.S. Navy F-14.[http://www.navalaviationmuseum.org/attractions/aircraft-exhibits/item/?item=f-14d_tomcat \"F-14 Tomcat/157984.\"] National Naval Aviation Museum.  Retrieved: 10 December 2015.\n*161163 – Prairie Aviation Museum, Bloomington, Illinois. Depot Level Conversion performed September 1991. Retired as MODEX 205 of Fighter Squadron 213 (VF-213), Black Lions.[http://prairieaviationmuseum.org/exhibits/aircraft/grumman-f-14d-tomcat/ \"F-14 Tomcat/161163.\"] Prairie Aviation Museum. Retrieved: 28 March 2013.\n*161166 – Carolinas Aviation Museum, Charlotte, North Carolina.[http://www.carolinasaviation.org/military/grumman-f-14d-tomcat \"F-14 Tomcat/161166.\"] Carolinas Aviation Museum. Retrieved: 29 Marc 2013.\n*162595 – Naval Test Wing Atlantic, Naval Air Station Patuxent River, Maryland.[http://aerialvisuals.ca/LocationDossier.php?Serial=2732 \"F-14 Tomcat/162595.\"] aerialvisuals.ca. Retrieved: 9 December 2015.\n;F-14D\n*163893 – main gate, Arnold Engineering and Development Center, Arnold AFB, Tennessee.[http://aerialvisuals.ca/LocationDossier.php?Serial=3654 \"F-14 Tomcat/163893.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*163897 – Aerospace Museum of California, McClellan Airfield (former McClellan AFB and current Coast Guard Air Station Sacramento), Sacramento, California.[http://www.aerospaceca.org/grumman-f-14d-tomcat/ \"F-14 Tomcat/163897.\"]  Aerospace Museum of California. Retrieved: 28 March 2013.\n*163902 – Hickory Aviation Museum at Hickory Regional Airport, Hickory, North Carolina.  VF-31 Tomcatters aircraft Modex number 107; flew the F-14 retirement ceremony with LCDR Chris Richard and LT Mike Petronis at the controls.[https://web.archive.org/web/20150818121909/http://hickoryaviationmuseum.org/Assets/GrummanF-14D-Tomcat_LB_02.png \"F-14 Tomcat/163902.\"] Hickory Aviation Museum. Retrieved: 10 December 2015.\n*163904 – Pacific Aviation Museum, Ford Island, Joint Base Pearl Harbor-Hickam, Hawaii.[http://www.pacificaviationmuseum.org/aircraft/F14D/ \"F-14 Tomcat/163904.\"] Pacific Aviation Museum. Retrieved: 10 December 2015.\n*164342 – Wings Over Miami, Miami, Florida.[http://www.wingsovermiami.com/exhibits/ \"F-14 Tomcat/164342.\"] Wings Over Miami Air Museum. Retrieved: 28 March 2013.\n*164343 – Evergreen Aviation Museum, McMinnville, Oregon.[http://www.evergreenmuseum.org/the-museum/aircraft-exhibits/military-aircrafts/ \"F-14 Tomcat/164343.\"] Evergreen Aviation Museum. Retrieved: 29 March 2013.\n*164346 – Virginia Aviation Museum, Richmond, Virginia. On loan from National Museum of Naval Aviation, Pensacola, Florida. Last Tomcat to operationally trap aboard a U.S. Navy aircraft carrier.[https://web.archive.org/web/20130617170406/http://www.vam.smv.org/militaryaircraft.html \"F-14 Tomcat/164346.\"] Virginia Aviation Museum. Retrieved: 28 March 2013.\n*164350 – Joe Davies Heritage Airpark at Palmdale Plant 42, Palmdale, California.[http://aerialvisuals.ca/LocationDossier.php?Serial=1868 \"F-14 Tomcat/164350.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*164601 – Castle Air Museum at former Castle AFB, Atwater, California.[http://www.castleairmuseum.org/grummanf14d \"F-14 Tomcat/164601.\"]  Castle Air Museum. Retrieved: 10 December 2015.\n*164603 – Grumman Headquarters, Bethpage, New York. Felix 101 from VF-31 is the last Tomcat to fly in U.S. Navy service. Final flight was from NAS Oceana, Virginia to the American Airpower Museum at Republic Airport Long Island, New York on 4 October 2006 where it was displayed for a year and a half before being moved to Grumman Plant 25.[http://aerialvisuals.ca/LocationDossier.php?Serial=6403 \"F-14 Tomcat/164603.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*164604 – NAS Oceana Memorial Park, Naval Air Station Oceana, Virginia. Last F-14 manufactured, assigned to VX-4, later VX-9, at Naval Air Station Point Mugu, California during its operational service and used the callsign \"Vandy 1\".[http://aerialvisuals.ca/LocationDossier.php?Serial=3969 \"F-14 Tomcat/164604.\"] aerialvisuals.ca. Retrieved: 8 December 2015.\n*Painted with Jolly Roger design at – Cape May Aviation Museum, Cape May, New Jersey 08204\n\nSpecifications (F-14D)\n\nTomcat logo\n\nThe Tomcat logo design came when Grumman's Director of Presentation Services, Dick Milligan, and one of his artists, Grumman employee Jim Rodriguez, were asked for a logo by Grumman's Director of Business Development and former Blue Angels #5 pilot, Norm Gandia. Per Rodriguez, \"He asked me to draw a lifelike Tomcat wearing boxing gloves and trunks sporting a six-shooter on his left side; where the guns are located on the F-14, along with two tails.\"  The Cat was drawn up after a tabby cat was sourced and used for photographs, and named \"Tom\".  The logo has gone through many variations, including one for the then–Imperial Iranian Air Force F-14, called \"Ali-cat\".  The accompanying slogan \"Anytime Baby!\" was developed by Norm Gandia as a challenge to the U.S. Air Force's McDonnell Douglas F-15 Eagle.[http://www.grummanpark.org/content/tomcat-logo The Tomcat Logo | Grumman Memorial Park]. Grummanpark.org. Retrieved on 2013-08-16.\n\nNotable appearances in media\n\nThe F-14 Tomcat most notably appeared in the 1986 action film Top Gun. It also featured prominently in the film The Final Countdown. Grumman F-14 Tomcat. http://en.wikipedia.org/?curid=11719."
  }
}
