{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14581",
  "eid" : "159bd2b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778545499,
  "textBody" : "\"Ich bin ein Berliner\" (, \"I am a Berliner\") is a quotation from a June 26, 1963, speech by U.S. President John F. Kennedy in West Berlin. It is widely regarded as the best-known speech of the Cold War and the most famous anti-communist speech. Kennedy aimed to underline the support of the United States for West Germany 22 months after Soviet-supported East Germany erected the Berlin Wall to prevent mass emigration to the West. The message was aimed as much at the Soviets as it was at Berliners and was a clear statement of U.S. policy in the wake of the construction of the Berlin Wall. Another phrase in the speech was also spoken in German, \"Lasst sie nach Berlin kommen\" (\"Let them come to Berlin\"), addressed at those who claimed \"we can work with the Communists\", a remark at which Nikita Khrushchev scoffed only days later. The quotation was just short of five months before Kennedy was assassinated later that same year.\n\nThe speech is considered one of Kennedy's best, both a notable moment of the Cold War and a high point of the New Frontier. It was a great morale boost for West Berliners, who lived in an enclave deep inside East Germany and feared a possible East German occupation. Speaking from a platform erected on the steps of Rathaus Schöneberg for an audience of 450,000, Kennedy said,\n\nKennedy used the phrase twice in his speech, including at the end, pronouncing the sentence with his Boston accent and reading from his note \"ish bin ein Bearleener\", which he had written out using English orthography to approximate the German pronunciation. He also used classical Latin pronunciation of civis romanus sum, with the c pronounced /k/ and the v as /w/.\n\nThere is a widespread misconception (outside German-speaking countries) that the phrase is incorrect German and in fact means \"I'm a doughnut\". It has even been embellished into an urban legend including equally incorrect claims about the audience laughing at this phrase.\n\nBackground\n\nGermany's capital, Berlin, was deep within the area controlled after World War II by the Soviet Union. Initially governed in four sectors controlled by the four Allied powers (United States, United Kingdom, France and the Soviet Union), tensions of the Cold War escalated until the Soviet forces implemented the Berlin Blockade, which the Western allies relieved with the dramatic airlift. Afterward, the sectors controlled by the NATO Allies became an effective exclave of West Germany, completely surrounded by East Germany. From 1952, the border between East and West was closed everywhere but in Berlin. Hundreds of thousands of East Germans defected to the West via West Berlin, a labour drain that threatened East Germany with economic collapse.\n\nIn 1961, the East German government under Walter Ulbricht erected a barbed-wire barrier around West Berlin, officially called the antifaschistischer Schutzwall (anti-fascist protective barrier). The East German authorities argued that it was meant to prevent spies and agents of West Germany from crossing into the East. However, it was universally known as the Berlin Wall and its real purpose was to keep East German citizens from escaping to the West. Over a period of months the wall was rebuilt using concrete, and buildings were demolished to create a \"death zone\" in view of East German guards armed with machine guns. The Wall closed the biggest loophole in the Iron Curtain, and Berlin went from being one of the easiest places to cross from East Europe to West Europe to being one of the most difficult.Keeling, Drew (2014), [http://www.business-of-migration.com/migration-processes/other-regions/berlin-wall-and-migration/ \"Berlin Wall and Migration,\" Migration as a travel business]\n\nThe West, including the U.S., was accused of failing to respond forcefully to the erection of the Wall. Officially, Berlin was under joint occupation by the four allied powers, each with primary responsibility for a certain zone. Kennedy's speech marked the first instance where the U.S. acknowledged that East Berlin was part of the Soviet bloc along with the rest of East Germany. On July 25, 1961, Kennedy insisted in a presidential address that the U.S. would defend West Berlin, asserting its Four-Power rights, while making it clear that challenging the Soviet presence in Germany was not possible.\n\nGenesis and execution of the speech\n\nOrigins\n\nThe Ich bin ein Berliner speech is in part derived from a speech Kennedy gave at a Civic Reception on May 4, 1962, in New Orleans; there also he used the phrase civis Romanus sum by saying \"Two thousand years ago the proudest boast was to say, \"I am a citizen of Rome.\" Today, I believe, in 1962 the proudest boast is to say, \"I am a citizen of the United States.\" And it is not enough to merely say it; we must live it. Anyone can say it. But Americans who serve today in West Berlin—your sons and brothers --[...] are the Americans who are bearing the great burden.\" The phrases \"I am a Berliner\" and \"I am proud to be in Berlin\" were typed already a week before the speech on a list of expressions to be used, including a phonetic transcription of the German translation. Such transcriptions are also found in the third draft of the speech (in Kennedy's own handwriting), from June 25. The final typed version of the speech does not contain the transcriptions, which are added by hand by Kennedy himself.\n\nIn practice sessions before the trip, Kennedy had run through a number of sentences, even paragraphs, to recite in German; in these sessions, he was helped by Margaret Plischke, a translator working for the US State Department; by Ted Sorensen, Kennedy's counsel and habitual speechwriter; and by an interpreter, Robert Lochner, who had grown up in Berlin. It became clear quickly that the president did not have a gift for languages and was more likely to embarrass himself if he was to cite in German for any length.\n\nBut there are differing accounts on the origin of the phrase Ich bin ein Berliner. Plischke wrote a 1997 accountHer letter to American Heritage is printed anonymously; however, in the first-person story the writer refers to herself as \"Mrs. Plischke from the Foreign Service Institute.\" Additionally, she is named as Margarethe Plischke in [https://books.google.com/books?idbgMUqltiT2AC&pg\nPA217&lpgPA217&dq\nPlischke+Foreign+Service+Institute&sourcebl&ots\nCHDvpeEGj3&sigmYXeNVuhsDXpqvw05-20mbyVOE8&hl\nen&eiir_aTeOFMejz0gHIx5X8Aw&sa\nX&oibook_result&ct\nresult&resnum7&ved\n0CEkQ6AEwBg#vonepage&q\nPlischke%20Foreign%20Service%20Institute&ffalse Kennedy and the Berlin Wall] by W. R. Smyser, p. 217. Retrieved 2011-05-23. of visiting Kennedy at the White House weeks before the trip to help compose the speech and teach him the proper pronunciation; she also claims that the phrase had been translated stateside already by the translator scheduled to accompany him on the trip (\"a rather unpleasant man who complained bitterly that he had had to interrupt his vacation just to watch the President’s mannerisms\"). Additionally, Ted Sorensen claimed in his memoir Counselor: A Life at the Edge of History (2008) to have had a hand in the speech, and said he had incorrectly inserted the word ein, incorrectly taking responsibility for the \"jelly doughnut misconception\", below, a claim apparently supported by Berlin mayor Willy Brandt but dismissed by later scholars since the final typed version, which does not contain the words, is the last one Sorensen could have worked on. Robert Lochner claimed in his memoirs that Kennedy had asked him for a translation of \"I am a Berliner\", and that they practiced the phrase in Brandt's office. Daum credited  the origin of the phrase Ich bin ein Berliner to Kennedy and his 1962 speech in New Orleans quoted above. According to Daum, Kennedy was affected by seeing the Berlin Wall, so that he \"falls back on the most memorable passage of his New Orleans speech given the year before, changing pride in being an American in being a Berliner.\"\n\nDelivery\n\nBehind the long table set up on the steps of the Rathaus Schöneberg were U.S. and German dignitaries, including Dean Rusk (Kennedy's Secretary of State), Lucius D. Clay (the US administrator of Germany), Konrad Adenauer (the German chancellor), Willy Brandt, and Otto Bach (President of the Abgeordnetenhaus of Berlin). The crowd was estimated at 450,000 people.This is the estimate given in Daum, Kennedy in Berlin 137. A BBC article has a much lower number, 120,000.  Bach spoke first, of the recent developments in Berlin, especially the wall. He was followed by Konrad Adenauer, who spoke briefly and introduced the president.\n\nKennedy was accompanied not by Robert Lochner, but by Heinz Weber of the Berlin mission; Weber translated the president's speech to the audience. Besides the typescript, Kennedy had a cue card on which he himself had written the phonetic spelling, and he surprised everyone by completely disregarding the speech, which had taken weeks to prepare. Instead, he improvised: \"He says more than he should, something different from what his advisers had recommended, and is more provocative than he had intended to be.\"\n\nThe speech culminated with the second use in the speech of the Ich bin ein Berliner phrase: \"Today, in the world of freedom, the proudest boast is Ich bin ein Berliner!\" The crowd was quiet while Weber translated and repeated the president's German line; Kennedy was obviously relieved at the crowd's positive response and thanked Weber for his translation. Weber translated this compliment also. According to Daum, after this first successful delivery, \"Kennedy, who fiddles a bit with his suit jacket, is grinning like a boy who has just pulled off a coup.\"\n\nKennedy's National Security Advisor McGeorge Bundy thought the speech had gone \"a little too far\", and the two revised the text for a softer stance before repeating the speech at the Freie Universität Berlin later that day.\n\nConsequences and legacy\n\nWhile the immediate response from the West German population was positive, the Soviet authorities were less pleased with the combative Lass sie nach Berlin kommen. Only two weeks before, Kennedy had spoken in a more conciliatory tone, speaking of \"improving relations with the Soviet Union\": in response to Kennedy's Berlin speech, Nikita Khrushchev, days later, remarked that \"one would think that the speeches were made by two different Presidents.\"\n\nRonald Reagan would evoke both the sentiment and the legacy of Kennedy's speech 24 years later in his \"Tear down this wall!\" speech.\n\nThere are commemorative sites to Kennedy in Berlin, such as the German-American John F. Kennedy School and the John F. Kennedy-Institute for North American Studies of the FU Berlin. The public square in front of the Rathaus Schöneberg was renamed John-F.-Kennedy-Platz. A large plaque dedicated to Kennedy is mounted on a column at the entrance of the building and the room above the entrance and overlooking the square is dedicated to Kennedy and his visit.\n\nThe original manuscript of the speech is stored with the National Archives and Records Administration.\n\n\"I'm a doughnut\" urban legend\n\n \n\nThere is a widespread perception that Kennedy made an embarrassing mistake by saying Ich bin ein Berliner.  By not leaving out the indefinite article \"ein,\" he supposedly changed the meaning of the sentence from the intended \"I am a citizen of Berlin\" to \"I am a Berliner\" (a Berliner being a type of German pastry, similar to a jelly doughnut).\n\nAccording to some grammar texts,Despite widespread claims to the contrary in most German grammars and textbooks, it is not incorrect to use an indefinite article before an indication of a person's origin, profession. As explained in the Duden-Grammatik: \"Der indefinite Artikel wird beim prädikativen Nominativ [...] oft weggelassen, wenn damit die Zugehörigkeit zu einer sozial etablierten und anerkannten Gruppe (Nationalität, Herkunft, Beruf, Funktion, Weltanschauung, Religion, gesellschaftlicher Status usw.) angegeben wird (a). Zum Teil bestehen regionale Unterschiede im Gebrauch; ein strikter Standard hat sich nicht herausgebildet (b):  (a) Sie wird _ Hochbauzeichnerin. Er bleibt _ Junggeselle. (b) Er ist (ein) Engländer. Sie ist (eine) Heidelbergerin.\"  (Duden-Grammatik, 8. ed. 2009, p. 331. the indefinite article can be omitted in German when speaking of an individual's profession or origin but is in any case used when speaking in a figurative sense.[https://www.theatlantic.com/magazine/archive/2013/08/the-real-meaning-of-ich-bin-ein-berliner/309500/ The Real Meaning of Ich Bin ein Berliner], The Atlantic, cited in \n\nFurthermore, although the word \"Berliner\" is used for a jelly doughnut in the north, west and southwest of Germany, it is not used in Berlin itself or the surrounding region, where the usual word is \"Pfannkuchen.\"\n\nA further part of the misconception is that the audience to his speech laughed at his supposed error. They actually  cheered and applauded both times the phrase was used. They laughed and cheered a few seconds after the first use of the phrase when Kennedy joked with the interpreter: \"Thank you for correcting my pronunciation.\"\n\nA reference to this misconception appears in Len Deighton's spy novel Berlin Game, published in 1983, which contains the following passage, spoken by Bernard Samson:\n\nIn Deighton's novel, Samson is an unreliable narrator, and his words cannot be taken at face value. However, The New York Times review of Deighton's novel appeared to treat Samson's remark as factual and added the detail that Kennedy's audience found his remark funny:\n\nFour years later, it found its way into a New York Times op-ed:\n\nThe doughnut misconception has since been repeated by media such as the BBC (by Alistair Cooke in his Letter from America program), The Guardian, MSNBC,. CNN,. Time magazine, and The New York Times; mentioned in several books about Germany written by English-speaking authors, including Norman Davies. and Kenneth C. Davis; and used in the manual for the Speech Synthesis Markup Language. It is also mentioned in Robert Dallek's biography of Kennedy, An Unfinished Life: John F. Kennedy, 1917–1963.\n\nAnother reference to this misconception appears in David Foster Wallace's novel Infinite Jest, published in 1996, which contains the following passage:\n\nIn 1998 comedian Eddie Izzard made a joke using the same misconception in his Dress to Kill show.\n\nCultural references\n\nThe phrase and the legend are quoted very often in fiction and popular culture in the United States. Besides a direct quote, there exist many variations starting \"Ich bin ein (+ noun, e.g., Frankfurter, Hamburger)\" that is supposed to be understood by the primarily English-speaking audience based on the widespread knowledge of this German phrase and its myth. The phrase is perhaps ambiguous, but in context it is clear.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ich bin ein Berliner" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14581" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "\"Ich bin ein Berliner\" (, \"I am a Berliner\") is a quotation from a June 26, 1963, speech by U.S. President John F. Kennedy in West Berlin. It is widely regarded as the best-known speech of the Cold War and the most famous anti-communist speech. Kennedy aimed to underline the support of the United States for West Germany 22 months after Soviet-supported East Germany erected the Berlin Wall to prevent mass emigration to the West. The message was aimed as much at the Soviets as it was at Berliners and was a clear statement of U.S. policy in the wake of the construction of the Berlin Wall. Another phrase in the speech was also spoken in German, \"Lasst sie nach Berlin kommen\" (\"Let them come to Berlin\"), addressed at those who claimed \"we can work with the Communists\", a remark at which Nikita Khrushchev scoffed only days later. The quotation was just short of five months before Kennedy was assassinated later that same year.\n\nThe speech is considered one of Kennedy's best, both a notable moment of the Cold War and a high point of the New Frontier. It was a great morale boost for West Berliners, who lived in an enclave deep inside East Germany and feared a possible East German occupation. Speaking from a platform erected on the steps of Rathaus Schöneberg for an audience of 450,000, Kennedy said,\n\nKennedy used the phrase twice in his speech, including at the end, pronouncing the sentence with his Boston accent and reading from his note \"ish bin ein Bearleener\", which he had written out using English orthography to approximate the German pronunciation. He also used classical Latin pronunciation of civis romanus sum, with the c pronounced /k/ and the v as /w/.\n\nThere is a widespread misconception (outside German-speaking countries) that the phrase is incorrect German and in fact means \"I'm a doughnut\". It has even been embellished into an urban legend including equally incorrect claims about the audience laughing at this phrase.\n\nBackground\n\nGermany's capital, Berlin, was deep within the area controlled after World War II by the Soviet Union. Initially governed in four sectors controlled by the four Allied powers (United States, United Kingdom, France and the Soviet Union), tensions of the Cold War escalated until the Soviet forces implemented the Berlin Blockade, which the Western allies relieved with the dramatic airlift. Afterward, the sectors controlled by the NATO Allies became an effective exclave of West Germany, completely surrounded by East Germany. From 1952, the border between East and West was closed everywhere but in Berlin. Hundreds of thousands of East Germans defected to the West via West Berlin, a labour drain that threatened East Germany with economic collapse.\n\nIn 1961, the East German government under Walter Ulbricht erected a barbed-wire barrier around West Berlin, officially called the antifaschistischer Schutzwall (anti-fascist protective barrier). The East German authorities argued that it was meant to prevent spies and agents of West Germany from crossing into the East. However, it was universally known as the Berlin Wall and its real purpose was to keep East German citizens from escaping to the West. Over a period of months the wall was rebuilt using concrete, and buildings were demolished to create a \"death zone\" in view of East German guards armed with machine guns. The Wall closed the biggest loophole in the Iron Curtain, and Berlin went from being one of the easiest places to cross from East Europe to West Europe to being one of the most difficult.Keeling, Drew (2014), [http://www.business-of-migration.com/migration-processes/other-regions/berlin-wall-and-migration/ \"Berlin Wall and Migration,\" Migration as a travel business]\n\nThe West, including the U.S., was accused of failing to respond forcefully to the erection of the Wall. Officially, Berlin was under joint occupation by the four allied powers, each with primary responsibility for a certain zone. Kennedy's speech marked the first instance where the U.S. acknowledged that East Berlin was part of the Soviet bloc along with the rest of East Germany. On July 25, 1961, Kennedy insisted in a presidential address that the U.S. would defend West Berlin, asserting its Four-Power rights, while making it clear that challenging the Soviet presence in Germany was not possible.\n\nGenesis and execution of the speech\n\nOrigins\n\nThe Ich bin ein Berliner speech is in part derived from a speech Kennedy gave at a Civic Reception on May 4, 1962, in New Orleans; there also he used the phrase civis Romanus sum by saying \"Two thousand years ago the proudest boast was to say, \"I am a citizen of Rome.\" Today, I believe, in 1962 the proudest boast is to say, \"I am a citizen of the United States.\" And it is not enough to merely say it; we must live it. Anyone can say it. But Americans who serve today in West Berlin—your sons and brothers --[...] are the Americans who are bearing the great burden.\" The phrases \"I am a Berliner\" and \"I am proud to be in Berlin\" were typed already a week before the speech on a list of expressions to be used, including a phonetic transcription of the German translation. Such transcriptions are also found in the third draft of the speech (in Kennedy's own handwriting), from June 25. The final typed version of the speech does not contain the transcriptions, which are added by hand by Kennedy himself.\n\nIn practice sessions before the trip, Kennedy had run through a number of sentences, even paragraphs, to recite in German; in these sessions, he was helped by Margaret Plischke, a translator working for the US State Department; by Ted Sorensen, Kennedy's counsel and habitual speechwriter; and by an interpreter, Robert Lochner, who had grown up in Berlin. It became clear quickly that the president did not have a gift for languages and was more likely to embarrass himself if he was to cite in German for any length.\n\nBut there are differing accounts on the origin of the phrase Ich bin ein Berliner. Plischke wrote a 1997 accountHer letter to American Heritage is printed anonymously; however, in the first-person story the writer refers to herself as \"Mrs. Plischke from the Foreign Service Institute.\" Additionally, she is named as Margarethe Plischke in [https://books.google.com/books?idbgMUqltiT2AC&pg\nPA217&lpgPA217&dq\nPlischke+Foreign+Service+Institute&sourcebl&ots\nCHDvpeEGj3&sigmYXeNVuhsDXpqvw05-20mbyVOE8&hl\nen&eiir_aTeOFMejz0gHIx5X8Aw&sa\nX&oibook_result&ct\nresult&resnum7&ved\n0CEkQ6AEwBg#vonepage&q\nPlischke%20Foreign%20Service%20Institute&ffalse Kennedy and the Berlin Wall] by W. R. Smyser, p. 217. Retrieved 2011-05-23. of visiting Kennedy at the White House weeks before the trip to help compose the speech and teach him the proper pronunciation; she also claims that the phrase had been translated stateside already by the translator scheduled to accompany him on the trip (\"a rather unpleasant man who complained bitterly that he had had to interrupt his vacation just to watch the President’s mannerisms\"). Additionally, Ted Sorensen claimed in his memoir Counselor: A Life at the Edge of History (2008) to have had a hand in the speech, and said he had incorrectly inserted the word ein, incorrectly taking responsibility for the \"jelly doughnut misconception\", below, a claim apparently supported by Berlin mayor Willy Brandt but dismissed by later scholars since the final typed version, which does not contain the words, is the last one Sorensen could have worked on. Robert Lochner claimed in his memoirs that Kennedy had asked him for a translation of \"I am a Berliner\", and that they practiced the phrase in Brandt's office. Daum credited  the origin of the phrase Ich bin ein Berliner to Kennedy and his 1962 speech in New Orleans quoted above. According to Daum, Kennedy was affected by seeing the Berlin Wall, so that he \"falls back on the most memorable passage of his New Orleans speech given the year before, changing pride in being an American in being a Berliner.\"\n\nDelivery\n\nBehind the long table set up on the steps of the Rathaus Schöneberg were U.S. and German dignitaries, including Dean Rusk (Kennedy's Secretary of State), Lucius D. Clay (the US administrator of Germany), Konrad Adenauer (the German chancellor), Willy Brandt, and Otto Bach (President of the Abgeordnetenhaus of Berlin). The crowd was estimated at 450,000 people.This is the estimate given in Daum, Kennedy in Berlin 137. A BBC article has a much lower number, 120,000.  Bach spoke first, of the recent developments in Berlin, especially the wall. He was followed by Konrad Adenauer, who spoke briefly and introduced the president.\n\nKennedy was accompanied not by Robert Lochner, but by Heinz Weber of the Berlin mission; Weber translated the president's speech to the audience. Besides the typescript, Kennedy had a cue card on which he himself had written the phonetic spelling, and he surprised everyone by completely disregarding the speech, which had taken weeks to prepare. Instead, he improvised: \"He says more than he should, something different from what his advisers had recommended, and is more provocative than he had intended to be.\"\n\nThe speech culminated with the second use in the speech of the Ich bin ein Berliner phrase: \"Today, in the world of freedom, the proudest boast is Ich bin ein Berliner!\" The crowd was quiet while Weber translated and repeated the president's German line; Kennedy was obviously relieved at the crowd's positive response and thanked Weber for his translation. Weber translated this compliment also. According to Daum, after this first successful delivery, \"Kennedy, who fiddles a bit with his suit jacket, is grinning like a boy who has just pulled off a coup.\"\n\nKennedy's National Security Advisor McGeorge Bundy thought the speech had gone \"a little too far\", and the two revised the text for a softer stance before repeating the speech at the Freie Universität Berlin later that day.\n\nConsequences and legacy\n\nWhile the immediate response from the West German population was positive, the Soviet authorities were less pleased with the combative Lass sie nach Berlin kommen. Only two weeks before, Kennedy had spoken in a more conciliatory tone, speaking of \"improving relations with the Soviet Union\": in response to Kennedy's Berlin speech, Nikita Khrushchev, days later, remarked that \"one would think that the speeches were made by two different Presidents.\"\n\nRonald Reagan would evoke both the sentiment and the legacy of Kennedy's speech 24 years later in his \"Tear down this wall!\" speech.\n\nThere are commemorative sites to Kennedy in Berlin, such as the German-American John F. Kennedy School and the John F. Kennedy-Institute for North American Studies of the FU Berlin. The public square in front of the Rathaus Schöneberg was renamed John-F.-Kennedy-Platz. A large plaque dedicated to Kennedy is mounted on a column at the entrance of the building and the room above the entrance and overlooking the square is dedicated to Kennedy and his visit.\n\nThe original manuscript of the speech is stored with the National Archives and Records Administration.\n\n\"I'm a doughnut\" urban legend\n\n \n\nThere is a widespread perception that Kennedy made an embarrassing mistake by saying Ich bin ein Berliner.  By not leaving out the indefinite article \"ein,\" he supposedly changed the meaning of the sentence from the intended \"I am a citizen of Berlin\" to \"I am a Berliner\" (a Berliner being a type of German pastry, similar to a jelly doughnut).\n\nAccording to some grammar texts,Despite widespread claims to the contrary in most German grammars and textbooks, it is not incorrect to use an indefinite article before an indication of a person's origin, profession. As explained in the Duden-Grammatik: \"Der indefinite Artikel wird beim prädikativen Nominativ [...] oft weggelassen, wenn damit die Zugehörigkeit zu einer sozial etablierten und anerkannten Gruppe (Nationalität, Herkunft, Beruf, Funktion, Weltanschauung, Religion, gesellschaftlicher Status usw.) angegeben wird (a). Zum Teil bestehen regionale Unterschiede im Gebrauch; ein strikter Standard hat sich nicht herausgebildet (b):  (a) Sie wird _ Hochbauzeichnerin. Er bleibt _ Junggeselle. (b) Er ist (ein) Engländer. Sie ist (eine) Heidelbergerin.\"  (Duden-Grammatik, 8. ed. 2009, p. 331. the indefinite article can be omitted in German when speaking of an individual's profession or origin but is in any case used when speaking in a figurative sense.[https://www.theatlantic.com/magazine/archive/2013/08/the-real-meaning-of-ich-bin-ein-berliner/309500/ The Real Meaning of Ich Bin ein Berliner], The Atlantic, cited in \n\nFurthermore, although the word \"Berliner\" is used for a jelly doughnut in the north, west and southwest of Germany, it is not used in Berlin itself or the surrounding region, where the usual word is \"Pfannkuchen.\"\n\nA further part of the misconception is that the audience to his speech laughed at his supposed error. They actually  cheered and applauded both times the phrase was used. They laughed and cheered a few seconds after the first use of the phrase when Kennedy joked with the interpreter: \"Thank you for correcting my pronunciation.\"\n\nA reference to this misconception appears in Len Deighton's spy novel Berlin Game, published in 1983, which contains the following passage, spoken by Bernard Samson:\n\nIn Deighton's novel, Samson is an unreliable narrator, and his words cannot be taken at face value. However, The New York Times review of Deighton's novel appeared to treat Samson's remark as factual and added the detail that Kennedy's audience found his remark funny:\n\nFour years later, it found its way into a New York Times op-ed:\n\nThe doughnut misconception has since been repeated by media such as the BBC (by Alistair Cooke in his Letter from America program), The Guardian, MSNBC,. CNN,. Time magazine, and The New York Times; mentioned in several books about Germany written by English-speaking authors, including Norman Davies. and Kenneth C. Davis; and used in the manual for the Speech Synthesis Markup Language. It is also mentioned in Robert Dallek's biography of Kennedy, An Unfinished Life: John F. Kennedy, 1917–1963.\n\nAnother reference to this misconception appears in David Foster Wallace's novel Infinite Jest, published in 1996, which contains the following passage:\n\nIn 1998 comedian Eddie Izzard made a joke using the same misconception in his Dress to Kill show.\n\nCultural references\n\nThe phrase and the legend are quoted very often in fiction and popular culture in the United States. Besides a direct quote, there exist many variations starting \"Ich bin ein (+ noun, e.g., Frankfurter, Hamburger)\" that is supposed to be understood by the primarily English-speaking audience based on the widespread knowledge of this German phrase and its myth. The phrase is perhaps ambiguous, but in context it is clear. Ich bin ein Berliner. http://en.wikipedia.org/?curid=14581."
  }
}
