{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10166",
  "eid" : "f4323420-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778489442,
  "textBody" : "Enron Corporation was an American energy, commodities, and services company based in Houston, Texas. It was founded in 1985 as a merger between Houston Natural Gas and InterNorth, both relatively small regional companies. Before its bankruptcy on December 2, 2001, Enron employed approximately 20,000 staff and was one of the world's major electricity, natural gas, communications and pulp and paper companies, with claimed revenues of nearly $101 billion during 2000. Fortune named Enron \"America's Most Innovative Company\" for six consecutive years.\n\nAt the end of 2001, it was revealed that its reported financial condition was sustained by institutionalized, systematic, and creatively planned accounting fraud, known since as the Enron scandal. Enron has since become a well-known example of willful corporate fraud and corruption. The scandal also brought into question the accounting practices and activities of many corporations in the United States and was a factor in the enactment of the Sarbanes–Oxley Act of 2002. The scandal also affected the greater business world by causing the dissolution of the Arthur Andersen accounting firm.\n\nEnron filed for bankruptcy in the Southern District of New York in late 2001 and selected Weil, Gotshal & Manges as its bankruptcy counsel. It ended its bankruptcy during November 2004, pursuant to a court-approved plan of reorganization. A new board of directors changed the name of Enron to Enron Creditors Recovery Corp., and emphasized reorganizing and liquidating certain operations and assets of the pre-bankruptcy Enron. On September 7, 2006, Enron sold Prisma Energy International Inc., its last remaining business, to Ashmore Energy International Ltd. (now AEI). \n\nHistory\n\nPre-merger origins (1925–1985) \n\nInterNorth \n\nOne of Enron's primary predecessors was the Northern Natural Gas Company, which was formed in 1930, in Omaha, Nebraska just a few months after Black Tuesday. The low cost of natural gas and cheap labor supply during the Great Depression helped to fuel the company's early beginnings. The company doubled in size by 1932 and was able to bring the first natural gas to Minnesota. Over the next 50 years, Northern expanded even more as it acquired many energy companies and created new divisions within. It was reorganized in 1979 as the main subsidiary of a holding company, InterNorth, which was a diversified energy and energy-related products company. Although most of the acquisitions conducted were successful, some ended poorly. InterNorth competed with Cooper Industries over a hostile takeover of Crouse-Hinds Company, who manufactured electrical products. InterNorth was ultimately unsuccessful as Cooper bought out Crouse-Hinds. Cooper and InterNorth feuded over numerous suits over the course of the takeover that were eventually settled after the transaction was completed. The subsidiary Northern Natural Gas operated the largest natural gas pipeline company in North America.  By the 1980s, InterNorth became a major force for natural gas production, transmission and marketing as well as for natural gas liquids, and was an innovator in the plastics industry. In 1983, InterNorth merged with the Belco Petroleum Company, a Fortune 500 oil exploration and development company founded by Arthur Belfer.[http://www.fundinguniverse.com/company-histories/belco-oil-gas-corp-history/ Funding Universe: \"History of Belco Oil & Gas Corp.\"] retrieved September 21, 2017\n\nHouston Natural Gas \n\nThe Houston Natural Gas (HNG) corporation was initially formed from the Houston Oil Co. in 1925 to provide gas to customers in the Houston market through the building of gas pipelines. Under the leadership of CEO Robert Herring from 1967 to 1981, the company became a large dominant force in the energy sector with a large pipeline network as a result from prosperous period of growth in the early to mid 1970s. This growth was largely seen from the exploitation of unregulated Texas natural gas market and the commodity surge in the early 1970s. Towards the end of the 1970s HNG's luck began to run out with rising gas prices forcing clients to switch to oil. In addition, with the passing of the Natural Gas Policy Act of 1978, the Texas market was more difficult to profit from and as a result the profits of HNG fell. After Herring's death in 1981, M.D. Matthews briefly took over as CEO in a 3-year stint with initial success but ultimately saw a big dip in earnings that led to his exit. In 1984, Kenneth Lay succeeded Matthews and inherited the troubled, but large diversified energy conglomerate.\n\nMerger \n\nInterNorth in its conservative success became a target of corporate takeovers, the most prominent being corporate raider Irwin Jacobs. InterNorth CEO Sam Segnar, in searching for a company to merge with to fend off takeover attempts as a poison pill, discovered HNG. In May 1985, Internorth acquired HNG for $2.3 billion, 40% higher than the current market price, in order to avoid the corporate takeover attempt. The combined assets of the two companies would create the second largest gas pipeline system at the time in the United States. Internorth’s north-south pipelines that served Iowa and Minnesota complemented HNG’s Florida and California east-west pipelines well.\n\nPost-merger rise (1985–1991) \n\nThe company was initially named \"HNG/InterNorth Inc.\", even though InterNorth was technically the parent. At the outset, Segnar was CEO for a short time, before he was fired by the Board of Directors whereupon Lay was tapped to be the new CEO. Lay moved the headquarters of the new company back to energy capital Houston. The company then set out to find a new name, spent upwards of $100,000 in focus groups and consulting before \"Enteron\" was suggested. The name was eventually dismissed over its apparent likening to an intestine and shortened to \"Enron.\" Enron still had some lingering problems left over from its merger, however. The company had to pay Jacobs, who was still a threat, over $350 million and reorganize the company. Lay sold off any parts of the company that he didn't believe belong in the long-term future of Enron. Lay consolidated all the gas pipeline efforts under the Enron Gas Pipeline Operating Company. In addition, the company began to ramp up its electric power and natural gas efforts. In 1988 and 1989, the company began adding power plants and cogeneration units to its portfolio. In 1989, Jeffrey Skilling, then a consultant at McKinsey & Co., came up with the idea to link natural gas to consumers in more ways, effectively turning natural gas into a commodity. Enron adopted the idea and called it the \"Gas Bank.\" The division's success prompted Skilling to join Enron as the head of the Gas Bank in 1991. Another major development inside Enron was the beginning of the company's pivot to overseas that was expanded upon in the 1990s. Starting in 1989, the company received a $56 million loan from the Overseas Private Investment Corporation (OPIC) for a power plant in Argentina.\n\n1991–2000 \n\nOver the course of the 1990s, Enron made a few changes to its business plan that greatly improved the perceived profitability of the company. Firstly, Enron invested heavily in overseas assets, specifically energy. Another major shift was the gradual transition of focus from a producer of energy to a company that acted more like an investment firm and sometimes a hedge fund, making profits off the margins of the products it traded. These products were traded through the Gas Bank concept, now called the Enron Finance Corp. headed by Skilling.\n\nOperations as a trading firm \n\nWith the success of the Gas Bank trading natural gas, Skilling looked to expand the horizons of his division, Enron Capital & Trade. Skilling hired Andrew Fastow in 1990 to help with this.\n\nEntrance into the retail energy market \n\nStarting in 1994 under the Energy Policy Act of 1992, Congress allowed states to deregulate their electricity utilities, allowing them to be opened for competition. California was one such state to do so. Enron, seeing an opportunity with rising prices, was eager to jump into the market. In 1997, Enron acquired Portland General Electric (PGE); while an Oregon utility, it had potential to begin serving the massive California market since PGE was a regulated utility. The new Enron division, Enron Energy, ramped up its efforts by offering discounts to potential customers in California for switching their electric supplier to Enron from their previous supplier starting 1998. Enron Energy also began to sell natural gas to customers in Ohio and wind power in Iowa. However, in 1999, the company ended its retail endeavor, only offering wholesale energy as it was revealed it was spending upwards of $100 million a year.\n\nData management\n\nAs fiber optic technology progressed in the 1990s, multiple companies, including Enron, attempted to make money by \"keeping the continuing network costs low\", which was done by owning their personal network. In 1997, FTV Communications LLC, a limited liability company formed by Enron subsidiary FirstPoint Communications, Inc., Williams Communications Group, Inc. and Touch America. FTV constructed a 1,380 mile fiber optic network between Portland and Las Vegas. In 1998, Enron constructed a building in a rundown area of Las Vegas near E Sahara, building right over the \"backbone\" of fiber optic cables providing service to technology companies nationwide. The location had the ability to send \"the entire Library of Congress anywhere in the world within minutes\" and could stream \"video to the whole state of California\". The location was also more protected from natural disasters than areas such as Los Angeles or the East Coast. According to Wall Street Daily, \"Enron had a secret\" and that they \"wanted to trade bandwidth like it traded oil, gas, electricity, etc. It launched a secret plan to build an enormous amount of fiber optic transmission capacity in Las Vegas ...  it was all part of Enron’s plan to essentially own the internet\", essentially, Enron sought to have all US internet service providers rely on their Nevada facility to supply bandwidth, which Enron would sell in a fashion similar to other commodities.\n\nIn January 2000, Kenneth Lay and Jeffrey Skilling announced to analysts that they were going to open trading for their own \"high-speed fiber-optic networks that form the backbone for Internet traffic\". Investors quickly bought Enron stock following the announcement \"as they did with most things Internet-related at the time\", with stock prices rising from $40 per share in January 2000 to $70 per share in March, peaking at $90 in the summer of 2000. Enron executives obtained windfall gains from the rising stock prices, with a total of $924 million of stocks sold by high-lever Enron employees between 2000 and 2001. Head of Enron Broadband Services, Kenneth Rice, sold 1 million shares himself, earning about $70 million in returns. As prices of existing fiber optic cables plummeted due to the vast oversupply of the system, with only 5% of the 40 million miles being active wires, Enron purchased the inactive \"dark fibers\", expecting to buy them for cheap and then score a profit as the need for more usage by internet providers increased, with Enron expecting to lease its acquired dark fibers in 20 year contracts to providers. However, Enron's accounting would use estimates to determine how much their dark fibers would be worth when they were \"lit\" and apply those estimates to their current income, adding exaggerated revenue to their accounts since transactions were not yet made and it was not known if the cables would ever be active. Enron's trading with other energy companies within the broadband market was its attempt to lure large telecommunications companies, such as Verizon Communications, into its broadband scheme to create its own new market.\n\nBy the second quarter of 2001, Enron Broadband Services was reporting losses. On March 12, 2001, a proposed 20-year deal between Enron and Blockbuster Inc. to stream movies on demand over Enron's connections was cancelled, with Enron shares dropping from $80 per share in mid-February 2001 to below $60 the week after the deal was killed. The branch of the company that Jeffrey Skilling \"said would eventually add $40 billion to Enron's stock value\" added only about $408 million in revenue for Enron in 2001, with the company's broadband arm closed shortly after its meager second quarter earnings report in July 2001.\n\nFollowing the bankruptcy of Enron, telecommunications holdings were sold for \"pennies on the dollar\". In 2002, Rob Roy of Switch Communications purchased Enron's Nevada facility in an auction only attended by Roy since Enron's \"fiber plans were so secretive that few people even knew about the auction\", with the facility selling for only $930,000. Following the sale, Switch  expanded to control \"the biggest data centers in the world\".\n\nOverseas expansion \n\nEnron, seeing stability after the merger, began to look overseas for new possible energy opportunities in 1991. Enron's first such opportunity  was a natural gas power plant utilizing cogeneration that the company built in Teesside, UK. The power plant was so large it could produce up to 3% of the United Kingdom's electricity demand with a capacity of over 1,875 megawatts. Seeing the success in England, the company developed and diversified its assets worldwide under the name of Enron International (EI), headed by former HNG executive Rebecca Mark. By 1994, EI's portfolio included assets in Philippines, Australia, Guatemala, Germany, France, India, Argentina, the Caribbean, China, England, Colombia, Turkey, Bolivia, Brazil, Indonesia, Norway, Poland, and Japan. The division was becoming a large share of earnings for Enron, contributing 25% of earnings in 1996. Mark and EI believed the water industry was the next market to be deregulated by authorities and seeing the potential, searched for ways to enter the market, similar to PGE. \n\nIn 1998, Enron International acquired Wessex Water for $2.88 billion. Wessex Water became the core asset of a new company, Azurix, which expanded to other water companies. After Azurix's promising IPO in June 1999, Enron \"sucked out over $1 billion in cash while loading it up with debt\", according to Bethany McLean and Peter Elkind, authors of The Smartest Guys in the Room: The Amazing Rise and Scandalous Fall of Enron. Additionally, British water regulators required Wessex to cut its rates by 12% starting in April 2000, and an upgrade was required of the utility's aging infrastructure, estimated at costing over a billion dollars. By the end of 2000 Azurix had an operating profit of less than $100 million and was $2 billion in debt. In August 2000, after Azurix stock took a plunge following its earnings report, Mark resigned from Azurix and Enron.Eichenwald, Kurt. [https://books.google.com/books?idndr6gaslItoC&pg\nPA362 Conspiracy of Fools: A True Story]. Random House, 2005. pp. 362–364.Smith, Rebecca and Aaron Lucchetti. [http://expressindia.indianexpress.com/fe/daily/20000829/fco29065.html \"Rebecca Mark's Exit Leaves Enron's Azurix Treading Deep Water\"]. Originally in: The Wall Street Journal. August 28, 2000. Azurix assets, including Wessex, were  eventually sold by Enron.Grigg, Neil S. [https://books.google.com/books?idC_KenysXGuEC&pg\nPA76 Water Finance: Public Responsibilities and Private Opportunities]. John Wiley & Sons, 2011. p. 76.\n\nMisleading financial accounts\n\nIn 1990, Enron's Chief Operating Officer Jeffrey Skilling hired Andrew Fastow, who was well acquainted with the burgeoning deregulated energy market that Skilling wanted to exploit. In 1993, Fastow began establishing numerous limited liability special purpose entities (a common business practice in the energy sector); however, it also allowed Enron to transfer liability so that it would not appear in its accounts, allowing it to maintain a robust and generally increasing stock price and thus keeping its critical investment grade credit ratings.\n\nEnron was originally involved in transmitting and distributing electricity and natural gas throughout the United States. The company developed, built, and operated power plants and pipelines while dealing with rules of law and other infrastructures worldwide. Enron owned a large network of natural gas pipelines, which stretched ocean to ocean and border to border including Northern Natural Gas, Florida Gas Transmission, Transwestern Pipeline company and a partnership in Northern Border Pipeline from Canada. The states of California, New Hampshire and Rhode Island had already passed power deregulation laws by July 1996, the time of Enron's proposal to acquire Portland General Electric corporation. During 1998, Enron began operations in the water sector, creating the Azurix Corporation, which it part-floated on the New York Stock Exchange during June 1999. Azurix failed to become successful in the water utility market, and one of its major concessions, in Buenos Aires, was a large-scale money-loser. After the relocation to Houston, many analysts criticized the Enron management as being greatly in debt. Enron management pursued aggressive retribution against its critics, setting the pattern for dealing with accountants, lawyers, and the financial media.\n\nEnron grew wealthy due largely to marketing, promoting power, and its high stock price. Enron was named \"America's Most Innovative Company\" by the magazine Fortune for six consecutive years, from 1996 to 2001.Sharp, p.13. It was on the Fortunes \"100 Best Companies to Work for in America\" list during 2000, and had offices that were stunning in their opulence. Enron was hailed by many, including labor and the workforce, as an overall great company, praised for its large long-term pensions, benefits for its workers and extremely effective management until the exposure of its corporate fraud. The first analyst to question the company's success story was Daniel Scotto, an energy market expert at BNP Paribas, who issued a note in August 2001 entitled Enron: All stressed up and no place to go, which encouraged investors to sell Enron stocks, although he only changed his recommendation on the stock from \"buy\" to \"neutral\".\n\nAs was later discovered, many of Enron's recorded assets and profits were inflated or even wholly fraudulent and nonexistent. One example of fraudulent records was during 1999 when Enron promised to repay Merrill Lynch & Co.'s investment with interest in order to show profit on its books. Debts and losses were put into entities formed \"offshore\" that were not included in the company's financial statements, and other sophisticated and arcane financial transactions between Enron and related companies were used to eliminate unprofitable entities from the company's books.\n\nThe company's most valuable asset and the largest source of honest income, the 1930s-era Northern Natural Gas company, was eventually purchased by a group of Omaha investors, who relocated its headquarters back to Omaha; it is now a unit of Warren Buffett's Berkshire Hathaway Energy. NNG was established as collateral for a $2.5 billion capital infusion by Dynegy Corporation when Dynegy was planning to buy Enron. When Dynegy examined Enron's financial records carefully, they repudiated the deal and dismissed their CEO, Chuck Watson. The new chairman and CEO, the late Daniel Dienstbier, had been president of NNG and an Enron executive at one time and was forced out of Enron by Ken Lay.  Dienstbier was an acquaintance of Warren Buffett. NNG continues to be profitable now.\n\n2001 Accounting scandals \n\nDuring 2001, after a series of revelations involving irregular accounting procedures bordering on fraud perpetrated throughout the 1990s involving Enron and its accounting company Arthur Andersen, Enron suffered the largest Chapter 11 bankruptcy in history (since surpassed by those of Worldcom during 2002 and Lehman Brothers during 2008).\n\nAs the scandal progressed, Enron share prices decreased from US $90.56 during the summer of 2000, to just pennies.http://www.gilardi.com/pdf/enro13ptable.pdf  Enron had been considered a blue chip stock investment, so this was an unprecedented event in the financial world. Enron's demise occurred after the revelation that much of its profits and revenue were the result of deals with special purpose entities (limited partnerships which it controlled). This meant that many of Enron's debts and the losses that it suffered were not reported in its financial statements.\n\nA rescue attempt by a similar, smaller energy company, Dynegy, failed during late November due to concerns about an unexpected restatement of earnings. Enron filed for bankruptcy on December 2, 2001. In addition, the scandal caused the dissolution of Arthur Andersen, which at the time was one of the \"Big Five\" - the world's foremost accounting firms. The company was found guilty of obstruction of justice during 2002 for destroying documents related to the Enron audit. Since the SEC is not allowed to accept audits from convicted felons, Andersen was forced to stop auditing public companies. Although the conviction was dismissed during 2005 by the Supreme Court, the damage to the Andersen name has prevented it from reviving as a viable business even on a limited scale.\n\nEnron also withdrew a naming-rights deal with the Houston Astros Major League Baseball club to have its name associated with their new stadium, which was known formerly as Enron Field (now Minute Maid Park).\n\nAccounting practices\n\nEnron used a variety of deceptive, bewildering, and fraudulent accounting practices and tactics to cover its fraud in reporting Enron's financial information. Special Purpose Entities were created to mask significant liabilities from Enron's financial statements. These entities made Enron seem more profitable than it actually was, and created a dangerous spiral in which, each quarter, corporate officers would have to perform more and more financial deception to create the illusion of billions of dollars in profit while the company was actually losing money. This practice increased their stock price to new levels, at which point the executives began to work on insider information and trade millions of dollars' worth of Enron stock. The executives and insiders at Enron knew about the offshore accounts that were hiding losses for the company; however, the investors knew nothing of this. Chief Financial Officer Andrew Fastow directed the team which created the off-books companies, and manipulated the deals to provide himself, his family, and his friends with hundreds of millions of dollars in guaranteed revenue, at the expense of the corporation for which he worked and its stockholders.\n\nDuring 1999, Enron initiated EnronOnline, an Internet-based trading operation, which was used by virtually every energy company in the United States. Enron president and chief operating officer Jeffrey Skilling began advocating a novel idea: the company didn't really need any \"assets\". By promoting the company's aggressive investment strategy, he helped make Enron the biggest wholesaler of gas and electricity, trading over $27 billion per quarter. The corporation's financial claims, however, had to be accepted at face value. Under Skilling, Enron adopted mark to market accounting, in which anticipated future profits from any deal were tabulated as if currently real. Thus, Enron could record gains from what over time might turn out to be losses, as the company's fiscal health became secondary to manipulating its stock price on Wall Street during the so-called Tech boom. But when a company's success is measured by undocumented financial statements, actual balance sheets are inconvenient. Indeed, Enron's unscrupulous actions were often gambles to keep the deception going and so increase the stock price. An advancing price meant a continued infusion of investor capital on which debt-ridden Enron in large part subsisted (much like a financial \"pyramid\" or \"Ponzi scheme\"). Attempting to maintain the illusion, Skilling verbally attacked Wall Street Analyst Richard Grubman, who questioned Enron's unusual accounting practice during a recorded conference telephone call. When Grubman complained that Enron was the only company that could not release a balance sheet along with its earnings statements, Skilling replied, \"Well, thank you very much, we appreciate that ... asshole.\" Though the comment was met with dismay and astonishment by press and public, it became an inside joke among many Enron employees, mocking Grubman for his perceived meddling rather than Skilling's offensiveness. When asked during his trial, Skilling declared that industrial dominance and abuse was a global problem: \"Oh yes, yes sure, it is.\"\n\nPost-bankruptcy\n\nEnron initially planned to retain its three domestic pipeline companies as well as most of its overseas assets. However, before emerging from bankruptcy, Enron sold its domestic pipeline companies as CrossCountry Energy for $2.45 billion  and later sold other assets to Vulcan Capital Management.\n\nEnron sold its last business, Prisma Energy, during 2006, leaving Enron asset-less. During early 2007, its name was changed to Enron Creditors Recovery Corporation. Its goal is to repay the old Enron's remaining creditors and end Enron's affairs.\n\nAzurix, the former water utility part of the company, remains under Enron ownership, although it is currently asset-less. It is involved in several litigations against the government of Argentina claiming compensation relating to the negligence and corruption of the local governance during its management of the Buenos Aires water concession during 1999, which resulted in substantial amounts of debt (approx. $620 million) and the eventual collapse of the branch.\n\nSoon after emerging from bankruptcy during November 2004, Enron's new board of directors sued 11 financial institutions for helping Lay, Fastow, Skilling and others hide Enron's true financial condition. The proceedings were dubbed the \"megaclaims litigation\". Among the defendants were Royal Bank of Scotland, Deutsche Bank and Citigroup. , Enron has settled with all of the institutions, ending with Citigroup. Enron was able to obtain nearly $7.2 billion to distribute to its creditors as a result of the megaclaims litigation. As of December 2009, some claim and process payments were still being distributed.\n\nInsider trading scandal\n\nPeak and decline of stock price\n\nDuring August 2000, Enron's stock price attained its greatest value of $90.56. At this time Enron executives, who possessed inside information on the hidden losses, began to sell their stock. At the same time, the general public and Enron's investors were told to buy the stock. Executives told the investors that the stock would continue to increase until it attained possibly the $130 to $140 range, while secretly unloading their shares.\n\nAs executives sold their shares, the price began to decrease. Investors were told to continue buying stock or hold steady if they already owned Enron because the stock price would rebound during the near future. Kenneth Lay's strategy for responding to Enron's continuing problems was his demeanor. As he did many times, Lay would issue a statement or make an appearance to calm investors and assure them that Enron was doing well. In February 2001 an article by Bethany McLean appeared in Fortune magazine questioning whether Enron stock was overvalued.\n\nBy August 15, 2001, Enron's stock price had decreased to $42. Many of the investors still trusted Lay and believed that Enron would rule the market. They continued to buy or retain their stock as the equity value decreased. As October ended, the stock had decreased to $15. Many considered this a great opportunity to buy Enron stock because of what Lay had been telling them in the media.\n\nLay was accused of selling more than $70 million worth of stock at this time, which he used to repay cash advances on lines of credit. He sold another $29 million worth of stock in the open market. Also, Lay's wife, Linda, was accused of selling 500,000 shares of Enron stock totaling $1.2 million on November 28, 2001. The money earned from this sale did not go to the family but rather to charitable organizations, which had already received pledges of contributions from the foundation. Records show that Mrs. Lay made the sale order sometime between 10:00 and 10:20 am. News of Enron's problems, including the millions of dollars in losses they hid, became public about 10:30 that morning, and the stock price soon decreased to less than one dollar.\n\nFormer Enron executive Paula Rieker was charged with criminal insider trading and sentenced to two years probation. Rieker obtained 18,380 Enron shares for $15.51 a share. She sold that stock for $49.77 a share during July 2001, a week before the public was told what she already knew about the $102 million loss. In 2002, after the tumultuous fall of Enron's external auditor, and management consultant, Andersen LLP, former Andersen Director, John M. Cunningham coined the phrase, \"We have all been Enroned.\"\n\nThe fallout resulted in both Lay and Skilling being convicted for conspiracy, fraud, and insider trading. Lay died before sentencing, Skilling got 24 years and 4 months and a $45 million penalty (later reduced). Fastow was sentenced to six years of jail time, and Lou Pai settled out of court for $31.5 million.\n\nCalifornia's deregulation and subsequent energy crisis\n\nDuring October 2000, Daniel Scotto, the most renowned utility analyst on Wall Street, suspended his ratings on all energy companies conducting business in California because of the possibility that the companies would not receive full and adequate compensation for the deferred energy accounts used as the basis for the California Deregulation Plan enacted during the late 1990s. Five months later, Pacific Gas & Electric (PG&E) was forced into bankruptcy. Senator Phil Gramm, husband of Enron Board member Wendy Gramm and also the second largest recipient of campaign contributions from Enron, succeeded in legislating California's energy commodity trading deregulation. Despite warnings from prominent consumer groups which stated that this law would give energy traders too much influence over energy commodity prices, the legislation was passed during December 2000.\n\nAs the periodical Public Citizen reported, \"Because of Enron's new, unregulated power auction, the company's 'Wholesale Services' revenues quadrupled—- from $12 billion in the first quarter of 2000 to $48.4 billion in the first quarter of 2001.\"\n\nAfter passage of the deregulation law, California had a total of 38 Stage 3 rolling blackouts declared, until federal regulators intervened during June 2001. These blackouts occurred as a result of a poorly designed market system that was manipulated by traders and marketers, as well as poor state management and regulatory oversight. Subsequently, Enron traders were revealed as intentionally encouraging the removal of power from the market during California's energy crisis by encouraging suppliers to shut down plants to perform unnecessary maintenance, as documented in recordings made at the time. These acts contributed to the need for rolling blackouts, which adversely affected many businesses dependent upon a reliable supply of electricity, and inconvenienced a large number of retail customers. This scattered supply increased the price, and Enron traders were thus able to sell power at premium prices, sometimes up to a factor of 20x its normal peak value.\n\nFormer management and corporate governance\n\nProducts\n\nEnron traded in more than 30 different products, including the following:\n\n* Products traded on EnronOnline\n** Petrochemicals\n** Plastics\n** Power\n** Pulp and paper\n** Steel\n** Weather Risk Management\n* Oil and LNG transportation\n* Broadband\n* Principal investments\n* Risk management for commodities\n* Shipping / freight\n* Streaming media\n* Water and wastewater\n\nIt was also an extensive futures trader, including sugar, coffee, grains, hogs, and other meat futures. At the time of its bankruptcy filing during December 2001, Enron was structured into seven distinct business units.\n\nOnline marketplace services\n\n*EnronOnline (commodity trading platform).\n*ClickPaper (transaction platform for pulp, paper, and wood products).\n*EnronCredit (the first global online credit department to provide live credit prices and enable business-to-business customers to hedge credit exposure instantly via the Internet).\n*ePowerOnline (customer interface for Enron Broadband Services).\n*Enron Direct (sales of fixed-price contracts for gas and electricity; Europe only).\n*EnergyDesk (energy-related derivatives trading; Europe only).\n*NewPowerCompany (online energy trading, joint venture with IBM and AOL).\n*Enron Weather (weather derivatives).\n*DealBench (online business services).\n*Water2Water (water storage, supply, and quality credits trading).\n*HotTap (customer interface for Enron's U.S. gas pipeline businesses).\n*Enromarkt (business to business pricing and information platform; Germany only).\n\nBroadband services\n\n*Enron Intelligent Network (broadband content delivery).\n*Enron Media Services (risk management services for media content companies).\n*Customizable Bandwidth Solutions (bandwidth and fiber products trading).\n*Streaming Media Applications (live or on-demand Internet broadcasting applications).\n\nEnergy and commodities services\n\n*Enron Power (electricity wholesaling).\n*Enron Natural Gas (natural gas wholesaling).\n*Enron Clean Fuels (biofuel wholesaling).\n*Enron Pulp and Paper, Packaging, and Lumber (risk management derivatives for forest products industry).\n*Enron Coal and Emissions (coal wholesaling and CO2 offsets trading).\n*Enron Plastics and Petrochemicals (price risk management for polymers, olefins, methanol, aromatics, and natural gas liquids).\n*Enron Weather Risk Management (Weather Derivatives).\n*Enron Steel (financial swap contracts and spot pricing for the steel industry).\n*Enron Crude Oil and Oil Products (petroleum hedging).\n*Enron Wind Power Services (wind turbine manufacturing and wind farm operation).\n*MG Plc. (U.K. metals merchant).\n*Enron Energy Services (Selling services to industrial end users).\n*Enron International (operation of all overseas assets).\n\nCapital and risk management services\n\nCommercial and industrial outsourcing services\n\n*Commodity Management.\n*Energy Asset Management.\n*Energy Information Management.\n*Facility Management.\n*Capital Management.\n*Azurix Inc. (water utilities and infrastructure).\n\nProject development and management services\n\n*Energy Infrastructure Development (developing, financing, and operation of power plants and related projects).\n*Enron Global Exploration & Production Inc. (upstream oil and natural gas international development).\n*Elektro Electricidade e Servicos SA (Brazilian electric utility).\n*Northern Border Pipeline.\n*Houston Pipeline.\n*Transwestern Pipeline.\n*Florida Gas Transmission.\n*Northern Natural Gas Company.\n*Natural Gas Storage.\n*Compression Services.\n*Gas Processing and Treatment.\n*Engineering, Procurement, and Construction Services.\n*EOTT Energy Inc. (oil transportation).\n\nEnron manufactured gas valves, circuit breakers, thermostats, and electrical equipment in Venezuela by means of INSELA SA, a 50–50 joint venture with General Electric. Enron owned three paper and pulp products companies: Garden State Paper, a newsprint mill; as well as Papiers Stadacona and St. Aurelie Timberlands. Enron had a controlling stake in the Louisiana-based petroleum exploration and production company Mariner Energy.\n\nEnronOnline \n\nEnron opened EnronOnline, an electronic trading platform for energy commodities, on November 29, 1999. Conceptualized by the company's European Gas Trading team, it was the first web-based transaction system that allowed buyers and sellers to buy, sell, and trade commodity products globally. It allowed users to do business only with Enron. The site allowed Enron to transact with participants in the global energy markets. The main commodities offered on EnronOnline were natural gas and electricity, although there were 500 other products including credit derivatives, bankruptcy swaps, pulp, gas, plastics, paper, steel, metals, freight, and TV commercial time. At its maximum, more than $6 billion worth of commodities were transacted by means of EnronOnline every day.\n\nAfter Enron's bankruptcy in late 2001, EnronOnline was sold to the Swiss financial giant UBS. Within a year, UBS abandoned its efforts to relaunch the division, and closed it in November 2002.\n\nEnron International \n\nEnron International (EI) was Enron's wholesale asset development and asset management business. Its primary emphasis was developing and building natural gas power plants outside North America. Enron Engineering and Construction Company (EECC) was a wholly owned subsidiary of Enron International, and built almost all of Enron International's power plants. Unlike other business units of Enron, Enron International had a strong cash flow on bankruptcy filing. Enron International consisted of all of Enron's foreign power projects, including ones in Europe.\n\nThe company's Teesside plant was one of the largest gas-fired power stations in the world, built and operated by Enron from 1989, and produced 3 percent of the United Kingdom's energy needs.[http://www.dailymail.co.uk/news/article-65514/Third-worker-dies-power-plant-blast.html Third worker dies after power plant blast | Mail Online]. Dailymail.co.uk. Retrieved on 2013-07-12.\"Principal Player in the Electricity Game.\" Financial Times [London, England] 17 Sept. 1990: 19. Financial Times. Web. 4 July 2012. Enron owned half of the plant's equity, with the remaining 50 per cent split between four regional electricity companies.\n\nManagement \n\nRebecca Mark was the CEO of Enron International until she resigned to manage Enron's newly acquired water business, Azurix, during 1997. Mark had a major role in the development of the Dabhol project in India, Enron's largest international endeavor.\n\nProjects \n\nEnron International constructed power plants and pipelines across the globe. Some are presently still operating, including the massive Teesside plant in England. Others, like a barge-mounted plant off Puerto Plata in the Dominican Republic, cost Enron money by lawsuits and investment losses. Puerto Plata was a barge-mounted power plant next to the hotel Hotelero del Atlantico. When the plant was activated, winds blew soot from the plant onto the hotel guests' meals, blackening their food. The winds also blew garbage from nearby slums into the plant's water-intake system. For some time the only solution was to hire men who would row out and push the garbage away with their paddles. Through mid-2000 the company collected a paltry $3.5 million from a $95 million investment. Enron also had other investment projects in Europe, South America, Argentina, Brazil, Bolivia, Colombia, Mexico, Jamaica, Venezuela, and across the Caribbean.\n\nIndia \n\nAround 1992 Indian experts came to the United States to find energy investors to help with India's energy shortage problems. During December 1993, Enron finalized a 20-year power-purchase contract with the Maharashtra State Electricity Board. The contract allowed Enron to construct a massive 2,015 megawatt power plant on a remote volcanic bluff 100 mi south of Mumbai. Construction would be completed in two phases, and Enron would form the Dabhol Power Company to help manage the plant. The power project was the first step in a $20 billion scheme to help rebuild and stabilize India's power grid. Enron, GE (which was selling turbines to the project), and Bechtel (which was actually constructing the plant), each contributed 10% equity.\n\nDuring 1996, when India's Congress Party was no longer in power, the Indian government assessed the project as being excessively expensive and refused to pay for the plant and stopped construction. The Maharashtra State Electricity Board (MSEB), the local state-owned utility, was required by contract to continue to pay Enron plant maintenance charges, even if no power was purchased from the plant. The MSEB determined that it could not afford to purchase the power (at Rs. 8 per unit kWh) charged by Enron. The plant operator was unable to find alternate customers for Dabhol power due to the absence of a free market in the regulated structure of utilities in India. From 1996 until Enron's bankruptcy during 2001 the company tried to revive the project and revive interest in India's need for the power plant without success.\n\nProject summer \n\nDuring the summer of 2001, Enron made an attempt to sell a number of Enron International's assets, many of which were not sold. The public and media believed it was unknown why Enron wanted to sell these assets, suspecting it was because Enron was in need of cash. Employees who worked with company assets were told in 2000 Enron Communication, 4th Quarter, 2000 that Jeff Skilling believed that business assets were an outdated means of company worth, and instead he wanted to build a company based on \"intellectual assets\".\n\nEnron Global Exploration & Production, Inc. \n\nEnron Global Exploration & Production Inc. (EGEP) was an Enron subsidiary that was born from the split of domestic assets via EOG Resources (formerly Enron Oil and Gas EOG) and international assets via EGEP (formerly Enron Oil and Gas Int'l, Ltd EOGIL).  \nAmong the EGEP assets were the Panna-Mukta and the South Tapti fields, discovered by the Indian state-owned Oil and Natural Gas Corporation (ONGC), which operated the fields initially.\nDecember 1994, a joint venture began between ONGC (40%), Enron (30%) and Reliance (30%).\nMid year of 2002, British Gas (BG) completed the acquisition of EGEP's 30% share of the Panna-Mukta and Tapti fields for $350 million, a few months before Enron filed bankruptcy.\n\nEnron Prize for Distinguished Public Service\n\nDuring the mid-1990s, Enron established an endowment for the Enron Prize for Distinguished Public Service, awarded by Rice University's Baker Institute to \"recognize outstanding individuals for their contributions to public service\".  Recipients were:\n\n* 1995: Colin Powell.\n* 1997: Mikhail Gorbachev.\n* 1999 (early): Eduard Shevardnadze.\n* 1999 (late): Nelson Mandela.\n* 2001: Alan Greenspan.Almond, B.J. [http://stage.media.rice.edu/media/NewsBot.asp?MODE\nVIEW&ID2837&SnID\n2 Greenspan, Putin to speak on campus] Rice University News & Media Relations, Nov 8, 2001. Retrieved: Aug 26, 2011.\n\nGreenspan, because of his position as the Fed chairman, was not at liberty to accept the $10,000 honorarium, the $15,000 sculpture, nor the crystal trophy, but only accepted the \"honor\" of being named an Enron Prize recipient.[http://www.enron-mail.com/email/lay-k/inbox/Enron_Prize.html Enron Prize]. Enron-mail.com. Retrieved on 2013-07-12. The situation was further complicated because a few days earlier, Enron had filed paperwork admitting it had falsified financial statements for five years. Greenspan did not mention Enron a single time during his speech.Bryce, Robert [https://books.google.com/books?id\nQu7jYzUVnScC&pgPA327&lpg\nPA327#vonepage&q&f\nfalse Pipe Dreams: Greed, Ego, and the Death of Enron] Rice University News & Media Relations, Nov 8, 2001. Retrieved: Aug 26, 2011. At the ceremony, Ken Lay stated, \"I'm looking forward to our first woman recipient.\"[http://www.enron-mail.com/email/martin-t/deleted_items/Enron_Mentions_97.html Enron Mentions]. Enron-mail.com. Retrieved on 2013-07-12. The next morning, it was reported in the Houston Chronicle that no decision had been made on whether the name of the prize would be changed.[http://www.enron-mail.com/email/kitchen-l/_americas/sec_media/Enron_Mentions_30.html Enron Mentions]. Enron-mail.com. Retrieved on 2013-07-12. 19 days after the prize was awarded to Greenspan, Enron declared bankruptcy.\n\nDuring early 2002, Enron was awarded Harvard's (in)famous Ig Nobel Prize for 'Most Creative Use of Imaginary Numbers.' The various former members of Enron management all refused to accept the award in person, although no reason was given at the time.\n\nEnron's Influence on Politics \n\n* George W. Bush, sitting president at the time, received $312,500 to his campaigns and $413,800 to his presidential war chest and inaugural fund.\n* Dick Cheney, sitting vice president at the time, met with Enron executives six times to develop a new energy policy. He refused to show minutes to Congress.\n* John Ashcroft, attorney general at the time, recused himself from the DOJ's investigation into Enron due to receiving $57,499 when running for senate seat in 2000.\n* Lawrence Lindsay, White House Economic Advisor at the time, made $50,000 as a consultant with Enron before moving to the White House in 2000.\n* Karl Rove, White House Senior Advisor at the time, waited five months before selling $100,000 of Enron stock.\n* Marc F. Racicot, Republican National Committee Chairman Nominee at the time, was handpicked by George W. Bush and continued to serve as a lawyer with a firm that lobbies for Enron.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Enron" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10166" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Enron Corporation was an American energy, commodities, and services company based in Houston, Texas. It was founded in 1985 as a merger between Houston Natural Gas and InterNorth, both relatively small regional companies. Before its bankruptcy on December 2, 2001, Enron employed approximately 20,000 staff and was one of the world's major electricity, natural gas, communications and pulp and paper companies, with claimed revenues of nearly $101 billion during 2000. Fortune named Enron \"America's Most Innovative Company\" for six consecutive years.\n\nAt the end of 2001, it was revealed that its reported financial condition was sustained by institutionalized, systematic, and creatively planned accounting fraud, known since as the Enron scandal. Enron has since become a well-known example of willful corporate fraud and corruption. The scandal also brought into question the accounting practices and activities of many corporations in the United States and was a factor in the enactment of the Sarbanes–Oxley Act of 2002. The scandal also affected the greater business world by causing the dissolution of the Arthur Andersen accounting firm.\n\nEnron filed for bankruptcy in the Southern District of New York in late 2001 and selected Weil, Gotshal & Manges as its bankruptcy counsel. It ended its bankruptcy during November 2004, pursuant to a court-approved plan of reorganization. A new board of directors changed the name of Enron to Enron Creditors Recovery Corp., and emphasized reorganizing and liquidating certain operations and assets of the pre-bankruptcy Enron. On September 7, 2006, Enron sold Prisma Energy International Inc., its last remaining business, to Ashmore Energy International Ltd. (now AEI). \n\nHistory\n\nPre-merger origins (1925–1985) \n\nInterNorth \n\nOne of Enron's primary predecessors was the Northern Natural Gas Company, which was formed in 1930, in Omaha, Nebraska just a few months after Black Tuesday. The low cost of natural gas and cheap labor supply during the Great Depression helped to fuel the company's early beginnings. The company doubled in size by 1932 and was able to bring the first natural gas to Minnesota. Over the next 50 years, Northern expanded even more as it acquired many energy companies and created new divisions within. It was reorganized in 1979 as the main subsidiary of a holding company, InterNorth, which was a diversified energy and energy-related products company. Although most of the acquisitions conducted were successful, some ended poorly. InterNorth competed with Cooper Industries over a hostile takeover of Crouse-Hinds Company, who manufactured electrical products. InterNorth was ultimately unsuccessful as Cooper bought out Crouse-Hinds. Cooper and InterNorth feuded over numerous suits over the course of the takeover that were eventually settled after the transaction was completed. The subsidiary Northern Natural Gas operated the largest natural gas pipeline company in North America.  By the 1980s, InterNorth became a major force for natural gas production, transmission and marketing as well as for natural gas liquids, and was an innovator in the plastics industry. In 1983, InterNorth merged with the Belco Petroleum Company, a Fortune 500 oil exploration and development company founded by Arthur Belfer.[http://www.fundinguniverse.com/company-histories/belco-oil-gas-corp-history/ Funding Universe: \"History of Belco Oil & Gas Corp.\"] retrieved September 21, 2017\n\nHouston Natural Gas \n\nThe Houston Natural Gas (HNG) corporation was initially formed from the Houston Oil Co. in 1925 to provide gas to customers in the Houston market through the building of gas pipelines. Under the leadership of CEO Robert Herring from 1967 to 1981, the company became a large dominant force in the energy sector with a large pipeline network as a result from prosperous period of growth in the early to mid 1970s. This growth was largely seen from the exploitation of unregulated Texas natural gas market and the commodity surge in the early 1970s. Towards the end of the 1970s HNG's luck began to run out with rising gas prices forcing clients to switch to oil. In addition, with the passing of the Natural Gas Policy Act of 1978, the Texas market was more difficult to profit from and as a result the profits of HNG fell. After Herring's death in 1981, M.D. Matthews briefly took over as CEO in a 3-year stint with initial success but ultimately saw a big dip in earnings that led to his exit. In 1984, Kenneth Lay succeeded Matthews and inherited the troubled, but large diversified energy conglomerate.\n\nMerger \n\nInterNorth in its conservative success became a target of corporate takeovers, the most prominent being corporate raider Irwin Jacobs. InterNorth CEO Sam Segnar, in searching for a company to merge with to fend off takeover attempts as a poison pill, discovered HNG. In May 1985, Internorth acquired HNG for $2.3 billion, 40% higher than the current market price, in order to avoid the corporate takeover attempt. The combined assets of the two companies would create the second largest gas pipeline system at the time in the United States. Internorth’s north-south pipelines that served Iowa and Minnesota complemented HNG’s Florida and California east-west pipelines well.\n\nPost-merger rise (1985–1991) \n\nThe company was initially named \"HNG/InterNorth Inc.\", even though InterNorth was technically the parent. At the outset, Segnar was CEO for a short time, before he was fired by the Board of Directors whereupon Lay was tapped to be the new CEO. Lay moved the headquarters of the new company back to energy capital Houston. The company then set out to find a new name, spent upwards of $100,000 in focus groups and consulting before \"Enteron\" was suggested. The name was eventually dismissed over its apparent likening to an intestine and shortened to \"Enron.\" Enron still had some lingering problems left over from its merger, however. The company had to pay Jacobs, who was still a threat, over $350 million and reorganize the company. Lay sold off any parts of the company that he didn't believe belong in the long-term future of Enron. Lay consolidated all the gas pipeline efforts under the Enron Gas Pipeline Operating Company. In addition, the company began to ramp up its electric power and natural gas efforts. In 1988 and 1989, the company began adding power plants and cogeneration units to its portfolio. In 1989, Jeffrey Skilling, then a consultant at McKinsey & Co., came up with the idea to link natural gas to consumers in more ways, effectively turning natural gas into a commodity. Enron adopted the idea and called it the \"Gas Bank.\" The division's success prompted Skilling to join Enron as the head of the Gas Bank in 1991. Another major development inside Enron was the beginning of the company's pivot to overseas that was expanded upon in the 1990s. Starting in 1989, the company received a $56 million loan from the Overseas Private Investment Corporation (OPIC) for a power plant in Argentina.\n\n1991–2000 \n\nOver the course of the 1990s, Enron made a few changes to its business plan that greatly improved the perceived profitability of the company. Firstly, Enron invested heavily in overseas assets, specifically energy. Another major shift was the gradual transition of focus from a producer of energy to a company that acted more like an investment firm and sometimes a hedge fund, making profits off the margins of the products it traded. These products were traded through the Gas Bank concept, now called the Enron Finance Corp. headed by Skilling.\n\nOperations as a trading firm \n\nWith the success of the Gas Bank trading natural gas, Skilling looked to expand the horizons of his division, Enron Capital & Trade. Skilling hired Andrew Fastow in 1990 to help with this.\n\nEntrance into the retail energy market \n\nStarting in 1994 under the Energy Policy Act of 1992, Congress allowed states to deregulate their electricity utilities, allowing them to be opened for competition. California was one such state to do so. Enron, seeing an opportunity with rising prices, was eager to jump into the market. In 1997, Enron acquired Portland General Electric (PGE); while an Oregon utility, it had potential to begin serving the massive California market since PGE was a regulated utility. The new Enron division, Enron Energy, ramped up its efforts by offering discounts to potential customers in California for switching their electric supplier to Enron from their previous supplier starting 1998. Enron Energy also began to sell natural gas to customers in Ohio and wind power in Iowa. However, in 1999, the company ended its retail endeavor, only offering wholesale energy as it was revealed it was spending upwards of $100 million a year.\n\nData management\n\nAs fiber optic technology progressed in the 1990s, multiple companies, including Enron, attempted to make money by \"keeping the continuing network costs low\", which was done by owning their personal network. In 1997, FTV Communications LLC, a limited liability company formed by Enron subsidiary FirstPoint Communications, Inc., Williams Communications Group, Inc. and Touch America. FTV constructed a 1,380 mile fiber optic network between Portland and Las Vegas. In 1998, Enron constructed a building in a rundown area of Las Vegas near E Sahara, building right over the \"backbone\" of fiber optic cables providing service to technology companies nationwide. The location had the ability to send \"the entire Library of Congress anywhere in the world within minutes\" and could stream \"video to the whole state of California\". The location was also more protected from natural disasters than areas such as Los Angeles or the East Coast. According to Wall Street Daily, \"Enron had a secret\" and that they \"wanted to trade bandwidth like it traded oil, gas, electricity, etc. It launched a secret plan to build an enormous amount of fiber optic transmission capacity in Las Vegas ...  it was all part of Enron’s plan to essentially own the internet\", essentially, Enron sought to have all US internet service providers rely on their Nevada facility to supply bandwidth, which Enron would sell in a fashion similar to other commodities.\n\nIn January 2000, Kenneth Lay and Jeffrey Skilling announced to analysts that they were going to open trading for their own \"high-speed fiber-optic networks that form the backbone for Internet traffic\". Investors quickly bought Enron stock following the announcement \"as they did with most things Internet-related at the time\", with stock prices rising from $40 per share in January 2000 to $70 per share in March, peaking at $90 in the summer of 2000. Enron executives obtained windfall gains from the rising stock prices, with a total of $924 million of stocks sold by high-lever Enron employees between 2000 and 2001. Head of Enron Broadband Services, Kenneth Rice, sold 1 million shares himself, earning about $70 million in returns. As prices of existing fiber optic cables plummeted due to the vast oversupply of the system, with only 5% of the 40 million miles being active wires, Enron purchased the inactive \"dark fibers\", expecting to buy them for cheap and then score a profit as the need for more usage by internet providers increased, with Enron expecting to lease its acquired dark fibers in 20 year contracts to providers. However, Enron's accounting would use estimates to determine how much their dark fibers would be worth when they were \"lit\" and apply those estimates to their current income, adding exaggerated revenue to their accounts since transactions were not yet made and it was not known if the cables would ever be active. Enron's trading with other energy companies within the broadband market was its attempt to lure large telecommunications companies, such as Verizon Communications, into its broadband scheme to create its own new market.\n\nBy the second quarter of 2001, Enron Broadband Services was reporting losses. On March 12, 2001, a proposed 20-year deal between Enron and Blockbuster Inc. to stream movies on demand over Enron's connections was cancelled, with Enron shares dropping from $80 per share in mid-February 2001 to below $60 the week after the deal was killed. The branch of the company that Jeffrey Skilling \"said would eventually add $40 billion to Enron's stock value\" added only about $408 million in revenue for Enron in 2001, with the company's broadband arm closed shortly after its meager second quarter earnings report in July 2001.\n\nFollowing the bankruptcy of Enron, telecommunications holdings were sold for \"pennies on the dollar\". In 2002, Rob Roy of Switch Communications purchased Enron's Nevada facility in an auction only attended by Roy since Enron's \"fiber plans were so secretive that few people even knew about the auction\", with the facility selling for only $930,000. Following the sale, Switch  expanded to control \"the biggest data centers in the world\".\n\nOverseas expansion \n\nEnron, seeing stability after the merger, began to look overseas for new possible energy opportunities in 1991. Enron's first such opportunity  was a natural gas power plant utilizing cogeneration that the company built in Teesside, UK. The power plant was so large it could produce up to 3% of the United Kingdom's electricity demand with a capacity of over 1,875 megawatts. Seeing the success in England, the company developed and diversified its assets worldwide under the name of Enron International (EI), headed by former HNG executive Rebecca Mark. By 1994, EI's portfolio included assets in Philippines, Australia, Guatemala, Germany, France, India, Argentina, the Caribbean, China, England, Colombia, Turkey, Bolivia, Brazil, Indonesia, Norway, Poland, and Japan. The division was becoming a large share of earnings for Enron, contributing 25% of earnings in 1996. Mark and EI believed the water industry was the next market to be deregulated by authorities and seeing the potential, searched for ways to enter the market, similar to PGE. \n\nIn 1998, Enron International acquired Wessex Water for $2.88 billion. Wessex Water became the core asset of a new company, Azurix, which expanded to other water companies. After Azurix's promising IPO in June 1999, Enron \"sucked out over $1 billion in cash while loading it up with debt\", according to Bethany McLean and Peter Elkind, authors of The Smartest Guys in the Room: The Amazing Rise and Scandalous Fall of Enron. Additionally, British water regulators required Wessex to cut its rates by 12% starting in April 2000, and an upgrade was required of the utility's aging infrastructure, estimated at costing over a billion dollars. By the end of 2000 Azurix had an operating profit of less than $100 million and was $2 billion in debt. In August 2000, after Azurix stock took a plunge following its earnings report, Mark resigned from Azurix and Enron.Eichenwald, Kurt. [https://books.google.com/books?idndr6gaslItoC&pg\nPA362 Conspiracy of Fools: A True Story]. Random House, 2005. pp. 362–364.Smith, Rebecca and Aaron Lucchetti. [http://expressindia.indianexpress.com/fe/daily/20000829/fco29065.html \"Rebecca Mark's Exit Leaves Enron's Azurix Treading Deep Water\"]. Originally in: The Wall Street Journal. August 28, 2000. Azurix assets, including Wessex, were  eventually sold by Enron.Grigg, Neil S. [https://books.google.com/books?idC_KenysXGuEC&pg\nPA76 Water Finance: Public Responsibilities and Private Opportunities]. John Wiley & Sons, 2011. p. 76.\n\nMisleading financial accounts\n\nIn 1990, Enron's Chief Operating Officer Jeffrey Skilling hired Andrew Fastow, who was well acquainted with the burgeoning deregulated energy market that Skilling wanted to exploit. In 1993, Fastow began establishing numerous limited liability special purpose entities (a common business practice in the energy sector); however, it also allowed Enron to transfer liability so that it would not appear in its accounts, allowing it to maintain a robust and generally increasing stock price and thus keeping its critical investment grade credit ratings.\n\nEnron was originally involved in transmitting and distributing electricity and natural gas throughout the United States. The company developed, built, and operated power plants and pipelines while dealing with rules of law and other infrastructures worldwide. Enron owned a large network of natural gas pipelines, which stretched ocean to ocean and border to border including Northern Natural Gas, Florida Gas Transmission, Transwestern Pipeline company and a partnership in Northern Border Pipeline from Canada. The states of California, New Hampshire and Rhode Island had already passed power deregulation laws by July 1996, the time of Enron's proposal to acquire Portland General Electric corporation. During 1998, Enron began operations in the water sector, creating the Azurix Corporation, which it part-floated on the New York Stock Exchange during June 1999. Azurix failed to become successful in the water utility market, and one of its major concessions, in Buenos Aires, was a large-scale money-loser. After the relocation to Houston, many analysts criticized the Enron management as being greatly in debt. Enron management pursued aggressive retribution against its critics, setting the pattern for dealing with accountants, lawyers, and the financial media.\n\nEnron grew wealthy due largely to marketing, promoting power, and its high stock price. Enron was named \"America's Most Innovative Company\" by the magazine Fortune for six consecutive years, from 1996 to 2001.Sharp, p.13. It was on the Fortunes \"100 Best Companies to Work for in America\" list during 2000, and had offices that were stunning in their opulence. Enron was hailed by many, including labor and the workforce, as an overall great company, praised for its large long-term pensions, benefits for its workers and extremely effective management until the exposure of its corporate fraud. The first analyst to question the company's success story was Daniel Scotto, an energy market expert at BNP Paribas, who issued a note in August 2001 entitled Enron: All stressed up and no place to go, which encouraged investors to sell Enron stocks, although he only changed his recommendation on the stock from \"buy\" to \"neutral\".\n\nAs was later discovered, many of Enron's recorded assets and profits were inflated or even wholly fraudulent and nonexistent. One example of fraudulent records was during 1999 when Enron promised to repay Merrill Lynch & Co.'s investment with interest in order to show profit on its books. Debts and losses were put into entities formed \"offshore\" that were not included in the company's financial statements, and other sophisticated and arcane financial transactions between Enron and related companies were used to eliminate unprofitable entities from the company's books.\n\nThe company's most valuable asset and the largest source of honest income, the 1930s-era Northern Natural Gas company, was eventually purchased by a group of Omaha investors, who relocated its headquarters back to Omaha; it is now a unit of Warren Buffett's Berkshire Hathaway Energy. NNG was established as collateral for a $2.5 billion capital infusion by Dynegy Corporation when Dynegy was planning to buy Enron. When Dynegy examined Enron's financial records carefully, they repudiated the deal and dismissed their CEO, Chuck Watson. The new chairman and CEO, the late Daniel Dienstbier, had been president of NNG and an Enron executive at one time and was forced out of Enron by Ken Lay.  Dienstbier was an acquaintance of Warren Buffett. NNG continues to be profitable now.\n\n2001 Accounting scandals \n\nDuring 2001, after a series of revelations involving irregular accounting procedures bordering on fraud perpetrated throughout the 1990s involving Enron and its accounting company Arthur Andersen, Enron suffered the largest Chapter 11 bankruptcy in history (since surpassed by those of Worldcom during 2002 and Lehman Brothers during 2008).\n\nAs the scandal progressed, Enron share prices decreased from US $90.56 during the summer of 2000, to just pennies.http://www.gilardi.com/pdf/enro13ptable.pdf  Enron had been considered a blue chip stock investment, so this was an unprecedented event in the financial world. Enron's demise occurred after the revelation that much of its profits and revenue were the result of deals with special purpose entities (limited partnerships which it controlled). This meant that many of Enron's debts and the losses that it suffered were not reported in its financial statements.\n\nA rescue attempt by a similar, smaller energy company, Dynegy, failed during late November due to concerns about an unexpected restatement of earnings. Enron filed for bankruptcy on December 2, 2001. In addition, the scandal caused the dissolution of Arthur Andersen, which at the time was one of the \"Big Five\" - the world's foremost accounting firms. The company was found guilty of obstruction of justice during 2002 for destroying documents related to the Enron audit. Since the SEC is not allowed to accept audits from convicted felons, Andersen was forced to stop auditing public companies. Although the conviction was dismissed during 2005 by the Supreme Court, the damage to the Andersen name has prevented it from reviving as a viable business even on a limited scale.\n\nEnron also withdrew a naming-rights deal with the Houston Astros Major League Baseball club to have its name associated with their new stadium, which was known formerly as Enron Field (now Minute Maid Park).\n\nAccounting practices\n\nEnron used a variety of deceptive, bewildering, and fraudulent accounting practices and tactics to cover its fraud in reporting Enron's financial information. Special Purpose Entities were created to mask significant liabilities from Enron's financial statements. These entities made Enron seem more profitable than it actually was, and created a dangerous spiral in which, each quarter, corporate officers would have to perform more and more financial deception to create the illusion of billions of dollars in profit while the company was actually losing money. This practice increased their stock price to new levels, at which point the executives began to work on insider information and trade millions of dollars' worth of Enron stock. The executives and insiders at Enron knew about the offshore accounts that were hiding losses for the company; however, the investors knew nothing of this. Chief Financial Officer Andrew Fastow directed the team which created the off-books companies, and manipulated the deals to provide himself, his family, and his friends with hundreds of millions of dollars in guaranteed revenue, at the expense of the corporation for which he worked and its stockholders.\n\nDuring 1999, Enron initiated EnronOnline, an Internet-based trading operation, which was used by virtually every energy company in the United States. Enron president and chief operating officer Jeffrey Skilling began advocating a novel idea: the company didn't really need any \"assets\". By promoting the company's aggressive investment strategy, he helped make Enron the biggest wholesaler of gas and electricity, trading over $27 billion per quarter. The corporation's financial claims, however, had to be accepted at face value. Under Skilling, Enron adopted mark to market accounting, in which anticipated future profits from any deal were tabulated as if currently real. Thus, Enron could record gains from what over time might turn out to be losses, as the company's fiscal health became secondary to manipulating its stock price on Wall Street during the so-called Tech boom. But when a company's success is measured by undocumented financial statements, actual balance sheets are inconvenient. Indeed, Enron's unscrupulous actions were often gambles to keep the deception going and so increase the stock price. An advancing price meant a continued infusion of investor capital on which debt-ridden Enron in large part subsisted (much like a financial \"pyramid\" or \"Ponzi scheme\"). Attempting to maintain the illusion, Skilling verbally attacked Wall Street Analyst Richard Grubman, who questioned Enron's unusual accounting practice during a recorded conference telephone call. When Grubman complained that Enron was the only company that could not release a balance sheet along with its earnings statements, Skilling replied, \"Well, thank you very much, we appreciate that ... asshole.\" Though the comment was met with dismay and astonishment by press and public, it became an inside joke among many Enron employees, mocking Grubman for his perceived meddling rather than Skilling's offensiveness. When asked during his trial, Skilling declared that industrial dominance and abuse was a global problem: \"Oh yes, yes sure, it is.\"\n\nPost-bankruptcy\n\nEnron initially planned to retain its three domestic pipeline companies as well as most of its overseas assets. However, before emerging from bankruptcy, Enron sold its domestic pipeline companies as CrossCountry Energy for $2.45 billion  and later sold other assets to Vulcan Capital Management.\n\nEnron sold its last business, Prisma Energy, during 2006, leaving Enron asset-less. During early 2007, its name was changed to Enron Creditors Recovery Corporation. Its goal is to repay the old Enron's remaining creditors and end Enron's affairs.\n\nAzurix, the former water utility part of the company, remains under Enron ownership, although it is currently asset-less. It is involved in several litigations against the government of Argentina claiming compensation relating to the negligence and corruption of the local governance during its management of the Buenos Aires water concession during 1999, which resulted in substantial amounts of debt (approx. $620 million) and the eventual collapse of the branch.\n\nSoon after emerging from bankruptcy during November 2004, Enron's new board of directors sued 11 financial institutions for helping Lay, Fastow, Skilling and others hide Enron's true financial condition. The proceedings were dubbed the \"megaclaims litigation\". Among the defendants were Royal Bank of Scotland, Deutsche Bank and Citigroup. , Enron has settled with all of the institutions, ending with Citigroup. Enron was able to obtain nearly $7.2 billion to distribute to its creditors as a result of the megaclaims litigation. As of December 2009, some claim and process payments were still being distributed.\n\nInsider trading scandal\n\nPeak and decline of stock price\n\nDuring August 2000, Enron's stock price attained its greatest value of $90.56. At this time Enron executives, who possessed inside information on the hidden losses, began to sell their stock. At the same time, the general public and Enron's investors were told to buy the stock. Executives told the investors that the stock would continue to increase until it attained possibly the $130 to $140 range, while secretly unloading their shares.\n\nAs executives sold their shares, the price began to decrease. Investors were told to continue buying stock or hold steady if they already owned Enron because the stock price would rebound during the near future. Kenneth Lay's strategy for responding to Enron's continuing problems was his demeanor. As he did many times, Lay would issue a statement or make an appearance to calm investors and assure them that Enron was doing well. In February 2001 an article by Bethany McLean appeared in Fortune magazine questioning whether Enron stock was overvalued.\n\nBy August 15, 2001, Enron's stock price had decreased to $42. Many of the investors still trusted Lay and believed that Enron would rule the market. They continued to buy or retain their stock as the equity value decreased. As October ended, the stock had decreased to $15. Many considered this a great opportunity to buy Enron stock because of what Lay had been telling them in the media.\n\nLay was accused of selling more than $70 million worth of stock at this time, which he used to repay cash advances on lines of credit. He sold another $29 million worth of stock in the open market. Also, Lay's wife, Linda, was accused of selling 500,000 shares of Enron stock totaling $1.2 million on November 28, 2001. The money earned from this sale did not go to the family but rather to charitable organizations, which had already received pledges of contributions from the foundation. Records show that Mrs. Lay made the sale order sometime between 10:00 and 10:20 am. News of Enron's problems, including the millions of dollars in losses they hid, became public about 10:30 that morning, and the stock price soon decreased to less than one dollar.\n\nFormer Enron executive Paula Rieker was charged with criminal insider trading and sentenced to two years probation. Rieker obtained 18,380 Enron shares for $15.51 a share. She sold that stock for $49.77 a share during July 2001, a week before the public was told what she already knew about the $102 million loss. In 2002, after the tumultuous fall of Enron's external auditor, and management consultant, Andersen LLP, former Andersen Director, John M. Cunningham coined the phrase, \"We have all been Enroned.\"\n\nThe fallout resulted in both Lay and Skilling being convicted for conspiracy, fraud, and insider trading. Lay died before sentencing, Skilling got 24 years and 4 months and a $45 million penalty (later reduced). Fastow was sentenced to six years of jail time, and Lou Pai settled out of court for $31.5 million.\n\nCalifornia's deregulation and subsequent energy crisis\n\nDuring October 2000, Daniel Scotto, the most renowned utility analyst on Wall Street, suspended his ratings on all energy companies conducting business in California because of the possibility that the companies would not receive full and adequate compensation for the deferred energy accounts used as the basis for the California Deregulation Plan enacted during the late 1990s. Five months later, Pacific Gas & Electric (PG&E) was forced into bankruptcy. Senator Phil Gramm, husband of Enron Board member Wendy Gramm and also the second largest recipient of campaign contributions from Enron, succeeded in legislating California's energy commodity trading deregulation. Despite warnings from prominent consumer groups which stated that this law would give energy traders too much influence over energy commodity prices, the legislation was passed during December 2000.\n\nAs the periodical Public Citizen reported, \"Because of Enron's new, unregulated power auction, the company's 'Wholesale Services' revenues quadrupled—- from $12 billion in the first quarter of 2000 to $48.4 billion in the first quarter of 2001.\"\n\nAfter passage of the deregulation law, California had a total of 38 Stage 3 rolling blackouts declared, until federal regulators intervened during June 2001. These blackouts occurred as a result of a poorly designed market system that was manipulated by traders and marketers, as well as poor state management and regulatory oversight. Subsequently, Enron traders were revealed as intentionally encouraging the removal of power from the market during California's energy crisis by encouraging suppliers to shut down plants to perform unnecessary maintenance, as documented in recordings made at the time. These acts contributed to the need for rolling blackouts, which adversely affected many businesses dependent upon a reliable supply of electricity, and inconvenienced a large number of retail customers. This scattered supply increased the price, and Enron traders were thus able to sell power at premium prices, sometimes up to a factor of 20x its normal peak value.\n\nFormer management and corporate governance\n\nProducts\n\nEnron traded in more than 30 different products, including the following:\n\n* Products traded on EnronOnline\n** Petrochemicals\n** Plastics\n** Power\n** Pulp and paper\n** Steel\n** Weather Risk Management\n* Oil and LNG transportation\n* Broadband\n* Principal investments\n* Risk management for commodities\n* Shipping / freight\n* Streaming media\n* Water and wastewater\n\nIt was also an extensive futures trader, including sugar, coffee, grains, hogs, and other meat futures. At the time of its bankruptcy filing during December 2001, Enron was structured into seven distinct business units.\n\nOnline marketplace services\n\n*EnronOnline (commodity trading platform).\n*ClickPaper (transaction platform for pulp, paper, and wood products).\n*EnronCredit (the first global online credit department to provide live credit prices and enable business-to-business customers to hedge credit exposure instantly via the Internet).\n*ePowerOnline (customer interface for Enron Broadband Services).\n*Enron Direct (sales of fixed-price contracts for gas and electricity; Europe only).\n*EnergyDesk (energy-related derivatives trading; Europe only).\n*NewPowerCompany (online energy trading, joint venture with IBM and AOL).\n*Enron Weather (weather derivatives).\n*DealBench (online business services).\n*Water2Water (water storage, supply, and quality credits trading).\n*HotTap (customer interface for Enron's U.S. gas pipeline businesses).\n*Enromarkt (business to business pricing and information platform; Germany only).\n\nBroadband services\n\n*Enron Intelligent Network (broadband content delivery).\n*Enron Media Services (risk management services for media content companies).\n*Customizable Bandwidth Solutions (bandwidth and fiber products trading).\n*Streaming Media Applications (live or on-demand Internet broadcasting applications).\n\nEnergy and commodities services\n\n*Enron Power (electricity wholesaling).\n*Enron Natural Gas (natural gas wholesaling).\n*Enron Clean Fuels (biofuel wholesaling).\n*Enron Pulp and Paper, Packaging, and Lumber (risk management derivatives for forest products industry).\n*Enron Coal and Emissions (coal wholesaling and CO2 offsets trading).\n*Enron Plastics and Petrochemicals (price risk management for polymers, olefins, methanol, aromatics, and natural gas liquids).\n*Enron Weather Risk Management (Weather Derivatives).\n*Enron Steel (financial swap contracts and spot pricing for the steel industry).\n*Enron Crude Oil and Oil Products (petroleum hedging).\n*Enron Wind Power Services (wind turbine manufacturing and wind farm operation).\n*MG Plc. (U.K. metals merchant).\n*Enron Energy Services (Selling services to industrial end users).\n*Enron International (operation of all overseas assets).\n\nCapital and risk management services\n\nCommercial and industrial outsourcing services\n\n*Commodity Management.\n*Energy Asset Management.\n*Energy Information Management.\n*Facility Management.\n*Capital Management.\n*Azurix Inc. (water utilities and infrastructure).\n\nProject development and management services\n\n*Energy Infrastructure Development (developing, financing, and operation of power plants and related projects).\n*Enron Global Exploration & Production Inc. (upstream oil and natural gas international development).\n*Elektro Electricidade e Servicos SA (Brazilian electric utility).\n*Northern Border Pipeline.\n*Houston Pipeline.\n*Transwestern Pipeline.\n*Florida Gas Transmission.\n*Northern Natural Gas Company.\n*Natural Gas Storage.\n*Compression Services.\n*Gas Processing and Treatment.\n*Engineering, Procurement, and Construction Services.\n*EOTT Energy Inc. (oil transportation).\n\nEnron manufactured gas valves, circuit breakers, thermostats, and electrical equipment in Venezuela by means of INSELA SA, a 50–50 joint venture with General Electric. Enron owned three paper and pulp products companies: Garden State Paper, a newsprint mill; as well as Papiers Stadacona and St. Aurelie Timberlands. Enron had a controlling stake in the Louisiana-based petroleum exploration and production company Mariner Energy.\n\nEnronOnline \n\nEnron opened EnronOnline, an electronic trading platform for energy commodities, on November 29, 1999. Conceptualized by the company's European Gas Trading team, it was the first web-based transaction system that allowed buyers and sellers to buy, sell, and trade commodity products globally. It allowed users to do business only with Enron. The site allowed Enron to transact with participants in the global energy markets. The main commodities offered on EnronOnline were natural gas and electricity, although there were 500 other products including credit derivatives, bankruptcy swaps, pulp, gas, plastics, paper, steel, metals, freight, and TV commercial time. At its maximum, more than $6 billion worth of commodities were transacted by means of EnronOnline every day.\n\nAfter Enron's bankruptcy in late 2001, EnronOnline was sold to the Swiss financial giant UBS. Within a year, UBS abandoned its efforts to relaunch the division, and closed it in November 2002.\n\nEnron International \n\nEnron International (EI) was Enron's wholesale asset development and asset management business. Its primary emphasis was developing and building natural gas power plants outside North America. Enron Engineering and Construction Company (EECC) was a wholly owned subsidiary of Enron International, and built almost all of Enron International's power plants. Unlike other business units of Enron, Enron International had a strong cash flow on bankruptcy filing. Enron International consisted of all of Enron's foreign power projects, including ones in Europe.\n\nThe company's Teesside plant was one of the largest gas-fired power stations in the world, built and operated by Enron from 1989, and produced 3 percent of the United Kingdom's energy needs.[http://www.dailymail.co.uk/news/article-65514/Third-worker-dies-power-plant-blast.html Third worker dies after power plant blast | Mail Online]. Dailymail.co.uk. Retrieved on 2013-07-12.\"Principal Player in the Electricity Game.\" Financial Times [London, England] 17 Sept. 1990: 19. Financial Times. Web. 4 July 2012. Enron owned half of the plant's equity, with the remaining 50 per cent split between four regional electricity companies.\n\nManagement \n\nRebecca Mark was the CEO of Enron International until she resigned to manage Enron's newly acquired water business, Azurix, during 1997. Mark had a major role in the development of the Dabhol project in India, Enron's largest international endeavor.\n\nProjects \n\nEnron International constructed power plants and pipelines across the globe. Some are presently still operating, including the massive Teesside plant in England. Others, like a barge-mounted plant off Puerto Plata in the Dominican Republic, cost Enron money by lawsuits and investment losses. Puerto Plata was a barge-mounted power plant next to the hotel Hotelero del Atlantico. When the plant was activated, winds blew soot from the plant onto the hotel guests' meals, blackening their food. The winds also blew garbage from nearby slums into the plant's water-intake system. For some time the only solution was to hire men who would row out and push the garbage away with their paddles. Through mid-2000 the company collected a paltry $3.5 million from a $95 million investment. Enron also had other investment projects in Europe, South America, Argentina, Brazil, Bolivia, Colombia, Mexico, Jamaica, Venezuela, and across the Caribbean.\n\nIndia \n\nAround 1992 Indian experts came to the United States to find energy investors to help with India's energy shortage problems. During December 1993, Enron finalized a 20-year power-purchase contract with the Maharashtra State Electricity Board. The contract allowed Enron to construct a massive 2,015 megawatt power plant on a remote volcanic bluff 100 mi south of Mumbai. Construction would be completed in two phases, and Enron would form the Dabhol Power Company to help manage the plant. The power project was the first step in a $20 billion scheme to help rebuild and stabilize India's power grid. Enron, GE (which was selling turbines to the project), and Bechtel (which was actually constructing the plant), each contributed 10% equity.\n\nDuring 1996, when India's Congress Party was no longer in power, the Indian government assessed the project as being excessively expensive and refused to pay for the plant and stopped construction. The Maharashtra State Electricity Board (MSEB), the local state-owned utility, was required by contract to continue to pay Enron plant maintenance charges, even if no power was purchased from the plant. The MSEB determined that it could not afford to purchase the power (at Rs. 8 per unit kWh) charged by Enron. The plant operator was unable to find alternate customers for Dabhol power due to the absence of a free market in the regulated structure of utilities in India. From 1996 until Enron's bankruptcy during 2001 the company tried to revive the project and revive interest in India's need for the power plant without success.\n\nProject summer \n\nDuring the summer of 2001, Enron made an attempt to sell a number of Enron International's assets, many of which were not sold. The public and media believed it was unknown why Enron wanted to sell these assets, suspecting it was because Enron was in need of cash. Employees who worked with company assets were told in 2000 Enron Communication, 4th Quarter, 2000 that Jeff Skilling believed that business assets were an outdated means of company worth, and instead he wanted to build a company based on \"intellectual assets\".\n\nEnron Global Exploration & Production, Inc. \n\nEnron Global Exploration & Production Inc. (EGEP) was an Enron subsidiary that was born from the split of domestic assets via EOG Resources (formerly Enron Oil and Gas EOG) and international assets via EGEP (formerly Enron Oil and Gas Int'l, Ltd EOGIL).  \nAmong the EGEP assets were the Panna-Mukta and the South Tapti fields, discovered by the Indian state-owned Oil and Natural Gas Corporation (ONGC), which operated the fields initially.\nDecember 1994, a joint venture began between ONGC (40%), Enron (30%) and Reliance (30%).\nMid year of 2002, British Gas (BG) completed the acquisition of EGEP's 30% share of the Panna-Mukta and Tapti fields for $350 million, a few months before Enron filed bankruptcy.\n\nEnron Prize for Distinguished Public Service\n\nDuring the mid-1990s, Enron established an endowment for the Enron Prize for Distinguished Public Service, awarded by Rice University's Baker Institute to \"recognize outstanding individuals for their contributions to public service\".  Recipients were:\n\n* 1995: Colin Powell.\n* 1997: Mikhail Gorbachev.\n* 1999 (early): Eduard Shevardnadze.\n* 1999 (late): Nelson Mandela.\n* 2001: Alan Greenspan.Almond, B.J. [http://stage.media.rice.edu/media/NewsBot.asp?MODE\nVIEW&ID2837&SnID\n2 Greenspan, Putin to speak on campus] Rice University News & Media Relations, Nov 8, 2001. Retrieved: Aug 26, 2011.\n\nGreenspan, because of his position as the Fed chairman, was not at liberty to accept the $10,000 honorarium, the $15,000 sculpture, nor the crystal trophy, but only accepted the \"honor\" of being named an Enron Prize recipient.[http://www.enron-mail.com/email/lay-k/inbox/Enron_Prize.html Enron Prize]. Enron-mail.com. Retrieved on 2013-07-12. The situation was further complicated because a few days earlier, Enron had filed paperwork admitting it had falsified financial statements for five years. Greenspan did not mention Enron a single time during his speech.Bryce, Robert [https://books.google.com/books?id\nQu7jYzUVnScC&pgPA327&lpg\nPA327#vonepage&q&f\nfalse Pipe Dreams: Greed, Ego, and the Death of Enron] Rice University News & Media Relations, Nov 8, 2001. Retrieved: Aug 26, 2011. At the ceremony, Ken Lay stated, \"I'm looking forward to our first woman recipient.\"[http://www.enron-mail.com/email/martin-t/deleted_items/Enron_Mentions_97.html Enron Mentions]. Enron-mail.com. Retrieved on 2013-07-12. The next morning, it was reported in the Houston Chronicle that no decision had been made on whether the name of the prize would be changed.[http://www.enron-mail.com/email/kitchen-l/_americas/sec_media/Enron_Mentions_30.html Enron Mentions]. Enron-mail.com. Retrieved on 2013-07-12. 19 days after the prize was awarded to Greenspan, Enron declared bankruptcy.\n\nDuring early 2002, Enron was awarded Harvard's (in)famous Ig Nobel Prize for 'Most Creative Use of Imaginary Numbers.' The various former members of Enron management all refused to accept the award in person, although no reason was given at the time.\n\nEnron's Influence on Politics \n\n* George W. Bush, sitting president at the time, received $312,500 to his campaigns and $413,800 to his presidential war chest and inaugural fund.\n* Dick Cheney, sitting vice president at the time, met with Enron executives six times to develop a new energy policy. He refused to show minutes to Congress.\n* John Ashcroft, attorney general at the time, recused himself from the DOJ's investigation into Enron due to receiving $57,499 when running for senate seat in 2000.\n* Lawrence Lindsay, White House Economic Advisor at the time, made $50,000 as a consultant with Enron before moving to the White House in 2000.\n* Karl Rove, White House Senior Advisor at the time, waited five months before selling $100,000 of Enron stock.\n* Marc F. Racicot, Republican National Committee Chairman Nominee at the time, was handpicked by George W. Bush and continued to serve as a lawyer with a firm that lobbies for Enron. Enron. http://en.wikipedia.org/?curid=10166."
  }
}
