{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16542",
  "eid" : "2671f920-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573746,
  "textBody" : "Jadavpur University is a public state university located in Kolkata, West Bengal, India.\n\nHistory\n\nNational Council of Education, Bengal\n\nUniversity of Calcutta is one of the three universities in early modern India, the other two being Bombay (now Mumbai) and Madras University. It was set up by the British in Calcutta in 1861 as a means of spreading western philosophical thought among the elite in India. It also aimed to create, in the words of Lord Macaulay, \"a class of persons Indian in blood and colour, but English in tastes, in opinions, in morals and in intellect.\" This initiative was furthered by the passing of the Universities Act of 1904. This resulted in the reorganization of the Calcutta University's Senate and Syndicate by the nomination of more white members into them, which in turn would enable the government to control its policies. The government also decided to disaffiliate many private Indian colleges, which had come up lately and were regarded by the government as hotbeds of nationalist agitation. The measures stirred the educated middle class to move for alternative systems of education. Even the diplomas awarded by Jadavpur University were not recognised by the UGC / Govt. of India in the past until it was upgraded to a university in 1955. Its diploma awarded by National Council of Education was not recognized til 1954.\n\nThe nationalists in the freedom struggle of India dubbed the Calcutta University, another pillar of India's education movement, as \"Goldighir Ghulamkhana\", or the slave house of Goldighi, with reference to the lake adjacent to Calcutta University, and the number of graduates it churned out who were used in the British era as ICS officers. Hence, the need for setting up an institution which would impart education along nationalist lines was strongly felt by the luminaries of the period. The real impetus though was provided by the partition of Bengal by Lord Curzon, the then Governor-General of India, into East Bengal on the one hand (the area that was eventually to become Bangladesh in 1971) and West Bengal and Odisha on the other. The young men of Bengal were amongst the most active in the Swadeshi movement, and the participation of university students drew the ire of the Raj. R.W. Carlyle prohibited the participation of students in political meetings on the threat of withdrawal of funding and grants. The decade preceding these decrees had seen Bengali intellectuals increasingly calling for indigenous schools and colleges to replace British institutions.\n\nOn 16 November 1905, the Landholders Society organized a meeting at Park Street, attended by around 1500 delegates, including Rabindranath Tagore, Aurobindo Ghosh, Raja Subodh Chandra Mullick and Brajendra Kishore Roychowdhury. The idea of the National Council of Education was mooted here. While in a meeting held on 9 November 1905 at the Field and Academic Club, Subodh Chandra Mullick pledged Rupees one lakh for the foundation of a National University in Bengal. The objective in setting up the institution that was to challenge the British rule over education by offering education to the masses 'on national lines and under national control'.\n\nGenerous sums of money were also donated by Brojendra Kishore Roy Choudhury, Maharaja Suryya Kanto Acharya Choudhury and Rashbihari Ghosh, who was appointed the first president of the university. Aurobindo served as the first principal of the college. The organisation in its early days was intricately associated with the nascent revolutionary nationalism in Bengal at the time. It was during his time as principal that Aurobindo started his nationalist publications Jugantar, Karmayogin and Bande Mataram.\n\nThe students' mess at the college was frequented by students of East Bengal who belonged to the Dhaka branch of the Anushilan Samiti, and was known to be hotbed of revolutionary nationalism, which was uncontrolled or even encouraged by the college.\n\nBengal Technical Institute\n\nAlmost on the same day that the National Council of Education was set up, a rival organisation, the Society for Promotion of Technical Education in Bengal, was set up by Taraknath Palit.Haridas Mukherjee and Uma Mukherjee, The Origins of the National Education Movement (Calcutta: National Council of Education, 1992) The Bengal Technical Institute came into being on 25 July 1906 under the umbrella of the SPTE, with the objective of spreading technical education among the masses in West Bengal, one of the eastern region states of India.\n\nEmblem\n\nThe emblem of the university is a three-flamed lamp encircled by lotus petals. The lamp represents knowledge. The three flames represent intellectual training, cultivation of emotions and imagination, and spiritual development. The petals of the lotus on the periphery represent fine arts and culture. The emblem was designed by Nandalal Bose, a key member of the Bengal School of Art, who was one of the great masters at Kala Bhavan in Rabindranath Tagore's Visva-Bharati University in Santiniketan. As the university celebrated its Golden Jubilee on 24 December 2005,  the emblem was created to commemorate the occasion, and the motto 'To Know Is To Grow' was coined. This date was also the centenary of the National Council of Education.Ananda Lal, Rama Prasad De, and Amrita Sen, The Lamp in the Lotus: A History of Jadavpur University (Calcutta: Jadavpur University, 2005)\n\nCampus\n\nJadavpur University is semi-residential, which at present operates out of two urban campuses: one in Jadavpur (58 acre) and another in Salt Lake (26 acre).\n\nNational Instruments Limited Campus\n\nJadavpur University has recently acquired the erstwhile National Instruments Limited (CSIR), becoming the first Indian university to acquire such a research unit. It is on a nine-acre plot opposite the main campus. After renovation, the new campus is expected to add much-needed space for new laboratories especially for the Departments of Electrical Engineering, Electronics and Telecommunication Engineering, and Computer Science & Engineering. The NIL campus is to be connected to the main campus by an underground tunnel to bypass the traffic on the busy Raja S.C. Mullick Road. In 2013, Defence Research & Development Organisation (DRDO) announced plans to set up one of the country's biggest state-of-the-art research hubs and Advanced Technology Centre at the NIL campus. In the same year, CSIR announced the setting up of a research centre for big data analytics and an Inverted Innovation Centre alongside the research hub already announced by DRDO.\n\nAffiliated institutes\n\nIn addition to being a unitary university, it has other institutes like the Jawahari Devi Birla Institute of Commerce and Management, Jadavpur Vidyapith as well as the Institute of Business Management, Jadavpur University affiliated to it, which operate out of independent campuses. While these institutes have their own independent curriculum as well as examination systems, the final degree is offered by Jadavpur University.\n\nRankings\n\nInternationally, Jadavpur University ranked 601-650 by the QS World University Rankings of 2018, 125 in Asia and 74 among BRICS nations. It was ranked 601-800 in the world by the Times Higher Education World University Rankings of 2018, 101-110 in Asia and 99 among BRICS & Emerging Economies University Rankings in 2017. It was also ranked 772 in the world by U.S. News & World Report. The university was ranked 543rd in the world by CWTS Leiden Ranking in 2017, for the period 2012-2015.\n\nThe National Institutional Ranking Framework has ranked it 9 among engineering colleges in India in 2017, 12 overall and 5th among universities.\n\nPress and publication house\n\nThe university press publishes all documents of record in the university including PhD theses, question papers and journals. On 26 October 2010 the institution announced plans to launch a publication house, named Jadavpur University Press. The main focus of the publication house will be to publish textbooks and thesis written by research scholars and authors from all universities. The first two titles of JUP were launched on 1 February 2012 at the Calcutta Book Fair. The two titles were Rajpurush (translation of Niccolò Machiavelli's Il Principe); translated by Doyeeta Majumder, with an introduction by Swapan Kumar Chakravorty, and Shilpachinta (translation of selections from Leonardo da Vinci's notebooks); translated by Sukanta Chaudhuri. Both books were translated from the original Italian.\n\nAffiliated Schools \n\nTo facilitate interdisciplinary learning and research in diverse fields, there are a number of schools and centre for studies. Some of the major research ventures undertaken by these schools include the pioneering work done by the School of Environmental Studies in highlighting the presence of arsenic in groundwater in countries like India and Bangladesh and the development of the first alcohol based car by the School of Automobile Engineering.[http://www.jaduniv.edu.in/htdocs/view_department.php?deptid=135 School Of Cultural Texts and Records]  jaduniv.edu.in. Retrieved 5 August 2012[https://sites.google.com/site/schoolnewsite/home School of Cognitive Science (SofCS) @ JU] Retrieved August 2012\n\nThe centres for studies are usually directly associated with a particular department and the centres in Jadavpur University are:\n\nIn March 2011, Indian American scientist Manick Sorcar assisted in the opening of a laser animation lab under the School of Illumination Science, Engineering and Design.[http://www.telegraphindia.com/1110321/jsp/calcutta/story_13740322.jsp \"Wizard of light brings magic of laser to JU,\"] The Telegraph, 2011\n\nNotable alumni\n\n \nThe Alumni Association, one of the oldest in the country, was founded in 1921 by the ex-students of National Council of Education.\n\nThe following is list of notable alumni.\n* Anupam Roy, singer and film music director\n* Arnab Ray, blogger and author\n* Arundhati Bhattacharya, graduate of Calcutta University first woman chairperson of State Bank of India\n* Debalina Majumder, documentary director\n* K. S. Dasgupta, Director of the Indian Institute of Space Science and Technology\n* Kajal Bandyopadhyay, poet\n* Kumar Mukherjee, Hindustani classical vocalist\n* Manabendra Nath Roy, political activist\n* Neel Mukherjee, novelist\n* Parambrata Chatterjee, actor\n* Ramaranjan Mukherji, writer, former chancellor of Rashtriya Sanskrit Vidyapeeth, Padma Shri recipient\n* Rituparno Ghosh, film director, actor\n* Samir Das, professor of computer science at Stony Brook University\n* Saroj Ghose, former director of Birla Industrial and Technological Museum\n* Sibaji Bandyopadhyay, author and critic\n* Somnath Dasgupta, former vice-chancellor of Assam University\n* Subir Raha, former Director of Oil and Natural Gas Corporation\n* Souvik Maiti, biochemist, Shanti Swarup Bhatnagar and N-BIOS laureate\n* Shantanu Chowdhury, structural biologist, Shanti Swarup Bhatnagar and N-BIOS laureate\n* Suvendra Nath Bhattacharyya, molecular biologist, Shanti Swarup Bhatnagar and N-BIOS laureate\n* Samaresh Bhattacharya, inorganic chemist, Shanti Swarup Bhatnagar laureate\n* Partha Sarathi Mukherjee, inorganic chemist, Shanti Swarup Bhatnagar laureate\n* Alok Krishna Gupta, petrologist, Shanti Swarup Bhatnagar laureate\n* Nibir Mandal, structural geologist, Shanti Swarup Bhatnagar laureate\n* Pulak Sengupta, petrologist, Shanti Swarup Bhatnagar laureate\n* Amitabha Bhattacharyya, production engineer, Shanti Swarup Bhatnagar laureate\n* Pinaki Majumdar, condensed matter physicist, Shanti Swarup Bhatnagar laureate\n* Amitabha Mukhopadhyay, cell biologist, Shanti Swarup Bhatnagar laureate\n* Snehasikta Swarnakar, cancer biologist, N-Bios laureate\n* Sunil Kumar Manna, immunologist, N-Bios laureate\n* Subrata Adak, chemical biologist, N-Bios laureate\n\nControversy and criticism\n\nIn 2014 a series of protests broke out in response to the alleged molestation of a female student and beating of a male student by 10 other students on 28 August 2014. Her family and ultimately the student body were unsatisfied by the response of the Vice Chancellor to the allegations. Protests began on 10 September. On 16 September students gheraoed several officials in their offices, demanding that the Vice Chancellor make a statement on the status of a fair probe. Police were summoned, and later that night the police allegedly attacked and beat the student demonstrators. 30 to 40 students were injured; some had to be hospitalized. Reaction was nationwide, with supportive protests at multiple other cities including New Delhi, Hyderabad and Bangalore. On 20 September, Governor Keshari Nath Tripathi, who is also the chancellor of the university, met with student representatives and promised to conduct an impartial inquiry. However, students said they will continue to boycott classes until the Vice Chancellor resigns.\n\nOn 26 September, a State Government inquiry panel submitted its report, confirming that the female student had indeed been sexually abused on 28 August 2014. On 26 September, police summoned two Jadavpur University students to come to the Lalbazar Police HQ for questioning at 4 pm on Friday. They were arrested at 6 pm. \"The arrests were made after evidence was found, prima facie, against the duo. Further investigation is on,\" said joint CP-crime Pallab Kanti Ghosh. Mr Ghosh also stated, \"(Two names) were arrested because we had enough evidence to prove that they were present at the spot and had carried out the crime as alleged in the victim's complaint.\" The duo were booked under Sections of 354 (assault or use of criminal force on a woman with the intent to outrage her modesty), 342 (wrongful confinement), 323 (voluntarily causing hurt) and 114 (abettor present when offence is committed) of the IPC.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jadavpur University" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16542" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jadavpur University is a public state university located in Kolkata, West Bengal, India.\n\nHistory\n\nNational Council of Education, Bengal\n\nUniversity of Calcutta is one of the three universities in early modern India, the other two being Bombay (now Mumbai) and Madras University. It was set up by the British in Calcutta in 1861 as a means of spreading western philosophical thought among the elite in India. It also aimed to create, in the words of Lord Macaulay, \"a class of persons Indian in blood and colour, but English in tastes, in opinions, in morals and in intellect.\" This initiative was furthered by the passing of the Universities Act of 1904. This resulted in the reorganization of the Calcutta University's Senate and Syndicate by the nomination of more white members into them, which in turn would enable the government to control its policies. The government also decided to disaffiliate many private Indian colleges, which had come up lately and were regarded by the government as hotbeds of nationalist agitation. The measures stirred the educated middle class to move for alternative systems of education. Even the diplomas awarded by Jadavpur University were not recognised by the UGC / Govt. of India in the past until it was upgraded to a university in 1955. Its diploma awarded by National Council of Education was not recognized til 1954.\n\nThe nationalists in the freedom struggle of India dubbed the Calcutta University, another pillar of India's education movement, as \"Goldighir Ghulamkhana\", or the slave house of Goldighi, with reference to the lake adjacent to Calcutta University, and the number of graduates it churned out who were used in the British era as ICS officers. Hence, the need for setting up an institution which would impart education along nationalist lines was strongly felt by the luminaries of the period. The real impetus though was provided by the partition of Bengal by Lord Curzon, the then Governor-General of India, into East Bengal on the one hand (the area that was eventually to become Bangladesh in 1971) and West Bengal and Odisha on the other. The young men of Bengal were amongst the most active in the Swadeshi movement, and the participation of university students drew the ire of the Raj. R.W. Carlyle prohibited the participation of students in political meetings on the threat of withdrawal of funding and grants. The decade preceding these decrees had seen Bengali intellectuals increasingly calling for indigenous schools and colleges to replace British institutions.\n\nOn 16 November 1905, the Landholders Society organized a meeting at Park Street, attended by around 1500 delegates, including Rabindranath Tagore, Aurobindo Ghosh, Raja Subodh Chandra Mullick and Brajendra Kishore Roychowdhury. The idea of the National Council of Education was mooted here. While in a meeting held on 9 November 1905 at the Field and Academic Club, Subodh Chandra Mullick pledged Rupees one lakh for the foundation of a National University in Bengal. The objective in setting up the institution that was to challenge the British rule over education by offering education to the masses 'on national lines and under national control'.\n\nGenerous sums of money were also donated by Brojendra Kishore Roy Choudhury, Maharaja Suryya Kanto Acharya Choudhury and Rashbihari Ghosh, who was appointed the first president of the university. Aurobindo served as the first principal of the college. The organisation in its early days was intricately associated with the nascent revolutionary nationalism in Bengal at the time. It was during his time as principal that Aurobindo started his nationalist publications Jugantar, Karmayogin and Bande Mataram.\n\nThe students' mess at the college was frequented by students of East Bengal who belonged to the Dhaka branch of the Anushilan Samiti, and was known to be hotbed of revolutionary nationalism, which was uncontrolled or even encouraged by the college.\n\nBengal Technical Institute\n\nAlmost on the same day that the National Council of Education was set up, a rival organisation, the Society for Promotion of Technical Education in Bengal, was set up by Taraknath Palit.Haridas Mukherjee and Uma Mukherjee, The Origins of the National Education Movement (Calcutta: National Council of Education, 1992) The Bengal Technical Institute came into being on 25 July 1906 under the umbrella of the SPTE, with the objective of spreading technical education among the masses in West Bengal, one of the eastern region states of India.\n\nEmblem\n\nThe emblem of the university is a three-flamed lamp encircled by lotus petals. The lamp represents knowledge. The three flames represent intellectual training, cultivation of emotions and imagination, and spiritual development. The petals of the lotus on the periphery represent fine arts and culture. The emblem was designed by Nandalal Bose, a key member of the Bengal School of Art, who was one of the great masters at Kala Bhavan in Rabindranath Tagore's Visva-Bharati University in Santiniketan. As the university celebrated its Golden Jubilee on 24 December 2005,  the emblem was created to commemorate the occasion, and the motto 'To Know Is To Grow' was coined. This date was also the centenary of the National Council of Education.Ananda Lal, Rama Prasad De, and Amrita Sen, The Lamp in the Lotus: A History of Jadavpur University (Calcutta: Jadavpur University, 2005)\n\nCampus\n\nJadavpur University is semi-residential, which at present operates out of two urban campuses: one in Jadavpur (58 acre) and another in Salt Lake (26 acre).\n\nNational Instruments Limited Campus\n\nJadavpur University has recently acquired the erstwhile National Instruments Limited (CSIR), becoming the first Indian university to acquire such a research unit. It is on a nine-acre plot opposite the main campus. After renovation, the new campus is expected to add much-needed space for new laboratories especially for the Departments of Electrical Engineering, Electronics and Telecommunication Engineering, and Computer Science & Engineering. The NIL campus is to be connected to the main campus by an underground tunnel to bypass the traffic on the busy Raja S.C. Mullick Road. In 2013, Defence Research & Development Organisation (DRDO) announced plans to set up one of the country's biggest state-of-the-art research hubs and Advanced Technology Centre at the NIL campus. In the same year, CSIR announced the setting up of a research centre for big data analytics and an Inverted Innovation Centre alongside the research hub already announced by DRDO.\n\nAffiliated institutes\n\nIn addition to being a unitary university, it has other institutes like the Jawahari Devi Birla Institute of Commerce and Management, Jadavpur Vidyapith as well as the Institute of Business Management, Jadavpur University affiliated to it, which operate out of independent campuses. While these institutes have their own independent curriculum as well as examination systems, the final degree is offered by Jadavpur University.\n\nRankings\n\nInternationally, Jadavpur University ranked 601-650 by the QS World University Rankings of 2018, 125 in Asia and 74 among BRICS nations. It was ranked 601-800 in the world by the Times Higher Education World University Rankings of 2018, 101-110 in Asia and 99 among BRICS & Emerging Economies University Rankings in 2017. It was also ranked 772 in the world by U.S. News & World Report. The university was ranked 543rd in the world by CWTS Leiden Ranking in 2017, for the period 2012-2015.\n\nThe National Institutional Ranking Framework has ranked it 9 among engineering colleges in India in 2017, 12 overall and 5th among universities.\n\nPress and publication house\n\nThe university press publishes all documents of record in the university including PhD theses, question papers and journals. On 26 October 2010 the institution announced plans to launch a publication house, named Jadavpur University Press. The main focus of the publication house will be to publish textbooks and thesis written by research scholars and authors from all universities. The first two titles of JUP were launched on 1 February 2012 at the Calcutta Book Fair. The two titles were Rajpurush (translation of Niccolò Machiavelli's Il Principe); translated by Doyeeta Majumder, with an introduction by Swapan Kumar Chakravorty, and Shilpachinta (translation of selections from Leonardo da Vinci's notebooks); translated by Sukanta Chaudhuri. Both books were translated from the original Italian.\n\nAffiliated Schools \n\nTo facilitate interdisciplinary learning and research in diverse fields, there are a number of schools and centre for studies. Some of the major research ventures undertaken by these schools include the pioneering work done by the School of Environmental Studies in highlighting the presence of arsenic in groundwater in countries like India and Bangladesh and the development of the first alcohol based car by the School of Automobile Engineering.[http://www.jaduniv.edu.in/htdocs/view_department.php?deptid=135 School Of Cultural Texts and Records]  jaduniv.edu.in. Retrieved 5 August 2012[https://sites.google.com/site/schoolnewsite/home School of Cognitive Science (SofCS) @ JU] Retrieved August 2012\n\nThe centres for studies are usually directly associated with a particular department and the centres in Jadavpur University are:\n\nIn March 2011, Indian American scientist Manick Sorcar assisted in the opening of a laser animation lab under the School of Illumination Science, Engineering and Design.[http://www.telegraphindia.com/1110321/jsp/calcutta/story_13740322.jsp \"Wizard of light brings magic of laser to JU,\"] The Telegraph, 2011\n\nNotable alumni\n\n \nThe Alumni Association, one of the oldest in the country, was founded in 1921 by the ex-students of National Council of Education.\n\nThe following is list of notable alumni.\n* Anupam Roy, singer and film music director\n* Arnab Ray, blogger and author\n* Arundhati Bhattacharya, graduate of Calcutta University first woman chairperson of State Bank of India\n* Debalina Majumder, documentary director\n* K. S. Dasgupta, Director of the Indian Institute of Space Science and Technology\n* Kajal Bandyopadhyay, poet\n* Kumar Mukherjee, Hindustani classical vocalist\n* Manabendra Nath Roy, political activist\n* Neel Mukherjee, novelist\n* Parambrata Chatterjee, actor\n* Ramaranjan Mukherji, writer, former chancellor of Rashtriya Sanskrit Vidyapeeth, Padma Shri recipient\n* Rituparno Ghosh, film director, actor\n* Samir Das, professor of computer science at Stony Brook University\n* Saroj Ghose, former director of Birla Industrial and Technological Museum\n* Sibaji Bandyopadhyay, author and critic\n* Somnath Dasgupta, former vice-chancellor of Assam University\n* Subir Raha, former Director of Oil and Natural Gas Corporation\n* Souvik Maiti, biochemist, Shanti Swarup Bhatnagar and N-BIOS laureate\n* Shantanu Chowdhury, structural biologist, Shanti Swarup Bhatnagar and N-BIOS laureate\n* Suvendra Nath Bhattacharyya, molecular biologist, Shanti Swarup Bhatnagar and N-BIOS laureate\n* Samaresh Bhattacharya, inorganic chemist, Shanti Swarup Bhatnagar laureate\n* Partha Sarathi Mukherjee, inorganic chemist, Shanti Swarup Bhatnagar laureate\n* Alok Krishna Gupta, petrologist, Shanti Swarup Bhatnagar laureate\n* Nibir Mandal, structural geologist, Shanti Swarup Bhatnagar laureate\n* Pulak Sengupta, petrologist, Shanti Swarup Bhatnagar laureate\n* Amitabha Bhattacharyya, production engineer, Shanti Swarup Bhatnagar laureate\n* Pinaki Majumdar, condensed matter physicist, Shanti Swarup Bhatnagar laureate\n* Amitabha Mukhopadhyay, cell biologist, Shanti Swarup Bhatnagar laureate\n* Snehasikta Swarnakar, cancer biologist, N-Bios laureate\n* Sunil Kumar Manna, immunologist, N-Bios laureate\n* Subrata Adak, chemical biologist, N-Bios laureate\n\nControversy and criticism\n\nIn 2014 a series of protests broke out in response to the alleged molestation of a female student and beating of a male student by 10 other students on 28 August 2014. Her family and ultimately the student body were unsatisfied by the response of the Vice Chancellor to the allegations. Protests began on 10 September. On 16 September students gheraoed several officials in their offices, demanding that the Vice Chancellor make a statement on the status of a fair probe. Police were summoned, and later that night the police allegedly attacked and beat the student demonstrators. 30 to 40 students were injured; some had to be hospitalized. Reaction was nationwide, with supportive protests at multiple other cities including New Delhi, Hyderabad and Bangalore. On 20 September, Governor Keshari Nath Tripathi, who is also the chancellor of the university, met with student representatives and promised to conduct an impartial inquiry. However, students said they will continue to boycott classes until the Vice Chancellor resigns.\n\nOn 26 September, a State Government inquiry panel submitted its report, confirming that the female student had indeed been sexually abused on 28 August 2014. On 26 September, police summoned two Jadavpur University students to come to the Lalbazar Police HQ for questioning at 4 pm on Friday. They were arrested at 6 pm. \"The arrests were made after evidence was found, prima facie, against the duo. Further investigation is on,\" said joint CP-crime Pallab Kanti Ghosh. Mr Ghosh also stated, \"(Two names) were arrested because we had enough evidence to prove that they were present at the spot and had carried out the crime as alleged in the victim's complaint.\" The duo were booked under Sections of 354 (assault or use of criminal force on a woman with the intent to outrage her modesty), 342 (wrongful confinement), 323 (voluntarily causing hurt) and 114 (abettor present when offence is committed) of the IPC. Jadavpur University. http://en.wikipedia.org/?curid=16542."
  }
}
