{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11551",
  "eid" : "fc6a3cf0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778503231,
  "textBody" : "Francis II (; 12 February 1768 – 2 March 1835) was the last Holy Roman Emperor, ruling from 1792 until 6 August 1806, when he dissolved the Holy Roman Empire of the German Nation after the decisive defeat at the hands of the First French Empire led by Napoleon at the Battle of Austerlitz. In 1804, he had founded the Austrian Empire and became Francis I, the first Emperor of Austria, ruling from 1804 to 1835, so later he was named the one and only Doppelkaiser (double emperor) in history.\nFor the two years between 1804 and 1806, Francis used the title and style by the Grace of God elected Roman Emperor, ever Augustus, hereditary Emperor of Austria and he was called the Emperor of both the Holy Roman Empire and Austria. He was also Apostolic King of Hungary and Bohemia as Francis I. He also served as the first president of the German Confederation following its establishment in 1815.\n\nFrancis II continued his leading role as an opponent of Napoleonic France in the Napoleonic Wars, and suffered several more defeats after Austerlitz. The proxy marriage of state of his daughter Marie Louise of Austria to Napoleon on 10 March 1810 was arguably his most severe personal defeat. After the abdication of Napoleon following the War of the Sixth Coalition, Austria participated as a leading member of the Holy Alliance at the Congress of Vienna, which was largely dominated by Francis's chancellor Klemens Wenzel, Prince von Metternich culminating in a new European map and the restoration of Francis' ancient dominions (except the Holy Roman Empire which was dissolved). Due to the establishment of the Concert of Europe, which largely resisted popular nationalist and liberal tendencies, Francis became viewed as a reactionary later in his reign.\n\nEarly life \n\nFrancis was a son of Emperor Leopold II (1747–1792) and his wife Maria Luisa of Spain (1745–1792), daughter of Charles III of Spain. Francis was born in Florence, the capital of Tuscany, where his father reigned as Grand Duke from 1765–90.  Though he had a happy childhood surrounded by his many siblings, his family knew Francis was likely to be a future Emperor (his uncle Joseph had no surviving issue from either of his two marriages), and so in 1784 the young Archduke was sent to the Imperial Court in Vienna to educate and prepare him for his future role.\n\nEmperor Joseph II himself took charge of Francis's development.  His disciplinarian regime was a stark contrast to the indulgent Florentine Court of Leopold.  The Emperor wrote that Francis was \"stunted in growth\", \"backward in bodily dexterity and deportment\", and \"neither more nor less than a spoiled mother's child\".  Joseph concluded that \"the manner in which he was treated for upwards of sixteen years could not but have confirmed him in the delusion that the preservation of his own person was the only thing of importance\".\n\nJoseph's martinet method of improving the young Francis were \"fear and unpleasantness\".  The young Archduke was isolated, the reasoning being that this would make him more self-sufficient as it was felt by Joseph that Francis \"failed to lead himself, to do his own thinking\".  Nonetheless, Francis greatly admired his uncle, if rather feared him. To complete his training, Francis was sent to join an army regiment in Hungary and he settled easily into the routine of military life.\n\nAfter the death of Joseph II in 1790, Francis's father became Emperor. He had an early taste of power while acting as Leopold's deputy in Vienna while the incoming Emperor traversed the Empire attempting to win back those alienated by his brother's policies. The strain told on Leopold and by the winter of 1791, he became ill.  He gradually worsened throughout early 1792; on the afternoon of 1 March Leopold died, at the relatively young age of 44. Francis, just past his 24th birthday, was now Emperor, much sooner than he had expected.\n\nEmperor \n\nAs the leader of the large multi-ethnic Habsburg Empire, Francis felt threatened by Napoleon's social and political reforms, which were being exported throughout Europe with the expansion of the first French Empire. Francis had a fraught relationship with France. His aunt Marie Antoinette, the wife of Louis XVI and Queen consort of France, had been guillotined by the revolutionaries at the beginning of his reign.  Francis, on the whole, was indifferent to her fate (she was not close to his father, Leopold, and although Francis had met her, he had been too young at the time to have any memory of his aunt). Georges Danton attempted to negotiate with the Emperor for Marie Antoinette's release, but Francis was unwilling to make any concessions in return.\n\nLater, he led Austria into the French Revolutionary Wars. He briefly commanded the Allied forces during the Flanders Campaign of 1794 before handing over command to his brother Archduke Charles. He was later defeated by Napoleon. By the Treaty of Campo Formio, he ceded the left bank of the Rhine to France in exchange for Venice and Dalmatia. He again fought against France during the Second and Third Coalition, when after meeting a crushing defeat at Austerlitz, he had to agree to the Treaty of Pressburg, weakening the Austrian Empire and reorganizing Germany under a Napoleonic imprint that would be called the Confederation of the Rhine. \n\nAt this point, he believed his position as Holy Roman Emperor to be untenable, so on 6 August 1806, he abdicated the throne, declaring the empire to be already dissolved in the same declaration. This was a political move to impair the legitimacy of the Confederation of the Rhine. He had anticipated losing the Holy Roman crown, however. Two years earlier, as a reaction to Napoleon making himself an emperor, he had raised Austria to the status of an empire.  Hence, after 1806, he reigned as Francis I, Emperor of Austria.\n\nIn 1809, Francis attacked France again, hoping to take advantage of the Peninsular War embroiling Napoleon in Spain. He was again defeated, and this time forced to ally himself with Napoleon, ceding territory to the Empire, joining the Continental System, and wedding his daughter Marie-Louise to the Emperor. The Napoleonic wars drastically weakened Austria and threatened its preeminence among the states of Germany, a position that it would eventually cede to the Kingdom of Prussia.\n\nIn 1813, for the fourth and final time, Austria turned against France and joined Great Britain, Russia, Prussia and Sweden in their war against Napoleon. Austria played a major role in the final defeat of France—in recognition of this, Francis, represented by Clemens von Metternich, presided over the Congress of Vienna, helping to form the Concert of Europe and the Holy Alliance, ushering in an era of conservatism in Europe. The German Confederation, a loose association of Central European states was created by the Congress of Vienna in 1815 to organize the surviving states of the Holy Roman Empire.  The Congress was a personal triumph for Francis, who hosted the assorted dignitaries in comfort, though Francis undermined his allies Tsar Alexander and Frederick William III of Prussia by negotiating a secret treaty with the restored French king Louis XVIII.\n\nDomestic policy \n\nThe violent events of the French Revolution impressed themselves deeply into the mind of Francis (as well as all other European monarchs), and he came to distrust radicalism in any form.  In 1794, a \"Jacobin\" conspiracy was discovered in the Austrian and Hungarian armies.  The leaders were put on trial, but the verdicts only skirted the perimeter of the conspiracy.  Francis's brother Alexander Leopold (at that time Palatine of Hungary) wrote to the Emperor admitting \"Although we have caught a lot of the culprits, we have not really got to the bottom of this business yet.\"  Nonetheless, two officers heavily implicated in the conspiracy were hanged and gibbeted, while numerous others were sentenced to imprisonment (many of whom died from the conditions).\n\nFrancis was from his experiences suspicious and set up an extensive network of police spies and censors to monitor dissent (in this he was following his father's lead, as the Grand Duchy of Tuscany had the most effective secret police in Europe).  Even his family did not escape attention.  His brothers, the Archdukes Charles and Johann had their meetings and activities spied upon.  Censorship was also prevalent.  The author Franz Grillparzer, a Habsburg patriot, had one play suppressed solely as a \"precautionary\" measure.  When Grillparzer met the censor responsible, he asked him what was objectionable about the work.  The censor replied, \"Oh, nothing at all.  But I thought to myself, 'One can never tell'.\"\n\nIn military affairs Francis had allowed his brother, the Archduke Charles, extensive control over the army during the Napoleonic wars.  Yet, distrustful of allowing any individual too much power, he otherwise maintained the separation of command functions between the Hofkriegsrat and his field commanders. In the later years of his reign he limited military spending, requiring it not exceed forty million florins per year; because of inflation this resulted in inadequate funding, with the army's share of the budget shrinking from half in 1817 to only twenty-three percent in 1830.\n\nFrancis presented himself as an open and approachable monarch (he regularly set aside two mornings each week to meet his imperial subjects, regardless of status, by appointment in his office, even speaking to them in their own language), but his will was sovereign.  In 1804, he had no compunction about announcing that through his authority as Holy Roman Emperor, he declared he was now Emperor of Austria (at the time a geographical term that had little resonance).  Two years later, Francis personally wound up the moribund Holy Roman Empire of the German Nation.  Both actions were of dubious constitutional legality.\n\nLater years \n\nOn 2 March 1835, 43 years and a day after his father's death, Francis died in Vienna of a sudden fever aged 67, in the presence of many of his family and with all the religious comforts.  His funeral was magnificent, with his Viennese subjects respectfully filing past his coffin in the chapel of Hofburg Palace for three days.  Francis was interred in the traditional resting place of Habsburg monarchs, the Kapuziner Imperial Crypt in Vienna's Neue Markt Square. He is buried in tomb number 57, surrounded by his four wives.\n\nFrancis left a main point in the political testament he left for his son and heir Ferdinand to, \"Preserve unity in the family and regard it as one of the highest goods.\" In many portraits (particularly those painted by Peter Fendi) he was portrayed as the patriarch of a loving family, surrounded by his children and grandchildren.\n\nAfter 1806 he used the titles: \"We, Francis the First, by the grace of God Emperor of Austria; King of Jerusalem, Hungary, Bohemia, Dalmatia, Croatia, Slavonia, Galicia and Lodomeria; Archduke of Austria; Duke of Lorraine, Salzburg, Würzburg, Franconia, Styria, Carinthia and Carniola; Grand Duke of Cracow; Grand Prince of Transylvania; Margrave of Moravia; Duke of Sandomir, Masovia, Lublin, Upper and Lower Silesia, Auschwitz and Zator, Teschen and Friule; Prince of Berchtesgaden and Mergentheim; Princely Count of Habsburg, Gorizia and Gradisca and of the Tirol; and Margrave of Upper and Lower Lusatia and in Istria\".\n\nHeraldry \n\nAncestors \n\nMarriages \n\nFrancis II married four times:\n\n# On 6 January 1788, to Elisabeth of Württemberg (21 April 1767 – 18 February 1790).\n# On 15 September 1790, to his double first cousin Maria Teresa of the Two Sicilies (6 June 1772 – 13 April 1807), daughter of King Ferdinand I of the Two Sicilies (both were grandchildren of Empress Maria Theresa and shared all of their other grandparents in common), with whom he had twelve children, of whom only seven reached adulthood.\n# On 6 January 1808, he married again to another first cousin, Maria Ludovika of Austria-Este (14 December 1787 – 7 April 1816) with no issue. She was the daughter of Archduke Ferdinand of Austria-Este and Maria Beatrice d'Este, Princess of Modena.\n# On 29 October 1816, to Karoline Charlotte Auguste of Bavaria (8 February 1792 – 9 February 1873) with no issue. She was daughter of Maximilian I Joseph of Bavaria and had been previously married to William I of Württemberg.\n\nChildren \n\nFrom his first wife Elisabeth of Württemberg, one daughter, and his second wife Maria Teresa of the Two Sicilies, eight daughters and four sons:\nChildren of Francis II",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Francis II, Holy Roman Emperor" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11551" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Francis II (; 12 February 1768 – 2 March 1835) was the last Holy Roman Emperor, ruling from 1792 until 6 August 1806, when he dissolved the Holy Roman Empire of the German Nation after the decisive defeat at the hands of the First French Empire led by Napoleon at the Battle of Austerlitz. In 1804, he had founded the Austrian Empire and became Francis I, the first Emperor of Austria, ruling from 1804 to 1835, so later he was named the one and only Doppelkaiser (double emperor) in history.\nFor the two years between 1804 and 1806, Francis used the title and style by the Grace of God elected Roman Emperor, ever Augustus, hereditary Emperor of Austria and he was called the Emperor of both the Holy Roman Empire and Austria. He was also Apostolic King of Hungary and Bohemia as Francis I. He also served as the first president of the German Confederation following its establishment in 1815.\n\nFrancis II continued his leading role as an opponent of Napoleonic France in the Napoleonic Wars, and suffered several more defeats after Austerlitz. The proxy marriage of state of his daughter Marie Louise of Austria to Napoleon on 10 March 1810 was arguably his most severe personal defeat. After the abdication of Napoleon following the War of the Sixth Coalition, Austria participated as a leading member of the Holy Alliance at the Congress of Vienna, which was largely dominated by Francis's chancellor Klemens Wenzel, Prince von Metternich culminating in a new European map and the restoration of Francis' ancient dominions (except the Holy Roman Empire which was dissolved). Due to the establishment of the Concert of Europe, which largely resisted popular nationalist and liberal tendencies, Francis became viewed as a reactionary later in his reign.\n\nEarly life \n\nFrancis was a son of Emperor Leopold II (1747–1792) and his wife Maria Luisa of Spain (1745–1792), daughter of Charles III of Spain. Francis was born in Florence, the capital of Tuscany, where his father reigned as Grand Duke from 1765–90.  Though he had a happy childhood surrounded by his many siblings, his family knew Francis was likely to be a future Emperor (his uncle Joseph had no surviving issue from either of his two marriages), and so in 1784 the young Archduke was sent to the Imperial Court in Vienna to educate and prepare him for his future role.\n\nEmperor Joseph II himself took charge of Francis's development.  His disciplinarian regime was a stark contrast to the indulgent Florentine Court of Leopold.  The Emperor wrote that Francis was \"stunted in growth\", \"backward in bodily dexterity and deportment\", and \"neither more nor less than a spoiled mother's child\".  Joseph concluded that \"the manner in which he was treated for upwards of sixteen years could not but have confirmed him in the delusion that the preservation of his own person was the only thing of importance\".\n\nJoseph's martinet method of improving the young Francis were \"fear and unpleasantness\".  The young Archduke was isolated, the reasoning being that this would make him more self-sufficient as it was felt by Joseph that Francis \"failed to lead himself, to do his own thinking\".  Nonetheless, Francis greatly admired his uncle, if rather feared him. To complete his training, Francis was sent to join an army regiment in Hungary and he settled easily into the routine of military life.\n\nAfter the death of Joseph II in 1790, Francis's father became Emperor. He had an early taste of power while acting as Leopold's deputy in Vienna while the incoming Emperor traversed the Empire attempting to win back those alienated by his brother's policies. The strain told on Leopold and by the winter of 1791, he became ill.  He gradually worsened throughout early 1792; on the afternoon of 1 March Leopold died, at the relatively young age of 44. Francis, just past his 24th birthday, was now Emperor, much sooner than he had expected.\n\nEmperor \n\nAs the leader of the large multi-ethnic Habsburg Empire, Francis felt threatened by Napoleon's social and political reforms, which were being exported throughout Europe with the expansion of the first French Empire. Francis had a fraught relationship with France. His aunt Marie Antoinette, the wife of Louis XVI and Queen consort of France, had been guillotined by the revolutionaries at the beginning of his reign.  Francis, on the whole, was indifferent to her fate (she was not close to his father, Leopold, and although Francis had met her, he had been too young at the time to have any memory of his aunt). Georges Danton attempted to negotiate with the Emperor for Marie Antoinette's release, but Francis was unwilling to make any concessions in return.\n\nLater, he led Austria into the French Revolutionary Wars. He briefly commanded the Allied forces during the Flanders Campaign of 1794 before handing over command to his brother Archduke Charles. He was later defeated by Napoleon. By the Treaty of Campo Formio, he ceded the left bank of the Rhine to France in exchange for Venice and Dalmatia. He again fought against France during the Second and Third Coalition, when after meeting a crushing defeat at Austerlitz, he had to agree to the Treaty of Pressburg, weakening the Austrian Empire and reorganizing Germany under a Napoleonic imprint that would be called the Confederation of the Rhine. \n\nAt this point, he believed his position as Holy Roman Emperor to be untenable, so on 6 August 1806, he abdicated the throne, declaring the empire to be already dissolved in the same declaration. This was a political move to impair the legitimacy of the Confederation of the Rhine. He had anticipated losing the Holy Roman crown, however. Two years earlier, as a reaction to Napoleon making himself an emperor, he had raised Austria to the status of an empire.  Hence, after 1806, he reigned as Francis I, Emperor of Austria.\n\nIn 1809, Francis attacked France again, hoping to take advantage of the Peninsular War embroiling Napoleon in Spain. He was again defeated, and this time forced to ally himself with Napoleon, ceding territory to the Empire, joining the Continental System, and wedding his daughter Marie-Louise to the Emperor. The Napoleonic wars drastically weakened Austria and threatened its preeminence among the states of Germany, a position that it would eventually cede to the Kingdom of Prussia.\n\nIn 1813, for the fourth and final time, Austria turned against France and joined Great Britain, Russia, Prussia and Sweden in their war against Napoleon. Austria played a major role in the final defeat of France—in recognition of this, Francis, represented by Clemens von Metternich, presided over the Congress of Vienna, helping to form the Concert of Europe and the Holy Alliance, ushering in an era of conservatism in Europe. The German Confederation, a loose association of Central European states was created by the Congress of Vienna in 1815 to organize the surviving states of the Holy Roman Empire.  The Congress was a personal triumph for Francis, who hosted the assorted dignitaries in comfort, though Francis undermined his allies Tsar Alexander and Frederick William III of Prussia by negotiating a secret treaty with the restored French king Louis XVIII.\n\nDomestic policy \n\nThe violent events of the French Revolution impressed themselves deeply into the mind of Francis (as well as all other European monarchs), and he came to distrust radicalism in any form.  In 1794, a \"Jacobin\" conspiracy was discovered in the Austrian and Hungarian armies.  The leaders were put on trial, but the verdicts only skirted the perimeter of the conspiracy.  Francis's brother Alexander Leopold (at that time Palatine of Hungary) wrote to the Emperor admitting \"Although we have caught a lot of the culprits, we have not really got to the bottom of this business yet.\"  Nonetheless, two officers heavily implicated in the conspiracy were hanged and gibbeted, while numerous others were sentenced to imprisonment (many of whom died from the conditions).\n\nFrancis was from his experiences suspicious and set up an extensive network of police spies and censors to monitor dissent (in this he was following his father's lead, as the Grand Duchy of Tuscany had the most effective secret police in Europe).  Even his family did not escape attention.  His brothers, the Archdukes Charles and Johann had their meetings and activities spied upon.  Censorship was also prevalent.  The author Franz Grillparzer, a Habsburg patriot, had one play suppressed solely as a \"precautionary\" measure.  When Grillparzer met the censor responsible, he asked him what was objectionable about the work.  The censor replied, \"Oh, nothing at all.  But I thought to myself, 'One can never tell'.\"\n\nIn military affairs Francis had allowed his brother, the Archduke Charles, extensive control over the army during the Napoleonic wars.  Yet, distrustful of allowing any individual too much power, he otherwise maintained the separation of command functions between the Hofkriegsrat and his field commanders. In the later years of his reign he limited military spending, requiring it not exceed forty million florins per year; because of inflation this resulted in inadequate funding, with the army's share of the budget shrinking from half in 1817 to only twenty-three percent in 1830.\n\nFrancis presented himself as an open and approachable monarch (he regularly set aside two mornings each week to meet his imperial subjects, regardless of status, by appointment in his office, even speaking to them in their own language), but his will was sovereign.  In 1804, he had no compunction about announcing that through his authority as Holy Roman Emperor, he declared he was now Emperor of Austria (at the time a geographical term that had little resonance).  Two years later, Francis personally wound up the moribund Holy Roman Empire of the German Nation.  Both actions were of dubious constitutional legality.\n\nLater years \n\nOn 2 March 1835, 43 years and a day after his father's death, Francis died in Vienna of a sudden fever aged 67, in the presence of many of his family and with all the religious comforts.  His funeral was magnificent, with his Viennese subjects respectfully filing past his coffin in the chapel of Hofburg Palace for three days.  Francis was interred in the traditional resting place of Habsburg monarchs, the Kapuziner Imperial Crypt in Vienna's Neue Markt Square. He is buried in tomb number 57, surrounded by his four wives.\n\nFrancis left a main point in the political testament he left for his son and heir Ferdinand to, \"Preserve unity in the family and regard it as one of the highest goods.\" In many portraits (particularly those painted by Peter Fendi) he was portrayed as the patriarch of a loving family, surrounded by his children and grandchildren.\n\nAfter 1806 he used the titles: \"We, Francis the First, by the grace of God Emperor of Austria; King of Jerusalem, Hungary, Bohemia, Dalmatia, Croatia, Slavonia, Galicia and Lodomeria; Archduke of Austria; Duke of Lorraine, Salzburg, Würzburg, Franconia, Styria, Carinthia and Carniola; Grand Duke of Cracow; Grand Prince of Transylvania; Margrave of Moravia; Duke of Sandomir, Masovia, Lublin, Upper and Lower Silesia, Auschwitz and Zator, Teschen and Friule; Prince of Berchtesgaden and Mergentheim; Princely Count of Habsburg, Gorizia and Gradisca and of the Tirol; and Margrave of Upper and Lower Lusatia and in Istria\".\n\nHeraldry \n\nAncestors \n\nMarriages \n\nFrancis II married four times:\n\n# On 6 January 1788, to Elisabeth of Württemberg (21 April 1767 – 18 February 1790).\n# On 15 September 1790, to his double first cousin Maria Teresa of the Two Sicilies (6 June 1772 – 13 April 1807), daughter of King Ferdinand I of the Two Sicilies (both were grandchildren of Empress Maria Theresa and shared all of their other grandparents in common), with whom he had twelve children, of whom only seven reached adulthood.\n# On 6 January 1808, he married again to another first cousin, Maria Ludovika of Austria-Este (14 December 1787 – 7 April 1816) with no issue. She was the daughter of Archduke Ferdinand of Austria-Este and Maria Beatrice d'Este, Princess of Modena.\n# On 29 October 1816, to Karoline Charlotte Auguste of Bavaria (8 February 1792 – 9 February 1873) with no issue. She was daughter of Maximilian I Joseph of Bavaria and had been previously married to William I of Württemberg.\n\nChildren \n\nFrom his first wife Elisabeth of Württemberg, one daughter, and his second wife Maria Teresa of the Two Sicilies, eight daughters and four sons:\nChildren of Francis II. Francis II, Holy Roman Emperor. http://en.wikipedia.org/?curid=11551."
  }
}
