{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5826",
  "eid" : "d814c910-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778442273,
  "textBody" : "A complex number is a number that can be expressed in the form , where  and  are real numbers, and  is a solution of the equation , which is called an imaginary number because there is no real number that satisfies this equation.  For the complex number ,  is called the ', and  is called the '.  Despite the historical nomenclature \"imaginary\", complex numbers are regarded in the mathematical sciences as just as \"real\" as the real numbers, and are fundamental in many aspects of the scientific description of the natural world.An extensive account of the history, from initial skepticism to ultimate acceptance, can be found in . [https://books.google.com/books?idVWTNCwAAQBAJ&pg\nPA73 Extract of page 73]: \"complex numbers, as much as reals, and perhaps even more, find a unity with nature that is truly remarkable. It is as though Nature herself is as impressed by the scope and consistency of the complex-number system as we are ourselves, and has entrusted to these numbers the precise operations of her world at its minutest scales.\"\n\nThe complex number system can be defined as the algebraic extension of the ordinary real numbers by an imaginary number .  This means that complex numbers can be added, subtracted, and multiplied, as polynomials in the variable , with the rule  imposed.  Furthermore, complex numbers can also be divided by nonzero complex numbers. Overall, the complex number system is a field.\n\nMost importantly the complex numbers give rise to the fundamental theorem of algebra: every non-constant polynomial equation with complex coefficients has a complex solution.  This property is true of the complex numbers, but not the reals.  The 16th century Italian mathematician Gerolamo Cardano is credited with introducing complex numbers in his attempts to find solutions to cubic equations.\n\nGeometrically, complex numbers extend the concept of the one-dimensional number line to the two-dimensional complex plane by using the horizontal axis for the real part and the vertical axis for the imaginary part. The complex number  can be identified with the point  in the complex plane. A complex number whose real part is zero is said to be purely imaginary; the points for these numbers lie on the vertical axis of the complex plane.  A complex number whose imaginary part is zero can be viewed as a real number; its point lies on the horizontal axis of the complex plane.  Complex numbers can also be represented in polar form, which associates each complex number with its distance from the origin (its magnitude) and with a particular angle known as the argument of this complex number.\n\nOverview\n\nComplex numbers allow solutions to certain equations that have no solutions in real numbers. For example, the equation\n(x+1)^2 = -9 \\,\nhas no real solution, since the square of a real number cannot be negative. Complex numbers provide a solution to this problem. The idea is to extend the real numbers with an indeterminate  (sometimes called the imaginary unit) that is taken to satisfy the relation , so that solutions to equations like the preceding one can be found. In this case the solutions are  and , as can be verified using the fact that :\n\n((-1+3i)+1)^2 (3i)^2 \n (3^2)(i^2) 9(-1) \n -9,\n((-1-3i)+1)^2 (-3i)^2 \n (-3)^2(i^2) 9(-1) \n -9.\n\nAccording to the fundamental theorem of algebra, all polynomial equations with real or complex coefficients in a single variable have a solution in complex numbers.\n\nDefinition\n\nA complex number is a number of the form , where  and  are real numbers and  is an indeterminate satisfying . For example,  is a complex number.\n\nA complex number may therefore be defined as a polynomial in the single indeterminate , with the relation  imposed.  From this definition, complex numbers can be added or multiplied, using the addition and multiplication for polynomials.  Formally, the set of complex numbers is the quotient ring of the polynomial ring in the indeterminate , by the ideal generated by the polynomial  (see below).  The set of all complex numbers is denoted by , \\mathbf{C} or \\mathbb{C}.\n\nThe real number  is called the real part of the complex number ; the real number  is called the imaginary part of . By this convention, the imaginary part does not include a factor of : hence , not , is the imaginary part.Complex Variables (2nd Edition), M.R. Spiegel, S. Lipschutz, J.J. Schiller, D. Spellman, Schaum's Outline Series, Mc Graw Hill (USA),  The real part of a complex number  is denoted by  or ; the imaginary part of a complex number  is denoted by  or . For example,\n\\begin{align}\n  \\operatorname{Re}(2 + 3i) &= 2 \\\\\n  \\operatorname{Im}(2 + 3i) &= 3.\n\\end{align}\n\nA real number  can be regarded as a complex number  whose imaginary part is 0. A purely imaginary number  is a complex number  whose real part is zero. It is common to write  for  and  for . Moreover, when the imaginary part is negative, it is common to write  with  instead of , for example  instead of .\n\nCartesian form and definition via ordered pairs\n\nA complex number can thus be identified with an ordered pair  in the Cartesian plane, an identification sometimes known as the Cartesian form of .  In fact, a complex number can be defined as an ordered pair , but then rules for addition and multiplication must also be included as part of the definition (see below).  William Rowan Hamilton introduced this approach to define the complex number system.\n\nComplex plane\n\nA complex number can be viewed as a point or position vector in a two-dimensional Cartesian coordinate system called the complex plane or Argand diagram (see  and ), named after Jean-Robert Argand. The numbers are conventionally plotted using the real part as the horizontal component, and imaginary part as vertical (see Figure 1). These two values used to identify a given complex number are therefore called its Cartesian, rectangular, or algebraic form.\n\nA position vector may also be defined in terms of its magnitude and direction relative to the origin. These are emphasized in a complex number's polar form. Using the polar form of the complex number in calculations may lead to a more intuitive interpretation of mathematical results. Notably, the operations of addition and multiplication take on a very natural geometric character when complex numbers are viewed as position vectors: addition corresponds to vector addition while multiplication corresponds to multiplying their magnitudes and adding their arguments (i.e. the angles they make with the x axis). Viewed in this way the multiplication of a complex number by  corresponds to rotating the position vector counterclockwise by a quarter turn (90°) about the origin:  2 \n .\n\nHistory in brief\n\nMain section: History\n\nThe solution in radicals (without trigonometric functions) of a general cubic equation contains the square roots of negative numbers when all three roots are real numbers, a situation that cannot be rectified by factoring aided by the rational root test if the cubic is irreducible (the so-called casus irreducibilis). This conundrum led Italian mathematician Gerolamo Cardano to conceive of complex numbers in around 1545, though his understanding was rudimentary.\n\nWork on the problem of general polynomials ultimately led to the fundamental theorem of algebra, which shows that with complex numbers, a solution exists to every polynomial equation of degree one or higher. Complex numbers thus form an algebraically closed field, where any polynomial equation has a root.\n\nMany mathematicians contributed to the full development of complex numbers. The rules for addition, subtraction, multiplication, and division of complex numbers were developed by the Italian mathematician Rafael Bombelli. A more abstract formalism for the complex numbers was further developed by the Irish mathematician William Rowan Hamilton, who extended this abstraction to the theory of quaternions.\n\nNotation\n\nBecause it is a polynomial in the indeterminate ,  may be written instead of , which is often expedient when  is a radical.For example . In some disciplines, in particular electromagnetism and electrical engineering,  is used instead of , since  is frequently used for electric current. In these cases complex numbers are written as  or .\n\nEquality and order relations\n\nTwo complex numbers are equal if and only if both their real and imaginary parts are equal. That is, complex numbers z_1 and z_2 are equal if and only if \n\\operatorname{Re}(z_{1}) \\operatorname{Re}(z_{2}) and \\operatorname{Im} (z_{1}) \n \\operatorname{Im} (z_{2}).  If the complex numbers are written in polar form, they are equal if and only if they have the same argument and the same magnitude.\n\nBecause complex numbers are naturally thought of as existing on a two-dimensional plane, there is no natural linear ordering on the set of complex numbers.  Furthermore, there is no linear ordering on the complex numbers that is compatible with addition and multiplication – the complex numbers cannot have the structure of an ordered field. This is because any square in an ordered field is at least , but .\n\nElementary operations\n\nConjugate\n\nThe complex conjugate of the complex number  is defined to be . It is denoted by either \\overline{z} or .For the former notation, see for instance .\n\nGeometrically, \\bar{z} is the \"reflection\" of  about the real axis. Conjugating twice gives the original complex number: \\bar{\\bar{z}}=z.\n\nThe real and imaginary parts of a complex number  can be extracted using the conjugate:\n\\operatorname{Re}(z) = \\dfrac{z+\\overline{z}}{2}, \\,\n\\operatorname{Im}(z) = \\dfrac{z-\\overline{z}}{2i}. \\,\nMoreover, a complex number is real if and only if it equals its own conjugate.\n\nConjugation distributes over the standard arithmetic operations:\n\\overline{z+w} = \\overline{z} + \\overline{w}, \\,\n\\overline{z-w} = \\overline{z} - \\overline{w}, \\,\n\\overline{z\\cdot w} = \\overline{z} \\cdot\\overline{w}, \\,\n\\overline{z/w} = \\overline{z}/\\overline{w}. \\,\n\nAddition and subtraction\n\nComplex numbers are added by separately adding the real and imaginary parts of the summands. That is to say:\n(a+bi) + (c+di) = (a+c) + (b+d)i.\\ \nSimilarly, subtraction is defined by\n(a+bi) - (c+di) = (a-c) + (b-d)i.\\ \nUsing the visualization of complex numbers in the complex plane, the addition has the following geometric interpretation: the sum of two complex numbers A and B, interpreted as points of the complex plane, is the point X obtained by building a parallelogram, three of whose vertices are O, A and B. Equivalently, X is the point such that the triangles with vertices O, A, B, and X, B, A, are congruent.\n\nMultiplication and division\n\nThe multiplication of two complex numbers is defined by the following formula:\n(a+bi) (c+di) = (ac-bd) + (bc+ad)i.\\ \nIn particular, the square of  is −1:\ni^2 i \\times i \n -1.\\ \n\nThe preceding definition of multiplication of general complex numbers follows naturally from this fundamental property of . Indeed, if  is treated as a number so that  means  times , the above multiplication rule is identical to the usual rule for multiplying two sums of two terms.\n(a+bi) (c+di) = ac + bci + adi + bidi (distributive property)\n:: = ac + bidi + bci + adi (commutative property of addition—the order of the summands can be changed)\n:: = ac + bdi^2 + (bc+ad)i (commutative and distributive properties)\n:: = (ac-bd) + (bc+ad)i (fundamental property of ).\n\nThe division of two complex numbers is defined in terms of complex multiplication, which is described above, and real division. When at least one of  and  is non-zero, we have\n\\frac{a + bi}{c + di} = \\left({ac + bd \\over c^2 + d^2}\\right) + \\left( {bc - ad \\over c^2 + d^2} \\right)i. \nDivision can be defined in this way because of the following observation:\n\\frac{a + bi}{c + di} \\frac{\\left(a + bi\\right) \\cdot \\left(c - di\\right)}{\\left (c + di\\right) \\cdot \\left (c - di\\right)} \n \\left({ac + bd \\over c^2 + d^2}\\right) + \\left( {bc - ad \\over c^2 + d^2} \\right)i. \nAs shown earlier,  is the complex conjugate of the denominator . At least one of the real part  and the imaginary part  of the denominator must be nonzero for division to be defined. This is called \"rationalization\" of the denominator (although the denominator in the final expression might be an irrational real number).\n\nReciprocal\n\nThe reciprocal of a nonzero complex number  is given by\n\\frac{1}{z}\\frac{\\bar{z}}{z \\bar{z}}\n\\frac{\\bar{z}}{x^2+y^2}=\\frac{x}{x^2+y^2} -\\frac{y}{x^2+y^2}i.\nThis formula can be used to compute the multiplicative inverse of a complex number if it is given in rectangular coordinates. Inversive geometry, a branch of geometry studying reflections more general than ones about a line, can also be expressed in terms of complex numbers. In the network analysis of electrical circuits, the complex conjugate is used in finding the equivalent impedance when the maximum power transfer theorem is used.\n\nSquare root\n\nThe square roots of  (with ) are  \\pm (\\gamma + \\delta i), where\n\n\\gamma = \\sqrt{\\frac{a + \\sqrt{a^2 + b^2}}{2}}\n\nand\n\n\\delta = \\sgn (b) \\sqrt{\\frac{-a + \\sqrt{a^2 + b^2}}{2}},\n\nwhere sgn is the signum function. This can be seen by squaring  \\pm (\\gamma + \\delta i) to obtain ., [http://www.math.sfu.ca/~cbm/aands/page_17.htm Section 3.7.26, p. 17]\n, [https://books.google.com/books?idlUcTsYopfhkC&pg\nPA59 Extract: page 59]\n Here \\sqrt{a^2 + b^2} is called the modulus of , and the square root sign indicates the square root with non-negative real part, called the principal square root; also \\sqrt{a^2 + b^2}\\sqrt{z\\bar{z}}, where  z \n a + bi .\n\nPolar form\n \n\nAbsolute value and argument\n\nAn alternative way of defining a point P in the complex plane, other than using the x- and y-coordinates, is to use the distance of the point from O, the point whose coordinates are  (the origin), together with the angle subtended between the positive real axis and the line segment OP in a counterclockwise direction. This idea leads to the polar form of complex numbers.\n\nThe absolute value (or modulus or magnitude) of a complex number  is.\n\\textstyle r|z|\n\\sqrt{x^2+y^2}.\\,\nIf  is a real number (that is, if ), then . That is, the absolute value of a real number equals its absolute value as a complex number.\n\nBy Pythagoras' theorem, the absolute value of complex number is the distance to the origin of the point representing the complex number in the complex plane.\n\nThe square of the absolute value is\n\\textstyle |z|^2z\\bar{z}\nx^2+y^2.\\,\nwhere \\bar{z} is the complex conjugate of z.\n\nThe argument of  (in many applications referred to as the \"phase\") is the angle of the radius OP with the positive real axis, and is written as \\arg(z). As with the modulus, the argument can be found from the rectangular form x+yi:\n\n\\varphi \\arg(z) \n\n\\begin{cases}\n\\arctan\\left(\\dfrac{y}{x}\\right) & \\text{if } x > 0 \\\\\n\\arctan\\left(\\dfrac{y}{x}\\right) + \\pi & \\text{if } x  0\\\\\n-\\dfrac{\\pi}{2} & \\text{if } x = 0 \\text{ and } y \n\nNormally, as given above, the principal value in the interval  is chosen. Values in the range  are obtained by adding  if the value is negative. The value of  is expressed in radians in this article. It can increase by any integer multiple of  and still give the same angle. Hence, the arg function is sometimes considered as multivalued.   The polar angle for the complex number 0 is indeterminate, but arbitrary choice of the angle 0 is common.\n\nThe value of  equals the result of atan2:\n\\varphi = \\operatorname{atan2}\\left(\\operatorname{Im}(z),\\operatorname{Re}(z) \\right).\n\nTogether,  and  give another way of representing complex numbers, the polar form, as the combination of modulus and argument fully specify the position of a point on the plane. Recovering the original rectangular co-ordinates from the polar form is done by the formula called trigonometric form\n z = r(\\cos \\varphi + i\\sin \\varphi ).\\,\n\nUsing Euler's formula this can be written as\nz = r e^{i \\varphi}.\\,\n\nUsing the cis function, this is sometimes abbreviated to\n z = r \\operatorname{cis} \\varphi. \\,\n\nIn angle notation, often used in electronics to represent a phasor with amplitude  and phase , it is written as\n\nz = r \\ang \\varphi . \\,\n\nMultiplication and division in polar form\n\nFormulas for multiplication, division and exponentiation are simpler in polar form than the corresponding formulas in Cartesian coordinates. Given two complex numbers  and , because of the well-known trigonometric identities \n \\cos(a)\\cos(b) - \\sin(a)\\sin(b) = \\cos(a + b)\n \\cos(a)\\sin(b) + \\sin(a)\\cos(b) = \\sin(a + b)\n\nwe may derive\n\nz_1 z_2 = r_1 r_2 (\\cos(\\varphi_1 + \\varphi_2) + i \\sin(\\varphi_1 + \\varphi_2)).\\,\nIn other words, the absolute values are multiplied and the arguments are added to yield the polar form of the product. For example, multiplying by  corresponds to a quarter-turn counter-clockwise, which gives back . The picture at the right illustrates the multiplication of\n(2+i)(3+i)=5+5i. \\,\nSince the real and imaginary part of  are equal, the argument of that number is 45 degrees, or π/4 (in radian). On the other hand, it is also the sum of the angles at the origin of the red and blue triangles are arctan(1/3) and arctan(1/2), respectively. Thus, the formula\n\\frac{\\pi}{4} = \\arctan\\frac{1}{2} + \\arctan\\frac{1}{3} \nholds. As the arctan function can be approximated highly efficiently, formulas like this—known as Machin-like formulas—are used for high-precision approximations of π.\n\nSimilarly, division is given by\n\\frac{z_1}{ z_2} = \\frac{r_1}{ r_2} \\left(\\cos(\\varphi_1 - \\varphi_2) + i \\sin(\\varphi_1 - \\varphi_2)\\right).\n\nExponentiation \n\nEuler's formula\n\nEuler's formula states that, for any real number ,\n\ne^{ix} = \\cos x + i\\sin x \\ ,\n\nwhere  is the base of the natural logarithm. This can be proved through induction by observing that\n\n\\begin{align}\ni^0 &{}= 1, \\quad &\ni^1 &{}= i, \\quad &\ni^2 &{}= -1, \\quad &\ni^3 &{}= -i, \\\\\ni^4 &={} 1, \\quad &\ni^5 &={} i, \\quad &\ni^6 &{}= -1, \\quad &\ni^7 &{}= -i,\n\\end{align}\n\nand so on, and by considering the Taylor series expansions of ,  and :\n\n\\begin{align}\n e^{ix} &{}= 1 + ix + \\frac{(ix)^2}{2!} + \\frac{(ix)^3}{3!} + \\frac{(ix)^4}{4!} + \\frac{(ix)^5}{5!} + \\frac{(ix)^6}{6!} + \\frac{(ix)^7}{7!} + \\frac{(ix)^8}{8!} + \\cdots \\\\[8pt]\n        &{}= 1 + ix - \\frac{x^2}{2!} - \\frac{ix^3}{3!} + \\frac{x^4}{4!} + \\frac{ix^5}{5!} -\\frac{x^6}{6!} - \\frac{ix^7}{7!} + \\frac{x^8}{8!} + \\cdots \\\\[8pt]\n        &{}= \\left( 1 - \\frac{x^2}{2!} + \\frac{x^4}{4!} - \\frac{x^6}{6!} + \\frac{x^8}{8!} - \\cdots \\right) + i\\left( x - \\frac{x^3}{3!} + \\frac{x^5}{5!} - \\frac{x^7}{7!} + \\cdots \\right) \\\\[8pt]\n        &{}= \\cos x + i\\sin x \\ .\n\\end{align}\n\nThe rearrangement of terms is justified because each series is absolutely convergent.\n\nNatural logarithm\n\nIt follows from Euler's formula that, for any complex number z written in polar form,\n\n z = r(\\cos \\varphi + i\\sin \\varphi )\n\nwhere r is a non-negative real number, one possible value for the complex logarithm of z is\n\n \\ln (z)= \\ln(r) + \\varphi i.\n\nBecause cosine and sine are periodic functions,  other possible values may be obtained. For example, e^{i\\pi} e^{3i\\pi} \n -1, \nso both i \\pi and 3i\\pi are two possible values for the natural logarithm of -1.\n\nTo deal with the existence of more the one possible value for a given input, the complex logarithm may be considered a multi-valued function, with\n\n \\ln(z) = \\left\\{ \\ln(r) + (\\varphi + 2\\pi k)i \\;|\\; k \\in \\mathbb{Z}\\right\\}.\n\nAlternatively, a branch cut can be used to define a single-valued \"branch\" of the complex logarithm.\n\nInteger and fractional exponents\n\nWe may use the identity\n\n \\ln(a^{b}) = b \\ln(a)\n\nto define complex exponentiation, which is likewise multi-valued:\n\n\\begin{align}\n\\ln (z^n) &= \\ln((r(\\cos \\varphi + i\\sin \\varphi ))^{n}) \\\\\n              &= n \\ln(r(\\cos \\varphi + i\\sin \\varphi)) \\\\\n              &= \\{ n (\\ln(r) + (\\varphi + k2\\pi) i) \\ | \\ k \\in \\mathbb{Z} \\} \\\\\n              &= \\{ n \\ln(r) + n \\varphi i + nk2\\pi i \\ | \\ k \\in \\mathbb{Z} \\}.\n\\end{align}\n\nWhen n is an integer, this simplifies to de Moivre's formula:\n\n z^{n}(r(\\cos \\varphi + i\\sin \\varphi ))^{n} \n r^n\\,(\\cos n\\varphi + i \\sin n \\varphi).\n\nThe th roots of  are given by\n\\sqrt[n]{z} = \\sqrt[n]r \\left( \\cos \\left(\\frac{\\varphi+2k\\pi}{n}\\right) + i \\sin \\left(\\frac{\\varphi+2k\\pi}{n}\\right)\\right)\nfor any integer  satisfying . Here  is the usual (positive) th root of the positive real number . While the th root of a positive real number  is chosen to be the positive real number  satisfying  there is no natural way of distinguishing one particular complex th root of a complex number. Therefore, the th root of  is considered as a multivalued function (in ), as opposed to a usual function , for which  is a uniquely defined number. Formulas such as\n\\sqrt[n]{z^n} = z\n(which holds for positive real numbers), do in general not hold for complex numbers.\n\nProperties\n\nField structure\n\nThe set C of complex numbers is a field. Briefly, this means that the following facts hold: first, any two complex numbers can be added and multiplied to yield another complex number. Second, for any complex number , its additive inverse  is also a complex number; and third, every nonzero complex number has a reciprocal complex number. Moreover, these operations satisfy a number of laws, for example the law of commutativity of addition and multiplication for any two complex numbers  and :\nz_1+ z_2 = z_2 + z_1,\nz_1 z_2 = z_2 z_1.\nThese two laws and the other requirements on a field can be proven by the formulas given above, using the fact that the real numbers themselves form a field.\n\nUnlike the reals, C is not an ordered field, that is to say, it is not possible to define a relation  that is compatible with the addition and multiplication. In fact, in any ordered field, the square of any element is necessarily positive, so  precludes the existence of an ordering on C.\n\nWhen the underlying field for a mathematical topic or construct is the field of complex numbers, the topic's name is usually modified to reflect that fact. For example: complex analysis, complex matrix, complex polynomial, and complex Lie algebra.\n\nSolutions of polynomial equations\n\nGiven any complex numbers (called coefficients) , the equation\na_n z^n + \\dotsb + a_1 z + a_0 = 0\nhas at least one complex solution z, provided that at least one of the higher coefficients  is nonzero.  This is the statement of the fundamental theorem of algebra, of Carl Friedrich Gauss and Jean le Rond d'Alembert. Because of this fact, C is called an algebraically closed field. This property does not hold for the field of rational numbers Q (the polynomial  does not have a rational root, since square root of 2| is not a rational number) nor the real numbers R (the polynomial  does not have a real root for , since the square of  is positive for any real number ).\n\nThere are various proofs of this theorem, either by analytic methods such as Liouville's theorem, or topological ones such as the winding number, or a proof combining Galois theory and the fact that any real polynomial of odd degree has at least one real root.\n\nBecause of this fact, theorems that hold for any algebraically closed field, apply to C. For example, any non-empty complex square matrix has at least one (complex) eigenvalue.\n\nAlgebraic characterization\n\nThe field C has the following three properties: first, it has characteristic 0. This means that  for any number of summands (all of which equal one). Second, its transcendence degree over Q, the prime field of C, is the cardinality of the continuum. Third, it is algebraically closed (see above). It can be shown that any field having these properties is isomorphic (as a field) to C. For example, the algebraic closure of Qp also satisfies these three properties, so these two fields are isomorphic (as fields, but not as topological fields). Also, C is isomorphic to the field of complex Puiseux series. However, specifying an isomorphism requires the axiom of choice. Another consequence of this algebraic characterization is that C contains many proper subfields that are isomorphic to C.\n\nCharacterization as a topological field\n\nThe preceding characterization of C describes only the algebraic aspects of C. That is to say, the properties of nearness and continuity, which matter in areas such as analysis and topology, are not dealt with. The following description of C as a topological field (that is, a field that is equipped with a topology, which allows the notion of convergence) does take into account the topological properties. C contains a subset  (namely the set of positive real numbers) of nonzero elements satisfying the following three conditions:\n*  is closed under addition, multiplication and taking inverses.\n* If  and  are distinct elements of , then either  or  is in .\n* If  is any nonempty subset of , then  for some  in C.\nMoreover, C has a nontrivial involutive automorphism  (namely the complex conjugation), such that  is in  for any nonzero  in C.\n\nAny field  with these properties can be endowed with a topology by taking the sets  as a base, where  ranges over the field and  ranges over . With this topology  is isomorphic as a topological field to C.\n\nThe only connected locally compact topological fields are R and C. This gives another characterization of C as a topological field, since C can be distinguished from R because the nonzero complex numbers are connected, while the nonzero real numbers are not.\n\nFormal construction\n\nConstruction as ordered pairs\n\nThe set  of complex numbers can be defined as the set  of ordered pairs  of real numbers, in which the following rules for addition and multiplication are imposed:\n\n\\begin{align}\n(a, b) + (c, d) &= (a + c, b + d)\\\\\n(a, b) \\cdot (c, d) &= (ac - bd, bc + ad).\n\\end{align}\n\nIt is then just a matter of notation to express  as .\n\nConstruction as a quotient field\n\nThough this low-level construction does accurately describe the structure of the complex numbers, the following equivalent definition reveals the algebraic nature of  more immediately. This characterization relies on the notion of fields and polynomials. A field is a set endowed with addition, subtraction, multiplication and division operations that behave as is familiar from, say, rational numbers. For example, the distributive law\n(x+y) z = xz + yz\nmust hold for any three elements ,  and  of a field. The set  of real numbers does form a field. A polynomial  with real coefficients is an expression of the form\na_nX^n+\\dotsb+a_1X+a_0,\nwhere the  are real numbers. The usual addition and multiplication of polynomials endows the set  of all such polynomials with a ring structure. This ring is called the polynomial ring over the real numbers.\n\nThe set of complex numbers is defined as the quotient ring .   This extension field contains two square roots of , namely (the cosets of)  and , respectively. (The cosets of)  and  form a basis of  as a real vector space, which means that each element of the extension field can be uniquely written as a linear combination in these two elements. Equivalently, elements of the extension field can be written as ordered pairs  of real numbers.  The quotient ring is a field, because the  is a prime ideal in , a principal ideal domain, and therefore is a maximal ideal.\n\nThe formulas for addition and multiplication in the ring , modulo the relation  correspond to the formulas for addition and multiplication of complex numbers defined as ordered pairs.  So the two definitions of the field  are isomorphic (as fields).\n\nAccepting that  is algebraically closed, since it is an algebraic extension of  in this approach,  is therefore the algebraic closure of .\n\nMatrix representation of complex numbers\n\nComplex numbers  can also be represented by  matrices that have the following form:\n\n\\begin{pmatrix}\n  a &   -b  \\\\\n  b & \\;\\; a\n\\end{pmatrix}\n\nHere the entries  and  are real numbers. The sum and product of two such matrices is again of this form, and the sum and product of complex numbers corresponds to the sum and product of such matrices, the product being:\n\n\\begin{pmatrix}\n  a &   -b  \\\\\n  b & \\;\\; a\n\\end{pmatrix}\n\\begin{pmatrix}\n  c &   -d  \\\\\n  d & \\;\\; c\n\\end{pmatrix}\n= \\begin{pmatrix}\n  ac-bd &   -ad-bc  \\\\\n  bc+ad & \\;\\; -bd+ac\n\\end{pmatrix}\n\nThe geometric description of the multiplication of complex numbers can also be expressed in terms of rotation matrices by using this correspondence between complex numbers and such matrices. Moreover, the square of the absolute value of a complex number expressed as a matrix is equal to the determinant of that matrix:\n |z|^2 =\n\\begin{vmatrix}\n  a & -b  \\\\\n  b &  a\n\\end{vmatrix}\n= a^2 + b^2.\n\nThe conjugate \\overline z corresponds to the transpose of the matrix.\n\nThough this representation of complex numbers with matrices is the most common, many other representations arise from matrices other than \\bigl(\\begin{smallmatrix}0 & -1 \\\\1 & 0 \\end{smallmatrix}\\bigr) that square to the negative of the identity matrix. See the article on 2 × 2 real matrices for other representations of complex numbers.\n\nComplex analysis\n\nThe study of functions of a complex variable is known as complex analysis and has enormous practical use in applied mathematics as well as in other branches of mathematics. Often, the most natural proofs for statements in real analysis or even number theory employ techniques from complex analysis (see prime number theorem for an example). Unlike real functions, which are commonly represented as two-dimensional graphs, complex functions have four-dimensional graphs and may usefully be illustrated by color-coding a three-dimensional graph to suggest four dimensions, or by animating the complex function's dynamic transformation of the complex plane.\n\nComplex exponential and related functions\n\nThe notions of convergent series and continuous functions in (real) analysis have natural analogs in complex analysis. A sequence  of complex numbers is said to converge if and only if its real and imaginary parts do. This is equivalent to the (ε, δ)-definition of limits, where the absolute value of real numbers is replaced by the one of complex numbers. From a more abstract point of view, C, endowed with the metric\n\\operatorname{d}(z_1, z_2) = |z_1 - z_2| \\,\nis a complete metric space, which notably includes the triangle inequality\n|z_1 + z_2| \\le |z_1| + |z_2|\nfor any two complex numbers  and .\n\nLike in real analysis, this notion of convergence is used to construct a number of elementary functions: the exponential function , also written , is defined as the infinite series\n\\exp(z):1+z+\\frac{z^2}{2\\cdot 1}+\\frac{z^3}{3\\cdot 2\\cdot 1}+\\cdots \n \\sum_{n=0}^{\\infty} \\frac{z^n}{n!}. \n\nThe series defining the real trigonometric functions sine and cosine, as well as the hyperbolic functions sinh and cosh, also carry over to complex arguments without change. For the other trigonometric and hyperbolic functions, such as tangent, things are slightly more complicated, as the defining series do not converge for all complex values. Therefore, one must define them either in terms of sine, cosine and exponential, or, equivalently, by using the method of analytic continuation.\n\nEuler's identity states:\n\\exp(i\\varphi) = \\cos(\\varphi) + i\\sin(\\varphi) \\,\nfor any real number φ, in particular\n\\exp(i \\pi) = -1 \\,\nUnlike in the situation of real numbers, there is an infinitude of complex solutions  of the equation\n\\exp(z) = w \\,\nfor any complex number . It can be shown that any such solution —called complex logarithm of —satisfies\n\\log(w)=\\ln|w| + i\\arg(w), \\,\nwhere arg is the argument defined above, and ln the (real) natural logarithm. As arg is a multivalued function, unique only up to a multiple of 2π, log is also multivalued. The principal value of log is often taken by restricting the imaginary part to the interval .\n\nComplex exponentiation  is defined as\nz^\\omega = \\exp(\\omega \\log z), \nand is multi-valued, except when \\omega is an integer. For , for some natural number , this recovers the non-uniqueness of th roots mentioned above.\n\nComplex numbers, unlike real numbers, do not in general satisfy the unmodified power and logarithm identities, particularly when naïvely treated as single-valued functions; see failure of power and logarithm identities. For example, they do not satisfy\na^{bc} = (a^b)^c.\nBoth sides of the equation are multivalued by the definition of complex exponentiation given here, and the values on the left are a subset of those on the right.\n\nHolomorphic functions\n\nA function f : C → C is called holomorphic if it satisfies the Cauchy–Riemann equations. For example, any R-linear map C → C can be written in the form\nf(z)=az+b\\overline{z}\nwith complex coefficients  and . This map is holomorphic if and only if . The second summand b \\overline z is real-differentiable, but does not satisfy the Cauchy–Riemann equations.\n\nComplex analysis shows some features not apparent in real analysis. For example, any two holomorphic functions  and  that agree on an arbitrarily small open subset of C necessarily agree everywhere. Meromorphic functions, functions that can locally be written as  with a holomorphic function , still share some of the features of holomorphic functions. Other functions have essential singularities, such as  at .\n\nApplications\n\nComplex numbers have essential concrete applications in a variety of scientific and related areas such as signal processing, control theory, electromagnetism, fluid dynamics, quantum mechanics, cartography, and vibration analysis. Some applications of complex numbers are:\n\nControl theory\n\nIn control theory, systems are often transformed from the time domain to the frequency domain using the Laplace transform. The system's zeros and poles are then analyzed in the complex plane. The root locus, Nyquist plot, and Nichols plot techniques all make use of the complex plane.\n\nIn the root locus method, it is important whether zeros and poles are in the left or right half planes, i.e. have real part greater than or less than zero. If a linear, time-invariant (LTI) system has poles that are\n*in the right half plane, it will be unstable,\n*all in the left half plane, it will be stable,\n*on the imaginary axis, it will have marginal stability.\nIf a system has zeros in the right half plane, it is a nonminimum phase system.\n\nImproper integrals\n\nIn applied fields, complex numbers are often used to compute certain real-valued improper integrals, by means of complex-valued functions. Several methods exist to do this; see methods of contour integration.\n\nFluid dynamics\n\nIn fluid dynamics, complex functions are used to describe potential flow in two dimensions.\n\nDynamic equations\n\nIn differential equations, it is common to first find all complex roots  of the characteristic equation of a linear differential equation or equation system and then attempt to solve the system in terms of base functions of the form . Likewise, in difference equations, the complex roots  of the characteristic equation of the difference equation system are used, to attempt to solve the system in terms of base functions of the form .\n\nElectromagnetism and electrical engineering\n\nIn electrical engineering, the Fourier transform is used to analyze varying voltages and currents. The treatment of resistors, capacitors, and inductors can then be unified by introducing imaginary, frequency-dependent resistances for the latter two and combining all three in a single complex number called the impedance. This approach is called phasor calculus.\n\nIn electrical engineering, the imaginary unit is denoted by , to avoid confusion with , which is generally in use to denote electric current, or, more particularly, , which is generally in use to denote instantaneous electric current.\n\nSince the voltage in an AC circuit is oscillating, it can be represented as\n\n V(t) V_0 e^{j \\omega t} \n V_0 \\left (\\cos \\omega t + j \\sin\\omega t \\right ),\n\nTo obtain the measurable quantity, the real part is taken:\n\n v(t) \\mathrm{Re}(V) \n \\mathrm{Re}\\left [ V_0 e^{j \\omega t} \\right ] = V_0 \\cos \\omega t.\n\nThe complex-valued signal V(t) is called the analytic representation of the real-valued, measurable signal v(t).\nElectromagnetism (2nd edition), I.S. Grant, W.R. Phillips, Manchester Physics Series, 2008 \n\nSignal analysis\n\nComplex numbers are used in signal analysis and other fields for a convenient description for periodically varying signals. For given real functions representing actual physical quantities, often in terms of sines and cosines, corresponding complex functions are considered of which the real parts are the original quantities. For a sine wave of a given frequency, the absolute value  of the corresponding  is the amplitude and the argument  is the phase.\n\nIf Fourier analysis is employed to write a given real-valued signal as a sum of periodic functions, these periodic functions are often written as complex valued functions of the form\nx(t) = \\operatorname{Re} \\{X( t ) \\} \\,\n\nand\n\nX( t ) A e^{i\\omega t} \n a e^{ i \\phi } e^{i\\omega t} = a e^{i (\\omega t + \\phi) } \\,\n\nwhere ω represents the angular frequency and the complex number A encodes the phase and amplitude as explained above.\n\nThis use is also extended into digital signal processing and digital image processing, which utilize digital versions of Fourier analysis (and wavelet analysis) to transmit, compress, restore, and otherwise process digital audio signals, still images, and video signals.\n\nAnother example, relevant to the two side bands of amplitude modulation of AM radio, is:\n\n\\begin{align}\n\\cos((\\omega+\\alpha)t)+\\cos\\left((\\omega-\\alpha)t\\right) & = \\operatorname{Re}\\left(e^{i(\\omega+\\alpha)t} + e^{i(\\omega-\\alpha)t}\\right) \\\\\n& = \\operatorname{Re}\\left((e^{i\\alpha t} + e^{-i\\alpha t})\\cdot e^{i\\omega t}\\right) \\\\\n& = \\operatorname{Re}\\left(2\\cos(\\alpha t) \\cdot e^{i\\omega t}\\right) \\\\\n& = 2 \\cos(\\alpha t) \\cdot \\operatorname{Re}\\left(e^{i\\omega t}\\right) \\\\\n& = 2 \\cos(\\alpha t)\\cdot \\cos\\left(\\omega t\\right)\\,.\n\\end{align}\n\nQuantum mechanics\n\nThe complex number field is intrinsic to the mathematical formulations of quantum mechanics, where complex Hilbert spaces provide the context for one such formulation that is convenient and perhaps most standard. The original foundation formulas of quantum mechanics—the Schrödinger equation and Heisenberg's matrix mechanics—make use of complex numbers.\n\nRelativity\n\nIn special and general relativity, some formulas for the metric on spacetime become simpler if one takes the time component of the spacetime continuum to be imaginary. (This approach is no longer standard in classical relativity, but is used in an essential way in quantum field theory.) Complex numbers are essential to spinors, which are a generalization of the tensors used in relativity.\n\nGeometry\n\nFractals\n\nCertain fractals are plotted in the complex plane, e.g. the Mandelbrot set and Julia sets.\n\nTriangles\n\nEvery triangle has a unique Steiner inellipse—an ellipse inside the triangle and tangent to the midpoints of the three sides of the triangle. The foci of a triangle's Steiner inellipse can be found as follows, according to Marden's theorem: Denote the triangle's vertices in the complex plane as , , and . Write the cubic equation \\scriptstyle (x-a)(x-b)(x-c)=0, take its derivative, and equate the (quadratic) derivative to zero. Marden's Theorem says that the solutions of this equation are the complex numbers denoting the locations of the two foci of the Steiner inellipse.\n\nAlgebraic number theory\n\nAs mentioned above, any nonconstant polynomial equation (in complex coefficients) has a solution in C. A fortiori, the same is true if the equation has rational coefficients. The roots of such equations are called algebraic numbers – they are a principal object of study in algebraic number theory. Compared to , the algebraic closure of Q, which also contains all algebraic numbers, C has the advantage of being easily understandable in geometric terms. In this way, algebraic methods can be used to study geometric questions and vice versa. With algebraic methods, more specifically applying the machinery of field theory to the number field containing roots of unity, it can be shown that it is not possible to construct a regular nonagon using only compass and straightedge – a purely geometric problem.\n\nAnother example are Gaussian integers, that is, numbers of the form , where  and  are integers, which can be used to classify sums of squares.\n\nAnalytic number theory\n\nAnalytic number theory studies numbers, often integers or rationals, by taking advantage of the fact that they can be regarded as complex numbers, in which analytic methods can be used. This is done by encoding number-theoretic information in complex-valued functions. For example, the Riemann zeta function  is related to the distribution of prime numbers.\n\nHistory\n\nThe earliest fleeting reference to square roots of negative numbers can perhaps be said to occur in the work of the Greek mathematician Hero of Alexandria in the 1st century AD, where in his Stereometrica he considers, apparently in error, the volume of an impossible frustum of a pyramid to arrive at the term \\scriptstyle \\sqrt{81 - 144} 3i\\sqrt{7} in his calculations, although negative quantities were not conceived of in Hellenistic mathematics and Heron merely replaced it by its positive (\\scriptstyle \\sqrt{144 - 81} \n 3\\sqrt{7}).\n\nThe impetus to study complex numbers proper first arose in the 16th century when algebraic solutions for the roots of cubic and quartic polynomials were discovered by Italian mathematicians (see Niccolò Fontana Tartaglia, Gerolamo Cardano). It was soon realized that these formulas, even if one was only interested in real solutions, sometimes required the manipulation of square roots of negative numbers. As an example, Tartaglia's formula for a cubic equation of the form \\scriptstyle x^3 px + qIn modern notation, Tartaglia's solution is based on expanding the cube of the sum of two cube roots: \\scriptstyle \\left(\\sqrt[3]{u} + \\sqrt[3]{v}\\right)^3 \n 3 \\sqrt[3]{uv} \\left(\\sqrt[3]{u} + \\sqrt[3]{v}\\right) + u + v With \\scriptstyle x \\sqrt[3]{u} + \\sqrt[3]{v}, \\scriptstyle p \n 3 \\sqrt[3]{uv}, \\scriptstyle q u + v,  and  can be expressed in terms of  and  as \\scriptstyle u \n q/2 + \\sqrt{(q/2)^2-(p/3)^3} and \\scriptstyle v q/2 - \\sqrt{(q/2)^2-(p/3)^3}, respectively. Therefore, \\scriptstyle x \n \\sqrt[3]{q/2 + \\sqrt{(q/2)^2-(p/3)^3}} + \\sqrt[3]{q/2 - \\sqrt{(q/2)^2-(p/3)^3}}. When \\scriptstyle (q/2)^2-(p/3)^3 is negative (casus irreducibilis), the second cube root should be regarded as the complex conjugate of the first one. gives the solution to the equation  as\n\n\\frac{1}{\\sqrt{3}}\\left((\\sqrt{-1})^{1/3}+\\frac{1}{(\\sqrt{-1})^{1/3}}\\right).\n\nAt first glance this looks like nonsense. However formal calculations with complex numbers show that the equation  has solutions , {\\scriptstyle\\frac{\\sqrt{3}}{2}}+{\\scriptstyle\\frac{1}{2}}i and {\\scriptstyle\\frac{-\\sqrt{3}}{2}}+{\\scriptstyle\\frac{1}{2}}i. Substituting these in turn for {\\scriptstyle\\sqrt{-1}^{1/3}} in Tartaglia's cubic formula and simplifying, one gets 0, 1 and −1 as the solutions of . Of course this particular equation can be solved at sight but it does illustrate that when general formulas are used to solve cubic equations with real roots then, as later mathematicians showed rigorously, the use of complex numbers is unavoidable. Rafael Bombelli was the first to explicitly address these seemingly paradoxical solutions of cubic equations and developed the rules for complex arithmetic trying to resolve these issues.\n\nThe term \"imaginary\" for these quantities was coined by René Descartes in 1637, although he was at pains to stress their imaginary nature\n\nA further source of confusion was that the equation \\scriptstyle \\sqrt{-1}^2\\sqrt{-1}\\sqrt{-1}\n-1 seemed to be capriciously inconsistent with the algebraic identity \\scriptstyle \\sqrt{a}\\sqrt{b}\\sqrt{ab}, which is valid for non-negative real numbers  and , and which was also used in complex number calculations with one of ,  positive and the other negative. The incorrect use of this identity (and the related identity \\scriptstyle \\frac{1}{\\sqrt{a}}\n\\sqrt{\\frac{1}{a}}) in the case when both  and  are negative even bedeviled Euler. This difficulty eventually led to the convention of using the special symbol  in place of  to guard against this mistake. Even so, Euler considered it natural to introduce students to complex numbers much earlier than we do today. In his elementary algebra text book, Elements of Algebra, he introduces these numbers almost at once and then uses them in a natural way throughout.\n\nIn the 18th century complex numbers gained wider use, as it was noticed that formal manipulation of complex expressions could be used to simplify calculations involving trigonometric functions. For instance, in 1730 Abraham de Moivre noted that the complicated identities relating trigonometric functions of an integer multiple of an angle to powers of trigonometric functions of that angle could be simply re-expressed by the following well-known formula which bears his name, de Moivre's formula:\n\n(\\cos \\theta + i\\sin \\theta)^{n} = \\cos n \\theta + i\\sin n \\theta. \\,\n\nIn 1748 Leonhard Euler went further and obtained Euler's formula of complex analysis:\n\n\\cos \\theta + i\\sin \\theta = e ^{i\\theta } \\,\n\nby formally manipulating complex power series and observed that this formula could be used to reduce any trigonometric identity to much simpler exponential identities.\n\nThe idea of a complex number as a point in the complex plane (above) was first described by Caspar Wessel in 1799, although it had been anticipated as early as 1685 in Wallis's De Algebra tractatus.\n\nWessel's memoir appeared in the Proceedings of the Copenhagen Academy but went largely unnoticed. In 1806 Jean-Robert Argand independently issued a pamphlet on complex numbers and provided a rigorous proof of the fundamental theorem of algebra. Carl Friedrich Gauss had earlier published an essentially topological proof of the theorem in 1797 but expressed his doubts at the time about \"the true metaphysics of the square root of −1\". It was not until 1831 that he overcame these doubts and published his treatise on complex numbers as points in the plane, largely establishing modern notation and terminology. In the beginning of the 19th century, other mathematicians discovered independently the geometrical representation of the complex numbers: Buée, Mourey, Warren, Français and his brother, Bellavitis. [https://books.google.com/books?idvoFsJ1EhCnYC&pg\nPA139 Extract of page 139]\n\nThe English mathematician G. H. Hardy remarked that Gauss was the first mathematician to use complex numbers in 'a really confident and scientific way' although mathematicians such as Niels Henrik Abel and Carl Gustav Jacob Jacobi were necessarily using them routinely before Gauss published his 1831 treatise. Augustin Louis Cauchy and Bernhard Riemann together brought the fundamental ideas of complex analysis to a high state of completion, commencing around 1825 in Cauchy's case.\n\nThe common terms used in the theory are chiefly due to the founders. Argand called \\scriptstyle \\cos \\phi + i\\sin \\phi the direction factor, and \\scriptstyle r = \\sqrt{a^2+b^2} the modulus; Cauchy (1828) called \\cos \\phi + i\\sin \\phi the reduced form (l'expression réduite) and apparently introduced the term argument; Gauss used  for \\scriptstyle \\sqrt{-1}, introduced the term complex number for , and called  the norm. The expression direction coefficient, often used for \\cos \\phi + i\\sin \\phi, is due to Hankel (1867), and absolute value, for modulus, is due to Weierstrass.\n\nLater classical writers on the general theory include Richard Dedekind, Otto Hölder, Felix Klein, Henri Poincaré, Hermann Schwarz, Karl Weierstrass and many others.\n\nGeneralizations and related notions\n\nThe process of extending the field R of reals to C is known as the Cayley–Dickson construction. It can be carried further to higher dimensions, yielding the quaternions H and octonions O which (as a real vector space) are of dimension 4 and 8, respectively.\nIn this context the complex numbers have been called the binarions.Kevin McCrimmon (2004) A Taste of Jordan Algebras, pp 64, Universitext, Springer  \n\nHowever, just as applying the construction to reals loses the property of ordering, more properties familiar from real and complex numbers vanish with increasing dimension. The quaternions are only a skew field, i.e. for some :  for two quaternions, the multiplication of octonions fails (in addition to not being commutative) to be associative: for some : .\n\nReals, complex numbers, quaternions and octonions are all normed division algebras over R. However, by Hurwitz's theorem they are the only ones. The next step in the Cayley–Dickson construction, the sedenions, in fact fails to have this structure.\n\nThe Cayley–Dickson construction is closely related to the regular representation of C, thought of as an R-algebra (an R-vector space with a multiplication), with respect to the basis . This means the following: the R-linear map\n\\mathbb{C} \\rightarrow \\mathbb{C}, z \\mapsto wz\nfor some fixed complex number  can be represented by a  matrix (once a basis has been chosen). With respect to the basis , this matrix is\n\n\\begin{pmatrix}\n  \\operatorname{Re}(w) & -\\operatorname{Im}(w) \\\\\n  \\operatorname{Im}(w) & \\;\\; \\operatorname{Re}(w)\n\\end{pmatrix}\n\ni.e., the one mentioned in the section on matrix representation of complex numbers above. While this is a linear representation of C in the 2 × 2 real matrices, it is not the only one. Any matrix\nJ \\begin{pmatrix}p & q \\\\ r & -p \\end{pmatrix}, \\quad p^2 + qr + 1 \n 0\nhas the property that its square is the negative of the identity matrix: . Then\n\\{ z = a I + b J : a,b \\in R \\}\nis also isomorphic to the field C, and gives an alternative complex structure on R2. This is generalized by the notion of a linear complex structure.\n\nHypercomplex numbers also generalize R, C, H, and O. For example, this notion contains the split-complex numbers, which are elements of the ring  (as opposed to ). In this ring, the equation  has four solutions.\n\nThe field R is the completion of Q, the field of rational numbers, with respect to the usual absolute value metric. Other choices of metrics on Q lead to the fields Qp of p-adic numbers (for any prime number p), which are thereby analogous to R. There are no other nontrivial ways of completing Q than R and Qp, by Ostrowski's theorem. The algebraic closures \\overline {\\mathbf{Q}_p} of Qp still carry a norm, but (unlike C) are not complete with respect to it. The completion \\mathbf{C}_p of \\overline {\\mathbf{Q}_p} turns out to be algebraically closed. This field is called p-adic complex numbers by analogy.\n\nThe fields R and Qp and their finite field extensions, including C, are local fields.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Complex number" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5826" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A complex number is a number that can be expressed in the form , where  and  are real numbers, and  is a solution of the equation , which is called an imaginary number because there is no real number that satisfies this equation.  For the complex number ,  is called the ', and  is called the '.  Despite the historical nomenclature \"imaginary\", complex numbers are regarded in the mathematical sciences as just as \"real\" as the real numbers, and are fundamental in many aspects of the scientific description of the natural world.An extensive account of the history, from initial skepticism to ultimate acceptance, can be found in . [https://books.google.com/books?idVWTNCwAAQBAJ&pg\nPA73 Extract of page 73]: \"complex numbers, as much as reals, and perhaps even more, find a unity with nature that is truly remarkable. It is as though Nature herself is as impressed by the scope and consistency of the complex-number system as we are ourselves, and has entrusted to these numbers the precise operations of her world at its minutest scales.\"\n\nThe complex number system can be defined as the algebraic extension of the ordinary real numbers by an imaginary number .  This means that complex numbers can be added, subtracted, and multiplied, as polynomials in the variable , with the rule  imposed.  Furthermore, complex numbers can also be divided by nonzero complex numbers. Overall, the complex number system is a field.\n\nMost importantly the complex numbers give rise to the fundamental theorem of algebra: every non-constant polynomial equation with complex coefficients has a complex solution.  This property is true of the complex numbers, but not the reals.  The 16th century Italian mathematician Gerolamo Cardano is credited with introducing complex numbers in his attempts to find solutions to cubic equations.\n\nGeometrically, complex numbers extend the concept of the one-dimensional number line to the two-dimensional complex plane by using the horizontal axis for the real part and the vertical axis for the imaginary part. The complex number  can be identified with the point  in the complex plane. A complex number whose real part is zero is said to be purely imaginary; the points for these numbers lie on the vertical axis of the complex plane.  A complex number whose imaginary part is zero can be viewed as a real number; its point lies on the horizontal axis of the complex plane.  Complex numbers can also be represented in polar form, which associates each complex number with its distance from the origin (its magnitude) and with a particular angle known as the argument of this complex number.\n\nOverview\n\nComplex numbers allow solutions to certain equations that have no solutions in real numbers. For example, the equation\n(x+1)^2 = -9 \\,\nhas no real solution, since the square of a real number cannot be negative. Complex numbers provide a solution to this problem. The idea is to extend the real numbers with an indeterminate  (sometimes called the imaginary unit) that is taken to satisfy the relation , so that solutions to equations like the preceding one can be found. In this case the solutions are  and , as can be verified using the fact that :\n\n((-1+3i)+1)^2 (3i)^2 \n (3^2)(i^2) 9(-1) \n -9,\n((-1-3i)+1)^2 (-3i)^2 \n (-3)^2(i^2) 9(-1) \n -9.\n\nAccording to the fundamental theorem of algebra, all polynomial equations with real or complex coefficients in a single variable have a solution in complex numbers.\n\nDefinition\n\nA complex number is a number of the form , where  and  are real numbers and  is an indeterminate satisfying . For example,  is a complex number.\n\nA complex number may therefore be defined as a polynomial in the single indeterminate , with the relation  imposed.  From this definition, complex numbers can be added or multiplied, using the addition and multiplication for polynomials.  Formally, the set of complex numbers is the quotient ring of the polynomial ring in the indeterminate , by the ideal generated by the polynomial  (see below).  The set of all complex numbers is denoted by , \\mathbf{C} or \\mathbb{C}.\n\nThe real number  is called the real part of the complex number ; the real number  is called the imaginary part of . By this convention, the imaginary part does not include a factor of : hence , not , is the imaginary part.Complex Variables (2nd Edition), M.R. Spiegel, S. Lipschutz, J.J. Schiller, D. Spellman, Schaum's Outline Series, Mc Graw Hill (USA),  The real part of a complex number  is denoted by  or ; the imaginary part of a complex number  is denoted by  or . For example,\n\\begin{align}\n  \\operatorname{Re}(2 + 3i) &= 2 \\\\\n  \\operatorname{Im}(2 + 3i) &= 3.\n\\end{align}\n\nA real number  can be regarded as a complex number  whose imaginary part is 0. A purely imaginary number  is a complex number  whose real part is zero. It is common to write  for  and  for . Moreover, when the imaginary part is negative, it is common to write  with  instead of , for example  instead of .\n\nCartesian form and definition via ordered pairs\n\nA complex number can thus be identified with an ordered pair  in the Cartesian plane, an identification sometimes known as the Cartesian form of .  In fact, a complex number can be defined as an ordered pair , but then rules for addition and multiplication must also be included as part of the definition (see below).  William Rowan Hamilton introduced this approach to define the complex number system.\n\nComplex plane\n\nA complex number can be viewed as a point or position vector in a two-dimensional Cartesian coordinate system called the complex plane or Argand diagram (see  and ), named after Jean-Robert Argand. The numbers are conventionally plotted using the real part as the horizontal component, and imaginary part as vertical (see Figure 1). These two values used to identify a given complex number are therefore called its Cartesian, rectangular, or algebraic form.\n\nA position vector may also be defined in terms of its magnitude and direction relative to the origin. These are emphasized in a complex number's polar form. Using the polar form of the complex number in calculations may lead to a more intuitive interpretation of mathematical results. Notably, the operations of addition and multiplication take on a very natural geometric character when complex numbers are viewed as position vectors: addition corresponds to vector addition while multiplication corresponds to multiplying their magnitudes and adding their arguments (i.e. the angles they make with the x axis). Viewed in this way the multiplication of a complex number by  corresponds to rotating the position vector counterclockwise by a quarter turn (90°) about the origin:  2 \n .\n\nHistory in brief\n\nMain section: History\n\nThe solution in radicals (without trigonometric functions) of a general cubic equation contains the square roots of negative numbers when all three roots are real numbers, a situation that cannot be rectified by factoring aided by the rational root test if the cubic is irreducible (the so-called casus irreducibilis). This conundrum led Italian mathematician Gerolamo Cardano to conceive of complex numbers in around 1545, though his understanding was rudimentary.\n\nWork on the problem of general polynomials ultimately led to the fundamental theorem of algebra, which shows that with complex numbers, a solution exists to every polynomial equation of degree one or higher. Complex numbers thus form an algebraically closed field, where any polynomial equation has a root.\n\nMany mathematicians contributed to the full development of complex numbers. The rules for addition, subtraction, multiplication, and division of complex numbers were developed by the Italian mathematician Rafael Bombelli. A more abstract formalism for the complex numbers was further developed by the Irish mathematician William Rowan Hamilton, who extended this abstraction to the theory of quaternions.\n\nNotation\n\nBecause it is a polynomial in the indeterminate ,  may be written instead of , which is often expedient when  is a radical.For example . In some disciplines, in particular electromagnetism and electrical engineering,  is used instead of , since  is frequently used for electric current. In these cases complex numbers are written as  or .\n\nEquality and order relations\n\nTwo complex numbers are equal if and only if both their real and imaginary parts are equal. That is, complex numbers z_1 and z_2 are equal if and only if \n\\operatorname{Re}(z_{1}) \\operatorname{Re}(z_{2}) and \\operatorname{Im} (z_{1}) \n \\operatorname{Im} (z_{2}).  If the complex numbers are written in polar form, they are equal if and only if they have the same argument and the same magnitude.\n\nBecause complex numbers are naturally thought of as existing on a two-dimensional plane, there is no natural linear ordering on the set of complex numbers.  Furthermore, there is no linear ordering on the complex numbers that is compatible with addition and multiplication – the complex numbers cannot have the structure of an ordered field. This is because any square in an ordered field is at least , but .\n\nElementary operations\n\nConjugate\n\nThe complex conjugate of the complex number  is defined to be . It is denoted by either \\overline{z} or .For the former notation, see for instance .\n\nGeometrically, \\bar{z} is the \"reflection\" of  about the real axis. Conjugating twice gives the original complex number: \\bar{\\bar{z}}=z.\n\nThe real and imaginary parts of a complex number  can be extracted using the conjugate:\n\\operatorname{Re}(z) = \\dfrac{z+\\overline{z}}{2}, \\,\n\\operatorname{Im}(z) = \\dfrac{z-\\overline{z}}{2i}. \\,\nMoreover, a complex number is real if and only if it equals its own conjugate.\n\nConjugation distributes over the standard arithmetic operations:\n\\overline{z+w} = \\overline{z} + \\overline{w}, \\,\n\\overline{z-w} = \\overline{z} - \\overline{w}, \\,\n\\overline{z\\cdot w} = \\overline{z} \\cdot\\overline{w}, \\,\n\\overline{z/w} = \\overline{z}/\\overline{w}. \\,\n\nAddition and subtraction\n\nComplex numbers are added by separately adding the real and imaginary parts of the summands. That is to say:\n(a+bi) + (c+di) = (a+c) + (b+d)i.\\ \nSimilarly, subtraction is defined by\n(a+bi) - (c+di) = (a-c) + (b-d)i.\\ \nUsing the visualization of complex numbers in the complex plane, the addition has the following geometric interpretation: the sum of two complex numbers A and B, interpreted as points of the complex plane, is the point X obtained by building a parallelogram, three of whose vertices are O, A and B. Equivalently, X is the point such that the triangles with vertices O, A, B, and X, B, A, are congruent.\n\nMultiplication and division\n\nThe multiplication of two complex numbers is defined by the following formula:\n(a+bi) (c+di) = (ac-bd) + (bc+ad)i.\\ \nIn particular, the square of  is −1:\ni^2 i \\times i \n -1.\\ \n\nThe preceding definition of multiplication of general complex numbers follows naturally from this fundamental property of . Indeed, if  is treated as a number so that  means  times , the above multiplication rule is identical to the usual rule for multiplying two sums of two terms.\n(a+bi) (c+di) = ac + bci + adi + bidi (distributive property)\n:: = ac + bidi + bci + adi (commutative property of addition—the order of the summands can be changed)\n:: = ac + bdi^2 + (bc+ad)i (commutative and distributive properties)\n:: = (ac-bd) + (bc+ad)i (fundamental property of ).\n\nThe division of two complex numbers is defined in terms of complex multiplication, which is described above, and real division. When at least one of  and  is non-zero, we have\n\\frac{a + bi}{c + di} = \\left({ac + bd \\over c^2 + d^2}\\right) + \\left( {bc - ad \\over c^2 + d^2} \\right)i. \nDivision can be defined in this way because of the following observation:\n\\frac{a + bi}{c + di} \\frac{\\left(a + bi\\right) \\cdot \\left(c - di\\right)}{\\left (c + di\\right) \\cdot \\left (c - di\\right)} \n \\left({ac + bd \\over c^2 + d^2}\\right) + \\left( {bc - ad \\over c^2 + d^2} \\right)i. \nAs shown earlier,  is the complex conjugate of the denominator . At least one of the real part  and the imaginary part  of the denominator must be nonzero for division to be defined. This is called \"rationalization\" of the denominator (although the denominator in the final expression might be an irrational real number).\n\nReciprocal\n\nThe reciprocal of a nonzero complex number  is given by\n\\frac{1}{z}\\frac{\\bar{z}}{z \\bar{z}}\n\\frac{\\bar{z}}{x^2+y^2}=\\frac{x}{x^2+y^2} -\\frac{y}{x^2+y^2}i.\nThis formula can be used to compute the multiplicative inverse of a complex number if it is given in rectangular coordinates. Inversive geometry, a branch of geometry studying reflections more general than ones about a line, can also be expressed in terms of complex numbers. In the network analysis of electrical circuits, the complex conjugate is used in finding the equivalent impedance when the maximum power transfer theorem is used.\n\nSquare root\n\nThe square roots of  (with ) are  \\pm (\\gamma + \\delta i), where\n\n\\gamma = \\sqrt{\\frac{a + \\sqrt{a^2 + b^2}}{2}}\n\nand\n\n\\delta = \\sgn (b) \\sqrt{\\frac{-a + \\sqrt{a^2 + b^2}}{2}},\n\nwhere sgn is the signum function. This can be seen by squaring  \\pm (\\gamma + \\delta i) to obtain ., [http://www.math.sfu.ca/~cbm/aands/page_17.htm Section 3.7.26, p. 17]\n, [https://books.google.com/books?idlUcTsYopfhkC&pg\nPA59 Extract: page 59]\n Here \\sqrt{a^2 + b^2} is called the modulus of , and the square root sign indicates the square root with non-negative real part, called the principal square root; also \\sqrt{a^2 + b^2}\\sqrt{z\\bar{z}}, where  z \n a + bi .\n\nPolar form\n \n\nAbsolute value and argument\n\nAn alternative way of defining a point P in the complex plane, other than using the x- and y-coordinates, is to use the distance of the point from O, the point whose coordinates are  (the origin), together with the angle subtended between the positive real axis and the line segment OP in a counterclockwise direction. This idea leads to the polar form of complex numbers.\n\nThe absolute value (or modulus or magnitude) of a complex number  is.\n\\textstyle r|z|\n\\sqrt{x^2+y^2}.\\,\nIf  is a real number (that is, if ), then . That is, the absolute value of a real number equals its absolute value as a complex number.\n\nBy Pythagoras' theorem, the absolute value of complex number is the distance to the origin of the point representing the complex number in the complex plane.\n\nThe square of the absolute value is\n\\textstyle |z|^2z\\bar{z}\nx^2+y^2.\\,\nwhere \\bar{z} is the complex conjugate of z.\n\nThe argument of  (in many applications referred to as the \"phase\") is the angle of the radius OP with the positive real axis, and is written as \\arg(z). As with the modulus, the argument can be found from the rectangular form x+yi:\n\n\\varphi \\arg(z) \n\n\\begin{cases}\n\\arctan\\left(\\dfrac{y}{x}\\right) & \\text{if } x > 0 \\\\\n\\arctan\\left(\\dfrac{y}{x}\\right) + \\pi & \\text{if } x  0\\\\\n-\\dfrac{\\pi}{2} & \\text{if } x = 0 \\text{ and } y \n\nNormally, as given above, the principal value in the interval  is chosen. Values in the range  are obtained by adding  if the value is negative. The value of  is expressed in radians in this article. It can increase by any integer multiple of  and still give the same angle. Hence, the arg function is sometimes considered as multivalued.   The polar angle for the complex number 0 is indeterminate, but arbitrary choice of the angle 0 is common.\n\nThe value of  equals the result of atan2:\n\\varphi = \\operatorname{atan2}\\left(\\operatorname{Im}(z),\\operatorname{Re}(z) \\right).\n\nTogether,  and  give another way of representing complex numbers, the polar form, as the combination of modulus and argument fully specify the position of a point on the plane. Recovering the original rectangular co-ordinates from the polar form is done by the formula called trigonometric form\n z = r(\\cos \\varphi + i\\sin \\varphi ).\\,\n\nUsing Euler's formula this can be written as\nz = r e^{i \\varphi}.\\,\n\nUsing the cis function, this is sometimes abbreviated to\n z = r \\operatorname{cis} \\varphi. \\,\n\nIn angle notation, often used in electronics to represent a phasor with amplitude  and phase , it is written as\n\nz = r \\ang \\varphi . \\,\n\nMultiplication and division in polar form\n\nFormulas for multiplication, division and exponentiation are simpler in polar form than the corresponding formulas in Cartesian coordinates. Given two complex numbers  and , because of the well-known trigonometric identities \n \\cos(a)\\cos(b) - \\sin(a)\\sin(b) = \\cos(a + b)\n \\cos(a)\\sin(b) + \\sin(a)\\cos(b) = \\sin(a + b)\n\nwe may derive\n\nz_1 z_2 = r_1 r_2 (\\cos(\\varphi_1 + \\varphi_2) + i \\sin(\\varphi_1 + \\varphi_2)).\\,\nIn other words, the absolute values are multiplied and the arguments are added to yield the polar form of the product. For example, multiplying by  corresponds to a quarter-turn counter-clockwise, which gives back . The picture at the right illustrates the multiplication of\n(2+i)(3+i)=5+5i. \\,\nSince the real and imaginary part of  are equal, the argument of that number is 45 degrees, or π/4 (in radian). On the other hand, it is also the sum of the angles at the origin of the red and blue triangles are arctan(1/3) and arctan(1/2), respectively. Thus, the formula\n\\frac{\\pi}{4} = \\arctan\\frac{1}{2} + \\arctan\\frac{1}{3} \nholds. As the arctan function can be approximated highly efficiently, formulas like this—known as Machin-like formulas—are used for high-precision approximations of π.\n\nSimilarly, division is given by\n\\frac{z_1}{ z_2} = \\frac{r_1}{ r_2} \\left(\\cos(\\varphi_1 - \\varphi_2) + i \\sin(\\varphi_1 - \\varphi_2)\\right).\n\nExponentiation \n\nEuler's formula\n\nEuler's formula states that, for any real number ,\n\ne^{ix} = \\cos x + i\\sin x \\ ,\n\nwhere  is the base of the natural logarithm. This can be proved through induction by observing that\n\n\\begin{align}\ni^0 &{}= 1, \\quad &\ni^1 &{}= i, \\quad &\ni^2 &{}= -1, \\quad &\ni^3 &{}= -i, \\\\\ni^4 &={} 1, \\quad &\ni^5 &={} i, \\quad &\ni^6 &{}= -1, \\quad &\ni^7 &{}= -i,\n\\end{align}\n\nand so on, and by considering the Taylor series expansions of ,  and :\n\n\\begin{align}\n e^{ix} &{}= 1 + ix + \\frac{(ix)^2}{2!} + \\frac{(ix)^3}{3!} + \\frac{(ix)^4}{4!} + \\frac{(ix)^5}{5!} + \\frac{(ix)^6}{6!} + \\frac{(ix)^7}{7!} + \\frac{(ix)^8}{8!} + \\cdots \\\\[8pt]\n        &{}= 1 + ix - \\frac{x^2}{2!} - \\frac{ix^3}{3!} + \\frac{x^4}{4!} + \\frac{ix^5}{5!} -\\frac{x^6}{6!} - \\frac{ix^7}{7!} + \\frac{x^8}{8!} + \\cdots \\\\[8pt]\n        &{}= \\left( 1 - \\frac{x^2}{2!} + \\frac{x^4}{4!} - \\frac{x^6}{6!} + \\frac{x^8}{8!} - \\cdots \\right) + i\\left( x - \\frac{x^3}{3!} + \\frac{x^5}{5!} - \\frac{x^7}{7!} + \\cdots \\right) \\\\[8pt]\n        &{}= \\cos x + i\\sin x \\ .\n\\end{align}\n\nThe rearrangement of terms is justified because each series is absolutely convergent.\n\nNatural logarithm\n\nIt follows from Euler's formula that, for any complex number z written in polar form,\n\n z = r(\\cos \\varphi + i\\sin \\varphi )\n\nwhere r is a non-negative real number, one possible value for the complex logarithm of z is\n\n \\ln (z)= \\ln(r) + \\varphi i.\n\nBecause cosine and sine are periodic functions,  other possible values may be obtained. For example, e^{i\\pi} e^{3i\\pi} \n -1, \nso both i \\pi and 3i\\pi are two possible values for the natural logarithm of -1.\n\nTo deal with the existence of more the one possible value for a given input, the complex logarithm may be considered a multi-valued function, with\n\n \\ln(z) = \\left\\{ \\ln(r) + (\\varphi + 2\\pi k)i \\;|\\; k \\in \\mathbb{Z}\\right\\}.\n\nAlternatively, a branch cut can be used to define a single-valued \"branch\" of the complex logarithm.\n\nInteger and fractional exponents\n\nWe may use the identity\n\n \\ln(a^{b}) = b \\ln(a)\n\nto define complex exponentiation, which is likewise multi-valued:\n\n\\begin{align}\n\\ln (z^n) &= \\ln((r(\\cos \\varphi + i\\sin \\varphi ))^{n}) \\\\\n              &= n \\ln(r(\\cos \\varphi + i\\sin \\varphi)) \\\\\n              &= \\{ n (\\ln(r) + (\\varphi + k2\\pi) i) \\ | \\ k \\in \\mathbb{Z} \\} \\\\\n              &= \\{ n \\ln(r) + n \\varphi i + nk2\\pi i \\ | \\ k \\in \\mathbb{Z} \\}.\n\\end{align}\n\nWhen n is an integer, this simplifies to de Moivre's formula:\n\n z^{n}(r(\\cos \\varphi + i\\sin \\varphi ))^{n} \n r^n\\,(\\cos n\\varphi + i \\sin n \\varphi).\n\nThe th roots of  are given by\n\\sqrt[n]{z} = \\sqrt[n]r \\left( \\cos \\left(\\frac{\\varphi+2k\\pi}{n}\\right) + i \\sin \\left(\\frac{\\varphi+2k\\pi}{n}\\right)\\right)\nfor any integer  satisfying . Here  is the usual (positive) th root of the positive real number . While the th root of a positive real number  is chosen to be the positive real number  satisfying  there is no natural way of distinguishing one particular complex th root of a complex number. Therefore, the th root of  is considered as a multivalued function (in ), as opposed to a usual function , for which  is a uniquely defined number. Formulas such as\n\\sqrt[n]{z^n} = z\n(which holds for positive real numbers), do in general not hold for complex numbers.\n\nProperties\n\nField structure\n\nThe set C of complex numbers is a field. Briefly, this means that the following facts hold: first, any two complex numbers can be added and multiplied to yield another complex number. Second, for any complex number , its additive inverse  is also a complex number; and third, every nonzero complex number has a reciprocal complex number. Moreover, these operations satisfy a number of laws, for example the law of commutativity of addition and multiplication for any two complex numbers  and :\nz_1+ z_2 = z_2 + z_1,\nz_1 z_2 = z_2 z_1.\nThese two laws and the other requirements on a field can be proven by the formulas given above, using the fact that the real numbers themselves form a field.\n\nUnlike the reals, C is not an ordered field, that is to say, it is not possible to define a relation  that is compatible with the addition and multiplication. In fact, in any ordered field, the square of any element is necessarily positive, so  precludes the existence of an ordering on C.\n\nWhen the underlying field for a mathematical topic or construct is the field of complex numbers, the topic's name is usually modified to reflect that fact. For example: complex analysis, complex matrix, complex polynomial, and complex Lie algebra.\n\nSolutions of polynomial equations\n\nGiven any complex numbers (called coefficients) , the equation\na_n z^n + \\dotsb + a_1 z + a_0 = 0\nhas at least one complex solution z, provided that at least one of the higher coefficients  is nonzero.  This is the statement of the fundamental theorem of algebra, of Carl Friedrich Gauss and Jean le Rond d'Alembert. Because of this fact, C is called an algebraically closed field. This property does not hold for the field of rational numbers Q (the polynomial  does not have a rational root, since square root of 2| is not a rational number) nor the real numbers R (the polynomial  does not have a real root for , since the square of  is positive for any real number ).\n\nThere are various proofs of this theorem, either by analytic methods such as Liouville's theorem, or topological ones such as the winding number, or a proof combining Galois theory and the fact that any real polynomial of odd degree has at least one real root.\n\nBecause of this fact, theorems that hold for any algebraically closed field, apply to C. For example, any non-empty complex square matrix has at least one (complex) eigenvalue.\n\nAlgebraic characterization\n\nThe field C has the following three properties: first, it has characteristic 0. This means that  for any number of summands (all of which equal one). Second, its transcendence degree over Q, the prime field of C, is the cardinality of the continuum. Third, it is algebraically closed (see above). It can be shown that any field having these properties is isomorphic (as a field) to C. For example, the algebraic closure of Qp also satisfies these three properties, so these two fields are isomorphic (as fields, but not as topological fields). Also, C is isomorphic to the field of complex Puiseux series. However, specifying an isomorphism requires the axiom of choice. Another consequence of this algebraic characterization is that C contains many proper subfields that are isomorphic to C.\n\nCharacterization as a topological field\n\nThe preceding characterization of C describes only the algebraic aspects of C. That is to say, the properties of nearness and continuity, which matter in areas such as analysis and topology, are not dealt with. The following description of C as a topological field (that is, a field that is equipped with a topology, which allows the notion of convergence) does take into account the topological properties. C contains a subset  (namely the set of positive real numbers) of nonzero elements satisfying the following three conditions:\n*  is closed under addition, multiplication and taking inverses.\n* If  and  are distinct elements of , then either  or  is in .\n* If  is any nonempty subset of , then  for some  in C.\nMoreover, C has a nontrivial involutive automorphism  (namely the complex conjugation), such that  is in  for any nonzero  in C.\n\nAny field  with these properties can be endowed with a topology by taking the sets  as a base, where  ranges over the field and  ranges over . With this topology  is isomorphic as a topological field to C.\n\nThe only connected locally compact topological fields are R and C. This gives another characterization of C as a topological field, since C can be distinguished from R because the nonzero complex numbers are connected, while the nonzero real numbers are not.\n\nFormal construction\n\nConstruction as ordered pairs\n\nThe set  of complex numbers can be defined as the set  of ordered pairs  of real numbers, in which the following rules for addition and multiplication are imposed:\n\n\\begin{align}\n(a, b) + (c, d) &= (a + c, b + d)\\\\\n(a, b) \\cdot (c, d) &= (ac - bd, bc + ad).\n\\end{align}\n\nIt is then just a matter of notation to express  as .\n\nConstruction as a quotient field\n\nThough this low-level construction does accurately describe the structure of the complex numbers, the following equivalent definition reveals the algebraic nature of  more immediately. This characterization relies on the notion of fields and polynomials. A field is a set endowed with addition, subtraction, multiplication and division operations that behave as is familiar from, say, rational numbers. For example, the distributive law\n(x+y) z = xz + yz\nmust hold for any three elements ,  and  of a field. The set  of real numbers does form a field. A polynomial  with real coefficients is an expression of the form\na_nX^n+\\dotsb+a_1X+a_0,\nwhere the  are real numbers. The usual addition and multiplication of polynomials endows the set  of all such polynomials with a ring structure. This ring is called the polynomial ring over the real numbers.\n\nThe set of complex numbers is defined as the quotient ring .   This extension field contains two square roots of , namely (the cosets of)  and , respectively. (The cosets of)  and  form a basis of  as a real vector space, which means that each element of the extension field can be uniquely written as a linear combination in these two elements. Equivalently, elements of the extension field can be written as ordered pairs  of real numbers.  The quotient ring is a field, because the  is a prime ideal in , a principal ideal domain, and therefore is a maximal ideal.\n\nThe formulas for addition and multiplication in the ring , modulo the relation  correspond to the formulas for addition and multiplication of complex numbers defined as ordered pairs.  So the two definitions of the field  are isomorphic (as fields).\n\nAccepting that  is algebraically closed, since it is an algebraic extension of  in this approach,  is therefore the algebraic closure of .\n\nMatrix representation of complex numbers\n\nComplex numbers  can also be represented by  matrices that have the following form:\n\n\\begin{pmatrix}\n  a &   -b  \\\\\n  b & \\;\\; a\n\\end{pmatrix}\n\nHere the entries  and  are real numbers. The sum and product of two such matrices is again of this form, and the sum and product of complex numbers corresponds to the sum and product of such matrices, the product being:\n\n\\begin{pmatrix}\n  a &   -b  \\\\\n  b & \\;\\; a\n\\end{pmatrix}\n\\begin{pmatrix}\n  c &   -d  \\\\\n  d & \\;\\; c\n\\end{pmatrix}\n= \\begin{pmatrix}\n  ac-bd &   -ad-bc  \\\\\n  bc+ad & \\;\\; -bd+ac\n\\end{pmatrix}\n\nThe geometric description of the multiplication of complex numbers can also be expressed in terms of rotation matrices by using this correspondence between complex numbers and such matrices. Moreover, the square of the absolute value of a complex number expressed as a matrix is equal to the determinant of that matrix:\n |z|^2 =\n\\begin{vmatrix}\n  a & -b  \\\\\n  b &  a\n\\end{vmatrix}\n= a^2 + b^2.\n\nThe conjugate \\overline z corresponds to the transpose of the matrix.\n\nThough this representation of complex numbers with matrices is the most common, many other representations arise from matrices other than \\bigl(\\begin{smallmatrix}0 & -1 \\\\1 & 0 \\end{smallmatrix}\\bigr) that square to the negative of the identity matrix. See the article on 2 × 2 real matrices for other representations of complex numbers.\n\nComplex analysis\n\nThe study of functions of a complex variable is known as complex analysis and has enormous practical use in applied mathematics as well as in other branches of mathematics. Often, the most natural proofs for statements in real analysis or even number theory employ techniques from complex analysis (see prime number theorem for an example). Unlike real functions, which are commonly represented as two-dimensional graphs, complex functions have four-dimensional graphs and may usefully be illustrated by color-coding a three-dimensional graph to suggest four dimensions, or by animating the complex function's dynamic transformation of the complex plane.\n\nComplex exponential and related functions\n\nThe notions of convergent series and continuous functions in (real) analysis have natural analogs in complex analysis. A sequence  of complex numbers is said to converge if and only if its real and imaginary parts do. This is equivalent to the (ε, δ)-definition of limits, where the absolute value of real numbers is replaced by the one of complex numbers. From a more abstract point of view, C, endowed with the metric\n\\operatorname{d}(z_1, z_2) = |z_1 - z_2| \\,\nis a complete metric space, which notably includes the triangle inequality\n|z_1 + z_2| \\le |z_1| + |z_2|\nfor any two complex numbers  and .\n\nLike in real analysis, this notion of convergence is used to construct a number of elementary functions: the exponential function , also written , is defined as the infinite series\n\\exp(z):1+z+\\frac{z^2}{2\\cdot 1}+\\frac{z^3}{3\\cdot 2\\cdot 1}+\\cdots \n \\sum_{n=0}^{\\infty} \\frac{z^n}{n!}. \n\nThe series defining the real trigonometric functions sine and cosine, as well as the hyperbolic functions sinh and cosh, also carry over to complex arguments without change. For the other trigonometric and hyperbolic functions, such as tangent, things are slightly more complicated, as the defining series do not converge for all complex values. Therefore, one must define them either in terms of sine, cosine and exponential, or, equivalently, by using the method of analytic continuation.\n\nEuler's identity states:\n\\exp(i\\varphi) = \\cos(\\varphi) + i\\sin(\\varphi) \\,\nfor any real number φ, in particular\n\\exp(i \\pi) = -1 \\,\nUnlike in the situation of real numbers, there is an infinitude of complex solutions  of the equation\n\\exp(z) = w \\,\nfor any complex number . It can be shown that any such solution —called complex logarithm of —satisfies\n\\log(w)=\\ln|w| + i\\arg(w), \\,\nwhere arg is the argument defined above, and ln the (real) natural logarithm. As arg is a multivalued function, unique only up to a multiple of 2π, log is also multivalued. The principal value of log is often taken by restricting the imaginary part to the interval .\n\nComplex exponentiation  is defined as\nz^\\omega = \\exp(\\omega \\log z), \nand is multi-valued, except when \\omega is an integer. For , for some natural number , this recovers the non-uniqueness of th roots mentioned above.\n\nComplex numbers, unlike real numbers, do not in general satisfy the unmodified power and logarithm identities, particularly when naïvely treated as single-valued functions; see failure of power and logarithm identities. For example, they do not satisfy\na^{bc} = (a^b)^c.\nBoth sides of the equation are multivalued by the definition of complex exponentiation given here, and the values on the left are a subset of those on the right.\n\nHolomorphic functions\n\nA function f : C → C is called holomorphic if it satisfies the Cauchy–Riemann equations. For example, any R-linear map C → C can be written in the form\nf(z)=az+b\\overline{z}\nwith complex coefficients  and . This map is holomorphic if and only if . The second summand b \\overline z is real-differentiable, but does not satisfy the Cauchy–Riemann equations.\n\nComplex analysis shows some features not apparent in real analysis. For example, any two holomorphic functions  and  that agree on an arbitrarily small open subset of C necessarily agree everywhere. Meromorphic functions, functions that can locally be written as  with a holomorphic function , still share some of the features of holomorphic functions. Other functions have essential singularities, such as  at .\n\nApplications\n\nComplex numbers have essential concrete applications in a variety of scientific and related areas such as signal processing, control theory, electromagnetism, fluid dynamics, quantum mechanics, cartography, and vibration analysis. Some applications of complex numbers are:\n\nControl theory\n\nIn control theory, systems are often transformed from the time domain to the frequency domain using the Laplace transform. The system's zeros and poles are then analyzed in the complex plane. The root locus, Nyquist plot, and Nichols plot techniques all make use of the complex plane.\n\nIn the root locus method, it is important whether zeros and poles are in the left or right half planes, i.e. have real part greater than or less than zero. If a linear, time-invariant (LTI) system has poles that are\n*in the right half plane, it will be unstable,\n*all in the left half plane, it will be stable,\n*on the imaginary axis, it will have marginal stability.\nIf a system has zeros in the right half plane, it is a nonminimum phase system.\n\nImproper integrals\n\nIn applied fields, complex numbers are often used to compute certain real-valued improper integrals, by means of complex-valued functions. Several methods exist to do this; see methods of contour integration.\n\nFluid dynamics\n\nIn fluid dynamics, complex functions are used to describe potential flow in two dimensions.\n\nDynamic equations\n\nIn differential equations, it is common to first find all complex roots  of the characteristic equation of a linear differential equation or equation system and then attempt to solve the system in terms of base functions of the form . Likewise, in difference equations, the complex roots  of the characteristic equation of the difference equation system are used, to attempt to solve the system in terms of base functions of the form .\n\nElectromagnetism and electrical engineering\n\nIn electrical engineering, the Fourier transform is used to analyze varying voltages and currents. The treatment of resistors, capacitors, and inductors can then be unified by introducing imaginary, frequency-dependent resistances for the latter two and combining all three in a single complex number called the impedance. This approach is called phasor calculus.\n\nIn electrical engineering, the imaginary unit is denoted by , to avoid confusion with , which is generally in use to denote electric current, or, more particularly, , which is generally in use to denote instantaneous electric current.\n\nSince the voltage in an AC circuit is oscillating, it can be represented as\n\n V(t) V_0 e^{j \\omega t} \n V_0 \\left (\\cos \\omega t + j \\sin\\omega t \\right ),\n\nTo obtain the measurable quantity, the real part is taken:\n\n v(t) \\mathrm{Re}(V) \n \\mathrm{Re}\\left [ V_0 e^{j \\omega t} \\right ] = V_0 \\cos \\omega t.\n\nThe complex-valued signal V(t) is called the analytic representation of the real-valued, measurable signal v(t).\nElectromagnetism (2nd edition), I.S. Grant, W.R. Phillips, Manchester Physics Series, 2008 \n\nSignal analysis\n\nComplex numbers are used in signal analysis and other fields for a convenient description for periodically varying signals. For given real functions representing actual physical quantities, often in terms of sines and cosines, corresponding complex functions are considered of which the real parts are the original quantities. For a sine wave of a given frequency, the absolute value  of the corresponding  is the amplitude and the argument  is the phase.\n\nIf Fourier analysis is employed to write a given real-valued signal as a sum of periodic functions, these periodic functions are often written as complex valued functions of the form\nx(t) = \\operatorname{Re} \\{X( t ) \\} \\,\n\nand\n\nX( t ) A e^{i\\omega t} \n a e^{ i \\phi } e^{i\\omega t} = a e^{i (\\omega t + \\phi) } \\,\n\nwhere ω represents the angular frequency and the complex number A encodes the phase and amplitude as explained above.\n\nThis use is also extended into digital signal processing and digital image processing, which utilize digital versions of Fourier analysis (and wavelet analysis) to transmit, compress, restore, and otherwise process digital audio signals, still images, and video signals.\n\nAnother example, relevant to the two side bands of amplitude modulation of AM radio, is:\n\n\\begin{align}\n\\cos((\\omega+\\alpha)t)+\\cos\\left((\\omega-\\alpha)t\\right) & = \\operatorname{Re}\\left(e^{i(\\omega+\\alpha)t} + e^{i(\\omega-\\alpha)t}\\right) \\\\\n& = \\operatorname{Re}\\left((e^{i\\alpha t} + e^{-i\\alpha t})\\cdot e^{i\\omega t}\\right) \\\\\n& = \\operatorname{Re}\\left(2\\cos(\\alpha t) \\cdot e^{i\\omega t}\\right) \\\\\n& = 2 \\cos(\\alpha t) \\cdot \\operatorname{Re}\\left(e^{i\\omega t}\\right) \\\\\n& = 2 \\cos(\\alpha t)\\cdot \\cos\\left(\\omega t\\right)\\,.\n\\end{align}\n\nQuantum mechanics\n\nThe complex number field is intrinsic to the mathematical formulations of quantum mechanics, where complex Hilbert spaces provide the context for one such formulation that is convenient and perhaps most standard. The original foundation formulas of quantum mechanics—the Schrödinger equation and Heisenberg's matrix mechanics—make use of complex numbers.\n\nRelativity\n\nIn special and general relativity, some formulas for the metric on spacetime become simpler if one takes the time component of the spacetime continuum to be imaginary. (This approach is no longer standard in classical relativity, but is used in an essential way in quantum field theory.) Complex numbers are essential to spinors, which are a generalization of the tensors used in relativity.\n\nGeometry\n\nFractals\n\nCertain fractals are plotted in the complex plane, e.g. the Mandelbrot set and Julia sets.\n\nTriangles\n\nEvery triangle has a unique Steiner inellipse—an ellipse inside the triangle and tangent to the midpoints of the three sides of the triangle. The foci of a triangle's Steiner inellipse can be found as follows, according to Marden's theorem: Denote the triangle's vertices in the complex plane as , , and . Write the cubic equation \\scriptstyle (x-a)(x-b)(x-c)=0, take its derivative, and equate the (quadratic) derivative to zero. Marden's Theorem says that the solutions of this equation are the complex numbers denoting the locations of the two foci of the Steiner inellipse.\n\nAlgebraic number theory\n\nAs mentioned above, any nonconstant polynomial equation (in complex coefficients) has a solution in C. A fortiori, the same is true if the equation has rational coefficients. The roots of such equations are called algebraic numbers – they are a principal object of study in algebraic number theory. Compared to , the algebraic closure of Q, which also contains all algebraic numbers, C has the advantage of being easily understandable in geometric terms. In this way, algebraic methods can be used to study geometric questions and vice versa. With algebraic methods, more specifically applying the machinery of field theory to the number field containing roots of unity, it can be shown that it is not possible to construct a regular nonagon using only compass and straightedge – a purely geometric problem.\n\nAnother example are Gaussian integers, that is, numbers of the form , where  and  are integers, which can be used to classify sums of squares.\n\nAnalytic number theory\n\nAnalytic number theory studies numbers, often integers or rationals, by taking advantage of the fact that they can be regarded as complex numbers, in which analytic methods can be used. This is done by encoding number-theoretic information in complex-valued functions. For example, the Riemann zeta function  is related to the distribution of prime numbers.\n\nHistory\n\nThe earliest fleeting reference to square roots of negative numbers can perhaps be said to occur in the work of the Greek mathematician Hero of Alexandria in the 1st century AD, where in his Stereometrica he considers, apparently in error, the volume of an impossible frustum of a pyramid to arrive at the term \\scriptstyle \\sqrt{81 - 144} 3i\\sqrt{7} in his calculations, although negative quantities were not conceived of in Hellenistic mathematics and Heron merely replaced it by its positive (\\scriptstyle \\sqrt{144 - 81} \n 3\\sqrt{7}).\n\nThe impetus to study complex numbers proper first arose in the 16th century when algebraic solutions for the roots of cubic and quartic polynomials were discovered by Italian mathematicians (see Niccolò Fontana Tartaglia, Gerolamo Cardano). It was soon realized that these formulas, even if one was only interested in real solutions, sometimes required the manipulation of square roots of negative numbers. As an example, Tartaglia's formula for a cubic equation of the form \\scriptstyle x^3 px + qIn modern notation, Tartaglia's solution is based on expanding the cube of the sum of two cube roots: \\scriptstyle \\left(\\sqrt[3]{u} + \\sqrt[3]{v}\\right)^3 \n 3 \\sqrt[3]{uv} \\left(\\sqrt[3]{u} + \\sqrt[3]{v}\\right) + u + v With \\scriptstyle x \\sqrt[3]{u} + \\sqrt[3]{v}, \\scriptstyle p \n 3 \\sqrt[3]{uv}, \\scriptstyle q u + v,  and  can be expressed in terms of  and  as \\scriptstyle u \n q/2 + \\sqrt{(q/2)^2-(p/3)^3} and \\scriptstyle v q/2 - \\sqrt{(q/2)^2-(p/3)^3}, respectively. Therefore, \\scriptstyle x \n \\sqrt[3]{q/2 + \\sqrt{(q/2)^2-(p/3)^3}} + \\sqrt[3]{q/2 - \\sqrt{(q/2)^2-(p/3)^3}}. When \\scriptstyle (q/2)^2-(p/3)^3 is negative (casus irreducibilis), the second cube root should be regarded as the complex conjugate of the first one. gives the solution to the equation  as\n\n\\frac{1}{\\sqrt{3}}\\left((\\sqrt{-1})^{1/3}+\\frac{1}{(\\sqrt{-1})^{1/3}}\\right).\n\nAt first glance this looks like nonsense. However formal calculations with complex numbers show that the equation  has solutions , {\\scriptstyle\\frac{\\sqrt{3}}{2}}+{\\scriptstyle\\frac{1}{2}}i and {\\scriptstyle\\frac{-\\sqrt{3}}{2}}+{\\scriptstyle\\frac{1}{2}}i. Substituting these in turn for {\\scriptstyle\\sqrt{-1}^{1/3}} in Tartaglia's cubic formula and simplifying, one gets 0, 1 and −1 as the solutions of . Of course this particular equation can be solved at sight but it does illustrate that when general formulas are used to solve cubic equations with real roots then, as later mathematicians showed rigorously, the use of complex numbers is unavoidable. Rafael Bombelli was the first to explicitly address these seemingly paradoxical solutions of cubic equations and developed the rules for complex arithmetic trying to resolve these issues.\n\nThe term \"imaginary\" for these quantities was coined by René Descartes in 1637, although he was at pains to stress their imaginary nature\n\nA further source of confusion was that the equation \\scriptstyle \\sqrt{-1}^2\\sqrt{-1}\\sqrt{-1}\n-1 seemed to be capriciously inconsistent with the algebraic identity \\scriptstyle \\sqrt{a}\\sqrt{b}\\sqrt{ab}, which is valid for non-negative real numbers  and , and which was also used in complex number calculations with one of ,  positive and the other negative. The incorrect use of this identity (and the related identity \\scriptstyle \\frac{1}{\\sqrt{a}}\n\\sqrt{\\frac{1}{a}}) in the case when both  and  are negative even bedeviled Euler. This difficulty eventually led to the convention of using the special symbol  in place of  to guard against this mistake. Even so, Euler considered it natural to introduce students to complex numbers much earlier than we do today. In his elementary algebra text book, Elements of Algebra, he introduces these numbers almost at once and then uses them in a natural way throughout.\n\nIn the 18th century complex numbers gained wider use, as it was noticed that formal manipulation of complex expressions could be used to simplify calculations involving trigonometric functions. For instance, in 1730 Abraham de Moivre noted that the complicated identities relating trigonometric functions of an integer multiple of an angle to powers of trigonometric functions of that angle could be simply re-expressed by the following well-known formula which bears his name, de Moivre's formula:\n\n(\\cos \\theta + i\\sin \\theta)^{n} = \\cos n \\theta + i\\sin n \\theta. \\,\n\nIn 1748 Leonhard Euler went further and obtained Euler's formula of complex analysis:\n\n\\cos \\theta + i\\sin \\theta = e ^{i\\theta } \\,\n\nby formally manipulating complex power series and observed that this formula could be used to reduce any trigonometric identity to much simpler exponential identities.\n\nThe idea of a complex number as a point in the complex plane (above) was first described by Caspar Wessel in 1799, although it had been anticipated as early as 1685 in Wallis's De Algebra tractatus.\n\nWessel's memoir appeared in the Proceedings of the Copenhagen Academy but went largely unnoticed. In 1806 Jean-Robert Argand independently issued a pamphlet on complex numbers and provided a rigorous proof of the fundamental theorem of algebra. Carl Friedrich Gauss had earlier published an essentially topological proof of the theorem in 1797 but expressed his doubts at the time about \"the true metaphysics of the square root of −1\". It was not until 1831 that he overcame these doubts and published his treatise on complex numbers as points in the plane, largely establishing modern notation and terminology. In the beginning of the 19th century, other mathematicians discovered independently the geometrical representation of the complex numbers: Buée, Mourey, Warren, Français and his brother, Bellavitis. [https://books.google.com/books?idvoFsJ1EhCnYC&pg\nPA139 Extract of page 139]\n\nThe English mathematician G. H. Hardy remarked that Gauss was the first mathematician to use complex numbers in 'a really confident and scientific way' although mathematicians such as Niels Henrik Abel and Carl Gustav Jacob Jacobi were necessarily using them routinely before Gauss published his 1831 treatise. Augustin Louis Cauchy and Bernhard Riemann together brought the fundamental ideas of complex analysis to a high state of completion, commencing around 1825 in Cauchy's case.\n\nThe common terms used in the theory are chiefly due to the founders. Argand called \\scriptstyle \\cos \\phi + i\\sin \\phi the direction factor, and \\scriptstyle r = \\sqrt{a^2+b^2} the modulus; Cauchy (1828) called \\cos \\phi + i\\sin \\phi the reduced form (l'expression réduite) and apparently introduced the term argument; Gauss used  for \\scriptstyle \\sqrt{-1}, introduced the term complex number for , and called  the norm. The expression direction coefficient, often used for \\cos \\phi + i\\sin \\phi, is due to Hankel (1867), and absolute value, for modulus, is due to Weierstrass.\n\nLater classical writers on the general theory include Richard Dedekind, Otto Hölder, Felix Klein, Henri Poincaré, Hermann Schwarz, Karl Weierstrass and many others.\n\nGeneralizations and related notions\n\nThe process of extending the field R of reals to C is known as the Cayley–Dickson construction. It can be carried further to higher dimensions, yielding the quaternions H and octonions O which (as a real vector space) are of dimension 4 and 8, respectively.\nIn this context the complex numbers have been called the binarions.Kevin McCrimmon (2004) A Taste of Jordan Algebras, pp 64, Universitext, Springer  \n\nHowever, just as applying the construction to reals loses the property of ordering, more properties familiar from real and complex numbers vanish with increasing dimension. The quaternions are only a skew field, i.e. for some :  for two quaternions, the multiplication of octonions fails (in addition to not being commutative) to be associative: for some : .\n\nReals, complex numbers, quaternions and octonions are all normed division algebras over R. However, by Hurwitz's theorem they are the only ones. The next step in the Cayley–Dickson construction, the sedenions, in fact fails to have this structure.\n\nThe Cayley–Dickson construction is closely related to the regular representation of C, thought of as an R-algebra (an R-vector space with a multiplication), with respect to the basis . This means the following: the R-linear map\n\\mathbb{C} \\rightarrow \\mathbb{C}, z \\mapsto wz\nfor some fixed complex number  can be represented by a  matrix (once a basis has been chosen). With respect to the basis , this matrix is\n\n\\begin{pmatrix}\n  \\operatorname{Re}(w) & -\\operatorname{Im}(w) \\\\\n  \\operatorname{Im}(w) & \\;\\; \\operatorname{Re}(w)\n\\end{pmatrix}\n\ni.e., the one mentioned in the section on matrix representation of complex numbers above. While this is a linear representation of C in the 2 × 2 real matrices, it is not the only one. Any matrix\nJ \\begin{pmatrix}p & q \\\\ r & -p \\end{pmatrix}, \\quad p^2 + qr + 1 \n 0\nhas the property that its square is the negative of the identity matrix: . Then\n\\{ z = a I + b J : a,b \\in R \\}\nis also isomorphic to the field C, and gives an alternative complex structure on R2. This is generalized by the notion of a linear complex structure.\n\nHypercomplex numbers also generalize R, C, H, and O. For example, this notion contains the split-complex numbers, which are elements of the ring  (as opposed to ). In this ring, the equation  has four solutions.\n\nThe field R is the completion of Q, the field of rational numbers, with respect to the usual absolute value metric. Other choices of metrics on Q lead to the fields Qp of p-adic numbers (for any prime number p), which are thereby analogous to R. There are no other nontrivial ways of completing Q than R and Qp, by Ostrowski's theorem. The algebraic closures \\overline {\\mathbf{Q}_p} of Qp still carry a norm, but (unlike C) are not complete with respect to it. The completion \\mathbf{C}_p of \\overline {\\mathbf{Q}_p} turns out to be algebraically closed. This field is called p-adic complex numbers by analogy.\n\nThe fields R and Qp and their finite field extensions, including C, are local fields. Complex number. http://en.wikipedia.org/?curid=5826."
  }
}
