{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7541",
  "eid" : "e216e380-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778459064,
  "textBody" : "The City University of New York (CUNY; pron.:) is the public university system of New York City, and the largest urban university system in the United States. CUNY and the State University of New York (SUNY) are separate and independent university systems, despite the fact that both public institutions receive funding from New York State. CUNY, however, is located in only New York City, while SUNY is located in the entire state, including New York City.\n\nEnrollment and demographics\n\nCUNY is the third-largest university system in the United States, in terms of enrollment, behind the State University of New York (SUNY), and the California State University system.  More than 270,000-degree-credit students, continuing, and professional education students are enrolled at campuses located in all five New York City boroughs.\n\nThe university has one of the most diverse student bodies in the United States, with students hailing from 208 countries, but mostly from New York City. The black, white and Hispanic undergraduate populations each comprise more than a quarter of the student body, and Asian undergraduates make up 18 percent. Fifty-eight percent are female, and 28 percent are 25 or older.\n\nComponent institutions\n\nThe following table is 'sortable'; click on a column heading to re-sort the table by values of that column.\n\nFaculty\n\nCUNY employs 6,700 full-time faculty members and over 10,000 adjunct faculty members. Faculty and staff are represented by Professional Staff Congress (PSC), a labor union and chapter of the American Federation of Teachers.\n\nNotable faculty\n\n* William Bialek, biophysicist, Graduate Center\n* Edwin G. Burrows, historian and writer, Pulitzer Prize Winner, Distinguished Professor of History at Brooklyn College\n* Billy Collins, poet, U.S. Poet Laureate, Lehman College (retired)\n* John Corigliano, composer, Graduate Center\n* Michael Cunningham, writer, Pulitzer Prize winner, Distinguished Professor at Brooklyn College\n* Allen Ginsberg, poet, Distinguished Professor at Brooklyn College\n* Kimiko Hahn, poet, winner of PEN/Voelcker Award for Poetry, Queens College\n* David Harvey, geographer, Graduate Center\n* Tyehimba Jess, poet, winner of the Pulitzer Prize for Poetry, College of Staten Island\n* Michio Kaku, physicist, City College\n* Jane Katz, Olympian swimmer, John Jay College of Criminal Justice\n* Alfred Kazin, writer and critic, Distinguished Professor at Hunter College and Graduate Center\n* Saul Kripke, philosopher, Graduate Center\n* Irving Kristol, journalist, City College\n* Paul Krugman, economist, Distinguished Professor, Graduate Center\n* Ben Lerner, writer, MacArthur Fellow, Brooklyn College\n* Audre Lorde, poet and activist, City College, John Jay College of Criminal Justice, Distinguished Thomas Hunter Chair at Hunter College\n* Cate Marvin, poet, Guggenheim Fellowship winner, College of Staten Island\n* John Matteson, historian and writer, Pulitzer Prize winner, John Jay College of Criminal Justice\n* Stanley Milgram, social psychologist, Graduate Center\n* Itzhak Perlman, violinist\n* Graham Priest, philosopher, Graduate Center\n* David M. Rosenthal, philosopher, Graduate Center\n* Arthur M. Schlesinger Jr., historian and social critic, Graduate Center\n* Flora Rheta Schreiber, journalist, John Jay College of Criminal Justice\n* Dennis Sullivan, mathematician, Graduate Center\n* Mike Wallace, historian and writer, Distinguished Professor of History at John Jay College of Criminal Justice and Graduate Center\n* Elie Wiesel, novelist, political activist, Distinguished Professor of Judaic Studies at City College\n\nHistory\n\nFounding\n\nCUNY was created in 1961, by New York State legislation, signed into law by Governor Nelson Rockefeller. The legislation\nintegrated existing institutions and a new graduate school into a coordinated system of higher education for the city, under the control of the \"Board of Higher Education of the City of New York\", which had been created by New York State legislation in 1926. By 1979, the Board of Higher Education had become the \"Board of Trustees of the CUNY\".\n\nThe institutions that were merged in order to create CUNY were:\n\n* The Free Academy – Founded in 1847 by Townsend Harris, it was fashioned as \"a Free Academy for the purpose of extending the benefits of education gratuitously to persons who have been pupils in the common schools of the city and county of New York.\" The Free Academy later became the City College of New York.\n* The Female Normal and High School – Founded in 1870, and later renamed the Normal College. It would be renamed again in 1914 to Hunter College. During the early 20th century, Hunter College expanded into the Bronx, with what became Herbert Lehman College.Fitzpatrick, John. [http://www.answers.com/topic/city-university-of-new-york \"City University of New York\"] U.S. History Encyclopedia\n* Brooklyn College – Founded in 1930.\n* Queens College – Founded in 1937.\n\nAccessible education\n\nCUNY has served a diverse student body, especially those excluded from or unable to afford private universities. Its four-year colleges offered a high quality, tuition-free education to the poor, the working class and the immigrants of New York City who met the grade requirements for matriculated status. During the post-World War I era, when some Ivy League universities, such as Yale University, discriminated against Jews, many Jewish academics and intellectuals studied and taught at CUNY. The City College of New York developed a reputation of being \"the Harvard of the proletariat.\"\n\nAs New York City's population—and public college enrollment—grew during the early 20th century and the city struggled for resources, the municipal colleges slowly began adopting selective tuition, also known as instructional fees, for a handful of courses and programs. During the Great Depression, with funding for the public colleges severely constrained, limits were imposed on the size of the colleges' free Day Session, and tuition was imposed upon students deemed \"competent\" but not academically qualified for the day program.  Most of these \"limited matriculation\" students enrolled in the Evening Session, and paid tuition.\n\nDemand in the United States for higher education rapidly grew after World War II, and during the mid-1940s a movement began to create community colleges to provide accessible education and training. In New York City, however, the community-college movement was constrained by many factors including \"financial problems, narrow perceptions of responsibility, organizational weaknesses, adverse political factors, and another competing priorities.\"\n\nCommunity colleges would have drawn from the same city coffers that were funding the senior colleges, and city higher education officials were of the view that the state should finance them. It wasn't until 1955, under a shared-funding arrangement with New York State, that New York City established its first community college, on Staten Island. Unlike the day college students attending the city's public baccalaureate colleges for free, the community college students had to pay tuition fees under the state-city funding formula. Community college students paid tuition fees for approximately 10 years.\n\nOver time, tuition fees for limited-matriculated students became an important source of system revenues. In fall 1957, for example, nearly 36,000 attended Hunter, Brooklyn, Queens and City Colleges for free, but another 24,000 paid tuition fees of up to $300 a year – the equivalent of $2,413 in 2011.  Undergraduate tuition and other student fees in 1957 comprised 17 percent of the colleges' $46.8 million in revenues, about $7.74 million — a figure equivalent to $62.4 million in 2011 buying power.\n\nThree community colleges had been established by early 1961, when New York City's public colleges were codified by the state as a single university with a chancellor at the helm and an infusion of state funds. But the city's slowness in creating the community colleges as demand for college seats was intensifying, had resulted in mounting frustration, particularly on the part of minorities, that college opportunities were not available to them.\n\nIn 1964, as New York City's Board of Higher Education moved to take full responsibility for the community colleges, city officials extended the senior colleges' free tuition policy to them, a change that was included by Mayor Robert Wagner in his budget plans and took effect with the 1964–65 academic year.\n\nIn 1969, a group of Black and Puerto Rican students occupied City College demanding the racial integration of CUNY, which at the time had an overwhelmingly white student body.\n\nStudent protests\n\nStudents at some campuses became increasingly frustrated with the university's and Board of Higher Education's handling of university administration. At Baruch College in 1967, over a thousand students protested the plan to make the college an upper-division school limited to junior, senior, and graduate students. At Brooklyn College in 1968, students attempted a sit-in to demand the admission of more black and Puerto Rican students and additional black studies curriculum. Students at Hunter College also demanded a Black studies program. Members of the SEEK program, which provided academic support for underprepared and underprivileged students, staged a building takeover at Queens College in 1969 to protest the decisions of the program's director, who would later be replaced by a black professor. Puerto Rican students at Bronx Community College filed a report with the New York State Division of Human Rights in 1970, contending that the intellectual level of the college was inferior and discriminatory. Hunter College was crippled for several days by a protest of 2,000 students who had a list of demands focusing on more student representation in college administration. Across CUNY, students boycotted their campuses in 1970 to protest a rise in student fees and other issues, including the proposed (and later implemented) open admissions plan.\n\nLike many college campuses in 1970, CUNY faced a number of protests and demonstrations after the Kent State shootings and Cambodian Campaign. The Administrative Council of the City University of New York sent U.S. President Richard Nixon a telegram in 1970 stating, \"No nation can long endure the alienation of the best of its young people.\" Some colleges, including John Jay College of Criminal Justice, historically the \"college for cops,\" held teach-ins in addition to student and faculty protests.\n\nOpen admissions\n\nIn 1969, the Board of Trustees implemented a new admissions policy. The doors to CUNY were opened wide to all those demanding entrance, assuring all high school graduates entrance to the university without having to fulfill traditional requirements such as exams or grades. This policy was known as open admissions and nearly doubled the number of students enrolling in the CUNY system to 35,000 (compared to 20,000 the year before). With greater numbers came more diversity: Black and Hispanic student enrollment increased threefold. Remedial education, to supplement the training of under-prepared students, became a significant part of CUNY's offerings.\n\nFinancial crisis of 1976\n\nIn fall 1976, during New York City's fiscal crisis, the free tuition policy was discontinued under pressure from the federal government, the financial community that had a role in rescuing the city from bankruptcy, and New York State, which would take over the funding of CUNY's senior colleges. Tuition, which had been in place in the State University of New York system since 1963, was instituted at all CUNY colleges.\n\nMeanwhile, CUNY students were added to the state's need-based Tuition Assistance Program (TAP), which had been created to help private colleges. Full-time students who met the income eligibility criteria were permitted to receive TAP, ensuring for the first time that financial hardship would deprive no CUNY student of a college education. Within a few years, the federal government would create its own need-based program, known as Pell Grants, providing the neediest students with a tuition-free college education. By 2011, nearly six of ten full- time undergraduates qualified for a tuition-free education at CUNY due in large measure to state, federal and CUNY financial aid programs. CUNY's enrollment dipped after tuition was re-established, and there were further enrollment declines through the 1980s and into the 1990s.\n\nFinancial crisis of 1995\n\nIn 1995, CUNY suffered another fiscal crisis when Governor George Pataki proposed a drastic cut in state financing. Faculty cancelled classes and students staged protests. By May, CUNY adopted deep cuts to college budgets and class offerings. By June, in order to save money spent on remedial programs, CUNY adopted a stricter admissions policy for its senior colleges: students deemed unprepared for college would not be admitted, this a departure from the 1970 Open Admissions program. That year's final state budget cut funding by $102 million, which CUNY absorbed by increasing tuition by $750 and offering a retirement incentive plan for faculty.\n\nIn 1999, a task force appointed by Mayor Rudolph Giuliani issued a report that described CUNY as \"an institution adrift\" and called for an improved, more cohesive university structure and management, as well as more consistent academic standards. Following the report, Matthew Goldstein, a mathematician and City College graduate who had led CUNY's Baruch College and briefly, Adelphi University, was appointed chancellor. CUNY ended its policy of open admissions to its four-year colleges, raised its admissions standards at its most selective four-year colleges (Baruch, Brooklyn, City, Hunter and Queens), and required new-enrollees who needed remediation, to begin their studies at a CUNY open-admissions community college.\n\n2010 onwards\n\nCUNY's enrollment of degree-credit students reached 220,727 in 2005 and 262,321 in 2010 as the university broadened its academic offerings. The university added more than 2,000 full-time faculty positions, opened new schools and programs, and expanded the university's fundraising efforts to help pay for them. Fundraising increased from $35 million in 2000 to more than $200 million in 2012.\n\nAs of Autumn 2013, all CUNY undergraduates are required to take an administration-dictated common core of courses which have been claimed to meet specific \"learning outcomes\" or standards. Since the courses are accepted University wide, the administration claims it will be easier for students to transfer course credits between CUNY colleges. It also reduced the number of core courses some CUNY colleges had required, to a level below national norms, particularly in the sciences. The program is the target of several lawsuits by students and faculty, and was the subject of a \"no confidence\" vote by the faculty, who rejected it by an overwhelming 92% margin.\n\nChancellor Goldstein retired on July 1, 2013, and was replaced on June 1, 2014 by James Milliken, president of the University of Nebraska, and a graduate of University of Nebraska and New York University Law School. Milliken is retiring at the end of the 2017-18 academic year and a search for a replacement was underway as of February 2018. http://www1.cuny.edu/mu/forum/2018/02/07/cuny-trustees-launch-search-for-new-chancellor/\n\nManagement structure\n\nThe forerunner of today's City University of New York was governed by the Board of Education of New York City. Members of the Board of Education, chaired by the President of the board, served as ex officio trustees.  For the next four decades, the board members continued to serve as ex officio trustees of the College of the City of New York and the city's other municipal college, the Normal College of the City of New York.\n\nIn 1900, the New York State Legislature created separate boards of trustees for the College of the City of New York and the Normal College, which became Hunter College in 1914.  In 1926, the Legislature established the Board of Higher Education of the City of New York, which assumed supervision of both municipal colleges.\n\nIn 1961, the New York State Legislature established the City University of New York, uniting what had become seven municipal colleges at the time: the City College of New York, Hunter College, Brooklyn College, Queens College, Staten Island Community College, Bronx Community College and Queensborough Community College. In 1979, the CUNY Financing and Governance Act was adopted by the State and the Board of Higher Education became the City University of New York Board of Trustees.\n\nToday, the City University is governed by the Board of Trustees composed of 17 members, ten of whom are appointed by the Governor of New York \"with the advice and consent of the senate,\" and five by the Mayor of New York City \"with the advice and consent of the senate.\" The final two trustees are ex officio members. One is the chair of the university's student senate, and the other is non-voting and is the chair of the university's faculty senate. Both the mayoral and gubernatorial appointments to the CUNY Board are required to include at least one resident of each of New York City's five boroughs. Trustees serve seven-year terms, which are renewable for another seven years. The Chancellor is elected by the Board of Trustees, and is the \"chief educational and administrative officer\" of the City University.\n\nThe administrative offices are in mid-town Manhattan.\"[http://www.cuny.edu/about/administration/offices.html Administrative Offices].\" City University of New York. Retrieved on May 4, 2010.\n\nChairs of the board\n\n* 1847 Townsend Harris\n* 1848 Robert Kelly\n* 1850 Erastus C. Benedict\n* 1855 William H. Neilson\n* 1856 Andrew H. Green\n* 1858 William H. Neilson\n* 1859 Richard Warren\n* 1860 William E. Curtis\n* 1864 James M. McLean\n* 1868 Richard L. Larremore\n* 1870 Bernard Smyth\n* 1873 Josiah Gilbert Holland\n* 1874 William H. Neilson\n* 1876 William Wood\n* 1880 Stephen A. Walker\n* 1886 J. Edward Simmons\n* 1890 John L.N. Hunt\n* 1893 Adolph Sanger\n* 1894 Charles H. Knox\n* 1895 Robert Maclay (merchant)\n* 1897 Charles Bulkley Hubbell\n* 1899 J. Edward Swanstrom / Joseph J. Little\n* 1901 Miles M. O'Brien\n* 1902 Edward Lauterback / Charles C. Burlingham\n* 1903 Henry A. Rogers\n* 1904 Edward M. Shepard \n* 1905 Henry N. Tifft \n* 1906 Egerton L. Winthrop, Jr.\n* 1911 Theodore F. Miller\n* 1913 Frederick P. Bellamy / Thomas Winston Churchill\n* 1914 Charles Edward Lydecker \n* 1915 Paul Fuller\n* 1916 George McAneny / Edward J. McGuire\n* 1919 William G. Willcox\n* 1921 Thomas Winston Churchill\n* 1923 Edward Swann / Edward C. McParlan\n* 1924 Harry P. Swift\n* 1926 Moses J. Strook\n* 1931 Charles H. Tuttle\n* 1932 Mark Eisner\n* 1938 Ordway Tead\n* 1953 Joseph Cavallaro\n* 1957 Gustave G. Rosenberg\n* 1966 Porter R. Chandler\n* 1971 Luis Quero-Chiesa\n* 1974 Alfred A. Giardino\n* 1976 Harold M. Jacobs\n* 1980 James Murphy\n* 1997 Ann Paolucci\n* 1999 Herman Badillo\n* 2001 Benno C. Schmidt Jr.\n* 2016 Bill Thompson\n\nPublic Safety Department\n\nCUNY has its own public safety force whose duties are to protect and serve all students and faculty members, and enforce all state and city laws at all of CUNY's universities. The force has more than 1000 officers, making it one of the largest public safety forces in New York City.\n\nThe Public Safety Department came under heavy criticism, from student groups, after several students protesting tuition increases tried to occupy the lobby of the Baruch College. The occupiers were forcibly removed from the area and several were arrested on November 21, 2011.\n\nCity University Television (CUNY TV)\n\nCUNY also has a broadcast TV service, CUNY TV (channel 75 on Time Warner cable, digital HD broadcast channel 25.3),  which airs telecourses, classic and foreign films, magazine shows and panel discussions in foreign languages.\n\nCity University Film Festival (CUFF)\n\nCUFF is CUNY's official film festival. The festival was founded in 2009 by Hunter College student Daniel Cowen.\n\nNotable alumni\n\nCUNY graduates include 13 Nobel laureates, a Fields Medalist, a U.S. Secretary of State, a Supreme Court Justice, several New York City mayors, members of Congress, state legislators, scientists and artists.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "City University of New York" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7541" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The City University of New York (CUNY; pron.:) is the public university system of New York City, and the largest urban university system in the United States. CUNY and the State University of New York (SUNY) are separate and independent university systems, despite the fact that both public institutions receive funding from New York State. CUNY, however, is located in only New York City, while SUNY is located in the entire state, including New York City.\n\nEnrollment and demographics\n\nCUNY is the third-largest university system in the United States, in terms of enrollment, behind the State University of New York (SUNY), and the California State University system.  More than 270,000-degree-credit students, continuing, and professional education students are enrolled at campuses located in all five New York City boroughs.\n\nThe university has one of the most diverse student bodies in the United States, with students hailing from 208 countries, but mostly from New York City. The black, white and Hispanic undergraduate populations each comprise more than a quarter of the student body, and Asian undergraduates make up 18 percent. Fifty-eight percent are female, and 28 percent are 25 or older.\n\nComponent institutions\n\nThe following table is 'sortable'; click on a column heading to re-sort the table by values of that column.\n\nFaculty\n\nCUNY employs 6,700 full-time faculty members and over 10,000 adjunct faculty members. Faculty and staff are represented by Professional Staff Congress (PSC), a labor union and chapter of the American Federation of Teachers.\n\nNotable faculty\n\n* William Bialek, biophysicist, Graduate Center\n* Edwin G. Burrows, historian and writer, Pulitzer Prize Winner, Distinguished Professor of History at Brooklyn College\n* Billy Collins, poet, U.S. Poet Laureate, Lehman College (retired)\n* John Corigliano, composer, Graduate Center\n* Michael Cunningham, writer, Pulitzer Prize winner, Distinguished Professor at Brooklyn College\n* Allen Ginsberg, poet, Distinguished Professor at Brooklyn College\n* Kimiko Hahn, poet, winner of PEN/Voelcker Award for Poetry, Queens College\n* David Harvey, geographer, Graduate Center\n* Tyehimba Jess, poet, winner of the Pulitzer Prize for Poetry, College of Staten Island\n* Michio Kaku, physicist, City College\n* Jane Katz, Olympian swimmer, John Jay College of Criminal Justice\n* Alfred Kazin, writer and critic, Distinguished Professor at Hunter College and Graduate Center\n* Saul Kripke, philosopher, Graduate Center\n* Irving Kristol, journalist, City College\n* Paul Krugman, economist, Distinguished Professor, Graduate Center\n* Ben Lerner, writer, MacArthur Fellow, Brooklyn College\n* Audre Lorde, poet and activist, City College, John Jay College of Criminal Justice, Distinguished Thomas Hunter Chair at Hunter College\n* Cate Marvin, poet, Guggenheim Fellowship winner, College of Staten Island\n* John Matteson, historian and writer, Pulitzer Prize winner, John Jay College of Criminal Justice\n* Stanley Milgram, social psychologist, Graduate Center\n* Itzhak Perlman, violinist\n* Graham Priest, philosopher, Graduate Center\n* David M. Rosenthal, philosopher, Graduate Center\n* Arthur M. Schlesinger Jr., historian and social critic, Graduate Center\n* Flora Rheta Schreiber, journalist, John Jay College of Criminal Justice\n* Dennis Sullivan, mathematician, Graduate Center\n* Mike Wallace, historian and writer, Distinguished Professor of History at John Jay College of Criminal Justice and Graduate Center\n* Elie Wiesel, novelist, political activist, Distinguished Professor of Judaic Studies at City College\n\nHistory\n\nFounding\n\nCUNY was created in 1961, by New York State legislation, signed into law by Governor Nelson Rockefeller. The legislation\nintegrated existing institutions and a new graduate school into a coordinated system of higher education for the city, under the control of the \"Board of Higher Education of the City of New York\", which had been created by New York State legislation in 1926. By 1979, the Board of Higher Education had become the \"Board of Trustees of the CUNY\".\n\nThe institutions that were merged in order to create CUNY were:\n\n* The Free Academy – Founded in 1847 by Townsend Harris, it was fashioned as \"a Free Academy for the purpose of extending the benefits of education gratuitously to persons who have been pupils in the common schools of the city and county of New York.\" The Free Academy later became the City College of New York.\n* The Female Normal and High School – Founded in 1870, and later renamed the Normal College. It would be renamed again in 1914 to Hunter College. During the early 20th century, Hunter College expanded into the Bronx, with what became Herbert Lehman College.Fitzpatrick, John. [http://www.answers.com/topic/city-university-of-new-york \"City University of New York\"] U.S. History Encyclopedia\n* Brooklyn College – Founded in 1930.\n* Queens College – Founded in 1937.\n\nAccessible education\n\nCUNY has served a diverse student body, especially those excluded from or unable to afford private universities. Its four-year colleges offered a high quality, tuition-free education to the poor, the working class and the immigrants of New York City who met the grade requirements for matriculated status. During the post-World War I era, when some Ivy League universities, such as Yale University, discriminated against Jews, many Jewish academics and intellectuals studied and taught at CUNY. The City College of New York developed a reputation of being \"the Harvard of the proletariat.\"\n\nAs New York City's population—and public college enrollment—grew during the early 20th century and the city struggled for resources, the municipal colleges slowly began adopting selective tuition, also known as instructional fees, for a handful of courses and programs. During the Great Depression, with funding for the public colleges severely constrained, limits were imposed on the size of the colleges' free Day Session, and tuition was imposed upon students deemed \"competent\" but not academically qualified for the day program.  Most of these \"limited matriculation\" students enrolled in the Evening Session, and paid tuition.\n\nDemand in the United States for higher education rapidly grew after World War II, and during the mid-1940s a movement began to create community colleges to provide accessible education and training. In New York City, however, the community-college movement was constrained by many factors including \"financial problems, narrow perceptions of responsibility, organizational weaknesses, adverse political factors, and another competing priorities.\"\n\nCommunity colleges would have drawn from the same city coffers that were funding the senior colleges, and city higher education officials were of the view that the state should finance them. It wasn't until 1955, under a shared-funding arrangement with New York State, that New York City established its first community college, on Staten Island. Unlike the day college students attending the city's public baccalaureate colleges for free, the community college students had to pay tuition fees under the state-city funding formula. Community college students paid tuition fees for approximately 10 years.\n\nOver time, tuition fees for limited-matriculated students became an important source of system revenues. In fall 1957, for example, nearly 36,000 attended Hunter, Brooklyn, Queens and City Colleges for free, but another 24,000 paid tuition fees of up to $300 a year – the equivalent of $2,413 in 2011.  Undergraduate tuition and other student fees in 1957 comprised 17 percent of the colleges' $46.8 million in revenues, about $7.74 million — a figure equivalent to $62.4 million in 2011 buying power.\n\nThree community colleges had been established by early 1961, when New York City's public colleges were codified by the state as a single university with a chancellor at the helm and an infusion of state funds. But the city's slowness in creating the community colleges as demand for college seats was intensifying, had resulted in mounting frustration, particularly on the part of minorities, that college opportunities were not available to them.\n\nIn 1964, as New York City's Board of Higher Education moved to take full responsibility for the community colleges, city officials extended the senior colleges' free tuition policy to them, a change that was included by Mayor Robert Wagner in his budget plans and took effect with the 1964–65 academic year.\n\nIn 1969, a group of Black and Puerto Rican students occupied City College demanding the racial integration of CUNY, which at the time had an overwhelmingly white student body.\n\nStudent protests\n\nStudents at some campuses became increasingly frustrated with the university's and Board of Higher Education's handling of university administration. At Baruch College in 1967, over a thousand students protested the plan to make the college an upper-division school limited to junior, senior, and graduate students. At Brooklyn College in 1968, students attempted a sit-in to demand the admission of more black and Puerto Rican students and additional black studies curriculum. Students at Hunter College also demanded a Black studies program. Members of the SEEK program, which provided academic support for underprepared and underprivileged students, staged a building takeover at Queens College in 1969 to protest the decisions of the program's director, who would later be replaced by a black professor. Puerto Rican students at Bronx Community College filed a report with the New York State Division of Human Rights in 1970, contending that the intellectual level of the college was inferior and discriminatory. Hunter College was crippled for several days by a protest of 2,000 students who had a list of demands focusing on more student representation in college administration. Across CUNY, students boycotted their campuses in 1970 to protest a rise in student fees and other issues, including the proposed (and later implemented) open admissions plan.\n\nLike many college campuses in 1970, CUNY faced a number of protests and demonstrations after the Kent State shootings and Cambodian Campaign. The Administrative Council of the City University of New York sent U.S. President Richard Nixon a telegram in 1970 stating, \"No nation can long endure the alienation of the best of its young people.\" Some colleges, including John Jay College of Criminal Justice, historically the \"college for cops,\" held teach-ins in addition to student and faculty protests.\n\nOpen admissions\n\nIn 1969, the Board of Trustees implemented a new admissions policy. The doors to CUNY were opened wide to all those demanding entrance, assuring all high school graduates entrance to the university without having to fulfill traditional requirements such as exams or grades. This policy was known as open admissions and nearly doubled the number of students enrolling in the CUNY system to 35,000 (compared to 20,000 the year before). With greater numbers came more diversity: Black and Hispanic student enrollment increased threefold. Remedial education, to supplement the training of under-prepared students, became a significant part of CUNY's offerings.\n\nFinancial crisis of 1976\n\nIn fall 1976, during New York City's fiscal crisis, the free tuition policy was discontinued under pressure from the federal government, the financial community that had a role in rescuing the city from bankruptcy, and New York State, which would take over the funding of CUNY's senior colleges. Tuition, which had been in place in the State University of New York system since 1963, was instituted at all CUNY colleges.\n\nMeanwhile, CUNY students were added to the state's need-based Tuition Assistance Program (TAP), which had been created to help private colleges. Full-time students who met the income eligibility criteria were permitted to receive TAP, ensuring for the first time that financial hardship would deprive no CUNY student of a college education. Within a few years, the federal government would create its own need-based program, known as Pell Grants, providing the neediest students with a tuition-free college education. By 2011, nearly six of ten full- time undergraduates qualified for a tuition-free education at CUNY due in large measure to state, federal and CUNY financial aid programs. CUNY's enrollment dipped after tuition was re-established, and there were further enrollment declines through the 1980s and into the 1990s.\n\nFinancial crisis of 1995\n\nIn 1995, CUNY suffered another fiscal crisis when Governor George Pataki proposed a drastic cut in state financing. Faculty cancelled classes and students staged protests. By May, CUNY adopted deep cuts to college budgets and class offerings. By June, in order to save money spent on remedial programs, CUNY adopted a stricter admissions policy for its senior colleges: students deemed unprepared for college would not be admitted, this a departure from the 1970 Open Admissions program. That year's final state budget cut funding by $102 million, which CUNY absorbed by increasing tuition by $750 and offering a retirement incentive plan for faculty.\n\nIn 1999, a task force appointed by Mayor Rudolph Giuliani issued a report that described CUNY as \"an institution adrift\" and called for an improved, more cohesive university structure and management, as well as more consistent academic standards. Following the report, Matthew Goldstein, a mathematician and City College graduate who had led CUNY's Baruch College and briefly, Adelphi University, was appointed chancellor. CUNY ended its policy of open admissions to its four-year colleges, raised its admissions standards at its most selective four-year colleges (Baruch, Brooklyn, City, Hunter and Queens), and required new-enrollees who needed remediation, to begin their studies at a CUNY open-admissions community college.\n\n2010 onwards\n\nCUNY's enrollment of degree-credit students reached 220,727 in 2005 and 262,321 in 2010 as the university broadened its academic offerings. The university added more than 2,000 full-time faculty positions, opened new schools and programs, and expanded the university's fundraising efforts to help pay for them. Fundraising increased from $35 million in 2000 to more than $200 million in 2012.\n\nAs of Autumn 2013, all CUNY undergraduates are required to take an administration-dictated common core of courses which have been claimed to meet specific \"learning outcomes\" or standards. Since the courses are accepted University wide, the administration claims it will be easier for students to transfer course credits between CUNY colleges. It also reduced the number of core courses some CUNY colleges had required, to a level below national norms, particularly in the sciences. The program is the target of several lawsuits by students and faculty, and was the subject of a \"no confidence\" vote by the faculty, who rejected it by an overwhelming 92% margin.\n\nChancellor Goldstein retired on July 1, 2013, and was replaced on June 1, 2014 by James Milliken, president of the University of Nebraska, and a graduate of University of Nebraska and New York University Law School. Milliken is retiring at the end of the 2017-18 academic year and a search for a replacement was underway as of February 2018. http://www1.cuny.edu/mu/forum/2018/02/07/cuny-trustees-launch-search-for-new-chancellor/\n\nManagement structure\n\nThe forerunner of today's City University of New York was governed by the Board of Education of New York City. Members of the Board of Education, chaired by the President of the board, served as ex officio trustees.  For the next four decades, the board members continued to serve as ex officio trustees of the College of the City of New York and the city's other municipal college, the Normal College of the City of New York.\n\nIn 1900, the New York State Legislature created separate boards of trustees for the College of the City of New York and the Normal College, which became Hunter College in 1914.  In 1926, the Legislature established the Board of Higher Education of the City of New York, which assumed supervision of both municipal colleges.\n\nIn 1961, the New York State Legislature established the City University of New York, uniting what had become seven municipal colleges at the time: the City College of New York, Hunter College, Brooklyn College, Queens College, Staten Island Community College, Bronx Community College and Queensborough Community College. In 1979, the CUNY Financing and Governance Act was adopted by the State and the Board of Higher Education became the City University of New York Board of Trustees.\n\nToday, the City University is governed by the Board of Trustees composed of 17 members, ten of whom are appointed by the Governor of New York \"with the advice and consent of the senate,\" and five by the Mayor of New York City \"with the advice and consent of the senate.\" The final two trustees are ex officio members. One is the chair of the university's student senate, and the other is non-voting and is the chair of the university's faculty senate. Both the mayoral and gubernatorial appointments to the CUNY Board are required to include at least one resident of each of New York City's five boroughs. Trustees serve seven-year terms, which are renewable for another seven years. The Chancellor is elected by the Board of Trustees, and is the \"chief educational and administrative officer\" of the City University.\n\nThe administrative offices are in mid-town Manhattan.\"[http://www.cuny.edu/about/administration/offices.html Administrative Offices].\" City University of New York. Retrieved on May 4, 2010.\n\nChairs of the board\n\n* 1847 Townsend Harris\n* 1848 Robert Kelly\n* 1850 Erastus C. Benedict\n* 1855 William H. Neilson\n* 1856 Andrew H. Green\n* 1858 William H. Neilson\n* 1859 Richard Warren\n* 1860 William E. Curtis\n* 1864 James M. McLean\n* 1868 Richard L. Larremore\n* 1870 Bernard Smyth\n* 1873 Josiah Gilbert Holland\n* 1874 William H. Neilson\n* 1876 William Wood\n* 1880 Stephen A. Walker\n* 1886 J. Edward Simmons\n* 1890 John L.N. Hunt\n* 1893 Adolph Sanger\n* 1894 Charles H. Knox\n* 1895 Robert Maclay (merchant)\n* 1897 Charles Bulkley Hubbell\n* 1899 J. Edward Swanstrom / Joseph J. Little\n* 1901 Miles M. O'Brien\n* 1902 Edward Lauterback / Charles C. Burlingham\n* 1903 Henry A. Rogers\n* 1904 Edward M. Shepard \n* 1905 Henry N. Tifft \n* 1906 Egerton L. Winthrop, Jr.\n* 1911 Theodore F. Miller\n* 1913 Frederick P. Bellamy / Thomas Winston Churchill\n* 1914 Charles Edward Lydecker \n* 1915 Paul Fuller\n* 1916 George McAneny / Edward J. McGuire\n* 1919 William G. Willcox\n* 1921 Thomas Winston Churchill\n* 1923 Edward Swann / Edward C. McParlan\n* 1924 Harry P. Swift\n* 1926 Moses J. Strook\n* 1931 Charles H. Tuttle\n* 1932 Mark Eisner\n* 1938 Ordway Tead\n* 1953 Joseph Cavallaro\n* 1957 Gustave G. Rosenberg\n* 1966 Porter R. Chandler\n* 1971 Luis Quero-Chiesa\n* 1974 Alfred A. Giardino\n* 1976 Harold M. Jacobs\n* 1980 James Murphy\n* 1997 Ann Paolucci\n* 1999 Herman Badillo\n* 2001 Benno C. Schmidt Jr.\n* 2016 Bill Thompson\n\nPublic Safety Department\n\nCUNY has its own public safety force whose duties are to protect and serve all students and faculty members, and enforce all state and city laws at all of CUNY's universities. The force has more than 1000 officers, making it one of the largest public safety forces in New York City.\n\nThe Public Safety Department came under heavy criticism, from student groups, after several students protesting tuition increases tried to occupy the lobby of the Baruch College. The occupiers were forcibly removed from the area and several were arrested on November 21, 2011.\n\nCity University Television (CUNY TV)\n\nCUNY also has a broadcast TV service, CUNY TV (channel 75 on Time Warner cable, digital HD broadcast channel 25.3),  which airs telecourses, classic and foreign films, magazine shows and panel discussions in foreign languages.\n\nCity University Film Festival (CUFF)\n\nCUFF is CUNY's official film festival. The festival was founded in 2009 by Hunter College student Daniel Cowen.\n\nNotable alumni\n\nCUNY graduates include 13 Nobel laureates, a Fields Medalist, a U.S. Secretary of State, a Supreme Court Justice, several New York City mayors, members of Congress, state legislators, scientists and artists. City University of New York. http://en.wikipedia.org/?curid=7541."
  }
}
