{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19496",
  "eid" : "3b200290-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778608441,
  "textBody" : "Mahjong ( ,) is a tile-based game which was developed in China since the Qing dynasty and has further developed throughout the world since the early 20th century. It is commonly played by four players (with some three-player variations found in South Korea, Japan and Southeast Asia).  The game and its regional variants are widely played throughout Asia (especially in the Eastern and South Eastern Asia) and have materialized into an Asian culture in relation to its high degree of influence, in addition, they have also been increasingly regarded as a popular pastime and entertainment among Western countries and other parts of the world. Due to its influence and popularity, the game has been adapted into a widespread online entertainment. Similar to the Western card game rummy, Mahjong is a game of skill, strategy, and calculation and involves a degree of chance.\n\nThe game is played with a set of 144 tiles based on Chinese characters and symbols, although some regional variations may omit some tiles and/or add unique tiles. In most variations, each player begins by receiving 13 tiles. In turn players draw and discard tiles until they complete a legal hand using the 14th drawn tile to form 4 melds (or sets) and a pair (eye). A player can also win with a small class of special hands. There are fairly standard rules about how a piece is drawn, how a piece is robbed from another player, the use of simples (numbered tiles) and honors (winds and dragons), the kinds of melds allowed, how to deal the tiles and the order of play. Despite these similarities, there are many regional variations to the rules including rather different scoring systems, criteria for legal winning hands and even private table rules which distinguish some variations as notably different styles of mahjong.\n\nName \n\nIn Chinese, the game was originally called 麻雀 ()meaning sparrow which is still used in some southern dialects. Most Mandarin-speaking Chinese now call the game 麻将（májiàng）, which is a homonym of one way to refer to sesame paste. It is pronounced mah-ZHONG in English which is an approximation of the pronunciation in Mandarin.\n\nOld Hong Kong Mahjong \n\n \nThere are many highly varied versions of mahjong both in rules and tiles used. \"Old Hong Kong Mahjong\" uses the same basic features and rules as the majority of the different variations of the game. This form of Mahjong uses all of the tiles of the most commonly available sets, includes no exotic complex rules and has a relatively small set of scoring sets/hands with a simple scoring system. For these reasons Hong Kong mahjong is a suitable variation for the introduction of game rules and play and is the focus of this article.\n\nGame Pieces and Accessories \n\nOld Hong Kong Mahjong is played with a standard set of Mahjong tiles (though cards may be used). Sets often include counters (to keep score), dice (to decide how to deal) and a marker to show who the dealer is and which round is being played. Some sets include racks to hold the tiles, especially if they are larger/smaller than standard tiles or have an odd shape.\n\nA set of Mahjong tiles usually has at least 136 tiles (most commonly 144). Although, sets originating from the United States or Southeast Asia will probably have more. Mahjong tiles are split into 3 categories: Suits, Honors, and Bonuses.\n\nSimples tiles \n\nThere are 3 different suits of simples and in each suit the tiles are numbered from 1 to 9. The suits are: bamboos, dots and characters. There are 4 identical copies of each simples tile totaling 108 simples tiles.\n\nHonors tiles \n\nThere are two different sets of Honors tiles: Winds and Dragons. The Winds are East, South, West and North. In Mahjong East (not North) is the beginning. The Dragons are Red, Green and White. The white dragon has a blue or black frame on the face of the piece or in some sets is entirely blank. These tiles have no numerical sequence like the simples (for example the bamboo pieces number 1 to 9).\n\nBonus tiles \n\nThere are two sets of bonus tiles: Flowers and Seasons. The flower and season tiles are unique not only in playing different roles in the mechanics of the game, but also in their being represented by only one tile, rather than four copies: there are a total of four flower and four season tiles in the set. The tiles have a different artistic rendering of a specific type of flower or season. These tiles are not drawn into a player's hand but are set aside (kept near the player's other tiles for scoring purposes should they win the hand) when drawn and an extra tile is drawn in replacement of the bonus tile.\n\nWhile it is not necessary to know the names of the bonus tiles (only its number) the flowers are named: 1. Plum, 2. Orchid, 3. Chrysanthemum, 4. Bamboo. There is no relation between the bonus tiles \"bamboo\" flower and the set of simple tiles (ex. 2 bamboo). The seasons are named 1. Spring, 2. Summer, 3. Autumn, 4. Winter.\nIn traditional Chinese culture, the plum, orchid, chrysanthemum and bamboo are collectively known as the Four Gentlemen and are regarded as the respective representative plants of Winter, Spring, Autumn and Summer.\n\nChoosing table positions and first dealer \n\nThe dealer is chosen by various means, either by throwing dice (the highest total takes the east wind), by placing one of each wind face down and having each player randomly select one of these tiles or other house rule variations. Each player sits down at their respective position (called the wind position) at the table in positions of an inverted compass: East is dealer, the right of the dealer is South, across is West and the left is North. The order essentially is counter-clockwise.\n\nHands, rounds, and matches \n\nA match consists of four rounds, each representing a \"prevailing wind,\" starting with East. Once the first round is completed, a second round begins with South as the prevailing wind, and so on. Wind position is significant in that it affects the scoring of the game. A Mahjong set with Winds in play will usually include a separate prevailing wind marker (typically a die marked with the Wind characters in a holder).\n\nIn each round at least four hands are played, with each player taking the position of dealer. In the first hand of each round, Player 1 (winner of the dice toss) is East and therefore dealer. In the second hand, Player 2 takes the East position, shifting the seat winds amongst the players counterclockwise (though players don't physically move their chairs). This continues until all four players have been East (dealer). A marker is used to mark which player is East and often the round number. (In sets with racks, a rack may be marked differently to denote the dealer.)\n\nWhenever a player in the East position (dealer) wins a hand, or if there is no winner (a draw or \"goulash hand\"), an extra hand is played with the same seating positions and prevailing wind as in the previous hand. This means that a match may potentially have no limit to the number of hands played (though some players will set a limit of three consecutive hands allowed with the same seat positions and prevailing wind).\n\nExample of games:\n\nDealing tiles \n\nShuffling tiles\n\nAll tiles are placed face down on the table and are shuffled. By convention all players should participate in shuffling using both hands moving the pieces around the table rigorously and loudly for a lengthy period. Tiles may get flipped up during this process and players should flip them facing down as soon as possible to avoid identifying the location of the revealed tiles.\n\nStacking tiles\n\nEach player then stacks a row of 18 tiles, two tiles high in front of them (for a total of 36 tiles). Players then push each side of their stack together to form a square wall.\n\nRegular players usually place their stacks in a slightly diagonal position (about 20 to 30 degrees anti-clockwise); the right end of their stack is pushed slightly further in to the centre of the table to meet almost the middle of the stack of the player on the right. This creates a smaller square wall the length of about half of each stack, with walls extended away from each corner of the square. The diagonally positioned stacks and a smaller square creates a bigger space for players' tiles and also makes an ergonomic position for drawing tiles from the stack.\n\nDrawing tiles\n\nThe dealer throws three dice in the square wall and sums up the total. Counting anti-clockwise so that the dealer is 1 (or 5, 9, 13, 17), so that south (player to the right) is 2 (or 6, 10, 14, 18), etc., a player's quarter of the wall is chosen. Some house rules may use only two dice but have double throws to increase randomness. In the case of double throws, the player of the chosen wall makes the second throw.\n\nUsing the same total on the dice (or the total of the two throws), the player whose wall is chosen then counts the stacks of tiles from right to left. (For double throws, the count may extend to the left side player's stack.) This determines the location where the 'deck' of tiles is cut. Starting from the left of the stacks counted, the dealer draws four tiles for himself, and players in anti-clockwise order draw blocks of four tiles until all players have 12 tiles, so that the stacks decrease clockwise. Each player then draws one last tile to make a 13-tile hand.\n\nDealing does not have to be strictly this way and may be done quite differently based on house rules. Tiles may flip over when being dealt and players should agree in advance on how to deal with the problem. Solutions include having the dealer penalised points, shuffling the turned over piece back into the wall somehow, allowing the player who the tiles were dealt to take the piece or not (meaning the dealer must take it as his/her 14th piece) or other house rules.\n\nEach player now sets aside any Flowers or Seasons they may have drawn and takes turns to draw replacement piece(s) from the wall in the anti-clockwise direction. If a player gets any Flowers or Seasons tiles in the replacement draw, the players must wait for the next turn to draw replacement tiles.\n\nGameplay starts\n\nThe dealer draws a piece from the wall in clockwise direction, adding it to his hand. If this does not complete a legal hand, he then discards a piece (throwing it into the middle of the wall with no particular order in mind).\n\nRules \n\nEach player in turn, in anti-clockwise direction, draws a tile from the wall and then discards a tile by throwing it into the centre and, if desired, announcing out loud what the piece is. Play continues this way until one player has a legal winning hand and calls out \"Mahjong\" while revealing their hand. There are four different ways that this order of play can be interrupted.\n\nDuring play, the number of tiles maintained by each player should always be 13 tiles (meaning in each turn a tile must be picked up and another discarded). Not included in the count of 13 tiles are Flowers and Seasons set to the side and the fourth added piece of a Kong. If a player is seen to have fewer or more than 13 tiles in their hand outside of their turn they are penalised.\n\nLegal hand \n\nA winning hand consists of 14 tiles. Since players always have 13 tiles in their hand they must win by either taking a piece from the wall that completes their 14-tile hand (winning from the wall) or claiming a discard from another player which completes a 14-tile hand (winning by discard). The winning hand is made of four melds (a specific pattern of three pieces) and the eyes (a pair of identical pieces). The exceptions to this rule are the special hands listed below.\n\nMost players play with a table minimum, meaning a winning hand must score a minimum number of points (which can be seen in the scoring section). In Hong Kong Mahjong the most common point set is three but can be higher or lower depending on house rules.\n\nMelds \n\n* Melds/Pongs are a set of three identical tiles. For example:\n\n  \n\n  \n\n  \n\n  \n\nYou may form a Pong with any tile (except Flowers or Seasons because they are bonus tiles which are set aside and there are not three identical bonus tiles). The tiles must be identical (you cannot mix suits).\n* Kong is a complete set of four identical tiles. For example:\n\n   \n\n   \n\nConsider a Kong the same as a Pong with an additional tile to make a complete set of four. There are three ways to form a Kong.\n* During initial play (before the first piece is discarded by the dealer) or upon drawing a tile, a player who has a set of four matching tiles in their hand may declare a Kong. They do so by revealing the meld and placing two pieces in the middle face up and two pieces on the ends face down. This is called a concealed or hidden Kong.\n* If a player can use a discarded tile to complement three matching tiles in their hand, they can take the piece and reveal a \"Kong by discard\" or \"melded Kong\". The player reveals his three pieces face up and places the stolen discard on top of the middle tile. \n* If a player has already stolen (melded) a piece to make a Pong and then later in the game draws the fourth piece from the wall, he or she may announce (then or later in the game) a Kong by placing the fourth tile on top of the middle piece of the melded Pong. If a Pong has been melded a player cannot steal the 4th piece if another player discards it.\n\nWhenever a Kong is formed, that player must draw an extra tile from the end of the wall and then discard a tile. The fourth piece of a Kong (not Flowers/Seasons) is not considered as one of the 13 tiles a player must always have in their hand. Kongs are worth collecting to score more points and/or deprive opponents of the opportunity to obtain specific tiles.\n* Chow is a meld of three suited tiles in sequence. For example:\n\n  \n\n  \n\n  \n\n  \n\nThe meld must be in absolute numerical sequence. Players cannot skip numbers or meld from the 8 or 9 to 1 or 2. The sequence must also be in the same suit. Honours, Flowers and Seasons cannot be used to make chows because they have no numerical value. A player can steal a discard to form a chow from the player whose turn was immediately before theirs if no one else needs the tile to make Pongs, Kongs or win.\n* Eyes (also known as a pair) are two identical tiles which are an essential part of a legal winning hand. A piece cannot be stolen (melded) to form a pair of eyes unless the player simultaneously completes a legal winning hand.Lo, Amy (2001). The Book of Mahjong: An Illustrated Guide. North Clarendon, VT: Tuttle, p. 6. .\n\nFor example:\n\n \n\n \n\n \n\n \n\n \n\nInterruption of play \n\nFlower or Season \n\nWhenever a player draws a flower or season, it is announced and then placed to the side (it is not considered a part of the hand but the player with the winning hand will earn a bonus point for them) and the last tile of the wall is drawn as a replacement tile so that the player has the 14 pieces needed before their discard. This may happen successively in a player's turn.\n\nMelding another player's discard \n\nWhen a player discards a tile, other players may steal the tile to complete a meld. Stealing tiles has both advantages (quickly forming a winning hand and scoring extra points) and disadvantages such as revealing part of one's hand to other players and not being able to change the meld once declared.\n\nWhen a meld (Pong, Kong or Chow) is declared through a discard, the player must state the type of meld to be declared and place the meld face up. The player must then discard a tile, and play continues to the right. If the player who melds a discard is not directly after the discarder (in order of play), one or two players essentially miss their turn as play continues to the player after the one who declared the meld.\n\nWhen two or more players call for a discarded tile, a player taking the tile to win the hand has precedence over all others. Otherwise a player who can form a Pong or Kong takes precedence over a player who claims a Chow. Players may only call for a Chow from the discard of the player immediately prior to them, unless the tile is the final one required to complete the hand, but may call for a Pong or Kong from any player. A player may also take the tile to win the hand from any other player.\n\nGoing Mahjong \n\nIf at any point in the game a player can use another player's discard to complete a legal hand (and with the agreed minimum points), they yell out 'Mahjong', take the piece and reveal their hand, with the way of calling it out depending on variations. This ends the hand, and scoring commences. If two or three players need the piece to win, there are two ways to resolve the issue depending on agreed table rules: Either the players compete to see who would have a better hand in terms of scoring, or simply the player closest to the discarder in order of turn wins the game.\n\nAlternatively, a player may also win by drawing the tile required to complete a legal hand on his turn. This usually results in more points scored than if the player were to use another player's discard.\n\nExtra points are also scored if the dealer draws a winning hand right at the beginning of the game, or if another player uses the dealer's first discard to complete a winning hand.\n\nRobbing a Kong \n\nA rarely occurring and high-scoring feature of Hong Kong Mahjong is a move called robbing the Kong. If a player declares a Kong (by melding it or adding a fourth piece to a Pong to form a Kong or declaring a concealed Kong) and another player(s) can use that piece to complete a hand (which by logic could not be used to form a Pong or Kong as two players cannot make a Pong out of the same tile), a player may steal that piece from that player when declaring the Kong and go Mahjong (win the hand).\n\nExample winning hands \n\nBelow are examples of winning hands. A winning hand must consist of four melds (Pongs, Kongs, or Chows) and a pair (eyes) and must also score the agreed table minimum.\n\n   –    –    –    –   \n\nHand formed with four Pongs and the eyes (pair) of East wind. Only bamboo is used (no other simples), scoring extra points (clean hand). No chows are used (an all Pong/Kong hand scores extra points).\n\n   –    –    –    –  \n\nA high scoring hand formed using only circles, known as a pure hand. Hand is made of Chows, Pongs and the eyes of circles.\n\nMost players include table variations in their games, of which some non-standard are included. The hands of seven different pairs and 13 orphans are examples which do not have four melds and the eyes. They are described in more detail below.\n\nCalling out Mahjong\n\nIn Western Classical variants, this is known as creating a Mahjong, and the process of winning is called going Mahjong. Calling a Mahjong without having a legal hand or without the minimum points is usually penalized via points or with the player having to play the rest of the hand with his tiles shown to the other players face up.\n\nTurns and rounds \n\nIf the dealer wins the hand, they will remain the dealer and an extra hand is played in addition to the minimum 16 hands in a match. The same occurs if there is no winner.\n\nThe dealer position is significant in that they owe or are owed double their score.\n\nExtra points are also scored if their hand is composed of pieces that match their seat wind and or the prevailing wind.\n\nFlowers and Seasons are also scored as bonus points to the winner depending on their seat position.\n\nRhythm of play\n\nAmongst players, there may be an agreed amount of time allowed to make a call for a discarded tile before the next player takes their turn, known as the \"window of opportunity\". This may be explicitly stated in the rules; otherwise, it is generally considered that when the next player's turn starts, i.e., the tile leaves the wall, the opportunity has been lost.\n\nScoring \n\nOld Hong Kong scoring is relatively simple. There is only one winner (or if there is a draw the hand is replayed). The winner must have a legal hand that meets the minimum faan points agreed to in advance (not including any bonus points). Only the winner scores, the other players pay the winner various sums. After each hand ends, the winner counts all of his or her faan points:\n\n** individual melds\n** the composition of the entire hand\n** how the hand was won\n** bonus tiles\n** special patterns\n** and a few other special criteria.\n* In order to win, a player needs to have at least the minimum faan value agreed in advance (often 3). Bonus tiles and a few other elements are not included in the minimum faan value a player needs to form a legal winning hand. (i.e. in a three faan minimum game, if a player has two faan points and one bonus point, the player has not met the proper requirements to win and will need to gain another faan point before calling mahjong. Though the bonus points cannot be including in the minimum points needed to win, they are including in the overall score after a player wins\n* The other players do not score their hand. Once the winner has added his or her points (faan points plus bonus points) they must be converted into base points (the chart is below). These base points represent how much the opponents pay to the winner\n* Players then pay the winner (in money or when not gambling with \"chips or points\") based on 3 factors:\n** the based points (faan points and bonus points converted into a payment unit)\n** if the player won from the wall (doubles the points)\n** if the player was the dealer or not (doubles the points)\n\nfaan value \n\nBasic faan value \n\nA winning hand must include an agreed minimum amount of faan value (often 3)\n\nBonus faan \n\nA player only scores a bonus faan for Flowers or Seasons if it is their own flower or season (East1, South\n2, West3 and North\n4) or if the player has all four Flowers or all four Seasons (scoring 5 faan in total).\n\nPayment \n\nThe losers pay the winning player points based on several criteria and depending on whether the game is for fun or for money. How points are reckoned is agreed by players beforehand. For example, they can keep a tally, exchange chips or pay one another with money. The faan value of a hand is converted into base points which are then used to calculate the points the losers pay the winner. The table is progressive, doubling the amount of base points when reaching a certain faan point target. The following is the Old Hong Kong simplified table, for other tables see Hong Kong Mahjong scoring rules.\n\nThis table is based on play where 3 faan is the minimum needed in order to win with a legal hand. If a player has 3 faan then his hand is worth one base point. A winning hand with 9 faan is worth four base points. Losing players must give the winning player the value of these base points. The following special cases result in doubled base points:\n* If the winner wins from the wall his base points are doubled\n* If the hand was won by discard, the discarder doubles the amount he owes the winner\n* If the winner is east all losers double the basepoints\n* If east player is a losing player he pays double the points to the winner.\n\nIf two of these criteria apply to any player, he must double and then redouble the points owed to the winner.\n\nExamples \n\nHong Kong Mahjong is essentially a payment system of doubling and redoubling where winning from the wall adds great value to the final payment and where the dealer is highly rewarded or penalised if he or she wins or loses.\n\nLimit hands \n\nThere are a series of \"limit hands\". Table rules dictate if these rare and special hands are allowed, which ones, and the limit for scoring. A common scoring limit is 64 points, which is the highest base points doubled twice. A winner receives the scoring limit from each player without any doubling.\n\nIn some cases it is expected that the hand be achieved without calling any sets, except when winning, or that it be won from the wall.\n\nSome groups also play with the \"great Flowers\" rule. If a player picks up all four Flowers and all four Seasons during their hand, they instantly win the hand and receive the maximum points from all of the players. This is exceptionally rare.\n\nExamples of high-scoring hands \n\nAll-Pong hand ()\n\n   -    -    -    -  \n\nKong hand / 18 Arhats hand ()\n\n    -     -     -     -  \n\nClean hand ()\n\n   -    -    -    -   \n\nPure hand ()\n\n   -    -    -    -  \n\nGreat winds hand ()\n\n   -    -    -    -  \n\nGreat dragons hand ()\n\n   -    -    -    -  \n\nThirteen orphans hand ()\n\n             \n\nVariations \n\nVariations may have far more complicated scoring systems, add or remove tiles, and include far more scoring elements and limit hands.\n\nIn many places, players often observe one version and are either unaware of other variations or claim that different versions are incorrect. Many variations today differ only by scoring:\n\n* Chinese classical Mahjong is the oldest surviving variety of Mahjong and was the version introduced to America in the 1920s under various names. It has a small, loyal following in the West, although few play it in Asia. All players score and it is possible to score higher than the winner.\n* Hong Kong Mahjong or Cantonese Mahjong is a more common form of Mahjong, differing in minor scoring details from the Chinese Classical variety. It does not allow multiple players to win from a single discard.\n* Competition Mahjong is an international standard founded by All-China Sports Federation in July 1998 that some Mahjong societies have adopted for competition play and in some cases for all play.\n* Sichuan Mahjong is a growing variety, particularly in southern China, disallowing chi melds, and using only the suited tiles. Play continues until a loser is decided or a draw. It can be played very quickly.\n* Wuhan Mahjong is growing rapidly and become popular in southern China. It's different from other parts of China in a way that 1) it has a tile that can be used as everything, called Laizi (), and 2) you have to have a set of special 2 tiles, namely 2, 5, 8, as prerequisite for winning. Another variation has become the new trend, it's called . Special tiles need to be discarded ().\n* Changsha Mahjong is widely played in Hunan Province. Like Wuhan Mahjong, players need to obtain special Jong consisting of only tiles of 2, 5 or 8. Changsha Mahjong forbids using winds and some special tiles, those tiles are first drawn out from the table when playing. Winners each round get a special drawing session for bonuses, usually doubling the score.\n* Tianjin Mahjong using normally 7 jokers, with special scoring such as joker-free, joker-waiting-pair, catch-5, dragon, joker-suited-dragon.\n* Shenyang Mahjong using 13 hands in a game, and Shenyang Mahjong has a really fast speed on playing, which allegedly might be said in some regard to perhaps match the personality of North-east people in China. Also in Shenyang Mahjong, the player must to have Bamboos, Characters, Circles and number one or 9 in his hand. In addition, the players have to Pong before they Chow, so there is no chance to win even if some players win at the first time they have their hands in hand.\n* Taiwanese Mahjong is the variety prevalent in Taiwan and involves hands of 16 tiles (as opposed to the 13-tile hands in other versions), features bonuses for dealers and recurring dealerships, and allows multiple players to win from a single discard.\n* Filipino Mahjong, 16 tile hands. Certain tiles can be wild. Honors are treated as bonuses.\n* Fujian Mahjong, 13 tile hands. Certain tiles can be wild. No dragons. Winds are treated as bonuses.\n* Shanxi Mahjong, or Lisi (Raise 4; ), the players must win with the first four blocks drawn which are placed separately in front of other. These four blocks cannot be touched until the player has a ready hand.\n* Singaporean/Malaysian Mahjong are two similar variants with much in common with Hong Kong mahjong. Unique elements of Singaporean/Malaysian Mahjong are the use of four animal bonus tiles (cat, mouse, cockerel, and centipede) as well as certain alternatives in the scoring rules, which allow payouts midway through the game if certain conditions (such as a kang) are met. Melds may also be presented in a form different to most other variations.\n* South African Mahjong is a variant of Cantonese Mahjong. It is very similar in terms of game play and follows most of the rules and regulations of Cantonese Mahjong. However, there are some minor differences in scoring, e.g. the limit on the maximum points a hand can be rewarded is 3 or 4 fan depending on the house rules. A chicken hand (gai wu) is normally considered a value hand. Depending on the house rules Flowers may also be used to boost scoring.\n* Thai Mahjong has eight specialized jokers with eight extra flowers and eight animals for a total of 168 tiles.\n* Vietnamese Mahjong has the same eight specialized jokers but with only eight different extra flowers for a total of 160 tiles. Modern variant triplicates or quadruplicates the jokers for a total of 176 or 184 tiles.\n* Japanese classical Mahjong is still used in tournaments. It is closer to the Chinese classical scoring system but only the winner scores. \n* Japanese Mahjong is a standardized form of Mahjong in Japan and is also found prevalently in video games. In addition to scoring changes, the rules of rīchi (ready hand) and dora (bonus tiles) are unique highlights of this variant. In addition, tile discards are specifically arranged in front of each player by discard order, to take discarded tiles into account during play.  Some rules replace some number 5 tiles with red tiles so that they can eventually get more value. \n* Korean Mahjong is unique in many ways and is an excellent version for three players. One suit is omitted completely (usually the Bamboo set or 2–8 of bamboo) as well as the Seasons. The scoring is simpler and the play is faster. No melded chows are allowed and concealed hands are common. Riichi (much like its Japanese cousin) is an integral part of the game as well.[http://mahjong.wikidot.com/rules:korean-overview Korean Rules]\n* Pussers bones is a fast-moving variant developed by sailors in the Royal Australian Navy. It uses an alternative vocabulary, such as Eddie, Sammy, Wally, and Normie, instead of East, South, West, and North respectively.\n* Western classical Mahjong is a descendant of the version of Mahjong introduced by Babcock to America in the 1920s. Today, this term largely refers to the \"Wright-Patterson\" rules, used in the U.S. military, and other similar American-made variants that are closer to the Babcock rules.\n* American Mahjong is a form of Mahjong standardized by the National Mah Jongg League and the American Mah-Jongg Association.[http://amja.net American Mah-Jongg Association] It uses joker tiles, the Charleston, plus melds of five or more tiles, treats bonus tiles as honors, and eschews the Chow and the notion of a standard hand. Legal hands are changed annually. Purists claim that this makes American Mahjong a separate game. In addition, the NMJL and AMJA variations, which have minor scoring differences, are commonly referred to as Mahjongg or mah-jongg (with 2 Gs, often hyphenated).\n* Mah Jongg Card Game by Winning Moves is a card game variant based on the basic Mah Jongg game.\n\nThree-player Mahjong (or 3-ka) is a simplified three-person Mahjong that involves hands of 13 tiles (with a total of 84 tiles on the table) and may use jokers depending on the variation. Any rule set can be adapted for three players; however, this is far more common and accepted in Japan, Korea, Malaysia and the Philippines. It usually eliminates one suit entirely, or tiles 2-8 in one suit leaving only the terminals. It needs fewer people to start a game and the turnaround time of a game is short—hence, it is considered a fast game. In some versions there is a jackpot for winning in which whoever accumulates a point of 10 is considered to hit the jackpot or whoever scores three hidden hands first. The Malaysian and Korean versions drop one wind and may include a seat dragon.The Mahjong Wiki.[http://mahjong.wikidot.com/rules:three-player Three-player mahjong]. Retrieved 17 November 2017.\n\nEquipment \n\nTables \n\nMahjong tables are square and small enough to be within arms-length of all equipment. The edges are raised to prevent tiles from sliding off and the surface is covered in felt to limit wear on the tiles. Automatic dealing tables are available, often used for high stakes playing and tournaments, are able to shuffle tiles, build walls, and randomize dice. It is an elaborate device built into a table which uses two alternating sets of tiles. It prepares one wall while the players play one hand. After the hand is finished the tiles are dropped into the table and a new wall raises upwards. In theory the table should avoid cheating (by staking the deck and or using loaded dice).\n\nTiles\n\nThe following chart shows the most generic set of tiles \n\nThere are variations that feature specific use of tiles. Some three-player versions remove the North Wind and one Chinese provincial version has no honors. Korean Mahjong removes the bamboo suit or at least its numbers 2–8 so that terminals can be used. Japanese Mahjong rarely uses Flowers or Seasons. The Seasons are removed in Korean Mahjong, while many Southeast Asian sets have more flower series.\n\nWild cards and jokers \n\nSome players accept wild cards () when playing Mahjong. The wild cards are decided at the beginning of the game. The wild card can be the next tile after spreading tiles to all players or separately decided by a dice toss. Wild cards are not allowed to be discarded and can replace any tiles in Chows. Wildcards can't replace any tiles in Pongs and Kongs. For example, if a character 4 taken out, then character 4 and the next number 5 can be used as wild cards in this round (When the tile showed, the tiles of the same pattern left only 3, so the next tile in the suit will be used as wild cards as well, adding to 7 wild cards for 4 players). Also, if a tile numbered 9 is chosen, then the number 9 and 1 are wild cards.\n\nAlso, if the chosen tile is not in the suited tiles, the wild cards are decided in rules:\n\nThe bonus tiles are not available for wild cards.\n\nA feature of several variations of Mahjong, most notably in American mahjong, is the notion of some number of  Joker tiles. They may be used as a wild card: a substitute for any tile in a hand, or, in some variations, only tiles in melds. Another variation is that the Joker tile may not be used for melding. Depending on the variation, a player may replace a Joker tile that is part of an exposed meld belonging to any player with the tile it represents.\n\nRules governing discarding Joker tiles also exist; some variations permit the Joker tile to take on the identity of any tile, and others only permit the Joker tile to take on the identity of the previously discarded tile (or the absence of a tile, if it is the first discard).\n\nJoker tiles may or may not affect scoring, depending on the variation. Some special hands may require the use of Joker tiles (for example, to represent a \"fifth tile\" of a certain suited or honor tile).\n\nIn American Mahjong, it is illegal to pass Jokers during the Charleston.\n\nFlowers \n\nJapanese rule sets discourage the use of Flowers and Seasons. Korean rules and three-player Mahjong in the Korean/Japanese tradition use only Flowers. In Singapore and Malaysia an extra set of bonus tiles of four animals are used. The rule set includes a unique function in that players who get two specific animals get a one-time immediate payout from all players. In Taiwanese Mahjong, getting all eight Flowers and Seasons constitutes an automatic win of the hand and specific payout from all players.\n\nFour of the flower tiles represent the four noble plants of Confucian reckoning:\n* plum,\n* orchid,\n* chrysanthemum,\n* andbamboo.\n\n   \n\nThe other 4 flower tiles (or season tiles) represent Seasons:\n*  spring,\n*  summer,\n*  autumn,\n* andwinter.\n\n   \n\nThe animal tiles used in Thailand, Malaysia, Singapore and local variations are the animals. They represent the cat, mouse, rooster and centipede.\n\n   \n\nDice, markers, and counting pieces\n\n \nDepending on the variation, two or three dice are usually used to decide what part of the wall to start dealing from. They are six-sided dice, traditionally but not necessarily Chinese dice with red one and four pips.\n\nThe dealer marker is a round or square object that the dealer places to the side to remind players who the dealer is. The wind marker may be used which indicates the current prevailing wind. In some cases the dealer marker and the wind marker are represented by one large marker, usually a small wheel where one can swivel the outer circle to indicate the prevailing wind (which the dealer holds onto), a cube with the four winds placed onto four of the sides which can be placed in a hollow square (the dealer holds onto it), or a cylinder locked into frame which can be rolled to expose the wind on the top. Japanese mahjong, especially in a gambling environment, may optionally use four yakitori markers to indicate which players have not won a hand yet and has to pay a bonus.\n\nThere are a variety of counting pieces used in different countries. They range from Chinese or Japanese counting sticks (thin sticks with various dots on them to represent various points), jetons, play money, paper and pencil or various apps on touchscreen devices used to calculate and keep scores.\n\nWalls \n\nAll tiles are placed face down and shuffled.  Each player then stacks a row of tiles two tiles high in front of him, the length of the row depending on the number of tiles in use:\n* 136 tiles: 17 stacks for each player\n** Suits of circles, bamboos, and characters + winds + dragons\n* 144 tiles: 18 stacks for each player\n* 148 tiles: 19 stacks for dealer and player opposite, 18 for rest\n* 152 tiles: 19 stacks for each player\n\nCharleston \n\nIn the American variations it is required that, before each hand begins, a Charleston be enacted. In the first exchange, three tiles are passed to the player on one's right; in the next exchange, the tiles are passed to the player opposite, followed by three tiles passed to the left. If all players are in agreement, a second Charleston is performed; however, any player may decide to stop passing after the first Charleston is complete. The Charleston is followed by an optional pass to the player across of one, two, or three tiles. The Charleston, a distinctive feature of American Mahjong, may have been borrowed from card games such as Hearts.\n\nRules \n\nJapanese and Korean Mahjong have some special rules. A player cannot win by a discard if that player had already discarded that piece, where players' discards are kept in neat rows in front of them. Players may declare ready, meaning that they need one tile to win, cannot change their hand and win extra points if they win. Some rules may replace some of the number 5 tiles with red tiles, as they can earn more points. Korean Mahjong does not allow melded (stolen) chows.\nTaiwanese Mahjong adds three tiles to a hand requiring a 5th set to be formed, making a clean hand or all Pong hand very difficult to procure.\nAmerican Mahjong has distinctive game mechanics and the article on American Mahjong details these. Some differences include many special patterns, a different scoring system and the use of jokers and five-of-a-kind.\n\nHands \n\nMany variations have specific hands, some of which are common while some are optional depending on regions and players. One example is the Pure Green hand made of chows or Pongs using 2, 3, 4, 6, 8 of bamboo and green dragon.\n\nReady hands \n\nWhen a hand is one tile short of winning (for example:             , waiting for: , , or , as  can be the eyes), the hand is said to be a ready hand (), or more figuratively, \"on the pot\". The player holding a ready hand is said to be waiting for certain tiles. It is common to be waiting for two or three tiles, and some variations award points for a hand that is waiting for one tile. In 13-tile Mahjong, the largest number of tiles for which a player can wait is 13 (the thirteen wonders, or 13 orphans, a nonstandard special hand). Ready hands must be declared in some variations of Mahjong, while other variations prohibit the same.\n\nSome variations of Mahjong, most notably Japanese and Korean ones, allow a player to declare . A declaration of rīchi is a promise that any tile drawn by the player is immediately discarded unless it constitutes a win. Standard requirements for rīchi are that the hand be closed or have no melds declared (other than a concealed Kong) and that players already have points for declaration of rīchi. A player who declares rīchi and wins usually receives a point bonus for their hand directly, and a player who won with rīchi also has the advantage to open the inner  which leads to higher possibilities to match such a card, thus has more chance to grant additional bonus. However, a player who declares rīchi and loses is usually penalised in some fashion. Declaring a nonexistent rīchi is also penalised in some way.\n\nIn some variations, a situation in which all four players declare a rīchi is an automatic drawn game, as it reduces the game down to pure luck, i.e., who gets their needed tile first.\n\nDraws \n\nIf only the dead wall remains (or if no dead wall exists and the wall is depleted) and no one has won, the hand is drawn (流局 liú jú, 黃莊 huáng zhuāng, Japanese ryūkyoku), or \"goulashed\". A new hand begins, and depending on the variant, the Game Wind may change. For example, in most playing circles in Singapore, if there is at least one Kong when the hand is a draw, the following player of the dealer becomes the next dealer; otherwise, the dealer remains dealer.\n\nJapanese Mahjong has a special rule called , which is, if three players claim the same discard in order to win, the hand is drawn. One reason for this is that there are cases in which bars of 1,000 points for declaring rīchi cannot be divided by three. The rule is treated the same as \"abortive draws\".\n\nAbortive draws \n\nIn Japanese Mahjong, rules allow abortive draws to be declared while tiles are still available. They can be declared under the following conditions:\n* : On a player's first turn when no meld has been declared yet, if a player has nine different terminal (also known as major) or honor tiles, the player may declare the hand to be drawn (for example,              , but could also go for the nonstandard thirteen wonders hand as well).\n* : On the first turn without any meld declarations, if all 4 players discard the same Wind tile, the hand is drawn.\n* : If all four players declare rīchi, the hand is drawn.\n* : The hand is drawn when the fourth Kong is declared, unless all four Kongs were declared by a single player. Still, the hand is drawn when another player declares a fifth Kong.\n\nScoring\n\nScoring in Mahjong involves points, with a monetary value for points agreed upon by players. Although in many variations scoreless hands are possible, many require that hands be of some point value in order to win the hand.\n\nWhile the basic rules are more or less the same throughout Mahjong, the greatest divergence between variations lies in the scoring systems.  Like the rules, there is a generalized system of scoring, based on the method of winning and the winning hand, from which Chinese and Japanese base their roots.  American Mahjong generally has greatly divergent scoring rules, as well as greatly divergent general rules.\n\nBecause of the large differences between the various systems of scoring (especially for Chinese variants), groups of players will often agree on particular scoring rules before a game.\n\nPoints\n\nPoints (terminology of which differs from variation to variation) are obtained by matching the winning hand with different criteria scoring different values. The points obtained may be modified into scores for each player using some (typically exponential) functions. Some criteria may be also in terms of both points and score.\n\nIn many variations the dealer receives no scoring bonus and does not maintain his/her turn by winning or a dead hand.\n\nIn classical Mahjong all players score points. Points are given for sets and hand composition and winning bonuses, doubled and redoubled for basic patterns. Sometimes a loser may score more points than a winner. Japanese Mahjong has a complex scoring system with several stages of scoring, rules and exceptions, evening out scores and bonus points at the end of a match. Korean Mahjong has a simple scoring system where only winner scores without any form of doubling.\n\nSome variations give points for concealed hands, in which case no melds are made except by winning on a discard.\n\nIn Old Hong Kong Mahjong:\n* Only the winner scores points.\n* Winning hands are scored by totaling the point value of each element in the hand. Points are distinct from the actual payment received from each player.\n* The winner receives points (also known as faan among some players) for:\n** individual melds,\n** the composition of the entire hand,\n** how the hand was won,\n** bonus tiles,\n** special patterns,\n** and a few other special criteria.\n* In order to win, a player needs to have at least the minimum points agreed in advance (often 3).\n* Bonus points are separate from the minimum points a player needs to win.\n* If a player goes Mahjong with a legal and minimum hand, his/her hand is scored by adding his/her points and bonus points together.\n* The payment received from each player depends on three factors:\n** the point value of the hand,\n** if the player won from a discard or from the wall, and\n** if the player was the dealer or not.\n\nComparison \n\nMahjong solitaire\n\nA single player game employs the tiles of mahjong, usually played on computers or devices. The game is entirely unrelated to mahjong or its variations and is a recent invention. A two player version was published by Nintendo. The game involves stacking tiles face up in various elaborate patterns and removing uncovered matching tiles at the end of rows.\n\nCompetition \n\nIn 1998, in the interest of dissociating illegal gambling from Mahjong, the China State Sports Commission published a new set of rules, now generally referred to as Chinese Official rules or International Tournament rules (see Guobiao Majiang). The principles of the new, wholesome Mahjong are no gambling, no drinking, and no smoking. In international tournaments, players are often grouped in teams to emphasize that Mahjong from now on is considered a sport.\n\nThe new rules are highly pattern-based. The rulebook contains 81 combinations, based on patterns and scoring elements popular in classic and modern regional Chinese variants; some table practices of Japan have also been adopted. Points for flower tiles (each flower is worth one point) may not be added until the player has scored eight points. The winner of a game receives the score from the player who discards the winning tile, plus eight basic points from each player; in the case of zimo (self-drawn win), he receives the value of this round plus eight points from all players.\n\nThe new rules were first used in an international tournament in Tokyo, where, in 2002, the first global tournament in Mahjong was organized by the Mahjong Museum, the Japan Mahjong Organizing Committee, and the city council of Ningbo, China. One hundred players participated, mainly from Japan and China, but also from Europe and the United States. Mai Hatsune, from Japan, became the first world champion. The following year saw the first annual China Mahjong Championship, held in Hainan; the next two annual tournaments were held in Hong Kong and Beijing. Most players were Chinese; players from other nations attended as well.\n\nIn 2005, the first Open European Mahjong Championship was held in the Netherlands, with 108 players. The competition was won by Masato Chiba from Japan. The second European championship in Copenhagen(2007) was attended by 136 players and won by Danish player Martin Wedel Jacobsen. The first Online European Mahjong Championship was held on the Mahjong Time server in 2007, with 64 players, and the winner was Juliani Leo, from the U.S., and the Best European Player was Gerda van Oorschot, from the Netherlands. The Third Open European Mahjong Championship 2009 at Baden/Vienna, Austria, was won by Japanese player Koji Idota, while runner-up Bo Lang from Switzerland became European Champion. There were 152 participants.\n\nIn 2006, the World Mahjong Organization (WMO) was founded in Beijing, China, with the cooperation of, amongst others, the Japan Mahjong Organizing Committee (JMOC) and the European Mahjong Association (EMA). This organization held its first World Mahjong Championship in November 2007 in the Chinese town of Chengdu, attended by 144 participants from all over the world. It was won by Li Li, a Chinese student at Tsinghua University. The next World Championship took place in Utrecht, the Netherlands, 27 to 29 August 2010.\n\nOther major international tournaments include the Mahjong International League's World Mahjong Sports Games and the privately sponsored World Series Of Mahjong.\n\nAmerican mahjong tournaments are held in virtually every state—the largest is in Las Vegas, Nevada twice a year, and in Atlantic City, New Jersey, by Mah Jongg Madness; and the annual cruise hosted by the National Mah Jongg League and Mah Jongg Madness (MJM).  MJM tournaments host between 150 and 500 participants at these larger events; and there are several smaller scale, but equally successful tournaments held annually by other hosts. Prize pools are based on the number participating. Rules are based on the National Mah Jongg League standard rules.\n\nHistory \n\nMahjong is based on draw-and-discard card games that were popular in 18th and 19th century China, some of which are still popular today. They were played with a stripped deck of money-suited cards. Each deck is divided into three suits of Cash or coins, Strings of cash, and Myriads of strings. There are nine ranks in each suit. In addition, there are three wild cards: Red flower, White flower, and Old thousand. Depending on the game, there are multiple copies of each card.\n\nGames scholar David Parlett has written that the Western card games Conquian and Rummy share a common origin with Mahjong. All these games involve players drawing and discarding tiles or cards to make melds. Khanhoo is an early example of such a game. The most likely ancestor to Mahjong was pènghú (碰和) which was played with 120 or 150 cards. During the late 19th century, pènghú was used interchangeably with máquè in both card and tile form.\n\nIt is not known when the conversion from cards to tiles took place precisely but it most likely occurred in the middle of the 19th century. The earliest surviving tile sets date to around 1870 and were acquired in Fuzhou, Shanghai, and Ningbo.Sloper, Tom. [http://www.sloperama.com/mjfaq/mjfaq11e.htm History of Mahjong FAQ 11]. Retrieved 6 November 2015. These sets differ from modern ones in several ways. In the Glover sets, there were no \"flower\" and fā (\"green dragon\") tiles. In their place were \"king\" tiles for heaven, earth, man, and harmony and also for each of the 4 \"winds\" which may have acted as bonus tiles. In the contemporaneous Himly set, there were no zhōng (\"red dragon\") tiles either. Instead there were the wild cards known as Cash Flower, String Flower, and Myriad Flower plus an additional tile, the king of everything. These early jokers are still found in the Vietnamese and Thai sets.Sloper, Tom. [http://www.sloperama.com/majexchange/tutorial.htm Is my set complete?] at sloperama.com. Retrieved 16 May 2016. They may have been removed as the tiles share the same titles as the leaders of the Taiping Rebellion (1850–1864). For example, Hong Xiuquan was the self-styled \"Heavenly King of Great Peace\" and his top subordinates were called east king, south king, west king, and north king.\n\nThe ban on gambling after the founding of the People's Republic in 1949 led to a decline in playing. The game itself was banned during the Cultural Revolution (1966–1976). Today, it is a favorite pastime in China and other Chinese-speaking communities.\n\nMahjong in the West \n\nIn 1895, British sinologist William Henry Wilkinson wrote a paper which mentioned a set of cards known in central China by the name of ma chioh, literally, hemp sparrow, which he maintained was the origin of the term Mahjong. He did not explain the dialect of the originator or region specific etymology of this information. By 1910, there were written accounts in many languages, including French and Japanese.\n\nThe game was imported to the United States in the 1920s.\"Recalling the Craze for a Game of Chance\" By Steven Heller, New York Times, 15 March 2010 [https://www.nytimes.com/2010/03/18/arts/artsspecial/18MAH.html?ex1285473600&en\n37c8a4976aafc929&ei5087&WT.mc_id\nAR-D-I-NYT-MOD-MOD-M143-ROS-0410-L2&WT.mc_ev=click online version] The first Mahjong sets sold in the U.S. were sold by Abercrombie & Fitch starting in 1920. It became a success in Washington, D.C., and the co-owner of the company, Ezra Fitch, sent emissaries to Chinese villages to buy every Mahjong set they could find. Abercrombie & Fitch sold a total of 12,000 Mahjong sets.\n\nAlso in 1920, Joseph Park Babcock published his book Rules of Mah-Jongg, also known as the \"red book\". This was the earliest version of Mahjong known in America. Babcock had learned Mahjong while living in China. His rules simplified the game to make it easier for Americans to take up, and his version was common through the Mahjong fad of the 1920s. Later, when the 1920s fad died out, many of Babcock's simplifications were abandoned.\n\nThe game has taken on a number of trademarked names, such as \"Pung Chow\" and the \"Game of Thousand Intelligences\". Mahjong nights in America often involved dressing and decorating rooms in Chinese style.Bill Bryson, Made in America. Harper, 1996, ch. 16. Several hit songs were recorded during the Mahjong fad, most notably \"Since Ma Is Playing Mah Jong\" by Eddie Cantor.\n\nMany variants of Mahjong developed during this period. By the 1930s, many revisions of the rules developed that were substantially different from Babcock's classical version (including some that were considered fundamentals in other variants, such as the notion of a standard hand). The most common form, which eventually became \"American Mahjong\", was most popular among Jewish women. Standardization came with the formation of the National Mah Jongg League (NMJL) in 1937, along with the first American Mahjong rulebook, Maajh: The American Version of the Ancient Chinese Game, written by NMJL's first president and co-founder, Viola L. Cecil.Tom Sloper, The Red Dragon & The West Wind: The Winning Guide to Official Chinese & American Mah-Jongg, HarperCollins, 2007.\n\nMany consider the modern American version a Jewish remake, as many American Mahjong players are of Jewish descent. The NMJL was founded by Jewish players and is considered a Jewish organization. In 1986, the National Mah Jongg League conducted their first Mah Jongg Cruise Tournament, in conjunction with Mah Jongg Madness. In 2010, this large scale seagoing event hosted its 25th Silver Anniversary Cruise, with players from all over the States and Canada participating.\n\nIn 1999, a second organization was formed, the American Mah Jongg Association. The AMJA currently hosts tournaments all across North America, with their signature event being at the Trump Taj Mahal Casino Resort in Atlantic City, New Jersey before it went bankrupt and closed on October 10, 2016.\n\nIn the United Kingdom, British author Alan D. Millington revived the Chinese classical game of the 1920s with his book The Complete Book of Mah-jongg (1977). This handbook includes a formal rules set for the game.\n\nCurrent development \n\nThere are many governing bodies which often host exhibition games and tournaments for modern and traditional Mahjong gaming.\n\nMahjong, as of 2010, is the most popular table game in Japan.Pakarnian, John, \"Game Boy:  Glossary of Japanese Gambling Games\", Metropolis, 22 January 2010, p. 15. As of 2008, there were approximately 7.6 million Mahjong players in Japan and an estimated 8,900 Mahjong parlors did ¥300 billion in sales.Matsutani, Minoru, \"[http://search.japantimes.co.jp/cgi-bin/nn20100615i1.html Mah-jongg ancient, progressive]\", Japan Times, 15 June 2010, p. 3. Many devotees there believe the game is losing popularity and have taken efforts to revive it. There are several manga and anime (e.g. Saki and Akagi) devoted to dramatic and comic situations involving Mahjong.Schodt, Frederik, Manga! Manga! The World of Japanese Comics. Kodansha, 1986, Chapter 5. Since the 1980s, hundreds of different Mahjong arcade machines in Japanese video arcades have been created, including strip versions. Newer units can connect with other arcade machines across the Internet.\n\nMahjong culture is still deeply ingrained in the Chinese community. Sam Hui wrote Cantopop songs using Mahjong as their themes, and Hong Kong movies have often included scenes of Mahjong games. Many gambling movies have been filmed in Hong Kong, and a recent subgenre is the Mahjong movie.\n\nProlonged playing of Mahjong may trigger epileptic seizures according to a 2007 study. To date there are 23 reported cases of Mahjong-induced seizures in the English medical literature. Some doctors speculate that this may be due to stress and complex manual movement correlated with intense brain function similar to playing chess or card games such as poker.\n\nStudies by doctors have also shown in Hong Kong that the game is beneficial for individuals suffering from dementia or cognitive memory difficulties, leading to the development of Mahjong therapy.\n\nMahjong was also adapted into several puzzle video games such as Mahjong Trails, listed as one of the top grossing games on Facebook.\n\nSuperstitions \n\nEven though both skill and chance play a fundamental role in the game, there is no shortage of superstitions in which players believe where they sit, how they hold their pieces or objects they have on their person will somehow affect the outcome. For example, players will try to find seats with the best Feng Shui or wear their lucky clothing or trinkets. Some believe that specific pieces (one dot for example) bode bad luck if received in their opening hand\n\nMore elaborated superstitions in Mahjong include those found in the game poker, not counting one's wins and losses, to the comical like changing one's undergarments after a loss. As with all superstitions in gaming, none of them have been properly demonstrated as effective though for some the rituals have become an integral part of the game experience and its aesthetics.\n\nGlossary\n\n*Bamboo also called bams or sticks; means bar of 100 pence. They are called bamboo in the US are called strings (索子) in China and Japan, in accordance with their origin.\n*Dots also known as circles, wheels or stones. Originally meant penny.\n*Characters also known as numbers and myriads, means 10000 pence.\n*White dragon () \n*Red dragon () started off as a fifth Wind. \n*Green dragon (; represents ) entered the set by 1890.\n*Pong () three identical tiles, triplet\n*Kong () four identical tiles, quadruplet\n*Concealed or hidden Kong ()\n*Chow (; Cantonese: ; ) run of three tiles from the same suit\n*Calling Mahjong (Chinese (mainland China)): 和; Chinese (Taiwan): 胡; pinyin: hú; Cantonese: 糊; ) declaring a completed hand\n*Self-draw () drawing the tile required to complete a legal hand on one's turn \n*Heavenly Hand () winning hand right at the beginning of the game \n*Earthly Hand () first discard to complete a winning hand\n*The term Dragons is not used in Asian countries, where the tiles are called 三元, which roughly means three fundamentals.\n\nUnicode \n\nMahjong tiles were added to the Unicode Standard in April, 2008 with the release of version 5.1.\n\nThe Unicode block for Mahjong tiles is U+1F000–U+1F02F:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mahjong" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19496" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mahjong ( ,) is a tile-based game which was developed in China since the Qing dynasty and has further developed throughout the world since the early 20th century. It is commonly played by four players (with some three-player variations found in South Korea, Japan and Southeast Asia).  The game and its regional variants are widely played throughout Asia (especially in the Eastern and South Eastern Asia) and have materialized into an Asian culture in relation to its high degree of influence, in addition, they have also been increasingly regarded as a popular pastime and entertainment among Western countries and other parts of the world. Due to its influence and popularity, the game has been adapted into a widespread online entertainment. Similar to the Western card game rummy, Mahjong is a game of skill, strategy, and calculation and involves a degree of chance.\n\nThe game is played with a set of 144 tiles based on Chinese characters and symbols, although some regional variations may omit some tiles and/or add unique tiles. In most variations, each player begins by receiving 13 tiles. In turn players draw and discard tiles until they complete a legal hand using the 14th drawn tile to form 4 melds (or sets) and a pair (eye). A player can also win with a small class of special hands. There are fairly standard rules about how a piece is drawn, how a piece is robbed from another player, the use of simples (numbered tiles) and honors (winds and dragons), the kinds of melds allowed, how to deal the tiles and the order of play. Despite these similarities, there are many regional variations to the rules including rather different scoring systems, criteria for legal winning hands and even private table rules which distinguish some variations as notably different styles of mahjong.\n\nName \n\nIn Chinese, the game was originally called 麻雀 ()meaning sparrow which is still used in some southern dialects. Most Mandarin-speaking Chinese now call the game 麻将（májiàng）, which is a homonym of one way to refer to sesame paste. It is pronounced mah-ZHONG in English which is an approximation of the pronunciation in Mandarin.\n\nOld Hong Kong Mahjong \n\n \nThere are many highly varied versions of mahjong both in rules and tiles used. \"Old Hong Kong Mahjong\" uses the same basic features and rules as the majority of the different variations of the game. This form of Mahjong uses all of the tiles of the most commonly available sets, includes no exotic complex rules and has a relatively small set of scoring sets/hands with a simple scoring system. For these reasons Hong Kong mahjong is a suitable variation for the introduction of game rules and play and is the focus of this article.\n\nGame Pieces and Accessories \n\nOld Hong Kong Mahjong is played with a standard set of Mahjong tiles (though cards may be used). Sets often include counters (to keep score), dice (to decide how to deal) and a marker to show who the dealer is and which round is being played. Some sets include racks to hold the tiles, especially if they are larger/smaller than standard tiles or have an odd shape.\n\nA set of Mahjong tiles usually has at least 136 tiles (most commonly 144). Although, sets originating from the United States or Southeast Asia will probably have more. Mahjong tiles are split into 3 categories: Suits, Honors, and Bonuses.\n\nSimples tiles \n\nThere are 3 different suits of simples and in each suit the tiles are numbered from 1 to 9. The suits are: bamboos, dots and characters. There are 4 identical copies of each simples tile totaling 108 simples tiles.\n\nHonors tiles \n\nThere are two different sets of Honors tiles: Winds and Dragons. The Winds are East, South, West and North. In Mahjong East (not North) is the beginning. The Dragons are Red, Green and White. The white dragon has a blue or black frame on the face of the piece or in some sets is entirely blank. These tiles have no numerical sequence like the simples (for example the bamboo pieces number 1 to 9).\n\nBonus tiles \n\nThere are two sets of bonus tiles: Flowers and Seasons. The flower and season tiles are unique not only in playing different roles in the mechanics of the game, but also in their being represented by only one tile, rather than four copies: there are a total of four flower and four season tiles in the set. The tiles have a different artistic rendering of a specific type of flower or season. These tiles are not drawn into a player's hand but are set aside (kept near the player's other tiles for scoring purposes should they win the hand) when drawn and an extra tile is drawn in replacement of the bonus tile.\n\nWhile it is not necessary to know the names of the bonus tiles (only its number) the flowers are named: 1. Plum, 2. Orchid, 3. Chrysanthemum, 4. Bamboo. There is no relation between the bonus tiles \"bamboo\" flower and the set of simple tiles (ex. 2 bamboo). The seasons are named 1. Spring, 2. Summer, 3. Autumn, 4. Winter.\nIn traditional Chinese culture, the plum, orchid, chrysanthemum and bamboo are collectively known as the Four Gentlemen and are regarded as the respective representative plants of Winter, Spring, Autumn and Summer.\n\nChoosing table positions and first dealer \n\nThe dealer is chosen by various means, either by throwing dice (the highest total takes the east wind), by placing one of each wind face down and having each player randomly select one of these tiles or other house rule variations. Each player sits down at their respective position (called the wind position) at the table in positions of an inverted compass: East is dealer, the right of the dealer is South, across is West and the left is North. The order essentially is counter-clockwise.\n\nHands, rounds, and matches \n\nA match consists of four rounds, each representing a \"prevailing wind,\" starting with East. Once the first round is completed, a second round begins with South as the prevailing wind, and so on. Wind position is significant in that it affects the scoring of the game. A Mahjong set with Winds in play will usually include a separate prevailing wind marker (typically a die marked with the Wind characters in a holder).\n\nIn each round at least four hands are played, with each player taking the position of dealer. In the first hand of each round, Player 1 (winner of the dice toss) is East and therefore dealer. In the second hand, Player 2 takes the East position, shifting the seat winds amongst the players counterclockwise (though players don't physically move their chairs). This continues until all four players have been East (dealer). A marker is used to mark which player is East and often the round number. (In sets with racks, a rack may be marked differently to denote the dealer.)\n\nWhenever a player in the East position (dealer) wins a hand, or if there is no winner (a draw or \"goulash hand\"), an extra hand is played with the same seating positions and prevailing wind as in the previous hand. This means that a match may potentially have no limit to the number of hands played (though some players will set a limit of three consecutive hands allowed with the same seat positions and prevailing wind).\n\nExample of games:\n\nDealing tiles \n\nShuffling tiles\n\nAll tiles are placed face down on the table and are shuffled. By convention all players should participate in shuffling using both hands moving the pieces around the table rigorously and loudly for a lengthy period. Tiles may get flipped up during this process and players should flip them facing down as soon as possible to avoid identifying the location of the revealed tiles.\n\nStacking tiles\n\nEach player then stacks a row of 18 tiles, two tiles high in front of them (for a total of 36 tiles). Players then push each side of their stack together to form a square wall.\n\nRegular players usually place their stacks in a slightly diagonal position (about 20 to 30 degrees anti-clockwise); the right end of their stack is pushed slightly further in to the centre of the table to meet almost the middle of the stack of the player on the right. This creates a smaller square wall the length of about half of each stack, with walls extended away from each corner of the square. The diagonally positioned stacks and a smaller square creates a bigger space for players' tiles and also makes an ergonomic position for drawing tiles from the stack.\n\nDrawing tiles\n\nThe dealer throws three dice in the square wall and sums up the total. Counting anti-clockwise so that the dealer is 1 (or 5, 9, 13, 17), so that south (player to the right) is 2 (or 6, 10, 14, 18), etc., a player's quarter of the wall is chosen. Some house rules may use only two dice but have double throws to increase randomness. In the case of double throws, the player of the chosen wall makes the second throw.\n\nUsing the same total on the dice (or the total of the two throws), the player whose wall is chosen then counts the stacks of tiles from right to left. (For double throws, the count may extend to the left side player's stack.) This determines the location where the 'deck' of tiles is cut. Starting from the left of the stacks counted, the dealer draws four tiles for himself, and players in anti-clockwise order draw blocks of four tiles until all players have 12 tiles, so that the stacks decrease clockwise. Each player then draws one last tile to make a 13-tile hand.\n\nDealing does not have to be strictly this way and may be done quite differently based on house rules. Tiles may flip over when being dealt and players should agree in advance on how to deal with the problem. Solutions include having the dealer penalised points, shuffling the turned over piece back into the wall somehow, allowing the player who the tiles were dealt to take the piece or not (meaning the dealer must take it as his/her 14th piece) or other house rules.\n\nEach player now sets aside any Flowers or Seasons they may have drawn and takes turns to draw replacement piece(s) from the wall in the anti-clockwise direction. If a player gets any Flowers or Seasons tiles in the replacement draw, the players must wait for the next turn to draw replacement tiles.\n\nGameplay starts\n\nThe dealer draws a piece from the wall in clockwise direction, adding it to his hand. If this does not complete a legal hand, he then discards a piece (throwing it into the middle of the wall with no particular order in mind).\n\nRules \n\nEach player in turn, in anti-clockwise direction, draws a tile from the wall and then discards a tile by throwing it into the centre and, if desired, announcing out loud what the piece is. Play continues this way until one player has a legal winning hand and calls out \"Mahjong\" while revealing their hand. There are four different ways that this order of play can be interrupted.\n\nDuring play, the number of tiles maintained by each player should always be 13 tiles (meaning in each turn a tile must be picked up and another discarded). Not included in the count of 13 tiles are Flowers and Seasons set to the side and the fourth added piece of a Kong. If a player is seen to have fewer or more than 13 tiles in their hand outside of their turn they are penalised.\n\nLegal hand \n\nA winning hand consists of 14 tiles. Since players always have 13 tiles in their hand they must win by either taking a piece from the wall that completes their 14-tile hand (winning from the wall) or claiming a discard from another player which completes a 14-tile hand (winning by discard). The winning hand is made of four melds (a specific pattern of three pieces) and the eyes (a pair of identical pieces). The exceptions to this rule are the special hands listed below.\n\nMost players play with a table minimum, meaning a winning hand must score a minimum number of points (which can be seen in the scoring section). In Hong Kong Mahjong the most common point set is three but can be higher or lower depending on house rules.\n\nMelds \n\n* Melds/Pongs are a set of three identical tiles. For example:\n\n  \n\n  \n\n  \n\n  \n\nYou may form a Pong with any tile (except Flowers or Seasons because they are bonus tiles which are set aside and there are not three identical bonus tiles). The tiles must be identical (you cannot mix suits).\n* Kong is a complete set of four identical tiles. For example:\n\n   \n\n   \n\nConsider a Kong the same as a Pong with an additional tile to make a complete set of four. There are three ways to form a Kong.\n* During initial play (before the first piece is discarded by the dealer) or upon drawing a tile, a player who has a set of four matching tiles in their hand may declare a Kong. They do so by revealing the meld and placing two pieces in the middle face up and two pieces on the ends face down. This is called a concealed or hidden Kong.\n* If a player can use a discarded tile to complement three matching tiles in their hand, they can take the piece and reveal a \"Kong by discard\" or \"melded Kong\". The player reveals his three pieces face up and places the stolen discard on top of the middle tile. \n* If a player has already stolen (melded) a piece to make a Pong and then later in the game draws the fourth piece from the wall, he or she may announce (then or later in the game) a Kong by placing the fourth tile on top of the middle piece of the melded Pong. If a Pong has been melded a player cannot steal the 4th piece if another player discards it.\n\nWhenever a Kong is formed, that player must draw an extra tile from the end of the wall and then discard a tile. The fourth piece of a Kong (not Flowers/Seasons) is not considered as one of the 13 tiles a player must always have in their hand. Kongs are worth collecting to score more points and/or deprive opponents of the opportunity to obtain specific tiles.\n* Chow is a meld of three suited tiles in sequence. For example:\n\n  \n\n  \n\n  \n\n  \n\nThe meld must be in absolute numerical sequence. Players cannot skip numbers or meld from the 8 or 9 to 1 or 2. The sequence must also be in the same suit. Honours, Flowers and Seasons cannot be used to make chows because they have no numerical value. A player can steal a discard to form a chow from the player whose turn was immediately before theirs if no one else needs the tile to make Pongs, Kongs or win.\n* Eyes (also known as a pair) are two identical tiles which are an essential part of a legal winning hand. A piece cannot be stolen (melded) to form a pair of eyes unless the player simultaneously completes a legal winning hand.Lo, Amy (2001). The Book of Mahjong: An Illustrated Guide. North Clarendon, VT: Tuttle, p. 6. .\n\nFor example:\n\n \n\n \n\n \n\n \n\n \n\nInterruption of play \n\nFlower or Season \n\nWhenever a player draws a flower or season, it is announced and then placed to the side (it is not considered a part of the hand but the player with the winning hand will earn a bonus point for them) and the last tile of the wall is drawn as a replacement tile so that the player has the 14 pieces needed before their discard. This may happen successively in a player's turn.\n\nMelding another player's discard \n\nWhen a player discards a tile, other players may steal the tile to complete a meld. Stealing tiles has both advantages (quickly forming a winning hand and scoring extra points) and disadvantages such as revealing part of one's hand to other players and not being able to change the meld once declared.\n\nWhen a meld (Pong, Kong or Chow) is declared through a discard, the player must state the type of meld to be declared and place the meld face up. The player must then discard a tile, and play continues to the right. If the player who melds a discard is not directly after the discarder (in order of play), one or two players essentially miss their turn as play continues to the player after the one who declared the meld.\n\nWhen two or more players call for a discarded tile, a player taking the tile to win the hand has precedence over all others. Otherwise a player who can form a Pong or Kong takes precedence over a player who claims a Chow. Players may only call for a Chow from the discard of the player immediately prior to them, unless the tile is the final one required to complete the hand, but may call for a Pong or Kong from any player. A player may also take the tile to win the hand from any other player.\n\nGoing Mahjong \n\nIf at any point in the game a player can use another player's discard to complete a legal hand (and with the agreed minimum points), they yell out 'Mahjong', take the piece and reveal their hand, with the way of calling it out depending on variations. This ends the hand, and scoring commences. If two or three players need the piece to win, there are two ways to resolve the issue depending on agreed table rules: Either the players compete to see who would have a better hand in terms of scoring, or simply the player closest to the discarder in order of turn wins the game.\n\nAlternatively, a player may also win by drawing the tile required to complete a legal hand on his turn. This usually results in more points scored than if the player were to use another player's discard.\n\nExtra points are also scored if the dealer draws a winning hand right at the beginning of the game, or if another player uses the dealer's first discard to complete a winning hand.\n\nRobbing a Kong \n\nA rarely occurring and high-scoring feature of Hong Kong Mahjong is a move called robbing the Kong. If a player declares a Kong (by melding it or adding a fourth piece to a Pong to form a Kong or declaring a concealed Kong) and another player(s) can use that piece to complete a hand (which by logic could not be used to form a Pong or Kong as two players cannot make a Pong out of the same tile), a player may steal that piece from that player when declaring the Kong and go Mahjong (win the hand).\n\nExample winning hands \n\nBelow are examples of winning hands. A winning hand must consist of four melds (Pongs, Kongs, or Chows) and a pair (eyes) and must also score the agreed table minimum.\n\n   –    –    –    –   \n\nHand formed with four Pongs and the eyes (pair) of East wind. Only bamboo is used (no other simples), scoring extra points (clean hand). No chows are used (an all Pong/Kong hand scores extra points).\n\n   –    –    –    –  \n\nA high scoring hand formed using only circles, known as a pure hand. Hand is made of Chows, Pongs and the eyes of circles.\n\nMost players include table variations in their games, of which some non-standard are included. The hands of seven different pairs and 13 orphans are examples which do not have four melds and the eyes. They are described in more detail below.\n\nCalling out Mahjong\n\nIn Western Classical variants, this is known as creating a Mahjong, and the process of winning is called going Mahjong. Calling a Mahjong without having a legal hand or without the minimum points is usually penalized via points or with the player having to play the rest of the hand with his tiles shown to the other players face up.\n\nTurns and rounds \n\nIf the dealer wins the hand, they will remain the dealer and an extra hand is played in addition to the minimum 16 hands in a match. The same occurs if there is no winner.\n\nThe dealer position is significant in that they owe or are owed double their score.\n\nExtra points are also scored if their hand is composed of pieces that match their seat wind and or the prevailing wind.\n\nFlowers and Seasons are also scored as bonus points to the winner depending on their seat position.\n\nRhythm of play\n\nAmongst players, there may be an agreed amount of time allowed to make a call for a discarded tile before the next player takes their turn, known as the \"window of opportunity\". This may be explicitly stated in the rules; otherwise, it is generally considered that when the next player's turn starts, i.e., the tile leaves the wall, the opportunity has been lost.\n\nScoring \n\nOld Hong Kong scoring is relatively simple. There is only one winner (or if there is a draw the hand is replayed). The winner must have a legal hand that meets the minimum faan points agreed to in advance (not including any bonus points). Only the winner scores, the other players pay the winner various sums. After each hand ends, the winner counts all of his or her faan points:\n\n** individual melds\n** the composition of the entire hand\n** how the hand was won\n** bonus tiles\n** special patterns\n** and a few other special criteria.\n* In order to win, a player needs to have at least the minimum faan value agreed in advance (often 3). Bonus tiles and a few other elements are not included in the minimum faan value a player needs to form a legal winning hand. (i.e. in a three faan minimum game, if a player has two faan points and one bonus point, the player has not met the proper requirements to win and will need to gain another faan point before calling mahjong. Though the bonus points cannot be including in the minimum points needed to win, they are including in the overall score after a player wins\n* The other players do not score their hand. Once the winner has added his or her points (faan points plus bonus points) they must be converted into base points (the chart is below). These base points represent how much the opponents pay to the winner\n* Players then pay the winner (in money or when not gambling with \"chips or points\") based on 3 factors:\n** the based points (faan points and bonus points converted into a payment unit)\n** if the player won from the wall (doubles the points)\n** if the player was the dealer or not (doubles the points)\n\nfaan value \n\nBasic faan value \n\nA winning hand must include an agreed minimum amount of faan value (often 3)\n\nBonus faan \n\nA player only scores a bonus faan for Flowers or Seasons if it is their own flower or season (East1, South\n2, West3 and North\n4) or if the player has all four Flowers or all four Seasons (scoring 5 faan in total).\n\nPayment \n\nThe losers pay the winning player points based on several criteria and depending on whether the game is for fun or for money. How points are reckoned is agreed by players beforehand. For example, they can keep a tally, exchange chips or pay one another with money. The faan value of a hand is converted into base points which are then used to calculate the points the losers pay the winner. The table is progressive, doubling the amount of base points when reaching a certain faan point target. The following is the Old Hong Kong simplified table, for other tables see Hong Kong Mahjong scoring rules.\n\nThis table is based on play where 3 faan is the minimum needed in order to win with a legal hand. If a player has 3 faan then his hand is worth one base point. A winning hand with 9 faan is worth four base points. Losing players must give the winning player the value of these base points. The following special cases result in doubled base points:\n* If the winner wins from the wall his base points are doubled\n* If the hand was won by discard, the discarder doubles the amount he owes the winner\n* If the winner is east all losers double the basepoints\n* If east player is a losing player he pays double the points to the winner.\n\nIf two of these criteria apply to any player, he must double and then redouble the points owed to the winner.\n\nExamples \n\nHong Kong Mahjong is essentially a payment system of doubling and redoubling where winning from the wall adds great value to the final payment and where the dealer is highly rewarded or penalised if he or she wins or loses.\n\nLimit hands \n\nThere are a series of \"limit hands\". Table rules dictate if these rare and special hands are allowed, which ones, and the limit for scoring. A common scoring limit is 64 points, which is the highest base points doubled twice. A winner receives the scoring limit from each player without any doubling.\n\nIn some cases it is expected that the hand be achieved without calling any sets, except when winning, or that it be won from the wall.\n\nSome groups also play with the \"great Flowers\" rule. If a player picks up all four Flowers and all four Seasons during their hand, they instantly win the hand and receive the maximum points from all of the players. This is exceptionally rare.\n\nExamples of high-scoring hands \n\nAll-Pong hand ()\n\n   -    -    -    -  \n\nKong hand / 18 Arhats hand ()\n\n    -     -     -     -  \n\nClean hand ()\n\n   -    -    -    -   \n\nPure hand ()\n\n   -    -    -    -  \n\nGreat winds hand ()\n\n   -    -    -    -  \n\nGreat dragons hand ()\n\n   -    -    -    -  \n\nThirteen orphans hand ()\n\n             \n\nVariations \n\nVariations may have far more complicated scoring systems, add or remove tiles, and include far more scoring elements and limit hands.\n\nIn many places, players often observe one version and are either unaware of other variations or claim that different versions are incorrect. Many variations today differ only by scoring:\n\n* Chinese classical Mahjong is the oldest surviving variety of Mahjong and was the version introduced to America in the 1920s under various names. It has a small, loyal following in the West, although few play it in Asia. All players score and it is possible to score higher than the winner.\n* Hong Kong Mahjong or Cantonese Mahjong is a more common form of Mahjong, differing in minor scoring details from the Chinese Classical variety. It does not allow multiple players to win from a single discard.\n* Competition Mahjong is an international standard founded by All-China Sports Federation in July 1998 that some Mahjong societies have adopted for competition play and in some cases for all play.\n* Sichuan Mahjong is a growing variety, particularly in southern China, disallowing chi melds, and using only the suited tiles. Play continues until a loser is decided or a draw. It can be played very quickly.\n* Wuhan Mahjong is growing rapidly and become popular in southern China. It's different from other parts of China in a way that 1) it has a tile that can be used as everything, called Laizi (), and 2) you have to have a set of special 2 tiles, namely 2, 5, 8, as prerequisite for winning. Another variation has become the new trend, it's called . Special tiles need to be discarded ().\n* Changsha Mahjong is widely played in Hunan Province. Like Wuhan Mahjong, players need to obtain special Jong consisting of only tiles of 2, 5 or 8. Changsha Mahjong forbids using winds and some special tiles, those tiles are first drawn out from the table when playing. Winners each round get a special drawing session for bonuses, usually doubling the score.\n* Tianjin Mahjong using normally 7 jokers, with special scoring such as joker-free, joker-waiting-pair, catch-5, dragon, joker-suited-dragon.\n* Shenyang Mahjong using 13 hands in a game, and Shenyang Mahjong has a really fast speed on playing, which allegedly might be said in some regard to perhaps match the personality of North-east people in China. Also in Shenyang Mahjong, the player must to have Bamboos, Characters, Circles and number one or 9 in his hand. In addition, the players have to Pong before they Chow, so there is no chance to win even if some players win at the first time they have their hands in hand.\n* Taiwanese Mahjong is the variety prevalent in Taiwan and involves hands of 16 tiles (as opposed to the 13-tile hands in other versions), features bonuses for dealers and recurring dealerships, and allows multiple players to win from a single discard.\n* Filipino Mahjong, 16 tile hands. Certain tiles can be wild. Honors are treated as bonuses.\n* Fujian Mahjong, 13 tile hands. Certain tiles can be wild. No dragons. Winds are treated as bonuses.\n* Shanxi Mahjong, or Lisi (Raise 4; ), the players must win with the first four blocks drawn which are placed separately in front of other. These four blocks cannot be touched until the player has a ready hand.\n* Singaporean/Malaysian Mahjong are two similar variants with much in common with Hong Kong mahjong. Unique elements of Singaporean/Malaysian Mahjong are the use of four animal bonus tiles (cat, mouse, cockerel, and centipede) as well as certain alternatives in the scoring rules, which allow payouts midway through the game if certain conditions (such as a kang) are met. Melds may also be presented in a form different to most other variations.\n* South African Mahjong is a variant of Cantonese Mahjong. It is very similar in terms of game play and follows most of the rules and regulations of Cantonese Mahjong. However, there are some minor differences in scoring, e.g. the limit on the maximum points a hand can be rewarded is 3 or 4 fan depending on the house rules. A chicken hand (gai wu) is normally considered a value hand. Depending on the house rules Flowers may also be used to boost scoring.\n* Thai Mahjong has eight specialized jokers with eight extra flowers and eight animals for a total of 168 tiles.\n* Vietnamese Mahjong has the same eight specialized jokers but with only eight different extra flowers for a total of 160 tiles. Modern variant triplicates or quadruplicates the jokers for a total of 176 or 184 tiles.\n* Japanese classical Mahjong is still used in tournaments. It is closer to the Chinese classical scoring system but only the winner scores. \n* Japanese Mahjong is a standardized form of Mahjong in Japan and is also found prevalently in video games. In addition to scoring changes, the rules of rīchi (ready hand) and dora (bonus tiles) are unique highlights of this variant. In addition, tile discards are specifically arranged in front of each player by discard order, to take discarded tiles into account during play.  Some rules replace some number 5 tiles with red tiles so that they can eventually get more value. \n* Korean Mahjong is unique in many ways and is an excellent version for three players. One suit is omitted completely (usually the Bamboo set or 2–8 of bamboo) as well as the Seasons. The scoring is simpler and the play is faster. No melded chows are allowed and concealed hands are common. Riichi (much like its Japanese cousin) is an integral part of the game as well.[http://mahjong.wikidot.com/rules:korean-overview Korean Rules]\n* Pussers bones is a fast-moving variant developed by sailors in the Royal Australian Navy. It uses an alternative vocabulary, such as Eddie, Sammy, Wally, and Normie, instead of East, South, West, and North respectively.\n* Western classical Mahjong is a descendant of the version of Mahjong introduced by Babcock to America in the 1920s. Today, this term largely refers to the \"Wright-Patterson\" rules, used in the U.S. military, and other similar American-made variants that are closer to the Babcock rules.\n* American Mahjong is a form of Mahjong standardized by the National Mah Jongg League and the American Mah-Jongg Association.[http://amja.net American Mah-Jongg Association] It uses joker tiles, the Charleston, plus melds of five or more tiles, treats bonus tiles as honors, and eschews the Chow and the notion of a standard hand. Legal hands are changed annually. Purists claim that this makes American Mahjong a separate game. In addition, the NMJL and AMJA variations, which have minor scoring differences, are commonly referred to as Mahjongg or mah-jongg (with 2 Gs, often hyphenated).\n* Mah Jongg Card Game by Winning Moves is a card game variant based on the basic Mah Jongg game.\n\nThree-player Mahjong (or 3-ka) is a simplified three-person Mahjong that involves hands of 13 tiles (with a total of 84 tiles on the table) and may use jokers depending on the variation. Any rule set can be adapted for three players; however, this is far more common and accepted in Japan, Korea, Malaysia and the Philippines. It usually eliminates one suit entirely, or tiles 2-8 in one suit leaving only the terminals. It needs fewer people to start a game and the turnaround time of a game is short—hence, it is considered a fast game. In some versions there is a jackpot for winning in which whoever accumulates a point of 10 is considered to hit the jackpot or whoever scores three hidden hands first. The Malaysian and Korean versions drop one wind and may include a seat dragon.The Mahjong Wiki.[http://mahjong.wikidot.com/rules:three-player Three-player mahjong]. Retrieved 17 November 2017.\n\nEquipment \n\nTables \n\nMahjong tables are square and small enough to be within arms-length of all equipment. The edges are raised to prevent tiles from sliding off and the surface is covered in felt to limit wear on the tiles. Automatic dealing tables are available, often used for high stakes playing and tournaments, are able to shuffle tiles, build walls, and randomize dice. It is an elaborate device built into a table which uses two alternating sets of tiles. It prepares one wall while the players play one hand. After the hand is finished the tiles are dropped into the table and a new wall raises upwards. In theory the table should avoid cheating (by staking the deck and or using loaded dice).\n\nTiles\n\nThe following chart shows the most generic set of tiles \n\nThere are variations that feature specific use of tiles. Some three-player versions remove the North Wind and one Chinese provincial version has no honors. Korean Mahjong removes the bamboo suit or at least its numbers 2–8 so that terminals can be used. Japanese Mahjong rarely uses Flowers or Seasons. The Seasons are removed in Korean Mahjong, while many Southeast Asian sets have more flower series.\n\nWild cards and jokers \n\nSome players accept wild cards () when playing Mahjong. The wild cards are decided at the beginning of the game. The wild card can be the next tile after spreading tiles to all players or separately decided by a dice toss. Wild cards are not allowed to be discarded and can replace any tiles in Chows. Wildcards can't replace any tiles in Pongs and Kongs. For example, if a character 4 taken out, then character 4 and the next number 5 can be used as wild cards in this round (When the tile showed, the tiles of the same pattern left only 3, so the next tile in the suit will be used as wild cards as well, adding to 7 wild cards for 4 players). Also, if a tile numbered 9 is chosen, then the number 9 and 1 are wild cards.\n\nAlso, if the chosen tile is not in the suited tiles, the wild cards are decided in rules:\n\nThe bonus tiles are not available for wild cards.\n\nA feature of several variations of Mahjong, most notably in American mahjong, is the notion of some number of  Joker tiles. They may be used as a wild card: a substitute for any tile in a hand, or, in some variations, only tiles in melds. Another variation is that the Joker tile may not be used for melding. Depending on the variation, a player may replace a Joker tile that is part of an exposed meld belonging to any player with the tile it represents.\n\nRules governing discarding Joker tiles also exist; some variations permit the Joker tile to take on the identity of any tile, and others only permit the Joker tile to take on the identity of the previously discarded tile (or the absence of a tile, if it is the first discard).\n\nJoker tiles may or may not affect scoring, depending on the variation. Some special hands may require the use of Joker tiles (for example, to represent a \"fifth tile\" of a certain suited or honor tile).\n\nIn American Mahjong, it is illegal to pass Jokers during the Charleston.\n\nFlowers \n\nJapanese rule sets discourage the use of Flowers and Seasons. Korean rules and three-player Mahjong in the Korean/Japanese tradition use only Flowers. In Singapore and Malaysia an extra set of bonus tiles of four animals are used. The rule set includes a unique function in that players who get two specific animals get a one-time immediate payout from all players. In Taiwanese Mahjong, getting all eight Flowers and Seasons constitutes an automatic win of the hand and specific payout from all players.\n\nFour of the flower tiles represent the four noble plants of Confucian reckoning:\n* plum,\n* orchid,\n* chrysanthemum,\n* andbamboo.\n\n   \n\nThe other 4 flower tiles (or season tiles) represent Seasons:\n*  spring,\n*  summer,\n*  autumn,\n* andwinter.\n\n   \n\nThe animal tiles used in Thailand, Malaysia, Singapore and local variations are the animals. They represent the cat, mouse, rooster and centipede.\n\n   \n\nDice, markers, and counting pieces\n\n \nDepending on the variation, two or three dice are usually used to decide what part of the wall to start dealing from. They are six-sided dice, traditionally but not necessarily Chinese dice with red one and four pips.\n\nThe dealer marker is a round or square object that the dealer places to the side to remind players who the dealer is. The wind marker may be used which indicates the current prevailing wind. In some cases the dealer marker and the wind marker are represented by one large marker, usually a small wheel where one can swivel the outer circle to indicate the prevailing wind (which the dealer holds onto), a cube with the four winds placed onto four of the sides which can be placed in a hollow square (the dealer holds onto it), or a cylinder locked into frame which can be rolled to expose the wind on the top. Japanese mahjong, especially in a gambling environment, may optionally use four yakitori markers to indicate which players have not won a hand yet and has to pay a bonus.\n\nThere are a variety of counting pieces used in different countries. They range from Chinese or Japanese counting sticks (thin sticks with various dots on them to represent various points), jetons, play money, paper and pencil or various apps on touchscreen devices used to calculate and keep scores.\n\nWalls \n\nAll tiles are placed face down and shuffled.  Each player then stacks a row of tiles two tiles high in front of him, the length of the row depending on the number of tiles in use:\n* 136 tiles: 17 stacks for each player\n** Suits of circles, bamboos, and characters + winds + dragons\n* 144 tiles: 18 stacks for each player\n* 148 tiles: 19 stacks for dealer and player opposite, 18 for rest\n* 152 tiles: 19 stacks for each player\n\nCharleston \n\nIn the American variations it is required that, before each hand begins, a Charleston be enacted. In the first exchange, three tiles are passed to the player on one's right; in the next exchange, the tiles are passed to the player opposite, followed by three tiles passed to the left. If all players are in agreement, a second Charleston is performed; however, any player may decide to stop passing after the first Charleston is complete. The Charleston is followed by an optional pass to the player across of one, two, or three tiles. The Charleston, a distinctive feature of American Mahjong, may have been borrowed from card games such as Hearts.\n\nRules \n\nJapanese and Korean Mahjong have some special rules. A player cannot win by a discard if that player had already discarded that piece, where players' discards are kept in neat rows in front of them. Players may declare ready, meaning that they need one tile to win, cannot change their hand and win extra points if they win. Some rules may replace some of the number 5 tiles with red tiles, as they can earn more points. Korean Mahjong does not allow melded (stolen) chows.\nTaiwanese Mahjong adds three tiles to a hand requiring a 5th set to be formed, making a clean hand or all Pong hand very difficult to procure.\nAmerican Mahjong has distinctive game mechanics and the article on American Mahjong details these. Some differences include many special patterns, a different scoring system and the use of jokers and five-of-a-kind.\n\nHands \n\nMany variations have specific hands, some of which are common while some are optional depending on regions and players. One example is the Pure Green hand made of chows or Pongs using 2, 3, 4, 6, 8 of bamboo and green dragon.\n\nReady hands \n\nWhen a hand is one tile short of winning (for example:             , waiting for: , , or , as  can be the eyes), the hand is said to be a ready hand (), or more figuratively, \"on the pot\". The player holding a ready hand is said to be waiting for certain tiles. It is common to be waiting for two or three tiles, and some variations award points for a hand that is waiting for one tile. In 13-tile Mahjong, the largest number of tiles for which a player can wait is 13 (the thirteen wonders, or 13 orphans, a nonstandard special hand). Ready hands must be declared in some variations of Mahjong, while other variations prohibit the same.\n\nSome variations of Mahjong, most notably Japanese and Korean ones, allow a player to declare . A declaration of rīchi is a promise that any tile drawn by the player is immediately discarded unless it constitutes a win. Standard requirements for rīchi are that the hand be closed or have no melds declared (other than a concealed Kong) and that players already have points for declaration of rīchi. A player who declares rīchi and wins usually receives a point bonus for their hand directly, and a player who won with rīchi also has the advantage to open the inner  which leads to higher possibilities to match such a card, thus has more chance to grant additional bonus. However, a player who declares rīchi and loses is usually penalised in some fashion. Declaring a nonexistent rīchi is also penalised in some way.\n\nIn some variations, a situation in which all four players declare a rīchi is an automatic drawn game, as it reduces the game down to pure luck, i.e., who gets their needed tile first.\n\nDraws \n\nIf only the dead wall remains (or if no dead wall exists and the wall is depleted) and no one has won, the hand is drawn (流局 liú jú, 黃莊 huáng zhuāng, Japanese ryūkyoku), or \"goulashed\". A new hand begins, and depending on the variant, the Game Wind may change. For example, in most playing circles in Singapore, if there is at least one Kong when the hand is a draw, the following player of the dealer becomes the next dealer; otherwise, the dealer remains dealer.\n\nJapanese Mahjong has a special rule called , which is, if three players claim the same discard in order to win, the hand is drawn. One reason for this is that there are cases in which bars of 1,000 points for declaring rīchi cannot be divided by three. The rule is treated the same as \"abortive draws\".\n\nAbortive draws \n\nIn Japanese Mahjong, rules allow abortive draws to be declared while tiles are still available. They can be declared under the following conditions:\n* : On a player's first turn when no meld has been declared yet, if a player has nine different terminal (also known as major) or honor tiles, the player may declare the hand to be drawn (for example,              , but could also go for the nonstandard thirteen wonders hand as well).\n* : On the first turn without any meld declarations, if all 4 players discard the same Wind tile, the hand is drawn.\n* : If all four players declare rīchi, the hand is drawn.\n* : The hand is drawn when the fourth Kong is declared, unless all four Kongs were declared by a single player. Still, the hand is drawn when another player declares a fifth Kong.\n\nScoring\n\nScoring in Mahjong involves points, with a monetary value for points agreed upon by players. Although in many variations scoreless hands are possible, many require that hands be of some point value in order to win the hand.\n\nWhile the basic rules are more or less the same throughout Mahjong, the greatest divergence between variations lies in the scoring systems.  Like the rules, there is a generalized system of scoring, based on the method of winning and the winning hand, from which Chinese and Japanese base their roots.  American Mahjong generally has greatly divergent scoring rules, as well as greatly divergent general rules.\n\nBecause of the large differences between the various systems of scoring (especially for Chinese variants), groups of players will often agree on particular scoring rules before a game.\n\nPoints\n\nPoints (terminology of which differs from variation to variation) are obtained by matching the winning hand with different criteria scoring different values. The points obtained may be modified into scores for each player using some (typically exponential) functions. Some criteria may be also in terms of both points and score.\n\nIn many variations the dealer receives no scoring bonus and does not maintain his/her turn by winning or a dead hand.\n\nIn classical Mahjong all players score points. Points are given for sets and hand composition and winning bonuses, doubled and redoubled for basic patterns. Sometimes a loser may score more points than a winner. Japanese Mahjong has a complex scoring system with several stages of scoring, rules and exceptions, evening out scores and bonus points at the end of a match. Korean Mahjong has a simple scoring system where only winner scores without any form of doubling.\n\nSome variations give points for concealed hands, in which case no melds are made except by winning on a discard.\n\nIn Old Hong Kong Mahjong:\n* Only the winner scores points.\n* Winning hands are scored by totaling the point value of each element in the hand. Points are distinct from the actual payment received from each player.\n* The winner receives points (also known as faan among some players) for:\n** individual melds,\n** the composition of the entire hand,\n** how the hand was won,\n** bonus tiles,\n** special patterns,\n** and a few other special criteria.\n* In order to win, a player needs to have at least the minimum points agreed in advance (often 3).\n* Bonus points are separate from the minimum points a player needs to win.\n* If a player goes Mahjong with a legal and minimum hand, his/her hand is scored by adding his/her points and bonus points together.\n* The payment received from each player depends on three factors:\n** the point value of the hand,\n** if the player won from a discard or from the wall, and\n** if the player was the dealer or not.\n\nComparison \n\nMahjong solitaire\n\nA single player game employs the tiles of mahjong, usually played on computers or devices. The game is entirely unrelated to mahjong or its variations and is a recent invention. A two player version was published by Nintendo. The game involves stacking tiles face up in various elaborate patterns and removing uncovered matching tiles at the end of rows.\n\nCompetition \n\nIn 1998, in the interest of dissociating illegal gambling from Mahjong, the China State Sports Commission published a new set of rules, now generally referred to as Chinese Official rules or International Tournament rules (see Guobiao Majiang). The principles of the new, wholesome Mahjong are no gambling, no drinking, and no smoking. In international tournaments, players are often grouped in teams to emphasize that Mahjong from now on is considered a sport.\n\nThe new rules are highly pattern-based. The rulebook contains 81 combinations, based on patterns and scoring elements popular in classic and modern regional Chinese variants; some table practices of Japan have also been adopted. Points for flower tiles (each flower is worth one point) may not be added until the player has scored eight points. The winner of a game receives the score from the player who discards the winning tile, plus eight basic points from each player; in the case of zimo (self-drawn win), he receives the value of this round plus eight points from all players.\n\nThe new rules were first used in an international tournament in Tokyo, where, in 2002, the first global tournament in Mahjong was organized by the Mahjong Museum, the Japan Mahjong Organizing Committee, and the city council of Ningbo, China. One hundred players participated, mainly from Japan and China, but also from Europe and the United States. Mai Hatsune, from Japan, became the first world champion. The following year saw the first annual China Mahjong Championship, held in Hainan; the next two annual tournaments were held in Hong Kong and Beijing. Most players were Chinese; players from other nations attended as well.\n\nIn 2005, the first Open European Mahjong Championship was held in the Netherlands, with 108 players. The competition was won by Masato Chiba from Japan. The second European championship in Copenhagen(2007) was attended by 136 players and won by Danish player Martin Wedel Jacobsen. The first Online European Mahjong Championship was held on the Mahjong Time server in 2007, with 64 players, and the winner was Juliani Leo, from the U.S., and the Best European Player was Gerda van Oorschot, from the Netherlands. The Third Open European Mahjong Championship 2009 at Baden/Vienna, Austria, was won by Japanese player Koji Idota, while runner-up Bo Lang from Switzerland became European Champion. There were 152 participants.\n\nIn 2006, the World Mahjong Organization (WMO) was founded in Beijing, China, with the cooperation of, amongst others, the Japan Mahjong Organizing Committee (JMOC) and the European Mahjong Association (EMA). This organization held its first World Mahjong Championship in November 2007 in the Chinese town of Chengdu, attended by 144 participants from all over the world. It was won by Li Li, a Chinese student at Tsinghua University. The next World Championship took place in Utrecht, the Netherlands, 27 to 29 August 2010.\n\nOther major international tournaments include the Mahjong International League's World Mahjong Sports Games and the privately sponsored World Series Of Mahjong.\n\nAmerican mahjong tournaments are held in virtually every state—the largest is in Las Vegas, Nevada twice a year, and in Atlantic City, New Jersey, by Mah Jongg Madness; and the annual cruise hosted by the National Mah Jongg League and Mah Jongg Madness (MJM).  MJM tournaments host between 150 and 500 participants at these larger events; and there are several smaller scale, but equally successful tournaments held annually by other hosts. Prize pools are based on the number participating. Rules are based on the National Mah Jongg League standard rules.\n\nHistory \n\nMahjong is based on draw-and-discard card games that were popular in 18th and 19th century China, some of which are still popular today. They were played with a stripped deck of money-suited cards. Each deck is divided into three suits of Cash or coins, Strings of cash, and Myriads of strings. There are nine ranks in each suit. In addition, there are three wild cards: Red flower, White flower, and Old thousand. Depending on the game, there are multiple copies of each card.\n\nGames scholar David Parlett has written that the Western card games Conquian and Rummy share a common origin with Mahjong. All these games involve players drawing and discarding tiles or cards to make melds. Khanhoo is an early example of such a game. The most likely ancestor to Mahjong was pènghú (碰和) which was played with 120 or 150 cards. During the late 19th century, pènghú was used interchangeably with máquè in both card and tile form.\n\nIt is not known when the conversion from cards to tiles took place precisely but it most likely occurred in the middle of the 19th century. The earliest surviving tile sets date to around 1870 and were acquired in Fuzhou, Shanghai, and Ningbo.Sloper, Tom. [http://www.sloperama.com/mjfaq/mjfaq11e.htm History of Mahjong FAQ 11]. Retrieved 6 November 2015. These sets differ from modern ones in several ways. In the Glover sets, there were no \"flower\" and fā (\"green dragon\") tiles. In their place were \"king\" tiles for heaven, earth, man, and harmony and also for each of the 4 \"winds\" which may have acted as bonus tiles. In the contemporaneous Himly set, there were no zhōng (\"red dragon\") tiles either. Instead there were the wild cards known as Cash Flower, String Flower, and Myriad Flower plus an additional tile, the king of everything. These early jokers are still found in the Vietnamese and Thai sets.Sloper, Tom. [http://www.sloperama.com/majexchange/tutorial.htm Is my set complete?] at sloperama.com. Retrieved 16 May 2016. They may have been removed as the tiles share the same titles as the leaders of the Taiping Rebellion (1850–1864). For example, Hong Xiuquan was the self-styled \"Heavenly King of Great Peace\" and his top subordinates were called east king, south king, west king, and north king.\n\nThe ban on gambling after the founding of the People's Republic in 1949 led to a decline in playing. The game itself was banned during the Cultural Revolution (1966–1976). Today, it is a favorite pastime in China and other Chinese-speaking communities.\n\nMahjong in the West \n\nIn 1895, British sinologist William Henry Wilkinson wrote a paper which mentioned a set of cards known in central China by the name of ma chioh, literally, hemp sparrow, which he maintained was the origin of the term Mahjong. He did not explain the dialect of the originator or region specific etymology of this information. By 1910, there were written accounts in many languages, including French and Japanese.\n\nThe game was imported to the United States in the 1920s.\"Recalling the Craze for a Game of Chance\" By Steven Heller, New York Times, 15 March 2010 [https://www.nytimes.com/2010/03/18/arts/artsspecial/18MAH.html?ex1285473600&en\n37c8a4976aafc929&ei5087&WT.mc_id\nAR-D-I-NYT-MOD-MOD-M143-ROS-0410-L2&WT.mc_ev=click online version] The first Mahjong sets sold in the U.S. were sold by Abercrombie & Fitch starting in 1920. It became a success in Washington, D.C., and the co-owner of the company, Ezra Fitch, sent emissaries to Chinese villages to buy every Mahjong set they could find. Abercrombie & Fitch sold a total of 12,000 Mahjong sets.\n\nAlso in 1920, Joseph Park Babcock published his book Rules of Mah-Jongg, also known as the \"red book\". This was the earliest version of Mahjong known in America. Babcock had learned Mahjong while living in China. His rules simplified the game to make it easier for Americans to take up, and his version was common through the Mahjong fad of the 1920s. Later, when the 1920s fad died out, many of Babcock's simplifications were abandoned.\n\nThe game has taken on a number of trademarked names, such as \"Pung Chow\" and the \"Game of Thousand Intelligences\". Mahjong nights in America often involved dressing and decorating rooms in Chinese style.Bill Bryson, Made in America. Harper, 1996, ch. 16. Several hit songs were recorded during the Mahjong fad, most notably \"Since Ma Is Playing Mah Jong\" by Eddie Cantor.\n\nMany variants of Mahjong developed during this period. By the 1930s, many revisions of the rules developed that were substantially different from Babcock's classical version (including some that were considered fundamentals in other variants, such as the notion of a standard hand). The most common form, which eventually became \"American Mahjong\", was most popular among Jewish women. Standardization came with the formation of the National Mah Jongg League (NMJL) in 1937, along with the first American Mahjong rulebook, Maajh: The American Version of the Ancient Chinese Game, written by NMJL's first president and co-founder, Viola L. Cecil.Tom Sloper, The Red Dragon & The West Wind: The Winning Guide to Official Chinese & American Mah-Jongg, HarperCollins, 2007.\n\nMany consider the modern American version a Jewish remake, as many American Mahjong players are of Jewish descent. The NMJL was founded by Jewish players and is considered a Jewish organization. In 1986, the National Mah Jongg League conducted their first Mah Jongg Cruise Tournament, in conjunction with Mah Jongg Madness. In 2010, this large scale seagoing event hosted its 25th Silver Anniversary Cruise, with players from all over the States and Canada participating.\n\nIn 1999, a second organization was formed, the American Mah Jongg Association. The AMJA currently hosts tournaments all across North America, with their signature event being at the Trump Taj Mahal Casino Resort in Atlantic City, New Jersey before it went bankrupt and closed on October 10, 2016.\n\nIn the United Kingdom, British author Alan D. Millington revived the Chinese classical game of the 1920s with his book The Complete Book of Mah-jongg (1977). This handbook includes a formal rules set for the game.\n\nCurrent development \n\nThere are many governing bodies which often host exhibition games and tournaments for modern and traditional Mahjong gaming.\n\nMahjong, as of 2010, is the most popular table game in Japan.Pakarnian, John, \"Game Boy:  Glossary of Japanese Gambling Games\", Metropolis, 22 January 2010, p. 15. As of 2008, there were approximately 7.6 million Mahjong players in Japan and an estimated 8,900 Mahjong parlors did ¥300 billion in sales.Matsutani, Minoru, \"[http://search.japantimes.co.jp/cgi-bin/nn20100615i1.html Mah-jongg ancient, progressive]\", Japan Times, 15 June 2010, p. 3. Many devotees there believe the game is losing popularity and have taken efforts to revive it. There are several manga and anime (e.g. Saki and Akagi) devoted to dramatic and comic situations involving Mahjong.Schodt, Frederik, Manga! Manga! The World of Japanese Comics. Kodansha, 1986, Chapter 5. Since the 1980s, hundreds of different Mahjong arcade machines in Japanese video arcades have been created, including strip versions. Newer units can connect with other arcade machines across the Internet.\n\nMahjong culture is still deeply ingrained in the Chinese community. Sam Hui wrote Cantopop songs using Mahjong as their themes, and Hong Kong movies have often included scenes of Mahjong games. Many gambling movies have been filmed in Hong Kong, and a recent subgenre is the Mahjong movie.\n\nProlonged playing of Mahjong may trigger epileptic seizures according to a 2007 study. To date there are 23 reported cases of Mahjong-induced seizures in the English medical literature. Some doctors speculate that this may be due to stress and complex manual movement correlated with intense brain function similar to playing chess or card games such as poker.\n\nStudies by doctors have also shown in Hong Kong that the game is beneficial for individuals suffering from dementia or cognitive memory difficulties, leading to the development of Mahjong therapy.\n\nMahjong was also adapted into several puzzle video games such as Mahjong Trails, listed as one of the top grossing games on Facebook.\n\nSuperstitions \n\nEven though both skill and chance play a fundamental role in the game, there is no shortage of superstitions in which players believe where they sit, how they hold their pieces or objects they have on their person will somehow affect the outcome. For example, players will try to find seats with the best Feng Shui or wear their lucky clothing or trinkets. Some believe that specific pieces (one dot for example) bode bad luck if received in their opening hand\n\nMore elaborated superstitions in Mahjong include those found in the game poker, not counting one's wins and losses, to the comical like changing one's undergarments after a loss. As with all superstitions in gaming, none of them have been properly demonstrated as effective though for some the rituals have become an integral part of the game experience and its aesthetics.\n\nGlossary\n\n*Bamboo also called bams or sticks; means bar of 100 pence. They are called bamboo in the US are called strings (索子) in China and Japan, in accordance with their origin.\n*Dots also known as circles, wheels or stones. Originally meant penny.\n*Characters also known as numbers and myriads, means 10000 pence.\n*White dragon () \n*Red dragon () started off as a fifth Wind. \n*Green dragon (; represents ) entered the set by 1890.\n*Pong () three identical tiles, triplet\n*Kong () four identical tiles, quadruplet\n*Concealed or hidden Kong ()\n*Chow (; Cantonese: ; ) run of three tiles from the same suit\n*Calling Mahjong (Chinese (mainland China)): 和; Chinese (Taiwan): 胡; pinyin: hú; Cantonese: 糊; ) declaring a completed hand\n*Self-draw () drawing the tile required to complete a legal hand on one's turn \n*Heavenly Hand () winning hand right at the beginning of the game \n*Earthly Hand () first discard to complete a winning hand\n*The term Dragons is not used in Asian countries, where the tiles are called 三元, which roughly means three fundamentals.\n\nUnicode \n\nMahjong tiles were added to the Unicode Standard in April, 2008 with the release of version 5.1.\n\nThe Unicode block for Mahjong tiles is U+1F000–U+1F02F:. Mahjong. http://en.wikipedia.org/?curid=19496."
  }
}
