{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6313",
  "eid" : "daf3a610-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778447089,
  "textBody" : "Classical elements typically refer to the concepts in ancient Greece of earth, water, air, fire, and aether, which were proposed to explain the nature and complexity of all matter in terms of simpler substances.  Ancient cultures in Egypt, Babylonia, Japan, Tibet, and India had similar lists, sometimes referring in local languages to \"air\" as \"wind\" and the fifth element as \"void\".  The Chinese Wu Xing system lists Wood (木 mù), Fire (火 huǒ), Earth (土 tǔ), Metal (金 jīn), and Water (水 shuǐ), though these are described more as energies or transitions than as types of material.\n\nThese different cultures and even individual philosophers had widely varying explanations concerning their attributes and how they related to observable phenomena as well as cosmology.  Sometimes these theories overlapped with mythology and were personified in deities.  Some of these interpretations included atomism (the idea of very small, indivisible portions of matter) but other interpretations considered the elements to be divisible into infinitely small pieces without changing their nature.\n\nWhile the classification of the material world by the ancient Indians and Greeks into Air, Earth, Fire and Water was more philosophical, during the Islamic Golden Age medieval middle eastern scientists used practical, experimental observation to classify materials.Science and Islam, Jim Al-Khalili. BBC, 2009 In Europe, the Ancient Greek system of Aristotle evolved slightly into the medieval system, which for the first time in Europe became subject to experimental verification in the 1600s, during the Scientific Revolution.\n\nCenturies of empirical investigation have proven that all the ancient systems were incorrect explanations of the physical world.  It is now known that atomic theory is a correct explanation, and that atoms can be classified into more than a hundred chemical elements such as oxygen, iron, and mercury.  These elements form chemical compounds and mixtures, and under different temperatures and pressures, these substances can adopt different states of matter.  The most commonly observed states of solid, liquid, gas, and plasma share many attributes with the classical elements of earth, water, air, and fire, respectively, but it is now known that these states are due to similar behavior of different types of atoms at similar energy levels, and not due to containing a certain type of atom or a certain type of infinitely divisible substance or energy.\n\nAncient times\n\nIn classical thought, the four elements earth, water, air, and fire as proposed by Empedocles frequently occur; Aristotle added a fifth element, aether; it has been called akasha in India and quintessence in Europe.\n\nThe concept of the five elements formed a basis of analysis in both Hinduism and Buddhism. In Hinduism, particularly in an esoteric context, the four states-of-matter describe matter, and a fifth element describes that which was beyond the material world. Similar lists existed in ancient China, Korea and Japan. In Buddhism the four great elements, to which two others are sometimes added, are not viewed as substances, but as categories of sensory experience.\n\nEgypt\n\nA Greek text called the Kore Kosmou (\"Virgin of the World\") ascribed to Hermes Trismegistus (associated with the Egyptian god Thoth), names the four elements fire, water, air, and earth. As described in this book:\n\nAnd Isis answer made: Of living things, my son, some are made friends with fire, and some with water, some with air, and some with earth, and some with two or three of these, and some with all. And, on the contrary, again some are made enemies of fire, and some of water, some of earth, and some of air, and some of two of them, and some of three, and some of all. For instance, son, the locust and all flies flee fire; the eagle and the hawk and all high-flying birds flee water; fish, air and earth; the snake avoids the open air. Whereas snakes and all creeping things love earth; all swimming things love water; winged things, air, of which they are the citizens; while those that fly still higher love the fire and have the habitat near it. Not that some of the animals as well do not love fire; for instance salamanders, for they even have their homes in it. It is because one or another of the elements doth form their bodies' outer envelope. Each soul, accordingly, while it is in its body is weighted and constricted by these four.\n\nAccording to Galen, these elements were used by Hippocrates in describing the human body with an association with the four humours: yellow bile (fire), black bile (earth), blood (air), and phlegm (water). Medical care was flexible and primarily about helping the patient stay in or return to his/her own personal natural balanced state.\n\nCosmic elements in Babylonia\n\nIn Babylonian mythology, the cosmogony called Enûma Eliš, a text written between the 18th and 16th centuries BC, involves four gods that we might see as personified cosmic elements: sea, earth, sky, wind. In other Babylonian texts these phenomena are considered independent of their association with deities, though they are not treated as the component elements of the universe, as later in Empedocles.\n\nIndia\n\nHinduism\n\nThe system of five elements are found in Vedas, especially Ayurveda, the pancha mahabhuta, or \"five great elements\", of Hinduism are bhūmi (earth), ap or jala (water), tejas or agni (fire), marut, vayu or pavan (air or wind) and vyom or shunya (space or zero) or akash (aether or void). They further suggest that all of creation, including the human body, is made up of these five essential elements and that upon death, the human body dissolves into these five elements of nature, thereby balancing the cycle of nature.\n\nThe five elements are associated with the five senses, and act as the gross medium for the experience of sensations. The basest element, earth, created using all the other elements, can be perceived by all five senses – (i) hearing, (ii) touch, (iii) sight, (iv) taste, and (v) smell. The next higher element, water, has no odor but can be heard, felt, seen and tasted. Next comes fire, which can be heard, felt and seen. Air can be heard and felt. \"Akasha\" (aether) is beyond the senses of smell, taste, sight, and touch; it being accessible to the sense of hearing alone.\n\nBuddhism\n\nIn the Pali literature, the mahabhuta (\"great elements\") or catudhatu (\"four elements\") are earth, water, fire and air.  In early Buddhism, the four elements are a basis for understanding suffering and for liberating oneself from suffering. The earliest Buddhist texts explain that the four primary material elements are the sensory qualities solidity, fluidity, temperature, and mobility; their characterization as earth, water, fire, and air, respectively, is declared an abstraction – instead of concentrating on the fact of material existence, one observes how a physical thing is sensed, felt, perceived.\n\nThe Buddha's teaching regarding the four elements is to be understood as the base of all observation of real sensations rather than as a philosophy. The four properties are cohesion (water), solidity or inertia (earth), expansion or vibration (air) and heat or energy content (fire). He promulgated a categorization of mind and matter as composed of eight types of \"kalapas\" of which the four elements are primary and a secondary group of four are color, smell, taste, and nutriment which are derivative from the four primaries.\n\nThanissaro Bhikkhu (1997) renders an extract of Shakyamuni Buddha's from Pali into English thus:\n\nTibetan Buddhist medical literature speaks of the Panch Mahābhūta (five elements).\n\nChina\n\nThe Chinese had a somewhat different series of elements, namely Fire, Earth, Metal (literally gold), Water and Wood, which were understood as different types of energy in a state of constant interaction and flux with one another, rather than the Western notion of different kinds of material.\n\nAlthough it is usually translated as \"element\", the Chinese word xing literally means something like \"changing states of being\", \"permutations\" or \"metamorphoses of being\". In fact Sinologists cannot agree on any single translation. The Chinese elements were seen as ever changing and movingone translation of wu xing is simply \"the five changes\".\n\nThe Wu Xing are chiefly an ancient mnemonic device for systems with five stages; hence the preferred translation of \"movements\", \"phases\" or \"steps\" over \"elements.\"\n\nIn the bagua, metal is associated with the divination figure 兌 Duì (☱, the lake or marsh: 澤/泽 zé) and with 乾 Qián (☰, the sky or heavens: 天 tiān). Wood is associated with 巽 Xùn (☴, the wind: 風/风 fēng) and with 震 Zhèn (☳, the arousing/thunder: 雷 léi). In view of the durability of meteoric iron, metal came to be associated with the aether, which is sometimes conflated with Stoic pneuma, as both terms originally referred to air (the former being higher, brighter, more fiery or celestial and the latter being merely warmer, and thus vital or biogenetic). In Taoism, qi functions similarly to pneuma in a prime matter (a basic principle of energetic transformation) that accounts for both biological and inanimate phenomena.\n\nIn Chinese philosophy the universe consists of heaven and earth. The five major planets are associated with and even named after the elements: Jupiter 木星 is Wood (木), Mars 火星 is Fire (火), Saturn 土星 is Earth (土), Venus 金星 is Metal (金), and Mercury 水星 is Water (水). Also, the Moon represents Yin (陰), and the Sun 太陽 represents Yang (陽). Yin, Yang, and the five elements are associated with themes in the I Ching, the oldest of Chinese classical texts which describes an ancient system of cosmology and philosophy. The five elements also play an important part in Chinese astrology and the Chinese form of geomancy known as Feng shui.\n\nThe doctrine of five phases describes two cycles of balance, a generating or creation (生, shēng) cycle and an overcoming or destruction (克/剋, kè) cycle of interactions between the phases.\n\nGenerating\n* Wood feeds fire;\n* Fire creates earth (ash);\n* Earth bears metal;\n* Metal collects water;\n* Water nourishes wood.\n\nOvercoming\n* Wood parts earth;\n* Earth absorbs water;\n* Water quenches fire;\n* Fire melts metal;\n* Metal chops wood.\n\nThere are also two cycles of imbalance, an overacting cycle (cheng) and an insulting cycle (wu).\n\nGreece\n\nThe ancient Greek belief in five basic elements, these being earth (γῆ  ge), water (ὕδωρ hudor), air (ἀήρ aer), fire (πῦρ pur) and aether (αἰθήρ aither), dates from pre-Socratic times and persisted throughout the Middle Ages and into the Renaissance, deeply influencing European thought and culture. These five elements are sometimes associated with the five platonic solids.\n\nSicilian philosopher Empedocles (ca. 450 BC) proved (at least to his satisfaction) that air was a separate substance by observing that a bucket inverted in water did not become filled with water, a pocket of air remaining trapped inside.Russell, p. 72  Prior to Empedocles, Greek philosophers had debated which substance was the primordial element from which everything else was made; Heraclitus championed fire, Thales supported water, and Anaximenes plumped for air.Russell, p. 61 Anaximander argued that the primordial substance was not any of the known substances, but could be transformed into them, and they into each other.Russell, p. 46  Empedocles was the first to propose four elements, fire, earth, air, and water.Russell, pp. 62, 75  He called them the four \"roots\" (ῥιζὤματα, rhizōmata).\n\nPlato seems to have been the first to use the term \"element (στοιχεῖον, stoicheion)\" in reference to air, fire, earth, and water.  The ancient Greek word for element, stoicheion (from stoicheo, \"to line up\") meant \"smallest division (of a sun-dial), a syllable\", as the composing unit of an alphabet it could denote a letter and the smallest unit from which a word is formed. A similar alphabetic metaphor may be the origin of the equivalent Latin word elementum (from which the English word comes), possibly based on the names of the letters 'l', 'm', and 'n', though the validity of this idea is debated.\n\nIn his On Generation and Corruption,τὸ μὲν γὰρ πῦρ θερμὸν καὶ ξηρόν, ὁ δ' ἀὴρ θερμὸν καὶ ὑγρόν (οἷον ἀτμὶς γὰρ ὁ ἀήρ), τὸ δ' ὕδωρ ψυχρὸν καὶ ὑγρόν, ἡ δὲ γῆ ψυχρὸν καὶ ξηρόν [http://el.wikisource.org/wiki/%CE%A0%CE%B5%CF%81%CE%AF_%CE%93%CE%B5%CE%BD%CE%AD%CF%83%CE%B5%CF%89%CF%82_%CE%BA%CE%B1%CE%B9_%CE%A6%CE%B8%CE%BF%CF%81%CE%AC%CF%82/2#.CE.9A.CE.B5.CF.86.CE.AC.CE.BB.CE.B1.CE.B9.CE.BF_3] Aristotle related each of the four elements to two of the four sensible qualities:\n* Fire is both hot and dry.\n* Air is both hot and wet (for air is like vapor, ἀτμὶς).\n* Water is both cold and wet.\n* Earth is both cold and dry.\n\nA classic diagram has one square inscribed in the other, with the corners of one being the classical elements, and the corners of the other being the properties. The opposite corner is the opposite of these properties, \"hot – cold\" and \"dry – wet\".\n\nAristotle added a fifth element, aether, as the quintessence, reasoning that whereas fire, earth, air, and water were earthly and corruptible, since no changes had been perceived in the heavenly regions, the stars cannot be made out of any of the four elements but must be made of a different, unchangeable, heavenly substance.\n\nThe Neoplatonic philosopher, Proclus, rejected Aristotle's theory relating the elements to the sensible qualities hot, cold, wet, and dry.  He maintained that each of the elements has three properties. Fire is sharp, subtle, and mobile while its opposite, earth, is blunt, dense, and immobile; they are joined by the intermediate elements, air and water, in the following fashion:\n\nTibet\n\nIn Bön or ancient Tibetan philosophy, the five elemental processes of earth, water, fire, air and space are the essential materials of all existent phenomena or aggregates.  The elemental processes form the basis of the calendar, astrology, medicine, psychology and are the foundation of the spiritual traditions of shamanism, tantra and Dzogchen.\n\nTenzin Wangyal Rinpoche states that\n\nThe names of the elements are analogous to categorised experiential sensations of the natural world.  The names are symbolic and key to their inherent qualities and/or modes of action by analogy.  In Bön the elemental processes are fundamental metaphors for working with external, internal and secret energetic forces.  All five elemental processes in their essential purity are inherent in the mindstream and link the trikaya and are aspects of primordial energy. As Herbert V. Günther states:\n\nIn the above block quote the trikaya is encoded as: dharmakaya \"god\"; sambhogakaya \"temple\" and nirmanakaya \"house\".\n\nMedieval\n\nAlchemy\n\nThe elemental system used in Medieval alchemy was developed primarily by the Persian-Arab alchemist Jābir ibn Hayyān (Geber). His system consisted of the four classical elements of air, earth, fire, and water, in addition to two philosophical elements: sulphur, characterizing the principle of combustibility, \"the stone which burns\"; and mercury, characterizing the principle of metallic properties. They were seen by early alchemists as idealized expressions of irreducibile components of the universe and are of larger consideration within philosophical alchemy.\n\nThe three metallic principles—sulphur to flammability or combustion, mercury to volatility and stability, and salt to solidity—became the tria prima of the Swiss alchemist Paracelsus. He reasoned that Aristotle’s four element theory appeared in bodies as three principles. Paracelsus saw these principles as fundamental and justified them by recourse to the description of how wood burns in fire. Mercury included the cohesive principle, so that when it left in smoke the wood fell apart. Smoke described the volatility (the mercurial principle), the heat-giving flames described flammability (sulphur), and the remnant ash described solidity (salt).Strathern, 2000. Page 79.\n\nIslamic\n\nThe Islamic philosophers al-Kindi, Avicenna and Fakhr al-Din al-Razi connected the four elements with the four natures heat and cold (the active force), and dryness and moisture (the recipients).Rafati, Vahid. [http://bahai-library.com/rafati_hikmat_agents_patients Lawh-i-Hikmat: The Two Agents and the Two Patients]. `Andalib, vol. 5, no. 19, pp. 29-38.\n\nJapan\n\nJapanese traditions use a set of elements called the  (godai, literally \"five great\"). These five are earth, water, fire, wind/air, and void. These came from Indian Vastu shastra philosophy and Buddhist beliefs; in addition, the classical Chinese elements (, wu xing) are also prominent in Japanese culture, especially to the influential Neo-Confucianists during the medieval Edo period.\n\n* Earth represented things that were solid.\n* Water represented things that were liquid.\n* Fire represented things that destroy.\n* Air represented things that moved.\n* Void or Sky/Heaven represented things not of our everyday life.\n\nWestern astrology\n\nWestern astrology uses the four classical elements in connection with astrological charts and horoscopes. The twelve signs of the zodiac are divided into the four elements: Fire signs are Aries, Leo and Sagittarius, Earth signs are Taurus, Virgo and Capricorn, Air signs are Gemini, Libra and Aquarius, and Water signs are Cancer, Scorpio, and Pisces.\n\nModern \n\nThe Aristotelian tradition and medieval Alchemy eventually gave rise to modern scientific theories and new taxonomies. By the time of Antoine Lavoisier, for example, a list of elements would no longer refer to classical elements.[http://web.lemoyne.edu/~giunta/lavtable.html Antoine Lavoisier (1743-1794)], in [http://web.lemoyne.edu/~giunta/index.html Classic Chemistry], compiled by Carmen Giunta Some modern scientists see a parallel between the classical elements and the four states of matter: solid, liquid, gas and weakly ionized plasma.\n\nModern science recognizes classes of elementary particles which have no substructure (or rather, particles that are not made of other particles) and composite particles having substructure (particles made of other particles).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Classical element" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6313" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Classical elements typically refer to the concepts in ancient Greece of earth, water, air, fire, and aether, which were proposed to explain the nature and complexity of all matter in terms of simpler substances.  Ancient cultures in Egypt, Babylonia, Japan, Tibet, and India had similar lists, sometimes referring in local languages to \"air\" as \"wind\" and the fifth element as \"void\".  The Chinese Wu Xing system lists Wood (木 mù), Fire (火 huǒ), Earth (土 tǔ), Metal (金 jīn), and Water (水 shuǐ), though these are described more as energies or transitions than as types of material.\n\nThese different cultures and even individual philosophers had widely varying explanations concerning their attributes and how they related to observable phenomena as well as cosmology.  Sometimes these theories overlapped with mythology and were personified in deities.  Some of these interpretations included atomism (the idea of very small, indivisible portions of matter) but other interpretations considered the elements to be divisible into infinitely small pieces without changing their nature.\n\nWhile the classification of the material world by the ancient Indians and Greeks into Air, Earth, Fire and Water was more philosophical, during the Islamic Golden Age medieval middle eastern scientists used practical, experimental observation to classify materials.Science and Islam, Jim Al-Khalili. BBC, 2009 In Europe, the Ancient Greek system of Aristotle evolved slightly into the medieval system, which for the first time in Europe became subject to experimental verification in the 1600s, during the Scientific Revolution.\n\nCenturies of empirical investigation have proven that all the ancient systems were incorrect explanations of the physical world.  It is now known that atomic theory is a correct explanation, and that atoms can be classified into more than a hundred chemical elements such as oxygen, iron, and mercury.  These elements form chemical compounds and mixtures, and under different temperatures and pressures, these substances can adopt different states of matter.  The most commonly observed states of solid, liquid, gas, and plasma share many attributes with the classical elements of earth, water, air, and fire, respectively, but it is now known that these states are due to similar behavior of different types of atoms at similar energy levels, and not due to containing a certain type of atom or a certain type of infinitely divisible substance or energy.\n\nAncient times\n\nIn classical thought, the four elements earth, water, air, and fire as proposed by Empedocles frequently occur; Aristotle added a fifth element, aether; it has been called akasha in India and quintessence in Europe.\n\nThe concept of the five elements formed a basis of analysis in both Hinduism and Buddhism. In Hinduism, particularly in an esoteric context, the four states-of-matter describe matter, and a fifth element describes that which was beyond the material world. Similar lists existed in ancient China, Korea and Japan. In Buddhism the four great elements, to which two others are sometimes added, are not viewed as substances, but as categories of sensory experience.\n\nEgypt\n\nA Greek text called the Kore Kosmou (\"Virgin of the World\") ascribed to Hermes Trismegistus (associated with the Egyptian god Thoth), names the four elements fire, water, air, and earth. As described in this book:\n\nAnd Isis answer made: Of living things, my son, some are made friends with fire, and some with water, some with air, and some with earth, and some with two or three of these, and some with all. And, on the contrary, again some are made enemies of fire, and some of water, some of earth, and some of air, and some of two of them, and some of three, and some of all. For instance, son, the locust and all flies flee fire; the eagle and the hawk and all high-flying birds flee water; fish, air and earth; the snake avoids the open air. Whereas snakes and all creeping things love earth; all swimming things love water; winged things, air, of which they are the citizens; while those that fly still higher love the fire and have the habitat near it. Not that some of the animals as well do not love fire; for instance salamanders, for they even have their homes in it. It is because one or another of the elements doth form their bodies' outer envelope. Each soul, accordingly, while it is in its body is weighted and constricted by these four.\n\nAccording to Galen, these elements were used by Hippocrates in describing the human body with an association with the four humours: yellow bile (fire), black bile (earth), blood (air), and phlegm (water). Medical care was flexible and primarily about helping the patient stay in or return to his/her own personal natural balanced state.\n\nCosmic elements in Babylonia\n\nIn Babylonian mythology, the cosmogony called Enûma Eliš, a text written between the 18th and 16th centuries BC, involves four gods that we might see as personified cosmic elements: sea, earth, sky, wind. In other Babylonian texts these phenomena are considered independent of their association with deities, though they are not treated as the component elements of the universe, as later in Empedocles.\n\nIndia\n\nHinduism\n\nThe system of five elements are found in Vedas, especially Ayurveda, the pancha mahabhuta, or \"five great elements\", of Hinduism are bhūmi (earth), ap or jala (water), tejas or agni (fire), marut, vayu or pavan (air or wind) and vyom or shunya (space or zero) or akash (aether or void). They further suggest that all of creation, including the human body, is made up of these five essential elements and that upon death, the human body dissolves into these five elements of nature, thereby balancing the cycle of nature.\n\nThe five elements are associated with the five senses, and act as the gross medium for the experience of sensations. The basest element, earth, created using all the other elements, can be perceived by all five senses – (i) hearing, (ii) touch, (iii) sight, (iv) taste, and (v) smell. The next higher element, water, has no odor but can be heard, felt, seen and tasted. Next comes fire, which can be heard, felt and seen. Air can be heard and felt. \"Akasha\" (aether) is beyond the senses of smell, taste, sight, and touch; it being accessible to the sense of hearing alone.\n\nBuddhism\n\nIn the Pali literature, the mahabhuta (\"great elements\") or catudhatu (\"four elements\") are earth, water, fire and air.  In early Buddhism, the four elements are a basis for understanding suffering and for liberating oneself from suffering. The earliest Buddhist texts explain that the four primary material elements are the sensory qualities solidity, fluidity, temperature, and mobility; their characterization as earth, water, fire, and air, respectively, is declared an abstraction – instead of concentrating on the fact of material existence, one observes how a physical thing is sensed, felt, perceived.\n\nThe Buddha's teaching regarding the four elements is to be understood as the base of all observation of real sensations rather than as a philosophy. The four properties are cohesion (water), solidity or inertia (earth), expansion or vibration (air) and heat or energy content (fire). He promulgated a categorization of mind and matter as composed of eight types of \"kalapas\" of which the four elements are primary and a secondary group of four are color, smell, taste, and nutriment which are derivative from the four primaries.\n\nThanissaro Bhikkhu (1997) renders an extract of Shakyamuni Buddha's from Pali into English thus:\n\nTibetan Buddhist medical literature speaks of the Panch Mahābhūta (five elements).\n\nChina\n\nThe Chinese had a somewhat different series of elements, namely Fire, Earth, Metal (literally gold), Water and Wood, which were understood as different types of energy in a state of constant interaction and flux with one another, rather than the Western notion of different kinds of material.\n\nAlthough it is usually translated as \"element\", the Chinese word xing literally means something like \"changing states of being\", \"permutations\" or \"metamorphoses of being\". In fact Sinologists cannot agree on any single translation. The Chinese elements were seen as ever changing and movingone translation of wu xing is simply \"the five changes\".\n\nThe Wu Xing are chiefly an ancient mnemonic device for systems with five stages; hence the preferred translation of \"movements\", \"phases\" or \"steps\" over \"elements.\"\n\nIn the bagua, metal is associated with the divination figure 兌 Duì (☱, the lake or marsh: 澤/泽 zé) and with 乾 Qián (☰, the sky or heavens: 天 tiān). Wood is associated with 巽 Xùn (☴, the wind: 風/风 fēng) and with 震 Zhèn (☳, the arousing/thunder: 雷 léi). In view of the durability of meteoric iron, metal came to be associated with the aether, which is sometimes conflated with Stoic pneuma, as both terms originally referred to air (the former being higher, brighter, more fiery or celestial and the latter being merely warmer, and thus vital or biogenetic). In Taoism, qi functions similarly to pneuma in a prime matter (a basic principle of energetic transformation) that accounts for both biological and inanimate phenomena.\n\nIn Chinese philosophy the universe consists of heaven and earth. The five major planets are associated with and even named after the elements: Jupiter 木星 is Wood (木), Mars 火星 is Fire (火), Saturn 土星 is Earth (土), Venus 金星 is Metal (金), and Mercury 水星 is Water (水). Also, the Moon represents Yin (陰), and the Sun 太陽 represents Yang (陽). Yin, Yang, and the five elements are associated with themes in the I Ching, the oldest of Chinese classical texts which describes an ancient system of cosmology and philosophy. The five elements also play an important part in Chinese astrology and the Chinese form of geomancy known as Feng shui.\n\nThe doctrine of five phases describes two cycles of balance, a generating or creation (生, shēng) cycle and an overcoming or destruction (克/剋, kè) cycle of interactions between the phases.\n\nGenerating\n* Wood feeds fire;\n* Fire creates earth (ash);\n* Earth bears metal;\n* Metal collects water;\n* Water nourishes wood.\n\nOvercoming\n* Wood parts earth;\n* Earth absorbs water;\n* Water quenches fire;\n* Fire melts metal;\n* Metal chops wood.\n\nThere are also two cycles of imbalance, an overacting cycle (cheng) and an insulting cycle (wu).\n\nGreece\n\nThe ancient Greek belief in five basic elements, these being earth (γῆ  ge), water (ὕδωρ hudor), air (ἀήρ aer), fire (πῦρ pur) and aether (αἰθήρ aither), dates from pre-Socratic times and persisted throughout the Middle Ages and into the Renaissance, deeply influencing European thought and culture. These five elements are sometimes associated with the five platonic solids.\n\nSicilian philosopher Empedocles (ca. 450 BC) proved (at least to his satisfaction) that air was a separate substance by observing that a bucket inverted in water did not become filled with water, a pocket of air remaining trapped inside.Russell, p. 72  Prior to Empedocles, Greek philosophers had debated which substance was the primordial element from which everything else was made; Heraclitus championed fire, Thales supported water, and Anaximenes plumped for air.Russell, p. 61 Anaximander argued that the primordial substance was not any of the known substances, but could be transformed into them, and they into each other.Russell, p. 46  Empedocles was the first to propose four elements, fire, earth, air, and water.Russell, pp. 62, 75  He called them the four \"roots\" (ῥιζὤματα, rhizōmata).\n\nPlato seems to have been the first to use the term \"element (στοιχεῖον, stoicheion)\" in reference to air, fire, earth, and water.  The ancient Greek word for element, stoicheion (from stoicheo, \"to line up\") meant \"smallest division (of a sun-dial), a syllable\", as the composing unit of an alphabet it could denote a letter and the smallest unit from which a word is formed. A similar alphabetic metaphor may be the origin of the equivalent Latin word elementum (from which the English word comes), possibly based on the names of the letters 'l', 'm', and 'n', though the validity of this idea is debated.\n\nIn his On Generation and Corruption,τὸ μὲν γὰρ πῦρ θερμὸν καὶ ξηρόν, ὁ δ' ἀὴρ θερμὸν καὶ ὑγρόν (οἷον ἀτμὶς γὰρ ὁ ἀήρ), τὸ δ' ὕδωρ ψυχρὸν καὶ ὑγρόν, ἡ δὲ γῆ ψυχρὸν καὶ ξηρόν [http://el.wikisource.org/wiki/%CE%A0%CE%B5%CF%81%CE%AF_%CE%93%CE%B5%CE%BD%CE%AD%CF%83%CE%B5%CF%89%CF%82_%CE%BA%CE%B1%CE%B9_%CE%A6%CE%B8%CE%BF%CF%81%CE%AC%CF%82/2#.CE.9A.CE.B5.CF.86.CE.AC.CE.BB.CE.B1.CE.B9.CE.BF_3] Aristotle related each of the four elements to two of the four sensible qualities:\n* Fire is both hot and dry.\n* Air is both hot and wet (for air is like vapor, ἀτμὶς).\n* Water is both cold and wet.\n* Earth is both cold and dry.\n\nA classic diagram has one square inscribed in the other, with the corners of one being the classical elements, and the corners of the other being the properties. The opposite corner is the opposite of these properties, \"hot – cold\" and \"dry – wet\".\n\nAristotle added a fifth element, aether, as the quintessence, reasoning that whereas fire, earth, air, and water were earthly and corruptible, since no changes had been perceived in the heavenly regions, the stars cannot be made out of any of the four elements but must be made of a different, unchangeable, heavenly substance.\n\nThe Neoplatonic philosopher, Proclus, rejected Aristotle's theory relating the elements to the sensible qualities hot, cold, wet, and dry.  He maintained that each of the elements has three properties. Fire is sharp, subtle, and mobile while its opposite, earth, is blunt, dense, and immobile; they are joined by the intermediate elements, air and water, in the following fashion:\n\nTibet\n\nIn Bön or ancient Tibetan philosophy, the five elemental processes of earth, water, fire, air and space are the essential materials of all existent phenomena or aggregates.  The elemental processes form the basis of the calendar, astrology, medicine, psychology and are the foundation of the spiritual traditions of shamanism, tantra and Dzogchen.\n\nTenzin Wangyal Rinpoche states that\n\nThe names of the elements are analogous to categorised experiential sensations of the natural world.  The names are symbolic and key to their inherent qualities and/or modes of action by analogy.  In Bön the elemental processes are fundamental metaphors for working with external, internal and secret energetic forces.  All five elemental processes in their essential purity are inherent in the mindstream and link the trikaya and are aspects of primordial energy. As Herbert V. Günther states:\n\nIn the above block quote the trikaya is encoded as: dharmakaya \"god\"; sambhogakaya \"temple\" and nirmanakaya \"house\".\n\nMedieval\n\nAlchemy\n\nThe elemental system used in Medieval alchemy was developed primarily by the Persian-Arab alchemist Jābir ibn Hayyān (Geber). His system consisted of the four classical elements of air, earth, fire, and water, in addition to two philosophical elements: sulphur, characterizing the principle of combustibility, \"the stone which burns\"; and mercury, characterizing the principle of metallic properties. They were seen by early alchemists as idealized expressions of irreducibile components of the universe and are of larger consideration within philosophical alchemy.\n\nThe three metallic principles—sulphur to flammability or combustion, mercury to volatility and stability, and salt to solidity—became the tria prima of the Swiss alchemist Paracelsus. He reasoned that Aristotle’s four element theory appeared in bodies as three principles. Paracelsus saw these principles as fundamental and justified them by recourse to the description of how wood burns in fire. Mercury included the cohesive principle, so that when it left in smoke the wood fell apart. Smoke described the volatility (the mercurial principle), the heat-giving flames described flammability (sulphur), and the remnant ash described solidity (salt).Strathern, 2000. Page 79.\n\nIslamic\n\nThe Islamic philosophers al-Kindi, Avicenna and Fakhr al-Din al-Razi connected the four elements with the four natures heat and cold (the active force), and dryness and moisture (the recipients).Rafati, Vahid. [http://bahai-library.com/rafati_hikmat_agents_patients Lawh-i-Hikmat: The Two Agents and the Two Patients]. `Andalib, vol. 5, no. 19, pp. 29-38.\n\nJapan\n\nJapanese traditions use a set of elements called the  (godai, literally \"five great\"). These five are earth, water, fire, wind/air, and void. These came from Indian Vastu shastra philosophy and Buddhist beliefs; in addition, the classical Chinese elements (, wu xing) are also prominent in Japanese culture, especially to the influential Neo-Confucianists during the medieval Edo period.\n\n* Earth represented things that were solid.\n* Water represented things that were liquid.\n* Fire represented things that destroy.\n* Air represented things that moved.\n* Void or Sky/Heaven represented things not of our everyday life.\n\nWestern astrology\n\nWestern astrology uses the four classical elements in connection with astrological charts and horoscopes. The twelve signs of the zodiac are divided into the four elements: Fire signs are Aries, Leo and Sagittarius, Earth signs are Taurus, Virgo and Capricorn, Air signs are Gemini, Libra and Aquarius, and Water signs are Cancer, Scorpio, and Pisces.\n\nModern \n\nThe Aristotelian tradition and medieval Alchemy eventually gave rise to modern scientific theories and new taxonomies. By the time of Antoine Lavoisier, for example, a list of elements would no longer refer to classical elements.[http://web.lemoyne.edu/~giunta/lavtable.html Antoine Lavoisier (1743-1794)], in [http://web.lemoyne.edu/~giunta/index.html Classic Chemistry], compiled by Carmen Giunta Some modern scientists see a parallel between the classical elements and the four states of matter: solid, liquid, gas and weakly ionized plasma.\n\nModern science recognizes classes of elementary particles which have no substructure (or rather, particles that are not made of other particles) and composite particles having substructure (particles made of other particles). Classical element. http://en.wikipedia.org/?curid=6313."
  }
}
