{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4631",
  "eid" : "cf6127a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778427674,
  "textBody" : "Brian Anthony Boitano (born October 22, 1963) is an American figure skater from Sunnyvale, California. He is the 1988 Olympic champion, the 1986 and 1988 World Champion, and the 1985–1988 U.S. National Champion. He turned professional following the 1988 season. He returned to competition in 1993 and competed at the 1994 Winter Olympics, where he placed sixth.\n\nEarly life\n\nBrian Boitano was born in Mountain View, California, and as an adult has lived in San Francisco. Boitano is a graduate of Marian A. Peterson High School in Sunnyvale, California.[http://www.scu.k12.ca.us/news_and_events/hall_of_fame.htm Who's Who in Santa Clara Unified?], accessed September 6, 2006. \n\nFigure skating career\n\nEarly career\n\nBrian Boitano first made his mark on the international scene when he won the bronze medal at the 1978 World Junior Figure Skating Championships, beating future rival Brian Orser for that medal.\n\nIn 1982 Boitano became the first American to land a triple axel. In 1987 he introduced his signature jump, the 'Boitano triple lutz' in which the skater raises his left arm above his head. He attempted a quadruple jump throughout the 1986–87 season and at the 1988 World Figure Skating Championships, but did not cleanly land the jump; he double-footed the landing on two occasions.\n\nBoitano was known primarily as a jumper early in his career and he, along with several other skaters, helped push the technical envelope of men's skating. It was not until his failure to defend his World title in 1987 that he focused specifically on improving his artistry.\n\nBoitano placed second at the 1984 United States Figure Skating Championships, earning himself a trip to the 1984 Winter Olympics. He placed 5th at the Olympics, setting the stage for his success over the next four years.\n\nWorld Champion\n\nFollowing the 1984 Olympics, several skaters emerged as likely medal hopes following the retirement of Scott Hamilton.\n\nBoitano won the 1985 United States Figure Skating Championships, the first of his four titles. At the first World Championships of the post-Hamilton era in 1985, Alexander Fadeev won, with Brian Orser finishing 2nd and Boitano 3rd. He had injured tendons in his right ankle a few weeks before the 1986 U.S. Championships but went on to win his second national title. At the 1986 World Championships, Boitano took the title, while Fadeev had a disastrous free skate despite having been in an excellent position to win; Orser finished 2nd once again.\n\nDuring the 1986–87 season, Boitano had introduced two new elements to his programs: the 'Tano triple lutz and a quadruple toe loop, although he never succeeded in landing a clean quadruple jump in competition. The 1987 World Championships were held in Cincinnati, giving defending World champion Boitano a home-field advantage. The outcome of the event would set the tone for the 1988 Olympics. At Worlds, Boitano fell on his quadruple toe loop attempt and placed second.\n\nAfter losing the world title to Orser at home, Boitano and his coach Linda Leaver decided that some changes needed to be made if Boitano was to become the Olympic champion. Boitano had always been good at the technical requirements (\"The first mark\"), but he was weak on the artistic (\"the second mark\"). He was a self-described \"jumping robot.\" In order to help his growth as an artist, he hired choreographer Sandra Bezic to choreograph his programs for the 1987–1988 Olympic season.\n\nBezic choreographed two programs that featured clean lines and accentuated the skating abilities of the 5' 11\" Boitano.  The short program was based on Giacomo Meyerbeer's ballet Les Patineurs in which Boitano plays a cocky young man showing off his tricks, using movements dating back to the 19th century. In one famous moment, Boitano wipes ice shavings, also called snow, off his skate blade and tosses it over his shoulder after landing a triple axel combination. The free skating program was based on the film score, Napoleon, detailing various phases of a soldier's life.\n\nBoitano debuted his new programs at 1987 Skate Canada, held in the Saddledome in Calgary, Alberta, Canada, the same venue in which he would compete against Brian Orser for the Olympic title three months later. Boitano's new programs were received with standing ovations by the audience. Although Orser won the competition, Boitano skated clean, landing seven triple jumps, including a footwork section into a jump. He did however pop his planned 2nd triple axel.  Boitano, Leaver, and Bezic were so confident about the strength of Boitano's new programs that they omitted the quadruple toe loop, which if landed, could have put him a shoulder above Orser in technical merit.\n\nThe short program at the 1988 United States Figure Skating Championships proved to be a highlight. Boitano received marks of 6.0 from eight of the nine judges for presentation, the second mark. His free skate was flawed. Due to delays, he did not skate until after midnight. Still, Boitano won the competition, and went into the Olympics as the national champion (U.S.), as did Orser (Canadian).\n\n1988 Olympics: Battle of the Brians\n\nGoing into the Olympics, Boitano and Brian Orser each had won a World title and each had excellent, balanced repertoire, with Boitano being known as the slightly better technician and Orser as the better artist. Adding to the rivalry, Boitano and Orser were both performing military-themed programs. Boitano's was to the music of Napoleon.\n\nThe Battle of the Brians at the 1988 Winter Olympics was the highlight of Boitano's amateur career. Boitano and Orser were effectively tied going into the free skating portion of the event and whoever won that portion would win the event. Alexander Fadeev had won the compulsory figures section of the competition with Boitano second and Orser third. In the short program, Orser placed first and Boitano second. The free skating was, at the time, worth 50% of the score, and so Boitano's lead would not be enough to hold him in first place if he lost the free skate.\n\nBoitano skated a clean, technically excellent long program, with eight triple jumps, two Axels, and a triple-triple combination. Orser made one small mistake on a jump and omitted his planned second triple axel. Boitano won the Battle in a 5–4 split. Boitano won the gold medal, wearing skates with American flag appliqués that are now part of the collections of the National Museum of American History at the Smithsonian Institution.\n\nFollowing the Olympics, both Orser and Boitano went to the World Championships, which Boitano won. Boitano turned professional soon after.\n\nProfessional career and return to amateur standing\n\nFollowing the Olympics, Boitano went on to dominate competitions in the professional ranks, winning 10 straight professional competitions, including 5 consecutive World Professional Championship titles and 4 consecutive wins at the Challenge of Champions. Boitano also appeared in Carmen on Ice, for which he won an Emmy. However, Boitano wanted to return to amateur competition and make another run at the Olympics.\n\nBoitano's lobby proved successful and in June 1993, the International Skating Union (ISU) introduced a clause, commonly known as the \"Boitano rule,\" which allowed professionals to reinstate as \"amateur\" or \"eligible\" skaters. This had been the result of Boitano's active involvement during the early 1990s, which saw professionals being allowed in the Olympic Games in the sports of tennis and basketball. Boitano reinstated as an amateur to compete in the 1994 Winter Olympics in Lillehammer, Norway.\n\nBoitano competed at the 1994 United States Figure Skating Championships, led after the short program, but lost to Scott Davis in the long program in a 6–3 split decision. Boitano was named to the Olympic team. Going into the Olympics as a medal favorite in a strong field, Boitano missed his triple axel combination during the short program for the first time in his career. This mistake proved extremely costly, and knocked Boitano out of medal contention. He skated a good long program and finished 6th.\n\nBoitano returned to the professional ranks afterwards. He was inducted into the World Figure Skating Hall of Fame and the United States Figure Skating Hall of Fame in 1996.[http://www.sports-reference.com/olympics/athletes/bo/brian-boitano-1.html Brian Boitano]. sports-reference.com\n\nPersonal life\n\nIn December 2013, Boitano was named to the United States delegation to the 2014 Winter Olympics in Sochi, Russia. In conjunction with that appointment, Boitano publicly came out as gay.[https://www.usatoday.com/story/sports/olympics/sochi/2013/12/19/brian-boitano-announces-he-is-gay-sochi-delegation/4125427/ Brian Boitano announces he's gay before trip to Sochi], by Christine Brennan, at USA Today; published December 19, 2013; retrieved December 20, 2013 The Sochi games and Russia have been the targets of criticism and LGBT activism because of a Russian anti-gay \"propaganda\" law passed in June 2013. In January 2014, he told Associated Press that he had never wanted to come out until the delegation announcement.\n\nCelebrity and popular culture career\n\nSouth Park song\n\nA caricature of Boitano as a superhero appears as a semi-recurring character in the cartoon series South Park. The movie South Park: Bigger, Longer & Uncut (1999), features a musical number titled \"What Would Brian Boitano Do?\".Gwen Kapp, [http://www.sfgate.com/default/article/Tickled-by-life-Boitano-even-enjoys-South-Park-2505146.php \"Tickled by life, Boitano even enjoys 'South Park' ribbing,\"] San Francisco Chronicle, Feb. 5, 2006. He was also featured in Jesus vs. Santa.\n\nFood Network show\n\nOn August 23, 2009, Food Network debuted a new series entitled What Would Brian Boitano Make?, which borrows both its name and opening musical theme from the South Park: Bigger, Longer & Uncut song. The show features Boitano preparing meals for his friends. The series was picked up for a ten-episode second season.\n\nOther television and film appearances\n\n* Boitano starred, along with Katarina Witt and archrival Brian Orser, in the 1990 German dance film Carmen on Ice; Boitano played Don Jose. All three won an Emmy Award for \"Outstanding performance in classical music/dance programming\".\n* He was featured in the Super Bowl XXVI halftime show \"Winter Magic\" along with Gloria Estefan and Dorothy Hamill.\n* Boitano had a cameo in the 2007 film Blades of Glory as a world skating federation judge.\n* He and fellow figure skater Michelle Kwan had a cameo as themselves in the 2005 Disney film, Ice Princess, appearing as commentators during the Sectionals competition.\n* He appeared on Giada at Home for one episode.\n* He appeared as a guest judge on Top Chef Masters Season 4 episode 3. The episode is titled \"What would Brian Boitano Make?\"\n* He appeared on Fox Business Network's Stossel, episode \"Spontaneous Order\" (2/10/11).\n* He appeared in an episode of Check, Please! Bay Area, a restaurant review program which airs on KQED-TV in San Francisco.[http://blogs.kqed.org/checkplease/2013/04/27/pompeis-grotto-lillie-maes-house-of-soul-food-spqr-check-please-bay-area-reviews/ Check Please! Bay Area, Season 8, Episode 4]. blogs.kqed.org. April 27, 2013\nHe hosted a series on HGTV, called \"The Brian Boitano Project\", which premiered January 16, 2014, in which he purchased a near derelict ancestral home in Northern Italy, home to many Boitanos. During the series he gives the home in Favale di Malvaro a sympathetic restoration/renovation and shops flea markets with two nieces to find decor and furnishings. Local artisans, carpenters, masons and painters create a gem where he can live part-time and host Boitanos from afar.[http://www.hgtv.com/the-brian-boitano-project/show/index.html The Brian Boitano Project]. hgtv.com\n\nPrograms\n\nResults",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Brian Boitano" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4631" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Brian Anthony Boitano (born October 22, 1963) is an American figure skater from Sunnyvale, California. He is the 1988 Olympic champion, the 1986 and 1988 World Champion, and the 1985–1988 U.S. National Champion. He turned professional following the 1988 season. He returned to competition in 1993 and competed at the 1994 Winter Olympics, where he placed sixth.\n\nEarly life\n\nBrian Boitano was born in Mountain View, California, and as an adult has lived in San Francisco. Boitano is a graduate of Marian A. Peterson High School in Sunnyvale, California.[http://www.scu.k12.ca.us/news_and_events/hall_of_fame.htm Who's Who in Santa Clara Unified?], accessed September 6, 2006. \n\nFigure skating career\n\nEarly career\n\nBrian Boitano first made his mark on the international scene when he won the bronze medal at the 1978 World Junior Figure Skating Championships, beating future rival Brian Orser for that medal.\n\nIn 1982 Boitano became the first American to land a triple axel. In 1987 he introduced his signature jump, the 'Boitano triple lutz' in which the skater raises his left arm above his head. He attempted a quadruple jump throughout the 1986–87 season and at the 1988 World Figure Skating Championships, but did not cleanly land the jump; he double-footed the landing on two occasions.\n\nBoitano was known primarily as a jumper early in his career and he, along with several other skaters, helped push the technical envelope of men's skating. It was not until his failure to defend his World title in 1987 that he focused specifically on improving his artistry.\n\nBoitano placed second at the 1984 United States Figure Skating Championships, earning himself a trip to the 1984 Winter Olympics. He placed 5th at the Olympics, setting the stage for his success over the next four years.\n\nWorld Champion\n\nFollowing the 1984 Olympics, several skaters emerged as likely medal hopes following the retirement of Scott Hamilton.\n\nBoitano won the 1985 United States Figure Skating Championships, the first of his four titles. At the first World Championships of the post-Hamilton era in 1985, Alexander Fadeev won, with Brian Orser finishing 2nd and Boitano 3rd. He had injured tendons in his right ankle a few weeks before the 1986 U.S. Championships but went on to win his second national title. At the 1986 World Championships, Boitano took the title, while Fadeev had a disastrous free skate despite having been in an excellent position to win; Orser finished 2nd once again.\n\nDuring the 1986–87 season, Boitano had introduced two new elements to his programs: the 'Tano triple lutz and a quadruple toe loop, although he never succeeded in landing a clean quadruple jump in competition. The 1987 World Championships were held in Cincinnati, giving defending World champion Boitano a home-field advantage. The outcome of the event would set the tone for the 1988 Olympics. At Worlds, Boitano fell on his quadruple toe loop attempt and placed second.\n\nAfter losing the world title to Orser at home, Boitano and his coach Linda Leaver decided that some changes needed to be made if Boitano was to become the Olympic champion. Boitano had always been good at the technical requirements (\"The first mark\"), but he was weak on the artistic (\"the second mark\"). He was a self-described \"jumping robot.\" In order to help his growth as an artist, he hired choreographer Sandra Bezic to choreograph his programs for the 1987–1988 Olympic season.\n\nBezic choreographed two programs that featured clean lines and accentuated the skating abilities of the 5' 11\" Boitano.  The short program was based on Giacomo Meyerbeer's ballet Les Patineurs in which Boitano plays a cocky young man showing off his tricks, using movements dating back to the 19th century. In one famous moment, Boitano wipes ice shavings, also called snow, off his skate blade and tosses it over his shoulder after landing a triple axel combination. The free skating program was based on the film score, Napoleon, detailing various phases of a soldier's life.\n\nBoitano debuted his new programs at 1987 Skate Canada, held in the Saddledome in Calgary, Alberta, Canada, the same venue in which he would compete against Brian Orser for the Olympic title three months later. Boitano's new programs were received with standing ovations by the audience. Although Orser won the competition, Boitano skated clean, landing seven triple jumps, including a footwork section into a jump. He did however pop his planned 2nd triple axel.  Boitano, Leaver, and Bezic were so confident about the strength of Boitano's new programs that they omitted the quadruple toe loop, which if landed, could have put him a shoulder above Orser in technical merit.\n\nThe short program at the 1988 United States Figure Skating Championships proved to be a highlight. Boitano received marks of 6.0 from eight of the nine judges for presentation, the second mark. His free skate was flawed. Due to delays, he did not skate until after midnight. Still, Boitano won the competition, and went into the Olympics as the national champion (U.S.), as did Orser (Canadian).\n\n1988 Olympics: Battle of the Brians\n\nGoing into the Olympics, Boitano and Brian Orser each had won a World title and each had excellent, balanced repertoire, with Boitano being known as the slightly better technician and Orser as the better artist. Adding to the rivalry, Boitano and Orser were both performing military-themed programs. Boitano's was to the music of Napoleon.\n\nThe Battle of the Brians at the 1988 Winter Olympics was the highlight of Boitano's amateur career. Boitano and Orser were effectively tied going into the free skating portion of the event and whoever won that portion would win the event. Alexander Fadeev had won the compulsory figures section of the competition with Boitano second and Orser third. In the short program, Orser placed first and Boitano second. The free skating was, at the time, worth 50% of the score, and so Boitano's lead would not be enough to hold him in first place if he lost the free skate.\n\nBoitano skated a clean, technically excellent long program, with eight triple jumps, two Axels, and a triple-triple combination. Orser made one small mistake on a jump and omitted his planned second triple axel. Boitano won the Battle in a 5–4 split. Boitano won the gold medal, wearing skates with American flag appliqués that are now part of the collections of the National Museum of American History at the Smithsonian Institution.\n\nFollowing the Olympics, both Orser and Boitano went to the World Championships, which Boitano won. Boitano turned professional soon after.\n\nProfessional career and return to amateur standing\n\nFollowing the Olympics, Boitano went on to dominate competitions in the professional ranks, winning 10 straight professional competitions, including 5 consecutive World Professional Championship titles and 4 consecutive wins at the Challenge of Champions. Boitano also appeared in Carmen on Ice, for which he won an Emmy. However, Boitano wanted to return to amateur competition and make another run at the Olympics.\n\nBoitano's lobby proved successful and in June 1993, the International Skating Union (ISU) introduced a clause, commonly known as the \"Boitano rule,\" which allowed professionals to reinstate as \"amateur\" or \"eligible\" skaters. This had been the result of Boitano's active involvement during the early 1990s, which saw professionals being allowed in the Olympic Games in the sports of tennis and basketball. Boitano reinstated as an amateur to compete in the 1994 Winter Olympics in Lillehammer, Norway.\n\nBoitano competed at the 1994 United States Figure Skating Championships, led after the short program, but lost to Scott Davis in the long program in a 6–3 split decision. Boitano was named to the Olympic team. Going into the Olympics as a medal favorite in a strong field, Boitano missed his triple axel combination during the short program for the first time in his career. This mistake proved extremely costly, and knocked Boitano out of medal contention. He skated a good long program and finished 6th.\n\nBoitano returned to the professional ranks afterwards. He was inducted into the World Figure Skating Hall of Fame and the United States Figure Skating Hall of Fame in 1996.[http://www.sports-reference.com/olympics/athletes/bo/brian-boitano-1.html Brian Boitano]. sports-reference.com\n\nPersonal life\n\nIn December 2013, Boitano was named to the United States delegation to the 2014 Winter Olympics in Sochi, Russia. In conjunction with that appointment, Boitano publicly came out as gay.[https://www.usatoday.com/story/sports/olympics/sochi/2013/12/19/brian-boitano-announces-he-is-gay-sochi-delegation/4125427/ Brian Boitano announces he's gay before trip to Sochi], by Christine Brennan, at USA Today; published December 19, 2013; retrieved December 20, 2013 The Sochi games and Russia have been the targets of criticism and LGBT activism because of a Russian anti-gay \"propaganda\" law passed in June 2013. In January 2014, he told Associated Press that he had never wanted to come out until the delegation announcement.\n\nCelebrity and popular culture career\n\nSouth Park song\n\nA caricature of Boitano as a superhero appears as a semi-recurring character in the cartoon series South Park. The movie South Park: Bigger, Longer & Uncut (1999), features a musical number titled \"What Would Brian Boitano Do?\".Gwen Kapp, [http://www.sfgate.com/default/article/Tickled-by-life-Boitano-even-enjoys-South-Park-2505146.php \"Tickled by life, Boitano even enjoys 'South Park' ribbing,\"] San Francisco Chronicle, Feb. 5, 2006. He was also featured in Jesus vs. Santa.\n\nFood Network show\n\nOn August 23, 2009, Food Network debuted a new series entitled What Would Brian Boitano Make?, which borrows both its name and opening musical theme from the South Park: Bigger, Longer & Uncut song. The show features Boitano preparing meals for his friends. The series was picked up for a ten-episode second season.\n\nOther television and film appearances\n\n* Boitano starred, along with Katarina Witt and archrival Brian Orser, in the 1990 German dance film Carmen on Ice; Boitano played Don Jose. All three won an Emmy Award for \"Outstanding performance in classical music/dance programming\".\n* He was featured in the Super Bowl XXVI halftime show \"Winter Magic\" along with Gloria Estefan and Dorothy Hamill.\n* Boitano had a cameo in the 2007 film Blades of Glory as a world skating federation judge.\n* He and fellow figure skater Michelle Kwan had a cameo as themselves in the 2005 Disney film, Ice Princess, appearing as commentators during the Sectionals competition.\n* He appeared on Giada at Home for one episode.\n* He appeared as a guest judge on Top Chef Masters Season 4 episode 3. The episode is titled \"What would Brian Boitano Make?\"\n* He appeared on Fox Business Network's Stossel, episode \"Spontaneous Order\" (2/10/11).\n* He appeared in an episode of Check, Please! Bay Area, a restaurant review program which airs on KQED-TV in San Francisco.[http://blogs.kqed.org/checkplease/2013/04/27/pompeis-grotto-lillie-maes-house-of-soul-food-spqr-check-please-bay-area-reviews/ Check Please! Bay Area, Season 8, Episode 4]. blogs.kqed.org. April 27, 2013\nHe hosted a series on HGTV, called \"The Brian Boitano Project\", which premiered January 16, 2014, in which he purchased a near derelict ancestral home in Northern Italy, home to many Boitanos. During the series he gives the home in Favale di Malvaro a sympathetic restoration/renovation and shops flea markets with two nieces to find decor and furnishings. Local artisans, carpenters, masons and painters create a gem where he can live part-time and host Boitanos from afar.[http://www.hgtv.com/the-brian-boitano-project/show/index.html The Brian Boitano Project]. hgtv.com\n\nPrograms\n\nResults. Brian Boitano. http://en.wikipedia.org/?curid=4631."
  }
}
