{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17412",
  "eid" : "2be319c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778582876,
  "textBody" : "In topology, a branch of mathematics, the Klein bottle is an example of a non-orientable surface; it is a two-dimensional manifold against which a system for determining a normal vector cannot be consistently defined.  Informally, it is a one-sided surface which, if traveled upon, could be followed back to the point of origin while flipping the traveler upside down.  Other related non-orientable objects include the Möbius strip and the real projective plane. Whereas a Möbius strip is a surface with boundary, a Klein bottle has no boundary (for comparison, a sphere is an orientable surface with no boundary).\n\nThe Klein bottle was first described in 1882 by the German mathematician Felix Klein. It may have been originally named the Kleinsche Fläche (\"Klein surface\") and then misinterpreted as Kleinsche Flasche (\"Klein bottle\"), which ultimately may have led to the adoption of this term in the German language as well. [https://books.google.com/books?idYZ1L8S4osKsC&pg\nPA95 Extract of page 95]\n\nConstruction\n\nThe following square is a fundamental polygon of the Klein bottle. The idea is to 'glue' together the corresponding coloured edges so that the arrows match, as in the diagrams below. Note that this is an \"abstract\" gluing in the sense that trying to realize this in three dimensions results in a self-intersecting Klein bottle.\n\nTo construct the Klein Bottle, glue the red arrows of the square together (left and right sides), resulting in a cylinder. To glue the ends of the cylinder together so that the arrows on the circles match, you must pass one end through the side of the cylinder. This creates a circle of self-intersection - this is an immersion of the Klein bottle in three dimensions.\n\nImage:Klein Bottle Folding 1.svg\nImage:Klein Bottle Folding 2.svg\nImage:Klein Bottle Folding 3.svg\nImage:Klein Bottle Folding 4.svg\nImage:Klein Bottle Folding 5.svg\nImage:Klein Bottle Folding 6.svg\n\nThis immersion is useful for visualizing many properties of the Klein bottle. For example, the Klein bottle has no boundary, where the surface stops abruptly, and it is non-orientable, as reflected in the one-sidedness of the immersion.\n\nThe common physical model of a Klein bottle is a similar construction. The Science Museum in London has on display a collection of hand-blown glass Klein bottles, exhibiting many variations on this topological theme. The bottles date from 1995 and were made for the museum by Alan Bennett.\n\nThe Klein bottle, proper, does not self-intersect. Nonetheless, there is a way to visualize the Klein bottle as being contained in four dimensions. By adding a fourth dimension to the three-dimensional space, the self-intersection can be eliminated. Gently push a piece of the tube containing the intersection along the fourth dimension, out of the original three-dimensional space. A useful analogy is to consider a self-intersecting curve on the plane; self-intersections can be eliminated by lifting one strand off the plane.\n\nSuppose for clarification that we adopt time as that fourth dimension.  Consider how the figure could be constructed in xyzt-space.  The accompanying illustration (\"Time evolution...\") shows one useful evolution of the figure.  At t=0 the wall sprouts from a bud somewhere near the \"intersection\" point.  After the figure has grown for a while, the earliest section of the wall begins to recede, disappearing like the Cheshire Cat but leaving its ever-expanding smile behind.  By the time the growth front gets to where the bud had been, there’s nothing there to intersect and the growth completes without piercing existing structure.  The 4-figure as defined cannot exist in 3-space but is easily understood in 4-space.\n\nMore formally, the Klein bottle is the quotient space described as the square [0,1] × [0,1] with sides identified by the relations  for  and  for .\n\nProperties\n\nLike the Möbius strip, the Klein bottle is a two-dimensional manifold which is not orientable. Unlike the Möbius strip, the Klein bottle is a closed manifold, meaning it is a compact manifold without boundary. While the Möbius strip can be embedded in three-dimensional Euclidean space R3, the Klein bottle cannot. It can be embedded in R4, however.\n\nThe Klein bottle can be seen as a fiber bundle over the circle S1, with fibre S1, as follows: one takes the square (modulo the edge identifying equivalence relation) from above to be E, the total space, while the base space B is given by the unit interval in y, modulo 1~0. The projection π:E→B is then given by π([x, y]) = [y].\n\nThe Klein bottle can be constructed (in a mathematical sense, because  in reality it cannot be done without allowing the surface to intersect itself) by joining the edges of two Möbius strips together, as described in the following limerick by Leo Moser:\n\nThe initial construction of the Klein bottle by identifying opposite edges of a square shows that the Klein bottle can be given a CW complex structure with one 0-cell P, two 1-cells C1, C2 and one 2-cell D. Its Euler characteristic is therefore 1-2+1  0. The boundary homomorphism is given by ∂D \n 2C1 and ∂C1∂C1\n0, yielding the homology groups of the Klein bottle K to be H0(K,Z)Z, H1(K,Z)\nZ×(Z/2Z) and Hn(K,Z) = 0 for n>1.\n\nThere is a 2-1 covering map from the torus to the Klein bottle, because two copies of the fundamental region of the Klein bottle, one being placed next to the mirror image of the other, yield a fundamental region of the torus. The universal cover of both the torus and the Klein bottle is the plane R2.\n\nThe fundamental group of the Klein bottle can be determined as the group of deck transformations of the universal cover and has the presentation −1a>.\n\nSix colors suffice to color any map on the surface of a Klein bottle; this is the only exception to\nthe Heawood conjecture, a generalization of the four color theorem, which would require seven.\n\nA Klein bottle is homeomorphic to the connected sum of two projective planes. It is also homeomorphic to a sphere plus two cross caps.\n\nWhen embedded in Euclidean space the Klein bottle is one-sided. However, there are other topological 3-spaces, and in some of the non-orientable examples a Klein bottle can be embedded such that it is two-sided, though due to the nature of the space it remains non-orientable.\n\nDissection\n\nDissecting a Klein bottle into halves along its plane of symmetry results in two mirror image Möbius strips, i.e. one with a left-handed half-twist and the other with a right-handed half-twist (one of these is pictured on the right). Remember that the intersection pictured isn't really there.\n\nSimple-closed curves\n\nOne description of the types of simple-closed curves that may appear on the surface of the Klein bottle is given by the use of the first homology group of the Klein bottle calculated with integer coefficients. This group is isomorphic to Z×Z2. Up to reversal of orientation, the only homology classes which contain simple-closed curves are as follows: (0,0), (1,0), (1,1), (2,0), (0,1). Up to reversal of the orientation of a simple closed curve, if it lies within one of the two crosscaps that make up the Klein bottle, then it is in homology class (1,0) or (1,1); if it cuts the Klein bottle into two Möbius strips, then it is in homology class (2,0); if it cuts the Klein bottle into an annulus, then it is in homology class (0,1); and if bounds a disk, then it is in homology class (0,0).\n\nParametrization\n\nThe figure 8 immersion \n\nTo make the \"figure 8\" or \"bagel\" immersion of the Klein bottle, you can start with a Möbius strip and curl it to bring the edge to the midline; since there is only one edge, it will meet itself there, passing through the midline. It has a particularly simple parametrization as a \"figure-8\" torus with a half-twist:\n\n\\begin{align}\nx & = \\left(r + \\cos\\frac{\\theta}{2}\\sin v - \\sin\\frac{\\theta}{2}\\sin 2v\\right) \\cos \\theta\\\\\ny & = \\left(r + \\cos\\frac{\\theta}{2}\\sin v - \\sin\\frac{\\theta}{2}\\sin 2v\\right) \\sin \\theta\\\\\nz & = \\sin\\frac{\\theta}{2}\\sin v + \\cos\\frac{\\theta}{2}\\sin 2v\n\\end{align}\nfor 0 ≤ θ  2.\n\nIn this immersion, the self-intersection circle (where sin(v) is zero) is a geometric circle in the xy plane. The positive constant r is the radius of this circle. The parameter θ gives the angle in the xy plane as well as the rotation of the figure 8, and v specifies the position around the 8-shaped cross section. With the above parametrization the cross section is a 2:1 Lissajous curve.\n\n4-D non-intersecting \n\nA non-intersecting 4-D parametrization can be modeled after that of the flat torus:\n\\ \\begin{align}\nx & = R\\left(\\cos\\frac{\\theta}{2}\\cos v-\\sin\\frac{\\theta}{2}\\sin 2v\\right) \\\\\ny & = R\\left(\\sin\\frac{\\theta}{2}\\cos v+\\cos\\frac{\\theta}{2}\\sin 2v\\right) \\\\\nz & = P\\cos\\theta\\left(1+{\\epsilon}\\sin v\\right) \\\\\nw &= P\\sin\\theta\\left(1+{\\epsilon}\\sin v\\right)\n\\end{align}\n\nwhere R and P are constants that determine aspect ratio, θ and v are similar to as defined above. v determines the position around the figure-8 as well as the position in the x-y plane.  θ determines the rotational angle of the figure-8 as well and the position around the z-w plane. ε is any small constant and ε sinv is a small v depended bump in z-w space to avoid self intersection. The v bump causes the self intersecting 2-D/planar figure-8 to spread out into a 3-D stylized \"potato chip\" or saddle shape in the x-y-w and x-y-z space viewed edge on.  When ε=0 the self intersection is a circle in the z-w plane .\n\n3D pinched torus / 4D Möbius tube \n\nThe pinched torus is perhaps the simplest parametrization of the klein bottle in both three and four dimensions.  It's a torus that, in three dimensions, flattens and passes through itself on one side.  Unfortunately, in three dimensions this parametrization has two pinch points, which makes it undesirable for some applications. In four dimensions the z amplitude rotates into the w amplitude and there are no self intersections or pinch points.\n\nx(\\theta, \\varphi) = (R + r \\cos \\theta) \\cos{\\varphi}\ny(\\theta, \\varphi) = (R + r \\cos \\theta) \\sin{\\varphi}\nz(\\theta, \\varphi) = r \\sin \\theta \\cos({\\varphi/2}) \nw(\\theta, \\varphi) = r \\sin \\theta \\sin({\\varphi/2}) \n\nYou can view this as a tube or cylinder that wraps around, as in a torus, but its circular cross section flips over in four dimensions, presenting its \"backside\" as it reconnects, just as a Möbius strip cross section rotates before it reconnects.  The 3D orthogonal projection of this is the pinched torus shown above.  Just as a Möbius strip is a subset of a solid torus, the Möbius tube is a subset of a toroidally closed spherinder (solid spheritorus).\n\nBottle shape \n\nThe parametrization of the 3-dimensional immersion of the bottle itself is much more complicated. Here is a version found by Robert Israel:\n\n\\begin{align}\n    x(u,v) &= -\\frac{2}{15} \\cos u (3 \\cos{v}-30 \\sin{u}+90 \\cos^4{u} \\sin{u} \\\\\n           &\\quad -60 \\cos^6{u} \\sin{u}+5 \\cos{u} \\cos{v} \\sin{u}) \\\\\n    y(u,v) &= -\\frac{1}{15} \\sin u (3 \\cos{v}-3 \\cos^2{u} \\cos{v}-48 \\cos^4{u} \\cos{v}+ 48 \\cos^6{u} \\\\\n           &\\quad \\cos{v}-60 \\sin{u}+5 \\cos{u} \\cos{v} \\sin{u}-5 \\cos^3{u} \\cos{v} \\sin{u}-80 \\\\\n           &\\quad \\cos^5{u} \\cos{v} \\sin{u}+80 \\cos^7{u} \\cos{v} \\sin{u}) \\\\\n    z(u,v) &= \\frac{2}{15} (3+5 \\cos{u} \\sin{u}) \\sin{v}\n\\end{align}\nfor 0 ≤ u   The three are represented by\n# The \"traditional\" Klein bottle\n# Left handed figure-8 Klein bottle\n# Right handed figure-8 Klein bottle\n\nThe traditional Klein bottle embedding is achiral. The figure-8 embedding is chiral (the pinched torus embedding above is not regular as it has pinch points so it's not relevant in this section).  The three embeddings above cannot be smoothly transformed into each other in three dimensions.  If you cut the traditional Klein bottle lengthwise it deconstructs into two, oppositely chiral Möbius strips.\n\nIf you cut a left handed figure-8 Klein bottle it deconstructs into two left handed Möbius strips.  And similarly for the right handed figure-8 Klein bottle.\n\nIf the traditional Klein bottle is two color painted, this induces chirality on it, creating four homotopy classes.\n\nGeneralizations\n\nThe generalization of the Klein bottle to higher genus is given in the article on the fundamental polygon.\n\nIn another order of ideas, constructing 3-manifolds, it is known that a solid Klein bottle is topologically equivalent with the Cartesian product: \\scriptstyle M\\ddot{o}\\times I, the Möbius strip times an interval. The solid Klein bottle is the non-orientable version of the solid torus, equivalent to \\scriptstyle D^2\\times S^1.\n\nKlein surface\n\nA Klein surface is, as for Riemann surfaces, a surface with an atlas allowing the transition maps to be composed using complex conjugation. One can obtain the so-called dianalytic structure of the space.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Klein bottle" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17412" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In topology, a branch of mathematics, the Klein bottle is an example of a non-orientable surface; it is a two-dimensional manifold against which a system for determining a normal vector cannot be consistently defined.  Informally, it is a one-sided surface which, if traveled upon, could be followed back to the point of origin while flipping the traveler upside down.  Other related non-orientable objects include the Möbius strip and the real projective plane. Whereas a Möbius strip is a surface with boundary, a Klein bottle has no boundary (for comparison, a sphere is an orientable surface with no boundary).\n\nThe Klein bottle was first described in 1882 by the German mathematician Felix Klein. It may have been originally named the Kleinsche Fläche (\"Klein surface\") and then misinterpreted as Kleinsche Flasche (\"Klein bottle\"), which ultimately may have led to the adoption of this term in the German language as well. [https://books.google.com/books?idYZ1L8S4osKsC&pg\nPA95 Extract of page 95]\n\nConstruction\n\nThe following square is a fundamental polygon of the Klein bottle. The idea is to 'glue' together the corresponding coloured edges so that the arrows match, as in the diagrams below. Note that this is an \"abstract\" gluing in the sense that trying to realize this in three dimensions results in a self-intersecting Klein bottle.\n\nTo construct the Klein Bottle, glue the red arrows of the square together (left and right sides), resulting in a cylinder. To glue the ends of the cylinder together so that the arrows on the circles match, you must pass one end through the side of the cylinder. This creates a circle of self-intersection - this is an immersion of the Klein bottle in three dimensions.\n\nImage:Klein Bottle Folding 1.svg\nImage:Klein Bottle Folding 2.svg\nImage:Klein Bottle Folding 3.svg\nImage:Klein Bottle Folding 4.svg\nImage:Klein Bottle Folding 5.svg\nImage:Klein Bottle Folding 6.svg\n\nThis immersion is useful for visualizing many properties of the Klein bottle. For example, the Klein bottle has no boundary, where the surface stops abruptly, and it is non-orientable, as reflected in the one-sidedness of the immersion.\n\nThe common physical model of a Klein bottle is a similar construction. The Science Museum in London has on display a collection of hand-blown glass Klein bottles, exhibiting many variations on this topological theme. The bottles date from 1995 and were made for the museum by Alan Bennett.\n\nThe Klein bottle, proper, does not self-intersect. Nonetheless, there is a way to visualize the Klein bottle as being contained in four dimensions. By adding a fourth dimension to the three-dimensional space, the self-intersection can be eliminated. Gently push a piece of the tube containing the intersection along the fourth dimension, out of the original three-dimensional space. A useful analogy is to consider a self-intersecting curve on the plane; self-intersections can be eliminated by lifting one strand off the plane.\n\nSuppose for clarification that we adopt time as that fourth dimension.  Consider how the figure could be constructed in xyzt-space.  The accompanying illustration (\"Time evolution...\") shows one useful evolution of the figure.  At t=0 the wall sprouts from a bud somewhere near the \"intersection\" point.  After the figure has grown for a while, the earliest section of the wall begins to recede, disappearing like the Cheshire Cat but leaving its ever-expanding smile behind.  By the time the growth front gets to where the bud had been, there’s nothing there to intersect and the growth completes without piercing existing structure.  The 4-figure as defined cannot exist in 3-space but is easily understood in 4-space.\n\nMore formally, the Klein bottle is the quotient space described as the square [0,1] × [0,1] with sides identified by the relations  for  and  for .\n\nProperties\n\nLike the Möbius strip, the Klein bottle is a two-dimensional manifold which is not orientable. Unlike the Möbius strip, the Klein bottle is a closed manifold, meaning it is a compact manifold without boundary. While the Möbius strip can be embedded in three-dimensional Euclidean space R3, the Klein bottle cannot. It can be embedded in R4, however.\n\nThe Klein bottle can be seen as a fiber bundle over the circle S1, with fibre S1, as follows: one takes the square (modulo the edge identifying equivalence relation) from above to be E, the total space, while the base space B is given by the unit interval in y, modulo 1~0. The projection π:E→B is then given by π([x, y]) = [y].\n\nThe Klein bottle can be constructed (in a mathematical sense, because  in reality it cannot be done without allowing the surface to intersect itself) by joining the edges of two Möbius strips together, as described in the following limerick by Leo Moser:\n\nThe initial construction of the Klein bottle by identifying opposite edges of a square shows that the Klein bottle can be given a CW complex structure with one 0-cell P, two 1-cells C1, C2 and one 2-cell D. Its Euler characteristic is therefore 1-2+1  0. The boundary homomorphism is given by ∂D \n 2C1 and ∂C1∂C1\n0, yielding the homology groups of the Klein bottle K to be H0(K,Z)Z, H1(K,Z)\nZ×(Z/2Z) and Hn(K,Z) = 0 for n>1.\n\nThere is a 2-1 covering map from the torus to the Klein bottle, because two copies of the fundamental region of the Klein bottle, one being placed next to the mirror image of the other, yield a fundamental region of the torus. The universal cover of both the torus and the Klein bottle is the plane R2.\n\nThe fundamental group of the Klein bottle can be determined as the group of deck transformations of the universal cover and has the presentation −1a>.\n\nSix colors suffice to color any map on the surface of a Klein bottle; this is the only exception to\nthe Heawood conjecture, a generalization of the four color theorem, which would require seven.\n\nA Klein bottle is homeomorphic to the connected sum of two projective planes. It is also homeomorphic to a sphere plus two cross caps.\n\nWhen embedded in Euclidean space the Klein bottle is one-sided. However, there are other topological 3-spaces, and in some of the non-orientable examples a Klein bottle can be embedded such that it is two-sided, though due to the nature of the space it remains non-orientable.\n\nDissection\n\nDissecting a Klein bottle into halves along its plane of symmetry results in two mirror image Möbius strips, i.e. one with a left-handed half-twist and the other with a right-handed half-twist (one of these is pictured on the right). Remember that the intersection pictured isn't really there.\n\nSimple-closed curves\n\nOne description of the types of simple-closed curves that may appear on the surface of the Klein bottle is given by the use of the first homology group of the Klein bottle calculated with integer coefficients. This group is isomorphic to Z×Z2. Up to reversal of orientation, the only homology classes which contain simple-closed curves are as follows: (0,0), (1,0), (1,1), (2,0), (0,1). Up to reversal of the orientation of a simple closed curve, if it lies within one of the two crosscaps that make up the Klein bottle, then it is in homology class (1,0) or (1,1); if it cuts the Klein bottle into two Möbius strips, then it is in homology class (2,0); if it cuts the Klein bottle into an annulus, then it is in homology class (0,1); and if bounds a disk, then it is in homology class (0,0).\n\nParametrization\n\nThe figure 8 immersion \n\nTo make the \"figure 8\" or \"bagel\" immersion of the Klein bottle, you can start with a Möbius strip and curl it to bring the edge to the midline; since there is only one edge, it will meet itself there, passing through the midline. It has a particularly simple parametrization as a \"figure-8\" torus with a half-twist:\n\n\\begin{align}\nx & = \\left(r + \\cos\\frac{\\theta}{2}\\sin v - \\sin\\frac{\\theta}{2}\\sin 2v\\right) \\cos \\theta\\\\\ny & = \\left(r + \\cos\\frac{\\theta}{2}\\sin v - \\sin\\frac{\\theta}{2}\\sin 2v\\right) \\sin \\theta\\\\\nz & = \\sin\\frac{\\theta}{2}\\sin v + \\cos\\frac{\\theta}{2}\\sin 2v\n\\end{align}\nfor 0 ≤ θ  2.\n\nIn this immersion, the self-intersection circle (where sin(v) is zero) is a geometric circle in the xy plane. The positive constant r is the radius of this circle. The parameter θ gives the angle in the xy plane as well as the rotation of the figure 8, and v specifies the position around the 8-shaped cross section. With the above parametrization the cross section is a 2:1 Lissajous curve.\n\n4-D non-intersecting \n\nA non-intersecting 4-D parametrization can be modeled after that of the flat torus:\n\\ \\begin{align}\nx & = R\\left(\\cos\\frac{\\theta}{2}\\cos v-\\sin\\frac{\\theta}{2}\\sin 2v\\right) \\\\\ny & = R\\left(\\sin\\frac{\\theta}{2}\\cos v+\\cos\\frac{\\theta}{2}\\sin 2v\\right) \\\\\nz & = P\\cos\\theta\\left(1+{\\epsilon}\\sin v\\right) \\\\\nw &= P\\sin\\theta\\left(1+{\\epsilon}\\sin v\\right)\n\\end{align}\n\nwhere R and P are constants that determine aspect ratio, θ and v are similar to as defined above. v determines the position around the figure-8 as well as the position in the x-y plane.  θ determines the rotational angle of the figure-8 as well and the position around the z-w plane. ε is any small constant and ε sinv is a small v depended bump in z-w space to avoid self intersection. The v bump causes the self intersecting 2-D/planar figure-8 to spread out into a 3-D stylized \"potato chip\" or saddle shape in the x-y-w and x-y-z space viewed edge on.  When ε=0 the self intersection is a circle in the z-w plane .\n\n3D pinched torus / 4D Möbius tube \n\nThe pinched torus is perhaps the simplest parametrization of the klein bottle in both three and four dimensions.  It's a torus that, in three dimensions, flattens and passes through itself on one side.  Unfortunately, in three dimensions this parametrization has two pinch points, which makes it undesirable for some applications. In four dimensions the z amplitude rotates into the w amplitude and there are no self intersections or pinch points.\n\nx(\\theta, \\varphi) = (R + r \\cos \\theta) \\cos{\\varphi}\ny(\\theta, \\varphi) = (R + r \\cos \\theta) \\sin{\\varphi}\nz(\\theta, \\varphi) = r \\sin \\theta \\cos({\\varphi/2}) \nw(\\theta, \\varphi) = r \\sin \\theta \\sin({\\varphi/2}) \n\nYou can view this as a tube or cylinder that wraps around, as in a torus, but its circular cross section flips over in four dimensions, presenting its \"backside\" as it reconnects, just as a Möbius strip cross section rotates before it reconnects.  The 3D orthogonal projection of this is the pinched torus shown above.  Just as a Möbius strip is a subset of a solid torus, the Möbius tube is a subset of a toroidally closed spherinder (solid spheritorus).\n\nBottle shape \n\nThe parametrization of the 3-dimensional immersion of the bottle itself is much more complicated. Here is a version found by Robert Israel:\n\n\\begin{align}\n    x(u,v) &= -\\frac{2}{15} \\cos u (3 \\cos{v}-30 \\sin{u}+90 \\cos^4{u} \\sin{u} \\\\\n           &\\quad -60 \\cos^6{u} \\sin{u}+5 \\cos{u} \\cos{v} \\sin{u}) \\\\\n    y(u,v) &= -\\frac{1}{15} \\sin u (3 \\cos{v}-3 \\cos^2{u} \\cos{v}-48 \\cos^4{u} \\cos{v}+ 48 \\cos^6{u} \\\\\n           &\\quad \\cos{v}-60 \\sin{u}+5 \\cos{u} \\cos{v} \\sin{u}-5 \\cos^3{u} \\cos{v} \\sin{u}-80 \\\\\n           &\\quad \\cos^5{u} \\cos{v} \\sin{u}+80 \\cos^7{u} \\cos{v} \\sin{u}) \\\\\n    z(u,v) &= \\frac{2}{15} (3+5 \\cos{u} \\sin{u}) \\sin{v}\n\\end{align}\nfor 0 ≤ u   The three are represented by\n# The \"traditional\" Klein bottle\n# Left handed figure-8 Klein bottle\n# Right handed figure-8 Klein bottle\n\nThe traditional Klein bottle embedding is achiral. The figure-8 embedding is chiral (the pinched torus embedding above is not regular as it has pinch points so it's not relevant in this section).  The three embeddings above cannot be smoothly transformed into each other in three dimensions.  If you cut the traditional Klein bottle lengthwise it deconstructs into two, oppositely chiral Möbius strips.\n\nIf you cut a left handed figure-8 Klein bottle it deconstructs into two left handed Möbius strips.  And similarly for the right handed figure-8 Klein bottle.\n\nIf the traditional Klein bottle is two color painted, this induces chirality on it, creating four homotopy classes.\n\nGeneralizations\n\nThe generalization of the Klein bottle to higher genus is given in the article on the fundamental polygon.\n\nIn another order of ideas, constructing 3-manifolds, it is known that a solid Klein bottle is topologically equivalent with the Cartesian product: \\scriptstyle M\\ddot{o}\\times I, the Möbius strip times an interval. The solid Klein bottle is the non-orientable version of the solid torus, equivalent to \\scriptstyle D^2\\times S^1.\n\nKlein surface\n\nA Klein surface is, as for Riemann surfaces, a surface with an atlas allowing the transition maps to be composed using complex conjugation. One can obtain the so-called dianalytic structure of the space. Klein bottle. http://en.wikipedia.org/?curid=17412."
  }
}
