{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14677",
  "eid" : "16f680b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778547771,
  "textBody" : "Ireland is a parliamentary, representative democratic republic and a member state of the European Union. While the head of state is the popularly elected President of Ireland, it is a largely ceremonial position with real political power being vested in the indirectly elected Taoiseach (leader of government) who is the head of the government.\n\nExecutive power is exercised by the government which consists of no more than 15 cabinet ministers, inclusive of the Taoiseach and Tánaiste (deputy leader of government). Legislative power is vested in the Oireachtas, the bicameral national parliament, which consists of Dáil Éireann, Seanad Éireann and the President of Ireland. The judiciary is independent of the executive and the legislature. The head of the judiciary is the Chief Justice who presides over the Supreme Court.\n\nWhile there are a number of political parties in the state, the political landscape has been dominated for decades by Fianna Fáil and Fine Gael, historically opposed and competing entities, which both occupy the traditional centre ground. From the 1930s until 2011 they were the largest and second largest parties respectively. Both parties trace their roots back to the opposing sides of the civil war. The Labour Party, historically the state's third political party has only ever been in power when in coalition with either of the two main parties. In 2011 there was a major political realignment in Ireland, with Fine Gael becoming the largest party, Labour the second, and Fianna Fáil dropping to third following a collapse in support, while Sinn Féin saw a substantial increase in support.\n\nHowever, in 2016, Fianna Fáil managed to regain support and become the second largest party while Labour collapsed to fourth place following backlash over its role in the coalition government. Sinn Féin continued making gains, becoming the third largest party while Fine Gael remained the largest party, despite losing seats.\n\nThe Economist Intelligence Unit has rated Ireland as \"full democracy\" in 2016.\n\nMain office holders\n\nConstitution\n\nThe state operates under the Constitution of Ireland () which was adopted in 1937 by means of a plebiscite. The constitution falls within the liberal democratic tradition. It defines the organs of government and guarantees certain fundamental rights. The Constitution can only be amended by means of a referendum. Important constitutional referenda have concerned issues such as abortion, the status of the Catholic Church, divorce, European Union and same-sex marriage.\n\nPresident\n\nThe head of state is the President of Ireland. In keeping with the state's parliamentary system of government the President exercises a mainly ceremonial role but does possess certain specific powers. The presidency is open to all Irish citizens who are at least 35. They are directly elected by secret ballot under the alternative vote. A candidate may be nominated for election as President by no fewer than 20 members of the Oireachtas or by four or more of Ireland's 31 County and City Councils. A retiring President may nominate themselves as a candidate for re-election. If only one valid candidate is nominated for election, for example if there is consensus among the political parties to nominate a single candidate, it is unnecessary to proceed to a ballot and that candidate is deemed elected. The President is elected to a seven-year term of office and no person may serve more than two terms.\n\nIn carrying out certain of their constitutional functions, the President is aided by the Council of State. There is no Vice-President in Ireland. If for any reason the President is unable to carry out his/her functions, or if the Office of President is vacant, the duties of the President are carried out by the Presidential Commission.\n\nExecutive branch\n\nExecutive authority is exercised by a cabinet known simply as the Government. Article 28 of the Constitution states that the Government may consist of no less than seven and no more than fifteen members, namely the Taoiseach (prime minister), the Tánaiste (deputy prime minister) and up to thirteen other ministers. The Taoiseach is appointed by the President, after being nominated by Dáil Éireann (the lower house of parliament). The remaining ministers are nominated by the Taoiseach and appointed by the President following their approval by the Dáil. The Government must enjoy the confidence of Dáil Éireann and, in the event that they cease to enjoy the support of the lower house, the Taoiseach must either resign or request the President to dissolve the Dáil, in which case a general election follows.\n\nLegislative branch\n\nArticle 15 of the Constitution of Ireland established the Oireachtas as the national parliament of Ireland. The Oireachtas consists of the President of Ireland and two elected houses: Dáil Éireann (the House of Representatives) and Seanad Éireann (the Senate). As the Oireachtas also consists of the President the official title of the two law making houses is the Houses of the Oireachtas. The Dáil is by far the dominant House of the legislature. The President may not veto bills passed by the Oireachtas, but may refer them to the Supreme Court of Ireland for a ruling on whether they comply with the constitution.\n\nDáil Éireann\n\nMembers of the Dáil are directly elected at least once in every five years under the single transferable vote form of proportional representation from multi-seat constituencies. Membership of the house is open to all Irish citizens who are at least 21 and permanently resident in the State. The electorate consists of all Irish and British citizens resident in Ireland over the age of 18. Members of the Dáil are known as Teachta Dála or TDs. Currently there are 158 TDs, of which one, the Ceann Comhairle (Chairman), is automatically returned at an election. The Taoiseach, Tánaiste and the Minister for Finance must be members of the Dáil. All other members of the Government must be members of the Dáil, however up to two members may be members of the Seanad. The Dáil is the only House which can introduce and amend money bills (i.e. financial and tax legislation). Since the early 1990s no single party has had a majority in Dáil Éireann, so that coalition governments have been the norm.\n\nSeanad Éireann\n\nThe Senate is a largely advisory body. It consists of sixty members called Senators. An election for the Seanad must take place no later than 90 days after a general election for the members of the Dáil. Eleven Senators are nominated by the Taoiseach while a further six are elected by certain national universities. The remaining 43 are elected from special vocational panels of candidates, the electorate for which consists of the 60 members of the outgoing Senate, the 158 TDs of the incoming Dáil and the 883 elected members of 5 city and 29 county councils. The Senate has the power to delay legislative proposals and is allowed 90 days to consider and amend bills sent to it by the Dáil (excluding money bills). The Senate is only allowed 21 days to consider money bills sent to it by the Dáil. The Senate cannot amend money bills but can make recommendations to the Dáil on such bills.\n\nJudicial branch\n\nIreland is a common law jurisdiction. The judiciary consists of the Supreme Court, the High Court and other lower courts established by law. Judges are appointed by the President after being nominated by the Government and can be removed from office only for misbehaviour or incapacity, and then only by resolution of both houses of the Oireachtas. The final court of appeal is the Supreme Court, which consists of the Chief Justice, seven ordinary judges and ex officio the President of the High Court. The Supreme Court rarely sits as a full bench and normally hears cases in chambers of three, five or seven judges.\n\nBoth the Supreme Court and the High Court have the power of judicial review and may declare to be invalid both laws and acts of the state which are repugnant to the constitution.\n\nPublic sector\n\nThe Government, through the civil and public services and state-sponsored bodies, is a significant employer in the state; these three sectors are often called the public sector. Management of these various bodies vary, for instance in the civil service there will be clearly defined routes and patterns whilst among public services a sponsoring minister or the Minister for Finance may appoint a board or commission. Commercial activities, where the state involves itself, are typically through the state-sponsored bodies which are usually organised in a similar fashion to private companies.\n\nA 2005 report on public sector employment, showed that in June 2005 the numbers employed in the public sector stood at 350,100; of these by sector they were 38,700 (civil service), 254,100 (public service) and 57,300 (state-sponsored). The total workforce of the state was 1,857,400 that year, thus the public sector represents approximately 20% of the total workforce.\n\nCivil service\n\nThe civil service of Ireland consists of two broad components, the Civil Service of the Government and the Civil Service of the State. Whilst these two components are largely theoretical, they do have some fundamental operational differences. The civil service is expected to maintain the political impartiality in its work, and some sections of it are entirely independent of Government decision making.\n\nPublic service\n\nThe public service is a relatively broad term and is not clearly defined and sometimes is taken to include the civil service. The public service proper consists of Government agencies and bodies which provide services on behalf of the Government but are not the core civil service. For instance local authorities, Education and Training Boards and Garda Síochána are considered to be public services.\n\nLocal government\n\nArticle 28A of the constitution of Ireland provides a constitutional basis for local government. The Oireachtas is empowered to establish the number, size and powers of local authorities by law. Under Article 28A, members of local authorities must be directly elected by voters at least once every five years.\n\nLocal government in Ireland is governed by a series of Local Government Acts, beginning with the Local Government (Ireland) Act 1898. The most significant of these is the Local Government Act 2001, which established a two-tier structure of local government. The Local Government Reform Act 2014 abolished the bottom tier, the town councils, leaving 31 local authorities. There are 26 County Councils (County Dublin been divided into three council areas), 3 City Councils (Dublin, Cork and Galway), and 2 City and County Councils (Limerick and Waterford).\n\nPolitical parties\n\nA number of political parties are represented in the Dáil and coalition governments are common. The Irish electoral system has been characterised by the two and a half party system, with two large catch all parties dominating. This changed after the 2011 Irish General Election, following the large drop in support for Fianna Fáil and the rise in support for other parties.\n\nThe current largest party in the state is Fine Gael, which has its origins in the pro-treaty movement of Michael Collins in the Irish Civil War. Traditionally the party of law and order, it is associated with strong belief in pro-enterprise and reward. Despite expressions of Social Democracy by previous leader Garrett Fitzgerald, today, it remains a Christian democratic, economically liberal party along European lines, with a strongly pro-European outlook. Fine Gael was formed out of a merger of Cumann na nGaedheal, the Centre Party and the Blueshirts. In recent years it has generally been associated with a liberal outlook. It has formed government in the periods 1922–32 (Cumann na nGaedheal), 1948–51, 1954–57, 1973–77, 1981–82, 1982–87, 1994–97, and 2011 to present.\n\nFianna Fáil, a traditionally Irish republican party founded in 1927 by Éamon de Valera, is the second largest party and also considered centre-right. It first formed a government on the basis of a populist programme of land redistribution and national preference in trade and republican populism remains a key part of its appeal. It has formed government seven times since Ireland gained independence: 1932–48, 1951–54, 1957–73, 1977–81, 1982, 1987–94, and 1997–2011. Fianna Fáil was the largest party in the Dáil to 2011. It lost a huge amount of support in the 2011 general election but has since regained some support.\n\nThe third largest party is Sinn Féin, established in its current form in 1970. The original Sinn Féin played a huge role in the Irish War of Independence and the First Dáil. Fine Gael and Fianna Fáil trace their origins to that party. The current-day party has been historically linked to the Provisional IRA. The party is a Republican party which takes a more left wing stance on economics and social policy than the Labour Party.\n\nThe fourth largest party in the state is the centre-left Labour Party which was founded by James Connolly and Jim Larkin in 1912. Labour have formal links with the trade union movement and have governed in seven coalition governments – six led by Fine Gael and one by Fianna Fáil. This role as a junior coalition partner has led to Labour being classed as the half party of Ireland's two and a half party system.\n\nThe Solidarity–People Before Profit electoral alliance, consisting of the Solidarity and People Before Profit Alliance currently occupy the 5th largest grouping within Dáil Éireann. Formed in 2015, the group represents a left-wing, socialist viewpoint, with particular focus on the abolition of domestic water charges.\n\nOther parties and political alliances represented in the Dáil after the 2016 general election are the Independents 4 Change, Social Democrats and Green Party.\n\nA number of independent TDs such as Maureen O'Sullivan, Mick Wallace, Finian McGrath, John Halligan and Thomas Pringle largely hold left-wing views.  An Independent Alliance (Ireland), a loose alliance of independents formed in 2015 and returned 6 TDs after the 2016 election. 5 of the 6  helped elect Enda Kenny Taoiseach again after than election and have since entered Government in various forms since.\n\nParty details\n\nParty representation\n\nForeign relations\n\nIreland's foreign relations are substantially influenced by its membership of the European Union, although bilateral relations with the United States and United Kingdom are also important to the country. It is one of the group of smaller nations in the EU, and has traditionally followed a non-aligned foreign policy.\n\nMilitary neutrality\n\nIreland tends towards independence in foreign policy, thus it is not a member of NATO and has a longstanding  policy of military neutrality.\n\nThis policy has helped the Irish Defence Forces to be successful in their contributions to UN peace-keeping missions since 1960 (in the Congo Crisis ONUC) and subsequently in Cyprus (UNFICYP), Lebanon (UNIFIL), Iran/Iraq Border (UNIIMOG), Bosnia and Herzegovina (SFOR & EUFOR Althea), Ethiopia and Eritrea (UNMEE), Liberia (UNMIL), East Timor (INTERFET), Darfur and Chad (EUFOR Tchad/RCA). Irish Defence Forces do not deploy in Missions\n\nInternational organisation participation\n\nThe Republic of Ireland is member of the Australia Group, BIS, British-Irish Council, CE, Celtic League, EBRD, ECE, EIB, EMU, ESA, EU, FAO, IAEA, IBRD, ICAO, ICC, ICC, ITUC, ICRM, IDA, IEA, IFAD, IFC, IFRCS, ILO, IMF, International Maritime Organization, Intelsat, Interpol, IOC, IOM (observer), ISO, ITU, MINURSO, NAM (guest), NEA, NSG, OECD, OPCW, OSCE, PFP, UN, UNCTAD, UNESCO, UNFICYP, UNHCR, UNIDO, UNIFIL, UNIKOM, UNITAR, UNMIBH, UNMIK, UNMOP, UNTAET, UNTSO, UPU, WCO, WEU (observer), WHO, WIPO, WMO, WTrO, and the Zangger Committee.\n\nNorthern Ireland\n\nNorthern Ireland has been a major factor in Irish politics since the island of Ireland was divided between Northern Ireland and what is now the Republic in 1920. The creation of Northern Ireland led to conflict between northern nationalists (mostly Roman Catholic) who seek unification with the Republic and Unionists (mostly Protestant) who opposed British plans for Irish Home Rule and wished for Northern Ireland to remain within the United Kingdom. After the formation of Northern Ireland in 1921 following its opt out from the newly formed Irish Free State, many Roman Catholics and Republicans were discriminated against. The abolition of Proportional Representation and the gerrymandering of constituency boundaries led to Unionists being over-represented at Stormont and at Westminster. Even James Craig who was prime minister of Northern Ireland boasted of his Protestant Parliament for a Protestant People. In the 1960s NICRA was set up to end discrimination between Catholics and Protestants. There was a massive backlash to this from sections of the Unionist community. This conflict exploded into violence in the late sixties with the beginning of the Troubles, involving groups such as the Provisional IRA, loyalist paramilitaries, the police and the British army, the latter originally drafted in to protect Catholic communities from loyalist violence. These clashes were to result in the suspension of the Stormont Parliament and unsuccessful efforts by the British Government to encourage a power-sharing Executive in Northern Ireland which were only realised following the Good Friday Agreement in 1998. The Troubles caused thousands of deaths in Northern Ireland but also spilled over into bombings and acts of violence in England and the Republic.\n\nSince its foundation it has been the stated long-term policy of governments of what is now the Republic to bring an end to the conflict in Northern Ireland and to bring about a united Ireland. Northern Ireland has also, in the past, often been a source of tension between the Irish Government and the government of the United Kingdom. To find a solution to the Troubles the Irish Government became a partner in the Good Friday Agreement in 1998.\n\nWhile Sinn Féin have long organised in both Northern Ireland and the Republic, Fianna Fáil have recently opened a cumann (branch) in Derry and begun recruiting members at Queen's University, Belfast although both are extremely small.\n\nNorth/South Ministerial Council\n\nUnder the Belfast Agreement (also known as the Good Friday Agreement) and Article 3 of the constitution a North-South Ministerial Council and six North-South Implementation Bodies co-ordinate activities and exercise a limited governmental role within certain policy areas across the whole island of Ireland. The Implementation Bodies have limited executive authority in six policy areas. Meetings of the Council take the form of meetings between ministers from both the Republic's Government and the Northern Ireland Executive. The Council was suspended from 2002 to 2007. However, with the resumption of devolved government in Northern Ireland in May 2007, the Council has now re-assumed its duties.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Politics of the Republic of Ireland" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14677" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ireland is a parliamentary, representative democratic republic and a member state of the European Union. While the head of state is the popularly elected President of Ireland, it is a largely ceremonial position with real political power being vested in the indirectly elected Taoiseach (leader of government) who is the head of the government.\n\nExecutive power is exercised by the government which consists of no more than 15 cabinet ministers, inclusive of the Taoiseach and Tánaiste (deputy leader of government). Legislative power is vested in the Oireachtas, the bicameral national parliament, which consists of Dáil Éireann, Seanad Éireann and the President of Ireland. The judiciary is independent of the executive and the legislature. The head of the judiciary is the Chief Justice who presides over the Supreme Court.\n\nWhile there are a number of political parties in the state, the political landscape has been dominated for decades by Fianna Fáil and Fine Gael, historically opposed and competing entities, which both occupy the traditional centre ground. From the 1930s until 2011 they were the largest and second largest parties respectively. Both parties trace their roots back to the opposing sides of the civil war. The Labour Party, historically the state's third political party has only ever been in power when in coalition with either of the two main parties. In 2011 there was a major political realignment in Ireland, with Fine Gael becoming the largest party, Labour the second, and Fianna Fáil dropping to third following a collapse in support, while Sinn Féin saw a substantial increase in support.\n\nHowever, in 2016, Fianna Fáil managed to regain support and become the second largest party while Labour collapsed to fourth place following backlash over its role in the coalition government. Sinn Féin continued making gains, becoming the third largest party while Fine Gael remained the largest party, despite losing seats.\n\nThe Economist Intelligence Unit has rated Ireland as \"full democracy\" in 2016.\n\nMain office holders\n\nConstitution\n\nThe state operates under the Constitution of Ireland () which was adopted in 1937 by means of a plebiscite. The constitution falls within the liberal democratic tradition. It defines the organs of government and guarantees certain fundamental rights. The Constitution can only be amended by means of a referendum. Important constitutional referenda have concerned issues such as abortion, the status of the Catholic Church, divorce, European Union and same-sex marriage.\n\nPresident\n\nThe head of state is the President of Ireland. In keeping with the state's parliamentary system of government the President exercises a mainly ceremonial role but does possess certain specific powers. The presidency is open to all Irish citizens who are at least 35. They are directly elected by secret ballot under the alternative vote. A candidate may be nominated for election as President by no fewer than 20 members of the Oireachtas or by four or more of Ireland's 31 County and City Councils. A retiring President may nominate themselves as a candidate for re-election. If only one valid candidate is nominated for election, for example if there is consensus among the political parties to nominate a single candidate, it is unnecessary to proceed to a ballot and that candidate is deemed elected. The President is elected to a seven-year term of office and no person may serve more than two terms.\n\nIn carrying out certain of their constitutional functions, the President is aided by the Council of State. There is no Vice-President in Ireland. If for any reason the President is unable to carry out his/her functions, or if the Office of President is vacant, the duties of the President are carried out by the Presidential Commission.\n\nExecutive branch\n\nExecutive authority is exercised by a cabinet known simply as the Government. Article 28 of the Constitution states that the Government may consist of no less than seven and no more than fifteen members, namely the Taoiseach (prime minister), the Tánaiste (deputy prime minister) and up to thirteen other ministers. The Taoiseach is appointed by the President, after being nominated by Dáil Éireann (the lower house of parliament). The remaining ministers are nominated by the Taoiseach and appointed by the President following their approval by the Dáil. The Government must enjoy the confidence of Dáil Éireann and, in the event that they cease to enjoy the support of the lower house, the Taoiseach must either resign or request the President to dissolve the Dáil, in which case a general election follows.\n\nLegislative branch\n\nArticle 15 of the Constitution of Ireland established the Oireachtas as the national parliament of Ireland. The Oireachtas consists of the President of Ireland and two elected houses: Dáil Éireann (the House of Representatives) and Seanad Éireann (the Senate). As the Oireachtas also consists of the President the official title of the two law making houses is the Houses of the Oireachtas. The Dáil is by far the dominant House of the legislature. The President may not veto bills passed by the Oireachtas, but may refer them to the Supreme Court of Ireland for a ruling on whether they comply with the constitution.\n\nDáil Éireann\n\nMembers of the Dáil are directly elected at least once in every five years under the single transferable vote form of proportional representation from multi-seat constituencies. Membership of the house is open to all Irish citizens who are at least 21 and permanently resident in the State. The electorate consists of all Irish and British citizens resident in Ireland over the age of 18. Members of the Dáil are known as Teachta Dála or TDs. Currently there are 158 TDs, of which one, the Ceann Comhairle (Chairman), is automatically returned at an election. The Taoiseach, Tánaiste and the Minister for Finance must be members of the Dáil. All other members of the Government must be members of the Dáil, however up to two members may be members of the Seanad. The Dáil is the only House which can introduce and amend money bills (i.e. financial and tax legislation). Since the early 1990s no single party has had a majority in Dáil Éireann, so that coalition governments have been the norm.\n\nSeanad Éireann\n\nThe Senate is a largely advisory body. It consists of sixty members called Senators. An election for the Seanad must take place no later than 90 days after a general election for the members of the Dáil. Eleven Senators are nominated by the Taoiseach while a further six are elected by certain national universities. The remaining 43 are elected from special vocational panels of candidates, the electorate for which consists of the 60 members of the outgoing Senate, the 158 TDs of the incoming Dáil and the 883 elected members of 5 city and 29 county councils. The Senate has the power to delay legislative proposals and is allowed 90 days to consider and amend bills sent to it by the Dáil (excluding money bills). The Senate is only allowed 21 days to consider money bills sent to it by the Dáil. The Senate cannot amend money bills but can make recommendations to the Dáil on such bills.\n\nJudicial branch\n\nIreland is a common law jurisdiction. The judiciary consists of the Supreme Court, the High Court and other lower courts established by law. Judges are appointed by the President after being nominated by the Government and can be removed from office only for misbehaviour or incapacity, and then only by resolution of both houses of the Oireachtas. The final court of appeal is the Supreme Court, which consists of the Chief Justice, seven ordinary judges and ex officio the President of the High Court. The Supreme Court rarely sits as a full bench and normally hears cases in chambers of three, five or seven judges.\n\nBoth the Supreme Court and the High Court have the power of judicial review and may declare to be invalid both laws and acts of the state which are repugnant to the constitution.\n\nPublic sector\n\nThe Government, through the civil and public services and state-sponsored bodies, is a significant employer in the state; these three sectors are often called the public sector. Management of these various bodies vary, for instance in the civil service there will be clearly defined routes and patterns whilst among public services a sponsoring minister or the Minister for Finance may appoint a board or commission. Commercial activities, where the state involves itself, are typically through the state-sponsored bodies which are usually organised in a similar fashion to private companies.\n\nA 2005 report on public sector employment, showed that in June 2005 the numbers employed in the public sector stood at 350,100; of these by sector they were 38,700 (civil service), 254,100 (public service) and 57,300 (state-sponsored). The total workforce of the state was 1,857,400 that year, thus the public sector represents approximately 20% of the total workforce.\n\nCivil service\n\nThe civil service of Ireland consists of two broad components, the Civil Service of the Government and the Civil Service of the State. Whilst these two components are largely theoretical, they do have some fundamental operational differences. The civil service is expected to maintain the political impartiality in its work, and some sections of it are entirely independent of Government decision making.\n\nPublic service\n\nThe public service is a relatively broad term and is not clearly defined and sometimes is taken to include the civil service. The public service proper consists of Government agencies and bodies which provide services on behalf of the Government but are not the core civil service. For instance local authorities, Education and Training Boards and Garda Síochána are considered to be public services.\n\nLocal government\n\nArticle 28A of the constitution of Ireland provides a constitutional basis for local government. The Oireachtas is empowered to establish the number, size and powers of local authorities by law. Under Article 28A, members of local authorities must be directly elected by voters at least once every five years.\n\nLocal government in Ireland is governed by a series of Local Government Acts, beginning with the Local Government (Ireland) Act 1898. The most significant of these is the Local Government Act 2001, which established a two-tier structure of local government. The Local Government Reform Act 2014 abolished the bottom tier, the town councils, leaving 31 local authorities. There are 26 County Councils (County Dublin been divided into three council areas), 3 City Councils (Dublin, Cork and Galway), and 2 City and County Councils (Limerick and Waterford).\n\nPolitical parties\n\nA number of political parties are represented in the Dáil and coalition governments are common. The Irish electoral system has been characterised by the two and a half party system, with two large catch all parties dominating. This changed after the 2011 Irish General Election, following the large drop in support for Fianna Fáil and the rise in support for other parties.\n\nThe current largest party in the state is Fine Gael, which has its origins in the pro-treaty movement of Michael Collins in the Irish Civil War. Traditionally the party of law and order, it is associated with strong belief in pro-enterprise and reward. Despite expressions of Social Democracy by previous leader Garrett Fitzgerald, today, it remains a Christian democratic, economically liberal party along European lines, with a strongly pro-European outlook. Fine Gael was formed out of a merger of Cumann na nGaedheal, the Centre Party and the Blueshirts. In recent years it has generally been associated with a liberal outlook. It has formed government in the periods 1922–32 (Cumann na nGaedheal), 1948–51, 1954–57, 1973–77, 1981–82, 1982–87, 1994–97, and 2011 to present.\n\nFianna Fáil, a traditionally Irish republican party founded in 1927 by Éamon de Valera, is the second largest party and also considered centre-right. It first formed a government on the basis of a populist programme of land redistribution and national preference in trade and republican populism remains a key part of its appeal. It has formed government seven times since Ireland gained independence: 1932–48, 1951–54, 1957–73, 1977–81, 1982, 1987–94, and 1997–2011. Fianna Fáil was the largest party in the Dáil to 2011. It lost a huge amount of support in the 2011 general election but has since regained some support.\n\nThe third largest party is Sinn Féin, established in its current form in 1970. The original Sinn Féin played a huge role in the Irish War of Independence and the First Dáil. Fine Gael and Fianna Fáil trace their origins to that party. The current-day party has been historically linked to the Provisional IRA. The party is a Republican party which takes a more left wing stance on economics and social policy than the Labour Party.\n\nThe fourth largest party in the state is the centre-left Labour Party which was founded by James Connolly and Jim Larkin in 1912. Labour have formal links with the trade union movement and have governed in seven coalition governments – six led by Fine Gael and one by Fianna Fáil. This role as a junior coalition partner has led to Labour being classed as the half party of Ireland's two and a half party system.\n\nThe Solidarity–People Before Profit electoral alliance, consisting of the Solidarity and People Before Profit Alliance currently occupy the 5th largest grouping within Dáil Éireann. Formed in 2015, the group represents a left-wing, socialist viewpoint, with particular focus on the abolition of domestic water charges.\n\nOther parties and political alliances represented in the Dáil after the 2016 general election are the Independents 4 Change, Social Democrats and Green Party.\n\nA number of independent TDs such as Maureen O'Sullivan, Mick Wallace, Finian McGrath, John Halligan and Thomas Pringle largely hold left-wing views.  An Independent Alliance (Ireland), a loose alliance of independents formed in 2015 and returned 6 TDs after the 2016 election. 5 of the 6  helped elect Enda Kenny Taoiseach again after than election and have since entered Government in various forms since.\n\nParty details\n\nParty representation\n\nForeign relations\n\nIreland's foreign relations are substantially influenced by its membership of the European Union, although bilateral relations with the United States and United Kingdom are also important to the country. It is one of the group of smaller nations in the EU, and has traditionally followed a non-aligned foreign policy.\n\nMilitary neutrality\n\nIreland tends towards independence in foreign policy, thus it is not a member of NATO and has a longstanding  policy of military neutrality.\n\nThis policy has helped the Irish Defence Forces to be successful in their contributions to UN peace-keeping missions since 1960 (in the Congo Crisis ONUC) and subsequently in Cyprus (UNFICYP), Lebanon (UNIFIL), Iran/Iraq Border (UNIIMOG), Bosnia and Herzegovina (SFOR & EUFOR Althea), Ethiopia and Eritrea (UNMEE), Liberia (UNMIL), East Timor (INTERFET), Darfur and Chad (EUFOR Tchad/RCA). Irish Defence Forces do not deploy in Missions\n\nInternational organisation participation\n\nThe Republic of Ireland is member of the Australia Group, BIS, British-Irish Council, CE, Celtic League, EBRD, ECE, EIB, EMU, ESA, EU, FAO, IAEA, IBRD, ICAO, ICC, ICC, ITUC, ICRM, IDA, IEA, IFAD, IFC, IFRCS, ILO, IMF, International Maritime Organization, Intelsat, Interpol, IOC, IOM (observer), ISO, ITU, MINURSO, NAM (guest), NEA, NSG, OECD, OPCW, OSCE, PFP, UN, UNCTAD, UNESCO, UNFICYP, UNHCR, UNIDO, UNIFIL, UNIKOM, UNITAR, UNMIBH, UNMIK, UNMOP, UNTAET, UNTSO, UPU, WCO, WEU (observer), WHO, WIPO, WMO, WTrO, and the Zangger Committee.\n\nNorthern Ireland\n\nNorthern Ireland has been a major factor in Irish politics since the island of Ireland was divided between Northern Ireland and what is now the Republic in 1920. The creation of Northern Ireland led to conflict between northern nationalists (mostly Roman Catholic) who seek unification with the Republic and Unionists (mostly Protestant) who opposed British plans for Irish Home Rule and wished for Northern Ireland to remain within the United Kingdom. After the formation of Northern Ireland in 1921 following its opt out from the newly formed Irish Free State, many Roman Catholics and Republicans were discriminated against. The abolition of Proportional Representation and the gerrymandering of constituency boundaries led to Unionists being over-represented at Stormont and at Westminster. Even James Craig who was prime minister of Northern Ireland boasted of his Protestant Parliament for a Protestant People. In the 1960s NICRA was set up to end discrimination between Catholics and Protestants. There was a massive backlash to this from sections of the Unionist community. This conflict exploded into violence in the late sixties with the beginning of the Troubles, involving groups such as the Provisional IRA, loyalist paramilitaries, the police and the British army, the latter originally drafted in to protect Catholic communities from loyalist violence. These clashes were to result in the suspension of the Stormont Parliament and unsuccessful efforts by the British Government to encourage a power-sharing Executive in Northern Ireland which were only realised following the Good Friday Agreement in 1998. The Troubles caused thousands of deaths in Northern Ireland but also spilled over into bombings and acts of violence in England and the Republic.\n\nSince its foundation it has been the stated long-term policy of governments of what is now the Republic to bring an end to the conflict in Northern Ireland and to bring about a united Ireland. Northern Ireland has also, in the past, often been a source of tension between the Irish Government and the government of the United Kingdom. To find a solution to the Troubles the Irish Government became a partner in the Good Friday Agreement in 1998.\n\nWhile Sinn Féin have long organised in both Northern Ireland and the Republic, Fianna Fáil have recently opened a cumann (branch) in Derry and begun recruiting members at Queen's University, Belfast although both are extremely small.\n\nNorth/South Ministerial Council\n\nUnder the Belfast Agreement (also known as the Good Friday Agreement) and Article 3 of the constitution a North-South Ministerial Council and six North-South Implementation Bodies co-ordinate activities and exercise a limited governmental role within certain policy areas across the whole island of Ireland. The Implementation Bodies have limited executive authority in six policy areas. Meetings of the Council take the form of meetings between ministers from both the Republic's Government and the Northern Ireland Executive. The Council was suspended from 2002 to 2007. However, with the resumption of devolved government in Northern Ireland in May 2007, the Council has now re-assumed its duties. Politics of the Republic of Ireland. http://en.wikipedia.org/?curid=14677."
  }
}
