{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11021",
  "eid" : "f93354e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497838,
  "textBody" : "Events\n\n*AD 60 – The earliest date for which the day of the week is known. A graffito in Pompeii identifies this day as a dies Solis (Sunday). In modern reckoning, this date would have been a Wednesday.\n*1579 – The Archdiocese of Manila was made a diocese by a papal bull with Domingo de Salazar being its first bishop.\n*1649 – The claimant King Charles II of England and Scotland is declared King of Great Britain, by the Parliament of Scotland. This move was not followed by the Parliament of England nor the Parliament of Ireland.\n*1685 – James II of England and VII of Scotland becomes King upon the death of his brother Charles II.\n*1778 – American Revolutionary War: In Paris the Treaty of Alliance and the Treaty of Amity and Commerce are signed by the United States and France signaling official recognition of the new republic.\n*1788 – Massachusetts becomes the sixth state to ratify the United States Constitution.\n*1806 – Battle of San Domingo: British naval victory against the French in the Caribbean.\n*1815 – New Jersey grants the first American railroad charter to John Stevens.\n*1819 – Sir Thomas Stamford Raffles founds Singapore.\n*1820 – The first 86 African American immigrants sponsored by the American Colonization Society depart New York to start a settlement in present-day Liberia.\n*1833 – Otto becomes the first modern King of Greece.\n*1840 – Signing of the Treaty of Waitangi, establishing New Zealand as a British colony.\n*1843 – The first minstrel show in the United States, The Virginia Minstrels, opens (Bowery Amphitheatre in New York City).\n*1851 – The largest Australian bushfires in a populous region in recorded history take place in the state of Victoria.\n*1862 – American Civil War: Forces under the command of Ulysses S. Grant and Andrew H. Foote give the Union its first victory of the war, capturing Fort Henry, Tennessee in the Battle of Fort Henry.\n*1899 – Spanish–American War: The Treaty of Paris, a peace treaty between the United States and Spain, is ratified by the United States Senate.\n*1900 – The Permanent Court of Arbitration, an international arbitration court at The Hague, is created when the Senate of the Netherlands ratifies an 1899 peace conference decree.\n*1918 – British women over the age of 30 who meet minimum property qualifications, get the right to vote when  Representation of the People Act 1918 is passed by Parliament.\n*1919 – The American Legion is founded.\n*1922 – The Washington Naval Treaty is signed in Washington, D.C., limiting the naval armaments of United States, Britain, Japan, France, and Italy.\n*1934 – Far-right leagues rally in front of the Palais Bourbon in an attempted coup against the French Third Republic, creating a political crisis in France.\n*1951 – The Canadian Army enters combat in the Korean War.\n*1951 – The Broker, a Pennsylvania Railroad passenger train derails near Woodbridge Township, New Jersey. The accident kills 85 people and injures over 500 more. The wreck is one of the worst rail disasters in American history.\n*1952 – Elizabeth II becomes Queen of the United Kingdom and her other Realms and Territories and Head of the Commonwealth upon the death of her father, George VI. At the exact moment of succession, she was in a tree house at the Treetops Hotel in Kenya.\n*1958 – Eight Manchester United F.C. players and 15 other passengers are killed in the Munich air disaster.\n*1959 – Jack Kilby of Texas Instruments files the first patent for an integrated circuit.\n*  1959   – At Cape Canaveral, Florida, the first successful test firing of a Titan intercontinental ballistic missile is accomplished.\n*1976 – In testimony before a United States Senate subcommittee, Lockheed Corporation president Carl Kotchian admits that the company had paid out approximately $3 million in bribes to the office of Japanese Prime Minister Kakuei Tanaka.\n*1978 – The Blizzard of 1978, one of the worst Nor'easters in New England history, hit the region, with sustained winds of 65 mph and snowfall of four inches an hour.\n*1981 – The National Resistance Army of Uganda launches an attack on a Ugandan Army installation in the central Mubende District to begin the Ugandan Bush War.\n*1987 – Justice Mary Gaudron becomes the first woman to be appointed to the High Court of Australia.\n*1988 – Michael Jordan makes his signature slam dunk from the free throw line inspiring Air Jordan and the Jumpman logo.\n*1989 – The Round Table Talks start in Poland, thus marking the beginning of the overthrow of communism in Eastern Europe.\n*1996 – Willamette Valley Flood: Floods in the Willamette Valley of Oregon, United States, causes over US$500 million in property damage throughout the Pacific Northwest.\n*  1996   – Birgenair Flight 301 crashed off the coast of the Dominican Republic, and all 189 people inside the airplane are killed. This is the worst accident/incident involving a Boeing 757.\n*1998 – Washington National Airport is renamed Ronald Reagan National Airport.\n*2000 – Second Chechen War: Russia captures Grozny, Chechnya, forcing the separatist Chechen Republic of Ichkeria government into exile.\n*2016 – An earthquake of magnitude 6.6 strikes southern Taiwan, killing 117 people.\n*2018 – SpaceX's Falcon Heavy, a super heavy launch vehicle, makes its maiden flight.\n\nBirths\n\n* 885 – Emperor Daigo of Japan (d. 930)\n*1347 – Dorothea of Montau, Prussian saint (d. 1394)\n*1402 – Louis I, Landgrave of Hesse, Landgrave of Hesse (d. 1458)\n*1452 – Joanna, Princess of Portugal (d. 1490)\n*1453 – Girolamo Benivieni, Florentine poet (d. 1542)\n*1465 – Scipione del Ferro, Italian mathematician and theorist (d. 1526)\n*1536 – Sassa Narimasa, Japanese samurai (d. 1588)\n*1577 – Beatrice Cenci, Italian murderer (d. 1599)\n*1582 – Mario Bettinus, Italian mathematician, astronomer, and philosopher (d. 1657)\n*1605 – Bernard of Corleone, Italian saint (d. 1667)\n*1608 – António Vieira, Portuguese priest and philosopher (d. 1697)\n*1611 – Chongzhen Emperor of China (d. 1644)\n*1612 – Antoine Arnauld, French mathematician, theologian, and philosopher (d. 1694)\n*1643 – Johann Kasimir Kolbe von Wartenberg, Prussian politician, 1st Minister President of Prussia (d. 1712)\n*1664 – Mustafa II, Ottoman sultan (d. 1703)\n*1665 – Anne, Queen of Great Britain (d. 1714)\n*1695 – Nicolaus II Bernoulli, Swiss-Russian mathematician and theorist (d. 1726)\n*1719 – Alberto Pullicino, Maltese painter (d. 1759)\n*1726 – Patrick Russell, Scottish surgeon and zoologist (d. 1805)\n*1732 – Charles Lee, English-American general (d. 1782)\n*1736 – Franz Xaver Messerschmidt, German-Austrian sculptor (d. 1783)\n*1744 – Pierre-Joseph Desault, French anatomist and surgeon (d. 1795)\n*1748 – Adam Weishaupt, German philosopher and academic, founded the Illuminati (d. 1830)\n*1753 – Évariste de Parny, French poet and author (d. 1814)\n*1756 – Aaron Burr, American colonel and politician, 3rd Vice President of the United States (d. 1836)\n*1758 – Julian Ursyn Niemcewicz, Belarusian-Polish poet, playwright, and politician (d. 1841)\n*1769 – Ludwig von Wallmoden-Gimborn, Austrian general (d. 1862)\n*1772 – George Murray, Scottish general and politician, Secretary of State for War and the Colonies (d. 1830)\n*1778 – Ugo Foscolo, Italian author and poet (d. 1827)\n*1781 – John Keane, 1st Baron Keane, Irish general and politician, Governor of Saint Lucia (d. 1844)\n*1796 – John Stevens Henslow, English botanist and geologist (d. 1861)\n*1797 – Joseph von Radowitz, Prussian general and politician, Foreign Minister of Prussia (d. 1853)\n*1799 – Imre Frivaldszky, Hungarian botanist and entomologist (d. 1870)\n*1800 – Achille Devéria, French painter and lithographer (d. 1857)\n*1802 – Charles Wheatstone, English-French physicist and cryptographer (d. 1875)\n*1811 – Henry Liddell, English priest, author, and academic (d. 1898)\n*1814 – Auguste Chapdelaine, French missionary and saint (d. 1856)\n*1818 – William M. Evarts, American lawyer and politician, 27th United States Secretary of State (d. 1901)\n*1829 – Joseph Auguste Émile Vaudremer, French architect, designed the La Santé Prison and Saint-Pierre-de-Montrouge (d. 1914)\n*1832 – John Brown Gordon, American general and politician, 53rd Governor of Georgia (d. 1904)\n*1833 – José María de Pereda, Spanish author and academic (d. 1906)\n*  1833   – J. E. B. Stuart, American general (d. 1864)\n*1834 – Edwin Klebs, German-Swiss pathologist and academic (d. 1913)\n*  1834   – Ema Pukšec, Croatian-German soprano (d. 1889)\n*  1834   – Wilhelm von Scherff, German general and author (d. 1911)\n*1838 – Henry Irving, English actor and manager (d. 1905)\n*  1838   – Israel Meir Kagan, Lithuanian-Polish rabbi and author (d. 1933)\n*1839 – Eduard Hitzig, German neurologist and psychiatrist (d. 1907)\n*1843 – Inoue Kowashi, Japanese scholar and politician (d. 1895)\n*  1843   – Frederic William Henry Myers, English poet and philologist, co-founded the Society for Psychical Research (d. 1901)\n*1845 – Isidor Straus, German-American businessman and politician (d. 1912)\n*1847 – Henry Janeway Hardenbergh, American architect, designed the Plaza Hotel (d. 1918)\n*1852 – C. Lloyd Morgan, English zoologist and psychologist (d. 1936)\n*  1852   – Vasily Safonov, Russian pianist, composer, and conductor (d. 1918)\n*1861 – Nikolay Zelinsky, Russian chemist and academic (d. 1953)\n*1864 – John Henry Mackay, Scottish-German philosopher and author (d. 1933)\n*1866 – Karl Sapper, German linguist and explorer (d. 1945)\n*1872 – Robert Maillart, Swiss engineer, designed the Salginatobel Bridge and Schwandbach Bridge (d. 1940)\n*1874 – Bhaktisiddhanta Sarasvati Thakura, Indian religious leader, founded the Gaudiya Math (d. 1937)\n*1875 – Leonid Gobyato, Russian general (d. 1915)\n*1876 – Henry Blogg, English fisherman and sailor (d. 1954)\n*1879 – Othon Friesz, French painter (d. 1949)\n*  1879   – Magnús Guðmundsson, Icelandic lawyer and politician, 3rd Prime Minister of Iceland (d. 1937)\n*  1879   – Edwin Samuel Montagu, English politician, Chancellor of the Duchy of Lancaster (d. 1924)\n*  1879   – Carl Ramsauer, German physicist and author (d. 1955)\n*1880 – Nishinoumi Kajirō II, Japanese sumo wrestler, the 25th Yokozuna (d. 1931)\n*1884 – Marcel Cohen, French linguist and scholar (d. 1974)\n*1887 – Josef Frings, German cardinal (d. 1978)\n*1890 – Khan Abdul Ghaffar Khan, Pakistani activist and politician (d. 1988)\n*1892 – Maximilian Fretter-Pico, German general (d. 1984)\n*  1892   – William P. Murphy, American physician and academic, Nobel Prize laureate (d. 1987)\n*1893 – Muhammad Zafarullah Khan, Pakistani politician and diplomat, 1st Minister of Foreign Affairs for Pakistan (d. 1985)\n*1894 – Eric Partridge, New Zealand-English lexicographer and academic (d. 1979)\n*1895 – Robert La Follette Jr., American politician (d. 1953)\n*  1895   – María Teresa Vera, Cuban singer, guitarist and composer (d. 1965) \n*  1895   – Babe Ruth, American baseball player and coach (d. 1948)\n*1898 – Harry Haywood, American soldier and politician (d. 1985)\n*1899 – Ramon Novarro, Mexican-American actor, singer, and director (d. 1968)\n*1901 – Ben Lyon, American actor (d. 1979)\n*1902 – George Brunies, American trombonist (d. 1974)\n*1903 – Claudio Arrau, Chilean pianist and composer (d. 1991)\n*1905 – Władysław Gomułka, Polish politician (d. 1982)\n*  1905   – Jan Werich, Czech actor and playwright (d. 1980)\n*1906 – Joseph Schull, Canadian playwright and historian (d. 1980)\n*1908 – Amintore Fanfani, Italian journalist and politician, 32nd Prime Minister of Italy (d. 1999)\n*  1908   – Edward Lansdale, American general and CIA agent (d. 1987)\n*  1908   – Geo Bogza, Romanian poet and journalist (d. 1993)\n*  1908   – Michael Maltese, American actor, screenwriter, and composer (d. 1981)\n*1910 – Roman Czerniawski, Polish air force officer and spy (d. 1985)\n*  1910   – Irmgard Keun, German author (d. 1982)\n*  1910   – Carlos Marcello, Tunisian-American gangster (d. 1993)\n*1911 – Ronald Reagan, American actor and politician, 40th President of the United States (d. 2004)\n*1912 – Eva Braun, German wife of Adolf Hitler (d. 1945)\n*  1912   – Christopher Hill, English historian and author (d. 2003)\n*1913 – Mary Leakey, English-Kenyan archaeologist and anthropologist (d. 1996)\n*1914 – Thurl Ravenscroft, American voice actor and singer (d. 2005)\n*1915 – Kavi Pradeep, Indian poet and songwriter (d. 1998)\n*1916 – John Crank, English mathematician and physicist (d. 2006)\n*1917 – Louis-Philippe de Grandpré, Canadian lawyer and jurist (d. 2008)\n*1917 – Zsa Zsa Gabor, Hungarian-American actress and socialite (d. 2016)\n*1918 – Lothar-Günther Buchheim, German author and painter (d. 2007)\n*1919 – Takashi Yanase, Japanese poet and illustrator, created Anpanman (d. 2013)\n*1921 – Carl Neumann Degler, American historian and author (d. 2014)\n*  1921   – Bob Scott, New Zealand rugby player (d. 2012)\n*1922 – Patrick Macnee, English-American actor and costume designer (d. 2015)\n*  1922   – Denis Norden, English actor, screenwriter, and television host\n*  1922   – Haskell Wexler, American director, producer, and cinematographer (d. 2015)\n*1923 – Gyula Lóránt, Hungarian footballer and manager (d. 1981)\n*1924 – Billy Wright, English footballer and manager (d. 1994)\n*  1924   – Jin Yong, Hong Kong author and publisher, founded Ming Pao\n*1925 – Walker Edmiston, American actor and puppeteer (d. 2007)\n*1927 – Gerard K. O'Neill, American physicist and astronomer (d. 1992)\n*1928 – Allan H. Meltzer, American economist and academic (d. 2017)\n*1929 – Colin Murdoch, New Zealand pharmacist and veterinarian, invented the tranquilliser gun (d. 2008)\n*  1929   – Oscar Sambrano Urdaneta, Venezuelan author and critic (d. 2011)\n*  1929   – Valentin Yanin, Russian historian and author\n*1930 – Jun Kondo, Japanese physicist and academic\n*1931 – Rip Torn, American actor\n*  1931   – Fred Trueman, English cricketer (d. 2006)\n*  1931   – Ricardo Vidal, Filipino cardinal (d. 2017)\n*1932 – Camilo Cienfuegos, Cuban soldier and anarchist (d. 1959)\n*  1932   – François Truffaut, French actor, director, producer, and screenwriter (d. 1984)\n*1933 – Leslie Crowther, English comedian, actor, and game show host (d. 1996)\n*1936 – Kent Douglas, Canadian ice hockey player and coach (d. 2009)\n*1938 – Fred Mifflin, Canadian admiral and politician, 19th Minister of Veterans Affairs (d. 2013)\n*1939 – Jean Beaudin, Canadian director and screenwriter\n*  1939   – Mike Farrell, American actor, director, and producer\n*  1939   – Jair Rodrigues, Brazilian singer (d. 2014)\n*1940 – Tom Brokaw, American journalist and author\n*  1940   – Petr Hájek, Czech mathematician and academic\n*  1940   – Jimmy Tarbuck, English comedian and actor\n*1941 – Stephen Albert, American pianist and composer (d. 1992)\n*  1941   – Dave Berry, English pop singer\n*  1941   – Gigi Perreau, American actress and director\n*1942 – Sarah Brady, American activist and author (d. 2015)\n*  1942   – Charlie Coles, American basketball player and coach (d. 2013)\n*  1942   – Ahmad-Jabir Ahmadov Ismail oghlu, Azerbaijani philosopher and academic\n*  1942   – James Loewen, American sociologist and historian\n*  1942   – Tommy Roberts, English fashion designer (d. 2012)\n*1943 – Fabian Forte, American pop singer and actor\n*  1943   – Gayle Hunnicutt, American actress\n*1944 – Christine Boutin, French politician, French Minister of Housing and Urban Development\n*  1944   – Willie Tee, American singer-songwriter, keyboard player, and producer (d. 2007)\n*  1944   – Michael Tucker, American actor and producer\n*1945 – Bob Marley, Jamaican singer-songwriter and guitarist (d. 1981)\n*1946 – Richie Hayward, American drummer and songwriter  (d. 2010)\n*  1946   – Kate McGarrigle, Canadian musician and singer-songwriter (d. 2010)\n*  1946   – Jim Turner, American captain and politician\n*1947 – Bill Staines, American singer-songwriter and guitarist\n*1949 – Mike Batt, English singer-songwriter and producer \n*  1949   – Manuel Orantes, Spanish tennis player\n*  1949   – Jim Sheridan, Irish director, producer, and screenwriter\n*1950 – Natalie Cole, American singer-songwriter and actress (d. 2015)\n*  1950   – Timothy M. Dolan, American cardinal\n*  1950   – Punky Meadows, American rock guitarist and songwriter\n*1952 – Ric Charlesworth, Australian cricketer, coach, and politician\n*  1952   – Viktor Giacobbo, Swiss actor, producer, and screenwriter\n*  1952   – Ricardo La Volpe, Argentinian footballer, manager, and coach \n*1955 – Avram Grant, Israeli football manager\n*  1955   – Michael Pollan, American journalist, author, and academic\n*  1955   – Bruno Stolorz, French rugby player and coach\n*1956 – Jerry Marotta, American drummer\n*1957 – Andres Lipstok, Estonian economist and politician, Estonian Minister of Economic Affairs\n*  1957   – Kathy Najimy, American actress and comedian\n*  1957   – Simon Phillips, English drummer and producer \n*  1957   – Robert Townsend, American actor and director\n*1958 – Cecily Adams, American actress and casting director (d. 2004)\n*  1958   – Tim Dakin, English bishop and missionary\n*1960 – Jeremy Bowen, Welsh journalist\n*  1960   – Megan Gallagher, American actress\n*1961 – Cam Cameron, American football player and coach\n*  1961   – Bill Lester, American race car driver\n*  1961   – Yury Onufriyenko, Ukrainian-Russian colonel, pilot, and astronaut\n*1962 – Stavros Lambrinidis, Greek lawyer and politician, Minister of Foreign Affairs for Greece\n*  1962   – Axl Rose, American singer-songwriter and producer \n*1963 – David Capel, English cricketer\n*  1963   – Scott Gordon, American ice hockey player and coach\n*  1963   – Quentin Letts, English journalist and critic\n*1964 – Laurent Cabannes, French rugby player\n*  1964   – Gordon Downie, Canadian singer-songwriter, guitarist, and actor (d. 2017)\n*  1964   – Colin Miller, Australian cricketer and sportscaster\n*  1964   – Andrey Zvyagintsev, Russian actor and director\n*1965 – Jan Svěrák, Czech actor, director, and screenwriter\n*1966 – Rick Astley, English singer-songwriter\n*1967 – Anita Cochran, American singer-songwriter, guitarist, and producer\n*  1967   – Izumi Sakai, Japanese singer-songwriter (d. 2007)\n*1968 – Adolfo Valencia, Colombian footballer\n*  1968   – Akira Yamaoka, Japanese composer and producer\n*1969 – David Hayter, American actor and screenwriter\n*  1969   – Masaharu Fukuyama, Japanese singer-songwriter, producer, and actor\n*  1969   – Tim Sherwood, English footballer and manager\n*  1969   – Bob Wickman, American baseball player\n*1970 – Per Frandsen, Danish footballer and manager\n*  1970   – Tim Herron, American golfer\n*1971 – Brad Hogg, Australian cricketer\n*  1971   – Carlos Rogers, American basketball player\n*1972 – Stefano Bettarini, Italian footballer\n*  1972   – David Binn, American football player\n*1974 – Aljo Bendijo, Filipino journalist\n*  1974   – Ed Chamberlin, English broadcaster\n*1975 – Chad Allen, American baseball player and coach\n*  1975   – Orkut Büyükkökten, Turkish computer scientist and engineer, created Orkut\n*  1975   – Tomoko Kawase, Japanese singer-songwriter and producer \n*1976 – Tanja Frieden, Swiss snowboarder and educator\n*  1976   – Kim Zmeskal, American gymnast and coach\n*1977 – Jason Euell, English footballer and coach\n*  1977   – Josh Stewart, American actor\n*1978 – Yael Naim, French-Israeli singer-songwriter\n*1979 – Dan Bălan, Moldovan singer-songwriter and producer \n*1980 – Kerry Jeremy, Antiguan cricketer\n*  1980   – Kim Poirier, Canadian actress, singer, and producer\n*  1980   – Luke Ravenstahl, American politician, 58th Mayor of Pittsburgh\n*1981 – Ricky Barnes, American golfer\n*  1981   – Calum Best, American-English model and actor\n*  1981   – Shim Eun-jin, South Korean singer and actress \n*  1981   – Alison Haislip, American actress and producer\n*  1981   – Jens Lekman, Swedish singer-songwriter and guitarist\n*  1981   – Ty Warren, American football player\n*1982 – Tank, Taiwanese singer-songwriter\n*  1982   – Alice Eve, English actress \n*  1982   – Elise Ray, American gymnast\n*1983 – Melrose Bickerstaff, American model and fashion designer\n*  1983   – Brodie Croyle, American football player\n*  1983   – Dimas Delgado, Spanish footballer\n*  1983   – S. Sreesanth, Indian cricketer\n*  1983   – Jamie Whincup, Australian race car driver\n*1984 – Darren Bent, English footballer\n*  1984   – Piret Järvis, Estonian singer-songwriter and guitarist \n*  1984   – Antoine Wright, American basketball player\n*1985 – Ben Creagh, Australian rugby league player\n*  1985   – Kris Humphries, American basketball player\n*  1986   – Dane DeHaan, American actor \n*1988 – Bailey Hanks, American actress, singer, and dancer\n*1989 – Craig Cathcart, Northern Irish footballer\n*  1989   – Jonny Flynn, American basketball player\n*1990 – Adam Henrique, Canadian ice hockey player\n*  1990   – Jermaine Kearse, American football player\n*  1990   – Aida Rybalko, Lithuanian figure skater\n*1991 – Tobias Eisenbauer, Austrian ice dancer\n*  1991   – Ida Njåtun, Norwegian speed skater\n*  1991   – Eva Wacanno, Dutch tennis player\n*  1991   – Fei Yu, Chinese footballer\n*1992 – Víctor Mañón, Mexican footballer\n*1993 – Teresa Scanlan, Miss America 2011\n*  1993   – Tinashe, American singer-songwriter, dancer, and actress \n*  1994   – Charlie Heaton, British actor and musician \n*1995 – Sam McQueen, English footballer\n*1995 – Leon Goretzka, German footballer\n*1996 – Justina Mikulskytė, Lithuanian tennis player\n\nDeaths\n\n* 743 – Hisham ibn Abd al-Malik, Umayyad caliph (b. 691)\n* 797 – Donnchad Midi, Irish king (b. 733)\n* 891 – Photios I of Constantinople (b. 810)\n*1140 – Thurstan, Archbishop of York\n*1155 – King Sigurd II of Norway (b. 1133)\n*1215 – Hōjō Tokimasa, Japanese shikken of the Kamakura bakufu (b. 1138)\n*1378 – Joanna of Bourbon (b. 1338)\n*1411 – Esau de' Buondelmonti, ruler of Epirus \n*1497 – Johannes Ockeghem, Flemish composer and educator (b. 1410)\n*1515 – Aldus Manutius, Italian publisher, founded the Aldine Press (b. 1449)\n*1519 – Lorenz von Bibra, Prince-Bishop of the Bishopric of Würzburg (b. 1459)\n*1539 – John III, Duke of Cleves (b. 1491)\n*1585 – Edmund Plowden, English lawyer and scholar (b. 1518)\n*1593 – Jacques Amyot, French author and translator (b. 1513)\n*  1593   – Emperor Ōgimachi of Japan (b. 1517)\n*1597 – Franciscus Patricius, Italian philosopher and scientist (b. 1529)\n*1612 – Christopher Clavius, German mathematician and astronomer (b. 1538)\n*1617 – Prospero Alpini, Italian physician and botanist (b. 1553)\n*1625 – Philipp Julius, Duke of Pomerania (b. 1584)\n*1685 – Charles II of England (b. 1630)\n*1695 – Ahmed II, Ottoman sultan (b. 1643)\n*1740 – Pope Clement XII (b. 1652)\n*1775 – William Dowdeswell, English politician, Chancellor of the Exchequer (b. 1721)\n*1783 – Capability Brown, English gardener and architect (b. 1716)\n*1793 – Carlo Goldoni, Italian-French playwright (b. 1707)\n*1804 – Joseph Priestley, English chemist and theologian (b. 1733)\n*1806 – Thomas-Alexandre Dumas, Haitian-French general (b. 1762)\n*1807 – John Reid, Scottish general (b. 1721)\n*1833 – Pierre André Latreille, French zoologist and entomologist (b. 1762)\n*1834 – Richard Lemon Lander, English explorer (b. 1804)\n*1865 – Isabella Beeton, English author of Mrs Beeton's Book of Household Management (b. 1836)\n*1899 – Alfred, Hereditary Prince of Saxe-Coburg and Gotha (b. 1874)\n*  1899   – Leo von Caprivi, German general and politician, Chancellor of Germany (b. 1831)\n*1916 – Rubén Darío, Nicaraguan poet, journalist, and diplomat (b. 1867)\n*1918 – Gustav Klimt, Austrian painter and illustrator (b. 1862)\n*1929 – Maria Christina of Austria (b. 1858)\n*1931 – Motilal Nehru, Indian lawyer and politician, President of the Indian National Congress (b. 1861)\n*1938 – Marianne von Werefkin, Russian-Swiss painter (b. 1860)\n*1942 – Jaan Soots, Estonian general and politician, 7th Estonian Minister of War (b. 1880)\n*1951 – Gabby Street, American baseball player, coach, and manager (b. 1882)\n*1952 – George VI of the United Kingdom (b. 1895)\n*1958 – victims of the Munich air disaster\n**– Geoff Bent, English footballer (b. 1932)\n**– Roger Byrne, English footballer (b. 1929)\n**– Eddie Colman, English footballer (b. 1936)\n**– Walter Crickmer, English footballer and manager (b. 1900)\n**– Mark Jones, English footballer (b. 1933)\n**– David Pegg, English footballer (b. 1935)\n**– Frank Swift, English footballer and journalist (b. 1913)\n**– Tommy Taylor, English footballer (b. 1932)\n*1963 – Piero Manzoni, Italian painter and sculptor (b. 1933)\n*1964 – Emilio Aguinaldo, Filipino general and politician, 1st President of the Philippines (b. 1869)\n*1967 – Martine Carol, French actress (b. 1920)\n*1972 – Julian Steward, American anthropologist (b. 1902)\n*1976 – Ritwik Ghatak, Bangladeshi-Indian director and screenwriter (b. 1925)\n*  1976   – Vince Guaraldi, American singer-songwriter and pianist (b. 1928)\n*1981 – Hugo Montenegro, American composer and conductor (b. 1925)\n*1982 – Ben Nicholson, British painter (b. 1894)\n*1985 – James Hadley Chase, English-Swiss soldier and author (b. 1906)\n*1986 – Frederick Coutts, Scottish 8th General of The Salvation Army (b. 1899)\n*  1986   – Dandy Nichols, English actress (b. 1907)\n*  1986   – Minoru Yamasaki, American architect, designed the World Trade Center (b. 1912)\n*1987 – Julien Chouinard, Canadian lawyer and jurist (b. 1929)\n*1989 – Barbara W. Tuchman, American historian and author (b. 1912)\n*1990 – Jimmy Van Heusen, American pianist and composer (b. 1913)\n*1991 – Salvador Luria, Italian biologist and physician, Nobel Prize laureate (b. 1912)\n*  1991   – Danny Thomas, American actor, producer, and humanitarian (b. 1914)\n*1993 – Arthur Ashe, American tennis player and sportscaster (b. 1943)\n*1994 – Joseph Cotten, American actor (b. 1905)\n*  1994   – Jack Kirby, American author and illustrator (b. 1917)\n*1995 – James Merrill, American poet and playwright  (b. 1926)\n*1998 – Falco, Austrian pop-rock musician  (b. 1957)\n*1999 – Don Dunstan, Australian lawyer and politician, 35th Premier of South Australia (b. 1926)\n*  1999   – Jimmy Roberts, American tenor (b. 1924)\n*2000 – Phil Walters, American racing driver (b. 1916)\n*2001 – Filemon Lagman, Filipino theoretician and activist (b. 1953)\n*2002 – Max Perutz, Austrian-English biologist and academic, Nobel Prize laureate (b. 1914)\n*2004 – Gerald Bouey, Canadian lieutenant and economist (b. 1920)\n*2005 – Karl Haas, German-American pianist, conductor, and radio host (b. 1913)\n*2007 – Lew Burdette, American baseball player and coach (b. 1926)\n*  2007   – Frankie Laine, American singer-songwriter and actor (b. 1913)\n*  2007   – Willye White, American runner and long jumper (b. 1939)\n*2008 – Tony Rolt, English race car driver and engineer (b. 1918)\n*2009 – Philip Carey, American actor (b. 1925)\n*  2009   – James Whitmore, American actor (b. 1921)\n*2011 – Gary Moore, Irish singer-songwriter, guitarist, and producer (b. 1952)\n*2012 – David Rosenhan, American psychologist and academic (b. 1929)\n*  2012   – Antoni Tàpies, Spanish painter and sculptor (b. 1923)\n*  2012   – Janice E. Voss, American engineer and astronaut (b. 1956)\n*2013 – Chokri Belaid, Tunisian lawyer and politician (b. 1964)\n*  2013   – Menachem Elon, German-Israeli academic and jurist (b. 1923)\n*2014 – Vasiľ Biľak, Slovak politician (b. 1917)\n*  2014   – Ralph Kiner, American baseball player and sportscaster (b. 1922)\n*  2014   – Maxine Kumin, American author and poet (b. 1925)\n*  2014   – Vaçe Zela, Albanian-Swiss singer and guitarist (b. 1939)\n*2015 – André Brink, South African author and playwright (b. 1935)\n*  2015   – Alan Nunnelee, American lawyer and politician (b. 1958)\n*  2015   – Pedro León Zapata, Venezuelan cartoonist (b. 1929)\n*2016 – Dan Gerson, American screenwriter (b. 1966)\n*  2016   – Dan Hicks, American singer-songwriter and guitarist (b. 1941)\n*2017 – Irwin Corey, American comedian and actor (b. 1914)\n*  2017   – Inge Keller, German actress (b. 1923)\n*  2017   – Alec McCowen, English actor (b. 1925)\n*  2017   – Joost van der Westhuizen, South African rugby union footballer (b. 1971)\n\nHolidays and observances\n\n* Christian feast day:\n** Amand\n** Dorothea of Caesarea\n** Hildegund, O.Praem.\n** Jacut\n** Mateo Correa Magallanes (one of Saints of the Cristero War)\n** Mél of Ardagh \n** Paul Miki and Twenty-six Martyrs of Japan\n** Relindis (Renule) of Maaseik\n** Vedastus\n** February 6 (Eastern Orthodox liturgics)\n* International Day of Zero Tolerance to Female Genital Mutilation (United Nations)\n* Ronald Reagan Day (California, United States)\n* Sami National Day (Russia, Finland, Norway and Sweden)\n* Waitangi Day, celebrates the founding of New Zealand in 1840.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 6" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11021" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*AD 60 – The earliest date for which the day of the week is known. A graffito in Pompeii identifies this day as a dies Solis (Sunday). In modern reckoning, this date would have been a Wednesday.\n*1579 – The Archdiocese of Manila was made a diocese by a papal bull with Domingo de Salazar being its first bishop.\n*1649 – The claimant King Charles II of England and Scotland is declared King of Great Britain, by the Parliament of Scotland. This move was not followed by the Parliament of England nor the Parliament of Ireland.\n*1685 – James II of England and VII of Scotland becomes King upon the death of his brother Charles II.\n*1778 – American Revolutionary War: In Paris the Treaty of Alliance and the Treaty of Amity and Commerce are signed by the United States and France signaling official recognition of the new republic.\n*1788 – Massachusetts becomes the sixth state to ratify the United States Constitution.\n*1806 – Battle of San Domingo: British naval victory against the French in the Caribbean.\n*1815 – New Jersey grants the first American railroad charter to John Stevens.\n*1819 – Sir Thomas Stamford Raffles founds Singapore.\n*1820 – The first 86 African American immigrants sponsored by the American Colonization Society depart New York to start a settlement in present-day Liberia.\n*1833 – Otto becomes the first modern King of Greece.\n*1840 – Signing of the Treaty of Waitangi, establishing New Zealand as a British colony.\n*1843 – The first minstrel show in the United States, The Virginia Minstrels, opens (Bowery Amphitheatre in New York City).\n*1851 – The largest Australian bushfires in a populous region in recorded history take place in the state of Victoria.\n*1862 – American Civil War: Forces under the command of Ulysses S. Grant and Andrew H. Foote give the Union its first victory of the war, capturing Fort Henry, Tennessee in the Battle of Fort Henry.\n*1899 – Spanish–American War: The Treaty of Paris, a peace treaty between the United States and Spain, is ratified by the United States Senate.\n*1900 – The Permanent Court of Arbitration, an international arbitration court at The Hague, is created when the Senate of the Netherlands ratifies an 1899 peace conference decree.\n*1918 – British women over the age of 30 who meet minimum property qualifications, get the right to vote when  Representation of the People Act 1918 is passed by Parliament.\n*1919 – The American Legion is founded.\n*1922 – The Washington Naval Treaty is signed in Washington, D.C., limiting the naval armaments of United States, Britain, Japan, France, and Italy.\n*1934 – Far-right leagues rally in front of the Palais Bourbon in an attempted coup against the French Third Republic, creating a political crisis in France.\n*1951 – The Canadian Army enters combat in the Korean War.\n*1951 – The Broker, a Pennsylvania Railroad passenger train derails near Woodbridge Township, New Jersey. The accident kills 85 people and injures over 500 more. The wreck is one of the worst rail disasters in American history.\n*1952 – Elizabeth II becomes Queen of the United Kingdom and her other Realms and Territories and Head of the Commonwealth upon the death of her father, George VI. At the exact moment of succession, she was in a tree house at the Treetops Hotel in Kenya.\n*1958 – Eight Manchester United F.C. players and 15 other passengers are killed in the Munich air disaster.\n*1959 – Jack Kilby of Texas Instruments files the first patent for an integrated circuit.\n*  1959   – At Cape Canaveral, Florida, the first successful test firing of a Titan intercontinental ballistic missile is accomplished.\n*1976 – In testimony before a United States Senate subcommittee, Lockheed Corporation president Carl Kotchian admits that the company had paid out approximately $3 million in bribes to the office of Japanese Prime Minister Kakuei Tanaka.\n*1978 – The Blizzard of 1978, one of the worst Nor'easters in New England history, hit the region, with sustained winds of 65 mph and snowfall of four inches an hour.\n*1981 – The National Resistance Army of Uganda launches an attack on a Ugandan Army installation in the central Mubende District to begin the Ugandan Bush War.\n*1987 – Justice Mary Gaudron becomes the first woman to be appointed to the High Court of Australia.\n*1988 – Michael Jordan makes his signature slam dunk from the free throw line inspiring Air Jordan and the Jumpman logo.\n*1989 – The Round Table Talks start in Poland, thus marking the beginning of the overthrow of communism in Eastern Europe.\n*1996 – Willamette Valley Flood: Floods in the Willamette Valley of Oregon, United States, causes over US$500 million in property damage throughout the Pacific Northwest.\n*  1996   – Birgenair Flight 301 crashed off the coast of the Dominican Republic, and all 189 people inside the airplane are killed. This is the worst accident/incident involving a Boeing 757.\n*1998 – Washington National Airport is renamed Ronald Reagan National Airport.\n*2000 – Second Chechen War: Russia captures Grozny, Chechnya, forcing the separatist Chechen Republic of Ichkeria government into exile.\n*2016 – An earthquake of magnitude 6.6 strikes southern Taiwan, killing 117 people.\n*2018 – SpaceX's Falcon Heavy, a super heavy launch vehicle, makes its maiden flight.\n\nBirths\n\n* 885 – Emperor Daigo of Japan (d. 930)\n*1347 – Dorothea of Montau, Prussian saint (d. 1394)\n*1402 – Louis I, Landgrave of Hesse, Landgrave of Hesse (d. 1458)\n*1452 – Joanna, Princess of Portugal (d. 1490)\n*1453 – Girolamo Benivieni, Florentine poet (d. 1542)\n*1465 – Scipione del Ferro, Italian mathematician and theorist (d. 1526)\n*1536 – Sassa Narimasa, Japanese samurai (d. 1588)\n*1577 – Beatrice Cenci, Italian murderer (d. 1599)\n*1582 – Mario Bettinus, Italian mathematician, astronomer, and philosopher (d. 1657)\n*1605 – Bernard of Corleone, Italian saint (d. 1667)\n*1608 – António Vieira, Portuguese priest and philosopher (d. 1697)\n*1611 – Chongzhen Emperor of China (d. 1644)\n*1612 – Antoine Arnauld, French mathematician, theologian, and philosopher (d. 1694)\n*1643 – Johann Kasimir Kolbe von Wartenberg, Prussian politician, 1st Minister President of Prussia (d. 1712)\n*1664 – Mustafa II, Ottoman sultan (d. 1703)\n*1665 – Anne, Queen of Great Britain (d. 1714)\n*1695 – Nicolaus II Bernoulli, Swiss-Russian mathematician and theorist (d. 1726)\n*1719 – Alberto Pullicino, Maltese painter (d. 1759)\n*1726 – Patrick Russell, Scottish surgeon and zoologist (d. 1805)\n*1732 – Charles Lee, English-American general (d. 1782)\n*1736 – Franz Xaver Messerschmidt, German-Austrian sculptor (d. 1783)\n*1744 – Pierre-Joseph Desault, French anatomist and surgeon (d. 1795)\n*1748 – Adam Weishaupt, German philosopher and academic, founded the Illuminati (d. 1830)\n*1753 – Évariste de Parny, French poet and author (d. 1814)\n*1756 – Aaron Burr, American colonel and politician, 3rd Vice President of the United States (d. 1836)\n*1758 – Julian Ursyn Niemcewicz, Belarusian-Polish poet, playwright, and politician (d. 1841)\n*1769 – Ludwig von Wallmoden-Gimborn, Austrian general (d. 1862)\n*1772 – George Murray, Scottish general and politician, Secretary of State for War and the Colonies (d. 1830)\n*1778 – Ugo Foscolo, Italian author and poet (d. 1827)\n*1781 – John Keane, 1st Baron Keane, Irish general and politician, Governor of Saint Lucia (d. 1844)\n*1796 – John Stevens Henslow, English botanist and geologist (d. 1861)\n*1797 – Joseph von Radowitz, Prussian general and politician, Foreign Minister of Prussia (d. 1853)\n*1799 – Imre Frivaldszky, Hungarian botanist and entomologist (d. 1870)\n*1800 – Achille Devéria, French painter and lithographer (d. 1857)\n*1802 – Charles Wheatstone, English-French physicist and cryptographer (d. 1875)\n*1811 – Henry Liddell, English priest, author, and academic (d. 1898)\n*1814 – Auguste Chapdelaine, French missionary and saint (d. 1856)\n*1818 – William M. Evarts, American lawyer and politician, 27th United States Secretary of State (d. 1901)\n*1829 – Joseph Auguste Émile Vaudremer, French architect, designed the La Santé Prison and Saint-Pierre-de-Montrouge (d. 1914)\n*1832 – John Brown Gordon, American general and politician, 53rd Governor of Georgia (d. 1904)\n*1833 – José María de Pereda, Spanish author and academic (d. 1906)\n*  1833   – J. E. B. Stuart, American general (d. 1864)\n*1834 – Edwin Klebs, German-Swiss pathologist and academic (d. 1913)\n*  1834   – Ema Pukšec, Croatian-German soprano (d. 1889)\n*  1834   – Wilhelm von Scherff, German general and author (d. 1911)\n*1838 – Henry Irving, English actor and manager (d. 1905)\n*  1838   – Israel Meir Kagan, Lithuanian-Polish rabbi and author (d. 1933)\n*1839 – Eduard Hitzig, German neurologist and psychiatrist (d. 1907)\n*1843 – Inoue Kowashi, Japanese scholar and politician (d. 1895)\n*  1843   – Frederic William Henry Myers, English poet and philologist, co-founded the Society for Psychical Research (d. 1901)\n*1845 – Isidor Straus, German-American businessman and politician (d. 1912)\n*1847 – Henry Janeway Hardenbergh, American architect, designed the Plaza Hotel (d. 1918)\n*1852 – C. Lloyd Morgan, English zoologist and psychologist (d. 1936)\n*  1852   – Vasily Safonov, Russian pianist, composer, and conductor (d. 1918)\n*1861 – Nikolay Zelinsky, Russian chemist and academic (d. 1953)\n*1864 – John Henry Mackay, Scottish-German philosopher and author (d. 1933)\n*1866 – Karl Sapper, German linguist and explorer (d. 1945)\n*1872 – Robert Maillart, Swiss engineer, designed the Salginatobel Bridge and Schwandbach Bridge (d. 1940)\n*1874 – Bhaktisiddhanta Sarasvati Thakura, Indian religious leader, founded the Gaudiya Math (d. 1937)\n*1875 – Leonid Gobyato, Russian general (d. 1915)\n*1876 – Henry Blogg, English fisherman and sailor (d. 1954)\n*1879 – Othon Friesz, French painter (d. 1949)\n*  1879   – Magnús Guðmundsson, Icelandic lawyer and politician, 3rd Prime Minister of Iceland (d. 1937)\n*  1879   – Edwin Samuel Montagu, English politician, Chancellor of the Duchy of Lancaster (d. 1924)\n*  1879   – Carl Ramsauer, German physicist and author (d. 1955)\n*1880 – Nishinoumi Kajirō II, Japanese sumo wrestler, the 25th Yokozuna (d. 1931)\n*1884 – Marcel Cohen, French linguist and scholar (d. 1974)\n*1887 – Josef Frings, German cardinal (d. 1978)\n*1890 – Khan Abdul Ghaffar Khan, Pakistani activist and politician (d. 1988)\n*1892 – Maximilian Fretter-Pico, German general (d. 1984)\n*  1892   – William P. Murphy, American physician and academic, Nobel Prize laureate (d. 1987)\n*1893 – Muhammad Zafarullah Khan, Pakistani politician and diplomat, 1st Minister of Foreign Affairs for Pakistan (d. 1985)\n*1894 – Eric Partridge, New Zealand-English lexicographer and academic (d. 1979)\n*1895 – Robert La Follette Jr., American politician (d. 1953)\n*  1895   – María Teresa Vera, Cuban singer, guitarist and composer (d. 1965) \n*  1895   – Babe Ruth, American baseball player and coach (d. 1948)\n*1898 – Harry Haywood, American soldier and politician (d. 1985)\n*1899 – Ramon Novarro, Mexican-American actor, singer, and director (d. 1968)\n*1901 – Ben Lyon, American actor (d. 1979)\n*1902 – George Brunies, American trombonist (d. 1974)\n*1903 – Claudio Arrau, Chilean pianist and composer (d. 1991)\n*1905 – Władysław Gomułka, Polish politician (d. 1982)\n*  1905   – Jan Werich, Czech actor and playwright (d. 1980)\n*1906 – Joseph Schull, Canadian playwright and historian (d. 1980)\n*1908 – Amintore Fanfani, Italian journalist and politician, 32nd Prime Minister of Italy (d. 1999)\n*  1908   – Edward Lansdale, American general and CIA agent (d. 1987)\n*  1908   – Geo Bogza, Romanian poet and journalist (d. 1993)\n*  1908   – Michael Maltese, American actor, screenwriter, and composer (d. 1981)\n*1910 – Roman Czerniawski, Polish air force officer and spy (d. 1985)\n*  1910   – Irmgard Keun, German author (d. 1982)\n*  1910   – Carlos Marcello, Tunisian-American gangster (d. 1993)\n*1911 – Ronald Reagan, American actor and politician, 40th President of the United States (d. 2004)\n*1912 – Eva Braun, German wife of Adolf Hitler (d. 1945)\n*  1912   – Christopher Hill, English historian and author (d. 2003)\n*1913 – Mary Leakey, English-Kenyan archaeologist and anthropologist (d. 1996)\n*1914 – Thurl Ravenscroft, American voice actor and singer (d. 2005)\n*1915 – Kavi Pradeep, Indian poet and songwriter (d. 1998)\n*1916 – John Crank, English mathematician and physicist (d. 2006)\n*1917 – Louis-Philippe de Grandpré, Canadian lawyer and jurist (d. 2008)\n*1917 – Zsa Zsa Gabor, Hungarian-American actress and socialite (d. 2016)\n*1918 – Lothar-Günther Buchheim, German author and painter (d. 2007)\n*1919 – Takashi Yanase, Japanese poet and illustrator, created Anpanman (d. 2013)\n*1921 – Carl Neumann Degler, American historian and author (d. 2014)\n*  1921   – Bob Scott, New Zealand rugby player (d. 2012)\n*1922 – Patrick Macnee, English-American actor and costume designer (d. 2015)\n*  1922   – Denis Norden, English actor, screenwriter, and television host\n*  1922   – Haskell Wexler, American director, producer, and cinematographer (d. 2015)\n*1923 – Gyula Lóránt, Hungarian footballer and manager (d. 1981)\n*1924 – Billy Wright, English footballer and manager (d. 1994)\n*  1924   – Jin Yong, Hong Kong author and publisher, founded Ming Pao\n*1925 – Walker Edmiston, American actor and puppeteer (d. 2007)\n*1927 – Gerard K. O'Neill, American physicist and astronomer (d. 1992)\n*1928 – Allan H. Meltzer, American economist and academic (d. 2017)\n*1929 – Colin Murdoch, New Zealand pharmacist and veterinarian, invented the tranquilliser gun (d. 2008)\n*  1929   – Oscar Sambrano Urdaneta, Venezuelan author and critic (d. 2011)\n*  1929   – Valentin Yanin, Russian historian and author\n*1930 – Jun Kondo, Japanese physicist and academic\n*1931 – Rip Torn, American actor\n*  1931   – Fred Trueman, English cricketer (d. 2006)\n*  1931   – Ricardo Vidal, Filipino cardinal (d. 2017)\n*1932 – Camilo Cienfuegos, Cuban soldier and anarchist (d. 1959)\n*  1932   – François Truffaut, French actor, director, producer, and screenwriter (d. 1984)\n*1933 – Leslie Crowther, English comedian, actor, and game show host (d. 1996)\n*1936 – Kent Douglas, Canadian ice hockey player and coach (d. 2009)\n*1938 – Fred Mifflin, Canadian admiral and politician, 19th Minister of Veterans Affairs (d. 2013)\n*1939 – Jean Beaudin, Canadian director and screenwriter\n*  1939   – Mike Farrell, American actor, director, and producer\n*  1939   – Jair Rodrigues, Brazilian singer (d. 2014)\n*1940 – Tom Brokaw, American journalist and author\n*  1940   – Petr Hájek, Czech mathematician and academic\n*  1940   – Jimmy Tarbuck, English comedian and actor\n*1941 – Stephen Albert, American pianist and composer (d. 1992)\n*  1941   – Dave Berry, English pop singer\n*  1941   – Gigi Perreau, American actress and director\n*1942 – Sarah Brady, American activist and author (d. 2015)\n*  1942   – Charlie Coles, American basketball player and coach (d. 2013)\n*  1942   – Ahmad-Jabir Ahmadov Ismail oghlu, Azerbaijani philosopher and academic\n*  1942   – James Loewen, American sociologist and historian\n*  1942   – Tommy Roberts, English fashion designer (d. 2012)\n*1943 – Fabian Forte, American pop singer and actor\n*  1943   – Gayle Hunnicutt, American actress\n*1944 – Christine Boutin, French politician, French Minister of Housing and Urban Development\n*  1944   – Willie Tee, American singer-songwriter, keyboard player, and producer (d. 2007)\n*  1944   – Michael Tucker, American actor and producer\n*1945 – Bob Marley, Jamaican singer-songwriter and guitarist (d. 1981)\n*1946 – Richie Hayward, American drummer and songwriter  (d. 2010)\n*  1946   – Kate McGarrigle, Canadian musician and singer-songwriter (d. 2010)\n*  1946   – Jim Turner, American captain and politician\n*1947 – Bill Staines, American singer-songwriter and guitarist\n*1949 – Mike Batt, English singer-songwriter and producer \n*  1949   – Manuel Orantes, Spanish tennis player\n*  1949   – Jim Sheridan, Irish director, producer, and screenwriter\n*1950 – Natalie Cole, American singer-songwriter and actress (d. 2015)\n*  1950   – Timothy M. Dolan, American cardinal\n*  1950   – Punky Meadows, American rock guitarist and songwriter\n*1952 – Ric Charlesworth, Australian cricketer, coach, and politician\n*  1952   – Viktor Giacobbo, Swiss actor, producer, and screenwriter\n*  1952   – Ricardo La Volpe, Argentinian footballer, manager, and coach \n*1955 – Avram Grant, Israeli football manager\n*  1955   – Michael Pollan, American journalist, author, and academic\n*  1955   – Bruno Stolorz, French rugby player and coach\n*1956 – Jerry Marotta, American drummer\n*1957 – Andres Lipstok, Estonian economist and politician, Estonian Minister of Economic Affairs\n*  1957   – Kathy Najimy, American actress and comedian\n*  1957   – Simon Phillips, English drummer and producer \n*  1957   – Robert Townsend, American actor and director\n*1958 – Cecily Adams, American actress and casting director (d. 2004)\n*  1958   – Tim Dakin, English bishop and missionary\n*1960 – Jeremy Bowen, Welsh journalist\n*  1960   – Megan Gallagher, American actress\n*1961 – Cam Cameron, American football player and coach\n*  1961   – Bill Lester, American race car driver\n*  1961   – Yury Onufriyenko, Ukrainian-Russian colonel, pilot, and astronaut\n*1962 – Stavros Lambrinidis, Greek lawyer and politician, Minister of Foreign Affairs for Greece\n*  1962   – Axl Rose, American singer-songwriter and producer \n*1963 – David Capel, English cricketer\n*  1963   – Scott Gordon, American ice hockey player and coach\n*  1963   – Quentin Letts, English journalist and critic\n*1964 – Laurent Cabannes, French rugby player\n*  1964   – Gordon Downie, Canadian singer-songwriter, guitarist, and actor (d. 2017)\n*  1964   – Colin Miller, Australian cricketer and sportscaster\n*  1964   – Andrey Zvyagintsev, Russian actor and director\n*1965 – Jan Svěrák, Czech actor, director, and screenwriter\n*1966 – Rick Astley, English singer-songwriter\n*1967 – Anita Cochran, American singer-songwriter, guitarist, and producer\n*  1967   – Izumi Sakai, Japanese singer-songwriter (d. 2007)\n*1968 – Adolfo Valencia, Colombian footballer\n*  1968   – Akira Yamaoka, Japanese composer and producer\n*1969 – David Hayter, American actor and screenwriter\n*  1969   – Masaharu Fukuyama, Japanese singer-songwriter, producer, and actor\n*  1969   – Tim Sherwood, English footballer and manager\n*  1969   – Bob Wickman, American baseball player\n*1970 – Per Frandsen, Danish footballer and manager\n*  1970   – Tim Herron, American golfer\n*1971 – Brad Hogg, Australian cricketer\n*  1971   – Carlos Rogers, American basketball player\n*1972 – Stefano Bettarini, Italian footballer\n*  1972   – David Binn, American football player\n*1974 – Aljo Bendijo, Filipino journalist\n*  1974   – Ed Chamberlin, English broadcaster\n*1975 – Chad Allen, American baseball player and coach\n*  1975   – Orkut Büyükkökten, Turkish computer scientist and engineer, created Orkut\n*  1975   – Tomoko Kawase, Japanese singer-songwriter and producer \n*1976 – Tanja Frieden, Swiss snowboarder and educator\n*  1976   – Kim Zmeskal, American gymnast and coach\n*1977 – Jason Euell, English footballer and coach\n*  1977   – Josh Stewart, American actor\n*1978 – Yael Naim, French-Israeli singer-songwriter\n*1979 – Dan Bălan, Moldovan singer-songwriter and producer \n*1980 – Kerry Jeremy, Antiguan cricketer\n*  1980   – Kim Poirier, Canadian actress, singer, and producer\n*  1980   – Luke Ravenstahl, American politician, 58th Mayor of Pittsburgh\n*1981 – Ricky Barnes, American golfer\n*  1981   – Calum Best, American-English model and actor\n*  1981   – Shim Eun-jin, South Korean singer and actress \n*  1981   – Alison Haislip, American actress and producer\n*  1981   – Jens Lekman, Swedish singer-songwriter and guitarist\n*  1981   – Ty Warren, American football player\n*1982 – Tank, Taiwanese singer-songwriter\n*  1982   – Alice Eve, English actress \n*  1982   – Elise Ray, American gymnast\n*1983 – Melrose Bickerstaff, American model and fashion designer\n*  1983   – Brodie Croyle, American football player\n*  1983   – Dimas Delgado, Spanish footballer\n*  1983   – S. Sreesanth, Indian cricketer\n*  1983   – Jamie Whincup, Australian race car driver\n*1984 – Darren Bent, English footballer\n*  1984   – Piret Järvis, Estonian singer-songwriter and guitarist \n*  1984   – Antoine Wright, American basketball player\n*1985 – Ben Creagh, Australian rugby league player\n*  1985   – Kris Humphries, American basketball player\n*  1986   – Dane DeHaan, American actor \n*1988 – Bailey Hanks, American actress, singer, and dancer\n*1989 – Craig Cathcart, Northern Irish footballer\n*  1989   – Jonny Flynn, American basketball player\n*1990 – Adam Henrique, Canadian ice hockey player\n*  1990   – Jermaine Kearse, American football player\n*  1990   – Aida Rybalko, Lithuanian figure skater\n*1991 – Tobias Eisenbauer, Austrian ice dancer\n*  1991   – Ida Njåtun, Norwegian speed skater\n*  1991   – Eva Wacanno, Dutch tennis player\n*  1991   – Fei Yu, Chinese footballer\n*1992 – Víctor Mañón, Mexican footballer\n*1993 – Teresa Scanlan, Miss America 2011\n*  1993   – Tinashe, American singer-songwriter, dancer, and actress \n*  1994   – Charlie Heaton, British actor and musician \n*1995 – Sam McQueen, English footballer\n*1995 – Leon Goretzka, German footballer\n*1996 – Justina Mikulskytė, Lithuanian tennis player\n\nDeaths\n\n* 743 – Hisham ibn Abd al-Malik, Umayyad caliph (b. 691)\n* 797 – Donnchad Midi, Irish king (b. 733)\n* 891 – Photios I of Constantinople (b. 810)\n*1140 – Thurstan, Archbishop of York\n*1155 – King Sigurd II of Norway (b. 1133)\n*1215 – Hōjō Tokimasa, Japanese shikken of the Kamakura bakufu (b. 1138)\n*1378 – Joanna of Bourbon (b. 1338)\n*1411 – Esau de' Buondelmonti, ruler of Epirus \n*1497 – Johannes Ockeghem, Flemish composer and educator (b. 1410)\n*1515 – Aldus Manutius, Italian publisher, founded the Aldine Press (b. 1449)\n*1519 – Lorenz von Bibra, Prince-Bishop of the Bishopric of Würzburg (b. 1459)\n*1539 – John III, Duke of Cleves (b. 1491)\n*1585 – Edmund Plowden, English lawyer and scholar (b. 1518)\n*1593 – Jacques Amyot, French author and translator (b. 1513)\n*  1593   – Emperor Ōgimachi of Japan (b. 1517)\n*1597 – Franciscus Patricius, Italian philosopher and scientist (b. 1529)\n*1612 – Christopher Clavius, German mathematician and astronomer (b. 1538)\n*1617 – Prospero Alpini, Italian physician and botanist (b. 1553)\n*1625 – Philipp Julius, Duke of Pomerania (b. 1584)\n*1685 – Charles II of England (b. 1630)\n*1695 – Ahmed II, Ottoman sultan (b. 1643)\n*1740 – Pope Clement XII (b. 1652)\n*1775 – William Dowdeswell, English politician, Chancellor of the Exchequer (b. 1721)\n*1783 – Capability Brown, English gardener and architect (b. 1716)\n*1793 – Carlo Goldoni, Italian-French playwright (b. 1707)\n*1804 – Joseph Priestley, English chemist and theologian (b. 1733)\n*1806 – Thomas-Alexandre Dumas, Haitian-French general (b. 1762)\n*1807 – John Reid, Scottish general (b. 1721)\n*1833 – Pierre André Latreille, French zoologist and entomologist (b. 1762)\n*1834 – Richard Lemon Lander, English explorer (b. 1804)\n*1865 – Isabella Beeton, English author of Mrs Beeton's Book of Household Management (b. 1836)\n*1899 – Alfred, Hereditary Prince of Saxe-Coburg and Gotha (b. 1874)\n*  1899   – Leo von Caprivi, German general and politician, Chancellor of Germany (b. 1831)\n*1916 – Rubén Darío, Nicaraguan poet, journalist, and diplomat (b. 1867)\n*1918 – Gustav Klimt, Austrian painter and illustrator (b. 1862)\n*1929 – Maria Christina of Austria (b. 1858)\n*1931 – Motilal Nehru, Indian lawyer and politician, President of the Indian National Congress (b. 1861)\n*1938 – Marianne von Werefkin, Russian-Swiss painter (b. 1860)\n*1942 – Jaan Soots, Estonian general and politician, 7th Estonian Minister of War (b. 1880)\n*1951 – Gabby Street, American baseball player, coach, and manager (b. 1882)\n*1952 – George VI of the United Kingdom (b. 1895)\n*1958 – victims of the Munich air disaster\n**– Geoff Bent, English footballer (b. 1932)\n**– Roger Byrne, English footballer (b. 1929)\n**– Eddie Colman, English footballer (b. 1936)\n**– Walter Crickmer, English footballer and manager (b. 1900)\n**– Mark Jones, English footballer (b. 1933)\n**– David Pegg, English footballer (b. 1935)\n**– Frank Swift, English footballer and journalist (b. 1913)\n**– Tommy Taylor, English footballer (b. 1932)\n*1963 – Piero Manzoni, Italian painter and sculptor (b. 1933)\n*1964 – Emilio Aguinaldo, Filipino general and politician, 1st President of the Philippines (b. 1869)\n*1967 – Martine Carol, French actress (b. 1920)\n*1972 – Julian Steward, American anthropologist (b. 1902)\n*1976 – Ritwik Ghatak, Bangladeshi-Indian director and screenwriter (b. 1925)\n*  1976   – Vince Guaraldi, American singer-songwriter and pianist (b. 1928)\n*1981 – Hugo Montenegro, American composer and conductor (b. 1925)\n*1982 – Ben Nicholson, British painter (b. 1894)\n*1985 – James Hadley Chase, English-Swiss soldier and author (b. 1906)\n*1986 – Frederick Coutts, Scottish 8th General of The Salvation Army (b. 1899)\n*  1986   – Dandy Nichols, English actress (b. 1907)\n*  1986   – Minoru Yamasaki, American architect, designed the World Trade Center (b. 1912)\n*1987 – Julien Chouinard, Canadian lawyer and jurist (b. 1929)\n*1989 – Barbara W. Tuchman, American historian and author (b. 1912)\n*1990 – Jimmy Van Heusen, American pianist and composer (b. 1913)\n*1991 – Salvador Luria, Italian biologist and physician, Nobel Prize laureate (b. 1912)\n*  1991   – Danny Thomas, American actor, producer, and humanitarian (b. 1914)\n*1993 – Arthur Ashe, American tennis player and sportscaster (b. 1943)\n*1994 – Joseph Cotten, American actor (b. 1905)\n*  1994   – Jack Kirby, American author and illustrator (b. 1917)\n*1995 – James Merrill, American poet and playwright  (b. 1926)\n*1998 – Falco, Austrian pop-rock musician  (b. 1957)\n*1999 – Don Dunstan, Australian lawyer and politician, 35th Premier of South Australia (b. 1926)\n*  1999   – Jimmy Roberts, American tenor (b. 1924)\n*2000 – Phil Walters, American racing driver (b. 1916)\n*2001 – Filemon Lagman, Filipino theoretician and activist (b. 1953)\n*2002 – Max Perutz, Austrian-English biologist and academic, Nobel Prize laureate (b. 1914)\n*2004 – Gerald Bouey, Canadian lieutenant and economist (b. 1920)\n*2005 – Karl Haas, German-American pianist, conductor, and radio host (b. 1913)\n*2007 – Lew Burdette, American baseball player and coach (b. 1926)\n*  2007   – Frankie Laine, American singer-songwriter and actor (b. 1913)\n*  2007   – Willye White, American runner and long jumper (b. 1939)\n*2008 – Tony Rolt, English race car driver and engineer (b. 1918)\n*2009 – Philip Carey, American actor (b. 1925)\n*  2009   – James Whitmore, American actor (b. 1921)\n*2011 – Gary Moore, Irish singer-songwriter, guitarist, and producer (b. 1952)\n*2012 – David Rosenhan, American psychologist and academic (b. 1929)\n*  2012   – Antoni Tàpies, Spanish painter and sculptor (b. 1923)\n*  2012   – Janice E. Voss, American engineer and astronaut (b. 1956)\n*2013 – Chokri Belaid, Tunisian lawyer and politician (b. 1964)\n*  2013   – Menachem Elon, German-Israeli academic and jurist (b. 1923)\n*2014 – Vasiľ Biľak, Slovak politician (b. 1917)\n*  2014   – Ralph Kiner, American baseball player and sportscaster (b. 1922)\n*  2014   – Maxine Kumin, American author and poet (b. 1925)\n*  2014   – Vaçe Zela, Albanian-Swiss singer and guitarist (b. 1939)\n*2015 – André Brink, South African author and playwright (b. 1935)\n*  2015   – Alan Nunnelee, American lawyer and politician (b. 1958)\n*  2015   – Pedro León Zapata, Venezuelan cartoonist (b. 1929)\n*2016 – Dan Gerson, American screenwriter (b. 1966)\n*  2016   – Dan Hicks, American singer-songwriter and guitarist (b. 1941)\n*2017 – Irwin Corey, American comedian and actor (b. 1914)\n*  2017   – Inge Keller, German actress (b. 1923)\n*  2017   – Alec McCowen, English actor (b. 1925)\n*  2017   – Joost van der Westhuizen, South African rugby union footballer (b. 1971)\n\nHolidays and observances\n\n* Christian feast day:\n** Amand\n** Dorothea of Caesarea\n** Hildegund, O.Praem.\n** Jacut\n** Mateo Correa Magallanes (one of Saints of the Cristero War)\n** Mél of Ardagh \n** Paul Miki and Twenty-six Martyrs of Japan\n** Relindis (Renule) of Maaseik\n** Vedastus\n** February 6 (Eastern Orthodox liturgics)\n* International Day of Zero Tolerance to Female Genital Mutilation (United Nations)\n* Ronald Reagan Day (California, United States)\n* Sami National Day (Russia, Finland, Norway and Sweden)\n* Waitangi Day, celebrates the founding of New Zealand in 1840. February 6. http://en.wikipedia.org/?curid=11021."
  }
}
