{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19325",
  "eid" : "39e9a570-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606407,
  "textBody" : "Monism is the view that attributes oneness or singleness (Greek: μόνος) to a concept (e.g., existence). Various kinds of monism can be distinguished:\n* Priority monism states that all existing things go back to a source that is distinct from them (e.g., in Neoplatonism everything is derived from The One). In this view only one thing is ontologically basic or prior to everything else.\n* Existence monism posits that, strictly speaking, there exists only a single thing (e.g., the universe), which can only be artificially and arbitrarily divided into many things.Strawson, G. (2014 in press): \"Nietzsche's metaphysics?\". In: Dries, M. & Kail, P. (eds): \"Nietzsche on Mind and Nature\". Oxford University Press. [http://s3.amazonaws.com/academia.edu.documents/30981598/Nietzsches_Metaphysics_June_2012_Strawson_draft_-libre.pdf?AWSAccessKeyIdAKIAJ56TQJRTWSMTNPEA&Expires\n1396293668&Signature=Bji6%2FSyzFKV1jkuZRJfnLSB0Qko%3D PDF of draft] \n* Substance monism (\"stuff monism\") asserts that a variety of existing things can be explained in terms of a single reality or substance. Substance monism posits that only one kind of stuff (e.g., matter or mind) exists, although many things may be made out of this stuff.\n\nDefinitions\n\nThere are two sorts of definitions for monism:\n# The wide definition: a philosophy is monistic if it postulates unity of origin of all things; all existing things return to a source that is distinct from them.\n# The restricted definition: this requires not only unity of origin but also unity of substance and essence.\n\nAlthough the term \"monism\" is derived from Western philosophy to typify positions in the mind–body problem, it has also been used to typify religious traditions. In modern Hinduism, the term \"absolute monism\" is being used for Advaita Vedanta.\n\nHistory\n\nThe term \"monism\" was introduced in the 18th century by Christian von Wolff in his work Logic (1728),[http://science.jrank.org/pages/7886/Monism.html jrank.org, Monism] to designate types of philosophical thought in which the attempt was made to eliminate the dichotomy of body and mind and explain all phenomena by one unifying principle, or as manifestations of a single substance.[http://www.encyclopedia.com/topic/monism.aspx#4 \"monism\"], Columbia Electronic Encyclopedia, 6th Edition. Retrieved 29 October 2014.\n\nThe mind–body problem in philosophy examines the relationship between mind and matter, and in particular the relationship between consciousness and the brain. The problem was addressed by René Descartes in the 17th century, resulting in Cartesian dualism, and by pre-Aristotelian philosophers, in Avicennian philosophy, and in earlier Asian and more specifically Indian traditions.\n\nIt was later also applied to the theory of absolute identity set forth by Hegel and Schelling. Thereafter the term was more broadly used, for any theory postulating a unifying principle. The opponent thesis of dualism also was broadened, to include pluralism. According to Urmson, as a result of this extended use, the term is \"systematically ambiguous\".\n\nAccording to Jonathan Schaffer, monism lost popularity due to the emergence of Analytic philosophy in the early twentieth century, which revolted against the neo-Hegelians. Carnap and Ayer, who were strong proponents of positivism, \"ridiculed the whole question as incoherent mysticism\".\n\nThe mind–body problem has reemerged in social psychology and related fields, with the interest in mind–body interaction and the rejection of Cartesian mind–body dualism in the identity thesis, a modern form of monism. Monism is also still relevant to the philosophy of mind, where various positions are defended.\n\nPhilosophy\n\nTypes\n\nDifferent types of monism include:Schaffer, Jonathan, Monism: The Priority of the Whole, http://www.jonathanschaffer.org/monism.pdf\n# Substance monism, \"the view that the apparent plurality of substances is due to different states or appearances of a single substance\"\n# Attributive monism, \"the view that whatever the number of substances, they are of a single ultimate kind\"\n# Partial monism, \"within a given realm of being (however many there may be) there is only one substance\"\n# Existence monism, \"the view that there is only one concrete object token (The One, \"Τὸ Ἕν\" or the Monad)\"Schaffer, Jonathan, \"Monism\", The Stanford Encyclopedia of Philosophy (Summer 2015 Edition), Edward N. Zalta (ed.), URL=http://plato.stanford.edu/archives/sum2015/entries/monism/\n# Priority monism, \"the whole is prior to its parts\" or \"the world has parts, but the parts are dependent fragments of an integrated whole\"\n# Property monism, \"the view that all properties are of a single type (e.g., only physical properties exist)\" \n# Genus monism, \"the doctrine that there is a highest category; e.g., being\"\n\nViews contrasting with monism are:\n* Metaphysical dualism, which asserts that there are two ultimately irreconcilable substances or realities such as Good and Evil, for example, Manichaeism, \n* Metaphysical pluralism, which asserts three or more fundamental substances or realities.\n* Metaphysical nihilism, negates any of the above categories (substances, properties, concrete objects, etc.).\n\nMonism in modern philosophy of mind can be divided into three broad categories:\n# Idealist, mentalistic monism, which holds that only mind or spirit exists. \n# Neutral monism, which holds that one sort of thing fundamentally exists, to which both the mental and the physical can be reduced[http://www.philosophybasics.com/branch_monism.html Luke Mastin (2008), \"Monism\"]\n# Material monism (also called Physicalism and materialism), which holds that the material world is primary, and consciousness arises through the interaction with the material world\n:a. Eliminative Materialism, according to which everything is physical and mental things do not exist\n:b. Reductive physicalism, according to which mental things do exist and are a kind of physical thing\n\nCertain positions do not fit easily into the above categories, such as functionalism, anomalous monism, and reflexive monism. Moreover, they do not define the meaning of \"real\".\n\nMonistic philosophers\n\nPre-Socratic\n\nWhile the lack of information makes it difficult in some cases to be sure of the details, the following pre-Socratic philosophers thought in monistic terms:\n* Thales: Water.\n* Anaximander: Apeiron (meaning 'the undefined infinite'). Reality is some, one thing, but we cannot know what.\n* Anaximenes: Air.\n* Heraclitus: Change, symbolized by fire (in that everything is in constant flux).\n* Parmenides argued that Being or Reality is an unmoving perfect sphere, unchanging, undivided.\n\nPost-Socrates\n\n* Neopythagorians such as Apollonius of Tyana centered their cosmologies on the Monad or One.\n* Stoics taught that there is only one substance, identified as God.\n* Middle Platonism under such works as those by Numenius taught that the Universe emanates from the Monad or One.\n* Neoplatonism is monistic. Plotinus taught that there was an ineffable transcendent god, 'The One,' of which subsequent realities were emanations. From The One emanates the Divine Mind (Nous), the Cosmic Soul (Psyche), and the World (Cosmos).\n\nModern\n\n* Giordano BrunoDe la causa, principio e Uno, London, 1584De monade (De monade, numero et figura liber consequens quinque de minimo magno et mensura), Frankfurt, 1591\n* Baruch de Spinoza\n* Gottfried Wilhelm Leibniz\n* Alexander Bogdanov\n* Georg Wilhelm Friedrich Hegel\n* F. H. Bradley\n* Arthur Schopenhauer\n* Ernst Haeckel[https://books.google.com/books?idpFJvtfRaM48C Wonders of Life] by Ernst Haeckel.[https://books.google.com/books?id\nRdsdAAAAMAAJ The Evolution of Man: A Popular Scientific Study, Volume 2] by Ernst Heinrich Philipp August Haeckel.\n* Jonathan Schaffer\n* Georgi Plekhanov\n* Friedrich Engels\n* Karl Marx\n\nReligion\n\nPantheism\n\nPantheism is the belief that everything composes an all-encompassing, immanent God, or that the universe (or nature) is identical with divinity. Pantheists thus do not believe in a personal or anthropomorphic god, but believe that interpretations of the term differ.\n\nPantheism was popularized in the modern era as both a theology and philosophy based on the work of the 17th century philosopher Baruch Spinoza, whose Ethics was an answer to Descartes' famous dualist theory that the body and spirit are separate. Spinoza held that the two are the same, and this monism is a fundamental quality of his philosophy. He was described as a \"God-intoxicated man,\" and used the word God to describe the unity of all substance. Although the term pantheism was not coined until after his death, Spinoza is regarded as its most celebrated advocate.\n\nH. P. Owen claimed that\n\nPantheism is closely related to monism, as pantheists too believe all of reality is one substance, called Universe, God or Nature. Panentheism, a slightly different concept (explained below), however is dualistic.Crosby, Donald A. (2008). Living with Ambiguity: Religious Naturalism and the Menace of Evil. New York: State University of New York Press. pp. 124. . Some of the most famous pantheists are the Stoics, Giordano Bruno and Spinoza.\n\nPanentheism\n\nPanentheism (from Greek  (pân) \"all\";  (en) \"in\"; and  (theós) \"God\"; \"all-in-God\") is a belief system that posits that the divine (be it a monotheistic God, polytheistic gods, or an eternal cosmic animating force) interpenetrates every part of nature, but is not one with nature. Panentheism differentiates itself from pantheism, which holds that the divine is synonymous with the universe.\n\nIn panentheism, there are two types of substance, \"pan\" the universe and God. The universe and the divine are not ontologically equivalent. God is viewed as the eternal animating force within the universe. In some forms of panentheism, the cosmos exists within God, who in turn \"transcends\", \"pervades\" or is \"in\" the cosmos.\n\nWhile pantheism asserts that 'All is God', panentheism claims that God animates all of the universe, and also transcends the universe. In addition, some forms indicate that the universe is contained within God,  like in the concept of Tzimtzum. Much Hindu thought is highly characterized by panentheism and pantheism.[http://www.britannica.com/EBchecked/topic/441533/pantheism/38168/Pantheism-and-panentheism-in-non-Western-cultures] Britannica - Pantheism and Panentheism in non-Western culturesWhiting, Robert. [https://books.google.com/books?id\n_UfRgCZThWYC&pgPR8&dq\nshakti+panentheism&hlen&sa\nX&eijz7nT6-kF8P3rQejn_GDCQ&ved\n0CDQQ6AEwADgK#vonepage&q\nshakti%20panentheism&f=false Religions for Today] Stanley Thomes (Publishers) Ltd. P. VIII. . Hasidic Judaism merges the elite ideal of nullification to paradoxical transcendent Divine Panentheism, through intellectual articulation of inner dimensions of Kabbalah, with the populist emphasis on the panentheistic Divine immanence in everything and deeds of kindness.\n\nPaul Tillich has argued for such a concept within Christian theology, as has liberal biblical scholar Marcus Borg and mystical theologian Matthew Fox, an Episcopal priest.\n\nPandeism\n\nPandeism or pan-deism (from  and  meaning \"god\" in the sense of deism), is a term describing beliefs coherently incorporating or mixing logically reconcilable elements of pantheism (that \"God\", or a metaphysically equivalent creator deity, is identical to Nature) and classical deism (that the creator-god who designed the universe no longer exists in a status where it can be reached, and can instead be confirmed only by reason). It is therefore most particularly the belief that the creator of the universe actually became the universe, and so ceased to exist as a separate entity.Alex Ashman, BBC News, \"[http://www.bbc.co.uk/dna/h2g2/A25172309 Metaphysical Isms]\".\n\nThrough this synergy pandeism claims to answer primary objections to deism (why would God create and then not interact with the universe?) and to pantheism (how did the universe originate and what is its purpose?).\n\nAsian traditions\n\nCharacteristics\n\nThe central problem in Asian (religious) philosophy is not the body-mind problem, but the search for an unchanging Real or Absolute beyond the world of appearances and changing phenomena, and the search for liberation from dukkha and the liberation from the cycle of rebirth. In Hinduism, substance-ontology prevails, seeing Brahman as the unchanging real beyond the world of appearances. In Buddhism process ontology is prevalent, seeing reality as empty of an unchanging essence.\n\nCharacteristic for various Asian religions is the discernment of levels of truth, an emphasis on intuitive-experiential understanding of the Absolute such as jnana, bodhi  and kensho, and an emphasis on the integration of these levels of truth and its understanding.\n\nHinduism\n\nVedanta\n\nVedanta is the inquiry into and systematisation of the Vedas and Upanishads, to harmonise the various and contrasting ideas that can be found in those texts. Within Vedanta, different schools exist:Wilhelm Halbfass (1995), Philology and Confrontation: Paul Hacker on Traditional and Modern Vedanta, State University of New York Press, , pages 137-143 \n* Advaita Vedanta, absolute monism, of which Adi Shankara is the best-known representative;\n* Vishishtadvaita, qualified monism, is from the school of Ramanuja;Jeaneane Fowler (2012), The Bhagavad Gita: A Text and Commentary for Students, Sussex Academic Press, , page xxviii\n* Shuddhadvaita, in-essence monism, is the school of Vallabha; \n* Dvaitadvaita, differential monism, is a school founded by Nimbarka; \n* Dvaita, dualism, is a school founded by Madhvacharya is probably the only Vedantic System that is opposed to all types of monism. It believes that God is eternally different from souls and matter in both form and essence.\n\nAdvaita Vedanta\n\nMonism is most clearly identified in Advaita Vedanta, though Renard points out that this may be a western interpretation, bypassing the intuitive understanding of a nondual reality.\n\nIn Advaita Vedanta, Brahman is the eternal, unchanging, infinite, immanent, and transcendent reality which is the Divine Ground of all matter, energy, time, space, being, and everything beyond in this Universe. The nature of Brahman is described as transpersonal, personal and impersonal by different philosophical schools.Brodd, Jefferey (2003). World Religions. Winona, MN: Saint Mary's Press. .\n\nAdvaita Vedanta gives an elaborate path to attain moksha. It entails more than self-inquiry or bare insight into one's real nature. Practice, especially Jnana Yoga, is needed to \"destroy one’s tendencies (vAasanA-s)\" before real insight can be attained.[http://www.advaita.org.uk/discourses/trad_neo/neo_vedanta_swartz.htm James Swartz, What is Neo-Advaita?]\n\nAdvaita took over from the Madhyamika the idea of levels of reality. Usually two levels are being mentioned, but Shankara uses sublation as the criterion to postulate an ontological hierarchy of three levels:[http://www.advaita-vision.org/discrimination/ advaita-vision.org, Discrimination]\n*  (paramartha, absolute), the absolute level, \"which is absolutely real and into which both other reality levels can be resolved\". This experience can't be sublated by any other experience.\n*  (vyavahara), or samvriti-saya (empirical or pragmatical), \"our world of experience, the phenomenal world that we handle every day when we are awake\". It is the level in which both jiva (living creatures or individual souls) and Iswara are true; here, the material world is also true.\n*  (pratibhasika, apparent reality, unreality), \"reality based on imagination alone\". It is the level in which appearances are actually false, like the illusion of a snake over a rope, or a dream.\n\nVaishnava\n\nAll Vaishnava schools are panentheistic and view the universe as part of Krishna or Narayana, but see a plurality of souls and substances within Brahman. Monistic theism, which includes the concept of a personal god as a universal, omnipotent Supreme Being who is both immanent and transcendent, is prevalent within many other schools of Hinduism as well.\n\nTantra\n\nTantra sees the Divine as both immanent and transcendent. The Divine can be found in the concrete world. Practices are aimed at transforming the passions, instead of transcending them.\n\nModern Hinduism\n\nThe colonisation of India by the British had a major impact on Hindu society. In response, leading Hindu intellectuals started to study western culture and philosophy, integrating several western notions into Hinduism. This modernised Hinduism, at its turn, has gained popularity in the west.\n\nA major role was played in the 19th century by Swami Vivekananda in the revival of Hinduism, and the spread of Advaita Vedanta to the west via the Ramakrishna Mission. His interpretation of Advaita Vedanta has been called Neo-Vedanta. In Advaita, Shankara suggests meditation and Nirvikalpa Samadhi are means to gain knowledge of the already existing unity of Brahman and Atman, not the highest goal itself:\n\nVivekananda, according to Gavin Flood, was \"a figure of great importance in the development of a modern Hindu self-understanding and in formulating the West's view of Hinduism.\" Central to his philosophy is the idea that the divine exists in all beings, that all human beings can achieve union with this \"innate divinity\", and that seeing this divine as the essence of others will further love and social harmony. According to Vivekananda, there is an essential unity to Hinduism, which underlies the diversity of its many forms. According to Flood, Vivekananda's view of Hinduism is the most common among Hindus today. This monism, according to Flood, is at the foundation of earlier Upanishads, to theosophy in the later Vedanta tradition and in modern Neo-Hinduism.\n\nBuddhism\n\nAccording to the Pāli Canon, both pluralism (nānatta) and monism (ēkatta) are speculative views. A Theravada commentary notes that the former is similar to or associated with nihilism (ucchēdavāda), and the latter is similar to or associated with eternalism (sassatavada).David Kalupahana, Causality: The Central Philosophy of Buddhism. The University Press of Hawaii, 1975, page 88. The passage is SN 2.77. See middle way.\n\nIn the Madhyamaka school of Mahayana Buddhism, the ultimate nature of the world is described as Śūnyatā or \"emptiness\", which is inseparable from sensorial objects or anything else. That appears to be a monist position, but the Madhyamaka views - including variations like rangtong and shentong - will refrain from asserting any ultimately existent entity. They instead deconstruct any detailed or conceptual assertions about ultimate existence as resulting in absurd consequences. The Yogacara view, a minority school now only found among the Mahayana, also rejects monism.\n\nLevels of truth\n\nWithin Buddhism, a rich variety of philosophical and pedagogical models can be found. Various schools of Buddhism discern levels of truth:\n* The Two truths doctrine of the Madhyamaka\n* The Three Natures of the Yogacara\n* Essence-Function, or Absolute-relative in Chinese and Korean Buddhism\n* The Trikaya-formule, consisting of \n** The Dharmakāya or Truth body which embodies the very principle of enlightenment and knows no limits or boundaries;\n** The Sambhogakāya or body of mutual enjoyment which is a body of bliss or clear light manifestation;\n** The Nirmāṇakāya or created body which manifests in time and space.Welwood, John (2000). [http://www.purifymind.com/PlayMind.htm The Play of the Mind: Form, Emptiness, and Beyond], accessed January 13, 2007\n\nThe Prajnaparamita-sutras and Madhyamaka emphasize the non-duality of form and emptiness: \"form is emptiness, emptiness is form\", as the heart sutra says. In Chinese Buddhism this was understood to mean that ultimate reality is not a transcendental realm, but equal to the daily world of relative reality. This idea fitted into the Chinese culture, which emphasized the mundane world and society. But this does not tell how the absolute is present in the relative world:\n\nThis question is answered in such schemata as the Five Ranks of Tozan, the Oxherding Pictures, and Hakuin's Four ways of knowing.\n\nSikhism \n\nSikhism complies with the concept of Priority Monism. Sikh philosophy advocates the belief that all what our senses comprehend is illusion; God is the sole reality. Forms being subject to Time, shall pass away. God's Reality alone is eternal and abiding. The thought is such that Atma(soul) is born from, and a reflection of ParamAtma(Supreme Soul), and \"would again merge into it\", in the words of the Tenth guru of Sikhs, Guru Gobind Singh, \"just as water merges back into the water.\"\n\nGod and Soul are fundamentally same; identical in the same way as Fire and its sparks. \"Atam meh Ram, Ram meh Atam\" which means \"The Ultimate Eternal reality resides in the Soul and the Soul is contained in Him\". As from one stream, millions of waves arise and yet the waves, made of water, again become water; in the same way all souls have sprung from the Universal Being and would blend again into it.\n\nAbrahamic faiths\n\nJudaism\n\nJewish thought considers God as separate from all physical, created things (transcendent) and as existing outside of time (eternal).\n\nAccording to Chasidic Thought (particularly as propounded by the 18th century, early 19th century founder of Chabad, Shneur Zalman of Liadi), God is held to be immanent within creation for two interrelated reasons:\n# A very strong Jewish belief is that \"[t]he Divine life-force which brings [the universe] into existence must constantly be present ... were this life-force to forsake [the universe] for even one brief moment, it would revert to a state of utter nothingness, as before the creation ...\"http://www.chabad.org/library/archive/LibraryArchive2.asp?AID=7988\n# Simultaneously, Judaism holds as axiomatic that God is an absolute unity, and that he is Perfectly Simple—thus, if his sustaining power is within nature, then his essence is also within nature.\n\nThe Vilna Gaon was very much against this philosophy, for he felt that it would lead to pantheism and heresy. According to some this is the main reason for the Gaon's ban on Chasidism.\n\nAccording to Maimonides,See Foundations of the Law, Chapter 1 God is an incorporeal being that caused all other existence.  In fact, God is defined as the necessary existent that caused all other existence. According to Maimonides, to admit corporeality to God is tantamount to admitting complexity to God, which is a contradiction to God as the First Cause and constitutes heresy.  While Hasidic mystics considered the existence of the physical world a contradiction to God's simpleness, Maimonides saw no contradiction.\n\nChristianity\n\nCreator–creature distinction\n\nChristianity strongly maintains the creator–creature distinction as fundamental. Christians maintain that God created the universe ex nihilo and not from his own substance, so that the creator is not to be confused with creation, but rather transcends it (metaphysical dualism) (cf. Genesis). Although, there is growing movement to have a \"Christian Panentheism\". Even more immanent concepts and theologies are to be defined together with God's omnipotence, omnipresence and omniscience, due to God's desire for intimate contact with his own creation (cf. Acts 17:27). Another use of the term \"monism\" is in Christian anthropology to refer to the innate nature of humankind as being holistic, as usually opposed to bipartite and tripartite views.\n\nRejection of radical dualism\n\nIn On Free Choice of the Will, Augustine argued, in the context of the problem of evil, that evil is not the opposite of good, but rather merely the absence of good, something that does not have existence in itself. Likewise, C. S. Lewis described evil as a \"parasite\" in Mere Christianity, as he viewed evil as something that cannot exist without good to provide it with existence. Lewis went on to argue against dualism from the basis of moral absolutism, and rejected the dualistic notion that God and Satan are  opposites, arguing instead that God has no equal, hence no opposite. Lewis rather viewed Satan as the opposite of Michael the archangel. Due to this, Lewis instead argued for a more limited type of dualism.Lewis, C.S, \"God and Evil\" in \"God in the Dock: Essays in Theology and Ethics\", ed. W. Hooper (Grand Rapids, Mich, Eerdsmans, 1970), p. 21-24 Other theologians, such as Greg Boyd, have argued in more depth that the Biblical authors held a \"limited dualism\", meaning that God and Satan do engage in real battle, but only due to free will given by God, for the duration God allows.Boyd, Gregory. A, \"God at War\" (Downers Grove, IL, InterVarsity Press, 1971) p. 185\n\nIsaiah 45:5-7\n5 I am the Lord, and there is none else, there is no God beside me: I girded thee, though thou hast not known me:\n6 That they may know from the rising of the sun, and from the west, that there is none beside me. I am the Lord, and there is none else.\n7 I form the light, and create darkness: I make peace, and create evil: I the Lord do all these things.\n\nTheosis\n\nIn Roman Catholicism and Eastern Orthodoxy, while human beings are not ontologically identical with the Creator, they are nonetheless capable with uniting with his Divine Nature via theosis, and especially, through the devout reception of the Holy Eucharist. This is a supernatural union, over and above that natural union, of which St. John of the Cross says, \"it must be known that God dwells and is present substantially in every soul, even in that of the greatest sinner in the world, and this union is natural.\" Julian of Norwich, while maintaining the orthodox duality of Creator and creature, nonetheless speaks of God as \"the true Father and true Mother\" of all natures; thus, he indwells them substantially and thus preserves them from annihilation, as without this sustaining indwelling everything would cease to exist.\n\nChristian Monism\n\nSome Christian theologians are avowed monists, such as Paul Tillich. Since God is he \"in whom we live and move and have our being\" (Book of Acts 17.28), it follows that everything that has being partakes in God.\n\nIslam\n\nQuran\n\nAlthough Vincent J. Cornell argue that the Quran also provides a monist image of God by describing the reality as a unified whole, with God being a single concept that would describe or ascribe all existing things. But most argue that Semitic religious scriptures especially Quran see Creation and God as two separate existence. It explains everything been created by God and under his control, but at the same time distinguishes God and creation as having independent existence from each other.\n\nSufism\n\nSufi mystics advocate monism. One of the most notable being the 13th-century Persian poet Rumi (1207–73) in his didactic poem Masnavi espoused monism.[http://www.globalwebpost.com/farooqm/study_res/rumi/intro_nicholson.html Reynold Nicholson Rumi] [http://www.rumi.org.uk/sufism/persian_sufism.htm Cyprian Rice (1964) The Persian Sufism George Allen, London] Rumi says in the Masnavi,\n\nThe most influential of the Islamic monists was the Sufi philosopher Ibn Arabi (1165–1240). He developed the concept of 'unity of being' (Arabic: waḥdat al-wujūd), a pantheistic monoist philosophy. Born in al-Andalus, he made an enormous impact on the Muslim world, where he was crowned \"the great Master\". In the centuries following his death, his ideas became increasingly controversial.\n\nBahá'í\n\nAlthough the Bahá'í teachings have a strong emphasis on social and ethical issues, there exist a number of foundational texts that have been described as mystical. Some of these include statements of a monist nature (e.g., The Seven Valleys and the Hidden Words). The differences between dualist and monist views are reconciled by the teaching that these opposing viewpoints are caused by differences in the observers themselves, not in that which is observed. This is not a 'higher truth/lower truth' position. God is unknowable. For man it is impossible to acquire any direct knowledge of God or the Absolute, because any knowledge that one has, is relative.\n\nNon-dualism\n\nAccording to nondualism, many forms of religion are based on an experiential or intuitive understanding of \"the Real\". Nondualism, a modern reinterpretation of these religions, prefers the term \"nondualism\", instead of monism, because this understanding is \"nonconceptual\", \"not graspable in an idea\".\n\nTo these nondual traditions belong Hinduism (including Vedanta, some forms of Yoga, and certain schools of Shaivism), Taoism, Pantheism, Rastafari and similar systems of thought.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Monism" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19325" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Monism is the view that attributes oneness or singleness (Greek: μόνος) to a concept (e.g., existence). Various kinds of monism can be distinguished:\n* Priority monism states that all existing things go back to a source that is distinct from them (e.g., in Neoplatonism everything is derived from The One). In this view only one thing is ontologically basic or prior to everything else.\n* Existence monism posits that, strictly speaking, there exists only a single thing (e.g., the universe), which can only be artificially and arbitrarily divided into many things.Strawson, G. (2014 in press): \"Nietzsche's metaphysics?\". In: Dries, M. & Kail, P. (eds): \"Nietzsche on Mind and Nature\". Oxford University Press. [http://s3.amazonaws.com/academia.edu.documents/30981598/Nietzsches_Metaphysics_June_2012_Strawson_draft_-libre.pdf?AWSAccessKeyIdAKIAJ56TQJRTWSMTNPEA&Expires\n1396293668&Signature=Bji6%2FSyzFKV1jkuZRJfnLSB0Qko%3D PDF of draft] \n* Substance monism (\"stuff monism\") asserts that a variety of existing things can be explained in terms of a single reality or substance. Substance monism posits that only one kind of stuff (e.g., matter or mind) exists, although many things may be made out of this stuff.\n\nDefinitions\n\nThere are two sorts of definitions for monism:\n# The wide definition: a philosophy is monistic if it postulates unity of origin of all things; all existing things return to a source that is distinct from them.\n# The restricted definition: this requires not only unity of origin but also unity of substance and essence.\n\nAlthough the term \"monism\" is derived from Western philosophy to typify positions in the mind–body problem, it has also been used to typify religious traditions. In modern Hinduism, the term \"absolute monism\" is being used for Advaita Vedanta.\n\nHistory\n\nThe term \"monism\" was introduced in the 18th century by Christian von Wolff in his work Logic (1728),[http://science.jrank.org/pages/7886/Monism.html jrank.org, Monism] to designate types of philosophical thought in which the attempt was made to eliminate the dichotomy of body and mind and explain all phenomena by one unifying principle, or as manifestations of a single substance.[http://www.encyclopedia.com/topic/monism.aspx#4 \"monism\"], Columbia Electronic Encyclopedia, 6th Edition. Retrieved 29 October 2014.\n\nThe mind–body problem in philosophy examines the relationship between mind and matter, and in particular the relationship between consciousness and the brain. The problem was addressed by René Descartes in the 17th century, resulting in Cartesian dualism, and by pre-Aristotelian philosophers, in Avicennian philosophy, and in earlier Asian and more specifically Indian traditions.\n\nIt was later also applied to the theory of absolute identity set forth by Hegel and Schelling. Thereafter the term was more broadly used, for any theory postulating a unifying principle. The opponent thesis of dualism also was broadened, to include pluralism. According to Urmson, as a result of this extended use, the term is \"systematically ambiguous\".\n\nAccording to Jonathan Schaffer, monism lost popularity due to the emergence of Analytic philosophy in the early twentieth century, which revolted against the neo-Hegelians. Carnap and Ayer, who were strong proponents of positivism, \"ridiculed the whole question as incoherent mysticism\".\n\nThe mind–body problem has reemerged in social psychology and related fields, with the interest in mind–body interaction and the rejection of Cartesian mind–body dualism in the identity thesis, a modern form of monism. Monism is also still relevant to the philosophy of mind, where various positions are defended.\n\nPhilosophy\n\nTypes\n\nDifferent types of monism include:Schaffer, Jonathan, Monism: The Priority of the Whole, http://www.jonathanschaffer.org/monism.pdf\n# Substance monism, \"the view that the apparent plurality of substances is due to different states or appearances of a single substance\"\n# Attributive monism, \"the view that whatever the number of substances, they are of a single ultimate kind\"\n# Partial monism, \"within a given realm of being (however many there may be) there is only one substance\"\n# Existence monism, \"the view that there is only one concrete object token (The One, \"Τὸ Ἕν\" or the Monad)\"Schaffer, Jonathan, \"Monism\", The Stanford Encyclopedia of Philosophy (Summer 2015 Edition), Edward N. Zalta (ed.), URL=http://plato.stanford.edu/archives/sum2015/entries/monism/\n# Priority monism, \"the whole is prior to its parts\" or \"the world has parts, but the parts are dependent fragments of an integrated whole\"\n# Property monism, \"the view that all properties are of a single type (e.g., only physical properties exist)\" \n# Genus monism, \"the doctrine that there is a highest category; e.g., being\"\n\nViews contrasting with monism are:\n* Metaphysical dualism, which asserts that there are two ultimately irreconcilable substances or realities such as Good and Evil, for example, Manichaeism, \n* Metaphysical pluralism, which asserts three or more fundamental substances or realities.\n* Metaphysical nihilism, negates any of the above categories (substances, properties, concrete objects, etc.).\n\nMonism in modern philosophy of mind can be divided into three broad categories:\n# Idealist, mentalistic monism, which holds that only mind or spirit exists. \n# Neutral monism, which holds that one sort of thing fundamentally exists, to which both the mental and the physical can be reduced[http://www.philosophybasics.com/branch_monism.html Luke Mastin (2008), \"Monism\"]\n# Material monism (also called Physicalism and materialism), which holds that the material world is primary, and consciousness arises through the interaction with the material world\n:a. Eliminative Materialism, according to which everything is physical and mental things do not exist\n:b. Reductive physicalism, according to which mental things do exist and are a kind of physical thing\n\nCertain positions do not fit easily into the above categories, such as functionalism, anomalous monism, and reflexive monism. Moreover, they do not define the meaning of \"real\".\n\nMonistic philosophers\n\nPre-Socratic\n\nWhile the lack of information makes it difficult in some cases to be sure of the details, the following pre-Socratic philosophers thought in monistic terms:\n* Thales: Water.\n* Anaximander: Apeiron (meaning 'the undefined infinite'). Reality is some, one thing, but we cannot know what.\n* Anaximenes: Air.\n* Heraclitus: Change, symbolized by fire (in that everything is in constant flux).\n* Parmenides argued that Being or Reality is an unmoving perfect sphere, unchanging, undivided.\n\nPost-Socrates\n\n* Neopythagorians such as Apollonius of Tyana centered their cosmologies on the Monad or One.\n* Stoics taught that there is only one substance, identified as God.\n* Middle Platonism under such works as those by Numenius taught that the Universe emanates from the Monad or One.\n* Neoplatonism is monistic. Plotinus taught that there was an ineffable transcendent god, 'The One,' of which subsequent realities were emanations. From The One emanates the Divine Mind (Nous), the Cosmic Soul (Psyche), and the World (Cosmos).\n\nModern\n\n* Giordano BrunoDe la causa, principio e Uno, London, 1584De monade (De monade, numero et figura liber consequens quinque de minimo magno et mensura), Frankfurt, 1591\n* Baruch de Spinoza\n* Gottfried Wilhelm Leibniz\n* Alexander Bogdanov\n* Georg Wilhelm Friedrich Hegel\n* F. H. Bradley\n* Arthur Schopenhauer\n* Ernst Haeckel[https://books.google.com/books?idpFJvtfRaM48C Wonders of Life] by Ernst Haeckel.[https://books.google.com/books?id\nRdsdAAAAMAAJ The Evolution of Man: A Popular Scientific Study, Volume 2] by Ernst Heinrich Philipp August Haeckel.\n* Jonathan Schaffer\n* Georgi Plekhanov\n* Friedrich Engels\n* Karl Marx\n\nReligion\n\nPantheism\n\nPantheism is the belief that everything composes an all-encompassing, immanent God, or that the universe (or nature) is identical with divinity. Pantheists thus do not believe in a personal or anthropomorphic god, but believe that interpretations of the term differ.\n\nPantheism was popularized in the modern era as both a theology and philosophy based on the work of the 17th century philosopher Baruch Spinoza, whose Ethics was an answer to Descartes' famous dualist theory that the body and spirit are separate. Spinoza held that the two are the same, and this monism is a fundamental quality of his philosophy. He was described as a \"God-intoxicated man,\" and used the word God to describe the unity of all substance. Although the term pantheism was not coined until after his death, Spinoza is regarded as its most celebrated advocate.\n\nH. P. Owen claimed that\n\nPantheism is closely related to monism, as pantheists too believe all of reality is one substance, called Universe, God or Nature. Panentheism, a slightly different concept (explained below), however is dualistic.Crosby, Donald A. (2008). Living with Ambiguity: Religious Naturalism and the Menace of Evil. New York: State University of New York Press. pp. 124. . Some of the most famous pantheists are the Stoics, Giordano Bruno and Spinoza.\n\nPanentheism\n\nPanentheism (from Greek  (pân) \"all\";  (en) \"in\"; and  (theós) \"God\"; \"all-in-God\") is a belief system that posits that the divine (be it a monotheistic God, polytheistic gods, or an eternal cosmic animating force) interpenetrates every part of nature, but is not one with nature. Panentheism differentiates itself from pantheism, which holds that the divine is synonymous with the universe.\n\nIn panentheism, there are two types of substance, \"pan\" the universe and God. The universe and the divine are not ontologically equivalent. God is viewed as the eternal animating force within the universe. In some forms of panentheism, the cosmos exists within God, who in turn \"transcends\", \"pervades\" or is \"in\" the cosmos.\n\nWhile pantheism asserts that 'All is God', panentheism claims that God animates all of the universe, and also transcends the universe. In addition, some forms indicate that the universe is contained within God,  like in the concept of Tzimtzum. Much Hindu thought is highly characterized by panentheism and pantheism.[http://www.britannica.com/EBchecked/topic/441533/pantheism/38168/Pantheism-and-panentheism-in-non-Western-cultures] Britannica - Pantheism and Panentheism in non-Western culturesWhiting, Robert. [https://books.google.com/books?id\n_UfRgCZThWYC&pgPR8&dq\nshakti+panentheism&hlen&sa\nX&eijz7nT6-kF8P3rQejn_GDCQ&ved\n0CDQQ6AEwADgK#vonepage&q\nshakti%20panentheism&f=false Religions for Today] Stanley Thomes (Publishers) Ltd. P. VIII. . Hasidic Judaism merges the elite ideal of nullification to paradoxical transcendent Divine Panentheism, through intellectual articulation of inner dimensions of Kabbalah, with the populist emphasis on the panentheistic Divine immanence in everything and deeds of kindness.\n\nPaul Tillich has argued for such a concept within Christian theology, as has liberal biblical scholar Marcus Borg and mystical theologian Matthew Fox, an Episcopal priest.\n\nPandeism\n\nPandeism or pan-deism (from  and  meaning \"god\" in the sense of deism), is a term describing beliefs coherently incorporating or mixing logically reconcilable elements of pantheism (that \"God\", or a metaphysically equivalent creator deity, is identical to Nature) and classical deism (that the creator-god who designed the universe no longer exists in a status where it can be reached, and can instead be confirmed only by reason). It is therefore most particularly the belief that the creator of the universe actually became the universe, and so ceased to exist as a separate entity.Alex Ashman, BBC News, \"[http://www.bbc.co.uk/dna/h2g2/A25172309 Metaphysical Isms]\".\n\nThrough this synergy pandeism claims to answer primary objections to deism (why would God create and then not interact with the universe?) and to pantheism (how did the universe originate and what is its purpose?).\n\nAsian traditions\n\nCharacteristics\n\nThe central problem in Asian (religious) philosophy is not the body-mind problem, but the search for an unchanging Real or Absolute beyond the world of appearances and changing phenomena, and the search for liberation from dukkha and the liberation from the cycle of rebirth. In Hinduism, substance-ontology prevails, seeing Brahman as the unchanging real beyond the world of appearances. In Buddhism process ontology is prevalent, seeing reality as empty of an unchanging essence.\n\nCharacteristic for various Asian religions is the discernment of levels of truth, an emphasis on intuitive-experiential understanding of the Absolute such as jnana, bodhi  and kensho, and an emphasis on the integration of these levels of truth and its understanding.\n\nHinduism\n\nVedanta\n\nVedanta is the inquiry into and systematisation of the Vedas and Upanishads, to harmonise the various and contrasting ideas that can be found in those texts. Within Vedanta, different schools exist:Wilhelm Halbfass (1995), Philology and Confrontation: Paul Hacker on Traditional and Modern Vedanta, State University of New York Press, , pages 137-143 \n* Advaita Vedanta, absolute monism, of which Adi Shankara is the best-known representative;\n* Vishishtadvaita, qualified monism, is from the school of Ramanuja;Jeaneane Fowler (2012), The Bhagavad Gita: A Text and Commentary for Students, Sussex Academic Press, , page xxviii\n* Shuddhadvaita, in-essence monism, is the school of Vallabha; \n* Dvaitadvaita, differential monism, is a school founded by Nimbarka; \n* Dvaita, dualism, is a school founded by Madhvacharya is probably the only Vedantic System that is opposed to all types of monism. It believes that God is eternally different from souls and matter in both form and essence.\n\nAdvaita Vedanta\n\nMonism is most clearly identified in Advaita Vedanta, though Renard points out that this may be a western interpretation, bypassing the intuitive understanding of a nondual reality.\n\nIn Advaita Vedanta, Brahman is the eternal, unchanging, infinite, immanent, and transcendent reality which is the Divine Ground of all matter, energy, time, space, being, and everything beyond in this Universe. The nature of Brahman is described as transpersonal, personal and impersonal by different philosophical schools.Brodd, Jefferey (2003). World Religions. Winona, MN: Saint Mary's Press. .\n\nAdvaita Vedanta gives an elaborate path to attain moksha. It entails more than self-inquiry or bare insight into one's real nature. Practice, especially Jnana Yoga, is needed to \"destroy one’s tendencies (vAasanA-s)\" before real insight can be attained.[http://www.advaita.org.uk/discourses/trad_neo/neo_vedanta_swartz.htm James Swartz, What is Neo-Advaita?]\n\nAdvaita took over from the Madhyamika the idea of levels of reality. Usually two levels are being mentioned, but Shankara uses sublation as the criterion to postulate an ontological hierarchy of three levels:[http://www.advaita-vision.org/discrimination/ advaita-vision.org, Discrimination]\n*  (paramartha, absolute), the absolute level, \"which is absolutely real and into which both other reality levels can be resolved\". This experience can't be sublated by any other experience.\n*  (vyavahara), or samvriti-saya (empirical or pragmatical), \"our world of experience, the phenomenal world that we handle every day when we are awake\". It is the level in which both jiva (living creatures or individual souls) and Iswara are true; here, the material world is also true.\n*  (pratibhasika, apparent reality, unreality), \"reality based on imagination alone\". It is the level in which appearances are actually false, like the illusion of a snake over a rope, or a dream.\n\nVaishnava\n\nAll Vaishnava schools are panentheistic and view the universe as part of Krishna or Narayana, but see a plurality of souls and substances within Brahman. Monistic theism, which includes the concept of a personal god as a universal, omnipotent Supreme Being who is both immanent and transcendent, is prevalent within many other schools of Hinduism as well.\n\nTantra\n\nTantra sees the Divine as both immanent and transcendent. The Divine can be found in the concrete world. Practices are aimed at transforming the passions, instead of transcending them.\n\nModern Hinduism\n\nThe colonisation of India by the British had a major impact on Hindu society. In response, leading Hindu intellectuals started to study western culture and philosophy, integrating several western notions into Hinduism. This modernised Hinduism, at its turn, has gained popularity in the west.\n\nA major role was played in the 19th century by Swami Vivekananda in the revival of Hinduism, and the spread of Advaita Vedanta to the west via the Ramakrishna Mission. His interpretation of Advaita Vedanta has been called Neo-Vedanta. In Advaita, Shankara suggests meditation and Nirvikalpa Samadhi are means to gain knowledge of the already existing unity of Brahman and Atman, not the highest goal itself:\n\nVivekananda, according to Gavin Flood, was \"a figure of great importance in the development of a modern Hindu self-understanding and in formulating the West's view of Hinduism.\" Central to his philosophy is the idea that the divine exists in all beings, that all human beings can achieve union with this \"innate divinity\", and that seeing this divine as the essence of others will further love and social harmony. According to Vivekananda, there is an essential unity to Hinduism, which underlies the diversity of its many forms. According to Flood, Vivekananda's view of Hinduism is the most common among Hindus today. This monism, according to Flood, is at the foundation of earlier Upanishads, to theosophy in the later Vedanta tradition and in modern Neo-Hinduism.\n\nBuddhism\n\nAccording to the Pāli Canon, both pluralism (nānatta) and monism (ēkatta) are speculative views. A Theravada commentary notes that the former is similar to or associated with nihilism (ucchēdavāda), and the latter is similar to or associated with eternalism (sassatavada).David Kalupahana, Causality: The Central Philosophy of Buddhism. The University Press of Hawaii, 1975, page 88. The passage is SN 2.77. See middle way.\n\nIn the Madhyamaka school of Mahayana Buddhism, the ultimate nature of the world is described as Śūnyatā or \"emptiness\", which is inseparable from sensorial objects or anything else. That appears to be a monist position, but the Madhyamaka views - including variations like rangtong and shentong - will refrain from asserting any ultimately existent entity. They instead deconstruct any detailed or conceptual assertions about ultimate existence as resulting in absurd consequences. The Yogacara view, a minority school now only found among the Mahayana, also rejects monism.\n\nLevels of truth\n\nWithin Buddhism, a rich variety of philosophical and pedagogical models can be found. Various schools of Buddhism discern levels of truth:\n* The Two truths doctrine of the Madhyamaka\n* The Three Natures of the Yogacara\n* Essence-Function, or Absolute-relative in Chinese and Korean Buddhism\n* The Trikaya-formule, consisting of \n** The Dharmakāya or Truth body which embodies the very principle of enlightenment and knows no limits or boundaries;\n** The Sambhogakāya or body of mutual enjoyment which is a body of bliss or clear light manifestation;\n** The Nirmāṇakāya or created body which manifests in time and space.Welwood, John (2000). [http://www.purifymind.com/PlayMind.htm The Play of the Mind: Form, Emptiness, and Beyond], accessed January 13, 2007\n\nThe Prajnaparamita-sutras and Madhyamaka emphasize the non-duality of form and emptiness: \"form is emptiness, emptiness is form\", as the heart sutra says. In Chinese Buddhism this was understood to mean that ultimate reality is not a transcendental realm, but equal to the daily world of relative reality. This idea fitted into the Chinese culture, which emphasized the mundane world and society. But this does not tell how the absolute is present in the relative world:\n\nThis question is answered in such schemata as the Five Ranks of Tozan, the Oxherding Pictures, and Hakuin's Four ways of knowing.\n\nSikhism \n\nSikhism complies with the concept of Priority Monism. Sikh philosophy advocates the belief that all what our senses comprehend is illusion; God is the sole reality. Forms being subject to Time, shall pass away. God's Reality alone is eternal and abiding. The thought is such that Atma(soul) is born from, and a reflection of ParamAtma(Supreme Soul), and \"would again merge into it\", in the words of the Tenth guru of Sikhs, Guru Gobind Singh, \"just as water merges back into the water.\"\n\nGod and Soul are fundamentally same; identical in the same way as Fire and its sparks. \"Atam meh Ram, Ram meh Atam\" which means \"The Ultimate Eternal reality resides in the Soul and the Soul is contained in Him\". As from one stream, millions of waves arise and yet the waves, made of water, again become water; in the same way all souls have sprung from the Universal Being and would blend again into it.\n\nAbrahamic faiths\n\nJudaism\n\nJewish thought considers God as separate from all physical, created things (transcendent) and as existing outside of time (eternal).\n\nAccording to Chasidic Thought (particularly as propounded by the 18th century, early 19th century founder of Chabad, Shneur Zalman of Liadi), God is held to be immanent within creation for two interrelated reasons:\n# A very strong Jewish belief is that \"[t]he Divine life-force which brings [the universe] into existence must constantly be present ... were this life-force to forsake [the universe] for even one brief moment, it would revert to a state of utter nothingness, as before the creation ...\"http://www.chabad.org/library/archive/LibraryArchive2.asp?AID=7988\n# Simultaneously, Judaism holds as axiomatic that God is an absolute unity, and that he is Perfectly Simple—thus, if his sustaining power is within nature, then his essence is also within nature.\n\nThe Vilna Gaon was very much against this philosophy, for he felt that it would lead to pantheism and heresy. According to some this is the main reason for the Gaon's ban on Chasidism.\n\nAccording to Maimonides,See Foundations of the Law, Chapter 1 God is an incorporeal being that caused all other existence.  In fact, God is defined as the necessary existent that caused all other existence. According to Maimonides, to admit corporeality to God is tantamount to admitting complexity to God, which is a contradiction to God as the First Cause and constitutes heresy.  While Hasidic mystics considered the existence of the physical world a contradiction to God's simpleness, Maimonides saw no contradiction.\n\nChristianity\n\nCreator–creature distinction\n\nChristianity strongly maintains the creator–creature distinction as fundamental. Christians maintain that God created the universe ex nihilo and not from his own substance, so that the creator is not to be confused with creation, but rather transcends it (metaphysical dualism) (cf. Genesis). Although, there is growing movement to have a \"Christian Panentheism\". Even more immanent concepts and theologies are to be defined together with God's omnipotence, omnipresence and omniscience, due to God's desire for intimate contact with his own creation (cf. Acts 17:27). Another use of the term \"monism\" is in Christian anthropology to refer to the innate nature of humankind as being holistic, as usually opposed to bipartite and tripartite views.\n\nRejection of radical dualism\n\nIn On Free Choice of the Will, Augustine argued, in the context of the problem of evil, that evil is not the opposite of good, but rather merely the absence of good, something that does not have existence in itself. Likewise, C. S. Lewis described evil as a \"parasite\" in Mere Christianity, as he viewed evil as something that cannot exist without good to provide it with existence. Lewis went on to argue against dualism from the basis of moral absolutism, and rejected the dualistic notion that God and Satan are  opposites, arguing instead that God has no equal, hence no opposite. Lewis rather viewed Satan as the opposite of Michael the archangel. Due to this, Lewis instead argued for a more limited type of dualism.Lewis, C.S, \"God and Evil\" in \"God in the Dock: Essays in Theology and Ethics\", ed. W. Hooper (Grand Rapids, Mich, Eerdsmans, 1970), p. 21-24 Other theologians, such as Greg Boyd, have argued in more depth that the Biblical authors held a \"limited dualism\", meaning that God and Satan do engage in real battle, but only due to free will given by God, for the duration God allows.Boyd, Gregory. A, \"God at War\" (Downers Grove, IL, InterVarsity Press, 1971) p. 185\n\nIsaiah 45:5-7\n5 I am the Lord, and there is none else, there is no God beside me: I girded thee, though thou hast not known me:\n6 That they may know from the rising of the sun, and from the west, that there is none beside me. I am the Lord, and there is none else.\n7 I form the light, and create darkness: I make peace, and create evil: I the Lord do all these things.\n\nTheosis\n\nIn Roman Catholicism and Eastern Orthodoxy, while human beings are not ontologically identical with the Creator, they are nonetheless capable with uniting with his Divine Nature via theosis, and especially, through the devout reception of the Holy Eucharist. This is a supernatural union, over and above that natural union, of which St. John of the Cross says, \"it must be known that God dwells and is present substantially in every soul, even in that of the greatest sinner in the world, and this union is natural.\" Julian of Norwich, while maintaining the orthodox duality of Creator and creature, nonetheless speaks of God as \"the true Father and true Mother\" of all natures; thus, he indwells them substantially and thus preserves them from annihilation, as without this sustaining indwelling everything would cease to exist.\n\nChristian Monism\n\nSome Christian theologians are avowed monists, such as Paul Tillich. Since God is he \"in whom we live and move and have our being\" (Book of Acts 17.28), it follows that everything that has being partakes in God.\n\nIslam\n\nQuran\n\nAlthough Vincent J. Cornell argue that the Quran also provides a monist image of God by describing the reality as a unified whole, with God being a single concept that would describe or ascribe all existing things. But most argue that Semitic religious scriptures especially Quran see Creation and God as two separate existence. It explains everything been created by God and under his control, but at the same time distinguishes God and creation as having independent existence from each other.\n\nSufism\n\nSufi mystics advocate monism. One of the most notable being the 13th-century Persian poet Rumi (1207–73) in his didactic poem Masnavi espoused monism.[http://www.globalwebpost.com/farooqm/study_res/rumi/intro_nicholson.html Reynold Nicholson Rumi] [http://www.rumi.org.uk/sufism/persian_sufism.htm Cyprian Rice (1964) The Persian Sufism George Allen, London] Rumi says in the Masnavi,\n\nThe most influential of the Islamic monists was the Sufi philosopher Ibn Arabi (1165–1240). He developed the concept of 'unity of being' (Arabic: waḥdat al-wujūd), a pantheistic monoist philosophy. Born in al-Andalus, he made an enormous impact on the Muslim world, where he was crowned \"the great Master\". In the centuries following his death, his ideas became increasingly controversial.\n\nBahá'í\n\nAlthough the Bahá'í teachings have a strong emphasis on social and ethical issues, there exist a number of foundational texts that have been described as mystical. Some of these include statements of a monist nature (e.g., The Seven Valleys and the Hidden Words). The differences between dualist and monist views are reconciled by the teaching that these opposing viewpoints are caused by differences in the observers themselves, not in that which is observed. This is not a 'higher truth/lower truth' position. God is unknowable. For man it is impossible to acquire any direct knowledge of God or the Absolute, because any knowledge that one has, is relative.\n\nNon-dualism\n\nAccording to nondualism, many forms of religion are based on an experiential or intuitive understanding of \"the Real\". Nondualism, a modern reinterpretation of these religions, prefers the term \"nondualism\", instead of monism, because this understanding is \"nonconceptual\", \"not graspable in an idea\".\n\nTo these nondual traditions belong Hinduism (including Vedanta, some forms of Yoga, and certain schools of Shaivism), Taoism, Pantheism, Rastafari and similar systems of thought. Monism. http://en.wikipedia.org/?curid=19325."
  }
}
