{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3049",
  "eid" : "c3d782d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778408317,
  "textBody" : "Autumn, also known as fall in American and Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer to winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools down considerably. One of its main features is the shedding of leaves from deciduous trees.\n\nSome cultures regard the autumnal equinox as \"mid-autumn\", while others with a longer temperature lag treat it as the start of autumn. Meteorologists (and most of the temperate countries in the southern hemisphere) use a definition based on Gregorian calendar months, with autumn being September, October, and November in the northern hemisphere, and March, April, and May in the southern hemisphere.\n\nIn North America, autumn is usually considered to start with the September equinox (21 to 24 September) and end with the winter solstice (21 or 22 December).http://www.almanac.com/content/first-day-winter-winter-solstice Popular culture in North America associates Labor Day, the first Monday in September, as the end of summer and the start of autumn; certain summer traditions, such as wearing white, are discouraged after that date. As daytime and nighttime temperatures decrease, trees shed their leaves. In traditional East Asian solar term, autumn starts on or around 8 August and ends on or about 7 November. In Ireland, the autumn months according to the national meteorological service, Met Éireann, are September, October and November. However, according to the Irish Calendar, which is based on ancient Gaelic traditions, autumn lasts throughout the months of August, September and October, or possibly a few days later, depending on tradition. In Australia and New Zealand, autumn officially begins on 1 March and ends on 31 May. In these countries, Autumn is associated with events such as Easter and Anzac day.\n\nEtymology\n\nThe word autumn comes from the ancient Etruscan root autu- and has within it connotations of the passing of the year. It was borrowed by the neighbouring Romans, and became the Latin word '.Etymology of 'autumn'  - New Shorter Oxford English Dictionary, 1997 Edition After the Roman era, the word continued to be used as the Old French word ' (' in modern French) or ' in Middle English,Oxford English Dictionary, 2nd Edition, entry at automn. and was later normalised to the original Latin. In the Medieval period, there are rare examples of its use as early as the 12th century, but by the 16th century, it was in common use.\n\nBefore the 16th century, harvest was the term usually used to refer to the season, as it is common in other West Germanic languages to this day (cf. Dutch ', German ' and Scots '). However, as more people gradually moved from working the land to living in towns, the word harvest lost its reference to the time of year and came to refer only to the actual activity of reaping, and autumn, as well as fall, began to replace it as a reference to the season.\n\nThe alternative word fall for the season traces its origins to old Germanic languages. The exact derivation is unclear, with the Old English ' or ' and the Old Norse ' all being possible candidates. However, these words all have the meaning \"to fall from a height\" and are clearly derived either from a common root or from each other. The term came to denote the season in 16th-century England, a contraction of Middle English expressions like \"fall of the leaf\" and \"fall of the year\".\n\nDuring the 17th century, English emigration to the British colonies in North America was at its peak, and the new settlers took the English language with them. While the term fall gradually became obsolete in Britain, it became the more common term in North America.\n\nThe name backend, a once common name for the season in Northern England, has today been largely replaced by the name autumn.\n\nAssociations\n\nHarvest\n\nAssociation with the transition from warm to cold weather, and its related status as the season of the primary harvest, has dominated its themes and popular images. In Western cultures, personifications of autumn are usually pretty, well-fed females adorned with fruits, vegetables and grains that ripen at this time. Many cultures feature autumnal harvest festivals, often the most important on their calendars. Still extant echoes of these celebrations are found in the autumn Thanksgiving holiday of the United States and Canada, and the Jewish Sukkot holiday with its roots as a full-moon harvest festival of \"tabernacles\" (living in outdoor huts around the time of harvest).  There are also the many North American Indian festivals tied to harvest of ripe foods gathered in the wild, the Chinese Mid-Autumn or Moon festival, and many others. The predominant mood of these autumnal celebrations is a gladness for the fruits of the earth mixed with a certain melancholy linked to the imminent arrival of harsh weather.\n\nThis view is presented in English poet John Keats' poem To Autumn, where he describes the season as a time of bounteous fecundity, a time of 'mellow fruitfulness'.\n\nWhile most foods are harvested during the autumn, foods particularly associated with the season include pumpkins (which are integral parts of both Thanksgiving and Halloween) and apples, which are used to make the seasonal beverage apple cider.\n\nMelancholia\n\nAutumn, especially in poetry, has often been associated with melancholia. The possibilities of summer are gone, and the chill of winter is on the horizon. Skies turn grey, the amount of usable daylight drops rapidly, and many people turn inward, both physically and mentally.[http://www.symbolism.org/writing/books/sp/4/page2.html Cyclical Regenerative Time - (c) Autumn] (from 'Symbolism of Place', symbolism.org website) It has been referred to as an unhealthy season.\n\nSimilar examples may be found in Irish poet William Butler Yeats' poem The Wild Swans at Coole where the maturing season that the poet observes symbolically represents his own ageing self. Like the natural world that he observes, he too has reached his prime and now must look forward to the inevitability of old age and death. French poet Paul Verlaine's \"Chanson d'automne\" (\"Autumn Song\") is likewise characterised by strong, painful feelings of sorrow. Keats' To Autumn, written in September 1819, echoes this sense of melancholic reflection, but also emphasises the lush abundance of the season.\n\nHalloween\n\nAutumn is associated with Halloween (influenced by Samhain, a Celtic autumn festival), and with it a widespread marketing campaign that promotes it. Halloween is in autumn in the northern hemisphere. The television, film, book, costume, home decoration, and confectionery industries use this time of year to promote products closely associated with such a holiday, with promotions going from early September to 31 October, since their themes rapidly lose strength once the holiday ends, and advertising starts concentrating on Christmas.\n\nOther associations\n\nAutumn also has a strong association with the end of summer holiday and the start of a new school year, particularly for children in primary and secondary education. \"Back to School\" advertising and preparations usually occurs in the weeks leading to the beginning of autumn.\n\nEaster is in autumn in the southern hemisphere. \n\nThanksgiving Day is a national holiday celebrated in Canada, in the United States, in some of the Caribbean islands and in Liberia. Thanksgiving is celebrated on the second Monday of October in Canada and on the fourth Thursday of November in the United States, and around the same part of the year in other places. Similarly named festival holidays occur in Germany and Japan.\n\nTelevision stations and networks, particularly in North America, traditionally begin their regular seasons in autumn, with new series and new episodes of existing series debuting mostly during late September or early October (series that debut outside the fall season are usually known as mid-season replacements). A sweeps period takes place in November to measure Nielsen Ratings.\n\nAmerican football is played almost exclusively in the autumn months; at the high school level, seasons run through September and October, with some playoff games and holiday rivalry contests being played as late as Thanksgiving. College football's regular season runs from September through November, while the main professional circuit, the National Football League, plays from September through December. Summer sports, such as stock car racing and Major League Baseball, wrap up their seasons in early autumn; MLB's championship World Series is known popularly as the \"Fall Classic\"., et al. (Amateur baseball is usually finished by August.) Likewise, professional winter sports, such as professional ice hockey, basketball and most leagues of soccer football in Europe, are in the early stages of their seasons during autumn; American college basketball and college ice hockey play teams outside their athletic conferences during the late autumn before their in-conference schedules begin in winter.\n\nThe Christian religious holidays of All Saints' Day and All Souls' Day are observed in autumn in the Northern hemisphere.\n\nSince 1997, Autumn has been one of the top 100 names for girls in the United States.[http://www.ssa.gov/OACT/babynames/ Popular Baby Names], Social Security Online.\n\nIn Indian mythology, autumn is considered to be the preferred season for the goddess of learning Saraswati, who is also known by the name of \"goddess of autumn\" (Sharada).\n\nIn Asian mysticism, Autumn is associated with the element of metal, and subsequently with the colour white, the White Tiger of the West, and death and mourning.\n\nIn the United States, Labor Day is a public holiday celebrated on the first Monday in September.\n\nIn Australia and New Zealand, Anzac Day, the day of remembrance in both countries of those who served and died in the wars those countries were involved in, falls in the autumn month of April. It is a public holiday in both countries. Traditionally, the people attend dawn services, wear paper poppies sold by the Returned Services Association, and bake Anzac biscuits. Graves of the dead are decorated in places such as Te Awamatu, and the Anzac day clash Aussie Rules game in Australia is played between Collingwood and Essendon, at the Melbourne Cricket Ground (MCG).\n\nTourism\n\nAlthough colour change in leaves occurs wherever deciduous trees are found, coloured autumn foliage is noted in various regions of the world: most of North America, Eastern Asia (including China, Korea, and Japan), Europe, the forest of Patagonia, eastern Australia and New Zealand's South Island.\n\nEastern Canada and New England are famous for their autumnal foliage, and this attracts major tourism (worth billions of US dollars) for the regions.\n\nPaintings\n\nFile:Frederic Edwin Church - Autumn.jpg|Otoño, Frederic Edwin Church, 1875.  Museo Thyssen-Bornemisza\nImage:Millais - Herbstblätter.jpg|John Everett Millais, \"Autumn Leaves\"\nFile:Giuseppe Arcimboldo - Autumn, 1573.jpg|Autumn, Giuseppe Arcimboldo, 1573\nFile:Alfons_Mucha_-_1896_-_Autumn.jpg|Autumn (1896) by Art Nouveau artist Alphonse Mucha\nFile:Stanisław Masłowski (1853-1926), Autumn landscape in Rybiniszki, 1902.jpeg|Autumn landscape in Rybiniszki, Latvia, watercolor by Stanisław Masłowski, 1902 (National Museum in Warsaw, Poland)\nFile:Maxfield_Parrish_-_Autumn_(1905).jpg|This 1905 print by  Maxfield Frederick Parrish illustrated Keats' poem 'Autumn'",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Autumn" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3049" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Autumn, also known as fall in American and Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer to winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools down considerably. One of its main features is the shedding of leaves from deciduous trees.\n\nSome cultures regard the autumnal equinox as \"mid-autumn\", while others with a longer temperature lag treat it as the start of autumn. Meteorologists (and most of the temperate countries in the southern hemisphere) use a definition based on Gregorian calendar months, with autumn being September, October, and November in the northern hemisphere, and March, April, and May in the southern hemisphere.\n\nIn North America, autumn is usually considered to start with the September equinox (21 to 24 September) and end with the winter solstice (21 or 22 December).http://www.almanac.com/content/first-day-winter-winter-solstice Popular culture in North America associates Labor Day, the first Monday in September, as the end of summer and the start of autumn; certain summer traditions, such as wearing white, are discouraged after that date. As daytime and nighttime temperatures decrease, trees shed their leaves. In traditional East Asian solar term, autumn starts on or around 8 August and ends on or about 7 November. In Ireland, the autumn months according to the national meteorological service, Met Éireann, are September, October and November. However, according to the Irish Calendar, which is based on ancient Gaelic traditions, autumn lasts throughout the months of August, September and October, or possibly a few days later, depending on tradition. In Australia and New Zealand, autumn officially begins on 1 March and ends on 31 May. In these countries, Autumn is associated with events such as Easter and Anzac day.\n\nEtymology\n\nThe word autumn comes from the ancient Etruscan root autu- and has within it connotations of the passing of the year. It was borrowed by the neighbouring Romans, and became the Latin word '.Etymology of 'autumn'  - New Shorter Oxford English Dictionary, 1997 Edition After the Roman era, the word continued to be used as the Old French word ' (' in modern French) or ' in Middle English,Oxford English Dictionary, 2nd Edition, entry at automn. and was later normalised to the original Latin. In the Medieval period, there are rare examples of its use as early as the 12th century, but by the 16th century, it was in common use.\n\nBefore the 16th century, harvest was the term usually used to refer to the season, as it is common in other West Germanic languages to this day (cf. Dutch ', German ' and Scots '). However, as more people gradually moved from working the land to living in towns, the word harvest lost its reference to the time of year and came to refer only to the actual activity of reaping, and autumn, as well as fall, began to replace it as a reference to the season.\n\nThe alternative word fall for the season traces its origins to old Germanic languages. The exact derivation is unclear, with the Old English ' or ' and the Old Norse ' all being possible candidates. However, these words all have the meaning \"to fall from a height\" and are clearly derived either from a common root or from each other. The term came to denote the season in 16th-century England, a contraction of Middle English expressions like \"fall of the leaf\" and \"fall of the year\".\n\nDuring the 17th century, English emigration to the British colonies in North America was at its peak, and the new settlers took the English language with them. While the term fall gradually became obsolete in Britain, it became the more common term in North America.\n\nThe name backend, a once common name for the season in Northern England, has today been largely replaced by the name autumn.\n\nAssociations\n\nHarvest\n\nAssociation with the transition from warm to cold weather, and its related status as the season of the primary harvest, has dominated its themes and popular images. In Western cultures, personifications of autumn are usually pretty, well-fed females adorned with fruits, vegetables and grains that ripen at this time. Many cultures feature autumnal harvest festivals, often the most important on their calendars. Still extant echoes of these celebrations are found in the autumn Thanksgiving holiday of the United States and Canada, and the Jewish Sukkot holiday with its roots as a full-moon harvest festival of \"tabernacles\" (living in outdoor huts around the time of harvest).  There are also the many North American Indian festivals tied to harvest of ripe foods gathered in the wild, the Chinese Mid-Autumn or Moon festival, and many others. The predominant mood of these autumnal celebrations is a gladness for the fruits of the earth mixed with a certain melancholy linked to the imminent arrival of harsh weather.\n\nThis view is presented in English poet John Keats' poem To Autumn, where he describes the season as a time of bounteous fecundity, a time of 'mellow fruitfulness'.\n\nWhile most foods are harvested during the autumn, foods particularly associated with the season include pumpkins (which are integral parts of both Thanksgiving and Halloween) and apples, which are used to make the seasonal beverage apple cider.\n\nMelancholia\n\nAutumn, especially in poetry, has often been associated with melancholia. The possibilities of summer are gone, and the chill of winter is on the horizon. Skies turn grey, the amount of usable daylight drops rapidly, and many people turn inward, both physically and mentally.[http://www.symbolism.org/writing/books/sp/4/page2.html Cyclical Regenerative Time - (c) Autumn] (from 'Symbolism of Place', symbolism.org website) It has been referred to as an unhealthy season.\n\nSimilar examples may be found in Irish poet William Butler Yeats' poem The Wild Swans at Coole where the maturing season that the poet observes symbolically represents his own ageing self. Like the natural world that he observes, he too has reached his prime and now must look forward to the inevitability of old age and death. French poet Paul Verlaine's \"Chanson d'automne\" (\"Autumn Song\") is likewise characterised by strong, painful feelings of sorrow. Keats' To Autumn, written in September 1819, echoes this sense of melancholic reflection, but also emphasises the lush abundance of the season.\n\nHalloween\n\nAutumn is associated with Halloween (influenced by Samhain, a Celtic autumn festival), and with it a widespread marketing campaign that promotes it. Halloween is in autumn in the northern hemisphere. The television, film, book, costume, home decoration, and confectionery industries use this time of year to promote products closely associated with such a holiday, with promotions going from early September to 31 October, since their themes rapidly lose strength once the holiday ends, and advertising starts concentrating on Christmas.\n\nOther associations\n\nAutumn also has a strong association with the end of summer holiday and the start of a new school year, particularly for children in primary and secondary education. \"Back to School\" advertising and preparations usually occurs in the weeks leading to the beginning of autumn.\n\nEaster is in autumn in the southern hemisphere. \n\nThanksgiving Day is a national holiday celebrated in Canada, in the United States, in some of the Caribbean islands and in Liberia. Thanksgiving is celebrated on the second Monday of October in Canada and on the fourth Thursday of November in the United States, and around the same part of the year in other places. Similarly named festival holidays occur in Germany and Japan.\n\nTelevision stations and networks, particularly in North America, traditionally begin their regular seasons in autumn, with new series and new episodes of existing series debuting mostly during late September or early October (series that debut outside the fall season are usually known as mid-season replacements). A sweeps period takes place in November to measure Nielsen Ratings.\n\nAmerican football is played almost exclusively in the autumn months; at the high school level, seasons run through September and October, with some playoff games and holiday rivalry contests being played as late as Thanksgiving. College football's regular season runs from September through November, while the main professional circuit, the National Football League, plays from September through December. Summer sports, such as stock car racing and Major League Baseball, wrap up their seasons in early autumn; MLB's championship World Series is known popularly as the \"Fall Classic\"., et al. (Amateur baseball is usually finished by August.) Likewise, professional winter sports, such as professional ice hockey, basketball and most leagues of soccer football in Europe, are in the early stages of their seasons during autumn; American college basketball and college ice hockey play teams outside their athletic conferences during the late autumn before their in-conference schedules begin in winter.\n\nThe Christian religious holidays of All Saints' Day and All Souls' Day are observed in autumn in the Northern hemisphere.\n\nSince 1997, Autumn has been one of the top 100 names for girls in the United States.[http://www.ssa.gov/OACT/babynames/ Popular Baby Names], Social Security Online.\n\nIn Indian mythology, autumn is considered to be the preferred season for the goddess of learning Saraswati, who is also known by the name of \"goddess of autumn\" (Sharada).\n\nIn Asian mysticism, Autumn is associated with the element of metal, and subsequently with the colour white, the White Tiger of the West, and death and mourning.\n\nIn the United States, Labor Day is a public holiday celebrated on the first Monday in September.\n\nIn Australia and New Zealand, Anzac Day, the day of remembrance in both countries of those who served and died in the wars those countries were involved in, falls in the autumn month of April. It is a public holiday in both countries. Traditionally, the people attend dawn services, wear paper poppies sold by the Returned Services Association, and bake Anzac biscuits. Graves of the dead are decorated in places such as Te Awamatu, and the Anzac day clash Aussie Rules game in Australia is played between Collingwood and Essendon, at the Melbourne Cricket Ground (MCG).\n\nTourism\n\nAlthough colour change in leaves occurs wherever deciduous trees are found, coloured autumn foliage is noted in various regions of the world: most of North America, Eastern Asia (including China, Korea, and Japan), Europe, the forest of Patagonia, eastern Australia and New Zealand's South Island.\n\nEastern Canada and New England are famous for their autumnal foliage, and this attracts major tourism (worth billions of US dollars) for the regions.\n\nPaintings\n\nFile:Frederic Edwin Church - Autumn.jpg|Otoño, Frederic Edwin Church, 1875.  Museo Thyssen-Bornemisza\nImage:Millais - Herbstblätter.jpg|John Everett Millais, \"Autumn Leaves\"\nFile:Giuseppe Arcimboldo - Autumn, 1573.jpg|Autumn, Giuseppe Arcimboldo, 1573\nFile:Alfons_Mucha_-_1896_-_Autumn.jpg|Autumn (1896) by Art Nouveau artist Alphonse Mucha\nFile:Stanisław Masłowski (1853-1926), Autumn landscape in Rybiniszki, 1902.jpeg|Autumn landscape in Rybiniszki, Latvia, watercolor by Stanisław Masłowski, 1902 (National Museum in Warsaw, Poland)\nFile:Maxfield_Parrish_-_Autumn_(1905).jpg|This 1905 print by  Maxfield Frederick Parrish illustrated Keats' poem 'Autumn'. Autumn. http://en.wikipedia.org/?curid=3049."
  }
}
