{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16555",
  "eid" : "26902f80-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573944,
  "textBody" : "John the Evangelist (, ) is the name traditionally given to the author of the Gospel of John. Christians have traditionally identified him with John the Apostle, John of Patmos, and John the Presbyter, though this has been disputed by modern scholars.\n\nGospel of John \n\nThe Gospel of John refers to an otherwise unnamed \"disciple whom Jesus loved\", who \"bore witness to and wrote\" the Gospel's message.Theissen, Gerd and Annette Merz. The historical Jesus: a comprehensive guide. Fortress Press. 1998. translated from German (1996 edition). Chapter 2. Christian sources about Jesus. The author of the Gospel of John seemed interested in maintaining the internal anonymity of the author's identity, though interpreting the Gospel in the light of the Synoptic Gospels and considering that the author names (and therefore is not claiming to be) Peter, and that James was martyred as early as 44 AD (Acts 12:2) it has been widely believed that the author either was the Apostle John or was pretending to be.Theissen, Gerd and Annette Merz. The historical Jesus: a comprehensive guide. Fortress Press. 1998. translated from German (1996 edition)\n\nChristian tradition says that John the Evangelist was John the Apostle. The Apostle John was a historical figure, one of the \"pillars\" of the Jerusalem church after Jesus' death.Harris, Stephen L., Understanding the Bible. Palo Alto: Mayfield. 1985. \"John\" p. 302-310 He was one of  the original twelve apostles and is thought to be the only one to have lived into old age and not be killed for his faith. John is associated with the city of Ephesus, where he is said to have lived and been buried. Some believe that he was exiled (around 95 AD) to the Aegean island of Patmos, where he wrote the Book of Revelation. However, this is a matter of debate, with some attributing the authorship of Revelation to another man, called John of Patmos or to John the Presbyter.\n\nOrthodox Roman Catholic scholarship, most Protestant churches, and the entire Eastern Orthodox Church attribute all of the Johannine literature to the same individual, the \"Holy Apostle and Evangelist, John the Theologian\", whom it identifies with the \"Beloved Disciple\" in the Gospel of John.\n\nAuthorship of the Johannine works\n\nThe authorship of the Johannine works has been debated by scholars since at least the 2nd century AD.F. L. Cross, The Oxford Dictionary of the Christian Church, (New York: Oxford University Press, 1997), 45 The main debate centers on who authored the writings, and which of the writings, if any, can be ascribed to a common author.\n\nOrthodox tradition attributes all the books to John the Apostle.Stephen L Harris, Understanding the Bible, (Palo Alto: Mayfield, 1985), 355\n\nIn the 6th century, the Decretum Gelasianum argued that Second and Third John have a separate author known as \"John, a priest\" (see John the Presbyter).Since the 18th century, the Decretum Gelasianum has been associated with the Council of Rome (382), though historians dispute the connection. Historical criticism rejects the view that John the Apostle authored any of these works.\n\nMany modern scholars conclude that the apostle John wrote none of these works,\"Although ancient traditions attributed to the Apostle John the Fourth Gospel, the Book of Revelation, and the three Epistles of John, modern scholars believe that he wrote none of them.\" Harris, Stephen L., Understanding the Bible (Palo Alto: Mayfield, 1985) p. 355 although others, notably J.A.T. Robinson, F. F. Bruce, Leon Morris, and Martin HengelHengel, Martin. Four Gospels and the One Gospel of Jesus Christ, |page40 |. Trinity Press International; 1st edition, 2000. p. 40 hold the apostle to be behind at least some, in particular the gospel.Morris, Leon (1995) [https://books.google.com/books?idII-33dS9esAC&pg\nPA4#vsnippet&q\nContinental%20scholars&f=false The Gospel According to John] Volume 4 of The new international commentary on the New Testament, Wm. B. Eerdmans Publishing, , pp. 4–5, 24, 35–7. \"Continental scholars have ... abandoned the idea that this gospel was written by the apostle John, whereas in Great Britain and America scholarship has been much more open to the idea.\" Abandonment is due to changing opinion rather \"than to any new evidence.\" \"Werner, Colson, and I have been joined, among others, by I. Howard Marshall and J.A.T. Robinson in seeing the evidence as pointing to John the son of Zebedee as the author of this Gospel.\" The view that John's history is substandard \"is becoming increasingly hard to sustain. Many recent writers have shown that there is good reason for regarding this or that story in John as authentic. ... It is difficult to ... regard John as having little concern for history. The fact is John is concerned with historical information. ... John apparently records this kind of information because he believes it to be accurate. ... He has some reliable information and has recorded it carefully. ... The evidence is that where he can be tested John proves to be remarkably accurate.\"\n*Bruce 1981 pp. 52–4, 58. \"The evidence ... favor[s] the apostolicity of the gospel. ... John knew the other gospels and ... supplements them. ... The synoptic narrative becomes more intelligible if we follow John.\" John's style is different so Jesus' \"abiding truth might be presented to men and women who were quite unfamiliar with the original setting. ... He does not yield to any temptation to restate Christianity. ... It is the story of events that happened in history. ... John does not divorce the story from its Palestinian context.\"\n*Dodd p. 444. \"Revelation is distinctly, and nowhere more clearly than in the Fourth Gospel, a historical revelation. It follows that it is important for the evangelist that what he narrates happened.\"\n*Temple, William. \"Readings in St. John's Gospel\". MacMillan and Co, 1952. \"The synoptists give us something more like the perfect photograph; St. John gives us the more perfect portrait\".\n*Edwards, R. A. \"The Gospel According to St. John\" 1954, p 9. One reason he accepts John's authorship is because \"the alternative solutions seem far too complicated to be possible in a world where living men met and talked\".\n*Hunter, A. M. \"Interpreting the New Testament\" P 86. \"After all the conjectures have been heard, the likeliest view is that which identifies the Beloved Disciple with the Apostle John.Dr. Craig Blomberg, cited in Lee Strobel The Case for Christ, 1998, Chapter 2.\n*Marshall, Howard. \"The Illustrated Bible Dictionary\", ed J. D. Douglas et al. Leicester 1980. II, p 804\n*Robinson, J. A. T. \"The Priority of John\" P 122\n*Cf. Marsh, \"John seems to have believed that theology was not something which could be used to read a meaning into events but rather something that was to be discovered in them. His story is what it is because his theology is what it is; but his theology is what it is because the story happened so\" (p 580–581).\n\nThere may have been a single author for the gospel and the three epistles. Some scholars conclude the author of the epistles was different from that of the gospel, although all four works probably originated from the same community.Ehrman, pp. 178–9. The gospel and epistles traditionally and plausibly came from Ephesus, c. 90–110, although some scholars argue for an origin in Syria.\n\nIn the case of Revelation, many modern scholars agree that it was written by a separate author, John of Patmos, c. 95 with some parts possibly dating to Nero's reign in the early 60s.\n\nFeast day\n\nThe feast day of Saint John in the Roman Catholic Church, which calls him \"Saint John, Apostle and Evangelist\", and in the Anglican Communion and Lutheran Calendars, which call him \"John, Apostle and Evangelist\", is on 27 December, the third day of Christmastide. In the Tridentine Calendar he was commemorated also on each of the following days up to and including 3 January, the Octave of the 27 December feast. This Octave was abolished by Pope Pius XII in 1955.General Roman Calendar of Pope Pius XII  The traditional liturgical color is white.\n\nIn art\n\nJohn is traditionally depicted in one of two distinct ways: either as an aged man with a white or gray beard, or alternatively as a beardless youth.Sources:\n*James Hall, Dictionary of Subjects and Symbols in Art, (New York: Harper & Row, 1979), 129, 174-75.\n*Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism,\" Cleveland Studies in the History of Art, Vol. 6 (2001), 16.\n The first way of depicting him was more common in Byzantine art, where it was possibly influenced by antique depictions of Socrates;\nJadranka Prolović, \"Socrates and St. John the Apostle: the interchangеable similarity of their portraits\" Zograf, vol. 35 (2011), 9: \"It is difficult to locate when and where this iconography of John originated and what the prototype was, yet it is clearly visible that this iconography of John contains all of the main characteristics of well-known antique images of Socrates. This fact leads to the conclusion that Byzantine artists used depictions of Socrates as a model for the portrait of John.\" the second was more common in the art of Medieval Western Europe and can be dated back as far as 4th century Rome.\n\nIn Medieval works of painting, sculpture and literature, Saint John is often presented in an androgynous or femininized manner.\n* James Hall, Dictionary of Subjects and Symbols in Art, (New York: Harper & Row, 1979), 129, 174-75.\n* Jeffrey F. Hamburger, St. John the Divine: The Deified Evangelist in Medieval Art and Theology. (Berkeley: University of California Press, 2002), xxi-xxii; ibidem, 159-160.\n* Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism,\" Cleveland Studies in the History of Art, Vol. 6 (2001), 16.\n* Annette Volfing, John the Evangelist and Medieval Writing: Imitating the Inimitable. (Oxford: Oxford University Press, 2001), 139.\n Historians have related such portrayals to the circumstances of the believers for whom they were intended.\n* Jeffrey F. Hamburger, St. John the Divine: The Deified Evangelist in Medieval Art and Theology. (Berkeley: University of California Press, 2002), xxi-xxii.\n* Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism\" Cleveland Studies in the History of Art, Vol. 6 (2001), 20.\n* Sarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 142-148.\n* Annette Volfing, John the Evangelist and Medieval Writing: Imitating the Inimitable. (Oxford: Oxford University Press, 2001), 139.\n For instance, John's feminine features are argued to have helped to make him more relatable to women.\n* Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism\" Cleveland Studies in the History of Art, Vol. 6 (2001), 20.\n* Annette Volfing, John the Evangelist and Medieval Writing: Imitating the Inimitable. (Oxford: Oxford University Press, 2001), 139.\n Likewise, Sarah McNamer argues that because of John's androgynous status, he could function as an 'image of a third or mixed gender'\nSarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 142.\n and 'a crucial figure with whom to identify'\nSarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 145.\n for male believers who sought to cultivate an attitude of affective piety, a highly emotional style of devotion that, in late-medieval culture, was thought to be poorly compatible with masculinity.\nSarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 142-148.\n\nLegends from the Acts of John contributed much to Medieval iconography; it is the source of the idea that John became an apostle at a young age. One of John's familiar attributes is the chalice, often with a snake emerging from it.James Hall, \"John the Evangelist,\" Dictionary of Subjects and Symbols in Art, rev. ed. (New York: Harper & Row, 1979) According to one legend from the Acts of John,J.K. Elliot (ed.), A Collection of Apocryphal Christian Literature in an English Translation Based on M.R. James (New York: Oxford University Press, 1993/2005), 343-345. John was challenged to drink a cup of poison to demonstrate the power of his faith. The chalice can also be interpreted with reference to the Last Supper, or to the words of Christ to John and James: \"My chalice indeed you shall drink\" ().Fonck, L. (1910). [http://www.newadvent.org/cathen/08492a.htm St. John the Evangelist]. In The Catholic Encyclopedia (New York: Robert Appleton Company). Retrieved 2017-08-14 from New Advent. According to the 1910 Catholic Encyclopedia, some authorities believe that this symbol was not adopted until the 13th century. Another common attribute is a book or a scroll, in reference to his writings. The saint is symbolically represented by an eagle, one of the creatures envisioned by Ezekiel (1:10)  and in the Revelation to John (4:7).\n\nGallery \n\nFile: Joan_de_Joanes_-_St_John_the_Evangelist_-_WGA12061.jpg|St. John the Evangelist by Joan de Joanes (1507–1579), oil on panel.\nFile:Zampieri St John Evangelist.jpg|Saint John the Evangelist by Domenichino (1621–29)\nFile:1490 Gleismüller Johannes auf Patmos anagoria.JPG|Saint John the Evangelist on Patmos, 1490\nFile:Piero di Cosimo (Piero di Lorenzo) - St. John the Evangelist, c. 1500.jpg|Piero di Cosimo, Saint John the Evangelist, oil on panel, 1504–6, Honolulu Museum of Art\n \nFile:El Greco, The Vision of Saint John (1608-1614).jpg |The Vision of Saint John (1608–1614), by El Greco\nFile:Simone Cantarini - São João Batista em Meditação.jpg|Saint John the Evangelist in meditation by Simone Cantarini(1612–1648), Bologna\nFile:Sts-john-and-bartholomew-with-donor-dosso-dossi.jpg|Saints John and Bartholomew, by Dosso Dossi\nFile:Enniscorthy St. Aidan's Cathedral East Aisle Second Window Evangelist John Detail 2009 09 28.jpg|Stained glass window in St. Aidan’s Cathedral, Ireland\nFile:Cano - San Juan.jpg|Saint John and the Poisoned Cup by Alonzo CanoSpain (1635–1637)\nFile:GRM Inv. J-3182.jpg|Saint John and the eagle by Vladimir Borovikovsky in Kazan Cathedral, Saint Petersburg\nFile:KellsFol291vPortJohn.jpg|A portrait from the Book of Kells, c. 800\nFile:El Greco 034.jpg|Saint John and the cup by El Greco\nFile:St-johns-seminary-st-john.jpg|Statue of John the Evangelist outside St. John's Seminary, Boston\nFile:De Grey Hours f.26.v St. John the Evangelist.png|St John the Evangelist depicted in a 14th-century manuscript in the Flemish style \nFile:San Juan Evangelista, por Francisco Pacheco.jpg|St John the Evangelist, by Francisco Pacheco (1608, Museo del Prado).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John the Evangelist" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16555" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John the Evangelist (, ) is the name traditionally given to the author of the Gospel of John. Christians have traditionally identified him with John the Apostle, John of Patmos, and John the Presbyter, though this has been disputed by modern scholars.\n\nGospel of John \n\nThe Gospel of John refers to an otherwise unnamed \"disciple whom Jesus loved\", who \"bore witness to and wrote\" the Gospel's message.Theissen, Gerd and Annette Merz. The historical Jesus: a comprehensive guide. Fortress Press. 1998. translated from German (1996 edition). Chapter 2. Christian sources about Jesus. The author of the Gospel of John seemed interested in maintaining the internal anonymity of the author's identity, though interpreting the Gospel in the light of the Synoptic Gospels and considering that the author names (and therefore is not claiming to be) Peter, and that James was martyred as early as 44 AD (Acts 12:2) it has been widely believed that the author either was the Apostle John or was pretending to be.Theissen, Gerd and Annette Merz. The historical Jesus: a comprehensive guide. Fortress Press. 1998. translated from German (1996 edition)\n\nChristian tradition says that John the Evangelist was John the Apostle. The Apostle John was a historical figure, one of the \"pillars\" of the Jerusalem church after Jesus' death.Harris, Stephen L., Understanding the Bible. Palo Alto: Mayfield. 1985. \"John\" p. 302-310 He was one of  the original twelve apostles and is thought to be the only one to have lived into old age and not be killed for his faith. John is associated with the city of Ephesus, where he is said to have lived and been buried. Some believe that he was exiled (around 95 AD) to the Aegean island of Patmos, where he wrote the Book of Revelation. However, this is a matter of debate, with some attributing the authorship of Revelation to another man, called John of Patmos or to John the Presbyter.\n\nOrthodox Roman Catholic scholarship, most Protestant churches, and the entire Eastern Orthodox Church attribute all of the Johannine literature to the same individual, the \"Holy Apostle and Evangelist, John the Theologian\", whom it identifies with the \"Beloved Disciple\" in the Gospel of John.\n\nAuthorship of the Johannine works\n\nThe authorship of the Johannine works has been debated by scholars since at least the 2nd century AD.F. L. Cross, The Oxford Dictionary of the Christian Church, (New York: Oxford University Press, 1997), 45 The main debate centers on who authored the writings, and which of the writings, if any, can be ascribed to a common author.\n\nOrthodox tradition attributes all the books to John the Apostle.Stephen L Harris, Understanding the Bible, (Palo Alto: Mayfield, 1985), 355\n\nIn the 6th century, the Decretum Gelasianum argued that Second and Third John have a separate author known as \"John, a priest\" (see John the Presbyter).Since the 18th century, the Decretum Gelasianum has been associated with the Council of Rome (382), though historians dispute the connection. Historical criticism rejects the view that John the Apostle authored any of these works.\n\nMany modern scholars conclude that the apostle John wrote none of these works,\"Although ancient traditions attributed to the Apostle John the Fourth Gospel, the Book of Revelation, and the three Epistles of John, modern scholars believe that he wrote none of them.\" Harris, Stephen L., Understanding the Bible (Palo Alto: Mayfield, 1985) p. 355 although others, notably J.A.T. Robinson, F. F. Bruce, Leon Morris, and Martin HengelHengel, Martin. Four Gospels and the One Gospel of Jesus Christ, |page40 |. Trinity Press International; 1st edition, 2000. p. 40 hold the apostle to be behind at least some, in particular the gospel.Morris, Leon (1995) [https://books.google.com/books?idII-33dS9esAC&pg\nPA4#vsnippet&q\nContinental%20scholars&f=false The Gospel According to John] Volume 4 of The new international commentary on the New Testament, Wm. B. Eerdmans Publishing, , pp. 4–5, 24, 35–7. \"Continental scholars have ... abandoned the idea that this gospel was written by the apostle John, whereas in Great Britain and America scholarship has been much more open to the idea.\" Abandonment is due to changing opinion rather \"than to any new evidence.\" \"Werner, Colson, and I have been joined, among others, by I. Howard Marshall and J.A.T. Robinson in seeing the evidence as pointing to John the son of Zebedee as the author of this Gospel.\" The view that John's history is substandard \"is becoming increasingly hard to sustain. Many recent writers have shown that there is good reason for regarding this or that story in John as authentic. ... It is difficult to ... regard John as having little concern for history. The fact is John is concerned with historical information. ... John apparently records this kind of information because he believes it to be accurate. ... He has some reliable information and has recorded it carefully. ... The evidence is that where he can be tested John proves to be remarkably accurate.\"\n*Bruce 1981 pp. 52–4, 58. \"The evidence ... favor[s] the apostolicity of the gospel. ... John knew the other gospels and ... supplements them. ... The synoptic narrative becomes more intelligible if we follow John.\" John's style is different so Jesus' \"abiding truth might be presented to men and women who were quite unfamiliar with the original setting. ... He does not yield to any temptation to restate Christianity. ... It is the story of events that happened in history. ... John does not divorce the story from its Palestinian context.\"\n*Dodd p. 444. \"Revelation is distinctly, and nowhere more clearly than in the Fourth Gospel, a historical revelation. It follows that it is important for the evangelist that what he narrates happened.\"\n*Temple, William. \"Readings in St. John's Gospel\". MacMillan and Co, 1952. \"The synoptists give us something more like the perfect photograph; St. John gives us the more perfect portrait\".\n*Edwards, R. A. \"The Gospel According to St. John\" 1954, p 9. One reason he accepts John's authorship is because \"the alternative solutions seem far too complicated to be possible in a world where living men met and talked\".\n*Hunter, A. M. \"Interpreting the New Testament\" P 86. \"After all the conjectures have been heard, the likeliest view is that which identifies the Beloved Disciple with the Apostle John.Dr. Craig Blomberg, cited in Lee Strobel The Case for Christ, 1998, Chapter 2.\n*Marshall, Howard. \"The Illustrated Bible Dictionary\", ed J. D. Douglas et al. Leicester 1980. II, p 804\n*Robinson, J. A. T. \"The Priority of John\" P 122\n*Cf. Marsh, \"John seems to have believed that theology was not something which could be used to read a meaning into events but rather something that was to be discovered in them. His story is what it is because his theology is what it is; but his theology is what it is because the story happened so\" (p 580–581).\n\nThere may have been a single author for the gospel and the three epistles. Some scholars conclude the author of the epistles was different from that of the gospel, although all four works probably originated from the same community.Ehrman, pp. 178–9. The gospel and epistles traditionally and plausibly came from Ephesus, c. 90–110, although some scholars argue for an origin in Syria.\n\nIn the case of Revelation, many modern scholars agree that it was written by a separate author, John of Patmos, c. 95 with some parts possibly dating to Nero's reign in the early 60s.\n\nFeast day\n\nThe feast day of Saint John in the Roman Catholic Church, which calls him \"Saint John, Apostle and Evangelist\", and in the Anglican Communion and Lutheran Calendars, which call him \"John, Apostle and Evangelist\", is on 27 December, the third day of Christmastide. In the Tridentine Calendar he was commemorated also on each of the following days up to and including 3 January, the Octave of the 27 December feast. This Octave was abolished by Pope Pius XII in 1955.General Roman Calendar of Pope Pius XII  The traditional liturgical color is white.\n\nIn art\n\nJohn is traditionally depicted in one of two distinct ways: either as an aged man with a white or gray beard, or alternatively as a beardless youth.Sources:\n*James Hall, Dictionary of Subjects and Symbols in Art, (New York: Harper & Row, 1979), 129, 174-75.\n*Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism,\" Cleveland Studies in the History of Art, Vol. 6 (2001), 16.\n The first way of depicting him was more common in Byzantine art, where it was possibly influenced by antique depictions of Socrates;\nJadranka Prolović, \"Socrates and St. John the Apostle: the interchangеable similarity of their portraits\" Zograf, vol. 35 (2011), 9: \"It is difficult to locate when and where this iconography of John originated and what the prototype was, yet it is clearly visible that this iconography of John contains all of the main characteristics of well-known antique images of Socrates. This fact leads to the conclusion that Byzantine artists used depictions of Socrates as a model for the portrait of John.\" the second was more common in the art of Medieval Western Europe and can be dated back as far as 4th century Rome.\n\nIn Medieval works of painting, sculpture and literature, Saint John is often presented in an androgynous or femininized manner.\n* James Hall, Dictionary of Subjects and Symbols in Art, (New York: Harper & Row, 1979), 129, 174-75.\n* Jeffrey F. Hamburger, St. John the Divine: The Deified Evangelist in Medieval Art and Theology. (Berkeley: University of California Press, 2002), xxi-xxii; ibidem, 159-160.\n* Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism,\" Cleveland Studies in the History of Art, Vol. 6 (2001), 16.\n* Annette Volfing, John the Evangelist and Medieval Writing: Imitating the Inimitable. (Oxford: Oxford University Press, 2001), 139.\n Historians have related such portrayals to the circumstances of the believers for whom they were intended.\n* Jeffrey F. Hamburger, St. John the Divine: The Deified Evangelist in Medieval Art and Theology. (Berkeley: University of California Press, 2002), xxi-xxii.\n* Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism\" Cleveland Studies in the History of Art, Vol. 6 (2001), 20.\n* Sarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 142-148.\n* Annette Volfing, John the Evangelist and Medieval Writing: Imitating the Inimitable. (Oxford: Oxford University Press, 2001), 139.\n For instance, John's feminine features are argued to have helped to make him more relatable to women.\n* Carolyn S. Jerousek, \"Christ and St. John the Evangelist as a Model of Medieval Mysticism\" Cleveland Studies in the History of Art, Vol. 6 (2001), 20.\n* Annette Volfing, John the Evangelist and Medieval Writing: Imitating the Inimitable. (Oxford: Oxford University Press, 2001), 139.\n Likewise, Sarah McNamer argues that because of John's androgynous status, he could function as an 'image of a third or mixed gender'\nSarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 142.\n and 'a crucial figure with whom to identify'\nSarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 145.\n for male believers who sought to cultivate an attitude of affective piety, a highly emotional style of devotion that, in late-medieval culture, was thought to be poorly compatible with masculinity.\nSarah McNamer, Affective Meditation and the Invention of Medieval Compassion, (Philadelphia: University of Pennsylvania Press, 2010), 142-148.\n\nLegends from the Acts of John contributed much to Medieval iconography; it is the source of the idea that John became an apostle at a young age. One of John's familiar attributes is the chalice, often with a snake emerging from it.James Hall, \"John the Evangelist,\" Dictionary of Subjects and Symbols in Art, rev. ed. (New York: Harper & Row, 1979) According to one legend from the Acts of John,J.K. Elliot (ed.), A Collection of Apocryphal Christian Literature in an English Translation Based on M.R. James (New York: Oxford University Press, 1993/2005), 343-345. John was challenged to drink a cup of poison to demonstrate the power of his faith. The chalice can also be interpreted with reference to the Last Supper, or to the words of Christ to John and James: \"My chalice indeed you shall drink\" ().Fonck, L. (1910). [http://www.newadvent.org/cathen/08492a.htm St. John the Evangelist]. In The Catholic Encyclopedia (New York: Robert Appleton Company). Retrieved 2017-08-14 from New Advent. According to the 1910 Catholic Encyclopedia, some authorities believe that this symbol was not adopted until the 13th century. Another common attribute is a book or a scroll, in reference to his writings. The saint is symbolically represented by an eagle, one of the creatures envisioned by Ezekiel (1:10)  and in the Revelation to John (4:7).\n\nGallery \n\nFile: Joan_de_Joanes_-_St_John_the_Evangelist_-_WGA12061.jpg|St. John the Evangelist by Joan de Joanes (1507–1579), oil on panel.\nFile:Zampieri St John Evangelist.jpg|Saint John the Evangelist by Domenichino (1621–29)\nFile:1490 Gleismüller Johannes auf Patmos anagoria.JPG|Saint John the Evangelist on Patmos, 1490\nFile:Piero di Cosimo (Piero di Lorenzo) - St. John the Evangelist, c. 1500.jpg|Piero di Cosimo, Saint John the Evangelist, oil on panel, 1504–6, Honolulu Museum of Art\n \nFile:El Greco, The Vision of Saint John (1608-1614).jpg |The Vision of Saint John (1608–1614), by El Greco\nFile:Simone Cantarini - São João Batista em Meditação.jpg|Saint John the Evangelist in meditation by Simone Cantarini(1612–1648), Bologna\nFile:Sts-john-and-bartholomew-with-donor-dosso-dossi.jpg|Saints John and Bartholomew, by Dosso Dossi\nFile:Enniscorthy St. Aidan's Cathedral East Aisle Second Window Evangelist John Detail 2009 09 28.jpg|Stained glass window in St. Aidan’s Cathedral, Ireland\nFile:Cano - San Juan.jpg|Saint John and the Poisoned Cup by Alonzo CanoSpain (1635–1637)\nFile:GRM Inv. J-3182.jpg|Saint John and the eagle by Vladimir Borovikovsky in Kazan Cathedral, Saint Petersburg\nFile:KellsFol291vPortJohn.jpg|A portrait from the Book of Kells, c. 800\nFile:El Greco 034.jpg|Saint John and the cup by El Greco\nFile:St-johns-seminary-st-john.jpg|Statue of John the Evangelist outside St. John's Seminary, Boston\nFile:De Grey Hours f.26.v St. John the Evangelist.png|St John the Evangelist depicted in a 14th-century manuscript in the Flemish style \nFile:San Juan Evangelista, por Francisco Pacheco.jpg|St John the Evangelist, by Francisco Pacheco (1608, Museo del Prado). John the Evangelist. http://en.wikipedia.org/?curid=16555."
  }
}
