{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6325",
  "eid" : "db005040-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778447172,
  "textBody" : "A church building or church house, often simply called a church, is a building used for Christian religious activities, particularly for worship services. The term in its architectural sense is most often used by Christians to refer to their religious buildings, but it is sometimes used (by analogy) to refer to buildings of other religions.Use of the term [http://www.britannica.com/EBchecked/topic/362167/Manichaeism \"The Manichaean Church\"], Encyclopædia Britannica In traditional Christian architecture, the church is often arranged in the shape of a Christian cross. When viewed from plan view the longest part of a cross is represented by the aisle and the junction of the cross is located at the altar area.\n\nTowers or domes are often added with the intention of directing the eye of the viewer towards the heavens and inspiring church visitors. Modern church buildings have a variety of architectural styles and layouts; many buildings that were designed for other purposes have now been converted for church use; and, similarly, many original church buildings have been put to other uses.\n\nThe earliest identified Christian church was a house church founded between 233 and 256. From the 11th through the 14th centuries, a wave of building of cathedrals and smaller parish churches occurred across Western Europe. A cathedral is a church, usually Roman Catholic, Anglican, Oriental Orthodox or Eastern Orthodox, housing a cathedra, the formal name for the seat or throne of a bishop.\n\nEtymology\n\nIn Greek, the adjective kyriak-ós/-ē/-ón means \"belonging, or pertaining, to a Kyrios\" (\"Lord\"), and the usage was adopted by early Christians of the Eastern Mediterranean with regard to anything pertaining to the Lord Jesus Christ: hence \"Kyriakós oíkos\" (\"house of the Lord\", church), \"Kyriakē\" (\"[the day] of the Lord\", i.e. Sunday), or \"Kyriakē proseukhē\" (the \"Lord's Prayer\").\n\nIn standard Greek usage, the older word \"ecclesia\" (ἐκκλησία, ekklesía, literally \"assembly\", \"congregation\", or the place where such a gathering occurs) was retained to signify both a specific edifice of Christian worship (a \"church\"), and the overall community of the faithful (the \"Church\"). This usage was also retained in Latin and the languages derived from Latin (e.g. French église, Italian chiesa, Spanish iglesia, Portuguese igreja, etc.), as well as in the Celtic languages (Welsh eglwys, Irish eaglais, Breton iliz, etc.) and in Turkish (kilise).\n\nIn the Germanic and some Slavic languages, the word kyriak-ós/-ē/-ón was adopted instead and derivatives formed thereof. In Old English the sequence of derivation started as \"cirice\" (Ki-ri-keh), then \"churche\" (kerke), and eventually \"church\" in its current pronunciation. German Kirche, Scots kirk, Russian церковь (tserkov), etc., are all similarly derived.\n\nHistory\n\nAntiquity\n\nAccording to the New Testament, the earliest Christians did not build church buildings. Instead, they gathered in homes ([https://www.biblegateway.com/passage/?searchActs%2017:5 Acts 17:5], [https://www.biblegateway.com/passage/?search\nActs+20%3A20&versionNIV 20:20], [https://www.biblegateway.com/passage/?search\n1+corinthians+16%3A19&versionNIV 1 Corinthians 16:19]) or in Jewish worship places like the Second Temple or synagogues ([https://www.biblegateway.com/passage/?search\nacts+2%3A46&versionNIV Acts 2:46], [https://www.biblegateway.com/passage/?search\nacts+19%3A8&version=NIV 19:8]). The earliest archeologically identified Christian church is a house church (domus ecclesiae), the Dura-Europos church, founded between 233 and 256. In the second half of the 3rd century CE, the first purpose-built halls for Christian worship (aula ecclesiae) began to be constructed. Although many of these were destroyed early in the next century during the Diocletianic Persecution, even larger and more elaborate church buildings began to appear during the reign of the Emperor Constantine the Great. (Chapter 3)\n\nMedieval times\n\nFrom the 11th through the 14th centuries, a wave of building of cathedrals and smaller parish churches occurred across Western Europe. In addition to being a place of worship, the cathedral or the parish church was used by the community in other ways. It could serve as a meeting place for guilds or a hall for banquets. Mystery plays were sometimes performed in cathedrals, and cathedrals might also be used for fairs. The church could be used as a place to thresh and store grain.\n\nRomanesque architecture \n\nBetween 1000 and 1200 AD the romanesque style became popular across Europe. While the name of the romanesque era refers to the tradition of Roman architecture, it was actually a West- and Central European trend. Romanesque buildings appear rather bulky and compact. Typical features are circular arches, round or octagonal towers and cushion capitals on the pillars. In the early romanesque era, coffering on the ceiling was fashionable, while later in the same era, groined vault was more popular. The rooms became wider and the motivs of sculptures became more epic.\n\nGothic architecture \n\nThe Gothic style emerged around 1140 in Île-de-France and spread through all of Europe. The gothic buildings were less compact than they had been in the romanesque era and often contained symbolic and allegoric features. For the first time, pointed arches, rib vaults and buttresses were used, with the result that massive walls were not longer needed to stabilise the building. Due to that advantage, the area of the windows became bigger, which resulted in a brighter and more friendly atmosphere inside the church. The nave became higher and so did the pillars and the church steeple. The amibition to test out the limits of the architectural possibilities resulted in the collapse of several towers. In Germany and the Netherlands, but also in Spain, it became popular to build hall churches, in which every vault has the same height.\n\nCathedrals were built in a very lavish way, as in the romanesque era. Examples for that are the Notre-Dame de Paris and the Notre-Dame de Reims in France, but also the San Francesco d’Assisi in Palermo, the Salisbury Cathedral and the Wool Church in Lavenham, England.\n\nMany gothic churches contain features from the romanesque era. Some of the most well-known gothic churches stayed unfinished for hundreds of years, after the gothic style was not popular anymore. About half of the Cologne Cathedral was for example build in the 19th century.\n\nRenaissance \n\nIn the 15th and 16th century, the change in ethics and society due to the renaissance and the reformation also influenced the building of churches. The common style was much like the gothic style, but in a simplified way. The basilica was not the most popular type of church anymore, but instead hall churches were built. Typical features are columns and classical capitals.\n\nIn Protestant churches, where the proclamation of God's Word is of special importance, the visitor's line of view is directed towards the pulpit.\n\nBaroque architecture \n\nThe baroque style was first used in Italy around 1575. From there it spread to the rest of Europe and to the European colonies. During the baroque era, the building industry increased heavily. Buildings, even churches, were used as indicators for wealth, authority and influence.The use of forms known from the renaissance were extremely exaggerated. Domes and capitals were decorated with moulding and the former stucco-sculptures were replaced by fresco paintings on the ceilings. For the first time, churches were seen as one connected work of art and consistent artistic concepts were developed. Instead of long buildings, more central-plan buildings were created. The sprawling decoration with floral ornamentation and mythological motives raised until about 1720 to the rococo era.\n\nThe Protestant parishes perfered lateral churches, in which all the visitors coud be as close as possible to the pulpit and the altar.\n\nArchitecture\n\nA common architecture for churches is the shape of a cross (a long central rectangle, with side rectangles, and a rectangle in front for the altar space or sanctuary). These churches also often have a dome or other large vaulted space in the interior to represent or draw attention to the heavens. Other common shapes for churches include a circle, to represent eternity, or an octagon or similar star shape, to represent the church's bringing light to the world. Another common feature is the spire, a tall tower on the \"west\" end of the church or over the crossing.\n\nAnother common feature of many Christian churches is the eastwards orientation of the front altar. \nOften, the altar will not be oriented due east, but in the direction of sunrise. This tradition origiates in Byzantium in the 4th century, and becomes prevalent in the West in the 8th to 9th century. \nThe old Roman custom of having the altar at the west end and the entrance at the east was sometimes followed as late as the 11th century even in areas of northern Europe under Frankish rule, as seen in Petershausen (Constance), Bamberg Cathedral, Augsburg Cathedral, Regensburg Cathedral, and Hildesheim Cathedral.[https://books.google.com/books?idsX8w667tblMC&pg\nPA12&dq%22XI+Jahrh+fortgedauert%22&hl\nen&saX&ved\n0ahUKEwir9NbtjObLAhWHDg8KHUFVA8kQ6AEIHDAA#vonepage&q\n%22XI%20Jahrh%20fortgedauert%22&f=false Heinrich Otte, Handbuch der kirchlichen Kunst-Archäologie des deutschen Mittelalters (Leipzig 1868), p. 12]\n\nTypes\n\nBasilica\n\nThe Latin word basilica (derived from Greek, Basiliké Stoà, Royal Stoa) was originally used to describe a Roman public building (as in Greece, mainly a tribunal), usually located in the forum of a Roman town.[https://books.google.com/books?id\nTe2dAAAAQBAJ&pg=PA117 The Oxford Dictionary of Christian Art and Architecture] (2013 ), p. 117\n\nAfter the Roman Empire became officially Christian, the term came by extension to refer to a large and important church that has been given special ceremonial rights by the Pope. Thus the word retains two senses today, one architectural and the other ecclesiastical.\n\nCathedral\n\nA cathedral is a church, usually Roman Catholic, Anglican, Oriental Orthodox or Eastern Orthodox, housing the seat of a bishop. The word cathedral takes its name from cathedra, or Bishop's Throne (In ). The term is sometimes (improperly) used to refer to any church of great size.\n\nA church that has the function of cathedral is not necessarily a large building. It might be as small as Christ Church Cathedral in Oxford, England, Sacred Heart Cathedral in Raleigh, United States, or Chur Cathedral in Switzerland. However, frequently, the cathedral along with some of the abbey churches, was the largest building in any region.\n\nPilgrimage church\n\nA pilgrimage church is a church to which pilgrimages are regularly made, or a church along a pilgrimage route, often located at the tomb of a saints, or holding icons or relics to which miraculous properties are ascribed, the site of Marian apparitions, etc.\n\nConventual church\n\nA conventual church (or monastery church, minster, katholikon) is the main church building in a Christian monastery or abbey.\n\nCollegiate church\n\nA collegiate church is a church where the daily office of worship is maintained by a college of canons, which may be presided over by a dean or provost.\nCollegiate churches were often supported by extensive lands held by the church, or by tithe income from appropriated benefices. They commonly provide distinct spaces for congregational worship and for the choir offices of their clerical community.\n\nAlternative buildings\n\nOld and disused church buildings can be seen as an interesting proposition for developers as the architecture and location often provide for attractive homes or city centre entertainment venues On the other hand, many newer churches have decided to host meetings in public buildings such as schools, universities, cinemas or theatres.\n\nThere is another trend to convert old buildings for worship rather than face the construction costs and planning difficulties of a new build. Unusual venues in the UK include an old Tram power station, a former bus garage, an old cinema and bingo hall, a former Territorial Army Drill Hall, and a former synagogue. A windmill has also been converted into a church at Reigate Heath.\n\nThere has been an increase in partnerships between church management and private real estate companies to redevelop church properties into mixed uses. While it has garnered criticism from some, the partnership offers congregations the opportunity to increase revenue while preserving the property.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Church (building)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6325" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A church building or church house, often simply called a church, is a building used for Christian religious activities, particularly for worship services. The term in its architectural sense is most often used by Christians to refer to their religious buildings, but it is sometimes used (by analogy) to refer to buildings of other religions.Use of the term [http://www.britannica.com/EBchecked/topic/362167/Manichaeism \"The Manichaean Church\"], Encyclopædia Britannica In traditional Christian architecture, the church is often arranged in the shape of a Christian cross. When viewed from plan view the longest part of a cross is represented by the aisle and the junction of the cross is located at the altar area.\n\nTowers or domes are often added with the intention of directing the eye of the viewer towards the heavens and inspiring church visitors. Modern church buildings have a variety of architectural styles and layouts; many buildings that were designed for other purposes have now been converted for church use; and, similarly, many original church buildings have been put to other uses.\n\nThe earliest identified Christian church was a house church founded between 233 and 256. From the 11th through the 14th centuries, a wave of building of cathedrals and smaller parish churches occurred across Western Europe. A cathedral is a church, usually Roman Catholic, Anglican, Oriental Orthodox or Eastern Orthodox, housing a cathedra, the formal name for the seat or throne of a bishop.\n\nEtymology\n\nIn Greek, the adjective kyriak-ós/-ē/-ón means \"belonging, or pertaining, to a Kyrios\" (\"Lord\"), and the usage was adopted by early Christians of the Eastern Mediterranean with regard to anything pertaining to the Lord Jesus Christ: hence \"Kyriakós oíkos\" (\"house of the Lord\", church), \"Kyriakē\" (\"[the day] of the Lord\", i.e. Sunday), or \"Kyriakē proseukhē\" (the \"Lord's Prayer\").\n\nIn standard Greek usage, the older word \"ecclesia\" (ἐκκλησία, ekklesía, literally \"assembly\", \"congregation\", or the place where such a gathering occurs) was retained to signify both a specific edifice of Christian worship (a \"church\"), and the overall community of the faithful (the \"Church\"). This usage was also retained in Latin and the languages derived from Latin (e.g. French église, Italian chiesa, Spanish iglesia, Portuguese igreja, etc.), as well as in the Celtic languages (Welsh eglwys, Irish eaglais, Breton iliz, etc.) and in Turkish (kilise).\n\nIn the Germanic and some Slavic languages, the word kyriak-ós/-ē/-ón was adopted instead and derivatives formed thereof. In Old English the sequence of derivation started as \"cirice\" (Ki-ri-keh), then \"churche\" (kerke), and eventually \"church\" in its current pronunciation. German Kirche, Scots kirk, Russian церковь (tserkov), etc., are all similarly derived.\n\nHistory\n\nAntiquity\n\nAccording to the New Testament, the earliest Christians did not build church buildings. Instead, they gathered in homes ([https://www.biblegateway.com/passage/?searchActs%2017:5 Acts 17:5], [https://www.biblegateway.com/passage/?search\nActs+20%3A20&versionNIV 20:20], [https://www.biblegateway.com/passage/?search\n1+corinthians+16%3A19&versionNIV 1 Corinthians 16:19]) or in Jewish worship places like the Second Temple or synagogues ([https://www.biblegateway.com/passage/?search\nacts+2%3A46&versionNIV Acts 2:46], [https://www.biblegateway.com/passage/?search\nacts+19%3A8&version=NIV 19:8]). The earliest archeologically identified Christian church is a house church (domus ecclesiae), the Dura-Europos church, founded between 233 and 256. In the second half of the 3rd century CE, the first purpose-built halls for Christian worship (aula ecclesiae) began to be constructed. Although many of these were destroyed early in the next century during the Diocletianic Persecution, even larger and more elaborate church buildings began to appear during the reign of the Emperor Constantine the Great. (Chapter 3)\n\nMedieval times\n\nFrom the 11th through the 14th centuries, a wave of building of cathedrals and smaller parish churches occurred across Western Europe. In addition to being a place of worship, the cathedral or the parish church was used by the community in other ways. It could serve as a meeting place for guilds or a hall for banquets. Mystery plays were sometimes performed in cathedrals, and cathedrals might also be used for fairs. The church could be used as a place to thresh and store grain.\n\nRomanesque architecture \n\nBetween 1000 and 1200 AD the romanesque style became popular across Europe. While the name of the romanesque era refers to the tradition of Roman architecture, it was actually a West- and Central European trend. Romanesque buildings appear rather bulky and compact. Typical features are circular arches, round or octagonal towers and cushion capitals on the pillars. In the early romanesque era, coffering on the ceiling was fashionable, while later in the same era, groined vault was more popular. The rooms became wider and the motivs of sculptures became more epic.\n\nGothic architecture \n\nThe Gothic style emerged around 1140 in Île-de-France and spread through all of Europe. The gothic buildings were less compact than they had been in the romanesque era and often contained symbolic and allegoric features. For the first time, pointed arches, rib vaults and buttresses were used, with the result that massive walls were not longer needed to stabilise the building. Due to that advantage, the area of the windows became bigger, which resulted in a brighter and more friendly atmosphere inside the church. The nave became higher and so did the pillars and the church steeple. The amibition to test out the limits of the architectural possibilities resulted in the collapse of several towers. In Germany and the Netherlands, but also in Spain, it became popular to build hall churches, in which every vault has the same height.\n\nCathedrals were built in a very lavish way, as in the romanesque era. Examples for that are the Notre-Dame de Paris and the Notre-Dame de Reims in France, but also the San Francesco d’Assisi in Palermo, the Salisbury Cathedral and the Wool Church in Lavenham, England.\n\nMany gothic churches contain features from the romanesque era. Some of the most well-known gothic churches stayed unfinished for hundreds of years, after the gothic style was not popular anymore. About half of the Cologne Cathedral was for example build in the 19th century.\n\nRenaissance \n\nIn the 15th and 16th century, the change in ethics and society due to the renaissance and the reformation also influenced the building of churches. The common style was much like the gothic style, but in a simplified way. The basilica was not the most popular type of church anymore, but instead hall churches were built. Typical features are columns and classical capitals.\n\nIn Protestant churches, where the proclamation of God's Word is of special importance, the visitor's line of view is directed towards the pulpit.\n\nBaroque architecture \n\nThe baroque style was first used in Italy around 1575. From there it spread to the rest of Europe and to the European colonies. During the baroque era, the building industry increased heavily. Buildings, even churches, were used as indicators for wealth, authority and influence.The use of forms known from the renaissance were extremely exaggerated. Domes and capitals were decorated with moulding and the former stucco-sculptures were replaced by fresco paintings on the ceilings. For the first time, churches were seen as one connected work of art and consistent artistic concepts were developed. Instead of long buildings, more central-plan buildings were created. The sprawling decoration with floral ornamentation and mythological motives raised until about 1720 to the rococo era.\n\nThe Protestant parishes perfered lateral churches, in which all the visitors coud be as close as possible to the pulpit and the altar.\n\nArchitecture\n\nA common architecture for churches is the shape of a cross (a long central rectangle, with side rectangles, and a rectangle in front for the altar space or sanctuary). These churches also often have a dome or other large vaulted space in the interior to represent or draw attention to the heavens. Other common shapes for churches include a circle, to represent eternity, or an octagon or similar star shape, to represent the church's bringing light to the world. Another common feature is the spire, a tall tower on the \"west\" end of the church or over the crossing.\n\nAnother common feature of many Christian churches is the eastwards orientation of the front altar. \nOften, the altar will not be oriented due east, but in the direction of sunrise. This tradition origiates in Byzantium in the 4th century, and becomes prevalent in the West in the 8th to 9th century. \nThe old Roman custom of having the altar at the west end and the entrance at the east was sometimes followed as late as the 11th century even in areas of northern Europe under Frankish rule, as seen in Petershausen (Constance), Bamberg Cathedral, Augsburg Cathedral, Regensburg Cathedral, and Hildesheim Cathedral.[https://books.google.com/books?idsX8w667tblMC&pg\nPA12&dq%22XI+Jahrh+fortgedauert%22&hl\nen&saX&ved\n0ahUKEwir9NbtjObLAhWHDg8KHUFVA8kQ6AEIHDAA#vonepage&q\n%22XI%20Jahrh%20fortgedauert%22&f=false Heinrich Otte, Handbuch der kirchlichen Kunst-Archäologie des deutschen Mittelalters (Leipzig 1868), p. 12]\n\nTypes\n\nBasilica\n\nThe Latin word basilica (derived from Greek, Basiliké Stoà, Royal Stoa) was originally used to describe a Roman public building (as in Greece, mainly a tribunal), usually located in the forum of a Roman town.[https://books.google.com/books?id\nTe2dAAAAQBAJ&pg=PA117 The Oxford Dictionary of Christian Art and Architecture] (2013 ), p. 117\n\nAfter the Roman Empire became officially Christian, the term came by extension to refer to a large and important church that has been given special ceremonial rights by the Pope. Thus the word retains two senses today, one architectural and the other ecclesiastical.\n\nCathedral\n\nA cathedral is a church, usually Roman Catholic, Anglican, Oriental Orthodox or Eastern Orthodox, housing the seat of a bishop. The word cathedral takes its name from cathedra, or Bishop's Throne (In ). The term is sometimes (improperly) used to refer to any church of great size.\n\nA church that has the function of cathedral is not necessarily a large building. It might be as small as Christ Church Cathedral in Oxford, England, Sacred Heart Cathedral in Raleigh, United States, or Chur Cathedral in Switzerland. However, frequently, the cathedral along with some of the abbey churches, was the largest building in any region.\n\nPilgrimage church\n\nA pilgrimage church is a church to which pilgrimages are regularly made, or a church along a pilgrimage route, often located at the tomb of a saints, or holding icons or relics to which miraculous properties are ascribed, the site of Marian apparitions, etc.\n\nConventual church\n\nA conventual church (or monastery church, minster, katholikon) is the main church building in a Christian monastery or abbey.\n\nCollegiate church\n\nA collegiate church is a church where the daily office of worship is maintained by a college of canons, which may be presided over by a dean or provost.\nCollegiate churches were often supported by extensive lands held by the church, or by tithe income from appropriated benefices. They commonly provide distinct spaces for congregational worship and for the choir offices of their clerical community.\n\nAlternative buildings\n\nOld and disused church buildings can be seen as an interesting proposition for developers as the architecture and location often provide for attractive homes or city centre entertainment venues On the other hand, many newer churches have decided to host meetings in public buildings such as schools, universities, cinemas or theatres.\n\nThere is another trend to convert old buildings for worship rather than face the construction costs and planning difficulties of a new build. Unusual venues in the UK include an old Tram power station, a former bus garage, an old cinema and bingo hall, a former Territorial Army Drill Hall, and a former synagogue. A windmill has also been converted into a church at Reigate Heath.\n\nThere has been an increase in partnerships between church management and private real estate companies to redevelop church properties into mixed uses. While it has garnered criticism from some, the partnership offers congregations the opportunity to increase revenue while preserving the property. Church (building). http://en.wikipedia.org/?curid=6325."
  }
}
