{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9922",
  "eid" : "f2abe240-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778486884,
  "textBody" : "A societas Europaea ( SE; Latin: European society or company; plural: societates Europaeae) is a public company registered in accordance with the corporate law of the European Union (EU), introduced in 2004 with the Council Regulation on the Statute for a European Company. Such a company may more easily transfer to or merge with companies in other member states.\n\n2,943 registrations have been reported as of 6 February 2018, including the following nine components (18%) of the Euro Stoxx 50 stock market index of leading Euro Area companies (excluding the SE designation): Airbus, Allianz, BASF, E.ON, Fresenius, LVMH Moët Hennessy Louis Vuitton, SAP, Schneider Electric and Unibail-Rodamco.[http://ecdb.worker-participation.eu/show_factsheets.php?letterA&status_id\n3&title=Established%20SEs Societas Europaea registrations] seeurope-network.org\n\nNational law continues to supplement the basic rules in the Regulation on formation and mergers. The European Company Regulation is complemented by an Employee Involvement Directive that sets rules for participation by employees on the company's board of directors. There is also a statute allowing European Cooperative Societies.\n\nMain provisions\n\nFormation\n\nThe Statute provides four ways of forming a European limited company:A. Arlt, C. Bervoets, K. Grechenig, S. Kalss, The Societas Europaea in Relation to the Public Corporation of Five Member States (France, Italy, Netherlands, Spain, Austria), [http://ssrn.com/abstract=2404620 European Business Organization Law Review (EBOR) 2002, p. 733-764].\n# By merger of national companies from different member states\n# By the creation of a joint venture between companies (or other entities) in different member states\n# By the creation of an SE subsidiary of a national company\n# By the conversion of a national company into an SE\n\nFormation by merger is available only to public limited companies from different member states. Formation of an SE holding company is available to public and private limited companies with their registered offices in different member states or having subsidiaries or branches in member states other than that of their registered office. Formation of a joint subsidiary is available under the same circumstances to any legal entities governed by public or private law.\n\nMinimum capital\n\nThe SE must have a minimum subscribed capital of €120,000 as per article 4(2) of the directive, subject to the provision that where a member state requires a larger capital for companies exercising certain types of activities, the same requirement will also apply to an SE with its registered office in that member state (article 4(3)).\n\nRegistered office\n\nThe registered office of the SE designated in the statutes must be the place where it has its central administration, that is to say its true centre of operations. The SE may transfer its registered office within the Community without dissolving the company in one member state in order to form a new one in another member state; however, such a transfer is subject to the provisions of 8 which require, inter alia, the drawing up of a transfer proposal, a report justifying the legal and economic aspects of the transfer and the issuing, by the competent authority in the member state in which the SE is registered, of a certificate attesting to the completion of the required acts and formalities.\n\nLaws applicable\n\nThe order of precedence of the laws applicable to the SE is clarified.\n\nRegistration and liquidation\n\nThe registration and completion of the liquidation of an SE must be disclosed for information purposes in the Official Journal of the European Communities. Every SE must be registered in the State where it has its registered office, in a register designated by the law of that State.\n\nStatutes\n\nThe Statutes of the SE must provide as governing bodies the general meeting of shareholders and either a management board and a supervisory board (two-tier system) or an administrative board (single-tier system).\nUnder the two-tier system the SE is managed by a management board. The member or members of the management board have the power to represent the company in dealings with third parties and in legal proceedings. They are appointed and removed by the supervisory board. No person may be a member of both the management board and the supervisory board of the same company at the same time. But the supervisory board may appoint one of its members to exercise the functions of a member of the management board in the event of absence through holidays. During such a period the function of the person concerned as a member of the supervisory board shall be suspended.\nUnder the single-tier system, the SE is managed by an administrative board. The member or members of the administrative board have the power to represent the company in dealings with third parties and in legal proceedings. Under the single-tier system the administrative board may delegate the power of management to one or more of its members.\n\nThe following operations require the authorization of the supervisory board or the deliberation of the administrative board:\n* any investment project requiring an amount more than the percentage of subscribed capital\n* the conclusion of supply and performance contracts where the total turnover provided for therein is more than the percentage of turnover for the previous financial year\n* the raising or granting of loans, the issue of debt securities and the assumption of liabilities of a third party or suretyship for a third party where the total money value in each case is more than the percentage of subscribed capital\n* the setting-up, acquisition, disposal or closing down of undertakings, businesses or parts of businesses where the purchase price or disposal proceeds account for more than the percentage of subscribed capital\n* the percentage referred to above is to be determined by the Statutes of the SE. It may not be less than 5% nor more than 25%.\n\nAnnual accounts\n\nThe SE must draw up annual accounts comprising the balance sheet, the profit and loss account, and the notes to the accounts, and an annual report giving a fair view of the company's business and of its position; consolidated accounts may also be required.\n\nTaxation\n\nIn tax matters, the SE is treated the same as any other multinational, i.e., it is subject to the tax regime of the national legislation applicable to the company and its subsidiaries. SEs are subject to taxes and charges in all member states where their administrative centres are situated. Thus, their tax status is not perfect as there is still no adequate harmonization at European level.\n\nWinding-up\n\nWinding-up, liquidation, insolvency, and suspension of payments are in large measure to be governed by national law. When an SE transfers its registered office outside the Community, or in any other manner no longer complies with requirements of article 7, the member state must take appropriate measures to ensure compliance or take necessary measures to ensure that the SE is liquidated.\n\nStatus of the legislation and implementation\n\nCouncil Regulation (EC) No 2157/2001 of 8 October 2001 on the Statute for a European company (SE).\n\nCouncil Directive 2001/86/EC of 8 October 2001 supplementing the Statute for a European company with regard to the involvement of employees.\n\nSee also: Europa's collection of press releases, regulations, directives and FAQs on the European Company Statute.\n\nUnited Kingdom\n\nUK Statutory Instrument 2004 No. 2326. The European Public Limited-Liability Company Regulations 2004 came into force on 8 October and gave effect to the European Company Statute Regulation (Council Regulation EC no.2157/2001), which gives the framework for a new form of company, the European Public Limited-Liability Company or Societas Europaea (SE). The regulations are available in full text on the HMSO website.\n\nUK Statutory Instrument 2004 no. 2407. The European Public Limited-Liability Company (Fees) Regulations 2004 also came into force on 8 October 2004. An explanatory memorandum on the Fees Regulations describe them as setting out \"the fees payable in connection with the services and facilities provided by the DTI in respect of a new form of company, the European Public Limited-Liability Company or 'Societas Europaea' (SE).\"\n\nEmployee participation\n\nThe regulation is complemented by the Council Directive supplementing the Statute for a European Company with regard to the involvement of employees (informally \"Council Directive on Employee Participation\"), adopted 8 October 2001. The directive establishes rules on worker involvement in the management of the SE.\n\nEU member states differ in the degree of worker involvement in corporate management. In Germany, most large corporations are required to allow employees to elect a certain percentage of seats on the supervisory board. Other member states, such as the UK, have no such requirement, and furthermore in these states such practices are largely unknown and considered a threat to the rights of management.\n\nThese differing traditions of worker involvement have held back the adoption of the Statute for over a decade. States without worker involvement provisions were afraid that the SE might lead to having such provisions being imposed on their companies; and states with those provisions were afraid they might lead to those provisions being circumvented.\n\nA compromise, contained in the Directive, was worked out as follows: worker involvement provisions in the SE will be decided upon by negotiations between employees and management before the creation of the SE. If agreement cannot be reached, provisions contained in the Directive will apply. The Directive provides for worker involvement in the SE if a minimum percentage of employees from the entities coming together to form the SE enjoyed worker involvement provisions. The Directive permits member states to not implement these default worker involvement provisions in their national law, but then an SE cannot be created in that member state if the provisions in the Directive would apply and negotiations between workers and management are unsuccessful.\n\nDefinition\n\nDefinition of employee participation: it does not mean participation in day-to-day decisions, which are a matter for the management, but participation in the supervision and strategic development of the company.\n\nParticipation\n\n* If the two parties do not reach a satisfactory arrangement, a set of standard principles set out in the Annex to the Directive becomes applicable.\n* Several models of participation are possible: firstly, a model in which the employees form part of the supervisory board or of the administrative board, as the case may be; secondly, a model in which the employees are represented by a separate body; and finally, other models to be agreed between the management or administrative boards of the founder companies and the employees or their representatives in those companies, the level of information and consultation being the same as in the case of the second model. The general meeting may not approve the formation of an SE unless one of the models of participation defined in the Directive has been chosen.\n* The employees' representatives must be provided with such financial and material resources and other facilities as enable them to perform their duties properly.\n* With regard to a European company formed through a merger, the standard principles relating to worker participation will apply where at least 25% of the employees had the right to participate in decisions before the merger. Here a political agreement proved impossible until the Nice summit in December 2000. The compromise adopted by the Heads of State or Governments allowed a member state not to apply the Directive to SEs formed from a merger, in which case the SE could not be registered in the member state in question unless an agreement had been concluded between the management and employees, or that no SE employee had the right of participation before the formation of the SE.\n\nEmployment contracts and pensions\n\nEmployment contracts and pensions are not covered by the Directive. With regard to occupational pension schemes, the SE is covered by the provisions laid down in the proposal for a directive on institutions for occupational schemes, presented by the Commission in October 2000, in particular in connection with the possibility of introducing a single pension scheme for all their employees in the European Union.\n\nDevelopment\n\nTwo approaches have been attempted to solve the problems cited above. One approach is to harmonize the company law of the member states. This approach has had some successes, but after thirty years only limited progress has been made. It is difficult to harmonize widely different regulatory systems, especially when they reflect different national attitudes to issues such as worker involvement in the management of the company.\n\nThe other approach is to construct a whole new system of EU company law, that co-exists with the individual company laws of the member states. Companies would have the choice of operating either under national regulations or under the EU-wide system. However, this approach has been only somewhat more effective than the harmonization approach: while states are not as concerned about having foreign traditions of corporate governance imposed on their companies, which the harmonization approach could well entail; they also wish to ensure that the EU-wide system would be palatable to the traditions of their national companies, so that they will not be put at a disadvantage compared to the other member states.\n\nThe European Company Statute represents a step in this direction, albeit a limited one. While it establishes some common EU rules on the SE, these rules are incomplete, and the holes in the rules are to be filled in using the law of the member state in which the SE is registered. This has been due to the difficulties of agreeing on common European rules on these issues.\n\nRegistrations\n\nIn terms of registrations, the Czech Republic is vastly overrepresented, accounting for 79% of all societates Europaeae as of December 2015. 9 of the 50 constituents of the Euro Stoxx 50 stock market index of leading Euro Area companies are as of December 2015 societates Europaeae.\n\nAnnual registrations by member state are presented in the following chart:\n\nRegistrations of new societates are to be published in the Official Journal of the European Union. There is no official union-wide register of societates, as they are registered in the nation in which their corporate seats are located. [http://ecdb.worker-participation.eu worker-participation.eu] does however maintain a database of current and planned registrations. Examples of companies include:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Societas Europaea" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9922" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A societas Europaea ( SE; Latin: European society or company; plural: societates Europaeae) is a public company registered in accordance with the corporate law of the European Union (EU), introduced in 2004 with the Council Regulation on the Statute for a European Company. Such a company may more easily transfer to or merge with companies in other member states.\n\n2,943 registrations have been reported as of 6 February 2018, including the following nine components (18%) of the Euro Stoxx 50 stock market index of leading Euro Area companies (excluding the SE designation): Airbus, Allianz, BASF, E.ON, Fresenius, LVMH Moët Hennessy Louis Vuitton, SAP, Schneider Electric and Unibail-Rodamco.[http://ecdb.worker-participation.eu/show_factsheets.php?letterA&status_id\n3&title=Established%20SEs Societas Europaea registrations] seeurope-network.org\n\nNational law continues to supplement the basic rules in the Regulation on formation and mergers. The European Company Regulation is complemented by an Employee Involvement Directive that sets rules for participation by employees on the company's board of directors. There is also a statute allowing European Cooperative Societies.\n\nMain provisions\n\nFormation\n\nThe Statute provides four ways of forming a European limited company:A. Arlt, C. Bervoets, K. Grechenig, S. Kalss, The Societas Europaea in Relation to the Public Corporation of Five Member States (France, Italy, Netherlands, Spain, Austria), [http://ssrn.com/abstract=2404620 European Business Organization Law Review (EBOR) 2002, p. 733-764].\n# By merger of national companies from different member states\n# By the creation of a joint venture between companies (or other entities) in different member states\n# By the creation of an SE subsidiary of a national company\n# By the conversion of a national company into an SE\n\nFormation by merger is available only to public limited companies from different member states. Formation of an SE holding company is available to public and private limited companies with their registered offices in different member states or having subsidiaries or branches in member states other than that of their registered office. Formation of a joint subsidiary is available under the same circumstances to any legal entities governed by public or private law.\n\nMinimum capital\n\nThe SE must have a minimum subscribed capital of €120,000 as per article 4(2) of the directive, subject to the provision that where a member state requires a larger capital for companies exercising certain types of activities, the same requirement will also apply to an SE with its registered office in that member state (article 4(3)).\n\nRegistered office\n\nThe registered office of the SE designated in the statutes must be the place where it has its central administration, that is to say its true centre of operations. The SE may transfer its registered office within the Community without dissolving the company in one member state in order to form a new one in another member state; however, such a transfer is subject to the provisions of 8 which require, inter alia, the drawing up of a transfer proposal, a report justifying the legal and economic aspects of the transfer and the issuing, by the competent authority in the member state in which the SE is registered, of a certificate attesting to the completion of the required acts and formalities.\n\nLaws applicable\n\nThe order of precedence of the laws applicable to the SE is clarified.\n\nRegistration and liquidation\n\nThe registration and completion of the liquidation of an SE must be disclosed for information purposes in the Official Journal of the European Communities. Every SE must be registered in the State where it has its registered office, in a register designated by the law of that State.\n\nStatutes\n\nThe Statutes of the SE must provide as governing bodies the general meeting of shareholders and either a management board and a supervisory board (two-tier system) or an administrative board (single-tier system).\nUnder the two-tier system the SE is managed by a management board. The member or members of the management board have the power to represent the company in dealings with third parties and in legal proceedings. They are appointed and removed by the supervisory board. No person may be a member of both the management board and the supervisory board of the same company at the same time. But the supervisory board may appoint one of its members to exercise the functions of a member of the management board in the event of absence through holidays. During such a period the function of the person concerned as a member of the supervisory board shall be suspended.\nUnder the single-tier system, the SE is managed by an administrative board. The member or members of the administrative board have the power to represent the company in dealings with third parties and in legal proceedings. Under the single-tier system the administrative board may delegate the power of management to one or more of its members.\n\nThe following operations require the authorization of the supervisory board or the deliberation of the administrative board:\n* any investment project requiring an amount more than the percentage of subscribed capital\n* the conclusion of supply and performance contracts where the total turnover provided for therein is more than the percentage of turnover for the previous financial year\n* the raising or granting of loans, the issue of debt securities and the assumption of liabilities of a third party or suretyship for a third party where the total money value in each case is more than the percentage of subscribed capital\n* the setting-up, acquisition, disposal or closing down of undertakings, businesses or parts of businesses where the purchase price or disposal proceeds account for more than the percentage of subscribed capital\n* the percentage referred to above is to be determined by the Statutes of the SE. It may not be less than 5% nor more than 25%.\n\nAnnual accounts\n\nThe SE must draw up annual accounts comprising the balance sheet, the profit and loss account, and the notes to the accounts, and an annual report giving a fair view of the company's business and of its position; consolidated accounts may also be required.\n\nTaxation\n\nIn tax matters, the SE is treated the same as any other multinational, i.e., it is subject to the tax regime of the national legislation applicable to the company and its subsidiaries. SEs are subject to taxes and charges in all member states where their administrative centres are situated. Thus, their tax status is not perfect as there is still no adequate harmonization at European level.\n\nWinding-up\n\nWinding-up, liquidation, insolvency, and suspension of payments are in large measure to be governed by national law. When an SE transfers its registered office outside the Community, or in any other manner no longer complies with requirements of article 7, the member state must take appropriate measures to ensure compliance or take necessary measures to ensure that the SE is liquidated.\n\nStatus of the legislation and implementation\n\nCouncil Regulation (EC) No 2157/2001 of 8 October 2001 on the Statute for a European company (SE).\n\nCouncil Directive 2001/86/EC of 8 October 2001 supplementing the Statute for a European company with regard to the involvement of employees.\n\nSee also: Europa's collection of press releases, regulations, directives and FAQs on the European Company Statute.\n\nUnited Kingdom\n\nUK Statutory Instrument 2004 No. 2326. The European Public Limited-Liability Company Regulations 2004 came into force on 8 October and gave effect to the European Company Statute Regulation (Council Regulation EC no.2157/2001), which gives the framework for a new form of company, the European Public Limited-Liability Company or Societas Europaea (SE). The regulations are available in full text on the HMSO website.\n\nUK Statutory Instrument 2004 no. 2407. The European Public Limited-Liability Company (Fees) Regulations 2004 also came into force on 8 October 2004. An explanatory memorandum on the Fees Regulations describe them as setting out \"the fees payable in connection with the services and facilities provided by the DTI in respect of a new form of company, the European Public Limited-Liability Company or 'Societas Europaea' (SE).\"\n\nEmployee participation\n\nThe regulation is complemented by the Council Directive supplementing the Statute for a European Company with regard to the involvement of employees (informally \"Council Directive on Employee Participation\"), adopted 8 October 2001. The directive establishes rules on worker involvement in the management of the SE.\n\nEU member states differ in the degree of worker involvement in corporate management. In Germany, most large corporations are required to allow employees to elect a certain percentage of seats on the supervisory board. Other member states, such as the UK, have no such requirement, and furthermore in these states such practices are largely unknown and considered a threat to the rights of management.\n\nThese differing traditions of worker involvement have held back the adoption of the Statute for over a decade. States without worker involvement provisions were afraid that the SE might lead to having such provisions being imposed on their companies; and states with those provisions were afraid they might lead to those provisions being circumvented.\n\nA compromise, contained in the Directive, was worked out as follows: worker involvement provisions in the SE will be decided upon by negotiations between employees and management before the creation of the SE. If agreement cannot be reached, provisions contained in the Directive will apply. The Directive provides for worker involvement in the SE if a minimum percentage of employees from the entities coming together to form the SE enjoyed worker involvement provisions. The Directive permits member states to not implement these default worker involvement provisions in their national law, but then an SE cannot be created in that member state if the provisions in the Directive would apply and negotiations between workers and management are unsuccessful.\n\nDefinition\n\nDefinition of employee participation: it does not mean participation in day-to-day decisions, which are a matter for the management, but participation in the supervision and strategic development of the company.\n\nParticipation\n\n* If the two parties do not reach a satisfactory arrangement, a set of standard principles set out in the Annex to the Directive becomes applicable.\n* Several models of participation are possible: firstly, a model in which the employees form part of the supervisory board or of the administrative board, as the case may be; secondly, a model in which the employees are represented by a separate body; and finally, other models to be agreed between the management or administrative boards of the founder companies and the employees or their representatives in those companies, the level of information and consultation being the same as in the case of the second model. The general meeting may not approve the formation of an SE unless one of the models of participation defined in the Directive has been chosen.\n* The employees' representatives must be provided with such financial and material resources and other facilities as enable them to perform their duties properly.\n* With regard to a European company formed through a merger, the standard principles relating to worker participation will apply where at least 25% of the employees had the right to participate in decisions before the merger. Here a political agreement proved impossible until the Nice summit in December 2000. The compromise adopted by the Heads of State or Governments allowed a member state not to apply the Directive to SEs formed from a merger, in which case the SE could not be registered in the member state in question unless an agreement had been concluded between the management and employees, or that no SE employee had the right of participation before the formation of the SE.\n\nEmployment contracts and pensions\n\nEmployment contracts and pensions are not covered by the Directive. With regard to occupational pension schemes, the SE is covered by the provisions laid down in the proposal for a directive on institutions for occupational schemes, presented by the Commission in October 2000, in particular in connection with the possibility of introducing a single pension scheme for all their employees in the European Union.\n\nDevelopment\n\nTwo approaches have been attempted to solve the problems cited above. One approach is to harmonize the company law of the member states. This approach has had some successes, but after thirty years only limited progress has been made. It is difficult to harmonize widely different regulatory systems, especially when they reflect different national attitudes to issues such as worker involvement in the management of the company.\n\nThe other approach is to construct a whole new system of EU company law, that co-exists with the individual company laws of the member states. Companies would have the choice of operating either under national regulations or under the EU-wide system. However, this approach has been only somewhat more effective than the harmonization approach: while states are not as concerned about having foreign traditions of corporate governance imposed on their companies, which the harmonization approach could well entail; they also wish to ensure that the EU-wide system would be palatable to the traditions of their national companies, so that they will not be put at a disadvantage compared to the other member states.\n\nThe European Company Statute represents a step in this direction, albeit a limited one. While it establishes some common EU rules on the SE, these rules are incomplete, and the holes in the rules are to be filled in using the law of the member state in which the SE is registered. This has been due to the difficulties of agreeing on common European rules on these issues.\n\nRegistrations\n\nIn terms of registrations, the Czech Republic is vastly overrepresented, accounting for 79% of all societates Europaeae as of December 2015. 9 of the 50 constituents of the Euro Stoxx 50 stock market index of leading Euro Area companies are as of December 2015 societates Europaeae.\n\nAnnual registrations by member state are presented in the following chart:\n\nRegistrations of new societates are to be published in the Official Journal of the European Union. There is no official union-wide register of societates, as they are registered in the nation in which their corporate seats are located. [http://ecdb.worker-participation.eu worker-participation.eu] does however maintain a database of current and planned registrations. Examples of companies include:. Societas Europaea. http://en.wikipedia.org/?curid=9922."
  }
}
