{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14263",
  "eid" : "134119d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778541549,
  "textBody" : "In mathematics, Horner's method (also known as Horner scheme in the UK or Horner's rule in the U.S..) is either of two things:\n* an algorithm for calculating polynomials, which consists of transforming the monomial form into a computationally efficient form; or\n* a method for approximating the roots of a polynomial.\nThe latter is also known as Ruffini–Horner's method.See Méthode de Ruffini-Horner on French Wikipedia.\n\nThese methods are named after the British mathematician William George Horner, although they were known before him by Paolo Ruffini. and, six hundred years earlier, by the Chinese mathematician Qin Jiushao.It is obvious that this procedure is a Chinese invention, in .\n\nDescription of the algorithm \n\nGiven the polynomial\n\np(x) \\sum_{i\n0}^n a_i x^i = a_0 + a_1 x + a_2 x^2 + a_3 x^3 + \\cdots + a_n x^n,\n\nwhere a_0, \\ldots, a_n are real numbers, we wish to evaluate the polynomial at a specific value of x, say x_0.\n\nTo accomplish this, we define a new sequence of constants as follows:\n\n\\begin{align}\nb_n & := a_n \\\\\nb_{n-1} & := a_{n-1} + b_n x_0 \\\\\n& {}\\  \\  \\vdots \\\\\nb_0 & := a_0 + b_1 x_0.\n\\end{align}\n\nThen b_0 is the value of p(x_0).\n\nTo see why this works, note that the polynomial can be written in the form\n\np(x) = a_0 + x(a_1 + x(a_2 + \\cdots + x(a_{n-1} + a_n x))). \n\nThus, by iteratively substituting the b_i into the expression,\n\n\\begin{align}\np(x_0) & = a_0 + x_0(a_1 + x_0(a_2 + \\cdots + x_0(a_{n-1} + b_n x_0))) \\\\\n& = a_0 + x_0(a_1 + x_0(a_2 + \\cdots + x_0(b_{n-1}))) \\\\\n& {} \\ \\  \\vdots \\\\\n& = a_0 + x_0(b_1) \\\\\n& = b_0.\n\\end{align}\n\nExamples \n\nEvaluate f(x)2x^3-6x^2+2x-1 for x\n3.\n\nWe use synthetic division as follows:\n\n  x0│   x3    x2    x1    x0\n  3 │   2    −6     2    −1\n    │         6     0     6\n    └────────────────────────\n        2     0     2     5\n\nThe entries in the third row are the sum of those in the first two. Each entry in the second row is the product of the x-value (3 in this example) with the third-row entry immediately to the left. The entries in the first row are the coefficients of the polynomial to be evaluated. Then the remainder of f(x) on division by x-3 is 5.\n\nBut by the polynomial remainder theorem, we know that the remainder is f(3) . Thus f(3) = 5\n\nIn this example, if a_3 2, a_2 \n -6, a_1 2, a_0 \n -1 we can see that b_3 2, b_2 \n 0, b_1 2, b_0 \n 5 , the entries in the third row. So, synthetic division is based on Horner's method.\n\nAs a consequence of the polynomial remainder theorem, the entries in the third row are the coefficients of the second-degree polynomial, the quotient of f(x) on division by  x-3 . \nThe remainder is 5. This makes Horner's method useful for polynomial long division.\n\nDivide x^3-6x^2+11x-6 by x-2:\n\n  2 │   1    −6    11    −6\n    │         2    −8     6\n    └────────────────────────\n        1    −4     3     0\n\nThe quotient is x^2-4x+3.\n\nLet f_1(x)4x^4-6x^3+3x-5 and f_2(x)\n2x-1. Divide f_1(x) by f_2\\,(x) using Horner's method.\n\n   2 │  4    −6    0    3   │   −5\n ────┼──────────────────────┼───────\n   1 │        2   −2   −1   │    1\n     └──────────────────────┼───────\n        2    −2   −1    1   │   −4\n\nThe third row is the sum of the first two rows, divided by 2. Each entry in the second row is the product of 1 with the third-row entry to the left. The answer is\n\n\\frac{f_1(x)}{f_2(x)}=2x^3-2x^2-x+1-\\frac{4}{2x-1}.\n\nFloating point multiplication and division\n\nHorner's method is a fast, code-efficient method for multiplication and division of binary numbers on a microcontroller with no hardware multiplier.  One of the binary numbers to be multiplied is represented as a trivial polynomial, where, (using the above notation):  ai 1, and x \n 2.  Then, x (or x to some power) is repeatedly factored out.  In this binary numeral system (base 2), x = 2, so powers of 2 are repeatedly factored out.\n\nExample\n\nFor example, to find the product of two numbers, (0.15625) and m:\n\n\\begin{align}\n( 0.15625) m & (0.00101_b) m \n ( 2^{-3} + 2^{-5}) m = (2^{-3})m + (2^{-5})m \\\\[4pt]\n& 2^{-3} (m + (2^{-2})m) \n 2^{-3} (m + 2^{-2} (m)).\n\\end{align}\n\nMethod\n\nTo find the product of two binary numbers, d and m:\n*1. A register holding the intermediate result is initialized to d.\n*2. Begin with the least significant (rightmost) non-zero bit in m.\n**2b. Count (to the left) the number of bit positions to the next most significant non-zero bit.  If there are no more-significant bits, then take the value of the current bit position.\n**2c. Using that value, perform a left-shift operation by that number of bits on the register holding the intermediate result\n*3. If all the non-zero bits were counted, then the intermediate result register now holds the final result.  Otherwise, add d to the intermediate result, and continue in step #2 with the next most significant bit in m.\n\nDerivation\n\nIn general, for a binary number with bit values: ( d_3 d_2 d_1 d_0 ) the product is:\n (d_3 2^3 + d_2 2^2 + d_1 2^1 + d_0 2^0)m = d_3 2^3 m + d_2 2^2 m + d_1 2^1 m + d_0 2^0 m \nAt this stage in the algorithm, it is required that terms with zero-valued coefficients are dropped, so that only binary coefficients equal to one are counted, thus the problem of multiplication or division by zero is not an issue, despite this implication in the factored equation:\n\n = d_0\\left(m + 2 \\frac{d_1}{d_0} \\left(m + 2 \\frac{d_2}{d_1} \\left(m + 2 \\frac{d_3}{d_2} (m)\\right)\\right)\\right). \n\nThe denominators all equal one (or the term is absent), so this reduces to:\n = d_0(m + 2 {d_1} (m + 2 {d_2} (m + 2 {d_3} (m)))),\nor equivalently (as consistent with the \"method\" described above):\n = d_3(m + 2^{-1} {d_2} (m + 2^{-1}{d_1} (m + {d_0} (m)))). \n\nIn binary (base 2) math, multiplication by a power of 2 is merely a register shift operation.  Thus, multiplying by 2 is calculated in base-2 by an arithmetic shift.  The factor (2−1) is a right arithmetic shift, a (0) results in no operation (since 20 = 1, is the multiplicative identity element), and a (21) results in a left arithmetic shift.\nThe multiplication product can now be quickly calculated using only arithmetic shift operations, addition and subtraction.\n\nThe method is particularly fast on processors supporting a single-instruction shift-and-addition-accumulate.  Compared to a C floating-point library, Horner's method sacrifices some accuracy, however it is nominally 13 times faster (16 times faster when the \"canonical signed digit\" (CSD) form is used), and uses only 20% of the code space..\n\nPolynomial root finding \n\nUsing Horner's method in combination with Newton's method, it is possible to approximate the real roots of a polynomial. The algorithm works as follows. Given a polynomial p_n(x) of degree n with zeros  z_n  make some initial guess  x_0  such that  x_0 > z_1 . Now iterate the following two steps:\n\n1. Using Newton's method, find the largest zero z_1 of p_n(x) using the guess x_0.\n\n2. Using Horner's method, divide out (x-z_1) to obtain p_{n-1}. Return to step 1 but use the polynomial p_{n-1} and the initial guess z_1.\n\nThese two steps are repeated until all real zeros are found for the polynomial. If the approximated zeros are not precise enough, the obtained values can be used as initial guesses for Newton's method but using the full polynomial rather than the reduced polynomials..\n\nExample \n\nConsider the polynomial\n\np_6(x) = (x-3)(x+3)(x+5)(x+8)(x-2)(x-7)\n\nwhich can be expanded to\n\np_6(x) = x^6 + 4x^5 - 72x^4 -214x^3 + 1127x^2 + 1602x -5040.\n\nFrom the above we know that the largest root of this polynomial is 7 so we are able to make an initial guess of 8. Using Newton's method the first zero of 7 is found as shown in black in the figure to the right. Next p(x) is divided by (x-7) to obtain\n\np_5(x) = x^5 + 11x^4 + 5x^3 - 179x^2 - 126x + 720\n\nwhich is drawn in red in the figure to the right. Newton's method is used to find the largest zero of this polynomial with an initial guess of 7. The largest zero of this polynomial which corresponds to the second largest zero of the original polynomial is found at 3 and is circled in red. The degree 5 polynomial is now divided by (x-3) to obtain\n\np_4(x) = x^4 + 14x^3 + 47x^2 - 38x - 240\n\nwhich is shown in yellow. The zero for this polynomial is found at 2 again using Newton's method and is circled in yellow. Horner's method is now used to obtain\n\np_3(x) = x^3 + 16x^2 + 79x + 120\n\nwhich is shown in green and found to have a zero at −3. This polynomial is further reduced to\n\np_2(x) = x^2 + 13x + 40\n\nwhich is shown in blue and yields a zero of −5. The final root of the original polynomial may be found by either using the final zero as an initial guess for Newton's method, or by reducing p_2(x) and solving the linear equation. As can be seen, the expected roots of −8, −5, −3, 2, 3, and 7 were found.\n\nOctave implementation \n\nThe following Octave code was used in the example above to implement Horner's method.\n\nfunction [y b] = horner(a,x)\n  % Input a is the polynomial coefficient vector, x the value to be evaluated at.\n  % The output y is the evaluated polynomial and b the divided coefficient vector.\n  b(1) = a(1);\n  for i = 2:length(a)\n    b(i) = a(i)+x*b(i-1);\n  end\n  y = b(length(a));\n  b = b(1:length(b)-1);\nend\n\nPython implementation \n\nThe following Python code implements Horner's method.\n\ndef horner(x, *polynomial):\n    \"\"\"A function that implements the Horner Scheme for evaluating a\n    polynomial of coefficients *polynomial in x.\"\"\"\n    result = 0\n    for coefficient in polynomial:\n        result = result * x + coefficient\n    return result\n\nC implementation \n\nThe following C code implements Horner's method.\n\ndouble HornerEvaluate (double x, double * CoefficientsOfPolynomial, unsigned int DegreeOfPolynomial)\n{\n    /*\n        We want to evaluate the polynomial in x, of coefficients CoefficientsOfPolynomial, using Horner's method.\n        The result is stored in dbResult.\n    */\n    double dbResult = 0.0;\n    int i;\n    for(i DegreeOfPolynomial; i >\n 0; i--)\n    {\n        dbResult = dbResult * x + CoefficientsOfPolynomial[i];\n    }\n    return dbResult;\n}\n\nHere is a slightly optimized version using explicit fused Multiply–accumulate operation, often execute faster than the above when running on a computer built with a processor supporting FMA instruction:\n\n// gcc -std=c11 -lm horner.c -o horner\n#include \n\ndouble horner_fma(double x, const double *coeffs, size_t count)\n{\n    double result = 0.0;\n    for (int idx count-1; idx >\n 0; idx--)\n        result = fma(result, x, coeffs[idx]);\n    return result;\n}\n\n C# implementation \n\nThe following C# code implements Horner's method.\n\npublic double HornerEvaluate(int[] numbers, double x)\n{\n\tdouble result = 0;\n\t\n\tfor(int i numbers.Length - 1; i >\n 0; i--)\n\t{\n\t\tresult = result * x + numbers[i];\n\t}\n\t\n\treturn result;\n}\n\nApplication \n\nHorner's method can be used to convert between different positional numeral systems – in which case x is the base of the number system, and the ai coefficients are the digits of the base-x representation of a given number – and can also be used if x is a matrix, in which case the gain in computational efficiency is even greater. In fact, when x is a matrix, further acceleration is possible which exploits the structure of matrix multiplication, and only \\sqrt{n} instead of n multiplies are needed (at the expense of requiring more storage) using the 1973 method of Paterson and Stockmeyer..\n\nEfficiency \n\nEvaluation using the monomial form of a degree-n polynomial requires at most n additions and (n2 + n)/2 multiplications, if powers are calculated by repeated multiplication and each monomial is evaluated individually.  (This can be reduced to n additions and 2n − 1 multiplications by evaluating the powers of x iteratively.)  If numerical data are represented in terms of digits (or bits), then the naive algorithm also entails storing approximately 2n times the number of bits of x (the evaluated polynomial has approximate magnitude xn, and one must also store xn itself).  By contrast, Horner's method requires only n additions and n multiplications, and its storage requirements are only n times the number of bits of x. Alternatively, Horner's method can be computed with n fused multiply–adds.  Horner's method can also be extended to evaluate the first k derivatives of the polynomial with kn additions and multiplications..\n\nHorner's method is optimal, in the sense that any algorithm to evaluate an arbitrary polynomial must use at least as many operations. Alexander Ostrowski proved in 1954 that the number of additions required is minimal.. Victor Pan proved in 1966 that the number of multiplications is minimal.. However, when x is a matrix, Horner's method is not optimal.\n\nThis assumes that the polynomial is evaluated in monomial form and no preconditioning of the representation is allowed, which makes sense if the polynomial is evaluated only once. However, if preconditioning is allowed and the polynomial is to be evaluated many times, then faster algorithms are possible. They involve a transformation of the representation of the polynomial. In general, a degree-n polynomial can be evaluated using only {\\scriptstyle{\\left\\lfloor n/2 \\right\\rfloor + 2}} multiplications and n additions..\n\nHistory \n\nHorner's paper entitled \"A new method of solving numerical equations of all orders, by continuous approximation\". was read before the Royal Society of London, at its meeting on July 1, 1819, with Davies Gilbert, Vice-President and Treasurer, in the chair; this was the final [http://hdl.handle.net/2027/mdp.39015014105277?urlappend\n%3Bseq158 meeting] of the session before the Society adjorned for its Summer recess. When a sequel was read before the Society in 1823, it was again at the final meeting of the session. On both occasions, papers by James Ivory, FRS, were also read. In 1819, it was Horner's paper that got through to publication in the \"Philosophical Transactions\". later in the year, Ivory's paper falling by the way, despite Ivory being a Fellow; in 1823, when a total of ten papers were read, fortunes as regards publication, were reversed. But Gilbert, who had strong connections with the West of England and may have had social contact with Horner, resident as Horner was in Bristol and Bath, published his own [http://turing.une.edu.au/~ernie/Horner/Gilbert1823QJSLA.pdf survey] of Horner-type methods earlier in 1823.\n\nHorner's paper in Part II of Philosophical Transactions of the Royal Society of London for 1819 was warmly and expansively welcomed by a [http://turing.une.edu.au/~ernie/Horner/Horner1820MonthlyRev91-4.pdf reviewer] in the issue of The Monthly Review: or, Literary Journal for April, 1820; in comparison, a technical paper by Charles Babbage is dismissed curtly in this review. However, the reviewer noted that another, similar method had also recently been published by the architect and mathematical expositor, Peter Nicholson. This theme is developed in a further [http://turing.une.edu.au/~ernie/Horner/Horner1820MonthlyRev93-12.pdf review] of some of Nicholson's books in the issue of The Monthly Review for December, 1820, which in turn ends with notice of the appearance of a booklet by Theophilus Holdred, from whom Nicholson acknowledges he obtained the gist of his approach in the first place, although claiming to have improved upon it. The sequence of reviews is concluded in the issue of The Monthly Review for September, 1821, with the [http://turing.une.edu.au/~ernie/Horner/Horner1821MonthlyRev96-9.pdf reviewer] concluding that whereas Holdred was the first person to discover a direct and general practical solution of numerical equations, he had not reduced it to its simplest form by the time of Horner's publication, and saying that had Holdred published forty years earlier when he first discovered his method, his contribution could be more easily recognized. The reviewer is exceptionally well-informed, even having sighted Horner's preparatory correspondence with Peter Barlow in 1818, seeking work of Budan. The Bodlean Library, Oxford has the Editor's annotated copy of The Monthly Review from which it is clear that the most active reviewer in mathematics in 1814 and 1815 (the last years for which this information has been published) was none other than Peter Barlow,one of the foremost specialists on approximation theory of the period, suggesting that it was Barlow, who wrote this sequence of reviews. As it also happened, Henry Atkinson, of Newcastle, devised a similar approximation scheme in 1809; he had consulted his fellow Geordie, Charles Hutton, another specialist and a senior colleague of Barlow at the Royal Military Academy, Woolwich, only to be advised that, while his work was publishable, it was unlikely to have much impact. J. R. Young, writing in the mid-1830s, concluded that Holdred's first method replicated Atkinson's while his improved method was only added to Holdred's booklet some months after its first appearance in 1820, when Horner's paper was already in circulation.\n\nThe feature of Horner's writing that most distinguishes it from his English contemporaries is the way he draws on the Continental literature, notably the work of Arbogast. The advocacy, as well as the detraction, of Horner's Method has this as an unspoken subtext. Quite how he gained that familiarity has not been determined. Horner is known to have made a close reading of John Bonneycastle's book on algebra. Bonneycastle recognizes that Arbogast has the general, combinatorial expression for the reversion of series, a project going back at least to Newton. But Bonneycastle's main purpose in mentioning Arbogast is not to praise him, but to observe that Arbogast's notation is incompatible with the approach he adopts. The gap in Horner's reading was the work of Paolo Ruffini, except that, as far as awareness of Ruffini goes, citations of Ruffini's work by authors, including medical authors, in Philosophical Transactions speak volumes: there are none - Ruffini's [http://hdl.handle.net/2027/njp.32101013501372?urlappend%3Bseq\n695 name] only appears in 1814, recording a work he donated to the Royal Society. Ruffini might have done better if his work had appeared in French, as had Malfatti's Problem in the reformulation of Joseph Diaz Gergonne, or had he written in French, as had Antonio Cagnoli, a source quoted by Bonneycastle on series reversion (today, Cagnoli is in the Italian Wikipedia, as shown, but has yet to make it into either French or English).\n\nFuller. showed that the method in Horner's 1819 paper differs from what afterwards became known as 'Horner's method' and that in consequence the priority for this method should go to Holdred (1920). This view may be compared with the remarks concerning the works of Horner and Holdred in the previous paragraph. Fuller also takes aim at Augustus De Morgan. Precocious though Augustus de Morgan was, he was not the reviewer for The Monthly Review, while several others - Thomas Stephens Davies, J. R. Young, Stephen Fenwick, T. T. Wilkinson - wrote Horner firmly into their records, not least Horner himself, as he published extensively up until the year of his death in 1837. His paper in 1819 was one that would have been difficult to miss. In contrast, the only other mathematical sighting of Holdred is a single named contribution to The Gentleman's Mathematical Companion, an answer to a problem.\n\nIt is questionable to what extent it was De Morgan's advocacy of Horner's priority in discovery that led to \"Horner's method\" being so called in textbooks, but it is true that those suggesting this tend themselves to know of Horner largely through intermediaries, of whom De Morgan made himself a prime example. However, this method qua method was known long before Horner. In reverse chronological order, Horner's method was already known to:\n\n* Paolo Ruffini in 1809 (see Ruffini's rule)\n* Isaac Newton in 1669 (but precise reference needed)\n* the Chinese mathematician Zhu Shijie in the 14th century\n* the Chinese mathematician Qin Jiushao in his Mathematical Treatise in Nine Sections in the 13th century\n* the Persian mathematician Sharaf al-Dīn al-Tūsī in the 12th century (the first to use that method in a general case of cubic equation).\n* the Chinese mathematician Jia Xian in the 11th century (Song dynasty)\n* The Nine Chapters on the Mathematical Art, a Chinese work of the Han Dynasty (202 BC – 220 AD) edited by Liu Hui (fl. 3rd century)..\n\nHowever, this observation on its own masks significant differences in conception and also, as noted with Ruffini's work, issues of accessibility.\n\nQin Jiushao, in his Shu Shu Jiu Zhang (Mathematical Treatise in Nine Sections; 1247), presents a portfolio of methods of Horner-type for solving polynomial equations, which was based on earlier works of the 11th century Song dynasty mathematician Jia Xian; for example, one method is specifically suited to bi-quintics, of which Qin gives an instance, in keeping with the then Chinese custom of case studies. The first person writing in English to note the connection with Horner's method was Alexander Wylie, writing in The North China Herald in 1852; perhaps conflating and misconstruing different Chinese phrases, Wylie calls the method Harmoniously Alternating Evolution (which does not agree with his Chinese, linglong kaifang, not that at that date he uses pinyin), working the case of one of Qin's quartics and giving, for comparison, the working with Horner's method. Yoshio Mikami in Development of Mathematics in China and Japan published in Leipzig in 1913, gave a detailed description of Qin's method, using the quartic illustrated to the above right in a worked example; he wrote: \"who can deny the fact of Horner's illustrious process being used in China at least nearly six long centuries earlier than in Europe ... We of course don't intend in any way to ascribe Horner's invention to a Chinese origin, but the lapse of time sufficiently makes it not altogether impossible that the Europeans could have known of the Chinese method in a direct or indirect way.\".. However, as Mikami is also aware, it was not altogether impossible that a related work, Si Yuan Yu Jian (Jade Mirror of the Four Unknowns; 1303) by Zhu Shijie might make the shorter journey across to Japan, but seemingly it never did, although another work of Zhu, Suan Xue Qi Meng, had a seminal influence on the development of traditional mathematics in the Edo period, starting in the mid-1600s. Ulrich Libbrecht (at the time teaching in school, but subsequently a professor of comparative philosophy) gave a detailed description in his doctoral thesis of Qin's method, he concluded: It is obvious that this procedure is a Chinese invention....the method was not known in India. He said, Fibonacci probably learned of it from Arabs, who perhaps borrowed from the Chinese.. Here, the problems is that there is no more evidence for this speculation than there is of the method being known in India. Of course, the extraction of square and cube roots along similar lines is already discussed by Liu Hui in connection with Problems IV.16 and 22 in Jiu Zhang Suan Shu, while Wang Xiaotong in the 7th century supposes his readers can solve cubics by an approximation method described in his book Jigu Suanjing.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Horner's method" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14263" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, Horner's method (also known as Horner scheme in the UK or Horner's rule in the U.S..) is either of two things:\n* an algorithm for calculating polynomials, which consists of transforming the monomial form into a computationally efficient form; or\n* a method for approximating the roots of a polynomial.\nThe latter is also known as Ruffini–Horner's method.See Méthode de Ruffini-Horner on French Wikipedia.\n\nThese methods are named after the British mathematician William George Horner, although they were known before him by Paolo Ruffini. and, six hundred years earlier, by the Chinese mathematician Qin Jiushao.It is obvious that this procedure is a Chinese invention, in .\n\nDescription of the algorithm \n\nGiven the polynomial\n\np(x) \\sum_{i\n0}^n a_i x^i = a_0 + a_1 x + a_2 x^2 + a_3 x^3 + \\cdots + a_n x^n,\n\nwhere a_0, \\ldots, a_n are real numbers, we wish to evaluate the polynomial at a specific value of x, say x_0.\n\nTo accomplish this, we define a new sequence of constants as follows:\n\n\\begin{align}\nb_n & := a_n \\\\\nb_{n-1} & := a_{n-1} + b_n x_0 \\\\\n& {}\\  \\  \\vdots \\\\\nb_0 & := a_0 + b_1 x_0.\n\\end{align}\n\nThen b_0 is the value of p(x_0).\n\nTo see why this works, note that the polynomial can be written in the form\n\np(x) = a_0 + x(a_1 + x(a_2 + \\cdots + x(a_{n-1} + a_n x))). \n\nThus, by iteratively substituting the b_i into the expression,\n\n\\begin{align}\np(x_0) & = a_0 + x_0(a_1 + x_0(a_2 + \\cdots + x_0(a_{n-1} + b_n x_0))) \\\\\n& = a_0 + x_0(a_1 + x_0(a_2 + \\cdots + x_0(b_{n-1}))) \\\\\n& {} \\ \\  \\vdots \\\\\n& = a_0 + x_0(b_1) \\\\\n& = b_0.\n\\end{align}\n\nExamples \n\nEvaluate f(x)2x^3-6x^2+2x-1 for x\n3.\n\nWe use synthetic division as follows:\n\n  x0│   x3    x2    x1    x0\n  3 │   2    −6     2    −1\n    │         6     0     6\n    └────────────────────────\n        2     0     2     5\n\nThe entries in the third row are the sum of those in the first two. Each entry in the second row is the product of the x-value (3 in this example) with the third-row entry immediately to the left. The entries in the first row are the coefficients of the polynomial to be evaluated. Then the remainder of f(x) on division by x-3 is 5.\n\nBut by the polynomial remainder theorem, we know that the remainder is f(3) . Thus f(3) = 5\n\nIn this example, if a_3 2, a_2 \n -6, a_1 2, a_0 \n -1 we can see that b_3 2, b_2 \n 0, b_1 2, b_0 \n 5 , the entries in the third row. So, synthetic division is based on Horner's method.\n\nAs a consequence of the polynomial remainder theorem, the entries in the third row are the coefficients of the second-degree polynomial, the quotient of f(x) on division by  x-3 . \nThe remainder is 5. This makes Horner's method useful for polynomial long division.\n\nDivide x^3-6x^2+11x-6 by x-2:\n\n  2 │   1    −6    11    −6\n    │         2    −8     6\n    └────────────────────────\n        1    −4     3     0\n\nThe quotient is x^2-4x+3.\n\nLet f_1(x)4x^4-6x^3+3x-5 and f_2(x)\n2x-1. Divide f_1(x) by f_2\\,(x) using Horner's method.\n\n   2 │  4    −6    0    3   │   −5\n ────┼──────────────────────┼───────\n   1 │        2   −2   −1   │    1\n     └──────────────────────┼───────\n        2    −2   −1    1   │   −4\n\nThe third row is the sum of the first two rows, divided by 2. Each entry in the second row is the product of 1 with the third-row entry to the left. The answer is\n\n\\frac{f_1(x)}{f_2(x)}=2x^3-2x^2-x+1-\\frac{4}{2x-1}.\n\nFloating point multiplication and division\n\nHorner's method is a fast, code-efficient method for multiplication and division of binary numbers on a microcontroller with no hardware multiplier.  One of the binary numbers to be multiplied is represented as a trivial polynomial, where, (using the above notation):  ai 1, and x \n 2.  Then, x (or x to some power) is repeatedly factored out.  In this binary numeral system (base 2), x = 2, so powers of 2 are repeatedly factored out.\n\nExample\n\nFor example, to find the product of two numbers, (0.15625) and m:\n\n\\begin{align}\n( 0.15625) m & (0.00101_b) m \n ( 2^{-3} + 2^{-5}) m = (2^{-3})m + (2^{-5})m \\\\[4pt]\n& 2^{-3} (m + (2^{-2})m) \n 2^{-3} (m + 2^{-2} (m)).\n\\end{align}\n\nMethod\n\nTo find the product of two binary numbers, d and m:\n*1. A register holding the intermediate result is initialized to d.\n*2. Begin with the least significant (rightmost) non-zero bit in m.\n**2b. Count (to the left) the number of bit positions to the next most significant non-zero bit.  If there are no more-significant bits, then take the value of the current bit position.\n**2c. Using that value, perform a left-shift operation by that number of bits on the register holding the intermediate result\n*3. If all the non-zero bits were counted, then the intermediate result register now holds the final result.  Otherwise, add d to the intermediate result, and continue in step #2 with the next most significant bit in m.\n\nDerivation\n\nIn general, for a binary number with bit values: ( d_3 d_2 d_1 d_0 ) the product is:\n (d_3 2^3 + d_2 2^2 + d_1 2^1 + d_0 2^0)m = d_3 2^3 m + d_2 2^2 m + d_1 2^1 m + d_0 2^0 m \nAt this stage in the algorithm, it is required that terms with zero-valued coefficients are dropped, so that only binary coefficients equal to one are counted, thus the problem of multiplication or division by zero is not an issue, despite this implication in the factored equation:\n\n = d_0\\left(m + 2 \\frac{d_1}{d_0} \\left(m + 2 \\frac{d_2}{d_1} \\left(m + 2 \\frac{d_3}{d_2} (m)\\right)\\right)\\right). \n\nThe denominators all equal one (or the term is absent), so this reduces to:\n = d_0(m + 2 {d_1} (m + 2 {d_2} (m + 2 {d_3} (m)))),\nor equivalently (as consistent with the \"method\" described above):\n = d_3(m + 2^{-1} {d_2} (m + 2^{-1}{d_1} (m + {d_0} (m)))). \n\nIn binary (base 2) math, multiplication by a power of 2 is merely a register shift operation.  Thus, multiplying by 2 is calculated in base-2 by an arithmetic shift.  The factor (2−1) is a right arithmetic shift, a (0) results in no operation (since 20 = 1, is the multiplicative identity element), and a (21) results in a left arithmetic shift.\nThe multiplication product can now be quickly calculated using only arithmetic shift operations, addition and subtraction.\n\nThe method is particularly fast on processors supporting a single-instruction shift-and-addition-accumulate.  Compared to a C floating-point library, Horner's method sacrifices some accuracy, however it is nominally 13 times faster (16 times faster when the \"canonical signed digit\" (CSD) form is used), and uses only 20% of the code space..\n\nPolynomial root finding \n\nUsing Horner's method in combination with Newton's method, it is possible to approximate the real roots of a polynomial. The algorithm works as follows. Given a polynomial p_n(x) of degree n with zeros  z_n  make some initial guess  x_0  such that  x_0 > z_1 . Now iterate the following two steps:\n\n1. Using Newton's method, find the largest zero z_1 of p_n(x) using the guess x_0.\n\n2. Using Horner's method, divide out (x-z_1) to obtain p_{n-1}. Return to step 1 but use the polynomial p_{n-1} and the initial guess z_1.\n\nThese two steps are repeated until all real zeros are found for the polynomial. If the approximated zeros are not precise enough, the obtained values can be used as initial guesses for Newton's method but using the full polynomial rather than the reduced polynomials..\n\nExample \n\nConsider the polynomial\n\np_6(x) = (x-3)(x+3)(x+5)(x+8)(x-2)(x-7)\n\nwhich can be expanded to\n\np_6(x) = x^6 + 4x^5 - 72x^4 -214x^3 + 1127x^2 + 1602x -5040.\n\nFrom the above we know that the largest root of this polynomial is 7 so we are able to make an initial guess of 8. Using Newton's method the first zero of 7 is found as shown in black in the figure to the right. Next p(x) is divided by (x-7) to obtain\n\np_5(x) = x^5 + 11x^4 + 5x^3 - 179x^2 - 126x + 720\n\nwhich is drawn in red in the figure to the right. Newton's method is used to find the largest zero of this polynomial with an initial guess of 7. The largest zero of this polynomial which corresponds to the second largest zero of the original polynomial is found at 3 and is circled in red. The degree 5 polynomial is now divided by (x-3) to obtain\n\np_4(x) = x^4 + 14x^3 + 47x^2 - 38x - 240\n\nwhich is shown in yellow. The zero for this polynomial is found at 2 again using Newton's method and is circled in yellow. Horner's method is now used to obtain\n\np_3(x) = x^3 + 16x^2 + 79x + 120\n\nwhich is shown in green and found to have a zero at −3. This polynomial is further reduced to\n\np_2(x) = x^2 + 13x + 40\n\nwhich is shown in blue and yields a zero of −5. The final root of the original polynomial may be found by either using the final zero as an initial guess for Newton's method, or by reducing p_2(x) and solving the linear equation. As can be seen, the expected roots of −8, −5, −3, 2, 3, and 7 were found.\n\nOctave implementation \n\nThe following Octave code was used in the example above to implement Horner's method.\n\nfunction [y b] = horner(a,x)\n  % Input a is the polynomial coefficient vector, x the value to be evaluated at.\n  % The output y is the evaluated polynomial and b the divided coefficient vector.\n  b(1) = a(1);\n  for i = 2:length(a)\n    b(i) = a(i)+x*b(i-1);\n  end\n  y = b(length(a));\n  b = b(1:length(b)-1);\nend\n\nPython implementation \n\nThe following Python code implements Horner's method.\n\ndef horner(x, *polynomial):\n    \"\"\"A function that implements the Horner Scheme for evaluating a\n    polynomial of coefficients *polynomial in x.\"\"\"\n    result = 0\n    for coefficient in polynomial:\n        result = result * x + coefficient\n    return result\n\nC implementation \n\nThe following C code implements Horner's method.\n\ndouble HornerEvaluate (double x, double * CoefficientsOfPolynomial, unsigned int DegreeOfPolynomial)\n{\n    /*\n        We want to evaluate the polynomial in x, of coefficients CoefficientsOfPolynomial, using Horner's method.\n        The result is stored in dbResult.\n    */\n    double dbResult = 0.0;\n    int i;\n    for(i DegreeOfPolynomial; i >\n 0; i--)\n    {\n        dbResult = dbResult * x + CoefficientsOfPolynomial[i];\n    }\n    return dbResult;\n}\n\nHere is a slightly optimized version using explicit fused Multiply–accumulate operation, often execute faster than the above when running on a computer built with a processor supporting FMA instruction:\n\n// gcc -std=c11 -lm horner.c -o horner\n#include \n\ndouble horner_fma(double x, const double *coeffs, size_t count)\n{\n    double result = 0.0;\n    for (int idx count-1; idx >\n 0; idx--)\n        result = fma(result, x, coeffs[idx]);\n    return result;\n}\n\n C# implementation \n\nThe following C# code implements Horner's method.\n\npublic double HornerEvaluate(int[] numbers, double x)\n{\n\tdouble result = 0;\n\t\n\tfor(int i numbers.Length - 1; i >\n 0; i--)\n\t{\n\t\tresult = result * x + numbers[i];\n\t}\n\t\n\treturn result;\n}\n\nApplication \n\nHorner's method can be used to convert between different positional numeral systems – in which case x is the base of the number system, and the ai coefficients are the digits of the base-x representation of a given number – and can also be used if x is a matrix, in which case the gain in computational efficiency is even greater. In fact, when x is a matrix, further acceleration is possible which exploits the structure of matrix multiplication, and only \\sqrt{n} instead of n multiplies are needed (at the expense of requiring more storage) using the 1973 method of Paterson and Stockmeyer..\n\nEfficiency \n\nEvaluation using the monomial form of a degree-n polynomial requires at most n additions and (n2 + n)/2 multiplications, if powers are calculated by repeated multiplication and each monomial is evaluated individually.  (This can be reduced to n additions and 2n − 1 multiplications by evaluating the powers of x iteratively.)  If numerical data are represented in terms of digits (or bits), then the naive algorithm also entails storing approximately 2n times the number of bits of x (the evaluated polynomial has approximate magnitude xn, and one must also store xn itself).  By contrast, Horner's method requires only n additions and n multiplications, and its storage requirements are only n times the number of bits of x. Alternatively, Horner's method can be computed with n fused multiply–adds.  Horner's method can also be extended to evaluate the first k derivatives of the polynomial with kn additions and multiplications..\n\nHorner's method is optimal, in the sense that any algorithm to evaluate an arbitrary polynomial must use at least as many operations. Alexander Ostrowski proved in 1954 that the number of additions required is minimal.. Victor Pan proved in 1966 that the number of multiplications is minimal.. However, when x is a matrix, Horner's method is not optimal.\n\nThis assumes that the polynomial is evaluated in monomial form and no preconditioning of the representation is allowed, which makes sense if the polynomial is evaluated only once. However, if preconditioning is allowed and the polynomial is to be evaluated many times, then faster algorithms are possible. They involve a transformation of the representation of the polynomial. In general, a degree-n polynomial can be evaluated using only {\\scriptstyle{\\left\\lfloor n/2 \\right\\rfloor + 2}} multiplications and n additions..\n\nHistory \n\nHorner's paper entitled \"A new method of solving numerical equations of all orders, by continuous approximation\". was read before the Royal Society of London, at its meeting on July 1, 1819, with Davies Gilbert, Vice-President and Treasurer, in the chair; this was the final [http://hdl.handle.net/2027/mdp.39015014105277?urlappend\n%3Bseq158 meeting] of the session before the Society adjorned for its Summer recess. When a sequel was read before the Society in 1823, it was again at the final meeting of the session. On both occasions, papers by James Ivory, FRS, were also read. In 1819, it was Horner's paper that got through to publication in the \"Philosophical Transactions\". later in the year, Ivory's paper falling by the way, despite Ivory being a Fellow; in 1823, when a total of ten papers were read, fortunes as regards publication, were reversed. But Gilbert, who had strong connections with the West of England and may have had social contact with Horner, resident as Horner was in Bristol and Bath, published his own [http://turing.une.edu.au/~ernie/Horner/Gilbert1823QJSLA.pdf survey] of Horner-type methods earlier in 1823.\n\nHorner's paper in Part II of Philosophical Transactions of the Royal Society of London for 1819 was warmly and expansively welcomed by a [http://turing.une.edu.au/~ernie/Horner/Horner1820MonthlyRev91-4.pdf reviewer] in the issue of The Monthly Review: or, Literary Journal for April, 1820; in comparison, a technical paper by Charles Babbage is dismissed curtly in this review. However, the reviewer noted that another, similar method had also recently been published by the architect and mathematical expositor, Peter Nicholson. This theme is developed in a further [http://turing.une.edu.au/~ernie/Horner/Horner1820MonthlyRev93-12.pdf review] of some of Nicholson's books in the issue of The Monthly Review for December, 1820, which in turn ends with notice of the appearance of a booklet by Theophilus Holdred, from whom Nicholson acknowledges he obtained the gist of his approach in the first place, although claiming to have improved upon it. The sequence of reviews is concluded in the issue of The Monthly Review for September, 1821, with the [http://turing.une.edu.au/~ernie/Horner/Horner1821MonthlyRev96-9.pdf reviewer] concluding that whereas Holdred was the first person to discover a direct and general practical solution of numerical equations, he had not reduced it to its simplest form by the time of Horner's publication, and saying that had Holdred published forty years earlier when he first discovered his method, his contribution could be more easily recognized. The reviewer is exceptionally well-informed, even having sighted Horner's preparatory correspondence with Peter Barlow in 1818, seeking work of Budan. The Bodlean Library, Oxford has the Editor's annotated copy of The Monthly Review from which it is clear that the most active reviewer in mathematics in 1814 and 1815 (the last years for which this information has been published) was none other than Peter Barlow,one of the foremost specialists on approximation theory of the period, suggesting that it was Barlow, who wrote this sequence of reviews. As it also happened, Henry Atkinson, of Newcastle, devised a similar approximation scheme in 1809; he had consulted his fellow Geordie, Charles Hutton, another specialist and a senior colleague of Barlow at the Royal Military Academy, Woolwich, only to be advised that, while his work was publishable, it was unlikely to have much impact. J. R. Young, writing in the mid-1830s, concluded that Holdred's first method replicated Atkinson's while his improved method was only added to Holdred's booklet some months after its first appearance in 1820, when Horner's paper was already in circulation.\n\nThe feature of Horner's writing that most distinguishes it from his English contemporaries is the way he draws on the Continental literature, notably the work of Arbogast. The advocacy, as well as the detraction, of Horner's Method has this as an unspoken subtext. Quite how he gained that familiarity has not been determined. Horner is known to have made a close reading of John Bonneycastle's book on algebra. Bonneycastle recognizes that Arbogast has the general, combinatorial expression for the reversion of series, a project going back at least to Newton. But Bonneycastle's main purpose in mentioning Arbogast is not to praise him, but to observe that Arbogast's notation is incompatible with the approach he adopts. The gap in Horner's reading was the work of Paolo Ruffini, except that, as far as awareness of Ruffini goes, citations of Ruffini's work by authors, including medical authors, in Philosophical Transactions speak volumes: there are none - Ruffini's [http://hdl.handle.net/2027/njp.32101013501372?urlappend%3Bseq\n695 name] only appears in 1814, recording a work he donated to the Royal Society. Ruffini might have done better if his work had appeared in French, as had Malfatti's Problem in the reformulation of Joseph Diaz Gergonne, or had he written in French, as had Antonio Cagnoli, a source quoted by Bonneycastle on series reversion (today, Cagnoli is in the Italian Wikipedia, as shown, but has yet to make it into either French or English).\n\nFuller. showed that the method in Horner's 1819 paper differs from what afterwards became known as 'Horner's method' and that in consequence the priority for this method should go to Holdred (1920). This view may be compared with the remarks concerning the works of Horner and Holdred in the previous paragraph. Fuller also takes aim at Augustus De Morgan. Precocious though Augustus de Morgan was, he was not the reviewer for The Monthly Review, while several others - Thomas Stephens Davies, J. R. Young, Stephen Fenwick, T. T. Wilkinson - wrote Horner firmly into their records, not least Horner himself, as he published extensively up until the year of his death in 1837. His paper in 1819 was one that would have been difficult to miss. In contrast, the only other mathematical sighting of Holdred is a single named contribution to The Gentleman's Mathematical Companion, an answer to a problem.\n\nIt is questionable to what extent it was De Morgan's advocacy of Horner's priority in discovery that led to \"Horner's method\" being so called in textbooks, but it is true that those suggesting this tend themselves to know of Horner largely through intermediaries, of whom De Morgan made himself a prime example. However, this method qua method was known long before Horner. In reverse chronological order, Horner's method was already known to:\n\n* Paolo Ruffini in 1809 (see Ruffini's rule)\n* Isaac Newton in 1669 (but precise reference needed)\n* the Chinese mathematician Zhu Shijie in the 14th century\n* the Chinese mathematician Qin Jiushao in his Mathematical Treatise in Nine Sections in the 13th century\n* the Persian mathematician Sharaf al-Dīn al-Tūsī in the 12th century (the first to use that method in a general case of cubic equation).\n* the Chinese mathematician Jia Xian in the 11th century (Song dynasty)\n* The Nine Chapters on the Mathematical Art, a Chinese work of the Han Dynasty (202 BC – 220 AD) edited by Liu Hui (fl. 3rd century)..\n\nHowever, this observation on its own masks significant differences in conception and also, as noted with Ruffini's work, issues of accessibility.\n\nQin Jiushao, in his Shu Shu Jiu Zhang (Mathematical Treatise in Nine Sections; 1247), presents a portfolio of methods of Horner-type for solving polynomial equations, which was based on earlier works of the 11th century Song dynasty mathematician Jia Xian; for example, one method is specifically suited to bi-quintics, of which Qin gives an instance, in keeping with the then Chinese custom of case studies. The first person writing in English to note the connection with Horner's method was Alexander Wylie, writing in The North China Herald in 1852; perhaps conflating and misconstruing different Chinese phrases, Wylie calls the method Harmoniously Alternating Evolution (which does not agree with his Chinese, linglong kaifang, not that at that date he uses pinyin), working the case of one of Qin's quartics and giving, for comparison, the working with Horner's method. Yoshio Mikami in Development of Mathematics in China and Japan published in Leipzig in 1913, gave a detailed description of Qin's method, using the quartic illustrated to the above right in a worked example; he wrote: \"who can deny the fact of Horner's illustrious process being used in China at least nearly six long centuries earlier than in Europe ... We of course don't intend in any way to ascribe Horner's invention to a Chinese origin, but the lapse of time sufficiently makes it not altogether impossible that the Europeans could have known of the Chinese method in a direct or indirect way.\".. However, as Mikami is also aware, it was not altogether impossible that a related work, Si Yuan Yu Jian (Jade Mirror of the Four Unknowns; 1303) by Zhu Shijie might make the shorter journey across to Japan, but seemingly it never did, although another work of Zhu, Suan Xue Qi Meng, had a seminal influence on the development of traditional mathematics in the Edo period, starting in the mid-1600s. Ulrich Libbrecht (at the time teaching in school, but subsequently a professor of comparative philosophy) gave a detailed description in his doctoral thesis of Qin's method, he concluded: It is obvious that this procedure is a Chinese invention....the method was not known in India. He said, Fibonacci probably learned of it from Arabs, who perhaps borrowed from the Chinese.. Here, the problems is that there is no more evidence for this speculation than there is of the method being known in India. Of course, the extraction of square and cube roots along similar lines is already discussed by Liu Hui in connection with Problems IV.16 and 22 in Jiu Zhang Suan Shu, while Wang Xiaotong in the 7th century supposes his readers can solve cubics by an approximation method described in his book Jigu Suanjing. Horner's method. http://en.wikipedia.org/?curid=14263."
  }
}
