{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3450",
  "eid" : "c6a63330-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778413028,
  "textBody" : "Bursa is a large city in Turkey, located in northwestern Anatolia, within the Marmara Region. It is the fourth most populous city in Turkey and one of the most industrialized metropolitan centres in the country. The city is also the administrative centre of Bursa Province.\n\nBursa (Ottoman Turkish بورسا) was the first major and second overall capital of the Ottoman State between 1335 and 1363. The city was referred to as  (Ottoman Turkish خداوندگار 'God's gift') during the Ottoman period, while a more recent nickname is  'Green Bursa' in reference to the parks and gardens located across its urban fabric, as well as to the vast and richly varied forests of the surrounding region. Mount Uludağ, the ancient Mysian Olympus, towers over it, and has a well-known ski resort. Bursa has rather orderly urban growth and borders a fertile plain. The mausoleums of the early Ottoman sultans are located in Bursa and the city's main landmarks include numerous edifices built throughout the Ottoman period. Bursa also has thermal baths and several museums, including a museum of archaeology.\n\nThe shadow play characters Karagöz and Hacivat are based on historic personalities who lived and died in Bursa. Bursa is also home to some of the most famous Turkish dishes such as İskender kebap, specially candied marron glacés, peaches and Turkish Delight. Bursa houses the Uludağ University, and its population can claim one of the highest overall levels of education in Turkey. The historic towns of İznik (Nicaea), Mudanya and Zeytinbağı are all situated in Bursa Province.\n\nIn 2015, Bursa had a population of 1,854,285, while Bursa Province had 2,842,000 inhabitants.\n\nHistory of Bursa\n\nThe earliest known human settlement near Bursa's current location was at Ilıpınar Höyüğü around 5200 BC. It was followed by the ancient Greek city of Cius, which Philip V of Macedon granted to Prusias I, the King of Bithynia, in 202 BC. Prusias rebuilt the city and renamed it Prusa (; sometimes rendered as Prussa). After 128 years of Bithynian rule, Nicomedes IV, the last King of Bithynia, bequeathed the entire kingdom to the Roman Empire in 74 BC. An early Roman Treasure was found in the vicinity of Bursa in the early 20th century. Composed of a woman's silver toilet articles, it is now in the British Museum.\n\nBursa became the first major capital city of the early Ottoman Empire following its capture from the Byzantines in 1326. As a result, the city witnessed a considerable amount of urban growth throughout the 14th century. After conquering Edirne (Adrianople) in East Thrace, the Ottomans turned it into the new capital city in 1363, but Bursa retained its spiritual and commercial importance in the Ottoman Empire.\"In 1363 the Ottoman capital moved from Bursa to Edirne, although Bursa retained its spiritual and economic importance.\" [http://www.otelcenneti.com/oteller/bursa Ottoman Capital Bursa]. Official website of Ministry of Culture and Tourism of the Republic of Turkey. Retrieved 19 December 2014. The Ottoman sultan Bayezid I built the Bayezid Külliyesi (Bayezid I theological complex) in Bursa between 1390 and 1395 and the Ulu Cami (Grand Mosque) between 1396 and 1400. Bursa remained to be the most important administrative and commercial centre in the empire until Mehmed II conquered Constantinople in 1453. The population of Bursa was 45,000 in 1487.The city in the Islamic world, Volume 1, ed. Salma Khadra Jayyusi, Renata Holod, Attilio Petruccioli, André Raymond, page 362.\n\nDuring the Ottoman period, Bursa continued to be the source of most royal silk products. Aside from the local silk production, the city imported raw silk from Iran, and occasionally from China, and was the main production centre for the kaftans, pillows, embroidery and other silk products for the Ottoman palaces until the 17th century.\n\nFollowing the foundation of the Republic of Turkey in 1923, Bursa became one of the industrial centres of the country. The economic development of the city was followed by population growth and Bursa became the 4th most populous city in Turkey.\n\nThe city has traditionally been a pole of attraction, and was a major centre for refugees from various ethnic backgrounds who immigrated to Anatolia from the Balkans during the loss of the Ottoman territories in Europe between the late 19th and early 20th centuries. The most recent arrival of Balkan Turks took place in the 1940s until the 1990s, when the communist regime in Bulgaria expelled approximately 150,000 Bulgarian Turks to Turkey.Eminov, Ali, Turks and Other Muslim Minorities in Bulgaria, New York, Routledge, 1997, Hoepken, W., \"Modernnisierung und Nationalismus: Sizialgeschichtliche Aspeckte der Bulgarischen Minder hertenpolitik gegennüber den Türken\", Schönfeld, R., ed, Nationalitätenprobleme in Südosteuropa, Munich, Oldenbourg, 1997, p. 255-303, Erdinç, Didar, \"Bulgaristan'daki Değişim Sürecinde Türk Azınlığın Ekonomik Durumu\", Türkler, Ankara, 2002, s.394–400. About one-third of these 150,000 Bulgarian Turkish refugees eventually settled in Bursa.\n\nGeography\n\nBursa is settled on the northwestern slopes of Mount Uludağ in the southern Marmara Region. It is the capital city of Bursa Province bordered by the Sea of Marmara and Yalova to the north; Kocaeli and Sakarya to the northeast; Bilecik to the east; and Kütahya and Balıkesir to the south.\n\nClimate \n \nBursa has a Mediterranean climate (Köppen climate classification: Csa) under the Köppen classification, and dry-hot summer temperate climate (Csa) Trewartha classification. The city has hot, dry summers that last from June until September. Winters are cold and damp, also containing the most rainfall. There can be snow on the ground which will last for a week or two.\n\nEconomy\n\nBursa is the centre of the Turkish automotive industry. Factories of motor vehicle producers like Fiat, Renault and Karsan, as well as automotive parts producers like Bosch, Mako, Valeo, Johnson Controls, Delphi have been active in the city for decades. The textile and food industries are equally strong, with Coca-Cola, Pepsi Cola and other beverage brands, as well as fresh and canned food industries being present in the city's organized industrial zones.\n\nThe top 10 industry corporations in the Bursa province are as follows:\n\n* Oyak Renault\n* Tofaş Fiat\n* Bosch\n* Borçelik\n* Sütaş Dairy Products\n* Bursa Eczacılar Kooperatifi\n* Türk Prysmian Kablo\n* Özdilek\n* Asil Çelik\n* Componenta Döktaş\n\nApart from its large automotive industry, Bursa also produces a substantial amount of dairy products (by ), processed food (by ), and beverages (by ).[http://www.uludagicecek.com.tr/ Uludağ Beverages]\n\nTraditionally, Bursa was famous for being the largest centre of silk trade in the Byzantine and later the Ottoman empires, during the period of the lucrative Silk Road. The city is still a major centre for textiles in Turkey and is home to the Bursa International Textiles and Trade Centre (, or ). Bursa was also known for its fertile soil and agricultural activities, which have decreased in the recent decades due to the heavy industrialization of the city.\n\nBursa is a major centre for tourism. One of the most popular skiing resorts of Turkey is located at Mount Uludağ, just next to the city proper. Bursa's thermal baths have been used for therapeutical purposes since Roman times. Apart from the baths that are operated by hotels, Uludağ University has a physical therapy centre which also makes use of thermal water.\n\nTransportation\n\nBursa has a metro (Bursaray), trams and bus system for inner-city public transport, while taxi cabs are also available. Bursa's Yenişehir Airport is 20 mi away from the city centre. The citizens of Bursa also prefer Istanbul's airports such as Atatürk International Airport and Sabiha Gökçen International Airport for flights to foreign countries, due to Istanbul's proximity to Bursa. There are numerous daily bus and ferry services between the two cities.\n\nThe  long Bursa Uludağ Gondola () connects Bursa with the ski resort areas 1870 m high on the mountain Uludağ.\n\nThe only railway station in Bursa is the Harmancık station on the Balıkesir-Kütahya railway, which was opened in 1930.\n\nBursa Public Transportation Statistics\n\nThe average amount of time people spend commuting with public transit in Bursa, for example to and from work, on a weekday is 62 min. 12% of public transit riders, ride for more than 2 hours every day. The average amount of time people wait at a stop or station for public transit is 18 min, while 31% of riders wait for over 20 minutes on average every day. The average distance people usually ride in a single trip with public transit is 8.1 km, while 17% travel for over 12 km in a single direction.  Material was copied from this source, which is available under a [https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License].\n\nEducation\n\nBursa has two public universities and one private university. Uludağ University, founded in 1975, is the oldest institution of higher education in the city. Founded first as the Bursa University then renamed Uludağ University in 1982, the university has a student body of 47,000, one of the largest in Turkey. Bursa Technical University is the second public university of Bursa and was established in 2010, beginning education in the 2011–2012 academic year.\n\nThe first private university of Bursa was the Bursa Orhangazi University, which started education in the 2012–2013 academic year. However, Orhangazi University was shut down by the Turkish Government after the failed coup attempt of July 2016.  Istanbul Commerce University has opened graduate programs in Bursa in 2013.\n\nSports\n\nThe city has one professional football club,  Bursaspor, which competes in the Turkish Super League, the top-tier of Turkish football. As of December 21, the team plays their home games at The Timsah Arena stadium (literally meaning Crocodile Arena), which has a sitting capacity of 45,000.  Bursaspor has won its first league title in the 2009–10 Turkish Super League season, becoming the second Anatolian club to ever win the league title after Trabzonspor. Today Bursaspor is considered one of the five biggest football clubs in Turkey along with Galatasaray SK, Fenerbahçe, Beşiktaş, and Trabzonspor.\n\nThe city has a professional basketball team in the Turkish Basketball League, Tofaş S.K., which was among the most successful teams.\n\nMain sights\n\nUlu Cami (Grand Mosque)\n\nUlu Cami is the largest mosque in Bursa and a landmark of early Ottoman architecture, which carried many elements from the Seljuk architecture. Ordered by Sultan Bayezid I, the mosque was designed and built by architect Ali Neccar in 1396–1400. It is a large and rectangular building, with a total of twenty domes that are arranged in four rows of five, and are supported by 12 columns. Supposedly the twenty domes were built instead of the twenty separate mosques which Sultan Bayezid I had promised for winning the Battle of Nicopolis in 1396. The mosque has two minarets.\n\nInside the mosque there are 192 monumental wall inscriptions written by the famous calligraphers of that period. There is also a fountain (şadırvan) where worshipers can perform ritual ablutions before prayer; the dome over the şadırvan is capped by a skylight which creates a soft, serene light below; thus playing an important role in the illumination of the large building.\n\nThe horizontally spacious and dimly lit interior is designed to feel peaceful and contemplative. The subdivisions of space formed by multiple domes and pillars create a sense of privacy and even intimacy. This atmosphere contrasts with the later Ottoman mosques (see for example the works of Suleiman the Magnificent's chief architect Mimar Sinan.) The mosques that were built after the conquest of Constantinople (Istanbul) by the Ottoman Turks in 1453, and influenced by the design of the 6th century Byzantine basilica of Hagia Sophia, had increasingly elevated and large central domes, which create a vertical emphasis that is intended to be more overwhelming; in order to convey the divine power of Allah, the majesty of the Ottoman Sultan, and the governmental authority of the Ottoman State.\n\nPlaces of interest\n\nA brief list of places of interest in and around Bursa is presented below. For a longer list, see places of interest in Bursa.\n\nMosques and külliye complexes\n\n* Bursa Grand Mosque and \n* Yeşil Mosque and \n* Bayezid I Mosque and \n* Muradiye Mosque and \n* Emir Sultan Mosque and \n* Orhan Gazi Mosque and \n* Hüdavendigar Mosque and \n* Koca Sinan Paşa Mosque and \n* İshak Paşa Mosque and \n* Karacabey Grand Mosque\n* Karabaş-i Veli Cultural Centre\n\nBazaars and caravanserais\n\n* Yıldırım Bazaar\n* Koza Han\n* Pirinç Han\n\nOther historic monuments\n\n* Bursa Castle\n* Irgandı Bridge\n* Inkaya Sycamore, very big and impressive 600-year-old tree (Platanus Orientalis)\n\nMuseums\n\n* Bursa Archaeological Museum\n* Bursa City Museum\n* Bursa Atatürk Museum\n* Bursa Turkish Architecture Museum\n* Bursa Islamic Works Museum\n* Tofaş Museum of Cars and Anatolian Carriages\n* Armistice of Mudanya Museum\n* İznik Museum\n\nParks and gardens\n\n* Uludağ National Park\n* Bursa Zoo and Botanical Garden\n\nHot springs and thermal baths\n\n* Keramet hot spring\n* Çekirge hot spring\n* Armutlu hot spring\n* Oylat hot spring\n* Gemlik hot spring\n* Çelik Palas thermal bath\n\nBeaches\n\n* Armutlu beach\n* Kumla beach\n* Kurşunlu beach\n* Orhangazi beach\n* Mudanya beach\nVolunteer Organizations\n* [http://www.gonulluhareketi.org Gönüllü Hareketi] (Volunteer Movement)\n\nImages from Bursa\n\nFile:Bursa 7055.jpg|Statue of Atatürk and the Governorate of Bursa\nFile:Bursa Koza Han (Silk Bazaar) 2.jpg|Koza Han (Silk Bazaar) in Bursa\nFile:Bursa001.jpg|Entrance gate of the Yeşil Cami (Green Mosque)\nFile:Bursa Turkey 2013 1.jpg|Bursa Castle\nFile:Muradiye Complex, exterior.jpg|Muradiye Mosque and Külliye in Bursa\nFile:Bursa, Governorate.jpg|Governorate of Bursa\nFile:Mudanya 13.jpg|Ottoman era traditional houses in the Mudanya district of Bursa Province\nFile:Mudanya 10.jpg|Port of Mudanya\nFile:Uludag range.JPG|Mt. Uludağ is a popular winter sport destination\nFile:Sarıalan14Teleferik.JPG|Bursa aerial tramway\nFile:Irgandi_Koprusu.jpg|Irgandı Bridge (1442)\nFile:Bursa Atatürk Müzesi.JPG|Atatürk Museum\nFile:Şehreküstü Mosque, Bursa.jpg|Şehreküstü Mosque\nFile:Bursa Orhan Gazi Mosque.jpg|Orhan Gazi Mosque\nFile:Emirsultan 1.JPG|Emir Sultan Mosque\n\nTwin towns—Sister cities\n\nBursa is twinned with:\n\n* Darmstadt, Germany, since 1971 (suspended by the mayor of Bursa End of March 2017)\n* Sarajevo, Bosnia and Herzegovina, since 1972\n* Multan, Pakistan, since 1975\n* Oulu, Finland, since 1978\n* Tiffin, Ohio, United States, since 1983\n* Kairouan, Tunisia, since 1987\n* Denizli, Turkey, since 1988\n* Lefkoşa, Northern Cyprus, since 1990\n* Anshan, China, since 1991\n* Bitola, Macedonia, since 1996\n* Ceadîr-Lunga, Moldova, since 1997\n* Kyzylorda, Kazakhstan, since 1997\n* Muaskar, Algeria, since 1998\n* Kulmbach, Germany, since 1998\n* Pleven, Bulgaria, since 1998\n* Plovdiv, Bulgaria, since 1998\n* Tirana, Albania, since 1998\n* Košice, Slovakia, since 2000\n* Vinnytsia, Ukraine, since 2004\n* Van, Turkey, since 2008\n* Rabat, Morocco, since 2010\n* Bakhchysarai, Ukraine, since 2010\n* Gyeongsangbuk-do, South Korea, since 2011\n* Öskemen, Kazakhstan, since 2011",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bursa" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3450" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bursa is a large city in Turkey, located in northwestern Anatolia, within the Marmara Region. It is the fourth most populous city in Turkey and one of the most industrialized metropolitan centres in the country. The city is also the administrative centre of Bursa Province.\n\nBursa (Ottoman Turkish بورسا) was the first major and second overall capital of the Ottoman State between 1335 and 1363. The city was referred to as  (Ottoman Turkish خداوندگار 'God's gift') during the Ottoman period, while a more recent nickname is  'Green Bursa' in reference to the parks and gardens located across its urban fabric, as well as to the vast and richly varied forests of the surrounding region. Mount Uludağ, the ancient Mysian Olympus, towers over it, and has a well-known ski resort. Bursa has rather orderly urban growth and borders a fertile plain. The mausoleums of the early Ottoman sultans are located in Bursa and the city's main landmarks include numerous edifices built throughout the Ottoman period. Bursa also has thermal baths and several museums, including a museum of archaeology.\n\nThe shadow play characters Karagöz and Hacivat are based on historic personalities who lived and died in Bursa. Bursa is also home to some of the most famous Turkish dishes such as İskender kebap, specially candied marron glacés, peaches and Turkish Delight. Bursa houses the Uludağ University, and its population can claim one of the highest overall levels of education in Turkey. The historic towns of İznik (Nicaea), Mudanya and Zeytinbağı are all situated in Bursa Province.\n\nIn 2015, Bursa had a population of 1,854,285, while Bursa Province had 2,842,000 inhabitants.\n\nHistory of Bursa\n\nThe earliest known human settlement near Bursa's current location was at Ilıpınar Höyüğü around 5200 BC. It was followed by the ancient Greek city of Cius, which Philip V of Macedon granted to Prusias I, the King of Bithynia, in 202 BC. Prusias rebuilt the city and renamed it Prusa (; sometimes rendered as Prussa). After 128 years of Bithynian rule, Nicomedes IV, the last King of Bithynia, bequeathed the entire kingdom to the Roman Empire in 74 BC. An early Roman Treasure was found in the vicinity of Bursa in the early 20th century. Composed of a woman's silver toilet articles, it is now in the British Museum.\n\nBursa became the first major capital city of the early Ottoman Empire following its capture from the Byzantines in 1326. As a result, the city witnessed a considerable amount of urban growth throughout the 14th century. After conquering Edirne (Adrianople) in East Thrace, the Ottomans turned it into the new capital city in 1363, but Bursa retained its spiritual and commercial importance in the Ottoman Empire.\"In 1363 the Ottoman capital moved from Bursa to Edirne, although Bursa retained its spiritual and economic importance.\" [http://www.otelcenneti.com/oteller/bursa Ottoman Capital Bursa]. Official website of Ministry of Culture and Tourism of the Republic of Turkey. Retrieved 19 December 2014. The Ottoman sultan Bayezid I built the Bayezid Külliyesi (Bayezid I theological complex) in Bursa between 1390 and 1395 and the Ulu Cami (Grand Mosque) between 1396 and 1400. Bursa remained to be the most important administrative and commercial centre in the empire until Mehmed II conquered Constantinople in 1453. The population of Bursa was 45,000 in 1487.The city in the Islamic world, Volume 1, ed. Salma Khadra Jayyusi, Renata Holod, Attilio Petruccioli, André Raymond, page 362.\n\nDuring the Ottoman period, Bursa continued to be the source of most royal silk products. Aside from the local silk production, the city imported raw silk from Iran, and occasionally from China, and was the main production centre for the kaftans, pillows, embroidery and other silk products for the Ottoman palaces until the 17th century.\n\nFollowing the foundation of the Republic of Turkey in 1923, Bursa became one of the industrial centres of the country. The economic development of the city was followed by population growth and Bursa became the 4th most populous city in Turkey.\n\nThe city has traditionally been a pole of attraction, and was a major centre for refugees from various ethnic backgrounds who immigrated to Anatolia from the Balkans during the loss of the Ottoman territories in Europe between the late 19th and early 20th centuries. The most recent arrival of Balkan Turks took place in the 1940s until the 1990s, when the communist regime in Bulgaria expelled approximately 150,000 Bulgarian Turks to Turkey.Eminov, Ali, Turks and Other Muslim Minorities in Bulgaria, New York, Routledge, 1997, Hoepken, W., \"Modernnisierung und Nationalismus: Sizialgeschichtliche Aspeckte der Bulgarischen Minder hertenpolitik gegennüber den Türken\", Schönfeld, R., ed, Nationalitätenprobleme in Südosteuropa, Munich, Oldenbourg, 1997, p. 255-303, Erdinç, Didar, \"Bulgaristan'daki Değişim Sürecinde Türk Azınlığın Ekonomik Durumu\", Türkler, Ankara, 2002, s.394–400. About one-third of these 150,000 Bulgarian Turkish refugees eventually settled in Bursa.\n\nGeography\n\nBursa is settled on the northwestern slopes of Mount Uludağ in the southern Marmara Region. It is the capital city of Bursa Province bordered by the Sea of Marmara and Yalova to the north; Kocaeli and Sakarya to the northeast; Bilecik to the east; and Kütahya and Balıkesir to the south.\n\nClimate \n \nBursa has a Mediterranean climate (Köppen climate classification: Csa) under the Köppen classification, and dry-hot summer temperate climate (Csa) Trewartha classification. The city has hot, dry summers that last from June until September. Winters are cold and damp, also containing the most rainfall. There can be snow on the ground which will last for a week or two.\n\nEconomy\n\nBursa is the centre of the Turkish automotive industry. Factories of motor vehicle producers like Fiat, Renault and Karsan, as well as automotive parts producers like Bosch, Mako, Valeo, Johnson Controls, Delphi have been active in the city for decades. The textile and food industries are equally strong, with Coca-Cola, Pepsi Cola and other beverage brands, as well as fresh and canned food industries being present in the city's organized industrial zones.\n\nThe top 10 industry corporations in the Bursa province are as follows:\n\n* Oyak Renault\n* Tofaş Fiat\n* Bosch\n* Borçelik\n* Sütaş Dairy Products\n* Bursa Eczacılar Kooperatifi\n* Türk Prysmian Kablo\n* Özdilek\n* Asil Çelik\n* Componenta Döktaş\n\nApart from its large automotive industry, Bursa also produces a substantial amount of dairy products (by ), processed food (by ), and beverages (by ).[http://www.uludagicecek.com.tr/ Uludağ Beverages]\n\nTraditionally, Bursa was famous for being the largest centre of silk trade in the Byzantine and later the Ottoman empires, during the period of the lucrative Silk Road. The city is still a major centre for textiles in Turkey and is home to the Bursa International Textiles and Trade Centre (, or ). Bursa was also known for its fertile soil and agricultural activities, which have decreased in the recent decades due to the heavy industrialization of the city.\n\nBursa is a major centre for tourism. One of the most popular skiing resorts of Turkey is located at Mount Uludağ, just next to the city proper. Bursa's thermal baths have been used for therapeutical purposes since Roman times. Apart from the baths that are operated by hotels, Uludağ University has a physical therapy centre which also makes use of thermal water.\n\nTransportation\n\nBursa has a metro (Bursaray), trams and bus system for inner-city public transport, while taxi cabs are also available. Bursa's Yenişehir Airport is 20 mi away from the city centre. The citizens of Bursa also prefer Istanbul's airports such as Atatürk International Airport and Sabiha Gökçen International Airport for flights to foreign countries, due to Istanbul's proximity to Bursa. There are numerous daily bus and ferry services between the two cities.\n\nThe  long Bursa Uludağ Gondola () connects Bursa with the ski resort areas 1870 m high on the mountain Uludağ.\n\nThe only railway station in Bursa is the Harmancık station on the Balıkesir-Kütahya railway, which was opened in 1930.\n\nBursa Public Transportation Statistics\n\nThe average amount of time people spend commuting with public transit in Bursa, for example to and from work, on a weekday is 62 min. 12% of public transit riders, ride for more than 2 hours every day. The average amount of time people wait at a stop or station for public transit is 18 min, while 31% of riders wait for over 20 minutes on average every day. The average distance people usually ride in a single trip with public transit is 8.1 km, while 17% travel for over 12 km in a single direction.  Material was copied from this source, which is available under a [https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License].\n\nEducation\n\nBursa has two public universities and one private university. Uludağ University, founded in 1975, is the oldest institution of higher education in the city. Founded first as the Bursa University then renamed Uludağ University in 1982, the university has a student body of 47,000, one of the largest in Turkey. Bursa Technical University is the second public university of Bursa and was established in 2010, beginning education in the 2011–2012 academic year.\n\nThe first private university of Bursa was the Bursa Orhangazi University, which started education in the 2012–2013 academic year. However, Orhangazi University was shut down by the Turkish Government after the failed coup attempt of July 2016.  Istanbul Commerce University has opened graduate programs in Bursa in 2013.\n\nSports\n\nThe city has one professional football club,  Bursaspor, which competes in the Turkish Super League, the top-tier of Turkish football. As of December 21, the team plays their home games at The Timsah Arena stadium (literally meaning Crocodile Arena), which has a sitting capacity of 45,000.  Bursaspor has won its first league title in the 2009–10 Turkish Super League season, becoming the second Anatolian club to ever win the league title after Trabzonspor. Today Bursaspor is considered one of the five biggest football clubs in Turkey along with Galatasaray SK, Fenerbahçe, Beşiktaş, and Trabzonspor.\n\nThe city has a professional basketball team in the Turkish Basketball League, Tofaş S.K., which was among the most successful teams.\n\nMain sights\n\nUlu Cami (Grand Mosque)\n\nUlu Cami is the largest mosque in Bursa and a landmark of early Ottoman architecture, which carried many elements from the Seljuk architecture. Ordered by Sultan Bayezid I, the mosque was designed and built by architect Ali Neccar in 1396–1400. It is a large and rectangular building, with a total of twenty domes that are arranged in four rows of five, and are supported by 12 columns. Supposedly the twenty domes were built instead of the twenty separate mosques which Sultan Bayezid I had promised for winning the Battle of Nicopolis in 1396. The mosque has two minarets.\n\nInside the mosque there are 192 monumental wall inscriptions written by the famous calligraphers of that period. There is also a fountain (şadırvan) where worshipers can perform ritual ablutions before prayer; the dome over the şadırvan is capped by a skylight which creates a soft, serene light below; thus playing an important role in the illumination of the large building.\n\nThe horizontally spacious and dimly lit interior is designed to feel peaceful and contemplative. The subdivisions of space formed by multiple domes and pillars create a sense of privacy and even intimacy. This atmosphere contrasts with the later Ottoman mosques (see for example the works of Suleiman the Magnificent's chief architect Mimar Sinan.) The mosques that were built after the conquest of Constantinople (Istanbul) by the Ottoman Turks in 1453, and influenced by the design of the 6th century Byzantine basilica of Hagia Sophia, had increasingly elevated and large central domes, which create a vertical emphasis that is intended to be more overwhelming; in order to convey the divine power of Allah, the majesty of the Ottoman Sultan, and the governmental authority of the Ottoman State.\n\nPlaces of interest\n\nA brief list of places of interest in and around Bursa is presented below. For a longer list, see places of interest in Bursa.\n\nMosques and külliye complexes\n\n* Bursa Grand Mosque and \n* Yeşil Mosque and \n* Bayezid I Mosque and \n* Muradiye Mosque and \n* Emir Sultan Mosque and \n* Orhan Gazi Mosque and \n* Hüdavendigar Mosque and \n* Koca Sinan Paşa Mosque and \n* İshak Paşa Mosque and \n* Karacabey Grand Mosque\n* Karabaş-i Veli Cultural Centre\n\nBazaars and caravanserais\n\n* Yıldırım Bazaar\n* Koza Han\n* Pirinç Han\n\nOther historic monuments\n\n* Bursa Castle\n* Irgandı Bridge\n* Inkaya Sycamore, very big and impressive 600-year-old tree (Platanus Orientalis)\n\nMuseums\n\n* Bursa Archaeological Museum\n* Bursa City Museum\n* Bursa Atatürk Museum\n* Bursa Turkish Architecture Museum\n* Bursa Islamic Works Museum\n* Tofaş Museum of Cars and Anatolian Carriages\n* Armistice of Mudanya Museum\n* İznik Museum\n\nParks and gardens\n\n* Uludağ National Park\n* Bursa Zoo and Botanical Garden\n\nHot springs and thermal baths\n\n* Keramet hot spring\n* Çekirge hot spring\n* Armutlu hot spring\n* Oylat hot spring\n* Gemlik hot spring\n* Çelik Palas thermal bath\n\nBeaches\n\n* Armutlu beach\n* Kumla beach\n* Kurşunlu beach\n* Orhangazi beach\n* Mudanya beach\nVolunteer Organizations\n* [http://www.gonulluhareketi.org Gönüllü Hareketi] (Volunteer Movement)\n\nImages from Bursa\n\nFile:Bursa 7055.jpg|Statue of Atatürk and the Governorate of Bursa\nFile:Bursa Koza Han (Silk Bazaar) 2.jpg|Koza Han (Silk Bazaar) in Bursa\nFile:Bursa001.jpg|Entrance gate of the Yeşil Cami (Green Mosque)\nFile:Bursa Turkey 2013 1.jpg|Bursa Castle\nFile:Muradiye Complex, exterior.jpg|Muradiye Mosque and Külliye in Bursa\nFile:Bursa, Governorate.jpg|Governorate of Bursa\nFile:Mudanya 13.jpg|Ottoman era traditional houses in the Mudanya district of Bursa Province\nFile:Mudanya 10.jpg|Port of Mudanya\nFile:Uludag range.JPG|Mt. Uludağ is a popular winter sport destination\nFile:Sarıalan14Teleferik.JPG|Bursa aerial tramway\nFile:Irgandi_Koprusu.jpg|Irgandı Bridge (1442)\nFile:Bursa Atatürk Müzesi.JPG|Atatürk Museum\nFile:Şehreküstü Mosque, Bursa.jpg|Şehreküstü Mosque\nFile:Bursa Orhan Gazi Mosque.jpg|Orhan Gazi Mosque\nFile:Emirsultan 1.JPG|Emir Sultan Mosque\n\nTwin towns—Sister cities\n\nBursa is twinned with:\n\n* Darmstadt, Germany, since 1971 (suspended by the mayor of Bursa End of March 2017)\n* Sarajevo, Bosnia and Herzegovina, since 1972\n* Multan, Pakistan, since 1975\n* Oulu, Finland, since 1978\n* Tiffin, Ohio, United States, since 1983\n* Kairouan, Tunisia, since 1987\n* Denizli, Turkey, since 1988\n* Lefkoşa, Northern Cyprus, since 1990\n* Anshan, China, since 1991\n* Bitola, Macedonia, since 1996\n* Ceadîr-Lunga, Moldova, since 1997\n* Kyzylorda, Kazakhstan, since 1997\n* Muaskar, Algeria, since 1998\n* Kulmbach, Germany, since 1998\n* Pleven, Bulgaria, since 1998\n* Plovdiv, Bulgaria, since 1998\n* Tirana, Albania, since 1998\n* Košice, Slovakia, since 2000\n* Vinnytsia, Ukraine, since 2004\n* Van, Turkey, since 2008\n* Rabat, Morocco, since 2010\n* Bakhchysarai, Ukraine, since 2010\n* Gyeongsangbuk-do, South Korea, since 2011\n* Öskemen, Kazakhstan, since 2011. Bursa. http://en.wikipedia.org/?curid=3450."
  }
}
