{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10365",
  "eid" : "f55ef450-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778491413,
  "textBody" : "Embouchure or lipping[https://www.merriam-webster.com/dictionary/embouchure Merriam-Webster.com] is the use of the lips, facial muscles, tongue, and teeth in playing a wind instrument. This includes shaping the lips to the mouthpiece of a woodwind instrument or the mouthpiece of a brass instrument. The word is of French origin and is related to the root ', 'mouth'. Proper embouchure allows instrumentalists to play their instrument at its full range with a full, clear tone and without strain or damage to their muscles.\n\nBrass embouchure\n\nWhile performing on a brass instrument, the sound is produced by the player buzzing his or her lips into a mouthpiece. Pitches are changed in part through altering the amount of muscular contraction in the lip formation. The performer's use of the air, tightening of cheek and jaw muscles, as well as tongue manipulation can affect how the embouchure works.\n\nEven today, many brass pedagogues take a rigid approach to teaching how a brass player's embouchure should function. Many of these authors also disagree with each other regarding which technique is correct. Research suggests efficient brass embouchures depend on the player using the method that suits that player's particular anatomy (see below). Individual differences in dental structure, lip shape and size, jaw shape and the degree of jaw malocclusion, and other anatomical factors will affect whether a particular embouchure technique will be effective or not.How The Chops Work, Clint McLaughlin, 2003\n\nIn 1962, Philip Farkas hypothesizedThe Art of Brass Playing, Philip Farkas, 1962 that the air stream traveling through the lip aperture should be directed straight down the shank of the mouthpiece. He believed that it would be illogical to \"violently deflect\" the air stream downward at the point of where the air moves past the lips. In this text, Farkas also recommends that the lower jaw be protruded so that the upper and lower teeth are aligned.\n\nIn 1970, Farkas published a second textA Photographic Study of 40 Virtuoso Horn Players, Philip Farkas, 1970 which contradicted his earlier writing. Out of 40 subjects, Farkas showed that 39 subjects directed the air downward to varying degrees and one subject directed the air in an upward direction at various degrees. The lower jaw position seen in these photographs show more variation from his earlier text as well.\n\nThis supports what was written by trombonist and brass pedagogue Donald S. Reinhardt in 1942.Pivot System For Trumpet, Donald S. Reinhardt, 1942Pivot System for Trombone, Donald S. Reinhardt, 1942 In 1972,The Encyclopedia of the Pivot System, Donald S. Reinhardt, 1972 Reinhardt described and labeled different embouchure patterns according to such characteristics as mouthpiece placement and the general direction of the air stream as it travels past the lips. According to this later text, players who place the mouthpiece higher on the lips, so that more upper lip is inside the mouthpiece, will direct the air downwards to varying degrees while playing. Performers who place the mouthpiece lower, so that more lower lip is inside the mouthpiece, will direct the air to varying degrees in an upward manner. In order for the performer to be successful, the air stream direction and mouthpiece placement need to be personalized based on individual anatomical differences. Lloyd Leno confirmed the existence of both upstream and downstream embouchures.\"A Study of Lip Vibrations with High-Speed Photography\", International Trombone Association Journal, Lloyd Leno, 1987\n\nMore controversial was Reinhardt's description and recommendations regarding a phenomenon he termed a \"pivot\". According to Reinhardt, a successful brass embouchure depends on a motion wherein the performer moves both the mouthpiece and lips as a single unit along the teeth in an upward and downward direction. As the performer ascends in pitch, he or she will either move the lips and mouthpiece together slightly up towards the nose or pull them down together slightly towards the chin, and use the opposite motion to descend in pitch. Whether the player uses one general pivot direction or the other, and the degree to which the motion is performed, depends on the performer's anatomical features and stage of development. The placement of the mouthpiece upon the lips doesn't change, but rather the relationship of the rim and lips to the teeth. While the angle of the instrument may change as this motion follows the shape of the teeth and placement of the jaw, contrary to what many brass performers and teachers believe, the angle of the instrument does not actually constitute the motion Reinhardt advised as a pivot.\n\nLater research supports Reinhardt's claim that this motion exists and might be advisable for brass performers to adopt. John Froelich\"The Mouthpiece Forces Used During Trombone Performances\", International Trombone Association Journal, John Froelich, 1990 describes how mouthpiece pressure towards the lips (vertical forces) and shear pressure (horizontal forces) functioned in three test groups, student trombonists, professional trombonists, and professional symphonic trombonists. Froelich noted that the symphonic trombonists used the least amount of both direct and shear forces and recommends this model be followed. Other research notes that virtually all brass performers rely upon the upward and downward embouchure motion.The Correlation Between Doug Elliott's Embouchure Types and Playing and Selected Physical Characteristics Among Trombonists (David Wilken, doctoral dissertation, Ball State University, 2000)An Analysis, Clarification, and Revaluation of Donald Reinhardt's Pivot System for Brass Instruments (David Ray Turnbull, doctoral thesis, Arizona State University, 2001 Other authors and pedagogues remain skeptical about the necessity of this motion, but scientific evidence supporting this view has not been sufficiently developed at this time.\n\nSome noted brass pedagogues prefer to instruct the use of the embouchure from a less analytical point of view. Arnold Jacobs, a tubist and well-regarded brass teacher, believed that it was best for the student to focus on his or her use of the air and musical expression to allow the embouchure to develop naturally on its own.Arnold Jacobs: Song and Wind, Brian Frederiksen, 1996 Other instructors, such as Carmine Caruso, believed that the brass player's embouchure could best be developed through coordination exercises and drills that bring all the muscles into balance that focus the student's attention on his or her time perception.Musical Calisthenics for Brass, Carmine Caruso, 1979 Still other authors who have differing approaches to embouchure development include Louis Maggio,Original Louis Maggio System for Brass, C. MacBeth Jeff Smiley,The Balanced Embouchure, Jeff Smiley Jerome Callet.Superchops, Jerome CalletTrumpet Secrets, Jerome Callet and Clint McLaughlin.Tensionless Playing and \"The 4 Trumpet Octave Keys\" http://www.BbTrumpet.com, Clint 'Pops' McLaughlin\n\nFarkas embouchure\n\nMost professional performers, as well as instructors, use a combination called a puckered smile. Farkas told people to blow as if they were trying to cool soup. Raphael Mendez advised saying the letter \"M\".http://www.bbtrumpet.com/embouchures.html The skin under the lower lip will be taut with no air pocket. The lips do not overlap nor do they roll in or out. The corners of the mouth are held firmly in place. To play with an extended range one should use a pivot, tongue arch and lip to lip compression.\n\nAccording to Farkas the mouthpiece should have  upper lip and  lower lip (French horn),  lower lip and  upper lip (trumpet and cornet), and more latitude for lower brass (trombone, baritone, and tuba). For trumpet, some also advocate  upper lip and  lower lip. Farkas claimed placement was more important for the instruments with smaller mouthpieces. The lips should not overlap each other, nor should they roll in or out. The mouth corners should be held firm. Farkas speculated that the horn should be held in a downward angle to allow the air stream to go straight into the mouthpiece, although his later text shows that air stream direction actually is either upstream or downstream and is dependent upon the ratio of upper or lower lip inside the mouthpiece, not the horn angle. Farkas advised to moisten the outside of the lips, then form the embouchure and gently place the mouthpiece on it. He also recommended there must be a gap of  or so between the teeth so that the air flows freely.\n\nArban vs. Saint-Jacome\n\nArban and Saint-Jacome were both cornet soloists and authors of well respected and still used method books. Arban stated undogmatically that he believed the mouthpiece should be placed  on the top lip. Saint-Jacome to the contrary said dogmatically that the mouthpiece should be placed \"two-thirds for the upper and the rest for the under according to all professors and one-third for the upper and two-thirds for the under according to one sole individual, whom I shall not name.\"Original text: http://www.purtle.com/saint-jacome-method-original-text.html\n\nBuzzing embouchure\n\nThe Farkas set is the basis of most lip buzzing embouchures. Mendez did teach lip buzzing by making the student lip buzz for a month before they could play their trumpet he and got great results. http://www.bbtrumpet.com/lip-buzzing-embouchure-and-mendez/ One can initiate this type of buzz by using the same sensation as spitting seeds, but maintaining a continued flow of air. This technique assists the development of the Farkas approach by preventing the player from using an aperture that is too open.\n\nStevens–Costello embouchure\n\nStevens–Costello embouchure has its origins in the William Costello embouchure and was further developed by Roy Stevens.The Complete Stevens-Costello Embouchure Technique, 2nd Edition by Roy Stevens & Bill Moriarity, Amazon Create Space It uses a slight rolling in of both lips and touching evenly all the way across. It also uses mouthpiece placement of about 40–50% top lip and 50–60% lower lip. The teeth will be about  apart and the teeth are parallel or the jaw slightly forward.\n\nThere is relative mouthpiece pressure to the given air column. One exercise to practice the proper weight to air relationship is the palm exercise where the player holds the horn by laying it on its side in the palm of the hand, not grasping it. The lips are placed on the mouthpiece and the player blows utilizing the weight of the horn in establishing a sound.\n\nMaggio embouchure\n\nA puckered embouchure, used by most players, and sometimes used by jazz players for extremely high \"screamer\" notes. Maggio claimed that the pucker embouchure gives more endurance than some systems. Carlton MacBeth is the main proponent of the pucker embouchure. http://www.bbtrumpet.com/maggio-embouchure/ The Maggio system was established because Louis Maggio had sustained an injury which prevented him from playing. In this system the player cushions the lips by extending them or puckering (like a monkey). This puckering enables the players to overcome physical malformations. It also lets the player play for an extended time in the upper register. The pucker can make it easy to use to open an aperture. Lots of very soft practice can help overcome this. Claude Gordon was a student of Louis Maggio and Herbert L. Clarke and systematized the concepts of these teachers. Claude Gordon made use of pedal tones for embouchure development as did Maggio and Herbert L. Clarke. All three stressed that the mouthpiece should be placed higher on the top lip for a more free vibration of the lips.\n\nTongue-controlled embouchure\n\nThis embouchure method, advocated by a minority of brass pedagogues such as Jerome Callet, has not yet been sufficiently researched to support the claims that this system is the most effective approach for all brass performers.\n\nAdvocates of Callet's approach believe that this method was recommended and taught by the great brass instructors of the early 20th Century. Two French trumpet technique books, authored by Jean-Baptiste Arban and Saint-Jacome, were translated into English for use by American players. According to some, due to a misunderstanding arising from differences in pronunciation between French and English, the commonly used brass embouchure in Europe was incorrectly interpreted. Callet attributes this difference in embouchure technique as the reason the great players of the past were able to play at the level of technical virtuosity which they did, although the increased difficulty of contemporary compositions for brass seem to indicate that the level of brass technique achieved by today's performers equals or even exceeds that of most performers from the late 19th and early 20th centuries.\n\nCallet's method of brass embouchure consists of the tongue remaining forward and through the teeth at all times. The corners of the mouth always remain relaxed, and only a small amount of air is used. The top and bottom lips curl inward and grip the forward tongue. The tongue will force the teeth, and subsequently the throat, wide open, supposedly resulting in a bigger, more open sound. The forward tongue resists the pressure of the mouthpiece, controls the flow of air for lower and higher notes, and protects the lips and teeth from damage or injury from mouthpiece pressure. Because of the importance of the tongue in this method many refer to this as a \"tongue-controlled embouchure\". This technique facilitates the use of a smaller mouthpiece, and larger bore instruments. It results in improved intonation and stronger harmonically related partials across the player's range.\n\nWoodwind embouchure\n\nFlute embouchure\n\nA variety of transverse flute embouchures are employed by professional flautists, though the most natural form is perfectly symmetrical, the corners of the mouth relaxed (i.e. not smiling), the lower lip placed along and at a short distance from the embouchure hole. It must be stressed, however, that achieving a symmetrical, or perfectly centred blowing hole ought not to be an end in itself. Indeed, French flautist Marcel Moyse did not play with a symmetrical embouchure.\n\nThe end-blown xiao, kaval, shakuhachi and hocchiku flutes demand especially difficult embouchures, sometimes requiring many lessons before any sound can be produced.\n\nThe embouchure is an important element to tone production. The right embouchure, developed  with \"time, patience, and intelligent work\", will produce a beautiful sound and a correct intonation. The embouchure is produced with the muscles around the lips: principally  the orbicularis oris muscle and the depressor anguli oris, whilst avoiding activiation of zygomaticus major, which will produce a smile, flattening the top lip against the maxillary (upper jaw) teeth. Beginner flute-players tend to suffer fatigue in these muscles, and notably struggle to use the depressor muscle, which necessarily helps to keep the top lip directing the flow of air across the embouchure hole. These muscles have to be properly warmed up and exercised before practicing. Tone development exercises including long notes and harmonics must be done as part of the warm up every day.\n\nSome further adjustments to the embouchure are necessary when moving from the transverse orchestral flute to the piccolo. With the piccolo, it becomes necessary to place the near side of the embouchure hole slightly higher on the lower lip, i.e. above the lip margin, and greater muscle tone from the lip muscles is needed to keep the stream/pressure of air directed across the smaller embouchure hole, particularly when playing in higher piccolo registers.\n\nReed instrument embouchure\n\nWith the woodwinds, aside from the flute, piccolo, and recorder, the sound is generated by a reed and not with the lips. The embouchure is therefore based on sealing the area around the reed and mouthpiece. This serves to prevent air from escaping while simultaneously supporting the reed, allowing it to vibrate, and constrict the reed preventing it from vibrating too much. With woodwinds, it is important to ensure that the mouthpiece is not placed too far into the mouth, which would result in too much vibration (no control), often creating a sound an octave (or harmonic twelfth for the clarinet) above the intended note. If the mouthpiece is not placed far enough into the mouth, no noise will be generated, as the reed will not vibrate.\n\nThe embouchure for single reed woodwinds like the clarinet and saxophone is formed by resting the reed upon the bottom lip, which rests on the teeth and is supported by the chin muscles and the buccinator muscles on the sides of the mouth. The top teeth then rest on top of the mouthpiece. In saxophone and clarinet playing, the corners of the mouth are brought inwards (similar to a drawstring bag) in order to create a seal. With the less common double-lip embouchure, the top lip is placed under (around) the top teeth. In both instances, the position of the tongue in the mouth plays a vital role in focusing and accelerating the air stream blown by the player. This results in a more mature and full sound, rich in overtones.\n\nThe double reed woodwinds, the oboe and bassoon, have no mouthpiece. Instead the reed is two pieces of cane extending from a metal tube (oboe – staple) or placed on a bocal (bassoon, English horn). The reed is placed directly on the lips and then played like the double-lip embouchure described above. Compared to the single reed woodwinds, the reed is very small and subtle changes in the embouchure can have a dramatic effect on tuning, tone and pitch control.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Embouchure" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10365" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Embouchure or lipping[https://www.merriam-webster.com/dictionary/embouchure Merriam-Webster.com] is the use of the lips, facial muscles, tongue, and teeth in playing a wind instrument. This includes shaping the lips to the mouthpiece of a woodwind instrument or the mouthpiece of a brass instrument. The word is of French origin and is related to the root ', 'mouth'. Proper embouchure allows instrumentalists to play their instrument at its full range with a full, clear tone and without strain or damage to their muscles.\n\nBrass embouchure\n\nWhile performing on a brass instrument, the sound is produced by the player buzzing his or her lips into a mouthpiece. Pitches are changed in part through altering the amount of muscular contraction in the lip formation. The performer's use of the air, tightening of cheek and jaw muscles, as well as tongue manipulation can affect how the embouchure works.\n\nEven today, many brass pedagogues take a rigid approach to teaching how a brass player's embouchure should function. Many of these authors also disagree with each other regarding which technique is correct. Research suggests efficient brass embouchures depend on the player using the method that suits that player's particular anatomy (see below). Individual differences in dental structure, lip shape and size, jaw shape and the degree of jaw malocclusion, and other anatomical factors will affect whether a particular embouchure technique will be effective or not.How The Chops Work, Clint McLaughlin, 2003\n\nIn 1962, Philip Farkas hypothesizedThe Art of Brass Playing, Philip Farkas, 1962 that the air stream traveling through the lip aperture should be directed straight down the shank of the mouthpiece. He believed that it would be illogical to \"violently deflect\" the air stream downward at the point of where the air moves past the lips. In this text, Farkas also recommends that the lower jaw be protruded so that the upper and lower teeth are aligned.\n\nIn 1970, Farkas published a second textA Photographic Study of 40 Virtuoso Horn Players, Philip Farkas, 1970 which contradicted his earlier writing. Out of 40 subjects, Farkas showed that 39 subjects directed the air downward to varying degrees and one subject directed the air in an upward direction at various degrees. The lower jaw position seen in these photographs show more variation from his earlier text as well.\n\nThis supports what was written by trombonist and brass pedagogue Donald S. Reinhardt in 1942.Pivot System For Trumpet, Donald S. Reinhardt, 1942Pivot System for Trombone, Donald S. Reinhardt, 1942 In 1972,The Encyclopedia of the Pivot System, Donald S. Reinhardt, 1972 Reinhardt described and labeled different embouchure patterns according to such characteristics as mouthpiece placement and the general direction of the air stream as it travels past the lips. According to this later text, players who place the mouthpiece higher on the lips, so that more upper lip is inside the mouthpiece, will direct the air downwards to varying degrees while playing. Performers who place the mouthpiece lower, so that more lower lip is inside the mouthpiece, will direct the air to varying degrees in an upward manner. In order for the performer to be successful, the air stream direction and mouthpiece placement need to be personalized based on individual anatomical differences. Lloyd Leno confirmed the existence of both upstream and downstream embouchures.\"A Study of Lip Vibrations with High-Speed Photography\", International Trombone Association Journal, Lloyd Leno, 1987\n\nMore controversial was Reinhardt's description and recommendations regarding a phenomenon he termed a \"pivot\". According to Reinhardt, a successful brass embouchure depends on a motion wherein the performer moves both the mouthpiece and lips as a single unit along the teeth in an upward and downward direction. As the performer ascends in pitch, he or she will either move the lips and mouthpiece together slightly up towards the nose or pull them down together slightly towards the chin, and use the opposite motion to descend in pitch. Whether the player uses one general pivot direction or the other, and the degree to which the motion is performed, depends on the performer's anatomical features and stage of development. The placement of the mouthpiece upon the lips doesn't change, but rather the relationship of the rim and lips to the teeth. While the angle of the instrument may change as this motion follows the shape of the teeth and placement of the jaw, contrary to what many brass performers and teachers believe, the angle of the instrument does not actually constitute the motion Reinhardt advised as a pivot.\n\nLater research supports Reinhardt's claim that this motion exists and might be advisable for brass performers to adopt. John Froelich\"The Mouthpiece Forces Used During Trombone Performances\", International Trombone Association Journal, John Froelich, 1990 describes how mouthpiece pressure towards the lips (vertical forces) and shear pressure (horizontal forces) functioned in three test groups, student trombonists, professional trombonists, and professional symphonic trombonists. Froelich noted that the symphonic trombonists used the least amount of both direct and shear forces and recommends this model be followed. Other research notes that virtually all brass performers rely upon the upward and downward embouchure motion.The Correlation Between Doug Elliott's Embouchure Types and Playing and Selected Physical Characteristics Among Trombonists (David Wilken, doctoral dissertation, Ball State University, 2000)An Analysis, Clarification, and Revaluation of Donald Reinhardt's Pivot System for Brass Instruments (David Ray Turnbull, doctoral thesis, Arizona State University, 2001 Other authors and pedagogues remain skeptical about the necessity of this motion, but scientific evidence supporting this view has not been sufficiently developed at this time.\n\nSome noted brass pedagogues prefer to instruct the use of the embouchure from a less analytical point of view. Arnold Jacobs, a tubist and well-regarded brass teacher, believed that it was best for the student to focus on his or her use of the air and musical expression to allow the embouchure to develop naturally on its own.Arnold Jacobs: Song and Wind, Brian Frederiksen, 1996 Other instructors, such as Carmine Caruso, believed that the brass player's embouchure could best be developed through coordination exercises and drills that bring all the muscles into balance that focus the student's attention on his or her time perception.Musical Calisthenics for Brass, Carmine Caruso, 1979 Still other authors who have differing approaches to embouchure development include Louis Maggio,Original Louis Maggio System for Brass, C. MacBeth Jeff Smiley,The Balanced Embouchure, Jeff Smiley Jerome Callet.Superchops, Jerome CalletTrumpet Secrets, Jerome Callet and Clint McLaughlin.Tensionless Playing and \"The 4 Trumpet Octave Keys\" http://www.BbTrumpet.com, Clint 'Pops' McLaughlin\n\nFarkas embouchure\n\nMost professional performers, as well as instructors, use a combination called a puckered smile. Farkas told people to blow as if they were trying to cool soup. Raphael Mendez advised saying the letter \"M\".http://www.bbtrumpet.com/embouchures.html The skin under the lower lip will be taut with no air pocket. The lips do not overlap nor do they roll in or out. The corners of the mouth are held firmly in place. To play with an extended range one should use a pivot, tongue arch and lip to lip compression.\n\nAccording to Farkas the mouthpiece should have  upper lip and  lower lip (French horn),  lower lip and  upper lip (trumpet and cornet), and more latitude for lower brass (trombone, baritone, and tuba). For trumpet, some also advocate  upper lip and  lower lip. Farkas claimed placement was more important for the instruments with smaller mouthpieces. The lips should not overlap each other, nor should they roll in or out. The mouth corners should be held firm. Farkas speculated that the horn should be held in a downward angle to allow the air stream to go straight into the mouthpiece, although his later text shows that air stream direction actually is either upstream or downstream and is dependent upon the ratio of upper or lower lip inside the mouthpiece, not the horn angle. Farkas advised to moisten the outside of the lips, then form the embouchure and gently place the mouthpiece on it. He also recommended there must be a gap of  or so between the teeth so that the air flows freely.\n\nArban vs. Saint-Jacome\n\nArban and Saint-Jacome were both cornet soloists and authors of well respected and still used method books. Arban stated undogmatically that he believed the mouthpiece should be placed  on the top lip. Saint-Jacome to the contrary said dogmatically that the mouthpiece should be placed \"two-thirds for the upper and the rest for the under according to all professors and one-third for the upper and two-thirds for the under according to one sole individual, whom I shall not name.\"Original text: http://www.purtle.com/saint-jacome-method-original-text.html\n\nBuzzing embouchure\n\nThe Farkas set is the basis of most lip buzzing embouchures. Mendez did teach lip buzzing by making the student lip buzz for a month before they could play their trumpet he and got great results. http://www.bbtrumpet.com/lip-buzzing-embouchure-and-mendez/ One can initiate this type of buzz by using the same sensation as spitting seeds, but maintaining a continued flow of air. This technique assists the development of the Farkas approach by preventing the player from using an aperture that is too open.\n\nStevens–Costello embouchure\n\nStevens–Costello embouchure has its origins in the William Costello embouchure and was further developed by Roy Stevens.The Complete Stevens-Costello Embouchure Technique, 2nd Edition by Roy Stevens & Bill Moriarity, Amazon Create Space It uses a slight rolling in of both lips and touching evenly all the way across. It also uses mouthpiece placement of about 40–50% top lip and 50–60% lower lip. The teeth will be about  apart and the teeth are parallel or the jaw slightly forward.\n\nThere is relative mouthpiece pressure to the given air column. One exercise to practice the proper weight to air relationship is the palm exercise where the player holds the horn by laying it on its side in the palm of the hand, not grasping it. The lips are placed on the mouthpiece and the player blows utilizing the weight of the horn in establishing a sound.\n\nMaggio embouchure\n\nA puckered embouchure, used by most players, and sometimes used by jazz players for extremely high \"screamer\" notes. Maggio claimed that the pucker embouchure gives more endurance than some systems. Carlton MacBeth is the main proponent of the pucker embouchure. http://www.bbtrumpet.com/maggio-embouchure/ The Maggio system was established because Louis Maggio had sustained an injury which prevented him from playing. In this system the player cushions the lips by extending them or puckering (like a monkey). This puckering enables the players to overcome physical malformations. It also lets the player play for an extended time in the upper register. The pucker can make it easy to use to open an aperture. Lots of very soft practice can help overcome this. Claude Gordon was a student of Louis Maggio and Herbert L. Clarke and systematized the concepts of these teachers. Claude Gordon made use of pedal tones for embouchure development as did Maggio and Herbert L. Clarke. All three stressed that the mouthpiece should be placed higher on the top lip for a more free vibration of the lips.\n\nTongue-controlled embouchure\n\nThis embouchure method, advocated by a minority of brass pedagogues such as Jerome Callet, has not yet been sufficiently researched to support the claims that this system is the most effective approach for all brass performers.\n\nAdvocates of Callet's approach believe that this method was recommended and taught by the great brass instructors of the early 20th Century. Two French trumpet technique books, authored by Jean-Baptiste Arban and Saint-Jacome, were translated into English for use by American players. According to some, due to a misunderstanding arising from differences in pronunciation between French and English, the commonly used brass embouchure in Europe was incorrectly interpreted. Callet attributes this difference in embouchure technique as the reason the great players of the past were able to play at the level of technical virtuosity which they did, although the increased difficulty of contemporary compositions for brass seem to indicate that the level of brass technique achieved by today's performers equals or even exceeds that of most performers from the late 19th and early 20th centuries.\n\nCallet's method of brass embouchure consists of the tongue remaining forward and through the teeth at all times. The corners of the mouth always remain relaxed, and only a small amount of air is used. The top and bottom lips curl inward and grip the forward tongue. The tongue will force the teeth, and subsequently the throat, wide open, supposedly resulting in a bigger, more open sound. The forward tongue resists the pressure of the mouthpiece, controls the flow of air for lower and higher notes, and protects the lips and teeth from damage or injury from mouthpiece pressure. Because of the importance of the tongue in this method many refer to this as a \"tongue-controlled embouchure\". This technique facilitates the use of a smaller mouthpiece, and larger bore instruments. It results in improved intonation and stronger harmonically related partials across the player's range.\n\nWoodwind embouchure\n\nFlute embouchure\n\nA variety of transverse flute embouchures are employed by professional flautists, though the most natural form is perfectly symmetrical, the corners of the mouth relaxed (i.e. not smiling), the lower lip placed along and at a short distance from the embouchure hole. It must be stressed, however, that achieving a symmetrical, or perfectly centred blowing hole ought not to be an end in itself. Indeed, French flautist Marcel Moyse did not play with a symmetrical embouchure.\n\nThe end-blown xiao, kaval, shakuhachi and hocchiku flutes demand especially difficult embouchures, sometimes requiring many lessons before any sound can be produced.\n\nThe embouchure is an important element to tone production. The right embouchure, developed  with \"time, patience, and intelligent work\", will produce a beautiful sound and a correct intonation. The embouchure is produced with the muscles around the lips: principally  the orbicularis oris muscle and the depressor anguli oris, whilst avoiding activiation of zygomaticus major, which will produce a smile, flattening the top lip against the maxillary (upper jaw) teeth. Beginner flute-players tend to suffer fatigue in these muscles, and notably struggle to use the depressor muscle, which necessarily helps to keep the top lip directing the flow of air across the embouchure hole. These muscles have to be properly warmed up and exercised before practicing. Tone development exercises including long notes and harmonics must be done as part of the warm up every day.\n\nSome further adjustments to the embouchure are necessary when moving from the transverse orchestral flute to the piccolo. With the piccolo, it becomes necessary to place the near side of the embouchure hole slightly higher on the lower lip, i.e. above the lip margin, and greater muscle tone from the lip muscles is needed to keep the stream/pressure of air directed across the smaller embouchure hole, particularly when playing in higher piccolo registers.\n\nReed instrument embouchure\n\nWith the woodwinds, aside from the flute, piccolo, and recorder, the sound is generated by a reed and not with the lips. The embouchure is therefore based on sealing the area around the reed and mouthpiece. This serves to prevent air from escaping while simultaneously supporting the reed, allowing it to vibrate, and constrict the reed preventing it from vibrating too much. With woodwinds, it is important to ensure that the mouthpiece is not placed too far into the mouth, which would result in too much vibration (no control), often creating a sound an octave (or harmonic twelfth for the clarinet) above the intended note. If the mouthpiece is not placed far enough into the mouth, no noise will be generated, as the reed will not vibrate.\n\nThe embouchure for single reed woodwinds like the clarinet and saxophone is formed by resting the reed upon the bottom lip, which rests on the teeth and is supported by the chin muscles and the buccinator muscles on the sides of the mouth. The top teeth then rest on top of the mouthpiece. In saxophone and clarinet playing, the corners of the mouth are brought inwards (similar to a drawstring bag) in order to create a seal. With the less common double-lip embouchure, the top lip is placed under (around) the top teeth. In both instances, the position of the tongue in the mouth plays a vital role in focusing and accelerating the air stream blown by the player. This results in a more mature and full sound, rich in overtones.\n\nThe double reed woodwinds, the oboe and bassoon, have no mouthpiece. Instead the reed is two pieces of cane extending from a metal tube (oboe – staple) or placed on a bocal (bassoon, English horn). The reed is placed directly on the lips and then played like the double-lip embouchure described above. Compared to the single reed woodwinds, the reed is very small and subtle changes in the embouchure can have a dramatic effect on tuning, tone and pitch control. Embouchure. http://en.wikipedia.org/?curid=10365."
  }
}
