{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5717",
  "eid" : "d755bed0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778441021,
  "textBody" : "The Canary Islands (; ,) also known as the Canaries (), are an archipelago and autonomous community of Spain located on the Atlantic Ocean, 100 km west of Morocco at the closest. The Canaries are among the outermost regions (OMR) of the European Union proper. It is also one of the eight regions with special consideration of historical nationality recognized as such by the Spanish Government.[https://web.archive.org/web/20060515081511/http://www.gobcan.es/reformaestatuto/index.aspx Reforma de Estatuto de las Islas Canarias][http://coloquioscanariasamerica.casadecolon.com/index.php/CHCA/article/viewFile/7612/6583 Canarias en la España contemporánea: La formación de una nacionalidad histórica] \n\nThe seven main islands are (from largest to smallest in area) Tenerife, Fuerteventura, Gran Canaria, Lanzarote, La Palma, La Gomera and El Hierro. The archipelago includes much smaller islands and islets: La Graciosa, Alegranza, Isla de Lobos, Montaña Clara, Roque del Oeste and Roque del Este. In ancient times, the island chain was often referred to as \"the Fortunate Isles\". The Canary Islands are the most southerly region of Spain and the largest and most populated archipelago of the Macaronesia region.[http://catalogo.museosdetenerife.org/cdm/singleitem/collection/MACAMONO/id/16/rec/1 La Macaronesia. Consideraciones geológicas, biogeográficas y paleoecológicas] Historically, the Canary Islands has been considered a bridge between three continents; Africa, America and Europe.[http://www.lanacion.com.ar/451062-canarias-un-puente-entre-continentes Canarias, un puente entre continentes]\n\nThe archipelago's beaches, climate and important natural attractions, especially Maspalomas in Gran Canaria and Teide National Park and Mount Teide (a World Heritage Site) in Tenerife (the third tallest volcano in the world measured from its base on the ocean floor), make it a major tourist destination with over 12 million visitors per year, especially Gran Canaria, Tenerife, Fuerteventura and Lanzarote.[http://www.gobiernodecanarias.org/istac/estadisticas/turismo/area_11a_frame.html Página web]  del ISTAC sobre entrada de turistas en Canarias.[none#'Menú Principal'!A1 Estadísticas de Turismo de Tenerife]  The islands have a subtropical climate, with long hot summers and moderately warm winters. The precipitation levels and the level of maritime moderation vary depending on location and elevation. Green areas as well as desert exist on the archipelago. Due to their location above the temperature inversion layer, the high mountains of these islands are ideal for astronomical observation. For this reason, two professional observatories, Teide Observatory on the island of Tenerife and Roque de los Muchachos Observatory on the island of La Palma, have been built on the islands.\n\nThe capital of the Autonomous Community is shared by the cities of Santa Cruz de Tenerife and Las Palmas de Gran Canaria,[http://es.wikisource.org/wiki/Real_Decreto_de_30_de_noviembre_de_1833 Real Decreto de 30 de noviembre de 1833] en wikisource[http://www.gobiernodecanarias.org/tuestatuto/docs/1833-12-03%20Decreto%20de%20division%20provincial.pdf Real Decreto de 30 de noviembre de 1833]  en el sitio web oficial del Gobierno de Canarias which in turn are the capitals of the provinces of Santa Cruz de Tenerife and Province of Las Palmas. Las Palmas de Gran Canaria has been the largest city in the Canaries since 1768, except for a brief period in the 1910s.[http://www.canarias7.es/articulo.cfm?Id40362 Canarias7. Economía. La población de Canarias se ha multiplicado por trece en los últimos 250 años] Between the 1833 territorial division of Spain and 1927 Santa Cruz de Tenerife was the sole capital of the Canary Islands. In 1927 a decree ordered that the capital of the Canary Islands be shared, as it remains at present.[http://es.wikisource.org/wiki/Real_Decreto_de_30_de_noviembre_de_1833 Real Decreto de 30 de noviembre de 1833] on wikisource[http://www.gobiernodecanarias.org/tuestatuto/docs/1833-12-03%20Decreto%20de%20division%20provincial.pdf Real Decreto de 30 de noviembre de 1833]  at the official website of the Canary Islands Government The third largest city of the Canary Islands is San Cristóbal de La Laguna (a World Heritage Site) on Tenerife. This city is also home to the Consejo Consultivo de Canarias, which is the supreme consultative body of the Canary Islands.[http://www.consultivodecanarias.org/casa/ Sede del Consejo Consultivo de Canarias]\n\nDuring the time of the Spanish Empire, the Canaries were the main stopover for Spanish galleons on their way to the Americas, which came south to catch the prevailing northeasterly trade winds.\n\nEtymology \n\nThe name Islas Canarias is likely derived from the Latin name Canariae Insulae, meaning \"Islands of the Dogs\", a name that was applied only to Gran Canaria. According to the historian Pliny the Elder, the Mauretanian king Juba II named the island Canaria because it contained \"vast multitudes of dogs of very large size\".Pliny the Elder, The Natural History, Chap. 37. (32.)—The Fortunate Islands\n\nAnother speculation is that the so-called dogs were actually a species of monk seal (canis marinus or \"sea dog\" was a Latin term for \"seal\"Lewis and Short, A Latin Dictionary, canis, sense II. B), critically endangered and no longer present in the Canary Islands. The dense population of seals may have been the characteristic that most struck the few ancient Romans who established contact with these islands by sea.\n\nAlternatively, it is said that the original inhabitants of the island, Guanches, used to worship dogs, mummified them and treated dogs generally as holy animals.[http://www.touropia.com/facts-about-the-canary-islands/ 10 Facts about the Canary Islands] – Touropia.com – Retrieved 22 August 2011. The ancient Greeks also knew about a people, living far to the west, who are the \"dog-headed ones\", who worshipped dogs on an island. Some hypothesize that the Canary Islands dog-worship and the ancient Egyptian cult of the dog-headed god, Anubis are closely connected but there is no explanation given as to which one was first.\n\nOther theories speculate that the name comes from the Nukkari Berber tribe living in the Moroccan Atlas, named in Roman sources as Canarii, though Pliny again mentions the relation of this term with dogs.\n\nThe connection to dogs is retained in their depiction on the islands' coat-of-arms (shown above).\n\nIt is considered that the aborigines of Gran Canaria called themselves \"Canarii\". It is possible that after being conquered, this name was used in plural in Spanish, i.e., as to refer to all of the islands as the Canarii-as.\n\nWhat is certain is that the name of the islands does not derive from the canary bird; rather, the birds are named after the islands.\n\nPhysical geography \n\nTenerife is the largest and most populous island of the archipelago. Gran Canaria, with 865,070 inhabitants, is both the Canary Islands' second most populous island, and the third most populous one in Spain after Majorca. The island of Fuerteventura is the second largest in the archipelago and located 100 km from the African coast.\n\nThe islands form the Macaronesia ecoregion with the Azores, Cape Verde, Madeira, and the Savage Isles. The Canary Islands is the largest and most populated archipelago of the Macaronesia region. The archipelago consists of seven large and several smaller islands, all of which are volcanic in origin.[http://www.mantleplumes.org/Canary.html (Universidad de Las Palmas,) José Mangas Viñuela, \"The Canary Islands Hot Spot\"] This is the source for the geological history that follows. \n\nAccording to the position of the islands with respect to the north-east trade winds, the climate can be mild and wet or very dry. Several native species form laurisilva forests.\n\nAs a consequence, the individual islands in the Canary archipelago tend to have distinct microclimates. Those islands such as El Hierro, La Palma and La Gomera lying to the west of the archipelago have a climate which is influenced by the moist Gulf Stream. They are well vegetated even at low levels and have extensive tracts of sub-tropical laurisilva forest. As one travels east toward the African coast, the influence of the gulf stream diminishes, and the islands become increasingly arid. Fuerteventura and Lanzarote the islands which are closest to the African mainland are effectively desert or semi desert. Gran Canaria is known as a \"continent in miniature\" for its diverse landscapes like Maspalomas and Roque Nublo. In terms of its climate Tenerife is particularly interesting. The north of the island lies under the influence of the moist Atlantic winds and is well vegetated, while the south of the island around the tourist resorts of Playa de las Americas and Los Cristianos is arid. The island rises to almost 4000 m above sea level, and at altitude, in the cool relatively wet climate, forests of the endemic pine Pinus canariensis thrive. Many of the plant species in the Canary Islands, like the Canary Island pine and the dragon tree, Dracaena draco are endemic, as noted by Sabin Berthelot and Philip Barker Webb in their epic work, L'Histoire Naturelle des Îles Canaries (1835–50).\n\nClimate \n\nThe climate is tropical and desertic, moderated by the sea and in summer by the trade winds. There are a number of microclimates and the classifications range mainly from semi-arid to desert. According to the Köppen climate classification,https://upload.wikimedia.org/wikipedia/commons/3/32/World_Koppen_Map.png the majority of the Canary Islands have a hot desert climate represented as BWh. There also exists a subtropical humid climate which is very influenced by the ocean in the middle of the islands of La Gomera, Tenerife and La Palma; where the laurisilva forests grow.\n\nGeology \n\nThe seven major islands, one minor island, and several small islets were originally volcanic islands, formed by the Canary hotspot. The Canary Islands is the only place in Spain where volcanic eruptions have been recorded during the Modern Era, with some volcanoes still active (El Hierro, 2011).\nVolcanic islands such as those in the Canary chain often have steep ocean cliffs caused by catastrophic debris avalanches and landslides.Pararas-Carayannis, G. (2002). \"Evaluation of the Threat of Mega Tsunami Generation from Postulated Massive Slope Failure of Island Stratovolcanoes on La Palma, Canary Islands, and on The Island of Hawaii, George\". Science of Tsunami Hazards 20 (5): 251–277.\n\nThe Teide volcano on Tenerife is the highest mountain in Spain, and the third tallest volcano on Earth on a volcanic ocean island. All the islands except La Gomera have been active in the last million years; four of them (Lanzarote, Tenerife, La Palma and El Hierro) have historical records of eruptions since European discovery. The islands rise from Jurassic oceanic crust associated with the opening of the Atlantic. Underwater magmatism commenced during the Cretaceous, and reached the ocean's surface during the Miocene. The islands are considered as a distinct physiographic section of the Atlas Mountains province, which in turn is part of the larger African Alpine System division.\n\nIn the summer of 2011 a series of low-magnitude earthquakes occurred beneath El Hierro. These had a linear trend of northeast-southwest. In October a submarine eruption occurred about 2 km south of Restinga. This eruption produced gases and pumice, but no explosive activity was reported.\n\nThe following table shows the highest mountains in each of the islands:\n\nNatural symbols \n\nThe official natural symbols associated with Canary Islands are the bird Serinus canaria (canary) and the Phoenix canariensis palm.\n\nFile:Serinus canaria LC0210.jpg|Serinus canaria\nFile:Phoenix canariensis ag.JPG|Phoenix canariensis\n\nNational parks \n\nFour of Spain's thirteen national parks are located in the Canary Islands, more than any other autonomous community. Teide National Park is the most visited in Spain, and the oldest and largest within the Canary Islands. The parks are:\n\nThe Canary Islands have four national parks, of which two have been declared World Heritage Site by UNESCO, and the other two declared a World Biosphere Reserve, these national parks are:\n* Caldera de Taburiente National Park (La Palma): Created in 1954, it was declared a World Biosphere Reserve in 2002. It covers an area of .\n* Garajonay National Park (La Gomera): Created in 1981, it was declared in 1986 a World Heritage Site. Its area is 3986 hectares at the core and some areas north of the island.\n* Timanfaya National Park (Lanzarote): Created in 1974, it was declared a Biosphere Reserve in 1993, together with the whole island. Occupies an area of , is located in the southwest of the island.\n* Teide National Park (Tenerife): Created in 1954, it was declared a World Heritage Site in 2007. It covers an area of 18,990 hectares, is the oldest and largest national park in the Canary Islands and one of the oldest in Spain. The Teide in 2010 became the most visited national park in Europe and second worldwide. Located in the geographic center of the island is the most visited National Park in Spain. The highlight is the Teide at 3,718 meters altitude, is the highest elevation of the country and the third largest volcano on Earth from its base. Teide National Park was declared in 2007 as one of the 12 Treasures of Spain.\n\nPolitics\n\nGovernance\n\nThe islands have 13 seats in the Spanish Senate. Of these, 11 seats are directly elected, 3 for Gran Canaria, 3 for Tenerife, 1 for each other island; 2 seats are indirectly elected by the regional Autonomous Government. The local government is presided over by Fernando Clavijo, the current President of the Canary Islands.\n\nCanarian nationalism\n\nThere are some pro-independence political parties, like the National Congress of the Canaries (CNC) and the Popular Front of the Canary Islands, but these parties are non-violent, and their popular support is almost insignificant, with no presence in either the autonomous parliament or the cabildos insulares.\n\nAccording to \"Centro de Investigaciones Sociológicas\" (Sociological Research Center) in 2010, 43.5% of the population of the Canary Islands feels more Canarian than Spanish (37.6%), of which 7.6% only Canarian, compared to 5.4% that feels more Spanish than Canarian (2.4%) or only Spanish (3%). The most popular choice was of those who feel equally Spanish and Canarian, with 49.9%. With these data, one of the Canary recorded levels of identification with higher autonomy from Spain.\n\nPolitical geography \n\nThe Autonomous Community of the Canary Islands consists of two provinces, Las Palmas and Santa Cruz de Tenerife, whose capitals (Las Palmas de Gran Canaria and Santa Cruz de Tenerife) are capitals of the autonomous community. Each of the seven major islands is ruled by an island council named Cabildo Insular.\n\nThe international boundary of the Canaries is the subject of dispute between Spain and Morocco. Morocco's official position is that international laws regarding territorial limits do not authorise Spain to claim seabed boundaries based on the territory of the Canaries, since the Canary Islands enjoy a large degree of autonomy. \n\nThe boundary determines the ownership of seabed oil deposits and other ocean resources. Morocco and Spain have been unable to agree on a compromise regarding the territorial boundary, since neither nation wants to cede its claimed right to the vast resources whose ownership depends upon the boundary. In 2002, for example, Morocco rejected a unilateral Spanish proposal.\n\nHistory \n\nAncient and pre-colonial times \n\nBefore the arrival of humans, the Canaries were inhabited by prehistoric animals; for example, the giant lizard (Gallotia goliath) and the Tenerife and Gran Canaria giant rats.[http://www.gobiernodecanarias.org/cmayot/medioambiente/lagartodelagomera/gatos.html Según la Página Web del Gobierno de Canarias]  Also the giant prehistoric tortoises; Geochelone burchardi and Geochelone vulcanica.\n\nThe islands may have been visited by the Phoenicians, the Greeks, and the Carthaginians. King Juba II, Caesar Augustus's Numidian protégé, is credited with discovering the islands for the Western world. According to Pliny the Elder, Juba found the islands uninhabited, but found \"a small temple of stone\" and \"some traces of buildings\". Juba dispatched a naval contingent to re-open the dye production facility at Mogador in what is now western Morocco in the early first century AD. That same naval force was subsequently sent on an exploration of the Canary Islands, using Mogador as their mission base.\n\nThe Romans named the individual islands Ninguaria or Nivaria (Tenerife), Canaria (Gran Canaria), Pluvialia or Invale (Lanzarote), Ombrion (La Palma), Planasia (Fuerteventura), Iunonia or Junonia (El Hierro) and Capraria (La Gomera).\n\nWhen the Europeans began to explore the islands in the late Middle Ages, they encountered several indigenous peoples living at a Neolithic level of technology. Although the prehistory of the settlement of the Canary Islands is still unclear, linguistic and genetic analyses seem to indicate that at least some of these inhabitants shared a common origin with the Berbers of Tamazgha. The pre-colonial inhabitants came to be known collectively as the Guanches, although Guanches had been the name for only the indigenous inhabitants of Tenerife. From the 14th century onward, numerous visits were made by sailors from Majorca, Portugal and Genoa. Lancelotto Malocello settled on Lanzarote in 1312. The Majorcans established a mission with a bishop in the islands that lasted from 1350 to 1400.\n\nCastilian conquest \n\nIn 1402, the Castilian conquest of the islands began, with the expedition of French explorers Jean de Béthencourt and Gadifer de la Salle, nobles and vassals of Henry III of Castile, to Lanzarote. From there, they conquered Fuerteventura (1405) and El Hierro. Béthencourt received the title King of the Canary Islands, but still recognised King Henry III as his overlord.\n\nBéthencourt also established a base on the island of La Gomera, but it would be many years before the island was truly conquered. The natives of La Gomera, and of Gran Canaria, Tenerife, and La Palma, resisted the Castilian invaders for almost a century. In 1448 Maciot de Béthencourt sold the lordship of Lanzarote to Portugal's Prince Henry the Navigator, an action that was not accepted by the natives nor by the Castilians. Despite Pope Nicholas V ruling that the Canary Islands were under Portuguese control, a crisis swelled to a revolt which lasted until 1459 with the final expulsion of the Portuguese. In 1479, Portugal and Castile signed the Treaty of Alcáçovas. The treaty settled disputes between Castile and Portugal over the control of the Atlantic, in which Castilian control of the Canary Islands was recognised but which also confirmed Portuguese possession of the Azores, Madeira, and the Cape Verde islands, and gave them rights to lands discovered and to be discovered, and any other island which might be found and conquered from the Canary Islands beyond toward Guinea.\n\nThe Castilians continued to dominate the islands, but due to the topography and the resistance of the native Guanches, they did not achieve complete control until 1495, when Tenerife and La Palma were finally subdued by Alonso Fernández de Lugo. After that, the Canaries were incorporated into the Kingdom of Castile.\n\nAfter the conquest \n\nAfter the conquest, the Castilians imposed a new economic model, based on single-crop cultivation: first sugarcane; then wine, an important item of trade with England. In this era, the first institutions of colonial government were founded. Gran Canaria, a colony of the Crown of Castile since 6 March 1480 (from 1556, of Spain), and Tenerife, a Spanish colony since 1495, each had its own governor.\n\nThe cities of Santa Cruz de Tenerife and Las Palmas de Gran Canaria became a stopping point for the Spanish conquerors, traders, and missionaries on their way to the New World. This trade route brought great prosperity to some of the social sectors of the islands. The islands became quite wealthy and soon were attracting merchants and adventurers from all over Europe. Magnificent palaces and churches were built on La Palma during this busy, prosperous period. The Church of El Salvador survives as one of the island's finest examples of the architecture of the 16th century.\n\nThe Canaries' wealth invited attacks by pirates and privateers. Ottoman Turkish admiral and privateer Kemal Reis ventured into the Canaries in 1501, while Murat Reis the Elder captured Lanzarote in 1585.\n\nThe most severe attack took place in 1599, during the Dutch Revolt. A Dutch fleet of 74 ships and 12,000 men, commanded by Pieter van der Does, attacked the capital Las Palmas de Gran Canaria (the city had 3,500 of Gran Canaria's 8,545 inhabitants). The Dutch attacked the Castillo de la Luz, which guarded the harbor. The Canarians evacuated civilians from the city, and the Castillo surrendered (but not the city). The Dutch moved inland, but Canarian cavalry drove them back to Tamaraceite, near the city.\n\nThe Dutch then laid siege to the city, demanding the surrender of all its wealth. They received 12 sheep and 3 calves. Furious, the Dutch sent 4,000 soldiers to attack the Council of the Canaries, who were sheltering in the village of Santa Brígida. 300 Canarian soldiers ambushed the Dutch in the village of Monte Lentiscal, killing 150 and forcing the rest to retreat. The Dutch concentrated on Las Palmas de Gran Canaria, attempting to burn it down. The Dutch pillaged Maspalomas, on the southern coast of Gran Canaria, San Sebastián on La Gomera, and Santa Cruz on La Palma, but eventually gave up the siege of Las Palmas and withdrew.\n\nIn 1618 the Barbary pirates attacked Lanzarote and La Gomera taking 1000 captives to be sold as slaves.John Mercer (1980), The Canary Islanders : their prehistory, conquest, and survival, p. 236, Collings. Another noteworthy attack occurred in 1797, when Santa Cruz de Tenerife was attacked by a British fleet under Horatio Nelson on 25 July. The British were repulsed, losing almost 400 men. It was during this battle that Nelson lost his right arm.\n\n18th to 19th century \n\nThe sugar-based economy of the islands faced stiff competition from Spain's American colonies. Low prices in the sugar market in the 19th century caused severe recessions on the islands. A new cash crop, cochineal (cochinilla), came into cultivation during this time, saving the islands' economy. During this time the Canarian-American trade was developed, in which Canarian products such as cochineal, sugarcane and rum are sold in American ports, such as Veracruz, Campeche, La Guaira and Havana among others.[http://www.canariascnnews.com/index.php/mirador/canarias/item/1721-el-comercio-canario-americano-en-el-siglo-xviii-i-parte El comercio canario-americano en el siglo XVIII]\n\nBy the end of the 18th century, Canary Islanders had already emigrated to Spanish American territories, such as Havana, Veracruz, Santo Domingo, San Antonio, Texas and St. Bernard Parish, Louisiana. These economic difficulties spurred mass emigration, primarily to the Americas, during the 19th and first half of the 20th century. Between 1840 and 1890 as many as 40,000 Canary Islanders emigrated to Venezuela. Also, thousands of Canarians moved to Puerto Rico where the Spanish monarchy felt that Canarians would adapt to island life better than other immigrants from the mainland of Spain. Deeply entrenched traditions, such as the Mascaras Festival in the town of Hatillo, Puerto Rico, are an example of Canarian culture still preserved in Puerto Rico. Similarly, many thousands of Canarians emigrated to the shores of Cuba. During the Spanish–American War of 1898, the Spanish fortified the islands against a possible American attack, but no such event took place.\n\nRomantic period and scientific expeditions \n\nSirera and Renn (2004) distinguish two different types of expeditions, or voyages, during the period 1770–1830, which they term \"the Romantic period\":\n\nFirst are \"expeditions financed by the States, closely related with the official scientific Institutions. characterised by having strict scientific objectives (and inspired by) the spirit of Illustration and progress\". In this type of expedition, Sirera and Renn include the following travellers:\n* J. Edens, whose 1715 ascent and observations of Mt. Teide influenced many subsequent expeditions.\n* Louis Feuillée (1724), who was sent to measure the meridian of El Hierro and to map the islands.\n* Jean-Charles de Borda (1771, 1776) who more accurately measured the longitudes of the islands and the height of Mount Teide\n* the Baudin-Ledru expedition (1796) which aimed to recover a valuable collection of natural history objects.\n\nThe second type of expedition identified by Sirera and Renn is one that took place starting from more or less private initiatives. Among these, the key exponents were the following:\n* Alexander von Humboldt (1799)\n* Buch and Smith (1815)\n* Broussonet\n* Webb\n* Sabin Berthelot.\n\nSirera and Renn identify the period 1770–1830 as one in which \"In a panorama dominated until that moment by France and England enters with strength and brio Germany of the Romantic period whose presence in the islands will increase\".\n\nEarly 20th century \n\nAt the beginning of the 20th century, the British introduced a new cash-crop, the banana, the export of which was controlled by companies such as Fyffes.\n\nThe rivalry between the elites of the cities of Las Palmas de Gran Canaria and Santa Cruz de Tenerife for the capital of the islands led to the division of the archipelago into two provinces in 1927. This has not laid to rest the rivalry between the two cities, which continues to this day.\n\nDuring the time of the Second Spanish Republic, Marxist and anarchist workers' movements began to develop, led by figures such as Jose Miguel Perez and Guillermo Ascanio. However, outside of a few municipalities, these organisations were a minority and fell easily to Nationalist forces during the Spanish Civil War.\n\nFranco regime \n\nIn 1936, Francisco Franco was appointed General Commandant of the Canaries. He joined the military revolt of 17 July which began the Spanish Civil War. Franco quickly took control of the archipelago, except for a few points of resistance on La Palma and in the town of Vallehermoso, on La Gomera. Though there was never a war in the islands, the post-war suppression of political dissent on the Canaries was most severe.\n\nDuring the Second World War, Winston Churchill prepared plans for the British seizure of the Canary Islands as a naval base, in the event of Gibraltar being invaded from the Spanish mainland.\n\nOpposition to Franco's regime did not begin to organise until the late 1950s, which experienced an upheaval of parties such as the Communist Party of Spain and the formation of various nationalist, leftist parties.\n\nSelf-governance \n\nAfter the death of Franco, there was a pro-independence armed movement based in Algeria, the Movement for the Independence and Self-determination of the Canaries Archipelago (MAIAC). In 1968, the Organisation of African Unity recognized the MAIAC as a legitimate African independence movement, and declared the Canary Islands as an African territory still under foreign rule.James B. Minahan (2002), Encyclopedia of the Stateless Nations: Ethnic and National Groups Around the World, p. 377, Greenwood.\n\nAfter the establishment of a democratic constitutional monarchy in Spain, autonomy was granted to the Canaries via a law passed in 1982. In 1983, the first autonomous elections were held. The Spanish Socialist Workers' Party (PSOE) won. In the 2007 elections, the PSOE gained a plurality of seats, but the nationalist Canarian Coalition and the conservative Partido Popular (PP) formed a ruling coalition government.\n\nDemographics \n\nThe Canary Islands have a population of 2,117,519 inhabitants (2011), making it the eighth most populous of Spain's autonomous communities, with a density of 282.6 inhabitants per square kilometre. The total area of the archipelago is 7493 km2.\n\nThe Canarian population includes long-tenured residents and new waves of mainland Spanish immigrants, as well as Portuguese, Italians, Flemings and Britons. Of the total Canarian population in 2009 (2,098,593) 1,799,373 were Spanish and 299,220 foreigners. Of these, the majority are Europeans (55%), including Germans (39,505), British (37,937) and Italians (24,177). There are also 86,287 inhabitants from the Americas, mainly Colombians (21,798), Venezuelans (11,958), Cubans (11,098) and Argentines (10,159). There are also 28,136 African residents, mostly Moroccans (16,240).\n\nPopulation of the individual islands \n\nThe population of the islands according to the 2010 data are:[http://www.ine.es/jaxi/tabla.do?path/t20/e260/a2010/l0/&file\nis01.px&typepcaxis&L\n0 Population referred to the January 1, 2010] \n* Tenerife – 906,854\n* Gran Canaria – 845,676\n* Lanzarote – 141,437 (including the population of La Graciosa)\n* Fuerteventura – 103,492\n* La Palma – 86,324\n* La Gomera – 22,776\n* El Hierro – 10,960\n\nReligion \n\nThe Roman Catholic branch of Christianity has been the majority religion in the archipelago for more than five centuries, ever since the Conquest of the Canary Islands. However, there are other religious communities.\n\nRoman Catholic Church \n\nThe overwhelming majority of native Canarians are Roman Catholic (85%)[http://www.lavanguardia.com/vangdata/20150402/54429637154/interactivo-creencias-y-practicas-religiosas-en-espana.html Interactivo: Creencias y prácticas religiosas en España] with various smaller foreign-born populations of other Christian beliefs such as Protestants from northern Europe.\n\nThe appearance of the Virgin of Candelaria (Patron of Canary Islands) was credited with moving the Canary Islands toward Christianity. Two Catholic saints were born in the Canary Islands: Peter of Saint Joseph de Betancur[http://www.es.catholic.net/op/articulos/35981/pedro-de-san-jos-betancurt-santo.html Pedro de San José Betancurt, Santo] and José de Anchieta.[http://es.catholic.net/op/articulos/35379/jos-de-anchieta-santo.html José de Anchieta, Santo] Both born on the island of Tenerife, they were respectively missionaries in Guatemala and Brazil.\n\nThe Canary Islands are divided into two Catholic dioceses, each governed by a bishop:\n* Diócesis Canariense: Includes the islands of the Eastern Province: Gran Canaria, Fuerteventura and Lanzarote. Its capital was San Marcial El Rubicón (1404) and Las Palmas de Gran Canaria (1483–present). There was a previous bishopric which was based in Telde, but it was later abolished.\n* Diócesis Nivariense: Includes the islands of the western province: Tenerife, La Palma, La Gomera and El Hierro. Its capital is San Cristóbal de La Laguna (1819–present).\n\nOther religions \n\nSeparate from the overwhelming Christian majority are a minority of Muslims.[http://www.laopinion.es/sociedad/2008/10/03/sociedad-canarios-profesa-religion-minoritaria/173826.html Un 5% de canarios profesa una religión minoritaria] Among the followers of Islam, the Islamic Federation of the Canary Islands exists to represent the Islamic community in the Canary Islands as well as to provide practical support to members of the Islamic community.[http://www.laopinion.es/tenerife/2015/04/16/musulmanes-isla-constituyen-primera-federacion/601084.html Los musulmanes de la Isla constituyen la primera Federación Islámica de Canarias]\n\nOther religious faiths represented include Jehovah Witnesses, The Church of Jesus Christ of Latter-day Saints as well as Hinduism. Minority religions are also present such as the Church of the Guanche People which is classified as a neo-pagan native religion. Also present are Buddhism, Judaism, Baha'i, Afro-American religion, and Chinese religions.\n\nStatistics \n\nThe distribution of beliefs in 2012 according to the CIS Barometer Autonomy was as follows:[http://www.cis.es/cis/export/sites/default/-Archivos/Marginales/2940_2959/2956/CANARIAS_5/e295650.html Barometro Autonómico del CIS Canarias (2012); preguntas 47 y 48]\n* Catholic 84.9%\n* Atheist/Agnostic/Unbeliever 12.3%\n* Other religions 1.7%\n\nPopulation genetics \n\nIslands \n\nEl Hierro \n\nEl Hierro, the westernmost island, covers , making it the smallest of the major islands, and the least populous with 10,753 inhabitants. The whole island was declared Reserve of the Biosphere in 2000. Its capital is Valverde. Also known as Ferro, it was once believed to be the westernmost land in the world.\n\nFuerteventura \n\nFuerteventura, with a surface of 1660 km2, is the second-most extensive island of the archipelago. It has been declared a Biosphere reserve by Unesco. It has a population of 100,929. Being also the most ancient of the islands, it is the one that is more eroded: its highest point is the Peak of the Bramble, at a height of 807 m. Its capital is Puerto del Rosario.\n\nGran Canaria \n\nGran Canaria has 845,676 inhabitants. The capital, Las Palmas de Gran Canaria (377,203 inhabitants), is the most populous city and shares the status of capital of the Canaries with Santa Cruz de Tenerife. Gran Canaria's surface area is 1560 km2. In center of the island lie the Roque Nublo 1813 m and Pico de las Nieves (\"Peak of Snow\") 1949 m. In the south of island are the Maspalomas Dunes (Gran Canaria), these are the biggest tourist attractions.\n\nLa Gomera \n\nLa Gomera has an area of  and is the second least populous island with 22,622 inhabitants. Geologically it is one of the oldest of the archipelago. The insular capital is San Sebastian de La Gomera. Garajonay's National Park is located on the island.\n\nLanzarote \n\nLanzarote is the easternmost island and one of the most ancient of the archipelago, and it has shown evidence of recent volcanic activity. It has a surface of , and a population of 139,506 inhabitants, including the adjacent islets of the Chinijo Archipelago. The capital is Arrecife, with 56,834 inhabitants.\n\nChinijo Archipelago \n\nThe Chinijo Archipelago includes the islands La Graciosa, Alegranza, Montaña Clara, Roque del Este and Roque del Oeste. It has a surface of , and a population of 658 inhabitants all of them on La Graciosa. With 29 km2, La Graciosa, is the smallest inhabited island of the Canaries, and the major island of the Chinijo Archipelago.\n\nLa Palma \n\nLa Palma, with 86,528 inhabitants covering an area of , is in its entirety a biosphere reserve. It shows no recent signs of volcanic activity, even though the volcano Teneguía entered into eruption last in 1971. In addition, it is the second-highest island of the Canaries, with the Roque de los Muchachos 2423 m as highest point. Santa Cruz de La Palma (known to those on the island as simply \"Santa Cruz\") is its capital.\n\nTenerife \n\nTenerife is, with its area of 2034 km2, the most extensive island of the Canary Islands. In addition, with 906,854 inhabitants it is the most populated island of the archipelago and Spain. Two of the islands' principal cities are located on it: The capital, Santa Cruz de Tenerife and San Cristóbal de La Laguna (a World Heritage Site). San Cristóbal de La Laguna, the second city of the island is home to the oldest university in the Canary Islands, the University of La Laguna. The Teide, with its 3718 m is the highest peak of Spain and also a World Heritage Site. Tenerife is the site of the worst air disaster in the history of aviation, in which 583 people were killed in the collision of two Boeing 747s on 27 March 1977.\n\nData \n\nEconomy \n\nThe economy is based primarily on tourism, which makes up 32% of the GDP. The Canaries receive about 12 million tourists per year. Construction makes up nearly 20% of the GDP and tropical agriculture, primarily bananas and tobacco, are grown for export to Europe and the Americas. Ecologists are concerned that the resources, especially in the more arid islands, are being overexploited but there are still many agricultural resources like tomatoes, potatoes, onions, cochineal, sugarcane, grapes, vines, dates, oranges, lemons, figs, wheat, barley, maize, apricots, peaches and almonds.\n\nThe economy is € 25 billion (2001 GDP figures). The islands experienced continuous growth during a 20-year period, up until 2001, at a rate of approximately 5% annually. This growth was fueled mainly by huge amounts of Foreign Direct Investment, mostly to develop tourism real estate (hotels and apartments), and European Funds (near €11 billion euro in the period from 2000 to 2007), since the Canary Islands are labelled Region Objective 1 (eligible for euro structural funds). Additionally, the EU allows the Canary Islands Government to offer special tax concessions for investors who incorporate under the Zona Especial Canaria (ZEC) regime and create more than five jobs.\n\nSpain gave permission in August 2014 for Repsol and its partners to explore oil and gas prospects off the Canary Islands, involving an investment of €7.5 billion over four years, to commence at the end of 2016. Repsol at the time said the area could ultimately produce 100,000 barrels of oil a day, which would meet 10 percent of Spain's energy needs. However, the analysis of samples obtained did not show the necessary volume nor quality to consider future extraction, and the project was scrapped.\n\nThe Canary Islands have great natural attractions, climate and beaches make the islands a major tourist destination, being visited each year by about 12 million people (11,986,059 in 2007, noting 29% of Britons, 22% of Spanish, not residents of the Canaries, and 21% of Germans). Among the islands, Tenerife has the largest number of tourists received annually, followed by Gran Canaria and Lanzarote. The archipelago's principal tourist attraction is the Teide National Park (in Tenerife) where the highest mountain in Spain and third largest volcano in the world (Mount Teide), receives over 2.8 million visitors annually.\n\nThe combination of high mountains, proximity to Europe, and clean air has made the Roque de los Muchachos peak (on La Palma island) a leading location for telescopes like the Grantecan.\n\nThe islands are outside the European Union customs territory and VAT area, though politically within the EU and Schengen Area. Instead of VAT there is a local Sales Tax (IGIC) which has a general rate of 7%, an increased tax rate of 13.5%, a reduced tax rate of 3% and a zero tax rate for certain basic need products and services. Consequently, some products are subject to import tax and VAT if being exported from the islands into mainland Spain or the rest of the EU.\n\nCanarian time is Western European Time (WET) (or GMT; in summer one hour ahead of GMT). So Canarian time is one hour behind that of mainland Spain and the same as that of the UK, Ireland and Portugal all year round.\n\nTourism statistics \n\nNumber of tourists who visited the Canary Islands in 2016, per destination island (in thousands):[https://es.statista.com/estadisticas/526731/numero-de-turistas-que-visitaron-canarias-por-isla-de-destino/ Número de turistas que visitaron Canarias en 2016, por isla de destino (en miles)]\n\n* Tenerife - 4,885.9\n* Gran Canaria - 3,654.8\n* Lanzarote - 2,328.7 (extremely popular with Irish holiday makers all year round)\n* Fuerteventura - 1,914.1\n* La Palma - 221.5\n* La Gomera and El Hierro - 109.3\n\nTransport \n\nThe Canary Islands have eight airports altogether, two of the main ports of Spain, and an extensive network of autopistas (highways) and other roads. For a road map see multimap.\n\nThere are large ferry boats that link islands as well as fast ferries linking most of the islands. Both types can transport large numbers of passengers and cargo (including vehicles). Fast ferries are made of aluminium and powered by modern and efficient diesel engines, while conventional ferries have a steel hull and are powered by heavy oil. Fast ferries travel relatively quickly (in excess of 30 knots) and are a faster method of transportation than the conventional ferry (some 20 knots). A typical ferry ride between La Palma and Tenerife may take up to eight hours or more while a fast ferry takes about 2 and a half hours and between Tenerife and Gran Canaria can be about one hour.\n\nThe largest airport is the Gran Canaria Airport. Tenerife has two airports, Tenerife North Airport and Tenerife South Airport.[http://www2.gobiernodecanarias.org/istac/estadisticas/php/saltarA.php?mid=/istac/estadisticas/sector_servicios/transporte_comunicaciones/aereo/pas_tot.html Airport traffic]  The island of Tenerife gathers the highest passenger movement of all the Canary Islands through its two airports.[http://estadisticas.aena.es/csee/ccurl/52/737/Estadisticas_Acumulado%20DEF_2012.pdf AENA statistics for 2012] The two main islands (Tenerife and Gran Canaria) receive the greatest number of passengers.[http://www2.gobiernodecanarias.org/istac/estadisticas/sector_servicios/turismo/turistas/5_4_2_2_1.html Passengers in airports]  Tenerife 6,204,499 passengers and Gran Canaria 5,011,176 passengers.[https://web.archive.org/web/20030122081718/http://www.gobiernodecanarias.org/istac/estadisticas/sector_servicios/turismo/turistas/5_4_2_2_1.html Entrada en los aeropuertos canarios según islas]\n\nThe port of Las Palmas is first in freight traffic in the islands,[http://www2.gobiernodecanarias.org/istac/estadisticas/php/saltarA.php?mid/istac/estadisticas/sector_servicios/area_11_frame.html Freight traffic]  while the port of Santa Cruz de Tenerife is the first fishing port with approximately 7,500 tons of fish caught, according to the Spanish government publication Statistical Yearbook of State Ports. Similarly, it is the second port in Spain as regards ship traffic, only surpassed by the Port of Algeciras Bay. The port's facilities include a border inspection post (BIP) approved by the European Union, which is responsible for inspecting all types of imports from third countries or exports to countries outside the European Economic Area. The port of Los Cristianos (Tenerife) has the greatest number of passengers recorded in the Canary Islands, followed by the port of Santa Cruz de Tenerife. The Port of Las Palmas is the third port in the islands in passengers and first in number of vehicles transported.\n\nThe SS America was beached at the Canary islands, in the nineties. However, the ocean liner fell apart after some years and parts of the ship washed away.\n\nRail transport \n\nThe Tenerife Tram opened in 2007 and the only one in the Canary Islands, travelling between the cities of Santa Cruz de Tenerife and San Cristóbal de La Laguna. It is currently planned to have three lines in the Canary Islands (two in Tenerife and one in Gran Canaria). The planned Gran Canaria tram route will be from Las Palmas de Gran Canaria to Maspalomas (south).\n\nAirports \n\n* Tenerife South Airport – Tenerife\n* Tenerife North Airport – Tenerife\n* Lanzarote Airport – Lanzarote\n* Fuerteventura Airport – Fuerteventura\n* Gran Canaria Airport – Gran Canaria\n* La Palma Airport – La Palma\n* La Gomera Airport – La Gomera\n* El Hierro Airport – El Hierro[http://www2.gobiernodecanarias.org/istac/estadisticas/php/saltarA.php?mid=/istac/estadisticas/sector_servicios/transporte_comunicaciones/aereo/pas_tot.html Airports by passenger traffic, 2010, July] \n\nPorts \n\n \n* Port of Puerto del Rosario – Fuerteventura\n* Port of Arrecife – Lanzarote\n* Port of Playa Blanca—Lanzarote\n* Port of Santa Cruz de La Palma – La Palma\n* Port of San Sebastián de La Gomera – La Gomera\n* Port of La Estaca – El Hierro\n* Port of Las Palmas – Gran Canaria\n* Port of Agaete – Gran Canaria\n* Port of Los Cristianos – Tenerife\n* Port of Santa Cruz de Tenerife – Tenerife\n* Port of Garachico – Tenerife\n* Port of Granadilla – Tenerife\n\nWildlife \n\nPrehistoric fauna \n\nBefore the arrival of the Aborigines, the Canary Islands was inhabited by endemic animals, such as some extinct; giant lizards (Gallotia goliath), giant rats (Canariomys bravoi and Canariomys tamarani)[http://www.gobiernodecanarias.org/cmayot/medioambiente/lagartodelagomera/gatos.html Algunas extinciones en Canarias]  Consejería de Medio Ambiente y Ordenación Territorial del Gobierno de Canarias and giant tortoises (Geochelone burchardi and Geochelone vulcanica),[http://www.sepaleontologia.es/revista/anteriores/REP%20Extra%201996/21Castillo.pdf «La Paleontología de vertebrados en Canarias.»] Spanish Journal of Palaeontology (antes Revista Española de Paleontología). Consultado el 17 de junio de 2016. among others.\n\nTerrestrial wildlife \n\nWith a range of habitats, the Canary Islands exhibit diverse plant species. The bird life includes European and African species, such as the black-bellied sandgrouse; and a rich variety of endemic (local) taxa including the:\n* Canary\n* Graja, a subspecies of red-billed chough endemic to La Palma\n* Blue chaffinch (endemic to Tenerife and Gran Canaria)\n* Canary Islands chiffchaff\n* Fuerteventura chat\n* Tenerife goldcrest\n* La Palma chaffinch\n* Canarian Egyptian vulture\n* Bolle's pigeon\n* Laurel pigeon\n* Plain swift\n* Houbara bustard\n* Spiders\n* Snakes\n* Scorpions\n* Giant wasps\n* †Canary Islands oystercatcher (extinct)\n\nTerrestrial fauna includes geckos, wall lizards, and three endemic species of recently rediscovered and critically endangered giant lizard: the El Hierro giant lizard (or Roque Chico de Salmor giant lizard), La Gomera giant lizard, and La Palma giant lizard. Mammals include the Canarian shrew, Canary big-eared bat, the Algerian hedgehog (which may have been introduced) and the more recently introduced mouflon. Some endemic mammals, the lava mouse, Tenerife giant rat and Gran Canaria giant rat, are extinct, as are the Canary Islands quail, long-legged bunting, the eastern Canary Islands chiffchaff and the giant prehistoric tortoises; Geochelone burchardi and Geochelone vulcanica.\n\nMarine life \n\nThe marine life found in the Canary Islands is also varied, being a combination of North Atlantic, Mediterranean and endemic species. In recent years, the increasing popularity of both scuba diving and underwater photography have provided biologists with much new information on the marine life of the islands.\n\nFish species found in the islands include many species of shark, ray, moray eel, bream, jack, grunt, scorpionfish, triggerfish, grouper, goby, and blenny. In addition, there are many invertebrate species, including sponge, jellyfish, anemone, crab, mollusc, sea urchin, starfish, sea cucumber and coral.\n\nThere are a total of five different species of marine turtle that are sighted periodically in the islands, the most common of these being the endangered loggerhead sea turtle. The other four are the green sea turtle, hawksbill sea turtle, leatherback sea turtle and Kemp's ridley sea turtle. Currently, there are no signs that any of these species breed in the islands, and so those seen in the water are usually migrating. However, it is believed that some of these species may have bred in the islands in the past, and there are records of several sightings of leatherback sea turtle on beaches in Fuerteventura, adding credibility to the theory.\n\nMarine mammals include the large varieties of cetaceans including rare and not well-known species (see more details in the Marine life of the Canary Islands). Hooded sealshttp://www.iucnredlist.org/details/6204/0 have also been known to be vagrant in the Canary Islands every now and then. The Canary Islands were also formerly home to a population of the rarest pinniped in the world, the Mediterranean monk seal.\n\nNative flora gallery \n\nTajinaste rojo.jpg \nArbutus canariensis2.jpg\nDigitalis (Isoplexis) canariensis by Scott zona - 004.jpg\nSonchus palmensis (Barlovento) 04.jpg\nLotus berthelotii1.jpg \nPersea indica.jpg\nCanarina canariensis Tenerife (02).jpg\nPhoenix canariensis (Puntallana) 01.jpg\nEuphorbia canariensis2.jpg\nBosea yervamora berries.JPG\nGonospermum elegans.jpg\nPericallis webbii.jpg\nArgyranthemum frutescens cv Vera 2.jpg\nLavatera acerifolia var. acerifolia (Jardín Botánico Canario Viera y Clavijo).jpg\nLavatera phoenicea1.jpg\nSpartocytisus supranubius.jpg\n\nSports \n\nA unique form of wrestling known as Canarian wrestling (lucha canaria) has opponents stand in a special area called a \"terrero\" and try to throw each other to the ground using strength and quick movements.\n\nAnother sport is the \"game of the sticks\" where opponents fence with long sticks. This may have come about from the shepherds of the islands who would challenge each other using their long walking sticks.\n\nFurthermore, there is the shepherd's jump (salto del pastor). This involves using a long stick to vault over an open area. This sport possibly evolved from the shepherd's need to occasionally get over an open area in the hills as they were tending their sheep.\n\nThe two main football teams in the archipelago are: the CD Tenerife (founded in 1912) and UD Las Palmas (founded in 1949). Now Tenerife play in Liga Adelante and Las Palmas in La Liga.\n\nThe mountainous terrain of the Canary Islands also caters to the growing popularity of ultra running and ultramarathons as host of annual competitive long-distance events including Transvulcania on La Palma, Transgrancanaria on Gran Canaria and the Half Marathon des Sables on Fuerteventura.\n\nNotable athletes \n\n* Javier Dorado, born in 2000, from the Islands of Lanzarote, Division 1 basketball player in the US\n* Nicolás García Hemme, born 20 June 1988 in Las Palmas de Gran Canaria, Canary Islands, 2012 London Olympics, Taekwondo Silver Medalist in Men's Welterweight category (−80 kg).\n* Alfredo Cabrera, (1881–1964); shortstop for the St. Louis Cardinals in 1913\n* Sergio Rodríguez, born in San Cristóbal de La Laguna in 1986, played point guard for the Portland Trail Blazers, Sacramento Kings, and New York Knicks\n* David Silva, born in Arguineguín in 1986, plays association football for Manchester City, member of the 2010 FIFA World Cup champion Spain national football team\n* Juan Carlos Valerón, born in Arguineguín in 1975, plays association football for Las Palmas\n* Pedro, born in Santa Cruz de Tenerife in 1987, plays association football for Chelsea, member of the 2010 FIFA World Cup champion Spain national football team\n* Carla Suárez Navarro, born in Las Palmas de Gran Canaria in 1988, professional tennis player\n* Paola Tirados, born in Las Palmas de Gran Canaria in 1980, synchronized swimmer, who participated in the Olympic Games of 2000, 2004 and 2008. She won the silver medal in Beijing in 2008 in the team competition category.\n* Jesé, born in Las Palmas de Gran Canaria in 1993, plays association football for Stoke City F.C., on loan from Paris Saint-Germain\n* Christo Bezuidenhout, born in Tenerife in 1970, played rugby union for Gloucester and South Africa.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Canary Islands" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5717" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Canary Islands (; ,) also known as the Canaries (), are an archipelago and autonomous community of Spain located on the Atlantic Ocean, 100 km west of Morocco at the closest. The Canaries are among the outermost regions (OMR) of the European Union proper. It is also one of the eight regions with special consideration of historical nationality recognized as such by the Spanish Government.[https://web.archive.org/web/20060515081511/http://www.gobcan.es/reformaestatuto/index.aspx Reforma de Estatuto de las Islas Canarias][http://coloquioscanariasamerica.casadecolon.com/index.php/CHCA/article/viewFile/7612/6583 Canarias en la España contemporánea: La formación de una nacionalidad histórica] \n\nThe seven main islands are (from largest to smallest in area) Tenerife, Fuerteventura, Gran Canaria, Lanzarote, La Palma, La Gomera and El Hierro. The archipelago includes much smaller islands and islets: La Graciosa, Alegranza, Isla de Lobos, Montaña Clara, Roque del Oeste and Roque del Este. In ancient times, the island chain was often referred to as \"the Fortunate Isles\". The Canary Islands are the most southerly region of Spain and the largest and most populated archipelago of the Macaronesia region.[http://catalogo.museosdetenerife.org/cdm/singleitem/collection/MACAMONO/id/16/rec/1 La Macaronesia. Consideraciones geológicas, biogeográficas y paleoecológicas] Historically, the Canary Islands has been considered a bridge between three continents; Africa, America and Europe.[http://www.lanacion.com.ar/451062-canarias-un-puente-entre-continentes Canarias, un puente entre continentes]\n\nThe archipelago's beaches, climate and important natural attractions, especially Maspalomas in Gran Canaria and Teide National Park and Mount Teide (a World Heritage Site) in Tenerife (the third tallest volcano in the world measured from its base on the ocean floor), make it a major tourist destination with over 12 million visitors per year, especially Gran Canaria, Tenerife, Fuerteventura and Lanzarote.[http://www.gobiernodecanarias.org/istac/estadisticas/turismo/area_11a_frame.html Página web]  del ISTAC sobre entrada de turistas en Canarias.[none#'Menú Principal'!A1 Estadísticas de Turismo de Tenerife]  The islands have a subtropical climate, with long hot summers and moderately warm winters. The precipitation levels and the level of maritime moderation vary depending on location and elevation. Green areas as well as desert exist on the archipelago. Due to their location above the temperature inversion layer, the high mountains of these islands are ideal for astronomical observation. For this reason, two professional observatories, Teide Observatory on the island of Tenerife and Roque de los Muchachos Observatory on the island of La Palma, have been built on the islands.\n\nThe capital of the Autonomous Community is shared by the cities of Santa Cruz de Tenerife and Las Palmas de Gran Canaria,[http://es.wikisource.org/wiki/Real_Decreto_de_30_de_noviembre_de_1833 Real Decreto de 30 de noviembre de 1833] en wikisource[http://www.gobiernodecanarias.org/tuestatuto/docs/1833-12-03%20Decreto%20de%20division%20provincial.pdf Real Decreto de 30 de noviembre de 1833]  en el sitio web oficial del Gobierno de Canarias which in turn are the capitals of the provinces of Santa Cruz de Tenerife and Province of Las Palmas. Las Palmas de Gran Canaria has been the largest city in the Canaries since 1768, except for a brief period in the 1910s.[http://www.canarias7.es/articulo.cfm?Id40362 Canarias7. Economía. La población de Canarias se ha multiplicado por trece en los últimos 250 años] Between the 1833 territorial division of Spain and 1927 Santa Cruz de Tenerife was the sole capital of the Canary Islands. In 1927 a decree ordered that the capital of the Canary Islands be shared, as it remains at present.[http://es.wikisource.org/wiki/Real_Decreto_de_30_de_noviembre_de_1833 Real Decreto de 30 de noviembre de 1833] on wikisource[http://www.gobiernodecanarias.org/tuestatuto/docs/1833-12-03%20Decreto%20de%20division%20provincial.pdf Real Decreto de 30 de noviembre de 1833]  at the official website of the Canary Islands Government The third largest city of the Canary Islands is San Cristóbal de La Laguna (a World Heritage Site) on Tenerife. This city is also home to the Consejo Consultivo de Canarias, which is the supreme consultative body of the Canary Islands.[http://www.consultivodecanarias.org/casa/ Sede del Consejo Consultivo de Canarias]\n\nDuring the time of the Spanish Empire, the Canaries were the main stopover for Spanish galleons on their way to the Americas, which came south to catch the prevailing northeasterly trade winds.\n\nEtymology \n\nThe name Islas Canarias is likely derived from the Latin name Canariae Insulae, meaning \"Islands of the Dogs\", a name that was applied only to Gran Canaria. According to the historian Pliny the Elder, the Mauretanian king Juba II named the island Canaria because it contained \"vast multitudes of dogs of very large size\".Pliny the Elder, The Natural History, Chap. 37. (32.)—The Fortunate Islands\n\nAnother speculation is that the so-called dogs were actually a species of monk seal (canis marinus or \"sea dog\" was a Latin term for \"seal\"Lewis and Short, A Latin Dictionary, canis, sense II. B), critically endangered and no longer present in the Canary Islands. The dense population of seals may have been the characteristic that most struck the few ancient Romans who established contact with these islands by sea.\n\nAlternatively, it is said that the original inhabitants of the island, Guanches, used to worship dogs, mummified them and treated dogs generally as holy animals.[http://www.touropia.com/facts-about-the-canary-islands/ 10 Facts about the Canary Islands] – Touropia.com – Retrieved 22 August 2011. The ancient Greeks also knew about a people, living far to the west, who are the \"dog-headed ones\", who worshipped dogs on an island. Some hypothesize that the Canary Islands dog-worship and the ancient Egyptian cult of the dog-headed god, Anubis are closely connected but there is no explanation given as to which one was first.\n\nOther theories speculate that the name comes from the Nukkari Berber tribe living in the Moroccan Atlas, named in Roman sources as Canarii, though Pliny again mentions the relation of this term with dogs.\n\nThe connection to dogs is retained in their depiction on the islands' coat-of-arms (shown above).\n\nIt is considered that the aborigines of Gran Canaria called themselves \"Canarii\". It is possible that after being conquered, this name was used in plural in Spanish, i.e., as to refer to all of the islands as the Canarii-as.\n\nWhat is certain is that the name of the islands does not derive from the canary bird; rather, the birds are named after the islands.\n\nPhysical geography \n\nTenerife is the largest and most populous island of the archipelago. Gran Canaria, with 865,070 inhabitants, is both the Canary Islands' second most populous island, and the third most populous one in Spain after Majorca. The island of Fuerteventura is the second largest in the archipelago and located 100 km from the African coast.\n\nThe islands form the Macaronesia ecoregion with the Azores, Cape Verde, Madeira, and the Savage Isles. The Canary Islands is the largest and most populated archipelago of the Macaronesia region. The archipelago consists of seven large and several smaller islands, all of which are volcanic in origin.[http://www.mantleplumes.org/Canary.html (Universidad de Las Palmas,) José Mangas Viñuela, \"The Canary Islands Hot Spot\"] This is the source for the geological history that follows. \n\nAccording to the position of the islands with respect to the north-east trade winds, the climate can be mild and wet or very dry. Several native species form laurisilva forests.\n\nAs a consequence, the individual islands in the Canary archipelago tend to have distinct microclimates. Those islands such as El Hierro, La Palma and La Gomera lying to the west of the archipelago have a climate which is influenced by the moist Gulf Stream. They are well vegetated even at low levels and have extensive tracts of sub-tropical laurisilva forest. As one travels east toward the African coast, the influence of the gulf stream diminishes, and the islands become increasingly arid. Fuerteventura and Lanzarote the islands which are closest to the African mainland are effectively desert or semi desert. Gran Canaria is known as a \"continent in miniature\" for its diverse landscapes like Maspalomas and Roque Nublo. In terms of its climate Tenerife is particularly interesting. The north of the island lies under the influence of the moist Atlantic winds and is well vegetated, while the south of the island around the tourist resorts of Playa de las Americas and Los Cristianos is arid. The island rises to almost 4000 m above sea level, and at altitude, in the cool relatively wet climate, forests of the endemic pine Pinus canariensis thrive. Many of the plant species in the Canary Islands, like the Canary Island pine and the dragon tree, Dracaena draco are endemic, as noted by Sabin Berthelot and Philip Barker Webb in their epic work, L'Histoire Naturelle des Îles Canaries (1835–50).\n\nClimate \n\nThe climate is tropical and desertic, moderated by the sea and in summer by the trade winds. There are a number of microclimates and the classifications range mainly from semi-arid to desert. According to the Köppen climate classification,https://upload.wikimedia.org/wikipedia/commons/3/32/World_Koppen_Map.png the majority of the Canary Islands have a hot desert climate represented as BWh. There also exists a subtropical humid climate which is very influenced by the ocean in the middle of the islands of La Gomera, Tenerife and La Palma; where the laurisilva forests grow.\n\nGeology \n\nThe seven major islands, one minor island, and several small islets were originally volcanic islands, formed by the Canary hotspot. The Canary Islands is the only place in Spain where volcanic eruptions have been recorded during the Modern Era, with some volcanoes still active (El Hierro, 2011).\nVolcanic islands such as those in the Canary chain often have steep ocean cliffs caused by catastrophic debris avalanches and landslides.Pararas-Carayannis, G. (2002). \"Evaluation of the Threat of Mega Tsunami Generation from Postulated Massive Slope Failure of Island Stratovolcanoes on La Palma, Canary Islands, and on The Island of Hawaii, George\". Science of Tsunami Hazards 20 (5): 251–277.\n\nThe Teide volcano on Tenerife is the highest mountain in Spain, and the third tallest volcano on Earth on a volcanic ocean island. All the islands except La Gomera have been active in the last million years; four of them (Lanzarote, Tenerife, La Palma and El Hierro) have historical records of eruptions since European discovery. The islands rise from Jurassic oceanic crust associated with the opening of the Atlantic. Underwater magmatism commenced during the Cretaceous, and reached the ocean's surface during the Miocene. The islands are considered as a distinct physiographic section of the Atlas Mountains province, which in turn is part of the larger African Alpine System division.\n\nIn the summer of 2011 a series of low-magnitude earthquakes occurred beneath El Hierro. These had a linear trend of northeast-southwest. In October a submarine eruption occurred about 2 km south of Restinga. This eruption produced gases and pumice, but no explosive activity was reported.\n\nThe following table shows the highest mountains in each of the islands:\n\nNatural symbols \n\nThe official natural symbols associated with Canary Islands are the bird Serinus canaria (canary) and the Phoenix canariensis palm.\n\nFile:Serinus canaria LC0210.jpg|Serinus canaria\nFile:Phoenix canariensis ag.JPG|Phoenix canariensis\n\nNational parks \n\nFour of Spain's thirteen national parks are located in the Canary Islands, more than any other autonomous community. Teide National Park is the most visited in Spain, and the oldest and largest within the Canary Islands. The parks are:\n\nThe Canary Islands have four national parks, of which two have been declared World Heritage Site by UNESCO, and the other two declared a World Biosphere Reserve, these national parks are:\n* Caldera de Taburiente National Park (La Palma): Created in 1954, it was declared a World Biosphere Reserve in 2002. It covers an area of .\n* Garajonay National Park (La Gomera): Created in 1981, it was declared in 1986 a World Heritage Site. Its area is 3986 hectares at the core and some areas north of the island.\n* Timanfaya National Park (Lanzarote): Created in 1974, it was declared a Biosphere Reserve in 1993, together with the whole island. Occupies an area of , is located in the southwest of the island.\n* Teide National Park (Tenerife): Created in 1954, it was declared a World Heritage Site in 2007. It covers an area of 18,990 hectares, is the oldest and largest national park in the Canary Islands and one of the oldest in Spain. The Teide in 2010 became the most visited national park in Europe and second worldwide. Located in the geographic center of the island is the most visited National Park in Spain. The highlight is the Teide at 3,718 meters altitude, is the highest elevation of the country and the third largest volcano on Earth from its base. Teide National Park was declared in 2007 as one of the 12 Treasures of Spain.\n\nPolitics\n\nGovernance\n\nThe islands have 13 seats in the Spanish Senate. Of these, 11 seats are directly elected, 3 for Gran Canaria, 3 for Tenerife, 1 for each other island; 2 seats are indirectly elected by the regional Autonomous Government. The local government is presided over by Fernando Clavijo, the current President of the Canary Islands.\n\nCanarian nationalism\n\nThere are some pro-independence political parties, like the National Congress of the Canaries (CNC) and the Popular Front of the Canary Islands, but these parties are non-violent, and their popular support is almost insignificant, with no presence in either the autonomous parliament or the cabildos insulares.\n\nAccording to \"Centro de Investigaciones Sociológicas\" (Sociological Research Center) in 2010, 43.5% of the population of the Canary Islands feels more Canarian than Spanish (37.6%), of which 7.6% only Canarian, compared to 5.4% that feels more Spanish than Canarian (2.4%) or only Spanish (3%). The most popular choice was of those who feel equally Spanish and Canarian, with 49.9%. With these data, one of the Canary recorded levels of identification with higher autonomy from Spain.\n\nPolitical geography \n\nThe Autonomous Community of the Canary Islands consists of two provinces, Las Palmas and Santa Cruz de Tenerife, whose capitals (Las Palmas de Gran Canaria and Santa Cruz de Tenerife) are capitals of the autonomous community. Each of the seven major islands is ruled by an island council named Cabildo Insular.\n\nThe international boundary of the Canaries is the subject of dispute between Spain and Morocco. Morocco's official position is that international laws regarding territorial limits do not authorise Spain to claim seabed boundaries based on the territory of the Canaries, since the Canary Islands enjoy a large degree of autonomy. \n\nThe boundary determines the ownership of seabed oil deposits and other ocean resources. Morocco and Spain have been unable to agree on a compromise regarding the territorial boundary, since neither nation wants to cede its claimed right to the vast resources whose ownership depends upon the boundary. In 2002, for example, Morocco rejected a unilateral Spanish proposal.\n\nHistory \n\nAncient and pre-colonial times \n\nBefore the arrival of humans, the Canaries were inhabited by prehistoric animals; for example, the giant lizard (Gallotia goliath) and the Tenerife and Gran Canaria giant rats.[http://www.gobiernodecanarias.org/cmayot/medioambiente/lagartodelagomera/gatos.html Según la Página Web del Gobierno de Canarias]  Also the giant prehistoric tortoises; Geochelone burchardi and Geochelone vulcanica.\n\nThe islands may have been visited by the Phoenicians, the Greeks, and the Carthaginians. King Juba II, Caesar Augustus's Numidian protégé, is credited with discovering the islands for the Western world. According to Pliny the Elder, Juba found the islands uninhabited, but found \"a small temple of stone\" and \"some traces of buildings\". Juba dispatched a naval contingent to re-open the dye production facility at Mogador in what is now western Morocco in the early first century AD. That same naval force was subsequently sent on an exploration of the Canary Islands, using Mogador as their mission base.\n\nThe Romans named the individual islands Ninguaria or Nivaria (Tenerife), Canaria (Gran Canaria), Pluvialia or Invale (Lanzarote), Ombrion (La Palma), Planasia (Fuerteventura), Iunonia or Junonia (El Hierro) and Capraria (La Gomera).\n\nWhen the Europeans began to explore the islands in the late Middle Ages, they encountered several indigenous peoples living at a Neolithic level of technology. Although the prehistory of the settlement of the Canary Islands is still unclear, linguistic and genetic analyses seem to indicate that at least some of these inhabitants shared a common origin with the Berbers of Tamazgha. The pre-colonial inhabitants came to be known collectively as the Guanches, although Guanches had been the name for only the indigenous inhabitants of Tenerife. From the 14th century onward, numerous visits were made by sailors from Majorca, Portugal and Genoa. Lancelotto Malocello settled on Lanzarote in 1312. The Majorcans established a mission with a bishop in the islands that lasted from 1350 to 1400.\n\nCastilian conquest \n\nIn 1402, the Castilian conquest of the islands began, with the expedition of French explorers Jean de Béthencourt and Gadifer de la Salle, nobles and vassals of Henry III of Castile, to Lanzarote. From there, they conquered Fuerteventura (1405) and El Hierro. Béthencourt received the title King of the Canary Islands, but still recognised King Henry III as his overlord.\n\nBéthencourt also established a base on the island of La Gomera, but it would be many years before the island was truly conquered. The natives of La Gomera, and of Gran Canaria, Tenerife, and La Palma, resisted the Castilian invaders for almost a century. In 1448 Maciot de Béthencourt sold the lordship of Lanzarote to Portugal's Prince Henry the Navigator, an action that was not accepted by the natives nor by the Castilians. Despite Pope Nicholas V ruling that the Canary Islands were under Portuguese control, a crisis swelled to a revolt which lasted until 1459 with the final expulsion of the Portuguese. In 1479, Portugal and Castile signed the Treaty of Alcáçovas. The treaty settled disputes between Castile and Portugal over the control of the Atlantic, in which Castilian control of the Canary Islands was recognised but which also confirmed Portuguese possession of the Azores, Madeira, and the Cape Verde islands, and gave them rights to lands discovered and to be discovered, and any other island which might be found and conquered from the Canary Islands beyond toward Guinea.\n\nThe Castilians continued to dominate the islands, but due to the topography and the resistance of the native Guanches, they did not achieve complete control until 1495, when Tenerife and La Palma were finally subdued by Alonso Fernández de Lugo. After that, the Canaries were incorporated into the Kingdom of Castile.\n\nAfter the conquest \n\nAfter the conquest, the Castilians imposed a new economic model, based on single-crop cultivation: first sugarcane; then wine, an important item of trade with England. In this era, the first institutions of colonial government were founded. Gran Canaria, a colony of the Crown of Castile since 6 March 1480 (from 1556, of Spain), and Tenerife, a Spanish colony since 1495, each had its own governor.\n\nThe cities of Santa Cruz de Tenerife and Las Palmas de Gran Canaria became a stopping point for the Spanish conquerors, traders, and missionaries on their way to the New World. This trade route brought great prosperity to some of the social sectors of the islands. The islands became quite wealthy and soon were attracting merchants and adventurers from all over Europe. Magnificent palaces and churches were built on La Palma during this busy, prosperous period. The Church of El Salvador survives as one of the island's finest examples of the architecture of the 16th century.\n\nThe Canaries' wealth invited attacks by pirates and privateers. Ottoman Turkish admiral and privateer Kemal Reis ventured into the Canaries in 1501, while Murat Reis the Elder captured Lanzarote in 1585.\n\nThe most severe attack took place in 1599, during the Dutch Revolt. A Dutch fleet of 74 ships and 12,000 men, commanded by Pieter van der Does, attacked the capital Las Palmas de Gran Canaria (the city had 3,500 of Gran Canaria's 8,545 inhabitants). The Dutch attacked the Castillo de la Luz, which guarded the harbor. The Canarians evacuated civilians from the city, and the Castillo surrendered (but not the city). The Dutch moved inland, but Canarian cavalry drove them back to Tamaraceite, near the city.\n\nThe Dutch then laid siege to the city, demanding the surrender of all its wealth. They received 12 sheep and 3 calves. Furious, the Dutch sent 4,000 soldiers to attack the Council of the Canaries, who were sheltering in the village of Santa Brígida. 300 Canarian soldiers ambushed the Dutch in the village of Monte Lentiscal, killing 150 and forcing the rest to retreat. The Dutch concentrated on Las Palmas de Gran Canaria, attempting to burn it down. The Dutch pillaged Maspalomas, on the southern coast of Gran Canaria, San Sebastián on La Gomera, and Santa Cruz on La Palma, but eventually gave up the siege of Las Palmas and withdrew.\n\nIn 1618 the Barbary pirates attacked Lanzarote and La Gomera taking 1000 captives to be sold as slaves.John Mercer (1980), The Canary Islanders : their prehistory, conquest, and survival, p. 236, Collings. Another noteworthy attack occurred in 1797, when Santa Cruz de Tenerife was attacked by a British fleet under Horatio Nelson on 25 July. The British were repulsed, losing almost 400 men. It was during this battle that Nelson lost his right arm.\n\n18th to 19th century \n\nThe sugar-based economy of the islands faced stiff competition from Spain's American colonies. Low prices in the sugar market in the 19th century caused severe recessions on the islands. A new cash crop, cochineal (cochinilla), came into cultivation during this time, saving the islands' economy. During this time the Canarian-American trade was developed, in which Canarian products such as cochineal, sugarcane and rum are sold in American ports, such as Veracruz, Campeche, La Guaira and Havana among others.[http://www.canariascnnews.com/index.php/mirador/canarias/item/1721-el-comercio-canario-americano-en-el-siglo-xviii-i-parte El comercio canario-americano en el siglo XVIII]\n\nBy the end of the 18th century, Canary Islanders had already emigrated to Spanish American territories, such as Havana, Veracruz, Santo Domingo, San Antonio, Texas and St. Bernard Parish, Louisiana. These economic difficulties spurred mass emigration, primarily to the Americas, during the 19th and first half of the 20th century. Between 1840 and 1890 as many as 40,000 Canary Islanders emigrated to Venezuela. Also, thousands of Canarians moved to Puerto Rico where the Spanish monarchy felt that Canarians would adapt to island life better than other immigrants from the mainland of Spain. Deeply entrenched traditions, such as the Mascaras Festival in the town of Hatillo, Puerto Rico, are an example of Canarian culture still preserved in Puerto Rico. Similarly, many thousands of Canarians emigrated to the shores of Cuba. During the Spanish–American War of 1898, the Spanish fortified the islands against a possible American attack, but no such event took place.\n\nRomantic period and scientific expeditions \n\nSirera and Renn (2004) distinguish two different types of expeditions, or voyages, during the period 1770–1830, which they term \"the Romantic period\":\n\nFirst are \"expeditions financed by the States, closely related with the official scientific Institutions. characterised by having strict scientific objectives (and inspired by) the spirit of Illustration and progress\". In this type of expedition, Sirera and Renn include the following travellers:\n* J. Edens, whose 1715 ascent and observations of Mt. Teide influenced many subsequent expeditions.\n* Louis Feuillée (1724), who was sent to measure the meridian of El Hierro and to map the islands.\n* Jean-Charles de Borda (1771, 1776) who more accurately measured the longitudes of the islands and the height of Mount Teide\n* the Baudin-Ledru expedition (1796) which aimed to recover a valuable collection of natural history objects.\n\nThe second type of expedition identified by Sirera and Renn is one that took place starting from more or less private initiatives. Among these, the key exponents were the following:\n* Alexander von Humboldt (1799)\n* Buch and Smith (1815)\n* Broussonet\n* Webb\n* Sabin Berthelot.\n\nSirera and Renn identify the period 1770–1830 as one in which \"In a panorama dominated until that moment by France and England enters with strength and brio Germany of the Romantic period whose presence in the islands will increase\".\n\nEarly 20th century \n\nAt the beginning of the 20th century, the British introduced a new cash-crop, the banana, the export of which was controlled by companies such as Fyffes.\n\nThe rivalry between the elites of the cities of Las Palmas de Gran Canaria and Santa Cruz de Tenerife for the capital of the islands led to the division of the archipelago into two provinces in 1927. This has not laid to rest the rivalry between the two cities, which continues to this day.\n\nDuring the time of the Second Spanish Republic, Marxist and anarchist workers' movements began to develop, led by figures such as Jose Miguel Perez and Guillermo Ascanio. However, outside of a few municipalities, these organisations were a minority and fell easily to Nationalist forces during the Spanish Civil War.\n\nFranco regime \n\nIn 1936, Francisco Franco was appointed General Commandant of the Canaries. He joined the military revolt of 17 July which began the Spanish Civil War. Franco quickly took control of the archipelago, except for a few points of resistance on La Palma and in the town of Vallehermoso, on La Gomera. Though there was never a war in the islands, the post-war suppression of political dissent on the Canaries was most severe.\n\nDuring the Second World War, Winston Churchill prepared plans for the British seizure of the Canary Islands as a naval base, in the event of Gibraltar being invaded from the Spanish mainland.\n\nOpposition to Franco's regime did not begin to organise until the late 1950s, which experienced an upheaval of parties such as the Communist Party of Spain and the formation of various nationalist, leftist parties.\n\nSelf-governance \n\nAfter the death of Franco, there was a pro-independence armed movement based in Algeria, the Movement for the Independence and Self-determination of the Canaries Archipelago (MAIAC). In 1968, the Organisation of African Unity recognized the MAIAC as a legitimate African independence movement, and declared the Canary Islands as an African territory still under foreign rule.James B. Minahan (2002), Encyclopedia of the Stateless Nations: Ethnic and National Groups Around the World, p. 377, Greenwood.\n\nAfter the establishment of a democratic constitutional monarchy in Spain, autonomy was granted to the Canaries via a law passed in 1982. In 1983, the first autonomous elections were held. The Spanish Socialist Workers' Party (PSOE) won. In the 2007 elections, the PSOE gained a plurality of seats, but the nationalist Canarian Coalition and the conservative Partido Popular (PP) formed a ruling coalition government.\n\nDemographics \n\nThe Canary Islands have a population of 2,117,519 inhabitants (2011), making it the eighth most populous of Spain's autonomous communities, with a density of 282.6 inhabitants per square kilometre. The total area of the archipelago is 7493 km2.\n\nThe Canarian population includes long-tenured residents and new waves of mainland Spanish immigrants, as well as Portuguese, Italians, Flemings and Britons. Of the total Canarian population in 2009 (2,098,593) 1,799,373 were Spanish and 299,220 foreigners. Of these, the majority are Europeans (55%), including Germans (39,505), British (37,937) and Italians (24,177). There are also 86,287 inhabitants from the Americas, mainly Colombians (21,798), Venezuelans (11,958), Cubans (11,098) and Argentines (10,159). There are also 28,136 African residents, mostly Moroccans (16,240).\n\nPopulation of the individual islands \n\nThe population of the islands according to the 2010 data are:[http://www.ine.es/jaxi/tabla.do?path/t20/e260/a2010/l0/&file\nis01.px&typepcaxis&L\n0 Population referred to the January 1, 2010] \n* Tenerife – 906,854\n* Gran Canaria – 845,676\n* Lanzarote – 141,437 (including the population of La Graciosa)\n* Fuerteventura – 103,492\n* La Palma – 86,324\n* La Gomera – 22,776\n* El Hierro – 10,960\n\nReligion \n\nThe Roman Catholic branch of Christianity has been the majority religion in the archipelago for more than five centuries, ever since the Conquest of the Canary Islands. However, there are other religious communities.\n\nRoman Catholic Church \n\nThe overwhelming majority of native Canarians are Roman Catholic (85%)[http://www.lavanguardia.com/vangdata/20150402/54429637154/interactivo-creencias-y-practicas-religiosas-en-espana.html Interactivo: Creencias y prácticas religiosas en España] with various smaller foreign-born populations of other Christian beliefs such as Protestants from northern Europe.\n\nThe appearance of the Virgin of Candelaria (Patron of Canary Islands) was credited with moving the Canary Islands toward Christianity. Two Catholic saints were born in the Canary Islands: Peter of Saint Joseph de Betancur[http://www.es.catholic.net/op/articulos/35981/pedro-de-san-jos-betancurt-santo.html Pedro de San José Betancurt, Santo] and José de Anchieta.[http://es.catholic.net/op/articulos/35379/jos-de-anchieta-santo.html José de Anchieta, Santo] Both born on the island of Tenerife, they were respectively missionaries in Guatemala and Brazil.\n\nThe Canary Islands are divided into two Catholic dioceses, each governed by a bishop:\n* Diócesis Canariense: Includes the islands of the Eastern Province: Gran Canaria, Fuerteventura and Lanzarote. Its capital was San Marcial El Rubicón (1404) and Las Palmas de Gran Canaria (1483–present). There was a previous bishopric which was based in Telde, but it was later abolished.\n* Diócesis Nivariense: Includes the islands of the western province: Tenerife, La Palma, La Gomera and El Hierro. Its capital is San Cristóbal de La Laguna (1819–present).\n\nOther religions \n\nSeparate from the overwhelming Christian majority are a minority of Muslims.[http://www.laopinion.es/sociedad/2008/10/03/sociedad-canarios-profesa-religion-minoritaria/173826.html Un 5% de canarios profesa una religión minoritaria] Among the followers of Islam, the Islamic Federation of the Canary Islands exists to represent the Islamic community in the Canary Islands as well as to provide practical support to members of the Islamic community.[http://www.laopinion.es/tenerife/2015/04/16/musulmanes-isla-constituyen-primera-federacion/601084.html Los musulmanes de la Isla constituyen la primera Federación Islámica de Canarias]\n\nOther religious faiths represented include Jehovah Witnesses, The Church of Jesus Christ of Latter-day Saints as well as Hinduism. Minority religions are also present such as the Church of the Guanche People which is classified as a neo-pagan native religion. Also present are Buddhism, Judaism, Baha'i, Afro-American religion, and Chinese religions.\n\nStatistics \n\nThe distribution of beliefs in 2012 according to the CIS Barometer Autonomy was as follows:[http://www.cis.es/cis/export/sites/default/-Archivos/Marginales/2940_2959/2956/CANARIAS_5/e295650.html Barometro Autonómico del CIS Canarias (2012); preguntas 47 y 48]\n* Catholic 84.9%\n* Atheist/Agnostic/Unbeliever 12.3%\n* Other religions 1.7%\n\nPopulation genetics \n\nIslands \n\nEl Hierro \n\nEl Hierro, the westernmost island, covers , making it the smallest of the major islands, and the least populous with 10,753 inhabitants. The whole island was declared Reserve of the Biosphere in 2000. Its capital is Valverde. Also known as Ferro, it was once believed to be the westernmost land in the world.\n\nFuerteventura \n\nFuerteventura, with a surface of 1660 km2, is the second-most extensive island of the archipelago. It has been declared a Biosphere reserve by Unesco. It has a population of 100,929. Being also the most ancient of the islands, it is the one that is more eroded: its highest point is the Peak of the Bramble, at a height of 807 m. Its capital is Puerto del Rosario.\n\nGran Canaria \n\nGran Canaria has 845,676 inhabitants. The capital, Las Palmas de Gran Canaria (377,203 inhabitants), is the most populous city and shares the status of capital of the Canaries with Santa Cruz de Tenerife. Gran Canaria's surface area is 1560 km2. In center of the island lie the Roque Nublo 1813 m and Pico de las Nieves (\"Peak of Snow\") 1949 m. In the south of island are the Maspalomas Dunes (Gran Canaria), these are the biggest tourist attractions.\n\nLa Gomera \n\nLa Gomera has an area of  and is the second least populous island with 22,622 inhabitants. Geologically it is one of the oldest of the archipelago. The insular capital is San Sebastian de La Gomera. Garajonay's National Park is located on the island.\n\nLanzarote \n\nLanzarote is the easternmost island and one of the most ancient of the archipelago, and it has shown evidence of recent volcanic activity. It has a surface of , and a population of 139,506 inhabitants, including the adjacent islets of the Chinijo Archipelago. The capital is Arrecife, with 56,834 inhabitants.\n\nChinijo Archipelago \n\nThe Chinijo Archipelago includes the islands La Graciosa, Alegranza, Montaña Clara, Roque del Este and Roque del Oeste. It has a surface of , and a population of 658 inhabitants all of them on La Graciosa. With 29 km2, La Graciosa, is the smallest inhabited island of the Canaries, and the major island of the Chinijo Archipelago.\n\nLa Palma \n\nLa Palma, with 86,528 inhabitants covering an area of , is in its entirety a biosphere reserve. It shows no recent signs of volcanic activity, even though the volcano Teneguía entered into eruption last in 1971. In addition, it is the second-highest island of the Canaries, with the Roque de los Muchachos 2423 m as highest point. Santa Cruz de La Palma (known to those on the island as simply \"Santa Cruz\") is its capital.\n\nTenerife \n\nTenerife is, with its area of 2034 km2, the most extensive island of the Canary Islands. In addition, with 906,854 inhabitants it is the most populated island of the archipelago and Spain. Two of the islands' principal cities are located on it: The capital, Santa Cruz de Tenerife and San Cristóbal de La Laguna (a World Heritage Site). San Cristóbal de La Laguna, the second city of the island is home to the oldest university in the Canary Islands, the University of La Laguna. The Teide, with its 3718 m is the highest peak of Spain and also a World Heritage Site. Tenerife is the site of the worst air disaster in the history of aviation, in which 583 people were killed in the collision of two Boeing 747s on 27 March 1977.\n\nData \n\nEconomy \n\nThe economy is based primarily on tourism, which makes up 32% of the GDP. The Canaries receive about 12 million tourists per year. Construction makes up nearly 20% of the GDP and tropical agriculture, primarily bananas and tobacco, are grown for export to Europe and the Americas. Ecologists are concerned that the resources, especially in the more arid islands, are being overexploited but there are still many agricultural resources like tomatoes, potatoes, onions, cochineal, sugarcane, grapes, vines, dates, oranges, lemons, figs, wheat, barley, maize, apricots, peaches and almonds.\n\nThe economy is € 25 billion (2001 GDP figures). The islands experienced continuous growth during a 20-year period, up until 2001, at a rate of approximately 5% annually. This growth was fueled mainly by huge amounts of Foreign Direct Investment, mostly to develop tourism real estate (hotels and apartments), and European Funds (near €11 billion euro in the period from 2000 to 2007), since the Canary Islands are labelled Region Objective 1 (eligible for euro structural funds). Additionally, the EU allows the Canary Islands Government to offer special tax concessions for investors who incorporate under the Zona Especial Canaria (ZEC) regime and create more than five jobs.\n\nSpain gave permission in August 2014 for Repsol and its partners to explore oil and gas prospects off the Canary Islands, involving an investment of €7.5 billion over four years, to commence at the end of 2016. Repsol at the time said the area could ultimately produce 100,000 barrels of oil a day, which would meet 10 percent of Spain's energy needs. However, the analysis of samples obtained did not show the necessary volume nor quality to consider future extraction, and the project was scrapped.\n\nThe Canary Islands have great natural attractions, climate and beaches make the islands a major tourist destination, being visited each year by about 12 million people (11,986,059 in 2007, noting 29% of Britons, 22% of Spanish, not residents of the Canaries, and 21% of Germans). Among the islands, Tenerife has the largest number of tourists received annually, followed by Gran Canaria and Lanzarote. The archipelago's principal tourist attraction is the Teide National Park (in Tenerife) where the highest mountain in Spain and third largest volcano in the world (Mount Teide), receives over 2.8 million visitors annually.\n\nThe combination of high mountains, proximity to Europe, and clean air has made the Roque de los Muchachos peak (on La Palma island) a leading location for telescopes like the Grantecan.\n\nThe islands are outside the European Union customs territory and VAT area, though politically within the EU and Schengen Area. Instead of VAT there is a local Sales Tax (IGIC) which has a general rate of 7%, an increased tax rate of 13.5%, a reduced tax rate of 3% and a zero tax rate for certain basic need products and services. Consequently, some products are subject to import tax and VAT if being exported from the islands into mainland Spain or the rest of the EU.\n\nCanarian time is Western European Time (WET) (or GMT; in summer one hour ahead of GMT). So Canarian time is one hour behind that of mainland Spain and the same as that of the UK, Ireland and Portugal all year round.\n\nTourism statistics \n\nNumber of tourists who visited the Canary Islands in 2016, per destination island (in thousands):[https://es.statista.com/estadisticas/526731/numero-de-turistas-que-visitaron-canarias-por-isla-de-destino/ Número de turistas que visitaron Canarias en 2016, por isla de destino (en miles)]\n\n* Tenerife - 4,885.9\n* Gran Canaria - 3,654.8\n* Lanzarote - 2,328.7 (extremely popular with Irish holiday makers all year round)\n* Fuerteventura - 1,914.1\n* La Palma - 221.5\n* La Gomera and El Hierro - 109.3\n\nTransport \n\nThe Canary Islands have eight airports altogether, two of the main ports of Spain, and an extensive network of autopistas (highways) and other roads. For a road map see multimap.\n\nThere are large ferry boats that link islands as well as fast ferries linking most of the islands. Both types can transport large numbers of passengers and cargo (including vehicles). Fast ferries are made of aluminium and powered by modern and efficient diesel engines, while conventional ferries have a steel hull and are powered by heavy oil. Fast ferries travel relatively quickly (in excess of 30 knots) and are a faster method of transportation than the conventional ferry (some 20 knots). A typical ferry ride between La Palma and Tenerife may take up to eight hours or more while a fast ferry takes about 2 and a half hours and between Tenerife and Gran Canaria can be about one hour.\n\nThe largest airport is the Gran Canaria Airport. Tenerife has two airports, Tenerife North Airport and Tenerife South Airport.[http://www2.gobiernodecanarias.org/istac/estadisticas/php/saltarA.php?mid=/istac/estadisticas/sector_servicios/transporte_comunicaciones/aereo/pas_tot.html Airport traffic]  The island of Tenerife gathers the highest passenger movement of all the Canary Islands through its two airports.[http://estadisticas.aena.es/csee/ccurl/52/737/Estadisticas_Acumulado%20DEF_2012.pdf AENA statistics for 2012] The two main islands (Tenerife and Gran Canaria) receive the greatest number of passengers.[http://www2.gobiernodecanarias.org/istac/estadisticas/sector_servicios/turismo/turistas/5_4_2_2_1.html Passengers in airports]  Tenerife 6,204,499 passengers and Gran Canaria 5,011,176 passengers.[https://web.archive.org/web/20030122081718/http://www.gobiernodecanarias.org/istac/estadisticas/sector_servicios/turismo/turistas/5_4_2_2_1.html Entrada en los aeropuertos canarios según islas]\n\nThe port of Las Palmas is first in freight traffic in the islands,[http://www2.gobiernodecanarias.org/istac/estadisticas/php/saltarA.php?mid/istac/estadisticas/sector_servicios/area_11_frame.html Freight traffic]  while the port of Santa Cruz de Tenerife is the first fishing port with approximately 7,500 tons of fish caught, according to the Spanish government publication Statistical Yearbook of State Ports. Similarly, it is the second port in Spain as regards ship traffic, only surpassed by the Port of Algeciras Bay. The port's facilities include a border inspection post (BIP) approved by the European Union, which is responsible for inspecting all types of imports from third countries or exports to countries outside the European Economic Area. The port of Los Cristianos (Tenerife) has the greatest number of passengers recorded in the Canary Islands, followed by the port of Santa Cruz de Tenerife. The Port of Las Palmas is the third port in the islands in passengers and first in number of vehicles transported.\n\nThe SS America was beached at the Canary islands, in the nineties. However, the ocean liner fell apart after some years and parts of the ship washed away.\n\nRail transport \n\nThe Tenerife Tram opened in 2007 and the only one in the Canary Islands, travelling between the cities of Santa Cruz de Tenerife and San Cristóbal de La Laguna. It is currently planned to have three lines in the Canary Islands (two in Tenerife and one in Gran Canaria). The planned Gran Canaria tram route will be from Las Palmas de Gran Canaria to Maspalomas (south).\n\nAirports \n\n* Tenerife South Airport – Tenerife\n* Tenerife North Airport – Tenerife\n* Lanzarote Airport – Lanzarote\n* Fuerteventura Airport – Fuerteventura\n* Gran Canaria Airport – Gran Canaria\n* La Palma Airport – La Palma\n* La Gomera Airport – La Gomera\n* El Hierro Airport – El Hierro[http://www2.gobiernodecanarias.org/istac/estadisticas/php/saltarA.php?mid=/istac/estadisticas/sector_servicios/transporte_comunicaciones/aereo/pas_tot.html Airports by passenger traffic, 2010, July] \n\nPorts \n\n \n* Port of Puerto del Rosario – Fuerteventura\n* Port of Arrecife – Lanzarote\n* Port of Playa Blanca—Lanzarote\n* Port of Santa Cruz de La Palma – La Palma\n* Port of San Sebastián de La Gomera – La Gomera\n* Port of La Estaca – El Hierro\n* Port of Las Palmas – Gran Canaria\n* Port of Agaete – Gran Canaria\n* Port of Los Cristianos – Tenerife\n* Port of Santa Cruz de Tenerife – Tenerife\n* Port of Garachico – Tenerife\n* Port of Granadilla – Tenerife\n\nWildlife \n\nPrehistoric fauna \n\nBefore the arrival of the Aborigines, the Canary Islands was inhabited by endemic animals, such as some extinct; giant lizards (Gallotia goliath), giant rats (Canariomys bravoi and Canariomys tamarani)[http://www.gobiernodecanarias.org/cmayot/medioambiente/lagartodelagomera/gatos.html Algunas extinciones en Canarias]  Consejería de Medio Ambiente y Ordenación Territorial del Gobierno de Canarias and giant tortoises (Geochelone burchardi and Geochelone vulcanica),[http://www.sepaleontologia.es/revista/anteriores/REP%20Extra%201996/21Castillo.pdf «La Paleontología de vertebrados en Canarias.»] Spanish Journal of Palaeontology (antes Revista Española de Paleontología). Consultado el 17 de junio de 2016. among others.\n\nTerrestrial wildlife \n\nWith a range of habitats, the Canary Islands exhibit diverse plant species. The bird life includes European and African species, such as the black-bellied sandgrouse; and a rich variety of endemic (local) taxa including the:\n* Canary\n* Graja, a subspecies of red-billed chough endemic to La Palma\n* Blue chaffinch (endemic to Tenerife and Gran Canaria)\n* Canary Islands chiffchaff\n* Fuerteventura chat\n* Tenerife goldcrest\n* La Palma chaffinch\n* Canarian Egyptian vulture\n* Bolle's pigeon\n* Laurel pigeon\n* Plain swift\n* Houbara bustard\n* Spiders\n* Snakes\n* Scorpions\n* Giant wasps\n* †Canary Islands oystercatcher (extinct)\n\nTerrestrial fauna includes geckos, wall lizards, and three endemic species of recently rediscovered and critically endangered giant lizard: the El Hierro giant lizard (or Roque Chico de Salmor giant lizard), La Gomera giant lizard, and La Palma giant lizard. Mammals include the Canarian shrew, Canary big-eared bat, the Algerian hedgehog (which may have been introduced) and the more recently introduced mouflon. Some endemic mammals, the lava mouse, Tenerife giant rat and Gran Canaria giant rat, are extinct, as are the Canary Islands quail, long-legged bunting, the eastern Canary Islands chiffchaff and the giant prehistoric tortoises; Geochelone burchardi and Geochelone vulcanica.\n\nMarine life \n\nThe marine life found in the Canary Islands is also varied, being a combination of North Atlantic, Mediterranean and endemic species. In recent years, the increasing popularity of both scuba diving and underwater photography have provided biologists with much new information on the marine life of the islands.\n\nFish species found in the islands include many species of shark, ray, moray eel, bream, jack, grunt, scorpionfish, triggerfish, grouper, goby, and blenny. In addition, there are many invertebrate species, including sponge, jellyfish, anemone, crab, mollusc, sea urchin, starfish, sea cucumber and coral.\n\nThere are a total of five different species of marine turtle that are sighted periodically in the islands, the most common of these being the endangered loggerhead sea turtle. The other four are the green sea turtle, hawksbill sea turtle, leatherback sea turtle and Kemp's ridley sea turtle. Currently, there are no signs that any of these species breed in the islands, and so those seen in the water are usually migrating. However, it is believed that some of these species may have bred in the islands in the past, and there are records of several sightings of leatherback sea turtle on beaches in Fuerteventura, adding credibility to the theory.\n\nMarine mammals include the large varieties of cetaceans including rare and not well-known species (see more details in the Marine life of the Canary Islands). Hooded sealshttp://www.iucnredlist.org/details/6204/0 have also been known to be vagrant in the Canary Islands every now and then. The Canary Islands were also formerly home to a population of the rarest pinniped in the world, the Mediterranean monk seal.\n\nNative flora gallery \n\nTajinaste rojo.jpg \nArbutus canariensis2.jpg\nDigitalis (Isoplexis) canariensis by Scott zona - 004.jpg\nSonchus palmensis (Barlovento) 04.jpg\nLotus berthelotii1.jpg \nPersea indica.jpg\nCanarina canariensis Tenerife (02).jpg\nPhoenix canariensis (Puntallana) 01.jpg\nEuphorbia canariensis2.jpg\nBosea yervamora berries.JPG\nGonospermum elegans.jpg\nPericallis webbii.jpg\nArgyranthemum frutescens cv Vera 2.jpg\nLavatera acerifolia var. acerifolia (Jardín Botánico Canario Viera y Clavijo).jpg\nLavatera phoenicea1.jpg\nSpartocytisus supranubius.jpg\n\nSports \n\nA unique form of wrestling known as Canarian wrestling (lucha canaria) has opponents stand in a special area called a \"terrero\" and try to throw each other to the ground using strength and quick movements.\n\nAnother sport is the \"game of the sticks\" where opponents fence with long sticks. This may have come about from the shepherds of the islands who would challenge each other using their long walking sticks.\n\nFurthermore, there is the shepherd's jump (salto del pastor). This involves using a long stick to vault over an open area. This sport possibly evolved from the shepherd's need to occasionally get over an open area in the hills as they were tending their sheep.\n\nThe two main football teams in the archipelago are: the CD Tenerife (founded in 1912) and UD Las Palmas (founded in 1949). Now Tenerife play in Liga Adelante and Las Palmas in La Liga.\n\nThe mountainous terrain of the Canary Islands also caters to the growing popularity of ultra running and ultramarathons as host of annual competitive long-distance events including Transvulcania on La Palma, Transgrancanaria on Gran Canaria and the Half Marathon des Sables on Fuerteventura.\n\nNotable athletes \n\n* Javier Dorado, born in 2000, from the Islands of Lanzarote, Division 1 basketball player in the US\n* Nicolás García Hemme, born 20 June 1988 in Las Palmas de Gran Canaria, Canary Islands, 2012 London Olympics, Taekwondo Silver Medalist in Men's Welterweight category (−80 kg).\n* Alfredo Cabrera, (1881–1964); shortstop for the St. Louis Cardinals in 1913\n* Sergio Rodríguez, born in San Cristóbal de La Laguna in 1986, played point guard for the Portland Trail Blazers, Sacramento Kings, and New York Knicks\n* David Silva, born in Arguineguín in 1986, plays association football for Manchester City, member of the 2010 FIFA World Cup champion Spain national football team\n* Juan Carlos Valerón, born in Arguineguín in 1975, plays association football for Las Palmas\n* Pedro, born in Santa Cruz de Tenerife in 1987, plays association football for Chelsea, member of the 2010 FIFA World Cup champion Spain national football team\n* Carla Suárez Navarro, born in Las Palmas de Gran Canaria in 1988, professional tennis player\n* Paola Tirados, born in Las Palmas de Gran Canaria in 1980, synchronized swimmer, who participated in the Olympic Games of 2000, 2004 and 2008. She won the silver medal in Beijing in 2008 in the team competition category.\n* Jesé, born in Las Palmas de Gran Canaria in 1993, plays association football for Stoke City F.C., on loan from Paris Saint-Germain\n* Christo Bezuidenhout, born in Tenerife in 1970, played rugby union for Gloucester and South Africa. Canary Islands. http://en.wikipedia.org/?curid=5717."
  }
}
