{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18100",
  "eid" : "30db87f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778591215,
  "textBody" : "Ludwik Lejzer Zamenhof (;  – ), usually credited as L. L. Zamenhof, was a Polishhttp://www.biographybase.com/biography/zamenhof_l_l.html medical doctor, inventor, and writer. He is most widely known for creating Esperanto, the most successful constructed language in the world. He grew up fascinated by the idea of a world without war and believed that this could happen with the help of a new international auxiliary language, which he first developed in 1873 while still in school.\n\nBiography\n\nZamenhof was born on 15 December (3 December OS) 1859 in the town of Białystok, Poland, at that time in the former Russian Empire as a result of the 18th-century partition of Poland. His parents were of Polish-Lithuanian Jewish descent that inhabited the central part of the former Polish-Lithuanian Commonwealth. He appears to have been natively bilingual in Yiddish and Russian (the Polish language was restricted and forbidden in administrative contexts by the Tsarist authorities), presumably the Belarusian language  of his home town, though it may have been only his father who spoke Russian with him at home. From his father, a teacher of German and French, he learned those languages and Hebrew as well. Despite this he spoke Polish, one of the major languages of Białystok alongside Yiddish, Belarusian, and German, and it was Polish that was to become the native language of his children after settling in the Kingdom of Poland. In school he studied the classical languages: Latin, Greek, Hebrew, and Aramaic. He later learned some English, though in his own words not very well, had an interest in Lithuanian and Italian, and learned Volapük when it came out in 1880, though by that point his international language project was already well developed.Christer Kiselman, [http://www2.math.uu.se/~kiselman/pau2008.pdf \"Esperanto: Its origins and early history\"], in Andrzej Pelczar, ed., 2008, Prace Komisji Spraw Europejskich PAU, vol. II, pp. 39–56, Krakaw.\n\nIn addition to the Yiddish-speaking Jewish majority, the population of Białystok was made up of Catholic Poles and Belarusians, with smaller groups of Russians, Germans, Lipka Tatars, Lithuanians and others. Zamenhof was saddened and frustrated by the many quarrels among these groups. He supposed that the main reason for the hate and prejudice lay in the mutual misunderstanding caused by the lack of one common language. If such a language existed, Zamenhof postulated, it could play the role of a neutral communication tool between people of different ethnic and linguistic backgrounds.\n\nAs a student at secondary school in Warsaw, Zamenhof made attempts to create some kind of international language with a grammar that was very rich, but also very complex. When he later studied English, he decided that the international language must have a simpler grammar. Apart from his parents' native languages Russian and Yiddish and his adopted language Polish, his linguistics attempts were also aided by his mastering of German, a good passive understanding of Latin, Hebrew and French, and a basic knowledge of Greek, English and Italian.Holzhaus, Adolf: Doktoro kaj lingvo Esperanto. Helsinki: Fondumo Esperanto. 1969\n\nBy 1878, his project Lingwe uniwersala was almost finished. However, Zamenhof was too young then to publish his work. Soon after graduation from school he began to study medicine, first in Moscow, and later in Warsaw. In 1885, Zamenhof graduated from a university and began his practice as a doctor in Veisiejai and after 1886 as an ophthalmologist in Płock and Vienna. While healing people there he continued to work on his project of an international language.\n\nFor two years he tried to raise funds to publish a booklet describing the language until he received the financial help from his future wife's father. In 1887, the book titled Международный язык. Предисловие и полный учебник (International language: Introduction and complete textbook) was published in RussianKeith Brown and Sarah Ogilvie, Concise Encyclopedia of Languages of the World (Elsevier, 2009: ), p. 375. under the pseudonym \"Doktoro Esperanto\" (Doctor Hopeful). Zamenhof initially called his language \"Lingvo internacia\" (international language), but those who learned it began to call it Esperanto after his pseudonym, and this soon became the official name for the language. For Zamenhof this language, far from being merely a communication tool, was a way of promoting the peaceful coexistence of different people and cultures.\n\nWork on Yiddish language and Jewish issues\n\nIn 1879 Zamenhof wrote the first grammar of the Yiddish language, which he published in part years later in the Yiddish magazine Lebn un visnshaft.Vilnius, 1909; see Esperanto translation as Pri jida gramatiko kaj reformo en la jida (On Yiddish grammar and reform in Yiddish) in Hebreo el la geto: De cionismo al hilelismo (A Hebrew from the ghetto: From Zionism to Hillelism), Eldonejo Ludovikito, vol. 5, 1976 The complete original Russian text of this manuscript was only published in 1982, with parallel Esperanto translation by Adolf Holzhaus, in L. Zamenhof, provo de gramatiko de novjuda lingvo [An attempt at a grammar of neo-Jewish language], Helsinki, p. 9–36. In this work, not only does he provide a review of Yiddish grammar, but also proposes its transition to the Latin script and other orthographic innovations. In the same period Zamenhof wrote some other works in Yiddish, including perhaps the first survey of Yiddish poetics (see p. 50 in the above-cited book).\n\nIn 1882 a wave of pogroms within the Russian Empire, including Congress Poland, motivated Zamenhof to take part in the early Zionist movement, the Hibbat Zion. He left the movement in 1887, and in 1901 published a statement in Russian with the title Hillelism, in which he argued that the Zionist project could not solve the problems of the Jewish people.\n\nIn 1914 he declined an invitation to join a new organization of Jewish Esperantists, the TEHA. In his letter to the organizers, he said, \"I am profoundly convinced that every nationalism offers humanity only the greatest unhappiness... It is true that the nationalism of oppressed peoples – as a natural self-defensive reaction – is much more excusable than the nationalism of peoples who oppress; but, if the nationalism of the strong is ignoble, the nationalism of the weak is imprudent; both give birth to and support each other...\" Among the many works of Zamenhof translated into Esperanto is the Hebrew Bible or the Old Testament.\n\nZamenhof died in Warsaw on 14 April 1917, possibly of heart failure,[http://www.onb.ac.at/ev/collections/esperanto/Planned_languages_Ludwig_Lazar_Zamenhof.htm \"Ludwig Lazar Zamenhof – Founder of Esperanto\"] , Department of Planned Languages. and was buried at the Okopowa Street Jewish Cemetery. The farewell speech was delivered by the chief rabbi and preacher of the Great Synagogue in Warsaw, Samuel Abraham Poznański, who said: \"There will be a time where the Polish soil and nation will understand what fame gave this great son of God to his homeland.\"https://web.archive.org/web/20070630123854/http://www.szukamypolski.pl/rzeznia.php?id=22\n\nReligious philosophy\n\nBesides his linguistic work, Zamenhof published a religious philosophy he called Homaranismo (the term in Esperanto, usually rendered as \"humanitism\" in English,[http://ses.library.usyd.edu.au/bitstream/2123/9810/1/J-McElvenny2013.pdf Meaning in the Age of Modernism: C. K. Ogden and his contemporaries, Thesis of James McElvenny, 2013] sometimes rendered loosely as humanitarianism or humanism), based on the principles and teachings of Hillel the Elder. He astonishingly said of Homaranismo: \"It is indeed the object of my whole life. I would give up everything for it.\"Edmond Privat, \"The Life of Zamenhof\" p 117.\n\nName discrepancy\n\nZamenhof came from and lived a very-much multilingual life. His name is/was variously, depending on the language:\n* English: Ludwig Lazarus Zamenhof –\n* Esperanto:  –\n* German: \n* Hebrew:  – Eliezer Ludwig Zamenhof\n* Polish: \n* Russian:  – Lyudvik Lazar' \"Leizer\" Markovich Zamengov\n* Yiddish:  – Leyzer \"Levi\" Zamenhof\n\nAt his birth Zamenhof was given the Hebrew name Eliezer by his parents, the equivalent of the Latinized Lazarus. However Zamenhof was born under Russian domination, and so his birth certificate records his name as  Leyzer Zamengov, using the Yiddish form of the forename and a russified version of his surname;[http://www.bialystok.ap.gov.pl/bit/50lat/boznicze_zamenhof1.jpg Birth Certificate N 47: \"Leyzer Zamengov, son of Mordkha Fayvelovich Zamengov and Liba Sholemovna Sofer\"]  many later Russian language documents also include the patronymic Markovich, as is the custom in the language. His family name is of German origin and was originally written Samenhof; the spelling Zamenhof reflects the romanization of the Yiddish spelling , as well as the Esperanto and Polish spellings.\n\nIn his adolescence he used both the Yiddish Leyzer and the Russian Lazar.\n\nWhile at university, Zamenhof began using the Russian name Lyudovik (also transcribed Ludovic or translated as Ludwig) in place of Lazar, possibly in honor of Francis Lodwick, who in 1652 had published an early conlang proposal. When his brother Leon became a doctor and started signing his name \"Dr L. Zamenhof\", Zamenhof reclaimed his birth name Lazar and from 1901 signed his name \"Dr L. L. Zamenhof\" to avoid confusion with his brother. The two L's do not seem to have specifically represented either name, and the order Ludwik Lazar is a modern convention.\n\nHonours and namesakes\n\nIn 1905 Zamenhof received the Légion d'honneur for creating Esperanto. In 1910, Zamenhof was nominated for the Nobel Peace Prize, by four British Members of Parliament (including James O'Grady, Philip Snowden) and Professor Stanley Lane Poole.[http://nobelprize.org/nomination/peace/nomination.php?actionshow&showid\n529 Nobel Prize nomnination database] (The Prize was instead awarded to the International Peace Bureau.) On the occasion of the 5th Universala Kongreso de Esperanto in Barcelona, Zamenhof was made a Commander of the Order of Isabella the Catholic by King Alfonso XIII of Spain.[http://www.webislam.com/?idt=19050 Olaizola, Borja. \"Chatear en Esperanto, vigésimo idioma del mundo más usado en la red.\" El Correo. 30/03/2011.]\n\nThe minor planet 1462 Zamenhof is named in his honor. It was discovered on 6 February 1938, by Yrjö Väisälä. Also, hundreds of city streets, parks, and bridges worldwide have been named after Zamenhof.See the list of Zamenhof/Esperanto Objects on the Wikipedia in Esperanto In Lithuania, the best-known Zamenhof Street is in Kaunas, where he lived and owned a house for some time. There are others in Poland, the United Kingdom, France, Hungary, the Czech Republic, Spain (mostly in Catalonia), Italy, Israel, Belgium and Brazil. There are Zamenhof Hills in Hungary and Brazil, and a Zamenhof Island in the Danube.[http://www.esperanto-sat.info/article187.html Hommages au Dr Zamenhof, à l'espéranto et à ses pionniers].\n\nIn some Israeli cities, street signs identify Esperanto's creator and give his birth and death dates, but refer to him solely by his Jewish name Eliezer (a variant of which, El'azar, is the origin of Lazarus). Zamenhof is honored as a deity by the Japanese religion Oomoto, which encourages the use of Esperanto among its followers. Also, a genus of lichen has been named Zamenhofia in his honour.[http://www.arkive.org/species/ARK/fungi/Zamenhofia_rosei/more_info.html Zamenhofia rosei: Francis' lichen. Range, habitat, biology].\n\nIn 1959, Unesco honoured Zamenhof in the occasion of his centenary.Jewish Telegraphic Agency: [http://www.jta.org/1959/12/16/archive/unesco-to-honor-memory-of-zamenhof-jewish-creator-of-esperanto UNESCO to Honor Memory of Zamenhof, Jewish Creator of Esperanto], December 16, 1959 In 2015 Unesco decided to support the celebration of the 100th anniversary of the death of Ludwik Zamenhof.[http://unesdoc.unesco.org/images/0023/002352/235205e.pdf Unesco]; [http://uea.org/aktuale/komunikoj/2015/Gxenerala-Konferenco-de-Unesko-finigxis-%E2%80%93-Zamenhof-omagxota UEA: Zamenhof omaĝota]\n\nZamenhof was 12 times nominated for the Nobel Peace Prize.\n\nHis birthday, 15 December, is celebrated annually as Zamenhof Day by users of Esperanto. On 15 December 2009, Esperanto's green-starred flag flew on the Google search web page, in a commemorative Google Doodle to mark Zamenhof's 150th birthday.[https://www.google.com/doodles/150th-birthday-of-ll-zamenhof Google Doodles Archive: 150th Birthday of LL Zamenhof] Retrieved 2010-04-01.\n\nThe house of the Zamenhof family, dedicated to Ludwik Zamenhof, and the Białystok Esperanto Centre, are sites of the Jewish Heritage Trail in Białystok, which was opened in June 2008 by volunteers at The University of Białystok Foundation.[http://szlak.uwb.edu.pl/sites.html Jewish Heritage Trail in Białystok] accessed 25 July 2009.\n\nBibliography (partial)\n\nOriginal works\n\n* Unua Libro, 1887 (English: First Book)\n* Dua Libro, 1888 (Second Book)\n* Hilelismo – propono pri solvo de la hebrea demando, 1901 (Hillelism: A Project in Response to the Jewish Question)\n* Esenco kaj estonteco de la ideo de lingvo internacia, 1903 (Essence and Future of the Idea of an International Language)\n* Fundamenta Krestomatio de la Lingvo Esperanto, 1903 (Basic Anthology of the Esperanto Language)\n* Fundamento de Esperanto, 1905 (Foundation of Esperanto)\n* Declaration of Boulogne, 1905\n* Homaranismo, 1913 (Humanitism)http://homarano.narod.ru/Windows/homar_e.htm\n\nPeriodicals\n\n* La Esperantisto, 1889–1895 (The Esperantist)\n* Lingvo Internacia, 1895–1914 (International Language)\n* La Revuo, 1906–1914 (The Review)\n\nPoems\n\n* \"Al la fratoj\" (\"To the Brothers\")\n* \"La Espero\" (\"The Hope\")\n* \"Ho, mia kor'\" (\"Oh, My Heart\")\n* \"Mia penso\" (\"My Thought\")\n* \"La vojo\" (\"The Way\")\n\nTranslations\n\n* La batalo de l' vivo (The Battle of Life) by Charles Dickens\n* Ifigenio en Taŭrido (Iphigenia in Tauris) by Johann Wolfgang von Goethe\n* Hamleto, Reĝido de Danujo (Hamlet, Prince of Denmark) by William Shakespeare\n* Malnova Testamento (Old Testament) (parts)\n* Marta by Eliza Orzeszkowa\n* La Rabistoj (The Robbers) by Friedrich Schiller\n* La Revizoro (The Government Inspector) by Nikolai Gogol\n\nGallery\n\nGrób Ludwika Zamenhofa na cmentarzu żydowskim w Warszawie 2017.jpg|Grave of L. L. Zamenhof in Warsaw\nZamenhof st.jpg|Eliezer Zamenhof street in Tel Aviv: the street sign in Hebrew and Esperanto states he is the creator of the international language Esperanto\nZamenhof commemorative plaque 5 Zamenhofa Street Warsaw.JPG|Commemorative plaque at 5 Zamenhofa Street in Warsaw where the house in which Zamenhof lived and worked in 1898–1915 stood\nZamenhof Minekov.jpg|Zamenhof, relief by Ivan Minekov, Bulgaria\nUlica Ludwika Zamenhofa 26 w Białymstoku Tutaj stał dom, w którym urodził się Ludwik Zamenhof.JPG|Site of former 6 Zielona Street in Białystok, where Zamenhof was born\nZamenhof awers.jpg|Obverse of medal with Ludovic Lazarus Zamenhof by Gosławski (1959)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "L. L. Zamenhof" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18100" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ludwik Lejzer Zamenhof (;  – ), usually credited as L. L. Zamenhof, was a Polishhttp://www.biographybase.com/biography/zamenhof_l_l.html medical doctor, inventor, and writer. He is most widely known for creating Esperanto, the most successful constructed language in the world. He grew up fascinated by the idea of a world without war and believed that this could happen with the help of a new international auxiliary language, which he first developed in 1873 while still in school.\n\nBiography\n\nZamenhof was born on 15 December (3 December OS) 1859 in the town of Białystok, Poland, at that time in the former Russian Empire as a result of the 18th-century partition of Poland. His parents were of Polish-Lithuanian Jewish descent that inhabited the central part of the former Polish-Lithuanian Commonwealth. He appears to have been natively bilingual in Yiddish and Russian (the Polish language was restricted and forbidden in administrative contexts by the Tsarist authorities), presumably the Belarusian language  of his home town, though it may have been only his father who spoke Russian with him at home. From his father, a teacher of German and French, he learned those languages and Hebrew as well. Despite this he spoke Polish, one of the major languages of Białystok alongside Yiddish, Belarusian, and German, and it was Polish that was to become the native language of his children after settling in the Kingdom of Poland. In school he studied the classical languages: Latin, Greek, Hebrew, and Aramaic. He later learned some English, though in his own words not very well, had an interest in Lithuanian and Italian, and learned Volapük when it came out in 1880, though by that point his international language project was already well developed.Christer Kiselman, [http://www2.math.uu.se/~kiselman/pau2008.pdf \"Esperanto: Its origins and early history\"], in Andrzej Pelczar, ed., 2008, Prace Komisji Spraw Europejskich PAU, vol. II, pp. 39–56, Krakaw.\n\nIn addition to the Yiddish-speaking Jewish majority, the population of Białystok was made up of Catholic Poles and Belarusians, with smaller groups of Russians, Germans, Lipka Tatars, Lithuanians and others. Zamenhof was saddened and frustrated by the many quarrels among these groups. He supposed that the main reason for the hate and prejudice lay in the mutual misunderstanding caused by the lack of one common language. If such a language existed, Zamenhof postulated, it could play the role of a neutral communication tool between people of different ethnic and linguistic backgrounds.\n\nAs a student at secondary school in Warsaw, Zamenhof made attempts to create some kind of international language with a grammar that was very rich, but also very complex. When he later studied English, he decided that the international language must have a simpler grammar. Apart from his parents' native languages Russian and Yiddish and his adopted language Polish, his linguistics attempts were also aided by his mastering of German, a good passive understanding of Latin, Hebrew and French, and a basic knowledge of Greek, English and Italian.Holzhaus, Adolf: Doktoro kaj lingvo Esperanto. Helsinki: Fondumo Esperanto. 1969\n\nBy 1878, his project Lingwe uniwersala was almost finished. However, Zamenhof was too young then to publish his work. Soon after graduation from school he began to study medicine, first in Moscow, and later in Warsaw. In 1885, Zamenhof graduated from a university and began his practice as a doctor in Veisiejai and after 1886 as an ophthalmologist in Płock and Vienna. While healing people there he continued to work on his project of an international language.\n\nFor two years he tried to raise funds to publish a booklet describing the language until he received the financial help from his future wife's father. In 1887, the book titled Международный язык. Предисловие и полный учебник (International language: Introduction and complete textbook) was published in RussianKeith Brown and Sarah Ogilvie, Concise Encyclopedia of Languages of the World (Elsevier, 2009: ), p. 375. under the pseudonym \"Doktoro Esperanto\" (Doctor Hopeful). Zamenhof initially called his language \"Lingvo internacia\" (international language), but those who learned it began to call it Esperanto after his pseudonym, and this soon became the official name for the language. For Zamenhof this language, far from being merely a communication tool, was a way of promoting the peaceful coexistence of different people and cultures.\n\nWork on Yiddish language and Jewish issues\n\nIn 1879 Zamenhof wrote the first grammar of the Yiddish language, which he published in part years later in the Yiddish magazine Lebn un visnshaft.Vilnius, 1909; see Esperanto translation as Pri jida gramatiko kaj reformo en la jida (On Yiddish grammar and reform in Yiddish) in Hebreo el la geto: De cionismo al hilelismo (A Hebrew from the ghetto: From Zionism to Hillelism), Eldonejo Ludovikito, vol. 5, 1976 The complete original Russian text of this manuscript was only published in 1982, with parallel Esperanto translation by Adolf Holzhaus, in L. Zamenhof, provo de gramatiko de novjuda lingvo [An attempt at a grammar of neo-Jewish language], Helsinki, p. 9–36. In this work, not only does he provide a review of Yiddish grammar, but also proposes its transition to the Latin script and other orthographic innovations. In the same period Zamenhof wrote some other works in Yiddish, including perhaps the first survey of Yiddish poetics (see p. 50 in the above-cited book).\n\nIn 1882 a wave of pogroms within the Russian Empire, including Congress Poland, motivated Zamenhof to take part in the early Zionist movement, the Hibbat Zion. He left the movement in 1887, and in 1901 published a statement in Russian with the title Hillelism, in which he argued that the Zionist project could not solve the problems of the Jewish people.\n\nIn 1914 he declined an invitation to join a new organization of Jewish Esperantists, the TEHA. In his letter to the organizers, he said, \"I am profoundly convinced that every nationalism offers humanity only the greatest unhappiness... It is true that the nationalism of oppressed peoples – as a natural self-defensive reaction – is much more excusable than the nationalism of peoples who oppress; but, if the nationalism of the strong is ignoble, the nationalism of the weak is imprudent; both give birth to and support each other...\" Among the many works of Zamenhof translated into Esperanto is the Hebrew Bible or the Old Testament.\n\nZamenhof died in Warsaw on 14 April 1917, possibly of heart failure,[http://www.onb.ac.at/ev/collections/esperanto/Planned_languages_Ludwig_Lazar_Zamenhof.htm \"Ludwig Lazar Zamenhof – Founder of Esperanto\"] , Department of Planned Languages. and was buried at the Okopowa Street Jewish Cemetery. The farewell speech was delivered by the chief rabbi and preacher of the Great Synagogue in Warsaw, Samuel Abraham Poznański, who said: \"There will be a time where the Polish soil and nation will understand what fame gave this great son of God to his homeland.\"https://web.archive.org/web/20070630123854/http://www.szukamypolski.pl/rzeznia.php?id=22\n\nReligious philosophy\n\nBesides his linguistic work, Zamenhof published a religious philosophy he called Homaranismo (the term in Esperanto, usually rendered as \"humanitism\" in English,[http://ses.library.usyd.edu.au/bitstream/2123/9810/1/J-McElvenny2013.pdf Meaning in the Age of Modernism: C. K. Ogden and his contemporaries, Thesis of James McElvenny, 2013] sometimes rendered loosely as humanitarianism or humanism), based on the principles and teachings of Hillel the Elder. He astonishingly said of Homaranismo: \"It is indeed the object of my whole life. I would give up everything for it.\"Edmond Privat, \"The Life of Zamenhof\" p 117.\n\nName discrepancy\n\nZamenhof came from and lived a very-much multilingual life. His name is/was variously, depending on the language:\n* English: Ludwig Lazarus Zamenhof –\n* Esperanto:  –\n* German: \n* Hebrew:  – Eliezer Ludwig Zamenhof\n* Polish: \n* Russian:  – Lyudvik Lazar' \"Leizer\" Markovich Zamengov\n* Yiddish:  – Leyzer \"Levi\" Zamenhof\n\nAt his birth Zamenhof was given the Hebrew name Eliezer by his parents, the equivalent of the Latinized Lazarus. However Zamenhof was born under Russian domination, and so his birth certificate records his name as  Leyzer Zamengov, using the Yiddish form of the forename and a russified version of his surname;[http://www.bialystok.ap.gov.pl/bit/50lat/boznicze_zamenhof1.jpg Birth Certificate N 47: \"Leyzer Zamengov, son of Mordkha Fayvelovich Zamengov and Liba Sholemovna Sofer\"]  many later Russian language documents also include the patronymic Markovich, as is the custom in the language. His family name is of German origin and was originally written Samenhof; the spelling Zamenhof reflects the romanization of the Yiddish spelling , as well as the Esperanto and Polish spellings.\n\nIn his adolescence he used both the Yiddish Leyzer and the Russian Lazar.\n\nWhile at university, Zamenhof began using the Russian name Lyudovik (also transcribed Ludovic or translated as Ludwig) in place of Lazar, possibly in honor of Francis Lodwick, who in 1652 had published an early conlang proposal. When his brother Leon became a doctor and started signing his name \"Dr L. Zamenhof\", Zamenhof reclaimed his birth name Lazar and from 1901 signed his name \"Dr L. L. Zamenhof\" to avoid confusion with his brother. The two L's do not seem to have specifically represented either name, and the order Ludwik Lazar is a modern convention.\n\nHonours and namesakes\n\nIn 1905 Zamenhof received the Légion d'honneur for creating Esperanto. In 1910, Zamenhof was nominated for the Nobel Peace Prize, by four British Members of Parliament (including James O'Grady, Philip Snowden) and Professor Stanley Lane Poole.[http://nobelprize.org/nomination/peace/nomination.php?actionshow&showid\n529 Nobel Prize nomnination database] (The Prize was instead awarded to the International Peace Bureau.) On the occasion of the 5th Universala Kongreso de Esperanto in Barcelona, Zamenhof was made a Commander of the Order of Isabella the Catholic by King Alfonso XIII of Spain.[http://www.webislam.com/?idt=19050 Olaizola, Borja. \"Chatear en Esperanto, vigésimo idioma del mundo más usado en la red.\" El Correo. 30/03/2011.]\n\nThe minor planet 1462 Zamenhof is named in his honor. It was discovered on 6 February 1938, by Yrjö Väisälä. Also, hundreds of city streets, parks, and bridges worldwide have been named after Zamenhof.See the list of Zamenhof/Esperanto Objects on the Wikipedia in Esperanto In Lithuania, the best-known Zamenhof Street is in Kaunas, where he lived and owned a house for some time. There are others in Poland, the United Kingdom, France, Hungary, the Czech Republic, Spain (mostly in Catalonia), Italy, Israel, Belgium and Brazil. There are Zamenhof Hills in Hungary and Brazil, and a Zamenhof Island in the Danube.[http://www.esperanto-sat.info/article187.html Hommages au Dr Zamenhof, à l'espéranto et à ses pionniers].\n\nIn some Israeli cities, street signs identify Esperanto's creator and give his birth and death dates, but refer to him solely by his Jewish name Eliezer (a variant of which, El'azar, is the origin of Lazarus). Zamenhof is honored as a deity by the Japanese religion Oomoto, which encourages the use of Esperanto among its followers. Also, a genus of lichen has been named Zamenhofia in his honour.[http://www.arkive.org/species/ARK/fungi/Zamenhofia_rosei/more_info.html Zamenhofia rosei: Francis' lichen. Range, habitat, biology].\n\nIn 1959, Unesco honoured Zamenhof in the occasion of his centenary.Jewish Telegraphic Agency: [http://www.jta.org/1959/12/16/archive/unesco-to-honor-memory-of-zamenhof-jewish-creator-of-esperanto UNESCO to Honor Memory of Zamenhof, Jewish Creator of Esperanto], December 16, 1959 In 2015 Unesco decided to support the celebration of the 100th anniversary of the death of Ludwik Zamenhof.[http://unesdoc.unesco.org/images/0023/002352/235205e.pdf Unesco]; [http://uea.org/aktuale/komunikoj/2015/Gxenerala-Konferenco-de-Unesko-finigxis-%E2%80%93-Zamenhof-omagxota UEA: Zamenhof omaĝota]\n\nZamenhof was 12 times nominated for the Nobel Peace Prize.\n\nHis birthday, 15 December, is celebrated annually as Zamenhof Day by users of Esperanto. On 15 December 2009, Esperanto's green-starred flag flew on the Google search web page, in a commemorative Google Doodle to mark Zamenhof's 150th birthday.[https://www.google.com/doodles/150th-birthday-of-ll-zamenhof Google Doodles Archive: 150th Birthday of LL Zamenhof] Retrieved 2010-04-01.\n\nThe house of the Zamenhof family, dedicated to Ludwik Zamenhof, and the Białystok Esperanto Centre, are sites of the Jewish Heritage Trail in Białystok, which was opened in June 2008 by volunteers at The University of Białystok Foundation.[http://szlak.uwb.edu.pl/sites.html Jewish Heritage Trail in Białystok] accessed 25 July 2009.\n\nBibliography (partial)\n\nOriginal works\n\n* Unua Libro, 1887 (English: First Book)\n* Dua Libro, 1888 (Second Book)\n* Hilelismo – propono pri solvo de la hebrea demando, 1901 (Hillelism: A Project in Response to the Jewish Question)\n* Esenco kaj estonteco de la ideo de lingvo internacia, 1903 (Essence and Future of the Idea of an International Language)\n* Fundamenta Krestomatio de la Lingvo Esperanto, 1903 (Basic Anthology of the Esperanto Language)\n* Fundamento de Esperanto, 1905 (Foundation of Esperanto)\n* Declaration of Boulogne, 1905\n* Homaranismo, 1913 (Humanitism)http://homarano.narod.ru/Windows/homar_e.htm\n\nPeriodicals\n\n* La Esperantisto, 1889–1895 (The Esperantist)\n* Lingvo Internacia, 1895–1914 (International Language)\n* La Revuo, 1906–1914 (The Review)\n\nPoems\n\n* \"Al la fratoj\" (\"To the Brothers\")\n* \"La Espero\" (\"The Hope\")\n* \"Ho, mia kor'\" (\"Oh, My Heart\")\n* \"Mia penso\" (\"My Thought\")\n* \"La vojo\" (\"The Way\")\n\nTranslations\n\n* La batalo de l' vivo (The Battle of Life) by Charles Dickens\n* Ifigenio en Taŭrido (Iphigenia in Tauris) by Johann Wolfgang von Goethe\n* Hamleto, Reĝido de Danujo (Hamlet, Prince of Denmark) by William Shakespeare\n* Malnova Testamento (Old Testament) (parts)\n* Marta by Eliza Orzeszkowa\n* La Rabistoj (The Robbers) by Friedrich Schiller\n* La Revizoro (The Government Inspector) by Nikolai Gogol\n\nGallery\n\nGrób Ludwika Zamenhofa na cmentarzu żydowskim w Warszawie 2017.jpg|Grave of L. L. Zamenhof in Warsaw\nZamenhof st.jpg|Eliezer Zamenhof street in Tel Aviv: the street sign in Hebrew and Esperanto states he is the creator of the international language Esperanto\nZamenhof commemorative plaque 5 Zamenhofa Street Warsaw.JPG|Commemorative plaque at 5 Zamenhofa Street in Warsaw where the house in which Zamenhof lived and worked in 1898–1915 stood\nZamenhof Minekov.jpg|Zamenhof, relief by Ivan Minekov, Bulgaria\nUlica Ludwika Zamenhofa 26 w Białymstoku Tutaj stał dom, w którym urodził się Ludwik Zamenhof.JPG|Site of former 6 Zielona Street in Białystok, where Zamenhof was born\nZamenhof awers.jpg|Obverse of medal with Ludovic Lazarus Zamenhof by Gosławski (1959). L. L. Zamenhof. http://en.wikipedia.org/?curid=18100."
  }
}
