{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17838",
  "eid" : "2e9345a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778587386,
  "textBody" : "Grand Duchy of Luxembourg has long been a prominent supporter of European political and economic integration. In efforts foreshadowing European integration, Luxembourg and Belgium in 1921 formed the Belgium-Luxembourg Economic Union (BLEU) to create an inter-exchangeable currency and a common customs regime. Luxembourg is a member of the Benelux Economic Union and was one of the founding members of the United Nations and the European Economic Community (now the European Union). It also participates in the Schengen Group (named after the Luxembourg village where the agreements were signed), whose goal is the free movement of citizens among member states. At the same time, the majority of Luxembourgers have consistently believed that European unity makes sense only in the context of a dynamic transatlantic relationship, and thus have traditionally pursued a pro-NATO, pro-US foreign policy.\n\nLuxembourg is the site of the European Court of Justice, the European Court of Auditors, the Statistical Office of the European Communities (Eurostat) and other vital EU organs. The Secretariat of the European Parliament is located in Luxembourg, but the Parliament usually meets in nearby Strasbourg.\n\nCountries maintaining relations\n\nAustria, Belgium, China, the Czech Republic, Denmark, France, Germany, Greece, India, Italy, Japan, Malaysia, the Netherlands,  Nicaragua, Poland, Portugal, Russia, South Korea, Spain, Switzerland, the United Kingdom and the United States.\n\nEmbassies being created\n\nTurkey and the United Arab Emirates\n\nRelations by country\n\nAustralia\n\nAustralia is represented in Luxembourg through its embassy in Brussels (Belgium). Luxembourg is represented in Australia through the embassy of the Netherlands in Canberra and through an honorary consulate in East Lindfield.\n\nArmenia\n\nArmenia and Luxembourg established diplomatic ties on 11 June 1992. Armenia is represented in Luxembourg through its embassy in Brussels, (Belgium), and an honorary consulate in Luxembourg.\n\nCanada\n\n* Canada is represented in Luxembourg through its embassy in Brussels (Belgium).\n* Luxembourg is represented in Canada through its embassy in Washington, D.C. (United States), and 4 honorary consulates (in Calgary, Montreal, Toronto, and Vancouver).[http://www.luxembourg-usa.org/  Luxembourg embassy in Washington (also accredited to Canada)] \n* Both countries are full members of the Organisation for Economic Co-operation and Development, of NATO and of La Francophonie\n\nChina\n\nCzech Republic\n\n* The Czech Republic has an embassy in Luxembourg City.\n* Luxembourg has an embassy in Prague.\n* Both countries are full members of the Organisation for Economic Co-operation and Development, of the European Union and of NATO.\n* Both countries shared a common fate in the 14th century when John the Blind of Luxembourg married Eliška Přemyslovna sister of the deceased King Wenceslaus III of Bohemia and became king of Bohemia.\n\nDenmark\n\n* Denmark has an embassy in the city of Luxembourg.\n* Luxembourg has an embassy in Copenhagen.\n* Both countries are full members of the Council of Europe, the European Union, and NATO.\n\nEstonia\n\nLuxembourg recognised Estonia on February 22, 1923 and re-recognised Estonia on August 27, 1991. Both countries re-established diplomatic relations on August 29, 1991.  Estonia is represented in Luxembourg through its embassy in Brussels (Belgium) and an honorary consulate in Luxembourg.  Luxembourg is represented in Estonia through its embassy in Prague (Czech Republic).\n\nIn 1937, a prominent Estonian political leader Artur Sirk, while a fugitive in Luxembourg was found dead, having apparently committed suicide by jumping out a second-story window. Although the Luxembourg Gendarmerie report assumed suicide, because of inconsistencies in the report, the Estonian chargé d'affaires in Paris, Rudolph Mollerson was sent to investigate.  Estonian historians including PustaK. Pusta, Saddiku Paevik, Gesilingen, 1964, vol. 1 and TomingasW. Tomingas, Vaikiv Ajustu Eestis, New York, 1961 have argued that the death was an act of defenestration by agents of the first President of Estonia, Konstantin Päts.\n\nAs of December 31, 2007, foreign investments made in Estonia originating from Luxembourg totaled 225 million EUR accounting for 2% of the total volume of foreign direct investments. There are about 300 Estonians living in Luxembourg. An Estonian cultural association was founded in 1998. The Estonian President Arnold Rüütel's state visit to Luxembourg was in May 2003, prime minister Andrus Ansip's in 2006. The Luxembourg Prime Minister Jean-Claude Juncker visited Estonia in 1999 and 2007.\n\n* Trade agreement between Estonia and Belgium and Luxembourg (1935)\n* Agreement on Road Transport between Estonia, Latvia, Lithuania, Belgium, Luxembourg and the Netherlands (came into force 1.12.94)\n* Agreement Between Estonia and the Belgo-Luxembourg Economic Union on the Reciprocal Promotion and Protection of Investments (came into force 23.09.99)[http://untreaty.un.org/unts/144078_158780/17/10/8370.pdf Text of the Agreement Between Estonia and the Belgo-Luxembourg Economic Union on the Reciprocal Promotion and Protection of Investments.]\n* Agreement Between Estonia and the States of Benelux on Readmission of Persons (came into force 1.02.05)\n* Agreement on the Avoidance of Double Taxation and the Prevention of Income and Capital Tax evasion (signed 23.05.2006)\n\nFinland\n\n* Luxembourg recognised Finland's independence on October 25, 1921.\n* Luxembourg is represented in Finland through its embassy in Copenhagen.\n* Finland has an embassy and an honorary consulate general in Luxembourg.\n* [http://formin.finland.fi/public/default.aspx?nodeid17234&culture\nen-US&contentlan=2 Ministry for Foreign Affairs of Finland about relations with Luxembourg]\n\nFrance\n\n* Luxembourg was besieged by Louis XIV of France in 1684 and was annexed by Revolutionary France to be part of the Forêts département during the War of the First Coalition in 1795 until Napoleon's defeat in 1815.   \n* France has an embassy in Luxembourg.\n* Luxembourg has an embassy in Paris, a consulate general in Strasbourg, and consulates in Bordeaux, Lille, Longwy, Lyon, Marseille, and Metz.  \n* Both countries are full members of the Council of Europe, European Union, NATO, the Organization for Economic Co-operation and Development, and the Organization for Security and Co-operation in Europe.\n\nGreece\n\n* Greece has an embassy in Luxembourg.\n* Luxembourg has an embassy in Athens and 3 honorary consulates in Athens, Patras and Thessaloniki.\n* Both countries are full members of NATO and of the European Union.\n* [http://www.mfa.gr/www.mfa.gr/en-US/Policy/Geographic+Regions/Europe/Relationships+with+EU+Member+States/Luxembourg/  Greek Ministry of Foreign Affairs about relations with Luxembourg]\n* [http://www.mae.lu/mae.taf?IdNav=524 Luxembourg’s Ministry of Foreign Affairs about relations with Greece (in French only)]\n\nHungary\n\n* Hungary has an embassy in Luxembourg City.\n* Luxembourg is represented in Hungary through its embassy in Vienna (Austria).\n* Both countries are full members of the Organisation for Economic Co-operation and Development, of the European Union and of NATO.\n\nIndia\n\nIreland\n\n* Ireland has an embassy in Luxembourg City.\n* Luxembourg has an honorary consulate in Dublin.\n* Both countries are full members of the Council of Europe, of the Organisation for Economic Co-operation and Development and of the European Union.\n\nIsrael\n\nIn November 1947, Luxembourg voted in favor of the partition plan to create a Jewish state. Israel and Luxembourg established full diplomatic relations in 1949. Due to Luxembourg's small size, the Israeli embassy is located in Brussels and Luxembourg is represented politically by the Dutch embassy and economically by the Belgian embassy.\n\nItaly\n\n* Italy has an embassy in Luxembourg City.[http://www.amblussemburgo.esteri.it/Ambasciata_Lussemburgo/Menu/Informazioni_e_servizi/Servizi_consolari/Anagrafe/  Italian embassy in Luxembourg City (in French and Italian only)]\n* Luxembourg has an embassy in Rome and 9 honorary consulates (in Florence, Genoa, Milan, Naples, Palermo, Perugia, Riccione, Turin, and Venice).\n* Both countries are full members of the Organisation for Economic Co-operation and Development, of the European Union and of NATO.\n* There are around 19,000 people of Italian descent living in Luxembourg.\n\nSouth Korea\n\n*Luxembourg`s forty four soldiers has participated in the Korean war with UN forces in 1950 against North Korea and China.\n*Luxembourg and South Korea established diplomatic relations on 16 March 1962.\n*Both countries have a shipping agreement in 1987 and an air agreement in 2003.\n*Bilateral Trade in 2014.\n**Exports $572,000,000 (Ships, Chemical Products, Plastic goods). \n**Imports $39,000,000 (Measuring instrument, Non-woven fabric, Valve). \n*Bilateral investments in 2014.\n**South Korea's investment in Luxembourg was $2,824,000,000. \n**Luxembourg's investment in South Korea was $4,047,000,000.\n*High-level Exchanges. \n**1983 April Chairperson of the Advisory Council on State Affairs Choi Kyu-hah. \n**1996 October the Minister of Foreign Affairs and Trade Gong Roh-myong. \n*From Luxembourg to the South Korea.  \n**1997 September Grand Duke Henri and Minister of Economic Affairs Robert Goebbels. \n**2000 October Prime Minister Jean-Claude Juncker and the Minister of Foreign Affairs Lydie Polfer. (To attend the third ASEM meeting).\n**2001 March Hereditary Grand Duke Guillaume. \n**2004 March Minister of Economy Grethen. (Economic Mission). \n**2006 October Minister of Finance and Budget Frieden and Prince Guillaume of Luxembourg. \n**2011 April Ministry of Foreign Affairs Jean Asselborn. \n**2011 May Hereditary Grand Duke Guillaume and Minister of Economy Jeannot Krecke.\n\nKosovo\n\nLuxembourg recognized the independence of Kosovo on 21 February 2008. Luxembourg has promised to give Kosovo €30 million over the next five years. Luxembourg said that the money was mainly for focus on professional training for Pristina and Mitrovica North authorities.\n\nLithuania\n\n* Formal relations started on 1992-03-23.\n* Luxembourg did not recognise the annexation of the Baltic States by the USSR in 1940-1991 either de iure or de facto.\n* Lithuania is represented in Luxembourg through its embassy in Brussels (Belgium) and through an honorary consulate in Luxembourg City.\n* Luxembourg is represented in Lithuania through its embassy in Warsaw (Poland) and through an honorary consulate in Vilnius.\n* Both countries are full members of NATO and of the European Union.\n*[http://www.urm.lt/index.php?1420194378 Lithuanian Ministry of Foreign Affairs: list of bilateral treaties with Luxembourg]\n\nMalta\n\n*Malta is represented in Luxembourg through its embassy in Brussels (Belgium) and through an honorary consulate in Luxembourg City.\n\nRomania\n\nBoth countries established diplomatic relations on December 10, 1910. Since August 19, 1991, Romania has an embassy in Luxembourg City. Luxembourg is represented in Romania through its embassy in Athens (Greece) and two honorary consulates (in Bucharest and Sibiu).\n\nRussia\n\nLuxembourg has an embassy in Moscow and an honorary consulate in Saint Petersburg. Russia has an embassy in the city of Luxembourg.\n\nBoth countries are full members of the Council of Europe, the Organization for Security and Co-operation in Europe, and the United Nations.\n\nIn the history of bilateral relations, the first Russian president to come on an official visit to Luxembourg was Vladimir Putin on 24 May 2007. As bilateral trade had more than tripled from USD 66.6 million in 2003 to USD 228.3 million in 2006, time had come to strengthen the ties between the two countries, energy and finance being the key areas of cooperation between Russia and Luxembourg.\n\nTurkey\n\nBilateral relations between the Republic of Turkey and the Grand Duchy of Luxembourg gained momentum with the opening of a Turkish Embassy in Luxembourg in 1987.\n\nLuxembourg is represented in Turkey through its embassy in Ankara, which was opened on 29 November 2011.\n\nThere are 500 ethnic Turk's living in Luxembourg, 200 of whom have dual citizenship. The trade volume between the two States had reached $217 million in 2011.\n\nLuxembourg strongly supports Turkey's candidacy as a full European Union member.\n\nUkraine\n\n* Luxembourg is represented in Ukraine through its embassy in Prague (Czech Republic) and through an honorary consulate in Kiev.\n* Ukraine is represented in Luxembourg through its embassy in Brussels (Belgium) and through an honorary consulate in Luxembourg City.\n\nUnited States\n\nThe United States, fighting on the Allied side, contributed to Luxembourg's liberation in World War I and World War II.  More than 5,000 American soldiers, including U.S. Army General George S. Patton, are buried at the Luxembourg American Cemetery and Memorial near the capital of Luxembourg City, and there are monuments in many towns to American liberators. The strong U.S.-Luxembourg relationship is expressed both bilaterally and through common membership in NATO, the Organization for Economic Co-operation and Development (OECD), and the Organization for Security and Co-operation in Europe (OSCE).\n\nVietnam\n\nBoth countries signed diplomatic relations in 1973. Luxembourg's representation in Vietnam is through its embassy in Beijing, China.[http://www.vn.embassyinformation.com/ \"Embassy Information\"], EmabssyInformation.com, retrieved 28 April 2009. Vietnam is represented through its embassy in Brussels, Belgium.[http://imo2007.edu.vn/statics/list%20of%20embassies.htm \"List of Vietnamese Embassies and Consulates abroad\"], 48th International Mathematical Olympiad, retrieved 28 April 2009.\n\nRelations by organization\n\nNATO\n\nUnited Nations",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Luxembourg" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17838" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Grand Duchy of Luxembourg has long been a prominent supporter of European political and economic integration. In efforts foreshadowing European integration, Luxembourg and Belgium in 1921 formed the Belgium-Luxembourg Economic Union (BLEU) to create an inter-exchangeable currency and a common customs regime. Luxembourg is a member of the Benelux Economic Union and was one of the founding members of the United Nations and the European Economic Community (now the European Union). It also participates in the Schengen Group (named after the Luxembourg village where the agreements were signed), whose goal is the free movement of citizens among member states. At the same time, the majority of Luxembourgers have consistently believed that European unity makes sense only in the context of a dynamic transatlantic relationship, and thus have traditionally pursued a pro-NATO, pro-US foreign policy.\n\nLuxembourg is the site of the European Court of Justice, the European Court of Auditors, the Statistical Office of the European Communities (Eurostat) and other vital EU organs. The Secretariat of the European Parliament is located in Luxembourg, but the Parliament usually meets in nearby Strasbourg.\n\nCountries maintaining relations\n\nAustria, Belgium, China, the Czech Republic, Denmark, France, Germany, Greece, India, Italy, Japan, Malaysia, the Netherlands,  Nicaragua, Poland, Portugal, Russia, South Korea, Spain, Switzerland, the United Kingdom and the United States.\n\nEmbassies being created\n\nTurkey and the United Arab Emirates\n\nRelations by country\n\nAustralia\n\nAustralia is represented in Luxembourg through its embassy in Brussels (Belgium). Luxembourg is represented in Australia through the embassy of the Netherlands in Canberra and through an honorary consulate in East Lindfield.\n\nArmenia\n\nArmenia and Luxembourg established diplomatic ties on 11 June 1992. Armenia is represented in Luxembourg through its embassy in Brussels, (Belgium), and an honorary consulate in Luxembourg.\n\nCanada\n\n* Canada is represented in Luxembourg through its embassy in Brussels (Belgium).\n* Luxembourg is represented in Canada through its embassy in Washington, D.C. (United States), and 4 honorary consulates (in Calgary, Montreal, Toronto, and Vancouver).[http://www.luxembourg-usa.org/  Luxembourg embassy in Washington (also accredited to Canada)] \n* Both countries are full members of the Organisation for Economic Co-operation and Development, of NATO and of La Francophonie\n\nChina\n\nCzech Republic\n\n* The Czech Republic has an embassy in Luxembourg City.\n* Luxembourg has an embassy in Prague.\n* Both countries are full members of the Organisation for Economic Co-operation and Development, of the European Union and of NATO.\n* Both countries shared a common fate in the 14th century when John the Blind of Luxembourg married Eliška Přemyslovna sister of the deceased King Wenceslaus III of Bohemia and became king of Bohemia.\n\nDenmark\n\n* Denmark has an embassy in the city of Luxembourg.\n* Luxembourg has an embassy in Copenhagen.\n* Both countries are full members of the Council of Europe, the European Union, and NATO.\n\nEstonia\n\nLuxembourg recognised Estonia on February 22, 1923 and re-recognised Estonia on August 27, 1991. Both countries re-established diplomatic relations on August 29, 1991.  Estonia is represented in Luxembourg through its embassy in Brussels (Belgium) and an honorary consulate in Luxembourg.  Luxembourg is represented in Estonia through its embassy in Prague (Czech Republic).\n\nIn 1937, a prominent Estonian political leader Artur Sirk, while a fugitive in Luxembourg was found dead, having apparently committed suicide by jumping out a second-story window. Although the Luxembourg Gendarmerie report assumed suicide, because of inconsistencies in the report, the Estonian chargé d'affaires in Paris, Rudolph Mollerson was sent to investigate.  Estonian historians including PustaK. Pusta, Saddiku Paevik, Gesilingen, 1964, vol. 1 and TomingasW. Tomingas, Vaikiv Ajustu Eestis, New York, 1961 have argued that the death was an act of defenestration by agents of the first President of Estonia, Konstantin Päts.\n\nAs of December 31, 2007, foreign investments made in Estonia originating from Luxembourg totaled 225 million EUR accounting for 2% of the total volume of foreign direct investments. There are about 300 Estonians living in Luxembourg. An Estonian cultural association was founded in 1998. The Estonian President Arnold Rüütel's state visit to Luxembourg was in May 2003, prime minister Andrus Ansip's in 2006. The Luxembourg Prime Minister Jean-Claude Juncker visited Estonia in 1999 and 2007.\n\n* Trade agreement between Estonia and Belgium and Luxembourg (1935)\n* Agreement on Road Transport between Estonia, Latvia, Lithuania, Belgium, Luxembourg and the Netherlands (came into force 1.12.94)\n* Agreement Between Estonia and the Belgo-Luxembourg Economic Union on the Reciprocal Promotion and Protection of Investments (came into force 23.09.99)[http://untreaty.un.org/unts/144078_158780/17/10/8370.pdf Text of the Agreement Between Estonia and the Belgo-Luxembourg Economic Union on the Reciprocal Promotion and Protection of Investments.]\n* Agreement Between Estonia and the States of Benelux on Readmission of Persons (came into force 1.02.05)\n* Agreement on the Avoidance of Double Taxation and the Prevention of Income and Capital Tax evasion (signed 23.05.2006)\n\nFinland\n\n* Luxembourg recognised Finland's independence on October 25, 1921.\n* Luxembourg is represented in Finland through its embassy in Copenhagen.\n* Finland has an embassy and an honorary consulate general in Luxembourg.\n* [http://formin.finland.fi/public/default.aspx?nodeid17234&culture\nen-US&contentlan=2 Ministry for Foreign Affairs of Finland about relations with Luxembourg]\n\nFrance\n\n* Luxembourg was besieged by Louis XIV of France in 1684 and was annexed by Revolutionary France to be part of the Forêts département during the War of the First Coalition in 1795 until Napoleon's defeat in 1815.   \n* France has an embassy in Luxembourg.\n* Luxembourg has an embassy in Paris, a consulate general in Strasbourg, and consulates in Bordeaux, Lille, Longwy, Lyon, Marseille, and Metz.  \n* Both countries are full members of the Council of Europe, European Union, NATO, the Organization for Economic Co-operation and Development, and the Organization for Security and Co-operation in Europe.\n\nGreece\n\n* Greece has an embassy in Luxembourg.\n* Luxembourg has an embassy in Athens and 3 honorary consulates in Athens, Patras and Thessaloniki.\n* Both countries are full members of NATO and of the European Union.\n* [http://www.mfa.gr/www.mfa.gr/en-US/Policy/Geographic+Regions/Europe/Relationships+with+EU+Member+States/Luxembourg/  Greek Ministry of Foreign Affairs about relations with Luxembourg]\n* [http://www.mae.lu/mae.taf?IdNav=524 Luxembourg’s Ministry of Foreign Affairs about relations with Greece (in French only)]\n\nHungary\n\n* Hungary has an embassy in Luxembourg City.\n* Luxembourg is represented in Hungary through its embassy in Vienna (Austria).\n* Both countries are full members of the Organisation for Economic Co-operation and Development, of the European Union and of NATO.\n\nIndia\n\nIreland\n\n* Ireland has an embassy in Luxembourg City.\n* Luxembourg has an honorary consulate in Dublin.\n* Both countries are full members of the Council of Europe, of the Organisation for Economic Co-operation and Development and of the European Union.\n\nIsrael\n\nIn November 1947, Luxembourg voted in favor of the partition plan to create a Jewish state. Israel and Luxembourg established full diplomatic relations in 1949. Due to Luxembourg's small size, the Israeli embassy is located in Brussels and Luxembourg is represented politically by the Dutch embassy and economically by the Belgian embassy.\n\nItaly\n\n* Italy has an embassy in Luxembourg City.[http://www.amblussemburgo.esteri.it/Ambasciata_Lussemburgo/Menu/Informazioni_e_servizi/Servizi_consolari/Anagrafe/  Italian embassy in Luxembourg City (in French and Italian only)]\n* Luxembourg has an embassy in Rome and 9 honorary consulates (in Florence, Genoa, Milan, Naples, Palermo, Perugia, Riccione, Turin, and Venice).\n* Both countries are full members of the Organisation for Economic Co-operation and Development, of the European Union and of NATO.\n* There are around 19,000 people of Italian descent living in Luxembourg.\n\nSouth Korea\n\n*Luxembourg`s forty four soldiers has participated in the Korean war with UN forces in 1950 against North Korea and China.\n*Luxembourg and South Korea established diplomatic relations on 16 March 1962.\n*Both countries have a shipping agreement in 1987 and an air agreement in 2003.\n*Bilateral Trade in 2014.\n**Exports $572,000,000 (Ships, Chemical Products, Plastic goods). \n**Imports $39,000,000 (Measuring instrument, Non-woven fabric, Valve). \n*Bilateral investments in 2014.\n**South Korea's investment in Luxembourg was $2,824,000,000. \n**Luxembourg's investment in South Korea was $4,047,000,000.\n*High-level Exchanges. \n**1983 April Chairperson of the Advisory Council on State Affairs Choi Kyu-hah. \n**1996 October the Minister of Foreign Affairs and Trade Gong Roh-myong. \n*From Luxembourg to the South Korea.  \n**1997 September Grand Duke Henri and Minister of Economic Affairs Robert Goebbels. \n**2000 October Prime Minister Jean-Claude Juncker and the Minister of Foreign Affairs Lydie Polfer. (To attend the third ASEM meeting).\n**2001 March Hereditary Grand Duke Guillaume. \n**2004 March Minister of Economy Grethen. (Economic Mission). \n**2006 October Minister of Finance and Budget Frieden and Prince Guillaume of Luxembourg. \n**2011 April Ministry of Foreign Affairs Jean Asselborn. \n**2011 May Hereditary Grand Duke Guillaume and Minister of Economy Jeannot Krecke.\n\nKosovo\n\nLuxembourg recognized the independence of Kosovo on 21 February 2008. Luxembourg has promised to give Kosovo €30 million over the next five years. Luxembourg said that the money was mainly for focus on professional training for Pristina and Mitrovica North authorities.\n\nLithuania\n\n* Formal relations started on 1992-03-23.\n* Luxembourg did not recognise the annexation of the Baltic States by the USSR in 1940-1991 either de iure or de facto.\n* Lithuania is represented in Luxembourg through its embassy in Brussels (Belgium) and through an honorary consulate in Luxembourg City.\n* Luxembourg is represented in Lithuania through its embassy in Warsaw (Poland) and through an honorary consulate in Vilnius.\n* Both countries are full members of NATO and of the European Union.\n*[http://www.urm.lt/index.php?1420194378 Lithuanian Ministry of Foreign Affairs: list of bilateral treaties with Luxembourg]\n\nMalta\n\n*Malta is represented in Luxembourg through its embassy in Brussels (Belgium) and through an honorary consulate in Luxembourg City.\n\nRomania\n\nBoth countries established diplomatic relations on December 10, 1910. Since August 19, 1991, Romania has an embassy in Luxembourg City. Luxembourg is represented in Romania through its embassy in Athens (Greece) and two honorary consulates (in Bucharest and Sibiu).\n\nRussia\n\nLuxembourg has an embassy in Moscow and an honorary consulate in Saint Petersburg. Russia has an embassy in the city of Luxembourg.\n\nBoth countries are full members of the Council of Europe, the Organization for Security and Co-operation in Europe, and the United Nations.\n\nIn the history of bilateral relations, the first Russian president to come on an official visit to Luxembourg was Vladimir Putin on 24 May 2007. As bilateral trade had more than tripled from USD 66.6 million in 2003 to USD 228.3 million in 2006, time had come to strengthen the ties between the two countries, energy and finance being the key areas of cooperation between Russia and Luxembourg.\n\nTurkey\n\nBilateral relations between the Republic of Turkey and the Grand Duchy of Luxembourg gained momentum with the opening of a Turkish Embassy in Luxembourg in 1987.\n\nLuxembourg is represented in Turkey through its embassy in Ankara, which was opened on 29 November 2011.\n\nThere are 500 ethnic Turk's living in Luxembourg, 200 of whom have dual citizenship. The trade volume between the two States had reached $217 million in 2011.\n\nLuxembourg strongly supports Turkey's candidacy as a full European Union member.\n\nUkraine\n\n* Luxembourg is represented in Ukraine through its embassy in Prague (Czech Republic) and through an honorary consulate in Kiev.\n* Ukraine is represented in Luxembourg through its embassy in Brussels (Belgium) and through an honorary consulate in Luxembourg City.\n\nUnited States\n\nThe United States, fighting on the Allied side, contributed to Luxembourg's liberation in World War I and World War II.  More than 5,000 American soldiers, including U.S. Army General George S. Patton, are buried at the Luxembourg American Cemetery and Memorial near the capital of Luxembourg City, and there are monuments in many towns to American liberators. The strong U.S.-Luxembourg relationship is expressed both bilaterally and through common membership in NATO, the Organization for Economic Co-operation and Development (OECD), and the Organization for Security and Co-operation in Europe (OSCE).\n\nVietnam\n\nBoth countries signed diplomatic relations in 1973. Luxembourg's representation in Vietnam is through its embassy in Beijing, China.[http://www.vn.embassyinformation.com/ \"Embassy Information\"], EmabssyInformation.com, retrieved 28 April 2009. Vietnam is represented through its embassy in Brussels, Belgium.[http://imo2007.edu.vn/statics/list%20of%20embassies.htm \"List of Vietnamese Embassies and Consulates abroad\"], 48th International Mathematical Olympiad, retrieved 28 April 2009.\n\nRelations by organization\n\nNATO\n\nUnited Nations. Foreign relations of Luxembourg. http://en.wikipedia.org/?curid=17838."
  }
}
