{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6251",
  "eid" : "da9ef660-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778446534,
  "textBody" : "Professional certification, trade certification, or professional designation, often called simply certification or qualification, is a designation earned by a person to assure qualification to perform a job or task. Not all certifications that use post-nominal letters are an acknowledgement of educational achievement, or an agency appointed to safeguard the public interest.\n\nOverview\n\nA certification is a third-party attestation of an individual's level of knowledge or proficiency in a certain industry or profession. They are granted by authorities in the field, such as professional societies and universities, or by private certificate-granting agencies. Most certifications are time-limited; some expire after a period of time (e.g., the lifetime of a product that required certification for use), while others can be renewed indefinitely as long as certain requirements are met. Renewal usually requires ongoing education to remain up-to-date on advancements in the field, evidenced by earning the specified number of continuing education credits (CECs), or continuing education units (CEUs), from approved professional development courses.\n\nMany certification programs are affiliated with professional associations, trade organizations, or private vendors interested in raising industry standards. Certificate programs are often created or endorsed by professional associations, but are typically completely independent from membership organizations. Certifications are very common in fields such as aviation, construction, technology, environment, and other industrial sectors, as well as healthcare, business, real estate, and finance.\n \nAccording to The Guide to National Professional Certification Programs (1997) by Phillip Barnhart, \"certifications are portable, since they do not depend on one company's definition of a certain job\" and they provide protential employers with \"an impartial, third-party endorsement of an individual's professional knowledge and experience\".Phillip Barnhart, [https://books.google.com/books?id3tY8Fck5UVkC&lpg\nPP1&dqthe%20guide%20to%20national%20professional%20certification%20programs&pg\nPA2 The Guide to National Professional Certification Programs] (1997), HRD Press.  Retrieved electronically 7 July 2009.\n\nCertification is different from professional licensure. In the United States, licenses are typically issued by state agencies, whereas certifications are usually awarded by professional societies or educational institutes. Obtaining a certificate is voluntary in some fields, but in others, certification from a government-accredited agency may be legally required to perform certain jobs or tasks. In other countries, licenses are typically granted by professional societies or universities and require a certificate after about three to five years and so on thereafter. The assessment process for certification may be more comprehensive than that of licensure, though sometimes the assessment process is very similar or even the same, despite differing in terms of legal status.\n\nThe American National Standards Institute (ANSI) defines the standard for being a certifying agency as meeting the following two requirements:\n# Delivering an assessment based on industry knowledge that is independent from training courses or course providers\n# Granting a time-limited credential to anyone who meets the assessment standards\n\nThe Institute for Credentialing Excellence (ICE) is a U.S.-based organization that sets standards for the accreditation of personnel certification and certificate programs based on the Standards for Educational and Psychological Testing, a joint publication of the American Educational Research Association (AERA), the American Psychological Association (APA), and the National Council on Measurement in Education (NCME). Many members of the Association of Test Publishers (ATP) are also certification organizations.\n\nTypes of certifications\n\nThere are three general types of certification. Listed in order of development level and portability, they are: corporate (internal), product-specific, and profession-wide.\n\nCorporate, or \"internal\" certifications, are made by a corporation or low-stakes organization for internal purposes. For example, a corporation might require a one-day training course for all sales personnel, after which they receive a certificate. While this certificate has limited portability – to other corporations, for example – it is the most simple to develop.\n\nProduct-specific certifications are more involved, and are intended to be referenced to a product across all applications. This approach is very prevalent in the information technology (IT) industry, where personnel are certified on a version of software or hardware. This type of certification is portable across locations (for example, different corporations that use that software), but not across other products. Another example could be the certifications issued for shipping personnel, which are under international standards even for the recognition of the certification body, under the International Maritime Organization (IMO).\n\nThe most general type of certification is profession-wide. Certification in the medical profession is often offered by particular specialties. In order to apply professional standards, increase the level of practice, and protect the public, a professional organization might establish a certification. This is intended to be portable to all places a certified professional might work. Of course, this generalization increases the cost of such a program; the process to establish a legally defensible assessment of an entire profession is very extensive. An example of this is a Certified Public Accountant (CPA), which would not be certified for just one corporation or one piece of accountancy software but for general work in the profession.\n\nProfessional certificates awarded by universities\n\nMany universities grant professional certificates as an award for the completion of an educational program. The curriculum of a professional certificate is most often in a focused subject matter. Many professional certificates have the same curriculum as master's degrees in the same subject. Many other professional certificates offer the same courses as master's degrees in the same subject, but require the student to take fewer total courses to complete the program. Some professional certificates have a curriculum that more closely resembles a baccalaureate major in the same field.  The typical professional certificate program is between 200–300 class-hours in size. It is uncommon for a program to be larger or smaller than that. Most professional certificate programs are open enrollment, but some have admissions processes. A few universities put some of their professional certificates into a subclass they refer to as advanced professional certificates.\n\nSome of the more commonly offered professional certificates include:\n* Professional Certificate in Accounting (PCA)\n* Professional Certificate in Contract Management (PCCM)\n* Professional Certificate in Customer Relationship Management (PCCRM)\n* Professional Certificate in Facility Management (PCFM)\n* Professional Certificate in Financial Planning (PCFP)\n* Professional Certificate in Graphic Design (PCGD)\n* Professional Certificate in Human Resources (PCHR)\n* Professional Certificate in Marketing (PCM)\n* Professional Certificate in Paralegal Studies (PCPS)\n* Professional Certificate in Project Management (PCPM)\n* Professional Certificate in Supply Chain Management (PCSCM)\n* Professional Certificate in Store Management (PCSM)\n* Professional Certificate in Materials Management (PCMM)\n* Professional Certificate in Technical Communication (PCTC)\n\nAdvanced professional certificate\n\nAdvanced professional certificates are professional credentials designed to help professionals enhance their job performance and marketability in their respective fields. In many other countries, certificates are qualifications in higher education. In the United States, a certificate may be offered by an institute of higher education. These certificates usually signify that a student has reached a standard of knowledge of a certain vocational subject. Certificate programs can be completed more quickly than associate degrees and often do not have general education requirements.\n\nAn advanced professional certificate is a result of an educational process designed for individuals. Certificates are designed for both newcomers to the industry as well as seasoned professionals. Certificates are awarded by an educational program or academic institution. Completion of a certificate program indicates completion of a course or series of courses with a specific concentration that is different from an educational degree program. Course content for an advanced certificate is set forth through a variety of sources i.e. faculty, committee, instructors, and other subject matter experts in a related field. The end goal of an advanced professional certificate is so that professionals may demonstrate knowledge of course content at the end of a set period in time.\n\nInstitutions that offer advance professional certificates in various fields and industries include:\n*Georgetown University\n*Lesley University\n*New York University\n*St. John's University\n*Stanford University\n*University of San Francisco\n\nAreas of certification\n\nAccountancy, auditing and finance\n\nThere are many professional bodies for accountants and auditors throughout the world; some of them are legally recognized in their jurisdictions.\nPublic accountants are the accountancy and control experts that are legally certified in different jurisdictions to work in public practices, certifying accounts as statutory auditors, eventually selling advice and services to other individuals and businesses. Today, however, many work within private corporations, financial industry, and government bodies.\n\nAccounting and external auditing \n\nCf. Accountancy qualifications and regulation\n* CA (Chartered Accountant) conferred by Institutes of Chartered Accountants in Nepal.\n* ACA, FCA or CA (Chartered Accountant) conferred by Institutes of Chartered Accountants in various territories, namely the United Kingdom of Great Britain and Northern Ireland and the Republic of Ireland.\n* ACMA or FCMA (Associate or Fellow Chartered Management Accountant) conferred by the Chartered Institute of Management Accountants (UK)\n* Associate or Fellow Chartered Certified Accountant (ACCA or FCCA) conferred by Association of Chartered Certified Accountants (UK)\n* AFA or FFA (Associate or Fellow Incorporated Financial Accountant) conferred by the Institute of Financial Accountants (UK)\n* AAIA or FAIA (Associate or Fellow International Accountant) conferred by Association of International Accountants\n* MIPA or FIPA (Member or Fellow of the Institute of Public Accountants who use the designation \"Public Accountant\") conferred by the Institute of Public Accountants (Australia)\n* CPA (Certified Public Accountant) conferred by State Accountancy Boards in the USA, Hong-Kong, Australia...\n* CMA (Certified Management Accountant) conferred by Institute of Certified Management Accountants (ICMA in Australia), Institute of Management Accountants (IMA in US)\n* CCC (Chartered Cost Controllers) issued and conferred by the American Academy of Financial Management USA Certifying Board (AAFM)[http://www.investopedia.com/terms/a/american-academy-of-financial-management.asp AAFM], Investopedia Dictionary.\n\nInternal auditing and fraud combat \n\n* CIA (Certified Internal Auditor), CCSA;Certification in Control Self Assessment,CGAP;Certified Government Auditing Professional'CRMA;Certification in risk Management Assurance' QIAL Qualification in Internal Audit Leadership conferred by the worldwide recognised Institute of Internal Auditors (IIA) headquartered in Altamonte Springs Florida with chapters in many countries\n* CFE (Certified Fraud Examiner) conferred by the Association of Certified Fraud Examiners (ACFE) headquartered in Texas with chapters in many countries\n* CISA (Certified Information Systems Auditor) awarded by the Information Systems Audit and Control Association headquartered in the USA with chapters in many countries\n\nFinance \n\nInvestments \n\n* ASA (Accredited Senior Appraiser), AM (Accredited Member), and CEIV (Certified in Entity and Intangible Valuations) conferred by the American Society of Appraisers, CBV (Chartered Business Valuator) from Canadian Institute of Chartered Business Valuators.\n* CAIA (Chartered Alternative Investment Analyst) conferred by the CAIA Association\n* CFA (Chartered Financial Analyst) conferred by CFA Institute (CFAI)\n* CIIA (Certified International Investment Analyst) conferred by the Association of Certified International Investment Analysts (ACIIA)\n* PRM (Professional Risk Manager) conferred by Professional Risk Managers International (PRM)\n\nPersonal finance \n\n* CFP (Certified Financial Planner) conferred by Certified Financial Planner Board of Standards and Financial Planning Standards Board\n* CCP (Certified Credit Professional) issued to credit management professionals in Canada by the Credit Institute of Canada\n* EA (Enrolled Agent) by the Internal Revenue Service (IRS)\n\nPublic finance \n\n* CCMT (Certified California Municipal Treasurer) conferred by California Municipal Treasurers Association (CMTA)\n* CGAP (Certified Government Auditing Professional) conferred by the Institute of Internal Auditors, based on the US Government Auditing Standards (Yellow Book) and additionally on COSO, IIA standards and INTOSAI ISSAI standards recognized worldwide in public finance\n* CDFM (Certified Defense Financial Manager) conferred by American Society of Military Comptrollers (ASMC)\n* CFO (Certified Financial Officer) conferred by the Carl Vinson Institute of Government of the University of Georgia\n* CGFM (Certified Government Financial Manager) conferred by Association of Government Accountants (AGA)\n* CGAT (Certified Governmental Accounting Technician[http://www.gfoaa.org/cgatcert.html Certified Governmental Accounting Technician]), conferred by Government Finance Officers Association of Alabama\n* CGFO (Certified Government Finance Officer) conferred by Government Finance Officers Association of Texas (GFOAT)\n* CGFO (Certified Government Finance Officer), conferred by Florida Government Finance Officers Association (FGFOA)\n* CGFO (Certified Government Finance Officer) conferred by Louisiana Government Finance Officers Association\n* CMFO (Certified Municipal Finance Officer) conferred by Government Finance Officers of New Jersey, Rutgers University, and the State of New Jersey\n* CMFO (Certified Municipal Finance Officer) conferred by Tennessee Comptroller of the Treasury and the Municipal Technical Advisory Service\n* CPFO (Certified Public Finance Officer) conferred by Government Finance Officers Association\n* CPFA (Certified Public Finance Administrator) conferred by Association of Public Treasurers of the United States and Canada (APTUSC)\n* GFO (Government Finance Officer) conferred by Government Finance Officers Association of South Carolina (GFOASC)\n* North Carolina Local Governmental Finance Officer conferred by North Carolina Government Finance Officers Association and the North Carolina Association of County Finance Officers\n\nArchitecture\n\n* AIA (Member, American Institute of Architects) conferred by American Institute of Architects\n* FAIA (Fellow, American Institute of Architects) conferred by American Institute of Architects\n\nArchival Science, Information Privacy, and Records Management\n\n* CIP (Certified Information Professional) conferred by AIIM\n* CIPM (Certified Information Privacy Manager) conferred by International Association of Privacy Professionals\n* CIPP (Certified Information Privacy Professional) conferred by International Association of Privacy Professionals\n* CIPT (Certified Information Privacy Technologist) conferred by International Association of Privacy Professionals\n* CRA (Certified Records Analyst) conferred by Institute of Certified Records Managers\n* CRM (Certified Records Manager) conferred by Institute of Certified Records Managers\n* IGP (Information Governance Professional) conferred by ARMA International\n\nAviation\n\nAviators are certified through theoretical and in-flight examinations. Requirements for certifications are quite equal in most countries and are regulated by each National Aviation Authority. The existing certificates or pilot licenses are:\n* SPL (Sport Pilot License)conferred by the FAA (Federal Aviation Administration)\n* PPL (Private Pilot License) conferred by the FAA (Federal Aviation Administration) or JAA (Joint Aviation Authorities)\n* CPL (Commercial Pilot Licence) conferred by the FAA (Federal Aviation Administration) or JAA (Joint Aviation Authorities)\n* ATP (Airline Transport Pilot) conferred by the FAA (Federal Aviation Administration) or JAA (Joint Aviation Authorities)\n\nLicensing in these categories require not only examinations but also a minimum number of flight hours. All categories are available for Fixed-Wing Aircraft (airplanes) and Rotatory-Wing Aircraft (helicopters). Within each category, aviators may also obtain certifications in:\n* Instrument Flight Rules (IFR)\n* Multi-engine aircraft\n* Turbojet Engines\n* Jet Engines\n* Experimental aircraft\n* Amphibious aircraft\n* Seaplanes\nUsually, aviators must be certified also in their log books for the type and model of aircraft they are allowed to fly. Currency checks as well as regular medical check-ups with a frequency of 6 months, 12 months, or 36 months, depending on the type of flying permitted, are obligatory. An aviator can fly only if holding:\n* A valid pilot license\n* A valid medical certificate\n* Valid certifications for the type of aircraft and type of flight.\n\nIn Europe, the ANSP, ATCO & ANSP technicians are certified according to ESARRs [http://www.eurocontrol.int/src/public/standard_page/src_deliverables.html] (according to EU regulation 2096/2005 \"Common Requirements\").\n\nBiomedical\n\n* BMD (Biomedical Electronics Technician) conferred by Electronics Technicians Association\n* BIET (Biomedical Imaging Electronics Technician) conferred by Electronics Technicians Association\n\nBusiness\n\nChiropractic\n\nCommunications\n\nIn the United States, several communications certifications are conferred by the Electronics Technicians Association.\n\nComputer technology\n\nCertification is often used in the professions of software engineering and information technology.\n\n* CITP (Chartered IT Professional) conferred by British Computer Society, The Institution of Engineering and Technology and by other professional engineering institutions in the UK and commonwealth\n\nContract Management\n\nDance \n\nConferred by the International Dance Council CID at UNESCO, the International Certification of Dance Studies is awarded to students who have completed 150 hours of classes in a specific form of dance for Level 1. Another 150 hours are required for Level 2 and so on till Level 10. This is the only international certification for dance since the International Dance Council CID is the official body for all forms of dance; it is usually given in addition to local or national certificates, that is why it is colloquially called \"the dancer's passport\". Students cannot apply for this certification directly – they have to ask their school to apply on their behalf. This certification is awarded free of charge, there is no cost other than membership fees.\n\nInternational Dance Council CID at UNESCO administers the International Certification of Dance Studies.\n\nDentistry\n\nElectronics \n\nIn the United States, several electronics certifications are provided by the Electronics Technicians Association.\n\nEmergency management\n\nThe Federal Emergency Management Agency's EMI offers credentials and training opportunities for United States citizens. Students do not have to be employed by FEMA or be federal employees for some of the programs.\n* Executive Fire Officer Program (EFOP)  \n* Emergency Management Professional Program (EMPP)  \n* Master Exercise Practitioner Program (MEPP)  \n* Integrated Emergency Management Courses (IEMC)   \n* Disaster Field Training Operations (DFTO)   \n* Master Trainer Program (MTP)\n* Critical Infrastructure Security and Resilience \n* Virtual Table Top Exercise (VTTX) Series\n* Continuity Excellence Series, Level I and II\n* Professional Development Series (PDS) Credential\n* Advance Professional Series (APS) Credential\n\nEngineering\n\nProfessional engineering is any act of planning, designing, composing, measuring, evaluating, inspecting, advising, reporting, directing or supervising, or managing any of the foregoing, that requires the application of engineering principles and that concerns the safeguarding of life, health, property, economic interests, the public interest or the environment.\n* P.Eng. (Professional Engineer), conferred by provincial licensing bodies in Canada.\n* Ir. or P.Eng. (Professional Engineer), conferred by Board of Engineers Malaysia (BEM) in Malaysia.\n* PE (Professional Engineer), conferred by Pakistan Engineering Council (PEC) and state licensing bodies in the United States.\n* PE (Power Engineer), conferred by Safety Authority in Canada\n* EUR ING (European Engineer), conferred by the European Federation of National Engineering Associations (FEANI).\n* C.Eng. (Chartered Engineer), conferred by professional engineering institutions in the UK and commonwealth\n* SMIEEE (Senior member of the IEEE), a professional designation throughout all of the United States\n\nFacility Management\n\nFacility management can be defined as an aspect of engineering management science that deals with the planning, designing, coordination of space and maintenance of a built environment to enhance quality service management system. Service Quality System includes activities like security, maintenance, catering, and external as well as internal cleaning. In general, it is also the coordination and harmonization of various specialist disciplines to create the best possible working environment for staff.\n\nFacility management is an interdisciplinary field devoted to the coordination of space, infrastructure, people and organization, often associated with the administration of office blocks, arenas, schools, convention centers, shopping complexes, hospitals, hotels, etc. However, FM facilitates on a wider range of activities than just business services and these are referred to as non-core functions.\n\nWarehousing management\n\nA warehouse management system (WMS) is a part of the supply chain and primarily aims to control the movement and storage of materials within a warehouse and process the associated transactions, including shipping, receiving, putaway and picking. The systems also direct and optimize stock putaway based on real-time information about the status of bin utilization. A WMS monitors the progress of products through the warehouse. It involves the physical warehouse infrastructure, tracking systems, and communication between product stations.\n\nMore precisely, warehouse management involves the receipt, storage and movement of goods, (normally finished goods), to intermediate storage locations or to a final customer. In the multi-echelon model for distribution, there may be multiple levels of warehouses. This includes a central warehouse, a regional warehouses (serviced by the central warehouse) and potentially retail warehouses (serviced by the regional warehouses).\n\nEnvironment\n\n* CEnvP – Certified Environmental Practitioner of Australia and New Zealand (CEnvP)\n\nEnvironmental health\n\n* CPHI(C) – Certified Public Health Inspector (Canada)\n\nExplosive atmospheres\n\nIECEx covers the highly specialized field of explosion protection associated with the use of equipment in areas where flammable gases, liquids and combustible dusts may be present. This system provides the assurance that equipment is manufactured to meet safety standards, and that services such as installation, repair and overhaul also comply with IEC International Standards on safety. The United Nations, via UNECE (United Nations Economic Commission for Europe), recommends the IEC and IECEx as the world’s best practice model for the verification of conformity to International Standards. It published a “Common Regulatory Framework” encompassing the use of IEC International Standards developed by IEC TC (Technical Committee) 31: Equipment for explosive atmospheres, with proof of compliance demonstrated by IECEx.\n\nFiber optics and data cabling\n\n* RCDD (Registered Communications Distribution Designer) by BICSI\n* DCI (Data Cabling Installer) conferred by Electronics Technicians Association\n* FOI (Fiber Optics Installer) conferred by Electronics Technicians Association\n* FOT (Fiber Optics Technician) conferred by Electronics Technicians Association\n* FOT-OSP (Fiber Optics Technician-Outside Plant) conferred by Electronics Technicians Association\n* FOD (Fiber Optics Designer) conferred by Electronics Technicians Association\n* TTT (Termination and Testing Technician) conferred by Electronics Technicians Association\n\nGenealogy\n\nAG (Accredited Genealogist) conferred by the International Commission for the Accreditation of Professional Genealogists (ICAPGen).\nCG (Certified Genealogist) conferred by the Board for Certification of Genealogists (BCG).\nCGL (Certified Genealogical Lecturer) conferred by the Board for Certification of Genealogists (BCG).\n\nHealth leadership\n\n* CHE (Certified Health Executive) conferred by the Canadian College of Health Leaders (CCHL)\n\nHospitality and tourism\n\n* CHA (Certified Hotel Administrator) conferred by American Hotel & Lodging Association\n* CMP (Certified Meeting Professional) conferred by Convention Industry Council\n* CEM (Certified in Exhibition Management) conferred by International Association of Exhibitions and Events \n\nInformation quality\n\n* CDMP (Certified Data Management Professional) by the International Data Management Association.\n\nInsurance and risk management\n\nIn the United States, insurance professionals are licensed separately by each state. Many individuals seek one or more certifications to distinguish themselves from their peers. The most recognizable certifications are issued by five organizations:\n* American Institute For Chartered Property Casualty Underwriters (AICPCU)\n** Chartered Property Casualty Underwriter (CPCU)\n** Associate in Risk Management (ARM)\n** Associate in Commercial Underwriting (AU)\n** Accredited Adviser in Insurance (AAI)\n** Certified Authority on Workers' Compensation (CAWC)\n* American College of Financial Services\n** Chartered Life Underwriter (CLU)\n** Chartered Financial Consultant (ChFC)\n* International Center for Captive Insurance Education (ICCIE)\n** Associate in Captive Insurance (ACI)\n** Certificate in Captive Insurance (CCI)\n* National Alliance for Insurance Education & Research\n** Certified Insurance Counselor (CIC)\n** Certified Risk Manager (CRM)\n** Certified Insurance Service Representative (CISR)\n* National Association of Insurance and Financial Advisors in partnership with the College of Financial Planning\n** Life Underwriter Training Council Fellow (LUTCF)\n\nNational Association of Mutual Insurance Companies\n* Farm Mutual Director Certification (FMDC)\n* Professional Farm Mutual Manager (PFMM)\n\nNational Registry of Workers' Compensation Specialists\n* Registered Workers' Compensation Specialist (RWCS)\n\nProfessional Liability Underwriting Society (PLUS)\n* Registered Professional Liability Underwriter (RPLU)\n* Certified Risk Analyst (CRA) \n\nLanguage education\n\nTESOL is a large field of employment with widely varying degrees of regulation. Most provision worldwide is through the state school system of each individual country, and as such, the instructors tend to be trained primary- or secondary school teachers who are native speakers of the language of their pupils, and not of English. Though native speakers of English have been working in non-English speaking countries in this capacity for years, it was not until the last twenty-five years or so that there was any widespread focus on training particularly for this field. Previously, workers in this sort of job were anyone from backpackers hoping to earn some extra travel money to well-educated professionals in other fields doing volunteer work, or retired people. These sort of people are certainly still to be found, but there are many who consider TESOL their main profession.\n\nOne of the problems facing these full-time teachers is the absence of an international governing body for the certification or licensure of English language teachers. However, Cambridge University and its subsidiary body UCLES are pioneers in trying to get some degree of accountability and quality control to consumers of English courses, through their CELTA and DELTA programs. Trinity College London has equivalent programs, the CertTESOL and the LTCL DipTESOL. They offer initial certificates in teaching, in which candidates are trained in language awareness and classroom techniques, and given a chance to practice teaching, after which feedback is reported. Both institutions have as a follow-up a professional diploma, usually taken after a year or two in the field. Although the initial certificate is available to anyone with a high school education, the diploma is meant to be a post-graduate qualification and in fact can be incorporated into a master's degree program.\n\nLegal affairs\n\nAn increasing number of attorneys are choosing to be recognized as having special expertise in certain fields of law. According to the American Bar Association, a lawyer who is a certified specialist has been recognized by an independent professional certifying organization as having an enhanced level of skill and expertise, as well as substantial involvement in an established legal specialty. These organizations require a lawyer to demonstrate special training, experience and knowledge to ensure that the lawyer's recognition is meaningful and reliable. Lawyer conduct with regard to specialty certification is regulated by the states.\n\nNBLSC is an American Bar Association (ABA) accredited organization providing Board Certification for US Lawyers. Board Certification is a rigorous testing and approval process that officially recognizes the extensive education and courtroom experience of attorneys. NBLSC provides Board Certification for Trial Lawyers & Trial Attorneys, Civil Lawyers, Criminal Lawyers, Family Lawyers and Social Security Disability Lawyers.\n\nLogistics and transport\n\nLogistician is the profession in the logistics and transport sectors, including sea, air, land and rail modes. Professional qualification for logisticians usually carries post-nominal letters. Common examples include:\n* CPIM (Certified in Production and Inventory Management) conferred by APICS (Association for Operations Management)\n* CSCP (Certified Supply Chain Professional) conferred by APICS (Association for Operations Management)\n* CLTD (Certified in Logistics, Transportation and Distribution) conferred by APICS (Association for Operations Management)\n* SCOR-P (Supply Chain Operations Reference Professional) conferred by APICS (Association for Operations Management)\n* MILT (Member Institute of Logistics and Transport) conferred by The Chartered Institute of Logistics and Transport (CILT),\n* CMILT (Chartered Member, Institute of Logistics and Transport) conferred by The Chartered Institute of Logistics and Transport (CILT)\n* FCILT (Chartered Fellow, Institute of Logistics and Transport) conferred by The Chartered Institute of Logistics and Transport (CILT)\n* CPL/CTP conferred by Transport & Logistics Certification Council (TLCC) of Australia,\n* EJLog/ESLog/EMLog conferred by the European Logistics Association (ELA),\n* CML/CPL conferred by the International Society of Logistics (SOLE),\n* JrLog/Log/SrLog conferred by the China Federation of Logistics & Purchasing (CFLP),\n* FHKLA/PMHKLA conferred by the Hong Kong Logistics Association (HKLA),\nCanadian Society of Customs Brokers American. (CSCB),\n* CCLP (CITT-Certified Logistics Professional) conferred by the Canadian Institute of Traffic & Transportation (CITT),\n* PLog (Professional Logistician) conferred by the Canadian Professional Logistics Institute,\n* ACCL-AMI / ACCL-AMO / ACCL-ABM / ACCL-OBM conferred by the Allied Council for Commerce and Logistics (ACCL)\n* CPLCM, Certified Professional Logistics & Cargo Mediator, conferred and accredited by Academy of Professional Certification (APC)\n* CPCRM, Certified Professional in Cargo Risk Management & Mediation, conferred and accredited by Academy of Professional Certification (APC)\n\nMarketing\n\n* CME (Certified Marketing Executive), conferred by Sales & Marketing Executives International, Inc..\n\nMediation\n\n* CM, Certified Mediator or Court-Appointed Mediator, conferred and accredited by The Institute of Conflict Resolution and Communication (ICRC) and the Florida Supreme Court Certified County Court Training Program pursuant to the Florida Rules for Certified and Court-Appointed Mediators 10.100 (a).\n* ECM, Executive Certificate in Mediation, conferred and accredited by Academy of Professional Certification (APC)\n* PCM, Professional Certification in Mediation, conferred and accredited by Academy of Professional Certification (APC)\n* APCM, Advanced Professional Certification in Mediation, conferred and accredited by Academy of Professional Certification (APC)\n* CPMT, Certified Professional Mediation Trainer, conferred and accredited by Academy of Professional Certification (APC)\n* CPACM, Certified Professional Art & Cultural Mediator, conferred and accredited by Academy of Professional Certification (APC)\n* CPM, Certified Professional Mediator, conferred and mutually accredited by The Institute of Crisis & Risk Management (ICRM) or Academy of Professional Certification (APC)\n* PDCoM, Professional Diploma in Corporate Mediation, conferred and mutually accredited by The Institute of Crisis & Risk Management (ICRM) or Academy of Professional Certification (APC), with Hong Kong Productivity Council (HKPC)\n* CMA, Certified Mediation Assessor, conferred and mutually accredited by The Institute of Crisis & Risk Management (ICRM) or Academy of Professional Certification (APC)\n\nMinisters\n\nChurches have their own process of who may use various religious titles. Protestant churches typically require a Masters of Divinity, accreditation by the denomination and ordination by the local church in order for a minister to become a \"Reverend\". Those qualifications may or may not also give government authorization to solemnize marriages\n\nMedicine\n\nBoard certification is the process by which a physician in the United States documents by written, practical or computer based testing, illustrating a mastery of knowledge and skills that define a particular area of medical specialization. The American Board of Medical Specialties, a not-for-profit organization, assists 24 approved medical specialty boards in the development and use of standards in the ongoing evaluation and certification of physicians.\n\nMedical specialty certification in the United States is a voluntary process. While medical licensure sets the minimum competency requirements to diagnose and treat patients, it is not specialty specific.[http://www.abms.org/about_board_certification/means.aspx What Board Certification Means]. Abms.org. Retrieved on 5 October 2013. Board certification demonstrates a physician’s exceptional expertise in a particular specialty or sub-specialty of medical practice.\n\nPatients, physicians, health care providers, insurers and quality organizations regard certification as an important measure of a physician’s knowledge, experience and skills to provide quality health care within a given specialty.\n\nOther professional certifications include certifications such as medical licenses, Membership of the Royal College of Physicians, Fellowship of the Royal College of Physicians and Surgeons of Canada, nursing board certification, diplomas in social work. The Commission for Certification in Geriatric Pharmacy certifies pharmacists that are knowledgeable about principles of geriatric pharmacotherapy and the provision of pharmaceutical care to the elderly. Additional certifying bodies relating to the medical field include:\n* Royal Australian and New Zealand College of Radiologists\n* American College of Emergency Physicians\n* Royal Australasian College of Physicians\n* Fellowship of the Royal College of Surgeons\n* Membership of the College of Emergency Medicine\n* Joint Commission on Allied Health Personnel in Ophthalmology\n* American Registry for Diagnostic Medical Sonography\n\nMedical coding and billing\n\n* AHIMA (American Health Information Management Association)\n* AAPC \n* Medical Association of Billers \n\nPeer support\n\nNCPRP stands for “National Certified Peer Recovery Professional”, and the NCPRP credential and exam were developed in collaboration with the International Certification Board of Recovery Professionals (ICBRP) and is currently being administered by PARfessionals.\n\nPARfessionals is a professional organization and all of the available courses are professional development and pre-certification courses.\n\nThe NCPRP credential and exam focus primarily on the concept of peer recovery through mental health and addiction recovery. It has the main purpose of training student-candidates on how to become peer recovery professionals who can provide guidance, knowledge or assistance for individuals who have had similar experiences.\n\nThrough the support of the SJM Family Foundation, PARfessionals has developed the first globally recognized online training program for peer recovery professionals.\n\nEach student-candidate must complete several key steps which include initial registration; the pre-certification review course; and all applicable sections of the official application in order to become eligible to complete the final step, which is the NCPRP certification exam.\n\nThe NCPRP credential is obtained once a participant successfully passes the NCPRP certification exam by the second attempt and is valid for five years.\n\nPhysical asset management\n\n* CMRP – Certified Maintenance and Reliability Professional (CMRP) \n* MMP – Maintenance Management Professional \n\nPlumbing\n\n* ASSE (American Society of Sanitary Engineering) American Society of Sanitary Engineering (ASSE) website. – an ANSI Accredited standards developer and certification body\n\nProject management\n\n* PMP Project Management Professional conferred by the PMI (Project Management Institute);\n* SCPM Stanford Certified Project Manager conferred by the Stanford University as a result of completing the SAPM (Stanford Advanced Project Management Certificate Program)\n* PgMP Program Management Professional conferred by the PMI (Project Management Institute)\n* CAPM Certified Associate in Project Management conferred by the PMI (Project Management Institute)\n* PMI – ACP Project Management Institute - Agile Certified Practitioner conferred by the PMI (Project Management Institute)\n\nPublic relations\n\nIn the USA, the Universal Accreditation Board, an organization composed of the Public Relations Society of America, the Agricultural Relations Council, the National School Public Relations Association, the Religious Communicators Council and other public relations professional societies, administers the Accreditation in Public Relations (APR), a voluntary certification program for public relations practitioners.\n\nRenewable energy\n\n* EVT (Electronic Vehicle Technician) conferred by Electronics Technicians Association\n* PVI (Photovoltaic Installer) conferred by Electronics Technicians Association\n* SWI (Small Wind Installer) conferred by Electronics Technicians Association\n\nSales\n\n* SCPS (SMEI Certified Professional Salesperson) conferred by Sales & Marketing Executives International, Inc.\n* CSE (Certified Sales Executive) conferred by Sales & Marketing Executives International, Inc.\n* CSP (Certified Sales Professional) conferred by Canadian Professional Sales Association in Canada and by MRERF's Institute for Professional Advancement - IPA in the U.S. and Mexico – this certification provides skills to improve sales in all industries and all channels.\n\nSecurity\n\n* ASIS International administers the Certified Protection Professional - Board-Certified in Security Management (CPP)\n* ASIS International administers the Physical Security Professional, Board-Certified (PSP)\n* ASIS International administers the Professional Certified Investigator, Board-Certified (PCI)\n* Association of Certified Fraud Examiners administers the Certified Fraud Examiner (CFE)\n* International Foundation of Protection Officers administers the Certified Protection Officer (CPO)\n* Society of Payment Security Professionals (SPSP) administers the Certified Payment-Card Industry Security Manager\n* Certified Information Systems Security Professional (CISSP) from ISC2.org\n* National Sheriffs' Association administers the Certified Homeland Protection Professional (CHPP) Certification\n* Associated Locksmiths of America administers the Registered Locksmith (RL) Certification\n* Associated Locksmiths of America administers the Certified Registered Locksmith (CRL) Certification\n* Associated Locksmiths of America administers the Certified Professional Locksmith (CPL) Certification\n* Associated Locksmiths of America administers the Certified Master Locksmith (CML) Certification\n* Associated Locksmiths of America administers the Certified Professional Safe Technician (CPS) Certification\n* Associated Locksmiths of America administers the Certified Master Safe Technician (CMST) Certification\n* Security Industry Association administers the Certified Security Project Manager (CSPM) Certification\n\nSpeaking\n\nConferred by the National Speakers Association, the Certified Speaking Professional (CSP) is the speaking profession's international measure of professional platform competence. This certification is awarded by the National Speakers Association. Only about 10% of the speakers who belong to the Global Speakers Federation (GSF) hold this designation. Those who have earned their certification have done so by demonstrating a track record of experience and expertise.\n\nSupply chain management\n\nSupply chain management (SCM) is the management of the flow of goods. It includes the movement and storage of raw materials, work-in-process inventory, and finished goods from point of origin to point of consumption. Interconnected or interlinked networks, channels and node businesses are involved in the provision of products and services required by end customers in a supply chain.[2] Supply chain management has been defined as the \"design, planning, execution, control, and monitoring of supply chain activities with the objective of creating net value, building a competitive infrastructure, leveraging worldwide logistics, synchronizing supply with demand and measuring performance globally.\n\nOther applications\n\n* The American Academy of Environmental Engineers board certifies licensed environmental engineers (Board Certified Environmental Engineer—BCEE) and unlicensed environmental engineering practitioners (Board Certified Environmental Engineering Member—BCEEM) for those with a degree in engineering and at least 8 years of practice and responsible charge in environmental engineering.\n* The American Institute of Floral Designers offers two levels of certification for individuals in the field of professional floral design. Certified Floral Designer (CFD) and accredited membership (AIFD) are both designed to establish a gold standard in professional floral design while ensuring the certified individual maintains that standard through continued education credits. While many state-level floral associations also offer state-level floral design certification known as Master Florist certification, AIFD certification is the highest level of professional floral design awarded in the United States.\n* The Canadian National Association of Infrared Imaging Technologists (AIIT) awards the IIT designation to infrared thermographers who meet the training standards regulated by the association. AIIT aims to ensure service delivery standards and public trust through regulating training standards, codes of conduct and continuing education.\n* The Society for Technical Communication (STC) is planning to create a certification program for technical writers in 2011.\n* The International Society of Arboriculture (ISA) is the International body who administers ANSI-accredited certification programs for arborists and tree care specialists. Certifications vary from Tree Worker to Certified Arborist to Master Arborist.\n\nCriticisms\n\nPolitical commentator have criticized professional or occupational licensing, especially medical and legal licensing, for restricting the supply of services and therefore making them more expensive, often putting them out of reach of the poor.[http://reason.com/blog/2010/09/17/professional-licensing-watch-l Professional Licensing Watch, Liberal Division – Hit & Run]. Reason.com (2010-09-17). Retrieved on 2013-10-05.\n\nThe proliferation of IT certifications (both offered and attained) has led some technologists to question their value. Proprietary content that has been distributed on the Internet allows some to gain credentials without the implied depth or breadth of expertise.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Professional certification" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6251" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Professional certification, trade certification, or professional designation, often called simply certification or qualification, is a designation earned by a person to assure qualification to perform a job or task. Not all certifications that use post-nominal letters are an acknowledgement of educational achievement, or an agency appointed to safeguard the public interest.\n\nOverview\n\nA certification is a third-party attestation of an individual's level of knowledge or proficiency in a certain industry or profession. They are granted by authorities in the field, such as professional societies and universities, or by private certificate-granting agencies. Most certifications are time-limited; some expire after a period of time (e.g., the lifetime of a product that required certification for use), while others can be renewed indefinitely as long as certain requirements are met. Renewal usually requires ongoing education to remain up-to-date on advancements in the field, evidenced by earning the specified number of continuing education credits (CECs), or continuing education units (CEUs), from approved professional development courses.\n\nMany certification programs are affiliated with professional associations, trade organizations, or private vendors interested in raising industry standards. Certificate programs are often created or endorsed by professional associations, but are typically completely independent from membership organizations. Certifications are very common in fields such as aviation, construction, technology, environment, and other industrial sectors, as well as healthcare, business, real estate, and finance.\n \nAccording to The Guide to National Professional Certification Programs (1997) by Phillip Barnhart, \"certifications are portable, since they do not depend on one company's definition of a certain job\" and they provide protential employers with \"an impartial, third-party endorsement of an individual's professional knowledge and experience\".Phillip Barnhart, [https://books.google.com/books?id3tY8Fck5UVkC&lpg\nPP1&dqthe%20guide%20to%20national%20professional%20certification%20programs&pg\nPA2 The Guide to National Professional Certification Programs] (1997), HRD Press.  Retrieved electronically 7 July 2009.\n\nCertification is different from professional licensure. In the United States, licenses are typically issued by state agencies, whereas certifications are usually awarded by professional societies or educational institutes. Obtaining a certificate is voluntary in some fields, but in others, certification from a government-accredited agency may be legally required to perform certain jobs or tasks. In other countries, licenses are typically granted by professional societies or universities and require a certificate after about three to five years and so on thereafter. The assessment process for certification may be more comprehensive than that of licensure, though sometimes the assessment process is very similar or even the same, despite differing in terms of legal status.\n\nThe American National Standards Institute (ANSI) defines the standard for being a certifying agency as meeting the following two requirements:\n# Delivering an assessment based on industry knowledge that is independent from training courses or course providers\n# Granting a time-limited credential to anyone who meets the assessment standards\n\nThe Institute for Credentialing Excellence (ICE) is a U.S.-based organization that sets standards for the accreditation of personnel certification and certificate programs based on the Standards for Educational and Psychological Testing, a joint publication of the American Educational Research Association (AERA), the American Psychological Association (APA), and the National Council on Measurement in Education (NCME). Many members of the Association of Test Publishers (ATP) are also certification organizations.\n\nTypes of certifications\n\nThere are three general types of certification. Listed in order of development level and portability, they are: corporate (internal), product-specific, and profession-wide.\n\nCorporate, or \"internal\" certifications, are made by a corporation or low-stakes organization for internal purposes. For example, a corporation might require a one-day training course for all sales personnel, after which they receive a certificate. While this certificate has limited portability – to other corporations, for example – it is the most simple to develop.\n\nProduct-specific certifications are more involved, and are intended to be referenced to a product across all applications. This approach is very prevalent in the information technology (IT) industry, where personnel are certified on a version of software or hardware. This type of certification is portable across locations (for example, different corporations that use that software), but not across other products. Another example could be the certifications issued for shipping personnel, which are under international standards even for the recognition of the certification body, under the International Maritime Organization (IMO).\n\nThe most general type of certification is profession-wide. Certification in the medical profession is often offered by particular specialties. In order to apply professional standards, increase the level of practice, and protect the public, a professional organization might establish a certification. This is intended to be portable to all places a certified professional might work. Of course, this generalization increases the cost of such a program; the process to establish a legally defensible assessment of an entire profession is very extensive. An example of this is a Certified Public Accountant (CPA), which would not be certified for just one corporation or one piece of accountancy software but for general work in the profession.\n\nProfessional certificates awarded by universities\n\nMany universities grant professional certificates as an award for the completion of an educational program. The curriculum of a professional certificate is most often in a focused subject matter. Many professional certificates have the same curriculum as master's degrees in the same subject. Many other professional certificates offer the same courses as master's degrees in the same subject, but require the student to take fewer total courses to complete the program. Some professional certificates have a curriculum that more closely resembles a baccalaureate major in the same field.  The typical professional certificate program is between 200–300 class-hours in size. It is uncommon for a program to be larger or smaller than that. Most professional certificate programs are open enrollment, but some have admissions processes. A few universities put some of their professional certificates into a subclass they refer to as advanced professional certificates.\n\nSome of the more commonly offered professional certificates include:\n* Professional Certificate in Accounting (PCA)\n* Professional Certificate in Contract Management (PCCM)\n* Professional Certificate in Customer Relationship Management (PCCRM)\n* Professional Certificate in Facility Management (PCFM)\n* Professional Certificate in Financial Planning (PCFP)\n* Professional Certificate in Graphic Design (PCGD)\n* Professional Certificate in Human Resources (PCHR)\n* Professional Certificate in Marketing (PCM)\n* Professional Certificate in Paralegal Studies (PCPS)\n* Professional Certificate in Project Management (PCPM)\n* Professional Certificate in Supply Chain Management (PCSCM)\n* Professional Certificate in Store Management (PCSM)\n* Professional Certificate in Materials Management (PCMM)\n* Professional Certificate in Technical Communication (PCTC)\n\nAdvanced professional certificate\n\nAdvanced professional certificates are professional credentials designed to help professionals enhance their job performance and marketability in their respective fields. In many other countries, certificates are qualifications in higher education. In the United States, a certificate may be offered by an institute of higher education. These certificates usually signify that a student has reached a standard of knowledge of a certain vocational subject. Certificate programs can be completed more quickly than associate degrees and often do not have general education requirements.\n\nAn advanced professional certificate is a result of an educational process designed for individuals. Certificates are designed for both newcomers to the industry as well as seasoned professionals. Certificates are awarded by an educational program or academic institution. Completion of a certificate program indicates completion of a course or series of courses with a specific concentration that is different from an educational degree program. Course content for an advanced certificate is set forth through a variety of sources i.e. faculty, committee, instructors, and other subject matter experts in a related field. The end goal of an advanced professional certificate is so that professionals may demonstrate knowledge of course content at the end of a set period in time.\n\nInstitutions that offer advance professional certificates in various fields and industries include:\n*Georgetown University\n*Lesley University\n*New York University\n*St. John's University\n*Stanford University\n*University of San Francisco\n\nAreas of certification\n\nAccountancy, auditing and finance\n\nThere are many professional bodies for accountants and auditors throughout the world; some of them are legally recognized in their jurisdictions.\nPublic accountants are the accountancy and control experts that are legally certified in different jurisdictions to work in public practices, certifying accounts as statutory auditors, eventually selling advice and services to other individuals and businesses. Today, however, many work within private corporations, financial industry, and government bodies.\n\nAccounting and external auditing \n\nCf. Accountancy qualifications and regulation\n* CA (Chartered Accountant) conferred by Institutes of Chartered Accountants in Nepal.\n* ACA, FCA or CA (Chartered Accountant) conferred by Institutes of Chartered Accountants in various territories, namely the United Kingdom of Great Britain and Northern Ireland and the Republic of Ireland.\n* ACMA or FCMA (Associate or Fellow Chartered Management Accountant) conferred by the Chartered Institute of Management Accountants (UK)\n* Associate or Fellow Chartered Certified Accountant (ACCA or FCCA) conferred by Association of Chartered Certified Accountants (UK)\n* AFA or FFA (Associate or Fellow Incorporated Financial Accountant) conferred by the Institute of Financial Accountants (UK)\n* AAIA or FAIA (Associate or Fellow International Accountant) conferred by Association of International Accountants\n* MIPA or FIPA (Member or Fellow of the Institute of Public Accountants who use the designation \"Public Accountant\") conferred by the Institute of Public Accountants (Australia)\n* CPA (Certified Public Accountant) conferred by State Accountancy Boards in the USA, Hong-Kong, Australia...\n* CMA (Certified Management Accountant) conferred by Institute of Certified Management Accountants (ICMA in Australia), Institute of Management Accountants (IMA in US)\n* CCC (Chartered Cost Controllers) issued and conferred by the American Academy of Financial Management USA Certifying Board (AAFM)[http://www.investopedia.com/terms/a/american-academy-of-financial-management.asp AAFM], Investopedia Dictionary.\n\nInternal auditing and fraud combat \n\n* CIA (Certified Internal Auditor), CCSA;Certification in Control Self Assessment,CGAP;Certified Government Auditing Professional'CRMA;Certification in risk Management Assurance' QIAL Qualification in Internal Audit Leadership conferred by the worldwide recognised Institute of Internal Auditors (IIA) headquartered in Altamonte Springs Florida with chapters in many countries\n* CFE (Certified Fraud Examiner) conferred by the Association of Certified Fraud Examiners (ACFE) headquartered in Texas with chapters in many countries\n* CISA (Certified Information Systems Auditor) awarded by the Information Systems Audit and Control Association headquartered in the USA with chapters in many countries\n\nFinance \n\nInvestments \n\n* ASA (Accredited Senior Appraiser), AM (Accredited Member), and CEIV (Certified in Entity and Intangible Valuations) conferred by the American Society of Appraisers, CBV (Chartered Business Valuator) from Canadian Institute of Chartered Business Valuators.\n* CAIA (Chartered Alternative Investment Analyst) conferred by the CAIA Association\n* CFA (Chartered Financial Analyst) conferred by CFA Institute (CFAI)\n* CIIA (Certified International Investment Analyst) conferred by the Association of Certified International Investment Analysts (ACIIA)\n* PRM (Professional Risk Manager) conferred by Professional Risk Managers International (PRM)\n\nPersonal finance \n\n* CFP (Certified Financial Planner) conferred by Certified Financial Planner Board of Standards and Financial Planning Standards Board\n* CCP (Certified Credit Professional) issued to credit management professionals in Canada by the Credit Institute of Canada\n* EA (Enrolled Agent) by the Internal Revenue Service (IRS)\n\nPublic finance \n\n* CCMT (Certified California Municipal Treasurer) conferred by California Municipal Treasurers Association (CMTA)\n* CGAP (Certified Government Auditing Professional) conferred by the Institute of Internal Auditors, based on the US Government Auditing Standards (Yellow Book) and additionally on COSO, IIA standards and INTOSAI ISSAI standards recognized worldwide in public finance\n* CDFM (Certified Defense Financial Manager) conferred by American Society of Military Comptrollers (ASMC)\n* CFO (Certified Financial Officer) conferred by the Carl Vinson Institute of Government of the University of Georgia\n* CGFM (Certified Government Financial Manager) conferred by Association of Government Accountants (AGA)\n* CGAT (Certified Governmental Accounting Technician[http://www.gfoaa.org/cgatcert.html Certified Governmental Accounting Technician]), conferred by Government Finance Officers Association of Alabama\n* CGFO (Certified Government Finance Officer) conferred by Government Finance Officers Association of Texas (GFOAT)\n* CGFO (Certified Government Finance Officer), conferred by Florida Government Finance Officers Association (FGFOA)\n* CGFO (Certified Government Finance Officer) conferred by Louisiana Government Finance Officers Association\n* CMFO (Certified Municipal Finance Officer) conferred by Government Finance Officers of New Jersey, Rutgers University, and the State of New Jersey\n* CMFO (Certified Municipal Finance Officer) conferred by Tennessee Comptroller of the Treasury and the Municipal Technical Advisory Service\n* CPFO (Certified Public Finance Officer) conferred by Government Finance Officers Association\n* CPFA (Certified Public Finance Administrator) conferred by Association of Public Treasurers of the United States and Canada (APTUSC)\n* GFO (Government Finance Officer) conferred by Government Finance Officers Association of South Carolina (GFOASC)\n* North Carolina Local Governmental Finance Officer conferred by North Carolina Government Finance Officers Association and the North Carolina Association of County Finance Officers\n\nArchitecture\n\n* AIA (Member, American Institute of Architects) conferred by American Institute of Architects\n* FAIA (Fellow, American Institute of Architects) conferred by American Institute of Architects\n\nArchival Science, Information Privacy, and Records Management\n\n* CIP (Certified Information Professional) conferred by AIIM\n* CIPM (Certified Information Privacy Manager) conferred by International Association of Privacy Professionals\n* CIPP (Certified Information Privacy Professional) conferred by International Association of Privacy Professionals\n* CIPT (Certified Information Privacy Technologist) conferred by International Association of Privacy Professionals\n* CRA (Certified Records Analyst) conferred by Institute of Certified Records Managers\n* CRM (Certified Records Manager) conferred by Institute of Certified Records Managers\n* IGP (Information Governance Professional) conferred by ARMA International\n\nAviation\n\nAviators are certified through theoretical and in-flight examinations. Requirements for certifications are quite equal in most countries and are regulated by each National Aviation Authority. The existing certificates or pilot licenses are:\n* SPL (Sport Pilot License)conferred by the FAA (Federal Aviation Administration)\n* PPL (Private Pilot License) conferred by the FAA (Federal Aviation Administration) or JAA (Joint Aviation Authorities)\n* CPL (Commercial Pilot Licence) conferred by the FAA (Federal Aviation Administration) or JAA (Joint Aviation Authorities)\n* ATP (Airline Transport Pilot) conferred by the FAA (Federal Aviation Administration) or JAA (Joint Aviation Authorities)\n\nLicensing in these categories require not only examinations but also a minimum number of flight hours. All categories are available for Fixed-Wing Aircraft (airplanes) and Rotatory-Wing Aircraft (helicopters). Within each category, aviators may also obtain certifications in:\n* Instrument Flight Rules (IFR)\n* Multi-engine aircraft\n* Turbojet Engines\n* Jet Engines\n* Experimental aircraft\n* Amphibious aircraft\n* Seaplanes\nUsually, aviators must be certified also in their log books for the type and model of aircraft they are allowed to fly. Currency checks as well as regular medical check-ups with a frequency of 6 months, 12 months, or 36 months, depending on the type of flying permitted, are obligatory. An aviator can fly only if holding:\n* A valid pilot license\n* A valid medical certificate\n* Valid certifications for the type of aircraft and type of flight.\n\nIn Europe, the ANSP, ATCO & ANSP technicians are certified according to ESARRs [http://www.eurocontrol.int/src/public/standard_page/src_deliverables.html] (according to EU regulation 2096/2005 \"Common Requirements\").\n\nBiomedical\n\n* BMD (Biomedical Electronics Technician) conferred by Electronics Technicians Association\n* BIET (Biomedical Imaging Electronics Technician) conferred by Electronics Technicians Association\n\nBusiness\n\nChiropractic\n\nCommunications\n\nIn the United States, several communications certifications are conferred by the Electronics Technicians Association.\n\nComputer technology\n\nCertification is often used in the professions of software engineering and information technology.\n\n* CITP (Chartered IT Professional) conferred by British Computer Society, The Institution of Engineering and Technology and by other professional engineering institutions in the UK and commonwealth\n\nContract Management\n\nDance \n\nConferred by the International Dance Council CID at UNESCO, the International Certification of Dance Studies is awarded to students who have completed 150 hours of classes in a specific form of dance for Level 1. Another 150 hours are required for Level 2 and so on till Level 10. This is the only international certification for dance since the International Dance Council CID is the official body for all forms of dance; it is usually given in addition to local or national certificates, that is why it is colloquially called \"the dancer's passport\". Students cannot apply for this certification directly – they have to ask their school to apply on their behalf. This certification is awarded free of charge, there is no cost other than membership fees.\n\nInternational Dance Council CID at UNESCO administers the International Certification of Dance Studies.\n\nDentistry\n\nElectronics \n\nIn the United States, several electronics certifications are provided by the Electronics Technicians Association.\n\nEmergency management\n\nThe Federal Emergency Management Agency's EMI offers credentials and training opportunities for United States citizens. Students do not have to be employed by FEMA or be federal employees for some of the programs.\n* Executive Fire Officer Program (EFOP)  \n* Emergency Management Professional Program (EMPP)  \n* Master Exercise Practitioner Program (MEPP)  \n* Integrated Emergency Management Courses (IEMC)   \n* Disaster Field Training Operations (DFTO)   \n* Master Trainer Program (MTP)\n* Critical Infrastructure Security and Resilience \n* Virtual Table Top Exercise (VTTX) Series\n* Continuity Excellence Series, Level I and II\n* Professional Development Series (PDS) Credential\n* Advance Professional Series (APS) Credential\n\nEngineering\n\nProfessional engineering is any act of planning, designing, composing, measuring, evaluating, inspecting, advising, reporting, directing or supervising, or managing any of the foregoing, that requires the application of engineering principles and that concerns the safeguarding of life, health, property, economic interests, the public interest or the environment.\n* P.Eng. (Professional Engineer), conferred by provincial licensing bodies in Canada.\n* Ir. or P.Eng. (Professional Engineer), conferred by Board of Engineers Malaysia (BEM) in Malaysia.\n* PE (Professional Engineer), conferred by Pakistan Engineering Council (PEC) and state licensing bodies in the United States.\n* PE (Power Engineer), conferred by Safety Authority in Canada\n* EUR ING (European Engineer), conferred by the European Federation of National Engineering Associations (FEANI).\n* C.Eng. (Chartered Engineer), conferred by professional engineering institutions in the UK and commonwealth\n* SMIEEE (Senior member of the IEEE), a professional designation throughout all of the United States\n\nFacility Management\n\nFacility management can be defined as an aspect of engineering management science that deals with the planning, designing, coordination of space and maintenance of a built environment to enhance quality service management system. Service Quality System includes activities like security, maintenance, catering, and external as well as internal cleaning. In general, it is also the coordination and harmonization of various specialist disciplines to create the best possible working environment for staff.\n\nFacility management is an interdisciplinary field devoted to the coordination of space, infrastructure, people and organization, often associated with the administration of office blocks, arenas, schools, convention centers, shopping complexes, hospitals, hotels, etc. However, FM facilitates on a wider range of activities than just business services and these are referred to as non-core functions.\n\nWarehousing management\n\nA warehouse management system (WMS) is a part of the supply chain and primarily aims to control the movement and storage of materials within a warehouse and process the associated transactions, including shipping, receiving, putaway and picking. The systems also direct and optimize stock putaway based on real-time information about the status of bin utilization. A WMS monitors the progress of products through the warehouse. It involves the physical warehouse infrastructure, tracking systems, and communication between product stations.\n\nMore precisely, warehouse management involves the receipt, storage and movement of goods, (normally finished goods), to intermediate storage locations or to a final customer. In the multi-echelon model for distribution, there may be multiple levels of warehouses. This includes a central warehouse, a regional warehouses (serviced by the central warehouse) and potentially retail warehouses (serviced by the regional warehouses).\n\nEnvironment\n\n* CEnvP – Certified Environmental Practitioner of Australia and New Zealand (CEnvP)\n\nEnvironmental health\n\n* CPHI(C) – Certified Public Health Inspector (Canada)\n\nExplosive atmospheres\n\nIECEx covers the highly specialized field of explosion protection associated with the use of equipment in areas where flammable gases, liquids and combustible dusts may be present. This system provides the assurance that equipment is manufactured to meet safety standards, and that services such as installation, repair and overhaul also comply with IEC International Standards on safety. The United Nations, via UNECE (United Nations Economic Commission for Europe), recommends the IEC and IECEx as the world’s best practice model for the verification of conformity to International Standards. It published a “Common Regulatory Framework” encompassing the use of IEC International Standards developed by IEC TC (Technical Committee) 31: Equipment for explosive atmospheres, with proof of compliance demonstrated by IECEx.\n\nFiber optics and data cabling\n\n* RCDD (Registered Communications Distribution Designer) by BICSI\n* DCI (Data Cabling Installer) conferred by Electronics Technicians Association\n* FOI (Fiber Optics Installer) conferred by Electronics Technicians Association\n* FOT (Fiber Optics Technician) conferred by Electronics Technicians Association\n* FOT-OSP (Fiber Optics Technician-Outside Plant) conferred by Electronics Technicians Association\n* FOD (Fiber Optics Designer) conferred by Electronics Technicians Association\n* TTT (Termination and Testing Technician) conferred by Electronics Technicians Association\n\nGenealogy\n\nAG (Accredited Genealogist) conferred by the International Commission for the Accreditation of Professional Genealogists (ICAPGen).\nCG (Certified Genealogist) conferred by the Board for Certification of Genealogists (BCG).\nCGL (Certified Genealogical Lecturer) conferred by the Board for Certification of Genealogists (BCG).\n\nHealth leadership\n\n* CHE (Certified Health Executive) conferred by the Canadian College of Health Leaders (CCHL)\n\nHospitality and tourism\n\n* CHA (Certified Hotel Administrator) conferred by American Hotel & Lodging Association\n* CMP (Certified Meeting Professional) conferred by Convention Industry Council\n* CEM (Certified in Exhibition Management) conferred by International Association of Exhibitions and Events \n\nInformation quality\n\n* CDMP (Certified Data Management Professional) by the International Data Management Association.\n\nInsurance and risk management\n\nIn the United States, insurance professionals are licensed separately by each state. Many individuals seek one or more certifications to distinguish themselves from their peers. The most recognizable certifications are issued by five organizations:\n* American Institute For Chartered Property Casualty Underwriters (AICPCU)\n** Chartered Property Casualty Underwriter (CPCU)\n** Associate in Risk Management (ARM)\n** Associate in Commercial Underwriting (AU)\n** Accredited Adviser in Insurance (AAI)\n** Certified Authority on Workers' Compensation (CAWC)\n* American College of Financial Services\n** Chartered Life Underwriter (CLU)\n** Chartered Financial Consultant (ChFC)\n* International Center for Captive Insurance Education (ICCIE)\n** Associate in Captive Insurance (ACI)\n** Certificate in Captive Insurance (CCI)\n* National Alliance for Insurance Education & Research\n** Certified Insurance Counselor (CIC)\n** Certified Risk Manager (CRM)\n** Certified Insurance Service Representative (CISR)\n* National Association of Insurance and Financial Advisors in partnership with the College of Financial Planning\n** Life Underwriter Training Council Fellow (LUTCF)\n\nNational Association of Mutual Insurance Companies\n* Farm Mutual Director Certification (FMDC)\n* Professional Farm Mutual Manager (PFMM)\n\nNational Registry of Workers' Compensation Specialists\n* Registered Workers' Compensation Specialist (RWCS)\n\nProfessional Liability Underwriting Society (PLUS)\n* Registered Professional Liability Underwriter (RPLU)\n* Certified Risk Analyst (CRA) \n\nLanguage education\n\nTESOL is a large field of employment with widely varying degrees of regulation. Most provision worldwide is through the state school system of each individual country, and as such, the instructors tend to be trained primary- or secondary school teachers who are native speakers of the language of their pupils, and not of English. Though native speakers of English have been working in non-English speaking countries in this capacity for years, it was not until the last twenty-five years or so that there was any widespread focus on training particularly for this field. Previously, workers in this sort of job were anyone from backpackers hoping to earn some extra travel money to well-educated professionals in other fields doing volunteer work, or retired people. These sort of people are certainly still to be found, but there are many who consider TESOL their main profession.\n\nOne of the problems facing these full-time teachers is the absence of an international governing body for the certification or licensure of English language teachers. However, Cambridge University and its subsidiary body UCLES are pioneers in trying to get some degree of accountability and quality control to consumers of English courses, through their CELTA and DELTA programs. Trinity College London has equivalent programs, the CertTESOL and the LTCL DipTESOL. They offer initial certificates in teaching, in which candidates are trained in language awareness and classroom techniques, and given a chance to practice teaching, after which feedback is reported. Both institutions have as a follow-up a professional diploma, usually taken after a year or two in the field. Although the initial certificate is available to anyone with a high school education, the diploma is meant to be a post-graduate qualification and in fact can be incorporated into a master's degree program.\n\nLegal affairs\n\nAn increasing number of attorneys are choosing to be recognized as having special expertise in certain fields of law. According to the American Bar Association, a lawyer who is a certified specialist has been recognized by an independent professional certifying organization as having an enhanced level of skill and expertise, as well as substantial involvement in an established legal specialty. These organizations require a lawyer to demonstrate special training, experience and knowledge to ensure that the lawyer's recognition is meaningful and reliable. Lawyer conduct with regard to specialty certification is regulated by the states.\n\nNBLSC is an American Bar Association (ABA) accredited organization providing Board Certification for US Lawyers. Board Certification is a rigorous testing and approval process that officially recognizes the extensive education and courtroom experience of attorneys. NBLSC provides Board Certification for Trial Lawyers & Trial Attorneys, Civil Lawyers, Criminal Lawyers, Family Lawyers and Social Security Disability Lawyers.\n\nLogistics and transport\n\nLogistician is the profession in the logistics and transport sectors, including sea, air, land and rail modes. Professional qualification for logisticians usually carries post-nominal letters. Common examples include:\n* CPIM (Certified in Production and Inventory Management) conferred by APICS (Association for Operations Management)\n* CSCP (Certified Supply Chain Professional) conferred by APICS (Association for Operations Management)\n* CLTD (Certified in Logistics, Transportation and Distribution) conferred by APICS (Association for Operations Management)\n* SCOR-P (Supply Chain Operations Reference Professional) conferred by APICS (Association for Operations Management)\n* MILT (Member Institute of Logistics and Transport) conferred by The Chartered Institute of Logistics and Transport (CILT),\n* CMILT (Chartered Member, Institute of Logistics and Transport) conferred by The Chartered Institute of Logistics and Transport (CILT)\n* FCILT (Chartered Fellow, Institute of Logistics and Transport) conferred by The Chartered Institute of Logistics and Transport (CILT)\n* CPL/CTP conferred by Transport & Logistics Certification Council (TLCC) of Australia,\n* EJLog/ESLog/EMLog conferred by the European Logistics Association (ELA),\n* CML/CPL conferred by the International Society of Logistics (SOLE),\n* JrLog/Log/SrLog conferred by the China Federation of Logistics & Purchasing (CFLP),\n* FHKLA/PMHKLA conferred by the Hong Kong Logistics Association (HKLA),\nCanadian Society of Customs Brokers American. (CSCB),\n* CCLP (CITT-Certified Logistics Professional) conferred by the Canadian Institute of Traffic & Transportation (CITT),\n* PLog (Professional Logistician) conferred by the Canadian Professional Logistics Institute,\n* ACCL-AMI / ACCL-AMO / ACCL-ABM / ACCL-OBM conferred by the Allied Council for Commerce and Logistics (ACCL)\n* CPLCM, Certified Professional Logistics & Cargo Mediator, conferred and accredited by Academy of Professional Certification (APC)\n* CPCRM, Certified Professional in Cargo Risk Management & Mediation, conferred and accredited by Academy of Professional Certification (APC)\n\nMarketing\n\n* CME (Certified Marketing Executive), conferred by Sales & Marketing Executives International, Inc..\n\nMediation\n\n* CM, Certified Mediator or Court-Appointed Mediator, conferred and accredited by The Institute of Conflict Resolution and Communication (ICRC) and the Florida Supreme Court Certified County Court Training Program pursuant to the Florida Rules for Certified and Court-Appointed Mediators 10.100 (a).\n* ECM, Executive Certificate in Mediation, conferred and accredited by Academy of Professional Certification (APC)\n* PCM, Professional Certification in Mediation, conferred and accredited by Academy of Professional Certification (APC)\n* APCM, Advanced Professional Certification in Mediation, conferred and accredited by Academy of Professional Certification (APC)\n* CPMT, Certified Professional Mediation Trainer, conferred and accredited by Academy of Professional Certification (APC)\n* CPACM, Certified Professional Art & Cultural Mediator, conferred and accredited by Academy of Professional Certification (APC)\n* CPM, Certified Professional Mediator, conferred and mutually accredited by The Institute of Crisis & Risk Management (ICRM) or Academy of Professional Certification (APC)\n* PDCoM, Professional Diploma in Corporate Mediation, conferred and mutually accredited by The Institute of Crisis & Risk Management (ICRM) or Academy of Professional Certification (APC), with Hong Kong Productivity Council (HKPC)\n* CMA, Certified Mediation Assessor, conferred and mutually accredited by The Institute of Crisis & Risk Management (ICRM) or Academy of Professional Certification (APC)\n\nMinisters\n\nChurches have their own process of who may use various religious titles. Protestant churches typically require a Masters of Divinity, accreditation by the denomination and ordination by the local church in order for a minister to become a \"Reverend\". Those qualifications may or may not also give government authorization to solemnize marriages\n\nMedicine\n\nBoard certification is the process by which a physician in the United States documents by written, practical or computer based testing, illustrating a mastery of knowledge and skills that define a particular area of medical specialization. The American Board of Medical Specialties, a not-for-profit organization, assists 24 approved medical specialty boards in the development and use of standards in the ongoing evaluation and certification of physicians.\n\nMedical specialty certification in the United States is a voluntary process. While medical licensure sets the minimum competency requirements to diagnose and treat patients, it is not specialty specific.[http://www.abms.org/about_board_certification/means.aspx What Board Certification Means]. Abms.org. Retrieved on 5 October 2013. Board certification demonstrates a physician’s exceptional expertise in a particular specialty or sub-specialty of medical practice.\n\nPatients, physicians, health care providers, insurers and quality organizations regard certification as an important measure of a physician’s knowledge, experience and skills to provide quality health care within a given specialty.\n\nOther professional certifications include certifications such as medical licenses, Membership of the Royal College of Physicians, Fellowship of the Royal College of Physicians and Surgeons of Canada, nursing board certification, diplomas in social work. The Commission for Certification in Geriatric Pharmacy certifies pharmacists that are knowledgeable about principles of geriatric pharmacotherapy and the provision of pharmaceutical care to the elderly. Additional certifying bodies relating to the medical field include:\n* Royal Australian and New Zealand College of Radiologists\n* American College of Emergency Physicians\n* Royal Australasian College of Physicians\n* Fellowship of the Royal College of Surgeons\n* Membership of the College of Emergency Medicine\n* Joint Commission on Allied Health Personnel in Ophthalmology\n* American Registry for Diagnostic Medical Sonography\n\nMedical coding and billing\n\n* AHIMA (American Health Information Management Association)\n* AAPC \n* Medical Association of Billers \n\nPeer support\n\nNCPRP stands for “National Certified Peer Recovery Professional”, and the NCPRP credential and exam were developed in collaboration with the International Certification Board of Recovery Professionals (ICBRP) and is currently being administered by PARfessionals.\n\nPARfessionals is a professional organization and all of the available courses are professional development and pre-certification courses.\n\nThe NCPRP credential and exam focus primarily on the concept of peer recovery through mental health and addiction recovery. It has the main purpose of training student-candidates on how to become peer recovery professionals who can provide guidance, knowledge or assistance for individuals who have had similar experiences.\n\nThrough the support of the SJM Family Foundation, PARfessionals has developed the first globally recognized online training program for peer recovery professionals.\n\nEach student-candidate must complete several key steps which include initial registration; the pre-certification review course; and all applicable sections of the official application in order to become eligible to complete the final step, which is the NCPRP certification exam.\n\nThe NCPRP credential is obtained once a participant successfully passes the NCPRP certification exam by the second attempt and is valid for five years.\n\nPhysical asset management\n\n* CMRP – Certified Maintenance and Reliability Professional (CMRP) \n* MMP – Maintenance Management Professional \n\nPlumbing\n\n* ASSE (American Society of Sanitary Engineering) American Society of Sanitary Engineering (ASSE) website. – an ANSI Accredited standards developer and certification body\n\nProject management\n\n* PMP Project Management Professional conferred by the PMI (Project Management Institute);\n* SCPM Stanford Certified Project Manager conferred by the Stanford University as a result of completing the SAPM (Stanford Advanced Project Management Certificate Program)\n* PgMP Program Management Professional conferred by the PMI (Project Management Institute)\n* CAPM Certified Associate in Project Management conferred by the PMI (Project Management Institute)\n* PMI – ACP Project Management Institute - Agile Certified Practitioner conferred by the PMI (Project Management Institute)\n\nPublic relations\n\nIn the USA, the Universal Accreditation Board, an organization composed of the Public Relations Society of America, the Agricultural Relations Council, the National School Public Relations Association, the Religious Communicators Council and other public relations professional societies, administers the Accreditation in Public Relations (APR), a voluntary certification program for public relations practitioners.\n\nRenewable energy\n\n* EVT (Electronic Vehicle Technician) conferred by Electronics Technicians Association\n* PVI (Photovoltaic Installer) conferred by Electronics Technicians Association\n* SWI (Small Wind Installer) conferred by Electronics Technicians Association\n\nSales\n\n* SCPS (SMEI Certified Professional Salesperson) conferred by Sales & Marketing Executives International, Inc.\n* CSE (Certified Sales Executive) conferred by Sales & Marketing Executives International, Inc.\n* CSP (Certified Sales Professional) conferred by Canadian Professional Sales Association in Canada and by MRERF's Institute for Professional Advancement - IPA in the U.S. and Mexico – this certification provides skills to improve sales in all industries and all channels.\n\nSecurity\n\n* ASIS International administers the Certified Protection Professional - Board-Certified in Security Management (CPP)\n* ASIS International administers the Physical Security Professional, Board-Certified (PSP)\n* ASIS International administers the Professional Certified Investigator, Board-Certified (PCI)\n* Association of Certified Fraud Examiners administers the Certified Fraud Examiner (CFE)\n* International Foundation of Protection Officers administers the Certified Protection Officer (CPO)\n* Society of Payment Security Professionals (SPSP) administers the Certified Payment-Card Industry Security Manager\n* Certified Information Systems Security Professional (CISSP) from ISC2.org\n* National Sheriffs' Association administers the Certified Homeland Protection Professional (CHPP) Certification\n* Associated Locksmiths of America administers the Registered Locksmith (RL) Certification\n* Associated Locksmiths of America administers the Certified Registered Locksmith (CRL) Certification\n* Associated Locksmiths of America administers the Certified Professional Locksmith (CPL) Certification\n* Associated Locksmiths of America administers the Certified Master Locksmith (CML) Certification\n* Associated Locksmiths of America administers the Certified Professional Safe Technician (CPS) Certification\n* Associated Locksmiths of America administers the Certified Master Safe Technician (CMST) Certification\n* Security Industry Association administers the Certified Security Project Manager (CSPM) Certification\n\nSpeaking\n\nConferred by the National Speakers Association, the Certified Speaking Professional (CSP) is the speaking profession's international measure of professional platform competence. This certification is awarded by the National Speakers Association. Only about 10% of the speakers who belong to the Global Speakers Federation (GSF) hold this designation. Those who have earned their certification have done so by demonstrating a track record of experience and expertise.\n\nSupply chain management\n\nSupply chain management (SCM) is the management of the flow of goods. It includes the movement and storage of raw materials, work-in-process inventory, and finished goods from point of origin to point of consumption. Interconnected or interlinked networks, channels and node businesses are involved in the provision of products and services required by end customers in a supply chain.[2] Supply chain management has been defined as the \"design, planning, execution, control, and monitoring of supply chain activities with the objective of creating net value, building a competitive infrastructure, leveraging worldwide logistics, synchronizing supply with demand and measuring performance globally.\n\nOther applications\n\n* The American Academy of Environmental Engineers board certifies licensed environmental engineers (Board Certified Environmental Engineer—BCEE) and unlicensed environmental engineering practitioners (Board Certified Environmental Engineering Member—BCEEM) for those with a degree in engineering and at least 8 years of practice and responsible charge in environmental engineering.\n* The American Institute of Floral Designers offers two levels of certification for individuals in the field of professional floral design. Certified Floral Designer (CFD) and accredited membership (AIFD) are both designed to establish a gold standard in professional floral design while ensuring the certified individual maintains that standard through continued education credits. While many state-level floral associations also offer state-level floral design certification known as Master Florist certification, AIFD certification is the highest level of professional floral design awarded in the United States.\n* The Canadian National Association of Infrared Imaging Technologists (AIIT) awards the IIT designation to infrared thermographers who meet the training standards regulated by the association. AIIT aims to ensure service delivery standards and public trust through regulating training standards, codes of conduct and continuing education.\n* The Society for Technical Communication (STC) is planning to create a certification program for technical writers in 2011.\n* The International Society of Arboriculture (ISA) is the International body who administers ANSI-accredited certification programs for arborists and tree care specialists. Certifications vary from Tree Worker to Certified Arborist to Master Arborist.\n\nCriticisms\n\nPolitical commentator have criticized professional or occupational licensing, especially medical and legal licensing, for restricting the supply of services and therefore making them more expensive, often putting them out of reach of the poor.[http://reason.com/blog/2010/09/17/professional-licensing-watch-l Professional Licensing Watch, Liberal Division – Hit & Run]. Reason.com (2010-09-17). Retrieved on 2013-10-05.\n\nThe proliferation of IT certifications (both offered and attained) has led some technologists to question their value. Proprietary content that has been distributed on the Internet allows some to gain credentials without the implied depth or breadth of expertise. Professional certification. http://en.wikipedia.org/?curid=6251."
  }
}
